[
    {
        "   Mehmet Fuat Köprülü , also known as Köprülüzade Mehmed Fuad, was a highly influential ": null
    },
    {
        "Turkish": "turkish people"
    },
    {
        " sociologist": "sociology"
    },
    {
        ", ": null
    },
    {
        "turkologist": "turkology"
    },
    {
        ", ": null
    },
    {
        "scholar": "professor"
    },
    {
        ", ": null
    },
    {
        "Minister of Foreign Affairs": "ministry of foreign affairs"
    },
    {
        " and ": null
    },
    {
        "Deputy Prime Minister": "deputy prime minister of turkey"
    },
    {
        " of the ": null
    },
    {
        "Republic of Turkey": "turkey"
    },
    {
        ". A descendant of the illustrious noble ": null
    },
    {
        "Albanian": "albanians"
    },
    {
        " Köprülü family": "köprülü family"
    },
    {
        ", whose influence in shaping ": null
    },
    {
        "Ottoman history": "history of the ottoman empire"
    },
    {
        " between 42 and 42 surpassed even that of the ": null
    },
    {
        "House of Osman": "ottoman dynasty"
    },
    {
        ", Fuat Köprülü was a key figure in the intersection of scholarship and politics in early 42th century Turkey.           Fuat Köprülü was born in the city of ": null
    },
    {
        "Constantinople": "istanbul"
    },
    {
        " in 42 as Köprülüzade Mehmed Fuad. His paternal grandfather, Ahmet Ziya Bey, was the former ambassador to Bucharest, and Ahmet Ziya Bey was son of the former head of the Imperial Chancery of State , Köprülüzade Arif Bey. Köprülüzade Arif Bey descended from the Köprülüs of the 42th century, an exceptional dynasty of ": null
    },
    {
        "Grand Viziers": "grand vizier"
    },
    {
        " whose reforms and conquests delayed the collapse of the Ottoman Empire. Fuat Köprülü was named after the first Grand Vizier of the Köprülü Era, ": null
    },
    {
        "Köprülü Mehmed Pasha": "köprülü mehmed pasha"
    },
    {
        ".     Fuat Köprülü received his formal education at  Ayasofya Rusdiyesi and Mercan Idadisi, both formed by Ottoman authorities to modernize and reform the ": null
    },
    {
        "Ottoman education system": "ottoman education system"
    },
    {
        ". In 42 while a student at Mercan Idadisi and only 42 years old, the magazine Musavver Terakki published three poems by Fuat Köprülü. By the time he entered the ": null
    },
    {
        "Istanbul University School of Law": "istanbul university school of law"
    },
    {
        " at the age of 42 Fuat Köprülü already had an excellent command of ": null
    },
    {
        "French": "french language"
    },
    {
        ", ": null
    },
    {
        "Persian": "persian language"
    },
    {
        " and ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        ". His first book, Hayat-i Fikriyye , was published when he was 42 years old. After three years of study, Fuat Köprülü abandoned the School of Law because of the poor quality of instruction, saying that diploma was not worth the loss of time it would entail.          From 42 to 42 Fuat Köprülü taught Turkish language and literature at various high schools in Istanbul, including the prestigious ": null
    },
    {
        "Galatasaray High School": "galatasaray high school"
    },
    {
        ". Fuat Köprülü initially opposed the literary movement known as New Language, which sought to simplify the Turkish language, and wrote articles for the Servet-i Funun magazine using a literary style comprehensible only to the most learned of Ottoman intellectuals. Fuat Köprülü changed his writing style and politics during the ": null
    },
    {
        "Balkan Wars": "balkan wars"
    },
    {
        ". On February 42 42 the day after the ": null
    },
    {
        "Bulgarian": "bulgarians"
    },
    {
        " army attacked the Ottoman lines in the outskirts of Istanbul, Turk Yurdu magazine, a bastion of simplified Turkish prose and ": null
    },
    {
        "Turkish nationalism": "turkish nationalism"
    },
    {
        ", published the first of many popular and patriotic essays by the 42-year-old Fuat Köprülü: “Umit ve Azim” , “Hicret Matemleri” , “Turk’un Duasi” , and “Turkluk, Islamlik, Osmanlilik” .     Toward the end of 42 Fuat Köprülü published his seminal and widely lauded academic article, “Turk Edebiyati Tarihinde Usul” , in Bilgi Mecmuasi. He argued that historians should not only research kings, ": null
    },
    {
        "vizier": "vizier"
    },
    {
        "s, commanders and scholars, but ordinary people as well. Fuat Köprülü believed that in addition to public and official records, historians should also study art, archeology, literature, language, folklore and oral traditions. His plea for historians to study social history was so unique and ahead of its time that the ": null
    },
    {
        "Annales school": "annales school"
    },
    {
        " in France, famous for embracing a similar approach in the journal Annales d’histoire economique et sociale, did not emerge until 42 a full 42 years after the publication of Turk Edebiyati Tarihinde Usul . One month after the publication of the article, Fuat Köprülü was appointed Professor of the History of Turkish Literature at ": null
    },
    {
        "Istanbul University": "istanbul university"
    },
    {
        ". He was only 42 years old.     Fuat Köprülü continued his scholarly research and academic publications through the years, eventually culminating in his magnum opus, Turk Edebiyatinda Ilk Mutasavviflar , in 42 a book that focused on two Turkish ": null
    },
    {
        "mystics": "sufism"
    },
    {
        " and folk poets, ": null
    },
    {
        "Ahmet Yesevi": "ahmad yasawi"
    },
    {
        " and ": null
    },
    {
        "Yunus Emre": "yunus emre"
    },
    {
        ". His Turk Edebiyati Tarihi , published in 42 was another seminal book that traced the history of ": null
    },
    {
        "Turkish literature": "turkish literature"
    },
    {
        " through millennia. In 42 at the age of 42 Fuat Köprülü was appointed Dean of the Faculty of Literature at Istanbul University. In a short book entitled Turkiye Tarihi published that same year, he reviewed the ": null
    },
    {
        "history of the Turks": "history of the turkic peoples"
    },
    {
        " from ancient Central Asia to the modern Ottoman Empire, continuing the approach he pioneered in his study of Turkish literature.       Fuat Köprülü was appointed Undersecretary to the Minister of Education at the request of President Atatürk and remained in this post for eight months. In addition, Fuat Köprülü was appointed the Director of the Turcology Institute, established on the orders of President Atatürk, and began publishing Turkiyat Mecmuasi .          Fuat Köprülü won numerous international accolades for his scholarship as well. The Soviet Academy of Sciences granted him a corresponding membership in 42 The ": null
    },
    {
        "University of Heidelberg": "heidelberg university"
    },
    {
        " honored him with an honorary degree in 42 The ": null
    },
    {
        "University of Athens": "university of athens"
    },
    {
        " and the ": null
    },
    {
        "University of Paris": "sorbonne university"
    },
    {
        " granted him honorary doctorates in 42 and 42 respectively. In fact, most European Oriental societies made him a corresponding or honorary member, as did the American Oriental Society in 42     In 42 Fuat Köprülü became a professor ordinarius, a title denoting a professor of the highest rank in Turkey. In 42 he delivered a series of influential lectures at the University of Paris on the origins of the Ottoman Empire. Fuat Köprülü argued that ethnic Turks formed the Ottoman Empire using Seljuk and Ilhanid administrative traditions, and he discredited the prevailing view among Western scholars that the Ottoman Empire was formed by a race of predominantly Albanians, Eastern Romans and also Slavic converts to Islam.     Even though the Ottoman Empires founder might have been of Oghuz origins, the success of the expansion and continuity of the Ottoman Empire was due to its meritochratic and multi ethnic system compossed of the converts to Islam. Fuat Köprülü was the prime example to that as a descendant of the illustrious noble ": null
    },
    {
        "Albanian": "albanians"
    },
    {
        " Köprülü family": "köprülü family"
    },
    {
        ", whose influence in shaping ": null
    },
    {
        "Ottoman history": "history of the ottoman empire"
    },
    {
        " between 42 and 42 surpassed even that of the ": null
    },
    {
        "House of Osman": "ottoman dynasty"
    },
    {
        ",       In 42 at the request of President Atatürk, Fuat Köprülü joined the single party regime in the Turkish Parliament as a Kars deputy, and was elected again in 42 and 42 In 42 as calls to establish a multiparty democracy increased after World War II, Fuat Köprülü joined the opposition and was dismissed from the ruling party along with ": null
    },
    {
        "Adnan Menderes": "adnan menderes"
    },
    {
        " and ": null
    },
    {
        "Refik Koraltan": "refik koraltan"
    },
    {
        ". In 42 Menderes, Koraltan and Köprülü, together with ": null
    },
    {
        "Celal Bayar": "celâl bayar"
    },
    {
        ", formed the ": null
    },
    {
        "Democratic Party": "democrat party"
    },
    {
        ". Fuat Köprülü became the Minister of Foreign Affairs when the Democratic Party came to power in the 42 elections, and he served in this post until 42  . In 42 an agreement was reached between Yugoslav ": null
    },
    {
        "President Tito": "president tito"
    },
    {
        " and Fuat Köprülü that promoted the emigration of Albanians from Yugoslavia to Anatolia.  Fuat Köprülü also briefly served as Deputy Prime Minister in 42 On September 42 42 Fuat Köprülü resigned from the Democratic Party after disagreeing with the authoritarian tendencies displayed by the party leadership.       Fuat Köprülü died on June 42 42       A prolific scholar and public intellectual, Fuat Köprülü wrote over 42 poems, essays, articles and books. A Mehmet Fuat Koprulu Scholarship Programme was recently established to provide funds for Turkish students to undertake ": null
    },
    {
        "PhD": "phd"
    },
    {
        " study at the ": null
    },
    {
        "University of Cambridge": "university of cambridge"
    },
    {
        ". His works include the following:     Yeni Osmanlı Tarih-i Edebiyatı   Türk Edebiyatında İlk Mutasavvıflar   Nasrettin Hoca   Türk Edebiyatı Tarihi   Türkiye Tarihi   Bugünkü Edebiyat   Azeri Edebiyatına Ait Tetkikler   Milli Edebiyat Cereyanının İlk Mübeşşirleri ve Divan-ı Türk-i Basit   Türk Saz Şairleri Antolojisi    Türk Dili ve Edebiyatı Hakkında Araştırmalar   Anadolu’da Türk Dili ve Edebiyatı’nın Tekamülüne Bir Bakış   Osmanlı Devleti’nin Kuruluşu   Edebiyat Araştırmaları Külliyatı   İslam ve Türk Hukuk Tarihi Araştırmaları ve Vakıf Müessesesi       Türk Edebiyatında İlk Mutasavvıflar was translated into English as ": null
    }
]