[
    {
        "      Meitnerium is a ": null
    },
    {
        "synthetic": "synthetic element"
    },
    {
        " chemical element": "chemical element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "symbol"
    },
    {
        " Mt and ": null
    },
    {
        "atomic number": "atomic number"
    },
    {
        " 109. It is an extremely ": null
    },
    {
        "radioactive": "radioactive"
    },
    {
        " synthetic element": "synthetic element"
    },
    {
        " . The most stable known isotope, meitnerium-278, has a ": null
    },
    {
        "half-life": "half-life"
    },
    {
        " of 4.5  seconds, although the unconfirmed meitnerium-282 may have a longer half-life of 67  seconds. The ": null
    },
    {
        "GSI Helmholtz Centre for Heavy Ion Research": "gsi helmholtz centre for heavy ion research"
    },
    {
        " near ": null
    },
    {
        "Darmstadt": "darmstadt"
    },
    {
        ", Germany, first created this element in 1982. It is named after ": null
    },
    {
        "Lise Meitner": "lise meitner"
    },
    {
        ".     In the ": null
    },
    {
        "periodic table": "periodic table"
    },
    {
        ", meitnerium is a ": null
    },
    {
        "d-block": "d-block"
    },
    {
        " transactinide element": "transactinide element"
    },
    {
        ". It is a member of the ": null
    },
    {
        "7th period": "period 7 element"
    },
    {
        " and is placed in the ": null
    },
    {
        "group 9 element": "group 9 element"
    },
    {
        "s, although no chemical experiments have yet been carried out to confirm that it behaves as the heavier ": null
    },
    {
        "homologue": "homology"
    },
    {
        " to ": null
    },
    {
        "iridium": "iridium"
    },
    {
        " in group 9 as the seventh member of the 6d series of ": null
    },
    {
        "transition metal": "transition metal"
    },
    {
        "s. Meitnerium is calculated to have similar properties to its lighter homologues, ": null
    },
    {
        "cobalt": "cobalt"
    },
    {
        ", ": null
    },
    {
        "rhodium": "rhodium"
    },
    {
        ", and iridium.              Meitnerium was ": null
    },
    {
        "first synthesized": "discovery of the chemical elements"
    },
    {
        " on August 29, 1982 by a German research team led by ": null
    },
    {
        "Peter Armbruster": "peter armbruster"
    },
    {
        " and ": null
    },
    {
        "Gottfried Münzenberg": "gottfried münzenberg"
    },
    {
        " at the ": null
    },
    {
        "Institute for Heavy Ion Research": "gesellschaft für schwerionenforschung"
    },
    {
        " in ": null
    },
    {
        "Darmstadt": "darmstadt"
    },
    {
        ".  The team bombarded a target of ": null
    },
    {
        "bismuth-209": "bismuth-209"
    },
    {
        " with accelerated nuclei of ": null
    },
    {
        "iron": "iron"
    },
    {
        "-58 and detected a single atom of the ": null
    },
    {
        "isotope": "isotope"
    },
    {
        " meitnerium-266:    : +  →  +      This work was confirmed three years later at the ": null
    },
    {
        "Joint Institute for Nuclear Research": "jinr"
    },
    {
        " at ": null
    },
    {
        "Dubna": "dubna"
    },
    {
        " .          Using ": null
    },
    {
        "Mendeleevs nomenclature for unnamed and undiscovered elements": "mendeleevs predicted elements"
    },
    {
        ", meitnerium should be known as eka- iridium . In 1979, during the ": null
    },
    {
        "Transfermium Wars": "transfermium wars"
    },
    {
        " , IUPAC published recommendations according to which the element was to be called unnilennium ,  a ": null
    },
    {
        "systematic element name": "systematic element name"
    },
    {
        " as a ": null
    },
    {
        "placeholder": "placeholder name"
    },
    {
        ", until the element was discovered and a permanent name was decided on. Although widely used in the chemical community on all levels, from chemistry classrooms to advanced textbooks, the recommendations were mostly ignored among scientists in the field, who either called it element 109 , with the symbol of E109,  or even simply 109, or used the proposed name meitnerium .     The naming of meitnerium was discussed in the ": null
    },
    {
        "element naming controversy": "transfermium wars"
    },
    {
        " regarding the names of elements 104 to 109, but meitnerium was the only proposal and thus was never disputed. The name meitnerium was suggested by the GSI team in September 1992 in honor of the Austrian physicist ": null
    },
    {
        "Lise Meitner": "lise meitner"
    },
    {
        ", a co-discoverer of ": null
    },
    {
        "protactinium": "protactinium"
    },
    {
        " ,      and one of the discoverers of ": null
    },
    {
        "nuclear fission": "nuclear fission"
    },
    {
        ".  In 1994 the name was recommended by ": null
    },
    {
        "IUPAC": "iupac"
    },
    {
        ",  and was officially adopted in 1997.  It is thus the only element named specifically after a non-mythological woman . Meitnerium is named for the Austrian physicist Lise Meitner. in  in . Retrieved August 14, 2015.          Meitnerium has no stable or naturally occurring isotopes. Several radioactive isotopes have been synthesized in the laboratory, either by fusing two atoms or by observing the decay of heavier elements. Eight different isotopes of meitnerium have been reported with atomic masses 266, 268, 270, and 274–278, two of which, meitnerium-268 and meitnerium-270, have known but unconfirmed ": null
    },
    {
        "metastable state": "metastable state"
    },
    {
        "s. A ninth isotope with atomic mass 282 is unconfirmed. Most of these decay predominantly through alpha decay, although some undergo spontaneous fission.           All meitnerium isotopes are extremely unstable and radioactive; in general, heavier isotopes are more stable than the lighter. The most stable known meitnerium isotope, 278 Mt, is also the heaviest known; it has a half-life of 4.5  seconds. The unconfirmed 282 Mt is even heavier and appears to have a longer half-life of 67  seconds. The isotopes 276 Mt and 274 Mt have half-lives of 0.45 and 0.44  seconds respectively. The remaining five isotopes have half-lives between 1 and 20  milliseconds.     The isotope 277 Mt, created as the final decay product of 293 Ts for the first time in 2012, was observed to undergo ": null
    },
    {
        "spontaneous fission": "spontaneous fission"
    },
    {
        " with a half-life of 5 milliseconds. Preliminary data analysis considered the possibility of this fission event instead originating from 277 Hs, for it also has a half-life of a few milliseconds, and could be populated following undetected ": null
    },
    {
        "electron capture": "electron capture"
    },
    {
        " somewhere along the decay chain.   This possibility was later deemed very unlikely based on observed ": null
    },
    {
        "decay energies": "decay energy"
    },
    {
        " of 281 Ds and 281 Rg and the short half-life of 277 Mt, although there is still some uncertainty of the assignment. Regardless, the instability to rapid fission of 277 Mt and 277 Hs is strongly suggestive of a region of instability for superheavy nuclei with ": null
    },
    {
        "N": "neutron number"
    },
    {
        " 168–170. The existence of this region, characterized by a decrease in ": null
    },
    {
        "fission barrier": "fission barrier"
    },
    {
        " height between the deformed ": null
    },
    {
        "shell closure": "nuclear shell model"
    },
    {
        " at N 162 and spherical shell closure at N 184, is consistent with theoretical models.         Meitnerium is the seventh member of the 6d series of ": null
    },
    {
        "transition metals": "transition metals"
    },
    {
        ". Since element 112  has been shown to be a ": null
    },
    {
        "group 12": "group 12 element"
    },
    {
        " metal, it is expected that all the elements from ": null
    },
    {
        "104": "rutherfordium"
    },
    {
        " to ": null
    },
    {
        "111": "roentgenium"
    },
    {
        " would continue a fourth transition metal series, with meitnerium as part of the ": null
    },
    {
        "platinum group metal": "platinum group metal"
    },
    {
        "s. Calculations on its ": null
    },
    {
        "ionization potentials": "ionization potential"
    },
    {
        "and ": null
    },
    {
        "atomic": "atomic radius"
    },
    {
        " and ": null
    },
    {
        "ionic radii": "ionic radius"
    },
    {
        " are similar to that of its lighter homologue ": null
    },
    {
        "iridium": "iridium"
    },
    {
        ", thus implying that meitneriums basic properties will resemble those of the other ": null
    },
    {
        "group 9 element": "group 9 element"
    },
    {
        "s, ": null
    },
    {
        "cobalt": "cobalt"
    },
    {
        ", ": null
    },
    {
        "rhodium": "rhodium"
    },
    {
        ", and iridium.     Prediction of the probable chemical properties of meitnerium has not received much attention recently. Meitnerium is expected to be a ": null
    },
    {
        "noble metal": "noble metal"
    },
    {
        ", and about as noble as ": null
    },
    {
        "silver": "silver"
    },
    {
        " . Based on the most stable oxidation states of the lighter group 9 elements, the most stable oxidation states of meitnerium are predicted to be the +6, +3, and +1 states, with the +3 state being the most stable in ": null
    },
    {
        "aqueous solution": "aqueous solution"
    },
    {
        "s. In comparison, rhodium and iridium show a maximum oxidation state of +6, while the most stable states are +4 and +3 for iridium and +3 for rhodium. The oxidation state +9, represented only by iridium in + , might be possible for its congener meitnerium in the nonafluoride and the + cation, although + is expected to be more stable than these meitnerium compounds. The tetrahalides of meitnerium have also been predicted to have similar stabilities to those of iridium, thus also allowing a stable +4 state. It is further expected that the maximum oxidation states of elements from bohrium to ": null
    },
    {
        "darmstadtium": "darmstadtium"
    },
    {
        " may be stable in the gas phase but not in aqueous solution.       Meitnerium is expected to be a solid under normal conditions and assume a ": null
    },
    {
        "face-centered cubic": "face-centered cubic"
    },
    {
        " crystal structure": "crystal structure"
    },
    {
        ", similarly to its lighter ": null
    },
    {
        "congener": "congener"
    },
    {
        " iridium. It should be a very heavy metal with a ": null
    },
    {
        "density": "density"
    },
    {
        " of around 37.4  g/cm 3 , which would be the second-highest of any of the 118 known elements, second only to that predicted for its neighbor ": null
    },
    {
        "hassium": "hassium"
    },
    {
        " . In comparison, the densest known element that has had its density measured, ": null
    },
    {
        "osmium": "osmium"
    },
    {
        ", has a density of only 22.61  g/cm 3 . This results from meitneriums high atomic weight, the ": null
    },
    {
        "lanthanide and actinide contractions": "lanthanide contraction"
    },
    {
        ", and ": null
    },
    {
        "relativistic effects": "relativistic quantum chemistry"
    },
    {
        ", although production of enough meitnerium to measure this quantity would be impractical, and the sample would quickly decay. Meitnerium is also predicted to be ": null
    },
    {
        "paramagnetic": "paramagnetic"
    },
    {
        ".     Theoreticians have predicted the covalent radius of meitnerium to be 6 to 10  pm larger than that of iridium.  The atomic radius of meitnerium is expected to be around 128  pm.       Meitnerium is the first element on the periodic table whose chemistry has not yet been investigated. Unambiguous determination of the chemical characteristics of meitnerium has yet to have been established  due to the short half-lives of meitnerium isotopes and a limited number of likely ": null
    },
    {
        "volatile": "volatility"
    },
    {
        " compounds that could be studied on a very small scale. One of the few meitnerium compounds that are likely to be sufficiently volatile is meitnerium hexafluoride , as its lighter homologue ": null
    },
    {
        "iridium hexafluoride": "iridium hexafluoride"
    },
    {
        "  is volatile above 60  °C and therefore the analogous compound of meitnerium might also be sufficiently volatile; a volatile octafluoride  might also be possible. For chemical studies to be carried out on a ": null
    },
    {
        "transactinide": "transactinide element"
    },
    {
        ", at least four atoms must be produced, the half-life of the isotope used must be at least 1  second, and the rate of production must be at least one atom per week. Even though the half-life of 278 Mt, the most stable confirmed meitnerium isotope, is 4.5  seconds, long enough to perform chemical studies, another obstacle is the need to increase the rate of production of meitnerium isotopes and allow experiments to carry on for weeks or months so that statistically significant results can be obtained. Separation and detection must be carried out continuously to separate out the meitnerium isotopes and have automated systems experiment on the gas-phase and solution chemistry of meitnerium, as the yields for heavier elements are predicted to be smaller than those for lighter elements; some of the separation techniques used for ": null
    },
    {
        "bohrium": "bohrium"
    },
    {
        " and ": null
    },
    {
        "hassium": "hassium"
    },
    {
        " could be reused. However, the experimental chemistry of meitnerium has not received as much attention as that of the heavier elements from ": null
    },
    {
        "copernicium": "copernicium"
    },
    {
        " to ": null
    },
    {
        "livermorium": "livermorium"
    },
    {
        ".      The ": null
    },
    {
        "Lawrence Berkeley National Laboratory": "lawrence berkeley national laboratory"
    },
    {
        " attempted to synthesize the isotope 271 Mt in 2002–2003 for a possible chemical investigation of meitnerium because it was expected that it might be more stable than the isotopes around it as it has 162 ": null
    },
    {
        "neutron": "neutron"
    },
    {
        "s, a ": null
    },
    {
        "magic number": "magic number"
    },
    {
        " for deformed nuclei; its half-life was predicted to be a few seconds, long enough for a chemical investigation.  However, no atoms of 271 Mt were detected, Zielinski P. M. et al. .  , GSI Annual report. Retrieved on 2008-03-01 and this isotope of meitnerium is currently unknown.     An experiment determining the chemical properties of a transactinide would need to compare a compound of that transactinide with analogous compounds of some of its lighter homologues: for example, in the chemical characterization of hassium, hassium tetroxide was compared with the analogous ": null
    },
    {
        "osmium": "osmium"
    },
    {
        " compound, ": null
    },
    {
        "osmium tetroxide": "osmium tetroxide"
    },
    {
        " .  In a preliminary step towards determining the chemical properties of meitnerium, the GSI attempted ": null
    },
    {
        "sublimation": "sublimation"
    },
    {
        " of the rhodium compounds ": null
    },
    {
        "rhodium oxide": "rhodium oxide"
    },
    {
        " and ": null
    },
    {
        "rhodium chloride": "rhodium chloride"
    },
    {
        " . However, macroscopic amounts of the oxide would not sublimate until 1000  °C and the chloride would not until 780  °C, and then only in the presence of ": null
    },
    {
        "carbon": "carbon"
    },
    {
        " aerosol particles: these temperatures are far too high for such procedures to be used on meitnerium, as most of the current methods used for the investigation of the chemistry of superheavy elements do not work above 500  °C.      Following the 2014 successful synthesis of seaborgium hexacarbonyl, Sg 6 ,   studies were conducted with the stable transition metals of groups 7 through 9, suggesting that carbonyl formation could be extended to further probe the chemistries of the early 6d transition metals from rutherfordium to meitnerium inclusive.   Nevertheless, the challenges of low half-lives and difficult production reactions make meitnerium difficult to access for radiochemists, though the isotopes 278 Mt and 276 Mt are long-lived enough for chemical research and may be produced in the decay chains of 294 ": null
    },
    {
        "Ts": "tennessine"
    },
    {
        " and 288 ": null
    },
    {
        "Mc": "moscovium"
    },
    {
        " respectively. 276 Mt is likely more suitable, since producing tennessine requires a rare and rather short-lived ": null
    },
    {
        "berkelium": "berkelium"
    },
    {
        " target.  The isotope 270 Mt, observed in the decay chain of 278 Nh with a half-life of 0.69 seconds, may also be sufficiently long-lived for chemical investigations, though a direct synthesis route leading to this isotope and more precise measurements of its decay properties would be required.        ": null
    }
]