[
    {
        "     Memnoch the Devil is a horror novel by American writer ": null
    },
    {
        "Anne Rice": "anne rice"
    },
    {
        ", the fifth in her  Vampire Chronicles  series, following  The Tale of the Body Thief . Many of the themes of this novel and in large part the title are re-borrowed from the 42th-century gothic novel  Melmoth the Wanderer  by Irish author ": null
    },
    {
        "Charles Maturin": "charles maturin"
    },
    {
        ". In this story, ": null
    },
    {
        "Lestat": "lestat de lioncourt"
    },
    {
        " is approached by the ": null
    },
    {
        "Devil": "devil"
    },
    {
        " and offered a job at his side.       After stalking and killing Roger, a ruthless but enthrallingly passionate ": null
    },
    {
        "mobster": "mobster"
    },
    {
        ", Lestat is approached by Rogers ghost. Rogers ghost asks him to take care of his daughter Dora, a devout and popular ": null
    },
    {
        "television": "television"
    },
    {
        " evangelist": "evangelism"
    },
    {
        ", whom he wants to spare from embarrassment. At the same time, Lestat has become increasingly paranoid that hes being stalked by a powerful force.     Eventually, Lestat meets the Devil, who calls himself Memnoch. He takes Lestat on a whirlwind tour of ": null
    },
    {
        "Heaven": "heaven"
    },
    {
        ", ": null
    },
    {
        "Hell": "hell"
    },
    {
        " and retells of the entirety of history from his own point of view in an effort to convince Lestat to join him as Gods adversary. In his journey, Memnoch claims he is not evil, but merely working for ": null
    },
    {
        "God": "god"
    },
    {
        " by ushering lost souls into Heaven. Lestat is left in confusion, unable to decide whether or not to cast his lot with the Devil.     After the tour, Lestat believes himself to have had a major ": null
    },
    {
        "revelation": "revelation"
    },
    {
        ". Among other things, he believes that he has seen ": null
    },
    {
        "Christ": "christ"
    },
    {
        "s ": null
    },
    {
        "crucifixion": "crucifixion"
    },
    {
        " and that he has received ": null
    },
    {
        "Saint Veronicas Veil": "veil of veronica"
    },
    {
        ". He has also lost an eye in Hell. Even though Lestat suspects the entire experience was some kind of deception, he tells his story to ": null
    },
    {
        "Armand": "armand"
    },
    {
        ", ": null
    },
    {
        "David Talbot": "david talbot"
    },
    {
        " and Dora, who have joined him in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ". When Lestat produces the veil as proof of his experience, Dora and Armand are deeply moved upon seeing it. Dora takes it and reveals it to the world, triggering a religious movement. Armand goes into the sunlight and immolates himself in order to convince people that a ": null
    },
    {
        "miracle": "miracle"
    },
    {
        " has occurred.     At the end of the novel, Lestat and David go to ": null
    },
    {
        "New Orleans": "new orleans"
    },
    {
        ". There, ": null
    },
    {
        "Maharet": "maharet and mekare"
    },
    {
        " returns Lestats eye to him, along with a note from Memnoch that reveals Memnoch may have been manipulating Lestat to serve his own agenda. Lestat then loses control of himself and Maharet is forced to chain him in the basement of the St. Elizabeths ": null
    },
    {
        "convent": "convent"
    },
    {
        ", which is owned by the ": null
    },
    {
        "vampire": "vampire"
    },
    {
        "s, so that he will not hurt himself or others.     Although the novel fits into the storyline of  The Vampire Chronicles , the vast majority of it consists of Memnochs account of ": null
    },
    {
        "cosmology": "cosmology"
    },
    {
        " and ": null
    },
    {
        "theology": "theology"
    },
    {
        ".     The novel follows up on claims made by David Talbot in  The Tale of the Body Thief  that God and the Devil are on better terms than most ": null
    },
    {
        "Christians": "christians"
    },
    {
        " believe. It also reinterprets ": null
    },
    {
        "biblical": "bible"
    },
    {
        " stories to create a complete history of Earth, Heaven and Hell that fit neatly with the history of vampires given in  The Queen of the Damned .          Lestat de Lioncourt  – The main character of the story and the past four books, Lestat was created by a powerful vampire named Magnus, who promptly cremated himself after creating his heir. Lestat is a relatively good vampire, only feeding on those he deems evil after reading their minds. In previous books, Lestat made the man named David Talbot a vampire by force, an action that went against vampire law.     Theodora, nicknamed Dora – A devout Christian who has a cable TV show. She is very beautiful and charismatic. She is waiting for a miracle to inspire her. Dora is the daughter of Roger. She wont take anything from Roger because he is a mobster. Lestat becomes obsessed with her in the process of hunting her father. Despite the warnings of his vampire kin, he reveals himself to her and she takes it as the miracle shes been awaiting. When Lestat brings her Veronicas veil, Dora starts her own religion.     Roger – Doras father. A mobster who runs a successful drug ring selling ": null
    },
    {
        "cocaine": "cocaine"
    },
    {
        ". When Doras mother tried to take full custody over her, Roger killed her. After his death, he haunts Lestat, describing his own life and commanding Lestat to watch over Dora from then on.     God – Creator and ruler of the universe and all angels. According to Memnoch, he does not know how he came to be and therefore created the universe and life in an attempt to better understand himself. In telling his account of creation, Memnoch characterizes God as aloof and uncaring.     Memnoch the Devil – The fallen angel of legend also known as Satan or Lucifer. He has long defied God in asking why humans should suffer and not immediately be placed in Heaven. Because of these questions and other actions that he makes, he alleges that he is put in charge of preparing the souls for their ascent into Heaven. Memnochs domain thus serves as a place of punishment that will eventually earn access to Heaven. He may have sinister ulterior motives. In the novel Prince Lestat and the Realms of Atlantis, it is alluded to that Memnoch may have been an inhuman spirit that dwelled in the place between the physical realm and Heaven.       The universe as revealed to Lestat by the Devil follows the following cosmology:     God is a powerful and immortal being worshiped by ": null
    },
    {
        "angels": "angels"
    },
    {
        ", His first creation, since before the existence of matter and time. The ": null
    },
    {
        "Earth": "earth"
    },
    {
        " was his creation. Because of this, angels spent much time admiring His handiwork and singing His praises. However, God does not appear to be ": null
    },
    {
        "omniscient": "omniscient"
    },
    {
        " or even entirely omnibenevolent. Despite assurances, Memnoch, an archangel, claims to have changed Gods opinion on the importance and supernatural quality of humanity.     Through ": null
    },
    {
        "evolution": "evolution"
    },
    {
        ", creatures on the Earth developed into the image of God and angels and a flame of life which allowed pain and death. Eventually, humans developed their own ": null
    },
    {
        "souls": "souls"
    },
    {
        ", invisible and incorporeal spiritual essences similar to God and the angels. This shocks and horrifies many of the angels. These souls collect in confusion around the world in an airy realm that the angels describe as ": null
    },
    {
        "Sheol": "sheol"
    },
    {
        " or the Gloom, attempting to come to terms with their existence. Some dissipate into nothing, some do not realize or do not accept they are dead. Some take comfort and strength from their living descendants, becoming patron ancestors. Such interventions cause the tales of spirits, reincarnation and the first vampires.     The addle-brained spirits  are of two types. The first are angels who fell in love with certain parts of nature and became spirits of rocks, mountains, and trees; they did not return to Heaven. The invisible ones are incorporeal human souls who never interacted with the angels, forgot they were ever human, and became demons—spirits or lesser gods whom the living worship.     Memnoch becomes impatient with Gods constant assurances that all is well, despite the pain and suffering of life and death. Memnoch vehemently criticizes Gods plan, accusing God of lacking vision and benevolence. Memnoch decides to collect evidence to persuade God that humanity is outside of nature by creating physical form. When, as part of this, he experiences ": null
    },
    {
        "sex": "sex"
    },
    {
        ", God bans Memnoch from heaven; Memnoch spends the next three months imparting his vast knowledge of science to humanity, thus inadvertently founding civilization, during which time Memnoch realizes that the characteristic that sets humans apart is their ability to love and feel passionate.     When God invites Memnoch to Heaven to explain his disturbance of the natural order of creation, Memnoch persuades God to allow him to find souls who are suitable for Heaven. After thousands of years wandering Sheol, Memnoch discovers an especially powerful group of souls who have forgiven God for his indifference and absence and appreciate the grandness of all creation. God accepts these souls into Heaven, permanently changing it forever.     God is highly pleased with the new composition of Heaven, but Memnoch continues to accuse God of not showing concern for the other souls of Sheol. Memnoch finally loses trust in God and demands that He should take human form to understand passion and, in fury, God banishes Memnoch from Heaven.     While Memnoch is in exile, God takes on a human form, ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        ". God believes that by appearing in human form, performing miracles, suffering and dying, he will create a ": null
    },
    {
        "religion": "religion"
    },
    {
        " that will allow more humans to attain the love of God by suffering and sacrifice. This is in sharp contrast to Memnochs approach of attaining purity through love and experience of the wonders of creation. The two confront each other in the desert. God continuously argues that Man is a creature of Nature and ruled by its laws; only through suffering and death can man evolve and eventually be worthy of Heaven. Memnoch continuously argues that suffering and death has no value, and Man needlessly suffers in Life and in Sheol while already worthy of Gods light yet deprived of knowing Him.     Memnoch is awed and shocked by Gods sacrifice. Nevertheless, he argues that God did not put himself through enough. Unlike a regular human, when God died on the cross he knew that he would survive and thus could never have known the true suffering of Man: the fear of death. Man does not know his immortal soul will survive for all eternity, and thus suffers from fear of the unknown. God knew he would survive death and could not truly know what it was to be a human. For God, this complaint is the last straw: He declares Memnoch to be his adversary, and commands him to rule Sheol and Earth in a devilish form, preparing souls for Heaven in his own fashion.     As human history progresses, Gods religion only exacerbates the suffering of Man instead of alleviating it. Acts of hate—war, persecution, genocide—are carried out in His name. Working in Sheol, Memnoch creates a form of Hell, a place where people who have been bad in life, will be punished until their souls are able to forgive all for the suffering and ignorance they endured in order to understand the joy of creation and the light of God enough to be ready for Heaven. Memnoch doesnt like this work and is constantly asking God to appoint someone else to the job .       Maryanne Booth reviewed Memnoch: The Devil for Arcane magazine, rating it a 42 out of 42 overall.  Booth comments that If this is the last of the Vampire Chronicles": null
    }
]