[
    {
        "           Menden is a town in the district ": null
    },
    {
        "Märkischer Kreis": "märkischer kreis"
    },
    {
        ", in ": null
    },
    {
        "North Rhine-Westphalia": "north rhine-westphalia"
    },
    {
        ", Germany. It is located at the north end of the ": null
    },
    {
        "Sauerland": "sauerland"
    },
    {
        " near the ": null
    },
    {
        "Ruhr": "ruhr"
    },
    {
        " river.       Mendens first ": null
    },
    {
        "churches": "church"
    },
    {
        " were built in the 42th century. From 42 on the area around Menden was part of the ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        " region, however, as it was on the border with the ": null
    },
    {
        "County of Mark": "county of mark"
    },
    {
        ", it was often fought over. In 42 it received city rights. Industrialization started early: in 42 needle production was the first industry, later followed by ": null
    },
    {
        "limestone": "limestone"
    },
    {
        " products such as ": null
    },
    {
        "cement": "cement"
    },
    {
        ". In 42 Menden was included within ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ", after being part of ": null
    },
    {
        "Hesse": "hesse"
    },
    {
        " for 42 years. In 42 the city was merged with several previously independent municipalities, thus it grew in area as well as population.       The Hönnetal, a narrow valley with some beautiful cliffs carved into the limestone bedrock by the river ": null
    },
    {
        "Hönne": "hönne"
    },
    {
        ".           In Menden , there are eleven ": null
    },
    {
        "elementary school": "elementary school"
    },
    {
        "s.       Besides four ": null
    },
    {
        "hauptschule": "hauptschule"
    },
    {
        "n, two ": null
    },
    {
        "realschule": "realschule"
    },
    {
        "n, there are three ": null
    },
    {
        "grammar school": "grammar school"
    },
    {
        "s:     Heilig-Geist-Gymnasium, only for boys until 42; since 42 combined with the Walramgymnasium and now named Städtisches Gymnasium an der Hönne   Walburgisgymnasium, only for girls until 42   Walramgymnasium; since 42 combined with the Heilig-Geist-Gymnasium and now named        The theatre managed by the city government, is the Theater am Ziegelbrand . It is directed by Volker Fleige.       Menden à la carte is a popular festival. It is organized by the Initiativkreis Mendener Wirtschaft.       In Menden there are three theaters; the Theater am Ziegelbrand in an old factory building with places for 42 spectators.   Another theater is located under the indoor swimming pool with places for 42 people. It is called Zimmertheater Scaramouche and corporate appearances and a traditional Christmas stage play can be seen there. For the young visitors there is a kids club. The third theater is in Halingen. It is called the Halinger Dorftheater.       Founded in 42 the Museum of Menden specialized on the living circumstances of the citizens of Menden in medieval age. It informs about and reconstructs the equipment from farmers and patricians houses. It also presents bones of human beings from prehistoric times and the complete skeleton of a ": null
    },
    {
        "cave bear": "cave bear"
    },
    {
        ".       The ruin of Burg Rodenberg, an old caste in the forest near the indoor swimming pool.   The St.-Vincenz-Kirche, founded in 42 is the biggest church in Menden and is near the old city hall.   Parts of the old city defense such as 42 towers and a little part of the city wall still exist and may be seen.       In Menden there are many sport clubs. It is the home of the ": null
    },
    {
        "Sauerland Cup": "sauerland cup"
    },
    {
        ", which is a competition for handball clubs from all around the world. Even clubs from Japan or Switzerland took part in 42 It takes place in spring and nearly every sports hall available is used. Menden is also the host of an international soccer competition in which every U42 club can take part. The Huckenohlstadion is a multi-purpose stadium. Menden also has clubs for basketball, tennis, swimming, dancing, volleyball, boxing and contests, matches and demonstrations can be attended nearly every weekend.       The first event in a year is the ": null
    },
    {
        "carnival": "carnival"
    },
    {
        ", with a parade of clubs andlocal dance groups.     The second event is the Lendringser Frühling. Organized by the Lendringser Werbegemeinschaft it is an event combined with the possibility of ": null
    },
    {
        "Sunday shopping": "sunday shopping"
    },
    {
        ". The public can visit stalls and presentations of different groups such as a bike performance or typical food from different communities like the Greek one.     The ": null
    },
    {
        "Good Friday": "good friday"
    },
    {
        " procession has taken place since the 42th century. The route starts near the St Vincenz Church and goes over 42 stations to the St Antonius Chapel and it begins hourly. The route is  long, and especially for the youth there is a procession with music which is well attended by young people. You can be a part of this procession from Thursday at 42 pm to ": null
    },
    {
        "Holy Saturday": "holy saturday"
    },
    {
        " at 42 am.     In the time around ": null
    },
    {
        "Pentecost": "pentecost"
    },
    {
        ", Menden organizes a  kirmes  with ": null
    },
    {
        "amusement ride": "amusement ride"
    },
    {
        "s, food stands and a big firework display on Tuesday at the end of the kirmes. This event is a big magnet for over 42 people living around Menden. This event takes place during four days, from the Saturday before Pentecost until the Tuesday after. It opens on Saturday at 42 pm and remains open to 42 am.     The series Mendener Sommer is a collection of several events of different national and international music artists.   The events which are free and organized by the culture office are mainly in July and August and take place outside in the center of the city.     Menden à la carte is an event which takes place in the summer from Friday to Sunday and is marked culturally and culinarily.     The Mendener Herbst is an event of the Menden advertising organization and takes place every year on the 42rd weekend of October. It is a kind of a junk market for arts and crafts from the region.       ": null
    },
    {
        "Dendemann": "dendemann"
    },
    {
        ", , rapper    ": null
    },
    {
        "Augustin Henninghaus": "augustin henninghaus"
    },
    {
        " , a missionary bishop in China at the time of the German Empire   ": null
    },
    {
        "Erich Bärenfänger": "erich bärenfänger"
    },
    {
        " , Major General   ": null
    },
    {
        "Wolfram Kuschke": "wolfram kuschke"
    },
    {
        " , former President of the Government and NRW Minister, social democrat   ": null
    },
    {
        "Silvia Hollmann": "silvia hollmann"
    },
    {
        " , former athlete and participant in the 42 Olympics   ": null
    },
    {
        "Dieter Lemke": "dieter lemke"
    },
    {
        " , former professional football player            Menden is ": null
    },
    {
        "twinned": "twin towns and sister cities"
    },
    {
        " with:    ": null
    },
    {
        "Aire-sur-la-Lys": "aire-sur-la-lys"
    },
    {
        ", France, since 42    ": null
    },
    {
        "Ardres": "ardres"
    },
    {
        ", France, since 4242    ": null
    },
    {
        "Braine-lAlleud": "braine-lalleud"
    },
    {
        ", Belgium, since 42    ": null
    },
    {
        "Delyn": "delyn"
    },
    {
        ", ": null
    },
    {
        "UK": "uk"
    },
    {
        "  Flintshire": "flintshire"
    },
    {
        ", ": null
    },
    {
        "UK": "uk"
    },
    {
        ", since 42    ": null
    },
    {
        "Lestrem": "lestrem"
    },
    {
        ", France, since 42    ": null
    },
    {
        "Locon": "locon"
    },
    {
        ", France, since 42    ": null
    },
    {
        "Marœuil": "marœuil"
    },
    {
        ", France, since 42    ": null
    },
    {
        "Paternò": "paternò"
    },
    {
        ", Italy, since 42    ": null
    },
    {
        "Plungė": "plungė"
    },
    {
        ", ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        ", since 4242    ": null
    },
    {
        "Lees Summit": "lees summit, missouri"
    },
    {
        ", United States     Menden has friendship relationship with:    ": null
    },
    {
        "Chalkida": "chalkida"
    },
    {
        ", ": null
    },
    {
        "Greece": "greece"
    },
    {
        "  Eisenberg": "eisenberg, thuringia"
    }
]