[
    {
        "        In Old World archaeology, Mesolithic  is the period between the ": null
    },
    {
        "Upper Paleolithic": "upper paleolithic"
    },
    {
        " and the ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        ". The term ": null
    },
    {
        "Epipaleolithic": "epipaleolithic"
    },
    {
        " is often used synonymously, especially for outside northern Europe, and for the corresponding period in ": null
    },
    {
        "the Levant": "epipaleolithic near east"
    },
    {
        " and ": null
    },
    {
        "Caucasus": "epipaleolithic caucasus"
    },
    {
        ". The Mesolithic has different time spans in different parts of ": null
    },
    {
        "Eurasia": "eurasia"
    },
    {
        ". It refers to the final period of ": null
    },
    {
        "hunter-gatherer": "hunter-gatherer"
    },
    {
        " cultures in Europe and Western Asia, between the end of the ": null
    },
    {
        "Last Glacial Maximum": "last glacial maximum"
    },
    {
        " and the ": null
    },
    {
        "Neolithic Revolution": "neolithic revolution"
    },
    {
        ". In Europe it spans roughly 15,000 to 5,000  ": null
    },
    {
        "BP": "before present"
    },
    {
        "; in Southwest Asia  roughly 20,000 to 8,000  ": null
    },
    {
        "BP": "before present"
    },
    {
        ". The term is less used of areas further east, and not at all beyond ": null
    },
    {
        "Eurasia": "eurasia"
    },
    {
        " and ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        ".     The type of culture associated with the Mesolithic varies between areas, but it is associated with a decline in the group hunting of large animals in favour of a broader ": null
    },
    {
        "hunter-gatherer": "hunter-gatherer"
    },
    {
        " way of life, and the development of more sophisticated and typically smaller lithic tools and weapons than the heavy chipped equivalents typical of the Paleolithic. Depending on the region, some use of ": null
    },
    {
        "pottery": "pottery"
    },
    {
        " and ": null
    },
    {
        "textiles": "history of clothing and textilesprehistoric development"
    },
    {
        " may be found in sites allocated to the Mesolithic, but generally indications of agriculture are taken as marking ": null
    },
    {
        "transition into the Neolithic": "neolithic revolution"
    },
    {
        ". The more permanent settlements tend to be close to the sea or inland waters offering a good supply of food. Mesolithic societies are not seen as very complex, and burials are fairly simple; grandiose ": null
    },
    {
        "burial mounds": "tumulus"
    },
    {
        " are another mark of the Neolithic.                  The terms Paleolithic and Neolithic were introduced by ": null
    },
    {
        "John Lubbock": "john lubbock, 1st baron avebury"
    },
    {
        " in his work Pre-historic Times in 1865. The additional Mesolithic category was added as an intermediate category by Hodder Westropp in 1866. Westropps suggestion was immediately controversial. A British school led by ": null
    },
    {
        "John Evans": "john evans"
    },
    {
        " denied any need for an intermediate: the ages blended together like the colors of a rainbow, he said. A European school led by ": null
    },
    {
        "Louis Laurent Gabriel de Mortillet": "louis laurent gabriel de mortillet"
    },
    {
        " asserted that there was a gap between the earlier and later.     ": null
    },
    {
        "Edouard Piette": "edouard piette"
    },
    {
        " claimed to have filled the gap with his naming of the ": null
    },
    {
        "Azilian": "azilian"
    },
    {
        " Culture. ": null
    },
    {
        "Knut Stjerna": "knut stjerna"
    },
    {
        " offered an alternative in the Epipaleolithic , suggesting a final phase of the Paleolithic rather than an intermediate age in its own right inserted between the Paleolithic and Neolithic.     By the time of ": null
    },
    {
        "Vere Gordon Childes": "vere gordon childe"
    },
    {
        "work, The Dawn of Europe , which affirms the Mesolithic, sufficient data had been collected to determine that a transitional period between the Paleolithic and the Neolithic was indeed a useful concept.  However, the terms Mesolithic and Epipalaeolitic remain in competition, with varying conventions of usage. In the archaeology of Northern Europe, for example for archaeological sites in Great Britain, Germany, Scandinavia, Ukraine, and Russia, the term Mesolithic is almost always used. In the archaeology of other areas, the term Epipaleolithic may be preferred by most authors, or there may be divergences between authors over which term to use or what meaning to assign to each. In the New World, neither term is used .     Epipaleolithic is sometimes also used alongside Mesolithic for the final end of the Upper Paleolithic immediately followed by the Mesolithic. final Upper Paleolithic industries occurring at the end of the ": null
    },
    {
        "final glaciation": "last glacial period"
    },
    {
        " which appear to merge technologically into the Mesolithic  As Mesolithic suggests an intermediate period, followed by the Neolithic, some authors prefer the term Epipaleolithic for ": null
    },
    {
        "hunter-gatherer": "hunter-gatherer"
    },
    {
        " cultures who are not succeeded by agricultural traditions, reserving Mesolithic for cultures who are clearly succeeded by the Neolithic Revolution, such as the ": null
    },
    {
        "Natufian culture": "natufian culture"
    },
    {
        ". Other authors use Mesolithic as a generic term for post-LGM hunter-gatherer cultures, whether they are transitional towards agriculture or not. In addition, terminology appears to differ between archaeological sub-disciplines, with Mesolithic being widely used in European archaeology, while Epipalaeolithic is more common in Near Eastern archaeology.                  The ": null
    },
    {
        "Balkan Mesolithic": "balkan mesolithic"
    },
    {
        " begins around 15,000 years ago. In Western Europe, the Early Mesolithic, or ": null
    },
    {
        "Azilian": "azilian"
    },
    {
        ", begins about 14,000 years ago, in the ": null
    },
    {
        "Franco-Cantabrian region": "franco-cantabrian region"
    },
    {
        " of northern ": null
    },
    {
        "Spain": "spain"
    },
    {
        " and southern ": null
    },
    {
        "France": "france"
    },
    {
        ". In other parts of Europe, the Mesolithic begins by 11,500 years ago , and it ends with the ": null
    },
    {
        "introduction": "neolithic europe"
    },
    {
        " of farming, depending on the region between c. 8,500 and 5,500 years ago. Regions that experienced greater environmental effects as the ": null
    },
    {
        "last glacial period": "last glacial period"
    },
    {
        " ended have a much more apparent Mesolithic era, lasting millennia.  In northern Europe, for example, societies were able to live well on rich food supplies from the marshlands created by the warmer climate. Such conditions produced distinctive human behaviors that are preserved in the material record, such as the ": null
    },
    {
        "Maglemosian": "maglemosian"
    },
    {
        " and ": null
    },
    {
        "Azilian": "azilian"
    },
    {
        " cultures. Such conditions also delayed the coming of the Neolithic until some 5,500 BP in northern Europe.     The type of stone toolkit remains one of the most diagnostic features: the Mesolithic used a microlithic technology – composite devices manufactured with Mode V chipped ": null
    },
    {
        "stone tools": "stone tool"
    },
    {
        " , while the Paleolithic had utilized Modes I–IV. In some areas, however, such as Ireland, parts of Portugal, the Isle of Man and the Tyrrhenian Islands, a macrolithic technology was used in the Mesolithic.  In the Neolithic, the microlithic technology was replaced by a macrolithic technology, with an increased use of polished stone tools such as stone axes.     There is some evidence for the beginning of construction at sites with a ritual or astronomical significance, including ": null
    },
    {
        "Stonehenge": "stonehenge"
    },
    {
        ", with a short row of large ": null
    },
    {
        "post holes": "post hole"
    },
    {
        "aligned east-west, and a possible lunar calendar at ": null
    },
    {
        "Warren Field": "warren field"
    },
    {
        " in Scotland, with pits of post holes of varying sizes, thought to reflect the ": null
    },
    {
        "lunar phase": "lunar phase"
    },
    {
        "s. Both are dated to before c. 9,000 BP .      As the ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " package  spread into Europe, the Mesolithic way of life was marginalized and eventually disappeared. Mesolithic adaptations such as sedentism, population size and use of plant foods are cited as evidence of the transition to agriculture.  In one sample from the ": null
    },
    {
        "Blätterhöhle": "blätterhöhle"
    },
    {
        " in ": null
    },
    {
        "Hagen": "hagen"
    },
    {
        ", it seems that the descendants of Mesolithic people maintained a foraging lifestyle for more than 2000 years after the arrival of farming societies in the area;  such societies may be called ": null
    },
    {
        "Subneolithic": "subneolithic"
    },
    {
        " . In north-Eastern Europe, the hunting and fishing lifestyle continued into the ": null
    },
    {
        "Medieval": "medieval"
    },
    {
        " period in regions less suited to agriculture, and in ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        " no Mesolithic period may be accepted, with the locally preferred Older Stone Age moving into the Younger Stone Age . Bailey, Geoff and Spikins, Penny, Mesolithic Europe, p. 4, 2008, Cambridge University Press,        Compared to the preceding Upper Paleolithic and the following Neolithic, there is rather less surviving art from the Mesolithic. The ": null
    },
    {
        "Rock art of the Iberian Mediterranean Basin": "rock art of the iberian mediterranean basin"
    },
    {
        ", which probably spreads across from the Upper Paleolithic, is a widespread phenomenon, much less well known than the cave-paintings of the Upper Paleolithic, with which it makes an interesting contrast. The sites are now mostly cliff faces in the open air, and the subjects are now mostly human rather than animal, with large groups of small figures; there are 45 figures at ": null
    },
    {
        "Roca dels Moros": "roca dels moros"
    },
    {
        ". Clothing is shown, and scenes of dancing, fighting, hunting and food-gathering. The figures are much smaller than the animals of Paleolithic art, and depicted much more schematically, though often in energetic poses. Sandars, Nancy K., Prehistoric Art in Europe, Penguin , pp. 87–96, 1968 A few small engraved ": null
    },
    {
        "pendants": "pendant"
    },
    {
        "with suspension holes and simple engraved designs are known, some from northern Europe in ": null
    },
    {
        "amber": "amber"
    },
    {
        ", and one from ": null
    },
    {
        "Star Carr": "star carr"
    },
    {
        " in Britain in ": null
    },
    {
        "shale": "shale"
    },
    {
        ". , University of York The ": null
    },
    {
        "Elks Head of Huittinen": "elks head of huittinen"
    },
    {
        " is a rare Mesolithic animal carving in ": null
    },
    {
        "soapstone": "soapstone"
    },
    {
        " from ": null
    },
    {
        "Finland": "finland"
    },
    {
        ".     The rock art in the ": null
    },
    {
        "Urals": "urals"
    },
    {
        " appears to show similar changes after the Paleolithic, and the wooden ": null
    },
    {
        "Shigir Idol": "shigir idol"
    },
    {
        " is a rare survival of what may well have been a very common material for sculpture. It is a plank of ": null
    },
    {
        "larch": "larch"
    },
    {
        " carved with geometric motifs, but topped with a human head. Now in fragments, it would apparently have been over 5 metres tall when made.  The  Ain Sakhri Lovers  from modern Israel, are a Natufian carving in ": null
    },
    {
        "calcite": "calcite"
    },
    {
        "  Ain Sakhri lovers ; c. 9000 BCE ; ": null
    },
    {
        "calcite": "calcite"
    },
    {
        "; height: 10.2  cm, width: 6.3  cm; from Ain Sakhri ; ": null
    },
    {
        "British Museum": "british museum"
    },
    {
        " Star Carr": "star carr"
    },
    {
        " in 2015  ": null
    },
    {
        "Roca dels Moros": "roca dels moros"
    },
    {
        ", Spain, The Dance of Cogul, tracing by ": null
    },
    {
        "Henri Breuil": "henri breuil"
    },
    {
        "         In North-Eastern Europe, Siberia, and certain southern European and North African sites, a ceramic Mesolithic can be distinguished between c. 9,000 to 5,850 BP. Russian archaeologists prefer to describe such pottery-making cultures as Neolithic, even though farming is absent. This pottery-making Mesolithic culture can be found peripheral to the sedentary Neolithic cultures. It created a distinctive type of pottery, with point or knob base and flared rims, manufactured by methods not used by the Neolithic farmers. Though each area of Mesolithic ceramic developed an individual style, common features suggest a single point of origin. De Roevers, pp. 162–63  The earliest manifestation of this type of pottery may be in the region around Lake Baikal in Siberia. It appears in the Elshan or Yelshanka or ": null
    },
    {
        "Samara culture": "samara culture"
    },
    {
        " on the Volga in Russia 9 ka,   and from there spread via the ": null
    },
    {
        "Dnieper-Donets culture": "dnieper-donets culture"
    },
    {
        " to the ": null
    },
    {
        "Narva culture": "narva culture"
    },
    {
        " of the Eastern Baltic. Spreading westward along the coastline it is found in the ": null
    },
    {
        "Ertebølle culture": "ertebølle culture"
    },
    {
        " of Denmark and Ellerbek of Northern Germany, and the related ": null
    },
    {
        "Swifterbant culture": "swifterbant culture"
    },
    {
        " of the Low Countries.  Detlef Gronenborn, Beyond the models: Neolithisation in Central Europe, Proceedings of the British Academy, vol. 144 , pp. 73–98 .          A 2012 publication in the  Science  journal, announced that the earliest pottery yet known anywhere in the world was found in Xianrendong cave in China, dating by radiocarbon to between 20,000 and 19,000 years before present, at the end of the ": null
    },
    {
        "Last Glacial Period": "last glacial period"
    },
    {
        ".   The carbon 14 datation was established by carefully dating surrounding sediments.  Many of the pottery fragments had scorch marks, suggesting that the pottery was used for cooking. These early pottery containers were made well before the ": null
    },
    {
        "invention of agriculture": "invention of agriculture"
    },
    {
        " , by mobile foragers who hunted and gathered their food during the Late Glacial Maximum.                      While Paleolithic and Neolithic have been found useful terms and concepts in the ": null
    },
    {
        "archaeology of China": "archaeology of china"
    },
    {
        ", and can be mostly regarded as happily naturalized, Mesolithic was introduced later, mostly after 1945, and does not appear to be a necessary or useful term in the context of China. Chinese sites that have been regarded as Mesolithic are better considered as Early Neolithic . Zhang, Chi,  , 1999, Documenta Praehistorica. Poročilo o raziskovanju paleolitika, neolotika in eneolitika v Sloveniji. Neolitske študije Neolithic studies, 26 , pp. 1–13 dLib     In the ": null
    },
    {
        "archaeology of India": "archaeology of india"
    },
    {
        ", the Mesolithic, dated roughly between 12,000 and 8,000 BP, remains a concept in use. Sailendra Nath Sen, , p. 23, 1999, New Age International,      In the ": null
    },
    {
        "archaeology of the Americas": "archaeology of the americas"
    },
    {
        ", an ": null
    },
    {
        "Archaic": "archaic period"
    },
    {
        " or Meso-Indian period, following the ": null
    },
    {
        "Lithic stage": "lithic stage"
    },
    {
        ", somewhat equates to the Mesolithic.        ": null
    }
]