[
    {
        "In ": null
    },
    {
        "telecommunications": "telecommunications"
    },
    {
        ", message switching was the precursor of ": null
    },
    {
        "packet switching": "packet switching"
    },
    {
        ", where messages were routed in their entirety, one hop at a time. It was first built by Collins Radio Company, Newport Beach, California, during the period 42–42 for sale to large airlines, banks and railroads. Message switching systems are nowadays mostly implemented over packet-switched or circuit-switched ": null
    },
    {
        "data network": "data network"
    },
    {
        "s. Each message is treated as a separate entity. Each message contains addressing information, and at each switch this information is read and the transfer path to the next switch is decided. Depending on network conditions, a conversation of several messages may not be transferred over the same path. Each message is stored before being transmitted to the next switch. Because of this it is also known as a store-and-forward network. Email is a common application for message switching. A delay in delivering email is allowed, unlike real-time data transfer between two computers.         Hop-by-hop ": null
    },
    {
        "Telex": "teleprinter"
    },
    {
        " forwarding and ": null
    },
    {
        "UUCP": "uucp"
    },
    {
        " are examples of message switching systems.     When this form of switching is used, no physical path is established in advance between sender and receiver. Instead, when the sender has a block of data to be sent, it is stored in the first switching office  then forwarded later at one hop at a time. Each block is received in its entity form, inspected for errors and then forwarded or re-transmitted.     A form of store-and-forward network. Data is transmitted into the network and stored in a switch. The network transfers the data from switch to switch when it is convenient to do so, as such the data is not transferred in real-time. Blocking can not occur, however, long delays can happen. The source and destination terminal need not be compatible, since conversions are done by the message switching networks.     A message switch is “transactional”. It can store data or change its format and bit rate, then convert the data back to their original form or an entirely different form at the receive end. Message switching multiplexes data from different sources onto a common facility.   A message switch is one of the switching technologies.       Since message switching stores each message at intermediate nodes in its entirety before forwarding, messages experience an end to end delay which is dependent on the message length, and the number of intermediate nodes. Each additional intermediate node introduces a delay which is at minimum the value of the minimum transmission delay into or out of the node. Note that nodes could have different transmission delays for incoming messages and outgoing messages due to different technology used on the links. The transmission delays are in addition to any propagation delays which will be experienced along the message path.     In a message-switching centre an incoming message is not lost when the required outgoing route is busy. It is stored in a queue with any other messages for the same route and retransmitted when the required circuit becomes free. Message switching is thus an example of a delay system or a queuing system. Message switching is still used for telegraph traffic and a modified form of it, known as packet switching, is used extensively for data communications.       The advantages to message switching are:   Data channels are shared among communication devices, improving the use of bandwidth.   Messages can be stored temporarily at message switches, when network congestion becomes a problem.   Priorities may be used to manage network traffic.   Broadcast addressing uses bandwidth more efficiently because messages are delivered to multiple destinations.     ": null
    }
]