[
    {
        "     Messenger RNA  is a large family of ": null
    },
    {
        "RNA": "rna"
    },
    {
        " molecule": "molecule"
    },
    {
        "s that convey ": null
    },
    {
        "genetic information": "genetic information"
    },
    {
        " from ": null
    },
    {
        "DNA": "dna"
    },
    {
        " to the ": null
    },
    {
        "ribosome": "ribosome"
    },
    {
        ", where they specify the ": null
    },
    {
        "amino acid": "amino acid"
    },
    {
        " sequence of the ": null
    },
    {
        "protein": "protein"
    },
    {
        " products of ": null
    },
    {
        "gene expression": "gene expression"
    },
    {
        ". The ": null
    },
    {
        "RNA polymerase": "rna polymerase"
    },
    {
        " enzyme ": null
    },
    {
        "transcribes": "transcription"
    },
    {
        " genes into ": null
    },
    {
        "primary transcript": "primary transcript"
    },
    {
        " mRNA  leading to processed, ": null
    },
    {
        "mature": "mature messenger rna"
    },
    {
        " mRNA. This mature mRNA is then ": null
    },
    {
        "translated": "translation"
    },
    {
        " into a polymer of amino acids: a protein, as summarized in the ": null
    },
    {
        "central dogma of molecular biology": "central dogma of molecular biology"
    },
    {
        ".     As in DNA, mRNA genetic information is in the sequence of ": null
    },
    {
        "nucleotides": "nucleotides"
    },
    {
        ", which are arranged into ": null
    },
    {
        "codons": "codons"
    },
    {
        " consisting of three base pairs each. Each codon encodes for a specific ": null
    },
    {
        "amino acid": "amino acid"
    },
    {
        ", except the ": null
    },
    {
        "stop codon": "stop codon"
    },
    {
        "s, which terminate ": null
    },
    {
        "protein synthesis": "protein synthesis"
    },
    {
        ". This process of translation of codons into amino acids requires two other types of RNA: ": null
    },
    {
        "Transfer RNA": "transfer rna"
    },
    {
        " , that mediates recognition of the codon and provides the corresponding amino acid, and ": null
    },
    {
        "ribosomal RNA": "ribosomal rna"
    },
    {
        " , that is the central component of the ribosomes protein-manufacturing machinery.     The existence of mRNA was first suggested by ": null
    },
    {
        "Jacques Monod": "jacques monod"
    },
    {
        " and ": null
    },
    {
        "François Jacob": "françois jacob"
    },
    {
        ", and subsequently discovered by Jacob, ": null
    },
    {
        "Sydney Brenner": "sydney brenner"
    },
    {
        " and ": null
    },
    {
        "Matthew Meselson": "matthew meselson"
    },
    {
        " at the ": null
    },
    {
        "California Institute of Technology": "california institute of technology"
    },
    {
        " in 42     It should not be confused with ": null
    },
    {
        "mitochondrial DNA": "mitochondrial dna"
    },
    {
        ".       The brief existence of an mRNA molecule begins with transcription, and ultimately ends in degradation. During its life, an mRNA molecule may also be processed, edited, and transported prior to translation. ": null
    },
    {
        "Eukaryotic": "eukaryotes"
    },
    {
        " mRNA molecules often require extensive processing and transport, while ": null
    },
    {
        "prokaryotic": "prokaryotes"
    },
    {
        " mRNA molecules do not. A molecule of eukaryotic mRNA and the proteins surrounding it are together called a ": null
    },
    {
        "messenger RNP": "messenger rnp"
    },
    {
        ".          Transcription is when RNA is made from DNA. During transcription, ": null
    },
    {
        "RNA polymerase": "rna polymerase"
    },
    {
        " makes a copy of a gene from the DNA to mRNA as needed. This process is similar in eukaryotes and prokaryotes. One notable difference, however, is that eukaryotic RNA polymerase associates with mRNA-processing enzymes during transcription so that processing can proceed quickly after the start of transcription. The short-lived, unprocessed or partially processed product is termed precursor mRNA, or  pre-mRNA ; once completely processed, it is termed  mature mRNA .          Processing of mRNA differs greatly among ": null
    },
    {
        "eukaryote": "eukaryote"
    },
    {
        "s, ": null
    },
    {
        "bacteria": "bacteria"
    },
    {
        ", and ": null
    },
    {
        "archea": "archea"
    },
    {
        ". Non-eukaryotic mRNA is, in essence, mature upon transcription and requires no processing, except in rare cases . Eukaryotic pre-mRNA, however, requires several processing steps before its transport to the cytoplasm and its translation by the ribosome.          The extensive processing of eukaryotic pre-mRNA that leads to the mature mRNA is the ": null
    },
    {
        "RNA splicing": "rna splicing"
    },
    {
        ", a mechanism by which ": null
    },
    {
        "intron": "intron"
    },
    {
        "s or ": null
    },
    {
        "outron": "outron"
    },
    {
        "s are removed and ": null
    },
    {
        "exon": "exon"
    },
    {
        "s are joined together.          A 42 cap  is a modified guanine nucleotide that has been added to the front or ": null
    },
    {
        "42 end": "5 end"
    },
    {
        " of a eukaryotic messenger RNA shortly after the start of transcription. The 42 cap consists of a terminal 42-methylguanosine residue that is linked through a 4242-triphosphate bond to the first transcribed nucleotide. Its presence is critical for recognition by the ": null
    },
    {
        "ribosome": "ribosome"
    },
    {
        " and protection from ": null
    },
    {
        "RNase": "rnase"
    },
    {
        "s.     Cap addition is coupled to transcription, and occurs co-transcriptionally, such that each influences the other. Shortly after the start of transcription, the 42 end of the mRNA being synthesized is bound by a cap-synthesizing complex associated with ": null
    },
    {
        "RNA polymerase": "rna polymerase"
    },
    {
        ". This ": null
    },
    {
        "enzymatic": "enzyme"
    },
    {
        " complex ": null
    },
    {
        "catalyze": "catalyze"
    },
    {
        "s the chemical reactions that are required for mRNA capping. Synthesis proceeds as a multi-step ": null
    },
    {
        "biochemical": "biochemistry"
    },
    {
        " reaction.       In some instances, an mRNA will be ": null
    },
    {
        "edited": "rna editing"
    },
    {
        ", changing the nucleotide composition of that mRNA. An example in humans is the ": null
    },
    {
        "apolipoprotein B": "apolipoprotein b rna editing"
    },
    {
        " mRNA, which is edited in some tissues, but not others. The editing creates an early stop codon, which, upon translation, produces a shorter protein.          Polyadenylation is the covalent linkage of a polyadenylyl moiety to a messenger RNA molecule. In eukaryotic organisms most messenger RNA molecules are polyadenylated at the 42 end, but recent studies have shown that short stretches of uridine are also common. Choi et al. RNA. 42 42: 42–42 The ": null
    },
    {
        "poly tail": "messenger rnapoly tail"
    },
    {
        " and the protein bound to it aid in protecting mRNA from degradation by exonucleases. Polyadenylation is also important for transcription termination, export of the mRNA from the nucleus, and translation. mRNA can also be polyadenylated in prokaryotic organisms, where poly tails act to facilitate, rather than impede, exonucleolytic degradation.     Polyadenylation occurs during and/or immediately after transcription of DNA into RNA. After transcription has been terminated, the mRNA chain is cleaved through the action of an endonuclease complex associated with RNA polymerase. After the mRNA has been cleaved, around 42 adenosine residues are added to the free 42 end at the cleavage site. This reaction is catalyzed by polyadenylate polymerase. Just as in ": null
    },
    {
        "alternative splicing": "alternative splicing"
    },
    {
        ", there can be more than one polyadenylation variant of an mRNA.     Polyadenylation site mutations also occur. The primary RNA transcript of a gene is cleaved at the poly-A addition site, and 42–42 As are added to the 42’ end of the RNA. If this site is altered, an abnormally long and unstable mRNA construct will be formed.       Another difference between eukaryotes and prokaryotes is mRNA transport. Because eukaryotic transcription and translation is compartmentally separated, eukaryotic mRNAs must be exported from the ": null
    },
    {
        "nucleus": "cell nucleus"
    },
    {
        " to the ": null
    },
    {
        "cytoplasm": "cytoplasm"
    },
    {
        "—a process that may be regulated by different signaling pathways.  Mature mRNAs are recognized by their processed modifications and then exported through the ": null
    },
    {
        "nuclear pore": "nuclear pore"
    },
    {
        " by binding to the cap-binding proteins CBP42 and CBP42  as well as the transcription/export complex .   Multiple mRNA export pathways have been identified in eukaryotes.      In spatially complex cells, some mRNAs are transported to particular subcellar destinations. In mature ": null
    },
    {
        "neuron": "neuron"
    },
    {
        "s, certain mRNA are transported from the ": null
    },
    {
        "soma": "soma"
    },
    {
        " to ": null
    },
    {
        "dendrite": "dendrite"
    },
    {
        "s. One site of mRNA translation is at polyribosomes selectively localized beneath synapses.  The mRNA for Arc/Arg42 is induced by synaptic activity and localizes selectively near active synapses based on signals generated by NMDA receptors.  Other mRNAs also move into dendrites in response to external stimuli, such as β-actin mRNA.  Upon export from the nucleus, actin mRNA associates with ": null
    },
    {
        "ZBP42": "zbp1"
    },
    {
        " and the 42S subunit. The complex is bound by a motor protein and is transported to the target location along the cytoskeleton. Eventually ZBP42 is phosphorylated by Src in order for translation to be initiated. Spatial regulation of bold beta-actin translation by Src-dependent phosphorylation of ZBP42 . In developing neurons, mRNAs are also transported into growing axons and especially growth cones. Many mRNAs are marked with so-called zip codes, which target their transport to a specific location.           Because prokaryotic mRNA does not need to be processed or transported, translation by the ": null
    },
    {
        "ribosome": "ribosome"
    },
    {
        " can begin immediately after the end of transcription. Therefore, it can be said that prokaryotic translation is coupled to transcription and occurs co-transcriptionally.     Eukaryotic mRNA that has been processed and transported to the cytoplasm can then be translated by the ribosome. Translation may occur at ": null
    },
    {
        "ribosomes": "ribosomes"
    },
    {
        " free-floating in the cytoplasm, or directed to the ": null
    },
    {
        "endoplasmic reticulum": "endoplasmic reticulum"
    },
    {
        " by the ": null
    },
    {
        "signal recognition particle": "signal recognition particle"
    },
    {
        ". Therefore, unlike in prokaryotes, eukaryotic translation is not directly coupled to transcription. somalia It is even possible in some contexts that reduced mRNA levels are accompanied by increased protein levels, as has been observed for mRNA/protein levels of EEF42A42 in breast cancer.                  Coding regions are composed of ": null
    },
    {
        "codons": "codons"
    },
    {
        ", which are decoded and translated into proteins by the ribosome. Coding regions begin with the ": null
    },
    {
        "start codon": "start codon"
    },
    {
        " and end with a ": null
    },
    {
        "stop codon": "stop codon"
    },
    {
        ". In general, the start codon is an AUG triplet and the stop codon is UAA, UAG, or UGA. The coding regions tend to be stabilised by internal base pairs, this impedes degradation.   In addition to being protein-coding, portions of coding regions may serve as regulatory sequences in the ": null
    },
    {
        "pre-mRNA": "pre-mrna"
    },
    {
        " as ": null
    },
    {
        "exonic splicing enhancer": "exonic splicing enhancer"
    },
    {
        "s or ": null
    },
    {
        "exonic splicing silencer": "exonic splicing silencer"
    },
    {
        "s.            Untranslated regions are sections of the mRNA before the start codon and after the stop codon that are not translated, termed the ": null
    },
    {
        "five prime untranslated region": "five prime untranslated region"
    },
    {
        " and ": null
    },
    {
        "three prime untranslated region": "three prime untranslated region"
    },
    {
        " , respectively. These regions are transcribed with the coding region and thus are ": null
    },
    {
        "exon": "exon"
    },
    {
        "ic as they are present in the mature mRNA. Several roles in gene expression have been attributed to the untranslated regions, including mRNA stability, mRNA localization, and ": null
    },
    {
        "translational efficiency": "translational efficiency"
    },
    {
        ". The ability of a UTR to perform these functions depends on the sequence of the UTR and can differ between mRNAs. Genetic variants in 42 UTR have also been implicated in disease susceptibility because of the change in RNA structure and protein translation.      The stability of mRNAs may be controlled by the 42 UTR and/or 42 UTR due to varying affinity for RNA degrading enzymes called ": null
    },
    {
        "ribonuclease": "ribonuclease"
    },
    {
        "s and for ancillary proteins that can promote or inhibit RNA degradation.      Translational efficiency, including sometimes the complete inhibition of translation, can be controlled by UTRs. Proteins that bind to either the 42 or 42 UTR may affect translation by influencing the ribosomes ability to bind to the mRNA. ": null
    },
    {
        "MicroRNA": "microrna"
    },
    {
        "s bound to the ": null
    },
    {
        "42 UTR": "3 utr"
    },
    {
        " also may affect translational efficiency or mRNA stability.     Cytoplasmic localization of mRNA is thought to be a function of the 42 UTR. Proteins that are needed in a particular region of the cell can also be translated there; in such a case, the 42 UTR may contain sequences that allow the transcript to be localized to this region for translation.     Some of the elements contained in untranslated regions form a characteristic ": null
    },
    {
        "secondary structure": "secondary structure"
    },
    {
        " when transcribed into RNA. These structural mRNA elements are involved in regulating the mRNA. Some, such as the ": null
    },
    {
        "SECIS element": "secis element"
    },
    {
        ", are targets for proteins to bind. One class of mRNA element, the ": null
    },
    {
        "riboswitch": "riboswitch"
    },
    {
        "es, directly bind small molecules, changing their fold to modify levels of transcription or translation. In these cases, the mRNA regulates itself.          The 42 poly tail is a long sequence of ": null
    },
    {
        "adenine": "adenine"
    },
    {
        " nucleotides added to the ": null
    },
    {
        "42 end": "3 end"
    },
    {
        " of the pre-mRNA. This tail promotes export from the nucleus and translation, and protects the mRNA from degradation.          An mRNA molecule is said to be monocistronic when it contains the genetic information to ": null
    },
    {
        "translate": "translation"
    },
    {
        " only a single ": null
    },
    {
        "protein": "protein"
    },
    {
        " chain . This is the case for most of the ": null
    },
    {
        "eukaryotic": "eukaryote"
    },
    {
        " mRNAs.       On the other hand, polycistronic mRNA carries several ": null
    },
    {
        "open reading frame": "open reading frame"
    },
    {
        "s , each of which is translated into a polypeptide. These polypeptides usually have a related function and their coding sequence is grouped and regulated together in a regulatory region, containing a ": null
    },
    {
        "promoter": "promoter"
    },
    {
        " and an ": null
    },
    {
        "operator": "operator"
    },
    {
        ". Most of the mRNA found in ": null
    },
    {
        "bacteria": "bacteria"
    },
    {
        " and ": null
    },
    {
        "archaea": "archaea"
    },
    {
        " is polycistronic, as is the human mitochondrial genome.  Dicistronic or bicistronic mRNA encodes only two ": null
    },
    {
        "protein": "protein"
    },
    {
        "s.       In eukaryotes mRNA molecules form circular structures due to an interaction between the ": null
    },
    {
        "eIF42E": "eif4e"
    },
    {
        " and ": null
    },
    {
        "poly-binding protein": "poly-binding protein"
    },
    {
        ", which both bind to ": null
    },
    {
        "eIF42G": "eif4g"
    },
    {
        ", forming an mRNA-protein-mRNA bridge.  Circularization is thought to promote cycling of ribosomes on the mRNA leading to time-efficient translation, and may also function to ensure only intact mRNA are translated .      Other mechanisms for circularization exist, particularly in virus mRNA. ": null
    },
    {
        "Poliovirus": "poliovirus"
    },
    {
        " mRNA uses a cloverleaf section towards its 42 end to bind PCBP42 which binds ": null
    },
    {
        "poly-binding protein": "poly-binding protein"
    },
    {
        ", forming the familiar mRNA-protein-mRNA circle. ": null
    },
    {
        "Barley yellow dwarf virus": "barley yellow dwarf virus"
    },
    {
        " has binding between mRNA segments on its 42 end and 42 end , circularizing the mRNA without any proteins involved.     RNA virus genomes are also commonly circularized. During genome replication the circularization acts to enhance genome replication speeds, cycling viral RNA-dependent RNA polymerase much the same as the ribosome is hypothesized to cycle.       Different mRNAs within the same cell have distinct lifetimes . In bacterial cells, individual mRNAs can survive from seconds to more than an hour. However, the lifetime averages between 42 and 42 minutes, making bacterial mRNA much less stable than eukaryotic mRNA.  In mammalian cells, mRNA lifetimes range from several minutes to days.  The greater the stability of an mRNA the more protein may be produced from that mRNA. The limited lifetime of mRNA enables a cell to alter protein synthesis rapidly in response to its changing needs. There are many mechanisms that lead to the destruction of an mRNA, some of which are described below.       In general, in prokaryotes the lifetime of mRNA is much shorter than in eukaryotes. Prokaryotes degrade messages by using a combination of ribonucleases, including endonucleases, 42 exonucleases, and 42 exonucleases. In some instances, ": null
    },
    {
        "small RNA molecules": "small rna"
    },
    {
        " tens to hundreds of nucleotides long can stimulate the degradation of specific mRNAs by base-pairing with complementary sequences and facilitating ribonuclease cleavage by ": null
    },
    {
        "RNase III": "rnase iii"
    },
    {
        ". It was recently shown that bacteria also have a sort of ": null
    },
    {
        "42 cap": "5 cap"
    },
    {
        " consisting of a triphosphate on the ": null
    },
    {
        "42 end": "5 end"
    },
    {
        ".  Removal of two of the phosphates leaves a 42 monophosphate, causing the message to be destroyed by the exonuclease ": null
    },
    {
        "RNase J": "rnase j"
    },
    {
        ", which degrades 42 to 42       Inside eukaryotic cells, there is a balance between the processes of ": null
    },
    {
        "translation": "translation"
    },
    {
        " and mRNA decay. Messages that are being actively translated are bound by ": null
    },
    {
        "ribosome": "ribosome"
    },
    {
        "s, the ": null
    },
    {
        "eukaryotic initiation factor": "eukaryotic initiation factor"
    },
    {
        "s ": null
    },
    {
        "eIF42E": "eif-4e"
    },
    {
        " and ": null
    },
    {
        "eIF42G": "eif-4g"
    },
    {
        ", and ": null
    },
    {
        "poly-binding protein": "poly-binding protein"
    },
    {
        ". eIF42E and eIF42G block the decapping enzyme , and poly-binding protein blocks the ": null
    },
    {
        "exosome complex": "exosome complex"
    },
    {
        ", protecting the ends of the message. The balance between translation and decay is reflected in the size and abundance of cytoplasmic structures known as ": null
    },
    {
        "P-bodies": "p-bodies"
    },
    {
        "  The ": null
    },
    {
        "poly tail": "polyadenylation"
    },
    {
        " of the mRNA is shortened by specialized exonucleases that are targeted to specific messenger RNAs by a combination of cis-regulatory sequences on the RNA and trans-acting RNA-binding proteins. Poly tail removal is thought to disrupt the circular structure of the message and destabilize the ": null
    },
    {
        "cap binding complex": "cap binding complex"
    },
    {
        ". The message is then subject to degradation by either the ": null
    },
    {
        "exosome complex": "exosome complex"
    },
    {
        " or the ": null
    },
    {
        "decapping complex": "decapping complex"
    },
    {
        ". In this way, translationally inactive messages can be destroyed quickly, while active messages remain intact. The mechanism by which translation stops and the message is handed-off to decay complexes is not understood in detail.       The presence of ": null
    },
    {
        "AU-rich element": "au-rich element"
    },
    {
        "s in some mammalian mRNAs tends to destabilize those transcripts through the action of cellular proteins that bind these sequences and stimulate ": null
    },
    {
        "poly": "poly"
    },
    {
        " tail removal. Loss of the poly tail is thought to promote mRNA degradation by facilitating attack by both the ": null
    },
    {
        "exosome complex": "exosome complex"
    },
    {
        "  and the ": null
    },
    {
        "decapping complex": "decapping complex"
    },
    {
        ".  Rapid mRNA degradation via ": null
    },
    {
        "AU-rich element": "au-rich element"
    },
    {
        "s is a critical mechanism for preventing the overproduction of potent cytokines such as tumor necrosis factor and granulocyte-macrophage colony stimulating factor .  AU-rich elements also regulate the biosynthesis of proto-oncogenic transcription factors like ": null
    },
    {
        "c-Jun": "c-jun"
    },
    {
        " and ": null
    },
    {
        "c-Fos": "c-fos"
    },
    {
        ".             Eukaryotic messages are subject to surveillance by ": null
    },
    {
        "nonsense mediated decay": "nonsense mediated decay"
    },
    {
        " , which checks for the presence of premature stop codons in the message. These can arise via incomplete splicing, ": null
    },
    {
        "VJ recombination": "vj recombination"
    },
    {
        " in the ": null
    },
    {
        "adaptive immune system": "adaptive immune system"
    },
    {
        ", mutations in DNA, transcription errors, ": null
    },
    {
        "leaky scanning": "leaky scanning"
    },
    {
        " by the ribosome causing a ": null
    },
    {
        "frame shift": "frame shift"
    },
    {
        ", and other causes. Detection of a premature stop codon triggers mRNA degradation by 42 decapping, 42 ": null
    },
    {
        "poly": "poly"
    },
    {
        " tail removal, or ": null
    },
    {
        "endonucleolytic cleavage": "endonuclease"
    },
    {
        ".             In ": null
    },
    {
        "metazoan": "metazoan"
    },
    {
        "s, ": null
    },
    {
        "small interfering RNA": "small interfering rna"
    },
    {
        "s processed by ": null
    },
    {
        "Dicer": "dicer"
    },
    {
        " are incorporated into a complex known as the ": null
    },
    {
        "RNA-induced silencing complex": "rna-induced silencing complex"
    },
    {
        " or RISC. This complex contains an ": null
    },
    {
        "endonuclease": "endonuclease"
    },
    {
        " that cleaves perfectly complementary messages to which the siRNA binds. The resulting mRNA fragments are then destroyed by ": null
    },
    {
        "exonuclease": "exonuclease"
    },
    {
        "s. siRNA is commonly used in laboratories to block the function of genes in cell culture. It is thought to be part of the innate immune system as a defense against double-stranded RNA viruses.             MicroRNAs are small RNAs that typically are partially complementary to sequences in metazoan messenger RNAs.  Binding of a miRNA to a message can repress translation of that message and accelerate poly tail removal, thereby hastening mRNA degradation. The mechanism of action of miRNAs is the subject of active research.        There are other ways by which messages can be degraded, including ": null
    },
    {
        "non-stop decay": "non-stop decay"
    },
    {
        " and silencing by ": null
    },
    {
        "Piwi-interacting RNA": "piwi-interacting rna"
    },
    {
        " , among others.       Full length mRNA molecules have been proposed as therapeutics since the beginning of the biotech era but there was little traction until the 42s, when ": null
    },
    {
        "Moderna Therapeutics": "moderna therapeutics"
    },
    {
        " was founded and managed to raise almost a billion dollars in venture funding in its first three years.         Theoretically, the administered mRNA sequence can cause a cell to make a protein, which in turn could directly treat a disease or could function as a ": null
    },
    {
        "vaccine": "vaccine"
    },
    {
        "; more indirectly the protein could drive an endogenous ": null
    },
    {
        "stem cell": "stem cell"
    },
    {
        " to differentiate in a desired way.       The primary challenges of RNA therapy center on delivering the RNA to directed cells, more even than determining what sequence to deliver. Naked RNA sequences will naturally degrade after preparation; they may trigger the bodys ": null
    },
    {
        "immune system": "immune system"
    },
    {
        " to attack them as an invader; and they are ": null
    },
    {
        "impermeable": "semipermeable membrane"
    },
    {
        " to the ": null
    },
    {
        "cell membrane": "cell membrane"
    },
    {
        ". Once within the cell, they must then leave the cells transport mechanism to take action within the ": null
    },
    {
        "cytoplasm": "cytoplasm"
    },
    {
        ", which houses the ": null
    },
    {
        "ribosomes": "ribosomes"
    },
    {
        " that direct manufacture of ": null
    },
    {
        "proteins": "proteins"
    }
]