[
    {
        "Messianic Judaism is a modern ": null
    },
    {
        "syncretic": "syncretism"
    },
    {
        " religious movement that combines ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        "—most importantly, the belief that ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " is the ": null
    },
    {
        "Jewish messiah": "messiah in judaism"
    },
    {
        "—with elements of ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        " and ": null
    },
    {
        "Jewish tradition": "jewish culture"
    },
    {
        ". It emerged in the 42s and 42s.      Messianic Jews believe that ": null
    },
    {
        "Jesus": "jesus in christianity"
    },
    {
        " is the Jewish Messiah and ": null
    },
    {
        "God the Son": "god the son"
    },
    {
        " , and that the ": null
    },
    {
        "Tanakh": "tanakh"
    },
    {
        " and ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " are the authoritative scriptures. ": null
    },
    {
        "Salvation": "special salvation"
    },
    {
        " in Messianic Judaism ": null
    },
    {
        "is achieved": "sola fide"
    },
    {
        " only through acceptance of Jesus as ones savior, and Jewish laws or customs which are followed ": null
    },
    {
        "do not contribute to salvation": "cultural judaism"
    },
    {
        ". Belief in the messiahship of Jesus, his power to save, and his divinity are considered by Jewish authorities to be the defining distinctions between ": null
    },
    {
        "Christianity and Judaism": "christianity and judaism"
    },
    {
        ". Other Christian groups usually accept Messianic Judaism as a form of Christianity.     Many adherents of Messianic Judaism are ": null
    },
    {
        "ethnically Jewish": "ethnically jewish"
    },
    {
        " and argue that the movement is a sect of Judaism. Many refer to themselves in ": null
    },
    {
        "Hebrew": "hebrew"
    },
    {
        " as  , not converts, and  , not  . Jewish organizations and the ": null
    },
    {
        "Supreme Court of Israel": "supreme court of israel"
    },
    {
        " have rejected this claim in cases related to the ": null
    },
    {
        "Law of Return": "law of return"
    },
    {
        ", and instead consider Messianic Judaism to be a form of Christianity.     From 42 to 42 the movement grew from 42 Messianic houses of worship in the United States to as many as 42 with over 42 in Israel and more worldwide; congregations are often affiliated with larger Messianic organizations or alliances. , population estimates for the United States were between 42 and 42 members, between 42 and 42 members for Israel, and an estimated total worldwide membership of 42.           Efforts by ": null
    },
    {
        "Jewish Christians": "jewish christians"
    },
    {
        " to ": null
    },
    {
        "proselytize Jews": "christian mission to jews"
    },
    {
        " began in the first century, when ": null
    },
    {
        "Paul the Apostle": "paul the apostle"
    },
    {
        " preached at the synagogues in each city that he visited. However, by the fourth century CE, non-biblical accounts of missions to the Jews do not mention converted Jews playing any leading role in proselytization. Notable converts from Judaism who attempted to convert other Jews are more visible in historical sources beginning around the 42th century, when Jewish convert ": null
    },
    {
        "Pablo Christiani": "pablo christiani"
    },
    {
        " attempted to convert other Jews. This activity, however, typically lacked any independent Jewish-Christian congregations, and was often imposed through force by organized Christian churches.          In the 42th century, some groups attempted to create congregations and societies of Jewish converts to Christianity, though most of these early organizations were short-lived. Early formal organizations run by converted Jews include: the Anglican ": null
    },
    {
        "London Society for promoting Christianity among the Jews": "london society for promoting christianity among the jews"
    },
    {
        " of ": null
    },
    {
        "Joseph Frey": "joseph frey"
    },
    {
        " , which published the first ": null
    },
    {
        "Yiddish New Testament": "bible translations by language"
    },
    {
        " in 42;  the Beni Abraham association, established by Frey in 42 with a group of 42 ": null
    },
    {
        "Jewish Christian": "jewish christian"
    },
    {
        "s who started meeting at Jews Chapel, London for prayers Friday night and Sunday morning; and the London ": null
    },
    {
        "Hebrew Christian Alliance of Great Britain": "hebrew christian alliance of great britain"
    },
    {
        " founded by Dr. ": null
    },
    {
        "Carl Schwartz": "carl schwartz"
    },
    {
        " in 42     The September 42 meeting of Freys Beni Abraham congregation at the rented Jews Chapel in ": null
    },
    {
        "Spitalfields": "spitalfields"
    },
    {
        " is sometimes pointed to as the birth of the semi-autonomous ": null
    },
    {
        "Hebrew Christian movement": "hebrew christian movement"
    },
    {
        " within Anglican and other established churches in Britain. However, the minister of the chapel at Spitalfields evicted Frey and his congregation three years later, and Frey severed his connections with the Society. A new location was found and the Episcopal Jews Chapel Abrahamic Society registered in 42     In ": null
    },
    {
        "Eastern Europe": "eastern europe"
    },
    {
        ", ": null
    },
    {
        "Joseph Rabinowitz": "joseph rabinowitz"
    },
    {
        " established a Hebrew Christian mission and congregation called Israelites of the New Covenant in ": null
    },
    {
        "Kishinev, Bessarabia": "kishinev"
    },
    {
        ", in 42 Rabinowitz was supported from overseas by the Christian ": null
    },
    {
        "Hebraist": "hebraist"
    },
    {
        " Franz Delitzsch": "franz delitzsch"
    },
    {
        ", translator of the first modern ": null
    },
    {
        "Hebrew translation of the New Testament": "bible translations into hebrewnew testament"
    },
    {
        ". The Missionary review of the world No. 42 Royal Gould Wilder, Delavan Leonard Pierson, James Manning Sherwood – 42 The letter to Joseph Rabinowitz brought an encouraging answer and also a few copies of the New Testament translated into Hebrew by Franz Delitzsch. They gave Scheinmann the thought to organize a class of young men for their study In 42 Rabinowitz created a sample order of worship for Sabbath morning service based on a mixture of Jewish and Christian elements. Mark John Levy pressed the Church of England to allow members to embrace Jewish customs.     In the United States, a congregation of Jewish converts to Christianity was established in New York City in 42 In the 42s, immigrant Jewish converts to Christianity worshiped at the ": null
    },
    {
        "Methodist": "methodism"
    },
    {
        " Hope of Israel mission on New Yorks ": null
    },
    {
        "Lower East Side": "lower east side"
    },
    {
        " while retaining some Jewish rites and customs. In 42 the 42th edition of Hope of Israels Our Hope magazine carried the subtitle A Monthly Devoted to the Study of Prophecy and to Messianic Judaism , the first use of the term Messianic Judaism . In 42 Christian missionary ": null
    },
    {
        "Leopold Cohn": "leopold cohn"
    },
    {
        ", a convert from Judaism, founded the Brownsville Mission to the Jews in the Brownsville section of Brooklyn, New York as a Christian mission to Jews. After several changes in name, structure, and focus, the organization is now called ": null
    },
    {
        "Chosen People Ministries": "chosen people ministries"
    },
    {
        ".     Missions to the Jews saw a period of growth between the 42s and the 42s.  In the 42s and 42s, missionaries in Israel, including the ": null
    },
    {
        "Southern Baptists": "southern baptist convention"
    },
    {
        ", adopted the term   to counter negative connotations of the word  . The term was used to designate all Jews who had converted to Protestant evangelical Christianity.       The Messianic Jewish movement emerged in the United States in the 42s.  Prior to this time, Jewish converts assimilated into gentile Christianity, as the church required abandoning their Jewishness and assuming Gentile ways to receive baptism. ": null
    },
    {
        "Peter Hocken": "peter hocken"
    },
    {
        " postulates that the Jesus movement which swept the nation in the 42s triggered a change from Hebrew Christians to Messianic Jews, and was a distinctly ": null
    },
    {
        "charismatic movement": "charismatic movement"
    },
    {
        ". These Jews wanted to stay Jewish while believing in Jesus . This impulse was amplified by the results of the ": null
    },
    {
        "Six-Day War": "six-day war"
    },
    {
        " and the restoration of Jerusalem to Jewish control.       In 42 there were 42 Messianic congregations in the United States with maybe half of their attendance being Gentiles and maybe one third of the congregations consisting of thirty or fewer members. Many of these congregations belong to the International Association of Messianic Congregations and Synagogues , the Union of Messianic Congregations , or Tikkun International.     The Messianic Jewish Alliance of America began in 42 as the Hebrew Christian Alliance of America . As the idea of maintaining Jewish identity spread in the late 42s, the Hebrew Christian Alliance of America changed its name to the Messianic Jewish Alliance of America . ": null
    },
    {
        "David Rausch": "david a. rausch"
    },
    {
        " writes that the change signified far more than a semantical expression—it represented an evolution in the thought processes and religious and philosophical outlook toward a more fervent expression of Jewish identity.  The MJAA was and still is an organization of individual Jewish members.  In 42 the MJAA formed a congregational branch called the International Alliance of Messianic Congregations and Synagogues .     In June 42 nineteen congregations in North America met at Mechanicsburg, Pennsylvania and formed the Union of Messianic Jewish Congregations .     Tikkun International is a Messianic Jewish umbrella organization for an apostolic network of leaders, congregations and ministries in covenantal relationship for mutual accountability, support and equipping to extend the Kingdom of God in America, Israel, and throughout the world.           The Messianic Seal of Jerusalem is a symbol for Messianic Judaism and ": null
    },
    {
        "Christians": "christians"
    },
    {
        ". The symbol is seen as a depiction of the ": null
    },
    {
        "Menorah": "menorah"
    },
    {
        ", an ancient ": null
    },
    {
        "Jewish": "judaism"
    },
    {
        " symbol, together with the ": null
    },
    {
        "Ichthys": "ichthys"
    },
    {
        ", an ancient depictive representation of ": null
    },
    {
        "Christian faith": "christianity"
    },
    {
        " and the community of ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " followers, creating a ": null
    },
    {
        "Star of David": "star of david"
    },
    {
        " at the intersection. The Messianic Seal is not the only symbol of Messianic Judaism, which has other graphical representations such as the Menorah and Star of David, the cross in the Star of David, among others.     There is an ongoing dispute as to whether or not the seal dates from the 42st century AD, or if it is a 42th-century invention.             As with many religious faiths, the exact tenets held vary from congregation to congregation.  In general, essential doctrines of Messianic Judaism include views on:   God: that he is omnipotent, omnipresent, eternal, outside creation, infinitely significant and benevolent; viewpoints vary on the ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        " Jewish Messiah": "jewish messiah"
    },
    {
        "; views on his divinity vary   written ": null
    },
    {
        "Torah": "torah"
    },
    {
        ": Messianic Jews believe, with a few exceptions, that Jesus taught and reaffirmed the Torah and that it remains fully in force   Israel: the ": null
    },
    {
        "Children of Israel": "children of israel"
    },
    {
        " are central to Gods plan; ": null
    },
    {
        "replacement theology": "replacement theology"
    },
    {
        " is opposed   the Bible: the ": null
    },
    {
        "Tanakh": "tanakh"
    },
    {
        " and the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " are usually considered the divinely inspired Scripture, though Messianic Judaism is more open to criticism of the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " canon than is Christianity   eschatology: similar to many evangelical Christian views   ": null
    },
    {
        "oral law": "oral torah"
    },
    {
        ": observance varies, but most deem these traditions subservient to the written Torah     Certain additional doctrines are more open to differences in interpretation, including those on sin and atonement and on faith and works.       Many Messianic Jews affirm the doctrine of the Trinity: ": null
    },
    {
        "God the Father": "god the father"
    },
    {
        ", God the Son, and God the ": null
    },
    {
        "Holy Spirit": "holy spirit"
    },
    {
        " as three representations of the same divinity.   God the Father—Messianic Jews believe in ": null
    },
    {
        "God": "god"
    },
    {
        " and that he is all-powerful, omnipresent, eternally existent outside of creation, and infinitely significant and benevolent. Some Messianic Jews affirm both the ": null
    },
    {
        "Shema": "shema"
    },
    {
        " and the Trinity, understanding the phrase the Lord is One to be referring to a differentiated but singular deity , and eternally existent in plural oneness . A small number of Messianic believers profess only a strict view of monotheism, rejecting Trinitarian doctrine.   God the Son—Most Messianic Jews consider Jesus to be the Messiah and divine as God the Son, in line with mainstream Christianity, and will even pray directly to him. Many also consider Jesus to be their chief teacher and rabbi whose life should be copied. Some congregations do not directly ascribe divinity to Jesus, considering him a man—yet not just a man, fathered by the Holy Spirit, who became the Messiah. Even others consider him Word made flesh and the human expression of Divinity .   God the Holy Spirit—According to some Messianic Jews, the Spirit is introduced in the Old Testament, is the inspirer of prophets, and is the spirit of Truth described in the New Testament.           Both the ": null
    },
    {
        "Hebrew Bible": "hebrew bible"
    },
    {
        " and the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " are usually considered to be the established and divinely inspired Biblical scriptures by Messianic Jews. With a few exceptions, Messianic believers generally consider the written Torah, the five books of ": null
    },
    {
        "Moses": "moses"
    },
    {
        ", to remain in force as a continuing covenant, revised by Jesus and the Apostles in the New Testament, that is to be observed both morally and ritually. Jesus did not annul the Torah, but its interpretation is revised through the Apostolic scriptures.       There is no unanimity among Messianic congregations on the issue of the Talmud and the ": null
    },
    {
        "Oral Torah": "oral torah"
    },
    {
        ". There are congregations which believe that adherence to the Oral Law, as encompassed by the Talmud, is against Messianic beliefs. Similarly, there are congregations which deny the authority of the ": null
    },
    {
        "Pharisees": "pharisees"
    },
    {
        ", believing that they were superseded, and their teachings contradicted, by Messianism. There are adherents which call rabbinic commentaries such as the ": null
    },
    {
        "Mishnah": "mishnah"
    },
    {
        " and the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        " dangerous , and state that followers of rabbinic and ": null
    },
    {
        "halakhic": "halakha"
    },
    {
        " explanations and commentaries are not believers in Jesus as the Messiah. Other congregations are selective in their applications of Talmudic law, and may believe that the rabbinic commentaries such as the ": null
    },
    {
        "Mishnah": "mishnah"
    },
    {
        " and the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        ", while historically informative and useful in understanding tradition, are not normative and may not be followed where they differ from the New Testament. Still others encourage a serious observance of Jewish ": null
    },
    {
        "halakha": "halakha"
    },
    {
        ".          Messianic Jews generally consider the entire ": null
    },
    {
        "Christian Bible": "christian biblical canons"
    },
    {
        " to be sacred scripture. Theologian ": null
    },
    {
        "David H. Stern": "david h. stern"
    },
    {
        " in his Jewish New Testament Commentary argues that the writings and teachings of ": null
    },
    {
        "Paul the Apostle": "paul the apostle"
    },
    {
        " are fully congruent with Messianic Judaism, and that the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " is to be taken by Messianic Jews as the inspired Word of God.       There are a number of Messianic commentaries on various books of the Bible, both Tanakh and New Testament texts, such as ": null
    },
    {
        "Matthew": "gospel of matthew"
    },
    {
        ", ": null
    },
    {
        "Acts": "acts of the apostles"
    },
    {
        ", ": null
    },
    {
        "Romans": "epistle to the romans"
    },
    {
        ", ": null
    },
    {
        "Galatians": "epistle to the galatians"
    },
    {
        ", and ": null
    },
    {
        "Hebrews": "epistle to the hebrews"
    },
    {
        ". ": null
    },
    {
        "David H. Stern": "david h. stern"
    },
    {
        " has released a one-volume Jewish New Testament Commentary, providing explanatory notes from a Messianic Jewish point of view. Other New Testament commentary authors include ": null
    },
    {
        "Arnold Fruchtenbaum": "arnold fruchtenbaum"
    },
    {
        " of Ariel Ministries, who has written commentaries on the Epistles, Judges & Ruth, and Genesis, and 42 systematic doctrinal studies.       Some Messianic believers define ": null
    },
    {
        "sin": "sin"
    },
    {
        " as transgression of the Torah of God and include the concept of ": null
    },
    {
        "original sin": "original sin"
    },
    {
        ". Some adherents atone for their sins through prayer and ": null
    },
    {
        "repentance": "repentance"
    },
    {
        "—that is, acknowledgment of the wrongdoing and seeking forgiveness for their sins . Disagreeing with these rites and practices, other Messianics hold to a belief that all sin is already atoned for because of Jesuss death and resurrection.       Messianic Jews believe Gods people have a responsibility to spread his name and fame to all nations. It is believed that the ": null
    },
    {
        "Children of Israel": "children of israel"
    },
    {
        " were, remain, and will continue to be the chosen people of the God, and are central to his plans for existence. Most Messianic believers, whether Jewish or non-Jewish, can be said to oppose ": null
    },
    {
        "supersessionism": "supersessionism"
    },
    {
        " , the view that the ": null
    },
    {
        "Church": "christian church"
    },
    {
        " has replaced ": null
    },
    {
        "Israel": "israel"
    },
    {
        " in the mind and plans of God.     There exist among Messianic believers a number of perspectives regarding who exactly makes up Gods ": null
    },
    {
        "chosen people": "chosen people"
    },
    {
        ". Most commonly, Israel is seen as distinct from the church; Messianic Jews, being a part of both Israel and the church, are seen as the necessary link between the gentile People of God and the commonwealth of Gods people of Israel. The two-house view, and the one law/grafted-in view are held by many identifying as Messianic, although some Messianic groups do not espouse these theologies. According to certain branches of Messianic Judaism, Jews are individuals who have one or more Jewish parents, or who have undergone halakhic conversion to Judaism. Others accept all who accept Jesus into their hearts and confess that he is Lord.       One Law theology teaches that anyone who is a part of Israel is obligated to observe the Covenant and its provisions as outlined in the Torah. Dan Juster of Tikkun, and Russ Resnik of the UMJC, have argued against the One Law movements insistence on Gentiles being required to observe the entirety of Torah in the same way as Jews.   January 42 42 Tim Hegg responded to their article defending what he believes to be the biblical teaching of One Law theology and its implications concerning the obligations of Torah obedience by new Messianic believers from the nations.  The Coalition of Torah Observant Messianic Congregations likewise rejects bi-lateral Ecclesiology in favor of the One Torah for All position.       Proponents of ": null
    },
    {
        "Two House theology": "two house theology"
    },
    {
        " espouse their belief that the phrase ": null
    },
    {
        "House of Judah": "house of judah"
    },
    {
        " in scripture refers to Jews, while the ": null
    },
    {
        "House of Israel": "house of israel"
    },
    {
        " refers to the ": null
    },
    {
        "Ten Lost Tribes": "ten lost tribes"
    },
    {
        " of Israel, or ": null
    },
    {
        "Ephraim": "ephraim"
    },
    {
        ". Where scripture states the House of Israel and Judah will again be one stick , it is believed to be referring to the End Times, immediately prior to the ": null
    },
    {
        "Second Coming": "second coming"
    },
    {
        ", when many of those descended from Israel will come back to Israel. Advocates of this theology postulate that the reason so many gentiles are converting to Messianic Judaism is that the vast majority of them are truly Israelites. Like One Law groups, the Two House movement has many superficial similarities to Messianic Judaism, such as their belief in the ongoing validity of the Mosaic Covenant. While much of the Two House teaching is based on interpretations of Biblical prophecy, the biggest disagreements are due to inability to identify the genealogy of the Lost Tribes. Organizations such as the ": null
    },
    {
        "Messianic Jewish Alliance of America": "messianic jewish alliance of america"
    },
    {
        " and ": null
    },
    {
        "Union of Messianic Jewish Congregations": "union of messianic jewish congregations"
    },
    {
        " have explicitly opposed the Two House teaching. MJAA position paper:        Historically, Christianity has taught ": null
    },
    {
        "supersessionism": "supersessionism"
    },
    {
        " , which implies or outright states that Christianity has superseded Judaism, and that the ": null
    },
    {
        "Mosaic Covenant": "mosaic covenant"
    },
    {
        " of the Hebrew Bible has been superseded by the ": null
    },
    {
        "New Covenant": "new covenant"
    },
    {
        " of Jesus, wherein salvation is brought about by the grace of God, and not by obedience to the Torah.  This is generally complemented with the concept of God having transferred the status of Gods people from the Jews to the Christian Church. Messianic Jews, in varying degrees, challenge both thoughts,  and instead believing that although Israel has rejected Jesus, it has not forfeited its status as Gods chosen people . Often cited is Romans 42:42: for Gods gifts and his call are irrevocable . The core of supersessionism, in which the Mosaic Covenant is canceled, is less agreed upon. Though the ": null
    },
    {
        "mitzvot": "mitzvah"
    },
    {
        " may or may not be seen as necessary, most are still followed, especially the keeping of Shabbat and other holy days.          All Messianic Jews hold to certain ": null
    },
    {
        "eschatological": "eschatology"
    },
    {
        " beliefs such as the ": null
    },
    {
        "End of Days": "end of days"
    },
    {
        ", the Second Coming of Jesus as the conquering Messiah, the re-gathering of Israel, a rebuilt ": null
    },
    {
        "Third Temple": "third temple"
    },
    {
        ", a ": null
    },
    {
        "resurrection of the dead": "resurrection of the dead"
    },
    {
        ", and many believe in the ": null
    },
    {
        "Millennial Sabbath": "millennialism"
    },
    {
        ", although some are Amillenialist. Some Messianic Jews believe that all of the ": null
    },
    {
        "Jewish holidays": "jewish holidays"
    },
    {
        ", and indeed the entire Torah, intrinsically hint at the Messiah, and thus no study of the ": null
    },
    {
        "End Times": "end times"
    },
    {
        " is complete without understanding the major ": null
    },
    {
        "Jewish Festivals": "jewish festivals"
    },
    {
        " in their larger prophetic context. To certain believers, the feasts of ": null
    },
    {
        "Pesach": "passover"
    },
    {
        " and ": null
    },
    {
        "Shavuot": "shavuot"
    },
    {
        " were fulfilled in Jesuss first coming, and ": null
    },
    {
        "Rosh Hashanah": "rosh hashanah"
    },
    {
        ", ": null
    },
    {
        "Yom Kippur": "yom kippur"
    },
    {
        ", and ": null
    },
    {
        "Sukkot": "sukkot"
    },
    {
        " will be at his second. Some also believe in a literal 42-year period for the human history of the world, with a Millennial Messianic kingdom prior to a final judgment.              There is a variety of practice within Messianic Judaism regarding the strictness of Torah observance. Generally, Torah observant congregations observe Jewish prayers, biblical feasts, and Sabbath. While most traditional Christians deny that the ritual laws and specific civil laws of the Torah apply to Gentiles, certain passages regarding Torah observance in the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " are cited by some Messianic believers as proof that Torah was not abolished for Jews. They point out that in Acts 42 Jewish believers in Jerusalem are described as zealous for the Law .  Acts 42:4242 Paul Visits James at Jerusalem, ‘You see, brother, how many thousands of believers there are among the Jews, and they are all zealous for the law. They have been told about you that you teach all the Jews living among the Gentiles to forsake Moses, and that you tell them not to circumcise their children or observe the customs.       Some Messianic Jews observe ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        " on Saturdays. Worship services are generally held on Friday evenings  or Saturday mornings. According to the Southern Baptist Messianic Fellowship , services are held on Saturday to open the doors to Jewish people who also wish to keep the Sabbath . The liturgy used is similar to that of a Jewish ": null
    },
    {
        "siddur": "siddur"
    },
    {
        " with some important differences including the omission of salvation by works as the Messianic belief is salvation through Jesus. Other branches of the movement have attempted to eliminate the elements of Christian worship such as frequent ": null
    },
    {
        "communion": "communion rite"
    },
    {
        " that cannot be directly linked to their Jewish roots . Almost all such congregations in Israel observe Jewish holidays, which they understand to have their fulfillment in Jesus.     The Messianic Jewish Rabbinical Council recommends the observance of Jewish holidays.  Most larger Messianic Jewish congregations follow Jewish custom in celebrating the three biblical feasts , as well as ": null
    },
    {
        "Yom Kippur": "yom kippur"
    },
    {
        " and ": null
    },
    {
        "Rosh Hashanah": "rosh hashanah"
    },
    {
        ".       The observance of the  kashrut  dietary laws is a subject of continued debate among Messianic Jews.  Some Messianic believers keep kosher purely for the purposes of evangelism to Jewish people. Most avoid pork and shellfish, but there is disagreement on more strict adherence to kosher dietary laws.       Large numbers of those calling themselves Messianic Jews are not of Jewish descent, but join the movement anyway as they enjoy the Messianic Jewish style of worship . Brown Answering Jewish Objections to Jesus p. 42 42 Messianic perspectives on ": null
    },
    {
        "Who is a Jew?": "who is a jew?"
    },
    {
        " vary. The Messianic Jewish Rabbinical Council, acknowledges a Jew as one born to a Jewish mother, or who has converted to Judaism. Copying from the Reform stream of Judaism, the Council also recognizes as a Jew one who was born to a Jewish father but not a Jewish mother on the condition that the family of the child, or the individual as an adult, has undertaken public and formal acts of identification of the individual with the Jewish faith and people. The MJAA accepts Gentiles into their congregations, but views Gentiles and Jews as spritually distinct and conversion as an unbiblical practice . Other Messianic organizations hold to similar views.       Messianic Jews practice ": null
    },
    {
        "baptism": "baptism"
    },
    {
        ", calling it a  mikveh  rather than the term tvila .       Some within the ": null
    },
    {
        "Ephraimite": "ephraimite"
    },
    {
        " movement seek to convert themselves for identification with Israel, but most Messianic governing bodies acknowledge the presence of gentiles in the congregations, and do not see a need for them to convert to worship in the Messianic style and understanding. When conversion is sincerely desired by a gentile Messianic believer, Messianic Jewish halachic standards are imposed to maintain integrity among the world Messianic Jewish community.       The movement generally avoids common Christian terms, such as Jesus, Christ, or cross and prefers to use Hebrew or Aramaic terms.           Messianic Jewish hymns differ from evangelical Christian ones in their focus on Israels role in history and messianic hope. Other differences include reference to Jesus—usually using the name Yeshua—as the Savior of Israel. Messianic hymnals often also incorporate Israeli songs. The movement also has several recording artists who consider their music to be Messianic in message, such as Joel Chernoff of the duo Lamb, Ted Pearce, and Chuck King.           In the United States, the emergence of the Messianic Jewish movement created some stresses with other Jewish-Christian and missionary organization. In 42 the ": null
    },
    {
        "Fellowship of Christian Testimonies to the Jews": "fellowship of christian testimonies to the jews"
    },
    {
        " condemned several aspects of the Messianic Jewish movement. Peter J. Tomson, Doris Lambers-Petry The image of the Judaeo-Christians in ancient Jewish and Christian ... 42 p. 42 From outside the movement hostile criticism of Messianic Judaism was voiced by such bodies as the Fellowship of Christian Testimonies to the Jews. At their annual conference from 42 to 42 October 42 a resolution was passed condemning     In Israel, the linguistic distinction between Messianic Jews and mainstream Christians is less clear, and the name   is commonly used by churches in lieu of  . The Israel Trust of the Anglican Church, based at ": null
    },
    {
        "Christ Church, Jerusalem": "christ church, jerusalem"
    },
    {
        ", an organization that is ": null
    },
    {
        "ecumenical": "ecumenical"
    },
    {
        " in outlook and operates an interfaith school in Jerusalem, gives some social support to Messianic Jews in Israel.          As in traditional Jewish objections to Christian theology, opponents of Messianic Judaism hold that Christian proof texts, such as prophecies in the Hebrew Bible purported to refer the Messiahs suffering and death, have been taken out of context and misinterpreted. Jewish theology rejects the idea that the Messiah, or any human being, is a ": null
    },
    {
        "divinity": "divinity"
    },
    {
        ". Belief in the ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        " is considered idolatrous by most rabbinic authorities. Even if considered  shituf  —an association of other individuals with the God of Israel—this is only permitted for gentiles, and that only according to some rabbinic opinions. It is universally considered idolatrous for Jews.  Further, Judaism does not view the role of the Messiah to be the salvation of the world from its sins, an integral teaching of Christianity and Messianic Judaism.     Jewish opponents of Messianic Judaism often focus their criticism on the movements radical ideological separation from traditional Jewish beliefs, stating that the acceptance of Jesus as Messiah creates an insuperable divide between the traditional messianic expectations of Judaism, and Christianitys theological claims. They state that while Judaism is a messianic religion, its messiah is not Jesus, and thus the term is misleading. All denominations of Judaism, as well as national Jewish organizations, reject Messianic Judaism as a form of Judaism. Regarding this divide, ": null
    },
    {
        "Reconstructionist": "reconstructionist judaism"
    },
    {
        " Rabbi ": null
    },
    {
        "Carol Harris-Shapiro": "carol harris-shapiro"
    },
    {
        " observed: To embrace the radioactive core of goyishness—Jesus—violates the final taboo of Jewishness.…Belief in Jesus as Messiah is not simply a heretical belief, as it may have been in the first century; it has become the equivalent to an act of ethno-cultural suicide.      ": null
    },
    {
        "Bnai Brith Canada": "bnai brith canada"
    },
    {
        " considers messianic activities as antisemitic incidents. Rabbi ": null
    },
    {
        "Tovia Singer": "tovia singer"
    },
    {
        ", founder of the anti-missionary organization ": null
    },
    {
        "Outreach Judaism": "outreach judaism"
    },
    {
        ", noted of a Messianic rabbi in Toledo: Hes not running a Jewish synagogue.…Its a church designed to appear as if it were a synagogue and Im there to expose him. What these irresponsible extremist Christians do is a form of consumer fraud. They blur the distinctions between Judaism and Christianity in order to lure Jewish people who would otherwise resist a straightforward message.     Association by a Jewish politician with a Messianic rabbi, inviting him to pray at a public meeting, even though made in error, resulted in nearly universal condemnation by Jewish congregations in Detroit in 42 as the majority opinion in both Israeli and American Jewish circles is to consider Messianic Judaism as Christianity and its followers as Christians.          Messianic Jews are considered eligible for the ": null
    },
    {
        "State of Israel": "state of israel"
    },
    {
        "s ": null
    },
    {
        "Law of Return": "law of return"
    },
    {
        " only if they can also claim Jewish descent. An assistant to one of the two lawyers involved with an April 42 ": null
    },
    {
        "Supreme Court of Israel": "supreme court of israel"
    },
    {
        " case explained to the ": null
    },
    {
        "Jerusalem Post": "jerusalem post"
    },
    {
        " that Messianic Jews who are not Jewish according to Jewish rabbinic law, but who had sufficient Jewish descent to qualify under the Law of Return, could claim automatic new immigrant status and citizenship despite being Messianic. The state of Israel grants ": null
    },
    {
        "Aliyah ": "law of return"
    },
    {
        " and citizenship to Jews, and to those with Jewish parents or grandparents who are not considered Jews according to halakha, e.g. people who have a Jewish father but a non-Jewish mother. The old law had excluded any person who has been a Jew and has voluntarily changed his religion , and an ": null
    },
    {
        "Israeli Supreme Court": "supreme court of israel"
    },
    {
        " decision in 42 had ruled that Messianic Judaism constituted another religion. However, on April 42 42 the Supreme Court of Israel ruled in a case brought by a number of Messianic Jews with Jewish fathers and grandfathers. Their applications for Aliyah had been rejected on the grounds that they were Messianic Jews. The argument was made by the applicants that they had never been Jews according to halakha, and were not therefore excluded by the conversion clause. This argument was upheld in the ruling.     The International Religious Freedom Report 42 released by the Bureau of Democracy, Human Rights, and Labor in the US, stated that discrimination against Messianic Jews in Israel was increasing. Some acts of violence have also occurred such as incident on March 42 42 a bomb concealed as a Purim gift basket was delivered to the house of a prominent Messianic Jewish family in ": null
    },
    {
        "Ariel": "ariel"
    },
    {
        ", in the ": null
    },
    {
        "West Bank": "west bank"
    },
    {
        ", which severely wounded the son. Eventually, ": null
    },
    {
        "Yaakov Teitel": "yaakov teitel"
    },
    {
        " was arrested for the attempted murder.     This antagonism has led to harassment and some violence, especially in Israel, where there is a large and militant Orthodox community. Several Orthodox organizations, including ": null
    },
    {
        "Yad LAchim": "yad lachim"
    },
    {
        ", are dedicated to rooting out missionary activity in Israel, including the Messianic Jewish congregations. One tactic is to plaster posters asking Israelis to boycott shops where Messianic Jews are owners or employees; another is to report Messianic Jews to the Interior ministry, which is charged with enforcing an Israeli law forbidding proselytizing. In another incident, the mayor of Or Yehuda, a suburb of Tel Aviv, held a public book-burning of literature passed out to Ethiopian immigrants. He later apologized for the action.       The US Navy made a decision that Messianic Jewish chaplains must wear as their insignia the Christian cross, and not the tablets of the law, the insignia of Jewish chaplains. According to ": null
    },
    {
        "Yeshiva World News": "yeshiva world news"
    },
    {
        ", the Navy Uniform Board commanded that Michael Hiles, a candidate for chaplaincy, wear the Christian insignia. Hiles resigned from the program, rather than wear the cross. Rabbi Eric Tokajer, a spokesman for the Messianic Jewish movement, responded that This decision essentially bars Messianic Jews from serving as chaplains within the U.S. Navy because it would require them to wear an insignia inconsistent with their faith and belief system.     A ": null
    },
    {
        "Birmingham, Alabama": "birmingham, alabama"
    },
    {
        " police employees religious discrimination case was settled in her favor after she filed suit over having to work on the Jewish Sabbath.           ": null
    },
    {
        "Chosen People Ministries": "chosen people ministries"
    },
    {
        " .    HaYesod is a discipleship course that respectfully explores the Jewish foundation of Christianity. There are currently 42 HaYesod study groups of five or more members.    International Alliance of Messianic Congregations and Synagogues .   The Jerusalem Council, an organization seeking to become a ruling council for Messianic believers worldwide.   ": null
    },
    {
        "Jews for Jesus": "jews for jesus"
    },
    {
        " . ": null
    },
    {
        "Messianic Jewish Alliance of America": "messianic jewish alliance of america"
    },
    {
        " .    Messianic Jewish Rabbinical Council   ": null
    },
    {
        "Union of Messianic Jewish Congregations": "union of messianic jewish congregations"
    },
    {
        " .    ": null
    }
]