[
    {
        "A metallocene is a compound typically consisting of two ": null
    },
    {
        "cyclopentadienyl anions": "cyclopentadienyl anion"
    },
    {
        "  bound to a ": null
    },
    {
        "metal": "metallic element"
    },
    {
        " center in the ": null
    },
    {
        "oxidation state": "oxidation state"
    },
    {
        " II, with the resulting general formula  Closely related to the metallocenes are the metallocene derivatives, e.g. ": null
    },
    {
        "titanocene dichloride": "titanocene dichloride"
    },
    {
        ", ": null
    },
    {
        "vanadocene dichloride": "vanadocene dichloride"
    },
    {
        ". Certain metallocenes and their derivatives exhibit ": null
    },
    {
        "catalytic": "catalysis"
    },
    {
        " properties, although metallocenes are rarely used industrially. Cationic group 4 metallocene derivatives related to + catalyze ": null
    },
    {
        "olefin polymerization": "ziegler–natta catalyst"
    },
    {
        ".     Some metallocenes consist of metal plus two ": null
    },
    {
        "cyclooctatetraenide anions": "cyclooctatetraenide anion"
    },
    {
        " , namely the lanthanocenes and the ": null
    },
    {
        "actinocenes": "actinocene"
    },
    {
        " .     Metallocenes are a subset of a broader class of compounds called ": null
    },
    {
        "sandwich compounds": "sandwich compound"
    },
    {
        " .   In the structure shown at right, the two pentagons are the cyclopentadienyl anions with circles inside them indicating they are ": null
    },
    {
        "aromatically": "aromaticity"
    },
    {
        " stabilized. Here they are shown in a ": null
    },
    {
        "staggered conformation": "staggered conformation"
    },
    {
        ".          The first metallocene to be classified was ": null
    },
    {
        "ferrocene": "ferrocene"
    },
    {
        ", and was discovered simultaneously in 1951 by Kealy and Pauson, and Miller et al.  Kealy and Pauson were attempting to synthesize ": null
    },
    {
        "fulvalene": "fulvalene"
    },
    {
        " through the oxidation of a ": null
    },
    {
        "cyclopentadienyl": "cyclopentadienyl anion"
    },
    {
        " salt with anhydrous FeCl 3 but obtained instead the substance C 10 H 10 Fe  At the same time, Miller et al reported the same iron product from a reaction of ": null
    },
    {
        "cyclopentadiene": "cyclopentadiene"
    },
    {
        " with iron in the presence of aluminum, potassium, or molybdenum oxides. The structure of C 10 H 10 Fe was determined by Wilkinson et al. and by Fischer et al.  These two were awarded the ": null
    },
    {
        "Nobel Prize in Chemistry": "nobel prize in chemistry"
    },
    {
        " in 1973 for their work on sandwich compounds, including the structural determination of ferrocene.  They determined that the carbon atoms of the ": null
    },
    {
        "cyclopentadienyl": "cyclopentadienyl"
    },
    {
        " ligand": "ligand"
    },
    {
        " contributed equally to the bonding and that bonding occurred due to the metal  and the  in the  of the Cp ligands. This complex is now known as ferrocene, and the group of ": null
    },
    {
        "transition metal": "transition metal"
    },
    {
        " dicyclopentadienyl compounds is known as metallocenes. Metallocenes have the general formula  Fischer et al. first prepared the ferrocene derivatives involving Co and Ni. Often derived from substituted derivatives of ": null
    },
    {
        "cyclopentadienide": "cyclopentadienide"
    },
    {
        ", metallocenes of many elements have been prepared.      One of the very earliest commercial manufacturers of metallocenes was Arapahoe Chemicals in Boulder, Colorado .          The general name metallocene is derived from ": null
    },
    {
        "ferrocene": "ferrocene"
    },
    {
        ", 2 Fe or Cp 2 Fe, systematically named  According to the ": null
    },
    {
        "IUPAC": "iupac"
    },
    {
        " definition, a metallocene contains a ": null
    },
    {
        "transition metal": "transition metal"
    },
    {
        " and two cyclopentadienyl ligands coordinated in a sandwich structure, i.e., the two cyclopentadienyl anions are on parallel ": null
    },
    {
        "planes": "plane"
    },
    {
        " with equal ": null
    },
    {
        "bond lengths": "bond length"
    },
    {
        "and strengths. Using the nomenclature of ": null
    },
    {
        "hapticity": "hapticity"
    },
    {
        " , the equivalent bonding of all 5 carbon atoms of a cyclopentadienyl ring is denoted as η 5 , pronounced pentahapto . There are exceptions, such as ": null
    },
    {
        "uranocene": "uranocene"
    },
    {
        ", which has two ": null
    },
    {
        "cyclooctatetraene": "cyclooctatetraene"
    },
    {
        " rings sandwiching a ": null
    },
    {
        "uranium": "uranium"
    },
    {
        " atom.     In metallocene names, the prefix before the -ocene ending indicates what ": null
    },
    {
        "metallic element": "metallic element"
    },
    {
        " is between the Cp groups. For example, in ferrocene, iron, ferrous iron is present.     In contrast to the more strict definition proposed by IUPAC, which requires a d-block metal and a sandwich structure, the term metallocene and thus the denotation -ocene, is applied in the chemical literature also to non-transition metal compounds, such as ": null
    },
    {
        "barocene": "barocene"
    },
    {
        " , or structures where the aromatic rings are not parallel, such as found in ": null
    },
    {
        "manganocene": "manganocene"
    },
    {
        " or ": null
    },
    {
        "titanocene dichloride": "titanocene dichloride"
    },
    {
        " .     Some metallocene complexes of ": null
    },
    {
        "actinides": "actinide"
    },
    {
        "have been reported where there are three cyclopendadienyl ligands for a monometallic complex, all three of them bound η 5 .          There are many –metal complexes and they can be classified by the following formulas:          Metallocene complexes can also be classified by type:     Parallel   Multi-decker   ": null
    },
    {
        "Half-sandwich compound": "half-sandwich compound"
    },
    {
        "   Bent metallocene": "bent metallocene"
    },
    {
        " or tilted   More than two Cp ligands         Three main routes are normally employed in the formation of these types of compounds:        Sodium cyclopentadienide is the preferred reagent for these types of reactions. It is most easily obtained by the reaction of molten sodium and dicyclopentadiene.  Traditionally, the starting point is the cracking of ": null
    },
    {
        "dicyclopentadienyl": "dicyclopentadienyl"
    },
    {
        ", the dimer of cyclopentadiene. Cyclopentadiene is deprotonated by strong bases or alkali metals.     :MCl 2 + 2  NaC 5 H 5 → 2 M + 2  NaCl      :CrCl 3 + 3  NaC 5 H 5 → +    C 10 H 10 + 3  NaCl     NaCp acts as a reducing agent and a ligand in this reaction.       This technique provides using metal atoms in the gas phase rather than the solid metal. The highly reactive atoms or molecules are generated at a high temperature under vacuum and brought together with chosen reactants on a cold surface.   :M + C 5 H 6 → MC 5 H 5 +   H 2    :M + 2  C 5 H 6 → + H 2        A variety of reagents have been developed that transfer Cp to metals. Once popular was ": null
    },
    {
        "thallium cyclopentadienide": "thallium cyclopentadienide"
    },
    {
        ". It reacts with metal halides to give thallium chloride, which is poorly soluble, and the ": null
    },
    {
        "cyclopentadienyl": "cyclopentadienyl"
    },
    {
        " complex. Trialkyl": null
    },
    {
        "tin": "tin"
    },
    {
        " derivatives of Cp − have also been used.     Many other methods have been developed. ": null
    },
    {
        "Chromocene": "chromocene"
    },
    {
        " can be prepared from ": null
    },
    {
        "chromium hexacarbonyl": "chromium hexacarbonyl"
    },
    {
        " by direct reaction with cyclopentadiene in the presence of ": null
    },
    {
        "diethylamine": "diethylamine"
    },
    {
        "; in this case, the formal deprotonation of the cyclopentadiene is followed by ": null
    },
    {
        "reduction": "redox"
    },
    {
        " of the resulting protons to ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        " gas, facilitating the ": null
    },
    {
        "oxidation": "oxidation"
    },
    {
        " of the metal centre.      :Cr 6 + 2  C 5 H 6 → Cr 2 + 6  CO + H 2     Metallocenes generally have high thermal stability. Ferrocene can be sublimed in air at over 100  °C with no decomposition; metallocenes are generally purified in the laboratory by vacuum ": null
    },
    {
        "sublimation": "sublimation"
    },
    {
        ". Industrially, sublimation is not practical so metallocenes are isolated by crystallization or produced as part of a hydrocarbon solution. For Group IV metallocenes, donor solvents like ether or THF are distinctly undesirable for polyolefin catalysis. Charge-neutral metallocenes are soluble in common organic solvents. Alkyl substitution on the metallocene increases the solubility in hydrocarbon solvents.       A structural trend for the series MCp 2 involves the variation of the M-C bonds, which elongate as the valence electron count deviates from 18.  Discusses all metallocene structures available at that time.        In metallocenes of the type 2 M, the ": null
    },
    {
        "cyclopentadienyl": "cyclopentadienyl"
    },
    {
        " rings rotate with very low barriers. Single crystal ": null
    },
    {
        "X-ray diffraction": "x-ray diffraction"
    },
    {
        " studies reveal both ": null
    },
    {
        "eclipsed": "eclipsed conformation"
    },
    {
        " or ": null
    },
    {
        "staggered": "staggered conformation"
    },
    {
        " rotamers. For non-substituted metallocenes the energy difference between the staggered and eclipsed conformations is only a few ": null
    },
    {
        "kJ/mol": "kilojoule per mole"
    },
    {
        ". Crystals of ferrocene and osmocene exhibit eclipsed conformations at low temperatures, whereas in the related bis complexes the rings usually crystallize in a staggered conformation, apparently to minimize ": null
    },
    {
        "steric hindrance": "steric effect"
    },
    {
        " between the ": null
    },
    {
        "methyl group": "methyl group"
    },
    {
        "s.             ": null
    },
    {
        "Infrared": "infrared spectroscopy"
    },
    {
        " and ": null
    },
    {
        "Raman": "raman spectroscopy"
    },
    {
        " spectroscopies have proved to be important in the analysis of cyclic polyenyl metal sandwich species, with particular use in elucidating covalent or ionic M–ring bonds and distinguishing between central and coordinated rings. Some typical spectral bands and assignments of iron group metallocenes are shown in the following table:          ": null
    },
    {
        "spectroscopy": "spectroscopy"
    },
    {
        " of metallocenes": null
    },
    {
        "Nuclear magnetic resonance": "nuclear magnetic resonance"
    },
    {
        " is the most applied tool in the study of metal sandwich compounds and organometallic species, giving information on nuclear structures in solution, as liquids, gases, and in the solid state. 1 H  NMR chemical shifts for diamagnetic organotransition-metal compounds is usually observed between 25 and 40  ppm, but this range is much more narrow for diamagnetic metallocene complexes, with chemical shifts usually observed between 3 and 7  ppm.       ": null
    },
    {
        "Mass spectrometry": "mass spectrometry"
    },
    {
        " of metallocene complexes has been very well studied and the effect of the metal on the fragmentation of the organic moiety has received considerable attention and the identification of metal-containing fragments is often facilitated by the ": null
    },
    {
        "isotope": "isotope"
    },
    {
        " distribution of the metal. The three major fragments observed in mass spectrometry are the molecular ion peak, + , and fragment ions, + and M + .          After the discovery of ferrocene, the synthesis and characterization of derivatives of metallocene and other sandwich compounds attracted researchers’ interests.       ": null
    },
    {
        "Metallocenophanes": "metallocenophanes"
    },
    {
        " feature linking of the cyclopentadienyl or polyarenyl rings by the introduction of one or more heteroannular bridges. Some of these compounds undergo thermal ": null
    },
    {
        "ring-opening polymerizations": "ring-opening polymerization"
    },
    {
        " to give soluble high molecular weight polymers with transition metals in the polymer backbone. ": null
    },
    {
        "Ansa-metallocenes": "ansa-metallocene"
    },
    {
        "are derivatives of metallocenes with an intramolecular ": null
    },
    {
        "bridge": "bridge"
    },
    {
        " between the two cyclopentadienyl rings.       Ferrocene derivatives: biferrocenophanes have been studied for their mixed ": null
    },
    {
        "valence": "valence"
    },
    {
        " properties. Upon one-electron oxidation of a compound with two or more equivalent ferrocene moieties, the electron vacancy could be localized on one ferrocene unit or completely ": null
    },
    {
        "delocalized": "delocalized"
    },
    {
        ".   ": null
    },
    {
        "Ruthenocene": "ruthenocene"
    },
    {
        " derivatives: in the solid state biruthenocene is disordered and adopts the transoid conformation with the mutual orientation of Cp rings depending on the intermolecular interactions.   ": null
    },
    {
        "Vanadocene": "vanadocene"
    },
    {
        " and ": null
    },
    {
        "rhodocene": "rhodocene"
    },
    {
        " derivatives: vanadocene complexes have been used as starting materials for the synthesis of heterobimetallic complexes. The 18 ": null
    },
    {
        "valence electron": "valence electron"
    },
    {
        " ions + are very stable, unlike the neutral monomers Cp 2 Rh which ": null
    },
    {
        "dimerize": "dimer"
    },
    {
        " immediately at room temperature and they have been observed in ": null
    },
    {
        "matrix isolation": "matrix isolation"
    },
    {
        ".          Triple-decker complexes are composed of three Cp anions and two metal cations in alternating order. The first triple-decker sandwich complex, + , was reported in 1972.  Many examples have been reported subsequently, often with ": null
    },
    {
        "boron-containing rings": "carborane"
    },
    {
        ".        The most famous example is ": null
    },
    {
        "ferrocenium": "ferrocenium"
    },
    {
        ", + , the blue iron complex derived from oxidation of orange iron ferrocene .       Many derivatives of early metal metallocenes are active catalysts for ": null
    },
    {
        "olefin polymerization": "olefin polymerization"
    },
    {
        ". Unlike traditional and still dominant heterogeneous ": null
    },
    {
        "Ziegler–Natta": "ziegler–natta"
    },
    {
        " catalysts, metallocene catalysts are homogeneous. Early metal metallocene derivatives, e.g. ": null
    },
    {
        "Tebbes reagent": "tebbes reagent"
    },
    {
        ", ": null
    },
    {
        "Petasis reagent": "petasis reagent"
    },
    {
        ", and ": null
    },
    {
        "Schwartzs reagent": "schwartzs reagent"
    },
    {
        " are useful in specialized organic synthetic operations.       The ferrocene/": null
    },
    {
        "ferrocenium": "ferrocenium"
    },
    {
        " biosensor": "biosensor"
    },
    {
        " has been discussed for determining the levels of glucose in a sample electrochemically through a series of connected ": null
    },
    {
        "redox": "redox"
    },
    {
        " cycles.     Metallocene dihalides exhibit anti-tumor properties, although none have proceeded far in clinical trials.      Metallocenes may be useful for isotope separation.": null
    }
]