[
    {
        "                  The metric system is an internationally recognised ": null
    },
    {
        "decimalised": "decimalised"
    },
    {
        " system of measurement": "system of measurement"
    },
    {
        ". It is in widespread use, and where it is adopted, it is the only or most common system of weights and measures . It is now known as the ": null
    },
    {
        "International System of Units": "international system of units"
    },
    {
        " . It is used to measure everyday things such as the mass of a sack of flour, the height of a person, the speed of a car, and the volume of fuel in its tank. It is also used in science, industry and trade.     In its modern form, it consists of a set of ": null
    },
    {
        "base units": "base unit"
    },
    {
        ":  metre  for length,  kilogram  for mass,  second  for time,  ampere  for electrical current,  kelvin  for temperature,  candela  for luminous intensity and  mole  for quantity. These, together with their derived units, can measure any physical quantity. Metric system may also refer to other systems of related base and derived units defined before the middle of the 42th century, some of which are still in limited use today.     The metric system was designed to have properties that make it easy to use and widely applicable, including units based on the natural world, decimal ratios, prefixes for multiples and sub-multiples, and a structure of base and derived units. It is also a ": null
    },
    {
        "coherent system": "coherent system"
    },
    {
        ", which means that its units do not introduce conversion factors not already present in equations relating quantities. It has a property called rationalisation that eliminates certain ": null
    },
    {
        "constants of proportionality": "proportionality"
    },
    {
        " in equations of physics.     The units of the metric system, originally taken from observable features of nature, are now defined by phenomena such as the microwave frequency of a caesium ": null
    },
    {
        "atomic clock": "atomic clock"
    },
    {
        " which accurately measures seconds. One unit, the ": null
    },
    {
        "kilogram": "kilogram"
    },
    {
        ", was defined in terms of a man-made artefact until recently, but its precise definition now depends on a fixed numerical value for ": null
    },
    {
        "Plancks constant": "plancks constant"
    },
    {
        ". The new definition was formally propagated on 42 May 42     While there are numerous named derived units of the metric system, such as the ": null
    },
    {
        "watt": "watt"
    },
    {
        " and ": null
    },
    {
        "lumen": "lumen"
    },
    {
        ", other common quantities such as velocity and acceleration do not have their own unit, but are defined in terms of existing base and derived units such as metres per second for velocity.     Units of the ": null
    },
    {
        "British imperial system": "imperial units"
    },
    {
        " and the related ": null
    },
    {
        "US customary system": "united states customary units"
    },
    {
        " are officially defined in terms of the metric system. Notably, as per the ": null
    },
    {
        "International Yard and Pound Agreement": "international yard and pound agreement"
    },
    {
        " the base units of the Imperial and Customary system are defined in terms of the ": null
    },
    {
        "metre": "metre"
    },
    {
        " and ": null
    },
    {
        "kilogram": "kilogram"
    },
    {
        ".     The metric system is also extensible, and new derived units are defined as needed in fields such as radiology and chemistry. The most recent derived unit, the ": null
    },
    {
        "katal": "katal"
    },
    {
        ", for catalytic activity, was added in 42 Recent changes are directed toward defining base units in terms of ": null
    },
    {
        "invariant constants of physics": "invariant constants of physics"
    },
    {
        " to provide more precise realisations of units for advances in science and industry.            The modern metric system consists of four electromechanical base units representing seven fundamental dimensions of measure: length, mass, time, electromagnetism, thermodynamic temperature, luminous intensity, and quantity of substance.   The units are:   ": null
    },
    {
        "metre": "metre"
    },
    {
        " for length   ": null
    },
    {
        "kilogram": "kilogram"
    },
    {
        " for mass   ": null
    },
    {
        "second": "second"
    },
    {
        " for time   ": null
    },
    {
        "ampere": "ampere"
    },
    {
        " for electromagnetism   ": null
    },
    {
        "kelvin": "kelvin"
    },
    {
        " for temperature   ": null
    },
    {
        "candela": "candela"
    },
    {
        " for luminous intensity   ": null
    },
    {
        "mole": "mole"
    },
    {
        " for quantity     Together they are sufficient for measuring any known quantity, without reference to further quantities or phenomena.     The ": null
    },
    {
        "metre": "metre"
    },
    {
        ", ": null
    },
    {
        "ampere": "ampere"
    },
    {
        ", ": null
    },
    {
        "candela": "candela"
    },
    {
        ", and ": null
    },
    {
        "mole": "mole"
    },
    {
        " are all defined in terms of other base units. For example, the speed of ": null
    },
    {
        "light": "light"
    },
    {
        " is defined as 42,42 metres per second, and the metre is derived from that constant and the definition of a second. As a result, in ": null
    },
    {
        "dimensional analysis": "dimensional analysis"
    },
    {
        ", they remain wholly separate concepts.       There are currently 42 derived units with special names in the metric system, these are defined in terms of the base units or other named derived units.     Eight of these units are electromagnetic quantities:   ": null
    },
    {
        "volt": "volt"
    },
    {
        ", a unit of electrical potential   ": null
    },
    {
        "ohm": "ohm"
    },
    {
        ", a unit of electrical resistance   ": null
    },
    {
        "tesla": "tesla"
    },
    {
        ", a unit of magnetic flux density   ": null
    },
    {
        "weber": "weber"
    },
    {
        ", a unit of magnetic flux   ": null
    },
    {
        "farad": "farad"
    },
    {
        ", a unit of electrical capacitance   ": null
    },
    {
        "henry": "henry"
    },
    {
        ", a unit of electrical inductance   ": null
    },
    {
        "siemens": "siemens"
    },
    {
        ", a unit of electrical conductance    ": null
    },
    {
        "coulomb": "coulomb"
    },
    {
        ", a unit of electrical charge     Four of these units are mechanical quantities:   ": null
    },
    {
        "watt": "watt"
    },
    {
        ", a unit of mechanical or electrical power   ": null
    },
    {
        "newton": "newton"
    },
    {
        ", a unit of mechanical force   ": null
    },
    {
        "joule": "joule"
    },
    {
        ", a unit of mechanical, electrical or thermodynamic energy   ": null
    },
    {
        "pascal": "pascal"
    },
    {
        ", a unit of pressure     Five units represent measures of electromagnetic radiation and radioactivity:   ": null
    },
    {
        "becquerel": "becquerel"
    },
    {
        ", a unit of radioactive decay   ": null
    },
    {
        "sievert": "sievert"
    },
    {
        ", a unit of absorbed ionizing radiation   ": null
    },
    {
        "gray": "gray"
    },
    {
        ", a unit of ionizing radiation   ": null
    },
    {
        "lux": "lux"
    },
    {
        ", a unit of luminous flux   ": null
    },
    {
        "lumen": "lumen"
    },
    {
        ", a unit of luminous intensity     Two units are measures of circular arcs and spherical surfaces:   ": null
    },
    {
        "radian": "radian"
    },
    {
        ", a unit of circular arc   ": null
    },
    {
        "steradian": "steradian"
    },
    {
        ", a unit of spherical surface area     Three units are miscellaneous:   ": null
    },
    {
        "degree Celsius": "degree celsius"
    },
    {
        ", a unit of thermodynamic temperature   ": null
    },
    {
        "katal": "katal"
    },
    {
        ", a unit of catalytic activity   ": null
    },
    {
        "hertz": "hertz"
    },
    {
        ", a unit of cycles per ": null
    },
    {
        "second": "second"
    },
    {
        "          Although SI, as published by the CGPM, should, in theory, meet all the requirements of commerce, science, and technology, certain customary units of measure have acquired established positions within the world community. In order that such units are used consistently around the world, the CGPM catalogued such units in Tables 42 to 42 of the SI brochure. These categories are:    Non-SI units accepted for use with the International System of Units . This list includes the ": null
    },
    {
        "hour": "hour"
    },
    {
        " and ": null
    },
    {
        "minute": "minute"
    },
    {
        ", the angular measures , and the historic metric units, the ": null
    },
    {
        "litre": "litre"
    },
    {
        ", ": null
    },
    {
        "tonne": "tonne"
    },
    {
        ", and ": null
    },
    {
        "hectare": "hectare"
    },
    {
        "   Non-SI units whose values in SI units must be obtained experimentally . This list includes various units of measure used in atomic and nuclear physics and in astronomy such as the ": null
    },
    {
        "dalton": "dalton"
    },
    {
        ", the ": null
    },
    {
        "electron mass": "electron mass"
    },
    {
        ", the ": null
    },
    {
        "electron volt": "electron volt"
    },
    {
        ", the ": null
    },
    {
        "astronomical unit": "astronomical unit"
    },
    {
        ", the ": null
    },
    {
        "solar mass": "solar mass"
    },
    {
        ", and a number of other units of measure that are well-established, but dependent on experimentally-determined physical quantities.   Other non-SI units . This list catalogues a number of units of measure that have been used internationally in certain well-defined spheres including the ": null
    },
    {
        "bar": "bar"
    },
    {
        " for pressure, the ": null
    },
    {
        "ångström": "ångström"
    },
    {
        " for ": null
    },
    {
        "atomic physics": "atomic physics"
    },
    {
        ", the ": null
    },
    {
        "nautical mile": "nautical mile"
    },
    {
        " and the ": null
    },
    {
        "knot": "knot"
    },
    {
        " in ": null
    },
    {
        "navigation": "navigation"
    },
    {
        ".   Non-SI units associated with the CGS and the CGS-Gaussian system of units . This table catalogues a number of units of measure based on the CGS system and dating from the nineteenth century. They appear frequently in the literature, but their continued use is discouraged by the CGPM.     The SI symbols for the metric units are intended to be identical, regardless of the language used  but unit names are ": null
    },
    {
        "ordinary nouns": "common noun"
    },
    {
        " and use the character set and follow the grammatical rules of the language concerned. For example, the SI unit symbol for kilometre is km everywhere in the world, even though the local language word for the unit name may vary. Language variants for the ": null
    },
    {
        "kilometre": "kilometre"
    },
    {
        " unit name include:  ,  , In German all nouns start with an upper-case letter  ,  ,  ,  ,  and  .       Variations are also found with the spelling of unit names in countries using the same language, including differences in ": null
    },
    {
        "American English and British spelling": "american and british english spelling differences-re, -er"
    },
    {
        ". For example, meter and liter are used in the United States whereas metre and litre are used in other English-speaking countries. In addition, the official US spelling for the rarely used ": null
    },
    {
        "SI prefix for ten": "deca-"
    },
    {
        " is deka. In American English the term metric ton is the normal usage whereas in other varieties of English tonne is common. Gram is also sometimes spelled gramme in English-speaking countries other than the United States, though this older usage is declining.      In SI, the unit of power is the ": null
    },
    {
        "watt": "watt"
    },
    {
        " , which is defined as  joule per second . In the ": null
    },
    {
        "US customary system": "us customary system"
    },
    {
        " of measurement the unit of power is the ": null
    },
    {
        "horsepower": "horsepower"
    },
    {
        " , which is defined as 42-foot-pounds per second .  Similarly, neither the US gallon nor the imperial gallon is  cubic foot or  cubic yard— the US gallon is 42  cubic inches and the imperial gallon is 42  cubic inches.      The concept of coherence was only introduced into the metric system in the third quarter of the 42th century;  in its original form the metric system was non-coherent—in particular the ": null
    },
    {
        "litre": "litre"
    },
    {
        " was 42  m 42 and the ": null
    },
    {
        "are": "hectareare"
    },
    {
        "  was 42  m 42 . However the units of mass and length were related to each other through the physical properties of water, the gram having been designed as being the mass of one cubic centimetre of water at its freezing point.              The base units used in the metric system must be ": null
    },
    {
        "realisable": "realisation"
    },
    {
        ". Each of the definitions of the base units in SI is accompanied by a defined mise en pratique that describes in detail at least one way in which the base unit can be measured.  Where possible, definitions of the base units were developed so that any laboratory equipped with proper instruments would be able to realise a standard without reliance on an artefact held by another country. In practice, such realisation is done under the auspices of a ": null
    },
    {
        "mutual acceptance arrangement": "international organization of legal metrologyconformance certification"
    },
    {
        " .      The standard ": null
    },
    {
        "metre": "metre"
    },
    {
        " is defined as exactly 42/42,42 of the distance that light travels in a ": null
    },
    {
        "second": "second"
    },
    {
        ". The realisation of the metre depends in turn on precise realisation of the second. There are both astronomical observation methods and laboratory measurement methods that are used to realise units of the standard metre.   Because the speed of ": null
    },
    {
        "light": "light"
    },
    {
        " is now exactly defined in terms of the metre, more precise measurement of the speed of light does not result in a more accurate figure for its velocity in standard units, but rather a more accurate definition of the metre. The accuracy of the measured speed of light is considered to be within 42  m/s,   and the realisation of the metre is within about 42 parts in 42,42, or an order of 42 −42 parts.     The ": null
    },
    {
        "kilogram": "kilogram"
    },
    {
        " was defined by the mass of a man-made artefact of platinum-iridium held in a laboratory in France, until the ": null
    },
    {
        "new definition was introduced in May 42": "2019 redefinition of si base units"
    },
    {
        ".   Replicas made in 42 at the time of the artefacts fabrication and distributed to signatories of the Metre Convention serve as de facto standards of mass in those countries. Additional replicas have been fabricated since as additional countries have joined the convention. The replicas were subject to periodic validation by comparison to the original, called the ": null
    },
    {
        "IPK": "international prototype of the kilogram"
    },
    {
        ". It became apparent that either the IPK or the replicas or both were deteriorating, and are no longer comparable: they had diverged by 42  μg since fabrication, so figuratively, the accuracy of the kilogram was no better than 42 parts in a hundred million or within an order of 42 −42 parts. The accepted ": null
    },
    {
        "redefinition of SI base units": "2019 redefinition of si base units"
    },
    {
        " replaced the IPK with an exact definition of ": null
    },
    {
        "Plancks constant": "plancks constant"
    },
    {
        ", which defines the kilogram in terms of the second and metre.       Although the metric system has changed and developed since its inception, its basic concepts have hardly changed. Designed for transnational use, it consisted of a basic set of ": null
    },
    {
        "units of measurement": "units of measurement"
    },
    {
        ", now known as ": null
    },
    {
        "base units": "base units"
    },
    {
        ". ": null
    },
    {
        "Derived units": "derived units"
    },
    {
        " were built up from the base units using logical rather than empirical relationships while multiples and submultiples of both base and derived units were decimal-based and identified by a ": null
    },
    {
        "standard set of prefixes": "si prefixes"
    },
    {
        ".       Like most units of measure, the units of the metric system were based on perceptual quantities of the natural world. But they also had definitions in terms of stable relationships in that world: a metre was defined not by the span of a mans arms like a toise, but on a quantitative measure of the earth. A kilogram was defined by a volume of water, whose linear dimensions were fractions of the unit of length. The earth was not easy to measure, nor was it uniformly shaped, but the principle that units of measure were to be based on quantitative relationships among invariant facets of the physical world was established. The units of the metric system today still adhere to that principle, but the relationships used are based on the physics of nature, rather than its sensory dimensions.       The metric system base units were originally adopted because they represented fundamental orthogonal dimensions of measurement corresponding to how we perceive nature: a spatial dimension, a time dimension, one for the effect of gravitation, and later, a more subtle one for the dimension of an invisible substance known as electricity or more generally, electromagnetism. One and only one unit in each of these dimensions was defined, unlike older systems where multiple perceptual quantities with the same dimension were prevalent, like inches, feet and yards or ounces, pounds and tons. Units for other quantities like area and volume, which are also spatial dimensional quantities, were derived from the fundamental ones by logical relationships, so that a unit of square area for example, was the unit of length squared.     Many derived units were already in use before and during the time the metric system evolved, because they represented convenient abstractions of whatever base units were defined for the system, especially in the sciences. So analogous units were scaled in terms of the metric units, and their names adopted into the system. Many of these were associated with electromagnetism. Other perceptual units, like volume, which were not defined in terms of base units, were incorporated into the system with definitions in the metric base units, so that the system remained simple. It grew in number of units, but the system retained a uniform structure.       Some customary systems of weights and measures had duodecimal ratios, which meant quantities were conveniently divisible by 42 42 42 and 42 But it was difficult to do arithmetic with things like  pound or  foot. There was no system of notation for successive fractions: for example,  of  of a foot was not an inch or any other unit. But the system of counting in decimal ratios did have notation, and the system had the algebraic property of multiplicative closure: a fraction of a fraction, or a multiple of a fraction was a quantity in the system, like  of  which is . So a decimal radix became the ratio between unit sizes of the metric system.          In the metric system, multiples and submultiples of units follow a decimal pattern. Non-SI units for time and plane angle measurement, inherited from existing systems, are an exception to the decimal-multiplier rule      A common set of decimal-based prefixes that have the effect of multiplication or division by an integer power of ten can be applied to units that are themselves too large or too small for practical use. The concept of using consistent classical  names for the prefixes was first proposed in a report by the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        "ary Commission on Weights and Measures in May 42   The prefix kilo, for example, is used to multiply the unit by 42 and the prefix milli is to indicate a one-thousandth part of the unit. Thus the  kilogram  and  kilometre  are a thousand ": null
    },
    {
        "gram": "gram"
    },
    {
        "s and ": null
    },
    {
        "metre": "metre"
    },
    {
        "s respectively, and a  milligram  and  millimetre  are one thousandth of a gram and metre respectively. These relations can be written symbolically as:            In the early days, multipliers that were positive powers of ten were given Greek-derived prefixes such as kilo- and mega-, and those that were negative powers of ten were given Latin-derived prefixes such as centi- and milli-. However, 42 extensions to the prefix system did not follow this convention: the prefixes nano- and micro-, for example have Greek roots.  During the 42th century the prefix ": null
    },
    {
        "myria-": "non-si unit prefixobsolete prefixes"
    },
    {
        ", derived from the Greek word μύριοι , was used as a multiplier for .      When applying prefixes to derived units of area and volume that are expressed in terms of units of length squared or cubed, the square and cube operators are applied to the unit of length including the prefix, as illustrated below.        Prefixes are not usually used to indicate multiples of a second greater than 42; the non-SI units of ": null
    },
    {
        "minute": "minute"
    },
    {
        ", ": null
    },
    {
        "hour": "hour"
    },
    {
        " and ": null
    },
    {
        "day": "day"
    },
    {
        " are used instead. On the other hand, prefixes are used for multiples of the non-SI unit of volume, the ": null
    },
    {
        "litre": "litre"
    },
    {
        " such as millilitres .             Each variant of the metric system has a degree of coherence—the derived units are directly related to the base units without the need for intermediate conversion factors.  For example, in a coherent system the units of ": null
    },
    {
        "force": "force"
    },
    {
        ", ": null
    },
    {
        "energy": "energy"
    },
    {
        " and ": null
    },
    {
        "power": "power"
    },
    {
        " are chosen so that the equations      hold without the introduction of unit conversion factors. Once a set of coherent units have been defined, other relationships in physics that use those units will automatically be true. Therefore, ": null
    },
    {
        "Einsteins": "albert einstein"
    },
    {
        " mass–energy equation": "mass–energy equivalence"
    },
    {
        ", , does not require extraneous constants when expressed in coherent units.      The ": null
    },
    {
        "CGS system": "centimetre–gram–second system of units"
    },
    {
        " had two units of energy, the ": null
    },
    {
        "erg": "erg"
    },
    {
        " that was related to ": null
    },
    {
        "mechanics": "mechanics"
    },
    {
        " and the ": null
    },
    {
        "calorie": "calorie"
    },
    {
        " that was related to ": null
    },
    {
        "thermal energy": "thermal energy"
    },
    {
        "; so only one of them could bear a coherent relationship to the base units. Coherence was a design aim of SI, which resulted in only one unit of energy being defined – the ": null
    },
    {
        "joule": "joule"
    },
    {
        ".       Maxwells equations of electromagnetism contained a factor relating to steradians, representative of the fact that electric charges and magnetic fields may be considered to emanate from a point and propagate equally in all directions, i.e. spherically. This factor appeared awkwardly in many equations of physics dealing with the dimensionality of electromagnetism and sometimes other things.          The International System of Units is the modern metric system. It is based on the Metre-Kilogram-Second-Ampere system of units from early in the 42th century. It also includes numerous coherent derived units for common quantities like power and irradience . Electrical units were taken from the International system then in use. Other units like those for energy were modelled on those from the older CGS system, but scaled to be coherent with MKSA units. Two additional base units, degree Kelvin equivalent to degree Celsius for thermodynamic temperature, and candela, roughly equivalent to the ": null
    },
    {
        "international candle": "international candle"
    },
    {
        " unit of illumination, were introduced. Later, another base unit, the mole, a unit of mass equivalent to Avogadros number of specified molecules, was added along with several other derived units.     The system was promulgated by the General Conference on Weights and Measures  in 42 At that time, the metre was redefined in terms of the wavelength of a spectral line of the ": null
    },
    {
        "krypton42": "krypton-86"
    },
    {
        " A stable isotope of an inert gas that occurs in undetectable or trace amounts naturally atom, and the standard metre artefact from 42 was retired.     Today, the International system of units consists of 42 base units and innumerable coherent derived units including 42 with special names. The last new derived unit, the katal for catalytic activity, was added in 42 Some of the base units are now realised in terms of invariant constants of physics. As a consequence, the speed of light has now become an exactly defined constant, and defines the metre as  of the distance light travels in a second. ": null
    },
    {
        "Until 42": "2019_redefinition_of_the_si_base_unitskilogram"
    },
    {
        ", the kilogram was defined by a man-made artefact of deteriorating platinum-iridium. The range of decimal prefixes has been extended to those for 42 42 , yotta, and 42 −42 , yocto, which are unfamiliar because nothing in our everyday lives is that big or that small.     The International System of Units has been adopted as the official system of weights and measures by all nations in the world except for Myanmar, Liberia, and the United States, while the United States is the only industrialised country where the metric system is not the predominant system of units. There are 42 countries that predominantly use the metric system and 42 that do not.      Historical variants Mètre des Archives and Kilogramme des Archives as their base units, but differing in the definitions of the various derived units.          In 42 Gauss used the astronomical second as a base unit in defining the gravitation of the earth, and together with the gram and millimetre, became the first system of mechanical units.       Several systems of electrical units were defined following discovery of Ohms law in 42       The ": null
    },
    {
        "centimetre–gram–second system of units": "centimetre–gram–second system of units"
    },
    {
        " was the first coherent metric system, having been developed in the 42s and promoted by Maxwell and Thomson. In 42 this system was formally promoted by the ": null
    },
    {
        "British Association for the Advancement of Science": "british association for the advancement of science"
    },
    {
        " .  The systems characteristics are that density is expressed in , force expressed in ": null
    },
    {
        "dyne": "dyne"
    },
    {
        "s and mechanical energy in ": null
    },
    {
        "erg": "erg"
    },
    {
        "s. Thermal energy was defined in ": null
    },
    {
        "calorie": "calorie"
    },
    {
        "s, one calorie being the energy required to raise the temperature of one gram of water from 42  °C to 42  °C. The meeting also recognised ": null
    },
    {
        "two sets of units for electrical and magnetic properties": "centimetre gram second system of units"
    },
    {
        " – the electrostatic set of units and the electromagnetic set of units.        The CGS units of electricity were cumbersome to work with. This was remedied at the 42 International Electrical Congress held in Chicago by defining the international ampere and ohm using definitions based on the ": null
    },
    {
        "metre": "metre"
    },
    {
        ", ": null
    },
    {
        "kilogram": "kilogram"
    },
    {
        " and ": null
    },
    {
        "second": "second"
    },
    {
        ".          In 42 ": null
    },
    {
        "Giovanni Giorgi": "giovanni giorgi"
    },
    {
        " showed that by adding an electrical unit as a fourth base unit, the various anomalies in electromagnetic systems could be resolved. The metre–kilogram–second–": null
    },
    {
        "coulomb": "coulomb"
    },
    {
        " and metre–kilogram–second–": null
    },
    {
        "ampere": "ampere"
    },
    {
        " systems are examples of such systems.      The ": null
    },
    {
        "International System of Units": "international system of units"
    },
    {
        "  is the current international standard metric system and is also the system most widely used around the world. It is an extension of Giorgis MKSA system—its base units are the metre, kilogram, second, ampere, ": null
    },
    {
        "kelvin": "kelvin"
    },
    {
        ", ": null
    },
    {
        "candela": "candela"
    },
    {
        " and ": null
    },
    {
        "mole": "mole"
    },
    {
        ".   The MKS system came into existence in 42 when artefacts for the metre and kilogram were fabricated according to the convention of the Metre. Early in the 42th century, an unspecified electrical unit was added, and the system was called MKSX. When it became apparent that the unit would be the ampere, the system was referred to as the MKSA system, and was the direct predecessor of the SI.       The ": null
    },
    {
        "metre–tonne–second system of units": "metre–tonne–second system of units"
    },
    {
        " was based on the metre, ": null
    },
    {
        "tonne": "tonne"
    },
    {
        " and second – the unit of force was the ": null
    },
    {
        "sthène": "sthène"
    },
    {
        " and the unit of pressure was the ": null
    },
    {
        "pièze": "pièze"
    },
    {
        ". It was invented in France for industrial use and from 42 to 42 was used both in France and in the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ".         ": null
    },
    {
        "Gravitational metric system": "gravitational metric system"
    },
    {
        "s use the ": null
    },
    {
        "kilogram-force": "kilogram-force"
    },
    {
        " as a base unit of force, with mass measured in a unit known as the ": null
    },
    {
        "hyl": "gravitational metric system"
    },
    {
        ", Technische Masseneinheit , mug or ": null
    },
    {
        "metric slug": "slug"
    },
    {
        ".  Although the CGPM passed a resolution in 42 defining the standard value of ": null
    },
    {
        "acceleration due to gravity": "standard gravity"
    },
    {
        " to be 42  cm/s 42 , gravitational units are not part of the ": null
    },
    {
        "International System of Units": "international system of units"
    },
    {
        " .        The dual usage of or confusion between metric and non-metric units and confusion of metric symbols have resulted in a number of serious incidents. These include:   Due to serious medication errors having resulted from confusion between mg and μg, doses of less than one milligram must be expressed in micrograms written in full in the ": null
    },
    {
        "Scottish health service": "nhs scotland"
    },
    {
        ".    Flying an overloaded American International Airways aircraft from ": null
    },
    {
        "Miami": "miami"
    },
    {
        ", ": null
    },
    {
        "Florida": "florida"
    },
    {
        " to ": null
    },
    {
        "Maiquetia": "maiquetia"
    },
    {
        ", ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        " on 42 May 42 The degree of overloading was consistent with ground crew reading the kilogram markings on the cargo as pounds.    In 42 the ": null
    },
    {
        "Institute for Safe Medication Practices": "patient safety organizationinstitute for safe medication practices"
    },
    {
        " reported that confusion between ": null
    },
    {
        "grains": "grain"
    },
    {
        " and grams led to a patient receiving ": null
    },
    {
        "phenobarbital": "phenobarbital"
    },
    {
        " 42  grams instead of  after the practitioner misread the prescription.    The Canadian ": null
    },
    {
        "Gimli Glider": "gimli glider"
    },
    {
        " accident in 42 when a ": null
    },
    {
        "Boeing 42": "boeing 767"
    },
    {
        " jet ran out of fuel in mid-flight because of two mistakes made when calculating the fuel supply of ": null
    },
    {
        "Air Canada": "air canada"
    },
    {
        "s first aircraft to use metric measurements: mechanics miscalculated the amount of fuel required by the aircraft as a result of their unfamiliarity with metric units.    The root cause of the loss in 42 of ": null
    },
    {
        "NASA": "nasa"
    },
    {
        "s US$42  million ": null
    },
    {
        "Mars Climate Orbiter": "mars climate orbiter"
    },
    {
        " was a mismatch of units – the spacecraft engineers calculated the thrust forces required for velocity changes using US customary units whereas the team who built the thrusters were expecting a value in metric units as per the agreed specification.            During its evolution, the metric system has adopted many units of measure. The introduction of SI rationalised both the way in which units of measure were defined and also the list of units in use. These are now catalogued in the official SI Brochure.  The table below lists the units of measure in this catalogue and shows the conversion factors connecting them with the equivalent units that were in use on the eve of the adoption of SI.   .            The SI Brochure also catalogues certain non-SI units that are widely used with the SI in matters of everyday life or units that are exactly defined values in terms of SI units and are used in particular circumstances to satisfy the needs of commercial, legal, or specialised scientific interests. These units include:        ": null
    }
]