[
    {
        "   In ": null
    },
    {
        "poetry": "poetry"
    },
    {
        ", metre  or meter  is the basic ": null
    },
    {
        "rhythmic structure": "rhythm"
    },
    {
        " of a ": null
    },
    {
        "verse": "verse"
    },
    {
        " or ": null
    },
    {
        "lines in verse": "line"
    },
    {
        ". Many traditional ": null
    },
    {
        "verse forms": "verse form"
    },
    {
        "prescribe a specific verse metre, or a certain set of metres alternating in a particular order. The study and the actual use of metres and forms of versification are both known as prosody.        An assortment of features can be identified when classifying poetry and its metre.     Qualitative versus quantitative metrequalitative metre, with stressed syllables coming at regular intervals . Many ": null
    },
    {
        "Romance languages": "romance languages"
    },
    {
        " use a scheme that is somewhat similar but where the position of only one particular stressed syllable needs to be fixed. The metre of the old ": null
    },
    {
        "Germanic poetry": "germanic poetry"
    },
    {
        " of languages such as ": null
    },
    {
        "Old Norse": "old norse"
    },
    {
        " and ": null
    },
    {
        "Old English": "old english"
    },
    {
        " was radically different, but was still based on stress patterns.     Some classical languages, in contrast, used a different scheme known as quantitative metre, where patterns were based on ": null
    },
    {
        "syllable weight": "syllable weight"
    },
    {
        " rather than stress. In the ": null
    },
    {
        "dactylic hexameters": "dactylic hexameter"
    },
    {
        "of ": null
    },
    {
        "Classical Latin": "classical latin"
    },
    {
        " and ": null
    },
    {
        "Classical Greek": "classical greek"
    },
    {
        ", for example, each of the six feet making up the line was either a ": null
    },
    {
        "dactyl": "dactyl"
    },
    {
        " or a ": null
    },
    {
        "spondee": "spondee"
    },
    {
        " : a long syllable was literally one that took longer to pronounce than a short syllable: specifically, a syllable consisting of a long vowel or diphthong or followed by two consonants. The stress pattern of the words made no difference to the metre. A number of other ancient languages also used quantitative metre, such as ": null
    },
    {
        "Sanskrit": "sanskrit language"
    },
    {
        " and ": null
    },
    {
        "Classical Arabic": "classical arabic"
    },
    {
        " .     Finally, non-stressed languages that have little or no differentiation of syllable length, such as French or Chinese, base their verses on the number of syllables only. The most common form in French is the , with twelve syllables a verse, and in classical Chinese five characters, and thus five syllables. But since each Chinese character is pronounced using one syllable in a certain ": null
    },
    {
        "tone": "tone"
    },
    {
        ", ": null
    },
    {
        "classical Chinese poetry": "classical chinese poetry"
    },
    {
        " also had more strictly defined rules, such as parallelism or antithesis between lines.       In many ": null
    },
    {
        "Western": "western world"
    },
    {
        " classical poetic traditions, the metre of a verse can be described as a sequence of  feet ,  each foot being a specific sequence of syllable types — such as relatively unstressed/stressed  or long/short .     ": null
    },
    {
        "Iambic pentameter": "iambic pentameter"
    },
    {
        ", a common metre in English poetry, is based on a sequence of five  iambic feet  or iambs, each consisting of a relatively unstressed syllable followed by a relatively stressed one — da-DUM × / :       × / × / × / × / × /   So long as men can breathe, or eyes can see,   × / × / × / × / × /   So long lives this, and this gives life to thee.       This approach to analyzing and classifying metres originates from ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        " tragedians and poets such as ": null
    },
    {
        "Homer": "homer"
    },
    {
        ", ": null
    },
    {
        "Pindar": "pindar"
    },
    {
        ", ": null
    },
    {
        "Hesiod": "hesiod"
    },
    {
        ", and ": null
    },
    {
        "Sappho": "sappho"
    },
    {
        ".     However some metres have an overall rhythmic pattern to the line that cannot easily be described using feet. This occurs in Sanskrit poetry; see ": null
    },
    {
        "Vedic metre": "vedic metre"
    },
    {
        " and ": null
    },
    {
        "Sanskrit metre": "sanskrit metre"
    },
    {
        ". It also occurs in some Western metres, such as the ": null
    },
    {
        "hendecasyllable": "hendecasyllable"
    },
    {
        " favoured by ": null
    },
    {
        "Catullus": "catullus"
    },
    {
        " and Martial, which can be described as:     x x — ∪ ∪ — ∪ — ∪ — —                  If the line has only one foot, it is called a  monometer ; two feet,  dimeter ; three is  trimeter ; four is  tetrameter ; five is  pentameter ; six is  hexameter , seven is  heptameter  and eight is  octameter . For example, if the feet are iambs, and if there are five feet to a line, then it is called an ": null
    },
    {
        "iambic pentameter": "iambic pentameter"
    },
    {
        ". If the feet are primarily dactyls and there are six to a line, then it is a ": null
    },
    {
        "dactylic hexameter": "dactylic hexameter"
    },
    {
        ".       Sometimes a natural pause occurs in the middle of a line rather than at a line-break. This is a ": null
    },
    {
        "caesura": "caesura"
    },
    {
        " . A good example is from  The Winters Tale  by ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        "; the caesurae are indicated by /:       :It is for you we speak, / not for ourselves:   :You are abused / and by some putter-on   :That will be damnd fort; / would I knew the villain,   :I would land-damn him. / Be she honour-flawd,   :I have three daughters; / the eldest is eleven       In Latin and Greek poetry, a caesura is a break within a foot caused by the end of a word.     Each line of traditional Germanic ": null
    },
    {
        "alliterative verse": "alliterative verse"
    },
    {
        " is divided into two half-lines by a caesura. This can be seen in ": null
    },
    {
        "Piers Plowman": "piers plowman"
    },
    {
        ":       :A fair feeld ful of folk / fond I ther bitwene—   :Of alle manere of men / the meene and the riche,   :Werchynge and wandrynge / as the world asketh.   :Somme putten hem to the plough / pleiden ful selde,   :In settynge and sowynge / swonken ful harde,   :And wonnen that thise wastours / with glotonye destruyeth.            By contrast with caesura, enjambment is incomplete syntax at the end of a line; the meaning runs over from one poetic line to the next, without terminal punctuation. Also from Shakespeares The Winters Tale:       :I am not prone to weeping, as our sex   :Commonly are; the want of which vain dew   :Perchance shall dry your pities; but I have   :That honourable grief lodged here which burns   :Worse than tears drown.         Poems with a well-defined overall metric pattern often have a few lines that violate that pattern. A common variation is the inversion of a foot, which turns an ": null
    },
    {
        "iamb": "iamb"
    },
    {
        " into a ": null
    },
    {
        "trochee": "trochee"
    },
    {
        " . A second variation is a headless verse, which lacks the first syllable of the first foot. A third variation is ": null
    },
    {
        "catalexis": "catalectic"
    },
    {
        ", where the end of a line is shortened by a foot, or two or part thereof - an example of this is at the end of each verse in Keats La Belle Dame sans Merci:     :And on thy cheeks a fading rose   :Fast withereth too         Most English metre is classified according to the same system as Classical metre with an important difference. English is an accentual language, and therefore beats and offbeats take the place of the long and short syllables of classical systems. In most English verse, the metre can be considered as a sort of back beat, against which natural speech rhythms vary expressively. The most common characteristic feet of English verse are the ": null
    },
    {
        "iamb": "iamb"
    },
    {
        " in two syllables and the ": null
    },
    {
        "anapest": "anapest"
    },
    {
        " in three.        The number of metrical systems in English is not agreed upon.  asserts that there is only one metre in English: Accentual-Syllabic. The essay is reprinted in . The four major types . are: ": null
    },
    {
        "accentual verse": "accentual verse"
    },
    {
        ", ": null
    },
    {
        "accentual-syllabic verse": "accentual-syllabic verse"
    },
    {
        ", ": null
    },
    {
        "syllabic verse": "syllabic verse"
    },
    {
        " and ": null
    },
    {
        "quantitative verse": "quantitative verse"
    },
    {
        ". The ": null
    },
    {
        "alliterative verse": "alliterative verse"
    },
    {
        " of Old English could also be added to this list, or included as a special type of accentual verse. Accentual verse focuses on the number of stresses in a line, while ignoring the number of offbeats and syllables; accentual-syllabic verse focuses on regulating both the number of stresses and the total number of syllables in a line; syllabic verse only counts the number of syllables in a line; quantitative verse regulates the patterns of long and short syllables . . It is to be noted, however, that the use of foreign metres in English is all but exceptional. .       The most frequently encountered metre of English verse is the ": null
    },
    {
        "iambic pentameter": "iambic pentameter"
    },
    {
        ", in which the metrical norm is five iambic feet per line, though metrical substitution is common and rhythmic variations practically inexhaustible. ": null
    },
    {
        "John Miltons": "john milton"
    },
    {
        "  Paradise Lost , most ": null
    },
    {
        "sonnet": "sonnet"
    },
    {
        "s, and much else besides in English are written in iambic pentameter. Lines of unrhymed iambic pentameter are commonly known as ": null
    },
    {
        "blank verse": "blank verse"
    },
    {
        ". Blank verse in the English language is most famously represented in the plays of ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        " and the great works of Milton, though ": null
    },
    {
        "Tennyson": "alfred tennyson, 1st baron tennyson"
    },
    {
        "  and ": null
    },
    {
        "Wordsworth": "william wordsworth"
    },
    {
        "  also make notable use of it.     A rhymed pair of lines of iambic pentameter make a ": null
    },
    {
        "heroic couplet": "heroic couplet"
    },
    {
        ", a ": null
    },
    {
        "verse form": "list of verse forms"
    },
    {
        " which was used so often in the 18th century that it is now used mostly for humorous effect . The most famous writers of heroic couplets are ": null
    },
    {
        "Dryden": "john dryden"
    },
    {
        " and ": null
    },
    {
        "Pope": "alexander pope"
    },
    {
        ".     Another important metre in English is the ": null
    },
    {
        "ballad metre": "ballad metre"
    },
    {
        ", also called the common metre , which is a four-line stanza, with two pairs of a line of ": null
    },
    {
        "iambic tetrameter": "iambic tetrameter"
    },
    {
        " followed by a line of ": null
    },
    {
        "iambic trimeter": "iambic trimeter"
    },
    {
        "; the ": null
    },
    {
        "rhymes": "rhyme"
    },
    {
        "usually fall on the lines of trimeter, although in many instances the tetrameter also rhymes. This is the metre of most of the Border and Scots or English ballads. In ": null
    },
    {
        "hymn": "hymn"
    },
    {
        "ody it is called the common metre , as it is the most common of the named ": null
    },
    {
        "hymn metres": "meter"
    },
    {
        " used to pair many hymn lyrics with melodies, such as  Amazing Grace : The ": null
    },
    {
        "ballad metre": "ballad metre"
    },
    {
        " commonality among a wide range of song lyrics allow words and music to be interchanged seamlessly between various songs, such as ": null
    },
    {
        "Amazing Grace": "amazing grace"
    },
    {
        " , the Ballad of ": null
    },
    {
        "Gilligans Isle": "gilligans island"
    },
    {
        " , ": null
    },
    {
        "House of the Rising Sun": "house of the rising sun"
    },
    {
        " , theme from the  Mickey Mouse Club , and others.     :Amazing Grace! how sweet the sound   ::That saved a wretch like me;   :I once was lost, but now am found;   ::Was blind, but now I see.     ": null
    },
    {
        "Emily Dickinson": "emily dickinson"
    },
    {
        " is famous for her frequent use of ballad metre:     :Great streets of silence led away   :To neighborhoods of pause —   :Here was no notice — no dissent —   :No universe — no laws.              Versification in Classical Sanskrit poetry is of three kinds.     Syllabic verse : metres depend on the number of syllables in a verse, with relative freedom in the distribution of light and heavy syllables. This style is derived from older Vedic forms, and found in the great epics, the Mahabharata and the Ramayana.   Syllabo-quantitative verse : metres depend on syllable count, but the light-heavy patterns are fixed.   Quantitative verse : metres depend on duration, where each verse-line has a fixed number of morae, usually grouped in sets of four.     Standard traditional works on metre are Pingalas Chandaḥśāstra and Kedāras Vṛttaratnākara. The most exhaustive compilations, such as the modern ones by Patwardhan and Velankar contain over 600 metres. This is a substantially larger repertoire than in any other metrical tradition.             The metrical feet  in the classical languages were based on the length of time taken to pronounce each syllable, which were categorized according to their ": null
    },
    {
        "weight": "syllable weight"
    },
    {
        " as either long syllables or short syllables . These are also called heavy and light syllables, respectively, to distinguish from long and short vowels. The foot is often compared to a musical measure and the long and short syllables to whole notes and half notes. In English poetry, feet are determined by emphasis rather than length, with stressed and unstressed syllables serving the same function as long and short syllables in classical metre.     The basic unit in Greek and Latin prosody is a ": null
    },
    {
        "mora": "mora"
    },
    {
        ", which is defined as a single short syllable. A long syllable is equivalent to two morae. A long syllable contains either a long vowel, a ": null
    },
    {
        "diphthong": "diphthong"
    },
    {
        ", or a short vowel followed by two or more consonants. Various rules of ": null
    },
    {
        "elision": "elision"
    },
    {
        " sometimes prevent a grammatical syllable from making a full syllable, and certain other lengthening and shortening rules  can create long or short syllables in contexts where one would expect the opposite.     The most important Classical metre is the ": null
    },
    {
        "dactylic hexameter": "dactylic hexameter"
    },
    {
        ", the metre of Homer and Virgil. This form uses verses of six feet. The word dactyl comes from the Greek word daktylos meaning finger, since there is one long part followed by two short stretches.  The first four feet are ": null
    },
    {
        "dactyls": "dactyl"
    },
    {
        " , but can be ": null
    },
    {
        "spondees": "spondee"
    },
    {
        " . The fifth foot is almost always a dactyl. The sixth foot is either a spondee or a ": null
    },
    {
        "trochee": "trochee"
    },
    {
        " . The initial syllable of either foot is called the ictus, the basic beat of the verse. There is usually a ": null
    },
    {
        "caesura": "caesura"
    },
    {
        " after the ictus of the third foot. The opening line of the  Æneid  is a typical line of dactylic hexameter:     :Armă vĭ | rumquĕ că | nō, Troi | ae quī | prīmŭs ăb | ōrīs   :     In this example, the first and second feet are dactyls; their first syllables, Ar and rum respectively, contain short vowels, but count as long because the vowels are both followed by two consonants. The third and fourth feet are spondees, the first of which is divided by the main ": null
    },
    {
        "caesura": "caesura"
    },
    {
        " of the verse. The fifth foot is a dactyl, as is nearly always the case. The final foot is a spondee.     The dactylic hexameter was imitated in English by ": null
    },
    {
        "Henry Wadsworth Longfellow": "henry wadsworth longfellow"
    },
    {
        " in his poem  Evangeline :       :This is the forest primeval. The murmuring pines and the hemlocks,   :Bearded with moss, and in garments green, indistinct in the twilight,   :Stand like Druids of old, with voices sad and prophetic,   :Stand like harpers hoar, with beards that rest on their bosoms.       Notice how the first line:   :This is the | for-est pri | me-val. The | mur-muring | pines and the | hem-locks     Follows this pattern:   :dum diddy | dum diddy | dum diddy | dum diddy | dum diddy | dum dum     Also important in Greek and Latin poetry is the ": null
    },
    {
        "dactylic pentameter": "dactylic pentameter"
    },
    {
        ". This was a line of verse, made up of two equal parts, each of which contains two dactyls followed by a long syllable, which counts as a half foot. In this way, the number of feet amounts to five in total. Spondees can take the place of the dactyls in the first half, but never in the second. The long syllable at the close of the first half of the verse always ends a word, giving rise to a ": null
    },
    {
        "caesura": "caesura"
    },
    {
        ".     Dactylic pentameter is never used in isolation. Rather, a line of dactylic pentameter follows a line of dactylic hexameter in the ": null
    },
    {
        "elegiac": "elegy"
    },
    {
        " distich": "distich"
    },
    {
        " or ": null
    },
    {
        "elegiac couplet": "elegiac couplet"
    },
    {
        ", a form of verse that was used for the composition of elegies and other ": null
    },
    {
        "tragic": "tragedy"
    },
    {
        " and solemn verse in the Greek and Latin world, as well as love poetry that was sometimes light and cheerful. An example from ": null
    },
    {
        "Ovids": "ovid"
    },
    {
        "  Tristia :     :Vergĭlĭ | um vī | dī tan | tum, nĕc ă | māră Tĭ | bullō   ::Tempŭs ă | mīcĭtĭ | ae || fātă dĕ | dērĕ mĕ | ae.     :     The Greeks and Romans also used a number of ": null
    },
    {
        "lyric": "lyric poetry"
    },
    {
        " metres, which were typically used for shorter poems than elegiacs or hexameter. In ": null
    },
    {
        "Aeolic verse": "aeolic verse"
    },
    {
        ", one important line was called the ": null
    },
    {
        "hendecasyllabic": "hendecasyllabic verse"
    },
    {
        ", a line of eleven syllables. This metre was used most often in the ": null
    },
    {
        "Sapphic stanza": "sapphic stanza"
    },
    {
        ", named after the Greek poet ": null
    },
    {
        "Sappho": "sappho"
    },
    {
        ", who wrote many of her poems in the form. A hendecasyllabic is a line with a never-varying structure: two trochees, followed by a dactyl, then two more trochees. In the Sapphic ": null
    },
    {
        "stanza": "stanza"
    },
    {
        ", three hendecasyllabics are followed by an Adonic line, made up of a dactyl and a trochee. This is the form of ": null
    },
    {
        "Catullus": "catullus"
    },
    {
        " 51 :     :Illĕ mī pār essĕ dĕō vĭdētur;   :illĕ, sī fās est, sŭpĕrārĕ dīvōs,   :quī sĕdēns adversŭs ĭdentĭdem tē   ::spectăt ĕt audit     :     The Sapphic stanza was imitated in ": null
    },
    {
        "English": "english language"
    },
    {
        " by ": null
    },
    {
        "Algernon Charles Swinburne": "algernon charles swinburne"
    },
    {
        " in a poem he simply called Sapphics:     :Saw the white implacable Aphrodite,   :Saw the hair unbound and the feet unsandalled   :Shine as fire of sunset on western waters;   ::Saw the reluctant...                   The metrical system of Classical Arabic poetry, like those of classical Greek and Latin, is based on the weight of syllables classified as either long or short . The basic principles of Arabic poetic metre Arūḍ or Arud  Science of Poetry , were put forward by ": null
    },
    {
        "Al-Farahidi": "al-farahidi"
    },
    {
        " who did so after noticing that poems consisted of repeated syllables in each verse. In his first book, Al-Ard , he described 15 types of verse. Al-Akhfash described one extra, the 16th.     A short syllable contains a short vowel with no following consonants. For example, the word kataba, which syllabifies as ka-ta-ba, contains three short vowels and is made up of three short syllables. A long syllable contains either a long vowel or a short vowel followed by a consonant as is the case in the word maktūbun which syllabifies as mak-tū-bun. These are the only syllable types possible in Classical Arabic phonology which, by and large, does not allow a syllable to end in more than one consonant or a consonant to occur in the same syllable after a long vowel. In other words, syllables of the type -āk- or -akr- are not found in classical Arabic.     Each verse consists of a certain number of metrical feet  and a certain combination of possible feet constitutes a metre .     The traditional Arabic practice for writing out a poems metre is to use a concatenation of various derivations of the verbal root F-ʿ-L . Thus, the following hemistich     قفا نبك من ذكرى حبيبٍ ومنزلِ     Would be traditionally scanned as:     فعولن مفاعيلن فعولن مفاعلن     That is, Romanized and with traditional Western scansion:     Western: u – – u – – – u – – u – u –   Verse: Qifā nabki min ḏikrā ḥabībin wa-manzili   Mnemonic: faūlun mafāīlun faūlun mafāilun     Al-Kʰalīl b. ˀAḫmad al-Farāhīdīs contribution to the study of Arabic prosody is undeniably significant: he was the first scholar to subject Arabic poetry to a meticulous, painstaking metrical analysis. Unfortunately, he fell short of producing a coherent theory; instead, he was content to merely gather, classify, and categorize the primary data—a first step which, though insufficient, represents no mean accomplishment. Therefore al-Kʰalīl has left a formulation of utmost complexity and difficulty which requires immense effort to master; even the accomplished scholar cannot utilize and apply it with ease and total confidence. Dr. ˀIbrāhīm ˀAnīs, one of the most distinguished and celebrated pillars of Arabic literature and the Arabic language in the 20th century, states the issue clearly in his book Mūsīqā al-Sʰiˁr:     “I am aware of no branch of Arabic studies which embodies as many terms as does prosody, few and distinct as the meters are: al-Kʰalīl’s disciples employed a large number of infrequent items, assigning to those items certain technical denotations which—invariably—require definition and explanation. …. As to the rules of metric variation, they are numerous to the extent that they defy memory and impose a taxing course of study. …. In learning them, a student faces severe hardship which obscures all connection with an artistic genre—indeed, the most artistic of all—namely, poetry. ………. It is in this fashion that authors dealt with the subject under discussion over a period of eleven centuries: none of them attempted to introduce a new approach or to simplify the rules. ………. Is it not time for a new, simple presentation which avoids contrivance, displays close affinity to poetry, and perhaps renders the science of prosody palatable as well as manageable?”     In the 20th and the 21st centuries, numerous scholars have endeavored to supplement al-Kʰalīls contribution.          Classical Arabic has sixteen established metres. Though each of them allows for a certain amount of variation, their basic patterns are as follows, using:   – for 1 long syllable   u for 1 short syllable   x for a position that can contain 1 long or 1 short   o for a position that can contain 1 long or 2 shorts   S for a position that can contain 1 long, 2 shorts, or 1 long + 1 short               The terminology for metrical system used in classical and classical-style ": null
    },
    {
        "Persian poetry": "persian poetry"
    },
    {
        " is the same as that of Classical Arabic, even though these are quite different in both origin and structure. This has led to serious confusion among prosodists, both ancient and modern, as to the true source and nature of the Persian metres, the most obvious error being the assumption that they were copied from Arabic.      Persian poetry is quantitative, and the metrical patterns are made of long and short syllables, much as in Classical Greek, Latin and Arabic. Anceps positions in the line, however, that is places where either a long or short syllable can be used , are not found in Persian verse except in some metres at the beginning of a line.     Persian poetry is written in couplets, with each half-line being 10-14 syllables long. Except in the ": null
    },
    {
        "rubai": "rubai"
    },
    {
        " , where either of two very similar metres may be used, the same metre is used for every line in the poem. Rhyme is always used, sometimes with double rhyme or internal rhymes in addition. In some poems, known as ": null
    },
    {
        "masnavi": "masnavi"
    },
    {
        ", the two halves of each couplet rhyme, with a scheme aa, bb, cc and so on. In lyric poetry, the same rhyme is used throughout the poem at the end of each couplet, but except in the opening couplet, the two halves of each couplet do not rhyme; hence the scheme is aa, ba, ca, da. A rubai also usually has the rhyme aa, ba.     A particular feature of classical Persian prosody, not found in Latin, Greek or Arabic, is that instead of two lengths of syllables , there are three lengths . Overlong syllables can be used anywhere in the line in place of a long + a short, or in the final position in a line or half line. Elwell-Sutton, L.P. The Persian Metres . Hayes, Bruce  Edebiyat 4:193-242, p. When a metre has a pair of short syllables , it is common for a long syllable to be substituted, especially at the end of a line or half-line.     About 30 different metres are commonly used in Persian. 70% of lyric poems are written in one of the following seven metres: Elwell-Sutton The Persian Metres, p. 162.   u – u – u u – – u – u – u u –   – – u – u – u u – – u – u –   – u – – – u – – – u – – – u –   x u – – u u – – u u – – u u –   x u – – u – u – u u –   u – – – u – – – u – – – u – – –   – – u u – – u u – – u u – –     ": null
    },
    {
        "Masnavi": "mathnawi"
    },
    {
        " poems are always written in one of the shorter 11 or 10-syllable metres such as the following:   u – – u – – u – – u –    u – – – u – – – u – –    – u – – – u – – – u –    – – u u – u – u – –      The two metres used for ": null
    },
    {
        "rubaiyat": "rubai"
    },
    {
        " , which are only used for this, are the following, of which the second is a variant of the first:   – – u u – – u u – – u u –   – – u u – u – u – – u u –          ": null
    },
    {
        "Classical Chinese": "classical chinese"
    },
    {
        " poetic metric may be divided into fixed and variable length line types, although the actual scansion of the metre is complicated by various factors, including linguistic changes and variations encountered in dealing with a tradition extending over a geographically extensive regional area for a continuous time period of over some two-and-a-half millennia. Beginning with the earlier recorded forms: the ": null
    },
    {
        "Classic of Poetry": "classic of poetry"
    },
    {
        " tends toward ": null
    },
    {
        "couplets": "couplets"
    },
    {
        " of four-character lines, grouped in rhymed quatrains; and, the ": null
    },
    {
        "Chuci": "chuci"
    },
    {
        " follows this to some extent, but moves toward variations in line length. ": null
    },
    {
        "Han Dynasty poetry": "han poetry"
    },
    {
        " tended towards the variable line-length forms of the folk ballads and the ": null
    },
    {
        "Music Bureau": "music bureau"
    },
    {
        " yuefu": "yuefu"
    },
    {
        ". ": null
    },
    {
        "Jianan poetry": "jianan poetry"
    },
    {
        ", ": null
    },
    {
        "Six Dynasties poetry": "six dynasties poetry"
    },
    {
        ", and ": null
    },
    {
        "Tang Dynasty poetry": "tang poetry"
    },
    {
        " tend towards a poetic metre based on fixed-length lines of five, seven, characters/verbal units tended to predominate, generally in couplet/": null
    },
    {
        "quatrain": "quatrain"
    },
    {
        "-based forms, of various total verse lengths. The ": null
    },
    {
        "Song poetry": "song poetry"
    },
    {
        " is specially known for its use of the  ci , using variable line lengths which follow the specific pattern of a certain musical songs lyrics, thus ci are sometimes referred to as fixed-rhythm forms. ": null
    },
    {
        "Yuan poetry": "yuan poetry"
    },
    {
        " metres continued this practice with their  qu  forms, similarly fixed-rhythm forms based on now obscure or perhaps completely lost original examples . Not that ": null
    },
    {
        "Classical Chinese poetry": "classical chinese poetry"
    },
    {
        " ever lost the use of the  shi  forms, with their metrical patterns found in the old style poetry  and the ": null
    },
    {
        "regulated verse": "regulated verse"
    },
    {
        " forms of . The regulated verse forms also prescribed patterns based upon ": null
    },
    {
        "linguistic tonality": "tone"
    },
    {
        ". The use of caesura is important in regard to the metrical analysis of Classical Chinese poetry forms.       The metric system of ": null
    },
    {
        "Old English poetry": "old english poetry"
    },
    {
        " was different from that of modern English, and related more to the verse forms of most of the older ": null
    },
    {
        "Germanic languages": "germanic language"
    },
    {
        "such as ": null
    },
    {
        "Old Norse": "old norse"
    },
    {
        ". It used ": null
    },
    {
        "alliterative verse": "alliterative verse"
    },
    {
        ", a metrical pattern involving varied numbers of syllables but a fixed number of strong stresses in each line. The unstressed syllables were relatively unimportant, but the ": null
    },
    {
        "caesura": "caesura"
    },
    {
        "e played a major role in ": null
    },
    {
        "Old English poetry": "old english poetry"
    },
    {
        ".     In place of using feet, ": null
    },
    {
        "alliterative verse": "alliterative verse"
    },
    {
        " divided each line into two half-lines. Each half-line had to follow one of five or so patterns, each of which defined a sequence of stressed and unstressed syllables, typically with two stressed syllables per half line. Unlike typical Western poetry, however, the number of unstressed syllables could vary somewhat. For example, the common pattern DUM-da-DUM-da could allow between one and five unstressed syllables between the two stresses.     The following is a famous example, taken from ": null
    },
    {
        "The Battle of Maldon": "the battle of maldon"
    },
    {
        ", a poem written shortly after the date of that battle :        Hige sceal þe heard ra,  heor te þe cēn re,    mōd sceal þe mā re, swā ūre mægen lȳt lað           In the quoted section, the stressed syllables have been underlined.  The German philologist ": null
    },
    {
        "Eduard Sievers": "eduard sievers"
    },
    {
        " identified five different patterns of half-line in Anglo-Saxon alliterative poetry. The first three half-lines have the ": null
    },
    {
        "type A": "sievers theory of anglo-saxon meter"
    },
    {
        " pattern DUM-da-DUM-da , while the last one has the type C pattern da-DUM-DUM-da , with parentheses indicating optional unstressed syllables that have been inserted. Note also the pervasive pattern of alliteration, where the first and/or second stressed syllables alliterate with the third, but not with the fourth.       In ": null
    },
    {
        "French poetry": "french poetry"
    },
    {
        ", metre is determined solely by the number of syllables in a line. A silent e counts as a syllable before a consonant, but is elided before a vowel . At the end of a line, the e remains unelided but is hypermetrical , in that case, the rhyme is also called feminine , whereas it is called masculine in the other cases.     The most frequently encountered metre in Classical French poetry is the ": null
    },
    {
        "alexandrine": "alexandrine"
    },
    {
        ", composed of two ": null
    },
    {
        "hemistich": "hemistich"
    },
    {
        "es of six syllables each. Two famous alexandrines are     :La fille de Minos et de Pasiphaë   ::     , and   :Waterloo ! Waterloo ! Waterloo ! Morne plaine!   ::         Classical French poetry also had a complex set of ": null
    },
    {
        "rules for rhymes": "rhymefrench"
    },
    {
        " that goes beyond how words merely sound. These are usually taken into account when describing the metre of a poem.       In ": null
    },
    {
        "Spanish poetry": "spanish poetry"
    },
    {
        " the metre is determined by the number of syllables the verse has. Still it is the phonetic accent in the last word of the verse that decides the final count of the line. If the accent of the final word is at the last syllable, then the poetic rule states that one syllable shall be added to the actual count of syllables in the said line, thus having a higher number of poetic syllables than the number of grammatical syllables. If the accent lies on the second to last syllable of the last word in the verse, then the final count of poetic syllables will be the same as the grammatical number of syllables. Furthermore, if the accent lies on the third to last syllable, then one syllable is subtracted from the actual count, having then less poetic syllables than grammatical syllables.     Spanish poetry uses poetic licenses, unique to Romance languages, to change the number of syllables by manipulating mainly the vowels in the line.     Regarding these poetic licenses one must consider three kinds of phenomena: syneresis, dieresis and hiatus          There are many types of licenses, used either to add or subtract syllables, that may be applied when needed after taking in consideration the poetic rules of the last word. Yet all have in common that they only manipulate vowels that are close to each other and not interrupted by consonants.     Some common metres in Spanish verse are:   ": null
    },
    {
        "Septenary": "septenary"
    },
    {
        ": A line with seven poetic syllables   ": null
    },
    {
        "Octosyllable": "octosyllable"
    },
    {
        ": A line with eight poetic syllables. This metre is commonly used in romances, narrative poems similar to English ballads, and in most proverbs.   ": null
    },
    {
        "Hendecasyllable": "hendecasyllable"
    },
    {
        ": A line with eleven poetic syllables. This metre plays a similar role to pentameter in English verse. It is commonly used in sonnets, among other things.   ": null
    },
    {
        "Alexandrine": "alexandrine"
    },
    {
        ": A line consisting of fourteen syllables, commonly separated by two hemistiches of seven syllables each .       In Italian poetry, metre is determined solely by the position of the last accent in a line, the position of the other accents being however important for verse equilibrium. Syllables are enumerated with respect to a verse which ends with a ": null
    },
    {
        "paroxytone": "paroxytone"
    },
    {
        ", so that a Septenary is defined as a verse whose last accent falls on the sixth syllable: it may so contain eight syllables  or just six . Moreover, when a word ends with a vowel and the next one starts with a vowel, they are considered to be in the same syllable : so Gli anni e i giorni consists of only four syllables . Even-syllabic verses have a fixed stress pattern. Because of the mostly ": null
    },
    {
        "trochaic": "trochee"
    },
    {
        " nature of the Italian language, verses with an even number of syllables are far easier to compose, and the ": null
    },
    {
        "Novenary": "novenary"
    },
    {
        " is usually regarded as the most difficult verse.     Some common metres in Italian verse are:   Sexenary: A line whose last stressed syllable is on the fifth, with a fixed stress on the second one as well    ": null
    },
    {
        "Septenary": "septenary"
    },
    {
        ": A line whose last stressed syllable is the sixth one.   ": null
    },
    {
        "Octosyllable": "octosyllable"
    },
    {
        ": A line whose last accent falls on the seventh syllable. More often than not, the secondary accents fall on the first, third and fifth syllable, especially in nursery rhymes for which this metre is particularly well-suited.   ": null
    },
    {
        "Hendecasyllable": "hendecasyllable"
    },
    {
        ": A line whose last accent falls on the tenth syllable. It therefore usually consists of eleven syllables; there are various kinds of possible accentuations. It is used in sonnets, in ottava rima, and in many other types of poetry. ": null
    },
    {
        "The Divine Comedy": "the divine comedy"
    },
    {
        ", in particular, is composed entirely of hendecasyllables, whose main stress pattern is on the 4th and 10th syllable. Hardison, O.B. . Prosody and purpose in the English renaissance. Johns Hopkins University Press. .       Apart from Ottoman poetry, which was heavily influenced by Persian traditions  and created a unique Ottoman style, traditional Turkish poetry features a system in which the number of syllables in each verse must be the same, most frequently 7, 8, 11, 14 syllables. These verses are then divided into syllable groups depending on the number of total syllables in a verse: 4+3 for 7 syllables, 4+4 or 5+3 for 8, 4+4+3 or 6+5 for 11 syllables. The end of each group in a verse is called a durak , and must coincide with the last syllable of a word.     The following example is by ": null
    },
    {
        "Faruk Nafiz Çamlıbel": "faruk nafiz çamlıbel"
    },
    {
        " , one of the most devoted users of traditional Turkish metre:          In this poem the 6+5 metre is used, so that there is a word-break  after the sixth syllable of every line, as well as at the end of each line.        In the ": null
    },
    {
        "Ottoman Turkish language": "ottoman turkish language"
    },
    {
        ", the structures of the poetic foot  and of poetic metre  were imitated from Persian poetry. About twelve of the commonest Persian metres were used for writing Turkish poetry. As was the case with Persian, no use at all was made of the commonest metres of Arabic poetry . Deo, Ashwini; Kiparsky, Paul . . In Maria-Kristina Lotman and Mihhail Lotman ed. Proceedings of International Conference on Frontiers in Comparative Metrics, Estonia, pp. 147–173. . However, the terminology used to described the metres was indirectly borrowed from the ": null
    },
    {
        "Arabic poetic tradition": "arabic poetry"
    },
    {
        " through the medium of the ": null
    },
    {
        "Persian language": "persian language"
    },
    {
        ".     As a result, ": null
    },
    {
        "Ottoman poetry": "poetry of the ottoman empire"
    },
    {
        ", also known as Dîvân poetry, was generally written in quantitative, ": null
    },
    {
        "mora-timed": "mora-timed language"
    },
    {
        " metre. The ": null
    },
    {
        "moras": "mora"
    },
    {
        ", or syllables, are divided into three basic types:     Open, or ": null
    },
    {
        "light": "syllable weight"
    },
    {
        ", syllables  consist of either a short ": null
    },
    {
        "vowel": "vowel"
    },
    {
        " alone, or a ": null
    },
    {
        "consonant": "consonant"
    },
    {
        " followed by a short vowel   Examples: a-dam ; zir-ve   Closed, or heavy, syllables  consist of either a long vowel alone, a consonant followed by a long vowel, or a short vowel followed by a consonant   Examples: Â-dem ; kâ-fir ; at   Lengthened, or superheavy, syllables  count as one closed plus one open syllable and consist of a vowel followed by a ": null
    },
    {
        "consonant cluster": "consonant cluster"
    },
    {
        ", or a long vowel followed by a consonant   Examples: kürk ; âb     In writing out a poems poetic metre, open syllables are symbolized by . and closed syllables are symbolized by – . From the different syllable types, a total of sixteen different types of poetic foot—the majority of which are either three or four syllables in length—are constructed, which are named and scanned as follows:             These individual poetic feet are then combined in a number of different ways, most often with four feet per line, so as to give the poetic metre for a line of verse. Some of the most commonly used metres are the following:     me fâ’ î lün / me fâ’ î lün / me fâ’ î lün / me fâ’ î lün . – – – / . – – – / . – – – / . – – –         ::—": null
    },
    {
        "Bâkî": "bâkî"
    },
    {
        "   me fâ i lün / fe i lâ tün / me fâ i lün / fe i lün . – . – / . . – – / . – . – / . . –         ::—Şeyh Gâlib   fâ i lâ tün / fâ i lâ tün / fâ i lâ tün / fâ i lün – . – – / – . – – / – . – – / – . –         ::—": null
    },
    {
        "Nedîm": "nedîm"
    },
    {
        "   fe i lâ tün / fe i lâ tün / fe i lâ tün / fe i lün . . – – / . . – – / . . – – / . . –         ::—": null
    },
    {
        "Fuzûlî": "fuzûlî"
    },
    {
        "   mef’ û lü / me fâ î lü / me fâ î lü / fâ û lün – – . / . – – . / . – – . / – – .         ::—": null
    },
    {
        "Neşâtî": "neşâtî"
    },
    {
        "       Portuguese poetry uses a syllabic metre in which the verse is classified according to the last stressed syllable. The Portuguese system is quite similar to those of Spanish and Italian, as they are closely related languages. The most commonly used verses are:   Redondilha menor: composed of 5 syllables.   Redondilha maior: composed of 7 syllables.   ": null
    },
    {
        "Decasyllable": "decasyllable"
    },
    {
        " : composed of 10 syllables. Mostly used in ": null
    },
    {
        "Parnassian": "parnassianism"
    },
    {
        " sonnet": "sonnet"
    },
    {
        "s. It is equivalent to the Italian ": null
    },
    {
        "hendecasyllable": "hendecasyllable"
    },
    {
        ".   Heroic : stresses on the sixth and tenth syllables.   ": null
    },
    {
        "Sapphic": "sapphic stanza"
    },
    {
        " : stresses on the fourth, eighth and tenth syllables.   Martelo: stresses on the third, sixth and tenth syllables.   Gaita galega or moinheira: stresses on the fourth, seventh and tenth syllables.   ": null
    },
    {
        "Dodecasyllable": "dodecasyllable"
    },
    {
        " : composed of 12 syllables.   ": null
    },
    {
        "Alexandrine": "alexandrine"
    },
    {
        " : divided into two ": null
    },
    {
        "hemistich": "hemistich"
    },
    {
        "es, the sixth and the twelfth syllables are stressed.   Barbarian : composed of 13 or more syllables.   Lucasian : composed of 16 syllables, divided into two ": null
    },
    {
        "hemistich": "hemistich"
    },
    {
        "es of 8 syllables each.          There is a continuing tradition of strict metre poetry in the ": null
    },
    {
        "Welsh language": "welsh language"
    },
    {
        " that can be traced back to at least the sixth century. At the annual ": null
    },
    {
        "National Eisteddfod of Wales": "national eisteddfod of wales"
    },
    {
        " a ": null
    },
    {
        "bardic chair": "chairing of the bard"
    },
    {
        " is awarded to the best , a long poem that follows the conventions of  regarding ": null
    },
    {
        "stress": "stress"
    },
    {
        ", ": null
    },
    {
        "alliteration": "alliteration"
    },
    {
        " and ": null
    },
    {
        "rhyme": "rhyme"
    },
    {
        ".          Metrical texts are first attested in early ": null
    },
    {
        "Indo-European languages": "indo-european languages"
    },
    {
        ". The earliest known unambiguously metrical texts, and at the same time the only metrical texts with a claim of dating to the ": null
    },
    {
        "Late Bronze Age": "late bronze age"
    },
    {
        ", are the hymns of the ": null
    },
    {
        "Rigveda": "rigveda"
    },
    {
        ". That the texts of the ": null
    },
    {
        "Ancient Near East": "ancient near east"
    },
    {
        " should not exhibit metre is surprising, and may be partly due to the nature of ": null
    },
    {
        "Bronze Age writing": "bronze age writing"
    },
    {
        ". There were, in fact, attempts to reconstruct metrical qualities of the poetic portions of the ": null
    },
    {
        "Hebrew Bible": "hebrew bible"
    },
    {
        ", e.g. by ": null
    },
    {
        "Gustav Bickell": "gustav bickell"
    },
    {
        " Metrices biblicae regulae exemplis illustratae , 1879, Carmina Vet. Test. metrice , 1882 or ": null
    },
    {
        "Julius Ley": "julius ley"
    },
    {
        ", Leitfaden der Metrik der hebräischen Poesie , 1887 but they remained inconclusive The ": null
    },
    {
        "Catholic Encyclopedia": "catholic encyclopedia"
    },
    {
        " s.v. Hebrew Poetry of the Old Testament calls them Procrustean. . ": null
    },
    {
        "Early Iron Age": "early iron age"
    },
    {
        " metrical poetry is found in the Iranian ": null
    },
    {
        "Avesta": "avesta"
    },
    {
        " and in the Greek works attributed to ": null
    },
    {
        "Homer": "homer"
    },
    {
        " and ": null
    },
    {
        "Hesiod": "hesiod"
    },
    {
        ".   ": null
    },
    {
        "Latin verse": "latin poetry"
    },
    {
        " survives from the ": null
    },
    {
        "Old Latin": "old latin"
    },
    {
        " period , in the ": null
    },
    {
        "Saturnian metre": "saturnian"
    },
    {
        ". ": null
    },
    {
        "Persian poetry": "persian poetry"
    },
    {
        " Fereydoon Motamed": "fereydoon motamed"
    },
    {
        "  La Metrique Diatemporelle : Quantitative poetic metric analysis and pursuit of reasoning on aesthetics of linguistics and poetry in Indo-European languages. arises in the ": null
    },
    {
        "Sassanid": "sassanid"
    },
    {
        " era. ": null
    },
    {
        "Tamil": "tamil language"
    },
    {
        " poetry of the early centuries AD may be the earliest known non-Indo-European     ": null
    },
    {
        "Medieval poetry": "medieval poetry"
    },
    {
        " was metrical without exception, spanning traditions as diverse as European ": null
    },
    {
        "Minnesang": "minnesang"
    },
    {
        ", ": null
    },
    {
        "Trouvère": "trouvère"
    },
    {
        " or ": null
    },
    {
        "Bardic poetry": "bardic poetry"
    },
    {
        ", Classical ": null
    },
    {
        "Persian": "persian poetry"
    },
    {
        " and ": null
    },
    {
        "Sanskrit poetry": "sanskrit poetry"
    },
    {
        ", ": null
    },
    {
        "Tang dynasty": "tang dynasty"
    },
    {
        " Chinese poetry": "chinese poetry"
    },
    {
        " or the ": null
    },
    {
        "Japanese": "japanese poetry"
    },
    {
        " Nara period": "nara period"
    },
    {
        "  Manyōshū . Renaissance and Early Modern poetry in Europe is characterized by a return to templates of Classical Antiquity, a tradition begun by ": null
    },
    {
        "Petrarcas": "petrarch"
    },
    {
        "generation and continued into the time of ": null
    },
    {
        "Shakespeare": "shakespeare"
    },
    {
        " and ": null
    },
    {
        "Milton": "john milton"
    },
    {
        ".       Not all poets accept the idea that metre is a fundamental part of poetry. 20th-century American poets ": null
    },
    {
        "Marianne Moore": "marianne moore"
    },
    {
        ", ": null
    },
    {
        "William Carlos Williams": "william carlos williams"
    },
    {
        " and ": null
    },
    {
        "Robinson Jeffers": "robinson jeffers"
    },
    {
        " believed that metre was an artificial construct imposed upon poetry rather than being innate to poetry. In an essay titled Robinson Jeffers, & The Metric Fallacy ": null
    },
    {
        "Dan Schneider": "dan schneider"
    },
    {
        " echoes Jeffers sentiments: What if someone actually said to you that all music was composed of just 2 notes? Or if someone claimed that there were just 2 colors in creation? Now, ponder if such a thing were true. Imagine the clunkiness & mechanicality of such music. Think of the visual arts devoid of not just color, but sepia tones, & even shades of gray. Jeffers called his technique rolling stresses .     Moore went further than Jeffers, openly declaring her poetry was written in syllabic form, and wholly denying metre. These syllabic lines from her famous poem ": null
    },
    {
        " Poetry ": "wikisource:poetry"
    },
    {
        " illustrate her contempt for metre and other poetic tools. Even the syllabic pattern of this poem does not remain perfectly consistent:     ::::nor is it valid   ::::::to discriminate against business documents and     ::school-books : all these phenomena are important. One must make a distinction   :::::however: when dragged into prominence by half poets, the result is not poetry     Williams tried to form poetry whose subject matter was centered on the lives of common people. He came up with the concept of the ": null
    },
    {
        "variable foot": "variable foot"
    },
    {
        ". Williams spurned traditional metre in most of his poems, preferring what he called colloquial idioms. Another poet who turned his back on traditional concepts of metre was Britains ": null
    },
    {
        "Gerard Manley Hopkins": "gerard manley hopkins"
    },
    {
        ". Hopkins major innovation was what he called ": null
    },
    {
        "sprung rhythm": "sprung rhythm"
    },
    {
        ". He claimed most poetry was written in this older rhythmic structure inherited from the Norman side of the English literary heritage, based on repeating groups of two or three syllables, with the stressed syllable falling in the same place on each repetition.": null
    }
]