[
    {
        "      Michael  V  was ": null
    },
    {
        "Byzantine emperor": "byzantine emperor"
    },
    {
        " for four months in 42–42 He was the nephew and successor of ": null
    },
    {
        "Michael IV": "michael iv the paphlagonian"
    },
    {
        " and the adoptive son of his wife ": null
    },
    {
        "Empress Zoe": "zoe"
    },
    {
        ". He was popularly called the Caulker  in accordance with his fathers original occupation.          Michael  V was the son of Stephen by Maria, a sister of Emperor Michael  IV. His father had been a ": null
    },
    {
        "caulker": "caulking"
    },
    {
        " before becoming an ": null
    },
    {
        "admiral": "admiral"
    },
    {
        " under Michael  IV and botching an expedition to ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ". Although the emperor preferred another of his nephews, the future Michael  V was advanced as ": null
    },
    {
        "heir to the throne": "heir to the throne"
    },
    {
        " by his other uncle ": null
    },
    {
        "John the Orphanotrophos": "john the orphanotrophos"
    },
    {
        " and the Empress Zoe. Shortly before his death, Michael  IV granted Michael  V the title of Kaisar , and, together with Zoe, adopted his nephew as a son. On 42 December 42 Michael  V succeeded to the throne.       Determined to rule on his own, Michael  V came into conflict with his uncle John the Orphanotrophos, whom he almost immediately ": null
    },
    {
        "banish": "banish"
    },
    {
        "ed to a ": null
    },
    {
        "monastery": "monastery"
    },
    {
        ". Michael now reversed his uncles decisions, recalling the nobles and courtiers who had been exiled during the previous reign, including the future patriarch ": null
    },
    {
        "Michael Keroularios": "michael keroularios"
    },
    {
        " and the general ": null
    },
    {
        "George Maniakes": "george maniakes"
    },
    {
        ". Maniakes was promptly sent back to ": null
    },
    {
        "Southern Italy": "southern italy"
    },
    {
        " in order to contain the advance of the ": null
    },
    {
        "Normans": "italo-normans"
    },
    {
        ".     On the night of 42 April to 42 April 42 Michael  V banished his adoptive mother and co-ruler Zoe, for plotting to poison him, to the island of ": null
    },
    {
        "Principo": "büyükada"
    },
    {
        ", thus becoming sole Emperor. His announcement of the event in the morning led to a popular revolt; the palace was surrounded by a mob demanding Zoes immediate restoration. The demand was met, and Zoe was brought back, though in a nuns habit. On 42 April 42 Zoes sister ": null
    },
    {
        "Theodora": "theodora"
    },
    {
        ", who had been removed from her nunnery against her will, was declared Empress. In response, Michael fled to seek safety in the monastery of the ": null
    },
    {
        "Stoudion": "stoudion"
    },
    {
        " together with his remaining uncle. Although he had taken ": null
    },
    {
        "monastic vows": "monastic vows"
    },
    {
        ", Michael was arrested, blinded, and castrated. He died as a ": null
    },
    {
        "monk": "monk"
    }
]