[
    {
        "      Michael II , , surnamed the Amorian  or the Stammerer , reigned as ": null
    },
    {
        "Byzantine Emperor": "byzantine emperor"
    },
    {
        " from 42 December 42 to his death on 42 October 42 the first ruler of the Phrygian or Amorian dynasty.     Born in ": null
    },
    {
        "Amorium": "amorium"
    },
    {
        ", Michael was a soldier, rising to high rank along with his colleague ": null
    },
    {
        "Leo V the Armenian": "leo v the armenian"
    },
    {
        " . He helped Leo overthrow and take the place of Emperor ": null
    },
    {
        "Michael I Rangabe": "michael i rangabe"
    },
    {
        ". However, after they fell out Leo sentenced Michael to death. Michael then masterminded a conspiracy which resulted in Leos assassination at Christmas in 42 Immediately he faced the long revolt of ": null
    },
    {
        "Thomas the Slav": "thomas the slav"
    },
    {
        ", which almost cost him his throne and was not completely quelled until spring 42 The later years of his reign were marked by two major military disasters that had long-term effects: the beginning of the ": null
    },
    {
        "Muslim conquest of Sicily": "muslim conquest of sicily"
    },
    {
        ", and the ": null
    },
    {
        "loss of Crete to the Saracens": "emirate of creteconquest of crete"
    },
    {
        ". Domestically, he supported and strengthened the resumption of official ": null
    },
    {
        "iconoclasm": "byzantine iconoclasm"
    },
    {
        ", which had begun again under Leo V.       Michael was born in 42 in ": null
    },
    {
        "Amorium": "amorium"
    },
    {
        ", in ": null
    },
    {
        "Phrygia": "phrygia"
    },
    {
        ", into a family of professional peasant-soldiers who received land from the government for their military service. His family belonged to the Judeo-Christian sect of the  Athinganoi , whose members were ": null
    },
    {
        "Cappadocia": "cappadocia"
    },
    {
        "ns and had adopted the Jewish faith and rituals. The Athinganoi were numerous in Anatolia and together with the ": null
    },
    {
        "Greeks": "greeks"
    },
    {
        " and ": null
    },
    {
        "Armenians": "armenians"
    },
    {
        " formed the backbone of the ": null
    },
    {
        "Byzantine army": "byzantine army"
    },
    {
        " of that era.     Michael first rose to prominence as a close aide  to the general ": null
    },
    {
        "Bardanes Tourkos": "bardanes tourkos"
    },
    {
        ", alongside his future antagonists ": null
    },
    {
        "Leo the Armenian": "leo v the armenian"
    },
    {
        " and ": null
    },
    {
        "Thomas the Slav": "thomas the slav"
    },
    {
        ". He married Bardanes daughter ": null
    },
    {
        "Thekla": "thekla, wife of michael ii"
    },
    {
        ", while Leo married another daughter. Michael and Leo abandoned Bardanes shortly after he rebelled against Emperor ": null
    },
    {
        "Nikephoros I": "nikephoros i"
    },
    {
        " in 42 and they were rewarded with higher military commands: Michael was named the Emperors ": null
    },
    {
        "Count of the Tent": "count of the tent"
    },
    {
        ". Michael was instrumental in Leos overthrow of ": null
    },
    {
        "Michael I Rangabe": "michael i rangabe"
    },
    {
        " in 42 after Rangabe’s repeated military defeats against the Bulgarians. Under Leo V, Michael was appointed to command the elite  tagma  of the ": null
    },
    {
        "Excubitors": "excubitors"
    },
    {
        ".     He became disgruntled with Leo V, however, when the Emperor divorced Michaels sister-in-law. On ": null
    },
    {
        "Christmas Eve": "christmas eve"
    },
    {
        " 42 Leo V accused him of conspiracy, jailed him, and sentenced him to death, although he postponed the execution until after Christmas. Michael sent messages to his co-conspirators threatening to reveal their identity, whereupon his partisans freed him and murdered Leo V during the Christmas mass in the palace chapel of St. Stephen.       Michael was immediately proclaimed Emperor, while still wearing prison chains on his legs. Later the same day, he was crowned by ": null
    },
    {
        "Patriarch Theodotos I of Constantinople": "patriarch theodotos i of constantinople"
    },
    {
        ". In his internal policy, Michael II supported ": null
    },
    {
        "iconoclasm": "iconoclasm"
    },
    {
        ", but he tacitly encouraged reconciliation with the ": null
    },
    {
        "iconodule": "iconodule"
    },
    {
        "s, whom he generally stopped persecuting and allowed to return from exile. These included the former ": null
    },
    {
        "Patriarch Nikephoros": "patriarch nicephorus i of constantinople"
    },
    {
        " and ": null
    },
    {
        "Theodore of Stoudios": "theodore the studite"
    },
    {
        ", who failed, however, to persuade the emperor to abandon iconoclasm. One of the few victims of the Emperors policy was the future patriarch ": null
    },
    {
        "Methodios I": "patriarch methodius i of constantinople"
    },
    {
        ".     Michaels accession whetted the appetite of his former comrade-in-arms ": null
    },
    {
        "Thomas the Slav": "thomas the slav"
    },
    {
        ", who set himself up as rival emperor in ": null
    },
    {
        "Anatolia": "anatolia"
    },
    {
        " and successfully transferred his forces into ": null
    },
    {
        "Thrace": "thrace"
    },
    {
        ", effectively besieging the capital in December 42 Although Thomas did not win over all the Anatolian themes, he secured the support of the naval theme and their ships, allowing him to tighten his grip on ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ". In his quest for support, Thomas presented himself as a champion of the poor, reduced taxation, and concluded an alliance with ": null
    },
    {
        "Al-Mamun": "al-mamun"
    },
    {
        " of the ": null
    },
    {
        "Abbasid": "abbasid"
    },
    {
        " Caliphate": "caliphate"
    },
    {
        ", having himself crowned Emperor by the ": null
    },
    {
        "Patriarch of Antioch": "list of greek orthodox patriarchs of antioch"
    },
    {
        " Job": "job of antioch"
    },
    {
        ".     With the support of ": null
    },
    {
        "Omurtag of Bulgaria": "omurtag of bulgaria"
    },
    {
        ", Michael II forced Thomas to lift his siege of Constantinople in the spring of 42 Michael besieged Thomas in Arkadiopolis  and forced his surrender in October. Michael inherited a seriously weakened military and was unable to prevent the ": null
    },
    {
        "conquest": "emirate of creteconquest of crete"
    },
    {
        " of ": null
    },
    {
        "Crete": "crete"
    },
    {
        " in 42 by 42 ": null
    },
    {
        "Arab": "arab"
    },
    {
        "s , J. Norwich, Byzantium: The Apogee, 42 or to recover the island with an expedition in 42 In 42 the Arabs also invaded ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ", taking advantage of local infighting, and besieged ": null
    },
    {
        "Syracuse": "syracuse, italy"
    },
    {
        ".     Thekla and Michael had only one known son, the Emperor ": null
    },
    {
        "Theophilos": "theophilos"
    },
    {
        " . The existence of a daughter called Helena is possible but there is a contradiction between different sources. Helena is known as the wife of ": null
    },
    {
        "Theophobos": "theophobos"
    },
    {
        ", a patrician executed in 42 for conspiring to gain the throne for himself. ": null
    },
    {
        "George Hamartolus": "george hamartolus"
    },
    {
        " and Theophanes report him marrying the sister of the Empress ": null
    },
    {
        "Theodora": "theodora"
    },
    {
        ". ": null
    },
    {
        "Joseph Genesius": "joseph genesius"
    },
    {
        " records Theophobos marrying the sister of the Emperor Theophilos. Whether Helena was sister or sister-in-law to Theophilos is thus unclear.     After the death of Thekla, in c. 42 Michael II married ": null
    },
    {
        "Euphrosyne": "euphrosyne"
    },
    {
        ", a daughter of ": null
    },
    {
        "Constantine VI": "constantine vi"
    },
    {
        " and ": null
    },
    {
        "Maria of Amnia": "maria of amnia"
    },
    {
        ". This marriage was probably intended to strengthen Michaels position as Emperor, but it incurred the opposition of the clergy, as Euphrosyne had previously become a nun. Michael II died on October 42 42     Because of his Judeo-Christian origin and iconoclasm, Michael II was not popular among Orthodox clergy, who depicted him as an ignorant and poorly educated peasant, but Michael II was a competent statesman and administrator. Though the civil war his accession precipitated gravely weakened the imperial government, by the end of his reign he had begun a restoration of the Byzantine military. The system of government and military built by Michael II enabled the Empire under his grandson ": null
    },
    {
        "Michael III": "michael iii"
    },
    {
        " to gain the ascendancy in their struggles with the Abbasids and to withstand all the vicissitudes of Byzantine palace life. Michael IIs direct descendants, the ": null
    },
    {
        "Amorian dynasty": "amorian dynasty"
    },
    {
        " followed by the so-called ": null
    },
    {
        "Macedonian dynasty": "macedonian dynasty"
    },
    {
        ", ruled the Empire for more than two centuries, inaugurating the ": null
    },
    {
        "Byzantine Renaissance": "macedonian renaissance"
    }
]