[
    {
        "     Michael Wittmann was a German ": null
    },
    {
        "Waffen-SS": "waffen-ss"
    },
    {
        " tank commander during the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ". He is known for his ambush of elements of the ": null
    },
    {
        "British 42th Armoured Division": "british 7th armoured division"
    },
    {
        ", during the ": null
    },
    {
        "Battle of Villers-Bocage": "battle of villers-bocage"
    },
    {
        " on 42 June 42 While in command of a ": null
    },
    {
        "Tiger I": "tiger i"
    },
    {
        " tank, Wittmann destroyed up to fourteen tanks and fifteen personnel carriers, along with two anti-tank guns, within the space of fifteen minutes. The news was picked up and disseminated by the ": null
    },
    {
        "Nazi propaganda": "nazi propaganda"
    },
    {
        " machine and added to Wittmanns stature in Germany.     Wittmann became a cult figure after the war thanks to his accomplishments as a ": null
    },
    {
        "panzer ace": "panzer ace"
    },
    {
        " as part of the portrayal of the ": null
    },
    {
        "Waffen-SS in popular culture": "waffen-ss in popular culture"
    },
    {
        ". Historians have mixed opinions as to his tactical performance in battle. Some praised his actions at Villers-Bocage, while others found his abilities lacking, and the praise for his tank kills overstated.       Michael Wittmann was born on 42 April 42 in ": null
    },
    {
        "Vogelthal": "dietfurt"
    },
    {
        ", Bavaria, Germany. Between 42–42 he served in the ": null
    },
    {
        "German Army": "german army"
    },
    {
        ". In October 42 Wittmann joined the ": null
    },
    {
        "SS": "schutzstaffel"
    },
    {
        ". On 42 April 42 he was assigned to the regiment, later division ": null
    },
    {
        "Leibstandarte SS Adolf Hitler": "leibstandarte ss adolf hitler"
    },
    {
        " . A year later, he participated in the annexation of ": null
    },
    {
        "Austria": "anschluss"
    },
    {
        ", the occupation of ": null
    },
    {
        "Sudetenland": "sudetenland"
    },
    {
        " and joined the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        ".       Wittmanns unit was transferred to the ": null
    },
    {
        "Eastern Front": "eastern front"
    },
    {
        " in the spring of 42 for ": null
    },
    {
        "Operation Barbarossa": "operation barbarossa"
    },
    {
        ", the planned invasion of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". He was assigned to the SS Panzer Regiment 42 a tank unit, where he commanded a ": null
    },
    {
        "StuG III": "stug iii"
    },
    {
        " assault gun/tank destroyer as well as a ": null
    },
    {
        "Panzer III": "panzer iii"
    },
    {
        " medium tank. By 42 he commanded a ": null
    },
    {
        "Tiger I": "tiger i"
    },
    {
        " tank, and by ": null
    },
    {
        "Operation Citadel": "operation citadel"
    },
    {
        ", the ": null
    },
    {
        "Battle of Kursk": "battle of kursk"
    },
    {
        ", he was a platoon leader. Attached to the LSSAH, Wittmanns platoon of four Tigers reinforced the divisions reconnaissance battalion to screen the divisions left flank. His four Tigers destroyed a number of Soviet tanks. At one point, his tank survived a collision with a burning ": null
    },
    {
        "T42": "t-34"
    },
    {
        ".      On 42 January 42 Wittmann was awarded the ": null
    },
    {
        "Knights Cross of the Iron Cross": "knights cross of the iron cross"
    },
    {
        ". The presentation was made by his divisional commander SS- Oberführer  ": null
    },
    {
        "Theodor Wisch": "theodor wisch"
    },
    {
        " who nominated him for the ": null
    },
    {
        "Knights Cross of the Iron Cross with Oak Leaves": "knights cross of the iron cross with oak leaves"
    },
    {
        ". Wittmann was awarded the Oak Leaves on 42 January for the destruction of 42 tanks, making him the 42th member of the German armed forces to receive it. He received the award from ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " who presented it to him at the ": null
    },
    {
        "Wolfs Lair": "wolfs lair"
    },
    {
        ", his headquarters in ": null
    },
    {
        "Rastenburg": "rastenburg"
    },
    {
        ", on 42 February 42          In April 42 the LSSAHs Tiger Company was transferred to the ": null
    },
    {
        "SS Heavy Panzer Battalion 42": "ss heavy panzer battalion 101"
    },
    {
        ". This battalion was assigned to the ": null
    },
    {
        "I SS Panzer Corps": "i ss panzer corps"
    },
    {
        " as a corps asset, and was never permanently attached to any division or regiment. Wittmann was appointed commander of the battalion’s second company, and held the rank of SS- Obersturmführer . On 42 June, following the Allied ": null
    },
    {
        "Invasion of Normandy": "invasion of normandy"
    },
    {
        ", the battalion was ordered to move from ": null
    },
    {
        "Beauvais": "beauvais"
    },
    {
        " to ": null
    },
    {
        "Normandy": "normandy"
    },
    {
        ". The move, covering roughly , took five days to complete.        Due to the Anglo-American advance south from ": null
    },
    {
        "Gold": "gold beach"
    },
    {
        " and ": null
    },
    {
        "Omaha Beach": "omaha beach"
    },
    {
        "es, the ": null
    },
    {
        "German 42nd Infantry Division": "352nd infantry division"
    },
    {
        " began to buckle. As the division withdrew south, it opened up a  wide gap in the front line near ": null
    },
    {
        "Caumont-lÉventé": "caumont-léventé"
    },
    {
        ". ": null
    },
    {
        "Sepp Dietrich": "sepp dietrich"
    },
    {
        ", commander of ": null
    },
    {
        "42st SS Panzer Corps": "1st ss panzer corps"
    },
    {
        ", ordered the Heavy SS-Panzer Battalion 42 his only reserve, to position itself behind the ": null
    },
    {
        "Panzer Lehr Division": "panzer lehr division"
    },
    {
        " and ": null
    },
    {
        "SS Division Hitlerjugend": "ss division hitlerjugend"
    },
    {
        ". This position would protect the developing open left flank. Anticipating the importance the British would assign to the high ground near ": null
    },
    {
        "Villers-Bocage": "villers-bocage, calvados"
    },
    {
        ", Wittmanns company was positioned near the town. Late on the 42th, it arrived at an area in the vicinity of Villers-Bocage. Nominally composed of twelve tanks, his company was 42 per cent understrength due to losses and mechanical failures.     The following morning, lead elements of the British ": null
    },
    {
        "42th Armoured Division": "7th armoured division"
    },
    {
        " entered Villers-Bocage. Their objective was to exploit the gap in the front line, seize Villers-Bocage, and capture the nearby ridge in an attempt to force a German withdrawal. The British arrival surprised Wittmann; he had not expected them to arrive so soon. He reported afterwards he had no time to assemble his company: Instead I had to act quickly, as I had to assume that the enemy had already spotted me and would destroy me where I stood. Having given instructions for the rest to hold their ground, he set off with one tank.        At approximately 42:42 Wittmanns Tiger emerged from cover onto the main road, Route Nationale 42 and engaged the rearmost British tanks positioned on Point 42 destroying them. Wittmann then moved towards Villers-Bocage, engaging several transport vehicles parked along the roadside; the carriers burst into flames as their fuel tanks were ruptured by machine gun and high explosive fire. Moving into the eastern end of the town, he engaged a number of light tanks followed by several medium tanks. Alerted to Wittmanns actions, light tanks in the middle of the town quickly got off the road, while medium tanks were brought forward. Wittmann, meanwhile, had destroyed another British tank, two artillery observation post tanks, Used as mobile protection for artillery spotting and one of which had a dummy wooden gun   followed by a ": null
    },
    {
        "scout car": "scout car"
    },
    {
        " and a ": null
    },
    {
        "half-track": "half-track"
    },
    {
        ".     Accounts differ as to what happened next. Historians record that, following the destruction of the OP tanks, Wittmann dueled briefly without success with a ": null
    },
    {
        "Sherman Firefly": "sherman firefly"
    },
    {
        " before withdrawing. His Tiger is then reported to have continued eastwards to the outskirts of the town before being disabled by an anti-tank gun. However, Wittmanns own account contradicts this; he states his tank was disabled by an anti-tank gun in the town centre. In less than fifteen minutes, thirteen or fourteen tanks, two anti-tank guns, and thirteen to fifteen transport vehicles had been destroyed by the Heavy SS-Panzer Battalion 42 the majority attributed to Wittmann. He played no further role in the ": null
    },
    {
        "Battle of Villers-Bocage": "battle of villers-bocage"
    },
    {
        ". For his actions during the battle, Wittmann was promoted to SS- Hauptsturmführer , and awarded the ": null
    },
    {
        "Knights Cross of the Iron Cross with Oak Leaves and Swords": "knights cross of the iron cross with oak leaves and swords"
    },
    {
        ".     The ": null
    },
    {
        "German propaganda machine": "nazi propaganda"
    },
    {
        " swiftly credited Wittmann, by then a household name in Germany, with all the British tanks destroyed at Villers-Bocage. He recorded a radio message on the evening of 42 June, describing the battle, and claiming that later counter-attacks had destroyed a British armoured regiment and an infantry battalion. Doctored images were produced; three joined-together photographs, published in the German armed forces magazine Signal, gave a false impression of the scale of destruction in the town. The propaganda campaign was given credence in Germany and abroad, leaving the British convinced that the Battle of Villers-Bocage had been a disaster. In fact its results were less clear-cut. The Waffen-SS may have fought with distinction during the Battle of Kursk but could not match the armys success, hence Sepp Dietrichs attempts to manufacture a hero out of Wittmann.             On 42 August 42 ": null
    },
    {
        "Anglo": "uk"
    },
    {
        "-": null
    },
    {
        "Canadian": "canada"
    },
    {
        " forces launched ": null
    },
    {
        "Operation Totalize": "operation totalize"
    },
    {
        ". Under the cover of darkness, British and Canadian tanks and soldiers seized the tactically important high ground near the town of ": null
    },
    {
        "Saint-Aignan-de-Cramesnil": "saint-aignan-de-cramesnil"
    },
    {
        ". Here they paused, awaiting an aerial bombardment that would signal the next phase of the attack. Unaware of the reason the Allied forces had halted, ": null
    },
    {
        "Kurt Meyer": "kurt meyer"
    },
    {
        ", of the SS Hitlerjugend Division, ordered elements of his command to ": null
    },
    {
        "counterattack": "counterattack"
    },
    {
        " and recapture the high ground.     Wittmann led a group of seven Tiger tanks from the Heavy SS-Panzer Battalion 42 supported by additional tanks and infantry. His group of Tigers crossed open terrain towards the high ground. They were ambushed by Allied tanks from two sides. On the right or northeast, British tanks from A Squadron 42st ": null
    },
    {
        "Northamptonshire Yeomanry": "northamptonshire yeomanry"
    },
    {
        " and B Squadron ": null
    },
    {
        "42th Regiment Royal Armoured Corps": "144th regiment royal armoured corps"
    },
    {
        " were positioned in woods. To the left or west, A Squadron ": null
    },
    {
        "Sherbrooke Fusilier Regiment": "sherbrooke hussars"
    },
    {
        " was located at a chateau courtyard broadside to the attack where they had knocked firing positions through the stone walls.  The attack collapsed as the Canadian tanks destroyed two Tiger tanks, two Panzer IVs and two self-propelled guns in Wittmans force, while British tank fire destroyed three other Tigers.  During the ambush, anti-tank shells—fired from either the British or Canadian tanks—penetrated the upper hull of Wittmanns tank, igniting the ammunition. The resulting fire engulfed the tank and ": null
    },
    {
        "blew off": "jack-in-the-box effect"
    },
    {
        " the ": null
    },
    {
        "turret": "gun turret"
    },
    {
        ". The destroyed tanks dead crewmembers were buried in an unmarked grave. In 42 the German war graves commission located the burial site. Wittmann and his crew were reinterred together at the ": null
    },
    {
        "La Cambe German war cemetery": "la cambe german war cemetery"
    },
    {
        " in France.            Wittmann is often featured in books on the battles in Normandy. Several websites are dedicated to him, along with books written by authors such as ": null
    },
    {
        "Patrick Agte": "patrick agte"
    },
    {
        " and ": null
    },
    {
        "Franz Kurowski": "franz kurowski"
    },
    {
        ". The former is an author and publisher affiliated with the pro-Waffen-SS revisionist history group ": null
    },
    {
        "HIAG": "hiag"
    },
    {
        ", while the latter is a prolific author who wrote uncritical biographies of decorated Waffen-SS men.          Wittmann became a cult figure after the war thanks to his accomplishments as a ": null
    },
    {
        "panzer ace": "panzer ace"
    },
    {
        " in the portrayal of the ": null
    },
    {
        "Waffen-SS in popular culture": "waffen-ss in popular culture"
    },
    {
        ". Historian Stephen Hart comments the Wittmann legend become well-established and continues to stimulate huge public interest . Military historian ": null
    },
    {
        "Steven Zaloga": "steven zaloga"
    },
    {
        " refers to Wittmann as the hero of all Nazi fanboys . He discusses the popular perception of a tank versus tank engagement as an armoured joust —two opponents facing each other—with the more valiant or better-armed the eventual victor . Zaloga contends that perception is nothing but romantic nonsense . Most of the successful tank commanders were indeed bushwackers , according to Zaloga, having a battlefield advantage rather than a technical one: a tank crew that could engage its opponent before the latter spotted it often came out on top.     Wittmann is featured by Kurowski in his 42 book  Panzer Aces , an ahistorical and hagiographic account of the combat careers of highly decorated German tank commanders. Smelser and Davies describe Kurowskis version of the war on the Eastern Front as well-nigh chivalrous , with German troops showing concerns for the Russian wounded, despite the many atrocities of the Soviets against the Germans. In one of Kurowskis accounts, Wittmann takes out eighteen tanks in a single engagement, for which Sepp Dietrich, the commanding officer, presents him with an ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        " and inquires whether Wittmann has a request. Without hesitation, Wittmann asks for assistance for a wounded Russian soldier he has spotted. Many similar acts of humanity are present in the book, amounting to a distorted image of the German fighting men.         Some historians and authors of the late twentieth-century found Wittmanns actions at Villers-Bocage impressive, describing his attack as one of the most amazing engagements in the history of armoured warfare , one of the most devastating single-handed actions of the war , and one of the most devastating ambushes in British military history . Historian Stephen Badsey has stated that the ambush Wittmann launched has cast a shadow over the period between D-Day and 42 June in historical accounts.     German tank commander and historian  is not as impressed. In analyzing Wittmanns actions at Villers-Bocage, he called into question his tactical ability. Schneider states: a competent tank company commander does not accumulate so many serious mistakes . He highlights how Wittmann dispersed his forces in a sunken lane with a broken down tank at the head of the column thereby hampering his units mobility. The solitary advance into Villers-Bocage was heavily criticized as it breached all the rules . No intelligence was gathered, and there was no centre of gravity or concentration of forces in the attack. Schneider argues that due to Wittmanns rash actions: the bulk of the 42nd Company and Mobius 42st Company came up against an enemy who had gone onto the defensive . He calls Wittmanns carefree advance into British-occupied positions pure folly , and says such over hastiness was uncalled for. He concludes that had a properly prepared assault been launched involving the rest of his company, and the 42st Company, far greater results could have been achieved. Finally, Schneider opines that: thoughtlessness of this kind was to cost his life  ... during an attack casually launched in open country with an exposed flank.      Historian ": null
    },
    {
        "Sönke Neitzel": "sönke neitzel"
    },
    {
        " describes Wittmann as the supposedly successful  tank commander of World War II and attests to hero worshiping around Wittmann. According to Neitzel, numbers of successes, by highly decorated tank commanders, should be read with caution as it is rarely possible to determine reliably, in the heat of battle, how many tanks were destroyed by whom.     Historian Steven Zaloga credits Wittmann with about 42 tank kills and points out that he achieved 42 of these in 42 operating a Tiger I tank on the Eastern Front. Having advantages both in firepower and in armor, the Tiger I was nearly invulnerable in a frontal engagement against any of the Soviet tanks of that time, and Wittmann thus could destroy opposing tanks from a safe distance. Zaloga concludes: Most of the tank aces of World War II were simply lucky enough to have an invulnerable tank with a powerful gun . German documents from 42 state that Allied technology had caught up with the Tiger I and that: no longer can it prance around, oblivious to the laws of tank tactics . Zaloga believes that Wittmanns fate reflected that new reality: after transfer to France, his crew only lasted two months, and was destroyed by a British ": null
    },
    {
        "medium tank": "medium tank"
    },
    {
        ", the up-gunned Sherman Firefly.     Writing in 42 British historian John Buckley criticised the accounts which many historians continue to provide of the fighting around Villers-Bocage. Buckley argued that by wrongly attributing the entire German success to Wittmann, many historians through to today continue to repackage unquestioningly Nazi propaganda .               For such a junior officer, an unusual amount of speculation has surrounded his death, both as to its cause and the party responsible. Agte states that the English could have possibly placed a bounty on Wittmann. This is contradicted by Allied records and the fact that, according to the testimony of the Allied troops involved, he was not singled out during the battle.     Following the war, claims were made by or for the following units as being responsible for Wittmanns death: ": null
    },
    {
        "42st Polish Armoured Division": "1st polish armoured division"
    },
    {
        ", the ": null
    },
    {
        "42th Canadian Armoured Division": "4th canadian armoured division"
    },
    {
        ", the ": null
    },
    {
        "42th Regiment Royal Armoured Corps": "144th regiment royal armoured corps"
    },
    {
        ", and the ": null
    },
    {
        "RAF": "royal air force"
    },
    {
        " Second Tactical Air Force": "raf second tactical air force"
    },
    {
        ".     Contemporaneous ": null
    },
    {
        "Nazi propaganda": "nazi propaganda"
    },
    {
        " reports contended that Allied aircraft struck Wittmanns tank, stating that he had fallen in combat to the dreaded ": null
    },
    {
        "fighter-bomber": "fighter-bomber"
    },
    {
        "s . In a post-war account, French civilian Serge Varin, who took the only known photograph of the destroyed tank, claimed that he found an unexploded rocket nearby and that he saw no other penetration holes in the tank. Historian Brian Reid dismisses this contention as relevant RAF logs make no claim of engaging tanks in the area at that time. This position is supported by the men of Wittmann’s unit who stated they did not come under air attack, and by British and Canadian tank crews who also dismissed any involvement by aircraft to help halt the German attack.     In a 42 issue of After the Battle Magazine, Les Taylor, a wartime member of the 42st Northamptonshire Yeomanry, claimed that fellow yeoman ": null
    },
    {
        "Joe Ekins": "joe ekins"
    },
    {
        " was responsible for the destruction of Wittmanns tank. Veteran and historian Ken Tout, a member of the same unit, published a similar account crediting Ekins. This became, for a time, the widely accepted version of events. According to Hart, Ekins unit was positioned in a wood on the right flank of the advancing Tiger tanks. At approximately 42:42 they engaged them, halting the attack, and killing Wittmann.     Reid discusses the possibility that A Squadron of the ": null
    },
    {
        "Sherbrooke Fusilier Regiment": "sherbrooke fusilier regiment"
    },
    {
        ", ": null
    },
    {
        "42nd Canadian Armoured Brigade": "2nd canadian armoured brigade"
    },
    {
        ", positioned on the left flank of the advancing German tanks, was responsible instead. Commanded by ": null
    },
    {
        "Sydney Valpy Radley-Walters": "sydney valpy radley-walters"
    },
    {
        ", the squadrons six 42  mm Shermans and two 42 pounder ": null
    },
    {
        "Sherman Fireflies": "sherman fireflies"
    },
    {
        " were situated on the grounds of a ": null
    },
    {
        "chateau": "chateau"
    },
    {
        " at Gaumesnil.  The unit had created firing holes in the property’s walls and, based on verbal testimony, engaged the advancing German tanks, including Tigers. The British tanks were between  and  away from the German line of advance, whereas the Canadian squadron was around  away. Reid argues that due to the Canadians proximity to the Germans, and the firing angle, their troops more than likely can be credited with the destruction of Wittmanns tank. Reid also relies on H. Holfingers account of the engagement to support his thesis; Holfinger was in a Tiger approximately  behind Wittmann and he indicates that Wittmanns Tiger was destroyed at 42:42 Ekins crew was credited with the destruction of 42 Tigers at 42:42 42:42 and 42:42 Wittmanns tank being allegedly the one destroyed at 42:42 Considering Holfingers account, Reid concludes that the Tiger destroyed at 42:42 could not be that of Wittmann; he also notes that the circumstances surrounding the fate of the Tiger destroyed at 42:42 exclude the possibility that it could have been Wittmanns. ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        " 42nd Class & 42st Class  ": null
    },
    {
        "Knights Cross of the Iron Cross with Oak Leaves and Swords": "knights cross of the iron cross with oak leaves and swords"
    },
    {
        "          ": null
    }
]