[
    {
        "          Michelangelo Antonioni  , was an Italian film director, screenwriter, editor, painter, and short story author. He is best known for his trilogy on ": null
    },
    {
        "modernity": "modernity"
    },
    {
        " and its discontents —  LAvventura  ,  La Notte  , and  LEclisse  —as well as the English-language films  Blowup  and  The Passenger  . His films have been described as enigmatic and intricate mood pieces that featured elusive plots, striking visuals, and a preoccupation with modern landscapes. His work would substantially influence subsequent ": null
    },
    {
        "art film": "art film"
    },
    {
        "s.     Antonioni received numerous awards and nominations throughout his career, including the Cannes Film Festival ": null
    },
    {
        "Jury Prize": "jury prize"
    },
    {
        " , ": null
    },
    {
        "Palme dOr": "palme dor"
    },
    {
        " , and 42th Anniversary Prize ; the Venice Film Festival Silver Lion , ": null
    },
    {
        "Golden Lion": "golden lion"
    },
    {
        " , ": null
    },
    {
        "FIPRESCI Prize": "international federation of film critics"
    },
    {
        " , and Pietro Bianchi Award ; the Italian National Syndicate of Film Journalists ": null
    },
    {
        "Silver Ribbon": "silver ribbon"
    },
    {
        " eight times; and an honorary ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        " in 42 He is one of three directors to have won the ": null
    },
    {
        "Palme dOr": "palme dor"
    },
    {
        ", the ": null
    },
    {
        "Golden Lion": "golden lion"
    },
    {
        " and the ": null
    },
    {
        "Golden Bear": "golden bear"
    },
    {
        ", and the only director to have won these three and the ": null
    },
    {
        "Golden Leopard": "golden leopard"
    },
    {
        ".         Antonioni was born into a prosperous family of landowners in ": null
    },
    {
        "Ferrara": "ferrara"
    },
    {
        ", ": null
    },
    {
        "Emilia Romagna": "emilia romagna"
    },
    {
        ", in northern Italy. He was the son of Elisabetta and Ismaele Antonioni. The director explained to Italian film critic Aldo Tassone:          As a child, Antonioni was fond of drawing and music. A precocious violinist, he gave his first concert at the age of nine. Although he abandoned the violin with the discovery of cinema in his teens, drawing would remain a lifelong passion. I have never drawn, even as a child, either puppets or silhouettes but rather facades of houses and gates. One of my favorite games consisted of organizing towns. Ignorant in architecture, I constructed buildings and streets crammed with little figures. I invented stories for them. These childhood happenings - I was eleven years old - were like little films.      Upon graduation from the ": null
    },
    {
        "University of Bologna": "university of bologna"
    },
    {
        " with a degree in ": null
    },
    {
        "economics": "economics"
    },
    {
        ", he started writing for the local Ferrara newspaper Il Corriere Padano in 42 as a film journalist.     In 42 Antonioni moved to Rome, where he worked for Cinema, the official ": null
    },
    {
        "Fascist": "italian fascism"
    },
    {
        " film magazine edited by ": null
    },
    {
        "Vittorio Mussolini": "vittorio mussolini"
    },
    {
        ". However, Antonioni was fired a few months afterward. Later that year he enrolled at the Centro Sperimentale di Cinematografia to study film technique, but left after three months. He was subsequently drafted into the army. During the war Antonioni survived being condemned to death as a member of the ": null
    },
    {
        "Italian resistance": "italian resistance"
    },
    {
        ".             In 42 Antonioni co-wrote  A Pilot Returns  with ": null
    },
    {
        "Roberto Rossellini": "roberto rossellini"
    },
    {
        " and worked as assistant director on Enrico Fulchignonis I due Foscari. In 42 he travelled to France to assist ": null
    },
    {
        "Marcel Carné": "marcel carné"
    },
    {
        " on  Les visiteurs du soir  and then began a series of ": null
    },
    {
        "short film": "short film"
    },
    {
        "s with Gente del Po , a story of poor fishermen of the ": null
    },
    {
        "Po valley": "po valley"
    },
    {
        ". When Rome was liberated by the Allies, the film stock was transferred to the Fascist ": null
    },
    {
        "Republic of Salò": "italian social republic"
    },
    {
        " and could not be recovered and edited until 42 . These films were ": null
    },
    {
        "neorealist": "italian neorealism"
    },
    {
        " in style, being semi-": null
    },
    {
        "documentary": "documentary film"
    },
    {
        " studies of the lives of ordinary people.     However, Antonionis first full-length feature film  Cronaca di un amore  broke away from neorealism by depicting the middle classes. He continued to do so in a series of other films:  I vinti  , a trio of stories, each set in a different country , about juvenile delinquency;  La signora senza camelie   about a young film star and her fall from grace; and  Le amiche   about middle class women in Turin.  Il grido   was a return to working class stories, depicting a factory worker and his daughter. Each of these stories is about ": null
    },
    {
        "social alienation": "social alienation"
    },
    {
        ".         In Le Amiche , Antonioni experimented with a radical new style: instead of a conventional narrative, he presented a series of apparently disconnected events, and he used ": null
    },
    {
        "long take": "long take"
    },
    {
        "s as part of his film making style. Antonioni returned to their use in  Lavventura  , which became his first international success. At the ": null
    },
    {
        "Cannes Film Festival": "cannes film festival"
    },
    {
        " it received a mixture of cheers and boos, but the film was popular in art house cinemas around the world.  La notte  , starring ": null
    },
    {
        "Jeanne Moreau": "jeanne moreau"
    },
    {
        " and ": null
    },
    {
        "Marcello Mastroianni": "marcello mastroianni"
    },
    {
        ", and  LEclisse  , starring ": null
    },
    {
        "Alain Delon": "alain delon"
    },
    {
        ", followed Lavventura. These three films are commonly referred to as a trilogy because they are stylistically similar and all concerned with the alienation of man in the modern world.   La notte won the ": null
    },
    {
        "Golden Bear": "golden bear"
    },
    {
        " award at the ": null
    },
    {
        "42th Berlin International Film Festival": "11th berlin international film festival"
    },
    {
        ", His first color film,  Il deserto rosso  , deals with similar themes, and is sometimes considered the fourth film of the trilogy . All of these films star ": null
    },
    {
        "Monica Vitti": "monica vitti"
    },
    {
        ", his lover during that period.     Antonioni then signed a deal with producer ": null
    },
    {
        "Carlo Ponti": "carlo ponti"
    },
    {
        " that would allow artistic freedom on three films in English to be released by ": null
    },
    {
        "MGM": "mgm"
    },
    {
        ". The first,  Blowup  , set in ": null
    },
    {
        "Swinging London": "swinging london"
    },
    {
        ", was a major international success. The script was loosely based on the short story The Devils Drool  by Argentinian writer ": null
    },
    {
        "Julio Cortázar": "julio cortázar"
    },
    {
        ". Although it dealt with the challenging theme of the impossibility of objective standards and the ever-doubtable truth of memory, it was a successful and popular hit with audiences, no doubt helped by its sex scenes, which were explicit for the time. It starred ": null
    },
    {
        "David Hemmings": "david hemmings"
    },
    {
        " and ": null
    },
    {
        "Vanessa Redgrave": "vanessa redgrave"
    },
    {
        ". The second film was  Zabriskie Point  , his first set in America and with a ": null
    },
    {
        "counterculture": "counterculture of the 1960s"
    },
    {
        " theme. The soundtrack carried popular artists such as ": null
    },
    {
        "Pink Floyd": "pink floyd"
    },
    {
        " , the ": null
    },
    {
        "Grateful Dead": "grateful dead"
    },
    {
        " and the ": null
    },
    {
        "Rolling Stones": "rolling stones"
    },
    {
        ". However, its release was a critical and commercial disaster. The third,  The Passenger  , starring ": null
    },
    {
        "Jack Nicholson": "jack nicholson"
    },
    {
        " and ": null
    },
    {
        "Maria Schneider": "maria schneider"
    },
    {
        ", received critical praise, but also did poorly at the box office. It was out of circulation for many years, but was re-released for a limited theatrical run in October 42 and has subsequently been released on ": null
    },
    {
        "DVD": "dvd"
    },
    {
        ".     In 42 in between Zabriskie Point and The Passenger, Antonioni was invited by the ": null
    },
    {
        "Mao": "mao zedong"
    },
    {
        " government of the ": null
    },
    {
        "Peoples Republic of China": "china"
    },
    {
        " to visit the country. He made the documentary  Chung Kuo, Cina , but it was severely denounced by the Chinese authorities as anti-Chinese and anti-communist . The documentary had its first showing in China on 42 November 42 in ": null
    },
    {
        "Beijing": "beijing"
    },
    {
        " with a film festival hosted by the ": null
    },
    {
        "Beijing Film Academy": "beijing film academy"
    },
    {
        " to honor the works of Michelangelo Antonioni.       In 42 Antonioni made  Il mistero di Oberwald  , an experiment in the electronic treatment of color, recorded in video then transferred to film, featuring ": null
    },
    {
        "Monica Vitti": "monica vitti"
    },
    {
        " once more. It is based on ": null
    },
    {
        "Jean Cocteau": "jean cocteau"
    },
    {
        "s play  LAigle à deux têtes  .  Identificazione di una donna  , filmed in Italy, deals one more time with the recursive subjects of his Italian trilogy. In 42 Antonioni suffered a stroke, which left him partly paralyzed and unable to speak. However, he continued to make films, including  Beyond the Clouds  , for which ": null
    },
    {
        "Wim Wenders": "wim wenders"
    },
    {
        " filmed some scenes. As Wenders has explained, Antonioni rejected almost all the material filmed by Wenders during the editing, except for a few short interludes. They shared the FIPRESCI Prize at the ": null
    },
    {
        "Venice Film Festival": "venice film festival"
    },
    {
        " with  Cyclo .     In 42 he was given the Honorary ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        " in recognition of his place as one of the cinemas master visual stylists. It was presented to him by ": null
    },
    {
        "Jack Nicholson": "jack nicholson"
    },
    {
        ". Months later, the statuette was stolen by burglars and had to be replaced. Previously, he had been nominated for ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        "s for Best Director and Best Screenplay for  Blowup . Antonionis final film, made when he was in his 42s, was a segment of the ": null
    },
    {
        "anthology film": "anthology film"
    },
    {
        "  Eros  , entitled Il filo pericoloso delle cose . The short films episodes are framed by dreamy paintings and the song Michelangelo Antonioni , composed and sung by ": null
    },
    {
        "Caetano Veloso": "caetano veloso"
    },
    {
        ". However, it was not well-received internationally; in America, for example, ": null
    },
    {
        "Roger Ebert": "roger ebert"
    },
    {
        " claimed that it was neither erotic nor about eroticism. The U.S. DVD release of the film includes another 42 short film by Antonioni, Lo sguardo di Michelangelo .     Antonioni died aged 42 on 42 July 42 in Rome, the same day that another renowned film director, ": null
    },
    {
        "Ingmar Bergman": "ingmar bergman"
    },
    {
        ", also died. Antonioni lay in state at City Hall in Rome where a large screen showed black-and-white footage of him among his film sets and behind-the-scenes. He was buried in his home town of Ferrara on 42 August 42                Critic ": null
    },
    {
        "Richard Brody": "richard brody"
    },
    {
        " described Antonioni as the cinemas exemplary ": null
    },
    {
        "modernist": "modernist"
    },
    {
        " and one of its great pictorialists—his images reflect, with a cold enticement, the abstractions that fascinated him.  ": null
    },
    {
        "AllMovie": "allmovie"
    },
    {
        " stated that his films — a seminal body of enigmatic and intricate mood pieces — rejected action in favor of contemplation, championing image and design over character and story. Haunted by a sense of instability and impermanence, his work defined a cinema of possibilities. Stephen Dalton of the ": null
    },
    {
        "British Film Institute": "british film institute"
    },
    {
        " described Antonionis influential visual hallmarks as extremely ": null
    },
    {
        "long take": "long take"
    },
    {
        "s, striking modern architecture, painterly use of colour, tiny human figures adrift in empty landscapes, noting similarities to the empty urban dreamscapes of ": null
    },
    {
        "surrealist": "surrealist"
    },
    {
        " painter ": null
    },
    {
        "Giorgio de Chirico": "giorgio de chirico"
    },
    {
        ".  Film historian Virginia Wright Wexman notes the slowness of his camera and the absence of frequent cuts, stating that he forces our full attention by continuing the shot long after others would cut away.  Antonioni is also noted for exploiting colour as a significant expressive element in his later works, especially in  Il deserto rosso , his first ": null
    },
    {
        "colour film": "colour film"
    },
    {
        ".     Antonionis plots were experimental, ambiguous, and elusive, often featuring middle-class characters who suffer from ": null
    },
    {
        "ennui": "wiktionary:ennui"
    },
    {
        ", desperation, or joyless sex. Film historian ": null
    },
    {
        "David Bordwell": "david bordwell"
    },
    {
        " writes that in Antonionis films, Vacations, parties and artistic pursuits are vain efforts to conceal the characters lack of purpose and emotion. Sexuality is reduced to casual seduction, enterprise to the pursuit of wealth at any cost.   The New Yorker  wrote that Antonioni captured a new ": null
    },
    {
        "bourgeois": "bourgeois"
    },
    {
        " society that shifted from physical to intellectual creation, from matter to abstraction, from things to images, and the crisis of personal identity and self-recognition that resulted, calling his 42s collaborations with Monica Vitti a crucial moment in the creation of cinematic ": null
    },
    {
        "modernism": "modernism"
    },
    {
        ".  Richard Brody stated that his films explore the way that new methods of communication—mainly the mass media, but also the abstractions of high-tech industry, architecture, music, politics, and even fashion—have a feedback effect on the educated, white-collar thinkers who create them, but noted that he wasn’t nostalgic about the premodern.      Wexman describes Antonionis perspective on the world as that of a ": null
    },
    {
        "postreligious": "irreligion"
    },
    {
        " Marxist": "marxism"
    },
    {
        " and ": null
    },
    {
        "existentialist": "existentialist"
    },
    {
        " intellectual.  In a speech at Cannes about LAvventura, Antonioni said that in the modern age of reason and science, mankind still lives by a rigid and stereotyped ": null
    },
    {
        "morality": "morality"
    },
    {
        " which all of us recognize as such and yet sustain out of cowardice and sheer laziness We have examined those moral attitudes very carefully, we have dissected them and analyzed them to the point of exhaustion. We have been capable of all this, but we have not been capable of finding new ones. Nine years later he expressed a similar attitude in an interview, saying that he loathed the word morality: When man becomes reconciled to ": null
    },
    {
        "nature": "nature"
    },
    {
        ", when space becomes his true background, these words and concepts will have lost their meaning, and we will no longer have to use them.       Bordwell explains that Antonioni was extremely influential on subsequent ": null
    },
    {
        "art film": "art film"
    },
    {
        "s: More than any other director, he encouraged filmmakers to explore elliptical and open-ended narrative.   The Guardian  described him as, in essence, a director of extraordinary sequences, and advised viewers to forget plotting, characters or dialogue, his import is conveyed in absolutely ": null
    },
    {
        "formal": "formalism"
    },
    {
        " terms.      Film director ": null
    },
    {
        "Akira Kurosawa": "akira kurosawa"
    },
    {
        " considered Antonioni one of the most interesting filmmakers. Kurosawa, Akira: Something Like an Autobiography, p.42 Alfred A. Knopf, Inc., 42 ": null
    },
    {
        "Stanley Kubrick": "stanley kubrick"
    },
    {
        " listed La Notte as one of his ten favorite films in a 42 Poll. ": null
    },
    {
        "Miklós Jancsó": "miklós jancsó"
    },
    {
        " considers Antonioni as his master. American director ": null
    },
    {
        "Martin Scorsese": "martin scorsese"
    },
    {
        " paid tribute to Antonioni following his death in 42 stating that his films posed mysteries – or rather the mystery, of who we are, what we are, to each other, to ourselves, to time. You could say that Antonioni was looking directly at the mysteries of the soul. American directors ": null
    },
    {
        "Francis Ford Coppola": "francis ford coppola"
    },
    {
        " and ": null
    },
    {
        "Brian De Palma": "brian de palma"
    },
    {
        " paid homage to Antonioni in their own films.     Antonionis spare style and purposeless characters, however, have not received universal acclaim. ": null
    },
    {
        "Ingmar Bergman": "ingmar bergman"
    },
    {
        " stated in 42 that while he considered the Antonioni films  Blowup  and  La notte  masterpieces , he found the other films boring and noted that he had never understood why Antonioni was held in such esteem. ": null
    },
    {
        "Orson Welles": "orson welles"
    },
    {
        " regretted the Italian directors use of the ": null
    },
    {
        "long take": "long take"
    },
    {
        ": I dont like to dwell on things. Its one of the reasons Im so bored with Antonioni - the belief that, because a shot is good, its going to get better if you keep looking at it. He gives you a full shot of somebody walking down a road. And you think, Well, hes not going to carry that woman all the way up that road. But he does. And then she leaves and you go on looking at the road after shes gone.      American actor ": null
    },
    {
        "Peter Weller": "peter weller"
    },
    {
        ", whom Antonioni directed in  Beyond the Clouds , explained in a 42 interview: There is no director living except maybe ": null
    },
    {
        "Kurosawa": "akira kurosawa"
    },
    {
        ", ": null
    },
    {
        "Bergman": "ingmar bergman"
    },
    {
        ", or Antonioni that I would fall down and do anything for. I met Antonioni three years ago in ": null
    },
    {
        "Taormina": "taormina"
    },
    {
        " at a ": null
    },
    {
        "film festival": "taormina film fest"
    },
    {
        ". I introduced myself and told him that I adored his movies, his contributions to film, because he was the first guy who really started making films about the reality of the vacuity between people, the difficulty in traversing this space between lovers in modern day  ... and he never gives you an answer, Antonioni—thats the beautiful thing.       ": null
    },
    {
        "Academy Honorary Award": "67th academy awards"
    },
    {
        "   Berlin International Film Festival": "berlin international film festival"
    },
    {
        " FIPRESCI": "fipresci"
    },
    {
        " Prize   Berlin International Film Festival ": null
    },
    {
        "Golden Bear": "golden bear"
    },
    {
        " , for La Notte ": null
    },
    {
        "Bodil Award": "bodil awards"
    },
    {
        " for Best European Film , for The Passenger ": null
    },
    {
        "British Film Institute": "british film institute"
    },
    {
        " Sutherland Trophy": "sutherland trophy"
    },
    {
        " , for LAvventura ": null
    },
    {
        "Cannes Film Festival": "cannes film festival"
    },
    {
        " Jury Prize": "jury prize"
    },
    {
        " , for LAvventura Eclipse ": null
    },
    {
        "Palme dOr": "palme dor"
    },
    {
        " , for Blowup Identification of a Woman ": null
    },
    {
        "David di Donatello": "david di donatello"
    },
    {
        " Award for Best Director , for La Notte ": null
    },
    {
        "European Film Awards": "european film awards"
    },
    {
        " Life Achievement Award   ": null
    },
    {
        "Flaiano Prize": "flaiano prize"
    },
    {
        " Career Award in Cinema   ": null
    },
    {
        "French Syndicate of Cinema Critics": "french syndicate of cinema critics"
    },
    {
        " Award for Best Foreign Film , for Blowup ": null
    },
    {
        "Giffoni Film Festival": "giffoni film festival"
    },
    {
        " François Truffaut Award   Giffoni Film Festival Golden Career Gryphon   ": null
    },
    {
        "International Istanbul Film Festival": "international istanbul film festival"
    },
    {
        " Lifetime Achievement Award   ": null
    },
    {
        "Italian National Syndicate of Film Journalists": "nastro dargento"
    },
    {
        " Silver Ribbon for Best Documentary , for N.U. Lies of Love Story of a Love Affair ": null
    },
    {
        "Italian National Syndicate of Film Journalists Silver Ribbon for Best Director": "nastro dargento for best director"
    },
    {
        " , for Le Amiche ": null
    },
    {
        "Italian National Syndicate of Film Journalists Silver Ribbon for Best Director": "nastro dargento for best director"
    },
    {
        " , for La Notte Blow up ": null
    },
    {
        "Italian National Syndicate of Film Journalists Silver Ribbon for Best Director": "nastro dargento for best director"
    },
    {
        " , for The Passenger Blowup ": null
    },
    {
        "Locarno International Film Festival": "locarno international film festival"
    },
    {
        " Prize , for Il Grido ": null
    },
    {
        "Montreal World Film Festival": "montreal world film festival"
    },
    {
        " Grand Prix Special des Amériques   ": null
    },
    {
        "National Society of Film Critics": "national society of film critics"
    },
    {
        " Special Citation Award   National Society of Film Critics Award for Best Director , for Blowup ": null
    },
    {
        "Palm Springs International Film Festival": "palm springs international film festival"
    },
    {
        " Lifetime Achievement Award   Valladolid International Film Festival FIPRESCI Prize for Short Film , for Michelangelo Eye to Eye ": null
    },
    {
        "Venice Film Festival": "venice film festival"
    },
    {
        " Silver Lion": "silver lion"
    },
    {
        " , for Le Amiche Red Desert ": null
    },
    {
        "Golden Lion": "golden lion"
    },
    {
        " , for Red Desert Beyond the Clouds   Venice Film Festival Pietro Bianchi Award            Story of a Love Affair      I Vinti      The Lady Without Camelias      Le Amiche      Il Grido      LAvventura      La Notte      LEclisse      Red Desert     Blowup     Zabriskie Point     Chung Kuo, Cina     The Passenger     The Mystery of Oberwald      Identification of a Woman      Beyond the Clouds   with ": null
    },
    {
        "Wim Wenders": "wim wenders"
    },
    {
        " Gente del Po  42 minutes    N.U.   42 minutes   Oltre loblio   Roma-Montevideo    Lies of Love   42 minutes   Sette canne, un vestito  42 minutes   Bomarzo   Ragazze in bianco    Superstizione  42 minutes   La villa dei mostri  42 minutes    La funivia del Faloria   42 minutes   Tentato suicido  episode in  Lamore in città     Il provino episode in  I tre volti  Inserto girato a Lisca Bianca 42 minutes   Kumbha Mela 42 minutes   Roma  episode in 42 registi per 42 città, for the ": null
    },
    {
        "42 FIFA World Cup": "1990 fifa world cup"
    },
    {
        " Noto, Mandorli, Vulcano, Stromboli, Carnevale  42 minutes   Sicilia 42 minutes   Lo sguardo di Michelangelo  42 minutes   Il filo pericoloso delle cose  episode in  Eros ": null
    }
]