[
    {
        "                   Michael Faraday ": null
    },
    {
        "FRS": "fellow of the royal society"
    },
    {
        "  was an English ": null
    },
    {
        "scientist": "scientist"
    },
    {
        " who contributed to the study of ": null
    },
    {
        "electromagnetism": "electromagnetism"
    },
    {
        " and ": null
    },
    {
        "electrochemistry": "electrochemistry"
    },
    {
        ". His main discoveries include the principles underlying ": null
    },
    {
        "electromagnetic induction": "electromagnetic induction"
    },
    {
        ", ": null
    },
    {
        "diamagnetism": "diamagnetism"
    },
    {
        " and ": null
    },
    {
        "electrolysis": "electrolysis"
    },
    {
        ".     Although Faraday received little formal education, he was one of the most influential scientists in history. It was by his research on the ": null
    },
    {
        "magnetic field": "electromagnetic field"
    },
    {
        " around a ": null
    },
    {
        "conductor": "electrical conductor"
    },
    {
        " carrying a ": null
    },
    {
        "direct current": "direct current"
    },
    {
        " that Faraday established the basis for the concept of the ": null
    },
    {
        "electromagnetic field": "electromagnetic field"
    },
    {
        " in physics. Faraday also established that ": null
    },
    {
        "magnetism": "magnetism"
    },
    {
        " could affect ": null
    },
    {
        "rays of light": "ray"
    },
    {
        " and that there was an underlying relationship between the two phenomena. . the 1911 Encyclopædia Britannica.  He similarly discovered the principles of electromagnetic induction and diamagnetism, and the ": null
    },
    {
        "laws of electrolysis": "faradays laws of electrolysis"
    },
    {
        ". His ": null
    },
    {
        "inventions": "invention"
    },
    {
        "of ": null
    },
    {
        "electromagnetic rotary devices": "electric motor"
    },
    {
        " formed the foundation of electric motor technology, and it was largely due to his efforts that ": null
    },
    {
        "electricity": "electricity"
    },
    {
        " became practical for use in technology.     As a chemist, Faraday discovered ": null
    },
    {
        "benzene": "benzene"
    },
    {
        ", investigated the ": null
    },
    {
        "clathrate hydrate": "clathrate hydrate"
    },
    {
        " of chlorine, invented an early form of the ": null
    },
    {
        "Bunsen burner": "bunsen burner"
    },
    {
        " and the system of ": null
    },
    {
        "oxidation number": "oxidation number"
    },
    {
        "s, and popularised terminology such as ": null
    },
    {
        "anode": "anode"
    },
    {
        " , ": null
    },
    {
        "cathode": "cathode"
    },
    {
        " , ": null
    },
    {
        "electrode": "electrode"
    },
    {
        " and ": null
    },
    {
        "ion": "ion"
    },
    {
        " . Faraday ultimately became the first and foremost ": null
    },
    {
        "Fullerian Professor of Chemistry": "fullerian professor of chemistry"
    },
    {
        " at the ": null
    },
    {
        "Royal Institution": "royal institution"
    },
    {
        ", a lifetime position.     Faraday was an excellent experimentalist who conveyed his ideas in clear and simple language; his mathematical abilities, however, did not extend as far as ": null
    },
    {
        "trigonometry": "trigonometry"
    },
    {
        " and were limited to the simplest algebra. ": null
    },
    {
        "James Clerk Maxwell": "james clerk maxwell"
    },
    {
        " took the work of Faraday and others and summarized it in a set of equations which is accepted as the basis of all modern theories of electromagnetic phenomena. On Faradays uses of ": null
    },
    {
        "lines of force": "lines of force"
    },
    {
        ", Maxwell wrote that they show Faraday to have been in reality a mathematician of a very high order – one from whom the mathematicians of the future may derive valuable and fertile methods.  p. 360; Courier Dover 2003,  The ": null
    },
    {
        "SI": "international system of units"
    },
    {
        " unit of ": null
    },
    {
        "capacitance": "capacitance"
    },
    {
        " is named in his honour: the ": null
    },
    {
        "farad": "farad"
    },
    {
        ".     ": null
    },
    {
        "Albert Einstein": "albert einstein"
    },
    {
        " kept a picture of Faraday on his study wall, alongside pictures of ": null
    },
    {
        "Isaac Newton": "isaac newton"
    },
    {
        " and James Clerk Maxwell.  Physicist ": null
    },
    {
        "Ernest Rutherford": "ernest rutherford"
    },
    {
        " stated, When we consider the magnitude and extent of his discoveries and their influence on the progress of science and of industry, there is no honour too great to pay to the memory of Faraday, one of the greatest scientific discoverers of all time. ": null
    },
    {
        "Rao, C.N.R.": "c.n.r. rao"
    },
    {
        " . Understanding Chemistry. Universities Press. . p. 281.              Michael Faraday was born on 22 September 1791 in ": null
    },
    {
        "Newington Butts": "newington butts"
    },
    {
        ", which is now part of the ": null
    },
    {
        "London Borough of Southwark": "london borough of southwark"
    },
    {
        " but was then a suburban part of ": null
    },
    {
        "Surrey": "surrey"
    },
    {
        ". For a concise account of Faradays life including his childhood, see pp. 175–183 of  Every Saturday : A Journal of Choice Reading, Vol III published at Cambridge in 1873 by ": null
    },
    {
        "Osgood & Co.": "james r. osgood"
    },
    {
        " His family was not well off. His father, James, was a member of the ": null
    },
    {
        "Glassite": "glasite"
    },
    {
        " sect of Christianity. James Faraday moved his wife and two children to London during the winter of 1790 from ": null
    },
    {
        "Outhgill": "outhgill"
    },
    {
        " in ": null
    },
    {
        "Westmorland": "westmorland"
    },
    {
        ", where he had been an apprentice to the village blacksmith. The implication is that James discovered job opportunities elsewhere through membership of this sect. James joined the London meeting house on 20 February 1791, and moved his family shortly thereafter. See ": null
    },
    {
        "Cantor": "cantor"
    },
    {
        ", pp. 57–58. Michael was born in the autumn of that year. The young Michael Faraday, who was the third of four children, having only the most basic school education, had to ": null
    },
    {
        "educate himself": "autodidacticism"
    },
    {
        ". Michael Faraday. History of Science and Technology. Houghton Mifflin Company, 2004.      At the age of 14 he became an apprentice to ": null
    },
    {
        "George Riebau": "george riebau"
    },
    {
        ", a local bookbinder and bookseller in Blandford Street.  During his seven-year apprenticeship Faraday read many books, including ": null
    },
    {
        "Isaac Wattss": "isaac watts"
    },
    {
        " The Improvement of the Mind, and he enthusiastically implemented the principles and suggestions contained therein.  He also developed an interest in science, especially in electricity. Faraday was particularly inspired by the book Conversations on Chemistry by ": null
    },
    {
        "Jane Marcet": "jane marcet"
    },
    {
        ".            In 1812, at the age of 20 and at the end of his apprenticeship, Faraday attended lectures by the eminent English chemist ": null
    },
    {
        "Humphry Davy": "humphry davy"
    },
    {
        " of the ": null
    },
    {
        "Royal Institution": "royal institution"
    },
    {
        " and the ": null
    },
    {
        "Royal Society": "royal society"
    },
    {
        ", and ": null
    },
    {
        "John Tatum": "john tatum"
    },
    {
        ", founder of the City Philosophical Society. Many of the tickets for these lectures were given to Faraday by ": null
    },
    {
        "William Dance": "william dance"
    },
    {
        ", who was one of the founders of the ": null
    },
    {
        "Royal Philharmonic Society": "royal philharmonic society"
    },
    {
        ". Faraday subsequently sent Davy a 300-page book based on notes that he had taken during these lectures. Davys reply was immediate, kind, and favourable. In 1813, when Davy damaged his eyesight in an accident with ": null
    },
    {
        "nitrogen trichloride": "nitrogen trichloride"
    },
    {
        ", he decided to employ Faraday as an assistant. Coincidentally one of the Royal Institutions assistants, John Payne, was sacked and Sir Humphry Davy had been asked to find a replacement; thus he appointed Faraday as Chemical Assistant at the Royal Institution on 1 March 1813. Very soon Davy entrusted Faraday with the preparation of nitrogen trichloride samples, and they both were injured in an explosion of this very sensitive substance. ": null
    },
    {
        "Thomas": "thomas"
    },
    {
        ", p. 17        In the class-based English society of the time, Faraday was not considered a ": null
    },
    {
        "gentleman": "gentleman"
    },
    {
        ". When Davy set out on a long tour of the continent in 1813–15, his ": null
    },
    {
        "valet": "valet"
    },
    {
        " did not wish to go, so instead, Faraday went as Davys scientific assistant and was asked to act as Davys valet until a replacement could be found in Paris. Faraday was forced to fill the role of valet as well as assistant throughout the trip. Davys wife, Jane Apreece, refused to treat Faraday as an equal , and made Faraday so miserable that he contemplated returning to England alone and giving up science altogether. The trip did, however, give him access to the scientific elite of Europe and exposed him to a host of stimulating ideas.     Faraday married Sarah Barnard on 12 June 1821. The register at St. Faith-in-the-Virgin near ": null
    },
    {
        "St. Pauls Cathedral": "st. pauls cathedral"
    },
    {
        ", records 12 June as the date their licence was issued. The witness was Sarahs father, Edward. Their marriage was 16 years prior to the Marriage and Registration Act of 1837. See ": null
    },
    {
        "Cantor": "cantor"
    },
    {
        ", p. 59. They met through their families at the ": null
    },
    {
        "Sandemanian": "sandemanian"
    },
    {
        " church, and he confessed his faith to the Sandemanian congregation the month after they were married. They had no children.      Faraday was a devout Christian; his Sandemanian denomination was an offshoot of the ": null
    },
    {
        "Church of Scotland": "church of scotland"
    },
    {
        ". Well after his marriage, he served as ": null
    },
    {
        "deacon": "deacon"
    },
    {
        " and for two terms as an ": null
    },
    {
        "elder": "elder"
    },
    {
        " in the meeting house of his youth. His church was located at Pauls Alley in the ": null
    },
    {
        "Barbican": "barbican estate"
    },
    {
        ". This meeting house relocated in 1862 to ": null
    },
    {
        "Barnsbury": "barnsbury"
    },
    {
        " Grove, ": null
    },
    {
        "Islington": "london borough of islington"
    },
    {
        "; this North London location was where Faraday served the final two years of his second term as elder prior to his resignation from that post. ": null
    },
    {
        "Cantor": "cantor"
    },
    {
        ", pp. 41–43, 60–64, and 277–280. Pauls Alley was located 10 houses south of the ": null
    },
    {
        "Barbican": "barbican estate"
    },
    {
        ". See p. 330 ": null
    },
    {
        "Elmess": "james elmes"
    },
    {
        " Topographical Dictionary of the British Metropolis. Biographers have noted that a strong sense of the unity of God and nature pervaded Faradays life and work.           In June 1832, the ": null
    },
    {
        "University of Oxford": "university of oxford"
    },
    {
        " granted Faraday an honorary ": null
    },
    {
        "Doctor of Civil Law": "doctor of civil law"
    },
    {
        " degree . During his lifetime, he was offered a ": null
    },
    {
        "knighthood": "orders, decorations, and medals of the united kingdom"
    },
    {
        " in recognition for his services to science, which he ": null
    },
    {
        "turned down": "list of people who have declined a british honour"
    },
    {
        " on religious grounds, believing that it was against the word of the Bible to accumulate riches and pursue worldly reward, and stating that he preferred to remain plain Mr Faraday to the end . West, Krista . The Basics of Metals and Metalloids. Rosen Publishing Group. . p. 81. Elected a member of the ": null
    },
    {
        "Royal Society": "royal society"
    },
    {
        " in 1824, he twice refused to become ": null
    },
    {
        "President": "president of the royal society"
    },
    {
        ". Todd Timmons . Makers of Western Science: The Works and Words of 24 Visionaries from Copernicus to Watson and Crick . p. 127. He became the first ": null
    },
    {
        "Fullerian Professor of Chemistry": "fullerian professor of chemistry"
    },
    {
        " at the ": null
    },
    {
        "Royal Institution": "royal institution"
    },
    {
        " in 1833.      In 1832, Faraday was elected a Foreign Honorary Member of the ": null
    },
    {
        "American Academy of Arts and Sciences": "american academy of arts and sciences"
    },
    {
        ".  He was elected a foreign member of the ": null
    },
    {
        "Royal Swedish Academy of Sciences": "royal swedish academy of sciences"
    },
    {
        " in 1838, and was one of eight foreign members elected to the ": null
    },
    {
        "French Academy of Sciences": "french academy of sciences"
    },
    {
        " in 1844.  In 1849 he was elected as associated member to the Royal Institute of the Netherlands, which two years later became the ": null
    },
    {
        "Royal Netherlands Academy of Arts and Sciences": "royal netherlands academy of arts and sciences"
    },
    {
        " and he was subsequently made foreign member.       Faraday suffered a nervous breakdown in 1839 but eventually returned to his investigations into electromagnetism. Bowden, Mary Ellen . Chemical Achievers: The Human Face of the Chemical Sciences. Chemical Heritage Foundation. . p. 30. In 1848, as a result of representations by the ": null
    },
    {
        "Prince Consort": "albert, prince consort"
    },
    {
        ", Faraday was awarded a ": null
    },
    {
        "grace and favour": "grace and favour"
    },
    {
        " house in ": null
    },
    {
        "Hampton Court": "hampton court"
    },
    {
        " in Middlesex, free of all expenses and upkeep. This was the Master Masons House, later called Faraday House, and now No. 37 Hampton Court Road. In 1858 Faraday retired to live there. ; accessed 14 August 2014.     Having provided a number of various service projects for the British government, when asked by the government to advise on the production of chemical weapons for use in the ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        " , Faraday refused to participate citing ethical reasons.      Faraday died at his house at ": null
    },
    {
        "Hampton Court": "hampton court"
    },
    {
        " on 25 August 1867, aged 75.  He had some years before turned down an offer of burial in ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        " upon his death, but he has a memorial plaque there, near ": null
    },
    {
        "Isaac Newtons": "isaac newton"
    },
    {
        "tomb. Faraday was interred in the ": null
    },
    {
        "dissenters": "dissenters"
    },
    {
        "  section of ": null
    },
    {
        "Highgate Cemetery": "highgate cemetery"
    },
    {
        ".            Faradays earliest chemical work was as an assistant to ": null
    },
    {
        "Humphry Davy": "humphry davy"
    },
    {
        ". Faraday was specifically involved in the study of ": null
    },
    {
        "chlorine": "chlorine"
    },
    {
        "; he discovered two new compounds of chlorine and ": null
    },
    {
        "carbon": "carbon"
    },
    {
        ". He also conducted the first rough experiments on the diffusion of gases, a phenomenon that was first pointed out by ": null
    },
    {
        "John Dalton": "john dalton"
    },
    {
        ". The physical importance of this phenomenon was more fully revealed by ": null
    },
    {
        "Thomas Graham": "thomas graham"
    },
    {
        " and ": null
    },
    {
        "Joseph Loschmidt": "joseph loschmidt"
    },
    {
        ". Faraday succeeded in liquefying several gases, investigated the alloys of steel, and produced several new kinds of glass intended for optical purposes. A specimen of one of these heavy glasses subsequently became historically important; when the glass was placed in a magnetic field Faraday determined the rotation of the plane of polarisation of light. This specimen was also the first substance found to be repelled by the poles of a magnet.     Faraday invented an early form of what was to become the ": null
    },
    {
        "Bunsen burner": "bunsen burner"
    },
    {
        ", which is in practical use in science laboratories around the world as a convenient source of heat.  ": null
    },
    {
        "Faraday ": "faraday1827"
    },
    {
        ", p. 127.   Faraday worked extensively in the field of chemistry, discovering chemical substances such as ": null
    },
    {
        "benzene": "benzene"
    },
    {
        " and liquefying gases such as chlorine. The liquefying of gases helped to establish that gases are the vapours of liquids possessing a very low boiling point and gave a more solid basis to the concept of molecular aggregation. In 1820 Faraday reported the first synthesis of compounds made from carbon and chlorine, ": null
    },
    {
        "C 2 Cl 6 ": "hexachloroethane"
    },
    {
        " and ": null
    },
    {
        "C 2 Cl 4 ": "tetrachloroethylene"
    },
    {
        ", and published his results the following year.    Faraday also determined the composition of the chlorine ": null
    },
    {
        "clathrate hydrate": "clathrate hydrate"
    },
    {
        ", which had been discovered by Humphry Davy in 1810.   Faraday is also responsible for discovering the ": null
    },
    {
        "laws of electrolysis": "faradays laws of electrolysis"
    },
    {
        ", and for popularizing terminology such as ": null
    },
    {
        "anode": "anode"
    },
    {
        ", ": null
    },
    {
        "cathode": "cathode"
    },
    {
        ", ": null
    },
    {
        "electrode": "electrode"
    },
    {
        ", and ": null
    },
    {
        "ion": "ion"
    },
    {
        ", terms proposed in large part by ": null
    },
    {
        "William Whewell": "william whewell"
    },
    {
        ".      Faraday was the first to report what later came to be called metallic ": null
    },
    {
        "nanoparticles": "nanoparticles"
    },
    {
        ". In 1847 he discovered that the optical properties of gold ": null
    },
    {
        "colloids": "colloid"
    },
    {
        "differed from those of the corresponding bulk metal. This was probably the first reported observation of the effects of ": null
    },
    {
        "quantum": "quantum"
    },
    {
        " size, and might be considered to be the birth of ": null
    },
    {
        "nanoscience": "nanoscience"
    },
    {
        ".        Faraday is best known for his work regarding electricity and magnetism. His first recorded experiment was the construction of a ": null
    },
    {
        "voltaic pile": "voltaic pile"
    },
    {
        " with seven ": null
    },
    {
        "hapenny": "halfpenny"
    },
    {
        " coins, stacked together with seven disks of sheet zinc, and six pieces of paper moistened with salt water. With this pile he decomposed ": null
    },
    {
        "sulfate of magnesia": "magnesium sulfate"
    },
    {
        " .      In 1821, soon after the Danish physicist and chemist ": null
    },
    {
        "Hans Christian Ørsted": "hans christian ørsted"
    },
    {
        " discovered the phenomenon of ": null
    },
    {
        "electromagnetism": "electromagnetism"
    },
    {
        ", Davy and British scientist ": null
    },
    {
        "William Hyde Wollaston": "william hyde wollaston"
    },
    {
        " tried, but failed, to design an ": null
    },
    {
        "electric motor": "electric motor"
    },
    {
        ". Faraday, having discussed the problem with the two men, went on to build two devices to produce what he called electromagnetic rotation . One of these, now known as the ": null
    },
    {
        "homopolar motor": "homopolar motor"
    },
    {
        ", caused a continuous circular motion that was engendered by the circular magnetic force around a wire that extended into a pool of ": null
    },
    {
        "mercury": "mercury"
    },
    {
        " wherein was placed a magnet; the wire would then rotate around the magnet if supplied with current from a chemical battery. These experiments and inventions formed the foundation of modern electromagnetic technology. In his excitement, Faraday published results without acknowledging his work with either Wollaston or Davy. The resulting controversy within the ": null
    },
    {
        "Royal Society": "royal society"
    },
    {
        " strained his mentor relationship with Davy and may well have contributed to Faradays assignment to other activities, which consequently prevented his involvement in electromagnetic research for several years. ": null
    },
    {
        "Hamilton": "hamilton"
    },
    {
        ", pp. 165–171, 183, 187–190. ": null
    },
    {
        "Cantor": "cantor"
    },
    {
        ", pp. 231–233.      From his initial discovery in 1821, Faraday continued his laboratory work, exploring electromagnetic properties of materials and developing requisite experience. In 1824, Faraday briefly set up a circuit to study whether a magnetic field could regulate the flow of a current in an adjacent wire, but he found no such relationship. ": null
    },
    {
        "Thompson": "thompson"
    },
    {
        ", p. 95. This experiment followed similar work conducted with light and magnets three years earlier that yielded identical results. ": null
    },
    {
        "Thompson": "thompson"
    },
    {
        ", p. 91. This lab entry illustrates Faradays quest for the connection between light and electromagnetic phenomenon 10 September 1821. ": null
    },
    {
        "Cantor": "cantor"
    },
    {
        ", p. 233. During the next seven years, Faraday spent much of his time perfecting his recipe for optical quality glass, borosilicate of lead, ": null
    },
    {
        "Thompson": "thompson"
    },
    {
        ", pp. 95–98. which he used in his future studies connecting light with magnetism. ": null
    },
    {
        "Thompson": "thompson"
    },
    {
        ", p. 100. In his spare time, Faraday continued publishing his experimental work on optics and electromagnetism; he conducted correspondence with scientists whom he had met on his journeys across Europe with Davy, and who were also working on electromagnetism. Faradays initial induction lab work occurred in late November 1825. His work was heavily influenced by the ongoing research of fellow European scientists Ampere, Arago, and Oersted as indicated by his diary entries. ": null
    },
    {
        "Cantor": "cantor"
    },
    {
        ", pp. 235–244. Two years after the death of Davy, in 1831, he began his great series of experiments in which he discovered ": null
    },
    {
        "electromagnetic induction": "electromagnetic induction"
    },
    {
        ", recording in his laboratory diary on 28 October 1831 he was; making many experiments with the great magnet of the Royal Society . Gooding, David; Pinch, Trevor; Schaffer, Simon . The Uses of Experiment: Studies in the Natural Sciences. Cambridge University Press. . p. 212.           Faradays breakthrough came when he wrapped two insulated coils of wire around an iron ring, and found that upon passing a current through one coil, a momentary current was induced in the other coil. This phenomenon is now known as ": null
    },
    {
        "mutual induction": "mutual induction"
    },
    {
        ". Van Valkenburgh . Basic Electricity. Cengage Learning. . pp.  4–91. The iron ring-coil apparatus is still on display at the Royal Institution. In subsequent experiments, he found that if he moved a magnet through a loop of wire an electric current flowed in that wire. The current also flowed if the loop was moved over a stationary magnet. His demonstrations established that a changing magnetic field produces an electric field; this relation was modelled mathematically by ": null
    },
    {
        "James Clerk Maxwell": "james clerk maxwell"
    },
    {
        " as ": null
    },
    {
        "Faradays law": "faradays law of induction"
    },
    {
        ", which subsequently became one of the four ": null
    },
    {
        "Maxwell equations": "maxwells equations"
    },
    {
        ", and which have in turn evolved into the generalization known today as ": null
    },
    {
        "field theory": "field theory"
    },
    {
        ". Faraday would later use the principles he had discovered to construct the electric ": null
    },
    {
        "dynamo": "electrical generatordynamo"
    },
    {
        ", the ancestor of modern power generators and the electric motor.       In 1832, he completed a series of experiments aimed at investigating the fundamental nature of electricity; Faraday used ": null
    },
    {
        "static": "electrostatics"
    },
    {
        " , ": null
    },
    {
        "batteries": "battery"
    },
    {
        ", and ": null
    },
    {
        "animal electricity": "bioelectromagnetism"
    },
    {
        " to produce the phenomena of electrostatic attraction, ": null
    },
    {
        "electrolysis": "electrolysis"
    },
    {
        ", ": null
    },
    {
        "magnetism": "electromagnetism"
    },
    {
        ", etc. He concluded that, contrary to the scientific opinion of the time, the divisions between the various kinds of electricity were illusory. Faraday instead proposed that only a single electricity exists, and the changing values of quantity and intensity would produce different groups of phenomena.     Near the end of his career, Faraday proposed that electromagnetic forces extended into the empty space around the conductor.  This idea was rejected by his fellow scientists, and Faraday did not live to see the eventual acceptance of his proposition by the scientific community. Faradays concept of lines of flux emanating from charged bodies and magnets provided a way to visualize electric and magnetic fields; that conceptual model was crucial for the successful development of the electromechanical devices that dominated engineering and industry for the remainder of the 19th century.          In 1845, Faraday discovered that many materials exhibit a weak repulsion from a magnetic field: a phenomenon he termed ": null
    },
    {
        "diamagnetism": "diamagnetism"
    },
    {
        ". James, Frank A.J.L . Michael Faraday: A Very Short Introduction. Oxford University Press. . p. 81.     Faraday also discovered that the plane of ": null
    },
    {
        "polarization": "polarization"
    },
    {
        " of linearly polarized light can be rotated by the application of an external magnetic field aligned with the direction in which the light is moving. This is now termed the ": null
    },
    {
        "Faraday effect": "faraday effect"
    },
    {
        ". In Sept 1845 he wrote in his notebook, I have at last succeeded in illuminating a magnetic curve or  line of force  and in magnetising a ray of light  . Day, Peter . The Philosophers Tree: A Selection of Michael Faradays Writings. CRC Press. . p. 125.     Later on in his life, in 1862, Faraday used a spectroscope to search for a different alteration of light, the change of spectral lines by an applied magnetic field. The equipment available to him was, however, insufficient for a definite determination of spectral change. ": null
    },
    {
        "Pieter Zeeman": "pieter zeeman"
    },
    {
        " later used an improved apparatus to study the same phenomenon, publishing his results in 1897 and receiving the 1902 Nobel Prize in Physics for his success. In both his 1897 paper  and his Nobel acceptance speech,  Zeeman made reference to Faradays work.       In his work on static electricity, ": null
    },
    {
        "Faradays ice pail experiment": "faradays ice pail experiment"
    },
    {
        " demonstrated that the charge resided only on the exterior of a charged conductor, and exterior charge had no influence on anything enclosed within a conductor. This is because the exterior charges redistribute such that the interior fields emanating from them cancel one another. This shielding effect is used in what is now known as a ": null
    },
    {
        "Faraday cage": "faraday cage"
    },
    {
        ".            Faraday had a long association with the ": null
    },
    {
        "Royal Institution of Great Britain": "royal institution of great britain"
    },
    {
        ". He was appointed Assistant Superintendent of the House of the Royal Institution in 1821.  He was elected a member of the ": null
    },
    {
        "Royal Society": "royal society"
    },
    {
        " in 1824. In 1825, he became Director of the Laboratory of the Royal Institution. Six years later, in 1833, Faraday became the first ": null
    },
    {
        "Fullerian Professor of Chemistry": "fullerian professor of chemistry"
    },
    {
        " at the ": null
    },
    {
        "Royal Institution of Great Britain": "royal institution of great britain"
    },
    {
        ", a position to which he was appointed for life without the obligation to deliver lectures. His sponsor and mentor was ": null
    },
    {
        "John Mad Jack Fuller": "john mad jack fuller"
    },
    {
        ", who created the position at the Royal Institution for Faraday.      Beyond his scientific research into areas such as chemistry, electricity, and magnetism at the ": null
    },
    {
        "Royal Institution": "royal institution"
    },
    {
        ", Faraday undertook numerous, and often time-consuming, service projects for private enterprise and the British government. This work included investigations of explosions in coal mines, being an ": null
    },
    {
        "expert witness": "expert witness"
    },
    {
        " in court, and along with two engineers from ": null
    },
    {
        "Chance Brothers": "chance brothers"
    },
    {
        " c.1853, the preparation of high-quality optical glass, which was required by Chance for its lighthouses. In 1846, together with ": null
    },
    {
        "Charles Lyell": "charles lyell"
    },
    {
        ", he produced a lengthy and detailed report on a serious ": null
    },
    {
        "explosion": "explosion"
    },
    {
        " in the colliery at ": null
    },
    {
        "Haswell, County Durham": "haswell, county durham"
    },
    {
        ", which killed 95 miners. Their report was a meticulous ": null
    },
    {
        "forensic investigation": "forensic investigation"
    },
    {
        " and indicated that ": null
    },
    {
        "coal dust": "coal dust"
    },
    {
        " contributed to the severity of the explosion. The report should have warned coal owners of the hazard of coal dust explosions, but the risk was ignored for over 60 years until the ": null
    },
    {
        "Senghenydd Colliery Disaster": "senghenydd colliery disaster"
    },
    {
        " of 1913.      As a respected scientist in a nation with strong maritime interests, Faraday spent extensive amounts of time on projects such as the construction and operation of ": null
    },
    {
        "lighthouses": "lighthouse"
    },
    {
        "and protecting the bottoms of ships from ": null
    },
    {
        "corrosion": "corrosion"
    },
    {
        ". His workshop still stands at ": null
    },
    {
        "Trinity Buoy Wharf": "trinity buoy wharf"
    },
    {
        " above the Chain and Buoy Store, next to Londons only lighthouse where he carried out the first experiments in electric lighting for lighthouses. Smith, Denis . London and the Thames Valley. Thomas Telford. . p. 236.     Faraday was also active in what would now be called ": null
    },
    {
        "environmental science": "environmental science"
    },
    {
        ", or engineering. He investigated industrial pollution at ": null
    },
    {
        "Swansea": "swansea"
    },
    {
        " and was consulted on air pollution at the ": null
    },
    {
        "Royal Mint": "royal mint"
    },
    {
        ". In July 1855, Faraday wrote a letter to  The Times  on the subject of the foul condition of the ": null
    },
    {
        "River Thames": "river thames"
    },
    {
        ", which resulted in an often-reprinted cartoon in  Punch . . Faraday, Michael . The State of the Thames . The Times. p. 8.      Faraday assisted with the planning and judging of exhibits for the ": null
    },
    {
        "Great Exhibition": "great exhibition"
    },
    {
        " of 1851 in London. He also advised the ": null
    },
    {
        "National Gallery": "national gallery, london"
    },
    {
        " on the cleaning and protection of its art collection, and served on the National Gallery Site Commission in 1857.  ": null
    },
    {
        "Thomas": "thomas"
    },
    {
        ", p. 83 Education was another of Faradays areas of service; he lectured on the topic in 1854 at the Royal Institution,  and in 1862 he appeared before a Public Schools Commission to give his views on education in Great Britain. Faraday also weighed in negatively on the publics fascination with ": null
    },
    {
        "table-turning": "table-turning"
    },
    {
        ", See  The Illustrated London News , 2 July 1853,  for Faradays comments.  ": null
    },
    {
        "mesmerism": "mesmerism"
    },
    {
        ", and ": null
    },
    {
        "seance": "seance"
    },
    {
        "s, and in so doing chastised both the public and the nations educational system.         Before his famous Christmas lectures, Faraday delivered chemistry lectures for the City Philosophical Society from 1816 to 1818 in order to refine the quality of his lectures.  Between 1827 and 1860 at the ": null
    },
    {
        "Royal Institution": "royal institution"
    },
    {
        " in London, Faraday gave a series of nineteen ": null
    },
    {
        "Christmas lectures": "royal institution christmas lectures"
    },
    {
        " for young people, a series which continues today. The objective of Faradays Christmas lectures was to present science to the general public in the hopes of inspiring them and generating revenue for the Royal Institution. They were notable events on the social calendar among Londons gentry. Over the course of several letters to his close friend Benjamin Abbott, Faraday outlined his recommendations on the art of lecturing: Faraday wrote a flame should be lighted at the commencement and kept alive with unremitting splendour to the end . Hirshfeld, Alan . The Electric Life of Michael Faraday. New York: Walker & Company.  His lectures were joyful and juvenile, he delighted in filling soap bubbles with various gasses in front of his audiences and marveled at the rich colors of polarized lights, but the lectures were also deeply philosophical. In his lectures he urged his audiences to consider the mechanics of his experiments: you know very well that ice floats upon water  ... Why does the ice float? Think of that, and philosophise .  His subjects consisted of Chemistry and Electricity, and included: 1841 The Rudiments of Chemistry, 1843 First Principles of Electricity, 1848 ": null
    },
    {
        "The Chemical History of a Candle": "the chemical history of a candle"
    },
    {
        ", 1851 Attractive Forces, 1853 Voltaic Electricity, 1854 The Chemistry of Combustion, 1855 The Distinctive Properties of the Common Metals, 1857 Static Electricity, 1858 The Metallic Properties, 1859 The Various Forces of Matter and their Relations to Each Other.                A statue of Faraday stands in ": null
    },
    {
        "Savoy Place": "savoy place"
    },
    {
        ", London, outside the ": null
    },
    {
        "Institution of Engineering and Technology": "institution of engineering and technology"
    },
    {
        ". The ": null
    },
    {
        "Michael Faraday Memorial": "michael faraday memorial"
    },
    {
        ", designed by ": null
    },
    {
        "brutalist": "brutalist"
    },
    {
        " architect ": null
    },
    {
        "Rodney Gordon": "rodney gordon"
    },
    {
        " and completed in 1961, is at the ": null
    },
    {
        "Elephant & Castle": "elephant  &  castle"
    },
    {
        " gyratory system, near Faradays birthplace at ": null
    },
    {
        "Newington Butts": "newington butts"
    },
    {
        ", London. Faraday School is located on ": null
    },
    {
        "Trinity Buoy Wharf": "trinity buoy wharf"
    },
    {
        " where his workshop still stands above the Chain and Buoy Store, next to Londons only lighthouse. Fisher, Stuart . Rivers of Britain: Estuaries, tideways, havens, lochs, firths and kyles. ": null
    },
    {
        "A & C Black": "a & c black"
    },
    {
        ". . p. 231. Faraday Gardens is a small park in ": null
    },
    {
        "Walworth": "walworth"
    },
    {
        ", London, not far from his birthplace at Newington Butts. It lies within the local council ward of Faraday in the ": null
    },
    {
        "London Borough of Southwark": "london borough of southwark"
    },
    {
        ". Michael Faraday Primary school is situated on the ": null
    },
    {
        "Aylesbury Estate": "aylesbury estate"
    },
    {
        " in ": null
    },
    {
        "Walworth": "walworth"
    },
    {
        ".  . michaelfaradayschool.co.uk     A building at ": null
    },
    {
        "London South Bank University": "london south bank university"
    },
    {
        ", which houses the institutes electrical engineering departments is named the Faraday Wing, due to its proximity to Faradays birthplace in ": null
    },
    {
        "Newington Butts": "newington butts"
    },
    {
        ". A hall at ": null
    },
    {
        "Loughborough University": "loughborough university"
    },
    {
        " was named after Faraday in 1960. Near the entrance to its dining hall is a bronze casting, which depicts the symbol of an electrical ": null
    },
    {
        "transformer": "transformer"
    },
    {
        ", and inside there hangs a portrait, both in Faradays honour. An eight-story building at the ": null
    },
    {
        "University of Edinburghs": "university of edinburgh"
    },
    {
        "science & engineering campus is named for Faraday, as is a recently built hall of accommodation at ": null
    },
    {
        "Brunel University": "brunel university"
    },
    {
        ", the main engineering building at ": null
    },
    {
        "Swansea University": "swansea university"
    },
    {
        ", and the instructional and experimental physics building at ": null
    },
    {
        "Northern Illinois University": "northern illinois university"
    },
    {
        ". The former UK Faraday Station in ": null
    },
    {
        "Antarctica": "antarctica"
    },
    {
        " was named after him. . antarctica.ac.uk        Streets named for Faraday can be found in many British cities  as well as in France , Germany , Canada , and the United States .        A ": null
    },
    {
        "Royal Society of Arts": "royal society of arts"
    },
    {
        " blue plaque": "blue plaque"
    },
    {
        ", unveiled in 1876, commemorates Faraday at 48 Blandford Street in Londons Marylebone district.  From 1991 until 2001, Faradays picture featured on the reverse of Series E £20 ": null
    },
    {
        "banknotes": "banknotes of the pound sterling"
    },
    {
        " issued by the ": null
    },
    {
        "Bank of England": "bank of england note issues"
    },
    {
        ". He was portrayed conducting a lecture at the Royal Institution with the magneto-electric spark apparatus.  In 2002, Faraday was ranked number 22 in the ": null
    },
    {
        "BBCs": "bbc"
    },
    {
        "list of the ": null
    },
    {
        "100 Greatest Britons": "100 greatest britons"
    },
    {
        " following a UK-wide vote.      The ": null
    },
    {
        "Faraday Institute for Science and Religion": "faraday institute for science and religion"
    },
    {
        " derives its name from the scientist, who saw his faith as integral to his scientific research. The logo of the Institute is also based on Faradays discoveries. It was created in 2006 by a $2,000,000 ": null
    },
    {
        "grant": "grant"
    },
    {
        " from the ": null
    },
    {
        "John Templeton Foundation": "john templeton foundation"
    },
    {
        " to carry out academic research, to foster understanding of the interaction between science and religion, and to engage public understanding in both these subject areas.   , Faraday Institute     Faradays life and contributions to electromagnetics was the principal topic of the tenth episode, titled ": null
    },
    {
        "The Electric Boy": "the electric boy"
    },
    {
        " , of the 2014 American science documentary series,  Cosmos: A Spacetime Odyssey , which was broadcast on ": null
    },
    {
        "Fox": "fox broadcasting company"
    },
    {
        " and the ": null
    },
    {
        "National Geographic Channel": "national geographic channel"
    },
    {
        ".      ": null
    },
    {
        "Aldous Huxley": "aldous huxley"
    },
    {
        ", the literary giant who was also the grandson of ": null
    },
    {
        "T. H. Huxley": "t. h. huxley"
    },
    {
        ", the grandnephew of ": null
    },
    {
        "Matthew Arnold": "matthew arnold"
    },
    {
        ", the brother of ": null
    },
    {
        "Julian Huxley": "julian huxley"
    },
    {
        ", and the half-brother of ": null
    },
    {
        "Andrew Huxley": "andrew huxley"
    },
    {
        ", was well-versed in science. He wrote about Faraday in an essay entitled, A Night in Pietramala: “He is always the natural philosopher. To discover truth is his sole aim and interest…even if I could be Shakespeare, I think I should still choose to be Faraday.”        In honor and remembrance of his great scientific contributions, several institutions have created prizes and awards in his name. This include:   The ": null
    },
    {
        "IET": "institution of engineering and technology"
    },
    {
        " Faraday Medal": "faraday medal"
    },
    {
        " Royal Society of London Michael Faraday Prize": "royal society of london michael faraday prize"
    },
    {
        "    The Institute of Physics ": null
    },
    {
        "Michael Faraday Medal and Prize": "michael faraday medal and prize"
    },
    {
        "    The Royal Society of Chemistry Faraday Lectureship Prize  ": null
    },
    {
        "Harriet Jane Moore": "harriet jane moore"
    },
    {
        " who documented Faradays life in watercolours.               Faradays books, with the exception of Chemical Manipulation, were collections of scientific papers or transcriptions of lectures. ": null
    },
    {
        "Hamilton": "hamilton"
    },
    {
        ", p. 220 Since his death, Faradays diary has been published, as have several large volumes of his letters and Faradays journal from his travels with Davy in 1813–1815.    ,  ; vol. iii. Richard Taylor and William Francis, 1855       – published in eight volumes; see also the  of Faradays diary     – volume 2, 1993; volume 3, 1996; volume 4, 1999     London; Glasgow: R. Griffin, 1860.   ": null
    },
    {
        "The Liquefaction of Gases": "s:the liquefaction of gases"
    },
    {
        ", Edinburgh: W.F. Clay, 1896.    London: Williams & Norgate 1899. ": null
    }
]