[
    {
        "      Michael John Moorcock is an ": null
    },
    {
        "English": "english people"
    },
    {
        " writer and musician, primarily of ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " and ": null
    },
    {
        "fantasy": "fantasy fiction"
    },
    {
        ", who has also published ": null
    },
    {
        "literary novels": "literary novels"
    },
    {
        ". He is best known for his novels about the character ": null
    },
    {
        "Elric of Melniboné": "elric of melniboné"
    },
    {
        ", a seminal influence on the field of fantasy since the 1960s and 70s.     As editor of the British science fiction magazine  New Worlds , from May 1964 until March 1971 and then again from 1976 to 1996, Moorcock fostered the development of the ": null
    },
    {
        "science fiction New Wave ": "new wave science fiction"
    },
    {
        " in the UK and indirectly in the United States. His publication of  Bug Jack Barron  by ": null
    },
    {
        "Norman Spinrad": "norman spinrad"
    },
    {
        " as a serial novel was notorious; in Parliament some British MPs condemned the ": null
    },
    {
        "Arts Council": "arts council"
    },
    {
        " for funding the magazine. Michael Ashley, Transformations: Volume 2 in the History of the Science Fiction Magazine, 1950–1970 , p. 250. He is also a successful recording musician, contributing to the bands ": null
    },
    {
        "Hawkwind": "hawkwind"
    },
    {
        ", ": null
    },
    {
        "Blue Öyster Cult": "blue öyster cult"
    },
    {
        " and his own project.     In 2008,  The Times  named Moorcock in its list of The 50 greatest ": null
    },
    {
        "British writers": "british literature"
    },
    {
        " since 1945 . . 5 January 2008.  The Times . Retrieved 27 February 2010.       Michael Moorcock was born in London in December 1939,  and the landscape of London, particularly the area of ": null
    },
    {
        "Notting Hill Gate": "notting hill gate"
    },
    {
        "  and ": null
    },
    {
        "Ladbroke Grove": "ladbroke grove"
    },
    {
        ", is an important influence in some of his fiction .      Moorcock has mentioned The Mastermind of Mars by ": null
    },
    {
        "Edgar Rice Burroughs": "edgar rice burroughs"
    },
    {
        ",  The Apple Cart  by ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        " and The Constable of St. Nicholas by ": null
    },
    {
        "Edwin Lester Arnold": "edwin lester arnold"
    },
    {
        " as the first three non-juvenile books that he read before beginning primary school.  The first book he bought was a secondhand copy of  The Pilgrims Progress .      Moorcock is the former husband of ": null
    },
    {
        "Hilary Bailey": "hilary bailey"
    },
    {
        " by whom he had three children: Sophie b.1963, Katherine b.1964, and Max b. 1972. He is also the former husband of Jill Riches, who later married ": null
    },
    {
        "Robert Calvert": "robert calvert"
    },
    {
        ". She illustrated some of Moorcocks books, including covers, including the Gloriana dustjacket. . ISFDB. Retrieved 4 April 2013. In 1983, Linda Steele became Moorcocks third wife. ": null
    },
    {
        "John Clute": "john clute"
    },
    {
        ", , in The Steel Tsar, Hachette, 2018. , multiverse.org. Iain Sinclair, ,  The Times Literary Supplement  , 7 October 2013.     He was an original member of the ": null
    },
    {
        "Swordsmen and Sorcerers Guild of America": "swordsmen and sorcerers guild of america"
    },
    {
        " , a loose-knit group of eight ": null
    },
    {
        "heroic fantasy": "heroic fantasy"
    },
    {
        " authors founded in the 1960s and led by ": null
    },
    {
        "Lin Carter": "lin carter"
    },
    {
        ", self-selected by fantasy credentials alone.     Moorcock is the subject of four book-length works, a monograph and an interview, by ": null
    },
    {
        "Colin Greenland": "colin greenland"
    },
    {
        ". In 1983, Greenland published The Entropy Exhibition: Michael Moorcock and the British New Wave in Science Fiction. He followed this with Michael Moorcock: Death is No Obstacle, a book-length interview about technique, in 1992. Michael Moorcock: Law of Chaos by Jeff Gardiner and Michael Moorcock: Fiction, Fantasy and the Worlds Pain by Mark Scroggins were published more recently.     In the 1990s, Moorcock moved to ": null
    },
    {
        "Texas": "texas"
    },
    {
        " in the United States.  His wife Linda is American.  He spends half of the year in Texas, the other half in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ".          Moorcocks works are noted for their political nature and content. In one interview, he states, I am an ": null
    },
    {
        "anarchist": "anarchism"
    },
    {
        " and a ": null
    },
    {
        "pragmatist": "pragmatism"
    },
    {
        ". My moral/philosophical position is that of an anarchist.  Further, in describing how his writing relates to his political philosophy, Moorcock says, My books frequently deal with aristocratic heroes, gods and so forth. All of them end on a note which often states quite directly that one should serve ": null
    },
    {
        "neither gods nor masters": "no gods, no masters"
    },
    {
        " but become ones own master.     Besides using fiction to explore his politics, Moorcock also engages in ": null
    },
    {
        "political activism": "activism"
    },
    {
        ". In order to marginalize stuff that works to objectify women and suggests women enjoy being beaten , he has encouraged ": null
    },
    {
        "W H Smiths": "w h smith"
    },
    {
        "to move ": null
    },
    {
        "John Normans": "john norman"
    },
    {
        "  Gor  series novels to the top shelf.           Moorcock began writing whilst he was still at school, contributing to a magazine he entitled Outlaws Own from 1950 on.     In 1957 at the age of 17, Moorcock became editor of Tarzan Adventures where he published at least a dozen of his own Sojan the Swordsman stories during that year and the next. At age 18 , he wrote the allegorical fantasy novel The Golden Barge. This remained unpublished until 1980, when it was issued by Savoy Books with an introduction by ": null
    },
    {
        "M. John Harrison": "m. john harrison"
    },
    {
        ". At 19 years of age he also edited Sexton Blake Library  and returned to late Victorian London for some of his books. Writing ever since, he has produced a huge volume of work. His first story in New Worlds was Going Home . The Sundered Worlds , a 57-page novella published in the November 1962 number of  Science Fiction Adventures  edited by ": null
    },
    {
        "John Carnell": "john carnell"
    },
    {
        ", became, with its sequel The Blood Red Game from the same magazine, the basis for his 190-page paperback debut novel     , he has also edited other volumes, including two bringing together examples of ": null
    },
    {
        "invasion literature": "invasion literature"
    },
    {
        ":    Before Armageddon     England Invaded        Letters From Hollywood    ": null
    }
]