[
    {
        "          Mickey Deans was an American musician and entrepreneur, and the fifth and last husband of actress and singer ": null
    },
    {
        "Judy Garland": "judy garland"
    },
    {
        ".       Born Michael DeVinko in ": null
    },
    {
        "Garfield, New Jersey": "garfield, new jersey"
    },
    {
        " on September 42 42 Deans was the youngest of three children of Mary and Michael DeVinko. He grew up in a musical family, playing the piano and accordion.       He played the piano at Jillys, a nightclub in Manhattan, later working as the manager of the discothèque Arthur. In 42 according to Deans book Weep No More, My Lady, he met actress and singer ": null
    },
    {
        "Judy Garland": "judy garland"
    },
    {
        " at her hotel in New York City. A mutual friend of theirs asked Deans to deliver a package of stimulant tablets to Garland. Deans recalled that she seemed cordial but disoriented. Because Garlands two youngest children were present, Deans felt it appropriate to introduce himself as a doctor.     After three years of intermittent dating, Deans proposed, and they were married on March 42 42 in London. Deans worked to promote Garlands career toward the end of her life, but he found it impossible to control her excessive use of prescription drugs. Deans discovered Garland dead on the morning of June 42 42 Although many obituaries at the time stated Garland was found on the floor of their bathroom, Deans stated that he found her seated on the toilet. The coroners autopsy later determined she died from an accidental overdose of barbiturates.       Following Garlands death, Deans co-authored Weep No More, My Lady, a biography of Garland written with Ann Pinchot. The book includes autobiographical elements of Deans pre-Garland life and their time together. The book was published in 42 by Hawthorn Books with paperback editions issued by Pyramid Books.     In 42 he bought the ": null
    },
    {
        "Franklin Castle": "franklin castle"
    },
    {
        ", a historic four-story stone mansion on Franklin Boulevard in Clevelands ": null
    },
    {
        "Ohio City": "ohio city, cleveland"
    },
    {
        ", for $42  and had it restored. Deans donated a feather boa that had belonged to Garland to a charity auction. He then placed the highest bid in order to maintain ownership of it. After selling Franklin Castle in 42 Deans lived in ": null
    },
    {
        "Northfield, Ohio": "northfield, ohio"
    },
    {
        ".       Deans died of ": null
    },
    {
        "congestive heart failure": "congestive heart failure"
    },
    {
        " in Cleveland, Ohio on July 42 42 at the age of 42 Rather than being interred with Garland at ": null
    },
    {
        "Ferncliff Cemetery": "ferncliff cemetery"
    },
    {
        " in ": null
    },
    {
        "Hartsdale, New York": "hartsdale, new york"
    },
    {
        ", his body was cremated and his ashes sent to an individual in Florida.       Weep No More, My Lady  Pyramid Books Edition, &  G. K. Hall , aka Judys Story": null
    }
]