[
    {
        "     A microcontroller  is a small ": null
    },
    {
        "computer": "computer"
    },
    {
        " on a single ": null
    },
    {
        "metal-oxide-semiconductor": "mosfet"
    },
    {
        " integrated circuit": "integrated circuit"
    },
    {
        " chip. In modern terminology, it is similar to, but less sophisticated than, a ": null
    },
    {
        "system on a chip": "system on a chip"
    },
    {
        " ; an SoC may include a microcontroller as one of its components. A microcontroller contains one or more ": null
    },
    {
        "CPUs": "central processing unit"
    },
    {
        "  along with ": null
    },
    {
        "memory": "computer memory"
    },
    {
        " and programmable ": null
    },
    {
        "input/output": "input/output"
    },
    {
        " peripherals. Program memory in the form of ": null
    },
    {
        "ferroelectric RAM": "ferroelectric ram"
    },
    {
        ", ": null
    },
    {
        "NOR flash": "flash memorynor flash"
    },
    {
        " or ": null
    },
    {
        "OTP ROM": "programmable read-only memory"
    },
    {
        " is also often included on chip, as well as a small amount of ": null
    },
    {
        "RAM": "random-access memory"
    },
    {
        ". Microcontrollers are designed for ": null
    },
    {
        "embedded": "embedded system"
    },
    {
        " applications, in contrast to the ": null
    },
    {
        "microprocessors": "microprocessor"
    },
    {
        "used in ": null
    },
    {
        "personal computers": "personal computer"
    },
    {
        "or other general purpose applications consisting of various discrete chips.     Microcontrollers are used in ": null
    },
    {
        "automatically controlled": "control system"
    },
    {
        " products and devices, such as automobile engine control systems, implantable medical devices, remote controls, office machines, appliances, power tools, toys and other ": null
    },
    {
        "embedded system": "embedded system"
    },
    {
        "s. By reducing the size and cost compared to a design that uses a separate ": null
    },
    {
        "microprocessor": "microprocessor"
    },
    {
        ", memory, and input/output devices, microcontrollers make it economical to digitally control even more devices and processes. ": null
    },
    {
        "Mixed signal": "mixed-signal integrated circuit"
    },
    {
        " microcontrollers are common, integrating analog components needed to control non-digital electronic systems. In the context of the ": null
    },
    {
        "internet of things": "internet of things"
    },
    {
        ", microcontrollers are an economical and popular means of ": null
    },
    {
        "data collection": "data collection"
    },
    {
        ", ": null
    },
    {
        "sensing": "sensor"
    },
    {
        " and ": null
    },
    {
        "actuating": "actuator"
    },
    {
        " the physical world as ": null
    },
    {
        "edge device": "edge device"
    },
    {
        "s.     Some microcontrollers may use four-bit ": null
    },
    {
        "words": "word"
    },
    {
        " and operate at frequencies as low as  for low ": null
    },
    {
        "power consumption": "electric energy consumption"
    },
    {
        " . They generally have the ability to retain functionality while ": null
    },
    {
        "waiting": "wait state"
    },
    {
        " for an ": null
    },
    {
        "event": "event-driven architecture"
    },
    {
        " such as a button press or other ": null
    },
    {
        "interrupt": "interrupt"
    },
    {
        "; power consumption while sleeping may be just nanowatts, making many of them well suited for long lasting battery applications. Other microcontrollers may serve performance-critical roles, where they may need to act more like a ": null
    },
    {
        "digital signal processor": "digital signal processor"
    },
    {
        " , with higher clock speeds and power consumption.              The origins of both the ": null
    },
    {
        "microprocessor": "microprocessor"
    },
    {
        " and the microcontroller can be traced back to the invention of the ": null
    },
    {
        "MOSFET": "mosfet"
    },
    {
        " , also known as the MOS transistor.  It was invented by ": null
    },
    {
        "Mohamed M. Atalla": "mohamed m. atalla"
    },
    {
        " and ": null
    },
    {
        "Dawon Kahng": "dawon kahng"
    },
    {
        " at ": null
    },
    {
        "Bell Labs": "bell labs"
    },
    {
        " in 1959, and first demonstrated in 1960.  The same year, Atalla proposed the concept of the ": null
    },
    {
        "MOS integrated circuit": "mos integrated circuit"
    },
    {
        ", which was an ": null
    },
    {
        "integrated circuit": "integrated circuit"
    },
    {
        " chip ": null
    },
    {
        "fabricated": "semiconductor device fabrication"
    },
    {
        " from MOSFETs.  By 1964, MOS chips had reached higher ": null
    },
    {
        "transistor density": "transistor density"
    },
    {
        " and lower manufacturing costs than ": null
    },
    {
        "bipolar": "bipolar junction transistor"
    },
    {
        " chips. MOS chips further increased in complexity at a rate predicted by ": null
    },
    {
        "Moores law": "moores law"
    },
    {
        ", leading to ": null
    },
    {
        "large-scale integration": "large-scale integration"
    },
    {
        " with hundreds of ": null
    },
    {
        "transistors": "transistors"
    },
    {
        " on a single MOS chip by the late 1960s. The application of MOS LSI chips to ": null
    },
    {
        "computing": "computing"
    },
    {
        " was the basis for the first microprocessors, as engineers began recognizing that a complete ": null
    },
    {
        "computer processor": "computer processor"
    },
    {
        " could be contained on a single MOS LSI chip.     The first multi-chip microprocessors, the ": null
    },
    {
        "Four-Phase Systems AL1": "four-phase systems al1"
    },
    {
        " in 1969 and the ": null
    },
    {
        "Garrett AiResearch": "garrett airesearch"
    },
    {
        " MP944": "mp944"
    },
    {
        " in 1970, were developed with multiple MOS LSI chips. The first single-chip microprocessor was the ": null
    },
    {
        "Intel 4004": "intel 4004"
    },
    {
        ", released on a single MOS LSI chip in 1971. It was developed by ": null
    },
    {
        "Federico Faggin": "federico faggin"
    },
    {
        ", using his ": null
    },
    {
        "silicon-gate": "silicon-gate"
    },
    {
        " MOS technology, along with ": null
    },
    {
        "Intel": "intel"
    },
    {
        " engineers ": null
    },
    {
        "Marcian Hoff": "marcian hoff"
    },
    {
        " and ": null
    },
    {
        "Stan Mazor": "stan mazor"
    },
    {
        ", and ": null
    },
    {
        "Busicom": "busicom"
    },
    {
        " engineer ": null
    },
    {
        "Masatoshi Shima": "masatoshi shima"
    },
    {
        ".  It was followed by the ": null
    },
    {
        "4-bit": "4-bit"
    },
    {
        " Intel 4040": "intel 4040"
    },
    {
        ", the ": null
    },
    {
        "8-bit": "8-bit"
    },
    {
        " Intel 8008": "intel 8008"
    },
    {
        ", and the 8-bit ": null
    },
    {
        "Intel 8080": "intel 8080"
    },
    {
        ". All of these processors required several external chips to implement a working system, including memory and peripheral interface chips. As a result, the total system cost was several hundred dollars, making it impossible to economically computerize small appliances. MOS Technology introduced sub-$100 microprocessors, the 6501 and 6502, with the chief aim of addressing this economic obstacle, but these microprocessors still required external support, memory, and peripheral chips which kept the total system cost in the hundreds of dollars.       One book credits ": null
    },
    {
        "TI": "texas instruments"
    },
    {
        " engineers Gary Boone and Michael Cochran with the successful creation of the first microcontroller in 1971. The result of their work was the ": null
    },
    {
        "TMS 1000": "tms 1000"
    },
    {
        ", which became commercially available in 1974. It combined read-only memory, read/write memory, processor and clock on one chip and was targeted at embedded systems.      During the early-to-mid-1970s, Japanese electronics manufacturers began producing microcontrollers for automobiles, including 4-bit MCUs for ": null
    },
    {
        "in-car entertainment": "in-car entertainment"
    },
    {
        ", automatic wipers, electronic locks, and dashboard, and 8-bit MCUs for engine control.      Partly in response to the existence of the single-chip TMS 1000,  Intel developed a computer system on a chip optimized for control applications, the ": null
    },
    {
        "Intel 8048": "intel 8048"
    },
    {
        ", with commercial parts first shipping in 1977. It combined ": null
    },
    {
        "RAM": "random access memory"
    },
    {
        " and ": null
    },
    {
        "ROM": "read only memory"
    },
    {
        " on the same chip with a microprocessor. Among numerous applications, this chip would eventually find its way into over one billion PC keyboards. At that time Intels President, Luke J. Valenter, stated that the microcontroller was one of the most successful products in the companys history, and he expanded the microcontroller divisions budget by over 25%.     Most microcontrollers at this time had concurrent variants. One had ": null
    },
    {
        "EPROM": "eprom"
    },
    {
        " program memory, with a transparent quartz window in the lid of the package to allow it to be erased by exposure to ": null
    },
    {
        "ultraviolet": "ultraviolet"
    },
    {
        " light. These erasable chips were often used for prototyping. The other variant was either a mask programmed ROM or a ": null
    },
    {
        "PROM": "programmable read-only memory"
    },
    {
        " variant which was only programmable once. For the latter, sometimes the designation OTP was used, standing for one-time programmable . In an OTP microcontroller, the PROM was usually of identical type as the EPROM, but the chip package had no quartz window; because there was no way to expose the EPROM to ultraviolet light, it could not be erased. Because the erasable versions required ceramic packages with quartz windows, they were significantly more expensive than the OTP versions, which could be made in lower-cost opaque plastic packages. For the erasable variants, quartz was required, instead of less expensive glass, for its transparency to ultraviolet light & mdash;to which glass is largely opaque & mdash;but the main cost differentiator was the ceramic package itself.     In 1993, the introduction of ": null
    },
    {
        "EEPROM": "eeprom"
    },
    {
        " memory allowed microcontrollers   to be electrically erased quickly without an expensive package as required for ": null
    },
    {
        "EPROM": "eprom"
    },
    {
        ", allowing both rapid prototyping, and ": null
    },
    {
        "in-system programming": "in-system programming"
    },
    {
        ".  The same year, Atmel introduced the first microcontroller using ": null
    },
    {
        "Flash memory": "flash memory"
    },
    {
        ", a special type of EEPROM.  by Odd Jostein Svendsli 2003 Other companies rapidly followed suit, with both memory types.     Nowadays microcontrollers are cheap and readily available for hobbyists, with large online communities around certain processors.       In 2002, about 55% of all ": null
    },
    {
        "CPUs": "central processing unit"
    },
    {
        "sold in the world were 8-bit microcontrollers and microprocessors.      Over two billion 8-bit microcontrollers were sold in 1997,  and according to Semico, over four billion 8-bit microcontrollers were sold in 2006.  More recently, Semico has claimed the MCU market grew 36.5% in 2010 and 12% in 2011.      A typical home in a developed country is likely to have only four general-purpose microprocessors but around three dozen microcontrollers. A typical mid-range automobile has about 30 microcontrollers. They can also be found in many electrical devices such as washing machines, microwave ovens, and telephones.          Cost to manufacture can be under $0.10 per unit.     Cost has plummeted over time, with the cheapest ": null
    },
    {
        "8-bit": "8-bit"
    },
    {
        " microcontrollers being available for under  in 2018,  and some ": null
    },
    {
        "32-bit": "32-bit"
    },
    {
        " microcontrollers around US$1 for similar quantities.     In 2012, following a global crisis & mdash;a worst ever annual sales decline and recovery and average sales price year-over-year plunging 17% & mdash;the biggest reduction since the 1980s & mdash;the average price for a microcontroller was US$0.88 .       In 2012, worldwide sales of 8-bit microcontrollers were around $4 billion, while ": null
    },
    {
        "4-bit": "4-bit"
    },
    {
        " microcontrollers also saw significant sales.   Bill Giovino.   .   2013.              ": null
    }
]