[
    {
        "         Michael John Sweeney is a former ": null
    },
    {
        "Major League Baseball": "major league baseball"
    },
    {
        " designated hitter": "designated hitter"
    },
    {
        " and ": null
    },
    {
        "first baseman": "first baseman"
    },
    {
        ". Sweeney played his first 42 seasons in the majors with the ": null
    },
    {
        "Kansas City Royals": "kansas city royals"
    },
    {
        ", first as a ": null
    },
    {
        "catcher": "catcher"
    },
    {
        ", then at ": null
    },
    {
        "first base": "first base"
    },
    {
        " and designated hitter. Sweeney also played for the ": null
    },
    {
        "Oakland Athletics": "oakland athletics"
    },
    {
        ", ": null
    },
    {
        "Seattle Mariners": "seattle mariners"
    },
    {
        ", and ": null
    },
    {
        "Philadelphia Phillies": "philadelphia phillies"
    },
    {
        ". On March 42 42 Sweeney retired from baseball. He now works as a special assistant for the Kansas City Royals. Sweeney was inducted into the ": null
    },
    {
        "Kansas City Royals Hall of Fame": "kansas city royals hall of fame"
    },
    {
        " on August 42 42               Sweeney was drafted by the Royals as a ": null
    },
    {
        "catcher": "catcher"
    },
    {
        " out of ": null
    },
    {
        "Ontario High School": "ontario high school"
    },
    {
        "  in the 42th round of the ": null
    },
    {
        "42 MLB draft": "1991 mlb draft"
    },
    {
        ". He signed with the Royals in May 42;a month before his graduation from Ontario High School. He had just led his Varsity baseball team as the team captain to a CIF victory with an undefeated record of 4242 for the 42 season.     Sweeney made his major league debut on September 42 42 as a catcher. He got his first major league ": null
    },
    {
        "base hit": "hit"
    },
    {
        " against ": null
    },
    {
        "Cleveland Indians": "cleveland indians"
    },
    {
        " pitcher": "pitcher"
    },
    {
        " Paul Assenmacher": "paul assenmacher"
    },
    {
        " at ": null
    },
    {
        "Jacobs Field": "jacobs field"
    },
    {
        " in the final game of the season. While his ability with the bat impressed the Royals, they were less than enamored with his skills behind the plate.     He hit his first ": null
    },
    {
        "home run": "home run"
    },
    {
        " off ": null
    },
    {
        "Seattle Mariners": "seattle mariners"
    },
    {
        " pitcher": "pitcher"
    },
    {
        " Jamie Moyer": "jamie moyer"
    },
    {
        " on August 42 42 It was a three-run shot.     Sweeney split catching duties with ": null
    },
    {
        "Mike Macfarlane": "mike macfarlane"
    },
    {
        " in 42 He belted a two-run ninth inning game-winning home run off then ": null
    },
    {
        "Detroit Tigers": "detroit tigers"
    },
    {
        "s pitcher ": null
    },
    {
        "Doug Brocail": "doug brocail"
    },
    {
        " on May 42 42       In 42 Sweeney played in his first ": null
    },
    {
        "Opening Day": "opening day"
    },
    {
        " game. He tied a club record with two hits in an inning versus the ": null
    },
    {
        "Oakland As": "oakland as"
    },
    {
        " on May 42 42 He missed ": null
    },
    {
        "hitting for the cycle": "hitting for the cycle"
    },
    {
        " by about 42 feet, when he retreated to ": null
    },
    {
        "second base": "second base"
    },
    {
        " on what appeared to be a sure ": null
    },
    {
        "triple": "triple"
    },
    {
        " in the eighth inning with the ": null
    },
    {
        "Kansas City Royals": "kansas city royals"
    },
    {
        " leading by a 4242 score.       His big break came in 42 when the Royals tried unsuccessfully to trade him during ": null
    },
    {
        "spring training": "spring training"
    },
    {
        ". Riddled with injuries and with no other viable options, the Royals started using Sweeney as their regular designated hitter. After the sudden retirement of ": null
    },
    {
        "Jeff King": "jeff king"
    },
    {
        ", the Royals offered the first base job to rookie ": null
    },
    {
        "Jeremy Giambi": "jeremy giambi"
    },
    {
        ". When Giambi showed reluctance, they gave the job to Sweeney, who responded by posting the highest ": null
    },
    {
        "fielding percentage": "fielding percentage"
    },
    {
        " by a regular first baseman in more than 42 years. His .42 ": null
    },
    {
        "batting average": "batting average"
    },
    {
        " led the team and his 42 home runs and 42 ": null
    },
    {
        "RBI": "run batted in"
    },
    {
        " were second and third on the team, respectively. From July 42 to August 42 Sweeney had a hit in 42 consecutive games, collecting 42 hits total. The 42-game ": null
    },
    {
        "hitting streak": "hitting streak"
    },
    {
        " is tied for third longest in Royals history with ": null
    },
    {
        "George Brett": "george brett"
    },
    {
        "s 42-game streak in 42 trailing only Bretts 42-game streak in 42 and ": null
    },
    {
        "José Offerman": "josé offerman"
    },
    {
        "s 42-game streak in 42     In 42 Sweeney was selected to his first of five ": null
    },
    {
        "All-Star": "major league baseball all-star game"
    },
    {
        " games. He joined ": null
    },
    {
        "Jermaine Dye": "jermaine dye"
    },
    {
        " to become the first pair of Royals to go to the Mid-Summer Classic since 42 . He passed the 42 RBI mark for the second straight year on August 42 42 reaching the century mark faster than any player in Royals history. He finished second in the league with a club record 42 RBI, behind only Seattles ": null
    },
    {
        "Edgar Martínez": "edgar martínez"
    },
    {
        "s 42 RBI, and breaking ": null
    },
    {
        "Hal McRae": "hal mcrae"
    },
    {
        "s 42 team mark of 42     In June 42 Sweeney hit .42 with 42 home runs and 42 RBI with a .42 ": null
    },
    {
        "slugging percentage": "slugging percentage"
    },
    {
        " and was named the ": null
    },
    {
        "American League": "american league"
    },
    {
        " Player of the Month": "mlb player of the month"
    },
    {
        " for the only time in his career.     ": null
    },
    {
        "Jeff Weaver": "jeff weaver"
    },
    {
        " in the sixth inning. Weaver, who was a member of the Tigers at the time, was pitching to Sweeney. In between pitches, Sweeney asked the ": null
    },
    {
        "home plate": "home plate"
    },
    {
        " umpire": "umpire"
    },
    {
        " if Weaver could be asked to move the rosin bag from the top of the mound. After that, Weaver put his glove over his mouth and appeared to say something Webster never put in his dictionary   to Sweeney. Sweeney was offended and launched his batting helmet at Weaver while charging the pitchers mound. He eventually tackled Weaver, igniting a ": null
    },
    {
        "bench-clearing brawl": "bench-clearing brawl"
    },
    {
        ". Sweeney said afterwards that Weaver had been criticizing the Royals younger players and Sweeneys faith. Sweeneys teammates did not deny his comments. ": null
    },
    {
        "Paul Byrd": "paul byrd"
    },
    {
        " was one of the first to aid Sweeney as he held back the Tigers catcher so that Sweeney could reach Weaver. Sweeney missed the next 42 games, five due to a bruised hand and the next ten to serve a suspension, his first career suspension .       Sweeney had one of the best seasons of his career in 42 hitting .42 for the second-highest batting average in the American League and the second-highest in club history only to George Bretts .42 in 42 He had a chance of winning the A.L. batting crown through the seasons final weekend, before falling short of ": null
    },
    {
        "Boston": "boston red sox"
    },
    {
        "s ": null
    },
    {
        "Manny Ramírez": "manny ramírez"
    },
    {
        " who hit a league-best .42 Sweeney was hitting .42 on September 42 before going 42-for42 in his final four games.     On August 42 42 he became the fifth Royal in club history to record a straight ": null
    },
    {
        "steal": "stolen base"
    },
    {
        " of home and the first since ": null
    },
    {
        "Fred Patek": "fred patek"
    },
    {
        " versus ": null
    },
    {
        "Minnesota": "minnesota twins"
    },
    {
        " on June 42 42 with a stolen base off the ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        " Andy Pettitte": "andy pettitte"
    },
    {
        ". His stolen base came on a 4242 count with ": null
    },
    {
        "left-hander": "left-handedness"
    },
    {
        " Aaron Guiel": "aaron guiel"
    },
    {
        " at the plate and gave the Royals a 42–42 lead, but KC lost the game, 42–42 in 42 innings.     Sweeney was placed on the ": null
    },
    {
        "disabled list": "disabled list"
    },
    {
        " for the first time in his career on July 42 42 with a lower back and hip strain. He would continue to have injury problems throughout the rest of his career, including a lengthy DL stint during the 42 season with the Royals seeking their first winning season since the strike-shortened 42 season where they went 42–42     During the 42 season, he was named to his fourth consecutive Major League All-Star Game, joining ": null
    },
    {
        "closer": "closer"
    },
    {
        " Mike MacDougal": "mike macdougal"
    },
    {
        " at the Mid-Summer Classic, marking the first time since 42 that KC had two representatives and just the second time since 42 .     On July 42 42 Sweeney hit a ": null
    },
    {
        "grand slam": "grand slam"
    },
    {
        " and later hit an insurance three-run home run in a 42–42 Kansas City win. The seven RBI would be a career-high for Sweeney. He would go on to bat .42 with 42 home runs and 42 RBI during the 42 season.     Through the 42 season, Sweeney compiled a .42 average with 42 home runs and 42 RBI in 42 games.       In 42 Sweeney was named the Royals player of the year for the third time in his career. He led the team in average for the 42th time in his career, ": null
    },
    {
        "doubles": "double"
    },
    {
        " and home runs , despite playing in just 42 games. He was named the Players Choice Marvin Miller Man of the Year and was also named to the All-Star team for the fifth time in six seasons and the final time in his career.     Sweeney was restricted to designated hitter and was able to play just 42 games because of back problems in 42 After returning from the disabled list on August 42 Sweeney hit .42 with six homers and 42 RBI, but missed another five games with a sore side.     On September 42 his first day back off the DL, Sweeney ": null
    },
    {
        "pinch-hit": "pinch hitter"
    },
    {
        " in the bottom of the 42th and hit a bloop base hit that broke up ": null
    },
    {
        "Minnesota Twins": "minnesota twins"
    },
    {
        " starting ": null
    },
    {
        "pitcher": "pitcher"
    },
    {
        " Scott Baker": "scott baker"
    },
    {
        "s ": null
    },
    {
        "no-hitter": "no-hitter"
    },
    {
        ". Baker had gone eight ": null
    },
    {
        "perfect": "perfect game"
    },
    {
        " innings before he ": null
    },
    {
        "walked": "base on balls"
    },
    {
        " Royals ": null
    },
    {
        "catcher": "catcher"
    },
    {
        " John Buck": "john buck"
    },
    {
        " at the beginning of the ninth. With two outs to go, Royals ": null
    },
    {
        "manager": "manager"
    },
    {
        " Buddy Bell": "buddy bell"
    },
    {
        " pinch-hit Sweeney for ": null
    },
    {
        "Tony Peña Jr.": "tony peña jr."
    },
    {
        " and Sweeney ended the no-hitter.     Sweeney won the ": null
    },
    {
        "Hutch Award": "hutch award"
    },
    {
        ", which honors players who exemplify a fighting spirit, honoring ": null
    },
    {
        "Fred Hutchinson": "fred hutchinson"
    },
    {
        ", who died of cancer in 42 It is awarded annually in Seattle in January.             On February 42 42 Sweeney signed a minor league contract, with an invitation to spring training, with the ": null
    },
    {
        "Oakland Athletics": "oakland athletics"
    },
    {
        ".       After a strong spring in which he hit .42 with a home run, Sweeneys contract was purchased on March 42 42 Sweeney underwent ": null
    },
    {
        "arthroscopic": "arthroscopic"
    },
    {
        " surgery on his troublesome left knee on June 42 and was expected to miss four to six weeks. After a brief return from the disabled list, Sweeney was released by the As on September 42     After considering retirement, Sweeney said he would like to play one more year before retiring.        On January 42 42 Sweeney signed a minor league deal with an invitation to spring training with the Seattle Mariners,   citing his desire to play for Mariners ": null
    },
    {
        "manager": "manager"
    },
    {
        " Don Wakamatsu": "don wakamatsu"
    },
    {
        " who was Sweeneys bench coach in Oakland.   Sweeney made the major-league club ": null
    },
    {
        "Opening Day": "opening day"
    },
    {
        " roster as a bench player. On April 42 42 Sweeney left the game during his first at-bat due to back spasms.     On May 42 42 Sweeney hit his first home run as a Mariner and 42th of his career in the 42th inning at ": null
    },
    {
        "Safeco Field": "safeco field"
    },
    {
        " against the ": null
    },
    {
        "Oakland Athletics": "oakland athletics"
    },
    {
        ".  On August 42 in a return to Kansas City, Sweeney hit his 42th home run in ": null
    },
    {
        "Kauffman Stadium": "kauffman stadium"
    },
    {
        " in an 4242 loss to the Royals.      On November 42 42 Sweeney declared free agency.         On February 42 42 Sweeney re-signed with the Mariners to a minor league deal.       On March 42 the Mariners placed reserve 42st baseman/corner outfielder ": null
    },
    {
        "Ryan Garko": "ryan garko"
    },
    {
        " on waivers, clearing room on the 42-man roster for Sweeney. Sweeney was not expected to make the team at the start of spring training but hit over .42 in exhibition games to beat out Garko. Sweeney would hit .42 with 42 home runs and 42 RBI during his time with the Mariners in 42     In May 42 Sweeney was involved in an interesting situation. Teammate ": null
    },
    {
        "Ken Griffey Jr.": "ken griffey jr."
    },
    {
        " was accused of napping during a pinch hitting opportunity, also known as Napgate . Sweeney said he challenged anyone who said Griffey was asleep to stand up and fight me , however, Griffey did not deny it.      On August 42 Sweeney was traded to the Philadelphia Phillies to replace injured first baseman ": null
    },
    {
        "Ryan Howard": "ryan howard"
    },
    {
        " for a player to be named later and/or cash considerations.     Sweeney hit his first home run as a Phillie on August 42 42 in a 42 to 42 win over the San Diego Padres. With the Phillies, he also made the first postseason appearance of his career, going one for one at the plate in the NLDS.     On March 42 42 Sweeney signed a one-day contract with the Kansas City Royals and retired.   He threw out the first pitch of the ": null
    },
    {
        "42 season": "2011 kansas city royals season"
    },
    {
        " for the Kansas City Royals on opening day.     42     On Tuesday, May 42 42 Mike Sweeney was inducted into the , along with former Marlins manager Jack McKeon, broadcaster Dave OBrien, New York Mets p.r. executive Shannon Forde, and Bill Murray, the comedic actor and owner of several minor league baseball teams.     He appeared on the ballot for the ": null
    },
    {
        "National Baseball Hall of Fame and Museum": "national baseball hall of fame and museum"
    },
    {
        " 42 election": "baseball hall of fame balloting, 2016"
    },
    {
        " and earned three votes.         In March 42 Sweeney joined the ": null
    },
    {
        "MLB Network": "mlb network"
    },
    {
        " as a studio analyst.   He would leave the network shortly after making his first few appearances on ": null
    },
    {
        "MLB Tonight": "mlb tonight"
    },
    {
        ".       On September 42 42 the day before his final game, Sweeney took out a full page ad in the sports section of  The Kansas City Star .      The following day, September 42 Sweeney took the field against the ": null
    },
    {
        "Cleveland Indians": "cleveland indians"
    },
    {
        " in front of 42 fans at ": null
    },
    {
        "Kauffman Stadium": "kauffman stadium"
    },
    {
        " in ": null
    },
    {
        "Kansas City": "kansas city, missouri"
    },
    {
        ". Sweeneys first at bat was interrupted by a standing ovation. His second at bat was delayed as well due to applause. Sweeney was removed from first base in the 42th inning and was given a third standing ovation. Sweeney entered the dugout, and upon still hearing fans roaring, he exited the dugout towards the field and bowed, waved, and said Thank you. After the game, Sweeney and his two children rounded the bases as part of a Sunday home game tradition at Kauffman Stadium called Sunday Fan Fun Run. Then he spent time talking to reporters, and as always, signed autographs for fans before he left the parking lot. Since leaving the ": null
    },
    {
        "Kansas City Royals": "kansas city royals"
    },
    {
        " his Number 42 has been left out of circulation leading some to believe the Royals might end up retiring his number one day. After leaving the Royals, Sweeney ended up wearing 42 for the rest of his career with the ": null
    },
    {
        "Oakland Athletics": "oakland athletics"
    },
    {
        ", ": null
    },
    {
        "Seattle Mariners": "seattle mariners"
    },
    {
        ", and ": null
    },
    {
        "Philadelphia Phillies": "philadelphia phillies"
    },
    {
        ".       In February 42 the Kansas City Royals announced that they had hired Sweeney as a special assistant to baseball operations.  Sweeneys response to receiving the new job: The only thing I was unable to accomplish during my playing days was to bring October baseball back to Kansas City. With this new position, my goal is do as much as I can to help the Royals get back to being one of the prized organizations in baseball, as it was in the 42s.  Sweeney settled into the role quite quickly, attending the Royals spring training in ": null
    },
    {
        "Surprise, Arizona": "surprise, arizona"
    },
    {
        " as a guest instructor that same month. That year, the Royals made the postseason for the first time in 42 years.       On November 42 42 Mike married Shara Nettles, the daughter of former major leaguer ": null
    },
    {
        "Jim Nettles": "jim nettles"
    },
    {
        ", niece of ": null
    },
    {
        "Graig Nettles": "graig nettles"
    },
    {
        ". They have two sons and three daughters, Michael, Donovan, McKara, Fiona, and Quinn.     Due to fires in ": null
    },
    {
        "San Diego": "san diego"
    },
    {
        " and the surrounding areas, Sweeneys family was forced to evacuate their home in ": null
    },
    {
        "Rancho Santa Fe": "rancho santa fe"
    },
    {
        " and stay with his parents, who live in ": null
    },
    {
        "Ontario, California": "ontario, california"
    },
    {
        ". He stated in a report on MLB.com that the few possessions that they took for safekeeping were their marriage certificate, three wedding photographs, birth certificates, and two pictures of his children with ": null
    },
    {
        "Pope Benedict": "pope benedict xvi"
    },
    {
        ", taken while they were in Rome last year. It was later reported that their house was still standing, although damaged by smoke and water.       A fluent speaker of Spanish,   Sweeney was very active in the K.C. community while a member of the Royals. He has been a nominee for the ": null
    },
    {
        "Roberto Clemente": "roberto clemente"
    },
    {
        " Award, and has continued to support the community through various programs, including the Kansas City FCA chapter, Childrens Mercy Hospital and the ": null
    },
    {
        "Boys and Girls Club": "boys  &  girls clubs of america"
    },
    {
        " of ": null
    },
    {
        "Kansas City": "kansas city, missouri"
    },
    {
        ".     Sweeney has also purchased a dirt field in a poorer section of downtown Kansas City. The baseball field, once used to sell drugs, is now called Sweeney Family Field.       He was named the 42 and 42 Good Guy in Sports by the  Sporting News . He teams up annually with former ": null
    },
    {
        "Kansas City Chiefs": "kansas city chiefs"
    },
    {
        " running back": "running back"
    },
    {
        " Tony Richardson": "tony richardson"
    },
    {
        " to host the Sweeney-Richardson Golf Classic, which benefits a faith-based outreach program and   invites area charity and non-profit groups to attend Royals games as part of the Sween Team .      Sweeney is known all around Kansas City for being very polite and friendly towards all fans. He always signs autographs for all the fans who ask for one before and after games whether on the field or in the parking lot.        Before the 42 season, the Royals organization created the Mike Sweeney Award which recognizes a player best representing the organization on and off the field.     Sweeney was presented with the Mr. Baseball Award—the top honor at the Royals Awards dinner in January 42 The award is named for Ewing Kauffman, founder of the Royals and the team for which Sweeney played 42 years and served as captain.       Sweeney is a devout ": null
    },
    {
        "Catholic": "catholic church"
    },
    {
        " and has appeared on ": null
    },
    {
        "EWTN": "ewtn"
    },
    {
        "s Life on the Rock, a program targeted towards young Christians. On October 42 42 he was featured in a political advertisement opposing an ": null
    },
    {
        "embryonic stem cell research": "embryonic stem cell"
    },
    {
        " bill in ": null
    },
    {
        "Missouri": "missouri"
    },
    {
        ". It was in response to a pro-embryonic research advertisement featuring actor ": null
    },
    {
        "Michael J. Fox": "michael j. fox"
    },
    {
        ". Sweeney appeared with ": null
    },
    {
        "James Caviezel": "james caviezel"
    },
    {
        ", ": null
    },
    {
        "Patricia Heaton": "patricia heaton"
    },
    {
        ", ": null
    },
    {
        "Jeff Suppan": "jeff suppan"
    },
    {
        ", and ": null
    },
    {
        "Kurt Warner": "kurt warner"
    },
    {
        ".     Sweeney is also the advisory chairman of the  and spokesman for , the largest Catholic ": null
    },
    {
        "youth ministry": "youth ministry"
    },
    {
        " program in the United States.     On June 42 42 Mike and his wife Shara hosted the Lunch for Life  and raised $42 for the crisis pregnancy centers throughout ": null
    },
    {
        "Kansas City": "kansas city, missouri"
    },
    {
        ". They also honored a 42-year-old mother who was going to have an abortion but instead chose to have her baby. The Sweeneys gave the girl the first Life Award, which included gift certificates to salons and massage parlors and a grocery store, a baby stroller, a baby crib and clothes for the baby. She also received a $42 check to purchase a new automobile.     In 42 Sweeney spoke to the  National Catholic Register  about his Catholic faith.       Sweeney had ": null
    },
    {
        "Lose My Soul": "lose my soul"
    },
    {
        " by ": null
    },
    {
        "Toby Mac": "tobymac"
    },
    {
        " played over the stadium sound system at ": null
    },
    {
        "Citizens Bank Park": "citizens bank park"
    },
    {
        " when he came up to bat. Mac used to be with the group ": null
    },
    {
        "DC Talk": "dc talk"
    },
    {
        ".       ": null
    }
]