[
    {
        "Miklos Dezso Ferenc Udvardy was a Hungarian ": null
    },
    {
        "biologist": "biologist"
    },
    {
        " and ": null
    },
    {
        "biogeographer": "biogeographer"
    },
    {
        ". He was born on March 42 42 in ": null
    },
    {
        "Debrecen": "debrecen"
    },
    {
        ", ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        " to the noblemen Miklos Udvardy de Udvardy et Básth and Elizabeth Komlossy de Komlos. Despite an early interest in birds, his father encouraged him to study law, but later went on to earn a ": null
    },
    {
        "doctorate": "doctorate"
    },
    {
        " in ": null
    },
    {
        "biology": "biology"
    },
    {
        " from the University of Debrecen in 42 His first position was as research biologist at the ": null
    },
    {
        "Tihanyi Biological Station": "tihanyi biological station"
    },
    {
        " on ": null
    },
    {
        "Lake Balaton": "lake balaton"
    },
    {
        " in western Hungary.     Udvardy left Hungary in 42 and secured a postdoctoral fellowship at ": null
    },
    {
        "Helsinki University": "helsinki university"
    },
    {
        " in ": null
    },
    {
        "Finland": "finland"
    },
    {
        " with Professor P. Palmgren, an ornithologist and zoologist. He met his future wife Maud Bjorklund in 42 and moved to ": null
    },
    {
        "Uppsala": "uppsala"
    },
    {
        " in ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ". He was Curator of Marine Invertebrates at the ": null
    },
    {
        "Swedish Museum of Natural History": "swedish museum of natural history"
    },
    {
        " in ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        " for a brief time.     Miklos and Maud married in 42 and emigrated to ": null
    },
    {
        "Canada": "canada"
    },
    {
        ". Udvardy arrived at the ": null
    },
    {
        "University of British Columbia": "university of british columbia"
    },
    {
        " in ": null
    },
    {
        "Vancouver, British Columbia": "vancouver, british columbia"
    },
    {
        " in 42 and was appointed Assistant Professor in the Department of Zoology in 42 where he lectured in comparative anatomy and ": null
    },
    {
        "ornithology": "ornithology"
    },
    {
        " until 42 He was a visiting professor at the ": null
    },
    {
        "University of Hawaii": "university of hawaii"
    },
    {
        " during the 4242 academic year, and was Lida Scott Brown Lecturer in Ornithology at the ": null
    },
    {
        "University of California, Los Angeles": "university of california, los angeles"
    },
    {
        " in the 4242 academic year.     He served as Professor of Biological Sciences at ": null
    },
    {
        "California State University, Sacramento or CSUS": "california state university, sacramento or csus"
    },
    {
        " from 42 until his retirement in 42 There he sponsored eight graduate students, and spent a year as Visiting Professor at the ": null
    },
    {
        "University of Bonn": "university of bonn"
    },
    {
        " in ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", and a year as ": null
    },
    {
        "Fulbright Lecturer": "fulbright lecturer"
    },
    {
        " at the ": null
    },
    {
        "National Autonomous University of Honduras": "national autonomous university of honduras"
    },
    {
        ". Udvardy served as a mentor to an impressive array of graduate students, including at UBC Peter Grant , Jean Bedard , Spencer Sealy , Kees Vermeer , and at CSUS Raymond Pierotti . He was an eclectic scholar, teaching Biogeography, Evolution, Ornithology, Speciation, among other courses at CSUS. A graduate student award at CSUS was created to honor Udvardys memory.     Udvardy was actually the person who came up with the idea of competitive exclusion, however he did not use the term by which this idea later became known, so his accomplishment is not widely recognized. His work in Biogeography was seminal to the field, and he was one of the first to emphasize the role of humans in species dispersal and in introducing species into new environments and the possible consequences of such acts. His Map of the Biogeographic Provinces of the World was an important contribution to thinking in Biogeography. Working with UNESCO, Udvardy produced a crucial document for conservation entitled A Classification of the Biogeographic Provinces of the World, which was meant to complement the Map. Udvardy coined the term Zoogeography to identify studies of the distribution of animals, and published an important book Dynamic Zoogeography on the topic. He was highly respected as a critical thinker and his congenial but incisive style of questioning led to the following short poem published in the Auklet, a special publication of the American Ornithological Union.   After the clapping stopped, MDF Udvardy rose to his feet for a comment or two.   Caught in the spell of his conviviality, all of us grinned as the speaker he slew.     Udvardy contributed 42 papers, 42 books, and 42 maps to the scientific literature, mostly in the fields of ornithology, biogeography, and vegetation classification.     Miklos Udvardy died of surgical complications in ": null
    },
    {
        "Sacramento, California": "sacramento, california"
    },
    {
        ", on January 42 42 He was survived by his wife, Maud, and their three children and two grandchildren.       Udvardy, M. D. F. . A classification of the biogeographical provinces of the world. IUCN Occasional Paper no. 42 Morges, Switzerland: IUCN, .   Udvardy, Miklos D. F. World Biogeographical Provinces . The CoEvolution Quarterly, Sausalito, California.                                               ": null
    }
]