[
    {
        "           Mildred Pierce is a 42 ": null
    },
    {
        "hardboiled novel": "hardboiled novel"
    },
    {
        " by ": null
    },
    {
        "James M. Cain": "james m. cain"
    },
    {
        ". It was made into an ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        "–winning ": null
    },
    {
        "film of the same name": "mildred pierce"
    },
    {
        " in 42 starring ": null
    },
    {
        "Joan Crawford": "joan crawford"
    },
    {
        ", and a 42 ": null
    },
    {
        "Emmy Award": "emmy award"
    },
    {
        "–winning ": null
    },
    {
        "miniseries of the same name": "mildred pierce"
    },
    {
        ", starring ": null
    },
    {
        "Kate Winslet": "kate winslet"
    },
    {
        ".       Set in ": null
    },
    {
        "Glendale, California": "glendale, california"
    },
    {
        ", in the 42s, the book is the story of a middle-class housewife, Mildred Pierce, and her attempts to maintain her familys social position during the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        ".     Mildred separates from Bert, her unemployed husband, and sets out to support herself and her children. After a difficult search she finds a job as a waitress, but she worries that it is beneath her middle-class station. More than that, she worries that her ambitious and increasingly pretentious elder daughter, Veda, will think her new job demeaning. Mildred encounters both success and failure as she opens three successful restaurants, operates a pie-selling business and copes with the death of her younger daughter, Ray. Veda enjoys her mothers newfound financial success but increasingly turns ungrateful, demanding more and more from her hard-working mother while openly condemning her and anyone else who must work for a living.     When Mildred discovers her daughters plot to blackmail a wealthy family with a fake pregnancy, she kicks her out of their house. Veda, who has been training to become an opera singer, goes on to great fame, and Mildreds increasing obsession with her daughter leads her to use her former lover, Monty , and his social status and connection to bring Veda back into her life. Unfortunately for Mildred, this means buying Montys family estate and using her earnings to pay for Vedas extravagances. Mildred and Monty marry, but things go sour as her lavish lifestyle and neglect of her businesses has dramatically affected the companys profits. Creditors line up, led by Wally, a former business associate of Berts, with whom Mildred had a brief affair upon their separation. With no one to turn to, Mildred confesses to Bert that she has been embezzling money from her company in order to buy Vedas love.     Having decided that the only course of action is to ask Veda to contribute some of her now considerable earnings to balance the books and fearing that Wally might target the girls assets if they are exposed Mildred goes to her room to confront her. She finds Veda in bed with her stepfather. Monty reproaches Mildred for using him to bring Veda back and for her attitude to him as a financial dependent of hers, while Veda affects boredom but joins in to chide Mildred for embarrassing her and taking glory in her success. Mildred snaps, brutally attacking and strangling her daughter, who now appears incapable of singing and loses her singing contract.     Weeks pass as Mildred moves to ": null
    },
    {
        "Reno, Nevada": "reno, nevada"
    },
    {
        ", to establish residency in order to get a speedy divorce from Monty. Bert moves out to visit her. Mildred ultimately is forced to resign from her business empire, leaving it to Ida, a former company assistant. Bert and Mildred, upon the finalization of her divorce, remarry. Veda travels to Reno and apparently reconciles with Mildred but, several months later, Veda reveals that her voice has healed and announces that she is moving to New York City with Monty. The reconciliation was designed to defuse the negative publicity resulting from the affair with her stepfather and it emerges her apparent loss of her voice was a ploy so that she could renege on her existing singing contract and be free to take up a more lucrative one offered by another company. As she leaves the house, a broken Mildred, encouraged by Bert, eventually says to hell with the monstrous Veda, and the pair agree to get stinko .       Mildred Pierce  – a middle-class mother of two   Bert Pierce  – Mildreds first and, later, her third husband   Moire Pierce, Mildreds younger daughter   Veda Pierce  – Mildreds elder daughter   Wally Burgan  – Berts former business partner   Monty Beragon  – a wealthy playboy, Mildreds lover and later her second husband   Lucy Gessler  – Mildreds friend              In 42 the novel was made into a film starring Joan Crawford, ": null
    },
    {
        "Eve Arden": "eve arden"
    },
    {
        ", ": null
    },
    {
        "Ann Blyth": "ann blyth"
    },
    {
        ", ": null
    },
    {
        "Jack Carson": "jack carson"
    },
    {
        ", ": null
    },
    {
        "Bruce Bennett": "bruce bennett"
    },
    {
        ", ": null
    },
    {
        "Zachary Scott": "zachary scott"
    },
    {
        ", and ": null
    },
    {
        "Lee Patrick": "lee patrick"
    },
    {
        ". The screenplay was adapted by ": null
    },
    {
        "Ranald MacDougall": "ranald macdougall"
    },
    {
        ", ": null
    },
    {
        "William Faulkner": "william faulkner"
    },
    {
        ", and Catherine Turney and was directed by ": null
    },
    {
        "Michael Curtiz": "michael curtiz"
    },
    {
        ".     The ": null
    },
    {
        "Motion Picture Production Code": "motion picture production code"
    },
    {
        " in force at the time specified that 42 subjects shall not appear in pictures produced by the members of this Association and listed 42 other subjects where special care be exercised in the manner in which... are treated. These provisions made it impossible to film a literal depiction of the events in the novel. The screenplay removes any depiction of a sexual relationship between Monty and his stepdaughter, Veda. In the film, Mildred neither discovers them in bed nor injures Veda in any way.     These elements were replaced with a murder ": null
    },
    {
        "mystery": "mystery fiction"
    },
    {
        " told in flashbacks. In the movie, Veda commences an affair with Monty and kills him when he refuses to divorce Mildred to marry her. Mildred initially confesses to Montys murder in order to shield Veda from prosecution but ultimately gives her over to the authorities.     Mildred Pierce was nominated for six ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        "s, including ": null
    },
    {
        "Best Picture": "academy award for best picture"
    },
    {
        ", ": null
    },
    {
        "Best Supporting Actress": "academy award for best supporting actress"
    },
    {
        " , Best Screenplay and Best Black-and-White Cinematography . Crawford won the films only Academy Award, as ": null
    },
    {
        "Best Actress": "academy award for best actress"
    },
    {
        ".       An hour long radio play of the novel was first broadcast by the ": null
    },
    {
        "Lux Radio Theatre": "lux radio theatre"
    },
    {
        " on the ": null
    },
    {
        "NBC Radio Network": "nbc radio network"
    },
    {
        " on 42th June 42 starring ": null
    },
    {
        "Zachary Scott": "zachary scott"
    },
    {
        " and ": null
    },
    {
        "Claire Trevor": "claire trevor"
    },
    {
        ".       A one-and-a-half hour dramatisation by John Fletcher for the Radio Noir series for Saturday Night Theatre on BBC Radio 42 was first broadcast on 42th June 42 ": null
    },
    {
        "Shelley Thompson": "shelley thompson"
    },
    {
        " featured in the title role with ": null
    },
    {
        "Martin Jarvis": "martin jarvis"
    },
    {
        " as Monte Beragon and ": null
    },
    {
        "Ed Bishop": "ed bishop"
    },
    {
        " as Bert Pierce.          Director ": null
    },
    {
        "Todd Haynes": "todd haynes"
    },
    {
        " filmed a five-part miniseries for television, with ": null
    },
    {
        "Kate Winslet": "kate winslet"
    },
    {
        " as Mildred, ": null
    },
    {
        "Guy Pearce": "guy pearce"
    },
    {
        " as Monty Beragon, and ": null
    },
    {
        "Evan Rachel Wood": "evan rachel wood"
    },
    {
        " as Veda, in spring 42 . Haynes wrote the script with ": null
    },
    {
        "Jon Raymond": "jon raymond"
    },
    {
        " and served as an executive producer with Pamela Koffler, John Wells, Ilene S. Landress and ": null
    },
    {
        "Christine Vachon": "christine vachon"
    },
    {
        ", along with ": null
    },
    {
        "HBO": "hbo"
    },
    {
        " in association with ": null
    },
    {
        "Metro-Goldwyn-Mayer": "metro-goldwyn-mayer"
    },
    {
        ".     The miniseries aired on HBO, starting on March 42 42 and ending with a two-part finale on April 42 42 It differs from the movie version, staying more faithful to the novel. It is almost a word-for-word dramatization of the novel, including nearly every scene and using Cains dialogue. It features period music performed by ": null
    },
    {
        "Vince Giordano": "vince giordano"
    },
    {
        " and the ": null
    },
    {
        "Nighthawks Orchestra": "nighthawks orchestra"
    }
]