[
    {
        "The military defense of Puerto Rico  is the responsibility of the ": null
    },
    {
        "United States": "United States"
    },
    {
        " as part of the ": null
    },
    {
        "Treaty of Paris": "Treaty Of Paris"
    },
    {
        ". Locally, Puerto Rico has its own ": null
    },
    {
        "National Guard": "National Guard Of The United States"
    },
    {
        ", the  Puerto Rico National Guard , and its own ": null
    },
    {
        "state defense force": "State Defense Force"
    },
    {
        ", the ": null
    },
    {
        "Puerto Rico State Guard": "Puerto Rico State Guard"
    },
    {
        ", which, by local law, is under the authority of the Puerto Rico National Guard. The ": null
    },
    {
        "commander-in-chief": "Commander-In-Chief"
    },
    {
        " of both forces is the ": null
    },
    {
        "governor of Puerto Rico": "Governor Of Puerto Rico"
    },
    {
        ", currently ": null
    },
    {
        "Wanda Vázquez Garced": "Wanda Vázquez Garced"
    },
    {
        ", who delegates her authority to the ": null
    },
    {
        "Puerto Rico Adjutant General": "Puerto Rico Adjutant General"
    },
    {
        ", currently ": null
    },
    {
        "Brigadier General": "Brigadier General"
    },
    {
        " Isabelo Rivera": "Isabelo Rivera"
    },
    {
        " The Adjutant General, in turn, delegates the authority over the State Guard to another officer but retains the authority over the Puerto Rico National Guard as a whole. At the national level, the commander-in-chief is the ": null
    },
    {
        "President of the United States": "President Of The United States"
    },
    {
        ", currently ": null
    },
    {
        "Donald Trump": "Donald Trump"
    },
    {
        ".     A branch of the ": null
    },
    {
        "U.S. Army National Guard": "United States Army National Guard"
    },
    {
        " is stationed in Puerto Rico —known as the ": null
    },
    {
        "Puerto Rico Army National Guard": "Puerto Rico Army National Guard"
    },
    {
        "— which performs missions equivalent to those of the Army National Guards of the different ": null
    },
    {
        "states of the United States": "States Of The United States"
    },
    {
        ", including ground defense, disaster relief, and control of civil unrest. The local National Guard also incorporates a branch of the ": null
    },
    {
        "U.S. Air National Guard": "United States Air National Guard"
    },
    {
        " —known as the ": null
    },
    {
        "Puerto Rico Air National Guard": "Puerto Rico Air National Guard"
    },
    {
        "— which performs missions equivalent to those of the Air National Guards of the U.S. states.          The former ": null
    },
    {
        "Ramey Air Force Base": "Ramey Air Force Base"
    },
    {
        " in Aguadilla has been closed for decades, and no other Air Force Bases or Naval Air Stations remain. The Puerto Rico Air National Guard no longer has any fighter planes within its jurisdiction. On January 12, 1981, a group calling itself Volunteer Organization for the Revolution, aka Los Macheteros, claimed responsibility for blowing up six Vought A-7 Corsair aircraft in what is known as Base Muñiz; a Puerto Rico Air National Guard base at a loss of $40 million.  Retrieved July 27, 2009. Responsibility for the air defense of Puerto Rico now rests with ": null
    },
    {
        "USAF": "Usaf"
    },
    {
        " or ": null
    },
    {
        "US Navy": "Us Navy"
    },
    {
        " fighters that would be flown in case of a military emergency.     At different times in the 20th century, the U.S. had about 25 military or naval installations in Puerto Rico, some very small ones, OSD, Washington Headquarters Services, Directorate for Information Operations and Reports ; Atlas/Data Abstract for the United States and Selected Areas - Fiscal Year 1997; Department of Defense; 1998. Note: The count of 25 military installations included the branch component of the Roosevelt Roads Naval facility on the island of Vieques, as distinct from the Roosevelt Roads Naval station in Cieba as well as large installations. The largest of these installations were the former ": null
    },
    {
        "Roosevelt Roads Naval Station": "Roosevelt Roads Naval Station"
    },
    {
        " in ": null
    },
    {
        "Ceiba": "Ceiba, Puerto Rico"
    },
    {
        ", the Roosevelt Roads Naval Station, and the Atlantic Fleet Weapons Training Facility on ": null
    },
    {
        "Vieques": "Vieques"
    },
    {
        " , the National Guard training facility at ": null
    },
    {
        "Camp Santiago": "Camp Santiago"
    },
    {
        " in ": null
    },
    {
        "Salinas": "Salinas, Puerto Rico"
    },
    {
        ", ": null
    },
    {
        "Fort Allen": "Fort Allen, Puerto Rico"
    },
    {
        " in ": null
    },
    {
        "Juana Diaz": "Juana Diaz"
    },
    {
        ", the Armys ": null
    },
    {
        "Fort Buchanan": "Fort Buchanan, Puerto Rico"
    },
    {
        " in San Juan, the former U.S. Air Force Ramey Air Force Base in Aguadilla, and the Puerto Rico Air National Guard at Muñiz Air Force base in ": null
    },
    {
        "San Juan": "San Juan, Puerto Rico"
    },
    {
        ". Meléndez, Edwin; Meléndez, Edgardo; Colonial Dilemma; ": null
    },
    {
        "South End Press": "South End Press"
    },
    {
        "; Boston; 1993     The former U.S. Navy facilities at Roosevelt Roads, Vieques, and Sabana Seca have been deactivated and partially turned over to the local government. Other than ": null
    },
    {
        "U.S. Coast Guard": "U.S. Coast Guard"
    },
    {
        " and Puerto Rico National Guard facilities, there are only two remaining military installations in Puerto Rico, the U.S. Armys small Ft. Buchanan and the PRANG Muñiz Air Base . In recent years, the ": null
    },
    {
        "U.S. Congress": "U.S. Congress"
    },
    {
        " has considered their deactivations, but these have been opposed by diverse public and private entities in Puerto Rico - such as retired military who rely on Ft. Buchanan for the services available there.     The coastal defense of Puerto Rico is the responsibility of the ": null
    },
    {
        "U.S. Navy": "U.S. Navy"
    },
    {
        " from ships at sea, and the ": null
    },
    {
        "U.S. Coast Guard": "U.S. Coast Guard"
    },
    {
        ".     The United States ": null
    },
    {
        "Coast Guard": "Coast Guard"
    },
    {
        " has a significant presence in Puerto Rico. Located on what was formerly ": null
    },
    {
        "Ramey Air Force Base": "Ramey Air Force Base"
    },
    {
        ", the Coast Guard maintains what is now referred to as Coast Guard Air Station Borinquen . HH-65C helicopters operate out of Borinquen performing search-and-rescue as well as law-enforcement missions. On a continual basis, Coast Guard fixed-wing airplanes, such as the ": null
    },
    {
        "C-130 Hercules": "C-130 Hercules"
    },
    {
        " search-and-rescue plane, stationed primarily in ": null
    },
    {
        "Florida": "Florida"
    },
    {
        " fly to Puerto Rico to support these missions.     ": null
    },
    {
        "U.S. Coast Guard": "U.S. Coast Guard"
    },
    {
        " cutters visit Puerto Rican waters periodically in their missions of coastal patrol and search-and-rescue. ": null
    },
    {
        "U.S. Navy": "U.S. Navy"
    },
    {
        " ships visit Puerto Rican waters on an as-required basis, just like they visit all American waters, international oceans, and foreign ones, too.     On La Puntilla in ": null
    },
    {
        "Old San Juan": "Old San Juan"
    },
    {
        " the Coast Guard base its small, but capable surface fleet of several  long cutters and other patrol boats. These boats and cutters work hand in hand with the air station responding to any mission that they may be called upon to perform.       A significant number of Puerto Ricans participate as members and work for the U.S. Armed Services, largely as ": null
    },
    {
        "National Guard": "National Guard Of The United States"
    },
    {
        " members and civilian employees. The size of the overall military-related community in Puerto Rico is estimated to be 100,000 individuals. This includes retired personnel.   Fort Buchanan has about 4,000 military and civilian personnel. In addition, approximately 17,000 people are members of the Puerto Rico Army and ": null
    },
    {
        "Puerto Rico Air National Guard": "Puerto Rico Air National Guard"
    },
    {
        ", or the U.S. Reserve forces. Office of the Assistant Secretary of Defense, Reserve Affairs; Official Guard and Reserve Manpower Strengths and Statistics - Summary End Fiscal Year 1996; 1996 Puerto Rican soldiers have served in every US military conflict from ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " to the current military engagement known by the United States and its allies as the ": null
    },
    {
        "War against Terrorism": "War On Terror"
    },
    {
        ".     A number of Puerto Rican colleges and universities have the ": null
    },
    {
        "Reserve Officers Training Corps": "Reserve Officers Training Corps"
    },
    {
        " programs. ": null
    },
    {
        "Army ROTC": "Army Rotc"
    },
    {
        " programs are offered at the ": null
    },
    {
        "American University of Puerto Rico": "American University Of Puerto Rico"
    },
    {
        ", the Caribbean University, the ": null
    },
    {
        "University of Puerto Rico": "University Of Puerto Rico"
    },
    {
        " - Arecibo, the University of Puerto Rico – Bayamon Technological University College, the University of Puerto Rico – Carolina Regional College, the University of Puerto Rico - Cayey, the University of Puerto Rico - Mayagüez, and the University of Puerto Rico - Rio Piedras. Macmillam Reference USA, The College Blue Book, 26th Edition – Tabular Data; Simon & Schuster Macmillam; New York; 1997 ": null
    },
    {
        "Air Force ROTC": "Air Force Rotc"
    },
    {
        " programs are offered at the University of Puerto Rico - Bayamon Technological University College, the University of Puerto Rico - Mayagüez, and the University of Puerto Rico - Rio Piedras.     The U.S. military has sought to form alliances with Hispanic organizations to promote military recruitment. In January 1999, leaders of National Hispanic organizations in collaboration with the U.S. Army held the Hispanic Leadership Summit 99. The Education and Career Opportunities for Hispanic Youth in Americas Army summit included the participation of leaders of the US Army as well as leaders of national Hispanic organizations including ASPIRA, the Hispanic Association of Colleges and Universities , the ": null
    },
    {
        "League of United Latin American Citizens": "League Of United Latin American Citizens"
    },
    {
        " , the National Association of Hispanic Publications , the National Association of Latino Elected and Appointed Officials , the National Council of La Raza , SER jops for progress, and the members of the Congressional Hispanic Caucus. At the summit, the director of the LULAC National Educational Service Center , Richard Royball commented, Based on our mutually beneficial partnership, we would encourage other Hispanic organizations to ally themselves with the US Army. Dickey, Connie E., Sgt 1st Class; Hispanic Youth Meet Army Leaders;  ": null
    },
    {
        "LNESC": "Lnesc"
    },
    {
        " promotes military recruitment in educational service centers in several US cities and in ": null
    },
    {
        "Puerto Rico": "Puerto Rico"
    },
    {
        ". Comité Pro Rescate y Desarrollo de Vieques; Testimony before the United States Committee on Energy and Natural Resources; Washington, DC; May 6, 1999       The US military installations in Puerto Rico are part of the US Atlantic Command . LANTCOM has authority over all US military operations that take place throughout the Atlantic. Puerto Rico has been seen as crucial in supporting LANTCOMs mission. Both the Naval Forces Caribbean and the Fleet Air Caribbean were formerly based at the Roosevelt Roads Naval Station. The NFC has authority over all US Naval activity in the waters of the Caribbean while FAIR has authority over all US military flights and air operations over the Caribbean. With the closing of the Roosevelt Roads and Vieques Island training facilities, the US Navy has basically exited from Puerto Rico, except for the ships that steam by, and the only significant military naval presence in the island is the ": null
    },
    {
        "U.S. Navy Reserve": "U.S. Navy Reserve"
    },
    {
        " Naval Operational Support Center Puerto Rico at ": null
    },
    {
        "Fort Buchanan": "Fort Buchanan, Puerto Rico"
    },
    {
        ", the Puerto Rican Army and Air National Guards. The ": null
    },
    {
        "U.S. Coast Guard": "U.S. Coast Guard"
    },
    {
        " maintains presence at ": null
    },
    {
        "Coast Guard Air Station Borinquen": "Coast Guard Air Station Borinquen"
    },
    {
        " and ": null
    },
    {
        "Coast Guard Station San Juan": "Coast Guard Station San Juan"
    },
    {
        ".     The U.S. Navys largest training area for the U.S. Atlantic Fleet used to be in Puerto Rico and in the ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        " surrounding the island, but this was ended after President ": null
    },
    {
        "George W. Bush": "George W. Bush"
    },
    {
        " ordered the closure of the Roosevelt Roads Naval Station and the Vieques Island training grounds.     Through the years, the ": null
    },
    {
        "United States": "United States"
    },
    {
        " had conducted several military training exercises in Puerto Rico, the largest of these being Operation Springboard and Operation Readex. These exercises included thousands of personnel and involve air, sea, and land operations, and include training with live ammunition.     On top of training exercises, the US used Puerto Rico as a base to rehearse and launch military operations in Latin America and throughout the world. Operations launched from Puerto Rico include the 1954 intervention in ": null
    },
    {
        "Guatemala": "Guatemala"
    },
    {
        "; the 1965 invasion of the ": null
    },
    {
        "Dominican Republic": "Dominican Republic"
    },
    {
        "; the 1983 invasion of ": null
    },
    {
        "Grenada": "Grenada"
    },
    {
        "; the 1989 invasion of ": null
    },
    {
        "Panama": "Panama"
    },
    {
        "; support of Salvadoran military; preparation for operation Desert Storm and Desert Fox in Iraq; and preparation for the War in ": null
    },
    {
        "Yugoslavia": "Socialist Federal Republic Of Yugoslavia"
    },
    {
        ".     Near Aguada the US marine operates a LF-transmitter with a 367.3 metres tall guyed mast, the tallest man-made object in the Caribbean area ": null
    }
]