[
    {
        "            A military academy or service academy  is an educational institution which prepares candidates for service in the officer corps. It normally provides education in a military environment, the exact definition depending on the country concerned.     Three types of academy exist: pre-collegiate-level institutions awarding academic qualifications, university-level institutions awarding ": null
    },
    {
        "bachelors degree": "bachelors degree"
    },
    {
        " level qualifications, and those ": null
    },
    {
        "preparing": "officer training"
    },
    {
        " officer cadets": "officer cadet"
    },
    {
        " for ": null
    },
    {
        "commissioning": "commissioned officer"
    },
    {
        " into the ": null
    },
    {
        "armed services": "armed services"
    },
    {
        " of the ": null
    },
    {
        "state": "state"
    },
    {
        ".     A ": null
    },
    {
        "naval academy": "naval academy"
    },
    {
        " is either a type of military academy  or is distinguished from one . In U.S. ": null
    },
    {
        "usage": "usage"
    },
    {
        ", the ": null
    },
    {
        "United States Military Academy": "united states military academy"
    },
    {
        " and the ": null
    },
    {
        "United States Naval Academy": "united states naval academy"
    },
    {
        " are both ": null
    },
    {
        "service academies": "united states service academies"
    },
    {
        ".       The first military academies were established in the 18th century to provide future officers for technically specialized corps, such as ": null
    },
    {
        "engineers": "military engineer"
    },
    {
        " and ": null
    },
    {
        "artillery": "artillery"
    },
    {
        ", with scientific training.     The ": null
    },
    {
        "Royal Danish Naval Academy": "royal danish naval academy"
    },
    {
        " was set up in 1701, making it the oldest military academy in existence.  The ": null
    },
    {
        "Royal Military Academy, Woolwich": "royal military academy, woolwich"
    },
    {
        " was set up in 1741, after a false start in 1720 because of a lack of funds,  as the earliest military academy in Britain. Its original purpose was to train cadets entering the ": null
    },
    {
        "Royal Artillery": "royal artillery"
    },
    {
        " and ": null
    },
    {
        "Royal Engineers": "royal engineers"
    },
    {
        ". In France, the École Royale du Génie at ": null
    },
    {
        "Mézières": "charleville-mézières"
    },
    {
        " was founded in 1748, followed by a non-technical academy in 1751, the ": null
    },
    {
        "École Royale Militaire": "école militaire"
    },
    {
        " offering a general military education to the nobility. French military academies were widely copied in ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ", ": null
    },
    {
        "Austria": "austrian empire"
    },
    {
        ", ": null
    },
    {
        "Russia": "russian empire"
    },
    {
        " and even minor powers, including ": null
    },
    {
        "Turin": "turin"
    },
    {
        " and the ": null
    },
    {
        "Kingdom of Savoy": "kingdom of savoy"
    },
    {
        ", in the late 18th century.     By the turn of the century, under the impetus of the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        " and the strain that the armies of Europe subsequently came under, military academies for the training of commissioned officers of the army were set up in most of the combatant nations. These military schools had two functions: to provide instruction for serving officers in the functions of the efficient staff-officer, and to school youngsters before they gained an officers commission.  The ": null
    },
    {
        "Kriegsakademie": "prussian military academy"
    },
    {
        " in Prussia was founded in 1801 and the ": null
    },
    {
        "École spéciale militaire de Saint-Cyr": "école spéciale militaire de saint-cyr"
    },
    {
        " was created by order of Napoleon Bonaparte in 1802 as a replacement for the École Royale Militaire of the ": null
    },
    {
        "Ancien Régime": "ancien régime"
    },
    {
        " .     The ": null
    },
    {
        "Royal Military College, Sandhurst": "royal military college, sandhurst"
    },
    {
        ", in England was the brainchild of ": null
    },
    {
        "John Le Marchant": "john le marchant"
    },
    {
        " in 1801,   Defence Academy who established schools for the military instruction of officers at ": null
    },
    {
        "High Wycombe": "high wycombe"
    },
    {
        " and ": null
    },
    {
        "Great Marlow": "great marlow"
    },
    {
        ", with a grant of £30,000 from ": null
    },
    {
        "Parliament": "parliament of the united kingdom"
    },
    {
        ". The two original departments were later combined and moved to Sandhurst. In the United States, the military academy at ": null
    },
    {
        "West Point": "west point"
    },
    {
        " was founded in 1802 and became popular after the Mexican-American War.            A military school teaches children of various ages  in a military environment which includes training in military aspects, such as drill. Many military schools are also ": null
    },
    {
        "boarding school": "boarding school"
    },
    {
        "s, and others are simply ": null
    },
    {
        "magnet schools": "magnet school"
    },
    {
        "in a larger school system. Many are privately run institutions, though some are public and are run either by a public school system  or by a state.     A common misconception results because some states have chosen to house their juvenile criminal populations in higher-security boarding schools that are run in a manner similar to military boarding schools. These are also called ": null
    },
    {
        "reform school": "reform school"
    },
    {
        "s, and are functionally a combination of school and prison. They attempt to emulate the environment of military boarding schools in the belief that a strict structured environment can reform these children. This may or may not be true. However, their environment and target population are different from those of military schools. Linton Hall Cadet, Linton Hall Military School Memories: One cadets memoir, Arlington, Virginia.: Scrounge Press, 2014  describes a military school for boys ages 6-16.     Popular culture sometimes shows parents sending or threatening to send unruly children off to military school  to teach them good behavior , while other fictional depictions dont show military academies as threats or punishment .       A college-level military academy is an institute of higher learning of things military. It is part of a larger system of ": null
    },
    {
        "military education and training": "military education and training"
    },
    {
        " institutions. The primary educational goal at military academies is to provide a high quality education that includes significant coursework and training in the fields of ": null
    },
    {
        "military tactics": "military tactics"
    },
    {
        " and ": null
    },
    {
        "military strategy": "military strategy"
    },
    {
        ". The amount of non-military coursework varies by both the institution and the country, and the amount of practical military experience gained varies as well.     Military academies may or may not grant university degrees. In the U.S., graduates have a major field of study, earning a ": null
    },
    {
        "Bachelors degree": "bachelors degree"
    },
    {
        " in that subject just as at other universities. However, in British academies, the graduate does not achieve a university degree, since the whole of the one-year course is dedicated to military training.     There are two types of military academies: national and state/private-run.   Graduates from national academies are typically commissioned as officers in the countrys military. The new officers usually have an obligation to serve for a certain number of years. In some countries all military officers train at the appropriate academy, whereas in others only a percentage do and the service academies are seen as institutions which supply service-specific officers within the forces .   State or private-run academy graduates have no requirement to join the military after graduation, although some schools have a high rate of graduate military service. Today, most of these schools have ventured away from their military roots and now enroll both military and civilian students. The only exception in the United States is the ": null
    },
    {
        "Virginia Military Institute": "virginia military institute"
    },
    {
        " which remains all-military.          ": null
    },
    {
        "National Military Academy of Afghanistan": "national military academy of afghanistan"
    },
    {
        " Officer Candidate School, Kabul": "officer candidate school, kabul"
    },
    {
        "       Skanderbeg Military University": "skanderbeg military university"
    },
    {
        " Army Military Academy": "military academy"
    },
    {
        " National Air Force Academy": "national air force academy"
    },
    {
        " Naval Academy": "naval academy of angola"
    },
    {
        "          Argentine Army": "argentine army"
    },
    {
        " National Military College": "national military college"
    },
    {
        " genti": "genti"
    },
    {
        "Naval Military School Military Aviation School           formerly the ": null
    },
    {
        "Baku Higher Combined Arms Command School": "baku higher combined arms command school"
    },
    {
        "     BUPBNCCAFMCBIPSOT     ": null
    },
    {
        "lgi": "lgi"
    },
    {
        " Colegio Militar del Ejército de Bolivia AMAN": null
    },
    {
        "a": "a"
    },
    {
        "SCMBMGRSEscola NavalAFAAir Force AcademyEPCAr     RMCCCMRRRMCEditededitorCADTCRCAF": null
    },
    {
        "tar": "tar"
    },
    {
        " ech RepublicUniversity of Defen": "ech republicuniversity of defen"
    },
    {
        "              Maanpuolustuskorkeakouludefunct      ESM, literally the Special Military School of St Cyr ": null
    },
    {
        "Brittany": "brittany"
    },
    {
        "EMIAECAEOGNXalso one of the newestStaff schoolWar Schoole.g. to command battalion or regimentArmy Higher Education CollegeAdvanced Staff CourseHigher Technical and Scientific EducationCenter for Advanced Military StudiesNDAGAF": null
    },
    {
        "ensburg-Mürwik 20": "ensburg-mürwik 20"
    },
    {
        "officers schoolsschool of weaponsafter at least three years of servicesecond lieutenant  ": null
    },
    {
        "lita": "lita"
    },
    {
        "   AthensSuccessor of ": null
    },
    {
        "Royal Hungarian Ludovica Military Academy": "ludovica military academy"
    },
    {
        ", which founded in 1808": null
    },
    {
        "d": "d"
    },
    {
        " NDAIMAOTAINA ArmyMA": null
    },
    {
        "Indonesian National Armed Forces": "indonesian national armed forces"
    },
    {
        "a two or three-star officer in billetAkademi Militer abbreviated AkmilAkademi Angkatan Laut abbreviated AALAkademi Angkatan Udara abbreviated AAUcadets/midshipman": null
    },
    {
        "Second Lieutenant": "second lieutenant"
    },
    {
        "Associate degree, 4th GradeCadet Private4 monthsCadet Corporal8 monthsCadet SergeantCadet Second Sergeant MajorCadet First Sergeant Major AKPOL Mabes PolriArmy, Naval, and Air ForceMabes TNI": null
    },
    {
        "Central Java": "central java"
    },
    {
        "Kapolri": null
    },
    {
        "Persian": "persian language"
    },
    {
        ": دانشگاه افسری امام علی; ": null
    },
    {
        "acronym": "acronym"
    },
    {
        ":  دا اف, DĀʿAF Persian : دانشکده افسریonly for Classical and Scientific Liceum, starting from grade 10     University levelMedical, university levelfor each of Ground, Maritime and Air Self-defense forces ": null
    },
    {
        "zakhst": "zakhst"
    },
    {
        "  formerly the Alma-Ata Higher All-Arms Command Schooluntil 2011   ": null
    },
    {
        "Army": "republic of korea army"
    },
    {
        "    lays": "lays"
    },
    {
        "Maktab Tentera DirajaUniversity Pertahanan Nasional Malaysiafoundation, bachelors degree, masters degree, PhD and specialist coursesMaktab Pertahanan Angkatan TenteraOCSMaktab Turus Angkatan TenteraInstitut Latihan Kesihatan Angkatan TenteraPusat Latihan Pengaman Malaysia or ": null
    },
    {
        "xi": "xi"
    },
    {
        "  xi": "xi"
    },
    {
        "   ngol": "ngol"
    },
    {
        "     anm": "anm"
    },
    {
        "OTS": null
    },
    {
        "anm": "anm"
    },
    {
        "NDC ": null
    },
    {
        "therlan": "therlan"
    },
    {
        "  therlan": "therlan"
    },
    {
        "NZ Army": "nz army"
    },
    {
        "RNZAF": "rnzaf"
    },
    {
        "Norwegian ArmyRoyal Norwegian NavyRoyal Norwegian Air ForceJointCivil Service/Very senior officers public sector        Peruvian ArmyPeruvian NavyPeruvian Air ForceNational Police of PeruWEST POINT": null
    },
    {
        "ilippin": "ilippin"
    },
    {
        "      499944": "499944"
    },
    {
        "rtug": "rtug"
    },
    {
        " rtug": "rtug"
    },
    {
        "Universitatea Națională de Apărare Carol I Academia Tehnică Militară Air Forces Academy ": null
    }
]