[
    {
        "Military incompetence refers to incompetencies and failures of military organisations, whether through incompetent individuals or through a flawed institutional culture.     The effects of isolated cases of personal incompetence can be disproportionately significant in military organisations. Strict ": null
    },
    {
        "hierarchies": "hierarchies"
    },
    {
        " of command provide the opportunity for a single decision to direct the work of thousands, whilst an ": null
    },
    {
        "institutional culture": "institutional culture"
    },
    {
        " devoted to following orders without debate can help ensure that a bad or miscommunicated decision is implemented without being challenged or corrected.     However, the most common cases of military incompetence can be attributable to a flawed ": null
    },
    {
        "organisational culture": "organisational culture"
    },
    {
        ". Perhaps the most marked of these is a ": null
    },
    {
        "conservative": "conservatism"
    },
    {
        " and traditionalist attitude, where innovative ideas or new technology are discarded or left untested. A tendency to believe that a problem can be solved by applying an earlier solution better , be that with more men, more firepower, or simply more  élan , is common. A strict hierarchical system often discourages the ": null
    },
    {
        "devolution": "devolution"
    },
    {
        " of power to junior commanders, and can encourage ": null
    },
    {
        "micromanagement": "micromanagement"
    },
    {
        " by senior officers.     The nature of warfare provides several factors which exacerbate these effects; the ": null
    },
    {
        "fog of war": "fog of war"
    },
    {
        " means that information about the enemy forces is often limited or inaccurate, making it easy for the ": null
    },
    {
        "intelligence process": "military intelligence"
    },
    {
        " to interpret the information to agree with existing assumptions, or to fit it to their own preconceptions and expectations. Communications tend to deteriorate in battlefield situations, with the flow of information between commanders and combat units being disrupted, making it difficult to react to changes in the situation as they develop.     After operations have ceased, military organisations often fail to learn effectively from experience. In victory, whatever methods have been usedno matter how inefficientappear to have been vindicated , whilst in defeat there is a tendency to select ": null
    },
    {
        "scapegoat": "scapegoat"
    }
]