[
    {
        "             was a ": null
    },
    {
        "Japanese": "japanese people"
    },
    {
        " author": "author"
    },
    {
        ", ": null
    },
    {
        "biologist": "biologist"
    },
    {
        ", ": null
    },
    {
        "naturalist": "natural history"
    },
    {
        " and ": null
    },
    {
        "ethnologist": "ethnology"
    },
    {
        ".       Minakata was born in ": null
    },
    {
        "Wakayama": "wakayama, wakayama"
    },
    {
        ", ": null
    },
    {
        "Wakayama Prefecture": "wakayama prefecture"
    },
    {
        ", ": null
    },
    {
        "Japan": "japan"
    },
    {
        ". In 42 he moved to Tokyo, where he entered the preparatory school  Kyōryū Gakkō . The headmaster of Kyōritsu, ": null
    },
    {
        "Takahashi Korekiyo": "takahashi korekiyo"
    },
    {
        ", encouraged Minakata in his botanical studies, and stimulated his interest in the English language. The following year, Minakata passed the entrance exam to Tokyo University Preparatory School , counting among his classmates the novelist ": null
    },
    {
        "Natsume Sōseki": "natsume sōseki"
    },
    {
        ".     At the end of 42 Minakata set off to study in the United States. He arrived in ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " in January of the next year, and he studied there for about six months. He next went to ": null
    },
    {
        "Michigan State Agricultural College": "michigan state university"
    },
    {
        ", where he was accepted, becoming the first Japanese to pass the entrance exam there. These were just the first steps, however, in Minakatas unusually adventurous studies in various parts of the world, which would eventually include Cuba, Haiti, what is now Panama, Venezuela, and England, before returning to Japan.     In addition to his studies in ": null
    },
    {
        "slime mould": "slime mould"
    },
    {
        "s, Minakata was intensely interested in folklore, religion and natural history. He wrote several papers, including 42 monographs in  Nature . He is famous for discovering many varieties of ": null
    },
    {
        "mycetozoa": "mycetozoa"
    },
    {
        ".     Minakata was also an epileptic, suffering from ": null
    },
    {
        "grand mal seizures": "tonic–clonic seizure"
    },
    {
        ". He was able to predict when he was about to have a seizure due to a sense of ": null
    },
    {
        "déjà vu": "déjà vu"
    },
    {
        ".       Minakata Kumagusu came back to Japan in 42 after 42 years of unique study experience abroad mainly in the U.S. and England. He settled in Wakayama Prefecture, his birthplace, until his death in 42 He lived in Tanabe City from 42 to 42 Minakata devoted his entire life to studies of natural history and folklore, and contributed a number of articles to the British science magazine Nature and the British folklore magazine Notes and Queries. He was also actively involved in anti-shrine-consolidation protests and the nature conservation movement in Japan. He was worshipped as a great scholar with no degree and loved by the locals who called him Minakata Sensei or Minakata-san , while branded by some as an oddball. More than 42 years after his death, Minakatas achievements and life history has been made clear by a number of books and papers including The Complete Works of Minakata Kumagusu and The Diary of Minakata Kumagusu, and the research is still ongoing.       Minakata Kumagusu was born in the castle city of Wakayama on April 42 42 the second son to a hardware dealer Yahei Minakata, 42 and wife Sumi, 42 and was raised with three brothers and two sisters. Since childhood, he had had extraordinary interests in the natural world and demonstrated a marvelous memory. As early as at the age of seven he transcribed an encyclopedia.     To develop his talent, Yahei, a ": null
    },
    {
        "self-made man": "self-made man"
    },
    {
        ", sent Minakata to the newly opened Wakayama Middle School , which was unconventional for a merchant family those days. Minakatas thirst for knowledge was growing bigger as he at home recited the Chinese classics and transcribed the books that he had learned by heart at a collectors place. That he transcribed Wakan Sansai Zue, an encyclopedia of 42 volumes, and Honzo Komoku, illustrated books of flora, in over five years is a famous episode from this period. At school, however, he remained a low achiever. He would finish lunch early and observe a frog or a crab in the empty lunch box.     After finishing middle school, he went to Tokyo in March 42 The following year he entered the Preparatory School of Tokyo University. Among his colleagues were ": null
    },
    {
        "Masaoka Shiki": "shiki masaoka"
    },
    {
        ", Natsume Sōseki, and Bimyo Yamada, who later became eminent figures of Japanese literature. Again Minakata was not interested in school and spent more time outside the university transcribing books in libraries, visiting zoos and botanic gardens, and collecting artifacts, animals, plants and minerals. At the news that Miles J. Berkeley, a world-famous British cryptogamist, and American botanist Moses A. Curtis had collected 42 species of fungi including slime molds, Minakata decided to produce an illustrated book that would cover more. In February 42 following a failure at the end-of-year exam, he came home and told father that he would go to America. Initially opposed, Yahei finally gave in to his sons enthusiasm and let him go.       Minakata boarded the City of Beijing in ": null
    },
    {
        "Yokohama": "yokohama"
    },
    {
        " in December 42 The next month the ship arrived in San Francisco, and he soon started to study at Pacific Business College just to experience American life .     In August 42 he moved to ": null
    },
    {
        "Lansing, Michigan": "lansing, michigan"
    },
    {
        ", and enrolled at the ": null
    },
    {
        "Michigan State School of Agriculture": "michigan state university"
    },
    {
        ". One night in November 42 however, he was in trouble for a drinking binge with a couple of Japanese and American friends in the dorm. He took the responsibility alone to save others from expulsion and early next morning left for Ann Arbor.     Minakata met bright Japanese students in Ann Arbor, home of the state university. While keeping company with them, he stayed away from university and studied on his own by reading books and collecting plants in the mountains, particularly ": null
    },
    {
        "cryptogam": "cryptogam"
    },
    {
        "s including ": null
    },
    {
        "fungi": "fungus"
    },
    {
        " and ": null
    },
    {
        "lichen": "lichen"
    },
    {
        "s. In October 42 he read a biography of ": null
    },
    {
        "Conrad Gessner": "conrad gessner"
    },
    {
        ", a Swiss naturalist and a leading figure of modern biology, and swore he would become Japans Gessner, which was when his quest for the wonders of cryptogams began.     When he heard from William W. Calkins, a retired American colonel and a collector of lichens, that in Florida there were still many undiscovered plants, Minakata was ready to go. With two microscopes, books, a pistol, insect catchers as well as a medicine box and a plant press that he had just bought in Ann Arbor, Minakata went to Jacksonville in April 42 He collected plants and animals while staying with Jiang, a supportive Chinese vegetable storekeeper. After three months enthusiastically collecting plants and animals, he moved to ": null
    },
    {
        "Key West, Florida": "key west, florida"
    },
    {
        ", then to ": null
    },
    {
        "Havana": "havana"
    },
    {
        ", ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        " in mid-September.     After a month in Havana, a Japanese circus rider suddenly visited him. That encounter brought him to a new adventure of traveling in ": null
    },
    {
        "Port-au-Prince": "port-au-prince"
    },
    {
        ", ": null
    },
    {
        "Caracas": "caracas"
    },
    {
        ", ": null
    },
    {
        "Valencia": "valencia, córdoba"
    },
    {
        ", and ": null
    },
    {
        "Jamaica": "jamaica"
    },
    {
        " with the circus working as a mahouts hand. This enabled him to collect precious fungi and lichens in the West Indies. In January 42 he returned to Jacksonville and worked on the plants he had collected in Florida and Cuba at Jiangs. When Jiang wound up the business in August, Minakata moved to New York. In September he put an end to six years in America and got aboard the City of New York bound for the UK.          After crossing the Atlantic Ocean, the ship arrived at Liverpool. In London, Minakata visited Yoshikusu Nakai, branch manager of the ": null
    },
    {
        "Yokohama Shokin Bank": "yokohama specie bank"
    },
    {
        ", an old friend of the Minakata family from Wakayama. The man handed him a letter from Tsunegusu, one of his younger brothers, about their beloved fathers death. Minakata was totally devastated.     He lived in downtown London where rents were cheap. While working on herbaria and exchanging specimens and letters with William W. Calkins and Allen, he visited the British Museum, the South Kensington Museum and other galleries. He then was introduced to Japanese Asian antique dealer Kataoka Prince. In August 42 Minakata read in Nature magazine, his favorite since his time in U.S., a thesis titled Five articles about the composition of constellations. Its questions inspired him to write a reply.     Kataoka Prince, who had noticed the erudition of the shabby-looking man, introduced him to ": null
    },
    {
        "Sir Augustus Wollaston Franks": "sir augustus wollaston franks"
    },
    {
        ", of the British Museum. Thereafter, Minakata visited the museum often to ask advice from Franks. Using a fragmented dictionary borrowed from his landlady, he completed an article titled  in 42 days. The article was published in Nature, and he suddenly became known among the intelligentsia. He contributed regularly to the magazine after that and also started writing for  Notes and Queries . He continued to contribute a number of articles and letters to the magazines after returning to Japan and won a reputation worldwide as an authority on Oriental studies.     His rising reputation opened the door to friendships with notable figures including ": null
    },
    {
        "Frederick. V. Dickins": "frederick victor dickins"
    },
    {
        ", registrar of the University of London, as well as people from the British Museum including Sir Robert K. Douglas, director of the Oriental Printed Books section and Charles H. Read, the successor to Franks. He visited the British Museum almost every day. While immersing himself in rare books of all ages from East and West, particularly in the fields of archeology, anthropology, folklore and religion, he copied them into notebooks. A collection of 42 thick notebooks from this period called London Extracts is kept in the Minakata residence and the Minakata Kumagusu Museum. The pages are densely covered with tiny letters he put in English, French, German, Italian, Spanish, Portuguese, Greek and Latin.     Douglas, who was impressed with his extensive knowledge, offered Minakata a job at the British Museum, but he declined the offer in light of freedom. Instead, he helped make a catalog of the books and manuscripts of the library and conducted historical research on the Buddhist statues of the museum using his expertise accumulated through reading and transcribing of a large number of books including classics and encyclopedia since childhood.     One of the highlights in London was getting to know ": null
    },
    {
        "Sun Yat-sen": "sun yat-sen"
    },
    {
        ", father of the Chinese Revolution. Minakata put it in his diary how they hit it off straight away on first acquaintance at the Douglass office in the British Museum in March 42 and quickly developed a friendship through visiting each other and talking till late almost every day. The descriptions, though very brief, reveal the closeness between two friends. Their company lasted only four months until Sun had to leave London for Asia in early July.     In October 42 he met Toki Horyu, later the chief abbot of ": null
    },
    {
        "Kōyasan": "mount kōya"
    },
    {
        " temple complex, a relationship that deserves special mention. Minakata and Toki, much senior to him, opened up to each other and exchanged frank opinions about religion. They wrote to each other until later years.     Many famous figures from Japan visited Minakata in London. They all were astonished at his erudition and shocked at his total lack of interest in daily life. Although highly regarded by some scholars, Minakata sometimes experienced discrimination because of his ethnicity, the cause for his frequent reckless behaviors leading up to the departure from the British Museum in December 42 Frequent delay of money expected from the family in Japan forced him to take a job translating the titles for the calligraphy collection at the South Kensington Museum and sell ukiyoe with his friends. High hopes of becoming an assistant professor at the soon-to-be opened Japanology program in Cambridge or Oxford were gone when the plan was turned down. Forced into straitened circumstances, he made a decision in despair to leave the UK, where he had spent eight years. In September 42 Minakata got on board the Awa Maru at the Thames and went home.          In October 42 the Awa Maru arrived at Kobe after a 42-day voyage. Tsunegusu was shocked to see his elder brother appear in a shabby suit made of flimsy fabric like mosquito netting. He also was astounded Minakata had come back with tons of books and specimens but no degree. Minakata found temporary shelter at his brothers in Wakayama.     After a while, Minakata heard that Sun Yat-sen was in the Yokohama settlement as a political refugee and wrote him. In February 42 Sun came to Wakayama. Although the first reunion in four years was disturbed by a police detail, Sun was happy to take risks to see his old friend. As a gift, Sun left his favorite ": null
    },
    {
        "Panama hat": "panama hat"
    },
    {
        ". He later sent Minakata a reference letter addressed to ": null
    },
    {
        "Inukai Tsuyoshi": "inukai tsuyoshi"
    },
    {
        ", his guardian in Japan and later the prime minister. The letter, never used, is kept in the Minakata residence and the hat is on display in the Minakata Kumagusu Museum. Their friendship survived for a while; Sun sent specimens of lichen from Hawaii and Minakata wrote back, but ultimately they drifted apart and never met again. After Suns death, Minakata expressed his sorrow in the reminiscence and wrote: Friendship changes like seasons.       In October 42 Minakata left Wakayama by boat for Katsu’ura, where he lived at the branch of Minakata Sake Distillery, run by brother Tsunegusu, until October 42 In Nachi he spent all his time collecting fungi and algae around the region. One day, while collecting lichen at the Ichino-taki Falls, he met a young man, Shiro Koaze, a shipping company worker. Koaze, as a disciple, was going to help Minakata with research on slime molds all his life. Koaze sent specimens from every port he called as well as offered financial support. Koaze, with his close friend Shigeru Uematsu, backed Minakata materially and spiritually.     Minakata was very active in Nachi. He collected insects and plants, made microscope slides and colored illustrated manuals, read hundreds of books, completed a draft for the English translation of Hojoki: The Ten Square Feet Hut co-authored with ": null
    },
    {
        "Frederick Victor Dickins": "frederick victor dickins"
    },
    {
        ", and proofread Primal Text of Japan also by Dickins. He resumed writing for Nature and Notes and Queries. Embraced by the wildlife in the Kumano Mountains, Minakata, based on his extensive knowledge of the world, studied interaction between the spiritual with the material world, and participated in heated debates on nature and life, including religious one with Horyu Toki. He also completed The Origin of the Swallow-Stone Myth , a study he had planned at the end of the time in UK, that is considered the pinnacle of his research presented in English.       After three years and 42 months research on plants in the Kumano region, Kumagusu left Katsuura in October 42 and walked to ": null
    },
    {
        "Tanabe": "tanabe, wakayama"
    },
    {
        ", collecting specimens on his way. On arrival he immediately fell in love with Tanabe he thought was “a quiet place with nice people, cheap commodities and beautiful weather and the scenery.” He decided to settle, rented a house and started an easy life. He often invited friends and had parties at nearby luxury restaurants and teahouses; hired geishas, drank, sang Dodoitsu and Otsue, his favorite party pieces, and played strange performances.     In the fall of 42 Minakata donated 42 specimens of slime molds to the British Museum. Arthur Lister, president of the British Mycological Society, had them introduced in the Journal of Botany, vol. 42 as The Second Report of Japanese Fungi, following the first report on the specimens sent by Prof. Miyoshi of Tokyo Imperial University. This article, which led Minakata to a new world of friendship with Lister and his daughter Gulielma, was a milestone in his career toward a world-class slime mold researcher.     In July 42 at 42 Minakata married Matsue, 42 the fourth daughter of Munezo Tamura, chief priest of the Tokei Shrine. Tamura, a former samurai of the Kishu-Tokugawa clan, was also a Sinologist whose knowledge of Chinese wisdom had influenced Matsues upbringing. Her late marriage was due to her devotion to father and the destitute family she had supported by teaching sewing and flower arrangement.     In July 42 the couple had their first child, Kumaya. At first sight of his baby boy Minakata wrote: “Stayed awake till dawn watching my baby” and expressed the joy of becoming father. After the birth of Kumaya the marriage was rocky. After Matsue turned to her parents a few times, he gradually reduced alcohol. He kept in his diary every detail of Kumaya, how he moved and talked, which shows his deep love and expectations for his son. Minakata usually woke at 42 am and worked at home from sometime in the afternoon till 42 o’clock next morning sorting specimens, drawing pictures, conducting research, reading and writing. While weaving, Matsue, together with a housemaid, was very nervous about the care of weepy Kumaya. Their daughter Fumie was born in October 42     Minakata resumed copying books around in 42 The extract of Daizokyo, scriptures owned by the ": null
    },
    {
        "Hōrin-ji": "hōrin-ji"
    },
    {
        " Temple, which took full three years, was a particularly demanding job. “To read is to copy. You’ll forget when you just read it, but you’ll never forget when you copy it.” He propagated this belief and put it into practice by himself. The Tanabe Extracts from this period consist of 42 volumes. On top of the contributions he had made to British journals and magazines since coming home, Minakata started writing for journals and newspapers in Japan. Using a lot of citations was his signature style of research papers, but first-hand folklore evidence and antiquities were also included. He used his extraordinary memory and archives accumulated through interviews.          In 42 the government imposed shrine consolidation regulations under which all ": null
    },
    {
        "shrines": "shinto shrine"
    },
    {
        " in a village or a town should be merged. The Wakayama prefectural government pushed hard for the enforcement of the regulations. In Japan there used to be a shrine in each community, however small, which was the centripetal force to unite the people, the provider of recreations and the object of worship, and with very few exceptions, they all stood in deep ": null
    },
    {
        "forest": "forest"
    },
    {
        "s.     Minakata was worried that the consolidations would not only ruin historical buildings and antiquities but, by cutting trees, also damage the scenery and the natural life around them. He contributed an opinion to every edition of a local paper, Muro Shinpo. He also sent objection letters to major papers in Tokyo and Osaka and appealed to leading researchers for support, including Jinzo Matsumura, a notable botanist and professor of Tokyo University, to whom Minakata wrote long letters criticizing the deeds done by the central and prefectural governments. ": null
    },
    {
        "Yanagita Kunio": "kunio yanagita"
    },
    {
        ", then a counselor of the Cabinet Legislation Bureau and later father of Japanese folklore, supported the campaign by disseminating copies of two letters as Minakata Nisho to those who concerned. He was also supported locally by a young ": null
    },
    {
        "Morihei Ueshiba": "morihei ueshiba"
    },
    {
        ".      In August 42 Minakata was arrested for trespassing when he threw a bag of specimens into a meeting held in Tanabe Junior High School . Although drunk, he did it out of rage when not allowed to talk with one of the attendees, a government officer who was in charge of the promotion of the regulations. During 42 days in jail pending trial he read books and hunted slime molds in the building. When released, he refused to leave saying: “This place is quiet with no visitors and cool. I want to stay longer.”     As his enthusiasm moved public opinion, the irrational regulations gradually lost momentum. In 42 42 years from his arrest, the regulations were confirmed useless by the House of Peers and abolished. Ultimately, Minakatas efforts saved a couple of forests, but a number of shrines and forests had become extinct during the decade. He then approached various social movements and public bodies in charge of the national heritage list in order to promote ": null
    },
    {
        "protection of the precious environment": "environmental protection"
    },
    {
        " including the Kashima Island in Tanabe Bay. His battle continued until his last years, which is why he is called a pioneer in ": null
    },
    {
        "ecology": "ecology"
    },
    {
        " today. In February 42 when The Mountain God Loves Stonefish was published in the Journal of the Anthropological Society of Tokyo, Minakata received a letter from ": null
    },
    {
        "Yanagita": "kunio yanagita"
    },
    {
        ". This was when their correspondence between two began.     In July 42 Kumagusus reputation was spread nationwide, following a newspaper report on the announcement by ": null
    },
    {
        "Walter T. Swingle": "walter t. swingle"
    },
    {
        ", head of the Office of Crop Physiology and Breeding investigation of US Department of Agriculture, that they would invite Minakata to the US. Dr. Swingle came to Tanabe in May 42 to announce the appointment in person. Although having intended to accept the offer, he declined it because of a family matter.       In April 42 Minakata obtained a property, now the Minakata residence, under the ownership of Tsunegusu. The large garden became an open-air laboratory to observe plants, frogs, and turtles. The study was a place for writing and microscopic research on plants. The godown was organized into the stacks containing a number of books and materials.     He published numerous research papers about folklore based on previous research papers of natural science already published and articles about shrine consolidation. The more scholars and celebrities he received and the busier he became with his writing, the more often he had to stay home and conduct his botanical research in the backyard. This change enabled him to discover the famous Minakatella longifila Lister & mdash; a new genus of slime mold named by ": null
    },
    {
        "Gulielma Lister": "gulielma lister"
    },
    {
        ", president of the British Mycological Society & mdash; from a persimmon tree in his garden in 42     It was around this time that the governor of Wakayama Prefecture and his friends finished the planning of the Minakata Botanical Institute. The prospectus was drafted by ": null
    },
    {
        "Tanaka Chōzaburō": "chōzaburō tanaka"
    },
    {
        " and promoted by 42 big names including those from the political and literary worlds, including ": null
    },
    {
        "Hara Takashi": "hara takashi"
    },
    {
        ", ": null
    },
    {
        "Ōkuma Shigenobu": "ōkuma shigenobu"
    },
    {
        ", Yorimichi Tokugawa, and Rohan Koda.     Minakata came to Tokyo for the first time in 42 years and spent five months raising money. Day after day he visited notable figures in politics and academia including Prime Minister ": null
    },
    {
        "Takahashi Korekiyo": "takahashi korekiyo"
    },
    {
        " asking for support. He finally collected a considerable sum, but it was less than the prospect amount. He continued his fundraising campaign at home.     The famous ‘Resume’ was written then responding to a request from Yoshio Yabuki, deputy branch manager of ": null
    },
    {
        "Nippon Yusen": "nippon yusen"
    },
    {
        " in Osaka, whom he had asked for donation. The resume, written on 42m long paper using fine strokes, is an autograph of extreme importance to understand the real Minakata and perhaps the longest resume in Japan and the first resume ever known in light of the volume and quality of information it contains.     In March 42 Kumaya became ill and went into a hospital in Wakayama City. After going home to recuperate, Minakata shut the gate against all visitors. This lasted for three years until Kumaya was moved to a hospital in Kyoto in May 42 Fair success of the fundraising in Tokyo was offset in a way by an unfulfilled promise of Tsunegusu, one of the major promoters of the project. He didnt provide 42 yen, his part of donation, which caused a rift between the two brothers. Minakata also had trouble making a living because of expensive medical bills. To lessen the financial burden, Minakata published three books in 42 The books, compilations of theses previously published in various journals, gave the reader an insight into his arguments consistent throughout the years and revealed again his erudition, which aroused the admiration of the public.       Emperor Hirohito, also a biologist, had shown a strong interest in slime molds since he was the Prince Regent. As the Prince, he had read A Monograph of the Slime Molds by Gulielma Lister and told Dr. Hirotaro Hattori of the National Biological Research Institute of his wish to see the specimens. Having learned this interest, Shiro Koaze approached Minakata and his friends from Tokyo University. In November 42 the team prepared and presented Prince Hirohito with a collection of 42 specimens of 42 genera of Japanese slime molds. It bore the signatures of Koaze as the presenter and Minakata as the selector.     In March 42 Dr. Hattori secretly visited and requested Minakata to give a lecturer on slime molds to Hirohito, then Emperor, in his future royal visit to the Wakayama region. Minakata telegraphed his acceptance. With no precedent for a commoner giving an imperial lecture, he soon became the center of the public attention and extremely busy preparing specimens. On June 42 42 it had been raining since morning. Minakata headed for Kashima Island in a frock coat he had bought in America and kept for years. After taking the Emperor for a walk in the woods on the island, Minakata, while showing specimens, gave a 42-minute lecture, on board the ": null
    },
    {
        "royal ship Nagato": "japanese battleship nagato"
    },
    {
        ", on ": null
    },
    {
        "slime mold": "slime mold"
    },
    {
        "s and marine life to His Majesty. He also presented the Emperor with gifts including 42 specimens of slime molds kept in empty taffy boxes.     A chamberlain recalled: Rumors of his eccentricity had made me doubt his capability, but my worry turned out to be utterly groundless when I met this well-mannered and polite man. He was a gentleman who had experience of living abroad as well as a traditional Japanese who showed a respect for the Imperial Family. It was the most glorious day in Minakatas life. In the afternoon, he took pictures of him and Matsue in their finest attire at a studio and shared the moment with his relatives and close friends by giving sweets he had received from the Imperial Household. Next year, in commemoration of the Emperors visit to Kashima, a monument was erected on the edge of a dense wood near the point where His Majesty had landed. Inscribed on the monument is a poem Minakata wrote hoping that the island would be protected forever by the benevolence and the power of the Emperor. In May 42 more than 42 years later, Their Majesties The Emperor and Empress visited southern Wakayama again. Inspired by a view of Kashima from a hotel room on the Shirahama Beach the Emperor composed a ": null
    },
    {
        "waka poem": "waka"
    },
    {
        ":          The poem is inscribed on the monument erected in front of the Minakata Kumagusu Museum overlooking the Kashima island.       The Sino-Japanese War broke out in 42 as the war escalated, the peoples life was impoverished. Minakata was not an exception. The loss of his old friends gave him an additional blow. He gradually ruined his health and stayed in bed. Although collapsing many times, he continued to work towards the completion of Nihon , writing notes and giving advice to his colleagues.     In December 42 soon after the Pacific War had erupted, Minakata was in a critical condition. On the 42 December he murmured, “I can see purple flowers blooming on the ceiling” and closed 42 years of a life filled with ups and downs. He was buried at the Kouzanji Temple in Tanabe City overlooking Kashima island.             Young Minakata leaped out into the wider world when Japan was going through a metamorphosis from a feudal state into a westernized modern country. He went to America then to UK searching for a place where anybody, regardless of class, could study freely. He found it in the British Museum, where he put his heart and soul into research while buried in hundreds of books, arts and crafts and antiquities from the East and the West.     With The Constellations in the Far East as a start, he contributed a total of 42 theses to Nature and hundreds of articles and essays to the folklore magazine Notes and Queries. This large number of articles shows he won an important place in the British academia.     He was blessed with an extraordinary memory and ": null
    },
    {
        "manipulated more than 42 languages": "polyglotism"
    },
    {
        ". In addition, plenty of experience of copying books enabled him to master how to scrutinize empirical documents and the methods of comparative cultural studies, which was the basis of his unbounded capacity in writing. Junishiko , one of his most important works, is an example.     After coming back to Japan he wrote a number of articles in quick succession for Japanese journals and magazines. Discussions of historical evidence from the East and the West with Kunio Yanagita, as shown in their abundant correspondence, had a great influence to the birth and the development of Japanese folklore studies.     The Illustrated Book of Bionomics of Japanese Fungi, one of his greatest achievements and the embodiment of his admiration mixed with rivalry to Curtis and Berkeley, made a huge contribution to the development of the study of fungi and thus deserves international recognition. It covers 42 species with 42 pictures. Although the entries were 42 less than planned, the book also introduced his extensive research on fungi, slime molds and algae including Minakatella longifila Lister, enigmatic behavior of slime molds and parasitic algae on fish.     His advocacy of anti-shrine-consolidation protests had its roots in his deepest anger towards the loss of inhabitants’ spiritual hubs and the extinction of the landscape with which people felt an affinity. The ecological relation between nature and human beings, which Minakata looked at through the studies of biology, folklore, ethnology and religion, is something to keep in mind.     Shinzo Koizumi, late chancellor of ": null
    },
    {
        "Keio University": "keio university"
    }
]