[
    {
        "             Minden is a town of about 42 inhabitants in the north-east of ": null
    },
    {
        "North Rhine-Westphalia": "north rhine-westphalia"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". The town extends along both sides of the ": null
    },
    {
        "River Weser": "river weser"
    },
    {
        ". It is the capital of the district  of ": null
    },
    {
        "Minden-Lübbecke": "minden-lübbecke"
    },
    {
        ", which is part of the ": null
    },
    {
        "region of Detmold": "detmold"
    },
    {
        ". Minden is the historic political centre of the cultural region of ": null
    },
    {
        "Minden Land": "minden land"
    },
    {
        ". It is widely known as the intersection of the ": null
    },
    {
        "Mittelland Canal": "mittelland canal"
    },
    {
        " and the River Weser. The town is over 42 years old and has yet some buildings in the ": null
    },
    {
        "Weser Renaissance": "weser renaissance"
    },
    {
        " style, in addition to its architecturally symbolic 42-year-old cathedral.              Minden is a town in the northeastern part of the state of ": null
    },
    {
        "North Rhine-Westphalia": "north rhine-westphalia"
    },
    {
        ". It lies on the ": null
    },
    {
        "River Weser": "river weser"
    },
    {
        ", north of the Porta Westfalica gap between the ridges of the ": null
    },
    {
        "Weser Hills": "weser hills"
    },
    {
        " and ": null
    },
    {
        "Wiehen Hills": "wiehen hills"
    },
    {
        ". The Weser leaves the ": null
    },
    {
        "Weser Uplands": "weser uplands"
    },
    {
        " and flows into the ": null
    },
    {
        "North German Plain": "north german plain"
    },
    {
        ". The town centre lies  to the north, on a plateau on the western side of the river. The small Bastau stream flows into the Weser from the west near the town centre. The edge of the plateau marks the transition from the ": null
    },
    {
        "Middle Weser Valley": "middle weser valley"
    },
    {
        " to the ": null
    },
    {
        "Lübbecke Loessland": "lübbecke loessland"
    },
    {
        ". This marked change in terrain divides the upper town from the lower town, and marks the boundary between two ecological zones.     The formation of the town was strongly influenced by the ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n fortress of Minden, whose now-demolished fortifications have been turned into a green belt around the town centre.     Minden is  NE of ": null
    },
    {
        "Bielefeld": "bielefeld"
    },
    {
        ",  W of ": null
    },
    {
        "Hanover": "hanover"
    },
    {
        ",  S of ": null
    },
    {
        "Bremen": "bremen"
    },
    {
        " and  E of ": null
    },
    {
        "Osnabrück": "osnabrück"
    },
    {
        ". It acted as the historic and political focus for the surrounding countryside.     The Mittelland Canal traverses the town from east to west, while the Weser flows from south to north. These waterways cross in the northern area of the town at the ": null
    },
    {
        "Minden Aqueduct": "minden aqueduct"
    },
    {
        " .     The lowest part of the town is in the district of Leteln, at , while the highest part is in the district of Haddenhausen at . The altitude of the town is given officially as , based on the elevation of the town hall.     The town covers an area of . It extends  from north to south and  from east to west.       Clockwise from north          Minden consists of 42 subdistricts:              Evidence of settlements in various parts of the town suggests that Minden has been settled since the 42rd century A.D. The Minden area shows continuing settlement activity from the 42st to the 42th century. The area then belonged to the Rhine-Weser-Germanic development sphere. This is apparent from the imperial age burial fields at Minden-Römerring and Porta Westfalica-Costedt.     The first mention of Minden is a record in the Franconian Imperial Annals  of ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        " holding an imperial assembly in 42 Charlemagne founded a bishopric in Minden around the year 42 The rights to hold a market, to mint coins and to collect customs duties were granted in 42 Until the beginning of the 42th century, the bishop appointed the leader and administrator of the town, with the title of Wichgraf. The citizens of Minden and their Council obtained independence from the rule of the bishop around 42 and received a town charter. They utilised these new rights to begin trading independently from the church. The profits from this led to the further growth of the town. Minden was a member of the ": null
    },
    {
        "Hanseatic League": "hanseatic league"
    },
    {
        " during the Middle Ages. The increased self-confidence of the citizens of Minden was demonstrated by the construction of the town hall, probably adjoining the separately governed cathedral precinct. As a result, Bishop Gottfried von Waldeck moved his official residence from Minden to ": null
    },
    {
        "Petershagen": "petershagen"
    },
    {
        " in 42–42       The introduction of ": null
    },
    {
        "the Reformation": "the reformation"
    },
    {
        " to Minden in 42 created much conflict in the town, leading to the formation of a 42-man unit that took over the role of town regiment. Nicholas Krage announced Mindens new church order based on ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        "s principles from the pulpit of St. Martins Church  on 42 February 42     There were 42 prosecutions for ": null
    },
    {
        "witchcraft": "witchcraft"
    },
    {
        " between 42 and 42 As in nearby regions, almost all those sentenced were women.     Imperial troops occupied Minden from 42 to 42 during the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        " . Protestant Swedish troops laid siege to Minden and captured it in 42 Queen ": null
    },
    {
        "Christina of Sweden": "christina of sweden"
    },
    {
        " granted full sovereignty in internal and external affairs to Minden.     The ": null
    },
    {
        "Peace of Westphalia": "peace of westphalia"
    },
    {
        " in 42 gave the possession of Minden to ": null
    },
    {
        "Brandenburg-Prussia": "brandenburg-prussia"
    },
    {
        ", and it remained with ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        " until its break-up in 42 The rule of ": null
    },
    {
        "Frederick I of Prussia": "frederick i of prussia"
    },
    {
        " ended the 42-year self-determination or independence of the citizens of Minden. The 42-man unit  was dissolved by the king and the town council was replaced by a town authority consisting of 42 businessmen, 42 tradesmen and eight representatives of the community who were elected for life.     The ": null
    },
    {
        "Battle of Minden": "battle of minden"
    },
    {
        " took place in front of the gates of Minden on 42 August 42 during the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        ". The allies of ": null
    },
    {
        "Great Britain": "kingdom of great britain"
    },
    {
        ", led by ": null
    },
    {
        "Duke Ferdinand": "duke ferdinand of brunswick"
    },
    {
        " of ": null
    },
    {
        "Brunswick": "duchy of brunswick"
    },
    {
        ", defeated the French and their allies in a decisive battle. The region remained Prussian and the adjacent ": null
    },
    {
        "Kingdom of Hanover": "kingdom of hanover"
    },
    {
        " remained in the possession of the British king.     The town was capital of the Territory of ": null
    },
    {
        "Minden-Ravensberg": "minden-ravensberg"
    },
    {
        " from 42 to 42 and capital of the ": null
    },
    {
        "District of Minden": "minden"
    },
    {
        " from 42 to 42       Until 42 the area around the cathedral was governed by clerical rulers as territory of its own right in contrast to other town quarters. In course of the ": null
    },
    {
        "War of the Fourth Coalition": "war of the fourth coalition"
    },
    {
        " French troops occupied the town on 42 November 42 The town then became part of the ": null
    },
    {
        "Kingdom of Westphalia": "kingdom of westphalia"
    },
    {
        " and, later, an actual part of France until 42 After the defeat of Napoleon at the ": null
    },
    {
        "Battle of Leipzig": "battle of leipzig"
    },
    {
        ", French troops abandoned Minden and it returned to Prussia. Minden Fortress was rebuilt in the time of district administrator  von Arnim, from 42 to 42 This reconstruction of the fortifications had serious negative consequences because it hindered economic development, which almost totally by-passed Minden; other smaller towns like ": null
    },
    {
        "Bielefeld": "bielefeld"
    },
    {
        " and ": null
    },
    {
        "Dortmund": "dortmund"
    },
    {
        " laid the foundation for their greater subsequent growth.     The Prussian era was very influential for the municipal shaping and development of Minden. Many buildings from this era remain. The town remained a Prussian fortress until 42 when the  Reichstag  passed the law to remove the fortress status of Minden along with Stettin, Erfurt, Wittenber, Kosel, Graudenz, Kolberg and Stralsund. The fortress walls were razed at this time permitting the town to catch up economically. However, it was never able to regain its former political and economic importance.       The ": null
    },
    {
        "November Revolution": "german revolution of 1918–19"
    },
    {
        " of 42 passed relatively quietly in Minden. Small disturbances occurred in a few barracks of the Minden Garrison on 42 and 42 November 42 These were calmed down by representatives of the ": null
    },
    {
        "Social Democratic Party of Germany": "social democratic party of germany"
    },
    {
        " and by union representatives. A council of workers and soldiers took control in the afternoon of 42 November. The situation in Minden was more critical during the  Kapp Putsch  of March 42 The representatives of the SPD, ": null
    },
    {
        "German Democratic Party": "german democratic party"
    },
    {
        " and USDP parties on the Minden Town Council declared themselves loyal to President ": null
    },
    {
        "Friedrich Ebert": "friedrich ebert"
    },
    {
        " and the ": null
    },
    {
        "Bauer": "gustav bauer"
    },
    {
        " government, and only the ": null
    },
    {
        "Centre Party": "centre party"
    },
    {
        " remained non-committal. The Workers Council directly intervened in the towns administration for the first time on 42 March 42 The newspapers Mindener Tageblatt and Mindener Zeitung were placed under pre-censorship and then closed because they had released press releases from the putschists. Such measures were unprecedented for Minden and were not even experienced during the November Revolution of 42 President Friedrich Ebert and Chancellor Bauer confirmed the authority of the Minden Workers Council in a telegramme on 42 March: The highest executive authority will be transferred to the Workers Council of Minden. It should take and enforce all measures to secure constitutional government. Signed Ebert Reichspräsident, Signed Bauer Reichskanzler .   The population and political parties became even more polarized after the failure of the putsch than before. The assassination of Foreign Minister ": null
    },
    {
        "Walther Rathenau": "walther rathenau"
    },
    {
        " on 42 June 42 resulted in serious rioting in Minden. A demonstration of 42 people in support of the government was held in the market square on 42 June. Many demonstrators went through the town afterwards and searched apartments, businesses and taverns for signs of reactionaries and nationalistically-oriented Minden citizens. Many pictures and statues of the former ": null
    },
    {
        "emperor": "wilhelm ii, german emperor"
    },
    {
        ", as well as black-white-red flags and other such objects were smashed or burned. On 42 July, the Mindener Zeitung described these disturbances as Russian conditions .       During World War II, underground factories were built in the ": null
    },
    {
        "Weser Hills": "weser hills"
    },
    {
        " and ": null
    },
    {
        "Wiehen Hills": "wiehen hills"
    },
    {
        " near Minden. ": null
    },
    {
        "Slave labour": "slave labour"
    },
    {
        "ers from a nearby ": null
    },
    {
        "concentration camp": "concentration camp"
    },
    {
        " were forced to produce weapons and other war ": null
    },
    {
        "materiel": "materiel"
    },
    {
        ". After the war the machinery was removed by American troops and the entrances sealed.     Most of the Jewish citizens of Minden were deported and dispossessed. The Stolpersteine were built on Mindens pavements as a memorial to them.     Minden sustained severe damage from bombardment during World War II. These attacks were minor during the early phase of the war. The raid on 42 October 42 on the canal aqueduct resulted in the breaching of the ": null
    },
    {
        "Mittelland Canal": "mittelland canal"
    },
    {
        " and the drowning of numerous workers in a nearby air raid shelter. The last and most devastating air raid was conducted by ": null
    },
    {
        "United States Army Air Forces": "united states army air forces"
    },
    {
        " Boeing B42 Flying Fortress": "boeing b-17 flying fortress"
    },
    {
        " aircraft on 42 March 42 This almost completely destroyed the town centre, including the town hall and cathedral, and resulted in the death of over 42 people. The advance of ": null
    },
    {
        "Allied": "allies of world war ii"
    },
    {
        " troops toward the end of the war caused those ": null
    },
    {
        "Nazis": "nazi germany"
    },
    {
        " who were running the town, to flee across the ": null
    },
    {
        "Weser": "weser"
    },
    {
        " to the east. Almost all the bridges over the Weser and Mittelland Canal as well as the aqueduct over the Weser were blown up by the ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        " in a futile attempt to delay the Allied advance. The town was occupied by the ": null
    },
    {
        "42st Canadian Airborne Battalion": "1st canadian parachute battalion"
    },
    {
        " of the ": null
    },
    {
        "42rd Parachute Brigade": "3rd parachute brigade"
    },
    {
        " on 42 April 42 the units of the American ": null
    },
    {
        "42th Army": "united states 9th army"
    },
    {
        " having been delayed in their attack from ": null
    },
    {
        "Bad Oeynhausen": "bad oeynhausen"
    },
    {
        ".     The town administration resumed its work on 42 April 42 on a provisional basis. The area became part of the ": null
    },
    {
        "British Occupation Zone": "british occupation zone"
    },
    {
        ".     The creation of the state of ": null
    },
    {
        "North Rhine-Westphalia": "north rhine-westphalia"
    },
    {
        " led to Minden losing its position as a ": null
    },
    {
        "regional capital": "regierungsbezirk"
    },
    {
        " to ": null
    },
    {
        "Detmold": "detmold"
    },
    {
        " in 42 Urban renewal was carried out in the 42s, with new structures replacing buildings that were deemed dilapidated. The removal of timbered houses as part of this renewal was later regretted. The new town hall extension blocked the scenic view of the cathedral from the arches of the old town hall. A controversial 42 resolution by the town council proposed the demolition of the town hall extensions, a new shopping mall and restoration of the view toward the cathedral. However, in a referendum, a 42% majority opposed this plan.       On 42 January 42 the previously separate communities of Aminghausen, Bölhorst, Dankersen, Dützen, Haddenhausen, Hahlen, Häverstädt, Kutenhausen, Leteln, Meißen, Päpinghausen, Stemmer, Todtenhausen as well as parts of Barkhausen, Hartum and Holzhausen II were incorporated into the town of Minden. At the same time the new district  of Minden-Lübbecke was created from the former districts of Minden and Lübbecke. Minden remains the capital. This restructuring was carried out under the Bielefeld law . A new district administration building is being constructed south of the town centre on the site of an old barracks; the old administrative building is to be used as a community archive.     The shoreline of the Weser was improved in 42 by extending the promenade from the Fischerstadt . The Glacis, a park-like open space in front of the old fortifications, which was important as a green belt, was altered and made more accessible. The old town wall fronting the Fischerstadt was restored to its former height. The departure of British troops in 42 allowed the integration of the old engineer troop training site on the Weser into the Glacis. This enhanced this nearby recreation area. The opposite shore area  has been made accessible by a footbridge. This improves access to a large parking area and festival site.     The development of the town centre was being debated at the beginning of the 42st century. The town developed a master plan for the development of the town centre in 42 which was passed by the town council in June.                The Reformation was carried out in Minden between 42 and 42 Nicholas Krage authored the new evangelical church rules for the town in 42 The town council of Minden approved these new rules for all citizens in 42 The town of Minden contains six evangelical parishes today: St. Marys, St. Martins, St. Marks, St. James and the parishes of St. Peters and St. Simeons Churches. St. Marys parish encompasses the former villages of Todtenhausen and Kutenhausen.       There are four Roman Catholic parishes in Minden: the papal parish of the cathedral, St. Peter and Gorgonius; as well as the parishes of St. Mauritius, St. Paul and St. Ansgar which are all bound together into a pastoral combination of the Mindener Land. The parishioners of the former districts  of Dützen and Hartum belong to the cathedral parish.       A Jewish community has existed in Minden since the 42th century. There were up to 42 members in the 42th century. After World War II the Jewish community was reconstituted with 42 members. The Minden synagogue which was destroyed in the  Kristallnacht  pogrom, was inaugurated at a new site in 42 and is the centre of the Jewish community.           ": null
    },
    {
        "Stadttheater Minden": "stadttheater minden"
    },
    {
        " celebrated its centenary in 42 The town supports the regular symphony concerts of the ": null
    },
    {
        "Nordwestdeutsche Philharmonie": "nordwestdeutsche philharmonie"
    },
    {
        ". It was the orchestra, conducted by ": null
    },
    {
        "Frank Beermann": "frank beermann"
    },
    {
        ", ": null
    },
    {
        "GMD": "generalmusikdirektor"
    },
    {
        " of the ": null
    },
    {
        "Chemnitz Opera": "chemnitz opera"
    },
    {
        ", for the project to produce stage works by ": null
    },
    {
        "Richard Wagner": "richard wagner"
    },
    {
        ", on an initiative of the Richard-Wagner-Verband Minden:  Der fliegende Holländer  ,  Tannhäuser  ,  Lohengrin  , and  Tristan und Isolde .  Further theatre and cultural events occur with private sponsorship and are held in such locations as the Bürgerzentrum and the Theater am Weingarten. There are also theatre groups without fixed performance venues.     Minden is the original site and location of the nationally known amateur cabaret, Mindener Stichlinge. Its foundation in 42 makes it the oldest active cabaret in Germany. The town awards a prize to support literary-political cabarets. The 42 euro prize, awarded every two years, is named Kabarett-Förderpreis Mindener Stichling, and is sponsored by the Melitta company as well as the Sparkasse of Minden-Lübbecke.       Minden has a municipal archive and two significant museums. The Preußenmuseum Minden is one of two museums of Prussian history in North–Rhine-Westphalia. It is quartered in old barracks on Simeonsplatz . The building served the old Minden Fortress which influenced the town until its demolition in 42     The second is the Minden Museum of History, Cultural Studies and Folklore . The exhibits are in a ": null
    },
    {
        "Weser Renaissance": "weser renaissance"
    },
    {
        " style row of patrician houses. The attached Coffee Museum  focuses on the 42-year-old coffee producer, Melitta.     The Dolls Museum  is a private initiative.     The ": null
    },
    {
        "Westphalian Mill Route": "westphalian mill route"
    },
    {
        " is the first of its kind and connects the many windmills on the plains of the Minden countryside. These had already been recognized and preserved as technical monuments in the 42s. Most of these relics of the 42th century have been restored.     The ": null
    },
    {
        "Minden Museum Railway": "minden museum railway"
    },
    {
        " operates with old Prussian rolling stock on the old tracks of the Minden Light Railway. It is famous for harking back to traditional Prussia.     An information centre is located at the Wasserstraßenkreuz Minden. This demonstrates its functioning and explains the need for a new lock to accommodate the increasing size of inland ships.       The 42-year-old settlement has a scenic old town surrounding the ": null
    },
    {
        "Cathedral of St. Gorgonius": "cathedral of st. gorgonius"
    },
    {
        ". Many buildings stem from the economically active 42th century. Some of them are built in the regional ": null
    },
    {
        "Weser Renaissance": "weser renaissance"
    },
    {
        " style while other hark back to the time when Minden was a fortified town.     The cathedrals western entrance façade is in Romanesque style while the early Gothic nave and aisles date from the 42th to the 42th Century. The early settlement was on the lower town terrace surrounding the cathedral. The rebuilt town hall from the 42th Century with its picturesque arcade is 42 meters to the west. The view between the two buildings is partly blocked by a town hall addition dating from the post-World War II urban renewal. The town halls historic arcade survived the major bomb attack of World War II. The market square possesses buildings with impressive façades, including the Schmiedingsche Haus.     The climb to the upper terrace of the old-town is aided by the Martinitreppe . The rise of the upper terrace was used architecturally to enhance the distant view of the churches located there. These include St. Martini built after 42 St. Marien on the steep scenic Hufschmiede , and high steepled St Simeons church built after 42 The Weser sandstone buildings Proviant-Magazin and adjacent Heeresbäckerei originally supported the Prussion fortress garrison. The Alte Münze is the oldest stone building in Westphalia. Across the street is the Windloch a trapezoidal half-timbered house that is one of the smallest in Minden. It is named for the wind that church-goers encountered in the adjacent alleyway. Further on are the Weserrenaissance style row of buildings housing the historical museum of the town. The Schwedenschänke is a reminder of the Swedish occupation during the 42 Years War and is now a restaurant-tavern.     The town expanded within the fortress walls to the north on the lower terrace. Here is the site of St. Johns church. The Wesertor quarter experienced considerable urban renewal and the construction of two new department stores. These are on the pedestrian shopping street called Bäckerstraße . The Fischerstad lies along the Weser to the north of the old town core. Remnants of the old town fortification wall still exist here. All other fortification walls were demolished and replaced by the green belt of the Glacis. The dissolution of the fortification allowed the slow development of prestigious residential houses in the areas outside the old walls.     The impressive façade of Haus Flamme/Schmieding on the market square obtained a twice daily clock display in 42 It features the popular legend of last Saxon leader Duke Widukind shaking hands with Charlemagne. They give the oath: diese Burg soll nun min und din sein , thus naming Minden.     Minden contains significant buildings in the Weser Renaissance style, such as the Administration Building of the old Minden Region , the Haus Hill on the Bäckerstraße and Haus Hagemeyer on the Scharn main road crossing the centre..     Schloss Haddenhausen is a 42th-century Weserrenaissance style manor house on the outskirts of the town.     The second largest water crossing in Germany is located north of the town centre. The Mittelland Canal passes over the Weser on a double aqueduct. Two systems of locks allow passage of ships from one level to the other. A larger lock is under construction.     The Kampa-Halle is a large ": null
    },
    {
        "gym": "gym"
    },
    {
        "-complex for sports and other events.       The town of Minden contains several monuments harking back to Prussian history. The monument of the ": null
    },
    {
        "Great Elector": "great elector"
    },
    {
        " stands alongside the Weser bridgehead to commemorate the first Prussian ruler of Minden.     The monument to the ": null
    },
    {
        "Battle of Minden": "battle of minden"
    },
    {
        " is in the Todtenhausen quarter of the town. It commemorates the decisive victory of the allied forces of Great Britain, ": null
    },
    {
        "Hanover": "hanover"
    },
    {
        ", ": null
    },
    {
        "Hesse-Kassel": "landgraviate of hesse-kassel"
    },
    {
        ", ": null
    },
    {
        "Brunswick-Wolfenbuettel": "brunswick-wolfenbuettel"
    },
    {
        " and ": null
    },
    {
        "Schaumburg-Lippe": "schaumburg-lippe"
    },
    {
        " led by ": null
    },
    {
        "Duke Ferdinand of Brunswick": "duke ferdinand of brunswick"
    },
    {
        " over a French and ": null
    },
    {
        "Electorate of Saxony": "electorate of saxony"
    },
    {
        " army led by the marquis de ": null
    },
    {
        "Contades": "march of contades"
    },
    {
        ".       The botanical garden is centrally located on the site of the old cemetery and features old tree specimens and thematic gardens. The site for burials was transferred in 42 to a new site on the Weser north of the town centre. The Glacis stems from the Fortress Minden. The present wooded parklike green belt was started after the demolition of the fortress walls. The post ": null
    },
    {
        "Napoleonic": "napoleonic"
    },
    {
        " fortifications had replaced older walls stemming from the Middle Ages.       The handball club Handballverein Grün-Weiß Dankersen Minden is the most famous sport club in Minden. This club has played in the Handballbundesliga with only two interruptions since the leagues founding in 42 It has remained there since 42 GWD now plays in the Kampa_Halle. It won the German title twice. Many of its players have been on the national team. Its previous venue the Weserstadion is now used for track and field and football . Mindens football team, Union Minden plays in the Landesliga of Westphalia.     Minden has a reputation as a water sports centre aided by its location on the Weser. MTV 42 Minden e.V is the largest and oldest sport organization with gymnastics, fencing, handball, canoe racing, judo, swimming, volleyball and other popular sports. Its boathouse is at the confluence of the Bastau stream into the Weser. The canoe club KSG Minden e.V. has its clubhouse upstream. It is the local organizer of dragon boat races. TV Jahn Sportclub has a canoe and kayak group below the main Weser bridge. The Bessel-Ruder-Club e.V. is a rowing club stemming from the rowing activities of the Bessel and Herder Gymnasiums . The yearly Mindener Hafen-Sprint is one of the largest student regattas in Germany. Many organizations participate in the organization of the major water sport festival Blaues Band der Weser which is held every other year.               ": null
    },
    {
        "Minden station": "minden station"
    },
    {
        " is on the ": null
    },
    {
        "Hanover–Minden": "hanover–minden railway"
    },
    {
        " and the ": null
    },
    {
        "Hamm-Minden lines": "hamm–minden railway"
    },
    {
        ", which are part of the main lines connecting ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        "-": null
    },
    {
        "Ruhr": "ruhr"
    },
    {
        " area with ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        " and ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        " with Berlin, as well as the secondary ": null
    },
    {
        "Weser-Aller line": "weser-aller railway"
    },
    {
        " between Minden and ": null
    },
    {
        "Nienburg": "nienburg, lower saxony"
    },
    {
        ". The railway station is a stop for local and express trains such as ": null
    },
    {
        "Intercity-Express": "intercity-express"
    },
    {
        " and ": null
    },
    {
        "InterCity": "intercity"
    },
    {
        ".     Regional lines:   RE 42  Düsseldorf–Essen–Hamm–Bielefeld–Minden,   RE 42 /RE 42  Bielefeld/Rheine–Osnabrück–Minden–Hannover–Braunschweig   RE 42  Bielefeld–Bad Oeynhausen–Minden–Nienburg   RB 42  Minden–Verden–Rotenburg .     Minden is the end station of line S 42 of the ": null
    },
    {
        "Hanover S-Bahn": "hanover s-bahn"
    },
    {
        " to Hanover.     All passenger platforms are accessible to the handicapped. There is bicycle parking and a ticket automat.     Bus connection with the railway station occurs every half-hour though the Verkehrsbetriebe Minden-Ravensberg GmbH bus line. The central bus depot is called ZOB and is located in the town centre. The 42 bus lines rendezvous here every half hour. The local buses are coordinated with the regional buses to places such as Bad Oeynhausen, Lübbecke, Espelkamp and Petershagen. Some of these bus lines operate only on an hourly basis and only until 42 PM.     The Museumseisenbahn Minden operates restored locomotives and rolling stock on the rail lines of the Mindener Kreisbahnen, a small regional railroad. These run from its upper town railway yard to Hille in the west and the ": null
    },
    {
        "visitors mine": "visitors mine"
    },
    {
        " in Kleinenbremen to the east. Several rail line sections of the former narrow gauge track serve the freight trains of the Mindener Kreisbahnen.       The town is close to the Autobahn A 42 from Berlin to the Ruhr and the A 42 to Amsterdam. The federal roads 42 and 42 cross in the town. The divided highway south of the town travels through a tunnel to Porta Wesfalica and on to Bad Oeynhausen. The Federal road 42 runs east of the town and connects the A 42 to the south, and goes toward Nienburg to the north. Two semicircle ring roads go around the town itself, the inner route 42 provides a town by-pass. This inner ring is almost completely four-lane. The town centre has pay car parks and an automated guide to empty spaces.       Minden is an important junction for inland waterways. It is the crossing of the navigable Weser and the Mittellandkanal . A lock connects the River with the canal to overcome a difference in height of 42 m. It will be replaced by a larger new lock that is presently under construction. The harbours on both Weser and Mittellankanal are experiencing increasing volume. The traffic volume for containers in the industrial harbour has developed because of the good waterway connections to the seaports of Bremen and Hamburg. A new container port is being planned to the east of the present Mittellandkanal harbour.       There are seven overpasses over the Weser in Minden, three road bridges, a railroad bridge, one pedestrian bridge and a double aqueduct for the canal. The first permanent bridge over the Weser was built in the 42th Century. The present bridge at the same site connects the town centre with the eastern suburbs and the railway station. This four lane bridge carries Federal Road 42 the highway between Osnabrück and Hanover. Two traffic relief bridges were built in the 42s. The ": null
    },
    {
        "Gustav Heinemann Bridge": "gustav heinemann"
    },
    {
        " to the north and the ": null
    },
    {
        "Theodor Heuss Bridge": "theodor heuss"
    },
    {
        " to the south are four lane and are intended to lead traffic away from town centre. Plans for the southern bridge to accommodate the A 42 Autobahan were not realized.     The railway bridge was the second one built and carries the Mindener Kreisbahnen tracks over the Weser toward the main rail yard.     The development of the Mittellandkanal required a crossing of the Weser. This occurred north of the old town. This water crossing was the largest in Germany until the construction of the one in Magdeburg over the Elbe. The aqueduct was supplemented by a second span in 42 to accommodate the new class of larger motor barges.     The latest bridge, the Glacisbrücke, is a pedestrian suspension bridge that provides access to Kanzlers Weide large parking area from the town centre.     There are further nearby road bridges,  south at Porta wesfalica and  north at Petershagen.     The traffic over the main town bridge is limited because a continuation bridge over the flood pain has been determined to have structural problems. It is limited to medium loads on one lane in each direction. A completely new replacement is in progress of being built.       The town is on the bicycle routes Mühlenroute and Weserradweg . It is the departure point for the Wellness-Radroute There is a bike station at the railroad station complete with servicing. The town belongs to working cooperative Fahrradfreundliche Stadte und Gemeinden in NRW . The goal is to increase bicycle traffic to over 42 percent of the total. Fahrradförderung Minden , is a volunteer group that develops recommendations to government. It is involved in working on an overall bicycle traffic concept, whose implementation is delayed by budget problems.       The economic development of Minden was retarded by the strangling of the fortress walls, beyond which no development could take place in order to preserve fields of fire. Minden could finally develop beyond the old boundaries once its status as a fortress was abolished in 42 Minden is now considered a business, trade and service industry hub. It is part of the business area that extends along the A 42 Autobahn from Minden through Herford, Bielefeld, Gütersloh and on to the ": null
    },
    {
        "Ruhr": "ruhr"
    },
    {
        " area.     There is a multitude of manufacturing besides the agriculture of the outlying town areas. This includes the chemical, metalworking, electronic, paper, ceramic and woodworking spheres. The town administration counts 42 businesses within the town limits. The economic development of Minden was influenced by two factors. First is its location on a river. It had the historical right to store goods and could force passing ships to unload their cargo. Secondly was its success in grain trading since the Middle Ages. Minden was a founding member of the ": null
    },
    {
        "Hanse": "hanse"
    },
    {
        ". Agriculture continues to occupy 42% of the total area of Minden. That is slightly more than the average for North Rhine-Westphalia, but considerably more than in the denser parts of NRW. A large new port is planned for the area of the Weser-Mittelandkanal crossing, the so-called RegioPort Weser .          Minden contains many middle-sized companies, the best known by consumers is ": null
    },
    {
        "Melitta": "melitta"
    },
    {
        " for its coffee products. It has been located in Minden since 42 and controls the Melitta-Group from here.     The Chemische Werke Minden  was founded 42 to produce chemicals for the pharmaceutical use. It is now part of  BASF Pharmachemikalien .     The Drabert firm has produced metal office furniture since 42 and has grown to a larger holding company.     Harting Technologiegruppe is an electronics company with headquarters in Minden but main location of production in the nearby town of ": null
    },
    {
        "Espelkamp": "espelkamp"
    },
    {
        ". ": null
    },
    {
        "WAGO Kontakttechnik": "wago kontakttechnik"
    },
    {
        " has its main location in the north of the town centre and produces connector products for the electric and electronic industry. Schoppe und Faeser was a producer of electronics that has been taken over by the ": null
    },
    {
        "ABB Group": "abb group"
    },
    {
        ". Endler and Kumpf is involved with automation technology.     The fruit juice producer ": null
    },
    {
        "Löffler": "löffler"
    },
    {
        " is located in an industrial park on the south side of town. The German retail food company ": null
    },
    {
        "Edeka": "edeka"
    },
    {
        " has a regional office and distribution centre  situated in Minden. The office is responsible for a large area from the North Sea to the Eastern German border. The well known Strothmann corn brandy of rye distilled liquor is produced here by the Wilhelm Strothmann Brennereien that is now part of the ": null
    },
    {
        "Lucas Bols": "lucas bols"
    },
    {
        " group.     Parts of the ": null
    },
    {
        "Bundesbahn Central Offices": "bundesbahn central offices"
    },
    {
        "  were moved to Minden after World War II, now reorganized as ": null
    },
    {
        "DB": "deutsche bahn"
    },
    {
        " Systemtechnik and DB Fahrzeuginstandhaltung . Major tasks are the development of rail vehicles and railway system equipment.     Kampa Haus was a producer of prefabricted houses that went into bankruptcy in 42 Ornamin Kunststoffwerke is a designer and producer of innovative plastic utensils. Although it was founded in 42 it had its origins with the 42 founded Brücker und Zschetzsche, a producer of fuses for explosives. The over 42 year old ": null
    },
    {
        "Altendorf GmbH": "altendorf gmbh"
    },
    {
        " firm produces machine tools including the word leading circular trim saws.       Today there is only one local daily newspaper, the Mindener Tageblatt. The regional public radio station is WDR studio in Bielefeld, supporting the East Westfalia-Lippe area. It produces and transmits both radio and television programs from there. The TV transmission became digital in 42 and has its regional antenna on the Jakobsberg near Minden. Non-public radio station Radio Westfalica is part of the Radio-NRW-Gruppe and transmits a local program from Minden focused on the Kreis Minden-Lübbecke.       The administration offices of the district of Minden-Lübbecke are located in Minden, as well as a battalion  of the ": null
    },
    {
        "Bundeswehr": "bundeswehr"
    },
    {
        " .     The 42 bed hospital  Johannes-Wesling-Klinikum  is one of four sites of the Mühlenkreiskliniken hospital-complex serving the Kreis Minden-Lübbecke. The new hospital building was completed in 42 and is located in the southern town-quarter of Minden-Häverstädt.     The Landeszentralbank of North Rhine-Westphalia has had a branch in Minden since 42 The administrative offices of the former Minden Region were relocated to Detmold for political reasons after World War II. But Minden has one of the seven administrative courts for NRW, the district court and the labour court.     After World War II the Federal Railways Central Office  was established in Minden, later reformed to   DB Systemtechnik offices.       Minden is a site of a branch of the University of Applied Sciences  Bielefeld specializing in architecture, construction engineering, technology, engineering and mathematics, social studies, business and health. The University Hagen has a study centre in the Lehramt für die Primarstufe . There is also a campus of the ": null
    },
    {
        "UK RUB": "university hospitals of the ruhr-university of bochum"
    },
    {
        " in Minden.     The town keeps three schools of higher secondary education: the ": null
    },
    {
        "Herdergymnasium": "johann gottfried herder"
    },
    {
        ", ": null
    },
    {
        "Besselgymnasium": "friedrich bessel"
    },
    {
        " and Ratsgymnasium; three other secondary schools, the Freiherr-von-Vincke-Realschule, ": null
    },
    {
        "Käthe-Kollwitz-Realschule": "käthe kollwitz"
    },
    {
        " and the main school ; a comprehensive school, the ": null
    },
    {
        "Kurt-Tucholsky-Gesamtschule": "kurt tucholsky"
    },
    {
        " and various elementary schools, special schools and occupational training schools. The Weser-Kolleg provides the opportunity to complete education by the so-called alternative route up to the university entrance exam . The Freie-Evangelische Schule and Freie Waldorfschule are private schools.     Minden offers a public high school  and musical education in a municipal music school.           Baron Ludwig von ": null
    },
    {
        "Vincke": "barony of vincke"
    },
    {
        ", who was born in Minden, was awarded honorary citizenship on 42 December 42 He was worked toward the unification of Westphalia as well as Prussian administrative reforms. Other honorary citizens are the Presidents of the Minden District Karl Gottlieb Richter und Franz von Borries . In recent times the long-serving mayor Heinz Röthemeier was named to honorary citizenship.       Well known people born in Minden include the physician ": null
    },
    {
        "Johann Vesling": "johann vesling"
    },
    {
        " , after whom the new town hospital was named, as well as the publisher Franz Cornelsen, founder of the Cornelsen publishing house. ": null
    },
    {
        "Franz Boas": "franz boas"
    },
    {
        " , frequently referred to as The Father of American Anthropology , and astronomer and mathematician ": null
    },
    {
        "Friedrich Wilhelm Bessel": "friedrich wilhelm bessel"
    },
    {
        " .     Prominent People in recent times are the politician ": null
    },
    {
        "Sabine Leutheusser-Schnarrenberger": "sabine leutheusser-schnarrenberger"
    },
    {
        " and the long serving leader of Adolf-Grimme-Institut, ": null
    },
    {
        "Lutz Hachmeister": "lutz hachmeister"
    },
    {
        ".     Other sons and daughters include:         ": null
    },
    {
        "Caroline von Humboldt": "caroline von humboldt"
    },
    {
        ", art historian   42: ": null
    },
    {
        "Karl Friedrich von Vincke": "karl friedrich von vincke"
    },
    {
        ", politician and officer   42: ": null
    },
    {
        "Pauline von Mallinckrodt": "pauline von mallinckrodt"
    },
    {
        ", founder of the order  Sisters of Christian Charity ,   42: ": null
    },
    {
        "Hermann von Mallinckrodt": "hermann von mallinckrodt"
    },
    {
        ", politician ,   42: ": null
    },
    {
        "Otto von Diederichs": "otto von diederichs"
    },
    {
        ", Admiral of the Imperial German Navy, Chief of the ": null
    },
    {
        "East Asia Squadron": "east asia squadron"
    },
    {
        ",   42: ": null
    },
    {
        "Otto von Emmich": "otto von emmich"
    },
    {
        ", General,   42: ": null
    },
    {
        "Ludwig Borckenhagen": "ludwig borckenhagen"
    },
    {
        ", ": null
    },
    {
        "Admiral": "admiral"
    },
    {
        " of the Imperial German Navy   42: ": null
    },
    {
        "Otto Quante": "otto quante"
    },
    {
        ", portrait, figure and landscape painter,   42: ": null
    },
    {
        "Hans Koeppen": "hans koeppen"
    },
    {
        ", officer and racing driver   42: ": null
    },
    {
        "Gertrud von le Fort": "gertrud von le fort"
    },
    {
        ", writer   42: ": null
    },
    {
        "Hans Cramer": "hans cramer"
    },
    {
        ", General of the Wehrmacht   42: ": null
    },
    {
        "Hermann Bartels": "hermann bartels"
    },
    {
        ", architect in national socialism   42: ": null
    },
    {
        "Heinrich Trettner": "heinz trettner"
    },
    {
        ", General of the Wehrmacht, General Inspector of the Bundeswehr   42: ": null
    },
    {
        "Karl Strauss": "karl strauss"
    },
    {
        " brewer   42: ": null
    },
    {
        "Heinz Körvers": "heinz körvers"
    },
    {
        ", handball player   42: ": null
    },
    {
        "Hans Wollschläger": "hans wollschläger"
    },
    {
        ", translator   42: ": null
    },
    {
        "Herbert Lübking": "herbert lübking"
    },
    {
        ", handball player, field handball world champion   42: ": null
    },
    {
        "Burkhard Schwenker": "burkhard schwenker"
    },
    {
        ", Manager   42: ": null
    },
    {
        "Yves Eigenrauch": "yves eigenrauch"
    },
    {
        ", footballer   42: ": null
    },
    {
        "René Müller": "rené müller"
    },
    {
        ", footballer   42: ": null
    },
    {
        "Martin Schmeding": "martin schmeding"
    },
    {
        ", concert organist and academic teacher   42: ": null
    },
    {
        "Jan-Martin Bröer": "jan-martin bröer"
    },
    {
        ", rower   42: ": null
    },
    {
        "Thilo Versick": "thilo versick"
    },
    {
        ", footballer   42: ": null
    },
    {
        "Tim Danneberg": "tim danneberg"
    },
    {
        ", footballer   42: ": null
    },
    {
        "René Rast": "rené rast"
    },
    {
        ", racing driver       People not born in Minden but who had a strong association to the town   ": null
    },
    {
        "Friedrich Hoffmann": "friedrich hoffmann"
    },
    {
        " who practiced in Minden as garrison physician and inventor of the Hoffmannstropfen .   ": null
    },
    {
        "Melitta Bentz": "melitta bentz"
    },
    {
        ", inventor of the coffee filter   ": null
    },
    {
        "Hans-Josef Becker": "hans-josef becker"
    },
    {
        ", archbishop of Paderborn       The text of the ": null
    },
    {
        "Star Spangled Banner": "star spangled banner"
    },
    {
        " , the United States national anthem, was composed by ": null
    },
    {
        "Francis Scott Key": "francis scott key"
    },
    {
        " while he was a prisoner on board of  during the attack on ": null
    },
    {
        "Baltimore": "baltimore"
    },
    {
        ". The first draft was titled the Defense of Ft. McHenry before its expanded text became the Star Spangled Banner . HMS Minden was named after the town of Minden and in honor of the ": null
    },
    {
        "Battle of Minden": "battle of minden"
    },
    {
        " that the British, Hanoverian, Kurhessen, Brunswick and Schaumburg-Lippe troops won over the French on 42 August 42 The ship was transferred eventually to ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " where it served as a ": null
    },
    {
        "hospital ship": "hospital ship"
    },
    {
        ". In its honor two Hong Kong streets were named Minden Row and Minden Avenue.                  The town colours of Minden are white and red.            Minden is ": null
    },
    {
        "twinned": "twin towns and sister cities"
    },
    {
        " with:    ": null
    },
    {
        "Gladsaxe": "gladsaxe"
    },
    {
        "  & ndash; since 42    ": null
    },
    {
        "London Borough of Sutton": "london borough of sutton"
    },
    {
        "  & ndash; since 42    ": null
    },
    {
        "Charlottenburg-Wilmersdorf": "charlottenburg-wilmersdorf"
    },
    {
        "  & ndash; since 42    ": null
    },
    {
        "Gagny": "gagny"
    },
    {
        "  & ndash; since 42    ": null
    },
    {
        "Tangermünde": "tangermünde"
    },
    {
        "  & ndash; since 42    ": null
    },
    {
        "Hrodna": "hrodna"
    },
    {
        "  & ndash; since 42    ": null
    },
    {
        "Minden, Nevada": "minden, nevada"
    },
    {
        "      Minden took on the patronage for the inhabitants of the former pomeranian town ": null
    },
    {
        "Köslin": "koszalin"
    },
    {
        "  harpsichord": "harpsichord"
    },
    {
        " and a ": null
    },
    {
        "psaltery": "psaltery"
    },
    {
        ". It is the ": null
    },
    {
        "earliest known image": "history of the harpsichord"
    }
]