[
    {
        "     Minestrone  is a thick ": null
    },
    {
        "soup": "soup"
    },
    {
        " of ": null
    },
    {
        "Italian": "italy"
    },
    {
        " origin made with ": null
    },
    {
        "vegetable": "vegetable"
    },
    {
        "s, often with the addition of ": null
    },
    {
        "pasta": "pasta"
    },
    {
        " or ": null
    },
    {
        "rice": "rice"
    },
    {
        ", sometimes both. Common ingredients include ": null
    },
    {
        "bean": "bean"
    },
    {
        "s, ": null
    },
    {
        "onion": "onion"
    },
    {
        "s, ": null
    },
    {
        "celery": "celery"
    },
    {
        ", ": null
    },
    {
        "carrot": "carrot"
    },
    {
        "s, stock, and ": null
    },
    {
        "tomato": "tomato"
    },
    {
        "es.     There is no set ": null
    },
    {
        "recipe": "recipe"
    },
    {
        " for minestrone, since it can be usually made out of whatever vegetables one has. It can be ": null
    },
    {
        "vegetarian": "vegetarian"
    },
    {
        ", contain ": null
    },
    {
        "meat": "meat"
    },
    {
        ", or contain an animal bone-based stock . ": null
    },
    {
        "Angelo Pellegrini": "angelo pellegrini"
    },
    {
        ", however, argued that the base of minestrone is bean broth, and that ": null
    },
    {
        "borlotti beans": "cranberry bean"
    },
    {
        " are the beans to use for genuine minestrone .        Some of the earliest origins of minestrone soup pre-date the expansion of the Latin tribes of Rome into what became the ": null
    },
    {
        "Roman Kingdom": "roman kingdom"
    },
    {
        " , when the local diet was vegetarian by necessity and consisted mostly of vegetables, such as ": null
    },
    {
        "onion": "onion"
    },
    {
        "s, ": null
    },
    {
        "lentil": "lentil"
    },
    {
        "s, ": null
    },
    {
        "cabbage": "cabbagehistory"
    },
    {
        ", ": null
    },
    {
        "garlic": "garlicculinary uses"
    },
    {
        ", ": null
    },
    {
        "broad beans": "vicia faba"
    },
    {
        ", ": null
    },
    {
        "mushrooms": "edible mushroomhistory of mushroom use"
    },
    {
        ", ": null
    },
    {
        "carrot": "carrot"
    },
    {
        "s, ": null
    },
    {
        "asparagus": "asparagus"
    },
    {
        ", and ": null
    },
    {
        "turnips": "turniporigin"
    },
    {
        ".      During this time, the main dish of a meal would have been pulte, a simple but filling porridge of ": null
    },
    {
        "spelt": "spelt"
    },
    {
        " flour cooked in salt water, to which whatever vegetables that were available would have been added.     It was not until the 2nd century B.C., when Rome had conquered Italy and monopolized the commercial and road networks, that a huge diversity of products flooded the capital and began to change their diet, and by association, the diet of Italy most notably with the more frequent inclusion of meats, including as a stock for soups.     Spelt flour was also removed from soups, as bread had been introduced into the Roman diet by the Greeks, and pulte became a meal largely for the poor.      The ancient Romans recognized the health benefits of a simple or frugal diet  and thick vegetable soups and vegetables remained a staple.     Marcus ": null
    },
    {
        "Apiciuss": "apicius"
    },
    {
        "ancient cookbook De Re Coquinaria described polus, a Roman soup dating back to 30 AD made up of ": null
    },
    {
        "farro": "farro"
    },
    {
        ", chickpeas, and ": null
    },
    {
        "fava": "fava"
    },
    {
        " beans, with onions, garlic, lard, and greens thrown in.      As eating habits and ingredients changed in Italy, so did minestrone. Apicius updates the pultes and pulticulae with fancy trimmings such as cooked brains and wine.     The introduction of ": null
    },
    {
        "tomato": "tomato"
    },
    {
        "es and ": null
    },
    {
        "potato": "potato"
    },
    {
        "es from the Americas in the mid-16th century changed the soup by making available two ingredients which have since become staples.     The tradition of not losing rural roots continues today, and minestrone is now known in Italy as belonging to the style of cooking called cucina povera meaning dishes that have rustic, rural roots, as opposed to cucina nobile or the cooking style of the aristocracy and nobles.      Like many Italian dishes, minestrone was probably originally not a dish made for its own sake. In other words, one did not gather the ingredients of minestrone with the intention of making minestrone. The ingredients were pooled from ingredients for other dishes, often ": null
    },
    {
        "side dish": "side dish"
    },
    {
        "es or contorni plus whatever was left over, rather like the pulte.     There are two schools of thought on when the recipe for minestrone became more formalized. One argues that in the 17th and 18th centuries minestrone emerged as a soup using exclusively fresh vegetables and was made for its own sake , while the other school of thought argues that the dish had always been prepared exclusively with fresh vegetables for its own sake since the pre-Roman pulte, but the name minestrone lost its meaning of being made with left-overs.       The word minestrone, meaning a thick ": null
    },
    {
        "vegetable soup": "vegetable soup"
    },
    {
        ", is attested in English from 1871. It is from Italian minestrone, the ": null
    },
    {
        "augmentative": "augmentative"
    },
    {
        " form of minestra, soup , or more literally, that which is served , from minestrare, to serve   and cognate with administer as in to administer a remedy .     Because of its unique origins and the absence of a fixed ": null
    },
    {
        "recipe": "recipe"
    },
    {
        ", minestrone varies widely across Italy depending on traditional cooking times, ingredients, and ": null
    },
    {
        "season": "season"
    },
    {
        ". Minestrone ranges from a thick and dense texture with very boiled-down ": null
    },
    {
        "vegetable": "vegetable"
    },
    {
        "s, to a more brothy soup with large quantities of diced and lightly cooked vegetables; it may also include ": null
    },
    {
        "meat": "meat"
    },
    {
        "s.     In modern Italian there are three words corresponding to the English word soup: zuppa, which is used in the sense of ": null
    },
    {
        "tomato soup": "tomato soup"
    },
    {
        ", or ": null
    },
    {
        "fish soup": "fish soup"
    },
    {
        "; minestra, which is used in the sense of a more substantial soup such as a vegetable soup, and also for dry soups, namely pasta dishes; and minestrone, which means a very substantial or large soup or ": null
    },
    {
        "stew": "stew"
    },
    {
        ", though the meaning has now come to be associated with this particular dish.       Minestrone alla Genovese is a variant typical of ": null
    },
    {
        "Liguria": "liguria"
    },
    {
        ", which contains greater use of herbs, including ": null
    },
    {
        "pesto": "pesto"
    },
    {
        ".       Minestra is a variant from ": null
    },
    {
        "Malta": "malta"
    },
    {
        ", which prominently features kunserva , potatoes, ": null
    },
    {
        "kohlrabi": "kohlrabi"
    },
    {
        ", ": null
    },
    {
        "cauliflower": "cauliflower"
    },
    {
        " and sometimes spaghetti. ": null
    }
]