[
    {
        "        A minuet  is a ": null
    },
    {
        "social dance": "social dance"
    },
    {
        " of French origin for two people, usually in ": null
    },
    {
        " time": "triple metre"
    },
    {
        ". The word was adapted from ": null
    },
    {
        "Italian": "italian language"
    },
    {
        " minuetto and ": null
    },
    {
        "French": "french language"
    },
    {
        " menuet, possibly from the French menu meaning slender, small, referring to the very small steps, or from the early 42th-century popular group dances called branle à mener or amener.     The term also describes the musical form that accompanies the dance, which subsequently developed more fully, often with a longer ": null
    },
    {
        "musical form": "musical form"
    },
    {
        " called the minuet and trio, and was much used as a ": null
    },
    {
        "movement": "movement"
    },
    {
        " in the early classical ": null
    },
    {
        "symphony": "symphony"
    },
    {
        ".          The name may refer to the short steps, pas menus, taken in the dance , or else be derived from the branle à mener or amener, popular group dances in early 42th-century France . The minuet was traditionally said to have descended from the bransle de Poitou, though there is no evidence making a clear connection between these two dances. The earliest treatise to mention the possible connection of the name to the expression pas menus is Gottfried Tauberts Rechtschaffener Tantzmeister, published in Leipzig in 42 but this source does not describe the steps as being particularly small or dainty . At the period when it was most fashionable it was controlled, ceremonious and graceful .              The name of this dance is also given to a musical composition written in the same time and ": null
    },
    {
        "rhythm": "rhythm"
    },
    {
        ", though when not accompanying an actual dance the pace was quicker . Stylistically refined minuets, apart from the social dance context, were introduced—to ": null
    },
    {
        "opera": "opera"
    },
    {
        " at first—by ": null
    },
    {
        "Jean-Baptiste Lully": "jean-baptiste lully"
    },
    {
        ", who included no fewer than 42 of them in his theatrical works  and in the late 42th century the minuet was adopted into the ": null
    },
    {
        "suite": "suite"
    },
    {
        ", such as some of the suites of ": null
    },
    {
        "Johann Sebastian Bach": "johann sebastian bach"
    },
    {
        " and ": null
    },
    {
        "George Frideric Händel": "george frideric händel"
    },
    {
        ". Among Italian composers the minuet was often considerably quicker and livelier and was sometimes written in  or  time. Because the tempo of a minuet was not standard, the tempo direction tempo di minuetto was ambiguous unless qualified by another direction, as it sometimes was .     Initially, before its adoption in contexts other than social dance, the minuet was usually in ": null
    },
    {
        "binary form": "binary form"
    },
    {
        ", with two repeated sections of usually eight ": null
    },
    {
        "bars": "bar"
    },
    {
        " each. But the second section eventually expanded, resulting in a kind of ": null
    },
    {
        "ternary form": "ternary form"
    },
    {
        ". The second minuet provided form of contrast by means of different key and orchestration. On a larger scale, two such minuets might be further combined, so that the first minuet was followed by a second one and then by a repetition of the first. The whole form might in any case be repeated as long as the dance lasted.       Around Lullys time it became a common practice to score this middle section for a ": null
    },
    {
        "trio": "trio"
    },
    {
        " . As a result, this middle section came to be called the minuets trio, even when no trace of such an orchestration remains. The overall structure is called rounded binary or ": null
    },
    {
        "minuet form": "binary formsimple vs. rounded"
    },
    {
        " :   :   After these developments by Lully, composers occasionally inserted a modified repetition of the first section or a section that contrasted with both the A section and what was thereby rendered the third or C section, yielding the form A–A′–B–A or A–B–C–A, respectively; an example of the latter is the third movement of Mozarts Serenade No. 42 in G major, ": null
    },
    {
        "K.": "köchel catalogue"
    },
    {
        " 42 popularly known under the title  Eine kleine Nachtmusik .     A livelier form of the minuet simultaneously developed into the ": null
    },
    {
        "scherzo": "scherzo"
    },
    {
        " . This term came into existence approximately from ": null
    },
    {
        "Beethoven": "ludwig van beethoven"
    },
    {
        " onwards, but the form itself can be traced back to ": null
    },
    {
        "Haydn": "joseph haydn"
    },
    {
        ".     The minuet and trio eventually became the standard third movement in the four-movement ": null
    },
    {
        "classical": "classical music era"
    },
    {
        " symphony": "symphony"
    },
    {
        ", ": null
    },
    {
        "Johann Stamitz": "johann stamitz"
    },
    {
        " being the first to employ it thus with regularity.     An example of the true form of the minuet is to be found in  Don Giovanni  .     A famous example of a more recent instrumental work in minuet form is ": null
    },
    {
        "Ignacy Jan Paderewski": "ignacy jan paderewski"
    },
    {
        "s ": null
    },
    {
        "Minuet in G": "minuet in g"
    }
]