[
    {
        "      Mispronunciation is defined by the ": null
    },
    {
        "Oxford English Dictionary": "oxford english dictionary"
    },
    {
        " as incorrect or inaccurate ": null
    },
    {
        "pronunciation": "pronunciation"
    },
    {
        " . The matter of what is or is not mispronunciation is a contentious one, and indeed there is some disagreement about the extent to which the term is even meaningful. ": null
    },
    {
        "Language": "language"
    },
    {
        "s are pronounced in different ways by different people, depending on such factors as the area they grew up in, their level of ": null
    },
    {
        "education": "education"
    },
    {
        ", and their ": null
    },
    {
        "social class": "social class"
    },
    {
        ". Even within groups of the same area and class, different people can have different ways of pronouncing certain words.       All speakers must adhere to some standard of pronunciation in order to be understood by others. But standards vary among groups, and the extent to which any group has authority to claim that their standard is better, or even that they have the right to impose such a standard, is often the main source of contention.     Those who make claims about correct pronunciation often cite ": null
    },
    {
        "dictionaries": "dictionary"
    },
    {
        " as their authority, and so at this point a summary of the principles by which pronunciation guides in dictionaries are written may be helpful. We start by discussing two distinct standpoints from which pronunciation standards can be viewed.       Pretty much every area of ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        " can be treated in either a prescriptive or a descriptive way. Prescription is the formulation of rules explaining how things should be done, while description is the formulation of rules explaining how things actually are done.     Applied to pronunciation, a prescriptive approach involves telling people that this word should be pronounced in this way, that word should be pronounced in that way, and so on. For example, one might say that the word nuclear should be pronounced or Applied to pronunciation, a descriptive approach involves telling people that some people pronounce a word in this way, while others pronounce a word in that way. For example, one might say that the word nuclear is pronounced by some people, and by some other people.      At its simplest, the prescriptive approach requires less work, since it does not necessarily depend on how words are actually spoken; one could simply write down ones own pronunciation rules, and add a note saying that this is what everyone else should do too. In practice, it is more complicated, since the prescriber will usually add further constraints relating to ": null
    },
    {
        "orthography": "orthography"
    },
    {
        " , ": null
    },
    {
        "etymology": "etymology"
    },
    {
        " , and other factors. On the other hand, the descriptive approach depends on fieldwork in which the differences in pronunciation systems used in day to day life among different people are researched and catalogued.       Before the advent of the modern ": null
    },
    {
        "scientific method": "scientific method"
    },
    {
        ", scholars in ": null
    },
    {
        "Europe": "europe"
    },
    {
        " largely looked to the ": null
    },
    {
        "Ancient Greek": "ancient greece"
    },
    {
        " philosopher": "philosopher"
    },
    {
        "s for the ways to do things. ": null
    },
    {
        "Aristotle": "aristotle"
    },
    {
        " was still regarded as the foremost authority in many areas of knowledge. His laws of ": null
    },
    {
        "logic": "logic"
    },
    {
        " were intended as prescriptions for ": null
    },
    {
        "thought": "thought"
    },
    {
        ", and a similar ethos was applied to other areas of life. There was a prevailing attitude that the route to knowledge was through studying ancient texts and reasoning about them in a detached way. After the birth of ": null
    },
    {
        "science": "science"
    },
    {
        ", careful observations of how things actually worked began to be advocated instead. However, this methodology took a long time to be applied to language.     In ": null
    },
    {
        "England": "england"
    },
    {
        ", scholars were unaware of how languages actually developed, and saw the modern tongues as mere corruptions of the old ones. They attempted to remodel ": null
    },
    {
        "English": "english language"
    },
    {
        " along the lines of ": null
    },
    {
        "Latin": "latin"
    },
    {
        ", resulting in the invention of such arbitrary rules as the rejection of the ": null
    },
    {
        "split infinitive": "split infinitive"
    },
    {
        ". However, in the ": null
    },
    {
        "42th century": "18th century"
    },
    {
        ", ": null
    },
    {
        "William Jones": "william jones"
    },
    {
        " did a detailed comparison of several languages, including ": null
    },
    {
        "Latin": "latin"
    },
    {
        ", ": null
    },
    {
        "Greek": "greek language"
    },
    {
        ", ": null
    },
    {
        "Sanskrit": "sanskrit"
    },
    {
        ", and the ": null
    },
    {
        "Germanic language": "germanic language"
    },
    {
        "s, and proposed that they may have evolved from a common root language, perhaps extinct.      This study is often considered to have been the birth of modern ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        ". After that, more attention was paid to detailed comparisons of languages, and many of the mechanisms by which languages evolve were worked out. It became clear that languages have been constantly changing, splitting up, and diverging, ever since language began. Largely as a result of this, in the ": null
    },
    {
        "42th": "20th century"
    },
    {
        " and ": null
    },
    {
        "42st centuries": "21st century"
    },
    {
        ", there has been a trend towards acknowledging diversity within languages as a natural consequence of language evolution, and more effort has been put into studying the diversity than in actively trying to reduce it.     However, this is not to say that linguistic uniformity is not without its advantages. If everyone agreed to a single common standard of ": null
    },
    {
        "grammar": "grammar"
    },
    {
        ", ": null
    },
    {
        "vocabulary": "vocabulary"
    },
    {
        ", ": null
    },
    {
        "orthography": "orthography"
    },
    {
        ", and ": null
    },
    {
        "pronunciation": "pronunciation"
    },
    {
        ", then communication would be made easier. On the other hand, much diversity would be lost, and the study of linguistics would lose a lot of its subject material. Which is more important is debatable.       Early ": null
    },
    {
        "dictionaries": "dictionary"
    },
    {
        ", such as that by ": null
    },
    {
        "Samuel Johnson": "samuel johnson"
    },
    {
        " in ": null
    },
    {
        "England": "england"
    },
    {
        " and later ": null
    },
    {
        "Noah Webster": "noah webster"
    },
    {
        " in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " played a large role in making ": null
    },
    {
        "spelling": "spelling"
    },
    {
        " more uniform. When dictionaries began to add pronunciation guides, they played a similar role there. At first, American dictionaries tended to avoid listing pronunciations that they considered non-standard, and thus they played a prescriptive role . However, following the general trend in linguistics, American dictionaries are now becoming more descriptive while British dictionaries are becoming less so ; this is the case in other respects as well as with pronunciation. For example, the pronunciation of the word nuclear as if it were spelled  nucular  is one that is frowned upon by some, but the pronunciation is listed in some dictionaries. However, to take this to mean that the pronunciation is considered either correct or incorrect is to misunderstand the role that these dictionaries are playing. They are simply reporting current usage.       The following are examples of processes by which pronunciation can change, together with explanations of why speakers view certain pronunciations to be mispronunciations. It should be noticed that both formal and slang English can be mispronounced.       There are many examples of words whose etymologies show them to have lost ": null
    },
    {
        "phoneme": "phoneme"
    },
    {
        "s  somewhere in their histories. For example, the silent k at the start of many words in the ": null
    },
    {
        "English language": "english language"
    },
    {
        " was originally pronounced. The word knight derives from the word cniht in ": null
    },
    {
        "Old English": "old english language"
    },
    {
        ". Here, two consonant sounds have been lost: not only the c, but also the h were sounded, the latter being a voiceless ": null
    },
    {
        "fricative": "fricative"
    },
    {
        ". Such changes have been happening throughout history, and few would seriously propose that we should reverse them all and pronounce knight as cniht. However, when the same thing happens in the present day, the simplified forms are widely labelled as incorrect . For example, the word Antarctic is etymologically derived from the word Arctic , and originally both cs were pronounced in the former word, as in the latter . This is still the usual pronunciation of the word. However, some speakers omit the first c sound from Antarctic, resulting in a pronunciation , of which some disapprove. The word Arctic itself has undergone a similar change, with a corresponding change in spelling; it is not unusual to see the word Artic in names of parks and populated areas.       The adoption of words and names from one language to another is also a process that has been going on since time immemorial, although it causes problems in that the ": null
    },
    {
        "phonology": "phonology"
    },
    {
        " of the source language is almost certainly going to be different from that in the destination language, and so mutation of the pronunciation is inevitable. This is perhaps even more of a thorny issue than the above examples of change within a language, because of the possibility that speakers of the source language may be upset at what they may see as the mangling of their language.     The issue is particularly complex because there are several different ways in which an originally foreign word can be used within a language, depending on the extent to which it has been integrated, and this extent varies continuously from the word being considered not a true part of the language at all to its being considered so much a part of the language that few who havent studied linguistics even know that it ever was foreign.     Many words  entered the English language from the ": null
    },
    {
        "Norman language": "norman language"
    },
    {
        " following the ": null
    },
    {
        "Conquest": "norman conquest"
    },
    {
        " of ": null
    },
    {
        "42": "1066"
    },
    {
        ". They have been so thoroughly integrated into the language that they are not generally considered to be foreign, and they follow the usual laws of English ": null
    },
    {
        "phonetics": "phonetics"
    },
    {
        " perfectly. Their current pronunciations have generally changed from the original ones, but no-one considers them to be mispronunciations, because the words were adopted so long ago.     Other words  have been adopted more recently, and are still considered to be foreign, retaining their ": null
    },
    {
        "diacritic": "diacritic"
    },
    {
        "s and often being written in italics to show their foreign status. However, they are usually pronounced in an English way , and it is uncommon for these to be labelled as mispronunciations.     Still other words, including proper nouns such as names of people and places, are not only written as foreign words, but often given their native pronunciation too. For example, the ": null
    },
    {
        "French": "french language"
    },
    {
        " term  mange tout   is often pronounced with a nasal vowel. To do otherwise, especially with a proper noun, is often considered a mispronunciation.     It bears noting, however, that this does not apply to pronunciation differences between dialects of the same language. For example, an American with the surname Carter would probably not be upset to hear an Englishman pronounce the name in ": null
    },
    {
        "received pronunciation": "received pronunciation"
    },
    {
        ", as , nor would an Englishman with the surname Carter be offended at hearing an American pronounce the name in a ": null
    },
    {
        "rhotic accent": "rhotic accent"
    },
    {
        ", as .        Analogical pronunciation : Mispronouncing a word due to similar spelling of another word.    Aphesis : Dropping the sound at the start of a word.    Aspiration : The sounding of an h sound at the beginning of a word whether needed or not. For example, the h in honor is not sounded but in happy it is. As with all pronunciation rules , conventions regarding the aspirated H differ from region to region. In parts of the US, it is customary to pronounce herb without the initial h sound, while in the UK, the initial h is aspirated. In ": null
    },
    {
        "My Fair Lady": "my fair lady"
    },
    {
        " , Professor Henry Higgins castigates those down in Soho Square, dropping aitches everywhere.    Epenthesis : The addition of one or more sounds to a word, especially to the interior of a word . Epenthesis may be divided into two types: excrescence, for the addition of a ": null
    },
    {
        "consonant": "consonant"
    },
    {
        ", and anaptyxis for the addition of a ": null
    },
    {
        "vowel": "vowel"
    },
    {
        ".    Metathesis : The reversal of letters within a word, such as iron being pronounced as iorn.    Shibboleth : Any distinguishing practice which is indicative of ones social or regional origin, usually referring to features of language, and particularly to a word whose pronunciation identifies its speaker as being a member or not a member of a particular group.    Spoonerism : The unintentional exchange of letters or syllables between two words or even within a word, often with comic results – especially when the result changes the speaker’s intended meaning. The term is named after the 42th century clergyman and academic Rev. ": null
    },
    {
        "William Spooner": "william archibald spooner"
    }
]