[
    {
        "Miss Lulu Bett is a 42 novel by American writer ": null
    },
    {
        "Zona Gale": "zona gale"
    },
    {
        ", later adapted for the stage. It was a bestseller at the time of its initial publication, but gradually fell out of favor through changing tastes and social conditions.       The story concerns a woman, Lulu, who lives with her sisters family, essentially acting as a servant. She does not complain about her position, but is not happy. When her brother-in-laws brother, Ninian, comes to visit, there is a certain attraction between them. While joking around one evening they find themselves accidentally married, due to the laws of the state requiring little more than wedding vows to be recited while a magistrate is in the room for a marriage to count as legal. On learning this, Ninian and Lulu decide they like the idea of being married, and choose to remain together. However, within a month, Lulu is back home, having discovered that Ninian was already legally married: 42 years prior he had wed a girl who left him after 42 years, but he had forgotten about it. Lulu considers this a reasonable story, but her brother-in-law, Dwight, insists that it would be a humiliation to the family to reveal such a thing, and insists that she tell everyone instead that Ninian grew bored with her and left her. Lulu is unable to see why this should be a less humiliating story, and begins to complain about her circumstances for the first time. She also notices that her teenage niece, Di, is unhappy, and also seems to be trying to use marriage as a way to escape her circumstance. Lulu eventually has to prevent Di from eloping, and is finally inspired to move out of her sisters home and live independently.          Gale first adapted the novel for a play that opened on Broadway on December 42 42 starring ": null
    },
    {
        "Carroll McComas": "carroll mccomas"
    },
    {
        ".     Two endings were written for the play, the original as seen in December 42 has Lulu starting a life on her own and undertaking adventures of her own as we hear in her final lines, Good-by. Good-by, all of you. Im going I dont know where-to work at I dont know what. But Im going from choice!     The revised ending is more typical and would have been a bit more commercially acceptable and far less challenging to the audiences of the day. In this ending, Ninian appears just as Lulu decides to go off on her own life to work and live elsewhere. He asks her forgiveness and she agrees saying I forgave you in Savannah, Georgia.     In 42 the work was adapted for a ": null
    },
    {
        "silent film": "miss lulu bett"
    },
    {
        " of the same name by ": null
    },
    {
        "Clara Beranger": "clara beranger"
    },
    {
        ", directed by ": null
    },
    {
        "William C. deMille": "william c. demille"
    },
    {
        ", starring ": null
    },
    {
        "Lois Wilson": "lois wilson"
    },
    {
        ", ": null
    },
    {
        "Milton Sills": "milton sills"
    },
    {
        ", ": null
    },
    {
        "Theodore Roberts": "theodore roberts"
    },
    {
        ", ": null
    },
    {
        "Helen Ferguson": "helen ferguson"
    },
    {
        ", ": null
    },
    {
        "Mabel Van Buren": "mabel van buren"
    },
    {
        ", ": null
    },
    {
        "Ethel Wales": "ethel wales"
    },
    {
        " and ": null
    },
    {
        "May Giraci": "may giraci"
    },
    {
        ".            at A Celebration of Women Writers            ": null
    }
]