[
    {
        "           In military language, a missile, also known as a guided missile, is a guided self-propelled flying weapon usually propelled by a ": null
    },
    {
        "jet engine": "jet engine"
    },
    {
        " or ": null
    },
    {
        "rocket motor": "rocket motor"
    },
    {
        ". This is in contrast to an unguided self-propelled flying munition, referred to as a ": null
    },
    {
        "rocket": "rocket"
    },
    {
        " . Missiles have four system components: targeting or ": null
    },
    {
        "missile guidance": "missile guidance"
    },
    {
        ", flight system, engine, and ": null
    },
    {
        "warhead": "warhead"
    },
    {
        ". Missiles come in types adapted for different purposes: ": null
    },
    {
        "surface-to-surface": "surface-to-surface missile"
    },
    {
        " and ": null
    },
    {
        "air-to-surface missiles": "air-to-surface missile"
    },
    {
        " , ": null
    },
    {
        "surface-to-air missiles": "surface-to-air missile"
    },
    {
        " , ": null
    },
    {
        "air-to-air missile": "air-to-air missile"
    },
    {
        "s, and ": null
    },
    {
        "anti-satellite weapon": "anti-satellite weapon"
    },
    {
        "s. Non-self-propelled airborne ": null
    },
    {
        "explosive devices": "explosive device"
    },
    {
        "are generally referred to as ": null
    },
    {
        "shells": "shell"
    },
    {
        " and usually have a shorter range than missiles. In ordinary language the word means an object which can be thrown, shot, or propelled toward a target.               The first missiles to be used operationally were a series of ": null
    },
    {
        "missiles": "list of world war ii guided missiles of germany"
    },
    {
        " developed by ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " in ": null
    },
    {
        "World War  II": "world war & nbsp;ii"
    },
    {
        ". Most famous of these are the ": null
    },
    {
        "V-1 flying bomb": "v-1 flying bomb"
    },
    {
        " and ": null
    },
    {
        "V-2 rocket": "v-2 rocket"
    },
    {
        ", both of which used a mechanical ": null
    },
    {
        "autopilot": "autopilot"
    },
    {
        " to keep the missile flying along a pre-chosen route.  History Learning Official Site V1 and V2 Weapons Less well known were a series of ": null
    },
    {
        "Anti-Ship": "anti-ship missile"
    },
    {
        " and ": null
    },
    {
        "Anti-aircraft": "surface-to-air missile"
    },
    {
        " missiles, typically based on a simple ": null
    },
    {
        "radio control": "radio control"
    },
    {
        "  system directed by the operator. However, these early systems in World War  II were only built in small numbers.  Article About V1 and V2 Weapons  Nation Archives V1 and V2 Weapons  Air and Space Museum V-2 Missile          Guided missiles have a number of different system components:   Guidance system   Targeting system   Flight system   ": null
    },
    {
        "Engine": "engine"
    },
    {
        " Warhead": "warhead"
    },
    {
        "          The most common method of guidance is to use some form of ": null
    },
    {
        "radiation": "radiation"
    },
    {
        ", such as ": null
    },
    {
        "infrared": "infrared homing"
    },
    {
        ", ": null
    },
    {
        "lasers": "laser guidance"
    },
    {
        "or ": null
    },
    {
        "radio wave": "radar guidance"
    },
    {
        "s, to guide the missile onto its target. This radiation may emanate from the target , it may be provided by the missile itself , or it may be provided by a friendly third party . The first two are often known as ": null
    },
    {
        "fire-and-forget": "fire-and-forget"
    },
    {
        " as they need no further support or control from the launch vehicle/platform in order to function. Another method is to use a ": null
    },
    {
        "TV guidance": "tv guidance"
    },
    {
        ", with a ": null
    },
    {
        "visible light": "visible light"
    },
    {
        " or infrared picture produced in order to see the target. The picture may be used either by a human operator who steering the missile onto its target or by a computer doing much the same job. One of the more bizarre guidance methods instead used a ": null
    },
    {
        "pigeon to steer a missile": "project pigeon"
    },
    {
        " to its target. Some missiles also have a home-on-jam capability to guide itself to a radar-emitting source. Many missiles use a combination of two or more of the methods to improve accuracy and the chances of a successful engagement.       Another method is to target the missile by knowing the location of the target and using a guidance system such as ": null
    },
    {
        "INS": "inertial navigation system"
    },
    {
        ", ": null
    },
    {
        "TERCOM": "tercom"
    },
    {
        " or ": null
    },
    {
        "satellite guidance": "satellite guidance"
    },
    {
        ". This guidance system guides the missile by knowing the missiles current position and the position of the target, and then calculating a course between them. This job can also be performed somewhat crudely by a human operator who can see the target and the missile and guide it using either cable- or ": null
    },
    {
        "radio": "radio-control"
    },
    {
        "-based remote control, or by an ": null
    },
    {
        "automatic system": "aclos"
    },
    {
        " that can simultaneously track the target and the missile.   Furthermore, some missiles use initial targeting, sending them to a target area, where they will switch to primary targeting, using either radar or IR targeting to acquire the target.       Whether a guided missile uses a targeting system, a guidance system or both, it needs a flight system. The flight system uses the data from the targeting or guidance system to maneuver the missile in flight, allowing it to counter inaccuracies in the missile or to follow a moving target. There are two main systems: vectored thrust and aerodynamic maneuvering .          Missiles are powered by an engine, generally either a type of ": null
    },
    {
        "rocket engine": "rocket engine"
    },
    {
        " or ": null
    },
    {
        "jet engine": "jet engine"
    },
    {
        ". Rockets are generally of the ": null
    },
    {
        "solid propellant": "solid-propellant rocket"
    },
    {
        " type for ease of maintenance and fast deployment, although some larger ballistic missiles use ": null
    },
    {
        "liquid-propellant rocket": "liquid-propellant rocket"
    },
    {
        "s. Jet engines are generally used in ": null
    },
    {
        "cruise missile": "cruise missile"
    },
    {
        "s, most commonly of the ": null
    },
    {
        "turbojet": "turbojet"
    },
    {
        " type, due to its relative simplicity and low frontal area. ": null
    },
    {
        "Turbofans": "turbofan"
    },
    {
        "and ": null
    },
    {
        "ramjets": "ramjet"
    },
    {
        "are the only other common forms of jet engine propulsion, although any type of engine could theoretically be used. Long-range missiles may have multiple engine stages, particularly in those launched from the surface. These stages may all be of similar types or may include a mix of engine types − for example, surface-launched cruise missiles often have a rocket booster for launching and a jet engine for sustained flight.     Some missiles may have additional propulsion from another source at launch; for example, the ": null
    },
    {
        "V1": "v1 flying bomb"
    },
    {
        " was launched by a catapult, and the ": null
    },
    {
        "MGM-51 Shillelagh": "mgm-51 shillelagh"
    },
    {
        " was fired out of a tank gun .       Missiles generally have one or more ": null
    },
    {
        "explosive": "explosive"
    },
    {
        " warhead": "warhead"
    },
    {
        "s, although other weapon types may also be used. The warheads of a missile provide its primary destructive power . Warheads are most commonly of the ": null
    },
    {
        "high explosive": "high explosive"
    },
    {
        " type, often employing ": null
    },
    {
        "shaped charges": "shaped charge"
    },
    {
        "to exploit the accuracy of a guided weapon to destroy hardened targets. Other warhead types include ": null
    },
    {
        "submunition": "submunition"
    },
    {
        "s, ": null
    },
    {
        "incendiaries": "incendiary device"
    },
    {
        ", ": null
    },
    {
        "nuclear weapon": "nuclear weapon"
    },
    {
        "s, ": null
    },
    {
        "chemical": "chemical weapon"
    },
    {
        ", ": null
    },
    {
        "biological": "biological weapon"
    },
    {
        " or ": null
    },
    {
        "radiological weapons": "radiological weapon"
    },
    {
        "or ": null
    },
    {
        "kinetic energy penetrator": "kinetic energy penetrator"
    },
    {
        "s.   Warheadless missiles are often used for testing and training purposes.          Missiles are generally categorized by their launch platform and intended target. In broadest terms, these will either be surface or air, and then sub-categorized by range and the exact target type . Many weapons are designed to be launched from both surface or the air, and a few are designed to attack either surface or air targets . Most weapons require some modification in order to be launched from the air or surface, such as adding ": null
    },
    {
        "boosters": "booster"
    },
    {
        " to the surface-launched version.       After the boost stage, ballistic missiles follow a ": null
    },
    {
        "trajectory": "trajectory"
    },
    {
        " mainly determined by ": null
    },
    {
        "ballistics": "ballistics"
    },
    {
        ". The guidance is for relatively small deviations from that.     Ballistic missiles are largely used for land attack missions. Although normally associated with nuclear weapons, some conventionally armed ballistic missiles are in service, such as ": null
    },
    {
        "MGM-140 ATACMS": "mgm-140 atacms"
    },
    {
        ". The V2 had demonstrated that a ballistic missile could deliver a warhead to a target city with no possibility of interception, and the introduction of ": null
    },
    {
        "nuclear weapons": "nuclear weapon"
    },
    {
        "meant it could efficiently do damage when it arrived. The accuracy of these systems was fairly poor, but post-war development by most military forces improved the basic ": null
    },
    {
        "Inertial navigation system": "inertial navigation system"
    },
    {
        " concept to the point where it could be used as the guidance system on ": null
    },
    {
        "Intercontinental ballistic missiles": "intercontinental ballistic missile"
    },
    {
        "flying thousands of kilometers. Today, the ballistic missile represents the only ": null
    },
    {
        "strategic deterrent": "deterrence theory"
    },
    {
        " in most military forces; however, some ballistic missiles are being adapted for conventional roles, such as the Russian ": null
    },
    {
        "Iskander": "9k720 iskander"
    },
    {
        " or the Chinese ": null
    },
    {
        "DF-21D": "df-21df-21d"
    },
    {
        " anti-ship ballistic missile": "anti-ship ballistic missile"
    },
    {
        ". Ballistic missiles are primarily surface-launched from ": null
    },
    {
        "mobile launchers": "transporter erector launcher"
    },
    {
        ", ": null
    },
    {
        "silos": "missile silo"
    },
    {
        ", ": null
    },
    {
        "ships": "warship"
    },
    {
        " or ": null
    },
    {
        "submarines": "ballistic missile submarine"
    },
    {
        ", with ": null
    },
    {
        "air launch": "albm"
    },
    {
        " being theoretically possible with a weapon such as the cancelled ": null
    },
    {
        "Skybolt": "gam-87 skybolt"
    },
    {
        " missile.     The ": null
    },
    {
        "Russia": "russia"
    },
    {
        "n ": null
    },
    {
        "Topol M ": "rt-2pm2 topol-m"
    },
    {
        " is the fastest missile currently in service.           The ": null
    },
    {
        "V1": "v-1 flying bomb"
    },
    {
        " had been successfully intercepted during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", but this did not make the ": null
    },
    {
        "cruise missile": "cruise missile"
    },
    {
        " concept entirely useless. After the war, the US deployed a small number of nuclear-armed cruise missiles in Germany, but these were considered to be of limited usefulness. Continued research into much longer-ranged and faster versions led to the USs ": null
    },
    {
        "SM-64 Navaho": "sm-64 navaho"
    },
    {
        " and its ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " counterparts, the ": null
    },
    {
        "Burya": "burya"
    },
    {
        " and ": null
    },
    {
        "Buran cruise missile": "buran cruise missile"
    },
    {
        ". However, these were rendered largely obsolete by the ": null
    },
    {
        "ICBM": "icbm"
    },
    {
        ", and none were used operationally. Shorter-range developments have become widely used as highly accurate attack systems, such as the US ": null
    },
    {
        "Tomahawk missile": "tomahawk missile"
    },
    {
        " and Russian ": null
    },
    {
        "Kh-55": "kh-55"
    },
    {
        " . Cruise missiles are generally further divided into subsonic or supersonic weapons - supersonic weapons such as ": null
    },
    {
        "BrahMos": "brahmos"
    },
    {
        " are difficult to shoot down, whereas subsonic weapons tend to be much lighter and cheaper allowing more to be fired.     Cruise missiles are generally associated with ": null
    },
    {
        "land-attack operations": "land-attack missile"
    },
    {
        ", but also have an important role as anti-shipping weapons. They are primarily launched from air, sea or submarine platforms in both roles, although land-based launchers also exist.          Another major German missile development project was the anti-shipping class , intended to stop any attempt at a cross-channel invasion. However, the British were able to render their systems useless by jamming their radios, and missiles with ": null
    },
    {
        "wire guidance": "wire guided missile"
    },
    {
        " were not ready by ": null
    },
    {
        "D-Day": "d-day"
    },
    {
        ". After the war, the anti-shipping class slowly developed and became a major class in the 1960s with the introduction of the low-flying jet- or rocket-powered cruise missiles known as sea-skimmers . These became famous during the ": null
    },
    {
        "Falklands War": "falklands war"
    },
    {
        ", when an Argentine ": null
    },
    {
        "Exocet missile": "exocet"
    },
    {
        " sank a ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " destroyer.     A number of ": null
    },
    {
        "anti-submarine missiles": "anti-submarine missile"
    },
    {
        "also exist; these generally use the missile in order to deliver another weapon system such as a ": null
    },
    {
        "torpedo": "torpedo"
    },
    {
        " or ": null
    },
    {
        "depth charge": "depth charge"
    },
    {
        " to the location of the submarine, at which point the other weapon will conduct the underwater phase of the mission.          By the end of WWII, all forces had widely introduced unguided rockets using ": null
    },
    {
        "High-explosive anti-tank warheads": "high-explosive anti-tank warhead"
    },
    {
        "as their major anti-tank weapon . However, these had a limited useful range of 100 m or so, and the Germans were looking to extend this with the use of a missile using ": null
    },
    {
        "wire guidance": "wire-guided missile"
    },
    {
        ", the X-7. After the war, this became a major design class in the later 1950s and, by the 1960s, had developed into practically the only non-tank anti-tank system in general use. During the 1973 ": null
    },
    {
        "Yom Kippur War": "yom kippur war"
    },
    {
        " between Israel and Egypt, the ": null
    },
    {
        "9M14 Malyutka": "9m14 malyutka"
    },
    {
        " man-portable anti-tank missile proved potent against Israeli tanks. While other guidance systems have been tried, the basic reliability of wire guidance means this will remain the primary means of controlling anti-tank missiles in the near future. Anti-tank missiles may be launched from aircraft, vehicles or by ground troops in the case of smaller weapons.              By 1944, US and British air forces were sending huge air fleets over occupied Europe, increasing the pressure on the ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " day and night fighter forces. The Germans were keen to get some sort of useful ground-based anti-aircraft system into operation. Several systems were under development, but none had reached operational status before the wars end. The ": null
    },
    {
        "US Navy": "united states navy"
    },
    {
        " also started missile research to deal with the ": null
    },
    {
        "Kamikaze": "kamikaze"
    },
    {
        " threat. By 1950, systems based on this early research started to reach operational service, including the ": null
    },
    {
        "US Armys": "united states army"
    },
    {
        " MIM-3 Nike Ajax": "mim-3 nike ajax"
    },
    {
        " and the Navys 3Ts , soon followed by the Soviet ": null
    },
    {
        "S-25 Berkut": "s-25 berkut"
    },
    {
        " and ": null
    },
    {
        "S-75 Dvina": "s-75 dvina"
    },
    {
        " and French and British systems. Anti-aircraft weapons exist for virtually every possible launch platform, with surface-launched systems ranging from huge, self-propelled or ship-mounted launchers to man-portable systems. Subsurface-to-air missiles are usually launched from below water .             Like most missiles, the ": null
    },
    {
        "S-300": "s-300"
    },
    {
        ", ": null
    },
    {
        "S-400 ": "s-400"
    },
    {
        ", ": null
    },
    {
        "Advanced Air Defence": "advanced air defence"
    },
    {
        " and ": null
    },
    {
        "MIM-104 Patriot": "mim-104 patriot"
    },
    {
        " are for defense against short-range missiles and carry explosive warheads.     In the case of a large closing speed, ": null
    },
    {
        "a projectile without explosives": "projectileexplosive charge or kinetic"
    },
    {
        " is used; just a ": null
    },
    {
        "collision": "collision"
    },
    {
        " is sufficient to destroy the target. See ": null
    },
    {
        "Missile Defense Agency": "missile defense agency"
    },
    {
        " for the following systems being developed:     ": null
    },
    {
        "Arrow 3": "arrow 3"
    },
    {
        " Kinetic Energy Interceptor": "kinetic energy interceptor"
    },
    {
        "   Aegis Ballistic Missile Defense System": "aegis ballistic missile defense system"
    },
    {
        " - an ": null
    },
    {
        "SM-3": "rim-161 standard missile 3"
    },
    {
        " missile with a Lightweight Exo-Atmospheric Projectile Kinetic Warhead            Soviet ": null
    },
    {
        "RS-82 rockets": "rs-82"
    },
    {
        "were successfully tested in combat at the ": null
    },
    {
        "Battle of Khalkhin Gol": "battle of khalkhin gol"
    },
    {
        " in 1939.     German experience in World War  II demonstrated that destroying a large aircraft was quite difficult, and they had invested considerable effort into ": null
    },
    {
        "air-to-air missile": "air-to-air missile"
    },
    {
        " systems to do this. Their ": null
    },
    {
        "Messerschmitt Me 262s": "messerschmitt me 262"
    },
    {
        "jets often carried R4M rockets, and other types of bomber destroyer aircraft had unguided rockets as well. In the post-war period, the R4M served as the pattern for a number of similar systems, used by almost all interceptor aircraft during the 1940s and 1950s. Most rockets  had to be carefully aimed at relatively close range to hit the target successfully. The ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " and ": null
    },
    {
        "U.S. Air Force": "u.s. air force"
    },
    {
        " began deploying guided missiles in the early 1950s, most famous being the US Navys ": null
    },
    {
        "AIM-9 Sidewinder": "aim-9 sidewinder"
    },
    {
        " and the USAFs ": null
    },
    {
        "AIM-4 Falcon": "aim-4 falcon"
    },
    {
        ". These systems have continued to advance, and modern air warfare consists almost entirely of missile firing. In the ": null
    },
    {
        "Falklands War": "falklands war"
    },
    {
        ", less powerful British ": null
    },
    {
        "Harriers": "harrier jump jet"
    },
    {
        " were able to defeat faster Argentinian opponents using AIM-9L missiles provided by the United States as the conflict began. The latest heat-seeking designs can lock onto a target from various angles, not just from behind, where the heat signature from the engines is strongest. Other types rely on radar guidance . Air-to-air missiles also have a wide range of sizes, ranging from helicopter-launched self-defense weapons with a range of a few kilometers, to long-range weapons designed for interceptor aircraft such as the ": null
    },
    {
        "R-37 ": "r-37"
    },
    {
        ".          In the 1950s and 1960s, Soviet designers started work on an anti-satellite weapon, called the ": null
    },
    {
        "Istrebitel Sputnik": "istrebitel sputnik"
    },
    {
        ", which literally means interceptor of satellites or destroyer of satellites . After a lengthy development process of roughly twenty years, it was finally decided that testing of the Istrebitel Sputnik be canceled. This was when the United States started testing their own systems. The ": null
    },
    {
        "Brilliant Pebbles": "strategic defense initiative"
    }
]