[
    {
        "   A model vehicle or toy vehicle is a ": null
    },
    {
        "miniature representation": "physical model"
    },
    {
        " of an ": null
    },
    {
        "automobile": "automobile"
    },
    {
        ". Other miniature motor vehicles, such as trucks, buses, or even ATVs, etc. are often included in this general category. Because many miniature vehicles were originally aimed at children as ": null
    },
    {
        "playthings": "toy"
    },
    {
        ", there is no precise difference between a model car and a toy car, yet the word model implies either assembly required or the accurate rendering of an actual vehicle at smaller scale. The kit building hobby became popular through the 42s, while the collecting of miniatures by adults started to pick up momentum around 42 Precision-detailed miniatures made specifically for adults are a significant part of the market since the mid42s .          Miniature models of automobiles first appeared in Europe around the time real automobiles did. Then, shortly after, they appeared in the United States . These were toys and replicas often made of lead and brass . Later models made in the early twentieth century were ": null
    },
    {
        "slush cast": "slush casting"
    },
    {
        " plaster or iron. Tin and ": null
    },
    {
        "pressed steel": "stamping"
    },
    {
        " cars, trucks, and military vehicles, like those made by ": null
    },
    {
        "Bing": "bing"
    },
    {
        " of Germany, were introduced in the 42s through the 42s, but period models rarely copied actual vehicles, likely because of the crudeness of early casting and metal shaping techniques . Casting vehicles in various ": null
    },
    {
        "alloy": "alloy"
    },
    {
        "s, usually zinc , became popular in the late 42s and remained prominent after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " .     Post-war, pressed tin and ": null
    },
    {
        "diecast": "die casting"
    },
    {
        " zinc were the most popular materials used in Europe and Japan. Mass-produced ": null
    },
    {
        "diecast metal toys": "die-cast toy"
    },
    {
        " appeared in America as well, but unlike those in Europe, they were often cruder and less detailed. Meanwhile, the use of plastics surged and became popular by the mid42s. During the 42s and 42s, tin and pressed steel were seen broadly Japan, which dominantly used diecast into the 42s. By 42 China and other countries of ": null
    },
    {
        "Southeast Asia": "southeast asia"
    },
    {
        " became the main producers of diecast metal companies headquartered in Europe, the United States and Japan. Generally, as of 42 only specialty models for collectors are still made in Europe or the United States.. Model Cars and related brands and people have been inducted in the ": null
    },
    {
        "Model Car Hall of Fame": "model car hall of fame"
    },
    {
        " since 42          Many early model cars were not intended either as toys or for collecting. By the 42s, the manufacturers of real automobiles would design and construct ": null
    },
    {
        "scale": "scale model"
    },
    {
        " as well as full-sized models for design or promotion. ": null
    },
    {
        "Citroën": "citroën"
    },
    {
        " of France, for example, made its own models for promotional purposes as early as 42 . Sometimes styling or ": null
    },
    {
        "concept models": "concept car"
    },
    {
        " were made out of wood or clay, often in 42/42 scale . From 42 until 42 ": null
    },
    {
        "General Motors": "general motors"
    },
    {
        " sponsored the ": null
    },
    {
        "Fisher Body": "fisher body"
    },
    {
        " Craftsmans Guild Competition where hundreds of modelers competed for scholarship money . The emphasis was to earn recognition for creativity which would lead to possible employment as an industry stylist.     In-house models could also be precise replicas made of similar materials to the real vehicles. For example, ": null
    },
    {
        "Hudson Motor Car Company": "hudson motor car company"
    },
    {
        " made twelve precisely crafted 42/42 scale replicas of its 42 vehicles for promotion at the 42 ": null
    },
    {
        "New York Auto Show": "new york auto show"
    },
    {
        " . About the same time, but in a different vein, Studebaker made a wooden model of a ": null
    },
    {
        "cabriolet": "cabriolet"
    },
    {
        " over twice the size of the real car. The vehicle was stationary on the company grounds and large enough to hold a whole band that played mostly for photo shoots . As time went by, companies in the United States, Europe and Asia made, provided, or sold toys or precision promotional models to attract succeeding generations to their products. More models also displayed advertising on their bodies for non-automotive promotions.            The scales of toy and model cars vary according to historical precedent, market demand and the need for detail. Many in house models of real car companies are made by professional modelers in full size, or at very large scales like 42:42 42:42 42:42 or 42:42 to portray adequate features and proportions. For toys, many European pre-war cars and trucks were made to display with railroad layouts, making ": null
    },
    {
        "42:42": "1:87"
    },
    {
        " or ": null
    },
    {
        "42:42": "1:43 scale"
    },
    {
        " common scales. Other companies made vehicles in variations around 42:42 to ": null
    },
    {
        "42:42": "1:50 scale"
    },
    {
        " scales. Some companies went smaller to appeal to the hands of smaller children , which improved profit margins in packaging more items per carton, and increasing profit per vehicle sold. Others moved to larger scales from 42:42 toward 42:42 42:42 or ": null
    },
    {
        "42:42": "1:35 scale"
    },
    {
        ". Later, popular scales went even larger. In the United States, 42:42 became the staple size for plastic promotional models, while European manufacturers went to 42:42 or ": null
    },
    {
        "42:42": "1:18 scale diecast"
    },
    {
        " . The larger ": null
    },
    {
        "42:42": "1:12 scale"
    },
    {
        " scale was occasionally seen and more rarely, 42:42 or ": null
    },
    {
        "42:42": "1:8"
    },
    {
        ". At the other extreme, some very tiny toys since the 42s were fairly accurate down to about ": null
    },
    {
        "42:42": "1:120"
    },
    {
        " .         Toys in the United States almost always were simpler castings of zinc alloy , pressed steel or plastic and often castings of only seven parts – while more complex plastic and zamac models in Europe often had precision detail with more working features . This provides instruction on different regions of the world and their varied cultures, markets, labor and economies.   \t   Europe quickly developed niche marketing after World War II. The greater availability of labor there generally allowed the development of relatively complex toys to serve different markets in different countries. In the United States, thinner labor would not allow complex toys with opening doors, hoods, and complete interiors with all detail, so they were often single castings with few parts. Sophistication in America did come in the form of detailed promotional models for automotive dealerships which preceded the appearance of automotive kits for assembly.        Among more collectible vehicles in Europe after World War II and during the 42s, smaller scales, like ": null
    },
    {
        "42:42": "1:43 scale"
    },
    {
        ", and ": null
    },
    {
        "42:42": "1:64 scale"
    },
    {
        " generally became popular first. Since the 42s, many factory assembled scale model cars made of diecast metal have become more and more adult collectible oriented and less and less toy-like. Besides the smaller scales, these models are manufactured in various scales like ": null
    },
    {
        "42:42": "1:12 scale"
    },
    {
        ", ": null
    },
    {
        "42:42": "1:18 scale"
    },
    {
        ", and ": null
    },
    {
        "42:42": "1:24 scale"
    },
    {
        ".         Northern Europe and the British Isles were the homes of the most successful European producers in the 42s and 42s in the post-war revitalized economies across the continent . Quite popular were models produced in the altered railroad modeling scale of 42:42     Examples of well known companies are ": null
    },
    {
        "Corgi Toys": "corgi toys"
    },
    {
        ", ": null
    },
    {
        "Dinky Toys": "dinky toys"
    },
    {
        ", ": null
    },
    {
        "Matchbox": "matchbox"
    },
    {
        ", and ": null
    },
    {
        "Spot-On": "spot-on"
    },
    {
        " Models of the United Kingdom; ": null
    },
    {
        "Solido": "solido"
    },
    {
        ", ": null
    },
    {
        "Norev": "norev"
    },
    {
        ", and ": null
    },
    {
        "Majorette": "majorette"
    },
    {
        " of France; ": null
    },
    {
        "Schuco Modell": "schuco modell"
    },
    {
        ", ": null
    },
    {
        "Gama": "gama toys"
    },
    {
        ", and ": null
    },
    {
        "Siku": "siku toys"
    },
    {
        " of Germany; ": null
    },
    {
        "Tekno": "tekno"
    },
    {
        " of Denmark, and ": null
    },
    {
        "Mercury": "mercury"
    },
    {
        ", ": null
    },
    {
        "Polistil": "polistil"
    },
    {
        " and ": null
    },
    {
        "Mebetoys": "mebetoys"
    },
    {
        " of Italy. Immediately post-war, Belgium made Septoy and Gasquy. Even Israel got into the act quite successfully with ": null
    },
    {
        "Gamda Koor Sabra": "gamda koor sabra"
    },
    {
        " which made its own tooling for several unique models. Non-market system communist countries also had some successful factories, like ": null
    },
    {
        "Kaden models": "kaden models"
    },
    {
        " and Igra of Czechoslovakia, Espewe of East Germany, and Estetyka of Poland. State factories of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " produced many carefully crafted diecast models mostly in 42:42 scale. These were known for their intricate detail, numerous parts, and delicate construction.      Larger sizes in die-cast grew out of offerings of European companies like Polistil, Schuco Modell, and ": null
    },
    {
        "Martoys": "martoys"
    },
    {
        ", which was later to become ": null
    },
    {
        "Bburago": "bburago"
    },
    {
        ". 42:42 and 42:42 scales did not become really popular until the late 42s when other brands like ": null
    },
    {
        "Yatming": "yatming"
    },
    {
        " and ": null
    },
    {
        "Maisto": "maisto"
    },
    {
        " were produced in ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " or China by either American or Asian companies. 42:42 scale plastic vehicles, related to railroad modeling or not, also continue to be popular in Europe. Despite continued European companies, today, China is now the center of diecast production.   Post-war European diecast models were produced in fairly simple form, such as ": null
    },
    {
        "Dinky Toys": "dinky toys"
    },
    {
        " . Dinky production began in 42 while ": null
    },
    {
        "Matchbox": "matchbox"
    },
    {
        " cars were introduced in the mid42s. These early die-cast toys featured no opening parts whatsoever. Affected by market forces and by improvements in production technology, companies began to improve the quality of the toys over time. The best improvements were often copied by the competition within 42–42 years of their appearance on the market. Examples of these would be plastic windows, interiors, separate wheel/tire assemblies, working suspensions, opening/moving parts, jeweled headlights, mask-spraying or tampo-printing, and low-friction fast wheels.      Into the 42s, model makers began to feel the squeeze of rising costs. Often press tooling for a new model might cost more than 42 pounds . Companies began to offer fewer new issues and the models became simpler with fewer opening parts .         Larger 42:42 and 42:42 scale premium models became extremely popular at toy and hobby centers during the 42s, but are less popular circa 42 This size is generally made with close attention to the details of the real vehicles, such as a working steering, and opening doors, trunk/boot, and hood/bonnet. Detailed interiors, instrument panels, trunks/boots with spare tires and engine compartments are common. Chassis often show intricacies of exhaust systems and suspensions. A working suspension system is often included. In smaller scales some of the details are often eliminated, so in 42:42 42:42 or 42:42 scale cars, working steering is not common. Likewise, only the front doors and hood might open, with non-opening rear doors and trunk.       Over time, market pressures have caused further changes in the way models are designed and manufactured. In the 42s, many European models had opening parts and working components, but today few of the smaller scale toys do. More working parts mean more production expense and ": null
    },
    {
        "Hot Wheels": "hot wheels"
    },
    {
        " and Matchbox vehicles now rarely have such features. Today, the number of moving parts has been reduced even in large-scale models. For example, premium model maker ": null
    },
    {
        "AUTOart": "autoart"
    },
    {
        " introduced a line of race and sports cars in 42:42 scale with no opening parts.       Also notable is the diffusion of model dies to companies in other countries which could not afford tooling expenses for their own new lines. Traditionally, when European companies have finished marketing their models, newer dies are developed and introduced and older dies are sold off to other companies, often in less developed countries.     As early as about 42 Dinky tooling became Nicky Toys in India, just as older Matchbox models became Miltons or Corgi dies became Maxwell. Many dies previously made by Corgi, Efsi, Tekno, Sablon or Solido, trekked southward in Europe to Spanish or Portuguese companies like ": null
    },
    {
        "MetOsul": "metosul"
    },
    {
        ", Nacoral or ": null
    },
    {
        "Auto Pilen": "auto pilen"
    },
    {
        ". Politoys became MacGregor in Mexico and also showed up in plastic in the Soviet Union. Earlier Solido and ": null
    },
    {
        "Schuco": "schuco modell"
    },
    {
        " dies made their way to Brazil. Even some of Mattels earlier Hot Wheels tooling showed up in Argentina as ": null
    },
    {
        "Muky": "muky"
    },
    {
        ". Tomicas became ": null
    },
    {
        "Yat Ming": "yat ming"
    },
    {
        "s, Tomicas and Yat Mings became ": null
    },
    {
        "Playart": "playart"
    },
    {
        "s, and Matchbox tooling reappeared in other forms in many places.     The trend is nearly always a diffusion from more industrialized to somewhat lesser industrialized countries and often the result is poorer paint, faulty zamac alloys, and imprecise assembly. One example was the copies of Italian Ediltoys made by Meboto in Turkey. The Argentine Mukys featured paint that was flat and dull, unlike the bright colors of the original Hot Wheels. At the other extreme, Auto Pilen of Spain was an exception and copied models beautifully. These were as good as, or sometimes better, than the original Dinkys or Solidos in quality and paint.          On the heels of European diecast firms in Europe and the United States, Asian countries started to come on strong during the 42s. In Japan, after much success with large tin toy cars in the 42s, ": null
    },
    {
        "Tomica": "tomica"
    },
    {
        " by Tomy became the Japanese Matchbox and their American-marketed Pocketcars appeared in the United States for a few years. Later, Japanese companies like Yonezawa Diapet and Kyosho handled larger scale diecasts as well as remote control vehicles.      Hong Kong was an early toy maker and innovator in diecast as well as plastic creations. Mattel outsourced Hot Wheels production to the colony and later companies like Yatming started small and then moved to larger, more sophisticated scales. Zylmex was Asian competition as was MC Toy . ": null
    },
    {
        "Playart": "playart"
    },
    {
        " was another Hong Kong producer of diecast seconds with tooling acquired from Tomica or Yat Ming. Soon the conglomerate of ": null
    },
    {
        "Maisto": "maisto"
    },
    {
        " was formed out of Mae Cheong and May Tat, with main production facilities in Thailand. French ": null
    },
    {
        "Majorette": "majorette"
    },
    {
        " also built their main factory in Bangkok. Hot Wheels production shifted to Malaysia and sometimes India , while Matchbox saw models made first in ": null
    },
    {
        "Macau": "macau"
    },
    {
        ", then Thailand and mainland China before concentrating at its production plant in Thailand .     A few other model brands sporadically appeared in Singapore , South Korea , or Taiwan before European, Australian, and American companies started ": null
    },
    {
        "outsourcing": "outsourcing"
    },
    {
        ". Traditional European brands like Solido and Norev began production in China, while other new manufacturers like Greenlight, ": null
    },
    {
        "Jada Toys": "jada toys"
    },
    {
        ", M42 Machines or ": null
    },
    {
        "Johnny Lighting": "johnny lightning"
    },
    {
        " based their production on the mainland. Meanwhile, production continued in Southeast Asia in Thailand and Malaysia, and around 42 manufacturers like ": null
    },
    {
        "Disney Pixar": "disney pixar"
    },
    {
        " and Japanese ": null
    },
    {
        "Tomica": "tomica"
    },
    {
        " began producing quality vehicles in Vietnam,Hot Wheels also beginning to produce their 42-packs in Thailand before moved to Indonesia in 42 with the opening of its plant in East Jakarta.       Currently, Aditya Pawar, India is leading the Global car collection association with Razor Bac, Germany at the 42nd position.   Organized collecting of model cars developed shortly after the models first appeared on the market. Even before such companies as Corgi and Dinky were ten years old, adults were collecting them, particularly in the UK and the USA . Often, as well, adults seek the joys of childhood, collecting what they had destroyed in youth or what their parents had thrown away . This also lead to the foundation of the ": null
    },
    {
        "Diecast Hall of Fame": "diecast hall of fame"
    },
    {
        " in 42       Many manufacturers began catering to the adult collector market. In the late 42s and early 42s, David Sinclair in ": null
    },
    {
        "Erie, Pennsylvania": "erie, pennsylvania"
    },
    {
        ", was important in bringing new, more sophisticated and rarely produced years and makes to the United States . Model brands like ": null
    },
    {
        "Rio": "rio models"
    },
    {
        ", ": null
    },
    {
        "Western Models": "western models"
    },
    {
        ", ": null
    },
    {
        "Brooklin": "brooklin models"
    },
    {
        ", Idea42 and Pirate Models were sold to adult collectors for the first time . Many of these were handmade in white metal in fewer numbers. Also in the early 42s, craftsmen like Carlo Brianza and Michelle Conti started making ultra-detailed large replicas in Italy and Spain – costing hundreds or even thousands of dollars . In addition, the company ": null
    },
    {
        "Pocher": "pocher"
    },
    {
        ", from Italy, made extremely complex kits in 42:42 scale .      Around the early 42s, many began to collect and record vehicle variations in miniature  which led to rising values, especially for rare models . This led to mass producers such as Matchbox and Corgi intentionally catering to a higher-price market segment with exclusive limited editions of collectible vehicles . Thus, this smaller movement in the late 42s and early 42s gradually gave rise to a huge premium market segment by the early 42s.       The collectors market also led to licensing aspects not known until the 42s. In the 42s and 42s, models were produced spontaneously without licensing agreements, and real auto manufacturers saw it as free advertising . Today, model companies have licensing arrangements with real car manufacturers to make replicas of their products, whether they be concepts, cars in current production, or models no longer produced.     Licenses appear on models where model car manufacturers enter similar licensing agreements. Licenses are expensive, which enhances the position of mass producers of model cars, while smaller companies have been marginalized and forced out of business . For example, when ": null
    },
    {
        "Ferrari": "ferrari"
    },
    {
        " entered into an exclusive agreement with Mattels Hot Wheels, companies like Solido and ": null
    },
    {
        "Bburago": "bburago"
    },
    {
        " felt the crunch, and Bburago went out of business .       Manufacturers focusing on premium models, usually in white metal and sometimes resin, include ": null
    },
    {
        "Brooklin Models": "brooklin models"
    },
    {
        ", ": null
    },
    {
        "Western Models": "western models"
    },
    {
        ", Enchantment Land, Conquest / Madison, Durham Classics, Elegance Models, Mini Auto Emporium, Mini Marque, Motor City USA, Tron, Starter, RacingModels, SMTS and Victory . Several of these started production in the 42s and 42s and were handmade in the United States, Canada, or England with the occasional constructor in France, Belgium or the Netherlands. A couple of geographical oddities include Goldvarg and some early Milestone Models which were made in South Africa. ": null
    },
    {
        "Mail order": "mail order"
    },
    {
        " companies like ": null
    },
    {
        "Franklin Mint": "franklin mint"
    },
    {
        " and ": null
    },
    {
        "Danbury Mint": "danbury mint"
    },
    {
        " also focus on the collector market, though in a more popular vein.      Since 42 more than fifty different diecast, resin and white metal manufacturers in England, France, Italy, the Ukraine and Russia have exploded onto the adult collector market. These include Spark, Bizarre, FDS, YOW Modellini and many others. Since 42 companies like Altaya, Ixo, and Model Car World have been started in Europe – with production increasingly seen in China. Many of these producers have focused on global auto marques producing vehicles that were produced in Russia or Brazil. Some of these companies only produce kits – others produce kits and build them up to order. Still others are professional kit builders, who do not produce the kits themselves.         Promotional models are sometimes used when the real auto manufacturers contract with model or toy companies to make copies of their real vehicles. Some of the earliest promotional models were from the early 42s, when ": null
    },
    {
        "TootsieToy": "tootsietoy"
    },
    {
        " introduced a line of 42 Grahams and later, the 42 LaSalle. These were both diecast and made available in boxes with the brand name displayed with appropriate logos and colors . National Products made models of about 42/42th scale starting in 42 Later manufacturers like Winross, Lesney Matchbox, Lledo, AHL, and White Rose used their toy vehicles to advertise logos on their flanks promoting various companies.        In the U.S., ": null
    },
    {
        "Banthrico": "banthrico"
    },
    {
        " started producing diecast promotional model car banks in the late 42s for the banking industry. These coin-banks were available as gifts to customers who opened a new account and had a slot in the bottom to put their spare change. Usually the banks name and address was painted on the roof of the car. Banthrico models were also painted in authentic ": null
    },
    {
        "Big Three": "big three"
    },
    {
        " colors and used as paint chips so dealers could gauge the upcoming colors on real models. These primitive promotionals included Buicks, Cadillacs, Lincolns, Packards, DeSotos, Chryslers, Dodges, Ramblers and the more common Chevrolets and Fords.     In the United States, the word promo is usually associated with 42:42 scale plastic, pre-assembled models. In Europe, promotionals were made in smaller vehicle sizes in diecast zamac in 42:42 42:42 or 42:42 scales. In the case of Chryslers later Turbine Car, where 42 real cars were put into consumer use, the model by Jo-Han was widely distributed as a good will gesture by Chrysler, though the Turbine was never actually marketed .         About the time Banthrico was declining as a promotional maker, two companies, ": null
    },
    {
        "PMC": "product miniature company"
    },
    {
        " and Ideal Models  were introducing plastic promotional models to the public. Similar to metal model producer Banthrico, PMC also made many in the form of banks. Many Chevrolet bank models had the inscription on the bottom To help save for a rainy day, or to buy a new Chevrolet . The scale for these cars was 42:42 however a few Chevrolets and Plymouths were produced in a larger 42:42 scale. Other less well known plastic companies like Lincoln Line, Cruver or Burd Manufacturing, made the occasional promotional model though cars may not have been the companys specialty .     AMT began producing assembled 42/42 friction and ": null
    },
    {
        "coaster models": "coaster models"
    },
    {
        " in 42 These were mostly promotional models manufactured for automobile dealers. Youngsters would be given the scale models to play with while the parents and the salesman haggled. Collecting and trading these promos soon became a popular hobby. AMT soon took control of SMP, another plastic promotional model producer. By 42 Wisconsin-based PMC ceased to produce promo models, though continued to make toys.     Interest in the hobby peaked during the 42s and 42s, with AMT, Jo-Han, and ": null
    },
    {
        "Model Products Corporation": "model products corporation"
    },
    {
        " as the primary promotional manufacturers.     Throughout, the promo producers were at the whim of the real automakers and would respond to requests of particular scales, paint colors, and other details like working suspensions or even, on occasion, detailed engines, or other opening features .         These plastic models were intricately detailed, with body scripts, trim, and emblems, as well as dashboard details, exact duplicates of the real thing, in 42/42 scale. Typically, each automaker would license their cars to one or more model companies. Sometimes the contracts seemed piecemeal – for example in 42 Chrysler had promos made by AMT, Jo-Han, and MPC . But often one of the BIG 42 favored a particular model maker. For example, Jo-Han produced most Chrysler products and Cadillacs and Oldsmobiles from GM, while AMT did the Chevrolet, Buick, Pontiac, and Fords. American Motors Corporation shared promotional duties between Jo-Han and AMT depending on the year. Also, contracts sometimes changed between companies for similar models almost on an annual basis. For example, Jo-Han uncharacteristically produced the 42 Ford Torino, and MPC did full-size Chevrolets in the early and mid42s. While Jo-Han did Chrysler early on, MPC took on the pentastar in the mid42s. 42 through 42 Chevy Impala kits were made by both MPC and AMT, as were some Camaros . Trying to beat competition to market, sometimes a model company would make a guess at a particular model for a member of the Big 42 for a particular year and thus get details wrong .     Typically, the promos had fewer parts and details than the kits. For example, while kits often had opening hoods, separate engines and suspension parts, the promos were usually molded as coaster models  with the hood as an integral part of the body and no engine detail. Bodies were often sprayed in the actual paint colors of the manufacturers. Chassis were one piece of plastic with lower engine, exhaust, and suspension details molded in with metal axles fit through holes in the plastic. There was no operating suspension parts. AMT was well known for molding sales specifications into the chassis. The promo 42 Ford Galaxie, for example had 42 different facts molded on the chassis from the accurate Vacation volume trunk – 42 cu. ft to the more fictional Enduring elegance with the power to please .         Commercial versions of the promos were also marketed and sold in retail stores like ": null
    },
    {
        "Zayre": "zayre"
    },
    {
        " and ": null
    },
    {
        "Murphy USA": "murphy usa"
    },
    {
        " from the early 42s, up until around 42 Differences from dealer promos were lack of manufacturers official paint schemes and often the addition of a friction motor located on the front axle, noticeable by the studded white vinyl gear that protruded around the axle . However, they were painted and looked just as attractive as dealer promos.     Some model companies sold unassembled versions of the promo cars, that were typically simpler and easier to assemble than the annual kits . They were molded in color and easily assembled without glue . When assembled these were almost identical to the much more elite promotional models. What usually gives them away is that they were mostly molded in a brighter nonmetallic color without paint matched to official Big 42 colors. AMTs Craftsman series of promo-like models had perforations in the bodies for mirrors and antennae – thus the models final appearance was not precisely like a promo . Probably, because of the promo look, however, today these often command higher prices than the detailed 42-in42 kits, especially AMTs Craftsman series of the early and mid sixties.     After being owned for a time by Seville Enterprises, Okey Spaulding purchased once-defunct Jo-Han, which produced a few of its original Jo-Han models in limited quantities. These include the 42 Chrysler Turbine Car, 42 Rambler station wagon, and some of its original 42s Oldsmobiles and Plymouths. However, he has had financial problems from the start, and there are no indications that he will be able to continue to produce the highly desired Johan line of models.         With the exception of some firms like Stahlberg which made larger scale plastic promotional models of Swedish Volvos and Saabs in an American style, European promotionals were usually based on the 42:42 or 42:42 scale diecast metal models produced as toys or collectors items, often brightly colored or with authentic tampo or silk screen liveries for commercial products. Companies commonly making promotionals in Europe have been ": null
    },
    {
        "NZG Models": "nzg models"
    },
    {
        ", ": null
    },
    {
        "Conrad Models": "conrad models"
    },
    {
        ", ": null
    },
    {
        "Gescha": "gescha"
    },
    {
        " in Germany and ": null
    },
    {
        "Tekno": "tekno"
    },
    {
        " and Emek Muovi in Denmark and Finland, respectively. Tekno was one of the first European companies to offer a wide variety of multiple promotional variations. Almost all European toy model brands had some kind of promotional service, but in Germany, 42:42 scale was, and remains very common for trucks. In the United States, such diecast companies are rare, but ": null
    },
    {
        "Winross Models": "winross models"
    },
    {
        " and Pennjoy are a couple of European style examples which have had much success, particularly Winross which has been making models since the early 42s.     Another variation on promotionals were whole toy lines or brands constructed to represent vehicles on display at particular automotive museums. Examples were ": null
    },
    {
        "Cursor Models": "cursor models"
    },
    {
        " of Germany which made models specifically on display in the ": null
    },
    {
        "Mercedes-Benz Museum": "mercedes-benz museum"
    },
    {
        " in ": null
    },
    {
        "Sindelfingen": "sindelfingen"
    },
    {
        ", R.A.M.I. by J.M.K. of France which made vehicles in the Automobile Museum de Rochetaillée sur Saône in France, or also ": null
    },
    {
        "Dugu Miniautotoys": "dugu miniautotoys"
    },
    {
        " of Italy which made vehicles for the classic automobile museum in ": null
    },
    {
        "Turin": "turin"
    },
    {
        ".            Scale miniatures of real production vehicles, designed as kits for children or the enthusiast to construct, can be made of ": null
    },
    {
        "plastic": "plastic model"
    },
    {
        ", ": null
    },
    {
        "die-cast metal": "die-cast toy"
    },
    {
        ", resin, and even wood. In plastic model kits, parts are molded in single cast trees with thin connections that can be easily severed for painting and assembly. Parts come molded in a variety of colors, white being the most common in the 42s and 42s. Some parts are chrome plated to simulate real bumpers, grilles, wheels, and other pieces that might be chrome on the actual vehicle. Tires are most commonly molded in rubber. Water slide-on decals are usually included along with an instruction brochure.     The best kits have incredible levels of accuracy, even in detail and parts unseen when the model is complete. Major manufacturers are ": null
    },
    {
        "AMT": "aluminum metal toys"
    },
    {
        ", ": null
    },
    {
        "MPC": "model products corporation"
    },
    {
        ", ": null
    },
    {
        "Revell": "revell"
    },
    {
        ", ": null
    },
    {
        "Monogram": "monogram models"
    },
    {
        ", and ": null
    },
    {
        "Tamiya": "tamiya corporation"
    },
    {
        " but many smaller plastics companies, like ": null
    },
    {
        "Aurora": "aurora plastics corporation"
    },
    {
        ", ": null
    },
    {
        "Pyro": "pyro plastics corporation"
    },
    {
        ", IMC, and Premier have come and gone.         The model car kit hobby began in the post ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " era with Ace and Berkeley wooden model cars. Revell pioneered the plastic model car in the late 42s with their Maxwell kit, which was basically an unassembled version of a pull toy. Derek Brand, from England, pioneered the first real plastic kit, a 42 Ford Roadster for Revell. He was also known for developing a line of 42/42 scale model car kits in England for the Gowland brothers. These kits were later introduced by Revell in the U.S. as the Highway Pioneers Series of kits .     On the heels of the promotional model business, ": null
    },
    {
        "Aluminum Model Toys": "aluminum model toys"
    },
    {
        " or AMT introduced model car kits in 42 ": null
    },
    {
        "Jo-Han": "jo-han"
    },
    {
        ", ": null
    },
    {
        "Revell": "revell"
    },
    {
        " and ": null
    },
    {
        "Monogram": "monogram"
    },
    {
        " also started producing model car kits about this same time. Most of these were known as annual kits, and were the unassembled kit version of the promotional models or promos representing the new cars that were introduced at the beginning of each model year. As early as 42 avid British collector Cecil Gibson had even written a book on plastic model cars . By the mid42s, plastic model kits had become more plentiful and varied, with increased level of detail. Typically, the kits often had opening hoods, separate engines and detailed suspension parts.         The mid42s is generally considered the golden age of plastic model car kits. Many specialty modelers and customizers, famous for their wild creations, were hired by model companies to sponsor and create new kit designs. George Barris, Darryl Starbird, and the Alexander Brothers worked for AMT. Tom Daniel design vehicles for Monogram and Mattel. Dean Jeffries was employed by MPC. Bill Campbell created hippie monster designs for Hawk. Ed Roth, famous for his Rat Fink was hired by Revell about 42 Many of these customizers created real cars and had to have specialists convert their creations into model kit form. Jim Keeler, a model kit designer for Revell, brought the world highly detailed model cars in the early sixties and is credited with bringing Ed Roths famous hot rods and customs to the model car marketplace. He also designed Revells Custom Car Parts which allowed kit builders to add engines, custom wheels and other custom features to existing models. Keeler later went on to Aurora Plastics and innovated the Prehistoric Scenes, which were highly detailed models of prehistoric dinosaurs. Many of Keelers kit designs are still being sold in the 42st century.     In addition to building them stock, most annual kits offered 42 in 42 versions which allowed the builder to assemble the car in stock, custom, or racing form. MPC joined the kit/promo business in 42 and among their first annual kits/promos, was the full-size Dodge Monaco, which was released with a gold metallic plastic body and is a valuable collectors item today.         Interest in model car kits began to wane in the mid42s, and while the precise causes are not perfectly clear, some factors were a sharp rise in the price of plastics, parents becoming cautious of glue sniffing and, later, the rise of video gaming . A revival of sorts was seen in the late 42s, especially among adults, as Monogram introduced a series of replicas of ": null
    },
    {
        "NASCAR": "nascar"
    },
    {
        " race cars, as did AMT with a kit of the 42 Chevrolet Nova, which American modelers had been requesting for years. New model specific magazines sprang up, such as Scale Auto Enthusiast,  and ": null
    }
]