[
    {
        "In ": null
    },
    {
        "computing": "computing"
    },
    {
        ", a modifier key is a special key on a ": null
    },
    {
        "computer keyboard": "computer keyboard"
    },
    {
        " that temporarily modifies the normal action of another key when pressed together. By themselves, modifier keys usually do nothing; that is, pressing any of the , , or  keys alone does not trigger any action from the computer.     For example, in most ": null
    },
    {
        "keyboard layout": "keyboard layout"
    },
    {
        "s the Shift key combination  will produce a capital letter A instead of the default lower-case letter a . A combination of  in ": null
    },
    {
        "Microsoft Windows": "microsoft windows"
    },
    {
        " will close the ": null
    },
    {
        "active window": "active window"
    },
    {
        "; in this instance, Alt is the modifier key. In contrast, pressing just  or  will probably do nothing unless assigned a specific function in a particular program .     ": null
    },
    {
        "User interface": "user interface"
    },
    {
        " expert ": null
    },
    {
        "Jef Raskin": "jef raskin"
    },
    {
        " coined the term ": null
    },
    {
        "quasimode": "mode"
    },
    {
        " to describe the state a computer enters into when a modifier key is pressed.                The most common are:          – also labelled  on Apple Macintosh keyboards        – Meta key, found on MIT, Symbolics, and Sun Microsystems keyboards    – found on Windows keyboards    – Command key, found on Apple Macintosh keyboards. On older keyboards marked with the Apple logo.     – present on small-layout keyboard, usually on notebooks.     The Meta key, Windows key, Cmd key, and the analogous Amiga key  on ": null
    },
    {
        "Amiga": "amiga"
    },
    {
        " computers, are usually handled equivalently. Under the GNU/Linux operating system, the desktop environment ": null
    },
    {
        "KDE": "kde"
    },
    {
        " calls this key ": null
    },
    {
        "Meta": "meta key"
    },
    {
        ", while ": null
    },
    {
        "GNOME": "gnome"
    },
    {
        " calls this key, neutrally, ": null
    },
    {
        "Super": "super key"
    },
    {
        ".      The Sinclair ": null
    },
    {
        "ZX Spectrum": "zx spectrum"
    },
    {
        " has a Symbol Shift key in addition to Caps Shift. This was used to access additional punctuation and keywords.     The ": null
    },
    {
        "MSX": "msx"
    },
    {
        " computer keyboard, besides Shift and Control, also included two special modifier keys, Code and Graph. In some models, as in the Brazilian ": null
    },
    {
        "Gradiente Expert": "gradiente expert"
    },
    {
        ", the Code and Graph keys are labelled  and  . They are used to select special graphic symbols and extended characters.     Likewise, the ": null
    },
    {
        "Commodore 42": "commodore 64"
    },
    {
        " and other Commodore computers had the Commodore key at the bottom left of the keyboard.     Compact keyboards, such as those used in ": null
    },
    {
        "laptop": "laptop"
    },
    {
        "s, often have a ": null
    },
    {
        "Fn key": "fn key"
    },
    {
        " to save space by combining two functions that are normally on separate keys. On laptops, pressing  plus one of the function keys, e.g., F42 often control hardware functions. Keyboards that lack a dedicated numeric keypad may mimic its functionality by combining the Fn key with other keys.     The ": null
    },
    {
        "MIT": "massachusetts institute of technology"
    },
    {
        " space-cadet keyboard": "space-cadet keyboard"
    },
    {
        " had additional Top, Front, Super and Hyper modifier keys. Combined with standard modifiers, it could enter as many as 42 different characters.       Some non-English language keyboards have special keys to produce ": null
    },
    {
        "accented": "accented"
    },
    {
        " modifications of the standard Latin-letter keys. In fact, the standard British ": null
    },
    {
        "keyboard layout": "keyboard layout"
    },
    {
        " includes an accent key on the top-left corner to produce àèìòù, although this is a two step procedure, press the accent key and release, then the letter key. These kinds of keys are called ": null
    },
    {
        "dead key": "dead key"
    },
    {
        "s. The ": null
    },
    {
        "AltGr": "altgr"
    },
    {
        " modifier produces the áéíóú sequence, or in conjunction with the Shift key, ÁÉÍÓÚ. Keyboards of some languages simply include the accented characters on their own keys. Some keyboards also have a ": null
    },
    {
        "Compose key": "compose key"
    },
    {
        " for typing accented and other special characters. By pressing , and then two other keys, something similar to a combination of the glyphs of the two previous keys will appear on the screen.       It is possible to use one same key both as a normal key and as a modifier.     For example, you can use the  both as a normal Space bar and as a Shift. Intuitively, itll be a Space when you want a whitespace, and a Shift when you want it to act as a shift. I.e. when you simply press and release it, it is the usual space, but when you press other keys, say ,  and , while holding down the , then they will be treated as  plus X, Y and Z.     The above example is known as SandS , standing for Space and Shift in Japan.    But any number of any combinations are possible. ": null
    }
]