[
    {
        "     In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", the modularity theorem  states that ": null
    },
    {
        "elliptic curve": "elliptic curve"
    },
    {
        "s over the field of ": null
    },
    {
        "rational number": "rational number"
    },
    {
        "s are related to ": null
    },
    {
        "modular form": "modular form"
    },
    {
        "s. ": null
    },
    {
        "Andrew Wiles": "andrew wiles"
    },
    {
        " proved the modularity theorem for ": null
    },
    {
        "semistable elliptic curve": "semistable elliptic curve"
    },
    {
        "s, which was enough to imply ": null
    },
    {
        "Fermats last theorem": "fermats last theorem"
    },
    {
        ". Later, ": null
    },
    {
        "Christophe Breuil": "christophe breuil"
    },
    {
        ", ": null
    },
    {
        "Brian Conrad": "brian conrad"
    },
    {
        ", ": null
    },
    {
        "Fred Diamond": "fred diamond"
    },
    {
        " and ": null
    },
    {
        "Richard Taylor": "richard taylor"
    },
    {
        " extended Wiles techniques to prove the full modularity theorem in 42       The ": null
    },
    {
        "theorem": "theorem"
    },
    {
        " states that any ": null
    },
    {
        "elliptic curve": "elliptic curve"
    },
    {
        " over Q can be obtained via a ": null
    },
    {
        "rational map": "rational map"
    },
    {
        " with ": null
    },
    {
        "integer": "integer"
    },
    {
        " coefficient": "coefficient"
    },
    {
        "s from the ": null
    },
    {
        "classical modular curve": "classical modular curve"
    },
    {
        " X_42 for some integer N; this is a curve with integer coefficients with an explicit definition. This mapping is called a modular parametrization of level N. If N is the smallest integer for which such a parametrization can be found , then the parametrization may be defined in terms of a mapping generated by a particular kind of modular form of weight two and level N, a normalized ": null
    },
    {
        "newform": "newform"
    },
    {
        " with integer q-expansion, followed if need be by an ": null
    },
    {
        "isogeny": "elliptic curveisogeny"
    },
    {
        ".     The modularity theorem implies a closely related analytic statement: to an elliptic curve E over Q we may attach a corresponding ": null
    },
    {
        "L-series": "l-series of an elliptic curve"
    },
    {
        ". The L-series is a ": null
    },
    {
        "Dirichlet series": "dirichlet series"
    },
    {
        ", commonly written     : L \\sum_^\\infty \\frac.     The ": null
    },
    {
        "generating function": "generating function"
    },
    {
        " of the coefficients a_n is then     : f \\sum_^\\infty a_n q^n.     If we make the substitution     : q e^     we see that we have written the ": null
    },
    {
        "Fourier expansion": "fourier series"
    },
    {
        " of a function f of the complex variable τ, so the coefficients of the q-series are also thought of as the Fourier coefficients of f . The function obtained in this way is, remarkably, a ": null
    },
    {
        "cusp form": "cusp form"
    },
    {
        " of weight two and level N and is also an eigenform ; this is the Hasse–Weil conjecture, which follows from the modularity theorem.     Some modular forms of weight two, in turn, correspond to ": null
    },
    {
        "holomorphic differential": "holomorphic differential"
    },
    {
        "s for an elliptic curve. The Jacobian of the modular curve can be written as a product of irreducible ": null
    },
    {
        "Abelian varieties": "abelian varieties"
    },
    {
        ", corresponding to Hecke eigenforms of weight 42 The 42-dimensional factors are elliptic curves . The curve obtained by finding the corresponding cusp form, and then constructing a curve from it, is ": null
    },
    {
        "isogenous": "elliptic curveisogeny"
    },
    {
        " to the original curve .        stated a preliminary version of the conjecture at the 42 international symposium on algebraic number theory in ": null
    },
    {
        "Tokyo": "tokyo"
    },
    {
        " and ": null
    },
    {
        "Nikkō": "nikkō, tochigi"
    },
    {
        ". ": null
    },
    {
        "Goro Shimura": "goro shimura"
    },
    {
        " and Taniyama worked on improving its rigor until 42  rediscovered the conjecture, and showed that it would follow from the functional equations for some twisted L-series of the elliptic curve; this was the first serious evidence that the conjecture might be true. Weil also showed that the conductor of the elliptic curve should be the level of the corresponding modular form. The Taniyama–Shimura–Weil conjecture became a part of the ": null
    },
    {
        "Langlands program": "langlands program"
    },
    {
        ".     The conjecture attracted considerable interest when  suggested that the Taniyama–Shimura–Weil conjecture implies ": null
    },
    {
        "Fermats Last Theorem": "fermats last theorem"
    },
    {
        ". He did this by attempting to show that any counterexample to Fermats Last Theorem would imply the existence of at least one non-modular elliptic curve. This argument was completed when  identified a missing link  in Freys original work, followed two years later by s completion of a proof of the epsilon conjecture.     Even after gaining serious attention, the Taniyama–Shimura–Weil conjecture was seen by contemporary mathematicians as extraordinarily difficult to prove or perhaps even inaccessible to proof . For example, Wiles ex-supervisor ": null
    },
    {
        "John Coates": "john h. coates"
    },
    {
        " states that it seemed impossible to actually prove , and Ken Ribet considered himself one of the vast majority of people who believed was completely inaccessible .     , with some help from ": null
    },
    {
        "Richard Taylor": "richard taylor"
    },
    {
        ", proved the Taniyama–Shimura–Weil conjecture for all ": null
    },
    {
        "semistable elliptic curve": "semistable elliptic curve"
    },
    {
        "s, which he used to prove Fermats Last Theorem, and the full Taniyama–Shimura–Weil conjecture was finally proved by , , and  who, building on Wiles work, incrementally chipped away at the remaining cases until the full result was proved.        Once fully proven, the conjecture became known as the modularity theorem.     Several theorems in number theory similar to Fermats Last Theorem follow from the modularity theorem. For example: no cube can be written as a sum of two ": null
    },
    {
        "coprime": "coprime"
    },
    {
        " n-th powers, n  ≥  42        The modularity theorem is a special case of more general conjectures due to ": null
    },
    {
        "Robert Langlands": "robert langlands"
    },
    {
        ". The ": null
    },
    {
        "Langlands program": "langlands program"
    },
    {
        " seeks to attach an ": null
    },
    {
        "automorphic form": "automorphic form"
    },
    {
        " or ": null
    },
    {
        "automorphic representation": "automorphic representation"
    },
    {
        " to more general objects of arithmetic algebraic geometry, such as to every elliptic curve over a ": null
    },
    {
        "number field": "number field"
    },
    {
        ". Most cases of these extended conjectures have not yet been proved. However, ": null
    }
]