[
    {
        "     A Molotov cocktail, also known as a petrol bomb, gasoline bomb , bottle bomb, poor mans grenade, Molotovin koktaili , polttopullo , fire bomb , fire bottle or just Molotov, sometimes shortened as Molly, is a generic name used for a variety of bottle-based ": null
    },
    {
        "improvised": "improvised weapon"
    },
    {
        " incendiary weapons": "incendiary device"
    },
    {
        ". Due to the relative ease of production, Molotov cocktails have been used by street criminals, rioters, criminal ": null
    },
    {
        "gang": "gang"
    },
    {
        "s, ": null
    },
    {
        "urban guerrillas": "urban guerrilla warfare"
    },
    {
        ", ": null
    },
    {
        "terrorists": "terrorism"
    },
    {
        ", ": null
    },
    {
        "irregular soldiers": "irregular military"
    },
    {
        ", or even ": null
    },
    {
        "regular soldiers": "regular army"
    },
    {
        " short on equivalent military-issue weapons. They are primarily intended to ignite rather than completely destroy targets, and are often used just as much to cause chaos as to actually do damage, sometimes being used as weapons during riots and mass protest.       The name Molotov cocktail was coined by the ": null
    },
    {
        "Finns": "finns"
    },
    {
        " during the ": null
    },
    {
        "Winter War": "winter war"
    },
    {
        ", Online Etymology Dictionary: . Douglas Harper, 2010. called in  or Molotovin koktaili. The name was a pejorative reference to Soviet foreign minister ": null
    },
    {
        "Vyacheslav Molotov": "vyacheslav molotov"
    },
    {
        ", who was one of the architects of the ": null
    },
    {
        "Molotov–Ribbentrop Pact": "molotov–ribbentrop pact"
    },
    {
        " signed in late August 1939. The pact with Nazi Germany, which established that Germany would not intervene in the war, was widely mocked by the Finns . Also mocked was much of the propaganda Molotov produced during the Winter War, including his declaration on Soviet state radio that bombing missions over Finland were actually airborne humanitarian food deliveries for their starving neighbours. The Finns sarcastically dubbed the Soviet ": null
    },
    {
        "cluster bombs": "cluster bomb"
    },
    {
        "Molotov bread baskets": "molotov bread basket"
    },
    {
        " in reference to Molotovs propaganda broadcasts.  When the hand-held bottle firebomb was developed to attack Soviet tanks, the Finns called it the Molotov cocktail , as a drink to go with the food .  The Second Book of General Ignorance , Faber and Faber, 2011, p.76,        A Molotov cocktail is a breakable glass bottle containing a flammable substance such as petrol, alcohol, or a ": null
    },
    {
        "napalm": "napalm"
    },
    {
        "-like mixture, with some motor oil added, and usually a source of ignition such as a burning cloth ": null
    },
    {
        "wick": "capillary action"
    },
    {
        " held in place by the bottles stopper. The wick is usually soaked in alcohol or ": null
    },
    {
        "kerosene": "kerosene"
    },
    {
        ", rather than petrol.     In action, the wick is lit and the bottle hurled at a target such as a vehicle or fortification. When the bottle smashes on impact, the ensuing cloud of fuel droplets and vapour is ignited by the attached wick, causing an immediate ": null
    },
    {
        "fireball": "explosion"
    },
    {
        " followed by spreading flames as the remainder of the fuel is consumed.     Other flammable liquids such as ": null
    },
    {
        "diesel fuel": "diesel fuel"
    },
    {
        ", ": null
    },
    {
        "methanol": "methanol"
    },
    {
        ", ": null
    },
    {
        "turpentine": "turpentine"
    },
    {
        ", ": null
    },
    {
        "jet fuel": "jet fuel"
    },
    {
        ", and ": null
    },
    {
        "isopropyl alcohol": "isopropyl alcohol"
    },
    {
        " have been used in place of, or combined with petrol. Thickening agents such as solvents, foam polystyrene, baking soda, petroleum jelly, tar, strips of tyre tubing, ": null
    },
    {
        "nitrocellulose": "nitrocellulose"
    },
    {
        ", ": null
    },
    {
        "XPS foam": "polystyreneextruded polystyrene foam"
    },
    {
        ", ": null
    },
    {
        "motor oil": "motor oil"
    },
    {
        ", ": null
    },
    {
        "rubber cement": "rubber cement"
    },
    {
        ", ": null
    },
    {
        "detergent": "detergent"
    },
    {
        " and dish soap have been added to help the burning liquid adhere to the target and create clouds of thick, choking smoke.      In addition, ": null
    },
    {
        "toxic": "toxic"
    },
    {
        " substances are also known to be added to the mixture, to create a suffocating or poisonous gas on the resulting explosion, effectively turning the Molotov cocktail into a makeshift ": null
    },
    {
        "chemical weapon": "chemical weapon"
    },
    {
        ". These include ": null
    },
    {
        "bleach": "bleach"
    },
    {
        ", ": null
    },
    {
        "chlorine": "chlorine"
    },
    {
        ", various ": null
    },
    {
        "strong acid": "strong acid"
    },
    {
        "s, ": null
    },
    {
        "pesticide": "pesticide"
    },
    {
        "s, among others.           Improvised incendiary devices of this type were used for the first time in the ": null
    },
    {
        "Spanish Civil War": "spanish civil war"
    },
    {
        " between July 1936 and April 1939, ": null
    },
    {
        "Thomas, Hugh": "hugh thomas"
    },
    {
        " . The Spanish Civil War. Simon & Schuster, p. 468.  before they became known as Molotov cocktails . In 1936, General ": null
    },
    {
        "Francisco Franco": "francisco franco"
    },
    {
        " ordered ": null
    },
    {
        "Spanish Nationalist forces": "francoist spain"
    },
    {
        " to use the weapon against Soviet ": null
    },
    {
        "T-26": "t-26"
    },
    {
        " tanks supporting the ": null
    },
    {
        "Spanish Republicans": "second spanish republic"
    },
    {
        " in a failed assault on the Nationalist stronghold of ": null
    },
    {
        "Seseña": "seseña"
    },
    {
        ", near ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        ",  south of ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        ".  After that, both sides used simple petrol bombs or petrol-soaked ": null
    },
    {
        "blankets": "blanket"
    },
    {
        "with some success. ": null
    },
    {
        "Tom Wintringham": "tom wintringham"
    },
    {
        ", a veteran of the ": null
    },
    {
        "International Brigade": "international brigade"
    },
    {
        "s, later publicised his recommended method of using them:            The ": null
    },
    {
        "Battle of Khalkhin Gol": "battles of khalkhin gol"
    },
    {
        ", a border conflict of 1939 ostensibly between ": null
    },
    {
        "Mongolia": "mongolia"
    },
    {
        " and ": null
    },
    {
        "Manchukuo": "manchukuo"
    },
    {
        ", saw heavy fighting between ": null
    },
    {
        "Japanese": "imperial japanese army"
    },
    {
        " and ": null
    },
    {
        "Soviet": "red army"
    },
    {
        " forces. Short of anti-tank equipment, Japanese infantry attacked Soviet tanks with gasoline-filled bottles. Japanese infantrymen claimed that several hundred Soviet tanks had been destroyed this way, though Soviet loss records do not support this assessment. ": null
    },
    {
        "Coox, Alvin": "alvin coox"
    },
    {
        ", 1990, Nomonhan: Japan Against Russia, 1939            On 30 November 1939, the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " attacked Finland, starting what came to be known as the ": null
    },
    {
        "Winter War": "winter war"
    },
    {
        ". The Finns perfected the design and tactical use of the petrol bomb. The fuel for the Molotov cocktail was refined to a slightly sticky mixture of gasoline, ": null
    },
    {
        "kerosene": "kerosene"
    },
    {
        ", ": null
    },
    {
        "tar": "tar"
    },
    {
        ", and ": null
    },
    {
        "potassium chlorate": "potassium chlorate"
    },
    {
        ". Further refinements included the attachment of wind-proof matches or a phial of chemicals that would ignite on breakage, thereby removing the need to pre-ignite the bottle, and leaving the bottle about one-third empty was found to make breaking more likely.     A British ": null
    },
    {
        "War Office": "war office"
    },
    {
        " report dated June 1940 noted that:        Molotov cocktails were eventually mass-produced by the ": null
    },
    {
        "Alko": "alko"
    },
    {
        " corporation at its Rajamäki distillery, bundled with ": null
    },
    {
        "match": "match"
    },
    {
        "es to light them. Production totalled 450,000 during the Winter War. The original recipe of the Molotov cocktail was a mixture of ": null
    },
    {
        "ethanol": "ethanol"
    },
    {
        ", tar and gasoline in a  bottle. The bottle had two long ": null
    },
    {
        "pyrotechnic": "pyrotechnic"
    },
    {
        " storm matches": "matchvarieties of matches today"
    },
    {
        " attached to either side. Before use, one or both of the matches was lit; when the bottle broke on impact, the mixture ignited. The storm matches were found to be safer to use than a burning rag on the mouth of the bottle.          Early in 1940, with ": null
    },
    {
        "the prospect of immediate invasion": "british anti-invasion preparations of world war ii"
    },
    {
        ", the possibilities of the petrol bomb gripped the imagination of the British public. For the layman, the petrol bomb had the benefit of using entirely familiar and available materials, and they were quickly improvised in large numbers, with the intention of using them against enemy ": null
    },
    {
        "tank": "tank"
    },
    {
        "s.      The Finns had found that they were effective when used in the right way and in sufficient numbers. Although the experience of the Spanish Civil War received more publicity, the more sophisticated petroleum warfare tactics of the Finns were not lost on British commanders. In his 5 June address to ": null
    },
    {
        "LDV": "home guard"
    },
    {
        " leaders, ": null
    },
    {
        "General Ironside": "edmund ironside, 1st baron ironside"
    },
    {
        " said:          Wintringham advised that a tank that was isolated from supporting infantry was potentially vulnerable to men who had the required determination and cunning to get close. Rifles or even a shotgun would be sufficient to persuade the crew to close all the hatches, and then the view from the tank is very limited; a turret-mounted machine gun has a very slow traverse and cannot hope to fend off attackers coming from all directions. Once sufficiently close, it is possible to hide where the tanks gunner cannot see: The most dangerous distance away from a tank is 200 yards; the safest distance is six inches. Wintringham, Tom. Against Invasion  – the lessons of Spain. Picture Post 15 June 1940 p. 14. Petrol bombs will soon produce a pall of blinding smoke, and a well-placed explosive package or even a stout iron bar in the tracks can immobilise the vehicle, leaving it at the mercy of further petrol bombs  – which will suffocate the engine and possibly the crew  – or an explosive charge or anti-tank mine.     By August 1940, the ": null
    },
    {
        "War Office": "war office"
    },
    {
        " produced training instructions for the creation and use of Molotov cocktails. The instructions suggested scoring the bottles vertically with a diamond to ensure breakage and providing fuel-soaked rag, windproof matches or a length of cinema film as a source of ignition. War Office. Military Training Manual No 42, Appendix A: The Anti-Tank Petrol Bomb Molotov Cocktail. 29 August 1940.      On 29 July 1940, manufacturers Albright & Wilson of Oldbury demonstrated to the RAF how their white phosphorus could be used to ignite incendiary bombs. The demonstration involved throwing glass bottles containing a mixture of petrol and ": null
    },
    {
        "phosphorus": "phosphorus"
    },
    {
        " at pieces of wood and into a hut. On breaking, the phosphorus was exposed to the air and spontaneously ignited; the petrol also burned, resulting in a fierce fire. Because of safety concerns, the RAF was not interested in ": null
    },
    {
        "white phosphorus": "white phosphorus munitions"
    },
    {
        " as a source of ignition, but the idea of a self-igniting petrol bomb took hold. Initially known as an A.W. bomb, it was officially named the ": null
    },
    {
        "No. 76 Grenade": "no. 76 special incendiary grenade"
    },
    {
        ", but more commonly known as the SIP grenade. The perfected list of ingredients was white phosphorus, ": null
    },
    {
        "benzene": "benzene"
    },
    {
        ", water and a two-inch strip of raw rubber; all in a half-pint bottle sealed with a ": null
    },
    {
        "crown stopper": "crown cork"
    },
    {
        ". War Office. Military Training Manual No 42, Appendix B: The Self-Igniting Phosphorus Grenade, The AW Grenade. 29 August 1940, p. 25. Over time, the rubber would slowly dissolve, making the contents slightly sticky, and the mixture would separate into two layers  – this was intentional, and the grenade should not be shaken to mix the layers, as this would only delay ignition. Handbook for the Projectors, 2½ inch, Marks I & II September 1941. p. 26. When thrown against a hard surface, the glass would shatter and the contents would instantly ignite, liberating choking fumes of ": null
    },
    {
        "phosphorus pentoxide": "phosphorus pentoxide"
    },
    {
        " and ": null
    },
    {
        "sulfur dioxide": "sulfur dioxide"
    },
    {
        " as well as producing a great deal of heat. Strict instructions were issued to store the grenades safely, preferably underwater and certainly never in a house. Mainly issued to the ": null
    },
    {
        "Home Guard": "british home guard"
    },
    {
        " as an anti-tank weapon, it was produced in vast numbers; by August 1941 well over 6,000,000 had been manufactured. Northover Projectors  – , ": null
    },
    {
        "The National Archives": "the national archives"
    },
    {
        "     There were many who were skeptical about the efficacy of Molotov cocktails and SIPs grenades against the more modern German tanks. Weapon designer ": null
    },
    {
        "Stuart Macrae": "stuart macrae"
    },
    {
        " witnessed a trial of the SIPs grenade at ": null
    },
    {
        "Farnborough": "farnborough airfield"
    },
    {
        ": There was some concern that, if the tank drivers could not pull up quickly enough and hop out, they were likely to be frizzled to death, but after looking at the bottles they said they would be happy to take a chance.  The drivers were proved right, trials on modern British tanks confirmed that Molotov and SIP grenades caused the occupants of the tanks no inconvenience whatsoever.      Wintringham, though enthusiastic about improvised weapons, cautioned against a reliance on petrol bombs and repeatedly emphasised the importance of using explosive charges. Wintringham, Tom. Against Invasion  – the lessons of Spain. Picture Post 15 June 1940 pp. 9–24.             During the ": null
    },
    {
        "Irish War of Independence": "irish war of independence"
    },
    {
        ", the ": null
    },
    {
        "Irish Republican Army": "irish republican army"
    },
    {
        " sometimes used sods of turf soaked in paraffin oil to attack British army barracks. Fencing wire was pushed through the sod to make a throwing handle. ": null
    },
    {
        "Breen, Dan": "dan breen"
    },
    {
        " . My fight for Irish freedom. Anvil, p. 121.       The ": null
    },
    {
        "Polish Home Army": "home army"
    },
    {
        " developed a version  which ignited on impact without the need of a wick. Ignition was caused by a reaction between concentrated ": null
    },
    {
        "sulfuric acid": "sulfuric acid"
    },
    {
        " mixed with the fuel and a mixture of ": null
    },
    {
        "potassium chlorate": "potassium chlorate"
    },
    {
        " and sugar which was ": null
    },
    {
        "crystallized": "crystallization"
    },
    {
        " from solution onto a rag attached to the bottle.     The ": null
    },
    {
        "United States Marine Corps": "united states marine corps"
    },
    {
        " developed a version during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " that used a tube of ": null
    },
    {
        "nitric acid": "nitric acid"
    },
    {
        " and a lump of metallic ": null
    },
    {
        "sodium": "sodium"
    },
    {
        " to ignite a mixture of petrol and diesel fuel.             Molotov cocktails were reportedly used in the United States for arson attacks on shops and other buildings during the ": null
    },
    {
        "1992 Los Angeles riots": "1992 los angeles riots"
    },
    {
        ".      During the ": null
    },
    {
        "Second Battle of Fallujah": "second battle of fallujah"
    },
    {
        " in 2004, U.S. Marines employed Molotov cocktails made with one part liquid laundry detergent, two parts gas while clearing houses when contact is made in a house and the enemy must be burned out . The tactic was developed in response to the enemys tactics of ": null
    },
    {
        "guerrilla warfare": "guerrilla warfare"
    },
    {
        " and particularly ": null
    },
    {
        "martyrdom": "martyrdom"
    },
    {
        " tactics which often resulted in U.S. Marine casualties. The cocktail was a less expedient alternative to ": null
    },
    {
        "white phosphorus": "white phosphorus"
    },
    {
        " mortar rounds or propane tanks detonated with ": null
    },
    {
        "C4": "c-4"
    },
    {
        " - all of which proved effective at burning out engaged enemy combatants.      Molotov cocktails were also used by protesters and civilian militia in Ukraine during violent outbreaks of the ": null
    },
    {
        "Euromaidan": "euromaidan"
    },
    {
        " and the ": null
    },
    {
        "2014 Ukrainian revolution": "2014 ukrainian revolution"
    },
    {
        ". Protesters during the ": null
    },
    {
        "Ferguson riots": "ferguson riots"
    },
    {
        " used Molotov cocktails.      In ": null
    },
    {
        "Bangladesh": "bangladesh"
    },
    {
        " during anti government protests at the time of the 2014 national election, many buses and cars were targeted with petrol bombs. A number of people burnt to death and many more were injured during the period 2013–2014 due to petrol bomb attacks.       In the ": null
    },
    {
        "2019 Hong Kong protests": "2019 hong kong protests"
    },
    {
        ", protesters used Molotov cocktails to defend and attack police or to create roadblocks. Protesters also attacked an ": null
    },
    {
        "MTR": "mtr"
    },
    {
        " station and caused severe damage.  A journalist has also been hit by a Molotov cocktail during the protests.  They also used Molotov cocktails to stop the police when they invaded the universities in Hong Kong and laid siege to it.          During the ": null
    },
    {
        "protests in Venezuela from 2014 and into 2017": "2014–17 venezuelan protests"
    },
    {
        ", protesters had used Molotov cocktails similar demonstrators in other countries.  As the ": null
    },
    {
        "2017 Venezuelan protests": "2017 venezuelan protests"
    },
    {
        " intensified, demonstrators began using Puputovs , a play on words of Molotov, with glass devices filled with excrement being thrown at authorities after the PSUV ruling-party official, ": null
    },
    {
        "Jacqueline Faría": "jacqueline faría"
    },
    {
        ", mocked protesters who had to crawl through sewage in ": null
    },
    {
        "Caracas": "caracas"
    },
    {
        " Guaire River": "guaire river"
    },
    {
        " to avoid tear gas.   On 8 May, the hashtag puputov became the top trend on Twitter in Venezuela as reports of authorities vomiting after being drenched in excrement began to circulate.  By 10 May 2017, Venezuelans unrelated to political parties called for a Marcha de la Mierda , or a  March of Shit , essentially establishing puputovs in the arsenal of Venezuelan protesters.   A month later on 4 June 2017 during ": null
    },
    {
        "protests against Donald Trump": "protests against donald trump"
    },
    {
        " in ": null
    },
    {
        "Portland, Oregon": "portland, oregon"
    },
    {
        ", protesters began throwing balloons filled with unknown, foul-smelling liquid at officers.        As incendiary devices, Molotov cocktails are illegal to manufacture or possess in many regions. In the United States, Molotov cocktails are considered ": null
    },
    {
        "destructive devices": "destructive device"
    },
    {
        " under the ": null
    },
    {
        "National Firearms Act": "national firearms act"
    },
    {
        " and regulated by the ": null
    },
    {
        "ATF": "bureau of alcohol, tobacco, firearms, and explosives"
    },
    {
        ".  Wil Casey Floyd, formerly from ": null
    },
    {
        "Elkhart Lake, Wisconsin": "elkhart lake, wisconsin"
    },
    {
        ", after throwing Molotov cocktails at Seattle Police Officers 1 May 2016 during a protest, was arrested in April 2017; he pleaded guilty for using the incendiary devices on February 2018.  At ": null
    },
    {
        "Simpson County, Kentucky": "simpson county, kentucky"
    },
    {
        ", 20-year-old Trey Alexander Gwathney-Law attempted to burn Franklin-Simpson County Middle School with five Molotov cocktails; he has been found guilty of making and possessing illegal firearms and was sentenced to 20 years in prison in 2018.  ": null
    },
    {
        "Narita International Airport": "narita international airport"
    },
    {
        " Activities（": null
    },
    {
        "Sanrizuka Struggle": "sanrizuka struggle"
    },
    {
        " Persian Gulf War": "gulf war"
    },
    {
        " IDF": "israel defense forces"
    },
    {
        " soldier shows materials used to prepare Molotov cocktails, which were found on two Palestinian youths near the ": null
    },
    {
        "Huwara": "huwara"
    },
    {
        " protesters": "united front for democracy against dictatorship"
    },
    {
        " in Thailand, ": null
    },
    {
        "May 2010": "2010 thai military crackdown"
    },
    {
        " protesters": "2014 ukrainian revolution"
    },
    {
        " in ": null
    },
    {
        "Kiev": "kiev"
    }
]