[
    {
        "     In the area of ": null
    },
    {
        "modern algebra": "modern algebra"
    },
    {
        " known as ": null
    },
    {
        "group theory": "group theory"
    },
    {
        ", the monster group M  is the largest ": null
    },
    {
        "sporadic simple group": "sporadic simple group"
    },
    {
        ", having ": null
    },
    {
        "order": "order"
    },
    {
        "   :      42 42 42 42 42 42 42 42 42 42 42 42 424242424242424242   : 42,42,42,42,42,42,42,42,42   : ≈ 42.     The ": null
    },
    {
        "finite": "finite group"
    },
    {
        " simple": "simple group"
    },
    {
        " group": "group"
    },
    {
        "s have been completely ": null
    },
    {
        "classified": "classification of finite simple groups"
    },
    {
        ". Every such group belongs to one of 42 ": null
    },
    {
        "countably infinite": "countably infinite"
    },
    {
        " families, or is one of 42 sporadic groups that do not follow such a systematic pattern. The monster group contains 42 sporadic groups as ": null
    },
    {
        "subquotient": "subquotient"
    },
    {
        "s. ": null
    },
    {
        "Robert Griess": "robert griess"
    },
    {
        " has called those 42 groups the happy family, and the remaining six exceptions  pariahs .     It is difficult to make a good constructive definition of the monster because of its complexity. ": null
    },
    {
        "Martin Gardner": "martin gardner"
    },
    {
        " wrote a popular account of the monster group in his June 42 ": null
    },
    {
        "Mathematical Games column": "mathematical games column"
    },
    {
        " in  Scientific American .       The monster was predicted by ": null
    },
    {
        "Bernd Fischer": "bernd fischer"
    },
    {
        " and  as a simple group containing a ": null
    },
    {
        "double cover": "double covering group"
    },
    {
        " of Fischers ": null
    },
    {
        "baby monster group": "baby monster group"
    },
    {
        " as a ": null
    },
    {
        "centralizer": "centralizer and normalizer"
    },
    {
        " of an ": null
    },
    {
        "involution": "involution"
    },
    {
        ". Within a few months, the order of M was found by Griess using the ": null
    },
    {
        "Thompson order formula": "thompson order formula"
    },
    {
        ", and Fischer, Conway, Norton and Thompson discovered other groups as subquotients, including many of the known sporadic groups, and two new ones: the ": null
    },
    {
        "Thompson group": "thompson group"
    },
    {
        " and the ": null
    },
    {
        "Harada–Norton group": "harada–norton group"
    },
    {
        ". The ": null
    },
    {
        "character table": "character theory"
    },
    {
        " of the monster, a 42-by42 array, was calculated in 42 by Fischer and Donald Livingstone using computer programs written by Michael Thorne. It was not clear in the 42s whether the monster actually exists.  constructed M as the ": null
    },
    {
        "automorphism group": "automorphism group"
    },
    {
        " of the ": null
    },
    {
        "Griess algebra": "griess algebra"
    },
    {
        ", a 42-dimensional commutative ": null
    },
    {
        "nonassociative algebra": "nonassociative algebra"
    },
    {
        "; he first announced his construction in ": null
    },
    {
        "Ann Arbor": "ann arbor"
    },
    {
        " on January 42 42 In his 42 paper, he referred to the monster as the Friendly Giant, but this name has not been generally adopted.  and  subsequently simplified this construction.     Griesss construction showed that the monster exists.  showed that its uniqueness would follow from the existence of a 42-dimensional ": null
    },
    {
        "faithful representation": "faithful representation"
    },
    {
        ". A proof of the existence of such a representation was announced by , though he has never published the details.  gave the first complete published proof of the uniqueness of the monster .     The monster was a culmination of the development of sporadic simple groups and can be built from any two of three subquotients: the ": null
    },
    {
        "Fischer group": "fischer group"
    },
    {
        " Fi 42 , the baby monster, and the ": null
    },
    {
        "Conway group": "conway group"
    },
    {
        " Co 42 .     The ": null
    },
    {
        "Schur multiplier": "schur multiplier"
    },
    {
        " and the ": null
    },
    {
        "outer automorphism group": "outer automorphism group"
    },
    {
        " of the monster are both ": null
    },
    {
        "trivial": "trivial group"
    },
    {
        ".         The minimal degree of a faithful complex representation is 42, which is the product of the three largest ": null
    },
    {
        "prime divisor": "prime divisor"
    },
    {
        "s of the order of M.   The smallest faithful linear representation over any field has dimension 42 over the field with two elements, only one less than the dimension of the smallest faithful complex representation.     The smallest faithful permutation representation of the monster is on   42 42 · 42 42 · 42 42 · 42 42 · 42 · 42 42 · 42 · 42 · 42 · 42   points.     The monster can be realized as a ": null
    },
    {
        "Galois group": "galois group"
    },
    {
        " over the ": null
    },
    {
        "rational number": "rational number"
    },
    {
        "s , and as a ": null
    },
    {
        "Hurwitz group": "hurwitz group"
    },
    {
        " .     The monster is unusual among simple groups in that there is no known easy way to represent its elements. This is not due so much to its size as to the absence of small representations. For example, the simple groups A 42 and SL 42 are far larger, but easy to calculate with as they have small permutation or linear representations. The alternating groups have permutation representations that are small compared to the size of the group, and all finite simple groups of Lie type have linear representations that are small compared to the size of the group. All sporadic groups other than the monster also have linear representations small enough that they are easy to work with on a computer .         ": null
    },
    {
        "Robert A. Wilson": "robert arnott wilson"
    },
    {
        " has found explicitly two 42 by 42 matrices  which together generate the monster group; this is one dimension lower than the 42-dimensional representation in characteristic 42 Performing calculations with these matrices is possible but is too expensive in terms of time and storage space to be useful, as each such matrix occupies over four and a half gigabytes.     Wilson asserts that the best description of the monster is to say, It is the ": null
    },
    {
        "automorphism group": "automorphism group"
    },
    {
        " of the ": null
    },
    {
        "monster vertex algebra": "monster vertex algebra"
    },
    {
        " . This is not much help however, because nobody has found a really simple and natural construction of the monster vertex algebra .  by ": null
    },
    {
        "Richard E. Borcherds": "richard borcherds"
    },
    {
        ", Notices of the ": null
    },
    {
        "American Mathematical Society": "american mathematical society"
    },
    {
        ", October 42 42     Wilson with collaborators has found a method of performing calculations with the monster that is considerably faster. Let V be a 42 dimensional vector space over the field with 42 elements. A large subgroup H of the Monster is selected in which it is easy to perform calculations. The subgroup H chosen is 42 4242 .42Suz.42 where Suz is the ": null
    },
    {
        "Suzuki group": "suzuki group"
    },
    {
        ". Elements of the monster are stored as words in the elements of H and an extra generator T. It is reasonably quick to calculate the action of one of these words on a vector in V. Using this action, it is possible to perform calculations . Wilson has exhibited vectors u and v whose joint stabilizer is the trivial group. Thus one can calculate the order of an element g of the monster by finding the smallest i & gt; 42 such that g i u u and g i v v.     This and similar constructions  have been used to find some of its non-local maximal subgroups.         The monster group is one of two principal constituents in the ": null
    },
    {
        "monstrous moonshine": "monstrous moonshine"
    },
    {
        " conjecture by Conway and Norton, which relates discrete and non-discrete mathematics and was finally proved by ": null
    },
    {
        "Richard Borcherds": "richard ewen borcherds"
    },
    {
        " in 42     In this setting, the monster group is visible as the automorphism group of the ": null
    },
    {
        "monster module": "monster module"
    },
    {
        ", a ": null
    },
    {
        "vertex operator algebra": "vertex operator algebra"
    },
    {
        ", an infinite dimensional algebra containing the Griess algebra, and acts on the ": null
    },
    {
        "monster Lie algebra": "monster lie algebra"
    },
    {
        ", a ": null
    },
    {
        "generalized Kac–Moody algebra": "generalized kac–moody algebra"
    },
    {
        ".     Many mathematicians including Conway regard the monster as a beautiful and still mysterious object.  By ": null
    },
    {
        "Siobhan Roberts": "siobhan roberts"
    },
    {
        " Institute for Advanced Study": "institute for advanced study"
    },
    {
        ", Published 42 ": null
    },
    {
        "Simon P. Norton": "simon p. norton"
    },
    {
        ", an expert on the properties of the monster group, is quoted as saying, “I can explain what Monstrous Moonshine is in one sentence, it is the voice of God.”  ": null
    },
    {
        "The Guardian": "the guardian"
    },
    {
        ", 42 Feb 42         There are also connections between the monster and the extended ": null
    },
    {
        "Dynkin diagram": "dynkin diagram"
    },
    {
        "s \\tilde E_42 specifically between the nodes of the diagram and certain conjugacy classes in the monster, known as McKays E 42 observation.    This is then extended to a relation between the extended diagrams \\tilde E_42 \\tilde E_42 \\tilde E_42 and the groups 42Fi 42 ′, 42B, and M, where these are of the ": null
    },
    {
        "Fischer group": "fischer group"
    },
    {
        ", ": null
    },
    {
        "baby monster group": "baby monster group"
    },
    {
        ", and monster. These are the ": null
    },
    {
        "sporadic group": "sporadic group"
    },
    {
        "s associated with centralizers of elements of type 42A, 42A, and 42A in the monster, and the order of the extension corresponds to the symmetries of the diagram. See ": null
    },
    {
        "ADE classification: trinities": "ade classificationtrinities"
    },
    {
        " for further connections , including with the rather small simple group ": null
    },
    {
        "PSL": "projective special linear group"
    },
    {
        " and with the 42 tritangent planes of a canonic sextic curve of genus 42 known as ": null
    },
    {
        "Brings curve": "brings curve"
    },
    {
        ".            The monster has at least 42 conjugacy classes of maximal ": null
    },
    {
        "subgroups": "subgroups"
    },
    {
        ". Non-abelian simple groups of some 42 ": null
    },
    {
        "isomorphism": "isomorphism"
    },
    {
        " types are found as subgroups or as quotients of subgroups. The largest ": null
    },
    {
        "alternating group": "alternating group"
    },
    {
        " represented is A 42 .   The monster contains 42 of the 42 ": null
    },
    {
        "sporadic groups": "sporadic groups"
    },
    {
        " as subquotients. This diagram, based on one in the book Symmetry and the Monster by ": null
    },
    {
        "Mark Ronan": "mark ronan"
    },
    {
        ", shows how they fit together. The lines signify inclusion, as a subquotient, of the lower group by the upper one. The circled symbols denote groups not involved in larger sporadic groups. For the sake of clarity redundant inclusions are not shown.     Forty-four of the classes of maximal subgroups of the monster are given by the following list, which is believed to be complete except possibly for almost simple subgroups with non-abelian simple ": null
    },
    {
        "socles": "socle"
    },
    {
        " of the form L 42 , U 42 , or U 42 , , . However, tables of maximal subgroups have often been found to contain subtle errors, and in particular at least two of the subgroups on the list below were incorrectly omitted in some previous lists.       centralizer of an involution; contains the normalizer × 42 of a Sylow 42-subgroup   42 4242 .Co 42  centralizer of an involution   42Fi 42  normalizer of a subgroup of order 42; contains the normalizer .42 of a Sylow 42-subgroup   42 42 . 42 E 42 :S 42  normalizer of a Klein 42-group   42 4242 .O 42 +   42 424242 .  normalizer of a Klein 42-group; contains the normalizer × S 42 of a Sylow 42-subgroup   42 4242 .42Suz.42  normalizer of a subgroup of order 42   42 424242 .   S 42 × Th  normalizer of a subgroup of order 42; contains the normalizer × S 42 of a Sylow 42-subgroup   42 42424242 .   42 42 .O 42 & minus; .42 42   .42  normalizer of a subgroup of order 42   .S 42   42 424242 .   42 42424242 :   42 4242 :42J 42 :42  normalizer of a subgroup of order 42   :42  normalizer of a subgroup of order 42   :42   42 4242 .   .   :42  contains the normalizer :42 of a Sylow 42-subgroup   42 424242 :   .42  contains the normalizer .42 of a Sylow 42-subgroup   42 4242 :  normalizer of a subgroup of order 42   .S 42   :42  contains the normalizer :42 of a subgroup of order 42   :42   42 42 ::42 42   42 424242 :GL 42   M 42 × A 42 .42 42   :S 42   :42   42 42 :42L 42 .42   :42   .42  normalizer of a subgroup of order 42   42 4242 :  normalizer of a subgroup of order 42; normalizer of a Sylow 42-subgroup   L 42   contains the normalizer 42:42 of a Sylow 42-subgroup   L 42   contains the normalizer 42:42 of a Sylow 42-subgroup   42 42 :  normalizer of a Sylow 42-subgroup.   L 42   found a maximal subgroup of this form; due to a subtle error pointed out by Zavarnitsine some previous lists and papers stated that no such maximal subgroup existed   L 42 :42    this was accidentally omitted on some previous lists of 42-local subgroups   L 42 :42    normalizer of a Sylow 42-subgroup   ": null
    }
]