[
    {
        "A month is a unit of ": null
    },
    {
        "time": "time"
    },
    {
        ", used with ": null
    },
    {
        "calendar": "calendar"
    },
    {
        "s, which is approximately as long as a natural ": null
    },
    {
        "period": "orbital period"
    },
    {
        " related to the motion of the ": null
    },
    {
        "Moon": "moon"
    },
    {
        "; month and Moon are ": null
    },
    {
        "cognate": "cognate"
    },
    {
        "s. The traditional concept arose with the cycle of ": null
    },
    {
        "Moon phase": "moon phase"
    },
    {
        "s; such months  are ": null
    },
    {
        "synodic months": "lunar monthsynodic month"
    },
    {
        " and last approximately 29.53 ": null
    },
    {
        "day": "day"
    },
    {
        "s. From excavated ": null
    },
    {
        "tally stick": "tally stick"
    },
    {
        "s, researchers have deduced that people counted days in relation to the Moons phases as early as the ": null
    },
    {
        "Paleolithic": "paleolithic"
    },
    {
        " age. Synodic months, based on the Moons ": null
    },
    {
        "orbital period": "orbital period"
    },
    {
        " with respect to the Earth-Sun line, are still the basis of many calendars today, and are used to divide the ": null
    },
    {
        "year": "year"
    },
    {
        ".          The following types of months are mainly of significance in astronomy, most of them first recognized in ": null
    },
    {
        "Babylonian lunar astronomy": "lunar theorybabylon"
    },
    {
        ".     The sidereal month is defined as the Moons ": null
    },
    {
        "orbital period": "orbital period"
    },
    {
        " in a non-rotating frame of reference . It is about 27.32166 days . It is closely equal to the time it takes the Moon to pass twice a fixed ": null
    },
    {
        "star": "star"
    },
    {
        " .   A synodic month is the most familiar lunar cycle, defined as the time interval between two consecutive occurrences of a particular phase as seen by an observer on Earth. The mean length of the synodic month is 29.53059 days . Due to the eccentricity of the lunar orbit around Earth , the length of a synodic month can vary by up to seven hours.   The tropical month is the average time for the Moon to pass twice through the same ": null
    },
    {
        "equinox": "equinox"
    },
    {
        " point of the sky. It is 27.32158 days, very slightly shorter than the sidereal month days, because of ": null
    },
    {
        "precession of the equinoxes": "precession of the equinoxes"
    },
    {
        ".   An anomalistic month is the average time the Moon takes to go from ": null
    },
    {
        "perigee": "perigee"
    },
    {
        " to perigee - the point in the Moons orbit when it is closest to Earth. An anomalistic month is about 27.55455 days on average.   The draconic month, draconitic month, or nodal month is the period in which the Moon returns to the same ": null
    },
    {
        "node": "lunar node"
    },
    {
        " of its orbit; the nodes are the two points where the Moons orbit crosses the plane of the Earths orbit. Its duration is about 27.21222 days on average.     A synodic month is longer than a sidereal month because the Earth-Moon system is orbiting the Sun in the same direction as the Moon is orbiting the Earth. The Sun moves eastward with respect to the stars and it takes about 2.2 days longer for the Moon to return to the same apparent position with respect to the Sun.     An anomalistic month is longer than a sidereal month because the perigee moves in the same direction as the Moon is orbiting the Earth, one revolution in nine years. Therefore, the Moon takes a little longer to return to perigee than to return to the same star.     A draconic month is shorter than a sidereal month because the nodes move in the opposite direction as the Moon is orbiting the Earth, one revolution in 18.6 years. Therefore, the Moon returns to the same node slightly earlier than it returns to the same star.            At the simplest level, most well-known lunar calendars are based on the initial approximation that 2 lunations last 59 days: a 30-day full month followed by a 29-day hollow month — but this is only roughly accurate, and eventually needs correction by using larger cycles, or the equivalent of ": null
    },
    {
        "leap day": "leap day"
    },
    {
        "s. Additionally, the synodic month does not fit easily into the year, which makes accurate, rule-based lunisolar calendars complicated. The most common solution to this problem is the ": null
    },
    {
        "Metonic cycle": "metonic cycle"
    },
    {
        ", which takes advantage of the fact that 235 lunations are approximately 19 ": null
    },
    {
        "tropical years": "tropical year"
    },
    {
        ". However, a Metonic calendar will drift against the seasons by about 1 day every 200 years. Metonic calendars include the calendar used in the ": null
    },
    {
        "Antikythera Mechanism": "antikythera mechanism"
    },
    {
        " about 2000 years ago, and the ": null
    },
    {
        "Hebrew calendar": "hebrew calendar"
    },
    {
        ".     The complexity required in an accurate lunisolar calendar may explain why ": null
    },
    {
        "solar calendars": "solar calendar"
    },
    {
        " have generally replaced lunar calendars for civil use in most societies.              The ": null
    },
    {
        "Hellenic calendars": "hellenic calendars"
    },
    {
        ", the ": null
    },
    {
        "Hebrew Lunisolar calendar": "hebrew calendar"
    },
    {
        " and the ": null
    },
    {
        "Islamic Lunar calendar": "islamic calendar"
    },
    {
        " started the month with the first appearance of the thin crescent of the ": null
    },
    {
        "new moon": "new moon"
    },
    {
        ".     However, the motion of the Moon in its ": null
    },
    {
        "orbit": "orbit"
    },
    {
        " is very complicated and its period is not constant. The date and time of this actual observation depends on the exact geographical longitude as well as latitude, atmospheric conditions, the visual acuity of the observers, etc. Therefore, the beginning and lengths of months defined by observation cannot be accurately predicted.     While some like the Jewish ": null
    },
    {
        "Karaites": "karaite"
    },
    {
        " still rely on actual moon observations, most people use the ": null
    },
    {
        "Gregorian solar calendar": "gregorian calendar"
    },
    {
        ".     ": null
    },
    {
        "Pingelapese": "pingelapese language"
    },
    {
        ", a language from ": null
    },
    {
        "Micronesia": "micronesia"
    },
    {
        ", also uses a lunar calendar. There are 12 months associated with their calendar. The moon first appears in March, they name this month Kahlek. This system has been used for hundreds of years and throughout many generations. This calendar is cyclical and relies on the position and shape of the moon.        The ": null
    },
    {
        "Gregorian calendar": "gregorian calendar"
    },
    {
        ", like the ": null
    },
    {
        "Julian calendar": "julian calendar"
    },
    {
        " before it, has twelve months:                     The mean month length of the Gregorian calendar is 30.436875 days.     Months existing in the ": null
    },
    {
        "Roman calendar": "roman calendar"
    },
    {
        " in the past include:   ": null
    },
    {
        "the mensis intercalaris": "intercalaris"
    },
    {
        ", an occasional month after February to realign the calendar.   ": null
    },
    {
        "Quintilis": "quintilis"
    },
    {
        ", renamed to July in honour of ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        ".   ": null
    },
    {
        "Sextilis": "sextilis"
    },
    {
        ", renamed to August in honour of ": null
    },
    {
        "Augustus": "augustus"
    },
    {
        ".     The famous ": null
    },
    {
        "mnemonic": "mnemonic"
    },
    {
        "  Thirty days hath September  is a common way of teaching the lengths of the months in the English-speaking world.     Also, note that any five consecutive months contain 153 days.     The knuckles of the four fingers of ones hand and the spaces between them can be used to remember the lengths of the months. By making a fist, each month will be listed as one proceeds across the hand. All months landing on a knuckle are 31 days long and those landing between them are not. When the knuckle of the index finger is reached , go back to the first knuckle and continue with August. This physical mnemonic has been taught to primary school students for many decades.       This cyclical pattern of month lengths matches the ": null
    },
    {
        "musical keyboard": "musical keyboard"
    },
    {
        " alternation of white and black keys .       The  ides  occur on the thirteenth day in eight of the months, but in March, May, July, and October, they occur on the fifteenth. The  nones  always occur 8 days before the ides, i.e., on the fifth or the seventh. The  calends  are always the first day of the month, and before Julius Caesars reform fell sixteen days after the ides .         Within a month, the following dates fall on the same weekday:     01, 08, 15, 22, and 29   02, 09, 16, 23, and 30   03, 10, 17, 24, and 31   04, 11, 18, and 25   05, 12, 19, and 26   06, 13, 20, and 27   07, 14, 21, and 28     Some months have the same date/weekday structure.     In a non-leap year:     January/October   February/March/November   April/July   September/December     January 01 and December 31 fall on the same weekday     In a leap year:     February/August   March/November   January/April/July   September/December     February 29  falls on the same weekday like February 01, 08, 15, 22, and August 01       The ": null
    },
    {
        "Hebrew calendar": "hebrew calendar"
    },
    {
        " has 12 or 13 months.   ": null
    },
    {
        "Nisan": "nisan"
    },
    {
        ", 30 days ניסן   ": null
    },
    {
        "Iyar": "iyar"
    },
    {
        ", 30 days אייר   ": null
    },
    {
        "Sivan": "sivan"
    },
    {
        ", 30 days סיון   ": null
    },
    {
        "Tammuz": "tammuz"
    },
    {
        ", 29 days תמוז   ": null
    },
    {
        "Av": "av"
    },
    {
        ", 30 days אב   ": null
    },
    {
        "Elul": "elul"
    },
    {
        ", 29 days אלול   ": null
    },
    {
        "Tishri": "tishri"
    },
    {
        ", 30 days תשרי   ": null
    },
    {
        "Marcheshvan": "marcheshvan"
    },
    {
        ", 29/30 days מַרְחֶשְׁוָן   ": null
    },
    {
        "Kislev": "kislev"
    },
    {
        ", 30/29 days כסלו   ": null
    },
    {
        "Tevet": "tevet"
    },
    {
        ", 29 days טבת   ": null
    },
    {
        "Shevat": "shevat"
    },
    {
        ", 30 days שבט   ": null
    },
    {
        "Adar 1": "adar 1"
    },
    {
        ", 30 days, ": null
    },
    {
        "intercalary": "intercalation"
    },
    {
        " month אדר א   ": null
    },
    {
        "Adar 2": "adar 2"
    },
    {
        ", 29 days אדר ב     Adar 1 is only added 7 times in 19 years. In ordinary years, Adar 2 is simply called Adar.       There are also twelve months in the Islamic calendar. They are named as follows:   ": null
    },
    {
        "Muharram": "muharram"
    },
    {
        " محرّم   ": null
    },
    {
        "Safar": "safar"
    },
    {
        " صفر   ": null
    },
    {
        "Rabī al-Awwal": "rabi al-awwal"
    },
    {
        "/Rabi I ربيع الأول   ": null
    },
    {
        "Rabī’ ath-Thānī": "rabī’ al-thānī"
    },
    {
        "/Rabi al-Aakhir/Rabi II ربيع الآخر أو ربيع الثاني   ": null
    },
    {
        "Jumada al-Awwal": "jumada al-awwal"
    },
    {
        "/Jumaada I جمادى الأول   ": null
    },
    {
        "Jumada ath-Thānī": "jumada al-thani"
    },
    {
        " or Jumādā al-Thānī/Jumādā II جمادى الآخر أو جمادى الثاني   ": null
    },
    {
        "Rajab": "rajab"
    },
    {
        " رجب   ": null
    },
    {
        "Shabān": "shaban"
    },
    {
        " شعبان   ": null
    },
    {
        "Ramadān": "ramadan"
    },
    {
        " رمضان   ": null
    },
    {
        "Shawwāl": "shawwal"
    },
    {
        " شوّال   ": null
    },
    {
        "Dhu al-Qidah": "dhu al-qidah"
    },
    {
        " ذو القعدة   ": null
    },
    {
        "Dhu al-Hijjah": "dhu al-hijjah"
    },
    {
        " ذو الحجة     See ": null
    },
    {
        "Islamic calendar": "islamic calendar"
    },
    {
        " for more information on the Islamic calendar.                   The ": null
    },
    {
        "Hindu calendar": "hindu calendar"
    },
    {
        " has various systems of naming the months. The months in the lunar calendar are:          These are also the names used in the ": null
    },
    {
        "Indian national calendar": "indian national calendar"
    },
    {
        " for the newly redefined months. Purushottam Maas or Adhik Maas  is an extra month in the ": null
    },
    {
        "Hindu calendar": "hindu calendar"
    },
    {
        " that is inserted to keep the ": null
    },
    {
        "lunar": "lunar calendar"
    },
    {
        " and ": null
    },
    {
        "solar calendars": "solar calendar"
    },
    {
        "aligned. Purushottam is an epithet of ": null
    },
    {
        "Vishnu": "vishnu"
    },
    {
        ", to whom the month is dedicated.     The names in the solar calendar are just the names of the ": null
    },
    {
        "zodiac": "zodiac"
    },
    {
        " sign in which the sun travels. They are     ": null
    },
    {
        "Mesha": "aries"
    },
    {
        "   Vrishabha": "taurus"
    },
    {
        "   Mithuna": "gemini"
    },
    {
        "   Kataka": "cancer"
    },
    {
        "   Simha": "leo"
    },
    {
        "   Kanyaa": "virgo"
    },
    {
        "   Tulaa": "libra"
    },
    {
        "   Vrishcika": "scorpius"
    },
    {
        "   Dhanus": "sagittarius"
    },
    {
        "   Makara": "capricornus"
    },
    {
        "   Kumbha": "aquarius"
    },
    {
        "   Miina": "pisces"
    },
    {
        "         The ": null
    },
    {
        "Baháí calendar": "baháí calendar"
    },
    {
        " is the calendar used by the ": null
    },
    {
        "Baháí Faith": "baháí faith"
    },
    {
        ". It is a solar calendar with regular years of 365 days, and ": null
    },
    {
        "leap years": "leap year"
    },
    {
        "of 366 days. Years are composed of 19 months of 19 days each , plus an extra period of ": null
    },
    {
        "Intercalary Days": "ayyám-i-há"
    },
    {
        " .  The months are named after the attributes of God. Days of the year begin and end at sundown.       The ": null
    },
    {
        "Iranian / Persian calendar": "iranian calendar"
    },
    {
        ", currently used in ": null
    },
    {
        "Iran": "iran"
    },
    {
        " and ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        ", also has 12 months. The ": null
    },
    {
        "Persian": "persian language"
    },
    {
        " names are included in the parentheses. It begins on the northern Spring equinox.   ": null
    },
    {
        "Farvardin": "farvardin"
    },
    {
        "   Ordibehesht": "ordibehesht"
    },
    {
        "   Khordad": "khordad"
    },
    {
        "   Tir": "tir"
    },
    {
        "   Mordad": "mordad"
    },
    {
        "   Shahrivar": "shahrivar"
    },
    {
        "   Mehr": "mehr"
    },
    {
        "   Aban": "aban"
    },
    {
        "   Azar": "azar"
    },
    {
        "   Dey   ": null
    },
    {
        "Bahman": "bahman"
    },
    {
        "   Esfand": "esfand"
    },
    {
        "       The ": null
    },
    {
        "Bangla calendar": "bangla calendar"
    },
    {
        ", used in ": null
    },
    {
        "Bangladesh": "bangladesh"
    },
    {
        ", follows solar months and it has six seasons. The months and seasons in the calendar are:              The months in the ": null
    },
    {
        "Nanakshahi calendar": "nanakshahi calendar"
    },
    {
        " are:             Like the Hindu calendar, the Khmer calendar consists of both a lunar calendar and a solar calendar.     The Khmer solar calendar is used more commonly than the lunar calendar. There are 12 months and the numbers of days follow the Julian and Gregorian calendar.          The Khmer lunar calendar contains 12 months; however, the eighth month is repeated every two or three years, making 13 months instead of 12.      មិគសិរ   បុស្ស   មាឃ   ផល្គុន   ចេត្រ   វិសាខ/ ពិសាខ   ជេស្ឋ   ឤសាឍ, or in the case of a year with a leap-month:   បឋមសាឍ   ទុតិយាសាឍ   ស្រាពណ៍   ភទ្របទ   អស្សុជ   កត្តិក                 The Tongan calendar is based on the cycles of the moon around the earth in one year. The months are:     Liha Mua   Liha Mui   Vai Mua   Vai Mui   Fakaafu Moui   Fakaafu Mate   Hilinga Kelekele   Hilinga Meaa   Aoao   Fuufuunekinanga   Uluenga   Tanumanga   Ooamofanongo     ": null
    },
    {
        "Malayalam": "malayalam"
    },
    {
        " දුරුතුනවම්මැදින්බක්වෙසක්පොසොන්ඇසලනිකිණිබිනරවප්iLඉල්උඳුවප් Old style : January 9 to January 15 Old style : February 8 to February 14 Short days mid October - mid November, slaughter month or ": null
    },
    {
        "Górs": "gór"
    },
    {
        "month mid November - mid December, ": null
    },
    {
        "Yule": "yule"
    },
    {
        " month mid December - mid January, fat sucking month mid January - mid February, frozen snow month mid February - mid March, Góas month, see ": null
    },
    {
        "Nór": "nór"
    },
    {
        " mid March - mid April, lone or single month Nightless days mid April - mid May, Harpa is a female name, probably a forgotten goddess, first day of Harpa is celebrated as ": null
    },
    {
        "Sumardagurinn fyrsti": "sumardagurinn fyrsti"
    },
    {
        " - first day of summermid May - mid June, another forgotten goddessmid June - mid July, ": null
    },
    {
        "sun": "sun"
    },
    {
        " month mid July - mid August, ": null
    },
    {
        "hay": "hay"
    },
    {
        " business month mid August - mid September, two or second month mid September - mid October, autumn month  countryJanuary, Torres month February, Goes month March, Spring monthApril, Grass monthMay, Bloom monthJune, Summer monthJuly, Hay monthAugust, Harvest month or Rotten monthSeptember, Autumn monthOctober, Slaughter monthNovember, Winter monthDecember, Christmas monthJanuary, After-": null
    },
    {
        "Yule": "yule"
    },
    {
        " monthFebruary, Sol monthMarch, ": null
    },
    {
        "Hreth": "hretha"
    },
    {
        " monthApril, ": null
    },
    {
        "Ēostur": "ēostre"
    },
    {
        " monthMay, Three-milkings monthJune, Ere-": null
    },
    {
        "Litha": "litha"
    },
    {
        "July, After-LithaAugust, Weed monthSeptember, Holy month or Harvest monthOctober, Winter-fillethNovember, ": null
    },
    {
        "Blót": "blót"
    },
    {
        " monthDecember, Ere-": null
    },
    {
        "Yule": "yule"
    },
    {
        "in Latin: Calendarium TyrnavienseJanuary, month of the happy/blessed ladyFebruary, month of early fasting/Lent or month before fasting/LentMarch, second month of fasting/LentApril, Saint Georges monthMay, Pentecost monthJune, Saint John monthJuly, Saint James monthAugust, month of the ": null
    },
    {
        "Virgin": "blessed virgin"
    },
    {
        "September, Saint Michaels monthOctober, all saints monthNovember, Saint Andrews monthDecember, month of Yule/Christmasiceto dive, referring to the ice sinking into the water due to meltingbirchoakflowerred - for the color of apples and tomatoesformerly known as 2nd červenmeaning to reflect, referring to the shine on the wheatrefers to the sun light shining through the cloudsepagomenes  ": null
    },
    {
        "ench Republican Calend": "ench republican calend"
    },
    {
        " typically December 27": null
    },
    {
        "onolo": "onolo"
    },
    {
        "and the occasionally elided consonants ": null
    }
]