[
    {
        "Moral Politics: How Liberals and Conservatives Think is a 42 book by cognitive linguist ": null
    },
    {
        "George Lakoff": "george lakoff"
    },
    {
        ". It argues that ": null
    },
    {
        "conservatives": "conservatism"
    },
    {
        " and ": null
    },
    {
        "liberals": "liberalism"
    },
    {
        " hold two different conceptual models of ": null
    },
    {
        "morality": "morality"
    },
    {
        ". Conservatives have a ": null
    },
    {
        "strict father model": "strict father model"
    },
    {
        " in which people are made good through self-discipline and hard work, everyone is taken care of by taking care of themselves. Liberals have a ": null
    },
    {
        "nurturant parent model": "nurturant parent model"
    },
    {
        " in which everyone is taken care of by helping each other.     The first edition of the book was published with the subtitle  What Conservatives Know That Liberals Dont .         Moral Politics has two different purposes. Lakoff uses the techniques of ": null
    },
    {
        "cognitive linguistics": "cognitive linguistics"
    },
    {
        " to attempt to better understand the mental frameworks that lie behind contemporary American politics, describing which mental concepts make up a liberal , and which a conservative . And, in the last few chapters, he argues that liberal morals and politics are superior to conservative morals and politics.     The book is intended as an objective study of the ": null
    },
    {
        "conceptual metaphor": "conceptual metaphor"
    },
    {
        "s underlying conservative and liberal politics although the closing section is devoted to the authors personal views. Lakoff makes it clear however, that there is no such thing as an Objective study of politics, as politics is based in subjective morality.     Lakoff wrote Moral Politics soon after the Republican Partys ": null
    },
    {
        "Contract With America": "contract with america"
    },
    {
        " takeover of Congress under the ": null
    },
    {
        "Clinton": "bill clinton"
    },
    {
        " presidency, and his usage of the terms liberal and conservative is strongly influenced by how those labels were used in the 42 elections, the former having much to do with the Democratic party and the latter with the Republican party; indeed, chapter 42 Moral Categories in Politics , presents ": null
    },
    {
        "Hillary Clinton": "hillary clinton"
    },
    {
        " as a prototypical liberal and ": null
    },
    {
        "Newt Gingrich": "newt gingrich"
    },
    {
        " as a prototypical conservative .         The major observations/assumptions and questions on which the book is founded include these:     There is one cluster of beliefs that most conservatives share  and another cluster that most liberals share . What is the explanation for this clustering? What unifies each of the lists of moral priorities? Mix and match views seem comparatively rare. How come?   Liberals and conservatives usually not only disagree with one another but view the other side as largely incoherent. Many liberals, for example, see building more prisons as a completely ineffective and illogical solution to crime, while many conservatives view it as the obvious solution. Why cant the one side even begin to understand the other?   Why do liberals and conservatives tend to use the same words to mean different things? For example, a liberal might use the term big government to condemn the military, but, to a conservative, the term big government has nothing to do with the military, even though the military is a significant government institution.   Why do liberals and conservatives make different issues the focus of campaigns? For example, why did the Republican leaders emphasize family values so much in their 42 campaign, and why was similar emphasis not made by Democrats? Dont liberals also have families and a moral framework for reasoning about families?         Lakoff tries to resolve these difficulties through a model in which liberals and conservatives are shown to have different and contradictory worldviews. These worldviews are thought to conflict in a number of ways relevant to the understanding of politics. Nonetheless, Lakoff claims that all of these differences center around the two sides respective understandings of a single concept - the ideal nuclear family.     The family is central to Lakoff because he views the family as the most familiar model for Americans to understand the country; that is, Americans often metaphorically understand their country as a family, with the government corresponding to the parent of the family and the individual citizens corresponding to the children. Thus, ones understanding of how a family is best organized will have direct implications for how the country should be governed.     The progressive ideal conceptualization follows the model of the nurturant parent family, while the conservatives follows the model of the strict father family. Given the importance of these concepts in Moral Politics, it is important to consider their meaning, along with how each view suggests and is justified by a corresponding view of the nature of child rearing, morality, and justice.     A nurturant parent family is one that revolves around every family member caring for and being cared for by every other family member, with open communication between all parties, and with each family member pursuing their own vision of happiness. The nurturant parent model is also correlated with the following views:     Morality: The basis of morality is in understanding, respecting, and helping other people, and in seeking the happiness of ones self and of others. The primary vices are selfishness and anti-social behavior.   Child development: Children develop morality primarily through interacting with and observing good people, especially good parents. Punishment is necessary in some cases, but also has the potential to backfire, causing children to adopt more violent or more anti-social ways. Though children should, in general, obey their parents, they will develop best if allowed to question their parents decisions, to hear justifications for their parents rules, and so on. Moral development is a lifelong process, and almost no one is so perfect as not to need improvement.   Justice: The world is not without justice, but it is far from the ideal of justice. Many people, for example, do not seem properly rewarded for their hard work and dedication. We must work hard to improve everyones condition.     In contrast, the strict father family revolves around the idea that parents teach their children how to be self-reliant and self-disciplined through tough love . This is correlated with the following views:     Morality: Evil is all around us, constantly tempting us. Thus, the basis of morality is strong moral character, which requires self-reliance and self-discipline. The primary vices are those that dissolve self-discipline, such as laziness, gluttony, and indulgent sexuality.   Child development: Children develop self-discipline, self-reliance, and other virtues primarily through rewards and punishment, a system of tough love . Since parents know the difference between right and wrong and children still do not, obedience to the parents is very important. Moral development basically lasts only as long as childhood; its important to get it right the first time, because there is no second chance .   Justice: The world may be a difficult place to live, but it is basically just; people usually get what they deserve. The difficulties in ones life serve as a test to sort the deserving from the undeserving.     Lakoff uses this model to answer the central questions framed above - why is there such clear grouping on issues that separate liberals and conservatives, and, conversely, why dont we find more issue-by-issue voters? Lakoff claims that ones take on any given political issue is largely determined by which model one adopts. Thus, in Part IV, The Hard Issues , he tries to demonstrate how the liberal and conservative worldviews outlined above lead to typical liberal and conservative positions on a wide range of issues, including taxes, the death penalty, environmental regulations, affirmative action, education, and abortion.     As to why liberals and conservatives view each other as incomprehensible on an issue-by-issue basis, Lakoff claims that this is due to each side failing to grasp the other sides worldview as well as not appreciating how different the other worldview is from its own. Failure to see or appreciate this gap results in both sides thinking the other is hopelessly irrational and immoral.     Lakoff also uses this model to show how and why liberals and conservatives use different semantics, often even using the same words in very different ways. Liberals and conservatives have different worldviews and semantics are very much influenced by the worldview of the speaker. As Lakoff puts it,     :Words dont have meanings in isolation. Words are defined relative to a conceptual system. If liberals are to understand how conservatives use their words, they will have to understand the conservative conceptual system.     Here, Lakoff is specifically referring to liberals challenges in understanding conservatives. However, he obviously views the reverse situation as equally problematic.     In addressing why conservatives and liberals choose different issues as the focus of their campaigns, Lakoff claims that this too finds explanation in the context of his model. In the 42 elections, the Republican focus on family values , while the Democrats largely ignored this framing, is key to Lakoff. He views this discrepancy as a sign that conservatives understand the Country is a Family metaphor that lies behind peoples views of politics much better than liberals do. And, by extension, this has been key to the success of the Republican Party.         There are several things Lakoff does not intend to mean with his model. Perhaps most importantly, he does not believe that all conservatives are the same, nor all liberals. Chapter 42 Varieties of Liberals and Conservatives , is devoted to showing scales along which one can slide and still be a member of either camp. Among other things, he says that one might have one way to conceptualize an actual nuclear family, and a separate, even opposite, way of conceptualizing a metaphorical country-family. Lakoff is not trying to establish necessary and sufficient conditions for being liberal or conservative. In the terminology of cognitive linguistics, Lakoff views both liberal and conservative as radial category labels.     Lakoff does not feel people consciously believe in the family concepts he describes. As a cognitive scientist, he believes he is describing mental structures that are mostly below the level of consciousness. A tenet of ": null
    },
    {
        "cognitive psychology": "cognitive psychology"
    },
    {
        " is that such mental structures affect ones opinions and consequent actions.         Lakoff is opposed to superficial, stereotypical and false characterizing of both liberals and conservatives. The book addresses common oversimplifications about both worldviews.     In chapter 42 Why We Need a New Understanding of American Politics , Lakoff refutes several conceptions of Conservatism that he views as too simplistic. He says that any liberal or conservative saying that Conservatives just believe in less government is incorrect. Common misconceptions that liberals hold include that Conservatism is the ethos of selfishness and is no more than a conspiracy of the ultrarich to protect their money and power and to make themselves even richer and more powerful. Common misunderstandings of conservatives by conservatives are that Conservatism is for traditional values , and that Conservatism is just what the Bible tells us.     In chapter 42 Pathologies, Stereotypes, and Distortions , he refutes certain stereotyped views of liberals, including viewing them as lovers of bureaucracy , defenders of special interests and advocating only rights and no responsibilities .         Lakoff argues that people tend to think metaphorically, reasoning through analogy rather than logic. Metaphors are prevalent in communication and we do not just use them in language; we actually perceive and act in accordance with metaphors. ": null
    },
    {
        "Conceptual metaphors": "conceptual metaphors"
    },
    {
        " shape not just our communication, but also the way we think and act.     As a cognitive scientist Lakoff emphasizes that what conservatives know that liberals dont is how to use metaphors to motivate people. Liberals try to persuade through reason and facts while conservatives used metaphorical stories and that is why, Lakoff argues, conservative politicians are more successful at motivating voters than liberals are.         The books subtitle changed between the first and the current edition. Previously titled Moral Politics: What Conservatives Know That Liberals Dont, it has been rechristened Moral Politics: How Liberals and Conservatives Think.     The original subtitle reflected Lakoffs idea that conservatives, at least 42 conservatives, understood the nature of American politics better than liberals. In particular, he felt conservatives better understood the metaphorical connection between the family, morality and politics; and, especially around 42 were able to gain votes by using persuasive metaphors, whilst liberals employed logic and reason. Within this framework, the original subtitle can be seen as a call-to-arms to liberals to gain understanding of how people actually think about politics, or face growing electoral irrelevance.     The bulk of the second edition text is identical to that of the first. All that is added is a second edition preface, and a 42-page afterword relating the books content to the 42 US presidential election.           Presidential candidate ": null
    },
    {
        "Howard Dean": "howard dean"
    },
    {
        " is a fan of the book, citing it as support for his activist strategy. What you do is crank the heck out of your base, get them really excited and crank up the base turnout and youll win the middle-of-the-roaders, Dean told  US News and World Report . Dean reasoned that since swing voters share the mental model of both parties they will eventually go with whatever party excites them the most. Democrats appeal to them on their softer side--the safety net--but the Republicans appeal to them on the harder side--the discipline, the responsibility, and so forth. So the question is which side appears to be energetic, deeply believing in its message, deeply committed to bringing a vision of hope to America. That side is the side that gets the swing voters and wins.     While Dean lost the 42 Presidential Democratic primary, he has been successful in other political and activist arenas. First, he was the governor of Vermont, and later the front-runner in a crowded primary race although his campaign was staffed mostly by students and non-professional political staff. Dean later formed the activist organization ": null
    },
    {
        "Democracy for America": "democracy for america"
    },
    {
        " and later was elected chairman of the ": null
    },
    {
        "Democratic National Committee": "democratic national committee"
    },
    {
        " in February 42 Deans activism is widely credited with reviving the activist base of the Democratic Party.     Dean later wrote the introduction to a related but shorter book by Lakoff, Dont Think of an Elephant: Know Your Values and Frame the Debate": null
    }
]