[
    {
        "Moral equivalence is a term used in political debate, usually to deny that a moral comparison can be made of two sides in a conflict, or in the actions or tactics of two sides.     The term had some currency in polemic debates about the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ", and currently the ": null
    },
    {
        "Arab–Israeli conflict": "arab–israeli conflict"
    },
    {
        ". Moral equivalence began to be used as a polemic term-of-retort to ": null
    },
    {
        "moral relativism": "moral relativism"
    },
    {
        " , which had been gaining use as an indictment against political foreign policy that appeared to use only a ": null
    },
    {
        "situation": "situational ethics"
    },
    {
        "-based application of widely held ": null
    },
    {
        "ethical": "ethics"
    },
    {
        " standards.     International conflicts are sometimes viewed similarly, and interested parties periodically urge both sides to conduct a ceasefire and negotiate their differences. However these negotiations may prove difficult in that both parties in a conflict believe that they are ": null
    },
    {
        "morally superior": "superiority complex"
    },
    {
        " to the other, and are unwilling to negotiate on basis of moral equivalence.       In the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " context, the term was and is most commonly used by anti-Communists as an accusation of ": null
    },
    {
        "formal fallacy": "formal fallacy"
    },
    {
        " for ": null
    },
    {
        "leftist": "left-wing politics"
    },
    {
        " criticisms of United States foreign policy and military conduct.     Many such people believed in the idea that the ": null
    },
    {
        "United States": "united states"
    },
    {
        " was intrinsically benevolent, that the extension of its power, influence and hegemony was an extension of benevolence and would bring freedom to those people subject to that hegemony. Therefore, those who opposed the United States were by definition evil, trying to deny its benevolence to people. The USSR and its allies, in contrast, practiced a ": null
    },
    {
        "totalitarian": "totalitarian"
    },
    {
        " ideology. A territory under US hegemony thus would be freed from possibly being in the camp of the totalitarian power and would help to weaken it. Thus, all means were justified in keeping territories away from Soviet influence in this way. This extended to countries not under Soviet influence but instead said to be sympathetic at all in any way with it. Therefore, ": null
    },
    {
        "Chile": "chile"
    },
    {
        " under ": null
    },
    {
        "Salvador Allende": "salvador allende"
    },
    {
        " was not under Soviet domination, but removing him would help weaken the USSR by removing a government ruled with the help of a ": null
    },
    {
        "Communist Party": "communist party"
    },
    {
        ". The big picture, they would say, justified the tortures carried out by the ": null
    },
    {
        "Augusto Pinochet": "augusto pinochet"
    },
    {
        " dictatorship as it served to weaken the totalitarian Communist camp and in time bring about the freedom of those under its domination.     Some of those who criticized US foreign policy at the time contended that US power in the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " was used only to pursue an ": null
    },
    {
        "economically-driven agenda": "capitalism"
    },
    {
        ". They claim that the underlying economic motivation eroded any claims of ": null
    },
    {
        "moral superiority": "moral hierarchy"
    },
    {
        ", leaving the hostile acts  to stand on their own. In contrast, those who justified US interventions in the Cold War period always cast these as being motivated by the need to contain totalitarianism and thus fulfilled a higher moral imperative.     An early popularizer of the expression was ": null
    },
    {
        "Jeane Kirkpatrick": "jeane kirkpatrick"
    },
    {
        ", who was United States ambassador to the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " in the ": null
    },
    {
        "Reagan": "ronald reagan"
    },
    {
        " administration. Kirkpatrick published an article called The Myth of Moral Equivalence in 1986, which sharply criticized those who she alleged were claiming that there was no moral difference between the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " and democratic states. ": null
    },
    {
        "Jeane Kirkpatrick": "jeane kirkpatrick"
    },
    {
        ". https://imprimis.hillsdale.edu/the-myth-of-moral-equivalence The Myth of Moral Equivalence, January 1986, Vol. 15, No. 1,  Imprimis  In fact, very few critics of United States policies in the Cold War era argued that there was a moral equivalence between the two sides. ": null
    },
    {
        "Communists": "communists"
    },
    {
        ", for instance, argued that the Soviet Union was morally superior to its adversaries. Kirkpatrick herself was one of the most outspoken voices calling for the US to support authoritarian military regimes in Central America that were responsible for major human rights violations. When four US churchwomen were raped and murdered by government soldiers in El Salvador, Kirkpatrick downplayed the gravity of the crime, remarking that the nuns were not just nuns, they were political activists.  According to Congressman Robert Torricelli, Reagan administration officials, including Kirkpatrick, deliberately suppressed information about government abuses in El Salvador: While the Reagan Administration was certifying human rights progress in El Salvador they knew the terrible truth that the Salvadoran military was engaged in a widespread campaign of terror and torture.      Leftist critics usually argued that the United States itself created a moral equivalence when some of its actions, such as President ": null
    },
    {
        "Ronald Reagans": "ronald reagan"
    },
    {
        "support for the  Contra  insurgency against the ": null
    },
    {
        "Sandinista": "sandinista"
    },
    {
        " government in ": null
    },
    {
        "Nicaragua": "nicaragua"
    },
    {
        ", put it on the same level of ": null
    },
    {
        "immorality": "immorality"
    },
    {
        " as the Soviet Union.     Moral equivalence has featured in debates over ": null
    },
    {
        "NATO expansion": "nato expansion"
    },
    {
        ", the overthrow of ": null
    },
    {
        "rogue states": "rogue states"
    },
    {
        ", the ": null
    },
    {
        "invasion of Iraq": "invasion of iraq"
    },
    {
        ", and the ": null
    },
    {
        "War on Terror": "war on terror"
    },
    {
        ". Concepts of moral hierarchy have been applied to foreign policy challenges such as ": null
    },
    {
        "Islamic fundamentalists": "islamic fundamentalists"
    },
    {
        ", ": null
    },
    {
        "anti-Israel": "anti-israel"
    },
    {
        " powers, ": null
    },
    {
        "Russia": "russia"
    },
    {
        ", ": null
    },
    {
        "China": "peoples republic of china"
    },
    {
        ", ": null
    },
    {
        "drug traffickers": "drug traffickers"
    },
    {
        ", and ": null
    },
    {
        "Serbian": "serbs"
    },
    {
        " nationalists": "nationalists"
    }
]