[
    {
        "Morphogenesis  is the ": null
    },
    {
        "biological process": "Biological Process"
    },
    {
        " that causes an ": null
    },
    {
        "organism": "Organism"
    },
    {
        " to develop its shape. It is one of three fundamental aspects of ": null
    },
    {
        "developmental biology": "Developmental Biology"
    },
    {
        " along with the control of ": null
    },
    {
        "cell growth": "Cell Growth"
    },
    {
        " and ": null
    },
    {
        "cellular differentiation": "Cellular Differentiation"
    },
    {
        ", unified in ": null
    },
    {
        "evolutionary developmental biology": "Evolutionary Developmental Biology"
    },
    {
        " .     The process controls the organized spatial distribution of cells during the ": null
    },
    {
        "embryonic development": "Developmental Biology"
    },
    {
        " of an ": null
    },
    {
        "organism": "Organism"
    },
    {
        ". Morphogenesis can take place also in a mature organism, in ": null
    },
    {
        "cell culture": "Cell Culture"
    },
    {
        " or inside ": null
    },
    {
        "tumor cell": "Tumor Cell"
    },
    {
        " masses. Morphogenesis also describes the development of ": null
    },
    {
        "unicellular": "Unicellular"
    },
    {
        " life forms that do not have an embryonic stage in their life cycle, or describes the ": null
    },
    {
        "evolution": "Evolution"
    },
    {
        " of a body structure within a ": null
    },
    {
        "taxonomic group": "Taxonomy"
    },
    {
        ".     Morphogenetic responses may be induced in organisms by ": null
    },
    {
        "hormone": "Hormone"
    },
    {
        "s, by environmental chemicals ranging from substances produced by other organisms to ": null
    },
    {
        "toxic chemicals": "Toxin"
    },
    {
        " or ": null
    },
    {
        "radionuclides": "Radioactive Isotope"
    },
    {
        " released as pollutants, and other plants, or by mechanical stresses  induced by spatial patterning of the cells.            Some of the earliest ideas and mathematical descriptions on how physical processes and constraints affect biological growth, and hence ": null
    },
    {
        "natural patterns": "Natural Patterns"
    },
    {
        " such as the ": null
    },
    {
        "spirals": "Spirals"
    },
    {
        " of ": null
    },
    {
        "phyllotaxis": "Phyllotaxis"
    },
    {
        ", were written by ": null
    },
    {
        "DArcy Wentworth Thompson": "Darcy Wentworth Thompson"
    },
    {
        " in his 1917 book  On Growth and Form     and ": null
    },
    {
        "Alan Turing": "Alan Turing"
    },
    {
        " in his  The Chemical Basis of Morphogenesis  .  Where Thompson explained animal body shapes as being created by varying rates of growth in different directions, for instance to create the ": null
    },
    {
        "spiral shell": "Gastropod Shell"
    },
    {
        " of a ": null
    },
    {
        "snail": "Snail"
    },
    {
        ", Turing correctly predicted a mechanism of morphogenesis, the diffusion of two different chemical signals, one activating and one deactivating growth, to set up patterns of development, decades before the formation of such patterns was observed.  The fuller understanding of the mechanisms involved in actual organisms required the discovery of the structure of ": null
    },
    {
        "DNA": "Dna"
    },
    {
        " in 1953, and the development of ": null
    },
    {
        "molecular biology": "Molecular Biology"
    },
    {
        " and ": null
    },
    {
        "biochemistry": "Biochemistry"
    },
    {
        ".               Several types of molecules are important in morphogenesis. ": null
    },
    {
        "Morphogens": "Morphogen"
    },
    {
        "are soluble molecules that can diffuse and carry signals that control cell differentiation via concentration gradients. Morphogens typically act through binding to specific protein ": null
    },
    {
        "receptor": "Receptor"
    },
    {
        "s. An important class of molecules involved in morphogenesis are ": null
    },
    {
        "transcription factor": "Transcription Factor"
    },
    {
        " proteins that determine the fate of cells by interacting with ": null
    },
    {
        "DNA": "Dna"
    },
    {
        ". These can be coded for by master regulatory ": null
    },
    {
        "gene": "Gene"
    },
    {
        "s, and either activate or deactivate the ": null
    },
    {
        "transcription": "Transcription"
    },
    {
        " of other genes; in turn, these secondary gene products can regulate the expression of still other genes in a regulatory cascade of ": null
    },
    {
        "gene regulatory network": "Gene Regulatory Network"
    },
    {
        "s. At the end of this cascade are classes of molecules that control cellular behaviors such as ": null
    },
    {
        "cell migration": "Cell Migration"
    },
    {
        ", or, more generally, their properties, such as ": null
    },
    {
        "cell adhesion": "Cell Adhesion"
    },
    {
        " or cell contractility. For example, during ": null
    },
    {
        "gastrulation": "Gastrulation"
    },
    {
        ", clumps of ": null
    },
    {
        "stem cells": "Stem Cell"
    },
    {
        "switch off their cell-to-cell adhesion, become migratory, and take up new positions within an embryo where they again activate specific cell adhesion proteins and form new tissues and organs. Developmental signaling pathways implicated in morphogenesis include Wnt, ": null
    },
    {
        "Hedgehog": "Hedgehog Signaling Pathway"
    },
    {
        ", and ephrins.               At a tissue level, ignoring the means of control, morphogenesis arises because of cellular proliferation and motility.  Morphogenesis also involves changes in the cellular structure or how cells interact in tissues. These changes can result in tissue elongation, thinning, folding, invasion or separation of one tissue into distinct layers. The latter case is often referred as ": null
    },
    {
        "cell sorting": "Cell Sorting"
    },
    {
        ". Cell sorting out consists of cells moving so as to sort into clusters that maximize contact between cells of the same type. The ability of cells to do this has been proposed to arise from differential cell adhesion by ": null
    },
    {
        "Malcolm Steinberg": "Malcolm Steinberg"
    },
    {
        " through his ": null
    },
    {
        "Differential Adhesion Hypothesis": "Differential Adhesion Hypothesis"
    },
    {
        ". Tissue separation can also occur via more dramatic ": null
    },
    {
        "cellular differentiation": "Cellular Differentiation"
    },
    {
        " events during which epithelial cells become mesenchymal . Mesenchymal cells typically leave the epithelial tissue as a consequence of changes in cell adhesive and contractile properties. Following epithelial-mesenchymal transition, cells can migrate away from an epithelium and then associate with other similar cells in a new location.        During embryonic development, cells are restricted to different layers due to differential affinities. One of the ways this can occur is when cells share the same cell-to-cell ": null
    },
    {
        "adhesion": "Adhesion"
    },
    {
        " molecules. For instance, homotypic cell adhesion can maintain boundaries between groups of cells that have different adhesion molecules. Furthermore, cells can sort based upon differences in adhesion between the cells, so even two populations of cells with different levels of the same adhesion molecule can sort out. In ": null
    },
    {
        "cell culture": "Cell Culture"
    },
    {
        " cells that have the strongest adhesion move to the center of a mixed aggregates of cells. Moreover, cell-cell adhesion is often modulated by cell contractility, which can exert forces on the cell-cell contacts so that two cell populations with equal levels of the same adhesion molecule can sort out. The molecules responsible for adhesion are called cell adhesion molecules . Several types of cell adhesion molecules are known and one major class of these molecules are ": null
    },
    {
        "cadherins": "Cadherins"
    },
    {
        ". There are dozens of different cadherins that are expressed on different cell types. Cadherins bind to other cadherins in a like-to-like manner: E-cadherin binds preferentially to other E-cadherin molecules. Mesenchymal cells usually express other cadherin types such as N-cadherin.         The ": null
    },
    {
        "extracellular matrix": "Extracellular Matrix"
    },
    {
        " is involved in keeping tissues separated, providing structural support or providing a structure for cells to migrate on. ": null
    },
    {
        "Collagen": "Collagen"
    },
    {
        ", ": null
    },
    {
        "laminin": "Laminin"
    },
    {
        ", and ": null
    },
    {
        "fibronectin": "Fibronectin"
    },
    {
        " are major ECM molecules that are secreted and assembled into sheets, fibers, and gels. Multisubunit transmembrane receptors called ": null
    },
    {
        "integrins": "Integrin"
    },
    {
        "are used to bind to the ECM. Integrins bind extracellularly to fibronectin, laminin, or other ECM components, and intracellularly to ": null
    },
    {
        "microfilament": "Microfilament"
    },
    {
        "-binding proteins ": null
    },
    {
        "α-actinin": "Actn1"
    },
    {
        " and ": null
    },
    {
        "talin": "Talin"
    },
    {
        " to link the ": null
    },
    {
        "cytoskeleton": "Cytoskeleton"
    },
    {
        " with the outside. Integrins also serve as receptors to trigger ": null
    },
    {
        "signal transduction": "Signal Transduction"
    },
    {
        " cascades when binding to the ECM. A well-studied example of morphogenesis that involves ECM is ": null
    },
    {
        "mammary gland": "Mammary Gland"
    },
    {
        " ductal branching.         Tissues can change their shape and separate into distinct layers via cell contractility. Just as in muscle cells, ": null
    },
    {
        "myosin": "Myosin"
    },
    {
        " can contract different parts of the cytoplasm to change its shape or structure. Myosin-driven contractility in embryonic tissue morphogenesis is seen during the separation of ": null
    },
    {
        "germ layers": "Germ Layers"
    },
    {
        " in the ": null
    },
    {
        "model organisms": "Model Organism"
    },
    {
        "  Caenorhabditis elegans ,  Drosophila  and ": null
    },
    {
        "zebrafish": "Zebrafish"
    },
    {
        ". There are often periodic pulses of contraction in embryonic morphogenesis. A model called the cell state splitter involves alternating cell contraction and expansion, initiated by a bistable organelle at the apical end of each cell. The organelle consists of ": null
    },
    {
        "microtubules": "Microtubules"
    },
    {
        " and ": null
    },
    {
        "microfilaments": "Microfilaments"
    },
    {
        " in mechanical opposition. It responds to local mechanical perturbations caused by morphogenetic movements. These then trigger traveling ": null
    },
    {
        "embryonic differentiation waves": "Embryonic Differentiation Waves"
    },
    {
        " of contraction or expansion over presumptive tissues that determine cell type and is followed by cell differentiation. The cell state splitter was first proposed to explain ": null
    },
    {
        "neural plate": "Neural Plate"
    },
    {
        " morphogenesis during ": null
    },
    {
        "gastrulation": "Gastrulation"
    },
    {
        " of the ": null
    },
    {
        "axolotl": "Axolotl"
    },
    {
        "  and the model was later generalized to all of morphogenesis.         ": null
    },
    {
        "Cancer": "Cancer"
    },
    {
        " can result from disruption of normal morphogenesis, including both tumor formation and tumor ": null
    },
    {
        "metastasis": "Metastasis"
    },
    {
        ".  ": null
    },
    {
        "Mitochondrial": "Mitochondrion"
    }
]