[
    {
        "         MOS Technology, Inc. , later known as CSG , was a ": null
    },
    {
        "semiconductor": "integrated circuit"
    },
    {
        " design and ": null
    },
    {
        "fabrication": "semiconductor device fabrication"
    },
    {
        " company based in ": null
    },
    {
        "Norristown, Pennsylvania": "norristown, pennsylvania"
    },
    {
        ", in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ". It is most famous for its ": null
    },
    {
        "6502": "mos technology 6502"
    },
    {
        " microprocessor": "microprocessor"
    },
    {
        " and various designs for ": null
    },
    {
        "Commodore Internationals": "commodore international"
    },
    {
        "range of ": null
    },
    {
        "home computer": "home computer"
    },
    {
        "s.          MOS Technology, Inc. was originally started in 1969 by ": null
    },
    {
        "Allen-Bradley": "allen-bradley"
    },
    {
        " to provide a second source for electronic calculators and their chips designed by ": null
    },
    {
        "Texas Instruments": "texas instruments"
    },
    {
        " . In the early 1970s TI decided to release their own line of calculators, instead of selling just the chips inside them, and introduced them at a price that was lower than the price of the chipset alone. Many early chip companies were wiped out in the aftermath; those that survived did so by finding other chips to produce. MOS became a supplier to ": null
    },
    {
        "Atari": "atari"
    },
    {
        ", producing a custom single-chip  Pong  system.     Things changed dramatically in 1975. Several of the designers of the ": null
    },
    {
        "Motorola 6800": "motorola 6800"
    },
    {
        " left Motorola shortly after its release, after management told them to stop working on a low-cost version of the design. At the time there was no such thing as a ": null
    },
    {
        "pure-play semiconductor foundry": "pure-play semiconductor foundry"
    },
    {
        ", so they had to join a chip-building company to produce their new CPU. MOS was a small firm with good credentials in the right area, the east coast of the USA. The team of four design engineers was headed by ": null
    },
    {
        "Chuck Peddle": "chuck peddle"
    },
    {
        " and included ": null
    },
    {
        "Bill Mensch": "bill mensch"
    },
    {
        ". At MOS they set about building a new ": null
    },
    {
        "CPU": "central processing unit"
    },
    {
        " that would outperform the 6800 while being similar to it in purpose. The resulting ": null
    },
    {
        "6501": "mos technology 6501"
    },
    {
        " design was somewhat similar to the 6800, but by using several simplifications in the design, the 6501 would be up to 4 times faster.       In addition to a good design, MOS had a secret weapon: the ability to fix its masks.  Masks are the large drawings of the chip that are photo-reduced to make the pattern from which chips are made & mdash;a process similar to ": null
    },
    {
        "photocopy": "photocopy"
    },
    {
        "ing. All masks end up with flaws, both as a result of design problems in the chip itself, as well as side effects from the photo-reduction process. When a chip is made with this mask there is a chance that some of these flaws will end up expressed on the chip. If too many of them are expressed, that particular chip will not work.     If a chip design with five design flaws results in a mask with ten flaws in total, there is no point in making another mask because it will have the same five design flaws plus some other set of five copying flaws. So companies simply built chips with known-bad masks, and threw away broken chips. In the 1970s, this meant throwing away 70 percent or more of the completed chips. The price of a chip is largely defined by the yield, the measure of how many work for a given number produced, so improving this number can lower the price and raise the ": null
    },
    {
        "gross profit": "gross profit"
    },
    {
        " dramatically.     MOSs engineers had learned the trick of fixing their masks after they were made. This allowed them to correct the major flaws in a series of small fixes, eventually producing a mask with a very low flaw rate. The companys production lines typically reversed the numbers others were achieving; even the early runs of a new CPU design & mdash;what would become the 6502 & mdash;were achieving a success rate of 70 percent or better. This meant that not only were its designs faster, they cost much less as well.            When the 6501 was announced, Motorola launched a lawsuit almost immediately. Although the 6501 ": null
    },
    {
        "instruction set": "instruction set"
    },
    {
        " was not compatible with the 6800, it could nevertheless be plugged into existing ": null
    },
    {
        "motherboard": "motherboard"
    },
    {
        " designs because it had the same functional pin arrangement and ": null
    },
    {
        "IC package": "ic package"
    },
    {
        " footprint. That was enough to allow Motorola to sue. Sales of the 6501 basically stopped, and the lawsuit would drag on for many years before MOS was eventually forced to pay $200,000 ": null
    },
    {
        "USD": "united states dollar"
    },
    {
        " in fines.     In the meantime MOS had started selling the ": null
    },
    {
        "6502": "mos technology 6502"
    },
    {
        ", a chip capable of operating at 1  MHz in September 1975 for a mere $25 USD. It was nearly identical to the 6501, with only a few minor differences: an added on-chip clock oscillator, a different functional pinout arrangement, generation of the SYNC signal , and removal of data bus enablement control signals . MOS MCS6500 Microcomputer Family Hardware Manual , January 1976, p. 41. It outperformed the more-complex 6800 and ": null
    },
    {
        "Intel 8080": "intel 8080"
    },
    {
        ", but cost much less and was easier to work with. Although it did not have the 6501s advantage of being able to be used in place of the Motorola 6800 in existing hardware, it was so inexpensive that it quickly became more popular than the 6800, making that a moot point.          The 6502 was so cheap that many people believed it was a scam when MOS first showed see: ": null
    },
    {
        "Introducing the 6501 and 6502": "mos technology 6502introducing the 6501 and 6502"
    },
    {
        " it at a 1975 trade show. They were not aware of MOSs masking techniques and when they calculated the price per chip at the current industry yield rates, it did not add up. But any hesitation to buy it evaporated when both Motorola and Intel dropped the prices on their own designs from $179 to $69 at the same show in order to compete. Their moves legitimized the 6502, and by the shows end, the wooden barrel full of samples was empty.     The 6502 would quickly go on to be one of the most popular chips of its day. A number of companies licensed the 650x line from MOS, including ": null
    },
    {
        "Rockwell International": "rockwell international"
    },
    {
        ", ": null
    },
    {
        "GTE": "general telephone and electronics"
    },
    {
        ", ": null
    },
    {
        "Synertek": "synertek"
    },
    {
        ", and ": null
    },
    {
        "Western Design Center ": "western design center"
    },
    {
        ".     A number of different versions of the basic CPU, known as the 6503 through 6507, were offered in 28-pin packages for lower cost. The various models removed signal or address pins. Far and away the most popular of these was the ": null
    },
    {
        "6507": "mos technology 6507"
    },
    {
        ", which was used in the ": null
    },
    {
        "Atari 2600": "atari 2600"
    },
    {
        " and Atari disk drives. The 6504 was sometimes used in printers. MOS also released a series of similar CPUs using external clocks, which added a 1 to the name in the third digit, as the 6512 through 6515. These were useful in systems where the clock support was already being provided on the motherboard by some other source. The final addition was the crossover ": null
    },
    {
        "6510": "mos technology 6510"
    },
    {
        ", used in the ": null
    },
    {
        "Commodore 64": "commodore 64"
    },
    {
        ", with additional I/O ports.       However successful the 6502 was, the company itself was having problems. At about the same time the 6502 was being released, MOSs entire calculator ": null
    },
    {
        "IC": "integrated circuit"
    },
    {
        " market collapsed, and its prior existing products stopped shipping. Soon they were in serious financial trouble. Another company, ": null
    },
    {
        "Commodore Business Machines": "commodore international"
    },
    {
        " , had invested heavily in the calculator market and was also nearly wiped out by ": null
    },
    {
        "TIs": "texas instruments"
    },
    {
        "entry into the market. A fresh injection of capital saved CBM, and allowed it to invest in company suppliers in order to help ensure their ": null
    },
    {
        "IC": "integrated circuit"
    },
    {
        " supply would not be upset in this fashion again. Among the several companies were ": null
    },
    {
        "LED": "light-emitting diode"
    },
    {
        " display manufacturers, power controllers, and suppliers of the driver chips, including MOS.     In late 1976, CBM, quoted at 60 million USD on the ": null
    },
    {
        "NYSE": "new york stock exchange"
    },
    {
        ", purchased MOS, valued at around 12 million USD, in exchange for a 9.4 percent equity stake in CBM  in an outright buy  & pgPA541, Calculator Maker Integrates Downwards, New Scientist, 9 September 1976, Volume 71, Issue 1017, page 541 Commodore Buys MOS Technology , New Scientist, September 1976 on the condition that Chuck Peddle would join Commodore as chief engineer. The deal went through, and while the firm basically became Commodores production arm, they continued using the name MOS for some time so that manuals would not have to be reprinted. After a while MOS became the Commodore Semiconductor Group . Despite being renamed to CSG, all chips produced were still stamped with the old MOS logo until 1989.     MOS had previously designed a simple computer kit called the ": null
    },
    {
        "KIM-1": "kim-1"
    },
    {
        ", primarily to show off the 6502 chip. At Commodore, Peddle convinced the owner, ": null
    },
    {
        "Jack Tramiel": "jack tramiel"
    },
    {
        ", that calculators were a dead end, and that home computers would soon be huge.     However, the original design group appeared to be even less interested in working for Jack Tramiel than it had for Motorola, and the team quickly started breaking up. One result was that the newly completed ": null
    },
    {
        "6522 ": "mos technology 6522"
    },
    {
        " chip was left undocumented for years.     ": null
    },
    {
        "Bill Mensch": "bill mensch"
    },
    {
        " left MOS even before the Commodore takeover, and moved home to ": null
    },
    {
        "Mesa, AZ": "mesa, arizona"
    },
    {
        " from MOSs ": null
    },
    {
        "Norristown, PA": "norristown, pennsylvania"
    },
    {
        ". After a short stint consulting for a local company called ICE, he set up the ": null
    },
    {
        "Western Design Center ": "western design center"
    },
    {
        " in 1978. As a licensee of the 6502 line, their first products were bug-fixed, power-efficient ": null
    },
    {
        "CMOS": "cmos"
    },
    {
        " versions of the 6502 . But then they expanded the line greatly with the introduction of the ": null
    },
    {
        "65816": "65816 microprocessor"
    },
    {
        ", a fairly straightforward ": null
    },
    {
        "16-bit": "16-bit"
    },
    {
        " upgrade of the original 65C02 that could also run in ": null
    },
    {
        "8-bit": "8-bit"
    },
    {
        " mode for compatibility. Since then WDC moved much of the original MOS catalog to CMOS, and the 6502 continued to be a popular CPU for the ": null
    },
    {
        "embedded systems": "embedded system"
    },
    {
        "market, like medical equipment and car dashboard controllers.       After Commodores ": null
    },
    {
        "bankruptcy": "bankruptcy"
    },
    {
        " in 1994, Commodore Semiconductor Group, MOSs successor, was bought by its former management for about $4.3 million, plus an additional $1 million to cover miscellaneous expenses including ": null
    },
    {
        "EPA": "united states environmental protection agency"
    },
    {
        " license. Dennis Peasenell became CEO. In December 1994, they entered into a Prospective Purchase Agreement with GMT Microelectronics.     In 1994, the company, operating under the name GMT Microelectronics , reopened MOS Technologies original, circa-1970 one-": null
    },
    {
        "micrometre": "micrometre"
    },
    {
        " fab": "fab"
    },
    {
        " in Norristown, Montgomery County, Pennsylvania that Commodore had closed in 1993.    GMT would have provided foundry services based on TelComs Bipolar and SiCr Thin Film Resistor processes and would have been licensed alternate sources for TelComs Bipolar based products.,  with production running at 10 thousand 5-inch ": null
    },
    {
        "wafers": "wafer"
    },
    {
        " per month, producing ": null
    },
    {
        "CMOS": "cmos"
    },
    {
        ", BiCMOS, NMOS, bipolar and ": null
    },
    {
        "SOI": "silicon on insulator"
    },
    {
        " devices.     The plant had been on the EPAs National Priorities List of ": null
    },
    {
        "hazardous waste": "hazardous waste"
    },
    {
        " sites since October 4, 1989.  This was due to a 1974 leak of ": null
    },
    {
        "TCE": "trichloroethylene"
    },
    {
        " from an underground 250-gallon concrete storage tank used by ": null
    },
    {
        "Commodore Business Machines": "commodore international"
    },
    {
        " in the semiconductor cleaning process. Leaks from tank had caused the local groundwater to become contaminated with ": null
    },
    {
        "trichloroethylene": "trichloroethylene"
    },
    {
        " and other ": null
    },
    {
        "volatile organic compounds": "volatile organic compounds"
    },
    {
        " in 1978. By 1999 GMT Microelectronics had $21 million in revenues and 183 employees working on the site. In 2000, GMT Microelectronics discontinued operations and abandoned all of its assets at the Commodore Semiconductor Group superfund site.        Most of the MOS chips are named according to following rules, which shows used technology :    ": null
    },
    {
        "NMOS": "nmos logic"
    },
    {
        "   CMOS": "cmos"
    },
    {
        "   HMOS": "hmos"
    },
    {
        "   HMOS-2": "hmos"
    },
    {
        "        KIM-1": "kim-1"
    },
    {
        " & ndash; single board computer /CPU evaluation board, based on 6502   ": null
    },
    {
        "4510": "mos technology 4510"
    },
    {
        " & ndash; CPU  with two CIAs on-chip; 3.45  MHz   ": null
    },
    {
        "5719": "amiga custom chipsgary"
    },
    {
        " & ndash; Gary Gate Array   2523 & ndash; 8-digit calculator chip     2529 & ndash; Single chip scientific calculator array    ": null
    },
    {
        "6501": "mos technology 6501"
    },
    {
        " & ndash; CPU pin-compatible with Motorola 6800   ": null
    },
    {
        "6502": "mos technology 6502"
    },
    {
        " & ndash; CPU equal to 6501 except no 6800-pin-compatibility   ": null
    },
    {
        "65CE02": "mos technology 65ce02"
    },
    {
        " & ndash; CPU derived from the 6502   ": null
    },
    {
        "6503": "mos technology 6503"
    },
    {
        " & ndash; CPU with 12 address pins, NMI pin and IRQ pin   ": null
    },
    {
        "6504": "mos technology 6504"
    },
    {
        " & ndash; CPU with 13 address pins and IRQ pin   ": null
    },
    {
        "6505": "mos technology 6505"
    },
    {
        " & ndash; CPU with 12 address pins, IRQ pin and RDY pin.   ": null
    },
    {
        "6507": "mos technology 6507"
    },
    {
        " & ndash; CPU with 13 address pins   ": null
    },
    {
        "6508": "mos technology 6508"
    },
    {
        " & ndash; CPU with 256 B RAM and 8 I/O pins   ": null
    },
    {
        "6509": "mos technology 6509"
    },
    {
        " & ndash; CPU with 20 address pins   ": null
    },
    {
        "6510": "mos technology 6510"
    },
    {
        " & ndash; CPU with clock pins and I/O ports,   ": null
    },
    {
        "6520": "mos technology 6520"
    },
    {
        " & ndash; PIA Peripheral Interface Adapter   ": null
    },
    {
        "6522": "mos technology 6522"
    },
    {
        " & ndash; VIA Versatile Interface Adapter   6523/6525 & ndash; ": null
    },
    {
        "TPI": "mos technology tpi"
    },
    {
        " Tri-Port Interface   6526/8520/8521 & ndash; ": null
    },
    {
        "CIA": "mos technology cia"
    },
    {
        " Complex Interface Adapter   6529 & ndash; ": null
    },
    {
        "SPI": "mos technology spi"
    },
    {
        "/SPIA Single Port Interface Adapter   6530 & ndash; ": null
    },
    {
        "RRIOT": "mos technology rriot"
    },
    {
        " ROM-RAM-I/O Timer   ": null
    },
    {
        "6532": "mos technology 6532"
    },
    {
        " & ndash; RIOT RAM-I/O Timer   ": null
    },
    {
        "6540": "mos technology 6540"
    },
    {
        " & ndash; 2 KiB ROM   ": null
    },
    {
        "6545": "mos technology 6545"
    },
    {
        " & ndash; CRTC CRT Controller   ": null
    },
    {
        "6551": "mos technology 6551"
    },
    {
        " & ndash; ACIA Asynchronous Communications Interface Adapter   ": null
    },
    {
        "6560": "mos technology vic"
    },
    {
        " & ndash; VIC Video Interface Chip,    ": null
    },
    {
        "6561": "mos technology vic"
    },
    {
        " & ndash; VIC Video Interface Chip,  Revision: -101 / E   ": null
    },
    {
        "6562": "mos technology vic"
    },
    {
        " & ndash; VIC Video Interface Chip,    ": null
    },
    {
        "6564": "mos technology 6564"
    },
    {
        " & ndash; 80-column video   ": null
    },
    {
        "6566": "mos technology vic-ii"
    },
    {
        " & ndash; VIC-II   ": null
    },
    {
        "6567": "mos technology vic-ii"
    },
    {
        " & ndash; VIC-II Revision: R56A/R7/R8/R9   ": null
    },
    {
        "6569": "mos technology vic-ii"
    },
    {
        " & ndash; VIC-II Revision: R1/R3/R4/R5   ": null
    },
    {
        "6570": "mos technology 6570"
    },
    {
        " & ndash; 6500/1 microcontroller on keyboard PCB in Amiga 500 revision: -036   ": null
    },
    {
        "6572": "mos technology vic-ii"
    },
    {
        " & ndash; VIC-II   ": null
    },
    {
        "6573": "mos technology vic-ii"
    },
    {
        " & ndash; VIC-II   6581/6582/8580 & ndash; ": null
    },
    {
        "SID": "mos technology sid"
    },
    {
        " Sound Interface Device   ": null
    },
    {
        "7360/8360": "mos technology ted"
    },
    {
        " & ndash; ": null
    },
    {
        "TED": "mos technology ted"
    },
    {
        " Text Editing Device   ": null
    },
    {
        "7501": "mos technology 7501"
    },
    {
        " & ndash; CPU HMOS-I 6502 with 7-bit I/O port   ": null
    },
    {
        "8361": "mos technology agnus"
    },
    {
        " & ndash; AGNUS Address Generator Unit    ": null
    },
    {
        "8362": "original chip setdenise"
    },
    {
        " & ndash; DENISE Display Encoder   ": null
    },
    {
        "8364": "original chip setpaula"
    },
    {
        " & ndash; PAULA Port Audio UART and Logic   ": null
    },
    {
        "8367": "mos technology agnus"
    },
    {
        " & ndash; AGNUS Address Generator Unit    ": null
    },
    {
        "8370": "mos technology agnus"
    },
    {
        " & ndash; Fat AGNUS Address Generator Unit   ": null
    },
    {
        "8371": "mos technology agnus"
    },
    {
        " & ndash; Fat AGNUS Address Generator Unit   ": null
    },
    {
        "8372": "mos technology agnus"
    },
    {
        " & ndash; ": null
    },
    {
        "ECS": "enhanced chip set"
    },
    {
        " AGNUS Address Generator Unit   ": null
    },
    {
        "8373": "original chip setdenise"
    },
    {
        " & ndash; ": null
    },
    {
        "ECS": "enhanced chip set"
    },
    {
        " DENISE Display Encoder   ": null
    },
    {
        "8374": "mos technology 8374"
    },
    {
        " & ndash; ": null
    },
    {
        "AGA": "advanced graphics architecture"
    },
    {
        " ALICE Address Generator Unit   ": null
    },
    {
        "8375": "mos technology agnus"
    },
    {
        " & ndash; ": null
    },
    {
        "ECS": "enhanced chip set"
    },
    {
        " AGNUS Address Generator Unit   ": null
    },
    {
        "8500": "mos technology 8500"
    },
    {
        " & ndash; CPU HMOS-II Version of 6510   ": null
    },
    {
        "8501": "mos technology 8501"
    },
    {
        " & ndash; CPU HMOS-II 6502 with 7-bit I/O port   ": null
    },
    {
        "8502": "mos technology 8502"
    },
    {
        " & ndash; CPU compatible with 6510 but able to run at 2  MHz   ": null
    },
    {
        "8520": "mos technology cia"
    },
    {
        " & ndash; CIA 1  MHz 8520 or 2  MHz 8520A-1 in Amiga   ": null
    },
    {
        "8551": "mos technology 8551"
    },
    {
        " & ndash; ACIA Asynchronous Communications Interface Adapter, HMOS-II variant of the 6551   ": null
    },
    {
        "8562": "mos technology vic-ii"
    },
    {
        " & ndash; VIC-II   ": null
    },
    {
        "8563": "mos technology 8563"
    },
    {
        " & ndash; VDC Video Display Controller   ": null
    },
    {
        "8564": "mos technology vic-ii"
    },
    {
        " & ndash; VIC-II   ": null
    },
    {
        "8565": "mos technology vic-ii"
    },
    {
        " & ndash; VIC-II   ": null
    },
    {
        "8566": "mos technology vic-ii"
    },
    {
        " & ndash; VIC-II   ": null
    },
    {
        "8568": "mos technology 8568"
    },
    {
        " & ndash; VDC with composite HSYNC, VSYNC, and RDY interrupt   ": null
    },
    {
        "8701": "mos technology 8701"
    },
    {
        " & ndash; clock generator   ": null
    },
    {
        "8721": "mos technology 8721"
    },
    {
        " & ndash; PLA   ": null
    },
    {
        "8722": "mos technology 8722"
    },
    {
        " & ndash; MMU Memory Management Unit   ": null
    },
    {
        "8726": "mos technology 8726"
    },
    {
        " & ndash; REC RAM Expansion Controller   ": null
    },
    {
        "8727": "amiga custom chips8727 dma"
    },
    {
        " & ndash; DMA Direct Memory Access   ": null
    }
]