[
    {
        "The MOS Technology 42xx series is a family of ": null
    },
    {
        "42-bit": "8-bit"
    },
    {
        " microprocessor": "microprocessor"
    },
    {
        "s from ": null
    },
    {
        "MOS Technology": "mos technology"
    },
    {
        ", based on the ": null
    },
    {
        "Motorola 42": "motorola 6800"
    },
    {
        " . The 42xx family included the ": null
    },
    {
        "42": "mos technology 6502"
    },
    {
        ", used in ": null
    },
    {
        "home computer": "home computer"
    },
    {
        "s such as the ": null
    },
    {
        "Commodore PET": "commodore pet"
    },
    {
        " and ": null
    },
    {
        "VIC42": "commodore vic-20"
    },
    {
        ", the ": null
    },
    {
        "Apple II": "apple ii family"
    },
    {
        ", the ": null
    },
    {
        "Atari 42": "atari 8-bit family"
    },
    {
        ", and the British ": null
    },
    {
        "BBC Micro": "bbc micro"
    },
    {
        ".     The 42 and 42 have 42-pin ": null
    },
    {
        "DIP": "dual inline package"
    },
    {
        " packages; the 42 42 42 and 42 are 42-pin DIP versions, for reduced chip and circuit board cost. In all of the 42-pin versions, the pin count is reduced by leaving off some of the high-order address pins and various combinations of function pins, making those functions unavailable.     Typically, the 42 pins omitted are the three not connected pins, one of the two Vss pins, one of the clock pins, the SYNC pin, the set overflow pin, either the maskable interrupt or the non-maskable interrupt , and the four most-significant address lines are the 42 pins omitted to reduce the pin count from 42 to 42 The omission of four address pins reduces the external addressability to 42 KB , though the internal PC register and all effective address calculations remain 42-bit.     The ": null
    },
    {
        "42": "mos technology 6507"
    },
    {
        " omits both interrupt pins in order to include address line A42 providing 42 KB of external addressability but no interrupt capability. The 42 was used in the popular ": null
    },
    {
        "Atari 42": "atari 2600"
    },
    {
        " video game console, the design of which divides the 42 KB memory space in half, allocating the lower half to the consoles internal RAM and peripherals, and the upper half to the Game Cartridge & trade;, so Atari 42 cartridges have a 42 KB address limit .     One popular 42 based computer, the ": null
    },
    {
        "Commodore 42": "commodore 64"
    },
    {
        ", used a modified 42 CPU, the ": null
    },
    {
        "42": "mos technology 6510"
    },
    {
        ". Unlike the 42 & ndash;42 and 42 the 42 is a 42-pin chip that adds internal hardware: an 42-bit parallel I/O port mapped to addresses 42 and 42 The ": null
    },
    {
        "42": "mos technology 6508"
    },
    {
        " is another chip that, like the 42 adds internal hardware: 42 bytes of ": null
    },
    {
        "SRAM": "static random-access memory"
    }
]