[
    {
        "   The Motorola 68020  is a ": null
    },
    {
        "32-bit": "32-bit"
    },
    {
        " microprocessor": "microprocessor"
    },
    {
        " from ": null
    },
    {
        "Motorola": "motorola"
    },
    {
        ", released in 1984. It is the successor to the ": null
    },
    {
        "Motorola 68010": "motorola 68010"
    },
    {
        " and is succeeded by the ": null
    },
    {
        "Motorola 68030": "motorola 68030"
    },
    {
        ". A lower cost version was also made available, known as the 68EC020. In keeping with naming practices common to Motorola designs, the 68020 is usually referred to as the 020 , pronounced oh-two-oh or oh-twenty .          The 68020 had 32-bit internal and external data and address buses, compared to the early 680x0 models with 16-bit data and 24-bit address buses. The 68020s ": null
    },
    {
        "ALU": "arithmetic logic unit"
    },
    {
        " was also natively 32-bit, so could perform 32-bit operations in one clock, whereas the 68000 took two clocks minimum due to its 16-bit ALU. Newer packaging methods allowed the 020 to feature more external pins without the large size that the earlier ": null
    },
    {
        "dual in-line package": "dual in-line package"
    },
    {
        " method required. The 68EC020 lowered cost through a 24-bit address bus. The 68020 was produced at speeds ranging from 12  MHz to 33  MHz.          The 68020 added many improvements over the 68010 including a 32-bit ": null
    },
    {
        "arithmetic logic unit": "arithmetic logic unit"
    },
    {
        " , 32-bit external data and address buses, extra instructions and additional addressing modes. The 68020 had a proper three-stage pipeline. Though the 68010 had a loop mode , which sped loops through what was effectively a tiny instruction cache, it held only two short instructions and was thus little used. The 68020 replaced this with a proper instruction cache of 256 bytes, the first 68k series processor to feature true on-chip cache memory.     The previous 68000 and 68010 processors could only access word and long word data in memory if it were word-aligned . The 68020 had no alignment restrictions on data access. Naturally, unaligned accesses were slower than aligned accesses because they required an extra memory access.       The 68020 has a coprocessor interface supporting up to eight coprocessors. The main ": null
    },
    {
        "CPU": "central processing unit"
    },
    {
        " recognizes F-line instructions , and uses special bus cycles to interact with a coprocessor to execute these instructions. Two types of coprocessors were defined: floating point units  and the paged memory management unit . Only one PMMU can be used with a CPU. In principle, multiple FPUs could be used with a CPU, but it was not commonly done. The coprocessor interface is asynchronous, so it is possible to run the coprocessors at a different clock rate than the CPU.       Multiprocessing support was implemented externally by the use of a RMC pin  to indicate an indivisible ": null
    },
    {
        "read-modify-write": "read-modify-write"
    },
    {
        " cycle in progress. All other processors had to hold off memory accesses until the cycle was complete.  Software support for multiprocessing included the ": null
    },
    {
        "TAS": "test-and-set"
    },
    {
        ", ": null
    },
    {
        "CAS": "compare-and-swap"
    },
    {
        " and ": null
    },
    {
        "CAS2": "double compare-and-swap"
    },
    {
        " instructions.     In a multiprocessor system, coprocessors could not be shared between CPUs. To avoid problems with returns from coprocessor, bus error, and address error exceptions, it was generally necessary in a multiprocessor system for all CPUs to be the same model, and for all FPUs to be the same model as well.       The new instructions included some minor improvements and extensions to the supervisor state, several instructions for software management of a multiprocessing system , some support for high-level languages which did not get used much , bigger multiply and divide instructions, and bit field manipulations.     While the 68000 had supervisor mode, it did not meet the ": null
    },
    {
        "Popek and Goldberg virtualization requirements": "popek and goldberg virtualization requirements"
    },
    {
        " due to the single instruction MOVE from SR being unprivileged but sensitive. Under the 68010 and later, this was made privileged, to better support virtualization software.       The new addressing modes added ": null
    },
    {
        "scaled indexing": "addressing modescaled"
    },
    {
        " and another level of ": null
    },
    {
        "indirection": "addressing modememory indirect"
    },
    {
        " to many of the pre-existing modes, and added quite a bit of flexibility to various indexing modes and operations. Though it was not intended, these new modes made the 68020 very suitable for page printing; most laser printers in the early 1990s had a 68EC020 at their core.     The 68020 had a small 256-byte direct-mapped instruction cache, arranged as 64 four-byte entries. Although small, it still made a significant difference in the performance of many applications. The resulting decrease in bus traffic was particularly important in systems relying heavily on ": null
    },
    {
        "DMA": "direct memory access"
    },
    {
        ".            The 68020 was used in the ": null
    },
    {
        "Apple": "apple computer"
    },
    {
        " Macintosh II": "macintosh ii"
    },
    {
        " and ": null
    },
    {
        "Macintosh LC": "macintosh lc"
    },
    {
        " personal computer": "personal computer"
    },
    {
        "s, ": null
    },
    {
        "Sun 3": "sun 3"
    },
    {
        " workstations, ": null
    },
    {
        "Commodore": "commodore international"
    },
    {
        " Amiga 1200": "amiga 1200"
    },
    {
        ", the ": null
    },
    {
        "Hewlett-Packard": "hewlett-packard"
    },
    {
        " 8711 Series Network Analyzers and later members of the ": null
    },
    {
        "HP 9000": "hp 9000"
    },
    {
        "/300 family and the ": null
    },
    {
        "Alpha Microsystems": "alpha microsystems"
    },
    {
        " AM-2000. Also the 68020 was an alternative upgrade to the ": null
    },
    {
        "Sinclair QL": "sinclair ql"
    },
    {
        " computers ": null
    },
    {
        "68008": "motorola 68008"
    },
    {
        " in the Super Gold Card interface by ": null
    },
    {
        "Miracle Systems": "miracle systems"
    },
    {
        ".     The Amiga 2500 and A2500UX was shipped with the A2620 Accelerator using a 68020, a 68881 floating point unit and the 68851 Memory Management Unit. The 2500UX shipped with Amiga Unix, requiring an 020 or 030 processor.     A number of ": null
    },
    {
        "digital oscilloscopes": "digital storage oscilloscope"
    },
    {
        " from the mid-80s to the late-90s used the 68020, including the ": null
    },
    {
        "LeCroy": "lecroy corporation"
    },
    {
        " 9300 Series LeCroy 1996 Test & Measurement Product Catalog, 9300 Series Upgrade Path, p. 66  and the earlier LeCroy 9400 series , along with certain ": null
    },
    {
        "Tektronix": "tektronix"
    },
    {
        " TDS Series models. Tektronix TDS684A, TDS744A, & TDS784A Digitizing Oscilloscope Service Manual, 070-8992-03, January 1995 . The HP 54520, 54522, 54540 and 54542 also use the 68020, together with a 68882 math coprocessor. Hewlett Packard 54520 and 54540 Series Oscilloscope Service Guide , Chapter 8, Main Assembly Theory, April 1994     It is also the processor used on board ": null
    },
    {
        "TGV": "tgv"
    },
    {
        " trains to decode signalling information which is sent to the trains through the rails. It is further being used in the flight control and radar systems of the ": null
    },
    {
        "Eurofighter Typhoon": "eurofighter typhoon"
    },
    {
        " combat aircraft.     The Nortel Networks ": null
    },
    {
        "DMS-100": "dms-100"
    },
    {
        " telephone central office switch also used the 68020 as the first ": null
    },
    {
        "microprocessor": "microprocessor"
    },
    {
        " of the SuperNode computing core.     For more information on the instructions and architecture see ": null
    },
    {
        "Motorola 68000": "motorola 68000"
    },
    {
        ".          The 68EC020 is a lower cost version of the Motorola 68020. The main difference between the two is that the 68EC020 only has a 24-bit address bus, rather than the 32-bit address bus of the full 68020, and thus is only able to address 16  MB of memory.     The ": null
    },
    {
        "Commodore": "commodore international"
    },
    {
        " Amiga 1200": "amiga 1200"
    },
    {
        " computer and the ": null
    },
    {
        "Amiga CD32": "amiga cd32"
    },
    {
        " games console used the cost-reduced 68EC020; the ": null
    },
    {
        "Namco System 22": "namco system 22"
    },
    {
        " and ": null
    },
    {
        "Taito F3": "taito f3 system"
    },
    {
        " arcade boards also used this processor. The ": null
    },
    {
        "Atari": "atari"
    },
    {
        " Jaguar II prototype also featured this to replace the 68000 of the original ": null
    },
    {
        "Atari Jaguar": "atari jaguar"
    },
    {
        " console. It also found use in laser printers. Apple used it in the LaserWriter IIɴᴛx. Kodak used it in the Ektaplus 7016PS, and Dataproducts used it in the LZR 1260.     In 2014, ": null
    },
    {
        "Rochester Electronics": "rochester electronics"
    },
    {
        " has re-established manufacturing capability for the 68020 microprocessor and it is still available today.              ": null
    }
]