[
    {
        "        Mozzarella  is a traditionally ": null
    },
    {
        "southern Italian": "Southern Italy"
    },
    {
        " cheese": "Cheese"
    },
    {
        " made from ": null
    },
    {
        "Italian buffalos": "Italian Mediterranean Buffalo"
    },
    {
        "milk by the ": null
    },
    {
        "pasta filata": "Pasta Filata"
    },
    {
        " method. Mozzarella received a ": null
    },
    {
        "Traditional Specialities Guaranteed": "Traditional Speciality Guaranteed"
    },
    {
        " certification from the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " in 1998. This protection scheme requires that mozzarella sold in the European Union is produced according to a traditional recipe.     The TSG certification does not specify the source of the milk, so any type of milk can be used, but it is speculated that it is normally made from ": null
    },
    {
        "whole milk": "Whole Milk"
    },
    {
        ". In Italy, mozzarella made from the milk of the ": null
    },
    {
        "Italian water buffalo": "Italian Water Buffalo"
    },
    {
        " is an important variety; the Italian  buffalo mozzarella  sold as Mozzarella di Bufala Campana is protected under the EUs ": null
    },
    {
        "Protected Designation of Origin": "Protected Designation Of Origin"
    },
    {
        " scheme and may only be produced in select locations in the regions of ": null
    },
    {
        "Campania": "Campania"
    },
    {
        ", ": null
    },
    {
        "Lazio": "Lazio"
    },
    {
        ", ": null
    },
    {
        "Apulia": "Apulia"
    },
    {
        " and ": null
    },
    {
        "Molise": "Molise"
    },
    {
        ".     Fresh mozzarella is generally white but may vary seasonally to slightly yellow depending on the animals diet.  Due to its high moisture content, it is traditionally served the day after it is made  but can be kept in ": null
    },
    {
        "brine": "Brine"
    },
    {
        " for up to a week  or longer when sold in ": null
    },
    {
        "vacuum-sealed packages": "Vacuum Packing"
    },
    {
        ". Low-moisture mozzarella can be kept refrigerated for up to a month,  though some shredded low-moisture mozzarella is sold with a shelf life of up to six months.  Mozzarella of several kinds is used for most types of ": null
    },
    {
        "pizza": "Pizza"
    },
    {
        " and several ": null
    },
    {
        "pasta dishes": "Pasta Dish"
    },
    {
        " or served with sliced ": null
    },
    {
        "tomatoes": "Tomato"
    },
    {
        " and ": null
    },
    {
        "basil": "Basil"
    },
    {
        " in ": null
    },
    {
        "Caprese salad": "Caprese Salad"
    },
    {
        ".       Mozzarella, derived from the ": null
    },
    {
        "Neapolitan": "Neapolitan Language"
    },
    {
        " dialect spoken in ": null
    },
    {
        "Campania": "Campania"
    },
    {
        ", is the diminutive form of  , or  derived from the method of working.  The term is first mentioned in 1570, cited in a cookbook by ": null
    },
    {
        "Bartolomeo Scappi": "Bartolomeo Scappi"
    },
    {
        ", reading milk cream, fresh butter, ricotta cheese, fresh mozzarella and milk .  An earlier reference is also often cited as describing mozzarella. Historian Monsignor Alicandri, in Chiesa Metropolitana di Capua, states that in the 12th century the Monastery of Saint Lorenzo, in ": null
    },
    {
        "Capua": "Capua"
    },
    {
        ", ": null
    },
    {
        "Campania": "Campania"
    },
    {
        " offered pilgrims a piece of bread with mozza or provatura. These are locations rather than products and mozza is taken by some to be mozzarella.        Mozzarella, recognised as a Specialità Tradizionale Garantita since 1996, Regolamento N. 2527/98 della commissione del 25 novembre 1998 registrando una denominazione - Mozzarella - nellalbo delle attestazioni di specificità. Gazzetta ufficiale delle Comunità europee L 317/14 del 26/11/1998. is available fresh, usually rolled into a ball of  or about  in diameter, and sometimes up to  or about  diameter. It is soaked in ": null
    },
    {
        "salt water": "Saline Water"
    },
    {
        "  or ": null
    },
    {
        "whey": "Whey"
    },
    {
        ", and other times ": null
    },
    {
        "citric acid": "Citric Acid"
    },
    {
        " is added and it is partly dried , its structure being more compact. In this last form it is often used to prepare dishes cooked in the oven, such as ": null
    },
    {
        "lasagna": "Lasagna"
    },
    {
        " and ": null
    },
    {
        "pizza": "Pizza"
    },
    {
        ".     When twisted to form a plait mozzarella is called . Mozzarella is also available in smoked  and reduced-moisture, packaged varieties.     Ovolini refers to smaller-sized ": null
    },
    {
        "bocconcini": "Bocconcini"
    },
    {
        ", and sometimes to cherry bocconcini. , p. 40.       Several variants have been specifically formulated and prepared for use on pizza, such as low-moisture Mozzarella cheese.     The International Dictionary of Food and Cooking defines this cheese as a soft spun-curd cheese similar to Mozzarella made from cows milk that is ed particularly for pizzas and contains somewhat less water than real Mozzarella .      Low-moisture part-skim mozzarella, widely used in the ": null
    },
    {
        "food-service": "Food Service"
    },
    {
        " industry, has a low ": null
    },
    {
        "galactose": "Galactose"
    },
    {
        " content, per some consumers preference for cheese on pizza to have low or moderate ": null
    },
    {
        "browning": "Browning"
    },
    {
        ".  Galactose is a type of ": null
    },
    {
        "sugar": "Sugar"
    },
    {
        " found in ": null
    },
    {
        "dairy products": "Dairy Product"
    },
    {
        "and other foods that is less sweet than glucose. Sugar in foods can lead to ": null
    },
    {
        "caramelization": "Caramelization"
    },
    {
        " when they are cooked, which increases their browning. Some ": null
    },
    {
        "pizza cheeses": "Pizza Cheese"
    },
    {
        "derived from skim mozzarella variants were designed not to require aging or the use of starter.  Others can be made through the direct acidification of milk.       In Italy, the cheese is produced nationwide using Italian buffalos milk under the governments official name Mozzarella di latte di bufala because ": null
    },
    {
        "Italian buffalo": "Italian Buffalo"
    },
    {
        " is in all Italian regions. Only selected  Mozzarella di bufala campana PDO  is a type, made from the milk of Italian buffalo, raised in designated areas of ": null
    },
    {
        "Campania": "Campania"
    },
    {
        ", ": null
    },
    {
        "Lazio": "Lazio"
    },
    {
        ", ": null
    },
    {
        "Apulia": "Apulia"
    },
    {
        ", and ": null
    },
    {
        "Molise": "Molise"
    },
    {
        ". Unlike other mozzarellas—50% of whose production derives from non-Italian and often semi-coagulated milk  —it holds the status of a ": null
    },
    {
        "protected designation of origin": "Protected Designation Of Origin"
    },
    {
        " under the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        ".       Fior di latte is made from fresh pasteurized or unpasteurized ": null
    },
    {
        "cows": "Cow"
    },
    {
        "milk and not water buffalo milk, which greatly lowers its cost. Outside the EU, mozzarella not clearly labeled as deriving from water buffalo can be presumed to derive from cow milk. Mozzarella affumicata means ": null
    },
    {
        "smoked": "Smoking"
    },
    {
        " mozzarella.       Mozzarella of ": null
    },
    {
        "sheep milk": "Sheep Milk"
    },
    {
        ", sometimes called mozzarella pecorella , is typical of ": null
    },
    {
        "Sardinia": "Sardinia"
    },
    {
        ", ": null
    },
    {
        "Abruzzo": "Abruzzo"
    },
    {
        " and ": null
    },
    {
        "Lazio": "Lazio"
    },
    {
        ", where it is also called mozzapecora. It is worked with the addition of the ": null
    },
    {
        "rennet": "Rennet"
    },
    {
        " of lamb.          Mozzarella of ": null
    },
    {
        "goats milk": "Goats Milk"
    },
    {
        " is of recent origin and the producers are still few; among the reasons for this new production is the need to offer a kind of mozzarella to those who do not digest cows milk, because goats milk is more digestible.               Mozzarella di bufala is traditionally produced solely from the milk of the ": null
    },
    {
        "Italian Mediterranean buffalo": "Italian Mediterranean Buffalo"
    },
    {
        ". A whey starter is added from the previous batch that contains thermophilic bacteria, and the milk is left to ripen so the bacteria can multiply. Then, ": null
    },
    {
        "rennet": "Rennet"
    },
    {
        " is added to coagulate the milk. After coagulation, the curd is cut into large, 1 –2 pieces, and left to sit so the curds firm up in a process known as healing.     After the curd heals, it is further cut into 3/8 –1/2 large pieces. The curds are stirred and heated to separate the curds from the whey. The whey is then drained from the curds and the curds are placed in a hoop to form a solid mass. The curd mass is left until the pH is at around 5.2–5.5, which is the point when the cheese can be stretched and kneaded to produce a delicate consistency—this process is generally known as ": null
    },
    {
        "pasta filata": "Pasta Filata"
    },
    {
        ". According to the Mozzarella di Bufala trade association, The cheese-maker kneads it with his hands, like a baker making bread, until he obtains a smooth, shiny paste, a strand of which he pulls out and lops off, forming the individual mozzarella.  It is then typically formed into cylinder shapes or in ": null
    },
    {
        "plait": "Braid"
    },
    {
        ". In Italy, a rubbery consistency is generally considered not satisfactory; the cheese is expected to be softer.       Different variants of this dairy product are included in the list of traditional Italian agri-food products of the ": null
    },
    {
        "Ministry of Agricultural, Food and Forestry Policies": "Ministry Of Agricultural, Food And Forestry Policies"
    },
    {
        " , with the following denominations:    Mozzarella    Silana mozzarella    Mozzarella della mortella    Mozzarella di ": null
    },
    {
        "Brugnato": "Brugnato"
    },
    {
        "    Cows mozzarella    Mozzarella or fior di latte    Mozzarella ": null
    }
]