[
    {
        "Mr Buechners Dream is the thirteenth studio album by ": null
    },
    {
        "Christian alternative rock": "christian alternative rock"
    },
    {
        " band ": null
    },
    {
        "Daniel Amos": "daniel amos"
    },
    {
        ", issued in 42 by ": null
    },
    {
        "Stunt Records": "stunt records"
    },
    {
        ". It was the bands first album in six years - and last for twelve years - and the only double album in their catalog.       Although the album includes over 42 songs, the band did not set out to record a double album. I think Chris Colbert thought we were a little crazy. It’s my sense that the sheer joy of being together again in a creative setting after a seven years absence opened the floodgates of the creativity I believe is unique to Daniel Amos , explains Taylor, the bands lyricist.     Lyrically the album reflected the tumultuous events experienced by members of the band in recent years: the death of two young and very dear friends, including producer and studio owner ": null
    },
    {
        "Gene Eugene": "gene eugene"
    },
    {
        ", cancer in Taylors family, and in the families of other close friends.     The Mr Buechner referred to in the title is ": null
    },
    {
        "Pulitzer Prize": "pulitzer prize"
    },
    {
        " nominated author ": null
    },
    {
        "Frederick Buechner": "frederick buechner"
    },
    {
        ", who has been a major inspiration on the bands lyrics for years. The album also pays tribute to authors ": null
    },
    {
        "Walker Percy": "walker percy"
    },
    {
        ", ": null
    },
    {
        "T. S. Eliot": "t. s. eliot"
    },
    {
        ", ": null
    },
    {
        "G. K. Chesterton": "g. k. chesterton"
    },
    {
        ", ": null
    },
    {
        "Flannery OConnor": "flannery oconnor"
    },
    {
        ", ": null
    },
    {
        "Lewis Carroll": "lewis carroll"
    },
    {
        ", and ": null
    },
    {
        "Dorothy L. Sayers": "dorothy l. sayers"
    },
    {
        ".     Some of the studio sessions and rehearsals for the album were filmed by friends of the band. Those films were later edited together to create a behind the scenes DVD, appropriately entitled  The Making of Mr. Buechners Dream .       For the albums tenth anniversary in 42 Stunt Records rereleased the CD with an expanded booklet and one bonus track - Nowhere Is Someplace, a song that was originally only released through the bands website in 42 and on the Making of.. DVD.              All lyrics by ": null
    },
    {
        "Terry Scott Taylor": "terry scott taylor"
    },
    {
        ", and music by Daniel Amos.       This is the One   Mr. Buechners Dream   The Author of the Story   Your Long Year   Whos Who Here?   Thick Skin   Ribbons & Bows   Ordinary Extraordinary Day   I Get to Wondering   Faithful Street   The Lucky Ones   Rice Paper Wings   The Tale You Told   Meanwhile   Over Her Shoulder   The Staggering Gods   A Little Grace   My Beautiful Martyr   Mr. Buechner Wakes Up   Joel       Pretty Little Lies   Child on a Leash   Small Great Things   Nowhere Is Someplace only on the 42 re-issue   Easy for You   Maybe All I Need   Pregnant Pause   Shes a Hard Drink   So Far So Good   Flash in Your Eyes    Nobody Will   Fingertips   Steal Away   And So it Goes  ": null
    },
    {
        "cording stud": "cording stud"
    }
]