[
    {
        "Murat & Jose are a ": null
    },
    {
        "Slovene": "slovenes"
    },
    {
        " hip hop": "hip hop music"
    },
    {
        " duo of writers, producers and MC. Both were born in 42 in ": null
    },
    {
        "Ljubljana": "ljubljana"
    },
    {
        ", ": null
    },
    {
        "Slovenia": "slovenia"
    },
    {
        " where they still live. Together with Nikolovski they performed for some time under the name Nedotakljivi . Together they published one of their first releases on the first Slovene hip hop compilation 42 of Fame za narodov blagor .     Their first solo LP was V besedi je moč  from 42 The album featured some contributions from other artists: Tomi M, singer of Slovene ": null
    },
    {
        "rock": "rock music"
    },
    {
        " group ": null
    },
    {
        "Siddharta": "siddharta"
    },
    {
        ", appeared on socially conscious single Od ljudi za ljudi ; ": null
    },
    {
        "Zagreb": "zagreb"
    },
    {
        " duo Bolesna brača on the song Na izi ; Semo, a vocalist from ": null
    },
    {
        "Kočevje": "kocevje"
    },
    {
        ", featured on ": null
    },
    {
        "reggae": "reggae"
    },
    {
        "-": null
    },
    {
        "balkan": "balkan peninsula"
    },
    {
        "-": null
    },
    {
        "soul": "soul music"
    },
    {
        " track Če hočem and Dokler bova skupi . Nikolovski collaborated on Neki ne štima and on V besedi je moč . Kdo je gengsta features Kemal Trofi & Jozafat. Unusually for a Slovene hip-hop album, V besedi je moč does not include any swearing, regional, sexual, or between-band provocations, claims of illegal behaviour, or drug references.     Murat & Jose have shared the stage with ": null
    },
    {
        "Das Efx": "das efx"
    },
    {
        ", ": null
    },
    {
        "Afu-Ra": "afu-ra"
    },
    {
        ", ": null
    },
    {
        "Little Brother": "little brother"
    },
    {
        " and many other internationally known hip-hop acts. Alongside ": null
    },
    {
        "Heavy Les Wanted": "heavy les wanted"
    },
    {
        " they also appeared at Slovenias first urban festival ": null
    },
    {
        "Breakbeatnikk": "breakbeatnikk"
    },
    {
        ".     Murat & Jose formed a live band in 42 and are now performing under the name Murat & Jose Band. They recorded a fully live album with the band, entitled Tuki Not released in September 42 Its first single Nazaj  featured Slovene rock and soul singer ": null
    },
    {
        "Janez Bončina": "janez bončina"
    },
    {
        ", who rose to fame in the mid seventies. The second single, Be your own, featured local soul singer ": null
    },
    {
        "Maya": "maya"
    }
]