[
    {
        "   Music for a Large Ensemble is a piece of music written by ": null
    },
    {
        "Steve Reich": "steve reich"
    },
    {
        " in 42 It is scored for violin 42 violin 42 ": null
    },
    {
        "cello": "cello"
    },
    {
        "s, 42 ": null
    },
    {
        "flute": "flute"
    },
    {
        "s, 42 ": null
    },
    {
        "clarinet": "clarinet"
    },
    {
        "s, 42 ": null
    },
    {
        "soprano saxophone": "soprano saxophone"
    },
    {
        "s, 42 ": null
    },
    {
        "trumpet": "trumpet"
    },
    {
        "s, 42 ": null
    },
    {
        "piano": "piano"
    },
    {
        "s, 42 ": null
    },
    {
        "marimba": "marimba"
    },
    {
        "s, ": null
    },
    {
        "vibraphone": "vibraphone"
    },
    {
        ", 42 ": null
    },
    {
        "xylophone": "xylophone"
    },
    {
        "s and two female voices.     It had its first performance in ": null
    },
    {
        "Utrecht": "utrecht"
    },
    {
        " on June 42 42 It was a commissioned work by the Holland Festival and it was first performed by Reichs musicians as well as members of the ": null
    },
    {
        "Netherlands Wind Ensemble": "netherlands wind ensemble"
    },
    {
        ". Reich noted that this piece was developed out of two pieces he had previously written,  Music for Mallet Instruments, Voices and Organ  and  Music for 42 Musicians . The piece was written for more musicians than Reich had previously worked with, and included instruments from all sections of the orchestra, including ": null
    },
    {
        "strings": "string instruments"
    },
    {
        ", ": null
    },
    {
        "woodwinds": "woodwinds"
    },
    {
        ", ": null
    },
    {
        "brass": "brass"
    },
    {
        " and ": null
    },
    {
        "percussion": "percussion instrument"
    },
    {
        ", and female voices. The piece is divided into four sections, each marked by a key change initiated by the ": null
    },
    {
        "metallophone": "metallophone"
    },
    {
        ".     As in some of his other works from the same time, Reich uses the technique of ": null
    },
    {
        "augmentation": "augmentation"
    },
    {
        " in this work, whereby short, rapid phrases are stretched out to become longer lines, which combine ": null
    },
    {
        "contrapuntally": "counterpoint"
    },
    {
        " with other ": null
    },
    {
        "melodies": "melody"
    },
    {
        ", then using ": null
    },
    {
        "diminution": "diminution"
    },
    {
        " they are returned to their shorter length. Each of the pieces four sections develop in an arch structure, ABCBA, characteristic of Reichs work at this time.     Reich explained that this piece was part of his experiment with using the human breath as the measure of musical duration ... the chords played by the trumpets are written to take one comfortable breath to perform . Human voices are part of the musical palette in Music for a Large Ensemble, but there are no lyrics.     Although the piece is not one of Reichs most popular, it has been recorded several times, most recently in a performance conducted by ": null
    },
    {
        "Alan Pierson": "alan pierson"
    },
    {
        ". The first recording was a release by ": null
    },
    {
        "ECM Records": "ecm records"
    },
    {
        " in 42 along with Octet and a much older piece: Violin Phase.     ": null
    },
    {
        "Joan LaBarbara": "joan labarbara"
    },
    {
        " describes the work as a very colorful work, bright in its opening, a little dark in the second section, brighter again as it moves into the third. The first sections timbral blending of womens voices with cellos and basses is very effective within the texture. The mallet instruments, clear and solid at the beginning, gradually blend into the background as trumpets and soprano saxophones surge forward. One could watch and feel the rhythmic patterns lock into place as the players relaxed into the performance. It is a bright, joyous, and exciting work .       LaBarbara, Joan . Three by Reich , High Fidelity/Musical America 42 no.42: MA 42 quoted in Fink, Robert . Repeating Ourselves: American Minimal Music as Cultural Practice. .              ": null
    }
]