[
    {
        "           Music lessons are a type of formal instruction in playing a ": null
    },
    {
        "musical instrument": "Musical Instrument"
    },
    {
        " or ": null
    },
    {
        "singing": "Singing"
    },
    {
        ". Typically, a student taking music lessons meets a music teacher for one-on-one training sessions ranging from 30 minutes to one hour in length over a period of weeks or years. For vocal lessons, teachers show students how to sit or stand and breathe, and how to position the head, chest, and mouth for good vocal tone. For instrument lessons, teachers show students how to sit or stand with the instrument, how to hold the instrument, and how to manipulate the fingers and other body parts to produce tones and sounds from the instrument. Music teachers also assign technical exercises, musical pieces, and other activities to help the students improve their musical skills. While most music lessons are one-on-one , some teachers also teach groups of two to four students , and, for very basic instruction, some instruments are taught in large group lessons, such as piano and acoustic guitar. Since the widespread availability of high speed. low latency ": null
    },
    {
        "Internet": "Internet"
    },
    {
        ", private lessons can also take place through live video chat using ": null
    },
    {
        "webcam": "Webcam"
    },
    {
        "s, ": null
    },
    {
        "microphones": "Microphone"
    },
    {
        "and ": null
    },
    {
        "videotelephony": "Videotelephony"
    },
    {
        " online.     Music lessons are part of both amateur music instruction and professional training. In amateur and recreational music contexts, children and adults take music lessons to improve their singing or instrumental playing skills and learn basic to intermediate techniques. In professional training contexts, such as music conservatories, university music performance programs , students aiming for a career as professional musicians take a music lesson once a week for an hour or more with a music professor over a period of years to learn advanced playing or singing techniques. Many instrumental performers and singers, including a number of ": null
    },
    {
        "pop music": "Pop Music"
    },
    {
        " celebrities, have learned music ": null
    },
    {
        "by ear": "Learning Music By Ear"
    },
    {
        " , especially in ": null
    },
    {
        "folk music": "Folk Music"
    },
    {
        " styles such as ": null
    },
    {
        "blues": "Blues"
    },
    {
        " and popular styles such as ": null
    },
    {
        "rock music": "Rock Music"
    },
    {
        ". Nevertheless, even in folk and popular styles, a number of performers have had some type of music lessons, such as meeting with a ": null
    },
    {
        "vocal coach": "Vocal Coach"
    },
    {
        " or getting childhood instruction in an instrument such as piano.          For vocal lessons, teachers show students how to sit or stand and breathe, and how to position the head and mouth for good vocal tone. For instrument lessons, teachers show students how to sit or stand with the instrument, how to hold the instrument, and how to manipulate the fingers and other body parts to produce tones and sounds from the instrument. For wind and brass instruments, the teacher shows the student how to use their lips, tongue, and breath to produce tones and sounds. For some instruments, teachers also train students in the use of the feet, as in the case of piano or other keyboard instruments that have damper or sustain pedals on the piano, the ": null
    },
    {
        "pedal keyboard": "Pedal Keyboard"
    },
    {
        " on a ": null
    },
    {
        "pipe organ": "Pipe Organ"
    },
    {
        ", and some drums and cymbals in the ": null
    },
    {
        "drum kit": "Drum Kit"
    },
    {
        " such as the bass drum pedal and the hi-hat cymbal pedal. In addition to teaching fingering, teachers also provide other types of instruction. A ": null
    },
    {
        "guitar": "Guitar"
    },
    {
        " player learns how to strum and pluck strings; players of ": null
    },
    {
        "wind instruments": "Wind Instrument"
    },
    {
        "learn about breath control and ": null
    },
    {
        "embouchure": "Embouchure"
    },
    {
        ", and ": null
    },
    {
        "singers": "Singer"
    },
    {
        "learn how to make the most of their ": null
    },
    {
        "vocal cords": "Vocal Cords"
    },
    {
        " without hurting the throat or vocal cords.     Teachers also show students how to achieve the correct posture for most efficient playing results. For all instruments, the best way to move the fingers and arms to achieve a desired effect is to learn to play with the least tension in your hands and body. This also prevents forming habits that can injure the skeletal frame and muscles. For example, when playing the ": null
    },
    {
        "piano": "Piano"
    },
    {
        ", fingering—which fingers to put on which keys—is a skill slowly learned as the student advances, and there are many standard techniques a teacher can pass on.     There are many myths and misconceptions among music teachers, especially in the Western classical tradition, about good posture and bad posture. Students who find that playing their instruments causes them physical pain should bring this to their teachers attention. It could be a potentially serious health risk, but it is often overlooked when learning to play an instrument. Learning to use ones body in a manner consistent with the way their anatomy is designed to work can mean the difference between a crippling injury and a lifetime of enjoyment. Many music teachers would caution students about taking no pain, no gain as an acceptable response from their music teacher regarding a complaint of physical pain. Concerns about use-related injury and the ": null
    },
    {
        "ergonomics": "Ergonomics"
    },
    {
        " of musicianship have gained more mainstream acceptance in recent years. Musicians have increasingly been turning to medical professionals, physical therapists, and specialized techniques seeking relief from pain and prevention of serious injury. There exists a plurality of special techniques for an even greater plurality of potential difficulties. The ": null
    },
    {
        "Alexander Technique": "Alexander Technique"
    },
    {
        " is just one example of these specialized approaches.        To fully understand ": null
    },
    {
        "music": "Music"
    },
    {
        " being played, the student must learn the basics of the underlying ": null
    },
    {
        "music theory": "Music Theory"
    },
    {
        ". Along with ": null
    },
    {
        "musical notation": "Musical Notation"
    },
    {
        ", students learn rhythmic techniques—like controlling ": null
    },
    {
        "tempo": "Tempo"
    },
    {
        ", recognizing ": null
    },
    {
        "time signature": "Time Signature"
    },
    {
        "s, and the theory of ": null
    },
    {
        "harmony": "Harmony"
    },
    {
        ", including ": null
    },
    {
        "chords": "Chord"
    },
    {
        "and ": null
    },
    {
        "key signature": "Key Signature"
    },
    {
        "s. In addition to basic theory, a good teacher stresses musicality, or how to make the music sound good. This includes how to create good, pleasing tone, how to do musical phrasing, and how to use ": null
    },
    {
        "dynamics": "Dynamics"
    },
    {
        " to make the piece or song more expressive.     Most music lessons include some instruction in the history of the type of music that the student is learning. When a student is taking Western ": null
    },
    {
        "classical music": "Classical Music"
    },
    {
        " lessons, music teachers often spend some time explaining the different eras of western classical music, such as the ": null
    },
    {
        "Baroque Era": "Baroque Era"
    },
    {
        ", the ": null
    },
    {
        "Classical": "Classical Period Music"
    },
    {
        " era, the ": null
    },
    {
        "Romantic Era": "Romantic Era"
    },
    {
        ", and the ": null
    },
    {
        "contemporary classical music era": "Contemporary Classical Music Era"
    },
    {
        ", because each era is associated with different styles of music and different ": null
    },
    {
        "performance practice": "Performance Practice"
    },
    {
        " techniques. Instrumental music from the Baroque era is often played in the 2000s as teaching pieces for piano students, string instrument players, and wind instrument players. If students just try to play these Baroque pieces by reading the notes from the score, they might not get the right type of interpretation. However, once a student learns that most Baroque instrumental music was associated with dances, such as the ": null
    },
    {
        "gavotte": "Gavotte"
    },
    {
        " and the ": null
    },
    {
        "sarabande": "Sarabande"
    },
    {
        ", and keyboard music from the Baroque era was played on the ": null
    },
    {
        "harpsichord": "Harpsichord"
    },
    {
        " or the pipe organ, a modern-day student is better able to understand how the piece should be played. If, for example, a ": null
    },
    {
        "cello": "Cello"
    },
    {
        " player is assigned a gavotte that was originally written for harpsichord, this gives the student insight in how to play the piece. Since it is a dance, it should have a regular, clear pulse, rather than a Romantic era-style shifting ": null
    },
    {
        "tempo rubato": "Tempo Rubato"
    },
    {
        ". As well, since it was originally written for the harpsichord, a light-sounding keyboard instrument in which the strings are plucked with quills, this suggests that the notes should be played relatively lightly, and with spaces between each note, rather than in a full-bodied, sustained ": null
    },
    {
        "legato": "Legato"
    },
    {
        ".       Although not universally accepted, many teachers drill students with the repetitive playing of certain patterns, such as ": null
    },
    {
        "scales": "Scale"
    },
    {
        ", ": null
    },
    {
        "arpeggio": "Arpeggio"
    },
    {
        "s, and ": null
    },
    {
        "rhythm": "Rhythm"
    },
    {
        "s. Scales are often taught because they are the building blocks of melody in most Western art music. In addition, there are flexibility studies, which make it physically easier to play the instrument.   Percussion instruments use rudiments that help in the development of sticking patterns, roll techniques and other little nuances such as flams and drags.     There are sets of exercises for piano designed to stretch the connection between fourth and fifth fingers, making them more independent. Brass players practice lip slurs, which are unarticulated changes in ": null
    },
    {
        "embouchure": "Embouchure"
    },
    {
        " between ": null
    },
    {
        "partial": "Harmonic Series Terminology"
    },
    {
        "s. Woodwind players have a multitude of exercises to help with tonguing techniques, finger dexterity, and tone development. Entire books of ": null
    },
    {
        "etudes": "Etude"
    },
    {
        "have been written to this purpose.       Teachers typically assign the student pieces of slowly increasing difficulty. Besides using pieces to teach various musical rudiments and teach the elements of good playing style, a good teacher also inspires more intangible qualities—such as expressiveness and musicianship. Pieces are more enjoyable for most students than theory or scale exercises, and an emphasis on learning new pieces is usually required to maintain students motivation. However, the teacher must not over-accommodate a students desire for fun pieces. Often the students idea of fun music is popular vocal selections, movie soundtracks, and ": null
    },
    {
        "TV show": "Tv Show"
    },
    {
        " theme songs, etc. While some of these fun pieces can be performed, pieces should also be selected for pedagogical reasons, such as challenging the student and honing their skills. Student should learn something from every piece they play. In addition, for students to be well rounded they must play many types of pieces by composers and songwriters from different eras, ranging from ": null
    },
    {
        "Renaissance music": "Renaissance Music"
    },
    {
        " to pieces from the 20th and 21st century. A varied repertoire increases the students musical understanding and skill.       A popular measure of progress, especially for children, is external assessment of the progress of the pupil by a regular ": null
    },
    {
        "examination": "Music Examination"
    },
    {
        ". A number of exam boards assess pupils on music theory or practice. These are available for almost every musical instrument. A common method to mark progress is graded examinations—for example from grade 1 to grade 8 .  Some teachers prefer other methods of target-setting for their pupils. The most common is the pupils concert, which gives experience in playing in public and under a certain degree of pressure, without outright criticism or a more or less arbitrary marking system. Another is the graded system of books followed by teachers of the ": null
    },
    {
        "Suzuki method": "Suzuki Method"
    },
    {
        ", in which the completion of each book is celebrated, without a system of marking or ranking of pupils.            Some studies suggests that music lessons provide children with important developmental benefits beyond simply the knowledge or skill of playing a musical instrument. Research suggests that musical lessons may enhance intelligence and academic achievement, build self-esteem and improve discipline.  A recent ": null
    },
    {
        "Rockefeller Foundation": "Rockefeller Foundation"
    },
    {
        " Study found that music majors have the highest rate of admittance to medical schools, followed by biochemistry and the humanities. On ": null
    },
    {
        "SAT": "Sat"
    },
    {
        " tests, the national average scores were 427 on the verbal and 476 on math. At the same time, music students averaged 465 on the verbal and 497 on the math - 38 and 21 points higher, respectively. However, the observed correlation between musical and mathematical ability may be inherent rather than acquired. Furthermore, it is possible that the correlation between taking music lessons and academic ability exists because both are strongly correlated with parental income and education. Even if music lessons had no impact on academic ability, one would expect to see a correlation between music lessons and academic ability.     Skills learned through the discipline of music may transfer to ": null
    },
    {
        "study skills": "Study Skills"
    },
    {
        ", communication skills, and cognitive skills useful in every part of a childs studies at school, though. An in-depth ": null
    },
    {
        "Harvard University": "Harvard University"
    },
    {
        " study found evidence that spatial-temporal reasoning improves when children learn to make music, and this kind of reasoning improves temporarily when adults listen to certain kinds of music, including Mozart.  This finding  suggests that music and spatial reasoning are related psychologically and perhaps neurologically as well. However, there has been considerable controversy over this as later researchers have failed to reproduce the original findings of Rauscher , questioned both theory and methodology of the original study and suggested that the enhancing effects of music in experiments have been simply due to an increased level of arousal .     A relationship between music and the strengthening of ": null
    },
    {
        "math": "Math"
    },
    {
        ", ": null
    },
    {
        "dance": "Dance"
    },
    {
        ", ": null
    },
    {
        "reading": "Reading"
    },
    {
        ", creative thinking and visual arts skills has also been reported in ": null
    },
    {
        "literature": "Literature"
    },
    {
        ".  However recent findings by Dr. Levitin of ": null
    },
    {
        "McGill University": "Mcgill University"
    },
    {
        " in ": null
    },
    {
        "Montreal": "Montreal"
    },
    {
        ", ": null
    },
    {
        "Canada": "Canada"
    },
    {
        ", undermines the suggested connection between musical ability and higher math skills. In a study conducted on patients with ": null
    },
    {
        "Williams syndrome": "Williams Syndrome"
    },
    {
        " , he found that even though their ": null
    },
    {
        "intelligence": "Intelligence"
    }
]