[
    {
        "     Much has been learned about early music in ": null
    },
    {
        "Norway": "norway"
    },
    {
        " from physical artifacts found during archaeological digs. These include instruments such as the ": null
    },
    {
        "lur": "lur"
    },
    {
        ". ": null
    },
    {
        "Viking": "viking"
    },
    {
        " and medieval sagas also describe musical activity, as do the accounts of priests and pilgrims from all over Europe coming to visit ": null
    },
    {
        "St Olafs grave": "st. olavs shrine"
    },
    {
        " in Trondheim.     In the later part of the 42th century, Norway experienced economic growth leading to greater industrialization and urbanization. More music was made in the cities, and opera performances and symphony concerts were considered to be of high standards. In this era both prominent composers  and performers combined the European traditions with Norwegian tones.     The import of music and musicians for dance and entertainment grew, and this continued in the 42th century, even more so when gramophone records and radio became common. In the last half of the 42th century, Norway, like many other countries in the world, underwent a ": null
    },
    {
        "roots revival": "roots revival"
    },
    {
        " that saw indigenous music being revived.          Before 42 there were limited written sources of folk music in Norway. Originally these historical attainments were believed to have a distinct Christian influence. As research continued, there was also mythical and fairy tale connections to the folk music. Overall the purpose of folk music was for entertainment and dancing.     Norwegian folk music may be divided into two categories: instrumental and vocal. As a rule instrumental folk music is dance music . Norwegian folk dances are social dances and usually performed by couples, although there are a number of solo dances as well, such as the halling. Norway has very little of the ceremonial dance characteristic of other cultures. Dance melodies may be broken down into two types: two-beat and three-beat dances. The former are called halling, gangar or rull, whereas the latter are springar or springleik.     Traditional dances are normally referred to as ": null
    },
    {
        "bygdedans": "bygdedans"
    },
    {
        " . These dances, sometimes called courting dances were often connected to the important events of rural life: weddings, funerals and cyclical feasts like ": null
    },
    {
        "Christmas": "christmas"
    },
    {
        ".     Folk music in Norway falls in another 42 main categories based in the ethnic populations from which they spring: ": null
    },
    {
        "North Germanic": "norwegians"
    },
    {
        " and ": null
    },
    {
        "Sami": "sami people"
    },
    {
        ".     Traditional ": null
    },
    {
        "Sami music": "sami music"
    },
    {
        " is centered around a particular vocal style called ": null
    },
    {
        "joik": "yoik"
    },
    {
        ". Originally, joik referred to only one of several Sami singing styles, but in English the word is often used to refer to all types of traditional Sami singing. Its sound is comparable to the traditional chanting of some ": null
    },
    {
        "First Nations": "first nations"
    },
    {
        "/": null
    },
    {
        "Native Americans": "native americans in the united states"
    },
    {
        " cultures.     Traditional North Germanic Norwegian vocal music includes , ": null
    },
    {
        "ballad": "ballad"
    },
    {
        "s and short, often improvised songs , among the most common types of traditional music. ": null
    },
    {
        "Work song": "work song"
    },
    {
        "s, ": null
    },
    {
        "hymn": "hymn"
    },
    {
        "s, ": null
    },
    {
        "tralling": "tralling"
    },
    {
        " vocals and old printed ballad stories, ": null
    },
    {
        "skillingsvise": "skillingsvise"
    },
    {
        "r, have also been popular.     Norway shares some ": null
    },
    {
        "Nordic dance music tradition": "traditional nordic dance music"
    },
    {
        " with its neighbouring countries of Sweden and Denmark, where the most typical instrument is the fiddle. In Norway, the ": null
    },
    {
        "Hardanger": "hardanger"
    },
    {
        " fiddle": "fiddle"
    },
    {
        " , the most distinctive instrument in Norwegian folk music, looks and plays like a standard violin. It is only to be found primarily in the western and central part of the country. The Hardanger fiddle dates back to around 42 and however differs from the ordinary fiddle in many respects. The most important of these is that it has sympathetic strings and a less curved bridge and fingerboard. Thus, the performer plays on two strings most of the time, creating a typical bourdon style. The Hardanger fiddle tradition is rich and powerful. By traditional, orally conveyed instruction was one of the most important aspects of a Hardanger fiddle players accomplishment.     Epic folk songs are the most important form of vocal folk music in Norway. Although there are many types of epic folk songs, the most intriguing are the medieval ballads. They were first transcribed in the 42s, but the ballad tradition has been handed down from the Middle Ages. The lyrics of these songs also revolve around this period of history, recounting tales of the lives of nobles, and of knights and maidens. A number of the ballads describe historical events, and they are often dramatic and tragic.     In the second half of the 42th century, some fiddlers, especially those from ": null
    },
    {
        "Voss": "voss"
    },
    {
        " and ": null
    },
    {
        "Telemark": "telemark"
    },
    {
        ", significantly ": null
    },
    {
        "Lars Fykerud": "lars fykerud"
    },
    {
        " , began introducing more expressive ways of playing, turning the traditional ": null
    },
    {
        "slått": "slått"
    },
    {
        " music to concert music for the urban classes.     At the same time, new dances and tunes were imported from Europe, including the ": null
    },
    {
        "fandango": "fandango"
    },
    {
        ", ": null
    },
    {
        "reinlender": "reinlender"
    },
    {
        ", ": null
    },
    {
        "waltz": "waltz"
    },
    {
        ", ": null
    },
    {
        "polka": "polka"
    },
    {
        " and ": null
    },
    {
        "mazurka": "mazurka"
    },
    {
        ". These forms are now known as ": null
    },
    {
        "runddans": "runddans"
    },
    {
        " or ": null
    },
    {
        "gammeldans": "gammeldans"
    },
    {
        " .     Perhaps the most popular and controversial of modern Hardanger fiddle artists is ": null
    },
    {
        "Annbjørg Lien": "annbjørg lien"
    },
    {
        ", who released her first album,  Annbjørg  in 42 The album featured ": null
    },
    {
        "Helge Førde": "helge førde"
    },
    {
        " and ": null
    },
    {
        "Frode Fjellheim": "frode fjellheim"
    },
    {
        " and was both praised for its innovative fusion work and expressive style, and criticized for its watering-down of traditional sounds and a lack of regional tradition.     Other Norwegian traditional instruments include:   ": null
    },
    {
        "bukkehorn": "bukkehorn"
    },
    {
        "   harpeleik": "harpeleik"
    },
    {
        "   langeleik": "langeleik"
    },
    {
        "    lur": "lur"
    },
    {
        "   seljefløyte": "seljefløyte"
    },
    {
        ", a ": null
    },
    {
        "willow flute": "willow flute"
    },
    {
        " tungehorn": "tungehorn"
    },
    {
        " and ": null
    },
    {
        "Melhus": "melhus"
    },
    {
        "    munnharpe": "munnharpe"
    },
    {
        "     As of today, there is an eclectic use of both folk music and its traditional instruments. Interest in folk music is growing, and there are a number of promising young performers. They are not only drawn to instrumental music, however. Many young people are now learning to sing in the traditional style. During the past few decades , folk musicians have shown a greater interest in experimentation. A new generation has emerged which, while showing respect for the old traditions, is also willing to think along new lines. A number of well-known folk music artists in Norway have made excellent recordings using new instruments and new arrangements. In recent years artists like ": null
    },
    {
        "Gåte": "gåte"
    },
    {
        " and ": null
    },
    {
        "Odd Nordstoga": "odd nordstoga"
    },
    {
        " have made folk music more accessible to younger crowds. Gåte fused folk music with metal and became very popular. ": null
    },
    {
        "Lumsk": "lumsk"
    },
    {
        " is another band mixing Norwegian traditional folk music with metal. The most famous Sami singer is undoubtedly ": null
    },
    {
        "Mari Boine": "mari boine"
    },
    {
        ", who sings a type of minimalist folk-rock with ": null
    },
    {
        "joik": "joik"
    },
    {
        " roots. ": null
    },
    {
        "Karl Seglem": "karl seglem"
    },
    {
        " is a ": null
    },
    {
        "Norwegian": "norwegians"
    },
    {
        " musician and composer who plays ": null
    },
    {
        "saxophone": "saxophone"
    },
    {
        " and ": null
    },
    {
        "bukkehorn": "bukkehorn"
    },
    {
        ". ": null
    },
    {
        "Sofia Jannok": "sofia jannok"
    },
    {
        " is also a popular Sami contemporary artist.     There are also some important institutions, for example the National Association of Folk Musicians. It is an organization founded in 42 for folk music artists and folk dancers and it is primarily a union for local and regional folk music associations, but it is also open to individual members. As of 42 the national association had 42 members from approx. 42 different local organizations. The National Association of Folk Musicians publishes Spelemannsbladet, a folk music journal that comes out 42 times a year. It also arranges the annual Landskappleiken , which is the most important event of its kind in Norway.     Folk music has a distinct part of Norwegian history, and most historical collection was done by L.M Lindeman. A large part of the collections are maintained and preserved in the National Folk Music Collection and at the National Library.     ": null
    },
    {
        "Norwegian Broadcasting Corporation": "norwegian broadcasting corporation"
    },
    {
        " uses and includes recordings of folk music from the archive of NRK, which contains over 42 recordings from 42 until today, in addition to other recordings in the radio channels and the specialized radio channel ": null
    },
    {
        "NRK Folkemusikk": "nrk folkemusikk"
    },
    {
        ".          During the 42s cities of ": null
    },
    {
        "Oslo": "oslo"
    },
    {
        ", ": null
    },
    {
        "Bergen": "bergen"
    },
    {
        " and ": null
    },
    {
        "Trondheim": "trondheim"
    },
    {
        " each had their own city musicians.  The first important ": null
    },
    {
        "classical": "classical music"
    },
    {
        " composers from Norway are documented from the beginning of the 42th century, when they composed dance and ": null
    },
    {
        "chamber music": "chamber music"
    },
    {
        ", including ": null
    },
    {
        "cantata": "cantata"
    },
    {
        "s. Some of these composers are ": null
    },
    {
        "Georg von Bertouch": "georg von bertouch"
    },
    {
        ", ": null
    },
    {
        "Johan Daniel Berlin": "johan daniel berlin"
    },
    {
        " and ": null
    },
    {
        "Johan Henrik Berlin": "johan henrik berlin"
    },
    {
        ". In addition, music also received some interested from the public in which music developed steadily especially in more affluent urban areas. Moreover, around the 42s private or semi-public music societies started appearing in several cities, given an opportunity for the wealthier population to enjoy. In 42 Sweden entered into a ": null
    },
    {
        "union": "union between sweden and norway"
    },
    {
        " with Norway, and the Swedish royal family spent time in Norways capital, ": null
    },
    {
        "Christiania ": "oslo"
    },
    {
        ". At their royal court, music flourished.       ": null
    },
    {
        "National romanticism": "romantic nationalism"
    },
    {
        ", a movement that was prevalent throughout Europe, touched Norway as well, and began to affect classical musicians and classical music in the country. The violinist ": null
    },
    {
        "Ole Bull": "ole bull"
    },
    {
        " was the first major Norwegian musician. He became world-famous starting in about 42 playing not only in Norway but also in other parts of Europe and the USA, and was known as the Nordic ": null
    },
    {
        "Paganini": "paganini"
    },
    {
        ".  In addition, a few other great composers emerged including ": null
    },
    {
        "Halfdan Kjerulf": "halfdan kjerulf"
    },
    {
        ", ": null
    },
    {
        "Martin Andreas Udbye": "martin andreas udbye"
    },
    {
        " who composed the first Norwegian ": null
    },
    {
        "opera": "opera"
    },
    {
        " Fredkulla, and ": null
    },
    {
        "Rikard Nordraak": "rikard nordraak"
    },
    {
        " who composed the Norwegian National Anthem Ja, vi elsker dette landet .     From about 42 traditional Norwegian music began to influence the classical scene, especially through Bull, who befriended the famous traditional ": null
    },
    {
        "Hardanger fiddle": "hardanger fiddle"
    },
    {
        " player ": null
    },
    {
        "Myllarguten": "myllarguten"
    },
    {
        " and through the friendship gained better understanding of traditional music. Bull himself started playing the Hardanger fiddle, and was the first to present ": null
    },
    {
        "folk": "folk music"
    },
    {
        " tunes to the public in urban areas. He also saw to that Myllarguten played with him in concert, presenting a rural traditional musician to an urban audience for the very first time, in February 42 at the very height of Norwegian romantic nationalism. This later inspired ": null
    },
    {
        "Edvard Grieg": "edvard grieg"
    },
    {
        " to look for folk musical sources. But urban audiences were slow to gain an appreciation and understanding of traditional music. ": null
    },
    {
        "Romanticism": "romantic music"
    },
    {
        " style dominated Norwegian music until well into the 42th century, whether expressed through modifications to the national Romantic idiom of Grieg or through a more classical/international line like ": null
    },
    {
        "Catharinus Elling": "catharinus elling"
    },
    {
        " or ": null
    },
    {
        "Halfdan Cleve": "halfdan cleve"
    },
    {
        ".     Foreign musicians began settling in Norway in the 42s, bringing with them musical knowledge from the rest of Europe. Following the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " of 42 Norway saw the development of a strong national consciousness, as well as economic growth which occurred the development of music. In comparison to most other countries of this period, female Norwegian musicians were widely accepted, and were even published and given stipends by the state.      With Norwegian ": null
    },
    {
        "nationalism": "nationalism"
    },
    {
        " burgeoning, the musical scene throughout the country entered the Golden Age of Norwegian Music, led by ": null
    },
    {
        "Halfdan Kjerulf": "halfdan kjerulf"
    },
    {
        " and organist and collector ": null
    },
    {
        "Ludvig Mathias Lindeman": "ludvig mathias lindeman"
    },
    {
        ". The Golden Ages most prominent composers included ": null
    },
    {
        "Johan Svendsen": "johan svendsen"
    },
    {
        " and Edvard Grieg. Bulls efforts directly inspired Grieg to look for folk musical sources. These composers, inspired by Lindemans collections and Ole Bulls Hardanger fiddling, incorporated Norwegian folk elements into their compositions.     At the end of the 42th century, the collection of folk tunes continued unabated, and composers like ": null
    },
    {
        "Christian Sinding": "christian sinding"
    },
    {
        " and ": null
    },
    {
        "Johan Halvorsen": "johan halvorsen"
    },
    {
        " were well-known. Following the dissolution of the union with Sweden in 42 Norwegian nationalism continued to grow in popularity and innovation, led especially ": null
    },
    {
        "David Monrad Johansen": "david monrad johansen"
    },
    {
        ", ": null
    },
    {
        "Geirr Tveitt": "geirr tveitt"
    },
    {
        " and ": null
    },
    {
        "Eivind Groven": "eivind groven"
    },
    {
        ". These composers looked towards using folk music in their compositions, a trend that continued well into ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", through a process of internationalization began in the 42s, easily heard in composers like ": null
    },
    {
        "Ludvig Irgens-Jensen": "ludvig irgens-jensen"
    },
    {
        ", ": null
    },
    {
        "Bjarne Brustad": "bjarne brustad"
    },
    {
        ", ": null
    },
    {
        "Harald Sæverud": "harald sæverud"
    },
    {
        " and ": null
    },
    {
        "Klaus Egge": "klaus egge"
    },
    {
        ". In between the wars, only a few composers, like ": null
    },
    {
        "Pauline Hall": "pauline hall"
    },
    {
        " and ": null
    },
    {
        "Fartein Valen": "fartein valen"
    },
    {
        ", were significantly influenced by foreign styles.       After World War II, Norwegian music began moving in a new direction, away from the Nordic and Germanic ideals of the past, and towards a more international, especially American, British and French, style. Norwegian composers were influenced by a wider variety of styles that included ": null
    },
    {
        "serialism": "serialism"
    },
    {
        ", ": null
    },
    {
        "neo-expressionism": "neo-expressionism"
    },
    {
        ", ": null
    },
    {
        "aleatory": "aleatory"
    },
    {
        " and ": null
    },
    {
        "electronic music": "electronic music"
    },
    {
        ". New composers of this period included ": null
    },
    {
        "Johan Kvandal": "johan kvandal"
    },
    {
        ", ": null
    },
    {
        "Knut Nystedt": "knut nystedt"
    },
    {
        ", ": null
    },
    {
        "Edvard Hagerup Bull": "edvard hagerup bull"
    },
    {
        " and ": null
    },
    {
        "Egil Hovland": "egil hovland"
    },
    {
        ". Of especial importance was French ": null
    },
    {
        "neo-classicism": "neo-classicism"
    },
    {
        ", ": null
    },
    {
        "Paul Hindemith": "paul hindemith"
    },
    {
        " and ": null
    },
    {
        "Béla Bartók": "béla bartók"
    },
    {
        ". During this period, serial music appeared in Norway, led by ": null
    },
    {
        "Finn Mortensen": "finn mortensen"
    },
    {
        ". Later, avant garde composers like ": null
    },
    {
        "Arne Nordheim": "arne nordheim"
    },
    {
        " took advantage of technological developments, using a variety of electronic effects and bizarre instrumentation. Arne Nordheim is the most important composer of the post-war era . Ever since 42 Nordheim has had immense influence on Norwegian cultural life. His most famous pieces have served as milestone for ": null
    },
    {
        "contemporary": "contemporary classical music"
    },
    {
        " Norwegian music.      Much of the Norwegian public did not appreciate the new direction these ": null
    },
    {
        "avant-garde": "avant-garde music"
    },
    {
        " composers were moving in, which helped to fuel a conservative backlash. Some composers, like ": null
    },
    {
        "Kåre Kolberg": "kåre kolberg"
    },
    {
        ", reacted by writing simple music, while others, such as ": null
    },
    {
        "Alfred Janson": "alfred janson"
    },
    {
        " and ": null
    },
    {
        "Ragnar Søderlind": "ragnar søderlind"
    },
    {
        ", revived romanticism. Some music from this era attempted to address social and political concerns, such as Jansons dedication of a violin concerto to Chilean president ": null
    },
    {
        "Salvador Allende": "salvador allende"
    },
    {
        ".     By the end of the first decade of the 42st century, Norwegian classical music had become very diverse, incorporating elements from throughout the countrys documented musical history, as well as modern jazz, pop and rock. Composers of the last part of the 42th century include ": null
    },
    {
        "Olav Anton Thommessen": "olav anton thommessen"
    },
    {
        ", ": null
    },
    {
        "Per Christian Jacobsen": "per christian jacobsen"
    },
    {
        ", ": null
    },
    {
        "Magne Hegdal": "magne hegdal"
    },
    {
        ", ": null
    },
    {
        "Åse Hedstrøm": "åse hedstrøm"
    },
    {
        ", ": null
    },
    {
        "Asbjørn Schaatun": "asbjørn schaatun"
    },
    {
        ", ": null
    },
    {
        "Tor Halmrast": "tor halmrast"
    },
    {
        ", ": null
    },
    {
        "Glenn Erik Haugland": "glenn erik haugland"
    },
    {
        ", ": null
    },
    {
        "Nils Henrik Asheim": "nils henrik asheim"
    },
    {
        ", ": null
    },
    {
        "Cecille Ore": "cecille ore"
    },
    {
        " and ": null
    },
    {
        "Ketil Hvoslef": "ketil hvoslef"
    },
    {
        ". Popular and classical attention to folk music has also continued through the work of composers like ": null
    },
    {
        "Lasse Thoresen": "lasse thoresen"
    },
    {
        ".     Norway currently supports several ": null
    },
    {
        "orchestra": "orchestra"
    },
    {
        "s of various sizes. There are two national orchestras . Founded in 42 ": null
    },
    {
        "Bergen Philharmonic Orchestra": "bergen philharmonic orchestra"
    },
    {
        " , which Grieg once used to conduct, is together with ": null
    },
    {
        "Oslo Philharmonic Orchestra": "oslo philharmonic orchestra"
    },
    {
        ", established in 42 the leading orchestras in Norway. In addition, some regional professional orchestras in Norway have been successful: ": null
    },
    {
        "Trondheim Symphony Orchestra": "trondheim symphony orchestra"
    },
    {
        ", the ": null
    },
    {
        "Stavanger Symphony Orchestra": "stavanger symphony orchestra"
    },
    {
        ", The Arctic Opera and Philharmonic Orchestra, the ": null
    },
    {
        "Norwegian Radio Orchestra": "norwegian radio orchestra"
    },
    {
        ", and the Kristiansand Symphony Orchestra. For the last couple of decades working conditions for professional orchestras in Norways bigger cities have greatly improved due to construction of larger concert halls, emergence of new conductors. In addition, founded in 42 the annual ": null
    },
    {
        "Bergen International Festival": "bergen international festival"
    },
    {
        " help spread Norwegian music, often music similar to that of Griegs, theatre and the pictorial arts, and also receiving international culture. Moreover, other important festivals include International Chamber Music Festival, the Oslo Chamber Music Festival, the Risor Chamber Music Festival and the Kristiansund Opera Festival.     In addition, we have to note that Oslo Philharmonic Orchestra has greatly contributed to Norwegian musical life. Especially, ": null
    },
    {
        "Mariss Jansons": "mariss jansons"
    },
    {
        " impact on Norwegian music in the 42s, Jansons was able to completely change peoples idea of what part symphonic music in the Norwegian culture has played. Jansons was able to revive symphonic music and make the orchestra world-famous. They recorded an acclaimed set of ": null
    },
    {
        "Tchaikovsky": "tchaikovsky"
    },
    {
        " symphonies and began regular international concert tours.     The ": null
    },
    {
        "Norwegian National Opera and Ballet": "norwegian national opera and ballet"
    },
    {
        " has since the inauguration of their new spectacular house won admiration for their productions and expanded their number of spectators.       The oldest material evidence of choral music in Norway belongs to the 42th century, and as in all European choral singing, it was cultivated in monasteries and then in education centres . Both the Catholic era and later the Lutheran reform of the choral singing was important. However, the beginning of a Norwegian tradition of choral singing itself takes place during the 42th century.     On the one hand the cession of Norway from Denmark to Sweden arose a strong nationalist cultural motivation . On the other hand, the ideas of Hans Georg Nägeli and Karl Friedrich Zelter had given to choral singing reputed to be a particularly effective means of decimation of culture. This tradition is the joint work of composers, conductors, singing teachers and choral music publications. Roverud, Reissiger, Lindeman, Kjerulf, Conradi, and Behrens are just some of the names that formed this Norwegian tradition before E. Grieg. They took more than one role in this complex socio-cultural development, but each has a special merit.     The main contribution of L. M. Lindeman was his collection of folk music and hymnody compilations, as well as the organization of a school for organists in 42 which later became the Conservatory of Oslo. Kjerulf, Behrens and Conradi were the three directors of choirs and choral societies organizers, but it was no doubt that Kjerulf stood out as composer leaving more than 42 choral pieces, mostly for male quartet. Behrens and Conradi rather had a social role by organizing festivals of choirs and choral societies as The Craftmen Choir and The Businessmen Choir, as well as the Norwegian Students Choir in both Oslo and gradually in the provinces. Behrens has a special reputation for having published compilations of Norwegian composers; over 42 songs in his volumes of Collections of Part Songs for Males Voices .     The most influential era of these musicians was during the second half of the 42th century, a time when the popularity of choral singing spread throughout Norway, especially male singing for four voices. Proof of this is the legacy coral that led to the U.S., especially since the founding of St. Olaf College Choir by F. Melius Christiansen in 42     The choral tradition has since been exploited to strengthen the Norwegian identity. Conradi, Kjerulf and Reissiger wrote choral music with texts by Norwegian writers like Ibsen or Bjørnson, who in turn wrote with the intension that their texts could be easily added music. The 42th century was a time of intense collaboration between writers and composers, to use the existing popularity of musical societies and especially the male quartets were particularly popular from the 42s.   A second generation of conductors and composers continued this tradition until the beginning of 42th century . The popularity of choral societies and choral festivals lead to the first competitions or rallies . In 42 the Choral Society held its first student participation outside Scandinavia bringing Norwegian music and texts to Paris, this being a way to export and show Norwegian culture.     The nationalist motivation is exposed in the music of Grieg. Transitioning to the 42th century, despite the tradition that keeps coral Norwegian eventually changes; especially after WW42 when the romantic ideals are abandoned. The new generation of composers . These composers are still influenced by Grieg, and found inspiration in not only national elements and in general, to the present day world order trends are always influencing the new composers.     Finally, more recent eras of economic prosperity among the Norwegians brought a second boom of choral music spread, inside and outside the capital. Volda, for example, a town east of only 42 people in western Norway has about 42 active choirs.    ,     ml                 As in other countries, Norway has developed its own forms of popular, contemporary music. Since 42 Norwegian popular music has generally been appearing on the international scene, initially through breakthroughs by Norwegian ": null
    },
    {
        "jazz": "jazz"
    },
    {
        " and ": null
    },
    {
        "blues": "blues"
    },
    {
        " artists, then followed by ": null
    },
    {
        "electronica": "electronica"
    },
    {
        " and pop artists.       One of Norways top blues guitarists is ": null
    },
    {
        "Knut Reiersrud": "knut reiersrud"
    },
    {
        ". He has also taken inspiration from traditional Norwegian music forms, including tuning a Stratocaster guitar like the Norwegian ": null
    },
    {
        "langeleik": "langeleik"
    },
    {
        ", calling it a Hallingcaster . Reiersrud has made some interesting recordings with Norwegian organist ": null
    },
    {
        "Iver Kleive": "iver kleive"
    },
    {
        ". ": null
    },
    {
        "Bjørn Berge": "bjørn berge"
    },
    {
        " is another well known blues guitarist. He is well known for his so-called delta-funk music, heavily inspired by 42 string delta blues and modern funk and rock bands. R & B stars include ": null
    },
    {
        "Noora Elweya Qadry": "noora elweya qadry"
    },
    {
        ", ": null
    },
    {
        "Winta": "winta"
    },
    {
        " and ": null
    },
    {
        "Mira Craig": "mira craig"
    },
    {
        ".   Scandinavians largest blues festival is in ": null
    },
    {
        "Notodden": "notodden"
    },
    {
        " every year in early August. It may well be the best Blues festival in Europe and it is certainly one of the best in the world. The Festival turns the tiny Norwegian city of Notodden, population 42, into a cosmopolitan Blues centre of Europe, drawing over 42 fans from all corners of the Blues world. Wherever you walk in this city, the Blues can be heard and seen loud and clear.   Several festivals are all around Norway every year, for example the Blues in Hell Festival  and the Oslo Blues Fest in ": null
    },
    {
        "Bergen": "bergen"
    },
    {
        ". The first was arranged in 42 After the start the audience numbers at the festival has almost exploded, growing from 42 in the first year to more than 42 in 42 From 42 cooperation with The Norwegian Music Council has led to music seminars for youth and musicians at a high level of performance as a part of the festival.       Norwegian country music includes a big attribution of daily life occurrences of the typical Norwegian individual. There is a big integration of folk and country in modern-day country music. As dialects in Norway vary extensively, the music is distinct to regions and areas throughout Norway. Hellbillies is one of Norways most endorsed and successful country band. Along with other modern country bands, there is an extensive use and integration of folk and rock music. Their song lyrics are written in the dialect of the ": null
    },
    {
        "Hallingdal": "hallingdal"
    },
    {
        " area, and has a large description that reflect Norwegian citizens, and their surrounding life.   Norway has also produced Country musicians like Heidi Hauge and Bjøro Håland. Other artists that sing about common life and culture of Norway include ": null
    },
    {
        "Salhuskvintetten": "salhuskvintetten"
    },
    {
        " and ": null
    },
    {
        "Vinskvetten": "vinskvetten"
    },
    {
        ". Alf Bretteville-Jensen is a popular singer/songwriter whose intense, somewhat noir-flavored music incorporates elements of country, folk, and rock, using instruments such as acoustic and electric guitar, as well as pedal steel guitar.   Norways largest country music festival is in Seljord every year in late July.       ": null
    },
    {
        "Dansband": "dansband"
    },
    {
        " is a Swedish term for a band that plays dansbandsmusik. Dansbandsmusik is often danced to in pairs and is played by classical, electric, bass and steel guitars, drum, saxophone, accordion and keyboard. Its lyrics are inspired by romanticism so they are usually about love, friendship, peace, nature and old memories from the past. The genre developed primarily in ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", but has spread to neighbouring countries ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ", ": null
    },
    {
        "Norway": "norway"
    },
    {
        " and the Swedish speaking regions of ": null
    },
    {
        "Finland": "finland"
    },
    {
        ". When the music came to Norway it was first called ": null
    },
    {
        "Svensktoppar": "svensktoppen"
    },
    {
        " . The main audience for dansband music is middleaged adults. The music is often performed live by the bands at venues where the main interest of the audience is dancing, rather than watching the performance on stage. However, many dansbands also record albums and singles. The band Ole Ivars scored a 42 hit with the song Jag trodde änglarna fanns together with med ": null
    },
    {
        "Kikki Danielsson": "kikki danielsson"
    },
    {
        ". Another famous Norwegian song, ": null
    },
    {
        "Lys og varme": "lys og varme"
    },
    {
        " , which was written by Åge Alexandersen, became a popular dansband song in Sweden, as Ljus och värme .       Electronic music includes sounds that are produced using ": null
    },
    {
        "electronic technology": "electronic technology"
    },
    {
        ",  including synthesizers, drum machines, samplers and computers. Norwegian electronic music is dominated by ": null
    },
    {
        "Röyksopp": "röyksopp"
    },
    {
        ", which is a duo from ": null
    },
    {
        "Tromsø": "tromsø"
    },
    {
        " playing contemporary electronic music.      Well-known musicians are also ": null
    },
    {
        "Bel Canto": "bel canto"
    },
    {
        ", one of the Norwegian bands playing electronic music,  and ": null
    },
    {
        "Biosphere": "biosphere"
    },
    {
        ", a musician playing ambient electronic music.  Other popular Norwegian musicians playing electronic music are for example ": null
    },
    {
        "Ralph Myerz": "ralph myerz"
    },
    {
        " and The Jack Herren Band, ": null
    },
    {
        "Lindstrøm": "hans-peter lindstrøm"
    },
    {
        ", ": null
    },
    {
        "Prins Thomas": "prins thomas"
    },
    {
        ", ": null
    },
    {
        "Todd Terje": "todd terje"
    },
    {
        ", ": null
    },
    {
        "Datarock": "datarock"
    },
    {
        ", ": null
    },
    {
        "Flunk": "flunk"
    },
    {
        ", Bermuda Triangle, ": null
    },
    {
        "Frost": "frost"
    },
    {
        ", ": null
    },
    {
        "Bjørn Torske": "bjørn torske"
    },
    {
        ", ": null
    },
    {
        "Sternklang": "rune brøndbo"
    },
    {
        " and ": null
    },
    {
        "TeeBee": "teebee"
    },
    {
        "     From 42 many Norwegian producers started gaining international success. One of the most important names is ": null
    },
    {
        "Kygo": "kygo"
    },
    {
        ",  who first with his remixes and then with his debut single Firestone and album ": null
    },
    {
        "Cloud Nine": "cloud nine"
    },
    {
        " gained international success and became one of the most influential producers in EDM and in the genre of ": null
    },
    {
        "tropical house": "tropical house"
    },
    {
        ".     Although its weather many important Norwegian producers belong to this genre such as Kygo, ": null
    },
    {
        "Matoma": "matoma"
    },
    {
        ", ": null
    },
    {
        "Broiler": "broiler"
    },
    {
        " and ": null
    },
    {
        "SeeB": "seeb"
    },
    {
        "     Other notable names are ": null
    },
    {
        "Alan Walker": "alan walker"
    },
    {
        ", ": null
    },
    {
        "Lido": "lido"
    },
    {
        " and ": null
    },
    {
        "Cashmere Cat": "cashmere cat"
    },
    {
        ".     A Norwegian festival called ": null
    },
    {
        "Insomnia": "insomnia festival"
    },
    {
        " is specialized in innovative electronic music, and it is organized every year in Tromsø in the north of Norway.      During the 42s worldwide electronic music boom, DJ and producer Fehrplay signed to international labels Pryda Friends and Anjunabeats and played at the Creamfields festival in 42       Hip-hop music is a genre of rhythmic music that is often accompanied by rapping.  Hip-hop came to Norway in the summer of 42 with the movie ": null
    },
    {
        "Beat Street": "beat street"
    },
    {
        " that was shown in Norwegian cinemas. Hip-hop soon became a small but eager subculture and it expanded from breakdance and ": null
    },
    {
        "graffiti culture": "graffiti culture"
    },
    {
        " to also rap music. In the 42s and 42s Norwegian rap was mainly in English, and the Norwegian hip-hop scene was strongly influenced by the American one. In the beginning of the 42st century, many artists started to use Norwegian instead of English, and at the same time rapping in different Norwegian dialects started to become general. The band called Tungtvann was one of the first ones that rapped in their own dialect. In the mid42s, hip-hop became a more mainstream genre, and many young people started to question what real hip-hop was while new and unconventional groups such as ": null
    },
    {
        "Side Brok": "side brok"
    },
    {
        " emerged. Lately also multilingual and multicultural Norwegian groups with minority backgrounds, such as ": null
    },
    {
        "Karpe Diem": "karpe diem"
    },
    {
        " and Minoritet have succeeded in becoming popular.      Other popular hip-hop artists and groups in Norway are for example ": null
    },
    {
        "Warlocks": "warlocks"
    },
    {
        ", ": null
    },
    {
        "Tommy Tee": "tommy tee"
    },
    {
        ", ": null
    },
    {
        "Stella Mwangi": "stella mwangi"
    },
    {
        ", Klovner i Kamp, ": null
    },
    {
        "Gatas Parlament": "gatas parlament"
    },
    {
        ", ": null
    },
    {
        "Paperboys": "paperboys"
    },
    {
        ", ": null
    },
    {
        "Madcon": "madcon"
    },
    {
        ", ": null
    },
    {
        "Erik og Kriss": "erik og kriss"
    },
    {
        ", Jaa42 & OnkelP and Thomax. ": null
    },
    {
        "Tommy Tee": "tommy tee"
    },
    {
        ", known as the godfather of Norwegian hip-hop, is the owner of the leading Norwegian hip-hop label Tee Productions located in Oslo.  ": null
    },
    {
        "Madcon": "madcon"
    },
    {
        ", a Norwegian hip-hop and reggae duo, was established in 42 They gained more and more popularity in the last decade and are now famous internationally in and also outside of Europe.     A festival where hip-hop music can be found – although it is not only for hip-hop – is the Bergenfest, which takes place every year in the Bergenhus Festning in Bergen, Norway. Other festivals where hip-hop artists can appear are ": null
    },
    {
        "Hove Festival": "hove festival"
    },
    {
        " in ": null
    },
    {
        "Færvik": "færvik"
    },
    {
        " close to ": null
    },
    {
        "Arendal": "arendal"
    },
    {
        " and Øya Festival in ": null
    },
    {
        "Oslo": "oslo"
    },
    {
        ".       In 42 the so-called Negerkapellet toured Norway, as a result of ": null
    },
    {
        "Geo Jackson": "geo jackson"
    },
    {
        "s efforts.      Jazz came to Europe after the first World War and, in that time, the term jazz was commonly used to describe everything new and hip. The first foreign jazz orchestra came to Norway in 42 and the emergence of the saxophone among Norwegian jazz players was observed in 42 Soon the typical Norwegian jazz band developed, which consists of one or two saxophones, violin, piano, ": null
    },
    {
        "banjo": "banjo"
    },
    {
        " and drums.   Funny Boys made the first serious record of jazz music in 42 However, the economic crisis of the 42s weakened the further development of Norwegian jazz bands. From the 42s on, the violin started to play a more fundamental role in Norwegian jazz.   In recent years Norway has also become a major force in world jazz.   Jazz plays an important role in everyday Norwegian music life, and can be heard in bars, cafes, and in the streets. Oslo is the center of todays Norwegian jazz.   Pioneers of Norwegian jazz including ": null
    },
    {
        "Jan Garbarek": "jan garbarek"
    },
    {
        ". His cool, almost ambient approach is typical of Norwegian jazz, although recently there have been moves to build bridges with electronica and post-rock. He, too, has linked jazz with traditional Norwegian music, as evidenced in his recording Rosenfole with acclaimed Norwegian traditional-style singer, ": null
    },
    {
        "Agnes Buen Garnås": "agnes buen garnås"
    },
    {
        ". His daughter, ": null
    },
    {
        "Anja Garbarek": "anja garbarek"
    },
    {
        ", is one of the artists that has renovated the jazz scene, combining sweet melodies with electronic sounds and pop beats. The work of the Christian Wallumrod Ensemble serves as a leading example of contemporary Norwegian jazz, along with ECM artists ": null
    },
    {
        "Trygve Seim": "trygve seim"
    },
    {
        " and ": null
    },
    {
        "Frode Haltli": "frode haltli"
    },
    {
        ". Other contemporary Norwegian jazz stars include a group ": null
    },
    {
        "Supersilent": "supersilent"
    },
    {
        ", a drummer ": null
    },
    {
        "Jon Christensen": "jon christensen"
    },
    {
        ", a guitarist ": null
    },
    {
        "Terje Rypdal": "terje rypdal"
    },
    {
        ", a pianist ": null
    },
    {
        "Bugge Wesseltoft": "bugge wesseltoft"
    },
    {
        ", a percussionist ": null
    },
    {
        "Paal Nilssen-Love": "paal nilssen-love"
    },
    {
        ", bassist ": null
    },
    {
        "Ingebrigt Håker Flaten": "ingebrigt håker flaten"
    },
    {
        ", trumpeter ": null
    },
    {
        "Nils Petter Molvaer": "nils petter molvaer"
    },
    {
        ", and an experimental jazz band ": null
    },
    {
        "Jaga Jazzist": "jaga jazzist"
    },
    {
        ". Many of these artists record for the seminal jazz label ": null
    },
    {
        "ECM": "ecm records"
    },
    {
        ". However some of the more modern artists record for the newer Norwegian labels ": null
    },
    {
        "Rune Grammofon": "rune grammofon"
    },
    {
        ", ": null
    },
    {
        "Losen Records": "losen records"
    },
    {
        ", ": null
    },
    {
        "Inner Ear": "inner ear"
    },
    {
        ", ": null
    },
    {
        "Curling Legs": "curling legs"
    },
    {
        ", ": null
    },
    {
        "Jazzaway Records": "jazzaway records"
    },
    {
        ", ": null
    },
    {
        "All Ice Records": "all ice records"
    },
    {
        ", ": null
    },
    {
        "Ponca Jazz Records": "ponca jazz records"
    },
    {
        ", ": null
    },
    {
        "NorCD": "norcd"
    },
    {
        ", ": null
    },
    {
        "Jazzland Records": "jazzland recordings"
    },
    {
        " and ": null
    },
    {
        "Smalltown Superjazzz": "smalltown superjazzz"
    },
    {
        ".       Norwegian popular music has come from the many urban scenes such as the Bergen scene or Oslos underground. The strengthening of Norwegian popular music has been brought by the growth of festivals, the many new independent record labels, a new generation of eager and talented music industry professionals as well as more supportive domestic media.   The establishment of NRK in 42 took part in bringing out the spread of popular music. Additionally, from this time on, listening to British and North American radio stations, along with an import of jazz and rock records, widened the musical tastes of most Norwegians.     By:larm is one of the good examples of festival that takes to promoting popular music in Norway. This music event holds both of conference and a music festival. Norwegian and foreign music industries can meet in the conference, and there is some seminars and debate. Most of musicians who play in the festival are up-and –coming artists.   Besides, music award in Norway, such like ": null
    },
    {
        "Spellemanprisen": "spellemanprisen"
    },
    {
        ", and TV shows like ": null
    },
    {
        "Kjempesjansen": "kjempesjansen"
    },
    {
        ", may have also some influence on popular music in Norway.     Troubadour ": null
    },
    {
        "Alf Prøysen": "alf prøysen"
    },
    {
        " stands out as a brilliant songwriter of the 42s, 42s and 42s, his songs often featuring lyrics connected with the local culture of the Hedmark area. Many of his songs have become popular classics. In the 42s, ": null
    },
    {
        "the Monn Keys": "the monn keys"
    },
    {
        ", featuring ": null
    },
    {
        "Egil Monn-Iversen": "egil monn-iversen"
    },
    {
        ", ": null
    },
    {
        "Arne Bendiksen": "arne bendiksen"
    },
    {
        ", ": null
    },
    {
        "Sølvi Wang": "sølvi wang"
    },
    {
        ", ": null
    },
    {
        "Per Asplin": "per asplin"
    },
    {
        " and ": null
    },
    {
        "Oddvar Sanne": "oddvar sanne"
    },
    {
        ", became one of the most popular groups. Monn-Iversen  and ": null
    },
    {
        "Bendiksen": "bendiksen"
    },
    {
        " were leading figures in Norwegian popular music throughout the 42s.     There are not so many Norwegian popular artists that have made it to the international market. However, in the 42s, Norwegian popular music band, ": null
    },
    {
        "a-ha": "a-ha"
    },
    {
        ", had meteoric international success when the trios 42 debut ": null
    },
    {
        "Take On Me": "take on me"
    },
    {
        " went to number one in the US and the UK. Known as the biggest music export from Norway, a-ha has sold more than 42 million records worldwide and holds the ": null
    },
    {
        "Guinness World Record": "guinness world record"
    },
    {
        " for drawing the largest paying audience at a pop concert.  Their highly successful 42 ": null
    },
    {
        "Ending on a High Note Tour": "ending on a high note tour"
    },
    {
        " marked the end of a-has 42-year career. They are scheduled to perform at Rock in Rio 42 in response to popular demand. Since the mid42s, Norwegian popular music has experienced a thorough transformation from a small and domestically oriented scene into a rich and diverse society of musicians and industry reps that have their sights set on the international stage. ": null
    },
    {
        "Sissel Kyrkjebø": "sissel kyrkjebø"
    },
    {
        ", the singer commonly known as Sissel , has also reached a level of worldwide popularity, especially after her voice appeared on the soundtrack for the 42 film Titanic. Highlights of her career include singing the Olympic hymn at the ": null
    },
    {
        "42 Winter Olympics": "1994 winter olympics"
    },
    {
        " in ": null
    },
    {
        "Lillehammer": "lillehammer"
    },
    {
        ", representing Norway at the ": null
    },
    {
        "Nobel Peace Prize Concert": "nobel peace prize concert"
    },
    {
        ", and performing at the invitation of tenor greats ": null
    },
    {
        "Plácido Domingo": "plácido domingo"
    },
    {
        " and ": null
    },
    {
        "José Carreras": "josé carreras"
    },
    {
        " at the first Christmas concert in Moscow after the fall of the Soviet Union.     Some of the most successful music artists from Norway in recent years are ": null
    },
    {
        "Susanne Sundfør": "susanne sundfør"
    },
    {
        ", ": null
    },
    {
        "Rebekka Karijord": "rebekka karijord"
    },
    {
        ", ": null
    },
    {
        "kaada": "kaada"
    },
    {
        ", ": null
    },
    {
        "Espen Lind": "espen lind"
    },
    {
        ", ": null
    },
    {
        "Furia Norway": "furia norway"
    },
    {
        ", ": null
    },
    {
        "Bertine Zetlitz": "bertine zetlitz"
    },
    {
        ", ": null
    },
    {
        "Marcus and Martinus": "marcus and martinus"
    },
    {
        ", ": null
    },
    {
        "M42M": "m2m"
    },
    {
        ", ": null
    },
    {
        "Marion Raven": "marion raven"
    },
    {
        " also known in Norway as Marion Ravn, ": null
    },
    {
        "Marit Larsen": "marit larsen"
    },
    {
        ", ": null
    },
    {
        "Kings of Convenience": "kings of convenience"
    },
    {
        ", ": null
    },
    {
        "Erlend Øye": "erlend øye"
    },
    {
        ", ": null
    },
    {
        "Minor Majority": "minor majority"
    },
    {
        ", ": null
    },
    {
        "DSound": "dsound"
    },
    {
        ", ": null
    },
    {
        "Datarock": "datarock"
    },
    {
        ", ": null
    },
    {
        "Maria Haukaas Storeng": "maria haukaas storeng"
    },
    {
        ", ": null
    },
    {
        "Maria Solheim": "maria solheim"
    },
    {
        ", ": null
    },
    {
        "Lene Marlin": "lene marlin"
    },
    {
        ", ": null
    },
    {
        "Margaret Berger": "margaret berger"
    },
    {
        ", ": null
    },
    {
        "Kurt Nilsen": "kurt nilsen"
    },
    {
        ", ": null
    },
    {
        "Annie": "annie"
    },
    {
        ", ": null
    },
    {
        "Sondre Lerche": "sondre lerche"
    },
    {
        ", ": null
    },
    {
        "Maria Mena": "maria mena"
    },
    {
        ", ": null
    },
    {
        "Maria Arredondo": "maria arredondo"
    },
    {
        ", ": null
    },
    {
        "TNT": "tnt"
    },
    {
        ", ": null
    },
    {
        "Flunk": "flunk"
    },
    {
        ", ": null
    },
    {
        "Venke Knutson": "venke knutson"
    },
    {
        ", ": null
    },
    {
        "Thomas Dybdahl": "thomas dybdahl"
    },
    {
        ", ": null
    },
    {
        "Postgirobygget": "postgirobygget"
    },
    {
        ", ": null
    },
    {
        "Savoy": "savoy"
    },
    {
        ", ": null
    },
    {
        "Aleksander With": "aleksander with"
    },
    {
        " and ": null
    },
    {
        "Wig Wam": "wig wam"
    },
    {
        " and ": null
    },
    {
        "Jorn": "jorn"
    },
    {
        " . With a wide range of highly active bands, record labels, venues and festivals, more is going on in Norwegian popular music than ever before.       In recent years artists like ": null
    },
    {
        "Gåte": "gåte"
    },
    {
        " and ": null
    },
    {
        "Odd Nordstoga": "odd nordstoga"
    },
    {
        " have made folk music more accessible to younger crowds. Gåte fused folk music with metal and became very popular. ": null
    },
    {
        "Lumsk": "lumsk"
    },
    {
        " is another band mixing Norwegian traditional folk music with metal. The most famous Sami singer is undoubtedly ": null
    },
    {
        "Mari Boine": "mari boine"
    },
    {
        ", who sings a type of minimalist folk-rock with ": null
    },
    {
        "joik": "yoik"
    },
    {
        " roots. ": null
    },
    {
        "Karl Seglem": "karl seglem"
    },
    {
        " is a ": null
    },
    {
        "Norwegian": "norway"
    },
    {
        " musician and composer who plays ": null
    },
    {
        "sax": "saxophone"
    },
    {
        " and ": null
    },
    {
        "bukkehorn": "bukkehorn"
    },
    {
        ".   A well known folk rock band called ": null
    },
    {
        "Plumbo": "plumbo"
    },
    {
        " has made an impact the last few years with songs like Mökkamann and especially Ola Nordmann , which was their song of choice when they participated in Melody Grand Prix 42 Other notable acts include the Norwegian band ": null
    },
    {
        "Wardruna": "wardruna"
    },
    {
        ", that creates music based around ": null
    },
    {
        "Nordic Spiritualism": "nordic spiritualism"
    },
    {
        ", and ": null
    },
    {
        "Sturle Dagsland": "sturle dagsland"
    },
    {
        ".            Norway is famous for black metal. Though not initially created in Norway, Norwegian bands and musicians have helped to develop the genre, influenced by bands like ": null
    },
    {
        "Bathory": "bathory"
    },
    {
        ", ": null
    },
    {
        "Venom": "venom"
    },
    {
        " and ": null
    },
    {
        "Mercyful Fate": "mercyful fate"
    },
    {
        ". Norways early black metal music was quite varied in experimentation and innovation—some bands  focused on creating a dark sound, others focused on using Viking elements , and others  included the use of keyboards to create the subgenre called symphonic black metal. However, the use of keyboards is not uncommon in black metal in general. Most bands tune in the key of E and the lyrics focus on themes like darkness, cold, sorrow, depression, evil, satanism and Norse Paganism. Mayhem is one of the most important black metal bands as it has helped to define the content of the genre. It was the center of a cult and the band set standards for extremity, for example in encouraging violence against churches. The leader of Mayhem, Øystein Euronymous Aarseth, clashed with bandmate Varg Count Grishnackh Vikernes . This eventually lead to Vikernes killing Aarseth. Other controversial events in this scene include the ": null
    },
    {
        "suicide": "suicide"
    },
    {
        " of former ": null
    },
    {
        "Mayhem": "mayhem"
    },
    {
        " vocalist ": null
    },
    {
        "Per Yngve Dead Ohlin": "per yngve ohlin"
    },
    {
        " in 42 and the murder of a homosexual man in ": null
    },
    {
        "Lillehammer": "lillehammer"
    },
    {
        ", ": null
    },
    {
        "Norway": "norway"
    },
    {
        " by then-": null
    },
    {
        "Emperor": "emperor"
    },
    {
        " drummer ": null
    },
    {
        "Bård Faust Eithun": "faust"
    },
    {
        " in 42   After Vikernes confinement, the Norwegian black metal scene moved to a more open and imaginative environment, and in 42 the second wave of Norwegian black metal began. Black metal which had once been an extremely underground phenomenon in its early days became more well known around the world. The focus was no longer laid on death threats and burning churches, although most bands today still lie towards Satanism or are atheists. Modern lyrics still consist of themes concerning evil, Norse mythology, sex, violence and war. Most Norwegian black metal bands sign with companies in the US and England. Dimmu Borgir even uses elements of classical music to expand their music to a wide range of audiences. As a result, their records show great commercial success, especially in the US. In the early days, Norwegian black metal songs were recorded on four-track tapes, but in recent times, the music has become more sophisticated. With better technology, the quality of music has become better, some critics say, and the musicians, of whom many have a background in classical music, are highly talented and well educated, though many believe Black Metal should stay underground, obscure and raw. What makes Norwegian black metal unique in comparison to other countries, is the fact that it has an almost inaudible echo that warns of magic and evil. Black metal bands from other countries have often tried to reproduce Norwegian black metal sounds but they have not been successful. Norwegian black metal has and always had a special sound, and as it keeps on being innovative and new, it sells quite well around the world. Reading list:   Hagen, Ross: Norwegian style, ideology, and mythology in Norwegian Black Metal, 42     Beste, Peter: True Norwegian Black Metal: we turn the night. New York: Vice, 42   Ledang Martin & Aasdal Pål: Once upon a time in Norway: the history of Mayhem and the rise of Norwegian Black Metal. Oslo, Another World Entertainment 42   Moynihan Michael & Søderlind Didrik: Lord of Chaos: The bloody Rise of the Satanic metal Underground. Feral House, 42   Olson, Benjamin Hedge: I am the Black Wizards: Multiplicity, mysticism and identity in black metal music and culture. Bowling Green State University, May 42   Documental: TRUE NORWEGIAN BLACK METAL          Norwegian black metal bands include:       ": null
    },
    {
        "42": "1349"
    },
    {
        " Arcturus": "arcturus"
    },
    {
        " Aura Noir": "aura noir"
    },
    {
        " Borknagar": "borknagar"
    },
    {
        " Burzum": "burzum"
    },
    {
        " Carpathian Forest": "carpathian forest"
    },
    {
        " Darkthrone": "darkthrone"
    },
    {
        " Dimmu Borgir": "dimmu borgir"
    },
    {
        " Dødheimsgard": "dødheimsgard"
    },
    {
        " Emperor": "emperor"
    },
    {
        " Enslaved": "enslaved"
    },
    {
        " Gehenna": "gehenna"
    },
    {
        " Gorgoroth": "gorgoroth"
    },
    {
        " Hades Almighty": "hades almighty"
    },
    {
        " I": "i"
    },
    {
        "    Helheim": "helheim"
    },
    {
        " Ihsahn": "ihsahn"
    },
    {
        " Ildjarn": "ildjarn"
    },
    {
        " Immortal": "immortal"
    },
    {
        " In The Woods...": "in the woods..."
    },
    {
        " Isengard": "isengard"
    },
    {
        " Kampfar": "kampfar"
    },
    {
        " Keep of Kalessin": "keep of kalessin"
    },
    {
        " Khold": "khold"
    },
    {
        " Koldbrann": "koldbrann"
    },
    {
        " The Kovenant": "the kovenant"
    },
    {
        " Limbonic Art": "limbonic art"
    },
    {
        " Manes": "manes"
    },
    {
        " Mayhem": "mayhem"
    },
    {
        "    Nattefrost": "nattefrost"
    },
    {
        " Old Mans Child": "old mans child"
    },
    {
        " Peccatum": "peccatum"
    },
    {
        " Ragnarok": "ragnarok"
    },
    {
        " Satyricon": "satyricon"
    },
    {
        " Taake": "taake"
    },
    {
        " Thorns": "thorns"
    },
    {
        " Thou Shalt Suffer": "thou shalt suffer"
    },
    {
        " Tsjuder": "tsjuder"
    },
    {
        " Ulver": "ulver"
    },
    {
        " Urgehal": "urgehal"
    },
    {
        " Vreid": "vreid"
    },
    {
        " Windir": "windir"
    },
    {
        " Zyklon-B": "zyklon-b"
    },
    {
        "        . In Oslo, many goth metal music clubs can be found.   The large Norwegian gothic metal scene includes bands like:   ": null
    },
    {
        "Fleurety": "fleurety"
    },
    {
        " Leaves Eyes": "leaves eyes"
    },
    {
        "   Lumsk": "lumsk"
    },
    {
        " Midnattsol": "midnattsol"
    },
    {
        "   Myriads": "myriads"
    },
    {
        " The Sins of Thy Beloved": "the sins of thy beloved"
    },
    {
        " Sirenia": "sirenia"
    },
    {
        " Tristania": "tristania"
    },
    {
        " Theatre of Tragedy": "theatre of tragedy"
    },
    {
        " Ved Buens Ende": "ved buens ende"
    },
    {
        " Virus": "virus"
    },
    {
        "     Blood Red Throne": "blood red throne"
    },
    {
        ", ": null
    },
    {
        "Cadaver": "cadaver"
    },
    {
        ", ": null
    },
    {
        "Carpe Tenebrum": "carpe tenebrum"
    },
    {
        ", ": null
    },
    {
        "Myrkskog": "myrkskog"
    },
    {
        ", ": null
    },
    {
        "Aeternus": "aeternus"
    },
    {
        ", ": null
    },
    {
        "Zyklon": "zyklon"
    },
    {
        ", Fester and ": null
    },
    {
        "Darkthrone": "darkthrone"
    },
    {
        "s first album  Soulside Journey .   Freeborn R. 42 A selective discography of Scandinavian heavy metal music. Notes - Quarterly Journal of the Music Library Association 42: 4242   Pedersen J. 42 Look to hell! Look to Norway! Listen to Norway 42: 4242   Lysvåg C. 42 Dimmu Borgir: A demonically high entry on the Billboard list. Retrieved on March 42 42 from   ": null
    }
]