[
    {
        "In genetics, a mutagen is a physical or chemical agent that changes the genetic material, usually ": null
    },
    {
        "DNA": "Dna"
    },
    {
        ", of an ": null
    },
    {
        "organism": "Organism"
    },
    {
        " and thus increases the frequency of ": null
    },
    {
        "mutations": "Mutation"
    },
    {
        "above the natural background level. As many mutations can cause ": null
    },
    {
        "cancer": "Cancer"
    },
    {
        ", mutagens are therefore also likely to be ": null
    },
    {
        "carcinogen": "Carcinogen"
    },
    {
        "s, although not always necessarily so. All mutagens have characteristic ": null
    },
    {
        "mutational signatures": "Mutational Signatures"
    },
    {
        " with some chemicals becoming mutagenic through cellular processes. Not all mutations are caused by mutagens: so-called spontaneous mutations occur due to spontaneous ": null
    },
    {
        "hydrolysis": "Hydrolysis"
    },
    {
        ", ": null
    },
    {
        "errors": "Dna Error"
    },
    {
        " in ": null
    },
    {
        "DNA replication": "Dna Replication"
    },
    {
        ", repair and ": null
    },
    {
        "recombination": "Genetic Recombination"
    },
    {
        ".       The first mutagens to be identified were ": null
    },
    {
        "carcinogen": "Carcinogen"
    },
    {
        "s, substances that were shown to be linked to ": null
    },
    {
        "cancer": "Cancer"
    },
    {
        ". ": null
    },
    {
        "Tumors": "Tumor"
    },
    {
        "were described more than 2,000 years before the discovery of ": null
    },
    {
        "chromosomes": "Chromosome"
    },
    {
        "and ": null
    },
    {
        "DNA": "Dna"
    },
    {
        "; in 500 B.C., the ": null
    },
    {
        "Greek": "Greece"
    },
    {
        " physician": "Physician"
    },
    {
        " Hippocrates": "Hippocrates"
    },
    {
        " named tumors resembling a crab karkinos , meaning crab.  In 1567, Swiss physician ": null
    },
    {
        "Paracelsus": "Paracelsus"
    },
    {
        " suggested that an unidentified substance in mined ore  caused a wasting disease in miners,  and in England, in 1761, ": null
    },
    {
        "John Hill": "John Hill"
    },
    {
        " made the first direct link of cancer to chemical substances by noting that excessive use of ": null
    },
    {
        "snuff": "Snuff"
    },
    {
        " may cause nasal cancer.  In 1775, Sir ": null
    },
    {
        "Percivall Pott": "Percivall Pott"
    },
    {
        " wrote a paper on the high incidence of scrotal cancer in ": null
    },
    {
        "chimney sweep": "Chimney Sweep"
    },
    {
        "s, and suggested chimney ": null
    },
    {
        "soot": "Soot"
    },
    {
        " as the cause of scrotal cancer.  In 1915, Yamagawa and Ichikawa showed that repeated application of coal tar to rabbits ears produced malignant cancer.  Subsequently, in the 1930s the carcinogen component in coal tar was identified as a ": null
    },
    {
        "polyaromatic hydrocarbon": "Polycyclic Aromatic Hydrocarbon"
    },
    {
        " , ": null
    },
    {
        "benzo[a]pyrene": "Benzopyrene"
    },
    {
        ".  Polyaromatic hydrocarbons are also present in soot, which was suggested to be a causative agent of cancer over 150 years earlier.     The association of exposure to radiation and cancer had been observed as early as 1902, six years after the discovery of X-ray by ": null
    },
    {
        "Wilhelm Röntgen": "Wilhelm Röntgen"
    },
    {
        " and radioactivity by ": null
    },
    {
        "Henri Becquerel": "Henri Becquerel"
    },
    {
        ".  ": null
    },
    {
        "Georgii Nadson": "Georgii Nadson"
    },
    {
        " and German Filippov were the first who created fungi mutants under ": null
    },
    {
        "ionizing radiation": "Ionizing Radiation"
    },
    {
        " in 1925.   The mutagenic property of mutagens was first demonstrated in 1927, when ": null
    },
    {
        "Hermann Muller": "Hermann Joseph Muller"
    },
    {
        " discovered that ": null
    },
    {
        "x-rays": "X-Ray"
    },
    {
        "can cause genetic mutations in ": null
    },
    {
        "fruit flies": "Drosophila Melanogaster"
    },
    {
        ", producing ": null
    },
    {
        "phenotypic": "Phenotype"
    },
    {
        " mutants as well as observable changes to the chromosomes,   visible due to presence of enlarged ": null
    },
    {
        "polytene chromosomes": "Polytene Chromosome"
    },
    {
        " in fruit fly salivary glands.  His collaborator Edgar Altenburg also demonstrated the mutational effect of UV radiation in 1928.  Muller went on to use x-rays to create ": null
    },
    {
        "Drosophila": "Drosophila"
    },
    {
        " mutants that he used in his studies of ": null
    },
    {
        "genetics": "Genetics"
    },
    {
        ".  He also found that X-rays not only mutate ": null
    },
    {
        "genes": "Gene"
    },
    {
        "in fruit flies, but also have effects on the genetic makeup of humans.   Similar work by ": null
    },
    {
        "Lewis Stadler": "Lewis Stadler"
    },
    {
        " also showed the mutational effect of X-rays on barley in 1928,  and ": null
    },
    {
        "ultraviolet": "Ultraviolet"
    },
    {
        " radiation on maize in 1936.  The effect of sunlight had previously been noted in the nineteenth century where rural outdoor workers and sailors were found to be more prone to skin cancer.      Chemical mutagens were not demonstrated to cause mutation until the 1940s, when ": null
    },
    {
        "Charlotte Auerbach": "Charlotte Auerbach"
    },
    {
        " and ": null
    },
    {
        "J. M. Robson": "J. M. Robson"
    },
    {
        " found that ": null
    },
    {
        "mustard gas": "Mustard Gas"
    },
    {
        " can cause ": null
    },
    {
        "mutations": "Mutation"
    },
    {
        "in fruit flies.  A large number of chemical mutagens have since been identified, especially after the development of the ": null
    },
    {
        "Ames test": "Ames Test"
    },
    {
        " in the 1970s by ": null
    },
    {
        "Bruce Ames": "Bruce Ames"
    },
    {
        " that screens for mutagens and allows for preliminary identification of carcinogens.   Early studies by Ames showed around 90% of known carcinogens can be identified in Ames test as mutagenic ,   and ~80% of the mutagens identified through Ames test may also be carcinogens.   Mutagens are not necessarily carcinogens, and vice versa. ": null
    },
    {
        "Sodium azide": "Sodium Azide"
    },
    {
        " for example may be mutagenic , but it has not been shown to be carcinogenic.           Mutagens can cause changes to the DNA and are therefore ": null
    },
    {
        "genotoxic": "Genotoxicity"
    },
    {
        ". They can affect the transcription and replication of the DNA, which in severe cases can lead to cell death. The mutagen produces mutations in the DNA, and deleterious mutation can result in aberrant, impaired or loss of function for a particular gene, and accumulation of mutations may lead to cancer. Mutagens may therefore be also carcinogens. However, some mutagens exert their mutagenic effect through their metabolites, and therefore whether such mutagens actually become carcinogenic may be dependent on the metabolic processes of an organism, and a compound shown to be mutagenic in one organism may not necessarily be carcinogenic in another.      Different mutagens act on the DNA differently. Powerful mutagens may result in chromosomal instability,  causing chromosomal breakages and rearrangement of the chromosomes such as ": null
    },
    {
        "translocation": "Chromosomal Translocation"
    },
    {
        ", ": null
    },
    {
        "deletion": "Deletion"
    },
    {
        ", and ": null
    },
    {
        "inversion": "Chromosomal Inversion"
    },
    {
        ". Such mutagens are called ": null
    },
    {
        "clastogen": "Clastogen"
    },
    {
        "s.     Mutagens may also modify the DNA sequence; the changes in ": null
    },
    {
        "nucleic acid": "Nucleic Acid"
    },
    {
        " sequences by mutations include substitution of ": null
    },
    {
        "nucleotide": "Nucleotide"
    },
    {
        "base-pairs": "Base-Pair"
    },
    {
        "and ": null
    },
    {
        "insertions": "Insertional Mutation"
    },
    {
        " and ": null
    },
    {
        "deletions": "Deletion"
    },
    {
        " of one or more nucleotides in DNA sequences. Although some of these mutations are lethal or cause serious disease, many have minor effects as they do not result in residue changes that have significant effect on the structure and function of the ": null
    },
    {
        "protein": "Protein"
    },
    {
        "s. Many mutations are ": null
    },
    {
        "silent mutation": "Silent Mutation"
    },
    {
        "s, causing no visible effects at all, either because they occur in non-coding or non-functional sequences, or they do not change the ": null
    },
    {
        "amino-acid": "Amino-Acid"
    },
    {
        " sequence due to the ": null
    },
    {
        "redundancy": "Redundancy"
    },
    {
        " of ": null
    },
    {
        "codon": "Codon"
    },
    {
        "s.     Some mutagens can cause ": null
    },
    {
        "aneuploidy": "Aneuploidy"
    },
    {
        " and change the number of chromosomes in the cell. They are known as aneuploidogens.      In Ames test, where the varying concentrations of the chemical are used in the test, the dose response curve obtained is nearly always linear, suggesting that there may be no threshold for mutagenesis. Similar results are also obtained in studies with radiations, indicating that there may be ": null
    },
    {
        "no safe threshold": "Linear No-Threshold Model"
    },
    {
        " for mutagens. However, the no-threshold model is disputed with some arguing for a ": null
    },
    {
        "dose rate dependent threshold": "Threshold Model"
    },
    {
        " for mutagenesis.  Some have proposed that low level of some mutagens may stimulate the DNA repair processes and therefore may not necessarily be harmful. More recent approaches with sensitive analytical methods have shown that there may be non-linear or bilinear dose-responses for genotoxic effects, and that the activation of DNA repair pathways can prevent the occurrence of mutation arising from a low dose of mutagen.        Mutagens may be of physical, chemical or biological origin. They may act directly on the DNA, causing direct damage to the DNA, and most often result in replication error. Some however may act on the replication mechanism and chromosomal partition. Many mutagens are not mutagenic by themselves, but can form mutagenic metabolites through cellular processes, for example through the activity of the ": null
    },
    {
        "cytochrome P450": "Cytochrome P450"
    },
    {
        " system and other ": null
    },
    {
        "oxygenases": "Oxygenase"
    },
    {
        "such as ": null
    },
    {
        "cyclooxygenase": "Cyclooxygenase"
    },
    {
        ".  Such mutagens are called ": null
    },
    {
        "promutagens": "Promutagens"
    },
    {
        ".       ": null
    },
    {
        "Ionizing radiations": "Ionizing Radiation"
    },
    {
        "such as ": null
    },
    {
        "X-rays": "X-Rays"
    },
    {
        ", ": null
    },
    {
        "gamma rays": "Gamma Ray"
    },
    {
        "and ": null
    },
    {
        "alpha particles": "Alpha Particle"
    },
    {
        "cause DNA breakage and other damages. The most common lab sources include ": null
    },
    {
        "cobalt-60": "Cobalt-60"
    },
    {
        " and ": null
    },
    {
        "cesium-137": "Cesium-137"
    },
    {
        ".   ": null
    },
    {
        "Ultraviolet": "Ultraviolet"
    },
    {
        " radiations with wavelength above 260  nm are absorbed strongly by bases, producing ": null
    },
    {
        "pyrimidine dimers": "Pyrimidine Dimers"
    },
    {
        ", which can cause error in replication if left uncorrected.   ": null
    },
    {
        "Radioactive decay": "Radioactive Decay"
    },
    {
        ", such as ": null
    },
    {
        " 14 C": "Carbon-14"
    },
    {
        " in DNA which decays into ": null
    },
    {
        "nitrogen": "Nitrogen"
    },
    {
        ".          A large number of chemicals may interact directly with DNA. However, many such as PAHs, aromatic amines, benzene are not necessarily mutagenic by themselves, but through metabolic processes in cells they produce mutagenic compounds.     ": null
    },
    {
        "Reactive oxygen species": "Reactive Oxygen Species"
    },
    {
        " – These may be ": null
    },
    {
        "superoxide": "Superoxide"
    },
    {
        ", ": null
    },
    {
        "hydroxyl radicals": "Hydroxyl Radicals"
    },
    {
        " and ": null
    },
    {
        "hydrogen peroxide": "Hydrogen Peroxide"
    },
    {
        ", and large number of these highly reactive species are generated by normal cellular processes, for example as a by-products of mitochondrial ": null
    },
    {
        "electron transport": "Electron Transport Chain"
    },
    {
        ", or ": null
    },
    {
        "lipid peroxidation": "Lipid Peroxidation"
    },
    {
        ". As an example of the latter, 15-hydroperoxyicosatetraenocic acid, a natural product of cellular cyclooxygenases and lipoxygenases, breaks down to form 4-hydroxy-2-nonenal, 4-hydroperoxy-2-nonenal, 4-oxo-2-nonenal, and cis-4,5-epoxy-2-decanal; these bifunctional electophils are mutagenic in mammalian cells and may contribute to the development and/or progression of human cancers .  A number of mutagens may also generate these ROS. These ROS may result in the production of many base adducts, as well as DNA strand breaks and crosslinks.   ": null
    },
    {
        "Deaminating": "Deamination"
    },
    {
        " agents, for example ": null
    },
    {
        "nitrous acid": "Nitrous Acid"
    },
    {
        " which can cause transition mutations by converting ": null
    },
    {
        "cytosine": "Cytosine"
    },
    {
        " to ": null
    },
    {
        "uracil": "Uracil"
    },
    {
        ".   ": null
    },
    {
        "Polycyclic aromatic hydrocarbon": "Polycyclic Aromatic Hydrocarbon"
    },
    {
        " , when activated to diol-epoxides can bind to DNA and form adducts.   ": null
    },
    {
        "Alkylating": "Alkylation"
    },
    {
        " agents such as ": null
    },
    {
        "ethylnitrosourea": "Ethylnitrosourea"
    },
    {
        ". The compounds transfer methyl or ethyl group to bases or the backbone phosphate groups. Guanine when alkylated may be mispaired with thymine. Some may cause DNA crosslinking and breakages. ": null
    },
    {
        "Nitrosamines": "Nitrosamine"
    },
    {
        "are an important group of mutagens found in tobacco, and may also be formed in smoked meats and fish via the interaction of amines in food with nitrites added as preservatives. Other alkylating agents include ": null
    },
    {
        "mustard gas": "Sulfur Mustard"
    },
    {
        " and ": null
    },
    {
        "vinyl chloride": "Vinyl Chloride"
    },
    {
        ".   ": null
    },
    {
        "Aromatic amines": "Aromatic Amines"
    },
    {
        " and amides have been associated with carcinogenesis since 1895 when German physician ": null
    },
    {
        "Ludwig Rehn": "Ludwig Rehn"
    },
    {
        " observed high incidence of bladder cancer among workers in German synthetic aromatic amine dye industry. ": null
    },
    {
        "2-Acetylaminofluorene": "2-Acetylaminofluorene"
    },
    {
        ", originally used as a pesticide but may also be found in cooked meat, may cause cancer of the bladder, liver, ear, intestine, thyroid and breast.   ": null
    },
    {
        "Alkaloid": "Alkaloid"
    },
    {
        " from plants, such as those from ": null
    },
    {
        "Vinca": "Vinca"
    },
    {
        " species,  may be converted by metabolic processes into the active mutagen or carcinogen.   ": null
    },
    {
        "Bromine": "Bromine"
    },
    {
        " and some compounds that contain bromine in their chemical structure.    ": null
    },
    {
        "Sodium azide": "Sodium Azide"
    },
    {
        ", an ": null
    },
    {
        "azide": "Azide"
    },
    {
        " salt that is a common reagent in organic synthesis and a component in many car airbag systems   ": null
    },
    {
        "Psoralen": "Psoralen"
    },
    {
        " combined with ultraviolet radiation causes DNA cross-linking and hence chromosome breakage.   ": null
    },
    {
        "Benzene": "Benzene"
    },
    {
        ", an industrial solvent and precursor in the production of drugs, plastics, ": null
    },
    {
        "synthetic rubber": "Synthetic Rubber"
    },
    {
        " and dyes.       ": null
    },
    {
        "Base analog": "Base Analog"
    },
    {
        ", which can substitute for DNA bases during replication and cause transition mutations.       ": null
    },
    {
        "Intercalating agents": "Intercalation"
    },
    {
        ", such as ": null
    },
    {
        "ethidium bromide": "Ethidium Bromide"
    },
    {
        " and ": null
    },
    {
        "proflavine": "Proflavine"
    },
    {
        ", are molecules that may insert between bases in DNA, causing ": null
    },
    {
        "frameshift mutation": "Frameshift Mutation"
    },
    {
        " during replication. Some such as ": null
    },
    {
        "daunorubicin": "Daunorubicin"
    },
    {
        " may block transcription and replication, making them highly toxic to proliferating cells.       Many metals, such as ": null
    },
    {
        "arsenic": "Arsenic"
    },
    {
        ", ": null
    },
    {
        "cadmium": "Cadmium"
    },
    {
        ", ": null
    },
    {
        "chromium": "Chromium"
    },
    {
        ", ": null
    },
    {
        "nickel": "Nickel"
    },
    {
        " and their compounds may be mutagenic, but they may act, however, via a number of different mechanisms.  Arsenic, chromium, iron, and nickel may be associated with the production of ROS, and some of these may also alter the fidelity of DNA replication. Nickel may also be linked to DNA hypermethylation and ": null
    },
    {
        "histone": "Histone"
    },
    {
        " deacetylation, while some metals such as ": null
    },
    {
        "cobalt": "Cobalt"
    },
    {
        ", arsenic, nickel and cadmium may also affect DNA repair processes such as ": null
    },
    {
        "DNA mismatch repair": "Dna Mismatch Repair"
    },
    {
        ", and ": null
    },
    {
        "base": "Base Excision Repair"
    },
    {
        " and ": null
    },
    {
        "nucleotide excision repair": "Nucleotide Excision Repair"
    },
    {
        ".        ": null
    },
    {
        "Transposon": "Transposon"
    },
    {
        ", a section of DNA that undergoes autonomous fragment relocation/multiplication. Its insertion into chromosomal DNA disrupts functional elements of the genes.   ": null
    },
    {
        "Virus": "Virus"
    },
    {
        " – Virus DNA may be inserted into the genome and disrupts genetic function. Infectious agents have been suggested to cause cancer as early as 1908 by Vilhelm Ellermann and Oluf Bang,  and 1911 by ": null
    },
    {
        "Peyton Rous": "Peyton Rous"
    },
    {
        " who discovered the ": null
    },
    {
        "Rous sarcoma virus": "Rous Sarcoma Virus"
    },
    {
        ".    ": null
    },
    {
        "Bacteria": "Bacteria"
    },
    {
        " – some bacteria such as  Helicobacter pylori  cause inflammation during which oxidative species are produced, causing DNA damage and reducing efficiency of DNA repair systems, thereby increasing mutation.          ": null
    },
    {
        "Antioxidants": "Antioxidant"
    },
    {
        "are an important group of ": null
    },
    {
        "anticarcinogenic": "Anticarcinogenic"
    },
    {
        " compounds that may help remove ": null
    },
    {
        "ROS": "Reactive Oxygen Species"
    },
    {
        " or potentially harmful chemicals. These may be found naturally in ": null
    },
    {
        "fruits": "Fruit"
    },
    {
        "and ": null
    },
    {
        "vegetable": "Vegetable"
    },
    {
        "s.  Examples of antioxidants are ": null
    },
    {
        "vitamin A": "Vitamin A"
    },
    {
        " and its ": null
    },
    {
        "carotenoid": "Carotenoid"
    },
    {
        " precursors, ": null
    },
    {
        "vitamin C": "Vitamin C"
    },
    {
        ", ": null
    },
    {
        "vitamin E": "Vitamin E"
    },
    {
        ", ": null
    },
    {
        "polyphenol": "Polyphenol"
    },
    {
        "s, and various other compounds. ": null
    },
    {
        "β-Carotene": "Beta-Carotene"
    },
    {
        " is the red-orange colored compounds found in vegetables like ": null
    },
    {
        "carrots": "Carrot"
    },
    {
        "and ": null
    },
    {
        "tomato": "Tomato"
    },
    {
        "es. Vitamin C may prevent some cancers by inhibiting the formation of mutagenic ": null
    },
    {
        "N-nitroso": "N-Nitroso"
    },
    {
        " compounds . ": null
    },
    {
        "Flavonoid": "Flavonoid"
    },
    {
        "s, such as ": null
    },
    {
        "EGCG": "Epigallocatechin Gallate"
    },
    {
        " in ": null
    },
    {
        "green tea": "Green Tea"
    },
    {
        ", have also been shown to be effective antioxidants and may have anti-cancer properties. Epidemiological studies indicate that a diet rich in fruits and vegetables is associated with lower incidence of some cancers and longer life expectancy, however, the effectiveness of antioxidant supplements in cancer prevention in general is still the subject of some debate.       Other chemicals may reduce mutagenesis or prevent cancer via other mechanisms, although for some the precise mechanism for their protective property may not be certain. ": null
    },
    {
        "Selenium": "Selenium"
    },
    {
        ", which is present as a micronutrient in vegetables, is a component of important antioxidant enzymes such as gluthathione peroxidase. Many phytonutrients may counter the effect of mutagens; for example, ": null
    },
    {
        "sulforaphane": "Sulforaphane"
    },
    {
        " in vegetables such as ": null
    },
    {
        "broccoli": "Broccoli"
    },
    {
        " has been shown to be protective against ": null
    },
    {
        "prostate cancer": "Prostate Cancer"
    },
    {
        ".  Others that may be effective against cancer include ": null
    },
    {
        "indole-3-carbinol": "Indole-3-Carbinol"
    },
    {
        " from ": null
    },
    {
        "cruciferous vegetables": "Cruciferous Vegetables"
    },
    {
        " and ": null
    },
    {
        "resveratrol": "Resveratrol"
    },
    {
        " from red wine.      An effective precautionary measure an individual can undertake to protect themselves is by limiting exposure to mutagens such as UV radiations and tobacco smoke. In Australia, where people with pale skin are often exposed to strong sunlight, ": null
    },
    {
        "melanoma": "Melanoma"
    },
    {
        " is the most common cancer diagnosed in people aged 15–44 years.       In 1981, human epidemiological analysis by ": null
    },
    {
        "Richard Doll": "Richard Doll"
    },
    {
        " and ": null
    },
    {
        "Richard Peto": "Richard Peto"
    },
    {
        " indicated that smoking caused 30% of cancers in the US.  Diet is also thought to cause a significant number of cancer, and it has been estimated that around 32% of cancer deaths may be avoidable by modification to the diet.  Mutagens identified in food include ": null
    },
    {
        "mycotoxins": "Mycotoxin"
    },
    {
        "from food contaminated with fungal growths, such as ": null
    },
    {
        "aflatoxins": "Aflatoxins"
    },
    {
        " which may be present in contaminated peanuts and corn; ": null
    },
    {
        "heterocyclic amines": "Heterocyclic Amine"
    },
    {
        "generated in meat when cooked at high temperature; PAHs in charred meat and smoked fish, as well as in oils, fats, bread, and cereal;  and nitrosamines generated from nitrites used as food preservatives in ": null
    },
    {
        "cured meat": "Cured Meat"
    },
    {
        " such as ": null
    },
    {
        "bacon": "Bacon"
    },
    {
        " . Overly-browned starchy food such as bread, biscuits and potatoes can generate ": null
    },
    {
        "acrylamide": "Acrylamide"
    },
    {
        ", a chemical shown to cause cancer in animal studies.   Excessive ": null
    },
    {
        "alcohol consumption": "Alcohol And Cancer"
    },
    {
        " has also been linked to cancer; the possible mechanisms for its carcinogenicity include formation of the possible mutagen ": null
    },
    {
        "acetaldehyde": "Acetaldehyde"
    },
    {
        ", and the induction of the ": null
    },
    {
        "cytochrome P450": "Cytochrome P450"
    },
    {
        " system which is known to produce mutagenic compounds from promutagens.      For certain mutagens, such as dangerous chemicals and radioactive materials, as well as infectious agents known to cause cancer, government legislations and regulatory bodies are necessary for their control.        Many different systems for detecting mutagen have been developed.   Animal systems may more accurately reflect the metabolism of human, however, they are expensive and time-consuming , they are therefore not used as a first screen for mutagenicity or carcinogenicity.        Ames test – This is the most commonly used test, and  Salmonella typhimurium  strains deficient in ": null
    },
    {
        "histidine": "Histidine"
    },
    {
        " biosynthesis are used in this test. The test checks for mutants that can revert to wild-type. It is an easy, inexpensive and convenient initial screen for mutagens.   Resistance to 8-azaguanine in S. typhimurium – Similar to Ames test, but instead of reverse mutation, it checks for forward mutation that confer resistance to ": null
    },
    {
        "8-Azaguanine": "8-Azaguanine"
    },
    {
        " in a histidine revertant strain.   Escherichia coli systems – Both forward and reverse mutation detection system have been modified for use in  E. coli . ": null
    },
    {
        "Tryptophan": "Tryptophan"
    },
    {
        "-deficient mutant is used for the reverse mutation, while galactose utility or resistance to 5-methyltryptophan may be used for forward mutation.   DNA repair – E. coli and  Bacillus subtilis  strains deficient in DNA repair may be used to detect mutagens by their effect on the growth of these cells through DNA damage.       Systems similar to Ames test have been developed in yeast.  Saccharomyces cerevisiae  is generally used. These systems can check for forward and reverse mutations, as well as recombinant events.     Drosophila  Sex-Linked Recessive Lethal Test – Males from a strain with yellow bodies are used in this test. The gene for the yellow body lies on the X-chromosome. The fruit flies are fed on a diet of test chemical, and progenies are separated by sex. The surviving males are crossed with the females of the same generation, and if no males with yellow bodies are detected in the second generation, it would indicate a lethal mutation on the X-chromosome has occurred.       Plants such as  Zea mays ,  Arabidopsis thaliana  and  Tradescantia  have been used in various test assays for mutagenecity of chemicals.       Mammalian cell lines such as Chinese hamster V79 cells, ": null
    },
    {
        "Chinese hamster ovary": "Chinese Hamster Ovary Cell"
    },
    {
        " cells or mouse lymphoma cells may be used to test for mutagenesis. Such systems include the  HPRT assay for resistance to 8-azaguanine or ": null
    },
    {
        "6-thioguanine": "6-Thioguanine"
    },
    {
        ", and  ouabain -resistance assay.     Rat primary hepatocytes may also be used to measure DNA repair following DNA damage. Mutagens may stimulate unscheduled DNA synthesis that results in more stained nuclear material in cells following exposure to mutagens.       These systems check for large scale changes to the chromosomes and may be used with cell culture or in animal test. The chromosomes are stained and observed for any changes. Sister chromatid exchange is a symmetrical exchange of chromosome material between sister chromatids and may be correlated to the mutagenic or carcinogenic potential of a chemical. In micronucleus Test, cells are examined for micronuclei, which are fragments or chromosomes left behind at anaphase, and is therefore a test for clastogenic agents that cause chromosome breakages. Other tests may check for various chromosomal aberrations such as chromatid and chromosomal gaps and deletions, translocations, and ploidy.       ": null
    },
    {
        "Rodents": "Rodents"
    },
    {
        " are usually used in ": null
    },
    {
        "animal test": "Animal Testing On Rodents"
    },
    {
        ". The chemicals under   test are usually administered in the food and in the drinking water, but sometimes by dermal application, by ": null
    },
    {
        "gavage": "Feeding Tube"
    },
    {
        ", or by inhalation, and carried out over the major part of the life span for rodents. In tests that check for carcinogens, maximum tolerated dosage is first determined, then a range of doses are given to around 50 animals throughout the notional lifespan of the animal of two years. After death the animals are examined for sign of tumours. Differences in metabolism between rat and human however means that human may not respond in exactly the same way to mutagen, and dosages that produce tumours on the animal test may also be unreasonably high for a human, i.e. the equivalent amount required to produce tumours in human may far exceed what a person might encounter in real life.     Mice with recessive mutations for a visible phenotype may also be used to check for mutagens. Females with recessive mutation crossed with wild-type males would yield the same phenotype as the wild-type, and any observable change to the phenotype would indicate that a mutation induced by the mutagen has occurred.     Mice may also be used for dominant lethal assays where early embryonic deaths are monitored. Male mice are treated with chemicals under test, mated with females, and the females are then sacrificed before parturition and early fetal deaths are counted in the ": null
    },
    {
        "uterine horns": "Uterine Horns"
    },
    {
        ".      Transgenic mouse assay using a mouse strain infected with a viral ": null
    },
    {
        "shuttle vector": "Shuttle Vector"
    },
    {
        " is another method for testing mutagens. Animals are first treated with suspected mutagen, the mouse DNA is then isolated and the phage segment recovered and used to infect E. coli. Using similar method as the ": null
    },
    {
        "blue-white screen": "Blue-White Screen"
    },
    {
        ", the plaque formed with DNA containing mutation are white, while those without are blue.       Many mutagens are highly toxic to proliferating cells, and they are often used to destroy cancer cells. Alkylating agents such as ": null
    },
    {
        "cyclophosphamide": "Cyclophosphamide"
    },
    {
        " and ": null
    },
    {
        "cisplatin": "Cisplatin"
    },
    {
        ", as well as intercalating agent such as ": null
    },
    {
        "daunorubicin": "Daunorubicin"
    },
    {
        " and ": null
    },
    {
        "doxorubicin": "Doxorubicin"
    },
    {
        " may be used in ": null
    },
    {
        "chemotherapy": "Chemotherapy"
    },
    {
        ". However, due to their effect on other cells which are also rapidly dividing, they may have side effects such as hair loss and nausea. Research on better targeted therapies may reduce such side-effects. Ionizing radiations are used in ": null
    },
    {
        "radiation therapy": "Radiation Therapy"
    },
    {
        ".       In ": null
    },
    {
        "science fiction": "Science Fiction"
    },
    {
        ", mutagens are often represented as substances that are capable of completely changing the form of the recipient or granting them superpowers. Powerful radiations are the agents of mutation for the ": null
    },
    {
        "superheroes": "Superheroes"
    },
    {
        " in ": null
    },
    {
        "Marvel Comicss": "Marvel Comics"
    },
    {
        " Fantastic Four": "Fantastic Four"
    },
    {
        ", ": null
    },
    {
        "Daredevil": "Daredevil"
    },
    {
        ", and ": null
    },
    {
        "Hulk": "Hulk"
    },
    {
        ", while in the ": null
    },
    {
        "Teenage Mutant Ninja Turtles": "Teenage Mutant Ninja Turtles"
    },
    {
        " franchise the mutagen is chemical agent also called ooze , and for ": null
    },
    {
        "Inhumans": "Inhumans"
    },
    {
        " the mutagen is the ": null
    },
    {
        "Terrigen Mist": "Terrigen Mist"
    },
    {
        ". Mutagens are also featured in television series, and video games, such as the  Cyberia ,   The Witcher ,  Metroid Prime: Trilogy ,  Resistance: Fall of Man ,  Resident Evil ,  Infamous ,  Freedom Force , Command & Conquer ,  Gears of War 3 ,  StarCraft ,  BioShock , and  Fallout .   In the nuclear monster films of the 1950s, nuclear radiation mutates humans and common insects often to enormous size and aggression; these films include Godzilla, Them!, Attack of the 50 Foot Woman, Tarantula!, The Amazing Colossal Man": null
    }
]