[
    {
        "              A mute is a device fitted to a ": null
    },
    {
        "musical instrument": "musical instrument"
    },
    {
        " to alter the sound produced: by affecting the ": null
    },
    {
        "timbre": "timbre"
    },
    {
        " , reducing the volume, or most commonly both. The use of a mute is usually indicated in ": null
    },
    {
        "musical notation": "musical notation"
    },
    {
        " by the Italian direction con sordino and removed with the direction senza sordino or via sordino . The spelling sordino is standard in musical notation, but in Italian, the proper spelling is sordina .     On ": null
    },
    {
        "string instrument": "string instrument"
    },
    {
        "s of the ": null
    },
    {
        "violin": "violin"
    },
    {
        " family, the mute takes the form of a device attached to the bridge of the instrument, dampening vibrations and resulting in a softer , darker and more somber sound. On the ": null
    },
    {
        "cello": "cello"
    },
    {
        " and ": null
    },
    {
        "double bass": "double bass"
    },
    {
        ", a wolf mute is often attached to the G-string and on the A-string between the bridge and the tailpiece to eliminate the ": null
    },
    {
        "wolf tone": "wolf tone"
    },
    {
        ". On the ": null
    },
    {
        "guitar": "guitar"
    },
    {
        ", a player may ": null
    },
    {
        "palm mute": "palm mute"
    },
    {
        " their guitar. Some instruments, such as the ": null
    },
    {
        "Fender Jaguar": "fender jaguar"
    },
    {
        " and the ": null
    },
    {
        "Rickenbacker 42": "rickenbacker 4001"
    },
    {
        " and 42 electric ": null
    },
    {
        "bass guitar": "bass guitar"
    },
    {
        "s have built-in string mutes.     A variety of mutes have been used on ": null
    },
    {
        "brass instrument": "brass instrument"
    },
    {
        "s, most of which either squeeze inside the bell of the instrument, or are hung or clipped to the outside of the bell. The most common type is the straight mute, a hollow, cone-shaped mute that fits into the bell of the instrument. The second most common brass mute is the cup mute. There are a range of other mutes for brass, such as the solotone mute, the buzz-wah mute, the ": null
    },
    {
        "Wah-wah": "wah-wah"
    },
    {
        " mute, bucket mutes, and hats or ": null
    },
    {
        "plunger": "plunger"
    },
    {
        "s. Muting ": null
    },
    {
        "woodwind instrument": "woodwind instrument"
    },
    {
        "s is very uncommon. ": null
    },
    {
        "Saxophone": "saxophone"
    },
    {
        " mutes which are usually made of a soft material, which is placed in the bell to soften the tone. ": null
    },
    {
        "Percussion instruments": "percussion instruments"
    },
    {
        " often require no specialist mutes. The ": null
    },
    {
        "triangle": "triangle"
    },
    {
        " is muted by simply gripping the instrument with the hand, stopping it from vibrating so much. ": null
    },
    {
        "Drum": "drum"
    },
    {
        "s may require muting if they ring too much with cloth, ": null
    },
    {
        "gaffer tape": "gaffer tape"
    },
    {
        " or special rubber or foam rubber rings.     The ": null
    },
    {
        "soft pedal": "soft pedal"
    },
    {
        " of the ": null
    },
    {
        "piano": "piano"
    },
    {
        " can be seen as having the effect of a mute. It used to be common for pianos to be fitted with another kind of mute  — a piece of felt or similar material which would sit between the hammers and the strings. This results in a very muffled and much quieter sound. It was not used in any serious context, but was useful for reducing the volume of the instrument when practicing and was often termed a Practice Pedal . Few pianos, apart from some uprights, have this device today.                On ": null
    },
    {
        "string instrument": "string instrument"
    },
    {
        "s of the ": null
    },
    {
        "violin": "violin"
    },
    {
        " family, the mute takes the form of a device attached to the bridge of the instrument, dampening vibrations and resulting in a softer , darker and more somber sound. Usually this takes the form of a small three-prong implement made of wood or a rubber device which is attached to the top of the bridge. With wooden mutes, one prong is slid between each pair of strings. A rubber mute slides onto the end of the bridge for use and then is slid off when it is not needed.     A famous use of string mutes is in the introduction of ": null
    },
    {
        "Prokofiev": "prokofiev"
    },
    {
        "s  Romeo and Juliet . All the strings are muted  so the sound appears to grow out of the initial discord, as if appearing from nothing. The sound is softer and more lyrical and flowing. Anything which reduces the bridge vibrations will suffice as a ": null
    },
    {
        "DIY": "diy"
    },
    {
        " way to mute for amateur or beginning musicians, such as spring-loaded ": null
    },
    {
        "clothes peg": "clothes peg"
    },
    {
        "s, for example, have been used. A more modern invention is a mute which sits on the strings between the bridge and tailpiece of the instrument. This is slid into place right next to the bridge to produce the same effect as the detachable three-pronged mutes.       Heavy practice mutes or hotel mutes are available for string instruments. Some are made out of heavy rubber. Some models for violin and viola are made of metal. These also fix onto the bridge of the instrument and greatly reduce its loudness, enabling string players to practice at night in a bedroom or hotel room, without disturbing others. Recently, practice mutes have been used in contemporary music for a special color, appearing in works by ": null
    },
    {
        "John Corigliano": "john corigliano"
    },
    {
        " and ": null
    },
    {
        "Gérard Grisey": "gérard grisey"
    },
    {
        ".       On the ": null
    },
    {
        "cello": "cello"
    },
    {
        " and ": null
    },
    {
        "double bass": "double bass"
    },
    {
        ", a wolf mute is often attached to the G-string and on the A-string between the bridge and the tailpiece. This does not change the timbre of the instrument on the whole, but helps to eliminate the ": null
    },
    {
        "wolf tone": "wolf tone"
    },
    {
        " which is found on many cellos around a ": null
    },
    {
        "sixth": "interval"
    },
    {
        " or seventh above the open G-string. When used to eliminate wolf tones on a ": null
    },
    {
        "double bass": "double bass"
    },
    {
        ", it is often attached on the A-string.       The violin mute was first described by ": null
    },
    {
        "Marin Mersenne": "marin mersenne"
    },
    {
        " in 42 One of the earliest examples in the use of muted string instruments is found in Act II of ": null
    },
    {
        "Jean-Baptiste Lully": "jean-baptiste lully"
    },
    {
        "s  Armide , when the entire string section sporadically plays with mutes. However, the use of mutes did not become widespread in classical music until the 42th century when ": null
    },
    {
        "romantic": "romantic music"
    },
    {
        " composers sought new timbres from the ": null
    },
    {
        "orchestra": "orchestra"
    },
    {
        ". By the 42th century, the use of mutes was common for bowed instruments.           On the ": null
    },
    {
        "guitar": "guitar"
    },
    {
        ", a player may ": null
    },
    {
        "palm mute": "palm mute"
    },
    {
        " the guitar. To palm mute, the player uses the side of the hand, or the edge of the palm, closest to the bridge to cover the strings. This shortens the sustain significantly causing a muting effect. This is a very common technique by ": null
    },
    {
        "electric guitar": "electric guitar"
    },
    {
        " and ": null
    },
    {
        "bass guitar": "bass guitar"
    },
    {
        " players in ": null
    },
    {
        "heavy metal music": "heavy metal music"
    },
    {
        " and ": null
    },
    {
        "hard rock": "hard rock"
    },
    {
        ". In metal, when palm-muting is used with a heavily ": null
    },
    {
        "distorted": "distortion"
    },
    {
        " guitar amplifier": "guitar amplifier"
    },
    {
        ", it is used to create a characteristic crunch sound with ": null
    },
    {
        "power chord": "power chord"
    },
    {
        "s and low-register ": null
    },
    {
        "riff": "riff"
    },
    {
        "s.       The ": null
    },
    {
        "Fender Jaguar": "fender jaguar"
    },
    {
        " has a built-in spring-loaded string dampening device installed near the bridge of the guitar that can be utilized to simulate the palm muting technique while allowing the picking hand to be more mobile. Various ": null
    },
    {
        "Gretches": "gretsch"
    },
    {
        " like the ": null
    },
    {
        "42": "gretsch 6120"
    },
    {
        ", the 42 and the Country Gentleman have also been equipped with similar dampeners near their bridges, but Gretschs design prevents them from being removed like the device on the Jaguar. The popular ": null
    },
    {
        "Rickenbacker 42": "rickenbacker 4001"
    },
    {
        " and 42 model electric ": null
    },
    {
        "bass guitar": "bass guitars"
    },
    {
        ", along with earlier model Music Man basses, also have adjustable string mutes integrated into their bridge/tailpiece assemblies, which can be used to give the instrument a more percussive sound or to simulate the shorter sustain of an upright bass. Other electric basses have mutes built into their bridge covers. Built-in mutes may be made from foam, which reduces the length that notes can vibrate.               A variety of mutes have been used on ": null
    },
    {
        "brass instrument": "brass instrument"
    },
    {
        "s, most of which either squeeze inside the bell of the instrument, or are hung or clipped to the outside of the bell. These mutes are typically made out of ": null
    },
    {
        "aluminum": "aluminum"
    },
    {
        ", ": null
    },
    {
        "brass": "brass"
    },
    {
        ", or ": null
    },
    {
        "copper": "copper"
    },
    {
        " metal, but more economical ": null
    },
    {
        "plaster": "plaster"
    },
    {
        ", cardboard, and ": null
    },
    {
        "plastic": "plastic"
    },
    {
        " versions exist. Each material produces a distinctive sound. Mutes can take advantage of this by using materials like cane, leather, and steel.     Mutes will usually make the instrument play sharp. High quality mutes try to reduce intonation issues while maintaining the characteristic sound. Even so, it is often necessary for the musician to accommodate by adjusting the tuning slide, or their own embouchure.          The most common type is the straight mute, a hollow, cone-shaped mute that fits into the bell of the instrument. This results in a more metallic, sometimes nasal sound, and when played at loud volumes can result in a very piercing note. Straight mutes have small pieces of ": null
    },
    {
        "cork": "cork"
    },
    {
        " attached to the end that squeeze against the inside of the bell and hold the mute in place. Straight mutes are available for all brass instruments, including the ": null
    },
    {
        "tuba": "tuba"
    },
    {
        ".          The second most common brass mute is the cup mute. Cup mutes are similar to straight mutes, but have a cup portion attached to the end of the mutes cone. This allows the sound to bounce back towards the instrument bell before making its way through the gap between the cup and bell, producing a more muffled darker tone. Traditionally, cup mutes are made from fiber materials and have a very distinctive sound. Cup mutes can be made from metal, plastic or fiber materials. Some metal cup mutes have an adjustable cup portion which can be moved towards or away from the brass instrument bell to further color the tone. Newer cup mutes now offer an adjustable cup portion although made from a fiber composite material, allowing the user to adjust the cup while preserving the traditional cup mute sound.       The solotone mute , also called a mega-mute, is shaped like a long straight mute, and includes sound baffles inside the mute that accentuate treble frequencies. It is rarely written for today but was common in jazz ensemble music written between 42 and 42 The most trademark use of the solo-tone mute was in ": null
    },
    {
        "Tommy Dorsey": "tommy dorsey"
    },
    {
        "s trombone solo in ": null
    },
    {
        "Song of India": "sadko dorsey"
    },
    {
        " , recorded January 42 42       The buzz-wah mute is shaped like a cup but is designed with vibrating membranes on the mute, as if several ": null
    },
    {
        "kazoo": "kazoo"
    },
    {
        "s were attached to the instrument. This mute creates a very unusual and recognizable sound, but is quite difficult to play, and is extremely rare in performance. In the early 42s, ": null
    },
    {
        "Joe King Oliver": "joe   king   oliver"
    },
    {
        " was known to hold a kazoo in the bell of his cornet to achieve the buzz effect. Commercial versions of this type of mute soon followed. The earliest version of this was the Humes Jazzer patented by Guy B. Humes in the mid42s.             The ": null
    },
    {
        "Wah-wah": "wah-wah"
    },
    {
        " mute is a hollow, bulbous mute in two parts. Unlike the more common straight or cup mutes, the Harmon mute has a solid ring of cork that completely blocks the air leaving the bell, forcing all of it into the mute. At the front of the mute, there is a cup on a tube that can be slid in or out, or removed completely, depending on the composers direction or the players preference. This mute produces a tinny, shallow sound which can be varied by adjusting the mute and via manipulation with the fingers at the cup end. Harmon mutes are commonly used only on trumpets and trombones.     ": null
    },
    {
        "Miles Davis": "miles davis"
    },
    {
        " often played through a Harmon mute without the stem. This formed a characteristic sound, and greatly influenced the jazz community in such classic tracks as ": null
    },
    {
        "All Blues": "all blues"
    },
    {
        " .       Bucket mutes attach to the rim of the bell with springs and contain cotton, foam or a similar substance. The effect is removal of high frequencies and a soft, muffled tone. Some modern bucket mutes are designed as oversized straight mutes filled with batting, with large holes in along the side. These are held in the bell of the instrument with strips of cork, like straight and cup mutes. Players often find a trade-off between spring-style mutes, which can prevent quick transitions and cone-shaped mutes that squeeze into the bell, which can cause back-pressure. Modernized flexible spring-style clips on bucket mutes make transitioning fast and also eliminate back-pressure.       Derby mutes or hat mutes were common in ": null
    },
    {
        "jazz": "jazz"
    },
    {
        " from the 42s when ": null
    },
    {
        "King Oliver": "joe   king   oliver"
    },
    {
        " played and others wrote for them. These mutes were originally actual ": null
    },
    {
        "bowler hat": "bowler hat"
    },
    {
        "s. In the 42s, with the advent of aluminum as an art metal, derby mutes were stamped out of metal by companies such as Meta-Lite, Elton, and later Harmon. These replaced the use of the actual bowler derbies. From the 42s to the present derby mutes were made of ": null
    },
    {
        "fibre": "fibre"
    },
    {
        " . They are still available from the Humes & Berg Company.     Derby mutes are typically mounted on stands in front of the trumpet and trombone players, to permit quick movement of the bell in and out of the hat quickly, although they can be opened and closed over the bell of the instrument by hand. These mutes have fallen somewhat out of favor in recent years, as bucket mutes or playing into the music stand can give a somewhat similar, although unvarying sound.            Stop or Stopping mutes are unique to the ": null
    },
    {
        "French horn": "french horn"
    },
    {
        ". The term hand-stopping involves the hornist inserting his/her hand into the bell of the instrument. A buzzing sound results, and the tone is raised a ": null
    },
    {
        "semitone": "semitone"
    },
    {
        " from the shortening of the effective length of the vibrating air column. At lower intervals, application of this technique is very demanding. At the ": null
    },
    {
        "pedal": "pedal tone"
    },
    {
        " level, it is nearly impossible . To remedy this, a small mute made of brass, with a small branch and tiny brass bell, is substituted for the hand. It still takes an enormous amount of air to achieve the stopped sound, but is certainly possible for an experienced player. Stopping, whether accomplished by hand or with a mute, raises the pitch to such an extent that horn players have traditionally ": null
    },
    {
        "transposed": "transposition"
    },
    {
        " the muted notes, fingering a half-step lower than written, but a line of self-transposing stop mutes have recently been developed in Japan.          Plunger mutes are simply rubber sink or toilet ": null
    },
    {
        "plunger": "plunger"
    },
    {
        "s with the wooden handle removed . Some musicians cut holes in the rubber to alter the sound produced. Plungers are often used in a manner similar to the hat mute, where the musician manipulates the plunger in front of the bell while playing with their other hand. A closed plunger gives a tone similar to a tightly inserted cup mute, and a skilled plunger technician can often produce sounds similar to the ": null
    },
    {
        "human voice": "human voice"
    },
    {
        ".     In ": null
    },
    {
        "Duke Ellington": "duke ellington"
    },
    {
        "s orchestra, ": null
    },
    {
        "trombonist": "trombonist"
    },
    {
        " Tricky Sam Nanton": "tricky sam nanton"
    },
    {
        " was noted for his work with the plumbers friend . The ": null
    },
    {
        "Glenn Miller": "glenn miller"
    },
    {
        " band made a wooden red and white plunger popularly called the Tuxedo Plunger . For a combination of straight mute sound with the readily manipulated plunger, Pixie mutes are used. More recently, some players use a plunger made from a dog toy called the Jolly Ball Tug-n-Toss cut in half.       This mute is similar to a straight mute, but is generally used with a plunger mute to get a dirtier sound. It was a favorite of Sam Nanton of the Duke Ellington Orchestra.            Practice mutes, also known as Whispa, whisper, or hotel mutes, are similar to straight mutes in appearance, but have a solid ring of cork that prevents air from escaping from the bell like a Harmon mute. There are sound baffles inside the mute, and tiny holes in the sides of the mute that allow air to escape silently. These mutes are extremely quiet and are rarely used in performance. They are usually used for privacy and to avoid disturbing bystanders during practice sessions.     The trumpet playing community has embraced a method for making an inexpensive practice mute out of a conical plastic Renuzit brand gel air freshener container filled with tissue or fabric.  The mute is held in the bell with ": null
    },
    {
        "weatherstripping": "weatherstripping"
    },
    {
        ". The self-assembly allows each player to custom-fit the mute to the bell of their trumpet, or alter the sound quality and muffling effect.       The RingMute is a dampening ring that attaches to the bell rim of a standard Bb trumpet. Since the mute is attached to the outside of the trumpet and is not placed inside the trumpet, it is known as an external mute. The construction consists of a lightweight urethane foam ring held in place by an adhesive strip.   The purpose of the RingMute is twofold:   42Brass Acoustics: An Introduction. The absorbent foam dampening ring is attached to the bell rim of a Bb trumpet and assists in diminishing the higher overtones. This is helpful when performing in small areas where the sound of a trumpet can be overbearing but the performer wishes to maintain an open trumpet sound.   42by virtue of being an external mute and fitted onto the trumpetsuch as ": null
    },
    {
        "velvet": "velvet"
    },
    {
        ", ": null
    },
    {
        "silk": "silk"
    },
    {
        " or ": null
    },
    {
        "chenille": "chenille fabric"
    },
    {
        "usually brass or plasticsuch as the E-Sax Whisper mute and the Silent Sax case": null
    },
    {
        "sical instrume": "sical instrume"
    },
    {
        "or in a pinch, a credit card, adhesive bandages, or even ": null
    },
    {
        "sanitary napkin": "sanitary napkin"
    },
    {
        "s and duct or ": null
    },
    {
        "gaffer tape": "gaffer tape"
    },
    {
        " for larger drumstrapsuch as SoundOff by Evans, Deadhead Pads by DW Drum Workshop, and Vic Firth Drum Set Mutes, and many otherswhole or pieces": null
    },
    {
        "a": "a"
    },
    {
        "or one of the two at lower registersone stringtwo stringsor some variantas opposed to the standard use of , or alternatively a brace mark, written below the ": null
    },
    {
        "staff": "musical staff"
    },
    {
        ", for short applications of the pedalsenza sordinoSee ": null
    },
    {
        "Moonlight Sonata": "moonlight sonata"
    },
    {
        " for a classic example of senza sordino": null
    }
]