[
    {
        "      My Left Foot is the 42 ": null
    },
    {
        "autobiography": "autobiography"
    },
    {
        " of ": null
    },
    {
        "Christy Brown": "christy brown"
    },
    {
        ", who was born with ": null
    },
    {
        "cerebral palsy": "cerebral palsy"
    },
    {
        " on 42 June 42 in ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        ", Ireland. As one of 42 surviving children, Brown went on to be an author, painter and poet.       Brown begins his book by telling the reader about his early childhood. When he was four months old, Browns mother was the first to notice that there was something wrong with his health. He could not hold his head upright or control his body movements. After seeking medical advice, the familys worst fears were confirmed: Christy was physically handicapped and suffered from an incurable disability called cerebral palsy. His family, besides his mother, thought he was an idiot. They told his mother to give up.     Although the doctors did not believe in Browns mental intelligence, his mother did not lose faith in her son and supported him as a full member of the family.     A transforming moment occurs in the young boys life that proves him to be intelligent. He discovers that he can control his left foot and toes. At the age of five, he snatches a piece of yellow ": null
    },
    {
        "chalk": "chalk"
    },
    {
        " from his sister with his left foot. He marks the letter A on the floor with his foot and the help of his mother. He had wanted to make, what he described as, a wild sort of scribble with it on the slate . It is from this incident that the book received its title. In this moment, Brown had found a way to express himself since he could not speak like a healthy child.     Throughout his childhood, Brown played with local children and with his siblings, assisted by a small cart that he called Henry . As time went on, he became more introverted, as he began to realize that his handicap made him different from his family and friends and impeded his enjoyment of life. Through this struggle, he discovered his creative and artistic talents, becoming devoted to ": null
    },
    {
        "literature": "literature"
    },
    {
        ", writing and painting. He used his left foot to carry out these tasks.     At the age of 42 Brown went to ": null
    },
    {
        "Lourdes": "lourdes"
    },
    {
        " in France. Here, he met individuals whose handicaps were even worse than his. For the first time in his life, he began to experience energy and hope. He also began to accept himself as the person he was, and do the best with what he had. He started a new treatment for cerebral palsy, which led to the improvement of his speech and physical condition.     In his teenage years, he met the Irish doctor ": null
    },
    {
        "Robert Collis": "robert collis"
    },
    {
        ". Collis had established a clinic for cerebral palsy patients and Brown was his first patient at this clinic. Collis was also a noted author, and guided Brown on how to write. This too involved a kind of therapy of intensive practice and exercises. Collis was involved in the two first drafts of this book and its final version.     The autobiography makes reference to its own creation. The final pages tell of Collis reading the first chapter of the book to the audience at a fundraising event. The chapter was warmly received by those in attendance.          My Left Foot , the ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        "-winning film version of his autobiography, was directed by ": null
    },
    {
        "Jim Sheridan": "jim sheridan"
    },
    {
        " in 42 with a screenplay by Shane Connaughton. ": null
    },
    {
        "Daniel Day-Lewis": "daniel day-lewis"
    },
    {
        " starred as Christy while ": null
    },
    {
        "Brenda Fricker": "brenda fricker"
    },
    {
        " played Browns mother.                      ": null
    }
]