[
    {
        "           My War is the second studio album by American band ": null
    },
    {
        "Black Flag": "black flag"
    },
    {
        ". It polarized fans on its release in 42 on ": null
    },
    {
        "SST Records": "sst records"
    },
    {
        " over the ": null
    },
    {
        "LPs": "lp record"
    },
    {
        " B-side, on which the band slowed down to a heavy, ": null
    },
    {
        "Black Sabbath": "black sabbath"
    },
    {
        "-esque trudge, despite the reputation the band had earned as leaders in fast ": null
    },
    {
        "hardcore punk": "hardcore punk"
    },
    {
        " on its first album,  Damaged  .     After a period of legal troubles which prohibited the band from using its own name on recordings, Black Flag returned to the studio with a new approach to its music that incorporated a greater variety of styles, resulting in a sound orthodox punks found difficult to accept. The line-up had shrunk from five members to three: vocalist ": null
    },
    {
        "Henry Rollins": "henry rollins"
    },
    {
        ", drummer ": null
    },
    {
        "Bill Stevenson": "bill stevenson"
    },
    {
        ", and co-founding guitarist ": null
    },
    {
        "Greg Ginn": "greg ginn"
    },
    {
        ". Ginn doubled on bass guitar under the name Dale Nixon for the recording as co-founding bassist ": null
    },
    {
        "Chuck Dukowski": "chuck dukowski"
    },
    {
        " left the band shortly before recording; the album includes two tracks Dukowski wrote.     The A-side of the LP is composed of six generally high-paced, thrashy hardcore tracks, featuring guitar solos unusual in punk music. On the B-side are three tracks in a ": null
    },
    {
        "sludge metal": "sludge metal"
    },
    {
        " style, each breaching six-minutes with ponderously slow tempos and dark, unrelenting lyrics of self-hatred. The band members had grown their hair long when they toured the album in 42 further alienating their ": null
    },
    {
        "hardcore skinhead": "hardcore skinhead"
    },
    {
        " fanbase. Despite mixed reception at the time of the albums release, My War is now regarded as one of Black Flags seminal releases and had a major influence on the development of ": null
    },
    {
        "sludge metal": "sludge metal"
    },
    {
        ", ": null
    },
    {
        "grunge": "grunge"
    },
    {
        ", and ": null
    },
    {
        "math rock": "math rock"
    },
    {
        ".                 In 42 ": null
    },
    {
        "Black Flag": "black flag"
    },
    {
        " guitarist and cofounder ": null
    },
    {
        "Greg Ginn": "greg ginn"
    },
    {
        " converted his ham radio business Solid State Transmitters to ": null
    },
    {
        "SST Records": "sst records"
    },
    {
        " to release the bands first ": null
    },
    {
        "EP": "extended play"
    },
    {
        "  Nervous Breakdown . Soon SST was releasing recordings by other bands as well, beginning with ": null
    },
    {
        "Minutemen": "minutemen"
    },
    {
        "s  Paranoid Time  in 42     Black Flag recorded its first album  Damaged  in 42 at Unicorn Studios and arranged a deal with the studios record label Unicorn Records, which had distribution with ": null
    },
    {
        "MCA Records": "mca records"
    },
    {
        ". MCA label president Al Bergamo halted the release after hearing the record, calling it anti-parent —though SST hand ": null
    },
    {
        "Joe Carducci": "joe carducci"
    },
    {
        " asserts this was a pretense for MCA to sever relations with the financially troubled Unicorn. The band obtained and distributed the already-pressed  copies of Damaged and adorned it with a label displaying Bergamos anti-parent quote. Legal troubles erupted when SST claimed unpaid royalties from Unicorn and Unicorn successfully counter-sued, resulting in five days in jail for Ginn and co-founding bassist ": null
    },
    {
        "Chuck Dukowski": "chuck dukowski"
    },
    {
        " and an injunction prohibiting the band from releasing material under its own name. The double album  Everything Went Black —a compilation of earlier, unreleased material—appeared from SST in 42 without the bands name on it. Unicorns bankruptcy in 42 freed the band from the injunction.          Following the release of Damaged, Black Flag absorbed a wider range of influences, such as the ": null
    },
    {
        "doom metal": "doom metal"
    },
    {
        " of ": null
    },
    {
        "Saint Vitus": "saint vitus"
    },
    {
        " and the more experimental hardcore of ": null
    },
    {
        "Flipper": "flipper"
    },
    {
        ", ": null
    },
    {
        "Void": "void"
    },
    {
        ", and ": null
    },
    {
        "Fang": "fang"
    },
    {
        ". The band revisited early influences such as ": null
    },
    {
        "Black Sabbath": "black sabbath"
    },
    {
        ", the ": null
    },
    {
        "MC42": "mc5"
    },
    {
        ", and ": null
    },
    {
        "the Stooges": "the stooges"
    },
    {
        " for new approaches to songwriting other than relying on the high speed that had become the Black Flag hallmark. In an interview in 42 with ": null
    },
    {
        "Mark Arm": "mark arm"
    },
    {
        " the band declared its admiration for heavy metal band ": null
    },
    {
        "Dio": "dio"
    },
    {
        "; when asked, Dio? Whats that? Ginn responded, Its Italian for God.  Ginn jealously guarded the new material, fearing other bands would capitalize on the new approach.     The band toured extensively in North America and Europe to often hostile, violent hardcore punk crowds. The disciplined group rehearsed obsessively, but there was little friendship between members: vocalist ": null
    },
    {
        "Henry Rollins": "henry rollins"
    },
    {
        " was introverted and Ginn cold and demanding. Dukowski felt that Rollins vocal approach was better suited than that of the bands earlier three singers to the new material he was writing such as I Love You and My War . Dukowski, who also wrote poetry and fiction, encouraged Rollins to write as well, and Rollins found inspiration in Dukowksis bleak lyrical style.     The band recorded a set of ten demo tracks at Total Access studios in 42 for a planned follow-up to Damaged on which ": null
    },
    {
        "Chuck Biscuits": "chuck biscuits"
    },
    {
        " replaced Damaged drummer ": null
    },
    {
        "Robo": "robo"
    },
    {
        ". The rest of the lineup consisted of Ginn and former vocalist ": null
    },
    {
        "Dez Cadena": "dez cadena"
    },
    {
        " on guitars, Rollins on vocals, and Dukowski on bass. The band explored new sounds on these tracks, which tended to feature a riff-heavy heavy-metal edge and noisy, energetic free guitar soloing from Ginn. The album never materialized, and the heavily bootlegged demos have never been officially released; re-recordings of several of the tracks from the session were to feature on My War and other later albums. The line-up did not last long—frustrated with the bands legal troubles, Biscuits left in December 42 replaced by ": null
    },
    {
        "Bill Stevenson": "bill stevenson"
    },
    {
        ", and in 42 Cadena left to form ": null
    },
    {
        "DC42": "dc3"
    },
    {
        ". Ginn had been frustrated with Dukowskis sense of rhythm, and in Germany during a European tour in 42 gave Dukowski an ultimatum to quit, or Ginn himself would leave. Dukowski left the band, but stayed on to co-run SST.     With Unicorns demise in 42 Black Flag was able to release the material they had written since 42 Eager to get back in the studio but still without a bassist, Ginn took on bass duties under the pseudonym Dale Nixon and practiced the new material with Stevenson up to eight hours a day, teaching the drummer to slow down and let the rhythm ooze out at a pace Stevenson was unused to; the band called this approach the socialist groove , as all beats were equally spaced. With ": null
    },
    {
        "Spot": "spot"
    },
    {
        " as producer and $42 in debt, Ginn, Rollins, and Stevenson headed to the studio to record My War.       The dark music on My War lacks the humor and fist-pumping anthems that lightened up Damaged—no longer the snotty-nosed punk approach of the ": null
    },
    {
        "Keith Morris": "keith morris"
    },
    {
        " era, the band now focused on gloom, depression, defeatism, and aggression. The sides on the original LP divide the tracks into stylistic halves. The first half features five tracks of high-powered hardcore punk and closes with a noisy freak-out, The Swinging Man . Dukowski penned the opening title track. Ginns Cant Decide follows, a gloomy ode to frustration: I conceal my feelings  / So I dont have to explain  / What I cant explain anyway . Beat My Head Against the Wall rails at conformity and the bands experience with a major label: Swimming in the mainstream  / Is such a lame, lame dream . Dukowskis I Love You parodies pop ballads with lyrics of violence and dysfunction in a relationship gone wrong. Ginn and Rollins share credit on the metallic Forever Time and the noisy Swinging Man .          Three tracks that each clock at over six minutes make up the second half. Each is in a plodding ": null
    },
    {
        "Black Sabbath": "black sabbath"
    },
    {
        "-esque ": null
    },
    {
        "sludge metal": "sludge metal"
    },
    {
        " style with ponderous lyrics of unrelenting self-hate. On Three Nights Rollins compares himself to feces stuck to his shoe: And Ive been grinding that stink into the dirt  / For a long time now . Against a slow, heavy, start-and-stop bass riff and a constant drum thudding, Rollins closes Scream with a bellow after delivering the Ginn-penned lines: I may be a big baby  / But Ill scream in your ear  / Til I find out  / Just what it is I am doing here .                 Black Flag toured the My War material from March 42 with ": null
    },
    {
        "the Nig-Heist": "the nig-heist"
    },
    {
        " and ": null
    },
    {
        "Meat Puppets": "meat puppets"
    },
    {
        " as opening acts. It had been a year since the band had toured, and Rollins, Ginn, and Stevenson had grown out their hair; punks associated long hair with the ": null
    },
    {
        "hippie": "hippie"
    },
    {
        "s they loathed and found it dissonant with Rollins accepted image as a ": null
    },
    {
        "hardcore skinhead": "hardcore skinhead"
    },
    {
        ". My War polarized Black Flag fans; it alienated those who wanted the band to stay true to its simple hardcore roots and who were put off by the length of the songs, the riff-heaviness, and the solos—elements widely thought of as un-punk. Tim Yo disparaged the album in  Maximumrocknroll , saying it sounds like Black Flag doing an imitation of ": null
    },
    {
        "Iron Maiden": "iron maiden"
    },
    {
        " imitating Black Flag on a bad day , and called the B-side sheer torture . Howard Hampton at the Boston  Phoenix  called My War unbearably boring  ... resorting to standard  machinations .     My War was the first of four Black Flag releases in 42 a year that also saw  Family Man ,  Slip It In , and  Live 42  appear from SST. It is considered to have helped usher in ": null
    },
    {
        "post-hardcore": "post-hardcore"
    },
    {
        " along with such releases as ": null
    },
    {
        "Hüsker Dü": "hüsker dü"
    },
    {
        "s  Zen Arcade  and ": null
    },
    {
        "Minutemen": "minutemen"
    },
    {
        "s  Double Nickels on the Dime  the same year.          The muffled sound of the albums production has attracted criticism; Stevie Chick disparaged the lack of character in Ginns bass-playing on My War when compared to the 42 demo of the same song with Dukowski on bass. ": null
    },
    {
        "Michael Azerrad": "michael azerrad"
    },
    {
        " praised the strength of the material while denigrating the frustrating lack of ensemble feel as the album was recorded without a full lineup. Critic Clay Jarvis commended the album, emphasizing the risks taken on it and its influence, calling it more a test than an album , and saying, independent music is stronger because Black Flag formulated it .  John Dougan at ": null
    },
    {
        "AllMusic": "allmusic"
    },
    {
        " called the A-side of the album quite good , but described the B-side as self-indulgence masquerading as inspiration and about as much fun as wading through a tar pit . ": null
    },
    {
        "Robert Christgau": "robert christgau"
    },
    {
        " considered the B-side a waste .     The album had a large influence on the hardcore-meets-Sabbath sounds of the ": null
    },
    {
        "Melvins": "melvins"
    },
    {
        ", ": null
    },
    {
        "Mudhoney": "mudhoney"
    },
    {
        ", and ": null
    },
    {
        "Nirvana": "nirvana"
    },
    {
        ". ": null
    },
    {
        "Mark Arm": "mark arm"
    },
    {
        " of Mudhoney related he was moved to tears at a Black Flag concert in 42 when he was first exposed to Nothing Left Inside , and the experience inspired him to seek out bands like Black Sabbath. The first punk concert ": null
    },
    {
        "Nirvana": "nirvana"
    },
    {
        " frontman ": null
    },
    {
        "Kurt Cobain": "kurt cobain"
    },
    {
        " attended was a Black Flag show during the My War tour, and he listed My War on his list of top fifty albums.           ": null
    },
    {
        "Henry Rollins": "henry rollins"
    },
    {
        "  – vocals   ": null
    },
    {
        "Greg Ginn": "greg ginn"
    },
    {
        "  – guitar, bass , producer   ": null
    },
    {
        "Bill Stevenson": "bill stevenson"
    },
    {
        "  – drums, producer       ": null
    },
    {
        "Spot": "spot"
    },
    {
        "  – producer, engineer, mixer   ": null
    },
    {
        "Raymond Pettibon": "raymond pettibon"
    }
]