[
    {
        ":This article is about the comic about the fictional municipality in Häme . Mämmilä is also a real-life village in Pello , Lapland , .   Mämmilä is a full-page comic strip by ": null
    },
    {
        "Finnish": "finland"
    },
    {
        " cartoonist ": null
    },
    {
        "Tarmo Koivisto": "tarmo koivisto"
    },
    {
        " and co-written by ": null
    },
    {
        "Hannu Virtanen": "hannu virtanen"
    },
    {
        ".     Mämmilä is a fictional small country ": null
    },
    {
        "municipality": "municipality"
    },
    {
        ", supposedly in the ": null
    },
    {
        "Häme": "tavastia"
    },
    {
        " region, and was originally modeled on the municipality of ": null
    },
    {
        "Orivesi": "orivesi"
    },
    {
        ". The cartoon depicted various contemporary issues in Finnish life, from various social changes to the coming of ": null
    },
    {
        "Africa": "africa"
    },
    {
        "n ": null
    },
    {
        "refugee": "refugee"
    },
    {
        "s and membership in the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ". The municipality has numerous colorful characters, from local political leaders and potentates to Varpu-Viljami  and Mohammed al-Zomal .     Unusually for comic strips, the storyline happens in real time, and the characters in Mämmilä age normally, at the same pace as the comic strip in real life. For example, a girl called Sari was born in the comic in 42 and is now an adult punk-style girl.     The strip was originally published 42 in a ": null
    },
    {
        "Swedish-Finnish": "sweden finns"
    },
    {
        " magazine,  Suomen Sanoma  in Sweden. The magazine was published only a couple of times per year, so the strip moved to Finnish magazine called  Me  in 42 In 42  Helsingin Sanomat  began its monthly magazine, and Mämmilä moved in there. HS dropped the strip after 42 years, because the readers wanted a strip about life in ": null
    },
    {
        "Helsinki": "helsinki"
    },
    {
        ". Tarmo Koivisto still draws  Tää kaupunki   strip, written by various HS journalists.     In 42 Tarmo Koivisto published a comic album WWW.MAMMILA.FI in which the ": null
    },
    {
        "Internet": "internet"
    },
    {
        " and shady business practices come to Mämmilä. It was under work for five years.     In late 42  Suomen Kuvalehti , a weekly magazine wanted to publish Mämmilä": null
    }
]