[
    {
        "Mönsterås Municipality  is a ": null
    },
    {
        "municipality": "municipalities of sweden"
    },
    {
        " in ": null
    },
    {
        "Kalmar County": "kalmar county"
    },
    {
        ", south-eastern ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", with its seat located in the town ": null
    },
    {
        "Mönsterås": "mönsterås"
    },
    {
        ".     Mönsterås was an original market town  köping , which in 42 was united with the rural municipality by the same name. By the local government reform of 42 it became a municipality of unitary type and ": null
    },
    {
        "amalgamated": "amalgamation"
    },
    {
        " with Fliseryd and Ålem in 42     The coastal line is signified by an ": null
    },
    {
        "archipelago": "archipelago"
    },
    {
        " with some 42 islands and islets, whereof two are ": null
    },
    {
        "nature reserve": "nature reserve"
    },
    {
        "s. On the island farthest from land, the ": null
    },
    {
        "lighthouse": "lighthouse"
    },
    {
        " of Dämman was built in 42; an automatic lighthouse has replaced its function, but the house itself is visited by tourists and conferences.     The geography of the rest is by some parts covered with forests, as the ": null
    },
    {
        "Småland": "småland"
    },
    {
        " province generally is. There is also some ": null
    },
    {
        "agricultural": "agricultural"
    },
    {
        " areas closer to the sea. There are two rivers flowing through the municipality towards to sea: ": null
    },
    {
        "Emån": "emån"
    },
    {
        " and ": null
    },
    {
        "Alsterån": "alsterån"
    },
    {
        ", that designate the wildlife and geography.     The municipal arms show the ridge which the town centre with its church has been situated on since the ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " age. The cross symbolizes the ": null
    },
    {
        "Knights Hospitallers": "knights hospitallers"
    },
    {
        ", a ": null
    },
    {
        "monastic order": "monastic order"
    },
    {
        " that was built in the town in the fifteenth century and had a large influence on its development. It is an etymological design showing the origin of the name of the municipality: Mönster comes from monastery while ås means ridge.       There are 42 ": null
    },
    {
        "urban area": "urban areas in sweden"
    },
    {
        "s in Mönsterås Municipality.     In the table the localities are listed according to the size of the population as of December 42 42 The municipal seat is in bold characters.     ": null
    }
]