[
    {
        "      Naboo is a planet in the fictional  Star Wars  ": null
    },
    {
        "universe": "star wars galaxy"
    },
    {
        " with a mostly green terrain and which is the homeworld of two spacefaring societies: the ": null
    },
    {
        "Gungans": "gungans"
    },
    {
        ", who dwell in underwater cities, and the humans, who live in colonies on the surface. Humans of Naboo have an ": null
    },
    {
        "electoral monarchy": "electoral monarchy"
    },
    {
        " and maintain a ": null
    },
    {
        "peaceful": "pacifism"
    },
    {
        " culture that defends ": null
    },
    {
        "education": "education"
    },
    {
        ", ": null
    },
    {
        "the arts": "the arts"
    },
    {
        ", ": null
    },
    {
        "environmental protection": "sustainability"
    },
    {
        " and scientific achievements. The main capital of Naboo is Theed. Three moons orbit Naboo: Ohma-Dun, Rori, and Tasia the ice moon.     Located in the Chommell sector, Naboo is the home planet of ": null
    },
    {
        "Padmé Amidala": "padmé amidala"
    },
    {
        " and ": null
    },
    {
        "Jar Jar Binks": "jar jar binks"
    },
    {
        ", as well as Senator  ": null
    },
    {
        "Palpatine": "palpatine"
    },
    {
        ". In  Star Wars: Episode I – The Phantom Menace , it was the site of a ": null
    },
    {
        "blockade": "blockade"
    },
    {
        " by the ": null
    },
    {
        "Trade Federation": "trade federation"
    },
    {
        " and the Battle of Naboo between the Federation and the native inhabitants. Naboo is seen in four films in the Star Wars series, having a prominent role in the first two ": null
    },
    {
        "prequel": "prequel"
    },
    {
        "s and glimpsed briefly in  Revenge of the Sith  and the 42 DVD release of  Return of the Jedi .     Theeds architecture, while referencing Ancient Rome and other classical traditions, was heavily inspired by the ": null
    },
    {
        "Frank Lloyd Wright": "frank lloyd wright"
    },
    {
        "-designed ": null
    },
    {
        "Marin County Civic Center": "marin county civic center"
    },
    {
        " in ": null
    },
    {
        "California": "california"
    },
    {
        ", located near ": null
    },
    {
        "Skywalker Ranch": "skywalker ranch"
    },
    {
        " and ": null
    },
    {
        "Industrial Light & Magic": "industrial light  &  magic"
    },
    {
        ". The swamps of Naboo are home to many species of creatures including the massive ": null
    },
    {
        "Opee Sea Killer": "opee sea killer"
    },
    {
        " in  Star Wars: Episode I – The Phantom Menace .         The Naboo System is located in the Chommel sector, a region in the galactic Mid-Rim. Planet Naboo is the third planet of the star system that shares the same name. The Naboo system comprises five planets, namely Moth , Erep , Naboo , Widow and Storm . The planet Naboo has three moons: ": null
    },
    {
        "Ohma Dun": "ohma dun"
    },
    {
        ", ": null
    },
    {
        "Rori": "rori"
    },
    {
        " and ": null
    },
    {
        "Tasia": "tasia"
    },
    {
        ". Tasia, an ice moon, is the only Naboo moon to be seen in the entire Star Wars movie saga . Ohma Dun is a water moon and Rori is a brownish swamp moon.          Naboo is described as having a porous, ": null
    },
    {
        "plasma": "plasma"
    },
    {
        "-rich interior without a molten core—a rare phenomenon among the planets in the Star Wars universe. The surface of Naboo is covered by dense swamps, rolling grass plains, and verdant hills. The largest mountain chain, the Gallo Mountains, bisect the singular continent and divide the great grass plains of the north from the Lianorm Swamp in the south. South of the Lianorm Swamp is Paonga Sea, where at the bottom lies the Gungan city of Otoh Gunga. Underneath the planets surface is a tremendous maze of passages and caves, home to immense ": null
    },
    {
        "aquatic animal": "aquatic animal"
    },
    {
        "s and creatures that are never seen on the surface. Gungans dominate these underwaterways, using them as a highway of sorts between their surface Holy Places and their underwater cities. The main Gungan settlement is known as Otoh Gunga, where Jar-Jar leads Obi-Wan Kenobi and Qui-Gon Jinn.       It is not known if the aquatic ": null
    },
    {
        "Gungan": "gungan"
    },
    {
        "s are the original inhabitants of Naboo, but they may have evolved in the interior underground seas or the swamplands.     What is known is that a pre-Gungan humanoid civilization did live on the surface tens of thousands of years ago, leaving monuments and ruins scattered throughout the planet. The largest of these ruins, located on the northern edge of the Lianorm Swamp, was identified as the Gungan Sacred Place. Gungans view these ruins as sacred, and their builders as the Elders of the planet. Eventually both Gungan and ": null
    },
    {
        "Human": "humans"
    },
    {
        " Naboo scientists agree that the end of the Elder civilization may be the result of the Elders not living in harmony with nature.       Gungans dominated Naboo for a great time, though largely keeping to the swamps and waterways; the mountains and grasslands they considered desert-like. In 42 BBY , human refugees began fleeing violent ": null
    },
    {
        "revolution": "revolution"
    },
    {
        " on their core world planet of ": null
    },
    {
        "Grizmallt": "grizmallt"
    },
    {
        ". The Grizmallt leader, Queen Elsinore den Tasia, sponsored a fleet of three ships  to colonize new worlds, commanded by the explorer Kwilaan. Elsinore den Tasia had the Naboo moon of Tasia named in her honor. Kwilaans fleet eventually found and crash landed on the planet of Naboo in approximately 42 BBY, where they permanently settled in the mountains and great grass plains. Some believe that Naboo was originally a Gungan word for plainsfolk . Cultural differences led to tension between the two peoples—but direct conflict was rare. Over time there was more conflict between the various human settlements than between humans and Gungans.     The human culture of Naboo remained largely pastoral and nomadic, though urban centers developed. Deeja Peak in the Gallo Mountains developed as one of the first human settlements on the planet, keeping a degree of political power there. Keren and Theed both developed as farming communities whose over-production of foodstuffs provided for a large leisure class. Keren eventually became the commercial hub while Theed became more aristocratic. Kaadara developed as a coastal town for the few Nabooan fisherman . Moenia was the only human colony built in the traditional Gungan homelands of the Lianorm Swamps.     The Naboo developed into a classic ": null
    },
    {
        "feudal": "feudal"
    },
    {
        " society with a hereditary noble class and common folk, though unlike most feudal societies, there is no record of a subservient ": null
    },
    {
        "serf": "serf"
    },
    {
        " class. Naboo city-states traded with each other and with the Gungans. Generally the city-states acknowledged a ceremonial High King —a position that at times rotated between the city-state princes, though at other times was vested in a royal house. This ceremonial position was largely powerless and a form of ": null
    },
    {
        "peerage democracy": "jeffersonian democracy"
    },
    {
        " evolved.     ": null
    },
    {
        "King Narmele": "king narmele"
    },
    {
        " the Explorer colonized Naboos swampy moon of Rori sometime around 42 BBY. A city there still bears his name. Some scientists contend that earlier colonists settled Rori before the Narmele colony, but if this is true, no trace of them has been found. Naboo has two other moons, the water-moon Ohma Dun and the barren grey ice-moon of Tasia .     Naboo culture also includes a strong sense of family in each of the households of Naboo, from commoners up through the royal family. Wives had an extreme sense of loyalty for their husbands and those found to be guilty of adultery were known to be executed.         In 42 BBY a crisis led to a large scale conflict engulfing all the human Naboo city states, though there was no evidence of Gungan participation. Theeds King, ": null
    },
    {
        "Jafan": "king jafan"
    },
    {
        ", ended the conflict, uniting all Nabooans under his leadership by 42 BBY. Jafan ushered in the Great Time of Peace and Theed became the Royal ": null
    },
    {
        "Capital": "capital"
    },
    {
        ", eclipsing Deeja Peak. Still provincial and little-populated, the Naboo remained wary of off-world influences. Under the Jafan dynasty, Theed became a showplace of decorative architecture and dazzling craftsmanship, such as the ": null
    },
    {
        "Naboo royal starship": "list of star wars capital shipsnaboo royal starship"
    },
    {
        " and the royal palace at Theed. . The forecourt to the palace features statues of Naboo ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        "s. The Jafan ": null
    },
    {
        "Dynasty": "dynasty"
    },
    {
        " reigned as hereditary rulers until the last of their line expired . Since then the position of monarch has been an ": null
    },
    {
        "elected": "elective monarchy"
    },
    {
        " post, with a fluid constitution that would allow for hereditary rulership to be vested in a noble dynasty if the people so desired.     By ": null
    },
    {
        "King Veruna": "king veruna"
    },
    {
        "s reign, 42 BBY, Naboo had become a major player in the galactic plasma energy trade market. Long known as a source of plasma , high grade plasma veins were discovered below the streets of Theed. This led King Veruna and Senator ": null
    },
    {
        "Palpatine": "palpatine"
    },
    {
        " to build a great plasma mining and refining facility in the heart of the capital. The Banking Guild financed the construction. As the Naboo traditionally held an aversion to off world trade they agreed to have the powerful ": null
    },
    {
        "Trade Federation": "trade federation"
    },
    {
        " buy the plasma at a fixed price. The Federation however took advantage of the Naboos lack of interstellar commercial experience and sold the plasma for greatly marked-up prices — selling the Naboo short.     The Naboo protested and wished to be free of the contract. King Veruna, never wanting the trade agreement with the Federation in the first place, sensed the upcoming military conflict. Veruna expanded the role of the Space Fighter Corps and had the N42 starfighter squadron organized. Theed Hangar was built next to the refining station to house the new military forces. This move was unpopular on Naboo and with Senator Palpatine as these precautions were perceived as provocative overture. With the people and the senator unhappy with his military expansion, Veruna was forced to ": null
    },
    {
        "abdicate": "abdication"
    },
    {
        " in favor of the Princess ": null
    },
    {
        "Padme Naberrie": "padmé amidala"
    },
    {
        ". Later, Veruna would be ": null
    },
    {
        "assassinated": "assassination"
    },
    {
        " while in ": null
    },
    {
        "exile": "exile"
    },
    {
        ". Taking Amidala as her ": null
    },
    {
        "Name of State": "names of state"
    },
    {
        ", the young Queen, Padme, promised to end the conflict without violence.      Once in power Queen Amidala opened negotiations with the Trade Federation. However, the Federation was scandalized by Naboos resistance to its authority, which coincided with a ": null
    },
    {
        "Galactic Republic": "galactic republic"
    },
    {
        " Senate tax on ": null
    },
    {
        "interstellar trade": "space trade"
    },
    {
        ". Both actions were perceived by Federation leadership as threatening to their commercial interests and power. The Federation answered with a military blockade of Naboo, with the aim of forcing Naboo into subservience and to hopefully intimidate the Senate into repealing the taxation measure. The Federation leadership was secretly advised, and manipulated, by the ": null
    },
    {
        "Sith": "sith"
    },
    {
        " Lord ": null
    },
    {
        "Darth Sidious": "palpatine"
    },
    {
        ".      The Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi were sent to mediate, but were unsuccessful. Naboo fell quickly; though they had a powerful Armed Corps, the Royal Advisory Council held off action until all negotiations failed. The Naboo government and citizens were captured and were to be held in detention camps outside the cities. Soon rescued by Qui-Gon Jinn and Obi-Wan Kenobi, Queen Amidala left Naboo to personally seek aid in the Galactic Senate. ": null
    },
    {
        "Captain Panaka": "list of minor star wars characterscaptain panaka"
    },
    {
        " and others were to organize a resistance movement in the meantime.     Once on ": null
    },
    {
        "Coruscant": "coruscant"
    },
    {
        ", Queen Amidala addressed the senate. The Federation had powerful and rich allies, and all the Queen could do was to call for a Vote of No Confidence in the senate leadership of Supreme ": null
    },
    {
        "Chancellor Valorum": "chancellor valorum"
    },
    {
        ". In this she hoped to force a change for a more favorable chancellorship. The Queen returned to her homeworld to lead the resistance herself. Once home, Queen Amidala sought the aid of the reclusive Gungans, pleading for joint action against a common enemy. The Gungans agreed to an alliance and led an army against the Federations mechanical forces. Captain Panaka was able to organize the Space Fighter Corps to their fighters, and launch a last effort against the Federation capital ship. The Fighter Corps destroyed the Trade Federation capital ship which shut off all of the B42 Battle Droids and the Trade Federation leaders Nute Gunray and Rune Haako were captured. Qui-Gon Jinn was killed during the battle, but ultimately the Naboo & Gungan Alliance was able to defeat the Federation. For her heroic effort the Naboo people wished to alter the constitution allowing for Padmé Amidala, and possibly her heirs, to reign for life. Padmé Amidala declined the honor.     After serving the maximum two 42-year terms, Padmé Amidala was replaced by ": null
    },
    {
        "Queen Jamillia": "queen jamillia"
    },
    {
        " . Jamillia asked for ": null
    },
    {
        "Padmé Amidala": "padmé amidala"
    },
    {
        " to continue serving Naboo as its Senator. Padmé Amidala couldnt refuse the Queen , and returned to politics after a brief respite. ": null
    },
    {
        "Jar Jar Binks": "jar jar binks"
    },
    {
        " was also appointed as the alternate Senator, becoming the first Gungan to represent the planet of Naboo. Most of the ": null
    },
    {
        "prejudices": "prejudices"
    },
    {
        " of both species disappeared when Amidala and Boss Nass managed to unite both species during the Battle of Naboo.     Galactic Republic Senate politics was a new forum for Padmé Amidala. In the meantime ": null
    },
    {
        "Palpatine": "palpatine"
    },
    {
        ", a Naboo himself, remained Supreme Chancellor of the Republic, and his hard-line stances were generally supported by a Naboo still rebuilding after occupation. Though many on Naboo and in the Galactic Senate wished for a centralized executive, Padmé Amidala voted again and again against the Military Creation Act, which would allow for the Senate to raise a standing military to serve at the discretion of the Supreme Chancellor of the Republic. Padmé Amidala, however, was outmaneuvered and — after a proposal by Representative Jar Jar Binks for the granting of emergency powers to the Chancellor — a military was created to counter the Separatist movement. During the ": null
    },
    {
        "Clone Wars": "clone wars"
    },
    {
        ", the Confederacy of Independent Systems launched an unsuccessful campaign of invasion and conquest against Naboo.       Following the rise of the Empire, Queen Apailana became outspoken against the new regime. After diplomatic negotiations failed between Naboo and the Empire, Apailana began exploring military options, and harboring Jedi in direct violation of Order 42 She would be assassinated by the elite 42st Legion, aka Vaders Fist, establishing Imperial control of the planet.     In years to come, the Naboo would generally support the positions of Chancellor and later Emperor Palpatine, including the establishment of the ": null
    },
    {
        "Empire": "galactic empire"
    },
    {
        ", thus becoming an Imperial satellite state. Many Naboo would serve in the Imperial Services and Captain Panaka would become an aide to the Emperor, and later it would become imperial Naboo.     Popular ": null
    },
    {
        "Queen Kylantha": "queen kylantha"
    },
    {
        " would reign throughout the Imperial years. Kylantha appointed Padmé Amidalas niece, ": null
    },
    {
        "Pooja Naberrie": "pooja naberrie"
    },
    {
        ", to the Imperial Senate. There, Pooja would be a contemporary of her cousin, ": null
    },
    {
        "Princess Leia Organa": "princess leia"
    },
    {
        " of ": null
    },
    {
        "Alderaan": "alderaan"
    },
    {
        ". Unfortunately they would never know of each others biological relationship until 42 years after the Battle of Yavin. Kylantha was not a supporter of the old Republic, but neither was she an Imperial proponent. Kylantha refused to alter the democratic structure of the Naboo constitution. It is believed Kylantha was secretly pro-Rebellion, ironically despite the Empire placing her in the position of Queen when the Imperial 42st executed the previous monarch, ": null
    },
    {
        "Queen Apailana": "queen apailana"
    },
    {
        ", for secretly sheltering surviving ": null
    },
    {
        "Jedi": "jedi"
    },
    {
        " within the Royal Palace of the Naboo capital city of Theed during 42 BBY.           Often when a Nabooan enters into political life, he or she adopts a ": null
    },
    {
        "Name of State": "regnal name"
    },
    {
        " . This name is used for public occasions and represents the honor and dignity of the office one chooses. ": null
    },
    {
        "Padmé Naberrie": "padmé naberrie"
    },
    {
        " adopted the anonymous Name of State Amidala when she became Princess of Theed and later, Queen of the Naboo . Padmé retained the name Amidala when she became Naboos Senator for the ": null
    },
    {
        "Galactic Republic": "galactic republic"
    },
    {
        " .       The Scar of Remembrance is used as part of the ruler of the planet Naboos make-up. It is a symbol of remembrance of the days before the Great Time of Peace , which had been brought about by King Jafan, the ruler who united Naboo. Also worn by Naboos monarchs as part of their makeup are the coloured twin cheek-spots of Balance and Symmetry .       King Narmele   Queen Yarm   King Jafan   King Tapalo   King Veruna   ": null
    },
    {
        "Queen Amidala": "padmé amidala"
    },
    {
        "   Queen Jamillia   Queen Neeyutnee - Clone Wars Era   Queen Apailana   Queen Kylantha   Queen Sosha Soruna       Senator ": null
    },
    {
        "Vidar Kim": "vidar kim"
    },
    {
        "   Senator ": null
    },
    {
        "Sheev Palpatine": "palpatine"
    },
    {
        "   Senator ": null
    },
    {
        "Padmé Amidala": "padmé amidala"
    },
    {
        "   Senator ": null
    },
    {
        "Jar Jar Binks": "jar jar binks"
    },
    {
        "   Senator ": null
    },
    {
        "Pooja Naberrie": "pooja naberrie"
    }
]