[
    {
        "Nabu- ri -man-nu   was a ": null
    },
    {
        "Chaldean astronomer": "babylonian astronomy"
    },
    {
        " and ": null
    },
    {
        "mathematician": "babylonian mathematics"
    },
    {
        ".     Classical and ancient ": null
    },
    {
        "cuneiform": "cuneiform"
    },
    {
        " sources mention an astronomer with this name:     The Greek geographer ": null
    },
    {
        "Strabo": "strabo"
    },
    {
        " of ": null
    },
    {
        "Amaseia": "amaseia"
    },
    {
        ", in Geography 42–.42 writes: In ": null
    },
    {
        "Babylon": "babylon"
    },
    {
        " a settlement is set apart for the local ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        "s, the Chaldaeans, as they are called, who are concerned mostly with ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        "; but some of these, who are not approved of by the others, profess to be writers of ": null
    },
    {
        "horoscope": "horoscope"
    },
    {
        "s.  There are also several tribes of the Chaldaean astronomers. For example, some are called Orcheni those from ": null
    },
    {
        "Uruk": "uruk"
    },
    {
        ", others Borsippeni those from ": null
    },
    {
        "Borsippa": "borsippa"
    },
    {
        ", and several others by different names, as though divided into different sects which hold to various dogmas about the same subjects. And the mathematicians make mention of some of these men; as, for example, ": null
    },
    {
        "Kidenas": "kidinnu"
    },
    {
        ", Nabourianos and ": null
    },
    {
        "Soudines": "soudines"
    },
    {
        " .   The damaged ": null
    },
    {
        "colophon": "colophon"
    },
    {
        " of a cuneiform clay tablet with a Babylonian System A ": null
    },
    {
        "lunar": "moon"
    },
    {
        " ephemeris": "ephemeris"
    },
    {
        " for the years 42–42 BC states that it is the of Nabu- man-nu. This is similar to the colophons of two System B clay tablets that say that they are the tersitu of ": null
    },
    {
        "Kidinnu": "kidinnu"
    },
    {
        ".     The following is an excerpt of a century of scholarship discussed in the sources referenced below.   The meaning of tersitu is not known definitively. Already ": null
    },
    {
        "Franz Xaver Kugler": "franz xaver kugler"
    },
    {
        " proposed that tersitu can be interpreted as table here; in another context it seems to mean something like tool , but in yet another the word refers to a blue enamel paste. P. Schnabel, in a series of papers , interpreted the phrase as an assignment of authorship. Based on this, he argued that Naburimannu developed the Babylonian System A of calculating ": null
    },
    {
        "solar system": "solar system"
    },
    {
        " ephemerides, and that Kidinnu later developed Babylonian System B. ": null
    },
    {
        "Otto E. Neugebauer": "otto e. neugebauer"
    },
    {
        " has remained reserved to this conclusion and disputed Schnabels further inferences about Naburimannus life and work. The mathematician ": null
    },
    {
        "B.L. van der Waerden": "bartel leendert van der waerden"
    },
    {
        " later concluded that System A was developed during the reign of ": null
    },
    {
        "Darius I": "darius i"
    },
    {
        " . System A, which uses ": null
    },
    {
        "step function": "step function"
    },
    {
        "s, appears to be somewhat more primitive than System B, which uses ": null
    },
    {
        "zigzag": "zigzag"
    },
    {
        " linear function": "linear function"
    },
    {
        "s, although System A is more consistent than System B. While it thus appears that System A preceded System B, both systems remained in use at least until the 42st century BC.     The earliest preserved System A clay tablets calculate an ephemeris for the ": null
    },
    {
        "planet": "planet"
    },
    {
        " Mercury": "mercury"
    },
    {
        " from 42–42 BC. The oldest preserved lunar tablets date from 42 BC in the ": null
    },
    {
        "Hellenistic": "hellenistic"
    }
]