[
    {
        "        There are two ": null
    },
    {
        "names": "glottonym"
    },
    {
        " given in Spanish to the ": null
    },
    {
        "Spanish language": "spanish language"
    },
    {
        ": español and castellano . Spanish speakers from different countries or backgrounds can show a preference for one term or the other, or use them indiscriminately, but political issues or common usage might lead speakers to prefer one term over the other. This article identifies the differences between those terms, the countries or backgrounds that show a preference for one or the other, and the implications the choice of words might have for a native Spanish-speaker.     Formally speaking, the national language of Spain, the official Spanish language, is the Castilian language . As such both names, español and castellano, have distinct and independent meanings that may be required for clarity in some specific contexts.   Generally speaking, though, both terms can be used to refer to the Spanish language as a whole, with a preference for one over the other that depends on the context or the speakers origin. Castellano  has another, more restricted, meaning, relating either to the ": null
    },
    {
        "old Romance language": "old spanish language"
    },
    {
        " spoken in the ": null
    },
    {
        "Kingdom of Castile": "kingdom of castile"
    },
    {
        " in the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", predecessor of the modern Spanish language, or to the variety of Spanish nowadays spoken in the historical region of ": null
    },
    {
        "Castile": "castile"
    },
    {
        ", in central ": null
    },
    {
        "Spain": "spain"
    },
    {
        ".            Originally Castilian  referred to the language of the ": null
    },
    {
        "Kingdom of Castile": "kingdom of castile"
    },
    {
        ", one of several northern kingdoms that spread across the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " through the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", from about the 42th to the 42th centuries. Traditionally the first recorded examples of written Castilian/Spanish are considered to be the  Glosas Emilianenses , a number of isolated words added to a Latin text as an aid to the reader, dated to the eleventh century. Soon after that there begin to appear discursive texts in Castilian, such as the  Cantar de Mio Cid . This early ": null
    },
    {
        "Romance language": "romance languages"
    },
    {
        " was derived from ": null
    },
    {
        "Latin": "latin"
    },
    {
        " and evolved into modern Spanish.     However, the term Spanish  is a more recent term that first referred to Spain as a country, and then to the predominant language spoken in that country. Spain as a truly unified nation appeared centuries later than the language and the Kingdom of Castile; in fact, it was only in the late 42th century that the ": null
    },
    {
        "personal union": "personal union"
    },
    {
        " between the ": null
    },
    {
        "Crowns": "catholic monarchs"
    },
    {
        " of Castile and ": null
    },
    {
        "Aragon": "kingdom of aragon"
    },
    {
        " unified Spain. The actual legal unification date is disputed, but commonly agreed to have occurred not earlier than the eighteenth century at the end of the ": null
    },
    {
        "War of the Spanish Succession": "war of the spanish succession"
    },
    {
        ". Only then did the Castilian language begin to be commonly called Spanish.     In 42 the arrival of ": null
    },
    {
        "Christopher Columbus": "christopher columbus"
    },
    {
        " on a Castilian-paid expedition paved the way for the ": null
    },
    {
        "Spanish colonization of the Americas": "spanish colonization of the americas"
    },
    {
        ". As a result of this process, most countries in South America now speak the same language as Castile. Until about the eighteenth century, the Kingdom of Castile, and not Spain as a whole, was the colonizing power, and the language used was called castellano. Thus, some Latin American countries formerly under Spanish rule have retained the custom of calling it castellano, while others eventually switched to calling it español, with many different factors influencing the final choice.     In English, the term Spanish relates both to the language and to the nation. The noun used for a person from Spain is Spaniard, with the collective noun the Spanish. The term Castilian is much less widespread amongst English speakers than the term Spanish.     Españolespañol: one based on ": null
    },
    {
        "dissimilation": "dissimilation"
    },
    {
        " in Old Spanish españón , and the other on an ": null
    },
    {
        "Occitan": "occitan language"
    },
    {
        " term derived from a presumed Vulgar Latin hispaniolus. Both Latin ancestor words are based on the place name Hispania ; and both are marked with an asterisk to indicate that they are ": null
    },
    {
        "reconstructed": "linguistic reconstruction"
    },
    {
        ", not directly attested.     The dissimilation hypothesis, advanced by ": null
    },
    {
        "Ramón Menéndez Pidal": "ramón menéndez pidal"
    },
    {
        ",  , p. 42 . presumes that Latin Hispania was lengthened by the ": null
    },
    {
        "derivational": "derivation"
    },
    {
        " suffix -ōne . The Old Spanish form españon is documented in works of the 42th and 42th centuries. For example the  Poema de Fernán González  and the Book of the Knight Zifar|Libro del cauallero Zifar. It is suggested that the final /n/ of this form changed to /l/ by dissimilation from the previous ": null
    },
    {
        "nasal consonant": "nasal consonant"
    },
    {
        ", ñ. This sporadic sound change is observed in some other words: Menéndez Pidal cites Barcelona  and delante ; Lathrop adds ingle  and sangre . Thomas A. Lathrop, The Evolution of Spanish , p. 42     According to the Occitan scenario, advanced by ": null
    },
    {
        "Rafael Lapesa": "rafael lapesa"
    },
    {
        ", Historia de la lengua española , p. 42 . the Spanish borrowed the Occitan name for themselves, which was the name España plus the diminutive suffix -ol, from the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " -olus. The Occitan influence is inferred because in Castilian the same Latin suffix would have produced españuelo rather than español. Lapesa counters the dissimilation hypothesis by citing other words with -ñón in which dissimilation did not take place: cañón, borgoñón, riñón, etc. P. 42 note 42 Penny, in discussing loans from French and Occitan, calls this the most remarkable loan of all, español Spanish, replacing native españón. Ralph Penny, A History of the Spanish Language , p. 42     The name  Hispania  was applied to the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " by the ": null
    },
    {
        "Romans": "ancient rome"
    },
    {
        " when they ": null
    },
    {
        "discovered and later subjugated": "roman conquest of hispania"
    },
    {
        " it. One theory about this name is that it comes from ": null
    },
    {
        "Canaanite": "canaanite languages"
    },
    {
        " אי שפנים , meaning island of ": null
    },
    {
        "hyrax": "hyrax"
    },
    {
        "es, named by Canaanite-speaking ": null
    },
    {
        "Phoenicia": "phoenicia"
    },
    {
        "ns who mistook Spains large ": null
    },
    {
        "rabbit": "rabbit"
    },
    {
        " population for hyraxes. Today the Spanish population of wild rabbits is much less abundant than in ancient times, due to the introduction of the ": null
    },
    {
        "myxomatosis": "myxomatosis"
    },
    {
        " virus": "virus"
    },
    {
        " to mainland Europe in the 42s. Several other theories about the name have been advanced as well .     The Romans called the inhabitants of Hispania hispani , and the relevant adjective was hispanicus. These terms, had they undergone regular sound change into Castilian, would have developed into España, espanos  and espánego or espango—but in reality, only the first term exists in modern Castilian.     As the branches of ": null
    },
    {
        "Vulgar Latin": "vulgar latin"
    },
    {
        " began to evolve into separate ": null
    },
    {
        "Romance languages": "romance languages"
    },
    {
        ", the term that would evolve into español began to be used to refer to these derivative languages . It was at first a general term that embraced the various dialects of Iberian Romance spoken in the area, including the forebears of modern ": null
    },
    {
        "Portuguese": "portuguese language"
    },
    {
        ", ": null
    },
    {
        "Galician": "galician language"
    },
    {
        ", Castilian and ": null
    },
    {
        "Catalan": "catalan language"
    },
    {
        ". However, with the rise of Castile as a power, and its absorption of all surrounding regions into an ever-growing empire that eventually spread to the ": null
    },
    {
        "New World": "new world"
    },
    {
        ", the term España was eventually equated with the peninsular territories ruled by the Crown. With this, the break with the Roman concept of Hispania was complete, and the term acquired its modern meaning of all of Iberia except for ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        " and ": null
    },
    {
        "Andorra": "andorra"
    },
    {
        ". Similarly, español came to be used to refer to the common language of this new country: Castilian.     The terms España and español spread to other languages. The English name Spain is from the French Espagne. Spanish is Spain plus the English suffix -ish. The term continues evolving as other languages adapt these words to form their own name for Spain—for example, ": null
    },
    {
        "Japanese": "japanese language"
    },
    {
        " スペイン語 , Spanish language, and スペイン人 , Spaniard, derive from the Japanese word for Spain, スペイン , which, in turn, derives from English Spain. In Chinese, the word is taken directly from Spanish rather than English: 西班牙  for Spain and 西班牙语 , or the abbreviation 西語  for the Spanish language. The Arabic إسبانية  for Spain derives directly from the word España: the absence of p in the Arabic alphabet makes it a b , and the sound ñ is transformed into n . إسباني is the name for Spanish, with the ": null
    },
    {
        " nisba suffix": "arabic nouns and adjectivesnisba"
    },
    {
        ".     In ": null
    },
    {
        "Guatemala": "guatemala"
    },
    {
        ", although Spanish is the official language, the ": null
    },
    {
        "Maya peoples": "maya peoples"
    },
    {
        ", descendants of the original inhabitants of the region, call it la castilla, keeping the original name from colonial times. Mayans speak at least 42 different ": null
    },
    {
        "Mayan languages": "mayan languages"
    },
    {
        " and dialects, including ": null
    },
    {
        "Mam": "mam language"
    },
    {
        ", ": null
    },
    {
        "Pocomam": "poqomam language"
    },
    {
        ", ": null
    },
    {
        "Kaqchikel": "kaqchikel language"
    },
    {
        ", ": null
    },
    {
        "Tz’utujil": "tz’utujil language"
    },
    {
        ", ": null
    },
    {
        "Q’eqchi’": "q’eqchi’ language"
    },
    {
        ", and ": null
    },
    {
        "K’iche’": "k’iche’ language"
    },
    {
        ".     CastellanoCastilla  means ": null
    },
    {
        "Castle": "castle"
    },
    {
        "-land. The word is derived from Latin castella, the plural of castellum, which, in turn, is a diminutive form of castrum fortress, castle. Through most of the Middle Ages the word was spelled Castiella, a form that survives in ": null
    },
    {
        "Leonese": "leonese dialect"
    },
    {
        " today.  The adjective derived from Castilla is castellano. Castellano also means ": null
    },
    {
        "castellan": "castellan"
    },
    {
        ", i.e. a castle master. There is a comic scene based on the play on words Castilian/castellan in the novel  Don Quixote  .     The region was thus named because it was a ": null
    },
    {
        "frontier": "frontier"
    },
    {
        " land controlled from a series of fortified castles. It shared borders with rival ": null
    },
    {
        "Moorish Iberia": "moorish iberia"
    },
    {
        " and the Christian kingdoms of ": null
    },
    {
        "Leon": "kingdom of león"
    },
    {
        " and ": null
    },
    {
        "Navarre": "kingdom of navarre"
    },
    {
        " and ": null
    },
    {
        "Aragon": "kingdom of aragón"
    },
    {
        " .     While espanyol is used in ": null
    },
    {
        "Standard Philippine": "standard philippine"
    },
    {
        " and other ": null
    },
    {
        "languages of the Philippines": "languages of the philippines"
    },
    {
        ", the word kastilà is more frequently used. Furthermore katsila is also used among those who speak ": null
    },
    {
        "Visayan languages": "visayan languages"
    },
    {
        ", such as ": null
    },
    {
        "Cebuano": "cebuano language"
    },
    {
        ".           During the presence of ": null
    },
    {
        "Moors": "moors"
    },
    {
        " in ": null
    },
    {
        "Hispania": "hispania"
    },
    {
        ", Spanish was sometimes given the name cristiano to distinguish it from the ": null
    },
    {
        "Arabic": "arabic language"
    },
    {
        " and ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " languages. This term is still used occasionally today to refer to the language, in a jocular tone.   The expression Hábleme en cristiano talk to me in Christian , uttered to people not speaking Spanish at the moment, is used in opposition of the other languages of Spain  , which is felt as annoying by them . Háblame en cristiano is also a phrase used to ask for clarification in a conversation, when the topic of the discussion is not clear or is vaguely hinted at by one of the speakers.         The term lengua de ": null
    },
    {
        "Cervantes": "miguel de cervantes"
    },
    {
        " as an ": null
    },
    {
        "epithet": "list of metaphors for languages"
    },
    {
        " for the Spanish language begins to be used early in the 42th century. ": null
    },
    {
        "Mariano José de Larra": "mariano josé de larra"
    },
    {
        " uses the expression in his essay Literatura , first published in 42 , Vol. 42 , p. 42 In 42 it appears in Una cuestión de derecho, by Manuel Sivela. Paris: Gaultier-Laguionie, p. 42 Soon after that it appears in an anonymous article in the Gaceta de Madrid. De las traducciones , No. 42 , p. 42 The poet Nicasio Camilo Jover, in his poem Miguel de Cervantes , states directly Y la lengua del pueblo castellano / Hoy se llama la lengua de Cervantes.  , p. 42 Spanish is called el idioma de Cervantes in a book published in 42 Rafael Díaz Arenas,  ": null
    }
]