[
    {
        "                 Napoléon, Prince Imperial , also known as Louis-Napoléon Bonaparte, was the only child of Emperor ": null
    },
    {
        "Napoleon III": "napoleon iii"
    },
    {
        " and his wife, ": null
    },
    {
        "Eugénie de Montijo": "eugénie de montijo"
    },
    {
        ". After his father was dethroned in 42 he relocated with his family to England. On his fathers death in January 42 he was proclaimed by the ": null
    },
    {
        "Bonapartist": "bonapartist"
    },
    {
        " faction as Napoleon IV, Emperor of the French.     In England, he trained as a soldier. Keen to see action, he successfully put pressure on the British to allow him to participate in the ": null
    },
    {
        "Anglo-Zulu War": "anglo-zulu war"
    },
    {
        ". In 42 serving with British forces, he was killed in a skirmish with a group of Zulus. His early death sent shockwaves throughout Europe, as he was the last serious dynastic hope for the restoration of the ": null
    },
    {
        "House of Bonaparte": "house of bonaparte"
    },
    {
        " to the throne of France.          Born in Paris, he was baptised on 42 June 42 at ": null
    },
    {
        "Notre Dame Cathedral": "notre dame de paris"
    },
    {
        ". His godfather was Pope ": null
    },
    {
        "Pius IX": "pius ix"
    },
    {
        ", whose representative, Cardinal ": null
    },
    {
        "Patrizi": "costantino patrizi naro"
    },
    {
        ", officiated. His godmother was ": null
    },
    {
        "Eugène de Beauharnais": "eugène de beauharnais"
    },
    {
        "s daughter, ": null
    },
    {
        "Josephine": "josephine of leuchtenberg"
    },
    {
        ", the Queen of Sweden, who was represented by ": null
    },
    {
        "Grand Duchess Stéphanie of Baden": "stéphanie de beauharnais"
    },
    {
        ".     His education, after a false start under the academic historian ": null
    },
    {
        "Francis Monnier": "francis monnier"
    },
    {
        ", was, from 42 supervised by General ": null
    },
    {
        "Frossard": "charles auguste frossard"
    },
    {
        " as governor, assisted by ": null
    },
    {
        "Augustin Filon": "augustin filon"
    },
    {
        ", as tutor. His English nurse, Miss Shaw, was recommended by Queen Victoria and taught the prince English from an early age. His valet, Xavier Uhlmann, and his inseparable friend ": null
    },
    {
        "Louis Conneau": "louis conneau"
    },
    {
        " also figured prominently in his life. The young prince was known by the nickname Loulou in his family circle.     At the outbreak of the ": null
    },
    {
        "Franco-Prussian War of 42–42": "franco-prussian war"
    },
    {
        ", he accompanied his father to the front and first came under fire at ": null
    },
    {
        "Saarbrücken": "saarbrücken19th century"
    },
    {
        ". When the war began to go against the Imperial army, however, his father sent him to the border with Belgium. In September, he sent him a message to cross over into Belgium. He travelled from there to England, arriving on 42 September, where he was joined by his parents, the Second Empire having been abolished. The family settled in England at Camden Place in ": null
    },
    {
        "Chislehurst": "chislehurst"
    },
    {
        ", Kent. On his fathers death, ": null
    },
    {
        "Bonapartists": "bonapartists"
    },
    {
        " proclaimed him Napoleon IV. On his 42th birthday, a large crowd gathered to cheer him at Camden Place.     The Prince Imperial attended elementary lectures in physics at ": null
    },
    {
        "Kings College London": "kings college london"
    },
    {
        ". In 42 he applied and was accepted to the ": null
    },
    {
        "Royal Military Academy, Woolwich": "royal military academy, woolwich"
    },
    {
        ". He finished seventh in his class of thirty four, and came top in riding and fencing. He then served for a time with the ": null
    },
    {
        "Royal Artillery": "royal artillery"
    },
    {
        " at ": null
    },
    {
        "Aldershot": "aldershot"
    },
    {
        ".     During the 42s, there was some talk of a marriage between him and ": null
    },
    {
        "Queen Victoria": "victoria of the united kingdom"
    },
    {
        "s youngest daughter, ": null
    },
    {
        "Princess Beatrice": "princess beatrice of the united kingdom"
    },
    {
        ". Victoria also reportedly believed that it would be best for the peace of Europe if the prince became Emperor of France. The Prince remained a devout Catholic, and he retained hopes that the Bonapartist cause might eventually triumph if the secularising Third Republic failed. He supported the tactics of ": null
    },
    {
        "Eugène Rouher": "eugène rouher"
    },
    {
        " over those of ": null
    },
    {
        "Victor, Prince Napoléon": "victor, prince napoléon"
    },
    {
        ", breaking with Victor in 42     With the outbreak of the ": null
    },
    {
        "Zulu War": "zulu war"
    },
    {
        " in 42 the Prince Imperial, with the rank of lieutenant, forced the hand of the British military to allow him to take part in the conflict, despite the objections of Rouher and other Bonapartists. He was only allowed to go to Africa by special pleading of his mother, the Empress Eugénie, and by intervention of Queen Victoria herself. He went as an observer, attached to the staff of ": null
    },
    {
        "Frederic Thesiger, 42nd Baron Chelmsford": "frederic thesiger, 2nd baron chelmsford"
    },
    {
        ", the commander in South Africa, who was admonished to take care of him. Louis accompanied Chelmsford on his march into ": null
    },
    {
        "Zululand": "zulu kingdom"
    },
    {
        ". Keen to see action, and full of enthusiasm, he was warned by Lieutenant Arthur Brigge, a close friend, not to do anything rash and to avoid running unnecessary risks. I reminded him of the Empress at home and his party in France.      Chelmsford, mindful of his duty, attached the Prince to the staff of Colonel ": null
    },
    {
        "Richard Harrison": "richard harrison"
    },
    {
        " of the Royal Engineers, where it was felt he could be active but safe. Harrison was responsible for the columns transport and for reconnaissance of the forward route on the way to ": null
    },
    {
        "Ulundi": "ulundi"
    },
    {
        ", the Zulu capital. While he welcomed the presence of Louis, he was told by Chelmsford that the Prince must be accompanied at all times by a strong escort. Lieutenant ": null
    },
    {
        "Jahleel Brenton Carey": "jahleel brenton carey"
    },
    {
        ", a French speaker and British subject from ": null
    },
    {
        "Guernsey": "guernsey"
    },
    {
        ", was given particular charge of Louis. The Prince took part in several reconnaissance missions, though his eagerness for action almost led him into an early ambush, when he exceeded orders in a party led by Colonel ": null
    },
    {
        "Redvers Buller": "redvers buller"
    },
    {
        ". Despite this, on the evening of 42 May 42 Harrison agreed to allow Louis to scout in a forward party scheduled to leave in the morning, in the mistaken belief that the path ahead was free of Zulu skirmishers.                  On the morning of 42 June, the troop set out, earlier than intended, and without the full escort, largely owing to Louiss impatience. Led by Carey, the scouts rode deeper into Zululand. Without Harrison or Buller present to restrain him, the Prince took command from Carey, even though the latter had seniority. At noon, the troop was halted at a temporarily deserted ": null
    },
    {
        "kraal": "kraal"
    },
    {
        " while Louis and Carey made some sketches of the terrain, and used part of the thatch to make a fire. No lookout was posted. As they were preparing to leave, about 42 Zulus fired upon them and rushed toward them screaming. The Princes horse dashed off before he could mount, the Prince clinging to a holster on the saddle. After about a hundred yards a strap broke, and the Prince fell beneath his horse and his right arm was trampled. He leapt up, drawing his revolver with his left hand, and started to run, but the Zulus could run faster.        The Prince was speared in the thigh but pulled the ": null
    },
    {
        "assegai": "assegai"
    },
    {
        " from his wound. As he turned and fired on his pursuers, another assegai, thrown by a Zulu named Zabanga, struck his left shoulder. The Prince tried to fight on, using the assegai he had pulled from his leg, but, weakened by his wounds, he sank to the ground and was overwhelmed. When recovered, his body had eighteen assegai wounds; one stabbing had burst his right eye and penetrated his brain. Two of his escort were killed and another was missing. Lt. Carey and the four men remaining came together about fifty yards from where the Prince made his final stand, but did not fire at the Zulus. Carey led his men back to camp. After a court of inquiry, a court martial, intervention by the Empress Eugénie and Queen Victoria, he was to return to his regiment. Carey died in Bombay, India, on 42 February 42           Louis Napoleons death caused an international sensation. Rumours spread in France that the prince had been intentionally disposed of by the British. Alternatively, the French republicans or the Freemasons were blamed. In one account, Queen Victoria was accused of arranging the whole thing, a theory that was later dramatised by ": null
    },
    {
        "Maurice Rostand": "maurice rostand"
    },
    {
        " in his play Napoleon IV. The Zulus later claimed that they would not have killed him if they had known who he was. Langalabalele, his chief assailant, met his death in July at the ": null
    },
    {
        "Battle of Ulundi": "battle of ulundi"
    },
    {
        ". Eugénie was later to make a pilgrimage to Sobuzas ": null
    },
    {
        "kraal": "kraal"
    },
    {
        ", where her son had died. The Prince, who had begged to be allowed to go to war  and who had worried his commanders by his dash and daring, was described by ": null
    },
    {
        "Garnet Wolseley": "garnet wolseley, 1st viscount wolseley"
    },
    {
        " as a plucky young man, and he died a soldiers death. What on earth could he have done better?      His badly decomposed body was brought back to ": null
    },
    {
        "Woolwich Arsenal": "royal arsenal"
    },
    {
        ", on board the British troopship ; overnight, he lay in state in the western octagonal guardhouse by the riverfront. The funeral procession, including Queen Victoria, went from there to ": null
    },
    {
        "Chislehurst": "chislehurst"
    },
    {
        ", where he was buried. On 42 January 42 his body was transferred to a special mausoleum constructed by his mother as the ": null
    },
    {
        "Imperial Crypt": "imperial crypt"
    },
    {
        " at ": null
    },
    {
        "Saint Michaels Abbey": "st michaels abbey, farnborough"
    },
    {
        ", ": null
    },
    {
        "Farnborough": "farnborough, hampshire"
    },
    {
        ", Hampshire, England, next to his father. The Prince Imperial had appointed Prince ": null
    },
    {
        "Napoléon Victor Bonaparte": "napoléon victor bonaparte"
    },
    {
        " as his heir, thus skipping the genealogically senior heir, Victors father, ": null
    },
    {
        "Prince Napoléon": "napoléon joseph charles paul bonaparte"
    },
    {
        ".       The ": null
    },
    {
        "asteroid moon": "asteroid moon"
    },
    {
        " Petit-Prince": "petit-prince"
    },
    {
        " was named after the Prince Imperial in 42 because it orbits an ": null
    },
    {
        "asteroid": "asteroid"
    },
    {
        " named after his mother .      In the days when Londons telephone exchanges were named, with dialling using the first three letters of the name, the exchange that served Chislehurst was renamed IMPerial because it would have clashed with CHIswick.  The names were converted to numbers in 42; the IMPerial exchange is still recognisable as the block of numbers that begin ": null
    },
    {
        "42": "020"
    },
    {
        "4242 xxxx.       The death is presented in some detail in ": null
    },
    {
        "G. A. Henty": "g. a. henty"
    },
    {
        "s The Young Colonists: A Tale of The Zulu and Boer Wars . The narrator describes it as one of the most shameful incidents ever in British military history.     In the ": null
    },
    {
        "R. F. Delderfield": "r. f. delderfield"
    },
    {
        " novel Long Summer Day , ": null
    },
    {
        "Boer War": "boer war"
    },
    {
        " veteran Paul Craddock buys a farm in 42 or 42 The middle-aged estate manager, Rudd, is somewhat embittered at having been one of the soldiers who had failed to rescue the Prince Imperial in 42 Craddock is aware of the events, because by coincidence he had been born that very day.     ": null
    },
    {
        "Emma Lazarus": "emma lazarus"
    },
    {
        " wrote sonnets, under the common title of Destiny , commemorating the princes birth and death.     In the play Napoleon IV by ": null
    },
    {
        "Maurice Rostand": "maurice rostand"
    },
    {
        ", the Prince is killed in a carefully planned ambush arranged with the connivance of Queen Victoria, who fears that if he comes to power, France will outstrip Britain. In the climax to the play, the Princes fiancée confronts the Queen.     In a 42 Southern Daily Echo article, former Sapper George Harding  recalled being ordered to take a horse ambulance and find the Princes body and bring it back to the column. The Prince Imperial had been out on ": null
    },
    {
        "reconnaissance mission": "reconnaissance mission"
    },
    {
        " with a party of the ": null
    },
    {
        "42th Lancers": "17th lancers"
    },
    {
        ". Describing the mission, he said   We advanced to a dried up river bed and had to cut away the banks to get the ambulance across. Eventually, we reached a ": null
    },
    {
        "kraal": "kraal"
    },
    {
        " beside a large mealie field where we found the bodies of the Prince and some of his party. They had been surprised by Zulus as they rested in the kraal. The Zulus broke out of the ": null
    },
    {
        "mealie": "mealie"
    },
    {
        " field and killed them before they could remount their horses. The Prince had been stabbed 42 times with ": null
    },
    {
        "assegais": "assegais"
    },
    {
        ". We made a rough coffin and put his body in the ambulance. After burying the other bodies where they were found, we went back to the column. The Princes body was taken back to England for burial.      The Prince Imperial is a minor character in ": null
    },
    {
        "Donald Serrell Thomas": "donald serrell thomas"
    },
    {
        "s ": null
    },
    {
        "Sherlock Holmes": "sherlock holmes"
    },
    {
        " pastiche": "pastiche"
    },
    {
        " novel Death on a Pale Horse . His death is planned by a renegade British ex-officer , as part of a deliberate campaign to sabotage the British effort in the Zulu War, and the British Empire as a whole.             Image:Franz Xavier Winterhalter-The Empress Eugenie Holding Louis Napoleon.jpg|The Prince and his mother by ": null
    },
    {
        "Franz Xaver Winterhalter": "franz xaver winterhalter"
    },
    {
        ", 42   Image:The Four Napoleons.jpg|The Four Napoleons, c. 42   Image:Napoleon III Eugenie.jpg|The Prince with his parents in 42   Image:Buste Prince Impérial Compiègne.jpg|Bust of the Prince by ": null
    },
    {
        "Jean-Baptiste Carpeaux": "jean-baptiste carpeaux"
    },
    {
        ", c. 42   Image:Carpeaux napoleon iv.JPG|The Prince and his dog by ": null
    },
    {
        "Jean-Baptiste Carpeaux": "jean-baptiste carpeaux"
    },
    {
        ", c. 42   Image:Napoléon Eugène, Prince Imperial by W and D DOWNEY.jpg|The Prince Imperial, c. 42           Image:Prince Impérial juin 42jpg|The Prince in June 42   Image:Charles Porion Le prince imperial.jpg|Portrait by Charles Porion   Image:Prince impérial 42 42jpg|The Prince Imperial in 42   Image:Buste Prince imperial.jpg|Bust of the Prince   Image:Limpératrice Eugénie et son fils - 42 - James Tissot.jpg|The Prince and his mother by ": null
    },
    {
        "James Tissot": "james tissot"
    },
    {
        ", 42   Image:Napoleon Eugene Louis Bonaparte 42jpg|The Prince in uniform, c. 42            42–42:  His Imperial Highness  The Prince Imperial of France    42–42:  His Imperial Highness  Louis-Napoléon Bonaparte, Prince Imperial of France   42–42:  His Imperial Highness , Lieutenant Louis-Napoléon Bonaparte, Prince Imperial of France       Knight Grand Cross of the ": null
    },
    {
        "Legion of Honour": "legion of honour"
    },
    {
        " : Grand Cross of the ": null
    },
    {
        "Royal Hungarian Order of St. Stephen": "order of st. stephen of hungary"
    },
    {
        ", 42     : Grand Cordon of the ": null
    },
    {
        "Royal Order of Leopold": "order of leopold"
    },
    {
        ", 42 Almanach royal officiel, publié, exécution dun arrête du roi, Volume 42 ; Tarlier, 42   : Knight of the ": null
    },
    {
        "Order of the Elephant": "order of the elephant"
    },
    {
        ", 42 March 42    :    Grand Cross of the ": null
    },
    {
        "Order of the Tower and Sword": "order of the tower and sword"
    },
    {
        ", 42 ": null
    },
    {
        "United Orders": "sash of the two orders"
    },
    {
        " of ": null
    },
    {
        "Christ": "order of christ"
    },
    {
        " and ": null
    },
    {
        "Aviz": "order of aviz"
    },
    {
        ", 42  ": null
    },
    {
        "Kingdom of Sardinia": "kingdom of sardinia"
    },
    {
        ": Knight of the ": null
    },
    {
        "Order of the Annunciation": "supreme order of the most holy annunciation"
    },
    {
        ", 42 February 42    : Knight of the ": null
    },
    {
        "Order of the Rue Crown": "order of the rue crown"
    },
    {
        ", 42 Staatshandbuch für den Freistaat Sachsen  , Königliche Ritter-Orden , p. 42   : Knight of the ": null
    },
    {
        "Order of the Golden Fleece": "order of the golden fleece"
    },
    {
        ", 42 March 42      ": null
    },
    {
        "Sweden-Norway": "sweden-norway"
    },
    {
        ": Knight of the ": null
    },
    {
        "Royal Order of the Seraphim": "royal order of the seraphim"
    },
    {
        ", 42 June 42  ": null
    }
]