[
    {
        "   Nathaniel Hawthorne  was an American novelist, ": null
    },
    {
        "dark romantic": "Dark Romanticism"
    },
    {
        ", and short story writer. His works often focus on history, morality, and religion.     He was born in 1804 in ": null
    },
    {
        "Salem, Massachusetts": "Salem, Massachusetts"
    },
    {
        ", to Nathaniel Hathorne and the former Elizabeth Clarke Manning. His ancestors include ": null
    },
    {
        "John Hathorne": "John Hathorne"
    },
    {
        ", the only judge involved in the ": null
    },
    {
        "Salem witch trials": "Salem Witch Trials"
    },
    {
        " who never repented of his actions. He entered ": null
    },
    {
        "Bowdoin College": "Bowdoin College"
    },
    {
        " in 1821, was elected to ": null
    },
    {
        "Phi Beta Kappa": "Phi Beta Kappa"
    },
    {
        " in 1824,  , Phi Beta Kappa website, accessed Oct 4, 2009 and graduated in 1825. He published his first work in 1828, the novel  Fanshawe ; he later tried to suppress it, feeling that it was not equal to the standard of his later work.  He published several short stories in periodicals, which he collected in 1837 as  Twice-Told Tales . The next year, he became engaged to ": null
    },
    {
        "Sophia Peabody": "Sophia Hawthorne"
    },
    {
        ". He worked at the ": null
    },
    {
        "Boston Custom House": "Boston Custom House"
    },
    {
        " and joined ": null
    },
    {
        "Brook Farm": "Brook Farm"
    },
    {
        ", a ": null
    },
    {
        "transcendentalist": "Transcendentalism"
    },
    {
        " community, before marrying Peabody in 1842. The couple moved to ": null
    },
    {
        "The Old Manse": "The Old Manse"
    },
    {
        " in ": null
    },
    {
        "Concord, Massachusetts": "Concord, Massachusetts"
    },
    {
        ", later moving to Salem, ": null
    },
    {
        "the Berkshires": "The Berkshires"
    },
    {
        ", then to ": null
    },
    {
        "The Wayside": "The Wayside"
    },
    {
        " in Concord.  The Scarlet Letter  was published in 1850, followed by a succession of other novels. A political appointment as consul took Hawthorne and family to Europe before their return to Concord in 1860. Hawthorne died on May 19, 1864, and was survived by his wife and their three children.     Much of Hawthornes writing centers on ": null
    },
    {
        "New England": "New England"
    },
    {
        ", many works featuring moral ": null
    },
    {
        "metaphors": "Metaphor"
    },
    {
        "with an anti-": null
    },
    {
        "Puritan": "Puritan"
    },
    {
        " inspiration. His fiction works are considered part of the ": null
    },
    {
        "Romantic movement": "Romanticism"
    },
    {
        " and, more specifically, dark romanticism. His themes often center on the inherent evil and sin of humanity, and his works often have moral messages and deep psychological complexity. His published works include novels, short stories, and a biography of his college friend ": null
    },
    {
        "Franklin Pierce": "Franklin Pierce"
    },
    {
        ", the 14th ": null
    },
    {
        "President of the United States": "President Of The United States"
    },
    {
        ".              Nathaniel Hawthorne was born on July 4, 1804, in ": null
    },
    {
        "Salem": "Salem, Massachusetts"
    },
    {
        ", Massachusetts; ": null
    },
    {
        "his birthplace": "Nathaniel Hawthorne Birthplace"
    },
    {
        " is preserved and open to the public. Haas, Irvin. Historic Homes of American Authors. Washington, DC: The Preservation Press, 1991: 118. . ": null
    },
    {
        "William Hathorne": "William Hathorne"
    },
    {
        " was the authors great-great-great-grandfather. He was a ": null
    },
    {
        "Puritan": "Puritan"
    },
    {
        " and was the first of the family to emigrate from England, settling in ": null
    },
    {
        "Dorchester, Massachusetts": "Dorchester, Massachusetts"
    },
    {
        ", before moving to Salem. There he became an important member of the ": null
    },
    {
        "Massachusetts Bay Colony": "Massachusetts Bay Colony"
    },
    {
        " and held many political positions, including magistrate and judge, becoming infamous for his harsh sentencing. Miller, 20–21 Williams son and the authors great-great-grandfather ": null
    },
    {
        "John Hathorne": "John Hathorne"
    },
    {
        " was one of the judges who oversaw the ": null
    },
    {
        "Salem witch trials": "Salem Witch Trials"
    },
    {
        ". Hawthorne probably added the w to his surname in his early twenties, shortly after graduating from college, in an effort to dissociate himself from his notorious forebears. McFarland, 18 Hawthornes father Nathaniel Hathorne Sr. was a sea captain who died in 1808 of ": null
    },
    {
        "yellow fever": "Yellow Fever"
    },
    {
        " in ": null
    },
    {
        "Suriname": "Suriname"
    },
    {
        "; Wineapple, 20–21 he had been a member of the ": null
    },
    {
        "East India Marine Society": "East India Marine Society"
    },
    {
        ".  After his death, his widow moved with young Nathaniel and two daughters to live with relatives named the Mannings in Salem, McFarland, 17 where they lived for 10 years. Young Hawthorne was hit on the leg while playing bat and ball on November 10, 1813, Miller, 47 and he became lame and bedridden for a year, though several physicians could find nothing wrong with him. Mellow, 18          In the summer of 1816, the family lived as boarders with farmers Mellow, 20 before moving to a home recently built specifically for them by Hawthornes uncles Richard and Robert Manning in ": null
    },
    {
        "Raymond, Maine": "Raymond, Maine"
    },
    {
        ", near ": null
    },
    {
        "Sebago Lake": "Sebago Lake"
    },
    {
        ". Miller, 50 Years later, Hawthorne looked back at his time in Maine fondly: Those were delightful days, for that part of the country was wild then, with only scattered clearings, and nine tenths of it primeval woods. Mellow, 21 In 1819, he was sent back to Salem for school and soon complained of homesickness and being too far from his mother and sisters. Mellow, 22 He distributed seven issues of The Spectator to his family in August and September 1820 for the sake of having fun. The homemade newspaper was written by hand and included essays, poems, and news featuring the young authors adolescent humor. Miller, 57     Hawthornes uncle Robert Manning insisted that the boy attend college, despite Hawthornes protests. Edwards, Herbert.  , Downeast Magazine, 1962 With the financial support of his uncle, Hawthorne was sent to ": null
    },
    {
        "Bowdoin College": "Bowdoin College"
    },
    {
        " in 1821, partly because of family connections in the area, and also because of its relatively inexpensive tuition rate. Wineapple, 44–45 Hawthorne met future president ": null
    },
    {
        "Franklin Pierce": "Franklin Pierce"
    },
    {
        " on the way to Bowdoin, at the stage stop in Portland, and the two became fast friends. Once at the school, he also met future poet ": null
    },
    {
        "Henry Wadsworth Longfellow": "Henry Wadsworth Longfellow"
    },
    {
        ", future congressman ": null
    },
    {
        "Jonathan Cilley": "Jonathan Cilley"
    },
    {
        ", and future naval reformer ": null
    },
    {
        "Horatio Bridge": "Horatio Bridge"
    },
    {
        ". Cheever, 99 He graduated with the class of 1825, and later described his college experience to ": null
    },
    {
        "Richard Henry Stoddard": "Richard Henry Stoddard"
    },
    {
        ":               In 1836, Hawthorne served as the editor of the  American Magazine of Useful and Entertaining Knowledge . At the time, he boarded with poet ": null
    },
    {
        "Thomas Green Fessenden": "Thomas Green Fessenden"
    },
    {
        " on Hancock Street in Beacon Hill in ": null
    },
    {
        "Boston": "Boston"
    },
    {
        ". Wineapple, 87–88 He was offered an appointment as weigher and gauger at the ": null
    },
    {
        "Boston Custom House": "Boston Custom House"
    },
    {
        " at a salary of $1,500 a year, which he accepted on January 17, 1839. Miller, 169 During his time there, he rented a room from ": null
    },
    {
        "George Stillman Hillard": "George Stillman Hillard"
    },
    {
        ", business partner of ": null
    },
    {
        "Charles Sumner": "Charles Sumner"
    },
    {
        ". Mellow, 169 Hawthorne wrote in the comparative obscurity of what he called his owls nest in the family home. As he looked back on this period of his life, he wrote: I have not lived, but only dreamed about living. Letter to Longfellow, June 4, 1837. He contributed short stories to various magazines and annuals, including ": null
    },
    {
        "Young Goodman Brown": "Young Goodman Brown"
    },
    {
        " and ": null
    },
    {
        "The Ministers Black Veil": "The Ministers Black Veil"
    },
    {
        " , though none drew major attention to him. ": null
    },
    {
        "Horatio Bridge": "Horatio Bridge"
    },
    {
        " offered to cover the risk of collecting these stories in the spring of 1837 into the volume  Twice-Told Tales , which made Hawthorne known locally. McFarland, 22–23          While at Bowdoin, Hawthorne wagered a bottle of ": null
    },
    {
        "Madeira wine": "Madeira Wine"
    },
    {
        " with his friend Jonathan Cilley that Cilley would get married before Hawthorne did. Manning Hawthorne, Nathaniel Hawthorne at Bowdoin , The New England Quarterly, Vol. 13, No. 2 : 246–279. By 1836, he had won the bet, but he did not remain a bachelor for life. He had public flirtations with Mary Silsbee and ": null
    },
    {
        "Elizabeth Peabody": "Elizabeth Peabody"
    },
    {
        ", Cheever, 102 then he began pursuing Peabodys sister, ": null
    },
    {
        "illustrator": "Illustrator"
    },
    {
        " and ": null
    },
    {
        "transcendentalist": "Transcendentalism"
    },
    {
        " Sophia Peabody": "Sophia Hawthorne"
    },
    {
        ". He joined the transcendentalist ": null
    },
    {
        "Utopia": "Utopia"
    },
    {
        "n community at ": null
    },
    {
        "Brook Farm": "Brook Farm"
    },
    {
        " in 1841, not because he agreed with the experiment but because it helped him save money to marry Sophia. McFarland, 83 He paid a $1,000 deposit and was put in charge of shoveling the hill of manure referred to as the Gold Mine . Cheever, 104 He left later that year, though his Brook Farm adventure became an inspiration for his novel  The Blithedale Romance . McFarland, 149 Hawthorne married Sophia Peabody on July 9, 1842, at a ceremony in the Peabody parlor on West Street in Boston. Wineapple, 160 The couple moved to ": null
    },
    {
        "The Old Manse": "The Old Manse"
    },
    {
        " in ": null
    },
    {
        "Concord, Massachusetts": "Concord, Massachusetts"
    },
    {
        ", McFarland, 25 where they lived for three years. His neighbor ": null
    },
    {
        "Ralph Waldo Emerson": "Ralph Waldo Emerson"
    },
    {
        " invited him into his social circle, but Hawthorne was almost pathologically shy and stayed silent at gatherings. Schreiner, 123 At the Old Manse, Hawthorne wrote most of the tales collected in  Mosses from an Old Manse . Miller, 246–247      Like Hawthorne, Sophia was a reclusive person. Throughout her early life, she had frequent ": null
    },
    {
        "migraines": "Migraine"
    },
    {
        "and underwent several experimental medical treatments. Mellow, 6–7 She was mostly bedridden until her sister introduced her to Hawthorne, after which her headaches seem to have abated. The Hawthornes enjoyed a long and happy marriage. He referred to her as his Dove and wrote that she is, in the strictest sense, my sole companion; and I need no other—there is no vacancy in my mind, any more than in my heart ... Thank God that I suffice for her boundless heart! McFarland, 87 Sophia greatly admired her husbands work. She wrote in one of her journals:   I am always so dazzled and bewildered with the richness, the depth, the  ... jewels of beauty in his productions that I am always looking forward to a second reading where I can ponder and muse and fully take in the miraculous wealth of thoughts. January 14, 1851, Journal of Sophia Hawthorne. Berg Collection NY Public Library.     Poet ": null
    },
    {
        "Ellery Channing": "William Ellery Channing"
    },
    {
        " came to the Old Manse for help on the first anniversary of the Hawthornes marriage. A local teenager named Martha Hunt had drowned herself in the river and Hawthornes boat Pond Lily was needed to find her body. Hawthorne helped recover the corpse, which he described as a spectacle of such perfect horror  ... She was the very image of death-agony . Schreiner, 116–117 The incident later inspired a scene in his novel The Blithedale Romance.     The Hawthornes had three children. Their first was daughter Una, born March 3, 1844; her name was a reference to  The Faerie Queene , to the displeasure of family members. McFarland, 97 Hawthorne wrote to a friend, I find it a very sober and serious kind of happiness that springs from the birth of a child  ... There is no escaping it any longer. I have business on earth now, and must look about me for the means of doing it. Schreiner, 119 In October 1845, the Hawthornes moved to Salem. Reynolds, 10 In 1846, their son ": null
    },
    {
        "Julian": "Julian Hawthorne"
    },
    {
        " was born. Hawthorne wrote to his sister Louisa on June 22, 1846: A small troglodyte made his appearance here at ten minutes to six oclock this morning, who claimed to be your nephew. Mellow, 273 Daughter ": null
    },
    {
        "Rose": "Mother Mary Alphonsa"
    },
    {
        " was born in May 1851, and Hawthorne called her his autumnal flower . Miller, 343–344          In April 1846, Hawthorne was officially appointed the Surveyor for the District of Salem and Beverly and Inspector of the Revenue for the Port of Salem at an annual salary of $1,200. Miller, 242 He had difficulty writing during this period, as he admitted to Longfellow:     I am trying to resume my pen  ... Whenever I sit alone, or walk alone, I find myself dreaming about stories, as of old; but these forenoons in the Custom House undo all that the afternoons and evenings have done. I should be happier if I could write. Miller, 265     This employment, like his earlier appointment to the custom house in Boston, was vulnerable to the politics of the ": null
    },
    {
        "spoils system": "Spoils System"
    },
    {
        ". Hawthorne was a Democrat and lost this job due to the change of administration in Washington after the presidential election of 1848. He wrote a letter of protest to the Boston Daily Advertiser which was attacked by the ": null
    },
    {
        "Whigs": "Whig Party"
    },
    {
        " and supported by the Democrats, making Hawthornes dismissal a much-talked about event in New England. Cheever, 179 He was deeply affected by the death of his mother in late July, calling it the darkest hour I ever lived . Cheever, 180 He was appointed the corresponding secretary of the Salem Lyceum in 1848. Guests who came to speak that season included Emerson, Thoreau, ": null
    },
    {
        "Louis Agassiz": "Louis Agassiz"
    },
    {
        ", and ": null
    },
    {
        "Theodore Parker": "Theodore Parker"
    },
    {
        ". Miller, 264–265     Hawthorne returned to writing and published  The Scarlet Letter  in mid-March 1850, Miller, 300 including a preface that refers to his three-year tenure in the Custom House and makes several allusions to local politicians—who did not appreciate their treatment. Mellow, 316 It was one of the first mass-produced books in America, selling 2,500 volumes within ten days and earning Hawthorne $1,500 over 14 years. McFarland, 136 The book was pirated by booksellers in London and became a best-seller in the United States; Cheever, 181 it initiated his most lucrative period as a writer. Hawthornes friend ": null
    },
    {
        "Edwin Percy Whipple": "Edwin Percy Whipple"
    },
    {
        " objected to the novels morbid intensity and its dense psychological details, writing that the book is therefore apt to become, like Hawthorne, too painfully anatomical in his exhibition of them , Miller, 301–302 though 20th-century writer ": null
    },
    {
        "D.  H. Lawrence": "D. & Nbsp;H. Lawrence"
    },
    {
        " said that there could be no more perfect work of the American imagination than The Scarlet Letter. Miller, 284     Hawthorne and his family moved to a small red farmhouse near ": null
    },
    {
        "Lenox, Massachusetts": "Lenox, Massachusetts"
    },
    {
        ", at the end of March 1850. Miller, 274 He became friends with ": null
    },
    {
        "Herman Melville": "Herman Melville"
    },
    {
        " beginning on August 5, 1850, when the authors met at a picnic hosted by a mutual friend. Cheever, 96 Melville had just read Hawthornes short story collection  Mosses from an Old Manse , and his unsigned review of the collection was printed in  The Literary World  on August 17 and August 24 titled Hawthorne and His Mosses . Miller, 312 Melville wrote that these stories revealed a dark side to Hawthorne, shrouded in blackness, ten times black . Mellow, 335 He was composing his novel  Moby-Dick  at the time, and dedicated the work in 1851 to Hawthorne: In token of my admiration for his genius, this book is inscribed to Nathaniel Hawthorne. Mellow, 382     Hawthornes time in the ": null
    },
    {
        "Berkshires": "Berkshires"
    },
    {
        " was very productive. Wright, John Hardy. Hawthornes Haunts in New England. Charleston, SC: The History Press, 2008: 93.  While there, he wrote  The House of the Seven Gables  , which poet and critic ": null
    },
    {
        "James Russell Lowell": "James Russell Lowell"
    },
    {
        " said was better than The Scarlet Letter and called the most valuable contribution to New England history that has been made. Mellow, 368–369 He also wrote  The Blithedale Romance  , his only work written in the first person. He also published  A Wonder-Book for Girls and Boys  in 1851, a collection of short stories retelling myths which he had been thinking about writing since 1846. Miller, 345 Nevertheless, poet ": null
    },
    {
        "Ellery Channing": "William Ellery Channing"
    },
    {
        " reported that Hawthorne has suffered much living in this place . Wineapple, 241 The family enjoyed the scenery of the Berkshires, although Hawthorne did not enjoy the winters in their small house. They left on November 21, 1851. Hawthorne noted, I am sick to death of Berkshire  ... I have felt languid and dispirited, during almost my whole residence. Wineapple, 242          In May 1852, the Hawthornes returned to Concord where they lived until July 1853. In February, they bought The Hillside, a home previously inhabited by ": null
    },
    {
        "Amos Bronson Alcott": "Amos Bronson Alcott"
    },
    {
        " and his family, and renamed it ": null
    },
    {
        "The Wayside": "The Wayside"
    },
    {
        ". McFarland, 129–130 Their neighbors in Concord included Emerson and ": null
    },
    {
        "Henry David Thoreau": "Henry David Thoreau"
    },
    {
        ". McFarland, 182 That year, Hawthorne wrote The Life of Franklin Pierce, the campaign biography of his friend which depicted him as a man of peaceful pursuits . Miller, 381 ": null
    },
    {
        "Horace Mann": "Horace Mann"
    },
    {
        " said, If he makes out Pierce to be a great man or a brave man, it will be the greatest work of fiction he ever wrote. In the biography, Hawthorne depicts Pierce as a statesman and soldier who had accomplished no great feats because of his need to make little noise and so withdrew into the background . Schreiner, 170–171 He also left out Pierces drinking habits, despite rumors of his alcoholism, Mellow, 412 and emphasized Pierces belief that slavery could not be remedied by human contrivances but would, over time, vanish like a dream . Miller, 382–383 With Pierces election as ": null
    },
    {
        "President": "List Of Presidents Of The United States"
    },
    {
        ", Hawthorne was rewarded in 1853 with the position of United States ": null
    },
    {
        "consul": "Consul"
    },
    {
        " in ": null
    },
    {
        "Liverpool": "Consulate Of The United States In Liverpool"
    },
    {
        " shortly after the publication of  Tanglewood Tales . McFarland, 186 The role was considered the most lucrative foreign service position at the time, described by Hawthornes wife as second in dignity to the Embassy in London . Mellow, 415 His appointment ended in 1857 at the close of the ": null
    },
    {
        "Pierce administration": "Franklin Piercepresidency"
    },
    {
        ", and the Hawthorne family toured France and Italy. During his time in Italy, the previously clean-shaven Hawthorne grew a bushy mustache. McFarland, 210     The family returned to The Wayside in 1860, McFarland, 206 and that year saw the publication of  The Marble Faun , his first new book in seven years. Mellow, 520 Hawthorne admitted that he had aged considerably, referring to himself as wrinkled with time and trouble . Schreiner, 207            At the outset of the ": null
    },
    {
        "American Civil War": "American Civil War"
    },
    {
        ", Hawthorne traveled with ": null
    },
    {
        "William D. Ticknor": "William D. Ticknor"
    },
    {
        " to Washington, D.C., where he met ": null
    },
    {
        "Abraham Lincoln": "Abraham Lincoln"
    },
    {
        " and other notable figures. He wrote about his experiences in the essay ": null
    },
    {
        "Chiefly About War Matters": "Chiefly About War Matters"
    },
    {
        " in 1862.     Failing health prevented him from completing several more romance novels. Hawthorne was suffering from pain in his stomach and insisted on a recuperative trip with his friend Franklin Pierce, though his neighbor Bronson Alcott was concerned that Hawthorne was too ill. Wineapple, 372 While on a tour of the ": null
    },
    {
        "White Mountains": "White Mountains"
    },
    {
        ", he died in his sleep on May 19, 1864, in ": null
    },
    {
        "Plymouth, New Hampshire": "Plymouth, New Hampshire"
    },
    {
        ". Pierce sent a ": null
    },
    {
        "telegram": "Telegram"
    },
    {
        " to ": null
    },
    {
        "Elizabeth Peabody": "Elizabeth Peabody"
    },
    {
        " asking her to inform Mrs. Hawthorne in person. Mrs. Hawthorne was too saddened by the news to handle the funeral arrangements herself. Miller, 518 Hawthornes son Julian was a freshman at ": null
    },
    {
        "Harvard College": "Harvard College"
    },
    {
        ", and he learned of his fathers death the next day; coincidentally, he was initiated into the ": null
    },
    {
        "Delta Kappa Epsilon": "Delta Kappa Epsilon"
    },
    {
        " fraternity on the same day by being blindfolded and placed in a coffin.  Longfellow wrote a tribute poem to Hawthorne published in 1866 called ": null
    },
    {
        "The Bells of Lynn": "S:The Bells Of Lynn"
    },
    {
        " . Wagenknecht, Edward. Henry Wadsworth Longfellow: Portrait of an American Humanist. New York: Oxford University Press, 1966: 9. Hawthorne was buried on what is now known as Authors Ridge in ": null
    },
    {
        "Sleepy Hollow Cemetery, Concord": "Sleepy Hollow Cemetery, Concord"
    },
    {
        ", ": null
    },
    {
        "Massachusetts": "Massachusetts"
    },
    {
        ". Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 . McFarland & Company, Inc., Publishers. Kindle Edition. Pallbearers included Longfellow, Emerson, Alcott, ": null
    },
    {
        "Oliver Wendell Holmes Sr.": "Oliver Wendell Holmes Sr."
    },
    {
        ", ": null
    },
    {
        "James Thomas Fields": "James Thomas Fields"
    },
    {
        ", and ": null
    },
    {
        "Edwin Percy Whipple": "Edwin Percy Whipple"
    },
    {
        ". Baker, Carlos. Emerson Among the Eccentrics: A Group Portrait. New York: Viking Press, 1996: 448. . Emerson wrote of the funeral: I thought there was a tragic element in the event, that might be more fully rendered—in the painful solitude of the man, which, I suppose, could no longer be endured, & he died of it. McFarland, 297     His wife Sophia and daughter Una were originally buried in England. However, in June 2006, they were reinterred in plots adjacent to Hawthorne. Mishra, Raja and Sally Heaney.  , The Boston Globe. June 1, 2006. Accessed July 4, 2008          Hawthorne had a particularly close relationship with his publishers ": null
    },
    {
        "William Ticknor": "William Ticknor"
    },
    {
        " and ": null
    },
    {
        "James Thomas Fields": "James Thomas Fields"
    },
    {
        ". Madison, 9 Hawthorne once told Fields, I care more for your good opinion than for that of a host of critics. Miller, 281 In fact, it was Fields who convinced Hawthorne to turn The Scarlet Letter into a novel rather than a short story. Charvat, William. Literary Publishing in America: 1790–1850. Amherst, MA: The ": null
    },
    {
        "University of Massachusetts Press": "University Of Massachusetts Press"
    },
    {
        ", 1993 : 56.  Ticknor handled many of Hawthornes personal matters, including the purchase of cigars, overseeing financial accounts, and even purchasing clothes. Madison, 15 Ticknor died with Hawthorne at his side in Philadelphia in 1864; according to a friend, Hawthorne was left apparently dazed . Miller, 513–514       Hawthornes works belong to ": null
    },
    {
        "romanticism": "Romanticism"
    },
    {
        " or, more specifically, ": null
    },
    {
        "dark romanticism": "Dark Romanticism"
    },
    {
        ", Reynolds, David S. Beneath the American Renaissance: The Subversive Imagination in the Age of Emerson and Melville. Cambridge, Massachusetts: Harvard University Press, 1988: 524.  cautionary tales that suggest that guilt, sin, and evil are the most inherent natural qualities of humanity. Wayne, Tiffany K. Nathaniel Hawthorne , Encyclopedia of Transcendentalism. New York: Facts on File, Inc., 2006: 140. . Many of his works are inspired by Puritan ": null
    },
    {
        "New England": "New England"
    },
    {
        ", Bell, Michael Davitt. Hawthorne and the Historical Romance of New England. Boston: Houghton Mifflin Company, 1980: 173.  combining historical romance loaded with symbolism and deep psychological themes, bordering on surrealism. Howe, Daniel Walker. What Hath God Wrought: The Transformation of America, 1815–1848. New York: Oxford University Press, 2007: 633. . His depictions of the past are a version of historical fiction used only as a vehicle to express common themes of ancestral sin, guilt and retribution. Crews, 28–29 His later writings also reflect his negative view of the ": null
    },
    {
        "Transcendentalism": "Transcendentalism"
    },
    {
        " movement. Galens, David, ed. Literary Movements for Students, Vol. 1. Detroit: Thompson Gale, 2002: 319.      Hawthorne was predominantly a short story writer in his early career. Upon publishing Twice-Told Tales, however, he noted, I do not think much of them, and he expected little response from the public. Miller, 104 His four major ": null
    },
    {
        "romances": "Novel19Th Century Novels"
    },
    {
        " were written between 1850 and 1860:  The Scarlet Letter  ,  The House of the Seven Gables  ,  The Blithedale Romance  and  The Marble Faun  . Another novel-length romance,  Fanshawe , was published anonymously in 1828. Hawthorne defined a romance as being radically different from a novel by not being concerned with the possible or probable course of ordinary experience. Porte, 95 In the preface to The House of the Seven Gables, Hawthorne describes his romance-writing as using atmospherical medium as to bring out or mellow the lights and deepen and enrich the shadows of the picture . Wineapple, 237 The picture, Daniel Hoffman found, was one of the primitive energies of fecundity and creation. Hoffman, 356     Critics have applied ": null
    },
    {
        "feminist perspectives": "Feminist Literary Criticism"
    },
    {
        " and ": null
    },
    {
        "historicist approaches": "Historicism"
    },
    {
        " to Hawthornes depictions of women. Feminist scholars are interested particularly in ": null
    },
    {
        "Hester Prynne": "Hester Prynne"
    },
    {
        ": they recognize that while she herself could not be the destined prophetess of the future, the angel and apostle of the coming revelation must nevertheless be a woman. The Scarlet Letter Ch XXIV Conclusion ": null
    },
    {
        "Camille Paglia": "Camille Paglia"
    },
    {
        " saw Hester as mystical, a wandering goddess still bearing the mark of her Asiatic origins  ... moving serenely in the magic circle of her sexual nature . Paglia, Sexual Personae, 581, 583 Lauren Berlant termed Hester the citizen as woman love as a quality of the body that contains the purest light of nature, her resulting traitorous political theory a Female Symbolic literalization of futile Puritan metaphors. Berlant, The Anatomy of National Fantasy, 94, 148, 175 Historicists view Hester as a ": null
    },
    {
        "protofeminist": "Protofeminist"
    },
    {
        " and avatar of the self-reliance and responsibility that led to womens suffrage and reproductive emancipation. Anthony Splendora found her literary genealogy among other archetypally fallen but redeemed women, both historic and mythic. As examples, he offers ": null
    },
    {
        "Psyche": "Cupid And Psyche"
    },
    {
        " of ancient legend; ": null
    },
    {
        "Heloise": "Héloïse"
    },
    {
        " of twelfth-century Frances tragedy involving world-renowned philosopher ": null
    },
    {
        "Peter Abelard": "Peter Abelard"
    },
    {
        "; ": null
    },
    {
        "Anne Hutchinson": "Anne Hutchinson"
    },
    {
        " , and Hawthorne family friend ": null
    },
    {
        "Margaret Fuller": "Margaret Fuller"
    },
    {
        ". Splendora, Psyche and Hester , 2, 5, 18 In Hesters first appearance, Hawthorne likens her, infant at her bosom , to Mary, Mother of Jesus, the image of Divine Maternity . In her study of Victorian literature, in which such galvanic outcasts as Hester feature prominently, ": null
    },
    {
        "Nina Auerbach": "Nina Auerbach"
    },
    {
        " went so far as to name Hesters fall and subsequent redemption, the novels one unequivocally religious activity . Auerbach, Woman and the Demon, 150, 166 Regarding Hester as a deity figure, Meredith A. Powers found in Hesters characterization the earliest in American fiction that the archetypal Goddess appears quite graphically, like a Goddess not the wife of traditional marriage, permanently subject to a male overlord ; Powers noted her syncretism, her flexibility, her inherent ability to alter and so avoid the defeat of secondary status in a goal-oriented civilization . Powers, The Heroine in Western Literature, 144     Aside from Hester Prynne, the model women of Hawthornes other novels—from Ellen Langton of Fanshawe to Zenobia and Priscilla of The Blithedale Romance, Hilda and Miriam of The Marble Faun and Phoebe and Hepzibah of The House of the Seven Gables—are more fully realized than his male characters, who merely orbit them. Splendora, Psyche and Hester , 12 This observation is equally true of his short-stories, in which central females serve as allegorical figures: Rappaccinis beautiful but life-altering, garden-bound, daughter; almost-perfect Georgiana of The Birthmark ; the sinned-against Ester of Ethan Brand ; and goodwife Faith Brown, linchpin of Young Goodman Browns very belief in God. My Faith is gone! Brown exclaims in despair upon seeing his wife at the Witches Sabbath.. Perhaps the most sweeping statement of Hawthornes impetus comes from Mark Van Doren: Somewhere, if not in the New England of his time, Hawthorne unearthed the image of a goddess supreme in beauty and power. Van Doren 19     Hawthorne also wrote nonfiction. In 2008, the ": null
    },
    {
        "Library of America": "Library Of America"
    },
    {
        " selected Hawthornes A show of wax-figures for inclusion in its two-century retrospective of American True Crime. , Library of America website, accessed Jan 30, 2018       In Hawthorne and His Mosses , Herman Melville wrote a passionate argument for Hawthorne to be among the burgeoning American literary canon, He is one of the new, and far better generation of your writers. In this review of Mosses from an Old Manse, Melville describes an affinity for Hawthorne that would only increase: I feel that this Hawthorne has dropped germinous seeds into my soul. He expands and deepens down, the more I contemplate him; and further, and further, shoots his strong New-England roots into the hot soil of my Southern soul.  ": null
    },
    {
        "Edgar Allan Poe": "Edgar Allan Poe"
    },
    {
        " wrote important reviews of both Twice-Told Tales and Mosses from an Old Manse. Poes assessment was partly informed by his contempt of allegory and moral tales, and his chronic accusations of plagiarism, though he admitted,     The style of Mr. Hawthorne is purity itself. His tone is singularly effective—wild, plaintive, thoughtful, and in full accordance with his themes  ... We look upon him as one of the few men of indisputable genius to whom our country has as yet given birth. McFarland, 88–89 ": null
    },
    {
        "Ralph Waldo Emerson": "Ralph Waldo Emerson"
    },
    {
        " wrote, Nathaniel Hawthornes reputation as a writer is a very pleasing fact, because his writing is not good for anything, and this is a tribute to the man. Nelson, Randy F. . The Almanac of American Letters. Los Altos, California: William Kaufmann, Inc., 1981: 150. . ": null
    },
    {
        "Henry James": "Henry James"
    },
    {
        " praised Hawthorne, saying, The fine thing in Hawthorne is that he cared for the deeper psychology, and that, in his way, he tried to become familiar with it. Porte, 97 Poet ": null
    },
    {
        "John Greenleaf Whittier": "John Greenleaf Whittier"
    },
    {
        " wrote that he admired the weird and subtle beauty in Hawthornes tales. Woodwell, Roland H. John Greenleaf Whittier: A Biography. Haverhill, Massachusetts: Trustees of the John Greenleaf Whittier Homestead, 1985: 293. ": null
    },
    {
        "Evert Augustus Duyckinck": "Evert Augustus Duyckinck"
    },
    {
        " said of Hawthorne, Of the American writers destined to live, he is the most original, the one least indebted to foreign models or literary precedents of any kind. McFarland, 88     Contemporary response to Hawthornes work praised his sentimentality and moral purity while more modern evaluations focus on the dark psychological complexity. Person, Leland S. Bibliographical Essay: Hawthorne and History , collected in A Historical Guide to Nathaniel Hawthorne. Oxford University Press, 2001: 187. . Beginning in the 1950s, critics have focused on symbolism and didacticism. Crews, 4     The critic ": null
    },
    {
        "Harold Bloom": "Harold Bloom"
    },
    {
        " opined that only ": null
    },
    {
        "Henry James": "Henry James"
    },
    {
        " and ": null
    },
    {
        "William Faulkner": "William Faulkner"
    },
    {
        " challenge Hawthornes position as the greatest American novelist, although he admitted that he favored James as the greatest American novelist. Nathaniel Hawthorne by Harold Bloom p. 9  Nathaniel Hawthorne by Harold Bloom p. xii Bloom saw Hawthornes greatest works to be principally The Scarlet Letter, followed by The Marble Faun and certain short stories, including My Kinsman, Major Molineux , Young Goodman Brown , Wakefield , and Feathertop .          The definitive edition of Hawthornes works Rita K. Gollin, , ": null
    },
    {
        "American National Biography": "American National Biography"
    },
    {
        " Online Feb. 2000 is The Centenary Edition of the Works of Nathaniel Hawthorne, edited by William Charvat and others, published by The ": null
    },
    {
        "Ohio State University Press": "Ohio State University Press"
    },
    {
        " in twenty-three volumes between 1962 and 1997.  Tales and Sketches was the second volume to be published in the Library of America, Collected Novels the tenth.         Fanshawe  Publication info on books from  to The Scarlet Letter by Nathaniel Hawthorne, Page by Page Books, accessed June 11, 2007.    The Scarlet Letter     The House of the Seven Gables     The Blithedale Romance     The Marble Faun: Or, The Romance of Monte Beni     The Dolliver Romance   Septimius Felton; or, the Elixir of Life    Doctor Grimshawes Secret: A Romance        Twice-Told Tales    Grandfathers Chair    Mosses from an Old Manse     A Wonder-Book for Girls and Boys     The Snow-Image, and Other Twice-Told Tales     Tanglewood Tales    The Dolliver Romance and Other Pieces   The Great Stone Face and Other Tales of the White Mountains       The Hollow of the Three Hills   ": null
    },
    {
        "Roger Malvins Burial": "Roger Malvins Burial"
    },
    {
        "   My Kinsman, Major Molineux": "My Kinsman, Major Molineux"
    },
    {
        "   The Ministers Black Veil": "The Ministers Black Veil"
    },
    {
        "   Young Goodman Brown": "Young Goodman Brown"
    },
    {
        "   The Gray Champion   The White Old Maid   Wakefield   ": null
    },
    {
        "The Ambitious Guest": "The Ambitious Guest"
    },
    {
        "   The Man of Adamant": "The Man Of Adamant"
    },
    {
        "   The May-Pole of Merry Mount": "The May-Pole Of Merry Mount"
    },
    {
        "   The Great Carbuncle": "The Great Carbuncle"
    },
    {
        "   Dr. Heideggers Experiment": "Dr. Heideggers Experiment"
    },
    {
        "   A Virtuosos Collection": "A Virtuosos Collection"
    },
    {
        "   The Birth-Mark": "The Birth-Mark"
    },
    {
        "   The Celestial Railroad": "The Celestial Railroad"
    },
    {
        "   Egotism; or, The Bosom-Serpent": "Egotism; Or, The Bosom-Serpent"
    },
    {
        "   Earths Holocaust   ": null
    },
    {
        "Rappaccinis Daughter": "Rappaccinis Daughter"
    },
    {
        "   P.s Correspondence": "P.S Correspondence"
    },
    {
        "   The Artist of the Beautiful": "The Artist Of The Beautiful"
    },
    {
        "   Fire Worship   ": null
    },
    {
        "Ethan Brand": "Ethan Brand"
    },
    {
        "   The Great Stone Face": "The Great Stone Face"
    },
    {
        "   Feathertop": "Feathertop"
    },
    {
        "       Twenty Days with Julian & Little Bunny   Our Old Home   Passages from the French and Italian Notebooks": null
    }
]