[
    {
        "         The National Geographic Society , headquartered in ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        ", ": null
    },
    {
        "United States": "united states"
    },
    {
        ", is one of the largest ": null
    },
    {
        "non-profit": "non-profit"
    },
    {
        " scientific and ": null
    },
    {
        "education": "education"
    },
    {
        "al organizations in the world. Founded in 1888, its interests include ": null
    },
    {
        "geography": "geography"
    },
    {
        ", ": null
    },
    {
        "archaeology": "archaeology"
    },
    {
        ", and ": null
    },
    {
        "natural science": "natural science"
    },
    {
        ", the promotion of ": null
    },
    {
        "environmental": "environmental protection"
    },
    {
        " and ": null
    },
    {
        "historical": "historical preservation"
    },
    {
        " conservation": "conservation movement"
    },
    {
        ", and the study of ": null
    },
    {
        "world culture": "civilization"
    },
    {
        " and ": null
    },
    {
        "history": "world history"
    },
    {
        ". The National Geographic Societys logo is a yellow ": null
    },
    {
        "portrait": "page orientation"
    },
    {
        " frame—rectangular in shape—which appears on the ": null
    },
    {
        "margins": "margin"
    },
    {
        " surrounding the front covers of its magazines and as its television channel logo. Through ": null
    },
    {
        "National Geographic Partners": "national geographic partners"
    },
    {
        " , the Society operates the ": null
    },
    {
        "magazine": "national geographic"
    },
    {
        ", ": null
    },
    {
        "TV channels": "national geographic global networks"
    },
    {
        ", a website, worldwide events, and other media operations.          The National Geographic Society was founded in 1888 to increase and diffuse geographic knowledge . It is governed by a board of trustees, whose 21 members include distinguished educators, business executives, former government officials and conservationists. The organization sponsors and funds scientific research and exploration. National Geographic maintains a museum for the public in its Washington, D.C., headquarters.     It has helped to sponsor popular traveling exhibits, such as the early 2010s King Tut exhibit featuring artifacts from the tomb of the young ": null
    },
    {
        "Egyptian": "ancient egypt"
    },
    {
        " Pharaoh": "pharaoh"
    },
    {
        ". Its Education Foundation gives grants to education organizations and individuals to improve geography education.  Its Committee for Research and Exploration has awarded more than 11,000 grants for scientific research and exploration.     National Geographic has retail stores in Washington, D.C., London, Sydney, and Panama. The locations outside of the United States are operated by ": null
    },
    {
        "Worldwide Retail Store": "worldwide retail store"
    },
    {
        " S.L., a Spanish holding company.     The Societys media arm is ": null
    },
    {
        "National Geographic Partners": "national geographic partners"
    },
    {
        ", a joint venture between ": null
    },
    {
        "The Walt Disney Company": "the walt disney company"
    },
    {
        " and the Society, which publishes a journal,  National Geographic  in English and nearly 40 local-language editions. It also publishes other magazines, books, school products, maps, and Web and film products in numerous languages and countries. National Geographics various media properties reach more than 280 million people monthly.              The National Geographic Society began as a club for an elite group of academics and wealthy patrons interested in travel and exploration.  On January 13, 1888, 33 explorers and scientists gathered at the ": null
    },
    {
        "Cosmos Club": "cosmos club"
    },
    {
        ", a private club then located on ": null
    },
    {
        "Lafayette Square": "presidents parklafayette square"
    },
    {
        " in Washington, D.C., to organize a society for the increase and diffusion of ": null
    },
    {
        "geographical": "geography"
    },
    {
        " knowledge. After preparing a constitution and a plan of organization, the National Geographic Society was incorporated two weeks later on January 27. ": null
    },
    {
        "Gardiner Greene Hubbard": "gardiner greene hubbard"
    },
    {
        " became its first president and his son-in-law, ": null
    },
    {
        "Alexander Graham Bell": "alexander graham bell"
    },
    {
        ", succeeded him in 1897.      In 1899, Bells son-in-law ": null
    },
    {
        "Gilbert Hovey Grosvenor": "gilbert hovey grosvenor"
    },
    {
        " was named the first full-time editor of National Geographic magazine and served the organization for fifty-five years , and members of the Grosvenor family have played important roles in the organization since. Bell and Gilbert Hovey Grosvenor devised the successful marketing notion of Society membership and the first major use of photographs to tell stories in magazines.     The chairman of the National Geographic Society is Jean Case. Michael Ulica is interim president and chief executive. The editor-in-chief of National Geographic magazine is Susan Goldberg. ": null
    },
    {
        "Gilbert Melville Grosvenor": "gilbert melville grosvenor"
    },
    {
        ", a former chairman, received the ": null
    },
    {
        "Presidential Medal of Freedom": "presidential medal of freedom"
    },
    {
        " in 2005 for his leadership in geography education.     In 2004, the National Geographic Society headquarters in Washington, D.C., was one of the first buildings to receive a Green certification   from ": null
    },
    {
        "Global Green USA": "global green usa"
    },
    {
        ".   The National Geographic received the prestigious ": null
    },
    {
        "Prince of Asturias Award": "prince of asturias award"
    },
    {
        " for Communication and Humanities in October 2006 in ": null
    },
    {
        "Oviedo, Spain": "oviedo, spain"
    },
    {
        ".     In 2013 the society was investigated for possible violation of the ": null
    },
    {
        "Foreign Corrupt Practices Act": "foreign corrupt practices act"
    },
    {
        " relating to their close association with an Egyptian government official responsible for antiquities. , David Usborne. The Independent. October 28, 2013. Retrieved 28 Jan 2017     On September 9, 2015, the Society announced that it would re-organize its media properties and publications into a new company known as ": null
    },
    {
        "National Geographic Partners": "national geographic partners"
    },
    {
        ", which would be majority-owned by ": null
    },
    {
        "21st Century Fox": "21st century fox"
    },
    {
        " with a 73% stake. This new, for-profit corporation, would own National Geographic and other magazines, as well as its affiliated television networks—most of which were already owned in joint ventures with 21CF.  As a consequence, the Society and 21st Century Fox announced on November 2, 2015, that 9 percent of National Geographics 2,000 employees, approximately 180 people, would be laid off, constituting the biggest staff reduction in the Societys history.   Later, ": null
    },
    {
        "The Walt Disney Company": "the walt disney company"
    },
    {
        " assumed 21CFs share in National Geographic Partners, following the completion of ": null
    },
    {
        "Disneys acquisition of most of 21CF assets": "acquisition of 21st century fox by disney"
    },
    {
        " on March 20, 2019.              The Society has helped sponsor many expeditions and research projects over the years.            The ": null
    },
    {
        "Hubbard Medal": "hubbard medal"
    },
    {
        " is awarded by the National Geographic Society for distinction in exploration, discovery, and research. The medal is named for ": null
    },
    {
        "Gardiner Greene Hubbard": "gardiner greene hubbard"
    },
    {
        ", the first National Geographic Society president. The Hubbard Medal has been presented 44 times , the most recent award going to ": null
    },
    {
        "Peter H. Raven": "peter h. raven"
    },
    {
        ".          The National Geographic Society also awards, rarely, the Alexander Graham Bell Medal, for exceptional contributions to ": null
    },
    {
        "geographic": "geographic"
    },
    {
        " research. The award is named after ": null
    },
    {
        "Alexander Graham Bell": "alexander graham bell"
    },
    {
        ", scientist, inventor and the second president of the NGS. Up to mid-2011, the medal has been twice presented:   1980: ": null
    },
    {
        "Bradford Washburn": "bradford washburn"
    },
    {
        " and wife ": null
    },
    {
        "Barbara Washburn": "barbara washburn"
    },
    {
        "    2010: ": null
    },
    {
        "Roger Tomlinson": "roger tomlinson"
    },
    {
        " and ": null
    },
    {
        "Jack Dangermond": "jack dangermond"
    },
    {
        "        The Society operates the National Geographic Museum, located at 1145 17th Street, NW , in Washington, D.C. The museum features changing exhibitions featuring the work of National Geographic explorers, photographers, and scientists. There are also changing exhibits related to natural history, culture, history or society. Permanent exhibits include artifacts like the camera ": null
    },
    {
        "Robert Peary": "robert peary"
    },
    {
        " used at the North Pole and pottery that Jacques Cousteau recovered from a shipwreck.     ": null
    },
    {
        "National Geographic Partners": "national geographic partners"
    },
    {
        ", a for-profit joint venture between ": null
    },
    {
        "21st Century Fox": "21st century fox"
    },
    {
        " and the Society , was established in 2015 to handle commercial activities of the Society, including television channels worldwide and magazine publications.  ": null
    },
    {
        "The Walt Disney Company": "the walt disney company"
    },
    {
        " assumed": "acquisition of 21st century fox by disney"
    },
    {
        " 21CF’s share of National Geographic Partners in March 2019.     Most of National Geographic Partners businesses predate the establishment in 2015, and even the launch of National Geographic Channel in Asia and Europe by the original ": null
    },
    {
        "News Corporation": "news corporation"
    },
    {
        " in the late 1990s.       National Geographic      The National Geographic Magazine, later shortened to National Geographic, published its first issue in October 1888, nine months after the Society was founded, as the Societys official journal, a benefit for joining the tax-exempt National Geographic Society. Starting with the February 1910 issue, the magazine began using its now famous trademarked yellow border around the edge of its covers.     There are 12 monthly issues of National Geographic per year. The magazine contains articles about geography, popular science, world history, culture, current events and photography of places and things all over the world and universe. National Geographic magazine is currently published in 40 local-language editions in many countries around the world. Combined English and other language circulation is around 6.8 million monthly, with some 60 million readers.     National Geographic Explorer: Classroom magazine. The National Geographic School Bulletin was launched in 1919 and was replaced by the childrens magazine National Geographic World in 1975. NG World was separated into the current National Geographic Explorer and National Geographic Kids in 2001.   National Geographic History: Launched in Spring 2015.     National Geographic Kids : A version of National Geographic Magazine for children, launched in 1975 under the name National Geographic World. It has a U.S. circulation of over 1.5 million. There are also currently 18 local-language editions of NG Kids, with another half million in circulation. An Arabic edition of the childrens magazine was launched in ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        " in early 2007, and more than 42,000 copies are distributed to all the public schools in Egypt, in addition to another 15,000 single copy sales. More recently, an ": null
    },
    {
        "Albania": "albania"
    },
    {
        "n and ": null
    },
    {
        "Polish": "poland"
    },
    {
        " edition were launched.     National Geographic Little Kids : For younger children aged 3–6    National Geographic Traveler : Launched in 1984. There are 18 local-language editions of NG Traveler.     The Society also ran an online daily news outlet called National Geographic News.      Additionally, the Society publishes ": null
    },
    {
        "atlases": "atlases"
    },
    {
        ", books, and ": null
    },
    {
        "map": "map"
    },
    {
        "s. It previously published and co-published other magazines, including  National Geographic Adventure , National Geographic Research , and others,  and continues to publish special issues of various magazines.              K-19: The Widowmaker  , a feature film, submarine thriller based on the diary of a Russian submarine commander, starring ": null
    },
    {
        "Harrison Ford": "harrison ford"
    },
    {
        ".     March of the Penguins  , a French-made documentary for U.S. distribution with a new score and script, narrated by ": null
    },
    {
        "Morgan Freeman": "morgan freeman"
    },
    {
        "; it received an Academy Award for the Best Documentary in 2006. After a record $77 million theatrical gross in the United States, over four million DVD copies of March of the Penguins have been sold.    Arctic Tale  , a feature film documenting the story of two families of walrus and polar bears, narrated by ": null
    },
    {
        "Queen Latifah": "queen latifah"
    },
    {
        ".     Sea Monsters  , inspired by a National Geographic Magazine article, is a 3-D large format and reality film, with a musical score by Peter Gabriel.    The Last Lions    Undaunted Courage: Meriwether Lewis , Thomas Jefferson and the Opening of the American West, a co-production for ": null
    },
    {
        "HBO": "hbo"
    },
    {
        " by National Geographic Films, ": null
    },
    {
        "Edward Norton": "edward norton"
    },
    {
        ", and ": null
    },
    {
        "Brad Pitt": "brad pitt"
    },
    {
        ", is a 10-hour mini-series of ": null
    },
    {
        "Steven Ambroses": "steven ambrose"
    },
    {
        "award-winning book. Undaunted Courage: Meriwether Lewis , Thomas Jefferson and the Opening of the American West for ": null
    },
    {
        "HBO": "hbo"
    },
    {
        ".     In 2005, the National Geographic Society acquired the film distribution arm of Destination Cinema and entered the film distribution business.      ": null
    },
    {
        "television specials": "television specials"
    },
    {
        " and series have been aired on ": null
    },
    {
        "PBS": "public broadcasting service"
    },
    {
        " and other networks in the United States and globally for many years. The Geographic series in the U.S. started on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " in 1964, moved to ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        " in 1973, shifted to PBS  in 1975, shifted to ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " in 1995, and returned to PBS in 2000.     It has featured stories on numerous scientific figures such as ": null
    },
    {
        "Jacques Cousteau": "jacques cousteau"
    },
    {
        ", ": null
    },
    {
        "Jane Goodall": "jane goodall"
    },
    {
        ", and ": null
    },
    {
        "Louis Leakey": "louis leakey"
    },
    {
        " that not only featured their work but as well helped make them world-famous and accessible to millions. Most of the specials were narrated by various actors, including ": null
    },
    {
        "Glenn Close": "glenn close"
    },
    {
        ", ": null
    },
    {
        "Linda Hunt": "linda hunt"
    },
    {
        ", ": null
    },
    {
        "Stacy Keach": "stacy keach"
    },
    {
        ", ": null
    },
    {
        "Richard Kiley": "richard kiley"
    },
    {
        ", ": null
    },
    {
        "Burgess Meredith": "burgess meredith"
    },
    {
        ", ": null
    },
    {
        "Susan Sarandon": "susan sarandon"
    },
    {
        ", ": null
    },
    {
        "Alexander Scourby": "alexander scourby"
    },
    {
        ", ": null
    },
    {
        "Martin Sheen": "martin sheen"
    },
    {
        ", and ": null
    },
    {
        "Peter Strauss": "peter strauss"
    },
    {
        ". The specials theme music, by ": null
    },
    {
        "Elmer Bernstein": "elmer bernstein"
    },
    {
        ", was also adopted by the National Geographic Channel.        The original ": null
    },
    {
        "News Corporation": "news corporation"
    },
    {
        " launched National Geographic Channel in Asia and Europe in the late 1990s, in partnership with the Society. The Society provides programming to the National Geographic-branded channels worldwide, while, as of March 2019, ": null
    },
    {
        "The Walt Disney Companys": "the walt disney company"
    },
    {
        "subsidiaries  handle distribution of the channels and advertisement sales. The National Geographic Channel has begun to launch a number of sub-branded channels in international markets, such as ": null
    },
    {
        "Nat Geo Wild": "nat geo wild"
    },
    {
        ", ": null
    },
    {
        "Nat Geo People": "nat geo people"
    },
    {
        " and Nat Geo Kids.     The U.S. domestic version of ": null
    },
    {
        "National Geographic Channel": "national geographic"
    },
    {
        " was launched in January 2001 as a joint venture of National Geographic and ": null
    },
    {
        "Fox Cable Networks": "fox cable networks"
    },
    {
        ".          National Geographic Music and Radio is the music and radio division of National Geographic Ventures. The scope of the division includes National Geographic Live! events, digital music distribution, music publishing, radio content, ": null
    },
    {
        "Nat Geo Music": "nat geo music"
    },
    {
        " TV channel and film and TV music.   ": null
    },
    {
        "Clear Channel": "clear channel"
    },
    {
        ", ": null
    },
    {
        "Salem Communications": "salem communications"
    }
]