[
    {
        "             In ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", the natural numbers are those used for ": null
    },
    {
        "counting": "Counting"
    },
    {
        "  and ": null
    },
    {
        "ordering": "Total Order"
    },
    {
        " . In common mathematical terminology, words colloquially used for counting are ": null
    },
    {
        "cardinal numbers": "Cardinal Number"
    },
    {
        " and words connected to ordering represent ": null
    },
    {
        "ordinal numbers": "Ordinal Number"
    },
    {
        " . The natural numbers can, at times, appear as a convenient set of codes ; that is, as what ": null
    },
    {
        "linguists": "Linguists"
    },
    {
        " call ": null
    },
    {
        "nominal number": "Nominal Number"
    },
    {
        "s, forgoing many or all of the properties of being a number in a mathematical sense.     Some definitions, including the standard ": null
    },
    {
        "ISO 80000-2": "Iso 80000-2"
    },
    {
        ", begin the natural numbers with , corresponding to the non-negative integers , whereas others start with 1, corresponding to the positive integers .          says: ℕ is the set of natural numbers  include zero in the natural numbers: Intuitively, the set  of all natural numbers may be described as follows:  contains an initial number 0; .... They follow that with their version of the Peano Postulates. Texts that exclude zero from the natural numbers sometimes refer to the natural numbers together with zero as the whole numbers, but in other writings, that term is used instead for the integers .      The natural numbers are a basis from which many other number sets may be built by extension: the ": null
    },
    {
        "integers": "Integer"
    },
    {
        " , by including the ": null
    },
    {
        "neutral element": "Neutral Element"
    },
    {
        " 0 and an ": null
    },
    {
        "additive inverse": "Additive Inverse"
    },
    {
        "  for each nonzero natural number n; the ": null
    },
    {
        "rational number": "Rational Number"
    },
    {
        "s, by including a ": null
    },
    {
        "multiplicative inverse": "Multiplicative Inverse"
    },
    {
        "  for each nonzero integer n ; the ": null
    },
    {
        "real numbers": "Real Number"
    },
    {
        "by including with the rationals the ": null
    },
    {
        "limits": "Limit"
    },
    {
        " of ": null
    },
    {
        "Cauchy sequences": "Construction Of The Real Numbersconstruction From Cauchy Sequences"
    },
    {
        " of rationals; the ": null
    },
    {
        "complex number": "Complex Number"
    },
    {
        "s, by including with the real numbers the unresolved ": null
    },
    {
        "square root of minus one": "Imaginary Unit"
    },
    {
        " ; and so on.  says: The whole fantastic hierarchy of number systems is built up by purely set-theoretic means from a few simple assumptions about natural numbers. : Numbers make up the foundation of mathematics. These chains of extensions make the natural numbers canonically ": null
    },
    {
        "embedded": "Embedding"
    },
    {
        " in the other number systems.     Properties of the natural numbers, such as ": null
    },
    {
        "divisibility": "Divisibility"
    },
    {
        " and the distribution of ": null
    },
    {
        "prime number": "Prime Number"
    },
    {
        "s, are studied in ": null
    },
    {
        "number theory": "Number Theory"
    },
    {
        ". Problems concerning counting and ordering, such as ": null
    },
    {
        "partitioning": "Partition"
    },
    {
        " and ": null
    },
    {
        "enumerations": "Enumerative Combinatorics"
    },
    {
        ", are studied in ": null
    },
    {
        "combinatorics": "Combinatorics"
    },
    {
        ".     In common language, for example in ": null
    },
    {
        "primary school": "Primary School"
    },
    {
        ", natural numbers may be called counting numbers  both to intuitively exclude the negative integers and zero, and also to contrast the ": null
    },
    {
        "discreteness": "Discrete Mathematics"
    },
    {
        " of ": null
    },
    {
        "counting": "Counting"
    },
    {
        " to the ": null
    },
    {
        "continuity": "List Of Continuity-Related Mathematical Topics"
    },
    {
        " of ": null
    },
    {
        "measurement": "Measurement"
    },
    {
        ", established by the ": null
    },
    {
        "real number": "Real Number"
    },
    {
        "s.                   The most primitive method of representing a natural number is to put down a mark for each object. Later, a set of objects could be tested for equality, excess or shortage, by striking out a mark and removing an object from the set.     The first major advance in abstraction was the use of ": null
    },
    {
        "numerals": "Numeral System"
    },
    {
        " to represent numbers. This allowed systems to be developed for recording large numbers. The ancient ": null
    },
    {
        "Egyptians": "History Of Ancient Egypt"
    },
    {
        " developed a powerful system of numerals with distinct ": null
    },
    {
        "hieroglyphs": "Egyptian Hieroglyphs"
    },
    {
        " for  1, 10, and all the powers of  10 up to over 1  million. A stone carving from ": null
    },
    {
        "Karnak": "Karnak"
    },
    {
        ", dating from around 1500  BC and now at the ": null
    },
    {
        "Louvre": "Louvre"
    },
    {
        " in Paris, depicts  276 as 2  hundreds, 7  tens, and 6  ones; and similarly for the number  4,622. The ": null
    },
    {
        "Babylonia": "Babylonia"
    },
    {
        "ns had a ": null
    },
    {
        "place-value": "Positional Notation"
    },
    {
        " system based essentially on the numerals for  1 and  10, using base sixty, so that the symbol for sixty was the same as the symbol for one, its value being determined from context. Georges Ifrah, The Universal History of Numbers, Wiley, 2000,      A much later advance was the development of the idea that   can be considered as a number, with its own numeral. The use of a  0 ": null
    },
    {
        "digit": "Numerical Digit"
    },
    {
        " in place-value notation dates back as early as 700  BC by the Babylonians, but they omitted such a digit when it would have been the last symbol in the number.  The ": null
    },
    {
        "Olmec": "Olmec"
    },
    {
        " and ": null
    },
    {
        "Maya civilizations": "Maya Civilization"
    },
    {
        "used  0 as a separate number as early as the , but this usage did not spread beyond ": null
    },
    {
        "Mesoamerica": "Mesoamerica"
    },
    {
        ". . . The use of a numeral  0 in modern times originated with the ": null
    },
    {
        "India": "India"
    },
    {
        "n mathematician ": null
    },
    {
        "Brahmagupta": "Brahmagupta"
    },
    {
        " in 628. However, 0 had been used as a number in the medieval ": null
    },
    {
        "computus": "Computus"
    },
    {
        " , beginning with ": null
    },
    {
        "Dionysius Exiguus": "Dionysius Exiguus"
    },
    {
        " in 525, without being denoted by a numeral ; instead nulla  from nullus, the Latin word for none , was employed to denote a  0 value.      The first systematic study of numbers as ": null
    },
    {
        "abstractions": "Abstraction"
    },
    {
        "is usually credited to the ": null
    },
    {
        "Greek": "Ancient Greece"
    },
    {
        " philosophers ": null
    },
    {
        "Pythagoras": "Pythagoras"
    },
    {
        " and ": null
    },
    {
        "Archimedes": "Archimedes"
    },
    {
        ". Some Greek mathematicians treated the number  1 differently than larger numbers, sometimes even not as a number at all. This convention is used, for example, in ": null
    },
    {
        "Euclids Elements": "Euclids Elements"
    },
    {
        ", see .     Independent studies also occurred at around the same time in ": null
    },
    {
        "India": "India"
    },
    {
        ", ": null
    },
    {
        "China": "China"
    },
    {
        ", and ": null
    },
    {
        "Mesoamerica": "Mesoamerica"
    },
    {
        ". Morris Kline, Mathematical Thought From Ancient to Modern Times, Oxford University Press, 1990        In ": null
    },
    {
        "19th century": "19Th Century"
    },
    {
        " Europe": "Europe"
    },
    {
        ", there was mathematical and philosophical discussion about the exact nature of the natural numbers. A school of ": null
    },
    {
        "Naturalism": "Naturalism"
    },
    {
        " stated that the natural numbers were a direct consequence of the human psyche. ": null
    },
    {
        "Henri Poincaré": "Henri Poincaré"
    },
    {
        " was one of its advocates, as was ": null
    },
    {
        "Leopold Kronecker": "Leopold Kronecker"
    },
    {
        " who summarized God made the integers, all else is the work of man . The English translation is from Gray. In a footnote, Gray attributes the German quote to: Weber 1891/92, 19, quoting from a lecture of Kroneckers of 1886.    Weber, Heinrich L. 1891-2. .  2:5–23.     In opposition to the Naturalists, the ": null
    },
    {
        "constructivists": "Constructivism"
    },
    {
        " saw a need to improve the logical rigor in the ": null
    },
    {
        "foundations of mathematics": "Foundations Of Mathematics"
    },
    {
        ". Much of the mathematical work of the twentieth century has been devoted to examining the logical foundations and structure of the subject.  In the 1860s, ": null
    },
    {
        "Hermann Grassmann": "Hermann Grassmann"
    },
    {
        " suggested a recursive definition for natural numbers thus stating they were not really natural but a consequence of definitions. Later, two classes of such formal definitions were constructed; later, they were shown to be equivalent in most practical applications.     ": null
    },
    {
        "Set-theoretical definitions of natural numbers": "Set-Theoretical Definitions Of Natural Numbers"
    },
    {
        " were initiated by ": null
    },
    {
        "Frege": "Frege"
    },
    {
        " and he initially defined a natural number as the class of all sets that are in one-to-one correspondence with a particular set, but this definition turned out to lead to paradoxes including ": null
    },
    {
        "Russells paradox": "Russells Paradox"
    },
    {
        ". Therefore, this formalism was modified so that a natural number is defined as a particular set, and any set that can be put into one-to-one correspondence with that set is said to have that number of elements.      The second class of definitions was introduced by ": null
    },
    {
        "Charles Sanders Peirce": "Charles Sanders Peirce"
    },
    {
        ", refined by ": null
    },
    {
        "Richard Dedekind": "Richard Dedekind"
    },
    {
        ", and further explored by ": null
    },
    {
        "Giuseppe Peano": "Giuseppe Peano"
    },
    {
        "; this approach is now called ": null
    },
    {
        "Peano arithmetic": "Peano Arithmetic"
    },
    {
        ". It is based on an ": null
    },
    {
        "axiomatization": "Axiomatization"
    },
    {
        " of the properties of ": null
    },
    {
        "ordinal number": "Ordinal Number"
    },
    {
        "s: each natural number has a successor and every non-zero natural number has a unique predecessor. Peano arithmetic is ": null
    },
    {
        "equiconsistent": "Equiconsistent"
    },
    {
        " with several weak systems of set theory. One such system is ": null
    },
    {
        "ZFC": "Zfc"
    },
    {
        " with the ": null
    },
    {
        "axiom of infinity": "Axiom Of Infinity"
    },
    {
        " replaced by its negation. Theorems that can be proved in ZFC but cannot be proved using the Peano Axioms include ": null
    },
    {
        "Goodsteins theorem": "Goodsteins Theorem"
    },
    {
        ". L. Kirby; J. Paris, Accessible Independence Results for Peano Arithmetic, Bulletin of the London Mathematical Society 14 : 285. , 1982.     With all these definitions it is convenient to include  0  as a natural number. Including  0 is now the common convention among ": null
    },
    {
        "set theorists": "Set Theory"
    },
    {
        "  and ": null
    },
    {
        "logic": "Logic"
    },
    {
        "ians.  Other mathematicians also include  0, e.g., ": null
    },
    {
        "Computer languages": "Computer Language"
    },
    {
        "often ": null
    },
    {
        "start from zero": "Zero-Based Numbering"
    },
    {
        " when enumerating items like ": null
    },
    {
        "loop counters": "For Loop"
    },
    {
        " and ": null
    },
    {
        "string-": "String"
    },
    {
        " or ": null
    },
    {
        "array-elements": "Array Data Structure"
    },
    {
        ".   Many mathematicians have kept the older tradition and take  1 to be the first natural number. This is common in texts about ": null
    },
    {
        "Real analysis": "Real Analysis"
    },
    {
        ". See, for example,  or .     Since different properties are customarily associated to the tokens  and , e.g., neutral elements for addition and multiplications, respectively, it is important to know which version of natural numbers, generically denoted by \\mathbb N, is employed in the case under consideration. This can be done by explanation in prose, by explicitly writing down the set, or by qualifying the generic identifier with a super- or subscript ,  e.g., like this:   Naturals with zero: \\;\\\\mathbb_0\\cup\\   Naturals without zero: \\\\mathbb^\\mathbb\\smallsetminus\\.          Mathematicians use N or   to refer to the ": null
    },
    {
        "set": "Set"
    },
    {
        " of all natural numbers. Older texts have also occasionally employed J as the symbol for this set.      To be unambiguous about whether 0 is included or not, sometimes a subscript 0 is added in the former case, and a superscript  or subscript  ref name ISO80000  /ref  ref  /ref ref  br /  ": null
    }
]