[
    {
        "   Natural theology, once also termed physico-theology, is a type of ": null
    },
    {
        "theology": "theology"
    },
    {
        " that provides arguments for the ": null
    },
    {
        "existence of God": "existence of god"
    },
    {
        " based on ": null
    },
    {
        "reason": "reason"
    },
    {
        " and ordinary ": null
    },
    {
        "experience": "experience"
    },
    {
        " of ": null
    },
    {
        "nature": "nature"
    },
    {
        ".     This distinguishes it from ": null
    },
    {
        "revealed theology": "revealed theology"
    },
    {
        ", which is based on ": null
    },
    {
        "scripture": "scripture"
    },
    {
        " and/or ": null
    },
    {
        "religious experiences": "religious experiences"
    },
    {
        ", also from ": null
    },
    {
        "transcendental theology": "transcendental theology"
    },
    {
        ", which is based on  a priori  reasoning. It is thus a type of philosophy, with the aim of explaining the nature of the ": null
    },
    {
        "gods": "gods"
    },
    {
        ", or of one supreme God. For ": null
    },
    {
        "monotheistic religions": "monotheism"
    },
    {
        ", this principally involves arguments about the ": null
    },
    {
        "attributes": "cataphatic theology"
    },
    {
        " or ": null
    },
    {
        "non-attributes": "negative theology"
    },
    {
        " of God, and especially the ": null
    },
    {
        "existence of God": "existence of god"
    },
    {
        ", using arguments that do not involve recourse to supernatural ": null
    },
    {
        "revelation": "revelation"
    },
    {
        ".     ": null
    },
    {
        "Marcus Terentius Varro": "marcus terentius varro"
    },
    {
        " established a distinction between ": null
    },
    {
        "political theology": "political theology"
    },
    {
        " , natural theology and ": null
    },
    {
        "mythical theology": "mythical theology"
    },
    {
        ". His terminology became part of the ": null
    },
    {
        "Stoic": "stoicism"
    },
    {
        " tradition and then ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " through ": null
    },
    {
        "Augustine of Hippo": "augustine of hippo"
    },
    {
        " and ": null
    },
    {
        "Thomas Aquinas": "thomas aquinas"
    },
    {
        ".         Besides ": null
    },
    {
        "Zarathushtras": "zarathushtra"
    },
    {
        " Gathas": "gathas"
    },
    {
        ", ": null
    },
    {
        "Plato": "plato"
    },
    {
        " gives the earliest surviving account of a natural theology. In the  Timaeus , written , we read: We must first investigate concerning that primary question which has to be investigated at the outset in every case,  — namely, whether it has always existed, having no beginning or generation, or whether it has come into existence, having begun from some beginning.  In the  Laws , in answer to the question as to what arguments justify faith in the gods, Plato affirms: One is our dogma about the soul...the other is our dogma concerning the ordering of the motion of the stars .          ": null
    },
    {
        "Varro ": "marcus terentius varro"
    },
    {
        " in his  Antiquitates rerum humanarum et divinarum    established a distinction between three kinds of theology: ": null
    },
    {
        "civil ": "political theology"
    },
    {
        " , natural  and ": null
    },
    {
        "mythical": "mythical theology"
    },
    {
        " . The theologians of civil theology are the people , asking how the gods relate to daily life and the state . The theologians of natural theology are the ": null
    },
    {
        "philosophers": "philosophy"
    },
    {
        ", asking about the nature of the gods, and the theologians of mythical theology are the ": null
    },
    {
        "poet": "poet"
    },
    {
        "s, crafting ": null
    },
    {
        "mythology": "mythology"
    },
    {
        ".          From the 8th century AD, the ": null
    },
    {
        "Mutazilite": "mutazili"
    },
    {
        " school of ": null
    },
    {
        "Islam": "islam"
    },
    {
        ", compelled to defend their principles against the orthodox Islam of their day, used philosophy for support, and were among the first to pursue a rational ": null
    },
    {
        "Islamic theology": "islamic theology"
    },
    {
        ", termed Ilm-al- Kalam  . The ": null
    },
    {
        "teleological argument": "teleological argument"
    },
    {
        " was later presented by the ": null
    },
    {
        "early Islamic philosophers": "early islamic philosophy"
    },
    {
        " Alkindus": "al-kindi"
    },
    {
        " and ": null
    },
    {
        "Averroes": "averroes"
    },
    {
        ", while ": null
    },
    {
        "Avicenna": "avicenna"
    },
    {
        " presented both the ": null
    },
    {
        "cosmological argument": "cosmological argument"
    },
    {
        " and the ": null
    },
    {
        "ontological argument": "ontological argument"
    },
    {
        " in  The Book of Healing  .      ": null
    },
    {
        "Thomas Aquinas": "thomas aquinas"
    },
    {
        "  presented several versions of the ": null
    },
    {
        "cosmological argument": "cosmological argument"
    },
    {
        " in his  Summa Theologica , and of the ": null
    },
    {
        "teleological argument": "teleological argument"
    },
    {
        " in his  Summa contra Gentiles . He presented the ": null
    },
    {
        "ontological argument": "ontological argument"
    },
    {
        ", but rejected it in favor of proofs that invoke cause and effect alone. Hedley Brooke, John. Science and Religion. 1991.  His  quinque viae  in those books attempted to prove the ": null
    },
    {
        "existence of God": "existence of god"
    },
    {
        " in different ways, including the goal-directed actions seen in nature.          Raymond of Sabundes Liber Naturae Sive Creaturarum, Etc. , written 1434–1436, marks an important stage in the history of natural theology.     ": null
    },
    {
        "John Ray": "john ray"
    },
    {
        " also known as John Wray, was an ": null
    },
    {
        "English": "english people"
    },
    {
        " naturalist, sometimes referred to as the father of English ": null
    },
    {
        "natural history": "natural history"
    },
    {
        ". He published important works on ": null
    },
    {
        "plants": "plants"
    },
    {
        ", ": null
    },
    {
        "animal": "animal"
    },
    {
        "s, and natural theology, with the objective to illustrate the glory of God in the knowledge of the works of nature or creation .      ": null
    },
    {
        "William Derham": "william derham"
    },
    {
        " continued Rays tradition of natural theology in two of his own works, Physico-Theology, published during 1713, and Astro-Theology, 1714. These later influenced the work of William Paley. Weber, AS., Nineteenth-Century Science: An Anthology, Broadview Press, 2000, p. 18.     In  An Essay on the Principle of Population , published during 1798, ": null
    },
    {
        "Thomas Malthus": "thomas malthus"
    },
    {
        " ended with two chapters on natural theology and population. Malthus—a devout Christian—argued that ": null
    },
    {
        "revelation": "revelation"
    },
    {
        " would damp the soaring wings of intellect , and thus never let the difficulties and doubts of parts of the scripture interfere with his work.     ": null
    },
    {
        "William Paley": "william paley"
    },
    {
        ", an important influence on Charles Darwin,  who studied theology at Christ College in Cambridge, gave a well-known rendition of the ": null
    },
    {
        "teleological argument": "teleological argument"
    },
    {
        " for God. During 1802 he published Natural Theology, or Evidences of the Existence and Attributes of the Deity collected from the Appearances of Nature.  In this he described the ": null
    },
    {
        "Watchmaker analogy": "watchmaker analogy"
    },
    {
        ", for which he is probably best known. However, his book, which was one of the most published books of the 19th and 20th century, presents a number of teleological and cosmological arguments for the existence of God. The book served as a template for many subsequent natural theologies during the 19th century.      Professor of chemistry and natural history, ": null
    },
    {
        "Edward Hitchcock": "edward hitchcock"
    },
    {
        " also studied and wrote on natural theology. He attempted to unify and reconcile science and religion, emphasizing geology. His major work of this type was The Religion of Geology and its Connected Sciences .      The ": null
    },
    {
        "Gifford Lectures": "gifford lectures"
    },
    {
        " were established by the will of ": null
    },
    {
        "Adam Lord Gifford": "adam gifford"
    },
    {
        " to promote and diffuse the study of Natural Theology in the widest sense of the term—in other words, the knowledge of God. The term natural theology as used by Gifford means ": null
    },
    {
        "theology": "theology"
    },
    {
        " supported by ": null
    },
    {
        "science": "science"
    },
    {
        " and not dependent on the ": null
    },
    {
        "miraculous": "miraculous"
    },
    {
        ". See  accessed 15 October 2010.         Debates over the applicability of ": null
    },
    {
        "teleology": "teleological arguments"
    },
    {
        " to scientific questions continued during the nineteenth century, as ": null
    },
    {
        "Paleys": "william paley"
    },
    {
        " argument about design conflicted with radical new theories on the ": null
    },
    {
        "transmutation of species": "transmutation of species"
    },
    {
        ". In order to support the scientific ideas of the time, which explored the natural world within ": null
    },
    {
        "Paleys": "william paley"
    },
    {
        " framework of a divine designer, ": null
    },
    {
        "Francis Henry Egerton, 8th Earl of Bridgewater": "francis henry egerton, 8th earl of bridgewater"
    },
    {
        ", a gentleman naturalist, commissioned eight Bridgewater Treatises upon his deathbed to explore the Power, Wisdom, and Goodness of God, as manifested in the Creation. Robson, John M. . The Fiat and Finger of God: The Bridgewater Treatises . In Helmstadter, Richard J.; Lightman, Bernard V. . Victorian Faith in Crisis: Essays on Continuity and Change in Nineteenth-Century Religious Belief. Stanford, Calif.: Stanford University Press. . They were published first during the years 1833 to 1840, and afterwards in Bohns Scientific Library. The treatises are:     The Adaptation of External Nature to the Moral and Intellectual Condition of Man, by ": null
    },
    {
        "Thomas Chalmers": "thomas chalmers"
    },
    {
        ", D. D.   On The Adaptation of External Nature to the Physical Condition of Man, by ": null
    },
    {
        "John Kidd": "john kidd"
    },
    {
        ", M. D.   Astronomy and General Physics considered with reference to Natural Theology, by ": null
    },
    {
        "William Whewell": "william whewell"
    },
    {
        ", D. D.   The hand, its Mechanism and Vital Endowments as evincing Design, by Sir ": null
    },
    {
        "Charles Bell": "charles bell"
    },
    {
        ".   Animal and Vegetable Physiology considered with reference to Natural Theology, by ": null
    },
    {
        "Peter Mark Roget": "peter mark roget"
    },
    {
        ".   Geology and Mineralogy considered with reference to Natural Theology, by ": null
    },
    {
        "William Buckland": "william buckland"
    },
    {
        ", D.D.   On the History, Habits and Instincts of Animals, by ": null
    },
    {
        "William Kirby": "william kirby"
    },
    {
        ".   Chemistry, Meteorology, and the Function of Digestion, considered with reference to Natural Theology, by ": null
    },
    {
        "William Prout": "william prout"
    },
    {
        ", M.D.     In response to the claim in Whewells treatise that We may thus, with the greatest propriety, deny to the mechanical philosophers and mathematicians of recent times any authority with regard to their views of the administration of the universe , ": null
    },
    {
        "Charles Babbage": "charles babbage"
    },
    {
        " published what he termed  The Ninth Bridgewater Treatise, A Fragment .  As his preface states, this volume was not part of that series, but rather his own considerations of the subject. He draws on his own work on calculating engines to consider God as a divine programmer setting complex laws as the basis of what we think of as miracles, rather than miraculously producing new species by creative whim. There was also a fragmentary supplement to this, published posthumously by ": null
    },
    {
        "Thomas Hill": "thomas hill"
    },
    {
        ".      The theology of the Bridgewater Treatises was often disputed, given that it assumed humans could have knowledge of God acquired by observation and reasoning without the aid of revealed knowledge. . Retrieved on 29 April 2014.     The works are of unequal merit; several of them were esteemed as apologetic literature, but they attracted considerable criticism. One notable critic of the Bridgewater Treatises was ": null
    },
    {
        "Edgar Allan Poe": "edgar allan poe"
    },
    {
        ", who wrote Criticism. , ": null
    },
    {
        "Edgar Allan Poe": "edgar allan poe"
    },
    {
        ", ": null
    },
    {
        "Robert Knox": "robert knox"
    },
    {
        ", an Edinburgh surgeon and major advocate of radical ": null
    },
    {
        "morphology": "morphology"
    },
    {
        ", referred to them as the Bilgewater Treatises , to mock the ultra-teleological school . Though memorable, this phrase overemphasises the influence of teleology in the series, at the expense of the ": null
    },
    {
        "idealism": "idealism"
    },
    {
        " of the likes of Kirby and Roget. ": null
    }
]