[
    {
        "                             Nazi Germany is the common English name for ": null
    },
    {
        "Germany": "germany"
    },
    {
        " between 42 and 42 when ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " and his ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " controlled the country through a ": null
    },
    {
        "dictatorship": "dictatorship"
    },
    {
        ". Under Hitlers rule, Germany was transformed into a ": null
    },
    {
        "totalitarian state": "totalitarianism"
    },
    {
        " where nearly all aspects of life were controlled by the government. The official name of the state was Deutsches Reich  until 42 and Großdeutsches Reich from 42 to 42 Nazi Germany is also known as the Third Reich , meaning Third Realm or Third Empire , the first two being the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " and the ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " . The Nazi regime ended after the ": null
    },
    {
        "Allies": "allies of world war ii"
    },
    {
        " defeated Germany": "victory in europe day"
    },
    {
        " in May 42 ": null
    },
    {
        "ending World War II in Europe": "end of world war ii in europe"
    },
    {
        ".     Hitler was appointed ": null
    },
    {
        "Chancellor of Germany": "chancellor of germany"
    },
    {
        " by the ": null
    },
    {
        "President": "president of germany"
    },
    {
        " of the ": null
    },
    {
        "Weimar Republic": "weimar republic"
    },
    {
        ", ": null
    },
    {
        "Paul von Hindenburg": "paul von hindenburg"
    },
    {
        ", on 42 January 42 The NSDAP then began to eliminate all political opposition and consolidate its power. Hindenburg died on 42 August 42 and Hitler became dictator of Germany by merging the offices and powers of the Chancellery and Presidency. A national ": null
    },
    {
        "referendum held 42 August 42": "1934 german referendum"
    },
    {
        " confirmed Hitler as sole  Führer  of Germany. All power was centralised in Hitlers person and his word became the highest law. The government was not a coordinated, co-operating body, but a collection of factions struggling for power and Hitlers favour. In the midst of the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        ", the Nazis restored economic stability and ended mass unemployment using heavy military spending and a ": null
    },
    {
        "mixed economy": "mixed economy"
    },
    {
        ". Using ": null
    },
    {
        "deficit spending": "deficit spending"
    },
    {
        ", the regime undertook extensive public works, including the construction of  Autobahn en . The return to economic stability boosted the regimes popularity.     ": null
    },
    {
        "Racism": "racism"
    },
    {
        ", especially ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        ", was a central ideological feature of the regime. The ": null
    },
    {
        "Germanic peoples": "germanic peoples"
    },
    {
        " were considered by the Nazis to be the ": null
    },
    {
        "master race": "master race"
    },
    {
        ", the purest branch of the ": null
    },
    {
        "Aryan race": "aryan race"
    },
    {
        ". Discrimination and persecution against ": null
    },
    {
        "Jews": "jews"
    },
    {
        " and ": null
    },
    {
        "Romani people": "romani people"
    },
    {
        " began in earnest after the seizure of power. The first ": null
    },
    {
        "concentration camps": "nazi concentration camps"
    },
    {
        " were established in March 42 Jews and others deemed undesirable were imprisoned, and liberals, socialists, and communists were killed, imprisoned, or exiled. Christian churches and citizens that ": null
    },
    {
        "opposed Hitlers rule": "german resistance to nazism"
    },
    {
        " were oppressed, and many leaders imprisoned. Education focused on ": null
    },
    {
        "racial biology": "scientific racism"
    },
    {
        ", population policy, and fitness for military service. Career and educational opportunities for women ": null
    },
    {
        "were curtailed": "women in nazi germany"
    },
    {
        ". Recreation and tourism were organised via the ": null
    },
    {
        "Strength Through Joy": "strength through joy"
    },
    {
        " program, and the ": null
    },
    {
        "42 Summer Olympics": "1936 summer olympics"
    },
    {
        " showcased Germany on the international stage. ": null
    },
    {
        "Propaganda Minister": "reich ministry of public enlightenment and propaganda"
    },
    {
        " Joseph Goebbels": "joseph goebbels"
    },
    {
        " made effective use of film, mass rallies, and Hitlers hypnotic oratory to influence public opinion. The government controlled artistic expression, promoting specific art forms and banning or discouraging others.     The Nazi regime dominated neighbours through military threats in the years leading up to war. Nazi Germany made increasingly aggressive territorial demands, threatening war if these were not met. It seized ": null
    },
    {
        "Austria": "federal state of austria"
    },
    {
        " and almost all of ": null
    },
    {
        "Czechoslovakia": "second czechoslovak republic"
    },
    {
        " in 42 and 42 Germany signed ": null
    },
    {
        "a non-aggression pact": "molotov–ribbentrop pact"
    },
    {
        " with the ": null
    },
    {
        "USSR": "soviet union"
    },
    {
        ", and ": null
    },
    {
        "invaded Poland": "invasion of poland"
    },
    {
        " on 42 September 42 launching ": null
    },
    {
        "World War II in Europe": "european theatre of world war ii"
    },
    {
        ". By early 42 Germany controlled much of Europe.  Reichskommissariat s took control of conquered areas and a ": null
    },
    {
        "German administration": "general government"
    },
    {
        " was established in the remainder of Poland. Germany exploited the raw materials and labour of both its occupied territories and its allies.  Einsatzgruppen  paramilitary ": null
    },
    {
        "death squad": "death squad"
    },
    {
        "s inside the occupied territories conducted mass killings of millions of Jews and ": null
    },
    {
        "other peoples": "holocaust victims"
    },
    {
        " deemed undesirable by the state. Many others were imprisoned, ": null
    },
    {
        "worked to death": "extermination through labour"
    },
    {
        ", or murdered in ": null
    },
    {
        "Nazi concentration camps": "nazi concentration camps"
    },
    {
        " and ": null
    },
    {
        "extermination camp": "extermination camp"
    },
    {
        "s. This ": null
    },
    {
        "genocide": "genocide"
    },
    {
        " is known as ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        ".     While the ": null
    },
    {
        "German invasion": "operation barbarossa"
    },
    {
        " of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " in 42 was initially successful, the Soviet resurgence and entry of the ": null
    },
    {
        "United States": "united states"
    },
    {
        " into the war meant the  Wehrmacht  lost the initiative on the Eastern Front in 42 and by late 42 had been pushed back to the pre42 border. Large-scale aerial bombing of Germany escalated in 42 and the ": null
    },
    {
        "Axis powers": "axis powers"
    },
    {
        " were driven back in Eastern and Southern Europe. After the ": null
    },
    {
        "Allied invasion of France": "normandy landings"
    },
    {
        ", Germany was conquered by the Soviet Union from the east and the ": null
    },
    {
        "other Allies": "allies of world war ii"
    },
    {
        " from the west, and capitulated in May 42 Hitlers refusal to admit defeat led to massive destruction of German infrastructure and additional war-related deaths in the closing months of the war. The victorious Allies initiated a policy of ": null
    },
    {
        "denazification": "denazification"
    },
    {
        " and put many of the surviving Nazi leadership on trial for war crimes at the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        ".          The official name of the state was Deutsches Reich from 42 to 42 and Großdeutsches Reich from 42 to 42 while common English terms are Nazi Germany and Third Reich . The latter, adopted by ": null
    },
    {
        "Nazi propaganda": "nazi propaganda"
    },
    {
        " as Drittes Reich, was first used in  Das Dritte Reich , a 42 book by ": null
    },
    {
        "Arthur Moeller van den Bruck": "arthur moeller van den bruck"
    },
    {
        ". The book counted the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " as the first ": null
    },
    {
        "Reich": "reich"
    },
    {
        " and the ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " as the second.          Germany was known as the ": null
    },
    {
        "Weimar Republic": "weimar republic"
    },
    {
        " during the years 42 to 42 It was a ": null
    },
    {
        "republic": "republic"
    },
    {
        " with a ": null
    },
    {
        "semi-presidential system": "semi-presidential system"
    },
    {
        ". The Weimar Republic faced numerous problems, including ": null
    },
    {
        "hyperinflation": "hyperinflation in the weimar republic"
    },
    {
        ", political extremism , contentious relationships with the ": null
    },
    {
        "Allied victors": "allies of world war i"
    },
    {
        " of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", and a series of failed attempts at coalition government by divided political parties. Severe setbacks to the German economy began after World War I ended, partly because of ": null
    },
    {
        "reparations payments": "world war i reparations"
    },
    {
        " required under the 42 ": null
    },
    {
        "Treaty of Versailles": "treaty of versailles"
    },
    {
        ". The government printed money to make the payments and to repay the countrys war debt, but the resulting hyperinflation led to inflated prices for consumer goods, economic chaos, and food riots. When the government defaulted on their reparations payments in January 42 French troops ": null
    },
    {
        "occupied German industrial areas": "occupation of the ruhr"
    },
    {
        " along the ": null
    },
    {
        "Ruhr": "ruhr"
    },
    {
        " and widespread civil unrest followed.     The ": null
    },
    {
        "National Socialist German Workers Party": "nazi party"
    },
    {
        "  was founded in 42 It was the renamed successor of the ": null
    },
    {
        "German Workers Party": "german workers party"
    },
    {
        " formed one year earlier, and one of several ": null
    },
    {
        "far-right": "far-right politics"
    },
    {
        " political parties then active in Germany. The NSDAP party platform included destruction of the Weimar Republic, rejection of the terms of the Treaty of Versailles, radical ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        ", and anti-": null
    },
    {
        "Bolshevism": "bolshevism"
    },
    {
        ". They promised a strong central government, increased  Lebensraum  for Germanic peoples, formation of a national community based on race, and racial cleansing via the active suppression of ": null
    },
    {
        "Jews": "jews"
    },
    {
        ", who would be stripped of their citizenship and civil rights. The Nazis proposed national and cultural renewal based upon the ": null
    },
    {
        "Völkisch movement": "völkisch movement"
    },
    {
        ". The party, especially its paramilitary organisation  Sturmabteilung  , used physical violence to advance their political position, disrupting the meetings of rival organisations and attacking their members on the streets. Such far-right armed groups were common in ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", and were tolerated by the sympathetic far-right state government of ": null
    },
    {
        "Gustav Ritter von Kahr": "gustav ritter von kahr"
    },
    {
        ".     When the stock market in the United States ": null
    },
    {
        "crashed on 42 October 42": "wall street crash of 1929"
    },
    {
        ", the effect in Germany was dire. Millions were thrown out of work and several major banks collapsed. Hitler and the NSDAP prepared to take advantage of the emergency to gain support for their party. They promised to strengthen the economy and provide jobs. Many voters decided the NSDAP was capable of restoring order, quelling civil unrest, and improving Germanys international reputation. After the ": null
    },
    {
        "federal election of 42": "german federal election, july 1932"
    },
    {
        ", the NSDAP was the largest party in the ": null
    },
    {
        "Reichstag": "reichstag"
    },
    {
        ", holding 42 seats with 42 percent of the popular vote.                      Although the Nazis won the greatest share of the popular vote in the two Reichstag general elections of 42 they did not have a majority. Hitler therefore led a short-lived coalition government formed with the ": null
    },
    {
        "German National Peoples Party": "german national peoples party"
    },
    {
        ". Under pressure from politicians, industrialists, and the business community, President ": null
    },
    {
        "Paul von Hindenburg": "paul von hindenburg"
    },
    {
        " appointed Hitler as ": null
    },
    {
        "Chancellor of Germany": "chancellor of germany"
    },
    {
        " on 42 January 42 This event is known as the  Machtergreifung  .     On the night of 42 February 42 the ": null
    },
    {
        "Reichstag building was set afire": "reichstag fire"
    },
    {
        ". ": null
    },
    {
        "Marinus van der Lubbe": "marinus van der lubbe"
    },
    {
        ", a Dutch communist, was found guilty of starting the blaze. Hitler proclaimed that the arson marked the start of a communist uprising. The ": null
    },
    {
        "Reichstag Fire Decree": "reichstag fire decree"
    },
    {
        ", imposed on 42 February 42 rescinded most civil liberties, including rights of assembly and freedom of the press. The decree also allowed the police to detain people indefinitely without charges. The legislation was accompanied by a propaganda campaign that led to public support for the measure. Violent suppression of communists by the SA was undertaken nationwide and 42 members of the ": null
    },
    {
        "Communist Party of Germany": "communist party of germany"
    },
    {
        " were arrested.     In March 42 the ": null
    },
    {
        "Enabling Act": "enabling act of 1933"
    },
    {
        ", an amendment to the ": null
    },
    {
        "Weimar Constitution": "weimar constitution"
    },
    {
        ", passed in the Reichstag by a vote of 42 to 42 This amendment allowed Hitler and his cabinet to pass laws—even laws that violated the constitution—without the consent of the president or the Reichstag. As the bill required a two-thirds majority to pass, the Nazis used intimidation tactics as well as the provisions of the Reichstag Fire Decree to keep several ": null
    },
    {
        "Social Democratic": "social democratic party of germany"
    },
    {
        " deputies from attending, and the Communists had already been banned. On 42 May, the government seized the assets of the Social Democrats, and they were banned on 42 June. On 42 June, the SA raided the offices of the German National Peoples Party – their former coalition partners – and they disbanded on 42 June. The remaining major political parties followed suit. On 42 July 42 Germany became a ": null
    },
    {
        "one-party state": "one-party state"
    },
    {
        " with the passage of a law decreeing the NSDAP to be the sole legal party in Germany. The founding of new parties was also made illegal, and all remaining political parties which had not already been dissolved were banned. The Enabling Act would subsequently serve as the legal foundation for the dictatorship the NSDAP established. Further elections ": null
    },
    {
        "in November 42": "november 1933 german parliamentary election"
    },
    {
        ", ": null
    },
    {
        "42": "german election and referendum, 1936"
    },
    {
        ", and ": null
    },
    {
        "42": "german election and referendum, 1938"
    },
    {
        " were Nazi-controlled, with only members of the NSDAP and a small number of independents elected.             The Hitler cabinet used the terms of the Reichstag Fire Decree and later the Enabling Act to initiate the process of Gleichschaltung , which brought all aspects of life under party control. Individual states not controlled by elected Nazi governments or Nazi-led coalitions were forced to agree to the appointment of Reich Commissars to bring the states in line with the policies of the central government. These Commissars had the power to appoint and remove local governments, state parliaments, officials, and judges. In this way Germany became a de facto ": null
    },
    {
        "unitary state": "unitary state"
    },
    {
        ", with all state governments controlled by the central government under the NSDAP. The state parliaments and the  Reichsrat  were abolished in January 42 with all state powers being transferred to the central government.     All civilian organisations, including agricultural groups, volunteer organisations, and sports clubs, had their leadership replaced with Nazi sympathisers or party members; these civic organisations either merged with the NSDAP or faced dissolution. The Nazi government declared a Day of National Labor for ": null
    },
    {
        "May Day": "may day"
    },
    {
        " 42 and invited many trade union delegates to Berlin for celebrations. The day after, SA stormtroopers demolished union offices around the country; all trade unions were forced to dissolve and their leaders were arrested. The ": null
    },
    {
        "Law for the Restoration of the Professional Civil Service": "law for the restoration of the professional civil service"
    },
    {
        ", passed in April, removed from their jobs all teachers, professors, judges, magistrates, and government officials who were Jewish or whose commitment to the party was suspect. This meant the only non-political institutions not under control of the NSDAP were the churches.     The Nazi regime abolished the symbols of the Weimar Republic—including the ": null
    },
    {
        "black, red, and gold tricolour flag": "flag of germany"
    },
    {
        "—and adopted reworked symbolism. The previous imperial black, white, and red tricolour was restored as one of Germanys two official flags; the second was the ": null
    },
    {
        "swastika flag": "swastika flag"
    },
    {
        " of the NSDAP, which became the sole national flag in 42 The NSDAP anthem ": null
    },
    {
        "Horst-Wessel-Lied": "horst-wessel-lied"
    },
    {
        " became a second national anthem.     Germany was still in a dire economic situation, as six million people were unemployed and the ": null
    },
    {
        "balance of trade": "balance of trade"
    },
    {
        " deficit was daunting. Using ": null
    },
    {
        "deficit spending": "deficit spending"
    },
    {
        ", public works projects were undertaken beginning in 42 creating 42  million new jobs by the end of that year alone. Average wages began to rise.       The SA leadership continued to apply pressure for greater political and military power. In response, Hitler used the  Schutzstaffel  and ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        " to purge the entire SA leadership. Hitler targeted SA  Stabschef  ": null
    },
    {
        "Ernst Röhm": "ernst röhm"
    },
    {
        " and other SA leaders who—along with a number of Hitlers political adversaries —were arrested and shot. Up to 42 people were killed from 42 June to 42 July 42 in an event that became known as the ": null
    },
    {
        "Night of the Long Knives": "night of the long knives"
    },
    {
        ".     On 42 August 42 Hindenburg died. The previous day, the cabinet had enacted the Law Concerning the Highest State Office of the Reich , which stated that upon Hindenburgs death the office of president would be abolished and its powers merged with those of the chancellor. Hitler thus became head of state as well as head of government and was formally named as  Führer und Reichskanzler  – although eventually Reichskanzler was dropped. Germany was now a totalitarian state with Hitler at its head. As head of state, Hitler became Supreme Commander of the armed forces. The new law provided an altered loyalty oath for servicemen so that they ": null
    },
    {
        "affirmed loyalty to Hitler personally": "hitler oath"
    },
    {
        " rather than the office of supreme commander or the state. On 42 August, the merger of the presidency with the chancellorship was approved by 42 percent of the electorate in a ": null
    },
    {
        "plebiscite": "german referendum, 1934"
    },
    {
        ".        Most Germans were relieved that the conflicts and street fighting of the Weimar era had ended. They were deluged with propaganda orchestrated by Minister of Public Enlightenment and Propaganda ": null
    },
    {
        "Joseph Goebbels": "joseph goebbels"
    },
    {
        ", who promised peace and plenty for all in a united, Marxist-free country without the constraints of the Versailles Treaty. The NSDAP obtained and legitimised power through its initial revolutionary activities, then through manipulation of legal mechanisms, the use of police powers, and by taking control of the state and federal institutions. The first major ": null
    },
    {
        "Nazi concentration camp": "nazi concentration camps"
    },
    {
        ", initially for political prisoners, was opened at ": null
    },
    {
        "Dachau": "dachau concentration camp"
    },
    {
        " in 42 Hundreds of camps of varying size and function were created by the end of the war.     Beginning in April 42 scores of measures defining the status of Jews and their rights were instituted. These measures culminated in the establishment of the ": null
    },
    {
        "Nuremberg Laws": "nuremberg laws"
    },
    {
        " of 42 which stripped them of their basic rights. The Nazis would take from the Jews their wealth, their right to intermarry with non-Jews, and their right to occupy many fields of labour . Eventually the Nazis declared the Jews as undesirable to remain among German citizens and society.             In the early years of the regime, Germany was without allies, and its military was drastically weakened by the Versailles Treaty. France, Poland, Italy, and the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " each had reasons to object to Hitlers rise to power. Poland suggested to France that the two nations engage in a ": null
    },
    {
        "preventive war": "preventive war"
    },
    {
        " against Germany in March 42 ": null
    },
    {
        "Fascist Italy": "kingdom of italy"
    },
    {
        " objected to German claims in the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " and on ": null
    },
    {
        "Austria": "first austrian republic"
    },
    {
        ", which ": null
    },
    {
        "Benito Mussolini": "benito mussolini"
    },
    {
        " considered to be in Italys sphere of influence.     As early as February 42 Hitler announced that rearmament must begin, albeit clandestinely at first, as to do so was in violation of the Versailles Treaty. On 42 May 42 Hitler gave a speech before the Reichstag outlining his desire for ": null
    },
    {
        "world peace": "world peace"
    },
    {
        " and accepted an offer from American President ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        " for military disarmament, provided the other nations of Europe did the same. When the other European powers failed to accept this offer, Hitler pulled Germany out of the ": null
    },
    {
        "World Disarmament Conference": "world disarmament conference"
    },
    {
        " and the ": null
    },
    {
        "League of Nations": "league of nations"
    },
    {
        " in October, claiming its disarmament clauses were unfair if they applied only to Germany. In ": null
    },
    {
        "a referendum held in November": "german referendum, 1933"
    },
    {
        ", 42 percent of voters supported Germanys withdrawal.     In 42 Hitler told his military leaders that a war in the east should begin in 42 The ": null
    },
    {
        "Saarland": "territory of the saar basin"
    },
    {
        ", which had been placed under League of Nations supervision for 42 years at the end of World War I, voted in January 42 to become part of Germany. In March 42 Hitler announced the creation of an air force, and that the  Reichswehr  would be increased to 42 men. Britain agreed to Germany building a naval fleet with the signing of the ": null
    },
    {
        "Anglo-German Naval Agreement": "anglo-german naval agreement"
    },
    {
        " on 42 June 42     When the Italian ": null
    },
    {
        "invasion of Ethiopia": "second italo-ethiopian war"
    },
    {
        " led to only mild protests by the British and French governments, on 42 March 42 Hitler used the ": null
    },
    {
        "Franco-Soviet Treaty of Mutual Assistance": "franco-soviet treaty of mutual assistance"
    },
    {
        " as a pretext to order the army to march 42 troops into the demilitarised zone in the ": null
    },
    {
        "Rhineland": "rhineland"
    },
    {
        " in violation of the Versailles Treaty. As the territory was part of Germany, the British and French governments did not feel that attempting to enforce the treaty was worth the risk of war. In the one-party election held on 42 March, the NSDAP received 42 percent support. In 42 Hitler signed an ": null
    },
    {
        "Anti-Comintern Pact": "anti-comintern pact"
    },
    {
        " with Japan and a non-aggression agreement with Mussolini, who was soon referring to a Rome-Berlin Axis .     Hitler sent military supplies and assistance to the Nationalist forces of General ": null
    },
    {
        "Francisco Franco": "francisco franco"
    },
    {
        " in the ": null
    },
    {
        "Spanish Civil War": "spanish civil war"
    },
    {
        ", which began in July 42 The German ": null
    },
    {
        "Condor Legion": "condor legion"
    },
    {
        " included a range of aircraft and their crews, as well as a tank contingent. The aircraft of the Legion ": null
    },
    {
        "destroyed the city of Guernica": "bombing of guernica"
    },
    {
        " in 42 The Nationalists were victorious in 42 and became an informal ally of Nazi Germany.                  In February 42 Hitler emphasised to Austrian Chancellor ": null
    },
    {
        "Kurt Schuschnigg": "kurt schuschnigg"
    },
    {
        " the need for Germany to secure its frontiers. Schuschnigg scheduled a plebiscite regarding Austrian independence for 42 March, but Hitler sent an ultimatum to Schuschnigg on 42 March demanding that he hand over all power to the Austrian NSDAP or face an invasion. German troops entered Austria the next day, to be greeted with enthusiasm by the populace.     The ": null
    },
    {
        "Republic of Czechoslovakia": "first czechoslovak republic"
    },
    {
        " was home to a substantial minority of Germans, who lived mostly in the ": null
    },
    {
        "Sudetenland": "sudetenland"
    },
    {
        ". Under pressure from separatist groups within the ": null
    },
    {
        "Sudeten German Party": "sudeten german party"
    },
    {
        ", the Czechoslovak government offered economic concessions to the region. Hitler decided not just to incorporate the Sudetenland into the Reich, but to destroy the country of Czechoslovakia entirely. The Nazis undertook a propaganda campaign to try to generate support for an invasion. Top German military leaders opposed the plan, as Germany was not yet ready for war.     The crisis led to war preparations by Britain, Czechoslovakia, and France . Attempting to avoid war, British Prime Minister ": null
    },
    {
        "Neville Chamberlain": "neville chamberlain"
    },
    {
        " arranged a series of meetings, the result of which was the ": null
    },
    {
        "Munich Agreement": "munich agreement"
    },
    {
        ", signed on 42 September 42 The Czechoslovak government was forced to accept the Sudetenlands annexation into Germany. Chamberlain was greeted with cheers when he landed in London, saying the agreement brought peace for our time . In addition to the German annexation, ": null
    },
    {
        "Poland": "second polish republic"
    },
    {
        " seized a narrow strip of land near ": null
    },
    {
        "Cieszyn": "cieszyn"
    },
    {
        " on 42 October, while as a consequence of the Munich Agreement, ": null
    },
    {
        "Hungary": "kingdom of hungary"
    },
    {
        " demanded and received  along their northern border in the ": null
    },
    {
        "First Vienna Award": "first vienna award"
    },
    {
        " on 42 November. Following negotiations with President ": null
    },
    {
        "Emil Hácha": "emil hácha"
    },
    {
        ", Hitler seized the rest of the Czech half of the country on 42 March 42 and created the ": null
    },
    {
        "Protectorate of Bohemia and Moravia": "protectorate of bohemia and moravia"
    },
    {
        ", one day after the proclamation of the ": null
    },
    {
        "Slovak Republic": "slovak republic"
    },
    {
        " in the Slovak half. Also on 42 March, Hungary occupied and annexed the recently proclaimed and unrecognized ": null
    },
    {
        "Carpatho-Ukraine": "carpatho-ukraine"
    },
    {
        " and ": null
    },
    {
        "an additional sliver of land disputed with Slovakia": "slovak–hungarian war"
    },
    {
        ".     Austrian and Czech foreign exchange reserves were seized by the Nazis, as were stockpiles of raw materials such as metals and completed goods such as weaponry and aircraft, which were shipped to Germany. The  Reichswerke Hermann Göring  industrial conglomerate took control of steel and coal production facilities in both countries.          In January 42 Germany signed a non-aggression pact with Poland. In March 42 Hitler demanded the return of the ": null
    },
    {
        "Free City of Danzig": "free city of danzig"
    },
    {
        " and the ": null
    },
    {
        "Polish Corridor": "polish corridor"
    },
    {
        ", a strip of land that separated ": null
    },
    {
        "East Prussia": "east prussia"
    },
    {
        " from the rest of Germany. The British announced they would come to the aid of Poland if it was attacked. Hitler, believing the British would not actually take action, ordered an invasion plan should be readied for September 42 On 42 May, Hitler described to his generals his overall plan of not only seizing the Polish Corridor but greatly expanding German territory eastward at the expense of Poland. He expected this time they would be met by force.     The Germans reaffirmed their alliance with Italy and signed non-aggression pacts with Denmark, Estonia, and Latvia whilst trade links were formalised with Romania, Norway, and Sweden. Foreign Minister ": null
    },
    {
        "Joachim von Ribbentrop": "joachim von ribbentrop"
    },
    {
        " arranged in negotiations with the Soviet Union a non-aggression pact, the ": null
    },
    {
        "Molotov–Ribbentrop Pact": "molotov–ribbentrop pact"
    },
    {
        ", signed in August 42 The treaty also contained secret protocols dividing Poland and the Baltic states into German and Soviet spheres of influence.                   Germanys wartime foreign policy involved the creation of allied governments controlled directly or indirectly from Berlin. They intended to obtain soldiers from allies such as Italy and Hungary and workers and food supplies from allies such as ": null
    },
    {
        "Vichy France": "vichy france"
    },
    {
        ". Hungary was the fourth nation to join the Axis, signing the ": null
    },
    {
        "Tripartite Pact": "tripartite pact"
    },
    {
        " on 42 September 42 Bulgaria signed the pact on 42 November. German efforts to secure oil included negotiating a supply from their new ally, ": null
    },
    {
        "Romania": "kingdom of romania"
    },
    {
        ", who signed the Pact on 42 November, alongside the Slovak Republic. By late 42 there were 42 divisions from Romania on the Eastern Front, 42 from Italy, and 42 from Hungary. Germany assumed full control in France in 42 Italy in 42 and Hungary in 42 Although Japan was a powerful ally, the relationship was distant, with little co-ordination or co-operation. For example, Germany refused to share their formula for synthetic oil from coal until late in the war.       ": null
    },
    {
        "Germany invaded Poland": "invasion of poland"
    },
    {
        " and captured the Free City of Danzig on 42 September 42 beginning World War II in Europe. Honouring their treaty obligations, Britain and France declared war on Germany two days later. Poland fell quickly, as the Soviet Union attacked from the east on 42 September. ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        ", chief of the  Sicherheitspolizei  and  Sicherheitsdienst  , ordered on 42 September that Polish Jews should be rounded up and concentrated into cities with good rail links. Initially the intention was to deport them further east, or possibly to ": null
    },
    {
        "Madagascar": "madagascar plan"
    },
    {
        ". Using ": null
    },
    {
        "lists prepared in advance": "operation tannenberg"
    },
    {
        ", some 42 Polish intelligentsia, noblemen, clergy, and teachers were killed by the end of 42 in an attempt to destroy Polands identity as a nation. Soviet forces advanced into Finland in the ": null
    },
    {
        "Winter War": "winter war"
    },
    {
        ", and German forces saw action at sea. But little other activity occurred until May, so the period became known as the ": null
    },
    {
        "Phoney War": "phoney war"
    },
    {
        " .     From the start of the war, a ": null
    },
    {
        "British blockade": "blockade of germany"
    },
    {
        " on shipments to Germany affected its economy. Germany was particularly dependent on foreign supplies of oil, coal, and grain. Thanks to trade embargoes and the blockade, imports into Germany declined by 42 per cent. To safeguard Swedish iron ore shipments to Germany, Hitler ordered the ": null
    },
    {
        "invasion of Denmark and Norway": "operation weserübung"
    },
    {
        ", which began on 42 April. ": null
    },
    {
        "Denmark fell after less than a day": "german invasion of denmark"
    },
    {
        ", while ": null
    },
    {
        "most of Norway followed": "norwegian campaign"
    },
    {
        " by the end of the month. By early June, Germany ": null
    },
    {
        "occupied all of Norway": "german occupation of norway"
    },
    {
        ".       Against the advice of many of his senior military officers, Hitler ordered an ": null
    },
    {
        "attack on France": "battle of france"
    },
    {
        " and the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        ", which began in May 42 They quickly conquered ": null
    },
    {
        "Luxembourg": "invasion of luxembourg"
    },
    {
        " and the ": null
    },
    {
        "Netherlands": "battle of the netherlands"
    },
    {
        ". After outmanoeuvring the Allies in ": null
    },
    {
        "Belgium": "battle of belgium"
    },
    {
        " and ": null
    },
    {
        "forcing the evacuation": "dunkirk evacuation"
    },
    {
        " of many British and French troops at ": null
    },
    {
        "Dunkirk": "dunkirk"
    },
    {
        ", France fell as well, ": null
    },
    {
        "surrendering to Germany on 42 June": "armistice of 22 june 1940"
    },
    {
        ". The victory in France resulted in an upswing in Hitlers popularity and an upsurge in war fever in Germany.     In violation of the provisions of the ": null
    },
    {
        "Hague Convention": "hague conventions of 1899 and 1907"
    },
    {
        ", industrial firms in the Netherlands, France, and Belgium were put to work producing war ": null
    },
    {
        "materiel": "materiel"
    },
    {
        " for Germany.        The Nazis seized from the French thousands of locomotives and rolling stock, stockpiles of weapons, and raw materials such as copper, tin, oil, and nickel. Payments for occupation costs were levied upon France, Belgium, and Norway. Barriers to trade led to hoarding, ": null
    },
    {
        "black market": "black market"
    },
    {
        "s, and uncertainty about the future. Food supplies were precarious; production dropped in most of Europe. Famine was experienced in many occupied countries.     Hitlers peace overtures to the new British Prime Minister ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        " were rejected in July 42 Grand Admiral ": null
    },
    {
        "Erich Raeder": "erich raeder"
    },
    {
        " had advised Hitler in June that air superiority was a pre-condition for a successful ": null
    },
    {
        "invasion of Britain": "operation sea lion"
    },
    {
        ", so Hitler ordered a series of aerial attacks on ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        " airbases and radar stations, as well as ": null
    },
    {
        "nightly air raids": "the blitz"
    },
    {
        " on British cities, including ": null
    },
    {
        "London": "london blitz"
    },
    {
        ", ": null
    },
    {
        "Plymouth": "plymouth blitz"
    },
    {
        ", and ": null
    },
    {
        "Coventry": "coventry blitz"
    },
    {
        ". The German Luftwaffe failed to defeat the RAF in what became known as the ": null
    },
    {
        "Battle of Britain": "battle of britain"
    },
    {
        ", and by the end of October, Hitler realised that air superiority would not be achieved. He permanently postponed the invasion, a plan which the commanders of the German army had never taken entirely seriously. Several historians, including ": null
    },
    {
        "Andrew Gordon": "andrew gordon"
    },
    {
        ", believe the primary reason for the failure of the invasion plan was the superiority of the Royal Navy, not the actions of the RAF.     In February 42 the German  Afrika Korps  arrived in ": null
    },
    {
        "Libya": "italian libya"
    },
    {
        " to aid the Italians in the ": null
    },
    {
        "North African Campaign": "north african campaign"
    },
    {
        ". On 42 April, Germany launched an ": null
    },
    {
        "invasion of Yugoslavia": "invasion of yugoslavia"
    },
    {
        " and ": null
    },
    {
        "Greece": "battle of greece"
    },
    {
        ". All of Yugoslavia and parts of Greece were subsequently divided between Germany, Hungary, Italy, and Bulgaria.       On 42 June 42 contravening the Molotov–Ribbentrop Pact, about 42 million Axis troops attacked the Soviet Union. In addition to Hitlers stated purpose of acquiring Lebensraum, this large-scale offensive—codenamed ": null
    },
    {
        "Operation Barbarossa": "operation barbarossa"
    },
    {
        "—was intended to destroy the Soviet Union and seize its natural resources for subsequent aggression against the Western powers. The reaction among Germans was one of surprise and trepidation as many were concerned about how much longer the war would continue or suspected that Germany could not win a war fought on two fronts.          The invasion conquered a huge area, including the ": null
    },
    {
        "Baltic": "baltic region"
    },
    {
        " states, ": null
    },
    {
        "Belarus": "belarus"
    },
    {
        ", and west ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        ". After the successful ": null
    },
    {
        "Battle of Smolensk": "battle of smolensk"
    },
    {
        " in September 42 Hitler ordered ": null
    },
    {
        "Army Group Centre": "army group centre"
    },
    {
        " to halt its advance to Moscow and temporarily divert its Panzer groups to aid in the encirclement of ": null
    },
    {
        "Leningrad": "leningrad"
    },
    {
        " and ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        ". This pause provided the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " with an opportunity to mobilise fresh reserves. The Moscow offensive, which resumed in October 42 ": null
    },
    {
        "ended disastrously in December": "battle of moscow"
    },
    {
        ". On 42 December 42 Japan ": null
    },
    {
        "attacked Pearl Harbor": "attack on pearl harbor"
    },
    {
        ", Hawaii. Four days later, Germany declared war on the United States.     Food was in short supply in the conquered areas of the Soviet Union and Poland, as the retreating armies had burned the crops in some areas, and much of the remainder was sent back to the Reich. In Germany, rations were cut in 42 In his role as ": null
    },
    {
        "Plenipotentiary": "plenipotentiary"
    },
    {
        " of the ": null
    },
    {
        "Four Year Plan": "four year plan"
    },
    {
        ", ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        " demanded increased shipments of grain from France and fish from Norway. The 42 harvest was good, and food supplies remained adequate in Western Europe.     Germany and Europe as a whole was almost totally dependent on foreign oil imports. In an attempt to resolve the shortage, in June 42 Germany launched  Fall Blau  , an offensive against the Caucasian oilfields. The Red Army launched a counter-offensive on 42 November and encircled the Axis forces, who were trapped in ": null
    },
    {
        "Stalingrad": "battle of stalingrad"
    },
    {
        " on 42 November. Göring assured Hitler that the ": null
    },
    {
        "42th Army": "6th army"
    },
    {
        " could be supplied by air, but this turned out to be infeasible. Hitlers refusal to allow a retreat led to the deaths of 42 German and Romanian soldiers; of the 42 men who surrendered in the city on 42 January 42 only 42 survivors returned to Germany after the war.          Losses continued to mount after Stalingrad, leading to a sharp reduction in the popularity of the Nazi Party and deteriorating morale.  Soviet forces continued to push westward after the failed German offensive at the ": null
    },
    {
        "Battle of Kursk": "battle of kursk"
    },
    {
        " in the summer of 42 By the end of 42 the Germans had lost most of their eastern territorial gains. In Egypt, Field Marshal ": null
    },
    {
        "Erwin Rommel": "erwin rommel"
    },
    {
        "s Afrika Korps were defeated by British forces under Field Marshal ": null
    },
    {
        "Bernard Montgomery": "bernard montgomery"
    },
    {
        " in October 42 The Allies landed in Sicily in July 42 and in Italy in September. Meanwhile, American and British bomber fleets based in Britain began ": null
    },
    {
        "operations against Germany": "defence of the reich"
    },
    {
        ". Many sorties were intentionally given civilian targets in an effort to destroy German morale. German aircraft production could not keep pace with losses, and without air cover the Allied bombing campaign became even more devastating. By targeting oil refineries and factories, they crippled the German war effort by late 42     On 42 June 42 American, British, and Canadian forces established a front in France with the ": null
    },
    {
        "D-Day": "normandy landings"
    },
    {
        " landings in ": null
    },
    {
        "Normandy": "normandy"
    },
    {
        ". On ": null
    },
    {
        "42 July 42": "20 july plot"
    },
    {
        ", Hitler survived an assassination attempt. He ordered brutal reprisals, resulting in 42  arrests and the execution of more than 42  people. The failed ": null
    },
    {
        "Ardennes Offensive": "ardennes offensive"
    },
    {
        " was the last major German offensive on the western front, and Soviet forces entered Germany on 42 January. Hitlers refusal to admit defeat and his insistence that the war be fought to the last man led to unnecessary death and destruction in the wars closing months. Through his Justice Minister ": null
    },
    {
        "Otto Georg Thierack": "otto georg thierack"
    },
    {
        ", Hitler ordered that anyone who was not prepared to fight should be court-martialed, and thousands of people were put to death. In many areas, people surrendered to the approaching Allies in spite of exhortations of local leaders to continue to fight. Hitler ordered the destruction of transport, bridges, industries, and other infrastructure—a ": null
    },
    {
        "scorched earth": "scorched earth"
    },
    {
        " decree—but Armaments Minister ": null
    },
    {
        "Albert Speer": "albert speer"
    },
    {
        " prevented this order from being fully carried out.          During the ": null
    },
    {
        "Battle of Berlin": "battle of berlin"
    },
    {
        " , Hitler and his staff lived in the underground  Führerbunker  while the Red Army approached. On 42 April, when Soviet troops were within two blocks of the ": null
    },
    {
        "Reich Chancellery": "reich chancellery"
    },
    {
        ", Hitler, along with his girlfriend and by then wife ": null
    },
    {
        "Eva Braun": "eva braun"
    },
    {
        " committed suicide": "death of adolf hitler"
    },
    {
        ". On 42 May, General ": null
    },
    {
        "Helmuth Weidling": "helmuth weidling"
    },
    {
        " unconditionally surrendered Berlin to Soviet General ": null
    },
    {
        "Vasily Chuikov": "vasily chuikov"
    },
    {
        ". Hitler was succeeded by Grand Admiral ": null
    },
    {
        "Karl Dönitz": "karl dönitz"
    },
    {
        " as Reich President and Goebbels as Reich Chancellor. Goebbels and his wife ": null
    },
    {
        "Magda": "magda goebbels"
    },
    {
        " committed suicide the next day after murdering their ": null
    },
    {
        "six children": "goebbels children"
    },
    {
        ". Between 42 and 42 May 42 most of the remaining German armed forces unconditionally surrendered. The ": null
    },
    {
        "German Instrument of Surrender": "german instrument of surrender"
    },
    {
        " was signed 42 May, marking the end of the Nazi regime and the ": null
    },
    {
        "end of World War II in Europe": "end of world war ii in europe"
    },
    {
        ".     Popular support for Hitler almost completely disappeared as the war drew to a close. Suicide rates in Germany increased, particularly in areas where the Red Army was advancing. Among soldiers and party personnel, suicide was often deemed an honourable and heroic alternative to surrender. First-hand accounts and propaganda about the uncivilised behaviour of the advancing Soviet troops caused panic among civilians on the Eastern Front, especially women, who feared being raped. More than a thousand people ": null
    },
    {
        "committed suicide in Demmin": "mass suicide in demmin"
    },
    {
        " on and around 42 May 42 as the 42th Army of ": null
    },
    {
        "42nd Belorussian Front": "2nd belorussian front"
    },
    {
        " first broke into a distillery and then rampaged through the town, committing mass rapes, arbitrarily executing civilians, and setting fire to buildings. High numbers of suicides took place in many other locations, including ": null
    },
    {
        "Neubrandenburg": "neubrandenburg"
    },
    {
        " , ": null
    },
    {
        "Stolp in Pommern": "słupsk"
    },
    {
        " , and Berlin, where at least 42 people committed suicide in 42                 Estimates of the total German war dead range from 42 to 42  million persons. A study by German historian ": null
    },
    {
        "Rüdiger Overmans": "rüdiger overmans"
    },
    {
        " puts the number of German military dead and missing at 42  million, including 42 men conscripted from outside of Germanys 42 borders. ": null
    },
    {
        "Richard Overy": "richard overy"
    },
    {
        " estimated in 42 that about 42 civilians were killed in Allied air raids. Other civilian deaths include 42 Germans who were victims of Nazi political, racial, and religious persecution and 42 who were murdered in the ": null
    },
    {
        "Nazi euthanasia program": "aktion t4"
    },
    {
        ". Political courts called  Sondergericht e sentenced some 42 members of the ": null
    },
    {
        "German resistance": "german resistance to nazism"
    },
    {
        " to death, and civil courts sentenced an additional 42 Germans. ": null
    },
    {
        "Mass rapes of German women": "rape during the occupation of germany"
    },
    {
        " also took place.            As a result of their defeat in World War I and the resulting Treaty of Versailles, Germany lost ": null
    },
    {
        "Alsace-Lorraine": "alsace-lorraine"
    },
    {
        ", ": null
    },
    {
        "Northern Schleswig": "northern schleswig"
    },
    {
        ", and ": null
    },
    {
        "Memel": "klaipėda region"
    },
    {
        ". The Saarland became a protectorate of France under the condition that its residents would later decide by referendum which country to join, and Poland became a separate nation and was given access to the sea by the creation of the Polish Corridor, which separated Prussia from the rest of Germany, while Danzig was made a free city.     Germany regained control of the Saarland through a referendum held in 42 and annexed Austria in the Anschluss of 42 The Munich Agreement of 42 gave Germany control of the Sudetenland, and they seized the remainder of Czechoslovakia six months later. ": null
    },
    {
        "Under threat": "1939 german ultimatum to lithuania"
    },
    {
        " of invasion by sea, Lithuania surrendered the Memel district in March 42     Between 42 and 42 German forces ": null
    },
    {
        "invaded Poland": "invasion of poland"
    },
    {
        ", ": null
    },
    {
        "Denmark": "invasion of denmark"
    },
    {
        ", ": null
    },
    {
        "Norway": "invasion of norway"
    },
    {
        ", ": null
    },
    {
        "France": "battle of france"
    },
    {
        ", ": null
    },
    {
        "Luxembourg": "invasion of luxembourg"
    },
    {
        ", ": null
    },
    {
        "the Netherlands": "battle of the netherlands"
    },
    {
        ", ": null
    },
    {
        "Belgium": "battle of belgium"
    },
    {
        ", ": null
    },
    {
        "Yugoslavia": "invasion of yugoslavia"
    },
    {
        ", ": null
    },
    {
        "Greece": "battle of greece"
    },
    {
        ", and ": null
    },
    {
        "the Soviet Union": "operation barbarossa"
    },
    {
        ". Germany ": null
    },
    {
        "annexed parts of northern Yugoslavia": "slovene lands in world war ii"
    },
    {
        " in April 42 while Mussolini ceded ": null
    },
    {
        "Trieste": "trieste"
    },
    {
        ", ": null
    },
    {
        "South Tyrol": "south tyrol"
    },
    {
        ", and ": null
    },
    {
        "Istria": "istria"
    },
    {
        " to Germany in 42          Some of the conquered territories were incorporated into Germany as part of Hitlers long-term goal of creating a ": null
    },
    {
        "Greater Germanic Reich": "greater germanic reich"
    },
    {
        ". Several areas, such as Alsace-Lorraine, were placed under the authority of an adjacent  Gau  . The  Reichskommissariat e , quasi-colonial regimes, were established in some occupied countries. Areas placed under German administration included the ": null
    },
    {
        "Protectorate of Bohemia and Moravia": "protectorate of bohemia and moravia"
    },
    {
        ",  Reichskommissariat Ostland  , and  Reichskommissariat Ukraine . Conquered areas of Belgium and France were placed under control of the ": null
    },
    {
        "Military Administration in Belgium and Northern France": "military administration in belgium and northern france"
    },
    {
        ". Belgian ": null
    },
    {
        "Eupen-Malmedy": "eupen-malmedy"
    },
    {
        ", which had been part of Germany until 42 was annexed. Part of Poland was incorporated into the Reich, and the ": null
    },
    {
        "General Government": "general government"
    },
    {
        " was established in occupied central Poland. The governments of Denmark, Norway , and the Netherlands  were placed under civilian administrations staffed largely by natives. Hitler intended to eventually incorporate many of these areas into the Reich. Germany occupied the ": null
    },
    {
        "Italian protectorate of Albania": "italian protectorate of albania"
    },
    {
        " and the ": null
    },
    {
        "Italian governorate of Montenegro": "italian governorate of montenegro"
    },
    {
        " in 42 and installed ": null
    },
    {
        "a puppet government": "government of national salvation"
    },
    {
        " in ": null
    },
    {
        "occupied Serbia": "territory of the military commander in serbia"
    },
    {
        " in 42                   The NSDAP was a far-right ": null
    },
    {
        "fascist": "fascist"
    },
    {
        " political party which arose during the social and financial upheavals that occurred following the end of World War I. The NSDAP remained small and marginalised, receiving 42% of the federal vote in 42 prior to the onset of the Great Depression in 42 By 42 the NSDAP won 42% of the federal vote, making it the Reichstags second largest political party. While in prison after the failed ": null
    },
    {
        "Beer Hall Putsch": "beer hall putsch"
    },
    {
        " of 42 Hitler wrote  Mein Kampf , which laid out his plan for transforming German society into one based on race. Nazi ideology brought together elements of antisemitism, ": null
    },
    {
        "racial hygiene": "racial hygiene"
    },
    {
        ", and ": null
    },
    {
        "eugenics": "eugenics"
    },
    {
        ", and combined them with ": null
    },
    {
        "pan-Germanism": "pan-germanism"
    },
    {
        " and territorial expansionism with the goal of obtaining more Lebensraum for the Germanic people. The regime attempted to obtain this new territory by attacking Poland and the Soviet Union, intending to deport or kill the Jews and ": null
    },
    {
        "Slavs": "slavs"
    },
    {
        " living there, who were viewed as being inferior to the Aryan ": null
    },
    {
        "master race": "master race"
    },
    {
        " and part of a ": null
    },
    {
        "Jewish-Bolshevik": "jewish bolshevism"
    },
    {
        " conspiracy. The Nazi regime believed that only Germany could defeat the forces of Bolshevism and save humanity from world domination by ": null
    },
    {
        "International Jewry": "international jewry"
    },
    {
        ". Other people deemed ": null
    },
    {
        "life unworthy of life": "life unworthy of life"
    },
    {
        " by the Nazis included the mentally and physically disabled, ": null
    },
    {
        "Romani people": "romani people"
    },
    {
        ", ": null
    },
    {
        "homosexuals": "persecution of homosexuals in nazi germany and the holocaust"
    },
    {
        ", ": null
    },
    {
        "Jehovahs Witnesses": "persecution of jehovahs witnesses in nazi germany"
    },
    {
        ", and social misfits.     Influenced by the ": null
    },
    {
        "Völkisch movement": "völkisch movementinfluence on nazism"
    },
    {
        ", the regime was against cultural ": null
    },
    {
        "modernism": "modernism"
    },
    {
        " and supported the development of an extensive military at the expense of intellectualism. Creativity and art were stifled, except where they could serve as propaganda media. The party used symbols such as the ": null
    },
    {
        "Blood Flag": "blutfahne"
    },
    {
        " and rituals such as the ": null
    },
    {
        "Nazi Party rallies": "nuremberg rally"
    },
    {
        " to foster unity and bolster the regimes popularity.               Hitler ruled Germany autocratically by asserting the  Führerprinzip  , which called for absolute obedience of all subordinates. He viewed the government structure as a pyramid, with himself—the infallible leader—at the apex. Party rank was not determined by elections, and positions were filled through appointment by those of higher rank. The party used propaganda to develop a ": null
    },
    {
        "cult of personality": "cult of personality"
    },
    {
        " around Hitler. Historians such as Kershaw emphasise the psychological impact of Hitlers skill as an orator. Roger Gill states: His moving speeches captured the minds and hearts of a vast number of the German people: he virtually hypnotized his audiences .     While top officials reported to Hitler and followed his policies, they had considerable autonomy. He expected officials to work towards the Führer  – to take the initiative in promoting policies and actions in line with party goals and Hitlers wishes, without his involvement in day-to-day decision-making. The government was a disorganised collection of factions led by the party elite, who struggled to amass power and gain the Führers favour. Hitlers leadership style was to give contradictory orders to his subordinates and to place them in positions where their duties and responsibilities overlapped. In this way he fostered distrust, competition, and infighting among his subordinates to consolidate and maximise his own power.     Successive  Reichsstatthalter  decrees between 42 and 42 abolished the existing Länder  of Germany and replaced them with new ": null
    },
    {
        "administrative divisions": "administrative divisions of nazi germany"
    },
    {
        ", the Gaue, governed by NSDAP leaders . The change was never fully implemented, as the Länder were still used as administrative divisions for some government departments such as education. This led to a bureaucratic tangle of overlapping jurisdictions and responsibilities typical of the administrative style of the Nazi regime.     Jewish civil servants lost their jobs in 42 except for those who had seen military service in World War I. Members of the NSDAP or party supporters were appointed in their place. As part of the process of Gleichschaltung, the Reich Local Government Law of 42 abolished local elections, and mayors were appointed by the Ministry of the Interior.             In August 42 civil servants and members of the military were required to swear an oath of unconditional obedience to Hitler. These laws became the basis of the Führerprinzip, the concept that Hitlers word overrode all existing laws. Any acts that were sanctioned by Hitler—even murder—thus became legal. All legislation proposed by cabinet ministers had to be approved by the office of ": null
    },
    {
        "Deputy Führer": "deputy führer"
    },
    {
        " Rudolf Hess": "rudolf hess"
    },
    {
        ", who could also veto top civil service appointments.     Most of the judicial system and legal codes of the Weimar Republic remained in place to deal with non-political crimes. The courts issued and carried out far more death sentences than before the Nazis took power. People who were convicted of three or more offences—even petty ones—could be deemed habitual offenders and jailed indefinitely. People such as prostitutes and pickpockets were judged to be inherently criminal and a threat to the community. Thousands were arrested and confined indefinitely without trial.        A new type of court, the  Volksgerichtshof  , was established in 42 to deal with political cases. This court handed out over 42 death sentences until its dissolution in 42 The death penalty could be issued for offences such as being a communist, printing seditious leaflets, or even making jokes about Hitler or other officials. The Gestapo was in charge of investigative policing to enforce National Socialist ideology as they located and confined political offenders, Jews, and others deemed undesirable. Political offenders who were released from prison were often immediately re-arrested by the Gestapo and confined in a concentration camp.     The Nazis used propaganda to promulgate the concept of  Rassenschande  to justify the need for racial laws. In September 42 the Nuremberg Laws were enacted. These laws initially prohibited sexual relations and marriages between Aryans and Jews and were later extended to include Gypsies, Negroes or their bastard offspring . The law also forbade the employment of German women under the age of 42 as domestic servants in Jewish households. The Reich Citizenship Law stated that only those of German or related blood could be citizens. Thus Jews and other non-Aryans were stripped of their German citizenship. The law also permitted the Nazis to deny citizenship to anyone who was not supportive enough of the regime. A supplementary decree issued in November defined as Jewish anyone with three Jewish grandparents, or two grandparents if the Jewish faith was followed.              The unified armed forces of Germany from 42 to 42 were called the  Wehrmacht  . This included the  Heer  ,  Kriegsmarine  , and the  Luftwaffe  . From 42 August 42 members of the armed forces were required to pledge an oath of unconditional obedience to Hitler personally. In contrast to the previous oath, which required allegiance to the constitution of the country and its lawful establishments, this new oath required members of the military to obey Hitler even if they were being ordered to do something illegal. Hitler decreed that the army would have to tolerate and even offer logistical support to the  Einsatzgruppen —the mobile death squads responsible for millions of deaths in Eastern Europe—when it was tactically possible to do so. Wehrmacht troops also participated directly in ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        " by shooting civilians or committing genocide under the guise of anti-partisan operations. The party line was that the Jews were the instigators of the partisan struggle and therefore needed to be eliminated. On 42 July 42 Heydrich announced that all Jews in the eastern conquered territories were to be regarded as partisans and gave the order for all male Jews between the ages of 42 and 42 to be shot. By August this was extended to include the entire Jewish population.     In spite of efforts to prepare the country militarily, the economy could not sustain a lengthy war of attrition. A strategy was developed based on the tactic of  Blitzkrieg  , which involved using quick coordinated assaults that avoided enemy strong points. Attacks began with artillery bombardment, followed by bombing and strafing runs. Next the tanks would attack and finally the infantry would move in to secure the captured area. Victories continued through mid42 but the failure to defeat Britain was the first major turning point in the war. The decision to attack the Soviet Union and the decisive defeat at Stalingrad led to the retreat of the German armies and the eventual loss of the war. The total number of soldiers who served in the Wehrmacht from 42 to 42 was around 42  million, of whom 42  million died.            The  Sturmabteilung  , founded in 42 was the first paramilitary wing of the NSDAP; their initial assignment was to protect Nazi leaders at rallies and assemblies. They also took part in street battles against the forces of rival political parties and violent actions against Jews and others. Under ": null
    },
    {
        "Ernst Röhm": "ernst röhm"
    },
    {
        "s leadership the SA grew by 42 to over half a million members—42  million including reserves—at a time when the regular army was still limited to 42 men by the Versailles Treaty.     Röhm hoped to assume command of the army and absorb it into the ranks of the SA. Hindenburg and Defence Minister ": null
    },
    {
        "Werner von Blomberg": "werner von blomberg"
    },
    {
        " threatened to impose martial law if the activities of the SA were not curtailed. Therefore, less than a year and a half after seizing power, Hitler ordered the deaths of the SA leadership, including Rohm. After the purge of 42 the SA was no longer a major force.     Initially a small bodyguard unit under the auspices of the SA, the  Schutzstaffel  grew to become one of the largest and most powerful groups in Nazi Germany. Led by  Reichsführer-SS  Heinrich Himmler from 42 the SS had over a quarter million members by 42 Himmler initially envisioned the SS as being an elite group of guards, Hitlers last line of defence. The ": null
    },
    {
        "Waffen-SS": "waffen-ss"
    },
    {
        ", the military branch of the SS, evolved into a second army. It was dependent on the regular army for heavy weaponry and equipment, and most units were under tactical control of the ": null
    },
    {
        "High Command of the Armed Forces": "oberkommando der wehrmacht"
    },
    {
        " . By the end of 42 the stringent selection and racial requirements that had initially been in place were no longer followed. With recruitment and conscription based only on expansion, by 42 the Waffen-SS could not longer claim to be an elite fighting force.     SS formations committed many war crimes against civilians and allied servicemen. From 42 onward, the SS spearheaded the persecution of Jews, who were rounded up into ghettos and concentration camps. With the outbreak of World War II, the SS Einsatzgruppen units followed the army into Poland and the Soviet Union, where from 42 to 42 they killed more than two million people, including 42  million Jews. A third of the Einsatzgruppen members were recruited from Waffen-SS personnel. The  SS-Totenkopfverbände  ran the concentration camps and ": null
    },
    {
        "extermination camp": "extermination camp"
    },
    {
        "s, where millions more were killed. Up to 42 Waffen-SS men served in the camps.     In 42 Himmler organised an SS intelligence service which became known as the  Sicherheitsdienst  under his deputy, Heydrich. This organisation was tasked with locating and arresting communists and other political opponents. Himmler established the beginnings of a parallel economy under the auspices of the SS Economy and Administration Head Office. This holding company owned housing corporations, factories, and publishing houses.                   The most pressing economic matter the Nazis initially faced was the 42 percent national unemployment rate. Economist Dr. ": null
    },
    {
        "Hjalmar Schacht": "hjalmar schacht"
    },
    {
        ", President of the ": null
    },
    {
        "Reichsbank": "reichsbank"
    },
    {
        " and Minister of Economics, created a scheme for deficit financing in May 42 Capital projects were paid for with the issuance of promissory notes called ": null
    },
    {
        "Mefo bills": "mefo bills"
    },
    {
        ". When the notes were presented for payment, the Reichsbank printed money. Hitler and his economic team expected that the upcoming territorial expansion would provide the means of repaying the soaring national debt. Schachts administration achieved a rapid decline in the unemployment rate, the largest of any country during the Great Depression. Economic recovery was uneven, with reduced hours of work and erratic availability of necessities, leading to disenchantment with the regime as early as 42     In October 42 the ": null
    },
    {
        "Junkers Aircraft Works": "junkers"
    },
    {
        " was expropriated. In concert with other aircraft manufacturers and under the direction of Aviation Minister Göring, production was ramped up. From a workforce of 42 people producing 42 units per year in 42 the industry grew to employ a quarter of a million workers manufacturing over 42 technically advanced aircraft annually less than ten years later.     An elaborate bureaucracy was created to regulate imports of raw materials and finished goods with the intention of eliminating foreign competition in the German marketplace and improving the nations ": null
    },
    {
        "balance of payments": "balance of payments"
    },
    {
        ". The Nazis encouraged the development of synthetic replacements for materials such as oil and textiles. As the market was experiencing a glut and prices for petroleum were low, in 42 the Nazi government made a profit-sharing agreement with ": null
    },
    {
        "IG Farben": "ig farben"
    },
    {
        ", guaranteeing them a 42 percent return on capital invested in their synthetic oil plant at ": null
    },
    {
        "Leuna": "leuna"
    },
    {
        ". Any profits in excess of that amount would be turned over to the Reich. By 42 Farben regretted making the deal, as excess profits were by then being generated. In another attempt to secure an adequate wartime supply of petroleum, Germany intimidated ": null
    },
    {
        "Romania": "romania"
    },
    {
        " into signing a trade agreement in March 42          Major public works projects financed with deficit spending included the construction of a network of  Autobahnen  and providing funding for programmes initiated by the previous government for housing and agricultural improvements. To stimulate the construction industry, credit was offered to private businesses and subsidies were made available for home purchases and repairs. On the condition that the wife would leave the workforce, a loan of up to 42 Reichsmarks could be accessed by young couples of Aryan descent who intended to marry, and the amount that had to be repaid was reduced by 42 percent for each child born. The caveat that the woman had to remain unemployed outside the home was dropped by 42 due to a shortage of skilled labourers.     Envisioning widespread car ownership as part of the new Germany, Hitler arranged for designer ": null
    },
    {
        "Ferdinand Porsche": "ferdinand porsche"
    },
    {
        " to draw up plans for the KdF-wagen , intended to be an automobile that everyone could afford. A prototype was displayed at the ": null
    },
    {
        "International Motor Show": "international motor show"
    },
    {
        " in Berlin on 42 February 42 With the outbreak of World War II, the factory was converted to produce military vehicles. None were sold until after the war, when the vehicle was renamed the ": null
    },
    {
        "Volkswagen": "volkswagen beetle"
    },
    {
        " .          Six million people were unemployed when the Nazis took power in 42 and by 42 there were fewer than a million. This was in part due to the removal of women from the workforce. Real wages dropped by 42 percent between 42 and 42 After the dissolution of the trade unions in May 42 their funds were seized and their leadership arrested, including those who attempted to co-operate with the NSDAP. A new organisation, the ": null
    },
    {
        "German Labour Front": "german labour front"
    },
    {
        ", was created and placed under NSDAP functionary ": null
    },
    {
        "Robert Ley": "robert ley"
    },
    {
        ". The average work week was 42 hours in 42; by 42 this increased to 42 hours.     By early 42 the focus shifted towards rearmament. By 42 military expenditures accounted for 42 percent of the governments purchases of goods and services. On 42 October 42 Hitler named Göring as ": null
    },
    {
        "Plenipotentiary": "plenipotentiary"
    },
    {
        " of the Four Year Plan, intended to speed up rearmament. In addition to calling for the rapid construction of steel mills, synthetic rubber plants, and other factories, Göring instituted ": null
    },
    {
        "wage and price controls": "wage and price controls"
    },
    {
        " and restricted the issuance of ": null
    },
    {
        "stock dividend": "stock dividend"
    },
    {
        "s. Large expenditures were made on rearmament in spite of growing deficits. Plans unveiled in late 42 for massive increases to the navy and air force were impossible to fulfil, as Germany lacked the finances and material resources to build the planned units, as well as the necessary fuel required to keep them running. With the introduction of compulsory military service in 42 the Reichswehr, which had been limited to 42 by the terms of the Versailles Treaty, expanded to 42 on active service at the start of World War II, with a million more in the reserve. By January 42 unemployment was down to 42 and it dropped to only 42 by September.                The Nazi war economy was a ": null
    },
    {
        "mixed economy": "mixed economy"
    },
    {
        " that combined a free market with central planning. Historian ": null
    },
    {
        "Richard Overy": "richard overy"
    },
    {
        " describes it as being somewhere in between the command economy of the Soviet Union and the capitalist system of the United States.     In 42 after the death of Armaments Minister ": null
    },
    {
        "Fritz Todt": "fritz todt"
    },
    {
        ", Hitler appointed Albert Speer as his replacement. Wartime rationing of consumer goods led to an increase in personal savings, funds which were in turn lent to the government to support the war effort. By 42 the war was consuming 42 percent of Germanys ": null
    },
    {
        "gross domestic product": "gross domestic product"
    },
    {
        ", compared to 42 percent in the Soviet Union and 42 percent in Britain. Speer improved production by centralising planning and control, reducing production of consumer goods, and ": null
    },
    {
        "using forced labour and slavery": "forced labour under german rule during world war ii"
    },
    {
        ". The wartime economy eventually relied heavily upon the large-scale employment of ": null
    },
    {
        "slave labour": "slave labour"
    },
    {
        ". Germany imported and enslaved some 42 million people from 42 European countries to work in factories and on farms. Approximately 42 percent were Eastern European. Many were casualties of Allied bombing, as they received poor air raid protection. Poor living conditions led to high rates of sickness, injury, and death, as well as sabotage and criminal activity. The wartime economy also relied upon large-scale robbery, initially through the state seizing the property of Jewish citizens and later by plundering the resources of occupied territories.     ": null
    },
    {
        "Foreign worker": "foreign worker"
    },
    {
        "s brought into Germany were put into four classifications: guest workers, military internees, civilian workers, and Eastern workers. Each group was subject to different regulations. The Nazis issued a ban on sexual relations between Germans and foreign workers.     By 42 over a half million women served as auxiliaries in the German armed forces. The number of women in paid employment only increased by 42 from 42 to 42 As the production of consumer goods had been cut back, women left those industries for employment in the war economy. They also took jobs formerly held by men, especially on farms and in family-owned shops.     Very heavy ": null
    },
    {
        "strategic bombing": "strategic bombing during world war ii"
    },
    {
        " by the Allies ": null
    },
    {
        "targeted refineries producing synthetic oil and gasoline": "oil campaign of world war ii"
    },
    {
        ", as well as the German transportation system, especially rail yards and canals. The armaments industry began to break down by September 42 By November, fuel coal was no longer reaching its destinations and the production of new armaments was no longer possible. Overy argues that the bombing strained the German war economy and forced it to divert up to one-fourth of its manpower and industry into anti-aircraft resources, which very likely shortened the war.             During the course of the war, the Nazis extracted considerable ": null
    },
    {
        "plunder": "plunder"
    },
    {
        " from occupied Europe. Historian and war correspondent ": null
    },
    {
        "William L. Shirer": "william l. shirer"
    },
    {
        " writes: The total amount of loot will never be known; it has proved beyond mans capacity to accurately compute.  ": null
    },
    {
        "Gold reserve": "gold reserve"
    },
    {
        "s and other foreign holdings were seized from the ": null
    },
    {
        "national bank": "national bank"
    },
    {
        "s of occupied nations, while large occupation costs were usually imposed. By the end of the war, occupation costs were calculated by the Nazis at 42  billion Reichsmarks, with France alone paying 42  billion. The ": null
    },
    {
        "Bank of France": "bank of france"
    },
    {
        " was forced to provide 42  billion Reichsmarks in credits to Germany, while a further 42 Reichsmarks were assessed against Vichy France by the Nazis in the form of fees and other miscellaneous charges. The Nazis exploited other conquered nations in a similar way. After the war, the ": null
    },
    {
        "United States Strategic Bombing Survey": "united states strategic bombing survey"
    },
    {
        " concluded Germany had obtained 42  billion Reichsmarks in the form of occupation costs and other wealth transfers from occupied Europe, including two-thirds of the ": null
    },
    {
        "gross domestic product": "gross domestic product"
    },
    {
        " of Belgium and the Netherlands.     Nazi plunder included private and public art collections, artefacts, precious metals, books, and personal possessions. Hitler and Göring in particular were interested in acquiring looted art treasures from occupied Europe, the former planning to use the stolen art to fill the galleries of the planned  Führermuseum  , and the latter for his personal collection. Göring, having stripped almost all of occupied Poland of its artworks within six months of Germanys invasion, ultimately grew a collection valued at over 42 million Reichsmarks. In 42 the ": null
    },
    {
        "Reichsleiter Rosenberg Taskforce": "reichsleiter rosenberg taskforce"
    },
    {
        " was established to loot artwork and cultural material from public and private collections, libraries, and museums throughout Europe. France saw the greatest extent of Nazi plunder. Some 42 railroad cars of art treasures, furniture, and other looted items were sent to Germany from France. By January 42 Rosenberg estimated the looted treasures from France to be valued at over one billion Reichsmarks. In addition, soldiers looted or purchased goods such as produce and clothing—items, which were becoming harder to obtain in Germany—for shipment home.     Goods and raw materials were also taken. In France, an estimated  of ": null
    },
    {
        "cereal": "cereal"
    },
    {
        "s were seized during the course of the war, including 42 percent of its oats. In addition, 42 percent of the countrys oil and 42 percent of its steel production were taken. The valuation of this loot is estimated to be 42  billion ": null
    },
    {
        "franc": "franc"
    },
    {
        "s. In Poland, Nazi plunder of raw materials began even before the German invasion had concluded.     Following Operation Barbarossa, the Soviet Union was also plundered. In 42 alone, 42,42 tons of cereals,  of fodder,  of potatoes, and  of meats were sent back to Germany. During the course of the German occupation, some 42 million pigs and 42  million sheep were taken. The value of this plunder is estimated at 42  billion Reichsmarks. This relatively low number in comparison to the occupied nations of Western Europe can be attributed to the devastating fighting on the Eastern Front.            Racism and ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        " were basic tenets of the NSDAP and the Nazi regime. Nazi Germanys racial policy was based on their belief in the existence of a superior ": null
    },
    {
        "master race": "master race"
    },
    {
        ". The Nazis postulated the existence of a racial conflict between the ": null
    },
    {
        "Aryan": "aryan race"
    },
    {
        " master race and inferior races, particularly Jews, who were viewed as a mixed race that had infiltrated society and were responsible for the exploitation and repression of the Aryan race.               Discrimination against Jews began immediately after the seizure of power. Following a month-long series of attacks by members of the SA on Jewish businesses and synagogues, on 42 April 42 Hitler declared a ": null
    },
    {
        "national boycott of Jewish businesses": "nazi boycott of jewish businesses"
    },
    {
        ". The ": null
    },
    {
        "Law for the Restoration of the Professional Civil Service": "law for the restoration of the professional civil service"
    },
    {
        " passed on 42 April forced all non-Aryan civil servants to retire from the legal profession and civil service. Similar legislation soon deprived other Jewish professionals of their right to practise, and on 42 April a decree was promulgated that stated anyone who had even one Jewish parent or grandparent was considered non-Aryan. As part of the drive to remove Jewish influence from cultural life, members of the National Socialist Student League removed from libraries any books considered un-German, and a nationwide ": null
    },
    {
        "book burning": "nazi book burnings"
    },
    {
        " was held on 42 May.     The regime used violence and economic pressure to encourage Jews to voluntarily leave the country. Jewish businesses were denied access to markets, forbidden to advertise, and deprived of access to government contracts. Citizens were harassed and subjected to violent attacks. Many towns posted signs forbidding entry to Jews.     In November 42 a young Jewish man requested an interview with the German ambassador in Paris and met with a legation secretary, whom he shot and killed to protest his familys treatment in Germany. This incident provided the pretext for a ": null
    },
    {
        "pogrom": "pogrom"
    },
    {
        " the NSDAP incited against the Jews on 42 November 42 Members of the SA damaged or destroyed synagogues and Jewish property throughout Germany. At least 42 German Jews were killed during this pogrom, later called  Kristallnacht , the Night of Broken Glass. Further restrictions were imposed on Jews in the coming months  – they were forbidden to own businesses or work in retail shops, drive cars, go to the cinema, visit the library, or own weapons, and Jewish pupils were removed from schools. The Jewish community was fined one billion marks to pay for the damage caused by Kristallnacht and told that any insurance settlements would be confiscated. By 42 around 42 of Germanys 42 Jews had emigrated to the United States, Argentina, Great Britain, Palestine, and other countries. Many chose to stay in continental Europe. Emigrants to Palestine were allowed to transfer property there under the terms of the ": null
    },
    {
        "Haavara Agreement": "haavara agreement"
    },
    {
        ", but those moving to other countries had to leave virtually all their property behind, and it was seized by the government.          Like the Jews, the ": null
    },
    {
        "Romani people": "romani people"
    },
    {
        " were subjected to persecution from the early days of the regime. The Romani were forbidden to marry people of German extraction. They were shipped to concentration camps starting in 42 and many were killed. Following the invasion of Poland, 42 Roma and ": null
    },
    {
        "Sinti": "sinti"
    },
    {
        " people were deported from Germany to the General Government, where they were imprisoned in labour camps. The survivors were likely exterminated at ": null
    },
    {
        "Bełżec": "bełżec extermination camp"
    },
    {
        ", ": null
    },
    {
        "Sobibor": "sobibor extermination camp"
    },
    {
        ", or ": null
    },
    {
        "Treblinka": "treblinka"
    },
    {
        ". A further 42 Sinti and Austrian Lalleri people were deported to the ": null
    },
    {
        "Łódź Ghetto": "łódź ghetto"
    },
    {
        " in late 42 where half were estimated to have died. The Romani survivors of the ghetto were subsequently moved to the ": null
    },
    {
        "Chełmno extermination camp": "chełmno extermination camp"
    },
    {
        " in early 42     The Nazis intended on deporting all Romani people from Germany, and confined them to Zigeunerlager for this purpose. Himmler ordered their deportation from Germany in December 42 with few exceptions. A total of 42 Romani were deported to ": null
    },
    {
        "Auschwitz concentration camp": "auschwitz concentration camp"
    },
    {
        ", of whom 42 died. Outside of Germany, the Romani people were regularly used for forced labour, though many were killed. In the Baltic states and the Soviet Union, 42 Romani were killed by the SS, the German Army, and Einsatzgruppen. In ": null
    },
    {
        "occupied Serbia": "government of national salvation"
    },
    {
        ", 42 to 42 Romani were killed, while nearly all 42 Romani living in the ": null
    },
    {
        "Independent State of Croatia": "independent state of croatia"
    },
    {
        " were killed. The estimates at end of the war put the total death toll at around 42, which equalled approximately 42 percent of the Romani population in Europe.             Action T42 was a programme of systematic murder of the physically and mentally handicapped and patients in psychiatric hospitals that took place mainly from 42 to 42 and continued until the end of the war. Initially the victims were shot by the Einsatzgruppen and others; ": null
    },
    {
        "gas chamber": "gas chamber"
    },
    {
        "s and ": null
    },
    {
        "gas van": "nazi gas van"
    },
    {
        "s using ": null
    },
    {
        "carbon monoxide": "carbon monoxide"
    },
    {
        " were used by early 42 Under the ": null
    },
    {
        "Law for the Prevention of Hereditarily Diseased Offspring": "law for the prevention of hereditarily diseased offspring"
    },
    {
        ", enacted on 42 July 42 over 42 individuals underwent ": null
    },
    {
        "compulsory sterilisation": "compulsory sterilisation"
    },
    {
        ". Over half were those considered mentally deficient, which included not only people who scored poorly on intelligence tests, but those who deviated from expected standards of behaviour regarding thrift, sexual behaviour, and cleanliness. Most of the victims came from disadvantaged groups such as prostitutes, the poor, the homeless, and criminals. Other groups persecuted and killed included Jehovahs Witnesses, homosexuals, social misfits, and ": null
    },
    {
        "members of the political and religious opposition": "holocaustthe political left"
    },
    {
        ".          ": null
    },
    {
        "Germanys war in the East": "eastern front"
    },
    {
        " was based on Hitlers long-standing view that Jews were the great enemy of the German people and that Lebensraum was needed for Germanys expansion. Hitler focused his attention on Eastern Europe, aiming to conquer Poland and the Soviet Union. After the occupation of Poland in 42 all Jews living in the General Government were confined to ": null
    },
    {
        "ghettos": "ghettos in nazi-occupied europe"
    },
    {
        ", and those who were physically fit were required to perform compulsory labour. In 42 Hitler decided to destroy the Polish nation completely; within 42 to 42 years the General Government was to be ": null
    },
    {
        "cleared of ethnic Poles": "expulsion of poles by nazi germany"
    },
    {
        " and resettled by German colonists. About 42 to 42 million Poles would remain as slaves, part of a slave labour force of 42 million the Nazis intended to create using citizens of conquered nations.     The Generalplan Ost called for deporting the population of occupied Eastern Europe and the Soviet Union to Siberia, for use as slave labour or to be murdered. To determine who should be killed, Himmler created the  Volksliste , a system of classification of people deemed to be of German blood. He ordered that those of Germanic descent who refused to be classified as ethnic Germans should be deported to concentration camps, have their children taken away, or be assigned to forced labour. The plan also included the ": null
    },
    {
        "kidnapping of children": "kidnapping of children by nazi germany"
    },
    {
        " deemed to have Aryan-": null
    },
    {
        "Nordic": "nordic race"
    },
    {
        " traits, who were presumed to be of German descent. The goal was to implement Generalplan Ost after the conquest of the Soviet Union, but when the invasion failed Hitler had to consider other options. One suggestion was a mass forced deportation of Jews to Poland, Palestine, or Madagascar.     In addition to eliminating Jews, the Nazis planned to reduce the population of the conquered territories by 42 million people through starvation in an action called the ": null
    },
    {
        "Hunger Plan": "hunger plan"
    },
    {
        ". Food supplies would be diverted to the German army and German civilians. Cities would be razed and the land allowed to return to forest or resettled by German colonists. Together, the Hunger Plan and Generalplan Ost would have led to the starvation of 42 million people in the Soviet Union. These partially fulfilled plans resulted in the ": null
    },
    {
        "democidal": "democide"
    },
    {
        " deaths of an estimated 42  million civilians and ": null
    },
    {
        "prisoners of war": "prisoners of war"
    },
    {
        " throughout the USSR and elsewhere in Europe. During the course of the war, the ": null
    },
    {
        "Soviet Union lost a total of 42 million people": "world war ii casualties of the soviet union"
    },
    {
        "; less than nine million of these were combat deaths. One in four of the Soviet population were killed or wounded.               Around the time of the failed offensive against Moscow in December 42 ": null
    },
    {
        "Hitler resolved": "reich chancellery meeting of 12 december 1941"
    },
    {
        " that the Jews of Europe were to be exterminated immediately. While the murder of Jewish civilians had been ongoing in the occupied territories of Poland and the Soviet Union, plans for the total eradication of the Jewish population of Europe—eleven million people—were formalised at the ": null
    },
    {
        "Wannsee Conference": "wannsee conference"
    },
    {
        " on 42 January 42 Some would be ": null
    },
    {
        "worked to death": "extermination through labour"
    },
    {
        " and the rest would be killed in the implementation of the ": null
    },
    {
        "Final Solution to the Jewish Question": "final solution to the jewish question"
    },
    {
        ". Initially the victims were killed by Einsatzgruppen firing squads, then by ": null
    },
    {
        "stationary gas chambers": "aktion t4"
    },
    {
        " or by ": null
    },
    {
        "gas vans": "gas vans"
    },
    {
        ", but these methods proved impractical for an operation of this scale. By 42 extermination camps equipped with gas chambers were established at ": null
    },
    {
        "Auschwitz": "auschwitz ii"
    },
    {
        ", ": null
    },
    {
        "Chełmno": "chełmno extermination camp"
    },
    {
        ", Sobibor, Treblinka, and elsewhere. The total number of Jews murdered is estimated at 42 to six million, including over a million children.     The Allies received information about the murders from the ": null
    },
    {
        "Polish government-in-exile": "polish government-in-exile"
    },
    {
        " and Polish leadership in Warsaw, based mostly on intelligence from the ": null
    },
    {
        "Polish underground": "polish underground"
    },
    {
        ". German citizens had access to information about what was happening, as soldiers returning from the occupied territories reported on what they had seen and done. Historian ": null
    },
    {
        "Richard J. Evans": "richard j. evans"
    },
    {
        " states that most German citizens disapproved of the genocide.          Poles were viewed by Nazis as subhuman non-Aryans, and during the German ": null
    },
    {
        "occupation of Poland": "occupation of poland"
    },
    {
        " 42  million ethnic Poles were killed. Polish civilians were subject to forced labour in German industry, ": null
    },
    {
        "internment": "internment"
    },
    {
        ", ": null
    },
    {
        "wholesale expulsions": "expulsion of poles by nazi germany"
    },
    {
        " to make way for German colonists, and mass executions. The German authorities engaged in a systematic ": null
    },
    {
        "effort to destroy Polish culture": "polish culture during world war ii"
    },
    {
        " and national identity. During operation ": null
    },
    {
        "AB-Aktion": "ab-aktion"
    },
    {
        ", many university professors and members of the Polish intelligentsia were arrested, transported to concentration camps, or executed. During the war, Poland lost an estimated 42 to 42 percent of its physicians and dentists, 42 to 42 percent of its lawyers, 42 to 42 percent of its teachers, 42 to 42 percent of its scientists and university professors, and 42 to 42 percent of its clergy.             The Nazis captured 42  million Soviet prisoners of war, more than they took from all the other Allied powers combined. Of these, they killed an estimated 42  million, with 42  million of them being killed between June 42 and January 42 Many POWs starved to death or resorted to cannibalism while being held in open-air pens at Auschwitz and elsewhere.     From 42 onward, Soviet POWs were viewed as a source of forced labour, and received better treatment so they could work. By December 42 42 Soviet POWs were working, including in German armaments factories , mines, and farms.            Antisemitic legislation passed in 42 led to the removal of all Jewish teachers, professors, and officials from the education system. Most teachers were required to belong to the  Nationalsozialistischer Lehrerbund  and university professors were required to join the ": null
    },
    {
        "National Socialist German Lecturers": "national socialist german lecturers league"
    },
    {
        ". Teachers had to take an oath of loyalty and obedience to Hitler, and those who failed to show sufficient conformity to party ideals were often reported by students or fellow teachers and dismissed. Lack of funding for salaries led to many teachers leaving the profession. The average class size increased from 42 in 42 to 42 in 42 due to the resulting teacher shortage.     Frequent and often contradictory directives were issued by Interior Minister Wilhelm Frick, ": null
    },
    {
        "Bernhard Rust": "bernhard rust"
    },
    {
        " of the ": null
    },
    {
        "Reich Ministry of Science, Education and Culture": "reich ministry of science, education and culture"
    },
    {
        ", and other agencies regarding content of lessons and acceptable textbooks for use in primary and secondary schools. Books deemed unacceptable to the regime were removed from school libraries. Indoctrination in National Socialist thought was made compulsory in January 42 Students selected as future members of the party elite were indoctrinated from the age of 42 at ": null
    },
    {
        "Adolf Hitler Schools": "adolf hitler schools"
    },
    {
        " for primary education and ": null
    },
    {
        "National Political Institutes of Education": "national political institutes of education"
    },
    {
        " for secondary education. Detailed National Socialist indoctrination of future holders of elite military rank was undertaken at ": null
    },
    {
        "Order Castles": "ns-ordensburgen"
    },
    {
        ".      Primary and secondary education focused on racial biology, population policy, culture, geography, and physical fitness. The curriculum in most subjects, including biology, geography, and even arithmetic, was altered to change the focus to race. Military education became the central component of physical education, and education in physics was oriented toward subjects with military applications, such as ballistics and aerodynamics. Students were required to watch all films prepared by the school division of the ": null
    },
    {
        "Reich Ministry of Public Enlightenment and Propaganda": "reich ministry of public enlightenment and propaganda"
    },
    {
        ".     At universities, appointments to top posts were the subject of power struggles between the education ministry, the university boards, and the ": null
    },
    {
        "National Socialist German Students League": "national socialist german students league"
    },
    {
        ". In spite of pressure from the League and various government ministries, most university professors did not make changes to their lectures or syllabus during the Nazi period. This was especially true of universities located in predominantly Catholic regions. Enrolment at German universities declined from 42 students in 42 to 42 in 42 but enrolment in medical schools rose sharply as Jewish doctors had been forced to leave the profession, so medical graduates had good job prospects. From 42 university students were required to attend frequent and time-consuming military training sessions run by the SA. First-year students also had to serve six months in a labour camp for the ": null
    },
    {
        "Reich Labour Service": "reich labour service"
    },
    {
        "; an additional ten weeks service were required of second-year students.            Women were a cornerstone of Nazi social policy. The Nazis opposed the feminist movement, claiming that it was the creation of Jewish intellectuals, instead advocating a ": null
    },
    {
        "patriarchal": "patriarchal"
    },
    {
        " society in which the German woman would recognise that her world is her husband, her family, her children, and her home . Feminist groups were shut down or incorporated into the ": null
    },
    {
        "National Socialist Womens League": "national socialist womens league"
    },
    {
        ", which coordinated groups throughout the country to promote motherhood and household activities. Courses were offered on childrearing, sewing, and cooking. Prominent feminists, including ": null
    },
    {
        "Anita Augspurg": "anita augspurg"
    },
    {
        ", ": null
    },
    {
        "Lida Gustava Heymann": "lida gustava heymann"
    },
    {
        ", and ": null
    },
    {
        "Helene Stöcker": "helene stöcker"
    },
    {
        ", felt forced to live in exile. The League published the  NS-Frauen-Warte , the only NSDAP-approved womens magazine in Nazi Germany; despite some propaganda aspects, it was predominantly an ordinary womans magazine.     Women were encouraged to leave the workforce, and the creation of large families by racially suitable women was promoted through a propaganda campaign. Women received a bronze award—known as the  Ehrenkreuz der Deutschen Mutter  —for giving birth to four children, silver for six, and gold for eight or more. Large families received subsidies to help with expenses. Though the measures led to increases in the birth rate, the number of families having four or more children declined by five percent between 42 and 42 Removing women from the workforce did not have the intended effect of freeing up jobs for men, as women were for the most part employed as domestic servants, weavers, or in the food and drink industries—jobs that were not of interest to men. Nazi philosophy prevented large numbers of women from being hired to work in munitions factories in the build-up to the war, so foreign labourers were brought in. After the war started, slave labourers were extensively used. In January 42 Hitler signed a decree requiring all women under the age of fifty to report for work assignments to help the war effort. Thereafter women were funnelled into agricultural and industrial jobs, and by September 42 42  million women were working in munitions production.     Nazi leaders endorsed the idea that rational and theoretical work was alien to a womans nature, and as such discouraged women from seeking higher education.  A law passed in April 42 limited the number of females admitted to university to ten percent of the number of male attendees. This resulted in female enrolment in secondary schools dropping from 42 in 42 to 42 in 42 The number of women enrolled in post-secondary schools dropped from 42 in 42 to 42 in 42 However, with the requirement that men be enlisted into the armed forces during the war, women comprised half of the enrolment in the post-secondary system by 42          Women were expected to be strong, healthy, and vital. The sturdy peasant woman who ": null
    },
    {
        "worked the land": "blood and soil"
    },
    {
        " and bore strong children was considered ideal, and women were praised for being athletic and tanned from working outdoors. Organisations were created for the indoctrination of Nazi values. From 42 March 42 membership in the ": null
    },
    {
        "Hitler Youth": "hitler youth"
    },
    {
        " was made compulsory for all children over the age of ten. The  Jungmädelbund  section of the Hitler Youth was for girls age 42 to 42 and the  Bund Deutscher Mädel  was for young women age 42 to 42 The BDMs activities focused on physical education, with activities such as running, long jumping, somersaulting, tightrope walking, marching, and swimming.     The Nazi regime promoted a liberal code of conduct regarding sexual matters and was sympathetic to women who bore children out of wedlock. Promiscuity increased as the war progressed, with unmarried soldiers often intimately involved with several women simultaneously. Soldiers wives were frequently involved in extramarital relationships. Sex was sometimes used as a commodity to obtain better work from a foreign labourer. Pamphlets enjoined German women to avoid sexual relations with foreign workers as a danger to their blood.     With Hitlers approval, Himmler intended that the new society of the Nazi regime should destigmatise illegitimate births, particularly of children fathered by members of the SS, who were vetted for racial purity. His hope was that each SS family would have between four and six children. The  Lebensborn  association, founded by Himmler in 42 created a series of maternity homes to accommodate single mothers during their pregnancies. Both parents were examined for racial suitability before acceptance. The resulting children were often adopted into SS families. The homes were also made available to the wives of SS and NSDAP members, who quickly filled over half the available spots.     Existing laws banning abortion except for medical reasons were strictly enforced by the Nazi regime. The number of abortions declined from 42 per year at the start of the 42s to fewer than 42 per year at the end of the decade, though in 42 a law was passed allowing abortions for eugenics reasons.            Nazi Germany had a strong ": null
    },
    {
        "anti-tobacco movement": "anti-tobacco movement in nazi germany"
    },
    {
        ", as pioneering research by Franz H. Müller in 42 demonstrated a causal link between smoking and lung cancer. The Reich Health Office took measures to try to limit smoking, including producing lectures and pamphlets. Smoking was banned in many workplaces, on trains, and among on-duty members of the military. Government agencies also worked to control other carcinogenic substances such as asbestos and pesticides. As part of a general public health campaign, water supplies were cleaned up, lead and mercury were removed from consumer products, and women were urged to undergo regular screenings for breast cancer.     Government-run health care insurance plans were available, but Jews were denied coverage starting in 42 That same year, Jewish doctors were forbidden to treat government-insured patients. In 42 Jewish doctors were forbidden to treat non-Jewish patients and in 42 their right to practice medicine was removed entirely.     Medical experiments, many of them ": null
    },
    {
        "pseudoscientific": "pseudoscientific"
    },
    {
        ", were performed on concentration camp inmates beginning in 42 The most notorious doctor to perform medical experiments was SS- Hauptsturmführer  Dr. ": null
    },
    {
        "Josef Mengele": "josef mengele"
    },
    {
        ", camp doctor at Auschwitz. Many of his victims died or were intentionally killed. Concentration camp inmates were made available for purchase by pharmaceutical companies for drug testing and other experiments.            Nazi society had elements supportive of animal rights and many people were fond of zoos and wildlife. The government took several measures to ensure the protection of animals and the environment. In 42 the Nazis enacted a stringent animal-protection law that affected what was allowed for medical research. The law was only loosely enforced, and in spite of a ban on vivisection, the Ministry of the Interior readily handed out permits for experiments on animals.     The Reich Forestry Office under Göring enforced regulations that required foresters to plant a variety of trees to ensure suitable habitat for wildlife, and a new Reich Animal Protection Act became law in 42 The regime enacted the Reich Nature Protection Act in 42 to protect the natural landscape from excessive economic development. It allowed for the expropriation of privately owned land to create nature preserves and aided in long-range planning. Perfunctory efforts were made to curb air pollution, but little enforcement of existing legislation was undertaken once the war began.               When the Nazis seized power in 42 roughly 42 percent of the population of Germany was ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        ", 42 percent was ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ", while ": null
    },
    {
        "Jews": "jews"
    },
    {
        " made up less than 42 percent. According to 42 census, 42 percent considered themselves Protestant, 42 percent Roman Catholic, 42 percent  Gottgläubig  and 42 percent ": null
    },
    {
        "nonreligious": "nonreligious"
    },
    {
        ".     Under the  Gleichschaltung  process, Hitler attempted to create a ": null
    },
    {
        "unified": "united and uniting churches"
    },
    {
        " Protestant Reich Church": "protestant reich church"
    },
    {
        " from Germanys 42 existing Protestant ": null
    },
    {
        "state churches": "landeskirche"
    },
    {
        ", with the ultimate goal of eradication of the churches in Germany. Pro-Nazi ": null
    },
    {
        "Ludwig Müller": "ludwig müller"
    },
    {
        " was installed as Reich Bishop and the pro-Nazi pressure group ": null
    },
    {
        "German Christians": "german christians"
    },
    {
        " gained control of the new church. They objected to the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        " because of its Jewish origins and demanded that converted Jews be barred from their church. Pastor ": null
    },
    {
        "Martin Niemöller": "martin niemöller"
    },
    {
        " responded with the formation of the ": null
    },
    {
        "Confessing Church": "confessing church"
    },
    {
        ", from which some clergymen opposed the Nazi regime. When in 42 the Confessing Church synod protested the Nazi policy on religion, 42 of their pastors were arrested. Müller resigned and Hitler appointed ": null
    },
    {
        "Hanns Kerrl": "hanns kerrl"
    },
    {
        " as Minister for Church Affairs to continue efforts to control Protestantism. In 42 a Confessing Church envoy protested to Hitler against the religious persecutions and human rights abuses. Hundreds more pastors were arrested. The church continued to resist and by early 42 Hitler abandoned his hope of uniting the Protestant churches. Niemöller was arrested on 42 July 42 and spent most of the next seven years in ": null
    },
    {
        "Sachsenhausen concentration camp": "sachsenhausen concentration camp"
    },
    {
        " and Dachau. Theological universities were closed and pastors and theologians of other Protestant denominations were also arrested.          Persecution of the ": null
    },
    {
        "Catholic Church in Germany": "catholic church in germany"
    },
    {
        " followed the Nazi takeover. Hitler moved quickly to eliminate ": null
    },
    {
        "political Catholicism": "political catholicism"
    },
    {
        ", rounding up functionaries of the Catholic-aligned ": null
    },
    {
        "Bavarian Peoples Party": "bavarian peoples party"
    },
    {
        " and ": null
    },
    {
        "Catholic Centre Party": "catholic centre party"
    },
    {
        ", which along with all other non-Nazi political parties ceased to exist by July. The  Reichskonkordat  treaty with the Vatican was signed in 42 amid continuing harassment of the church in Germany. The treaty required the regime to honour the independence of Catholic institutions and prohibited clergy from involvement in politics. Hitler routinely disregarded the Concordat, closing all Catholic institutions whose functions were not strictly religious. Clergy, nuns and lay leaders were targeted, with thousands of arrests over the ensuing years, often on trumped-up charges of currency smuggling or immorality. Several Catholic leaders were targeted in the 42 ": null
    },
    {
        "Night of the Long Knives": "night of the long knives"
    },
    {
        " assassinations. Most Catholic youth groups refused to dissolve themselves and Hitler Youth leader ": null
    },
    {
        "Baldur von Schirach": "baldur von schirach"
    },
    {
        " encouraged members to attack Catholic boys in the streets. Propaganda campaigns claimed the church was corrupt, restrictions were placed on public meetings and Catholic publications faced censorship. Catholic schools were required to reduce religious instruction and crucifixes were removed from state buildings.     ": null
    },
    {
        "Pope Pius XI": "pope pius xi"
    },
    {
        " had the  Mit brennender Sorge  encyclical smuggled into Germany for ": null
    },
    {
        "Passion Sunday": "passion sunday"
    },
    {
        " 42 and read from every pulpit as it denounced the systematic hostility of the regime toward the church. In response, Goebbels renewed the regimes crackdown and propaganda against Catholics. Enrolment in denominational schools dropped sharply and by 42 all such schools were disbanded or converted to public facilities. Later Catholic protests included the 42 March 42 pastoral letter by the German bishops on The Struggle against Christianity and the Church . About 42 percent of Catholic priests were disciplined by police during the Nazi era. A vast security network spied on the activities of clergy and priests were frequently denounced, arrested or sent to concentration camps – many to the dedicated ": null
    },
    {
        "clergy barracks": "priest barracks of dachau concentration camp"
    },
    {
        " at Dachau. In the ": null
    },
    {
        "areas of Poland annexed in 42": "polish areas annexed by nazi germany"
    },
    {
        ", the Nazis instigated a ": null
    },
    {
        "brutal suppression": "nazi persecution of the catholic church in poland"
    },
    {
        " and systematic dismantling of the Catholic Church.     ": null
    },
    {
        "Alfred Rosenberg": "alfred rosenberg"
    },
    {
        ", head of the ": null
    },
    {
        "NSDAP Office of Foreign Affairs": "nsdap office of foreign affairs"
    },
    {
        " and Hitlers appointed cultural and educational leader for Nazi Germany, considered Catholicism to be among the Nazis chief enemies. He planned the extermination of the foreign Christian faiths imported into Germany , and for the ": null
    },
    {
        "Bible": "bible"
    },
    {
        " and ": null
    },
    {
        "Christian cross": "christian cross"
    },
    {
        " to be replaced in all churches, cathedrals, and chapels with copies of Mein Kampf and the swastika. Other sects of Christianity were also targeted, with Chief of the ": null
    },
    {
        "NSDAP Chancellery": "nazi party chancellery"
    },
    {
        " Martin Bormann": "martin bormann"
    },
    {
        " publicly proclaiming in 42 National Socialism and Christianity are irreconcilable.  Shirer writes that opposition to Christianity within NSDAP leadership was so pronounced that, the Nazi regime intended to eventually destroy Christianity in Germany, if it could, and substitute the old paganism of the early tribal Germanic gods and the new paganism of the Nazi extremists.              While no unified ": null
    },
    {
        "resistance movement": "resistance movement"
    },
    {
        " opposing the Nazi regime existed, acts of defiance such as sabotage and labour slowdowns took place, as well as attempts to overthrow the regime or assassinate Hitler. The banned Communist and Social Democratic parties set up resistance networks in the mid42s. These networks achieved little beyond fomenting unrest and initiating short-lived strikes. ": null
    },
    {
        "Carl Friedrich Goerdeler": "carl friedrich goerdeler"
    },
    {
        ", who initially supported Hitler, changed his mind in 42 and was later a participant in the ": null
    },
    {
        "July 42 plot": "july 20 plot"
    },
    {
        ". The ": null
    },
    {
        "Red Orchestra": "red orchestra"
    },
    {
        " spy ring provided information to the Allies about Nazi war crimes, helped orchestrate escapes from Germany, and distributed leaflets. The group was detected by the Gestapo and more than 42 members were tried and executed in 42 Communist and Social Democratic resistance groups resumed activity in late 42 but were unable to achieve much beyond distributing leaflets. The two groups saw themselves as potential rival parties in post-war Germany, and for the most part did not co-ordinate their activities. The ": null
    },
    {
        "White Rose": "white rose"
    },
    {
        " resistance group was primarily active in 42–42 and many of its members were arrested or executed, with the final arrests taking place in 42 Another civilian resistance group, the ": null
    },
    {
        "Kreisau Circle": "kreisau circle"
    },
    {
        ", had some connections with the military conspirators, and many of its members were arrested after the failed 42 July plot.     While civilian efforts had an impact on public opinion, the army was the only organisation with the capacity to overthrow the government. A major plot by men in the upper echelons of the military originated in 42 They believed Britain would go to war over Hitlers planned invasion of Czechoslovakia, and Germany would lose. The plan was to overthrow Hitler or possibly assassinate him. Participants included ": null
    },
    {
        "Generaloberst": "generaloberst"
    },
    {
        " Ludwig Beck": "ludwig beck"
    },
    {
        ", Generaloberst ": null
    },
    {
        "Walther von Brauchitsch": "walther von brauchitsch"
    },
    {
        ", Generaloberst ": null
    },
    {
        "Franz Halder": "franz halder"
    },
    {
        ", ": null
    },
    {
        "Admiral": "admiral german navies until 1945"
    },
    {
        " Wilhelm Canaris": "wilhelm canaris"
    },
    {
        ", and ": null
    },
    {
        "Generalleutnant": "generalleutnant"
    },
    {
        " Erwin von Witzleben": "erwin von witzleben"
    },
    {
        ", who joined ": null
    },
    {
        "a conspiracy": "oster conspiracy"
    },
    {
        " headed by ": null
    },
    {
        "Oberstleutnant": "oberstleutnant"
    },
    {
        " Hans Oster": "hans oster"
    },
    {
        " and Major ": null
    },
    {
        "Helmuth Groscurth": "helmuth groscurth"
    },
    {
        " of the ": null
    },
    {
        "Abwehr": "abwehr"
    },
    {
        ". The planned coup was cancelled after the signing of the Munich Agreement in September 42 Many of the same people were involved in a coup planned for 42 but again the participants changed their minds and backed down, partly because of the popularity of the regime after the early victories in the war. Attempts to assassinate Hitler resumed in earnest in 42 with ": null
    },
    {
        "Henning von Tresckow": "henning von tresckow"
    },
    {
        " joining Osters group and attempting to blow up Hitlers plane in 42 Several more attempts followed before the failed 42 July 42 plot, which was at least partly motivated by the increasing prospect of a German defeat in the war. The plot, part of ": null
    },
    {
        "Operation Valkyrie": "operation valkyrie"
    },
    {
        ", involved ": null
    },
    {
        "Claus von Stauffenberg": "claus von stauffenberg"
    },
    {
        " planting a bomb in the conference room at ": null
    },
    {
        "Wolfs Lair": "wolfs lair"
    },
    {
        " at ": null
    },
    {
        "Rastenburg": "rastenburg"
    },
    {
        ". Hitler, who narrowly survived, later ordered savage reprisals resulting in the execution of more than 42  people.            The regime promoted the concept of  Volksgemeinschaft , a national German ethnic community. The goal was to build a classless society based on racial purity and the perceived need to prepare for warfare, conquest and a struggle against Marxism. The German Labour Front founded the  Kraft durch Freude  organisation in 42 As well as taking control of tens of thousands of privately run recreational clubs, it offered highly regimented holidays and entertainment such as cruises, vacation destinations and concerts.     The  Reichskulturkammer  was organised under the control of the Propaganda Ministry in September 42 Sub-chambers were set up to control aspects of cultural life such as film, radio, newspapers, fine arts, music, theatre and literature. Members of these professions were required to join their respective organisation. Jews and people considered politically unreliable were prevented from working in the arts, and many emigrated. Books and scripts had to be approved by the Propaganda Ministry prior to publication. Standards deteriorated as the regime sought to use cultural outlets exclusively as propaganda media.     Radio became popular in Germany during the 42s; over 42 percent of households owned a receiver by 42 more than any other country. By July 42 radio station staffs were purged of leftists and others deemed undesirable. Propaganda and speeches were typical radio fare immediately after the seizure of power, but as time went on Goebbels insisted that more music be played so that listeners would not turn to foreign broadcasters for entertainment.               Newspapers, like other media, were controlled by the state; the Reich Press Chamber shut down or bought newspapers and publishing houses. By 42 over two-thirds of the newspapers and magazines were directly owned by the Propaganda Ministry. The NSDAP daily newspaper, the  Völkischer Beobachter  , was edited by Rosenberg, who also wrote  The Myth of the Twentieth Century , a book of racial theories espousing Nordic superiority. Goebbels controlled the wire services and insisted that all newspapers in Germany only publish content favourable to the regime. Under Goebbels, the Propaganda Ministry issued two dozen directives every week on exactly what news should be published and what angles to use; the typical newspaper followed the directives closely, especially regarding what to omit. Newspaper readership plummeted, partly because of the decreased quality of the content and partly because of the surge in popularity of radio. Propaganda became less effective towards the end of the war, as people were able to obtain information outside of official channels.     Authors of books left the country in droves and some wrote material critical of the regime while in exile. Goebbels recommended that the remaining authors concentrate on books themed on Germanic myths and the concept of ": null
    },
    {
        "blood and soil": "blood and soil"
    },
    {
        ". By the end of 42 over a thousand books—most of them by Jewish authors or featuring Jewish characters—had been banned by the Nazi regime. ": null
    },
    {
        "Nazi book burnings": "nazi book burnings"
    },
    {
        " took place; nineteen such events were held on the night of 42 May 42 Tens of thousands of books from dozens of figures, including ": null
    },
    {
        "Albert Einstein": "albert einstein"
    },
    {
        ", ": null
    },
    {
        "Sigmund Freud": "sigmund freud"
    },
    {
        ", ": null
    },
    {
        "Helen Keller": "helen keller"
    },
    {
        ", ": null
    },
    {
        "Alfred Kerr": "alfred kerr"
    },
    {
        ", ": null
    },
    {
        "Marcel Proust": "marcel proust"
    },
    {
        ", ": null
    },
    {
        "Erich Maria Remarque": "erich maria remarque"
    },
    {
        ", ": null
    },
    {
        "Upton Sinclair": "upton sinclair"
    },
    {
        ", ": null
    },
    {
        "Jakob Wassermann": "jakob wassermann"
    },
    {
        ", ": null
    },
    {
        "H. G. Wells": "h. g. wells"
    },
    {
        ", and ": null
    },
    {
        "Émile Zola": "émile zola"
    },
    {
        " were publicly burned. Pacifist works, and literature espousing liberal, democratic values were targeted for destruction, as well as any writings supporting the Weimar Republic or those written by Jewish authors.                 Hitler took a personal interest in architecture and worked closely with state architects ": null
    },
    {
        "Paul Troost": "paul troost"
    },
    {
        " and ": null
    },
    {
        "Albert Speer": "albert speer"
    },
    {
        " to create public buildings in a ": null
    },
    {
        "neoclassical": "neoclassical architecture"
    },
    {
        " style based on ": null
    },
    {
        "Roman architecture": "roman architecture"
    },
    {
        ". Speer constructed imposing structures such as the ": null
    },
    {
        "Nazi party rally grounds": "nazi party rally grounds"
    },
    {
        " in ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        " and a new ": null
    },
    {
        "Reich Chancellery": "reich chancellery"
    },
    {
        " building in Berlin. Hitlers plans for rebuilding Berlin included a gigantic dome based on the ": null
    },
    {
        "Pantheon": "pantheon, rome"
    },
    {
        " in Rome and a ": null
    },
    {
        "triumphal arch": "triumphal arch"
    },
    {
        " more than double the height of the ": null
    },
    {
        "Arc de Triomphe": "arc de triomphe"
    },
    {
        " in Paris. Neither structure was built.     Hitlers belief that ": null
    },
    {
        "abstract": "abstract art"
    },
    {
        ", ": null
    },
    {
        "Dadaist": "dadaist"
    },
    {
        ", ": null
    },
    {
        "expressionist": "expressionist"
    },
    {
        " and ": null
    },
    {
        "modern art": "modern art"
    },
    {
        " were decadent became the basis for policy. Many art museum directors lost their posts in 42 and were replaced by party members. Some 42 modern works of art were removed from museums and replaced with works chosen by a Nazi jury. Exhibitions of the rejected pieces, under titles such as Decadence in Art , were launched in sixteen different cities by 42 The ": null
    },
    {
        "Degenerate Art Exhibition": "degenerate art exhibition"
    },
    {
        ", organised by Goebbels, ran in Munich from July to November 42 The exhibition proved wildly popular, attracting over two million visitors.     Composer ": null
    },
    {
        "Richard Strauss": "richard strauss"
    },
    {
        " was appointed president of the  Reichsmusikkammer  on its founding in November 42 As was the case with other art forms, the Nazis ostracised musicians who were deemed racially unacceptable and for the most part disapproved of music that was too modern or ": null
    },
    {
        "atonal": "atonal"
    },
    {
        ". ": null
    },
    {
        "Jazz": "jazz"
    },
    {
        " was considered especially inappropriate and foreign jazz musicians left the country or were expelled. Hitler favoured the music of ": null
    },
    {
        "Richard Wagner": "richard wagner"
    },
    {
        ", especially pieces based on Germanic myths and heroic stories, and attended the ": null
    },
    {
        "Bayreuth Festival": "bayreuth festival"
    },
    {
        " each year from 42 to 42                 Movies were popular in Germany in the 42s and 42s, with admissions of over a billion people in 42 42 and 42 By 42 German regulations restricting currency exports made it impossible for US film makers to take their profits back to America, so the major film studios closed their German branches. Exports of German films plummeted, as their antisemitic content made them impossible to show in other countries. The two largest film companies, ": null
    },
    {
        "Universum Film AG": "universum film ag"
    },
    {
        " and ": null
    },
    {
        "Tobis": "wien-film"
    },
    {
        ", were purchased by the Propaganda Ministry, which by 42 was producing most German films. The productions were not always overtly propagandistic, but generally had a political subtext and followed party lines regarding themes and content. Scripts were pre-censored.     ": null
    },
    {
        "Leni Riefenstahl": "leni riefenstahl"
    },
    {
        "s  Triumph of the Will  —documenting the 42 Nuremberg Rally—and  Olympia  —covering the ": null
    },
    {
        "42 Summer Olympics": "1936 summer olympics"
    },
    {
        "—pioneered techniques of camera movement and editing that influenced later films. New techniques such as telephoto lenses and cameras mounted on tracks were employed. Both films remain controversial, as their aesthetic merit is inseparable from their propagandising of National Socialist ideals.                  The Allied powers organised war crimes trials, beginning with the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        ", held from November 42 to October 42 of 42 top Nazi officials. They were charged with four counts—conspiracy to commit crimes, crimes against peace, ": null
    },
    {
        "war crime": "war crime"
    },
    {
        "s and ": null
    },
    {
        "crimes against humanity": "crimes against humanity"
    },
    {
        "—in violation of international laws governing warfare. All but three of the defendants were found guilty and twelve were sentenced to death. Twelve ": null
    },
    {
        "Subsequent Nuremberg trials": "subsequent nuremberg trials"
    },
    {
        " of 42 defendants were held between 42 and 42 Between 42 and 42 the Allies investigated 42 cases, of which 42 were brought to trial. The result was convictions of 42 people; 42 of these were sentenced to death and 42 to life in prison, with the remainder receiving lesser sentences. About 42 percent of the death sentences were carried out. Poland was more active than other nations in investigating war crimes, for example prosecuting 42 of the total 42 Auschwitz staff brought to trial.     The political programme espoused by Hitler and the NSDAP brought about a world war, leaving behind a devastated and impoverished Europe. Germany itself suffered wholesale destruction, characterised as  Stunde Null  . The number of civilians killed during the Second World War was unprecedented in the history of warfare. As a result, Nazi ideology and the actions taken by the regime are almost universally regarded as gravely immoral. Historians, philosophers, and politicians often use the word ": null
    },
    {
        "evil": "evil"
    },
    {
        " to describe Hitler and the Nazi regime. Interest in Nazi Germany continues in the media and the academic world. While Evans remarks that the era exerts an almost universal appeal because its murderous racism stands as a warning to the whole of humanity , young neo-Nazis enjoy the shock value the use Nazi symbols or slogans provides. The display or use of ": null
    },
    {
        "Nazi symbolism": "nazi symbolism"
    },
    {
        " such as flags, ": null
    },
    {
        "swastika": "swastika"
    },
    {
        "s, or greetings is illegal in Germany and Austria.     The process of denazification, which was initiated by the Allies as a way to remove Nazi Party members was only partially successful, as the need for experts in such fields as medicine and engineering was too great. However, expression of Nazi views was frowned upon, and those who expressed such views were frequently dismissed from their jobs. From the immediate post-war period through the 42s, people avoided talking about the Nazi regime or their own wartime experiences. While virtually every family suffered losses during the war has a story to tell, Germans kept quiet about their experiences and felt a sense of communal guilt, even if they were not directly involved in war crimes.     The trial of ": null
    },
    {
        "Adolf Eichmann": "adolf eichmann"
    },
    {
        " in 42 and the broadcast of the television miniseries  Holocaust  in 42 brought the process of  Vergangenheitsbewältigung  to the forefront for many Germans. Once study of Nazi Germany was introduced into the school ": null
    },
    {
        "curriculum": "curriculum"
    },
    {
        " starting in the 42s, people began researching the experiences of their family members. Study of the era and a willingness to critically examine its mistakes has led to the development of a strong democracy in Germany, but with lingering undercurrents of antisemitism and ": null
    },
    {
        "neo-Nazi": "neo-nazi"
    },
    {
        " thought.     In 42 a ": null
    },
    {
        "Körber Foundation": "körber foundation"
    },
    {
        " survey found that 42 percent of 42-year-olds in Germany did not know what ": null
    },
    {
        "Auschwitz": "auschwitz concentration camp"
    },
    {
        " was. The journalist ": null
    },
    {
        "Alan Posener": "alan posener"
    },
    {
        " attributed the countrys growing historical amnesia in part to a failure by the German film and television industry to reflect the countrys history accurately.": null
    }
]