[
    {
        "In ": null
    },
    {
        "probability theory": "probability theory"
    },
    {
        " and ": null
    },
    {
        "statistics": "statistics"
    },
    {
        ", the negative binomial distribution is a ": null
    },
    {
        "discrete probability distribution": "discrete probability distribution"
    },
    {
        " of the number of successes in a sequence of independent and identically distributed ": null
    },
    {
        "Bernoulli trial": "bernoulli trial"
    },
    {
        "s before a specified number of failures  occurs. For example, if we define a 42 as failure, all non42s as successes, and we throw a ": null
    },
    {
        "dice": "dice"
    },
    {
        " repeatedly until 42 appears the third time , then the probability distribution of the number of non42s that appeared will be a negative binomial distribution.     The Pascal distribution  and Polya distribution  are special cases of the negative binomial distribution. A convention among engineers, climatologists, and others is to use negative binomial or Pascal for the case of an integer-valued stopping-time parameter r, and use Polya for the real-valued case.     For occurrences of contagious discrete events, like tornado outbreaks, the Polya distributions can be used to give more accurate models than the ": null
    },
    {
        "Poisson distribution": "poisson distribution"
    },
    {
        " by allowing the mean and variance to be different, unlike the Poisson. Contagious events have positively correlated occurrences causing a larger ": null
    },
    {
        "variance": "variance"
    },
    {
        " than if the occurrences were independent, due to a positive ": null
    },
    {
        "covariance": "covariance"
    },
    {
        " term.       Suppose there is a sequence of independent ": null
    },
    {
        "Bernoulli trial": "bernoulli trial"
    },
    {
        "s. Thus, each trial has two potential outcomes called success and failure . In each trial the probability of success is p and of failure is . We are observing this sequence until a predefined number r of failures have occurred. Then the random number of successes we have seen, X, will have the negative binomial  distribution:   :   X\\sim\\operatorname       When applied to real-world problems, outcomes of success and failure may or may not be outcomes we ordinarily view as good and bad, respectively. Suppose we used the negative binomial distribution to model the number of days a certain machine works before it breaks down. In this case success would be the result on a day when the machine worked properly, whereas a breakdown would be a failure . If we used the negative binomial distribution to model the number of goal attempts an athlete makes before scoring r goals, though, then each unsuccessful attempt would be a success , and scoring a goal would be failure . If we are tossing a coin, then the negative binomial distribution can give the number of tails we are likely to encounter before we encounter a certain number of heads . In the probability mass function below, p is the probability of success, and  is the probability of failure.       The ": null
    },
    {
        "probability mass function": "probability mass function"
    },
    {
        " of the negative binomial distribution is   :   f \\equiv \\Pr \\binom ^r p^k       where k is the number of successes, r is the number of failures, and p is the probability of success. Here the quantity in parentheses is the ": null
    },
    {
        "binomial coefficient": "binomial coefficient"
    },
    {
        ", and is equal to   :   \\binom \\frac \\frac.       This quantity can alternatively be written in the following manner, explaining the name negative binomial :     :   \\begin   & \\frac \\\\   & ^k \\frac ^k\\binom.   \\end       Note that by the last expression and the ": null
    },
    {
        "binomial series": "binomial series"
    },
    {
        ", for every ": null
    }
]