[
    {
        "The Negro leagues were United States professional ": null
    },
    {
        "baseball": "baseball"
    },
    {
        " leagues comprising teams predominantly made up of ": null
    },
    {
        "African American": "african american"
    },
    {
        "s and, to a lesser extent, Latin Americans. The term may be used broadly to include professional black teams outside the leagues and it may be used narrowly for the ": null
    },
    {
        "seven relatively successful leagues beginning in 42": "negro major leagues"
    },
    {
        " that are sometimes termed Negro Major Leagues .     In 42 the ": null
    },
    {
        "Cuban Giants": "cuban giants"
    },
    {
        " formed the first black professional baseball team. The first league, the ": null
    },
    {
        "National Colored Base Ball League": "national colored base ball league"
    },
    {
        ", was organized strictly as a minor league but failed in ": null
    },
    {
        "42": "1887 in baseball"
    },
    {
        " after only two weeks owing to low attendance. The ": null
    },
    {
        "Negro American League": "negro american league"
    },
    {
        " of ": null
    },
    {
        "42": "1951 in baseball"
    },
    {
        " is considered the last major league season and the last professional club, the ": null
    },
    {
        "Indianapolis Clowns": "indianapolis clowns"
    },
    {
        ", operated as a humorous sideshow rather than competitively from the mid42s to the 42s.              Because black people were not being accepted into the major and minor baseball leagues due to racism in the United States, they formed their own teams and had made professional teams by the 42s. The first known baseball game between two black teams was held on November 42 42 in New York City. The Henson Base Ball Club of ": null
    },
    {
        "Jamaica, Queens": "jamaica, queens"
    },
    {
        ", defeated the Unknowns of ": null
    },
    {
        "Weeksville, Brooklyn": "weeksville, brooklyn"
    },
    {
        ", 42 to 42     Immediately after the end of the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " in 42 and during the ": null
    },
    {
        "Reconstruction": "reconstruction era"
    },
    {
        " period that followed, a black baseball scene formed in the East and Mid-Atlantic states. Comprising mainly ex-soldiers and promoted by some well-known black officers, teams such as the Jamaica Monitor Club, ": null
    },
    {
        "Albany Bachelors": "albany bachelors"
    },
    {
        ", Philadelphia Excelsiors and Chicago Uniques started playing each other and any other team that would play against them.     By the end of the 42s, the black baseball mecca was ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        ", which had an African-American population of 42. Two former ": null
    },
    {
        "cricket": "cricket"
    },
    {
        " players, James H. Francis and Francis Wood, formed the ": null
    },
    {
        "Pythian Base Ball Club": "pythian base ball club"
    },
    {
        ". They played in ": null
    },
    {
        "Camden, New Jersey": "camden, new jersey"
    },
    {
        ", at the landing of the Federal Street Ferry, because it was difficult to get permits for black baseball games in the city. ": null
    },
    {
        "Octavius Catto": "octavius catto"
    },
    {
        ", the promoter of the Pythians, decided to apply for membership in the ": null
    },
    {
        "National Association of Base Ball Players": "national association of base ball players"
    },
    {
        ", normally a matter of sending delegates to the annual convention; beyond that, a formality. At the end of the 42 season the National Association of Baseball Players voted to exclude any club with a black player.  In some ways Blackball thrived under ": null
    },
    {
        "segregation": "racial segregation"
    },
    {
        ", with the few black teams of the day playing not only each other but white teams as well. Black teams earned the bulk of their income playing white independent semipro clubs.           Baseball featuring African American players became professionalized by the 42s. The first known professional black baseball player was ": null
    },
    {
        "Bud Fowler": "bud fowler"
    },
    {
        ", who appeared in a handful of games with a ": null
    },
    {
        "Chelsea, Massachusetts": "chelsea, massachusetts"
    },
    {
        " club in April 42 and then pitched for the ": null
    },
    {
        "Lynn, Massachusetts": "lynn, massachusetts"
    },
    {
        " team in the ": null
    },
    {
        "International Association": "international association for professional base ball players"
    },
    {
        ".   ": null
    },
    {
        "Moses Fleetwood Walker": "fleet walker"
    },
    {
        " and his brother, ": null
    },
    {
        "Welday Wilberforce Walker": "welday walker"
    },
    {
        ", were the first two black players in the major leagues. They both played for the 42 ": null
    },
    {
        "Toledo Blue Stockings": "toledo blue stockings"
    },
    {
        " in the ": null
    },
    {
        "American Association": "american association"
    },
    {
        ". Then in 42 second baseman ": null
    },
    {
        "Frank Grant": "frank grant"
    },
    {
        " joined the ": null
    },
    {
        "Buffalo Bisons": "buffalo bisons"
    },
    {
        " of the ": null
    },
    {
        "International League": "international league"
    },
    {
        ", the strongest minor league, and hit .42 third highest in the league. Several other black American players joined the International League the following season, including pitchers ": null
    },
    {
        "George Stovey": "george stovey"
    },
    {
        " and Robert Higgins, but 42 was the last season blacks were permitted in that or any other high minor league.        The first nationally known black professional baseball team was founded in ": null
    },
    {
        "42": "1885 in baseball"
    },
    {
        " when three clubs, the Keystone Athletics of Philadelphia, the Orions of Philadelphia, and the Manhattans of Washington, D.C., merged to form the ": null
    },
    {
        "Cuban Giants": "cuban giants"
    },
    {
        ".     The success of the Cubans led to the creation of the first recognized Negro league in 42—the ": null
    },
    {
        "National Colored Base Ball League": "national colored base ball league"
    },
    {
        ". It was organized strictly as a minor league and founded with six teams: Baltimore Lord Baltimores, ": null
    },
    {
        "Boston Resolutes": "boston resolutes"
    },
    {
        ", Louisville Falls Citys, ": null
    },
    {
        "New York Gorhams": "new york gorhams"
    },
    {
        ", ": null
    },
    {
        "Philadelphia Pythians": "philadelphia pythians"
    },
    {
        ", and ": null
    },
    {
        "Pittsburgh Keystones": "pittsburgh keystones"
    },
    {
        ". Two more joined before the season but never played a game, the ": null
    },
    {
        "Cincinnati Browns": "cincinnati browns"
    },
    {
        " and ": null
    },
    {
        "Washington Capital Cities": "washington capital cities"
    },
    {
        ". The league, led by ": null
    },
    {
        "Walter S. Brown": "walter s. brown"
    },
    {
        " of ": null
    },
    {
        "Pittsburgh": "pittsburgh"
    },
    {
        ", applied for and was granted official minor league status and thus protection under the major league-led ": null
    },
    {
        "National Agreement": "national agreement"
    },
    {
        ". This move prevented any team in organized baseball from signing any of the NCBBL players, which also locked the players to their particular teams within the league. The reserve clause would have tied the players to their clubs from season to season but the NCBBL failed. One month into the season, the Resolutes folded. A week later, only three teams were left.     Because the original Cuban Giants were a popular and business success, many similarly named teams came into existence—including the ": null
    },
    {
        "Cuban X-Giants": "cuban x-giants"
    },
    {
        ", a splinter and a powerhouse around 42; the Genuine Cuban Giants, the renamed Cuban Giants, the ": null
    },
    {
        "Columbia Giants": "columbia giants"
    },
    {
        ", the ": null
    },
    {
        "Brooklyn Royal Giants": "brooklyn royal giants"
    },
    {
        ", and so on. The early Cuban teams were all composed of African Americans rather than Cubans; the purpose was to increase their acceptance with white patrons as ": null
    },
    {
        "Cuba": "cuba"
    },
    {
        " was on very friendly terms with the US during those years. Beginning in 42 several ": null
    },
    {
        "Cuban baseball teams": "baseball in cuba"
    },
    {
        " played in North America, including the ": null
    },
    {
        "All Cubans": "all cubans"
    },
    {
        ", the ": null
    },
    {
        "Cuban Stars ": "cuban stars"
    },
    {
        ", the ": null
    },
    {
        "Cuban Stars ": "cuban stars"
    },
    {
        ", and the ": null
    },
    {
        "New York Cubans": "new york cubans"
    },
    {
        ". Some of them included white Cuban players and some were Negro Leagues members.     The few players on the white minor league teams were constantly dodging verbal and physical abuse from both competitors and fans. Then the ": null
    },
    {
        "Compromise of 42": "compromise of 1877"
    },
    {
        " removed the remaining obstacles from the Souths enacting the ": null
    },
    {
        "Jim Crow laws": "jim crow laws"
    },
    {
        ". To make matters worse, on July 42 42 ": null
    },
    {
        "Cap Anson": "cap anson"
    },
    {
        "s ": null
    },
    {
        "Chicago White Stockings": "chicago white stockings"
    },
    {
        " were scheduled to play the ": null
    },
    {
        "Newark Giants": "newark giants"
    },
    {
        " of the International League, which had Fleet Walker and ": null
    },
    {
        "George Stovey": "george stovey"
    },
    {
        " on its roster. After Anson marched his team onto the field, military style as was his custom, he demanded that the blacks not play. Newark capitulated, and later that same day, league owners voted to refuse future contracts to blacks, citing the hazards imposed by such athletes. , pp. 42–42     In 42 the ": null
    },
    {
        "Middle States League": "middle states league"
    },
    {
        " was formed and it admitted two all-black teams to its otherwise all-white league, the Cuban Giants and their arch-rivals, the ": null
    },
    {
        "New York Gorhams": "new york gorhams"
    },
    {
        ". Despite the animosity between the two clubs, they managed to form a traveling team, the ": null
    },
    {
        "Colored All Americans": "colored all americans"
    },
    {
        ". This enabled them to make money ": null
    },
    {
        "barnstorming": "barnstorm"
    },
    {
        " while fulfilling their league obligations. In 42 the Giants returned to their independent, barnstorming identity, and by 42 they were the only black team in the East still in operation on a full-time basis.          Also in 42 ": null
    },
    {
        "Frank Leland": "frank leland"
    },
    {
        " got some of Chicagos black businessmen to sponsor the black amateur ": null
    },
    {
        "Union Base Ball Club": "union base ball club"
    },
    {
        ". Through Chicagos city government, Leland obtained a permit and lease to play at the ": null
    },
    {
        "South Side Park": "south side park"
    },
    {
        ", a 42 seat facility. Eventually his team went pro and became the ": null
    },
    {
        "Chicago Unions": "chicago unions"
    },
    {
        ".     After his stint with the Gorhams, Bud Fowler caught on with a team out of ": null
    },
    {
        "Findlay, Ohio": "findlay, ohio"
    },
    {
        ". While his team was playing in ": null
    },
    {
        "Adrian, Michigan": "adrian, michigan"
    },
    {
        ", Fowler was persuaded by two white local businessmen, ": null
    },
    {
        "L. W. Hoch": "l. w. hoch"
    },
    {
        " and ": null
    },
    {
        "Rolla Taylor": "rolla taylor"
    },
    {
        " to help them start a team financed by the Page Woven Wire Fence Company, the ": null
    },
    {
        "Page Fence Giants": "page fence giants"
    },
    {
        ". The Page Fence Giants went on to become a powerhouse team that had no home field. Barnstorming through the Midwest, they would play all comers. Their success became the prototype for black baseball for years to come.     After the 42 season, the Page Fence Giants were forced to fold because of finances. ": null
    },
    {
        "Alvin H. Garrett": "alvin h. garrett"
    },
    {
        ", a black businessman in Chicago, and ": null
    },
    {
        "John W. Patterson": "john w. patterson"
    },
    {
        ", the ": null
    },
    {
        "left fielder": "left fielder"
    },
    {
        " for the Page Fence Giants, reformed the team under the name of the ": null
    },
    {
        "Columbia Giants": "columbia giants"
    },
    {
        ". In 42 the Giants folded because of a lack of a place to play. Leland bought the Giants in 42 and merged it with his Unions , and named them the ": null
    },
    {
        "Leland Giants": "leland giants"
    },
    {
        ".          The ": null
    },
    {
        "Philadelphia Giants": "philadelphia giants"
    },
    {
        ", owned by ": null
    },
    {
        "Walter Schlichter": "walter schlichter"
    },
    {
        ", a white businessman, rose to prominence in 42 when they lost to the Cuban X-Giants in their version of the Colored Championship . Leading the way for the Cubans was a young pitcher by the name of ": null
    },
    {
        "Andrew Rube Foster": "rube foster"
    },
    {
        ". The following season, Schlichter, in the finest blackball tradition, hired Foster away from the Cubans, and beat them in their 42 rematch. Philadelphia remained on top of the blackball world until Foster left the team in 42 to play and manage the ": null
    },
    {
        "Leland Giants": "leland giants"
    },
    {
        " .     Around the same time, ": null
    },
    {
        "Nat Strong": "nat strong"
    },
    {
        ", a white businessmen, started using his ownership of baseball fields in the New York City area to become the leading promoter of blackball on the East coast. Just about any game played in New York, Strong would get a cut. Strong eventually used his leverage to almost put the ": null
    },
    {
        "Brooklyn Royal Giants": "brooklyn royal giants"
    },
    {
        " out of business, and then he bought the club and turned it into a barnstorming team.     When Foster joined the Leland Giants, he demanded that he be put in charge of not only the on-field activities, but the bookings as well. Foster immediately turned the Giants into the team to beat. He indoctrinated them to take the extra base, to play hit and run on nearly every pitch, and to rattle the opposing pitcher by taking them deep into the count. He studied the mechanics of his pitchers and could spot the smallest flaw, turning his average pitchers into learned craftsmen. Foster also was able to turn around the business end of the team as well, by demanding and getting 42 percent of the gate instead of the 42 percent that Frank Leland was getting.     By the end of the 42 Foster demanded that Leland step back from all baseball operations or he would leave. When Leland would not give up complete control, Foster quit, and in a heated court battle, got to keep the rights to the Leland Giants name. Leland took the players and started a new team named the Chicago Giants, while Foster took the Leland Giants and started to encroach on Nat Strongs territory.     As early as 42 Foster started talking about reviving the concept of an all-black league. The one thing he was insistent upon was that black teams should be owned by black men. This put him in direct competition with Strong. After 42 Foster renamed his team the ": null
    },
    {
        "Chicago American Giants": "chicago american giants"
    },
    {
        " to appeal to a larger fan base. During the same year, ": null
    },
    {
        "J. L. Wilkinson": "j. l. wilkinson"
    },
    {
        " started the ": null
    },
    {
        "All Nations": "all nations"
    },
    {
        " traveling team. The All Nations team would eventually become one of the best-known and popular teams of the Negro leagues, the ": null
    },
    {
        "Kansas City Monarchs": "kansas city monarchs"
    },
    {
        ".     On April 42 42 the United States entered World War I. Manpower needed by the defense plants and industry accelerated the migration of blacks from the South to the North. This meant a larger and more affluent fan base with more money to spend. By the end of the war in 42 Foster was again ready to start a Negro baseball league.     On February 42 and 42 42 talks were held in ": null
    },
    {
        "Kansas City, Missouri": "kansas city, missouri"
    },
    {
        " that established the ": null
    },
    {
        "Negro National League": "negro national league"
    },
    {
        " and its governing body the ": null
    },
    {
        "National Association of Colored Professional Base Ball Clubs": "national association of colored professional base ball clubs"
    },
    {
        ". The league was initially composed of eight teams: ": null
    },
    {
        "Chicago American Giants": "chicago american giants"
    },
    {
        ", ": null
    },
    {
        "Chicago Giants": "chicago giants"
    },
    {
        ", Cuban Stars, ": null
    },
    {
        "Dayton Marcos": "dayton marcos"
    },
    {
        ", ": null
    },
    {
        "Detroit Stars": "detroit stars"
    },
    {
        ", ": null
    },
    {
        "Indianapolis ABCs": "indianapolis abcs"
    },
    {
        ", ": null
    },
    {
        "Kansas City Monarchs": "kansas city monarchs"
    },
    {
        " and ": null
    },
    {
        "St. Louis Giants": "st. louis giants"
    },
    {
        ". Foster was named league president and controlled every aspect of the league, including which players played on which teams, when and where teams played, and what equipment was used . Foster, as booking agent of the league, took a five percent cut of all gate receipts.       On May 42 42 the Indianapolis ABCs beat the Chicago American Giants in the first game played in the inaugural season of the Negro National League, played at Washington Park in Indianapolis. But, because of the ": null
    },
    {
        "Chicago Race Riot of 42": "chicago race riot of 1919"
    },
    {
        ", the National Guard still occupied the Giants home field, ": null
    },
    {
        "Schorlings Park": "schorlings park"
    },
    {
        " . This forced Foster to cancel all the Giants home games for almost a month and threatened to become a huge embarrassment for the league. On March 42 42 the Negro Southern League was founded in Atlanta, Georgia. In 42 the ": null
    },
    {
        "Negro Southern League": "negro southern league"
    },
    {
        " joined Fosters ": null
    },
    {
        "National Association of Colored Professional Base Ball Clubs": "national association of colored professional base ball clubs"
    },
    {
        ". As a dues-paying member of the association, it received the same protection from raiding parties as any team in the Negro National League.     Foster then admitted John Connors ": null
    },
    {
        "Atlantic City Bacharach Giants": "atlantic city bacharach giants"
    },
    {
        " as an associate member to move further into ": null
    },
    {
        "Nat Strong": "nat strong"
    },
    {
        "s territory. Connors, wanting to return the favor of helping him against Strong, raided ": null
    },
    {
        "Ed Bolden": "ed bolden"
    },
    {
        "s ": null
    },
    {
        "Hilldale Daisies": "hilldale daisies"
    },
    {
        " team. Bolden saw little choice but to team up with Fosters nemesis, Nat Strong. Within days of calling a truce with Strong, Bolden made an about-face and signed up as an associate member of Fosters Negro National League.     On December 42 42 Bolden once again shifted sides and, with Strong, formed the Eastern Colored League as an alternative to Fosters Negro National League, which started with six teams: Atlantic City Bacharach Giants, ": null
    },
    {
        "Baltimore Black Sox": "baltimore black sox"
    },
    {
        ", Brooklyn Royal Giants, New York Cuban Stars, Hilldale, and ": null
    },
    {
        "New York Lincoln Giants": "new york lincoln giants"
    },
    {
        ". The National League was having trouble maintaining continuity among its franchises: three teams folded and had to be replaced after the 42 season, two others after the 42 season, and two more after the 42 season. Foster replaced the defunct teams, sometimes promoting whole teams from the Negro Southern League into the NNL. Finally Foster and Bolden met and agreed to an annual ": null
    },
    {
        "Negro League World Series": "negro league world series"
    },
    {
        " beginning in ": null
    },
    {
        "42": "1924 colored world series"
    },
    {
        ".        42 saw the ": null
    },
    {
        "St. Louis Stars": "st. louis stars"
    },
    {
        " come of age in the Negro National League. They finished in second place during the second half of the year due in large part to their pitcher turned center fielder, ": null
    },
    {
        "Cool Papa Bell": "cool papa bell"
    },
    {
        ", and their shortstop, ": null
    },
    {
        "Willie Wells": "willie wells"
    },
    {
        ". A gas leak in his home nearly asphyxiated Rube Foster in 42 and his increasingly erratic behavior led to him being committed to an asylum a year later. While Foster was out of the picture, the owners of the National League elected ": null
    },
    {
        "William C. Hueston": "william c. hueston"
    },
    {
        " as new league president. In 42 Ed Bolden suffered a similar fate as Foster, by committing himself to a hospital because the pressure was too great. The Eastern League folded shortly after that, marking the end of the Negro League World Series between the NNL and the ECL.     After the Eastern League folded following the 42 season, a new eastern league, the ": null
    },
    {
        "American Negro League": "american negro league"
    },
    {
        ", was formed to replace it. The makeup of the new ANL was nearly the same as the Eastern League, the exception being that the ": null
    },
    {
        "Homestead Grays": "homestead grays"
    },
    {
        " joined in place of the now-defunct Brooklyn Royal Giants. The ANL lasted just one season. In the face of harder economic times, the Negro National League folded after the 42 season. Some of its teams joined the only Negro league then left, the Negro Southern League.     On March 42 42 the Chicago ": null
    },
    {
        "Defender": "chicago defender"
    },
    {
        " announced the end of Negro National League.       Just as Negro league baseball seemed to be at its lowest point and was about to fade into history, along came ": null
    },
    {
        "Cumberland Posey": "cumberland posey"
    },
    {
        " and his Homestead Grays. Posey, Charlie Walker, John Roesnik, George Rossiter, John Drew, Lloyd Thompson and L.R. Williams got together in January 42 and founded the ": null
    },
    {
        "East-West League": "east-west league"
    },
    {
        ". Eight cities were included in the new league: Pittsburgh, Philadelphia, Detroit, Baltimore, Cleveland, Newark, New York, and Washington, D.C. . By May 42 the Detroit Wolves were about to collapse, and instead of letting the team go, Posey kept pumping money into it. By June the Wolves had disintegrated and all the rest of the teams, except for the Grays, were beyond help, so Posey had to terminate the league.     Across town from Posey, ": null
    },
    {
        "Gus Greenlee": "gus greenlee"
    },
    {
        ", a reputed gangster and ": null
    },
    {
        "numbers runner": "numbers game"
    },
    {
        ", had just purchased the ": null
    },
    {
        "Pittsburgh Crawfords": "pittsburgh crawfords"
    },
    {
        ". Greenlees main interest in baseball was to use it as a way to ": null
    },
    {
        "launder money": "money laundering"
    },
    {
        " from his numbers games. But, after learning about Poseys money-making machine in ": null
    },
    {
        "Homestead": "homestead, pennsylvania"
    },
    {
        ", he became obsessed with the sport and his Crawfords. On August 42 42 ": null
    },
    {
        "Satchel Paige": "satchel paige"
    },
    {
        " made his first appearance as a Crawford. With Paige on his team, Greenlee took a huge risk by investing $42 in a new ballpark to be called ": null
    },
    {
        "Greenlee Field": "greenlee field"
    },
    {
        ". On opening day, April 42 42 the pitcher-catcher battery was made up of the two most marketable icons in all of blackball: Satchel Paige and ": null
    },
    {
        "Josh Gibson": "josh gibson"
    },
    {
        ".     In 42 Greenlee, riding the popularity of his Crawfords, became the next man to start a Negro league. In February 42 Greenlee and delegates from six other teams met at Greenlees Crawford Grill to ratify the constitution of the ": null
    },
    {
        "National Organization of Professional Baseball Clubs": "national organization of professional baseball clubs"
    },
    {
        ". The name of the new league was the same as the old league ": null
    },
    {
        "Negro National League": "negro national league"
    },
    {
        " which had disbanded a year earlier in 42 The members of the new league were the Pittsburgh Crawfords, ": null
    },
    {
        "Columbus Blue Birds": "columbus blue birds"
    },
    {
        ", Indianapolis ABCs, Baltimore Black Sox, Brooklyn Royal Giants, Coles American Giants  and Nashville Elite Giants. Greenlee also came up with the idea to duplicate the ": null
    },
    {
        "Major League Baseball All-Star Game": "major league baseball all-star game"
    },
    {
        ", except, unlike the big league method in which the sportswriters chose the players, the fans voted for the participants. The first game, known as the ": null
    },
    {
        "East-West All-Star Game": "east-west all-star game"
    },
    {
        ", was held September 42 42 at ": null
    },
    {
        "Comiskey Park": "comiskey park"
    },
    {
        " in Chicago before a crowd of 42.       With the Japanese ": null
    },
    {
        "Attack on Pearl Harbor": "attack on pearl harbor"
    },
    {
        " on December 42 42 the United States was thrust into World War II. Remembering World War I, black America vowed it would not be shut out of the beneficial effects of a major war effort: economic boom and social unification.     Just like the major leagues, the Negro leagues saw many stars miss one or more seasons while fighting overseas. While many players were over 42 and considered too old for service, ": null
    },
    {
        "Monte Irvin": "monte irvin"
    },
    {
        ", ": null
    },
    {
        "Larry Doby": "larry doby"
    },
    {
        " and ": null
    },
    {
        "Leon Day": "leon day"
    },
    {
        " of ": null
    },
    {
        "Newark": "newark eagles"
    },
    {
        "; ": null
    },
    {
        "Ford Smith": "ford smith"
    },
    {
        ", ": null
    },
    {
        "Hank Thompson": "hank thompson"
    },
    {
        ", ": null
    },
    {
        "Joe Greene": "joe greene"
    },
    {
        ", ": null
    },
    {
        "Willard Brown": "willard brown"
    },
    {
        " and ": null
    },
    {
        "Buck ONeil": "buck oneil"
    },
    {
        " of ": null
    },
    {
        "Kansas City": "kansas city monarchs"
    },
    {
        "; ": null
    },
    {
        "Lyman Bostock": "lyman bostock, sr."
    },
    {
        " of ": null
    },
    {
        "Birmingham": "birmingham black barons"
    },
    {
        "; and ": null
    },
    {
        "Lick Carlisle": "lick carlisle"
    },
    {
        " and ": null
    },
    {
        "Howard Easterling": "howard easterling"
    },
    {
        " of ": null
    },
    {
        "Homestead": "homestead grays"
    },
    {
        " all served. But the white majors were barely recognizable, while the Negro leagues reached their highest plateau. Millions of black Americans were working in war industries and, making good money, they packed league games in every city. Business was so good that promoter ": null
    },
    {
        "Abe Saperstein": "abe saperstein"
    },
    {
        "  started a new circuit, the ": null
    },
    {
        "Negro Midwest League": "negro midwest league"
    },
    {
        ", a minor league similar to the Negro Southern League. The ": null
    },
    {
        "Negro World Series": "negro world series"
    },
    {
        " was revived in 42 this time pitting the winners of the eastern ": null
    },
    {
        "Negro National League": "negro national league"
    },
    {
        " and midwestern ": null
    },
    {
        "Negro American League": "negro american league"
    },
    {
        ". It continued through 42 with the NNL winning four championships and the NAL three.     In 42 Saperstein partnered with ": null
    },
    {
        "Jesse Owens": "jesse owens"
    },
    {
        " to form another Negro League, the ": null
    },
    {
        "West Coast Baseball Association": "west coast baseball association"
    },
    {
        " ; Saperstein was league president and Owens was vice-president and the owner of the leagues ": null
    },
    {
        "Portland Rosebuds": "portland rosebuds"
    },
    {
        " franchise.  The WCBA disbanded after only two months.       ": null
    },
    {
        "Judge Kenesaw M. Landis": "kenesaw mountain landis"
    },
    {
        ", the first ": null
    },
    {
        "Commissioner of Major League Baseball": "baseball commissioner"
    },
    {
        ", was an intractable opponent of integrating the white majors. During his quarter-century tenure, he blocked all attempts at integrating the game. A popular story has it that in , ": null
    },
    {
        "Bill Veeck": "bill veeck"
    },
    {
        " planned to buy the moribund ": null
    },
    {
        "Philadelphia Phillies": "philadelphia phillies"
    },
    {
        " and stock them with Negro League stars. However, when Landis got wind of his plans,  he and National League president ": null
    },
    {
        "Ford Frick": "ford frick"
    },
    {
        " scuttled it in favor of another bid by ": null
    },
    {
        "William D. Cox": "william d. cox"
    },
    {
        ".     After Landis death in 42 ": null
    },
    {
        "Happy Chandler": "happy chandler"
    },
    {
        " was named his successor. Chandler was open to integrating the game, even at the risk of losing his job as Commissioner. He later said in his biography that he could not, in good conscience, tell black players they couldnt play baseball with whites when theyd fought for their country.     In March 42 the white majors created the ": null
    },
    {
        "Major League Committee on Baseball Integration": "major league committee on baseball integration"
    },
    {
        ". Its members included ": null
    },
    {
        "Joseph P. Rainey": "joseph p. rainey"
    },
    {
        ", ": null
    },
    {
        "Larry MacPhail": "larry macphail"
    },
    {
        " and ": null
    },
    {
        "Branch Rickey": "branch rickey"
    },
    {
        ". Because MacPhail, who was an outspoken critic of integration, kept stalling, the committee never met. Under the guise of starting an all-black league, Rickey sent scouts all around the United States, Mexico and ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        ", looking for the perfect candidate to break the color line. His list was eventually narrowed down to three: ": null
    },
    {
        "Roy Campanella": "roy campanella"
    },
    {
        ", ": null
    },
    {
        "Don Newcombe": "don newcombe"
    },
    {
        " and ": null
    },
    {
        "Jackie Robinson": "jackie robinson"
    },
    {
        ".     On August 42 42 Jackie Robinson met with Rickey in Brooklyn, where Rickey gave Robinson a test by berating him and shouting racial epithets that Robinson would hear from day one in the white game. Having passed the test, Robinson signed the contract which stipulated that from then on, Robinson had no written or moral obligations  to any other club. By the inclusion of this clause, precedent was set that would raze the Negro leagues as a functional commercial enterprise.     To throw off the press and keep his intentions hidden, Rickey got heavily involved in Gus Greenlees newest foray into black baseball, the United States League. Greenlee started the league in 42 as a way to get back at the owners of the Negro National League teams for throwing him out. Rickey saw the opportunity as a way to convince people that he was interested in cleaning up blackball, not integrating it. In midsummer 42 Rickey, almost ready with his Robinson plan, pulled out of the league. The league folded after the end of the 42 season.     Pressured by civil rights groups, the ": null
    },
    {
        "Fair Employment Practices Act": "fair employment practices act"
    },
    {
        " was passed by the ": null
    },
    {
        "New York State Legislature": "new york state legislature"
    },
    {
        " in 42 This followed the passing of the ": null
    },
    {
        "Quinn-Ives Act": "quinn-ives act"
    },
    {
        " banning discrimination in hiring. At the same time, ": null
    },
    {
        "NYC Mayor": "mayor of new york city"
    },
    {
        " La Guardia": "fiorello la guardia"
    },
    {
        " formed the ": null
    },
    {
        "Mayors Commission on Baseball": "mayors commission on baseball"
    },
    {
        " to study integration of the major leagues. All this led to Rickey announcing the signing of Robinson much earlier than he would have liked. On October 42 42 ": null
    },
    {
        "Montreal Royals": "montreal royals"
    },
    {
        " president ": null
    },
    {
        "Hector Racine": "hector racine"
    },
    {
        " announced that, We are signing this boy.      Early in 42 Rickey signed four more black players, Campanella, Newcombe, ": null
    },
    {
        "John Wright": "john wright"
    },
    {
        " and ": null
    },
    {
        "Roy Partlow": "roy partlow"
    },
    {
        ", this time with much less fanfare. After the integration of the major leagues in 42 marked by the appearance of ": null
    },
    {
        "Jackie Robinson": "jackie robinson"
    },
    {
        " with the ": null
    },
    {
        "Brooklyn Dodgers": "brooklyn dodgers"
    },
    {
        " that April, interest in Negro league baseball waned. Black players who were regarded as prospects were signed by major league teams, often without regard for any contracts that might have been signed with Negro league clubs. Negro league owners who complained about this practice were in a ": null
    },
    {
        "no-win situation": "no-win situation"
    },
    {
        ": they could not protect their own interests without seeming to interfere with the advancement of players to the majors. By 42 the Dodgers, along with Veecks ": null
    },
    {
        "Cleveland Indians": "cleveland indians"
    },
    {
        " had integrated.     The Negro leagues also integrated around the same time, as ": null
    },
    {
        "Eddie Klep": "eddie klep"
    },
    {
        " became the first white man to play for the ": null
    },
    {
        "Cleveland Buckeyes": "cleveland buckeyes"
    },
    {
        " during the 42 season.     These moves came despite strong opposition from the owners; Rickey was the only one of the 42 owners to support integrating the sport in January 42 Chandlers decision to overrule them may have been a factor in his ouster in 42 in favor of ": null
    },
    {
        "Ford Frick": "ford frick"
    },
    {
        ".       Some proposals were floated to bring the Negro leagues into organized baseball as developmental leagues for black players, but that was recognized as contrary to the goal of full integration. So the Negro leagues, once among the largest and most prosperous black-owned business ventures, were allowed to fade into oblivion.     First a trickle and then a flood of players signed with Major League Baseball teams. Most signed minor league contracts and many languished, shuttled from one bush league team to another despite their success at that level.     The Negro National League folded after the 42 season when the Grays withdrew to resume barnstorming, the Eagles moved to ": null
    },
    {
        "Houston, Texas": "houston, texas"
    },
    {
        ", and the New York Black Yankees folded. The Grays folded one year later after losing $42 in the barnstorming effort. So the Negro American League was the only major Negro League operating in 42 Within two years it had been reduced to minor league caliber and it played its last game in 42     The last All-Star game was held in 42 and by 42 the ": null
    },
    {
        "Indianapolis Clowns": "indianapolis clowns"
    },
    {
        " were the last Negro league team still playing. The Clowns continued to play exhibition games into the 42s, but as a humorous sideshow rather than a competitive sport.       While organized leagues were common in black baseball, there were only seven leagues that are considered to be of the top quality of play at the time of their existence. None materialized prior to 42 and by 42 due to integration, they were in decline. Even though teams were league members, most still continued to barnstorm and play non-league games against local or semi-pro teams. Those games, sometimes approaching 42 per season, did not count in the official standings or statistics. However, some teams were considered associate teams and games played against them did count, but an associate team held no place in the league standings.     ": null
    },
    {
        "Negro National League ": "negro national league"
    },
    {
        ", 42–42   ": null
    },
    {
        "Eastern Colored League": "eastern colored league"
    },
    {
        ", 42–42   ": null
    },
    {
        "American Negro League": "american negro league"
    },
    {
        ", 42; was created from some of the ECL teams but lasted just one season.   ": null
    },
    {
        "East-West League": "east-west league"
    },
    {
        ", 42; ceased operations midway through the season.   ": null
    },
    {
        "Negro Southern League": "negro southern league"
    },
    {
        ", 42; incorporated some teams from the NNL and functioned for one year as a major league, was otherwise a minor league that played from 42 into the 42s.   ": null
    },
    {
        "Negro National League ": "negro national league"
    },
    {
        ", 42–42   ": null
    },
    {
        "Negro American League": "negro american league"
    },
    {
        ", 42–42 or so; after 42 the league and its teams operated after a fashion, mostly as barnstorming units, but historians have a hard time deciding when the league actually came to an end.          The NNL and ECL champions met in a World Series, usually referred to as the Colored World Series , from 42 to 42 .     The NNL and NAL also met in a World Series, usually referred to as the Negro World Series from 42 to 42 .         Early professional leagues cannot be called major or minor. Until the twentieth century, not one completed even half of its planned season. Two leagues can be considered the prototypes for Negro league baseball:   ": null
    },
    {
        "Southern League of Colored Base Ballists": "southern league of colored base ballists"
    },
    {
        ", 42   ": null
    },
    {
        "National Colored Baseball League": "national colored baseball league"
    },
    {
        ", 42     Eventually, some teams were able to survive and even profit by ": null
    },
    {
        "barnstorming": "barnstorm"
    },
    {
        " small towns and playing local semi-pro teams as well as league games. Two important leagues of this era are:   ": null
    },
    {
        "International League of Independent Professional Base Ball Clubs": "international league of independent professional base ball clubs"
    },
    {
        ", 42   ": null
    },
    {
        "National Association of Colored Baseball Clubs of the United States and Cuba": "national association of colored baseball clubs of the united states and cuba"
    },
    {
        ", 42–42     Early Negro leagues were unable to attract and retain top talent due to financial, logistical and contractual difficulties. Some early dominant teams did not join a league since they could pull in larger profits independently. The early leagues were specifically structured as minor leagues. With the ": null
    },
    {
        "integration of Organized Baseball": "baseball color line"
    },
    {
        ", beginning 42 all leagues simply lost elite players to white leagues, and historians do not consider any Negro league major after 42     A number of leagues from the ": null
    },
    {
        "major-league": "major league baseball"
    },
    {
        " era are recognized as Negro minor leagues. A general rule of thumb was leagues in the ": null
    },
    {
        "north": "northern united states"
    },
    {
        " were major while leagues in the ": null
    },
    {
        "south": "southern united states"
    },
    {
        " were minor, due mainly to population and economic disparities. Below are some of the better-documented leagues:   ": null
    },
    {
        "Texas Colored League/Texas–Oklahoma–Louisiana League/Texas–Louisiana Negro League": "texas colored league"
    },
    {
        ", 4242   ": null
    },
    {
        "Negro Southern League ": "negro southern league"
    },
    {
        ", 42–42 –  ": null
    },
    {
        "Negro Southeastern League": "negro southeastern league"
    },
    {
        ", 42   ": null
    },
    {
        "Interstate League": "interstate league"
    },
    {
        ", 42 and 42   ": null
    },
    {
        "Tri State League": "tri state league"
    },
    {
        ", 42   ": null
    },
    {
        "Negro American Association": "negro american association"
    },
    {
        ", 42 and 4242   ": null
    },
    {
        "Negro Major League": "negro major league"
    },
    {
        ", 42     By default, leagues established after integration are considered minor league, as is the one of two 42s majors that continued after 42 Also at this time, leagues began to appear in the ": null
    },
    {
        "west": "western united states"
    },
    {
        ", just as in other sports, due to the ": null
    },
    {
        "post-War boom": "post–world war ii economic expansion"
    },
    {
        " and improved transportation modes. Below are some of the better-documented leagues:   ": null
    },
    {
        "Negro Southern League ": "negro southern league"
    },
    {
        ", 42–42   ": null
    },
    {
        "United States League": "united states league"
    },
    {
        ", 4242   ": null
    },
    {
        "West Coast Negro Baseball Association": "west coast negro baseball association"
    },
    {
        ", 42   ": null
    },
    {
        "East Texas Negro League": "east texas negro league"
    },
    {
        ", 42   ": null
    },
    {
        "Negro Texas League": "negro texas league"
    },
    {
        ", 42   ": null
    },
    {
        "Negro American League": "negro american league"
    },
    {
        ", 42–42 –  ": null
    },
    {
        "Arkansas–Louisiana–Texas League": "arkansas–louisiana–texas league"
    },
    {
        ", 42   ": null
    },
    {
        "Eastern Negro League": "eastern negro league"
    },
    {
        ", 42   ": null
    },
    {
        "Negro National Baseball Association": "negro national baseball association"
    },
    {
        ", 42            In his ": null
    },
    {
        "Baseball Hall of Fame": "baseball hall of fame"
    },
    {
        " induction speech in 42 ": null
    },
    {
        "Ted Williams": "ted williams"
    },
    {
        " made a strong plea for inclusion of Negro league stars in the Hall. After the publication of ": null
    },
    {
        "Robert Peterson": "robert w. peterson"
    },
    {
        "s landmark book Only the Ball was White in 42 the Hall of Fame found itself under renewed pressure to find a way to honor Negro league players who would have been in the Hall had they not been barred from the major leagues due to the color of their skin.     At first, the Hall of Fame planned a separate but equal display, which would be similar to the ": null
    },
    {
        "Ford C. Frick Award": "ford c. frick award"
    },
    {
        " for baseball commentators, in that this plan meant that the Negro league honorees would not be considered members of the Hall of Fame. This plan was criticized by the press, the fans and the players it was intended to honor, and Satchel Paige himself insisted that he would not accept anything less than full-fledged induction into the Hall of Fame. The Hall relented and agreed to admit Negro league players on an equal basis with their Major League counterparts in 42 A special Negro league committee selected ": null
    },
    {
        "Satchel Paige": "satchel paige"
    },
    {
        " in 42 followed by ": null
    },
    {
        "Cool Papa Bell": "cool papa bell"
    },
    {
        ", ": null
    },
    {
        "Oscar Charleston": "oscar charleston"
    },
    {
        ", ": null
    },
    {
        "Martín Dihigo": "martín dihigo"
    },
    {
        ", ": null
    },
    {
        "Josh Gibson": "josh gibson"
    },
    {
        ", ": null
    },
    {
        "Monte Irvin": "monte irvin"
    },
    {
        ", ": null
    },
    {
        "Judy Johnson": "judy johnson"
    },
    {
        ", ": null
    },
    {
        "Buck Leonard": "buck leonard"
    },
    {
        " and ": null
    },
    {
        "John Henry Lloyd": "john henry lloyd"
    },
    {
        ". The Veterans Committee later selected ": null
    },
    {
        "Ray Dandridge": "ray dandridge"
    },
    {
        ", as well as choosing ": null
    },
    {
        "Rube Foster": "rube foster"
    },
    {
        " on the basis of meritorious service.     Other members of the Hall who played in both the Negro leagues and Major League Baseball are ": null
    },
    {
        "Hank Aaron": "hank aaron"
    },
    {
        ", ": null
    },
    {
        "Ernie Banks": "ernie banks"
    },
    {
        ", ": null
    },
    {
        "Roy Campanella": "roy campanella"
    },
    {
        ", ": null
    },
    {
        "Larry Doby": "larry doby"
    },
    {
        ", ": null
    },
    {
        "Willie Mays": "willie mays"
    },
    {
        ", and ": null
    },
    {
        "Jackie Robinson": "jackie robinson"
    },
    {
        ". Except for Doby, their play in the Negro leagues was a minor factor in their selection: Aaron, Banks, and Mays played in Negro leagues only briefly and after the leagues had declined with the migration of many black players to the integrated minor leagues; Campanella and Robinson were selected before the Hall began considering performance in the Negro leagues.     From 42 to 42 the Hall made a renewed effort to honor luminaries from the Negro leagues, one each year. There were seven selections: ": null
    },
    {
        "Leon Day": "leon day"
    },
    {
        ", ": null
    },
    {
        "Bill Foster": "bill foster"
    },
    {
        ", ": null
    },
    {
        "Bullet Rogan": "bullet rogan"
    },
    {
        ", ": null
    },
    {
        "Hilton Smith": "hilton smith"
    },
    {
        ", ": null
    },
    {
        "Turkey Stearnes": "turkey stearnes"
    },
    {
        ", ": null
    },
    {
        "Willie Wells": "willie wells"
    },
    {
        ", and ": null
    },
    {
        "Smokey Joe Williams": "smokey joe williams"
    },
    {
        ".     In February 42 a committee of twelve baseball historians elected 42 more people from black baseball to the National Baseball Hall of Fame, twelve players and five executives.     ; Negro league players : ": null
    },
    {
        "Ray Brown": "ray brown"
    },
    {
        "; ": null
    },
    {
        "Willard Brown": "willard brown"
    },
    {
        "; ": null
    },
    {
        "Andy Cooper": "andy cooper"
    },
    {
        "; ": null
    },
    {
        "Biz Mackey": "biz mackey"
    },
    {
        "; ": null
    },
    {
        "Mule Suttles": "mule suttles"
    },
    {
        "; ": null
    },
    {
        "Cristóbal Torriente": "cristóbal torriente"
    },
    {
        "; ": null
    },
    {
        "Jud Wilson": "jud wilson"
    },
    {
        "     ; Pre-Negro league players : ": null
    },
    {
        "Frank Grant": "frank grant"
    },
    {
        "; ": null
    },
    {
        "Pete Hill": "pete hill"
    },
    {
        "; ": null
    },
    {
        "José Méndez": "josé méndez"
    },
    {
        "; ": null
    },
    {
        "Louis Santop": "louis santop"
    },
    {
        "; ": null
    },
    {
        "Ben Taylor": "ben taylor"
    },
    {
        "     ; Negro league executives : ": null
    },
    {
        "Effa Manley": "effa manley"
    },
    {
        "; ": null
    },
    {
        "Alex Pompez": "alex pompez"
    },
    {
        "; ": null
    },
    {
        "Cum Posey": "cumberland posey"
    },
    {
        "; ": null
    },
    {
        "J. L. Wilkinson": "j. l. wilkinson"
    },
    {
        "     ; Pre-Negro league executive, manager, player, and historian : ": null
    },
    {
        "Sol White": "sol white"
    },
    {
        "     Effa Manley": "effa manley"
    },
    {
        ", co-owner  and business manager of the ": null
    },
    {
        "Newark Eagles": "newark eagles"
    },
    {
        " club in ": null
    },
    {
        "Negro National League": "negro national league"
    },
    {
        ", is the first woman elected to the Baseball Hall of Fame.     The committee reviewed the careers of 42 Negro league and 42 Pre-Negro league candidates. The list of 42 had been pared from a roster of 42 candidates by a five-member screening committee in November, 42 The voting committee was chaired by ": null
    },
    {
        "Fay Vincent": "fay vincent"
    },
    {
        ", Major League Baseballs eighth Commissioner and an Honorary Director of the National Baseball Hall of Fame and Museum.       ": null
    },
    {
        "Hank Aaron": "hank aaron"
    },
    {
        " was the last Negro league player to hold a regular position in Major League Baseball.     ": null
    },
    {
        "Minnie Miñoso": "minnie miñoso"
    },
    {
        " was the last Negro league player to play in a Major League game when he appeared in two games for the Chicago White Sox in 42     ": null
    },
    {
        "Buck ONeil": "buck oneil"
    },
    {
        " was the most recent former Negro league player to appear in a professional game when he made two appearances in the Northern League All-Star Game in 42       On June 42 42 ": null
    },
    {
        "Major League Baseball": "major league baseball"
    },
    {
        " held a special draft of the surviving Negro league players to acknowledge and rectify their exclusion from the major leagues on the basis of race. The idea of the special draft was conceived by Hall of Famer ": null
    },
    {
        "Dave Winfield": "dave winfield"
    },
    {
        ". Tim Brown, , Yahoo! Sports, June 42 42 Each major league team drafted one player from the Negro leagues. ": null
    },
    {
        "Bobo Henderson": "neale henderson"
    },
    {
        ", ": null
    },
    {
        "Joe B. Scott": "joe b. scott"
    },
    {
        ", ": null
    },
    {
        "Mule Miles": "mule miles"
    },
    {
        ", ": null
    },
    {
        "Lefty Bell": "william bell jr."
    },
    {
        ", ": null
    },
    {
        "James Red Moore": "james moore"
    },
    {
        ", ": null
    },
    {
        "Mack The Knife Pride": "mack pride"
    },
    {
        " and his brother ": null
    },
    {
        "Charley Pride": "charley pride"
    },
    {
        " , were among the players selected. Also drafted, by the ": null
    },
    {
        "New York Yankees": "new york yankees"
    },
    {
        ", was ": null
    },
    {
        "Emilio Navarro": "emilio navarro"
    },
    {
        ", who, at 42 years of age at the time of the draft, was believed to be the oldest living professional ballplayer.         The ": null
    },
    {
        "Negro Leagues Baseball Museum": "negro leagues baseball museum"
    },
    {
        " is located in the ": null
    },
    {
        "42th and Vine District": "18th and vine district"
    },
    {
        " in ": null
    },
    {
        "Kansas City, Missouri": "kansas city, missouri"
    },
    {
        ".         On July 42 42 the ": null
    },
    {
        "U.S. Postal Service": "u.s. postal service"
    },
    {
        " issued": "first day of issue"
    },
    {
        " a ": null
    },
    {
        "se-tenant": "se-tenant"
    },
    {
        " pair of 42-cent U.S. ": null
    },
    {
        "commemorative": "commemorative stamp"
    },
    {
        " postage stamp": "postage stamp"
    },
    {
        "s, to honor the all-black professional baseball leagues that operated from 42 to about 42 The stamps were formally issued at the ": null
    },
    {
        "Negro Leagues Baseball Museum": "negro leagues baseball museum"
    },
    {
        ", during the celebration of the museums twentieth anniversary.   One of the stamps depicts ": null
    },
    {
        "Rube Foster": "rube foster"
    }
]