[
    {
        "In ": null
    },
    {
        "Egyptian mythology": "egyptian mythology"
    },
    {
        ", Nehebkau  was originally the explanation of the cause of binding of ": null
    },
    {
        "Ka and Ba": "egyptian soul"
    },
    {
        " after death. Thus his name, which means  brings together Ka. Since these aspects of the soul were said to bind after death, Nehebkau was said to have guarded the entrance to ": null
    },
    {
        "Duat": "duat"
    },
    {
        ", the ": null
    },
    {
        "underworld": "underworld"
    },
    {
        ".          was one of the more important glyphs in his name, and although it was technically a variation on the glyph for two arms raised in prayer, it also resembles a ": null
    },
    {
        "two-headed": "multi-headed animal"
    },
    {
        " snake": "snake"
    },
    {
        ", and so Nehebkau became depicted in ": null
    },
    {
        "art": "art"
    },
    {
        " as a snake with two heads . As a two-headed snake, he was viewed as fierce, being able to attack from two directions, and not having to fear as much confrontations. Consequently, sometimes it was said that ": null
    },
    {
        "Atum": "atum"
    },
    {
        ", the chief god in these areas, had to keep his finger on him to prevent Nehebkau from getting out of control. Alternatively, in areas where ": null
    },
    {
        "Ra": "ra"
    },
    {
        " was the chief god, it was said that Nehebkau was one of the warriors who protected Ra whilst he was in the underworld, during Ras nightly travel, as a sun god, under the earth.     When he was seen as a snake, he was also thought to have some power over snake-bites, and by extension, other venomous bites, such as those of ": null
    },
    {
        "scorpion": "scorpion"
    },
    {
        "s, thus sometimes being identified as the son of ": null
    },
    {
        "Serket": "serket"
    },
    {
        ", the scorpion-goddess of protection against these things. Alternatively, as a snake, since he was connected to an aspect of the soul, he was sometimes seen as the son of ": null
    },
    {
        "Renenutet": "renenutet"
    },
    {
        ", a snake-goddess, who distributed the  Ren , another aspect of the soul, and of the earth , on which snakes crawl.     Ka is also the ": null
    },
    {
        "Egyptian word": "egyptian language"
    },
    {
        " for ": null
    },
    {
        "sustenance": "sustenance"
    },
    {
        ", and is associated with spirit.                                    ": null
    },
    {
        "ca:Llista de personatges de la mitologia egípciaN": "ca:llista de personatges de la mitologia egípcian"
    }
]