[
    {
        "            Neil Gordon Kinnock, Baron Kinnock,  is a British ": null
    },
    {
        "Labour Party": "Labour Party"
    },
    {
        " politician. He served as a ": null
    },
    {
        "Member of Parliament": "Member Of Parliament"
    },
    {
        " from ": null
    },
    {
        "1970": "1970 United Kingdom General Election"
    },
    {
        " until ": null
    },
    {
        "1995": "1995 Islwyn By-Election"
    },
    {
        ", first for ": null
    },
    {
        "Bedwellty": "Bedwellty"
    },
    {
        " and then for ": null
    },
    {
        "Islwyn": "Islwyn"
    },
    {
        ". He was the ": null
    },
    {
        "Leader of the Labour Party": "Leader Of The Labour Party"
    },
    {
        " and ": null
    },
    {
        "Leader of the Opposition": "Leader Of The Opposition"
    },
    {
        " from ": null
    },
    {
        "1983": "1983 Labour Party  Leadership Election"
    },
    {
        " until ": null
    },
    {
        "1992": "1992 Labour Party  Leadership Election"
    },
    {
        ".     Kinnock led the Labour Party to a surprise fourth consecutive defeat at the ": null
    },
    {
        "1992 general election": "1992 United Kingdom General Election"
    },
    {
        ", despite the party being ahead in most opinion polls, which had predicted either a narrow Labour victory or a ": null
    },
    {
        "hung parliament": "Hung Parliament"
    },
    {
        ". Afterwards, he resigned as Leader of the Labour Party. He left the ": null
    },
    {
        "House of Commons": "House Of Commons Of The United Kingdom"
    },
    {
        " in 1995 to become a ": null
    },
    {
        "European Commissioner": "European Commissioner"
    },
    {
        ". He went on to become the ": null
    },
    {
        "Vice-President of the European Commission": "Vice-President Of The European Commission"
    },
    {
        " under ": null
    },
    {
        "Romano Prodi": "Romano Prodi"
    },
    {
        " from 1999–2004.     Until the summer of 2009, he was also the ": null
    },
    {
        "Chairman of the British Council": "British Council"
    },
    {
        " and the ": null
    },
    {
        "President of Cardiff University": "Cardiff University"
    },
    {
        ".        Kinnock, an only child, was born in ": null
    },
    {
        "Tredegar": "Tredegar"
    },
    {
        ", ": null
    },
    {
        "Wales": "Wales"
    },
    {
        ".  His father, Gordon Herbert Kinnock was a former ": null
    },
    {
        "coal miner": "Coal Miner"
    },
    {
        " who suffered from ": null
    },
    {
        "dermatitis": "Dermatitis"
    },
    {
        " and later worked as a labourer; and his mother Mary Kinnock was a district nurse.    Gordon died of a ": null
    },
    {
        "heart attack": "Heart Attack"
    },
    {
        " in November 1971 aged 64;  Mary died the following month aged 61.     In 1953, at eleven years old, Kinnock began his ": null
    },
    {
        "secondary education": "Secondary Education"
    },
    {
        " at ": null
    },
    {
        "Lewis School, Pengam": "Lewis School, Pengam"
    },
    {
        ", which he later criticised for its record on ": null
    },
    {
        "caning": "School Corporal Punishment"
    },
    {
        ". He went on to the ": null
    },
    {
        "University College of South Wales and Monmouthshire": "University College Of South Wales And Monmouthshire"
    },
    {
        " in Cardiff , where he graduated with a degree in Industrial Relations and History in 1965. The following year, Kinnock obtained a postgraduate diploma in education. Between August 1966 and May 1970, he worked as a tutor for a ": null
    },
    {
        "Workers Educational Association": "Workers Educational Association"
    },
    {
        " .      He has been married to ": null
    },
    {
        "Glenys Kinnock": "Glenys Kinnock, Baroness Kinnock Of Holyhead"
    },
    {
        " since 1967. They have two children – son ": null
    },
    {
        "Stephen Kinnock": "Stephen Kinnock"
    },
    {
        " , and daughter Rachel Kinnock . , Sunday Mirror, 22 July 2001.       In June 1969, he won the Labour Party nomination for ": null
    },
    {
        "Bedwellty": "Bedwellty"
    },
    {
        " in ": null
    },
    {
        "South Wales": "South Wales"
    },
    {
        ", which became ": null
    },
    {
        "Islwyn": "Islwyn"
    },
    {
        " for the ": null
    },
    {
        "1983 general election": "1983 United Kingdom General Election"
    },
    {
        ".     He was first elected to the ": null
    },
    {
        "House of Commons": "British House Of Commons"
    },
    {
        " on 18 June 1970, and became a member of the ": null
    },
    {
        "National Executive Committee of the Labour Party": "National Executive Committee Of The Labour Party"
    },
    {
        " in October 1978. On his becoming an MP for the first time, his father said Remember Neil, MP stands not just for Member of Parliament, but also for Man of Principle.     The Labour government policy at that time was in favour of ": null
    },
    {
        "devolution for Wales": "Devolution For Wales"
    },
    {
        ", but the wider party was split. Calling himself a ": null
    },
    {
        "unionist": "British Unionism"
    },
    {
        " , Kinnock was one of six ": null
    },
    {
        "south Wales": "South Wales"
    },
    {
        " Labour MPs to campaign against devolution. He dismissed the idea of a ": null
    },
    {
        "Welsh identity": "Welsh Identity"
    },
    {
        ", saying that between the mid-sixteenth century and the mid-eighteenth century Wales had practically no history at all, and even before that it was the history of rural brigands who have been ennobled by being called princes .  In the ": null
    },
    {
        "Welsh referendum of 1979": "1979 Welsh Devolution Referendum"
    },
    {
        ", the proposal for devolution was rejected.     Following Labours defeat at the ": null
    },
    {
        "1979 general election": "1979 United Kingdom General Election"
    },
    {
        ", ": null
    },
    {
        "James Callaghan": "James Callaghan"
    },
    {
        " appointed Neil Kinnock to the ": null
    },
    {
        "Shadow Cabinet": "Shadow Cabinet"
    },
    {
        " as Education spokesman. His ambition was noted by other MPs, and ": null
    },
    {
        "David Owens": "David Owen"
    },
    {
        "opposition to the changes to the ": null
    },
    {
        "electoral college": "Electoral College"
    },
    {
        " was thought to be motivated by the realisation that they would favour Kinnocks succession. He remained as Education spokesman following the resignation of Callaghan as Leader of the Labour Party and the election of ": null
    },
    {
        "Michael Foot": "Michael Foot"
    },
    {
        " as his successor in late 1980.     In 1981, when still serving as Labours Education spokesman, Kinnock was alleged to have effectively scuppered ": null
    },
    {
        "Tony Benns": "Tony Benn"
    },
    {
        "attempt to replace ": null
    },
    {
        "Denis Healey": "Denis Healey"
    },
    {
        " as Labours Deputy Leader by first supporting the candidacy of the more traditionalist Tribunite ": null
    },
    {
        "John Silkin": "John Silkin"
    },
    {
        " and then urging Silkin supporters to abstain on the second, run-off, ballot.     He was known as a ": null
    },
    {
        "left-winger": "Left-Wing Politics"
    },
    {
        ", and gained prominence for his attacks on ": null
    },
    {
        "Margaret Thatchers": "Margaret Thatcher"
    },
    {
        "handling of the ": null
    },
    {
        "Falklands War": "Falklands War"
    },
    {
        " in 1982, although it was in fact this conflict which saw support for the ": null
    },
    {
        "Conservative": "Conservative Party"
    },
    {
        " government increase, and contribute to its landslide re-election the following year.                   Following Labours landslide defeat in ": null
    },
    {
        "June 1983": "1983 United Kingdom General Election"
    },
    {
        ", ": null
    },
    {
        "Michael Foot": "Michael Foot"
    },
    {
        " resigned as leader aged 69, and from the outset it was expected that the much younger Kinnock would succeed him. He was finally ": null
    },
    {
        "elected as Labour Party leader": "1983 Labour Party Leadership Election"
    },
    {
        " on 2 October 1983, with 71 per cent of the vote, and ": null
    },
    {
        "Roy Hattersley": "Roy Hattersley"
    },
    {
        " was elected as his deputy; their prospective partnership was considered to be a dream ticket .      His first period as party leader – between the ": null
    },
    {
        "1983": "1983 United Kingdom General Election"
    },
    {
        " and ": null
    },
    {
        "1987 general elections": "1987 United Kingdom General Election"
    },
    {
        " – was dominated by his struggle with the ": null
    },
    {
        "hard-left": "Hard-Left"
    },
    {
        " Militant tendency": "Militant"
    },
    {
        ", then still strong in the party. Kinnock was determined to move the partys political standing to a ": null
    },
    {
        "centrist": "Centrist"
    },
    {
        " position, in order to improve its chances of winning a future general election. , BBC Politics 97 Although Kinnock had come from the ": null
    },
    {
        "Tribune": "Tribune Group"
    },
    {
        " left": "Left-Wing Politics"
    },
    {
        " of the party, he parted company with many of his former allies after his appointment to the Shadow Cabinet.     The Labour Party was also threatened by the rise of the ": null
    },
    {
        "Social Democratic Party": "Social Democratic Party"
    },
    {
        "/": null
    },
    {
        "Liberal Alliance": "Sdp-Liberal Alliance"
    },
    {
        ", which pulled out more centrist adherents. On a broader perspective, the traditional Labour voter was disappearing in the face of growing education, wealth, and social mobility that the Conservative government had promoted since 1979. Kinnock focused on modernising the party, and upgrading its technical skills such as use of the media and keeping track of voters, while at the same time battling the Militants. Under his leadership, the Labour Party abandoned unpopular old positions, especially the ": null
    },
    {
        "nationalisation": "Nationalisation"
    },
    {
        " of certain industries, although this process was not completed until future Labour leader ": null
    },
    {
        "Tony Blair": "Tony Blair"
    },
    {
        " removed Clause IV from the partys manifesto in 1995. He stressed economic growth, which had a much broader appeal to the ": null
    },
    {
        "middle-class": "Middle-Class"
    },
    {
        " than the idea of redistributing wealth to benefit the poor. He accepted membership in the ": null
    },
    {
        "European Economic Community": "European Economic Community"
    },
    {
        ", whereas the party had pledged immediate withdrawal from it under ": null
    },
    {
        "Michael Foot": "Michael Foot"
    },
    {
        ". He discarded the rhetoric of class warfare. F.M. Leventhal, ed., Twentieth-century Britain: an encyclopedia p 424.     All this meant that Kinnock had made plenty of enemies on the left wing of the party by the time he was elected as leader, though a substantial number of former Bennites gave him strong support. He was almost immediately in serious difficulty as a result of ": null
    },
    {
        "Arthur Scargills": "Arthur Scargill"
    },
    {
        "decision to lead his union, the ": null
    },
    {
        "National Union of Mineworkers": "National Union Of Mineworkers"
    },
    {
        " into a national strike without a nationwide ballot. The NUM was widely regarded as the labour movements ": null
    },
    {
        "praetorian guard": "Praetorian Guard"
    },
    {
        " and the strike convulsed the Labour movement. Kinnock supported the aim of the strike – which he dubbed the case for coal – but, as an MP from a mining area, was bitterly critical of the tactics employed. When heckled at a Labour Party rally for referring to the ": null
    },
    {
        "killing of David Wilkie": "Killing Of David Wilkie"
    },
    {
        " as an outrage , Kinnock lost his temper and accused the hecklers of living like parasites off the struggle of the miners and implied that Scargill had lied to the striking miners.  In 1985, he made his criticisms public in a speech to Labours conference:     In 2004, Kinnock said of Scargill, Oh I detest him. I did then, I do now, and its mutual. He hates me as well. And Id much prefer to have his savage hatred than even the merest hint of friendship from that man.      The strikes defeat early in the year,  and the bad publicity associated with the ": null
    },
    {
        "entryism": "Entryism"
    },
    {
        " practised by the Trotskyist ": null
    },
    {
        "Militant": "Militant"
    },
    {
        " group were the immediate context for the 1985 Labour Party conference. For a history of the Militant tendency in the Labour Party, see Eric Shaw Discipline and Discord in the Labour Party: The Politics of Managerial Control in the Labour Party, 1951–87, Manchester: Manchester University Press, 1988, p.218-90 and Michael Crick The March of Militant, London: Faber, 1986 Earlier in the year left-wing councils had ": null
    },
    {
        "protested at Government restriction of their budgets": "Rate-Capping Rebellion"
    },
    {
        " by refusing to set budgets, resulting in a budget crisis in the Militant-dominated ": null
    },
    {
        "Liverpool City Council": "Liverpool City Council"
    },
    {
        ". Kinnock attacked Militant and their conduct in a speech delivered at the conference:        One Liverpool MP, ": null
    },
    {
        "Eric Heffer": "Eric Heffer"
    },
    {
        ", a member of the NEC left the conference stage in disgust at Kinnocks comments.  In June 1986, the Labour Party finally expelled the deputy leader of Liverpool council, the high-profile Militant supporter ": null
    },
    {
        "Derek Hatton": "Derek Hatton"
    },
    {
        ", who was found guilty of manipulating the rules of the district Labour party . , BBC On This Day, 12 June By 1986, the partys position appeared to strengthen further with excellent local election results and a thorough ": null
    },
    {
        "rebranding": "Rebranding"
    },
    {
        " of the party under the direction of Kinnocks director of communications ": null
    },
    {
        "Peter Mandelson": "Peter Mandelson"
    },
    {
        ", as well as seizing the ": null
    },
    {
        "Fulham": "Fulham"
    },
    {
        " seat in ": null
    },
    {
        "West London": "West London"
    },
    {
        " from the Conservatives in an April by-election.  Labour, now sporting a continental ": null
    },
    {
        "social democratic": "Social Democracy"
    },
    {
        " style emblem of a ": null
    },
    {
        "rose": "Rose"
    },
    {
        " , appeared to be able to run the governing ": null
    },
    {
        "Conservatives": "Conservative Party"
    },
    {
        " close, but ": null
    },
    {
        "Margaret Thatcher": "Margaret Thatcher"
    },
    {
        " did not let Labours makeover go unchallenged.     The Conservatives 1986 conference was well-managed, and effectively relaunched the Conservatives as a party of radical ": null
    },
    {
        "free-market": "Free-Market"
    },
    {
        " economic liberalism": "Economic Liberalism"
    },
    {
        ". Labour suffered from a persistent image of extremism, especially as Kinnocks campaign to root out Militant dragged on as figures on the ": null
    },
    {
        "hard left": "Hard Left"
    },
    {
        " of the party tried to stop its progress. Opinion polls showed that voters favoured retaining the ": null
    },
    {
        "United Kingdoms nuclear weapons": "Nuclear Weapons And The United Kingdom"
    },
    {
        ", , and believed that the Conservatives would be better than Labour at defending the country. Anthony King , British Political Opinion, 1937–2000: The Gallup Polls , pp. 105–7.       In early 1987, Labour lost a by-election in Greenwich to the ": null
    },
    {
        "SDPs": "Social Democratic Party"
    },
    {
        " Rosie Barnes": "Rosie Barnes"
    },
    {
        ". As a result, Labour faced the ": null
    },
    {
        "1987 general election": "1987 United Kingdom General Election"
    },
    {
        " in some danger of finishing third in the popular vote, with the Conservatives once again expected to secure a comfortable victory. In secret, Labours aim was to secure second place in order to remain as ": null
    },
    {
        "Official Opposition": "Official Opposition"
    },
    {
        ".      Mandelson and his team had revolutionised Labours communications – a transformation symbolised by a ": null
    },
    {
        "party election broadcast": "Party Election Broadcast"
    },
    {
        " popularly known as Kinnock: The Movie .  This was directed by ": null
    },
    {
        "Hugh Hudson": "Hugh Hudson"
    },
    {
        " and featured Kinnocks 1985 conference speech, and shots of him and his wife Glenys walking on the ": null
    },
    {
        "Great Orme": "Great Orme"
    },
    {
        " in ": null
    },
    {
        "Llandudno": "Llandudno"
    },
    {
        " , and a speech to that years ": null
    },
    {
        "Welsh Labour Party": "Welsh Labour Party"
    },
    {
        " conference asking why he was the first Kinnock in a thousand generations to go to ": null
    },
    {
        "university": "University"
    },
    {
        ".     On polling day, Labour easily took second place, but with only a 31% share of the vote to the SDP-Liberal Alliances 22%.  Labour was still more than ten percentage points behind the Conservatives, who retained a three-figure majority in the ": null
    },
    {
        "House of Commons": "House Of Commons Of The United Kingdom"
    },
    {
        ". However, the Conservative governments majority had come down from 144 seats in 1983 to 102.  Significantly, Labour had gained twenty seats at the election.      Labour won extra seats in ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        ", ": null
    },
    {
        "Wales": "Wales"
    },
    {
        " and ": null
    },
    {
        "Northern England": "Northern England"
    },
    {
        ", but lost ground particularly in ": null
    },
    {
        "Southern England": "Southern England"
    },
    {
        " and ": null
    },
    {
        "London": "London"
    },
    {
        ", where the Conservatives still dominated. The Conservatives also regained the Fulham seat which it had lost to Labour at a by-election just over a year earlier.            A few months after the general election, Kinnock gained brief attention in the ": null
    },
    {
        "United States": "United States"
    },
    {
        " in August 1987 when it was discovered that then-US Senator ": null
    },
    {
        "Joe Biden": "Joe Biden"
    },
    {
        " for ": null
    },
    {
        "Delaware": "Delaware"
    },
    {
        "  plagiarised one of Kinnocks speeches during ": null
    },
    {
        "his 1988 presidential campaign": "Joe Biden Presidential Campaign, 1988"
    },
    {
        " in a speech at a ": null
    },
    {
        "Democratic Party": "Democratic Party"
    },
    {
        " debate in ": null
    },
    {
        "Iowa": "Iowa"
    },
    {
        ".  This led to Bidens withdrawal of his presidential campaign.      The second period of Kinnocks leadership was dominated by his drive to reform the partys policies to gain office. This began with an exercise dubbed the ": null
    },
    {
        "policy review": "Policy Review"
    },
    {
        ", the most high-profile aspect of which was a series of consultations with the public known as ": null
    },
    {
        "Labour Listens": "Labour Listens"
    },
    {
        " in the autumn of 1987.      After Labour Listens, the party went on, in 1988, to produce a new statement of aims and values—meant to supplement and supplant the formulation of ": null
    },
    {
        "Clause IV": "Clause Iv"
    },
    {
        " of the partys constitution  and was closely modelled on ": null
    },
    {
        "Anthony Croslands": "Anthony Crosland"
    },
    {
        "social-democratic thinking—emphasising equality rather than ": null
    },
    {
        "public ownership": "State Ownership"
    },
    {
        ". At the same time, the Labour Partys commitment to unilateral nuclear disarmament was dropped, and reforms of Party Conference and the National Executive meant that local parties lost much of their ability to influence policy.     In 1988, ": null
    },
    {
        "Kinnock was challenged": "1988 Labour Party Leadership Election"
    },
    {
        " by ": null
    },
    {
        "Tony Benn": "Tony Benn"
    },
    {
        " for the party leadership. Later many identified this as a particularly low period in Kinnocks leadership — as he appeared mired in internal battles after five years of leadership with the Conservatives still dominating the scene, and being ahead in the opinion polls. In the end, though, Kinnock won a decisive victory over Benn and would soon enjoy a substantial rise in support.      The policy review — reporting in 1989 —coincided with Labours move ahead in the polls as the ": null
    },
    {
        "poll tax": "Poll Tax"
    },
    {
        " row was destroying Conservative support, and Labour won big victories in local council elections as well as several parliamentary by-elections during 1989 and 1990. Labour overtook the Conservatives at the ": null
    },
    {
        "1989 European elections": "1989 European Parliament Election In The United Kingdom"
    },
    {
        ", winning 40% of the vote; the first time Labour had finished in first place at a national election in fifteen years.     In December 1989, he abandoned the Labour policy on ": null
    },
    {
        "closed shop": "Closed Shop"
    },
    {
        "s—a decision seen by many as a move away from traditional ": null
    },
    {
        "socialist": "Socialist"
    },
    {
        " policies to a more European-wide agenda, and also a move to rid the party of its image of being run by ": null
    },
    {
        "trade unions": "Trade Unions"
    },
    {
        ".      Kinnock was also perceived as scoring in debates over ": null
    },
    {
        "Margaret Thatcher": "Margaret Thatcher"
    },
    {
        " in the ": null
    },
    {
        "Commons": "British House Of Commons"
    },
    {
        "—previously an area in which he was seen as weak—and finally ": null
    },
    {
        "Michael Heseltine": "Michael Heseltine"
    },
    {
        " challenged Thatchers leadership and she resigned on 28 November 1990 to be succeeded by then-": null
    },
    {
        "Chancellor of the Exchequer": "Chancellor Of The Exchequer"
    },
    {
        ", ": null
    },
    {
        "John Major": "John Major"
    },
    {
        ". Kinnock greeted Thatchers resignation by describing it as very good news and demanded an immediate general election.      Public reaction to Majors elevation was highly positive. A new ": null
    },
    {
        "Prime Minister": "Prime Minister Of The United Kingdom"
    },
    {
        " and the fact that Kinnock was now the longest-serving current leader of a major party reduced the impact of calls for Time for a Change . Neil Kinnocks showing in the opinion polls dipped; before Thatchers resignation, Labour had been up to 10 points ahead of the Conservatives in the opinion polls , but many opinion polls were actually showing the Conservatives with a higher amount of support than Labour, in spite of the ": null
    },
    {
        "deepening recession": "Early 1990S Recession"
    },
    {
        ".      By now Militant had finally been routed in the party, and their two MPs were expelled at the end of 1991, in addition to a number of supporters. The majority in the group were now disenchanted with entryism, and choose to function outside Labours ranks, forming the ": null
    },
    {
        "Socialist Party": "Socialist Party"
    },
    {
        ".       In the three years leading up to the ": null
    },
    {
        "1992 general election": "1992 United Kingdom General Election"
    },
    {
        ", Labour had consistently topped the opinion polls, with 1991 seeing the Conservatives  snatch the lead off Labour more than once before Labour regained it. The rise in Conservative support came in spite of the economic recession and sharp rise in unemployment which affected Britain in 1991.  Since Majors election as ": null
    },
    {
        "Leader of the Conservative Party": "Leader Of The Conservative Party"
    },
    {
        " , Kinnock had spent the end of 1990  and most of 1991 putting pressure on Major to call a general election that year, but Major had held out and by the autumn he had insisted that there would be no general election in 1991.     Labour had gained four seats from the Conservatives in by-elections since the ": null
    },
    {
        "1987 general election": "1987 United Kingdom General Election"
    },
    {
        ", having initially suffered disappointing results in some by-elections, namely a loss of the ": null
    },
    {
        "Govan": "Govan"
    },
    {
        " constituency in ": null
    },
    {
        "Glasgow": "Glasgow"
    },
    {
        " to the ": null
    },
    {
        "Scottish National Party": "Scottish National Party"
    },
    {
        " in November 1988. However, by the end of 1991, the Conservative majority still stood at 88 seats and Labour needed to win more than ninety new seats to gain an overall majority, although there was still the hope of forming a minority or ": null
    },
    {
        "coalition government": "Coalition Government"
    },
    {
        " if Labour failed to win a majority.     In the run-up to the election, held on 9 April 1992, most opinion polls had suggested that the election would result in either a ": null
    },
    {
        "hung parliament": "Hung Parliament"
    },
    {
        " or a narrow Labour majority.      At the ": null
    },
    {
        "1992 general election": "1992 United Kingdom General Election"
    },
    {
        ", Labour made considerable progress – reducing the Conservatives majority to just 21 seats. It came as a shock to many when the Conservatives won a majority, but the triumphalism perceived by some observers of a Labour Party ": null
    },
    {
        "rally in Sheffield": "Sheffield Rally"
    },
    {
        " may have helped put floating voters off. , BBC News, Politics 97 Although internal polls suggested no impact, while public polls suggested a decline in support had already occurred,  most of those directly involved in the campaign believe that the rally really came to widespread attention only after the electoral defeat itself,  with Kinnock himself changing his mind to a rejection of its negative impact over time. Compare Michael Leapman , The Independent, 26 November 1995 with Alyssa McDonald , New Statesman, 29 April 2010     On the day of the general election,  The Sun  newspaper ran a front page featuring Kinnock with the headline If Kinnock wins today will the last person to leave Britain please turn out the lights .  Kinnock blamed the newspaper in his ": null
    },
    {
        "resignation speech": "Resignation Speech"
    },
    {
        " for Labour losing the election, along with other ": null
    },
    {
        "right-wing": "Right-Wing Politics"
    },
    {
        " media sections who had backed the Conservatives in the run-up to the election.  The following days headline in The Sun was ": null
    },
    {
        "Its The Sun Wot Won It": "Its The Sun Wot Won It"
    },
    {
        " , which ": null
    },
    {
        "Rupert Murdoch": "Rupert Murdoch"
    },
    {
        ", many years later at his April 2012 appearance before the ": null
    },
    {
        "Leveson Inquiry": "Leveson Inquiry"
    },
    {
        ", stated was both tasteless and wrong and led to the editor ": null
    },
    {
        "Kelvin MacKenzie": "Kelvin Mackenzie"
    },
    {
        " receiving a reprimand.     The Labour-supporting  Daily Mirror  had backed Kinnock for the 1987 general election  and again in 1992.  Less expected was the  Financial Times  backing Kinnock at the 1992 general election.        Kinnock himself later claimed to have half-expected his defeat at the 1992 general election and proceeded to turn himself into a media personality, even hosting a chat show on ": null
    },
    {
        "BBC Wales": "Bbc Wales"
    },
    {
        " and twice appearing on the topical panel show  Have I Got News for You  within a year of the defeat. Many years later, he returned to appear as a guest host of the programme.     Kinnock announced his resignation as Labour Party leader on 13 April 1992, ending nearly a decade in the role. ": null
    },
    {
        "John Smith": "John Smith"
    },
    {
        ", previously Shadow Chancellor, ": null
    },
    {
        "was elected": "1992 Labour Party  Leadership Election"
    },
    {
        " on 18 July as his successor.      He remains on the Advisory Council of the ": null
    },
    {
        "Institute for Public Policy Research": "Institute For Public Policy Research"
    },
    {
        ", which he helped set up in the 1980s.     He was an enthusiastic supporter of ": null
    },
    {
        "Ed Milibands": "Ed Miliband"
    },
    {
        "campaign for leadership of the Labour Party in 2010, and was reported as telling activists, when Miliband won, Weve got our party back – although Miliband, like Kinnock, failed to lead the party back into government, and resigned after the Conservatives were re-elected with a slim majority in ": null
    },
    {
        "2015": "2015 United Kingdom General Election"
    },
    {
        ".      In 2011, he participated in the family history TV programme  Coming Home  where he discovered hitherto unknown information about his family.             Kinnock was appointed one of the UKs two members of the ": null
    },
    {
        "European Commission": "European Commission"
    },
    {
        ", which he served first as Transport Commissioner under President ": null
    },
    {
        "Jacques Santer": "Jacques Santer"
    },
    {
        ", in early 1995; marking the end of his 25 years in the House of Commons.  This came less than a year after the death of his successor, ": null
    },
    {
        "John Smith": "John Smith"
    },
    {
        " and the election of ": null
    },
    {
        "Tony Blair": "Tony Blair"
    },
    {
        " as the partys new leader.      He was obliged to resign as part of the forced, collective ": null
    },
    {
        "resignation of the Commission": "Santer Commissionresignation"
    },
    {
        " in 1999. He was re-appointed to the Commission under new President ": null
    },
    {
        "Romano Prodi": "Romano Prodi"
    },
    {
        ". He now became one of the Vice-Presidents of the European Commission, with responsibility for Administrative Reform and the Audit, Linguistics and Logistics Directorates General.  /ref  ref  /ref ref  /ref ref  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref nameagnostic1  /ref  ref nameatheist1  /ref ref nameatheist2  /ref  ref ": null
    }
]