[
    {
        "            Neil Richard MacKinnon Gaiman Born as Neil Richard Gaiman, with MacKinnon added on the occasion of his marriage to ": null
    },
    {
        "Amanda Palmer": "Amanda Palmer"
    },
    {
        ".    is an English author of short fiction, novels, comic books, ": null
    },
    {
        "graphic novel": "Graphic Novel"
    },
    {
        "s, nonfiction, audio theatre, and films. His works include the comic book series  The Sandman  and novels  Stardust ,  American Gods ,  Coraline , and  The Graveyard Book . He has won numerous awards, including the ": null
    },
    {
        "Hugo": "Hugo Award"
    },
    {
        ", ": null
    },
    {
        "Nebula": "Nebula Award"
    },
    {
        ", and ": null
    },
    {
        "Bram Stoker": "Bram Stoker Award"
    },
    {
        " awards, as well as the ": null
    },
    {
        "Newbery": "Newbery Medal"
    },
    {
        " and ": null
    },
    {
        "Carnegie": "Carnegie Medal"
    },
    {
        " medals. He is the first author to win both the Newbery and the Carnegie medals for the same work, The Graveyard Book . In 2013,  The Ocean at the End of the Lane  was voted Book of the Year in the British ": null
    },
    {
        "National Book Awards": "Specsavers National Book Awards"
    },
    {
        ".        Gaimans family is of Polish Jewish and other Eastern European Jewish origins.  His great-grandfather emigrated from ": null
    },
    {
        "Antwerp": "Antwerp"
    },
    {
        ", Belgium, to the UK before 1914  and his grandfather eventually settled in the south of England in the ": null
    },
    {
        "Hampshire": "Hampshire"
    },
    {
        " city of ": null
    },
    {
        "Portsmouth": "Portsmouth"
    },
    {
        " and established a chain of grocery stores. Gaimans grandfather changed his original family name of Chaiman to Gaiman.  His father, ": null
    },
    {
        "David Bernard Gaiman": "David Gaiman"
    },
    {
        ", worked in the same chain of stores;  his mother, Sheila Gaiman , was a pharmacist. He has two younger sisters, Claire and Lizzy.      After living for a period in the nearby town of ": null
    },
    {
        "Portchester": "Portchester"
    },
    {
        ", Hampshire, where Neil was born in 1960, the Gaimans moved in 1965 to the ": null
    },
    {
        "West Sussex": "West Sussex"
    },
    {
        " town of ": null
    },
    {
        "East Grinstead": "East Grinstead"
    },
    {
        ", where his parents studied ": null
    },
    {
        "Dianetics": "Dianetics"
    },
    {
        " at the ": null
    },
    {
        "Scientology centre": "Saint Hill Manor"
    },
    {
        " in the town; one of Gaimans sisters works for the Church of Scientology in Los Angeles. His other sister, Lizzy Calcioli, has said, Most of our social activities were involved with Scientology or our Jewish family. It would get very confusing when people would ask my religion as a kid. Id say, Im a Jewish Scientologist. Gaiman says that he is not a Scientologist, and that like Judaism, Scientology is his familys religion.  About his personal views, Gaiman has stated, I think we can say that God exists in the DC Universe. I would not stand up and beat the drum for the existence of God in this universe. I dont know, I think theres probably a 50/50 chance. It doesnt really matter to me.      Gaiman was able to read at the age of four. He said, I was a reader. I loved reading. Reading things gave me pleasure. I was very good at most subjects in school, not because I had any particular aptitude in them, but because normally on the first day of school theyd hand out schoolbooks, and Id read them—which would mean that Id know what was coming up, because Id read it.  When he was about ten years old, he read his way through the works of ": null
    },
    {
        "Dennis Wheatley": "Dennis Wheatley"
    },
    {
        ", where especially The Ka of Gifford Hillary and The Haunting of Toby Jugg made an impact on him.  One work that made a particular impression on him was ": null
    },
    {
        "J. R. R. Tolkiens": "J. R. R. Tolkien"
    },
    {
        "  The Lord of the Rings  from his school library, although it only had the first two volumes of the novel. He consistently took them out and read them. He would later win the school English prize and the school reading prize, enabling him to finally acquire the third volume.     For his seventh birthday, Gaiman received ": null
    },
    {
        "C. S. Lewiss": "C. S. Lewis"
    },
    {
        "  The Chronicles of Narnia  series. He later recalled that I admired his use of parenthetical statements to the reader, where he would just talk to you ... Id think, Oh, my gosh, that is so cool! I want to do that! When I become an author, I want to be able to do things in parentheses. I liked the power of putting things in brackets. Narnia also introduced him to literary awards, specifically the 1956 ": null
    },
    {
        "Carnegie Medal": "Carnegie Medal"
    },
    {
        " won by the concluding volume. When Gaiman won the 2010 Medal himself, the press reported him recalling, it had to be the most important literary award there ever was and observing, if you can make yourself aged seven happy, youre really doing well – its like writing a letter to yourself aged seven.      ": null
    },
    {
        "Lewis Carrolls": "Lewis Carroll"
    },
    {
        "  Alices Adventures in Wonderland  was another childhood favourite, and a favourite forever. Alice was default reading to the point where I knew it by heart. He also enjoyed ": null
    },
    {
        "Batman": "Batman"
    },
    {
        " comics as a child.     Gaiman was educated at several ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        " schools, including Fonthill School in East Grinstead, ": null
    },
    {
        "Ardingly College": "Ardingly College"
    },
    {
        " , and ": null
    },
    {
        "Whitgift School": "Whitgift School"
    },
    {
        " in ": null
    },
    {
        "Croydon": "Croydon"
    },
    {
        " .  His fathers position as a public relations official of the ": null
    },
    {
        "Church of Scientology": "Church Of Scientology"
    },
    {
        " was the cause of the seven-year-old Gaiman being forced to withdraw from Fonthill School and remain at the school that he had previously been attending.  He lived in East Grinstead for many years, from 1965 to 1980 and again from 1984 to 1987.  He met his first wife, Mary McGrath, while she was studying Scientology and living in a house in East Grinstead that was owned by his father. The couple were married in 1985 after having their first child, Michael.              As a child and a teenager, Gaiman read the works of ": null
    },
    {
        "C. S. Lewis": "C. S. Lewis"
    },
    {
        ", ": null
    },
    {
        "J. R. R. Tolkien": "J. R. R. Tolkien"
    },
    {
        ", ": null
    },
    {
        "Lewis Carroll": "Lewis Carroll"
    },
    {
        ", ": null
    },
    {
        "Mary Shelley": "Mary Shelley"
    },
    {
        ", ": null
    },
    {
        "Rudyard Kipling": "Rudyard Kipling"
    },
    {
        ", ": null
    },
    {
        "Edgar Allan Poe": "Edgar Allan Poe"
    },
    {
        ", ": null
    },
    {
        "Michael Moorcock": "Michael Moorcock"
    },
    {
        ", ": null
    },
    {
        "Alan Moore": "Alan Moore"
    },
    {
        ", ": null
    },
    {
        "Steve Ditko": "Steve Ditko"
    },
    {
        ",  ": null
    },
    {
        "Will Eisner": "Will Eisner"
    },
    {
        ",  ": null
    },
    {
        "Ursula K. Le Guin": "Ursula K. Le Guin"
    },
    {
        ", ": null
    },
    {
        "Harlan Ellison": "Harlan Ellison"
    },
    {
        ", ": null
    },
    {
        "Lord Dunsany": "Lord Dunsany"
    },
    {
        " and ": null
    },
    {
        "G. K. Chesterton": "G. K. Chesterton"
    },
    {
        ". Abbey p. 68  A lifetime fan of the ": null
    },
    {
        "Monty Python": "Monty Python"
    },
    {
        " comedy troupe, as a teenager he owned a copy of  Monty Pythons Big Red Book .  When he was 19–20 years old, he contacted his favourite science fiction writer, ": null
    },
    {
        "R. A. Lafferty": "R. A. Lafferty"
    },
    {
        ", whom he discovered when he was nine, and asked for advice on becoming an author along with a Lafferty ": null
    },
    {
        "pastiche": "Pastiche"
    },
    {
        " he had written. The writer sent Gaiman an encouraging and informative letter back, along with literary advice.       Gaiman has said ": null
    },
    {
        "Roger Zelazny": "Roger Zelazny"
    },
    {
        " was the author who influenced him the most, Of Meetings and Partings by Neil Gaiman, introduction to This Mortal Mountain: Volume 3 of The Collected Stories of Roger Zelazny, NESFA Press, edited by David G. Grubbs, Christopher S. Kovacs, and Ann Crimmins, 2009, page 12. with this influence particularly seen in Gaimans literary style and the topics he writes about.  by Jo Walton, ": null
    },
    {
        "Tor.com": "Tor.Com"
    },
    {
        ", November 11, 2012. Other authors Gaiman says furnished the inside of my mind and set me to writing include Moorcock, Ellison, ": null
    },
    {
        "Samuel R. Delany": "Samuel R. Delany"
    },
    {
        ", ": null
    },
    {
        "Angela Carter": "Angela Carter"
    },
    {
        ", Lafferty and Le Guin. Neil Gaiman has also taken inspiration from the folk tales tradition, citing ": null
    },
    {
        "Otta F Swires": "Otta F Swire"
    },
    {
        "book on the legends of the Isle of Skye as his inspiration for The Truth Is a Cave in the Black Mountains.      In the early 1980s, Gaiman pursued journalism, conducting interviews and writing book reviews, as a means to learn about the world and to make connections that he hoped would later assist him in getting published. He wrote and reviewed extensively for the British Fantasy Society.  His first professional short story publication was Featherquest , a fantasy story, in  Imagine Magazine  in May 1984.     When waiting for a train at Londons ": null
    },
    {
        "Victoria Station": "London Victoria Station"
    },
    {
        " in 1984, Gaiman noticed a copy of  Swamp Thing  written by ": null
    },
    {
        "Alan Moore": "Alan Moore"
    },
    {
        ", and carefully read it. Moores fresh and vigorous approach to comics had such an impact on Gaiman that he would later write that was the final straw, what was left of my resistance crumbled. I proceeded to make regular and frequent visits to Londons ": null
    },
    {
        "Forbidden Planet": "Forbidden Planet"
    },
    {
        " shop to buy comics .     In 1984, he wrote his first book, a biography of the band ": null
    },
    {
        "Duran Duran": "Duran Duran"
    },
    {
        ", as well as Ghastly Beyond Belief, a book of quotations, with ": null
    },
    {
        "Kim Newman": "Kim Newman"
    },
    {
        ". Even though Gaiman thought he had done a terrible job, the books first edition sold out very quickly. When he went to relinquish his rights to the book, he discovered the publisher had gone bankrupt.  After this, he was offered a job by  Penthouse . He refused the offer.     He also wrote interviews and articles for many British magazines, including  Knave . During this he sometimes wrote under pseudonyms, including Gerry Musgrave, Richard Grey, and a couple of house names .  Gaiman has said he ended his journalism career in 1987 because British newspapers regularly publish untruths as fact.     In the late 1980s, he wrote  Dont Panic: The Official Hitchhikers Guide to the Galaxy Companion  in what he calls a classic English humour style.  Following this he wrote the opening of what would become his collaboration with fellow English author ": null
    },
    {
        "Terry Pratchett": "Terry Pratchett"
    },
    {
        " on the ": null
    },
    {
        "comic novel": "Comic Novel"
    },
    {
        "  Good Omens , about the impending apocalypse.           After forming a friendship with comic-book writer ": null
    },
    {
        "Alan Moore": "Alan Moore"
    },
    {
        ",  Gaiman started writing comic books, picking up  Miracleman  after Moore finished his run on the series. Gaiman and artist ": null
    },
    {
        "Mark Buckingham": "Mark Buckingham"
    },
    {
        " collaborated on several issues of the series before its publisher, ": null
    },
    {
        "Eclipse Comics": "Eclipse Comics"
    },
    {
        ", collapsed, leaving the series unfinished. His first published comic strips were four short  Future Shocks  for  2000 AD  in 1986–87. He wrote three graphic novels with his favourite collaborator and long-time friend ": null
    },
    {
        "Dave McKean": "Dave Mckean"
    },
    {
        ":  Violent Cases ,  Signal to Noise , and  The Tragical Comedy or Comical Tragedy of Mr. Punch . Impressed with his work, ": null
    },
    {
        "DC Comics": "Dc Comics"
    },
    {
        " hired him in February 1987,  and he wrote the limited series  Black Orchid .   ": null
    },
    {
        "Karen Berger": "Karen Berger"
    },
    {
        ", who later became head of ": null
    },
    {
        "DC Comicss": "Dc Comics"
    },
    {
        " Vertigo": "Vertigo"
    },
    {
        ", read Black Orchid and offered Gaiman a job: to re-write an old character, The Sandman, but to put his own spin on him.      The Sandman  tells the tale of the ": null
    },
    {
        "ageless": "Endless"
    },
    {
        ", ": null
    },
    {
        "anthropomorphic": "Anthropomorphic"
    },
    {
        " personification of ": null
    },
    {
        "Dream": "Dream"
    },
    {
        " that is known by many names, including ": null
    },
    {
        "Morpheus": "Dream"
    },
    {
        ". The series began in January 1989 and concluded in March 1996. Manning 1980s in Dolan, p. 238: In arguably one of the greatest achievements in serialized modern comic books, writer Neil Gaiman crafted the seventy-five-issue ongoing series The Sandman, introducing its readers to a complex world of horror and fantasy. In the eighth issue of The Sandman, Gaiman and artist ": null
    },
    {
        "Mike Dringenberg": "Mike Dringenberg"
    },
    {
        " introduced ": null
    },
    {
        "Death": "Death"
    },
    {
        ", the older sister of Dream, who would become as popular as the series title character. Manning 1980s in Dolan, p. 240: Neil Gaiman, aided by penciller Mike Dringenberg, introduced the character Death to a fascinated readership...Death was an instant hit and arguably became more popular than the Sandman himself. The limited series  Death: The High Cost of Living  launched DCs ": null
    },
    {
        "Vertigo": "Vertigo"
    },
    {
        " line in 1993. Manning 1990s in Dolan, p. 262: In March 1993, DC Comics debuted a three-issue limited series entitled Death: The High Cost of Living...Written by Neil Gaiman and drawn by future comics superstar Chris Bachalo, The High Cost of Living had one notable trait besides a brilliant story: its cover bore a new logo. With this debut, DCs provocative new mature-reader imprint, Vertigo, was born. The 75 issues of the regular series, along with an illustrated prose text and a special containing seven short stories, have been collected into 12 volumes that remain in print, 14 if the Death: The High Cost of Living and  Death: The Time of Your Life  spin-offs are included. Artists include ": null
    },
    {
        "Sam Kieth": "Sam Kieth"
    },
    {
        ", Mike Dringenberg, ": null
    },
    {
        "Jill Thompson": "Jill Thompson"
    },
    {
        ", ": null
    },
    {
        "Shawn McManus": "Shawn Mcmanus"
    },
    {
        ", ": null
    },
    {
        "Marc Hempel": "Marc Hempel"
    },
    {
        " and ": null
    },
    {
        "Michael Zulli": "Michael Zulli"
    },
    {
        ", lettering by ": null
    },
    {
        "Todd Klein": "Todd Klein"
    },
    {
        ", colours by Daniel Vozzo, and covers by ": null
    },
    {
        "Dave McKean": "Dave Mckean"
    },
    {
        ". The series became one of DCs top selling titles, eclipsing even Batman and Superman.  Comics historian ": null
    },
    {
        "Les Daniels": "Les Daniels"
    },
    {
        " called Gaimans work astonishing and noted that The Sandman was a mixture of fantasy, horror, and ironic humor such as comic books had never seen before .   DC Comics writer and executive ": null
    },
    {
        "Paul Levitz": "Paul Levitz"
    },
    {
        " observed that The Sandman became the first extraordinary success as a series of graphic novel collections, reaching out and converting new readers to the medium, particularly young women on college campuses, and making Gaiman himself into an iconic cultural figure.      Gaiman and ": null
    },
    {
        "Jamie Delano": "Jamie Delano"
    },
    {
        " were to become co-writers of the  Swamp Thing  series following ": null
    },
    {
        "Rick Veitch": "Rick Veitch"
    },
    {
        ". An editorial decision by DC to censor Veitchs final storyline caused both Gaiman and Delano to withdraw from the title.      Gaiman produced two stories for DCs  Secret Origins  series in 1989. A ": null
    },
    {
        "Poison Ivy": "Poison Ivy"
    },
    {
        "  tale drawn by ": null
    },
    {
        "Mark Buckingham": "Mark Buckingham"
    },
    {
        " and a ": null
    },
    {
        "Riddler": "Riddler"
    },
    {
        " Manning 1980s in Dougall , p. 179: Secret Origins Special No. 1 Gaiman wrote the Riddlers tale, with the help of artist Bernie Mireault. story illustrated by ": null
    },
    {
        "Bernie Mireault": "Bernie Mireault"
    },
    {
        " and ": null
    },
    {
        "Matt Wagner": "Matt Wagner"
    },
    {
        ". A story which Gaiman originally wrote for  Action Comics Weekly  in 1989 was shelved due to editorial concerns but it was finally published in 2000 as  Green Lantern/Superman: Legend of the Green Flame .      In 1990, Gaiman wrote  The Books of Magic , a four-part mini-series that provided a tour of the mythological and magical parts of the ": null
    },
    {
        "DC Universe": "Dc Universe"
    },
    {
        " through a ": null
    },
    {
        "frame story": "Frame Story"
    },
    {
        " about an English teenager who discovers that he is destined to be the worlds greatest wizard. Manning 1990s in Dolan, p. 247: Neil Gaiman chronicled the adventures of magic pupil Timothy Hunter in this miniseries. each issue explored the realms of magic as portrayed by a different painter. The miniseries was popular, and sired an ongoing series written by ": null
    },
    {
        "John Ney Rieber": "John Ney Rieber"
    },
    {
        ".      Gaimans adaptation of  Sweeney Todd , illustrated by ": null
    },
    {
        "Michael Zulli": "Michael Zulli"
    },
    {
        " for ": null
    },
    {
        "Stephen R. Bissettes": "Stephen R. Bissette"
    },
    {
        "publication  Taboo , was stopped when the anthology itself was discontinued.      In the mid-1990s, he also created a number of new characters and a setting that was to be featured in a title published by ": null
    },
    {
        "Tekno Comix": "Tekno Comix"
    },
    {
        ". The concepts were then altered and split between three titles set in the same continuity:  Lady Justice ,  Mr. Hero the Newmatic Man , and  Teknophage ,  and tie-ins. Although Gaimans name appeared prominently as creator of the characters, he was not involved in writing any of the above-mentioned books.     Gaiman wrote a semi-autobiographical story about a boys fascination with ": null
    },
    {
        "Michael Moorcocks": "Michael Moorcock"
    },
    {
        "anti-hero ": null
    },
    {
        "Elric of Melniboné": "Elric Of Melniboné"
    },
    {
        " for ": null
    },
    {
        "Ed Kramers": "Ed Kramer"
    },
    {
        "anthology Tales of the White Wolf. In 1996, Gaiman and ": null
    },
    {
        "Ed Kramer": "Ed Kramer"
    },
    {
        " co-edited  The Sandman: Book of Dreams . Nominated for the ": null
    },
    {
        "British Fantasy Award": "British Fantasy Award"
    },
    {
        ", the original fiction anthology featured stories and contributions by ": null
    },
    {
        "Tori Amos": "Tori Amos"
    },
    {
        ", ": null
    },
    {
        "Clive Barker": "Clive Barker"
    },
    {
        ", ": null
    },
    {
        "Gene Wolfe": "Gene Wolfe"
    },
    {
        ", ": null
    },
    {
        "Tad Williams": "Tad Williams"
    },
    {
        ", and others.     Asked why he likes comics more than other forms of storytelling, Gaiman said: One of the joys of comics has always been the knowledge that it was, in many ways, untouched ground. It was virgin territory. When I was working on Sandman, I felt a lot of the time that I was actually picking up a machete and heading out into the jungle. I got to write in places and do things that nobody had ever done before. When Im writing novels Im painfully aware that Im working in a medium that people have been writing absolutely jaw-droppingly brilliant things for, you know, three-four thousand years now. You know, you can go back. We have things like  The Golden Ass . And you go, well, I dont know that Im as good as that and thats two and a half thousand years old. But with comics I felt like – I can do stuff nobody has ever done. I can do stuff nobody has ever thought of. And I could and it was enormously fun.      Gaiman wrote two series for ": null
    },
    {
        "Marvel Comics": "Marvel Comics"
    },
    {
        ".  Marvel 1602  was an eight-issue limited series published from November 2003 to June 2004 with art by ": null
    },
    {
        "Andy Kubert": "Andy Kubert"
    },
    {
        " and ": null
    },
    {
        "Richard Isanove": "Richard Isanove"
    },
    {
        ".  The Eternals  was a seven-issue limited series drawn by ": null
    },
    {
        "John Romita Jr.": "John Romita Jr."
    },
    {
        " which was published from August 2006 to March 2007.       In 2009, Gaiman wrote a two-part ": null
    },
    {
        "Batman": "Batman"
    },
    {
        " story for DC Comics to follow  Batman R.I.P.  titled ": null
    },
    {
        "Whatever Happened to the Caped Crusader?": "Batman: Whatever Happened To The Caped Crusader?"
    },
    {
        " Cowsill, Alan 2000s in Dolan, p. 337: Writer Neil Gaiman and art legend Andy Kubert teamed up to present a touching imaginary tale of a wake for the dead Batman...A love song to the Dark Knights long history...it went on to win SFXs Best Comic award in 2010. a play-off of the classic Superman story ": null
    },
    {
        "Whatever Happened to the Man of Tomorrow?": "Superman: Whatever Happened To The Man Of Tomorrow?"
    },
    {
        " by Alan Moore.   He contributed a twelve-part ": null
    },
    {
        "Metamorpho": "Metamorpho"
    },
    {
        " serial drawn by ": null
    },
    {
        "Mike Allred": "Mike Allred"
    },
    {
        " for  Wednesday Comics , a weekly newspaper-style series. Cowsill 2000s in Dolan, p. 338: The contained fifteen continuous stories, including...Metamorpho scripted by Neil Gaiman and illustrated by Michael Allred.  Gaiman and ": null
    },
    {
        "Paul Cornell": "Paul Cornell"
    },
    {
        " co-wrote  Action Comics  894 which featured an appearance by Death.  In October 2013, DC Comics released  The Sandman: Overture  with art by ": null
    },
    {
        "J. H. Williams III": "J. H. Williams Iii"
    },
    {
        ".   Gaimans ": null
    },
    {
        "Angela": "Angela"
    },
    {
        " character was introduced into the Marvel Universe in the last issue of the  Age of Ultron  miniseries in 2013.      Gaiman is overseeing  The Sandman Universe , a line of comic books published by Vertigo. The four new ongoing series —House of Whispers,  Lucifer ,  The Books of Magic , and  The Dreaming  are written by new creative teams. The line launched on 8 August 2018.               In a collaboration with author ": null
    },
    {
        "Terry Pratchett": "Terry Pratchett"
    },
    {
        ", best known for his series of  Discworld  novels, Gaimans first novel  Good Omens  was published in 1990. In 2011 Pratchett said that while the entire novel was a collaborative effort and most of the ideas could be credited to both of them, Pratchett did a larger portion of writing and editing if for no other reason than Gaimans scheduled involvement with Sandman.      The 1996 ": null
    },
    {
        "novelisation": "Neverwhere"
    },
    {
        " of Gaimans teleplay for the BBC mini-series  Neverwhere  was his first solo novel. The novel was released in tandem with the television series though it presents some notable differences from the television series. Gaiman has since revised the novel twice, the first time for an American audience unfamiliar with the ": null
    },
    {
        "London Underground": "London Underground"
    },
    {
        ", the second time because he felt unsatisfied with the original.     In 1999, first printings of his fantasy novel  Stardust  were released. The novel has been released both as a standard novel and in an illustrated text edition. This novel was highly influenced by Victorian fairytales and culture.      American Gods  became one of Gaimans best-selling and multi-award-winning novels upon its release in 2001.  A special 10th Anniversary edition was released, with the authors preferred text 12,000 words longer than the original mass-market editions.     Gaiman has not written a direct sequel to American Gods but he has revisited the characters. A glimpse at Shadows travels in Europe is found in a short story which finds him in Scotland, applying the same concepts developed in American Gods to the story of  Beowulf . The 2005 novel  Anansi Boys  deals with ": null
    },
    {
        "Anansi": "Anansi"
    },
    {
        " , tracing the relationship of his two sons, one semi-divine and the other an unassuming Englishman, as they explore their common heritage. It debuted at number one on ": null
    },
    {
        "The New York Times Best Seller list": "The New York Times Best Seller List"
    },
    {
        ".      In late 2008, Gaiman released a new childrens book,  The Graveyard Book . It follows the adventures of a boy named Bod after his family is murdered and he is left to be brought up by a graveyard. It is heavily influenced by ": null
    },
    {
        "Rudyard Kiplings": "Rudyard Kipling"
    },
    {
        "  The Jungle Book . , it had been on The New York Times Bestseller childrens list for fifteen weeks.      In 2013,  The Ocean at the End of the Lane  was voted Book of the Year in the British ": null
    },
    {
        "National Book Awards": "Specsavers National Book Awards"
    },
    {
        ". The novel follows an unnamed man who returns to his hometown for a funeral and remembers events that began forty years earlier.  Themes include the search for ": null
    },
    {
        "self-identity": "Self-Identity"
    },
    {
        " and the disconnect between childhood and adulthood .      In September 2016, Neil Gaiman announced that he had been working for some years on retellings of ": null
    },
    {
        "Norse mythology": "Norse Mythology"
    },
    {
        ".   Norse Mythology  was released in February 2017.             Gaiman wrote the 1996 BBC dark fantasy television series  Neverwhere . He cowrote the screenplay for the movie  MirrorMask  with his old friend ": null
    },
    {
        "Dave McKean": "Dave Mckean"
    },
    {
        " for McKean to direct. In addition, he wrote the localised English language script to the ": null
    },
    {
        "anime": "Anime"
    },
    {
        " movie  Princess Mononoke , based on a translation of the Japanese script.      He cowrote the script for ": null
    },
    {
        "Robert Zemeckiss": "Robert Zemeckis"
    },
    {
        "  Beowulf  with ": null
    },
    {
        "Roger Avary": "Roger Avary"
    },
    {
        ", a collaboration that has proved productive for both writers.  Gaiman has expressed interest in collaborating on a ": null
    },
    {
        "film adaptation": "Film Adaptation"
    },
    {
        " of the  Epic of Gilgamesh .         He was the only person other than ": null
    },
    {
        "J. Michael Straczynski": "J. Michael Straczynski"
    },
    {
        " to write a  Babylon 5  script in the last three seasons, contributing the season five episode ": null
    },
    {
        "Day of the Dead": "Day Of The Dead"
    },
    {
        " .     Gaiman has also written at least three drafts of a screenplay adaptation of ": null
    },
    {
        "Nicholson Bakers": "Nicholson Baker"
    },
    {
        "novel  The Fermata  for director ": null
    },
    {
        "Robert Zemeckis": "Robert Zemeckis"
    },
    {
        ",   although the project was stalled while Zemeckis made  The Polar Express  and the Gaiman-": null
    },
    {
        "Roger Avary": "Roger Avary"
    },
    {
        " written  Beowulf  film.     Neil Gaiman was featured in the  History Channel  documentary  Comic Book Superheroes Unmasked .     Several of Gaimans original works have been optioned or greenlighted for film adaptation, most notably  Stardust , which premiered in August 2007 and stars ": null
    },
    {
        "Charlie Cox": "Charlie Cox"
    },
    {
        ", ": null
    },
    {
        "Robert De Niro": "Robert De Niro"
    },
    {
        ", ": null
    },
    {
        "Michelle Pfeiffer": "Michelle Pfeiffer"
    },
    {
        " and ": null
    },
    {
        "Claire Danes": "Claire Danes"
    },
    {
        ", directed by ": null
    },
    {
        "Matthew Vaughn": "Matthew Vaughn"
    },
    {
        ". A stop-motion version of  Coraline  was released on 6 February 2009, with ": null
    },
    {
        "Henry Selick": "Henry Selick"
    },
    {
        " directing and ": null
    },
    {
        "Dakota Fanning": "Dakota Fanning"
    },
    {
        " and ": null
    },
    {
        "Teri Hatcher": "Teri Hatcher"
    },
    {
        " in the leading voice-actor roles.     In 2007, Gaiman it was announced that after ten years in development, ": null
    },
    {
        "the feature film": "Death And Me"
    },
    {
        " of  Death: The High Cost of Living  would finally begin production with a screenplay by Gaiman that he would direct for Warner Independent. ": null
    },
    {
        "Don Murphy": "Don Murphy"
    },
    {
        " and ": null
    },
    {
        "Susan Montford": "Susan Montford"
    },
    {
        " are the producers, and ": null
    },
    {
        "Guillermo del Toro": "Guillermo Del Toro"
    },
    {
        " is the films executive producer.   By 2010 it had been reported that it was no longer in production.      Seeing Ear Theatre performed two of Gaimans audio theatre plays, ": null
    },
    {
        "Snow, Glass, Apples": "Snow, Glass, Apples"
    },
    {
        " , Gaimans retelling of ": null
    },
    {
        "Snow White": "Snow White"
    },
    {
        " and ": null
    },
    {
        "Murder Mysteries": "Murder Mysteries"
    },
    {
        " , a story of heaven before the Fall in which the first crime is committed. Both audio plays were published in the collection  Smoke and Mirrors  in 1998.      Gaimans 2009 ": null
    },
    {
        "Newbery Medal": "Newbery Medal"
    },
    {
        " winning book  The Graveyard Book  will be made into a movie, with ": null
    },
    {
        "Ron Howard": "Ron Howard"
    },
    {
        " as the director.      Gaiman wrote an episode of the long-running BBC science fiction series  Doctor Who , broadcast in 2011 during ": null
    },
    {
        "Matt Smiths": "Matt Smith"
    },
    {
        "second series as the Doctor.  Shooting began in August 2010 for this episode, the original title of which was The House of Nothing  but which was eventually transmitted as ": null
    },
    {
        "The Doctors Wife": "The Doctors Wife"
    },
    {
        " .  The episode won the 2012 ": null
    },
    {
        "Hugo Award for Best Dramatic Presentation ": "Hugo Award For Best Dramatic Presentation, Short Form"
    },
    {
        ".   Gaiman made his return to Doctor Who with an episode titled ": null
    },
    {
        "Nightmare in Silver": "Nightmare In Silver"
    },
    {
        " , broadcast on 11 May 2013.       In 2011, it was announced that Gaiman would be writing the script to a new film version of  Journey to the West .       Gaiman appeared as himself on  The Simpsons  episode ": null
    },
    {
        "The Book Job": "The Book Job"
    },
    {
        " , which broadcast on 20 November 2011.        In 2015, ": null
    },
    {
        "Starz": "Starz"
    },
    {
        " greenlighted a ": null
    },
    {
        "series adaptation": "American Gods"
    },
    {
        " of Gaimans novel  American Gods . ": null
    },
    {
        "Bryan Fuller": "Bryan Fuller"
    },
    {
        " and ": null
    },
    {
        "Michael Green": "Michael Green"
    },
    {
        " wrote and showrun the series.        A six-part ": null
    },
    {
        "radio play of Neverwhere": "Neverwhere"
    },
    {
        " was broadcast in March 2013, adapted by Dirk Maggs for ": null
    },
    {
        "BBC Radio 4": "Bbc Radio 4"
    },
    {
        " and Radio 4 Extra. Featured stars include ": null
    },
    {
        "James McAvoy": "James Mcavoy"
    },
    {
        " as Richard, ": null
    },
    {
        "Natalie Dormer": "Natalie Dormer"
    },
    {
        ", ": null
    },
    {
        "Benedict Cumberbatch": "Benedict Cumberbatch"
    },
    {
        ", ": null
    },
    {
        "Christopher Lee": "Christopher Lee"
    },
    {
        ", ": null
    },
    {
        "Bernard Cribbens": "Bernard Cribbens"
    },
    {
        " and ": null
    },
    {
        "Johnny Vegas": "Johnny Vegas"
    },
    {
        ".      In September 2014, Gaiman and Terry Pratchett joined forces with BBC Radio 4 to make the first ever dramatisation of their co-penned novel Good Omens, which was broadcast in December in five half-hour episodes and culminated in an hour-long final apocalyptic showdown.       Gaiman frequently performs public readings from his stories and poetry, and has toured with his wife, musician ": null
    },
    {
        "Amanda Palmer": "Amanda Palmer"
    },
    {
        ". In some of these performances he has also sung songs, in a novelists version of singing ,  despite having no kind of singing voice .      In 2015, Gaiman delivered a 100-minute lecture for the ": null
    },
    {
        "Long Now Foundation": "Long Now Foundation"
    },
    {
        " entitled How Stories Last about the nature of storytelling and how stories persist in human culture.  Filmed on Tuesday 9 June 2015 at The Long Now Foundation. Audio and video available. In April 2018 Gaiman made a guest appearance on the television show  The Big Bang Theory , and his tweet about the shows fictional comic book store becomes the central theme of the episode The Comet Polarization .        In February 2001, when Gaiman had completed writing  American Gods , his publishers set up a promotional website featuring a ": null
    },
    {
        "weblog": "Weblog"
    },
    {
        " in which Gaiman described the day-to-day process of revising, publishing, and promoting the novel. After the novel was published, the website evolved into a more general Official Neil Gaiman Website.      Gaiman generally posts to the blog describing the day-to-day process of being Neil Gaiman and writing, revising, publishing, or promoting whatever the current project is. He also posts reader emails and answers questions, which gives him unusually direct and immediate interaction with fans. One of his answers on why he writes the blog is because writing is, like death, a lonely business.      The original American Gods blog was extracted for publication in the ": null
    },
    {
        "NESFA Press": "Nesfa Press"
    },
    {
        " collection of Gaiman miscellany, Adventures in the Dream Trade.      To celebrate the seventh anniversary of the blog, the novel American Gods was provided free of charge online for a month.      Gaiman is an active user of the social networking site Twitter with over 2.7 million followers , using the username @neilhimself.  In 2013, Gaiman was named by ": null
    },
    {
        "IGN": "Ign"
    },
    {
        " as one of The Best Tweeters in Comics , describing his posts as sublime.  Gaiman also runs a ": null
    },
    {
        "Tumblr": "Tumblr"
    },
    {
        " account on which he primarily answers fan questions.        Gaiman is a dedicated user of fountain pens and has said that he writes the first draft of all his books with one. He started this practice with Stardust which he wrote in fountain pen in order to capture the feeling of the 1920s.  He is most closely associated with the Pilot 823, one of which he has said he has used for giving over one million signatures.                      Gaiman has lived near ": null
    },
    {
        "Menomonie, Wisconsin": "Menomonie, Wisconsin"
    },
    {
        ", since 1992. Gaiman moved there to be close to the family of his then-wife, Mary McGrath, with whom he has three children.      , Gaiman also resides in ": null
    },
    {
        "Cambridge, Massachusetts": "Cambridge, Massachusetts"
    },
    {
        ".  In 2014, he took up a five-year appointment as professor in the arts at ": null
    },
    {
        "Bard College": "Bard College"
    },
    {
        ", in ": null
    },
    {
        "Annandale-on-Hudson, New York": "Annandale-On-Hudson, New York"
    },
    {
        ".      Gaiman is married to songwriter and performer ": null
    },
    {
        "Amanda Palmer": "Amanda Palmer"
    },
    {
        ", with whom he has an ": null
    },
    {
        "open marriage": "Open Marriage"
    },
    {
        ".  The couple announced that they were dating in June 2009,   and announced their engagement on Twitter on 1 January 2010.  On 16 November 2010, Palmer hosted a non-legally binding ": null
    },
    {
        "flash mob": "Flash Mob"
    },
    {
        " wedding for Gaimans birthday in ": null
    },
    {
        "New Orleans": "New Orleans"
    },
    {
        ".   They were legally married on 2 January 2011.  The wedding took place in the parlour of writers ": null
    },
    {
        "Ayelet Waldman": "Ayelet Waldman"
    },
    {
        " and ": null
    },
    {
        "Michael Chabon": "Michael Chabon"
    },
    {
        ".  On marrying Palmer, he took her middle name, MacKinnon, as one of his names. In September 2015 they had a son.        In 2016, Gaiman, as well as ": null
    },
    {
        "Cate Blanchett": "Cate Blanchett"
    },
    {
        ", ": null
    },
    {
        "Chiwetel Ejiofor": "Chiwetel Ejiofor"
    },
    {
        ", ": null
    },
    {
        "Peter Capaldi": "Peter Capaldi"
    },
    {
        ", ": null
    },
    {
        "Douglas Booth": "Douglas Booth"
    },
    {
        ", ": null
    },
    {
        "Jesse Eisenberg": "Jesse Eisenberg"
    },
    {
        ", ": null
    },
    {
        "Keira Knightley": "Keira Knightley"
    },
    {
        ", ": null
    },
    {
        "Juliet Stevenson": "Juliet Stevenson"
    },
    {
        ", ": null
    },
    {
        "Kit Harington": "Kit Harington"
    },
    {
        ", and ": null
    },
    {
        "Stanley Tucci": "Stanley Tucci"
    },
    {
        ", appeared in the video What They Took With Them , from the ": null
    },
    {
        "United Nations": "United Nations System"
    },
    {
        " refugee agency ": null
    },
    {
        "UNHCR": "United Nations High Commissioner For Refugees"
    },
    {
        ", to help raise awareness of the issue of global refugees.       Gaiman is a supporter and board member of the ": null
    },
    {
        "Comic Book Legal Defense Fund": "Comic Book Legal Defense Fund"
    },
    {
        ".        One of Gaimans most commented-upon friendships is with the musician ": null
    },
    {
        "Tori Amos": "Tori Amos"
    },
    {
        ", a Sandman fan who became friends with Gaiman after making a reference to Neil and the Dream King on her 1991 demo tape. He included her in turn as a character in his novel Stardust. Tori Amos, Tear in Your Hand,  Little Earthquakes  Amos also mentions Gaiman in her songs, Tear in Your Hand ,  Space Dog ,  Horses ,  Carbon ,  Sweet Dreams ,  and Not Dying Today . He also wrote stories for the tour book of  Boys for Pele  and  Scarlets Walk , a letter for the tour book of  American Doll Posse , and the stories behind each girl in her album  Strange Little Girls . Amos penned the introduction for his novel Death: the High Cost of Living, and posed for the cover. She also wrote a song called Sister Named Desire based on his Sandman character, which was included on his anthology, Wheres Neil When You Need Him?.     Gaiman is godfather to Tori Amoss daughter Tash,  and wrote a poem called Blueberry Girl for Tori and Tash.  The poem has been turned into a book by the illustrator ": null
    },
    {
        "Charles Vess": "Charles Vess"
    },
    {
        ".  Gaiman read the poem aloud to an audience at the Sundance Kabuki Theater in San Francisco on 5 October 2008 during his book reading tour for The Graveyard Book.  It was published in March 2009 with the title  Blueberry Girl .       In 1993, Gaiman was contracted by ": null
    },
    {
        "Todd McFarlane": "Todd Mcfarlane"
    },
    {
        " to write a single issue of  Spawn , a popular title at the newly created ": null
    },
    {
        "Image Comics": "Image Comics"
    },
    {
        " company. McFarlane was promoting his new title by having guest authors Gaiman, ": null
    },
    {
        "Alan Moore": "Alan Moore"
    },
    {
        ", ": null
    },
    {
        "Frank Miller": "Frank Miller"
    },
    {
        ", and ": null
    },
    {
        "Dave Sim": "Dave Sim"
    },
    {
        " each write a single issue.     In issue No. 9 of the series, Gaiman introduced the characters ": null
    },
    {
        "Angela": "Angela"
    },
    {
        ", ": null
    },
    {
        "Cogliostro": "Cogliostro"
    },
    {
        ", and ": null
    },
    {
        "Medieval Spawn": "Hellspawn"
    },
    {
        ". Prior to this issue, Spawn was an assassin who worked for the government and came back as a reluctant agent of Hell but had no direction. In Angela, a cruel and malicious angel, Gaiman introduced a character who threatened Spawns existence, as well as providing a moral opposite. Cogliostro was introduced as a mentor character for exposition and instruction, providing guidance. Medieval Spawn introduced a history and precedent that not all Spawns were self-serving or evil, giving additional character development to ": null
    },
    {
        "Malebolgia": "Malebolgia"
    },
    {
        ", the demon that creates Hellspawn.     As intended, See Judge Shabazs ruling for the legal reasoning: As a co-owner, McFarlane was not violating the Copyright Act by unilaterally publishing the jointly owned work, but, as in any other case of conversion or misappropriation, he would have to account to the other joint owner for the latters share of the profits. all three characters were used repeatedly throughout the next decade by Todd McFarlane within the wider Spawn universe. In papers filed by Gaiman in early 2002, however, he claimed that the characters were jointly owned by their scripter and artist , not merely by McFarlane in his role as the creator of the series. Listen to the Oral Argument,  . Retrieved 22 September 2008. See also the  . Retrieved 22 September 2008. Disagreement over who owned the rights to a character was the primary motivation for McFarlane and other artists to form Image Comics . See ": null
    },
    {
        "Khoury, George": "George Khoury"
    },
    {
        ", Image Comics: The Road To Independence ,  As McFarlane used the characters without Gaimans permission or royalty payments, Gaiman believed his ": null
    },
    {
        "copyright": "Copyright"
    },
    {
        "ed work was being infringed upon, which violated their original oral agreement. McFarlane initially agreed that Gaiman had not signed away any rights to the characters, and negotiated with Gaiman to effectively swap McFarlanes interest in the character ": null
    },
    {
        "Marvelman": "Marvelman"
    },
    {
        " See Judge Shabazs  : A tentative agreement was reached that... Gaiman would exchange his rights in Medieval Spawn and Cogliostro for McFarlanes rights in another comic book character, Miracleman.  but later claimed that Gaimans work had been work-for-hire and that McFarlane owned all of Gaimans creations entirely. The presiding judge, however, ruled against their agreement being work for hire, based in large part on the legal requirement that copyright assignments must be in writing. Judge Shabaz,  , as per Schiller & Schmidt, Inc. v. Nordisco Corp., 969 F.2d 410, 413     The ": null
    },
    {
        "Seventh Circuit Court of Appeals": "United States Court Of Appeals For The Seventh Circuit"
    },
    {
        " upheld the district court ruling in February 2004  granting joint ownership of the characters to Gaiman and McFarlane. On the specific issue of Cogliostro, presiding Judge ": null
    },
    {
        "John C. Shabaz": "John C. Shabaz"
    },
    {
        " proclaimed, The expressive work that is the comic-book character Count Nicholas Cogliostro was the joint work of Gaiman and McFarlane—their contributions strike us as quite equal—and both are entitled to ownership of the copyright . See Judge Shabazs   for similar statements on Angela and Medieval Spawn. Similar analysis led to similar results for the other two characters, Angela and Medieval Spawn.     This legal battle was brought by Gaiman and the specifically formed Marvels and Miracles, ": null
    },
    {
        "LLC": "Limited-Liability Company"
    },
    {
        ", which Gaiman created to help sort out ": null
    },
    {
        "the legal rights surrounding Marvelman": "Marvelmanownership Battle"
    },
    {
        ". Gaiman wrote  Marvel 1602 in 2003 to help fund this project.  All of Marvel Comics profits for the original issues of the series went to Marvels and Miracles. In 2009, Marvel Comics purchased Marvelman.      Gaiman returned to court over three more Spawn characters, ": null
    },
    {
        "Dark Ages Spawn": "Dark Ages Spawn"
    },
    {
        ", ": null
    },
    {
        "Domina": "Domina"
    },
    {
        " and ": null
    },
    {
        "Tiffany": "Tiffany"
    },
    {
        ", that are claimed to be derivative of the three he co-created with McFarlane.  The judge ruled that Gaiman was right in his claims and gave McFarlane until the start of September 2010 to settle matters.        Gaimans work is known for a high degree of ": null
    },
    {
        "allusiveness": "Allusion"
    },
    {
        ". See particularly Rodney Sharkey, James Fleming, and Zuleyha Cetiner-Oktems articles in ImageTexT s special issue on Gaimans work: . Meredith Collins, for instance, has commented upon the degree to which his novel  Stardust  depends on allusions to Victorian fairy tales and culture. Collins, Meredith. Fairy and Faerie: Uses of the Victorian in Neil Gaimans and Charles Vesss Stardust. ImageTexT 4.1.  Particularly in The Sandman, literary figures and characters appear often; the character of Fiddlers Green is modelled visually on ": null
    },
    {
        "G. K. Chesterton": "G. K. Chesterton"
    },
    {
        ", both ": null
    },
    {
        "William Shakespeare": "William Shakespeare"
    },
    {
        " and ": null
    },
    {
        "Geoffrey Chaucer": "Geoffrey Chaucer"
    },
    {
        " appear as characters, as do several characters from within  A Midsummer Nights Dream  See this detailed analysis: . and  The Tempest . The comic also draws from numerous mythologies and historical periods.     Analyzing Gaimans The Graveyard Book, bibliographer and librarian ": null
    },
    {
        "Richard Bleiler": "Richard Bleiler"
    },
    {
        " detects patterns of and allusions to the Gothic novel, from ": null
    },
    {
        "Horace Walpoles": "Horace Walpole"
    },
    {
        "  The Castle of Otranto  to ": null
    },
    {
        "Shirley Jacksons": "Shirley Jackson"
    },
    {
        "  The Haunting of Hill House . He concludes that Gaiman is utilizing works, characters, themes, and settings that generations of scholars have identified and classified as Gothic, ... subverts them and develops the novel by focusing on the positive aspects of maturation, concentrating on the values of learning, friendship, and sacrifice.  Regarding another works assumed connection and allusions to this form, Gaiman himself quipped: Ive never been able to figure out whether Sandman is a gothic.      Clay Smith has argued that this sort of allusiveness serves to situate Gaiman as a strong authorial presence in his own works, often to the exclusion of his collaborators. Smith, Clay. Get Gaiman?: PolyMorpheus Perversity in Works by and about Neil Gaiman. ImageTexT 4.1.  However, Smiths viewpoint is in the minority: to many, if there is a problem with Gaiman scholarship and intertextuality it is that ... his literary merit and vast popularity have propelled him into the nascent comics canon so quickly that there is not yet a basis of critical scholarship about his work.      David Rudd takes a more generous view in his study of the novel  Coraline , where he argues that the work plays and riffs productively on ": null
    },
    {
        "Sigmund Freuds": "Sigmund Freud"
    },
    {
        "notion of ": null
    },
    {
        "the Uncanny": "Uncanny"
    },
    {
        ", or the  Unheimlich .      Though Gaimans work is frequently seen as exemplifying the ": null
    },
    {
        "monomyth": "Monomyth"
    },
    {
        " structure laid out in ": null
    },
    {
        "Joseph Campbells": "Joseph Campbell"
    },
    {
        "  The Hero with a Thousand Faces , See Stephen Rauch, Neil Gaimans The Sandman and Joseph Campbell: In Search of the Modern Myth, Wildside Press, 2003 Gaiman says that he started reading The Hero with a Thousand Faces but refused to finish it: I think I got about half way through The Hero with a Thousand Faces and found myself thinking if this is true – I dont want to know. I really would rather not know this stuff. Id rather do it because its true and because I accidentally wind up creating something that falls into this pattern than be told what the pattern is.         ": null
    },
    {
        "Harvey Awards": "Harvey Awards"
    },
    {
        " in the following categories:   1991 Best Writer for The Sandman    1992 Best Writer for The Sandman    1993 Best Continuing or Limited Series for The Sandman    From 1991 to 2014, Gaiman won ": null
    },
    {
        "Locus Awards": "Locus Awards"
    },
    {
        " in the following categories:   1991 Best Fantasy Novel for  Good Omens  by Gaiman and ": null
    },
    {
        "Terry Pratchett": "Terry Pratchett"
    },
    {
        "    1999 Best Fantasy Novel for  Stardust     2002 Best Fantasy Novel for American Gods    2003 Best Young Adult Book for Coraline    2004 Best Novelette for A Study in Emerald   2005 Best Short Story for Forbidden Brides of the Faceless Slaves in the Nameless House of the Night of Dread Desire   2006 Best Fantasy novel for  Anansi Boys . The book was also nominated for a Hugo Award, but Gaiman asked for it to be withdrawn from the list, stating that he wanted to give other writers a chance and that it was really more fantasy than science fiction.    2006 Best Short Story for Sunbird   2007 Best Short Story for How to Talk to Girls at Parties   2007 Best Collection for Fragile Things   2009 Best Young Adult novel for The Graveyard Book   2010 Best Short Story for An Invocation of Incuriosity, published in  Songs of the Dying Earth     2011 Best Short Story for The Thing About Cassandra, published in  Songs of Love and Death     2011 Best Novelette for The Truth Is A Cave In The Black Mountains, published in Stories   2014 Best Fantasy Novel for The Ocean at the End of the Lane ": null
    },
    {
        "Eisner Awards": "Eisner Award"
    },
    {
        "in the following categories:   1991 Best Continuing Series: Sandman, by Neil Gaiman and various artists    1991 Best Graphic Album–Reprint: Sandman: The Dolls House by Neil Gaiman and various artists   1991 Best Writer: Neil Gaiman, Sandman   1992 Best Single Issue or Story: Sandman 22-28: Season of Mists, by Neil Gaiman and various artists   1992 Best Continuing Series: Sandman, by Neil Gaiman and various artists   1992 Best Writer: Neil Gaiman, Sandman, Books of Magic , Miracleman   1993 Best Continuing Series: Sandman by Neil Gaiman and various artists   1993 Best Graphic Album–New: Signal to Noise by Neil Gaiman and Dave McKean   1993 Best Writer: Neil Gaiman, Miracleman ; Sandman   1994 Best Writer: Neil Gaiman, Sandman ; Death: The High Cost of Living   2000 Best Comics-Related Book: The Sandman: The Dream Hunters, by Neil Gaiman and Yoshitaka Amano    2004 Best Short Story: Death, by Neil Gaiman and P. Craig Russell, in The Sandman: Endless Nights   2004 Best Anthology: The Sandman: Endless Nights, by Neil Gaiman and others, edited by Karen Berger and Shelly Bond   2007 Best Archival Collection/Project–Comic Books: Absolute Sandman, vol. 1, by Neil Gaiman and various   2009 Best Publication for Teens/Tweens: Coraline, by Neil Gaiman, adapted by P. Craig Russell   In 1991, Gaiman received an ": null
    },
    {
        "Inkpot Award": "Inkpot Award"
    },
    {
        " at the ": null
    },
    {
        "San Diego Comic-Con International": "San Diego Comic-Con"
    },
    {
        "    From 2000 to 2004, Gaiman won ": null
    },
    {
        "Bram Stoker Awards": "Bram Stoker Award"
    },
    {
        "in the following categories:   2000 Best Illustrated Narrative for  The Sandman: The Dream Hunters     2001 Best Novel for  American Gods    2003 Best Work for Young Readers for Coraline    2004 Best Illustrated Narrative for  The Sandman: Endless Nights    From 2002 to 2016, Gaiman won ": null
    },
    {
        "Hugo Awards": "Hugo Award"
    },
    {
        "in the following categories:   2002 Best Novel for American Gods    2003 Best Novella for  Coraline    2004 Best Short Story for  A Study in Emerald    2009 Best Novel for  The Graveyard Book  presented at the ": null
    },
    {
        "2009 Worldcon": "67Th World Science Fiction Convention"
    },
    {
        " in Montreal where he was also the Professional Guest of Honor.     2012 Best Dramatic Presentation for ": null
    },
    {
        "The Doctors Wife": "The Doctors Wife"
    },
    {
        "   2016 Best Graphic Story for  The Sandman: Overture     From 2002 to 2003, Gaiman won ": null
    },
    {
        "Nebula Awards": "Nebula Award"
    },
    {
        "in the following categories:   2002 Best Novel for American Gods   2003 Best Novella for Coraline   From 2006 to 2010, Gaiman won ": null
    },
    {
        "British Fantasy Awards": "British Fantasy Award"
    },
    {
        "in the following categories:   2006 Best Novel for  Anansi Boys     2007 British Fantasy Award, collection, for Fragile Things   2009 British Fantasy Award for Best Novel shortlist for  The Graveyard Book     2010 British Fantasy Award, comic/graphic novel, Whatever Happened to the Caped Crusader?, by Gaiman and Andy Kubert   In 2010, Gaiman won ": null
    },
    {
        "Shirley Jackson Awards": "Shirley Jackson Award"
    },
    {
        "in the following categories:   2010 Best Novelette for The Truth Is A Cave In The Black Mountains    2010 Best Edited Anthology for Stories: All New Tales, edited by Neil Gaiman and Al Sarrantonio   1991 ": null
    },
    {
        "World Fantasy Award": "World Fantasy Award"
    },
    {
        " for short fiction for the Sandman issue, ": null
    },
    {
        "A Midsummer Nights Dream": "The Sandman: Dream Country"
    },
    {
        " , by Gaiman and Charles Vess    . The Locus Index to SF Awards: Index to Literary Nominees. ": null
    },
    {
        "Locus Publications": "Locus Publications"
    },
    {
        ". Retrieved 5 November 2012.   1991–1993  Comics Buyers Guide  Award for Favorite Writer   1997–2000  Comics Buyers Guide  Award for Favorite Writer nominations   1997 ": null
    },
    {
        "Comic Book Legal Defense Fund": "Comic Book Legal Defense Fund"
    },
    {
        " Defender of Liberty award    1999 ": null
    },
    {
        "Mythopoeic Fantasy Award for Adult Literature": "Mythopoeic Award"
    },
    {
        " for the illustrated version of  Stardust     2003 ": null
    },
    {
        "British Science Fiction Association Award": "British Science Fiction Association Award"
    },
    {
        ", short fiction, for Coraline   2004 ": null
    },
    {
        "Angoulême International Comics Festival Prize for Scenario": "Angoulême International Comics Festival Prize For Scenario"
    },
    {
        " for  The Sandman: Season of Mists   Archive requires scrolldown   2005 The ": null
    },
    {
        "William Shatner": "William Shatner"
    },
    {
        " Golden Groundhog Award for Best Underground Movie, nomination for  MirrorMask   The other nominated films were  Green Street Hooligans ,  Nine Lives ,  Up for Grabs  and  Opie Gets Laid .    2005 ": null
    },
    {
        "Quill Book Award for Graphic Novels": "Quill Awards"
    },
    {
        " for  Marvel 1602     2006 ": null
    },
    {
        "Mythopoeic Fantasy Award for Adult Literature": "Mythopoeic Award"
    },
    {
        " for  Anansi Boys    2007 ": null
    },
    {
        "Bob Clampett": "Bob Clampett"
    },
    {
        " Humanitarian Award    2007 ": null
    },
    {
        "Comic-Con": "San Diego Comic-Con International"
    },
    {
        " Icon award presented at the ": null
    },
    {
        "Scream Awards": "Scream Awards"
    },
    {
        ".    2009 ": null
    },
    {
        "Newbery Medal": "Newbery Medal"
    },
    {
        " for  The Graveyard Book     2009 ": null
    },
    {
        "Audie Award": "Audie Award"
    },
    {
        ": Childrens 8–12 and Audiobook of the year for the audio version of  The Graveyard Book .    2009 The Booktrust Teenage Prize for The Graveyard Book ": null
    },
    {
        "American Library Association": "American Library Association"
    },
    {
        ".    2010 ": null
    },
    {
        "Carnegie Medal": "Carnegie Medal In Literature"
    },
    {
        " for The Graveyard Book, becoming the first author to have won both the Carnegie and Newbery Medals for the same work.          . Living Archive: Celebrating the Carnegie and Greenaway Winners. ": null
    },
    {
        "CILIP": "Cilip"
    },
    {
        ". Retrieved 20 August 2012.    . Press Desk. CILIP. Retrieved 20 August 2012.   . 28 July 2014.   2011 ": null
    },
    {
        "Ray Bradbury Award for Outstanding Dramatic Presentation": "Bradbury Award"
    },
    {
        "  for The Doctors Wife    2012 Honorary Doctorate of Arts from the ": null
    },
    {
        "University of the Arts": "University Of The Arts"
    },
    {
        "    2013 ": null
    },
    {
        "National Book Awards": "Specsavers National Book Awards"
    },
    {
        " , Book of the Year winner for The Ocean at the End of the Lane    2016 ": null
    },
    {
        "University of St Andrews": "University Of St Andrews"
    },
    {
        " Honorary degree of Doctor of Letters    2018 Nomination for the ": null
    },
    {
        "New Academy Prize in Literature": "New Academy Prize In Literature"
    },
    {
        ".    2019 ": null
    },
    {
        "Barnes & Noble Writers for Writers Award": "Poets  &  Writersbarnes  &  Noble Writers For Writers Award"
    },
    {
        ", “celebrat authors who have given generously to other writers or to the broader literary community.” Gaiman was given the award “for advocating for freedom of expression worldwide and inspiring countless writers.”           ": null
    }
]