[
    {
        "Nereid is the third-largest ": null
    },
    {
        "moon": "natural satellite"
    },
    {
        " of ": null
    },
    {
        "Neptune": "neptune"
    },
    {
        ". Of all known moons in the solar system it has the most eccentric orbit. It was the second ": null
    },
    {
        "moon of Neptune": "moons of neptune"
    },
    {
        " to be discovered, by ": null
    },
    {
        "Gerard Kuiper": "gerard kuiper"
    },
    {
        " in 1949.       Nereid was discovered on 1 May 1949 by ": null
    },
    {
        "Gerard P. Kuiper": "gerard p. kuiper"
    },
    {
        " on photographic plates taken with the 82-inch telescope at the ": null
    },
    {
        "McDonald Observatory": "mcdonald observatory"
    },
    {
        ". He proposed the name in the report of his discovery. It is named after the ": null
    },
    {
        "Nereid": "nereid"
    },
    {
        "s, sea-nymphs of ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        " and attendants of the god ": null
    },
    {
        "Neptune": "neptune"
    },
    {
        ". It was the second and last moon of Neptune to be discovered before the arrival of ": null
    },
    {
        "Voyager 2": "voyager 2"
    },
    {
        " .       Nereid ": null
    },
    {
        "orbits": "orbit"
    },
    {
        " Neptune": "neptune"
    },
    {
        " in the ": null
    },
    {
        "prograde": "retrograde motion"
    },
    {
        " direction at an ": null
    },
    {
        "average distance": "semimajor axis"
    },
    {
        " of , but its high ": null
    },
    {
        "eccentricity": "eccentricity"
    },
    {
        " of 0.7507 takes it as close as  and as far as .     The unusual orbit suggests that it may be either a captured ": null
    },
    {
        "asteroid": "asteroid"
    },
    {
        " or ": null
    },
    {
        "Kuiper belt": "kuiper belt"
    },
    {
        " object, or that it was an inner moon in the past and was perturbed during the capture of Neptunes largest moon ": null
    },
    {
        "Triton": "triton"
    },
    {
        ". If the latter is true, it may be the only survivor of Neptunes original  set of ": null
    },
    {
        "regular satellite": "regular satellite"
    },
    {
        "s.      In 1991, a rotation period of Nereid of about 13.6  hours was determined by an analysis of its light curve. In 2003, another rotation period of about  was measured. However, this determination was later disputed, and other researchers for a time failed to detect any periodic modulation in Nereids light curve from ground-based observations. In 2016, a clear rotation period of 11.594 ± 0.017  hours was determined based on observations with the ": null
    },
    {
        "Kepler space telescope": "kepler"
    },
    {
        ".       Nereid is third-largest of ": null
    },
    {
        "Neptunes satellites": "moons of neptune"
    },
    {
        ", and has an average radius of about . It is rather large for an ": null
    },
    {
        "irregular satellite": "irregular moon"
    },
    {
        ". The shape of Nereid is unknown.     Since 1987 some photometric observations of Nereid have detected large variations of its brightness, which can happen over years and months, but sometimes even over a few days. They persist even after a correction for distance and phase effects. On the other hand, not all astronomers who have observed Nereid have noticed such variations. This means that they may be quite chaotic. To date there is no credible explanation of the variations, but, if they exist, they are likely related to the rotation of Nereid. Nereids rotation could be either in the state of forced ": null
    },
    {
        "precession": "precession"
    },
    {
        " or even chaotic rotation  due to its highly elliptical orbit.     In 2016, extended observations with the Kepler space telescope showed only low-amplitude variations . Thermal modeling based on infrared observations from the ": null
    },
    {
        "Spitzer": "spitzer space telescope"
    },
    {
        " and ": null
    },
    {
        "Herschel": "herschel space observatory"
    },
    {
        " space telescopes suggest that Nereid is only moderately elongated with an ": null
    },
    {
        "aspect ratio": "aspect ratio"
    },
    {
        " of 1.3:1, which disfavors forced precession of the rotation. The thermal model also indicates that the surface roughness of Nereid is very high, likely similar to the Saturnian moon ": null
    },
    {
        "Hyperion": "hyperion"
    },
    {
        ".     ": null
    },
    {
        "Spectrally": "electromagnetic spectrum"
    },
    {
        ", Nereid appears neutral in colour and ": null
    },
    {
        "water ice": "ice"
    },
    {
        " has been detected on its surface. Its spectrum appears to be intermediate between ": null
    },
    {
        "Uranuss": "uranus"
    },
    {
        "moons ": null
    },
    {
        "Titania": "titania"
    },
    {
        " and ": null
    },
    {
        "Umbriel": "umbriel"
    },
    {
        ", which suggests that Nereids surface is composed of a mixture of water ice and some spectrally neutral material. The spectrum is markedly different from ": null
    },
    {
        "minor planets": "minor planet"
    },
    {
        "of the outer solar system, ": null
    },
    {
        "centaurs": "centaur"
    },
    {
        " Pholus": "5145 pholus"
    },
    {
        ", ": null
    },
    {
        "Chiron": "2060 chiron"
    },
    {
        " and ": null
    },
    {
        "Chariklo": "10199 chariklo"
    },
    {
        ", suggesting that Nereid formed around Neptune rather than being a captured body.     ": null
    },
    {
        "Halimede": "halimede"
    },
    {
        ", which displays a similar gray neutral colour, may be a fragment of Nereid that was broken off during a collision.       The only spacecraft to visit Nereid was  Voyager 2 , which passed it at a distance of  between 20 April and 19 August 1989. Voyager 2 obtained 83 images with observation accuracies of  to . Prior to Voyager 2s arrival, observations of Nereid had been limited to ground-based observations that could only establish its intrinsic brightness and orbital elements . Although the images obtained by Voyager 2 do not have a high enough resolution to allow surface features to be distinguished, Voyager 2 was able to measure the size of Nereid and found that it was grey in colour and had a higher albedo than Neptunes other small satellites.       In the Larry Niven book ": null
    },
    {
        "Ringworld": "ringworld"
    },
    {
        ", Nereid is described as having been leased by the ": null
    },
    {
        "Outsiders": "outsider_"
    },
    {
        "  half a millennium ago ": "23rd century"
    },
    {
        ". The protagonist, ": null
    },
    {
        "Louis Wu": "louis wu"
    }
]