[
    {
        "Nervous Man in a Four Dollar Room is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . It originally aired on October 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".     According to the book The Twilight Zone: Unlocking the Door to a Television Classic by Martin Grams, Serling wrote the teleplay in response to a request from CBS to write scripts using as few actors as possible for budgetary purposes. This episode was produced $42 under budget.              An insecure, unsuccessful gangster named Jackie Rhoades  waits in a cheap hotel room for instructions from his boss, George . George gives Jackie a gun and orders him to shoot a barkeeper who has refused to pay for protection. Jackie begs to be given another job, but George flatly refuses and leaves. Terrified, Jackie starts talking to his reflection in the mirror, trying to justify committing murder. He puts a cigarette in his lips but finds no match.     A puff of smoke comes out from the other side of the mirror, and he sees a different version of himself in the reflection: a strong, self-assured, confident Jackie Rhoades. Jackie and his reflection enter a lengthy argument about how his life has turned out as a result of his going along with his peers and never standing up for himself. Finally, the double tells Jackie he wants to take over, that it is his turn to run their life and that he deserves to live. Jackie argues but cannot decide what to do.     George telephones and Jackie nervously assures George that he is on the way to do the job. The double reappears and tries to persuade Jackie to let him out. He knows that disaster will strike if Jackie tries to do the job, and he refuses to let Jackie lead them both to ruin. Angry and panicking, Jackie spins the mirror on the chest of drawers. As the mirror spins, Jackie backs away in terror from the double, who is getting closer to the mirror.     George appears, furious that Jackie has not done his job. He sarcastically explains that the old man Jackie was to shoot is in excellent health and demands: So whatve you got to say for yourself? Jackie calmly looks up at him and answers, Two words. I resign! , emphasizing the point by kicking and punching a stunned George. He picks George up and throws him out of the hotel room, tossing the gun out after him, and tells George to never come back. Ringing the room clerk to check out, he refers to himself as Jackie—JOHN Rhoades. The nervous Jackie, now the one on the other side of the mirror, asks, Whats to do now? John responds, Now we go look for a job. Now maybe we get married. Now maybe we stop biting our nails. John then walks out of the room, looks back at the mirror, and sees only his own confident reflection.       ": null
    }
]