[
    {
        "        Nestorianism is a ": null
    },
    {
        "Christian theological": "christian theology"
    },
    {
        " doctrine that upholds several distinctive teachings in the fields of ": null
    },
    {
        "Christology": "christology"
    },
    {
        " and ": null
    },
    {
        "Mariology": "mariology"
    },
    {
        ". It opposes the concept of ": null
    },
    {
        "hypostatic union": "hypostatic union"
    },
    {
        " and emphasizes that the two natures of ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        " were joined by will rather than personhood. This Christological position is defined as radical dyophysitism. Nestorianism was named after Christian theologian ": null
    },
    {
        "Nestorius": "nestorius"
    },
    {
        " , ": null
    },
    {
        "Patriarch of Constantinople": "ecumenical patriarch of constantinople"
    },
    {
        " from 428 to 431, who was influenced by Christological teachings of ": null
    },
    {
        "Theodore of Mopsuestia": "theodore of mopsuestia"
    },
    {
        " at the ": null
    },
    {
        "School of Antioch": "school of antioch"
    },
    {
        ".     Nestorius teachings brought him into conflict with other prominent church leaders, most notably ": null
    },
    {
        "Cyril of Alexandria": "cyril of alexandria"
    },
    {
        ", who criticized especially his rejection of the title  Theotokos  for ": null
    },
    {
        "Mary": "mary, mother of jesus"
    },
    {
        ", the mother of Jesus, and issued 12 ": null
    },
    {
        "anathemas": "anathema"
    },
    {
        "against him at a council in ": null
    },
    {
        "Rome": "rome"
    },
    {
        " in 430. Nestorius and his teachings were eventually condemned as ": null
    },
    {
        "heretical": "heresy"
    },
    {
        " at the ": null
    },
    {
        "Council of Ephesus": "council of ephesus"
    },
    {
        " in 431, and again at the ": null
    },
    {
        "Council of Chalcedon": "council of chalcedon"
    },
    {
        " in 451, which led to the ": null
    },
    {
        "Nestorian Schism": "nestorian schism"
    },
    {
        "; churches supporting Nestorian teachings broke with the rest of the Christian Church.     Following that, many of Nestoriuss supporters relocated to the ": null
    },
    {
        "Sasanian Empire": "sasanian empire"
    },
    {
        ", where they affiliated with the local Christian community, known as the ": null
    },
    {
        "Church of the East": "church of the east"
    },
    {
        ". However, some such as ": null
    },
    {
        "Sebastian Brock": "sebastian brock"
    },
    {
        " consider referring to the Assyrian Church of the East as the Nestorian Church to be inappropriate and misleading.           Nestorianism is a radical form of dyophysitism, differing from the orthodox ": null
    },
    {
        "dyophysitism": "dyophysitism"
    },
    {
        " on several points, mainly by opposition to the concept of ": null
    },
    {
        "hypostatic union": "hypostatic union"
    },
    {
        ". It can be seen as the antithesis to ": null
    },
    {
        "monophysitism": "monophysitism"
    },
    {
        ", which emerged in reaction to Nestorianism. Where Nestorianism holds that Christ had two loosely united natures, divine and human, monophysitism holds that he had but a single nature, his human nature being absorbed into his divinity. A brief definition of Nestorian ": null
    },
    {
        "Christology": "christology"
    },
    {
        " can be given as: ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " Christ, who is not identical with the Son but personally united with the Son, who lives in him, is one ": null
    },
    {
        "hypostasis": "hypostasis"
    },
    {
        " and one nature: human. Martin Lembke, lecture in the course Meetings with the Worlds Religions , Centre for Theology and Religious Studies, ": null
    },
    {
        "Lund University": "lund university"
    },
    {
        ", Spring Term 2010. This contrasts with Nestorius own teaching that the Word, which is eternal, and the Flesh, which is not, came together in a hypostatic union, Jesus Christ, Jesus thus being both fully man and God, of two  ousia   but of one  prosopon .  Both Nestorianism and monophysitism were condemned as heretical at the ": null
    },
    {
        "Council of Chalcedon": "council of chalcedon"
    },
    {
        ".            Nestoranism was condemned as heresy at the ": null
    },
    {
        "Council of Ephesus": "council of ephesus"
    },
    {
        ". The ": null
    },
    {
        "Armenian Church": "armenian apostolic church"
    },
    {
        " rejected the ": null
    },
    {
        "Council of Chalcedon": "council of chalcedon"
    },
    {
        " because they believed ": null
    },
    {
        "Chalcedonian Definition": "chalcedonian definition"
    },
    {
        " was too similar to Nestorianism. The ": null
    },
    {
        "Persian Nestorian Church": "church of the east"
    },
    {
        ", on the other hand, supported the spread of Nestorianism in ": null
    },
    {
        "Persarmenia": "persarmenia"
    },
    {
        ". The Armenian Church and other eastern churches saw the rise of Nestorianism as a threat to the independence of their Church. ": null
    },
    {
        "Peter the Iberian": "peter the iberian"
    },
    {
        ", a ": null
    },
    {
        "Georgian": "georgian people"
    },
    {
        " prince, also strongly opposed the Chalcedonian Creed.  Thus, in 491, Catholicos ": null
    },
    {
        "Babken I of Armenia": "babken i of armenia"
    },
    {
        ", along with the ": null
    },
    {
        "Albanian": "caucasian albania"
    },
    {
        " and ": null
    },
    {
        "Iberian": "kingdom of iberia"
    },
    {
        " bishops met in ": null
    },
    {
        "Vagharshapat": "mother see of holy etchmiadzin"
    },
    {
        " and issued a condemnation of the Chalcedonian Definition.      Nestorians held that the Council of Chalcedon proved the ": null
    },
    {
        "orthodoxy": "orthodoxy"
    },
    {
        " of their faith and had started persecuting non-Chalcedonian or ": null
    },
    {
        "monophysite": "monophysite"
    },
    {
        " Syrian Christians during the reign of ": null
    },
    {
        "Peroz I": "peroz i"
    },
    {
        ". In response to pleas for assistance from the ": null
    },
    {
        "Syrian Church": "syrian oriental orthodox church"
    },
    {
        ", Armenian ": null
    },
    {
        "prelates": "prelate"
    },
    {
        "issued a letter addressed to Persian Christians reaffirming their condemnation of the Nestorianism as heresy.     Following the exodus to ": null
    },
    {
        "Persia": "persia"
    },
    {
        ", scholars expanded on the teachings of Nestorius and his mentors, particularly after the relocation of the ": null
    },
    {
        "School of Edessa": "school of edessa"
    },
    {
        " to the Persian city of Nisibis  in 489, where it became known as the ": null
    },
    {
        "School of Nisibis": "school of nisibis"
    },
    {
        ". Nestorian monasteries propagating the teachings of the Nisbis school flourished in 6th century Persarmenia.     Despite this initial Eastern expansion, the Nestorians missionary success was eventually deterred. ": null
    },
    {
        "David J. Bosch": "david j. bosch"
    },
    {
        " observes, By the end of the fourteenth century, however, the Nestorian and other churches—which at one time had dotted the landscape of all of Central and even parts of East Asia—were all but wiped out. Isolated pockets of Christianity survived only in India. The religious victors on the vast Central Asian mission field of the Nestorians were ": null
    },
    {
        "Islam": "islam"
    },
    {
        " and ": null
    },
    {
        "Buddhism": "buddhism"
    },
    {
        " .        ": null
    },
    {
        "Nestorius": "nestorius"
    },
    {
        " developed his Christological views as an attempt to understand and explain rationally the incarnation of the divine ": null
    },
    {
        "Logos": "logos"
    },
    {
        ", the Second Person of the Holy Trinity as the man Jesus. He had studied at the ": null
    },
    {
        "School of Antioch": "school of antioch"
    },
    {
        " where his mentor had been ": null
    },
    {
        "Theodore of Mopsuestia": "theodore of mopsuestia"
    },
    {
        "; Theodore and other Antioch theologians had long taught a ": null
    },
    {
        "literalist interpretation of the Bible": "biblical literalism"
    },
    {
        " and stressed the distinctiveness of the human and divine natures of Jesus. Nestorius took his Antiochene leanings with him when he was appointed Patriarch of Constantinople by ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        " emperor ": null
    },
    {
        "Theodosius II": "theodosius ii"
    },
    {
        " in 428.     Nestoriuss teachings became the root of controversy when he publicly challenged the long-used title Theotokos  for Mary. He suggested that the title denied Christs full humanity, arguing instead that Jesus had two persons , the divine Logos and the human Jesus. As a result of this prosopic duality, he proposed  Christotokos   as a more suitable title for Mary.     Nestorius opponents found his teaching too close to the heresy of ": null
    },
    {
        "adoptionism": "adoptionism"
    },
    {
        " – the idea that Christ had been born a man who had later been adopted as Gods son. Nestorius was especially criticized by ": null
    },
    {
        "Cyril": "cyril of alexandria"
    },
    {
        ", ": null
    },
    {
        "Patriarch of Alexandria": "patriarch of alexandria"
    },
    {
        ", who argued that Nestoriuss teachings undermined the unity of Christs divine and human natures at the ": null
    },
    {
        "Incarnation": "incarnation"
    },
    {
        ". Some of Nestoriuss opponents argued that he put too much emphasis on the human nature of Christ, and others debated that the difference that Nestorius implied between the human nature and the divine nature created a fracture in the singularity of Christ, thus creating two Christ figures.  Nestorius himself always insisted that his views were orthodox, though they were deemed ": null
    },
    {
        "heretical": "heresy"
    },
    {
        " at the Council of Ephesus in 431, leading to the Nestorian Schism, when churches supportive of Nestorius and the rest of the Christian Church separated. A more elaborate Nestorian theology developed from there, which came to see Christ as having two natures united, or hypostases,   the divine Logos and the human Christ. However, this formulation was never adopted by all churches termed Nestorian . Indeed, the modern Assyrian Church of the East, which reveres Nestorius, does not fully subscribe to Nestorian doctrine, though it does not employ the title Theotokos. .  Encyclopædia Britannica . Retrieved January 29, 2010.             Nestorianism became a distinct sect following the ": null
    },
    {
        "Nestorian Schism": "nestorian schism"
    },
    {
        ", beginning in the 430s. Nestorius had come under fire from Western theologians, most notably ": null
    },
    {
        "Cyril of Alexandria": "cyril of alexandria"
    },
    {
        ". Cyril had both theological and political reasons for attacking Nestorius; on top of feeling that Nestorianism was an error against true belief, he also wanted to denigrate the head of a competing patriarchate. Cyril and Nestorius asked ": null
    },
    {
        "Pope Celestine I": "pope celestine i"
    },
    {
        " to weigh in on the matter. Celestine found that the title Theotokos was orthodox, and authorized Cyril to ask Nestorius to recant. Cyril, however, used the opportunity to further attack Nestorius, who pleaded with Emperor ": null
    },
    {
        "Theodosius II": "theodosius ii"
    },
    {
        " to call a council so that all grievances could be aired.     In 431 Theodosius called the Council of Ephesus. However, the council ultimately sided with Cyril, who held that the Christ contained two natures in one divine person , and that the Virgin Mary, conceiving and bearing this divine person, is truly called the Mother of God . The council accused Nestorius of ": null
    },
    {
        "heresy": "heresy"
    },
    {
        ", and deposed him as patriarch.  Upon returning to his monastery in 436, he was banished to Upper Egypt. Nestorianism was officially anathematized, a ruling reiterated at the ": null
    },
    {
        "Council of Chalcedon": "council of chalcedon"
    },
    {
        " in 451. However, a number of churches, particularly those associated with the ": null
    },
    {
        "School of Edessa": "school of edessa"
    },
    {
        ", supported Nestorius – though not necessarily his doctrine – and broke with the churches of the West. Many of Nestorius supporters relocated to the Sasanian Empire of Iran, home to a vibrant but persecuted Christian minority. . Encyclopædia Britannica. Retrieved January 28, 2010. In Upper Egypt, Nestorius wrote his Book of Heraclides, responding to the two councils at Ephesus .                    Persia had long been home to Christian communities that had been persecuted by the ": null
    },
    {
        "Zoroastrian": "zoroastrianism"
    },
    {
        " majority, which had accused local Christians of pro-Roman leanings. In 424, the Church in Persia declared itself independent of the Byzantine Church and all other churches, in order to ward off allegations of foreign allegiance. Following the Nestorian Schism, the Persian Church increasingly aligned itself with the Nestorians, a measure encouraged by the Zoroastrian ruling class. The Persian Church became increasingly Nestorian in doctrine over the next decades, furthering the divide between ": null
    },
    {
        "Chalcedonian Christianity": "chalcedonian christianity"
    },
    {
        " and the Nestorians. In 486 the Metropolitan of Nisibis, ": null
    },
    {
        "Barsauma": "barsauma"
    },
    {
        ", publicly accepted Nestorius mentor, ": null
    },
    {
        "Theodore of Mopsuestia": "theodore of mopsuestia"
    },
    {
        ", as a spiritual authority. In 489 when the School of Edessa in ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        " was closed by Byzantine Emperor ": null
    },
    {
        "Zeno": "zeno"
    },
    {
        " for its Nestorian teachings, the school relocated to its original home of Nisibis, becoming again the School of Nisibis, leading to a wave of Nestorian immigration into Persia. The Persian patriarch ": null
    },
    {
        "Babai": "babai"
    },
    {
        " reiterated and expanded upon the churchs esteem for Theodore, solidifying the churchs adoption of Nestorianism.      Now firmly established in Iran, with centers in Nisibis, ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        ", and ": null
    },
    {
        "Gundeshapur": "gundeshapur"
    },
    {
        ", and several ": null
    },
    {
        "metropoleis": "metropolis"
    },
    {
        ", the Nestorian Persian Church began to branch out beyond the Sasanian Empire. However, through the sixth century, the church was frequently beset with internal strife and persecution by Zoroastrians. The infighting led to a schism, which lasted from 521 until around 539 when the issues were resolved. However, immediately afterward Roman-Persian conflict led to the persecution of the church by the Sassanid emperor ": null
    },
    {
        "Khosrow I": "khosrow i"
    },
    {
        "; this ended in 545. The church survived these trials under the guidance of Patriarch ": null
    },
    {
        "Aba I": "aba i"
    },
    {
        ", who had converted to Christianity from Zoroastrianism.     The church emerged stronger after this period of ordeal, and increased missionary efforts farther afield. Missionaries established dioceses in the ": null
    },
    {
        "Arabian Peninsula": "arabian peninsula"
    },
    {
        " and ": null
    },
    {
        "India": "india"
    },
    {
        " . They made some advances in ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", despite the strong ": null
    },
    {
        "miaphysite": "miaphysite"
    },
    {
        " presence there. , page 62. Missionaries entered ": null
    },
    {
        "Central Asia": "central asia"
    },
    {
        " and had significant success converting local ": null
    },
    {
        "Turkic": "turkic peoples"
    },
    {
        " tribes. Nestorian missionaries were firmly established in China during the early part of the ": null
    },
    {
        "Tang dynasty": "tang dynasty"
    },
    {
        " ; the Chinese source known as the ": null
    },
    {
        "Nestorian Stele": "nestorian stele"
    },
    {
        " records a mission under a Persian proselyte named ": null
    },
    {
        "Alopen": "alopen"
    },
    {
        " as introducing Nestorian Christianity to China in 635. Following the ": null
    },
    {
        "Muslim conquest of Persia": "muslim conquest of persia"
    },
    {
        ", completed in 644, the Persian Church became a  dhimmi  community under the ": null
    },
    {
        "Rashidun Caliphate": "rashidun caliphate"
    },
    {
        ". The church and its communities abroad grew larger under the Caliphate. By the 10th century it had 15 metropolitan sees within the Caliphates territories, and another five elsewhere, including in China and India. After that time, however, Nestorianism went into decline.     Sebastian Brock, ": null
    },
    {
        "Fellow of the British Academy": "fellow of the british academy"
    },
    {
        " published an article in a 1996 journal and stated that the term Nestorian when applied to the Assyrian Church of the East is both inappropriate and misleading.       ": null
    },
    {
        "Sebastian Brock": "sebastian brock"
    },
    {
        ", in a 1996 article published in the ": null
    },
    {
        "Bulletin of the John Rylands Library": "bulletin of the john rylands library"
    },
    {
        ", wrote that ..the term Nestorian Church has become the standard designation for the ancient oriental church which in the past called itself The Church of the East, but which today prefers the fuller title The ": null
    },
    {
        "Assyrian Church of the East": "assyrian church of the east"
    },
    {
        ". Such a designation is not only discourteous to modern members of this venerable church, but also--as this paper aims to show--both inappropriate and misleading.     In a 2017 paper, ": null
    },
    {
        "Mar Awa Royel": "mar awa royel"
    },
    {
        ", Bishop of the Assyrian Church of the East, stated the position of the ": null
    },
    {
        "Assyrian Church": "assyrian church of the east"
    },
    {
        ": After the ": null
    },
    {
        "Council of Ephesus ": "council of ephesus"
    },
    {
        ", when the ": null
    },
    {
        "Nestorius": "nestorius"
    },
    {
        " the ": null
    },
    {
        "patriarch of Constantinople": "ecumenical patriarch of constantinople"
    },
    {
        " was condemned for his views on the unity of the Godhead and the humanity in Christ, the Church of the East was branded as Nestorian on account of its refusal to anathematize the patriarch. ": null
    }
]