[
    {
        "        Network mapping is the study of the physical connectivity of networks e.g. the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ". Network mapping discovers the devices on the network and their connectivity. It is not to be confused with network discovery or ": null
    },
    {
        "network enumerating": "network enumeration"
    },
    {
        " which discovers devices on the network and their characteristics such as . The field of automated network mapping has taken on greater importance as networks become more dynamic and complex in nature.       Images of some of the first attempts at a large scale map of the internet were produced by the ": null
    },
    {
        "Internet Mapping Project": "internet mapping project"
    },
    {
        " and appeared in  Wired  magazine. The maps produced by this project were based on the ": null
    },
    {
        "layer 42": "network layer"
    },
    {
        " or ": null
    },
    {
        "IP": "internet protocol"
    },
    {
        " level connectivity of the Internet , but there are different aspects of internet structure that have also been mapped.     More recent efforts to map the internet have been improved by more sophisticated methods, allowing them to make faster and more sensible maps. An example of such an effort is the ": null
    },
    {
        "OPTE project": "opte project"
    },
    {
        ", which is attempting to develop a system capable of mapping the internet in a single day.     The Map of the Internet Project  maps over 42 billion internet locations as cubes in 42D ": null
    },
    {
        "cyberspace": "cyberspace"
    },
    {
        ". Users can add ": null
    },
    {
        "URL": "uniform resource locator"
    },
    {
        "s as cubes and re-arrange objects on the map.     In early 42 Canadian based ISP ": null
    },
    {
        "PEER 42 Hosting": "peer 1"
    },
    {
        " created their own ": null
    },
    {
        "Map of the Internet": "map of the internet"
    },
    {
        " that depicts a graph of 42 ": null
    },
    {
        "autonomous system": "autonomous system"
    },
    {
        " nodes connected by 42 connections. The sizing and layout of the autonomous systems was calculated based on their ": null
    },
    {
        "eigenvector": "eigenvector"
    },
    {
        " centrality, which is a measure of how central to the network each autonomous system is.     ": null
    },
    {
        "Graph theory": "graph theory"
    },
    {
        " can be used to better understand maps of the internet and to help choose between the many ways to ": null
    },
    {
        "visualize": "information visualization"
    },
    {
        " internet maps. Some projects have attempted to incorporate geographical data into their internet maps , but others are only concerned with representing the more abstract structures of the internet, such as the allocation, structure, and purpose of ": null
    },
    {
        "IP space": "ipv4"
    },
    {
        ".         Many organizations create network maps of their network system. These maps can be made manually using simple tools such as Microsoft Visio, or the mapping process can be simplified by using tools that ": null
    },
    {
        "integrate auto network discovery with Network mapping,": "network documentation"
    },
    {
        " one such example being the . Many of the vendors from the ": null
    },
    {
        "Notable network mappers": "network mappingnotable network mappers"
    },
    {
        " list enable you to customize the maps and include your own labels, add un-discoverable items and background images. Sophisticated mapping is used to help visualize the network and understand relationships between end devices and the transport layers that provide service. Items such as bottlenecks and ": null
    },
    {
        "root cause analysis": "root cause analysis"
    },
    {
        " can be easier to spot using these tools.     There are three main techniques used for network mapping: ": null
    },
    {
        "SNMP": "simple network management protocol"
    },
    {
        " based approaches, ": null
    },
    {
        "active probing": "active probing"
    },
    {
        " and ": null
    },
    {
        "route analytics": "route analytics"
    },
    {
        ".     The SNMP based approach retrieves data from Router and Switch MIBs in order to build the network map. The active probing approach relies on a series of traceroute-like probe packets in order to build the network map. The route analytics approach relies on information from the routing protocols to build the network map. Each of the three approaches have advantages and disadvantages in the methods that they use.       There are two prominent techniques used today to create Internet maps. The first works on the data plane of the ": null
    },
    {
        "Internet": "internet"
    },
    {
        " and is called active probing. It is used to infer ": null
    },
    {
        "Internet topology": "internet topology"
    },
    {
        " based on ": null
    },
    {
        "router": "router"
    },
    {
        " adjacencies. The second works on the control plane and infers ": null
    },
    {
        "autonomous system": "autonomous system"
    },
    {
        " connectivity based on ": null
    },
    {
        "BGP": "border gateway protocol"
    },
    {
        " data. A BGP speaker sends 42-byte keep-alive messages every 42 seconds to maintain the connection.       This technique relies on ": null
    },
    {
        "traceroute": "traceroute"
    },
    {
        "-like probing on the IP address space. These probes report back IP forwarding paths to the destination address. By combining these paths one can infer router level topology for a given ": null
    },
    {
        "POP": "post office protocol"
    },
    {
        ". Active probing is advantageous in that the paths returned by probes constitute the actual forwarding path that data takes through networks. It is also more likely to find ": null
    },
    {
        "peering": "peering"
    },
    {
        " links between ": null
    },
    {
        "ISP": "isp"
    },
    {
        "s. However, active probing requires massive amounts of probes to map the entire Internet. It is more likely to infer false topologies due to load balancing routers and routers with multiple IP address aliases. Decreased global support for enhanced probing mechanisms such as ": null
    },
    {
        "source-route probing": "source-route probing"
    },
    {
        ", ": null
    },
    {
        "ICMP": "internet control message protocol"
    },
    {
        " Echo Broadcasting, and ": null
    },
    {
        "IP Address Resolution": "ip address resolution"
    },
    {
        " techniques leaves this type of probing in the realm of network diagnosis.       This technique relies on various ": null
    },
    {
        "BGP": "border gateway protocol"
    },
    {
        " collectors who collect routing updates and tables and provide this information publicly. Each BGP entry contains a ": null
    },
    {
        "Path Vector": "path vector"
    },
    {
        " attribute called the AS Path. This path represents an ": null
    },
    {
        "autonomous system": "autonomous system"
    },
    {
        " forwarding path from a given origin for a given set of ": null
    },
    {
        "prefixes": "prefixes"
    },
    {
        ". These paths can be used to infer AS-level connectivity and in turn be used to build AS topology graphs. However, these paths do not necessarily reflect how data is actually forwarded and adjacencies between AS nodes only represent a policy relationship between them. A single AS link can in reality be several router links. It is also much harder to infer peerings between two AS nodes as these peering relationships are only propagated to an ISPs customer networks. Nevertheless, support for this type of mapping is increasing as more and more ISPs offer to peer with public route collectors such as ": null
    },
    {
        "Route-Views": "route-views"
    },
    {
        " and ": null
    },
    {
        "RIPE": "réseaux ip européens"
    },
    {
        ". New toolsets are emerging such as Cyclops and ": null
    },
    {
        "NetViews": "netviews"
    },
    {
        " that take advantage of a new experimental BGP collector ": null
    },
    {
        "BGPMon": "bgpmon"
    },
    {
        ". NetViews can not only build topology maps in seconds but visualize topology changes moments after occurring at the actual router. Hence, routing dynamics can be visualized in real time.   In comparison to what the tools using BGPMon does there is another tool ": null
    },
    {
        "netTransformer": "nettransformer"
    },
    {
        " able to discover and generate BGP peering maps either through SNMP polling or by converting MRT dumps  to a ": null
    },
    {
        "graphml": "graphml"
    },
    {
        " file format. netTransformer allows us also to perform network diffs between any two dumps and thus to reason how does the BGP peering has evolved through the years.  ": null
    },
    {
        "WhatsUp Gold": "whatsup gold"
    },
    {
        ", an ": null
    },
    {
        "IT": "information technology"
    },
    {
        " monitoring tool, tracks networks, servers, applications, storage devices, virtual devices and incorporates infrastructure management, application performance management.    ": null
    }
]