[
    {
        "Neural Darwinism, a large scale theory of ": null
    },
    {
        "brain function": "brain function"
    },
    {
        " by ": null
    },
    {
        "Gerald Edelman": "gerald edelman"
    },
    {
        ", was initially published in 1978, in a book called The Mindful Brain . It was extended and published in the 1987 book Neural Darwinism – The Theory of Neuronal Group Selection.     In 1972, Edelman was awarded the ": null
    },
    {
        "Nobel Prize": "nobel prize"
    },
    {
        " in Medicine or Physiology for his work in immunology showing how the population of ": null
    },
    {
        "lymphocytes": "lymphocyte"
    },
    {
        "capable of binding to a foreign ": null
    },
    {
        "antigen": "antigen"
    },
    {
        " is increased by differential clonal multiplication following antigen discovery. Essentially, this proved that the human body is capable of creating ": null
    },
    {
        "complex adaptive systems": "complex systems"
    },
    {
        " as a result of local events with feedback. Edelmans interest in selective systems expanded into the fields of ": null
    },
    {
        "neurobiology": "neurobiology"
    },
    {
        " and ": null
    },
    {
        "neurophysiology": "neurophysiology"
    },
    {
        ", and in Neural Darwinism, Edelman puts forth a theory called neuronal group selection . It contains three major parts:   Anatomical connectivity in the brain occurs via selective mechanochemical events that take place ": null
    },
    {
        "epigenetic": "epigenetic"
    },
    {
        "ally during development. This creates a diverse primary repertoire by differential reproduction.   Once structural diversity is established anatomically, a second selective process occurs during ": null
    },
    {
        "postnatal": "postnatal"
    },
    {
        " behavioral experience through epigenetic modifications in the strength of ": null
    },
    {
        "synaptic": "synapse"
    },
    {
        " connections between neuronal groups. This creates a diverse secondary repertoire by differential amplification.   ": null
    },
    {
        "Reentrant": "reentry"
    },
    {
        " signaling between neuronal groups allows for spatiotemporal continuity in response to real-world interactions. In The Remembered Present and later, Bright Air, Brilliant Fire: On the Matter of the Mind and A Universe of Consciousness: How Matter Becomes Imagination , Edelman argues that thalamocortical and corticocortical reentrant signaling are critical to generating and maintaining conscious states in mammals.       With neuronal heterogeneity , it is possible to test the many circuits with a diverse set of inputs, to see which neuronal groups respond appropriately statistically. Functional distributed ": null
    },
    {
        "brain circuits": "neuronal circuit"
    },
    {
        " thus emerge as a result.     Edelman goes into some detail about how ": null
    },
    {
        "brain development": "brain development"
    },
    {
        " depends on a variety of ": null
    },
    {
        "cell adhesion molecules": "cell adhesion molecules"
    },
    {
        " and ": null
    },
    {
        "substrate adhesion molecules": "substrate adhesion molecules"
    },
    {
        " on cell surfaces which allow cells to dynamically control their intercellular binding properties. This surface modulation allows cell collectives to effectively signal as the group aggregates, which helps govern ": null
    },
    {
        "morphogenesis": "morphogenesis"
    },
    {
        ". So morphology depends on CAM and SAM function. And CAM and SAM function also depend on developing morphology.     Edelman theorized that ": null
    },
    {
        "cell proliferation": "cell proliferation"
    },
    {
        ", ": null
    },
    {
        "cell migration": "cell migration"
    },
    {
        ", ": null
    },
    {
        "cell death": "cell death"
    },
    {
        ", neuron arbor distribution, and ": null
    },
    {
        "neurite": "neurite"
    },
    {
        " branching are also governed by similar selective processes.       Once the basic variegated anatomical structure of the brain is laid down during early development, it is more or less fixed. But given the numerous and diverse collection of available circuitry, there are bound to be functionally equivalent albeit anatomically non-": null
    },
    {
        "isomorphic": "isomorphic"
    },
    {
        " neuronal groups capable of responding to certain sensory input. This creates a competitive environment where circuit groups proficient in their responses to certain inputs are chosen through the enhancement of the synaptic ": null
    },
    {
        "efficacies": "efficacy"
    },
    {
        " of the selected network. This leads to an increased probability that the same network will respond to similar or identical signals at a future time. This occurs through the strengthening of neuron-to-neuron synapses. And these adjustments allow for ": null
    },
    {
        "neural plasticity": "neural plasticity"
    },
    {
        " along a fairly quick timetable.            The last part of the theory attempts to explain how we experience spatiotemporal consistency in our interaction with environmental stimuli. Edelman called it ": null
    },
    {
        "reentry": "reentry"
    },
    {
        " and proposes a model of reentrant signaling whereby a disjunctive, multimodal sampling of the same stimulus event correlated in time leads to self-organizing intelligence. Put another way, multiple neuronal groups can be used to sample a given stimulus set in parallel and communicate between these disjunctive groups with incurred latency.       It has been suggested that ": null
    },
    {
        "Friedrich Hayek": "friedrich hayek"
    },
    {
        " had earlier proposed a similar idea in his book The Sensory Order: An Inquiry into the Foundations of Theoretical Psychology, published in 1952 . Other leading proponents include ": null
    },
    {
        "Jean-Pierre Changeux": "jean-pierre changeux"
    },
    {
        ", ": null
    },
    {
        "Daniel Dennett": "daniel dennett"
    },
    {
        " and ": null
    },
    {
        "Linda B. Smith": "linda b. smith"
    },
    {
        ". ": null
    },
    {
        "William Calvin": "william h. calvin"
    },
    {
        " proposes true replication in the brain, whereas Edelman opposes the idea that there are true replicators in the brain.       Criticism of Neural ": null
    },
    {
        "Darwinism": "darwinism"
    },
    {
        " was made by ": null
    },
    {
        "Francis Crick": "francis crick"
    },
    {
        " on the basis that neuronal groups are instructed by the environment rather than undergoing blind variation. A recent review by Fernando, Szathmary and Husbands explains why Edelmans Neural Darwinism is not Darwinian because it does not contain units of evolution as defined by ": null
    },
    {
        "John Maynard Smith": "john maynard smith"
    },
    {
        ". It is selectionist in that it satisfies the ": null
    },
    {
        "Price equation": "price equation"
    },
    {
        ", but there is no mechanism in Edelmans theory that explains how information can be transferred between neuronal groups. Fernando, Szathmary & Husbands, 2012 A recent theory called Evolutionary Neurodynamics being developed by ": null
    },
    {
        "Eors Szathmary": "eors szathmary"
    },
    {
        " and Chrisantha Fernando has proposed several means by which true replication may take place in the brain. Fernando, Karishma & Szathmary, 2008 These neuronal models have been extended by Fernando in a later paper. Fernando, 2013 In the most recent model, three plasticity mechanisms i": null
    }
]