[
    {
        "              The Neva  is a ": null
    },
    {
        "river": "river"
    },
    {
        " in northwestern ": null
    },
    {
        "Russia": "russia"
    },
    {
        " flowing from ": null
    },
    {
        "Lake Ladoga": "lake ladoga"
    },
    {
        " through the western part of ": null
    },
    {
        "Leningrad Oblast": "leningrad oblast"
    },
    {
        "  to the ": null
    },
    {
        "Neva Bay": "neva bay"
    },
    {
        " of the ": null
    },
    {
        "Gulf of Finland": "gulf of finland"
    },
    {
        ". Despite its modest length of , it is the fourth largest river in ": null
    },
    {
        "Europe": "europe"
    },
    {
        " in terms of average ": null
    },
    {
        "discharge": "discharge"
    },
    {
        " .     The Neva is the only river flowing from Lake Ladoga. It flows through the city of ": null
    },
    {
        "Saint Petersburg": "saint petersburg"
    },
    {
        ", three smaller towns of ": null
    },
    {
        "Shlisselburg": "shlisselburg"
    },
    {
        ", ": null
    },
    {
        "Kirovsk": "kirovsk, leningrad oblast"
    },
    {
        " and ": null
    },
    {
        "Otradnoye": "otradnoye, kirovsky district, leningrad oblast"
    },
    {
        ", and dozens of settlements. The river is navigable throughout and is part of the ": null
    },
    {
        "Volga–Baltic Waterway": "volga–baltic waterway"
    },
    {
        " and ": null
    },
    {
        "White Sea – Baltic Canal": "white sea – baltic canal"
    },
    {
        ". It is a site of numerous major historical events, including the ": null
    },
    {
        "Battle of the Neva": "battle of the neva"
    },
    {
        " in 1240 which gave ": null
    },
    {
        "Alexander Nevsky": "alexander nevsky"
    },
    {
        " his name, the founding of Saint Petersburg in 1703, and the ": null
    },
    {
        "Siege of Leningrad": "siege of leningrad"
    },
    {
        " by the German army during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". The Neva river played a vital role in trade between ": null
    },
    {
        "Byzantium": "byzantium"
    },
    {
        " and ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        ".       The area of the Neva river was originally inhabited by ": null
    },
    {
        "Finnic people": "baltic finns"
    },
    {
        ". The word neva is widely spread in ": null
    },
    {
        "Finnic languages": "finnic languages"
    },
    {
        " with similar meanings. In ": null
    },
    {
        "Finnish": "finnish language"
    },
    {
        "  it means ": null
    },
    {
        "poor fen": "poor fen"
    },
    {
        ", in ": null
    },
    {
        "Karelian": "karelian language"
    },
    {
        "  watercourse and in ": null
    },
    {
        "Estonian": "estonian language"
    },
    {
        "  waterway.      It has also been argued that the name derives from the ": null
    },
    {
        "Indo-European": "indo-european languages"
    },
    {
        " adjective newā which means new. The river began to flow around 1350 BC. However, the place names of the area dont support any Indo-European influence in the area before Scandinavian traders and Slavs started to enter the region in the 8th Century CE.           In the ": null
    },
    {
        "Paleozoic": "paleozoic"
    },
    {
        ", 300–400 million years ago, the entire territory of the modern delta of the Neva River was covered by a sea. Modern relief was formed as a result of glacier activity. Its retreat formed the ": null
    },
    {
        "Littorina Sea": "littorina sea"
    },
    {
        ", the water level of which was some  higher than the present level of the Baltic Sea. Then, the ": null
    },
    {
        "Tosna River": "tosna river"
    },
    {
        " was flowing in the modern bed of the Neva, from east to west into the Litorinal Sea. In the north of the ": null
    },
    {
        "Karelian Isthmus": "karelian isthmus"
    },
    {
        ", the Littorina Sea united by a wide strait with ": null
    },
    {
        "Lake Ladoga": "lake ladoga"
    },
    {
        ". The ": null
    },
    {
        "Mga River": "mga river"
    },
    {
        " then flowed to the east, into Lake Ladoga, near the modern source of the Neva River; the Mga then was separated from the basin of the Tosna.      Near the modern Lake Ladoga, land rose faster, and a closed reservoir was formed. Its water level began to rise, eventually flooded the valley of Mga and broke into the valley of the river Tosna. The Ivanovo ": null
    },
    {
        "rapids": "rapid"
    },
    {
        "of the modern Neva were created in the breakthrough area. So about 2000 BC the Neva was created with its tributaries Tosna and Mga. According to some newer data, it happened at 1410–1250 BC making the Neva a rather young river.  The valley of Neva is formed by glacial and post-glacial sediments and it did not change much over the past 2500 years.  The delta of Neva was formed at that time, which is actually pseudodelta, as it was formed not by accumulation of river material but by plunging into the past sediments. St. Petersburg: Encyclopedia. – Moscow: Russian Political Encyclopedia. 2006        The Neva flows out of Lake Ladoga near ": null
    },
    {
        "Shlisselburg": "shlisselburg"
    },
    {
        ", flows through the ": null
    },
    {
        "Neva Lowland": "neva lowland"
    },
    {
        " and discharges into the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        " in the ": null
    },
    {
        "Gulf of Finland": "gulf of finland"
    },
    {
        ". It has a length of , and the shortest distance from the source to the mouth is . The river banks are low and steep, on average about  and  at the mouth. There are three sharp turns: the ": null
    },
    {
        "Ivanovskye rapids": "ivanovskye rapids"
    },
    {
        ", at Nevsky Forest Park of the Ust-Slavyanka region and near the ": null
    },
    {
        "Smolny Institute": "smolny institute"
    },
    {
        ", below the mouth of the river ": null
    },
    {
        "Ohta": "okhta river"
    },
    {
        ". The river declines  in elevation between source and mouth. At one point the river crosses a ": null
    },
    {
        "moraine": "moraine"
    },
    {
        " ridge and forms the Ivanovskye rapids. There, at the beginning of the rapids, is the narrowest part of the river: . The average flow rate in the rapids is about . The average width along the river is . The widest places, at , are in the delta, near the gates of the marine trading port, at the end of the Ivanovskye rapids near the confluence of the river Tosna, and near the island Fabrinchny near the source. The average depth is ; the maximum of  is reached above the ": null
    },
    {
        "Liteyny Bridge": "liteyny bridge"
    },
    {
        ", and the minimum of  is in Ivanovskye rapids.      In the area of Neva basin, rainfall greatly exceeds evaporation; the latter accounts for only 37.7  percent of the water consumption from Neva and the remaining 62.3  percent is water runoff.  Since 1859, the largest volume of  was observed in 1924 and the lowest in 1900 at . The average annual discharge is  or  on average.  Because of the uniform water-flow from Lake Ladoga to the Neva over the whole year, there are almost no floods and corresponding water rise in the spring. The Neva freezes throughout from early December to early April. The ice thickness is  within Saint Petersburg and  in other areas. Ice congestion may form in winter in the upper reaches of the river, this sometimes causes upstream floods. Of the total ice volume of Lake Ladoga, , less than 5  percent enters the Neva. The average summer water temperature is , and the swimming season lasts only about 1.5 months. The water is fresh, with medium turbidity; the average salinity is 61.3  mg/L and the ": null
    },
    {
        "calcium bicarbonate": "calcium bicarbonate"
    },
    {
        " content is 7  mg/L.                 The basin area of Neva is 5,000  km²,  including the pools of Lake Ladoga and Onega . The basin contains 26,300 lakes and has a complex hydrological network of more than 48,300 rivers, however only 26 flow directly into Neva. The main tributaries are Mga, Tosna, ": null
    },
    {
        "Izhora": "izhora river"
    },
    {
        ", ": null
    },
    {
        "Slavyanka": "slavyanka river"
    },
    {
        " and Murzinka on the left, and ": null
    },
    {
        "Okhta": "okhta river, neva basin"
    },
    {
        " and ": null
    },
    {
        "Chernaya River": "chernaya river"
    },
    {
        " on the right side of Neva.     The hydrological network had been altered by the development of St. Petersburg through its entire history. When it was founded in 1703, the area was low and swampy and required construction of canals and ponds for drainage. The earth excavated during their construction was used to raise the city. At the end of the 19th century, the delta of Neva consisted of 48 rivers and canals and 101 islands. The most significant distributaries of the delta are listed in the table. Before construction of the ": null
    },
    {
        "Obvodny Canal": "obvodny canal"
    },
    {
        ", the left tributary of that area was Volkovka River; its part at the confluence is now called Monastyrka River. The ": null
    },
    {
        "Ladoga Canal": "ladoga canal"
    },
    {
        " starts at the root of Neva and connects it along the southern coast of Lake Ladoga with ": null
    },
    {
        "Volkhov River": "volkhov river"
    },
    {
        ".     Some canals of the delta were filled over time, so that only 42 islands remained by 1972, all within the city limits of St. Petersburg. The largest islands are ": null
    },
    {
        "Vasilievsky": "vasilievsky island"
    },
    {
        " at , ": null
    },
    {
        "Petrogradsky": "petrogradsky island"
    },
    {
        " at , ": null
    },
    {
        "Krestovsky": "krestovsky island"
    },
    {
        " at , and ": null
    },
    {
        "Dekabristov": "dekabristov island"
    },
    {
        " at ; others include ": null
    },
    {
        "Zayachy": "zayachy island"
    },
    {
        ", Yelagin and ": null
    },
    {
        "Kamenny Island": "kamenny island"
    },
    {
        "s. At the source of the Neva, near Shlisselburg, there are the two small islands of Orekhovy and Fabrichny. Island Glavryba lies up the river, above the town of ": null
    },
    {
        "Otradnoye": "otradnoye, kirovsky district, leningrad oblast"
    },
    {
        ".                 There is almost no aquatic vegetation in Neva. The river banks mostly consist of sand, ": null
    },
    {
        "podsol": "podsol"
    },
    {
        ", ": null
    },
    {
        "gleysols": "gleysols"
    },
    {
        ", ": null
    },
    {
        "peat": "peat"
    },
    {
        " and boggy peat soils.  Several centuries ago, the whole territory of the Neva lowland was covered by ": null
    },
    {
        "pine": "pine"
    },
    {
        " and ": null
    },
    {
        "spruce": "norway spruce"
    },
    {
        " moss": "moss"
    },
    {
        "y forests. They were gradually reduced by the fires and cutting for technical needs. Extensive damage was caused during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ": in St. Petersburg, the forests were reduced completely, and in the upper reaches down to 40 to 50  percent. Darinskii, A. V. . Lenizdat, pp. 48–49 Forest were replanted after the war with spruce, pine, ": null
    },
    {
        "cedar": "cedrus"
    },
    {
        ", ": null
    },
    {
        "Siberian larch": "larix sibirica"
    },
    {
        ", ": null
    },
    {
        "oak": "oak"
    },
    {
        ", ": null
    },
    {
        "Norway maple": "acer platanoides"
    },
    {
        ", ": null
    },
    {
        "elm": "elm"
    },
    {
        ", America, ": null
    },
    {
        "ash": "fraxinus"
    },
    {
        ", ": null
    },
    {
        "apple": "apple"
    },
    {
        " tree, ": null
    },
    {
        "mountain ash": "mountain ash"
    },
    {
        " and other species. The shrubs include ": null
    },
    {
        "barberry": "berberis"
    },
    {
        ", ": null
    },
    {
        "lilac": "syringa"
    },
    {
        ", ": null
    },
    {
        "jasmine": "jasmine"
    },
    {
        ", ": null
    },
    {
        "hazel": "hazel"
    },
    {
        ", ": null
    },
    {
        "honeysuckle": "honeysuckle"
    },
    {
        ", ": null
    },
    {
        "hawthorn": "crataegus"
    },
    {
        ", ": null
    },
    {
        "rose hip": "rose hip"
    },
    {
        ", ": null
    },
    {
        "viburnum": "viburnum"
    },
    {
        ", ": null
    },
    {
        "juniper": "juniper"
    },
    {
        ", ": null
    },
    {
        "elder": "sambucus"
    },
    {
        ", ": null
    },
    {
        "shadbush": "amelanchier"
    },
    {
        " and many others. Lihotkin, G. and Milash, N. . . aroundspb.ru.      Nowadays, the upper regions of the river are dominated by ": null
    },
    {
        "birch": "birch"
    },
    {
        " and pine-birch grass-shrub forests and in the middle regions there are swampy pine forests. In St. Petersburg, along the Neva, there are many gardens and parks, including the ": null
    },
    {
        "Summer Garden": "summer garden"
    },
    {
        ", ": null
    },
    {
        "Field of Mars": "field of mars"
    },
    {
        ", Rumyantsev, ": null
    },
    {
        "Smolny": "smolny convent"
    },
    {
        ", ": null
    },
    {
        "Alexander Garden": "alexander garden"
    },
    {
        "s, Garden of the ": null
    },
    {
        "Alexander Nevsky Lavra": "alexander nevsky lavra"
    },
    {
        " and many others. Историко-географический атлас «Ленинград» Moscow: GUGK CM USSR, 1977     Because of the rapid flow, cold water and lack of quiet pools and aquatic vegetation the diversity of fish species in Neva is small. Permanent residents include such undemanding to environment species as ": null
    },
    {
        "perch": "perch"
    },
    {
        ", ": null
    },
    {
        "ruffe": "ruffe"
    },
    {
        " and ": null
    },
    {
        "roaches": "rutilus"
    },
    {
        ". Many fish species are transitory, of which commercial value have ": null
    },
    {
        "smelt": "european smelt"
    },
    {
        ", ": null
    },
    {
        "vendace": "coregonus albula"
    },
    {
        " and partly ": null
    },
    {
        "salmon": "salmonidae"
    },
    {
        ".  . nevariver.ru          Floods in St. Petersburg are usually caused by the overflow of the delta of Neva and by surging water in the eastern part of ": null
    },
    {
        "Neva Bay": "neva bay"
    },
    {
        ". They are registered when the water rises above  with respect to a gauge at the ": null
    },
    {
        "Mining Institute": "saint petersburg mining institute"
    },
    {
        ". More than 300 floods occurred after the city was founded in 1703.    Three of them were catastrophic: on 7 November 1824, when water rose to ; on 23 September 1924 when it reached , and 10 September 1777 when it rose to . However, a much larger flood of  was described in 1691.  – a list of floods in St. Petersburg . nevariver.ru     Besides flooding as a result of tidal waves, in 1903, 1921 and 1956 floods were caused by the melting of snow.             The Federal Service for Hydrometeorology and Environmental Monitoring of Russia classifies the Neva as a heavily polluted river. The main pollutants include ": null
    },
    {
        "copper": "copper"
    },
    {
        ", ": null
    },
    {
        "zinc": "zinc"
    },
    {
        ", ": null
    },
    {
        "manganese": "manganese"
    },
    {
        ", ": null
    },
    {
        "nitrites": "nitrite"
    },
    {
        "and ": null
    },
    {
        "nitrogen": "nitrogen"
    },
    {
        ". The dirtiest tributaries of the Neva are the Mga, Slavyanka, Ohta and Chernaya.  . Yearbook 2006. Institute of hydrochemistry, Rostov. ghi.aaanet.ru Hundreds of factories pour wastewater into the Neva within St. Petersburg, and ": null
    },
    {
        "petroleum": "petroleum"
    },
    {
        " is regularly transported along the river. The annual influx of pollutants is 80,000 tonnes, and the heaviest polluters are Power-and-heating Plant 2 , Plastpolymer and ": null
    },
    {
        "Obukhov State Plant": "obukhov state plant"
    },
    {
        " . The biggest polluters in the Leningrad Oblast are the cities of Shlisselburg, Kirovsk and Otradnoye, as well as the Kirov ": null
    },
    {
        "thermal power station": "thermal power station"
    },
    {
        ". More than 40 oil spills are registered on the river every year.  In 2008 the Federal Service of St. Petersburg announced that no beach of the Neva was fit for swimming.      Cleaning of wastewater in St. Petersburg started in 1979; by 1997 about 74% of wastewater was purified. This proportion rose to 85% in 2005, to 91.7% by 2008, and Feliks Karamzinov expected it to reach almost 100% by 2011 with the completion of the expansion of the main sewerage plant.                Many sites of ancient people, up to nine thousand years old, were found within the territory of the Neva basin. It is believed that around twelve thousand years BC, ": null
    },
    {
        "Finno-Ugric peoples": "finno-ugric peoples"
    },
    {
        "  moved to this area from the ": null
    },
    {
        "Ural Mountains": "ural mountains"
    },
    {
        ". Sharymov, Alexander . Journal Neva, 2004      In the 8th and 9th centuries AD, the area was inhabited by the ": null
    },
    {
        "East Slavs": "east slavs"
    },
    {
        " who were mainly engaged in ": null
    },
    {
        "slash and burn": "slash and burn"
    },
    {
        " agriculture, hunting and fishing. From the 8th to 13th centuries, Neva provided a waterway from Scandinavia to the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ". In the 9th century, the area belonged to ": null
    },
    {
        "Veliky Novgorod": "veliky novgorod"
    },
    {
        ". Ezhov, V. A. . , Lenizdat. Neva is already mentioned in the ": null
    },
    {
        "Life of Alexander Nevsky": "life of alexander nevsky"
    },
    {
        " . . Lib.pushkinskijdom.ru. Retrieved on 2013-07-13. At that time, Veliky Novgorod was engaged in nearly constant wars with Sweden. A major battle occurred on 15 July 1240 at the confluence of the Izhora and Neva Rivers. The Russian army, led by the 20-year-old Prince ": null
    },
    {
        "Alexander Yaroslavich": "alexander nevsky"
    },
    {
        ", aimed to stop the planned Swedish invasion. The Swedish army was defeated; the prince showed personal courage in combat and received the honorary name of Nevsky .       As a result of the Russian defeat in the ": null
    },
    {
        "Ingrian War": "ingrian war"
    },
    {
        " of 1610–17 and the concomitant ": null
    },
    {
        "Treaty of Stolbovo": "treaty of stolbovo"
    },
    {
        ", the area of the Neva River became part of ": null
    },
    {
        "Swedish Ingria": "swedish ingria"
    },
    {
        ". Beginning in 1642, the capital of Ingria was Nyen, a city near the ": null
    },
    {
        "Nyenschantz": "nyenschantz"
    },
    {
        " fortress. Because of financial and religious oppression, much of the ": null
    },
    {
        "Orthodox": "eastern orthodox church"
    },
    {
        " population left the Neva region, emptying 60  percent of the villages by 1620. The abandoned areas became populated by people from the ": null
    },
    {
        "Karelian Isthmus": "karelian isthmus"
    },
    {
        " and ": null
    },
    {
        "Savonia": "savonia"
    },
    {
        ". . . Sablino.ru.             As a result of the ": null
    },
    {
        "Great Northern War": "great northern war"
    },
    {
        " of 1700–21, the valley of Neva River became part of ": null
    },
    {
        "Russian Empire": "russian empire"
    },
    {
        ". On 16 May 1703, the city of St. Petersburg was founded in the mouth of Neva and became capital of Russia in 1712. Neva became the central part of the city. It was cleaned, intersected with canals and enclosed with embankments. In 1715, construction began of the first wooden embankment between the ": null
    },
    {
        "Admiralty building": "admiralty building, saint petersburg"
    },
    {
        " and the ": null
    },
    {
        "Summer Garden": "summer garden"
    },
    {
        ". In the early 1760s works started to cover it in ": null
    },
    {
        "granite": "granite"
    },
    {
        " and to build bridges across Neva and its canals and tributaries, such as the ": null
    },
    {
        "Hermitage Bridge": "hermitage bridge"
    },
    {
        ".     From 1727 to 1916, the temporary ": null
    },
    {
        "Isaakievsky pontoon bridge": "isaakievsky bridge"
    },
    {
        " was early constructed between the modern ": null
    },
    {
        "Saint Isaacs Square": "saint isaacs square"
    },
    {
        " and ": null
    },
    {
        "Vasilievsky Island": "vasilievsky island"
    },
    {
        ". A similar, but much longer Trinity pontoon bridge, which spanned , was brought from the Summer Garden to ": null
    },
    {
        "Petrogradsky Island": "petrogradsky island"
    },
    {
        ". The first permanent bridge across Neva, ": null
    },
    {
        "Blagoveshchensky Bridge": "blagoveshchensky bridge"
    },
    {
        ", was opened in 1850, and the second, ": null
    },
    {
        "Liteyny Bridge": "liteyny bridge"
    },
    {
        ", came into operation in 1879.     In 1858, a Joint-stock company St. Petersburg water supply was established, which built the first water supply network in the city. A two-stage water purification station was constructed in 1911. The development of the sewerage system began only in 1920, after the ": null
    },
    {
        "October Revolution": "october revolution"
    },
    {
        ", and by 1941, the sewerage network was  long.     Every winter from 1895 to 1910, electric ": null
    },
    {
        "tram": "tram"
    },
    {
        "ways were laid on the ice of the river, connecting the ": null
    },
    {
        "Senate Square": "senate square"
    },
    {
        ", ": null
    },
    {
        "Vasilievsky island": "vasilievsky island"
    },
    {
        ", ": null
    },
    {
        "Palace Embankment": "palace embankment"
    },
    {
        " and other parts of the city. The power was supplied through the rails and a top cable supported by wooden piles frozen into the ice. The service was highly successful and ran without major accidents except for a few failures in the top electrical wires. The trams ran at the speed of  and could carry 20 passengers per carriage. The carriages were converted from the used ": null
    },
    {
        "horsecar": "horsecar"
    },
    {
        "s. About 900,000 passengers were transported over a regular season between 20 January and 21 March. The sparking of contacts at the top wires amused spectators in the night. . . www.opeterburge.ru  . . livejournal.com . , Vechernii St. Petersburg .                The first concrete bridge across Neva, the ": null
    },
    {
        "Volodarsky Bridge": "volodarsky bridge"
    },
    {
        ", was built in 1936. Antonov, B. I. Bridges of St. petersburg , Glagol, 2002. During World War II, from 8 September 1941 to 27 January 1944 Leningrad was in the devastating ": null
    },
    {
        "German Siege": "siege of leningrad"
    },
    {
        ". On 30 August 1941, the German army captured Mga and came to Neva. On 8 September Germans captured Shlisselburg and cut all land communications and waterways to St. Petersburg . The siege was partly relieved in January 1943, and ended on 27 January 1944.     A river station was built above the Volodarsky Bridge in 1970 which could accept 10 large ships at a time. Wastewater treatment plants were built in Krasnoselsk in 1978, on the Belyi Island in 1979–83, and in ": null
    },
    {
        "Olgino": "olgino"
    },
    {
        " in 1987–94. The South-West Wastewater Treatment Plant was constructed in 2003–05.       Neva has very few shoals and its banks are steep, making the river suited for navigation. Utkino Backwaters were constructed in the late 19th century to park unused ships. Neva is part of the major ": null
    },
    {
        "Volga–Baltic Waterway": "volga–baltic waterway"
    },
    {
        " and ": null
    },
    {
        "White Sea – Baltic Canal": "white sea – baltic canal"
    },
    {
        ", however it has relatively low transport capacity because of its width, depth and bridges. Neva is available for vessels with capacity below 5,000 tonnes. Major transported goods include timber from ": null
    },
    {
        "Arkhangelsk": "arkhangelsk oblast"
    },
    {
        " and ": null
    },
    {
        "Vologda": "vologda oblast"
    },
    {
        "; ": null
    },
    {
        "apatite": "apatite"
    },
    {
        ", ": null
    },
    {
        "granite": "granite"
    },
    {
        " and ": null
    },
    {
        "diabase": "diabase"
    },
    {
        " from ": null
    },
    {
        "Kola Peninsula": "kola peninsula"
    },
    {
        "; ": null
    },
    {
        "cast iron": "cast iron"
    },
    {
        " and ": null
    },
    {
        "steel": "steel"
    },
    {
        " from ": null
    },
    {
        "Cherepovets": "cherepovets"
    },
    {
        "; coal from ": null
    },
    {
        "Donetsk": "donetsk"
    },
    {
        " and ": null
    },
    {
        "Kuznetsk": "kuznetsk"
    },
    {
        "; ": null
    },
    {
        "pyrite": "pyrite"
    },
    {
        " from Ural; ": null
    },
    {
        "potassium chloride": "potassium chloride"
    },
    {
        " from ": null
    },
    {
        "Solikamsk": "solikamsk"
    },
    {
        "; oil from ": null
    },
    {
        "Volga": "volga"
    },
    {
        " region. There are also many passenger routes to ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        ", ": null
    },
    {
        "Astrakhan": "astrakhan"
    },
    {
        ", ": null
    },
    {
        "Rostov": "rostov"
    },
    {
        ", ": null
    },
    {
        "Perm": "perm"
    },
    {
        ", ": null
    },
    {
        "Nizhny Novgorod": "nizhny novgorod"
    },
    {
        ", ": null
    },
    {
        "Valaam": "valaam"
    },
    {
        " and other destinations.  . Map.infoflot.ru. Retrieved on 2013-07-13. Navigation season on the Neva River runs from late April to November. . www.st-petersburg.ru .     To the west of Shlisselburg, an oil pipeline runs under the river. The pipeline is part of the ": null
    },
    {
        "Baltic Pipeline System": "baltic pipeline system"
    },
    {
        ", which provides oil from Timan-Pechora plate, ": null
    },
    {
        "West Siberia": "west siberian economic region"
    },
    {
        ", ": null
    },
    {
        "Ural": "ural economic region"
    },
    {
        ", ": null
    },
    {
        "Kazakhstan": "kazakhstan"
    },
    {
        " and ": null
    },
    {
        "Primorsk": "primorsk, leningrad oblast"
    },
    {
        " to the Gulf of Finland. The  long pipeline lies  below the river bottom and delivers about 42 million tonnes of oil a year.  . Vsluh.ru . Retrieved on 2013-07-13.     Near the ": null
    },
    {
        "Ladozhsky Bridge": "ladozhsky bridge"
    },
    {
        " there is an underwater tunnel to host a gas ": null
    },
    {
        "pipeline": "pipeline transport"
    },
    {
        " Nord Stream": "nord stream"
    },
    {
        ". The tunnel has a diameter of  and a length of  and is laid at a maximum depth of . . energospace.ru .     Neva is the main source of water of St. Petersburg and its suburbs. From 26 June 2009, St. Petersburg started processing the drinking water by ultraviolet light, abandoning the use of chlorine for disinfection. . vodokanal.spb.ru . Neva also has developed fishery, both commercial and recreational.          ": null
    },
    {
        "Leningrad Oblast": "leningrad oblast"
    },
    {
        ":   ": null
    },
    {
        "Ladozhsky Bridge": "ladozhsky bridge"
    },
    {
        " – built in 1981 as a ": null
    },
    {
        "movable": "moveable bridge"
    },
    {
        " multi-span metal bridge on stone piers.   ": null
    },
    {
        "Kuzminskii railway bridge": "kuzminskii railway bridge"
    },
    {
        " – built in 1940 as a movable three-segment railway bridge.   St. Petersburg:   ": null
    },
    {
        "Big Obukhovsky Bridge": "big obukhovsky bridge"
    },
    {
        " – built in 2004 as ": null
    },
    {
        "cable-stayed bridge": "cable-stayed bridge"
    },
    {
        " connecting Obukhovsky Defense avenue with Oktyabrskaya Embankment.   ": null
    },
    {
        "Volodarsky Bridge": "volodarsky bridge"
    },
    {
        " – built in 1936 as a movable concrete bridge connecting Narodnaya and Ivanovo streets.   ": null
    },
    {
        "Finland Railway Bridge": "finland railway bridge"
    },
    {
        " – built in 1912 as a movable, metallic, double-segment railway bridge.   St. Petersburg, Neva delta   ": null
    },
    {
        "Alexander Nevsky Bridge": "alexander nevsky bridge"
    },
    {
        " – built in 1965 as a movable concrete bridge connecting Alexander Nevsky Square and Zanevsky Avenue.   ": null
    },
    {
        "Peter the Great Bridge": "peter the great bridge"
    },
    {
        " – built in 1911 as a movable, three-segment, metal bridge connecting the historic center of St. Petersburg with the Malaya Ohta district.   ": null
    },
    {
        "Liteyny Bridge": "liteyny bridge"
    },
    {
        " – built in 1879 as a movable, six-segment, arch bridge connecting ": null
    },
    {
        "Liteyny Prospekt": "liteyny prospekt"
    },
    {
        " with Academician Lebedev Str. and ": null
    },
    {
        "Vyborg": "vyborg"
    },
    {
        ".   ": null
    },
    {
        "Trinity Bridge": "trinity bridge"
    },
    {
        " – built in 1903 as a five-segment movable metal bridge connecting Suvorov Square, Trinity Square and ": null
    },
    {
        "Kamennoostrovsky Prospekt": "kamennoostrovsky prospekt"
    },
    {
        ".   ": null
    },
    {
        "Palace Bridge": "palace bridge"
    },
    {
        " – built in 1916 as a movable, five-segment, iron bridge. Its opened central span is one the city symbols. Connects ": null
    },
    {
        "Nevsky Prospekt": "nevsky prospekt"
    },
    {
        " with the Exchange Square and ": null
    },
    {
        "Vasilievsky Island": "vasilievsky island"
    },
    {
        ".   ": null
    },
    {
        "Blagoveshchensky Bridge": "blagoveshchensky bridge"
    },
    {
        " – built in 1850 as movable seven-segment iron bridge connecting Labour Square with the 7th Line of Vasilievsky Island.      Construction of the ": null
    },
    {
        "Novo-Admiralteisky Bridge": "novo-admiralteisky bridge"
    },
    {
        ", a movable ": null
    },
    {
        "drawbridge": "drawbridge"
    },
    {
        " across the river, has been approved, but will not commence before 2011. . Spb-projects.ru.            Whereas most tourist attractions of Neva are located within St. Petersburg, there are several historical places upstream, in the Leningrad Oblast. They include the fortress ": null
    },
    {
        "Oreshek": "shlisselburg"
    },
    {
        ", which was built in 1323 on the Orekhovy Island at the source of Neva River, south-west of the Petrokrepost Bay, near the city of ": null
    },
    {
        "Shlisselburg": "shlisselburg"
    },
    {
        ". The waterfront of Schlisselburg has a monument of Peter I.  . infoflot.ru In the city, there are Blagoveshchensky Cathedral and a still functioning Orthodox church of St. Nicholas, built in 1739. On the river bank stands the Church of the Intercession. Raised in 2007, it is a wooden replica of a historical church which stood on the southern shore of Lake Onega. That church was constructed in 1708 and it burned down in 1963. It is believed to be the forerunner of the famous ": null
    },
    {
        "Kizhi Pogost": "kizhi pogost"
    },
    {
        ". , UNESCO, pp. 170–173 . Bogoslovka.ru . Retrieved on 2013-07-13.     ": null
    },
    {
        "Old Ladoga Canal": "ladoga canal"
    },
    {
        "      On 21 August 1963 a Soviet twinjet ": null
    },
    {
        "Tu-124": "tupolev tu-124"
    },
    {
        " airliner performed an emergency ": null
    },
    {
        "water landing": "water landing"
    },
    {
        " on Neva near the ": null
    },
    {
        "Finland Railway Bridge": "finland railway bridge"
    },
    {
        ". The plane took off from ": null
    },
    {
        "Tallinn": "tallinn"
    },
    {
        "-Ülemiste Airport  at 08:55 on 21 August 1963 with 45 passengers and seven crew on board and was scheduled to land at ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        "-Vnukovo . After liftoff, the crew noticed that the nose gear undercarriage did not retract, and the ": null
    },
    {
        "ground control": "air traffic control"
    },
    {
        " diverted the flight to ": null
    },
    {
        "Leningrad": "saint petersburg"
    },
    {
        "  because of ": null
    },
    {
        "fog": "fog"
    },
    {
        " at Tallinn. While circling above St. Petersburg at the altitude of at , under unclear circumstances , both engines stalled. The crew performed emergency landing on the Neva River, barely missing some of its bridges and an 1898-built steam ": null
    },
    {
        "tugboat": "tugboat"
    },
    {
        ". The tugboat rushed to the plane and towed it to the shore. No casualties were sustained at any stage. The plane captain was first fired from job but then restored and awarded with the ": null
    },
    {
        "Order of the Red Star": "order of the red star"
    },
    {
        ".   ": null
    }
]