[
    {
        "     New Age is an eclectic range of ": null
    },
    {
        "spiritual": "spirituality"
    },
    {
        " or ": null
    },
    {
        "religious": "religion"
    },
    {
        " beliefs and practices that developed in ": null
    },
    {
        "Western nations": "western culture"
    },
    {
        " during the 1970s. Although often considered to be religious, those involved in it typically prefer the designation of spiritual or mind, body, spirit and rarely use the term New Age themselves. Many scholars of the subject refer to it as the New Age movement, although others contest this term and suggest that it is better seen as a ": null
    },
    {
        "milieu": "milieu"
    },
    {
        " or ": null
    },
    {
        "zeitgeist": "zeitgeist"
    },
    {
        ".       As a form of ": null
    },
    {
        "Western esotericism": "western esotericism"
    },
    {
        ", the New Age drew heavily upon a number of older esoteric traditions, in particular those that emerged from the ": null
    },
    {
        "occultist": "occultism"
    },
    {
        " current that developed in the eighteenth and nineteenth centuries. Such prominent occultist influences include the work of ": null
    },
    {
        "Emanuel Swedenborg": "emanuel swedenborg"
    },
    {
        " and ": null
    },
    {
        "Franz Mesmer": "franz mesmer"
    },
    {
        ", as well as the ideas of ": null
    },
    {
        "Spiritualism": "spiritualism"
    },
    {
        ", ": null
    },
    {
        "New Thought": "new thought"
    },
    {
        ", and ": null
    },
    {
        "Theosophy": "theosophy"
    },
    {
        ". A number of mid-twentieth century influences, such as the ": null
    },
    {
        "UFO religions": "ufo religions"
    },
    {
        " of the 1950s, the ": null
    },
    {
        "counterculture of the 1960s": "counterculture of the 1960s"
    },
    {
        ", and the ": null
    },
    {
        "Human Potential Movement": "human potential movement"
    },
    {
        ", also exerted a strong influence on the early development of the New Age. The exact origins of the phenomenon remain contested, but there is general agreement that it developed in the 1970s, at which time it was centred largely in the United Kingdom. It expanded and grew largely in the 1980s and 1990s, in particular within the United States. By the start of the 21st century, the term New Age was increasingly rejected within this milieu, with some scholars arguing that the New Age phenomenon had ended.       Despite its highly eclectic nature, a number of beliefs commonly found within the New Age have been identified. ": null
    },
    {
        "Theologically": "theology"
    },
    {
        ", the New Age typically adopts a belief in a ": null
    },
    {
        "holistic": "holism"
    },
    {
        " form of divinity that imbues all of the universe, including human beings themselves. There is thus a strong emphasis on the spiritual authority of the self. This is accompanied by a common belief in a wide variety of semi-divine non-human entities, such as ": null
    },
    {
        "angels": "angel"
    },
    {
        "and ": null
    },
    {
        "masters": "masters of the ancient wisdom"
    },
    {
        ", with whom humans can communicate, particularly through the form of ": null
    },
    {
        "channeling": "mediumshipchanneling"
    },
    {
        ". Typically viewing human history as being divided into a series of distinct ages, a common New Age belief is that whereas once humanity lived in an age of great technological advancement and spiritual wisdom, it has entered a period of spiritual degeneracy, which will be remedied through the establishment of a coming ": null
    },
    {
        "Age of Aquarius": "age of aquarius"
    },
    {
        ", from which the milieu gets its name. There is also a strong focus on healing, particularly using forms of ": null
    },
    {
        "alternative medicine": "alternative medicine"
    },
    {
        ", and an emphasis on the notion that spirituality and ": null
    },
    {
        "science": "science"
    },
    {
        " can be unified.       Centered primarily in Western countries, those involved in the New Age have predominantly been from middle and upper-middle-class backgrounds. The degree to which New Agers are involved in the milieu varied considerably, from those who adopted a number of New Age ideas and practices to those who fully embraced and dedicated their lives to it. The New Age has generated criticism from established Christian organisations as well as ": null
    },
    {
        "modern Pagan": "modern paganism"
    },
    {
        " and ": null
    },
    {
        "indigenous communities": "indigenous peoples"
    },
    {
        ". From the 1990s onward, the New Age became the subject of research by academic scholars of ": null
    },
    {
        "religious studies": "religious studies"
    },
    {
        ".              The New Age phenomenon has proved difficult to define, with much scholarly disagreement as to its scope. The scholars Steven J. Sutcliffe and Ingvild Sælid Gilhus have even suggested that it remains among the most disputed of categories in the study of religion .     The scholar of religion ": null
    },
    {
        "Paul Heelas": "paul heelas"
    },
    {
        " characterised the New Age as an eclectic hotch-potch of beliefs, practices, and ways of life that can be identified as a singular phenomenon through their use of the same  lingua franca  to do with the human condition and how it can be ": null
    },
    {
        "transformed": "spiritual transformation"
    },
    {
        ".  Similarly, the historian of religion ": null
    },
    {
        "Olav Hammer": "olav hammer"
    },
    {
        " termed it a common denominator for a variety of quite divergent contemporary popular practices and beliefs that have emerged since the late 1970s and are largely united by historical links, a shared discourse and an air de famille . According to Hammer, this New Age was a fluid and fuzzy ": null
    },
    {
        "cult": "cult"
    },
    {
        "ic milieu . The ": null
    },
    {
        "sociologist of religion": "sociology of religion"
    },
    {
        " Michael York": "michael york"
    },
    {
        " described the New Age as an umbrella term that includes a great variety of groups and identities that are united by their expectation of a major and universal change being primarily founded on the individual and collective development of human potential.      The scholar of religion ": null
    },
    {
        "Wouter Hanegraaff": "wouter hanegraaff"
    },
    {
        " adopted a different approach by asserting that New Age was a label attached indiscriminately to whatever seems to fit it and that as a result it means very different things to different people . He thus argued against the idea that the New Age could be considered a unified ideology or  Weltanschauung  , although he believed that it could be considered a more or less unified movement.  Other scholars have suggested that the New Age is too diverse to be a singular movement. The scholar of religion ": null
    },
    {
        "George D. Chryssides": "george d. chryssides"
    },
    {
        " called it a counter-cultural Zeitgeist , while the sociologist of religion Steven Bruce suggested that New Age was a ": null
    },
    {
        "milieu": "milieu"
    },
    {
        "; Heelas and scholar of religion ": null
    },
    {
        "Linda Woodhead": "linda woodhead"
    },
    {
        " called it the holistic milieu .     There is no central authority within the New Age phenomenon that can determine what counts as New Age and what does not.   Many of those groups and individuals who could analytically be categorised as part of the New Age reject the term New Age in reference to themselves. Some even express active hostility to the term. Rather than terming themselves New Agers, those involved in this milieu commonly describe themselves as spiritual seekers , and some self-identify as a member of a different religious group, such as Christianity, Judaism, or Buddhism. In 2003 Sutcliffe observed that the use of the term New Age was optional, episodic and declining overall , adding that among the very few individuals who did use it, they usually did so with qualification, for instance by placing it in quotation marks. Other academics, such as Sara MacKian, have argued that the sheer diversity of the New Age renders the term too problematic for scholars to use. MacKian proposed everyday spirituality as an alternate term.     While acknowledging that New Age was a problematic term, the scholar of religion ": null
    },
    {
        "James R. Lewis": "james r. lewis"
    },
    {
        " stated that it remained a useful ": null
    },
    {
        "etic": "etic"
    },
    {
        " category for scholars to use because, There exists no comparable term which covers all aspects of the movement.  Similarly, Chryssides argued that the fact that New Age is a theoretical concept does not undermine its usefulness or employability ; he drew comparisons with ": null
    },
    {
        "Hinduism": "hinduism"
    },
    {
        " , a similar western etic piece of vocabulary that scholars of religion used despite its problems.         In discussing the New Age, academics have varyingly referred to New Age spirituality and New Age religion . Those involved in the New Age rarely consider it to be religion —negatively associating that term solely with ": null
    },
    {
        "organized religion": "organized religion"
    },
    {
        "—and instead describe their ": null
    },
    {
        "practices": "spiritual practice"
    },
    {
        " as spirituality . Religious studies scholars, however, have repeatedly referred to the New Age milieu as a religion . York described the New Age as a ": null
    },
    {
        "new religious movement": "new religious movement"
    },
    {
        " . Conversely, both Heelas and Sutcliffe rejected this categorisation; Heelas believed that while elements of the New Age represented NRMs, this did not apply to every New Age group. Similarly, Chryssides stated that the New Age could not be seen as a religion in itself.          The New Age is also a form of ": null
    },
    {
        "Western esotericism": "western esotericism"
    },
    {
        ". Hanegraaff regarded the New Age as a form of popular culture criticism , in that it represented a reaction against the dominant Western values of ": null
    },
    {
        "Judeo-Christian": "judeo-christian"
    },
    {
        " religion and rationalism, adding that New Age religion formulates such criticism not at random, but falls back on the ideas of earlier Western esoteric groups.     The New Age has also been identified by various scholars of religion as part of the ": null
    },
    {
        "cultic milieu": "cultic milieu"
    },
    {
        ". This concept, developed by the sociologist ": null
    },
    {
        "Colin Campbell": "colin campbell"
    },
    {
        ", refers to a social network of marginalised ideas. Through their shared marginalisation within a given society, these disparate ideas interact and create new syntheses.     Hammer identified much of the New Age as corresponding to the concept of ": null
    },
    {
        "folk religions": "folk religions"
    },
    {
        " in that it seeks to deal with ": null
    },
    {
        "existential": "existential"
    },
    {
        " questions regarding subjects like death and disease in an unsystematic fashion, often through a process of ": null
    },
    {
        "bricolage": "bricolage"
    },
    {
        " from already available narratives and rituals . York also heuristically divides the New Age into three broad trends. The first, the social camp, represents groups that primarily seek to bring about social change, while the second, the occult camp, instead focus on contact with spirit entities and channeling. Yorks third group, the spiritual camp, represents a middle ground between these two camps that focuses largely on ": null
    },
    {
        "individual development": "self-development"
    },
    {
        ".         The term new age, along with related terms like new era and new world, long predate the emergence of the New Age movement, and have widely been used to assert that a better way of life for humanity is dawning. It occurs commonly, for instance, in political contexts; the ": null
    },
    {
        "Great Seal of the United States": "great seal of the united states"
    },
    {
        ", designed in 1782, proclaims a new order of ages , while in the 1980s the ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " Premier ": null
    },
    {
        "Mikhail Gorbachev": "mikhail gorbachev"
    },
    {
        " proclaimed that all mankind is entering a new age . The term has also appeared within Western esoteric schools of thought, having a scattered use from the mid-nineteenth century onward. In 1864 the American ": null
    },
    {
        "Swedenborgian": "swedenborgian"
    },
    {
        " Warren Felt Evans": "warren felt evans"
    },
    {
        " published The New Age and its Message, while in 1907 ": null
    },
    {
        "Alfred Orage": "alfred orage"
    },
    {
        " and ": null
    },
    {
        "Holbrook Jackson": "holbrook jackson"
    },
    {
        " began editing a weekly journal of ": null
    },
    {
        "Christian liberalism": "liberal christianity"
    },
    {
        " and ": null
    },
    {
        "socialism": "socialism"
    },
    {
        " titled  The New Age . The concept of a coming new age that would be inaugurated by the ": null
    },
    {
        "return to Earth": "second coming"
    },
    {
        " of ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        " was a theme in the poetry of ": null
    },
    {
        "Wellesley Tudor Pole": "wellesley tudor pole"
    },
    {
        " and ": null
    },
    {
        "Johanna Brandt": "johanna brandt"
    },
    {
        ", and then also appeared in the work of the American Theosophist ": null
    },
    {
        "Alice Bailey": "alice bailey"
    },
    {
        ", who used the term prominently in such titles as Disciplineship in the New Age and Education in the New Age .     Between the 1930s and 1960s a small number of groups and individuals became preoccupied with the concept of a coming New Age and prominently used the term accordingly. The term had thus become a recurring motif in the esoteric spirituality milieu.   Sutcliffe therefore expressed the view that while the term New Age had originally been an apocalyptic emblem , it would only be later that it became a tag or codeword for a spiritual idiom .                According to scholar ": null
    },
    {
        "Nevill Drury": "nevill drury"
    },
    {
        ", the New Age has a tangible history , although Hanegraaff expressed the view that most New Agers were surprisingly ignorant about the actual historical roots of their beliefs . Similarly, Hammer thought that source amnesia was a building block of a New Age worldview , with New Agers typically adopting ideas with no awareness of where those ideas originated.     As a form of Western esotericism, the New Age has antecedents that stretch back to southern Europe in ": null
    },
    {
        "Late Antiquity": "late antiquity"
    },
    {
        ". Following the ": null
    },
    {
        "Age of Enlightenment": "age of enlightenment"
    },
    {
        " in 18th century Europe, new esoteric ideas developed in response to the development of scientific rationality. Scholars call this new esoteric trend  occultism , and this occultism was a key factor in the development of the worldview from which the New Age emerged.     One of the earliest influences on the New Age was the Swedish 18th century ": null
    },
    {
        "Christian mystic": "christian mysticism"
    },
    {
        " Emanuel Swedenborg": "emanuel swedenborg"
    },
    {
        ", who professed the ability to communicate with angels, demons, and spirits. Swedenborgs attempt to unite science and religion and his prediction of a coming era in particular have been cited as ways that he prefigured the New Age. Another early influence was the late 18th and early 19th century German physician and ": null
    },
    {
        "hypnotist": "hypnotist"
    },
    {
        " Franz Mesmer": "franz mesmer"
    },
    {
        ", who claimed the existence of a force known as ": null
    },
    {
        "animal magnetism": "animal magnetism"
    },
    {
        " running through the human body. The establishment of ": null
    },
    {
        "Spiritualism": "spiritualism"
    },
    {
        ", an occult religion influenced by both Swedenborgianism and Mesmerism, in the U.S. during the 1840s has also been identified as a precursor to the New Age, in particular through its rejection of established Christianity, its claims to representing a scientific approach to religion, and its emphasis on channeling spirit entities.          A further major influence on the New Age was the ": null
    },
    {
        "Theosophical Society": "theosophical society"
    },
    {
        ", an occult group co-founded by the Russian ": null
    },
    {
        "Helena Blavatsky": "helena blavatsky"
    },
    {
        " in the late 19th century. In her books  Isis Unveiled  and  The Secret Doctrine  , Blavatsky claimed that her Society was conveying the essence of all world religions, and it thus emphasized a focus on ": null
    },
    {
        "comparative religion": "comparative religion"
    },
    {
        ". Serving as a partial bridge between Theosophical ideas and those of the New Age was the American esotericist ": null
    },
    {
        "Edgar Cayce": "edgar cayce"
    },
    {
        ", who founded the ": null
    },
    {
        "Association for Research and Enlightenment": "association for research and enlightenment"
    },
    {
        ". Another influence was ": null
    },
    {
        "New Thought": "new thought"
    },
    {
        ", which developed in late nineteenth century ": null
    },
    {
        "New England": "new england"
    },
    {
        " as a Christian-oriented healing movement before spreading throughout the United States. Another prominent influence was the psychologist ": null
    },
    {
        "Carl Jung": "carl jung"
    },
    {
        ".   Drury also identified as an important influence upon the New Age the Indian ": null
    },
    {
        "Swami Vivekananda": "swami vivekananda"
    },
    {
        ", an adherent of the philosophy of ": null
    },
    {
        "Vedanta": "vedanta"
    },
    {
        " who first brought Hinduism to the West in the late 19th century.     Hanegraaff believed that the New Ages direct antecedents could be found in the ": null
    },
    {
        "UFO religions": "ufo religion"
    },
    {
        "of the 1950s, which he termed a proto-New Age movement . Many of these new religious movements had strong apocalyptic beliefs regarding a coming new age, which they typically asserted would be brought about by contact with extraterrestrials. Examples of such groups included the ": null
    },
    {
        "Aetherius Society": "aetherius society"
    },
    {
        ", founded in the UK in 1955, and the ": null
    },
    {
        "Heralds of the New Age": "heralds of the new age"
    },
    {
        ", established in New Zealand in 1956.            From a historical perspective, the New Age phenomenon is rooted in the ": null
    },
    {
        "counterculture of the 1960s": "counterculture of the 1960s"
    },
    {
        ". According to author Andrew Grant Jackson, ": null
    },
    {
        "George Harrisons": "george harrison"
    },
    {
        "adoption of ": null
    },
    {
        "Hindu": "hinduism"
    },
    {
        " philosophy and Indian instrumentation in his songs with ": null
    },
    {
        "the Beatles": "the beatles"
    },
    {
        " in the mid 1960s, together with the bands highly publicised study of ": null
    },
    {
        "Transcendental Meditation": "transcendental meditation"
    },
    {
        ", truly kick-started the Human Potential Movement that subsequently became New Age.  Although not common throughout the counterculture, usage of the terms New Age and Age of Aquarius – used in reference to a coming era – were found within it, for instance appearing on adverts for the ": null
    },
    {
        "Woodstock": "woodstock"
    },
    {
        " festival of 1969, and in the lyrics of ": null
    },
    {
        "Aquarius": "aquarius"
    },
    {
        " , the opening song of the 1967 musical  Hair: The American Tribal Love-Rock Musical .   This decade also witnessed the emergence of a variety of new religious movements and newly established religions in the United States, creating a spiritual milieu from which the New Age drew upon; these included the ": null
    },
    {
        "San Francisco Zen Center": "san francisco zen center"
    },
    {
        ", Transcendental Meditation, ": null
    },
    {
        "Soka Gakkai": "soka gakkai"
    },
    {
        ", the ": null
    },
    {
        "Inner Peace Movement": "inner peace movement"
    },
    {
        ", the ": null
    },
    {
        "Church of All Worlds": "church of all worlds"
    },
    {
        ", and the ": null
    },
    {
        "Church of Satan": "church of satan"
    },
    {
        ". Although there had been an established interest in Asian religious ideas in the U.S. from at least the eighteenth-century, many of these new developments were variants of Hinduism, ": null
    },
    {
        "Buddhism": "buddhism"
    },
    {
        ", and ": null
    },
    {
        "Sufism": "sufism"
    },
    {
        ", which had been imported to the West from Asia following the U.S. governments decision to rescind the ": null
    },
    {
        "Asian Exclusion Act": "asian exclusion act"
    },
    {
        " in 1965. In 1962 the ": null
    },
    {
        "Esalen Institute": "esalen institute"
    },
    {
        " was established in ": null
    },
    {
        "Big Sur": "big sur"
    },
    {
        ", ": null
    },
    {
        "California": "california"
    },
    {
        ". Esalen and similar personal growth centers had developed links to ": null
    },
    {
        "humanistic psychology": "humanistic psychology"
    },
    {
        ", and from this, the ": null
    },
    {
        "human potential movement": "human potential movement"
    },
    {
        " emerged, strongly influenced the New Age.     In Britain, a number of small religious groups that came to be identified as the light movement had begun declaring the existence of a coming new age, influenced strongly by the Theosophical ideas of Blavatsky and Bailey. The most prominent of these groups was the ": null
    },
    {
        "Findhorn Foundation": "findhorn foundation"
    },
    {
        ", which founded the Findhorn Ecovillage in the Scottish area of ": null
    },
    {
        "Findhorn": "findhorn"
    },
    {
        ", ": null
    },
    {
        "Moray": "moray"
    },
    {
        " in 1962. Although its founders were from an older generation, Findhorn attracted increasing numbers of countercultural baby boomers during the 1960s, to the extent that its population had grown sixfold to c. 120 residents by 1972. In October 1965, the founder of Findhorn, ": null
    },
    {
        "Peter Caddy": "peter caddy"
    },
    {
        ", attended a meeting of various prominent figures within Britains esoteric milieu; titled The Significance of the Group in the New Age , it was held at ": null
    },
    {
        "Attingham Park": "attingham park"
    },
    {
        " over the course of a weekend.     All of these groups created the backdrop from which the New Age movement emerged. As James R. Lewis and ": null
    },
    {
        "J. Gordon Melton": "j. gordon melton"
    },
    {
        " point out, the New Age phenomenon represents a synthesis of many different preexisting movements and strands of thought . Nevertheless, York asserted that while the New Age bore many similarities with both earlier forms of Western esotericism and Asian religion, it remained distinct from its predecessors in its own self-consciousness as a new way of thinking .              By the early 1970s, use of the term New Age was increasingly common within the cultic milieu. This was because—according to Sutcliffe—the emblem of the New Age had been passed from the subcultural pioneers in groups like Findhorn to the wider array of countercultural baby boomers between c. 1967 and 1974. He noted that as this happened, the meaning of the term New Age changed; whereas it had once referred specifically to a coming era, at this point it came to be used in a wider sense to refer to a variety of spiritual activities and practices. In the latter part of the 1970s, the New Age expanded to cover a wide variety of alternative spiritual and religious beliefs and practices, not all of which explicitly held to the belief in the Age of Aquarius, but were nevertheless widely recognised as broadly similar in their search for alternatives to mainstream society. In doing so, the New Age became a banner under which to bring together the wider cultic milieu of American society.     The counterculture of the 1960s had rapidly declined by the start of the 1970s, in large part due to the collapse of the ": null
    },
    {
        "commune": "commune"
    },
    {
        " movement, but it would be many former members of the counter-culture and ": null
    },
    {
        "hippie": "hippie"
    },
    {
        " subculture who subsequently became early adherents of the New Age movement.   The exact origins of the New Age movement remain an issue of debate; Melton asserted that it emerged in the early 1970s, whereas Hanegraaff instead traced its emergence to the latter 1970s, adding that it then entered its full development in the 1980s. This early form of the movement was based largely in Britain and exhibited a strong influence from Theosophy and ": null
    },
    {
        "Anthroposophy": "anthroposophy"
    },
    {
        ". Hanegraaff termed this early core of the movement the New Age sensu stricto, or New Age in the strict sense .     Hanegraaff terms the broader development the New Age sensu lato, or New Age in the wider sense . Stores that came to be known as New Age shops opened up, selling related books, magazines, jewellery, and crystals, and they were typified by the playing of New Age music and the smell of incense.This probably influenced several thousand small metaphysical book- and gift-stores that increasingly defined themselves as New Age bookstores ,  while New Age titles came to be increasingly available from mainstream bookstores and then websites like ": null
    },
    {
        "Amazon.com": "amazon.com"
    },
    {
        ".     Not everyone who came to be associated with the New Age phenomenon openly embraced the term New Age, although it was popularised in books like ": null
    },
    {
        "David Spanglers": "david spangler"
    },
    {
        "1977 work Revelation: The Birth of a New Age and ": null
    },
    {
        "Mark Satins": "mark satin"
    },
    {
        "1979 book New Age Politics: Healing Self and Society. ": null
    },
    {
        "Marilyn Fergusons": "marilyn ferguson"
    },
    {
        "1982 book  The Aquarian Conspiracy  has also been regarded as a landmark work in the development of the New Age, promoting the idea that a new era was emerging. Other terms that were employed synonymously with New Age in this milieu included Green , Holistic , Alternative , and Spiritual .     1971 witnessed the foundation of ": null
    },
    {
        "est": "erhard seminars training"
    },
    {
        " by ": null
    },
    {
        "Werner H. Erhard": "werner h. erhard"
    },
    {
        ", a transformational training course that became a prominent part of the early movement. Melton suggested that the 1970s witnessed the growth of a relationship between the New Age movement and the older New Thought movement, as evidenced by the widespread use of ": null
    },
    {
        "Helen Schucmans": "helen schucman"
    },
    {
        "  A Course in Miracles  , New Age music, and crystal healing in New Thought churches. Some figures in the New Thought movement were sceptical, challenging the compatibility of New Age and New Thought perspectives. During these decades, Findhorn had become a site of ": null
    },
    {
        "pilgrimage": "pilgrimage"
    },
    {
        " for many New Agers, and greatly expanded in size as people joined the community, with workshops and conferences being held there that brought together New Age thinkers from across the world.          Several key events occurred, which raised public awareness of the New Age subculture: publication of ": null
    },
    {
        "Linda Goodmans": "linda goodman"
    },
    {
        "best-selling astrology books Sun Signs and Love Signs ; the release of ": null
    },
    {
        "Shirley MacLaines": "shirley maclaine"
    },
    {
        "book  Out on a Limb  , later adapted into a television mini-series with the same name ; and the ": null
    },
    {
        "Harmonic Convergence": "harmonic convergence"
    },
    {
        " planetary alignment": "planetary alignment"
    },
    {
        " on August 16 and 17, 1987,  organized by ": null
    },
    {
        "José Argüelles": "josé argüelles"
    },
    {
        " in ": null
    },
    {
        "Sedona, Arizona": "sedona, arizona"
    },
    {
        ". The Convergence attracted more people to the movement than any other single event. Heelas suggested that the movement was influenced by the enterprise culture encouraged by the U.S. and U.K. governments during the 1980s onward, with its emphasis on initiative and self-reliance resonating with any New Age ideas.     The claims of channelers ": null
    },
    {
        "Jane Roberts": "jane roberts"
    },
    {
        " , Helen Schucman , ": null
    },
    {
        "J. Z. Knight": "j. z. knight"
    },
    {
        " , ": null
    },
    {
        "Neale Donald Walsch": "neale donald walsch"
    },
    {
        "   contributed to the movements growth.   The first significant exponent of the New Age movement in the U.S. has been cited as ": null
    },
    {
        "Ram Dass": "ram dass"
    },
    {
        ". Core works in the propagating New Age ideas included Jane Robertss Seth series, published from 1972 onward, Helen Schucmans 1975 publication A Course in Miracles, and ": null
    },
    {
        "James Redfields": "james redfield"
    },
    {
        "1993 work  The Celestine Prophecy . A variety of these books were ": null
    },
    {
        "best seller": "best seller"
    },
    {
        "s, with the Seth book series for instance selling over a million copies. Supplementing these books were videos, audiotapes, compact discs and websites. The development of the internet in particular further popularized New Age ideas and made them more widely accessible.     New Age ideas influenced the development of ": null
    },
    {
        "rave": "rave"
    },
    {
        " culture in the late 1980s and 1990s. In Britain during the 1980s, the term  New Age Travellers  came into use, although York characterised this term as a misnomer created by the media . These New Age Travellers had little to do with the New Age as the term was used more widely, with scholar of religion Daren Kemp observing that New Age spirituality is not an essential part of New Age Traveller culture, although there are similarities between the two worldviews . The term New Age came to be used increasingly widely by the popular media in the 1990s.         By the late 1980s, some publishers dropped the term New Age as a marketing device. In 1994, the scholar of religion ": null
    },
    {
        "Gordon J. Melton": "gordon j. melton"
    },
    {
        " presented a conference paper in which he argued that, given that he knew of nobody describing their practices as New Age anymore, the New Age had died. In 2001, Hammer observed that the term New Age had increasingly been rejected as either pejorative or meaningless by individuals within the Western cultic milieu. He also noted that within this milieu it was not being replaced by any alternative, and that as such a sense of collective identity was being lost.     Other scholars disagreed with Meltons idea; in 2004 Daren Kemp stated that New Age is still very much alive . Hammer himself stated that the New Age movement may be on the wane, but the wider New Age religiosity... shows no sign of disappearing . MacKian suggested that the New Age movement had been replaced by a wider New Age sentiment which had come to pervade the socio-cultural landscape of Western countries. Its diffusion into the mainstream may have been influenced by the adoption of New Age concepts by high-profile figures: U.S. First Lady ": null
    },
    {
        "Nancy Reagan": "nancy reagan"
    },
    {
        " consulted an astrologer, British ": null
    },
    {
        "Princess Diana": "diana, princess of wales"
    },
    {
        " visited spirit mediums, and Norwegian Princess ": null
    },
    {
        "Märtha Louise": "princess märtha louise of norway"
    },
    {
        " established a school devoted to communicating with angels.   New Age shops continued to operate, although many have been remarketed as Mind, Body, Spirit .     In 2015, the scholar of religion ": null
    },
    {
        "Hugh Urban": "hugh urban"
    },
    {
        " argued that New Age spirituality is growing in the United States and can be expected to become more visible: According to many recent surveys of religious affiliation, the spiritual but not religious category is one of the fastest-growing trends in American culture, so the New Age attitude of spiritual individualism and eclecticism may well be an increasingly visible one in the decades to come .     Australian scholar Paul J. Farrelly, in his 2017 doctoral dissertation at ": null
    },
    {
        "Australian National University": "australian national university"
    },
    {
        ", argued that, while the New Age may become less popular in the West, it is actually booming in ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        ", where it is regarded as something comparatively new, and is being exported from Taiwan to Mainland ": null
    },
    {
        "China": "china"
    },
    {
        ", while it is more or less tolerated by the authorities.                The New Age places strong emphasis on the idea that the individual and their own experiences are the primary source of authority on spiritual matters. It exhibits what Heelas termed unmediated individualism , and reflects a world-view that is radically democratic . It places an emphasis on the freedom and autonomy of the individual. This emphasis has led to ethical disagreements; some New Agers believe helping others is beneficial, although another view is that doing so encourages dependency and conflicts with a reliance on the self. Nevertheless, within the New Age, there are differences in the role accorded to voices of authority outside of the self. Hammer stated that a belief in the existence of a core or true Self is a recurring theme in New Age texts. The concept of ": null
    },
    {
        "personal growth": "personal growth"
    },
    {
        " is also greatly emphasised among New Agers, while Heelas noted that for participants spirituality is life-itself .     New Age religiosity is typified by its eclecticism. Generally believing that there is no one true way to pursue spirituality, New Agers develop their own worldview by combining bits and pieces to form their own individual mix , seeking what Drury called a spirituality without borders or confining dogmas . The anthropologist David J. Hess noted that in his experience, a common attitude among New Agers was that any alternative spiritual path is good because it is spiritual and alternative . This approach that has generated a common jibe that New Age represents supermarket spirituality . York suggested that this eclecticism stemmed from the New Ages origins within ": null
    },
    {
        "late modern": "late modernity"
    },
    {
        " capitalism, with New Agers subscribing to a belief in a free market of spiritual ideas as a parallel to a free market in economics.     As part of its eclecticism, the New Age draws ideas from many different cultural and spiritual traditions from across the world, often legitimising this approach by reference to a very vague claim about underlying global unity. Certain societies are more usually chosen over others; examples include the ancient Celts, ancient Egyptians, the ": null
    },
    {
        "Essenes": "essenes"
    },
    {
        ", ": null
    },
    {
        "Atlanteans": "atlantis"
    },
    {
        ", and ancient extraterrestrials. As noted by Hammer: to put it bluntly, no significant spokespersons within the New Age community claim to represent ancient Albanian wisdom, simply because beliefs regarding ancient Albanians are not part of our cultural stereotypes . According to Hess, these ancient or foreign societies represent an exotic Other for New Agers, who are predominantly white Westerners.              A belief in ": null
    },
    {
        "divinity": "divinity"
    },
    {
        " is integral to New Age ideas, although understandings of this divinity vary. New Age ": null
    },
    {
        "theology": "theology"
    },
    {
        " exhibits an inclusive and universalistic approach that accepts all personal perspectives on the divine as equally valid. This intentional vagueness as to the nature of divinity also reflects the New Age idea that divinity cannot be comprehended by the human mind or language. New Age literature nevertheless displays recurring traits in its depiction of the divine: the first is the idea that it is ": null
    },
    {
        "holistic": "holism"
    },
    {
        ", thus frequently being described with such terms as an Ocean of Oneness , Infinite Spirit , Primal Stream , One Essence , and Universal Principle . A second trait is the characterisation of divinity as Mind , Consciousness , and Intelligence , while a third is the description of divinity as a form of ": null
    },
    {
        "energy": "energy"
    },
    {
        " . A fourth trait is the characterisation of divinity as a life force , the essence of which is creativity, while a fifth is the concept that divinity consists of ": null
    },
    {
        "love": "love"
    },
    {
        ".     Most New Age groups believe in an Ultimate Source from which all things originate, which is usually conflated with the divine. Various ": null
    },
    {
        "creation myths": "creation myths"
    },
    {
        " have been articulated in New Age publications outlining how this Ultimate Source created the universe and everything in it. In contrast, some New Agers emphasise the idea of a universal inter-relatedness that is not always emanating from a single source. The New Age worldview emphasises holism and the idea that everything in existence is intricately connected as part of a single whole, in doing so rejecting both the ": null
    },
    {
        "dualism": "dualistic cosmology"
    },
    {
        " of Judeo-Christian thought and the ": null
    },
    {
        "reductionism": "reductionism"
    },
    {
        " of Cartesian science. A number of New Agers have linked this holistic interpretation of the universe to the ": null
    },
    {
        "Gaia hypothesis": "gaia hypothesis"
    },
    {
        " of ": null
    },
    {
        "James Lovelock": "james lovelock"
    },
    {
        ". The idea of holistic divinity results in a common New Age belief that humans themselves are divine in essence, a concept described using such terms as droplet of divinity , inner Godhead , and divine self . Influenced by Theosophical and Anthroposophical ideas regarding ": null
    },
    {
        "subtle bodies": "subtle bodies"
    },
    {
        ", a common New Age idea holds to the existence of a Higher Self that is a part of the human but connects with the divine essence of the universe, and which can advise the human mind through ": null
    },
    {
        "intuition": "intuition"
    },
    {
        ".     Cosmogonical creation stories are common in New Age sources, with these accounts reflecting the movements holistic framework by describing an original, primal oneness from which all things in the universe emanated. An additional common theme is that human souls – once living in a spiritual world – then descended into a world of matter.   The New Age movement typically views the material universe as a meaningful illusion, which humans should try to use constructively rather than focus on escaping into other spiritual realms. This physical world is hence seen as a domain for learning and growth after which the human soul might pass on to higher levels of existence. There is thus a widespread belief that reality is engaged in an ongoing process of evolution; rather than ": null
    },
    {
        "Darwinian evolution": "darwinian evolution"
    },
    {
        ", this is typically seen as either a teleological evolution which assumes a process headed to a specific goal, or an open-ended, creative evolution.              MacKian argued that a central, but often overlooked, element of the phenomenon was an emphasis on ": null
    },
    {
        "spirit": "spirit"
    },
    {
        " , and in particular participants desire for a relationship with spirit. Many practitioners in her UK-focused study described themselves as workers for spirit , expressing the desire to help people learn about spirit. They understood various material signs as marking the presence of spirit, for instance the unexpected appearance of a feather. New Agers often call upon this spirit to assist them in everyday situations, for instance to ease the traffic flow on their way to work.     New Age literature often refers to benevolent non-human spirit-beings who are interested in humanitys spiritual development; these are variously referred to as angels, ": null
    },
    {
        "guardian angel": "guardian angel"
    },
    {
        "s, personal guides, masters, teachers, and contacts. New Age angelology is nevertheless unsystematic, reflecting the idiosyncrasies of individual authors. The figure of Jesus Christ is often mentioned within New Age literature as a mediating principle between divinity and humanity, as well as an exemplar of a spiritually advanced human being.     Although not present in every New Age group, a core belief within the milieu is in ": null
    },
    {
        "channeling": "mediumship"
    },
    {
        ". This is the idea that humans beings, sometimes in a state of ": null
    },
    {
        "trance": "trance"
    },
    {
        ", can act as a channel of information from sources other than their normal selves . These sources are varyingly described as being ": null
    },
    {
        "God": "god"
    },
    {
        ", ": null
    },
    {
        "gods": "gods"
    },
    {
        " and ": null
    },
    {
        "goddesses": "goddesses"
    },
    {
        ", ": null
    },
    {
        "ascended masters": "ascended masters"
    },
    {
        ", ": null
    },
    {
        "spirit guide": "spirit guide"
    },
    {
        "s, ": null
    },
    {
        "extraterrestrials": "extraterrestrial life"
    },
    {
        ", ": null
    },
    {
        "angel": "angel"
    },
    {
        "s, ": null
    },
    {
        "devas": "deva"
    },
    {
        ", historical figures, the ": null
    },
    {
        "collective unconscious": "collective unconscious"
    },
    {
        ", ": null
    },
    {
        "elemental": "elemental"
    },
    {
        "s, or ": null
    },
    {
        "nature spirit": "nature spirit"
    },
    {
        "s. Hanegraaff described channeling as a form of articulated revelation , and identified four forms: trance channeling, automatisms, clairaudient channeling, and open channeling.     Prominent examples of New Age channeling include Jane Roberts claims that she was contacted by an entity called Seth, and Helen Schucmans claims to have channeled Jesus Christ. The academic Suzanne Riordan examined a variety of these New Age channeled messages, noting that they typically echoed each other in tone and content , offering an analysis of the human condition and giving instructions or advice for how humanity can discover its true destiny.   For many New Agers, these channeled messages rival the scriptures of the main world religions as sources of spiritual authority, although often New Agers describe historical religious revelations as forms of channeling as well, thus attempting to legitimate and authenticate their own contemporary practices. Although the concept of channeling from discarnate spirit entities has links to ": null
    },
    {
        "Spiritualism": "spiritualism"
    },
    {
        " and ": null
    },
    {
        "psychical research": "psychical research"
    },
    {
        ", the New Age does not feature Spiritualisms emphasis on proving the existence of life after death, nor psychical researchs focus of testing mediums for consistency.         New Age thought typically envisions the world as developing through cosmological cycles that can be identified ": null
    },
    {
        "astrologically": "astrology"
    },
    {
        ". It adopts this concept from Theosophy, although often presents it in a looser and more eclectic way than is found in Theosophical teaching. New Age literature often claims that humanity once lived in an age of spiritual wisdom. In the writings of New Agers like Edgar Cayce, the ancient period of spiritual wisdom is associated with concepts of supremely-advanced societies living on ": null
    },
    {
        "lost continents": "lost lands"
    },
    {
        " such as Atlantis, ": null
    },
    {
        "Lemuria": "lemuria"
    },
    {
        ", and ": null
    },
    {
        "Mu": "mu"
    },
    {
        ", as well as the idea that ancient societies like those of ": null
    },
    {
        "Ancient Egypt": "ancient egypt"
    },
    {
        " were far more technologically advanced than modern scholarship accepts.   New Age literature often posits that the ancient period of spiritual wisdom gave way to an age of spiritual decline, sometimes termed the ": null
    },
    {
        "Age of Pisces": "age of pisces"
    },
    {
        ". Although characterised as being a negative period for humanity, New Age literature views the Age of Pisces as an important learning experience for the species.   Hanegraaff stated that New Age perceptions of history were extremely sketchy in their use of description, reflecting little interest in ": null
    },
    {
        "historiography": "historiography"
    },
    {
        " and conflating history with ": null
    },
    {
        "myth": "myth"
    },
    {
        ". He also noted that they were highly ": null
    },
    {
        "ethnocentric": "ethnocentrism"
    },
    {
        " in placing ": null
    },
    {
        "Western civilization": "western world"
    },
    {
        " at the centre of historical development.          A common belief among the New Age is that humanity has entered, or is coming to enter, a new period known as the ": null
    },
    {
        "Age of Aquarius": "age of aquarius"
    },
    {
        ", which Melton has characterised as a New Age of love, joy, peace, abundance, and harmony the Golden Age heretofore only dreamed about.  In accepting this belief in a coming new age, the milieu has been described as highly positive, celebratory, utopian , and has also been cited as an ": null
    },
    {
        "apocalyptic movement": "apocalypticism"
    },
    {
        ". Opinions about the nature of the coming Age of Aquarius differ among New Agers. There are for instance differences in belief about its commencement; New Age author David Spangler claimed that it began in 1967, others placed its beginning with the Harmonic Convergence of 1987, author José Argüelles predicted its start ": null
    },
    {
        "in 2012": "2012 phenomenon"
    },
    {
        ", and some believe that it will not begin until several centuries into the third millennium.     There are also differences in how this new age is envisioned. Those adhering to what Hanegraaff termed the moderate perspective believed that it would be marked by an improvement to current society, which affected both New Age concerns—through the convergence of science and mysticism and the global embrace of alternative medicine—to more general concerns, including an end to violence, crime and war, a healthier environment, and international co-operation. Other New Agers adopt a fully utopian vision, believing that the world will be wholly transformed into an Age of Light , with humans evolving into totally spiritual beings and experiencing unlimited love, bliss, and happiness. Rather than conceiving of the Age of Aquarius as an indefinite period, many believe that it would last for around two thousand years before being replaced by a further age.     There are various beliefs within the milieu as to how this new age will come about, but most emphasise the idea that it will be established through ": null
    },
    {
        "human agency": "human agency"
    },
    {
        "; others assert that it will be established with the aid of non-human forces such as spirits or extraterrestrials. Ferguson for instance claimed that there was a vanguard of humans known as the Aquarian conspiracy who were helping to bring the Age of Aquarius forth through their actions. Participants in the New Age typically express the view that their own spiritual actions are helping to bring about the Age of Aquarius, with writers like Ferguson and Argüelles presenting themselves as prophets ushering forth this future era.         Another recurring element of New Age is an emphasis on healing and ": null
    },
    {
        "alternative medicine": "alternative medicine"
    },
    {
        ". Butler, Jenny and Maria Tighe, Holistic Health and New Age in the British Isles . 415-34 in Kemp, Daren and Lewis, James R., ed. , Handbook of New Age, Boston, Massachusetts, US: Brill Academic Publishers, . The general New Age ethos is that health is the natural state for the human being and that illness is a disruption of that natural balance. Hence, New Age therapies seek to heal ": null
    },
    {
        "illness": "illness"
    },
    {
        " as a general concept that includes physical, mental, and spiritual aspects; in doing so it critiques mainstream Western medicine for simply attempting to cure ": null
    },
    {
        "disease": "disease"
    },
    {
        ", and thus has an affinity with most forms of ": null
    },
    {
        "traditional medicine": "traditional medicine"
    },
    {
        ". Its focus of self-spirituality has led to the emphasis of self-healing, although also present are ideas on healing both others and the Earth itself.          The healing elements of the movement are difficult to classify given that a variety of terms are used, with some New Age authors using different terms to refer to the same trends, while others use the same term to refer to different things. However, Hanegraaff developed a set of categories into which the forms of New Age healing could be roughly categorised. The first of these was the ": null
    },
    {
        "Human Potential Movement": "human potential movement"
    },
    {
        ", which argues that contemporary Western society suppresses much human potential, and accordingly professes to offer a path through which individuals can access those parts of themselves that they have alienated and suppressed, thus enabling them to reach their full potential and live a meaningful life. Hanegraaff described ": null
    },
    {
        "transpersonal psychology": "transpersonal psychology"
    },
    {
        " as the theoretical wing of this Human Potential Movement; in contrast to other schools of psychological thought, transpersonal psychology takes religious and mystical experiences seriously by exploring the uses of ": null
    },
    {
        "altered states of consciousness": "altered states of consciousness"
    },
    {
        ". Closely connected to this is the ": null
    },
    {
        "shamanic consciousness": "neoshamanism"
    },
    {
        " current, which argues that the ": null
    },
    {
        "shaman": "shamanism"
    },
    {
        " was a specialist in altered states of consciousness and seeks to adopt and imitate traditional shamanic techniques as a form of personal healing and growth.     Hanegraaff identified the second main healing current in the New Age movement as being ": null
    },
    {
        "holistic health": "holistic health"
    },
    {
        ". This emerged in the 1970s out of the ": null
    },
    {
        "free clinic": "free clinic"
    },
    {
        " movement of the 1960s, and has various connections with the Human Potential Movement. It emphasises the idea that the human individual is a holistic, interdependent relationship between mind, body, and spirit, and that healing is a process in which an individual becomes whole by integrating with the powers of the universe. A very wide array of methods are utilised within the holistic health movement, with some of the most common including ": null
    },
    {
        "acupuncture": "acupuncture"
    },
    {
        ", reiki, ": null
    },
    {
        "biofeedback": "biofeedback"
    },
    {
        ", ": null
    },
    {
        "chiropractic": "chiropractic"
    },
    {
        ", ": null
    },
    {
        "yoga": "yoga"
    },
    {
        ", ": null
    },
    {
        "kinesiology": "kinesiology"
    },
    {
        ", ": null
    },
    {
        "homeopathy": "homeopathy"
    },
    {
        ", ": null
    },
    {
        "aromatherapy": "aromatherapy"
    },
    {
        ", ": null
    },
    {
        "iridology": "iridology"
    },
    {
        ", ": null
    },
    {
        "massage": "massage"
    },
    {
        " and other forms of ": null
    },
    {
        "bodywork": "bodywork"
    },
    {
        ", ": null
    },
    {
        "meditation": "meditation"
    },
    {
        " and ": null
    },
    {
        "visualisation": "visual perception"
    },
    {
        ", nutritional therapy, ": null
    },
    {
        "psychic healing": "psychic healing"
    },
    {
        ", ": null
    },
    {
        "herbal medicine": "herbal medicine"
    },
    {
        ", ": null
    },
    {
        "healing using crystals": "crystal healing"
    },
    {
        ", metals, music, ": null
    },
    {
        "chromotherapy": "chromotherapy"
    },
    {
        ", and reincarnation therapy. The use of crystal healing has become a particularly prominent visual trope within the New Age; this practice was not common in esotericism prior to their adoption in the New Age milieu.   The mainstreaming of the Holistic Health movement in the UK is discussed by Maria Tighe. The inter-relation of holistic health with the New Age movement is illustrated in Jenny Butlers ethnographic description of Angel therapy in Ireland.            According to Drury, the New Age attempts to create a worldview that includes both science and spirituality , while Hess noted how New Agers have a penchant for bringing together the technical and the spiritual, the scientific and the religious .   Although New Agers typically reject ": null
    },
    {
        "rationalism": "rationalism"
    },
    {
        ", the ": null
    },
    {
        "scientific method": "scientific method"
    },
    {
        ", and the academic establishment, they employ terminology and concepts borrowed from science and particularly from the ": null
    },
    {
        "New Physics": "physics beyond the standard model"
    },
    {
        ". Moreover, a number of prominent influences on New Age, such as ": null
    },
    {
        "David Bohm": "david bohm"
    },
    {
        " and ": null
    },
    {
        "Ilya Prigogine": "ilya prigogine"
    },
    {
        ", had backgrounds as professional scientists. Hanegraaff identified New Age science as a form of  Naturphilosophie .     In this, the milieu is interested in developing unified world views to discover the nature of the divine and establish a scientific basis for religious belief. Figures in the New Age movement—most notably ": null
    },
    {
        "Fritjof Capra": "fritjof capra"
    },
    {
        " in his  The Tao of Physics  and ": null
    },
    {
        "Gary Zukav": "gary zukav"
    },
    {
        " in  The Dancing Wu Li Masters  —have drawn parallels between theories in the New Physics and traditional forms of ": null
    },
    {
        "mysticism": "mysticism"
    },
    {
        ", thus arguing that ancient religious ideas are now being proven by contemporary science. Many New Agers have adopted James Lovelocks Gaia hypothesis that the Earth acts akin to a single living organism, although have expanded this idea to include the idea that the Earth has consciousness and intelligence.     Despite New Agers appeals to science, most of the academic and scientific establishments dismiss New Age science as ": null
    },
    {
        "pseudo-science": "pseudo-science"
    },
    {
        ", or at best existing in part on the fringes of genuine scientific research. This is an attitude also shared by many active in the field of ": null
    },
    {
        "parapsychology": "parapsychology"
    },
    {
        ". In turn, New Agers often accuse the scientific establishment of pursuing a dogmatic and outmoded approach to scientific enquiry, believing that their own understandings of the universe will replace those of the academic establishment in a ": null
    },
    {
        "paradigm shift": "paradigm shift"
    },
    {
        ".         There is no ethical cohesion within the New Age phenomenon, although Hanegraaff argued that the central ethical tenet of the New Age is to cultivate ones own divine potential. Given that the movements holistic interpretation of the universe prohibits a belief in a dualistic ": null
    },
    {
        "good and evil": "good and evil"
    },
    {
        ", negative events that happen are interpreted not as the result of evil but as lessons designed to teach an individual and enable them to advance spiritually.   It rejects the Christian emphasis on ": null
    },
    {
        "sin": "sin"
    },
    {
        " and ": null
    },
    {
        "guilt": "guilt"
    },
    {
        ", believing that these generate fear and thus negativity, which then hinder spiritual evolution. It also typically criticises the blaming and judging of others for their actions, believing that if an individual adopts these negative attitudes it harms their own spiritual evolution. Instead the movement emphasizes positive thinking, although beliefs regarding the power behind such thoughts vary within New Age literature. Common New Age examples of how to generate such positive thinking include the repeated recitation of mantras and statements carrying positive messages, and the visualisation of a white light.     According to Hanegraaff, the question of death and afterlife is not a pressing problem requiring an answer in the New Age. A belief in ": null
    },
    {
        "reincarnation": "reincarnation"
    },
    {
        " is very common, where it often viewed as being part of an individuals progressive spiritual evolution toward realisation of their own divinity. In New Age literature, the reality of reincarnation is usually treated as self-evident, with no explanation as to why practitioners embrace this afterlife belief over others, although New Agers endorse it in the belief that it ensures cosmic justice. Many New Agers believe in ": null
    },
    {
        "karma": "karma"
    },
    {
        ", treating it as a law of cause and effect that assures cosmic balance, although in some cases they stress that it is not a system that enforces punishment for past actions.   In much New Age literature on reincarnation, it is claimed that part of the human soul, that which carries the personality, perishes with the death of the body, while the Higher Self – that which connects with divinity – survives in order to be reborn into another body. It is believed that the Higher Self chooses the body and circumstances into which it will be born, in order to use it as a vessel through which to learn new lessons and thus advance its own spiritual evolution. Prominent New Age writers like ": null
    },
    {
        "Shakti Gawain": "shakti gawain"
    },
    {
        " and ": null
    },
    {
        "Louise Hay": "louise hay"
    },
    {
        " therefore express the view that humans are responsible for the events that happen to them during their life, an idea that many New Agers regard as empowering. At times, past life regression are employed within the New Age in order to reveal a Higher Souls previous incarnations, usually with an explicit healing purpose. Some practitioners espouse the idea of a soul group or soul family , a group of connected souls who reincarnate together as family of friendship units. Rather than reincarnation, another afterlife belief found among New Agers holds that an individuals soul returns to a universal energy on bodily death.              In the mid-1990s, the New Age was found primarily in the United States and Canada, Western Europe, and Australia and New Zealand. The fact that most individuals engaging in New Age activity do not describe themselves as New Agers renders it difficult to determine the total number of practitioners. Heelas highlighted the range of attempts to establish the number of New Age participants in the U.S. during this period, noting that estimates ranged from 20,000 to 6 million; he believed that the higher ranges of these estimates were greatly inflated by, for instance, an erroneous assumption that all Americans who believed in reincarnation were part of the New Age. He nevertheless suggested that over 10 million people in the U.S. had had some contact with New Age practices or ideas. Between 2000 and 2002, Heelas and Woodhead conducted research into the New Age in the English town of ": null
    },
    {
        "Kendal": "kendal"
    },
    {
        ", ": null
    },
    {
        "Cumbria": "cumbria"
    },
    {
        "; they found 600 people actively attended New Age activities on a weekly basis, representing 1.6% of the towns population. From this, they extrapolated that around 900,000 Britons regularly took part in New Age activities. In 2006, Heelas stated that New Age practices had grown to such an extent that they were increasingly rivalling the sway of Christianity in western settings .     Sociological investigation indicates that certain sectors of society are more likely to engage in New Age practices than others. In the United States, the first people to embrace the New Age belonged to the ": null
    },
    {
        "baby boomer": "baby boomer"
    },
    {
        " generation, those born between 1946 and 1964.     Sutcliffe noted that although most influential New Age figureheads were male, approximately two-thirds of its participants were female. Heelas and Woodheads Kendal Project found that of those regularly attending New Age activities in the town, 80% were female, while 78% of those running such activities were female. They attributed this female dominance to deeply entrenched cultural values and divisions of labour in Western society, according to which women were accorded greater responsibility for the well-being of others, thus making New Age practices more attractive to them. They suggested that men were less attracted to New Age activities because they were hampered by a masculinist ideal of autonomy and self-sufficiency which discouraged them from seeking the assistance of others for their inner development.     The majority of New Agers are from the middle and upper-middle classes of Western society. Heelas and Woodhead found that of the active Kendal New Agers, 57% had a university or college degree. Their Kendal Project also determined that 73% of active New Agers were aged over 45, and 55% were aged between 40 and 59; it also determined that many got involved while middle-aged. Comparatively few were either young or elderly. Heelas and Woodhead suggested that the dominance of middle-aged people, particularly women, was because at this stage of life they had greater time to devote to their own inner development, with their time previously having been dominated by raising children. They also suggested that middle-aged people were experiencing more age-related ailments than the young, and thus more keen to pursue New Age activities to improve their health.          Heelas added that within the baby boomers, the movement had nevertheless attracted a diverse clientele. He typified the typical New Ager as someone who was well-educated yet disenchanted with mainstream society, thus arguing that the movement catered to those who believe that ": null
    },
    {
        "modernity": "modernity"
    },
    {
        " is in crisis. He suggested that the movement appealed to many former practitioners of the 1960s counter-culture because while they came to feel that they were unable to change society, they were nonetheless interested in changing the self. He believed that many individuals had been culturally primed for what the New Age has to offer , with the New Age attracting expressive people who were already comfortable with the ideals and outlooks of the movements self-spirituality focus. It could be particularly appealing because the New Age suited the needs of the individual, whereas traditional religious options that are available primarily catered for the needs of a community. He believed that although the adoption of New Age beliefs and practices by some fitted the model of ": null
    },
    {
        "religious conversion": "religious conversion"
    },
    {
        ", others who adopted some of its practices could not easily be considered to have converted to the religion. Sutcliffe described the typical participant in the New Age milieu as being a religious individualist, mixing and matching cultural resources in an animated spiritual quest .     The degree to which individuals are involved in the New Age varies. Heelas argued that those involved could be divided into three broad groups; the first comprised those who were completely dedicated to it and its ideals, often working in professions that furthered those goals. The second consisted of serious part-timers who worked in unrelated fields but who nevertheless spent much of their free time involved in movement activities. The third was that of casual part-timers who occasionally involved themselves in New Age activities but for whom the movement was not a central aspect of their life. MacKian instead suggested that involvement could be seen as being layered like an onion; at the core are consultative practitioners who devote their life to New Age practices, around that are serious practitioners who still invest considerable effort into New Age activities, and on the periphery are non-practitioner consumers , individuals affected by the general dissemination of New Age ideas but who do not devote themselves more fully to them. Many New Age practices have filtered into wider Western society, with a 2000 poll for instance revealing that 39% of the UK population had tried alternative therapies.     In 1995, Kyle stated that on the whole, New Agers in the United States preferred the values of the ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        " over those of the ": null
    },
    {
        "Republican Party": "republican party"
    },
    {
        ". He added that most New Agers soundly rejected the agenda of former Republican President ": null
    },
    {
        "Ronald Reagan": "ronald reagan"
    },
    {
        ".         MacKian suggested that this phenomenon was an inherently social mode of spirituality , one which cultivated a sense of belonging among its participants and encouraged relations both with other humans and with non-human, otherworldly spirit entities.   MacKian suggested that these communities may look very different from those of traditional religious groups.     Online connections were one of the ways that interested individuals met new contacts and established networks.              Some New Agers advocate living in a ": null
    },
    {
        "simple": "simple living"
    },
    {
        " and ": null
    },
    {
        "sustainable": "sustainable living"
    },
    {
        " manner to reduce humanitys impact on the ": null
    },
    {
        "natural resources": "natural resource"
    },
    {
        "of Earth; and they shun ": null
    },
    {
        "consumerism": "consumerism"
    },
    {
        ".  The New Age movement has been centered around rebuilding a ": null
    },
    {
        "sense of community": "sense of community"
    },
    {
        " to counter ": null
    },
    {
        "social disintegration": "social disintegration"
    },
    {
        "; this has been attempted through the formation of ": null
    },
    {
        "intentional communities": "intentional communities"
    },
    {
        ", where individuals come together to live and work in a communal lifestyle.  New Age centres have been set up in various parts of the world, representing an institutionalised form of the movement. Notable examples include the ": null
    },
    {
        "Naropa Institute": "naropa institute"
    },
    {
        " in ": null
    },
    {
        "Boulder, Colorado": "boulder, colorado"
    },
    {
        ", ": null
    },
    {
        "Holly Hock Farm": "holly hock farm"
    },
    {
        " near to ": null
    },
    {
        "Vancouver": "vancouver"
    },
    {
        ", the ": null
    },
    {
        "Wrekin Trust": "wrekin trust"
    },
    {
        " in ": null
    },
    {
        "West Malvern": "west malvern"
    },
    {
        ", ": null
    },
    {
        "Worcestershire": "worcestershire"
    },
    {
        ", and the ": null
    },
    {
        "Skyros Centre": "skyros centre"
    },
    {
        " in ": null
    },
    {
        "Skyros": "skyros"
    },
    {
        ". Criticising mainstream Western education as counterproductive to the ethos of the movement, many New Age groups have established their own schools for the education of children, although in other cases such groups have sought to introduce New Age spiritual techniques into pre-existing establishments.     Bruce argued that in seeking to denying the validity of externally imposed controls and privileging the divine within , the New Age sought to dismantle pre-existing social order, but that it failed to present anything adequate in its place. Heelas however cautioned that Bruce had arrived at this conclusion based on flimsy evidence , and Aldred argued that only a minority of New Agers participate in community-focused activities; instead, she claimed, the majority of New Agers participate mainly through the purchase of books and products targeted at the New Age market, positioning New Age as a primarily consumerist and commercial movement.         New Age spirituality has led to a wide array of literature on the subject and an active niche market, with books, music, crafts, and services in alternative medicine available at New Age stores, ": null
    },
    {
        "fair": "fair"
    },
    {
        "s, and ": null
    },
    {
        "festival": "festival"
    },
    {
        "s.   New Age fairs – sometimes known as Mind, Body, Spirit fairs , psychic fairs , or alternative health fairs – are spaces in which a variety of goods and services are displayed by different vendors, including forms of alternative medicine and esoteric practices such as palmistry or tarot card reading. A prominent example is the ": null
    },
    {
        "Mind Body Spirit Festival": "mind body spirit festival"
    },
    {
        ", held annually in the United Kingdom, at which – the religious studies scholar Christopher Partridge noted – one could encounter a wide range of beliefs and practices from crystal healing to ... Kirlian photography to psychic art, from angels to past-life therapy, from Theosophy to UFO religion, and from New Age music to the vegetarianism of Suma Chign Hai.  Similar festivals are held across Europe and in Australia and the United States.         A number of New Age proponents have emphasised the use of spiritual techniques as a tool for attaining financial prosperity, thus moving the movement away from its counter-cultural origins. Commenting on this New Age capitalism , Hess observed that it was largely small-scale and entrepreneurial, focused around small companies run by members of the ": null
    },
    {
        "petty bourgeoisie": "petty bourgeoisie"
    },
    {
        ", rather than being dominated by large scale multinational corporations. The links between New Age and commercial products have resulted in the accusation that New Age itself is little more than a manifestation of ": null
    },
    {
        "consumerism": "consumerism"
    },
    {
        ". This idea is generally rejected by New Age participants, who often reject any link between their practices and consumerist activities.     Embracing this attitude, various books have been published espousing such an ethos, established New Age centres have held spiritual retreats and classes aimed specifically at business people, and New Age groups have developed specialised training for businesses. During the 1980s, many prominent U.S. corporations—among them ": null
    },
    {
        "IBM": "ibm"
    },
    {
        ", ": null
    },
    {
        "AT & T": "at & t"
    },
    {
        ", and ": null
    },
    {
        "General Motors": "general motors"
    },
    {
        "—embraced New Age seminars, hoping that they could increase productivity and efficiency among their work force, although in several cases this resulted in employees bringing legal action against their employers, claiming that such seminars had infringed on their religious beliefs or damaged their psychological health. However, the use of spiritual techniques as a method for attaining ": null
    },
    {
        "profit": "profit"
    },
    {
        " has been an issue of major dispute within the wider New Age movement, with prominent New Agers such as Spangler and ": null
    },
    {
        "Matthew Fox": "matthew fox"
    },
    {
        " criticising what they see as trends within the community that are narcissistic and lack a social conscience. In particular, the movements commercial elements have caused problems given that they often conflict with its general economically-egalitarian ethos; as York highlighted, a tension exists in New Age between socialistic egalitarianism and capitalistic private enterprise .     Given that it encourages individuals to choose ": null
    },
    {
        "spiritual practices": "spiritual practices"
    },
    {
        " on the grounds of personal preference and thus encourages them to behave as a consumer, the New Age has been considered to be well suited to modern society.          The term  New Age music  is applied, sometimes in a derogative manner, to forms of ": null
    },
    {
        "ambient music": "ambient music"
    },
    {
        ", a genre that developed in the 1960s and was popularised in the 1970s, particularly with the work of ": null
    },
    {
        "Brian Eno": "brian eno"
    },
    {
        ". The genres relaxing nature resulted in it becoming popular within New Age circles, with some forms of the genre having a specifically New Age orientation.   Studies have determined that new-age music can be an effective component of ": null
    },
    {
        "stress management": "stress management"
    },
    {
        ".      The style began in the late 1960s and early 1970s with the works of free-form jazz groups recording on the ": null
    },
    {
        "ECM": "ecm"
    },
    {
        " label; such as ": null
    },
    {
        "Oregon": "oregon"
    },
    {
        ", the ": null
    },
    {
        "Paul Winter Consort": "paul winter consort"
    },
    {
        ", and other pre-ambient bands; as well as ambient music performer Brian Eno, classical avant-garde musician ": null
    },
    {
        "Daniel Kobialka": "daniel kobialka"
    },
    {
        ", Birosik, Patti Jean . The New Age Music Guide. Collier Books. . Werkhoven, Henk N. . The International Guide to New Age Music. Billboard Books / Crown Publishing Group. . and the ": null
    },
    {
        "psychoacoustic": "psychoacoustics"
    },
    {
        "  environments  recordings of ": null
    },
    {
        "Irv Teibel": "irv teibel"
    },
    {
        ".  In the early 1970s, it was mostly instrumental with both acoustic and electronic styles. New-age music evolved to include a wide range of styles from electronic ": null
    },
    {
        "space music": "space music"
    },
    {
        " using ": null
    },
    {
        "synthesizers": "synthesizer"
    },
    {
        "and acoustic instrumentals using ": null
    },
    {
        "Native American flutes": "native american flute"
    },
    {
        "and ": null
    },
    {
        "drum": "drum"
    },
    {
        "s, ": null
    },
    {
        "singing bowl": "singing bowl"
    },
    {
        "s, Australian ": null
    },
    {
        "didgeridoos": "didgeridoo"
    },
    {
        "and ": null
    },
    {
        "world music": "world music"
    },
    {
        " sounds to spiritual ": null
    },
    {
        "chant": "chant"
    },
    {
        "ing from other cultures.         While many commentators have focused on the spiritual and cultural aspects of the New Age movement, it also has a political component. The New Age political movement became visible in the 1970s, peaked in the 1980s, and continued into the 1990s. Kyle, Richard . The New Age Movement in American Culture. University Press of America, Chap.  8 . . The sociologist of religion Steven Bruce noted that the New Age provides ideas on how to deal with our socio-psychological problems . Scholar of religion James R. Lewis observed that, despite the common caricature of New Agers as narcissistic, significant numbers of them were trying to make the planet a better place on which to live,  and scholar J. Gordon Meltons New Age Encyclopedia included an entry called New Age politics .  Some New Agers have entered the political system in an attempt to advocate for the societal transformation that the New Age promotes.         Although New Age activists have been motivated by New Age concepts like holism, interconnectedness, monism, and environmentalism, their political ideas are diverse, ranging from ": null
    },
    {
        "far-right": "far right politics"
    },
    {
        " and ": null
    },
    {
        "conservative": "conservatism"
    },
    {
        " through to ": null
    },
    {
        "liberal": "liberalism"
    },
    {
        ", ": null
    },
    {
        "socialist": "socialism"
    },
    {
        ", and ": null
    },
    {
        "libertarian": "libertarianism"
    },
    {
        ". Accordingly, Kyle stated that New Age politics is difficult to describe and categorize. The standard political labels—left or right, liberal or conservative–miss the mark.  MacKian suggested that the New Age operated as a form of world-realigning infrapolitics that undermines the ": null
    },
    {
        "disenchantment": "disenchantment"
    },
    {
        " of modern Western society.          The extent to which New Age spokespeople mix religion and politics varies. New Agers are often critical of the established political order, regarding it as fragmented, unjust, hierarchical, patriarchal, and obsolete . The New Ager ": null
    },
    {
        "Mark Satin": "mark satin"
    },
    {
        " for instance spoke of New Age politics as a politically radical third force that was neither left nor right . He believed that in contrast to the conventional political focus on the institutional and economic symptoms of societys problems, his New Age politics would focus on psychocultural roots of these issues. Ferguson regarded New Age politics as a kind of Radical Centre , one that was not neutral, not middle-of-the-road, but a view of the whole road.  Fritjof Capra argued that Western societies have become sclerotic because of their adherence to an outdated and mechanistic view of reality, which he calls the Newtonian/Cartesian paradigm. In Capras view, the West needs to develop an organic and ecological systems view of reality in order to successfully address its social and political issues. ": null
    },
    {
        "Corinne McLaughlin": "corinne mclaughlin"
    },
    {
        " argued that politics need not connote endless power struggles, that a new spiritual politics could attempt to synthesize opposing views on issues into higher levels of understanding. Mayne, Alan J. . From Politics Past to Politics Future: An Integrated Analysis of Current and Emergent Paradigms. Praeger Publishers / Greenwood Publishing Group, p.  179. .     Many New Agers advocate ": null
    },
    {
        "globalisation": "globalisation"
    },
    {
        " and ": null
    },
    {
        "localisation": "glocalization"
    },
    {
        ", but reject ": null
    },
    {
        "nationalism": "nationalism"
    },
    {
        " and the role of the ": null
    },
    {
        "nation-state": "nation-state"
    },
    {
        ". Some New Age spokespeople have called for greater decentralisation and global unity, but are vague about how this might be achieved; others call for a global, centralised government. Satin for example argued for a move away from the nation-state and towards self-governing regions that, through improved global communication networks, would help engender world unity. ": null
    },
    {
        "Benjamin Creme": "benjamin creme"
    },
    {
        " conversely argued that the Christ, a great ": null
    },
    {
        "Avatar": "avatar"
    },
    {
        ", Maitreya, the ": null
    },
    {
        "World Teacher": "world teacher"
    },
    {
        ", expected by all the major religions as their Awaited One, would return to the world and establish a strong, centralised global government in the form of the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        "; this would be politically re-organised along a spiritual hierarchy. Kyle observed that New Agers often speak favourably of ": null
    },
    {
        "democracy": "democracy"
    },
    {
        " and citizens involvement in policy making but are critical of ": null
    },
    {
        "representative democracy": "representative democracy"
    },
    {
        " and ": null
    },
    {
        "majority rule": "majority rule"
    },
    {
        ", thus displaying elitist ideas to their thinking.              Scholars have noted several New Age political groups. Self-Determination: A Personal/Political Network, lauded by Ferguson Ferguson, Marilyn . The Aquarian Conspiracy: Personal and Social Transformation in the 1980s. Jeremy P. Tarcher Inc., distributed by Houghton Mifflin, pp.  232–235. . and Satin, Satin, Mark . New Age Politics: Healing Self and Society. Delta Books / Dell Publishing Co., pp.  219, 345. . was described at length by sociology of religion scholar Steven Tipton. Tipton, Steven M. . Getting Saved from the Sixties: Moral Meaning in Conversion and Cultural Change. University of California Press, pp.  267–270. . Founded in 1975 by California state legislator ": null
    },
    {
        "John Vasconcellos": "john vasconcellos"
    },
    {
        " and others, it encouraged Californians to engage in personal growth work and political activities at the same time, especially at the grassroots level. Tipton, cited above, pp.  267, 270. Hanegraaff noted another California-based group, the ": null
    },
    {
        "Institute of Noetic Sciences": "institute of noetic sciences"
    },
    {
        ", headed by author ": null
    },
    {
        "Willis Harman": "willis harman"
    },
    {
        ". It advocated a change in consciousness – in basic underlying assumptions – in order to come to grips with global crises. Kyle said that the New York City-based Planetary Citizens organization, headed by United Nations consultant and Earth at Omega author Donald Keys, sought to implement New Age political ideas.     Scholar J. Gordon Melton and colleagues focused on the New World Alliance, a Washington, DC-based organization founded in 1979 by Mark Satin and others. According to Melton et al., the Alliance tried to combine left- and right-wing ideas as well as personal growth work and political activities. Group decision-making was facilitated by short periods of silence. Sponsors of the Alliances national political newsletter included Willis Harman and John Vasconcellos. Stein, Arthur . Seeds of the Seventies: Values, Work, and Commitment in Post-Vietnam America. University Press of New England, p.  136. . Scholar James R. Lewis counted Green politics as one of the New Ages more visible activities. One academic book claims that the ": null
    },
    {
        "U.S. Green Party movement": "history of the green party of the united states"
    },
    {
        " began as an initiative of a handful of activists including ": null
    },
    {
        "Charlene Spretnak": "charlene spretnak"
    },
    {
        ", co-author of a new age interpretation of the German Green movement , and Mark Satin, author of New Age Politics. Ely, John . Green Politics in the United States and Europe . In Margit Mayer and John Ely, eds., The German Greens: Paradox Between Movement and Party. Temple University Press, p.  200. . Another academic publication says Spretnak and Satin largely co-drafted the U.S. Greens founding document, the Ten Key Values statement. ": null
    },
    {
        "Gaard, Greta": "greta gaard"
    },
    {
        " . Ecological Politics: Ecofeminists and the Greens. Temple University Press, pp.  142–143. .            While the term New Age may have fallen out of favor, scholar ": null
    },
    {
        "George Chryssides": "george chryssides"
    },
    {
        " notes that the New Age by whatever name is still alive and active in the 21st century. In the realm of politics, New Ager Mark Satins book Radical Middle reached out to mainstream liberals. Kilgore, Ed . Good Government: Time to Stop Bashing the Two-Party System .  Washington Monthly , pp.  58–59. The author is identified as the policy director of the ": null
    },
    {
        "Democratic Leadership Council": "democratic leadership council"
    },
    {
        ". ": null
    },
    {
        "Morris, Charles R.": "charles r. morris"
    },
    {
        " . What Works & What Doesnt .  Commonweal , pp.  24–25. York identified key New Age spokespeople including ": null
    },
    {
        "William Bloom": "william bloom"
    },
    {
        ", ": null
    },
    {
        "Satish Kumar": "satish kumar"
    },
    {
        ", and ": null
    },
    {
        "Starhawk": "starhawk"
    },
    {
        " who were emphasizing a link between spirituality and environmental consciousness. Former ": null
    },
    {
        "Esalen Institute": "esalen institute"
    },
    {
        " staffer Stephen Dinans Sacred America, Sacred World prompted a long interview of Dinan in  Psychology Today , which called the book a manifesto for our countrys evolution that is both political and deeply spiritual . ": null
    },
    {
        "Matousek, Mark": "mark matousek"
    },
    {
        " .  . ": null
    },
    {
        "Psychology Today": "psychology today"
    },
    {
        ". Retrieved 3 March 2017.     In 2013 longtime New Age author Marianne Williamson launched a campaign for a seat in the ": null
    },
    {
        "United States House of Representatives": "united states house of representatives"
    },
    {
        ", telling  The New York Times  that her type of spirituality was what American politics needed. America has swerved from its ethical center , she said. Lovett, Ian .  .  The New York Times , p.  19. Retrieved 3 March 2017. Running as an independent in west Los Angeles, she finished fourth in her districts ": null
    },
    {
        "open primary election": "open primaries in the united states"
    },
    {
        " with 13% of the vote. ": null
    },
    {
        "Cohen, Richard E.": "richard e. cohen"
    },
    {
        "; Barnes, James A. . The Almanac of American Politics 2016. Columbia Books & Information Services, p.   262. . In early 2019, Williamson announced her candidacy for the ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        " nomination for ": null
    },
    {
        "president of the United States": "president of the united states"
    },
    {
        " in the ": null
    },
    {
        "2020 United States presidential election": "2020 united states presidential election"
    },
    {
        ". Abcarian, Robin .  .  Los Angeles Times . Retrieved 20 February 2019. Peele, Anna .  .  The Washington Post , magazine section. Retrieved 19 February 2019. A 5,300-word article about ": null
    },
    {
        "her presidential campaign": "marianne williamson 2020 presidential campaign"
    },
    {
        " in  The Washington Post  said she had plans to fix America with love. Tough love .             Mainstream periodicals tended to be less than sympathetic; sociologist Paul Ray and psychologist Sherry Anderson discussed in their 2000 book  The Cultural Creatives , what they called the medias zest for attacking New Age ideas, and offered the example of a 1996 ": null
    },
    {
        "Lance Morrow": "lance morrow"
    },
    {
        " essay in  Time  magazine. Nearly a decade earlier, Time had run a long cover story critical of New Age culture; the cover featured a head shot of a famous actress beside the headline, Om.... THE NEW AGE starring Shirley MacLaine, faith healers, channelers, space travelers, and crystals galore .  Time  magazine , vol. 130, issue no. 23, front cover. The story itself, by former  Saturday Evening Post  editor ": null
    },
    {
        "Otto Friedrich": "otto friedrich"
    },
    {
        ", was sub-titled, A Strange Mix of Spirituality and Superstition Is Sweeping Across the Country . Friedrich, Otto . New Age Harmonies .  Time  magazine, vol. 130, issue no. 23, pp.  62–66. In 1988, the magazine  The New Republic  ran a four-page critique of New Age culture and politics by journalist ": null
    },
    {
        "Richard Blow": "richard bradley"
    },
    {
        " entitled simply, Moronic Convergence . Blow, Richard . Moronic Convergence .  The New Republic , pp.  24–27.     Some New Agers and New Age sympathizers responded to such criticisms. For example, sympathizers Ray and Anderson said that much of it was an attempt to stereotype the movement for idealistic and spiritual change, and to cut back on its popularity. New Age theoretician David Spangler tried to distance himself from what he called the New Age glamour of crystals, talk-show channelers, and other easily commercialized phenomena, and sought to underscore his commitment to the New Age as a vision of genuine social transformation.            Initially, academic interest in the New Age was minimal. The earliest academic studies of the New Age phenomenon were performed by specialists in the study of new religious movements such as ": null
    },
    {
        "Robert Ellwood": "robert ellwood"
    },
    {
        ". This research was often scanty because many scholars regarded the New Age as an insignificant cultural fad. Having been influenced by the U.S. ": null
    },
    {
        "anti-cult movement": "anti-cult movement"
    },
    {
        ", much of it was also largely negative and critical of New Age groups. The first truly scholarly study of the phenomenon was an ": null
    },
    {
        "edited volume": "edited volume"
    },
    {
        " put together by James R. Lewis and J. Gordon Melton in 1992. From that point on, the number of published academic studies steadily increased.     In 1994, ": null
    },
    {
        "Christoph Bochinger": "christoph bochinger"
    },
    {
        " published his study of the New Age in Germany,  New Age und moderne Religion. This was followed by Michael Yorks sociological study in 1995 and Richard Kyles U.S.-focused work in 1995. In 1996, Paul Heelas published a sociological study of the movement in Britain, being the first to discuss its relationship with business. That same year, Wouter Hanegraaff published New Age Religion and Western Culture, a historical analysis of New Age texts; Hammer later described it as having a well-deserved reputation as the standard reference work on the New Age . Most of these early studies were based on a textual analysis of New Age publications, rather than on an ": null
    },
    {
        "ethnographic": "ethnography"
    },
    {
        " analysis of its practitioners.     Sutcliffe and Gilhus argued that New Age studies could be seen as having experienced two waves; in the first, scholars focused on macro-level analyses of the content and boundaries of the movement , while the second wave featured more variegated and contextualized studies of particular beliefs and practices . Sutcliffe and Gilhus have also expressed concern that, as of 2013, New Age studies has yet to formulate a set of research questions scholars can pursue.   The New Age has proved a challenge for scholars of religion operating under more formative models of what religion is. By 2006, Heelas noted that the New Age was so vast and diverse that no scholar of the subject could hope to keep up with all of it.         Mainstream Christianity has typically rejected the ideas of the New Age; Christian critiques often emphasise that the New Age places the human individual before God. Most published criticism of the New Age has been produced by Christians, particularly those on the religions ": null
    },
    {
        "fundamentalist wing": "fundamentalist christianity"
    },
    {
        ". In the United States, the New Age became a major concern of ": null
    },
    {
        "evangelical": "evangelicalism"
    },
    {
        " Christian groups in the 1980s, an attitude that influenced British evangelical groups. During that decade, evangelical writers such as ": null
    },
    {
        "Constance Cumbey": "constance cumbey"
    },
    {
        ", ": null
    },
    {
        "Dave Hunt": "dave hunt"
    },
    {
        ", ": null
    },
    {
        "Gary North": "gary north"
    },
    {
        ", and ": null
    },
    {
        "Douglas Groothuis": "douglas groothuis"
    },
    {
        " published books criticising the New Age; a number propagated ": null
    },
    {
        "conspiracy theories": "conspiracy theories"
    },
    {
        " regarding its origin and purpose. The most successful such publication was ": null
    },
    {
        "Frank E. Perettis": "frank e. peretti"
    },
    {
        "1986 novel  This Present Darkness , which sold over a million copies; it depicted the New Age as being in league with ": null
    },
    {
        "feminism": "feminism"
    },
    {
        " and secular education as part of a conspiracy to overthrow Christianity.     Official responses to the New Age have been produced by major Christian organisations like the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        ", ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ", and ": null
    },
    {
        "Methodist Church": "methodist church"
    },
    {
        ".   The Roman Catholic Church published  A Christian reflection on the New Age  in 2003, following a six-year study; the 90-page document criticizes New Age practices such as yoga, meditation, ": null
    },
    {
        "feng shui": "feng shui"
    },
    {
        ", and crystal healing.  Handbook of vocational psychology by W. Bruce Walsh, Mark Savickas. 2005. p. 358. . According to the Vatican, euphoric states attained through New Age practices should not be confused with prayer or viewed as signs of Gods presence.  Cardinal ": null
    },
    {
        "Paul Poupard": "paul poupard"
    },
    {
        ", then-president of the ": null
    },
    {
        "Pontifical Council for Culture": "pontifical council for culture"
    },
    {
        ", said the New Age is a misleading answer to the oldest hopes of man . Monsignor ": null
    },
    {
        "Michael Fitzgerald": "michael l. fitzgerald"
    },
    {
        ", then-president of the ": null
    },
    {
        "Pontifical Council for Interreligious Dialogue": "pontifical council for interreligious dialogue"
    },
    {
        ", stated at the Vatican conference on the document: the Church avoids any concept that is close to those of the New Age .  There are also other Christian groups that have adopted a more positive view of the New Age, among them the ": null
    },
    {
        "Christaquarians": "christaquarians"
    },
    {
        ", and ": null
    },
    {
        "Christians Awakening to a New Awareness": "christians awakening to a new awareness"
    },
    {
        ", all of which believe that New Age ideas can enhance a persons Christian faith.            An issue of academic debate has been regarding the connection between the New Age and ": null
    },
    {
        "Modern Paganism": "modern paganism"
    },
    {
        ", sometimes termed Neo-paganism . The two phenomena have often been confused and conflated, particularly in Christian critiques. Religious studies scholar Sarah Pike asserted that there was a significant overlap between the two religious movements, while ": null
    },
    {
        "Aidan A. Kelly": "aidan a. kelly"
    },
    {
        " stated that Paganism parallels the New Age movement in some ways, differs sharply from it in others, and overlaps it in some minor ways . Other scholars have identified them as distinct phenomena that share overlap and commonalities. Hanegraaff suggested that whereas various forms of contemporary Paganism were not part of the New Age movement – particularly those that pre-dated the movement – other Pagan religions and practices could be identified as New Age. Partridge portrayed both Paganism and the New Age as different streams of ": null
    },
    {
        "occulture": "occulture"
    },
    {
        "  that merge at points.     Various differences between the two movements have been highlighted; the New Age movement focuses on an improved future, whereas the focus of Paganism is on the pre-Christian past. Similarly, the New Age movement typically propounds a ": null
    },
    {
        "universalist": "universalism"
    },
    {
        " message that sees all religions as fundamentally the same, whereas Paganism stresses the difference between ": null
    },
    {
        "monotheistic religions": "monotheism"
    },
    {
        " and those embracing a ": null
    },
    {
        "polytheistic": "polytheism"
    },
    {
        " or ": null
    },
    {
        "animistic": "animism"
    },
    {
        " theology. While the New Age emphasises a light-centred image, Paganism acknowledges both light and dark, life and death, and recognises the savage side of the natural world. Many Pagans have sought to distance themselves from the New Age movement, even using New Age as an insult within their community, while conversely many involved in the New Age have expressed criticism of Paganism for emphasizing the material world over the spiritual.   Many Pagans have expressed criticism of the high fees charged by New Age teachers, something not typically present in the Pagan movement, with some Pagans pronouncing the word newage to rhyme with ": null
    },
    {
        "sewage": "sewage"
    },
    {
        " .              One of the most contentious aspects of the New Age has been its adoption of spiritual ideas and practises from other, particularly non-Western cultures. Its belief that all traditions are free for anyone to use, rather than the ": null
    },
    {
        "private property": "private property"
    },
    {
        " of particular communities, has resulted in New Agers adopting and marketing the practices of ": null
    },
    {
        "Third World": "third world"
    },
    {
        " societies. These have included Hawaiian ": null
    },
    {
        "Kahuna": "kahuna"
    },
    {
        " magic, Australian Aboriginal dream-working, South American Amerindian  ayahuasca  and San Pedro ceremony, Hindu Ayurveda and yoga, and Chinese Feng Shui, ": null
    },
    {
        "Qi Gong": "qigong"
    },
    {
        ", and ": null
    },
    {
        "Tai Chi": "tai chi"
    },
    {
        " .     The New Age has been accused of ": null
    },
    {
        "cultural imperialism": "cultural imperialism"
    },
    {
        ", ": null
    },
    {
        "misappropriating": "cultural appropriation"
    },
    {
        " the sacred ceremonies, and abuse of the intellectual and cultural property of indigenous peoples. Mesteth, Wilmer, et al . At the Lakota Summit V, an international gathering of US and Canadian Lakota, Dakota and Nakota Nations, about 500 representatives from 40 different tribes and bands of the Lakota unanimously passed a Declaration of War Against Exploiters of Lakota Spirituality. The following declaration was unanimously passed. Hobson, G. The Rise of the White Shaman as a New Version of Cultural Imperialism. in: Hobson, Gary, ed. The Remembered Earth. Albuquerque, NM: Red Earth Press; 1978: 100–108. Aldred, Lisa, ": null
    },
    {
        "Plastic Shamans": "plastic shaman"
    },
    {
        "and Astroturf Sun Dances: New Age Commercialization of Native American Spirituality in: The American Indian Quarterly issn.24.3 pp.329–352. Lincoln: University of Nebraska Press.  Indigenous American spiritual leaders, such as Elders councils of the ": null
    },
    {
        "Lakota": "lakota people"
    },
    {
        ", ": null
    },
    {
        "Cheyenne": "cheyenne"
    },
    {
        ", ": null
    },
    {
        "Navajo": "navajo people"
    },
    {
        ", ": null
    },
    {
        "Creek": "muscogee"
    },
    {
        ", ": null
    },
    {
        "Hopi": "hopi"
    },
    {
        ", ": null
    },
    {
        "Chippewa": "ojibwe"
    },
    {
        ", and ": null
    },
    {
        "Haudenosaunee": "iroquois"
    },
    {
        " have denounced New Age misappropriation of their sacred ceremonies Yellowtail, Tom, et al;  Northern Cheyenne Nation, Two Moons Camp, Rosebud Creek, Montana; October 5, 1980 and other ": null
    },
    {
        "intellectual property": "indigenous intellectual property"
    },
    {
        ", Working Group on Indigenous Populations, accepted by the UN General Assembly,  ; UN Headquarters; New York City . stating that e value of these instructions and ceremonies are questionable, maybe meaningless, and hurtful to the individual carrying false messages . Traditional leaders of the Lakota, ": null
    },
    {
        "Dakota": "dakota people"
    },
    {
        ", and ": null
    },
    {
        "Nakota": "assiniboine"
    },
    {
        " peoples have reached consensus Taliman, Valerie . to reject the expropriation of ceremonial ways by non-Indians . They see the New Age movement as either not fully understanding, deliberately trivializing, or distorting their way of life,  and have declared war on all such ": null
    },
    {
        "plastic medicine people": "plastic shaman"
    },
    {
        " who are ": null
    },
    {
        "appropriating": "cultural appropriation"
    },
    {
        " their spiritual ways.     Indigenous leaders have spoken out against individuals from within their own communities who may go out into the world to become a white mans shaman, and any who are prostituting our spiritual ways for their own selfish gain, with no regard for the spiritual well-being of the people as a whole . The term ": null
    },
    {
        "plastic shaman": "plastic shaman"
    },
    {
        " or ": null
    },
    {
        "plastic medicine people": "plastic medicine people"
    },
    {
        " has been applied to outsiders who identify themselves as shamans, holy people, or other traditional spiritual leaders, but who have no genuine connection to the traditions or cultures they claim to represent. , Terry Macy and Daniel Hart, Native Voices, Indigenous Documentary Film at the University of Washington              Toward the end of the 20th century, some social and political analysts and activists were arguing that the New Age political perspective had something to offer mainstream society. Gerzon, Mark . A House Divided: Six Belief Systems Struggling for Americas Soul. A Jeremy P. Tarcher Putnam Book / G. P. Putnams Sons, Chap. 5 . . Mayne , cited above, Chap. 11 . Ray and Anderson , cited above, Chap. 7 . In 1987, some political scientists launched the Section on Ecological and Transformational Politics of the ": null
    },
    {
        "American Political Science Association": "american political science association"
    },
    {
        ", Preface: Paths to Transformational Politics . In Woolpert, Stephen; Slaton, Christa Daryl; and Schwerin, Edward W., eds. . Transformational Politics: Theory, Study, and Practice. State University of New York Press, pp.  ix–xi. . and an academic book prepared by three of them stated that the transformational politics concept was meant to subsume such terms as new age and new paradigm. Slaton, Christa Daryl; Woolpert, Stephen; Schwerin, Ed. Introduction: What Is Transformational Politics? In Woolpert et al. , cited above, p.  xix. In 1991, scholar of cultural studies ": null
    },
    {
        "Andrew Ross": "andrew ross"
    },
    {
        " suggested that New Age political ideas – however muddled and naïve – could help ": null
    },
    {
        "progressives": "progressivism in the united statesprogressivism in the 21st century"
    },
    {
        " construct an appealing alternative to both atomistic individualism and self-denying collectivism.  In 2005, British researcher Stuart Rose urged scholars of alternative religions to pay more attention to the New Ages interest in such topics as new socio-political thinking and New Economics , topics Rose discussed in his book Transforming the World: Bringing the New Age Into Focus, issued by a European academic publisher. Rose, Stuart . Transforming the World: Bringing the New Age Into Focus. ": null
    },
    {
        "Peter Lang": "peter lang"
    },
    {
        ", Chap. 8 . .     Other political thinkers and activists saw New Age politics less positively. On the political right, author ": null
    },
    {
        "George Weigel": "george weigel"
    },
    {
        " argued that New Age politics was just a retooled and pastel-colored version of leftism. Weigel, George . No Options . American Purpose, vol. 3, no. 3, pp.  21–22. Conservative evangelical writer Douglas Groothuis, discussed by scholars Hexham and Kemp, warned that New Age politics could lead to an oppressive world government. Groothuis, Douglas . Politics: Building an International Platform . In Hoyt, Karen, ed., The New Age Rage. Fleming H. Revell Company / Baker Publishing Group, pp.  92–93 and 103–105. . On the left, scholars argued that New Age politics was an oxymoron: that personal growth has little or nothing to do with political change. Jamison, Andrew . The Making of Green Knowledge: Environmental Politics and Cultural Transformation. Cambridge University Press, p.  169. . ": null
    },
    {
        "Žižek, Slavoj": "slavoj žižek"
    },
    {
        " . The Ticklish Subject: The Absent Centre of Political Ontology. Verso Books, pp.  1–2 and 70. . One political scientist said New Age politics fails to recognize the reality of economic and political power. Boggs, Carl . The End of Politics: Corporate Power and the Decline of the Public Sphere. Guilford Press, pp.  170–72. . Another academic, ": null
    },
    {
        "Dana L. Cloud": "dana l. cloud"
    },
    {
        ", wrote a lengthy critique of New Age politics as a political ideology; Cloud, Dana L. . Control and Consolation in American Culture and Politics: Rhetorics of Therapy. Sage Publications, Chap. 6 . . she faulted it for not being opposed to the ": null
    },
    {
        "capitalist system": "capitalist system"
    },
    {
        ", or to liberal individualism. Cloud , cited above, pp.  144, 147–48.     A criticism of New Age often made by leftists is that its focus on individualism deflects participants from engaging in socio-political activism. This perspective regards New Age as a manifestation of consumerism that promotes ": null
    },
    {
        "elitism": "elitism"
    },
    {
        " and indulgence by allowing wealthier people to affirm their socio-economic status through consuming New Age products and therapies. New Agers who do engage in socio-political activism have also been criticized. Journalist ": null
    },
    {
        "Harvey Wasserman": "harvey wasserman"
    },
    {
        " suggested that New Age activists were too averse to social conflict to be effective politically. Wasserman, Harvey . The New Age Movement: The Politics of Transcendence .  The Nation , p.  147 . Melton et al. found that New Age activists commitment to the often frustrating process of consensus decision-making led to extended meetings and minimal results , and a pair of futurists concluded that one once-promising New Age activist group had been both too visionary and too vague to last. Lipnack, Jessica; Stamps, Jeffrey . Networking: The First Report and Directory, Doubleday, p.  106. ": null
    }
]