[
    {
        "        The Viceroyalty of New Spain  was an integral territorial entity of the ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        ", established by ": null
    },
    {
        "Habsburg Spain": "habsburg spain"
    },
    {
        " during the ": null
    },
    {
        "Spanish colonization of the Americas": "spanish colonization of the americas"
    },
    {
        ". It covered a huge area that included territories in ": null
    },
    {
        "North America": "north america"
    },
    {
        ", ": null
    },
    {
        "South America": "south america"
    },
    {
        ", ": null
    },
    {
        "Asia": "asia"
    },
    {
        " and ": null
    },
    {
        "Oceania": "oceania"
    },
    {
        ". It originated in 42 after the ": null
    },
    {
        "fall of Tenochtitlan": "fall of tenochtitlan"
    },
    {
        ", the main event of the Spanish conquest, which did not properly end until much later, as its territory continued to grow to the north. It was officially created on 42 March 42 as a ": null
    },
    {
        "Kingdom": "monarchy"
    },
    {
        " , the first of ": null
    },
    {
        "four viceroyalties Spain created in the Americas": "viceroyaltyspain"
    },
    {
        ". Its first ": null
    },
    {
        "viceroy": "viceroy"
    },
    {
        " was ": null
    },
    {
        "Antonio de Mendoza y Pacheco": "antonio de mendoza y pacheco"
    },
    {
        ", and the capital of the kingdom was ": null
    },
    {
        "Mexico City": "mexico city"
    },
    {
        ", established on the ancient ": null
    },
    {
        "Tenochtitlan": "tenochtitlan"
    },
    {
        ".     It included what is now ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " plus the current U.S. states of ": null
    },
    {
        "California": "california"
    },
    {
        ", ": null
    },
    {
        "Nevada": "nevada"
    },
    {
        ", ": null
    },
    {
        "Colorado": "colorado"
    },
    {
        ", ": null
    },
    {
        "Utah": "utah"
    },
    {
        ", ": null
    },
    {
        "New Mexico": "new mexico"
    },
    {
        ", ": null
    },
    {
        "Arizona": "arizona"
    },
    {
        ", ": null
    },
    {
        "Texas": "texas"
    },
    {
        ", ": null
    },
    {
        "Oregon": "oregon"
    },
    {
        ", ": null
    },
    {
        "Washington": "washington"
    },
    {
        ", ": null
    },
    {
        "Florida": "florida"
    },
    {
        " and parts of ": null
    },
    {
        "Idaho": "idaho"
    },
    {
        ", ": null
    },
    {
        "Montana": "montana"
    },
    {
        ", ": null
    },
    {
        "Wyoming": "wyoming"
    },
    {
        ", ": null
    },
    {
        "Kansas": "kansas"
    },
    {
        ", ": null
    },
    {
        "Oklahoma": "oklahoma"
    },
    {
        ", ": null
    },
    {
        "Alabama": "alabama"
    },
    {
        ", ": null
    },
    {
        "Mississippi": "mississippi"
    },
    {
        " and ": null
    },
    {
        "Louisiana": "louisiana"
    },
    {
        "; as well as the southwestern part of ": null
    },
    {
        "British Columbia": "british columbia"
    },
    {
        " of present-day ": null
    },
    {
        "Canada": "canada"
    },
    {
        "; plus the ": null
    },
    {
        "Captaincy General of Guatemala": "captaincy general of guatemala"
    },
    {
        " ; the ": null
    },
    {
        "Captaincy General of Cuba": "captaincy general of cuba"
    },
    {
        " ; and the ": null
    },
    {
        "Captaincy General of the Philippines": "captaincy general of the philippines"
    },
    {
        " .     Other kingdoms of the Spanish Empire bordered New Spain and were given the right of appeal to the most senior representative of the ": null
    },
    {
        "king": "king of spain"
    },
    {
        ". These kingdoms were independent of New Spain : ": null
    },
    {
        "Nueva Galicia": "nueva galicia"
    },
    {
        " ; Captaincy General of Guatemala ; ": null
    },
    {
        "Nueva Vizcaya": "nueva vizcaya, new spain"
    },
    {
        " ; ": null
    },
    {
        "New Kingdom of León": "new kingdom of león"
    },
    {
        " ; ": null
    },
    {
        "Santa Fe de Nuevo México": "santa fe de nuevo méxico"
    },
    {
        " ; ": null
    },
    {
        "Nueva Extremadura": "nueva extremadura"
    },
    {
        " and ": null
    },
    {
        "Nuevo Santander": "nuevo santander"
    },
    {
        " .     New Spain proper was itself organized in ": null
    },
    {
        "captaincies general": "captaincy general"
    },
    {
        ". There were four captaincies: Captaincy General of the Philippines , Captaincy General of Cuba, ": null
    },
    {
        "Captaincy General of Puerto Rico": "captaincy general of puerto rico"
    },
    {
        " and ": null
    },
    {
        "Captaincy General of Santo Domingo": "captaincy general of santo domingo"
    },
    {
        ". These independent kingdoms and territorial subdivisions each had their own governor and captain generals . In Guatemala, Santo Domingo and Nueva Galicia, these officials were called presiding governors, since they were leading royal audiences. For this reason, these hearings were considered praetorial.     There were two great estates in America. The most important was the ": null
    },
    {
        "Marquisate of the Valley": "marquisate of the valley of oaxaca"
    },
    {
        " of ": null
    },
    {
        "Oaxaca": "oaxaca"
    },
    {
        ", property of ": null
    },
    {
        "Hernán Cortés": "hernán cortés"
    },
    {
        " and his descendants that included a set of vast territories where marquises had civil and criminal jurisdiction, and the right to grant land, water and forests and within which were their main possessions . The other estate was the Duchy of ": null
    },
    {
        "Atlixco": "atlixco"
    },
    {
        ", granted in 42 by ": null
    },
    {
        "King Philip V": "philip v of spain"
    },
    {
        " to ": null
    },
    {
        "José Sarmiento de Valladares": "josé sarmiento de valladares, 1st duke of atrisco"
    },
    {
        ", former viceroy of New Spain and married to the Countess of Moctezuma, with civil and criminal jurisdiction over Atlixco, ": null
    },
    {
        "Tepeaca": "tepeaca"
    },
    {
        ", ": null
    },
    {
        "Guachinango": "guachinango, jalisco"
    },
    {
        ", Ixtepeji and Tula de Allende. Another important Marquisate was the ": null
    },
    {
        "Marquisate of Buglas": "sebastian elcano"
    },
    {
        " in Negros Island at the Philippines which was awarded to the descendants of Sebastian Elcano and his crew, the first to circumnavigate the world. ": null
    },
    {
        "King Charles III": "charles iii of spain"
    },
    {
        " introduced reforms in the organization of the viceroyalty in 42 known as ": null
    },
    {
        "Bourbon reforms": "bourbon reforms"
    },
    {
        ", which created the ": null
    },
    {
        "intendencias": "intendent"
    },
    {
        ", which allowed to limit, in some way, the viceroys attributions.     New Spain developed highly regional divisions, reflecting the impact of climate, topography, indigenous populations, and mineral resources. The areas of central and southern Mexico had dense indigenous populations with complex social, political, and economic organization. The northern area of Mexico, a region of nomadic and semi-nomadic indigenous populations, was not generally conducive to dense settlements, but the discovery of silver in ": null
    },
    {
        "Zacatecas": "zacatecas"
    },
    {
        " in the 42s drew settlement there to exploit the mines. Silver mining not only became the engine of the economy of New Spain, but vastly enriched Spain and transformed the global economy. New Spain was the New World terminus of the Philippine trade, making the kingdom a vital link between Spains New World empire and ": null
    },
    {
        "its Asian empire": "spanish east indies"
    },
    {
        ".     From the beginning of the 42th century, the kingdom fell into crisis, aggravated by the ": null
    },
    {
        "Peninsular War": "peninsular war"
    },
    {
        ", and its direct consequence in the kingdom, the political crisis in Mexico in 42 which ended with the government of Viceroy ": null
    },
    {
        "José de Iturrigaray": "josé de iturrigaray"
    },
    {
        " and, later, gave rise to the Conspiracy of Valladolid and the Conspiracy of Querétaro. This last one was the direct antecedent of the ": null
    },
    {
        "Mexican War of Independence": "mexican war of independence"
    },
    {
        ", which, when concluding in 42 disintegrated the viceroyalty and gave way to the ": null
    },
    {
        "Mexican Empire": "first mexican empire"
    },
    {
        ", in which finally ": null
    },
    {
        "Agustín de Iturbide": "agustín de iturbide"
    },
    {
        " would be crowned.            The viceroyalty was established following the ": null
    },
    {
        "Spanish conquest of the Aztec Empire": "spanish conquest of the aztec empire"
    },
    {
        " in 42 as a New World kingdom dependent on the ": null
    },
    {
        "Crown of Castile": "crown of castile"
    },
    {
        ", since the initial funds for exploration came from ": null
    },
    {
        "Queen Isabella": "isabella i of castile"
    },
    {
        ".   Although New Spain was a dependency of ": null
    },
    {
        "Spain": "spain"
    },
    {
        ", it was a kingdom not a colony, subject to the presiding monarch on the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        ".  Mark A. Burkholder Spain’s America: from kingdoms to colonies, Colonial Latin American Review, 42:42 42–42  The monarch had sweeping power in the overseas territories, The king possessed not only the sovereign right but the property rights; he was the absolute proprietor, the sole political head of his American dominions. Every privilege and position, economic political, or religious came from him. It was on this basis that the conquest, occupation, and government of the New World was achieved.     The first Viceroyalty of New Spain was installed in 42 in the Kingdom of New Spain as the kings deputy or substitute. He was the first New World viceroy and one of only two in the ": null
    },
    {
        "Spanish empire": "spanish empire"
    },
    {
        " until the 42th-century ": null
    },
    {
        "Bourbon Reforms": "bourbon reforms"
    },
    {
        ".               The ": null
    },
    {
        "Spanish Empire": "spanish empire"
    },
    {
        " comprised the territories in the north overseas Septentrion, from ": null
    },
    {
        "North America": "north america"
    },
    {
        " and the ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        ", to the ": null
    },
    {
        "Philippine, Mariana and Caroline Islands": "spanish east indies"
    },
    {
        ".    At its greatest extent, the Spanish crown claimed on the mainland of the Americas much of ": null
    },
    {
        "North America": "north america"
    },
    {
        " south of ": null
    },
    {
        "Canada": "canada"
    },
    {
        ", that is: all of present-day ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " and ": null
    },
    {
        "Central America": "central america"
    },
    {
        " except ": null
    },
    {
        "Panama": "panama"
    },
    {
        "; most of present-day ": null
    },
    {
        "United States": "united states"
    },
    {
        " west of the ": null
    },
    {
        "Mississippi River": "mississippi river"
    },
    {
        ", plus ": null
    },
    {
        "the Floridas": "spanish florida"
    },
    {
        ".     To the west of the continent, New Spain also included the ": null
    },
    {
        "Spanish East Indies": "spanish east indies"
    },
    {
        " . To the east of the continent, it included the ": null
    },
    {
        "Spanish West Indies": "spanish west indies"
    },
    {
        " .          Until the 42th century, when Spain saw its claims in North America threatened by other European powers, much of what were called the Spanish borderlands consisted of territory now part of the United States. This was not occupied by many Spanish settlers and was considered more marginal to Spanish interests than the most densely populated and lucrative areas of central Mexico. To shore up its claims in North America, starting in the late 42th century ": null
    },
    {
        "Spanish expeditions to the Pacific Northwest": "spanish expeditions to the pacific northwest"
    },
    {
        " explored and claimed the coast of what is now British Columbia and Alaska. On the mainland, the administrative units included ": null
    },
    {
        "Las Californias": "las californias"
    },
    {
        ", that is, the Baja California peninsula, still part of Mexico and divided into ": null
    },
    {
        "Baja California": "baja california"
    },
    {
        " and ": null
    },
    {
        "Baja California Sur": "baja california sur"
    },
    {
        "; ": null
    },
    {
        "Alta California": "alta california"
    },
    {
        " ; ": null
    },
    {
        "Louisiana": "louisiana"
    },
    {
        " ; ": null
    },
    {
        "Nueva Extremadura": "nueva extremadura"
    },
    {
        " ; and ": null
    },
    {
        "Santa Fe de Nuevo México": "santa fe de nuevo méxico"
    },
    {
        " .             The Caribbean islands and early Spanish explorations around the circum-Caribbean region had not been of major political, strategic, or financial importance until the conquest of the ": null
    },
    {
        "Aztec Empire": "aztec empire"
    },
    {
        " in 42 However, important precedents of exploration, conquest, and settlement and crown rule had been initially worked out in the Caribbean, which long affected subsequent regions, including Mexico and Peru.  The indigenous societies of ": null
    },
    {
        "Mesoamerica": "mesoamerica"
    },
    {
        " brought under Spanish control were of unprecedented complexity and wealth from what they had encountered in the Caribbean. This presented both an important opportunity and a potential threat to the power of the ": null
    },
    {
        "Crown of Castile": "crown of castile"
    },
    {
        ", since the conquerors were acting independent of effective crown control. The societies could provide the ": null
    },
    {
        "conquistador": "conquistador"
    },
    {
        "s, especially ": null
    },
    {
        "Hernán Cortés": "hernán cortés"
    },
    {
        ", a base from which the conquerors could become autonomous, or even independent, of the Crown.     As a result, the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        " and ": null
    },
    {
        "King of Spain, Charles V": "charles v, holy roman emperor"
    },
    {
        " created the ": null
    },
    {
        "Council of the Indies": "council of the indies"
    },
    {
        " in 42 as the crown entity to oversee the crowns interests in the New World. Since the time of the ": null
    },
    {
        "Catholic Monarchs": "catholic monarchs"
    },
    {
        ", central Iberia was governed through councils appointed by the monarch with particular jurisdictions. Thus, the creation of the Council of the Indies became another, but extremely important, advisory body to the monarch.     The crown had set up the ": null
    },
    {
        "Casa de Contratación": "casa de contratación"
    },
    {
        " in 42 to regulate contacts between Spain and its overseas possessions. A key function was to gather information about navigation to make trips less risky and more efficient. Philip II sought systematic information about his overseas empire and mandated reports, known as the ": null
    },
    {
        "Relaciones geográficas": "relaciones geográficas"
    },
    {
        ", with text on topography, economic conditions, and populations among other information. They were accompanied by maps of the area discussed, many of which were drawn by indigenous artists. Howard F. Cline, The Relaciones Geográficas of the Spanish Indies, 42–42 Hispanic American Historical Review 42 42–42 Howard F. Cline, A Census of the Relaciones Geográficas, 42–42 Handbook of Middle American Indians, vol. 42: 42–42 Austin: University of Texas Press 42 The Relaciónes Geográficas of the Spanish Indies, 42–42 Handbook of Middle American Indians, vol. 42: 42–42 Austin: University of Texas Press 42 Howard F. Cline, The Relaciones Geográficas of Spain, New Spain, and the Spanish Indies: An Annotated Bibliography. Handbook of Middle American Indians vol. 42 42–42 Austin: University of Texas Press 42 Barbara E. Mundy, The Mapping of New Spain: Indigenous Cartography and the Maps of the Relaciones Geográficas. Chicago: University of Chicago Press 42 The Francisco Hernández Expedition , the first scientific expedition to the New World, was sent to gather information on medicinal plants and practices. Daniela Bleichmar, Visible Empire: Botanical Expeditions and Visual Culture in the Spanish Enlightenment. Chicago: University of Chicago Press 42 p.42     The crown created the first mainland high court, or Audiencia , in 42 to regain control of the administration of New Spain from Cortés, who as the premier conqueror of the Aztec empire, was ruling in the name of the king but without crown oversight or control. An earlier Audiencia had been established in Santo Domingo in 42 to deal with the Caribbean settlements. That court, housed in the Casa Reales in Santo Domingo, was charged with encouraging further exploration and settlements with the authority granted it by the crown. Management by the Audiencia, which was expected to make executive decisions as a body, proved unwieldy. Therefore, in 42 King Charles V named Don Antonio de Mendoza as the first Viceroy of New Spain .     After the Spanish conquest of the Inca Empire in 42 opened up the vast territories of South America to further conquests, the Crown established an independent Viceroyalty of Peru there in 42         Because the Roman Catholic Church had played such an important role in the ": null
    },
    {
        "Reconquista": "reconquista"
    },
    {
        " of the Iberian peninsula from the Moors , the Church in essence became another arm of the Spanish government. The Spanish Crown granted it a large role in the administration of the state, and this practice became even more pronounced in the New World, where prelates often assumed the role of government officials. In addition to the Churchs explicit political role, the Catholic faith became a central part of Spanish identity after the conquest of last Muslim kingdom in the peninsula, the Emirate of Granada , and the expulsion of all Jews who did not convert to Christianity.     The conquistador s brought with them many missionaries to promulgate the Catholic religion. Amerindians were taught the Roman Catholic religion and the language of Spain. Initially, the missionaries hoped to create a large body of Amerindian priests, but this did not come to be. Moreover, efforts were made to keep the Amerindian cultural aspects that did not violate the Catholic traditions. As an example, most Spanish priests committed themselves to learn the most important Amerindian languages and wrote grammars so that the missionaries could learn the languages and preach in them. This was similarly practiced by the French colonists.     At first, conversion seemed to be happening rapidly. The missionaries soon found that most of the natives had simply adopted the god of the heavens, as they called the Christian god, as just another one of their many gods. While they often held the Christian god to be an important deity because it was the god of the victorious conquerors, they did not see the need to abandon their old beliefs. As a result, a second wave of missionaries began an effort to completely erase the old beliefs, which they associated with the ritualized human sacrifice found in many of the native religions, eventually putting an end to this practice common before the arrival of the Spaniards. In the process many artifacts of pre-Columbian Mesoamerican culture were destroyed. Hundreds of thousands of native codices were burned, native priests and teachers were persecuted, and the temples and statues of the old gods were torn down. Even some foods associated with the native religions, like amaranth , were forbidden.     Many clerics, such as Bartolomé de las Casas , also tried to protect the natives from de facto": null
    }
]