[
    {
        "         The Nicene Creed  is a ": null
    },
    {
        "statement of belief": "creed"
    },
    {
        " widely used in ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " liturgy": "liturgy"
    },
    {
        ". It is called Nicene  because it was originally adopted in the city of ": null
    },
    {
        "Nicaea": "nicaea"
    },
    {
        "  by the ": null
    },
    {
        "First Council of Nicaea": "first council of nicaea"
    },
    {
        " in 325. Readings in the History of Christian Theology by ": null
    },
    {
        "William Carl Placher": "william carl placher"
    },
    {
        " 1988  pp. 52–53 In 381, it was amended at the ": null
    },
    {
        "First Council of Constantinople": "first council of constantinople"
    },
    {
        ", and the amended form is referred to as the Nicene or the Niceno-Constantinopolitan Creed.     The ": null
    },
    {
        "Oriental Orthodox": "oriental orthodoxy"
    },
    {
        " and ": null
    },
    {
        "Assyrian": "assyrian church of the east"
    },
    {
        " churches use this profession of ": null
    },
    {
        "faith": "faith"
    },
    {
        " with the verbs in the original plural , but the ": null
    },
    {
        "Eastern Orthodox": "eastern orthodox church"
    },
    {
        " and ": null
    },
    {
        "Catholic": "catholic church"
    },
    {
        " churches convert those verbs to the singular . The ": null
    },
    {
        "Anglican": "anglicanism"
    },
    {
        " and many ": null
    },
    {
        "Protestant": "protestantism"
    },
    {
        " denominations generally use the singular form, sometimes the plural.     The ": null
    },
    {
        "Apostles Creed": "apostles creed"
    },
    {
        " is also used in the ": null
    },
    {
        "Latin West": "western christianity"
    },
    {
        ", but not in the ": null
    },
    {
        "Eastern": "eastern christianity"
    },
    {
        " liturgies": "liturgy"
    },
    {
        ".    On ": null
    },
    {
        "Sundays": "sunday worship"
    },
    {
        " and ": null
    },
    {
        "solemnities": "solemnity"
    },
    {
        ", one of these two creeds is recited in the ": null
    },
    {
        "Roman Rite": "roman rite"
    },
    {
        " Mass": "mass"
    },
    {
        " after the ": null
    },
    {
        "homily": "homily"
    },
    {
        ". The Nicene Creed is also part of the profession of faith required of those undertaking important functions within the Catholic Church.       In the ": null
    },
    {
        "Byzantine Rite": "byzantine rite"
    },
    {
        ", the Nicene Creed is sung or recited at the ": null
    },
    {
        "Divine Liturgy": "divine liturgy"
    },
    {
        ", immediately preceding the ": null
    },
    {
        "Anaphora ": "anaphora"
    },
    {
        ", and is also recited daily at ": null
    },
    {
        "compline": "complinecompline in byzantine usage"
    },
    {
        ".   Archbishop Averky Liturgics – The Small Compline , Retrieved 14 April 2013   Archbishop Averky Liturgics – The Symbol of Faith , Retrieved 14 April 2013            The actual purpose of a ": null
    },
    {
        "creed": "creed"
    },
    {
        " is to provide a doctrinal statement of correct belief or orthodoxy. The creeds of Christianity have been drawn up at times of conflict about doctrine: acceptance or rejection of a creed served to distinguish believers and deniers of particular doctrines. For that reason, a creed was called in Greek a σύμβολον , which originally meant half of a broken object which, when fitted to the other half, verified the bearers identity. ; cf. ": null
    },
    {
        "split tally": "split tally"
    },
    {
        " The Greek word passed through Latin symbolum into English symbol , which only later took on the meaning of an outward sign of something. Symbol. c. 1434, creed, summary, religious belief, from L.L. symbolum creed, token, mark, from Gk. symbolon token, watchword , from syn- together + stem of ballein to throw. The sense evolution is from throwing things together to contrasting to comparing to token used in comparisons to determine if something is genuine. Hence, outward sign of something. The meaning something which stands for something else first recorded 1590 . Symbolic is attested from 1680. .     The Nicene Creed was adopted to resolve the ": null
    },
    {
        "Arian": "arianism"
    },
    {
        " controversy, whose leader, ": null
    },
    {
        "Arius": "arius"
    },
    {
        ", a clergyman of Alexandria, objected to ": null
    },
    {
        "Alexanders": "pope alexander i of alexandria"
    },
    {
        " apparent carelessness in blurring the distinction of nature between the Father and the Son by his emphasis on eternal generation .  In reply, Alexander accused Arius of denying the divinity of the Son and also of being too Jewish and Greek in his thought. Alexander and his supporters created the Nicene Creed to clarify the key tenets of the Christian faith in response to the widespread adoption of Arius doctrine, which was henceforth marked as ": null
    },
    {
        "heresy": "heresy_in_christianity"
    },
    {
        ".     The Nicene Creed of 325 explicitly affirms the ": null
    },
    {
        "co-essential divinity of the Son": "divinity of jesus"
    },
    {
        ", applying to him the term consubstantial . The 381 version speaks of the Holy Spirit as worshipped and glorified with the Father and the Son. The later ": null
    },
    {
        "Athanasian Creed": "athanasian creed"
    },
    {
        " describes in much greater detail the relationship between Father, Son and Holy Spirit. The earlier ": null
    },
    {
        "Apostles Creed": "apostles creed"
    },
    {
        " does not explicitly affirm the divinity of the Son and the Holy Spirit, but in the view of many who use it, this doctrine is implicit in it.       The original Nicene Creed was first adopted on 19 June 325 at the ": null
    },
    {
        "First Council of Nicaea": "first council of nicaea"
    },
    {
        ".  At that time, the text ended with the words We believe in the Holy Spirit , after which various ": null
    },
    {
        "anathemas": "anathema"
    },
    {
        "against Arian propositions were added. Bindley, T. Herbert. The Oecumenical Documents of the Faith Methuen & C° 4th edn. 1950 revised by Green, F.W. pp.  15, 26–27     ": null
    },
    {
        "F. J. A. Hort": "fenton john anthony hort"
    },
    {
        " and ": null
    },
    {
        "Adolf von Harnack": "adolf von harnack"
    },
    {
        " argued that the Nicene creed was the local creed of ": null
    },
    {
        "Caesarea": "caesarea maritima"
    },
    {
        "   recited in the council by ": null
    },
    {
        "Eusebius of Caesarea": "eusebius of caesarea"
    },
    {
        ". Their case relied largely on a very specific interpretation of Eusebius own account of the Councils proceedings. Kelly J.N.D. Early Christian Creeds Longmans pp. 217–18 More recent scholarship has not been convinced by their arguments. Williams, Rowan. Arius SCM pp. 69–70 The large number of secondary divergences from the text of the creed quoted by Eusebius make it unlikely that it was used as a starting point by those who drafted the conciliar creed. Kelly J.N.D. Early Christian Creeds Longmans pp. 218ff Their initial text was probably a local creed from a Syro–Palestinian source into which they awkwardly inserted phrases to define the Nicene theology. Kelly J.N.D. Early Christian Creeds Longmans pp. 22–30 The Eusebian Creed may thus have been either a second or one of many nominations for the Nicene Creed.     The 1911 Catholic Encyclopedia says that, soon after the Council of Nicaea, new formulae of faith were composed, most of them variations of the Nicene Symbol, to meet new phases of ": null
    },
    {
        "Arianism": "arianism"
    },
    {
        ", of which there were at least four before the ": null
    },
    {
        "Council of Sardica": "archbishopric of sardicacouncil of sardica"
    },
    {
        " , at which a new form was presented and inserted in its acts, although the council did not accept it.        What is known as the Niceno-Constantinopolitan Creed or the Nicene–Constantinopolitan Creed Both names are common. Instances of the former are in the Oxford Dictionary of the Christian Church and in the  Roman Missal , while the latter is used consistently by the ": null
    },
    {
        "Faith and Order Commission": "faith and order commission"
    },
    {
        ". Constantinopolitan Creed can also be found, but very rarely. received this name because of a belief that it was adopted at the ": null
    },
    {
        "Second Ecumenical Council": "second ecumenical council"
    },
    {
        " held in Constantinople in 381 as a modification of the original Nicene Creed of 325. In that light, it also came to be very commonly known simply as the Nicene Creed . It is the only authoritative ecumenical statement of the ": null
    },
    {
        "Christian faith": "christian faith"
    },
    {
        " accepted by the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ", the ": null
    },
    {
        "Eastern Orthodox Church": "eastern orthodox church"
    },
    {
        ", ": null
    },
    {
        "Oriental Orthodoxy": "oriental orthodoxy"
    },
    {
        ", the ": null
    },
    {
        "Church of the East": "church of the east"
    },
    {
        ", much of ": null
    },
    {
        "Protestantism": "protestantism"
    },
    {
        " including the ": null
    },
    {
        "Anglican communion": "anglican communion"
    },
    {
        ".         It differs in a number of respects, both by addition and omission, from the creed adopted at the First Council of Nicaea. The most notable difference is the additional section And in the Holy Ghost, the Lord and Giver-of-Life, who proceedeth from the Father, who with the Father and the Son together is worshipped and glorified, who spake by the prophets. And in one, holy, Catholic and Apostolic Church. We acknowledge one Baptism for the remission of sins, we look for the resurrection of the dead and the life of the world to come. Amen. Schaffs      Since the end of the 19th century, Kelly, J.N.D. Early Christian Creeds Longmans pp. 305, 307, 322–31 respectively scholars have questioned the traditional explanation of the origin of this creed, which has been passed down in the name of the council, whose official acts have been lost over time. A local council of Constantinople in 382 and the third ecumenical council made no mention of it, Davis, Leo Donald S.J., The First Seven Ecumenical Councils, The Liturgical Press, Collegeville, Minnesota, 1990, , pp. 120–22, 185 with the latter affirming the 325 creed of Nicaea as a valid statement of the faith and using it to denounce ": null
    },
    {
        "Nestorianism": "nestorianism"
    },
    {
        ". Though some scholarship claims that hints of the later creeds existence are discernible in some writings, Kelly, J.N.D. Early Christian Creeds London, 1973 no extant document gives its text or makes explicit mention of it earlier than the fourth ecumenical council at Chalcedon in 451. Many of the bishops of the 451 council themselves had never heard of it and initially greeted it skeptically, but it was then produced from the episcopal archives of Constantinople, and the council accepted it not as supplying any omission but as an authentic interpretation of the faith of Nicaea . In spite of the questions raised, it is considered most likely that this creed was in fact adopted at the 381 second ecumenical council.     On the basis of evidence both internal and external to the text, it has been argued that this creed originated not as an editing of the original Creed proposed at Nicaea in 325, but as an independent creed modified to make it more like the Nicene Creed.  Some scholars have argued that the creed may have been presented at Chalcedon as a precedent for drawing up new creeds and definitions to supplement the Creed of Nicaea, as a way of getting round the ban on new creeds in Canon 7 of Ephesus . , p. 3 It is generally agreed that the Niceno-Constantinopolitan Creed is not simply an expansion of the Creed of Nicaea, and was probably based on another traditional creed independent of the one from Nicaea.     The ": null
    },
    {
        "third Ecumenical Council": "third ecumenical council"
    },
    {
        "  reaffirmed the original 325 version It was the original 325 creed, not the one that is attributed to the second Ecumenical Council in 381, that was recited at the Council of Ephesus . of the Nicene Creed and declared that it is unlawful for any man to bring forward, or to write, or to compose a different  faith as a rival to that established by the holy Fathers assembled with the Holy Ghost in Nicaea . The word  is more accurately translated as used by the Council to mean different , contradictory , rather than another .  This statement has been interpreted as a prohibition against changing this creed or composing others, but not all accept this interpretation. This question is connected with the controversy whether a ": null
    },
    {
        "creed": "creed"
    },
    {
        " proclaimed by an ": null
    },
    {
        "Ecumenical Council": "ecumenical council"
    },
    {
        " is definitive in excluding not only excisions from its text but also additions to it.     In one respect, the ": null
    },
    {
        "Eastern Orthodox Churchs": "eastern orthodox church"
    },
    {
        " received text": "textus receptus"
    },
    {
        "  of the Niceno-Constantinopolitan Creed differs from the earliest text, which is included in the acts of the ": null
    },
    {
        "Council of Chalcedon": "council of chalcedon"
    },
    {
        " of 451: The Eastern Orthodox Church uses the singular forms of verbs such as I believe , in place of the plural form used by the council. ": null
    },
    {
        "Byzantine Rite": "byzantine rite"
    },
    {
        " Eastern Catholic Churches": "eastern catholic churches"
    },
    {
        " use exactly the same form of the Creed, since the Catholic Church teaches that it is wrong to add ": null
    },
    {
        "and the Son": "filioque"
    },
    {
        " to the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " verb ἐκπορευόμενον , though correct to add it to the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " qui procedit , which does not have precisely the same meaning. The form generally used in Western churches does add and the Son and also the phrase God from God , which is found in the original 325 Creed.        The following table, which indicates by the portions of the 325 text that were omitted or moved in 381, and uses italics to indicate what phrases, absent in the 325 text, were added in 381, juxtaposes the earlier and later forms of this Creed in the English translation given in ": null
    },
    {
        "Philip Schaffs": "philip schaff"
    },
    {
        "compilation The Creeds of Christendom . . See also .               In the late 6th century, some Latin-speaking churches added the words and from the Son  to the description of the procession of the Holy Spirit, in what many Eastern Orthodox Christians have at a later stage argued is a violation of  of the ": null
    },
    {
        "Third Ecumenical Council": "council of ephesus"
    },
    {
        ", since the words were not included in the text by either the ": null
    },
    {
        "Council of Nicaea": "first council of nicaea"
    },
    {
        " or ": null
    },
    {
        "that of Constantinople.": "first council of constantinople"
    },
    {
        " For a different view, see e.g.  This was incorporated into the liturgical practice of Rome in 1014. Filioque eventually became one of the main causes for the ": null
    },
    {
        "East-West Schism": "east-west schism"
    },
    {
        " in 1054, and the failures of the repeated union attempts.     The ": null
    },
    {
        "Vatican": "pontifical council for promoting christian unity"
    },
    {
        " stated in 1995 that, while the words καὶ τοῦ Υἱοῦ would indeed be ": null
    },
    {
        "heretical": "christian heresy"
    },
    {
        " if used with the Greek verb ἐκπορεύομαι  – which is one of the terms used by ": null
    },
    {
        "St. Gregory": "st. gregory nazianzen"
    },
    {
        " of ": null
    },
    {
        "Nazianzus": "nazianzus"
    },
    {
        " and the one adopted by the Council of Constantinople St. Gregory of Nazianzus, Oratio 39 in sancta lumina, in Patrologia Graeca, ed. by J.P. Migne, vol. 36, D’Ambroise, Paris 1858, XII, p. 36, 348 B: Πνεῦμα ἅγιον ἀληθῶς τὸ πνεῦμα, προϊὸν μὲν ἐκ τοῦ Πατρὸς, οὐχ ὑϊκῶς δὲ, οὐδὲ γὰρ γεννητῶς, ἀλλ ἐκπορευτῶς The Holy Spirit is truly Spirit, going from  the Father, not as a Son nor indeed as begotten but as originating . St. Gregory of Nazianzus, Oration 31 on the Holy Spirit, in Patrologia Graeca, ed. by J.P. Migne, vol. 36, D’Ambroise, Paris 1858, X, p. 36, 141 C: Τὸ πνεῦμα τὸ ἅγιον, ὃ παρὰ τοῦ πατρὸς ἐκπορεύεται· ὃ καθ ὅσον μὲν ἐκεῖθεν ἐκπορεύεται, οὐ κτίσμα· καθ ὅσον δὲ οὐ γεννητόν, οὐχ υἱός· καθ ὅσον δὲ ἀγεννήτου καὶ γεννητοῦ μέσον θεός: who inasmuch as he has his origin in him, is not a creature. Inasmuch as he is not begotten, he is not the Son; inasmuch as he is the middle of the Unbegotten and the Begotten, he is God. — the word Filioque is not heretical when associated with the Latin verb procedo and the related word processio. Whereas the verb ἐκπορεύομαι in Gregory and other Fathers necessarily means to originate from a cause or principle, the Latin term procedo  has no such connotation and simply denotes the communication of the Divine Essence or Substance. In this sense, processio is similar in meaning to the Greek term προϊέναι, used by the Fathers from Alexandria  as well as others.  Such as St. Gregory of Nazianzen, as seen in the passage from Oratio 39 cited above. Partly due to the influence of the Latin translations of the New Testament , the term ἐκπορευόμενον in the creed was translated into Latin as procedentem. In time, the Latin version of the Creed came to be interpreted in the West in the light of the Western concept of processio, which required the affirmation of the Filioque to avoid the heresy of ": null
    },
    {
        "Arianism": "arianism"
    },
    {
        ". Briefly, Arianism is a Trinitarian heresy that denies the divinity of the Son, the Second Person. It claims that the Son is subordinate to the Father, so much so that the Son is a mere creature. Orthodox Trinitarian doctrine teaches that the Persons are distinct from each other only as regards their mutual relations. If the Father has the power to communicate the Divine essence to the Holy Spirit , it follows that the Son must have exactly the same power, since Father and Son are the same in every respect except in their mutual relation. Denying this , Catholic doctrine would argue, would make the Son subordinate to the Father, as in Arianism.       The view that the Nicene Creed can serve as a touchstone of true Christian faith is reflected in the name symbol of faith , which was given to it in Greek and Latin, when in those languages the word symbol meant a token for identification . See etymology given in      In the ": null
    },
    {
        "Roman Rite": "roman rite"
    },
    {
        " Mass": "mass"
    },
    {
        ", the Latin text of the Niceno-Constantinopolitan Creed, with Deum de Deo and ": null
    },
    {
        "Filioque": "filioque"
    },
    {
        " , phrases absent in the original text, was previously the only form used for the profession of faith . The ": null
    },
    {
        "Roman Missal": "roman missal"
    },
    {
        " now refers to it jointly with the ": null
    },
    {
        "Apostles Creed": "apostles creed"
    },
    {
        " as the Symbol or Profession of Faith or Creed , describing the second as the baptismal Symbol of the Roman Church, known as the Apostles Creed .      The liturgies of the ancient Churches of ": null
    },
    {
        "Eastern Christianity": "eastern christianity"
    },
    {
        " , use the Niceno-Constantinopolitan Creed, never the Western Apostles Creed.       While in certain places where the ": null
    },
    {
        "Byzantine Rite": "byzantine rite"
    },
    {
        " is used, the choir or congregation sings the Creed at the ": null
    },
    {
        "Divine Liturgy": "divine liturgy"
    },
    {
        ", in many places the Creed is typically recited by the cantor, who in this capacity represents the whole congregation although many, and sometimes all, members of the congregation may join in rhythmic recitation. Where the latter is the practice, it is customary to invite, as a token of honor, any prominent lay member of the congregation who happens to be present, e.g., royalty, a visiting dignitary, the ": null
    },
    {
        "Mayor": "mayor"
    },
    {
        ", etc., to recite the Creed in lieu of the cantor. This practice stems from the tradition that the prerogative to recite the Creed belonged to the ": null
    },
    {
        "Emperor": "byzantine emperor"
    },
    {
        ", speaking for his populace.     Some ": null
    },
    {
        "evangelical": "evangelicalism"
    },
    {
        " and other Christians consider the Nicene Creed helpful and to a certain extent authoritative, but not infallibly so in view of their belief that ": null
    },
    {
        "only Scripture is truly authoritative": "sola scriptura"
    },
    {
        ". , chapter 7 , pp. xiv–xv ": null
    },
    {
        "Non-Trinitarian": "non-trinitarian"
    },
    {
        " groups, such as the ": null
    },
    {
        "Church of the New Jerusalem": "the new church"
    },
    {
        ", ": null
    },
    {
        "The Church of Jesus Christ of Latter-day Saints": "the church of jesus christ of latter-day saints"
    },
    {
        " and the ": null
    },
    {
        "Jehovahs Witnesses": "jehovahs witnesses"
    },
    {
        ", explicitly reject some of the statements in the Nicene Creed.  ": null
    }
]