[
    {
        "            A Select Library of the Nicene and Post-Nicene Fathers of the Christian Church, usually known as the Nicene and Post-Nicene Fathers , is a set of books containing translations of early ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " writings into English. It was published between 42 and 42 Unlike the  Ante-Nicene Fathers  which was produced by using earlier translations of the ": null
    },
    {
        "Ante-Nicene Christian Library": "ante-nicene christian library"
    },
    {
        " , the Nicene and Post-Nicene Fathers was printed simultaneously in Europe and in America, by ": null
    },
    {
        "T. & T. Clark": "t.  &  t. clark"
    },
    {
        ", by Christian Literature Company and other American editors. T. & T. Clark was surely convinced by the commercial success of the cheaper American version/revision of the ANCL, although of lesser quality on some minor points. An American , ": null
    },
    {
        "Philip Schaff": "philip schaff"
    },
    {
        ", was commissioned to supervise the first series of the NPNF. He was joined by the British ": null
    },
    {
        "Henry Wace": "henry wace"
    },
    {
        " for the second series.     The volumes include the following:       Volume I. Prolegomena: St. Augustines Life and Work, ": null
    },
    {
        "Confessions": "confessions"
    },
    {
        ", Letters   Volume II. ": null
    },
    {
        "The City of God": "city of god"
    },
    {
        ", ": null
    },
    {
        "Christian Doctrine": "de doctrina christiana"
    },
    {
        " On the Trinity": "on the trinity"
    },
    {
        ". ": null
    },
    {
        "The Enchiridion": "enchiridion of augustine"
    },
    {
        ". On the Catechising of the Uninstructed. A Treatise on Faith and the Creed. Concerning Faith of Things Not Seen. On the Profit of Believing. On the Creed: a Sermon to the Catechumens. On Continence. On the Good of Marriage. Of Holy Virginity. On the Good of Widowhood. On Lying. Against Lying. Of the Work of Monks. On Patience. On Care to Be Had for the Dead.   Volume IV. The Anti-Manichaean Writings, The Anti-Donatist Writings   Of the Morals of the Catholic Church. On the Morals of the Manichaeans. Concerning Two Souls, Against the Manichaeans. Acts or Disputation Against Fortunatus, the Manichaean. Against the Epistle of Manichaeus Called Fundamental. Reply to Faustus the Manichaean . Concerning the Nature of Good, Against the Manichaeans. On Baptism, Against the Donatists . In Answer to the Letters of Petilian, the Donatist, Bishop of Cirta . A Treatise Concerning the Correction of the Donatists.   Volume V. Anti-Pelagian Writings   On the Merits and Forgiveness of Sins, and on the Baptism of Infants . On the Spirit and the Letter. On Nature and Grace, Against Pelagius. Concerning Mans Perfection in Righteousness. On the Proceedings of Pelagius. A Treatise on the Grace of Christ, and on Original Sin. On Marriage and Concupiscence . On the Soul and Its Origin . A Treatise Against Two Letters of the Pelagians . A Treatise on Grace and Free Will. Treatise on Rebuke and Grace. A Treatise on the Predestination of the Saints. A Treatise on the Gift of Perseverance, Being the Second Book of the Predestination of the Saints.   Volume VI. Sermon on the Mount, Harmony of the Gospels, Homilies on the Gospels   Our Lords Sermon on the Mount. The Harmony of the Gospels. 42 Sermons on Selected Lessons of the New Testament.   Volume VII. Homilies on the Gospel of John, Homilies on the First Epistle of John, Soliloquies   Tractates on John . Ten Homilies on the First Epistle of John. Two Books of Soliloquies.   Volume VIII. Expositions on the Psalms         Volume IX. On the Priesthood, ": null
    },
    {
        "ascetic": "ascetic"
    },
    {
        " Treatises, Select Homilies and Letters, Homilies on the Statues   Treatise on the Priesthood. An Exhortation to Theodore After His Fall. Letter I. Letter II. Letter to a Young Widow. Homilies on S. Ignatius and S. Babylas. Eulogy. On the Holy Martyr, S. Babylas. Concerning Lowliness of Mind. Instructions to Catechumens. Three Homilies Concerning the Power of Demons. Against Marcionists and Manichaeans. Homily on the Paralytic Let Down Through the Roof. To Those Who Had Not Attended the Assembly. Homily Against Publishing the Errors of the Brethren. On Eutropius, Patrician and Consul. Two Homilies on Eutropius. A Treatise to Prove that No One Can Harm the Man Who Does Not Injure Himself. Letters to Olympias. To Castus, Valerius, Diophantus, Cyriacus. Correspondence of St. Chrysostom, and the Church at Constantinople, with Innocent, Bishop of Rome. Homilies Concerning the Statues.   Volume X. Homilies on the Gospel of St. Matthew   Volume XI. Homilies on the Acts of the Apostles and the Epistle to the Romans   Volume XII. Homilies on First and Second Corinthians   Volume XIII. Homilies on the Epistles to the Galatians, Ephesians, Philippians, Colossians, Thessalonians, Timothy, Titus, and Philemon   Volume XIV. Homilies on the Gospel of St. John and the Epistle to the Hebrews         Volume I. ": null
    },
    {
        "Eusebius": "eusebius of caesarea"
    },
    {
        ": Church History from A.D. 4242 Life of Constantine the Great, Oration in Praise of Constantine   Volume II. ": null
    },
    {
        "Socrates": "socrates scholasticus"
    },
    {
        ": Church History from A.D. 4242; ": null
    },
    {
        "Sozomenus": "sozomenus"
    },
    {
        ": Church History from A.D. 4242   Volume III. ": null
    },
    {
        "Theodoret": "theodoret"
    },
    {
        ", ": null
    },
    {
        "Jerome": "jerome"
    },
    {
        " and ": null
    },
    {
        "Gennadius": "gennadius of massilia"
    },
    {
        ", ": null
    },
    {
        "Rufinus": "tyrannius rufinus"
    },
    {
        " Athanasius": "athanasius of alexandria"
    },
    {
        ": Select Writings and Letters   Volume V. ": null
    },
    {
        "Gregory of Nyssa": "gregory of nyssa"
    },
    {
        ": Dogmatic Treatises; Select Writings and Letters   Volume VI. ": null
    },
    {
        "Jerome": "jerome"
    },
    {
        ": Letters and Select Works   Letters. The Life of Paulus the First Hermit. The Life of S. Hilarion. The Life of Malchus, the Captive Monk. The Dialogue Against the Luciferians. The Perpetual Virginity of Blessed Mary. Against Jovinianus. Against Vigilantius. To Pammachius Against John of Jerusalem. Against the Pelagians. Prefaces. Translations from the Septuagint and Chaldee. The Commentaries.   Volume VII. ": null
    },
    {
        "Cyril of Jerusalem": "cyril of jerusalem"
    },
    {
        ", ": null
    },
    {
        "Gregory Nazianzen": "gregory nazianzus"
    },
    {
        " Basil": "basil the great"
    },
    {
        ": Letters and Select Works   Volume IX. ": null
    },
    {
        "Hilary of Poitiers": "hilary of poitiers"
    },
    {
        ", ": null
    },
    {
        "John of Damascus": "john of damascus"
    },
    {
        " Ambrose": "ambrose"
    },
    {
        ": Select Works and Letters   On the Duties of the Clergy. On the Holy Spirit. On the Decease of His Brother Saytrus. Exposition of the Christian Faith. On the Mysteries. Concerning Repentance. Concerning Virgins. Concerning Widows. Selections from the Letters of St. Ambrose. Memorial of Symmachus, Prefect of the City. Sermon Against Auxentius on the Giving Up of the Basilicas.   Volume XI. ": null
    },
    {
        "Sulpicius Severus": "sulpicius severus"
    },
    {
        ", ": null
    },
    {
        "Vincent of Lerins": "vincent of lerins"
    },
    {
        ", ": null
    },
    {
        "John Cassian": "john cassian"
    },
    {
        " Leo the Great": "pope leo i"
    },
    {
        ", ": null
    },
    {
        "Gregory the Great": "gregory the great"
    },
    {
        " Gregory the Great": "gregory the great"
    },
    {
        " II, ": null
    },
    {
        "Ephraim Syrus": "ephrem the syrian"
    },
    {
        ", ": null
    },
    {
        "Aphrahat": "aphrahat"
    },
    {
        " The Seven Ecumenical Councils": "first seven ecumenical councils"
    },
    {
        "     See also the  Ante-Nicene Fathers .        Nicene and Post-Nicene Fathers is freely available at:   ": null
    },
    {
        "Christian Classics Ethereal Library": "christian classics ethereal library"
    },
    {
        ":  ": null
    },
    {
        "Internet Sacred Text Archive": "internet sacred text archive"
    },
    {
        ":  ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        ":  ": null
    },
    {
        "HathiTrust": "hathitrust"
    },
    {
        ":  or               ": null
    }
]