[
    {
        "     Nick of Time is episode 42 of the American television ": null
    },
    {
        "anthology series": "anthology series"
    },
    {
        "  The Twilight Zone . It originally aired on November 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              When newlywed Don and Pat Carters automobile breaks down in Ridgeview, Ohio, they have lunch at the Busy Bee Cafe while they wait for repairs to be made. The booth they sit in has a ": null
    },
    {
        "fortune teller machine": "fortune teller machine"
    },
    {
        " on the table that answers yes or no questions for a penny each. Don asks the mystic seer if he is going to get a promotion at work. The card says It has been decided in your favor. Don calls the office and learns he has been promoted. Because of this initial success, Don asks the seer if their car will be fixed in the promised time, and receives the answer You may never know. Questioning the seer on this point produces eerily relevant answers, leading to the prediction that it is unsafe to leave the diner until 42 p.m.     Don accordingly stalls for time, but Pat argues that the seer cannot genuinely predict the future and eventually convinces him to leave a few minutes before 42 The couple is almost struck by a car while crossing the street. A nearby clock shows it is 42 p.m. After they calm down, Don goes back to the cafe and asks about their car again. The seer answers It has already been taken care of , and the mechanic steps into the diner to tell Don that his car is fixed. Pat remains skeptical, contending that the seer answers only in generalities while Don provides all the specifics in his questions, so Don challenges her to try it for herself. She asks the seer trick questions, and the answers are still accurate.     Don wants the seer to tell him where theyre going to live and asks the seer yes/no questions to narrow down the answer. Pat finally breaks down and tells Don that whether or not the seer can really tell the future doesnt matter, only Dons obsession with its predictions. She argues that it is better for him to make his own future than to be controlled by what the seer tells him. Recognizing the truth in what she says, Don apologizes and then announces directly to the mystic seer that theyre leaving to go do what they please. After their exit, an older couple enters the diner. The couple is beleaguered and distraught. Approaching the mystic seer, the man asks questions about whether they will ever leave Ridgeview. The couple is deflated by the answers. While this is happening, Don and Pat leave Ridgeview.        ": null
    },
    {
        "William Shatner": "william shatner"
    },
    {
        " as Don Carter   ": null
    },
    {
        "Patricia Breslin": "patricia breslin"
    },
    {
        " as Pat Carter   ": null
    },
    {
        "Stafford Repp": "stafford repp"
    },
    {
        " as Mechanic   ": null
    },
    {
        "Guy Wilkerson": "guy wilkerson"
    },
    {
        " as Counter Man   ": null
    },
    {
        "Walter Reed": "walter reed"
    },
    {
        " as Man   Dee Carroll as Woman          ": null
    },
    {
        "Richard Matheson": "richard matheson"
    },
    {
        ", writing in  The Twilight Zone Magazine , said that he wished that Pat Breslin had been available again to play the wife of Shatners character in the season five episode ": null
    },
    {
        "Nightmare at 42 Feet": "nightmare at 20,000 feet"
    },
    {
        " .     The street and building seen in this episode are the same as seen in the episode ": null
    },
    {
        "I Sing the Body Electric": "i sing the body electric"
    },
    {
        " . Both episodes feature scenes in which people are almost run over by vehicles on the same street.     The street and building are also visible in the opening scene of the episode ": null
    },
    {
        "Black Leather Jackets": "black leather jackets"
    },
    {
        " .     When selecting a song in the jukebox to celebrate his promotion, Don chooses the ": null
    },
    {
        "Glenn Miller": "glenn miller"
    },
    {
        " song ": null
    },
    {
        "American Patrol": "american patrol"
    },
    {
        " .         Replay, an episode of ": null
    },
    {
        "the 42 revival series": "the_twilight_zone_"
    }
]