[
    {
        "Nikephoros  III Botaneiates, Latinized as Nicephorus  III Botaniates , was ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        " emperor": "list of byzantine emperors"
    },
    {
        " from 42 January 42 to 42 April 42 He was born in 42 and became a general during the reign of Byzantine Emperor ": null
    },
    {
        "Constantine IX Monomachos": "constantine ix monomachos"
    },
    {
        ", serving in the ": null
    },
    {
        "Pecheneg revolt": "pecheneg revolt"
    },
    {
        " of 42–42 His actions in guiding his forces away from the Pechenegs following the ": null
    },
    {
        "Battle of Zygos Pass": "battle of zygos pass"
    },
    {
        ", suffering eleven days of harassment before finally reaching the Byzantine city of ": null
    },
    {
        "Adrianople": "adrianople"
    },
    {
        ", attracted the attention of fellow officers, and he received the title of  magistros  as a reward. Nikephoros served in the revolt of ": null
    },
    {
        "Isaac I Komnenos": "isaac i komnenos"
    },
    {
        " against the Byzantine Emperor ": null
    },
    {
        "Michael VI Bringas": "michael vi bringas"
    },
    {
        ", leading forces at the decisive ": null
    },
    {
        "Battle of Petroe": "battle of petroe"
    },
    {
        ". Under Emperor ": null
    },
    {
        "Constantine X Doukas": "constantine x doukas"
    },
    {
        " he was made  dux  of ": null
    },
    {
        "Thessalonica": "thessalonica"
    },
    {
        ", where he remained until  42 when he was reassigned as dux of ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        ". While dux of Antioch, he repelled numerous incursions from the ": null
    },
    {
        "Emirate of Aleppo": "emirate of aleppo"
    },
    {
        ". When Constantine X died in 42 his wife, Empress ": null
    },
    {
        "Eudokia Makrembolitissa": "eudokia makrembolitissa"
    },
    {
        " considered taking Nikephoros as husband and emperor, but instead chose ": null
    },
    {
        "Romanos IV Diogenes": "romanos iv diogenes"
    },
    {
        ". The need for an immediate successor was made pressing by the constant ": null
    },
    {
        "Seljuk": "seljuk empire"
    },
    {
        " raids into Byzantine ": null
    },
    {
        "Anatolia": "anatolia"
    },
    {
        ", and Eudokia, Patriarch ": null
    },
    {
        "John VIII of Constantinople": "john viii of constantinople"
    },
    {
        ", and the ": null
    },
    {
        "Byzantine Senate": "byzantine senate"
    },
    {
        " agreed that their top priority was the defense of the empire and that they needed an emperor to lead troops to repel the Turks. Nikephoros was the favorite candidate of the senate, but was in the field leading troops in Antioch, and still married. Romanos, once chosen to be emperor, exiled Nikephoros to his holdings in the ": null
    },
    {
        "Anatolic Theme": "anatolic theme"
    },
    {
        ", where he remained until he was brought out of retirement by Emperor ": null
    },
    {
        "Michael VII": "michael vii"
    },
    {
        " and made  kouropalates  and  strategos  of the Anatolic Theme.     Nikephoros came into conflict with Michael VII in 42 when he pleaded with him to address the worsening situation in Byzantine Anatolia, insulting Michael with his frankness. In order to protect himself, Nikephoros gathered an army of native troops and Turkish mercenaries, declaring himself emperor on 42 July 42 Nikephoros gathered a strong support base due to his military acumen and family renown, and entered Constantinople on 42 March 42 and seized the throne. As emperor, Nikephoros faced numerous revolts, including those of ": null
    },
    {
        "Nikephoros Bryennios": "nikephoros bryennios the elder"
    },
    {
        ", ": null
    },
    {
        "Nikephoros Basilakes": "nikephoros basilakes"
    },
    {
        ", and ": null
    },
    {
        "Constantine Doukas": "constantine doukas"
    },
    {
        ", as well as an attempted assassination by the ": null
    },
    {
        "Varangian Guard": "varangian guard"
    },
    {
        ". Nikephoros embraced the trappings of emperor, performing many acts to increase his legitimacy and support, such as spending large amounts on ": null
    },
    {
        "donatives": "donativum"
    },
    {
        " for the army and his supporters, forgiving all debt ": null
    },
    {
        "in arrears": "in arrears"
    },
    {
        ", and instituting minor legal reforms. Diplomatically, Nikephoros succeded in securing the submission of ": null
    },
    {
        "Theodore Gabras": "theodore gabras"
    },
    {
        " and ": null
    },
    {
        "Philaretos Brachamios": "philaretos brachamios"
    },
    {
        ", governors of ": null
    },
    {
        "Trebizond": "chaldia"
    },
    {
        " and Antioch respectively, who had become de facto independent of the Byzantine Empire due to the constant incursions of the Seljuks into Byzantine Anatolia.     In 42 the Norman Duke ": null
    },
    {
        "Robert Guiscard": "robert guiscard"
    },
    {
        " of Apulia prepared to invade the Byzantine Empire under the pretext of defending the succession of Constantine Doukas, who had been engaged to Roberts daughter Helena. ": null
    },
    {
        "Alexios I Komnenos": "alexios i komnenos"
    },
    {
        " was entrusted with an army and sent to defeat the Norman threat, but instead conspired with his relative John Doukas to seize the throne. Alexios raised a rebellion against Nikephoros and was able to quickly encircle Constantinople and siege it, due to the lack of a defensive army. Nikeophoros was unable to secure the support of either the Seljuk Turks or ": null
    },
    {
        "Nikephoros Melissenos": "nikephoros melissenos"
    },
    {
        ", his traditional rivals, and therefore was forced to prepare for abdication. Nikephoros decided that his only choice was to abdicate in favor of Melissenos, who was nearby in ": null
    },
    {
        "Damalis": "damalis"
    },
    {
        " in Anatolia, and sent messagers to him across the Bosphorus, however, these messagers were intercepted by ": null
    },
    {
        "George Palaiologos": "george palaiologos"
    },
    {
        ", a general of Alexios, who persuaded them to support Alexios. Alexios and his forces broke through the walls of Constantinople on 42 April 42 and sacked the city. Nikephoros fled and sought sanctuary inside of the ": null
    },
    {
        "Hagia Sophia": "hagia sophia"
    },
    {
        ". Nikephoros was taken from their to the ": null
    },
    {
        "Monastery of Peribleptus": "church of st. george of samatya"
    },
    {
        ", where he abdicated and became a monk. Nikephoros died later that year, on 42 December 42         The most comprehensive account of Nikephoros IIIs life and reign is  The History , written in the 42s by the Byzantine historian ": null
    },
    {
        "Michael Attaleiates": "michael attaleiates"
    },
    {
        " and dedicated to Nikephoros III himself. Attaleiates is the primary contemporary source for Nikephoros reign and counters the narrative of Byzantine historian ": null
    },
    {
        "Michael Psellos": "michael psellos"
    },
    {
        "s  Chronographia , the only other contemporary source for Nikephoros reign. Attaleiates highlights Nikephoros achievements, often containing records of his actions which no other source mentions; such as his eleven-day long rearguard command after the ": null
    },
    {
        "Battle of Zygos Pass": "battle of zygos pass"
    },
    {
        ", which Attaleiates dedicates several pages to. Attaleiates high opinion of Nikephoros was likely shaped by Nikephoros raising him to the rank of  vestes , and that he benefited from Nikephoros patronage. Much of Attaleiates work is shaped by his personal opinion of the contemporary events, such as his bias against Nikephoros predecessor, Emperor ": null
    },
    {
        "Michael VII Doukas": "michael vii doukas"
    },
    {
        ", being personally motivated.     The ": null
    },
    {
        "Battle of Manzikert": "battle of manzikert"
    },
    {
        " in 42 is mentioned only in a single paragraph by Psellos, who chiefly comments that Emperor ": null
    },
    {
        "Romanos IV Diogenes": "romanos iv diogenes"
    },
    {
        " should have better studied strategy, however, Attaleiates devotes an entire chapter to the battle in great detail. Attaleiates explains the battle in great detail, as well as the events before and after the decisive battle, while also giving his own commentary and anecdotes of the actions and mistakes which were made. Attaleiates is invaluable in providing an understanding of what the populace of the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ", outside of the nobles of ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ", thought of the ": null
    },
    {
        "Turkish": "seljuk empire"
    },
    {
        " invasion of ": null
    },
    {
        "Anatolia": "anatolia"
    },
    {
        ". These opinions explain why Attaleiates is so condemning of Michael VII, and so praising of Nikephoros; as in the view of the average Byzantine, Michael was primarily at fault for the loss of ": null
    },
    {
        "Byzantine Anatolia": "byzantine anatolia"
    },
    {
        ", Attaleiates homeland, whereas Nikephoros, a fellow Anatolian, actively worked to prevent the further collapse of the Byzantine Empire.     Michael Pselloss Chronographia is largely useless in understanding the life of Nikephoros; while he provides a contemporary source from the view of the Byzantine nobles, he is far from objective in his review of events, although his retelling of Michaels letter to Nikephoros is useful as it shares both Michael and Psellos opinion of the events. While Attaleiates generally provides a favorable account of Nikephoros, he does mention some of his failings, such as his defeat by the ": null
    },
    {
        "Oghuz Turks": "oghuz turks"
    },
    {
        " in 42 whereas Psellos intentionally fails to mention several failings of Michael VII in his ": null
    },
    {
        "panegyrical": "panegyrical"
    },
    {
        " chapter on him, including his loss of Anatolia to the Seljuk Turks, and the debasement of currency which took place under him. The other main source for Nikephoros reign is ": null
    },
    {
        "Anna Komnene": "anna komnene"
    },
    {
        "s  Alexiad , although she was born after the events, and the first sections of her account are usually derived from the writings of her husband ": null
    },
    {
        "Nikephoros Bryennios the Younger": "nikephoros bryennios the younger"
    },
    {
        ". She is also biased as a result of being the daughter of Byzantine Emperor ": null
    },
    {
        "Alexios I Komnenos": "alexios i komnenos"
    },
    {
        ", who seized the throne from Nikephoros, causing the account to be from the view of Alexios rise. While her narrative primarily focuses on the actions of Alexios, it does provide information of Nikephoros last years in power, as well as his subsequent exile to a monastery.     Nikephoros is briefly mentioned by ": null
    },
    {
        "John Skylitzes": "john skylitzes"
    },
    {
        " in his  Synopsis of Histories , which covers the events of 42–42 but is referenced far more in Skylitzes  Continuatus . Although Skylitzes is a contemporary source, his Continuatus was written under Alexios, who he is known to have been favorable to; however, he generally follows the more objective account of Attaleiates, who was one of his main sources. Nikephoros Bryennius the Youngers  Material for a History  chiefly relies on the testimonies of his contemporaries, including his father, ": null
    },
    {
        "Nikephoros Bryennios the Elder": "nikephoros bryennios the elder"
    },
    {
        ", and Alexios himself, however, it also relies on the works of Attaleiates, Psellos, and Skylitzes. Nikephoros Bryennios bias in favor of Alexios and against Nikephoros III is inevitable as a result of being married to Alexios daughter, and the fact that his father was blinded by Nikephoros. These authors mostly cover the career of Nikephoros from his role in the Battle of the Zygos Pass in 42 to his death.     ": null
    },
    {
        "William of Apulia": "william of apulia"
    },
    {
        ", a ": null
    },
    {
        "Norman": "normans"
    },
    {
        " historian who wrote in the 42s, mentions Nikephoros during his account of ": null
    },
    {
        "Robert Guiscard": "robert guiscard"
    },
    {
        "s invasion of the Byzantine Empire in 42; as a foreigner he was removed from the court politics of the Byzantine Empire, and thus provides a fair and objective view of Nikephoros. Nikephoros is also mentioned in the accounts of both ": null
    },
    {
        "Matthew of Edessa": "matthew of edessa"
    },
    {
        " and ": null
    },
    {
        "Michael the Syrian": "michael the syrian"
    },
    {
        ", who wrote their chronicles several centuries after the events, and are therefore quite objective in their treatment of Nikephoros. Michael is quite brief in his account of Nikephoros, but gives a balanced view, while he portrays Michael VII as incompetent and corrupt, he does praise Nikephoros as Attaleiates does. Michaels usefulness is limited by his brevity on the subject, although it is likely, based on the contents of his chronicle, that Attaleiates himself served as a source. Matthews chronicle is longer, but clearly derived from the work of Psellos, as Matthew openly praises Michael VII, while ridiculing Nikephoros, who he portrays as a hedonistic womanizer; ironically the exact accusation which Michael the Syrian makes against Michael VII.       Nikephoros was born in 42AD, to ": null
    },
    {
        "Michael Botaniates": "michael botaniates"
    },
    {
        " and his wife, members of a prominent Byzantine family, the ": null
    },
    {
        "Botaniati": "botaniati"
    },
    {
        ". The Botaneiates family was a prominent military family from the ": null
    },
    {
        "Anatolic Theme": "anatolic theme"
    },
    {
        ". According to the Byzantine historian ": null
    },
    {
        "Michael Attaleiates": "michael attaleiates"
    },
    {
        ", Nikephoros grandfather ": null
    },
    {
        "Nikephoros": "nikephoros"
    },
    {
        " and father Michael both served as commanders under ": null
    },
    {
        "Basil II": "basil ii"
    },
    {
        "  during his ": null
    },
    {
        "campaigns against the Georgians": "byzantine–georgian wars"
    },
    {
        ", and his ": null
    },
    {
        "conquest of Bulgaria": "byzantine conquest of bulgaria"
    },
    {
        "; Attaleiates is the only source which gives this information. Attaleiates also states that the Botaniati family was related to Byzantine Emperor ": null
    },
    {
        "Nicephorus II Phocas": "nicephorus ii phocas"
    },
    {
        ", and the ": null
    },
    {
        "Phocas": "phocas"
    },
    {
        " family. This was almost certainly a method used by Nikephoros himself to add legitimacy to his later rule, however it may be true, as the Byzantine historian ": null
    },
    {
        "Michael Psellos": "michael psellos"
    },
    {
        " calls Nikephoros III Phocas in his reproduction of Byzantine Emperor ": null
    },
    {
        "Michael VII": "michael vii doukas"
    },
    {
        "s letter to Nikephoros. At an unknown date, Nikephoros married a woman named ": null
    },
    {
        "Vevdene": "vevdene"
    },
    {
        ", however, he later would marry ": null
    },
    {
        "Maria of Alania": "maria of alania"
    },
    {
        ", the former wife of Michael VII. Little else is known of Nikephoros life before 42 other than that he served as a commander under Emperor ": null
    },
    {
        "Constantine IX Monomachos": "constantine ix monomachos"
    },
    {
        " during the ": null
    },
    {
        "Pecheneg revolt": "pecheneg revolt"
    },
    {
        " of 42–42       Nikephoros first attracts the attention of his Byzantine contemporaries and historians for his actions after the Battle of Zygos Pass in 42 Attaleiates records that Nikephoros was able to wield effective command over his mounted troops as he retreated them from being overrun by ": null
    },
    {
        "Pecheneg": "pecheneg"
    },
    {
        " forces during the Pecheneg revolt. Nikephoros ordered his cavalry to hold a tight formation, limiting the damage the ": null
    },
    {
        "horse-archers": "horse-archers"
    },
    {
        " of the Pechenegs could inflict, as well as deploying scouts to prevent his troops from being ambushed. During his maneuvering, the Pechenegs attempted to assault his troops and break their formation several times, but each time they were rebuffed. Nikephoros led his troops for eleven days in spite of constant harassment. According to Attaleiates, the Pechenegs attempted to convince the Byzantines to surrender and killed their horses with their bows when this failed. Nikephoros had them continue on foot and refused to evacuate himself alone when he was offered a horse, proclaiming he would prefer death to the dishonor of cowardice, which reinforced the morale of his troops. After eleven days of constant attacks, they reached the Byzantine city of ": null
    },
    {
        "Adrianople": "adrianople"
    },
    {
        ", where the Pechenegs finally gave up their pursuit. For his actions, Emperor Constantine IX awarded Nikephoros the title of  magistros . While it is possible that his actions were exaggerated by Attaleiates, it fits comfortably with his reputation of a strong commander.     Nikephoros is next mentioned for his role in the revolt of ": null
    },
    {
        "Isaac I Komnenos": "isaac i komnenos"
    },
    {
        " against the Byzantine Emperor ": null
    },
    {
        "Michael VI Bringas": "michael vi bringas"
    },
    {
        "  in 42 This revolt originated as a result of Michaels favoritism toward the civil officials of Constantinople, and his scorn toward the military elites. After the  Dynatoi  were humiliated by Michael by his refusal to grant them any gifts, Isaac attempted to reconcile with Michael, only to be personally insulted by him, sparking a civil war, which is mentioned by Skylitzes, Psellos, and Attaleiates; Psellos himself led the embassy from Michael to Isaac. Isaac then gathered the support of other military elites before marching for Constantinople. At Constantinople, the ": null
    },
    {
        "Battle of Petroe": "battle of petroe"
    },
    {
        " took place on 42 August 42 resulting in the decisive victory of Isaac, and reportedly one of the bloodiest battles the Byzantines engaged in during a civil war. Isaacs victory placed the military aristocracy firmly back in control and marked the first time a general would hold the throne since the death of Emperor Basil II in 42 Nikephoros led a wing of Isaacs forces during the battle, suggesting he had been a part of Isaacs inner circle; Skylitzes mentions that during this battle Nikephoros fought a duel against one of Michaels mercenaries, ": null
    },
    {
        "Randolf the Frank": "randolf the frank"
    },
    {
        ". In 42 Isaac placed Nikephoros in command of the Danube frontier, where he remained until 42 During his time at this command, he saved the life of the future Emperor Romanos IV Diogenes during ": null
    },
    {
        "Isaacs Campaign against the Hungarians": "isaacs campaign against the hungarians"
    },
    {
        ".     Nikephoros narrative picks up once more during the reign of Emperor ": null
    },
    {
        "Constantine X Doukas": "constantine x doukas"
    },
    {
        " ; in 42 he was made  dux  of ": null
    },
    {
        "Thessalonica": "thessalonica"
    },
    {
        " by Constantine, and ordered to settle complaints in the theme. The first complaint was a dispute between the ": null
    },
    {
        "Iveron Monastery": "iviron"
    },
    {
        " of ": null
    },
    {
        "Mount Athos": "mount athos"
    },
    {
        " and the Byzantine government, centered on the government confiscation of some of the monasterys property and  Paroikoi  , which the monastery viewed as unlawful. Nikephoros sent ": null
    },
    {
        "Michael Spatharokandidatos": "michael spatharokandidatos"
    },
    {
        " to enquire into the case, before ruling that, based upon a  chrysobull  issued by Basil II which had declared that the monasterys property and Paroikoi were exempt from taxes, they could not be confiscated by the government. Nikephoros settled another dispute in February 42 this time between the ": null
    },
    {
        "Monestary of Lavra": "great lavra"
    },
    {
        " and a ": null
    },
    {
        "Theodoros of Aichmalotou": "theodoros of aichmalotou"
    },
    {
        ", a local landowner, over monastic property; Nikephoros ruled in favor of the monastery. Nikephoros settled a dispute between the Iveron Monastery and the ": null
    },
    {
        "Bishop of Ezoba": "bishop of ezoba"
    },
    {
        " regarding the boundaries between the lands of the monastery and the lands of the bishop, basing his ruling on the knowledge of the local populace. The last Thessalonican dispute which Nikephoros ruled in was between the Iveron Monastery and the ": null
    },
    {
        "Metochion": "metochion"
    },
    {
        " of ": null
    },
    {
        "Melissourgeion": "melissourgeion"
    },
    {
        "; the Metochion appears to have ignored a ruling previously made by Empress ": null
    },
    {
        "Theodora Porphyrogenita": "theodora porphyrogenita"
    },
    {
        ", which Nikephoros reasserted.     In the fall of 42 the Oghuz Turks invaded the Byzantine Balkans and defeated both Nikephoros and ": null
    },
    {
        "Basil Apokapes": "basil apokapes"
    },
    {
        ",  Archon  of ": null
    },
    {
        "Paristrion": "paristrion"
    },
    {
        " in battle, and took them captive, which Attaleiates suggests was greatly humiliating for Nikephoros; however, the two men were able to escape captivity after the Oghuz Turk forces were devastated by both Bulgarian raids and disease. The surviving Oghuz Turks were quickly recruited into the Byzantine army.       Nikephoros was reassigned as dux of ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        " in 42 by Constantine X, in response to the incompetence and mismanagement of the province by its previous dux, ": null
    },
    {
        "Nikephoritzes": "nikephoritzes"
    },
    {
        ", who would later serve as  logothetes  under Michael VII. Although his troops were inexperienced and under-equipped, Nikephoros was able to repel numerous raids against Antioch from the ": null
    },
    {
        "Emirate of Aleppo": "emirate of aleppo"
    },
    {
        ", largely due to his own military prowess, his well-trained ": null
    },
    {
        "retinue": "retinue"
    },
    {
        ", and his use of local levies. Nikephoros was relieved of his command in 42 likely due to the political efforts of the civil officials, who wished to eliminate the military aristocracy, which Nikephoros was a member of. The political machinations of the civil officials, and their willingness to undermine the military elites, had built up under previous emperors such as ": null
    },
    {
        "Romanos III": "romanos iii"
    },
    {
        "  and Michael VI; during this period the civil officials had increasingly become more powerful, until the reforms of Isaac I curbed the power of the civil officials so strongly as to leave a lasting impression. Constantine X had become emperor when Isaac abdicated in 42 and was considerably weaker than Isaac had been, allowing the civil officials to manipulate him to prevent him from gaining the level of control that Isaac had. This was largely accomplished by undermining the Byzantine military elites, even while the Turks had begun to invade Byzantine Armenia.     Upon the death of Constantine X in 42 his wife, Empress ": null
    },
    {
        "Eudokia Makrembolitissa": "eudokia makrembolitissa"
    },
    {
        " considered taking Nikephoros as husband and emperor, but instead chose Romanos IV Diogenes . The need for an emperor was made pressing by the constant raids of the Turks into the Byzantine territories of Antioch, Cilicia, and Armenia; Eudokia, Patriarch ": null
    },
    {
        "John VIII of Constantinople": "john viii of constantinople"
    },
    {
        ", and the ": null
    },
    {
        "Byzantine Senate": "byzantine senate"
    },
    {
        " agreed that their top priority was the defense of the empire and that they needed an emperor to lead troops to repel the Turks. Nikephoros was the favorite candidate of the senate, but was in the field leading troops in Antioch, and was still married to Vevdene. Romanos was already in Constantinople and had no wife, making him a much more suitable candidate; Matthew of Edessa also suggests that Eudokia already desired Romanos over Nikephoros. Upon taking power, Romanos exiled Nikephoros to his holdings in the Anatolic Theme, and excluded him from the Manzikert campaign due to questionable loyalty; likely because he had been Eudokias other candidate for the throne, and thus posed a threat to Romanos rule. After Romanos was captured by the Seljuks at the disastrous Battle of Manzikert, Nikephoros did not involve himself in the ": null
    },
    {
        "coup détat": "coup détat"
    },
    {
        " of Michael VII against the still-captive Romanos, and would not again lead troops until the uprising of the mercenary leader ": null
    },
    {
        "Roussel de Bailleul": "roussel de bailleul"
    },
    {
        ".     Emperor Michael VII  brought Nikephoros, who was now in his early seventies, out of retirement and declared him  kouropalates  and  strategos  of the Anatolic Theme. The title of kouropalates was reserved for esteemed members of the imperial court who were not related to the ruling dynasty, and officially designated him as a high-ranking general; the title of kouropalates was below the rank of  nobilissimus  and two ranks below the title of ": null
    },
    {
        "caesar": "caesar"
    },
    {
        ". None of the sources specifically mention why Nikephoros was recalled to lead forces, but it is likely due to a few reasons: Nikephoros was a renowned commander who had served under the Doukas emperors, he did not have any loyalty to Romanos IV, and the main theater of war was in the eastern portion of the Byzantine Empire, the terrain of which Nikephoros knew well; he likely gained the military governorship of the Anatolic Theme because it was his homeland. Michael VII then sent Nikephoros and the Caesar ": null
    },
    {
        "John Doukas": "john doukas"
    },
    {
        " to defeat the rebellion of Roussel de Bailleul. Nikephoros warned John not to cross the Zompos Bridge and engage the forces of Roussel, however, John disregarded him and lead his troops to defeat at the ": null
    },
    {
        "Battle of the Zompos Bridge": "battle of the zompos bridge"
    },
    {
        " in 42 Nikephoros, who commanded the rear-guard, held his troops back from fighting in the battle; modern historians have debated exactly why he chose to withhold his troops, and whether they could have turned the tide of the battle, although most historians focus on John Doukas, rather than Nikephoros, limiting the depth of analysis. After the defeat of the forces under John, Nikephoros gathered the survivors and led them with his troops back to his estates in the Anatolic Theme.     Nikephoros, seeing how dire the situation of the Byzantine Empire was, sent a letter to Emperor Michael in 42 pleading with him to address the rapidly worsening situation in Byzantine Anatolia. Michael was insulted by the directness of one of his subordinates, and turned against Nikephoros, forcing him to rebel against Michael to protect himself. Michael declared himself emperor on 42 July 42 mobilizing an army of native troops and Turkish mercenaries. Michael sent Nikephoros a letter in which he reminded Nikephoros that he owed much to the emperor who had brought him out of exile. The military acumen and family renown of Nikephoros helped him to solidify his support base, and the tyranny of Michael ensured that even some of the elites of Constantinople sided with Nikephoros; something Attaleiates notes as being very rare, as generally, people defect from the usurpers side to the emperors side. The defection of some of the capital elites was even more astonishing because the march from the Anatolic Theme to Constantinople was not safe due to Turkish raids, which had reached deep into Anatolia by 42 meaning that Nikephoros rebellion might be destroyed before it even reached Constantinople. Michaels wife, ": null
    },
    {
        "Maria of Alania": "maria of alania"
    },
    {
        ", seeing that Michael would soon be overthrown, defected to the side of Nikephoros; in October 42 Nikephoros Bryennios the Elder also raised a revolt against Michael. Nikephoros entered Constantinople on 42 March 42 and seized the throne. Upon taking power, Nikephoros married Maria of Alania, exiled Michael to a monastery, and ": null
    },
    {
        "castrated": "castrated"
    },
    {
        " Michaels sons. The castration of the sons was viewed poorly by the Byzantine nobility, possibly due to the brutality of the act, although Michael the Syrian does not provide an in-depth explanation of exactly why the Byzantine elite opposed it.       During the reign of Nikephoros, he had to contend with four revolts and plots, before the revolt of Alexios and which ultimately ended his reign. The first revolt was that of Nikephoros Bryennios, who had contended for the throne of Michael VII at the same time as Nikephoros III; Nikephoros, now too old to command armies, sent Alexios to defeat him. Once Bryennios was defeated, Nikephoros III had him blinded, but granted him and his partisans amnesty. The second revolt came from a supporter of Bryennios, ": null
    },
    {
        "Nikephoros Basilakes": "nikephoros basilakes"
    },
    {
        " the  protoproedros , rebelled in ": null
    },
    {
        "Dyrrhachium": "dyrrhachium"
    },
    {
        "  in 42 however, he was quickly defeated by Alexios, and similarly blinded. In 42 the ": null
    },
    {
        "Varangian Guard": "varangian guard"
    },
    {
        " attempted to murder Nikeophoros during an evening inspection, however, they were unsuccessful as Nikephoros was able to command his retinue and defend himself before his imperial guards could arrive to defeat the Varangians. Nikephoros had the ringleaders of the plot sent to remote forts and granted amnesty to the rest. Around this time, Michael of Nicomedia, the  hypertimos  , who may be the same person as Michael Psellos, died in Nicomedia; it is not known if his death was related with the assassination plot of the Varangians.     Around the same time, ": null
    },
    {
        "Constantine Doukas": "constantine doukas"
    },
    {
        " plotted against Nikephoros, despite the emperors favor towards him. Meanwhile, Nikephoros was planning to deal with Byzantine Anatolia, now practically overrun by the Seljuk Turks. Nikephhoros hired mercenaries to strengthen his forces, as he viewed his native forces too little in number, however, the mercenaries were rowdy and disloyal. At one point Nikephoros had to personally address the mercenaries in order to attempt to make them cooperate. Constantine Doukas rebellion put an end to Nikephoros eastern campaign, however, Nikephoros was popular enough that none outside of the immediate army under Constantine joined him, allowing Nikephoros to quickly assemble an army of levies and his imperial guard to challenge Constantine. Nikephoros quickly sent emissaries to Constantine to inquire why he had rebelled and was able to persuade the soldiers under Constantine to surrender their general through an offer of amnesty, which they did; after Constantine was handed over to Nikephoros by his own troops, he was sent into exile at a monastery.     In 42 the ": null
    },
    {
        "Paulician": "paulician"
    },
    {
        " sect attempted to use the chaos of the rebellions of Bryennios and Basilakes and their growing popularity in the Balkans to rise up against Nikephoros; ": null
    },
    {
        "Leca the Paulican": "leca the paulican"
    },
    {
        " agitated against Nikephoros and attempted to convince the Pechenegs, who Basilakes had earlier attempted to ally, to invade Byzantine land. At the same time ": null
    },
    {
        "Dobromir the Paulican": "dobromir the paulican"
    },
    {
        " stirred up a revolt in ": null
    },
    {
        "Mesembria": "mesembria"
    },
    {
        ", in co-operation with Leca, and began to pillage the surrounding areas. Leca and Dobromir soon abandoned their rebellion after they were informed that Nikephoros was quickly assembling an army to defeat them. Knowing their few loyalists would not be able to confront the Byzantine army, they begged Nikephoros for forgiveness, fearing that they would share the same punishment as Bryennios and Basilakes; Nikephoros showed mercy and granted them amnesty, along with both gifts and titles.     Nikephoros had originally considered Constantine Doukas as a candidate for his heir, as he had no children of his own, however, he abandoned this after Constantine revolted against him. He then set his sights upon a distant relative, named ": null
    },
    {
        "Synadenus Botaniates": "synadenus botaniates"
    },
    {
        ", of whom almost nothing is known other than that he later married of a niece of Alexios.     Norman Duke ": null
    },
    {
        "Robert Guiscard": "robert guiscard"
    },
    {
        " of Apulia, prepared to invade the Byzantine Empire in 42 under the pretext of defending the succession of Constantine Doukas, who had been engaged to Roberts daughter Helena; at the same time, the Seljuks captured the town of ": null
    },
    {
        "Cyzicus": "cyzicus"
    },
    {
        ". Alexios was entrusted with a substantial army to defeat the Norman threat, but conspired with his relative John Doukas to instead take the throne for himself. Alexios raised a rebellion against Nikephoros and was able to quickly surround Constantinople and put it to siege due to the lack of a defensive army. Nikeophoros was unable to secure the support of either the Seljuk Turks or ": null
    },
    {
        "Nikephoros Melissenos": "nikephoros melissenos"
    },
    {
        ", his traditional rivals, and thus was forced to prepare to abdicate. Nikephoros decided that his only choice was to abdicate in favor of Melissenos, who was nearby in ": null
    },
    {
        "Damalis": "damalis"
    },
    {
        " in Anatolia, and sent messagers to him across the Bosphorus, however, these messagers were intercepted by ": null
    },
    {
        "George Palaiologos": "george palaiologos"
    },
    {
        ", a general of Alexios, who persuaded them to support Alexios. Alexios and his forces broke through the walls of Constantinople on 42 April 42 and sacked the city; Patriarch ": null
    },
    {
        "Cosmas": "cosmas i of constantinople"
    },
    {
        " convinced Nikephoros to abdicate to Alexios rather than prolong the civil war. Nikephoros then fled to the ": null
    },
    {
        "Hagia Sophia": "hagia sophia"
    },
    {
        " and sought sanctuary inside of it. Michael, the logothete of Alexios, then escorted Nikephoros to the ": null
    },
    {
        "Monastery of Peribleptus": "church of st. george of samatya"
    },
    {
        ", where he abdicated and became a monk. Nikephoros died later that year, on 42 December 42       Nikephoros performed many acts to secure the support of the Byzantine populace, as he lacked the legitimacy of imperial succession as a usurper. He spent large amounts of money on ": null
    },
    {
        "donatives": "donativum"
    },
    {
        " for his army and supporters, which severely sapped the imperial treasury, as well as distributing many titles to them; he also donated generously to charities. He returned the gold and silver ornaments which Michael VII had confiscated from the churches to fund his civil war against him. Whether or not these acts managed to gain the support of the people cannot be ascertained, as Nikephoros reign was filled with revolts and political uncertainty; however it can be assumed that Nikephoros was determined to prevent the betrayal which many previous emperors had suffered, and as such freely handed out gifts and titles. Many of the reforms which Nikephoros enacted were more likely intended to solidify his tenuous hold on the throne, rather than for the security of the empire.     Nikephoros issued a ": null
    },
    {
        "chrysobull": "chrysobull"
    },
    {
        " that forgave all debt which was ": null
    },
    {
        "in arrears": "in arrears"
    },
    {
        ", in order to gain support, as well as to attempt to remedy the debt crisis which had occurred under the ": null
    },
    {
        "Doukas dynasty": "byzantine empire under the doukas dynasty"
    },
    {
        "; he additionally forbade creditors for demanding debt repayment before the terms of the contract stated, likely to improve the financial stability of the empire by preventing sudden impoverishment, as well as forbidding creditors from seizing the property of their debtors in payment of debt after their debts were canceled. Attaleiates says that these laws put an end to the fear of debt , which he said had been a source of much suffering for the Byzantine citizens under the Doukas dynasty.     Nikephoros may have revoked the edicts of Michael VII to secure more legitimacy, as well as reward the citizens of Constantinople who had supported him; one such measure involved the restoration of rights to owners of small ": null
    },
    {
        "jetties": "jetties"
    },
    {
        " around Constantinople, allowing them to again use these ports, called skalai. Attaleiates states that He diligently attended the festivals of the capital and frequently bestowed gifts to his subjects , suggesting that Nikephoros did not hesitate to embrace the trappings of an emperor, to ensure he was viewed as the legitimate emperor rather than a mere usurper. Nikephoros worked to not only gain the favor of the masses, but also the previous dynasty, which Romanos IV had failed to do, leading to his downfall. He brought Eudokia Makrembolitissa out of her monastic exile and allowed her to live among her family, and attempted to make Constantine Doukas his heir, likely in an attempt to appease the civil officials who he had just deposed. Additionally, succession was a strong concern, as Nikephoros was a widower, old, and childless in 42 his actions in marrying Maria, the wife of Michael VII, and attempting to take Constantine as his heir, show Nikephoros determination to both secure his succession and restore stability to the empire.     Attaleiates praised Nikephoros for his reforms to the legal code, as well as his diligence in the performance of his imperial duties. Nikephoros presided over court cases, as well as devoted his free time to read books to improve his ability to judge cases. Nikephoros settled several pressing legal issues in 42 first enacting a law regarding spousal insanity, the second increasing the time between sentencing and execution to thirty days to allow new evidence to be presented, or the judge to review if the crime merited capital punishment. Nikephoros also issued a law which extended the same legal rights and protections enjoyed by private servants to imperial servants. While the reforms of Nikephoros are quite minor, they provide insight into Nikephoros desire to relieve some of the issues plaguing the Byzantine empire, as well as correct the rampant corruption of the Byzantine courts; that his reforms were quite minor is unsurprising in light of the fact that Nikephoros was nearly eighty, and had to suppress several revolts, as well as defend against the Turks in Anatolia.       The situation of Byzantine Anatolia was worsened after the Battle of Manzikert in 42 as the Seljuk Turks proceeded to begin to take the Byzantine lands for themselves, rather than simply raid them. ": null
    },
    {
        "Theodore Gabras": "theodore gabras"
    },
    {
        " and ": null
    },
    {
        "Philaretos Brachamios": "philaretos brachamios"
    },
    {
        ", governors of ": null
    },
    {
        "Trebizond": "chaldia"
    },
    {
        " and Antioch respectively had become separated from the rest of the Byzantine Empire as the Turks invaded other regions of Anatolia which were almost undefended, and thus became nominally independent of the Byzantine Empire. Nikephoros negotiated with Philaretos for the submission of his fief in 42 and granted him the title of dux, leaving him the legitimate ruler of the newly returned Byzantine province. This re-incorporation benefited the Byzantine Empire as Philaretos had been attacking some nearby Byzantine towns in order to incorporate them into his domain, dividing the Byzantines focus upon the Seljuk Turks in the area; it also strengthened the position of the Byzantine Empire, as they gained Philaretos 42-strong army of Normans, captained by ": null
    },
    {
        "Raimbaud": "raimbaud"
    },
    {
        ". This successful negotiation may also reflect the prestige of the Botaniates family, as Michael Doukas had failed to negotiate a similar agreement with Philaretos, because of Philaretos dislike of the corrupt Nikephoros the Logothete. While a diplomatic victory, it did not effectively change the situation of either party, as Philaretos remained effectively independent, and Nikephoros had little to gain from reasserting control over the land. The only real success to come from it is that he may have gained legitimacy due to achieving something which his predecessor was never able to; that Attaleiates deigns to mention it as one of Nikephoros success lends credence to it largely benefiting only Nikephoros legitimacy.": null
    }
]