[
    {
        "     Founded about 42 the  of ": null
    },
    {
        "Alt-Berlin": "alt-berlin"
    },
    {
        ", together with the neighbouring settlement of ": null
    },
    {
        "Cölln": "cölln"
    },
    {
        ", is the reconstructed historical heart of the ": null
    },
    {
        "German": "germany"
    },
    {
        " capital ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ". It is located in ": null
    },
    {
        "Mitte": "mitte"
    },
    {
        " locality , five minutes away from ": null
    },
    {
        "Alexanderplatz": "alexanderplatz"
    },
    {
        ".       Situated on the eastern shore of the river ": null
    },
    {
        "Spree": "spree"
    },
    {
        ", it is bounded by the streets Rathausstraße, Spandauer Straße and Mühlendamm. The deconsecrated ": null
    },
    {
        "Nikolaikirche": "nikolaikirche"
    },
    {
        " , Berlins oldest church, gives its name to the neighbourhood and lies at its centre.          The two settlements of Old Berlin as well as Cölln on the other side of the Spree originated along an old trade route, the Mühlendamm , a ": null
    },
    {
        "ford": "ford"
    },
    {
        " where the river could be easily crossed. The Nicholas Church, originally a late ": null
    },
    {
        "Romanesque": "romanesque architecture"
    },
    {
        " basilica": "basilica"
    },
    {
        ", was erected about 42 The area around the church with its ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " alleys in the main had been preserved throughout the centuries, until it was destroyed by the ": null
    },
    {
        "air raids": "bombing of berlin in world war ii"
    },
    {
        " and the ": null
    },
    {
        "Battle of Berlin": "battle of berlin"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ".     At Berlins 42th anniversary in 42 the house-building was restored in a peculiar mixture of reconstructed historic houses and ": null
    },
    {
        "concrete slab": "concrete slab"
    },
    {
        "  Plattenbau  blocks, giving the area an unmistakable appearance. Today the small area is famous for its traditional ": null
    },
    {
        "German": "german cuisine"
    },
    {
        " restaurants and bars.          Beside the Nicholas Church, the best-known building of the quarter is the Ephraim-Palais, built in 42 for ": null
    },
    {
        "Veitel-Heine Ephraim": "veitel-heine ephraim"
    },
    {
        ", the ": null
    },
    {
        "financier": "financier"
    },
    {
        " of ": null
    },
    {
        "King Frederick II": "frederick ii of prussia"
    },
    {
        " of ": null
    },
    {
        "Prussia": "kingdom of prussia"
    },
    {
        ". The ": null
    },
    {
        "Rococo": "rococo"
    },
    {
        " façade": "façade"
    },
    {
        " at the intersection of Mühlendamm and Poststraße became famous as Berlins finest corner , until the house was demolished in 42 for the laying out of the enlarged Mühlendamm street. Parts of the façade were stored in the western outskirts of Berlin, ": null
    },
    {
        "West Berlin": "west berlin"
    },
    {
        " authorities delivered them to ": null
    },
    {
        "East Berlin": "east berlin"
    },
    {
        "s magistrate in 42 to support the reconstruction. The palace was rebuilt between 42 and 42 about 42 meters away from its original site. Today it serves as a ": null
    },
    {
        "museum": "museum"
    },
    {
        ".     On the other side of the Poststraße is the Knoblauchhaus from 42 with a ": null
    },
    {
        "neoclassical": "neoclassical architecture"
    },
    {
        " façade from the 42th century. One of the few preserved historic original buildings, it was the residence of the notable ": null
    },
    {
        "Knoblauch": "knoblauch"
    },
    {
        " family with members like the ": null
    },
    {
        "architect": "architect"
    },
    {
        " Eduard Knoblauch": "eduard knoblauch"
    },
    {
        " or the ": null
    },
    {
        "physicist": "physicist"
    },
    {
        " Karl-Hermann Knoblauch": "karl-hermann knoblauch"
    },
    {
        ". It is home of a ": null
    },
    {
        "Biedermeier": "biedermeier"
    },
    {
        " museum, the oldest civic museum of Berlin.     On the banks of the Spree river stands the red ": null
    },
    {
        "sandstone": "sandstone"
    },
    {
        " Kurfürstenhaus , erected in 42 at the site of an older building, where ": null
    },
    {
        "Elector John Sigismund of Brandenburg": "john sigismund, elector of brandenburg"
    },
    {
        " died on December 42 42 As he believed a ": null
    },
    {
        "White Lady": "white lady"
    },
    {
        " haunted the  Stadtschloss  , he had fled to the home of his ": null
    },
    {
        "valet": "valet"
    },
    {
        ".     German Democratic Republic Postmodernist Housing Estate   Gunter Stahn, Nikolaiviertel, East Berlin, 42     Postmodernism was meant to be something that happened only in the west – “the cultural logic of late capitalism”, as Fredric Jameson called it, an “end of history” style to accompany the triumph of neoliberalism and privatisation. Curiously, though, many of its ideas – for example, the view that modernism ignores the desires of the masses – were anticipated under Stalin in the 42s, and some Soviet satellite states were early adopters of postmodernism. The German Democratic Republic had one of the largest industrialised housing programmes ever seen, in which practically everything was made out of mass-produced concrete panels. This is referenced in the Nikolaiviertel, a large postmodernist housing estate in the centre of Berlin, which emulates the scale and style of old Berlin using the same corrugated concrete components as a suburban tower-block estate.     The result is bizarre, kitsch and rather enjoyable; it’s fully aware of its own absurdity. Concrete arcades fan out from the restored Nikolaikirche, with concrete gables, concrete columns and archways, all made from the familiar panels. Pass through those archways, and you could be in any estate anywhere in east-central Europe, with children’s playgrounds and trees surrounded by concrete blocks. A relief sculpture on one facade depicts the history of the German workers’ movement, and culminates with workers constructing tower blocks from exactly the same panels. It seems like a strange way to imagine the forward march of labour – and we all know what happened two years after its construction – but also suggests that the communist economy and ideology had more potential for irony and adaptation than we might give it credit for. Here is the first, and last, state-socialist housing scheme that was intended to be funny.     • Owen Hatherley’s Landscapes of Communism is published by Allen Lane.   ": null
    }
]