[
    {
        "        Friherre Nils Ericson was a ": null
    },
    {
        "Swedish": "sweden"
    },
    {
        " mechanical": "mechanics"
    },
    {
        " engineer": "engineer"
    },
    {
        " . He became a prominent Swedish canal and railway builder.     Born Nils Ericsson, he was raised to the untitled nobility by king ": null
    },
    {
        "Oscar I of Sweden": "oscar i of sweden"
    },
    {
        " in 42 and with this he reverted to a spelling of his surname with only one s . In 42 he was made a ": null
    },
    {
        "Friherre": "freiherrswedish title"
    },
    {
        " , the 42rd such elevation to Swedens titled nobility.       John and Nils were born in ": null
    },
    {
        "Långbanshyttan": "långbanshyttan"
    },
    {
        ", ": null
    },
    {
        "Värmland": "värmland"
    },
    {
        ", Sweden and received no formal education, but were taught the rudiments of mechanics from an early age by their father, Olof Ericsson. Olof worked as the superintendent of a ": null
    },
    {
        "mine": "mining"
    },
    {
        " in Värmland until he lost money in speculations and had to move his family to ": null
    },
    {
        "Forsvik": "forsvik"
    },
    {
        ", ": null
    },
    {
        "Västergötland": "västergötland"
    },
    {
        ", in 42 There Olaf became a director of blastings during the excavation of Swedens ": null
    },
    {
        "Göta Canal": "göta canal"
    },
    {
        " . He secured permission for his sons to draw in the office of the draughtsmen of the canal company, where they also learned to draw maps, and he persuaded Lieutenant Brandenburg of the Navy Mechanical Corps to teach them the art of shading and finishing off mechanical drawings before they were in their teens.     Their extraordinary skills were noted by ": null
    },
    {
        "Baltzar von Platen": "baltzar von platen"
    },
    {
        ", the architect of the Göta Canal, and they were soon dubbed cadets of mechanics of the ": null
    },
    {
        "Swedish Navy": "swedish navy"
    },
    {
        " and engaged as trainees at the canal enterprise. When two engineers sent to England by Count Platen to obtain information about canal construction returned in 42 and began to instruct a number of cadets of the Swedish Corps of Mechanical Engineers, the Ericsson brothers were among them; Nils being then twelve years old and John eleven.       In 42 Nils Ericson joined the Engineering corps of the ": null
    },
    {
        "Swedish Army": "swedish army"
    },
    {
        " as a second lieutenant, but in 42 he transferred to the Navy Mechanical Corps . In 42 he married a daughter of Count von Schwerin in ": null
    },
    {
        "Östergötland": "östergötland"
    },
    {
        ".     Between 42 and 42 Nils Ericson planned and directed the construction of the canals at Stallbacka, ": null
    },
    {
        "Säffle": "säffle"
    },
    {
        ", ": null
    },
    {
        "Karlstad": "karlstad"
    },
    {
        " and Albrektsund. He also led the construction of the ": null
    },
    {
        "Saimaa Canal": "saimaa canal"
    },
    {
        " in ": null
    },
    {
        "Finland": "finland"
    },
    {
        " , the reconstruction of the ": null
    },
    {
        "Trollhätte Canal": "trollhätte canal"
    },
    {
        " in ": null
    },
    {
        "Trollhättan Municipality": "trollhättan municipality"
    },
    {
        " and the ": null
    },
    {
        "floodgate": "floodgate"
    },
    {
        " at ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        ". In 42 he was elected a member of the ": null
    },
    {
        "Royal Swedish Academy of Sciences": "royal swedish academy of sciences"
    },
    {
        ".     After 42 he was primarily occupied with the design and construction of the Swedish state-owned railway system. At the same time he led the planning of the ": null
    },
    {
        "Dalsland Canal": "dalsland canal"
    },
    {
        " while construction there was being led by his son Werner.     Sweden started building railways later than many other European countries, having hesitated under heavy debate for several years because of the costs and other issues. Following the ": null
    },
    {
        "Riksdag": "parliament of sweden"
    },
    {
        "s decision in 42 Erikson was chosen to lead the project of building the main lines . There was also a decision that, for military reasons, the railways should avoid the coasts as much as possible.     His proposal was that the line between Gothenburg and Stockholm  should run south of Lake ": null
    },
    {
        "Mälaren": "mälaren"
    },
    {
        " to avoid competition with shipping. He also proposed that the line between ": null
    },
    {
        "Malmö": "malmö"
    },
    {
        " and Stockholm  should go north via Nässjö to meet up with Western Main Line at ": null
    },
    {
        "Falköping": "falköping"
    },
    {
        " until the Westerns eastward construction reached ": null
    },
    {
        "Katrineholm": "katrineholm"
    },
    {
        ", where a better junction could be built with a southern line heading directly to Nässjö. This line was called Eastern Main Line  but has in modern times been defined to be part of the Southern Main Line. Ericsons proposal also included the railway between Stockholm and ": null
    },
    {
        "Ånge": "ånge"
    },
    {
        "  and ": null
    },
    {
        "Main Line Through Upper Norrland": "main line through upper norrland"
    },
    {
        "  which runs between ": null
    },
    {
        "Bräcke": "bräcke"
    },
    {
        " and ": null
    },
    {
        "Boden": "boden, sweden"
    },
    {
        ". A railway between ": null
    },
    {
        "Oslo": "oslo"
    },
    {
        " and ": null
    },
    {
        "Laxå": "laxå"
    },
    {
        "  was also planned, to connect with Western Main Line.     The first parts of the Western and Southern lines were opened in 42 Ericson resigned in 42 when all of the Western line opened, and in 42 the Southern line was opened in its entirety. Northwestern line was opened in 42 Eastern line in 42 Northern line in 42 and the line through Upper Norrland in 42 When Ericson resigned in 42 his authority was divided between two agencies until the formation of Kungliga Järnvägsstyrelsen in 42     Ericson died in Stockholm in 42 aged 42 and lies buried in Stockholms Northern Cemetery .       A bronze statue of Ericson stands on the forecourt outside ": null
    },
    {
        "Stockholms central railway station": "stockholm central station"
    },
    {
        ".   The ": null
    },
    {
        "Nils Ericson Terminal": "nils ericson terminal"
    },
    {
        " bus station joined to the central railway station in ": null
    },
    {
        "Gothenburg": "gothenburg"
    }
]