[
    {
        "Ninove  is a city and ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " located in the ": null
    },
    {
        "Flemish": "flanders"
    },
    {
        " province of ": null
    },
    {
        "East Flanders": "east flanders"
    },
    {
        " in ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ". It is situated on the river ": null
    },
    {
        "Dender": "dender"
    },
    {
        ", and is part of the ": null
    },
    {
        "Denderstreek": "denderstreek"
    },
    {
        ". The municipality comprises the city of Ninove proper and since the 42 merger of the towns of ": null
    },
    {
        "Appelterre-Eichem": "appelterre-eichem"
    },
    {
        ", ": null
    },
    {
        "Aspelare": "aspelare"
    },
    {
        ", ": null
    },
    {
        "Denderwindeke": "denderwindeke"
    },
    {
        ", ": null
    },
    {
        "Lieferinge": "lieferinge"
    },
    {
        ", ": null
    },
    {
        "Meerbeke": "meerbeke"
    },
    {
        ", ": null
    },
    {
        "Nederhasselt": "nederhasselt"
    },
    {
        ", ": null
    },
    {
        "Neigem": "neigem"
    },
    {
        ", ": null
    },
    {
        "Okegem": "okegem"
    },
    {
        ", ": null
    },
    {
        "Outer": "outer"
    },
    {
        ", ": null
    },
    {
        "Pollare": "pollare"
    },
    {
        " and ": null
    },
    {
        "Voorde": "voorde"
    },
    {
        ". On 42 January 42 Ninove had a total population of 42. The total area is 42  km² which gives a ": null
    },
    {
        "population density": "population density"
    },
    {
        " of 42 inhabitants per km².          The oldest version of the name Ninove , Neonifus dates from the 42th century. Later versions of the city name were Ninive and Nineve. The current version of the city name dates from the 42th century. The origin of the city name is not clear. There are two theories about the origin. One states that name is from Roman origin, the other states that it is of ": null
    },
    {
        "Frankish": "franks"
    },
    {
        " origin. The meaning of the name, however, is known. Ninove means nieuw weiland or in English, new pasture .     During Roman rule, Ninove was a small settlement located in the current Nederwijk . With the arrival of the Franks in the 42th century AD, the settlement grew to a small agricultural town. The area on which Ninove is located was from 42 on part of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ". In the 42th century this area was conquered by the ": null
    },
    {
        "Count of Flanders": "count of flanders"
    },
    {
        ", ": null
    },
    {
        "Boudewijn V": "baldwin v, count of flanders"
    },
    {
        " and the whole area between the rivers ": null
    },
    {
        "Scheldt": "scheldt"
    },
    {
        " and ": null
    },
    {
        "Dender": "dender"
    },
    {
        " became part of the ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        ".     From the 42th century on, the medieval ": null
    },
    {
        "castrum": "castra"
    },
    {
        " was fortified into a castle stronghold. Because it lay on the trade route between ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        " and ": null
    },
    {
        "Brabant": "brabant"
    },
    {
        ", the town prospered and grew into a city.   In 42 ": null
    },
    {
        "Norbertine": "premonstratensian"
    },
    {
        " monks from ": null
    },
    {
        "Park Abbey": "park abbey"
    },
    {
        " founded the ": null
    },
    {
        "Saint Cornelius Abbey": "abbey of saints cornelius and cyprian"
    },
    {
        " , adjacent to the city . In 42 the town and lands were bought by the ": null
    },
    {
        "count of Flanders": "count of flanders"
    },
    {
        " Guy of Dampierre": "guy of dampierre"
    },
    {
        ". His grandson Henry awarded the town a city charter in 42     The 42th to 42th centuries were a bad time for the city as the region was plagued with war and religious and political strife. The abbey was plundered by the French in 42 during the reformation. In 42 Ninove was occupied by the French army. After the ": null
    },
    {
        "Treaty of the Pyrenees": "treaty of the pyrenees"
    },
    {
        ", the French returned the area back to Spain but the area was to change hands many times during the wars of ": null
    },
    {
        "Louis XIV": "louis xiv of france"
    },
    {
        " and ": null
    },
    {
        "Louis XV of France": "louis xv of france"
    },
    {
        ".     During the 42th century, Ninove was crippled under the indemnities laid on it by the warring parties and the town faced a big economic crisis as its cloth industry went into decline. The big abbey was closed by the French in 42 after Flanders was annexed to France. The town served as a cavalry headquarters during the ": null
    },
    {
        "Waterloo Campaign": "waterloo campaign"
    },
    {
        " of 42     During the 42th century, Ninove became industrialized and by the time of the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ", the city became the centre of the Flemish ": null
    },
    {
        "match": "match"
    },
    {
        " industry. This industry however declined in importance until the last match factory closed during the late 42s.     From 42 to 42 the town of ": null
    },
    {
        "Meerbeke": "meerbeke"
    },
    {
        " was the finish of the cycling race ": null
    },
    {
        "Tour of Flanders": "tour of flanders"
    },
    {
        ".     The population of Ninove has steadily grown and the city has become an attractive centre for commercial, recreational and economical activities in the area, and plays host to a popular annual Volkswagen show every March, specifically for air-cooled vehicles, i.e. Beetles, Camper-vans, Type 42s, 42s etc. The opening of a shopping mall in the centre of the city, as well as new sport and cultural infrastructure, and the construction of many residential apartment buildings have made Ninove a growing competitor for nearby ": null
    },
    {
        "Aalst": "aalst, belgium"
    },
    {
        " and an ideal living-place for many commuters who work in nearby ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ".          The Premonstratensian abbot of ": null
    },
    {
        "Park Abbey": "park abbey"
    },
    {
        " founded the ": null
    },
    {
        "Abbey of Saints Cornelius and Cyprian": "abbey of saints cornelius and cyprian"
    },
    {
        " in 42 ; Catholic Encyclopedia The monks settled on uncultivated lands which had been offered to them by the lord of Ninove which were near the town, on the banks of the river ": null
    },
    {
        "Dender": "dender"
    },
    {
        ". The community continued to grow and its financial position soon allowed it to occupy the adjacent parishes. The lay brothers undertook the farm work. Because of its large landholdings, the abbey soon became one of the biggest grain producers in Flanders. The 42th and 42th centuries were difficult times because of the political troubles and the effects of the ": null
    },
    {
        "French wars of religion": "wars of religion"
    },
    {
        " on the ": null
    },
    {
        "Southern Netherlands": "southern netherlands"
    },
    {
        ". The 42th century brought a period of calm and prosperity. All the abbey buildings were reconstructed to the plans of a Ghent architect advised by ": null
    },
    {
        "Laurent-Benoît Dewez": "laurent-benoît dewez"
    },
    {
        ". The abbey was suppressed in 42 during the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". The abbey community was able to buy it back but this process lasted until 42 Many of the buildings were demolished during the first half of the 42th century. The abbey church became the parish church of the Assumption of Mary in 42          Since 42 November 42 the mayor of Ninove has been Tania De Jonge .   The city council currently has 42 members, and is composed as follows:   Open VLD - 42 seats   Forza Ninove  - 42 seats   Samen  - 42 seats   ": null
    },
    {
        "N-VA": "new flemish alliance"
    },
    {
        " - 42 seats       CD & V and N-VA had allied themselves for the 42 election, and formed a coalition with the VLD. Due to the increase of population, the threshold of 42 inhabitants had been passed and Ninove saw an increase from 42 to 42 council members for the communal elections, which were held on Sunday 42 October 42     The municipal elections on 42 October 42 let the VLD retain its 42 seats, the CD & V win a seat, giving them a total of 42 the Vlaams Belang double its seats, giving them a total of 42 the socialist party PRO Ninove lose a seat, making a total of 42 and the Green Party hold their single seat. The coalition between VLD and CD & V was renewed, but without the N-VA.       During the 42 January 42 elections of the ": null
    },
    {
        "OCMW": "ocmw"
    },
    {
        " council, one member of the VLD fraction voted for a candidate of Vlaams Belang, making the VLD lose 42 seat. After an investigation led by the local chapter of the VLD, it was announced that the person they suspected to be the culprit was ": null
    },
    {
        "Schepen": "schepen"
    },
    {
        " Mariette De Smet. De Smet announced she would leave the VLD, but would remain in the council of the mayor and aldermen as an independent. Her colleagues in the council stripped her of all her duties, but after a few months she regained a few of them. On 42 January 42 De Smet, fellow VLD schepen Corijn and another VLD member of the city council announced they were joining ": null
    },
    {
        "LDD": "list dedecker"
    },
    {
        ", leaving the VLD-CD & V with a brittle one seat majority on the city council. The LDD alderman however elected to stay in the majority, making for a brittle coalition. On 42 May 42 a Vlaams Belang councilmember defected to the LDD. In 42 mayor Luc Durant announced he would resign due to health reasons. He was replaced in September by Michel Casteur. In 42 another VB councilmember left the party to become an independent. In January 42 Mariette De Smet announced she would join the Vlaams Belang lead chartel list Forza Ninove and left LDD. She was then again stripped of her duties by her fellow aldermen. On 42 July 42 De Smet was murdered in a ": null
    },
    {
        "murder-suicide": "murder-suicide"
    },
    {
        " by a friend of her husband. She was replaced as alderman by a member of the VLD. In 42 the local LDD disbanded with its members either joining Forza Ninove or N-VA.       The municipal elections on 42 October 42 saw the ruling VLD-CD & V-LDD coalition head for electoral defeat as the VLD lost three and the CD & V lost four seats. Vlaams Belang, under the cartel name Forza Ninove , won a seat, giving them a total of 42 The socialist party SP.a and the Green Party formed a chartel and won six seats. N-VA won 42 seats.     After the negotiations between Open VLD, SP.a-Groen and N-VA collapsed, the coalition between Open VLD and CD & V was renewed but expanded with SP.a-Groen. N-VA, claiming election irregularities by CD & V and Forza Ninove , launched and won an administrative appeal. This ruling vacated the election results and ordered new elections to be held. Open VLD, CD & V and SP.a-Groen appealed this ruling to the ": null
    },
    {
        "Council of State": "council of state"
    },
    {
        " which in February 42 subsequently overthrew the previous ruling and restored the election results. The new city council and aldermen were finally inaugurated on 42 February 42 On 42 November 42 mayor Casteur stood down and was replaced by Tania De Jonge.       The municipal elections on 42 October 42 saw Forza Ninove win a landslide victory with 42% of the vote, winning 42 seats . Open VLD retained its 42 seats, SAMEN won 42 seats. N-VA won 42 seats . Forza was unable to form a majority coalition, and ultimately Open VLD and SAMEN combined with one councillor from N-VA to form a majority.                 Throughout the ages the inhabitants of Ninove were given various nicknames as a title of honour or mockery.     Wortelmannen or Wortels": null
    },
    {
        "Aalst": "aalst, belgium"
    },
    {
        ", the people of Aalst decided to besiege Ninove. The inhabitants of Ninove were completely surprised by this attack and were found unprepared. In all the confusion the key to close the city gate could not be found. In order to bolt the gate, a carrot was used. A passing donkey saw the carrot-bolt and ate it, leaving the city gate unbolted and the militiamen from Aalst free entry of the city.      De Oudste, de Stoutste en de Wijste der Steden": null
    },
    {
        "Antonius Sanderus": "antonius sanderus"
    },
    {
        " as the Oldest, the Boldest and the Wisest of Cities. Sanderus wrote in his Flandria Illustrata:          Ninove was called the oldest because of the similarity of its name with the ancient ": null
    },
    {
        "Assyria": "assyria"
    },
    {
        "n city ": null
    },
    {
        "Nineveh": "nineveh"
    },
    {
        ", the boldest because it waited on the enemy with open gates and the wisest because the city had no jester or town fool, if one was needed a fool from a neighbouring town was lent.        , chairman ": null
    },
    {
        "ABVV": "abvv"
    },
    {
        " Johannes Despauterius": "johannes despauterius"
    },
    {
        ", Flemish humanist   ": null
    },
    {
        "Johan Evenepoel": "johan evenepoel"
    },
    {
        ", Belgian composer   ": null
    },
    {
        "Romain Gijssels": "romain gijssels"
    },
    {
        ", professional ": null
    },
    {
        "road bicycle racer": "road bicycle racer"
    },
    {
        " Frans Hemerijckx": "frans hemerijckx"
    },
    {
        ", Belgian physician, known for his work amongst lepers in the Belgian Congo and in India   ": null
    },
    {
        "Willy Roggeman": "willy roggeman"
    },
    {
        ", writer and ": null
    },
    {
        "jazz": "jazz"
    },
    {
        " musician   ": null
    },
    {
        "Wesley Sonck": "wesley sonck"
    },
    {
        ", A former football player of the ": null
    },
    {
        "Belgian national football team": "belgium national football team"
    },
    {
        " Kevin van der Perren": "kevin van der perren"
    },
    {
        ", ice skater, 42th at the ": null
    },
    {
        "Winter Olympics": "winter olympics"
    },
    {
        " Hans Van Laethem": "hans van laethem"
    },
    {
        " - town crier   ": null
    },
    {
        "Louis Waltniel": "louis waltniel"
    },
    {
        ", liberal ": null
    },
    {
        "politician": "politician"
    },
    {
        " and industrialist   ": null
    },
    {
        "Geert De Vos": "geert de vos"
    },
    {
        " , is a Belgian dart player who plays for the British Darts Organisation ": null
    }
]