[
    {
        "N-type metal-oxide-semiconductor logic uses ": null
    },
    {
        "n-type": "n-type semiconductor"
    },
    {
        " MOSFET": "mosfet"
    },
    {
        "s  to implement ": null
    },
    {
        "logic gate": "logic gate"
    },
    {
        "s and other ": null
    },
    {
        "digital circuit": "digital circuit"
    },
    {
        "s. These nMOS transistors operate by creating an ": null
    },
    {
        "inversion layer": "inversion layer"
    },
    {
        " in a ": null
    },
    {
        "p-type": "p-type semiconductor"
    },
    {
        " transistor body. This inversion layer, called the n-channel, can conduct ": null
    },
    {
        "electron": "electron"
    },
    {
        "s between ": null
    },
    {
        "n-type": "n-type semiconductor"
    },
    {
        " source and drain terminals. The n-channel is created by applying voltage to the third terminal, called the gate. Like other MOSFETs, nMOS transistors have four modes of operation: cut-off , triode, saturation , and velocity saturation.       MOS stands for metal-oxide-semiconductor, reflecting the way MOS-transistors were originally constructed, predominantly before the 42s, with gates of metal, typically aluminium. Since around 42 however, most MOS circuits have used ": null
    },
    {
        "self-aligned gate": "self-aligned gate"
    },
    {
        "s made of ": null
    },
    {
        "polycrystalline silicon": "polycrystalline silicon"
    },
    {
        ". These ": null
    },
    {
        "silicon gate": "silicon gate"
    },
    {
        "s are still used in most types of MOSFET based ": null
    },
    {
        "integrated circuit": "integrated circuit"
    },
    {
        "s, although metal gates  started to reappear in the early 42s for certain types of high speed circuits, such as high performance microprocessors.     The MOSFETs are n-type ": null
    },
    {
        "enhancement mode": "enhancement mode"
    },
    {
        " transistors, arranged in a so-called pull-down network between the logic gate output and negative supply voltage . A ": null
    },
    {
        "pull up": "pull up resistor"
    },
    {
        " is placed between the positive supply voltage and each logic gate output. Any ": null
    },
    {
        "logic gate": "logic gate"
    },
    {
        ", including the ": null
    },
    {
        "logical inverter": "logic gateinverter"
    },
    {
        ", can then be implemented by designing a network of parallel and/or series circuits, such that if the desired output for a certain combination of ": null
    },
    {
        "boolean": "boolean data type"
    },
    {
        " input values is ": null
    },
    {
        "zero": "boolean logic"
    },
    {
        " , the PDN will be active, meaning that at least one transistor is allowing a current path between the negative supply and the output. This causes a voltage drop over the load, and thus a low voltage at the output, representing the zero.          As an example, here is a ": null
    },
    {
        "NOR": "logical nor"
    },
    {
        " gate implemented in schematic NMOS. If either input A or input B is high , the respective MOS transistor acts as a very low resistance between the output and the negative supply, forcing the output to be low . When both A and B are high, both transistors are conductive, creating an even lower resistance path to ground. The only case where the output is high is when both transistors are off, which occurs only when both A and B are low, thus satisfying the truth table of a NOR gate:          A MOSFET can be made to operate as a resistor, so the whole circuit can be made with n-channel MOSFETs only. NMOS circuits are slow to transition from low to high. When transitioning from high to low, the transistors provide low resistance, and the capacitive charge at the output drains away very quickly . But the resistance between the output and the positive supply rail is much greater, so the low to high transition takes longer . Using a resistor of lower value will speed up the process but also increases static power dissipation. However, a better way to make the gates faster is to use ": null
    },
    {
        "depletion-mode": "depletion-load nmos logic"
    },
    {
        " transistors instead of ": null
    },
    {
        "enhancement-mode": "mosfet"
    },
    {
        " transistors as loads. This is called ": null
    },
    {
        "depletion-load NMOS logic": "depletion-load nmos logic"
    },
    {
        ".     For many years, NMOS circuits were much faster than comparable ": null
    },
    {
        "PMOS": "pmos logic"
    },
    {
        " and ": null
    },
    {
        "CMOS": "cmos"
    },
    {
        " circuits, which had to use much slower p-channel transistors. It was also easier to manufacture NMOS than CMOS, as the latter has to implement p-channel transistors in special n-wells on the p-substrate. The major drawback with NMOS  is that a DC current must flow through a logic gate even when the output is in a ": null
    },
    {
        "steady state": "steady state"
    },
    {
        " . This means static ": null
    },
    {
        "power dissipation": "power dissipation"
    },
    {
        ", i.e. power drain even when the circuit is not switching. A similar situation arises in modern high speed, high density CMOS circuits which also has significant static current draw, although this is due to leakage, not bias. However, older and/or slower static CMOS circuits used for ": null
    },
    {
        "ASIC": "application-specific integrated circuit"
    },
    {
        "s, ": null
    },
    {
        "SRAM": "static random access memory"
    },
    {
        ", etc., typically have very low static power consumption.     Additionally, just like in ": null
    },
    {
        "DTL": "diode–transistor logic"
    },
    {
        ", ": null
    },
    {
        "TTL": "transistor–transistor logic"
    },
    {
        ", ": null
    },
    {
        "ECL": "emitter-coupled logic"
    },
    {
        ", etc., the asymmetric input logic levels make NMOS and PMOS circuits more susceptible to noise than CMOS. These disadvantages are why the ": null
    },
    {
        "CMOS logic": "cmos logic"
    },
    {
        " now has supplanted most of these types in most high-speed digital circuits such as ": null
    },
    {
        "microprocessor": "microprocessor"
    },
    {
        "s .            The ": null
    },
    {
        "MOSFET": "mosfet"
    },
    {
        " was invented by Egyptian engineer ": null
    },
    {
        "Mohamed M. Atalla": "mohamed m. atalla"
    },
    {
        " and Korean engineer ": null
    },
    {
        "Dawon Kahng": "dawon kahng"
    },
    {
        " at ": null
    },
    {
        "Bell Labs": "bell labs"
    },
    {
        " in 42 and demonstrated in 42  They ": null
    },
    {
        "fabricated": "semiconductor device fabrication"
    },
    {
        " both PMOS and NMOS devices with a ": null
    },
    {
        "42µm process": "20 µm process"
    },
    {
        ". However, the NMOS devices were impractical, and only the PMOS type were practical devices.      In 42 ": null
    },
    {
        "Chih-Tang Sah": "chih-tang sah"
    },
    {
        ", Otto Leistiko and A.S. Grove at ": null
    },
    {
        "Fairchild Semiconductor": "fairchild semiconductor"
    },
    {
        " fabricated several NMOS devices with channel lengths between ": null
    },
    {
        "42µm": "10 µm process"
    },
    {
        " and 42µm.  Dale L. Critchlow and ": null
    },
    {
        "Robert H. Dennard": "robert h. dennard"
    },
    {
        " at ": null
    },
    {
        "IBM": "ibm"
    },
    {
        " also fabricated NMOS devices in the 42s. The first IBM NMOS product was a ": null
    },
    {
        "memory chip": "memory chip"
    },
    {
        " with 42": null
    },
    {
        "kb": "kibibit"
    },
    {
        " data and 4242 ": null
    },
    {
        "ns": "nanosecond"
    },
    {
        " access time": "access time"
    },
    {
        ", which entered large-scale manufacturing in the early 42s. This led to MOS ": null
    },
    {
        "semiconductor memory": "semiconductor memory"
    },
    {
        " replacing earlier ": null
    },
    {
        "bipolar": "bipolar junction transistor"
    },
    {
        " and ": null
    },
    {
        "ferrite-core memory": "ferrite-core memory"
    },
    {
        " technologies in the 42s.      The ": null
    },
    {
        "earliest microprocessors": "microprocessor chronology"
    },
    {
        " in the early 42s were PMOS processors, which initially dominated the early ": null
    },
    {
        "microprocessor": "microprocessor"
    },
    {
        " industry.  In 42 ": null
    },
    {
        "NEC": "nec"
    },
    {
        "s ": null
    },
    {
        "μCOM42": "μcom-4"
    },
    {
        " was an early NMOS microprocessor, fabricated by the NEC ": null
    },
    {
        "LSI": "large-scale integration"
    },
    {
        " team, consisting of five researchers led by Sohichi Suzuki.   By the late 42s, NMOS microprocessors had overtaken PMOS processors. ": null
    },
    {
        "CMOS": "cmos"
    },
    {
        " microprocessors were introduced in 42   However, CMOS processors did not become dominant until the 42s.     CMOS was initially slower than NMOS logic, thus NMOS was more widely used for computers in the 42s.  The ": null
    },
    {
        "Intel": "intel"
    },
    {
        " 42  CMOS memory chip had an ": null
    },
    {
        "access time": "access time"
    },
    {
        " of 42": null
    },
    {
        "ns": "nanosecond"
    },
    {
        ",   whereas the fastest NMOS chip at the time, the Intel 42  ": null
    },
    {
        "HMOS": "hmos"
    },
    {
        " memory chip , had an access time of 42/42ns. In 42 a ": null
    },
    {
        "Hitachi": "hitachi"
    },
    {
        " research team led by Toshiaki Masuhara introduced the twin-well Hi-CMOS process, with its HM42  memory chip, manufactured with a ": null
    },
    {
        "42 µm process": "3 µm process"
    },
    {
        ".  The Hitachi HM42 chip was able to match the performance  of the Intel 42 HMOS chip, while the HM42 also consumed significantly less power  than the 42 . With comparable performance and much less power consumption, the twin-well CMOS process eventually overtook NMOS as the most common ": null
    },
    {
        "semiconductor manufacturing process": "semiconductor manufacturing process"
    }
]