[
    {
        "     No Secrets was an American-British ": null
    },
    {
        "girl group": "girl group"
    },
    {
        " formed in 42 The group consisted of five members: ": null
    },
    {
        "Angel Faith": "angel faith"
    },
    {
        ", Carly Lewis, Erin Tanner, Jessica Fried and Jade Ryusaki. The group debuted in the United States in 42 with the single ": null
    },
    {
        "Kids in America": "kids in americacovers"
    },
    {
        ".         No Secrets was formed by Carlys father, ": null
    },
    {
        "Adrian Gurvitz": "adrian gurvitz"
    },
    {
        ", a music producer from London. She wrote a letter to him asking to put a group together. Soon after, Jade was invited; Carly and Jades mothers were friends. Erin, Jades cousin, joined next. Later, the three girls found Angel in an advertisement for a singing group; she joined, bringing Jessica with her. Once the group line-up had been completed, No Secrets began recording songs for their debut album. The girls worked with a variety of producers and songwriters, including Adrian Gurvitz, Andy Goldmark and Riprock n Alex G. The process took a number of months. They took a break from recording and album prep to go touring and promoting their group. In June 42 No Secrets joined ": null
    },
    {
        "Aaron Carter": "aaron carter"
    },
    {
        " in ": null
    },
    {
        "Toronto": "toronto"
    },
    {
        " for the shooting of his video ": null
    },
    {
        "Oh Aaron": "oh aaron"
    },
    {
        " and provided backing vocals for the song. They were also featured in another track of off his album, Stride . In 42 after touring with Carter for four months, they filmed their first video, the home ": null
    },
    {
        "VHS": "vhs"
    },
    {
        " and ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " release No Secrets - Get to Know Us, and resumed work on their album.     Later that year, the group released their self-titled debut album, with singles Thats What Girls Do and ": null
    },
    {
        "Kids in America": "kids in americacovers"
    },
    {
        ". The latter was featured in the soundtrack for 42 film  Jimmy Neutron: Boy Genius , and its music video was included as a bonus for the films VHS release. Thats What Girls Do played in the end credits of  The Powerpuff Girls Movie , and its music video was a bonus feature on the DVD. The song would later be used in  The Hot Chick . They also recorded Little Angel of Mine for the soundtrack of  Stuart Little 42 .     Friends Forever DisneyMania  singing a cover of ": null
    },
    {
        "Kiss the Girl": "kiss the girl"
    },
    {
        " from  The Little Mermaid .     Soon after singing the majority of leads in the band, ": null
    },
    {
        "Angel": "angel faith"
    },
    {
        " left the group to pursue a solo career, releasing the album  Believe in Angels... Believe in Me  in 42 just as the finishing touches were being put on No Secrets second album, Friends Forever. The album was released with Angel featured in the artwork because it was to close to the release date and too far in production to make any changes. The four remaining members recorded and shot a video for the song Once Upon Dream for ": null
    },
    {
        "Disney": "disney"
    },
    {
        "s 42 re-release of  Sleeping Beauty .       Disagreements between members of the group led to the eventual break-up of No Secrets in March 42     Jessica Fried took on a solo career, signing with ": null
    },
    {
        "Reprise Records": "reprise records"
    },
    {
        " under the name Jessi Malay. Erin Tanner adopted the stage name Nicki Foxx and began working on solo material.     In a 42 interview, Fried commented on the break-up, stating that the girls got along great but greedy parent actions ended up breaking the group apart.     In 42 Angel Faith retired from the entertainment industry and began pursuing an education. In June 42 she graduated magna cum laude from UCLA and went on to complete a doctorate degree in clinical psychology at Pepperdine University. Jade Ryusaki now resides in Hawaii as a model.        ": null
    },
    {
        "Kids in America": "kids in america"
    },
    {
        "   Thats What Girls Do": "thats what girls do"
    },
    {
        "   Kiss the Girl": "kiss the girl"
    },
    {
        "   Whole Again": "whole again"
    },
    {
        "   Once Upon Dream": "once upon a dream"
    },
    {
        "        No Secrets     Friends Forever        Get to Know Us                              ": null
    }
]