[
    {
        "   Nobelium is a ": null
    },
    {
        "synthetic": "synthetic element"
    },
    {
        " chemical element": "chemical element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "symbol"
    },
    {
        " No and ": null
    },
    {
        "atomic number": "atomic number"
    },
    {
        " 102. It is named in honor of ": null
    },
    {
        "Alfred Nobel": "alfred nobel"
    },
    {
        ", the inventor of ": null
    },
    {
        "dynamite": "dynamite"
    },
    {
        " and benefactor of science. A ": null
    },
    {
        "radioactive": "radioactive"
    },
    {
        " metal": "metal"
    },
    {
        ", it is the tenth ": null
    },
    {
        "transuranic element": "transuranic element"
    },
    {
        " and is the ": null
    },
    {
        "penultimate": "wikt:penultimate"
    },
    {
        " member of the ": null
    },
    {
        "actinide series": "actinide series"
    },
    {
        ". Like all elements with atomic number over 100, nobelium can only be produced in ": null
    },
    {
        "particle accelerators": "particle accelerator"
    },
    {
        "by bombarding lighter elements with charged particles. A total of twelve ": null
    },
    {
        "nobelium isotopes": "isotopes of nobelium"
    },
    {
        " are known to exist; the most stable is 259 No with a ": null
    },
    {
        "half-life": "half-life"
    },
    {
        " of 58  minutes, but the shorter-lived 255 No is most commonly used in chemistry because it can be produced on a larger scale.     Chemistry experiments have confirmed that nobelium behaves as a heavier ": null
    },
    {
        "homolog": "homology"
    },
    {
        " to ": null
    },
    {
        "ytterbium": "ytterbium"
    },
    {
        " in the periodic table. The chemical properties of nobelium are not completely known: they are mostly only known in ": null
    },
    {
        "aqueous solution": "aqueous solution"
    },
    {
        ". Before nobeliums discovery, it was predicted that it would show a stable +2 ": null
    },
    {
        "oxidation state": "oxidation state"
    },
    {
        " as well as the +3 state characteristic of the other actinides: these predictions were later confirmed, as the +2 state is much more stable than the +3 state in ": null
    },
    {
        "aqueous solution": "aqueous solution"
    },
    {
        " and it is difficult to keep nobelium in the +3 state.     In the 1950s and 1960s, many claims of the discovery of nobelium were made from laboratories in ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", and the ": null
    },
    {
        "United States": "united states"
    },
    {
        ". Although the Swedish scientists soon retracted their claims, the priority of the discovery and therefore the ": null
    },
    {
        "naming of the element was disputed": "element naming controversy"
    },
    {
        " between Soviet and American scientists, and it was not until 1997 that ": null
    },
    {
        "International Union of Pure and Applied Chemistry": "international union of pure and applied chemistry"
    },
    {
        " credited the Soviet team with the discovery, but retained nobelium, the Swedish proposal, as the name of the element due to its long-standing use in the literature.          The discovery of element 102 was a complicated process and was claimed by groups from ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", and the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". The first complete and incontrovertible report of its ": null
    },
    {
        "detection": "discovery of the chemical elements"
    },
    {
        " only came in 1966 from the ": null
    },
    {
        "Joint Institute of Nuclear Research": "jinr"
    },
    {
        " at ": null
    },
    {
        "Dubna": "dubna"
    },
    {
        " .      The first announcement of the discovery of element 102 was announced by physicists at the ": null
    },
    {
        "Nobel Institute": "nobel institute"
    },
    {
        " in Sweden in 1957. The team reported that they had bombarded a ": null
    },
    {
        "curium": "curium"
    },
    {
        " target with ": null
    },
    {
        "carbon-13": "carbon-13"
    },
    {
        " ions for twenty-five hours in half-hour intervals. Between bombardments, ": null
    },
    {
        "ion-exchange": "ion-exchange"
    },
    {
        " chemistry was performed on the target. Twelve out of the fifty bombardments contained samples emitting  ": null
    },
    {
        "MeV": "mev"
    },
    {
        " alpha particle": "alpha particle"
    },
    {
        "s, which were in drops which eluted earlier than ": null
    },
    {
        "fermium": "fermium"
    },
    {
        "  and ": null
    },
    {
        "californium": "californium"
    },
    {
        " . The ": null
    },
    {
        "half-life": "half-life"
    },
    {
        " reported was 10  minutes and was assigned to either 251 102 or 253 102, although the possibility that the alpha particles observed were from a presumably short-lived ": null
    },
    {
        "mendelevium": "mendelevium"
    },
    {
        "  isotope created from the electron capture of element 102 was not excluded. The team proposed the name nobelium for the new element,  which was immediately approved by IUPAC, a decision which the Dubna group characterized in 1968 as being hasty.  The following year, scientists at the ": null
    },
    {
        "Lawrence Berkeley National Laboratory": "lawrence berkeley national laboratory"
    },
    {
        " repeated the experiment but were unable to find any 8.5  MeV events which were not background effects.     In 1959, the Swedish team attempted to explain the Berkeley teams inability to detect element 102 in 1958, maintaining that they did discover it. However, later work has shown that no nobelium isotopes lighter than 259 No with a half-life over 3  minutes exist, and that the Swedish teams results are most likely from ": null
    },
    {
        "thorium": "thorium"
    },
    {
        "-225, which has a half-life of 8  minutes and quickly undergoes triple alpha decay to ": null
    },
    {
        "polonium": "polonium"
    },
    {
        "-213, which has a decay energy of 8.53612  MeV. This hypothesis is lent weight by the fact that thorium-225 can easily be produced in the reaction used and would not be separated out by the chemical methods used. Later work on nobelium also showed that the divalent state is more stable than the trivalent one and hence that the samples emitting the alpha particles could not have contained nobelium, as the divalent nobelium would not have eluted with the other trivalent actinides. Thus, the Swedish team later retracted their claim and associated the activity to background effects.      The Berkeley team, consisting of ": null
    },
    {
        "Albert Ghiorso": "albert ghiorso"
    },
    {
        ", ": null
    },
    {
        "Glenn T. Seaborg": "glenn t. seaborg"
    },
    {
        ", ": null
    },
    {
        "John R. Walton": "john r. walton"
    },
    {
        " and ": null
    },
    {
        "Torbjørn Sikkeland": "torbjørn sikkeland"
    },
    {
        ", then claimed the synthesis of element 102 in 1958. The team used the new heavy-": null
    },
    {
        "ion": "ion"
    },
    {
        " linear accelerator": "linear accelerator"
    },
    {
        " to bombard a ": null
    },
    {
        "curium": "curium"
    },
    {
        " target  with 13 ": null
    },
    {
        "C": "carbon"
    },
    {
        " and 12 C ions. They were unable to confirm the 8.5  MeV activity claimed by the Swedes but were instead able to detect decays from fermium-250, supposedly the daughter of 254 102 , which had an apparent ": null
    },
    {
        "half-life": "half-life"
    },
    {
        " of ~3  s. Later 1963 Dubna work confirmed that 254 102 could be produced in this reaction, but that its half-life was actually . In 1967, the Berkeley team attempted to defend their work, stating that the isotope found was indeed 250 Fm but the isotope that the half-life measurements actually related to was californium-244, ": null
    },
    {
        "granddaughter": "decay product"
    },
    {
        " of 252 102, produced from the more abundant curium-244. Energy differences were then attributed to resolution and drift problems , although these had not been previously reported and should also have influenced other results. 1977 experiments showed that 252 102 indeed had a 2.3-second half-life. However, 1973 work also showed that the 250 Fm recoil could have also easily been produced from the ": null
    },
    {
        "isomeric transition": "isomeric transition"
    },
    {
        " of 250m Fm which could also have been formed in the reaction at the energy used. Given this, it is probable that no nobelium was actually produced in this experiment.     In 1959, the team continued their studies and claimed that they were able to produce an isotope that decayed predominantly by emission of an 8.3  MeV alpha particle, with a ": null
    },
    {
        "half-life": "half-life"
    },
    {
        " of 3 s with an associated 30% ": null
    },
    {
        "spontaneous fission": "spontaneous fission"
    },
    {
        " branch. The activity was initially assigned to 254 102 but later changed to 252 102. However, they also noted that it was not certain that nobelium had been produced due to difficult conditions. The Berkeley team decided to adopt the proposed name of the Swedish team, nobelium , for the element.     : +  →  →  + 4      Meanwhile, in Dubna, experiments were carried out in 1958 and 1960 aiming to synthesize element 102 as well. The first 1958 experiment bombarded ": null
    },
    {
        "plutonium-239": "plutonium-239"
    },
    {
        " and ": null
    },
    {
        "-241": "plutonium-241"
    },
    {
        " with ": null
    },
    {
        "oxygen-16": "oxygen-16"
    },
    {
        " ions. Some alpha decays with energies just over 8.5  MeV were observed, and they were assigned to 251,252,253 102, although the team wrote that formation of isotopes from ": null
    },
    {
        "lead": "lead"
    },
    {
        " or ": null
    },
    {
        "bismuth": "bismuth"
    },
    {
        " impurities could not be ruled out. While later 1958 experiments noted that new isotopes could be produced from ": null
    },
    {
        "mercury": "mercury"
    },
    {
        ", ": null
    },
    {
        "thallium": "thallium"
    },
    {
        ", lead, or bismuth impurities, the scientists still stood by their conclusion that element 102 could be produced from this reaction, mentioning a half-life of under 30  seconds and a decay energy of  MeV. Later 1960 experiments proved that these were background effects. 1967 experiments also lowered the decay energy to  MeV, but both values are too high to possibly match those of 253 No or 254 No. The Dubna team later stated in 1970 and again in 1987 that these results were not conclusive.     In 1961, Berkeley scientists claimed the discovery of ": null
    },
    {
        "element 103": "lawrencium"
    },
    {
        " in the reaction of californium with ": null
    },
    {
        "boron": "boron"
    },
    {
        " and carbon ions. They claimed the production of the isotope 257 103, and also claimed to have synthesized an alpha decaying isotope of element 102 that had a half-life of 15  s and alpha decay energy 8.2  MeV. They assigned this to 255 102 without giving a reason for the assignment. The values do not agree with those now known for 255 No, although they do agree with those now known for 257 No, and while this isotope probably played a part in this experiment, its discovery was inconclusive.     Work on element 102 also continued in Dubna, and in 1964, experiments were carried out there to detect alpha-decay daughters of element 102 isotopes by synthesizing element 102 from the reaction of a ": null
    },
    {
        "uranium-238": "uranium-238"
    },
    {
        " target with ": null
    },
    {
        "neon": "neon"
    },
    {
        " ions. The products were carried along a ": null
    },
    {
        "silver": "silver"
    },
    {
        " catcher foil and purified chemically, and the isotopes 250 Fm and 252 Fm were detected. The yield of 252 Fm was interpreted as evidence that its parent 256 102 was also synthesized: as it was noted that 252 Fm could also be produced directly in this reaction by the simultaneous emission of an alpha particle with the excess neutrons, steps were taken to ensure that 252 Fm could not go directly to the catcher foil. The half-life detected for 256 102 was 8  s, which is much higher than the more modern 1967 value of  s. Further experiments were conducted in 1966 for 254 102, using the reactions 243 ": null
    },
    {
        "Am": "americium"
    },
    {
        " 254 102 and 238 U 254 102, finding a half-life of  s: at that time the discrepancy between this value and the earlier Berkeley value was not understood, although later work proved that the formation of the isomer 250m Fm was less likely in the Dubna experiments than at the Berkeley ones. In hindsight, the Dubna results on 254 102 were probably correct and can be now considered a conclusive detection of element 102.     One more very convincing experiment from Dubna was published in 1966, again using the same two reactions, which concluded that 254 102 indeed had a half-life much longer than the 3  seconds claimed by Berkeley. Later work in 1967 at Berkeley and 1971 at the ": null
    },
    {
        "Oak Ridge National Laboratory": "oak ridge national laboratory"
    },
    {
        " fully confirmed the discovery of element 102 and clarified earlier observations. In December 1966, the Berkeley group repeated the Dubna experiments and fully confirmed them, and used this data to finally assign correctly the isotopes they had previously synthesized but could not yet identify at the time, and thus claimed to have discovered nobelium in 1958 to 1961.     : +  →  →  + 6      In 1969, the Dubna team carried out chemical experiments on element 102 and concluded that it behaved as the heavier homologue of ": null
    },
    {
        "ytterbium": "ytterbium"
    },
    {
        ". The Russian scientists proposed the name joliotium for the new element after ": null
    },
    {
        "Irène Joliot-Curie": "irène joliot-curie"
    },
    {
        ", who had recently died, creating an ": null
    },
    {
        "element naming controversy": "transfermium wars"
    },
    {
        " that would not be resolved for several decades, which each group using its own proposed names.     In 1992, the ": null
    },
    {
        "IUPAC": "iupac"
    },
    {
        "-": null
    },
    {
        "IUPAP": "iupap"
    },
    {
        " Transfermium Working Group reassessed the claims of discovery and concluded that only the Dubna work from 1966 correctly detected and assigned decays to nuclei with atomic number 102 at the time. The Dubna team are therefore officially recognised as the discoverers of nobelium although it is possible that it was detected at Berkeley in 1959. This decision was criticized by Berkeley the following year, calling the reopening of the cases of elements 101 to 103 a futile waste of time , while Dubna agreed with IUPACs decision.     In 1994, as part of an attempted resolution to the element naming controversy, IUPAC ratified names for elements 101–109. For element 102, it ratified the name nobelium on the basis that it had become entrenched in the literature over the course of 30 years and that ": null
    },
    {
        "Alfred Nobel": "alfred nobel"
    },
    {
        " should be commemorated in this fashion.  Because of outcry over the 1994 names, which mostly did not respect the choices of the discoverers, a comment period ensued, and in 1995 IUPAC named element 102 flerovium as part of a new proposal, after either ": null
    },
    {
        "Georgy Flyorov": "georgy flyorov"
    },
    {
        " or his eponymous ": null
    },
    {
        "Flerov Laboratory of Nuclear Reactions": "flerov laboratory of nuclear reactions"
    },
    {
        ".  This proposal was also not accepted, and in 1997 the name nobelium was restored. Today the name flerovium , with the same symbol, refers to ": null
    },
    {
        "element 114": "flerovium"
    },
    {
        ".               In the ": null
    },
    {
        "periodic table": "periodic table"
    },
    {
        ", nobelium is located to the right of the actinide ": null
    },
    {
        "mendelevium": "mendelevium"
    },
    {
        ", to the left of the actinide ": null
    },
    {
        "lawrencium": "lawrencium"
    },
    {
        ", and below the lanthanide ": null
    },
    {
        "ytterbium": "ytterbium"
    },
    {
        ". Nobelium metal has not yet been prepared in bulk quantities, and bulk preparation is currently impossible. Silva, pp. 1639 Nevertheless, a number of predictions and some preliminary experimental results have been done regarding its properties.     The lanthanides and actinides, in the metallic state, can exist as either divalent  or trivalent metals. The former have f n+1 s 2 configurations, whereas the latter have f n d 1 s 2 configurations. In 1975, Johansson and Rosengren examined the measured and predicted values for the ": null
    },
    {
        "cohesive energies": "cohesive energy"
    },
    {
        "  of the metallic ": null
    },
    {
        "lanthanides": "lanthanide"
    },
    {
        "and ": null
    },
    {
        "actinide": "actinide"
    },
    {
        "s, both as divalent and trivalent metals. Silva, pp. 1626–8  The conclusion was that the increased binding energy of the f 13 6d 1 7s 2 configuration over the f 14 7s 2 configuration for nobelium was not enough to compensate for the energy needed to promote one 5f electron to 6d, as is true also for the very late actinides: thus ": null
    },
    {
        "einsteinium": "einsteinium"
    },
    {
        ", ": null
    },
    {
        "fermium": "fermium"
    },
    {
        ", ": null
    },
    {
        "mendelevium": "mendelevium"
    },
    {
        ", and nobelium were expected to be divalent metals, although for nobelium this prediction has not yet been confirmed. The increasing predominance of the divalent state well before the actinide series concludes is attributed to the ": null
    },
    {
        "relativistic": "relativistic quantum chemistry"
    },
    {
        " stabilization of the 5f electrons, which increases with increasing atomic number: an effect of this is that nobelium is predominantly divalent instead of trivalent, unlike all the other lanthanides and actinides.  In 1986, nobelium metal was estimated to have an ": null
    },
    {
        "enthalpy of sublimation": "enthalpy of sublimation"
    },
    {
        " between 126  kJ/mol, a value close to the values for einsteinium, fermium, and mendelevium and supporting the theory that nobelium would form a divalent metal. Like the other divalent late actinides , metallic nobelium should assume a ": null
    },
    {
        "face-centered cubic": "face-centered cubic"
    },
    {
        " crystal structure. Divalent nobelium metal should have a ": null
    },
    {
        "metallic radius": "metallic radius"
    },
    {
        " of around 197  ": null
    },
    {
        "pm": "picometer"
    },
    {
        ". Nobeliums melting point has been predicted to be 827  °C, the same value as that estimated for the neighboring element mendelevium.  Its density is predicted to be around 9.9  ±  0.4  g/cm 3 .       The chemistry of nobelium is incompletely characterized and is known only in aqueous solution, in which it can take on the +3 or +2 ": null
    },
    {
        "oxidation state": "oxidation state"
    },
    {
        "s, the latter being more stable. Silva, pp. 1636–7 It was largely expected before the discovery of nobelium that in solution, it would behave like the other actinides, with the trivalent state being predominant; however, Seaborg predicted in 1949 that the +2 state would also be relatively stable for nobelium, as the No 2+ ion would have the ground-state electron configuration f 14 , including the stable filled 5f 14 shell. It took nineteen years before this prediction was confirmed. Silva, pp. 1639–41     In 1967, experiments were conducted to compare nobeliums chemical behavior to that of ": null
    },
    {
        "terbium": "terbium"
    },
    {
        ", ": null
    },
    {
        "californium": "californium"
    },
    {
        ", and ": null
    },
    {
        "fermium": "fermium"
    },
    {
        ". All four elements were reacted with ": null
    },
    {
        "chlorine": "chlorine"
    },
    {
        " and the resulting chlorides were deposited along a tube, along which they were carried by a gas. It was found that the nobelium chloride produced was strongly ": null
    },
    {
        "adsorbed": "adsorption"
    },
    {
        " on solid surfaces, proving that it was not very ": null
    },
    {
        "volatile": "volatility"
    },
    {
        ", like the chlorides of the other three investigated elements. However, both NoCl 2 and NoCl 3 were expected to exhibit nonvolatile behavior and hence this experiment was inconclusive as to what the preferred oxidation state of nobelium was. Determination of nobeliums favoring of the +2 state had to wait until the next year, when ": null
    },
    {
        "cation-exchange chromatography": "cation-exchange chromatography"
    },
    {
        " and ": null
    },
    {
        "coprecipitation": "coprecipitation"
    },
    {
        " experiments were carried out on around fifty thousand 255 No atoms, finding that it behaved differently from the other actinides and more like the divalent ": null
    },
    {
        "alkaline earth metal": "alkaline earth metal"
    },
    {
        "s. This proved that in aqueous solution, nobelium is most stable in the divalent state when strong ": null
    },
    {
        "oxidizers": "redox"
    },
    {
        " are absent. Later experimentation in 1974 showed that nobelium eluted with the alkaline earth metals, between ": null
    },
    {
        "Ca": "calcium"
    },
    {
        " 2+ and ": null
    },
    {
        "Sr": "strontium"
    },
    {
        " 2+ . Nobelium is the only known f-block element for which the +2 state is the most common and stable one in aqueous solution. This occurs because of the large energy gap between the 5f and 6d orbitals at the end of the actinide series.      It is expected that the relativistic stabilization of the 7s subshell greatly destabilizes nobelium dihydride, NoH 2 , and relativistic stabilisation of the 7p 1/2 spinor over the 6d 3/2 spinor mean that excited states in nobelium atoms have 7s and 7p contribution instead of the expected 6d contribution. The long No–H distances in the NoH 2 molecule and the significant charge transfer lead to extreme ionicity with a ": null
    },
    {
        "dipole moment": "molecular dipole moment"
    },
    {
        " of 5.94  ": null
    },
    {
        "D": "debye"
    },
    {
        " for this molecule. In this molecule, nobelium is expected to exhibit ": null
    },
    {
        "main-group-like": "main group element"
    },
    {
        " behavior, specifically acting like an ": null
    },
    {
        "alkaline earth metal": "alkaline earth metal"
    },
    {
        " with its ns 2 valence shell configuration and core-like 5f orbitals.      Nobeliums ": null
    },
    {
        "complexing": "coordination complex"
    },
    {
        " ability with ": null
    },
    {
        "chloride": "chloride"
    },
    {
        " ions is most similar to that of ": null
    },
    {
        "barium": "barium"
    },
    {
        ", which complexes rather weakly. Its complexing ability with ": null
    },
    {
        "citrate": "citrate"
    },
    {
        ", ": null
    },
    {
        "oxalate": "oxalate"
    },
    {
        ", and ": null
    },
    {
        "acetate": "acetate"
    },
    {
        " in an aqueous solution of 0.5  M  ": null
    },
    {
        "ammonium nitrate": "ammonium nitrate"
    },
    {
        " is between that of calcium and strontium, although it is somewhat closer to that of strontium.     The ": null
    },
    {
        "standard reduction potential": "standard reduction potential"
    },
    {
        " of the E° couple was estimated in 1967 to be between +1.4  and  +1.5  ": null
    },
    {
        "V": "volt"
    },
    {
        "; it was later found in 2009 to be only about +0.75  V.  The positive value shows that No 2+ is more stable than No 3+ and that No 3+ is a good oxidizing agent. While the quoted values for the E° and E° vary among sources, the accepted standard estimates are −2.61  and  −1.26  V. It has been predicted that the value for the E° couple would be +6.5  V. The ": null
    },
    {
        "Gibbs energies": "gibbs energy"
    },
    {
        " of formation for No 3+ and No 2+ are estimated to be −342  and  −480  ": null
    },
    {
        "kJ/mol": "kilojoule per mole"
    },
    {
        ", respectively.       A nobelium atom has 102 electrons, of which three can act as ": null
    },
    {
        "valence electron": "valence electron"
    },
    {
        "s. They are expected to be arranged in the configuration f 14 7s 2 , although experimental verification of this electron configuration had not yet been made as of 2006. In forming compounds, all the three valence electrons may be lost, leaving behind a f 13 core: this conforms to the trend set by the other actinides with their f n electron configurations in the tripositive state. Nevertheless, it is more likely that only two valence electrons may be lost, leaving behind a stable f 14 core with a filled 5f 14 shell. The first ": null
    },
    {
        "ionization potential": "ionization potential"
    },
    {
        " of nobelium was measured to be at most  ": null
    },
    {
        "eV": "electronvolt"
    },
    {
        " in 1974, based on the assumption that the 7s electrons would ionize before the 5f ones;  this value has since not yet been refined further due to nobeliums scarcity and high radioactivity. Lide, David R. , CRC Handbook of Chemistry and Physics, 84th Edition, CRC Press, Boca Raton , 2003, section 10, Atomic, Molecular, and Optical Physics; Ionization Potentials of Atoms and Atomic Ions The ionic radius of ": null
    },
    {
        "hexacoordinate": "coordination number"
    },
    {
        " and octacoordinate No 3+ had been preliminarily estimated in 1978 to be around 90 and 102  pm respectively; the ionic radius of No 2+ has been experimentally found to be 100  pm to two ": null
    },
    {
        "significant figure": "significant figure"
    },
    {
        "s. The ": null
    },
    {
        "enthalpy of hydration": "enthalpy of hydration"
    },
    {
        " of No 2+ has been calculated as 1486  kJ/mol.            Twelve isotopes of nobelium are known, with ": null
    },
    {
        "mass numbers": "mass number"
    },
    {
        "250–260 and 262; all are radioactive. Silva, pp. 1637–8 Additionally, ": null
    },
    {
        "nuclear isomers": "nuclear isomer"
    },
    {
        "are known for mass numbers 251, 253, and 254.  Of these, the longest-lived isotope is 259 No with a half-life of 58  minutes, and the longest-lived isomer is 251m No with a half-life of 1.7  seconds.  However, the still undiscovered isotope 261 No is predicted to have a still longer half-life of 170  min. Additionally, the shorter-lived 255 No is more often used in chemical experimentation because it can be produced in larger quantities from irradiation of ": null
    },
    {
        "californium-249": "californium-249"
    },
    {
        " with ": null
    },
    {
        "carbon-12": "carbon-12"
    },
    {
        " ions. After 259 No and 255 No, the next most stable nobelium isotopes are 253 No , 254 No , 257 No , 256 No , and 252 No . All of the remaining nobelium isotopes have half-lives that are less than a second, and the shortest-lived known nobelium isotope has a half-life of only 0.25  ": null
    },
    {
        "millisecond": "millisecond"
    },
    {
        "s. The isotope 254 No is especially interesting theoretically as it is in the middle of a series of ": null
    },
    {
        "prolate": "prolate"
    },
    {
        " nuclei from 231 ": null
    },
    {
        "Pa": "protactinium"
    },
    {
        " to 279 ": null
    },
    {
        "Rg": "roentgenium"
    },
    {
        ", and the formation of its nuclear isomers is controlled by ": null
    },
    {
        "proton orbitals": "nuclear shell model"
    },
    {
        " such as 2f 5/2 which come just above the spherical proton shell; it can be synthesized in the reaction of 208 Pb with 48 Ca.      The half-lives of nobelium isotopes increase smoothly from 250 No to 253 No. However, a dip appears at 254 No, and beyond this the half-lives of ": null
    },
    {
        "even-even": "even and odd atomic nuclei"
    },
    {
        " nobelium isotopes drop sharply as ": null
    },
    {
        "spontaneous fission": "spontaneous fission"
    },
    {
        " becomes the dominant decay mode. For example, the half-life of 256 No is almost three seconds, but that of 258 No is only 1.2  milliseconds. This shows that at nobelium, the mutual repulsion of protons poses a limit to the ": null
    },
    {
        "region of long-lived nuclei": "island of stability"
    },
    {
        " in the ": null
    },
    {
        "actinide": "actinide"
    },
    {
        " series.  The even-odd nobelium isotopes mostly continue to have longer half-lives as their mass numbers increase, with a dip in the trend at 257 No.       The isotopes of nobelium are mostly produced by bombarding actinide targets , with the exception of nobelium-262, which is produced as the ": null
    },
    {
        "daughter": "decay product"
    },
    {
        " of lawrencium-262. The most commonly used isotope, 255 No, can be produced from bombarding ": null
    },
    {
        "curium": "curium"
    },
    {
        "-248 or californium-249 with carbon-12: the latter method is more common. Irradiating a 350  ": null
    },
    {
        "μg": "microgram"
    },
    {
        "  cm −2 target of californium-249 with three  trillion 73  ": null
    },
    {
        "MeV": "electronvolt"
    },
    {
        " carbon-12 ions per second for ten minutes can produce around 1200 nobelium-255 atoms.     Once the nobelium-255 is produced, it can be separated out in a similar way as used to purify the neighboring actinide mendelevium. The recoil ": null
    },
    {
        "momentum": "momentum"
    },
    {
        " of the produced nobelium-255 atoms is used to bring them physically far away from the target from which they are produced, bringing them onto a thin foil of metal  just behind the target in a vacuum: this is usually combined by trapping the nobelium atoms in a gas atmosphere , and carrying them along with a gas jet from a small opening in the reaction chamber. Using a long ": null
    },
    {
        "capillary tube": "capillary tube"
    },
    {
        ", and including ": null
    },
    {
        "potassium chloride": "potassium chloride"
    },
    {
        " aerosols in the helium gas, the nobelium atoms can be transported over tens of ": null
    },
    {
        "meter": "meter"
    },
    {
        "s. Silva, pp. 1638–9 The thin layer of nobelium collected on the foil can then be removed with dilute acid without completely dissolving the foil. The nobelium can then be isolated by exploiting its tendency to form the divalent state, unlike the other trivalent actinides: under typically used ": null
    },
    {
        "elution": "elution"
    },
    {
        " conditions , nobelium will pass through the column and elute while the other trivalent actinides remain on the column. However, if a direct catcher gold foil is used, the process is complicated by the need to separate out the gold using ": null
    },
    {
        "anion-exchange": "anion-exchange"
    },
    {
        " chromatography": "chromatography"
    },
    {
        " before isolating the nobelium by elution from ": null
    },
    {
        "chromatographic": "chromatography"
    }
]