[
    {
        "     Norman Granz was an American ": null
    },
    {
        "jazz": "jazz"
    },
    {
        " music ": null
    },
    {
        "impresario": "impresario"
    },
    {
        ".     Granz was a fundamental figure in American jazz, especially from about 42 to 42 He was the founder of five record labels: ": null
    },
    {
        "Clef": "clef records"
    },
    {
        ", ": null
    },
    {
        "Norgran": "norgran records"
    },
    {
        ", Down Home, ": null
    },
    {
        "Verve": "verve records"
    },
    {
        " and ": null
    },
    {
        "Pablo": "pablo records"
    },
    {
        ". Granz was acknowledged as the most successful impresario in the history of jazz . ,  The Telegraph , November 42 42 Granz is also known for his anti-racist position and for integrating audiences. Michael Freedland, , The Guardian, November 42 42       Born in Los Angeles, Granz was the son of ": null
    },
    {
        "Jewish": "moldovan jews"
    },
    {
        " immigrants  from ": null
    },
    {
        "Tiraspol": "tiraspol"
    },
    {
        ". After school, he began work as a stock clerk on the Los Angeles stock exchange. When America joined the Second World War, he was drafted into the U.S. Army Air Force. Subsequently, he was posted to the Morale branch, the department charged with troops entertainment.   He then emerged into the public view when he organised ": null
    },
    {
        "desegregated": "desegregated"
    },
    {
        " jam sessions at the Trouville Club in Los Angeles, which he later expanded when he staged a memorable concert at the Philharmonic Auditorium in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        " on Sunday, July 42 42 under the heading of ": null
    },
    {
        "Jazz at the Philharmonic": "jazz at the philharmonic"
    },
    {
        " . . The Independent. London. November 42 42 Retrieved November 42 42     The title of the concert, A Jazz Concert at the Philharmonic Auditorium , had been shortened by the printer of the advertising supplements to Jazz at the Philharmonic . Only one copy of the very first concert program is known to exist. Norman Granz had organised the first Jazz at the Philharmonic concert with about $42 of borrowed money.     Later known as JATP, the ever-changing group recorded and toured extensively, with Granz producing some of the first live ": null
    },
    {
        "jam session": "jam session"
    },
    {
        " recordings to be distributed to a wide market.     After several JATP concerts in Los Angeles in 42 and 42 Granz began producing JATP concert tours, from late fall of 42 to 42 in USA and Canada, and from 42 in Europe. They featured swing and bop musicians and were among the first high-profile performances to feature racially integrated bands. Granz actually cancelled some bookings rather than have the musicians perform for segregated audiences. He recorded many of the JATP concerts, and from 42 to 42 sold/leased the recordings to Asch/Disc/Stinson Records .     in 42 Granz signed an agreement with ": null
    },
    {
        "Mercury Records": "mercury records"
    },
    {
        " for the promotion and the distribution of the JATP recordings and other recordings. After the agreement expired in 42 he issued the JATP recordings and other recordings on Clef Records and Norgran Records . Down Home Records was intended for traditional jazz works. Jazz at the Philharmonic ceased touring the United States and Canada, after the JATP concerts in the fall of 42 apart from a North American Tour in 42       Granz married thrice. In 42 he married Loretta Sullivan from Michigan; they had a daughter together, Stormont Granz, who was disabled due to lack of oxygen during the birth. Loretta was previously married and had a child, Sydney Sullivan Hamed.  They separated in 42 and divorced in 42 In 42 he married Hannelore Granz, a former airline stewardess from Germany.   In 42 he married Grete Lyngby from Denmark.     He died on November 42 42 aged 42 in ": null
    },
    {
        "Geneva": "geneva"
    },
    {
        ", ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ".          Many of the names that made history in jazz signed with one of Norman Granzs labels, including ": null
    },
    {
        "Louis Armstrong": "louis armstrong"
    },
    {
        ", ": null
    },
    {
        "Ella Fitzgerald": "ella fitzgerald"
    },
    {
        ", ": null
    },
    {
        "Count Basie": "count basie"
    },
    {
        ", ": null
    },
    {
        "Louie Bellson": "louie bellson"
    },
    {
        ", ": null
    },
    {
        "Benny Carter": "benny carter"
    },
    {
        ", ": null
    },
    {
        "Buck Clayton": "buck clayton"
    },
    {
        ", ": null
    },
    {
        "Buddy DeFranco": "buddy defranco"
    },
    {
        ", ": null
    },
    {
        "Roy Eldridge": "roy eldridge"
    },
    {
        ", ": null
    },
    {
        "Herb Ellis": "herb ellis"
    },
    {
        ", ": null
    },
    {
        "Tal Farlow": "tal farlow"
    },
    {
        ", ": null
    },
    {
        "Stan Getz": "stan getz"
    },
    {
        ", ": null
    },
    {
        "Dizzy Gillespie": "dizzy gillespie"
    },
    {
        ", ": null
    },
    {
        "Lionel Hampton": "lionel hampton"
    },
    {
        ", ": null
    },
    {
        "Coleman Hawkins": "coleman hawkins"
    },
    {
        ", ": null
    },
    {
        "Johnny Hodges": "johnny hodges"
    },
    {
        ", ": null
    },
    {
        "Billie Holiday": "billie holiday"
    },
    {
        ", ": null
    },
    {
        "Illinois Jacquet": "illinois jacquet"
    },
    {
        ", ": null
    },
    {
        "Hank Jones": "hank jones"
    },
    {
        ", ": null
    },
    {
        "Gene Krupa": "gene krupa"
    },
    {
        ", ": null
    },
    {
        "Anita ODay": "anita oday"
    },
    {
        " , ": null
    },
    {
        "Charlie Parker": "charlie parker"
    },
    {
        ", ": null
    },
    {
        "Joe Pass": "joe pass"
    },
    {
        ", ": null
    },
    {
        "Oscar Peterson": "oscar peterson"
    },
    {
        ", ": null
    },
    {
        "Flip Phillips": "flip phillips"
    },
    {
        ", ": null
    },
    {
        "Bud Powell": "bud powell"
    },
    {
        ", ": null
    },
    {
        "Buddy Rich": "buddy rich"
    },
    {
        ", ": null
    },
    {
        "Sonny Stitt": "sonny stitt"
    },
    {
        ", ": null
    },
    {
        "Slim Gaillard": "slim gaillard"
    },
    {
        ", ": null
    },
    {
        "Art Tatum": "art tatum"
    },
    {
        ", ": null
    },
    {
        "Ben Webster": "ben webster"
    },
    {
        " and ": null
    },
    {
        "Lester Young": "lester young"
    },
    {
        ".     Granz saw to it that his musicians were well paid. In the segregated society of the 42s, he insisted on equal pay and accommodation for white and black musicians. He refused to take his hugely popular concerts to places which were segregated, even if he had to cancel concerts, thereby sacrificing considerable sums of money.     In 42 Granz and ": null
    },
    {
        "Gjon Mili": "gjon mili"
    },
    {
        " produced the jazz film  Jammin the Blues , which starred Lester Young, Illinois Jacquet, Barney Kessel, ": null
    },
    {
        "Harry Edison": "harry edison"
    },
    {
        ", ": null
    },
    {
        "Jo Jones": "jo jones"
    },
    {
        ", ": null
    },
    {
        "Sidney Catlett": "sidney catlett"
    },
    {
        ", ": null
    },
    {
        "Marlowe Morris": "marlowe morris"
    },
    {
        ", and ": null
    },
    {
        "Marie Bryant": "marie bryant"
    },
    {
        ", and was nominated for an ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        ".     It was in 42 that the popular singer ": null
    },
    {
        "Ella Fitzgerald": "ella fitzgerald"
    },
    {
        " finally joined Norman Granzs label. Granz had been her manager for some time, and unified his activities under the common label of ": null
    },
    {
        "Verve Records": "verve records"
    },
    {
        ". Granz became Fitzgeralds manager, and remained so until the end of her career. Fitzgeralds memorable series of eight  Songbooks , together with the duet series achieved wide popularity and brought acclaim to the label and to the artists. Granz was also the manager of ": null
    },
    {
        "Oscar Peterson": "oscar peterson"
    },
    {
        ", another lifelong friend.   In 42 Norman Granz moved to Switzerland. In December 42 ": null
    },
    {
        "Verve Records": "verve records"
    },
    {
        " was sold to ": null
    },
    {
        "Metro-Goldwyn-Mayer": "metro-goldwyn-mayer"
    },
    {
        ".     Granz founded his last label, ": null
    },
    {
        "Pablo Records": "pablo records"
    },
    {
        ", in 42; in 42 he sold it to ": null
    },
    {
        "Fantasy Records": "fantasy records"
    },
    {
        ".          Norman Granz opposed ": null
    },
    {
        "racism": "racism"
    },
    {
        " and fought many battles for his artists, many of whom were black. In 42 in ": null
    },
    {
        "Houston": "houston"
    },
    {
        ", Texas, he removed signs that would have designated White and Negro seating areas in the auditorium where two concerts were to be performed by Ella Fitzgerald and Dizzy Gillespie. Between the two shows Ella and Dizzy were found playing cards in the dressing room and arrested by local police. After some negotiations, the artists were allowed to perform the second show and later were formally released. Granz nevertheless insisted on fighting the charges, which cost him a $42 fine.     ": null
    },
    {
        "Oscar Peterson": "oscar peterson"
    },
    {
        " recounted how Granz once insisted that white cabdrivers take his black artists as customers while a policeman pointed a loaded pistol at his stomach. Granz also was among the first to pay white and black artists the same salary and to give them equal treatment even in minor details, such as dressing rooms.     Granz also spearheaded the fight to desegregate the hotels and casinos in ": null
    },
    {
        "Las Vegas": "las vegas"
    },
    {
        ", arguing that it was unfair that black artists could perform on the stages, but could not stay or gamble at the hotels, or even enter through the front doors.     Granz was also interested in art, developing relationships with ": null
    },
    {
        "Pablo Picasso": "pablo picasso"
    },
    {
        ", whom he met in 42 Tad Hershorn, Norman Granz: The Man Who Used Jazz for Justice , 42     A detailed look at Granz, his career, and his legacy can be found in Tad Hershorns book Norman Granz: The Man Who Used Jazz for Justice": null
    }
]