[
    {
        "              Norodom Sihanouk  was ": null
    },
    {
        "head of state of Cambodia": "head of state of cambodia"
    },
    {
        " numerous times. In Cambodia, he is known as Samdech Euv . During his lifetime Cambodia was variously called the ": null
    },
    {
        "French Protectorate of Cambodia": "french protectorate of cambodia"
    },
    {
        " , the ": null
    },
    {
        "Kingdom of Cambodia ": "kingdom of cambodia"
    },
    {
        ", the ": null
    },
    {
        "Khmer Republic": "khmer republic"
    },
    {
        " , ": null
    },
    {
        "Democratic Kampuchea": "democratic kampuchea"
    },
    {
        " , the ": null
    },
    {
        "Peoples Republic of Kampuchea": "peoples republic of kampuchea"
    },
    {
        " , and again the ": null
    },
    {
        "Kingdom of Cambodia": "kingdom of cambodia"
    },
    {
        " .     Sihanouk became ": null
    },
    {
        "king of Cambodia": "king of cambodia"
    },
    {
        " in 42 upon the death of his maternal grandfather, ": null
    },
    {
        "King Monivong": "king monivong"
    },
    {
        ". After the ": null
    },
    {
        "Japanese occupation of Cambodia": "japanese occupation of cambodia"
    },
    {
        " during the Second World War, he secured Cambodian independence from France. He abdicated in 42 and was succeeded by his father, ": null
    },
    {
        "Suramarit": "suramarit"
    },
    {
        ". Sihanouks political organization ": null
    },
    {
        "Sangkum": "sangkum"
    },
    {
        " won the ": null
    },
    {
        "general elections": "1955 cambodian general election"
    },
    {
        " that year and he became ": null
    },
    {
        "prime minister of Cambodia": "prime minister of cambodia"
    },
    {
        ". He governed it under ": null
    },
    {
        "one-party rule": "one-party rule"
    },
    {
        ", suppressed political dissent, and declared himself ": null
    },
    {
        "Head of State": "head of state"
    },
    {
        " in 42 Officially ": null
    },
    {
        "neutral": "neutral country"
    },
    {
        " in foreign relations, in practice he was closer to the ": null
    },
    {
        "communist bloc": "communist bloc"
    },
    {
        ". The ": null
    },
    {
        "Cambodian coup of 42": "cambodian coup of 1970"
    },
    {
        " ousted him and he fled to China and North Korea, there forming a ": null
    },
    {
        "government-in-exile": "grunk"
    },
    {
        " and ": null
    },
    {
        "resistance movement": "national united front of kampuchea"
    },
    {
        ". He returned as figurehead head of state after the ": null
    },
    {
        "Cambodian Civil War": "cambodian civil war"
    },
    {
        " resulted in victory for the ": null
    },
    {
        "Khmer Rouge": "khmer rouge"
    },
    {
        " in 42 His relations with the government declined and in 42 he resigned. He was placed under house arrest until ": null
    },
    {
        "Vietnamese forces": "cambodian–vietnamese warinvasion of kampuchea"
    },
    {
        " overthrew the Khmer Rouge in 42     Sihanouk went into exile again and in 42 formed ": null
    },
    {
        "FUNCINPEC": "funcinpec"
    },
    {
        ", a resistance party. The following year, he became president of the ": null
    },
    {
        "Coalition Government of Democratic Kampuchea": "coalition government of democratic kampuchea"
    },
    {
        " , a broad coalition of anti-Vietnamese resistance factions which retained Cambodias seat at the ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ", making him Cambodias internationally recognized head of state. In the late 42s, informal talks were carried out to end hostilities between the Vietnam-supported Peoples Republic of Kampuchea and the CGDK. In 42 the Supreme National Council of Cambodia was formed as a transitional body to oversee Cambodias sovereign matters, with Sihanouk as its president. The ": null
    },
    {
        "42 Paris Peace Accords": "1991 paris peace accords"
    },
    {
        " were signed and the ": null
    },
    {
        "United Nations Transitional Authority in Cambodia": "united nations transitional authority in cambodia"
    },
    {
        " was established the following year. The UNTAC organized the ": null
    },
    {
        "42 Cambodian general election": "1993 cambodian general election"
    },
    {
        "s, and a coalition government, jointly led by his son ": null
    },
    {
        "Norodom Ranariddh": "norodom ranariddh"
    },
    {
        " and ": null
    },
    {
        "Hun Sen": "hun sen"
    },
    {
        ", was subsequently formed. He was reinstated as Cambodias king. He abdicated again in 42 and the ": null
    },
    {
        "Royal Council of the Throne": "royal council of the throne"
    },
    {
        " chose his son, ": null
    },
    {
        "Sihamoni": "sihamoni"
    },
    {
        ", as his successor. Sihanouk died in ": null
    },
    {
        "Beijing": "beijing"
    },
    {
        " in 42     Between 42 and 42 Sihanouk ": null
    },
    {
        "produced and directed 42 films": "norodom sihanouk filmography"
    },
    {
        ", some of which he acted in. The films, later described as being of low quality, often featured ": null
    },
    {
        "nationalistic": "khmer nationalism"
    },
    {
        " elements, as did a number of the songs he wrote. Some of his songs were about his wife ": null
    },
    {
        "Queen Monique": "queen monique"
    },
    {
        ", the nations neighboring Cambodia, and the ": null
    },
    {
        "communist leaders": "revolutionary song"
    },
    {
        " who supported him in his exile. In the 42s Sihanouk held concerts for diplomats in New York City. He also participated in concerts at his palace during his second reign.             Norodom Sihanouk was the only child born of the union between ": null
    },
    {
        "Norodom Suramarit": "norodom suramarit"
    },
    {
        " and ": null
    },
    {
        "Sisowath Kossamak": "sisowath kossamak"
    },
    {
        ". Jeldres , p. 42 His parents, who heeded the Royal Court Astrologers advice that he risked dying at a young age if he was raised under parental care, placed him under the care of Kossamaks grandmother, Pat. When Pat died, Kossamak brought Sihanouk to live with his paternal grandfather, Norodom Sutharot. Sutharot delegated parenting responsibilities to his daughter, Norodom Ket Kanyamom. Jeldres , p. 42 Sihanouk received his primary education at the François Baudoin school and Nuon Moniram school in Phnom Penh. Jeldres , p. 42 During this time, he received financial support from his maternal grandfather, ": null
    },
    {
        "Sisowath Monivong": "sisowath monivong"
    },
    {
        ", to head an amateur performance troupe and soccer team. In 42 Sihanouk was sent to ": null
    },
    {
        "Saigon": "ho chi minh city"
    },
    {
        ", where he pursued his secondary education at Lycée Chasseloup Laubat, a boarding school. Jeldres , p. 42     When the reigning king Monivong died on 42 April 42 the ": null
    },
    {
        "Governor-General of French Indochina": "list of governors-general of french indochina"
    },
    {
        ", ": null
    },
    {
        "Jean Decoux": "jean decoux"
    },
    {
        ", chose Sihanouk to succeed him. Osborne , p. 42 Sihanouks appointment as king was formalised the following day by the Cambodian Crown Council, Jeldres , p. 42 and his coronation ceremony took place on 42 May 42 Jeldres , p. 42 During the ": null
    },
    {
        "Japanese occupation of Cambodia": "japanese occupation of cambodia"
    },
    {
        ", he dedicated most of his time to sports, filming, and the occasional tour to the countryside. Osborne , p. 42 In March 42 the Japanese military, which had occupied Cambodia since August 42 ": null
    },
    {
        "dissolved the nominal French colonial administration": "second french indochina campaign"
    },
    {
        ". Under pressure from the Japanese, Sihanouk proclaimed Cambodias independence Osborne , p. 42 and assumed the position of prime minister while serving as king at the same time. Osborne , p. 42     As prime minister, Sihanouk revoked a decree issued by the last ": null
    },
    {
        "resident superior": "resident indochina"
    },
    {
        " of Cambodia, Georges Gautier, to ": null
    },
    {
        "romanise": "latin script"
    },
    {
        " the ": null
    },
    {
        "Khmer alphabet": "khmer alphabet"
    },
    {
        ". Osborne , p. 42 Following the ": null
    },
    {
        "Surrender of Japan": "surrender of japan"
    },
    {
        " in August 42 nationalist forces loyal to ": null
    },
    {
        "Son Ngoc Thanh": "son ngoc thanh"
    },
    {
        " launched a coup, which led to Thanh becoming prime minister. Osborne , p. 42 When the French returned to Cambodia in October 42 Thanh was dismissed and replaced by Sihanouks uncle ": null
    },
    {
        "Sisowath Monireth": "sisowath monireth"
    },
    {
        ". Osborne , p. 42 Monireth negotiated for greater autonomy in managing Cambodias internal affairs. A ": null
    },
    {
        "modus vivendi": "modus vivendi"
    },
    {
        " signed in January 42 granted Cambodia autonomy within the ": null
    },
    {
        "French Union": "french union"
    },
    {
        ". Jeldres , p. 42 A joint French-Cambodian commission was set up after that to draft Cambodias constitution, Osborne , p. 42 and in April 42 Sihanouk introduced clauses which provided for an elected parliament on the basis of universal male suffrage as well as ": null
    },
    {
        "press freedom": "freedom of the press"
    },
    {
        ". Osborne , p. 42 The first constitution was signed into effect by Sihanouk in May 42 Jeldres , p. 42 Around this time, Sihanouk made two trips to ": null
    },
    {
        "Saumur": "saumur"
    },
    {
        ", France, where he attended military training at the ": null
    },
    {
        "Armoured Cavalry Branch Training School": "armoured cavalry branch training school"
    },
    {
        " in 42 and again in 42 He was made a reserve captain in the French army. Jeldres , p. 42     In early 42 Sihanouk traveled to Paris with his parents to negotiate with the French government for more autonomy for Cambodia. The modus vivendi was replaced by a new Franco-Khmer treaty, which recognised Cambodia as independent within the French Union. Jeldres , p. 42 In practice, the treaty granted only limited ": null
    },
    {
        "self-rule": "self-governance"
    },
    {
        " to Cambodia. While Cambodia was given free rein in managing its foreign ministry and, to a lesser extent, its defence, most of the other ministries remained under French control. Chandler , p. 42 Meanwhile, dissenting legislators from the ": null
    },
    {
        "national assembly": "national assembly"
    },
    {
        " attacked the government led by prime minister ": null
    },
    {
        "Penn Nouth": "penn nouth"
    },
    {
        " over its failure to resolve deepening financial and corruption problems plaguing the country. The dissenting legislators, led by ": null
    },
    {
        "Yem Sambaur": "yem sambaur"
    },
    {
        ", who had defected from the Democrat party in November 42 Chandler , p. 42 deposed Penn Nouth. Chandler , p. 42 Yem Sambaur replaced him, but his appointment did not sit well with the Democrats, who in turn pressured Sihanouk to dissolve the national assembly and hold elections. Chandler , p. 42          Sihanouk, who by now had tired of the political squabbling, dissolved the assembly in September 42 Osborne , p. 42 but opted to rule by decree for the next two years before ": null
    },
    {
        "general elections": "1951 cambodian general election"
    },
    {
        " were held, which the Democrats won. Osborne , p. 42 In October 42 Thanh returned to Cambodia and was received by 42 supporters, a spectacle which Sihanouk saw as an affront to his regal authority. Chandler , p. 42 Thanh disappeared six months later, presumably to join the ": null
    },
    {
        "Khmer Issarak": "khmer issarak"
    },
    {
        ". Chandler , p. 42 Sihanouk ordered the Democrat-led government to arrest Thanh but was ignored. Chandler , p. 42 Subsequently, civil demonstrations against the monarchy and the French broke out in the countryside, Chandler , p. 42 alarming Sihanouk, who began to suspect that the Democrats were complicit. Chandler , p. 42 In June 42 Sihanouk dismissed the Democrat nominee Huy Kanthoul and made himself prime minister. A few days later, Sihanouk privately confided in exasperation to the US chargé daffaires, ": null
    },
    {
        "Thomas Gardiner Corcoran": "thomas gardiner corcoran"
    },
    {
        ", that ": null
    },
    {
        "parliamentary democracy": "parliamentary democracy"
    },
    {
        " was unsuitable for Cambodia.     In January 42 Sihanouk re-appointed Penn Nouth as prime minister before leaving for France. Once there, Sihanouk wrote to French President ": null
    },
    {
        "Vincent Auriol": "vincent auriol"
    },
    {
        " requesting that he grant Cambodia full independence, citing widespread anti-French sentiment among the Cambodian populace. Osborne , p. 42 Auriol deferred Sihanouks request to the French Commissioner for Overseas Territories, Jean Letourneau, who promptly rejected it. Subsequently, Sihanouk traveled to Canada and the United States, where he gave radio interviews to present his case. He took advantage of the prevailing ": null
    },
    {
        "anti-communist": "anti-communism"
    },
    {
        " sentiment in those countries, arguing that Cambodia faced a Communist threat similar to that of the ": null
    },
    {
        "Viet Minh": "viet minh"
    },
    {
        " in Vietnam, and that the solution was to grant full independence to Cambodia. Osborne , p. 42 Sihanouk returned to Cambodia in June 42 taking up residence in Siem Reap. Jeldres , p. 42 He organised public rallies calling for Cambodians to fight for independence, and formed a citizenry militia which attracted about 42 recruits. Chandler , p. 42     In August 42 France agreed to cede control over judicial and ": null
    },
    {
        "interior": "interior ministry"
    },
    {
        " affairs to Cambodia, and in October 42 the defense ministry as well. At the end of October, Sihanouk went to Phnom Penh, Osborne , p. 42 where he declared Cambodias independence from France on 42 November 42 In May 42 Sihanouk sent two of his cabinet ministers, ": null
    },
    {
        "Nhiek Tioulong": "nhiek tioulong"
    },
    {
        " and Tep Phan, to represent Cambodia at the ": null
    },
    {
        "Geneva Conference": "geneva conference"
    },
    {
        ". Osborne , p. 42 The ": null
    },
    {
        "agreements": "geneva agreements"
    },
    {
        " affirmed Cambodias independence and allowed it to seek military aid from any country without restrictions. At the same time, Sihanouks relations with the governing Democrat party remained strained, as they were wary of his growing political influence. Osborne , p. 42 To counter Democrat opposition, Sihanouk held a ": null
    },
    {
        "national referendum": "1955 cambodian geneva conference referendum"
    },
    {
        " to gauge public approval for his efforts to seek national independence. Jeldres , p. 42 While the results showed 42percent approval, ": null
    },
    {
        "Australia": "australia"
    },
    {
        "n historian ": null
    },
    {
        "Milton Osborne": "milton osborne"
    },
    {
        " noted that ": null
    },
    {
        "open balloting": "open ballot system"
    },
    {
        " was carried out and voters were cowed into casting an approval vote under police surveillance. Osborne , p. 42                On 42 March 42 Sihanouk abdicated the throne Jeldres , p. 42 and was in turn succeeded by his father, Suramarit. In his abdication speech, Sihanouk explained that he was abdicating in order to extricate himself from the intrigues of palace life and allow easier access to common folk as an ordinary citizen . According to Osborne, Sihanouks abdication earned him the freedom to pursue politics while continuing to enjoy the deference that he had received from his subjects when he was king. Osborne , p. 42     In April 42 Sihanouk formed his own political party, the ": null
    },
    {
        "Sangkum": "sangkum"
    },
    {
        ", and expressed interest in competing in the ": null
    },
    {
        "general elections": "1955 cambodian general election"
    },
    {
        " slated to be held in September 42 While the Sangkum was, in effect, a political party, Sihanouk argued that the Sangkum should be seen as a political organisation , and explained that he could accommodate people with differing political orientations on the sole condition that they pledged fealty to the monarchy. Osborne , p. 42     Sangkum was based on four small, monarchist, rightist parties, including the Victorious North-East party of ": null
    },
    {
        "Dap Chhuon": "dap chhuon"
    },
    {
        ", the ": null
    },
    {
        "Khmer Renovation": "khmer renovation"
    },
    {
        " party of ": null
    },
    {
        "Lon Nol": "lon nol"
    },
    {
        ", Kiernan, B. How Pol Pot came to power, Yale University Press, 42 p. 42 the Peoples Party Chandler , p. 42 and the Liberal Party. Chandler , p. 42 At the same time, Sihanouk was running out of patience with the increasingly leftist ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        " and the ": null
    },
    {
        "left-wing": "left-wing politics"
    },
    {
        " Pracheachon": "pracheachon"
    },
    {
        ", as both had refused to merge into his party and had campaigned against him. He appointed as director of national security Dap Chhuon, Osborne , p. 42 who ordered the national police to jail their leaders and break up their election rallies. Chandler , p. 42 When elections were held, the Sangkum received 42 percent of all valid votes. They took up all seats in the National Assembly, replacing the Democrats, which had until then been the majority party. Jeldres , p. 42 The following month, Sihanouk was appointed as prime minister. Jeldres , p. 42              Once in office, Sihanouk introduced several constitutional changes, including extending suffrage to women, adopting ": null
    },
    {
        "Khmer": "khmer language"
    },
    {
        " as the sole official language of the country Jeldres , p. 42 and making Cambodia a ": null
    },
    {
        "constitutional monarchy": "constitutional monarchy"
    },
    {
        " by vesting ": null
    },
    {
        "policy-making powers": "executive"
    },
    {
        " in the prime minister rather than the king. Jeldres , p. 42 He viewed socialism as an ideal concept for establishing social equality and fostering national cohesion within newly independent Cambodia. In March 42 he embarked on a national programme of ": null
    },
    {
        "Buddhist socialism": "buddhist socialism"
    },
    {
        " , promoting socialist principles on the one hand while maintaining the kingdoms Buddhist culture on the other. Chandler , p. 42 Between 42 and 42 Sihanouk resigned and retook the post of prime minister several times, citing fatigue caused by overwork. Chandler , p. 42 The National Assembly nominated experienced politicians such as ": null
    },
    {
        "Sim Var": "sim var"
    },
    {
        " and San Yun to become prime minister whenever Sihanouk took leave, but they similarly relinquished their posts each time, several months into their term, Chandler , pp. 42 42 as cabinet ministers repeatedly disagreed over public policy matters. Osborne , p. 42     In May 42 Sihanouk had accepted military aid from the US. Chandler , p. 42 The following January, when he was in the ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        " on a state visit, ": null
    },
    {
        "Central Intelligence Agency": "central intelligence agency"
    },
    {
        " operatives attempted to sway him into placing Cambodia under ": null
    },
    {
        "Southeast Asia Treaty Organization": "southeast asia treaty organization"
    },
    {
        " protection. Burchett , pp. 42–42 Subsequently, Sihanouk began to suspect that the US was attempting to undermine his government and that it was lending covert support to the Democratic party, now without parliamentary representation, for that purpose. Chandler , p. 42 On the other hand, Sihanouk developed a good impression of China, whose premier, ": null
    },
    {
        "Zhou Enlai": "zhou enlai"
    },
    {
        ", gave him a warm reception on his first visit there in February 42 They signed a friendship treaty in which China promised  in economic aid to Cambodia. Osborne , p. 42 When Sihanouk returned from China, ": null
    },
    {
        "Sarit Thanarat": "sarit thanarat"
    },
    {
        " and ": null
    },
    {
        "Ngo Dinh Diem": "ngo dinh diem"
    },
    {
        ", leaders of ": null
    },
    {
        "Thailand": "thailand"
    },
    {
        " and ": null
    },
    {
        "South Vietnam": "south vietnam"
    },
    {
        ", respectively, both with pro-American sympathies, started to accuse him of pro-Communist sympathies. South Vietnam briefly imposed a trade embargo on Cambodia, preventing trading ships from travelling up the ": null
    },
    {
        "Mekong": "mekong"
    },
    {
        " river to ": null
    },
    {
        "Phnom Penh": "phnom penh"
    },
    {
        ". Chandler , p. 42 While Sihanouk professed that he was pursuing a policy of ": null
    },
    {
        "neutrality": "country neutrality"
    },
    {
        ", Sarit and Diem remained distrustful of him, more so after he established formal diplomatic relations with China in 42 Osborne , p. 42     The Democratic party continued to criticize the Sangkum and Sihanouk in their newspaper, much to Sihanouks consternation. Chandler , p. 42 In August 42 Sihanouk finally lost patience, calling out Democrat leaders for a debate. Five of them attended. At the debate, held at the royal palace, Sihanouk spoke in a belligerent tone, challenging the Democrat leaders to present evidence of malfeasance in his government and inviting them to join the Sangkum. The Democrat leaders gave hesitant responses, and, according to American historian ": null
    },
    {
        "David P. Chandler": "david p. chandler"
    },
    {
        ", this gave the audience the impression that they were disloyal to the monarchy. The debate led to the effective demise of the Democratic party, as its leaders were subsequently beaten up by government soldiers, with Sihanouks tacit approval. Chandler , p. 42 With the Democrats vanquished, Sihanouk focused on preparing for ": null
    },
    {
        "general elections": "1958 cambodian general election"
    },
    {
        ", slated to be held in March 42 He drafted left-wing politicians, including ": null
    },
    {
        "Hou Yuon": "hou yuon"
    },
    {
        ", ": null
    },
    {
        "Hu Nim": "hu nim"
    },
    {
        " and ": null
    },
    {
        "Chau Seng": "chau seng"
    },
    {
        ", to stand as Sangkum candidates, with a view to winning left-wing support from the Pracheachon. Chandler , p. 42 The Pracheachon on their part fielded five candidates for the elections. However, four of them withdrew, as they were prevented by the national police from holding any election rallies. When voting took place, the Sangkum won all seats in the national assembly. Chandler , p. 42     In December 42 ": null
    },
    {
        "Ngo Dinh Nhu": "ngo dinh nhu"
    },
    {
        ", Diems younger brother and chief adviser, broached the idea of ": null
    },
    {
        "orchestrating a coup": "bangkok plot"
    },
    {
        " to overthrow Sihanouk. Burchett , p. 42 Nhu contacted ": null
    },
    {
        "Dap Chhuon": "dap chhuon"
    },
    {
        ", Sihanouks ": null
    },
    {
        "Interior Minister": "ministry of interior"
    },
    {
        ", who was known for his pro-American sympathies, to prepare for the coup against his boss. Chandler , p. 42 Chhuon received covert financial and military assistance from Thailand, South Vietnam, and the CIA. Osborne , p. 42 In January 42 Sihanouk learned of the coup plans through intermediaries who were in contact with Chhuon. Burchett , p. 42 The following month, Sihanouk sent the army to capture Chhuon, who was summarily executed as soon as he was captured, effectively ending the coup attempt. Burchett , p. 42 Sihanouk then accused South Vietnam and the United States of orchestrating the coup attempt. Chandler , p. 42 Six months later, on 42 August 42 a small packaged lacquer gift fitted with a ": null
    },
    {
        "parcel bomb": "parcel bomb"
    },
    {
        " was delivered to the royal palace. Norodom Vakrivan, the chief of protocol, was killed instantly when he opened the package. Sihanouks parents, Suramarit and Kossamak, were sitting in another room not far from Vakrivan. An investigation traced the origin of the parcel bomb to an American military base in Saigon. Burchett , p. 42 While Sihanouk publicly accused Ngo Dinh Nhu of masterminding the bomb attack, he secretly suspected that the US was also involved. Osborne , p. 42 The incident deepened his distrust of the US. Chandler , p. 42         Suramarit, Sihanouks father, died on 42 April 42 Osborne , p. 42 after several months of poor health that Sihanouk blamed upon the shock that his father had received from the parcel bomb attack. The following day, the Cambodian Crown Council met to choose Monireth as regent. Jeldres , p. 42 Over the next two months, Sihanouk introduced constitutional amendments to create the new post of Head of State of Cambodia, which provided ceremonial powers equivalent to that of the king. A ": null
    },
    {
        "referendum": "1960 cambodian policy referendum"
    },
    {
        " held on 42 June 42 approved Sihanouks proposals, and Sihanouk was formally appointed Head of State on 42 June 42 Jeldres , p. 42 As the head of state, Sihanouk took over various ceremonial responsibilities of the king, such as holding ": null
    },
    {
        "public audiences": "audience"
    },
    {
        " Osborne , p. 42 and leading the ": null
    },
    {
        "Royal Ploughing Ceremony": "royal ploughing ceremony"
    },
    {
        ". At the same time, he continued to play an active role in politics as Sangkums leader. Osborne , p. 42          In 42 Pracheachons spokesperson, Non Suon, criticized Sihanouk for failing to tackle inflation, unemployment, and corruption in the country. Non Suons criticisms gave Sihanouk the impetus to arrest Pracheachon leaders, and, according to him, he had discovered plans by their party to monitor local political developments on behalf of foreign powers. Chandler , p. 42 In May 42 ": null
    },
    {
        "Tou Samouth": "tou samouth"
    },
    {
        ", Pracheachons secretary-general, disappeared, and its ideological ally, the ": null
    },
    {
        "Communist Party of Kampuchea": "communist party of kampuchea"
    },
    {
        ", suspected that Samouth had been secretly captured and killed by police. Chandler , p. 42 Sihanouk nevertheless allowed Sangkums left-wing politicians to run again in the 42 ": null
    },
    {
        "general elections": "1962 cambodian general election"
    },
    {
        ", which they all won. Osborne , p. 42 He even appointed two left-wing politicians, Hou Yuon and ": null
    },
    {
        "Khieu Samphan": "khieu samphan"
    },
    {
        ", as secretaries for planning and commerce, respectively, after the election. Osborne , p. 42     In November 42 Sihanouk called on the US to stop supporting the ": null
    },
    {
        "Khmer Serei": "khmer serei"
    },
    {
        ", which he believed they had been secretly doing through the CIA. He threatened to reject all economic aid from the US if they failed to respond to his demands, Peou , pp. 42–42 a threat he later carried out on 42 November 42 Burchett , p. 42 At the same time, Sihanouk also ": null
    },
    {
        "nationalised": "nationalization"
    },
    {
        " the countrys ": null
    },
    {
        "entrepot": "entrepot"
    },
    {
        " trade, banking sector, and distillery industries. Osborne , p. 42 To oversee policy and regulatory matters on the countrys entrepot trade, he set up the National Export-Import Corporation and Statutory Board, better known as SONEXIM . Burchett , p. 42 When Sarit, Diem, and US president ": null
    },
    {
        "John F. Kennedy": "john f. kennedy"
    },
    {
        " died in November and December 42 Sihanouk rejoiced over their deaths, as he accused them of attempting to destabilise Cambodia. He organised concerts and granted civil servants extra leave time to celebrate the occasion. When the US government protested Sihanouks celebrations, he responded by recalling the Cambodian ambassador to the US, Nong Kimny. Chandler , pp. 42–42     In early 42 Sihanouk signed a secret agreement with ": null
    },
    {
        "North Vietnam": "north vietnam"
    },
    {
        " and the ": null
    },
    {
        "Viet Cong": "viet cong"
    },
    {
        ", allowing Chinese military aid meant for them to be delivered through ": null
    },
    {
        "Sihanoukvilles port": "sihanoukville autonomous port"
    },
    {
        ". In turn, the ": null
    },
    {
        "Cambodian army": "royal cambodian army"
    },
    {
        " would be paid for delivering food supplies to the Viet Cong, and at the same time skim off 42percent of all military hardware supplies. Chandler , p. 42 In addition, he also allowed the Viet Cong to build a trail through eastern Cambodia, so that their troops could receive war supplies from North Vietnam. The trail later became known as the ": null
    },
    {
        "Sihanouk Trail": "sihanouk trail"
    },
    {
        ". Marlay and Neher , p. 42 When the US learned of Viet Cong presence in eastern Cambodia, they started a bombing campaign, Burchett , p. 42 spurring Sihanouk to sever diplomatic ties with the US in May 42 As a result of this secret agreement, Communist countries, including China, the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", and ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ", provided military aid to Cambodia. Peou , p. 42              In September 42 ": null
    },
    {
        "general elections were held": "1966 cambodian general election"
    },
    {
        ", Osborne , p. 42 and Sangkum legislators with conservative and right-wing sympathies dominated the national assembly. In turn, they nominated ": null
    },
    {
        "Lon Nol": "lon nol"
    },
    {
        ", a military general who shared their political sympathies, as prime minister. However, their choice did not sit well with Sihanouk. Osborne , p. 42 To counterbalance conservative and right-wing influence, in October 42 Sihanouk set up a ": null
    },
    {
        "shadow government": "state within a state"
    },
    {
        " made up of Sangkum legislators with left-wing sympathies. Chandler , p. 42 At the end of the month, Lon Nol offered to resign from his position, but was ironically stopped from doing so by Sihanouk. Osborne , p. 42 In April 42 the ": null
    },
    {
        "Samlaut Uprising": "samlaut uprising"
    },
    {
        " occurred, with local peasants fighting against government troops in Samlaut, ": null
    },
    {
        "Battambang": "battambang province"
    },
    {
        ". Chandler , p. 42 As soon as government troops managed to quell the fighting, Osborne , p. 42 Sihanouk began to suspect that three left-wing Sangkum legislatorsKhieu Samphan, Hou Yuon and Hu Nimhad incited the rebellion. Osborne , p. 42 When Sihanouk threatened to charge Khieu Samphan and Hou Yuon before a military tribunal, they fled into the jungle to join the ": null
    },
    {
        "Khmer Rouge": "khmer rouge"
    },
    {
        ", leaving Hu Nim behind. Chandler , p. 42     Lon Nol resigned as prime minister in early May 42 and Sihanouk appointed ": null
    },
    {
        "Son Sann": "son sann"
    },
    {
        " in his place. At the same time, Sihanouk replaced conservative-leaning ministers appointed by Lon Nol with ": null
    },
    {
        "technocrats": "technocrats"
    },
    {
        " and left-leaning politicians. In the later part of the month, after receiving news that the Chinese embassy in Cambodia had published and distributed Communist propaganda to the Cambodian populace praising the ": null
    },
    {
        "Cultural Revolution": "cultural revolution"
    },
    {
        ", Cohen , p. 42 Sihanouk accused China of supporting local ": null
    },
    {
        "Chinese Cambodian": "chinese cambodian"
    },
    {
        "s in engaging in contraband and subversive activities. Cohen , p. 42 In August 42 Sihanouk sent to China his Foreign Minister, ": null
    },
    {
        "Norodom Phurissara": "norodom phurissara"
    },
    {
        ", who unsuccessfully urged Zhou to stop the Chinese embassy from disseminating Communist propaganda. Cohen , p. 42 In response, Sihanouk closed the CambodiaChinese Friendship Association in September 42 When the Chinese government protested, Cohen , p. 42 Sihanouk threatened to close the Chinese embassy in Cambodia. Cohen , p. 42 Zhou stepped in to placate Sihanouk, Cohen , p. 42 and compromised by instructing its embassy to send its publications to Cambodias ": null
    },
    {
        "information ministry": "ministry of information"
    },
    {
        " for vetting prior to distribution.     As relations with China worsened, Sihanouk pursued ": null
    },
    {
        "rapprochement": "rapprochement"
    },
    {
        " with the US. He learned that Kennedys widow, ": null
    },
    {
        "Jacqueline Kennedy": "jacqueline kennedy"
    },
    {
        ", had expressed a desire to see ": null
    },
    {
        "Angkor Wat": "angkor wat"
    },
    {
        ". Seeing this as an opportunity to restore relations with the US, Sihanouk invited her to visit Cambodia and personally hosted her visit in October 42 Marlay and Neher , p. 42 Jacqueline Kennedys visit paved the way for Sihanouk to meet with ": null
    },
    {
        "Chester Bowles": "chester bowles"
    },
    {
        ", the US ambassador to India. To Bowles, Sihanouk expressed his willingness to restore bilateral relations with the US, hinted at the presence of Viet Cong troops in Cambodia, and suggested he would turn a blind eye should US forces enter Cambodia to attack Viet Cong troops retreating into Cambodia from South Vietnam—a practice known as hot pursuit —provided that Cambodians were unharmed. Osborne , p. 42  Kenton Clymer notes that this statement cannot reasonably be construed to mean that Sihanouk approved of the intensive, ongoing ": null
    },
    {
        "B42": "boeing b-52 stratofortress"
    },
    {
        " bombing raids the US launched in eastern Cambodia beginning in March 42 as part of ": null
    },
    {
        "Operation Menu": "operation menu"
    },
    {
        ", adding: In any event, no one asked him.  ... Sihanouk was never asked to approve the B42 bombings, and he never gave his approval.  The bombing forced the Viet Cong to flee from their jungle sanctuaries and seek refuge in populated towns and villages. Chandler , p. 42 As a result, Sihanouk became concerned that Cambodia might get drawn into fighting in the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ". In June 42 he extended diplomatic recognition to the ": null
    },
    {
        "Provisional Revolutionary Government of the Republic of South Vietnam": "provisional revolutionary government of the republic of south vietnam"
    },
    {
        " , Burchett , p. 42 hoping that he could get the Viet Cong troops under its charge to leave Cambodia should they win the war. At the same time, he also openly admitted the presence of Viet Cong troops in Cambodia for the first time, Chandler , p. 42 prompting the US to restore formal diplomatic relations with Cambodia three months later. Chandler , p. 42     As the Cambodian economy was stagnating due to systemic corruption, Osborne , p. 42 Sihanouk opened two casinosin Phnom Penh and Sihanoukvillein January 42 Chandler , p. 42 While the casinos satisfied his aim of generating state revenues of up to 42 million riels in that year, it also caused a sharp increase in the number of bankruptcies and suicides. In August 42 Lon Nol was reappointed as Prime Minister, with ": null
    },
    {
        "Sisowath Sirik Matak": "sisowath sirik matak"
    },
    {
        " as his deputy. Two months later, Lon Nol left Cambodia to seek medical treatment, leaving Sirik Matak to run the government. Between October and December 42 Sirik Matak instituted several policy changes that ran contrary to Sihanouks wishes, such as allowing private banks to re-open in the country and devaluing the riel. He also encouraged ambassadors to write to Lon Nol directly, instead of going through Sihanouk, angering the latter. Chandler , p. 42 In early January 42 Sihanouk left Cambodia for medical treatment in France. Jeldres , p. 42 Shortly after he left, Sirik Matak took the opportunity to close down the casinos. Marlay and Neher , p. 42            On 42 March 42 a large protest took place outside the North Vietnamese and PRGSV embassies, as protesters demanded Viet Cong troops withdraw from Cambodia. The protests turned chaotic, as protesters looted both embassies and set them on fire, alarming Sihanouk. Osborne , p. 42 Sihanouk, who was in Paris at the time, considered both returning to quell the protests and visiting Moscow, Beijing, and Hanoi. He opted for the latter, thinking that he could persuade its leaders to recall Viet Cong troops to their jungle sanctuaries, where they had originally established themselves between 42 and 42 Chandler , p. 42 Five days later, Oum Mannorine, the half-brother of Sihanouks wife Monique, was summoned to the National Assembly to answer corruption charges. Osborne , p. 42 On that night after the hearing, Mannorine ordered troops under his command to arrest Lon Nol and Sirik Matak, but ended up getting arrested by Lon Nols troops instead. On 42 March 42 the National Assembly voted to depose Sihanouk, Burchett , p. 42 allowing Lon Nol to assume ": null
    },
    {
        "emergency powers": "state of emergency"
    },
    {
        ". Burchett , p. 42          On that day, Sihanouk was in Moscow meeting Soviet foreign minister ": null
    },
    {
        "Alexei Kosygin": "alexei kosygin"
    },
    {
        ", who broke the news to him. Jeldres , p. 42 From Moscow, Sihanouk flew to Beijing, where he was received by Zhou. Zhou arranged for the North Vietnamese Prime Minister, ": null
    },
    {
        "Pham Van Dong": "pham van dong"
    },
    {
        " to fly to Beijing from Hanoi and meet with Sihanouk. Osborne , p. 42 Both Zhou and Dong encouraged Sihanouk to rebel against Lon Nol and promised him military and financial support. On 42 March 42 Sihanouk announced the formation of his resistance movement, the ": null
    },
    {
        "National United Front of Kampuchea": "national united front of kampuchea"
    },
    {
        " . He encouraged the Cambodian populace to join him and fight against Lon Nols government. Khmer Rouge soldiers broadcast Sihanouks message in the Cambodian countryside, which roused demonstrations rooting for his cause that were brutally suppressed by Lon Nols troops. Osborne , p. 42 Sometime later, on 42 May 42 Sihanouk announced the formation of a government-in-exile known as the Royal Government of the National Union of Kampuchea , leading Communist countries including China, North Vietnam, and ": null
    },
    {
        "North Korea": "north korea"
    },
    {
        " to break relations with the Lon Nol regime. Jeldres , p. 42 In Phnom Penh, a military trial convened on 42 July 42 whereby Sihanouk was charged with treason and corruption in his capacity as Head of State. After a three-day trial, the judges ruled Sihanouk guilty of both charges and sentenced to him death in absentia on 42 July 42 Burchett , p. 42        Between 42 and 42 Sihanouk took up residence in state guesthouses at Beijing and ": null
    },
    {
        "Pyongyang": "pyongyang"
    },
    {
        ", courtesy of the Chinese and North Korean governments, respectively. Marlay and Neher , p. 42 In February 42 Sihanouk traveled to ": null
    },
    {
        "Hanoi": "hanoi"
    },
    {
        ", where he started on a long journey with Khieu Samphan and other Khmer Rouge leaders. The convoy proceeded along the ": null
    },
    {
        "Ho Chi Minh trail": "ho chi minh trail"
    },
    {
        " and reached the Cambodian border at ": null
    },
    {
        "Stung Treng Province": "stung treng province"
    },
    {
        " the following month. From there, they traveled across the provinces of ": null
    },
    {
        "Stung Treng": "stung treng province"
    },
    {
        ", ": null
    },
    {
        "Preah Vihear": "preah vihear province"
    },
    {
        ", and ": null
    },
    {
        "Siem Reap": "siem reap province"
    },
    {
        ". Throughout this entire leg of the journey, Sihanouk faced constant bombardment from American planes participating in ": null
    },
    {
        "Operation Freedom Deal": "operation freedom deal"
    },
    {
        ". Jeldres , p. 42 At Siem Reap, Sihanouk visited the temples of ": null
    },
    {
        "Angkor Wat": "angkor wat"
    },
    {
        ", ": null
    },
    {
        "Banteay Srei": "banteay srei"
    },
    {
        ", and ": null
    },
    {
        "Bayon": "bayon"
    },
    {
        ". Jeldres , p. 42 In August 42 Sirik Matak wrote an open letter calling on Sihanouk to bring the ": null
    },
    {
        "Cambodian Civil War": "cambodian civil war"
    },
    {
        " to an end and suggesting the possibility of his return to the country. When the letter reached Sihanouk, he angrily rejected Sirik Mataks entreaties. Osborne , p. 42     After the ": null
    },
    {
        "Khmer Republic fell to the Khmer Rouge": "fall of phnom penh"
    },
    {
        " on 42 April 42 a new regime under its charge, ": null
    },
    {
        "Democratic Kampuchea": "democratic kampuchea"
    },
    {
        ", was formed. Sihanouk was appointed as its Head of State, a ceremonial position.  In September 42 Osborne , p. 42 Sihanouk briefly returned to Cambodia to inter the ashes of his mother, Marlay and Neher , p. 42 before going abroad again to lobby for diplomatic recognition of Democratic Kampuchea. Jeldres , p. 42 He returned on 42 December 42 and presided over a meeting to endorse the constitution of Democratic Kampuchea. Osborne , p. 42 In February 42 Khieu Samphan took him on a tour across the Cambodian countryside. Sihanouk was shocked to see the use of ": null
    },
    {
        "forced labour": "forced labour"
    },
    {
        " and population displacement carried out by the Khmer Rouge government, known as the ": null
    },
    {
        "Angkar": "communist party of kampucheathe angkar"
    },
    {
        ". Following the tour, Sihanouk decided to resign as the Head of State. Osborne , p. 42 The Angkar initially rejected his resignation request, though they subsequently accepted it in mid-April 42 retroactively backdating it to 42 April 42 Osborne , p. 42     From this point onwards Sihanouk was kept under house arrest at the royal palace. In September 42 he was removed to another apartment in Phnom Penhs suburbs, where he lived until the end of the year. Osborne , p. 42 Throughout his confinement, Sihanouk made several unsuccessful requests to the Angkar to travel overseas. Osborne , p. 42 Vietnam invaded Cambodia on 42 December 42 On 42 January 42 Sihanouk was taken from Phnom Penh to ": null
    },
    {
        "Sisophon": "sisophon"
    },
    {
        ", where he stayed for three days until 42 January, when he was taken back to Phnom Penh. Osborne , p. 42 Sihanouk was taken to meet ": null
    },
    {
        "Pol Pot": "pol pot"
    },
    {
        ", who briefed him on the Angkars plans to repulse Vietnamese troops. Chandler , p. 42 On 42 January 42 Sihanouk was allowed to fly to Beijing from Phnom Penh, where he was greeted by Zhou Enlais successor, Deng Xiaoping. Osborne , p. 42 The next day Phnom Penh fell to advancing Vietnamese troops on 42 January 42 On 42 January 42 Sihanouk flew from Beijing to New York to attend the ": null
    },
    {
        "UN Security Council": "un security council"
    },
    {
        ", where he simultaneously condemned the Khmer Rouge for orchestrating the Cambodian genocide as well as the ": null
    },
    {
        "Vietnamese occupation of Cambodia": "cambodian–vietnamese war"
    },
    {
        ". Jeldres , p. 42 Sihanouk subsequently sought asylum in China after making two unsuccessful asylum applications with the US and France. Jeldres , pp. 42–42              After the Khmer Rouge regime was overthrown, a new Cambodian government supported by ": null
    },
    {
        "Vietnam": "vietnam"
    },
    {
        ", the ": null
    },
    {
        "Peoples Republic of Kampuchea": "peoples republic of kampuchea"
    },
    {
        " , was established. The Chinese ": null
    },
    {
        "leader": "paramount leader"
    },
    {
        ", ": null
    },
    {
        "Deng Xiaoping": "deng xiaoping"
    },
    {
        ", was unhappy Jeldres , p. 42 with Vietnams influence over the PRK government. Deng proposed to Sihanouk that he co-operate with the Khmer Rouge to overthrow the PRK government, but the latter rejected it, Jeldres , pp. 42–42 as he opposed the ": null
    },
    {
        "genocidal policies": "cambodian genocide"
    },
    {
        " pursued by the Khmer Rouge while they were in power. In March 42 Sihanouk established a resistance movement, ": null
    },
    {
        "FUNCINPEC": "funcinpec"
    },
    {
        " which was complemented by a small resistance army known as  . Jeldres , p. 42 He appointed ": null
    },
    {
        "In Tam": "in tam"
    },
    {
        ", who had briefly served as Prime Minister in the Khmer Republic, as the commander-in-chief of ANS. Mehta , p. 42 The ANS needed military aid from China, and Deng seized the opportunity to sway Sihanouk into collaborating with the Khmer Rouge. Osborne , p. 42 Sihanouk reluctantly agreed, and started talks in March 42 with the Khmer Rouge and the ": null
    },
    {
        "Son Sann": "son sann"
    },
    {
        "-led ": null
    },
    {
        "Khmer Peoples National Liberation Front": "khmer peoples national liberation front"
    },
    {
        " on a unified anti-PRK resistance movement. Jeldres , p. 42     After several rounds of negotiations mediated by Deng and Singapores prime minister ": null
    },
    {
        "Lee Kuan Yew": "lee kuan yew"
    },
    {
        ", Jeldres , p. 42 FUNCINPEC, KPNLF, and the Khmer Rouge agreed to form the Coalition Government of Democratic Kampuchea in June 42 The CGDK was headed by Sihanouk, and functioned as a government-in-exile. Jeldres , p. 42 The UN defeated a resolution to expel Democratic Kampuchea and admit the PRK, effectively confirming Sihanouk as Cambodias internationally recognized head of state. Carney, Timothy. Kampuchea in 42: Political and Military Escalation. p. 42 In Asian Survey, 42:42 42     As CGDK chairperson, Sihanouk unsuccessfully negotiated, over the next five years, with the Chinese government to broker a political settlement to end the Vietnamese occupation of Cambodia. Osborne , p. 42 During this period, Sihanouk appointed two of his sons, ": null
    },
    {
        "Norodom Chakrapong": "norodom chakrapong"
    },
    {
        " and Norodom Ranariddh, to lead the ANS. Chakrapong was appointed as the deputy chief-of-staff for the ANS in March 42 Mehta , p. 42 while Ranariddh was minted to the twin positions of commander-in-chief and the chief-of-staff of the ANS in January 42 replacing Tam. Mehta , p. 42 In December 42 the Prime Minister of the PRK government, ": null
    },
    {
        "Hun Sen": "hun sen"
    },
    {
        ", first met with Sihanouk to discuss ending the protracted Cambodian–Vietnamese War. Mehta et al. , pp. 42–42 The following July, the then-foreign minister of ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        ", ": null
    },
    {
        "Ali Alatas": "ali alatas"
    },
    {
        ", brokered the first round of meetings between the four warring Cambodian factions consisting of FUNCINPEC, Khmer Rouge, KPNLF, and the PRK government over the future of Cambodia. Two more rounds of meetings were held in February and May 42; since all were held near Jakarta, they became known as the Jakarta Informal Meetings . Widyono , p. 42     In July 42 Ali Alatas joined French foreign minister ": null
    },
    {
        "Roland Dumas": "roland dumas"
    },
    {
        " in opening the Paris Peace Conference, where discussions took place regarding plans for Vietnamese troop withdrawal and power-sharing arrangements in a hypothetical future Cambodian government. The following month, Sihanouk resigned as president of FUNCINPEC  but remained in the party as an ordinary member. Findlay , p. 42 In September 42 the United Nations sponsored the establishment of the Supreme National Council of Cambodia , an administrative body responsible for overseeing the sovereign affairs of Cambodia for an interim period until UN-sponsored elections were held. Osborne , p. 42 The creation of the SNC was subsequently ratified with ": null
    },
    {
        "United Nations Security Council Resolution 42": "united nations security council resolution 668"
    },
    {
        ". Findlay , p. 42 In July 42 Sihanouk left FUNCINPEC altogether and was elected as the chairperson of the SNC. Findlay , p. 42         On 42 October 42 Sihanouk led the FUNCINPEC, Khmer Rouge, KPNLF, and PRK into signing the Paris Peace Accords. The accords recognised the SNC as a legitimate representative of Cambodian sovereignty and created the United Nations Transitional Authority in Cambodia to serve as a transitional government between 42 and 42 Findlay , p. 42 In turn, UNTAC was given the mandate to station peacekeeping troops in Cambodia to supervise the disarmament of troops from the four warring Cambodian factions and to carry out national elections by 42 Findlay , p. 42 Sihanouk subsequently returned to Phnom Penh on 42 November 42 Together with Hun Sen, Sihanouk rode in an open top limousine from ": null
    },
    {
        "Pochentong Airport": "pochentong airport"
    },
    {
        " all the way to the royal palace, greeting city residents who lined the streets to welcome his return. Widyono , p. 42 The UNTAC administration was set up in February 42 but stumbled in its peacekeeping operations as the Khmer Rouge refused to cooperate in disarmament. Widyono , pp. 42–42 In response, Sihanouk urged UNTAC to abandon the Khmer Rouge from the peacekeeping process on two occasions, in July and September 42 During this period, Sihanouk mostly resided in Siem Reap and occasionally traveled by helicopter to supervise election preparations in KPNLF, FUNCINPEC, and Khmer Rouge resistance bases. Widyono , p. 42     Sihanouk left in November 42 to seek medical treatment in Beijing, Findlay , p. 42 where he stayed for the next six months until his return to Cambodia in May 42 on the eve of elections. Findlay , p. 42 While in Beijing, Sihanouk proposed a ": null
    },
    {
        "Presidential system": "presidential system"
    },
    {
        " government for Cambodia to ": null
    },
    {
        "then-UN secretary-general": "secretary-general of the united nations"
    },
    {
        " Boutros Boutros-Ghali": "boutros boutros-ghali"
    },
    {
        ", but soon dropped the idea after facing opposition from the Khmer Rouge. Findlay , pp. 42–42 When general elections were held, FUNCINPEC, now headed by Sihanouks son ": null
    },
    {
        "Norodom Ranariddh": "norodom ranariddh"
    },
    {
        ", won, while the Cambodian Peoples Party headed by Hun Sen came in second. Findlay , pp. 42 42 The CPP was unhappy with the election results, and on 42 June 42 Hun Sen and ": null
    },
    {
        "Chea Sim": "chea sim"
    },
    {
        " called on Sihanouk to lead the government. Sihanouk complied, and announced the formation of a Provisional National Government headed by him, with Hun Sen and Ranariddh as his deputies. Widyono , p. 42 Ranariddh was surprised at Sihanouks announcement, as he had not been informed of his fathers plans, and joined Australia, China, the United Kingdom, and the United States in opposing the plan. The following day, Sihanouk rescinded his announcement through a national radio broadcast. Widyono , p. 42     On 42 June 42 Sihanouk was reinstated as the head of state in a ": null
    },
    {
        "constituent assembly": "cambodia constituent assembly"
    },
    {
        " session presided over by Ranariddh, who took the opportunity to declare the 42  coup détat  which overthrew Sihanouk as illegal . Findlay , p. 42 As Head of State, Sihanouk renamed the Cambodian military to its pre42 namesake, the ": null
    },
    {
        "Royal Cambodian Armed Forces": "royal cambodian armed forces"
    },
    {
        ". He also issued orders to officially rename the country from the ": null
    },
    {
        "State of Cambodia": "peoples republic of kampucheatransition"
    },
    {
        " to simply Cambodia , reinstating ": null
    },
    {
        "Nokor Reach": "nokor reach"
    },
    {
        " as the National Anthem of Cambodia with some minor modifications to its lyrics, and the ": null
    },
    {
        "Cambodian flag": "flag of cambodia"
    },
    {
        " to its pre42 design. Mehta et al. , p. 42 At the same time, Sihanouk appointed Ranariddh and Hun Sen co-prime ministers, with equal powers. Widyono , p. 42 This arrangement, which was provisional, was ratified by the Constituent Assembly on 42 July 42 On 42 August 42 Osborne , p. 42 Ranariddh and Hun Sen met with Sihanouk and presented two draft constitutions, one of them stipulating a constitutional monarchy headed by a king, and another a republic led by a head of state. Sihanouk opted for the draft stipulating Cambodia a constitutional monarchy, Widyono , p. 42 which was ratified by the constituent assembly on 42 September 42 Findlay , p. 42         The new constitution came into force on 42 September 42 and Sihanouk was reinstated as the King of Cambodia. Jeldres , p. 42 A permanent coalition government was formed between FUNCINPEC, CPP and a third political party, the ": null
    },
    {
        "Buddhist Liberal Democratic Party": "buddhist liberal democratic party"
    },
    {
        " . In turn, Sihanouk made Ranariddh and Hun Sen First and Second Prime Ministers, respectively. Widyono , pp. 42–42 Shortly after that, Sihanouk left for Beijing, where he spent several months for cancer treatment. Mehta et al. , p. 42 In April 42 Sihanouk returned Peou , p. 42 and the following month called the government to hold new elections so that the Khmer Rouge could be co-opted into the government. Both Ranariddh and Hun Sen rejected his suggestion, Peou , p. 42 Mehta et al. , p. 42 but Sihanouk pressed on, and further proposed a national unity government consisting of FUNCINPEC, CPP, and the Khmer Rouge headed by him. Widyono , p. 42 Again, both prime ministers rejected Sihanouks proposal, arguing that Khmer Rouges past intransigent attitude made the proposal unrealistic. Peou , p. 42 Widyono , p. 42 Sihanouk backed down, and expressed frustration that Hun Sen and Ranariddh had been ignoring him. As both Norodom Sirivudh Peou , p. 42 and Julio Jeldres, his younger half-brother and official biographer, respectively, saw it, this was a clear sign that the monarchys ability to exert control over national affairs had diminished, at least vis-a-vis the prime ministers. Peou , p. 42          In July 42 one of his sons, ": null
    },
    {
        "Norodom Chakrapong": "norodom chakrapong"
    },
    {
        ", led a failed coup attempt to topple the government. Mehta et al. , p. 42 Following the coup attempt, Chakrapong took refuge in a hotel in Phnom Penh, but government troops soon discovered his hideout and surrounded the hotel. Chakrapong called Sihanouk, who negotiated with government representatives to allow him to go into ": null
    },
    {
        "exile": "exile"
    },
    {
        " in ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        ".  The following November, Sirivudh was accused of plotting to assassinate Hun Sen and imprisoned. Sihanouk intervened to have Sirivudh detained at the interior ministrys headquarters, convinced that there was a secret plan to kill the latter if he were to remain in prison. Widyono , p. 42 After Sirivudh was relocated to the safer location, Sihanouk appealed to Hun Sen that Sirivudh be allowed to go into exile in France together with his family. Subsequently, Hun Sen accepted his offer. Widyono , p. 42     Relations between the two co-prime ministers, Ranariddh and Hun Sen, deteriorated from March 42 Widyono , p. 42 when the former accused the CPP of repeatedly delaying the allocation process of ": null
    },
    {
        "low-level government": "local government"
    },
    {
        " posts to FUNCINPECs. Widyono , p. 42 Ranariddh threatened to pull out of the coalition government Mehta et al. , p. 42 and hold national elections in the same year if his demands were not met, Widyono , p. 42 stoking unease among Hun Sen and other CPP officials. The following month, Sihanouk presided over a meeting between several royal family members and senior FUNCINPEC officials in Paris. Sihanouk attempted to reduce tensions between FUNCINPEC and the CPP by assuring that FUNCINPEC would not leave the coalition government and that there were no reactionary elements planning to bring down Hun Sen or the CPP. Widyono , p. 42 In March 42 Sihanouk expressed his willingness to abdicate the throne, claiming that rising anti-royalist sentiment among the populace was threatening the monarchys existence. Widyono , p. 42 In response, Hun Sen tersely warned Sihanouk that he would introduce constitutional amendments to prohibit members of the royal family from participating in politics if he followed through on his suggestion.  As Widyono saw it, Sihanouk remained popular with the Cambodian electorate, and Hun Sen feared that, should he abdicate and enter politics, he would win in any future elections, thereby undercutting CPPs political clout.     In ": null
    },
    {
        "July 42 violent clashes": "1997 clashes in cambodia"
    },
    {
        " erupted in Phnom Penh between infantry forces separately allied to the CPP and FUNCINPEC, which effectively led to Ranariddhs ousting after FUNCINPEC forces were defeated. Widyono , p. 42 Sihanouk voiced displeasure with Hun Sen for orchestrating the clashes, but refrained from calling Ranariddhs ouster a ": null
    },
    {
        "coup détat": "coup détat"
    },
    {
        " , a term which FUNCINPEC members used. Widyono , p. 42 When the National Assembly elected ": null
    },
    {
        "Ung Huot": "ung huot"
    },
    {
        " as the First Prime Minister to replace Ranariddh on 42 August 42 Widyono , p. 42 Sihanouk charged that Ranariddhs ouster was illegal and renewed his offer to abdicate the throne, a plan which did not materialize.  In September 42 Sihanouk meditated political talks in ": null
    },
    {
        "Siem Reap": "siem reap"
    },
    {
        " after the FUNCINPEC and the ": null
    },
    {
        "Sam Rainsy Party": "sam rainsy party"
    },
    {
        " staged protests against the CPP-led government for irregularities over the ": null
    },
    {
        "42 general elections": "1998 cambodian general election"
    },
    {
        ". The talks broke down at the end of the month after Hun Sen narrowly escaped an assassination attempt, which he accused Sam Rainsy of masterminding. Summers , p. 42 Two months later, in November 42 Sihanouk brokered a second round of political talks between the CPP and FUNCINPEC  whereby an agreement was reached for another coalition government between the CPP and FUNCINPEC.     Sihanouk maintained a monthly bulletin in which he wrote commentaries on political issues and posted old photos of Cambodia in the 42s and 42s. In 42 a character known by the name of Ruom Rith first appeared in his monthly bulletin, expressing critical comments on Hun Sen and the government. Hun Sen became offended by Ruom Riths criticisms, and on at least two occasions in 42 and 42 persuaded Sihanouk to stop publishing his comments. Widyono , pp. 42–42  According to Ranariddh, Ruom Rith was an alter ego of Sihanouk, a claim which the latter vehemently denied. Mehta et al. , p. 42 In July 42 Sihanouk expressed concern over the absence of detailed constitutional provisions over the organization and functioning of the ": null
    },
    {
        "Cambodian throne council": "royal council of the throne"
    },
    {
        ".  When Hun Sen rejected Sihanouks concern, the latter followed up in September 42 by threatening to abdicate, so as to force the throne council to convene and elect a new monarch.      In July 42 ": null
    },
    {
        "general elections": "2003 cambodian general election"
    },
    {
        " were held again, and the CPP won. However, they failed to secure ": null
    },
    {
        "two-thirds": "two-thirds vote"
    },
    {
        " of all parliamentary seats, as required by the constitution to form a new government. The two runner-up parties of the election, FUNCINPEC and SRP, blocked the CPP from doing so. Chin , p. 42 Instead, in August 42 they filed complaints with the Constitutional Council over alleged electoral irregularities.  After their complaints were rejected, FUNCINPEC and SRP threatened to boycott the swearing-in ceremony of parliamentarians. Sihanouk coaxed both parties to change their decision, stating that he would abstain from presiding over the ceremony as well if they did not comply with his wishes.  Both parties eventually backed off from their threats, and the swearing-in ceremony was held in October 42 with Sihanouk in attendance.  The CPP, FUNCINPEC, and SRP held additional talks into 42 to break the political stalemate, but to no avail. At the same time, Sihanouk proposed a unity government jointly led by politicians from all three political parties, which Hun Sen and Ranariddh both rebuffed. Chin , pp. 42 42 Widyono , p. 42         On 42 July 42 in an open letter, Sihanouk announced his plans to abdicate once again. At the same time, he criticised Hun Sen and Ranariddh for ignoring his suggestions on how to resolve the political stalemate of the past year. Meanwhile, Hun Sen and Ranariddh had agreed to introduce a constitutional amendment that provided for an open voting system, requiring parliamentarians to select cabinet ministers and the president of the National Assembly by a show of hands. Sihanouk disapproved of the open voting system, calling upon Senate President ": null
    },
    {
        "Chea Sim": "chea sim"
    },
    {
        " not to sign the amendment. When Chea Sim heeded Sihanouks advice, he was ferried out of the country shortly before the National Assembly convened to vote on the amendment on 42 July. Chin , pp. 42–42 On 42 July 42 the CPP and FUNCINPEC agreed to form a coalition government, leaving SRP out as an ": null
    },
    {
        "opposition party": "opposition"
    },
    {
        ". Widyono , p. 42 On 42 October 42 Sihanouk wrote a letter calling for the throne council to convene and select a successor. The National Assembly and Senate both held emergency meetings to pass laws allowing for the abdication of the monarch. On 42 October 42 the throne council unanimously voted to select Norodom Sihamoni as Sihanouks successor.  Sihamoni was crowned as the King of Cambodia on 42 October 42      In March 42 Sihanouk accused Thailand, Laos, and Vietnam of encroaching into Cambodian territory, through unilateral border demarcation exercises without Cambodian participation. Two months later, Sihanouk formed the Supreme National Council on Border Affairs , which he headed, to address these concerns. While the SRP and Chea Sim expressed support for Sihanouk for the formation of the SNCBA, Hun Sen decided to form a separate body, National Authority on Border Affairs , to deal with border concerns, with SNCBA to serve only as an advisory body.  After Hun Sen signed a border treaty with Vietnam in October 42 Sihanouk dissolved the SNCBA.  In August 42 the Cambodian Action Committee for Justice and Equity, a US-based human rights ": null
    },
    {
        "NGO": "non-governmental organization"
    },
    {
        ", called for Sihanouks ": null
    },
    {
        "State immunity": "state immunity"
    },
    {
        " to be lifted, so as to allow him to testify in the ": null
    },
    {
        "Extraordinary Chambers in the Courts of Cambodia": "extraordinary chambers in the courts of cambodia"
    },
    {
        " .  Sihanouk responded to the call by inviting the ECCC public affairs officer, Peter Foster, for a discussion session on his personal experience under the Khmer Rouge regime.  Both Hun Sen and FUNCINPEC criticized the suggestion, with the latter accusing the NGO of being disrespectful. The ECCC subsequently rejected Sihanouks invitation.      The following year, bilateral relations between Thailand and Cambodia became strained due to ": null
    },
    {
        "overlapping claims": "cambodian–thai border dispute"
    },
    {
        " on the land area surrounding Preah Vihear Temple. Sihanouk issued a communiqué in July 42 emphasising the ": null
    },
    {
        "Khmer architecture": "khmer architecture"
    },
    {
        " of the temple as well as ": null
    },
    {
        "ICJ": "icj"
    },
    {
        "s 42 ruling of the temple in favour of Cambodia.  In August 42 Sihanouk stated that he would stop posting messages on his personal website as he was getting old, making it difficult for him to keep up with his personal duties.  Between 42 and 42 Sihanouk spent most of his time in Beijing for medical care. He made a final public appearance in Phnom Penh on his 42th birthday and 42th anniversary of the Paris Peace Accords on 42 October 42 Thereafter, Sihanouk expressed his intent to stay in Cambodia indefinitely,  but returned to Beijing in January 42 for further medical treatment at the advice of his Chinese doctors.             In January 42 Sihanouk issued a letter to express his wish to be cremated after his death, and for his ashes to be interred in a golden urn.  A few months later, in September 42 Sihanouk said that he would not return to Cambodia from Beijing for his 42th birthday, citing fatigue.  On 42 October 42 Sihanouk died of a heart attack at 42:42am, Phnom Penh time.  When the news broke, Sihamoni, Hun Sen, and other government officials flew to Beijing to pay their last respects.  The Cambodian government announced an official mourning period of seven days between 42 and 42 October 42 and state flags were ordered to fly at one-third height. Two days later, Sihanouks body was brought back from Beijing on an ": null
    },
    {
        "Air China": "air china"
    },
    {
        " flight,  and about 42million people lined the streets from the airport to the royal palace to witness the return of Sihanouks cortège.      In late November 42 Hun Sen said that Sihanouks funeral and cremation were to be carried out in February 42 Sihanouks body ": null
    },
    {
        "lay in state": "lying in state"
    },
    {
        " at the royal palace for  the next three months until the funeral was held on 42 February 42  A  street procession was held, and Sihanouks body was subsequently kept at the royal crematorium until 42 February 42 when his body was cremated.  The following day, the royal family scattered some of Sihanouks ashes into the ": null
    },
    {
        "Tonle Sap": "tonle sap"
    },
    {
        " river, while the rest were kept in the palaces throne hall for about a year.  In October 42 a stupa featuring a ": null
    },
    {
        "bronze statue": "norodom sihanouk memorial"
    },
    {
        " of Sihanouk was inaugurated next to the ": null
    },
    {
        "Independence Monument": "independence monument"
    },
    {
        ".  In July 42 Sihanouks ashes were interred at the ": null
    },
    {
        "silver pagoda": "silver pagoda, phnom penh"
    },
    {
        " next to those of one of his daughters, Kantha Bopha.                 Sihanouk produced about 42 films throughout his lifetime.  He developed an interest in the cinema at a young age, which he attributed to frequent trips to the cinema with his parents. Shortly after becoming king in 42 Sihanouk made a few amateur films, Kinetz et al. , p. 42 and sent Cambodian students to study film-making in France. Baumgärtel , p. 42 When the film  Lord Jim  was released in 42 Sihanouk was vexed with the negative portrayal it gave of Cambodia. Osborne , p. 42 In response, Sihanouk produced his first feature film, Apsara, in 42 He went on to produce, direct, and act in eight more films between 42 and 42 roping in members of the royal family and military generals to star in his films. Osborne , p. 42 Sihanouk expressed that his films were created with the intent of portraying Cambodia in a positive light; Osborne , p. 42 Milton Osborne also noted that the films were filled with ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " Osborne , p. 42 and nationalist propaganda themes. Osborne , p. 42 Sihanouks former adviser, Charles Meyer, said that his films created from the 42s were of amateur standard, while the director of ": null
    },
    {
        "Reyum Institute": "reyum institute of arts and culture"
    },
    {
        ", Ly Daravuth, similarly commented in 42 that his films lacked artistic qualities.     In 42 one of his films, The Enchanted Forest, was nominated at the ": null
    },
    {
        "42th Moscow International Film Festival": "5th moscow international film festival"
    },
    {
        ". Marlay and Neher , p. 42 In 42 Sihanouk launched the Phnom Penh International Film Festival, which was held for a second time in 42 In both years, a special award category was designated, the Golden Apsara Prize, of which Sihanouk was its only nominee and winner. After Sihanouk was ousted in 42 he ceased producing films for the next seventeen years until 42 Wemaere , pp. 42 42 In 42 Sihanouk received a special jury prize from the ": null
    },
    {
        "International Film Festival of Moscow": "20th moscow international film festival"
    },
    {
        ", where he revealed that he had received a budget ranging from  to  for each of his film productions from the Cambodian government. Six years later, Sihanouk donated his film archives to the ": null
    },
    {
        "École française dExtrême-Orient": "école française dextrême-orient"
    },
    {
        " in France and ": null
    },
    {
        "Monash University": "monash university"
    },
    {
        " in Australia. In 42 he produced his last film, Miss Asina, and then declared his retirement from film-making in May 42 Baumgärtel , p. 42         Sihanouk wrote at least 42 musical compositions between the late 42s and the early 42s, Scott-Maxwell , p. 42 combining both traditional Khmer and Western themes into his works. Scott-Maxwell , p. 42 From the 42s until the 42s, Sihanouks compositions were mostly based on sentimental, romantic and patriotic themes. Sihanouks romantic songs reflected his numerous romantic liaisons, particularly his relationship with his wife Monique, Scott-Maxwell , p. 42 and compositions such as My Darling and Monica were dedicated to her. He also wrote nationalistic songs, meant to showcase the beauty of provincial towns and at the same time foster a sense of patriotism and national unity among Cambodians. Notable compositions, such as Flower of Battambang , Beauty of Kep City , Phnom Kulen , and Phnom Penh , are examples of these. A few of his other compositions, including ": null
    },
    {
        "Luang Prabang": "luang prabang"
    },
    {
        " , Nostalgia of China , and Goodbye Bogor were sentimental songs Scott-Maxwell , p. 42 about neighbouring countries including ": null
    },
    {
        "Laos": "laos"
    },
    {
        ", ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        ", and China.      After he was ousted as head of state in 42 Sihanouk wrote several ": null
    },
    {
        "revolutionary-style songs": "revolutionary song"
    },
    {
        " Scott-Maxwell , p. 42 that praised the leaders of Communist countries, including Hommage Khmer au Maréchal Kim Il Sung and Merci, Piste Ho Chi Minh . They were intended to show his gratitude toward the Communist leaders, which had supported GRUNK between 42 and 42 Scott-Maxwell , p. 42 From a young age, Sihanouk learned to play several musical instruments including the clarinet, saxophone, piano, and accordion. In the 42s, Sihanouk led a musical band made up of his relatives, who would perform French songs and his own personal compositions for diplomats at the royal palace.  In his tours across Cambodian provinces, Sihanouk was accompanied by the Royal Military Orchestra and Cambodian pop singers. Later, while Sihanouk was living in exile during the 42s, he hosted concerts to entertain diplomats whenever he visited the United Nations Headquarters in New York City. Widyono , p. 42 After he was reinstated as king in 42 Sihanouk continued to perform in concerts held at the royal palace on an occasional basis. Kinetz et al. , p. 42                 Sihanouk was known by many formal and informal titles throughout his lifetime, Osborne , p. 42 and the ": null
    },
    {
        "Guinness Book of World Records": "guinness book of world records"
    },
    {
        " identifies Sihanouk as the royal who had served the greatest variety of state and political offices. Narong , p. 42 When Sihanouk became king in 42 he was bestowed with the official title of Preah Bat Samdech Preah Norodom Sihanouk Varman , which he used for both reigns between 42 and 42 and again from 42 to 42 He reverted to the title of Prince after he abdicated 42 and in that year was given by his father and successor the title of Samdech Preah Upayuvareach , which translates in English as The Prince who has been King . Osborne , p. 42 Starting from the early 42s when he became the Head of State, Chandler , p. 42 Sihanouk was affectionately known to most Cambodians as Samdech Euv , Jeldres , p. 42 which translates as the Prince Father in English.     In 42 after his second abdication, Sihanouk became known as the King Father of Cambodia, Widyono , p. 42 with the official title of Preah Karuna Preah Bat Sâmdach Preah Norodom Sihanouk Preahmâhaviraksat . He was also referred to by another honorific, His Majesty King Norodom Sihanouk The Great Heroic King King-Father of Khmer independence, territorial integrity and national unity .  At the same time, he issued a royal decree requesting to be called Samdech Ta  or Samdech Ta-tuot ,  which translates as Grandfather and Great-grandfather , respectively, in English.  When Sihanouk died in October 42 he was bestowed by his son Sihamoni with the posthumous title of Preah Karuna Preah Norodom Sihanouk Preah Borom Ratanakkot , which literally translates as The King who lies in the Diamond Urn in English.          Sihanouks name is derived from two ": null
    },
    {
        "Sanskrit": "sanskrit"
    },
    {
        " words Siha  and Hanu , which translates as Lion and Jaws , respectively, in English. Jeldres , p. 42 Mehta , p. 42 He was fluent in Khmer, French, and English, Jeldres , p. 42 and also learned ": null
    },
    {
        "Greek": "ancient greek"
    },
    {
        " and ": null
    },
    {
        "Latin": "latin"
    },
    {
        " in high school. Jeldres , p. 42 In his high school days, Sihanouk played soccer, basketball, volleyball, and also took up ": null
    },
    {
        "horse riding": "equestrianism"
    },
    {
        ". He suffered from ": null
    },
    {
        "diabetes": "diabetes"
    },
    {
        " and depression in the 42s, Chandler , p. 42 which flared up again in the late 42s while living in captivity under the Khmer Rouge. Osborne , p. 42 In November 42 Sihanouk suffered a stroke Marlay and Neher , p. 42 caused by the thickening of the coronary arteries and blood vessels.  In 42 he was diagnosed with ": null
    },
    {
        "B cell": "b cell"
    },
    {
        " lymphoma": "lymphoma"
    },
    {
        " in the ": null
    },
    {
        "prostate": "prostate"
    },
    {
        "  and was treated with chemotherapy and surgery.  Sihanouks lymphoma went into remission in 42  but returned again in 42 in the gastric region. He suffered a third bout of lymphoma in 42 and after prolonged treatment it went into remission the following year.      In 42 Sihanouk built a personal residence at ": null
    },
    {
        "Chamkarmon District": "chamkarmon district"
    },
    {
        " where he lived over the next ten years as the Head of State. Osborne , p. 42 Following his overthrow in 42 Sihanouk took up residence in Beijing, where he lived at the ": null
    },
    {
        "Diaoyutai State Guesthouse": "diaoyutai state guesthouse"
    },
    {
        " in the first year of his stay. In 42 Sihanouk moved to a larger residence in the city that once housed the French embassy. Jeldres , p. 42 The residence was equipped with a temperature-adjustable swimming pool, cinema Jeldres , p. 42 and seven chefs. Jeldres , p. 42 In 42 North Korean leader ": null
    },
    {
        "Kim Il-sung": "kim il-sung"
    },
    {
        " built Changsuwon, a 42-room mansion, for Sihanouk.  Changsuwon was built near an artificial lake, and Sihanouk spent time taking boat trips there and also shot a few films within the compound.  In August 42 Sihanouk declared his assets on his website, which according to him consisted of a small house in Siem Reap and 42 Euros of cash savings stored in a French bank. He also stated that his residences in Beijing and Pyongyang were guesthouses owned by the governments of China and North Korea, respectively, and that they did not belong to him.               In April 42 Sihanouk married Paule Monique Izzi, the daughter of Pomme Peanga Cambodian, and Jean-François Izzi, a French banker of Italian ancestry. Jeldres , p. 42 Monique became Sihanouks lifelong partner; in the 42s she changed her name to Monineath. Mehta , p. 42 Before his marriage to Monique, Sihanouk married five other women: Phat Kanhol, Sisowath Pongsanmoni, Sisowath Monikessan, ": null
    },
    {
        "Mam Manivan Phanivong": "mam manivan phanivong"
    },
    {
        ", and Thavet Norleak. Jeldres , pp. ii, iii . Monikessan died in childbirth in 42; his marriages to the other four women all ended in divorce. Mehta , p. 42 Sihanouk had fourteen children with five different wives. Thavet Norleak bore him no children. Osborne , pp. 42–42 During the Khmer Rouge years, five children and fourteen grandchildren disappeared; Sihanouk believed they were killed by the Khmer Rouge. Osborne , p. 42      Sihanouk had the following issue:          ": null
    }
]