[
    {
        "   Norwegian literature is literature composed in ": null
    },
    {
        "Norway": "norway"
    },
    {
        " or by ": null
    },
    {
        "Norwegian people": "norwegian people"
    },
    {
        ". The history of Norwegian literature starts with the ": null
    },
    {
        "pagan": "norse paganism"
    },
    {
        " Eddaic poems": "eddaic poems"
    },
    {
        " and ": null
    },
    {
        "skaldic verse": "skaldic verse"
    },
    {
        " of the 42th and 42th centuries with poets such as ": null
    },
    {
        "Bragi Boddason": "bragi boddason"
    },
    {
        " and ": null
    },
    {
        "Eyvindr Skáldaspillir": "eyvindr skáldaspillir"
    },
    {
        ". The arrival of Christianity around the year 42 brought Norway into contact with European medieval learning, hagiography and history writing. Merged with native oral tradition and Icelandic influence, this was to flower into an active period of literature production in the late 42th and early 42th centuries. Major works of that period include  Historia Norwegie ,  Thidreks saga  and  Konungs skuggsjá .     The period from the 42th century to the 42th is considered a Dark Age in the nations literature though Norwegian-born writers such as ": null
    },
    {
        "Peder Claussøn Friis": "peder claussøn friis"
    },
    {
        " and ": null
    },
    {
        "Ludvig Holberg": "ludvig holberg"
    },
    {
        " contributed to the common literature of ": null
    },
    {
        "Denmark–Norway": "denmark–norway"
    },
    {
        ". With the advent of nationalism and the struggle for independence in the early 42th century, a new period of national literature emerged. In a flood of nationalistic romanticism, the  great four  emerged: ": null
    },
    {
        "Henrik Ibsen": "henrik ibsen"
    },
    {
        ", ": null
    },
    {
        "Bjørnstjerne Bjørnson": "bjørnstjerne bjørnson"
    },
    {
        ", ": null
    },
    {
        "Alexander Kielland": "alexander kielland"
    },
    {
        ", and ": null
    },
    {
        "Jonas Lie": "jonas lie"
    },
    {
        ". The dramatist ": null
    },
    {
        "Henrik Wergeland": "henrik wergeland"
    },
    {
        " was the most-influential author of the period while the later works of ": null
    },
    {
        "Henrik Ibsen": "henrik ibsen"
    },
    {
        " were to earn Norway a key place in Western European literature.     ": null
    },
    {
        "Modernist literature": "modernist literature"
    },
    {
        " was introduced to Norway through the literature of ": null
    },
    {
        "Knut Hamsun": "knut hamsun"
    },
    {
        " and ": null
    },
    {
        "Sigbjørn Obstfelder": "sigbjørn obstfelder"
    },
    {
        " in the 42s. In the 42s ": null
    },
    {
        "Emil Boyson": "emil boyson"
    },
    {
        ", ": null
    },
    {
        "Gunnar Larsen": "gunnar larsen"
    },
    {
        ", ": null
    },
    {
        "Haakon Bugge Mahrt": "haakon bugge mahrt"
    },
    {
        ", ": null
    },
    {
        "Rolf Stenersen": "rolf stenersen"
    },
    {
        " and ": null
    },
    {
        "Edith Øberg": "edith øberg"
    },
    {
        " were among the Norwegian authors who experimented with prose modernism. The literature in the first years after the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " was characterized by a long series of documentary reports from people who had been in German custody, or who had participated in the resistance efforts during the occupation. In the 42th century notable Norwegian writers include the two Nobel Prize-winning authors, ": null
    },
    {
        "Knut Hamsun": "knut hamsun"
    },
    {
        " and ": null
    },
    {
        "Sigrid Undset": "sigrid undset"
    },
    {
        ". The period after 42 represented a sharp expansion of market for Norwegian fiction and the 42s produced both politicization and empowerment of Norwegian authors. The 42s has been labeled the fantasy decade in Norwegian literature.          The earliest preserved examples of Old Norse literature are the ": null
    },
    {
        "Eddic poems": "eddic poems"
    },
    {
        ", the oldest of which may have been composed in early 42th century Norway drawing on the common Germanic tradition of ": null
    },
    {
        "alliterative verse": "alliterative verse"
    },
    {
        ". In the 42th century the first instances of ": null
    },
    {
        "skaldic poetry": "skaldic poetry"
    },
    {
        " also appear with the skalds ": null
    },
    {
        "Bragi Boddason": "bragi boddason"
    },
    {
        ", ": null
    },
    {
        "Þjóðólfr of Hvinir": "þjóðólfr of hvinir"
    },
    {
        " and the court poets of ": null
    },
    {
        "Harald Fairhair": "harald fairhair"
    },
    {
        ". This tradition continued through the 42th century with the major Norwegian poet being ": null
    },
    {
        "Eyvindr skáldaspillir": "eyvindr skáldaspillir"
    },
    {
        ". By the late 42th century the tradition of skaldic verse had increasingly moved to Iceland and Norwegian rulers such as ": null
    },
    {
        "Eiríkr Hákonarson": "eiríkr hákonarson"
    },
    {
        " and ": null
    },
    {
        "St. Olaf": "olaf ii of norway"
    },
    {
        " employed mostly Icelandic poets.          In pagan times the ": null
    },
    {
        "runic alphabet": "runes"
    },
    {
        " was the only one used in Norway. The preserved inscriptions from that time are mostly short memorial dedications or magical formulas. One of the longest inscriptions is that on the 42th century ": null
    },
    {
        "Eggjum stone": "eggjum stone"
    },
    {
        ", containing cryptic religious or magical allusions. Around the years 42 to 42 Christianity became established in Norway, bringing with it the ": null
    },
    {
        "Latin alphabet": "latin alphabet"
    },
    {
        ". The oldest preserved Norwegian prose works are from the mid42th century, the earliest are Latin hagiographical and historical texts such as  Passio Olavi ,  Acta sanctorum in Selio ,  Historia Norwegie  and  Historia de Antiquitate Regum Norwagiensium . At the end of the 42th century, historical writing expanded to the vernacular with  Ágrip af Nóregskonungasögum  followed by the  Legendary Saga of St. Olaf  and  Fagrskinna .     Medieval Norwegian literature is closely tied with medieval ": null
    },
    {
        "Icelandic literature": "icelandic literature"
    },
    {
        " and considered together as ": null
    },
    {
        "Old Norse literature": "old norse literature"
    },
    {
        ". The greatest Norse author of the 42th century was the Icelander ": null
    },
    {
        "Snorri Sturluson": "snorri sturluson"
    },
    {
        ". He recorded ": null
    },
    {
        "Norse mythology": "norse mythology"
    },
    {
        " in the form of the  Prose Edda , a book of poetic language providing an important understanding of Norse culture prior to Christianity. He was also the author of the  Heimskringla , a detailed history of the Norwegian kings that begins in the legendary  Ynglinga saga  and continues to document much of early Norwegian history.     The period of common Old Norse literature continued up through the 42th century with Norwegian contributions such as  Thidreks saga  and  Konungs skuggsjá  but by the 42th century saga writing was no longer cultivated in Norway and Icelandic literature became increasingly isolated.            Norwegian literature was virtually nonexistent during the period of the ": null
    },
    {
        "Scandinavian Union": "kalmar union"
    },
    {
        " and the subsequent ": null
    },
    {
        "Dano-Norwegian union": "denmark–norway"
    },
    {
        " . Ibsen characterized this period as Four Hundred Years of Darkness . During the period of union with Denmark, Danish replaced Norwegian. The university and cultural center of Denmark–Norway was Copenhagen, where young men went to study. Blankner 42     The reformation was imposed on Norway in 42 and the Dano-Norwegian rulers used it to also impose Danish culture; this was effected through the pulpit as well as through written records, as pastors were trained in Copenhagen. Thus, ": null
    },
    {
        "written Norwegian": "norwegian language"
    },
    {
        " became closely related to Danish, causing the literature to become essentially Danish. Geble Pedersson  was the first Lutheran ": null
    },
    {
        "Bishop of Bergen": "diocese of bjørgvin"
    },
    {
        " and a man of broad humanistic views; his adopted son, ": null
    },
    {
        "Absalon Pederssøn Beyer": "absalon pederssøn beyer"
    },
    {
        " , followed in his footsteps as a humanist and a nationalist, writing an important historical work, Concerning the Kingdom of Norway . ": null
    },
    {
        "Peder Claussøn Friis": "peder claussøn friis"
    },
    {
        " was also a humanist who both revived the  Heimskringla  by translating it into the language of the period and wrote the first natural history of Norway as well as an important topographic study of Norway.     The seventeenth century was a period of meager literary activity in Norway, but there were significant contributions. ": null
    },
    {
        "Petter Dass": "petter dass"
    },
    {
        " wrote Nordlands Trompet which described in graphic verse the landscape, mode of life, conditions and character of the northern Norwegian people. Two other authors merit mention. ": null
    },
    {
        "Dorothe Engelbretsdotter": "dorothe engelbretsdotter"
    },
    {
        " , was Norways first recognized woman author who wrote powerful religious poetry. Her first work, Siælens Sang-offer, was published in 42 Taare-Offer was her second collected works and was published for the first time in 42 Another gifted poet was ": null
    },
    {
        "Anders Arrebo": "anders arrebo"
    },
    {
        " who translated the Psalms into Norwegian and composed the creation poem, Hexaemeron.     Norway also contributed significantly to the joint literature of Denmark–Norway. One of the very first names in Danish literature, Peder Claussøn Friis , was Norwegian-born. Other important Norwegian by birth Danish authors of the period included ": null
    },
    {
        "Ludvig Holberg": "ludvig holberg"
    },
    {
        " , ": null
    },
    {
        "Christian Tullin": "christian tullin"
    },
    {
        " , and ": null
    },
    {
        "Johan Herman Wessel": "johan herman wessel"
    },
    {
        " .       Two major events precipitated a major resurgence in Norwegian literature. In 42 a Norwegian university was established in Christiania . Seized by the spirit of revolution following the American and French Revolutions, as well as bridling as a result of the forced separation from Denmark and subordination to Sweden subsequent to the Napoleonic wars, Norwegians signed their first constitution in 42 Virtually immediately, the cultural backwater that was Norway brought forth a series of strong authors recognized first in Scandinavia, and then worldwide.     ": null
    },
    {
        "Henrik Wergeland": "henrik wergeland"
    },
    {
        " is generally recognized as the father of a new Norwegian literature. The enthusiastic nationalism of Wergeland and his young following brought conflict with the establishment, which was unwilling to accept everything as good, simply because it was Norwegian.     This period also saw collection of Norwegian folk tales by ": null
    },
    {
        "Peter Asbjørnsen": "peter asbjørnsen"
    },
    {
        " and Bishop ": null
    },
    {
        "Jørgen Moe": "jørgen moe"
    },
    {
        ". This collection, which paralleled those by the ": null
    },
    {
        "Brothers Grimm": "brothers grimm"
    },
    {
        " in Germany and ": null
    },
    {
        "Hans Christian Andersen": "hans christian andersen"
    },
    {
        " in Denmark, captured an important overview of the folk culture of the mountains and fjords.     At least as important in the creation of a Norwegian literature was the effort to introduce a pure Norwegian language, based on the dialects spoken in the areas more isolated from capital. The genius of ": null
    },
    {
        "Ivar Aasen": "ivar aasen"
    },
    {
        " was at the heart of this effort. Aasen, a self-taught linguistic scholar and philologist, documented a written grammar and dictionary for the spoken Norwegian folk language, which became Nynorsk – the speech of the country as opposed to the official language largely imported from Denmark. Nynorsk is one of the two official written norms of the Norwegian language to this day.       By the late 42th century, in a flood of nationalistic romanticism, the  great four  emerged: ": null
    },
    {
        "Henrik Ibsen": "henrik ibsen"
    },
    {
        ", ": null
    },
    {
        "Bjørnstjerne Bjørnson": "bjørnstjerne bjørnson"
    },
    {
        ", ": null
    },
    {
        "Alexander Kielland": "alexander kielland"
    },
    {
        ", and ": null
    },
    {
        "Jonas Lie": "jonas lie"
    },
    {
        ". A unity of purpose pervades the whole period, creation of a national culture based on the almost forgotten and certainly neglected past, as well as celebration of the Bonde Kultur or ": null
    },
    {
        "Norwegian farm culture": "norwegian farm culture"
    },
    {
        ". The realism of Kielland  gave way to the romantic and nationalistic spirit which swept Europe and rekindled the Norwegian interest in their glorious ": null
    },
    {
        "Viking": "viking"
    },
    {
        " past , the struggles of the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " , peasant stories  and the wonders of myths and folks tales of the mountains  and the sea .       Although a strong contributor to early Norwegian romanticism, ": null
    },
    {
        "Henrik Ibsen": "henrik ibsen"
    },
    {
        " is perhaps best known as an influential Norwegian playwright who was largely responsible for the popularity of modern realistic drama in Europe, with plays like  The Wild Duck  and  A Dolls House . In this, he built on a theme first evident in Norway with plays like Bjørnsons En fallit .       Although a side note to the mainstream of Norwegian literature, the literature which documents the experience of Norwegian emigrants to America is as important as the Norwegian immigrants became to the growing America of the 42th century. Three authors are recognized in this genre; ": null
    },
    {
        "Ole Rølvaag": "ole rølvaag"
    },
    {
        " wrote about immigrants, while ": null
    },
    {
        "Johan Bojer": "johan bojer"
    },
    {
        " and ": null
    },
    {
        "Ingeborg Refling Hagen": "ingeborg refling hagen"
    },
    {
        " wrote about emigrants. Ole E. Rølvaag, who immigrated to America, experienced life in the prairies, and rose to become professor of Norwegian at ": null
    },
    {
        "St. Olaf College": "st. olaf college"
    },
    {
        " in Northfield, ": null
    },
    {
        "Minnesota": "minnesota"
    },
    {
        ", provided a strong record of the joys and pains of the immigrant in adapting to the harsh realities of and carving out a new life in a wild new country. Norwegian author Johan Bojer provided a mirror image, depicting the struggles and processes which led to the decisions to emigrate. Ingeborg Refling Hagen, having two brothers and a sister in the United States contemplated the emigrants longing for home and their harsh struggle over there in a known collection of emigrant poems from 42       ": null
    },
    {
        "Modernist literature": "modernist literature"
    },
    {
        " was introduced to Norway through the literature of ": null
    },
    {
        "Knut Hamsun": "knut hamsun"
    },
    {
        " and ": null
    },
    {
        "Sigbjørn Obstfelder": "sigbjørn obstfelder"
    },
    {
        " in the 42s. In the 42s, ": null
    },
    {
        "Emil Boyson": "emil boyson"
    },
    {
        ", ": null
    },
    {
        "Gunnar Larsen": "gunnar larsen"
    },
    {
        ", ": null
    },
    {
        "Haakon Bugge Mahrt": "haakon bugge mahrt"
    },
    {
        ", ": null
    },
    {
        "Rolf Stenersen": "rolf stenersen"
    },
    {
        " and ": null
    },
    {
        "Edith Øberg": "edith øberg"
    },
    {
        " were among the Norwegian authors who experimented with prose modernism. The books of the 42s did not receive the same recognition as modernist works after the war. In 42 ": null
    },
    {
        "Tarjei Vesaas": "tarjei vesaas"
    },
    {
        " published a poetry collection, Leiken og lynet, that led to major debate about the shape and rhythm for Norwegian poetry. This evolved further in the 42s. Rolf Jacobsen achieved recognition as a poet of modernistic style after the war. ": null
    },
    {
        "Kristofer Uppdal": "kristofer uppdal"
    },
    {
        " was also recognized for his work.       After the death of the great four and ": null
    },
    {
        "Amalie Skram": "amalie skram"
    },
    {
        ", a new period of Norwegian literature took place. The year 42 when Norway was free from the union with Sweden, marks a new period in the history of Norwegian literature. In the 42th century, three Norwegian novelists won the ": null
    },
    {
        "Nobel prize": "nobel prize"
    },
    {
        " in literature. The first was ": null
    },
    {
        "Bjørnstjerne Bjørnson": "bjørnstjerne bjørnson"
    },
    {
        ", whose prize reflected work of the previous century. The second was awarded to ": null
    },
    {
        "Knut Hamsun": "knut hamsun"
    },
    {
        " for the idealistic novel Markens Grøde  in 42 The third was ": null
    },
    {
        "Sigrid Undset": "sigrid undset"
    },
    {
        " for the trilogy of Kristin Lavransdatter and the two books of Olav Audunssøn, in 42     Knut Hamsun was especially criticized because of his sympathy for ": null
    },
    {
        "Nasjonal Samling": "nasjonal samling"
    },
    {
        ", a Norwegian Nazi-party, during the Second World War.     Other important Norwegian writers include: ": null
    },
    {
        "Trygve Gulbranssen": "trygve gulbranssen"
    },
    {
        ", ": null
    },
    {
        "Jens Bjørneboe": "jens bjørneboe"
    },
    {
        ", ": null
    },
    {
        "Agnar Mykle": "agnar mykle"
    },
    {
        ", ": null
    },
    {
        "Olav Duun": "olav duun"
    },
    {
        ", ": null
    },
    {
        "Cora Sandel": "cora sandel"
    },
    {
        ", ": null
    },
    {
        "Kjartan Fløgstad": "kjartan fløgstad"
    },
    {
        ", ": null
    },
    {
        "Arne Garborg": "arne garborg"
    },
    {
        ", ": null
    },
    {
        "Aksel Sandemose": "aksel sandemose"
    },
    {
        ", ": null
    },
    {
        "Tarjei Vesaas": "tarjei vesaas"
    },
    {
        ", ": null
    },
    {
        "Lars Saabye Christensen": "lars saabye christensen"
    },
    {
        ", ": null
    },
    {
        "Kjell Askildsen": "kjell askildsen"
    },
    {
        ", ": null
    },
    {
        "Johan Borgen": "johan borgen"
    },
    {
        ", ": null
    },
    {
        "Dag Solstad": "dag solstad"
    },
    {
        ", ": null
    },
    {
        "Herbjørg Wassmo": "herbjørg wassmo"
    },
    {
        ", ": null
    },
    {
        "Jon Fosse": "jon fosse"
    },
    {
        ", ": null
    },
    {
        "Hans Herbjørnsrud": "hans herbjørnsrud"
    },
    {
        ", ": null
    },
    {
        "Jan Erik Vold": "jan erik vold"
    },
    {
        ", ": null
    },
    {
        "Roy Jacobsen": "roy jacobsen"
    },
    {
        ", ": null
    },
    {
        "Bergljot Hobæk Haff": "bergljot hobæk haff"
    },
    {
        ", ": null
    },
    {
        "Hans E. Kinck": "hans e. kinck"
    },
    {
        ", ": null
    },
    {
        "Olav H. Hauge": "olav h. hauge"
    },
    {
        ", ": null
    },
    {
        "Rolf Jacobsen": "rolf jacobsen"
    },
    {
        ", ": null
    },
    {
        "Gunvor Hofmo": "gunvor hofmo"
    },
    {
        ", ": null
    },
    {
        "Arnulf Øverland": "arnulf øverland"
    },
    {
        ", ": null
    },
    {
        "Sigbjørn Obstfelder": "sigbjørn obstfelder"
    },
    {
        ", ": null
    },
    {
        "Olaf Bull": "olaf bull"
    },
    {
        ", ": null
    },
    {
        "Aasmund Olavsson Vinje": "aasmund olavsson vinje"
    },
    {
        ", ": null
    },
    {
        "Tor Ulven": "tor ulven"
    },
    {
        ", ": null
    },
    {
        "Torborg Nedreaas": "torborg nedreaas"
    },
    {
        ", ": null
    },
    {
        "Stein Mehren": "stein mehren"
    },
    {
        ", ": null
    },
    {
        "Jan Kjærstad": "jan kjærstad"
    },
    {
        ", ": null
    },
    {
        "Georg Johannesen": "georg johannesen"
    },
    {
        ", ": null
    },
    {
        "Kristofer Uppdal": "kristofer uppdal"
    },
    {
        ", ": null
    },
    {
        "Aslaug Vaa": "aslaug vaa"
    },
    {
        ", ": null
    },
    {
        "Halldis Moren Vesaas": "halldis moren vesaas"
    },
    {
        ", ": null
    },
    {
        "Sigurd Hoel": "sigurd hoel"
    },
    {
        ", ": null
    },
    {
        "Johan Falkberget": "johan falkberget"
    },
    {
        ", Hans Børli and ": null
    },
    {
        "Axel Jensen": "axel jensen"
    },
    {
        ".       The literature in the first years after the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        " was characterized by a long series of documentary reports from people who had been in German custody, or who had participated in the resistance efforts during the occupation. The most famous among these were ": null
    },
    {
        "Lise Børsums": "lise børsums"
    },
    {
        "s Fange i Ravensbrück, ": null
    },
    {
        "Odd Nansen": "odd nansen"
    },
    {
        "s Fra dag til dag and the posthumously published Petter Moens dagbok . Some years later, biographies of heroes of resistance, such as ": null
    },
    {
        "Fridtjof Sælen": "frithjof sælen"
    },
    {
        "s  Shetlands-Larsen , about ": null
    },
    {
        "Leif Andreas Larsen": "leif larsen"
    },
    {
        ", and David Armin Howarths Ni liv. Historien om Jan Baalsrud , became major publishing successes.     Fiction of the period also centered on the war. ": null
    },
    {
        "Sigurd Evensmo": "sigurd evensmo"
    },
    {
        "s Englandsfarere about a group of resistance fighters who are captured. ": null
    },
    {
        "Tarjei Vesaas": "tarjei vesaas"
    },
    {
        " symbolically addressed the war experience in  Huset i mørkret  . A significant portion of the post-war literature was concerned with the question of why some remained good Norwegian patriots while others, seemingly ordinary people, served the enemy. Examples of this include ": null
    },
    {
        "Sigurd Hoel": "sigurd hoel"
    },
    {
        "s Møte ved milepelen from 42 ": null
    },
    {
        "Kåre Holt": "kåre holt"
    },
    {
        "s Det store veiskillet from 42 and ": null
    },
    {
        "Aksel Sandemose": "aksel sandemose"
    },
    {
        "s Varulven from 42 which provide psychological explanations for ": null
    },
    {
        "collaboration": "collaborationism"
    },
    {
        ".     Poetry written during the war, which had either been broadcast from London or had circulated illegally, was published as collections in the spring of 42 and enjoyed a popularity that Norwegian poetry has not seen before or since. In particular ": null
    },
    {
        "Arnulf Øverland": "arnulf øverland"
    },
    {
        "s Vi overlever alt and Nordahl Griegs Friheten were well-received. Some of those who were young during the war found that the traditional lyrical forms were insufficient to express horrors of war, atomic bombs and the emerging Cold War. ": null
    },
    {
        "Gunvor Hofmo": "gunvor hofmo"
    },
    {
        ", who was personally affected by the war, came with the remarkable collections Jeg vil hjem til menneskene and Fra en annen virkelighet .     ": null
    },
    {
        "Modernism": "modernism"
    },
    {
        " appeared on a broad front in the Norwegian poetry of the 42s. It impacted the lyrics produced by Tarjei Vesaas, ": null
    },
    {
        "Ernst Orvil": "ernst orvil"
    },
    {
        ", ": null
    },
    {
        "Astrid Tollefsen": "astrid tollefsen"
    },
    {
        " and ": null
    },
    {
        "Olav H. Hauge": "olav h. hauge"
    },
    {
        ". Among the younger poets, such as ": null
    },
    {
        "Astrid Hjertenæs Andersen": "astrid hjertenæs andersen"
    },
    {
        ", ": null
    },
    {
        "Paal Brekke": "paal brekke"
    },
    {
        ", ": null
    },
    {
        "Hans Børli": "hans børli"
    },
    {
        ", ": null
    },
    {
        "Harald Sverdrup": "harald sverdrup"
    },
    {
        " and ": null
    },
    {
        "Marie Takvam": "marie takvam"
    },
    {
        ", free verse was the preferred form. Paal Brekke was modernisms foremost advocate against traditionalists – such as Arnulf Øverland and ": null
    },
    {
        "André Bjerke": "andré bjerke"
    },
    {
        " – in a wide-ranging debate about poetic forms which is recognized as the speaking-in-tongues debate. ": null
    },
    {
        "Georg Johannesen": "georg johannesen"
    },
    {
        "s first publication Dikt in 42 introduced a new interest in political and social values, that had not been particularly evident in the 42s. At the same time, the well-established poet, Rolf Jacobsen, espoused a more critical attitude to the consumer mentality and environmental destruction.     In prose, first and foremost it was ": null
    },
    {
        "Jens Bjørneboe": "jens bjørneboe"
    },
    {
        " who led the attack on the establishment in the 42s. In Jonas and Den onde hyrde he attacks the school and prison systems, arguing that there the government shows its authoritarian aspects particularly clearly. One of the highlights of 42s prose literature is ": null
    },
    {
        "Johan Borgen": "johan borgen"
    },
    {
        "s Lillelord trilogy. Borgen work is characterized by an experimental prose-writing style, which can be seen in several short story collections as well as the experimental novel Jeg from 42 Another highlight of 42s literature was two controversial novels by ": null
    },
    {
        "Agnar Mykle": "agnar mykle"
    },
    {
        "s about Ask Burlefot: Lasso rundt fru Luna and Sangen om den røde rubin . But as a result of legal intervention against the latter book, the pressure of the court case and surrounding controversy left Mykle a reclusive who published little thereafter. ": null
    },
    {
        "Axel Jensen": "axel jensen"
    },
    {
        " was another fresh, new voice in the 42s. In his debut novels Ikaros and Line the young protagonist comes to terms with nonsocialistic members of the Social Democratic welfare state. Jensen also introduced a new theme in Norwegian literature with the publication of Epp in 42; this novel dealt with a future ": null
    },
    {
        "dystopia": "dystopia"
    },
    {
        ".     Besides Johan Borgen, Tarjei Vesaas and ": null
    },
    {
        "Torborg Nedreaas": "torborg nedreaas"
    },
    {
        " also achieved recognition as excellent short story writers. In 42 ": null
    },
    {
        "Kjell Askildsen": "kjell askildsen"
    },
    {
        " debuted with the short story collection Heretter følger jeg deg helt hjem . He has since remained at short prose genre, and is today considered one of Norwegian literatures finest short story writers.         The period after 42 represented a sharp expansion of market for Norwegian fiction. In 42 ": null
    },
    {
        "Norway": "norway"
    },
    {
        " instituted a policy for purchasing new literature. The state committed to purchase 42 copies of each new title of Norwegian literature . These were distributed among the countrys libraries. This, combined with the creation of the book club Bokklubben Nye Bøker in 42 produced increased vitality in the countrys literary production.     The 42s produced both politicization and empowerment of Norwegian authors as a group – as well as intellectuals in general. The ": null
    },
    {
        "Norwegian Authors Union": "norwegian authors union"
    },
    {
        " became an arena for political struggle as well as the struggle for academic authors rights. At one point the authors union split into two camps. Around the country the authors organized themselves in the regional authors organizations, and started a number of literary journals, in which contributions by amateur writers were welcomed.      Profil  would eventually become the most-notable literary magazine. From 42 it published the work of a number of young writers who would put their distinct mark on the literature of the period. The Profil goal was to bring Norwegian literature abreast of ": null
    },
    {
        "European literature": "european literature"
    },
    {
        " in general. To achieve this, they rebelled against the traditional ": null
    },
    {
        "psychological novel": "psychological novel"
    },
    {
        " development. The question of the true identify for the modern state was core. ": null
    },
    {
        "Dag Solstad": "dag solstad"
    },
    {
        " contributed significantly to this late42s figures modernism through his articles, essays and literary works.     Poetry already exhibited a modernist style, which was prevalent through the 42s and early 42s. Traditionalists who still wrote in fixed stanza forms were out of favor. The younger poets targeted replacing the 42s-style symbolism, and ": null
    },
    {
        "Jan Erik Vold": "jan erik vold"
    },
    {
        " was at the forefront of this insurgency. Profil poetry introduced a new simplicity, ": null
    },
    {
        "concretism": "concrete poetry"
    },
    {
        ", and use of everyday language. ": null
    },
    {
        "Paal Brekke": "paal brekke"
    },
    {
        " was particularly noted for promoting modern European poetry, both as poet and critic. He argued for a renewal of Norwegian poetry, and spread knowledge of foreign literature through translations of ": null
    },
    {
        "English modernist writers": "modernist poetry in english"
    },
    {
        " like ": null
    },
    {
        "T.S.Eliot": "t.s.eliot"
    },
    {
        ". In the mid42s, Brekke participated in the debate on lyrical form, and opposed ": null
    },
    {
        "André Bjerke": "andré bjerke"
    },
    {
        " and ": null
    },
    {
        "Arnulf Øverland": "arnulf øverland"
    },
    {
        " in the so-called  Glossolalia debate. Among the established lyrists, ": null
    },
    {
        "Olav H. Hauge": "olav h. hauge"
    },
    {
        " transitioned to ": null
    },
    {
        "modernistic": "modernist poetry"
    },
    {
        " and ": null
    },
    {
        "concretist": "concrete poetry"
    },
    {
        " poetry and enjoyed a renaissance, especially with his collection entitled Dropar in austavind, which inspired other, younger Norwegian poets, such as ": null
    },
    {
        "Jan Erik Vold": "jan erik vold"
    },
    {
        ".     After a short period the Profil group went separate routes, as authors such as Dag Solstad, ": null
    },
    {
        "Espen Haavardsholm": "espen haavardsholm"
    },
    {
        ", and ": null
    },
    {
        "Tor Obrestad": "tor obrestad"
    },
    {
        " turned to the newly formed party ": null
    },
    {
        "Workers Communist Party": "workers communist party"
    },
    {
        " , and become involved in formulating a new political program that based on the view that literature should serve the working people and their uprising against capitalism. Arild Asnes Solstads 42 is a key novel to understanding the desire of the modern intellectual to connect with something larger and more realistic – the working people and a cause.     There were few AKP-authors, yet they managed to set a major part of the agenda for Norwegian fiction through much of the 42s. Some authors began to write novels and poems in a language targeted so that people could recognize themselves, often known as ": null
    },
    {
        "social realism": "social realism"
    },
    {
        " literature. Well-known works in this genre include Solstads 42 septemberplassen, Obrestads Sauda! Streik! and Haavardsholms Historiens kraftlinjer.     Even though a minority wrote AKP-themed literature, there was a general willingness of the larger community of authors to support this literary focus. Besides the class struggle, there were two areas that were subject of serious literature: ": null
    },
    {
        "feminism": "feminism"
    },
    {
        " and the struggle against the concentration of governmental power into a centralized government.     The term ": null
    },
    {
        "feminist literature": "feminist literature"
    },
    {
        " or womans literature was shifting during this period. While some believed that a special term for literature written for women by women about womens experiences were necessary, others were concerned that feminist literature served to place the female writers and readers outside the community, in an isolated cycle. Notwithstanding the debate, important contributions came from new, female authors about women unsatisfactory role in the family and in society. ": null
    },
    {
        "Liv Køltzow": "liv køltzow"
    },
    {
        "s Hvem bestemmer over Liv og Unni? is central to understanding the new womans literature. ": null
    },
    {
        "Bjørg Vik": "bjørg vik"
    },
    {
        " contributed a long series of short story collections and the play To akter for fem kvinner . Both Køltzows and Viks work stayed with the realistic tradition. Later ": null
    },
    {
        "Cecilie Løveid": "cecilie løveid"
    },
    {
        " and ": null
    },
    {
        "Eldrid Lunden": "eldrid lunden"
    },
    {
        " created work with a more rebellious language representing a fresh genre of experimental work. Løveids work is notably committed to finding a new language for a new female role.         The decade of the 42s was in many ways a response to the social realism in 42s literature. In 42 ": null
    },
    {
        "Kaj Skagen": "kaj skagen"
    },
    {
        " published a polemical-philosophical treatise titled Bazarovs barn , which reconciled the role of authors who had been on the periphery in the 42s. Skagen advocated for a more individual-oriented and idealistic literature. Although it is uncertain whether this book created or simplify reflected the transition, many of the 42s authors shifted in new directions during the 42s. ": null
    },
    {
        "Dag Solstad": "dag solstad"
    },
    {
        " published two novels which were retrospectives on the Workers Communist Party. ": null
    },
    {
        "Espen Haavardsholm": "espen haavardsholm"
    },
    {
        " wrote a novel titled Drift and ": null
    },
    {
        "Edvard Hoem": "edvard hoem"
    },
    {
        " authored Prøvetid. All these works focused on middle-aged men who live through the crises of life, while struggling to find new footing. Similarly ": null
    },
    {
        "Knut Faldbakken": "knut faldbakken"
    },
    {
        "s novels about the change of mens roles during the womens revolution in the 42s reflected the new direction.     The 42s generated several major novels that develop a main theme over decades, are centered on a strong-central character person and are built around rural milieu or a local community of a not too distant past. Examples include ": null
    },
    {
        "Lars Saabye Christensen": "lars saabye christensen"
    },
    {
        "s Beatles, ": null
    },
    {
        "Tove Nilsen": "tove nilsen"
    },
    {
        "s Skyskraperengler , ": null
    },
    {
        "Ingvar Ambjørnsen": "ingvar ambjørnsen"
    },
    {
        "s Hvite niggere , ": null
    },
    {
        "Gerd Brantenberg": "gerd brantenberg"
    },
    {
        "s St.Croix trilogy, ": null
    },
    {
        "Herbjørg Wassmo": "herbjørg wassmo"
    },
    {
        "s Tora-trilogy and ": null
    },
    {
        "Roy Jacobsen": "roy jacobsen"
    },
    {
        "s Seierherrene.     The 42s have also been labeled the fantasy decade in Norwegian literature. A number of authors, including ": null
    },
    {
        "Kjartan Fløgstad": "kjartan fløgstad"
    },
    {
        ", ": null
    },
    {
        "Mari Osmundsen": "mari osmundsen"
    },
    {
        ", ": null
    },
    {
        "Hans Herbjørnsrud": "hans herbjørnsrud"
    },
    {
        ", ": null
    },
    {
        "Arild Nyquist": "arild nyquist"
    },
    {
        ", ": null
    },
    {
        "Jan Kjærstad": "jan kjærstad"
    },
    {
        " and ": null
    },
    {
        "Ragnar Hovland": "ragnar hovland"
    },
    {
        " produced works with magical, fantastic or improbable elements. Literature written for children and young people also included fantastic elements; ": null
    },
    {
        "Tormod Haugen": "tormod haugen"
    },
    {
        " is the most notable contributor to this genre.     A large number of 42s authors displayed a high degree of literary consciousness. Many of the new authors in this decade were formally educated in literature, philosophy and other academic subjects at the many schools or institutes for writers established throughout Norway. Many novels generated internal conflicts with the text itself or with other texts, and the protagonists was represented as a writer, scientist or artist. ": null
    },
    {
        "Jan Kjærstad": "jan kjærstad"
    },
    {
        "s Homo Falsus is perhaps the foremost of these 42s ": null
    },
    {
        "meta-novels": "metanarrative"
    },
    {
        ", ": null
    },
    {
        "Karin Moe": "karin moe"
    },
    {
        "s KYKA/42 another. ": null
    },
    {
        "Ole Robert Sunde": "ole robert sunde"
    },
    {
        " and ": null
    },
    {
        "Liv Nysted": "liv nysted"
    },
    {
        " also produced works in this genre. Another consequence of more academically-oriented authors was the large number of essay collections published in recent years; these often provide an authors interpretations of other authors or reflections on other forms of art.     The period showed a rising interest in crime literature. ": null
    },
    {
        "Jon Michelet": "jon michelet"
    },
    {
        ", ": null
    },
    {
        "Gunnar Staalesen": "gunnar staalesen"
    },
    {
        ", ": null
    },
    {
        "Kim Småge": "kim småge"
    },
    {
        " and ": null
    },
    {
        "Fredrik Skagen": "fredrik skagen"
    },
    {
        " all were well appreciated by Norwegian readers. In the 42s female crime writers such as ": null
    },
    {
        "Karin Fossum": "karin fossum"
    },
    {
        " and ": null
    },
    {
        "Anne Holt": "anne holt"
    },
    {
        " had great success – the latters works featured a female investigator. Interest in crime has in no way decreased since the turn of the millennium, and a number of writers have either specialized in crime or have alternated between crime and other prose. ": null
    },
    {
        "Jo Nesbø": "jo nesbø"
    },
    {
        ", ": null
    },
    {
        "Kurt Aust": "kurt aust"
    },
    {
        ", ": null
    },
    {
        "Unni Lindell": "unni lindell"
    },
    {
        ", ": null
    },
    {
        "Tom Egeland": "tom egeland"
    },
    {
        ", ": null
    },
    {
        "Tom Kristensen": "tom kristensen"
    },
    {
        ", ": null
    },
    {
        "Jørn Lier Horst": "jørn lier horst"
    },
    {
        ", ": null
    },
    {
        "Stein Morten Lier": "stein morten lier"
    },
    {
        " and ": null
    },
    {
        "Kjell Ola Dahl": "kjell ola dahl"
    },
    {
        " are among the authors in this category. A stream of translated crime, especially from Sweden and Britain, have influenced Norwegian authors of this genre.     Another clear trend is an interest in biographies, especially of authors and artists. Many of the significant living writers during the 42s have written one or more biographies of deceased artist or other colleagues. In addition, several significant biographies were written. The Fall of the Sun God. Knut Hamsun by ": null
    },
    {
        "Jørgen Haugan": "jørgen haugan"
    },
    {
        " and ": null
    },
    {
        "Ingar Sletten Kolloen": "ingar sletten kolloen"
    },
    {
        "s ": null
    },
    {
        "Knut Hamsun": "knut hamsun"
    },
    {
        " biography received great attention. There is a trend in these modern biographies – similar to todays cinema and unlike the past – to use source material of a private character.     In poetry ": null
    },
    {
        "Rolf Jacobsen": "rolf jacobsen"
    },
    {
        "s Nattåpent sold almost 42 copies and ": null
    },
    {
        "Harald Sverdrup": "harald sverdrup"
    },
    {
        "s Lysets øyeblikk was also very well received. ": null
    },
    {
        "Stein Mehren": "stein mehren"
    },
    {
        ", ": null
    },
    {
        "Tor Ulven": "tor ulven"
    },
    {
        " and ": null
    },
    {
        "Paal-Helge Haugen": "paal-helge haugen"
    },
    {
        " also published significant collections of poetry during this decade. ": null
    },
    {
        "Jan Erik Vold": "jan erik vold"
    }
]