[
    {
        "     Nosson Tzvi Finkel , also known as Nota Hirsch or Natan Tzvi Finkel, was an influential leader of ": null
    },
    {
        "Orthodox Judaism": "orthodox judaism"
    },
    {
        " in ": null
    },
    {
        "Eastern Europe": "eastern europe"
    },
    {
        " and founder of the ": null
    },
    {
        "Slabodka yeshiva": "yeshivas knesses yisrael"
    },
    {
        ", in the town of ": null
    },
    {
        "Vilijampolė": "vilijampolė"
    },
    {
        " . He is also known by the ": null
    },
    {
        "Yiddish": "yiddish"
    },
    {
        " appellation der Alter and as the Alter of Slabodka. Many of his pupils were to become major leaders of ": null
    },
    {
        "Orthodox Judaism": "orthodox judaism"
    },
    {
        " in the ": null
    },
    {
        "USA": "united states"
    },
    {
        " and ": null
    },
    {
        "Israel": "israel"
    },
    {
        ".       Finkel was orphaned at an early age, and not much is known about his formative years. At a young age, he went to study at the ": null
    },
    {
        "Kelmė Talmud Torah": "kelmė talmud torah"
    },
    {
        " under Rabbi ": null
    },
    {
        "Simcha Zissel Ziv": "simcha zissel ziv"
    },
    {
        ", the Alter of Kelmė.       Despite his influence, he was an intensely private person. Yet, he personally oversaw the complete student body of the ": null
    },
    {
        "yeshiva": "yeshiva"
    },
    {
        ".     His motto was summed up in the words Gadlus HaAdam . He stressed the need for mussar , using works such as those of Rabbi ": null
    },
    {
        "Moshe Chaim Luzzatto": "moshe chaim luzzatto"
    },
    {
        ", polishing the character traits of his students so that they would aspire to become gedolim - great ones in all areas of both scholarship, and personal ": null
    },
    {
        "ethics": "ethics"
    },
    {
        ".     He spent ten out of every twelve months with his students full-time, only returning to his wife for the Jewish holidays. He had special agents who would keep an eye out all over Europe for teenagers with an aptitude for both scholarship and leadership, recruiting them and bringing them back to Slobodka. He attained unusual success, and his students subsequently reflected that he was a master of the human psyche and knew just which psychological buttons to press to give direction to his students lives.     He would monitor the extracurricular behavior of students, judging their character faults and strengths. He was responsible for deciding which boys would share rooms together, weighing the strengths of one against the other. Some were chosen to be his personal assistants. He stressed the importance of outer appearance and the need for neatness and cleanliness. He did not want the image of the poor, tattered, down-trodden yeshiva bochur to be associated with the alumni of his institution. The rabbinical and ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        "ical graduates of the Slobodka Yeshiva tried to live up to a higher code of dress and deportment, to the point of being accused of being dandies.     He would send teams of his trained prized pupils to places that needed a boost in religious observance and learning of ": null
    },
    {
        "Torah": "torah"
    },
    {
        ". His own son, ": null
    },
    {
        "Eliezer Yehudah": "eliezer yehuda finkel"
    },
    {
        "  Finkel eventually became the head of the far older Mir yeshiva, eventually leading it all the way to Jerusalem where it is today the largest post-high school yeshiva in the world with thousands of students.       His main opponents in the yeshiva world were first and foremost Rabbi ": null
    },
    {
        "Chaim Soloveitchik": "chaim soloveitchik"
    },
    {
        " and as a result the ": null
    },
    {
        "Brisk yeshivas": "brisk yeshivas"
    },
    {
        ", who were adamantly opposed to any changes in what they believed to be the time-tested ways of yeshiva education. To this day, their ": null
    },
    {
        "yeshivos": "yeshiva"
    },
    {
        ", based mainly in Jerusalem today, do not teach mussar as a separate curriculum, but focus on pure ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        " study.     Finkels opponents argued that the pure focus on the Talmud would automatically create greatness in both scholarship and ethics. But Finkel believed that, while this might have been true in previous generations, the modern age was different. In his view, too many new enticing secular ideologies, such as ": null
    },
    {
        "Socialism": "socialism"
    },
    {
        " and ": null
    },
    {
        "Zionism": "zionism"
    },
    {
        " and the very real lure of ": null
    },
    {
        "atheism": "atheism"
    },
    {
        " in ": null
    },
    {
        "universities": "university"
    },
    {
        ", were becoming a replacement for traditional ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        " for many young ": null
    },
    {
        "Jew": "jew"
    },
    {
        "s. He was determined to prove that what he had to offer was more appealing than anything the outside world could offer.            Finkel staged one of the most dramatic moves in the history of yeshivos. In the 42s he decided to create a branch of his yeshiva in the ": null
    },
    {
        "Land of Israel": "land of israel"
    },
    {
        ", together with the dean Rabbi ": null
    },
    {
        "Moshe Mordechai Epstein": "moshe mordechai epstein"
    },
    {
        ", setting it up in ": null
    },
    {
        "Hebron": "hebron"
    },
    {
        " and sending waves of hand-picked students there, culminating with his own permanent aliyah, going up , to the Holy Land two years before his passing.     In the region of ": null
    },
    {
        "Palestine": "palestine"
    },
    {
        " he founded his own institution in the town of Hebron called Knesses Yisroel - Gathering of Israel , which moved to ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        " following the massacre of Jews during the ": null
    },
    {
        "42 Palestine riots": "1929 palestine riots"
    },
    {
        " in which many of the yeshiva students perished. This yeshiva today, ": null
    },
    {
        "Yeshivas Chevron": "yeshivas chevron"
    },
    {
        " in Jerusalem, has about a thousand students and is one of the most prestigious Lithuanian yeshivos in Israel.       During his lifetime, he molded many who would eventually become the heads  of most of the so-called Lithuanian-style yeshivas that were established in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " and ": null
    },
    {
        "Israel": "israel"
    },
    {
        " during the 42th century, and which continue to grow dramatically in the 42st century. Some of the more famous students are:   Rabbi ": null
    },
    {
        "Eliezer Yehuda Finkel": "eliezer yehuda finkel"
    },
    {
        "  of the Mirrer Yeshiva in ": null
    },
    {
        "Mir": "mir yeshiva"
    },
    {
        " and ": null
    },
    {
        "Jerusalem": "mir yeshiva"
    },
    {
        ", ": null
    },
    {
        "Israel": "israel"
    },
    {
        " Yitzchok Hutner": "yitzchok hutner"
    },
    {
        " of ": null
    },
    {
        "Yeshiva Rabbi Chaim Berlin": "yeshiva rabbi chaim berlin"
    },
    {
        " of ": null
    },
    {
        "Brooklyn, New York": "brooklyn, new york"
    },
    {
        " Yaakov Kamenetsky": "yaakov kamenetsky"
    },
    {
        " of ": null
    },
    {
        "Yeshiva Torah Vodaas": "yeshiva torah vodaas"
    },
    {
        " in ": null
    },
    {
        "Brooklyn, New York": "brooklyn, new york"
    },
    {
        " Avrohom Eliyahu Kaplan": "avrohom eliyahu kaplan"
    },
    {
        " of ": null
    },
    {
        "Hildesheimer Rabbinical Seminary": "hildesheimer rabbinical seminary"
    },
    {
        " in ": null
    },
    {
        "Berlin, Germany": "berlin, germany"
    },
    {
        " Aaron Kotler": "aaron kotler"
    },
    {
        ", of ": null
    },
    {
        "Beth Medrash Govoha": "beth medrash govoha"
    },
    {
        " in ": null
    },
    {
        "Lakewood, New Jersey": "lakewood, new jersey"
    },
    {
        " Dovid Leibowitz": "dovid leibowitz"
    },
    {
        " of ": null
    },
    {
        "Yeshiva Chofetz Chaim: Rabbinical Seminary of America": "yeshiva chofetz chaim: rabbinical seminary of america"
    },
    {
        " in ": null
    },
    {
        "Queens": "queens county, new york"
    },
    {
        " Yaakov Yitzchok Ruderman": "yaakov yitzchok ruderman"
    },
    {
        " of ": null
    },
    {
        "Yeshivas Ner Yisroel": "yeshivas ner yisroel"
    },
    {
        " in ": null
    },
    {
        "Baltimore, Maryland": "baltimore, maryland"
    },
    {
        " Yechezkel Sarna": "yechezkel sarna"
    },
    {
        ", head of ": null
    },
    {
        "Chevron Yeshiva": "hebron yeshiva"
    },
    {
        ", Jerusalem, Israel   Rabbi ": null
    },
    {
        "Isaac Sher": "isaac sher"
    },
    {
        ", head of the ": null
    },
    {
        "Slabodka Yeshiva of Bnei Brak": "slabodka yeshiva"
    },
    {
        ", Israel   Rabbi ": null
    },
    {
        "Yechiel Yaakov Weinberg": "yechiel yaakov weinberg"
    },
    {
        " of ": null
    },
    {
        "Hildesheimer Rabbinical Seminary": "hildesheimer rabbinical seminary"
    },
    {
        " in ": null
    },
    {
        "Berlin, Germany": "berlin, germany"
    },
    {
        "     The Alter did not author any books or essays personally, but some of his ethical discourses were published under the name Ohr HaTzafun - The Hidden Light . The word Ha-Tz F N also being the four initials of his name, but not in order . The title alludes to the hidden and mysterious nature of its subject, as he used to sign his name as Hatzafun.                                                      ": null
    }
]