[
    {
        "Notes on Muscovite Affairs  was a ": null
    },
    {
        "Latin": "latin"
    },
    {
        " book by Baron ": null
    },
    {
        "Sigismund von Herberstein": "sigismund von herberstein"
    },
    {
        " on the geography, history and customs of ": null
    },
    {
        "Muscovy": "muscovy"
    },
    {
        " . The book was the main early source of knowledge about Russia in Western Europe.         Herberstein was an Austrian diplomat who was twice sent to Russia as ": null
    },
    {
        "Austria": "austria"
    },
    {
        "n ambassador, in 42 and 42 Born in ": null
    },
    {
        "Vipava": "vipava, slovenia"
    },
    {
        " , ": null
    },
    {
        "Carniola": "carniola"
    },
    {
        ", he was familiar with ": null
    },
    {
        "Slovene": "slovene language"
    },
    {
        ", a ": null
    },
    {
        "Slavic": "slavic languages"
    },
    {
        " language, which became important later on his mission in Russia, when he was able to communicate with ordinary ": null
    },
    {
        "Russians": "russians"
    },
    {
        " in ": null
    },
    {
        "Slovene": "slovene language"
    },
    {
        ", another ": null
    },
    {
        "Slavic language": "slavic languages"
    },
    {
        ".     These visits occurred at a time when very little was known about Russia outside the region. The few published descriptions of Russia were in some cases wildly inaccurate.          Muscovy  in the 42th century was the Russian state which separated itself from the ": null
    },
    {
        "Kievan Rus": "kievan rus"
    },
    {
        " after it fell apart. It evolved into the ": null
    },
    {
        "Russian Empire": "russian empire"
    },
    {
        " under ": null
    },
    {
        "Peter the Great": "peter i of russia"
    },
    {
        " starting at the end of the 42th century. Russia was the region, Muscovy was the state until it no longer included just Moscow. Muscovy was then ruled by the Muscovite monarchy, starting with ": null
    },
    {
        "Ivan III": "ivan iii"
    },
    {
        " , who expanded Muscovy, and ending with ": null
    },
    {
        "Ivan IV": "ivan iv"
    },
    {
        ", who claimed the title Tsar of Russia .     In this article, Russia and Muscovy are treated as similar entities. In land area there is not much difference between Muscovy and Russia west of the ": null
    },
    {
        "Ural Mountains": "ural mountains"
    },
    {
        ". Herberstein wrote about Muscovy because that is what it was known as in the West then. We know the area as Russia, so that is how it is referred to here.         Herberstein developed a keen interest in all things Russian, and researched in several ways:   using his knowledge of Slavic, he questioned a variety of people on a wide range of topics.   careful review of existing publications on Russia, comparing what he read with his own observations. He viewed most publications skeptically, because he knew that most of the authors had not been able to actually visit Russia.   corroboration. He was careful to make sure not to accept anything that was not well corroborated. As he wrote, he  did not rely upon this or that mans account, but trusted only to the unvarying statements of many.   in the power he holds over his people the ruler of Muscovy surpasses all the monarchs of the world.   --  cz  cz cz  c cz ts  !--Incomprehensible: Other notable things as concernyng Moscovia. gathered out of the books of Sigismundus Liberus. In: The history of trauayle in the West and East Indies and other contreys..., gathered in parte and done into Englyshe by R. Eden, new lyset in order, augmented and finished by Richarde Willes, London: Richard Jugge, 42 pp. 4242--         ": null
    }
]