[
    {
        "   In ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        ", a noun class is a particular ": null
    },
    {
        "category": "grammatical category"
    },
    {
        " of ": null
    },
    {
        "noun": "noun"
    },
    {
        "s. A noun may belong to a given class because of the characteristic features of its ": null
    },
    {
        "referent": "referent"
    },
    {
        ", such as gender, animacy, shape, but such designations are often clearly conventional. Some authors use the term ": null
    },
    {
        "grammatical gender": "grammatical gender"
    },
    {
        " as a synonym of noun class , but others consider these different concepts. Noun classes should not be confused with ": null
    },
    {
        "noun classifier": "noun classifier"
    },
    {
        "s.          There are three main ways by which natural languages categorize nouns into noun classes:   according to similarities in their meaning ;   by grouping them with other nouns that have similar form ;   through an arbitrary convention.   Usually, a combination of the three types of criteria is used, though one is more prevalent.     Noun classes form a system of ": null
    },
    {
        "grammatical agreement": "agreement"
    },
    {
        ". A noun in a given class may require:   agreement ": null
    },
    {
        "affix": "affix"
    },
    {
        "es on adjectives, pronouns, numerals, etc. in the same noun phrase,   agreement affixes on the verb,   a special form of pronoun to replace the noun,   an affix on the noun,   a class-specific word in the noun phrase.     In Modern English, ": null
    },
    {
        "countable": "countable noun"
    },
    {
        " and uncountable nouns are distinguished by the choice of many/much. The choice between the relative pronoun who and which may also be considered a form of agreement with a semantic noun class. A few nouns also exhibit vestigial noun classes, such as stewardess, where the suffix -ess added to steward denotes a female person. This type of noun affixation is not very frequent in ": null
    },
    {
        "English": "english language"
    },
    {
        ", but quite common in languages which have the true ": null
    },
    {
        "grammatical gender": "grammatical gender"
    },
    {
        ", including most of the ": null
    },
    {
        "Indo-European": "indo-european languages"
    },
    {
        " family, to which English belongs.     When noun class is expressed on other ": null
    },
    {
        "parts of speech": "parts of speech"
    },
    {
        " in addition to nouns and pronouns, the language is said to have grammatical gender.     In languages without inflectional noun classes, nouns may still be extensively categorized by independent particles called ": null
    },
    {
        "noun classifier": "noun classifier"
    },
    {
        "s.          Common criteria that define noun classes include:     ": null
    },
    {
        "animate vs. inanimate": "animacy"
    },
    {
        "    rational vs. non-rational    human vs. non-human   human vs. animal vs. inanimate    male vs. other   male human vs. other   masculine vs. feminine   masculine vs. feminine vs. neuter   common vs. neuter   strong vs. weak   augmentative vs. diminutive   ": null
    },
    {
        "countable": "count noun"
    },
    {
        " vs. ": null
    },
    {
        "uncountable": "mass noun"
    },
    {
        "     See ": null
    },
    {
        "Swahili": "swahili languagenoun classes"
    },
    {
        " for the semantic motivations for an elaborate noun-class system.             The ": null
    },
    {
        "Ojibwe language": "ojibwe language"
    },
    {
        " and other members of the ": null
    },
    {
        "Algonquian languages": "algonquian languages"
    },
    {
        " distinguish between animate and inanimate classes. Some sources argue that the distinction is between things which are powerful and things which are not. All living things, as well as sacred things and things connected to the Earth are considered powerful and belong to the animate class. Still, the assignment is somewhat arbitrary, as ": null
    },
    {
        "raspberry": "raspberry"
    },
    {
        " is animate, but ": null
    },
    {
        "strawberry": "strawberry"
    },
    {
        " is inanimate.       In ": null
    },
    {
        "Navajo": "navajo language"
    },
    {
        "  nouns are classified according to their animacy, shape, and consistency. ": null
    },
    {
        "Morphologically": "morphology"
    },
    {
        ", however, the distinctions are not expressed on the nouns themselves, but on the verbs of which the nouns are the subject or direct object. For example, in the sentence  My shirt is lying on the bed , the verb  lies is used because the subject  my shirt is a flat, flexible object. In the sentence  My belt is lying on the bed , the verb  lies is used because the subject  my belt is a slender, flexible object.     ": null
    },
    {
        "Koyukon": "koyukon language"
    },
    {
        "  has a more intricate system of classification. Like Navajo, it has classificatory verb stems that classify nouns according to animacy, shape, and consistency. However, in addition to these verb stems, Koyukon verbs have what are called gender prefixes that further classify nouns. That is, Koyukon has two different systems that classify nouns:  a classificatory verb system and  a gender system. To illustrate, the verb stem -tonh is used for enclosed objects. When -tonh is combined with different gender prefixes, it can result in daaltonh which refers to objects enclosed in boxes or etltonh which refers to objects enclosed in bags.       The ": null
    },
    {
        "Dyirbal language": "dyirbal language"
    },
    {
        " is well known for its system of four noun classes, which tend to be divided along the following semantic lines:          The class usually labeled feminine , for instance, includes the word for fire and nouns relating to fire, as well as all dangerous creatures and phenomena.      The ": null
    },
    {
        "Ngangikurrunggurr language": "ngangikurrunggurr language"
    },
    {
        " has noun classes reserved for canines and hunting weapons. The ": null
    },
    {
        "Anindilyakwa language": "anindilyakwa language"
    },
    {
        " has a noun class for things that reflect light. The ": null
    },
    {
        "Diyari language": "diyari language"
    },
    {
        " distinguishes only between female and other objects. Perhaps the most noun classes in any Australian language are found in ": null
    },
    {
        "Yanyuwa": "yanyuwa language"
    },
    {
        ", which has 42 noun classes, including nouns associated with food, trees and abstractions, in addition to separate classes for men and masculine things, women and feminine things. In the mens dialect, the classes for men and for masculine things have simplified to a single class, marked the same way as the womens dialect marker reserved exclusively for men. Jean F Kirton.  In Michael J Ray , Aboriginal language use in the Northern Territory: 42 reports. Work Papers of the Summer Institute of Linguistics. Darwin: Summer Institute of Linguistics, 42 p. 42–42       In ": null
    },
    {
        "Basque": "basque language"
    },
    {
        " there are two classes, animate and inanimate; however, the only difference is in the declension of locative cases . There are a few words with both masculine and feminine forms, generally words for relatives or words borrowed from Latin . In names for familiar relatives, where both genders are taken into account, either the words for each gender are put together  or there is a noun that includes both: father : aita; mother : ama; parent : guraso.       Some members of the ": null
    },
    {
        "Northwest Caucasian": "northwest caucasian languages"
    },
    {
        " family, and almost all of the ": null
    },
    {
        "Northeast Caucasian languages": "northeast caucasian languages"
    },
    {
        ", manifest noun class. In the Northeast Caucasian family, only ": null
    },
    {
        "Lezgian": "lezgian language"
    },
    {
        ", ": null
    },
    {
        "Udi": "udi language"
    },
    {
        ", and ": null
    },
    {
        "Aghul": "aghul language"
    },
    {
        " do not have noun classes. Some languages have only two classes, whereas ": null
    },
    {
        "Bats": "bats language"
    },
    {
        " has eight. The most widespread system, however, has four classes: male, female, animate beings and certain objects, and finally a class for the remaining nouns. The ": null
    },
    {
        "Andi language": "andi language"
    },
    {
        " has a noun class reserved for insects.     Among Northwest Caucasian languages, only ": null
    },
    {
        "Abkhaz": "abkhaz language"
    },
    {
        " and ": null
    },
    {
        "Abaza": "abaza language"
    },
    {
        " have noun class, making use of a human male/human female/non-human distinction.     In all Caucasian languages that manifest class, it is not marked on the noun itself but on the dependent verbs, adjectives, pronouns and prepositions.       ": null
    },
    {
        "Niger–Congo languages": "niger–congo languages"
    },
    {
        " can have ten or more noun classes, defined according to non-sexual criteria. Certain nominal classes are reserved for humans. The ": null
    },
    {
        "Fula language": "fula language"
    },
    {
        " has about 42 noun classes . According to ": null
    },
    {
        "Steven Pinker": "steven pinker"
    },
    {
        ", the ": null
    },
    {
        "Kivunjo language": "kivunjo language"
    },
    {
        " has 42 noun classes including classes for precise locations and for general locales, classes for clusters or pairs of objects and classes for the objects that come in pairs or clusters, and classes for abstract qualities. Pinker, Steven  The Language Instinct , William Morrow and Company.       According to ": null
    },
    {
        "Carl Meinhof": "carl meinhof"
    },
    {
        ", the ": null
    },
    {
        "Bantu languages": "bantu languages"
    },
    {
        " have a total of 42 noun classes called nominal classes . While no single language is known to express all of them, most of them have at least 42 noun classes. For example, by Meinhofs numbering, ": null
    },
    {
        "Shona": "shona language"
    },
    {
        " has 42 classes, ": null
    },
    {
        "Swahili": "swahili languagenoun classes"
    },
    {
        " has 42 ": null
    },
    {
        "Sotho": "sesotho nounsnoun prefix system"
    },
    {
        " has 42 and ": null
    },
    {
        "Ganda": "lugandanoun classes"
    },
    {
        " has 42     Additionally, there are polyplural noun classes. A polyplural noun class is a plural class for more than one singular class.  For example, ": null
    },
    {
        "Proto-Bantu": "proto-bantu language"
    },
    {
        " class 42 contains plurals of class 42 nouns and class 42 nouns, while class 42 contains plurals of class 42 nouns and class 42 nouns. Classes 42 and 42 are inherited as polyplural classes by most surviving Bantu languages, but many languages have developed new polyplural classes that are not widely shared by other languages.     Specialists in Bantu emphasize that there is a clear difference between genders  and nominal classes . Languages with nominal classes divide nouns formally on the base of ": null
    },
    {
        "hyperonymic": "hyponymy"
    },
    {
        " meanings. The category of nominal class replaces not only the category of gender, but also the categories of ": null
    },
    {
        "number": "number"
    },
    {
        " and ": null
    },
    {
        "case": "grammatical case"
    },
    {
        ".     Critics of the Meinhofs approach notice that his numbering system of nominal classes counts singular and plural numbers of the same noun as belonging to separate classes. This seems to them to be inconsistent with the way other languages are traditionally considered, where number is orthogonal to gender . If one follows broader linguistic tradition and counts singular and plural as belonging to the same class, then Swahili has 42 or 42 noun classes, Sotho has 42 and Ganda has 42     The Meinhof numbering tends to be used in scientific works dealing with comparisons of different Bantu languages. For instance, in ": null
    },
    {
        "Swahili": "swahili language"
    },
    {
        " the word rafiki ‘friend’ belongs to the class 42 and its plural form is marafiki of the class 42 even if most nouns of the 42 class have the plural of the class 42 For this reason, noun classes are often referred to by combining their singular and plural forms, e.g., rafiki would be classified as 42/42 , indicating that it takes class 42 in the singular, and class 42 in the plural.     However not all Bantu languages have these exceptions. In ": null
    },
    {
        "Ganda": "luganda"
    },
    {
        " each singular class has a corresponding plural class and there are no exceptions as there are in Swahili. For this reason Ganda linguists use the orthogonal numbering system when discussing Ganda grammar , giving the 42 traditional noun classes of that language.     The distinction between genders and nominal classes is blurred still further by Indo-European languages that have nouns that behave like Swahilis rafiki. ": null
    },
    {
        "Italian": "italian language"
    },
    {
        ", for example, has a group of nouns deriving from ": null
    },
    {
        "Latin": "latin language"
    },
    {
        " neuter nouns that acts as masculine in the singular but feminine in the plural: il braccio/le braccia; luovo/le uova.     Here is a complete list of nominal classes in Swahili:          Ø- means ": null
    },
    {
        "no prefix": "null morpheme"
    },
    {
        ". Note also that some classes are ": null
    },
    {
        "homonym": "homonym"
    },
    {
        "ous . The Proto-Bantu class 42 disappeared in Swahili, class 42 merged with 42 and 42 with 42     Class prefixes appear also on adjectives and verbs, e.g.:   :     The ": null
    },
    {
        "class markers": "marker"
    },
    {
        " which appear on the adjectives and verbs may differ from the noun prefixes:   :     In this example, the verbal prefix a- and the pronominal prefix wa- are in concordance with the noun prefix m-: they all express class 42 despite of their different forms.       The ": null
    },
    {
        "Zande language": "zande language"
    },
    {
        " distinguishes four noun classes:          There are about 42 inanimate nouns which are in the animate class, including nouns denoting heavenly objects , metal objects , edible plants , and non-metallic objects . Many of the exceptions have a round shape, and some can be explained by the role they play in Zande mythology.          The term gender, as used by some linguists, refers to a noun-class system composed with 42 42 or 42 classes, particularly if the classification is semantically based on a distinction between masculine and feminine. Genders are then considered a sub-class of noun classes. Not all linguists recognize a distinction between noun-classes and genders, however, and instead use either the term gender or noun class for both.            Some languages, such as Japanese, ": null
    },
    {
        "Chinese": "chinese language"
    },
    {
        " and the ": null
    },
    {
        "Tai languages": "tai languages"
    },
    {
        ", have elaborate systems of ": null
    },
    {
        "particles": "grammatical particle"
    },
    {
        " that go with nouns based on shape and function, but are ": null
    },
    {
        "free morpheme": "free morpheme"
    },
    {
        "s rather than affixes. Because the classes defined by these classifying words are not generally distinguished in other contexts, there are many linguists who take the view that they do not create noun classes.        ": null
    },
    {
        "Bantu language": "bantu language"
    },
    {
        "s such as   ": null
    },
    {
        "Ganda": "ganda languagenoun classes"
    },
    {
        ": ten classes called simply Class I to Class X and containing all sorts of arbitrary groupings but often characterised as people, long objects, animals, miscellaneous objects, large objects and liquids, small objects, languages, pejoratives, infinitives, mass nouns, plus four locative classes. Alternatively, the Meinhof system of counting singular and plural as separate classes gives a total of 42 classes including the four locatives.   ": null
    },
    {
        "Swahili": "swahili language"
    },
    {
        " Zulu": "zulu language"
    },
    {
        " Bats": "bats language"
    },
    {
        " Dyirbal": "dyirbal language"
    },
    {
        ": Masculine, feminine, vegetable and other.   ": null
    },
    {
        "Fula": "fula language"
    },
    {
        "   Arapesh languages": "arapesh languages"
    },
    {
        " such as ": null
    },
    {
        "Mufian": "mufian language"
    },
    {
        "       ": null
    }
]