[
    {
        "Now Wait for Last Year is a 42 ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novel by American writer ": null
    },
    {
        "Philip K. Dick": "philip k. dick"
    },
    {
        ". It is set in 42 when Earth is caught between two galactic powers in an interstellar conflict. Dr. Eric Sweetscent and his wife Kathy get addicted to a powerful drug that appears to cause time travel. The doctors patient is the world leader, UN Secretary General. Of the twenty-eight novels Dick published in the 42s and 42s, this novel is one of the five chosen to represent this period of his career in ": null
    },
    {
        "The Library of America series": "library of americatable row 183"
    },
    {
        ", Volume Two.         Set during a war between the Starmen and six-limbed insectoid creatures called the reegs, Now Wait for Last Year is the story of Eric Sweetscent, an organ-transplant doctor who gets wrapped up in Earth-Lilistar politics.     At the onset of the story, Sweetscent is the personal org-trans surgeon for Virgil Ackerman, the president of Tijuana Fur & Dye. Using an extraterrestrial ": null
    },
    {
        "amoeba": "amoeba"
    },
    {
        " which can imitate the ": null
    },
    {
        "cell": "cell"
    },
    {
        "-structure of anything it touches, TF & D had been the largest manufacturer of synthetic furs on the planet. But like all major corporations on Earth, TF & D has been requisitioned to produce for the war effort.     Ackerman invites Sweetscent to Wash42 , a recreation of his boyhood native Washington DC in a simulated 42 and his vacation getaway on ": null
    },
    {
        "Mars": "mars"
    },
    {
        ", where he announces an ulterior motive in the retreat. Waiting for them when they arrive is a guest—Gino Molinari, the elected leader of Earth. Known as the Mole , he is rumored to have the enigmatic ability to come back from the dead, and he has requested the services of Sweetscent. Ackerman gladly passes Sweetscent on to Molinari.     Meanwhile, Sweetscents wife, Kathy, tries JJ42 a new ": null
    },
    {
        "hallucinogenic drug": "hallucinogenic drug"
    },
    {
        " which proves to be highly toxic and addictive. The effects of JJ42 are not clear at first, however, only hours off of it, Kathy finds herself unable to function and violently craving JJ42 again. She is visited by Starmen who claim the reegs invented JJ42 as a chemical weapon against the Starmen and Terrans, also stating that there is no known cure for the drugs addiction and Thats why we put you on it. Kathy is now a slave to JJ42     The Starmen inform Kathy of her husbands new position with Molinari and suspect the latters possible defection to the reegs. Kathy is promised more JJ42 if she agrees to spy on her husband for Lilistar. Threatened with deportation, Kathy capitulates and agrees to their terms. Eventually, she takes a second dose of the drug as her ability to function becomes nearly impossible due the effects of the withdrawal. Jumping into a taxi-cab, both she and the cab are plunged back in time to the 42s. As the effects of the drug wear off, they slowly make their way back to the present time, uncertain as to whether the past they visited was their own or an alternate one.     An increasingly paranoid Kathy sets off to visit her husband.     Under his new employer Eric Sweetscent is let in on certain State secrets: Molinari seems to have a ": null
    },
    {
        "psychosomatic": "psychosomatic"
    },
    {
        " condition that mirrors any illness or disease of anyone in his vicinity. The effects of this condition appear to be real, yet the Mole pulls through every time, always returning from the brink of death.     Molinari, like everyone else, has realized that in siding with the Starmen Earth has doomed itself to the wrong side of a losing war. However, there does not seem to be any safe way of defecting to the reegs, and Molinari fears that his deteriorating health will not instill confidence in the Terrans should the Starmen retaliate, as they are certain to do. Sweetscent is shown footage of a healthier, younger Molinari in uniform and is led to believe that an ": null
    },
    {
        "android": "android"
    },
    {
        " look-alike of the President has been created for public appearances, a notion that does not account for the fact that there is at least one other Molinari on the premises, a bullet-ridden corpse that is being preserved for use in the event of certain possible future developments.     Kathy arrives to inform her husband of her addiction, and in an effort to motivate him to find a cure she slips a pill of JJ42 into his drink. Without enough time to be furious, Eric slips a year into the future of an ": null
    },
    {
        "alternate world": "parallel universe"
    },
    {
        " where his colleagues inform him that he disappeared the day Kathy came to visit. Sweetscent also witnesses that in the new timeline Earth has sided with the reegs and Lilistar has lost the war.     Upon returning to the present of his own timeline, Sweetscent is eager to present this information to Molinari, who reveals that he too has been taking JJ42 and that the effect is different for each user. Certain users are sent to the past, while others are sent to the future. Each trip is in an alternate universe, and therefore no one can effectively change their own past or future. However, aside from minor details, events in all observed universes seem to be moving in the same direction, and therefore, information obtained from one alternate worlds future will most likely be applicable to another.     In Molinaris case he slips sideways in time under the drugs influence and is able to pull alternate versions of his present self into his own timeline and then keep them there.     Having learned the secret to Molinaris alter-aliases as well as confirming the feasibility of an alliance with the reegs, Eric takes a larger dose of JJ42 which propels him further into the future. While there, he obtains a cure for JJ42s addiction, an item of wide accessibility in the future, as well as obtaining more information about the possible future of the war in his own timeline. He also gathers information as to the effects of JJ42 on the brain as he is increasingly worried about Kathys mental condition. Taking a fraction of a pill so as to not immediately return to his own time, Eric again ends up one year in his own future where the Starmen have occupied Earth after learning of the Terrans defection to the reegs. He is arrested by a Star patrol but saved by his future self, who informs him that Ackerman and the rest of the crew at TF & D have taken a stand against Lilistar, using Ackermans getaway on Mars as their hideout.     Now knowing the general future history of the next few years, Eric returns to his own time where his wifes mental condition is deteriorating every day. He resolves to check her into a clinic and is sent into deep reflection about the nature of their relationship. Feeling that he would be justified, he attempts to arrange an affair with a younger girl at Molinaris recommendation. However, he backs out of it and begins to slip into a deep depression while reflecting on his life. He goes to ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " to purchase poison with which to commit suicide. Deciding against it at the last second, Eric watches as the Starmen begin their invasion of Earth.     Deciding that he is destined to join Ackermans resistance against the Starmen, Eric enters an automated cab bound for TF & D, asking it what it would do if its wife suffered from brain-damage without possibility of recovery . After pointing out that robots do not marry, the cab hypothetically concludes that it would stay with her. Life, argues the cab, is made up of a series of circumstances, different for each person. To leave ones wife would be to say that he requires a uniquely easier set of circumstances than what has been provided. That reasoning, to the cab, was an irrational way of thinking.     Eric agrees and decides to stay with his wife despite the challenges presented by her condition, and in the closing paragraph is commended by the cab for being a good man.                            ": null
    }
]