[
    {
        "A nuclear explosive is an ": null
    },
    {
        "explosive": "explosive"
    },
    {
        " device that derives its energy from ": null
    },
    {
        "nuclear reaction": "nuclear reaction"
    },
    {
        "s. Almost all nuclear explosive devices that have been designed and produced are ": null
    },
    {
        "nuclear weapon": "nuclear weapon"
    },
    {
        "s intended for ": null
    },
    {
        "warfare": "warfare"
    },
    {
        ".     Other, non-warfare, applications for nuclear explosives have occasionally been proposed. For example, ": null
    },
    {
        "nuclear pulse propulsion": "nuclear pulse propulsion"
    },
    {
        " is a form of ": null
    },
    {
        "spacecraft propulsion": "spacecraft propulsion"
    },
    {
        " that would use nuclear explosives to provide impulse to a spacecraft. A similar application is the proposal to use nuclear explosives for ": null
    },
    {
        "asteroid deflection": "asteroid deflection"
    },
    {
        ". From 42 to 42 the ": null
    },
    {
        "United States": "united states"
    },
    {
        " government ran a project to design a nuclear explosive powered nuclear pulse rocket called ": null
    },
    {
        "Project Orion": "project orion"
    },
    {
        ". Never built, this vessel would use repeated nuclear explosions to propel itself and was considered surprisingly practical. It is thought to be a feasible design for interstellar travel.        Nuclear explosives were once considered for use in large-scale excavation. A nuclear explosion could be used to create a ": null
    },
    {
        "harbor": "harbor"
    },
    {
        ", or a ": null
    },
    {
        "mountain pass": "mountain pass"
    },
    {
        ", or possibly large underground cavities for use as storage space. It was thought that detonating a nuclear explosive in oil-rich rock could make it possible to extract more from the deposit, e.g. note the Canadian ": null
    },
    {
        "Project Oilsand": "project oilsand"
    },
    {
        ". From 42 to 42 the U.S. government exploded 42 nuclear test-shots in a project called the ": null
    },
    {
        "Operation Plowshare": "operation plowshare"
    },
    {
        ". The purpose of the operation was to use ": null
    },
    {
        "peaceful nuclear explosions": "peaceful nuclear explosions"
    },
    {
        " for moving and lifting enormous amounts of earth and rock during construction projects such as building reservoirs. The Soviet Union conducted a much more vigorous program of 42 nuclear tests, some with multiple devices, between 42 and 42 under the auspices of Program No. 42 – ": null
    },
    {
        "Nuclear Explosions for the National Economy": "nuclear explosions for the national economy"
    },
    {
        ".     As controlled ": null
    },
    {
        "nuclear fusion": "nuclear fusion"
    },
    {
        " has proven difficult to use as an energy source, an alternate proposal for producing ": null
    },
    {
        "fusion power": "fusion power"
    },
    {
        " has been to detonate nuclear fusion explosives inside very large underground chambers and then using the heat produced, which would be absorbed by a molten salt coolant which would also absorb neutrons. The 42s ": null
    },
    {
        "PACER ": "pacer"
    },
    {
        " project investigated fusion detonation as a power source.     Failure to meet objectives, along with the realization of the dangers of ": null
    },
    {
        "nuclear fallout": "nuclear fallout"
    },
    {
        " and other residual radioactivity, and with the enactment of various agreements such as the ": null
    },
    {
        "Partial Test Ban Treaty": "partial test ban treaty"
    },
    {
        " and the ": null
    },
    {
        "Outer Space Treaty": "outer space treaty"
    },
    {
        ", has led to the termination of most of these programs.               ": null
    }
]