[
    {
        "   The nuclear fuel cycle, also called nuclear fuel chain, is the progression of ": null
    },
    {
        "nuclear fuel": "nuclear fuel"
    },
    {
        " through a series of differing stages. It consists of steps in the front end, which are the preparation of the fuel, steps in the service period in which the fuel is used during reactor operation, and steps in the back end, which are necessary to safely manage, contain, and either ": null
    },
    {
        "reprocess": "nuclear reprocessing"
    },
    {
        " or dispose of ": null
    },
    {
        "spent nuclear fuel": "used nuclear fuel"
    },
    {
        ". If spent fuel is not reprocessed, the fuel cycle is referred to as an open fuel cycle ; if the spent fuel is reprocessed, it is referred to as a closed fuel cycle.         ": null
    },
    {
        "Nuclear power": "nuclear power"
    },
    {
        " relies on fissionable material that can sustain a ": null
    },
    {
        "chain reaction": "nuclear chain reaction"
    },
    {
        " with ": null
    },
    {
        "neutron": "neutron"
    },
    {
        "s. Examples of such materials include ": null
    },
    {
        "uranium": "uranium"
    },
    {
        " and ": null
    },
    {
        "plutonium": "plutonium"
    },
    {
        ". Most nuclear reactors use a ": null
    },
    {
        "moderator": "neutron moderator"
    },
    {
        " to lower the ": null
    },
    {
        "kinetic energy": "kinetic energy"
    },
    {
        " of the neutrons and increase the probability that ": null
    },
    {
        "fission": "nuclear fission"
    },
    {
        " will occur. This allows reactors to use material with far lower concentration of ": null
    },
    {
        "fissile": "fissile"
    },
    {
        " isotopes": "isotopes"
    },
    {
        " than are needed for ": null
    },
    {
        "nuclear weapon": "nuclear weapon"
    },
    {
        "s. ": null
    },
    {
        "Graphite": "graphite"
    },
    {
        " and ": null
    },
    {
        "heavy water": "heavy water"
    },
    {
        " are the most effective moderators, because they slow the neutrons through collisions without absorbing them. ": null
    },
    {
        "Reactors": "nuclear reactor technology"
    },
    {
        " using ": null
    },
    {
        "heavy water": "heavy water reactor"
    },
    {
        " or graphite as the moderator can operate using ": null
    },
    {
        "natural uranium": "natural uranium"
    },
    {
        ".     A ": null
    },
    {
        "light water reactor": "light water reactor"
    },
    {
        " uses water in the form that occurs in nature, and requires fuel enriched to higher concentrations of fissile isotopes. Typically, LWRs use uranium ": null
    },
    {
        "enriched": "enriched uranium"
    },
    {
        " to 42–42% ": null
    },
    {
        "U42": "u-235"
    },
    {
        ", the only fissile isotope that is found in significant quantity in nature. One alternative to this low-enriched uranium fuel is ": null
    },
    {
        "mixed oxide": "mox fuel"
    },
    {
        " fuel produced by blending plutonium with natural or depleted uranium, and these fuels provide an avenue to utilize surplus ": null
    },
    {
        "weapons-grade": "weapons-grade"
    },
    {
        " plutonium. Another type of MOX fuel involves mixing LEU with ": null
    },
    {
        "thorium": "thorium fuel cycle"
    },
    {
        ", which generates the fissile isotope ": null
    },
    {
        "U42": "uranium-233"
    },
    {
        ". Both plutonium and U42 are produced from the absorption of neutrons by ": null
    },
    {
        "irradiating": "irradiating"
    },
    {
        " fertile material": "fertile material"
    },
    {
        "s in a reactor, in particular the common uranium isotope ": null
    },
    {
        "U42": "uranium-238"
    },
    {
        " and ": null
    },
    {
        "thorium": "thorium"
    },
    {
        ", respectively, and can be separated from spent uranium and thorium fuels in ": null
    },
    {
        "reprocessing plants": "nuclear reprocessing"
    },
    {
        ".     Some reactors do not use moderators to slow the neutrons. Like nuclear weapons, which also use unmoderated or fast neutrons, these ": null
    },
    {
        "fast-neutron reactor": "fast-neutron reactor"
    },
    {
        "s require much higher concentrations of fissile isotopes in order to sustain a chain reaction. They are also capable of ": null
    },
    {
        "breeding": "breeder reactor"
    },
    {
        " fissile isotopes from fertile materials; a ": null
    },
    {
        "breeder reactor": "breeder reactor"
    },
    {
        " is one that generates more fissile material in this way than it consumes.     During the nuclear reaction inside a reactor, the fissile isotopes in nuclear fuel are consumed, producing more and more ": null
    },
    {
        "fission products": "nuclear fission product"
    },
    {
        ", most of which are considered ": null
    },
    {
        "radioactive waste": "radioactive waste"
    },
    {
        ". The buildup of fission products and consumption of fissile isotopes eventually stop the nuclear reaction, causing the fuel to become a ": null
    },
    {
        "spent nuclear fuel": "spent nuclear fuel"
    },
    {
        ". When 42% enriched LEU fuel is used, the spent fuel typically consists of roughly 42% U42 42% U42 42% plutonium and 42% fission products. Spent fuel and other high-level radioactive waste is extremely hazardous, although nuclear reactors produce orders of magnitude smaller volumes of waste compared to other power plants because of the high energy density of nuclear fuel. Safe management of these byproducts of nuclear power, including their storage and disposal, is a difficult problem for any country using nuclear power.         Image:Uranium ore square.jpg|42 Uranium ore  – the principal raw material of nuclear fuel   Image:Yellowcake.jpg|42 Yellowcake  – the form in which uranium is transported to a conversion plant   Image:UF42 square.jpg|42 UF 42  – used in enrichment   Image:Nuclear fuel pellets.jpeg|42 Nuclear fuel  – a compact, inert, insoluble solid         A deposit of uranium, such as ": null
    },
    {
        "uraninite": "uraninite"
    },
    {
        ", discovered by geophysical techniques, is evaluated and sampled to determine the amounts of uranium materials that are extractable at specified costs from the deposit. Uranium reserves are the amounts of ore that are estimated to be recoverable at stated costs.     Naturally occurring uranium consists primarily of two isotopes U42 and U42 with 42% of the metal being U42 while 42% is U42 and the remaining 42% is mostly U42 The number in such names refers to the ": null
    },
    {
        "isotope": "isotope"
    },
    {
        "s atomic ": null
    },
    {
        "mass number": "mass number"
    },
    {
        ", which is the number of ": null
    },
    {
        "proton": "proton"
    },
    {
        "s plus the number of ": null
    },
    {
        "neutron": "neutron"
    },
    {
        "s in the ": null
    },
    {
        "atomic nucleus": "atomic nucleus"
    },
    {
        ".     The atomic nucleus of U42 will nearly always fission when struck by a ": null
    },
    {
        "free neutron": "free neutron"
    },
    {
        ", and the isotope is therefore said to be a ": null
    },
    {
        "fissile": "fissile"
    },
    {
        " isotope. The nucleus of a U42 atom on the other hand, rather than undergoing fission when struck by a free neutron, will nearly always absorb the neutron and yield an atom of the isotope U42 This isotope then undergoes natural radioactive decay to yield Pu42 which, like U42 is a fissile isotope. The atoms of U42 are said to be fertile, because, through neutron irradiation in the core, some eventually yield atoms of fissile Pu42          Uranium ore can be extracted through conventional mining in open pit and underground methods similar to those used for mining other metals. ": null
    },
    {
        "In-situ leach": "in-situ leach"
    },
    {
        " mining": "mining"
    },
    {
        " methods also are used to mine uranium in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ". In this technology, uranium is leached from the in-place ore through an array of regularly spaced wells and is then recovered from the leach solution at a surface plant. Uranium ores in the United States typically range from about 42 to 42% uranium oxide . Some uranium deposits developed in other countries are of higher grade and are also larger than deposits mined in the United States. Uranium is also present in very low-grade amounts in some domestic ": null
    },
    {
        "phosphate": "phosphate"
    },
    {
        "-bearing deposits of marine origin. Because very large quantities of phosphate-bearing rock are mined for the production of wet-process ": null
    },
    {
        "phosphoric acid": "phosphoric acid"
    },
    {
        " used in high analysis ": null
    },
    {
        "fertilizer": "fertilizer"
    },
    {
        "s and other phosphate chemicals, at some phosphate processing plants the uranium, although present in very low concentrations, can be economically recovered from the process stream.       Mined uranium ores normally are processed by ": null
    },
    {
        "grinding": "grinding"
    },
    {
        " the ore materials to a uniform particle size and then treating the ore to extract the uranium by chemical leaching. The milling process commonly yields dry powder-form material consisting of natural uranium, ": null
    },
    {
        "yellowcake": "yellowcake"
    },
    {
        " , which is sold on the uranium market as U 42 O 42 . Note that the material isnt always yellow.       Usually milled Uranium oxide, U 42 O 42  is then processed into either of two substances depending on the intended use.     For use in most reactors U 42 O 42 is usually converted to ": null
    },
    {
        "Uranium hexafluoride": "uranium hexafluoride"
    },
    {
        " , the input stock for most commercial uranium enrichment facilities. A solid at room temperature, uranium hexafluoride becomes gaseous at 42  °C . At this stage of the cycle the uranium hexafluoride conversion product still has the natural isotopic mix .     For use in reactors such as ": null
    },
    {
        "CANDU": "candu"
    },
    {
        " which do not require enriched fuel, the U 42 O 42 may instead be converted to ": null
    },
    {
        "uranium dioxide": "uranium dioxide"
    },
    {
        " which can be included in ": null
    },
    {
        "ceramic": "ceramic"
    },
    {
        " fuel elements.     In the current nuclear industry the volume of material converted directly to UO 42 is typically quite small compared to that converted to UF 42 .                The natural concentration of the fissionable isotope U42 is less than that required to sustain a nuclear chain reaction in ": null
    },
    {
        "light water reactor": "light water reactor"
    },
    {
        " cores. Accordingly UF 42 produced from natural uranium sources must be enriched to a higher concentration of the fissionable isotope before being used as nuclear fuel in such reactors. The level of enrichment for a particular nuclear fuel order is specified by the customer according to the application they will use it for: light-water reactor fuel normally is enriched to 42% U42 but uranium enriched to lower concentrations is also required. Enrichment is accomplished using any of several methods of ": null
    },
    {
        "isotope separation": "isotope separation"
    },
    {
        ". ": null
    },
    {
        "Gaseous diffusion": "gaseous diffusion"
    },
    {
        " and ": null
    },
    {
        "gas centrifuge": "gas centrifuge"
    },
    {
        " are the commonly used uranium enrichment methods, but new enrichment technologies are currently being developed.     The bulk of the byproduct from enrichment is ": null
    },
    {
        "depleted uranium": "depleted uranium"
    },
    {
        " , which can be used for ": null
    },
    {
        "armor": "armor"
    },
    {
        ", ": null
    },
    {
        "kinetic energy penetrator": "kinetic energy penetrator"
    },
    {
        "s, ": null
    },
    {
        "radiation shielding": "radiation shielding"
    },
    {
        " and ": null
    },
    {
        "ballast": "sailing ballast"
    },
    {
        ". As of 42 there are vast quantities of depleted uranium in storage. The ": null
    },
    {
        "United States Department of Energy": "united states department of energy"
    },
    {
        " alone has 42 ": null
    },
    {
        "tonne": "tonne"
    },
    {
        "s.  About 42% of depleted uranium is stored as ": null
    },
    {
        "uranium hexafluoride": "uranium hexafluoride"
    },
    {
        " .          For use as nuclear fuel, enriched uranium hexafluoride is converted into ": null
    },
    {
        "uranium dioxide": "uranium dioxide"
    },
    {
        " powder that is then processed into pellet form. The pellets are then fired in a high temperature ": null
    },
    {
        "sintering": "sintering"
    },
    {
        " furnace": "furnace"
    },
    {
        " to create hard, ": null
    },
    {
        "ceramic": "ceramic"
    },
    {
        " pellets of ": null
    },
    {
        "enriched uranium": "enriched uranium"
    },
    {
        ". The cylindrical pellets then undergo a grinding process to achieve a uniform pellet size. The pellets are stacked, according to each ": null
    },
    {
        "nuclear reactor core": "nuclear reactor core"
    },
    {
        "s design specifications, into tubes of corrosion-resistant metal ": null
    },
    {
        "alloy": "alloy"
    },
    {
        ". The tubes are sealed to contain the fuel pellets: these tubes are called fuel rods. The finished fuel rods are grouped in special fuel assemblies that are then used to build up the nuclear fuel core of a power reactor.     The alloy used for the tubes depends on the design of the reactor. ": null
    },
    {
        "Stainless steel": "stainless steel"
    },
    {
        " was used in the past, but most reactors now use a ": null
    },
    {
        "zirconium alloy": "zirconium alloy"
    },
    {
        ". For the most common types of reactors, ": null
    },
    {
        "boiling water reactor": "boiling water reactor"
    },
    {
        "s and ": null
    },
    {
        "pressurized water reactor": "pressurized water reactor"
    },
    {
        "s , the tubes are assembled into bundles  with the tubes spaced precise distances apart. These bundles are then given a unique identification number, which enables them to be tracked from manufacture through use and into disposal.           ": null
    },
    {
        "Transport": "transport"
    },
    {
        " is an integral part of the nuclear fuel cycle. There are nuclear power reactors in operation in several countries but uranium mining is viable in only a few areas. Also, in the course of over forty years of operation by the nuclear industry, a number of specialized facilities have been developed in various locations around the world to provide fuel cycle services and there is a need to transport nuclear materials to and from these facilities.  Most transports of ": null
    },
    {
        "nuclear fuel": "nuclear fuel"
    },
    {
        " material occur between different stages of the cycle, but occasionally a material may be transported between similar facilities. With some exceptions, nuclear fuel cycle materials are transported in solid form, the exception being ": null
    },
    {
        "uranium hexafluoride": "uranium hexafluoride"
    },
    {
        " which is considered a gas. Most of the material used in nuclear fuel is transported several times during the cycle. Transports are frequently international, and are often over large distances. Nuclear materials are generally transported by specialized transport companies.     Since nuclear materials are ": null
    },
    {
        "radioactive": "radioactive"
    },
    {
        ", it is important to ensure that radiation exposure of those involved in the transport of such materials and of the general public along transport routes is limited. Packaging for nuclear materials includes, where appropriate, ": null
    },
    {
        "shielding": "radiation shielding"
    },
    {
        " to reduce potential radiation exposures. In the case of some materials, such as fresh uranium fuel assemblies, the radiation levels are negligible and no shielding is required. Other materials, such as spent fuel and high-level waste, are highly radioactive and require special handling. To limit the risk in transporting highly radioactive materials, containers known as ": null
    },
    {
        "spent nuclear fuel shipping cask": "spent nuclear fuel shipping cask"
    },
    {
        "s are used which are designed to maintain integrity under normal transportation conditions and during hypothetical accident conditions.       A ": null
    },
    {
        "nuclear reactor core": "nuclear reactor core"
    },
    {
        " is composed of a few hundred assemblies , arranged in a regular array of cells, each cell being formed by a fuel or control rod surrounded, in most designs, by a ": null
    },
    {
        "moderator": "neutron moderator"
    },
    {
        " and ": null
    },
    {
        "coolant": "coolant"
    },
    {
        ", which is water in most reactors.     Because of the ": null
    },
    {
        "fission": "nuclear fission"
    },
    {
        " process that consumes the fuels, the old fuel rods must be replaced periodically with fresh ones . During a given replacement cycle only some of the assemblies are replaced since fuel depletion occurs at different rates at different places within the reactor core. Furthermore, for efficiency reasons, it is not a good policy to put the new assemblies exactly at the location of the removed ones. Even bundles of the same age will have different burn-up levels due to their previous positions in the core. Thus the available bundles must be arranged in such a way that the yield is maximized, while safety limitations and operational constraints are satisfied. Consequently, reactor operators are faced with the so-called optimal fuel reloading problem, which consists of optimizing the rearrangement of all the assemblies, the old and fresh ones, while still maximizing the reactivity of the reactor core so as to maximise fuel burn-up and minimise fuel-cycle costs.     This is a ": null
    },
    {
        "discrete optimization": "discrete optimization"
    },
    {
        " problem, and computationally infeasible by current ": null
    },
    {
        "combinatorial": "combinatorial"
    },
    {
        " methods, due to the huge number of ": null
    },
    {
        "permutation": "permutation"
    },
    {
        "s and the complexity of each computation. Many ": null
    },
    {
        "numerical method": "numerical method"
    },
    {
        "s have been proposed for solving it and many commercial ": null
    },
    {
        "software": "software"
    },
    {
        " packages have been written to support fuel management. This is an ongoing issue in reactor operations as no definitive solution to this problem has been found. Operators use a combination of ": null
    },
    {
        "computation": "computation"
    },
    {
        "al and ": null
    },
    {
        "empirical": "empirical"
    },
    {
        " techniques to manage this problem.          Used nuclear fuel is studied in ": null
    },
    {
        "Post irradiation examination": "post irradiation examination"
    },
    {
        ", where used fuel is examined to know more about the processes that occur in fuel during use, and how these might alter the outcome of an accident. For example, during normal use, the fuel expands due to thermal expansion, which can cause cracking. Most ": null
    },
    {
        "nuclear fuel": "nuclear fuel"
    },
    {
        " is uranium dioxide, which is a ": null
    },
    {
        "cubic": "cubic crystal system"
    },
    {
        " solid with a structure similar to that of ": null
    },
    {
        "calcium fluoride": "calcium fluoride"
    },
    {
        ". In used fuel the solid state structure of most of the solid remains the same as that of pure cubic uranium dioxide. SIMFUEL is the name given to the simulated spent fuel which is made by mixing finely ground metal oxides, grinding as a slurry, spray drying it before heating in hydrogen/argon to 42 o C. A good report on the microstructure of used fuel is Lucuta PG et al. J Nuclear Materials 42:4242 In SIMFUEL, 42% of the volume of the solid was in the form of metal ": null
    },
    {
        "nanoparticle": "nanoparticle"
    },
    {
        "s which are made of ": null
    },
    {
        "molybdenum": "molybdenum"
    },
    {
        ", ": null
    },
    {
        "ruthenium": "ruthenium"
    },
    {
        ", ": null
    },
    {
        "rhodium": "rhodium"
    },
    {
        " and ": null
    },
    {
        "palladium": "palladium"
    },
    {
        ". Most of these metal particles are of the ε phase  of Mo-Ru-Rh-Pd alloy, while smaller amounts of the α  and σ  phases of these metals were found in the SIMFUEL. Also present within the SIMFUEL was a cubic ": null
    },
    {
        "perovskite": "perovskite"
    },
    {
        " phase which is a ": null
    },
    {
        "barium": "barium"
    },
    {
        " strontium": "strontium"
    },
    {
        " zirconate": "zirconium"
    },
    {
        " .          Uranium dioxide is very insoluble in water, but after oxidation it can be converted to uranium trioxide or another uranium compound which is much more soluble. Uranium dioxide can be oxidised to an oxygen rich hyperstoichiometric oxide which can be further oxidised to U 42 O 42 , U 42 O 42 , U 42 O 42 and UO 42 .42H 42 O.     Because used fuel contains alpha emitters , the effect of adding an alpha emitter to uranium dioxide on the leaching rate of the oxide has been investigated. For the crushed oxide, adding 42 Pu tended to increase the rate of leaching, but the difference in the leaching rate between 42 and 42% 42 Pu was very small. V.V. Rondinella VV et al. Radiochimica Acta 42:42–42     The concentration of ": null
    },
    {
        "carbonate": "carbonate"
    },
    {
        " in the water which is in contact with the used fuel has a considerable effect on the rate of corrosion, because ": null
    },
    {
        "uranium": "uranium"
    },
    {
        " forms soluble anionic carbonate complexes such as 42− and 42− . When carbonate ions are absent, and the water is not strongly acidic, the hexavalent uranium compounds which form on oxidation of ": null
    },
    {
        "uranium dioxide": "uranium dioxide"
    },
    {
        " often form insoluble hydrated ": null
    },
    {
        "uranium trioxide": "uranium trioxide"
    },
    {
        " phases. For a review of the corrosion of uranium dioxide in a waste store which explains much of the chemistry, see Shoesmith DW J Nuclear Materials 42:42–42     Thin films of uranium dioxide can be deposited upon gold surfaces by ‘": null
    },
    {
        "sputtering": "sputtering"
    },
    {
        "’ using uranium metal and an ": null
    },
    {
        "argon": "argon"
    },
    {
        "/": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        " gas mixture. These gold surfaces modified with uranium dioxide have been used for both ": null
    },
    {
        "cyclic voltammetry": "cyclic voltammetry"
    },
    {
        " and ": null
    },
    {
        "AC impedance": "ac impedance"
    },
    {
        " experiments, and these offer an insight into the likely leaching behaviour of uranium dioxide. Miserque F et al. J Nuclear Materials 42:42–42       The study of the nuclear fuel cycle includes the study of the behaviour of nuclear materials both under normal conditions and under accident conditions. For example, there has been much work on how ": null
    },
    {
        "uranium dioxide": "uranium dioxide"
    },
    {
        " based fuel interacts with the ": null
    },
    {
        "zirconium": "zirconium"
    },
    {
        " alloy tubing used to cover it. During use, the fuel swells due to ": null
    },
    {
        "thermal expansion": "thermal expansion"
    },
    {
        " and then starts to react with the surface of the zirconium alloy, forming a new layer which contains both fuel and zirconium . Then, on the fuel side of this mixed layer, there is a layer of fuel which has a higher ": null
    },
    {
        "caesium": "caesium"
    },
    {
        " to ": null
    },
    {
        "uranium": "uranium"
    },
    {
        " ratio than most of the fuel. This is because ": null
    },
    {
        "xenon": "xenon"
    },
    {
        " isotopes are formed as ": null
    },
    {
        "fission products": "fission products"
    },
    {
        " that diffuse out of the lattice of the fuel into voids such as the narrow gap between the fuel and the cladding. After diffusing into these voids, it decays to caesium isotopes. Because of the thermal gradient which exists in the fuel during use, the volatile fission products tend to be driven from the centre of the pellet to the rim area. Further reading on fuel cladding interactions: Tanaka K et al. J Nuclear Materials 42:42–42 Below is a graph of the temperature of uranium metal, uranium nitride and ": null
    },
    {
        "uranium dioxide": "uranium dioxide"
    },
    {
        " as a function of distance from the centre of a 42  mm diameter pellet with a rim temperature of 42 o C. The uranium dioxide will overheat at the centre of the pellet, while the other more thermally conductive forms of uranium remain below their melting points.              The nuclear chemistry associated with the nuclear fuel cycle can be divided into two main areas; one area is concerned with operation under the intended conditions while the other area is concerned with maloperation conditions where some alteration from the normal operating conditions has occurred or  an accident is occurring.     The releases of radioactivity from normal operations are the small planned releases from uranium ore processing, enrichment, power reactors, reprocessing plants and waste stores. These can be in different chemical/physical form from releases which could occur under accident conditions. In addition the isotope signature of a hypothetical accident may be very different from that of a planned normal operational discharge of radioactivity to the environment.     Just because a radioisotope is released it does not mean it will enter a human and then cause harm. For instance, the migration of radioactivity can be altered by the binding of the radioisotope to the surfaces of soil particles. For example, ": null
    },
    {
        "caesium": "caesium"
    },
    {
        " binds tightly to clay minerals such as ": null
    },
    {
        "illite": "illite"
    },
    {
        " and ": null
    },
    {
        "montmorillonite": "montmorillonite"
    },
    {
        ", hence it remains in the upper layers of soil where it can be accessed by plants with shallow roots . Hence grass and mushrooms can carry a considerable amount of 42 Cs which can be transferred to humans through the food chain. But 42 Cs is not able to migrate quickly through most soils and thus is unlikely to contaminate ": null
    },
    {
        "well": "water well"
    },
    {
        " water. Colloids of soil minerals can migrate through soil so simple binding of a metal to the surfaces of soil particles does not completely fix the metal.     According to Jiří Hálas ": null
    },
    {
        "text book": "text book"
    },
    {
        ", the distribution coefficient K d is the ratio of the soils radioactivity to that of the soil water . If the radioisotope is tightly bound to the minerals in the soil, then less radioactivity can be absorbed by crops and ": null
    },
    {
        "grass": "grass"
    },
    {
        " growing on the soil.     ": null
    },
    {
        "Cs42": "cs-137"
    },
    {
        " K d 42   ": null
    },
    {
        "Pu42": "plutonium"
    },
    {
        " K d 42 to 42   ": null
    },
    {
        "Sr42": "strontium"
    },
    {
        " K d 42 to 42   ": null
    },
    {
        "I42": "iodine"
    },
    {
        " K d 42 to 42     In dairy farming, one of the best countermeasures against 42 Cs is to mix up the soil by deeply ploughing the soil. This has the effect of putting the 42 Cs out of reach of the shallow roots of the grass, hence the level of radioactivity in the grass will be lowered. Also after a nuclear war or serious accident, the removal of top few cm of soil and its burial in a shallow trench will reduce the long-term gamma dose to humans due to 42 Cs, as the gamma photons will be attenuated by their passage through the soil.     Even after the radioactive element arrives at the roots of the plant, the metal may be rejected by the biochemistry of the plant. The details of the uptake of 42 Sr and 42 Cs into ": null
    },
    {
        "sunflower": "sunflower"
    },
    {
        "s grown under ": null
    },
    {
        "hydroponic": "hydroponic"
    },
    {
        " conditions has been reported. P. Soudek, Š. Valenová, Z. Vavříková and T. Vaněk, Journal of Environmental Radioactivity, 42 42, 42–42 The caesium was found in the leaf veins, in the stem and in the ": null
    },
    {
        "apical": "apical meristem"
    },
    {
        " leaves. It was found that 42% of the caesium entered the plant, and 42% of the strontium. This paper also reports details of the effect of ": null
    },
    {
        "potassium": "potassium"
    },
    {
        ", ": null
    },
    {
        "ammonium": "ammonium"
    },
    {
        " and ": null
    },
    {
        "calcium": "calcium"
    },
    {
        " ions on the uptake of the radioisotopes.     In ": null
    },
    {
        "livestock": "livestock"
    },
    {
        " farming, an important countermeasure against 42 Cs is to feed animals a small amount of ": null
    },
    {
        "Prussian blue": "prussian blue"
    },
    {
        ". This ": null
    },
    {
        "iron": "iron"
    },
    {
        " potassium ": null
    },
    {
        "cyanide": "cyanide"
    },
    {
        " compound acts as an ": null
    },
    {
        "ion-exchanger": "ion-exchanger"
    },
    {
        ". The cyanide is so tightly bonded to the iron that it is safe for a human to eat several grams of Prussian blue per day. The Prussian blue reduces the ": null
    },
    {
        "biological half-life": "biological half-life"
    },
    {
        "  of the caesium. The physical or nuclear half-life of 42 Cs is about 42 years. This is a constant which can not be changed but the biological half-life is not a constant. It will change according to the nature and habits of the organism for which it is expressed. Caesium in humans normally has a biological half-life of between one and four months. An added advantage of the Prussian blue is that the caesium which is stripped from the animal in the ": null
    },
    {
        "droppings": "feces"
    },
    {
        " is in a form which is not available to plants. Hence it prevents the caesium from being recycled. The form of Prussian blue required for the treatment of humans or animals is a special grade. Attempts to use the ": null
    },
    {
        "pigment": "pigment"
    },
    {
        " grade used in ": null
    },
    {
        "paint": "paint"
    },
    {
        "s have not been successful. Note that a good source of data on the subject of caesium in ": null
    },
    {
        "Chernobyl": "chernobyl disaster"
    },
    {
        " fallout exists at  .         The IAEA assume that under normal operation the coolant of a water-cooled reactor will contain some radioactivity Generic Assessment Procedures for Determining Protective Actions During a Reactor Accident, IAEA-TECDOC42 42 p. 42 but during a reactor accident the coolant radioactivity level may rise. The IAEA states that under a series of different conditions different amounts of the core inventory can be released from the fuel, the four conditions the IAEA consider are normal operation, a spike in coolant activity due to a sudden shutdown/loss of pressure , a cladding failure resulting in the release of the activity in the fuel/cladding gap or a melting of the core . Generic Assessment Procedures for Determining Protective Actions During a Reactor Accident, IAEA-TECDOC42 42 p. 42     Based upon the assumption that a Pressurized water reactor contains 42 tons of ": null
    },
    {
        "water": "water"
    },
    {
        ", and that the activity of the fuel of a 42 GWe reactor is as the IAEA predicts, Generic Assessment Procedures for Determining Protective Actions During a Reactor Accident, IAEA-TECDOC42 42 p. 42 then the coolant activity after an accident such as the ": null
    },
    {
        "Three Mile Island accident": "three mile island accident"
    },
    {
        " can be predicted.     ": null
    },
    {
        "iodine": "iodine"
    },
    {
        " isotopes to decay away. In one experiment in the US, fresh fuel which had not been allowed to decay was reprocessed  to investigate the effects of a large iodine release from the reprocessing of short cooled fuel. It is normal in reprocessing plants to scrub the off gases from the dissolver to prevent the emission of iodine. In addition to the emission of iodine the ": null
    },
    {
        "noble gas": "noble gas"
    },
    {
        "es and ": null
    },
    {
        "tritium": "tritium"
    },
    {
        " are released from the fuel when it is dissolved. It has been proposed that by voloxidation the majority of the tritium can be recovered from the fuel.     A paper was written on the radioactivity in ": null
    },
    {
        "oyster": "oyster"
    },
    {
        "s found in the ": null
    },
    {
        "Irish Sea": "irish sea"
    },
    {
        ". A. Preston, J.W.R. Dutton and B.R. Harvey, Nature, 42 42, 42–42 These were found by gamma spectroscopy to contain 42 Ce, 42 Ce, 42 Ru, 42 Ru, 42 Cs, 42 Zr and 42 Nb. Additionally, a zinc activation product was found, which is thought to be due to the corrosion of ": null
    },
    {
        "magnox": "magnox"
    },
    {
        " fuel cladding in ": null
    },
    {
        "spent fuel pool": "spent fuel pool"
    },
    {
        "s. It is likely that the modern releases of all these isotopes from the ": null
    },
    {
        "Windscale": "sellafield"
    },
    {
        " event is smaller.       Some reactor designs, such as ": null
    },
    {
        "RBMK": "rbmk"
    },
    {
        "s or ": null
    },
    {
        "CANDU reactor": "candu reactor"
    },
    {
        "s, can be refueled without being shut down. This is achieved through the use of many small pressure tubes to contain the fuel and coolant, as opposed to one large pressure vessel as in ": null
    },
    {
        "pressurized water reactor": "pressurized water reactor"
    },
    {
        " or ": null
    },
    {
        "boiling water reactor": "boiling water reactor"
    },
    {
        " designs. Each tube can be individually isolated and refueled by an operator-controlled fueling machine, typically at a rate of up to 42 channels per day out of roughly 42 in CANDU reactors. On-load refueling allows for the optimal fuel reloading problem to be dealt with continuously, leading to more efficient use of fuel. This increase in efficiency is partially offset by the added complexity of having hundreds of pressure tubes and the fueling machines to service them.       After its operating cycle, the reactor is shut down for refueling. The fuel discharged at that time is stored either at the reactor site  or potentially in a common facility away from reactor sites. If on-site pool storage capacity is exceeded, it may be desirable to store the now cooled aged fuel in modular dry storage facilities known as Independent Spent Fuel Storage Installations at the reactor site or at a facility away from the site. The spent fuel rods are usually stored in water or boric acid, which provides both cooling  and shielding to protect the environment from residual ": null
    },
    {
        "ionizing radiation": "ionizing radiation"
    },
    {
        ", although after at least a year of cooling they may be moved to ": null
    },
    {
        "dry cask storage": "dry cask storage"
    },
    {
        ".                        Spent fuel discharged from reactors contains appreciable quantities of fissile , fertile , and other ": null
    },
    {
        "radioactive": "radioactive"
    },
    {
        " materials, including ": null
    },
    {
        "reaction poisons": "nuclear poison"
    },
    {
        ", which is why the fuel had to be removed. These fissile and fertile materials can be chemically separated and recovered from the spent fuel. The recovered uranium and plutonium can, if economic and institutional conditions permit, be recycled for use as nuclear fuel. This is currently not done for civilian spent nuclear fuel in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ".     Mixed oxide, or ": null
    },
    {
        "MOX fuel": "mox fuel"
    },
    {
        ", is a blend of ": null
    },
    {
        "reprocessed uranium": "reprocessed uranium"
    },
    {
        " and plutonium and depleted uranium which behaves similarly, although not identically, to the enriched uranium feed for which most nuclear reactors were designed. MOX fuel is an alternative to low-enriched uranium fuel used in the light water reactors which predominate nuclear power generation.     Currently, plants in Europe are reprocessing spent fuel from utilities in Europe and Japan. Reprocessing of spent commercial-reactor nuclear fuel is currently not permitted in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " due to the perceived danger of ": null
    },
    {
        "nuclear proliferation": "nuclear proliferation"
    },
    {
        ". The ": null
    },
    {
        "Bush Administrations": "presidency of george w. bush"
    },
    {
        " Global Nuclear Energy Partnership": "global nuclear energy partnership"
    },
    {
        " proposed that the U.S. form an international partnership to see spent nuclear fuel reprocessed in a way that renders the plutonium in it usable for nuclear fuel but not for ": null
    },
    {
        "nuclear weapon": "nuclear weapon"
    },
    {
        "s.       As an alternative to the disposal of the ": null
    },
    {
        "PUREX raffinate": "purex raffinate"
    },
    {
        " in ": null
    },
    {
        "glass": "glass"
    },
    {
        " or ": null
    },
    {
        "Synroc": "synroc"
    },
    {
        " matrix, the most ": null
    },
    {
        "radiotoxic": "radiotoxic"
    },
    {
        " elements could be removed through advanced reprocessing. After separation, the ": null
    },
    {
        "minor actinides": "minor actinides"
    },
    {
        " and some long-lived ": null
    },
    {
        "fission product": "fission product"
    },
    {
        "s could be converted to short-lived or stable ": null
    },
    {
        "isotope": "isotope"
    },
    {
        "s by either ": null
    },
    {
        "neutron": "neutron"
    },
    {
        " or ": null
    },
    {
        "photon": "photon"
    },
    {
        " irradiation. This is called ": null
    },
    {
        "transmutation": "nuclear transmutation"
    },
    {
        ". Strong and long-term international cooperation, and many decades of research and huge investments remain necessary before to reach a mature industrial scale where the safety and the economical feasibility of partitioning and transmutation could be demonstrated.              A current concern in the nuclear power field is the safe disposal and isolation of either ": null
    },
    {
        "spent fuel from reactors": "spent nuclear fuel"
    },
    {
        " or, if the reprocessing option is used, wastes from reprocessing plants. These materials must be isolated from the ": null
    },
    {
        "biosphere": "biosphere"
    },
    {
        " until the radioactivity contained in them has diminished to a safe level. M. I. Ojovan, W.E. Lee. An Introduction to Nuclear Waste Immobilisation, Elsevier Science Publishers B.V., , Amsterdam, 42 pp. . In the U.S., under the ": null
    },
    {
        "Nuclear Waste Policy Act": "nuclear waste policy act"
    },
    {
        " of 42 as amended, the ": null
    },
    {
        "Department of Energy": "united states department of energy"
    },
    {
        " has responsibility for the development of the waste disposal system for spent nuclear fuel and high-level radioactive waste. Current plans call for the ultimate disposal of the wastes in solid form in a licensed deep, stable geologic structure called a ": null
    },
    {
        "deep geological repository": "deep geological repository"
    },
    {
        ". The Department of Energy chose ": null
    },
    {
        "Yucca Mountain": "yucca mountain nuclear waste repository"
    },
    {
        " as the location for the repository. Its opening has been repeatedly delayed. Since 42 thousands of nuclear waste shipments have been stored at the ": null
    },
    {
        "Waste Isolation Pilot Plant": "waste isolation pilot plant"
    },
    {
        " in New Mexico.     ": null
    },
    {
        "Fast-neutron reactor": "fast-neutron reactor"
    },
    {
        "s can fission all actinides, while the ": null
    },
    {
        "thorium fuel cycle": "thorium fuel cycle"
    },
    {
        " produces low levels of ": null
    },
    {
        "transuranic": "transuranic"
    },
    {
        "s. Unlike LWRs, in principle these fuel cycles could recycle their ": null
    },
    {
        "plutonium": "plutonium"
    },
    {
        " and ": null
    },
    {
        "minor actinides": "minor actinides"
    },
    {
        " and leave only ": null
    },
    {
        "fission product": "fission product"
    },
    {
        "s and ": null
    },
    {
        "activation product": "activation product"
    },
    {
        "s as waste. The highly radioactive ": null
    },
    {
        "medium-lived fission product": "medium-lived fission product"
    },
    {
        "s ": null
    },
    {
        "Cs42": "cs-137"
    },
    {
        " and ": null
    },
    {
        "Sr42": "sr-90"
    },
    {
        " diminish by a factor of 42 each century; while the ": null
    },
    {
        "long-lived fission product": "long-lived fission product"
    },
    {
        "s have relatively low radioactivity, often compared favorably to that of the original uranium ore.       Although the most common terminology is fuel cycle, some argue that the term fuel chain is more accurate, because the spent fuel is never fully recycled. Spent fuel includes ": null
    },
    {
        "fission products": "fission products"
    },
    {
        ", which generally must be treated as ": null
    },
    {
        "waste": "radioactive waste"
    },
    {
        ", as well as uranium, plutonium, and other transuranic elements. Where plutonium is recycled, it is normally reused once in light water reactors, although fast reactors could lead to more complete recycling of plutonium.           Not a cycle per se, fuel is used once and then sent to storage without further processing save additional packaging to provide for better isolation from the ": null
    },
    {
        "biosphere": "biosphere"
    },
    {
        ". This method is favored by six countries: the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", ": null
    },
    {
        "Canada": "canada"
    },
    {
        ", ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", ": null
    },
    {
        "Finland": "finland"
    },
    {
        ", ": null
    },
    {
        "Spain": "spain"
    },
    {
        " and ": null
    },
    {
        "South Africa": "south africa"
    },
    {
        ".  Some countries, notably Finland, Sweden and Canada, have designed repositories to permit future recovery of the material should the need arise, while others plan for permanent sequestration in a ": null
    },
    {
        "geological repository": "geological repository"
    },
    {
        " like the ": null
    },
    {
        "Yucca Mountain nuclear waste repository": "yucca mountain nuclear waste repository"
    },
    {
        " in the United States.                   Several countries, including Japan, Switzerland, and previously Spain and Germany, are using or have used the ": null
    },
    {
        "reprocessing": "nuclear reprocessing"
    },
    {
        " services offered by ": null
    },
    {
        "BNFL": "bnfl"
    },
    {
        " and ": null
    },
    {
        "COGEMA": "areva nc"
    },
    {
        ". Here, the ": null
    },
    {
        "fission product": "fission product"
    },
    {
        "s, ": null
    },
    {
        "minor actinides": "minor actinides"
    },
    {
        ", ": null
    },
    {
        "activation product": "activation product"
    },
    {
        "s, and ": null
    },
    {
        "reprocessed uranium": "reprocessed uranium"
    },
    {
        " are separated from the reactor-grade ": null
    },
    {
        "plutonium": "plutonium"
    },
    {
        ", which can then be fabricated into ": null
    },
    {
        "MOX fuel": "mox fuel"
    },
    {
        ". Because the proportion of the non-": null
    },
    {
        "fissile": "fissile"
    },
    {
        " even": "even and odd numbers"
    },
    {
        "-": null
    },
    {
        "mass": "atomic mass"
    },
    {
        " isotopes of plutonium": "isotopes of plutonium"
    },
    {
        " rises with each pass through the cycle, there are currently no plans to reuse plutonium from used MOX fuel for a third pass in a ": null
    },
    {
        "thermal reactor": "thermal reactor"
    },
    {
        ". If ": null
    },
    {
        "fast reactor": "fast reactor"
    },
    {
        "s become available, they may be able to burn these, or almost any other ": null
    },
    {
        "actinide": "actinide"
    },
    {
        " isotope": "isotope"
    },
    {
        "s.     The use of a medium-scale ": null
    },
    {
        "reprocessing": "nuclear reprocessing"
    },
    {
        " facility onsite, and the use of ": null
    },
    {
        "pyroprocessing": "pyroprocessing"
    },
    {
        " rather than the present day aqueous reprocessing, is claimed to considerably reduce the ": null
    },
    {
        "proliferation": "nuclear proliferation"
    },
    {
        " potential or possible diversion of fissile material as the processing facility is ": null
    },
    {
        "in-situ": "in-situ"
    },
    {
        "/integral. Similarly as plutonium is not separated on its own in the pyroprocessing cycle, rather all actinides are ": null
    },
    {
        "electro-won": "electrowinning"
    },
    {
        " or refined from the spent fuel, the plutonium is never separated on its own, instead it comes over into the new fuel mixed with gamma and alpha emitting actinides, species that self-protect it in numerous possible thief scenarios.       It has been proposed that in addition to the use of plutonium, the ": null
    },
    {
        "minor actinide": "minor actinide"
    },
    {
        "s could be used in a critical power reactor. Tests are already being conducted in which ": null
    },
    {
        "americium": "americium"
    },
    {
        " is being used as a fuel.      A number of reactor designs, like the ": null
    },
    {
        "Integral Fast Reactor": "integral fast reactor"
    },
    {
        ", have been designed for this rather different fuel cycle. In principle, it should be possible to derive energy from the fission of any actinide nucleus. With a careful reactor design, all the actinides in the fuel can be consumed, leaving only lighter elements with short ": null
    },
    {
        "half-lives": "half-life"
    },
    {
        ". Whereas this has been done in prototype plants, no such reactor has ever been operated on a large scale.     It so happens that the ": null
    },
    {
        "neutron cross-section": "neutron cross-section"
    },
    {
        " of many actinides decreases with increasing neutron energy, but the ratio of fission to simple activation  changes in favour of fission as the neutron energy increases. Thus with a sufficiently high neutron energy, it should be possible to destroy even curium without the generation of the transcurium metals. This could be very desirable as it would make it significantly easier to reprocess and handle the actinide fuel.     One promising alternative from this perspective is an ": null
    },
    {
        "accelerator-driven sub-critical reactor": "accelerator-driven sub-critical reactor"
    },
    {
        " / ": null
    },
    {
        "subcritical reactor": "subcritical reactor"
    },
    {
        ". Here a beam of either ": null
    },
    {
        "proton": "proton"
    },
    {
        "s    or ": null
    },
    {
        "electron": "electron"
    },
    {
        "s  is directed into a target. In the case of protons, very fast neutrons will spall off the target, while in the case of the electrons, very high energy ": null
    },
    {
        "photon": "photon"
    },
    {
        "s will be generated. These high-energy neutrons and photons will then be able to cause the fission of the heavy actinides.     Such reactors compare very well to other neutron sources in terms of neutron energy:     Thermal 42 to 42  eV   Epithermal 42  eV to 42  keV   Fast  42  keV to 42  MeV   DD ": null
    },
    {
        "fusion": "nuclear fusion"
    },
    {
        " 42  MeV   DT fusion 42  MeV   Accelerator driven core 42  MeV    ": null
    },
    {
        "Muon-catalyzed fusion": "muon-catalyzed fusion"
    },
    {
        " 42  GeV.     As an alternative, the curium42 with a half-life of 42 years, could be left to decay into plutonium42 before being used in fuel in a fast reactor.            To date the nature of the fuel for actinide transformation has not been chosen.     If actinides are transmuted in a ": null
    },
    {
        "Subcritical reactor": "subcritical reactor"
    },
    {
        ", it is likely that the fuel will have to be able to tolerate more thermal cycles than conventional fuel. An accelerator-driven sub-critical reactor is unlikely to be able to maintain a constant operation period for equally long times as a critical reactor, and each time the accelerator stops then the fuel will cool down.     On the other hand, if actinides are destroyed using a fast reactor, such as an ": null
    },
    {
        "Integral Fast Reactor": "integral fast reactor"
    },
    {
        ", then the fuel will most likely not be exposed to many more thermal cycles than in a normal power station.     Depending on the matrix the process can generate more transuranics from the matrix. This could either be viewed as good or can be viewed as bad . A series of different matrices exists which can control this production of heavy actinides.     Fissile nuclei, like Uranium42 Plutonium42 and Uranium42 respond well to ": null
    },
    {
        "delayed neutrons": "delayed neutrons"
    },
    {
        " and are thus important to keep a critical reactor stable, and this limits the amount of minor actinides that can be destroyed in a critical reactor. As a consequence, it is important that the chosen matrix allows the reactor to keep the ratio of fissile to non-fissile nuclei high, as this enables it to destroy the long-lived actinides safely. In contrast, the power output of a sub-critical reactor is limited by the intensity of the driving particle accelerator, and thus it need not contain any uranium or plutonium at all. In such a system, it may be preferable to have an inert matrix that doesnt produce additional long-lived isotopes.     ": null
    },
    {
        "alloy": "alloy"
    },
    {
        " of actinides in a solid such as ": null
    },
    {
        "zirconia": "zirconia"
    },
    {
        " could be used.     ": null
    },
    {
        "Thorium": "thorium"
    },
    {
        " will on neutron bombardment form ": null
    },
    {
        "uranium42": "uranium-233"
    },
    {
        ". U42 is fissile, and has a larger fission cross section than both U42 and U42 and thus it is far less likely to produce higher actinides through neutron capture.     ": null
    },
    {
        "plutonium42": "plutonium-239"
    },
    {
        ". An advantage of mixing the actinides with uranium and plutonium is that the large fission cross sections of U42 and Pu42 for the less energetic ": null
    },
    {
        "delayed-neutrons": "delayed-neutrons"
    },
    {
        " could make the reaction stable enough to be carried out in a critical ": null
    },
    {
        "fast reactor": "fast reactor"
    },
    {
        ", which is likely to be both cheaper and simpler than an accelerator driven system.        In the thorium fuel cycle ": null
    },
    {
        "thorium42": "thorium-232"
    },
    {
        " absorbs a ": null
    },
    {
        "neutron": "neutron"
    },
    {
        " in either a fast or thermal reactor. The thorium42 ": null
    },
    {
        "beta decay": "beta decay"
    },
    {
        "s to ": null
    },
    {
        "protactinium": "protactinium"
    },
    {
        "42 and then to ": null
    },
    {
        "uranium42": "uranium-233"
    },
    {
        ", which in turn is used as fuel. Hence, like ": null
    },
    {
        "uranium42": "uranium-238"
    },
    {
        ", thorium42 is a ": null
    },
    {
        "fertile material": "fertile material"
    },
    {
        ".   : \\overset + ^_Th - ": null
    }
]