[
    {
        "               Nuclear fusion is a ": null
    },
    {
        "reaction": "nuclear reaction"
    },
    {
        " in which two or more ": null
    },
    {
        "atomic nuclei": "atomic nuclei"
    },
    {
        " are combined to form one or more different atomic nuclei and subatomic particles . The difference in mass between the reactants and products is manifested as either the release or absorption of ": null
    },
    {
        "energy": "energy"
    },
    {
        ". This difference in mass arises due to the difference in atomic ": null
    },
    {
        "binding energy": "nuclear binding energy"
    },
    {
        " between the atomic nuclei before and after the reaction. Fusion is the process that powers active or ": null
    },
    {
        "main sequence": "main sequence"
    },
    {
        " star": "star"
    },
    {
        "s, or other ": null
    },
    {
        "high magnitude": "absolute magnitude"
    },
    {
        " stars.     A fusion process that produces a nucleus lighter than ": null
    },
    {
        "iron-56": "iron-56"
    },
    {
        " or ": null
    },
    {
        "nickel-62": "nickel-62"
    },
    {
        " will generally yield a net energy release. These elements have the smallest mass per nucleon and the largest ": null
    },
    {
        "binding energy": "binding energy"
    },
    {
        " per ": null
    },
    {
        "nucleon": "nucleon"
    },
    {
        ", respectively. Fusion of light elements toward these releases energy , while a fusion producing nuclei heavier than these elements will result in energy retained by the resulting nucleons, and the resulting reaction is ": null
    },
    {
        "endothermic": "endothermic"
    },
    {
        ". The opposite is true for the reverse process, ": null
    },
    {
        "nuclear fission": "nuclear fission"
    },
    {
        ". This means that the lighter elements, such as hydrogen and ": null
    },
    {
        "helium": "helium fusion"
    },
    {
        ", are in general more fusible; while the heavier elements, such as ": null
    },
    {
        "uranium": "uranium 235"
    },
    {
        ", ": null
    },
    {
        "thorium": "thorium"
    },
    {
        " and ": null
    },
    {
        "plutonium": "plutonium 239"
    },
    {
        ", are more fissionable. The extreme ": null
    },
    {
        "astrophysical": "astrophysics"
    },
    {
        " event of a ": null
    },
    {
        "supernova": "supernova"
    },
    {
        " can produce enough energy to fuse nuclei into elements heavier than iron.     In 1920, ": null
    },
    {
        "Arthur Eddington": "arthur eddington"
    },
    {
        " suggested hydrogen-helium fusion could be the primary source of stellar energy. ": null
    },
    {
        "Quantum tunneling": "quantum tunneling"
    },
    {
        " was discovered by ": null
    },
    {
        "Friedrich Hund": "friedrich hund"
    },
    {
        " in 1929, and shortly afterwards ": null
    },
    {
        "Robert Atkinson": "robert descourt atkinson"
    },
    {
        " and ": null
    },
    {
        "Fritz Houtermans": "fritz houtermans"
    },
    {
        " used the measured masses of light elements to show that large amounts of energy could be released by fusing small nuclei. Building on the early experiments in ": null
    },
    {
        "nuclear transmutation": "nuclear transmutation"
    },
    {
        " by ": null
    },
    {
        "Ernest Rutherford": "ernest rutherford"
    },
    {
        ", laboratory fusion of ": null
    },
    {
        "hydrogen isotopes": "isotopes of hydrogen"
    },
    {
        " was accomplished by ": null
    },
    {
        "Mark Oliphant": "mark oliphant"
    },
    {
        " in 1932. In the remainder of that decade, the theory of the main cycle of nuclear fusion in stars was worked out by ": null
    },
    {
        "Hans Bethe": "hans bethe"
    },
    {
        ". Research into fusion for military purposes began in the early 1940s as part of the ": null
    },
    {
        "Manhattan Project": "manhattan project"
    },
    {
        ". Fusion was accomplished in 1951 with the ": null
    },
    {
        "Greenhouse Item": "greenhouse item"
    },
    {
        " nuclear test. Nuclear fusion on a large scale in an explosion was first carried out on 1 November 1952, in the ": null
    },
    {
        "Ivy Mike": "ivy mike"
    },
    {
        " hydrogen bomb": "hydrogen bomb"
    },
    {
        " test.     Research into developing controlled fusion inside ": null
    },
    {
        "fusion reactors": "fusion reactors"
    },
    {
        " has been ongoing since the 1940s, but the technology is still in its development phase.          The release of energy with the fusion of light elements is due to the interplay of two opposing forces: the ": null
    },
    {
        "nuclear force": "nuclear force"
    },
    {
        ", which combines together protons and neutrons, and the ": null
    },
    {
        "Coulomb force": "coulomb force"
    },
    {
        ", which causes protons to repel each other. Protons are positively charged and repel each other by the Coulomb force, but they can nonetheless stick together, demonstrating the existence of another, short-range, force referred to as nuclear attraction.  . Ck12.org. Retrieved on 2012-12-19. Light nuclei are sufficiently small and proton-poor allowing the nuclear force to overcome repulsion. This is because the nucleus is sufficiently small that all nucleons feel the short-range attractive force at least as strongly as they feel the infinite-range Coulomb repulsion. Building up nuclei from lighter nuclei by fusion releases the extra energy from the net attraction of particles. ": null
    },
    {
        "For larger nuclei": "iron peak"
    },
    {
        ", however, no energy is released, since the nuclear force is short-range and cannot continue to act across longer nuclear length scales. Thus, energy is not released with the fusion of such nuclei; instead, energy is required as input for such processes.     Fusion powers ": null
    },
    {
        "stars": "star"
    },
    {
        "and produces virtually all elements in a process called ": null
    },
    {
        "nucleosynthesis": "nucleosynthesis"
    },
    {
        ". The Sun is a main-sequence star, and, as such, generates its energy by nuclear fusion of hydrogen nuclei into helium. In its core, the Sun fuses 620 million metric tons of hydrogen and makes 606 million metric tons of helium each second.  The fusion of lighter elements in stars releases energy and the mass that always accompanies it. For example, in the fusion of two hydrogen nuclei to form helium, 0.7% of the mass is carried away in the form of kinetic energy of an ": null
    },
    {
        "alpha particle": "alpha particle"
    },
    {
        " or other forms of energy, such as electromagnetic radiation.      It takes considerable energy to force nuclei to fuse, even those of the lightest element, ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        ". When accelerated to high enough speeds, nuclei can overcome this electrostatic repulsion and brought close enough such that the attractive ": null
    },
    {
        "nuclear force": "nuclear force"
    },
    {
        " is greater than the repulsive Coulomb force. The ": null
    },
    {
        "strong force": "strong force"
    },
    {
        " grows rapidly once the nuclei are close enough, and the fusing nucleons can essentially fall into each other and the result is fusion and net energy produced. The fusion of lighter nuclei, which creates a heavier nucleus and often a ": null
    },
    {
        "free neutron": "free neutron"
    },
    {
        " or proton, generally releases more energy than it takes to force the nuclei together; this is an ": null
    },
    {
        "exothermic process": "exothermic reaction"
    },
    {
        " that can produce self-sustaining reactions.     Energy released in most ": null
    },
    {
        "nuclear reactions": "nuclear reaction"
    },
    {
        "is much larger than in ": null
    },
    {
        "chemical reaction": "chemical reaction"
    },
    {
        "s, because the ": null
    },
    {
        "binding energy": "binding energy"
    },
    {
        " that holds a nucleus together is greater than the energy that holds ": null
    },
    {
        "electrons": "electron"
    },
    {
        "to a nucleus. For example, the ": null
    },
    {
        "ionization energy": "ionization energy"
    },
    {
        " gained by adding an electron to a hydrogen nucleus is —less than one-millionth of the  released in the ": null
    },
    {
        "deuterium": "deuterium"
    },
    {
        "–": null
    },
    {
        "tritium": "tritium"
    },
    {
        " reaction shown in the adjacent diagram. Fusion reactions have an ": null
    },
    {
        "energy density": "energy density"
    },
    {
        " many times greater than ": null
    },
    {
        "nuclear fission": "nuclear fission"
    },
    {
        "; the reactions produce far greater energy per unit of mass even though individual fission reactions are generally much more energetic than individual fusion ones, which are themselves millions of times more energetic than chemical reactions. Only ": null
    },
    {
        "direct conversion": "direct energy conversion"
    },
    {
        " of ": null
    },
    {
        "mass into energy": "mass-energy equivalence"
    },
    {
        ", such as that caused by the ": null
    },
    {
        "annihilatory": "annihilation"
    },
    {
        " collision of ": null
    },
    {
        "matter": "matter"
    },
    {
        " and ": null
    },
    {
        "antimatter": "antimatter"
    },
    {
        ", is more energetic per unit of mass than nuclear fusion.      Research into using ": null
    },
    {
        "fusion": "fusion power"
    },
    {
        " for the production of electricity has been pursued for over 60 years. Successful accomplishment of controlled fusion has been stymied by scientific and technological difficulties; nonetheless, important progress has been made. At present, controlled fusion reactions have been unable to produce break-even controlled fusion.    The two most advanced approaches for it are magnetic confinement and inertial confinement .     Workable designs for a toroidal reactor that theoretically will deliver ten times more fusion energy than the amount needed to heat plasma to the required temperatures are in development . The ITER facility is expected to finish its construction phase in 2025. It will start commissioning the reactor that same year and initiate plasma experiments in 2025, but is not expected to begin full deuterium-tritium fusion until 2035.      The US ": null
    },
    {
        "National Ignition Facility": "national ignition facility"
    },
    {
        ", which uses laser-driven ": null
    },
    {
        "inertial confinement fusion": "inertial confinement fusion"
    },
    {
        ", was designed with a goal of ": null
    },
    {
        "break-even": "break-even"
    },
    {
        " fusion; the first large-scale laser target experiments were performed in June 2009 and ignition experiments began in early 2011.                   An important fusion process is the ": null
    },
    {
        "stellar nucleosynthesis": "stellar nucleosynthesis"
    },
    {
        " that powers ": null
    },
    {
        "stars": "star"
    },
    {
        "and the Sun. In the 20th century, it was recognized that the energy released from nuclear fusion reactions accounted for the longevity of stellar heat and light. The fusion of nuclei in a star, starting from its initial hydrogen and helium abundance, provides that energy and synthesizes new nuclei as a byproduct of the fusion process. Different reaction chains are involved, depending on the mass of the star .     Around 1920, ": null
    },
    {
        "Arthur Eddington": "arthur eddington"
    },
    {
        " anticipated the discovery and mechanism of nuclear fusion processes in ": null
    },
    {
        "star": "star"
    },
    {
        "s, in his paper The Internal Constitution of the Stars.   At that time, the source of stellar energy was a complete mystery; Eddington correctly speculated that the source was fusion of hydrogen into helium, liberating enormous energy according to ": null
    },
    {
        "Einsteins equation": "mass–energy_equivalence"
    },
    {
        " E mc 2 . This was a particularly remarkable development since at that time fusion and thermonuclear energy, and even that stars are largely composed of ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        " , had not yet been discovered. Eddingtons paper, based on knowledge at the time, reasoned that:     : The leading theory of stellar energy, the ": null
    },
    {
        "contraction hypothesis": "contraction hypothesis"
    },
    {
        ", should cause stars rotation to visibly speed up due to ": null
    },
    {
        "conservation of angular momentum": "conservation of angular momentum"
    },
    {
        ". But observations of ": null
    },
    {
        "Cepheid": "cepheid"
    },
    {
        " variable stars showed this was not happening.   : The only other known plausible source of energy was conversion of matter to energy; Einstein had shown some years earlier that a small amount of matter was equivalent to a large amount of energy.   : ": null
    },
    {
        "Francis Aston": "francis william aston"
    },
    {
        " had also recently shown that the mass of a ": null
    },
    {
        "helium": "helium"
    },
    {
        " atom was about 0.8% less than the mass of the four hydrogen atoms which would, combined, form a helium atom, suggesting that if such a combination could happen, it would release considerable energy as a byproduct.   : If a star contained just 5% of fusible hydrogen, it would suffice to explain how stars got their energy.   : Further elements might also be fused, and other scientists had speculated that stars were the crucible in which light elements combined to create heavy elements, but without more accurate measurements of their ": null
    },
    {
        "atomic mass": "atomic mass"
    },
    {
        "es nothing more could be said at the time.     All of these speculations were proven correct in the following decades.     The primary source of solar energy, and similar size stars, is the fusion of hydrogen to form helium , which occurs at a solar-core temperature of 14 million kelvin. The net result is the fusion of four ": null
    },
    {
        "protons": "proton"
    },
    {
        "into one ": null
    },
    {
        "alpha particle": "alpha particle"
    },
    {
        ", with the release of two ": null
    },
    {
        "positrons": "positron"
    },
    {
        "and two ": null
    },
    {
        "neutrinos": "neutrino"
    },
    {
        ", and energy. In heavier stars, the ": null
    },
    {
        "CNO cycle": "cno cycle"
    },
    {
        " and other processes are more important. As a star uses up a substantial fraction of its hydrogen, it begins to synthesize heavier elements. The heaviest elements are synthesized by fusion that occurs as a more massive star undergoes a violent ": null
    },
    {
        "supernova": "supernova"
    },
    {
        " at the end of its life, a process known as ": null
    },
    {
        "supernova nucleosynthesis": "supernova nucleosynthesis"
    },
    {
        ".         A substantial energy barrier of electrostatic forces must be overcome before fusion can occur. At large distances, two naked nuclei repel one another because of the repulsive ": null
    },
    {
        "electrostatic force": "electrostatic force"
    },
    {
        " between their ": null
    },
    {
        "positively charged": "electric charge"
    },
    {
        " protons. If two nuclei can be brought close enough together, however, the electrostatic repulsion can be overcome by the quantum effect in which nuclei can ": null
    },
    {
        "tunnel": "quantum tunnellingnuclear fusion in stars"
    },
    {
        " through coulomb forces.     When a ": null
    },
    {
        "nucleon": "nucleon"
    },
    {
        " such as a ": null
    },
    {
        "proton": "proton"
    },
    {
        " or ": null
    },
    {
        "neutron": "neutron"
    },
    {
        " is added to a nucleus, the nuclear force attracts it to all the other nucleons of the nucleus , but primarily to its immediate neighbours due to the short range of the force. The nucleons in the interior of a nucleus have more neighboring nucleons than those on the surface. Since smaller nuclei have a larger surface area-to-volume ratio, the binding energy per nucleon due to the ": null
    },
    {
        "nuclear force": "nuclear force"
    },
    {
        " generally increases with the size of the nucleus but approaches a limiting value corresponding to that of a nucleus with a diameter of about four nucleons. It is important to keep in mind that nucleons are ": null
    },
    {
        "quantum objects": "quantum physics"
    },
    {
        ". So, for example, since two neutrons in a nucleus are identical to each other, the goal of distinguishing one from the other, such as which one is in the interior and which is on the surface, is in fact meaningless, and the inclusion of quantum mechanics is therefore necessary for proper calculations.     The electrostatic force, on the other hand, is an ": null
    },
    {
        "inverse-square force": "inverse square law"
    },
    {
        ", so a proton added to a nucleus will feel an electrostatic repulsion from all the other protons in the nucleus. The electrostatic energy per nucleon due to the electrostatic force thus increases without limit as nuclei atomic number grows.          The net result of the opposing electrostatic and strong nuclear forces is that the binding energy per nucleon generally increases with increasing size, up to the elements ": null
    },
    {
        "iron": "iron"
    },
    {
        " and ": null
    },
    {
        "nickel": "nickel"
    },
    {
        ", and then decreases for heavier nuclei. Eventually, the ": null
    },
    {
        "binding energy": "binding energy"
    },
    {
        " becomes negative and very heavy nuclei are not stable. The four most tightly bound nuclei, in decreasing order of ": null
    },
    {
        "binding energy": "binding energy"
    },
    {
        " per nucleon, are , , , and . . Hyperphysics.phy-astr.gsu.edu. Retrieved on 2011-08-17. Even though the ": null
    },
    {
        "nickel isotope": "isotopes of nickel"
    },
    {
        ", , is more stable, the ": null
    },
    {
        "iron isotope": "isotopes of iron"
    },
    {
        "  is an ": null
    },
    {
        "order of magnitude": "order of magnitude"
    },
    {
        " more common. This is due to the fact that there is no easy way for stars to create  through the alpha process.     An exception to this general trend is the ": null
    },
    {
        "helium-4": "helium-4"
    },
    {
        " nucleus, whose binding energy is higher than that of ": null
    },
    {
        "lithium": "lithium"
    },
    {
        ", the next heaviest element. This is because protons and neutrons are ": null
    },
    {
        "fermion": "fermion"
    },
    {
        "s, which according to the ": null
    },
    {
        "Pauli exclusion principle": "pauli exclusion principle"
    },
    {
        " cannot exist in the same nucleus in exactly the same state. Each proton or neutrons energy state in a nucleus can accommodate both a spin up particle and a spin down particle. Helium-4 has an anomalously large binding energy because its nucleus consists of two protons and two neutrons , so all four of its nucleons can be in the ground state. Any additional nucleons would have to go into higher energy states. Indeed, the helium-4 nucleus is so tightly bound that it is commonly treated as a single quantum mechanical particle in nuclear physics, namely, the ": null
    },
    {
        "alpha particle": "alpha particle"
    },
    {
        ".     The situation is similar if two nuclei are brought together. As they approach each other, all the protons in one nucleus repel all the protons in the other. Not until the two nuclei actually come close enough for long enough so the strong ": null
    },
    {
        "nuclear force": "nuclear force"
    },
    {
        " can take over is the repulsive electrostatic force overcome. Consequently, even when the final energy state is lower, there is a large energy barrier that must first be overcome. It is called the ": null
    },
    {
        "Coulomb barrier": "coulomb barrier"
    },
    {
        ".     The Coulomb barrier is smallest for isotopes of hydrogen, as their nuclei contain only a single positive charge. A ": null
    },
    {
        "diproton": "diproton"
    },
    {
        " is not stable, so neutrons must also be involved, ideally in such a way that a helium nucleus, with its extremely tight binding, is one of the products.     Using ": null
    },
    {
        "deuterium–tritium": "tritiumdeuterium"
    },
    {
        " fuel, the resulting energy barrier is about 0.1  MeV. In comparison, the energy needed to remove an ": null
    },
    {
        "electron": "electron"
    },
    {
        " from ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        " is 13.6  eV, about 7500 times less energy. The result of the fusion is an unstable 5 He nucleus, which immediately ejects a neutron with 14.1  MeV. The recoil energy of the remaining 4 He nucleus is 3.5  MeV, so the total energy liberated is 17.6  MeV. This is many times more than what was needed to overcome the energy barrier.          The reaction ": null
    },
    {
        "cross section": "cross section"
    },
    {
        " is a measure of the probability of a fusion reaction as a function of the relative velocity of the two reactant nuclei. If the reactants have a distribution of velocities, e.g. a thermal distribution, then it is useful to perform an average over the distributions of the product of cross section and velocity. This average is called the reactivity, denoted . The reaction rate is times the product of the reactant number densities:     : f n_1 n_2 \\langle \\sigma v \\rangle.     If a species of nuclei is reacting with a nucleus like itself, such as the DD reaction, then the product n_1n_2 must be replaced by n^2/2 .     \\langle \\sigma v \\rangle increases from virtually zero at room temperatures up to meaningful magnitudes at temperatures of ": null
    },
    {
        "10": "1 e-15 j"
    },
    {
        "–": null
    },
    {
        "100": "1 e-14 j"
    },
    {
        "  keV. At these temperatures, well above typical ": null
    },
    {
        "ion": "ion"
    },
    {
        "ization energies , the fusion reactants exist in a ": null
    },
    {
        "plasma": "plasma physics"
    },
    {
        " state.     The significance of \\langle \\sigma v \\rangle as a function of temperature in a device with a particular energy ": null
    },
    {
        "confinement time": "confinement time"
    },
    {
        " is found by considering the ": null
    },
    {
        "Lawson criterion": "lawson criterion"
    },
    {
        ". This is an extremely challenging barrier to overcome on Earth, which explains why fusion research has taken many years to reach the current advanced technical state.                  If matter is sufficiently heated  and confined, fusion reactions may occur due to collisions with extreme thermal kinetic energies of the particles. Thermonuclear weapons produce what amounts to an uncontrolled release of ": null
    },
    {
        "fusion energy": "fusion energy"
    },
    {
        ". Controlled thermonuclear fusion concepts use magnetic fields to confine the plasma.          ": null
    },
    {
        "Inertial confinement fusion": "inertial confinement fusion"
    },
    {
        "  is a method aimed at releasing ": null
    },
    {
        "fusion energy": "fusion energy"
    },
    {
        " by heating and compressing a fuel target, typically a pellet containing ": null
    },
    {
        "deuterium": "deuterium"
    },
    {
        " and ": null
    },
    {
        "tritium": "tritium"
    },
    {
        ".            ": null
    },
    {
        "Inertial electrostatic confinement": "inertial electrostatic confinement"
    },
    {
        " is a set of devices that use an electric field to heat ions to fusion conditions. The most well known is the ": null
    },
    {
        "fusor": "fusor"
    },
    {
        ". Starting in 1999, a number of amateurs have been able to do amateur fusion using these homemade devices.     Other IEC devices include: the ": null
    },
    {
        "Polywell": "polywell"
    },
    {
        ", MIX POPS  and Marble concepts. The Multiple Ambipolar Recirculating Beam Line Experiment Poster presentation, 2011 US-Japan IEC conference, Dr. Alex Klein            If the energy to initiate the reaction comes from ": null
    },
    {
        "accelerating": "particle accelerator"
    },
    {
        " one of the nuclei, the process is called beam-target fusion; if both nuclei are accelerated, it is beam-beam fusion.     Accelerator-based light-ion fusion is a technique using particle accelerators to achieve particle kinetic energies sufficient to induce light-ion fusion reactions. Accelerating light ions is relatively easy, and can be done in an efficient manner—requiring only a vacuum tube, a pair of electrodes, and a high-voltage transformer; fusion can be observed with as little as 10 kV between the electrodes. The key problem with accelerator-based fusion is that fusion cross sections are many orders of magnitude lower than Coulomb interaction cross sections. Therefore, the vast majority of ions expend their energy emitting ": null
    },
    {
        "bremsstrahlung": "bremsstrahlung"
    },
    {
        " radiation and the ionization of atoms of the target. Devices referred to as sealed-tube ": null
    },
    {
        "neutron generators": "neutron generator"
    },
    {
        "are particularly relevant to this discussion. These small devices are miniature particle accelerators filled with deuterium and tritium gas in an arrangement that allows ions of those nuclei to be accelerated against hydride targets, also containing deuterium and tritium, where fusion takes place, releasing a flux of neutrons. Hundreds of neutron generators are produced annually for use in the petroleum industry where they are used in measurement equipment for locating and mapping oil reserves.     To overcome the problem of bremsstrahlung radiation in Beam-target fusion, a combinatorial approach has been suggested by Tri-Alpha and Helion energy companies, this method is based on interpenetration of two oppositely directed plasmoids. J. Slough, G. Votroubek, and C. Pihl, Creation of a high-temperature plasma through merging and compression of supersonic field reversed configuration plasmoids Nucl. Fusion 51,053008 . Theoretical works represent that by creating and warming two accelerated head-on colliding plasmoids up to some kilo electron volts thermal energy which is low in comparison with that of required for thermonuclear fusion, net fusion gain is possible even with aneutronic fuels such as p-": null
    },
    {
        " 11 B": "borondepleted boron"
    },
    {
        ". In order to attain the necessary conditions of break-even by this method the accelerated plasmoids must have enough colliding velocities of the order of some thousands of kilometers per second depending on the kind of fusion fuel. A. Asle Zaeem et al Aneutronic Fusion in Collision of Oppositely Directed Plasmoids Plasma Physics Reports, Vol. 44, No. 3, pp. 378–386 . In addition, the plasmoids density must be between the inertial and magnetic fusion criteria.       ": null
    },
    {
        "Muon-catalyzed fusion": "muon-catalyzed fusion"
    },
    {
        " is a fusion process that occurs at ordinary temperatures. It was studied in detail by ": null
    },
    {
        "Steven Jones": "steven e. jones"
    },
    {
        " in the early 1980s. Net energy production from this reaction has been unsuccessful because of the high energy required to create ": null
    },
    {
        "muon": "muon"
    },
    {
        "s, their short 2.2  µs ": null
    },
    {
        "half-life": "half-life"
    },
    {
        ", and the high chance that a muon will bind to the new ": null
    },
    {
        "alpha particle": "alpha particle"
    },
    {
        " and thus stop catalyzing fusion.             Some other confinement principles have been investigated.     ": null
    },
    {
        "Antimatter-initialized fusion": "antimatter catalyzed nuclear pulse propulsion"
    },
    {
        " uses small amounts of ": null
    },
    {
        "antimatter": "antimatter"
    },
    {
        " to trigger a tiny fusion explosion. This has been studied primarily in the context of making ": null
    },
    {
        "nuclear pulse propulsion": "nuclear pulse propulsion"
    },
    {
        ", and ": null
    },
    {
        "pure fusion bombs": "pure fusion bomb"
    },
    {
        "feasible. This is not near becoming a practical power source, due to the cost of manufacturing antimatter alone.     ": null
    },
    {
        "Pyroelectric fusion": "pyroelectric fusion"
    },
    {
        " was reported in April 2005 by a team at ": null
    },
    {
        "UCLA": "university of california, los angeles"
    },
    {
        ". The scientists used a ": null
    },
    {
        "pyroelectric": "pyroelectricity"
    },
    {
        " crystal heated from −34 to 7  °C , combined with a ": null
    },
    {
        "tungsten": "tungsten"
    },
    {
        " needle to produce an ": null
    },
    {
        "electric field": "electric field"
    },
    {
        " of about 25  gigavolts per meter to ionize and accelerate ": null
    },
    {
        "deuterium": "deuterium"
    },
    {
        " nuclei into an ": null
    },
    {
        "erbium": "erbium"
    },
    {
        " deuteride target. At the estimated energy levels, . Main article  the ": null
    },
    {
        "D-D fusion reaction": "nuclear fusion reactions"
    },
    {
        " may occur, producing ": null
    },
    {
        "helium-3": "helium-3"
    },
    {
        " and a 2.45  MeV ": null
    },
    {
        "neutron": "neutron"
    },
    {
        ". Although it makes a useful neutron generator, the apparatus is not intended for power generation since it requires far more energy than it produces. . Rodan.physics.ucla.edu. Retrieved on 2011-08-17.   . Christiansciencemonitor.com . Retrieved on 2011-08-17. . MSNBC . Retrieved on 2011-08-17.     ": null
    },
    {
        "Hybrid nuclear fusion-fission ": "nuclear fusion-fission hybrid"
    },
    {
        " is a proposed means of generating ": null
    },
    {
        "power": "electrical power industry"
    },
    {
        " by use of a combination of nuclear fusion and ": null
    },
    {
        "fission": "nuclear fission"
    },
    {
        " processes. The concept dates to the 1950s, and was briefly advocated by ": null
    },
    {
        "Hans Bethe": "hans bethe"
    },
    {
        " during the 1970s, but largely remained unexplored until a revival of interest in 2009, due to the delays in the realization of pure fusion.      ": null
    },
    {
        "Project PACER": "project pacer"
    },
    {
        ", carried out at ": null
    },
    {
        "Los Alamos National Laboratory": "los alamos national laboratory"
    },
    {
        " in the mid-1970s, explored the possibility of a fusion power system that would involve exploding small ": null
    },
    {
        "hydrogen bombs": "h-bomb"
    },
    {
        " inside an underground cavity. As an energy source, the system is the only fusion power system that could be demonstrated to work using existing technology. However it would also require a large, continuous supply of nuclear bombs, making the economics of such a system rather questionable.     ": null
    },
    {
        "Bubble fusion": "bubble fusion"
    },
    {
        "  also called sonofusion was a proposed mechanism for achieving fusion via ": null
    },
    {
        "sonic cavitation": "sonic cavitation"
    },
    {
        " which rose to prominence in the early 2000s. Subsequent attempts at replication failed and the principal investigator, ": null
    },
    {
        "Rusi Taleyarkhan": "rusi taleyarkhan"
    },
    {
        ", was judged guilty of ": null
    },
    {
        "research misconduct": "research misconduct"
    },
    {
        " in 2008.               At the temperatures and densities in stellar cores the rates of fusion reactions are notoriously slow. For example, at solar core temperature  and density , the energy release rate is only 276  μW/cm 3 —about a quarter of the volumetric rate at which a resting human body generates heat. . Fusedweb.pppl.gov . Retrieved on 2011-08-17.  Thus, reproduction of stellar core conditions in a lab for nuclear fusion power production is completely impractical. Because nuclear reaction rates depend on density as well as temperature and most fusion schemes operate at relatively low densities, those methods are strongly dependent on higher temperatures. The fusion rate as a function of temperature , leads to the need to achieve temperatures in terrestrial reactors 10–100 times higher temperatures than in stellar interiors: T ≈ 0.1–1.0×10 9 K.          In artificial fusion, the primary fuel is not constrained to be protons and higher temperatures can be used, so reactions with larger cross-sections are chosen. Another concern is the production of neutrons, which activate the reactor structure radiologically, but also have the advantages of allowing volumetric extraction of the fusion energy and ": null
    },
    {
        "tritium": "tritium"
    },
    {
        " breeding. Reactions that release no neutrons are referred to as ": null
    },
    {
        "aneutronic": "aneutronic fusion"
    },
    {
        ".     To be a useful energy source, a fusion reaction must satisfy several criteria. It must:     ;Be ": null
    },
    {
        "exothermic": "exothermic"
    },
    {
        ": This limits the reactants to the low Z side of the ": null
    },
    {
        "curve of binding energy": "nuclear binding energynuclear binding energy curve"
    },
    {
        ". It also makes helium  the most common product because of its extraordinarily tight binding, although  and  also show up.   ;Involve low atomic number  nuclei: This is because the electrostatic repulsion that must be overcome before the nuclei are close enough to fuse is directly related to the number of protons it contains - its atomic number.   ;Have two reactants: At anything less than stellar densities, three body collisions are too improbable. In inertial confinement, both stellar densities and temperatures are exceeded to compensate for the shortcomings of the third parameter of the Lawson criterion, ICFs very short confinement time.   ;Have two or more products: This allows simultaneous conservation of energy and momentum without relying on the electromagnetic force.   ;Conserve both protons and neutrons: The cross sections for the weak interaction are too small.     Few reactions meet these criteria. The following are those with the largest cross sections:       :        For reactions with two products, the energy is divided between them in inverse proportion to their masses, as shown. In most reactions with three products, the distribution of energy varies. For reactions that can result in more than one set of products, the branching ratios are given.     Some reaction candidates can be eliminated at once. The D- 6 Li reaction has no advantage compared to ": null
    },
    {
        "p + ": "proton"
    },
    {
        "- because it is roughly as difficult to burn but produces substantially more neutrons through - side reactions. There is also a ": null
    },
    {
        "p + ": "proton"
    },
    {
        "- reaction, but the cross section is far too low, except possibly when T i ": null
    },
    {
        "up /su": "up  /su"
    },
    {
        " !-- Autogenerated using Phykiformulae 0.10 by ": null
    },
    {
        "User:SkyLined": "user:skylined"
    },
    {
        "    +  - ": null
    }
]