[
    {
        "Nucleosynthesis is the process that creates new ": null
    },
    {
        "atomic nuclei": "atomic nuclei"
    },
    {
        " from pre-existing ": null
    },
    {
        "nucleon": "nucleon"
    },
    {
        "s . The first nuclei were formed a few minutes after the ": null
    },
    {
        "Big Bang": "big bang"
    },
    {
        ", through the process called ": null
    },
    {
        "Big Bang nucleosynthesis": "big bang nucleosynthesis"
    },
    {
        ". After about 42 minutes, the universe had cooled to a point at which these processes ended, so only the fastest and simplest reactions occurred, leaving our universe containing about 42% ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        ", 42% ": null
    },
    {
        "helium": "helium"
    },
    {
        " by mass. The rest is traces of other elements such as ": null
    },
    {
        "lithium": "lithium"
    },
    {
        " and the hydrogen ": null
    },
    {
        "isotope": "isotope"
    },
    {
        " deuterium": "deuterium"
    },
    {
        ". The universe still has approximately the same composition.     Stars ": null
    },
    {
        "fuse": "stellar fusion"
    },
    {
        " light elements to heavier ones in their ": null
    },
    {
        "cores": "stellar core"
    },
    {
        ", giving off energy in the process known as ": null
    },
    {
        "stellar nucleosynthesis": "stellar nucleosynthesis"
    },
    {
        ". Fusion processes create many of the lighter elements, up to and including ": null
    },
    {
        "iron": "iron"
    },
    {
        " and ": null
    },
    {
        "nickel": "nickel"
    },
    {
        " in the most massive stars although these mostly remain trapped in stellar cores and remnants. The ": null
    },
    {
        "s-process": "s-process"
    },
    {
        " creates heavy elements, from strontium upwards.     ": null
    },
    {
        "Supernova nucleosynthesis": "supernova nucleosynthesis"
    },
    {
        " within exploding stars is largely responsible for the elements between ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        " and ": null
    },
    {
        "rubidium": "rubidium"
    },
    {
        ": from the ejection of elements produced during stellar nucleosynthesis; through explosive nucleosynthesis during the supernova explosion; and from the ": null
    },
    {
        "r-process": "r-process"
    },
    {
        " during the explosion.     ": null
    },
    {
        "Neutron star merger": "neutron star merger"
    },
    {
        "s are also very responsible for the synthesis of many heavy elements, via the ": null
    },
    {
        "r-process": "r-process"
    },
    {
        " . When two neutron stars collide, a large amount of neutron-rich matter may be ejected at extremely high temperatures, and very heavy elements form as the ejecta begins to cool.     ": null
    },
    {
        "Cosmic ray spallation": "cosmic ray spallation"
    },
    {
        ", caused when ": null
    },
    {
        "cosmic rays": "cosmic rays"
    },
    {
        " impact the interstellar medium and fragment larger atomic species, is a significant source of the lighter nuclei, particularly 42 He, 42 Be and 42 B, that are not created by stellar nucleosynthesis. Cosmic ray bombardment of elements on Earth also contribute to the presence of rare, short-lived atomic species called ": null
    },
    {
        "cosmogenic nuclide": "cosmogenic nuclide"
    },
    {
        "s.     In addition to the fusion processes responsible for the growing abundances of elements in the universe, a few minor natural processes continue to produce very small numbers of new nuclides on Earth. These nuclides contribute little to their abundances, but may account for the presence of specific new nuclei. These nuclides are produced via ": null
    },
    {
        "radiogenesis": "radiogenesis"
    },
    {
        " of long-lived, heavy, primordial radionuclides such as uranium and thorium.            It is thought that the primordial nucleons themselves were formed from the ": null
    },
    {
        "quark–gluon plasma": "quark–gluon plasma"
    },
    {
        " during the ": null
    },
    {
        "Big Bang": "big bang"
    },
    {
        " as it cooled below two trillion degrees. A few minutes afterwards, starting with only ": null
    },
    {
        "proton": "proton"
    },
    {
        "s and ": null
    },
    {
        "neutron": "neutron"
    },
    {
        "s, nuclei up to ": null
    },
    {
        "lithium": "lithium"
    },
    {
        " and ": null
    },
    {
        "beryllium": "beryllium"
    },
    {
        " were formed, but hardly any other elements. Some ": null
    },
    {
        "boron": "boron"
    },
    {
        " may have been formed at this time, but the process stopped before significant ": null
    },
    {
        "carbon": "carbon"
    },
    {
        " could be formed, as this element requires a far higher product of helium density and time than were present in the short nucleosynthesis period of the Big Bang. That fusion process essentially shut down at about 42 minutes, due to drops in temperature and density as the universe continued to expand. This first process, ": null
    },
    {
        "Big Bang nucleosynthesis": "big bang nucleosynthesis"
    },
    {
        ", was the first type of nucleogenesis to occur in the universe.     The subsequent nucleosynthesis of the heavier elements requires the extreme temperatures and pressures found within ": null
    },
    {
        "star": "star"
    },
    {
        "s and ": null
    },
    {
        "supernova": "supernova"
    },
    {
        "s. These processes began as hydrogen and helium from the Big Bang collapsed into the first stars at 42 million years. Star formation has occurred continuously in galaxies since that time. Among the elements found naturally on Earth , those heavier than boron were created by ": null
    },
    {
        "stellar nucleosynthesis": "stellar nucleosynthesis"
    },
    {
        " and by ": null
    },
    {
        "supernova nucleosynthesis": "supernova nucleosynthesis"
    },
    {
        ". They range in ": null
    },
    {
        "atomic number": "atomic number"
    },
    {
        "s from Z    42  to Z    42 . Synthesis of these elements occurred either by ": null
    },
    {
        "nuclear fusion": "nuclear fusion"
    },
    {
        "  or to a lesser degree by ": null
    },
    {
        "nuclear fission": "nuclear fission"
    },
    {
        " followed by ": null
    },
    {
        "beta decay": "beta decay"
    },
    {
        ".     A star gains heavier elements by combining its lighter nuclei, ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        ", ": null
    },
    {
        "deuterium": "deuterium"
    },
    {
        ", ": null
    },
    {
        "beryllium": "beryllium"
    },
    {
        ", ": null
    },
    {
        "lithium": "lithium"
    },
    {
        ", and ": null
    },
    {
        "boron": "boron"
    },
    {
        ", which were found in the initial composition of the interstellar medium and hence the star. Interstellar gas therefore contains declining abundances of these light elements, which are present only by virtue of their nucleosynthesis during the Big Bang. Larger quantities of these lighter elements in the present universe are therefore thought to have been restored through billions of years of ": null
    },
    {
        "cosmic ray": "cosmic ray"
    },
    {
        " mediated breakup of heavier elements in interstellar gas and dust. The fragments of these cosmic-ray collisions include the light elements Li, Be and B.       The first ideas on nucleosynthesis were simply that the ": null
    },
    {
        "chemical elements": "chemical elements"
    },
    {
        " were created at the beginning of the universe, but no rational physical scenario for this could be identified. Gradually it became clear that hydrogen and helium are much more abundant than any of the other elements. All the rest constitute less than 42% of the mass of the Solar System, and of other star systems as well. At the same time it was clear that oxygen and carbon were the next two most common elements, and also that there was a general trend toward high abundance of the light elements, especially those composed of whole numbers of helium42 nuclei.     ": null
    },
    {
        "Arthur Stanley Eddington": "arthur stanley eddington"
    },
    {
        " first suggested in 42 that stars obtain their energy by fusing hydrogen into helium and raised the possibility that the heavier elements may also form in stars.   This idea was not generally accepted, as the nuclear mechanism was not understood. In the years immediately before World War II, ": null
    },
    {
        "Hans Bethe": "hans bethe"
    },
    {
        " first elucidated those nuclear mechanisms by which hydrogen is fused into helium.     ": null
    },
    {
        "Fred Hoyle": "fred hoyle"
    },
    {
        "s original work on nucleosynthesis of heavier elements in stars, occurred just after World War II. Actually, before the war ended, he learned about the problem of spherical implosion of ": null
    },
    {
        "plutonium": "plutonium"
    },
    {
        " in the ": null
    },
    {
        "Manhattan project": "manhattan project"
    },
    {
        ". He saw an analogy between the plutonium fission reaction and the newly discovered supernovae, and he was able to show that exploding super novae produced all of the elements in the same proportion as existed on Earth. He felt that he had accidentally fallen into a subject that would make his career.  His work explained the production of all heavier elements, starting from hydrogen. Hoyle proposed that hydrogen is continuously created in the universe from vacuum and energy, without need for universal beginning.     Hoyles work explained how the abundances of the elements increased with time as the galaxy aged. Subsequently, Hoyles picture was expanded during the 42s by contributions from ": null
    },
    {
        "William A. Fowler": "william a. fowler"
    },
    {
        ", ": null
    },
    {
        "Alastair G. W. Cameron": "alastair g. w. cameron"
    },
    {
        ", and ": null
    },
    {
        "Donald D. Clayton": "donald d. clayton"
    },
    {
        ", followed by many others. The ": null
    },
    {
        "seminal 42 review paper": "b2fh paper"
    },
    {
        " by ": null
    },
    {
        "E. M. Burbidge": "margaret burbidge"
    },
    {
        ", ": null
    },
    {
        "G. R. Burbidge": "geoffrey burbidge"
    },
    {
        ", Fowler and Hoyle  is a well-known summary of the state of the field in 42 That paper defined new processes for the transformation of one heavy nucleus into others within stars, processes that could be documented by astronomers.     The Big Bang itself had been proposed in 42 long before this period, by ": null
    },
    {
        "Georges Lemaître": "georges lemaître"
    },
    {
        ", a Belgian physicist, who suggested that the evident expansion of the Universe in time required that the Universe, if contracted backwards in time, would continue to do so until it could contract no further. This would bring all the mass of the Universe to a single point, a primeval atom , to a state before which time and space did not exist. Hoyle is credited with coining the term Big Bang during a 42 BBC radio broadcast, saying that Lemaîtres theory was based on the hypothesis that all the matter in the universe was created in one big bang at a particular time in the remote past. It is popularly reported that Hoyle intended this to be pejorative, but Hoyle explicitly denied this and said it was just a striking image meant to highlight the difference between the two models. Lemaîtres model was needed to explain the existence of deuterium and nuclides between helium and carbon, as well as the fundamentally high amount of helium present, not only in stars but also in interstellar space. As it happened, both Lemaître and Hoyles models of nucleosynthesis would be needed to explain the elemental abundances in the universe.     The goal of the theory of nucleosynthesis is to explain the vastly differing abundances of the chemical elements and their several isotopes from the perspective of natural processes. The primary stimulus to the development of this theory was the shape of a plot of the abundances versus the atomic number of the elements. Those abundances, when plotted on a graph as a function of atomic number, have a jagged sawtooth structure that varies by factors up to ten million. A very influential stimulus to nucleosynthesis research was an abundance table created by ": null
    },
    {
        "Hans Suess": "hans suess"
    },
    {
        " and ": null
    },
    {
        "Harold Urey": "harold urey"
    },
    {
        " that was based on the unfractionated abundances of the non-volatile elements found within unevolved meteorites.  Such a graph of the abundances is displayed on a logarithmic scale below, where the dramatically jagged structure is visually suppressed by the many powers of ten spanned in the vertical scale of this graph.            There are a number of ": null
    },
    {
        "astrophysical": "astrophysical"
    },
    {
        " processes which are believed to be responsible for nucleosynthesis. The majority of these occur within stars, and the chain of those ": null
    },
    {
        "nuclear fusion": "nuclear fusion"
    },
    {
        " processes are known as hydrogen burning , ": null
    },
    {
        "helium burning": "helium fusion"
    },
    {
        ", ": null
    },
    {
        "carbon burning": "carbon burning process"
    },
    {
        ", ": null
    },
    {
        "neon burning": "neon burning process"
    },
    {
        ", ": null
    },
    {
        "oxygen burning": "oxygen burning process"
    },
    {
        " and ": null
    },
    {
        "silicon burning": "silicon burning process"
    },
    {
        ". These processes are able to create elements up to and including iron and nickel. This is the region of nucleosynthesis within which the isotopes with the highest ": null
    },
    {
        "binding energy": "binding energy"
    },
    {
        " per nucleon are created. Heavier elements can be assembled within stars by a neutron capture process known as the ": null
    },
    {
        "s-process": "s-process"
    },
    {
        " or in explosive environments, such as ": null
    },
    {
        "supernova": "supernova"
    },
    {
        "e and ": null
    },
    {
        "neutron star merger": "neutron star merger"
    },
    {
        "s, by a number of other processes. Some of those others include the ": null
    },
    {
        "r-process": "r-process"
    },
    {
        ", which involves rapid neutron captures, the ": null
    },
    {
        "rp-process": "rp-process"
    },
    {
        ", and the ": null
    },
    {
        "p-process": "p-process"
    },
    {
        " , which results in the ": null
    },
    {
        "photodisintegration": "photodisintegration"
    },
    {
        " of existing nuclei.              Big Bang nucleosynthesis  occurred within the first three minutes of the beginning of the universe and is responsible for much of the abundance of 42 H , 42 H , 42 He , and 42 He . Although 42 He continues to be produced by stellar fusion and ": null
    },
    {
        "alpha decay": "alpha decay"
    },
    {
        "s and trace amounts of 42 H continue to be produced by ": null
    },
    {
        "spallation": "spallation"
    },
    {
        " and certain types of radioactive decay, most of the mass of the isotopes in the universe are thought to have been produced in the ": null
    },
    {
        "Big Bang": "big bang"
    },
    {
        ". The nuclei of these elements, along with some 42 Li and 42 Be are considered to have been formed between 42 and 42 seconds after the Big Bang when the primordial ": null
    },
    {
        "quark–gluon plasma": "quark–gluon plasma"
    },
    {
        " froze out to form ": null
    },
    {
        "proton": "proton"
    },
    {
        "s and ": null
    },
    {
        "neutron": "neutron"
    },
    {
        "s. Because of the very short period in which nucleosynthesis occurred before it was stopped by expansion and cooling , no elements heavier than ": null
    },
    {
        "beryllium": "beryllium"
    },
    {
        "  could be formed. Elements formed during this time were in the plasma state, and did not cool to the state of neutral atoms until much later.     ": null
    }
]