[
    {
        "Nucleic acids are the ": null
    },
    {
        "biopolymer": "Biopolymer"
    },
    {
        "s, or small ": null
    },
    {
        "biomolecule": "Biomolecule"
    },
    {
        "s, essential to all known forms of ": null
    },
    {
        "life": "Life"
    },
    {
        ". The term nucleic acid is the overall name for DNA and RNA. They are composed of ": null
    },
    {
        "nucleotide": "Nucleotide"
    },
    {
        "s, which are the ": null
    },
    {
        "monomers": "Monomer"
    },
    {
        "made of three components: a ": null
    },
    {
        "5-carbon sugar": "Pentose"
    },
    {
        ", a ": null
    },
    {
        "phosphate": "Phosphate"
    },
    {
        " group and a ": null
    },
    {
        "nitrogenous base": "Nitrogenous Base"
    },
    {
        ". If the ": null
    },
    {
        "sugar": "Sugar"
    },
    {
        " is a compound ": null
    },
    {
        "ribose": "Ribose"
    },
    {
        ", the ": null
    },
    {
        "polymer": "Polymer"
    },
    {
        " is ": null
    },
    {
        "RNA": "Rna"
    },
    {
        " ; if the sugar is derived from ribose as ": null
    },
    {
        "deoxyribose": "Deoxyribose"
    },
    {
        ", the polymer is ": null
    },
    {
        "DNA": "Dna"
    },
    {
        " .     ": null
    },
    {
        "Nucleic": "Cell Nucleus"
    },
    {
        " acids are the most important of all biomolecules. These are found in abundance in all living things, where they function to create and encode and then store information of every living cell of every life-form ": null
    },
    {
        "organism": "Organism"
    },
    {
        " on Earth. In turn, they function to transmit and express that information inside and outside the cell nucleus—to the interior operations of the cell and ultimately to the next generation of each living organism. The encoded information is contained and conveyed via the ": null
    },
    {
        "nucleic acid sequence": "Nucleic Acid Sequence"
    },
    {
        ", which provides the ladder-step ordering of nucleotides within the molecules of RNA and DNA.     Strings of nucleotides are bonded to form helical backbones—typically, one for RNA, two for DNA—and assembled into chains of base-pairs selected from the five ": null
    },
    {
        "primary, or canonical, nucleobases": "Nucleobase"
    },
    {
        ", which are: adenine, cytosine, guanine, thymine, and uracil. Thymine occurs only in DNA and uracil only in RNA. Using amino acids and the process known as ": null
    },
    {
        "protein synthesis": "Protein Synthesis"
    },
    {
        ",  the specific sequencing in DNA of these ": null
    },
    {
        "nucleobase-pairs": "Base Pair"
    },
    {
        " enables storing and transmitting ": null
    },
    {
        "coded": "Codegenetic Code"
    },
    {
        " instructions as ": null
    },
    {
        "gene": "Gene"
    },
    {
        "s. In RNA, base-pair sequencing provides for manufacturing new proteins that determine the frames and parts and most chemical processes of all life forms.        ": null
    },
    {
        "Friedrich Miescher": "Friedrich Miescher"
    },
    {
        " in 1869.    In the early 1880s ": null
    },
    {
        "Albrecht Kossel": "Albrecht Kossel"
    },
    {
        " further purified the substance and discovered its highly acidic properties. He later also identified the nucleobases.   In 1889 ": null
    },
    {
        "Richard Altmann": "Richard Altmann"
    },
    {
        " creates the term nucleic acid   In 1938 ": null
    },
    {
        "Astbury": "William Astbury"
    },
    {
        " and Bell published the first X-ray diffraction pattern of DNA.    In 1953 ": null
    },
    {
        "Watson": "James Watson"
    },
    {
        " and ": null
    },
    {
        "Crick": "Francis Crick"
    },
    {
        " determined the ": null
    },
    {
        "structure of DNA": "Molecular Structure Of Nucleic Acids: A Structure For Deoxyribose Nucleic Acid"
    },
    {
        ".      Experimental studies of nucleic acids constitute a major part of modern ": null
    },
    {
        "biological": "Biological Research"
    },
    {
        " and ": null
    },
    {
        "medical research": "Medical Research"
    },
    {
        ", and form a foundation for ": null
    },
    {
        "genome": "Genomics"
    },
    {
        " and ": null
    },
    {
        "forensic science": "Forensic Science"
    },
    {
        ", and the ": null
    },
    {
        "biotechnology": "Biotechnology"
    },
    {
        " and ": null
    },
    {
        "pharmaceutical industries": "Pharmaceutical Industry"
    },
    {
        ".          The term nucleic acid is the overall name for DNA and RNA, members of a family of ": null
    },
    {
        "biopolymer": "Biopolymer"
    },
    {
        "s,  and is synonymous with  polynucleotide . Nucleic acids were named for their initial discovery within the ": null
    },
    {
        "nucleus": "Cell Nucleus"
    },
    {
        ", and for the presence of phosphate groups .  Although first discovered within the ": null
    },
    {
        "nucleus": "Cell Nucleus"
    },
    {
        " of ": null
    },
    {
        "eukaryotic": "Eukaryote"
    },
    {
        " cells, nucleic acids are now known to be found in all life forms including within ": null
    },
    {
        "bacteria": "Bacteria"
    },
    {
        ", ": null
    },
    {
        "archaea": "Archaea"
    },
    {
        ", ": null
    },
    {
        "mitochondria": "Mitochondrion"
    },
    {
        ", ": null
    },
    {
        "chloroplast": "Chloroplast"
    },
    {
        "s, ": null
    },
    {
        "virus": "Virus"
    },
    {
        "es, and ": null
    },
    {
        "viroid": "Viroid"
    },
    {
        "s.  All living cells contain both DNA and RNA , while viruses contain either DNA or RNA, but usually not both.    The basic component of biological nucleic acids is the ": null
    },
    {
        "nucleotide": "Nucleotide"
    },
    {
        ", each of which contains a pentose sugar , a ": null
    },
    {
        "phosphate": "Phosphate"
    },
    {
        " group, and a ": null
    },
    {
        "nucleobase": "Nucleobase"
    },
    {
        ".    Nucleic acids are also generated within the laboratory, through the use of ": null
    },
    {
        "enzymes": "Enzyme"
    },
    {
        " Mullis, Kary B. The Polymerase Chain Reaction . 1993.  and by ": null
    },
    {
        "solid-phase chemical synthesis": "Solid-Phase Synthesis"
    },
    {
        ". The chemical methods also enable the generation of altered nucleic acids that are not found in nature,  for example ": null
    },
    {
        "peptide nucleic acid": "Peptide Nucleic Acid"
    },
    {
        "s.       Nucleic acids are generally very large molecules. Indeed, DNA molecules are probably the largest individual molecules known. Well-studied biological nucleic acid molecules range in size from 21 nucleotides  to large chromosomes .     In most cases, naturally occurring DNA molecules are ": null
    },
    {
        "double-stranded": "Double Helix"
    },
    {
        " and RNA molecules are single-stranded.  There are numerous exceptions, however—some viruses have genomes made of ": null
    },
    {
        "double-stranded RNA": "Reoviridae"
    },
    {
        " and other viruses have ": null
    },
    {
        "single-stranded DNA": "M13 Bacteriophage"
    },
    {
        " genomes,  and, in some circumstances, nucleic acid structures with ": null
    },
    {
        "three": "Triple-Stranded Dna"
    },
    {
        " or ": null
    },
    {
        "four": "G-Quadruplex"
    },
    {
        " strands can form.      Nucleic acids are linear ": null
    },
    {
        "polymers": "Polymer"
    },
    {
        " of nucleotides. Each nucleotide consists of three components: a ": null
    },
    {
        "purine": "Purine"
    },
    {
        " or ": null
    },
    {
        "pyrimidine": "Pyrimidine"
    },
    {
        " nucleobase": "Nucleobase"
    },
    {
        " , a ": null
    },
    {
        "pentose": "Pentose"
    },
    {
        " sugar": "Sugar"
    },
    {
        ", and a ": null
    },
    {
        "phosphate": "Phosphate"
    },
    {
        " group. The substructure consisting of a nucleobase plus sugar is termed a ": null
    },
    {
        "nucleoside": "Nucleoside"
    },
    {
        ". Nucleic acid types differ in the structure of the sugar in their nucleotides–DNA contains 2-": null
    },
    {
        "deoxyribose": "Deoxyribose"
    },
    {
        " while RNA contains ": null
    },
    {
        "ribose": "Ribose"
    },
    {
        " . Also, the nucleobases found in the two nucleic acid types are different: ": null
    },
    {
        "adenine": "Adenine"
    },
    {
        ", ": null
    },
    {
        "cytosine": "Cytosine"
    },
    {
        ", and ": null
    },
    {
        "guanine": "Guanine"
    },
    {
        " are found in both RNA and DNA, while ": null
    },
    {
        "thymine": "Thymine"
    },
    {
        " occurs in DNA and ": null
    },
    {
        "uracil": "Uracil"
    },
    {
        " occurs in RNA.     The sugars and phosphates in nucleic acids are connected to each other in an alternating chain through ": null
    },
    {
        "phosphodiester": "Phosphodiester"
    },
    {
        " linkages.  In ": null
    },
    {
        "conventional nomenclature": "Nucleic Acid Nomenclature"
    },
    {
        ", the carbons to which the phosphate groups attach are the 3-end and the 5-end carbons of the sugar. This gives nucleic acids ": null
    },
    {
        "directionality": "Directionality"
    },
    {
        ", and the ends of nucleic acid molecules are referred to as 5-end and 3-end. The nucleobases are joined to the sugars via an N-glycosidic linkage involving a nucleobase ring nitrogen and the 1 carbon of the pentose sugar ring.     Non-standard nucleosides are also found in both RNA and DNA and usually arise from modification of the standard nucleosides within the DNA molecule or the primary RNA transcript. ": null
    },
    {
        "Transfer RNA": "Transfer Rna"
    },
    {
        " molecules contain a particularly large number of modified nucleosides.        Double-stranded nucleic acids are made up of complementary sequences, in which extensive ": null
    },
    {
        "Watson-Crick base pairing": "Base Pair"
    },
    {
        " results in a highly repeated and quite uniform ": null
    },
    {
        "double-helical three-dimensional structure": "Nucleic Acid Double Helix"
    },
    {
        ".  In contrast, single-stranded RNA and DNA molecules are not constrained to a regular double helix, and can adopt ": null
    },
    {
        "highly complex three-dimensional structures": "Nucleic Acid Tertiary Structure"
    },
    {
        " that are based on short stretches of intramolecular base-paired sequences including both Watson-Crick and noncanonical base pairs, and a wide range of complex tertiary interactions.      Nucleic acid molecules are usually unbranched, and may occur as linear and circular molecules. For example, bacterial chromosomes, ": null
    },
    {
        "plasmid": "Plasmid"
    },
    {
        "s, ": null
    },
    {
        "mitochondrial DNA": "Mitochondrial Dna"
    },
    {
        ", and chloroplast DNA are usually circular double-stranded DNA molecules, while chromosomes of the eukaryotic nucleus are usually linear double-stranded DNA molecules. Most RNA molecules are linear, single-stranded molecules, but both circular and branched molecules can result from ": null
    },
    {
        "RNA splicing": "Rna Splicing"
    },
    {
        " reactions.  The total amount of pyrimidines is equal to the total amount of purines. The diameter of the helix is about 20Å.          One DNA or RNA molecule differs from another primarily in the ": null
    },
    {
        "sequence of nucleotides": "Nucleic Acid Sequence"
    },
    {
        ". Nucleotide sequences are of great importance in biology since they carry the ultimate instructions that encode all biological molecules, molecular assemblies, subcellular and cellular structures, organs, and organisms, and directly enable cognition, memory, and behavior . Enormous efforts have gone into the development of experimental methods to determine the nucleotide sequence of biological DNA and RNA molecules, Gilbert, Walter G. 1980. DNA Sequencing and Gene Structure  Sanger, Frederick. 1980. Determination of Nucleotide Sequences in DNA  and today hundreds of millions of nucleotides are ": null
    },
    {
        "sequenced": "Dna Sequencing"
    },
    {
        " daily at genome centers and smaller laboratories worldwide. In addition to maintaining the GenBank nucleic acid sequence database, the ": null
    },
    {
        "National Center for Biotechnology Information": "National Center For Biotechnology Information"
    },
    {
        "  provides analysis and retrieval resources for the data in GenBank and other biological data made available through the NCBI web site.               Deoxyribonucleic acid is a nucleic acid containing the genetic instructions used in the development and functioning of all known living organisms. The DNA segments carrying this genetic information are called genes. Likewise, other DNA sequences have structural purposes, or are involved in regulating the use of this genetic information. Along with RNA and proteins, DNA is one of the three major macromolecules that are essential for all known forms of life.   DNA consists of two long polymers of simple units called nucleotides, with backbones made of sugars and phosphate groups joined by ester bonds. These two strands run in opposite directions to each other and are, therefore, anti-parallel. Attached to each sugar is one of four types of molecules called nucleobases . It is the sequence of these four nucleobases along the backbone that encodes information. This information is read using the genetic code, which specifies the sequence of the amino acids within proteins. The code is read by copying stretches of DNA into the related nucleic acid RNA in a process called transcription.   Within cells DNA is organized into long structures called chromosomes. During cell division these chromosomes are duplicated in the process of DNA replication, providing each cell its own complete set of chromosomes. Eukaryotic organisms store most of their DNA inside the cell nucleus and some of their DNA in organelles, such as mitochondria or chloroplasts. In contrast, prokaryotes store their DNA only in the cytoplasm. Within the chromosomes, chromatin proteins such as histones compact and organize DNA. These compact structures guide the interactions between DNA and other proteins, helping control which parts of the DNA are transcribed.          Ribonucleic acid functions in converting genetic information from genes into the amino acid sequences of proteins. The three universal types of RNA include transfer RNA , messenger RNA , and ribosomal RNA . ": null
    },
    {
        "Messenger RNA": "Messenger Rna"
    },
    {
        " acts to carry genetic sequence information between DNA and ribosomes, directing protein synthesis. ": null
    },
    {
        "Ribosomal RNA": "Ribosomal Rna"
    },
    {
        " is a major component of the ribosome, and catalyzes peptide bond formation. ": null
    },
    {
        "Transfer RNA": "Transfer Rna"
    },
    {
        " serves as the carrier molecule for amino acids to be used in protein synthesis, and is responsible for decoding the mRNA. In addition, many other ": null
    },
    {
        "classes of RNA": "Non-Coding Rna"
    },
    {
        " are now known.          Artificial ": null
    },
    {
        "nucleic acid analogues": "Nucleic Acid Analogue"
    },
    {
        "have been designed and synthesized by chemists, and include ": null
    },
    {
        "peptide nucleic acid": "Peptide Nucleic Acid"
    },
    {
        ", ": null
    },
    {
        "morpholino": "Morpholino"
    },
    {
        "- and ": null
    },
    {
        "locked nucleic acid": "Locked Nucleic Acid"
    },
    {
        ", ": null
    },
    {
        "glycol nucleic acid": "Glycol Nucleic Acid"
    },
    {
        ", and ": null
    },
    {
        "threose nucleic acid": "Threose Nucleic Acid"
    }
]