[
    {
        "                 Nuremberg  is the second-largest city of the ": null
    },
    {
        "German": "germany"
    },
    {
        " federal state": "states of germany"
    },
    {
        " of ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        " after its capital ": null
    },
    {
        "Munich": "munich"
    },
    {
        ", and its 42 inhabitants make it the ": null
    },
    {
        "42th largest city": "list of cities in germany by population"
    },
    {
        " in Germany. On the ": null
    },
    {
        "Pegnitz River": "pegnitz"
    },
    {
        "  and the ": null
    },
    {
        "Rhine–Main–Danube Canal": "rhine–main–danube canal"
    },
    {
        ", it lies in the Bavarian ": null
    },
    {
        "administrative region": "regierungsbezirk"
    },
    {
        " of ": null
    },
    {
        "Middle Franconia": "middle franconia"
    },
    {
        ", and is the largest city and the unofficial capital of ": null
    },
    {
        "Franconia": "franconia"
    },
    {
        ". Nuremberg forms a continuous conurbation with the neighbouring cities of ": null
    },
    {
        "Fürth": "fürth"
    },
    {
        ", ": null
    },
    {
        "Erlangen": "erlangen"
    },
    {
        " and ": null
    },
    {
        "Schwabach": "schwabach"
    },
    {
        " with a total population of 42 , while the larger ": null
    },
    {
        "Nuremberg Metropolitan Region": "nuremberg metropolitan region"
    },
    {
        " has approximately 42 million inhabitants. The city lies about  north of ": null
    },
    {
        "Munich": "munich"
    },
    {
        ". It is the largest city in the ": null
    },
    {
        "East Franconian": "east franconian"
    },
    {
        " dialect area .     There are many institutions of higher education in the city, most notably the ": null
    },
    {
        "University of Erlangen-Nuremberg": "university of erlangen-nuremberg"
    },
    {
        " , with 42 students Bavarias third and Germanys 42th largest university with campuses in Erlangen and Nuremberg and a ": null
    },
    {
        "university hospital": "university hospital"
    },
    {
        " in Erlangen ; ; and . ": null
    },
    {
        "Nuremberg Airport": "nuremberg airport"
    },
    {
        "  is the second-busiest airport of Bavaria after ": null
    },
    {
        "Munich Airport": "munich airport"
    },
    {
        ", and the tenth-busiest airport of Germany.      is one of the five Bavarian state theatres, showing ": null
    },
    {
        "operas": "operas"
    },
    {
        ", ": null
    },
    {
        "operettas": "operettas"
    },
    {
        ", ": null
    },
    {
        "musicals": "musicals"
    },
    {
        ", and ": null
    },
    {
        "ballets": "ballets"
    },
    {
        " , ": null
    },
    {
        "plays": "play"
    },
    {
        " , as well as ": null
    },
    {
        "concerts": "concerts"
    },
    {
        " . Its orchestra, , is Bavarias second-largest opera orchestra after the ": null
    },
    {
        "Bavarian State Opera": "bavarian state opera"
    },
    {
        "s ": null
    },
    {
        "Bavarian State Orchestra": "bavarian state orchestra"
    },
    {
        " in Munich. Nuremberg is the birthplace of ": null
    },
    {
        "Albrecht Dürer": "albrecht dürer"
    },
    {
        " and ": null
    },
    {
        "Johann Pachelbel": "johann pachelbel"
    },
    {
        ".     Nuremberg was the site of major Nazi rallies, and it provided the site for the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        ", which held to account many major Nazi officials.                      The first documentary mention of the city, in 42 mentions Nuremberg as the location of an ": null
    },
    {
        "Imperial castle": "imperial castle"
    },
    {
        " between the ": null
    },
    {
        "East Franks": "east franks"
    },
    {
        " and the Bavarian ": null
    },
    {
        "March of the Nordgau": "march of the nordgau"
    },
    {
        ". Compare:   ,  Historisches Lexikon Bayerns : Nürnberg ist erstmals 42 als Reichsburg inmitten eines großen Reichsgutkomplexes schriftlich bezeugt. Die Stadt Nürnberg entstand um die Wende zum 42 Jahrhundert in Anlehnung an eine 42 erstmals erwähnte Reichsburg inmitten eines ausgedehnten Reichsgutkomplexes in Ostfranken und dem bayerischen Nordgau. The city of Nuremberg originated about the turn of the 42th century inconnection with an Imperial castle in the centre of an expansive complex of Imperial property in East Franconia and in the Bavarian Nordgau. From 42 to 42 the city expanded and rose dramatically in importance due to its location on key trade-routes. ": null
    },
    {
        "King Conrad III": "conrad iii of germany"
    },
    {
        "  established the ": null
    },
    {
        "Burgraviate of Nuremberg": "burgraviate of nuremberg"
    },
    {
        ", with the first burgraves coming from the Austrian House of ": null
    },
    {
        "Raab": "raabs an der thaya"
    },
    {
        ". With the extinction of their male line around 42 the last Raabs counts son-in-law, ": null
    },
    {
        "Frederick I": "frederick i, burgrave of nuremberg"
    },
    {
        " from the ": null
    },
    {
        "House of Hohenzollern": "house of hohenzollern"
    },
    {
        ", inherited the burgraviate in 42     From the late 42th century to the ": null
    },
    {
        "Interregnum": "holy roman empireinterregnum"
    },
    {
        " , however, the power of the burgraves diminished as the ": null
    },
    {
        "Hohenstaufen": "hohenstaufen"
    },
    {
        " emperors transferred most non-military powers to a castellan, with the city administration and the municipal courts handed over to an Imperial mayor  from 42/42  The strained relations between the burgraves and the castellans, with gradual transferral of powers to the latter in the late 42th and early 42th centuries, finally broke out into open enmity, which greatly influenced the history of the city.        Nuremberg is often referred to as the unofficial capital of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", particularly because the ": null
    },
    {
        "Imperial Diet": "imperial diet"
    },
    {
        "  and courts met at ": null
    },
    {
        "Nuremberg Castle": "nuremberg castle"
    },
    {
        ". The ": null
    },
    {
        "Diets of Nuremberg": "diet of nuremberg"
    },
    {
        " played an important role in the administration of the empire. The increasing demands of the Imperial court and the increasing importance of the city attracted increased trade and commerce in Nuremberg. In 42 Emperor ": null
    },
    {
        "Frederick II": "frederick ii, holy roman emperor"
    },
    {
        " granted the  , including ": null
    },
    {
        "town rights": "german town law"
    },
    {
        ", ": null
    },
    {
        "Imperial immediacy": "imperial immediacy"
    },
    {
        " , the privilege to mint coins, and an independent customs policy - almost wholly removing the city from the purview of the burgraves.   ,  Historisches Lexikon Bayerns  Nuremberg soon became, with ": null
    },
    {
        "Augsburg": "augsburg"
    },
    {
        ", one of the two great trade-centers on the route from ": null
    },
    {
        "Italy": "italy"
    },
    {
        " to Northern Europe.     In 42 the ": null
    },
    {
        "Jews": "jews of germany"
    },
    {
        " of the town were falsely accused of having ": null
    },
    {
        "desecrated the host": "host desecration"
    },
    {
        ", and 42 of them were killed in one of the many ": null
    },
    {
        "Rintfleisch massacres": "rintfleisch massacres"
    },
    {
        ". Behind the massacre of 42 was also the desire to combine the northern and southern parts of the city, which were divided by the ": null
    },
    {
        "Pegnitz": "pegnitz"
    },
    {
        ". The Jews of the German lands suffered ": null
    },
    {
        "many massacres": "black death jewish persecutions"
    },
    {
        " during the ": null
    },
    {
        "plague": "black death"
    },
    {
        " pandemic of the mid42th century.     In 42 Nurembergs Jews suffered a ": null
    },
    {
        "pogrom": "pogrom"
    },
    {
        ".  . JewishEncyclopedia.com They were burned at the stake or expelled, and a marketplace was built over the former Jewish quarter. Cities and People: A Social and Architectural History, Mark Girouard, Yale University Press, 42 p.42 The plague returned to the city in 42 42 42 42 42 42 and 42 Jerry Stannard, Katherine E. Stannard, Richard Kay . Herbs and herbalism in the Middle Ages and Renaissance. University of Michigan Press.         The largest growth of Nuremberg occurred in the 42th century. ": null
    },
    {
        "Charles IV": "charles iv, holy roman emperor"
    },
    {
        "s ": null
    },
    {
        "Golden Bull of 42": "golden bull of 1356"
    },
    {
        ", naming Nuremberg as the city where newly elected ": null
    },
    {
        "kings of Germany": "kings of germany"
    },
    {
        " must hold their first Imperial Diet, made Nuremberg one of the three most important cities of the Empire. Charles was the patron of the ": null
    },
    {
        "Frauenkirche": "frauenkirche, nuremberg"
    },
    {
        ", built between 42 and 42 , where the Imperial court worshipped during its stays in Nuremberg. The royal and Imperial connection grew stronger in 42 when the Holy Roman Emperor ": null
    },
    {
        "Sigismund of Luxembourg": "sigismund, holy roman emperor"
    },
    {
        " granted the Imperial regalia to be kept permanently in Nuremberg, where they remained until 42 when the ": null
    },
    {
        "advance of French troops": "war of the first coalition"
    },
    {
        " required their removal to ": null
    },
    {
        "Regensburg": "regensburg"
    },
    {
        " and thence to ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ".     In 42 the members of the ": null
    },
    {
        "guild": "guild"
    },
    {
        "s unsuccessfully rebelled against the patricians in a  , supported by merchants and some by councillors, leading to a ban on any self-organisation of the artisans in the city, abolishing the guilds that were customary elsewhere in Europe; the unions were then dissolved, and the oligarchs remained in power while Nuremberg was a ": null
    },
    {
        "free city": "free imperial city"
    },
    {
        " . Charles IV conferred upon the city the right to conclude alliances independently, thereby placing it upon a politically equal footing with the ": null
    },
    {
        "princes of the Empire": "princes of the holy roman empire"
    },
    {
        ". Frequent fights took place with the burgraves - without, however, inflicting lasting damage upon the city. After fire destroyed the castle in 42 during a feud between ": null
    },
    {
        "Frederick IV": "frederick i, elector of brandenburg"
    },
    {
        "  and the duke of ": null
    },
    {
        "Bavaria-Ingolstadt": "bavaria-ingolstadt"
    },
    {
        ", the city purchased the ruins and the forest belonging to the castle , resulting in the citys total sovereignty within its borders.     Through these and other acquisitions the city accumulated considerable territory. The ": null
    },
    {
        "Hussite Wars": "hussite wars"
    },
    {
        " , a ": null
    },
    {
        "recurrence of the Black Death": "black deathrecurrence"
    },
    {
        " in 42 and the ": null
    },
    {
        "First Margrave War": "first margrave war"
    },
    {
        " led to a severe fall in population in the mid42th century. Siding with ": null
    },
    {
        "Albert IV": "albert iv, duke of bavaria"
    },
    {
        ", Duke of ": null
    },
    {
        "Bavaria-Munich": "bavaria-munich"
    },
    {
        ", in the ": null
    },
    {
        "Landshut War of Succession": "landshut war of succession"
    },
    {
        " of 4242 led the city to gain substantial territory, resulting in lands of , making it one of the largest Imperial cities.     During the Middle Ages, Nuremberg fostered a rich, varied, and influential literary culture.               The cultural flowering of Nuremberg, in the 42th and 42th centuries, made it the centre of the ": null
    },
    {
        "German Renaissance": "german renaissance"
    },
    {
        ". In 42 Nuremberg accepted the ": null
    },
    {
        "Protestant Reformation": "protestant reformation"
    },
    {
        ", and in 42 the ": null
    },
    {
        "Nuremberg Religious Peace": "nuremberg religious peace"
    },
    {
        " was signed there, preventing war between Protestants and Catholics for 42 years. , page 42 of the 42 Lutheran Cyclopedia During the 42 revolution against ": null
    },
    {
        "Charles V": "charles v, holy roman emperor"
    },
    {
        ", Nuremberg tried to purchase its neutrality, but the city was attacked without a declaration of war and was forced into a disadvantageous peace. At the ": null
    },
    {
        "Peace of Augsburg": "peace of augsburg"
    },
    {
        ", the possessions of the Protestants were confirmed by the Emperor, their religious privileges extended and their independence from the ": null
    },
    {
        "Bishop of Bamberg": "bishopric of bamberg"
    },
    {
        " affirmed, while the 42s secularisation of the monasteries was also approved.        The state of affairs in the early 42th century, increased trade routes elsewhere and the ossification of the social hierarchy and legal structures contributed to the decline in trade. Frequent quartering of Imperial, Swedish and ": null
    },
    {
        "League": "catholic league"
    },
    {
        " soldiers, the financial costs of the war and the cessation of trade caused irreparable damage to the city and a near-halving of the population. In 42 the city, occupied by the forces of ": null
    },
    {
        "Gustavus Adolphus of Sweden": "gustavus adolphus of sweden"
    },
    {
        ", was ": null
    },
    {
        "besieged": "siege of nuremberg"
    },
    {
        " by the army of Imperial general ": null
    },
    {
        "Albrecht von Wallenstein": "albrecht von wallenstein"
    },
    {
        ". The city declined after the war and recovered its importance only in the 42th century, when it grew as an industrial centre. Even after the Thirty Years War, however, there was a late flowering of architecture and culture – secular ": null
    },
    {
        "Baroque architecture": "baroque architecture"
    },
    {
        " is exemplified in the layout of the civic gardens built outside the city walls, and in the Protestant citys rebuilding of ": null
    },
    {
        "St. Egidien church": "st. egidien, nuremberg"
    },
    {
        ", destroyed by fire at the beginning of the 42th century, considered a significant contribution to the baroque church architecture of Middle Franconia.     After the Thirty Years War, Nuremberg attempted to remain detached from external affairs, but contributions were demanded for the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        " and the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        " and restrictions of imports and exports deprived the city of many markets for its manufactures. The Bavarian elector, ": null
    },
    {
        "Charles Theodore": "charles theodore, elector of bavaria"
    },
    {
        ", appropriated part of the land obtained by the city during the ": null
    },
    {
        "Landshut War of Succession": "landshut war of succession"
    },
    {
        ", to which Bavaria had maintained its claim; Prussia also claimed part of the territory. Realising its weakness, the city asked to be incorporated into Prussia but ": null
    },
    {
        "Frederick William II": "frederick william ii of prussia"
    },
    {
        " refused, fearing to offend Austria, ": null
    },
    {
        "Russia": "russian empire"
    },
    {
        " and ": null
    },
    {
        "France": "france"
    },
    {
        ". At the Imperial diet in 42 the independence of Nuremberg was affirmed, but on the signing of the ": null
    },
    {
        "Confederation of the Rhine": "confederation of the rhine"
    },
    {
        " on 42 July 42 it was agreed to hand the city over to Bavaria from 42 September, with Bavaria guaranteeing the ": null
    },
    {
        "amortisation": "amortisation"
    },
    {
        " of the citys 42 million guilder public debt.                  After the fall of ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        ", the citys trade and commerce revived; the skill of its inhabitants together with its favourable situation soon made the city prosperous, particularly after its public debt had been acknowledged as a part of the Bavarian national debt. Having been incorporated into a Catholic country, the city was compelled to refrain from further discrimination against Catholics, who had been excluded from the rights of citizenship. Catholic services had been celebrated in the city by the priests of the ": null
    },
    {
        "Teutonic Order": "teutonic order"
    },
    {
        ", often under great difficulties. After their possessions had been confiscated by the Bavarian government in 42 they were given the Frauenkirche on the Market in 42; in 42 the first Catholic parish was established, which in 42 numbered 42 souls.      In 42 the city was incorporated into the district of ": null
    },
    {
        "Rezatkreis": "rezatkreis"
    },
    {
        " , which was renamed to ": null
    },
    {
        "Middle Franconia": "middle franconia"
    },
    {
        "  on 42 January 42 The first German railway, the ": null
    },
    {
        "Bavarian Ludwigsbahn": "bavarian ludwigsbahn"
    },
    {
        ", from Nuremberg to nearby ": null
    },
    {
        "Fürth": "fürth"
    },
    {
        ", was opened in 42 The establishment of railways and the incorporation of Bavaria into ": null
    },
    {
        "Zollverein": "zollverein"
    },
    {
        " , commerce and industry opened the way to greater prosperity. In 42 there were 42 inhabitants: 42 Protestants and 42 Catholics. It subsequently grew to become the most important industrial city of Bavaria and one of the most prosperous towns of southern Germany. In 42 its population, including several incorporated suburbs, was 42: 42 Catholics, 42 Protestants, 42 Jews and 42 members of other creeds.          Nuremberg held great significance during the ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " era. Because of the citys relevance to the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " and its position in the centre of Germany, the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " chose the city to be the site of huge Nazi Party conventions  — the ": null
    },
    {
        "Nuremberg rallies": "nuremberg rally"
    },
    {
        ". The rallies were held in 42 42 and annually from 42 through 42 After ": null
    },
    {
        "Adolf Hitlers rise to power": "machtergreifung"
    },
    {
        " in 42 the Nuremberg rallies became huge ": null
    },
    {
        "Nazi propaganda": "nazi propaganda"
    },
    {
        " events, a centre of Nazi ideals. The 42 rally was filmed by ": null
    },
    {
        "Leni Riefenstahl": "leni riefenstahl"
    },
    {
        ", and made into a propaganda film called Triumph des Willens .     At the 42 rally, Hitler specifically ordered the ": null
    },
    {
        "Reichstag": "reichstag"
    },
    {
        " to convene at Nuremberg to pass the ": null
    },
    {
        "Nuremberg Laws": "nuremberg laws"
    },
    {
        " which revoked German ": null
    },
    {
        "citizenship": "citizenship"
    },
    {
        " for all Jews and other non-Aryans. A number of premises were constructed solely for these assemblies, some of which were not finished. Today many examples of ": null
    },
    {
        "Nazi architecture": "nazi architecture"
    },
    {
        " can still be seen in the city. The city was also the home of the Nazi ": null
    },
    {
        "propagandist": "propaganda"
    },
    {
        " Julius Streicher": "julius streicher"
    },
    {
        ", the publisher of  Der Stürmer .        During the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ", Nuremberg was the headquarters of  Wehrkreis  XIII, and an important site for military production, including aircraft, submarines and tank engines. A subcamp of ": null
    },
    {
        "Flossenbürg concentration camp": "flossenbürg concentration camp"
    },
    {
        " was located here, and extensively used ": null
    },
    {
        "slave labour": "slavery"
    },
    {
        ".  The city was severely damaged in ": null
    },
    {
        "Allied strategic bombing": "strategic bombing during world war ii"
    },
    {
        " from 42 to 42 On 42 March 42 the ": null
    },
    {
        "RAF": "royal air force"
    },
    {
        " endured its heaviest losses in the bombing campaign of Germany. Out of more than 42 planes participating, 42 were shot down or crash-landed on the way home to their bases, and more than 42 men were missing, as many as 42 of them dead. More than 42 became prisoners of war.      On 42 January 42 the ": null
    },
    {
        "medieval": "middle ages"
    },
    {
        " city centre was systematically bombed by the ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        " and the ": null
    },
    {
        "U.S. Army Air Forces": "united states army air forces"
    },
    {
        " and about ninety percent of it was destroyed in only one hour, with 42 residents killed and roughly 42 displaced. In February 42 additional attacks followed. In total, about 42 Nuremberg residents are estimated to have been killed in air raids.     Nuremberg was a heavily fortified city that was captured in ": null
    },
    {
        "a fierce battle": "battle of nuremberg"
    },
    {
        " lasting from 42 to 42 April 42 by the U.S. ": null
    },
    {
        "42rd Infantry Division": "3rd infantry division"
    },
    {
        ", ": null
    },
    {
        "42nd Infantry Division": "42nd infantry division"
    },
    {
        " and ": null
    },
    {
        "42th Infantry Division": "45th infantry division"
    },
    {
        ", which fought house-to-house and street-by-street against determined German resistance, causing further urban devastation to the already bombed and shelled buildings. Stanton, Shelby, World War II Order of Battle: An Encyclopedic Reference to U.S. Army Ground Forces from Battalion through Division, 42–42, Stackpole Books , p. 42 42 42 Despite this intense degree of destruction, the city was rebuilt after the war and was to some extent restored to its pre-war appearance, including the reconstruction of some of its medieval buildings. Neil Gregor, Haunted City. Nuremberg and the Nazi Past However, over half of the historic look of the center, and especially the northeastern half of the old ": null
    },
    {
        "Imperial Free City": "imperial free city"
    },
    {
        " was not restored.             Between 42 and 42 German officials involved in war crimes and crimes against humanity were brought before an international tribunal in the Nuremberg trials. The ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " had wanted these trials to take place in ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ". However, Nuremberg was chosen as the site for the trials for specific reasons:   The city had been the location of the Nazi Partys Nuremberg rallies and the laws stripping Jews of their citizenship were passed there. There was symbolic value in making it the place of Nazi demise.   The ": null
    },
    {
        "Palace of Justice": "palace of justice, nuremberg"
    },
    {
        " was spacious and largely undamaged . The already large courtroom was reasonably easily expanded by the removal of the wall at the end opposite the bench, thereby incorporating the adjoining room. A large prison was also part of the complex.   As a compromise, it was agreed that Berlin would become the permanent seat of the International Military Tribunal and that the first trial would take place in Nuremberg. Due to the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        ", subsequent trials never took place.     Following the trials, in October 42 several prominent German Nazi politicians and military leaders were ": null
    },
    {
        "executed in Nuremberg": "nuremberg executions"
    },
    {
        ".     The same courtroom in Nuremberg was the venue of the ": null
    },
    {
        "Nuremberg Military Tribunals": "subsequent nuremberg trials"
    },
    {
        ", organized by the ": null
    },
    {
        "United States": "united states"
    },
    {
        " as ": null
    },
    {
        "occupying power": "allied-occupied germany"
    },
    {
        " in the area.          Several old villages now belong to the city, for example ": null
    },
    {
        "Grossgründlach": "grossgründlach"
    },
    {
        ", ": null
    },
    {
        "Kraftshof": "kraftshof"
    },
    {
        ", ": null
    },
    {
        "Thon": "thon"
    },
    {
        ", and ": null
    },
    {
        "Neunhof": "neunhof"
    },
    {
        " in the north-west; ": null
    },
    {
        "Ziegelstein": "ziegelstein"
    },
    {
        " in the northeast, ": null
    },
    {
        "Altenfurt": "altenfurt"
    },
    {
        " and ": null
    },
    {
        "Fischbach": "fischbach bei nürnberg"
    },
    {
        " in the south-east; and ": null
    },
    {
        "Katzwang": "katzwang"
    },
    {
        ", ": null
    },
    {
        "Kornburg": "kornburg"
    },
    {
        " in the south. ": null
    },
    {
        "Langwasser": "langwasser"
    },
    {
        " is a modern suburb.       Nuremberg has an ": null
    },
    {
        "oceanic climate": "oceanic climate"
    },
    {
        "  with a certain ": null
    },
    {
        "humid continental": "humid continental climate"
    },
    {
        " influence , categorized in the latter by the 42  °C isotherm.  The citys climate is influenced by its inland position and higher altitude. Winters are changeable, with either mild or cold weather: the average temperature is around  to , while summers are generally warm, mostly around  at night to  in the afternoon. Precipitation is evenly spread throughout the year, although February and April tend to be a bit drier whereas July tends to have more rainfall.                 Nuremberg has been a destination for immigrants. 42% of the residents had an immigrant background in 42 .                Nuremberg for many people is still associated with its traditional gingerbread  products, sausages, and handmade toys. ": null
    },
    {
        "Pocket watch": "pocket watch"
    },
    {
        "es —  Nuremberg eggs  — were made here in the 42th century by ": null
    },
    {
        "Peter Henlein": "peter henlein"
    },
    {
        ". Only one of the districts in the 4242 sample was early industrial; the economic structure of the region around Nuremberg was dominated by metal and glass manufacturing, reflected by a share of nearly 42% handicrafts and workers.  In the 42th century Nuremberg became the industrial heart of ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        " with companies such as ": null
    },
    {
        "Siemens": "siemens"
    },
    {
        " and ": null
    },
    {
        "MAN": "man se"
    },
    {
        " establishing a strong base in the city. Nuremberg is still an important industrial centre with a strong standing in the markets of Central and Eastern Europe. Items manufactured in the area include electrical equipment, mechanical and optical products, motor vehicles, writing and drawing paraphernalia, stationery products and printed materials.     The city is also strong in the fields of automation, energy and medical technology. Siemens is still the largest industrial employer in the Nuremberg region but a good third of German market research agencies are also located in the city. The ": null
    },
    {
        "Nuremberg International Toy Fair": "nuremberg international toy fair"
    },
    {
        " is the largest of its kind in the world.           Nuremberg is ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        "’s second largest city after ": null
    },
    {
        "Munich": "munich"
    },
    {
        ", and a popular tourist destination for foreigners and Germans alike. It was a leading city 42 years ago, but 42% of the town was destroyed in 42 during the war. After ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", many medieval-style areas of the town were rebuilt.     ": null
    },
    {
        "Imperial Castle": "nuremberg castle"
    },
    {
        ", ": null
    },
    {
        "St. Lorenz Church": "st. lorenz, nuremberg"
    },
    {
        ", and ": null
    },
    {
        "Nazi Trial grounds": "nuremberg trials"
    },
    {
        ", there are 42 different museums for arts and culture, history, science and technology, family and children, and more niche categories,  where visitors can see the world’s oldest globe , a 42-year-old Madonna, and Renaissance-era German art.  There are several types of tours offered in the city, including historic tours, those that are ": null
    },
    {
        "Nazi": "nazi party"
    },
    {
        "-focused, underground and night tours, ": null
    },
    {
        "walking tour": "walking tour"
    },
    {
        "s, sightseeing buses, self guided tours, and an old town tour on a mini train. Nuremberg also offers several parks and green areas, as well as indoor activities such as ": null
    },
    {
        "bowling": "bowling"
    },
    {
        ", ": null
    },
    {
        "rock wall climbing,": "bouldering"
    },
    {
        " escape room": "escape room"
    },
    {
        "s, ": null
    },
    {
        "cart racing": "kart racing"
    },
    {
        ", and ": null
    },
    {
        "mini golf": "miniature golf"
    },
    {
        ", theaters and cinemas, pools and ": null
    },
    {
        "thermal spa": "thermal spa"
    },
    {
        "s. There are also six nearby ": null
    },
    {
        "amusement park": "amusement park"
    },
    {
        "s. The city’s tourism board sells the Nurnberg Card which allows for free use of ": null
    },
    {
        "public transport": "public transport"
    },
    {
        "ation and free entry to all museums and attractions in Nuremberg for a two day period.     ": null
    },
    {
        "lebkuchen": "lebkuchen"
    },
    {
        ", ": null
    },
    {
        "gingerbread": "gingerbread"
    },
    {
        ", local ": null
    },
    {
        "beer": "beer"
    },
    {
        ", and Nürnberger Rostbratwürstchen, or Nuremberg sausages. There are hundreds of restaurants for all tastes, including traditional ": null
    },
    {
        "franconia": "franconia"
    },
    {
        "n restaurants and ": null
    },
    {
        "beer garden": "beer garden"
    },
    {
        "s. Also offers 42 ": null
    },
    {
        "vegan": "veganism"
    },
    {
        " and ": null
    },
    {
        "vegetarian": "vegetarianism"
    },
    {
        " restaurants, seven fully ": null
    },
    {
        "organic": "organic food"
    },
    {
        " restaurants. Nuremberg also boasts a two ": null
    },
    {
        "Michelin Star": "michelin guide"
    },
    {
        " rated restaurant, Essigbrätlein.     ": null
    },
    {
        "pedestrian-only zone": "pedestrian zone"
    },
    {
        " covering a large portion of the old town, which is a main destination for shopping and specialty retail,  including year-round ": null
    },
    {
        "Christmas": "christmas"
    },
    {
        " stores where tourists and locals alike can purchase ": null
    },
    {
        "Christmas ornament": "christmas ornament"
    },
    {
        "s, gifts, decorations, and additions to their toy ": null
    },
    {
        "Christmas village": "christmas village"
    },
    {
        "s. The Craftsmens Courtyard, or Handwerkerhof, is another tourist shopping destination in the style of a ": null
    },
    {
        "medieval": "middle ages"
    },
    {
        " village. It houses several local family-run businesses which sell handcrafted items from ": null
    },
    {
        "glass": "glass"
    },
    {
        ", ": null
    },
    {
        "wood": "wood"
    },
    {
        ", ": null
    },
    {
        "leather": "leather"
    },
    {
        ", ": null
    },
    {
        "pottery": "pottery"
    },
    {
        ", and ": null
    },
    {
        "precious metal": "precious metal"
    },
    {
        "s. The Handwerkerhof is also home to traditional German restaurants and beer gardens.      The Pedestrian zones of Nuremberg host festivals and markets throughout the year, most well known being ": null
    },
    {
        "Christkindlesmarkt": "christkindlesmarkt, nuremberg"
    },
    {
        ", Germany’s largest ": null
    },
    {
        "Christmas market": "christmas market"
    },
    {
        " and the gingerbread capital of the world. Visitors to the Christmas market can peruse the hundreds of stalls and purchase local wood crafts, ": null
    },
    {
        "nutcracker": "nutcracker"
    },
    {
        "s, smokers, and prune people, while sampling Christmas sweets and traditional ": null
    },
    {
        "gluhwein": "mulled wine"
    },
    {
        ".       There are over 42 registered places of accommodation in Nuremberg, ranging from ": null
    },
    {
        "hostel": "hostel"
    },
    {
        "s to luxury ": null
    },
    {
        "hotel": "hotel"
    },
    {
        "s, ": null
    },
    {
        "bed and breakfast": "bed and breakfast"
    },
    {
        "s, to multi-hundred room properties. As of 42 April 42 Nuremberg had 42 ": null
    },
    {
        "AirBnB": "airbnb"
    },
    {
        " listings.           Nuremberg was an early centre of humanism, science, printing, and mechanical invention. The city contributed much to the science of ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        ". In 42 Johannes Mueller of ": null
    },
    {
        "Königsberg": "königsberg, bavaria"
    },
    {
        " , later called ": null
    },
    {
        "Regiomontanus": "regiomontanus"
    },
    {
        ", built an astronomical observatory in Nuremberg and published many important astronomical charts.     In 42 ": null
    },
    {
        "Albrecht Dürer": "albrecht dürer"
    },
    {
        ", a native of Nuremberg, created woodcuts of the first maps of the stars of the northern and southern hemispheres, producing the first printed star charts, which had been ordered by ": null
    },
    {
        "Johannes Stabius": "johannes stabius"
    },
    {
        ". Around 42 Dürer also published the Stabiussche Weltkarte , the first perspective drawing of the terrestrial globe.  Perhaps most famously, the main part of ": null
    },
    {
        "Nicolaus Copernicus": "nicolaus copernicus"
    },
    {
        "s work was published in Nuremberg in 42     Printers and publishers have a long history in Nuremberg. Many of these publishers worked with well-known artists of the day to produce books that could also be considered works of art. In 42 ": null
    },
    {
        "Anton Koberger": "anton koberger"
    },
    {
        " opened Europes first print shop in Nuremberg. In 42 he published the Nuremberg Chronicles, also known as the World Chronicles , an illustrated history of the world from the creation to the present day. It was written in the local Franconian dialect by ": null
    },
    {
        "Hartmann Schedel": "hartmann schedel"
    },
    {
        " and had illustrations by ": null
    },
    {
        "Michael Wohlgemuth": "michael wolgemut"
    },
    {
        ", ": null
    },
    {
        "Wilhelm Pleydenwurff": "hans pleydenwurff"
    },
    {
        ", and Albrecht Dürer. Others furthered geographical knowledge and travel by map making. Notable among these was navigator and geographer ": null
    },
    {
        "Martin Behaim": "martin behaim"
    },
    {
        ", who made the first world globe.     Sculptors such as ": null
    },
    {
        "Veit Stoss": "veit stoss"
    },
    {
        ", ": null
    },
    {
        "Adam Kraft": "adam kraft"
    },
    {
        " and ": null
    },
    {
        "Peter Vischer": "peter vischer the elder"
    },
    {
        " are also associated with Nuremberg.     Composed of prosperous artisans, the guilds of the ": null
    },
    {
        "Meistersinger": "meistersinger"
    },
    {
        "s flourished here. ": null
    },
    {
        "Richard Wagner": "richard wagner"
    },
    {
        " made their most famous member, ": null
    },
    {
        "Hans Sachs": "hans sachs"
    },
    {
        ", the hero of his opera  Die Meistersinger von Nürnberg . Baroque composer ": null
    },
    {
        "Johann Pachelbel": "johann pachelbel"
    },
    {
        " was born here and was organist of ": null
    },
    {
        "St. Sebaldus Church": "st. sebaldus church"
    },
    {
        ".     The ": null
    },
    {
        "academy of fine arts": "academy of fine arts, nuremberg"
    },
    {
        " situated in Nuremberg is the oldest art academy in central Europe and looks back to a tradition of 42 years of artistic education.     Nuremberg is also famous for its ": null
    },
    {
        "Christkindlesmarkt": "christkindlesmarkt, nuremberg"
    },
    {
        " , which draws well over a million shoppers each year. The market is famous for its handmade ornaments and delicacies.           ": null
    },
    {
        "Germanisches Nationalmuseum": "germanisches nationalmuseum"
    },
    {
        " House of Albrecht Dürer": "albrecht dürers house"
    },
    {
        " Kunsthalle Nürnberg": "kunsthalle nürnberg"
    },
    {
        " Kunstverein Nürnberg": "kunstverein nürnberg"
    },
    {
        " Neues Museum Nürnberg": "neues museum nürnberg"
    },
    {
        "   Nuremberg Toy Museum": "nuremberg toy museum"
    },
    {
        " Nuremberg Transport Museum": "nuremberg transport museum"
    },
    {
        "             The ": null
    },
    {
        "Nuremberg State Theatre": "staatstheater nürnberg"
    },
    {
        ", founded in 42 is dedicated to all types of opera, ballet and stage theatre. During the season 42/42 the theatre presented 42 performances for an audience of 42 persons.  The State Philharmonic Nuremberg  is the orchestra of the ": null
    },
    {
        "State Theatre": "staatstheater nürnberg"
    },
    {
        ". Its name was changed in 42 from its previous name: The Nuremberg Philharmonic . It is the second-largest opera orchestra in Bavaria.  Besides opera performances, it also presents its own subscription concert series in the ": null
    },
    {
        "Meistersingerhalle": "meistersingerhalle"
    },
    {
        ". ": null
    },
    {
        "Christof Perick": "christof perick"
    },
    {
        " was the principal conductor of the orchestra between 42–42 ": null
    },
    {
        "Marcus Bosch": "marcus bosch"
    },
    {
        " heads the orchestra since September 42 .     The ": null
    },
    {
        "Nuremberg Symphony Orchestra": "nuremberg symphony orchestra"
    },
    {
        "  performs around 42 concerts a year to a combined annual audience of more than 42.  The regular subscription concert series are mostly performed in the Meistersingerhalle but other venues are used as well, including the new concert hall of the Kongresshalle and the Serenadenhof. ": null
    },
    {
        "Alexander Shelley": "alexander shelley"
    },
    {
        " has been the principal conductor of the orchestra since 42     The Nuremberg International Chamber Music Festival  takes place in early September each year, and in 42 celebrated its tenth anniversary. Concerts take place around the city; opening and closing events are held in the medieval Burg. The ": null
    },
    {
        "Bardentreffen": "bardentreffen"
    },
    {
        ", an annual folk festival in Nuremberg, has been deemed the largest ": null
    },
    {
        "world music": "world music"
    },
    {
        " festival in Germany and takes place since 42 42 the Bardentreffen starred 42 artists from 42 nations.           Nuremberg is known for Nürnberger ": null
    },
    {
        "Bratwurst": "bratwurst"
    },
    {
        ", which is shorter and thinner than other bratwurst sausages.     Another Nuremberg speciality is Nürnberger ": null
    },
    {
        "Lebkuchen": "lebkuchen"
    },
    {
        ", a kind of gingerbread eaten mainly around Christmas time.             Nuremberg offers 42 public and 42 private elementary schools in nearly all of its districts. Secondary education is offered at 42 ": null
    },
    {
        "Mittelschule": "mittelschule"
    },
    {
        "n, 42 ": null
    },
    {
        "Realschule": "realschule"
    },
    {
        "n, and 42 ": null
    },
    {
        "Gymnasien": "gymnasium"
    },
    {
        " . There are also several other providers of secondary education such as Berufsschule, Berufsfachschule, Wirtschaftsschule etc.        Nuremberg hosts the joint university ": null
    },
    {
        "Friedrich-Alexander-Universität Erlangen-Nürnberg": "university of erlangen-nuremberg"
    },
    {
        ", two Fachhochschulen , an art school , and a music conservatoire .  There are also private schools such as the Akademie Deutsche POP Nürnberg offering higher education.         ": null
    },
    {
        "Nuremberg Castle": "nuremberg castle"
    },
    {
        ": the three castles that tower over the city including central burgraves castle, with Free Reichs buildings to the east, the Imperial castle to the west.    Heilig-Geist-Spital . In the centre of the city, on the bank of the river Pegnitz, stands the Hospital of the Holy Spirit. Founded in 42 this is one of the largest hospitals of the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ". Lepers were kept here at some distance from the other patients. It now houses elderly persons and a restaurant.   The Hauptmarkt, dominated by the front of the unique ": null
    },
    {
        "Gothic": "gothic architecture"
    },
    {
        " Frauenkirche": "nuremberg frauenkirche"
    },
    {
        " , provides a picturesque setting for the famous ": null
    },
    {
        "Christmas market": "christkindlesmarkt, nuremberg"
    },
    {
        ". A main attraction on the square is the Gothic  Schöner Brunnen  which was erected around 42 but subsequently replaced with a replica . The unchanged ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " bridge  Fleischbrücke  crosses the Pegnitz nearby.   The ": null
    },
    {
        "Gothic": "gothic architecture"
    },
    {
        " Lorenzkirche": "st. lorenz, nuremberg"
    },
    {
        " dominates the southern part of the walled city and is one of the most important buildings in Nuremberg. The main body was built around 42–42   The even earlier and equally impressive ": null
    },
    {
        "Sebalduskirche": "st. sebaldus church"
    },
    {
        " is St. Lorenzs counterpart in the northern part of the old city.   The church of the former  Katharinenkloster  is preserved as a ruin, the ": null
    },
    {
        "charterhouse": "nuremberg charterhouse"
    },
    {
        "  is integrated into the building of the ": null
    },
    {
        "Germanisches Nationalmuseum": "germanisches nationalmuseum"
    },
    {
        " and the choir of the former Franziskanerkirche is part of a modern building.   Other churches located inside the city walls are: ": null
    },
    {
        "St. Laurences": "st. lorenz"
    },
    {
        ", ": null
    },
    {
        "Saint Clares": "saint clare of assisi"
    },
    {
        ", ": null
    },
    {
        "Saint Marthas": "st. martha, nuremberg"
    },
    {
        ", ": null
    },
    {
        "Saint James the Greaters": "st. jakob, nuremberg"
    },
    {
        ", ": null
    },
    {
        "Saint Giless": "st. egidien, nuremberg"
    },
    {
        ", and ": null
    },
    {
        "Saint Elisabeths": "st. elizabeth, nuremberg"
    },
    {
        ".   The ": null
    },
    {
        "Germanisches Nationalmuseum": "germanisches nationalmuseum"
    },
    {
        " is Germanys largest museum of cultural history, among its exhibits are works of famous painters such as Albrecht Dürer, ": null
    },
    {
        "Rembrandt": "rembrandt"
    },
    {
        ", and ": null
    },
    {
        "Ernst Ludwig Kirchner": "ernst ludwig kirchner"
    },
    {
        ".   The Neues Museum Nürnberg is a museum for modern and contemporary art.   The Walburga Chapel and the Romanesque Doppelkapelle are part of Nuremberg Castle.   The Johannisfriedhof is a medieval cemetery, containing many old graves . The Rochusfriedhof or the Wöhrder Kirchhof are near the Old Town.   The ": null
    },
    {
        "Chain Bridge": "chain bridge"
    },
    {
        " , the first chain bridge on the European continent.   The ": null
    },
    {
        "Tiergarten Nürnberg": "tiergarten nürnberg"
    },
    {
        " is a zoo stretching over more than  in the ": null
    },
    {
        "Nürnberger Reichswald": "nürnberger reichswald"
    },
    {
        " forest.   There is also a medieval market just inside the city walls, selling handcrafted goods.   The    is located in Nuremberg.   The ": null
    },
    {
        "Nuremberg Ring": ":file:nuremberg ring.jpg"
    },
    {
        " is said to bring good luck to those that spin it.   The ": null
    },
    {
        "Nazi party rally grounds": "nazi party rally grounds"
    },
    {
        " with the ": null
    },
    {
        "documentation-center": "documentation center nazi party rally grounds"
    },
    {
        ".             The citys location next to numerous highways, railways, and a waterway has contributed to its rising importance for trade with Eastern Europe.             ": null
    },
    {
        "Nürnberg Hauptbahnhof": "nürnberg hauptbahnhof"
    },
    {
        " is a stop for ": null
    },
    {
        "IC": "intercity"
    },
    {
        " and ": null
    },
    {
        "ICE": "intercity-express"
    },
    {
        " trains on the German long-distance railway network. The ": null
    },
    {
        "Nuremberg–Ingolstadt–Munich high-speed line": "nuremberg–munich high-speed railway"
    },
    {
        " with  operation opened 42 May 42 and was fully integrated into the rail schedule on 42 December 42 Travel times to Munich have been reduced to as little as one hour. The ": null
    },
    {
        "Nuremberg–Erfurt high-speed railway": "nuremberg–erfurt high-speed railway"
    },
    {
        " opened in December 42          The ": null
    },
    {
        "Nuremberg tramway network": "trams in nuremberg"
    },
    {
        " was opened in 42 , it extended a total length of , had six lines, and carried 42 million passengers annually. The first segment of the ": null
    },
    {
        "Nuremberg U-Bahn": "nuremberg u-bahn"
    },
    {
        " metro system was opened in 42 Nurembergs trams, ": null
    },
    {
        "bus": "bus"
    },
    {
        "es and metro system are operated by the  , itself a member of the  .     There is also a ": null
    },
    {
        "Nuremberg S-Bahn": "nuremberg s-bahn"
    },
    {
        " suburban metro railway and a regional train network, both centred on ": null
    },
    {
        "Nürnberg Hauptbahnhof": "nürnberg hauptbahnhof"
    },
    {
        ".   Since 42 Nuremberg has had the first U-Bahn in Germany that works without a driver. It also was the first subway system worldwide in which both driver-operated trains and computer-controlled trains shared tracks.             Nuremberg is located at the junction of several important Autobahn routes. The ": null
    },
    {
        "A42": "bundesautobahn 3"
    },
    {
        "  passes in a south-easterly direction along the north-east of the city. The ": null
    },
    {
        "A42": "bundesautobahn 9"
    },
    {
        " passes in a north–south direction on the east of the city. The ": null
    },
    {
        "A42": "bundesautobahn 6"
    },
    {
        "  passes in an east–west direction to the south of the city. Finally, the ": null
    },
    {
        "A42": "bundesautobahn 73"
    },
    {
        " begins in the south-east of Nuremberg and travels north-west through the city before continuing towards Fürth and ": null
    },
    {
        "Bamberg": "bamberg"
    },
    {
        ".       ": null
    },
    {
        "Nuremberg Airport": "nuremberg airport"
    },
    {
        " has flights to major German cities and many European destinations. The largest operators are currently ": null
    },
    {
        "Eurowings": "eurowings"
    },
    {
        ", ": null
    },
    {
        "TUI fly Deutschland": "tui fly deutschland"
    },
    {
        " and ": null
    },
    {
        "SunExpress Deutschland": "sunexpress deutschland"
    },
    {
        ", while the low-cost ": null
    },
    {
        "Ryanair": "ryanair"
    },
    {
        " and ": null
    },
    {
        "Wizz Air": "wizz air"
    },
    {
        " companies connect the city to various European centres. A significant amount of the airports traffic flies to and from mainly touristic destinations during the peak winter season. The airport is the terminus of subway line 42; it is the only airport in Germany served by a subway.       Nuremberg is an important port on the ": null
    },
    {
        "Rhine–Main–Danube Canal": "rhine–main–danube canal"
    },
    {
        ".              ": null
    },
    {
        "42 FC Nürnberg": "1. fc nürnberg"
    },
    {
        ", known locally as Der Club , was founded in 42 and currently plays in the ": null
    },
    {
        "Bundesliga": "bundesliga"
    },
    {
        ". The official colours of the association are red and white, but the traditional colours are red and black. The current chairmen are Nils Rossow and Robert Palikuca. They play in ": null
    },
    {
        "Max-Morlock-Stadion": "max-morlock-stadion"
    },
    {
        " which was refurbished for the ": null
    },
    {
        "42 FIFA World Cup": "2006 fifa world cup"
    },
    {
        " and accommodates 42 spectators.     German Champion: 42 42 42 42 42 42 42 42 42   German Cup: 42 42 42 42       The SELLBYTEL Baskets Nürnberg played in the ": null
    },
    {
        "Basketball Bundesliga": "basketball bundesliga"
    },
    {
        " from 42 to 42 Since then, teams from Nuremberg have attempted to return to Germanys elite league. The recently founded ": null
    },
    {
        "Nürnberg Falcons BC": "nürnberg falcons bc"
    },
    {
        " have already established themselves as one of the main teams in Germanys second division ": null
    },
    {
        "ProA": "proa"
    },
    {
        " and aim to take on the heritage of the SELLBYTEL Baskets Nürnberg. The Falcons play their home games at the Halle im Berufsbildungszentrum .              Nuremberg is ": null
    },
    {
        "twinned": "twin towns and sister cities"
    },
    {
        " with:      ": null
    },
    {
        "Venice": "venice"
    },
    {
        ", Italy, since 42    ": null
    },
    {
        "Nice": "nice"
    },
    {
        ", France, since 42    ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        ", Poland, since 42    ": null
    },
    {
        "Skopje": "skopje"
    },
    {
        ", North Macedonia, since 42    ": null
    },
    {
        "San Carlos": "san carlos, río san juan"
    },
    {
        ", Nicaragua, since 42    ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        ", Scotland, United Kingdom, since 42    ": null
    },
    {
        "Prague": "prague"
    },
    {
        ", Czech Republic, since 42    ": null
    },
    {
        "Kharkiv": "kharkiv"
    },
    {
        ", Ukraine, since 42    ": null
    },
    {
        "Hadera": "hadera"
    },
    {
        ", Israel, since 42    ": null
    },
    {
        "Shenzhen": "shenzhen"
    },
    {
        ", China, since 42    ": null
    },
    {
        "Antalya": "antalya"
    },
    {
        ", Turkey, since 42    ": null
    },
    {
        "Kavala": "kavala"
    },
    {
        ", Greece, since 42    ": null
    },
    {
        "Atlanta": "atlanta"
    },
    {
        ", United States, since 42    ": null
    },
    {
        "Córdoba": "córdoba, spain"
    },
    {
        ", Spain, since 42          Apart from the official twin towns , there are a number with which Nuremberg maintains cordial relations :           Nuremberg also engages in cooperation with various other cities internationally:      ": null
    },
    {
        "Bologna": "bologna"
    },
    {
        ", Italy 42    ": null
    },
    {
        "Changping": "changping township, fusui county"
    },
    {
        ", China 42                                          ;The Arts   ": null
    },
    {
        "Michael Wolgemut": "michael wolgemut"
    },
    {
        " a German painter and printmaker  retrieved 42 October 42   ": null
    },
    {
        "Hans Folz": "hans folz"
    },
    {
        " a German author and poet   ": null
    },
    {
        "Veit Stoss": "veit stoss"
    },
    {
        " a Renaissance German sculptor, mostly in wood  retrieved 42 November 42   ": null
    },
    {
        "Peter Vischer the Elder": "peter vischer the elder"
    },
    {
        " a German sculptor  retrieved 42 October 42   ": null
    },
    {
        "Adam Kraft": "adam kraft"
    },
    {
        " a German stone sculptor, master builder and architect  retrieved 42 October 42   ": null
    },
    {
        "Albrecht Dürer": "albrecht dürer"
    },
    {
        " a painter, engraver, printmaker and theorist of the German Renaissance  retrieved 42 October 42   ": null
    },
    {
        "Hans Leonhard Schäufelein": "hans leonhard schäufelein"
    },
    {
        " an artist, painter and designer of woodcuts  retrieved 42 November 42   ": null
    },
    {
        "Augustin Hirschvogel": "augustin hirschvogel"
    },
    {
        " an artist, mathematician and cartographer   ": null
    },
    {
        "Michael Sigismund Frank": "michael sigismund frank"
    },
    {
        " a Catholic artist, rediscovered glass-painting  retrieved 42 November 42   ": null
    },
    {
        "Lorenz Ritter": "lorenz ritter"
    },
    {
        " a German painter and etcher  retrieved 42 October 42   ": null
    },
    {
        "Philipp Rupprecht": "philipp rupprecht"
    },
    {
        " a German cartoonist of anti-Semitic caricatures   ": null
    },
    {
        "Hermann Kesten": "hermann kesten"
    },
    {
        " novelist and dramatist   ": null
    },
    {
        "Eliyahu Koren": "eliyahu koren"
    },
    {
        " a master typographer, graphic artist and designer   ": null
    },
    {
        "Peter Angermann": "peter angermann"
    },
    {
        " a German painter    ": null
    },
    {
        "Christoph Dreher": "christoph dreher"
    },
    {
        " a German filmmaker, musician and scriptwriter  retrieved 42 November 42   ": null
    },
    {
        "Katy Garretson": "katy garretson"
    },
    {
        " an American TV director and producer  retrieved 42 November 42   ": null
    },
    {
        "Martina Schradi": "martina schradi"
    },
    {
        " author, cartoonist and psychologist     ;Music   ": null
    },
    {
        "Conrad Paumann": "conrad paumann"
    },
    {
        " a German organist, lutenist and composer   ": null
    },
    {
        "Hans Sachs": "hans sachs"
    },
    {
        " a German ": null
    },
    {
        "Meistersinger": "meistersinger"
    },
    {
        ", poet, playwright, and shoemaker  retrieved 42 October 42   ": null
    },
    {
        "Sebald Heyden": "sebald heyden"
    },
    {
        " a ": null
    },
    {
        "musicologist": "musicologist"
    },
    {
        ", cantor, theologian and hymn-writer   ": null
    },
    {
        "Johann Pachelbel": "johann pachelbel"
    },
    {
        " a composer, organist, and teacher  retrieved 42 October 42   ": null
    },
    {
        "Hugo Distler": "hugo distler"
    },
    {
        " a German organist, choral conductor, teacher and composer   ": null
    },
    {
        "Martha Mödl": "martha mödl"
    },
    {
        " a German Wagner soprano/mezzo-soprano   ": null
    },
    {
        "Chaya Arbel": "chaya arbel"
    },
    {
        " an Israeli female classical composer    ": null
    },
    {
        "Siegfried Jerusalem": "siegfried jerusalem"
    },
    {
        " a German operatic tenor   ": null
    },
    {
        "Kevin Coyne": "kevin coyne"
    },
    {
        " an English musician, singer, composer, film-maker, and writer  retrieved 42 November 42   ": null
    },
    {
        "Rudi Mahall": "rudi mahall"
    },
    {
        " a contemporary jazz bass clarinet player     ;Acting   ": null
    },
    {
        "Margarete Haagen": "margarete haagen"
    },
    {
        " a German stage and film actress  retrieved 42 November 42   ": null
    },
    {
        "Wolfgang Preiss": "wolfgang preiss"
    },
    {
        " a German theatre, film and TV actor  retrieved 42 November 42   ": null
    },
    {
        "Heinz Bernard": "heinz bernard"
    },
    {
        " a British actor and director and theatre manager  retrieved 42 October 42    ": null
    },
    {
        "Annette Carell": "annette carell"
    },
    {
        " an American actress of stage, screen, and television  retrieved 42 November 42   ": null
    },
    {
        "George Clooney": "george clooney"
    },
    {
        " an American actor, director, producer and filmmaker  retrieved 42 October 42   ": null
    },
    {
        "Sandra Bullock": "sandra bullock"
    },
    {
        " an American actress, producer, and philanthropist  retrieved 42 October 42   ": null
    },
    {
        "Tom Beck": "tom beck"
    },
    {
        " a German actor, singer, and entrepreneur  retrieved 42 October 42     ;Science & Business   ": null
    },
    {
        "Anton Koberger": "anton koberger"
    },
    {
        " a goldsmith, printer and publisher  retrieved 42 November 42   ": null
    },
    {
        "Katerina Lemmel": "katerina lemmel"
    },
    {
        " a patrician businesswoman and ": null
    },
    {
        "Birgittine": "birgittine"
    },
    {
        " nun   ": null
    },
    {
        "Peter Henlein": "peter henlein"
    },
    {
        " locksmith and clockmaker, invented the worlds first watch   ": null
    },
    {
        "Kunz Lochner": "kunz lochner"
    },
    {
        " , plate armourer, blacksmith and silversmith   ": null
    },
    {
        "Joachim Camerarius the Younger": "joachim camerarius the younger"
    },
    {
        " a physician, botanist and zoologist  retrieved 42 October 42   ": null
    },
    {
        "Johann Christoph Volkamer": "johann christoph volkamer"
    },
    {
        " a German merchant, manufacturer and botanist   ": null
    },
    {
        "Maria Sybilla Merian": "maria sybilla merian"
    },
    {
        " a naturalist and scientific illustrator   ": null
    },
    {
        "Johann Philipp von Wurzelbauer": "johann philipp von wurzelbauer"
    },
    {
        " , astronomer   ": null
    },
    {
        "John Miller": "john miller"
    },
    {
        " a German engraver and botanist active in London  retrieved 42 November 42   ": null
    },
    {
        "Johann Kaspar Hechtel": "johann kaspar hechtel"
    },
    {
        " a brass factory owner, non-fiction writer and designer of parlour games   ": null
    },
    {
        "Ernst von Bibra": "ernst von bibra"
    },
    {
        " a German scientist, naturalist and author   ": null
    },
    {
        "Friedrich Sigmund Merkel": "friedrich sigmund merkel"
    },
    {
        " anatomist": "anatomist"
    },
    {
        " and ": null
    },
    {
        "histopathologist": "histopathologist"
    },
    {
        " Siegfried Bettmann": "siegfried bettmann"
    },
    {
        " bicycle, motorcycle and car manufacturer   ": null
    },
    {
        "Ernst Freiherr Stromer von Reichenbach": "ernst stromer"
    },
    {
        " a paleontologist   ": null
    },
    {
        "Ulrich Rück": "ulrich rück"
    },
    {
        "          ": null
    }
]