[
    {
        "Nuu-chah-nulth Mythology is the historical oral history of the ": null
    },
    {
        "Nuu-chah-nulth": "nuu-chah-nulth people"
    },
    {
        ", a group of indigenous peoples living on ": null
    },
    {
        "Vancouver Island": "vancouver island"
    },
    {
        " in ": null
    },
    {
        "British Columbia": "british columbia"
    },
    {
        ".     Many animals have a spirit associated with them; for example, ": null
    },
    {
        "Chulyen": "chulyen"
    },
    {
        " and ": null
    },
    {
        "Guguyni": "guguyni"
    },
    {
        " are ": null
    },
    {
        "trickster": "trickster"
    },
    {
        " gods.   Two brothers, ": null
    },
    {
        "Tihtipihin": "tihtipihin"
    },
    {
        " and ": null
    },
    {
        "Kwatyat": "kwatyat"
    },
    {
        ", were willingly swallowed by a monster because they needed to rescue their mother, who had already been swallowed. The brothers then cut through the stomach and, with their mother, escaped.   ": null
    },
    {
        "Andakout": "andakout"
    },
    {
        " was born from the ": null
    },
    {
        "mucus": "mucus"
    },
    {
        " or tears of a woman whose children had been stolen by ": null
    },
    {
        "Malahas": "malahas"
    },
    {
        " . He rescued the children and killed Malahas.       Matlose is a famous hob-goblin of the Nootkas; he is a very Caliban of spirits; his head is like the head of something that might have been man but is not; his uncouth bulk is horrid with black bristles, his monstrous teeth and nails are like the claws of a bear. Whoever hears his terrible voice falls like one smitten, and his curved claws rend a prey into morsels with a single stroke.       One morning, as the tide went out, the old people came to sit and watch the ocean. As they sat there, they saw a woman walking along the beach. Her hair was long and strung into eight braids. Her name was Octopus. There was a digging stick in her hand. She was going to look for clams. She sat down on a rock at the edge of the water and began to dig.     Soon, another person came along the beach. That person was tall with glossy black hair.     Look, one of the old people said, Here comes Raven. He is going to bother Octopus.               ": null
    }
]