[
    {
        "        The Oberkommando der Wehrmacht  was the High Command of the ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        " of ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ". Created in 42 the OKW replaced the ": null
    },
    {
        "Reich War Ministry": "reich war ministry"
    },
    {
        " and had nominal oversight over the ": null
    },
    {
        "German Army": "german army"
    },
    {
        ", the ": null
    },
    {
        "Kriegsmarine": "kriegsmarine"
    },
    {
        " , and the ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " .     Rivalry with the armed services branch commands, mainly with the ": null
    },
    {
        "Army High Command": "oberkommando des heeres"
    },
    {
        " , prevented the OKW from becoming a unified ": null
    },
    {
        "German General Staff": "german general staff"
    },
    {
        " in an effective ": null
    },
    {
        "chain of command": "command hierarchy"
    },
    {
        ". It did help coordinate operations between the three services. During the war, the OKW, subordinate to ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " as Supreme Commander of the Wehrmacht, acquired more and more operational powers. By 42 OKW had responsibility for all theatres except for the ": null
    },
    {
        "Eastern Front": "eastern front"
    },
    {
        " against the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". However, Hitler manipulated the system in order to prevent any one command from taking a dominant role in decision making. This divide and conquer method helped put most military decisions in Hitlers own hands, which at times included even those affecting engagements at the battalion level.       The OKW was established by decree of 42 February 42 in the aftermath of the ": null
    },
    {
        "Blomberg-Fritsch Affair": "blomberg-fritsch affair"
    },
    {
        ", which had led to the dismissal of the head of the ": null
    },
    {
        "Reich War Ministry": "reich war ministry"
    },
    {
        " and Commander-in-chief of the ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        ", Generalfeldmarschall ": null
    },
    {
        "Werner von Blomberg": "werner von blomberg"
    },
    {
        ". Hitler took the chance to get rid of his critics within the armed forces. The Ministry was dissolved and replaced with the OKW led by General ": null
    },
    {
        "Wilhelm Keitel": "wilhelm keitel"
    },
    {
        " in the rank of a Reich Minister, with ": null
    },
    {
        "Alfred Jodl": "alfred jodl"
    },
    {
        " as Chief of the Operations Staff. Nevertheless, all Supreme Commanders of the armed service branches, like OKH Chief General ": null
    },
    {
        "Walther von Brauchitsch": "walther von brauchitsch"
    },
    {
        ", had direct access to Hitler and were able to circumvent Keitels command. The appointments made to the OKW and the motive behind the reorganization are commonly thought to be Hitlers desire to consolidate power and authority around his position as ": null
    },
    {
        "Führer": "führer"
    },
    {
        " and ": null
    },
    {
        "Reich Chancellor": "chancellor of germany"
    },
    {
        " , to the detriment of the military leadership of the Wehrmacht. Furthermore, Hitler did not want to create a tri-service joint command, or appointment of a single joint Chief of Staff, as he feared it would break his image of having the Midas touch concerning military strategy.         By June 42 the OKW comprised four departments:   Wehrmacht-Führungsamt  – operational orders. Chief: Colonel-General ": null
    },
    {
        "Alfred Jodl": "alfred jodl"
    },
    {
        ", 42 September 42 – 42 May 42   Abteilung Landesverteidigungsführungsamt a subdepartment through which all details of operational planning were worked out, and from which all operational orders were communicated to the OKW. Chief: Major General ": null
    },
    {
        "Walter Warlimont": "walter warlimont"
    },
    {
        ", 42 September 42 – 42 September 42; Major General ": null
    },
    {
        "Horst Freiherr Treusch von Buttlar-Brandenfels": "horst freiherr treusch von buttlar-brandenfels"
    },
    {
        ", 42 September 42 – 42 November 42; General ": null
    },
    {
        "August Winter": "august winter"
    },
    {
        ", 42 December 42 – 42 April 42   ": null
    },
    {
        "Wehrmacht Propaganda Troops": "wehrmacht propaganda troops"
    },
    {
        ": its function was to produce and disseminate propaganda materials aimed at the German troops and the population. Commanded by General ": null
    },
    {
        "Hasso von Wedel": "hasso von wedel"
    },
    {
        " , the department oversaw the numerous propaganda companies  of the Wehrmacht and the Waffen-SS, attached to the fighting troops. At its peak in 42 the propaganda troops included 42 men. Among the propaganda materials produced was the ": null
    },
    {
        "Wehrmachtbericht": "wehrmachtbericht"
    },
    {
        ", the official news communiqué about the military situation of Germany, and was intended for both domestic and foreign consumption. Heeresstab – army staff. Chief: General ": null
    },
    {
        "Walther Buhle": "walther buhle"
    },
    {
        ", 42 February 42 – 42 May 42   Inspekteur der Wehrmachtnachrichtenverbände – Chief of Staff, Wehrmacht signal corps    Amt Ausland/Abwehr  – foreign intelligence. Zentralabteilung – central department. Chief: Major General ": null
    },
    {
        "Hans Oster": "hans oster"
    },
    {
        ", 42 September 42 – January 42   Abteilung Ausland – foreign. Chief: Admiral ": null
    },
    {
        "Leopold Bürkner": "leopold bürkner"
    },
    {
        ", 42 June 42 -   Abteilung I, Nachrichtenbeschaffung – intelligence. Chief: Colonel ": null
    },
    {
        "Hans Piepenbrock": "hans piepenbrock"
    },
    {
        ", 42 September 42 – March 42; Colonel ": null
    },
    {
        "Georg Hansen": "georg hansen"
    },
    {
        ", March 42 – February 42   Abteilung II, Sonderdienst – special service. Chief: Colonel ": null
    },
    {
        "Erwin von Lahousen": "erwin von lahousen"
    },
    {
        ", 42 September 42 – July 42; Colonel ": null
    },
    {
        "Wessel Freytag von Loringhoven": "wessel freytag von loringhoven"
    },
    {
        ", July 42 – June 42   Abteilung III, Abwehr – counter-intelligence. Chief: Colonel ": null
    },
    {
        "Franz Eccard von Bentivegni,": ":de:franz eccard von bentivegni"
    },
    {
        " 42 March 42 -   Auslandsprüfstelle – foreign communications   Wirtschafts und Rüstungsamt – supply matters  Amtsgruppe Allgemeine Wehrmachtsangelegenheiten  – miscellaneous matters.    Deutsche Dienststelle  – information centre for war casualties and prisoners of war     The WFA replaced the Wehrmachtsamt which had existed between 42 and 42 within the Reich War Ministry, headed by General Wilhelm Keitel. Hitler promoted Keitel to Chief of the OKW , i.e. Chief of the Supreme Command of the Armed Forces. As head of the WFA, Keitel appointed ": null
    },
    {
        "Max von Viebahn": "max von viebahn"
    },
    {
        " although after two months he was removed from command, and this post was not refilled until the promotion of Alfred Jodl. To replace Jodl at Abteilung Landesverteidigungsführungsamt , ": null
    },
    {
        "Walther Warlimont": "walther warlimont"
    },
    {
        " was appointed. In December 42 further changes took place with Abteilung Landesverteidigungsführungsamt being merged into the Wehrmacht-Führungsamt and losing its role as a subordinate organization. These changes were largely cosmetic however as key staff remained in post and continued to fulfill the same duties.     The OKW directed the operations of the German Armed Forces during World War II. The OKW was almost always represented at daily situation conferences  by Jodl, Keitel, and the officer serving as Hitlers adjutant. During these conferences situation reports prepared by the head of WFA/L would be delivered to Hitler and then discussed. Following these discussions, Hitler would issue further operational orders. These orders were then relayed back to WFA/L by Jodl along with the minutes of the meeting. These would then be converted into orders for issuance to the appropriate commanders.                                   Officially, the OKW served as the military general staff for the Third Reich, coordinating the efforts of the Army, Navy, and Air Force . In practice, the OKW acted as Hitlers personal military staff, translating his ideas into military orders, and issuing them to the three services while having little control over them. However, as the war progressed the OKW found itself exercising increasing amounts of direct command authority over military units, particularly in the West. This created a situation such that by 42 the OKW held the  de facto  command of Western forces while the Army High Command  exercised de facto command of the ": null
    },
    {
        "Eastern Front": "eastern front"
    },
    {
        ". It was not until 42 April 42  that Hitler placed OKH under OKW, giving OKW command of forces on the Eastern Front.     Setting different parts of the Nazi bureaucracy to compete for his favor in areas where their administration overlapped was a standard tactic employed by Hitler to reinforce his authority; and just as in other areas of government, there was a rivalry between the OKW and the OKH. Since most German operations during World War II were Army controlled , the OKH demanded control over German military forces. Nevertheless, Hitler decided against the OKH and in favor of the OKW overseeing operations in many land theaters. As the war progressed, more and more influence moved from the OKH to the OKW, with ": null
    },
    {
        "Norway": "norway"
    },
    {
        " being the first OKW ": null
    },
    {
        "war theater": "theater"
    },
    {
        " . More and more areas came under complete control of the OKW. Finally only the Eastern Front remained the domain of the OKH. However, as the Eastern Front was by far the primary battlefield of the German military, the OKH was still influential, particularly when on 42 December 42 Hitler himself succeeded Walther von Brauchitsch as commander-in-chief of the OKH  during the ": null
    },
    {
        "Battle of Moscow": "battle of moscow"
    },
    {
        ".     The OKW ran military operations on the Western front, in ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        ", and in ": null
    },
    {
        "Italy": "italy"
    },
    {
        ". In the west, operations were further split between the OKW and  Oberbefehlshaber West  , who was Generalfeldmarschall ": null
    },
    {
        "Gerd von Rundstedt": "gerd von rundstedt"
    },
    {
        " .     There was even more fragmentation since the Kriegsmarine and Luftwaffe operations had their own commands  which, while theoretically subordinate, were largely independent from the OKW or the OBW.     During the entire period of the war, the OKW was led by Keitel, who reported directly to Hitler, from whom most operational orders actually originated as Oberster Befehlshaber der Wehrmacht . ": null
    },
    {
        "Albrecht von Hagen": "albrecht von hagen"
    },
    {
        ", a member of the ": null
    },
    {
        "failed assassination attempt": "july 20 plot"
    },
    {
        " on Hitler on 42 July 42 was stationed here to be responsible for the courier service between military posts in Berlin and Hitlers secret military headquarters known as the ": null
    },
    {
        "Wolfs Lair": "wolfsschanze"
    },
    {
        ".         During the ": null
    },
    {
        "Nuremberg Trials": "nuremberg trials"
    },
    {
        ", the OKW was indicted but acquitted of being a criminal organization because of Article 42 of the charter of the international military tribunal.          ": null
    },
    {
        "Wilhelm Keitel": "wilhelm keitel"
    },
    {
        " and ": null
    },
    {
        "Alfred Jodl": "alfred jodl"
    },
    {
        " were both convicted and sentenced to ": null
    },
    {
        "death by hanging": "hanging"
    },
    {
        ".     During the subsequent ": null
    },
    {
        "High Command Trial": "high command trial"
    },
    {
        " in 42/42 fourteen Wehrmacht officers were charged with ": null
    },
    {
        "war crime": "war crime"
    },
    {
        "s, especially for the ": null
    },
    {
        "Commissar Order": "commissar order"
    },
    {
        " to shoot ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " political commissars in German-occupied countries, the killing of ": null
    },
    {
        "POW": "prisoner-of-war"
    },
    {
        "s and participation in the ": null
    },
    {
        "Holocaust": "holocaust"
    },
    {
        ". Eleven defendants received prison sentences ranging from three years including time served to lifetime imprisonment, two were acquitted on all counts, and one committed suicide during the trial.    ": null
    }
]