[
    {
        "        The Object Management Group  is a computer industry ": null
    },
    {
        "standards": "standardization"
    },
    {
        " consortium": "consortium"
    },
    {
        ". OMG Task Forces develop enterprise integration standards for a range of technologies.       The goal of the OMG was a common portable and interoperable object model with methods and data that work using all types of development environments on all types of platforms.     The group provides only specifications, not implementations. But before a specification can be accepted as a standard by the group, the members of the submitter team must guarantee that they will bring a conforming product to market within a year. This is an attempt to prevent unimplemented standards. Other private companies or open source groups are encouraged to produce conforming products and OMG is attempting to develop mechanisms to enforce true interoperability.     OMG hosts four technical meetings per year for its members and interested nonmembers. The Technical Meetings provide a neutral forum to discuss, develop and adopt standards that enable software interoperability.       Founded in 1989 by eleven companies , OMGs initial focus was to create a heterogeneous ": null
    },
    {
        "distributed": "distributed computing"
    },
    {
        " object": "object"
    },
    {
        " standard. The founding executive team included Christopher Stone and John Slitz. Current leadership includes Chairman and CEO ": null
    },
    {
        "Richard Soley": "richard soley"
    },
    {
        ", President and COO Bill Hoffman and Vice President and Technical Director Larry L. Johnson.     Since 2000, the groups international headquarters has been located in ": null
    },
    {
        "Needham": "needham, massachusetts"
    },
    {
        ", ": null
    },
    {
        "Massachusetts": "massachusetts"
    },
    {
        ".            In 1997, the ": null
    },
    {
        "Unified Modeling Language": "unified modeling language"
    },
    {
        " was added to the list of OMG adopted technologies. UML is a standardized general-purpose modeling language in the field of object-oriented software engineering.     In June 2005, the Business Process Management Initiative and OMG announced the merger of their respective Business Process Management activities to form the Business Modeling and Integration Domain Task Force .     In 2006 the ": null
    },
    {
        "Business Process Model and Notation": "business process model and notation"
    },
    {
        " was adopted as a standard by OMG. In 2007 the ": null
    },
    {
        "Business Motivation Model": "business motivation model"
    },
    {
        " was adopted as a standard by the OMG. The BMM is a metamodel that provides a vocabulary for corporate governance and strategic planning and is particularly relevant to businesses undertaking ": null
    },
    {
        "governance": "governance"
    },
    {
        ", ": null
    },
    {
        "regulatory compliance": "regulatory compliance"
    },
    {
        ", ": null
    },
    {
        "business transformation": "business transformation"
    },
    {
        " and ": null
    },
    {
        "strategic planning": "strategic planning"
    },
    {
        " activities.     In 2009 OMG, together with the ": null
    },
    {
        "Software Engineering Institute": "software engineering institute"
    },
    {
        " at ": null
    },
    {
        "Carnegie Mellon": "carnegie mellon"
    },
    {
        " launched the ": null
    },
    {
        "Consortium of IT Software Quality": "cisq"
    },
    {
        " . In 2011 OMG formed the Cloud Standards Customer Council.  Founding sponsors included ": null
    },
    {
        "CA": "ca technologies"
    },
    {
        ", ": null
    },
    {
        "IBM": "ibm"
    },
    {
        ", ": null
    },
    {
        "Kaavo": "kaavo"
    },
    {
        ", ": null
    },
    {
        "Rackspace": "rackspace"
    },
    {
        " and ": null
    },
    {
        "Software AG": "software ag"
    },
    {
        ". The CSCC is an OMG end user advocacy group dedicated to accelerating clouds successful adoption, and drilling down into the standards, security and interoperability issues surrounding the transition to the cloud.     In September 2011, the OMG Board of Directors voted to adopt the Vector Signal and Image Processing Library as the latest OMG specification. Work for adopting the specification was led by ": null
    },
    {
        "Mentor Graphics": "mentor graphics"
    },
    {
        " Embedded Software Division, RunTime Computing Solutions, The ": null
    },
    {
        "Mitre Corporation": "mitre corporation"
    },
    {
        " as well as the High Performance Embedded Computing Software Initiative . VSIPL is an application programming interface . VSIPL and VSIPL++ contain functions used for common signal processing kernel and other computations. These functions include basic arithmetic, trigonometric, transcendental, signal processing, linear algebra, and image processing. The VSIPL family of libraries has been implemented by multiple vendors for a range of processor architectures, including x86, PowerPC, Cell, and NVIDIA GPUs. VSIPL and VSIPL++ are designed to maintain portability across a range of processor architectures. Additionally, VSIPL++ was designed from the start to include support for parallelism.     Late 2012 early 2013, the groups Board of Directors adopted the Automated Function Point specification.  The push for adoption was led by the Consortium for IT Software Quality . AFP provides a standard for automating the popular ": null
    },
    {
        "function point": "function point"
    },
    {
        " measure according to the counting guidelines of the International Function Point User Group .     On March 27 2014, OMG announced it would be managing the newly formed Industrial Internet Consortium .         Of the many standards maintained by the OMG, 11 have been ratified as ": null
    },
    {
        "ISO": "international organization for standardization"
    },
    {
        " standards.  These standards are:                   ": null
    }
]