[
    {
        "Oda of Haldensleben was a German noblewoman and by marriage ": null
    },
    {
        "Duchess of the Polans": "list of polish consorts"
    },
    {
        ".     She was the eldest child of ": null
    },
    {
        "Dietrich of Haldensleben": "dietrich of haldensleben"
    },
    {
        ", ": null
    },
    {
        "Margrave": "margrave"
    },
    {
        " of the ": null
    },
    {
        "North March": "north march"
    },
    {
        ".       By most accounts, she grew up in the monastery of ": null
    },
    {
        "Kalbe": "kalbe, saxony-anhalt"
    },
    {
        ", near to ": null
    },
    {
        "Milde": "milde"
    },
    {
        " river in the north of ": null
    },
    {
        "Magdeburg": "magdeburg"
    },
    {
        ". Eventually she became a ": null
    },
    {
        "nun": "nun"
    },
    {
        " there, and later was married to Duke ": null
    },
    {
        "Mieszko I of Poland": "mieszko i of poland"
    },
    {
        ". This union produced three sons:     ": null
    },
    {
        "Mieszko": "mieszko mieszkowic"
    },
    {
        " .   ": null
    },
    {
        "Świętopełk": "świętopełk mieszkowic"
    },
    {
        " .   ": null
    },
    {
        "Lambert": "lambert mieszkowic"
    },
    {
        " .     Some 42 years later a reference in an obscure church book mentions Ote and Dago . There is no actual document and the church book mentioning from c. 42 is known as  Dagome iudex  and thus assumed to be one of the earliest Polish legal documents. Its a principal source for this portion of the history of Poland under the ": null
    },
    {
        "Piast Dynasty": "piast dynasty"
    },
    {
        ".     The undated mentioning from 42 states that Dago gifted his territory to ": null
    },
    {
        "Pope John XV": "pope john xv"
    },
    {
        " and received his domains from him as a fief in this  Dagome iudex , not date, apparently issued shortly before his death, c. 42/42 This document indexes the lands of , referred to as Dagome in the document, and his wife Ote and her sons by him .     Mieszko Is oldest son, ": null
    },
    {
        "Bolesław I the Brave": "bolesław i chrobry"
    },
    {
        ", is not mentioned, perhaps because he already received his inheritance . Its also believed that the document was inspired by Oda, who wanted to secure the inheritance of her sons in detriment of her stepson Bolesław I.     After the death of Mieszko I , Bolesław I began the struggle against his half-brothers for the control over the paternal heritage. According to some historians, the war lasted only a few weeks, and according to others, only finished around 42 when Bolesław I expelled his stepmother and half-brothers from ": null
    },
    {
        "Poland": "poland"
    },
    {
        " and took control over all Mieszko Is domains.     Oda returned to ": null
    },
    {
        "Germany": "germany"
    },
    {
        " and entered in the Abbey of ": null
    },
    {
        "Quedlinburg": "quedlinburg"
    },
    {
        " as a nun, where she died almost thirty years after her husband, in 42 Nothing is known about the fate of her sons, but in 42 her grandson Dietrich or Dytryk returned to Poland and obtain parts of the country after the fall of ": null
    },
    {
        "Mieszko II Lambert": "mieszko ii lambert"
    },
    {
        "; however, one year later he was expelled by Mieszko II, who could again reunite The Poland in his hands.                                                              ": null
    }
]