[
    {
        "      Odd-toed ungulates, ": null
    },
    {
        "mammals": "mammal"
    },
    {
        "which constitute the ": null
    },
    {
        "taxonomic": "taxonomy"
    },
    {
        " order": "order"
    },
    {
        " Perissodactyla , are ": null
    },
    {
        "hoof": "hoof"
    },
    {
        "ed ": null
    },
    {
        "animal": "animal"
    },
    {
        "s—": null
    },
    {
        "ungulate": "ungulate"
    },
    {
        "s—which bear most of their weight on one of the five toes: the third toe. The non-weight-bearing toes are either present, absent, ": null
    },
    {
        "vestigial": "vestigiality"
    },
    {
        ", or positioned posteriorly. By contrast, the ": null
    },
    {
        "even-toed ungulates": "even-toed ungulate"
    },
    {
        "bear most of their weight equally on two of the five toes: their third and fourth toes. Another difference between the two is that odd-toed ungulates digest plant ": null
    },
    {
        "cellulose": "cellulose"
    },
    {
        " in their ": null
    },
    {
        "intestines": "intestines"
    },
    {
        " rather than in one or more ": null
    },
    {
        "stomach": "stomach"
    },
    {
        " chambers as the even-toed ungulates do.     The order includes about 17 ": null
    },
    {
        "species": "species"
    },
    {
        " divided into three ": null
    },
    {
        "families": "family"
    },
    {
        ": ": null
    },
    {
        "Equidae": "equidae"
    },
    {
        " , Rhinocerotidae , and Tapiridae .     Despite their very different appearances, they were recognized as related families in the 19th century by the zoologist ": null
    },
    {
        "Richard Owen": "richard owen"
    },
    {
        ", who also coined the order name.          The largest odd-toed ungulates are rhinoceroses, and the extinct  Paraceratherium , a hornless rhino from the ": null
    },
    {
        "Oligocene": "oligocene"
    },
    {
        ", is considered one of the largest land mammals of all time.  At the other extreme, an early member of the order, the prehistoric horse  Eohippus , had a withers height of only .  Apart from dwarf varieties of the domestic horse and donkey, perissodactyls reach a body length of  and a weight of .  While rhinos have only sparse hair and exhibit a thick ": null
    },
    {
        "epidermis": "epidermis"
    },
    {
        ", tapirs and horses have dense, short coats. Most species are grey or brown, although zebras and young tapirs are striped.       The main axes of both the front and rear feet pass through the third toe, which is always the largest. The remaining toes have been reduced in size to varying degrees. Tapirs, which are adapted to walking on soft ground, have four toes on their fore feet and three on their hind feet. Living rhinos have three toes on both the front and hind feet. Modern equines possess only a single toe; however, their feet are equipped with hooves, which almost completely cover the toe. Rhinos and tapirs, by contrast, have hooves covering only the leading edge of the toes, with the bottom being soft.     The ": null
    },
    {
        "ulna": "ulna"
    },
    {
        "e and ": null
    },
    {
        "fibula": "fibula"
    },
    {
        "e are reduced in horses. A ": null
    },
    {
        "common feature": "autapomorphy"
    },
    {
        " that clearly distinguishes this group from other mammals is the saddle-shaped ankle between the ": null
    },
    {
        "astragalus": "talus bone"
    },
    {
        " and the ": null
    },
    {
        "scaphoid": "navicular"
    },
    {
        ", which greatly restricts the mobility of the foot. The thigh is relatively short, and the ": null
    },
    {
        "clavicle": "clavicle"
    },
    {
        " is absent.            Odd-toed ungulates have a long ": null
    },
    {
        "upper jaw": "maxilla"
    },
    {
        " with an extended ": null
    },
    {
        "diastema": "diastema"
    },
    {
        " between the front and cheek ": null
    },
    {
        "teeth": "tooth"
    },
    {
        ", giving them an elongated head. The various forms of snout between families are due to differences in the form of the ": null
    },
    {
        "premaxilla": "premaxilla"
    },
    {
        ". The ": null
    },
    {
        "lacrimal bone": "lacrimal bone"
    },
    {
        " has projecting cusps in the eye sockets and a wide contact with the nasal bone. The ": null
    },
    {
        "temporomandibular joint": "temporomandibular joint"
    },
    {
        " is high and the mandible is enlarged.     Rhinos have one or two horns made of ": null
    },
    {
        "agglutinated": "wiktionary:agglutinate"
    },
    {
        " keratin, unlike the horns of ": null
    },
    {
        "even-toed ungulate": "even-toed ungulate"
    },
    {
        "s, which have a bony core.     The number and form of the teeth vary according to diet. The ": null
    },
    {
        "incisors": "incisor"
    },
    {
        "and ": null
    },
    {
        "canines": "canine tooth"
    },
    {
        "can be very small or completely absent, as in the two African species of rhinoceros. In the horses, usually only the males possess canines. The surface shape and height of the ": null
    },
    {
        "molars": "molar"
    },
    {
        " is heavily dependent on whether soft leaves or hard grass makes up the main component of their diets. Three or four cheek teeth are present on each jaw half, so the ": null
    },
    {
        "dental formula": "dentition"
    },
    {
        " of odd-toed ungulates is:          All perissodactyls are hindgut fermenters. In contrast to ": null
    },
    {
        "ruminant": "ruminant"
    },
    {
        "s, hindgut fermenters store digested food that has left the ": null
    },
    {
        "stomach": "stomach"
    },
    {
        " in an enlarged ": null
    },
    {
        "cecum": "cecum"
    },
    {
        ", where the food is digested by bacteria. No ": null
    },
    {
        "gallbladder": "gallbladder"
    },
    {
        " is present. The stomach of perissodactyls is simply built, while the cecum accommodates up to  in horses. The ": null
    },
    {
        "intestine": "gastrointestinal tract"
    },
    {
        " is very long, reaching up to  in horses. Extraction of nutrients from food is relatively inefficient, which probably explains why no odd-toed ungulates are small; for large animals, nutritional requirements per unit of body weight are lower and the ": null
    },
    {
        "surface-area-to-volume ratio": "surface-area-to-volume ratio"
    },
    {
        " is smaller.          The present distribution of most perissodactyl species is only a small fraction of their original range. Members of this group are now found only in Central and South America, eastern and southern Africa, and central, southern, and southeastern Asia. During the peak of odd-toed ungulate existence, from the ": null
    },
    {
        "Eocene": "eocene"
    },
    {
        " to the ": null
    },
    {
        "Oligocene": "oligocene"
    },
    {
        ", perissodactyls were distributed over much of the globe, the only exceptions being Australia and Antarctica. Horses and tapirs ": null
    },
    {
        "arrived in South America": "great american interchange"
    },
    {
        " after the formation of the ": null
    },
    {
        "Isthmus of Panama": "isthmus of panama"
    },
    {
        " in the ": null
    },
    {
        "Pliocene": "pliocene"
    },
    {
        ", around 3 million years ago. In North America, they died out around 10,000 years ago, while in Europe, the ": null
    },
    {
        "tarpans": "tarpan"
    },
    {
        "disappeared in the 19th century. Hunting and habitat restriction have reduced the present-day species to fragmented relict populations. In contrast, domesticated horses and donkeys have gained a worldwide distribution, and feral animals of both species are now also found in regions outside of their original range, such as in Australia.       Perissodactyls inhabit a number of different habitats, leading to different lifestyles. Tapirs are solitary and inhabit mainly tropical rainforests. Rhinos tend to live alone in rather dry savannas, and in Asia, wet marsh or forest areas. Horses inhabit open areas such as grasslands, steppes, or semi-deserts, and live together in groups. Odd-toed ungulates are exclusively herbivores that feed, to varying degrees, on grasses, leaves, and other plant parts. A distinction is often made between primarily grass feeders  and leaf feeders .          Odd-toed ungulates are characterized by a long gestation period and a small litter size, usually delivering a single young. The gestation period is 330–500 days, being longest in the rhinos. Newborn perissodactyls are ": null
    },
    {
        "precocial": "precociality"
    },
    {
        ";  young horses can follow the mother after a few hours.  The young are nursed for a relatively long time, often into their second year, reaching sexual maturity around eight or ten years old. Perissodactyls are long-lived, with several species reaching an age of almost 50 years in captivity.            Traditionally, the odd-toed ungulates were classified with other mammals such as ": null
    },
    {
        "artiodactyls": "even-toed ungulate"
    },
    {
        ", ": null
    },
    {
        "hyrax": "hyrax"
    },
    {
        "es, ": null
    },
    {
        "mammals with a proboscis": "proboscidea"
    },
    {
        ", and other ungulates . A close family relationship with hyraxes was suspected based on similarities in the construction of the ear and the course of the ": null
    },
    {
        "carotid artery": "carotid artery"
    },
    {
        ".     Recent molecular genetic studies, however, have shown the ungulates to be ": null
    },
    {
        "polyphyletic": "polyphyly"
    },
    {
        ", meaning that in some cases the similarities are the result of ": null
    },
    {
        "convergent evolution": "convergent evolution"
    },
    {
        " rather than ": null
    },
    {
        "common ancestry": "common ancestor"
    },
    {
        ". Elephants and hyraxes are now considered to belong to ": null
    },
    {
        "Afrotheria": "afrotheria"
    },
    {
        ", so are not closely related to the perissodactyls. These, in turn, are in the ": null
    },
    {
        "Laurasiatheria": "laurasiatheria"
    },
    {
        ", a superorder that had its origin in the former supercontinent ": null
    },
    {
        "Laurasia": "laurasia"
    },
    {
        ". Molecular genetic findings suggest that the cloven ": null
    },
    {
        "Artiodactyla": "artiodactyla"
    },
    {
        "  are the sister taxon of the Perissodactyla; together, the two groups form the ": null
    },
    {
        "Euungulata": "ungulate"
    },
    {
        ".  More distant are the ": null
    },
    {
        "bats": "bat"
    },
    {
        " and ": null
    },
    {
        "Ferae": "ferae"
    },
    {
        " .  In a discredited alternative scenario, a close relationship exists between perissodactyls, carnivores, and bats, this assembly comprising the ": null
    },
    {
        "Pegasoferae": "pegasoferae"
    },
    {
        ".           According to studies published in March 2015, odd-toed ungulates are in a close family relationship with at least some of the so-called ": null
    },
    {
        "Meridiungulata": "meridiungulata"
    },
    {
        ", a very diverse group of mammals living from the Paleocene to the Pleistocene in South America, whose systematic unity is largely unexplained. Some of these were classified on the basis of their paleogeographic distribution. However, a close relationship can be worked out to perissodactyls by means of protein sequencing and comparison with fossil collagen from remnants of phylogenetically young members of the Meridiungulata . Both kinship groups, the odd-toed ungulates and the Litopterna-Notoungulata, are now in the higher-level taxon of Panperissodactyla. This kinship group is included among the Euungulata which also contains the even-toed ungulates and whales . The separation of the Litopterna-Notoungulata group from the perissodactyls probably took place before the ": null
    },
    {
        "Cretaceous–Paleogene extinction event": "cretaceous–paleogene extinction event"
    },
    {
        ". Condylarths can probably be considered the starting point for the development of the two groups, as they represent a heterogeneous group of primitive ungulates that mainly inhabited the northern hemisphere in the ": null
    },
    {
        "Paleogene": "paleogene"
    },
    {
        ".         Odd-toed ungulates comprise three living families with around 17 species—in the horse the exact count is still controversial. Rhinos and tapirs are more closely related to each other than to the horses. The separation of horses from other perissodactyls took place according to molecular genetic analysis in the ": null
    },
    {
        "Paleocene": "paleocene"
    },
    {
        " some 56 million years ago, while the rhinos and tapirs split off in the lower-middle ": null
    },
    {
        "Eocene": "eocene"
    },
    {
        ", about 47 million years ago.    Order Perissodactyla Suborder Hippomorpha Family Equidae : horses and allies, seven species in one genus    Equus ferus  ": null
    },
    {
        "Tarpan": "tarpan"
    },
    {
        ", ": null
    },
    {
        "†": "extinction"
    },
    {
        "Equus ferus ferus ": null
    },
    {
        "Przewalskis horse": "przewalskis horse"
    },
    {
        ", Equus ferus przewalskii ": null
    },
    {
        "horse": "horse"
    },
    {
        ", Equus ferus caballus ": null
    },
    {
        "African wild ass": "african wild ass"
    },
    {
        ", Equus africanus ": null
    },
    {
        "Nubian wild ass": "nubian wild ass"
    },
    {
        ", Equus africanus africanus ": null
    },
    {
        "Somali wild ass": "somali wild ass"
    },
    {
        ", Equus africanus somaliensis ": null
    },
    {
        "donkey": "donkey"
    },
    {
        "                                                  rmerly Chalicotherium gran": "rmerly chalicotherium gran"
    },
    {
        "synonym Titanotheriidae ": null
    },
    {
        "n": "n"
    },
    {
        "                n": "n"
    }
]