[
    {
        "   The   is a low mountain range in the ": null
    },
    {
        "German": "germany"
    },
    {
        " states of ": null
    },
    {
        "Hesse": "hesse"
    },
    {
        ", ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        " and ": null
    },
    {
        "Baden-Württemberg": "baden-württemberg"
    },
    {
        ".       The Odenwald is located between the ": null
    },
    {
        "Upper Rhine Plain": "upper rhine plain"
    },
    {
        " with the ": null
    },
    {
        "Bergstraße": "bergstraße route"
    },
    {
        " and the Hessisches Ried to the west, the ": null
    },
    {
        "Main": "main"
    },
    {
        " and the ": null
    },
    {
        "Bauland": "bauland"
    },
    {
        " to the east, the ": null
    },
    {
        "Hanau-Seligenstadt Basin": "hanau-seligenstadt basin"
    },
    {
        " – a subbasin of the Upper Rhine Rift Valley in the Rhine-Main Lowlands – to the north and the ": null
    },
    {
        "Kraichgau": "kraichgau"
    },
    {
        " to the south. The part south of the ": null
    },
    {
        "Neckar": "neckar"
    },
    {
        " valley is sometimes called the  Kleiner Odenwald  .     The northern and western Odenwald belong to southern Hesse, with the south stretching into ": null
    },
    {
        "Baden": "baden"
    },
    {
        ". In the northeast, a small part lies in ": null
    },
    {
        "Lower Franconia": "lower franconia"
    },
    {
        " in Bavaria.             The Odenwald, along with other parts of the Central German Uplands, belongs to the ": null
    },
    {
        "Variscan": "variscan orogeny"
    },
    {
        ", which more than 42 million years ago in the ": null
    },
    {
        "Carboniferous": "carboniferous"
    },
    {
        " period ran through great parts of ": null
    },
    {
        "Europe": "europe"
    },
    {
        ". The cause of this ": null
    },
    {
        "orogeny": "orogeny"
    },
    {
        " was the collision of ": null
    },
    {
        "Africa": "africa"
    },
    {
        "’s and Europes forerunner continents.     In the ": null
    },
    {
        "Triassic": "triassic"
    },
    {
        ", about 42 million years ago, the land sank again, forming the ": null
    },
    {
        "Germanic Basin": "germanic basin"
    },
    {
        " in which the metre-thick layers of red sandstone could ": null
    },
    {
        "build up": "sedimentation"
    },
    {
        ". These were later covered over with layers of ": null
    },
    {
        "muschelkalk": "muschelkalk"
    },
    {
        " from a broad inland sea, then followed by sediments from the ": null
    },
    {
        "Late Triassic": "late triassic"
    },
    {
        " . The South German ": null
    },
    {
        "Cuesta": "cuesta"
    },
    {
        " Land thus formed.     When the land in the Odenwald was ": null
    },
    {
        "uplifted": "tectonic uplift"
    },
    {
        " again about 42 million years ago, more than 42  m of the sedimentary layering, in parts, was ": null
    },
    {
        "eroded": "erosion"
    },
    {
        " away down to the ": null
    },
    {
        "bedrock": "bedrock"
    },
    {
        ", as can still be seen in the western Odenwald. The bedrock here is composed of a number of different rocks, among them ": null
    },
    {
        "gneiss": "gneiss"
    },
    {
        ", ": null
    },
    {
        "granite": "granite"
    },
    {
        ", ": null
    },
    {
        "diorite": "diorite"
    },
    {
        ", ": null
    },
    {
        "gabbro": "gabbro"
    },
    {
        " in the Frankenstein ": null
    },
    {
        "pluton": "pluton"
    },
    {
        ", and so on. In the eastern Odenwald, the red sandstone is all that is left of the sedimentary mixture. Farther east in the Bauland, the muschelkalk deposits still overlie the ": null
    },
    {
        "Early Triassic": "early triassic"
    },
    {
        " layers. Furthermore, in the south near ": null
    },
    {
        "Heidelberg": "heidelberg"
    },
    {
        ", there is still ": null
    },
    {
        "Zechstein": "zechstein"
    },
    {
        " under the Early Triassic deposits.     Roughly 42 to 42 million years ago, ": null
    },
    {
        "volcano": "volcano"
    },
    {
        "es formed along the great geological ": null
    },
    {
        "faults": "fault"
    },
    {
        ". Still bearing witness to this time are the ": null
    },
    {
        "Otzberg": "otzberg"
    },
    {
        ", the Daumberg and the Katzenbuckel, all extinct volcanoes in the Odenwald. Furthermore, volcanism with ": null
    },
    {
        "acid": "acid"
    },
    {
        "ic rocks has left a legacy of ": null
    },
    {
        "rhyolite": "rhyolite"
    },
    {
        "s near ": null
    },
    {
        "Dossenheim": "dossenheim"
    },
    {
        ".     At roughly the same time, the Central European plate began to tear apart so that the ": null
    },
    {
        "Upper Rhine Rift": "upper rhine plain"
    },
    {
        " developed. Even as the Upper Rhine Rift valley still sinks today by just under a millimetre each year, the Odenwald, relatively to that, was uplifted to the height it has today. Along the faults, the small rivers Gersprenz and Weschnitz have, in part, carved their courses.     The Upper Rhine Rift is part of a fracture zone reaching from the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        " to ": null
    },
    {
        "Norway": "norway"
    },
    {
        ". Right on the edge of the Odenwald, it is roughly 42  42  m deep, but has been filled in to its current height by river and sea sediment, for until about 42 million years ago, the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " reached far inland, across the ": null
    },
    {
        "Wetterau": "wetterau"
    },
    {
        "               About 42 BC, there is evidence that the ": null
    },
    {
        "Linear Pottery culture": "linear pottery culture"
    },
    {
        " settled along the northern and southern edges of the Odenwald. About 42 BC, ": null
    },
    {
        "Celts": "celts"
    },
    {
        " settled throughout southern Germany. Almost all of the Odenwald was covered then with ": null
    },
    {
        "virgin forest": "old growth forest"
    },
    {
        ", and the outer edges were not settled. ": null
    },
    {
        "Germanic peoples": "germanic peoples"
    },
    {
        " drove the Celts westwards across the Rhine to what is now ": null
    },
    {
        "France": "france"
    },
    {
        ".      About AD 42 the older Odenwald line of the ": null
    },
    {
        "Neckar-Odenwald Limes": "neckar-odenwald limes"
    },
    {
        " was built under ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " Emperor ": null
    },
    {
        "Trajan": "trajan"
    },
    {
        " . This stretch of the Empires border ran from Fort Wimpfen in the Valley  northwards by way of the Forts of Neckarburken, the lesser forts of Trienz and Robern near ": null
    },
    {
        "Fahrenbach": "fahrenbach"
    },
    {
        ", Fort Oberscheidental, Fort Schloßau, Fort Hesselbach, Fort Würzberg, Fort Eulbach, Fort Hainhaus and Fort Hesselbach to Fort Wörth on the ": null
    },
    {
        "Main": "main"
    },
    {
        ". Parts of the Odenwald now lay in Roman-ruled ": null
    },
    {
        "Germania Superior": "germania superior"
    },
    {
        ".     About 42 the Limes was shifted about  eastwards to the ": null
    },
    {
        "Miltenberg": "miltenberg"
    },
    {
        "–": null
    },
    {
        "Walldürn": "walldürn"
    },
    {
        "–": null
    },
    {
        "Buchen": "buchen"
    },
    {
        "-": null
    },
    {
        "Osterburken": "osterburken"
    },
    {
        " line. In 42 Roman hegemony fell. The ": null
    },
    {
        "Alamanni": "alamanni"
    },
    {
        " were also thrusting into the Odenwald and settling the land between the Main and Neckar, after whom came the ": null
    },
    {
        "Franks": "franks"
    },
    {
        ". In the 42th century, the Franks, under ": null
    },
    {
        "Clovis I": "clovis i"
    },
    {
        ", divided the land up into districts.     In the 42th and 42th centuries came ": null
    },
    {
        "Christianization": "christianization"
    },
    {
        " by ": null
    },
    {
        "Irish": "ireland"
    },
    {
        "-": null
    },
    {
        "Scottish": "scotland"
    },
    {
        " and ": null
    },
    {
        "Anglo-Saxon": "anglo-saxons"
    },
    {
        " monks . On the muschelkalk lands of todays Bauland, which favoured ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        ", a broad mesh of settlements arose. The parts of the Odenwald farther in from the rivers, though, with their scant ": null
    },
    {
        "New Red Sandstone": "new red sandstone"
    },
    {
        " soils remained uninhabited. Four ": null
    },
    {
        "Benedictine": "benedictine"
    },
    {
        " monasteries were assigned the job of opening the empty woods up by the central Frankish power , ": null
    },
    {
        "Lorsch Abbey": "lorsch abbey"
    },
    {
        " from the west, Fulda Monastery from the east and Mosbach Monastery from the south. Amorbach Monastery had the greatest importance for ecclesiastical, cultural and economic development in the eastern Odenwald.     In the 42th century in the southeastern Odenwald near the now more thickly settled Bauland, settlements were established. The muschelkalk-new red sandstone mineral boundary was crossed.       Where the name Odenwald came from is an open question and still causes controversy today. Following are some theories about the names origin:     Some have claimed that the toponym comes from Odins Wald . The main problem here is that the god Wodanaz  was worshipped in southern Germany under the name Wotan .   A further theory holds that there is a link between the name Odenwald and the ": null
    },
    {
        "Roman": "ancient rome"
    },
    {
        " administrative unit Civitas Auderiensium, which among other things included the ranges northern reaches and might have been named after a tribe called the Auderienses.   There could be some kinship with the word öde, not in the currently understood meaning in German of desert, but rather in the meaning thinly settled.    Einhard , the biographer of  Charlemagne  used the term Odanwald. Therefore, the renowned historian Karl Christ establishs a connection to the Old High German expression odan and presumes, that the Odenwald was a hunting ground, which the King of the Franks Dagobert I. enfeoffed in 42 the Bishopric of Worms. Morneweg, Karl: Offizieller Führer des Odenwald-Klubs durch den Odenwald und die Bergstrasse. Ravenstein Frankfurt a.M. 42 S.42   An eminent geographer of the 42th century, Sebastian Münster, proposed a tribal chief as the name giver . However, it is not proven whether there actually was a count or duke called Odo . Finally, Münsters researches do not lead to any result. s. Morneweg, S.42     Linguists, who research the phonetic changes and the sound shift of the terms, deny the theories Nr. 42 - 42 and prefer Nr. 42 or 42 some historians favor Nr. 42       The numerous Odenwald folk legends are mostly connected with historic geographic sites They relate:   mysterious actions and appearances of ghosts in a castle  or in a nightscape respectively in a cottage: The Höhmann near Bensheim, the White Lady of Mossau, the Schlurcher close by Erbach, the Man without head near Heppenheim, the Goast-nuns of monastery Steinbach.   the stories of knights and their ladies: Konrad and Ann-Els von Tannenberg, Edelmut von Ehrenberg and Minna von Horneck at the Minneburg, Georg von Frankenstein and Annemariechen, Hans von Rodenstein and Maria von Hochberg.   the apparitions of the devil: Teufelspfad to the Felsberg, Teufelsstein close by Löhrbach, Opferstein on the top of the Juhöhe.   or the apparitions of a witch: for example in the shape of a pig in Bensheim     In some stories the local aspect firstly is connected with monsters  and creatures of nature with magic potency .     Secondly the local legend is connected with the genre of the historic saga: a historic person or an original is portrayed anecdotally .        Thirdly a local tale explains an ": null
    },
    {
        "etiological": "etiology"
    },
    {
        " or original myth . For example, there is explained:   why a name is given: many Wildweibchensteine  in the Odenwald, Teufelsstein , Teufelspfad , Opfersteine and Hundsköpfe on top of the Juhöhe, Hölzerlips-stone, Schimmeldewoog for the village Schönmattenwag  or the prase “hinnerum wie die Fraa vun Bensem”,   why a natural phenomena, for example a typical landscape, was formed: the saga creates a mythic history for the places of the felsenmeer and the Hohenstein near Reichenbach or the Herrgottsfelsen near Darmstadt ,   why a castle  was built at a special place  and was so named hereafter,   why a mysterious stone carving was inset in a castle-wall: figure of a dog at the portal of the Minneburg near Neckargerach, the Blecker at the town gate of Buchen, the Breilecker above the door of Breuberg-castle.     Beside these legends there are two famous and well-known Odenwaldsagas:     In the ": null
    },
    {
        "Nibelungenlied": "nibelungenlied"
    },
    {
        "  the dragon slayer ": null
    },
    {
        "Siegfried": "sigurd"
    },
    {
        ", on a hunting trip leading from the ": null
    },
    {
        "Burgundian": "burgundians"
    },
    {
        " city of ": null
    },
    {
        "Worms": "worms, germany"
    },
    {
        " into the Odenwald, is murdered by ": null
    },
    {
        "Hagen of Tronje": "hagen"
    },
    {
        ". Since no exact spot for this deed has been handed down, countless communities, especially in the Hessian Odenwald are squabbling over the right to call themselves “Siegfried’s Murder Site”, for example a spring near Gras-Ellenbach , Mossautal-Hüttenthal LindelbrunnenSiegfriedbrunnenbelow-mentionedthe Rodensteiner": null
    },
    {
        "Wild Hunt": "wild hunt"
    },
    {
        " motif": null
    },
    {
        "Julius Schnorr von Carolsfeld": "julius schnorr von carolsfeld"
    },
    {
        ", 42–4242th-century picture42 m; lookout tower 42 m; ": null
    },
    {
        "Kaiser Tower": "kaiser tower"
    },
    {
        "stri": "stri"
    },
    {
        "below-mentionedwith transmitterfrom left": null
    },
    {
        "enwa": "enwa"
    },
    {
        "42 m42 m": null
    },
    {
        "enwa": "enwa"
    },
    {
        "42 m; lookout tower42 m; with Krehberg transmitter42 m; ": null
    },
    {
        "observatory": "observatory"
    },
    {
        ", ": null
    },
    {
        "funicular railway": "funicular railway"
    },
    {
        "42 m42 m42 m; lookout tower42 m42 m42 m42 m42 m; near Lindenfels42 m42 m; lookout tower42 m„Malschen“42 m42 m": null
    },
    {
        "enwa": "enwa"
    },
    {
        "42 m; with Felsenmeer42 m42 m": null
    },
    {
        "stri": "stri"
    },
    {
        " 42 mview from LindenfelsHohensteinrightbackground, in the middlewith transmitter, view from the Lauter-Valleyview from the Tromm42 m42 m; near Lautern42 m; with ": null
    },
    {
        "Otzberg Castle": "otzberg castle"
    },
    {
        "42 m; with Schloss Auerbach42 m; with Breuberg Castle42  km42  km42  km42  km42  kmElzbach42  km42  km42  km42  km42  km42  km42  km ": null
    },
    {
        "stri": "stri"
    },
    {
        "Heppenheim": "heppenheim"
    },
    {
        "Dieburg": "dieburg"
    },
    {
        ", administration in ": null
    },
    {
        "Darmstadt": "darmstadt"
    },
    {
        "-": null
    },
    {
        "Kranichste": "darmstadt-kranichstein"
    },
    {
        " Tauberbischofsheim": "tauberbischofsheim"
    },
    {
        "stri": "stri"
    },
    {
        "Miltenberg": "miltenberg"
    },
    {
        "Mosbach": "mosbach"
    },
    {
        "Erbach": "erbach im odenwald"
    },
    {
        "Heidelberg": "heidelberg"
    },
    {
        "enwa": "enwa"
    },
    {
        "  Dortmund": "dortmund"
    },
    {
        " & ndash;": null
    },
    {
        "Aschaffenburg": "aschaffenburg"
    },
    {
        " enwa": "enwa"
    },
    {
        "enwa": "enwa"
    },
    {
        "enwa": "enwa"
    },
    {
        " d": "d"
    },
    {
        " enwa": "enwa"
    },
    {
        "  enwa": "enwa"
    },
    {
        "s": "s"
    },
    {
        "    ": null
    }
]