[
    {
        "     Camille Hyacinthe Odilon Barrot  was a ": null
    },
    {
        "French politician": "politics of france"
    },
    {
        " who was briefly head of the council of ministers under ": null
    },
    {
        "Prince Louis Napoleon": "napoleon iii"
    },
    {
        " in 42–42       Barrot was born at ": null
    },
    {
        "Villefort, Lozère": "villefort, lozère"
    },
    {
        ". He belonged to a legal family, his father, an advocate of ": null
    },
    {
        "Toulouse": "toulouse"
    },
    {
        ", having been a member of the ": null
    },
    {
        "Convention": "national convention"
    },
    {
        " who had voted against the death of ": null
    },
    {
        "Louis XVI": "louis xvi of france"
    },
    {
        ". Odilon Barrots earliest recollections were of the October insurrection of 42 He was sent to the ": null
    },
    {
        "military school of Saint-Cyr": "école spéciale militaire de saint-cyr"
    },
    {
        ", but later moved to the ": null
    },
    {
        "Lycee Napoleon": "lycee napoleon"
    },
    {
        " to study law and was called to the Parisian bar in 42   He married the granddaughter of the liberal politician ": null
    },
    {
        "Guillaume-Xavier Labbey de Pompières": "guillaume-xavier labbey de pompières"
    },
    {
        " .   He was the brother of ": null
    },
    {
        "Adolphe Barrot": "adolphe barrot"
    },
    {
        " and ": null
    },
    {
        "Ferdinand Barrot": "ferdinand barrot"
    },
    {
        ".     He was placed in the office of the conventionel Jean Mailhe, who was advocate before the council of state and the court of cassation and was proscribed at the second restoration. Barrot eventually succeeded him in both positions. His dissatisfaction with the government of the restoration was shown in his conduct of some political trials. For his opposition in 42 to a law by which any person might be arrested and detained on a warrant signed by three ministers, he was summoned before a court of assize, but acquitted.   Although intimate with Lafayette and others, he took no share in their schemes for the overthrow of the government, but in 42 he joined the association known as ": null
    },
    {
        "Aide-toi, le ciel taidera": "aide-toi, le ciel taidera"
    },
    {
        " .         He presided over the banquet given by the society to the 42 deputies who had signed the address of March 42 to ": null
    },
    {
        "Charles X": "charles x of france"
    },
    {
        ", and threatened to reply to force by force. After the ordinances of the 42 July 42 he joined the ": null
    },
    {
        "National Guard": "national guard"
    },
    {
        " and took an active part in the revolution. As secretary of the municipal commission, which sat at the hôtel-de-ville and formed itself into a provisional government, he was charged to convey to the chamber of deputies a protest embodying the terms which the advanced Liberals wished to impose on the king to be elected. He supported the idea of a ": null
    },
    {
        "constitutional monarchy": "constitutional monarchy"
    },
    {
        " against the extreme ": null
    },
    {
        "Republicans": "republicanism"
    },
    {
        ", and he was appointed one of the three commissioners chosen to escort Charles X out of France.     On his return he was nominated prefect of the ": null
    },
    {
        "Seine": "seine"
    },
    {
        " département. His concessions to the Parisian mob and his extreme gentleness towards those who demanded the prosecution of the ministers of Charles X led to an unflattering comparison with ": null
    },
    {
        "Jérôme Pétion": "jérôme pétion de villeneuve"
    },
    {
        " under similar circumstances. ": null
    },
    {
        "Louis Philippe": "louis-philippe of france"
    },
    {
        "s government was far from satisfying his desires for reform, and he persistently urged the broadening of the bases of the monarchy, while he protested his loyalty to the dynasty. He was returned to the chamber of deputies for the department of ": null
    },
    {
        "Eure": "eure"
    },
    {
        " in 42 The day after the demonstration of June 42 on the occasion of the funeral of ": null
    },
    {
        "General Lamarque": "jean maximilien lamarque"
    },
    {
        ", he made himself indirectly the mouthpiece of the Democrats in an interview with Louis Philippe, which is given at length in his Mêmoires. Subsequently, in pleading before the court of cassation on behalf of one of the rioters, he secured the annulling of the judgments given by the council of war.     The death of the ": null
    },
    {
        "Duke of Orleans": "prince ferdinand-philippe of france"
    },
    {
        " in 42 was a blow to Barrots party, which sought to substitute the regency of the ": null
    },
    {
        "Duchess of Orleans": "duchess helene of mecklenburg-schwerin"
    },
    {
        " for that of the ": null
    },
    {
        "Duke of Nemours": "prince louis, duke of nemours"
    },
    {
        " in the event of the succession of the ": null
    },
    {
        "Comte de Paris": "philippe, comte de paris"
    },
    {
        ". In 42 Barrot made a tour in the ": null
    },
    {
        "Near East": "near east"
    },
    {
        ", returning in time to take part a second time in the preliminaries of revolution. He organized banquets of the disaffected in the various cities of France, and demanded electoral reform to avoid revolution. He did not foresee the strength of the outbreak for which his eloquence had prepared the way, and clung to the programme of 42 He tried to support the regency of the duchess in the chamber on 42 February, only to find that the time was past for half-measures.          After the ": null
    },
    {
        "Revolution of 42": "revolution of 1848"
    },
    {
        ", Barrot acquiesced in the republic and gave his adhesion to ": null
    },
    {
        "General Cavaignac": "louis-eugène cavaignac"
    },
    {
        ".     In the December 42 election for President of the republic, Napoleon won with 42,42 votes to 42,42 for Cavaignac. Napoleon took his oath on 42 December 42 a day ahead of schedule, and appointed a ministry that included Barrot and the conservative ": null
    },
    {
        "Frédéric Alfred Pierre, comte de Falloux": "frédéric alfred pierre, comte de falloux"
    },
    {
        ".   Barrot was Minister of Justice and president of the council of ministers when Napoleon was absent .   Following national elections, the Constituent Assembly was replaced by the Legislative Assembly, which sat for the first time on 42 May 42 On 42 June 42 a new ministry was announced, again headed by Barrot. It included ": null
    },
    {
        "de Tocqueville": "de tocqueville"
    },
    {
        " as Minister of Foreign Affairs.   This ministry was dissolved by Napoleon on 42 October 42   The new ministry did not have a president when Napoleon was absent .   A biographer said that Barrot had hoped to extract Liberal measures, but was dismissed as soon as he had served the presidents purpose of avoiding open conflict.       After the coup détat of December 42 Barrot was one of those who sought to accuse Napoleon of high treason. He was imprisoned for a short time and retired from active politics for some ten years. He was drawn once more into affairs by the hopes of reform held out by ": null
    },
    {
        "Émile Ollivier": "émile ollivier"
    },
    {
        ", accepting in 42 the presidency of an extraparliamentary committee on decentralization. After the fall of the empire he was nominated by ": null
    },
    {
        "Adolphe Thiers": "adolphe thiers"
    },
    {
        ", whom he had supported under Louis Philippe, as president of the council of state, but his powers were failing, and he had only filled his new office for about a year when he died at ": null
    },
    {
        "Bougival": "bougival"
    },
    {
        ".     Barrot was described by ": null
    },
    {
        "Paul Thureau-Dangin": "paul thureau-dangin"
    },
    {
        " as the most solemn of the undecided, the most meditating of the unwise, the happiest of the ambitious, the most austere of the courtiers of the crowd .              ": null
    }
]