[
    {
        "         Oedipus  was a mythical Greek king of ": null
    },
    {
        "Thebes": "ancient thebes"
    },
    {
        ". A ": null
    },
    {
        "tragic hero": "tragic hero"
    },
    {
        " in ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", Oedipus accidentally fulfilled a prophecy that he would end up killing his father and marrying his mother, thereby bringing disaster to his city and family.     The story of Oedipus is the subject of ": null
    },
    {
        "Sophocles": "sophocles"
    },
    {
        " tragedy  Oedipus Rex , which is followed in the narrative sequence by  Oedipus at Colonus  and then  Antigone . Together, these plays make up Sophocles ": null
    },
    {
        "three Theban plays": "sophoclestheban plays"
    },
    {
        ". Oedipus represents two enduring themes of Greek myth and drama: the flawed nature of humanity and an individuals role in the course of destiny in a harsh universe.     In the best known version of the myth, Oedipus was born to King ": null
    },
    {
        "Laius": "laius"
    },
    {
        " and Queen ": null
    },
    {
        "Jocasta": "jocasta"
    },
    {
        ". Laius wished to thwart the prophecy, so he sent a shepherd-servant to leave Oedipus to die on a mountainside. However, the shepherd took pity on the baby and passed him to another shepherd who gave Oedipus to ": null
    },
    {
        "King Polybus": "polybus of corinth"
    },
    {
        " and Queen Merope to raise as their own. Oedipus learned from the ": null
    },
    {
        "oracle at Delphi": "pythia"
    },
    {
        " of the prophecy that he would end up killing his father and marrying his mother but, unaware of his true parentage, believed he was fated to murder Polybus and marry Merope, so left for Thebes. On his way he met an older man and killed him in a quarrel. Continuing on to Thebes, he found that the king of the city had been recently killed, and that the city was at the mercy of ": null
    },
    {
        "the Sphinx": "sphinxgreek traditions"
    },
    {
        ". Oedipus answered ": null
    },
    {
        "the monsters riddle": "riddle of the sphinx"
    },
    {
        " correctly, defeating it and winning the throne of the dead king – and the hand in marriage of the kings widow, who was also his mother Jocasta.     Years later, to end a plague on Thebes, Oedipus searched to find who had killed Laius, and discovered that he himself was responsible. Jocasta, upon realizing that she had married her own son, hanged herself. Oedipus then seized two pins from her dress and blinded himself with them.     The legend of Oedipus has been retold in many versions, and was used by ": null
    },
    {
        "Sigmund Freud": "sigmund freud"
    },
    {
        " to name and give mythic precedent to the ": null
    },
    {
        "Oedipus complex": "oedipus complex"
    },
    {
        ".       Variations on the legend of Oedipus are mentioned in fragments by several ancient Greek poets including ": null
    },
    {
        "Homer": "homer"
    },
    {
        ", ": null
    },
    {
        "Hesiod": "hesiod"
    },
    {
        ", ": null
    },
    {
        "Pindar": "pindar"
    },
    {
        ", ": null
    },
    {
        "Aeschylus": "aeschylus"
    },
    {
        " and ": null
    },
    {
        "Euripides": "euripides"
    },
    {
        ". However, the most popular version of the legend comes from the ": null
    },
    {
        "set of Theban plays": "three theban plays"
    },
    {
        " by ": null
    },
    {
        "Sophocles": "sophocles"
    },
    {
        ":  Oedipus Rex ,  Oedipus at Colonus , and  Antigone .     Oedipus was the son of ": null
    },
    {
        "Laius": "laius"
    },
    {
        " and ": null
    },
    {
        "Jocasta": "jocasta"
    },
    {
        ", king and queen of ": null
    },
    {
        "Thebes": "ancient thebes"
    },
    {
        ". Having been childless for some time, Laius consulted the ": null
    },
    {
        "Oracle of Apollo": "oracle of apollo"
    },
    {
        " at ": null
    },
    {
        "Delphi": "delphi"
    },
    {
        ". The Oracle prophesied that any son born to Laius would kill him. In an attempt to prevent this prophecys fulfillment, when Jocasta indeed bore a son, Laius had his ankles pierced and tethered together so that he could not crawl; Jocasta then gave the boy to a servant to abandon on the nearby mountain. However, rather than leave the child to die of exposure, as Laius intended, the servant passed the baby on to a shepherd from ": null
    },
    {
        "Corinth": "corinth"
    },
    {
        " and who then gave the child to another shepherd.     The infant Oedipus eventually came to the house of ": null
    },
    {
        "Polybus": "polybus"
    },
    {
        ", king of Corinth and his queen, Merope, who adopted him, as they were without children of their own. Little Oedipus was named after the swelling from the injuries to his feet and ankles . The word oedema or edema is from this same Greek word for swelling: οἴδημα, or oedēma.     After many years, Oedipus was told by a drunk that he was a bastard , meaning at that time that he was not their biological son. Oedipus confronted his parents with the news, but they denied this. Oedipus went to the same oracle in Delphi that his birth parents had consulted. The oracle informed him that he was destined to murder his father and marry his mother. In an attempt to avoid such a fate, he decided not to return home to Corinth, but to travel to Thebes, which was closer to Delphi.     On the way, Oedipus came to ": null
    },
    {
        "Davlia": "davlia"
    },
    {
        ", where three roads crossed each other. There he encountered a ": null
    },
    {
        "chariot": "chariot"
    },
    {
        " driven by his birth-father, King ": null
    },
    {
        "Laius": "laius"
    },
    {
        ". They fought over who had the right to go first and Oedipus killed Laius when the charioteer tried to run him over. The only witness of the kings death was a slave who fled from a caravan of slaves also traveling on the road at the time.     Continuing his journey to Thebes, Oedipus encountered a ": null
    },
    {
        "Sphinx": "sphinx"
    },
    {
        ", who would stop all travelers to Thebes and ask them a riddle. If the travelers were unable to answer her correctly, they would be killed and eaten; if they were successful, they would be free to continue on their journey. The riddle was: What walks on four feet in the morning, two in the afternoon and three at night? . Oedipus answered: Man: as an infant, he crawls on all fours; as an adult, he walks on two legs and; in old age, he uses a walking stick . Oedipus was the first to answer the riddle correctly and, having heard Oedipus answer, the Sphinx allowed him to carry on forward.     Queen Jocastas brother, ": null
    },
    {
        "Creon": "creon"
    },
    {
        ", had announced that any man who could rid the city of the Sphinx would be made king of Thebes, and given the recently widowed Queen Jocastas hand in marriage. This marriage of Oedipus to Jocasta fulfilled the rest of the prophecy. Oedipus and Jocasta had four children: two sons, ": null
    },
    {
        "Eteocles": "eteocles"
    },
    {
        " and ": null
    },
    {
        "Polynices": "polynices"
    },
    {
        " , and two daughters, ": null
    },
    {
        "Antigone": "antigone"
    },
    {
        " and ": null
    },
    {
        "Ismene": "ismene"
    },
    {
        ".     Many years after the marriage of Oedipus and Jocasta, a plague of infertility struck the city of Thebes, affecting crops, livestock and the people. Oedipus asserted that he would end the pestilence. He sent his uncle, Creon, to the Oracle at Delphi, seeking guidance. When Creon returned, Oedipus learned that the murderer of the former King Laius must be brought to justice, and Oedipus himself cursed the killer of his wifes late husband, saying that he would be exiled. Creon also suggested that they try to find the blind prophet, ": null
    },
    {
        "Tiresias": "tiresias"
    },
    {
        " who was widely respected. Oedipus sent for Tiresias, who warned him not to seek Laius killer. In a heated exchange, Tiresias was provoked into exposing Oedipus himself as the killer, and the fact that Oedipus was living in shame because he did not know who his true parents were. Oedipus angrily blamed Creon for the false accusations, and the two argued. Jocasta entered and tried to calm Oedipus by telling him the story of her first-born son and his supposed death. Oedipus became nervous as he realized that he may have murdered Laius and so brought about the plague. Suddenly, a messenger arrived from Corinth with the news that King Polybus had died. Oedipus was relieved for the prophecy could no longer be fulfilled if Polybus, whom he considered his birth father, was now dead.     Still, he knew that his mother was still alive and refused to attend the funeral at Corinth. To ease the tension, the messenger then said that Oedipus was, in fact, adopted. Jocasta, finally realizing that he was her son, begged him to stop his search for Laius murderer. Oedipus misunderstood her motivation, thinking that she was ashamed of him because he might have been born of low birth. Jocasta in great distress went into the palace where she hanged herself. Oedipus sought verification of the messengers story from the very same herdsman who was supposed to have left Oedipus to die as a baby. From the herdsman, Oedipus learned that the infant raised as the adopted son of Polybus and Merope was the son of Laius and Jocasta. Thus, Oedipus finally realized that the man he had killed so many years before, at the place where the three roads met, was his own father, King ": null
    },
    {
        "Laius": "laius"
    },
    {
        ", and that he had married his mother, Jocasta.     Events after the revelation depend on the source. In ": null
    },
    {
        "Sophocles": "sophocles"
    },
    {
        " plays, Oedipus went in search of Jocasta and found she had killed herself. Using the pin from a brooch he took off Jocastas gown, Oedipus blinded himself and was then exiled. His daughter ": null
    },
    {
        "Antigone": "antigone"
    },
    {
        " acted as his guide as he wandered through the country, finally dying at ": null
    },
    {
        "Colonus": "hippeios colonus"
    },
    {
        " where they had been welcomed by King ": null
    },
    {
        "Theseus": "theseus"
    },
    {
        " of Athens. However, in ": null
    },
    {
        "Euripides": "euripides"
    },
    {
        " plays on the subject, Jocasta did not kill herself upon learning of Oedipus birth, and Oedipus was blinded by a servant of Laius. The blinding of Oedipus does not appear in sources earlier than ": null
    },
    {
        "Aeschylus": "aeschylus"
    },
    {
        ". Some older sources of the myth, including ": null
    },
    {
        "Homer": "homer"
    },
    {
        ", state that Oedipus continued to rule Thebes after the revelations and after Jocastas death.      Oedipus two sons, ": null
    },
    {
        "Eteocles": "eteocles"
    },
    {
        " and ": null
    },
    {
        "Polynices": "polynices"
    },
    {
        ", arranged to share the kingdom, each taking an alternating one-year reign. However, Eteocles refused to cede his throne after his year as king. Polynices brought in an army to oust Eteocles from his position and a battle ensued. At the end of the battle the brothers killed each other after which Jocastas brother, ": null
    },
    {
        "Creon": "creon"
    },
    {
        ", took the throne. He decided that Polynices was a traitor, and should not be given burial rites. Defying this edict, ": null
    },
    {
        "Antigone": "antigone"
    },
    {
        " attempted to bury her brother. In Sophocles  Antigone , Creon had her buried in a rock cavern for defying him, whereupon she hanged herself. However, in Euripides lost version of the story, it appears that Antigone survives.          Most writing on Oedipus comes from the 42th century BC, though the stories deal mostly with Oedipus downfall. Various details appear on how Oedipus rose to power.     King Laius of Thebes hears of a prophecy that his infant son will one day kill him. Euripides, Phoenissae He pierces Oedipus feet and leaves him out to die, but a shepherd finds him and carries him away. Sophocles, Oedipus Rex 42–42; Euripides, Phoenissae Years later, Oedipus, not knowing he was adopted, leaves home in fear of the same prophecy that he will kill his father and marry his mother. Sophocles, Oedipus Rex 42–42; Euripides, Phoenissae Laius journeys out to seek a solution to the Sphinxs mysterious riddle. Sophocles, Oedipus Rex 42–42 As prophesied, Oedipus and Laius cross paths, but they do not recognize each other. A fight ensues, and Oedipus kills Laius and most of his guards. Pindar, Second Olympian Ode; Sophocles, Oedipus Rex 42–42; Euripides, Phoenissae Oedipus goes on to defeat the Sphinx by solving a riddle to become king. Sophocles, Oedipus Rex 42 42; Euripides, Phoenissae He marries the widowed Queen Jocasta, unaware that she is his mother. A plague falls on the people of Thebes. Upon discovering the truth, Oedipus blinds himself, and Jocasta hangs herself. Sophocles, Oedipus Rex 42 After Oedipus is no longer king, Oedipus brother-sons kill each other.     Some differences with older stories emerge. The curse of the Oedipus sons is expanded backward to include Oedipus and his father, Laius. Oedipus now steps down from the throne instead of dying in battle. Additionally, rather than his children being by a second wife, Oedipus children are now by Jocasta.         In the Second Olympians Ode ": null
    },
    {
        "Pindar": "pindar"
    },
    {
        " wrote:   Laius tragic son, crossing his fathers path, killed him and fulfilled the oracle spoken of old at Pytho. And sharp-eyed Erinys saw and slew his warlike children at each others hands. Yet Thersandros survived fallen Polyneikes and won honor in youthful contests and the brunt of war, a scion of aid to the house of Adrastos.. Pindar, Second Olympian Ode         In 42 BC the Athenian playwright, ": null
    },
    {
        "Aeschylus": "aeschylus"
    },
    {
        ", is known to have presented an entire trilogy based upon the Oedipus myth, winning the first prize at the ": null
    },
    {
        "City Dionysia": "city dionysia"
    },
    {
        ". The First play was Laius, the second was Oedipus, and the third was  Seven against Thebes . Only the third play survives, in which Oedipus sons Eteocles and Polynices kill each other warring over the throne. Much like his  Oresteia , this trilogy would have detailed the tribulations of a House over three successive generations. The ": null
    },
    {
        "satyr play": "satyr play"
    },
    {
        " that followed the trilogy was called  The Sphinx .         Oedipus Rex": null
    },
    {
        "Sophocles": "sophocles"
    },
    {
        "  Oedipus Rex  begins, the people of Thebes are begging the king for help, begging him to discover the cause of the plague. Oedipus stands before them and swears to find the root of their suffering and to end it. Just then, ": null
    },
    {
        "Creon": "creon"
    },
    {
        " returns to Thebes from a visit to the oracle. Apollo has made it known that Thebes is harbouring a terrible abomination and that the plague will only be lifted when the true murderer of old ": null
    },
    {
        "King Laius": "laius"
    },
    {
        " is discovered and punished for his crime. Oedipus swears to do this, not realizing that he is himself the culprit. The stark truth emerges slowly over the course of the play, as Oedipus clashes with the blind seer ": null
    },
    {
        "Tiresias": "tiresias"
    },
    {
        ", who senses the truth. Oedipus remains in strict denial, though, becoming convinced that Tiresias is somehow plotting with Creon to usurp the throne.     Realization begins to slowly dawn in Scene II of the play when Jocasta mentions out of hand that Laius was slain at a place where three roads meet. This stirs something in Oedipus memory and he suddenly remembers the men that he fought and killed one day long ago at a place where three roads met. He realizes, horrified, that he might be the man hes seeking. One household servant survived the attack and now lives out his old age in a frontier district of Thebes. Oedipus sends immediately for the man to either confirm or deny his guilt. At the very worst, though, he expects to find himself to be the unsuspecting murderer of a man unknown to him. The truth has not yet been made clear.     The moment of epiphany comes late in the play. At the beginning of Scene III, Oedipus is still waiting for the servant to be brought into the city, when a messenger arrives from Corinth to declare that ": null
    },
    {
        "King Polybus": "polybus of corinth"
    },
    {
        " of Corinth is dead. Oedipus, when he hears this news, feels much relieved, because he believed that Polybus was the father whom the oracle had destined him to murder, and he momentarily believes himself to have escaped fate. He tells this all to the present company, including the messenger, but the messenger knows that it is not true. He is the man who found Oedipus as a baby in the pass of ": null
    },
    {
        "Cithaeron": "cithaeron"
    },
    {
        " and gave him to King Polybus to raise. He reveals, furthermore that the servant who is being brought to the city as they speak is the very same man who took Oedipus up into the mountains as a baby. Jocasta realizes now all that has happened. She begs Oedipus not to pursue the matter further. He refuses, and she withdraws into the palace as the servant is arriving. The old man arrives, and it is clear at once that he knows everything. At the behest of Oedipus, he tells it all.     Overwhelmed with the knowledge of all his crimes, Oedipus rushes into the palace where he finds his mother-wife, dead by her own hand. Ripping a brooch from her dress, Oedipus blinds himself with it. Bleeding from the eyes, he begs his uncle and brother-in-law Creon, who has just arrived on the scene, to exile him forever from Thebes. Creon agrees to this request. Oedipus begs to hold his two daughters ": null
    },
    {
        "Antigone": "antigone"
    },
    {
        " and ": null
    },
    {
        "Ismene": "ismene"
    },
    {
        " with his hands one more time to have their eyes fill of tears and Creon out of pity sends the girls in to see Oedipus one more time.     Oedipus at Colonus   In Sophocles  Oedipus at Colonus , Oedipus becomes a wanderer, pursued by Creon and his men. He finally finds refuge at the holy wilderness right outside Athens, where it is said that ": null
    },
    {
        "Theseus": "theseus"
    },
    {
        " took care of Oedipus and his daughter, ": null
    },
    {
        "Antigone": "antigone"
    },
    {
        ". Creon eventually catches up to Oedipus. He asks Oedipus to come back from Colonus to bless his son, Eteocles. Angry that his son did not love him enough to take care of him, he curses both Eteocles and his brother, condemning them both to kill each other in battle. Oedipus dies a peaceful death; his grave is said to be sacred to the gods.     Antigone   In Sophocles  Antigone , when Oedipus stepped down as king of Thebes, he gave the kingdom to his two sons, ": null
    },
    {
        "Eteocles": "eteocles"
    },
    {
        " and ": null
    },
    {
        "Polynices": "polynices"
    },
    {
        ", both of whom agreed to alternate the throne every year. However, they showed no concern for their father, who cursed them for their negligence. After the first year, Eteocles refused to step down and Polynices attacked Thebes with his supporters . The two brothers killed each other in battle. King ": null
    },
    {
        "Creon": "creon"
    },
    {
        ", who ascended to the throne of Thebes, decreed that Polynices was not to be buried. ": null
    },
    {
        "Antigone": "antigone"
    },
    {
        ", Polynices sister, defied the order, but was caught. Creon decreed that she was to be put into a stone box in the ground, this in spite of her betrothal to his son ": null
    },
    {
        "Haemon": "haemon"
    },
    {
        ". Antigones sister, ": null
    },
    {
        "Ismene": "ismene"
    },
    {
        ", then declared she had aided Antigone and wanted the same fate, but Creon eventually declined executing her. The gods, through the blind prophet ": null
    },
    {
        "Tiresias": "tiresias"
    },
    {
        ", expressed their disapproval of Creons decision, which convinced him to rescind his order, and he went to bury Polynices himself. However, Antigone had already hanged herself in her tomb, rather than suffering the slow death of being buried alive. When Creon arrived at the tomb where she had been interred, his son Haemon attacked him upon seeing the body of his deceased fiancée, but failing to kill Creon he killed himself. When Creons wife, ": null
    },
    {
        "Eurydice": "eurydice of thebes"
    },
    {
        ", was informed of the death of Haemon, she too took her own life.     Phoenissae, Chrysippus and Oedipus": null
    },
    {
        "Euripides": "euripides"
    },
    {
        "  Phoenissae , Jocasta recalls the story of Oedipus. Generally, the play weaves together the plots of the Seven Against Thebes and Antigone. The play differs from the other tales in two major respects. First, it describes in detail why Laius and Oedipus had a feud: Laius ordered Oedipus out of the road so his chariot could pass, but proud Oedipus refused to move. Second, in the play Jocasta has not killed herself at the discovery of her incest – otherwise she could not play the prologue, for fathomable reasons – nor has Oedipus fled into exile, but they have stayed in Thebes only to delay their doom until the fatal duel of their sons/brothers/nephews ": null
    },
    {
        "Eteocles": "eteocles"
    },
    {
        " and ": null
    },
    {
        "Polynices": "polynices"
    },
    {
        ": Jocasta commits suicide over the two mens dead bodies, and Antigone follows Oedipus into exile.     In  Chrysippus , Euripides develops backstory on the curse: Laius sin was to have kidnapped Chrysippus, ": null
    },
    {
        "Pelops": "pelops"
    },
    {
        " son, in order to violate him, and this caused the gods revenge on all his family. Laius was the tutor of Chrysippus, and raping his student was a severe violation of his position as both guest and tutor in the house of the royal family hosting him at the time. Extant vases show a fury hovering over the lecherous Laius as he abducts the rape victim. The Reign of the Phallus: Sexual Politics in Ancient Athenas by Eva Keuls p. 42 Furies avenged violations of good order in households, as can be seen most clearly in such texts as The Libation Bearers by Aeschylus.     Euripides wrote also an  Oedipus , of which only a few fragments survive. R. Kannicht, Tragicorum Graecorum Fragmenta vol. 42, Göttingen 42; see also F. Jouan – H. Van Looy, Euripide. tome 42 – Fragments , Paris 42   The first line of the prologue recalled Laius hubristic action of conceiving a son against Apollos command. At some point in the action of the play, a character engaged in a lengthy and detailed description of the Sphinx and her riddle – preserved in five fragments from ": null
    },
    {
        "Oxyrhynchus": "oxyrhynchus"
    },
    {
        ", P.Oxy. 42 . Reviewed by ": null
    },
    {
        "Hugh Lloyd-Jones": "hugh lloyd-jones"
    },
    {
        " in Gnomon 42 , pp. 42–42 The tragedy featured also many moral maxims on the theme of marriage, preserved in the Anthologion of ": null
    },
    {
        "Stobaeus": "stobaeus"
    },
    {
        ". The most striking lines, however, state that in this play Oedipus was blinded by Laius attendants, and that this happened before his identity as Laius son had been discovered, therefore marking important differences with the Sophoclean treatment of the myth, which is now regarded as the standard version. Many attempts have been made to reconstruct the plot of the play, but none of them is more than hypothetical, because of the scanty remains that survive from its text and of the total absence of ancient descriptions or résumés – though it has been suggested that a part of ": null
    },
    {
        "Hyginus": "hyginus"
    },
    {
        " narration of the Oedipus myth might in fact derive from Euripides play. Some echoes of the Euripidean Oedipus have been traced also in a scene of Senecas Oedipus , in which Oedipus himself describes to Jocasta his adventure with the Sphinx. Joachim Dingel, in Museum Helveticum 42 , 42–42       At least three other 42th-century BC authors who were younger than Sophocles wrote plays about Oedipus. These include ": null
    },
    {
        "Achaeus of Eretria": "achaeus of eretria"
    },
    {
        ", ": null
    },
    {
        "Nichomachus": "nichomachus"
    },
    {
        " and the elder ": null
    },
    {
        "Xenocles": "xenocles"
    },
    {
        ".          The  Bibliotheca , a Roman-era mythological handbook, includes a riddle for the Sphinx, borrowing the poetry of ": null
    },
    {
        "Hesiod": "hesiod"
    },
    {
        ":     What is that which has one voice and yet becomes four-footed and two-footed and three-footed?  Bibliotheca  III.42     Seven against ThebesAntigone , the ending of Seven against Thebes was added some fifty years after Aeschylus death. See Brown 42 42–42 Whereas the play was meant to end with somber mourning for the dead brothers, the spurious ending features a herald announcing the prohibition against burying Polynices, and Antigones declaration that she will defy that edict.       Oedipus was a figure who was also used in the ": null
    },
    {
        "Latin literature": "latin literature"
    },
    {
        " of ": null
    },
    {
        "ancient Rome": "ancient rome"
    },
    {
        ". ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        " wrote a play on Oedipus, but it has not survived into modern times. E.F. Watlings Introduction to Seneca: Four Tragedies and Octavia ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        " included Oedipus in  Metamorphoses , but only as the person who defeated the Sphinx. He makes no mention of Oedipus troubled experiences with his father and mother. ": null
    },
    {
        "Seneca the Younger": "seneca the younger"
    },
    {
        " wrote his own ": null
    },
    {
        "play": "oedipus"
    },
    {
        " on the story of Oedipus in the first century AD. It differs in significant ways from the work of Sophocles.     Senecas play on the myth was intended to be recited at private gatherings and not actually performed. It has however been successfully ": null
    },
    {
        "staged": "oedipus performances"
    },
    {
        " since the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ". It was adapted by ": null
    },
    {
        "John Dryden": "john dryden"
    },
    {
        " in his very successful ": null
    },
    {
        "heroic drama": "heroic drama"
    },
    {
        "  Oedipus , licensed in 42 The 42  Oedipus  was also the first play written by ": null
    },
    {
        "Voltaire": "voltaire"
    },
    {
        ". A version of Oedipus by ": null
    },
    {
        "Frank McGuinness": "frank mcguinness"
    },
    {
        " was performed at the ": null
    },
    {
        "National Theatre": "royal national theatre"
    },
    {
        " in late 42 starring ": null
    },
    {
        "Ralph Fiennes": "ralph fiennes"
    },
    {
        " and ": null
    },
    {
        "Claire Higgins": "clare higgins"
    },
    {
        ".     In 42 ": null
    },
    {
        "Immanuel Velikovsky": "immanuel velikovsky"
    },
    {
        " published a book called Oedipus and Akhnaton which made a comparison between the stories of the legendary Greek figure, Oedipus, and the historic Egyptian King of Thebes, ": null
    },
    {
        "Akhnaton": "akhnaton"
    },
    {
        ". The book is presented as a thesis that combines with Velikovskys series ": null
    },
    {
        "Ages in Chaos": "ages in chaos"
    },
    {
        ", concluding through his revision of Egyptian history that the Greeks who wrote the tragedy of Oedipus may have penned it in likeness of the life and story of Akhnaton, because in the revision Akhnaton would have lived much closer to the time when the legend first surfaced in Greece, providing a historical basis for the story. Each of the major characters in the Greek story are identified with the people involved in Akhnatons family and court, and some interesting parallels are drawn.     In the late 42s ": null
    },
    {
        "Ola Rotimi": "ola rotimi"
    },
    {
        " published a novel and play,  The Gods Are Not To Blame , which retell the Oedipus myth happening in the ": null
    },
    {
        "Yoruba kingdom": "yorùbáland"
    },
    {
        ". Rotimi O., The Gods are Not to Blame, Three Crown Books, Nigeria 42               ": null
    },
    {
        "Sigmund Freud": "sigmund freud"
    },
    {
        " used the name the Oedipus ": null
    },
    {
        "complex": "complex"
    },
    {
        " to explain the origin of certain ": null
    },
    {
        "neuroses": "neurosis"
    },
    {
        " in childhood. It is defined as a male childs unconscious desire for the exclusive love of his mother. This desire includes jealousy towards the father and the unconscious wish for that parents death, as well as the unconscious desire for ": null
    },
    {
        "sexual intercourse": "sexual intercourse"
    },
    {
        " with the mother. Oedipus himself, as portrayed in the myth, did not suffer from this neurosis – at least, not towards Jocasta, whom he only met as an adult . Freud reasoned that the ancient Greek audience, which heard the story told or saw the plays based on it, did know that Oedipus was actually killing his father and marrying his mother; the story being continually told and played therefore reflected a preoccupation with the theme.      The term ": null
    },
    {
        "oedipism": "oedipism"
    },
    {
        " is used in medicine for serious self-inflicted eye injury, an extremely rare form of severe ": null
    },
    {
        "self-harm": "self-harm"
    }
]