[
    {
        "   The concept of an Ogdoad appears in ": null
    },
    {
        "Gnostic": "gnosticism"
    },
    {
        " systems of the early Christian era, and was further developed by the theologian ": null
    },
    {
        "Valentinus": "valentinus"
    },
    {
        " .     The number eight plays an important part in Gnostic systems, and it is necessary to distinguish the different forms in which it appeared at different stages in the development of Gnosticism. The earliest Gnostic systems included a theory of ": null
    },
    {
        "seven heavens": "seven heavens"
    },
    {
        " and a supercelestial region called the Ogdoad. Astronomical theories had introduced the concept of seven ": null
    },
    {
        "planetary spheres": "celestial spheres"
    },
    {
        " with an eighth above them, the sphere of the fixed stars.     In the ": null
    },
    {
        "system of Valentinus": "valentinianism"
    },
    {
        ", the seven heavens, and even the region above them, were regarded as but the lowest and last stage of the exercise of creative power. Above them was the ": null
    },
    {
        "Pleroma": "pleroma"
    },
    {
        ", where were exhibited the first manifestations of the evolution of subordinate existence from the great First Principle.                All the early Gnostics of whose opinions ": null
    },
    {
        "Irenaeus": "irenaeus"
    },
    {
        " gives an account, in a section  probably derived from an earlier writer, agree in the doctrine that the world was made by the instrumentality of ": null
    },
    {
        "archon": "archon"
    },
    {
        "s . The brief account given of the teaching of the first two in the list, ": null
    },
    {
        "Simon": "simon magus"
    },
    {
        " and Menander, does not state whether or not they defined the number of these archons; but it is expressly told of the third, Saturninus , that he counted them as seven. At the end of the first book of Irenaeus is a section to all appearance derived from a source different from that just referred to. He here  relates the opinions of heretics to whom he himself gives no title, but whom his copyist ": null
    },
    {
        "Theodoret": "theodoret"
    },
    {
        "  calls ": null
    },
    {
        "Ophites": "ophites"
    },
    {
        ". The Ophite teaching may be used to illustrate that of Saturninus, his connexion with that school being closer than with any other. It would have been natural to think that the number of seven archons was suggested to Saturninus by astronomical considerations; and this supposition is verified by the statement in the later chapter  that the holy Hebdomas are the seven stars called planets. In fact, the sphere of the seven stars, ": null
    },
    {
        "Saturn": "saturn"
    },
    {
        ", ": null
    },
    {
        "Jupiter": "jupiter"
    },
    {
        ", ": null
    },
    {
        "Mars": "mars"
    },
    {
        ", the ": null
    },
    {
        "Sun": "sun"
    },
    {
        ", ": null
    },
    {
        "Venus": "venus"
    },
    {
        ", ": null
    },
    {
        "Mercury": "mercury"
    },
    {
        ", and the ": null
    },
    {
        "Moon": "moon"
    },
    {
        ", were supposed to be presided over, each by a different archon. Their names are differently given; Irenaeus giving them, ": null
    },
    {
        "Ialdabaoth": "demiurge"
    },
    {
        ", the chief, Iao, Sabaoth, Adonaeus, Eloaeus, Oreus, and Astaphaeus. With this closely agrees ": null
    },
    {
        "Origen": "origen"
    },
    {
        ", who, writing of the Ophites , gives the names Ialdabaoth, Iao, Sabaoth, Adonaeus, Astaphaeus, Eloaeus, Horaeus. Epiphanius , relating the opinions of what was clearly a branch of the same school, places in the highest heaven Ialdabaoth or, according to others, Sabaoth; in the next, Elilaeus according to one version, Ialdabaoth according to the other; in the next Adonaeus and Eloaeus; beneath these Dades, Seth, and Saclas; lowest of all Iao. It was thought that each of the Jewish prophets was sent by a different one of these seven archons, whose special glory that prophet was to declare. Thus  the first archon sent ": null
    },
    {
        "Moses": "moses"
    },
    {
        ", ": null
    },
    {
        "Joshua": "joshua"
    },
    {
        ", ": null
    },
    {
        "Amos": "amos"
    },
    {
        ", and ": null
    },
    {
        "Habakkuk": "habakkuk"
    },
    {
        "; the second ": null
    },
    {
        "Samuel": "samuel"
    },
    {
        ", ": null
    },
    {
        "Nathan": "nathan"
    },
    {
        ", ": null
    },
    {
        "Jonah": "jonah"
    },
    {
        ", and ": null
    },
    {
        "Micah": "micah"
    },
    {
        "; the third ": null
    },
    {
        "Elijah": "elijah"
    },
    {
        ", ": null
    },
    {
        "Joel": "joel"
    },
    {
        ", and ": null
    },
    {
        "Zechariah": "zechariah"
    },
    {
        "; the fourth ": null
    },
    {
        "Isaiah": "isaiah"
    },
    {
        ", ": null
    },
    {
        "Ezekiel": "ezekiel"
    },
    {
        ", ": null
    },
    {
        "Jeremiah": "jeremiah"
    },
    {
        ", and ": null
    },
    {
        "Daniel": "daniel"
    },
    {
        "; the fifth ": null
    },
    {
        "Book of Tobit": "book of tobit"
    },
    {
        " and ": null
    },
    {
        "Haggai": "haggai"
    },
    {
        "; the sixth ": null
    },
    {
        "Micah": "micah"
    },
    {
        "  and ": null
    },
    {
        "Nahum": "nahum"
    },
    {
        "; the seventh ": null
    },
    {
        "Ezra": "ezra"
    },
    {
        " and ": null
    },
    {
        "Zephaniah": "zephaniah"
    },
    {
        ".            The ancient astronomy taught that above the seven planetary spheres was an eighth, the sphere of the fixed stars . In the eighth sphere, these Gnostics taught, dwelt the mother to whom all these archons owed their origin, ": null
    },
    {
        "Sophia": "wisdom in gnosticism"
    },
    {
        " or Prunikos according to the version of Irenaeus, ": null
    },
    {
        "Barbelo": "barbelo"
    },
    {
        " according to that of Epiphanius. In the language of these sects the word hebdomad not only denotes the seven archons, but is also a name of place, denoting the heavenly regions over which the seven archons presided; while Ogdoad denotes the supercelestial regions which lay above their control.     Again, beside the higher hebdomad of the seven archons, the Ophite system told of a lower hebdomad. After the serpent in punishment for having taught ": null
    },
    {
        "the first parents": "adam and eve"
    },
    {
        " to transgress the commands of Ialdabaoth was cast down into this lower world, he begat himself six sons, who with himself form a hebdomad, the counterpart of that of which his father Ialdabaoth is chief. These are the seven ": null
    },
    {
        "demons": "demons"
    },
    {
        ", the scene of whose activity is this lower earth, not the heavens; and who delight in injuring the human race on whose account their father had been cast down. Origen  gives their names and forms from an ": null
    },
    {
        "Ophite diagram": "ophite diagrams"
    },
    {
        "; ": null
    },
    {
        "Michael": "michael"
    },
    {
        " in form as a lion, ": null
    },
    {
        "Suriel": "suriel"
    },
    {
        " as an ox, ": null
    },
    {
        "Raphael": "raphael"
    },
    {
        " as a dragon, ": null
    },
    {
        "Gabriel": "gabriel"
    },
    {
        " as an eagle, Thauthabaoth as a bear, Erataoth as a dog, Onoel or Thartharaoth as an ass.     It does not appear that the Oriental philosophy, or the earliest Gnostic systems, recognised any place higher than the eighth sphere; and it is here that according to the account of Epiphanius  dwelt Barbelo the mother of all. But Grecian philosophy came to teach that above the sensible world there lay a still higher, and Clem. Alex.  speaks of the eighth sphere as lying nearest to noeto kosmo. Accordingly, those Gnostic systems which are tinctured by Grecian philosophy, while leaving untouched the doctrine of seven or eight material heavens, develop in various ways the theory of the region above them. In the system of ": null
    },
    {
        "Basilides": "basilides"
    },
    {
        ", as reported by ": null
    },
    {
        "Hippolytus": "hippolytus of rome"
    },
    {
        " , Ogdoad and Hebdomad are merely names of place. In that system the universe is divided into the Kosmos and the hypercosmical region. At the highest point of the Kosmos presides the great archon, ruling over the Ogdoad, or ethereal region, which is described as reaching down to the moon. Beneath the Ogdoad is the Hebdomad presided over by its own archon. In one place the names Ogdoad and Hebdomad seem to be given to the archons themselves. In any case the names shew marks of having been derived from a previous system, for the system of Basilides itself gives no account of the numbers seven or eight; and the number of heavens is not limited to seven, as many as 42 being counted. In  Pistis Sophia , the doctrine of the higher regions receives such enormous development that the seven planetary spheres are thought of as contemptibly low; and Ialdabaoth, once their ruler, in this book sinks to a demon.     The word Hebdomad occurs also in the Clementine  Homilies , but its use there is quite unconnected with the teaching hitherto described. The mystery of the Hebdomad there unfolded  is an independent exposition of the six days work of creation, and the seventh days rest; illustrated by the six directions, into which infinite space extends, viz. up, down, right, left, backward, forward, together with the central point considered as making a seventh.     The mysteries of the number seven are treated of by Clem. Alex. , and in the source whence he borrowed .            In the system of Valentinus again the names Ogdoad and Hebdomad occur in the same signification. Above this lower world are the seven heavens, where dwells their maker the Demiurge himself also, on that account, called Hebdomas . Of these seven heavens ": null
    },
    {
        "Marcus": "marcus"
    },
    {
        " taught in more detail . Above these heavens is the Ogdoad, also called he mesotes, and Jerusalem above, the abode of ": null
    },
    {
        "Achamoth": "sophia"
    },
    {
        ", who herself also is called Ogdoad . Over the Ogdoad is the ": null
    },
    {
        "Pleroma": "pleroma"
    },
    {
        ", the abode of the Aeons. Thus , we have the threefold division, ta kata tous aionas, ta kata ten ogdoada, ta kata ten hebdomada. This use of the words Hebdomad and Ogdoad also bears traces of derivation from a previous system, the word Ogdoad occurring in a different sense in the system of Valentinus himself, whose Ogdoad within the Pleroma was probably intended to answer to the Ogdoad outside. Irenaeus  argues from what is told of Pauls ascent to the third heaven against the low place assigned to the heavens in the Valentinian scheme.       In the earliest stages of that evolution we have  eight primary Aeons constituting the first Ogdoad. The ultimate conception of God, named the Ineffable Father and who has existed since before the beginning, is described as Depth or Profundity . All around him exists a female power that has been named Silence . These two deities, Depth and Silence, become the cause, through a process of ": null
    },
    {
        "emanation": "emanationism"
    },
    {
        ", of the other ": null
    },
    {
        "archetypal": "archetype"
    },
    {
        " beings or ": null
    },
    {
        "Aeon": "aeon"
    },
    {
        "s. The Aeons are always born in male-female pairs , each of which is in itself a divine principle but at the same time represents one aspect of the Ineffable Father, who otherwise could not be described nor comprehended as he is beyond all names. The emanation takes place in the following manner: Depth-and-Silence gives birth to Mind-and-Truth , who gives birth to Word-and-Life , who gives birth to Man-and-Church . These Aeonic pairs comprise the Fullness of Godhead , and the first eight Aeons that have been expounded here are the Valentinian Ogdoad.      Though this Ogdoad is first in order of evolution, if the Valentinian theory be accepted as true, yet to us who trace the history of the development of that system the lower Ogdoad must clearly be pronounced the first, and the higher only as a subsequent extension of the previously accepted action of an Ogdoad. Possibly also the Egyptian doctrine of eight primary gods may have contributed to the formation of a theory of which Egypt was the birthplace. In any case an Ogdoad 42 + 42 would have been inconsistent with a theory an essential part of which was the coupling its characters in pairs, male and female. ": null
    },
    {
        "Hippolytus of Rome": "hippolytus of rome"
    },
    {
        "  connects the system of Valentinus with that of ": null
    },
    {
        "Simon": "simonians"
    },
    {
        ", in which the origin of things is traced to a central first principle, together with six roots. If for the one first principle we substitute a male and female principle, the 42 + 42 of Simon becomes the 42 + 42 of Valentinus. This very question, however, whether the first principle were to be regarded as single or twofold was one on which the Valentinians themselves were not agreed; and their differences as to the manner of counting the numbers of the primary Ogdoad confirm what has been said as to the later origin of this doctrine.       The doctrine of an Ogdoad of the commencement of finite existence having been established by Valentinus, those of his followers who had been imbued with the ": null
    },
    {
        "Pythagorean philosophy": "pythagoreans"
    },
    {
        " introduced a modification. In that philosophy the ": null
    },
    {
        "Tetrad": "tetrad"
    },
    {
        " was regarded with peculiar veneration, and held to be the foundation of the sensible world. The Pythagorean oath by the Tetrad is well known. ": null
    },
    {
        "Meursius": "meursius"
    },
    {
        ", Demiurg. Pythag. ch. 42 ap. Gronov. Thes. Gr. Ant. col. 42; to which may be added Hippol. Ref. vi. 42 p. 42     The Valentinian Secundus divided the Ogdoad into a right-hand and a left-hand Tetrad ; and in the case of ": null
    },
    {
        "Marcus": "marcus"
    },
    {
        ", who largely uses Pythagorean speculations about numbers, the Tetrad holds the highest place in the ": null
    },
    {
        "system": "marcosians"
    }
]