[
    {
        "     Ogun or Ogoun  is an ": null
    },
    {
        "Orisha": "orisha"
    },
    {
        ", ": null
    },
    {
        "Loa": "loa"
    },
    {
        ", and ": null
    },
    {
        "Vodun": "vodun"
    },
    {
        ". He is a ": null
    },
    {
        "warrior": "combatant"
    },
    {
        " and a powerful spirit of ": null
    },
    {
        "metal work": "metal work"
    },
    {
        ", as well as of ": null
    },
    {
        "rum": "rum"
    },
    {
        " and rum-making. He is also known as the god of Iron.          In ": null
    },
    {
        "Yoruba religion": "yoruba religion"
    },
    {
        ", Ogun is a primordial orisha who first appeared as a hunter named Tobe Ode. He is said to have been the first Orisha to descend to the realm of Ile Aiye , to find suitable place for future human life. In some traditions he is said to have cleared a path for the other gods to enter Earth, using a metal ax and with the assistance of a dog. To commemorate this, one of his ": null
    },
    {
        "praise names": "oriki"
    },
    {
        ", or oriki, is Osin Imole or the first of the primordial Orisha to come to Earth . He is the god of war and metals.     In his earthly life Ogun is said to be the first king of ": null
    },
    {
        "Ife": "ife"
    },
    {
        ". When some of his subjects failed to show respect, Ogun killed them and ultimately himself with his own sword. He disappeared into the earth at a place called Ire-Ekiti, with the promise to help those who call on his name. His followers believe him to have wo ile sun, to have disappeared into the earths surface instead of dying. Throughout his earthly life, he is thought to have fought for the people of Ire, thus is known also as Onire.     He is now celebrated in ": null
    },
    {
        "Ekiti": "ekiti state"
    },
    {
        ", ": null
    },
    {
        "Oyo": "oyo state"
    },
    {
        ", and ": null
    },
    {
        "Ondo": "ondo state"
    },
    {
        " States.         Ogun is the traditional deity of warriors, hunters, blacksmiths, technologists, and drivers in the Yoruba religion. Followers of traditional Yoruba religion can swear to tell the truth in court by kissing a piece of iron in the name of Ogun. Drivers carry an ": null
    },
    {
        "amulet": "amulet"
    },
    {
        " of Ogun to ward off traffic accidents.         The primary symbols of Ogun are iron, the dog, and the ": null
    },
    {
        "palm frond": "palm branch"
    },
    {
        ". They symbolize Oguns role in transformation, mediation, and function. Iron is the primary emblem of Ogun. Ogun altars and ceremonies display and use iron objects both in Yoruba areas and the across the African diaspora. Followers of Ogun wear chains of iron implements; Ogun festivals feature the display of knives, guns, blacksmith implements, scissors, wrenches, and other iron implements from daily life.       Meats are a sacrifice for Ogun. Dogs are the traditional companions of hunters, but Oguns personality is also seen as doglike : aggressive, able to face danger, and straightforward. Other sacrificial animals associated with Ogun are the ": null
    },
    {
        "spitting cobra": "spitting cobra"
    },
    {
        " ; its behavior is aggressive and fearless. Hunters and blacksmiths avoid eating or witnessing the mating of blacksnakes. Other important sacrificial offerings to Ogun are the  Clarias submarginatus  , alligator pepper, ": null
    },
    {
        "kola nut": "kola nut"
    },
    {
        "s, ": null
    },
    {
        "palm wine": "palm wine"
    },
    {
        " and red palm oil, small rats, roosters, salt, snails, tortoise, water, yams. . Many of these sacrificial offerings were carried into New World traditions.     Ogun worshipers are known to sing a song that insinuates that Ogun is in seven paths.     Ogun Alaara ni gba aja - Ogun of the Alaara people collects dog.   Ogun Ajeero ni gbaagbo - Ogun of the Ajeero people collects ram.   Ogun Ikole a gbaigbin - Ogun of the Ikole people will collect snail.   Ogun Elemono ni gbesun isu - Ogun of the Elemono will collect roasted yam.   Ogun Gbena Gbena eran ahun ni je - Ogun of the wood carvers eats the tortoises meat.   Biko gba Tapa, a gba aboki, a gba kemberi a bilala lenu   Meje logun, meje nire. Ogun onire oko mi.         In ": null
    },
    {
        "Dahomey religion": "dahomey religion"
    },
    {
        ", Gu is the vodun of war and patron deity of smiths and craftsmen. He was sent to earth to make it a nice place for people to live, and he has not yet finished this task.          Ogun is known in the ": null
    },
    {
        "Afro-Brazilian": "afro-brazilian"
    },
    {
        " tradition of ": null
    },
    {
        "Candomblé": "candomblé"
    },
    {
        " as Ogum  or Gu . Ogum is syncretized with ": null
    },
    {
        "Saint George": "saint george"
    },
    {
        ", notably in ": null
    },
    {
        "Rio de Janeiro": "rio de janeiro"
    },
    {
        " and the state of ": null
    },
    {
        "Rio Grande do Sul": "rio grande do sul"
    },
    {
        ". Candomblé tradition in ": null
    },
    {
        "Northeast Brazil": "northeast brazil"
    },
    {
        ", especially in ": null
    },
    {
        "Bahia": "bahia"
    },
    {
        ", associates Ogum with ": null
    },
    {
        "Saint Sebastian": "saint sebastian"
    },
    {
        " or ": null
    },
    {
        "Saint Anthony": "anthony of padua"
    },
    {
        ".       Consecrated day: Tuesday   Metal: iron   Element: earth   Color: red, black, green , blue , marine blue   Food: ": null
    },
    {
        "feijoada": "feijoada"
    },
    {
        ", xinxim, yams   Archetype: impetuous, authoritarian, cautious, hardworking, suspicious and a bit selfish   Symbols: sword, broadsword, iron chain     Individual devotees of Ogum in Brazil avoid certain foods. These include goat, cajá-manga , sugar, black beans, yams, and the manga-espada  in the ": null
    },
    {
        "Ketu": "candomblé ketu"
    },
    {
        " nation; yams and manga-espada in the ": null
    },
    {
        "Ijexa": "candomblé jejé"
    },
    {
        " nation; and ": null
    },
    {
        "partridge": "partridge"
    },
    {
        " in the ": null
    },
    {
        "Jeje": "candomblé jejé"
    },
    {
        " nation.         Ogum, as a male orisha , only eats male animals. ": null
    },
    {
        "Ox": "ox"
    },
    {
        ", billy ": null
    },
    {
        "goat": "goat"
    },
    {
        ", ": null
    },
    {
        "rooster": "rooster"
    },
    {
        ", ": null
    },
    {
        "snake": "snake"
    },
    {
        " , ": null
    },
    {
        "dog": "dog"
    },
    {
        ", and ": null
    },
    {
        "game": "game"
    },
    {
        " animals are sacrificed on festival days associated with Ogum in the Candomblé tradition.         ": null
    },
    {
        "Acaçá": "acaçá"
    },
    {
        " is a ritual food offered to all gods in the Candomble pantheon; it is made of a paste of corn mash steamed in banana leaves. A variation, acaçá de feijão-preto, substitutes ": null
    },
    {
        "black beans": "black turtle bean"
    },
    {
        "  for corn. This variation is only offered to Ogum in the ": null
    },
    {
        "Casa Fanti Ashanti": "casa fanti ashanti"
    },
    {
        " temple in ": null
    },
    {
        "São Luís": "são luís"
    },
    {
        ", in the state of ": null
    },
    {
        "Maranhão": "maranhão"
    },
    {
        ". ": null
    },
    {
        "Feijoada": "feijoada"
    },
    {
        ", a stew of beans with beef and pork, is also a common offering to Ogum.         Oguns centrality to the Yoruba religion has resulted in his name being retained in Santería religion, as well as the Orisa religion of ": null
    },
    {
        "Trinidad and Tobago": "trinidad and tobago"
    },
    {
        ". In ": null
    },
    {
        "Santería": "santería"
    },
    {
        ", Ogún is syncretized with ": null
    },
    {
        "Saint Peter": "saint peter"
    },
    {
        ", ": null
    },
    {
        "Santiago": "santiago"
    },
    {
        ", ": null
    },
    {
        "Saint Paul": "saint paul"
    },
    {
        ", and ": null
    },
    {
        "John the Baptist": "john the baptist"
    },
    {
        "; he is the deity of war and metals.         In ": null
    },
    {
        "Haitian Vodou": "haitian vodou"
    },
    {
        " Ogun is known as Ogou, and consists of an array of manifestations; most carry the aspect of iron smithing and tools from the Yoruba tradition. The Ogou guard the badji, the sacred altar of the Vodou temple. He carries an iron saber and wears a red sash. Ogou is also the god of pioneering, intelligence, justice, medicine, and political power; these are associated with the symbol of the tool that can advance humans mastery over the environment. Ogou Feray is the god of war. Other manifestations of Ogou are Ogou Badagri, Ogou Balenjo, Ogou Batala, and Ogou Je Wouj. Ezili Freda Daome is the female counterpart to Ogou.     Ogou Feray is syncretized with ": null
    },
    {
        "St. James the Greater": "st. james the greater"
    },
    {
        "  in the Vodou tradition. He is a warrior spirit and protects the Vodou community; he guides Vodou followers against their enemies. He is symbolically covered in iron and may not be harmed by his enemies. As in Africa, his symbol is a piece of iron, a machete, or a knife. As in Africa, Ogou is revered among blacksmiths, many of whom are of Yoruba origin. He is also noted to like women and alcohol.     In Vodou ceremonies followers of Ogou wear a red shirt, pants, and scarf. A followers of Ogou in a possession-trance is offered Haitian white rum during the ceremony. In some ceremonies rum is burned in a container to allow Ogou to wash the hands of the followers.     Two Vodou songs to Ogou, as recorded and translated by Michel S. Laguerre:     Fè Ogou Fè, Ogou Fèray o,   Fè Ogou Fè, Ogou Fèray o     I am an iron,   I am covered with iron.     Fèrè Fèray tout ko Fèray sé kouto,   Fèrè Fèray tout ko Fèray sé manchèt.     The body of Ogou Fèray is covered with knives,   The body of Fèray is covered with machetes.         Léo Neto, et al. observed various species used in sacrificial ritual in twelve Candomblé communities of ": null
    },
    {
        "Caruaru": "caruaru"
    },
    {
        ", ": null
    },
    {
        "Pernambuco": "pernambuco"
    },
    {
        " and ": null
    },
    {
        "Campina Grande": "campina grande"
    },
    {
        ", ": null
    },
    {
        "Paraíba": "paraíba"
    },
    {
        " in the ": null
    },
    {
        "Northeastern": "northeast region, brazil"
    },
    {
        " region of Brazil between August 42 and June 42; dogs were the only sacrificial animal offered to Ogun in both communities.       ": null
    }
]