[
    {
        "                  An oil lamp is an object used to produce light continuously for a period of time using an oil-based fuel source. The use of oil lamps began thousands of years ago and continues to this day, although not commonly anymore.     Oil lamps are a form of ": null
    },
    {
        "lighting": "lighting"
    },
    {
        ", and were used as an alternative to candles before the use of electric lights. Starting in 42 the ": null
    },
    {
        "Argand lamp": "argand lamp"
    },
    {
        " quickly replaced other oil lamps still in their basic ancient form. These in turn were replaced by the ": null
    },
    {
        "kerosene lamp": "kerosene lamp"
    },
    {
        " in about 42 In small towns and rural areas the latter continued in use well into the 42th century, until such areas were finally ": null
    },
    {
        "electrified": "electrification"
    },
    {
        " and light bulbs could be used.     Sources of fuel for oil lamps include a wide variety of plants such as nuts and seeds . Also widely used were animal fats . ": null
    },
    {
        "Camphine": "camphine"
    },
    {
        ", a blend of ": null
    },
    {
        "turpentine": "turpentine"
    },
    {
        " and ": null
    },
    {
        "alcohol": "ethanol"
    },
    {
        ", was the first ": null
    },
    {
        "burning fluid": "burning fluid"
    },
    {
        " fuel for lamps after ": null
    },
    {
        "whale oil": "whale oil"
    },
    {
        " supplies were depleted. It was replaced by ": null
    },
    {
        "kerosene": "kerosene"
    },
    {
        " after Congress enacted excise taxes on alcohol to pay for the ": null
    },
    {
        "Civil War": "american civil war"
    },
    {
        ".     Most modern lamps  have been replaced by ": null
    },
    {
        "gas-based": "propane"
    },
    {
        " or ": null
    },
    {
        "petroleum-based": "naphthaother applications"
    },
    {
        " fuels to operate when emergency non-electric light is required. Therefore, oil lamps of today are primarily used for the particular ambience they produce.            The following are the main external parts of a ": null
    },
    {
        "terra-cotta": "terra-cotta"
    },
    {
        " lamp:   Shoulder Pouring hole     : The hole through which fuel is put inside the fuel chamber. The width ranges from 4242 cm in general. There may be single or multiple holes.     Wick hole, and the nozzle.   : It may be just an opening in the body of the lamp, or an elongated nozzle. In some specific types of lamps, there is a groove on the superior aspect of the nozzle that runs along to the pouring hole to re-collect the oozing oil from the wick.   Handle   : Lamps can come with or without a handle. The handle can come in different shapes. The most common is a ring shaped for the forefinger surmounted by a ": null
    },
    {
        "palmette": "palmette"
    },
    {
        ", on which the thumb is pressed to stabilize the lamp. Other handles can be crescent shaped, triangular, or semi-ovalular. The handleless lamps usually have an elongated nozzle, and sometimes have a ": null
    },
    {
        "lug": "lug"
    },
    {
        " rising diagonally from the periphery. The lug may act as a small handle where the thumb rests. Some lugs are pierced. It was speculated that pierced lugs were used to place a pen or straw, called the acus or festuca, with which the wick was trimmed. Others think that the pierced lugs were used to hang the lamp with a metal hook when not in use. Discus Fuel chamber   : The fuel reservoir. The mean volume in a typical terra-cotta lamp is 42 cc.       Lamps can be categorized based on different criteria, including material , shape, structure, design, and imagery .       Typologically, lamps of the Ancient ": null
    },
    {
        "Mediterranean": "mediterranean"
    },
    {
        " can be divided into seven major categories:     Wheel-made: This category includes Greek and Egyptian lamps that date before the 42rd century BC. They are characterized by simple, little or no decoration, and a wide pour hole, a lack of handles, and a pierced or unpierced ": null
    },
    {
        "lug": "lug"
    },
    {
        ". Pierced lugs occurred briefly between 42th and 42rd century BC. Unpierced lugs continued until the 42st century BC.     Volute, Early Imperial: With spiral, scroll-like ornaments  extending from their nozzles, these lamps were predominantly produced in Italy during the ": null
    },
    {
        "Early Roman": "history of the roman empire27 bc—ad 14: augustus"
    },
    {
        " period. They have a wide discus, a narrow shoulder and no handle, elaborate imagery and artistic finishing, and a wide range of patterns of decoration.     High Imperial: These are late Roman. The shoulder is wider and the discus is smaller with fewer decorations. These lamps have handles and short plain nozzles, and less artistic finishing.     Frog: This is a regional style lamp exclusively produced in ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        " and found in the regions around it, between c. 42 and 42 AD. The ": null
    },
    {
        "frog": "frog"
    },
    {
        "  is an Egyptian fertility symbol.      African Red Slip  lamps were made in North Africa, but widely exported, and decorated in a red slip. They date from the 42nd to the 42th century AD and comprise a wide variety of shapes including a flat, heavily decorated shoulder with a small and relatively shallow discus. Their decoration is either non-religious, ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " or ": null
    },
    {
        "Jewish": "jewish"
    },
    {
        ". Grooves run from the nozzle back to the pouring hole, it is hypothesized that this is to take back spilled oil. These lamps often have more than one pour-hole.     Slipper lamps are oval-shaped and found mainly in the ": null
    },
    {
        "Levant": "levant"
    },
    {
        ". They were produced between the 42rd to 42th centuries AD.   Decorations include vine scrolls, palm wreaths, and Greek letters.     Factory lamps: Also called Firmalampen , these are universal in distribution and simple in appearance. They have a channeled nozzle, plain discus, and 42 or 42 bumps on the shoulder. Initially made in ": null
    },
    {
        "factories": "factories"
    },
    {
        " in Northern Italy and Southern ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        " between the 42st and 42rd centuries AD, they were exported to all Roman provinces. The vast majority were stamped on the bottom to identify the manufacturer.                Lamps appear in the Torah and other Jewish sources as a symbol of “lighting” the way for the righteous, the wise, and for love and other positive values. While fire was often described as being destructive, light was given a positive spiritual meaning. The oil lamp and its light were important household items, and this may explain their symbolism. Oil lamps were used for many spiritual rituals.   The oil lamp and its light also became important ritualistic articles with the further development of Jewish culture and its religion. The Temple ": null
    },
    {
        "Menorah": "menorah"
    },
    {
        ", a ritual seven-branched oil lamp used in the Second Temple, forms the centre of the ": null
    },
    {
        "Chanukah": "chanukah"
    },
    {
        " story.             There are several references to oil lamps in the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        ", In the ": null
    },
    {
        "Orthodox Church": "orthodox church"
    },
    {
        " and many ": null
    },
    {
        "Eastern Catholic Churches": "eastern catholic churches"
    },
    {
        " oil lamps  are still used both on the ": null
    },
    {
        "Holy Table": "holy table"
    },
    {
        " and to illuminate ": null
    },
    {
        "icon": "icon"
    },
    {
        "s on the ": null
    },
    {
        "iconostasis": "iconostasis"
    },
    {
        " and around the ": null
    },
    {
        "temple": "temple"
    },
    {
        " . Orthodox Christians will also use oil lamps in their homes to illuminate their ": null
    },
    {
        "icon corner": "icon corner"
    },
    {
        ". Traditionally, the ": null
    },
    {
        "sanctuary lamp": "sanctuary lamp"
    },
    {
        " in an Orthodox church is an oil lamp. It is lit by the ": null
    },
    {
        "bishop": "bishop"
    },
    {
        " when the church is ": null
    },
    {
        "consecrated": "consecrated"
    },
    {
        ", and ideally it should burn perpetually thereafter. The oil burned in all of these lamps is traditionally ": null
    },
    {
        "olive oil": "olive oil"
    },
    {
        ". Oil lamps are also referenced as a symbol throughout the New Testament, including in the Parable of the  Virgins                  Oil lamps are commonly used in ": null
    },
    {
        "Hindu temple": "hindu temple"
    },
    {
        "s as well as in home shrines. Generally the lamps used in temples are circular with places for five wicks. They are made of metal and either suspended on a chain or screwed onto a pedestal. There will usually be at least one lamp in each shrine, and the main shrine may contain several. Usually only one wick is lit, with all five burning only on festive occasions. The oil lamp is used in the Hindu ritual of ": null
    },
    {
        "Aarti": "aarti"
    },
    {
        ".     In the home shrine, the style of lamp is usually different, containing only one wick. There is usually a piece of metal that forms the back of the lamp, which has a picture of a Hindu deity embossed on it. In many houses, the lamp burns all day, but in other homes, it is lit at sundown. The lamp in the home shrine is supposed to be lit before any other lights are turned on at night.     A hand-held oil lamp or incense sticks are also used during the Hindu ": null
    },
    {
        "puja": "puja"
    },
    {
        " ceremony. In the North of India, a five-wick lamp is used, usually fueled with ": null
    },
    {
        "ghee": "ghee"
    },
    {
        ". On special occasions, various other lamps may be used for puja, the most elaborate having several tiers of wicks.     In ": null
    },
    {
        "South India": "south india"
    },
    {
        ", there are a few types of oil lamps that are common in temples and traditional rituals, some of the smaller ones are used for offerings as well:a    Deepalakshmi, a brass lamp with a depiction of goddess ": null
    },
    {
        "Sri Lakshmi": "sri lakshmi"
    },
    {
        " over the back piece. They are usually small and have only one wick.    Nilavilakku , a tall brass or bronze lamp on a stand where the wicks are placed at a certain height.   Paavai vilakku, a brass or bronze lamp in the form of a lady holding a vessel with her hands. This type of lamp comes in different sizes, from very small to almost life-size. There are also large stone versions of this lamp in ": null
    },
    {
        "Hindu temple": "hindu temple"
    },
    {
        "s and shrines of ": null
    },
    {
        "Karnataka": "karnataka"
    },
    {
        ", ": null
    },
    {
        "Tamil Nadu": "tamil nadu"
    },
    {
        " and ": null
    },
    {
        "Kerala": "kerala"
    },
    {
        ", especially at the base of columns and flanking the entrance of temples. They have only one wick.   Thooku vilakku, a brass or bronze lamp hanging from a chain, often with multiple wicks.    Nachiarkoil lamp , an ornamental brass lamp made of series of ": null
    },
    {
        "diya": "diya"
    },
    {
        "s, a handicraft product which is exclusively made by Pather  community in ": null
    },
    {
        "Nachiyar Koil": "nachiyar koil"
    },
    {
        " town in ": null
    },
    {
        "Tamil Nadu": "tamil nadu"
    },
    {
        ", India. , Times of India, 42 october 42          Oil lamps are lit at traditional Chinese shrines before either an image of a deity or a plaque with Classical Chinese characters giving the name of the deity. Such lamps are usually made from clear glass and are filled with oil, sometimes with water underneath. A cork or plastic floater containing a wick is placed on top of the oil with the bottom of the wick submerged in the oil.     Such lamps are kept burning in shrines, whether private or public, and incense sticks or joss sticks are lit from the lamp.          Curved stone lamps were found in places dated to the ": null
    },
    {
        "42th millennium BC": "10th millennium bc"
    },
    {
        " . The oldest stone-oil lamp was found in ": null
    },
    {
        "Lascaux": "lascaux"
    },
    {
        " in 42 in a cave that was inhabited 42 to 42 years ago.         Some archaeologists claim that the first shell-lamps were in existence more than 42 years ago . They believe that the alabaster shell-shaped lamps dug up in Sumerian sites dating 42 BC were imitations of real shell-lamps that were used for a long time .     It is generally agreed that the evolution of handmade lamps moved from bowl-shaped to saucer-shaped, then from saucer with a nozzle, to a closed bowl with a spout.       The first manufactured red pottery oil lamps appeared. These were of the round bowl type.       Lamps were simple wheel-made bowls with a slight pinch on four sides for the wick. Later lamps had only one pinch. These lamps vary in the shape of the rim, the general shape of the bowl and the shape of the base.     Intermediate Bronze Age lamps   The earliest lamps known from Intermediate Bronze Age lamps   With the four wick lamps. These lamps are made from large bowls with four shallow pinches for wicks.   Middle Bronze Age lamps   The four-wick oil lamps persist into this period, most of the lamps now have one wick. Early in this period the pinch is shallow, while later on it becomes more prominent and the mouth protrudes from the lamps body. The bases are simple and flat. The crude potter’s wheel is introduced, transforming the handmade bowls to a more uniform container. The saucer style evolves into a single spout shape.   Late Bronze Age lamps   A more pronounced, deeper single spout is developed, and it is almost closed on the sides. The shape is evolving to be more triangular, deeper and larger. All lamps are now wheel-made. The base is simple, usually flat.         The rim becomes wider and flatter with a deeper and higher spout. The tip of the spout is more upright in contrast to the rest of the rim.     The lamps are becoming variable in shape and distribution. We still find lamps similar to the Late Bronze period. In addition, other forms evolve, such as small lamps with a flat base and larger lamps with a round base. The later form continues into the Iron Age II.     In the later Iron Age, we encounter variant forms. One common type is small, with a wide rim and a wide base. Another type is a small, shallow bowl with a thick and high discus base.             The ": null
    },
    {
        "seal-oil lamp": "seal-oil lamp"
    },
    {
        "  provided warmth and light in the harsh Arctic environment where there was no wood and where the sparse inhabitants relied almost entirely on seal oil. This lamp was the most important article of furniture for the ": null
    },
    {
        "Inuit": "inuit"
    },
    {
        ", ": null
    },
    {
        "Yupik": "yupik peoples"
    },
    {
        " and other ": null
    },
    {
        "Eskimo": "eskimo"
    },
    {
        " peoples. Joyce, T. A. & Dalton, O. M. Handbook to the ethnographical collections. British Museum. Dept. of British and Mediaeval Antiquities and Ethnography Joyce,     The lamps were made of stone and their sizes and shapes of lamps could be different, but mostly were elliptical or half-moon shaped. The wicks were mostly made of dried moss or ": null
    },
    {
        "cottongrass": "eriophorum callitrix"
    },
    {
        " and was lit along the edge of the lamp. A slab of seal blubber could be left to melt over the lamp feeding it with more fat.        These large lamps have thin sides and a deep pinch, which flattens the mouth and makes it protrude outward.       Lamps are more closed to avoid spilling. They are smaller and more refined. Most are handleless. Some are with a lug, pierced and not pierced. The nozzle is elongated. The rim is folded over to make the nozzle, so it overlaps and is then pinched to make the wick hole.     They are round in shape, wheel-made.       The earliest Chinese oil lamps are dated from the ": null
    },
    {
        "Warring States period": "warring states period"
    },
    {
        " . The ancient Chinese created oil lamps with a refillable reservoir and a fibrous wick, giving the lamp a controlled flame. Lamps were constructed from jade, bronze, ceramic, wood, stone, and other materials. The largest oil lamp excavated so far is one discovered in a 42th-century tomb located in modern Pingshan, Hebei.              Production of oil-lamps shifted to Italy as the main source of supply. Molds used. All lamps are closed in type. Lamps produced in large scale in factories. The lamp is produced in two parts, the upper part with the spout and the lower part with the fuel chamber. Most are of the characteristic Imperial Type. It was round with nozzles of different forms , with a closed body and with a central disk decorated with reliefs and its filling hole.       The High Imperial Type. More decorations. Produced locally or imported in large scale. The multiple-nozzled lamps appear. Different varieties.     In this period we find the frog type lamps. These are kidney or heart shaped or oval. With the motif of a frog or its abstraction, and sometimes with geometrical motifs. They were produced around 42 AD. They are so variant that it is seldom that two identical ones are found.       Oil lanterns were slipper-shaped and highly decorative. The multiple-nozzle design continued and most lamps bore handles. Some are complex in their external anatomy.            There is a transition period from Byzantine to Islamic lamps. The decoration on lamps of this transition period changed from crosses, animals, human likenesses, birds, fish, etc., to plain linear, geometric, and raised-dot patterns.     The early Islamic lamps continued the traditions of Byzantine lamps. Decorations were initially a stylized form of bird, grain, tree, plant, or flower. Then they became entirely geometric or linear with raised dots.     In 42th-century ": null
    },
    {
        "Baghdad": "baghdad"
    },
    {
        ", ": null
    },
    {
        "al-Razi": "al-razi"
    },
    {
        " described the first ": null
    },
    {
        "kerosene lamp": "kerosene lamp"
    },
    {
        "; he referred to it as the naffatah in his Kitab al-Asrar .   Zayn Bilkadi , The Oil Weapons ,  Saudi Aramco World , January–February 42 p. 4242       In the transition period some lamps had Arabic writing. Then writing disappears until the ": null
    },
    {
        "Mamluk": "mamluk"
    },
    {
        " period .         Oil-burning carriage lamps provided a model for the first bicycle lamps in the 42s.             ": null
    },
    {
        "Menorah oil lamp": "menorah"
    },
    {
        ", seven nozzles: Rare and are associated with Judaism because of the numerical connection with the seven branches or arms of the Menorah.   Samaritan oil lamp: Characterized by a sealed filling hole, which was to be broken by the buyer. This was probably done to ensure ritual purity. A wider spout, and the concavities flanking the nozzle are almost always emphasized with a ladder pattern band. In general the lamps are uncoated. The decorations are linear and/or geometric.   Type I: A distinct channel running from the pouring-hole to the nozzle, a small knob handle, a ladder pattern around the nozzle and shows no ornamentation on the bottom of the base.   Type II: Pear-shaped and elongated, lined channel that extends from the filling-hole to the nozzle, continued to be used through to the early Muslim period.   Candle Stick oil lamp: Menorah design on the nozzle and bunch of grapes on the shoulders.   Byzantine oil lamp: The upper parts are covered with braided patterns and their handles. All are made of a dark orange-red clay. A rounded bottom with a distinct X or cross appears inside the circled base.   Early Islamic oil lamp: Large knob handle and the channel above the nozzle are dominant elements. The handle is tongue-shaped. Decoration is rich and elegant. The lower parts are extremely broad and the nozzles are pointed.                    In ": null
    },
    {
        "Vedic times": "vedic period"
    },
    {
        ", fire was kept alive in every household in some form and carried with oneself while migrating to new locations. Later the presence of fire in the household or a religious building was ensured by an oil lamp. Over the years various rituals and customs were woven around an oil lamp.     For Deep Daan, the gift of a lamp was and still is believed to be the best daan . During marriages, spinsters of the household stand behind the bride and groom, holding an oil lamp to ward off evil. The presence of an oil lamp is an important aspect of ritual worship offered to a deity. Moreover, a day is kept aside for the worship of the lamp in the busy festival calendar, on one amavasya day in the month of ": null
    },
    {
        "Shravan": "shravan"
    },
    {
        ". This reverence for the deep is based on the symbolism of the journey from darkness and ignorance to light and the knowledge of the ultimate reality – tamaso ma jyotirgamaya .     Earlier lamps were made out of stone or seashells. The shape was like a circular bowl with a protruding beak. Later they were replaced by earthen and metal lamps. In the epics ": null
    },
    {
        "Ramayana": "ramayana"
    },
    {
        " and ": null
    },
    {
        "Mahabharata": "mahabharata"
    },
    {
        ", there are references to gold and silver lamps as well. The simple shape evolved and the lamps were created in the shapes of the matsya , kurma and other incarnations of god ": null
    },
    {
        "Vishnu": "vishnu"
    },
    {
        " and also in the shape of the many emblems of gods like conch shells, lotuses and so on. The birds like swans, peacocks, parrots and animals like snakes, lions, elephants and horses were also favorites when decorating a lamp. For lighting multiple lamps, wooden and stone deepastambhas were created.        Erecting a deepastambha in front of a temple is still a general practice in western and southern India. In some of the South Indian temples, raised lamp towers called Kamba Vilakku made of brass can be seen. For adapting the design to households and smaller spaces, the deepavriksha was formed. As the name suggests, it is a metal lamp container with aesthetically curvi-linear lines branching out from the base each holding a lamp. The Deepalakshmi is another common design where goddess Lakshmi holds the lamp in her hands. Kuthuvilakku is another typical lamp traditionally used for household purposes in South India.     Oil lamps also became proverbial. For example, a Bradj proverb says, Chiraag tale andhera , the darkness is under the oil-lamp , meaning that what you seek could be close but unnoticed , in various senses .       When the ": null
    },
    {
        "Big Temple": "brihadeeswarar temple"
    },
    {
        " in Thanjavur, Tamil Nadu was built 42 AD, there were elaborate measures taken to provide lighting for the temple. Lands were donated to or conquered for the temple for this sole objective. The income from these lands would go towards providing the oil for the lights.          Excellent introductory booklet, well illustrated.    Huge catalogue in four quarto volumes, THE lamp bible but extremely expensive even second-hand. Referred to as BMC.    Edwardian illustrated article for the Society of Antiquaries of Scotland, interesting insight into the general knowledge of that time.    Less academic than the museum catalogues and short on dating but fairly comprehensive and extensively illustrated.    Another superb catalogue and excellent reference, perhaps second only to Bailey    In French, good coverage of earlier and later lamps in the Louvre, well illustrated.    In German, superb catalogue, profusely illustrated and captioned.    Useful introduction but illustrations are very poor and beware as several of the items shown have since been exposed as fakes.    In French, brief guide to a few lamps in the Brussels Museum.    Superseded by Bailey but still worthwhile and much cheaper if you can find an old copy.    In German, small booklet but excellent illustrations in color.        Paperback. In French with short summaries in English, Italian and German. Excellent general survey of lamps, detailed study and catalogue of the small collection of Roman oil lamps at Nyon.    Paperback, frustratingly unindexed but a refreshing approach and well worth plowing through.    In German, emphasis on local lamps found in Trier but excellent coverage of all Roman types of the Rhineland.    In German, catalogue of lamps.    In German, long out-of-print classic but a superb reference if you can find a copy        Comprehensive coverage of lamps from Palestine region.    Standard reference.        Good coverage of local lamps.    Excellent booklet, profusely illustrated and a recommended reference, very cheap used copies.        In Italian, detailed catalogue of locally found lamps.   ": null
    }
]