[
    {
        " Old California  is a 42-page ": null
    },
    {
        "Disney comics": "disney comics"
    },
    {
        " story written, drawn, and lettered by ": null
    },
    {
        "Carl Barks": "carl barks"
    },
    {
        ". The story stars ": null
    },
    {
        "Donald Duck": "donald duck"
    },
    {
        " and his nephews ": null
    },
    {
        "Huey, Dewey, and Louie": "huey, dewey, and louie"
    },
    {
        ". It was first published in  Four Color  42 with a cover by Carl Buettner, a four-page Grandma Duck story drawn and lettered by Bob Moore, and several one-page gag stories by Moore.       Donald Duck and his nephews ": null
    },
    {
        "Huey, Dewey and Louie": "huey, dewey and louie"
    },
    {
        " are on a holiday in ": null
    },
    {
        "California": "california"
    },
    {
        ", heading to ": null
    },
    {
        "Los Angeles": "los angeles, california"
    },
    {
        ". They take a small narrow road that seems deserted and discuss Californias history as they travel. Donald Duck opines that the turning point in Californias history was the ": null
    },
    {
        "California gold rush": "california gold rush"
    },
    {
        ". As he speaks passionately on this topic, Donald Duck is momentarily distracted from his driving. The car crashes in a rock besides the road.     When Donald Duck and his three nephews regain consciousness, they find they are visitors of a local tribe of ": null
    },
    {
        "Native Americans": "native americans in the united states"
    },
    {
        ". The tribe kindly offer to help the foursome recover. The exhausted Ducks are offered a drink, and they fall sleep. When they wake again, they find themselves in ": null
    },
    {
        "Alta California": "alta california"
    },
    {
        ", 42 They quickly manage to befriend a local Spanish-speaking family of ": null
    },
    {
        "Californios": "californios"
    },
    {
        ", owners of a ": null
    },
    {
        "cattle ranch": "cattle ranch"
    },
    {
        ", together with the ranch workers. As visitors, Donald Duck and his nephews observe the familys life and moreover, they attempt to help with the family problems. They visit ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " and acquire land cheaply, but soon are swindled out of them by American settlers. Afterwards, the Ducks become involved in the ": null
    },
    {
        "Gold Rush": "gold rush"
    },
    {
        " and as goldminers partner with a friend from the ranch. The Ducks do the digging, and their partners fists and guns make sure that nobody swindles them out of their gold.     After their friend departs the Ducks start to experience an odd fading of their environment. It seems to them that all their acquaintances from this era are now only distant memories. It is at this point that the Duck family truly regain consciousness to discover the truth. They were in a ": null
    },
    {
        "coma": "coma"
    },
    {
        " in a hospital bed for weeks. The drink they had accepted had kept them sleeping for this long. The Ducks all have the same memory of their apparent experiences in ": null
    },
    {
        "time travel": "time travel"
    }
]