[
    {
        "The Old Italic scripts are a set of similar ancient ": null
    },
    {
        "writing systems": "writing systems"
    },
    {
        " used in the ": null
    },
    {
        "Italian Peninsula": "italy"
    },
    {
        " between about 42 and 42  BCE, for various languages spoken in that time and place. The most notable member is the ": null
    },
    {
        "Etruscan alphabet": "etruscan alphabet"
    },
    {
        ", which was the immediate ancestor of the ": null
    },
    {
        "Latin alphabet": "latin alphabet"
    },
    {
        " currently used by ": null
    },
    {
        "English": "english language"
    },
    {
        " and many other languages of the world. The ": null
    },
    {
        "runic alphabet": "runic alphabet"
    },
    {
        "s used in northern ": null
    },
    {
        "Europe": "europe"
    },
    {
        " are believed to have been separately derived from one of these alphabets by the 42nd  century  AD.       The Old Italic alphabets clearly derive from the ": null
    },
    {
        "Phoenician alphabet": "phoenician alphabet"
    },
    {
        ", apparently through the ": null
    },
    {
        "Cumaean alphabet": "cumaean alphabet"
    },
    {
        " used in the ": null
    },
    {
        "Euboean Greek": "euboean greek"
    },
    {
        " colonies of ": null
    },
    {
        "Ischia": "ischia"
    },
    {
        " and ": null
    },
    {
        "Cumae": "cumae"
    },
    {
        " in the ": null
    },
    {
        "Bay of Naples": "bay of naples"
    },
    {
        " in the 42th  century  BCE. The Etruscans were the leading civilization of Italy in that period, and it is assumed that the other Old Italic scripts were derived from theirs – although some of them, including the Latin alphabet, retained certain Greek letters that the Etruscans themselves dropped at a rather early stage.     The Old Italic alphabets were used for various different languages, which included some ": null
    },
    {
        "Indo-European": "indo-european languages"
    },
    {
        " ones  and some non-Indo-European ones .       The following table shows the ancient Italic scripts that are presumed to be related to the Etruscan alphabet. Symbols that are assumed to be correspondent are placed on the same column. Many symbols occur with two or more variant forms in the same script; only one variant is shown here. The notations ← and → indicate that the shapes shown were used when writing right-to-left and left-to-right, respectively. For more information, such as variant shapes and the prevalent writing direction of each script, see the corresponding language article.     Warning: For the languages marked the appearance of the Letters in the table is whatever ones browsers Unicode font shows for the corresponding code points in the Old Italic Unicode block . The same code point represents different symbol shapes in different languages; therefore, to display those glyph images properly one needs to use a Unicode font specific to that language.                  Various ": null
    },
    {
        "Indo-European languages": "indo-european languages"
    },
    {
        " belonging to the ": null
    },
    {
        "Italic": "italic languages"
    },
    {
        " branch  originally used the alphabet. Faliscan, Oscan, Umbrian, ": null
    },
    {
        "North Picene": "north picene"
    },
    {
        ", and South Picene all derive from an Etruscan form of the alphabet.       ": null
    },
    {
        "42px": "image:segni alfabeto nucerino.png"
    },
    {
        "     The Nucerian alphabet is based on inscriptions found in southern Italy . It is attested only between the 42th and the 42th century BC.   The most important sign is the /S/, shaped like a fir tree, and possibly a derivation from the ": null
    },
    {
        "Phoenician alphabet": "phoenician alphabet"
    },
    {
        ".        Missing from the above table:   ": null
    },
    {
        "Venetic": "venetic language"
    },
    {
        " Faliscan": "faliscan language"
    },
    {
        " Umbrian": "umbrian language"
    },
    {
        " North Picene": "north picene language"
    },
    {
        " Messapic": "messapic language"
    },
    {
        " Rhaetic": "rhaetic language"
    },
    {
        "   Camunic": "camunic language"
    },
    {
        "       The alphabet of ": null
    },
    {
        "Sanzeno": "sanzeno"
    },
    {
        " , about 42  ": null
    },
    {
        "Raetic": "raetic"
    },
    {
        " inscriptions.      The alphabet of Magrè , east Raetian inscriptions.       Alphabet of Este: Similar but not identical to that of Magrè, ": null
    },
    {
        "Venetic": "venetic"
    },
    {
        " inscriptions.       Inscribed ": null
    },
    {
        "abecedarium": "abecedarium"
    },
    {
        " on ": null
    },
    {
        "rock drawings in Valcamonica": "rock drawings in valcamonica"
    },
    {
        ".             42 of the 42 archaic Etruscan letters were adopted for ": null
    },
    {
        "Old Latin": "old latin"
    },
    {
        " from the 42th century BC, either directly from the ": null
    },
    {
        "Cumae alphabet": "cumae alphabet"
    },
    {
        ", or via archaic Etruscan forms, compared to the classical Etruscan alphabet retaining B, D, K, O, Q, X but dropping Θ, Ś, Φ, Ψ, and F.             The South Picene alphabet, known from the 42th century BC, is most like the southern ": null
    },
    {
        "Etruscan alphabet": "etruscan alphabet"
    },
    {
        " in that it uses Q for /k/ and K for /g/.    is a reduced  and  is a reduced , used for .             The Old Italic alphabets were unified and added to the ": null
    },
    {
        "Unicode": "unicode"
    },
    {
        " Standard in March, 42 with the release of version 42. The Unicode block for Old Italic is U42 & ndash;U42F without specification of a particular alphabet .     Writing direction  varies based on the language and even the time period. For simplicity most scholars use left-to-right and this is the Unicode default direction for the Old Italic block. For this reason, the glyphs in the code chart are shown with left-to-right orientation.        ": null
    }
]