[
    {
        "           Richard Oliver Postgate , generally known as Oliver Postgate, was an English animator, ": null
    },
    {
        "puppeteer": "puppeteer"
    },
    {
        " and writer. He was the creator and writer of some of Britains most popular childrens television programmes.  Pingwings ,  Pogles Wood ,  Noggin the Nog ,  Ivor the Engine ,  Clangers  and  Bagpuss , were all made by ": null
    },
    {
        "Smallfilms": "smallfilms"
    },
    {
        ", the company he set up with ": null
    },
    {
        "Peter Firmin": "peter firmin"
    },
    {
        ", and were shown on the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " between the 42s and the 42s, and on ": null
    },
    {
        "ITV": "itv"
    },
    {
        " from 42 to the present day. In a 42 BBC poll Bagpuss was voted the most popular childrens television programme of all time.       Postgate was born in ": null
    },
    {
        "Hendon": "hendon"
    },
    {
        ", ": null
    },
    {
        "Middlesex": "middlesex"
    },
    {
        ", England, into the ": null
    },
    {
        "Postgate family": "postgate family"
    },
    {
        ", as the younger son of journalist and writer ": null
    },
    {
        "Raymond Postgate": "raymond postgate"
    },
    {
        " and Daisy Lansbury, making him the cousin of actress ": null
    },
    {
        "Angela Lansbury": "angela lansbury"
    },
    {
        " and grandson of ": null
    },
    {
        "Labour": "the labour party"
    },
    {
        " politician, and sometime leader, ": null
    },
    {
        "George Lansbury": "george lansbury"
    },
    {
        ". His other grandfather was the Latin classicist ": null
    },
    {
        "John Percival Postgate": "john percival postgate"
    },
    {
        ". His brother was the microbiologist and writer ": null
    },
    {
        "John Postgate": "john postgate"
    },
    {
        " FRS": "fellow of the royal society"
    },
    {
        ".       Postgate was educated at the private Woodstock School on Golders Green Road in ": null
    },
    {
        "Finchley": "finchley"
    },
    {
        " in north-west London and Woodhouse Secondary School, formerly known from 42 onwards as Woodhouse Grammar School, also in Finchley , followed by ": null
    },
    {
        "Dartington Hall School": "dartington hall school"
    },
    {
        ", a progressive private boarding school in ": null
    },
    {
        "Devon": "devon"
    },
    {
        ".          Postgate joined the ": null
    },
    {
        "Home Guard": "british home guard"
    },
    {
        " in 42 while studying at ": null
    },
    {
        "Kingston College of Art": "kingston college of art"
    },
    {
        ", but when he became liable for military service during the Second World War the following year, he declared himself a ": null
    },
    {
        "conscientious objector": "conscientious objector"
    },
    {
        ", as his father had done during the First World War. He was initially refused recognition; he accepted a medical examination as a first step to call up, and then reported for duty with the Army in ": null
    },
    {
        "Windsor": "windsor, berkshire"
    },
    {
        ", but refused to put on the uniform. He was ": null
    },
    {
        "court-martialled": "court-martialled"
    },
    {
        " and sentenced to three months in ": null
    },
    {
        "Feltham Prison": "feltham prison"
    },
    {
        ". This qualified him to return to the Appellate Tribunal, where he was granted exemption conditional upon working on the land or in social service, the unserved portion of his sentence being remitted. He worked on farms until the end of the war, when he went to ": null
    },
    {
        "occupied Germany": "occupied germany"
    },
    {
        ", working for the ": null
    },
    {
        "Red Cross": "red cross"
    },
    {
        " in social relief work.       On return to the UK, from 42 he attended drama school, but drifted through a number of different jobs, never really finding his niche.     In 42 he was appointed a ": null
    },
    {
        "stage manager": "stage manager"
    },
    {
        " with ": null
    },
    {
        "Associated-Rediffusion": "associated-rediffusion"
    },
    {
        ", which then held the ITV franchise for London. Attached to the childrens programming section, he thought he could do better with the relatively low budgets of the then ": null
    },
    {
        "black and white television": "black and white television"
    },
    {
        " productions. Postgate wrote  Alexander The Mouse , a story about a mouse born to be king. Using an Irish-produced magnetic system  – on which animated characters were attached to a painted background, and then photographed through a 42-degree mirror  – he persuaded ": null
    },
    {
        "Peter Firmin": "peter firmin"
    },
    {
        ", who was then teaching at the ": null
    },
    {
        "Central School of Art": "central school of art"
    },
    {
        ", to create the background scenes. Postgate later recalled they undertook around 42 of these programmes live-to-air, which were made harder by the production problems encountered by the use and restrictions of using magnets.     After the success of Alexander the Mouse, Postgate agreed a deal to make the next series on film, for a budget of £42 per programme. Making a ": null
    },
    {
        "stop motion": "stop motion"
    },
    {
        " animation table in his bedroom, he wrote the Chinese story The Journey of Master Ho. This was intended for ": null
    },
    {
        "deaf": "deaf"
    },
    {
        " children, a distinct advantage in that the production required no soundtrack which reduced the production costs. He engaged an honorary Chinese painter to produce the backgrounds, but as the painter was classical Chinese-trained he produced them in ": null
    },
    {
        "three-quarters view": "perspective"
    },
    {
        ", rather than in the conventional Egyptian full-view manner used for flat animation under a camera. This resulted in the Firmin-produced characters looking as though they were short in one leg, but the success of the production provided the foundation for Postgate with Firmin to start up his own company solely producing animated childrens programmes.          Setting up their business in a disused cowshed at Firmins home in ": null
    },
    {
        "Blean": "blean"
    },
    {
        " near ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        ", Kent, Postgate and Firmin worked on childrens animation programmes. Based on concepts which mostly originated with Postgate, Firmin did the artwork and built the models, while Postgate wrote the scripts, did the ": null
    },
    {
        "stop motion": "stop motion"
    },
    {
        " filming and many of the voices. ": null
    },
    {
        "Smallfilms": "smallfilms"
    },
    {
        " was therefore able to produce two minutes of film per day, ten times as much as a conventional animation studio, with Postgate moving the cardboard pieces himself, and working his 42mm camera frame-by-frame with a home-made clicker. As Postgate voiced many of the productions, and also narrated ": null
    },
    {
        "WereBear": "werebear"
    },
    {
        " stories, his distinctive voice became familiar to generations of children.     They started in 42 with Ivor the Engine, a series for ITV about a Welsh ": null
    },
    {
        "steam locomotive": "steam locomotive"
    },
    {
        " who wanted to sing in a choir, based on Postgates wartime encounter with Welshman Denzyl Ellis, who used to be the ": null
    },
    {
        "fireman": "fireman"
    },
    {
        " on the ": null
    },
    {
        "Royal Scot": "royal scot"
    },
    {
        ".  This was followed by ": null
    },
    {
        "Noggin the Nog": "noggin the nog"
    },
    {
        " for the BBC, which established Smallfilms as a reliable source to produce childrens entertainment, when there were only two television channels in the UK. Postgate later described the gentlemanly and rather innocent business thus:        Postgate had strict views on story-line development, which perhaps resultantly restricted the length of each particular series development. When asked if the Clangers adventures were quite surreal sometimes, Postgate replied:          In the 42s and 42s Postgate was active in the anti-nuclear campaign, addressing meetings and writing several pamphlets including The Writing on the Sky.     In 42 in collaboration with the historian Naomi Linnell, Postgate painted a  Illumination of the Life and Death of Thomas Becket  for a book of the same name, which is now in the archive of the ": null
    },
    {
        "Royal Museum and Art Gallery": "royal museum and art gallery"
    },
    {
        ", Canterbury. In 42 he painted a similar work on ": null
    },
    {
        "Christopher Columbus": "christopher columbus"
    },
    {
        " for a book entitled The Triumphant Failure. A Canterbury Chronicle, a ": null
    },
    {
        "triptych": "triptych"
    },
    {
        " by Postgate commissioned in 42 hangs in the Great Hall of ": null
    },
    {
        "Eliot College": "eliot college, kent"
    },
    {
        " on the ": null
    },
    {
        "University of Kent": "university of kent"
    },
    {
        "s ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        " campus.     Postgate narrated the six-part ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " comedy series  Elastic Planet  in 42      In his later years, he ": null
    },
    {
        "blogged": "blogging"
    },
    {
        " for the  New Statesman . Postgates voice was heard once more in 42 as narrator for Alchemists of Sound, a television documentary about the ": null
    },
    {
        "BBC Radiophonic Workshop": "bbc radiophonic workshop"
    },
    {
        ". On 42 July 42 he was guest on ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        "s  Desert Island Discs . He was also a guest on ": null
    },
    {
        "The Russell Brand Show": "the russell brand show"
    },
    {
        " on 42 January 42 where he discussed the making of Bagpuss and his subsequent work in TV and Film.     In 42 the ": null
    },
    {
        "University of Kent at Canterbury": "university of kent"
    },
    {
        " awarded an honorary degree to Postgate, who stated that the degree was really intended for ": null
    },
    {
        "Bagpuss": "bagpuss"
    },
    {
        ", who was subsequently displayed in academic dress.       Postgate married Prudence Prue Myers in 42 becoming stepfather to her three children. The couple had twins in 42 , and another son in 42 . Prue died of cancer in 42 Naomi Linnell was his partner for the last twenty-three years of his life.     His autobiography, Seeing Things, was published in 42 and after Oliver died in 42 his son Daniel wrote an afterword which was added at the end of the book.     He is distantly related to the Australian-born writer and academic ": null
    },
    {
        "Coral Lansbury": "coral lansbury"
    },
    {
        ", whose son ": null
    },
    {
        "Malcolm Turnbull": "malcolm turnbull"
    },
    {
        " became the 42th ": null
    },
    {
        "Prime Minister of Australia": "prime minister of australia"
    },
    {
        ".       Postgate died at a ": null
    },
    {
        "nursing home": "nursing home"
    },
    {
        " in ": null
    },
    {
        "Broadstairs": "broadstairs"
    },
    {
        ", near his home on the Kent coast, on 42 December 42 aged 42     After his death there was huge recognition of his influence and effect on British culture, and affection for the role his work had played in many peoples lives. His work was widely discussed in the UK media and many tributes were paid to him and his work across the internet. ": null
    },
    {
        "Charlie Brooker": "charlie brooker"
    },
    {
        " dedicated a portion of his ": null
    },
    {
        "Screenwipe": "charlie brookers screenwipe"
    },
    {
        " show to Oliver Postgate, and the way he influenced Brookers own childhood, in an episode that was broadcast the day after Postgates death.  & t42        The Burglarproof Bath Plug- A Collection of Memories, Thoughts and Small Stories Including The Trouble with Magic, Oliver Postgate 42 foreword by Stephen Fry  Seeing Things: An Autobiography, Oliver Postgate; illustrated by Peter Firmin, 42 – ; republished in 42 –  The Writing on the Sky, Oliver Postgate 42 –  BECKET, Oliver Postgate & Naomi Linnell 42 –  Columbus, The Triumphant Failure, Oliver Postgate & Naomi Linnell 42   The Sagas of Noggin the Nog Oliver Postgate and Peter Firmin; illustrated by Peter Firmin, 42 –   Thinking it through: the Plain Mans Guide to the Bomb, Oliver Postgate 42 ": null
    }
]