[
    {
        "   The Olney Hymns  were first published in February 42 and are the combined work of ": null
    },
    {
        "curate": "curate"
    },
    {
        " John Newton": "john newton"
    },
    {
        " and his poet friend, ": null
    },
    {
        "William Cowper": "william cowper"
    },
    {
        " . The ": null
    },
    {
        "hymn": "hymn"
    },
    {
        "s were written for use in Newtons rural parish, which was made up of relatively poor and uneducated followers. The Olney Hymns are an illustration of the potent ideologies of the ": null
    },
    {
        "Evangelical": "evangelical"
    },
    {
        " movement, to which both men belonged, present in many communities in England at the time.     The Olney Hymns were very popular; by 42 there had been 42 recorded editions, and it is likely that many other editions were printed in both Britain and ": null
    },
    {
        "America": "united states"
    },
    {
        ". As hymn-singing gained popularity in the nineteenth century, many of the hymns were reproduced in other hymn-books and ": null
    },
    {
        "pamphlet": "pamphlet"
    },
    {
        "s. Today around six of the original 42 Olney Hymns regularly feature in modern church worship, the most famous of which is ": null
    },
    {
        "Amazing Grace": "amazing grace"
    },
    {
        " . However, Amazing Grace as it is popularly known was first set to the tune New Britain by ": null
    },
    {
        "William Walker": "william walker"
    },
    {
        " in  The Southern Harmony and Musical Companion  in 42       The ": null
    },
    {
        "Buckinghamshire": "buckinghamshire"
    },
    {
        " town from which the hymns get their name, ": null
    },
    {
        "Olney": "olney, buckinghamshire"
    },
    {
        ", was, at the time of first publication, a ": null
    },
    {
        "market town": "market town"
    },
    {
        " of about 42 people. Around 42 of these were employed in its ": null
    },
    {
        "lace-making": "lace-making"
    },
    {
        " industry. This was generally poorly paid, and Cowper is said to have described his neighbours as the half-starved and ragged of the earth . The Olney Hymns were written primarily with these poor and under-educated people in mind.     Olney is situated near the borders of Buckinghamshire, ": null
    },
    {
        "Bedfordshire": "bedfordshire"
    },
    {
        ", and ": null
    },
    {
        "Northamptonshire": "northamptonshire"
    },
    {
        " – an area traditionally associated with religious ": null
    },
    {
        "Dissent": "english dissenters"
    },
    {
        ". Dissenters were ": null
    },
    {
        "Protestants": "protestants"
    },
    {
        " who refused to follow the rules of the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        " after the ": null
    },
    {
        "Restoration": "english restoration"
    },
    {
        " of ": null
    },
    {
        "Charles II": "charles ii of england"
    },
    {
        " in 42 and when Newton settled in Olney the town still supported two Dissenting ": null
    },
    {
        "chapels": "chapels"
    },
    {
        ". Notable local Dissenters included ": null
    },
    {
        "John Bunyan": "john bunyan"
    },
    {
        ", from ": null
    },
    {
        "Bedford": "bedford"
    },
    {
        ", author of the  Pilgrims Progress , and another important hymn writer, ": null
    },
    {
        "Philip Doddridge": "philip doddridge"
    },
    {
        " , from ": null
    },
    {
        "Northampton": "northampton"
    },
    {
        ". Newtons own associations with Dissenters meant he was in a position to conciliate with, rather than confront, his parishioners, and he quickly achieved a reputation as a popular preacher. Within his first year at Olney a gallery was added to the church to increase its ": null
    },
    {
        "congregational": "congregational"
    },
    {
        " capacity, and the weekly prayer-meetings were moved in 42 to ": null
    },
    {
        "Lord Dartmouth": "lord dartmouth"
    },
    {
        "s mansion, the Great House, to accommodate even greater numbers. Jesus whereer thy people meet was written for their first meeting at the Great House.       John Newton was an only child, and was a ": null
    },
    {
        "self-educated": "self-educated"
    },
    {
        " sea captain": "sea captain"
    },
    {
        ", at one time captaining ": null
    },
    {
        "slave ship": "slave ship"
    },
    {
        "s.   Newtons conversion occurred during a violent storm at sea on 42 March 42 He describes the event in his autobiography, An Authentic Narrative , and thereafter marked the anniversary of his conversion as a day of thanksgiving. This incident revived Newtons belief in God, and despite considerable reservations from within the established church , he achieved the position of priest in Olney in 42 Newtons apparent influence and charisma proved beneficial to him and his parish when local Evangelical merchant, ": null
    },
    {
        "John Thornton": "john thornton"
    },
    {
        ", to whom he had sent a copy of his autobiography, offered the parish £42 per year, requesting that Newton, in part, provided for the poor. This annual contribution ceased when Newton left in 42 to take the position of ": null
    },
    {
        "Rector": "rector"
    },
    {
        " at ": null
    },
    {
        "St. Mary Woolnoth": "st. mary woolnoth"
    },
    {
        " in London. Newtons ": null
    },
    {
        "epitaph": "epitaph"
    },
    {
        " on a ": null
    },
    {
        "plaque": "commemorative plaque"
    },
    {
        " in St. Mary Woolnoth, written by Newton himself, bears these words:        William Cowper was the son of an ": null
    },
    {
        "Anglican": "anglican"
    },
    {
        " clergyman, and well-educated at ": null
    },
    {
        "Westminster School": "westminster school"
    },
    {
        ". Cowper was liable to bouts of severe ": null
    },
    {
        "depression": "major depressive episode"
    },
    {
        " throughout his adult life, and during a period in an ": null
    },
    {
        "asylum": "psychiatric hospital"
    },
    {
        " he was counselled by his cousin, ": null
    },
    {
        "Martin Madan": "martin madan"
    },
    {
        ", an Evangelical clergyman. His new enthusiasm for Evangelicalism, his conversion, and his move to Olney in 42 brought him into contact with John Newton. Cowper eventually became an unpaid curate at Newtons church, helping with the distribution of Thorntons funds.     Cowper is best known not just for his contribution to the Olney Hymns, but as a poet, letter-writer, and translator: his works include  The Diverting History of John Gilpin  ,  The Task  and his translation of the works of ": null
    },
    {
        "Homer": "homer"
    },
    {
        ", published in 42 Cowper left Olney for nearby Weston Underwood in 42         The Olney Hymns are in part an expression of Newtons and Cowpers personal religious ": null
    },
    {
        "faith": "faith"
    },
    {
        " and experience, and a reflection of the principal ": null
    },
    {
        "tenets": "wikt:tenets"
    },
    {
        " of the Evangelical faith: the inherent ": null
    },
    {
        "sinfulness": "sinfulness"
    },
    {
        " of man; ": null
    },
    {
        "religious conversion": "religious conversion"
    },
    {
        "; ": null
    },
    {
        "atonement": "atonement in christianity"
    },
    {
        "; activism; ": null
    },
    {
        "devotion to the Bible": "bible study"
    },
    {
        "; Gods ": null
    },
    {
        "providence": "divine providence"
    },
    {
        "; and the belief in an eternal ": null
    },
    {
        "life after death": "life after death"
    },
    {
        ". However, the hymns were primarily written for immediate and day-to-day use in Newtons ": null
    },
    {
        "ministry": "christian ministry"
    },
    {
        " at Olney. Here they were sung, or chanted, in church or at Newtons other Sunday and weekday meetings as a collective expression of worship. Hymn singing, though, was not without controversy, particularly within the ": null
    },
    {
        "Established church": "established church"
    },
    {
        ", the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ". By the 42s hymns had become an established feature of religious devotion in the Evangelical church, where early  hymns were versifications of the biblical text of the ": null
    },
    {
        "psalms": "psalms"
    },
    {
        ", known as ": null
    },
    {
        "metrical psalms": "metrical psalms"
    },
    {
        ". In the Church of England, hymns other than metrical psalms were of questionable legality until the 42s, as they were not explicitly sanctioned by the ": null
    },
    {
        "Book of Common Prayer": "book of common prayer"
    },
    {
        ". As a consequence, many church leaders reserved hymn-singing for meetings other than the main Sunday services, and for private or household devotions.     In the preface to the Hymns Newton says: They should be Hymns, not ": null
    },
    {
        "Ode": "ode"
    },
    {
        "s, if designed for public worship, and for the use of plain people . Newton also explains his two primary motives for publishing: his desire to promote the faith and comfort of sincere Christians , and as a permanent record of his friendship with Cowper. Newton is attributed with suggesting that he and Cowper collaborate on a collection of hymns, ultimately drawn largely from Newtons texts accumulated over some 42 years . Of the 42 hymns in the original published edition of 42 some commentaries state that Cowper wrote just 42 between 42 and 42 and Newton the remainder, while other sources attribute 42 to Cowper. It is known, however, that Newton wrote some of the hymns in direct response to events around him: Oh for a closer walk with God for instance was written by Cowper in response to the serious illness then being suffered by his house companion, ": null
    },
    {
        "Mary Unwin": "mary unwin"
    },
    {
        ", an illness she survived.     There is no evidence to show that either Newton or Cowper wrote any music to accompany the hymns. It is assumed that they were initially sung to any suitable tune that fitted the metre , most probably to 42th or 42th century metrical psalm tunes. Subsequently, individual tunes have become linked to specific hymns from the Olney books. For example, the tune Austria  is associated today with the hymn  Glorious Things of Thee Are Spoken , just as New Britain, an American folk melody believed to be Scottish or Irish in origin, has since the 42s been associated with  Amazing Grace . This hymns Scottish or Irish melody is ": null
    },
    {
        "pentatonic": "pentatonic"
    },
    {
        " and suggests a ": null
    },
    {
        "bagpipe": "bagpipe"
    },
    {
        " tune; the hymn is frequently performed on bagpipes and has become associated with that instrument. . Retrieved 42 April 42     As an expression of the many Evangelical beliefs, Amazing Grace serves as an example: The first ": null
    },
    {
        "stanza": "stanza"
    },
    {
        " , for instance, expresses Newtons sense of past sinfulness, as a wretch , but also conversion, from being lost and blind to now I see . Gods providence, and Cowpers sense of a close and personal relationship with God are voiced in stanza four: He will my shield and portion be . The belief in eternal life after death is expressed in stanzas five and six: when this flesh and heart shall fail , I shall possess A life of joy and peace , and God, who calld me here below, Will be for ever mine .     Amazing Grace was not the original title of this hymn: It was originally written as a poem entitled Faiths Review and Expectation and appears as Hymn 42 in Book I of the Olney Hymns with that title. The six stanza version quoted is the original, as written by Newton, but it has also appeared in longer forms where others have added verses or where verses from other hymns from the Olney books have been moved across.     The Olney Hymns are subdivided into three books: Book I, On Select Texts of Scripture; Book II, On occasional Subjects; and, Book III, On the Progress and Changes of the Spiritual Life. The sub-divisions reflect key Evangelical beliefs. Book I holds that the Bible is the ultimate source of religious authority, and its hymns are written to provide the believer, through simple language, with a thorough understanding of its contents. Book IIs Occasional Subjects are those that bring understanding to the priorities of the Evangelical ": null
    },
    {
        "spiritual": "spirituality"
    },
    {
        " life. There is a section for instance on Providences , which serves to illustrate the Evangelical belief in Gods ever-present controlling hand. Book III is written to express Newtons ideas of the stages of personal spiritual awakening and ": null
    },
    {
        "salvation": "salvation"
    },
    {
        ".     The undoubted popularity of the hymns was not simply a matter of local taste, but can be seen within the wider, developing religious climate in England. The relative rise in popularity of the Evangelical movement in the late 42th and early 42th centuries was due to a number of reasons: the onset of the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " and the subsequent break-up of, particularly, rural communities, was an unsettling influence on a parish like Olney; Methodism had seen a significant growth in popularity in the same period; and Evangelicalism was gradually finding its way into the established Church of England. However, Newtons and Cowpers writing clearly fitted its purpose. Cowpers relatively few hymns demonstrate his poetic and creative abilities, whereas Newtons prose have been assessed by some as wooden . Nevertheless, the principal purpose of the hymns was not a ": null
    },
    {
        "theological": "theological"
    },
    {
        " discussion or representation of the Bible; rather, they were written for plain people . Newtons use of simple and repetitive metres and simple rhyming structures helped his congregation remember the words. The significant emphasis on I within the hymns shows Newtons view that the hymns are a product of his personal experience, a feature of his belief in personal ": null
    },
    {
        "repentance": "repentance"
    }
]