[
    {
        "Ons Heemecht  is the ": null
    },
    {
        "national anthem": "national anthem"
    },
    {
        " of ": null
    },
    {
        "Luxembourg": "luxembourg"
    },
    {
        ". The title in ": null
    },
    {
        "Luxembourgish": "luxembourgish"
    },
    {
        " translates as Our Homeland . ": null
    },
    {
        "Michel Lentz": "michel lentz"
    },
    {
        " wrote the words in 42 and they were set to music by ": null
    },
    {
        "Jean Antoine Zinnen": "jean antoine zinnen"
    },
    {
        " in 42 The song was first performed in public in ": null
    },
    {
        "Ettelbruck": "ettelbruck"
    },
    {
        ", a town at the confluence of the ": null
    },
    {
        "Alzette": "alzette"
    },
    {
        " and ": null
    },
    {
        "Sauer": "sauer"
    },
    {
        " rivers on 42 June 42     The first and the last stanza of Ons Heemecht were adopted as Luxembourgs national anthem on 42 June 42 when it was added as one of the official national emblems, alongside the ": null
    },
    {
        "national flag": "flag of luxembourg"
    },
    {
        ", ": null
    },
    {
        "national coat of arms": "coat of arms of luxembourg"
    },
    {
        ", and the ": null
    },
    {
        "Grand Dukes Official Birthday": "grand dukes official birthday"
    },
    {
        ".     Ons Heemecht is the  anthem; the ": null
    },
    {
        "royal anthem": "royal anthem"
    },
    {
        ", or more accurately the grand ducal anthem, is ": null
    },
    {
        "De Wilhelmus": "de wilhelmus"
    },
    {
        " . The music of De Wilhelmus has its origin in ": null
    },
    {
        "Wilhelmus": "wilhelmus"
    },
    {
        " , the national anthem of the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ".   __TOC__         Luxembourgish      Wou d": null
    },
    {
        "Uelzecht": "alzette"
    },
    {
        " durech dWisen zéit,   Duerch dFielsen d": null
    },
    {
        "Sauer": "sauer"
    },
    {
        " brécht,   Wou dRief laanscht d": null
    },
    {
        "Musel": "moselle"
    },
    {
        " dofteg bléit,   Den Himmel Wäin ons mécht:   Dat as onst Land, fir dat mer géif   Hei nidden alles won,   Ons Heemechtsland dat mir so déif   An onsen Hierzer dron.     An sengem donkle Bëscherkranz,   Vum Fridde stëll bewaacht,   Sou ouni Pronk an deire Glanz   Gemittlech léif et laacht;   Säi Vollek frou sech soë kann,   An t si keng eidel Dreem:   Wéi wunnt et sech sou heemlech dran,   Wéi as t sou gutt doheem!     Gesank, Gesank vu Bierg an Dall   Der Äärd, déi äis gedron;   DLéift huet en treie Widderhall   A jidder Broschts gedon;   Fir, dHemecht ass keng Weis   ze schéin;   All Wuert, dat vun er klénkt,   Gräift äis an d Séil wéi Himmelstéin   An dA wéi Feier blénkt.     O Du do uewen, deen seng Hand   Duerch dWelt dNatioune leet,   Behitt Du dLëtzebuerger Land   Vru friemem Joch a Leed;   Du hues ons all als Kanner schon   De fräie Geescht jo ginn,   Looss viru blénken dFräiheetssonn,   Déi mir sou laang gesinn!   Official French     Où lAlzette arrose champs et prés   La Sûre baigne les rochers;   Où la Moselle, riante et belle   Nous fait cadeau du vin   Cest notre pays pour lequel   Nous risquons tout sur terre;   Notrchère et adorable patrie   Dont notrâme est remplie.     Dans sa couronne bois sombre   toujours gardée par la paix,   Donc, sans faste et la splendeur cher,   Confortable à lamour en riant.   Son peuple puisse dire est heureux   Et il nya pas de rêves vides:   Comment est agréable mais voici la vie,   dans quelle mesure est-il de la maison.     Chant, chant, de la montagne et la vallée   La terre, qui nous portait,   Les «amoureux a un écho fidèle»   effectué dans chaque sein.   Pour le pays quelque façon que ce   soit trop beau   Chaque mot qui sonne hors de lui,   Prendre lâme comme Himmelstön   Et nos yeux brillants comme le feu.     Ô Toi aux cieux qui nuit et jour   Diriges les nations du monde;   Écarte du pays de Luxembourg   Loppression étrangère   Enfants nous avons reçu de Toi   Lesprit de la liberté;   Permets au soleil de liberté   De luire à tout jamais.   Official German     Wo die Alzette durch die Wiesen zieht,   Durch die Felsen die Sauer bricht,   Die Rebe längs der Mosel blüht,   Der Himmel Wein verspricht:   Dort ist das Land, für dessen Ehr   Kein Opfer uns zu schwer,   Die Heimat, die als teures Gut   In unseren Herzen ruht.     In seinem dunklen Wälderkranz,   vom Frieden still bewacht,   So ohne Prunk und teuren Glanz,   Gemütlich lieb es lacht.   Sein Volk sich glücklich sagen kann,   Und es sind keine leeren Träume:   Wie heimelig sichs doch hier wohnt,   wie gut ists doch daheim.     Gesang, Gesang, von Berg und Tal   Die Erd, die uns getragen,   Die Lieb hat einen treuen Widerhall   In jeder Brust getan.   Für die Heimat ist keine Weise   zu schön,   Jedes Wort, das aus ihr klingt,   Ergreift die Seel wie Himmelstön   Und unser Auge wie Feuer blinkt.     O Du dort droben, dessen Hand   Den Völkern gibt Geleit,   Behüt das Luxemburger Land   Vor fremdem Joch, vor Leid!   Als Kind empfingen wir von Dir   Den freiheitlichen Sinn,   Die Freiheitssonne, unsre Zier,   Lass leuchten fernerhin!   Unofficial English translation     Where the Alzette flows through the meadows   The Sauer breaks its way through the rocks;   Where the vines amply grow along the Moselle,   the sky makes wine for us   That is our country for which we give   down here we would risk everything;   Our homeland so deeply   we carry in our hearts.     In its crown of dark wood   always guarded by peace,   Without pomp and costly shine   Cozy it cutely smiles.   Its people can claim happiness   There are no hollow dreams:   If you live in such a home,   How good it is to be at Home.     Sing, sing, through mountain and valley   The earth that bore us,   That love loyally echoes   Borne in each breast.   For our homeland, no melody is   too beautiful   Every word that is uttered   Shakes the soul like a thunderclap   And our eyes shine like fire.     O Thou above whose hand is   Leading the nations of the world;   Protect this land of Luxembourg   From foreign yoke and pain   You have given us already in our youth   The sense of liberty.   Let the sunlight of freedom shine   that we have seen for such a long time.   English poetic translation     Where the ": null
    },
    {
        "Alzette": "alzette"
    },
    {
        " slowly flows,   The ": null
    },
    {
        "Sauer": "sauer"
    },
    {
        " plays wild pranks,   Where fragrant vineyards amply grow   On the Mosellas banks;   There lies the land for which we would   Dare everything down here,   Our own, ": null
    },
    {
        "our native land": "luxembourg"
    },
    {
        " which ranks   Deeply in our hearts.          O Thou above whose powerful hand   Makes States or lays them low,   Protect this Luxembourger land   From ": null
    },
    {
        "foreign yoke and woe": "france"
    },
    {
        ".   Your spirit of liberty bestow   On us now as of yore.   Let Freedoms sun in glory glow   For now and evermore. ": null
    }
]