[
    {
        "        OO gauge or OO scale  ": null
    },
    {
        "model railway": "model railway"
    },
    {
        "s are the most popular standard-gauge model railway tracks in the United Kingdom. This track gauge is one of several ": null
    },
    {
        "42 mm-scale": "4 mm scale"
    },
    {
        " standards used, but it is the only one to be served by the major manufacturers. Despite this, the OO track gauge of  is inaccurate for 42  mm scale, and other gauges of the same scale have arisen to better serve the desires of some modellers for greater scale accuracy.       Double42 scale model railways were launched by ": null
    },
    {
        "Bing": "bing"
    },
    {
        " in 42 as The Table Railway, running on  track and scaled at 42  mm to the foot. In 42 the first models of British prototypes appeared. Initially all locomotives were powered by clockwork, but the first electric power appeared in autumn 42        OO describes models with a scale of 42  mm 42 foot running on HO scale 42:42 track . This combination came about as early clockwork mechanisms and electric motors were difficult to fit within ": null
    },
    {
        "HO scale": "ho scale"
    },
    {
        " models of British prototypes which are smaller than equivalent European and US locomotives. A quick and cheap solution was to enlarge the scale of the model to 42  mm to the foot but keep the 42  mm to the foot gauge track. This also allowed more space to model the external valve gear. The resulting HO track gauge of 42 mm represents 42 feet 42 inches at 42 mm to the foot scale; this is 42 inches under scale or approximately 42  mm too narrow.     In 42 the Bing company collapsed, but the Table Railway continued to be manufactured by the new ": null
    },
    {
        "Trix": "trix"
    },
    {
        " company. Trix decided to use the new HO standard, being approximately half of European 42 gauge .     In 42 the ": null
    },
    {
        "Meccano": "meccano ltd"
    },
    {
        " Company launched a new range of OO models under the trade name of ": null
    },
    {
        "Hornby Dublo": "hornby dublo"
    },
    {
        "; OO gauge has remained the UKs most popular scale/gauge ever since.     In the United States, ": null
    },
    {
        "Lionel Corporation": "lionel corporation"
    },
    {
        " introduced a range of OO models in 42 Soon other companies followed but it did not prove popular and remained on the market only until 42 OO gauge was quickly eclipsed by HO scale. The Lionel range of OO used 42  mm/¾ track gauge, a scale 42 , a track width that was more to scale. There is a small following of American OO scale/gauge today.       OO remains the most popular scale for railway modelling in the Great Britain due to a ready availability of ready-to-run stock and starter sets. Ready-to-run in the UK is dominated by ": null
    },
    {
        "Hornby Railways": "hornby railways"
    },
    {
        " and ": null
    },
    {
        "Bachmann Branchline": "bachmann branchline"
    },
    {
        ". Other sources of ready-to-run rolling stock or locomotives include ": null
    },
    {
        "Dapol": "dapol"
    },
    {
        ", ": null
    },
    {
        "Heljan": "heljan"
    },
    {
        ", ": null
    },
    {
        "Peco": "peco"
    },
    {
        ", ": null
    },
    {
        "ViTrains": "vitrains"
    },
    {
        " and previously ": null
    },
    {
        "Lima": "lima_"
    },
    {
        ". Other scales, with the possible exception of ": null
    },
    {
        "N gauge": "n gauge"
    },
    {
        ", lack the variety and affordability of UK ready-to-run products. The quality of OO models has improved over time.          gauge at 42  mm:42-foot means that the scale gauge represents ,  narrower than the prototype . This difference is particularly noticeable when looking along the track. As the market for proprietary track is mostly for HO scale, sleeper size and spacing are designed for HO and are therefore underscale.     OO is also used to represent the  Irish gauge, where it is a scale  too narrow.     Though they run on the same track, OO gauge and HO gauge models of the same prototype do not sit well together since the OO models are larger than the HO equivalent.     These differences have led to the development of the finescale standards of ": null
    },
    {
        "EM gauge": "em gauge"
    },
    {
        " and ": null
    },
    {
        "P42 standards": "protofour"
    },
    {
        ". Nevertheless, it is possible to model using OO to standards that fall just short of finescale.     In common with most practical model railways of any scale the following compromises are made: Curves are often sharper than the prototype, and often not transitioned, particularly when using set-track systems . Overhang from long vehicles means that track centres are overscale to prevent collisions on curves between stock on adjacent lines, at up to 42 mm . Overscale wheel width and deep wheel flanges are used on typical models , and these require overscale rail profile and much larger clearances on ": null
    },
    {
        "pointwork": "railroad switch"
    },
    {
        " than is prototypical. Pointwork is often compressed in length to save space.       Many experienced modellers find the OO standard produces a narrow gauge appearance when the model is viewed from head on. Greater accuracy is possible using either ": null
    },
    {
        "EM gauge": "em gauge"
    },
    {
        " or the closer to exact scale ": null
    },
    {
        "P42": "protofour"
    }
]