[
    {
        "Oostflakkee  is a former municipality on the island of ": null
    },
    {
        "Goeree-Overflakkee": "goeree-overflakkee"
    },
    {
        " in the western ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", in the province of ": null
    },
    {
        "South Holland": "south holland"
    },
    {
        ". The former municipality covered an area of about 42 km² , and had a population of about 42 in 42 On January 42 42 Oostflakkee merged with ": null
    },
    {
        "Goedereede": "goedereede"
    },
    {
        ", ": null
    },
    {
        "Dirksland": "dirksland"
    },
    {
        ", and ": null
    },
    {
        "Middelharnis": "middelharnis"
    },
    {
        " into the new municipality of Goeree-Overflakkee.     The former municipality of Oostflakkee was formed by the amalgamation of the former municipalities of ": null
    },
    {
        "Den Bommel": "den bommel"
    },
    {
        ", ": null
    },
    {
        "Ooltgensplaat": "ooltgensplaat"
    },
    {
        ", and ": null
    },
    {
        "Oude Tonge": "oude tonge"
    },
    {
        " in 42 It consisted of the communities of ": null
    },
    {
        "Achthuizen": "achthuizen"
    },
    {
        ", ": null
    },
    {
        "Langstraat": "langstraat"
    },
    {
        ", Den Bommel , Ooltgensplaat, Oude-Tonge, and ": null
    },
    {
        "Zuidzijde": "zuidzijde, oostflakkee"
    },
    {
        ".     Oude Tonge was the main town of this former municipality and has a considerable industrial area. It also has a large busstation. Den Bommel is quite similar as ": null
    },
    {
        "Stad aan t Haringvliet": "stad aan t haringvliet"
    },
    {
        " with a harbor and beach on the shores of the ": null
    },
    {
        "Haringvliet": "haringvliet"
    },
    {
        ". A few kilometers east of Den Bommel there is Zuidzijde, a very small town with a neat looking watertower. Ooltgensplaat is the most eastward town on the island with a harbor on the ": null
    },
    {
        "Volkerak": "volkerak"
    },
    {
        ". The town has a very old and beautiful municipal building. This town is the yearly start and finish of De Omloop - a 42+ km walk around the island in a 42-hour period. This event attracts thousands every year either participants or bystanders. It is held yearly in the latter half of August. Achthuizen and Langstraat are other small towns nearby Ooltgensplaat.                           ": null
    }
]