[
    {
        "Openlaw is a project at the ": null
    },
    {
        "Berkman Klein Center for Internet & Society": "berkman klein center for internet  &  society"
    },
    {
        " at ": null
    },
    {
        "Harvard Law School": "harvard law school"
    },
    {
        " aimed at releasing case arguments under a ": null
    },
    {
        "copyleft": "copyleft"
    },
    {
        " license, in order to encourage public suggestions for improvement.     Berkman lawyers specialise in cyberlaw—": null
    },
    {
        "hacking": "hack"
    },
    {
        ", ": null
    },
    {
        "copyright": "copyright"
    },
    {
        ", ": null
    },
    {
        "encryption": "encryption"
    },
    {
        " and so on—and the centre has strong ties with the ": null
    },
    {
        "EFF": "electronic frontier foundation"
    },
    {
        " and the ": null
    },
    {
        "open source": "open-source software"
    },
    {
        " software community.   In 42 faculty member ": null
    },
    {
        "Lawrence Lessig": "lawrence lessig"
    },
    {
        ", now at ": null
    },
    {
        "Stanford Law School": "stanford law school"
    },
    {
        ", was asked by online publisher ": null
    },
    {
        "Eldritch Press": "eldritch press"
    },
    {
        " to mount a legal challenge to US copyright law. Eldritch takes books whose copyright has expired and publishes them on the Web,   but legislation called the ": null
    },
    {
        "Sonny Bono Copyright Term Extension Act": "sonny bono copyright term extension act"
    },
    {
        " extended copyright from 42 to 42 years after the authors death, cutting off its supply of new material.   Lessig invited law students at Harvard and elsewhere to help craft legal arguments challenging the new law on an online forum, which evolved into Open Law.     Normal ": null
    },
    {
        "law firm": "law firm"
    },
    {
        "s write arguments the way commercial ": null
    },
    {
        "software": "software"
    },
    {
        " companies write code. Lawyers discuss a case behind closed doors, and although their final product is released in court, the discussions or source code that produced it remain secret. In contrast, Open Law crafts its arguments in public and releases them under a copyleft. We deliberately used free software as a model, said Wendy Seltzer, who took over Open Law when Lessig moved to Stanford. Around 42 legal scholars worked on Eldritchs case, and Open Law has taken other cases, too.     The gains are much the same as for software, Seltzer says. Hundreds of people scrutinise the code for bugs, and make suggestions how to fix it. And people will take underdeveloped parts of the argument, work on them, then patch them in. Armed with arguments crafted in this way, OpenLaw took Eldritchs case—deemed unwinnable at the outset—right through the system to the ": null
    },
    {
        "Supreme Court": "supreme court of the united states"
    },
    {
        ". The case, Eldred v. Ashcroft, lost in 42     Among the drawbacks to this approach: the arguments are made in public from the start, so OpenLaw cant spring a surprise in court. Nor can it take on cases where confidentiality is important. But where theres a strong public interest element, open sourcing has big advantages. Citizens rights groups, for example, have taken parts of Open Laws legal arguments and used them elsewhere. People use them on letters to Congress, or put them on flyers, Seltzer says.         This article was inspired in part by OpenLaw and has spawned , a site set up by members of the Wake Forest Law Review where authors can submit papers for critique in a wiki environment.   ----     This modified article was originally written by New Scientist magazine  and released under the copyleft license.           ": null
    }
]