[
    {
        "                    Operation Barbarossa  was the ": null
    },
    {
        "code name": "code name"
    },
    {
        " for the ": null
    },
    {
        "Axis": "axis powers"
    },
    {
        " invasion of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", which started on Sunday, 22 June 1941, during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". The operation put into action ": null
    },
    {
        "Nazi Germanys": "nazi germany"
    },
    {
        " ideological goal of conquering the western Soviet Union so as to repopulate it with ": null
    },
    {
        "Germans": "germans"
    },
    {
        ". The German ": null
    },
    {
        "Generalplan Ost": "generalplan ost"
    },
    {
        " aimed to use some of the conquered as ": null
    },
    {
        "slave labour": "unfree labour"
    },
    {
        " for the Axis war effort, to acquire the oil reserves of the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        " and the agricultural resources of Soviet territories, and eventually to ": null
    },
    {
        "annihilate": "war of annihilation"
    },
    {
        " the ": null
    },
    {
        "Slavic peoples": "slavs"
    },
    {
        " and create  for Germany.     In the two years leading up to the invasion, Germany and the Soviet Union ": null
    },
    {
        "signed political": "molotov–ribbentrop pact"
    },
    {
        " and ": null
    },
    {
        "economic pacts": "nazi–soviet economic relations"
    },
    {
        " for strategic purposes. Nevertheless, the ": null
    },
    {
        "German High Command": "oberkommando der wehrmacht"
    },
    {
        " began planning an invasion of the Soviet Union in July 1940 , which ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " authorized on 18 December 1940. Over the course of the operation, about three million personnel of the ": null
    },
    {
        "Axis powers": "axis powers"
    },
    {
        "—the largest invasion force in the ": null
    },
    {
        "history of warfare": "history of warfare"
    },
    {
        "—invaded the western Soviet Union along a  front, with 600,000 motor vehicles and over 600,000 horses for non-combat operations. The offensive marked an escalation of World War II, both geographically and in the formation of the ": null
    },
    {
        "Allied coalition": "allies of world war ii"
    },
    {
        " including the Soviet Union.     The operation opened up the ": null
    },
    {
        "Eastern Front": "eastern front"
    },
    {
        ", in which more forces were committed than in any other ": null
    },
    {
        "theater of war": "theater of war"
    },
    {
        " in history. The area saw of some of the wars largest battles, most horrific ": null
    },
    {
        "atrocities": "war crime"
    },
    {
        ", and highest ": null
    },
    {
        "casualties": "world war ii casualties"
    },
    {
        " , all of which influenced the course of World War II and the subsequent ": null
    },
    {
        "history of the 20th century": "history of the 20th century"
    },
    {
        ". The German armies eventually captured some 5,000,000 Soviet ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " troops, a majority of whom never returned alive. The Nazis deliberately ": null
    },
    {
        "starved to death, or otherwise killed": "german mistreatment of soviet prisoners of war"
    },
    {
        ", 3.3 million Soviet prisoners of war, and a vast number of civilians, as the ": null
    },
    {
        "Hunger Plan": "hunger plan"
    },
    {
        " worked to ": null
    },
    {
        "exterminate the Slavic population": "generalplan ost"
    },
    {
        ". ": null
    },
    {
        "Mass shootings": "einsatzgruppen"
    },
    {
        " and gassing operations, carried out by the Nazis or willing collaborators, murdered over a million ": null
    },
    {
        "Soviet Jews": "soviet jews"
    },
    {
        " as part of ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        ".     The failure of Operation Barbarossa reversed the fortunes of the ": null
    },
    {
        "Third Reich": "third reich"
    },
    {
        ". Operationally, German forces achieved significant victories and occupied some of the most important economic areas of the Soviet Union  and inflicted, as well as sustained, heavy casualties. Despite these early successes, the German offensive stalled in the ": null
    },
    {
        "Battle of Moscow": "battle of moscow"
    },
    {
        " at the end of 1941, and the subsequent ": null
    },
    {
        "Soviet winter counteroffensive": "battle of moscowsoviet counteroffensive"
    },
    {
        " pushed German troops back. The Germans had confidently expected a quick collapse of Soviet resistance as in ": null
    },
    {
        "Poland": "invasion of poland"
    },
    {
        ", but the Red Army absorbed the German ": null
    },
    {
        "Wehrmachts": "wehrmacht"
    },
    {
        "strongest blows and bogged it down in a ": null
    },
    {
        "war of attrition": "attrition warfare"
    },
    {
        " for which the Germans were unprepared. The Wehrmachts diminished forces could no longer attack along the entire Eastern Front, and the subsequent operations—such as ": null
    },
    {
        "Case Blue": "case blue"
    },
    {
        " in 1942 and ": null
    },
    {
        "Operation Citadel": "operation citadel"
    },
    {
        " in 1943—eventually failed, which resulted in the Wehrmachts retreat and collapse.                 As early as 1925, ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " vaguely declared in his political manifesto and autobiography  Mein Kampf  that he would invade the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", asserting that the German people needed to secure  Lebensraum  to ensure the survival of Germany for generations to come. On 10 February 1939, Hitler told his army commanders that the next war would be purely a war of  Weltanschauung en ... totally a peoples war, a ": null
    },
    {
        "racial war": "racial war"
    },
    {
        " . On 23 November, once World War II had already started, Hitler declared that racial war has broken out and this war shall determine who shall govern Europe, and with it, the world . The ": null
    },
    {
        "racial policy of Nazi Germany": "racial policy of nazi germany"
    },
    {
        " portrayed the Soviet Union as populated by non-Aryan  Untermenschen  , ruled by ": null
    },
    {
        "Jewish Bolshevik": "jewish bolshevism"
    },
    {
        " conspirators. Hitler claimed in Mein Kampf that Germanys destiny was to ": null
    },
    {
        "turn to the East": "drang nach osten"
    },
    {
        " as it did six hundred years ago . Accordingly, it was stated Nazi policy to kill, deport, or enslave the majority of Russian and other Slavic populations and repopulate the land with Germanic peoples, under the ": null
    },
    {
        "Generalplan Ost": "generalplan ost"
    },
    {
        ". The Nazis belief in their ethnic superiority pervades official records and ": null
    },
    {
        "pseudoscientific": "pseudoscientific"
    },
    {
        " articles in German periodicals, on topics such as how to deal with alien populations .      While older histories tended to emphasize the notion of a ": null
    },
    {
        "Clean Wehrmacht": "clean wehrmacht"
    },
    {
        " upholding its honor in the face of Hitlers fanaticism, the historian ": null
    },
    {
        "Jürgen Förster": "jürgen förster"
    },
    {
        " notes that In fact, the military commanders were caught up in the ideological character of the conflict, and involved in its implementation as willing participants.  Before and during the invasion of the Soviet Union, German troops were heavily indoctrinated with ": null
    },
    {
        "anti-Bolshevik": "anti-bolshevik"
    },
    {
        ", ": null
    },
    {
        "anti-Semitic": "anti-semitic"
    },
    {
        ", and ": null
    },
    {
        "anti-Slavic": "anti-slavic"
    },
    {
        " ideology via movies, radio, lectures, books, and leaflets. Likening the Soviets to the forces of ": null
    },
    {
        "Genghis Khan": "genghis khan"
    },
    {
        ", Hitler told ": null
    },
    {
        "Croatia": "croatia"
    },
    {
        "n military leader ": null
    },
    {
        "Slavko Kvaternik": "slavko kvaternik"
    },
    {
        " that the Mongolian race threatened Europe. Following the invasion, Wehrmacht officers told their soldiers to target people who were described as Jewish Bolshevik subhumans , the Mongol hordes , the Asiatic flood , and the Red beast . Nazi propaganda portrayed the war against the Soviet Union as both an ideological war between German National Socialism and Jewish Bolshevism, and a racial war between the disciplined Germans and the Jewish, Gypsy, and Slavic Untermenschen. An order from the Führer stated that the  Einsatzgruppen  were to execute all Soviet functionaries who were less valuable Asiatics, Gypsies and Jews . Six months into the invasion of the Soviet Union, the Einsatzgruppen had already murdered in excess of 500,000 Soviet Jews, a figure greater than the number of Red Army soldiers killed in combat during that time. German army commanders cast the Jews as the major cause behind the ": null
    },
    {
        "partisan": "partisan"
    },
    {
        " struggle . The main guideline for German troops was Where theres a partisan, theres a Jew, and where theres a Jew, theres a partisan , or The partisan is where the Jew is . Many German troops viewed the war in Nazi terms and regarded their Soviet enemies as sub-human.     After the war began, the Nazis issued a ban on sexual relations between Germans and foreign slave workers. There were regulations enacted against the  Ost-Arbeiter  that included the death penalty for sexual relations with a German. ": null
    },
    {
        "Heinrich Himmler": "heinrich himmler"
    },
    {
        ", in his secret memorandum, Reflections on the Treatment of Peoples of Alien Races in the East , outlined the Nazi plans for the non-German populations in the East. Himmler believed the ": null
    },
    {
        "Germanization": "germanization"
    },
    {
        " process in Eastern Europe would be complete when in the East dwell only men with truly German, Germanic blood .        The Nazi secret plan  Generalplan Ost  , prepared in 1941 and confirmed in 1942, called for a new order of ethnographical relations in the territories occupied by Nazi Germany in Eastern Europe. It envisaged ": null
    },
    {
        "ethnic cleansing": "ethnic cleansing"
    },
    {
        ", executions, and enslavement of the populations of conquered countries, with very small percentages undergoing Germanization, expulsion into the depths of Russia, or other fates, while the conquered territories would be Germanized. The plan was had two parts: the Kleine Planung , which covered actions to be taken during the war, and the Große Planung , which covered policies after the war was won, to be implemented gradually over 25 to 30 years.     A speech given by General ": null
    },
    {
        "Erich Hoepner": "erich hoepner"
    },
    {
        " demonstrates the dissemination of the Nazi racial plan, as he informed the ": null
    },
    {
        "4th Panzer Group": "4th panzer group"
    },
    {
        " that the war against the Soviet Union was an essential part of the German peoples struggle for existence , also referring to the imminent battle as the old struggle of Germans against Slavs and even stated, the struggle must aim at the annihilation of todays Russia and must therefore be waged with unparalleled harshness . Hoepner also added that the Germans were fighting for the defense of European culture against Moscovite–Asiatic inundation, and the repulse of Jewish Bolshevism ... No adherents of the present Russian-Bolshevik system are to be spared. ": null
    },
    {
        "Walther von Brauchitsch": "walther von brauchitsch"
    },
    {
        " also told his subordinates that troops should view the war as a struggle between two different races and act with the necessary severity . Racial motivations were central to Nazi ideology and played a key role in planning for Operation Barbarossa since both ": null
    },
    {
        "Jews and communists": "jewish bolshevism"
    },
    {
        " were considered equivalent enemies of the Nazi state. Nazi imperialist ambitions rejected the common humanity of both groups, declaring the supreme struggle for Lebensraum to be a  Vernichtungskrieg  .               In August 1939, Germany and the Soviet Union signed a non-aggression pact in Moscow known as the ": null
    },
    {
        "Molotov–Ribbentrop Pact": "molotov–ribbentrop pact"
    },
    {
        ". A secret protocol to the pact outlined an agreement between Germany and the Soviet Union on the division of the eastern European ": null
    },
    {
        "border states": "border states"
    },
    {
        " between their respective ": null
    },
    {
        "spheres of influence": "spheres of influence"
    },
    {
        " : the Soviet Union and Germany would partition Poland in the event of an invasion by Germany, and the Soviets would be allowed to overrun the Baltic states and ": null
    },
    {
        "Finland": "finland"
    },
    {
        ". On 23 August 1939 the rest of the world learned of this pact but were unaware of the provisions to partition Poland. The pact stunned the world because of the parties earlier mutual hostility and their conflicting ": null
    },
    {
        "ideologies": "ideology"
    },
    {
        ". The conclusion of this pact was followed by the ": null
    },
    {
        "German invasion of Poland": "german invasion of poland"
    },
    {
        " on 1 September that triggered the outbreak of ": null
    },
    {
        "World War II in Europe": "world war ii in europe"
    },
    {
        ", then the ": null
    },
    {
        "Soviet invasion of Poland": "soviet invasion of poland"
    },
    {
        " that led to the annexation of the eastern part of the country. As a result of the pact, Germany and the Soviet Union maintained reasonably strong diplomatic relations for two years and fostered ": null
    },
    {
        "an important economic relationship": "nazi–soviet economic relations"
    },
    {
        ". The countries entered a ": null
    },
    {
        "trade pact in 1940": "german-soviet commercial agreement"
    },
    {
        " by which the Soviets received German military equipment and trade goods in exchange for raw materials, such as oil and wheat, to help the Nazis circumvent a British ": null
    },
    {
        "blockade of Germany": "blockade of germany"
    },
    {
        ".     Despite the parties ostensibly cordial relations, each side was highly suspicious of the others intentions. For instance, the Soviet invasion of ": null
    },
    {
        "Bukovina": "bukovina"
    },
    {
        " in June 1940 went beyond their sphere of influence as agreed with Germany. After Germany entered the ": null
    },
    {
        "Axis Pact": "tripartite pact"
    },
    {
        " with Japan and Italy, it began ": null
    },
    {
        "negotiations about a potential Soviet entry into the pact": "german–soviet axis talks"
    },
    {
        ". After two days of negotiations in Berlin from 12 to 14 November 1940, Germany presented a written proposal for a Soviet entry into the Axis. On 25 November 1940, the Soviet Union offered a written counter-proposal to join the Axis if Germany would agree to refrain from interference in the Soviet Unions sphere of influence, but Germany did not respond. As both sides began colliding with each other in Eastern Europe, conflict appeared more likely, although they did sign a ": null
    },
    {
        "border and commercial agreement": "german–soviet border and commercial agreement"
    },
    {
        " addressing several open issues in January 1941. According to historian ": null
    },
    {
        "Robert Service": "robert service"
    },
    {
        ", ": null
    },
    {
        "Joseph Stalin": "joseph stalin"
    },
    {
        " was convinced that the overall military strength of the USSR was such that he had nothing to fear and anticipated an easy victory should Germany attack; moreover, Stalin believed that since the Germans were still fighting the British in the west, Hitler would be unlikely to open up a two front war and subsequently delayed the reconstruction of defensive fortifications in the border regions. When German soldiers swam across the ": null
    },
    {
        "Bug River": "bug river"
    },
    {
        " to warn the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " of an impending attack, they were treated like enemy agents and shot. Some historians believe that Stalin, despite providing an amicable front to Hitler, did not wish to remain allies with Germany. Rather, Stalin might have had intentions to break off from Germany and proceed with his own campaign against Germany to be followed by one against the rest of Europe.               Stalins reputation as a brutal dictator contributed both to the Nazis justification of their assault and their faith in success; many competent and experienced military officers had been killed in the ": null
    },
    {
        "Great Purge": "great purge"
    },
    {
        " of the 1930s, leaving the Red Army with a relatively inexperienced leadership compared to that of their German adversary. The Nazis often emphasized the Soviet regimes brutality when targeting the Slavs with propaganda. They also claimed that the Red Army was ": null
    },
    {
        "preparing to attack the Germans": "soviet offensive plans controversy"
    },
    {
        ", and their own invasion was thus presented as a ": null
    },
    {
        "pre-emptive": "pre-emptive war"
    },
    {
        " strike.     In the middle of 1940, following the rising tension between the Soviet Union and Germany over territories in the Balkans, an eventual invasion of the Soviet Union seemed the only solution to Hitler. While no concrete plans had yet been made, Hitler told one of his generals in June that the victories in Western Europe finally freed his hands for a showdown with Bolshevism. With the successful end to the ": null
    },
    {
        "campaign in France": "battle of france"
    },
    {
        ", General ": null
    },
    {
        "Erich Marcks": "erich marcks"
    },
    {
        " was assigned the task of drawing up the initial invasion plans of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". The first battle plans were entitled Operation Draft East . His report advocated the ": null
    },
    {
        "A-A line": "a-a line"
    },
    {
        " as the operational objective of any invasion of the Soviet Union. This assault would extend from the northern city of ": null
    },
    {
        "Arkhangelsk": "arkhangelsk"
    },
    {
        " on the ": null
    },
    {
        "Arctic Sea": "arctic sea"
    },
    {
        " through ": null
    },
    {
        "Gorky": "nizhny novgorod"
    },
    {
        " and ": null
    },
    {
        "Rostov": "rostov-on-don"
    },
    {
        " to the port city of ": null
    },
    {
        "Astrakhan": "astrakhan"
    },
    {
        " at the mouth of the ": null
    },
    {
        "Volga": "volga"
    },
    {
        " on the ": null
    },
    {
        "Caspian Sea": "caspian sea"
    },
    {
        ". The report concluded that—once established—this military border would reduce the threat to Germany from attacks by enemy ": null
    },
    {
        "bombers": "bombers"
    },
    {
        ".     Although Hitler was warned by his general staff that occupying ": null
    },
    {
        "Western Russia": "western russia"
    },
    {
        " would create more of a drain than a relief for Germanys economic situation , he anticipated compensatory benefits, such as the ": null
    },
    {
        "demobilization": "demobilization"
    },
    {
        " of entire divisions to relieve the acute ": null
    },
    {
        "labor shortage": "labor shortage"
    },
    {
        " in German industry; the exploitation of ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        " as a reliable and immense source of agricultural products; the use of ": null
    },
    {
        "forced labor": "forced labor"
    },
    {
        " to stimulate Germanys overall economy; and the expansion of territory to improve Germanys efforts to isolate the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ". Hitler was convinced that Britain would sue for peace once the Germans triumphed in the Soviet Union, and if they did not, he would use the resources available in the East to defeat the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        ".        On 5 December 1940, Hitler received the final military plans for the invasion on which the ": null
    },
    {
        "German High Command": "oberkommando der wehrmacht"
    },
    {
        " had been working since July 1940 under the codename Operation Otto . Hitler, however, was dissatisfied with these plans and on 18 December issued ": null
    },
    {
        "Führer Directive 21": "s:führer directive 21"
    },
    {
        ", which called for a new battle plan, now code-named Operation Barbarossa . The operation was named after medieval Emperor ": null
    },
    {
        "Frederick Barbarossa": "frederick barbarossa"
    },
    {
        " of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", a leader of the ": null
    },
    {
        "Third Crusade": "third crusade"
    },
    {
        " in the 12th century.   On 30 March 1941 the ": null
    },
    {
        "Barbarossa decree": "barbarossa decree"
    },
    {
        " declared that the war would be one of extermination and advocated the eradication of all political and intellectual elites.   The invasion was set for 15 May 1941, though it was delayed for over a month to allow for further preparations and possibly better weather.      According to a 1978 essay by German historian ": null
    },
    {
        "Andreas Hillgruber": "andreas hillgruber"
    },
    {
        ", the invasion plans drawn up by the German military elite were coloured by hubris stemming from the rapid defeat of France at the hands of the invincible Wehrmacht and by traditional German stereotypes of Russia as a primitive, backward Asiatic country. Red Army soldiers were considered brave and tough, but the officer corps was held in contempt. The leadership of the Wehrmacht paid little attention to politics, culture, and the considerable industrial capacity of the Soviet Union, in favour of a very narrow military view. Hillgruber argued that because these assumptions were shared by the entire military elite, Hitler was able to push through with a war of annihilation that would be waged in the most inhumane fashion possible with the complicity of several military leaders , even though it was quite clear that this would be in violation of all accepted norms of warfare.     In autumn 1940, high-ranking German officials drafted a memorandum on the dangers of an invasion of the Soviet Union. They said Ukraine, Belorussia, and the Baltic States would end up as only a further economic burden for Germany. It was argued that the Soviets in their current bureaucratic form were harmless and that the occupation would not benefit Germany. Hitler disagreed with economists about the risks and told his right-hand man ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        ", the chief of the Luftwaffe, that he would no longer listen to misgivings about the economic dangers of a war with Russia. It is speculated that this was passed on to General ": null
    },
    {
        "Georg Thomas": "georg thomas"
    },
    {
        ", who had produced reports that predicted a net economic drain for Germany in the event of an invasion of the Soviet Union unless its economy was captured intact and the Caucasus oilfields seized in the first blow; Thomas revised his future report to fit Hitlers wishes. The ": null
    },
    {
        "Red Armys": "red army"
    },
    {
        "ineptitude in the ": null
    },
    {
        "Winter War": "winter war"
    },
    {
        " against Finland in 1939–40 convinced Hitler of a quick victory within a few months. Neither Hitler nor the General Staff anticipated a long campaign lasting into the winter, and therefore adequate preparations, such as the distribution of warm clothing and ": null
    },
    {
        "winterization": "winterization"
    },
    {
        " of vehicles and lubricants, were not made.     Beginning in March 1941, ": null
    },
    {
        "Görings Green Folder": "görings green folder"
    },
    {
        " laid out details for the Soviet economy after conquest. The ": null
    },
    {
        "Hunger Plan": "hunger plan"
    },
    {
        " outlined how the entire urban population of conquered territories was to be starved to death, thus creating an agricultural surplus to feed Germany and urban space for the German upper class. Nazi policy aimed to destroy the Soviet Union as a political entity in accordance with the ": null
    },
    {
        "geopolitical": "geopolitics"
    },
    {
        " Lebensraum ideals for the benefit of future generations of the ": null
    },
    {
        "Nordic": "nordicism"
    },
    {
        " master race": "master race"
    },
    {
        " . In 1941, Nazi ideologue ": null
    },
    {
        "Alfred Rosenberg": "alfred rosenberg"
    },
    {
        "—later appointed Reich Minister of the Occupied Eastern Territories—suggested that conquered Soviet territory should be administered in the following  Reichskommissar iate :          German military planners also researched ": null
    },
    {
        "Napoleons failed invasion of Russia": "french invasion of russia"
    },
    {
        ". In their calculations, they concluded that there was little danger of a large-scale retreat of the Red Army into the Russian interior, as it could not afford to give up the Baltic states, Ukraine, or the Moscow and Leningrad regions, all of which were vital to the Red Army for supply reasons and would thus, have to be defended. Hitler and his generals disagreed on where Germany should focus its energy. Hitler, in many discussions with his generals, repeated his order of Leningrad first, the ": null
    },
    {
        "Donbass": "donbass"
    },
    {
        " second, Moscow third ; but he consistently emphasized the destruction of the Red Army over the achievement of specific terrain objectives. Hitler believed Moscow to be of no great importance in the defeat of the Soviet Union and instead believed victory would come with the destruction of the Red Army west of the capital, especially west of the ": null
    },
    {
        "Western Dvina": "daugava"
    },
    {
        " and ": null
    },
    {
        "Dnieper": "dnieper river"
    },
    {
        " rivers, and this pervaded the plan for Barbarossa. This belief later led to disputes between Hitler and several German senior officers, including ": null
    },
    {
        "Heinz Guderian": "heinz guderian"
    },
    {
        ", ": null
    },
    {
        "Gerhard Engel": "gerhard engel"
    },
    {
        ", ": null
    },
    {
        "Fedor von Bock": "fedor von bock"
    },
    {
        " and ": null
    },
    {
        "Franz Halder": "franz halder"
    },
    {
        ", who believed the decisive victory could only be delivered at Moscow. They were unable to sway Hitler, who had grown overconfident in his own military judgment as a result of the rapid successes in Western Europe.       ": null
    },
    {
        "Albert Speer": "albert speer"
    },
    {
        " said that oil had been a major factor in the decision to invade the Soviet Union. Hitler believed that ": null
    },
    {
        "Bakus": "baku"
    },
    {
        "oil resources were essential for the survival of the Third Reich, as a dearth of oil resources was a vulnerability for Germanys military.            The Germans had begun massing troops near the Soviet border even before the ": null
    },
    {
        "campaign in the Balkans": "balkans campaign"
    },
    {
        " had finished. By the third week of February 1941, 680,000 German soldiers were gathered in assembly areas on the Romanian-Soviet border. In preparation for the attack, Hitler had secretly moved upwards of 3 million German troops and approximately 690,000 Axis soldiers to the Soviet border regions. Additional Luftwaffe operations included numerous ": null
    },
    {
        "aerial surveillance": "reconnaissance"
    },
    {
        " missions over Soviet territory many months before the attack.     Although the Soviet High Command was alarmed by this, Stalins belief that the Third Reich was unlikely to attack only two years after signing the ": null
    },
    {
        "Molotov–Ribbentrop Pact": "molotov–ribbentrop pact"
    },
    {
        " resulted in a slow Soviet preparation. This fact aside, the Soviets did not entirely overlook the threat of their German neighbor. Well before the German invasion, Marshal ": null
    },
    {
        "Semyon Timoshenko": "semyon timoshenko"
    },
    {
        " referred to the Germans as the Soviet Unions most important and strongest enemy , and as early as July 1940, the Red Army Chief of Staff, ": null
    },
    {
        "Boris Shaposhnikov": "boris shaposhnikov"
    },
    {
        ", produced a preliminary three-pronged plan of attack for what a German invasion might look like, remarkably similar to the actual attack. Since April 1941, the Germans had begun setting up ": null
    },
    {
        "Operation Haifisch": "operation haifisch"
    },
    {
        " and ": null
    },
    {
        "Operation Harpune": "operation harpune"
    },
    {
        " to substantiate their claims that Britain was the real target. These simulated preparations in ": null
    },
    {
        "Norway": "norway"
    },
    {
        " and the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        " coast included activities such as ship concentrations, reconnaissance flights and training exercises.     The reasons for the postponement of Barbarossa from the initially planned date of 15 May to the actual invasion date of 22 June 1941 are debated. The reason most commonly cited is the unforeseen contingency of ": null
    },
    {
        "invading Yugoslavia": "invasion of yugoslavia"
    },
    {
        " in April 1941. Historian Thomas B. Buell indicates that Finland and Romania, which werent involved in initial German planning, needed additional time to prepare to participate in the invasion. Buell adds that an unusually wet winter kept rivers at full flood until late spring. The floods may have discouraged an earlier attack, even if they occurred before the end of the Balkans Campaign.          The importance of the delay is still debated. In 1990, ": null
    },
    {
        "William Shirer": "william shirer"
    },
    {
        " argued that Hitlers Balkan Campaign had delayed the commencement of Barbarossa by several weeks and thereby jeopardized it. Many later historians argue that the 22 June start date was sufficient for the German offensive to reach Moscow by September. ": null
    },
    {
        "Antony Beevor": "antony beevor"
    },
    {
        " wrote in 2012 about the delay caused by German attacks in the Balkans that most accept that it made little difference to the eventual outcome of Barbarossa.     The Germans deployed one independent regiment, one separate motorized training brigade and 153 divisions for Barbarossa, which included 104 infantry, 19 ": null
    },
    {
        "panzer": "panzer"
    },
    {
        " and 15 ": null
    },
    {
        "motorized infantry": "motorized infantry"
    },
    {
        " divisions in three army groups, nine ": null
    },
    {
        "security divisions": "security division"
    },
    {
        " to operate in conquered territories, four divisions in Finland and two divisions as reserve under the direct control of ": null
    },
    {
        "OKH": "okh"
    },
    {
        ". These were equipped with 6,867 armored vehicles, of which 3,350–3,795 were tanks, 2,770–4,389 aircraft , 7,200–23,435 artillery pieces, 17,081 mortars, about 600,000 motor vehicles and 625,000–700,000 horses. Finland slated 14 divisions for the invasion, and Romania offered 13 divisions and eight brigades over the course of Barbarossa. The entire Axis forces, 3.8 million personnel, deployed across a front extending from the ": null
    },
    {
        "Arctic Ocean": "arctic ocean"
    },
    {
        " southward to the ": null
    },
    {
        "Black Sea": "black sea"
    },
    {
        ", were all controlled by the OKH and organized into ": null
    },
    {
        "Army Norway": "army norway"
    },
    {
        ", ": null
    },
    {
        "Army Group North": "army group north"
    },
    {
        ", ": null
    },
    {
        "Army Group Center": "army group center"
    },
    {
        " and ": null
    },
    {
        "Army Group South": "army group south"
    },
    {
        ", alongside three ": null
    },
    {
        "Luftflotten": "luftflotte"
    },
    {
        " that supported the army groups: ": null
    },
    {
        "Luftflotte 1": "luftflotte 1"
    },
    {
        " for North, ": null
    },
    {
        "Luftflotte 2": "luftflotte 2"
    },
    {
        " for Center and ": null
    },
    {
        "Luftflotte 4": "luftflotte 4"
    },
    {
        " for South.     Army Norway was to operate in far northern ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        " and ": null
    },
    {
        "bordering Soviet territories": "northwest russia"
    },
    {
        ". Army Group North was to march through the ": null
    },
    {
        "Baltic states": "baltic states"
    },
    {
        " into northern Russia, either take or destroy the city of ": null
    },
    {
        "Leningrad": "leningrad"
    },
    {
        " and link up with Finnish forces. Army Group Center, the army group equipped with the most armour and air power, was to strike from Poland into ": null
    },
    {
        "Belorussia": "belorussia"
    },
    {
        " and the west-central regions of Russia proper, and advance to ": null
    },
    {
        "Smolensk": "smolensk"
    },
    {
        " and then Moscow. Army Group South was to strike the heavily populated and agricultural heartland of ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        ", taking ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        " before continuing eastward over the ": null
    },
    {
        "steppes": "steppe"
    },
    {
        "of southern USSR to the ": null
    },
    {
        "Volga": "volga"
    },
    {
        " with the aim of controlling the oil-rich ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        ". Army Group South was deployed in two sections separated by a  gap. The northern section, which contained the army groups only panzer group, was in southern Poland right next to Army Group Center, and the southern section was in Romania.     The German forces in the rear  were to operate in conquered territories to counter any ": null
    },
    {
        "partisan": "soviet partisans"
    },
    {
        " activity in areas they controlled, as well as to ": null
    },
    {
        "execute captured Soviet political commissars": "commissar order"
    },
    {
        " and Jews. On 17 June, ": null
    },
    {
        "Reich Main Security Office": "reich main security office"
    },
    {
        " chief ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        " briefed around thirty to fifty Einsatzgruppen commanders on the policy of eliminating Jews in Soviet territories, at least in general terms . While the Einsatzgruppen were assigned to the Wehrmachts units, which provided them with supplies such as gasoline and food, they were controlled by the RSHA. The official plan for Barbarossa assumed that the army groups would be able to advance freely to their primary objectives simultaneously, without spreading thin, once they had won the border battles and destroyed the Red Armys forces in the border area.          In 1930, ": null
    },
    {
        "Mikhail Tukhachevsky": "mikhail tukhachevsky"
    },
    {
        ", a prominent military theorist in ": null
    },
    {
        "tank warfare": "armoured warfare"
    },
    {
        " in the ": null
    },
    {
        "interwar period": "interwar period"
    },
    {
        " and later ": null
    },
    {
        "Marshal of the Soviet Union": "marshal of the soviet union"
    },
    {
        ", forwarded a memo to the Kremlin that lobbied for colossal investment in the resources required for the mass production of weapons, pressing the case for 40,000 aircraft and 50,000 tanks . In the early 1930s, a modern operational ": null
    },
    {
        "doctrine": "military doctrine"
    },
    {
        " for the Red Army was developed and promulgated in the 1936 Field Regulations in the form of the ": null
    },
    {
        "Deep Battle Concept": "soviet deep battle"
    },
    {
        ". Defense expenditure also grew rapidly from just 12 percent of the ": null
    },
    {
        "gross national product": "gross national product"
    },
    {
        " in 1933 to 18 percent by 1940.     During Stalins ": null
    },
    {
        "Great Purge": "great purge"
    },
    {
        " in the late-1930s, which had not ended by the time of the German invasion on 22 June 1941, much of the officer corps of the Red Army was executed or imprisoned and their replacements, appointed by Stalin for political reasons, often lacked military competence. Of the five ": null
    },
    {
        "Marshals of the Soviet Union": "marshal of the soviet union"
    },
    {
        " appointed in 1935, only ": null
    },
    {
        "Kliment Voroshilov": "kliment voroshilov"
    },
    {
        " and ": null
    },
    {
        "Semyon Budyonny": "semyon budyonny"
    },
    {
        " survived Stalins purge. Tukhachevsky was killed in 1937. Fifteen of 16 army commanders, 50 of the 57 corps commanders, 154 of the 186 divisional commanders, and 401 of 456 colonels were killed, and many other officers were dismissed. In total, about 30,000 Red Army personnel were executed. Stalin further underscored his control by reasserting the role of ": null
    },
    {
        "political commissars": "political commissar"
    },
    {
        "at the divisional level and below to oversee the political loyalty of the army to the regime. The commissars held a position equal to that of the commander of the unit they were overseeing. But in spite of efforts to ensure the political subservience of the armed forces, in the wake of Red Armys poor performance ": null
    },
    {
        "in Poland": "soviet invasion of poland"
    },
    {
        " and in the ": null
    },
    {
        "Winter War": "winter war"
    },
    {
        ", about 80 percent of the officers dismissed during the Great Purge were reinstated by 1941. Also, between January 1939 and May 1941, 161 new divisions were activated. Therefore, although about 75 percent of all the officers had been in their position for less than one year at the start of the German invasion of 1941, many of the short tenures can be attributed not only to the purge, but also to the rapid increase in creation of military units.        In the Soviet Union, speaking to his generals in December 1940, Stalin mentioned Hitlers references to an attack on the Soviet Union in Mein Kampf and Hitlers belief that the Red Army would need four years to ready itself. Stalin declared we must be ready much earlier and we will try to delay the war for another two years . As early as August 1940, British intelligence had received hints of German plans to attack the Soviets only a week after Hitler informally approved the plans for Barbarossa and warned the Soviet Union accordingly. But Stalins distrust of the British led him to ignore their warnings in the belief that they were a trick designed to bring the Soviet Union into the war on their side. In early 1941, Stalins own ": null
    },
    {
        "intelligence services": "intelligence service"
    },
    {
        "and American intelligence gave regular and repeated warnings of an impending German attack. Soviet spy ": null
    },
    {
        "Richard Sorge": "richard sorge"
    },
    {
        " also gave Stalin the exact German launch date, but Sorge and other informers had previously given different invasion dates that passed peacefully before the actual invasion. Stalin acknowledged the possibility of an attack in general and therefore made significant preparations, but decided not to run the risk of provoking Hitler.     Beginning in July 1940, the Red Army General Staff developed war plans that identified the Wehrmacht as the most dangerous threat to the Soviet Union, and that in the case of a war with Germany, the Wehrmachts main attack would come through the region north of the ": null
    },
    {
        "Pripyat Marshes": "pripyat marshes"
    },
    {
        " into Belorussia, which later proved to be correct. Stalin disagreed, and in October he authorized the development of new plans that assumed a German attack would focus on the region south of Pripyat Marshes towards the economically vital regions in Ukraine. This became the basis for all subsequent Soviet war plans and the deployment of their armed forces in preparation for the German invasion.          In early-1941 Stalin authorized the State Defense Plan 1941 , which along with the Mobilization Plan 1941 , called for the deployment of 186 divisions, as the first strategic echelon, in the four ": null
    },
    {
        "military districts": "military districts of the soviet union"
    },
    {
        " of the western Soviet Union that faced the Axis territories; and the deployment of another 51 divisions along the Dvina and Dnieper Rivers as the second strategic echelon under ": null
    },
    {
        "Stavka": "stavka"
    },
    {
        " control, which in the case of a German invasion was tasked to spearhead a Soviet counteroffensive along with the remaining forces of the first echelon. But on 22 June 1941 the first echelon only contained 171 divisions, numbering 2.6–2.9 million; and the second strategic echelon contained 57 divisions that were still mobilizing, most of which were still understrength. The second echelon was undetected by German intelligence until days after the invasion commenced, in most cases only when German ground forces bumped into them.     At the start of the invasion, the manpower of the Soviet military force that had been mobilized was 5.3–5.5 million, and it was still increasing as the Soviet ": null
    },
    {
        "reserve force": "military reserve force"
    },
    {
        " of 14 million, with at least basic military training, continued to mobilize. The Red Army was dispersed and still preparing when the invasion commenced. Their units were often separated and lacked adequate transportation. While transportation remained insufficient for Red Army forces, when Operation Barbarossa kicked off, they possessed some 33,000 pieces of artillery, a number far greater than the Germans had at their disposal.     The Soviet Union had some 23,000 tanks available of which only 14,700 were combat-ready. Around 11,000 tanks were in the western military districts that faced the German invasion force. Hitler later declared to some of his generals, If I had known about the Russian tank strength in 1941 I would not have attacked . However, maintenance and readiness standards were very poor; ammunition and radios were in short supply, and many armoured units lacked the trucks for supplies. The most advanced Soviet tank models – the ": null
    },
    {
        "KV-1": "kv-1"
    },
    {
        " and ": null
    },
    {
        "T-34": "t-34"
    },
    {
        " – which were superior to all current German tanks, as well as all designs still in development as of the summer 1941, were not available in large numbers at the time the invasion commenced. Furthermore, in the autumn of 1939, the Soviets disbanded their ": null
    },
    {
        "mechanized corps": "mechanised corps"
    },
    {
        " and partly dispersed their tanks to infantry divisions; but following their observation of the German campaign in France, in late-1940 they began to reorganize most of their armored assets back into mechanized corps with a target strength of 1,031 tanks each. But these large armoured formations were unwieldy, and moreover they were spread out in scattered garrisons, with their subordinate divisions up to  apart. The reorganization was still in progress and incomplete when Barbarossa commenced. Soviet tank units were rarely well equipped, and they lacked training and logistical support. Units were sent into combat with no arrangements in place for refueling, ammunition resupply, or personnel replacement. Often, after a single engagement, units were destroyed or rendered ineffective. The Soviet numerical advantage in heavy equipment was thoroughly offset by the superior training and organization of the Wehrmacht.     The Soviet Air Force  held the numerical advantage with a total of approximately 19,533 aircraft, which made it the largest air force in the world in the summer of 1941. About 7,133–9,100 of these were deployed in the five western military districts, and an additional 1445 were under naval control.          Historians ": null
    },
    {
        "have debated": "soviet offensive plans controversy"
    },
    {
        " whether Stalin was planning an invasion of German territory in the summer of 1941. The debate began in the late-1980s when ": null
    },
    {
        "Viktor Suvorov": "viktor suvorov"
    },
    {
        " published a journal article and later the book  Icebreaker  in which he claimed that Stalin had seen the outbreak of war in Western Europe as an opportunity to spread communist revolutions throughout the continent, and that the Soviet military was being deployed for an imminent attack at the time of the German invasion. This view had also been advanced by former German generals following the war. Suvorovs thesis was fully or partially accepted by a limited number of historians, including ": null
    },
    {
        "Valeri Danilov": "valeri danilov"
    },
    {
        ", ": null
    },
    {
        "Joachim Hoffmann": "joachim hoffmann"
    },
    {
        ", ": null
    },
    {
        "Mikhail Meltyukhov": "mikhail meltyukhov"
    },
    {
        ", and ": null
    },
    {
        "Vladimir Nevezhin": "vladimir nevezhin"
    },
    {
        ", and attracted public attention in Germany, Israel, and Russia. It has been strongly rejected by most historians, and Icebreaker is generally considered to be an anti-Soviet tract in Western countries. ": null
    },
    {
        "David Glantz": "david glantz"
    },
    {
        " and ": null
    },
    {
        "Gabriel Gorodetsky": "gabriel gorodetsky"
    },
    {
        " wrote books to rebut Suvorovs arguments. The majority of historians believe that Stalin was seeking to avoid war in 1941, as he believed that his military was not ready to fight the German forces.            ": null
    }
]