[
    {
        "   In some versions of ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", Ophion , also called Ophioneus  ruled the world with Eurynome before the two of them were cast down by ": null
    },
    {
        "Cronus": "cronus"
    },
    {
        " and ": null
    },
    {
        "Rhea": "rhea"
    },
    {
        ".       ": null
    },
    {
        "Pherecydes of Syros": "pherecydes of syros"
    },
    {
        "s Heptamychia is the first attested mention of Ophion.     The story was apparently popular in ": null
    },
    {
        "Orphic": "orpheus"
    },
    {
        " poetry, of which only fragments survive.     ": null
    },
    {
        "Apollonius of Rhodes": "apollonius of rhodes"
    },
    {
        " in his  Argonautica  summarizes a song of ": null
    },
    {
        "Orpheus": "orpheus"
    },
    {
        ":     : He sang how the earth, the heaven and the sea, once mingled together in one form, after deadly strife were separated each from other; and how the stars and the moon and the paths of the sun ever keep their fixed place in the sky; and how the mountains rose, and how the resounding rivers with their nymphs came into being and all creeping things. And he sang how first of all Ophion and Eurynome, daughter of Oceanus , held the sway of snowy Olympus , and how through strength of arm one yielded his prerogative to Cronos and the other to Rhea, and how they fell into the waves of Oceanus; but the other two meanwhile ruled over the blessed Titan -gods, while Zeus , still a child and with the thoughts of a child, dwelt in the Dictaean cave; and the earthborn Cyclopes had not yet armed him with the bolt, with thunder and lightning; for these things give renown to Zeus.      ": null
    },
    {
        "Lycophron": "lycophron"
    },
    {
        " relates that Zeus mother, Rhea, is skilled in ": null
    },
    {
        "wrestling": "greek wrestling"
    },
    {
        ", having cast the former queen Eurynome into ": null
    },
    {
        "Tartarus": "tartarus"
    },
    {
        ".     ": null
    },
    {
        "Nonnus": "nonnus"
    },
    {
        " in his Dionysiaca has Hera say :     :I will go to the uttermost bounds of Oceanus and share the hearth of primeval ": null
    },
    {
        "Tethys": "tethys"
    },
    {
        "; thence I will pass to the house of ": null
    },
    {
        "Harmonia": "harmonia"
    },
    {
        " and abide with Ophion.     Harmonia here is probably an error in the text for Eurynome. Ophion is mentioned again by Nonnus :     :Beside the oracular wall she saw the first tablet, old as the infinite past, containing all the things in one: upon it was all that Ophion lord paramount had done, all that ancient Cronus accomplished.     We also have fragments of the writings of the early philosopher ": null
    },
    {
        "Pherecydes of Syros": "pherecydes of syros"
    },
    {
        " , who devised a myth or legend in which powers known as Zas and ": null
    },
    {
        "Chronos": "chronos"
    },
    {
        " and Chthonie existed from the beginning and in which Chronos creates the universe. Some fragments of this work mention a birth of Ophioneus and a battle of the gods between Cronus on one side and Ophioneus and his children on the other in which an agreement is made that whoever pushes the other side into Ogenos will lose and the winner will hold heaven.     ": null
    },
    {
        "Eusebius of Caesarea": "eusebius of caesarea"
    },
    {
        " in his  Praeparatio Evangelica  cites ": null
    },
    {
        "Philo of Byblos": "philo of byblos"
    },
    {
        " as declaring that Pherecydes took Ophion and the Ophionidae from the Phoenicians.       ": null
    },
    {
        "Robert Graves": "robert graves"
    },
    {
        " in his book  The Greek Myths  imaginatively reconstructs a ": null
    },
    {
        "Pelasgian": "pelasgian"
    },
    {
        " creation myth involving Ophion as a serpent created by a supreme goddess called Eurynome dancing on the waves. She is fertilized by the serpent and in the form of a dove lays an egg on the waters about which Ophion entwines until it hatches and the world issues forth. Then Ophion and Eurynome dwell on Mt. Olympus until Ophion boasts that he made the world alone. Eurynome, as punishment, kicked out his teeth and banished him to the underworld. From Ophions teeth sprang ": null
    },
    {
        "Pelasgus": "pelasgus"
    },
    {
        " who taught man all the arts and crafts.     This particular interpretation shares many similarities with some ": null
    },
    {
        "Gnostic": "gnosticism"
    },
    {
        " traditions, with the ": null
    },
    {
        "Demiurge": "demiurge"
    },
    {
        ", often represented in the form of a serpent , claiming to have created the world alone despite the assistance of others - often ": null
    },
    {
        "Sophia": "sophia"
    },
    {
        ", who is associated with doves through the ": null
    },
    {
        "Holy Spirit": "holy spirit"
    }
]