[
    {
        "In ": null
    },
    {
        "optics": "optics"
    },
    {
        ", optical path length  or optical distance is the product of the ": null
    },
    {
        "geometric length": "arc length"
    },
    {
        " of the path followed by light through a given system, and the ": null
    },
    {
        "index of refraction": "index of refraction"
    },
    {
        " of the ": null
    },
    {
        "medium": "medium"
    },
    {
        " through which it propagates. In many textbooks, it is symbolically written as Λ. A difference in optical path length between two paths is often called the optical path difference . OPL and OPD are important because they determine the ": null
    },
    {
        "phase": "phase"
    },
    {
        " of the light and governs ": null
    },
    {
        "interference": "interference"
    },
    {
        " and ": null
    },
    {
        "diffraction": "diffraction"
    },
    {
        " of light as it propagates.           In a medium of constant refractive index, n, the OPL for a path of geometrical length s is just     : \\mathrm n s .\\,     If the refractive index varies along the path, the OPL is given by a ": null
    },
    {
        "line integral": "line integral"
    },
    {
        "     : \\mathrm \\int_C n \\mathrm d s,\\quad     where n is the local refractive index as a function of distance along the path C.     An ": null
    },
    {
        "electromagnetic wave": "electromagnetic wave"
    },
    {
        " propagating along a path C has the ": null
    },
    {
        "phase shift": "phase shift"
    },
    {
        " over C as if it was propagating a path in a ": null
    },
    {
        "vacuum": "vacuum"
    },
    {
        ", length of which, is equal to the optical path length of C. Thus, if a ": null
    },
    {
        "wave": "wave"
    },
    {
        " is traveling through several different media, then the optical path length of each medium can be added to find the total optical path length. The optical path difference between the paths taken by two identical waves can then be used to find the phase change. Finally, using the phase change, the interference between the two waves can be calculated.     ": null
    },
    {
        "Fermats principle": "fermats principle"
    },
    {
        " states that the path light takes between two points is the path that has the minimum optical path length.         The OPD corresponds to the ": null
    },
    {
        "phase shift": "phase shift"
    },
    {
        " undergone by the light emitted from two previously ": null
    },
    {
        "coherent": "coherence"
    },
    {
        " sources when passed through mediums of different ": null
    },
    {
        "refractive indices": "refractive index"
    },
    {
        ". For example, a wave passed through glass will appear to travel a greater distance than an identical wave in air. This is because the source in the glass will have experienced a greater number of wavelengths due to the higher ": null
    },
    {
        "refractive index": "refractive index"
    },
    {
        " of the ": null
    },
    {
        "glass": "glass"
    },
    {
        ".     The OPD can be calculated from the following equation:     : \\mathrm d_42 n_42 - d_42 n_42   where d 42 and d 42 are the distances of the ray passing through medium 42 or 42 n 42 is the greater refractive index and n": null
    }
]