[
    {
        "                 The orangutans  are three ": null
    },
    {
        "extant": "neontology"
    },
    {
        " species": "species"
    },
    {
        " of ": null
    },
    {
        "great apes": "hominidae"
    },
    {
        " native to ": null
    },
    {
        "Indonesia": "indonesia"
    },
    {
        " and ": null
    },
    {
        "Malaysia": "malaysia"
    },
    {
        ". Orangutans are currently only found in the ": null
    },
    {
        "rainforests": "rainforest"
    },
    {
        "of ": null
    },
    {
        "Borneo": "borneo"
    },
    {
        " and ": null
    },
    {
        "Sumatra": "sumatra"
    },
    {
        ". Classified in the ": null
    },
    {
        "genus": "genus"
    },
    {
        " Pongo, orangutans were originally considered to be one species. From 1996, they were divided into two species: the ": null
    },
    {
        "Bornean orangutan": "bornean orangutan"
    },
    {
        "  and the ": null
    },
    {
        "Sumatran orangutan": "sumatran orangutan"
    },
    {
        " . In November 2017 it was reported that a third species had been identified, the ": null
    },
    {
        "Tapanuli orangutan": "tapanuli orangutan"
    },
    {
        " .     Genomic comparisons show that the Tapanuli orangutan separated from the Sumatran orangutan about 3.4 million years ago. The Tapanuli orangutan separated from the Bornean orangutan much later, about 670,000 years ago. The orangutans are the only surviving species of the subfamily ": null
    },
    {
        "Ponginae": "ponginae"
    },
    {
        ", which also included several other species, such as the three extinct species of the genus  Gigantopithecus , including the largest known primate,  Gigantopithecus blacki . The ancestors of the Ponginae split from the main ape line in Africa 16 to 19 million years ago  and spread into Asia.     Orangutans are the most ": null
    },
    {
        "arboreal": "arboreal locomotion"
    },
    {
        " of the great apes and spend most of their time in trees. Their hair is reddish-brown, instead of the brown or black hair typical of ": null
    },
    {
        "chimpanzees": "pan"
    },
    {
        "and ": null
    },
    {
        "gorilla": "gorilla"
    },
    {
        "s. Males and females differ in size and appearance. Dominant adult males have distinctive cheek pads and produce long calls that attract females and intimidate rivals. Younger males do not have these characteristics and resemble adult females. Orangutans are the most solitary of the great apes, with social bonds occurring primarily between mothers and their dependent offspring, who stay together for the first two years. Fruit is the most important component of an orangutans diet; however, the apes will also eat vegetation, bark, honey, insects and even bird eggs. They can live over 30  years in both the wild and captivity.     Orangutans are among the most intelligent ": null
    },
    {
        "primate": "primate"
    },
    {
        "s; they ": null
    },
    {
        "use a variety of sophisticated tools": "tool use by animalsorangutans"
    },
    {
        " and construct elaborate sleeping nests each night from branches and foliage. The apes have been extensively studied for their learning abilities. There may even be distinctive cultures within populations. Field studies of the apes were pioneered by ": null
    },
    {
        "primatologist": "primatology"
    },
    {
        " Birutė Galdikas": "birutė galdikas"
    },
    {
        ". All three orangutan species are considered to be ": null
    },
    {
        "critically endangered": "critically endangered"
    },
    {
        ". Human activities have caused severe declines in populations and ranges. Threats to wild orangutan populations include poaching, ": null
    },
    {
        "habitat destruction": "habitat destruction"
    },
    {
        " as a result of ": null
    },
    {
        "palm oil": "palm oil"
    },
    {
        " cultivation, and the illegal ": null
    },
    {
        "pet trade": "exotic pet"
    },
    {
        ". Several conservation and rehabilitation organisations are dedicated to the survival of orangutans in the wild.       The name orangutan  is derived from the ": null
    },
    {
        "Malay": "malay language"
    },
    {
        " and ": null
    },
    {
        "Indonesian": "indonesian language"
    },
    {
        " words orang, meaning person , and hutan, meaning forest ,  thus person of the forest .      The first attestation of the word orangutan to name the Asian ape is in Dutch physician ": null
    },
    {
        "Jacobus Bontius": "jacobus bontius"
    },
    {
        " 1631 Historiae naturalis et medicae Indiae orientalis – he reported that Malays had informed him the ape was able to talk, but preferred not to lest he be compelled to labour .  The word appeared in several German-language descriptions of Indonesian zoology in the 17th century. The likely origin of the word comes specifically from the ": null
    },
    {
        "Banjarese": "banjar language"
    },
    {
        " variety of Malay.      Cribb et al. suggest that Bontius account referred not to apes but rather to humans suffering some serious medical condition  and that his use of the word was misunderstood by ": null
    },
    {
        "Nicolaes Tulp": "nicolaes tulp"
    },
    {
        ", who was the first to use the term in a publication.      The word was first attested in English in 1691 in the form orang-outang, and variants with -ng are found in many languages. This spelling has remained in use in English up to the present, but has come to be regarded as ": null
    },
    {
        "incorrect": "linguistic prescription"
    },
    {
        ".    The loss of h in Utan and the shift from -ng to -n has been taken to suggest that the term entered English through ": null
    },
    {
        "Portuguese": "portuguese language"
    },
    {
        ". In 1869, the British naturalist ": null
    },
    {
        "Alfred Russel Wallace": "alfred russel wallace"
    },
    {
        " published his account of Malaysias wildlife:  The Malay Archipelago: The Land of the Orang-Utan and the Bird of Paradise .     The name of the genus, Pongo, comes from a 16th-century account by ": null
    },
    {
        "Andrew Battel": "andrew battel"
    },
    {
        ", an English sailor held prisoner by the Portuguese in ": null
    },
    {
        "Angola": "angola"
    },
    {
        ", which describes two anthropoid monsters named Pongo and Engeco. He is now believed to have been describing ": null
    },
    {
        "gorilla": "gorilla"
    },
    {
        "s, but in the 18th century, the terms orangutan and pongo were used for all great apes. ": null
    },
    {
        "Lacépède": "bernard germain étienne de la ville, comte de lacépède"
    },
    {
        " used the term Pongo for the genus following the German botanist ": null
    },
    {
        "Friedrich von Wurmb": "friedrich von wurmb"
    },
    {
        " who sent a skeleton from the Indies to Europe.  Battels Pongo , in turn, is from the ": null
    },
    {
        "Kongo": "kongo language"
    },
    {
        " word mpongi   or other ": null
    },
    {
        "cognates": "cognates"
    },
    {
        " from the region: ": null
    },
    {
        "Lumbu": "lumbu language"
    },
    {
        " pungu, ": null
    },
    {
        "Vili": "vili"
    },
    {
        " mpungu, or ": null
    },
    {
        "Yombi": "yombi"
    },
    {
        " yimpungu.        The three orangutan species are the only extant members of the subfamily ": null
    },
    {
        "Ponginae": "ponginae"
    },
    {
        ". This subfamily also included the extinct genera  Lufengpithecus , which lived in southern China and Thailand 2–8  mya, and  Sivapithecus , which lived India and Pakistan from 12.5  mya until 8.5  mya. These ": null
    },
    {
        "apes": "ape"
    },
    {
        "likely lived in drier and cooler environments than orangutans do today.  Khoratpithecus piriyai, which lived in Thailand 5–7  mya, is believed to have been the closest known relative of the orangutans. The largest known primate,  Gigantopithecus , was also a member of Ponginae and lived in China, India and Vietnam from 5  mya to 100,000  years ago.      Within apes , the ": null
    },
    {
        "gibbons": "gibbon"
    },
    {
        "diverged during the early ": null
    },
    {
        "Miocene": "miocene"
    },
    {
        "  and the orangutans split from the African great ape lineage between 15.7 and 19.3  mya.              The orangutan was first ": null
    },
    {
        "described scientifically": "species description"
    },
    {
        " in 1760 in the Systema Naturae of ": null
    },
    {
        "Linnaeus": "carl linnaeus"
    },
    {
        " as Simia satyrus.   The populations on the two islands were classified as separate species when P. abelii was described by ": null
    },
    {
        "Lesson": "rené lesson"
    },
    {
        " in 1827.  Later P. abelii was placed under P. pygmaeus, first as a synonym, then in 1985 as a ": null
    },
    {
        "subspecies": "subspecies"
    },
    {
        ".  In 1996, P. abelii was elevated back to full species status,   and the three distinct populations on Borneo were elevated to subspecies. The population currently listed as P.  p.  wurmbii may be closer to the Sumatran orangutan than the other Bornean orangutan subspecies. If confirmed, abelii would be a subspecies of P.  wurmbii .      Regardless, the ": null
    },
    {
        "type locality": "type locality"
    },
    {
        " of P. pygmaeus has not been established beyond doubts, and may be from the population currently listed as P. wurmbii . To further confuse, the name P. morio, as well as some suggested junior synonyms, may be junior synonyms of the P. pygmaeus subspecies, thus leaving the east Bornean populations unnamed.     The description in 2017 of a third species, P. tapanuliensis, from Sumatra south of ": null
    },
    {
        "Lake Toba": "lake toba"
    },
    {
        ", came with a surprising twist: it is more closely related to the Bornean species, P. pygmaeus than to its fellow Sumatran species, P. abelii.          Some fossils described under the name  P.  hooijeri  have been found in Vietnam, and multiple fossil subspecies have been described from several parts of southeastern Asia. It is unclear if these belong to P.  pygmaeus or P.  abelii or, in fact, represent distinct species.           The Sumatran orangutan genome was sequenced in January 2011.   Following humans and ": null
    },
    {
        "chimpanzees": "common chimpanzee"
    },
    {
        ", the Sumatran orangutan became the third species of ": null
    },
    {
        "hominid": "hominid"
    },
    {
        " to have its genome sequenced. Subsequently, the Bornean species had its genome sequenced. ": null
    },
    {
        "Genetic diversity": "genetic diversity"
    },
    {
        " was found to be lower in Bornean orangutans  than in Sumatran ones , despite the fact that Borneo is home to six or seven times as many orangutans as Sumatra.     The comparison has shown these two species diverged around 400,000  years ago, more recently than was previously thought. Also, the orangutan genome was found to have evolved much more slowly than chimpanzee and human DNA. Previously, the species was estimated to have diverged 2.9 to 4.9  mya.  The researchers hope these data may help conservationists save the endangered ape, and also prove useful in further understanding of human ": null
    },
    {
        "genetic diseases": "genetic diseases"
    },
    {
        ". Bornean orangutans have 48  ": null
    },
    {
        "diploid": "diploid"
    },
    {
        " chromosome": "chromosome"
    },
    {
        "s.      However, ": null
    },
    {
        "nuclear DNA": "nuclear dna"
    },
    {
        " sequence comparisons reported in 2017 suggest that Tapanuli orangutans diverged from Sumatran orangutans about 3.4 million years ago.  Tapanuli orangutans diverged from Bornean orangutans, much later, about 670,000 years ago. Orangutans travelled from Sumatra to Borneo as the islands were connected by ": null
    },
    {
        "land bridges": "land bridge"
    },
    {
        "as parts of ": null
    },
    {
        "Sundaland": "sundaland"
    },
    {
        " during ": null
    },
    {
        "recent glacial periods": "quaternary glaciation"
    },
    {
        " when sea levels were much lower. The present range of Tapanuli orangutans is thought to be close to the point where ancestral orangutans first entered what is now Indonesia from mainland Asia.          An orangutan has a large, bulky body, a thick neck, very long, strong arms, short, bowed legs, and no tail. It is mostly covered with long, reddish-brown hair and grey-black skin. Sumatran orangutans have more sparse and lighter-coloured coats.  The orangutan has a large head with a prominent mouth area. Though largely hairless, their faces can develop some hair in males, giving them a moustache.     Adult males have large cheek flaps   to show their dominance to other males. The cheek flaps are made mostly of fatty tissue and are supported by the musculature of the face.  Mature males throat pouches allow them to make loud calls.    The species display significant ": null
    },
    {
        "sexual dimorphism": "sexual dimorphism"
    },
    {
        "; females typically stand  tall and weigh around , while flanged adult males stand  tall and weigh .  A male orangutan has an ": null
    },
    {
        "arm span": "arm span"
    },
    {
        " of about .      Orangutan hands are similar to human hands; they have four long fingers and an ": null
    },
    {
        "opposable thumb": "opposable thumb"
    },
    {
        ". However, the joint and tendon arrangement in the orangutans hands produces two adaptations that are significant for ": null
    },
    {
        "arboreal locomotion": "arboreal locomotion"
    },
    {
        ". The resting configuration of the fingers is curved, creating a suspensory hook grip.   Additionally, without the use of the thumb, the fingers and hands can grip tightly around objects with a small diameter by resting the tops of the fingers against the inside of the palm, creating a double-locked grip.      Their feet have four long toes and an opposable big toe.  Orangutans can grasp things with both their hands and their feet.  Their fingers and toes are curved, allowing them to get a better grip on branches. Since their hip joints have the same flexibility as their shoulder and arm joints, orangutans have less restriction in the movements of their legs than humans have.  Unlike gorillas and chimpanzees, orangutans are not true knuckle-walkers, and are instead fist-walkers.        Orangutans live in primary and old secondary forests, particularly ": null
    },
    {
        "dipterocarp": "dipterocarpaceae"
    },
    {
        " forests and ": null
    },
    {
        "peat swamp forest": "peat swamp forest"
    },
    {
        "s. Both species can be found in mountainous and lowland swampy areas. Sumatran orangutans live at elevations as high as 1500  m , while Bornean orangutans live no higher than 1000  m . Other habitats used by orangutans include grasslands, cultivated fields, gardens, young secondary forest, and shallow lakes. Orangutans are the most arboreal of the great apes, spending nearly all their time in the trees.      Most of the day is spent feeding, resting, and travelling. They start the day feeding for 2–3 hours in the morning. They rest during midday then travel in the late afternoon. When evening arrives, they begin to prepare their nests for the night. Orangutans do not swim, although they have been recorded wading in water.  The main predators of orangutans are ": null
    },
    {
        "tiger": "tiger"
    },
    {
        "s. Other predators include ": null
    },
    {
        "clouded leopards": "sunda clouded leopard"
    },
    {
        ", ": null
    },
    {
        "wild dogs": "dhole"
    },
    {
        " and ": null
    },
    {
        "crocodile": "crocodile"
    },
    {
        "s. The absence of tigers on Borneo may explain why Bornean orangutans can be found on the ground more often than their Sumatran relatives.             Orangutans are opportunistic ": null
    },
    {
        "forage": "forage"
    },
    {
        "rs, and their diets vary markedly from month to month. Fruit makes up 65–90% of the orangutan diet, and those with ": null
    },
    {
        "sugar": "sugar"
    },
    {
        "y or ": null
    },
    {
        "fat": "fat"
    },
    {
        "ty pulp are favoured. ": null
    },
    {
        "Ficus": "ficus"
    },
    {
        " fruits are commonly eaten and are easy to harvest and digest. Lowland dipterocarp ": null
    },
    {
        "forests": "forest"
    },
    {
        "are preferred by orangutans because of their plentiful fruit. Bornean orangutans consume at least 317  different food items that include young leaves, shoots, bark, insects, ": null
    },
    {
        "honey": "honey"
    },
    {
        " and ": null
    },
    {
        "bird egg": "bird egg"
    },
    {
        "s.   Orangutans in Sumatra occasionally eat ": null
    },
    {
        "slow loris": "slow loris"
    },
    {
        "es.      A decade-long study of urine and faecal samples at the ": null
    },
    {
        "Gunung Palung Orangutan Conservation Project": "gunung palung orangutan conservation project"
    },
    {
        " in ": null
    },
    {
        "West Kalimantan": "west kalimantan"
    },
    {
        " has shown that orangutans give birth during and after the high fruit season , during which they consume various abundant fruits, totalling up to 11,000 calories per day. In the low-fruit season, they eat whatever fruit is available in addition to tree bark and leaves, with daily intake at only 2,000 calories. Together with a long ": null
    },
    {
        "lactation": "lactation"
    },
    {
        " period, orangutans also have a long birth interval.      Orangutans are thought to be the sole fruit disperser for some plant species including the climber species  Strychnos ignatii  which contains the toxic ": null
    },
    {
        "alkaloid": "alkaloid"
    },
    {
        " strychnine": "strychnine"
    },
    {
        ".  It does not appear to have any effect on orangutans except for excessive ": null
    },
    {
        "saliva": "saliva"
    },
    {
        " production.       ": null
    },
    {
        "Geophagy": "geophagy"
    },
    {
        ", the practice of eating soil or rock, has been observed in orangutans. There are three main reasons for this dietary behaviour: for the addition of mineral nutrients to their diet; for the ingestion of clay minerals that can absorb toxic substances; or to treat a disorder such as diarrhoea.  Orangutans also use plants of the genus  Commelina  as an anti-inflammatory balm.           Orangutans live a more solitary lifestyle than the other great apes. Most social bonds occur between adult females and their dependent and weaned offspring. Adult males and independent adolescents of both sexes tend to live alone.  Orangutan societies are made up of resident and transient individuals of both sexes. Resident females live with their offspring in defined home ranges that overlap with those of other adult females, which may be their immediate relatives. One to several resident female home ranges are encompassed within the home range of a resident male, who is their main mating partner.     Transient males and females move widely. Orangutans usually travel alone, but they may travel in small groups in their subadult years. However, this behaviour ends at adulthood. The social structure of the orangutan can be best described as ": null
    },
    {
        "solitary but social": "solitary but social"
    },
    {
        ". Interactions between adult females range from friendly to avoidance to antagonistic. Resident males may have overlapping ranges and interactions between them tend to be hostile.      During dispersal, females tend to settle in home ranges that overlap with their mothers. However, they do not seem to have any special social bonds with them.  Males disperse much farther from their mothers and enter into a transient phase. This phase lasts until a male can challenge and displace a dominant, resident male from his home range.  Adult males dominate sub-adult males.      Both resident and transient orangutans aggregate on large fruiting trees to feed. The fruits tend to be abundant, so competition is low and individuals may engage in social interactions. Orangutans will also form travelling groups with members moving between different food sources. These groups tend to be made of only a few individuals. They also tend to be consortships between an adult male and female.       Orangutans communicate with various sounds. Males will make long calls, both to attract females and advertise themselves to other males. Both sexes will try to intimidate conspecifics with a series of low guttural noises known collectively as the rolling call .  When annoyed, an orangutan will suck in air through pursed lips, making a kissing sound that is hence known as the kiss squeak . Infants make soft hoots when distressed. Orangutans are also known to ": null
    },
    {
        "blow raspberries": "blowing a raspberry"
    },
    {
        ".            Orangutans ": null
    },
    {
        "build nests": "nest-building in primates"
    },
    {
        " specialized for both day or night use. These are carefully constructed; young orangutans learn from observing their mothers nest-building behaviour. In fact, nest-building is a leading cause in young orangutans leaving their mother for the first time. From six months of age onwards, orangutans practice nest-building and gain proficiency by the time they are three years old.      Construction of a night nest is done by following a sequence of steps. Initially, a suitable tree is located, orangutans being selective about sites though many tree species are used. The nest is then built by pulling together branches under them and joining them at a point. After the foundation has been built, the orangutan bends smaller, leafy branches onto the foundation; this serves the purpose of and is termed the mattress . After this, orangutans stand and braid the tips of branches into the mattress. Doing this increases the stability of the nest and forms the final act of nest-building. In addition, orangutans may add additional features, such as pillows , blankets , roofs and bunk-beds to their nests.       Males mature at around 15  years of age, by which time they have fully descended testicles and can reproduce. However, they exhibit ": null
    },
    {
        "arrested development": "neoteny"
    },
    {
        " by not developing the distinctive cheek pads, pronounced throat pouches, long fur, or long-calls until they are between 15 and 20  years old. The development of these characteristics depends largely on the absence of a resident male.      Males without them are known as unflanged males in contrast to the more developed flanged males. The transformation from unflanged to flanged can occur very quickly. Unflanged and flanged males have two different mating strategies. Flanged males attract oestrous females with their characteristic long calls.  Those calls may also suppress development in younger males. Unflanged males wander widely in search of oestrous females and upon finding one, will force copulation on her. While both strategies are successful, females prefer to mate with flanged males and seek their company for protection against unflanged males. Resident males may form consortships with females that can last days, weeks or months after copulation.        Female orangutans experience their first ovulatory cycle around 5.8–11.1  years. These occur earlier in females with more body fat. Like other great apes, female orangutans enter a period of infertility during adolescence which may last for 1–4  years. Female orangutans also have a 22– to 30-day menstrual cycle. Gestation lasts for 9 months, with females giving birth to their first offspring between the ages of 14 and 15  years.     Female orangutans have eight-year intervals between births, the longest interbirth intervals among the great apes. Unlike many other primates, male orangutans do not seem to practice ": null
    },
    {
        "infanticide": "infanticide"
    },
    {
        ". This may be because they cannot ensure they will sire a females next offspring because she does not immediately begin ovulating again after her infant dies.      Male orangutans play almost no role in raising the young. Females do most of the caring and socializing of the young. A female often has an older offspring with her to help in socializing the infant.  Infant orangutans are completely dependent on their mothers for the first two years of their lives. The mother will carry the infant during travelling, as well as feed it and sleep with it in the same night nest. For the first four months, the infant is carried on its belly and never relieves physical contact. In the following months, the time an infant spends with its mother decreases.     When an orangutan reaches the age of two, its climbing skills improve and it will travel through the canopy holding hands with other orangutans, a behaviour known as buddy travel . Orangutans are juveniles from about two to five years of age and will start to temporarily move away from their mothers. Juveniles are usually weaned at about four years of age. Adolescent orangutans will socialize with their peers while still having contact with their mothers. Typically, orangutans live for over 30  years in both the wild and captivity.        Orangutans are among the most intelligent non-human primates. Experiments suggest they can figure out some ": null
    },
    {
        "invisible displacement problems": "object permanencein animals"
    },
    {
        " with a representational strategy.  In addition, ": null
    },
    {
        "Zoo Atlanta": "zoo atlanta"
    },
    {
        " has a touch-screen computer where their two Sumatran orangutans play games. Scientists hope the data they collect will help researchers learn about socialising patterns, such as whether the apes learn behaviours through trial and error or by mimicry, and point to new conservation strategies.      A 2008 study of two orangutans at the ": null
    },
    {
        "Leipzig Zoo": "leipzig zoological garden"
    },
    {
        " showed orangutans can use calculated reciprocity , which involves weighing the costs and benefits of gift exchanges and keeping track of these over time. Orangutans are the first nonhuman species documented to do so.    Orangutans are very technically adept nest builders, making a new nest each evening in only 5 to 6 minutes and choosing branches which they know can support their body weight.           Tool use in orangutans was observed by ": null
    },
    {
        "primatologist": "primatology"
    },
    {
        " Birutė Galdikas": "birutė galdikas"
    },
    {
        " in ex-captive populations.  In addition, evidence of sophisticated tool manufacture and use in the wild was reported from a population of orangutans in Suaq Balimbing  in 1996.  These orangutans developed a tool kit for use in foraging that consisted of both insect-extraction tools for use in the hollows of trees and seed-extraction tools for harvesting seeds from hard-husked fruit. The orangutans adjusted their tools according to the nature of the task at hand, and preference was given to oral tool use. Fox EA, Sitompul AF, van Schaik CP. . Intelligent tool use in wild Sumatran orangutans . In: Parker S, Mitchell RW and Miles HL The Mentality of Gorillas and Orangutans. Cambridge, UK : Cambridge University Press. pp. 99–116, . This preference was also found in an experimental study of captive orangutans .      Primatologist ": null
    },
    {
        "Carel P. van Schaik": "carel van schaik"
    },
    {
        " and biological anthropologist Cheryl D. Knott further investigated tool use in different wild orangutan populations. They compared geographic variations in tool use related to the processing of Neesia fruit. The orangutans of Suaq Balimbing  were found to be avid users of insect and seed-extraction tools when compared to other wild orangutans.   The scientists suggested these differences are cultural. The orangutans at Suaq Balimbing live in dense groups and are socially tolerant; this creates good conditions for social transmission. Further evidence that highly social orangutans are more likely to exhibit cultural behaviours came from a study of leaf-carrying behaviours of ex-captive orangutans that were being rehabilitated on the island of Kaja in Borneo.      Wild orangutans  in Tuanan, Borneo, were reported to use tools in acoustic communication.  They use leaves to amplify the kiss squeak sounds they produce. The apes may employ this method of amplification to ": null
    },
    {
        "deceive": "deception in animals"
    },
    {
        " the listener into believing they are larger animals.     In 2003, researchers from six different orangutan field sites who used the same behavioural coding scheme compared the behaviours of the animals from the different sites.  They found the different orangutan populations behaved differently. The evidence suggested the differences were cultural: first, the extent of the differences increased with distance, suggesting cultural diffusion was occurring, and second, the size of the orangutans cultural repertoire increased according to the amount of social contact present within the group. Social contact facilitates cultural transmission.       A study of orangutan symbolic capability was conducted from 1973 to 1975 by zoologist Gary L. Shapiro with Aazk, a juvenile female orangutan at the Fresno City Zoo  in Fresno, California. The study employed the techniques of psychologist ": null
    },
    {
        "David Premack": "david premack"
    },
    {
        ", who used plastic tokens to teach linguistic skills to the chimpanzee, ": null
    },
    {
        "Sarah": "sarah"
    },
    {
        ". Shapiro, G. L. . Teaching linguistics concepts to a juvenile orangutan. California State University. Unpublished Masters Thesis. Shapiro continued to examine the linguistic and learning abilities of ex-captive orangutans in ": null
    },
    {
        "Tanjung Puting National Park": "tanjung puting national park"
    },
    {
        ", in Indonesian Borneo, between 1978 and 1980.      During that time, Shapiro instructed ex-captive orangutans in the acquisition and use of signs following the techniques of psychologists R. Allen Gardner and Beatrix Gardner, who taught the chimpanzee, ": null
    },
    {
        "Washoe": "washoe"
    },
    {
        ", in the late 1960s. In the only signing study ever conducted in a great apes natural environment, Shapiro home-reared Princess, a juvenile female, which learned nearly 40 signs  and trained Rinnie, a free-ranging adult female orangutan, which learned nearly 30 signs over a two-year period. For his dissertation study, Shapiro examined the factors influencing sign learning by four juvenile orangutans over a 15-month period.                Orangutans were known to the native people of Sumatra and Borneo for millennia. While some communities hunted them for food and decoration, others placed taboos on such practices.  In central Borneo, some traditional folk beliefs consider it bad luck to look in the face of an orangutan. Some folk tales involve orangutans mating with and kidnapping humans.  There are even stories of hunters being seduced by female orangutans.      Europeans became aware of the existence of the orangutan possibly as early as the 17th  century.  European explorers in Borneo hunted them extensively during the 19th century.  The first accurate description of orangutans was given by Dutch anatomist ": null
    },
    {
        "Petrus Camper": "petrus camper"
    },
    {
        ", who observed the animals and dissected some specimens.      Little was known about their behaviour until the field studies of ": null
    },
    {
        "Birutė Galdikas": "birutė galdikas"
    },
    {
        ",  who became a leading authority on the apes.  When she arrived in Borneo, Galdikas settled into a primitive bark and thatch hut, at a site she dubbed Camp Leakey, near the edge of the ": null
    },
    {
        "Java Sea": "java sea"
    },
    {
        ". Despite numerous hardships, she remained there for over 30 years and became an outspoken advocate for orangutans and the preservation of their rainforest habitat, which is rapidly being devastated by ": null
    },
    {
        "loggers": "logging industry"
    },
    {
        ", ": null
    },
    {
        "palm oil": "palm oil"
    },
    {
        " plantations, ": null
    },
    {
        "gold miner": "gold miner"
    },
    {
        "s, and unnatural ": null
    },
    {
        "forest fires": "wildfire"
    },
    {
        ".     Galdikass ": null
    },
    {
        "conservation": "conservation biology"
    },
    {
        " efforts have extended well beyond advocacy, largely focusing on ": null
    },
    {
        "rehabilitation": "rehabilitation"
    },
    {
        " of the many orphaned orangutans turned over to her for care. Galdikas is considered to be one of ": null
    },
    {
        "Leakeys Angels": "the trimates"
    },
    {
        ", along with ": null
    },
    {
        "Jane Goodall": "jane goodall"
    },
    {
        " and ": null
    },
    {
        "Dian Fossey": "dian fossey"
    },
    {
        ".  According to the World Wildlife Fund, half of the habitat of the Bornean orangutan has been lost since 1994.      A persistent folktale on Sumatra and Borneo and in popular culture, is that male orangutans display sexual attraction to human women, and may even forcibly ": null
    },
    {
        "copulate": "sexual intercourse"
    },
    {
        " with them. The only serious, but anecdotal, report of such an incident taking place, is a report from Galdikas that her cook was sexually assaulted by a male orangutan.  This orangutan, though, was raised in captivity and may have suffered from a skewed species identity, and forced copulation is a standard mating strategy for low-ranking male orangutans.      A female orangutan was rescued from a village brothel in Kareng Pangi village, Central ": null
    },
    {
        "Kalimantan": "kalimantan"
    },
    {
        ", in 2003. The orangutan was shaved and chained for sexual purposes.   Since being freed, the orangutan, named Pony, has been living with the ": null
    },
    {
        "Borneo Orangutan Survival": "borneo orangutan survival"
    },
    {
        " Foundation. She has been re-socialised to live with other orangutans.           In December 2014, ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        " became the first country to recognize a non-human primate as having legal rights when it ruled that an orangutan named Sandra at the ": null
    },
    {
        "Buenos Aires Zoo": "buenos aires zoo"
    },
    {
        " must be moved to a sanctuary in ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        " in order to provide her partial or controlled freedom . ": null
    },
    {
        "Animal rights": "animal rights"
    },
    {
        " groups interpreted the ruling as applicable to all species in captivity, and legal specialists considered the ruling only applicable to non-human ": null
    },
    {
        "hominids": "hominidae"
    },
    {
        ".                 The Sumatran and Bornean species are both critically endangered   according to the ": null
    },
    {
        "IUCN Red List": "iucn red list"
    },
    {
        " of ": null
    },
    {
        "mammal": "mammal"
    },
    {
        "s, and both are listed on Appendix I of ": null
    },
    {
        "CITES": "cites"
    },
    {
        ". The  estimated in 2016 that around 100,000 orangutans survive in the wild , and their population is expected to further decrease to as few as 47,000 individuals by 2025.      The Bornean orangutan population declined by 60% in the past 60 years and is projected to decline by 82% over 75 years. Its range has become patchy throughout Borneo, being largely ": null
    },
    {
        "extirpated": "local extinction"
    },
    {
        " from various parts of the island, including the southeast. The largest remaining population is found in the forest around the ": null
    },
    {
        "Sabangau River": "sabangau river"
    },
    {
        ", but this environment is at risk.      Sumatran orangutan populations declined by 80% in 75 years. This species is now found only in the northern part of Sumatra, with most of the population inhabiting the ": null
    },
    {
        "Leuser Ecosystem": "leuser ecosystem"
    },
    {
        ". In late March 2012, a once-significant population in northern Sumatra were reported to be threatened with approaching forest fires and might be wiped out entirely within a matter of weeks.      Estimates between 2000 and 2003 found 7,300  Sumatran orangutans and between 45,000 and 69,000  Bornean orangutans remain in the wild. A 2007 study by the ": null
    },
    {
        "Government of Indonesia": "government of indonesia"
    },
    {
        " noted a total wild population of 61,234  orangutans, 54,567 of which were found on the island of Borneo in 2004. The table below shows a breakdown of the species and subspecies and their estimated populations from this, or  a more recent, report:               During the early 2000s, orangutan habitat has decreased rapidly due to logging and forest fires, as well as ": null
    },
    {
        "fragmentation": "habitat fragmentation"
    },
    {
        " by roads. A major factor in that period of time has been the conversion of vast areas of ": null
    },
    {
        "tropical forest": "tropical forest"
    },
    {
        " to ": null
    },
    {
        "palm oil": "palm oil"
    },
    {
        "plantations": "plantation"
    },
    {
        "in response to international demand. Palm oil is used for cooking, cosmetics, mechanics, and ": null
    },
    {
        "biodiesel": "biodiesel"
    },
    {
        ". Hunting is also a major problem as is the illegal ": null
    },
    {
        "pet trade": "exotic pet"
    },
    {
        ".     Orangutans may be killed for the ": null
    },
    {
        "bushmeat": "bushmeat"
    },
    {
        " trade, crop protection, or for use for traditional medicine. Orangutan bones are secretly traded in souvenir shops in several cities in Kalimantan, Indonesia.  Mother orangutans are killed so their infants can be sold as pets, and many of these infants die without the help of their mother.  Since 2004, several pet orangutans were confiscated by local authorities and sent to rehabilitation centres.     In May 2017, A group of activists of the  rescued an albino organgutan from captivity. The rare primate was being held captive in a remote village in Kapuas Hulu, on the island of Kalimantan in the Indonesian Borneo. According to volunteers at BOSF, albino orangutans are extremely rare – 1 out of 10,000 individuals. This is the first albino orangutan the organisation has seen in 25 years of activity.      In November 2017, researchers found genomic evidence for a new species of orangutan named,  Pongo tapanuliensis , found only in the ": null
    },
    {
        "Batang Toru": "batang toru"
    },
    {
        " forest of ": null
    },
    {
        "Sumatra": "sumatra"
    },
    {
        ", Indonesia. It is estimated that fewer than 800 individuals still exist, which puts the Tapanuli orangutan among the most endangered of great apes.            A number of organisations are working for the rescue, rehabilitation and reintroduction of orangutans. The largest of these is the ": null
    },
    {
        "Borneo Orangutan Survival": "borneo orangutan survival"
    },
    {
        " Foundation, founded by conservationist ": null
    },
    {
        "Willie Smits": "willie smits"
    },
    {
        ". It is audited by a multinational auditor company  and operates a number of large projects, such as the Nyaru Menteng Rehabilitation Program founded by conservationist ": null
    },
    {
        "Lone Drøscher Nielsen": "lone drøscher nielsen"
    },
    {
        ".       Other major conservation centres in Indonesia include those at ": null
    },
    {
        "Tanjung Puting National Park": "kumai districttanjung puting national park"
    },
    {
        " and ": null
    },
    {
        "Sebangau National Park": "sebangau national park"
    },
    {
        " in ": null
    },
    {
        "Central Kalimantan": "central kalimantan"
    },
    {
        ", ": null
    },
    {
        "Kutai": "kutai"
    },
    {
        " in ": null
    },
    {
        "East Kalimantan": "east kalimantan"
    },
    {
        ", ": null
    },
    {
        "Gunung Palung National Park": "gunung palung national park"
    },
    {
        " in West Kalimantan, and ": null
    },
    {
        "Bukit Lawang": "bukit lawang"
    },
    {
        " in the ": null
    },
    {
        "Gunung Leuser National Park": "gunung leuser national park"
    },
    {
        " on the border of ": null
    },
    {
        "Aceh": "aceh"
    },
    {
        " and ": null
    },
    {
        "North Sumatra": "north sumatra"
    },
    {
        ". In Malaysia, conservation areas include Semenggoh Wildlife Centre in Sarawak and Matang Wildlife Centre also in Sarawak, and the ": null
    },
    {
        "Sepilok Orang Utan Sanctuary": "sepilok orang utan sanctuary"
    },
    {
        " near ": null
    },
    {
        "Sandakan": "sandakan"
    },
    {
        " in Sabah.  Major conservation centres that are headquartered outside of the orangutans home countries; include ": null
    },
    {
        "Frankfurt Zoological Society": "frankfurt zoological society"
    },
    {
        ", ": null
    },
    {
        "Orangutan Foundation International": "orangutan foundation international"
    },
    {
        ", which was founded by Birutė Galdikas,  and the ": null
    },
    {
        "Australian Orangutan Project": "australian orangutan project"
    },
    {
        ".      Conservation organisations such as ": null
    },
    {
        "Orangutan Land Trust": "orangutan land trust"
    },
    {
        " work with the palm oil industry to improve ": null
    },
    {
        "sustainability": "sustainability"
    },
    {
        " and encourages the industry to establish ": null
    },
    {
        "conservation areas": "conservation area"
    },
    {
        "for orangutans.  It works to bring different stakeholders together to achieve conservation of the species and its habitat. ": null
    }
]