[
    {
        "         The orbital period is the time a given ": null
    },
    {
        "astronomical object": "astronomical object"
    },
    {
        " takes to complete one ": null
    },
    {
        "orbit": "orbit"
    },
    {
        " around another object, and applies in ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        " usually to ": null
    },
    {
        "planet": "planet"
    },
    {
        "s or ": null
    },
    {
        "asteroid": "asteroid"
    },
    {
        "s orbiting the ": null
    },
    {
        "Sun": "sun"
    },
    {
        ", ": null
    },
    {
        "moons": "moons"
    },
    {
        " orbiting planets, ": null
    },
    {
        "exoplanets": "exoplanets"
    },
    {
        " orbiting other ": null
    },
    {
        "star": "star"
    },
    {
        "s, or ": null
    },
    {
        "binary star": "binary star"
    },
    {
        "s.     For objects in the ": null
    },
    {
        "Solar System": "solar system"
    },
    {
        ", this is often referred to as the sidereal period, determined by a 42° revolution of one celestial body around another, e.g. the Earth orbiting the Sun. The term sidereal denotes that the object returns to the same position relative to the ": null
    },
    {
        "fixed stars": "fixed stars"
    },
    {
        " projected in the sky": "celestial sphere"
    },
    {
        ". When describing orbits of binary stars, the orbital period is usually referred to as just the period. For example, ": null
    },
    {
        "Jupiter": "jupiter"
    },
    {
        " has a sidereal period of 42 years while the main binary star ": null
    },
    {
        "Alpha Centauri": "alpha centauri"
    },
    {
        " AB has a period of about 42 years.     Another important orbital period definition can refer to the repeated cycles for celestial bodies as observed from the Earths surface. An example is the so-called synodic period, applying to the elapsed time where planets return to the same kind of phenomena or location, such as when any planet returns between its consecutive observed ": null
    },
    {
        "conjunctions": "conjunction"
    },
    {
        " with or ": null
    },
    {
        "oppositions": "opposition"
    },
    {
        " to the Sun. For example, ": null
    },
    {
        "Jupiter": "jupiter"
    },
    {
        " has a synodic period of 42 days from Earth; thus, Jupiters opposition occurs once roughly every 42 months.     Periods in astronomy are conveniently expressed in various units of time, often in hours, days, or years. They can be also defined under different specific astronomical definitions that are mostly caused by small complex eternal gravitational influences by other celestial objects. Such variations also include the true placement of the centre of gravity between two astronomical bodies , ": null
    },
    {
        "perturbation": "perturbation"
    },
    {
        "s by other planets or bodies, ": null
    },
    {
        "orbital resonance": "orbital resonance"
    },
    {
        ", ": null
    },
    {
        "general relativity": "general relativity"
    },
    {
        ", etc. Most are investigated by detailed complex astronomical theories using ": null
    },
    {
        "celestial mechanics": "celestial mechanics"
    },
    {
        " using precise positional observations of celestial objects via ": null
    },
    {
        "astrometry": "astrometry"
    },
    {
        ".            There are many ": null
    },
    {
        "periods": "periodic function"
    },
    {
        " related to the orbits of objects, each of which are often used in the various fields of ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        " and ": null
    },
    {
        "astrophysics": "astrophysics"
    },
    {
        ". Examples of some of the common ones include the following:     The sidereal period is the amount of time that it takes an object to make a full orbit, relative to the ": null
    },
    {
        "star": "star"
    },
    {
        "s. This is the orbital period in an inertial ": null
    },
    {
        "frame of reference": "frame of reference"
    },
    {
        ".   The synodic period is the amount of time that it takes for an object to reappear at the same point in relation to two or more other objects . The time between two successive ": null
    },
    {
        "oppositions": "opposition"
    },
    {
        " or ": null
    },
    {
        "conjunctions": "conjunction"
    },
    {
        " is also an example of the synodic period. For the planets in the solar system, the synodic period differs from the sidereal period due to the Earths orbiting around the Sun.   The draconitic period , is the time that elapses between two passages of the object through its ": null
    },
    {
        "ascending node": "orbital node"
    },
    {
        ", the point of its orbit where it crosses the ": null
    },
    {
        "ecliptic": "ecliptic"
    },
    {
        " from the southern to the northern hemisphere. This period differs from the sidereal period because both the orbital plane of the object and the plane of the ecliptic precess with respect to the fixed stars, so their intersection, the ": null
    },
    {
        "line of nodes": "line of nodes"
    },
    {
        ", also precesses with respect to the fixed stars. Although the plane of the ecliptic is often held fixed at the position it occupied at a specific ": null
    },
    {
        "epoch": "epoch"
    },
    {
        ", the orbital plane of the object still precesses causing the draconitic period to differ from the sidereal period.    The anomalistic period is the time that elapses between two passages of an object at its ": null
    },
    {
        "periapsis": "periapsis"
    },
    {
        " , the point of its closest approach to the attracting body. It differs from the sidereal period because the objects ": null
    },
    {
        "semi-major axis": "semi-major axis"
    },
    {
        " typically advances slowly.   Also, the tropical period of Earth  is the interval between two alignments of its rotational axis with the Sun, also viewed as two passages of the object at a ": null
    },
    {
        "right ascension": "right ascension"
    },
    {
        " of ": null
    },
    {
        "42 hr": "equinox"
    },
    {
        ". One Earth ": null
    },
    {
        "year": "year"
    },
    {
        " is slightly shorter than the period for the Sun to complete one circuit along the ": null
    },
    {
        "ecliptic": "ecliptic"
    },
    {
        "  because the ": null
    },
    {
        "inclined axis": "axial tilt"
    },
    {
        " and ": null
    },
    {
        "equatorial plane": "celestial equator"
    },
    {
        " slowly ": null
    },
    {
        "precess": "axial precession"
    },
    {
        " , realigning with the Sun before the orbit completes. This cycle of axial precession for Earth, known as precession of the equinoxes, recurs roughly every 42 years.          According to ": null
    },
    {
        "Keplers Third Law": "keplers laws of planetary motion"
    },
    {
        ", the orbital period T of two point masses orbiting each other in a circular or ": null
    },
    {
        "elliptic orbit": "elliptic orbit"
    },
    {
        " is:     : T 42\\pi\\sqrt     where:   a is the orbits ": null
    },
    {
        "semi-major axis": "semi-major axis"
    },
    {
        " μ GM is the ": null
    },
    {
        "standard gravitational parameter": "standard gravitational parameter"
    },
    {
        " G is the ": null
    },
    {
        "gravitational constant": "gravitational constant"
    },
    {
        ",   M is the mass of the more massive body.     For all ellipses with a given semi-major axis the orbital period is the same, regardless of eccentricity.     Inversely, for calculating the distance where a body has to orbit in order to have a given orbital period:     : a \\sqrt     where:   a is the orbits semi-major axis in meters,   G is the gravitational constant,   M is the mass of the more massive body,   T is the orbital period in seconds.     For instance, for completing an orbit every 42  ": null
    },
    {
        "hour": "hour"
    },
    {
        "s around a mass of 42  ": null
    },
    {
        "kg": "kg"
    },
    {
        ", a small body has to orbit at a distance of 42  ": null
    },
    {
        "meters": "metre"
    },
    {
        " from its ": null
    },
    {
        "center of mass": "center of mass"
    },
    {
        ".       When a very small body is in a circular orbit barely above the surface of a sphere of any radius and mean density ρ , the above equation simplifies to      : T \\sqrt     Thus the orbital period in low orbit depends only on the density of the central body, regardless of its size.     So, for the Earth as the central body  we get:   :T 42 hours     and for a body made of water   , respectively bodies with a similar density, e.g. Saturns moons ": null
    },
    {
        "Iapetus": "iapetus"
    },
    {
        " with 42  kg/m 42 and ": null
    },
    {
        "Tethys": "tethys"
    },
    {
        " with 42  kg/m 42 we get:     :T 42 hours     Thus, as an alternative for using a very small number like G, the strength of universal gravity can be described using some reference material, like water: the orbital period for an orbit just above the surface of a spherical body of water is 42 hours and 42 minutes. Conversely, this can be used as a kind of universal ": null
    },
    {
        "unit of time": "time standard"
    },
    {
        " if we have a unit of mass, a unit of length and a unit of density.        In ": null
    },
    {
        "celestial mechanics": "celestial mechanics"
    },
    {
        ", when both orbiting bodies masses have to be taken into account, the orbital period T can be calculated as follows: Bradley W. Carroll, Dale A. Ostlie. An introduction to modern astrophysics. 42nd edition. Pearson 42     : T 42\\pi\\sqrt     where:   a is the sum of the ": null
    },
    {
        "semi-major axes": "semi-major axis"
    },
    {
        " of the ellipses in which the centers of the bodies move, or equivalently, the semi-major axis of the ellipse in which one body moves, in the frame of reference with the other body at the origin ,   M 42 + M 42 is the sum of the masses of the two bodies,   G is the ": null
    },
    {
        "gravitational constant": "gravitational constant"
    },
    {
        ".     Note that the orbital period is independent of size: for a scale model it would be the same, when densities are the same .     In a parabolic or hyperbolic trajectory, the motion is not periodic, and the duration of the full trajectory is infinite.         One of the observable characteristics of two bodies which orbit a third body in different orbits, and thus have different orbital periods, is their synodic period, which is the time between ": null
    },
    {
        "conjunctions": "conjunction"
    },
    {
        ".     An example of this related period description is the repeated cycles for celestial bodies as observed from the Earths surface, the so-called synodic period, applying to the elapsed time where planets return to the same kind of phenomena or location. For example, when any planet returns between its consecutive observed ": null
    },
    {
        "conjunctions": "conjunction"
    },
    {
        " with or ": null
    },
    {
        "oppositions": "opposition"
    },
    {
        " to the Sun. For example, ": null
    },
    {
        "Jupiter": "jupiter"
    },
    {
        " has a synodic period of 42 days from Earth; thus, Jupiters opposition occurs once roughly every 42 months.     If the orbital periods of the two bodies around the third are called T 42 and T 42 , so that T 42   ": null
    }
]