[
    {
        "        Ordinary People is a 42 American ": null
    },
    {
        "drama film": "drama"
    },
    {
        " that marked the directorial debut of actor ": null
    },
    {
        "Robert Redford": "robert redford"
    },
    {
        ". The film stars ": null
    },
    {
        "Donald Sutherland": "donald sutherland"
    },
    {
        ", ": null
    },
    {
        "Mary Tyler Moore": "mary tyler moore"
    },
    {
        ", ": null
    },
    {
        "Judd Hirsch": "judd hirsch"
    },
    {
        ", and ": null
    },
    {
        "Timothy Hutton": "timothy hutton"
    },
    {
        ".     The story concerns the disintegration of an ": null
    },
    {
        "upper-middle class": "upper-middle class"
    },
    {
        " family in ": null
    },
    {
        "Lake Forest, Illinois": "lake forest, illinois"
    },
    {
        ", following the accidental death of one of their two sons and the attempted suicide of the other. The screenplay by ": null
    },
    {
        "Alvin Sargent": "alvin sargent"
    },
    {
        " was based upon the 42 novel  Ordinary People  by ": null
    },
    {
        "Judith Guest": "judith guest"
    },
    {
        ".     The film received six ": null
    },
    {
        "Academy Awards": "academy awards"
    },
    {
        " nominations and won four: the ": null
    },
    {
        "Academy Award for Best Picture": "academy award for best picture"
    },
    {
        ", ": null
    },
    {
        "Best Director": "academy award for best director"
    },
    {
        " for Redford, ": null
    },
    {
        "Adapted Screenplay": "academy award for best adapted screenplay"
    },
    {
        " for Sargent, and ": null
    },
    {
        "Supporting Actor": "academy award for best supporting actor"
    },
    {
        " for Hutton. In addition, it won five ": null
    },
    {
        "Golden Globe Award": "golden globe award"
    },
    {
        "s: ": null
    },
    {
        "Best Motion Picture – Drama": "golden globe award for best motion picture – drama"
    },
    {
        ", ": null
    },
    {
        "Best Director": "golden globe award for best director"
    },
    {
        " , ": null
    },
    {
        "Best Actress in a Drama": "golden globe award for best actress in a motion picture, drama"
    },
    {
        " , ": null
    },
    {
        "Best Supporting Actor": "golden globe award for best supporting actor – motion picture"
    },
    {
        " , and ": null
    },
    {
        "Best Screenplay": "golden globe award for best screenplay"
    },
    {
        " .       The Jarretts are an upper-middle-class family in suburban Chicago trying to return to normal life after the accidental death of their older teenage son, Buck, and the attempted suicide of their younger and surviving son, Conrad. Conrad, who has recently returned home from a four-month stay in a psychiatric hospital, feels alienated from his friends and family and begins seeing a psychiatrist, Dr. Berger. Berger learns that Conrad was involved in the sailing accident that took the life of Buck, whom everyone idolized. Conrad now deals with ": null
    },
    {
        "post-traumatic stress disorder": "post-traumatic stress disorder"
    },
    {
        " and ": null
    },
    {
        "survivors guilt": "survivors guilt"
    },
    {
        ".     Conrads father, Calvin, tries to connect with his surviving son and understand his wife. Conrads mother, Beth, denies her loss, hoping to maintain her composure and restore her family to what it once was. She appears to have loved her older son more, and because of the suicide attempt, has grown cold toward Conrad. She is determined to maintain the appearance of perfection and normalcy. Conrad works with Dr. Berger and learns to try to deal with, rather than control, his emotions. He starts dating a fellow student, Jeannine, who helps him to begin to regain a sense of optimism. Conrad, however, still struggles to communicate and re-establish a normal relationship with his parents and schoolmates, including Stillman, with whom he gets into a fist fight. He cannot seem to allow anyone, especially Beth, to get close. Beth makes several guarded attempts to appeal to Conrad for some semblance of normality, but she ends up being cold towards him.     Mother and son often argue while Calvin tries to referee, generally taking Conrads side for fear of pushing him over the edge again. Things come to a climax near Christmas, when Conrad becomes furious at Beth for not wanting to take a photo with him, swearing at her in front of his grandparents. Afterward, Beth discovers Conrad has been lying about his after-school whereabouts. This leads to a heated argument between Conrad and Beth in which Conrad points out that Beth never visited him in the hospital, saying that she would have come if Buck was in the hospital. Beth replies, Buck never would have been in the hospital! Beth and Calvin take a trip to see Beths brother in Houston, where Calvin confronts Beth, calling her out on her attitude.     Conrad suffers a setback when he learns that Karen, a friend of his from the psychiatric hospital, has committed suicide. A cathartic breakthrough session with Dr. Berger allows Conrad to stop blaming himself for Bucks death and accept his mothers frailties. Calvin, however, emotionally confronts Beth one last time. He questions their love and asks whether she is capable of truly loving anyone. Stunned, Beth decides to leave her family rather than deal with her own, or their, emotions. Calvin and Conrad are left to come to terms with their new family situation.        ": null
    },
    {
        "Donald Sutherland": "donald sutherland"
    },
    {
        " as Calvin Jarrett   ": null
    },
    {
        "Mary Tyler Moore": "mary tyler moore"
    },
    {
        " as Beth Jarrett   ": null
    },
    {
        "Judd Hirsch": "judd hirsch"
    },
    {
        " as Dr. Tyrone C. Berger   ": null
    },
    {
        "Timothy Hutton": "timothy hutton"
    },
    {
        " as Conrad Jarrett   ": null
    },
    {
        "Elizabeth McGovern": "elizabeth mcgovern"
    },
    {
        " as Jeannine Pratt   ": null
    },
    {
        "M. Emmet Walsh": "m. emmet walsh"
    },
    {
        " as Coach Salan   ": null
    },
    {
        "Dinah Manoff": "dinah manoff"
    },
    {
        " as Karen Aldrich   ": null
    },
    {
        "Fredric Lehne": "fredric lehne"
    },
    {
        " as Joe Lazenby   ": null
    },
    {
        "James B. Sikking": "james sikking"
    },
    {
        " as Ray Hanley   ": null
    },
    {
        "Basil Hoffman": "basil hoffman"
    },
    {
        " as Sloan   ": null
    },
    {
        "Quinn Redeker": "quinn redeker"
    },
    {
        " as Ward   ": null
    },
    {
        "Mariclare Costello": "mariclare costello"
    },
    {
        " as Audrey   ": null
    },
    {
        "Meg Mundy": "meg mundy"
    },
    {
        " as Grandmother   ": null
    },
    {
        "Elizabeth Hubbard": "elizabeth hubbard"
    },
    {
        " as Ruth   ": null
    },
    {
        "Adam Baldwin": "adam baldwin"
    },
    {
        " as Kevin Stillman   Richard Whiting as Grandfather   Tim Clarke as Truan   Scott Doebler as Jordan Buck Jarrett          Ordinary People garnered four Oscars for 42 including the ": null
    },
    {
        "Academy Award for Best Picture": "academy award for best picture"
    },
    {
        ". The picture, Robert Redfords debut at directing, won him the ": null
    },
    {
        "Academy Award for Best Director": "academy award for best director"
    },
    {
        ". ": null
    },
    {
        "Alvin Sargent": "alvin sargent"
    },
    {
        " won the ": null
    },
    {
        "Academy Award for Best Adapted Screenplay": "academy award for best adapted screenplay"
    },
    {
        ". Timothy Hutton won the ": null
    },
    {
        "Academy Award for Best Supporting Actor": "academy award for best supporting actor"
    },
    {
        " in his first film role .     The film marked Mary Tyler Moores career breakout from the personality of her other two famous roles as Laura Petrie on  The Dick Van Dyke Show  and Mary Richards on  The Mary Tyler Moore Show . Moores complex performance as the mother to Huttons character was well-received and obtained a nomination for ": null
    },
    {
        "Best Actress": "academy award for best actress"
    },
    {
        ". Donald Sutherlands performance as the father was also well received, and he was nominated for a Golden Globe Award. He was not nominated for an Academy Award along with his co-stars, however, which  Entertainment Weekly  has described as one of the worst acting snubs in the history of the Academy Awards.      Judd Hirschs portrayal of Dr. Berger was a departure from his work on the sitcom  Taxi , and drew praise from many in the psychiatric community as one of the rare times their profession is shown in a positive light in film.  Hirsch was also nominated for Best Supporting Actor, losing out to co-star Hutton. Additionally, Ordinary People launched the career of ": null
    },
    {
        "Elizabeth McGovern": "elizabeth mcgovern"
    },
    {
        " who played Huttons characters love interest, and who received special permission to film while attending ": null
    },
    {
        "Juilliard": "juilliard"
    },
    {
        ".     Ordinary People received critical acclaim. ": null
    },
    {
        "Roger Ebert": "roger ebert"
    },
    {
        " gave it a full four stars and praised how the films setting is seen with an understated matter-of-factness. There are no cheap shots against suburban lifestyles or affluence or mannerisms: The problems of the people in this movie arent caused by their milieu, but grow out of themselves. Thats what sets the film apart from the sophisticated suburban soap opera it could easily have become.  He later named it the fifth best film of the year 42 ": null
    },
    {
        "Gene Siskel": "gene siskel"
    },
    {
        " ranked it the second best film of 42  ": null
    },
    {
        "Vincent Canby": "vincent canby"
    },
    {
        " writing for  The New York Times  called it a moving, intelligent and funny film about disasters that are commonplace to everyone except the people who experience them.  On ": null
    },
    {
        "Rotten Tomatoes": "rotten tomatoes"
    },
    {
        ", the film has an approval rating of 42%, based on 42 reviews, with an average rating of 42/42 The sites critical consensus reads, Though shot through with bitterness and sorrow, Robert Redfords directorial debut is absorbing and well-acted.      The film was a box office success, grossing $42 million in the United States and Canada  and approximately $42 million overseas  for a worldwide gross of $42 million.       ": null
    }
]