[
    {
        "   An organic acid is an ": null
    },
    {
        "organic compound": "organic compound"
    },
    {
        " with ": null
    },
    {
        "acid": "acid"
    },
    {
        "ic properties. The most common organic acids are the ": null
    },
    {
        "carboxylic acid": "carboxylic acid"
    },
    {
        "s, whose acidity is associated with their ": null
    },
    {
        "carboxyl group": "carboxyl group"
    },
    {
        "  –COOH. ": null
    },
    {
        "Sulfonic acid": "sulfonic acid"
    },
    {
        "s, containing the group  –SO 42 OH, are relatively stronger acids. Alcohols, with ": null
    },
    {
        "–OH": "hydroxyl group"
    },
    {
        ", can act as acids but they are usually very weak. The relative stability of the conjugate base of the acid determines its acidity. Other groups can also confer acidity, usually weakly: the ": null
    },
    {
        "thiol": "thiol"
    },
    {
        " group  –SH, the ": null
    },
    {
        "enol": "enol"
    },
    {
        " group, and the ": null
    },
    {
        "phenol": "phenol"
    },
    {
        " group. In biological systems, organic compounds containing these groups are generally referred to as organic acids.     A few common examples include:   ": null
    },
    {
        "Lactic acid": "lactic acid"
    },
    {
        " Acetic acid": "acetic acid"
    },
    {
        " Formic acid": "formic acid"
    },
    {
        " Citric acid": "citric acid"
    },
    {
        " Oxalic acid": "oxalic acid"
    },
    {
        " Uric acid": "uric acid"
    },
    {
        " Malic Acid": "malic acid"
    },
    {
        "       In general, organic acids are weak acids and do not dissociate completely in water, whereas the strong ": null
    },
    {
        "mineral acid": "mineral acid"
    },
    {
        "s do. Lower molecular mass organic acids such as ": null
    },
    {
        "formic": "formic acid"
    },
    {
        " and ": null
    },
    {
        "lactic acid": "lactic acid"
    },
    {
        "s are ": null
    },
    {
        "miscible": "miscibility"
    },
    {
        " in water, but higher molecular mass organic acids, such as ": null
    },
    {
        "benzoic acid": "benzoic acid"
    },
    {
        ", are insoluble in molecular form.     On the other hand, most organic acids are very soluble in organic solvents. ": null
    },
    {
        "p-Toluenesulfonic acid": "p-toluenesulfonic acid"
    },
    {
        " is a comparatively strong acid used in organic chemistry often because it is able to dissolve in the organic reaction solvent.     Exceptions to these solubility characteristics exist in the presence of other substituents that affect the polarity of the compound.       Simple organic acids like ": null
    },
    {
        "formic": "formic acid"
    },
    {
        " or ": null
    },
    {
        "acetic": "acetic acid"
    },
    {
        " acids are used for oil and gas well stimulation treatments. These organic acids are much less reactive with metals than are strong mineral acids like ": null
    },
    {
        "hydrochloric acid": "hydrochloric acid"
    },
    {
        " or mixtures of HCl and ": null
    },
    {
        "hydrofluoric acid": "hydrofluoric acid"
    },
    {
        " . For this reason, organic acids are used at high temperatures or when long contact times between acid and pipe are needed.     The ": null
    },
    {
        "conjugate base": "conjugate base"
    },
    {
        "s of organic acids such as ": null
    },
    {
        "citrate": "citric acid"
    },
    {
        " and ": null
    },
    {
        "lactate": "lactic acid"
    },
    {
        " are often used in biologically-compatible ": null
    },
    {
        "buffer solution": "buffer solution"
    },
    {
        "s.     Citric and oxalic acids are used as rust removal. As acids, they can dissolve the iron oxides, but without damaging the base metal as do stronger mineral acids. In the dissociated form, they may be able to ": null
    },
    {
        "chelate": "chelate"
    },
    {
        " the metal ions, helping to speed removal.     Biological systems create many more complex organic acids such as ": null
    },
    {
        " L -lactic": "lactic acid"
    },
    {
        ", ": null
    },
    {
        "citric": "citric acid"
    },
    {
        ", and ": null
    },
    {
        " D -glucuronic acids": "d-glucuronic acid"
    },
    {
        " that contain ": null
    },
    {
        "hydroxyl": "hydroxyl"
    },
    {
        " or ": null
    },
    {
        "carboxyl group": "carboxyl group"
    },
    {
        "s. Human blood and urine contain these plus organic acid degradation products of ": null
    },
    {
        "amino acids": "amino acids"
    },
    {
        ", ": null
    },
    {
        "neurotransmitters": "neurotransmitters"
    },
    {
        ", and intestinal bacterial action on food components. Examples of these categories are alpha-ketoisocaproic, vanilmandelic, and D -lactic acids, derived from ": null
    },
    {
        "catabolism": "catabolism"
    },
    {
        " of ": null
    },
    {
        " L -leucine": "leucine"
    },
    {
        " and ": null
    },
    {
        "epinephrine": "epinephrine"
    },
    {
        " by human tissues and catabolism of dietary carbohydrate by intestinal bacteria, respectively.               Organic acids are used in ": null
    },
    {
        "food preservation": "food preservation"
    },
    {
        " because of their effects on bacteria. The key basic principle on the mode of action of organic acids on bacteria is that non-dissociated organic acids can penetrate the bacteria cell wall and disrupt the normal physiology of certain types of bacteria that we call pH-sensitive, meaning that they cannot tolerate a wide internal and external pH gradient. Among those bacteria are  Escherichia coli ,  Salmonella  spp.,  C. perfringens ,  Listeria monocytogenes , and  Campylobacter  species.     Upon passive diffusion of organic acids into the bacteria, where the pH is near or above neutrality, the acids will dissociate and lower the bacteria internal pH, leading to situations that will impair or stop the growth of bacteria. On the other hand, the anionic part of the organic acids that cannot escape the bacteria in its dissociated form will accumulate within the bacteria and disrupt many metabolic functions, leading to osmotic pressure increase, incompatible with the survival of the bacteria.     It has been well demonstrated that the state of the organic acids is extremely important to define their capacity to inhibit the growth of bacteria, compared to undissociated acids.     ": null
    },
    {
        "Lactic acid": "lactic acid"
    },
    {
        " and its salts ": null
    },
    {
        "sodium lactate": "sodium lactate"
    },
    {
        " and ": null
    },
    {
        "potassium lactate": "potassium lactate"
    },
    {
        " are widely used as ": null
    },
    {
        "antimicrobial": "antimicrobial"
    },
    {
        "s in food products, in particular, meat and poultry such as ham and sausages. Applications for lactic acid.http://www.purac.com/purac_com/42cbf42d42dc42dafbd42cab42b42php       Organic acids have been used successfully in pig production for more than 42 years. Although less research has been done in poultry, organic acids have also been found to be effective in poultry production.     Organic acids are widely distributed in nature as normal constituents of plants or animal tissues. They are also formed through microbial fermentation of carbohydrates mainly in the large intestine. They are sometimes found in their sodium, potassium, or calcium ": null
    },
    {
        "salts": "salt"
    },
    {
        ", or even stronger double salts.     Organic acids added to feeds should be protected to avoid their dissociation in the crop and in the intestine and reach far into the gastrointestinal tract, where the bulk of the bacteria population is located.     From the use of organic acids in poultry and pigs, one can expect an improvement in performance similar to or better than that of antibiotic growth promoters, without the public health concern, a preventive effect on the intestinal problems like necrotic enteritis in chickens and  Escherichia coli  infection in young pigs. Also one can expect a reduction of the carrier state for Salmonella species and  Campylobacter ": null
    }
]