[
    {
        "           Orthodox Judaism is a collective term for the traditionalist branches of contemporary ": null
    },
    {
        "Judaism": "Judaism"
    },
    {
        ". ": null
    },
    {
        "Theologically": "Theology"
    },
    {
        ", it is chiefly defined by regarding the ": null
    },
    {
        "Torah": "Torah"
    },
    {
        ", both ": null
    },
    {
        "Written": "Torah"
    },
    {
        " and ": null
    },
    {
        "Oral": "Oral Torah"
    },
    {
        ", as literally ": null
    },
    {
        "revealed": "Revelation"
    },
    {
        " by God on ": null
    },
    {
        "Mount Sinai": "Biblical Mount Sinai"
    },
    {
        " and faithfully transmitted ever since. Orthodox Judaism therefore advocates a strict observance of Jewish Law, or  halakha , which is to be ": null
    },
    {
        "interpreted and determined": "Posek"
    },
    {
        " only according to traditional methods and in adherence to the continuum of received precedent through the ages. It regards the entire halakhic system as ultimately grounded in immutable revelation, essentially beyond external and historical influence. More than any theoretical issue, obeying the ": null
    },
    {
        "dietary": "Kosher"
    },
    {
        ", ": null
    },
    {
        "purity": "Tumah And Taharah"
    },
    {
        ", ethical, and other laws of halakha is the hallmark of Orthodoxy. Other key doctrines include belief in a future bodily ": null
    },
    {
        "resurrection of the dead": "Resurrection Of The Dead"
    },
    {
        ", divine reward and punishment for the righteous and the sinners, the ": null
    },
    {
        "Election of Israel": "Election Of Israel"
    },
    {
        " as a people bound by a ": null
    },
    {
        "covenant with God": "Mosaic Covenant"
    },
    {
        ", and an eventual ": null
    },
    {
        "Messianic Age": "Messianic Age"
    },
    {
        " ruled by a salvific ": null
    },
    {
        "Messiah": "Messiah In Judaism"
    },
    {
        "-King who will restore ": null
    },
    {
        "the Temple in Jerusalem": "Third Templeorthodox Judaism"
    },
    {
        ".     Orthodox Judaism is not a centralized denomination. Relations between its different subgroups are sometimes strained, and the exact limits of Orthodoxy are subject to intense debate. Very roughly, it may be divided between ": null
    },
    {
        "Haredi Judaism": "Haredi Judaism"
    },
    {
        " , which is more conservative and reclusive, and ": null
    },
    {
        "Modern Orthodox Judaism": "Modern Orthodox Judaism"
    },
    {
        ", which is relatively open to outer society. Each subgroup is itself formed of independent streams. They are almost uniformly exclusionist, regarding Orthodoxy as the only authentic form of Judaism and rejecting all competing non-Orthodox philosophies as illegitimate.     While adhering to traditional beliefs, the movement is a modern phenomenon. It arose as a result of the breakdown of the autonomous Jewish community since the 18th century, and was much shaped by a conscious struggle against the pressures of ": null
    },
    {
        "secularization": "Secularization"
    },
    {
        " and rival alternatives. The strictly observant and theologically aware Orthodox are a definite minority among all Jews, but there are also numerous semi- and non-practicing persons who are officially affiliated or personally identify with the movement. In total, Orthodox Judaism is the largest Jewish religious group, estimated to have over 2 million practicing adherents and at least an equal number of nominal members or self-identifying supporters.       The earliest known mention of the term Orthodox Jews was made in the  Berlinische Monatsschrift  in 1795. The word Orthodox was borrowed from the general German ": null
    },
    {
        "Enlightenment": "Age Of Enlightenment"
    },
    {
        " discourse, and used not to denote a specific religious group, but rather those Jews who opposed Enlightenment. During the early and mid-19th century, with the advent of the progressive movements among German Jews and especially early ": null
    },
    {
        "Reform Judaism": "Reform Judaism"
    },
    {
        ", the title Orthodox became the epithet of the traditionalists who espoused conservative positions on the issues raised by modernization. They themselves often disliked the alien, Christian name, preferring titles like Torah-true , and often declared they used it only for the sake of convenience. The Orthodox leader Rabbi ": null
    },
    {
        "Samson Raphael Hirsch": "Samson Raphael Hirsch"
    },
    {
        " referred to the conviction commonly designated as Orthodox Judaism ; in 1882, when Rabbi ": null
    },
    {
        "Azriel Hildesheimer": "Azriel Hildesheimer"
    },
    {
        " became convinced that the public understood that his philosophy and ": null
    },
    {
        "Liberal Judaism": "Reform Judaism"
    },
    {
        " were radically different, he removed the word Orthodox from the name of his ": null
    },
    {
        "Hildesheimer Rabbinical Seminary": "Hildesheimer Rabbinical Seminary"
    },
    {
        ". By the 1920s, the term became common and accepted even in Eastern Europe, and remains as such.      Orthodoxy perceives itself ideologically as the only authentic continuation of Judaism throughout the ages, as it was until the crisis of modernity; in many basic aspects, such as belief in the unadulterated divinity of the Torah or strict adherence to precedent and tradition when ruling in matters of Jewish Law, Orthodoxy is indeed so. Its progressive opponents often shared this view, regarding it as a fossilized remnant of the past and lending credit to their own rivals ideology. Yosef Salmon, Aviezer Ravitzky, Adam Ferziger. Orthodox Judaism: New Perspectives . The Hebrew University Magnes Press, 2006. pp. 5-22, etc. Thus, the term Orthodox is often used generically to refer to traditional synagogues, prayer rites, observances, and so forth.     However, academic research has taken a more nuanced approach, noting that the formation of Orthodox ideology and organizational frameworks was itself a product of modernity. It was brought about by the need to defend and buttress the very concept of tradition, in a world where it was not self-evident anymore. When deep secularization and the dismantlement of communal structures uprooted the old order of Jewish life, traditionalist elements united to form groups which had a distinct self-understanding. This, and all that it entailed, constituted a great change, for the Orthodox had to adapt to the new circumstances no less than anyone else; they developed novel, sometimes radically so, means of action and modes of thought. Orthodoxization was a contingent process, drawing from local circumstances and dependent on the extent of threat sensed by its proponents: a sharply-delineated Orthodox identity appeared in Central Europe, in Germany and Hungary, by the 1860s; a less stark one emerged in Eastern Europe during the ": null
    },
    {
        "interwar period": "Interwar Period"
    },
    {
        ". Among the ": null
    },
    {
        "Jews of the Muslim lands": "History Of The Jews Under Muslim Rule"
    },
    {
        ", similar processes on a large scale only occurred around the 1970s, after they immigrated to Israel. Orthodoxy is often described as extremely conservative, ossifying a once-dynamic tradition due to the fear of legitimizing change. While this was not rarely true, its defining feature was not the forbidding of change and freezing Jewish heritage in its tracks, but rather the need to adapt to being but one segment of Judaism in a modern world inhospitable to traditional practice. Orthodoxy developed as a variegated spectrum of reactions – as termed by ": null
    },
    {
        "Benjamin Brown": "Benjamin Brown"
    },
    {
        " – involving in many cases much accommodation and leniency. Scholars nowadays, mainly since the mid-1980s, research Orthodox Judaism as a field in itself, examining how the need to confront modernity shaped and changed its beliefs, ideologies, social structure, and halakhic rulings, making it very much distinct from traditional Jewish society. See for example: Benjamin Brown, . In: Aviezer Ravitzky, Shas: Cultural and Ideological Perspectives, ": null
    },
    {
        "Am Oved": "Am Oved"
    },
    {
        ", 2006.         A definite and conclusive ": null
    },
    {
        "credo": "Credo"
    },
    {
        " was never formulated in Judaism; the very question whether it contains any equivalent of ": null
    },
    {
        "dogma": "Dogma"
    },
    {
        " is a matter of intense scholarly controversy. Some researchers attempted to argue that the importance of daily practice and punctilious adherence to halakha relegated theoretical issues to an ancillary status. Others dismissed this view entirely, citing the debates in ancient rabbinic sources which castigated various ": null
    },
    {
        "heresies": "Heresy In Judaism"
    },
    {
        " with little reference to observance. However, while lacking a uniform doctrine, Orthodox Judaism is basically united in affirming several core beliefs, disavowal of which is considered major ": null
    },
    {
        "blasphemy": "Blasphemy"
    },
    {
        ". As in other aspects, Orthodox positions reflect the mainstream of traditional ": null
    },
    {
        "Rabbinic Judaism": "Rabbinic Judaism"
    },
    {
        " through the ages.     Attempts to codify these beliefs were undertaken by several medieval authorities, including ": null
    },
    {
        "Saadia Gaon": "Saadia Gaon"
    },
    {
        " and ": null
    },
    {
        "Joseph Albo": "Joseph Albo"
    },
    {
        ". Each composed his own creed. Yet the ": null
    },
    {
        "13 principles": "13 Principles Of Faith"
    },
    {
        " expounded by ": null
    },
    {
        "Maimonides": "Maimonides"
    },
    {
        " in his  Commentary on the Mishna , authored in the 1160s, eventually proved the most widely accepted. Various points – for example, Albo listed merely three fundamentals, and did not regard the ": null
    },
    {
        "Messiah": "Messiah In Judaism"
    },
    {
        " as a key tenet – the exact formulation, and the status of disbelievers were contested by many of Maimonides contemporaries and later sages. Many of their detractors did so from a maximalist position, arguing that the entire corpus of the Torah and the sayings of ancient sages was of canonical stature, not just certain selected beliefs. But in recent centuries, the 13 Principles became standard, and are considered binding and cardinal by Orthodox authorities in a virtually universal manner. See, for example: ": null
    },
    {
        "Marc B. Shapiro": "Marc B. Shapiro"
    },
    {
        ". The Limits of Orthodox Theology: Maimonides Thirteen Principles Reappraised. Littman Library of Jewish Civilization . pp. 1–14.     During the Middle Ages, two systems of thought competed for theological primacy, their advocates promoting them as explanatory foundations for observance of the Law. One was the rationalist-philosophic school, which endeavored to present all commandments as serving higher moral and ethical purposes, while the other was the mystical tradition, exemplified in ": null
    },
    {
        "Kabbalah": "Kabbalah"
    },
    {
        ", which assigned each rite with a role in the hidden dimensions of reality. Sheer obedience, without much thought and derived from faithfulness to ones community and ancestry, was believed fit only for the common people, while the educated classes chose either of the two schools. In the modern era, the prestige of both suffered severe blows, and naive faith became popular. At a time when excessive contemplation in matters of belief was associated with secularization, luminaries such as ": null
    },
    {
        "Yisrael Meir Kagan": "Yisrael Meir Kagan"
    },
    {
        " stressed the importance of simple, unsophisticated commitment to the precepts passed down from the Beatified Sages. This is still the standard in the ultra-Orthodox world. ": null
    },
    {
        "Benjamin Brown": "Benjamin Brown"
    },
    {
        ", https://www.academia.edu/36068205 The Comeback of Simple Faith - The Ultra-Orthodox Concept of Religious Belief and Its Rise in the 19th Century.     In more open Orthodox circles, attempts were made to formulate philosophies that would confront modern sensibilities. Notable examples are the ": null
    },
    {
        "Hegel": "Hegel"
    },
    {
        "ian-Kabbalistic theology of ": null
    },
    {
        "Abraham Isaac Kook": "Abraham Isaac Kook"
    },
    {
        ", who viewed history as progressing toward a messianic redemption in a dialectic fashion which required the strengthening of heretical forces, or the existentialist thought of ": null
    },
    {
        "Joseph B. Soloveitchik": "Joseph B. Soloveitchik"
    },
    {
        ", who was deeply influenced by ": null
    },
    {
        "Neo-Kantian": "Neo-Kantian"
    },
    {
        " ideals. On the fringes of Orthodoxy, thinkers who were at least sociologically part of it, ventured toward radical models. These, like the ": null
    },
    {
        "apopathic": "Apophatic Theology"
    },
    {
        " views of ": null
    },
    {
        "Yeshayahu Leibowitz": "Yeshayahu Leibowitz"
    },
    {
        " or the feminist interpretation of ": null
    },
    {
        "Tamar Ross": "Tamar Ross"
    },
    {
        ", had little to no influence on the mainstream.          The basic tenets of Orthodoxy, drawn from ancient sources like the Talmud as well as later sages, prominently and chiefly include the attributes of ": null
    },
    {
        "God in Judaism": "God In Judaism"
    },
    {
        ": one and indivisible, preceding all creation which he alone brought into being, eternal, omniscient, omnipotent, absolutely incorporeal, and beyond human reason. This basis is evoked in many foundational texts, and is repeated often in the daily prayers, such as in Judaisms creed-like  Shema Yisrael : Hear, O Israel, the Lord is our God, the Lord is One.     Maimonides delineated this understanding of a ": null
    },
    {
        "monotheistic": "Monotheistic"
    },
    {
        ", ": null
    },
    {
        "personal God": "Personal God"
    },
    {
        " in the opening six articles of his thirteen. The six concern Gods status as the sole creator, his oneness, his impalpability, that he is first and last, that God alone, and no other being, may be worshipped, and that he is omniscient. The supremacy of God of Israel is even applied on non-Jews, who, according to most rabbinic opinions, are banned from the worship of other deities, though they are allowed to ": null
    },
    {
        "associate": "Shituf"
    },
    {
        " lower divine beings in their faith in God      The ": null
    },
    {
        "utter imperceptibility": "Apophatic Theology"
    },
    {
        " of God, considered as beyond human reason and only reachable through what he chose to reveal, was emphasized among others in the ": null
    },
    {
        "ancient ban on making any image of him": "Thou Shalt Not Make Unto Thee Any Graven Image"
    },
    {
        ". Maimonides and virtually all sages in his time and since then also stressed that the creator is incorporeal, lacking any semblance of a body ; while almost taken for granted since the Middle Ages, Maimonides and his contemporaries noted that anthropomorphic conceptions of God were quite common in their time.     The medieval tension between Gods transcendence and ": null
    },
    {
        "equanimity": "Apatheia"
    },
    {
        ", on the one hand, and his contact and interest in his creation, on the other, found its most popular resolution in the esoteric  Kabbalah . The Kabbalists asserted that while God himself is beyond the universe, he progressively unfolds into the created realm via a series of inferior emanations, or  sefirot , each a refraction of the perfect godhead. While widely received, this system also proved contentious and some authorities lambasted it as a threat to Gods unity. Adele Berlin, The Oxford Dictionary of the Jewish Religion. ": null
    },
    {
        "Oxford University Press": "Oxford University Press"
    },
    {
        " . pp. 294-297 . In modern times it is upheld, at least tacitly, in many traditionalist Orthodox circles, while Modern Orthodoxy mostly ignores it without confronting the notion directly.       The defining doctrine of Orthodox Judaism is the belief that the ": null
    },
    {
        "Torah": "Torah"
    },
    {
        " , both the ": null
    },
    {
        "Written scripture of the Pentateuch": "Written Torah"
    },
    {
        " and the ": null
    },
    {
        "Oral tradition": "Oral Torah"
    },
    {
        " explicating it, was revealed by God to ": null
    },
    {
        "Moses": "Moses"
    },
    {
        " on Mount Sinai, and that it was transmitted faithfully from Sinai in an unbroken chain ever since. One of the foundational texts of rabbinic literature is the list opening the ": null
    },
    {
        "Ethics of the Fathers": "Ethics Of The Fathers"
    },
    {
        ", enumerating the sages who received and passed on the Torah, from Moses through ": null
    },
    {
        "Joshua": "Joshua"
    },
    {
        ", the ": null
    },
    {
        "Elders": "Moses Elects Seventy Elders"
    },
    {
        ", and ": null
    },
    {
        "Prophets": "Hebrew Prophet"
    },
    {
        ", and then onward until ": null
    },
    {
        "Hillel the Elder": "Hillel The Elder"
    },
    {
        " and ": null
    },
    {
        "Shammai": "Shammai"
    },
    {
        ". This core belief is referred to in classical sources as The Law/Teaching is from the Heavens .     The basic philosophy of Orthodoxy is that the body of revelation is total and complete; its interpretation and application under new circumstances, required of scholars in every generation, is conceived as an act of inferring and elaborating based on already prescribed methods, not of innovation or addition. One clause in the ": null
    },
    {
        "Jerusalem Talmud": "Jerusalem Talmud"
    },
    {
        " asserts that anything which a veteran disciple shall teach was already given at Sinai; and a story in the ": null
    },
    {
        "Babylonian Talmud": "Babylonian Talmud"
    },
    {
        " claims that upon seeing the immensely intricate deduction of future ": null
    },
    {
        "Rabbi Akiva": "Rabbi Akiva"
    },
    {
        " in a vision, Moses himself was at loss, until Akiva proclaimed that everything he teaches was handed over to Moses. The Written and Oral Torah are believed to be intertwined and mutually reliant, for the latter is a source to many of the divine commandments, and the text of the Pentateuch is seen as incomprehensible in itself. Gods will may only be surmised by appealing to the Oral Torah revealing the texts allegorical, ": null
    },
    {
        "anagogical": "Anagogical"
    },
    {
        ", or ": null
    },
    {
        "tropological": "Tropological"
    },
    {
        " meaning, not by literalist reading.     Lacunae in received tradition or disagreements between early sages are attributed to disruptions, especially persecutions which caused to that the Torah was forgotten in Israel — according to rabbinic lore, these eventually compelled the legists to write down the Oral Law in the ": null
    },
    {
        "Mishna": "Mishna"
    },
    {
        " and ": null
    },
    {
        "Talmud": "Talmud"
    },
    {
        ". Yet, the wholeness of the original divine message, and the reliability of those who transmitted it through the ages, are axiomatic. One of the primary intellectual exercises of Torah scholars is to locate discrepancies between Talmudic or other passages, and then demonstrate by complex logical steps that there is actually no contradiction. Michael A. Meyer, Response to Modernity: A History of the Reform Movement in Judaism. Wayne State University Press . pp. 3-6. Like other traditional, ": null
    },
    {
        "non-liberal religions": "Liberal Religion"
    },
    {
        ", Orthodox Judaism considers revelation as propositional, explicit, verbal and unambiguous, that may serve as a firm source of authority for a set of religious commandments. Modernist understandings of revelation as a subjective, humanly-conditioned experience are rejected by the Orthodox mainstream, Keith Ward, Religion and Revelation: A Theology of Revelation in the Worlds Religions. Oxford University Press, 1994. pp. 85, 115, 209; Barry Freundel, Contemporary Orthodox Judaisms Response to Modernity. KTAV Publishing House, 2004. pp. 29, 35 etc. though some thinkers at the end of the liberal wing did try to promote such views, finding virtually no acceptance from the establishment. Solomon Schimmel, The Tenacity of Unreasonable Beliefs: Fundamentalism and the Fear of Truth. ": null
    },
    {
        "Oxford University Press": "Oxford University Press"
    },
    {
        ", 2008. pp. 202-203.     An important ramification of Torah min HaShamayim in modern times is the reserved, and often totally rejectionist, attitude of Orthodoxy toward the historical-critical method, particularly ": null
    },
    {
        "higher criticism": "Higher Criticism"
    },
    {
        " of the Bible. A refusal by rabbis to significantly employ such tools in determining halakhic decisions, and insistence on traditional methods and the need for consensus and continuity with past authorities, is a demarcation line separating the most liberal-leaning Orthodox rabbinic circles from the most right-wing non-Orthodox ones. Salmon, Ravitzky, Ferziger. New Perspectives, pp. 115-119.     While the Sinaitic event is perceived as the supreme and binding act of revelation, it is not the only one. Rabbinic tradition acknowledges matter handed down from the Prophets, as well as ": null
    },
    {
        "announcements from God later on": "Bat Qol"
    },
    {
        ". Secret lore or  Kabbalah , allegedly revealed to illustrious figures in the past and passed on through elitist circles, is widely esteemed. While not a few prominent rabbis deplored Kabbalah, and considered it a late forgery, most generally accepted it as legitimate. However, its status in determining normative halakhic decision-making, which is binding for the entire community and not just intended for spiritualists who voluntarily adopt kabbalistic strictures, was always highly controversial. Leading ": null
    },
    {
        "decisors": "Posek"
    },
    {
        " openly applied criteria from Kabbalah in their rulings, while others did so only inadvertently, and many denied it any role in normative halakha. A closely related mystical phenomenon is the belief in  Magidim , supposed dreamlike apparitions or visions, that may inform those who experience them with certain divine knowledge. For a short introduction: ": null
    },
    {
        "Jacob Katz": "Jacob Katz"
    },
    {
        ", https://www.jstor.org/stable/24191185 Post-Zoharic Relations between Halakhah and Kabbalah. Daat, A Journal of Jewish Philosophy & Kabbalah, 1980. See also: Shlomo Brody, http://text.rcarabbis.org/halakha-and-kabbalah-rabbi-joseph-karos-shulchan-aruch-and-magid-mesharim-by-shlomo-brody Halakha and Kabbalah: Rabbi Joseph Karos Shulchan Aruch and Magid Mesharim, ": null
    },
    {
        "RCA": "Rabbinical Council Of America"
    },
    {
        " Rabbis blog, 2011.          Belief in a future Messiah is central to Orthodox Judaism. According to this doctrine, a king will arise from King Davids lineage, and will bring with him signs such as the restoration of the Temple, peace, and universal acceptance of God.  The Messiah will embark on a quest to gather all Jews to the Holy Land, will proclaim prophethood, and will restore the Davidic Monarchy.     Classical Judaism did incorporate a tradition of belief in the ": null
    },
    {
        "resurrection of the dead": "Resurrection Of The Dead"
    },
    {
        ".   There is scriptural basis for this doctrine, quoted by the Mishnah:  All Israelites have a share in the World-to-Come, as it is written: And your people, all of them righteous, Shall possess the land for all time; They are the shoot that I planted, My handiwork in which I glory . The Mishnah also brands as heretics any Jew who rejects the doctrine of resurrection or its origin from the Torah.  Those who deny the doctrine are deemed to receive no share in the World-to-Come.  The Pharisees believed in both a bodily resurrection and the immortality of the soul. They also believed that acts in this world would effect the state of life in the next world.   The Mishnah Sahendrin 10 clarifies that only those who follow the correct theology will have a place in the World to Come.      There are other passing references to the afterlife in mishnaic tractates. A particularly important one in the Berakhot informs that the Jewish belief in the afterlife was established long before the compilation of the Mishnah.  Biblical tradition categorically mentions ": null
    },
    {
        "Sheol": "Sheol"
    },
    {
        " sixty-five times. It is described as an underworld containing the gathering of the dead with their families.  ": null
    },
    {
        "Numbers": "Book Of Numbers"
    },
    {
        " 16:30 states that ": null
    },
    {
        "Korah": "Korah"
    },
    {
        " went into Sheol alive, to describe his death in divine retribution.  The deceased who reside in Sheol have a nebulous existence and there is no reward or punishment in Sheol, which is represented as a dark and gloomy place. But a distinction is made for kings who are said to be greeted by other kings when entering Sheol.  Biblical poetry suggests that resurrection from Sheol is possible.  Prophetic narratives of resurrection in the Bible have been labelled as external cultural influence by some scholars.      The Talmudic discourse expanded on the details of the World to Come. This was to motivate Jewish compliance with their religious codes.  In brief, the righteous will be rewarded with a place in ": null
    },
    {
        "Gan Eden": "Gan Eden"
    },
    {
        ", the wicked will be punished in ": null
    },
    {
        "Gehinnom": "Gehinnom"
    },
    {
        ", and the resurrection will take place in the Messianic age. The sequence of these events is unclear.  Rabbis have supported the concept of resurrection with plenteous Biblical citations, and have shown it as a sign of Gods omnipotence.          A relatively thorough observance of halakha – rather than any theological and doctrinal matters, which are often subject to diverse opinions – is the concrete demarcation line separating Orthodox Jews from other Jewish movements. As noted both by researchers and communal leaders, the Orthodox subgroups have a sense of commitment towards the Law which is rarely manifest outside the movement, perceiving it as seriously binding. Salmon, Ravitzky, Ferziger. New Perspectives, pp. 121-122.       The halakha, like any jurisprudence, is not a definitive set of rules, but rather an ever-expanding discourse: Its authority is derived from the belief in divine revelation, but interpretation and application are done by the rabbis, who base their mandate on biblical verses such as and thou shalt observe to do according to all that they inform thee. From ancient to modern times, the rabbinic discourse was wrought with controversy  and sages disagreeing upon various points of the law. The ": null
    },
    {
        "Talmud": "Talmud"
    },
    {
        " itself is mainly a record of such disputes. Traditional belief, maintained by the Orthodox today, regards such disagreement as flowing naturally from the divinity of Jewish Law, which is presumed to potentially contain a solution for any possible predicament. As long as both contesting parties base their arguments according to received hermeneutics and precedents and are driven by sincere faith, both these and those are the words of the Living God . See also: Michael Rosensweig, https://www.jstor.org/stable/23260661 Elu va-Elu Divre Elokim Hayyim: Halakhic Pluralism and Theories of Controversy. Tradition: A Journal of Orthodox Jewish Thought. Spring 1992. Majority opinions were accepted and canonized, though many old disagreements remain and new ones appear ceaselessly. This plurality of opinion allows ": null
    },
    {
        "decisors": "Posek"
    },
    {
        ", rabbis tasked with determining the legal stance in subjects without precedent, to weigh between a range of options, based on methods derived from earlier authorities. The most basic form of halakhic discourse is the ": null
    },
    {
        "responsa literature": "History Of Responsa In Judaism"
    },
    {
        ", in which rabbis answered questions directed from commoners or other rabbis, thus setting precedent for the next generations. See also: Jeffrey R. Woolf, https://www.jstor.org/stable/23260884 The Parameters of Precedent in Pesak Halakha. Tradition: A Journal of Orthodox Jewish Thought. Summer 1993.     The systems oldest and most basic sources are the ": null
    },
    {
        "Mishna": "Mishna"
    },
    {
        " and the two ": null
    },
    {
        "Talmud": "Talmud"
    },
    {
        "s, to which were added the later commentaries and novellae of the ": null
    },
    {
        "Geonim": "Geonim"
    },
    {
        ". Those were followed by the great codes which sought to assemble and standardize the laws, including ": null
    },
    {
        "Isaac Alfasis": "Isaac Alfasi"
    },
    {
        "  Hilchot HaRif , Maimonides  Mishneh Torah , and ": null
    },
    {
        "Jacob ben Ashers": "Jacob Ben Asher"
    },
    {
        "  Arbaah Turim . One of the latest and most authoritative codifications is the 1565  Shulchan Aruch , or Set Table , which gained a canonical status and became almost synonymous, in popular parlance, with the halakhic system itself – though no later authority accepted it in its entirety , and it was immediately contested or re-interpreted by various commentaries, most prominently the ": null
    },
    {
        "gloss": "Gloss"
    },
    {
        " written by Rabbi ": null
    },
    {
        "Moses Isserles": "Moses Isserles"
    },
    {
        " named HaMapah. Halakhic literature continued to expand and evolve, with new authoritative guides being compiled and canonized, until the popular works of the 20th century like the  Mishnah Berurah .     The most important distinction within halakha is between all laws derived from Gods revelation ; and those enacted by human authorities , who are believed traditionally to have been empowered by God to legislate when necessary. The former are either directly understood, derived in various hermeneutical means or attributed to commandments orally handed down to Moses. The authority to pass measures dRabanan is itself subject to debate – for one, Maimonides stated that absolute obedience to rabbinic decrees is stipulated by the verse and thou shalt observe, while ": null
    },
    {
        "Nachmanides": "Nachmanides"
    },
    {
        " argued that such severeness is unfounded – though such enactments are accepted as binding, albeit less than the divine commandments. A Talmudic maxim states that, when in doubt regarding a matter dOraita, one must rule strenuously, and leniently when it concerns dRabanan. Many arguments in halakhic literature revolve over whether any certain detail is derived from the former or the latter source, and under which circumstances. Commandments or prohibitions dRabanan, though less stringent than dOraita ones, are an equally important facet of Jewish law. They range from the 2nd century BC establishment of ": null
    },
    {
        "Hanukkah": "Hanukkah"
    },
    {
        ", to the bypassing on the Biblical ban on charging interest via the ": null
    },
    {
        "Prozbul": "Prozbul"
    },
    {
        ", and up to the 1950 standardization of marital rules by the ": null
    },
    {
        "Chief Rabbinate of Israel": "Chief Rabbinate Of Israel"
    },
    {
        " which forbade polygamy and ": null
    },
    {
        "levirate marriage": "Yibbum"
    },
    {
        " even in communities which still practiced those. For a good introduction to halakha see: Michael J. Broyde, Ira Bedzow. The Codification of Jewish Law: An Introduction to the Jurisprudence of the Mishna Berura Academic Studies Press, 2014. pp. 1-6, 368-370.     Apart from these, a third major component buttressing Orthodox practice is local or familial custom,  minhag . The development and acceptance of customs as binding, more than disagreements between decisors, is the main factor accounting for the great diversity in matters of practice across geographic or ethnic lines. While the reverence accorded to minhag across rabbinic literature is far from uniform – ranging from positions like a custom may uproot halakha to wholly dismissive attitudes – For example: Benjamin Brown, https://www.academia.edu/36530833/ The Gaon of Vilna, the Hatam Sofer and the Hazon Ish - Minhag and the Crisis of Modernity. In: The Hazon Ish: Halakhist, Believer and Leader of the Haredi Revolution. Magness Press, 2011. it was generally accepted as binding by the scholars, and more importantly, drew its power from popular adherence and routine.     The most important aspect of minhag is in the disparities between various ": null
    },
    {
        "Jewish ethnic": "Jewish Ethnic Groups"
    },
    {
        " or communal groups, which also each possess a distinctive tradition of halakhic rulings, stemming from the opinions of local rabbis. ": null
    },
    {
        "Ashkenazim": "Ashkenazim"
    },
    {
        ", ": null
    },
    {
        "Sephardim": "Sephardim"
    },
    {
        ", ": null
    },
    {
        "Teimanim": "Yemenite Jews"
    },
    {
        ", and others have different ": null
    },
    {
        "prayer rites": "Nusach"
    },
    {
        ", somewhat different ": null
    },
    {
        "kosher": "Kosher"
    },
    {
        " emphases , and numerous other points of distinction. So do, for example, ": null
    },
    {
        "Hasidic Jews": "Hasidic Jews"
    },
    {
        " and ": null
    },
    {
        "non-Hasidic": "Misnagdim"
    },
    {
        " ones, though both originate from Eastern Europe.     Eating in the Succah on ": null
    },
    {
        "Shemini Atzeret": "Shemini Atzeret"
    },
    {
        " outside of Israel  is an area where minhag varies; likewise, how to accommodate the idea of eating some dairy on Shavuos.  The influence of custom even elicited the complaint of scholars who noted that the common masses observe minhag, yet ignore important divine decrees.       Rabbinic leadership, assigned with implementing and interpreting the already accumulated tradition, changed considerably in recent centuries, marking a major difference between Orthodox and pre-modern Judaism. Since the demise of the ": null
    },
    {
        "Geonim": "Geonim"
    },
    {
        " who led the Jewish world up to 1038, halakha was adjudicated locally, and the final arbiter was mostly the communal rabbi, the Mara dAthra . He was responsible to judicially instruct all members of his community. The emancipation and modern means of transport and communication all jointly made this model untenable. Aaron Kirschenbaum, https://www.jstor.org/stable/23260883 Mara de-Atra: A Brief Sketch. Tradition: A Journal of Orthodox Jewish Thought. Summer 1993. While Orthodox communities, especially the more conservative ones, have rabbis who technically fill this capacity, the public generally follows well-known luminaries whose authority is not limited by geography, and based on reverence and peer pressure more than the now-defunct legal coercion of the old community. These may be either popular ": null
    },
    {
        "chairs of talmudic academies": "Rosh Yeshiva"
    },
    {
        ", renowned ": null
    },
    {
        "decisors": "Posek"
    },
    {
        " and, in the ": null
    },
    {
        "Hasidic": "Hasidic"
    },
    {
        " world, hereditary  rebbe s.     Their influence varies considerably: In conservative Orthodox circles, mainly ultra-Orthodox  ones, rabbis possess strong authority and exercise their leadership often. Bodies such as the ": null
    },
    {
        "Council of Torah Sages": "Council Of Torah Sages"
    },
    {
        ", ": null
    },
    {
        "Council of Torah Luminaries": "Moetzet Chachmei Hatorah"
    },
    {
        ", the ": null
    },
    {
        "Central Rabbinical Congress": "Central Rabbinical Congress"
    },
    {
        ", and the ": null
    },
    {
        "Orthodox Council of Jerusalem": "Orthodox Council Of Jerusalem"
    },
    {
        " are all considered, at least in theory, as the supreme arbiters in their respective communities. In the more liberal Orthodox sectors, rabbis are revered and consulted, but rarely exert such direct control.       Orthodox Judaism emphasizes practicing rules of ": null
    },
    {
        "kashrut": "Kashrut"
    },
    {
        ", ": null
    },
    {
        "Shabbat": "Shabbat"
    },
    {
        ", ": null
    },
    {
        "family purity": "Family Purity"
    },
    {
        ", and tefilah .     Many Orthodox Jews can be identified by their manner of dress and family lifestyle. Orthodox men and women dress modestly by keeping most of their skin covered. Married women cover their hair, with either scarves , ": null
    },
    {
        "snoods": "Snood"
    },
    {
        ", hats, or wigs.     Orthodox men are expected to wear a ritual fringe called ": null
    },
    {
        "Tzitzit": "Tzitzit"
    },
    {
        ", and the donning of a head-covering for males at all times skullcap  is a well-known attribute distinguishing Orthodox Jews. Many men grow beards, and Haredi men wear black hats with a skullcap underneath and suits. Modern Orthodox Jews are sometimes indistinguishable in their dress from general society, although they, too, wear kippahs and tzitzit; additionally, on Shabbat, Modern Orthodox men wear suits and dress pants, while women wear fancier dresses or blouses.     Orthodox Jews also follow the laws of ": null
    },
    {
        "negiah": "Negiah"
    },
    {
        ", which means touch. Orthodox men and women do not engage in physical contact with those of the opposite sex outside of their spouse, or immediate family members . Kol Isha  is the prohibition records the prohibition of Kol Isha. of a womans voice to a man .      Doorposts have a  mezuzah ; separate sinks for meat and dairy have become increasingly common.             Orthodox Judaism lacks any central framework or a common, authoritative leadership. It is not a ": null
    },
    {
        "denomination": "Religious Denomination"
    },
    {
        " in the structural sense, but a variegated spectrum of groups, united in broadly affirming several matters of belief and practice, which also share a consciousness and a common discourse. Individual rabbis may, and often do, gain respect across boundaries, especially recognized ": null
    },
    {
        "decisor": "Posek"
    },
    {
        "s, but each community eventually obeys or reveres its own immediate leaders . Apart from this inherent plurality, the limits and boundaries of Orthodoxy are also a matter of great controversy. Indeed, the attempt to offer a definition that would encompass all communities and subgroups challenges scholars. Even the moderately conservative subgroups hotly criticize the more liberal ones for deviation from what they consider as inviolable principles, while strict hard-liners merely dismiss the latter as non-Orthodox. Contentious topics range from the abstract and theoretical, like the attitude to the historical-critical study of scripture, to the mundane and pressing, such as modesty rules for women and girls.     As in any other broad religious movement, there is an intrinsic tension between the ideological and the sociological dimensions of Orthodox Judaism – while the leading elites and intellectuals define adherence in theoretical terms, the masses are inducted via societal, familial, and institutional affiliation. Rank-and-file members may often neither be strictly observant nor fully accept the tenets of faith. Salmon, Ravitzky, Ferziger. New Perspectives, pp. 25-26, 76, 116-119, 154-156. For an online source: Zev Eleff, https://www.thelehrhaus.com/scholarship/the-vanishing-non-observant-orthodox-jew/ The Vanishing Non-Observant Orthodox Jew. Lehrhaus, 8 June 2017.            Professors ": null
    },
    {
        "Daniel Elazar": "Daniel Elazar"
    },
    {
        " and Rela Mintz Geffen, according to calculations made around 1990, assumed in 2012 that there were at least 2,000,000 observant Orthodox Jews worldwide, and at least 2,000,000 additional nominal members and supporters who were identifying with the movement. These figures made Orthodoxy the largest Jewish religious denomination. Originally, Elazar produced an even higher estimate when he considered association by default and assumed higher affiliation rates, reaching a maximum of 5,500,000 that may be considered involved with Orthodoxy. ": null
    },
    {
        "Daniel J. Elazar": "Daniel J. Elazar"
    },
    {
        ", Rela Mintz Geffen, The Conservative Movement in Judaism: Dilemmas and Opportunities. ": null
    },
    {
        "SUNY Press": "Suny Press"
    },
    {
        " . pp. 105-106; Daniel J. Elazar, http://www.jcpa.org/dje/articles2/demographics.htm How Strong is Orthodox Judaism -- Really? The Demographics of Jewish Religious Identification. ": null
    },
    {
        "Jerusalem Center for Public Affairs": "Jerusalem Center For Public Affairs"
    },
    {
        " .     In the ": null
    },
    {
        "State of Israel": "State Of Israel"
    },
    {
        ", where the total Jewish population is about 6.5 million, 22% of all Jewish respondents to a 2016 ": null
    },
    {
        "PEW": "Pew Research Center"
    },
    {
        " survey declared themselves as observant Orthodox . 29% described themselves as ": null
    },
    {
        "traditional": "Masortim"
    },
    {
        " , a label largely implying little observance, but identification with Orthodoxy. http://www.pewforum.org/2016/03/08/israels-religiously-divided-society/ Israel’s Religiously Divided Society, PEW Research Center, 8 March 2016. The ": null
    },
    {
        "second largest Orthodox concentration is in the United States": "List Of Orthodox Jewish Communities In The United States"
    },
    {
        ", mainly in the ": null
    },
    {
        "Northeast": "Northeastern United States"
    },
    {
        " and specifically in ": null
    },
    {
        "New York": "New York"
    },
    {
        " and ": null
    },
    {
        "New Jersey": "New Jersey"
    },
    {
        ". A 2013 PEW survey found that 10% of respondents identify as Orthodox, in a total Jewish population of at least 5.5 million. 3% were Modern Orthodox, 6% were ultra-Orthodox, and 1% were other  http://www.pewforum.org/2013/10/01/jewish-american-beliefs-attitudes-culture-survey/ A Portrait of Jewish Americans, PEW Research Center, 1 October 2013. In Britain, of 79,597 households with at least one Jewish member that held synagogue membership in 2016, 66% affiliated with Orthodox synagogues: 53% in centrist Orthodox , and 13% in strictly Orthodox . Donatella Casale Mashiah and Jonathan Boyd. https://www.jpr.org.uk/documents/Synagogue_membership_in_the_United_Kingdom_in_2016.pdf Synagogue membership in the United Kingdom in 2016. Institute for Jewish Policy Research, July 2017      High ": null
    },
    {
        "birth rates": "Birth Rate"
    },
    {
        "are an important aspect of Orthodox demographics: They are the most reproductive of all Jews, and ultra-Orthodox communities have some of the highest rates in the world, with 6 children per an average household. Non-existent levels of intermarriage also contribute to their growing share in the worlds Jewish population. While American Orthodox are but 10% of all Jews, among children, their share rises immensely: An estimated 61% of Jewish children in New York belong to Orthodox households, 49% to ultra-Orthodox. Similar patterns are observed in Britain and other countries. With present trends sustained, Orthodox Jews are projected to numerically dominate British Jewry by 2031, and American Jewry by 2058. https://forward.com/news/402663 Orthodox To Dominate American Jewry In Coming Decades As Population Booms, ": null
    },
    {
        "The Forward": "The Forward"
    },
    {
        ", 12 June 2018; https://www.independent.co.uk/news/uk/home-news/haredi-half-of-britain-s-jews-will-soon-be-strictly-orthodox-says-new-study-a6696046.html Haredi: Half of Britains Jews will soon be strictly Orthodox, ": null
    },
    {
        "The Independent": "The Independent"
    },
    {
        ", 15 October 2015. See also: http://jppi.org.il/uploads/Haredi_Demography_The_United_States_and_the_United_Kingdom.pdf Haredi Demography – The United States and the United Kingdom, ": null
    },
    {
        "JPPI": "Jppi"
    },
    {
        ". However, their growth is balanced by large numbers of members leaving their communities and observant lifestyle. Among the 2013 PEW respondents, 17% of those under 30 who were raised Orthodox disaffiliated . It is estimated that over 20% of those raised ": null
    },
    {
        "religious Zionist": "Religious Zionist"
    },
    {
        " in Israel disaffiliate, and greater numbers adopt a secularized lifestyle and define themselves as living on the spectrum . Loose observance among young adults is common even when they retain formal affiliation.       Orthodox Judaism may be categorized according to varying criteria. The most recognizable sub-group are the  Haredim  , also known as ultra-Orthodox , strictly Orthodox , and the like. They form the most conservative, strict, and self-segregating part of the Orthodox spectrum. Haredim are characterized by a minimal engagement with modern society and culture if not their wholesale rejection, by avowed precedence given to religious values, and by a high degree of rabbinic authority and involvement in daily life. In spite of many differences, Haredi rabbis and communities generally recognize each other as such, and therefore accord respect and legitimacy between them. They are organized in large political structures, mainly ": null
    },
    {
        "Agudath Israel of America": "Agudath Israel Of America"
    },
    {
        " and the Israeli ": null
    },
    {
        "United Torah Judaism": "United Torah Judaism"
    },
    {
        " party. More radical groups include the ": null
    },
    {
        "Central Rabbinical Congress": "Central Rabbinical Congress"
    },
    {
        " and the ": null
    },
    {
        "Edah HaChareidis": "Edah Hachareidis"
    },
    {
        ". Some Haredim also hold a lukewarm or negative assessment of the more modernist Orthodox. They are easily discerned by their mode of dress, often all black for men and very modest by religious standards for women     Apart from that, the ultra-Orthodox consist of a large spectrum of communities. They may be roughly classified into three different sub-groups. The first are the ": null
    },
    {
        "Hasidic Jews": "Hasidic Jews"
    },
    {
        ". The Hasidim originated in 18th-century ": null
    },
    {
        "Eastern Europe": "Eastern Europe"
    },
    {
        ", where they formed as a spiritual revival movement which defied the rabbinical establishment. The threat of modernity turned the movement into a bastion of conservatism and reconciled it with other traditionalist elements. Hasidim espouse a mystical interpretation of religion, with each Hasidic community aligned with a hereditary leader known as rebbe . While the spiritualist element of Hasidism declined somewhat through the centuries, the authority of rebbes is derived from the mystical belief that the holiness of their ancestors is inborn. They exercise tight control over the lives of their followers. Every single one of the several hundreds of independent Hasidic sects , from large ones with thousands of member households to very small, has its own line of rebbes. Courts often possess unique customs, religious emphases, philosophies, and styles of dress. Hasidim, especially on the Sabbath, don long garments and fur hats, which were once the staple of all Eastern European Jews, but are now associated almost exclusively with them. As of 2016, there were some 130,000 Hasidic households worldwide.     The second Haredi group are the Litvaks or Yeshivish. They originated, in a loose fashion, with the ": null
    },
    {
        "Misnagdim": "Misnagdim"
    },
    {
        ", the opponents of Hasidism, who were mainly concentrated in ": null
    },
    {
        "old Lithuania": "Grand Duchy Of Lithuania"
    },
    {
        ". The confrontation with the Hasidism bred distinct ideologies and institutions, especially great  yeshiva s, learning halls, where the study of Torah for its own sake and admiration for the scholars who headed these schools was enshrined. With the advent of secularization, the Misnagdim largely abandoned their hostility towards Hasidism. They became defined by affiliation with their yeshivas, and their communities were sometimes composed of alumni of the same institutes. The great prestige ascribed to those as centers of Torah study  swept many of a non-Misnagdic background, and the term Litvak lost its ethnic connotation. It is in fact granted to all non-Hasidic Haredim of European  descent. The Litvak sector is led mainly by heads of yeshivas.     The third ultra-Orthodox movement is the Sephardi Haredim, who are particularly identified with the ": null
    },
    {
        "Shas": "Shas"
    },
    {
        " party in Israel and the legacy of Rabbi ": null
    },
    {
        "Ovadia Yosef": "Ovadia Yosef"
    },
    {
        ". Originating in the ": null
    },
    {
        "Mizrahi": "Mizrahi"
    },
    {
        " immigrants to the country who arrived in the 1950s, most of the Sephardi Haredim were educated in Litvak yeshivas, both adopting their educators mentality and developing a distinct identity in reaction the racism they encountered. Shas arose in the 1980s with the purported aim of reclaiming Sephardi religious legacy, in opposition to Israeli secularism on one hand and the hegemony of European-descended Haredim on the other. While living in strictly observant circles  they, unlike the insular Hasidim or Litvaks, maintain a strong bond with the lax or nonobservant masses of Israeli Mizrahi society.     Apart from the Haredim, other Orthodox pursue other paths. In the West, especially in the United States, Modern Orthodoxy , or Centrist Orthodoxy , is a broad umbrella term for communities which seek an observant lifestyle and traditional theology, but either do not strictly reject the modern world or ascribe a positive role to engagement with it. In America, the Modern Orthodox form a cohesive community and identity group, highly influenced by the legacy of leaders such as Rabbi ": null
    },
    {
        "Joseph B. Soloveitchik": "Joseph B. Soloveitchik"
    },
    {
        ", and concentrated around ": null
    },
    {
        "Yeshiva University": "Rabbi Isaac Elchanan Theological Seminary"
    },
    {
        " and institutions like the ": null
    },
    {
        "Orthodox Union": "Orthodox Union"
    },
    {
        " or ": null
    },
    {
        "National Council of Young Israel": "National Council Of Young Israel"
    },
    {
        ". They affirm a strict obedience to Jewish Law, the centrality of Torah study, and the importance of positive engagement with modern culture. American Modern Orthodoxy underwent growing polarization in recent decades. Both its liberal-leaning wing, that includes organizations such as  Edah  and ": null
    },
    {
        "Yeshivat Chovevei Torah": "Yeshivat Chovevei Torah"
    },
    {
        ", and conservative elements, like the ": null
    },
    {
        "Hebrew Theological College": "Hebrew Theological College"
    },
    {
        ", drifted away from the center. Some progressives adopted the name ": null
    },
    {
        "Open Orthodoxy": "Open Orthodoxy"
    },
    {
        " , intending to enact controversial policies. The Open Orthodox were condemned by most Orthodox circles, and decried as heretics by not a few.     In Israel, ": null
    },
    {
        "Religious Zionism": "Religious Zionism"
    },
    {
        " represents the largest Orthodox public. While Centrist Orthodoxys fault-line with the ultra-Orthodox is the attitude to modernity, a fervent adoption of ": null
    },
    {
        "Zionism": "Zionism"
    },
    {
        " marks the former. Religious Zionism not only supports the State of Israel, it ascribes an inherent religious value to it; the dominant ideological school, influenced by Rabbi ": null
    },
    {
        "Abraham Isaac Kooks": "Abraham Isaac Kook"
    },
    {
        "thought, regards the state in messianic terms. Religious Zionism is not a uniform group, and fragmentation between its strict and conservative flank  and more liberal and open elements has increased since the 1990s. The ": null
    },
    {
        "National Religious Party": "National Religious Party"
    },
    {
        ", once the single political platform, dissolved, and the common educational system became torn on issues such as gender separation in elementary school or secular studies.     In Europe, Centrist Orthodoxy is represented by bodies like the British ": null
    },
    {
        "United Synagogue": "United Synagogue"
    },
    {
        " and the ": null
    },
    {
        "Israelite Central Consistory of France": "Israelite Central Consistory Of France"
    },
    {
        ", both the dominant official rabbinates in their respective countries. The laity is often non-observant, retaining formal affiliation due to familial piety or a sense of Jewish identity. Another large non-observant demographic usually considered aligned with Orthodoxy are the Israeli  Masortim , or traditional . This moniker originated with ": null
    },
    {
        "Mizrahi": "Mizrahim"
    },
    {
        " immigrants who were both secularized and reverent toward their communal heritage. However, Mizrahi intellectuals in recent years developed a more reflective, nuanced understanding of this term, eschewing its shallow image and not necessarily agreeing with the formal deference to Orthodox rabbis. Self-conscious Masorti identity is still limited to small, elitist circles.     Even more than in Europes formal state rabbinates, Orthodox Judaism exerts a powerful, transnational authority through its control of the ": null
    },
    {
        "Chief Rabbinate of Israel": "Chief Rabbinate Of Israel"
    },
    {
        ". Regulating Jewish marriage, conversion, adoption, and dietary standards in the country, the Chief Rabbinate influences both Israels population and Jews worldwide.               Until the latter half of the 18th century, Jewish communities in Central and Western Europe were autonomous entities, ": null
    },
    {
        "another estate in the corporate order of society": "Estates Of The Realm"
    },
    {
        ", with their own distinct privileges and obligations. They were led by the affluent wardens class , and judicially subject to ": null
    },
    {
        "rabbinical court": "Rabbinical Court"
    },
    {
        "s, which ruled in most civil matters. The rabbinical class held the monopoly over education and morals, much like the Christian clergy. Jewish Law was considered normative and enforced upon obstinate transgressors with all communal sanctions: imprisonment, taxation, flogging, pillorying, and especially ": null
    },
    {
        "excommunication": "Herem"
    },
    {
        ". Cultural, economic, and social exchange with Christian society was limited and regulated.     This state of affairs came to an end with the rise of the modern, centralized state, which sought to appropriate all authority. The nobility, clergy, urban guilds, and all other corporate estates were gradually stripped of their privileges, inadvertently creating a more equal and secularized society. The Jews were but one of the groups affected: Excommunication was banned, and rabbinic courts lost almost all their jurisdiction. The state, especially since the ": null
    },
    {
        "French Revolution": "French Revolution"
    },
    {
        ", was more and more inclined to tolerate the Jews only as a religious sect, not as an autonomous entity, and sought to reform and integrate them as useful subjects. Jewish emancipation and equal rights were also discussed. Thus, the Christian  differentiation between religious and secular was applied to Jewish affairs, to which these concepts were traditionally alien. The rabbis were bemused when the state expected them to assume pastoral cares, foregoing their principal role as judiciary. Of secondary importance, much less than the civil and legal transformations, were the ideas of ": null
    },
    {
        "Enlightenment": "Age Of Enlightenment"
    },
    {
        " which chafed at the authority of tradition and faith.     By the turn of the century, the weakened rabbinic establishment was facing masses of a new kind of transgressors: They could not be classified nor as tolerable sinners overcome by their urges , neither as schismatics like the ": null
    },
    {
        "Sabbateans": "Sabbateans"
    },
    {
        " or ": null
    },
    {
        "Frankists": "Frankists"
    },
    {
        ", against whom all communal sanctions were levied. Their attitudes did not fit the criteria set when faith was a normative and self-evident part of worldly life, but rested on the realities of a new, secularized age. The wardens class, which wielded most power within the communities, was rapidly acculturating, and often sought to oblige the reforming agenda of the state. Rabbi ": null
    },
    {
        "Elazar Fleckeles": "Elazar Fleckeles"
    },
    {
        ", who returned to ": null
    },
    {
        "Prague": "Prague"
    },
    {
        " from the countryside in 1783, recalled that he first faced there new vices of principled irreverence towards tradition, rather than old vices like gossip or fornication. In ": null
    },
    {
        "Hamburg": "Hamburg"
    },
    {
        ", Rabbi ": null
    },
    {
        "Raphael Cohen": "Raphael Cohen"
    },
    {
        " attempted to reinforce traditional norms. Cohen ordered all the men in his community to grow a beard, forbade holding hands with ones wife, and decried women who wore wigs instead of visible ": null
    },
    {
        "headgear": "Headgear"
    },
    {
        " to cover their hair; Cohen taxed and otherwise persecuted ": null
    },
    {
        "members of the priestly caste": "Koheneffects On Marital Status"
    },
    {
        " who left the city to marry divorcees, men who appealed to ": null
    },
    {
        "state courts": "Invalidity Of Gentile Courts"
    },
    {
        ", those who ate food ": null
    },
    {
        "cooked by gentiles": "Bishul Yisrael"
    },
    {
        " and other transgressors. Hamburgs Jews repeatedly appealed to the authorities, which eventually justified Cohen. However, the unprecedented meddling in his jurisdiction profoundly shocked him and dealt a blow to the prestige of the rabbinate.     An ideological challenge to rabbinic authority, in contrast to prosaic secularization, appeared in the form of the  Haskalah  movement which came to the fore in 1782. ": null
    },
    {
        "Hartwig Wessely": "Hartwig Wessely"
    },
    {
        ", ": null
    },
    {
        "Moses Mendelssohn": "Moses Mendelssohn"
    },
    {
        " and other maskilim called for a ": null
    },
    {
        "reform of Jewish education": "Words Of Peace And Truth"
    },
    {
        ", ": null
    },
    {
        "abolition of coercion in matters of conscience": "Jerusalem"
    },
    {
        ", and other modernizing measures. They bypassed rabbinic approval and set themselves, at least implicitly, as a rival intellectual elite. A bitter struggle ensued. Reacting to Mendelssohns assertion that freedom of conscience must replace communal censure, Rabbi Cohen of Hamburg commented:      However, maskilic-rabbinic rivalry ended rather soon in most of Central Europe, for the governments imposed modernization upon their Jewish subjects with regard to neither. Schools replaced traditional  cheder s, and ": null
    },
    {
        "standard German": "Standard German"
    },
    {
        " began to supplant ": null
    },
    {
        "Judeo-German": "Judeo-German"
    },
    {
        ". Differences between the establishment and the Enlightened became irrelevant, and the former often embraced the views of the latter . In 1810, when philanthropist ": null
    },
    {
        "Israel Jacobson": "Israel Jacobson"
    },
    {
        " opened a reformed synagogue in ": null
    },
    {
        "Seesen": "Seesen"
    },
    {
        " with a modernized ritual, he encountered little protest.          It was only the foundation of the ": null
    },
    {
        "Hamburg Temple": "Hamburg Temple"
    },
    {
        ", in 1818, which mobilized the conservative elements. The organizers of the new Hamburg synagogue, who wished to appeal to acculturated Jews with a modernized ritual, openly defied not just the local rabbinic court that ordered them to desist, but published learned tracts which castigated the entire rabbinical elite as hypocritical and ": null
    },
    {
        "obscurant": "Obscurantism"
    },
    {
        ". The moral threat they posed to rabbinic authority, as well as halakhic issues such as having a gentile play an organ on the Sabbath, were combined with severe theological issues. The Temples revised prayerbook omitted or rephrased petitions for the coming of the Messiah and renewal of sacrifices . More than anything else, this doctrinal breach alarmed the traditionalists. Dozens of rabbis from across Europe united in support of the Hamburg rabbinic court, banning the major practices enacted there and offering halakhic grounds for forbidding any change in received custom. Most historians concur that the 1818-1821 ": null
    },
    {
        "Hamburg Temple dispute": "Hamburg Temple Disputes"
    },
    {
        ", with its concerted backlash against Reform and the emergence of a self-aware conservative ideology, marks the beginning of Orthodox Judaism.     The leader and organizer of the Orthodox camp during the dispute, and the most influential figure in early Orthodoxy, was Rabbi ": null
    },
    {
        "Moses Sofer": "Moses Sofer"
    },
    {
        " of ": null
    },
    {
        "Pressburg": "Pressburg"
    },
    {
        ", ": null
    },
    {
        "Hungary": "Hungary"
    },
    {
        ". Historian ": null
    },
    {
        "Jacob Katz": "Jacob Katz"
    },
    {
        " regarded him as the first to fully grasp the realities of the modern age. Sofer understood that what remained of his political clout would soon disappear, and that he largely lost the ability to enforce observance; as Katz wrote, obedience to halakha became dependent on recognizing its validity, and this very validity was challenged by those who did not obey. He was also deeply troubled by reports from his native ": null
    },
    {
        "Frankfurt": "Frankfurt"
    },
    {
        " and the arrival from the west of dismissed rabbis, ejected by progressive wardens, or pious families, fearing for the education of their children. These émigrés often became his ardent followers.     Sofers response to the crisis of traditional Jewish society was unremitting conservatism, canonizing every detail of prevalent norms in the observant community lest any compromise will legitimize the progressives claim that the law was fluid or redundant. He was unwilling to trade halakhic opinions with those he considered as merely pretending to honor the rules of rabbinic discourse, while intending to undermine the very system. Sofer also awarded customs with absolute validity, regarding them as uniformly equivalent to vows; he warned already in 1793 that even the custom of ignoramuses was to be meticulously observed and revered. Sofer was frank and vehement about his conservative stance, stating during the Hamburg dispute that prayers in the vernacular were not particularly problematic, but he forbade them because they constituted an innovation. He succinctly expressed his attitude in a wordplay he loaned from the Talmud: The new  is forbidden by the Torah anywhere. Regarding the new, ideologically-driven sinners, Sofer commented in 1818 that they should have been anathemized and banished from the People Israel like the heretical sects of yore.     Unlike most if not all rabbis in Central Europe, who had little choice but to compromise, Sofer enjoyed unique circumstances. He too had to tread carefully during the 1810s, tolerating a modernized synagogue in Pressburg and other innovations, and his ": null
    },
    {
        "yeshiva": "Yeshiva"
    },
    {
        " was nearly closed by warden Wolf Breisach. But in 1822, three poor members of the community, whose deceased apostate brother bequeathed them a large fortune, rose to the wardens board. Breisach died soon after, and the Pressburg community became dominated by the conservatives. Sofer also possessed a strong base in the form of his yeshiva, the worlds largest at the time, with hundreds of students. And crucially, the large and privileged ": null
    },
    {
        "Hungarian nobility": "Hungarian Nobility"
    },
    {
        " blocked most imperial reforms in the backward country, including those relevant to the Jews. Hungarian Jewry retained its pre-modern character well into the first half of the 19th century, allowing Sofers disciples to establish a score of new yeshivas, at a time when these institutions were rapidly closing in the west, and a strong rabbinate in the communities which appointed them. A generation later, a self-aware Orthodoxy was already well entrenched in the country. Hungarian Jewry gave rise both to Orthodoxy in general, in a sense of a comprehensive response to modernity, and specifically to the traditionalist, militant ": null
    },
    {
        "Ultra-Orthodoxy": "Ultra Orthodox"
    },
    {
        ". Michael K. Silber. The Historical Experience of German Jewry and its Impact on Haskalah and Reform in Hungary. In: Jacob Katz, ed., Toward Modernity: The European Jewish Model . pp. 108-113, 118-122, 150 .     The 1818-1821 controversy also elicited a very different response, which first arose in its very epicenter. Severe protests did not affect the Temples congregants, eventually leading the wardens of Hamburgs Jewish community to a comprehensive compromise for the sake of unity. They dismissed the elderly, traditional Chief ": null
    },
    {
        "Dayan": "Dayan"
    },
    {
        " Baruch Oser and appointed ": null
    },
    {
        "Isaac Bernays": "Isaac Bernays"
    },
    {
        ". The latter was a university graduate, clean-shaven and modernized, who could appeal to the acculturated and the young. Bernays signified a new era, and is believed by historians to be the first modern rabbi, fitting the demands of the emancipation: his contract forbade him to tax, punish or employ coercion, and he lacked any political or judiciary power. He was also forbidden from interfering the Temples conduct. Though conservative in the principal issues of faith, in aesthetic, cultural and civil matters, Bernays was a reformer and resembled the Temple leaders. He introduced secular studies for children, wore a ": null
    },
    {
        "cassock": "Cassock"
    },
    {
        " like a Protestant clergyman, and delivered frequent vernacular sermons. He forbade the spontaneous, informal character of synagogue conduct typical of ": null
    },
    {
        "Ashkenazi": "Ashkenazi"
    },
    {
        " tradition, and ordered prayers to be somber and dignified. Bernays style reunified the Hamburg community by drawing most of the Temples members back to the main synagogue, having their aesthetic demands met. Ismar Schorch, Emancipation and the Crisis of Religious Authority: The Emergence of the Modern Rabbinate; in: Werner Eugen Mosse etc., Revolution and Evolution: 1848 in German-Jewish History. Mohr Siebeck, 1981. pp. 208-209        The combination of religious conservatism and embrace of modernity in everything else was emulated elsewhere, earning the epithet ": null
    },
    {
        "Neo-Orthodoxy": "Torah Im Derech Eretz"
    },
    {
        ". Bernays and his like-minded, such as Rabbi ": null
    },
    {
        "Jacob Ettlinger": "Jacob Ettlinger"
    },
    {
        ", fully accepted the platform of the moderate  Haskalah , which now lost its progressive edge. While old-style traditional life were still quite extant in Germany until the 1840s, rapid secularization and acculturation turned Neo-Orthodoxy into the strict right-wing of German Jewry. It was fully articulated by Bernays disciples ": null
    },
    {
        "Samson Raphael Hirsch": "Samson Raphael Hirsch"
    },
    {
        " and ": null
    },
    {
        "Azriel Hildesheimer": "Azriel Hildesheimer"
    },
    {
        ", active in mid-century. Hirsch, a Hamburg native who was ten during the Temple dispute, combined fierce Orthodox dogmatism and militancy against rival interpretations of Judaism, with leniency on many modern issues and an elated embrace of German culture. Neo-Orthodoxy also spread to other parts and Western Europe.     While insisting on strict observance, the movement both tolerated and actively advocated modernization: Formal religious education for girls, virtually unheard of in traditional society, was introduced; modesty and gender separation were relaxed in favour of the prevalent norms of German society, while men went clean-shaven and dressed like their non-Jewish compatriots; and exclusive Torah study virtually disappeared, supplanted with more basic religious studies , which were to provide children with practical halakhic knowledge for life in the secular world. Synagogue ritual was reformed in semblance of prevalent aesthetic conceptions, much like non-Orthodox synagogues though without the ideological undertone, and the liturgy was often abbreviated. Neo-Orthodoxy mostly did not attempt to thoroughly reconcile its conduct and traditional halakhic or moral norms . Rather, it adopted compartmentalization, de facto limiting Judaism to the private and religious sphere while yielding to outer society in the public sphere. David Ellenson. Rabbi Esriel Hildesheimer and the Creation of a Modern Jewish Orthodoxy. University of Alabama Press, 2003. pp. 17-19. For a concise introduction: Michael K. Silber, http://www.yivoencyclopedia.org/article.aspx/Orthodoxy Orthodoxy, ": null
    },
    {
        "YIVO Encyclopedia of Jews in Eastern Europe": "Yivo Encyclopedia Of Jews In Eastern Europe"
    },
    {
        ". While conservative Rabbis in Hungary still thought in terms of the now-lost communal autonomy, the Neo-Orthodox acknowledged, at least de facto, the confessionalization of Judaism under emancipation, turning it from an all-encompassing structure defining every aspect of ones life, into a private religious conviction.     Wissenschaft des Judentums   In the late 1830s, modernist pressures in Germany shifted from the secularization debate, progressing even into the purely religious sphere of theology and liturgy. A new generation of young, modern university-trained rabbis sought to reconcile Judaism with the ": null
    },
    {
        "historical-critical study of scripture": "Historical-Critical Method"
    },
    {
        " and the dominant philosophies of the day, especially ": null
    },
    {
        "Kant": "Kant"
    },
    {
        " and ": null
    },
    {
        "Hegel": "Hegel"
    },
    {
        ". Influenced by the critical ": null
    },
    {
        "Science of Judaism": "Science Of Judaism"
    },
    {
        "  pioneered by ": null
    },
    {
        "Leopold Zunz": "Leopold Zunz"
    },
    {
        ", and often in emulation of the ": null
    },
    {
        "Liberal Protestant": "Liberal Protestant"
    },
    {
        " milieu, they reexamined and undermined beliefs held as sacred in traditional circles, especially the notion of an unbroken chain from Sinai to the ": null
    },
    {
        "Sages": "Chazal"
    },
    {
        ". The more radical among the Wissenschaft rabbis, unwilling to either limit critical analysis or its practical application, coalesced around Rabbi ": null
    },
    {
        "Abraham Geiger": "Abraham Geiger"
    },
    {
        " to establish the full-fledged ": null
    },
    {
        "Reform Judaism": "Reform Judaism"
    },
    {
        ". Between 1844 and 1846, Geiger organized three rabbinical synods in ": null
    },
    {
        "Braunschweig": "Braunschweig"
    },
    {
        ", ": null
    },
    {
        "Frankfurt": "Frankfurt"
    },
    {
        " and ": null
    },
    {
        "Breslau": "Breslau"
    },
    {
        ", to determine how to refashion Judaism in present times.     The Reform conferences were met with uproar by the Orthodox. Warden ": null
    },
    {
        "Hirsch Lehren": "Hirsch Lehren"
    },
    {
        " of ": null
    },
    {
        "Amsterdam": "Amsterdam"
    },
    {
        " and Rabbi ": null
    },
    {
        "Jacob Ettlinger": "Jacob Ettlinger"
    },
    {
        " of ": null
    },
    {
        "Altona": "Altona, Hamburg"
    },
    {
        " both organized anti-Reform manifestos, vehemently denouncing the new initiatives, signed by scores of rabbis from Europe and the Middle East. The tone of the undersigned varied considerably along geographic lines: letters from the traditional societies in Eastern Europe and the Ottoman Empire, implored local leaders to petition the authorities and have them ban the movement. Signatories from Central and Western Europe used terms commensurate with the liberal age. All were implored by the petitioners to be brief and accessible; complex halakhic arguments, intended to convinced the rabbinic elite in past generations, were replaced by an appeal to the secularized masses, the new target audience.     The struggle with Wissenschaft criticism profoundly shaped the Orthodox. For centuries, ": null
    },
    {
        "Ashkenazi": "Ashkenazi"
    },
    {
        " rabbinic authorities espoused ": null
    },
    {
        "Nahmanides": "Nahmanides"
    },
    {
        " position that ": null
    },
    {
        "the Talmudic exegesis": "Midrash Halakha"
    },
    {
        ", which derived laws from the ": null
    },
    {
        "Torahs": "Torah"
    },
    {
        "text by employing ": null
    },
    {
        "complex hermeneutics": "Talmudical Hermeneutics"
    },
    {
        ", was binding  dOraita . Geiger and others presented exegesis as an arbitrary, illogical process, and consequently defenders of tradition embraced ": null
    },
    {
        "Maimonides": "Maimonides"
    },
    {
        " marginalized claim that the Sages merely buttressed already received laws with biblical citations, rather than actually deriving them through exegesis. As Jay Harris commented: An insulated orthodox, or, rather, traditional rabbinate, feeling no pressing need to defend the validity of the Oral Law, could confidently appropriate the vision of most medieval rabbinic scholars; a defencive German Orthodoxy, by contrast, could not... Thus began a shift in understanding that led Orthodox rabbis and historians in the modern period to insist that the entire Oral Law was revealed by God to Moses at Sinai. 19th-Century Orthodox commentaries, like those authored by ": null
    },
    {
        "Malbim": "Malbim"
    },
    {
        ", invested great effort to amplify the notion that the Oral and Written Law were intertwined and inseparable. Jay Harris, How Do We Know This?: Midrash and the Fragmentation of Modern Judaism. ": null
    },
    {
        "SUNY Press": "Suny Press"
    },
    {
        ", 1994. pp. 161-167.     Wissenschaft posed a greater challenge to the modernized neo-Orthodox than to insulated traditionalist. ": null
    },
    {
        "Hirsch": "Samson Raphael Hirsch"
    },
    {
        " and ": null
    },
    {
        "Hildesheimer": "Azriel Hildesheimer"
    },
    {
        " were divided on the matter, basically anticipating all modernist Orthodox attitudes to the historical-critical method. Hirsch argued that analyzing even the slightest minutiae of tradition as products of their historical context, was akin to denying the divine origin and timeless relevance of it all. Hildesheimer consented to research under limits, subjugating it to the predetermined sanctity of the subject matter and accepting its results only when they did not conflict with the latter. More importantly, while he was content to engage it academically, he utterly opposed its practical application in religious questions, where only traditional methods were to be used. Hildesheimers approach was emulated by his disciple Rabbi ": null
    },
    {
        "David Zvi Hoffmann": "David Zvi Hoffmann"
    },
    {
        ", who was both a scholar of note and a consummate apologetic. David J. Fine, Abraham Geiger and the Hamburg Gebetbuchstreit of 1842, in: Christian Wiese, Jüdische Existenz in der Moderne: Abraham Geiger und die Wissenschaft des Judentums. Walter de Gruyter, 2013. pp. 161-178 His polemic against the ": null
    },
    {
        "Graf-Wellhausen hypothesis": "Graf-Wellhausen Hypothesis"
    },
    {
        " remains the classical Orthodox response to Higher Criticism. Hirsch often lambasted Hoffman for contextualizing rabbinic literature. Ellenson, Hildesheimer. p. 148-149.     All of them stressed ceaselessly the importance of dogmatic adherence to Torah min ha-Shamayim, which led them to conflict with Rabbi ": null
    },
    {
        "Zecharias Frankel": "Zecharias Frankel"
    },
    {
        ", Chancellor of the ": null
    },
    {
        "Jewish Theological Seminary of Breslau": "Jewish Theological Seminary Of Breslau"
    },
    {
        ". Unlike the Reform camp, Frankel both insisted on strict observance and displayed great reverence towards tradition. But though regarded with much appreciation by many conservatives, his keen practice of Wissenschaft made him a suspect in the eyes of Hirsch and Hildesheimer. They demanded again and again that he unambiguously state his beliefs concerning the nature of revelation. In 1859, Frankel published a critical study of the ": null
    },
    {
        "Mishnah": "Mishnah"
    },
    {
        ", and casually added that all commandments classified as ": null
    },
    {
        "Law given to Moses at Sinai": "Law Given To Moses At Sinai"
    },
    {
        " were merely ancient customs accepted as such . Hirsch and Hildesheimer seized the opportunity and launched a prolonged public campaign against him, accusing him of heresy. Concerned that public opinion regarded both neo-Orthodoxy and Frankels Positive-Historical School centered at Breslau as similarly observant and traditionalist, the two stressed that the difference was dogmatic and not halakhic. They managed to tarnish Frankels reputation in the traditional camp and make him illegitimate in the eyes of many. The Positive-Historical School is regarded by ": null
    },
    {
        "Conservative Judaism": "Conservative Judaism"
    },
    {
        " as an intellectual forerunner. Michael K. Silber, https://www.academia.edu/1829696/ The Emergence of Ultra-Orthodoxy: The Invention of Tradition. Harvard University Press, 1992. pp. 35-36; Chaim Landerer, http://www.hakirah.org/Vol%208%20Landerer.pdf R’ Shlomo Yehuda Rapoport , Champion of Jewish Unity in the Modern Era. Hakira 8, 2009. While Hildesheimer cared to distinguish between Frankels observant disciples and the proponents of Reform, he wrote in his diary: how meager is the principal difference between the Breslau School, who don silk gloves at their work, and Geiger who wields a sledgehammer. Ellenson, Hildesheimer. p. 78.          During the 1840s in Germany, as traditionalists became a clear minority, some Orthodox rabbis, like Salomo Eger of ": null
    },
    {
        "Posen": "Poznań"
    },
    {
        ", urged to adopt ": null
    },
    {
        "Moses Sofers": "Moses Sofer"
    },
    {
        "position and anathemize the principally nonobservant. Eating, worshipping or marrying with them were to be banned. Rabbi ": null
    },
    {
        "Jacob Ettlinger": "Jacob Ettlinger"
    },
    {
        ", whose journal Treue Zionswächter was the first regular Orthodox newspaper , refused to heed their call. Ettlinger, and German neo-Orthodoxy in his steps, chose to regard the modern secularized Jew as a transgressor and not as a schismatic. He adopted Maimonides interpretation of the Talmudic concept  tinok shenishba  , a Jew by birth who was not raised as such and therefore could be absolved for not practicing the Law, and greatly expanded it to serve the Orthodox need to tolerate the nonobservant majority . For example, he allowed to drink wine poured by Sabbath desecrators, and to ignore other halakhic sanctions. Yet German neo-Orthodoxy could not legitimize nonobservance, and adopted a complex hierarchical approach, softer than traditional sanctions but no less intent on differentiating between sinners and righteous. Reform rabbis or lay leaders, considered ideological opponents, were castigated, while the common mass was to be handled carefully. Adam Ferziger, Exclusion and Hierarchy: Orthodoxy, Nonobservance and the Emergence of Modern Jewish Identity. University of Pennsylvania Press, 2005. pp. 92-99, 168, 188.     Some German neo-Orthodox believed that while doomed to a minority status in their native country, their ideology could successfully confront modernity and unify Judaism in the more traditional communities to the east. In 1847, Hirsch was elected Chief Rabbi of ": null
    },
    {
        "Moravia": "Moravia"
    },
    {
        ", where old rabbinic culture and  yeshiva s were still extant. He soon found his expectations dashed: The traditionalist rabbis scorned him for his European manners and lack of Talmudic acumen, and were enraged by his attempts to impose synagogue reform and to establish a modern rabbinical seminary with comprehensive secular studies. The progressives viewed him as too conservative. After just four years of constant strife, he utterly lost faith in the possibility of reuniting the broad Jewish public. In 1851, a small group in ": null
    },
    {
        "Frankfurt am Main": "Frankfurt Am Main"
    },
    {
        " which opposed the Reform character of the Jewish community turned to Hirsch. He led them for the remainder of his life, finding Frankfurt an ideal location to implement his unique ideology, which amalgamated acculturation, dogmatic theology, thorough observance and now also strict secessionism from the non-Orthodox.        In the very same year, Hildesheimer set out for Hungary. Confounded by rapid urbanization and acculturation – which gave rise to what was known as ": null
    },
    {
        "Neology": "Neolog Judaism"
    },
    {
        " , a nonobservant laity served by rabbis who mostly favoured the Positive-Historical approach – the elderly local rabbis at first welcomed Hildesheimer. He opened a modern school in ": null
    },
    {
        "Eisenstadt": "Eisenstadt"
    },
    {
        ", which combined secular and religious studies, and traditionalists such as ": null
    },
    {
        "Moshe Schick": "Moshe Schick"
    },
    {
        " and Yehudah Aszód sent their sons there. ": null
    },
    {
        "Samuel Benjamin Sofer": "Samuel Benjamin Sofer"
    },
    {
        ", the heir of late Hatam Sofer, considered appointing Hildesheimer as his assistant-rabbi in ": null
    },
    {
        "Pressburg": "Pressburg"
    },
    {
        " and instituting secular studies in the citys great  yeshiva . The rabbi of Eisenstadt believed that only a full-fledged modern rabbinical seminary will serve to fulfill his neo-Orthodox agenda. In the 1850s and 1860s, however, a radical reactionary Orthodox party coalesced in the backward ": null
    },
    {
        "northeastern regions of Hungary": "Unterlander Jews"
    },
    {
        ". Led by Rabbi ": null
    },
    {
        "Hillel Lichtenstein": "Hillel Lichtenstein"
    },
    {
        ", his son-in-law ": null
    },
    {
        "Akiva Yosef Schlesinger": "Akiva Yosef Schlesinger"
    },
    {
        " and decisor ": null
    },
    {
        "Chaim Sofer": "Chaim Sofer"
    },
    {
        ", the zealots were deeply shocked by the demise of the traditional world into which they were born. Like Moses Sofer a generation before them, these Orthodox émigré left the acculturating west and moved east, to a yet pre-modern environment which they were determined to safeguard. Lichtenstein ruled out any compromise with modernity, insisting of maintaining ": null
    },
    {
        "Yiddish": "Yiddish"
    },
    {
        " and traditional dress; they considered the Neologs as already beyond the pale of Judaism, and were more concerned with neo-Orthodoxy, which they regarded as a thinly-veiled gateway for a similar fate. Chaim Sofer summarized their view of Hildesheimer: The wicked Hildesheimer is the horse and chariot of the Evil Inclination ... All the heretics in the last century did not seek to undermine the Law and the Faith as he does.     In their struggle against acculturation, the Hungarian Ultra-Orthodox found themselves hard pressed to provide strong halakhic arguments. Michael Silber wrote: These issues, even most of the religious reforms, fell into gray areas not easily treated within Halakha. It was often too flexible or ambiguous, at times silent, or worse yet, embarrassingly lenient. Schlesinger was forced to venture outside of normative law, into the mystical writings and other fringe sources, to buttress his ideology. Most Hungarian Orthodox rabbis, while sympathetic to the zealots cause, dismissed their legal arguments. In 1865, the Ultra-Orthodox convened in ": null
    },
    {
        "Nagymihály": "Nagymihály"
    },
    {
        " and issued a ban on various synagogue reforms, intended not against the Neologs but against developments in the Orthodox camp, especially after Samuel Sofer violated his fathers expressed ban and instituted German-language sermons in Pressburg. Schick, the countrys most prominent decisor, and other leading rabbis refused to sign, though they did not publicly oppose the decree. Hildesheimers planned seminary was also too radical for the mainstream rabbis, and he became marginalized and isolated by 1864. Michael K. Silber, The Invention of Tradition. pp. 55-62, quote from p. 59.     The internal Orthodox division was conflated by growing tension with the Neologs. In 1869, the ": null
    },
    {
        "Hungarian government convened a General Jewish Congress": "Schism In Hungarian Jewry"
    },
    {
        " which was aimed at creating a national representative body. Fearing Neolog domination, the Orthodox seceded from the Congress and appealed to Parliament in the name of religious freedom – this demonstrated a deep internalization of the new circumstances; just in 1851, Orthodox leader ": null
    },
    {
        "Meir Eisenstaedter": "Meir Eisenstaedter"
    },
    {
        " petitioned the authorities to restore the coercive powers of the communities. In 1871 the government recognized a separate Orthodox national committee. Communities which refused to join either side, labeled Status Quo , were subject to intense Orthodox condemnation. Yet the Orthodox tolerated countless nonobservant Jews as long as they affiliated with the national committee: ": null
    },
    {
        "Adam Ferziger": "Adam Ferziger"
    },
    {
        " stressed that membership and loyalty to one of the respective organizations, rather than beliefs and ritual behavior, emerged as the definitive manifestation of Jewish identity. The Hungarian schism was the most radical internal separation among the Jews of Europe. Hildesheimer left back to Germany soon after, disillusioned though not as pessimistic as Hirsch. He was appointed rabbi of the small Orthodox sub-community in Berlin , where he finally ": null
    },
    {
        "established his seminary.": "Hildesheimer Rabbinical Seminary"
    },
    {
        " Jacob Katz, A House Divided: Orthodoxy and Schism in Nineteenth-Century Central European Jewry. Brandeis University Press, 2005. pp. 210-245.     In 1877, a law enabling Jews to secede from their communities without conversion – again, a stark example that Judaism was now confessional, not corporate – was passed in Germany. Hirsch withdrew his congregation from the Frankfurt community and decreed that all the Orthodox should do the same. However, even in Frankfurt he encountered dismissal. Unlike the heterogeneous communities of Hungary, which often consisted of recent immigrants, Frankfurt and most German communities were close-knit. The majority of Hirschs congregants enlisted Rabbi ": null
    },
    {
        "Seligman Baer Bamberger": "Seligman Baer Bamberger"
    },
    {
        ", who was older and more conservative. Bamberger was both concerned with the principal of unity among the People Israel and dismissive of Hirsch, whom he regarded as unlearned and overly acculturated. He decreed that since the mother community was willing to finance Orthodox services and allow them religious freedom, secession was unwarranted. Eventually, less than 80 families from Hirschs 300-strong congregation followed their own rabbi. The vast majority of the 15%-20% of German Jews affiliated with Orthodox institutions cared little for the polemic, and did not secede due to prosaic reasons of finance and familial relations. Only a handful of Secessionist, Austrittorthodox, communities were established in the Reich; almost everyone remained as Communal Orthodox, Gemeindeortodox, within Liberal mother congregations. The Communal Orthodox argued that their approach was both true to Jewish unity, and decisive in maintaining public standards of observance and traditional education in Liberal communities, while the Secessionists viewed them as hypocritical middle-of-the-roaders. A House Divided, pp. 257-280.     The fierce conflicts in Hungary and Germany, and the emergence of distinctly Orthodox communities and ideologies, were the exception rather than the rule in Central and Western Europe. France, Britain, Bohemia, Austria and other countries saw both a virtual disappearance of observance and a lack of serious interest in bridging Judaism and modernity. The official rabbinate remained technically traditional, at least in the default sense of not introducing ideological change. Michael A. Meyer, Response to Modernity: A History of the Reform Movement in Judaism, Wayne State University Press, 1995. pp. 154-160. The organ – a symbol of Reform in Germany since 1818, so much that Hildesheimer seminarians had to sign a declaration that they will never serve in a synagogue which introduced one – was accepted with little qualm by the ": null
    },
    {
        "French Consistoire": "Central Consistory"
    },
    {
        " in 1856, as part of a series of synagogue regulations passed by Chief Rabbi ": null
    },
    {
        "Salomon Ulmann": "Salomon Ulmann"
    },
    {
        ". Even Rabbi ": null
    },
    {
        "Solomon Klein": "Solomon Klein"
    },
    {
        " of ": null
    },
    {
        "Colmar": "Colmar"
    },
    {
        ", the leader of ": null
    },
    {
        "Alsatian": "Alsace"
    },
    {
        " conservatives who partook in the castigation of Zecharias Frankel, had the instrument in his community. Salmon, Ravitzky, Ferziger. New Perspectives, pp. 389-390. In England, Rabbi ": null
    },
    {
        "Nathan Marcus Adlers": "Nathan Marcus Adler"
    },
    {
        "shared a very similar approach: It was vehemently conservative in principal and combated ": null
    },
    {
        "ideological reformers": "David Woolf Marks"
    },
    {
        ", yet served a nonobservant public – as ": null
    },
    {
        "Todd Endelman": "Todd Endelman"
    },
    {
        " noted, While respectful of tradition, most English-born Jews were not orthodox in terms of personal practice. Nonetheless they were content to remain within an orthodox congregational framework – and introduced considerable synagogue reforms. Todd M. Endelman, The Jews of Britain, 1656 to 2000. University of California Press, 2002. p. 167          The much belated pace of modernization in Russia, ": null
    },
    {
        "Congress Poland": "Congress Poland"
    },
    {
        " and the Romanian principalities, where harsh discrimination and active persecution of the Jews continued until 1917, delayed the crisis of traditional society for decades. Old-style education in the  heder  and  yeshiva  remained the norm, retaining ": null
    },
    {
        "Hebrew": "Hebrew"
    },
    {
        " as the language of the elite and ": null
    },
    {
        "Yiddish": "Yiddish"
    },
    {
        " as the vernacular. The defining fault-line of Eastern European Jews was between the ": null
    },
    {
        "Hasidim": "Hasidic Judaism"
    },
    {
        " and the  Misnagdic  reaction against them. Reform attempts by the ": null
    },
    {
        "Czars": "Czar Of Russia"
    },
    {
        "government, like the school modernization under ": null
    },
    {
        "Max Lilienthal": "Max Lilienthal"
    },
    {
        " or the foundation of rabbinical seminaries and the mandating of communities to appoint clerks known as ": null
    },
    {
        " official rabbis ": "Crown Rabbi"
    },
    {
        ", all had little influence. Communal autonomy and the rabbinic courts jurisdiction were abolished in 1844, but economic and social seclusion remained, ensuring the authority of Jewish institutions and traditions de facto. In 1880, there were only 21,308 Jewish pupils in government schools, out of some 5 million Jews in total; In 1897, 97% of the 5.2 million Jews in the ": null
    },
    {
        "Pale of Settlement": "Pale Of Settlement"
    },
    {
        " and Congress Poland declared Yiddish their mother tongue, and only 26% possessed any literacy in Russian. Though the Eastern European  Haskalah  challenged the traditional establishment – unlike its western counterpart, no acculturation process turned it irrelevant; it flourished from the 1820s until the 1890s – the latters hegemony over the vast majority was self-evident. The leading rabbis maintained the old conception of communal unity: In 1882, when an Orthodox party in ": null
    },
    {
        "Galicia": "Austrian Poland"
    },
    {
        " appealed for the right of secession, the ": null
    },
    {
        "Netziv": "Netziv"
    },
    {
        " and other Russian rabbis declared it forbidden and contradicting the idea of Israels oneness. Benjamin Brown, . In:   Yosef Da‘at: Studies in Modern Jewish History in Honor of Yosef Salmon. ": null
    },
    {
        "Ben-Gurion University of the Negev": "Ben-Gurion University Of The Negev"
    },
    {
        " Press, 2010.     While slow, change was by no means absent. In the 1860s and 70s, anticipating a communal disintegration like the one in the west, moderate maskilic rabbis like ": null
    },
    {
        "Yitzchak Yaacov Reines": "Yitzchak Yaacov Reines"
    },
    {
        " and ": null
    },
    {
        "Yechiel Michel Pines": "Yechiel Michel Pines"
    },
    {
        " called for inclusion of secular studies in the heders and yeshivas, a careful modernization, and an ecumenical attempt to form a consensus on necessary adaptation of halakha to novel times. Their initiative was thwarted by a combination of strong anti-traditional invective on behalf of the radical, secularist maskilim and conservative intransigence from the leading rabbis, especially during the bitter polemic which erupted after ": null
    },
    {
        "Moshe Leib Lilienblums": "Moshe Leib Lilienblum"
    },
    {
        "1868 call for a reconsideration of Talmudic strictures. Reines, Pines and their associates would gradually form the nucleus of ": null
    },
    {
        "Religious Zionism": "Religious Zionism"
    },
    {
        ", while their conservative opponents would eventually adopt the epithet  Haredim  . Joseph Salmon, Enlightened Rabbis as Reformers in Russian Jewish Society. in: David Sorkin, ed. New Perspectives on the Haskalah. Litmann . esp. pp. 166-168, 172-173, 181-183.     The attitude toward Jewish nationalism, particularly ": null
    },
    {
        "Zionism": "Zionism"
    },
    {
        ", and its nonobservant if not staunchly secularist leaders and partisans, was the key question facing the traditionalists of Eastern Europe. Closely intertwined were issues of modernization in general: As noted by Joseph Salmon, the future religious Zionists  were not only supportive of the national agenda per se, but deeply motivated by criticism of the prevalent Jewish society, a positive reaction to modernity and a willingness to tolerate nonobservance while affirming traditional faith and practice. Their proto-Haredi opponents sharply rejected all of the former positions and espoused staunch conservatism, which idealized existing norms. Any illusion that differences could be blanded and a united observant pro-Zionist front would be formed, were dashed between 1897 and 1899, as both the Eastern European nationalist intellectuals and ": null
    },
    {
        "Theodor Herzl": "Theodor Herzl"
    },
    {
        " himself revealed an uncompromising secularist agenda, forcing traditionalist leaders to pick sides. In 1900, the anti-Zionist pamphlet Or la-Yesharim, endorsed by many Russian and Polish rabbis, largely demarcated the lines between the proto-Haredi majority and the Mizrahi minority, and terminated dialogue; in 1911, when the 10th ": null
    },
    {
        "World Zionist Congress": "World Zionist Congress"
    },
    {
        " voted in favour of propagating non-religious cultural work and education, a large segment of the Mizrahi seceded and joined the anti-Zionists. Joseph Salmon, Zionism and Anti-Zionism in Traditional Judaism in Eastern Europe, in: Jehuda Reinharz, ed. Zionism and Religion. University Press of New England, 1998. pp. 25-26, 30-32.     In 1907, Eastern European proto-Haredi elements formed the Knesseth Israel party, a modern framework created in recognition of the deficiencies of existing institutions. It dissipated within a year. German Neo-Orthodoxy, in the meantime, developed a keen interest in the traditional Jewish masses of Russian and Poland; if at the past they were considered primitive, a disillusionment with emancipation and enlightenment made many young assimilated German Orthodox youth embark on journeys to East European yeshivot, in search of authenticity. The German secessionists already possessed a platform of their own, the Freie Vereinigung für die Interessen des Orthodoxen Judentums, founded by ": null
    },
    {
        "Samson Raphael Hirsch": "Samson Raphael Hirsch"
    },
    {
        " in 1885. In 1912, two German FVIOJ leaders, ": null
    },
    {
        "Isaac Breuer": "Isaac Breuer"
    },
    {
        " and Jacob Rosenheim, managed to organize a meeting of 300 seceding Mizrahi, proto-Haredi and secessionist Neo-Orthodox delegate in ": null
    },
    {
        "Katowice": "Katowice"
    },
    {
        ", creating the  Agudath Israel  party. While the Germans were a tiny minority in comparison to the Eastern Europeans, their modern education made them a prominent elite in the new organization, which strove to provide a comprehensive response to world Jewrys challenges in a strictly observant spirit. The Agudah immediately formed its ": null
    },
    {
        "Council of Torah Sages": "Council Of Torah Sages"
    },
    {
        " as supreme rabbinic leadership body. Many ultra-traditionalist elements in Eastern Europe, like the Belz and Lubavitch Hasidim, refused to join, viewing the movement as a dangerous innovation; and the organized Orthodox in Hungary rejected it as well, especially after it did not affirm a commitment to communal secession in 1923.     In the ": null
    },
    {
        "Interwar period": "Interwar Period"
    },
    {
        ", sweeping secularization and acculturation deracinated old Jewish society in Eastern Europe. The ": null
    },
    {
        "October Revolution": "October Revolution"
    },
    {
        " granted civil equality and imposed anti-religious persecutions, radically transforming Russian Jewry within a decade; the lifting of formal discrimination also strongly affected the Jews of ": null
    },
    {
        "independent Poland": "Second Polish Republic"
    },
    {
        ", ": null
    },
    {
        "Lithuania": "Lithuania"
    },
    {
        " an other states. In the 1930s, it was estimated that no more than 20%-33% of Polands Jews, the last stronghold of traditionalism where many were still living in rural and culturally-secluded communities, could be considered strictly observant. Jaff Schatz, Jews and the Communist Movement in Interwar Poland, in: Dark Times, Dire Decisions : Jews and Communism. Avraham Harman Institute of Contemporary Jewry. Oxford University Press, 2005. p. 35. Only upon having become an embattled minority, did the local traditionalists complete their transformation into Orthodox, albeit never as starkly as in Hungary or Germany. Eastern European Orthodoxy, whether Agudah or Mizrahi, always preferred cultural and educational independence to communal secession, and maintained strong ties and self-identification with the general Jewish public. Within its ranks, the 150-years-long struggle between ": null
    },
    {
        "Hasidim": "Hasidim"
    },
    {
        " and ": null
    },
    {
        "Misnagdim": "Misnagdim"
    },
    {
        " was largely subsided; the latter were even dubbed henceforth as Litvaks , as the anti-Hasidic component in their identity was marginalized. In the interwar period, Rabbi ": null
    },
    {
        "Yisrael Meir Kagan": "Yisrael Meir Kagan"
    },
    {
        " emerged as the popular leader of the Eastern European Orthodox, particularly the Agudah-leaning.     Both large Eastern European Orthodox organizations adopted far-reaching innovations. The Mizrahi strove to demonstrate that nationalism flowed directly from Judaism, while often accepting leniency in observance among many of their followers. The Agudah came to support religious education for girls, which was strongly opposed by rabbis since the 1870s, after a grassroots initiative established the ": null
    },
    {
        "Bais Yaakov": "Bais Yaakov"
    },
    {
        " schools. At a time when mass displacement and immigration shattered the traditional family, with young women rapidly secularized in the large cities, Orthodox leaders were content to endorse the network, though the decisors were reluctant to refute the halakhic prohibition and merely cited the great duress of the era as justification for temporary measures. Naomi Seiden, Legitimizing the Revolution: Sarah Schenirer and Orthodox Girls Education. in: New Directions in the History of the Jews in the Polish Lands, 2018. pp. 356-365. For a more available source: https://www.thelehrhaus.com/commentary/sarah-schenirer-and-innovative-change-the-myths-and-facts/ Sarah Schenirer and Innovative Change: The Myths and Facts. Another new concept, necessitated by the disappearance of the old communal structure and the need for channels of authority, was the ideology of  Daas Torah  . Developed by Kagan and especially by his acolyte ": null
    },
    {
        "Elchonon Wasserman": "Elchonon Wasserman"
    },
    {
        ", it stressed that not only fully structured halakhic decisions by rabbis were binding, but that they were imbued with superior understanding owing to their scholarly acumen. Thus, their stance on any matter was to be respected and followed. Obedience to Daas Torah would become a defining character of the postwar ultra-Orthodox world. Benjamin Brown,  https://doi.org/10.1017/S0017816014000285 Jewish Political Theology: The Doctrine of Daat Torah as a Case Study. in: ": null
    },
    {
        "Harvard Theological Review": "Harvard Theological Review"
    },
    {
        ", Volume 107, Issue 3July 2014 , pp. 255-289.          American Jewry of the 19th century, small and lacking traditional institutions or strong rabbinic presence due its immigrant-based nature, was a hotbed of religious innovation. Voluntary congregations, rather than corporate communities, were the norm; separation of church and state, and dynamic religiosity of the independent Protestant model, shaped synagogue life. In the mid-19th century, ": null
    },
    {
        "Reform Judaism": "Reform Judaism"
    },
    {
        " spread rapidly, advocating a formal relinquishment of traditions very few in the secularized, open environment observed anyhow; the United States would be derisively named the Treife Medina, or Profane Country , in ": null
    },
    {
        "Yiddish": "Yiddish"
    },
    {
        ". Conservative elements, concerned mainly with public standards of observance in critical fields like marriage, rallied around ": null
    },
    {
        "Isaac Leeser": "Isaac Leeser"
    },
    {
        ". Lacking a rabbinic ordination and little knowledgeable by European standards, Leeser was an ultra-traditionalist in his American milieu. In 1845, he introduced the words Orthodox and Orthodoxy into the American Jewish discourse, in the sense of opposing Reform; ": null
    },
    {
        "Jonathan D. Sarna": "Jonathan D. Sarna"
    },
    {
        ", American Judaism: A History. ": null
    },
    {
        "Yale University Press": "Yale University Press"
    },
    {
        ", 2019. pp. 85-88. while admiring ": null
    },
    {
        "Samson Raphael Hirsch": "Samson Raphael Hirsch"
    },
    {
        ", Leeser was an even stauncher proponent of ": null
    },
    {
        "Zecharias Frankel": "Zecharias Frankel"
    },
    {
        ", whom he considered the leader of the Orthodox party at a time when Positive-Historical and Orthodox positions were barely discernible from each other to most observers . Zeev Eleff, http://traditionarchive.org/news/_pdfs/0035-0053.pdf American Orthodoxys Lukewarm. Embrace of the Hirschian Legacy, 1850-1939. ": null
    },
    {
        "Tradition": "Tradition"
    },
    {
        " 45:3, 2012. pp. 38-40.     Indeed, a broad non-Reform, relatively traditional camp slowly coalesced as the minority within American Jewry; while strict in relation to their progressive opponents, they served a nonobservant public and instituted thorough synagogue reforms – omission of  piyyut im from the liturgy, English-language sermons and secular education for the clergy were the norm in most, Zeev Eleff, Modern Orthodox Judaism: A Documentary History. ": null
    },
    {
        "University of Nebraska Press": "University Of Nebraska Press"
    },
    {
        ", 2016. pp. xxxiv-xxxv. and many Orthodox synagogues in America did not ": null
    },
    {
        "partition": "Mechitza"
    },
    {
        " men and women. ": null
    },
    {
        "Jonathan D. Sarna": "Jonathan D. Sarna"
    },
    {
        ", https://www.brandeis.edu/hornstein/sarna/synagoguehistory/Archive/TheDebateoverMixedSeatingintheAmericanSynagogue.pdf The Debate over Mixed Seating in the American Synagogue. In 1885, the antinomian ": null
    },
    {
        "Pittsburgh Platform": "Pittsburgh Platform"
    },
    {
        " moved a broad coalition of conservative religious leaders to found the ": null
    },
    {
        "Jewish Theological Seminary of America": "Jewish Theological Seminary Of America"
    },
    {
        ". They variously termed their ideology, which was never consistent and mainly motivated by rejection of Reform, as Enlightened Orthodoxy or ": null
    },
    {
        "Conservative Judaism": "Conservative Judaism"
    },
    {
        " . The latter term would only gradually assume a clearly distinct meaning.     To their right, strictly traditionalist Eastern European immigrants formed the ": null
    },
    {
        "Union of Orthodox Rabbis": "Union Of Orthodox Rabbis"
    },
    {
        " in 1902, in direct opposition to the Americanized character of the OU and JTS. The UOR frowned upon English-language sermons, secular education and acculturation in general. Even before that, in 1897, an old-style  yeshiva , ": null
    },
    {
        "RIETS": "Riets"
    },
    {
        ", was founded in New York. Eventually, its students rebelled in 1908, demanding a modern rabbinic training much like that of their peers in JTS. In 1915, RIETS was reorganized as a decidedly Modern Orthodox institution, and a merger with the JTS was also discussed. Sarna, American Judaism: A History, pp. 188-193. In 1923, the ": null
    },
    {
        "Rabbinical Council of America": "Rabbinical Council Of America"
    },
    {
        " was established as the clerical association of the OU.     Only in the postwar era, did the vague traditional coalition come to a definite end. During and after the ": null
    },
    {
        "Holocaust": "Holocaust"
    },
    {
        ", a new wave of strictly observant refugees arrived from Eastern and Central Europe. They often regarded even the UOR as too lenient and Americanized. Typical of these was Rabbi ": null
    },
    {
        "Aaron Kotler": "Aaron Kotler"
    },
    {
        ", who established ": null
    },
    {
        "Lakewood Yeshiva": "Lakewood Yeshiva"
    },
    {
        " in New Jersey during 1943. Alarmed by the enticing American environment, Kotler turned his institution into an enclave, around which an entire community slowly evolved. It was very different from his prewar yeshiva at ": null
    },
    {
        "Kletsk": "Kletsk"
    },
    {
        ", ": null
    },
    {
        "Poland": "Interwar Poland"
    },
    {
        ", the students of which were but a segment of the general Jewish population and mingled with the rest of the population. Lakewood pioneered the homogeneous, voluntary and enclavist model of postwar Haredi communities, which were independent entities with their own developing subculture. Joel Finkelman, https://www.jstor.org/stable/1396734 Haredi Isolation in Changing Environments: A Case Study in Yeshiva Immigration. ": null
    },
    {
        "Modern Judaism": "Modern Judaism"
    },
    {
        ", Vol. 22, No. 1 . The new arrivals soon dominated the traditionalist wing of American Jewry, forcing the locals to adopt more rigorous positions.     Concurrently, the younger generation in the JTS and the ": null
    },
    {
        "Rabbinical Assembly": "Rabbinical Assembly"
    },
    {
        " demanded greater clarity, theological unambiguity and halakhic independence from the Orthodox veto on serious innovations — in 1935, for example, the RA yielded to such pressures and shelved its proposal for a solution to the ": null
    },
    {
        "agunah": "Agunah"
    },
    {
        " predicament. Conservative Judaism , now adopted as an exclusive label by most JTS graduated and RA members, became a truly distinct movement. In 1950, the Conservatives signaled their break with Orthodox halakhic authorities, with the acceptance of a far-reaching legal decision, which allowed one to drive to the synagogue and to use electricity on Sabbath. Michael R. Cohen, The Birth of Conservative Judaism: Solomon Schechters Disciples and the Creation of an American Religious Movement. Columbia University Press, 2012. pp. 137-140, 157. Between the ultra-Orthodox and Conservatives, Modern Orthodoxy in America also coalesced, becoming less a generic term and more a distinct movement. Its leader in the postwar era, Rabbi ": null
    },
    {
        "Joseph B. Soloveitchik": "Joseph B. Soloveitchik"
    },
    {
        ", left Agudas Israel to adopt both pro-Zionist positions and a positive, if reserved, attitude toward Western culture. As dean of RIETS and honorary chair of RCAs halakha committee, Soloveitchik shaped Modern Orthodoxy for decades. Jeffrey S. Gurock. American Jewish Orthodoxy in Historical Perspective. KTAV Publishing House, 1996. pp. 43-47. While ideological differences with the Conservatives were clear, as the RCA stressed the divinely revealed status of the Torah and a strict observance of halakha, sociological boundaries were less so. Many members of the Modern Orthodox public were barely observant, and a considerable number of communities did not install a ": null
    },
    {
        "gender partition": "Mechitza"
    },
    {
        " in their synagogues – physically separate seating became the distinguishing mark of Orthodox/Conservative affiliation in the 1950s, and was strongly promulgated by the RCA – for many years. For example: Deborah D. Moore, American Jewish Identity Politics": null
    }
]