[
    {
        "     Oscar Emmanuel Peterson,  was a Canadian ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        " pianist and composer. He was called the ": null
    },
    {
        "Maharaja": "Maharaja"
    },
    {
        " of the keyboard by ": null
    },
    {
        "Duke Ellington": "Duke Ellington"
    },
    {
        ", but simply O.P. by his friends. Remarks by Herbie Hancock, Quincy Jones and Bob Rae, Oscar Peterson Tribute - Simply The Best. Concerts On Demand. CBC Radio Two . Retrieved on January 13, 2008.  He released over 200 recordings, won eight ": null
    },
    {
        "Grammy Award": "Grammy Award"
    },
    {
        "s, and received numerous other awards and honours. He is considered one of the greatest jazz pianists, . With typical modesty, Peterson hailed ": null
    },
    {
        "Art Tatum": "Art Tatum"
    },
    {
        " as the greatest jazz pianist, declaring: Musically speaking, he was and is my musical God, and I feel honoured to remain one of his humbly devoted disciples. Journal, Oscar Peterson, March 7, 2004; Jazz Professional, 1962,  and played thousands of concerts worldwide in a career lasting more than 60 years.         Peterson was born in ": null
    },
    {
        "Montreal, Quebec": "Montreal, Quebec"
    },
    {
        ", to immigrants from the ": null
    },
    {
        "West Indies": "West Indies"
    },
    {
        "; his father worked as a porter for ": null
    },
    {
        "Canadian Pacific Railway": "Canadian Pacific Railway"
    },
    {
        ".  Michelot, Pabli. . LEncre Noir, February 8, 2017. Peterson grew up in the neighbourhood of ": null
    },
    {
        "Little Burgundy": "Little Burgundy"
    },
    {
        " in ": null
    },
    {
        "Montreal": "Montreal"
    },
    {
        ". It was in this predominantly ": null
    },
    {
        "black": "Black Canadians"
    },
    {
        " neighborhood that he encountered the jazz culture.  At the age of five, Peterson began honing his skills on trumpet and piano, but a bout of ": null
    },
    {
        "tuberculosis": "Tuberculosis"
    },
    {
        " when he was seven prevented him from playing the trumpet again, so he directed all his attention to the piano. His father, Daniel Peterson, an amateur trumpeter and pianist, was one of his first music teachers, and his sister ": null
    },
    {
        "Daisy": "Daisy Sweeney"
    },
    {
        " taught him classical piano. Peterson was persistent at practising scales and classical ": null
    },
    {
        "étude": "Étude"
    },
    {
        "s.     As a child, Peterson studied with Hungarian-born pianist Paul de Marky, a student of ": null
    },
    {
        "István Thomán": "István Thomán"
    },
    {
        ", who was himself a pupil of ": null
    },
    {
        "Franz Liszt": "Franz Liszt"
    },
    {
        ", so his early training was predominantly based on classical piano. But he was captivated by traditional jazz and ": null
    },
    {
        "boogie-woogie": "Boogie-Woogie"
    },
    {
        " and learned several ": null
    },
    {
        "ragtime": "Ragtime"
    },
    {
        " pieces. He was called the ": null
    },
    {
        "Brown Bomber": "Joe Louis"
    },
    {
        " of the Boogie-Woogie .      At the age of nine Peterson played piano with a degree of control that impressed professional musicians. For many years his piano studies included four to six hours of daily practice. Only in his later years did he decrease his practice to one or two hours daily. In 1940, at fourteen years of age, he won the national music competition organized by the ": null
    },
    {
        "Canadian Broadcasting Corporation": "Canadian Broadcasting Corporation"
    },
    {
        ". After that victory, he dropped out of the ": null
    },
    {
        "High School of Montreal": "High School Of Montreal"
    },
    {
        ", where he played in a band with ": null
    },
    {
        "Maynard Ferguson": "Maynard Ferguson"
    },
    {
        ".  dated 26 Aug 2006 at  The Daily Telegraph  online, accessed 30 December 2017 He became a professional pianist, starring in a weekly radio show and playing at hotels and music halls. In his teens he was a member of the Johnny Holmes Orchestra. From 1945 to 1949 he worked in a trio and recorded for Victor Records. He gravitated toward boogie-woogie and swing with a particular fondness for ": null
    },
    {
        "Nat King Cole": "Nat King Cole"
    },
    {
        " and ": null
    },
    {
        "Teddy Wilson": "Teddy Wilson"
    },
    {
        ".  By the time he was in his 20s, he had developed a reputation as a technically brilliant and melodically inventive pianist.        In a cab on the way to the ": null
    },
    {
        "Montreal airport": "Montréal-Pierre Elliott Trudeau International Airport"
    },
    {
        ", ": null
    },
    {
        "Norman Granz": "Norman Granz"
    },
    {
        " heard a radio program broadcasting from a local club. He was so impressed that he told the driver to take him to the club so he could meet the pianist. In 1949 he introduced Peterson in New York City at a ": null
    },
    {
        "Jazz at the Philharmonic": "Jazz At The Philharmonic"
    },
    {
        " concert at Carnegie Hall. He remained Petersons manager for most of his career. This was more than a managerial relationship; Peterson praised Granz for standing up for him and other black jazz musicians in the segregationist south of the 1950s and 1960s. In the documentary video Music in the Key of Oscar, Peterson tells how Granz stood up to a gun-toting southern policeman who wanted to stop the trio from using whites-only taxis. View Video, 2004.     In 1950 Peterson worked in a duo with double bassist ": null
    },
    {
        "Ray Brown": "Ray Brown"
    },
    {
        ". Two years later they added guitarist ": null
    },
    {
        "Barney Kessel": "Barney Kessel"
    },
    {
        ". Then ": null
    },
    {
        "Herb Ellis": "Herb Ellis"
    },
    {
        " stepped in after Kessel grew weary of touring. The trio remained together from 1953 to 1958, often touring with Jazz at the Philharmonic.          Peterson also worked in a duo with ": null
    },
    {
        "Sam Jones": "Samuel Jones"
    },
    {
        ", ": null
    },
    {
        "Niels-Henning Ørsted Pedersen": "Niels-Henning Ørsted Pedersen"
    },
    {
        ", ": null
    },
    {
        "Joe Pass": "Joe Pass"
    },
    {
        ", ": null
    },
    {
        "Irving Ashby": "Irving Ashby"
    },
    {
        ",  ": null
    },
    {
        "Count Basie": "Count Basie"
    },
    {
        ",  and ": null
    },
    {
        "Herbie Hancock": "Herbie Hancock"
    },
    {
        ".      He considered the trio with Brown and Ellis the most stimulating and productive setting for public performances and studio recordings. In the early 1950s, he began performing with Brown and drummer Charlie Smith as the Oscar Peterson Trio. Shortly afterward Smith was replaced by guitarist Irving Ashby, who had been a member of the Nat King Cole Trio. Ashby, who was a swing guitarist, was soon replaced by Kessel.  Their last recording,  On the Town with the Oscar Peterson Trio , recorded live at the Town Tavern in Toronto, captured a remarkable degree of emotional as well as musical understanding between three players. ": null
    },
    {
        "Nat Hentoff": "Nat Hentoff"
    },
    {
        ". Co-editor,  The Jazz Review .     When Ellis departed in 1958, they hired drummer ": null
    },
    {
        "Ed Thigpen": "Ed Thigpen"
    },
    {
        " because they felt no guitarist could compare to Ellis. Brown and Thigpen worked with Peterson on his albums  Night Train  and  Canadiana Suite . Both left in 1965 and were replaced by bassist Sam Jones and drummer ": null
    },
    {
        "Louis Hayes": "Louis Hayes"
    },
    {
        " . The trio performed together until 1970. In 1969 Peterson recorded  Motions and Emotions  with orchestral arrangements of ": null
    },
    {
        "Yesterday": "Yesterday"
    },
    {
        " and ": null
    },
    {
        "Eleanor Rigby": "Eleanor Rigby"
    },
    {
        " by ": null
    },
    {
        "The Beatles": "The Beatles"
    },
    {
        ". In the fall of 1970, Petersons trio released the album  Tristeza on Piano . Jones and Durham left in 1970.          In the 1970s Peterson formed a trio with guitarist Joe Pass and bassist ": null
    },
    {
        "Niels-Henning Ørsted Pedersen": "Niels-Henning Ørsted Pedersen"
    },
    {
        ". This trio emulated the success of the 1950s trio with Brown and Ellis and gave acclaimed performances at festivals. Their album The Trio won the 1974 Grammy Award for Best Jazz Performance by a Group. On April 22, 1978, Peterson performed in the interval act for the ": null
    },
    {
        "Eurovision Song Contest 1978": "Eurovision Song Contest 1978"
    },
    {
        " that was broadcast live from the ": null
    },
    {
        "Palais des congrès de Paris": "Palais Des Congrès De Paris"
    },
    {
        ". In 1974 he added British drummer ": null
    },
    {
        "Martin Drew": "Martin Drew"
    },
    {
        ". This quartet toured and recorded extensively worldwide. Pass said in a 1976 interview, The only guys Ive heard who come close to total mastery of their instruments are Art Tatum and Peterson .     Peterson was open to experimental collaborations with jazz musicians such as saxophonist ": null
    },
    {
        "Ben Webster": "Ben Webster"
    },
    {
        ", trumpeter ": null
    },
    {
        "Clark Terry": "Clark Terry"
    },
    {
        ", and vibraphonist ": null
    },
    {
        "Milt Jackson": "Milt Jackson"
    },
    {
        ". In 1961, the Peterson trio with Jackson recorded the album Very Tall. His solo recordings were rare until  Exclusively for My Friends  , a series of albums that were his response to pianists such as ": null
    },
    {
        "Bill Evans": "Bill Evans"
    },
    {
        " and ": null
    },
    {
        "McCoy Tyner": "Mccoy Tyner"
    },
    {
        ". He recorded for ": null
    },
    {
        "Pablo": "Pablo Records"
    },
    {
        ", led by Norman Granz, after the label was founded in 1973.  In the 1980s he played in a duo with pianist Herbie Hancock. In the late 1980s and 1990s, after a stroke, he made performances and recordings with his protégé ": null
    },
    {
        "Benny Green": "Benny Green"
    },
    {
        ". In the 1990s and 2000s he recorded several albums accompanied by a combo for ": null
    },
    {
        "Telarc": "Telarc International Corporation"
    },
    {
        ".          Peterson had arthritis since his youth, and in later years he had trouble buttoning his shirt. Never slender, his weight increased to , hindering his mobility. He had hip replacement surgery in the early 1990s.  Although the surgery was successful, his mobility was still inhibited. In 1993 a stroke weakened his left side and removed him from work for two years. During the same year incoming prime minister ": null
    },
    {
        "Jean Chrétien": "Jean Chrétien"
    },
    {
        ", his friend and fan, offered him the position of ": null
    },
    {
        "Lieutenant-Governor of Ontario": "Lieutenant-Governor Of Ontario"
    },
    {
        ". According to Chrétien, Peterson declined the job due to ill health related to the stroke.      Although he recovered some dexterity in his left hand, his piano playing was diminished, and his style had relied principally on his right hand. In 1995 he returned to occasional public performances and recorded for Telarc. In 1997 he received the ": null
    },
    {
        "Grammy Lifetime Achievement Award": "Grammy Lifetime Achievement Award"
    },
    {
        " and an International Jazz Hall of Fame Award. His friend, Canadian politician and amateur pianist ": null
    },
    {
        "Bob Rae": "Bob Rae"
    },
    {
        ", said, a one-handed Oscar was better than just about anyone with two hands.      In 2003, Peterson recorded the DVD A Night in Vienna for ": null
    },
    {
        "Verve": "Verve Records"
    },
    {
        " with Niels-Henning Ørsted Pedersen, ": null
    },
    {
        "Ulf Wakenius": "Ulf Wakenius"
    },
    {
        ", and Martin Drew. He continued to tour the U.S. and Europe, though at most one month a year, with rest between concerts.     In 2007 his health declined. He canceled his plans to perform at the Toronto Jazz Festival and a Carnegie Hall all-star concert that was to be given in his honour. Peterson died on December 23, 2007 of kidney failure at his home in Mississauga, Ontario.         Peterson was married four times.   He smoked cigarettes and a pipe and often tried to break the habit, but every time he stopped he gained weight. He loved to cook and remained a large man throughout his life.             Peterson taught piano and improvisation in Canada, mainly in Toronto. With associates, he started and headed the Advanced School of Contemporary Music in Toronto for five years during the 1960s, but it closed because touring called him and his associates away, and it did not have government funding.  Later, he mentored the ": null
    },
    {
        "York University": "York University"
    },
    {
        " jazz program and was the Chancellor of the university for several years in the early 1990s.   He published jazz piano etudes for practice. He asked his students to study the music of ": null
    },
    {
        "Johann Sebastian Bach": "Johann Sebastian Bach"
    },
    {
        ", especially  The Well-Tempered Clavier , the  Goldberg Variations , and  The Art of Fugue , considering these piano pieces essential for every serious pianist. Among his students were pianists Benny Green and ": null
    },
    {
        "Oliver Jones": "Oliver Jones"
    },
    {
        ".        He was influenced by ": null
    },
    {
        "Teddy Wilson": "Teddy Wilson"
    },
    {
        ", ": null
    },
    {
        "Nat King Cole": "Nat King Cole"
    },
    {
        ", ": null
    },
    {
        "James P. Johnson": "James P. Johnson"
    },
    {
        ", and ": null
    },
    {
        "Art Tatum": "Art Tatum"
    },
    {
        ", to whom many compared Peterson in later years   After his father played a record of Tatums ": null
    },
    {
        "Tiger Rag": "Tiger Rag"
    },
    {
        " , he was intimidated and disillusioned, quitting the piano for several weeks. Tatum scared me to death, he said, and was never cocky again about his ability at the piano.  Tatum was a model for Petersons musicianship during the 1940s and 1950s. Tatum and Peterson became good friends, although Peterson was always shy about being compared with Tatum and rarely played the piano in Tatums presence.     Peterson also credited his sister & mdash;a piano teacher in Montreal who also taught several other Canadian jazz musicians & mdash;with being an important teacher and influence on his career. Under his sisters tutelage, Peterson expanded into classical piano training and broadened his range while mastering the core classical pianism from scales to preludes and fugues by ": null
    },
    {
        "Johann Sebastian Bach": "Johann Sebastian Bach"
    },
    {
        ". William R Cunningham and ": null
    },
    {
        "Sylvia Sweeney": "Sylvia Sweeney"
    },
    {
        ", , National Film Board of Canada, 1992.     Building on Tatums pianism and aesthetics, Peterson also absorbed Tatums musical influences, notably from piano concertos by ": null
    },
    {
        "Sergei Rachmaninoff": "Sergei Rachmaninoff"
    },
    {
        ". Rachmaninoffs harmonizations, as well as direct ": null
    },
    {
        "quotations": "Musical Quotation"
    },
    {
        " from his ": null
    },
    {
        "2nd Piano Concerto": "Piano Concerto No. 2"
    },
    {
        ", are scattered throughout many recordings by Peterson, including his work with the most familiar formulation of the Oscar Peterson Trio, with bassist ": null
    },
    {
        "Ray Brown": "Ray Brown"
    },
    {
        " and guitarist ": null
    },
    {
        "Herb Ellis": "Herb Ellis"
    },
    {
        ". During the 1960s and 1970s Peterson made numerous trio recordings highlighting his piano performances; they reveal more of his eclectic style, absorbing influences from various genres of jazz, popular, and classical music.     According to pianist and educator Mark Eisenman, some of Petersons best playing was as an understated accompanist to singer ": null
    },
    {
        "Ella Fitzgerald": "Ella Fitzgerald"
    },
    {
        " and trumpeter ": null
    },
    {
        "Roy Eldridge": "Roy Eldridge"
    },
    {
        ".          1975 Best Jazz Performance by a Group  The Trio   The Giants   Oscar Peterson Jam – Montreux 77   Oscar Peterson and The Trumpet Kings – Jousts   Live at the Blue Note  The Legendary Oscar Peterson Trio Live at the Blue Note  Saturday Night at the Blue Note   DownBeat magazine, 1950, and won again for the next 12 years    ": null
    },
    {
        "Order of Canada": "Order Of Canada"
    },
    {
        ", Officer, 1972; Companion, 1984   ": null
    },
    {
        "Canadian Music Hall of Fame": "Canadian Music Hall Of Fame"
    },
    {
        ", 1978   Martin Luther King Jr. Achievement Award, ": null
    },
    {
        "Black Theatre Workshop": "Black Theatre Workshop"
    },
    {
        ", 1986   Roy Thomson Award, 1987   Toronto Arts Award for lifetime achievement, 1991   ": null
    },
    {
        "Governor Generals Performing Arts Award": "Governor Generals Performing Arts Award"
    },
    {
        ", 1992   ": null
    },
    {
        "Order of Ontario": "Order Of Ontario"
    },
    {
        ", member 1992    ": null
    },
    {
        "Glenn Gould Prize": "Glenn Gould Prize"
    },
    {
        ", 1993   International Society for Performing Artists award, 1995   ": null
    },
    {
        "Loyola Medal": "Loyola Medal"
    },
    {
        " of Concordia University, 1997   ": null
    },
    {
        "Praemium Imperiale": "Praemium Imperiale"
    },
    {
        " World Art Award, 1999   Oscar Peterson Concert Hall named at Concordia University, 1999    UNESCO Music Prize, 2000   Toronto Musicians Association Musician of the Year, 2001   ": null
    },
    {
        "SOCAN": "Socan"
    },
    {
        " Special Achievement Award, 2008    ": null
    },
    {
        "Canadas Walk of Fame": "Canadas Walk Of Fame"
    },
    {
        ", 2013   Canadian Jazz and Blues Hall of Fame   ": null
    },
    {
        "Juno Award": "Juno Award"
    },
    {
        " Hall of Fame   ": null
    },
    {
        "BBC Radio Lifetime Achievement Award": "Bbc Jazz Awards"
    },
    {
        " National Order of Quebec": "National Order Of Quebec"
    },
    {
        ", Chevalier   ": null
    },
    {
        "Ordre des Arts et des Lettres": "Ordre Des Arts Et Des Lettres"
    },
    {
        ", France   Civic Award of Merit, City of Mississauga, 2003 , Mississauga – Newsroom, September 8, 2003.   Oscar Peterson Theatre, Canadian Embassy, Tokyo, Japan, 2007   Oscar Peterson Hall, ": null
    },
    {
        "University of Toronto Mississauga": "University Of Toronto Mississauga"
    },
    {
        ", 2008     Oscar Peterson Public School, ": null
    },
    {
        "Stouffville": "Whitchurch-Stouffville"
    },
    {
        ", 2009    ": null
    },
    {
        "Statue of Oscar Peterson": "Statue Of Oscar Peterson"
    },
    {
        " unveiled in Ottawa by Queen Elizabeth II, 2010     Honorary degrees from Berklee College of Music, ": null
    },
    {
        "Carleton University": "Carleton University"
    },
    {
        ", ": null
    },
    {
        "Queens University": "Queens University"
    },
    {
        ", ": null
    },
    {
        "Concordia University": "Concordia University"
    },
    {
        ",  ": null
    },
    {
        "Université Laval": "Université Laval"
    },
    {
        ", ": null
    },
    {
        "McMaster University": "Mcmaster University"
    },
    {
        ", ": null
    },
    {
        "Mount Allison University": "Mount Allison University"
    },
    {
        ", Niagara, Northwestern, University of Toronto, ": null
    },
    {
        "University of the West Indies": "University Of The West Indies"
    },
    {
        ", ": null
    },
    {
        "University of Western Ontario": "University Of Western Ontario"
    },
    {
        ",  ": null
    },
    {
        "University of Victoria": "University Of Victoria"
    },
    {
        ", and ": null
    },
    {
        "York University": "York University"
    },
    {
        " Bösendorfer": "Bösendorfer"
    },
    {
        " pianos - 1990s and 2000s, some performances from the 70s onward.   ": null
    },
    {
        "Yamaha": "Yamaha"
    },
    {
        " - Acoustic and Disklavier- 1998-2006 in Canada   ": null
    },
    {
        "Steinway & Sons": "Steinway  &  Sons"
    },
    {
        " Model A  - most performances from the 1940s through the 1980s, some recordings.   ": null
    },
    {
        "Baldwin": "Baldwin Piano Company"
    },
    {
        " pianos - some performances in the US, some recordings.   ": null
    },
    {
        "C. Bechstein Pianofortefabrik": "C. Bechstein Pianofortefabrik"
    },
    {
        " pianos - some performances and recordings in Europe.   ": null
    },
    {
        "Petrof": "Petrof"
    },
    {
        " pianos - some performances in Europe.   ": null
    },
    {
        "Clavichord": "Clavichord"
    },
    {
        " - on album Porgy and Bess with ": null
    },
    {
        "Joe Pass": "Joe Pass"
    },
    {
        " Fender Rhodes": "Rhodes Piano"
    },
    {
        " electric piano - several recordings.   ": null
    },
    {
        "Synthesizer": "Synthesizer"
    },
    {
        " - several recordings.   ": null
    },
    {
        "Hammond organ": "Hammond Organ"
    },
    {
        " - some live performances and several recordings.   ": null
    },
    {
        "Vocals": "Singing"
    },
    {
        " - some live performances and several recordings.       ": null
    }
]