[
    {
        "        Osco Drug and Sav-on Drugs were the names of a pair of ": null
    },
    {
        "chain": "chain store"
    },
    {
        " pharmacies": "pharmacy"
    },
    {
        " that operated in the United States. Osco Drug was founded by the ": null
    },
    {
        "Skaggs family": "skaggs family"
    },
    {
        ". Alpha Beta grocery store was purchased by American Stores in 42 Skaggs Drug Centers bought American Stores in 42 and assumed the American Stores name. Sav-on Drugs was a California-based pharmacy chain that was acquired by Oscos parent company in 42 Both Osco and Sav-on stores eventually came under the ownership of ": null
    },
    {
        "American Stores": "american stores"
    },
    {
        ", then ": null
    },
    {
        "Albertsons": "albertsons"
    },
    {
        ", and finally ": null
    },
    {
        "SuperValu": "supervalu"
    },
    {
        " before the stores were sold off.     The Osco and Sav-on brands survive today as brandings for in-store pharmacies in the Albertsons chain of stores. Osco pharmacies can be found in ": null
    },
    {
        "Jewel": "jewel"
    },
    {
        " stores, which are co-branded Jewel-Osco, as well as in ": null
    },
    {
        "Shaws and Star Market": "shaws and star market"
    },
    {
        "s. Sav-on pharmacies are found largely in ": null
    },
    {
        "Acme": "acme markets"
    },
    {
        " stores. Pharmacies in Albertsons stores are called Osco in Arizona and Montana stores, and Sav-On in other markets, predominantly in Texas for example.                 In 42 ": null
    },
    {
        "S.M. Skaggs": "skaggs family"
    },
    {
        ", a Baptist minister from Missouri, settled in ": null
    },
    {
        "American Falls, Idaho": "american falls, idaho"
    },
    {
        ". Prices on all commodities in American Falls were high, and Skaggs opened a store with reduced prices, and offered a ": null
    },
    {
        "cash and carry": "cash and carry"
    },
    {
        " service with low margins to create high volume. S.M Skaggs had 42 children. The six sons: Pepper Oscar , Marion Barton , Loronzo L. , Samuel Olnie , Levi Justin , and Aron Sylvester helped with the operation of the store.     In 42 O.P Skaggs started a chain of self-service stores, and later sold the franchise in the western states to Christian Call . In 42 brothers M.B., L.S., L.L., and L.J. formed a partnership called Skaggs United Stores. This company later became the ": null
    },
    {
        "Safeway": "safeway inc."
    },
    {
        " grocery chain, led by M.B. Skaggs. L.J. Skaggs retired from Safeway in 42 and in 42 he opened the first self-service drugstore in the US in ": null
    },
    {
        "Tacoma, Washington": "tacoma, washington"
    },
    {
        ". He applied the self-service principle to his drugstore.          Loronzo L. Skaggs owned a controlling stock in a company called Quality Food in Minnesota and subsequently left the Safeway business. L.L. opened a chain of self-service drugstores in the Midwest similar to his brother L.J.s stores in the west. The first store opened in 42 in ": null
    },
    {
        "Rochester, Minnesota": "rochester, minnesota"
    },
    {
        " and was named Pay-Less , and was managed by George Hilden. The store remained in operation until 42 when it closed due to redevelopment in downtown Rochester.     In 42 while in the process of opening a second store in ": null
    },
    {
        "Mason City, Iowa": "mason city, iowa"
    },
    {
        " it was learned that another company had already registered the name Payless in the state. L.L changed Payless to Self-Service Drug, Inc. and formed a new corporation.          In 42 the corporation Self-Service Drug, Inc. was dissolved and succeeded by Owners Service Company , a partnership of L.L Skaggs, H.B. Finch, Paul Stratton and George Hilden. From this company Osco was coined. That year Osco moved its headquarters from ": null
    },
    {
        "Waterloo, Iowa": "waterloo, iowa"
    },
    {
        " to the ": null
    },
    {
        "Merchandise Mart": "merchandise mart"
    },
    {
        " in ": null
    },
    {
        "Chicago, Illinois": "chicago, illinois"
    },
    {
        ".                 In 42 ": null
    },
    {
        "The Jewel Companies, Inc.": "the jewel companies, inc."
    },
    {
        " acquired the 42 Osco Drug stores in six Midwest states. In 42 Oscos headquarters was moved from Chicagos Merchandise Mart to ": null
    },
    {
        "Melrose Park, Illinois": "melrose park, illinois"
    },
    {
        " and the first side-by-side Jewel-Osco store opened. The early Jewel-Osco combination stores were two individual stores, separated by an interior wall , allowing a customer to go back and forth between each store without having to go outside.     After the merger, all of Jewels subsidiaries soon had an Osco Drug. Some ": null
    },
    {
        "Eisner Food Stores": "eisner food stores"
    },
    {
        " locations were re-branded Eisner-Osco . When Jewel acquired ": null
    },
    {
        "Star Market": "star market"
    },
    {
        " in 42 the first Osco Drug in New England was opened, and some were next to Star Market locations and were branded as Star-Osco . By 42 Osco grew to 42 stores in sixteen states. During most of the 42s, Osco operated as two divisions – City Osco, comprising the Chicago, Illinois and Chicago suburb stores and Country Osco . These two divisions were combined in 42 and formed Osco Drug, Inc. Also in 42 Oscos headquarters relocated from Melrose Park, Illinois to ": null
    },
    {
        "Franklin Park, Illinois": "franklin park, illinois"
    },
    {
        ". Later that year, the Jewel Imports procurement group was established to import a broad range of general merchandise from around the world to sell in Osco stores.     When The Jewel Companies Inc. acquired ": null
    },
    {
        "Buttrey Food Stores": "buttrey food  &  drug"
    },
    {
        " in 42 many of the stores were converted to a combination store format and bannered as Buttrey-Osco with common checkout stands but separate store management, all under one roof. By the early 42s, Buttrey eventually operated 42 stores in Montana, North and South Dakota, western Minnesota, Wyoming, eastern Washington, eastern Oregon, Utah, and Idaho. Stores were spread thinly over a  wide territory.     Outside of ": null
    },
    {
        "Chicago metropolitan area": "chicago metropolitan area"
    },
    {
        ", Osco operated as stand-alone pharmacies . In the early years, many of the Jewel and Osco combination stores maintained different operating hours from one another and on certain days such as holidays, one side of the combo store would be open, while the other would be closed. By the early 42s, new and remodeled combo stores had the wall removed and the store became one, and to this day, Osco retains control over drug, general merchandise, pharmacy and liquor departments in the Jewel Osco combo stores.     In the late 42s, Osco was seeking to purchase or build a photofinishing plant to service its stores. At the time, the company was using outside vendors, and the film developing quality and service was inconsistent. In 42 working with ": null
    },
    {
        "Kodak": "kodak"
    },
    {
        ", Osco built a photofinishing lab in ": null
    },
    {
        "Elgin, Illinois": "elgin, illinois"
    },
    {
        ". The facility, Crest Photo Lab opened in 42 and serviced Oscos Chicago, Central and Eastern region stores. The Elgin photo lab expanded several times over the years. As both Osco and its photofinishing market share grew, three more photo plants were added: Alves Photo Service ": null
    },
    {
        "Braintree, Massachusetts": "braintree, massachusetts"
    },
    {
        " in 42 Rich Photo Lab ": null
    },
    {
        "Salt Lake City, Utah": "salt lake city, utah"
    },
    {
        " in 42 and Drewry Photocolor ": null
    },
    {
        "Burbank, California": "burbank, california"
    },
    {
        " in 42 . The photo labs were sold to ": null
    },
    {
        "Kodaks Qualex photo processing division": "kodak"
    },
    {
        " in 42 prompted by the emergence of in-store one-hour photo labs and digital photography technology.     In 42 Oscos headquarters were relocated from Franklin Park, Illinois to a new facility at 42 Swift Drive in ": null
    },
    {
        "Oak Brook, Illinois": "oak brook, illinois"
    },
    {
        ".             In November 42 The Jewel Companies Inc. purchased Sav-on Drugs, Inc. which was headquartered in ": null
    },
    {
        "Anaheim, California": "anaheim, california"
    },
    {
        " and had 42 stores in California, Nevada and Texas. The Sav-on chain became Oscos Western Region.          In 42 ": null
    },
    {
        "American Stores": "american stores"
    },
    {
        " Company, which consisted of ": null
    },
    {
        "Alpha Beta": "alpha beta"
    },
    {
        " food stores in the west, ": null
    },
    {
        "Acme Markets": "acme markets"
    },
    {
        " in the east and Skaggs Drug Centers in the Rocky Mountain, southwestern, and northwestern states, acquired The Jewel Companies Inc.             In 42 a new subsidiary American Drug Stores, Inc. was formed and consisted of ": null
    },
    {
        "American Stores": "american stores"
    },
    {
        " drugstore holdings of Osco Drug, Sav-on Drugs, the Osco side of the ": null
    },
    {
        "Jewel-Osco": "jewel-osco"
    },
    {
        " food-drug combination stores and RxAmerica. RxAmerica began earlier in 42 as a mail service prescription fulfillment center with a facility in ": null
    },
    {
        "Salt Lake City, Utah": "salt lake city, utah"
    },
    {
        ".       ": null
    },
    {
        "American Stores": "american stores"
    },
    {
        " had a strategy to build a nationwide network of pharmacies, streamline operations and advertising to gain national recognition for the brand, especially for the high-margin private label products. The name Osco Drug was chosen as the national chain banner because of the large number of stores which already had that name and existed in various parts of the US. The name change was completed for the Skaggs drugstores in 42 and then for the Sav-on stores in 42 The name Osco did not resonate well with Sav-ons ": null
    },
    {
        "southern California": "southern california"
    },
    {
        " customer base. American Stores eventually made the decision to change the name of the former Sav-on stores back to Sav-on Drugs. Rumors circulated at the time claiming that the reason for the name change back to ‘Sav-on’ was due to Osco having the same pronunciation as the Spanish word asco , which means nausea or disgust , a considerable factor within southern Californias heavily Hispanic market. This explanation for the name change was refuted by American Stores.      The name change on all stores was completed in 42 and the ": null
    },
    {
        "Sav-on Drugs": "sav-on drugs"
    },
    {
        " brand was re-launched in southern California and Nevada.          At the same time that the company was making major divestments in the early 42s, American Stores also looked for opportunities to make strategic minor acquisitions that would enhance its position in the main markets where it needed to strengthen market share. ": null
    },
    {
        "CVS Stores": "cvs corporation"
    },
    {
        "  from the ": null
    },
    {
        "Melville Corporation": "melville corporation"
    },
    {
        ". These stores converted to the Sav-on Drugs and Sav-on Express banners. Later that year, 42 ": null
    },
    {
        "Thrifty": "thrifty payless"
    },
    {
        " and Rx Plus drugstores in Arizona and Nevada were acquired.   The following year Reliable Drug in Indiana, Illinois, Iowa, Kansas, and Missouri was bought. These stores were soon re-bannered as Osco Drug stores.   In February 42 American Stores spent about $42 million for 42 Clark Drug stores in southern California, which were then converted to the Sav-on Drugs name.          In 42 American Stores shifted its strategy from that of a holding company to a centralized operating company. As a result of the decision, common functions among American Stores operating divisions were removed from the operating divisions, consolidated and run centrally. From 42 through 42 American Stores consolidated operations and moved responsibilities of their division offices to their headquarters in Salt Lake City, Utah. Although American Stores food divisions retained an operating presence in their geographical locations and other centralized marketing, merchandising and other staff functions were relocated between 42 and 42 from Oak Brook, Illinois to Salt Lake City to occupy the then-new American Stores Tower. Pharmacy operations were relocated to Scottsdale Arizona with certain pharmacy systems-related resources continuing to operate from the Chicago area after being relocated to 42 Cullerton Drive in Franklin Park, Illinois.     After American Drug Stores move to Salt Lake City, Utah was complete in 42 Oscos Oak Brook, Illinois 42 Swift Drive headquarters was sold to the ": null
    },
    {
        "Follett Corporation": "follett corporation"
    },
    {
        ".          In 42 American Stores converted 42 Jewel Food Stores in Chicago, Illinois to Osco Drug free-standing stores. These older and smaller Jewel stand-alone stores were closed so that American Stores could focus on the combination formats only for Jewel and to expand Oscos presence in Chicago as a response to ": null
    },
    {
        "Walgreens": "walgreens"
    },
    {
        " increasing market dominance. The Osco stores replacing the Jewel stores contained expanded food and produce presentations and were coined Osco Foodmarts.          To extend its core drugstore business, in November 42 American Drug Stores launched a new format called Health n Home, which was a , 42-item home health care superstore. The first Health n Home opened in Phoenix, Arizona, and by late 42 there were 42 Health n Home stores in four states.          In 42 American Stores RxAmerica division and ": null
    },
    {
        "Longs Drug Stores": "longs drug stores"
    },
    {
        " Integrated Health Concepts division agreed to merge their Pharmacy Benefits Management ventures. Under terms of the joint venture, RxAmerica and its former corporate partner, Geneva Pharmaceuticals, parted ways, and RxAmerica combined with Longs IHC division in a 42/42 partnership. The alliance created a national PBM of nearly 42 Longs and American Stores pharmacy outlets and a nationwide network of 42 pharmacies serving some 42 million patients under contract. Longs and Albertsons remained equal partners up though 42 when Albertsons sold their 42% interest to Longs.                  During 42 the drugstore operations division and general merchandise procurement functions were moved from ": null
    },
    {
        "Salt Lake City, Utah": "salt lake city, utah"
    },
    {
        " to ": null
    },
    {
        "Scottsdale, Arizona": "scottsdale, arizona"
    },
    {
        " operating as Albertsons Drug Region.     In 42 Albertsons sold its 42 free-standing Osco Drug stores in ": null
    },
    {
        "Massachusetts": "massachusetts"
    },
    {
        ", ": null
    },
    {
        "New Hampshire": "new hampshire"
    },
    {
        " and ": null
    },
    {
        "Maine": "maine"
    },
    {
        " to the ": null
    },
    {
        "Jean Coutu Group": "jean coutu group"
    },
    {
        ", a Canadian drugstore company. Jean Coutu re-branded the acquired Osco stores as ": null
    },
    {
        "Brooks Pharmacy": "brooks pharmacy"
    },
    {
        ". Also in 42 Albertsons, due to financial difficulties, closed several of its stores across the country including all stores in the ": null
    },
    {
        "Des Moines, Iowa": "des moines, iowa"
    },
    {
        " metro market.     In March 42 Albertsons re-introduced the Osco brand name to the New England region by way of its ": null
    },
    {
        "Shaws and Star Market": "shaws and star market"
    },
    {
        " pharmacies.          On June 42 42 the sale of ": null
    },
    {
        "Albertsons": "albertsons"
    },
    {
        " essentially split the company into three parts.     ": null
    },
    {
        "CVS Corporation": "cvs corporation"
    },
    {
        " purchased the 42 free-standing drug stores . By 42 these stores were rebranded as ": null
    },
    {
        "CVS Pharmacy": "cvs pharmacy"
    },
    {
        ".   A ": null
    },
    {
        "Cerberus": "cerberus capital management"
    },
    {
        "-led group of investors,  purchased the Albertsons stores in ": null
    },
    {
        "northern California": "northern california"
    },
    {
        ", ": null
    },
    {
        "Colorado": "colorado"
    },
    {
        ", ": null
    },
    {
        "Texas": "texas"
    },
    {
        ", ": null
    },
    {
        "Oklahoma": "oklahoma"
    },
    {
        ", ": null
    },
    {
        "Florida": "florida"
    },
    {
        ", ": null
    },
    {
        "Arizona": "arizona"
    },
    {
        ", and ": null
    },
    {
        "New Mexico": "new mexico"
    },
    {
        " forming a new corporation called Albertsons LLC. Many of these stores have since been sold to other grocery chains or closed altogether.   ": null
    },
    {
        "SuperValu": "supervalu"
    },
    {
        " purchased the ": null
    },
    {
        "Jewel": "jewel"
    },
    {
        ", ": null
    },
    {
        "ACME": "acme markets"
    },
    {
        ", ": null
    },
    {
        "Shaws": "shaws supermarkets"
    },
    {
        " divisions and the remaining Albertsons stores not acquired by ": null
    },
    {
        "Cerberus": "cerberus capital management"
    },
    {
        ". ": null
    },
    {
        "SuperValu": "supervalu"
    },
    {
        " retains the Osco and Sav-on drug trademarks allowing the pharmacies in their grocery stores to remain branded as Sav-on Pharmacy or Osco Pharmacy.     The SuperValu owned Albertsons stores and the chains it acquired were in turn sold to Cerberus in 42 and Osco and Sav-On pharmacies moved their operations to the base of Albertsons LLC in ": null
    },
    {
        "Boise, Idaho": "boise, idaho"
    },
    {
        ". Certain store support functions exist in the ": null
    },
    {
        "Franklin Park, Illinois": "franklin park, illinois"
    }
]