[
    {
        "      Osechi-ryōri are traditional ": null
    },
    {
        "Japanese New Year": "japanese new year"
    },
    {
        " foods. The tradition started in the ": null
    },
    {
        "Heian period": "heian period"
    },
    {
        " . Osechi are easily recognizable by their special boxes called  jūbako  , which resemble  bentō  boxes. Like bentō boxes, jūbako are often kept stacked before and after use.       The dishes that make up osechi each have a special meaning celebrating the New Year. Some examples are:    Daidai  , ": null
    },
    {
        "Japanese bitter orange": "bitter orange"
    },
    {
        ". Daidai means from generation to generation when written in different ": null
    },
    {
        "kanji": "kanji"
    },
    {
        " as 代々. Like kazunoko below, it symbolizes a wish for children in the New Year.   Datemaki , sweet rolled omelette mixed with fish paste or mashed shrimp. They symbolize a wish for many auspicious days. On auspicious days , Japanese people traditionally wear fine clothing as a part of enjoying themselves. One of the meanings associated with the second kanji includes fashionability, derived from the illustrious dress of the ": null
    },
    {
        "samurai": "samurai"
    },
    {
        " from ": null
    },
    {
        "Date": "date clan"
    },
    {
        " Han": "han"
    },
    {
        ".    Kamaboko  , broiled fish cake. Traditionally, slices of red and white kamaboko are alternated in rows or arranged in a pattern. The color and shape are reminiscent of Japan ": null
    },
    {
        "rising sun": "land of the rising sun"
    },
    {
        ", and have a celebratory, festive meaning.   Kazunoko , ": null
    },
    {
        "herring": "herring"
    },
    {
        " roe": "roe"
    },
    {
        ". Kazu means number and ko means child. It symbolizes a wish to be gifted with numerous children in the New Year.    Konbu  , a kind of ": null
    },
    {
        "seaweed": "seaweed"
    },
    {
        ". It is associated with the word yorokobu, meaning joy.   Kuro-mame , ": null
    },
    {
        "black soybeans": "soybean"
    },
    {
        ". Mame also means health, symbolizing a wish for health in the New Year.   Kohaku-namasu , literally red-white vegetable ": null
    },
    {
        "kuai": "kuai"
    },
    {
        ", is made of ": null
    },
    {
        "daikon": "daikon"
    },
    {
        " and carrot cut into thin strips and pickled in sweetened vinegar with ": null
    },
    {
        "yuzu": "yuzu"
    },
    {
        " flavor.   Tai , ": null
    },
    {
        "red sea-bream": "bream"
    },
    {
        ". Tai is associated with the Japanese word medetai, symbolizing an auspicious event.   Tazukuri , dried ": null
    },
    {
        "sardines": "sardines"
    },
    {
        " cooked in ": null
    },
    {
        "soy sauce": "soy sauce"
    },
    {
        ". The literal meaning of the kanji in tazukuri is rice paddy maker, as the fish were used historically to fertilize rice fields. The symbolism is of an abundant harvest.    Zōni  , a soup of ": null
    },
    {
        "mochi": "mochi"
    },
    {
        " rice cakes in clear broth or ": null
    },
    {
        "miso": "miso"
    },
    {
        " broth .   Ebi , skewered ": null
    },
    {
        "prawn": "prawn"
    },
    {
        "s cooked with ": null
    },
    {
        "sake": "sake"
    },
    {
        " and ": null
    },
    {
        "soy sauce": "soy sauce"
    },
    {
        ". It symbolizes a wish for a long-life, suggesting long beard and bent waist.   Nishiki tamago , egg roulade; the egg is separated before cooking, yellow symbolizing gold, and white symbolizing silver, both of these together symbolising wealth and good fortune.       The term osechi originally referred to o-sechi, a season or significant period. ": null
    },
    {
        "New Years Day": "new years day"
    },
    {
        " was one of the five seasonal festivals in the ": null
    },
    {
        "Imperial Court in Kyoto": "imperial court in kyoto"
    },
    {
        ". This custom of celebrating particular days was introduced from ": null
    },
    {
        "China": "china"
    },
    {
        " into Japan.     Originally, during the first three days of the New Year, it was a taboo to use a hearth and cook meals, except when cooking  zōni . Osechi was made by the close of the previous year, as women did not cook in the New Year.     In the earliest days, osechi consisted only of nimono, boiled vegetables with ": null
    },
    {
        "soy sauce": "soy sauce"
    },
    {
        " and ": null
    },
    {
        "sugar": "sugar"
    },
    {
        " or ": null
    },
    {
        "mirin": "mirin"
    },
    {
        ". Over the generations, the variety of food included in osechi has increased. Today it may refer to anything prepared specially for the New Year, and some foreign dishes have been adopted as Westernized osechi  or as Korean-style osechi . And while osechi was traditionally prepared at home, it is also sold ready-made in specialty stores, grocery stores, and even convenience stores, such as ": null
    },
    {
        "42-Eleven": "7-eleven"
    },
    {
        ".     Especially in households where osechi is still homemade, toshi-koshi soba  is eaten on ": null
    },
    {
        "New Years Eve": "new years eve"
    },
    {
        ". Its name literally means year-crossing soba. Although there may be some symbolism attributed to it , this tradition may be regarded as largely pragmatic: the traditional wife, busy cooking several days worth of food for everyone, would likely prefer to make something simple for immediate consumption. It is considered bad luck by many Japanese to leave any toshi-koshi soba": null
    }
]