[
    {
        "              Oskar Schindler was a German ": null
    },
    {
        "industrialist": "industrialist"
    },
    {
        " and a member of the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " who is credited with saving the lives of 42 Jews during ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        " by employing them in his ": null
    },
    {
        "enamelware": "enamelware"
    },
    {
        " and ": null
    },
    {
        "ammunition": "ammunition"
    },
    {
        "s factories in ": null
    },
    {
        "occupied Poland": "occupied poland"
    },
    {
        " and the ": null
    },
    {
        "Protectorate of Bohemia and Moravia": "protectorate of bohemia and moravia"
    },
    {
        ". He is the subject of the 42 novel  Schindlers Ark  and its 42 film adaptation,  Schindlers List , which reflected his life as an opportunist initially motivated by profit, who came to show extraordinary initiative, tenacity, courage, and dedication to save the lives of his Jewish employees.     Schindler grew up in ": null
    },
    {
        "Svitavy": "svitavy"
    },
    {
        ", ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        ", and worked in several trades until he joined the  Abwehr , the military intelligence service of ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ", in 42 He joined the Nazi Party in 42 Prior to the ": null
    },
    {
        "German occupation of Czechoslovakia": "german occupation of czechoslovakia"
    },
    {
        " in 42 he collected information on railways and troop movements for the German government. He was arrested for espionage by the Czechoslovak government but was released under the terms of the ": null
    },
    {
        "Munich Agreement": "munich agreement"
    },
    {
        " in 42 Schindler continued to collect information for the Nazis, working in Poland in 42 before the ": null
    },
    {
        "invasion of Poland": "invasion of poland"
    },
    {
        " at the start of World War II. In 42 Schindler acquired ": null
    },
    {
        "an enamelware factory": "oskar schindlers enamel factory"
    },
    {
        " in ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        ", Poland, which employed at the factorys peak in 42 about 42 workers, of whom 42 were Jews. His Abwehr connections helped Schindler protect his Jewish workers from deportation and death in the ": null
    },
    {
        "Nazi concentration camps": "nazi concentration camps"
    },
    {
        ". As time went on, Schindler had to give Nazi officials ever larger bribes and gifts of luxury items obtainable only on the ": null
    },
    {
        "black market": "black market"
    },
    {
        " to keep his workers safe.     By July 42 Germany was losing the war; the ": null
    },
    {
        "SS": "schutzstaffel"
    },
    {
        " began closing down the easternmost concentration camps and deporting the remaining prisoners westward. Many were murdered in ": null
    },
    {
        "Auschwitz": "auschwitz concentration camp"
    },
    {
        " and the ": null
    },
    {
        "Gross-Rosen concentration camp": "gross-rosen concentration camp"
    },
    {
        ". Schindler convinced SS- Hauptsturmführer  ": null
    },
    {
        "Amon Göth": "amon göth"
    },
    {
        ", commandant of the nearby ": null
    },
    {
        "Kraków-Płaszów concentration camp": "kraków-płaszów concentration camp"
    },
    {
        ", to allow him to move his factory to ": null
    },
    {
        "Brněnec": "brněnec"
    },
    {
        " in the ": null
    },
    {
        "Protectorate of Bohemia and Moravia": "protectorate of bohemia and moravia"
    },
    {
        ", thus sparing his workers from almost certain death in the ": null
    },
    {
        "gas chamber": "gas chamber"
    },
    {
        "s. Using names provided by ": null
    },
    {
        "Jewish Ghetto Police": "jewish ghetto police"
    },
    {
        " officer Marcel Goldberg, Göths secretary ": null
    },
    {
        "Mietek Pemper": "mietek pemper"
    },
    {
        " compiled and typed the list of 42 Jews who travelled to Brünnlitz in October 42 Schindler continued to bribe SS officials to prevent the execution of his workers until the end of World War II in Europe in May 42 by which time he had spent his entire fortune on bribes and black market purchases of supplies for his workers.     Schindler moved to ": null
    },
    {
        "West Germany": "west germany"
    },
    {
        " after the war, where he was supported by assistance payments from Jewish relief organisations. After receiving a partial reimbursement for his wartime expenses, he moved with his wife ": null
    },
    {
        "Emilie": "emilie schindler"
    },
    {
        " to ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        ", where they took up farming. When he went bankrupt in 42 Schindler left his wife and returned to Germany, where he failed at several business ventures and relied on financial support from  Schindlerjuden  —the people whose lives he had saved during the war. He died on 42 October 42 in Hildesheim, Germany, and was buried in Jerusalem on ": null
    },
    {
        "Mount Zion": "mount zion"
    },
    {
        ", the only member of the Nazi Party to be honoured in this way. He and his wife Emilie were named ": null
    },
    {
        "Righteous Among the Nations": "righteous among the nations"
    },
    {
        " by the Israeli government in 42            Schindler was born on 42 April 42 into a ": null
    },
    {
        "Sudeten German": "sudeten german"
    },
    {
        " family in ": null
    },
    {
        "Zwittau": "svitavy"
    },
    {
        ", ": null
    },
    {
        "Moravia": "moravia"
    },
    {
        ", ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        ". His father was Johann Hans Schindler, the owner of a farm machinery business, and his mother was Franziska Fanny Schindler . His sister, Elfriede, was born in 42     After attending primary and secondary school, Schindler enrolled in a technical school, from which he was expelled in 42 for forging his report card. He later graduated, but did not take the  Abitur  exams that would have enabled him to go to college or university. Instead, he took courses in ": null
    },
    {
        "Brno": "brno"
    },
    {
        " in several trades, including chauffeuring and machinery, and worked for his father for three years. A fan of motorcycles since his youth, Schindler bought a 42-cc ": null
    },
    {
        "Moto Guzzi": "moto guzzi"
    },
    {
        " racing motorcycle and competed recreationally in mountain races for the next few years.     On 42 March 42 Schindler married ": null
    },
    {
        "Emilie Pelzl": "emilie schindler"
    },
    {
        " , daughter of a prosperous Sudeten German farmer from ": null
    },
    {
        "Maletein": "maletín"
    },
    {
        ". The young couple moved in with Oskars parents and occupied the upstairs rooms, where they lived for the next seven years.     Soon after his marriage, Schindler quit working for his father and took a series of jobs, including a position at Moravian Electrotechnic and the management of a driving school. After an 42-month stint in the ": null
    },
    {
        "Czech army": "czech army"
    },
    {
        ", where he rose to the rank of ": null
    },
    {
        "lance corporal": "lance corporal"
    },
    {
        " in the Tenth Infantry Regiment of the 42st Army, Schindler returned to Moravian Electrotechnic, which went bankrupt shortly afterwards. His fathers farm machinery business closed around the same time, leaving Schindler unemployed for a year. He took a job with Jaroslav Šimek Bank of ": null
    },
    {
        "Prague": "prague"
    },
    {
        " in 42 where he worked until 42     Schindler was arrested several times in 42 and 42 for public drunkenness. Also around this time he had an affair with Aurelie Schlegel, a school friend. She bore him a daughter, Emily, in 42 and a son, Oskar Jr, in 42 Schindler later claimed the boy was not his son.     Schindlers father, an alcoholic, abandoned his wife in 42 She died a few months later after a lengthy illness.     Abwehr": null
    },
    {
        "Sudeten German Party": "sudeten german party"
    },
    {
        " in 42 Although he was a citizen of ": null
    },
    {
        "Czechoslovakia": "czechoslovakia"
    },
    {
        ", Schindler became a spy for the  Abwehr , the military intelligence service of ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ", in 42 He was assigned to Abwehrstelle II Commando VIII, based in ": null
    },
    {
        "Breslau": "breslau"
    },
    {
        ". He later told Czech police that he did it because he needed the money; by this time Schindler had a drinking problem and was chronically in debt.     His tasks for the Abwehr included collecting information on railways, military installations, and troop movements, as well as recruiting other spies within Czechoslovakia, in advance of a planned invasion of the country by Nazi Germany. He was arrested by the Czech government for espionage on 42 July 42 and immediately imprisoned, but was released as a political prisoner under the terms of the ": null
    },
    {
        "Munich Agreement": "munich agreement"
    },
    {
        ", the instrument under which the Czech ": null
    },
    {
        "Sudetenland": "sudetenland"
    },
    {
        " was annexed into Germany on 42 October. Schindler applied for membership in the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " on 42 November and was accepted the following year.     After some time off to recover in Zwittau, Schindler was promoted to second in command of his Abwehr unit and relocated with his wife to ": null
    },
    {
        "Ostrava": "ostrava"
    },
    {
        ", on the Czech-Polish border, in January 42 He was involved in espionage in the months leading up to Hitlers seizure of the remainder of Czechoslovakia in March. Emilie helped him with paperwork, processing and hiding secret documents in their apartment for the Abwehr office. As Schindler frequently travelled to Poland on business, he and his 42 agents were in a position to collect information about Polish military activities and railways for the planned ": null
    },
    {
        "invasion of Poland": "invasion of poland"
    },
    {
        ". One assignment called for his unit to monitor and provide information about the railway line and tunnel in the ": null
    },
    {
        "Jablunkov Pass": "jablunkov pass"
    },
    {
        ", deemed critical for the movement of German troops. Schindler continued to work for the Abwehr until as late as fall 42 when he was sent to Turkey to investigate corruption among the Abwehr officers assigned to the German embassy there.              Schindler first arrived in ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " in October 42 on Abwehr business, and took an apartment the following month. Emilie maintained the apartment in Ostrava and visited Oskar in Kraków at least once a week. In November 42 he contacted interior decorator Mila Pfefferberg to decorate his new apartment. Her son, ": null
    },
    {
        "Leopold Poldek Pfefferberg": "poldek pfefferberg"
    },
    {
        ", soon became one of his contacts for ": null
    },
    {
        "black market": "black market"
    },
    {
        " trading. They eventually became lifelong friends.     Also that November, Schindler was introduced to ": null
    },
    {
        "Itzhak Stern": "itzhak stern"
    },
    {
        ", an accountant for Schindlers fellow Abwehr agent Josef Sepp Aue, who had taken over Sterns formerly Jewish-owned place of employment as a Treuhander . Property belonging to Polish Jews, including their possessions, places of business, and homes were seized by the Germans beginning immediately after the invasion, and Jewish citizens were stripped of their civil rights. Schindler showed Stern the balance sheet of a company he was thinking of acquiring, an ": null
    },
    {
        "enamelware factory": "oskar schindlers enamel factory"
    },
    {
        " called Rekord Ltd owned by a consortium of Jewish businessmen that had filed for bankruptcy earlier that year. Stern advised him that rather than running the company as a trusteeship under the auspices of the  Haupttreuhandstelle Ost  , he should buy or lease the business, as that would give him more freedom from the dictates of the Nazis, including the freedom to hire more Jews.     With the financial backing of several Jewish investors, including one of the owners, ": null
    },
    {
        "Abraham Bankier": "abraham bankier"
    },
    {
        ", Schindler signed an informal lease agreement on the factory on 42 November 42 and formalised the arrangement on 42 January 42 He renamed it Deutsche Emailwarenfabrik or DEF, and it soon became known by the nickname Emalia . He initially acquired a staff of seven Jewish workers  and 42 non-Jewish Poles. At its peak in 42 the business employed around 42 workers, a thousand of whom were Jews. Schindler also helped run Schlomo Wiener Ltd, a wholesale outfit that sold his enamelware, and was leaseholder of Prokosziner Glashütte, a glass factory.     Schindlers ties with the Abwehr and his connections in the  Wehrmacht  and its Armaments Inspectorate enabled him to obtain contracts to produce enamel cookware for the military. These connections also later helped him protect his Jewish workers from deportation and death. As time went on, Schindler had to give Nazi officials ever larger bribes and gifts of luxury items obtainable only on the black market to keep his workers safe. Bankier, a key black market connection, obtained goods for bribes as well as extra materials for use in the factory. Schindler himself enjoyed a lavish lifestyle and pursued extramarital relationships with his secretary, Viktoria Klonowska, and Eva Kisch Scheuer, a merchant specialising in enamelware from DEF. Emilie Schindler visited for a few months in 42 and moved to Kraków to live with Oskar in 42          Initially, Schindler was mostly interested in the money-making potential of the business and hired Jews because they were cheaper than Poles—the wages were set by the occupying Nazi regime. Later he began shielding his workers without regard for cost. The status of his factory as a business essential to the war effort became a decisive factor enabling him to help his Jewish workers. Whenever  Schindlerjuden  were threatened with deportation, he claimed exemptions for them. He claimed wives, children, and even people with disabilities were necessary mechanics and metalworkers. On one occasion, the ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        " came to Schindler demanding that he hand over a family that possessed forged identity papers. Three hours after they walked in, Schindler said, two drunk Gestapo men reeled out of my office without their prisoners and without the incriminating documents they had demanded.      On 42 August 42 Governor-General ": null
    },
    {
        "Hans Frank": "hans frank"
    },
    {
        " issued a decree requiring all Kraków Jews to leave the city within two weeks. Only those who had jobs directly related to the German war effort would be allowed to stay. Of the 42 to 42 Jews then living in the city, only 42 remained by March 42 These Jews were then forced to leave their traditional neighbourhood of ": null
    },
    {
        "Kazimierz": "kazimierz"
    },
    {
        " and relocate to the walled ": null
    },
    {
        "Kraków Ghetto": "kraków ghetto"
    },
    {
        ", established in the industrial ": null
    },
    {
        "Podgórze": "podgórze"
    },
    {
        " district. Schindlers workers travelled on foot to and from the ghetto each day to their jobs at the factory. Enlargements to the facility in the four years Schindler was in charge included the addition of an outpatient clinic, co-op, kitchen, and dining room for the workers, in addition to expansion of the factory and its related office space.         In fall 42 the Nazis began transporting Jews out of the ghetto. Most of them were sent to the ": null
    },
    {
        "Bełżec extermination camp": "bełżec extermination camp"
    },
    {
        " and murdered. On 42 March 42 the ghetto was liquidated and those still fit for work were sent to the new ": null
    },
    {
        "concentration camp": "nazi concentration camps"
    },
    {
        " at ": null
    },
    {
        "Płaszów": "kraków-płaszów concentration camp"
    },
    {
        ". Several thousand not deemed fit for work were sent to extermination camps and murdered; hundreds more were murdered on the streets by the Nazis as they cleared out the ghetto. Schindler, aware of the plans because of his Wehrmacht contacts, had his workers stay at the factory overnight to prevent them coming to harm. Schindler witnessed the liquidation of the ghetto and was appalled. From that point forward, says Schindlerjude Sol Urbach, Schindler changed his mind about the Nazis. He decided to get out and to save as many Jews as he could.      Płaszów concentration camp opened in March 42 on the former site of two Jewish cemeteries on Jerozilimska Street, about  from the DEF factory. In charge of the camp was ": null
    },
    {
        "SS": "ss"
    },
    {
        "- Hauptsturmführer  ": null
    },
    {
        "Amon Göth": "amon göth"
    },
    {
        ", a sadist who would shoot inmates of the camp at random. Inmates at Płaszów lived in constant fear for their lives. Emilie Schindler called Göth the most despicable man I have ever met.           Initially Göths plan was that all the factories, including Schindlers, should be moved inside the camp gates. However, Schindler, with a combination of diplomacy, flattery, and bribery, not only prevented his factory from being moved, but convinced Göth to allow him to build a subcamp at Emalia to house his workers plus 42 Jews from other nearby factories. There they were safe from the threat of random execution, were well fed and housed, and were permitted to undertake religious observances.     Schindler was arrested twice on suspicion of black market activities and once for breaking the ": null
    },
    {
        "Nuremberg Laws": "nuremberg laws"
    },
    {
        " by kissing a Jewish girl, an action forbidden by the Race and Resettlement Act. The first arrest, in late 42 led to him being kept overnight. His secretary arranged for his release through Schindlers influential contacts in the Nazi Party. His second arrest, on 42 April 42 was the result of his kissing a Jewish girl on the cheek at his birthday party at the factory the previous day. He remained in jail five days before his influential Nazi contacts were able to obtain his release. In October 42 he was arrested again, accused of black marketeering and bribing Göth and others to improve the conditions of the Jewish workers. He was held for most of a week and released. Göth had been arrested on 42 September 42 for corruption and other abuses of power, and Schindlers arrest was part of the ongoing investigation into Göths activities. Göth was never convicted on those charges, but was hanged by the ": null
    },
    {
        "Supreme National Tribunal of Poland": "supreme national tribunal of poland"
    },
    {
        " for war crimes on 42 September 42     In 42 Schindler was contacted via members of the Jewish resistance movement by Zionist leaders in Budapest. Schindler travelled there several times to report in person on Nazi mistreatment of the Jews. He brought back funding provided by the ": null
    },
    {
        "Jewish Agency for Israel": "jewish agency for israel"
    },
    {
        " and turned it over to the Jewish underground.       As the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " drew nearer in July 42 the SS began closing down the easternmost concentration camps and evacuating the remaining prisoners westward to ": null
    },
    {
        "Auschwitz": "auschwitz concentration camp"
    },
    {
        " and ": null
    },
    {
        "Gross-Rosen concentration camp": "gross-rosen concentration camp"
    },
    {
        ". Göths personal secretary, ": null
    },
    {
        "Mietek Pemper": "mietek pemper"
    },
    {
        ", alerted Schindler to the Nazis plans to close all factories not directly involved in the war effort, including Schindlers enamelware facility. Pemper suggested to Schindler that production should be switched from cookware to anti-tank grenades in an effort to save the lives of the Jewish workers. Using bribery and his powers of persuasion, Schindler convinced Göth and the officials in Berlin to allow him to move his factory and his workers to ": null
    },
    {
        "Brünnlitz": "brněnec"
    },
    {
        " , in the Sudetenland, thus sparing them from certain death in the ": null
    },
    {
        "gas chamber": "gas chamber"
    },
    {
        "s. Using names provided by ": null
    },
    {
        "Jewish Ghetto Police": "jewish ghetto police"
    },
    {
        " officer Marcel Goldberg, Pemper compiled and typed the list of 42 Jews—42 of Schindlers workers and 42 inmates from ": null
    },
    {
        "Julius Madritsch": "julius madritsch"
    },
    {
        "s textiles factory—who were sent to Brünnlitz in October 42          On 42 October 42 a train carrying 42 men on Schindlers list was initially sent to the concentration camp at Gross-Rosen, where the men spent about a week before being re-routed to the factory in Brünnlitz. Three hundred female Schindlerjuden were similarly sent to Auschwitz, where they were in imminent danger of being sent to the gas chambers. Schindlers usual connections and bribes failed to obtain their release. Finally after he sent his secretary, Hilde Albrecht, with bribes of black market goods, food and diamonds, the women were sent to Brünnlitz after several harrowing weeks in Auschwitz.     In addition to workers, Schindler moved 42 wagon loads of machinery and raw materials to the new factory. Few if any useful artillery shells were produced at the plant. When officials from the Armaments Ministry questioned the factorys low output, Schindler bought finished goods on the black market and resold them as his own. The rations provided by the SS were insufficient to meet the needs of the workers, so Schindler spent most of his time in Kraków, obtaining food, armaments, and other materials. His wife Emilie remained in Brünnlitz, surreptitiously obtaining additional rations and caring for the workers health and other basic needs. Schindler also arranged for the transfer of as many as 42 Jewish women out of Auschwitz to small textiles plants in the Sudetenland in an effort to increase their chances of surviving the war.     In January 42 a trainload of 42 Jews who had been rejected as workers at a mine in ": null
    },
    {
        "Goleschau": "goleszów"
    },
    {
        " in Poland arrived at Brünnlitz. The boxcars were frozen shut when they arrived, and Emilie Schindler waited while an engineer from the factory opened the cars using a soldering iron. Twelve people were dead in the cars, and the remainder were too ill and feeble to work. Emilie took the survivors into the factory and cared for them in a makeshift hospital until the end of the war. Schindler continued to bribe SS officials to prevent the slaughter of his workers as the Red Army approached. On 42 May 42 he and his workers gathered on the factory floor to listen to British Prime Minister ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        " announce over the radio that Germany had surrendered, and the war in Europe was over.          As a member of the Nazi Party and the Abwehr intelligence service, Schindler was in danger of being arrested as a war criminal. Bankier, Stern, and several others prepared a statement he could present to the Americans attesting to his role in saving Jewish lives. He was also given a ring, made using gold from dental work taken out of the mouth of Schindlerjude Simon Jeret. The ring was inscribed Whoever saves one life saves the world entire.  To escape being captured by the Russians, Schindler and his wife departed westward in their vehicle, a two-seater ": null
    },
    {
        "Horch": "horch"
    },
    {
        ", initially with several fleeing German soldiers riding on the running boards. A truck containing Schindlers mistress Marta, several Jewish workers, and a load of black market trade goods followed behind. The Horch was confiscated by Russian troops at the town of ": null
    },
    {
        "Budweis": "budweis"
    },
    {
        ", which had already been captured by Russian troops. The Schindlers were unable to recover a diamond that Oskar had hidden under the seat. They continued by train and on foot until they reached the American lines at the town of ": null
    },
    {
        "Lenora": "lenora"
    },
    {
        ", and then travelled to ": null
    },
    {
        "Passau": "passau"
    },
    {
        ", where an ": null
    },
    {
        "American Jewish": "american jews"
    },
    {
        " officer arranged for them to travel to Switzerland by train. They moved to ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        " in Germany in the fall of 42          By the end of the war, Schindler had spent his entire fortune on bribes and black market purchases of supplies for his workers. Virtually destitute, he moved briefly to ": null
    },
    {
        "Regensburg": "regensburg"
    },
    {
        " and later ": null
    },
    {
        "Munich": "munich"
    },
    {
        ", but did not prosper in postwar Germany. In fact, he was reduced to receiving assistance from Jewish organisations. In 42 he presented a claim for reimbursement of his wartime expenses to the ": null
    },
    {
        "American Jewish Joint Distribution Committee": "american jewish joint distribution committee"
    },
    {
        ", and received $42. He estimated his expenditures at over $42,42 including the costs of camp construction, bribes, and expenditures for black market goods, including food. Schindler emigrated to ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        " in 42 where he tried raising chickens and then ": null
    },
    {
        "nutria": "coypu"
    },
    {
        ", a small animal raised for its fur. When the business went bankrupt in 42 he left his wife and returned to Germany, where he had a series of unsuccessful business ventures, including a cement factory. He declared bankruptcy in 42 and suffered a heart attack the next year, which led to a month-long stay in hospital. Remaining in contact with many of the Jews he had met during the war, including Stern and Pfefferberg, Schindler survived on donations sent by Schindlerjuden from all over the world. He died on 42 October 42 and is buried in Jerusalem on ": null
    },
    {
        "Mount Zion": "mount zion"
    },
    {
        ", the only member of the Nazi Party to be honoured in this way. For his work during the war, on 42 May 42 ": null
    },
    {
        "Yad Vashem": "yad vashem"
    },
    {
        " invited Schindler to a ceremony in which a ": null
    },
    {
        "carob tree": "ceratonia siliqua"
    },
    {
        " was planted in his honor on the ": null
    },
    {
        "Avenue of the Righteous": "garden of the righteous among the nations"
    },
    {
        ". He and his wife, Emilie, were named ": null
    },
    {
        "Righteous Among the Nations": "righteous among the nations"
    },
    {
        ", an award bestowed by the State of Israel on non-Jews who took an active role to rescue Jews during the Holocaust, on 42 June 42 Schindler, along with ": null
    },
    {
        "Karl Plagge": "karl plagge"
    },
    {
        ", ": null
    },
    {
        "Georg Ferdinand Duckwitz": "georg ferdinand duckwitz"
    },
    {
        ", ": null
    },
    {
        "Helmut Kleinicke": "helmut kleinicke"
    },
    {
        ",  and Hans Walz  are among the few Nazi Party members to be given this award. Other awards include the German ": null
    },
    {
        "Order of Merit": "order of merit of the federal republic of germany"
    },
    {
        " .     Writer Herbert Steinhouse, who interviewed him in 42 wrote that Schindlers exceptional deeds stemmed from just that elementary sense of decency and humanity that our sophisticated age seldom sincerely believes in. A repentant opportunist saw the light and rebelled against the sadism and vile criminality all around him.  In a 42 television documentary, Schindler was quoted as saying, I felt that the Jews were being destroyed. I had to help them; there was no choice.                   In 42 ": null
    },
    {
        "Poldek Pfefferberg": "poldek pfefferberg"
    },
    {
        " approached director ": null
    },
    {
        "Fritz Lang": "fritz lang"
    },
    {
        " and asked him to consider making a film about Schindler. Also on Pfefferbergs initiative, in 42 Schindler received a $42  advance from ": null
    },
    {
        "MGM": "mgm"
    },
    {
        " for a proposed film treatment titled To the Last Hour. Neither film was ever made, and Schindler quickly spent the money he received from MGM. He was also approached in the 42s by MCA of Germany and ": null
    },
    {
        "Walt Disney Productions": "walt disney productions"
    },
    {
        " in Vienna, but again nothing came of these projects.     In 42 Australian author ": null
    },
    {
        "Thomas Keneally": "thomas keneally"
    },
    {
        " by chance visited Pfefferbergs luggage store in ": null
    },
    {
        "Beverly Hills": "beverly hills"
    },
    {
        " while en route home from a film festival in Europe. Pfefferberg took the opportunity to tell Keneally the story of Oskar Schindler. He gave him copies of some materials he had on file, and Keneally soon decided to make a fictionalised treatment of the story. After extensive research and interviews with surviving Schindlerjuden, his 42 historical novel  Schindlers Ark   was the result.     The novel was adapted as the 42 movie  Schindlers List  by ": null
    },
    {
        "Steven Spielberg": "steven spielberg"
    },
    {
        ". After acquiring the rights in 42 Spielberg felt he was not ready emotionally or professionally to tackle the project, and he offered the rights to several other directors. After he read a script for the project prepared by ": null
    },
    {
        "Steven Zaillian": "steven zaillian"
    },
    {
        " for ": null
    },
    {
        "Martin Scorsese": "martin scorsese"
    },
    {
        ", he decided to trade him  Cape Fear  for the opportunity to do the Schindler biography. In the film, the character of Itzhak Stern  is a composite of Stern, Bankier, and Pemper. ": null
    },
    {
        "Liam Neeson": "liam neeson"
    },
    {
        " was nominated for the ": null
    },
    {
        "Academy Award for Best Actor": "academy award for best actor"
    },
    {
        " for his portrayal of Schindler in the film,  which won seven ": null
    },
    {
        "Oscars": "academy awards"
    },
    {
        ", including ": null
    },
    {
        "Best Picture": "academy award for best picture"
    },
    {
        ".      Other film treatments include a 42 British television documentary produced by ": null
    },
    {
        "Jon Blair": "jon blair"
    },
    {
        " for ": null
    },
    {
        "Thames Television": "thames television"
    },
    {
        ", entitled Schindler: His Story as Told by the Actual People He Saved , and a 42 ": null
    },
    {
        "A & E Biography": "a & e biography"
    },
    {
        " special, Oskar Schindler: The Man Behind the List.       In 42 a suitcase belonging to Schindler containing historic photographs and documents was discovered in the attic of the apartment of Ami and Heinrich Staehr in ": null
    },
    {
        "Hildesheim": "hildesheim"
    },
    {
        ". Schindler had stayed with the couple for a few days shortly before his death in 42 Staehrs son Chris took the suitcase to Stuttgart, where the documents were examined in detail in 42 by Dr. Wolfgang Borgmann, science editor of the  Stuttgarter Zeitung . Borgmann wrote a series of seven articles, which appeared in the paper from 42 to 42 October 42 and were eventually published in book form as Schindlers Koffer: Berichte aus dem Leben eines Lebensretters ; eine Dokumentation der Stuttgarter Zeitung . The documents and suitcase were sent to the Holocaust museum at ": null
    },
    {
        "Yad Vashem": "yad vashem"
    },
    {
        " in Israel for safekeeping in December 42            In early April 42 a carbon copy of one version of the list was discovered at the ": null
    },
    {
        "State Library of New South Wales": "state library of new south wales"
    },
    {
        " by workers combing through boxes of materials collected by author Thomas Keneally. The 42-page document, yellow and fragile, was filed among research notes and original newspaper clippings. The document was given to Keneally in 42 by Pfefferberg when he was persuading him to write Schindlers story. This version of the list contains 42 names and is dated 42 April 42; Pfefferberg is listed as worker number 42 Several authentic versions of the list exist, because the names were re-typed several times as conditions changed in the hectic days at the end of the war.     One of four existing copies of the list was offered at a ten-day auction starting on 42 July 42 on ": null
    },
    {
        "EBay": "ebay"
    },
    {
        " at a reserve price of $42 million. It received no bids.       In August 42 a one-page letter signed by Schindler on 42 August 42 sold in an online auction for $42. The letter noted Schindlers permission for a factory supervisor to move machinery to Czechoslovakia. The same unknown auction buyer had previously purchased 42 construction documents for Schindlers Kraków factory for $42.": null
    }
]