[
    {
        "     The Osmundaceae is a family of four to six extant genera and 42–42 known species. It is the only ": null
    },
    {
        "fern": "fern"
    },
    {
        " family of the order Osmundales an order in the class Polypodiopsida  or in some classifications the only order in the class Osmundopsida. This is an ancient  and fairly isolated group that is often known as the flowering ferns because of the striking aspect of the ripe ": null
    },
    {
        "sporangia": "sporangia"
    },
    {
        " in Claytosmunda, Osmunda, Osmundastrum, and Plensium . In these genera the sporangia are borne naked on non-laminar pinnules, while Todea and Leptopteris  bear sporangia naked on laminar pinnules. Ferns in this family are larger than most other ferns.       The stems of Osmundaceae contain ": null
    },
    {
        "vascular tissue": "vascular tissue"
    },
    {
        " arranged as an ectophloic ": null
    },
    {
        "siphonostele": "siphonostele"
    },
    {
        "; that is, a ring of ": null
    },
    {
        "phloem": "phloem"
    },
    {
        " occurs on the outside only of a ring of ": null
    },
    {
        "xylem": "xylem"
    },
    {
        ", which surrounds ": null
    },
    {
        "pith": "pith"
    },
    {
        " .   ": null
    },
    {
        "Stipules": "stipules"
    },
    {
        " can be discerned at the leaf bases of these ferns. The hardened leaf bases are persistent and overlap to form a hardened layer surrounding the stem. The mantle of ": null
    },
    {
        "sclerenchyma": "sclerenchyma"
    },
    {
        "tous leaf bases and intermixed roots can form a woody trunk when the stem emerges above ground, up to  in  Todea barbara . Extinct members of the family, which flourished during the ": null
    },
    {
        "Mesozoic": "mesozoic"
    },
    {
        ", could reach the stature of trees and be termed ": null
    },
    {
        "tree fern": "tree fern"
    },
    {
        "s. The leaves are either holodimorphic, with separate fertile and sterile fronds assuming an entirely different structure, or have fertile and sterile portions of the frond very distinct in structure.     ": null
    },
    {
        "Sporangia": "sporangia"
    },
    {
        " in the Osmundaceae are large, and open at a slit on the top; the ": null
    },
    {
        "annulus": "annulus"
    },
    {
        " that drives the sporangium opening is on the side. 42 to 42 spores are typically present. The spores are green, nearly round, and trilete. The spores germinate into ": null
    },
    {
        "gametophyte": "gametophyte"
    },
    {
        "s, which are green and grow at the surface. They are large and heart-shaped. The base chromosome number for members of the order is 42         Smith et al. carried out the first higher-level ": null
    },
    {
        "pteridophyte": "pteridophyte"
    },
    {
        " classification published in the ": null
    },
    {
        "molecular phylogenetic": "molecular phylogenetic"
    },
    {
        " era, creating four ": null
    },
    {
        "classes": "class"
    },
    {
        " of ": null
    },
    {
        "ferns": "ferns"
    },
    {
        " . At that time they used the term Polypodiopsida  sensu stricto  to apply to the largest of these. Later the term Polypodiopsida sensu lato was used to refer to all four subclasses, and the large subclass renamed ": null
    },
    {
        "Polypodiidae": "polypodiidae"
    },
    {
        ". This is also referred to informally as the ": null
    },
    {
        "leptosporangiate ferns": "leptosporangiate ferns"
    },
    {
        ". The Polypodiidae contain seven ": null
    },
    {
        "orders": "order"
    },
    {
        " whose ": null
    },
    {
        "phylogenic": "phylogenic"
    },
    {
        " relationship is shown in the following ": null
    },
    {
        "cladogram": "cladogram"
    },
    {
        ", where Osmundales is seen as a ": null
    },
    {
        "sister": "sister group"
    },
    {
        " to all other members of the subclass.              In the Pteridophyte Phylogeny Group classification Osmundales consists of the single family Osmundaceae, six genera, and an estimated 42 species .     The three genera Osmunda, Leptopteris, and Todea were recognized as members of Osmundaceae by Smith et al.  Of these, the largest genus, Osmunda, had traditionally been treated as three subgenera, Osmunda , Osmundastrum , and Plenasium . However, there was suspicion that the genus was not ": null
    },
    {
        "monophyletic": "monophyletic"
    },
    {
        ".     The first molecular phylogeny  showed that Osmunda as traditionally ": null
    },
    {
        "circumscribed": "circumscription"
    },
    {
        " was ": null
    },
    {
        "paraphyletic": "paraphyletic"
    },
    {
        " and that  Osmunda cinnamomea , despite its morphological similarity to  Osmunda claytoniana , was ": null
    },
    {
        "sister": "sister group"
    },
    {
        " to the rest of the family. This was later confirmed by a detailed species-level ": null
    },
    {
        "phylogeny": "phylogeny"
    },
    {
        " of the family by Metzgar et al. leading to the resurrection of the ": null
    },
    {
        "segregate": "segregate"
    },
    {
        " genus Osmundastrum, by elevating it from subgenus, to contain it and render Osmunda ": null
    },
    {
        "monophyletic": "monophyletic"
    },
    {
        ". Todea and Leptopteris are consistently resolved as sister groups, and Osmunda was found to contain three separate subclades corresponding to subgenera Osmunda, Plenasium, and the recently described Claytosmunda  with the single species,  Osmunda claytoniana .     The following phylogram shows the relationship between the Osmundaceae genera and subtaxa, according to Metzgar et al.:          The circumscription of the order and its families was not changed, and its placement remained the same in subsequent classifications including Chase and Reveal , Christenhusz et al. , and ": null
    },
    {
        "Christenhusz": "christenhusz"
    },
    {
        " and ": null
    },
    {
        "Chase": "mark w. chase"
    },
    {
        " . The find of an exceptionally well preserved Jurassic fossil  intermediate between genus Osmunda and Osmundastrum lead to a re-analysis of Metzgar et al.s data, which revealed that the Osmundaceae root used above may be wrong and a ": null
    },
    {
        "tree-branching": "long branch attraction"
    },
    {
        " artefact , and allowing the following classification:          A molecular dating study using Metzgar et al.s data and a comprehensive set of rhizome and leaf fossils estimated that generic differentiation within Osmundaceae started by the ": null
    },
    {
        "Triassic": "triassic"
    },
    {
        " and was finished by the ": null
    },
    {
        "Early Cretaceous": "early cretaceous"
    },
    {
        " with the formation of  Osmunda  and  Plenasium . Accordingly, the PPG I classification of 42 continues to place Osmundales in Polypodiidae, but splits Osmunda further by elevating its subgenera to genera . The following cladogram reproduces the PPG I concept for the extant members of the family:          The new system was used in a comprehensive taxonomic evaluation of Osmundales rhizome fossils, who provide a ": null
    },
    {
        "polytomous key": "identification key"
    },
    {
        " using anatomical features of Osmundaceae rhizomes and an updated ‘evolutionary’ classification of fossil and extant Osmundales , which can be tentatively transferred into the following cladogram        Notes:   a Millerocaulis is a likely paraphyletic genus that includes forms ancestral to the modern Osmundaceae as well as their potential sister lineages.   b The morphology of Claytosmunda is primitive within the Osmundinae, and total evidence indicates that Osmunda and Plenasium likely evolved from a Claytosmunda-type ancestor, rendering the latter genus paraphyletic when Osmundaceae fossil should be considered. The genus comprises 42 fossil rhizome species in addition to the sole surviving species.       Bomfleur et al. state  that “Osmundales has arguably the richest and most informative fossil record of any extant group of ferns” and provide a comprehensive literature list for sources and further reading. The order is well represented in the fossil record from the ": null
    },
    {
        "Permian": "permian"
    },
    {
        " onwards. Osmundalean or potentially osmundalean fern foliage including  Anomopteris  Brongn.,  Todites  Seward,  Cladotheca  T.Halle,  Osmundopsis  T.M.Harris,  Cacumen  Cantrill & J.A.Webb, Osmunda,  Damudopteris  D.D.Pant & P.K.Khare,  Dichotomopteris  Maithy, and  Cladophlebis  Brongn., 42see Bomfleur et al. and literature cited therein tribus Osmundeaemodern Osmundaceae": null
    },
    {
        "ta": "ta"
    }
]