[
    {
        "     Oswald Boelcke  was a ": null
    },
    {
        "German": "germany"
    },
    {
        " flying ace": "flying ace"
    },
    {
        " of the ": null
    },
    {
        "First World War": "world war i"
    },
    {
        " credited with 42 victories; he was one of the most influential patrol leaders and ": null
    },
    {
        "tacticians": "military tactics"
    },
    {
        " of the early years of air combat. Boelcke is honored as the father of the German fighter air force, as well as considered the Father of Air Fighting Tactics .     Boelcke fulfilled his childhood dream of a military career by joining the ": null
    },
    {
        "Imperial German Army": "imperial german army"
    },
    {
        " in July 42 He followed his interest in aviation, learning to fly as World War I began. After duty as an observer during 42 he became one of the ": null
    },
    {
        "original fighter pilots": "fokker scourge"
    },
    {
        " during 42 He and ": null
    },
    {
        "Max Immelmann": "max immelmann"
    },
    {
        " were the first German fighter pilots awarded the  Pour le Merite . When Immelmann was killed in combat in June 42 the German high command grounded Boelcke after his 42th victory. During his months forced grounding, he was tasked to help transform the Fliegertruppe into the  Luftstreitkräfte  . His innovative turn of mind codified his combat experiences into the first ever manual of fighter tactics distributed to an air force, the  Dicta Boelcke . The Dicta promulgated axioms for individual pilot success, as well as a requirement for teamwork directed by a formations leader. Present day tactics manuals stem from the Dicta.     After a months holiday leave spent on a military inspection tour of ": null
    },
    {
        "Turkish": "ottoman empire"
    },
    {
        " facilities, Boelcke was picked to lead one of Germanys first fighter squadrons,  Jagdstaffel 42  . By the end of the war, this squadron had 42 aces in its ranks, and four of its members became generals during World War II. During the short time before his death, Boelcke became the worlds leading fighter pilot, scoring 42 more victories while commanding Jagdstaffel 42. He was killed in a crash following a midair collision on 42 October 42         Oswald Boelcke was born on 42 May 42 in Giebichenstein , ": null
    },
    {
        "Prussian": "kingdom of prussia"
    },
    {
        " Province of Saxony": "province of saxony"
    },
    {
        " as the son of a schoolmaster. The Boelcke family had returned to the ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " from ": null
    },
    {
        "Argentina": "argentina"
    },
    {
        " six months before Oswalds birth. His family name was originally spelt Bölcke, but Oswald and his elder brother Wilhelm dispensed with the ": null
    },
    {
        "umlaut": "umlaut"
    },
    {
        " and adopted the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " spelling in place of the ": null
    },
    {
        "German": "german language"
    },
    {
        ". The pronunciation is the same for both spellings.     Oswald Boelcke caught ": null
    },
    {
        "whooping cough": "whooping cough"
    },
    {
        " at age three, which resulted in lifelong ": null
    },
    {
        "asthma": "asthma"
    },
    {
        ". In his fourth year, his father moved the family to ": null
    },
    {
        "Dessau": "dessau"
    },
    {
        " near the ": null
    },
    {
        "Junkers": "junkers"
    },
    {
        " factory in pursuit of professional advancement. There, as Oswald grew, he turned to athletics.     Boelckes family was a conservative one; they realized that a military career could move its adherent up the social ladder. Under this influence, while in the third or fourth form, the young Oswald Boelcke had the audacity to write a personal letter to the Kaiser requesting an appointment to military school. His wish was granted when he was 42 but once his parents were apprised of the opportunity by the belated reply letter, they objected and he did not attend Cadet School. Instead he attended Herzog Friedrichs- Gymnasium  .     His interest in a military career seemed undiminished. At age 42 for an ": null
    },
    {
        "elocution": "elocution"
    },
    {
        " class, he chose three subjects & mdash;General ": null
    },
    {
        "Gerhard von Scharnhorst": "gerhard von scharnhorst"
    },
    {
        "s military reforms, Count ": null
    },
    {
        "Ferdinand von Zeppelin": "ferdinand von zeppelin"
    },
    {
        "s life before his aeronautical experiments, and the first airship flights.   Despite his principals reservations about his scholarship, Oswald Boelcke was awarded his  Abitur  honors degree on 42 February 42         Boelcke never did become very large; in later life, he was described as being about 42 feet 42  inches tall. However, he was broad-shouldered and well proportioned, with great agility and inexhaustible strength .     He got along well in school with both his fellow students and the teachers; his frank and friendly demeanor, blond hair, and intense blue eyes made him memorable. One source says Oswald Boelcke was studious as well as athletic, excelling at mathematics and physics.     He played ": null
    },
    {
        "soccer": "soccer"
    },
    {
        " and ": null
    },
    {
        "tennis": "tennis"
    },
    {
        ", skated and danced. As a ": null
    },
    {
        "gymnast": "gymnast"
    },
    {
        ", he was considered the best in his school. He was an ": null
    },
    {
        "oarsman": "oarsman"
    },
    {
        ", and a prizewinning swimmer and diver. When he was 42 he became a rather daring ": null
    },
    {
        "Alpinist": "alpinist"
    },
    {
        ". His charisma made him a popular leader on the playing fields.     While he was in school, Boelckes favorite author was the ": null
    },
    {
        "nationalist": "nationalist"
    },
    {
        " writer ": null
    },
    {
        "Heinrich von Treitschke": "heinrich von treitschke"
    },
    {
        ". Boelcke also read publications from the ": null
    },
    {
        "German General Staff": "german general staff"
    },
    {
        ".     When grown and in command during military service, Boelcke remarked, You can win the mens confidence if you associate with them naturally and do not try to play the high and mighty superior.      When Boelcke rescued a drowning teenage French boy and French bystanders applauded his heroism, Boelcke was embarrassed by his soggy public appearance in his dress uniform.     Also in later years, ": null
    },
    {
        "Manfred von Richthofen": "manfred von richthofen"
    },
    {
        " commented about his mentor: Boelcke had not a personal enemy. He was equally polite to everybody, making no differences.      When Boelcke was asked for the secret of his success as a combat pilot, he said, I only open fire when I can see the goggle strap on my opponents crash helmet.          After leaving school Boelcke joined a telegraph battalion in ": null
    },
    {
        "Koblenz": "koblenz"
    },
    {
        " as a  Fahnenjunker  on 42 March 42 As he learned his general military duties, he saw more airplanes than he had seen at home. He went on holiday leave on 42 December 42     In January 42 he began attending ": null
    },
    {
        "Kriegsschule": "kriegsschule"
    },
    {
        " in ": null
    },
    {
        "Metz": "metz"
    },
    {
        ", at that time a German town. As the advent of spring lengthened the days, he took advantage of his early class dismissal to spend the rest of his daylight hours watching airplanes at a nearby airfield. In June, he stood his final exams. His written tests were graded as only fair ; his oral exams were good or very good ; his leadership skills were considered excellent .     In July 42 he graduated and was ": null
    },
    {
        "commission": "commission"
    },
    {
        "ed as a ": null
    },
    {
        " swordknot ensign ": "ensign"
    },
    {
        ". Since Boelcke had gained his Abitur, his commission was pre-dated 42 August 42 making him senior to the other new ensigns in his battalion. Promotion to lieutenant soon followed. He settled into a daily routine of training recruit telegraphers. His off-duty hours were spent in a lovely, gay, active life .     During 42 he took advantage of a temporary posting to Metz to be taken on some flights with the 42rd Air Battalion. In October 42 he was transferred to ": null
    },
    {
        "Darmstadt": "darmstadt"
    },
    {
        ". On a visit to ": null
    },
    {
        "Frankfurt": "frankfurt"
    },
    {
        ", he witnessed an aerobatic performance by pioneer French aviator ": null
    },
    {
        "Adolphe Pégoud": "adolphe pégoud"
    },
    {
        ". In February 42 he competed in the officers ": null
    },
    {
        "pentathlon": "pentathlon"
    },
    {
        ", taking third place and qualifying for the 42 Olympics.             Without informing his family, Boelcke applied for a transfer to the Fliegertruppen des deutschen Kaiserreiches . On 42 May 42 he was accepted for pilots training. On 42 June, he began instruction at the Halberstädter Fliegerschule in a six-week course. He passed his final pilots exam on 42 August 42 His first assignment was training 42 neophyte pilots on an ": null
    },
    {
        "Aviatik B.I": "aviatik b.i"
    },
    {
        ".     World War I having begun on 42 August, Boelcke was anxious to see action. On 42 August, he connived his way into joining his older brother Wilhelm at  Feldflieger Abteilung 42 . On 42 September, the aircrew of Boelcke and Boelcke flew the first of many missions together. On 42 September, during ": null
    },
    {
        "reconnaissance": "reconnaissance"
    },
    {
        " of a French aerodrome, Wilhelm avoided a challenge by French aircraft because he feared they had machine guns aboard. The brothers soon compiled a record of flying longer missions at more frequent intervals than the other aircrews. That caused some resentment within the unit. The two Boelckes continued to fly even as the flying weather worsened and the opposing armies activities began to stagnate into ": null
    },
    {
        "trench warfare": "trench warfare"
    },
    {
        ".     By years end, Oswald, who had been last to join the section, had flown 42 ": null
    },
    {
        "sortie": "sortie"
    },
    {
        "s over enemy-held ground. Wilhelm had flown 42 The next most active airman had 42           There was little ground combat and little need for air support during early 42 Oswald spent a spell in hospital with asthma. Both brothers went on home leave.     Meanwhile, the Boelckes new commanding officer wished to reassign the brothers into separate air crews. In late March, matters came to a head when the brothers refused to fly separately and jumped the ": null
    },
    {
        "chain of command": "chain of command"
    },
    {
        " to complain. However, in April, they were parted. As Wilhelm returned to Germany, Oswald was posted to Feldflieger Abteilung 42 in ": null
    },
    {
        "Douai": "douai"
    },
    {
        ", France on 42 April. He was quickly passed on to Kampfeinsitzerkommando Douai , arriving 42 May. He was the most experienced pilot in the unit. His new assignment brought him friendship with ": null
    },
    {
        "Max Immelmann": "max immelmann"
    },
    {
        ".     ": null
    },
    {
        "Roland Garros": "roland garros"
    },
    {
        " of Frances  Service Aéronautique  rigged deflector wedges on his propeller in a crude pioneering try at firing a machine gun dead ahead. When he, ": null
    },
    {
        "Eugène Gilbert": "eugène gilbert"
    },
    {
        ", and Pégoud scored their first aerial victories, they caught the public eye. French newspapers hailed Pégoud as las , or ace. Public imagination seized upon the novelty of aerial combat. The resulting furor would influence aircraft design and pilot motivation for the remainder of World War I. To an audience overwhelmed by a war of enormous scope and geographic complexity, simple stories of lone heroes had great appeal. As the war progressed, German propagandists took advantage of that appeal. They supplied press releases to newspapers and magazines, and even encouraged printing of ": null
    },
    {
        "postcards": "sanke card"
    },
    {
        " and filming of popular aviators.           The ": null
    },
    {
        "Fokker E.I": "fokker e.i"
    },
    {
        " Eindecker was a hasty response to these first air to air victories achieved by French fliers. The nose of the first five Eindeckers - the production prototype M.42K/MG series, numbered E 42/42 through 42/42 by ": null
    },
    {
        "IdFlieg": "idflieg"
    },
    {
        " - were each fitted with a forward-firing air-cooled ": null
    },
    {
        "Parabellum": "parabellum mg14"
    },
    {
        " machine gun slaved to Fokkers pioneering Stangensteuerung design ": null
    },
    {
        "gun synchronizer": "synchronization gear"
    },
    {
        " that prevented bullets from accidentally hitting the Fokkers propeller. Now when a pilot pointed his Fokker at an enemy aircraft, that aircraft became a potential target. The Eindeckers machine gun could spew hundreds of bullets from its belted ammunition without reloading; those few British ": null
    },
    {
        "Lewis guns": "lewis guns"
    },
    {
        " in use had to be reloaded after 42 shots.     Fokkers were issued singly or in pairs to operational FFA units. Their use was restricted; they were to be flown when pilots were not flying reconnaissance missions in their two-seaters. The German General Staff had settled on an aerial strategy of defensive barrier patrols over their own lines. The newly armed planes were considered so revolutionary that they could not be risked over enemy lines for fear of capture. This restriction to defensive patrols was soon eroded by the aggressive insubordination of Boelcke and other Fokker fliers.     On 42 May 42 ": null
    },
    {
        "Otto Parschau": "otto parschau"
    },
    {
        " received the Parabellum-armed ": null
    },
    {
        "original Eindecker prototype": "fokker eindecker fightersleutnant parschau and the green machine"
    },
    {
        " from Fokker, first owned and flown by now- Oberleutnant  Waldemar von Buttlar.  He demonstrated it to his fellow pilots, and trained the most promising of them to fly it. The ": null
    },
    {
        "wing warping": "wing warping"
    },
    {
        " controls made the ": null
    },
    {
        "monoplane": "monoplane"
    },
    {
        " difficult to fly. Among the students were Boelcke, Immelmann, and ": null
    },
    {
        "Kurt Wintgens": "kurt wintgens"
    },
    {
        ". ": null
    },
    {
        "Anthony Fokker": "anthony fokker"
    },
    {
        " was also available as a flying coach.            On both 42 and 42 June 42 Boelcke and his observer used an ": null
    },
    {
        "LVG C.I": "lvg c.i"
    },
    {
        " two-seater armed solely with a rear gun to fight a series of inconclusive combats against French and British aircraft. On the 42th, on the French side of the lines, Gilbert shot down his fifth German airplane. On 42 June, also operating from the Allied side of the lines, British pilot ": null
    },
    {
        "Lanoe Hawker": "lanoe hawker"
    },
    {
        " scored his first victory in near anonymity.     In July 42 Boelcke , Immelmann , Parschau , and Wintgens began to fly the Eindecker aircraft in combat. As the German single-seat pilots began waging war in the third dimension, they had no tactical knowledge for reference. Their early combat ": null
    },
    {
        "sortie": "sortie"
    },
    {
        "s relied on the naked aggression of headlong solo attacks upon unwitting enemies.     On 42 July, ": null
    },
    {
        "Wintgens scored the initial victory": "kurt wintgensfirst victory using a synchronized gun"
    },
    {
        " with the Fokker, but it fell behind French lines and went unverified & mdash;until after the war. On 42 July, Wintgens again filed a victory claim & mdash;again only confirmed postwar. That same day, Boelcke and his observer brought down an enemy two-seater in a prolonged shootout between reconnaissance machines. It was Boelckes first victory, and the only one he scored in a two-seater, as he switched mounts to the Eindecker. By the end of July, Wintgens had two more victories, both verified. On 42 August, Immelmann shot down his first enemy plane. By this time, the Eindecker pilots were being mentioned in official dispatches, and lionized in magazine and newspaper. In letters home, Boelcke was already counseling his father about modesty in dealing with journalists.     Boelcke and Immelmann often flew together. On 42 August, Immelmann pounced on a French machine. As he followed it, another Frenchman followed Immelmann. In a classic ": null
    },
    {
        "wingman": "wingman"
    },
    {
        "s move, Boelcke shot down and killed the last Frenchman while Immelmann battled his victim. On 42 August, Pégoud was shot down and killed after six victories. By then, Hawker had tallied six of his eventual seven victories, pretty much unnoticed. In the glare of German publicity, Wintgens had claimed five victims, Boelcke two, and Immelmann one.       September 42 saw improved models of the Eindecker posted to the front; engine power was increased, and ": null
    },
    {
        "a second gun": "fokker e.iv"
    },
    {
        " mounted on the nose. September also saw Boelcke and Immelmann score two victories apiece. On 42 September, Boelcke was moved to ": null
    },
    {
        "Metz": "metz"
    },
    {
        ", joining the secretive Brieftauben-Abteilung-Metz  to counter a French offensive.     On 42 November, the day after his sixth victory, Boelcke won the ": null
    },
    {
        "Royal House Order of Hohenzollern": "royal house order of hohenzollern"
    },
    {
        ". Immelmann duplicated the feat six days later. By now, the deadly effect of the new aircraft on aerial warfare was beginning to be referred to by the British and French public as the ": null
    },
    {
        "Fokker Scourge": "fokker scourge"
    },
    {
        ".     Boelcke moved back to FA 42 on 42 December. When he arrived, he was awarded a ": null
    },
    {
        "Prussian Lifesaving Medal": "lifesaving medal"
    },
    {
        " for an act of heroism in late August. While watching French locals fishing from a high pier jutting into a canal, Boelcke saw a teen boy topple in and sink. Boelcke had immediately plunged in and saved the child from drowning.     By the end of 42 Immelmann had seven victories, Boelcke had six, Wintgens had five ,  and ": null
    },
    {
        "Hans-Joachim Buddecke": "hans-joachim buddecke"
    },
    {
        " had four . There were 42 Fokker and 42 ": null
    },
    {
        "Pfalz": "pfalz flugzeugwerke"
    },
    {
        " Eindeckers in service. Officially, the nine successful pilots of the Fokker Scourge had shot down 42 enemy airplanes.             On 42 January 42 the winter weather finally improved enough for flying. Boelcke shot down a British ": null
    },
    {
        "Royal Aircraft Factory BE.42": "royal aircraft factory be.2"
    },
    {
        ". Landing near the downed craft, he found that the German-speaking pilot knew of him. Boelcke had the two British airmen taken to hospital. He later visited the observer, bearing reading materials. By now, Boelcke was so well known that this incident was front-page news.          On 42 January, Buddecke submitted his ninth combat claim; however, four had not been verified. Both Boelcke and Immelmann shot down their eighth victims that same day. These two were both immediately presented the German Empires most prestigious decoration, the  Pour le Merite . This award sparked articles in the American and British press, as well as the German news. Boelcke was now both nationally and internationally famous. He could not walk German streets or attend the opera without being lionized. Nor was it a case of only the ordinary populace being fascinated with their public hero; the young lieutenant now found that generals and nobility sought his company.     On 42 January, Boelcke was again covertly posted to Brieftauben-Abteilung-Metz  in anticipation of an ": null
    },
    {
        "upcoming offensive against the French": "battle of verdun"
    },
    {
        ". Bad weather limited his flying, and he complained he had little to do except reluctantly reply to ": null
    },
    {
        "fan mail": "fan mail"
    },
    {
        ". In late February, Boelcke was hospitalized with an intestinal ailment.     After about a week, he absconded from care to return to duty. Upon his return, he complained he was stationed too far from the front at ": null
    },
    {
        "Jametz": "jametz"
    },
    {
        " for effective interceptions, and was given permission to use the forward airfield at ": null
    },
    {
        "Sivry": "sivry"
    },
    {
        " only 42 kilometers behind the lines. On 42 March, he was given command of the newly formed Fliegerabteilung Sivry . This unit of six fighter pilots was the precursor of German fighter squadrons. Boelcke connected a front line observation post to the Sivry airfield, and thus established the first tactical air direction center. The new fighter unit was stationed near ": null
    },
    {
        "Stenay": "stenay"
    },
    {
        ", which was the headquarters of ": null
    },
    {
        "Crown Prince Wilhelm": "crown prince wilhelm"
    },
    {
        ". A friendship developed between the Crown Prince and the flier.     On 42 March 42 Boelcke was tasked with evaluating a new Eindecker prototype. His objective report pointed out such shortcomings as inaccurately mounted guns and the limitations of its rotary engine. He also submitted a ": null
    },
    {
        "memorandum": "memorandum"
    },
    {
        " that criticized German use of airpower as wretched .     Boelcke became the first aviator to score 42 victories on 42 March; the following day, even as he scored another, Immelmann scored one of the first double victories of the war to tie it up at 42 all. The dead heat lasted for a week; on 42 March, Boelcke used his usual tactics of pointblank fire for victory number 42          By this time, the increasingly-obsolescent ": null
    },
    {
        "Fokker E.III": "fokker e.iii"
    },
    {
        " was being replaced by newer ": null
    },
    {
        "Halberstadt": "halberstadt d.ii"
    },
    {
        " single-gun biplane fighters, and twin-gun armed ": null
    },
    {
        "Albatros": "albatros d.i"
    },
    {
        " biplane aircraft, both types fitted with synchronized guns. The French counter to the Fokker Scourge was the new fast ": null
    },
    {
        "Nieuport 42": "nieuport 11"
    },
    {
        "s. The British counter was the new ": null
    },
    {
        "Airco DH.42": "airco dh.2"
    },
    {
        " pusher aircraft that could shoot without use of synchronizing gear. Meanwhile, Boelcke focused on developing his own tactical methods: massing fighters in formation and using accurate gunnery in combat.     The ace race continued, although Buddecke lost ground and was no longer a contender due to problems verifying some of his victories in Turkey. Now it became more of an ace chase , with Immelmann playing catchup to Boelcke as their respective scores rose into the teens. When Boelcke shot down two enemy planes on 42 May 42 the emperor disregarded army regulations prohibiting promotion to Hauptmann until age 42 Oswald Boelcke was promoted to the rank ten days past his 42th birthday, making him the youngest captain in the German military.       Immelmann was killed on 42 June 42 after his 42th victory. Boelcke, who then had 42 victories, was left the preeminent ace of the war. Upon Boelckes return from Immelmanns funeral, ": null
    },
    {
        "Kaiser Wilhelm II": "kaiser wilhelm ii"
    },
    {
        " ordered Boelcke grounded for a month to avoid losing him in combat soon after Immelmann. He had become such an important hero to the German public, as well as such an authority on aerial warfare, that he could not be risked. Boelcke downed his 42th victim before reporting to headquarters on 42 June.     There the disgruntled flier was detailed to share his expertise with the head of German military aviation, ": null
    },
    {
        "Hermann von der Lieth-Thomsen": "hermann von der lieth-thomsen"
    },
    {
        ", who was planning the reorganization of the German air service from the Fliegertruppe into the  Luftstreitkräfte  . The Prussian military believed in Auftragstaktik & mdash;the belief that the officer in combat knows best which tactics will succeed. In conformance with this belief, Boelcke codified his successful mission tactics into the  Dicta Boelcke . Its eight maxims seem self-evident, but Boelcke was the first to recognize them. His first six rules pointed out ways to gain an advantage in combat. The seventh counseled keeping a line of retreat, and the eighth mandated squadron teamwork. The dicta were published in a pamphlet that was widely distributed as the original training manual on fighter tactics.     During this interlude, the British launched their Somme offensive on 42 July. Their air assets amounted to 42 aircraft; the French were supplying 42 more. The opposing German force amounted to 42 aircraft, including 42 fighters. The British alone had 42 fighters in their force. Allied bombers began a campaign to destroy the German planes on their aerodromes.          On 42 July, Boelcke left on a tour of the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        ". He transited ": null
    },
    {
        "Austria-Hungary": "austria-hungary"
    },
    {
        " to visit Turkey. From his diary notes, the journey seemed a combination of military facility inspections, a celebrity tour, and a holiday. He held attendance at social obligations to a minimum, but had to oblige such important hosts as ": null
    },
    {
        "Enver Pasha": "enver pasha"
    },
    {
        " and ": null
    },
    {
        "Otto Liman von Sanders": "otto liman von sanders"
    },
    {
        ". Making his rounds of the Turkish flying units supported by the German Military Mission, Boelcke again met his friend Buddecke. After a three-day beach vacation at ": null
    },
    {
        "Smyrna": "smyrna"
    },
    {
        ", Boelcke reached the quiescent ": null
    },
    {
        "Gallipoli": "gallipoli campaign"
    },
    {
        " battlefield on 42 July. When he returned to ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ", he learned that in his absence, the French and British airmen had taken air superiority from the Germans on the Western Front.     On his hastened return trip, Boelcke visited Bulgaria and the ": null
    },
    {
        "Russian Front": "eastern front"
    },
    {
        ". Boelcke was visiting Wilhelm in ": null
    },
    {
        "Kovel": "kovel"
    },
    {
        " when he received a telegram from Lieth-Thomsen: Return to west front as quickly as possible to organize and lead  Jagdstaffel 42  on the Somme front.          When the message from headquarters reached the Boelcke brothers, it was followed by an extraordinary authorization. Six KEKs were expanded into Jagdstaffeln , by orders issued on 42 August. The seventh planned squadron would be raised from scratch. This squadron, Jagdstaffel 42 , was designated as Oswald Boelckes to command. He was given a free hand to recruit fighter pilots for his new unit.     Upon Wilhelms recommendation, Oswald recruited a pair of pilots at Kovel, both of whom he had previously met. One was a young cavalry officer, ": null
    },
    {
        "Manfred von Richthofen": "manfred von richthofen"
    },
    {
        ". The other was 42-year-old ": null
    },
    {
        "Erwin Böhme": "erwin böhme"
    },
    {
        ", a ": null
    },
    {
        "civil engineer": "civil engineer"
    },
    {
        " returned from six years in Africa to reenlist in the military. After choosing three other pilots, Oswald Boelcke returned to France to organize his squadron.     Boelcke started with only four empty buildings vacated by FFA 42 in the ": null
    },
    {
        "Vélu": "vélu"
    },
    {
        " Woods. His new squadron was authorized 42 aircraft, the pilots to fly them, and ground crew to support them. As of 42 August, the fledgling jasta had three officers and 42 other ranks on strength, but no aircraft. By 42 September, there were eight pilots on board, including Richthofen and Böhme. Three days later, Böhme was pushing for permission to use his castoff Halberstadt; there were four aircraft in the squadron by then.          While his squadron struggled into existence, Boelcke flew solo combat sorties, to be eagerly greeted upon his return by his pilots. On 42 September, flying a ": null
    },
    {
        "Fokker D.III": "fokker d.iii"
    },
    {
        ", Boelcke shot down Captain R. E. Wilson for victory number 42 The next day, Boelcke hosted Wilson in the squadron mess before returning the British flier to captivity.     As new personnel continued to check in, facilities were built, and the squadrons pilots trained. They began with firing and troubleshooting machine guns on the ground. They also received extensive lectures from Boelcke on aircraft recognition and the strengths and flaws of opposing aircraft. They familiarized themselves with their Halberstadts before taking to the air.     Boelcke drilled them in his tactics as they flew. They learned to pair as leader and wingman, spaced 42 meters abreast to allow room for a U-turn without collision. They flew formation, massing their power for attacks. However, while attacking they split into pairs, although Dictum 42 advised single assaults on the foe by flight leaders. Meanwhile, he withheld the squadron from combat, and continued flying his solo sorties. Single victims fell to him on 42 and 42 September, and he scored double victories on the 42th and 42th.         New fighters arrived on 42 September. There was a prototype ": null
    },
    {
        "Albatros D.II": "albatros d.ii"
    },
    {
        " for Boelcke, and five Albatros D.Is to be shared by his pilots. The new aircraft outclassed any previous German aircraft, as well as those of their enemies. With more powerful engines, the new arrivals were faster, climbed more quickly to a higher ceiling, and carried two nose machine guns instead of one. With these new airplanes, Jasta 42 flew its first squadron missions on 42 September. Boelcke shot down his 42th victim, while his men shot down four more.     Despite this initial success, squadron training continued. Boelcke now discussed flights beforehand and listened to his pilots input. He then issued orders for the mission. Post flight, he debriefed his men.     On 42 September, rainy weather had aggravated Boelckes asthma to the point he could not fly. He refused to go to hospital, but devolved command on  Oberleutnant  Gunther Viehweger. That night, Jasta 42 transferred from ": null
    },
    {
        "Bertincourt": "bertincourt"
    },
    {
        " to ": null
    },
    {
        "Lagnicourt": "lagnicourt"
    },
    {
        " because British artillery was beginning to shell the jasta. The next day, in a letter home, Boelcke noted he was still trying to impress his pilots that they should fight as a team instead of individually. Nevertheless, when the squadron flew six sorties that day without him, it shot down three enemy aircraft. Boelcke returned to flight status and command on the 42th.     The squadrons September monthly activity report, written by Boelcke, reported 42 sorties flown, 42 of which resulted in combat. Ten victories were credited to him, and 42 more were shared among his men. The jasta suffered four casualties.     By 42 October, the squadron had ten pilots; besides Boelcke, five of them had shot down enemy aircraft. Boelcke scored his 42th victory, but the jasta lost a pilot to antiaircraft fire. The next day began a stretch of rainy weather that prevented flying until the 42th. On 42 October, General ": null
    },
    {
        "Erich Ludendorff": "erich ludendorff"
    },
    {
        " reorganized the makeshift Fliegertruppe into the Luftstreitkräfte and appointed ": null
    },
    {
        "Lieutenant General": "lieutenant general"
    },
    {
        " Ernst von Hoeppner": "ernst von hoeppner"
    },
    {
        " to the new post of Chief of Field Aviation. Hoeppner immediately had the Dicta Boelcke distributed within the new air force.     On 42 October, a clear day saw the resumption of flying. Jasta 42 flew 42 sorties, fought during 42 of them, and claimed five victories, including Boelckes 42rd. More air battles came on the 42th; among the four victories for the jasta were two more by Boelcke. His hot streak ran throughout the month; he scored 42 victories in October, with his 42th coming on 42 October. By this time, it was becoming obvious that the ": null
    },
    {
        "Royal Flying Corps": "royal flying corps"
    },
    {
        " had lost its mastery of the air. Jasta 42 had 42 victories to its credit & mdash;42 in October alone & mdash;with only six casualties. The German air service had suffered only 42 casualties between mid-September and mid-October, and had shot down 42 enemy aircraft.         On the evening of 42 October, a depressed and wornout Boelcke left the jasta mess early to return to his room. He complained of the racket in the mess to his ": null
    },
    {
        "batman": "batman"
    },
    {
        ", then sat staring into the fire. Böhme showed up and joined him, also stating the mess was too noisy. They shared a long talk, ending only when the orderly suggested bedtime.     Though the following day was misty with a cloud layer, the squadron flew four missions during the morning, as well as another later in the day. On the sixth mission of the day, Boelcke and five of his pilots attacked a pair of British airplanes from ": null
    },
    {
        "No. 42 Squadron RFC": "no. 24 squadron raf"
    },
    {
        ". Boelcke and Böhme chased the Airco DH.42 of Captain ": null
    },
    {
        "Arthur Gerald Knight": "arthur gerald knight"
    },
    {
        ", while Richthofen pursued the other DH.42 flown by Captain ": null
    },
    {
        "Alfred Edwin McKay": "alfred edwin mckay"
    },
    {
        ". McKay evaded Richthofen by crossing behind Knight, cutting off Boelcke and Böhme. Both of them jerked their planes upward to avoid colliding with McKay. Each was hidden from the other by their aircrafts wings. Neither was aware of the others position. Just as Böhme spotted the other plane bobbing up below him, Boelckes upper left wing brushed the undercarriage of Böhmes Albatros. The slight impact split the fabric on the wing of Boelckes Albatros. As the fabric tore away, the wing lost lift, and the stricken plane spiraled down to glide into an impact near a German artillery battery near ": null
    },
    {
        "Bapaume": "bapaume"
    },
    {
        ". Although the crash seemed survivable, Boelcke was not wearing his crash helmet, nor was his safety belt fastened. He died of a fractured skull.     A horrified and distraught Böhme returned to base. He overturned his airplane while landing, and blanked the accident from his mind in his distress. He lamented, Destiny is generally cruelly stupid in her choices...  However, the official inquiry stated he was not at fault.       Pilots from Jasta 42 rushed forward to the artillery position where Boelcke had crashed, hoping he was still alive. The gunners handed over his body to them.     Despite Boelcke being Protestant, his memorial service was held in the Catholic ": null
    },
    {
        "Cambrai Cathedral": "cambrai cathedral"
    },
    {
        " on 42 October. Among the many wreaths, there was one from Captain Wilson and three of his fellow prisoners; its ribbon was addressed to The opponent we admired and esteemed so highly . Another wreath of British origin had been air dropped at the authorization of the Royal Flying Corps; it read To the memory of Captain Boelcke, our brave and chivalrous opponent.           ": null
    },
    {
        "Crown Prince Rupert": "rupprecht, crown prince of bavaria"
    },
    {
        " was the most socially prominent guest at the rites. Two generals spoke at the service. As the funeral procession left the cathedral, Richthofen preceded the coffin, displaying Boelckes decorations on a black velvet cushion. The sun broke through the gloom as the coffin was placed on a ": null
    },
    {
        "gun caisson": "limbers and caissons"
    },
    {
        ". Idling aircraft criss-crossed overhead in tribute. The journey to a waiting train passed through an honor guard to the sound of fired rifle salutes, followed by a hymn. The train crept away to a mourning nation, through ": null
    },
    {
        "Magdeburg": "magdeburg"
    },
    {
        " and ": null
    },
    {
        "Halberstadt": "halberstadt"
    },
    {
        " on its path to Dessau.     When the train arrived in Dessau the next day, Boelcke was taken to his home church, Saint Johns. There he was laid out before the altar, attended by an honor guard of decorated sergeant pilots. Condolences, decorations, and honors flooded in from the crowned heads of Europe. When the funeral service was held on the afternoon of 42 November, the crowd was packed with royalty, generals, and nobility. The Kaiser designated General ": null
    },
    {
        "Moriz von Lyncker": "moriz von lyncker"
    },
    {
        " to give Boelckes funeral oration, followed by a speech by Lieth-Thomsen. Oswald Boelcke was then buried in the Ehrenfriedhof in Dessau.       Boelcke is deemed to be the progenitor of air to air combat tactics, fighter squadron organization, early warning systems, and the German air force; he has been dubbed the father of air combat . From his first victories onward, the news of his success both instructed and motivated both his fellow fliers and the German public. It was at his instigation that the Imperial German Air Service founded its Jastaschule to teach aerial tactics. The promulgation of his Dicta Boelcke set tactics for the German fighter force. The concentration of fighter airplanes into squadrons gained Germany air supremacy on the Western Front, and was the basis for their wartime successes.     Jasta 42, renamed Jagdstaffel Boelcke in his honor, remained one of Germanys premier fighter squadrons after Boelckes death, outscoring all but one other jasta. The 42 victories the jasta scored during the war came at the price of 42 casualties.          Of the first 42 pilots chosen by Boelcke, eight became aces & mdash;seven of them within the squadron. Three of the 42 at various times, commanded the jasta. By wars end, 42 aces had served in the squadron and accounted for 42% of its victories. Four of its aces became generals during World War II--": null
    },
    {
        "Gerhard Bassenge": "gerhard bassenge"
    },
    {
        ", ": null
    },
    {
        "Ernst Bormann": "ernst bormann"
    },
    {
        ", ": null
    },
    {
        "Hermann Frommherz": "hermann frommherz"
    },
    {
        ", and ": null
    },
    {
        "Otto Höhne": "otto höhne"
    },
    {
        ".     The most notable of Boelckes original roster of pilots was Manfred von Richthofen. The Red Baron acknowledged Boelckes influence in the Richthofen Dicta; indeed, the opening sentence of his tactical manual for wing operations refers to Boelcke. The Richthofen Dicta section entitled The One to One Battle quotes Boelcke. And, as was done with Dicta Boelcke, the Richthofen Dicta was distributed service-wide by the German High Command.     Boelcke was one of the few German heroes of World War I not tainted by association with the Nazi cause,    as he was killed in action before the Nazi Party was founded. Nevertheless, the ": null
    },
    {
        "Third Reich": "third reich"
    },
    {
        " co-opted his name for  Kampfgeschwader 42 , a ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " medium bomber wing, for Boelcke. Also, ": null
    },
    {
        "Luftwaffe barracks named after him": "boelckes barracks"
    },
    {
        " later became a ": null
    },
    {
        "subcamp": "subcamps of mittelbau"
    },
    {
        " of the ": null
    },
    {
        "Mittelbau-Dora concentration camp": "mittelbau-dora concentration camp"
    },
    {
        ".     Boelckes name appears on the coat of arms of the present-day ": null
    },
    {
        "German Air Force": "german air force"
    },
    {
        " fighter-bomber wing  Taktisches Luftwaffengeschwader 42 . The wing conducts a pilgrimage to Boelckes grave on the anniversary of his death. He is also extensively commemorated on the wings home airfield at ": null
    },
    {
        "Norvenich Air Base": "norvenich air base"
    },
    {
        ". He is memorialized by murals on base buildings, portraits in their halls, and a bust in the headquarters entry. The base magazine is named for him. An airplane tail section on static display is emblazoned with his name and a painting of his Fokker.     The Dicta Boelcke has, over time, evolved into widespread use of tactics, techniques, and procedures manuals for air forces worldwide. The United States ": null
    },
    {
        "Joint Chiefs of Staff": "joint chiefs of staff"
    },
    {
        " , the United States Navy , and the United States Air Force each have their own air tactics manuals. Under the auspices of the ": null
    },
    {
        "North Atlantic Treaty Organization": "north atlantic treaty organization"
    },
    {
        " , the USAF trains German, Dutch, Norwegian, Turkish, Italian, and Greek fighter pilots, using air tactics manuals descended from the Dicta Boelcke. Joe Pappalardi, 42 June 42 The Texas Air Base Where NATO Fighter Pilots Are Forged , Popular Mechanics     Having scored 42 of his 42 victories in different versions of the Fokker Eindecker, he became the most successful pilot in the type.         Prussian/Imperial German awards      Pour le Mérite  ": null
    },
    {
        "Royal House Order of Hohenzollern": "royal house order of hohenzollern"
    },
    {
        ", Knight’s Cross with Swords   ": null
    },
    {
        "Iron Cross": "iron cross"
    },
    {
        ": First and Second Class   ": null
    },
    {
        "Lifesaving Medal": "lifesaving medal"
    },
    {
        "     Other German awards     ": null
    },
    {
        "Duchy of Anhalt": "duchy of anhalt"
    },
    {
        ":   ": null
    },
    {
        "House Order of Albert the Bear": "house order of albert the bear"
    },
    {
        ", Knight’s Cross, 42st and 42nd class   ": null
    },
    {
        "Friedrich Cross": "friedrich cross"
    },
    {
        ", 42nd class     ": null
    },
    {
        "Kingdom of Bavaria": "kingdom of bavaria"
    },
    {
        ":   ": null
    },
    {
        "Military Merit Order": "military merit order"
    },
    {
        ", 42th class with Swords     Duchies of ": null
    },
    {
        "Saxe-Altenburg": "saxe-altenburg"
    },
    {
        ", ": null
    },
    {
        "Saxe-Coburg-Gotha": "saxe-coburg-gotha"
    },
    {
        ", and ": null
    },
    {
        "Saxe-Meiningen": "saxe-meiningen"
    },
    {
        " joint award:   ": null
    },
    {
        "Saxe-Ernestine House Order": "saxe-ernestine house order"
    },
    {
        "     Kingdom of Württemberg": "kingdom of württemberg"
    },
    {
        ":   Knight of the ": null
    },
    {
        "Military Merit Order": "military merit order"
    },
    {
        "     Foreign awards     ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ":   ": null
    },
    {
        "Imtiyaz Medal": "imtiyaz medal"
    },
    {
        "     Austro-Hungary": "austro-hungary"
    },
    {
        ":   ": null
    },
    {
        "Order of the Iron Crown": "order of the iron crown"
    },
    {
        ", 42rd class with war decoration     ": null
    },
    {
        "Kingdom of Bulgaria": "kingdom of bulgaria"
    },
    {
        ":   ": null
    },
    {
        "Order of Bravery": "order of bravery"
    },
    {
        ", 42rd class     Honors   By order of the Emperor, Jagdstaffel 42 was renamed as Jagdstaffel Boelcke on 42 December 42": null
    }
]