[
    {
        "                   Otorhinolaryngology   is a surgical subspecialty within medicine that deals with the surgical and medical management of conditions in the head and neck. Doctors who specialize in this area are called otolaryngologists, head and neck surgeons, or ENT surgeons. Patients seek treatment from an otorhinolaryngologist for diseases of the ": null
    },
    {
        "ear": "ear"
    },
    {
        ", ": null
    },
    {
        "nose": "nose"
    },
    {
        ", ": null
    },
    {
        "throat": "throat"
    },
    {
        ", ": null
    },
    {
        "base of the skull": "base of skull"
    },
    {
        ", head, and neck which encompasses the surgical management and reconstruction of ": null
    },
    {
        "cancers": "cancer"
    },
    {
        "and ": null
    },
    {
        "benign tumors": "benign tumor"
    },
    {
        "of the head and neck as well as plastic surgery of the face and neck .       The term is a combination of ": null
    },
    {
        "New Latin": "new latin"
    },
    {
        " combining forms": "classical compound"
    },
    {
        "  derived from four ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        " words: ": null
    },
    {
        "οὖς": "wikt:οὖς"
    },
    {
        " ous , ear , ": null
    },
    {
        "ῥίς": "wikt:ῥίς"
    },
    {
        " rhis, nose , ": null
    },
    {
        "λάρυγξ": "wikt:λάρυγξ"
    },
    {
        " larynx, larynx and ": null
    },
    {
        "-λογία": "wikt:-λογία"
    },
    {
        " logia, study otolaryngologist entry in: Peter Harris, Sue Nagy, Nicholas Vardaxis,  Mosbys Dictionary of Medicine, Nursing & Health Professions - Australian & New Zealand Edition, Elsevier Health Sciences, 2009. .       Otorhinolaryngologists are ": null
    },
    {
        "physicians": "physicians"
    },
    {
        "  who, in the United States, complete at least five years of surgical residency training. This comprises six months of ": null
    },
    {
        "general surgical": "general surgery"
    },
    {
        " training and four and a half years in specialist surgery. In Canada and the United States, practitioners complete a five-year residency training after medical school.     Following residency training, some otolaryngologist-head & neck surgeons complete an advanced sub-specialty fellowship, where training can be one to two years in duration. Fellowships include head and neck surgical oncology, facial plastic surgery, rhinology and sinus surgery, neuro-otology, pediatric otolaryngology, and laryngology. In the United States and Canada, otorhinolaryngology is one of the most competitive specialties in medicine in which to obtain a residency position following medical school.     In the United Kingdom entrance to otorhinolaryngology higher surgical training is highly competitive and involves a rigorous national selection process. The training programme consists of 6 years of higher surgical training after which trainees frequently undertake fellowships in a sub-speciality prior to becoming a consultant.                      In this type of surgery, a surgeon harvests a muscle from the back or from the abdominal region for reconstruction of the skull or the cranial vault. Latissimus is another word for back in the medical field as well as rectus abdominis which is your abdominal area. The muscle is sometimes useful for sealing off the central nervous system in ones body and allowing it to heal the complex wounds. A study was down with five patients who underwent the free muscle transfer for a smile reconstruction. Two of the five patients prior to this surgery had failed their first free muscle transfer. The next two patients had vascular anomalies and one had a previous distal ligation of the facial vessels. In three of the cases, they used a submental vein, and in all the cases they used a donor submental artery. In all 5 the gracilis vascular pedicle comprised a muscular branch of the profunda femoris together with its venae comitantes, with the artery and vein ranging in size from 1.0 to 1.5 mm and 2.0 to 2.5 mm, respectively. The submental artery provided an excellent size match in all cases, ranging in size from 1.0 to 1.5 mm .  The first patient was a 45-year-old woman who developed a dense flaccid right facial paralysis at the age of 33. The second patient was an 8-year-old girl who had developed dense flaccid left facial paralysis after a laser treatment at four weeks for, bilateral infantile segmental hemangiomas in the distribution of the mandibular division of the trigeminal nerve . . The third case was a 19-year-old male who had developed a segmental right facial paralysis after an excision of an infantile parotid hemangioma at the age of 2. The fourth case was a 20-year-old woman who had developed dense flaccid right facial paralysis after a biopsy of a pontomedullary junction tumor at the age of 2. Lastly, case five was a 19-year-old woman who had incomplete flaccid left facial palsy.       Bone defects are often the most difficult reconstructions as it requires precise alignment. Bone transfer is commonly used for the mandibular reconstruction, but it now allows surgeons to use it for the midface and the orbito maxillary. If for some reason the fibula is not available for transfer, another option the team may go is using the back rib free flap. This allows the transfer to give the bone volume for the patients. The earliest first bone transfer was done all the way back in 2000 BCE when the Peruvian priest implanted a metallic plate to reconstruct the contour defects of the religious trephination. In 1668, a man by the name of Jobs van Meekeren reported the use of dog bone grafts to reconstruct the calvarium in the soldier. …the ideal of the future: the insertion of a piece of living bone which will exactly fill the gap and will continue to live without absorption. .       The radial forearm is the most commonly dominant use of flap to be used to coverage up damages. Today, the anterolateral thigh flap is being used on patients for the head and the neck because it has an ideal match for the site and it is easy to harvest. If a surgeon chose to remove/harvest the tissue, safe places are the following; skin, skin and fat, fat and fascia, or just the fascia by itself.       Microvascular reconstruction repair is a common operation that is done on patients who see an Otorhinolaryngologist. Microvascular reconstruction repair is a surgical procedure that involves moving a composite piece of tissue from the patients body and moves it to the head and or neck. Microvascular head and neck reconstruction is used to treat head and neck cancers, including those of the larynx and pharynx, oral cavity, salivary glands, jaws, calvarium, sinuses, tongue and skin. The tissue that is most common moved during this procedure is from the arms, legs, back, and can come from the skin, bone, fat, and or muscle.  When doing this procedure, the decision on which is moved is determined on the reconstructive needs. Transfer of the tissue to the head and neck allows surgeons to rebuild the patients jaw, optimize tongue function, and reconstruct the throat. When the pieces of tissue are moved, they require their own blood supply for a chance of survival in their new location. After the surgery is completed, the blood vessels that feed the tissue transplant are reconnected to new blood vessels in the neck. These blood vessels are typically no more than 1 to 3 millimeters in diameter which means these connections need to be made with a microscope which is why this procedure is called microvascular surgery.       ": null
    },
    {
        "Squamous cell carcinoma": "squamous cell carcinoma"
    },
    {
        " of the oral cavity, pharynx and larynx   ": null
    },
    {
        "Oral cancer": "oral cancer"
    },
    {
        " Skin cancer": "skin cancer"
    },
    {
        " of the head & neck   ": null
    },
    {
        "Thyroid cancer": "thyroid cancer"
    },
    {
        " Microvascular free flap reconstruction": "microvascular free flap reconstruction"
    },
    {
        " Skull base surgery": "skull base surgery"
    },
    {
        " Salivary gland cancer": "salivary gland cancer"
    },
    {
        "        Dizziness": "dizziness"
    },
    {
        " BPPV": "bppv"
    },
    {
        " – benign paroxysmal positional ": null
    },
    {
        "vertigo": "vertigo"
    },
    {
        " Labyrinthitis": "labyrinthitis"
    },
    {
        "/": null
    },
    {
        "Vestibular neuronitis": "vestibular neuronitis"
    },
    {
        " Ménières disease": "ménières disease"
    },
    {
        "/": null
    },
    {
        "Endolymphatic hydrops": "endolymphatic hydrops"
    },
    {
        " Perilymphatic fistula": "perilymphatic fistula"
    },
    {
        " Acoustic neuroma": "acoustic neuroma"
    },
    {
        " Hearing loss": "hearing loss"
    },
    {
        " Mastoiditis": "mastoiditis"
    },
    {
        " Otitis externa": "otitis externa"
    },
    {
        " – ": null
    },
    {
        "outer ear": "outer ear"
    },
    {
        " or ": null
    },
    {
        "ear canal": "ear canal"
    },
    {
        " inflammation   ": null
    },
    {
        "Otitis media": "otitis media"
    },
    {
        " – ": null
    },
    {
        "middle ear": "middle ear"
    },
    {
        " inflammation   Perforated ": null
    },
    {
        "eardrum": "eardrum"
    },
    {
        "   Ear surgery": "ear surgery"
    },
    {
        "       Rhinology includes nasal dysfunction and sinus diseases.   ": null
    },
    {
        "Nasal obstruction": "nasal obstruction"
    },
    {
        " Nasal septum deviation": "nasal septum deviation"
    },
    {
        " Sinusitis": "sinusitis"
    },
    {
        " – acute, chronic   Environmental ": null
    },
    {
        "allergies": "allergies"
    },
    {
        " Rhinitis": "rhinitis"
    },
    {
        " Pituitary tumor": "pituitary tumor"
    },
    {
        " Empty nose syndrome": "empty nose syndrome"
    },
    {
        " epistaxis": "epistaxis"
    },
    {
        " Adenoidectomy": "adenoidectomy"
    },
    {
        " Caustic ingestion": "caustic ingestion"
    },
    {
        " Decannulation": "decannulation"
    },
    {
        " Laryngomalacia": "laryngomalacia"
    },
    {
        " Laryngotracheal reconstruction": "laryngotracheal reconstruction"
    },
    {
        " Myringotomy and tubes": "myringotomy"
    },
    {
        " Obstructive sleep apnea": "obstructive sleep apnea"
    },
    {
        " – pediatric   ": null
    },
    {
        "Tonsillectomy": "tonsillectomy"
    },
    {
        " Dysphonia": "dysphonia"
    },
    {
        "/hoarseness   ": null
    },
    {
        "Laryngitis": "laryngitis"
    },
    {
        " Reinkes edema": "reinkes edema"
    },
    {
        " Vocal cord nodules": "vocal fold nodule"
    },
    {
        " and ": null
    },
    {
        "polyps": "vocal cord polyp"
    },
    {
        " Spasmodic dysphonia": "spasmodic dysphonia"
    },
    {
        " Tracheostomy": "tracheostomy"
    },
    {
        " Cancer of the larynx": "cancer of the larynx"
    },
    {
        " Vocology": "vocology"
    },
    {
        " – science and practice of voice habilitation       Facial Plastic and Reconstructive Surgery is a one-year fellowship open to otorhinolaryngologists and plastic surgeons who wish to specialize in the aesthetic and reconstructive surgery of the head, face, and neck.   ": null
    },
    {
        "Rhinoplasty": "rhinoplasty"
    },
    {
        " and ": null
    },
    {
        "septoplasty": "septoplasty"
    },
    {
        " Facelift": "rhytidectomy"
    },
    {
        "   Browlift": "browlift"
    },
    {
        " Blepharoplasty": "blepharoplasty"
    },
    {
        " Otoplasty": "otoplasty"
    },
    {
        " Genioplasty": "genioplasty"
    },
    {
        " Trauma": "physical trauma"
    },
    {
        " to the face   ": null
    },
    {
        "Nasal bone": "nasal bone"
    },
    {
        " fracture   ": null
    },
    {
        "Mandible": "human mandible"
    },
    {
        " fracture   ": null
    },
    {
        "Orbital fracture": "orbital fracture"
    },
    {
        " sinus": "sinus"
    },
    {
        " fracture   Complex lacerations and soft tissue damage   Skin cancer ": null
    }
]