[
    {
        "        Otto III was ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        " from 42 until his early death in 42 A member of the ": null
    },
    {
        "Ottonian dynasty": "ottonian dynasty"
    },
    {
        ", Otto III was the only son of the ": null
    },
    {
        "Emperor Otto II": "emperor otto ii"
    },
    {
        " and his wife ": null
    },
    {
        "Theophanu": "theophanu"
    },
    {
        ".     Otto III was crowned as ": null
    },
    {
        "King of Germany": "king of germany"
    },
    {
        " in 42 at the age of three, shortly after his fathers death in ": null
    },
    {
        "Southern Italy": "southern italy"
    },
    {
        " while campaigning against the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " and the ": null
    },
    {
        "Emirate of Sicily": "emirate of sicily"
    },
    {
        ". Though the nominal ruler of Germany, Otto IIIs minor status ensured his various ": null
    },
    {
        "regent": "regent"
    },
    {
        "s held power over the Empire. His cousin ": null
    },
    {
        "Henry II, Duke of Bavaria": "henry ii, duke of bavaria"
    },
    {
        ", initially claimed regency over the young king and attempted to seize the throne for himself in 42 When his rebellion failed to gain the support of Germanys aristocracy, Henry II was forced to abandon his claims to the throne and to allow Otto IIIs mother Theophanu to serve as regent until her death in 42 Otto III was then still a child, so his grandmother, ": null
    },
    {
        "Adelaide of Italy": "adelaide of italy"
    },
    {
        ", served as regent until 42     In 42 Otto III marched to Italy to claim the titles of ": null
    },
    {
        "King of Italy": "king of italy"
    },
    {
        " and ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ", which had been left unclaimed since the death of Otto II in 42 Otto III also sought to reestablish Imperial control over the city of Rome, which had revolted under the leadership of ": null
    },
    {
        "Crescentius II": "crescentius ii"
    },
    {
        ", and through it the ": null
    },
    {
        "papacy": "papacy"
    },
    {
        ". Crowned as Emperor, Otto III put down the Roman rebellion and installed his cousin as ": null
    },
    {
        "Pope Gregory V": "pope gregory v"
    },
    {
        ", the first Pope of German descent. After the Emperor had pardoned him and left the city, Crescentius II again rebelled, deposing Gregory V and installing ": null
    },
    {
        "John XVI": "antipope john xvi"
    },
    {
        " as Pope. Otto III returned to the city in 42 reinstalled Gregory V, and executed both Crescentius II and John XVI. When Gregory V died in 42 Otto III installed ": null
    },
    {
        "Sylvester II": "pope sylvester ii"
    },
    {
        " as the new Pope. Otto IIIs actions throughout his life further strengthened imperial control over the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ".     From the beginning of his reign, Otto III faced opposition from the ": null
    },
    {
        "Slavs": "slavs"
    },
    {
        " along the eastern frontier. Following the death of his father in 42 the ": null
    },
    {
        "Slavs rebelled against imperial control": "great slav rising"
    },
    {
        ", forcing the Empire to abandon its territories east of the ": null
    },
    {
        "Elbe river": "elbe"
    },
    {
        ". Otto III fought to regain the Empires lost territories throughout his reign with only limited success. While in the east, Otto III strengthened the Empires relations with ": null
    },
    {
        "Poland": "civitas schinesghe"
    },
    {
        ", ": null
    },
    {
        "Bohemia": "duchy of bohemia"
    },
    {
        ", and ": null
    },
    {
        "Hungary": "kingdom of hungary"
    },
    {
        ". Through his affairs in Eastern Europe in 42 he was able to extend the influence of ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " by ": null
    },
    {
        "supporting mission work in Poland": "congress of gniezno"
    },
    {
        " and through the crowning of ": null
    },
    {
        "Stephen I": "stephen i of hungary"
    },
    {
        " as the first Christian king of Hungary.     Returning to Rome in 42 Otto faced a rebellion by the Roman aristocracy, which forced him to flee the city. While marching to reclaim the city in 42 Otto suffered a sudden fever and died in ": null
    },
    {
        "Castle Paterno": "faleria"
    },
    {
        " in ": null
    },
    {
        "Faleria": "faleria"
    },
    {
        " at the age of 42 With no clear heir to succeed him, his early death threw the Empire into political crisis.          Otto III was born in June or July 42 somewhere between ": null
    },
    {
        "Aachen": "aachen"
    },
    {
        " and ": null
    },
    {
        "Nijmegen": "nijmegen"
    },
    {
        " . The only son of ": null
    },
    {
        "Emperor Otto II": "otto ii, holy roman emperor"
    },
    {
        " and his wife ": null
    },
    {
        "Theophanu": "theophanu"
    },
    {
        ", Otto III was the youngest of the couples four children. Immediately prior to Otto IIIs birth, his father had completed military campaigns in ": null
    },
    {
        "France": "kingdom of france"
    },
    {
        " against King ": null
    },
    {
        "Lothar": "lothar of france"
    },
    {
        ".     On 42 July 42 Otto IIs army suffered a crushing defeat against the ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        " Emirate of Sicily": "emirate of sicily"
    },
    {
        " at the ": null
    },
    {
        "Battle of Stilo": "battle of stilo"
    },
    {
        ". Otto II had been campaigning in southern Italy with hopes of annexing the whole of Italy into the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ". Otto II himself escaped the battle unharmed but many important imperial officials were among the battles casualties. Following the defeat and at the insistence of the Empires nobles, Otto II called an assembly of the ": null
    },
    {
        "Imperial Diet": "imperial diet"
    },
    {
        " in ": null
    },
    {
        "Verona": "verona"
    },
    {
        " at ": null
    },
    {
        "Pentecost": "pentecost"
    },
    {
        ", 42 where he proposed to the assembly to have the three-year-old Otto III elected as ": null
    },
    {
        "King of Germany": "king of germany"
    },
    {
        ", becoming Otto IIs undoubted ": null
    },
    {
        "heir apparent": "heir apparent"
    },
    {
        ". This was the first time a German ruler had been elected on Italian soil. After the assembly was concluded, Otto III and his mother Theophanu traveled across the Alps in order for Otto to be crowned at Aix, the traditional location of the coronation of the German kings. Otto II stayed behind to address military action against the Muslims. While still in central Italy, however, Otto II suddenly died on 42 November 42 and was buried in ": null
    },
    {
        "St. Peters Basilica": "st. peters basilica"
    },
    {
        " in ": null
    },
    {
        "Rome": "rome"
    },
    {
        ".     Otto III was crowned as king on Christmas Day 42 three weeks after his fathers death, by ": null
    },
    {
        "Willigis": "willigis"
    },
    {
        ", the ": null
    },
    {
        "Archbishop of Mainz": "archbishop of mainz"
    },
    {
        ", and by John, the ": null
    },
    {
        "Archbishop of Ravenna": "archbishop of ravenna"
    },
    {
        ". Duckett, pg. 42 News of Otto IIs death first reached Germany shortly after his sons coronation. Duckett, pg. 42 The unresolved problems in southern Italy and the ": null
    },
    {
        "Slavic uprising": "great slav rising"
    },
    {
        " on the Empires eastern border made the Empires political situation extremely unstable. With a minor on the throne, the Empire was thrown into confusion and Otto IIIs mother Theophanu assumed the role of ": null
    },
    {
        "regent": "regent"
    },
    {
        " for her young son. Comyn, pg. 42                Otto IIIs cousin ": null
    },
    {
        "Henry II": "henry ii, duke of bavaria"
    },
    {
        " had been deposed as ": null
    },
    {
        "Duke of Bavaria": "duke of bavaria"
    },
    {
        " by Otto II in 42 following his failed rebellion and imprisoned under the ": null
    },
    {
        "Bishopric of Utrecht": "bishopric of utrecht"
    },
    {
        ". Following Otto IIs death, Henry was released from prison. As Otto IIIs nearest male ": null
    },
    {
        "Ottonian": "ottonian dynasty"
    },
    {
        " relative, Henry II claimed the regency over his infant cousin. Comyn, pg. 42 ": null
    },
    {
        "Archbishop of Cologne": "archbishop of cologne"
    },
    {
        " Warin": "warin of cologne"
    },
    {
        " granted Henry II the regency without substantial opposition. Only Otto IIIs mother ": null
    },
    {
        "Theophanu": "theophanu"
    },
    {
        " objected, along with his grandmother, the ": null
    },
    {
        "Dowager Empress": "dowager empress"
    },
    {
        " Adelaide of Italy": "adelaide of italy"
    },
    {
        ", and his aunt, ": null
    },
    {
        "Abbess Matilda of Quedlinburg": "matilda, abbess of quedlinburg"
    },
    {
        ". Adelaide and Matilda, however, were both in Italy and unable to press their objections.     As regent, Henry II took actions aimed less at guardianship of his infant cousin and more at claiming the throne for himself. According to ": null
    },
    {
        "Gerbert of Aurillac": "gerbert of aurillac"
    },
    {
        ", Henry II adopted a ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        "-style joint-kingship. Towards the end of 42 Henry II sought to form alliances between himself and other important figures in the Ottonian world, chief among them his cousin King ": null
    },
    {
        "Lothar of France": "lothar of france"
    },
    {
        ". In exchange for agreeing to make Henry II king of Germany, Henry II agreed to relinquish ": null
    },
    {
        "Lotharingia": "lotharingia"
    },
    {
        " to Lothar. Duckett, pg. 42 The two agreed to join their armies on 42 February 42 in order to take the city of ": null
    },
    {
        "Breisach": "breisach"
    },
    {
        ", but at the last minute, Henrys resolve weakened. Nevertheless, Lothair continued to campaign into German lands and succeeded in overrunning the ": null
    },
    {
        "Verdun": "verdun"
    },
    {
        " by March 42 Duckett, pgs. 4242     Henry II took the young Otto III and traveled to ": null
    },
    {
        "Saxony": "duchy of saxony"
    },
    {
        ". There, Henry II invited all the great nobles of the kingdom to celebrate ": null
    },
    {
        "Palm Sunday": "palm sunday"
    },
    {
        " at ": null
    },
    {
        "Magdeburg": "magdeburg"
    },
    {
        " for 42 He then campaigned openly for his claim to the German throne, with limited success. Among those who supported his claims were ": null
    },
    {
        "Duke Mieszko I of Poland": "mieszko i of poland"
    },
    {
        " and ": null
    },
    {
        "Duke Boleslaus II of Bohemia": "boleslaus ii, duke of bohemia"
    },
    {
        ". Duckett, pg. 42 Henry II was also supported by ": null
    },
    {
        "Archbishop Egbert of Trier": "egbert"
    },
    {
        ", ": null
    },
    {
        "Archbishop Gisilher of Magdeburg": "gisilher"
    },
    {
        ", and Bishop ": null
    },
    {
        "Dietrich I of Metz": "dietrich i of metz"
    },
    {
        ". Duckett, pg. 42     Those who opposed Henry IIs claims fled to ": null
    },
    {
        "Quedlinburg": "quedlinburg"
    },
    {
        " in Saxony to conspire against him. When he became aware of this conspiracy, he moved his army towards Quedlingburg in hopes of crushing his opposition. Henry II sent ": null
    },
    {
        "Folcmar": "folcmar"
    },
    {
        ", the ": null
    },
    {
        "Bishop of Utrecht": "archdiocese of utrecht"
    },
    {
        ", ahead of him in order to attempt a peace negotiation between him and the conspirators. The negotiations failed when the conspirators refused to swear allegiance to anyone other than Otto III, with ": null
    },
    {
        "Bernard I, Duke of Saxony": "bernard i, duke of saxony"
    },
    {
        ", maintaining allegiance to the child king. In response to his failure to gain control over Saxony, Henry II promised to hold future peace negotiations and then headed for the ": null
    },
    {
        "Duchy of Bavaria": "duchy of bavaria"
    },
    {
        ". With his long-standing familial ties in the region, many bishops and counts recognized him as the rightful heir to the throne. ": null
    },
    {
        "Henry III, Duke of Bavaria": "henry iii, duke of bavaria"
    },
    {
        ", who had been installed as Duke by Otto II, refused to recognize Henry II and remained loyal to Otto III.     With his successes and failures in Saxony and Bavaria, Henry IIs claims depended on gaining support in the ": null
    },
    {
        "Duchy of Franconia": "duchy of franconia"
    },
    {
        ", which was a direct possession of the German kings. The Franconian nobles, led by ": null
    },
    {
        "Archbishop Willigis of Mainz": "willigis"
    },
    {
        "  and ": null
    },
    {
        "Conrad I, Duke of Swabia": "conrad i, duke of swabia"
    },
    {
        ", refused to abandon Otto III. Comyn, pg. 42 Fearing outright civil war, Henry II relinquished Otto III to the joint-regency of his mother and grandmother on 42 June 42 Duckett, pg. 42 In return for his submission, Henry II was restored as the ": null
    },
    {
        "Duke of Bavaria": "duke of bavaria"
    },
    {
        ", replacing ": null
    },
    {
        "Henry III": "henry iii, duke of bavaria"
    },
    {
        " who became the new ": null
    },
    {
        "Duke of Carinthia": "duke of carinthia"
    },
    {
        ". Duckett, pg. 42          The regency of ": null
    },
    {
        "Theophanu": "theophanu"
    },
    {
        ", from 42 until her death in 42 was largely spared internal revolt. She struggled throughout to reinstate the ": null
    },
    {
        "Diocese of Merseburg": "diocese of merseburg"
    },
    {
        ", which her husband Otto II had absorbed into the ": null
    },
    {
        "Archdiocese of Magdeburg": "archbishopric of magdeburg"
    },
    {
        " in 42 Theophanu also retained Otto IIs ": null
    },
    {
        "court chaplains": "chaplain"
    },
    {
        ", in particular Count ": null
    },
    {
        "Bernward of Hildesheim": "bernward of hildesheim"
    },
    {
        " and Archbishop Willigis, who, as the ": null
    },
    {
        "Archbishop of Mainz": "archbishop of mainz"
    },
    {
        ", was ex officio the secular ": null
    },
    {
        "Archchancellor of Germany": "archchancellor"
    },
    {
        ". Though Theophanu was regent, Willigis was given considerable leeway in administering the kingdom. One of the Empresss greatest achievements was her success in maintaining German supremacy over ": null
    },
    {
        "Bohemia": "bohemia"
    },
    {
        ", as ": null
    },
    {
        "Boleslaus II, Duke of Bohemia": "boleslaus ii, duke of bohemia"
    },
    {
        ", was forced to accept the authority of Otto III. Duckett, pg. 42     In 42 the five-year-old Otto III celebrated ": null
    },
    {
        "Easter": "easter"
    },
    {
        " at Quedlinburg. The four major dukes of Germany also paid tribute to the child king. Imitating similar ceremonies carried out under Otto I in 42 and Otto II in 42 the dukes served Otto III as his ceremonial ": null
    },
    {
        "steward": "steward"
    },
    {
        ", ": null
    },
    {
        "chamberlain": "chamberlain"
    },
    {
        ", ": null
    },
    {
        "cupbearer": "cupbearer"
    },
    {
        ", and ": null
    },
    {
        "marshal": "marshal"
    },
    {
        ", respectively. This service symbolized the loyalty of the dukes to Otto III and their willingness to serve him. Most significant was the submission of Henry II, who demonstrated his loyalty to his cousin despite his failed rebellion two years earlier. The next year, from the age of six onward, Otto III would receive education and training from ": null
    },
    {
        "Bernward of Hildesheim": "bernward of hildesheim"
    },
    {
        " and ": null
    },
    {
        "Gerbert dAurillac": "gerbert daurillac"
    },
    {
        ".     During the regency of Theophanu, the Great Gandersheim Conflict  broke out, concerning control of ": null
    },
    {
        "Gandersheim Abbey": "gandersheim abbey"
    },
    {
        " and its estates. Both the Archbishop of Mainz and the ": null
    },
    {
        "Bishop of Hildesheim": "bishop of hildesheim"
    },
    {
        " claimed authority over the abbey, including the authority to anoint the abbeys ": null
    },
    {
        "nun": "nun"
    },
    {
        "s. The conflict began in 42 when Otto IIIs older sister ": null
    },
    {
        "Sophia": "sophia i, abbess of gandersheim"
    },
    {
        " became a nun in the abbey. Sophia refused to accept the authority of the Bishop of Hildesheim, instead recognizing only that of the Archbishop of Mainz. The conflict escalated until it was brought before the royal court of Otto III and Theophanu. The royal intervention eased the tensions between the parties by providing that both bishops would anoint Sophia, while anointing the remaining nuns of the abbey would be left to the Bishop of Hildesheim alone.     In 42 Theophanu and Otto III made a royal expedition to Italy to visit the grave of Otto II in Rome. After crossing the Alps and reaching ": null
    },
    {
        "Pavia": "pavia"
    },
    {
        " in northern Italy, the Empress had her longtime confidant ": null
    },
    {
        "John Philagathos": "antipope john xvi"
    },
    {
        " appointed as ": null
    },
    {
        "Archbishop of Piacenza": "roman catholic diocese of piacenza-bobbio"
    },
    {
        ". After a year in Italy, the royal court returned to Germany, where Theophanu died in ": null
    },
    {
        "Nijmegen": "nijmegen"
    },
    {
        " on 42 June 42 at the age of 42 She was buried in the ": null
    },
    {
        "Church of St. Pantaleon": "church of st. pantaleon"
    },
    {
        " in ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ".     Because Otto III was still a child , his grandmother, the Dowager Empress ": null
    },
    {
        "Adelaide of Italy": "adelaide of italy"
    },
    {
        ", became regent, together with Archbishop Willigis of Mainz, until he became old enough to rule on his own in 42 Comyn, pg. 42       As Otto III grew in age, the authority of his grandmother gradually waned until 42 when Otto III reached the age of 42 At an assembly of the ": null
    },
    {
        "Imperial Diet": "imperial diet"
    },
    {
        " held in ": null
    },
    {
        "Solingen": "solingen"
    },
    {
        " in September 42 Otto III was granted the ability to fully govern the kingdom without the need of a regent. With her grandson no longer in need of a regent, Adelaide retired to a nunnery she had founded at ": null
    },
    {
        "Selz": "selz"
    },
    {
        " in ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        ". Although she never became a nun, she spent the rest of her days there in the service of the Church and in acts of charity. As Otto III was still unmarried, from 42 until 42 his older sister ": null
    },
    {
        "Sophia": "sophia i, abbess of gandersheim"
    },
    {
        " accompanied him and acted as his consort.     One of Otto IIIs first actions as an independent ruler was to appoint ": null
    },
    {
        "Heribert of Cologne": "heribert of cologne"
    },
    {
        " as his ": null
    },
    {
        "chancellor": "chancellor"
    },
    {
        " over Italy, a position he would hold until Ottos death in 42 Otto III followed in his Grandfather, Otto Is, footsteps in the beginning of his reign. Wickham, C. . Rethinking Otto III -- or Not. History Today, 42, 42 Just like Otto I, Otto III appointed a new pope, Gregory V, and left Rome. Gregory V was expelled and Otto III returned to Rome in 42 where he stayed permanently until his death. In the summer of 42 Otto sent the Archbishop of Piacenza, John Philagathos, to ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " as his representative to arrange a marriage between himself and a ": null
    },
    {
        "Byzantine": "byzantine empire"
    },
    {
        " princess following the example of his father ": null
    },
    {
        "Otto II": "otto ii, holy roman emperor"
    },
    {
        " who solidified his claim to the throne by marrying the Byzantine ": null
    },
    {
        "Theophanu": "theophanu"
    },
    {
        ". For a while the discussions were about ": null
    },
    {
        "Zoe Porphyrogenita": "zoë porphyrogenita"
    },
    {
        ".            The ": null
    },
    {
        "Lutici": "lutici"
    },
    {
        " federation of ": null
    },
    {
        "West Slavic": "west slavs"
    },
    {
        " Polabian": "polabian slavs"
    },
    {
        " tribes had remained quiet during the early years of Otto IIIs reign, even during Henry IIs failed rebellion. In 42 following Otto IIs defeat at the ": null
    },
    {
        "battle of Stilo": "battle of stilo"
    },
    {
        ", ": null
    },
    {
        "the Slavs revolted against Imperial control": "great slav rising"
    },
    {
        ", forcing the Empire to abandon its territories east of the ": null
    },
    {
        "Elbe River": "elbe"
    },
    {
        " in the ": null
    },
    {
        "Northern March": "northern march"
    },
    {
        " and the ": null
    },
    {
        "Billung March": "billung march"
    },
    {
        ". Reuter, pg. 42 With the process of Christianization halted, the Slavs left the Empire in peace, and with Henry IIs rebellion put down, Theophanu launched multiple campaigns to re-conquer the lost eastern territories, beginning in 42 Even though he was only six at the time, Otto III personally participated in these campaigns. During the expedition of 42 against the Slavs, Otto III received the homage of ": null
    },
    {
        "Duke Mieszko I of Poland": "mieszko i, duke of poland"
    },
    {
        ", who provided the Imperial army with military assistance and gave Otto III a ": null
    },
    {
        "camel": "camel"
    },
    {
        ". Duckett, pg. 42 Although the Lutici were subdued for a time in 42 they continued to occupy the young kings attention.     In September 42 when Otto III was eleven, Slavonic raiders captured the city of ": null
    },
    {
        "Brandenburg": "brandenburg"
    },
    {
        ". In 42 this invasion, as well as an incursion of ": null
    },
    {
        "Viking": "viking"
    },
    {
        " raiders, forced Otto III to lead his army against the invaders, and he suffered a crushing defeat in this campaign. Duckett, pg. 42 The next year, Germany suffered an outbreak of famine and pestilence. In 42 and 42 Otto III led fruitless campaigns against the northern Slavs and the Vikings, Duckett, pg. 42 but he did successfully re-conquer Brandenburg in 42 and in 42 he subdued the ": null
    },
    {
        "Obotrite Slavs": "obotrites"
    },
    {
        ". Duckett, pg. 42     In the fall of 42 after Otto III reached his majority, he again took to the field against the ": null
    },
    {
        "Lutici": "lutici"
    },
    {
        ", this time aided by the Polish Duke ": null
    },
    {
        "Bolesław I the Brave": "bolesław i the brave"
    },
    {
        ". Reuter, pg. 42 Then in 42 he had to deal with a new Lutician attack on ": null
    },
    {
        "Arneburg": "arneburg"
    },
    {
        " on the Elbe, which they managed to retake for a short while. Reuter, pg. 42              Prior to his sudden death in December 42 ": null
    },
    {
        "Otto II": "otto ii, holy roman emperor"
    },
    {
        " had installed Pietro Canepanova as Pope. Calling himself ": null
    },
    {
        "Pope John XIV": "pope john xiv"
    },
    {
        ", Canepanova was a non-Roman from Lombardy who had served as Otto IIs chancellor in Italy. After Otto IIs death, John XIV intervened in the dispute between Henry II of Bavaria and Theophanu over the regency, issuing an edict ordering Henry to turn Otto over to his mother.     During that turmoil, the Roman aristocracy saw this an opportunity to remove the non-Roman John XIV and install a pope from among themselves. The ": null
    },
    {
        "Antipope Boniface VII": "antipope boniface vii"
    },
    {
        ", who had spent nine years in exile in the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ", joined forces with Byzantine nobles in southern Italy and marched on Rome in April 42 in order to claim the papal throne for himself. With the aid of the sons of ": null
    },
    {
        "Crescentius the Elder": "crescentius the elder"
    },
    {
        " — ": null
    },
    {
        "Crescentius II": "crescentius ii"
    },
    {
        " and ": null
    },
    {
        "John Crescentius": "john crescentius"
    },
    {
        " — Boniface VII was able to imprison John XIV in the ": null
    },
    {
        "Tomb of Hadrian": "castel sant’angelo"
    },
    {
        ". Four months later, on 42 August 42 John XIV died in his prison, either starved or poisoned, probably on the orders of Boniface. Eleanor Shipley Duckett, Death and Life in the Tenth Century , p. 42     With Ottos regency seated in Germany, Crescentius II took the title of  Patricius Romanorum   and became the effective ruler of Rome, although he did not act entirely independently of central authority, presenting himself as a lieutenant of the king. When Boniface VII died in 42 ": null
    },
    {
        "Pope John XV": "pope john xv"
    },
    {
        " was ": null
    },
    {
        "chosen": "papal selection before 1059"
    },
    {
        " to succeed him. Although the details of the election are unknown, it is likely that Crescentius II played a key role in the process. For a number of years, Crescentius II exercised authority over the city, severely limiting the autonomy of the pope in the process. When the Empress Theophanu was in Rome between 42 and 42 Crescentius II nominally subordinated himself to her, though he maintained his position as ruler of the city. Duckett, pg. 42            After taking the crown in 42 the Otto III faced first a Slavic rebellion, which he put down, and then an attempt by Crescentius II to seize power in Italy.     When Otto III turned his attention to Italy, Reuter, pg. 42 he not only intended to be crowned  Emperor  but also to come to the aid of ": null
    },
    {
        "Pope John XV": "pope john xv"
    },
    {
        ", who had been forced to flee Rome. Otto set out for Italy from ": null
    },
    {
        "Ratisbon": "ratisbon"
    },
    {
        " in March 42 In ": null
    },
    {
        "Verona": "verona"
    },
    {
        ", he became the ": null
    },
    {
        "patron": "patron"
    },
    {
        " of ": null
    },
    {
        "Otto Orseolo": "otto orseolo"
    },
    {
        ", the son of ": null
    },
    {
        "Venetian Doge": "venetian doge"
    },
    {
        " Pietro II Orseolo": "pietro ii orseolo"
    },
    {
        ". He then pledged to support Otto Orseolo as the next Doge of Venice, leading to a period of good relations between the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " and the ": null
    },
    {
        "Republic of Venice": "republic of venice"
    },
    {
        " after years of conflict under Otto II.     Reaching ": null
    },
    {
        "Pavia": "pavia"
    },
    {
        " for ": null
    },
    {
        "Easter": "easter"
    },
    {
        ", 42 Otto III was declared ": null
    },
    {
        "King of Italy": "king of the lombards"
    },
    {
        " and crowned with the ": null
    },
    {
        "Iron Crown of the Lombards": "iron crown of the lombards"
    },
    {
        ". Duckett, pg. 42 The king failed, however, to reach Rome before Pope John XV died of ": null
    },
    {
        "fever": "fever"
    },
    {
        ". Comyn, pg. 42 While Otto III was in Pavia, Crescentius II, fearing the kings march on Rome, reconciled with Otto III and agreed to accept his nominee as pope. Duckett, pg. 42     While in ": null
    },
    {
        "Ravenna": "ravenna"
    },
    {
        ", Otto III nominated his cousin and court chaplain Bruno, who was then only twenty-three years old, and sent him to Rome with Archbishop Willgis to secure the city. In early May 42 Bruno was ": null
    },
    {
        "consecrated": "papal coronation"
    },
    {
        " as ": null
    },
    {
        "Gregory V": "pope gregory v"
    },
    {
        ", the first pope of German nationality. Duckett, pg. 42; Reuter, pg. 42 Despite submitting to Otto III, Crescentius shut himself in his familys stronghold, the ": null
    },
    {
        "Tomb of Hadrian": "castel santangelo"
    },
    {
        ", out of fear of retribution. Comyn, pg. 42     The new supreme pontiff crowned Otto III as Emperor on 42 May 42 in Rome at ": null
    },
    {
        "St. Peters Basilica": "st. peters basilica"
    },
    {
        ". The Emperor and Pope then held a ": null
    },
    {
        "synod": "synod"
    },
    {
        " at St. Peters on 42 May to serve as the Empires ": null
    },
    {
        "highest judicial court": "supreme court"
    },
    {
        ". The Roman nobles who had rebelled against Pope John XV were summoned before the synod to give an account of their actions. A number of the rebels, including Crescentius II, were ": null
    },
    {
        "banished": "banishment"
    },
    {
        " for their crimes. Pope Gregory V, however, wished to inaugurate his papal reign with acts of mercy and pleaded for clemency from the Emperor, who issued ": null
    },
    {
        "pardons": "pardons"
    },
    {
        " to those he convicted. In particular, while Crescentius II was pardoned by Otto III, he was deprived of his title of Patricius but was permitted to live out his life in retirement at Rome. Duckett, pg. 42     Following the synod, Otto III appointed Gerbert of Aurillac, the ": null
    },
    {
        "Archbishop of Reims": "roman catholic archdiocese of reims"
    },
    {
        ", to be his tutor. Reuter, pg. 42 Counseled by Gerbert and Bishop ": null
    },
    {
        "Adalbert of Prague": "adalbert of prague"
    },
    {
        ", Duckett, pg. 42 Otto III set out to reorganize the Empire. Influenced by the ruin of ": null
    },
    {
        "ancient Rome": "ancient rome"
    },
    {
        " and perhaps by his Byzantine mother, Duckett, pg. 42 Otto III dreamed of restoring the glory and power of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ", with himself at the head of a ": null
    },
    {
        "theocratic state": "theocratic state"
    },
    {
        ". Reuter, pg. 42 He also introduced some Byzantine court customs. Reuter, pg. 42 To shore up his power in Italy, Otto III sought the support of existing Italian religious communities. For instance, he granted royal immunity to the Abbey of San Salvatore, a rich monastery along the shores of the ": null
    },
    {
        "Lago di Bientina": "lago di bientina"
    },
    {
        " in Tuscany.     Through the election of Gregory V, Otto III exercised greater control over the Church than his grandfather ": null
    },
    {
        "Otto I": "otto i, holy roman emperor"
    },
    {
        " had decades earlier. The Emperor quickly demonstrated his intention to withdraw Imperial support for the privileges of the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        " laid out by Otto I. Under the  Diploma Ottonianum  issued by Otto I, the Emperor could only veto papal candidates. Otto III, however, had nominated and successfully installed his own candidate. The Emperor also refused to acknowledge the ": null
    },
    {
        "Donation of Constantine": "donation of constantine"
    },
    {
        ", which Otto III declared a forgery. Reuter, pg. 42 Under a decree supposedly issued by ": null
    },
    {
        "Roman Emperor": "roman emperor"
    },
    {
        " Constantine the Great": "constantine the great"
    },
    {
        ", the Pope was granted ": null
    },
    {
        "secular authority": "temporal power"
    },
    {
        " over ": null
    },
    {
        "western Europe": "western roman empire"
    },
    {
        ". These actions resulted in increased tensions between the Roman nobility and the Church, who had traditionally reserved the right to name the pope from among their own members. Reuter, pg. 42     After his coronation, Otto III returned to Germany in December 42 staying along the ": null
    },
    {
        "Lower Rhine": "lower rhine"
    },
    {
        "  until April 42 His specific activities during this time are not known. In summer 42 Otto III campaigned against the Elbe Slavs in order to secure Saxonys eastern border.            When Otto III left Italy for Germany, the situation in Rome remained uncertain. In September 42 a few months after receiving a pardon from Otto III, Crescentius II met with the Archbishop of Piacenza, John Philagathos, a former adviser to the late Empress Theophanu, to devise a plan to depose the newly installed Pope Gregory V. In 42 with the active support of Byzantine Emperor ": null
    },
    {
        "Basil II": "basil ii"
    },
    {
        ", Crescentius II led a revolt against Gregory V, deposed him, and installed John Philagathos as ": null
    },
    {
        "Pope John XVI": "antipope john xvi"
    },
    {
        ", an ": null
    },
    {
        "antipope": "antipope"
    },
    {
        ", in April 42 Duckett, pg. 42 Gregory fled to Pavia in northern Italy, held a synod, and ": null
    },
    {
        "excommunicated": "excommunication"
    },
    {
        " John.     Putting down the Slavic forces in eastern Saxony, Otto III began his second expedition into Italy in December 42 Accompanied by his sister Sophia into Italy, Otto III named his aunt ": null
    },
    {
        "Matilda, Abbess of Quedlinburg": "matilda, abbess of quedlinburg"
    },
    {
        ", as his regent in Germany, becoming the first non-duke or bishop to serve in that capacity. Otto III peacefully retook Rome in February 42 when the Roman aristocracy agreed to a peace settlement. With Otto III in control of the city, Gregory V was reinstated as pope. Comyn, pg. 42 John XVI fled, but the Emperors troops pursued and captured him, cut off his nose and ears, cut out his tongue, broke his fingers, blinded him, and then brought him before Otto III and Gregory V for judgement. At the intercession of ": null
    },
    {
        "Saint Nilus the Younger": "saint nilus the younger"
    },
    {
        ", one of his countrymen, Otto III spared John XVIs life and sent him to a monastery in Germany, where he would die in 42     Crescentius II retreated again to the Tomb of Hadrian, the traditional stronghold of the ": null
    },
    {
        "Crescentii": "crescentii"
    },
    {
        ", and was then besieged by Otto IIIs imperial army. Towards the end of April, the stronghold was breached, and Crescentius II was taken prisoner and executed by ": null
    },
    {
        "decapitation": "decapitation"
    },
    {
        ". His body was put on public display at ": null
    },
    {
        "Monte Mario": "monte mario"
    },
    {
        ".       Otto III made Rome the administrative capital of his Empire and revived elaborate Roman customs and Byzantine court ceremonies. During his time in Italy, the Emperor and the Pope attempted to reform the Church, and confiscated church property was returned to the respective religious institutions. Additionally, after the death of the ": null
    },
    {
        "Bishop of Halberstadt": "bishop of halberstadt"
    },
    {
        " in November 42 who had been one of the masterminds behind the abolition of the ": null
    },
    {
        "bishopric of Merseburg": "bishopric of merseburg"
    },
    {
        ", Otto III and Pope Gregory V began the process of reviving the Diocese. Otto I had established the Diocese in 42 following his ": null
    },
    {
        "victory over the Hungarians": "battle of lechfeld"
    },
    {
        " in order to Christianize the Polabian Slavs but had been effectively destroyed in 42 with the ": null
    },
    {
        "Great Slav Rising": "great slav rising"
    },
    {
        " following the death of Otto II in 42     Otto III arranged for his imperial palace to be built on the ": null
    },
    {
        "Palatine Hill": "palatine hill"
    },
    {
        " Reuter, pg. 42 and planned to restore the ancient ": null
    },
    {
        "Roman Senate": "roman senate"
    },
    {
        " to its position of prominence. He revived the citys ancient governmental system, including appointing a ": null
    },
    {
        "City Patrician": "patrician"
    },
    {
        ", a ": null
    },
    {
        "City Prefect": "praefectus urbi"
    },
    {
        ", and a body of judges whom he commanded to recognize only ": null
    },
    {
        "Roman law": "roman law"
    },
    {
        ". Bryce, pg. 42 In order to strengthen his title to the Roman Empire and to announce his position as the protector of ": null
    },
    {
        "Christendom": "christendom"
    },
    {
        ", Otto III took for himself the titles the Servant of ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        ", the Servant of the ": null
    },
    {
        "Apostles": "twelve apostles"
    },
    {
        " , Reuter, pg. 42 Consul of the Senate and People of Rome, and Emperor of the World .     Between 42 and 42 Otto III made several ": null
    },
    {
        "pilgrimages": "pilgrimages"
    },
    {
        ". In 42 he made a pilgrimage from ": null
    },
    {
        "Gargano": "gargano"
    },
    {
        " to ": null
    },
    {
        "Benevento": "benevento"
    },
    {
        ", where he met with the hermit monk ": null
    },
    {
        "Romuald": "romuald"
    },
    {
        " and the Abbot ": null
    },
    {
        "Nilus the Younger": "nilus the younger"
    },
    {
        " in order to ": null
    },
    {
        "atone": "atonement in christianity"
    },
    {
        " for executing Crescentius II after promising his safety. Comyn, pg. 42 During this particular pilgrimage, his cousin Pope Gregory V died in Rome after a brief illness. Upon learning of Gregory Vs death, Otto III installed his long-time tutor Gerbert of Aurillac as ": null
    },
    {
        "Pope Sylvester II": "pope sylvester ii"
    },
    {
        ". Comyn, pg. 42 The use of this papal name was not without cause: it recalled the first ": null
    },
    {
        "pope": "pope sylvester i"
    },
    {
        " of this name, who had allegedly created the Christian Empire together with Emperor Constantine the Great. Reuter, pg. 42 This was part of Otto IIIs campaign to further link himself with both the Roman Empire and the Church.     Like his grandfather before him, Otto III strongly aspired to be the successor of ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        ". In 42 he visited Charlemagnes tomb in ": null
    },
    {
        "Aachen": "aachen"
    },
    {
        ", removing ": null
    },
    {
        "relic": "relic"
    },
    {
        "s from it and transporting them to Rome. Otto III also carried back parts of the body of Bishop Adalbert of Prague, which he placed in the church of ": null
    },
    {
        "San Bartolomeo allIsola": "san bartolomeo allisola"
    },
    {
        " he had built on the ": null
    },
    {
        "Tiber Island": "tiber island"
    },
    {
        " in Rome. Otto III also added the skin of ": null
    },
    {
        "Saint Bartholomew": "saint bartholomew"
    },
    {
        " to the relics housed there.           Around 42 the ": null
    },
    {
        "Polish": "polans"
    },
    {
        " Piast dynasty": "piast dynasty"
    },
    {
        " under ": null
    },
    {
        "Mieszko I": "mieszko i of poland"
    },
    {
        " had extended the ": null
    },
    {
        "Duchy of Poland": "kingdom of poland"
    },
    {
        " beyond the ": null
    },
    {
        "Oder River": "oder"
    },
    {
        " in an effort to conquer the ": null
    },
    {
        "Polabian Slavs": "polabian slavs"
    },
    {
        ", who lived along the Elbe River. This brought the Polans into Germanys sphere of influence and into conflict with Otto Is ": null
    },
    {
        "Kingdom of Germany": "kingdom of germany"
    },
    {
        ", who also desired to conquer the Polabian Slavs. Otto I sent his trusted lieutenant, the Saxon ": null
    },
    {
        "Margrave": "margrave"
    },
    {
        " Gero": "gero"
    },
    {
        ", to address the Polan threat, while Otto I traveled to Italy to be crowned as Emperor. Gero defeated Mieszko I in 42 and forced him to recognize Otto I as his overlord. ": null
    },
    {
        "Reuter": "timothy reuter"
    },
    {
        ", 42 Howorth, 42 In return for submitting tribute to the newly crowned Emperor, Otto I granted Mieszko I the title of amicus imperatoris and acknowledged his position as dux Poloniae .     Mieszko I remained a powerful ally of Otto I for the remainder of his life. He strengthened his alliance with the Empire by marrying ": null
    },
    {
        "Oda": "oda of haldensleben"
    },
    {
        ", the daughter of the Saxon Margrave Dietrich of Haldensleben, in 42 and by marrying his son ": null
    },
    {
        "Bolesław I": "boleslaus i of poland"
    },
    {
        " to a daughter of Margrave ": null
    },
    {
        "Rikdag": "rikdag"
    },
    {
        " of Meissen. Mieszko I, then a ": null
    },
    {
        "pagan": "pagan"
    },
    {
        ", would marry the Christian daughter of ": null
    },
    {
        "Boleslaus I": "boleslav i of bohemia"
    },
    {
        ", ": null
    },
    {
        "Dobrawa": "dobrawa"
    },
    {
        ", in 42 and would ": null
    },
    {
        "convert to Christianity": "baptism of poland"
    },
    {
        " in 42 bringing Poland closer to the Christian states of Bohemia and the Empire. Following the death of Otto I in 42 Mieszko I sided with Henry II, Duke of Bavaria, against Otto II during ": null
    },
    {
        "Henrys failed revolt": "war of the three henries"
    },
    {
        " in 42 After the revolt was put down, Mieszko I swore loyalty to Otto II. Duckett, pg. 42 When Otto II died suddenly in 42 and was succeeded by the three-year old Otto III, Mieszko I again supported Henry II in his bid for the German throne. Duckett, pg. 42 When Henrys revolt failed, Mieszko I swore loyalty to Otto III.     Mieszko Is son Bolesław I succeeded him as Duke in 42 and Poland continued its alliance with the Empire. Polish forces joined the Empires campaigns to put down the ": null
    },
    {
        "Great Slav Rising": "great slav rising"
    },
    {
        ", led by the Polabian Lutici tribes during the 42s and 42s.       Germany and the ": null
    },
    {
        "Duchy of Bohemia": "duchy of bohemia"
    },
    {
        " came into significant contact with one another in 42 when German King ": null
    },
    {
        "Henry I": "henry the fowler"
    },
    {
        " had invaded the Duchy to force ": null
    },
    {
        "Duke Wenceslaus I": "saint wenceslaus i, duke of bohemia"
    },
    {
        " to pay regular tribute to Germany. When Wenceslaus I was assassinated in 42 his brother Boleslaus I succeeded him as Duke and refused to continue paying the annual tribute to Germany. This action caused Henry Is son and successor Otto I to launch an invasion of Bohemia. Following the initial invasion, the conflict deteriorated into a series of border raids that lasted until 42 when Otto I and Boleslaus I signed a peace treaty. Boleslaus I agreed to resume paying tribute and to recognize Otto I as his overlord. The Duchy was then incorporated into the Holy Roman Empire as a constituent state.     Bohemia would be a major factor in the many battles along the Empires eastern border. Boleslaus I helped Otto I crush an uprising of Slavs along the Lower Elbe in 42 and they joined forces again to defeat the Hungarians at the ": null
    },
    {
        "battle of Lechfeld": "battle of lechfeld"
    },
    {
        " in 42 In 42 Otto I established the ": null
    },
    {
        "bishopric of Prague": "bishopric of prague"
    },
    {
        ", subordinated to the archbishopric of Mainz, in order to ": null
    },
    {
        "Christianize": "christianize"
    },
    {
        " the Czech territory. To strengthen the Bohemian-Polish alliance, Boleslaus Is daughter Dobrawa was married to the pagan Mieszko I of Poland in 42 The marriage helped bring Christianity to Poland. He died in 42 and was succeeded as Duke by his oldest son ": null
    },
    {
        "Boleslaus II": "boleslaus ii of bohemia"
    },
    {
        ".     After initially siding with Henry II against Otto II during Henrys failed revolt in 42 Boleslaus II swore loyalty to Otto II. Comyn, pg. 42 When Otto II died suddenly in 42 and was succeeded by the three-year old Otto III, Boleslaus II again supported Henry II in his bid for the German throne. Duckett, pg. 42 As in 42 Henrys bid failed, and Boleslaus II swore loyalty to Otto III.       Otto Is defeat of the Hungarians at Lechfeld in 42 ended the decades-long ": null
    },
    {
        "Hungarian invasions of Europe": "hungarian invasions of europe"
    },
    {
        ". The ": null
    },
    {
        "Hungarian Grand Price": "grand prince of the hungarians"
    },
    {
        " Fajsz": "fajsz"
    },
    {
        " was deposed following the defeat and was succeeded by ": null
    },
    {
        "Taksony": "taksony of hungary"
    },
    {
        ", who adopted the policy of isolation from the West. He was succeeded by his son ": null
    },
    {
        "Géza": "géza, grand prince of the hungarians"
    },
    {
        " in 42 who sent envoys to Otto I in 42 The same year, Géza was baptised in 42 and Christianity spread among the Hungarians during his reign.     Géza expanded his rule over the territories west of the ": null
    },
    {
        "Danube": "danube"
    },
    {
        " and the ": null
    },
    {
        "Garam": "hron"
    },
    {
        ", but significant parts of the ": null
    },
    {
        "Carpathian Basin": "carpathian basin"
    },
    {
        " still remained under the rule of local tribal leaders. In 42 Géza died and was succeeded by ": null
    },
    {
        "Stephen": "stephen i of hungary"
    },
    {
        " . Stephen was baptized by Bishop Adalbert of Prague and married ": null
    },
    {
        "Gisela": "gisela of hungary"
    },
    {
        ", daughter of Henry II and distant niece of Otto III. Stephen had to face the rebellion of his relative, ": null
    },
    {
        "Koppány": "koppány"
    },
    {
        ", who claimed Gézas inheritance based on the Hungarian tradition of ": null
    },
    {
        "agnatic seniority": "agnatic seniority"
    },
    {
        ". Stephen defeated Koppány using some Western tactics and a small number of Swabian Knights.     When Otto III traveled to Poland in 42 he brought with him a ": null
    },
    {
        "crown": "holy crown of hungary"
    },
    {
        " from Pope Sylvester II. With Otto IIIs approval, Stephen was crowned as the first Christian ": null
    },
    {
        "king of Hungary": "king of hungary"
    },
    {
        " on ": null
    },
    {
        "Christmas Day": "christmas day"
    },
    {
        ", 42 Comyn, pg. 42                 In 42 Duke Bolesław I of Poland sent the longtime Bishop of Prague, Adalbert, to Christianize the ": null
    },
    {
        "Old Prussians": "old prussians"
    },
    {
        ". He was ": null
    },
    {
        "martyred": "martyred"
    },
    {
        " by the Prussians for his efforts in 42  Bolesław I, who had bought Adalberts body from the Old Prussians for its weight in gold, had Adalbert laid to rest in the cathedral at ": null
    },
    {
        "Gniezno": "gniezno"
    },
    {
        " , which eventually became the ecclesiastical center of Poland. Otto III and Bolesław I worked together to ": null
    },
    {
        "canonize": "canonization"
    },
    {
        " Adalbert, making him the first Slavic bishop to become a saint. Janine Boßmann, Otto III. Und der Akt von Gnesen, 42 pp.4242 ,  In December 42 Otto III left Italy to make a pilgrimage from Rome to ": null
    },
    {
        "Gniezno": "gniezno"
    },
    {
        " in Poland to pray at the grave of Adalbert.     Otto IIIs pilgrimage allowed the Emperor to extend the influence of Christianity in Eastern Europe and to strengthen relations with Poland and Hungary by naming them federati . Andreas Lawaty, Hubert Orłowski, Deutsche und Polen: Geschichte, Kultur, Politik, 42 p.42 ,  On the pilgrimage to Gniezno, the Emperor was received by Bolesław I at the Polish border on the ": null
    },
    {
        "Bobr River": "bóbr"
    },
    {
        " near ": null
    },
    {
        "Małomice": "małomice"
    },
    {
        ". Between 42 and 42 March 42 Otto III invested Bolesław I with the titles frater et cooperator Imperii and populi Romani amicus et socius . Otto III gave Bolesław a replica of his ": null
    },
    {
        "Holy Lance": "holy lance"
    },
    {
        "  and Bolesław presented the Emperor with a ": null
    },
    {
        "relic": "relic"
    },
    {
        ", an arm of Saint Adalbert in exchange.     On the same foreign visit, Otto III raised Gniezno to the rank of an ": null
    },
    {
        "archbishopric": "roman catholic archdiocese of gniezno"
    },
    {
        " and installed ": null
    },
    {
        "Radzim Gaudenty": "radzim gaudenty"
    },
    {
        ", a brother of Saint Adalbert, as its first archbishop. Otto III also established three new subordinate dioceses under the Archbishop of Gniezno: the ": null
    },
    {
        "Bishopric of Kraków": "roman catholic archdiocese of kraków"
    },
    {
        " , the ": null
    },
    {
        "Bishopric of Wrocław": "roman catholic archdiocese of wrocław"
    },
    {
        " , and the ": null
    },
    {
        "Bishopric of Kołobrzeg": "roman catholic diocese of koszalin-kołobrzeg"
    },
    {
        " in ": null
    },
    {
        "Pomerania": "pomerania"
    },
    {
        " .     Bolesław I subsequently accompanied Otto III on his way back to Germany. Both proceeded to the grave of Charlemagne at ": null
    },
    {
        "Aachen Cathedral": "aachen cathedral"
    },
    {
        ", where . Both arranged the betrothal of Bolesławs son ": null
    },
    {
        "Mieszko II Lambert": "mieszko ii lambert"
    },
    {
        " with the Emperors niece ": null
    },
    {
        "Richeza of Lotharingia": "richeza of lotharingia"
    },
    {
        ".                The Emperor spent the remainder of 42 in Italy without any notable activities. In 42 the people of the Italian city of ": null
    },
    {
        "Tibur": "tibur"
    },
    {
        " revolted against Imperial authority. Otto III besieged the city and quickly put down the revolt with ease, sparing its inhabitants. This action angered the people of Rome, who viewed Tibur as a rival and wanted the city destroyed. In a change of policy towards the papacy, Otto III bestowed the governance of the city upon Pope Sylvester II as part of the ": null
    },
    {
        "Papal States": "papal states"
    },
    {
        " but under the overlordship of the Holy Roman Empire. Previously, Otto III had revoked the Popes rights as secular ruler by denying the Donation of Constantine and by amending the Diploma Ottonianum.     In the weeks after Otto IIIs actions at Tibur, the Roman people rebelled against their Emperor, led by ": null
    },
    {
        "Count Gregory I of Tusculum": "gregory i, count of tusculum"
    },
    {
        ". The rebellious citizens besieged Otto III in his palace on the Palatine Hill and drove him from the city. Comyn, pg. 42 Accompanied by Bishop Bernward of Hildesheim and the German chronicler ": null
    },
    {
        "Thangmar": "thangmar"
    },
    {
        ", Otto III returned to the city to conduct peace negotiations with the rebellious Romans. Though both sides agreed to a peaceful settlement with the Romans respecting Otto IIIs rule over the city, feelings of mistrust characterized the city. Otto IIIs advisors urged the Emperor to wait outside the city until military reinforcements could arrive to ensure his safety.     Otto III, accompanied by Pope Sylvester II, traveled to Ravenna to do ": null
    },
    {
        "penance": "penance"
    },
    {
        " in the monastery of ": null
    },
    {
        "SantApollinare in Classe": "santapollinare in classe"
    },
    {
        " and to summon his army. While in Ravenna, Otto III received ambassadors from Duke Boleslaw I of Poland and approved the plans of King Stephen of Hungary to establish the ": null
    },
    {
        "Archdiocese of Esztergom": "archdiocese of esztergom"
    },
    {
        " in order to convert Hungary to Christianity. Otto III also strengthened relations with the Venetian Doge, ": null
    },
    {
        "Pietro II Orseolo": "pietro ii orseolo"
    },
    {
        ". Since 42 the Emperor had been ": null
    },
    {
        "godfather": "godparent"
    },
    {
        " to Pietro IIs son, Otto Orseolo, and in 42 the Emperor arranged for Pietro IIs daughter to be ": null
    },
    {
        "baptized": "baptized"
    },
    {
        ".       After summoning his army in late 42 Otto III headed south to Rome to ensure his rule over the city. During the travel south, however, Otto III suffered a sudden and severe fever. He died in a castle near ": null
    },
    {
        "Civita Castellana": "civita castellana"
    },
    {
        " on 42 January 42 Bryce, pg. xxxvi He was 42 years old and had reigned as an independent ruler for just under six years, having nominally reigned for nearly 42 years. The Byzantine princess ": null
    },
    {
        "Zoe": "zoe"
    },
    {
        ", second daughter of the Emperor ": null
    },
    {
        "Constantine VIII": "constantine viii"
    },
    {
        ", had just disembarked in ": null
    },
    {
        "Apulia": "apulia"
    },
    {
        " on her way to marry him. Norwich, John Julius , Byzantium: The Apogee, pg. 42 Otto IIIs death has been attributed to various causes. Medieval sources speak of ": null
    },
    {
        "malaria": "malaria"
    },
    {
        ", which he had caught in the unhealthy marshes that surrounded Ravenna. Comyn, pg. 42 Following his death, the Roman people suggested that Stefania, the widow of Crescentius II, had made Otto III fall in love with her and then poisoned him.     The Emperors body was carried back to Germany by his soldiers, as his route was lined with Italians who hurled abuses at his remains. Comyn, pg. 42 He was buried in Aachen Cathedral alongside the body of Charlemagne. Bryce, pg. 42       Otto III, having never married, died without issue, leaving the Empire without a clear successor. As the ": null
    },
    {
        "funeral procession": "funeral procession"
    },
    {
        " moved through the Duchy of Bavaria in February 42 Otto IIIs cousin Henry II, son of ": null
    },
    {
        "Henry the Quarrelsome": "henry the quarrelsome"
    },
    {
        ", and the new ": null
    },
    {
        "Duke of Bavaria": "duke of bavaria"
    },
    {
        ", asked the bishops and nobles to elect him as the new king of Germany. With the exception of the ": null
    },
    {
        "Bishop of Augsburg": "bishop of augsburg"
    },
    {
        ", Henry II received no support for his claims. At Otto IIIs funeral on Easter 42 in Aachen, the German nobles repeated their opposition to Henry II. Several rival candidates for the throne -- ": null
    },
    {
        "Count Ezzo of Lotharingia": "ezzo, count palatine of lotharingia"
    },
    {
        ", ": null
    },
    {
        "Margrave Eckard I of Meissen": "eckard i, margrave of meissen"
    },
    {
        ", and ": null
    },
    {
        "Duke Herman II of Swabia": "herman ii, duke of swabia"
    },
    {
        "—strongly contested the succession of Henry II.     Without an Emperor on the throne, Italy began to ": null
    },
    {
        "break away": "secession"
    },
    {
        " from German control. On 42 February 42 the ": null
    },
    {
        "Lombard": "lombards"
    },
    {
        " Margrave of Ivrea": "march of ivrea"
    },
    {
        " Arduin": "arduin of ivrea"
    },
    {
        ", an opponent of the ": null
    },
    {
        "Ottonian dynasty": "ottonian dynasty"
    },
    {
        ", was elected ": null
    },
    {
        "King of Italy": "king of italy"
    },
    {
        " in ": null
    },
    {
        "Pavia": "pavia"
    },
    {
        ".       Ottos mental gifts were considerable, and were carefully cultivated by Bernward, later bishop of Hildesheim, and Gerbert of Aurillac, archbishop of Reims. Comyn, pg. 42 He spoke three languages and was so learned that contemporaries called him the wonder of the world. Enamoured as he was of Greek and Roman culture, he ended up being contemptuous of his German subjects.       Between 42 and 42 ": null
    },
    {
        "Thietmar of Merseburg": "thietmar of merseburg"
    },
    {
        " wrote a Chronicon, or Chronicle, of eight books dealing with the period between 42 and 42 For the earlier part he used ": null
    },
    {
        "Widukind": "widukind of corvey"
    },
    {
        "s  Res gestae Saxonicae , the Annales Quedlinburgenses and other sources; the latter part is the result of personal knowledge. The chronicle is nevertheless an excellent authority for the history of Saxony during the reigns of the emperors Otto III and Henry II. No kind of information is excluded, but the fullest details refer to the bishopric of Merseburg and to the wars against the ": null
    },
    {
        "Wends": "wends"
    },
    {
        " and the ": null
    },
    {
        "Poles": "poles"
    },
    {
        ".               Otto III was a member of the ": null
    },
    {
        "Ottonian dynasty": "ottonian dynasty"
    },
    {
        " of kings and emperors who ruled the Holy Roman Empire from 42 to 42 In relation to the other members of his dynasty, Otto III was the great-grandson of Henry the Fowler, grandson of Otto I, son of Otto II, and a second-cousin to Henry II.     Otto III never married and never fathered any children due to his early death. At the time of his death, the Byzantine princess Zoe, second daughter of Emperor Constantine VIII was traveling to Italy to marry him.          ": null
    }
]