[
    {
        "Otto Pfleiderer was a ": null
    },
    {
        "German": "germany"
    },
    {
        " Protestant": "protestant"
    },
    {
        " theologian": "theology"
    },
    {
        ". Through his writings and his lectures, he became known as one of the most influential representatives of liberal theology.          Pfleiderer was born at ": null
    },
    {
        "Stetten im Remstal": "stetten im remstal"
    },
    {
        "  in ": null
    },
    {
        "Württemberg": "kingdom of württemberg"
    },
    {
        ". From 42 to 42 he studied at the ": null
    },
    {
        "University of Tübingen": "university of tübingen"
    },
    {
        " under ": null
    },
    {
        "Ferdinand Christian Baur": "ferdinand christian baur"
    },
    {
        ", and afterwards in England and ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". He then entered the ministry, became tutor  at Tübingen, and for a short time held a pastorate at ": null
    },
    {
        "Heilbronn": "heilbronn"
    },
    {
        " . In 42 he became chief pastor and superintendent at the ": null
    },
    {
        "University of Jena": "university of jena"
    },
    {
        " and soon afterwards professor ordinarius of theology, but in 42 he was called to the chair of ": null
    },
    {
        "systematic theology": "systematic theology"
    },
    {
        " at ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", having made his name by a series of articles on ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " criticism and Johannine and Pauline theology, which appeared in ": null
    },
    {
        "Adolf Hilgenfeld": "adolf hilgenfeld"
    },
    {
        "s Zeitschrift für wissenschaftliche Theologie, and by his Der Paulinismus, published in 42 Das Urchristentum, seine Schriften und Lehren, in geschichtlichen Zusammenhang beschrieben was published in 42 and considerably enlarged for a second edition in 42     In 42 appeared The Development of Theology since Kant, and its Progress in Great Britain since 42, which was written for publication in England. A more elaborate work was his Religionsphilosophie auf geschichtlichen Grundlage . The Influence of the Apostle Paul on the Development of Christianity was the title of a course of ": null
    },
    {
        "Hibbert Lectures": "hibbert lectures"
    },
    {
        " given in ": null
    },
    {
        "London": "london"
    },
    {
        " in 42 In 42 he delivered the ": null
    },
    {
        "Gifford Lectures": "gifford lectures"
    },
    {
        " at ": null
    },
    {
        "Edinburgh": "edinburgh"
    },
    {
        ", the subject being The Philosophy and Development of Religion . His later publications included:   The Early Christian Conception of Christ  Die Entstehung des Christentums  Religion und Religionen  Die Entwicklung des Christentums .     He died at , near Berlin. In New Testament criticism, Pfleiderer belonged to the critical school, which grew out of the impulse given by F. C. Baur. However, like other modern German theologians, he showed a greater disposition to compromise. All his work shows a judicial tone of mind, and is remarkable for the charm of its style.     Pfleiderers younger brother ": null
    },
    {
        "Edmund Pfleiderer": "edmund pfleiderer"
    },
    {
        " distinguished himself both in philosophy and theology.     & ndash; online text at the Internet Archive.   , delivered in London and Oxford in April and May, 42 & ndash; online text at the Internet Archive.   Paulinism; a contribution to the history of primitive Christian theology, 42 ,  & ndash; online text at the Internet Archive.   The Philosophy of Religion: On the Basis of Its History, ; ; ; ; ; ;  - online text at the Internet Archive.   , 42 & ndash; online text at the Internet Archive.   , 42 & ndash; online text at the Internet Archive.   , 42 & ndash; online text at the Internet Archive.   , 42 & ndash; online text at the Internet Archive.       ": null
    }
]