[
    {
        "      :The following outline is provided as an overview of and topical guide to law:   Law  is the set of rules and principles by which a society is governed, through enforcement by governmental authorities. Law is also the field which concerns the creation and administration of laws, and includes any and all legal systems .           Law can be described as all of the following:     Academic discipline & ndash; body of knowledge given to - or received by - a disciple ; a branch or sphere of knowledge, or field of study, that an individual has chosen to specialise in.   one of the humanities & ndash; academic discipline that study the human condition, using methods that are primarily analytical, critical, or speculative, as distinguished from the mainly empirical approaches of the natural sciences.   System & ndash; set of elements and relationships which are different from relationships of the set or its elements to other elements or sets.   part of the legal system & ndash; legal scholarship and practice shapes how law is interpreted and applied in societies       List of national legal systems   Common law   Civil law   Religious law   Baháí laws   Biblical law , in Judaism and Christianity   Canon law , in Christianity   Canons of the Apostles   Canon law of the Anglican Communion   Canon law of the Catholic Church   Canon - a certain rule or norm of conduct or belief prescribed by the Catholic Church. The word canon comes from the Greek kanon, which in its original usage denoted a straight rod that was later the instrument used by architects and artificers as a measuring stick for making straight lines.   Custom - the repeated and constant performance of certain acts for a defined period of time, which, with the approval of the competent legislator, thereby acquire the force of law. A custom is an unwritten law introduced by the continuous acts of the faithful with the consent of the legitimate legislator.   Decree - an order or law made by a superior authority for the direction of others.   Dispensation - the exemption from the immediate obligation of law in certain cases. Its object is to modify the hardship often arising from the rigorous application of general laws to particular cases, and its essence is to preserve the law by suspending its operation in such cases.   Interpretation - canonists provide and obey rules for the interpretation and acceptation of words, in order that legislation is correctly understood and the extent of its obligation is determined.   Obrogation - the enacting of a contrary law that is a revocation of a previous law. It may also be the partial cancellation or amendment of a law, decree, or legal regulation by the imposition of a newer one.   Promulgation - the publication of a law by which it is made known publicly, and is required by canon law for the law to obtain legal effect.   Halakha , in Judaism   Hindu law   Jain law   Patimokkha , in Theravada Buddhism   Sharia , in Islam       Sources of law   Canon   Custom   Custom   Precedent of past judicial decisions    Statutory law   Statute   Black letter law   Constitutional law   Constitution   Constitutional court   Sources of international law   Customary international law   Treaty   Juristic writings           Public law   Constitutional law   Tax law       Administrative law   Code of Federal Regulations       Criminal law   Criminal procedure       Substantive law   Procedural law       Person       Civil law   Civil procedure   Civil rights   Common law   Environmental law   Family law       International law   Public international law   Conflict of laws   Dualism   Legal pluralism   Supranational law   Law of the European Union   Treaties of the European Union   Regulation   Directive   European Union decision   European Union legislative procedure   Municipal law   Federal law   State law   Local ordinance         History of law   Cuneiform law   Babylonian law   Ancient Greek law   Roman law   Early Germanic law   Legal history of the Catholic Church   ": null
    },
    {
        "Jus antiquum": "jus antiquum"
    },
    {
        "       Ignorantia juris non excusat": "ignorantia juris non excusat"
    },
    {
        "   Presumption of innocence   Presumption   Treason   Rights   Rule of law           Aquinas, St. Thomas    Benedict XIV, Pope   Gratian   Hostiensis   Gregory IX, Pope    Gasparri, Pietro   John Paul II, Pope St.   Penyafort, Raymond of    ": null
    },
    {
        "Photios I of Constantinople": "photios i of constantinople"
    },
    {
        "        Napoleon": "napoleon"
    },
    {
        " Justinian": "justinian"
    },
    {
        " Blackstone, Sir William": "william blackstone"
    },
    {
        " Holmes, Oliver Wendell, Jr.": "oliver wendell holmes, jr."
    },
    {
        " Hammurabi": "hammurabi"
    },
    {
        " Moses": "moses"
    },
    {
        " Sources of law ": null
    },
    {
        "Lists of legislation": "lists of legislation"
    },
    {
        " Lists of case law": "lists of case law"
    },
    {
        " List of treaties": "list of treaties"
    },
    {
        "     Legislatures ": null
    },
    {
        "List of legislatures by country": "list of legislatures by country"
    },
    {
        "     Courts ": null
    },
    {
        "List of constitutional courts": "list of constitutional courts"
    },
    {
        " List of special tribunals and courts": "list of special tribunals and courts"
    },
    {
        " List of courts in England and Wales": "list of courts in england and wales"
    },
    {
        " List of High Courts of India": "list of high courts of india"
    },
    {
        "     Prisons ": null
    },
    {
        "List of prisons": "list of prisons"
    },
    {
        " List of United Kingdom prisons": "list of united kingdom prisons"
    },
    {
        " List of U.S. federal prisons": "list of u.s. federal prisons"
    },
    {
        " List of U.S. state prisons": "list of u.s. state prisons"
    },
    {
        " List of U.S. military prisons": "list of u.s. military prisons"
    },
    {
        "     ;Other   ": null
    },
    {
        "List of business law topics": "list of business law topics"
    },
    {
        " Outline of criminal justice": "outline of criminal justice"
    },
    {
        " List of topics in logic": "list of topics in logic"
    },
    {
        " List of international public law topics": "list of international public law topics"
    },
    {
        " List of international trade topics": "list of international trade topics"
    },
    {
        " Arms control": "arms control"
    },
    {
        " treaties and conventions   ": null
    },
    {
        "List of copyright case law": "list of copyright case law"
    },
    {
        " Environmental agreements": "environmental agreements"
    },
    {
        " List of environmental law journals": "list of environmental journalsenvironmental and energy law"
    },
    {
        " Historical lists of Privy Counsellors": "historical lists of privy counsellors"
    },
    {
        " List of current members of the British Privy Council": "list of current members of the british privy council"
    },
    {
        " List of current members of the Queens Privy Council for Canada": "list of current members of the queens privy council for canada"
    },
    {
        " List of Judicial Committee of the Privy Council cases": "list of judicial committee of the privy council cases"
    },
    {
        " List of legal abbreviations": "list of legal abbreviations"
    },
    {
        " List of Ayatollahs": "list of ayatollahs"
    },
    {
        " List of individuals executed by the federal government of the United States": "list of individuals executed by the federal government of the united states"
    },
    {
        " List of international declarations": "list of international declarations"
    },
    {
        " List of law journals": "list of law journals"
    },
    {
        " List of jurists": "list of jurists"
    },
    {
        " List of Judges of the High Court of Australia": "list of judges of the high court of australia"
    },
    {
        " List of Chief Justices of the Supreme Court of Canada": "list of chief justices of the supreme court of canada"
    },
    {
        " List of Justices of the Supreme Court of the United States": "list of justices of the supreme court of the united states"
    },
    {
        " List of Justices of the Supreme Court of the United States by court composition": "list of justices of the supreme court of the united states by court composition"
    },
    {
        " List of Justices of the Supreme Court of the United States by seat": "list of justices of the supreme court of the united states by seat"
    },
    {
        " List of Latin phrases": "list of latin phrases"
    },
    {
        " List of Latin legal terms": "list of latin legal terms"
    },
    {
        " List of 100 largest law firms globally": "list of 100 largest law firms globally"
    },
    {
        " Lists of law schools": "lists of law schools"
    },
    {
        " List of members of the Privy Council of Northern Ireland": "list of members of the privy council of northern ireland"
    },
    {
        " List of members of the Queens Privy Council for Canada": "list of members of the queens privy council for canada"
    },
    {
        " List of national legal systems": "list of national legal systems"
    },
    {
        " List of protective service agencies": "list of protective service agencies"
    },
    {
        " List of United Kingdom House of Lords cases": "list of united kingdom house of lords cases"
    },
    {
        " List of notable United Kingdom House of Lords cases": "list of notable united kingdom house of lords cases"
    },
    {
        " List of Lords of Appeal in Ordinary": "list of lords of appeal in ordinary"
    },
    {
        " List of real estate topics": "list of real estate topics"
    },
    {
        " List of riots": "list of riots"
    },
    {
        " List of Senators of the College of Justice": "list of senators of the college of justice"
    },
    {
        " List of software patents": "list of software patents"
    },
    {
        " List of Supreme Court of Canada cases": "list of supreme court of canada cases"
    },
    {
        " List of top United States patent recipients": "list of top united states patent recipients"
    },
    {
        " List of Uniform Acts ": "list of uniform acts"
    },
    {
        " List of United States federal legislation": "list of united states federal legislation"
    },
    {
        " List of United States Supreme Court cases": "list of united states supreme court cases"
    },
    {
        "          in ": null
    },
    {
        "JurisPedia": "jurispedia"
    },
    {
        "                            ": null
    }
]