[
    {
        "PackBits is a fast, simple ": null
    },
    {
        "lossless compression": "lossless data compression"
    },
    {
        " scheme for ": null
    },
    {
        "run-length encoding": "run-length encoding"
    },
    {
        " of data.     ": null
    },
    {
        "Apple": "apple inc."
    },
    {
        " introduced the PackBits format with the release of ": null
    },
    {
        "MacPaint": "macpaint"
    },
    {
        " on the ": null
    },
    {
        "Macintosh": "apple macintosh"
    },
    {
        " computer. This compression scheme is one of the types of compression that can be used in ": null
    },
    {
        "TIFF": "tiff"
    },
    {
        "-files. ": null
    },
    {
        "TGA": "truevision tga"
    },
    {
        "-files also use this RLE compression scheme, but treats data stream as pixels instead of bytes.     A PackBits data stream consists of packets with a one-byte header followed by data. The header is a signed byte; the data can be signed, unsigned, or packed .     In the following table, n is the value of the header byte as a signed integer.        Note that interpreting 42 as positive or negative makes no difference in the output. Runs of two bytes adjacent to non-runs are typically written as literal data. There is no way based on the PackBits data to determine the end of the data stream; that is to say, one must already know the size of the compressed or uncompressed data before reading a PackBits data stream to know where it ends.     Apple Computer provides this short example of packed data:   FE AA 42 42 42 42A FD AA 42 42 42 42A 42 F42 AA     The following code, written in Microsoft VBA, unpacks the data:     Sub UnpackBitsDemo   Dim File As Variant   Dim MyOutput As String   Dim Count As Long   Dim i As Long, j As Long     File FE AA 42 42 42 42A FD AA 42 42 42 42A 42 F42 AA   File Split     For i LBound To UBound   Count Application.WorksheetFunction.Hex42Dec   Select Case Count   Case Is /source source lang js   function i  ": null
    }
]