[
    {
        "Paint Your Wagon is a ": null
    },
    {
        "Broadway": "Broadway Theatre"
    },
    {
        " musical comedy": "Musical Theater"
    },
    {
        ", with book and lyrics by ": null
    },
    {
        "Alan J. Lerner": "Alan Jay Lerner"
    },
    {
        " and music by ": null
    },
    {
        "Frederick Loewe": "Frederick Loewe"
    },
    {
        ". The story centers on a miner and his daughter and follows the lives and loves of the people in a mining camp in ": null
    },
    {
        "Gold Rush": "California Gold Rush"
    },
    {
        "-era ": null
    },
    {
        "California": "California"
    },
    {
        ". Popular songs from the show included ": null
    },
    {
        "Wandrin Star": "Wandrin Star"
    },
    {
        " , I Talk to the Trees and ": null
    },
    {
        "They Call the Wind Maria": "They Call The Wind Maria"
    },
    {
        " .     The musical ran on ": null
    },
    {
        "Broadway": "Broadway Theatre"
    },
    {
        " in 1951 and in the ": null
    },
    {
        "West End": "West End Theatre"
    },
    {
        " in 1953. In 1969 the film version also titled  Paint Your Wagon  was released. It had a highly revised plot and some new songs composed by Lerner and ": null
    },
    {
        "André Previn": "André Previn"
    },
    {
        ".       ;Act I   In the California Wilderness in May 1853, a crusty old miner, Ben Rumson, is conducting a makeshift funeral for a friend. Meanwhile, his 16-year-old daughter Jennifer discovers gold dust. Ben claims the land, and prospectors start flocking to the brand new town of Rumson . Two months later Rumson has a population of 400, all of whom are men except for Jennifer. Prospector Jake Whippany is waiting to save enough money to send for Cherry and her Fandango girls , while Jennifer senses the tension building in town . Julio Valveras, a handsome young miner forced to live and work outside of town because he is Mexican, comes to town with dirty laundry and runs into Jennifer, who volunteers to do his laundry. They also talk to each other . Steve Bulmarck and the other men ponder the lonely nomadic life they lead in the song They Call the Wind Maria .     Two months later the men want Ben to send Jennifer away, and he wishes her mother was still alive to help him . Jennifer is in love with Julio , and when Ben sees Jennifer dancing with Julios clothes, he decides to send her East on the next stage. Jacob Woodling, a ": null
    },
    {
        "Mormon": "Mormon"
    },
    {
        " man with two wives, Sarah and Elizabeth, arrives in Rumson where the men demand Jacob sell one of his wives. To his surprise, Ben finds himself wooing Elizabeth and wins her for $800 . Jennifer is disgusted by her fathers actions and runs away, telling Julio that she will be reunited with him in a years time . Cherry and her Fandango girls arrive . Julio learns his claim is running dry which means he has to move on to make a living and that he will not be there to greet Jennifer when she returns.     ;Act II   A year later in October, the miners celebrate the high times in Rumson now that the Fandango girls are around . Edgar Crocker, a miner who has saved his money, falls for Elizabeth and she responds, although Ben does not notice since he thinks Raymond Janney is in love with her . Another miner, Mike Mooney, tells Julio about a lake that has gold dust on the bottom and he considers looking for it . Jennifer returns in December, having learned civilized ways back East . Ben tells his daughter that he will soon be moving on since he was not meant to stay in one place for long . The next day as Cherry and the girls are packing to leave they tell her about Julio leaving to find the lake with a bottom of gold. Raymond Janney offers to buy Elizabeth from Ben for $3,000, but she runs off with Edgar Crocker.     Word comes of another strike 40 miles south of Rumson and the rest of the town packs up to leave except for Jennifer, who is waiting for Julio to return, and Ben, who suddenly realizes that Rumson is indeed his town. Late in April, Julio appears, a broken man. Ben welcomes him and Julio is amazed to see Jennifer is there. As they move toward each other, the wagons filled with people move on.             ;Act 1   Im On My Way - Steve Bullnack, Jake Whippany, Mike Mooney, Lee Zen, Sing Yuy, Sandy Twist, Edgar Crocker, Reuben Sloane and Miners   Rumson - Jake   Whats Goin On Here? - Jennifer Rumson   I Talk to the Trees - Julio Valveras and Jennifer   ": null
    },
    {
        "They Call the Wind Maria": "They Call The Wind Maria"
    },
    {
        " - Steve, Miners and Dancer   I Still See Elisa - Ben Rumson   How Can I Wait? - Jennifer   Trio - Elizabeth Woodling, Sarah Woodling and Jacob Woodling   Rumson - Jake   In Between - Ben   Whoop-Ti-Ay! - Ben, Elizabeth and Miners   How Can I Wait? - Jennifer and Julio        ;Act 2   Hand Me Down That Can OBeans - Jake and Miners   Rope Dance - Fandangos, Pete Billings and Singer   Can-can - Suzanne Duval, Rocky, Fandangos and Miners   Another Autumn - Julio Valveras, Dancer and Pete Billings   Movin - Miners   Im On My Way - Miners   All For Him - Jennifer   ": null
    },
    {
        "Wandrin Star": "Wandrin Star"
    },
    {
        " - Ben   I Talk to the Trees - Jennifer   Strike! - Steve, Jasper and Jake   Wandrin Star - Jake, Steve, Sandy and Miners          The musical opened on ": null
    },
    {
        "Broadway": "Broadway Theatre"
    },
    {
        " at the ": null
    },
    {
        "Shubert Theatre": "Shubert Theatre"
    },
    {
        " on November 12, 1951, and closed on July 19, 1952, after 289 performances. The production was directed by Daniel Mann, set design by ": null
    },
    {
        "Oliver Smith": "Oliver Smith"
    },
    {
        ", costume design by ": null
    },
    {
        "Motley": "Motley Theatre Design Group"
    },
    {
        ", lighting design by Peggy Clark, music for dances arranged by ": null
    },
    {
        "Trude Rittmann": "Trude Rittmann"
    },
    {
        ", with dances and musical ensembles by ": null
    },
    {
        "Agnes de Mille": "Agnes De Mille"
    },
    {
        " set to the orchestrations of ": null
    },
    {
        "Ted Royal": "Ted Royal"
    },
    {
        ". Green, Stanley. . The World of Musical Comedy, Da Capo Press, 1984, , pp.442–43     It starred ": null
    },
    {
        "James Barton": "James Barton"
    },
    {
        " , ": null
    },
    {
        "Olga San Juan": "Olga San Juan"
    },
    {
        " , ": null
    },
    {
        "Tony Bavaar": "Tony Bavaar"
    },
    {
        " , ": null
    },
    {
        "Gemze de Lappe": "Gemze De Lappe"
    },
    {
        " , ": null
    },
    {
        "James Mitchell": "James Mitchell"
    },
    {
        " , ": null
    },
    {
        "Kay Medford": "Kay Medford"
    },
    {
        " , and Marijane Maricle . ": null
    },
    {
        "Burl Ives": "Burl Ives"
    },
    {
        " and ": null
    },
    {
        "Eddie Dowling": "Eddie Dowling"
    },
    {
        " later took over the role of Ben Rumson. Cullen, Frank; Hackman, Florence; McNeilly, Donald.  Vaudeville, old and new, Psychology Press, 2007, , p.77 De Mille later restaged the dances as a stand-alone ballet, Gold Rush.   Time Magazine , October 26, 1953     The ": null
    },
    {
        "West End": "West End Theatre"
    },
    {
        " production opened on February 11, 1953 at ": null
    },
    {
        "Her Majestys Theatre": "Her Majestys Theatre"
    },
    {
        " and ran for 477 performances. . Guidetomusicaltheatre.com, accessed January 19, 2011 It starred real life father and daughter ": null
    },
    {
        "Bobby Howes": "Bobby Howes"
    },
    {
        " and ": null
    },
    {
        "Sally Ann Howes": "Sally Ann Howes"
    },
    {
        ". Green, Stanley.  Encyclopedia of the Musical Theatre, Da Capo Press, 1980, , p. 200 The Australian production opened on November 27, 1954 at ": null
    },
    {
        "Her Majestys Theatre": "Her Majestys Theatre, Melbourne"
    },
    {
        " in Melbourne, with ": null
    },
    {
        "Alec Kellaway": "Alec Kellaway"
    },
    {
        " as Ben.      A new production, with a revised libretto by ": null
    },
    {
        "David Rambo": "David Rambo"
    },
    {
        ", was premiered at the ": null
    },
    {
        "Brentwood Theatre": "Brentwood Theatre"
    },
    {
        ", produced by the ": null
    },
    {
        "Geffen Playhouse": "Geffen Playhouse"
    },
    {
        " in association with Christopher Allen, D. Constantine Conte, and Larry Spellman in Los Angeles, California, from November 23, 2004, to January 9, 2005. This new world premiere adaptation was directed by ": null
    },
    {
        "Gilbert Cates": "Gilbert Cates"
    },
    {
        " and choreographed by Kay Cole. Design team included musical director ": null
    },
    {
        "Steve Orich": "Steve Orich"
    },
    {
        ", who provided arrangements and orchestrations. The design team featured Daniel Ionazzi , David Kay Mickeleson and Phil Allen . The cast  included ": null
    },
    {
        "Thomas F. Wilson": "Thomas F. Wilson"
    },
    {
        " as Ben Rumson, ": null
    },
    {
        "Jessica Rush": "Jessica Rush"
    },
    {
        " as his daughter Jennifer and ": null
    },
    {
        "Sharon Lawrence": "Sharon Lawrence"
    },
    {
        " as Lily. One change from the original was They Call the Wind Maria staged as an ensemble number instead of a showcase solo.  Variety.com, December 2, 2004  backstage.com, December 8, 2004     A subsequent production was produced by the ": null
    },
    {
        "Pioneer Theatre Company": "Pioneer Theatre Company"
    },
    {
        " in ": null
    },
    {
        "Salt Lake City": "Salt Lake City"
    },
    {
        ", Utah and ran from September 28, 2007, through October 13, 2007. The director was Charles Morey and choreographer Patti DBeck, with a cast of nearly 30. . Playbill.com, September 28, 2007 Lincoln, Ivan M. Wagon is a cruisin after overhaul , Deseret Morning News , October 2, 2007     The musical was presented in an ": null
    },
    {
        "Encores!": "Encores!"
    },
    {
        " staged concert production at New York City Center in March 2015. The production was directed by Marc Bruni, and starred ": null
    },
    {
        "Keith Carradine": "Keith Carradine"
    },
    {
        " as Ben Rumson, ": null
    },
    {
        "Alexandra Socha": "Alexandra Socha"
    },
    {
        " as Jennifer and ": null
    },
    {
        "Justin Guarini": "Justin Guarini"
    },
    {
        " as Julio Valveras.   Isherwood, Charles.  The New York Times, March 20, 2015       In 2010, Steven Suskin wrote, The interwoven use of ballet that worked so well in the highlands was less effective on the prairies, and the subject matter was harsh and cold. In spite of the shows failure, Loewe displayed ... an uncanny ability to write scores indigenous to the time and locale of the characters and plots. Suskin, Steven.  Show Tunes: The Songs, Shows, and Careers of Broadways Major Composers , Oxford University Press US, 2000, , p. 224       ": null
    },
    {
        "Theatre World Award": "Theatre World Award"
    }
]