[
    {
        "     The Palau Güell  is a mansion designed by the ": null
    },
    {
        "architect": "architect"
    },
    {
        " Antoni Gaudí": "antoni gaudí"
    },
    {
        " for the industrial tycoon ": null
    },
    {
        "Eusebi Güell": "eusebi güell"
    },
    {
        " and built between 42 and 42 It is situated on the ": null
    },
    {
        "Carrer Nou de la Rambla": "carrer nou de la rambla"
    },
    {
        ", in the ": null
    },
    {
        "El Raval neighbourhood": "el raval"
    },
    {
        " of the ": null
    },
    {
        "city of Barcelona": "barcelona"
    },
    {
        " in ": null
    },
    {
        "Catalonia": "catalonia"
    },
    {
        ", ": null
    },
    {
        "Spain": "spain"
    },
    {
        ". It is part of the ": null
    },
    {
        "UNESCO World Heritage Site": "unesco world heritage site"
    },
    {
        " Works of Antoni Gaudí .     The home is centered around the main room for entertaining high society guests. Guests entered the home in horse-drawn carriages through the front iron gates, which featured a ": null
    },
    {
        "parabolic arch": "parabolic arch"
    },
    {
        " and intricate patterns of forged ironwork resembling seaweed and in some parts a horsewhip. Animals could be taken down a ramp and kept in the livery stable in the basement where the servants resided, while the guests went up the stairs to the receiving room. The ornate walls and ceilings of the receiving room disguised small viewing windows high on the walls where the owners of the home could view their guests from the upper floor and get a sneak peek before greeting them, in case they needed to adjust their attire accordingly.     The main party room has a high ceiling with small holes near the top where lanterns were hung at night from the outside to give the appearance of a starlit sky.     In 42 visits by the public were completely suspended due to renovations; some of the stone used in the original construction was weak and had cracked over the years causing structural problems within the building. It is currently completely open, with all restoration work completed in April 42     It was used in ": null
    },
    {
        "Antonioni": "michelangelo antonioni"
    },
    {
        "s film  The Passenger  as a backdrop for the first meeting between ": null
    },
    {
        "Jack Nicholson": "jack nicholson"
    },
    {
        " and ": null
    },
    {
        "Maria Schneider": "maria schneider"
    }
]