[
    {
        "   The Paleogene  is a ": null
    },
    {
        "geologic period and system": "Geologic Period"
    },
    {
        " that spans 43 million years from the end of the ": null
    },
    {
        "Cretaceous": "Cretaceous"
    },
    {
        " Period  million years ago  to the beginning of the ": null
    },
    {
        "Neogene": "Neogene"
    },
    {
        " Period  Mya. It is the beginning of the ": null
    },
    {
        "Cenozoic": "Cenozoic"
    },
    {
        " Era": "Era"
    },
    {
        " of the present ": null
    },
    {
        "Phanerozoic": "Phanerozoic"
    },
    {
        " Eon. The earlier term ": null
    },
    {
        "Tertiary": "Tertiary"
    },
    {
        " Period was used to define the span of time now covered by the Paleogene and subsequent Neogene periods; despite no longer being recognised as a formal ": null
    },
    {
        "stratigraphic term": "Stratigraphy"
    },
    {
        ", Tertiary is still widely found in earth science literature and remains in informal use.  The Paleogene is most notable for being the time during which ": null
    },
    {
        "mammals diversified": "Evolution Of Mammals"
    },
    {
        " from relatively small, simple forms into a large group of diverse ": null
    },
    {
        "animals": "Animal"
    },
    {
        "in the wake of the ": null
    },
    {
        "Cretaceous–Paleogene extinction event": "Cretaceous–Paleogene Extinction Event"
    },
    {
        " that ended the preceding ": null
    },
    {
        "Cretaceous": "Cretaceous"
    },
    {
        " Period. Robert W. Meredith, Jan E. Janecka, John Gatesy, Oliver A. Ryder, Colleen A. Fisher, Emma C. Teeling, Alisha Goodbla, Eduardo Eizirik, Taiz L. L. Simão, Tanja Stadler, Daniel L. Rabosky, Rodney L. Honeycutt, John J. Flynn, Colleen M. Ingram, Cynthia Steiner, Tiffani L. Williams, Terence J. Robinson, Angela Burk-Herrick, Michael Westerman, Nadia A. Ayoub, Mark S. Springer, William J. Murphy. 2011. Impacts of the Cretaceous Terrestrial Revolution and KPg extinction on mammal diversification. Science 334:521-524. The United States Geological Survey uses the abbreviation P E for the Paleogene,   but the more commonly used abbreviation is P G with the P E being used for Paleocene.     This period consists of the ": null
    },
    {
        "Paleocene": "Paleocene"
    },
    {
        ", ": null
    },
    {
        "Eocene": "Eocene"
    },
    {
        ", and ": null
    },
    {
        "Oligocene": "Oligocene"
    },
    {
        " epochs": "Epoch"
    },
    {
        ". The end of the Paleocene was marked by the ": null
    },
    {
        "Paleocene–Eocene Thermal Maximum": "Paleocene–Eocene Thermal Maximum"
    },
    {
        ", one of the most significant periods of global change during the Cenozoic, which upset oceanic and atmospheric circulation and led to the extinction of numerous deep-sea benthic ": null
    },
    {
        "foraminifera": "Foraminifera"
    },
    {
        " and on land, a major turnover in mammals. The term Paleogene System is applied to the rocks deposited during the Paleogene Period.       The global climate during the Paleogene departed from the hot and humid conditions of the late ": null
    },
    {
        "Mesozoic era": "Mesozoic Era"
    },
    {
        " and began a cooling and drying trend which, despite having been periodically disrupted by warm periods such as the ": null
    },
    {
        "Paleocene–Eocene Thermal Maximum": "Paleocene–Eocene Thermal Maximum"
    },
    {
        ",  persisted until the temperature began to rise again due to the end of the most recent ": null
    },
    {
        "glacial period": "Last Glacial Maximum"
    },
    {
        " of the current ice age. The trend was partly caused by the formation of the ": null
    },
    {
        "Antarctic Circumpolar Current": "Antarctic Circumpolar Current"
    },
    {
        ", which significantly lowered oceanic water temperatures. A 2018 published study estimated that during the early Palaeogene about 56-48 million years ago, annual air temperatures, over land and at mid-latitude, averaged about 23–29  °C , which is 5–10  °C higher than most previous estimates.   Or for comparison, it was 10 to 15  °C higher than current annual mean temperatures in these areas; the authors suggest that the current atmospheric carbon dioxide trajectory, if it continues, could establish these temperatures again.      During the Paleogene, the continents continued to ": null
    },
    {
        "drift": "Plate Tectonics"
    },
    {
        " closer to their current positions. ": null
    },
    {
        "India": "India"
    },
    {
        " was in the process of colliding with Asia, forming the ": null
    },
    {
        "Himalayas": "Himalayas"
    },
    {
        ". The ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        " continued to widen by a few centimeters each year. Africa was moving north to meet with Europe and form the ": null
    },
    {
        "Mediterranean Sea": "Mediterranean Sea"
    },
    {
        ", while South America was moving closer to North America . Inland seas retreated from ": null
    },
    {
        "North America": "North America"
    },
    {
        " early in the period. Australia had also separated from Antarctica and was drifting toward Southeast Asia.       ": null
    },
    {
        "Mammals": "Mammal"
    },
    {
        "began a rapid ": null
    },
    {
        "diversification": "Biodiversity"
    },
    {
        " during this period. After the Cretaceous–Paleogene extinction event, which saw the demise of the non-avian ": null
    },
    {
        "dinosaur": "Dinosaur"
    },
    {
        "s, mammals transformed from a few small and generalized forms that began to evolve into most of the modern varieties we see today. Some of these mammals would evolve into large forms that would dominate the land, while others would become capable of living in ": null
    },
    {
        "marine": "Ocean"
    },
    {
        ", specialized terrestrial, and airborne environments. Those that took to the oceans became modern ": null
    },
    {
        "cetacean": "Cetacean"
    },
    {
        "s, while those that took to the trees became ": null
    },
    {
        "primate": "Primate"
    },
    {
        "s, the group to which humans belong. ": null
    },
    {
        "Birds": "Birds"
    },
    {
        ", which were already well established by the end of the ": null
    },
    {
        "Cretaceous": "Cretaceous"
    },
    {
        ", also experienced an adaptive radiation as they took over the skies left empty by the now extinct ": null
    },
    {
        "pterosaur": "Pterosaur"
    },
    {
        "s.     Pronounced cooling in the ": null
    },
    {
        "Oligocene": "Oligocene"
    },
    {
        " led to a massive floral shift and many extant modern plants arose during this time. ": null
    },
    {
        "Grasses": "Poaceae"
    },
    {
        " and herbs such as  Artemisia  began to appear at the expense of tropical plants, which began to decline. ": null
    },
    {
        "Conifer": "Pinophyta"
    },
    {
        " forests developed in mountainous areas. This cooling trend continued, with major fluctuation, until the end of the ": null
    },
    {
        "Pleistocene": "Pleistocene"
    },
    {
        ".  This evidence for this floral shift is found in the ": null
    },
    {
        "palynological": "Palynology"
    },
    {
        " record.           The Paleogene is notable in the context of ": null
    },
    {
        "offshore oil drilling": "Offshore Oil Drilling"
    },
    {
        ", and especially in ": null
    },
    {
        "Gulf of Mexico": "Gulf Of Mexico"
    },
    {
        " oil exploration, where it is commonly referred to as the Lower ": null
    },
    {
        "Tertiary": "Tertiary"
    },
    {
        " . These rock formations represent the current cutting edge of deep-water oil discovery.     Lower Tertiary rock formations encountered in the Gulf of Mexico oil industry usually tend to be comparatively high temperature and high pressure reservoirs, often with high sand content or under very thick ": null
    },
    {
        "evaporite": "Evaporite"
    },
    {
        " sediment layers.      Lower Tertiary explorations include :   ": null
    },
    {
        "Kaskida Oil Field": "Kaskida Oil Field"
    },
    {
        " Tiber Oil Field": "Tiber Oil Field"
    },
    {
        " Jack 2": "Jack 2"
    }
]