[
    {
        "        The Palestinian Academic Society for the Study of International Affairs  was founded in ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        " in March 42 by Dr. ": null
    },
    {
        "Mahdi Abdul Hadi": "mahdi abdul hadi"
    },
    {
        " and a group of ": null
    },
    {
        "Palestinian": "palestinian people"
    },
    {
        " academics and intellectuals. PASSIA is not affiliated with any government, political party organization, and maintains a completely independent financial and legal independent status.     PASSIA deals with the various national, ": null
    },
    {
        "Arab": "arab"
    },
    {
        " and international aspects of the ": null
    },
    {
        "Palestinian": "palestinian arabs"
    },
    {
        " Question through its academic Research Studies Program, dialogue and publication.     A major component of PASSIA’s activities is its Roundtable Meetings Program, and with over 42 publications to its credit, many of which include the minutes of these meetings, PASSIA has proved most successful at promoting understanding of international relations as they affect the Palestinian struggle for justice and peace. As part of its Religious Studies Unit PASSIA also holds regular meetings with religious leaders in an effort to foster scholarly understanding.     Considered to be of equal importance by those familiar with PASSIA’s activities is its Seminar Program, which provides a much-needed venue for Palestinian graduates to benefit from the experience and knowledge of local and foreign experts of the highest caliber. PASSIA’s educational and training seminars are divided into two categories: International Affairs – including seminars on Diplomacy and Conflict Resolution, Strategic Studies and Security, the EU, Education on Democracy, The Foreign Policies of Arab States, Japan and the Middle East, and The United States and Canada: Political Systems, Policy-Making and the Middle East – and Civil Society Empowerment, with seminars held to date including those on Policy-Making, Strategic Planning & Media & Communication Skills.     Jerusalem has been and will continue to be the core of the Palestine Question. It is also the focus of the majority of PASSIA’s activities due, in part, to its centrality to the Palestinian-Israeli struggle and the now inevitable establishment of a Palestinian state. PASSIA hosts regular workshops that address different but inter-connected issues pertaining to Jerusalem, such as freedom of access, Israeli settlements, and the various religious, political, cultural, historical, and civil aspects of life in the city, in addition to municipal arrangements for Jerusalem as the capital of two independent states. In these meetings, as during all other events held at PASSIA, it is the desire to promote communication, cooperation and coordination between those with an interest in the fate of this region that overrides any other consideration, and which inevitably results in a dialogue that is as stimulating as it is productive.         PASSIA seeks to present the Palestine Question in its national, Arab and international contexts through academic research, dialogue, education, documentation and publication. PASSIA works to achieve its goals through the implementation of the following regular programs: Research, Dialogue, Training and Education in International Affairs, Civil Society Empowerment, Religious Studies, the Question of Jerusalem, and the annual PASSIA Diary.     From the beginning, PASSIA has dedicated a large part of its various program and project activities to the provision of background information, in-depth studies and documentation on issues of concern, as well as the promotion of a better understanding of the Palestinian cause. PASSIA publications aim to be specialized, scientific and objective, yet they often address controversial or neglected issues and allow the expression of a wide range of perspectives. The authors of PASSIA pub lica tions throughout the years have been as diverse as the subjects cov ered and include Palestinian, Arab, Israeli and inter national academics, scholars and experts.     Now in its 42th year, PASSIA is proud to be able to say that its publications have become a sought-after reference source for academics, diplomats, professionals, libraries and anyone with an interest in Palestine, the field of international affairs, and developments in the Middle East.     PASSIA publications are classified as follows:   Research Studies: Studies – in English or Arabic - conducted by researchers commissioned by PASSIA on a huge diversity of subjects relevant to the Palestine Question.   Jerusalem Studies: Research studies and shorter papers on the various aspects of the Question of Jerusalem, dealing with issues such as Israeli settlements, land use, the Old City, religion, Israeli municipal policies, and future scenarios for the status of the city.   Religious Studies: Research studies and shorter papers on religious and interfaith issues pertaining to the Palestinian context.   Information Papers: Monograph-length studies, essays and briefings, covering many contempo rary and historical issues pertaining to the Palestine Question.   Documentation: Documentary records such as chronologies, historical and contemporary documents, maps and bios of personalities.   Bulletins: Easy-to-read publications focusing on specific topics with the aim to make available background information, analyses, and facts and figures in a concise but comprehensive manner.   Translations: Translation into Arabic and/or English of other foreign-language works of relevance to Palestine and the Palestinians.   Meetings and Seminar Proceedings: Occasional compilations containing full length or summarized versions of lectures and presentations given at PASSIA during a certain period or as part of a special project. Subcategories include Dialogue Program ; Training and Education in International Affairs , Civil Society Empowerment Through Training and Skills Development   PASSIA Diaries and Annual Reports: Every year since 42 PASSIA publishes its “Diary”, a unique annual resource book combining a comprehensive directory of contact information for Palestinian and international institutions operating in Palestine, a day-to-day calendar, and an agenda containing facts and figures, graphs, statistics, chronologies and maps related to Palestine and the Palestinians. PASSIA’s Annual Reports contain information on PASSIA projects, ongoing activities and research, as well as other work undertaken by or involving PASSIA each year. Also listed are brief descriptions of PASSIA publications, staff and funding sources.   Posters: Three 42–42  cm posters which PASSIA has designed and published as part of a special project on Jerusalem .                        ": null
    }
]