[
    {
        "   Pan and scan is a method of adjusting ": null
    },
    {
        "widescreen": "widescreen"
    },
    {
        " film images so that they can be shown in ": null
    },
    {
        "fullscreen": "fullscreen"
    },
    {
        " proportions of a ": null
    },
    {
        "standard definition": "standard definition"
    },
    {
        " 4:3 ": null
    },
    {
        "aspect ratio": "aspect ratio"
    },
    {
        " television": "television"
    },
    {
        " screen, often cropping off the sides of the original widescreen image to focus on the compositions most important aspects.     Some film directors and enthusiasts disapprove of pan and scan cropping, because it can remove up to 45% of the original image on 2.35:1 films or up to 53% on earlier 2.55:1 presentations, changing the director or cinematographers original vision and intentions. The most extreme examples remove up to 75% of the original picture on such aspect ratios as 2.76:1 in epics such as  Ben-Hur  and  Its a Mad, Mad, Mad, Mad World .  Lawrence of Arabia  is an exception to the 75% rule, because its aspect ratio is 2.20:1.     The vertical equivalent is known as tilt and scan or reverse pan and scan . The method was most common in the days of ": null
    },
    {
        "VHS": "vhs"
    },
    {
        ", before widescreen home media such as ": null
    },
    {
        "Laserdisc": "laserdisc"
    },
    {
        ", ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " and ": null
    },
    {
        "Blu-ray": "blu-ray disc"
    },
    {
        ".     Center cut is similar with the difference as the name suggests that it is simply a direct cut of the material from the center of the image with no horizontal panning or vertical tilting involved. This method doesnt require the permission or availability of the film maker or director to identify the most important part of each frame. Most video displays have three options for 16:9 widescreen frame formatting, which are either center cut, letterbox or full frame. The first two options are reliant on the video streams aspect ratio flag being set correctly.       For the first several decades of television broadcasting, sets displayed images with a 4:3 ": null
    },
    {
        "aspect ratio": "aspect ratio"
    },
    {
        " in which the width is 1.33 times the height—similar to most theatrical films prior to 1960. This was fine for pre-1953 films such as  The Wizard of Oz  or  Casablanca . Meanwhile, in order to compete with television and lure audiences away from their sets, producers of theatrical motion pictures began to use widescreen formats such as ": null
    },
    {
        "CinemaScope": "cinemascope"
    },
    {
        " and ": null
    },
    {
        "Todd-AO": "todd-ao"
    },
    {
        " in the early to mid-1950s, which enable more panoramic vistas and present other compositional opportunities. Films with these formats might be twice as wide as a TV screen when televised. To present a widescreen movie on such a television requires one of two techniques to accommodate this difference: One is ": null
    },
    {
        "letterbox": "letterbox"
    },
    {
        "ing , which preserves the original theatrical aspect ratio, but is not as tall as a standard television screen, leaving black bars at the top and bottom of the screen; the other technique is to pan and scan , filling the full height of the screen, but cropping it horizontally. Pan and scan cuts out as much as half of the image.     In the 1990s , when so-called ": null
    },
    {
        " Sixteen-By-Nine or Widescreen ": "16:9history"
    },
    {
        " televisions offered a wider 16:9 aspect ratio , they allowed films made at 1.66:1 and 1.85:1 to fill most or all of the screen, with only small letterboxing or cropping required. DVD packaging began to use the expression, 16:9  – Enhanced for Widescreen TVs.     However, films shot at aspect ratios of 2.20:1, 2.35:1, 2.39:1, 2.55:1, and especially 2.76:1  might still be problematic when displayed on televisions of any type. But when the DVD is anamorphically enhanced for widescreen , or the film is telecast on a high-definition channel seen on a widescreen TV, the black spaces are smaller, and the effect is still much like watching a film on a theatrical wide screen. Though 16:9 remain standard as of 2018, wider-screen consumer TVs in 21:9 have been released to the market by multiple brands.            During the pan and scan process, an editor selects the parts of the original filmed composition that seem to be the focus of the shot and makes sure that these are copied . When the important action shifts to a new position in the frame, the operator moves the scanner to follow it, creating the effect of a pan shot. In a scene in which the focus does not gradually shift from one horizontal position to another—such as actors at each extreme engaging in rapid conversation with each other—the editor may choose to cut from one to the other rather than rapidly panning back and forth. If the actors are closer together on the screen, the editor may pan slightly, alternately cropping one or the other partially. This method allows the maximum resolution of the image, since it uses all the available vertical video scan lines—which is especially important for ": null
    },
    {
        "NTSC": "ntsc"
    },
    {
        " televisions, having a rather low number of lines available. It also gives a full-screen image on a traditional television set; hence pan-and-scan versions of films on videotape or DVD are often known as  fullscreen .     However, it also has several drawbacks. Some visual information is necessarily cropped out. It can also change a shot in which the camera was originally stationary to one in which it is frequently panning, or change a single continuous shot into one with frequent cuts. In a shot which was originally panned to show something new, or one in which something enters the shot from off-camera, it changes the timing of these appearances to the audience. As an example, in the film  Oliver! , made in ": null
    },
    {
        "Panavision": "panavision"
    },
    {
        ", the criminal ": null
    },
    {
        "Bill Sikes": "bill sikes"
    },
    {
        " commits a murder. The murder takes place mostly offscreen, behind a staircase wall, and Oliver is a witness to it. As Sikes steps back from behind the wall, we see Oliver from the back watching him in terror. In the pan-and-scan version of the film, we see Olivers reaction as the murder is being committed, but not when Sikes steps backward from the wall having done it. Often in a pan and scan telecast, a character will seem to be speaking offscreen, when what has really happened is that the pan and scan technique has cut his image out of the screen.       As television screenings of feature films became more common and more financially important, cinematographers began to work for compositions that would keep the vital information within the TV safe area of the frame. For example, the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " suggested programme makers who were recording in 16:9 frame their shots in a ": null
    },
    {
        "14:9": "14:9"
    },
    {
        " aspect ratio which was then broadcast on analogue services with small black bars at the top and bottom of the picture, while owners of widescreen TV sets receiving digital broadcasts would see the full 16:9 picture .       One modern alternative to pan and scan is to directly adjust the source material. This is very rare: the only known uses are ": null
    },
    {
        "computer-generated": "computer-generated imagery"
    },
    {
        " features, such as those produced by ": null
    },
    {
        "Pixar": "pixar"
    },
    {
        " and video games such as  BioShock . They call their approach to full-screen versions reframing: some shots are pan and scan, while others are transferred ": null
    },
    {
        "open matte": "open matte"
    },
    {
        " . Another method is to keep the camera angle as tight as a pan shot, but move the location of characters, objects, or the camera, so that the subjects fit in the frame. The advent of DVDs and their use of ": null
    },
    {
        "anamorphic": "anamorphic widescreen"
    },
    {
        " presentation, coupled with the increasing popularity of widescreen televisions and computer monitors, have rendered pan and scan less important. Fullscreen versions of films originally produced in widescreen are still available in the United States.       Film makers may also create an original image that includes visual information that extends above and below the widescreen theatrical image; this is called ": null
    },
    {
        "open matte": "open matte"
    },
    {
        " . This may still be pan-and-scanned, but gives the compositor the freedom to zoom out or uncrop the image to include not only the full width of the wide-format image, but additional visual content at the top and/or bottom of the screen, not included in the widescreen version. As a general rule , special effects would be done within the theatrical aspect ratio, but not the full-frame thereof; also the expanded image area can include extraneous objects—such as cables, microphone booms, jet vapor trails, or overhead telephone wires—not intended to be included in the frame.      A more unusual use of the technique is present in the ": null
    },
    {
        "17 original": "list of dragon ball films"
    },
    {
        " Dragon Ball Z": "dragon ball z"
    },
    {
        " movies, released from 1986 to 1996. The films were displayed in 16:9 during their theatrical release, but this was in fact cut down from 4:3 animation- a choice made so that the VHS releases would be uncropped.        Changes in screen angle may be necessary to prevent closeups between two speakers where only one person is visible in the pan-and-scan version and both participants seem to speak alternately to persons off camera; this comes at the cost of losing the smoothness of scenes. Inversely, the cropping of a film originally shown in the standard ratio to fit widescreen televisions may cut off foreground or background, such as a ": null
    },
    {
        "tap-dance": "tap-dance"
    },
    {
        " scene in which much attention is directed appropriately at a dancers feet. This situation will commonly occur whenever a widescreen TV is set to display full images without stretching on images with an aspect ratio of 1.78:1 or less. The solution is to ": null
    },
    {
        "pillar box": "pillar box"
    },
    {
        " the image by adding black bars on either side of the image, which maintains the full picture height. In Europe, where the ": null
    },
    {
        "PAL": "pal"
    },
    {
        " TV format offers more resolution to begin with, pan-and-scan broadcasts and pan-and-scan DVDs of movies originally shown in widescreen are relatively rare, unless it is of programming broadcasts aimed for family viewing times like A Bugs Life. However, on some channels in some countries , films with an aspect ratio of more than 1.85:1 are panned and scanned to fit the broadcast 1.78:1 ratio.       Some directors still balk at the use of pan and scan because they feel it compromises the directorial vision with which their movies were created. For instance, ": null
    },
    {
        "Sydney Pollack": "sydney pollack"
    },
    {
        " brought a lawsuit against Danish TV after a screening of his 1975 film  Three Days of the Condor  in pan-and-scan in 1991 . ": null
    },
    {
        "Steven Spielberg": "steven spielberg"
    },
    {
        " initially refused to release a pan-and-scan version of  Raiders of the Lost Ark  but eventually gave in ; ": null
    },
    {
        "Woody Allen": "woody allen"
    },
    {
        " refused altogether to release one of  Manhattan , the letterbox version is therefore the only version available on VHS and DVD even though one VHS release includes the typical pan-and-scan disclaimer on the cover. Even the pan and scan versions of the widescreen animated shorts from the 1950s were also criticized, as several details, such as in ": null
    },
    {
        "Tom and Jerry": "tom and jerry"
    },
    {
        ". A scene show the babysitter grabbing the baby out of Toms hands near the end of  Tot Watchers  and the ant blowing his horn near the end of  Barbecue Brawl , are cropped out, which occasionally airs on TV channels, such as ": null
    },
    {
        "Cartoon Network": "cartoon network"
    },
    {
        " and ": null
    },
    {
        "Boomerang": "boomerang"
    }
]