[
    {
        "     A parabolic  reflector  is a ": null
    },
    {
        "reflective": "mirror"
    },
    {
        " surface used to collect or project ": null
    },
    {
        "energy": "energy"
    },
    {
        " such as ": null
    },
    {
        "light": "light"
    },
    {
        ", ": null
    },
    {
        "sound": "sound"
    },
    {
        ", or ": null
    },
    {
        "radio wave": "radio wave"
    },
    {
        "s. Its shape is part of a ": null
    },
    {
        "circular paraboloid": "circular paraboloid"
    },
    {
        ", that is, the surface generated by a ": null
    },
    {
        "parabola": "parabola"
    },
    {
        " revolving around its axis. The parabolic reflector transforms an incoming ": null
    },
    {
        "plane wave": "plane wave"
    },
    {
        " traveling along the axis into a ": null
    },
    {
        "spherical wave": "spherical wave"
    },
    {
        " converging toward the focus. Conversely, a spherical wave generated by a ": null
    },
    {
        "point source": "point source"
    },
    {
        " placed in the focus is reflected into a plane wave propagating as a collimated beam along the axis.     Parabolic reflectors are used to collect energy from a distant source . Since the principles of ": null
    },
    {
        "reflection": "specular reflection"
    },
    {
        " are reversible, parabolic reflectors can also be used to focus radiation from an isotropic source into a narrow beam. In ": null
    },
    {
        "optics": "optics"
    },
    {
        ", ": null
    },
    {
        "parabolic mirror": "parabolic mirror"
    },
    {
        "s are used to gather light in ": null
    },
    {
        "reflecting telescope": "reflecting telescope"
    },
    {
        "s and ": null
    },
    {
        "solar furnace": "solar furnace"
    },
    {
        "s, and project a beam of light in ": null
    },
    {
        "flashlight": "flashlight"
    },
    {
        "s, ": null
    },
    {
        "searchlight": "searchlight"
    },
    {
        "s, ": null
    },
    {
        "stage spotlights": "stage lighting instrumentspotlights"
    },
    {
        ", and ": null
    },
    {
        "car headlights": "headlight"
    },
    {
        ". In ": null
    },
    {
        "radio": "radio"
    },
    {
        " parabolic antenna": "parabolic antenna"
    },
    {
        "s are used to radiate a narrow beam of ": null
    },
    {
        "radio wave": "radio wave"
    },
    {
        "s for ": null
    },
    {
        "point-to-point": "point-to-point"
    },
    {
        " communications in ": null
    },
    {
        "satellite dish": "satellite dish"
    },
    {
        "es and ": null
    },
    {
        "microwave relay": "microwave radio relay"
    },
    {
        " stations, and to locate aircraft, ships, and vehicles in ": null
    },
    {
        "radar": "radar"
    },
    {
        " sets. In ": null
    },
    {
        "acoustics": "acoustics"
    },
    {
        ", ": null
    },
    {
        "parabolic microphone": "parabolic microphone"
    },
    {
        "s are used to record faraway sounds such as ": null
    },
    {
        "bird call": "bird call"
    },
    {
        "s, in sports reporting, and to eavesdrop on private conversations in ": null
    },
    {
        "espionage": "espionage"
    },
    {
        " and law enforcement.            Strictly, the three-dimensional shape of the reflector is called a  paraboloid . A parabola is the two-dimensional figure. However, in informal language, the word parabola and its associated adjective parabolic are often used in place of paraboloid and paraboloidal.     If a parabola is positioned in Cartesian coordinates with its vertex at the origin and its axis of symmetry along the y-axis, so the parabola opens upward, its equation is \\scriptstyle 42fyx^42 , where \\scriptstyle f is its focal length.  Correspondingly, the dimensions of a symmetrical paraboloidal dish are related by the equation: \\scriptstyle 42FD R^42 where \\scriptstyle F is the focal length, \\scriptstyle D is the depth of the dish , and \\scriptstyle R is the radius of the rim. All units must be the same. If two of these three quantities are known, this equation can be used to calculate the third.     A more complex calculation is needed to find the diameter of the dish measured along its surface. This is sometimes called the linear diameter , and equals the diameter of a flat, circular sheet of material, usually metal, which is the right size to be cut and bent to make the dish. Two intermediate results are useful in the calculation: \\scriptstyle P42F and \\scriptstyle Q\\sqrt , where \\scriptstyle F, \\scriptstyle D, and \\scriptstyle R are defined as above. The diameter of the dish, measured along the surface, is then given by: \\scriptstyle \\frac + P \\ln \\left , where \\scriptstyle \\ln means the ": null
    },
    {
        "natural logarithm": "natural logarithm"
    },
    {
        " of \\scriptstyle x , i.e. its logarithm to base ": null
    },
    {
        "e": "e"
    },
    {
        " .     The volume of the dish is given by \\scriptstyle \\frac \\pi R^42 D , where the symbols are defined as above. This can be compared with the formulae for the volumes of a ": null
    },
    {
        "cylinder": "cylinder"
    },
    {
        " \\scriptstyle , a ": null
    },
    {
        "hemisphere": "sphere"
    },
    {
        " \\scriptstyle , and a ": null
    },
    {
        "cone": "cone"
    },
    {
        " \\scriptstyle . \\scriptstyle \\pi R^42 is the aperture area of the dish, the area enclosed by the rim, which is proportional to the amount of sunlight the reflector dish can intercept. The area of the concave surface of the dish can be found using the area formula for a ": null
    },
    {
        "surface of revolution": "surface of revolutionarea formula"
    },
    {
        " which gives \\scriptstyle A\\frac\\left . providing \\scriptstyle D \\ne 42 . The fraction of light reflected by the dish, from a light source in the focus, is given by \\scriptstyle 42 - \\frac , where F, D, and R are defined as above.          The parabolic reflector functions due to the geometric properties of the paraboloidal shape: any incoming ": null
    },
    {
        "ray": "ray"
    },
    {
        " that is parallel to the axis of the dish will be reflected to a central point, or ": null
    },
    {
        "focus": "focus"
    },
    {
        " .  Because many types of energy can be reflected in this way, parabolic reflectors can be used to collect and concentrate energy entering the reflector at a particular angle. Similarly, energy radiating from the focus to the dish can be transmitted outward in a beam that is parallel to the axis of the dish.     In contrast with ": null
    },
    {
        "spherical reflector": "spherical reflector"
    },
    {
        "s, which suffer from a ": null
    },
    {
        "spherical aberration": "spherical aberration"
    },
    {
        " that becomes stronger as the ratio of the beam diameter to the focal distance becomes larger, parabolic reflectors can be made to accommodate beams of any width. However, if the incoming beam makes a non-zero angle with the axis , parabolic reflectors suffer from an ": null
    },
    {
        "aberration": "aberration in optical systems"
    },
    {
        " called ": null
    },
    {
        "coma": "coma"
    },
    {
        ". This is primarily of interest in telescopes because most other applications do not require sharp resolution off the axis of the parabola.     The precision to which a parabolic dish must be made in order to focus energy well depends on the wavelength of the energy. If the dish is wrong by a quarter of a wavelength, then the reflected energy will be wrong by a half wavelength, which means that it will interfere destructively with energy that has been reflected properly from another part of the dish. To prevent this, the dish must be made correctly to within about  of a wavelength. The wavelength range of visible light is between about 42 and 42 nanometres , so in order to focus all visible light well, a reflector must be correct to within about 42  nm. For comparison, the diameter of a human hair is usually about 42  nm, so the required accuracy for a reflector to focus visible light is about 42 times less than the diameter of a hair. For example, the flaw in the ": null
    },
    {
        "Hubble Space Telescope": "hubble space telescope"
    },
    {
        " mirror caused severe ": null
    },
    {
        "spherical aberration": "spherical aberration"
    },
    {
        " until corrected with ": null
    },
    {
        "COSTAR": "corrective optics space telescope axial replacement"
    },
    {
        ".      Microwaves, such as are used for satellite-TV signals, have wavelengths of the order of ten millimetres, so dishes to focus these waves can be wrong by half a millimetre or so and still perform well.            It is sometimes useful if the ": null
    },
    {
        "centre of mass": "centre of mass"
    },
    {
        " of a reflector dish coincides with its ": null
    },
    {
        "focus": "focus"
    },
    {
        ". This allows it to be easily turned so it can be aimed at a moving source of light, such as the Sun in the sky, while its focus, where the target is located, is stationary. The dish is rotated around ": null
    },
    {
        "axes": "wikt:axis"
    },
    {
        " that pass through the focus and around which it is balanced. If the dish is ": null
    },
    {
        "symmetrical": "symmetrical"
    },
    {
        " and made of uniform material of constant thickness, and if F represents the focal length of the paraboloid, this focus-balanced condition occurs if the depth of the dish, measured along the axis of the paraboloid from the vertex to the plane of the ": null
    },
    {
        "rim": "wikt:rim"
    },
    {
        " of the dish, is 42 times F. The radius of the rim is 42  F. The angular radius of the rim as seen from the focal point is 42 degrees.       The focus-balanced configuration requires the depth of the reflector dish to be greater than its focal length, so the focus is within the dish. This can lead to the focus being difficult to access. An alternative approach is exemplified by the Scheffler Reflector, named after its inventor, ": null
    },
    {
        "Wolfgang Scheffler": "wolfgang scheffler"
    },
    {
        ". This is a paraboloidal mirror which is rotated about axes that pass through its centre of mass, but this does not coincide with the focus, which is outside the dish. If the reflector were a rigid paraboloid, the focus would move as the dish turns. To avoid this, the reflector is flexible, and is bent as it rotates so as to keep the focus stationary. Ideally, the reflector would be exactly paraboloidal at all times. In practice, this cannot be achieved exactly, so the Scheffler reflector is not suitable for purposes that require high accuracy. It is used in applications such as ": null
    },
    {
        "solar cooking": "solar cookerparaboloidal reflectors"
    },
    {
        ", where sunlight has to be focused well enough to strike a cooking pot, but not to an exact point.        A circular paraboloid is theoretically unlimited in size. Any practical reflector uses just a segment of it. Often, the segment includes the ": null
    },
    {
        "vertex": "vertex"
    },
    {
        " of the paraboloid, where its ": null
    },
    {
        "curvature": "curvature"
    },
    {
        " is greatest, and where the ": null
    },
    {
        "axis of symmetry": "axis of symmetry"
    },
    {
        " intersects the paraboloid. However, if the reflector is used to focus incoming energy onto a receiver, the shadow of the receiver falls onto the vertex of the paraboloid, which is part of the reflector, so part of the reflector is wasted. This can be avoided by making the reflector from a segment of the paraboloid which is offset from the vertex and the axis of symmetry. For example, in the above diagram the reflector could be just the part of the paraboloid between the points P 42 and P 42 . The receiver is still placed at the focus of the paraboloid, but it does not cast a shadow onto the reflector. The whole reflector receives energy, which is then focused onto the receiver. This is frequently done, for example, in satellite-TV receiving dishes, and also in some types of astronomical telescope .     Accurate off-axis reflectors, for use in ": null
    },
    {
        "solar furnace": "solar furnace"
    },
    {
        "s and other non-critical applications, can be made quite simply by using a ": null
    },
    {
        "rotating furnace": "rotating furnace"
    },
    {
        ", in which the container of molten glass is offset from the axis of rotation. To make less accurate ones, suitable as satellite dishes, the shape is designed by a computer, then multiple dishes are stamped out of sheet metal.     Off-axis-reflectors heading from medium ": null
    },
    {
        "latitude": "latitude"
    },
    {
        "s to a ": null
    },
    {
        "geostationary TV satellite": "geostationary satellite"
    },
    {
        " classical antiquity": "classical antiquity"
    },
    {
        ", when the mathematician ": null
    },
    {
        "Diocles": "diocles"
    },
    {
        " described them in his book On Burning Mirrors and proved that they focus a parallel beam to a point. ": null
    },
    {
        "Archimedes": "archimedes"
    },
    {
        " in the third century BCE studied paraboloids as part of his study of ": null
    },
    {
        "hydrostatic equilibrium": "hydrostatic equilibrium"
    },
    {
        ", and it has been ": null
    },
    {
        "claimed": "archimedesdiscoveries and inventions"
    },
    {
        " that he used reflectors to set the Roman fleet alight during the ": null
    },
    {
        "Siege of Syracuse": "siege of syracuse"
    },
    {
        ". This seems unlikely to be true, however, as the claim does not appear in sources before the 42nd century CE, and Diocles does not mention it in his book. Parabolic mirrors were also studied by the ": null
    },
    {
        "physicist": "physicist"
    },
    {
        " Ibn Sahl": "ibn sahl"
    },
    {
        " in the 42th century. ": null
    },
    {
        "James Gregory": "james gregory"
    },
    {
        ", in his 42 book Optica Promota , pointed out that a ": null
    },
    {
        "reflecting telescope": "reflecting telescope"
    },
    {
        " with a mirror that was parabolic would correct ": null
    },
    {
        "spherical aberration": "spherical aberration"
    },
    {
        " as well as the ": null
    },
    {
        "chromatic aberration": "chromatic aberration"
    },
    {
        " seen in ": null
    },
    {
        "refracting telescope": "refracting telescope"
    },
    {
        "s. The design he came up with bears his name: the ": null
    },
    {
        "Gregorian telescope": "gregorian telescope"
    },
    {
        " ; but according to his own confession, Gregory had no practical skill and he could find no optician capable of actually constructing one. ": null
    },
    {
        "Isaac Newton": "isaac newton"
    },
    {
        " knew about the properties of parabolic mirrors but chose a spherical shape for his ": null
    },
    {
        "Newtonian telescope": "newtonian telescope"
    },
    {
        " mirror to simplify construction. ": null
    },
    {
        "Lighthouse": "lighthouse"
    },
    {
        "s also commonly used parabolic mirrors to collimate a point of light from a lantern into a beam, before being replaced by more efficient ": null
    },
    {
        "Fresnel lens": "fresnel lens"
    },
    {
        "es in the 42th century. In 42 ": null
    },
    {
        "Heinrich Hertz": "heinrich hertz"
    },
    {
        ", a German physicist, constructed the worlds first parabolic reflector antenna.                The most common modern applications of the parabolic reflector are in ": null
    },
    {
        "satellite dish": "satellite dish"
    },
    {
        "es, ": null
    },
    {
        "reflecting telescope": "reflecting telescope"
    },
    {
        "s, ": null
    },
    {
        "radio telescope": "radio telescope"
    },
    {
        "s, ": null
    },
    {
        "parabolic microphone": "parabolic microphone"
    },
    {
        "s, ": null
    },
    {
        "solar cooker": "solar cooker"
    },
    {
        "s, and many ": null
    },
    {
        "lighting": "electric light"
    },
    {
        " devices such as ": null
    },
    {
        "spotlights": "stage lighting instrumentspotlights"
    },
    {
        ", ": null
    },
    {
        "car headlights": "headlight"
    },
    {
        ", ": null
    },
    {
        "PAR lamps": "parabolic aluminized reflector light"
    },
    {
        " and LED housings.     The ": null
    },
    {
        "Olympic Flame": "olympic flame"
    },
    {
        " is traditionally lit at ": null
    },
    {
        "Olympia, Greece": "olympia, greece"
    },
    {
        ", using a parabolic reflector concentrating ": null
    },
    {
        "sunlight": "sunlight"
    },
    {
        ", and is then transported to the venue of the Games. Parabolic mirrors are one of many shapes for a ": null
    },
    {
        "burning-glass": "burning-glass"
    },
    {
        ".     Parabolic reflectors are popular for use in creating ": null
    },
    {
        "optical illusion": "optical illusion"
    },
    {
        "s. These consist of two opposing parabolic mirrors, with an opening in the center of the top mirror. When an object is placed on the bottom mirror, the mirrors create a ": null
    },
    {
        "real image": "real image"
    },
    {
        ", which is a virtually identical copy of the original that appears in the opening. The quality of the image is dependent upon the precision of the optics. Some such illusions are manufactured to tolerances of millionths of an inch.     A parabolic reflector pointing upward can be formed by rotating a reflective liquid, like mercury, around a vertical axis. This makes the ": null
    },
    {
        "liquid mirror telescope": "liquid mirror telescope"
    },
    {
        " possible. The same technique is used in ": null
    },
    {
        "rotating furnace": "rotating furnace"
    },
    {
        "s to make solid reflectors.     Parabolic reflectors are also a popular alternative for increasing wireless signal strength. Even with simple ones, users have reported 42 ": null
    },
    {
        "dB": "decibel"
    },
    {
        " or more gains.   ": null
    }
]