[
    {
        "        Paris is a city and ": null
    },
    {
        "county seat": "County Seat"
    },
    {
        " of ": null
    },
    {
        "Lamar County, Texas": "Lamar County, Texas"
    },
    {
        ", United States. As of the 2010 census, the population of the city was 25,171. It is situated in ": null
    },
    {
        "Northeast Texas": "Northeast Texas"
    },
    {
        " at the western edge of the ": null
    },
    {
        "Piney Woods": "Piney Woods"
    },
    {
        ", and  northeast of the ": null
    },
    {
        "Dallas–Fort Worth Metroplex": "Dallas–Fort Worth Metroplex"
    },
    {
        ". Physiographically, these regions are part of the West Gulf Coastal Plain.     Following a tradition of American cities named Paris , the city commissioned a  replica of the ": null
    },
    {
        "Eiffel Tower": "Eiffel Tower"
    },
    {
        " in 1993 and installed it on site of the Love Civic Center, southeast of the town square. In 1998, presumably as a response to the 1993 construction of a  tower in ": null
    },
    {
        "Paris, Tennessee": "Paris, Tennessee"
    },
    {
        ", the city placed a giant red cowboy hat atop its tower. The current Eiffel Tower replica is at least the second one; an earlier replica constructed of wood was later destroyed by a ": null
    },
    {
        "tornado": "Tornado"
    },
    {
        ".            Present-day Lamar County was part of ": null
    },
    {
        "Red River County": "Red River County, Texas"
    },
    {
        " during the ": null
    },
    {
        "Republic of Texas": "Republic Of Texas"
    },
    {
        ". By 1840, population growth necessitated the organization of a new county. George Washington Wright, who had served in the Third ": null
    },
    {
        "Congress of the Republic of Texas": "Congress Of The Republic Of Texas"
    },
    {
        " as a representative from Red River County, was a major proponent of the new county. The Fifth Congress established the new county on December 17, 1840, and named it after ": null
    },
    {
        "Mirabeau B. Lamar": "Mirabeau B. Lamar"
    },
    {
        ",  who was the first Vice President and the second President of the Republic of Texas.          Lamar County was one of the 18 Texas counties that voted against secession on February 23, 1861.      In 1877, 1896, and 1916, major fires in the city forced considerable rebuilding. The 1916 fire destroyed almost half the town and caused an estimated $11 million in property damage. The fire ruined most of the central business district and swept through a residential area. The burned structures included the Federal Building and Post Office, the Lamar County Courthouse and Jail, City Hall, most commercial buildings, and several churches.     In 1893, black teenager ": null
    },
    {
        "Henry Smith": "Henry Smith"
    },
    {
        " was accused of murder, tortured, and then burned to death on a scaffold in front of thousands of spectators in Paris.  In 1920, two black brothers from the Arthur family were tied to a flagpole and burned to death at the Paris fairgrounds. The city has prominent memorials to the ": null
    },
    {
        "Confederacy": "Confederate States Of America"
    },
    {
        ", but has no acknowledgement of these killings.     In 1943, the ": null
    },
    {
        "U.S. Supreme Court": "U.S. Supreme Court"
    },
    {
        " in  Largent v. Texas  struck down a Paris ordinance that prohibited a person from selling or distributing religious publications without first obtaining a city-issued permit. The Court ruled that the ordinance abridged freedom of religion, freedom of speech, and freedom of the press in violation of the ": null
    },
    {
        "Fourteenth Amendment": "Fourteenth Amendment To The United States Constitution"
    },
    {
        ".           Paris has long been a railroad center. The ": null
    },
    {
        "Texas and Pacific": "Texas And Pacific"
    },
    {
        " reached town in 1876; the ": null
    },
    {
        "Gulf, Colorado and Santa Fe Railway": "Gulf, Colorado And Santa Fe Railway"
    },
    {
        " and the Frisco in 1887; the Texas Midland Railroad  in 1894; and the Paris and Mount Pleasant in 1910. Paris Union Station, built 1912, served Frisco, Santa Fe, and Texas Midland passenger trains until 1956. Today, the station is used by the Lamar County Chamber of Commerce and serves as the research library for the Lamar County Genealogical Society.             The city is home to several late-19th to mid-20th century stately homes. Among these is the Rufus Fenner Scott Mansion, designed by German architect J.L. Wees and constructed in 1910. The structure is solid concrete and steel with four floors. Rufus Scott was a prominent businessman known for shipping, imports, and banking. He was well known by local farmers, who bought aging transport mules from him. The Scott Mansion narrowly survived the fire of 1916. After the fire, Scott brought the architect Wees back to Paris to redesign the historic downtown area.         Camp Maxey is maintained by a ": null
    },
    {
        "Texas Army National Guard": "Texas Army National Guard"
    },
    {
        " unit.       Paris was named the Best Small Town in Texas by Kevin Heubusch in his book The New Rating Guide to Life in Americas Small Cities .              Since 1869,  The Paris News  has served as the newspaper in the city of Paris. It circulates daily in the city and throughout Lamar County, as well as in neighboring ": null
    },
    {
        "Delta": "Delta County, Texas"
    },
    {
        ", ": null
    },
    {
        "Fannin": "Fannin County, Texas"
    },
    {
        ", and ": null
    },
    {
        "Red River": "Red River County"
    },
    {
        " Counties in Texas and ": null
    },
    {
        "Choctaw County, Oklahoma": "Choctaw County, Oklahoma"
    },
    {
        ".       Five radio stations are licensed in the city of Paris: ": null
    },
    {
        "KZHN": "Kzhn"
    },
    {
        ", ": null
    },
    {
        "KPLT ": "Kplt"
    },
    {
        ", ": null
    },
    {
        "KOYN": "Koyn"
    },
    {
        ", ": null
    },
    {
        "KBUS": "Kbus"
    },
    {
        ", ": null
    },
    {
        "KITX": "Kitx"
    },
    {
        ", and ": null
    },
    {
        "KPLT-FM": "Kplt-Fm"
    },
    {
        ".       Paris is served by ": null
    },
    {
        "KXII": "Kxii"
    },
    {
        "; the ": null
    },
    {
        "low-power": "Low-Power Broadcasting"
    },
    {
        " translator station": "Broadcast Relay Stationbroadcast Translator"
    },
    {
        " KXIP-LD is in Paris.             Paris is deeply segregated  and race relations in Paris have a bloody history  and are deeply polarized, turbulent,  and sometimes explosive.     In the late-19th and early-20th centuries, several ": null
    },
    {
        "lynchings": "Lynching In The United States"
    },
    {
        " were staged at the Paris Fairgrounds as public spectacles, with thousands of white spectators cheering as the victims were tortured and then immolated, dismembered, or otherwise murdered. Among the victims was ": null
    },
    {
        "Henry Smith": "Henry Smith"
    },
    {
        ", a teenager lynched in 1893.        About 115 years later, in 2008, an African-American man, ": null
    },
    {
        "Brandon McClelland": "Death Of Brandon Mcclelland"
    },
    {
        ", was run over and dragged to death under a vehicle. Two white men were arrested, but the prosecutor cited lack of evidence and declined to press charges, and no serious subsequent attempt to find other perpetrators was made. This caused unrest in the Paris African-American community.     Following this incident, an attempt by the ": null
    },
    {
        "United States Department of Justice": "United States Department Of Justice"
    },
    {
        " Justice Community Relations Service to initiate a dialog between the races in the town  ended in failure when African-American complaints were mostly met by silent glares.     A 2009 protest rally over the case led to ": null
    },
    {
        "Texas State Police": "Texas State Police"
    },
    {
        " intervention to prevent groups shouting white power! and black power! from coming to blows.         In 2007, a 14-year-old African-American girl was sentenced by a local judge to up to 7 years in a youth prison for shoving a hall monitor at Paris High School. Three months earlier, the same judge had sentenced a 14-year-old white girl to probation for arson. This sentencing disparity occasioned nationwide controversy  and the African-American girl was released after serving one year on orders of a special conservator appointed by the State of Texas to investigate problems with the states juvenile-justice practices.     In 2009, some African-American workers at the Turner Industries plant in the city claimed that hangmans nooses, Confederate flags, and racist graffiti were regular features of plant culture.  At the same time, the ": null
    },
    {
        "United States Department of Education": "United States Department Of Education"
    },
    {
        " was conducting an investigation into allegations that African-American students in Pariss schools are disciplined more harshly than white students for similar offenses.        In 2015, the United States ": null
    },
    {
        "Equal Employment Opportunity Commission": "Equal Employment Opportunity Commission"
    },
    {
        " ruled after an investigation that African-American workers at the ": null
    },
    {
        "Sara Lee Corporation": "Sara Lee Corporation"
    },
    {
        " plant in Paris  were deliberately disproportionately exposed to asbestos, black mold, and other toxins, and also were targets of racial slurs and racist graffiti.      Some Paris residents deny that the town has a race-relations problem.          Paris is located at  . According to the ": null
    },
    {
        "U.S. Census Bureau": "United States Census Bureau"
    },
    {
        ", the city has a total area of , of which  are land and  are covered by water.       Paris has a ": null
    },
    {
        "humid subtropical climate": "Humid Subtropical Climate"
    },
    {
        " . It is located in ": null
    },
    {
        "Tornado Alley": "Tornado Alley"
    },
    {
        " , an area largely centered in the middle of the United States in which tornadoes occur frequently because of weather patterns and geography. Paris is in ": null
    },
    {
        "USDA plant hardiness zone": "Usda Plant Hardiness Zone"
    },
    {
        " 8a for winter temperatures. This is cooler than its southern neighbor ": null
    },
    {
        "Dallas": "Dallas"
    },
    {
        ", and while similar to ": null
    },
    {
        "Atlanta, Georgia": "Atlanta, Georgia"
    },
    {
        ", it has warmer summertime temperatures. Summertime average highs reach  and  in July and August, with associated lows of  and . Winter temperatures drop to an average high of  and low of  in January. The highest temperature on record was , set in August 1936, and the record low was , set in 1930. Average precipitation is . Snow is not unusual, but is by no means predictable, and years can pass with no snowfall at all.     On April 2, 1982, Paris was hit by an ": null
    },
    {
        "F4": "Fujita Scaleparameters"
    },
    {
        " tornado": "Tornado"
    },
    {
        " that destroyed more than 1,500 homes, and left 10 people dead, 170 injured, and 3,000 homeless. The damage toll from this tornado was estimated at US$50 million in 1982.                As of the ": null
    },
    {
        "census": "2010 United States Census"
    },
    {
        " of 2010, 25,171 people, 10,306 households, and 6,426 families resided in the city. The population density was 588.1 people per square mile . The 11,883 housing units averaged 277.6 per square mile . The ": null
    },
    {
        "racial makeup": "Race"
    },
    {
        " of the city was 70.3% White, 24.8% African American, 3.1% Native American, 1.1% Asian, and 4.1% from other races. Hispanics or Latinos of any race were 8.2% of the population.     Of the 10,306 households, 27.6% had children under the age of 18 living with them, 37.8% were married couples living together, 19.6% had a female householder with no husband present, and 37.6% were not families. About 32.8% of all households were made up of individuals, and 15.2% had someone living alone who was 65 years of age or older. The average household size was 2.38 and the average family size was 3.01.     In the city, the population was distributed as 25.0% under the age of 18, 10.6% from 18 to 24, 24.1% from 25 to 44, 23.8% from 45 to 64, and 16.6% who were 65 years of age or older. The median age was 37.1 years. For every 100 females, there were 87.3 males. For every 100 females age 18 and over, there were 82.9 males.       In 2000, the median income for a household in the city was $27,438, and for a family was $34,916. Males had a median income of $29,378 versus $20,080 for females. The per capita income for the city was $17,137. About 16.5% of families and 20.6% of the population were below the poverty line, including 29.0% of those under age 18 and 15.9% of those age 65 or over.          In the past, Paris was a major cotton exchange, and the county was developed as cotton plantations. While cotton is still farmed on the lands around Paris, it is no longer a major part of the economy.     Paris one major hospital has two campuses: Paris Regional Medical Center South and Paris Regional Medical Center North . It serves as the center of healthcare for much of Northeast Texas and Southeast Oklahoma. Both campuses are now operated jointly under the name of the Paris Regional Medical Center, a division of Essent Healthcare. Paris Regional Medical Center South Campus has recently closed and only the North Campus remains open. The health network is one of the largest employers in the Paris area.      Outside of healthcare, the largest employers are ": null
    },
    {
        "Kimberly-Clark": "Kimberly-Clark"
    },
    {
        " and ": null
    },
    {
        "Campbells Soup": "Campbells Soup"
    },
    {
        ".             Note: PRMC is Paris Regional Medical Center.            Elementary and secondary education is split among three main ": null
    },
    {
        "school district": "School District"
    },
    {
        "s:   ": null
    },
    {
        "Paris Independent School District": "Paris Independent School District"
    },
    {
        " North Lamar Independent School District": "North Lamar Independent School District"
    },
    {
        " Chisum Independent School District": "Chisum Independent School District"
    },
    {
        "     Prairiland ISD": "Prairiland Isd"
    },
    {
        " also serves a small portion of the town, along with Blossom ISD and Roxton ISD.     In addition, ": null
    },
    {
        "Paris Junior College": "Paris Junior College"
    },
    {
        " provides postsecondary education. It hosts the Texas Institute of Jewelry Technology, a well-respected school of gemology, horology, and jewelry. The Industrial Technology Division offers programs in air conditioning technology, refrigeration technology, agricultural technology, drafting and computer-aided design, electronics, electromechanical technology, and welding technology.     ": null
    },
    {
        "Texas A & M University-Commerce": "Texas A & M University-Commerce"
    },
    {
        ", a major university of over 12,000 students, is located in the neighboring city of ": null
    },
    {
        "Commerce": "Commerce, Texas"
    },
    {
        ", 40 minutes southwest of Paris.     The Paris Public Library serves Paris, as does the Lamar County Genealogical Society Library.            It is governed by a ": null
    },
    {
        "city council": "City Council"
    },
    {
        " as specified in the citys charter adopted in 1948.       Paris is represented in the ": null
    },
    {
        "Texas Senate": "Texas Senate"
    },
    {
        " by Republican ": null
    },
    {
        "Kevin Eltife": "Kevin Eltife"
    },
    {
        ", District 1, and in the ": null
    },
    {
        "Texas House of Representatives": "Texas House Of Representatives"
    },
    {
        " by Republican ": null
    },
    {
        "Erwin Cain": "Erwin Cain"
    },
    {
        ", District 3.     The ": null
    },
    {
        "Texas Department of Criminal Justice": "Texas Department Of Criminal Justice"
    },
    {
        " operates the Paris District Parole Office in Paris.       At the federal level, the two U.S. Senators from Texas are Republicans ": null
    },
    {
        "John Cornyn": "John Cornyn"
    },
    {
        " and ": null
    },
    {
        "Ted Cruz": "Ted Cruz"
    },
    {
        ". Paris is part of ": null
    },
    {
        "Texass 4th congressional district": "Texass 4Th Congressional District"
    },
    {
        ", represented by Republican ": null
    },
    {
        "John Ratcliffe": "John Ratcliffe"
    },
    {
        ".     The ": null
    },
    {
        "United States Postal Service": "United States Postal Service"
    },
    {
        " operates the Paris Post Office.        ": null
    },
    {
        "20px": "Image:Us 82.Svg"
    },
    {
        " U.S. Highway 82": "U.S. Highway 82"
    },
    {
        " 20px": "Image:Us 271.Svg"
    },
    {
        " U.S. Highway 271": "U.S. Highway 271"
    },
    {
        " 20px": "Image:Texas 19.Svg"
    },
    {
        " 20px": "Image:Texas 24.Svg"
    },
    {
        " State Highway 19": "State Highway 19"
    },
    {
        "/": null
    },
    {
        "State Highway 24": "State Highway 24"
    },
    {
        " 20px": "Image:Texas Loop 286.Svg"
    },
    {
        " State Highway Loop 286": "State Highway Loop 286"
    },
    {
        "     According to the ": null
    },
    {
        "Texas Transportation Commission": "Texas Transportation Commission"
    },
    {
        ", Paris is the second-largest city in Texas without a four-lane divided highway connecting to an ": null
    },
    {
        "interstate highway": "Interstate Highway"
    },
    {
        " within the state. However, those traveling north of the city can go into the Midwest on a four-lane thoroughfare via US 271 across the Red River into Oklahoma, and then the ": null
    },
    {
        "Indian Nation Turnpike": "Indian Nation Turnpike"
    },
    {
        " from Hugo to Interstate 40 at Henryetta, which in turn continues as a free four-lane highway via US 75 to ": null
    },
    {
        "Tulsa": "Tulsa"
    },
    {
        ".     Paris is served by two taxicab companies. ": null
    },
    {
        "Cox Field": "Cox Field"
    },
    {
        " provides general aviation services.           ": null
    },
    {
        "Pat Mayse Lake": "Pat Mayse Lake"
    },
    {
        " Beavers Bend Resort Park": "Beavers Bend Resort Park"
    },
    {
        "   Evergreen Cemetery – Located on the south side of town, there are over 50,000 people interred. This is the site of a noted  tall Jesus with cowboy boots statue and grave marker, as well as the resting place of banker/philanthropist ": null
    },
    {
        "William J. McDonald": "William Johnson Mcdonald"
    },
    {
        ", Confederate General/U.S. Senator ": null
    },
    {
        "Sam Bell Maxey": "Samuel Bell Maxey"
    },
    {
        ", rancher Pitts Chisum, and cotton magnate John J. Culbertson. Pitts Chisums more famous brother, ": null
    },
    {
        "John Chisum": "John Chisum"
    },
    {
        ", is also buried in the city.   ": null
    },
    {
        "Sam Bell Maxey House": "Sam Bell Maxey House"
    },
    {
        " – Maxey was a planter and Confederate general.   ": null
    },
    {
        "Paris Eiffel Tower": "Eiffel Tower"
    },
    {
        " Elvis Presley": "Elvis Presley"
    },
    {
        " performed at the Boys Club Gymnasium at 1530 1st Street Northeast in Paris as a member of the ": null
    },
    {
        "Louisiana Hayride": "Louisiana Hayride"
    },
    {
        " Jamboree tour.   ": null
    },
    {
        "Lamar County Historical Museum": "Lamar County Historical Museum"
    },
    {
        "           Duane Allen": "Duane Allen"
    },
    {
        ", member of ": null
    },
    {
        "the Oak Ridge Boys": "The Oak Ridge Boys"
    },
    {
        " Tia Ballard": "Tia Ballard"
    },
    {
        ", actress for ": null
    },
    {
        "Funimation Entertainment": "Funimation Entertainment"
    },
    {
        " Charles Baxter": "Charles R. Baxter"
    },
    {
        ", physician, attended President Kennedy after he was fatally shot   ": null
    },
    {
        "Raymond Berry": "Raymond Berry"
    },
    {
        ", professional football ": null
    },
    {
        "Hall of Famer": "Pro Football Hall Of Fame"
    },
    {
        " John Chisum": "John Chisum"
    },
    {
        ", cattle baron   ": null
    },
    {
        "Marsha Farney": "Marsha Farney"
    },
    {
        ", ": null
    },
    {
        "Republican": "Republican Party"
    },
    {
        " member of the ": null
    },
    {
        "Texas House of Representatives": "Texas House Of Representatives"
    },
    {
        " from ": null
    },
    {
        "Williamson County": "Williamson County, Texas"
    },
    {
        "; reared in Paris, graduated from ": null
    },
    {
        "Paris Junior College": "Paris Junior College"
    },
    {
        ", and taught school in Paris in 1990s   ": null
    },
    {
        "Bobby Jack Floyd": "Bobby Jack Floyd"
    },
    {
        ", National Football League fullback   ": null
    },
    {
        "Charles R. Floyd": "Charles R. Floyd"
    },
    {
        ", three-term ": null
    },
    {
        "Democratic": "Democratic Party"
    },
    {
        " state senator": "Texas State Senate"
    },
    {
        "; pioneer of the Texas ": null
    },
    {
        "farm-to-market road": "Farm-To-Market Road"
    },
    {
        " system and an original founder of Paris Junior College   ": null
    },
    {
        "Cas Haley": "Cas Haley"
    },
    {
        ", singer/musician, NBCs season two of Americas Got Talent runner-up   ": null
    },
    {
        "William Henry Huddle": "William Henry Huddle"
    },
    {
        ", Texas Capitol artist   ": null
    },
    {
        "Charlie Jackson": "Charlie Jackson"
    },
    {
        ", NFL football player   ": null
    },
    {
        "Frank Jackson": "Frank Jackson"
    },
    {
        ", NFL football player   General ": null
    },
    {
        "John P. Jumper": "John P. Jumper"
    },
    {
        ", ": null
    },
    {
        "Chief of Staff of the United States Air Force": "Chief Of Staff Of The United States Air Force"
    },
    {
        " from 2001 to 2005   ": null
    },
    {
        "Richard Gordon Kendall": "Richard Gordon Kendall"
    },
    {
        " self-taught ": null
    },
    {
        "outsider": "Outside Art"
    },
    {
        " folk art": "Folk Art"
    },
    {
        "ist   ": null
    },
    {
        "Beverly Leech": "Beverly Leech"
    },
    {
        ", actress, portrayed Kate Monday on  Mathnet  ": null
    },
    {
        "Samuel Bell Maxey": "Samuel Bell Maxey"
    },
    {
        ", United States Senator and ": null
    },
    {
        "Confederate": "Confederate States Of America"
    },
    {
        " Major General   ": null
    },
    {
        "Gordon McLendon": "Gordon Mclendon"
    },
    {
        ", pioneer radio broadcaster and founder of the ": null
    },
    {
        "Liberty Broadcasting System": "Liberty Broadcasting System"
    },
    {
        " Jay Hunter Morris": "Jay Hunter Morris"
    },
    {
        ", operatic tenor   ": null
    },
    {
        "John Osteen": "John Osteen"
    },
    {
        ", pastor   ": null
    },
    {
        "Dave Philley": "Dave Philley"
    },
    {
        ", professional baseball player and holder of five MLB records   ": null
    },
    {
        "Bass Reeves": "Bass Reeves"
    },
    {
        ", the first black deputy U.S. marshal to serve west of the Mississippi River, was based in Paris for four years in the late 19th century.   Admiral ": null
    },
    {
        "James O. Richardson": "James O. Richardson"
    },
    {
        ", United States Navy Fleet Commander 1940–1941   ": null
    },
    {
        "Eddie Robinson": "Eddie Robinson"
    },
    {
        ", professional baseball player, four-time All-Star and Texas Rangers executive   ": null
    },
    {
        "Augusta Rucker": "Augusta Rucker"
    },
    {
        ", medical doctor, zoologist, public health lecturer   ": null
    },
    {
        "Jack Russell": "Jack Russell"
    },
    {
        ", professional baseball player and first relief pitcher selected to a ": null
    },
    {
        "Major League Baseball All-Star Game": "Major League Baseball All-Star Game"
    },
    {
        " Leslie Satcher": "Leslie Satcher"
    },
    {
        ", country music recording artist   ": null
    },
    {
        "William Scott Scudder": "Scott Scudder"
    },
    {
        ", Major League Baseball pitcher   ": null
    },
    {
        "Gene Stallings": "Gene Stallings"
    },
    {
        ", Alabama head coach 1990-1996   ": null
    },
    {
        "Steven H. Tallant": "Steven H. Tallant"
    },
    {
        ", president of Texas A & M University-Kingsville   ": null
    },
    {
        "Starke Taylor": "Starke Taylor"
    },
    {
        ", mayor of Dallas and businessman   ": null
    },
    {
        "Shangela Laquifa Wadley": "Shangela Laquifa Wadley"
    },
    {
        ", comedian, reality television personality, and drag performer      ": null
    }
]