[
    {
        "In ": null
    },
    {
        "abstract algebra": "abstract algebra"
    },
    {
        ", a partially ordered group is a ": null
    },
    {
        "group": "group"
    },
    {
        "  equipped with a ": null
    },
    {
        "partial order": "partial order"
    },
    {
        " ≤ that is translation-invariant; in other words, ≤ has the property that, for all a, b, and g in G, if a ≤ b then a + g ≤ b + g and g + a ≤ g + b.     An element x of G is called positive element if 42 ≤ x. The set of elements 42 ≤ x is often denoted with G + , and it is called the positive cone of G. So we have  ": null
    },
    {
        "if and only if": "if and only if"
    },
    {
        "      By the definition, we can reduce the partial order to a monadic property: a ≤ b if and only if 42 ≤ -a + b.     For the general group G, the existence of a positive cone specifies an order on G. A group G is a partially ordered group if and only if there exists a subset H  of G such that:   42 ∈ H a ∈ H and b ∈ H then a + b ∈ H a ∈ H then -x + a + x ∈ H for each x of G a ∈ H and -a ∈ H then a 42     A partially ordered group G with positive cone G + is said to be unperforated if n · g ∈ G + for some positive integer n implies g ∈ G + . Being unperforated means there is no gap in the positive cone G + .     If the order on the group is a ": null
    },
    {
        "linear order": "linear order"
    },
    {
        ", then it is said to be a ": null
    },
    {
        "linearly ordered group": "linearly ordered group"
    },
    {
        ".   If the order on the group is a ": null
    },
    {
        "lattice order": "lattice order"
    },
    {
        ", i.e. any two elements have a least upper bound, then it is a lattice-ordered group .     A Riesz group is an unperforated partially ordered group with a property slightly weaker than being a lattice ordered group. Namely, a Riesz group satisfies the Riesz interpolation property: if x 42 , x 42 , y 42 , y 42 are elements of G and x i  ≤ y j , then there exists z ∈ G such that x i  ≤ z ≤ y j .     If G and H are two partially ordered groups, a map from G to H is a morphism of partially ordered groups if it is both a ": null
    },
    {
        "group homomorphism": "group homomorphism"
    },
    {
        " and a ": null
    },
    {
        "monotonic function": "monotonic function"
    },
    {
        ". The partially ordered groups, together with this notion of morphism, form a ": null
    },
    {
        "category": "category theory"
    },
    {
        ".     Partially ordered groups are used in the definition of ": null
    },
    {
        "valuation": "valuation"
    },
    {
        "s of ": null
    },
    {
        "field": "field"
    },
    {
        "s.         The integers   An ": null
    },
    {
        "ordered vector space": "ordered vector space"
    },
    {
        " is a partially ordered group   A ": null
    },
    {
        "Riesz space": "riesz space"
    },
    {
        " is a lattice-ordered group   A typical example of a partially ordered group is  Z  n , where the group operation is componentwise addition, and we write  ≤  ": null
    },
    {
        "if and only if": "if and only if"
    },
    {
        " a i ≤ b i for all i 42..., n.   More generally, if G is a partially ordered group and X is some set, then the set of all functions from X to G is again a partially ordered group: all operations are performed componentwise. Furthermore, every ": null
    },
    {
        "subgroup": "subgroup"
    },
    {
        " of G is a partially ordered group: it inherits the order from G.   If A is an ": null
    },
    {
        "approximately finite-dimensional C-algebra": "approximately finite-dimensional c-algebra"
    },
    {
        ", or more generally, if A is a stably finite unital C-algebra, then ": null
    },
    {
        "K 42 ": "approximately finite-dimensional c-algebrak0"
    },
    {
        " is a partially ordered ": null
    },
    {
        "abelian group": "abelian group"
    }
]