[
    {
        ":This article describes the Paschal candle of the Western Churches. For the Paschal triple-candle used in Eastern Orthodox and Eastern Catholic Churches of the Byzantine rite see Paschal trikirion .          A Paschal candle is a large, white ": null
    },
    {
        "candle": "candle"
    },
    {
        " used in liturgies in ": null
    },
    {
        "Western Christianity": "western christianity"
    },
    {
        " . A new Paschal candle is blessed and lit every year at Easter, and is used throughout the ": null
    },
    {
        "Paschal": "paschal mystery"
    },
    {
        " season which is during Easter and then throughout the year on special occasions, such as ": null
    },
    {
        "baptism": "baptism"
    },
    {
        "s and ": null
    },
    {
        "funeral": "funeral"
    },
    {
        "s.     The equivalent of the Paschal candle in the ": null
    },
    {
        "Western Orthodox Church": "western rite orthodoxy"
    },
    {
        " is the ": null
    },
    {
        "Paschal trikirion": "paschal trikirion"
    },
    {
        " which differs both in style and usage.       The term Paschal comes from the Latin word Pascha , which came from the Hebrew word Pesach, which in ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " means ": null
    },
    {
        "Passover": "passover"
    },
    {
        ", and relates to the ": null
    },
    {
        "Paschal mystery": "paschal mystery"
    },
    {
        " of salvation. It is sometimes referred to as the Easter candle or the Christ candle.            For congregations that use a Paschal candle, it is the largest candle in the worship space. In most cases today the candle will display several common symbols:   The cross is always the central symbol, most clearly identifying it as the Paschal candle   The ": null
    },
    {
        "Greek letters": "greek alphabet"
    },
    {
        " alpha": "alpha"
    },
    {
        " and ": null
    },
    {
        "omega": "omega"
    },
    {
        " signify that God is the beginning and the end    The current year represents God in the present amidst the congregation   Five grains of ": null
    },
    {
        "incense": "incense"
    },
    {
        " are embedded in the candle during the Easter Vigil to represent the ": null
    },
    {
        "five wounds of Jesus": "five wounds of jesus"
    },
    {
        ": the three nails that pierced his hands and feet, the spear thrust into his side, and the thorns that crowned his head.     In the Church, Paschal candles often reached a stupendous size. The Paschal candle of ": null
    },
    {
        "Salisbury Cathedral": "salisbury cathedral"
    },
    {
        " was said to have been 42 feet tall. Today, in the United States and Southern Europe the candle is approximately 42  inches in diameter and 42 to 42  inches tall; in Northern Europe the candle tends to be shorter in height and wider in diameter .         For churches that celebrate the ": null
    },
    {
        "Easter Vigil": "liturgical year"
    },
    {
        " on the night of ": null
    },
    {
        "Holy Saturday": "holy saturday"
    },
    {
        ", the ceremonial lighting of the Paschal candle is one of the most solemn moments of the service.     On ": null
    },
    {
        "Maundy Thursday": "maundy thursday"
    },
    {
        " of the same week the entire ": null
    },
    {
        "church": "church"
    },
    {
        " is darkened by extinguishing all ": null
    },
    {
        "candle": "candle"
    },
    {
        "s and lamps. This represents the darkness of a world without God.        At the opening of the Easter Vigil a new fire is lit and blessed. The minister will trace the symbols on the Paschal candle, saying words similar to: Christ, yesterday and today, ": null
    },
    {
        "the beginning and the end, the Alpha and Omega": "alpha and omega"
    },
    {
        ". To Him belongs all time and all the ages; all glory and dominion is his now and forever. Amen. They then insert five grains of incense on the five points of the cross , saying: By His holy and glorious wounds may Christ our Lord guard and keep us.     The Paschal candle is the first candle to be lit with a flame from this sacred fire, representing the light of Christ coming into the world. This represents the risen ": null
    },
    {
        "Christ": "christ"
    },
    {
        ", as a symbol of light dispelling darkness . As it is lit, the minister may say words similar to: The light of Christ, rising in Glory, dispel the darkness of our hearts and minds.        Typically, the worshiping assembly then ": null
    },
    {
        "processes": "procession"
    },
    {
        " into the church led by the Paschal candle. The candle is raised three times during the procession, accompanied by the chant The light of Christ to which the assembly responds Thanks be to God . Following the procession the  Exultet  is chanted, traditionally by a ": null
    },
    {
        "deacon": "deacon"
    },
    {
        ", but it may be chanted by the priest or a ": null
    },
    {
        "cantor": "cantor"
    },
    {
        ". The Exultet concludes with a blessing of the candle:       Accept this Easter candle,   a flame divided but undimmed,   a pillar of fire that glows to the honor of God.     Let it mingle with the lights of heaven   and continue bravely burning   to dispel the darkness of this night!   May the Morning Star which never sets   find this flame still burning:   Christ, that Morning Star,   who came back from the dead,   and shed his peaceful light on all humanity,   your Son, who lives and reigns for ever and ever.   Amen.       From the New Roman Missal:     On this, your night of grace, O holy Father, accept this candle, a solemn offering, the work of bees and of your servants’ hands, an evening sacrifice of praise, this gift from your most holy Church. But now we know the praises of this pillar, which glowing fire ignites for God’s honor, a fire into many flames divided, yet never dimmed by sharing of its light, for it is fed by melting wax, drawn out by mother bees to build a torch so precious. O truly blessed night, when things of heaven are wed to those of earth, and divine to the human.     Therefore, O Lord, we pray you that this candle, hallowed to the honor of your name, may persevere undimmed, to overcome the darkness of this night. Receive it as a pleasing fragrance, and let it mingle with the lights of heaven. May this flame be found still burning by the Morning Star: the one Morning Star who never sets, Christ your Son, who, coming back from death’s domain, has shed his peaceful light on humanity, and lives and reigns for ever and ever.     R. Amen.       In some traditions, the base of the candle may be ritually immersed in the ": null
    },
    {
        "baptismal font": "baptismal font"
    },
    {
        " before proceeding with the remainder of the service.     This candle is traditionally the one from which all other lights are taken for the Easter service.            The candle remains lit at all worship services throughout ": null
    },
    {
        "Easter season": "easter season"
    },
    {
        " which ends on ": null
    },
    {
        "Pentecost Sunday": "pentecost"
    },
    {
        ", , during which time it is located in the ": null
    },
    {
        "sanctuary": "sanctuary"
    },
    {
        " close to the ": null
    },
    {
        "altar": "altar"
    },
    {
        ". After the Easter season, it is frequently placed near the ": null
    },
    {
        "baptismal font": "baptismal font"
    },
    {
        ". Before 42 the option existed of blessing the baptismal font on the Vigil of Pentecost, and this was the only time the Paschal candle would be lit at services after Ascension.     The Paschal candle is also lit during ": null
    },
    {
        "baptism": "baptism"
    },
    {
        "s to signify the ": null
    },
    {
        "Holy Spirit": "holy spirit"
    },
    {
        " and fire that ": null
    },
    {
        "John the Baptist": "john the baptist"
    },
    {
        " promised to those who were baptised in Christ. During the baptismal rite in many traditions, a small lit candle will be given to the newly baptised by a member of the community, with words similar to, Let your light so shine before others, that they might see your good works and glorify your Father in heaven.      The Paschal candle is also lit and placed near the ": null
    },
    {
        "casket": "casket"
    },
    {
        " or ": null
    },
    {
        "urn": "urn"
    },
    {
        " during funeral services such as the Mass of Repose and the Mass of Requiem. This is to signify the hope of the resurrection into which Christians are baptised.       In the ": null
    },
    {
        "Eastern Orthodox": "eastern orthodox church"
    },
    {
        " and ": null
    },
    {
        "Byzantine": "byzantine rite"
    },
    {
        " Catholic": "eastern catholic churches"
    },
    {
        " churches, there is no direct correspondence to the Western Paschal candle. However, throughout ": null
    },
    {
        "Bright Week": "bright week"
    },
    {
        ", the priest carries a cross and ": null
    },
    {
        "paschal trikirion": "paschal trikirion"
    },
    {
        " at all of the services, especially when ": null
    },
    {
        "censing": "censing"
    },
    {
        ", during the ": null
    },
    {
        "Little Entrance": "little entrance"
    },
    {
        " or when giving the ": null
    },
    {
        "Paschal greeting": "paschal greeting"
    },
    {
        ". The trikirion consists of three lit candles in a candlestick, which the priest carries in his left hand. In the Slavic tradition, the three candles may be white or different colors: green, red, blue. The deacon also carries a special Paschal candle which is a single large candle whenever he leads an ": null
    },
    {
        "ektenia": "ektenia"
    },
    {
        " or censes.                                    ": null
    }
]