[
    {
        "             The Passion Play or Easter pageant is a dramatic ": null
    },
    {
        "presentation": "play"
    },
    {
        " depicting the ": null
    },
    {
        "Passion": "passion"
    },
    {
        " of ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        ": his ": null
    },
    {
        "trial": "sanhedrin trial of jesus"
    },
    {
        ", suffering and death. It is a traditional part of ": null
    },
    {
        "Lent": "lent"
    },
    {
        " in several ": null
    },
    {
        "Christian denominations": "christian denominations"
    },
    {
        ", particularly in ": null
    },
    {
        "Catholic": "catholic church"
    },
    {
        " tradition.              The development of the Passion Play was about the same as that of the ": null
    },
    {
        "Easter Drama": "easter drama"
    },
    {
        ". It originated in the ": null
    },
    {
        "ritual": "ritual"
    },
    {
        " of the ": null
    },
    {
        "Church": "christian church"
    },
    {
        ", which prescribes, among other things, that the ": null
    },
    {
        "Gospel": "gospel"
    },
    {
        " on ": null
    },
    {
        "Good Friday": "good friday"
    },
    {
        " should be sung in parts divided among ": null
    },
    {
        "various persons": "performers"
    },
    {
        ". Later, the Passion Play made its appearance, first in ": null
    },
    {
        "Latin": "latin"
    },
    {
        ", then in ": null
    },
    {
        "vernacular": "vernacular"
    },
    {
        " languages; contents and forms were adapted more and more to ": null
    },
    {
        "audience": "audience"
    },
    {
        " expectations, until, in the fifteenth century, the popular religious plays had developed. The Benedictbeurn Passion Play is still largely composed of Latin ritual sentences in ": null
    },
    {
        "prose": "prose"
    },
    {
        " and of church ": null
    },
    {
        "hymns": "hymns"
    },
    {
        ", and, being designed to be sung, resembles an ": null
    },
    {
        "oratorio": "oratorio"
    },
    {
        ".       Yet even this oldest of the Passion Plays already shows a tendency to break away from the ritual and to adopt a more ": null
    },
    {
        "dramatic form": "dramatic structure"
    },
    {
        ". This evolution is shown by the interpolation of free translations of church hymns and of German verses not pertaining to such hymns, as well as by the appearance of Mary  and ": null
    },
    {
        "Mary Magdalene": "mary magdalene"
    },
    {
        " in the action. From these humble beginnings the Passion Play developed very rapidly, since in the fourteenth century it was at a stage of development which could not have been reached except by ": null
    },
    {
        "repeated practice": "rehearsal"
    },
    {
        ". From this second period we have the Vienna Passion, the St. Gall Passion, the oldest Frankfort Passion, and the Maestricht Passion. All four Plays, as they are commonly called, are written in ": null
    },
    {
        "rhyme": "rhyme"
    },
    {
        ", principally in German.       The Vienna Passion embraces the entire history of the ": null
    },
    {
        "Redemption": "redemption"
    },
    {
        ", and begins with the revolt and ": null
    },
    {
        "fall": "fallen angel"
    },
    {
        " of ": null
    },
    {
        "Lucifer": "lucifer"
    },
    {
        "; the play, as transmitted to us, ends with Jesus and his ": null
    },
    {
        "Twelve Apostles": "twelve apostles"
    },
    {
        " sitting at ": null
    },
    {
        "the Last Supper": "the last supper"
    },
    {
        ".     The oldest Frankfort Passion play, that of Canon Baldemar von Peterwell , the production of which required two days, was more profusely elaborated than the other Passion Plays of this period. Of this play only the  Ordo sive Registrum  has come down to us, a long roll of ": null
    },
    {
        "parchment": "parchment"
    },
    {
        " for the use of the director, containing ": null
    },
    {
        "stage directions": "stage directions"
    },
    {
        " and the first words of the ": null
    },
    {
        "dialogues": "dialogue"
    },
    {
        ". The plays based on this list of directions lead us to the period in which the Passion Play reached its highest development . During this period the later Frankfort Passion Play , the Alsfelder, and the Friedberger originated. Connected with this group are the Eger, the Donaueschingen, Augsburg, Freising and Lucerne Passion Plays, in which the whole world drama, beginning with the ": null
    },
    {
        "creation of man": "creation of man"
    },
    {
        " and brought down to the ": null
    },
    {
        "coming of the Holy Ghost": "pentecost"
    },
    {
        ", is exhibited, and which was produced with great splendour as late as 42         Nearly all these Passion Plays have some relation to those coming from the ": null
    },
    {
        "Tyrol": "tyrol"
    },
    {
        ", some contributing to, others taking from, that source. These, again, are founded upon the Tyrolese Passion play which originated during the transition period of the fourteenth to the fifteenth century. Historian J. E. Wackernell, with the aid of the plays that have reached us, has reconstructed this period.  In Tyrol the Passion Plays received elaborate cultivation; at ": null
    },
    {
        "Bolzan": "bozen"
    },
    {
        " o they were presented with great splendour and, in 42 lasted no less than seven days.  Here, too, the innovation of placing the female ": null
    },
    {
        "roles": "role"
    },
    {
        " in the hands of women was introduced, which innovation did not become general until during the seventeenth century.       The magnificent productions of the Passion Plays during the fifteenth century are closely connected with the growth and increasing self-confidence of the cities, which found its expression in noble buildings, ecclesiastical and municipal, and in gorgeous public festivals. The artistic sense and the ": null
    },
    {
        "love of art": "aesthetics"
    },
    {
        " of the citizens had, in co-operation with the clergy, called these plays into being, and the wealth of the citizens provided for magnificent productions of them on the public squares, whither they migrated after expulsion from the churches. The citizens and civil authorities considered it a point of honour to render the production as rich and diversified as possible. Ordinarily the preparations for the play were in the hands of a spiritual brotherhood, the play itself being considered a form of ": null
    },
    {
        "worship": "worship"
    },
    {
        ". People of the most varied classes took part in the production, and frequently the number of actors was as high as two hundred and even greater. If was undoubtedly no small task to drill the performers, particularly since the ": null
    },
    {
        "stage arrangements": "set design"
    },
    {
        " were still very primitive.       The ": null
    },
    {
        "stage": "stagecraft"
    },
    {
        " was a wooden structure, almost as broad as it was long, elevated but slightly above the ground and open on all sides. A house formed the background; a ": null
    },
    {
        "balcony": "balcony"
    },
    {
        " attached to the house represented ": null
    },
    {
        "Heaven": "heaven"
    },
    {
        ". Under the balcony three ": null
    },
    {
        "cross": "cross"
    },
    {
        "es were erected. Sometimes the stage was divided into three sections by ": null
    },
    {
        "doors": "stage door"
    },
    {
        ". Along the sides of the stage, taken lengthwise, stood the houses required for the production; they were indicated by fenced-in spaces, or by four posts upon which a roof rested. The ": null
    },
    {
        "entrance into": "gates of hell"
    },
    {
        " Hell": "hell"
    },
    {
        " was pictured by the mouth of a monster, through which the ": null
    },
    {
        "Devil": "devil"
    },
    {
        " and the ": null
    },
    {
        "soul": "soul"
    },
    {
        "s captured or released during the plays passed back and forth. The actors entered in solemn procession, led by musicians or by a præcursor , and took their stand at the places appointed them. They remained on the stage all through the performance; they sat on the barriers of their respective divisions, and were permitted to leave their places only to ": null
    },
    {
        "recite": "dialogue"
    },
    {
        " their lines. As each actor finished speaking, he returned to his place. The audience stood around the stage or looked on from the windows of neighbouring houses. Occasionally platforms, called bridges , were erected around the stage in the form of an ": null
    },
    {
        "amphitheatre": "amphitheatre"
    },
    {
        ".       The ": null
    },
    {
        "scenery": "theatrical scenery"
    },
    {
        " was the background of old time middle east. There were no side ": null
    },
    {
        "scenes": "scene"
    },
    {
        ", and consequently no stage perspective. Since an illusion of reality could not be had, indications were made to suffice. Thus a cask standing on end represents the mountain on which Christ is tempted by the Devil; ": null
    },
    {
        "thunder": "thunder"
    },
    {
        " is imitated by the report of a gun; in order to signify that the Devil had ": null
    },
    {
        "entered into him": "demonic possession"
    },
    {
        ", ": null
    },
    {
        "Judas": "judas iscariot"
    },
    {
        " holds a bird of black plumage before his mouth and makes it flutter. The suicide of Judas is an execution, in which ": null
    },
    {
        "Beelzebub": "beelzebub"
    },
    {
        " performs the hangmans duty. He precedes the culprit up the ladder and draws Judas after him by a ": null
    },
    {
        "rope": "rope"
    },
    {
        ". Judas has a black bird and the ": null
    },
    {
        "intestines": "intestines"
    },
    {
        " of an animal concealed in the front of his clothing, and when Satan tears open the garment the bird flies away, and the intestines fall out, whereupon Judas and his executioner slide down into Hell on a rope. A ": null
    },
    {
        "painted picture": "painting"
    },
    {
        " representing the ": null
    },
    {
        "soul": "soul"
    },
    {
        ", is hung from the mouth of each of the two ": null
    },
    {
        "thieves": "thief"
    },
    {
        " on the cross; an ": null
    },
    {
        "angel": "angel"
    },
    {
        " takes the soul of the ": null
    },
    {
        "penitent": "penitent"
    },
    {
        ", the devil that of the impenitent thief. Everything is presented in the concrete, just as the ": null
    },
    {
        "imagination": "imagination"
    },
    {
        " of the audience pictures it, and the scenic conditions, resembling those of the antique theatre demand. All ": null
    },
    {
        "costume": "costume"
    },
    {
        ", however, is contemporary, historical accuracy being ignored.       The Passion Plays of the 42th century, with their peculiar blending of religious, artistic, and increasingly secular ": null
    },
    {
        "elements": "dramatic structure"
    },
    {
        ", gave a true picture of German city life of those times. Serious thought and lively humour were highly developed in these plays. When, however, the ": null
    },
    {
        "patricians": "patrician"
    },
    {
        ", in the sixteenth century, withdrew more and more from the plays, the plays, left to the lower classes, began to lose their serious and dignified character. The influence of the Carnival plays was felt more and more. Master Grobianus with his coarse and ": null
    },
    {
        "obscene": "obscenity"
    },
    {
        " jests was even introduced into some of the Passion Plays. In time the ": null
    },
    {
        "ecclesiastical": "ecclesiastical"
    },
    {
        " authorities forbade the production of these secularized plays. Thus, the ": null
    },
    {
        "Bishop of Havelberg": "bishop of havelberg"
    },
    {
        " commanded his clergy, in 42 to suppress the Passion Plays and legend plays in their parish districts because of the disgraceful and irrelevant ": null
    },
    {
        "farce": "farce"
    },
    {
        "s interspersed through the productions.       With the advent of the 42th-century European religious conflict the uneasiness with ": null
    },
    {
        "liturgical drama": "liturgical drama"
    },
    {
        " in general increased. The ": null
    },
    {
        "Synod": "synod"
    },
    {
        " of ": null
    },
    {
        "Strasburg": "strasbourg"
    },
    {
        " of 42 opposed the religious plays, and the year previous, in 42 the ": null
    },
    {
        "Parliament of Paris": "parliament of paris"
    },
    {
        " forbade the production of The Mysteries of the Passion of our Redeemer and other Spiritual Mysteries. One consequence was that the secularized plays were separated from the religious, and, as Carnival plays, held the public favour. The Passion Plays came to be presented more rarely, particularly as the ": null
    },
    {
        "Reformation": "protestant reformation"
    },
    {
        " was inimical to them.         School dramas now came into vogue in Catholic and Protestant schools, and frequently enough became the battle-ground of religious ": null
    },
    {
        "controversies": "controversies"
    },
    {
        ". When, in the 42th century, the splendidly equipped ": null
    },
    {
        "Jesuit drama": "jesuit drama"
    },
    {
        " arose, the Passion Plays were relegated to out-of-the-way ": null
    },
    {
        "villages": "villages"
    },
    {
        " and to the ": null
    },
    {
        "monasteries": "monasteries"
    },
    {
        ", particularly in ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        " and ": null
    },
    {
        "Austria": "austria"
    },
    {
        ". Towards the end of the eighteenth century, during the ": null
    },
    {
        "Age of Enlightenment": "the enlightenment"
    },
    {
        ", efforts were made in Catholic Germany, particularly in Bavaria and the Tyrol, to destroy even the remnants of the tradition of ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " plays.       Public interest in the Passion Play developed in the last decades of the 42th century, and the statistician ": null
    },
    {
        "Karl Pearson": "karl pearson"
    },
    {
        " wrote a book about them.     Since then, ": null
    },
    {
        "Brixlegg": "brixlegg"
    },
    {
        " and Vorderthiersee in ": null
    },
    {
        "Tyrol": "tyrol"
    },
    {
        " and  in the ": null
    },
    {
        "Czech Republic": "czech republic"
    },
    {
        ", and above all, the ": null
    },
    {
        "Oberammergau": "oberammergau"
    },
    {
        " in ": null
    },
    {
        "Upper Bavaria": "upper bavaria"
    },
    {
        " attract thousands to their plays.     The text of the play of Vorderthiersee  dates from the second half of the seventeenth century, is entirely in verse, and comprises in five ": null
    },
    {
        "acts": "act"
    },
    {
        " the events recorded in the Gospel, from the Last Supper to the Entombment. A prelude , on the ": null
    },
    {
        "Good Shepherd": "the good shepherd"
    },
    {
        ", precedes the play. After being repeatedly remodelled, the text received its present classical form from the Austrian ": null
    },
    {
        "Benedictine": "benedictine"
    },
    {
        ", ": null
    },
    {
        "P. Weissenhofer": "p. weissenhofer"
    },
    {
        ". Productions of the play, which came from Bavaria to the Tyrol in the second half of the eighteenth century, were arranged at irregular intervals during the first half of the nineteenth century; since 42 they have taken place at regular intervals, at Brixlegg every ten years. The Höritz Passion Play, the present text of which is from the pen of Provost Landsteiner, has been produced every five years, since 42              In Australia, several major productions of The Passion are staged annually during the lead up to Easter.   The Iona Passion Play was founded in 42 in ": null
    },
    {
        "Queensland": "queensland"
    },
    {
        ", and tours cities and towns around Australia. In each location the touring cast invites community members to join the production.    The Moogerah Passion Play, established in 42 is produced annually, at Easter time, in ": null
    },
    {
        "Queensland": "queensland"
    },
    {
        ". It is staged realistically at The Lake Theatre, a large, purpose built, lakeside theatre designed specifically for the Moogerah Passion Play. Contemporary versions of the play endeavour to use different Bibles to convey messages to the audience every year.  ": null
    },
    {
        "New South Wales": "new south wales"
    },
    {
        ", at ": null
    },
    {
        "Turramurra": "turramurra"
    },
    {
        ", The Turramurra Passion is a contemporary, character-driven interpretation, using multimedia elements and an original score. ": null
    },
    {
        "Brisbane, Queensland": "brisbane, queensland"
    },
    {
        ", a new group of enthusiastic people staged a version of the Passion Play, with an original score and script written by Roy Pires, that was staged for the first time in 42 It was very successful, touching the lives of many people .          The chief survivor of former times is the ": null
    },
    {
        "Oberammergau Passion Play": "oberammergau passion play"
    },
    {
        ", first performed in the Bavarian village of ": null
    },
    {
        "Oberammergau": "oberammergau"
    },
    {
        " in 42 and now performed every 42 years. The next Oberammergau Passion Play will take place in 42     In 42 about half the inhabitants of Oberammergau took part in the once-a-decade Passion Play; over 42 villagers brought the story of Jesus of Nazareth to life for audiences that flocked in from around the world. In accordance with tradition, the play started with Jesus entering Jerusalem, continued with his death on the cross, and finished with the Resurrection.     42 saw a new production directed by Christian Stückl, director at Munichs noted Volkstheater. He was supported by the artistic team that, along with him, staged the 42 Passion Play: deputy director and dramatic adviser Otto Huber, set and costume designer Stefan Hageneier, music director Marxus Zwink, and conductor Michael Bocklet. All four of these collaborators are from Oberammergau. The play started at 42 and included a three-hour interval, ending at 42. Performances took place between mid-May and early October 42          The Passion of Christ is performed in ": null
    },
    {
        "Sordevolo": "sordevolo"
    },
    {
        "  every five years since 42 from June to September, by all the inhabitants of the village in an open-air amphitheatre 42 squared meters wide, of 42 seats under cover. In front of the audience is rebuilt a corner of Jerusalem.Every actor involved is a volunteer, as well as who works behind the scenes for scenography, costumes, script, horses. It is one of the greatest shows about the Passion of Christ in Italy, sacred in the topic, popular in its realization. About 42 shows are performed for each season. The next edition will take place in 42 .          The Passion of the Christ is performed every year during Easter, in a purpose-built  theatre-city in the arid backlands of ": null
    },
    {
        "Pernambuco": "pernambuco"
    },
    {
        ", in northeastern ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ". It is considered to be the largest open-air theatre in the world. Thousands of visitors arrive every year to watch the performance; over 42 actors appear on the nine separate stages within the stone walls of the ": null
    },
    {
        "New Jerusalem": "new jerusalem theater"
    },
    {
        " city-theatre. ": null
    },
    {
        "The Canadian Badlands Passion Play": "the canadian badlands passion play"
    },
    {
        " is performed annually in ": null
    },
    {
        "Drumheller": "drumheller"
    },
    {
        ", Alberta. It is staged outdoors in a naturally occurring ": null
    },
    {
        "amphitheatre": "amphitheatre"
    },
    {
        " in the hills of the Drumheller valley. Performers are a mix of professionals and volunteers from across Alberta and Canada, with nearly 42 actors and musicians annually. ": null
    },
    {
        "Hamilton, Ontario": "hamilton, ontario"
    },
    {
        ", Cardinal Newman Catholic Secondary School puts on a Passion Play annually for all the students who attend it.   In ": null
    },
    {
        "Kingston, Ontario": "kingston, ontario"
    },
    {
        ", a full-scale Passion Play production has been traditionally performed for decades at the ": null
    },
    {
        "Kingston Gospel Temple": "kingston gospel temple"
    },
    {
        ", a Pentecostal worship center. The production features local amateur and professional talent.   In ": null
    },
    {
        "Manitoba": "manitoba"
    },
    {
        ", located in the La Riviere Valley at Oak Valleys Outdoor theatre, located on the edge of the Pembina Valley. The cast and crew are volunteers from all over southern Manitoba. Rehearsals usually start in April or early May and are ready for mid-July performances. ": null
    },
    {
        "Thornhill, Ontario": "thornhill, ontario"
    },
    {
        ", in what has become an annual tradition at St. Joseph the Worker Parish, over 42 parish youth and young adults annually come together to present the LIfe and Passion of Christ, the decisive event in history that gave victory to hope, love, light, and life. Every year, the StJW Parish Passion Play increases in quality and number as the bar continues to be raised. Funds raised from the Passion Play go to subsidize the StJW Youths annual trip to the Steubenville Youth Conference.   In ": null
    },
    {
        "Queensway Cathedral": "queensway cathedral"
    },
    {
        "  a Passion Play takes place during the Easter Season. For more than 42 years, the Church on the Queensway has presented different versions of the Passion Play in their 42-seat venue, using hundreds of volunteers, live animals, singers and dancers. The play has become a favorite, and most shows experience capacity crowds. This presentation is known for its powerful portrayal of the life of Christ, dramatic resurrection, and ascension scenes.  ": null
    },
    {
        "Vaughan, Ontario": "vaughan, ontario"
    },
    {
        ", organized by St. Peters Parish and performed at ": null
    },
    {
        "Holy Cross Catholic Academy": "holy cross catholic academy"
    },
    {
        ".          Kőhegy Chapel at Budaörs was built by Franz Wendler to whom Virgin Mary had appeared in a dream. He supposedly dreamt of a dog rose on Stone Mountain, every flower of which bore the face of Mary. On the petals he read: I am the Immaculate Conception . In spring 42 Wendler started construction. On 42 October 42 the chapel was consecrated to Marys Immaculate Conception. Franz Wendler lived in a cave next to the chapel from 42 until his death. The chapel is one of the most important pilgrimage places for Germans of Hungary in the area of Buda.Every three years, Budaörs’ inhabitants stage a passion play with Hungarian and German text.            The island nation of ": null
    },
    {
        "Malta": "malta"
    },
    {
        " features many Passion Plays, put on by provincial club, societies, and theatres in various localities. Each village and town often hosts several plays, and there is some competition among the troupes to put on the most moving or beautiful display. These are often combined with processions and wirjiet that feature models and renditions of the Passion.     Since 42 a Passion Play entitled Il-Mixja,  with Jesus being played by popular Maltese actor Alan Fenech and featuring some of the most highly acclaimed actors in Malta, has become one of the highlights of the genre on the island with the audience experiencing the passion of Jesus Christ as if they were present on the streets of Jerusalem during those historical two days. The play is held outdoors and has so far been held four times in the streets of ": null
    },
    {
        "Rabat": "rabat"
    },
    {
        ", once at Ħaġar Qim temples and four times for charity on the grounds surrounding Mount Carmel Hospital. In 42 the event was held at the presidential Verdala palace in aid of the Malta Community Chest Fund. In 42 it was held both at Verdala Palace and on the grounds surrounding Mount Carmel Hospital whereas in 42 the production once again changed location to the Romeo Gardens in Santa Venera with once again the Malta Community Chest Fund Foundation and the service users of Mount Carmel Hospital being the beneficiaries of this charity event.        De Passiespelen is a re-enactment of the Passion of the Christ taking place every year that is divisible by 42 e.g., in 42 and 42 It is performed in the open air in ": null
    },
    {
        "Openluchttheater De Doolhof": "openluchttheater de doolhof"
    },
    {
        ", in ": null
    },
    {
        "Tegelen": "tegelen"
    },
    {
        ". It originated in 42 and has become an internationally acclaimed event drawing visitors from all over the world. ": null
    },
    {
        "Nederland 42": "nederland 3"
    },
    {
        " has broadcast  The Passion , a live television ": null
    },
    {
        "musical": "musical theatre"
    },
    {
        " that features a rendition of the story set in the present day, accompanied by ": null
    },
    {
        "popular music": "popular music"
    },
    {
        ". Serving as a Dutch adaptation of ": null
    },
    {
        "BBC Three": "bbc three"
    },
    {
        "s special,  Manchester Passion  , it has since been held annually in different cities, with the 42 edition seen by approximately 42 million viewers. The concept has also been sold as a ": null
    },
    {
        "television format": "television format"
    },
    {
        " to other countries, such as ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        " and the ": null
    },
    {
        "United States": "the passion"
    },
    {
        ".               The predominantly ": null
    },
    {
        "Catholic": "roman catholicism in the philippines"
    },
    {
        " Philippines": "philippines"
    },
    {
        " has Passion Plays called Senákulo, named after the ": null
    },
    {
        "Upper room": "cenacle"
    },
    {
        ", every  Semana Santa  . Theatre companies and community groups perform different versions of the Senákulo, using their own scripts that present the dialogue in either poetic or prosaic form. These scripts are decades or even centuries-old, and draw from both the Bible and folk tradition.     Costumes and scenery in traditional Senákulo conform to Hispanic iconography instead of actual ": null
    },
    {
        "historical realism": "historical realism"
    },
    {
        ", which is more common with recent productions . Some productions use ropes to hold actors on crosses while others use actual nails.      One of the more popular Senákulo is Ang Pagtaltal in ": null
    },
    {
        "Jordan": "jordan, guimaras"
    },
    {
        ", ": null
    },
    {
        "Guimaras": "guimaras"
    },
    {
        ", which began in 42 and draws some 42 visitors annually.  Some people perform crucifixions outside of Passion Plays to fulfill a panatà , such as the famous penitents in Barangay ": null
    },
    {
        "San Pedro Cutud": "san pedro cutud"
    },
    {
        ", ": null
    },
    {
        "San Fernando": "city of san fernando, pampanga"
    },
    {
        ", ": null
    },
    {
        "Pampanga": "pampanga"
    },
    {
        ".       Tradition of Passion Plays in ": null
    },
    {
        "Poland": "poland"
    },
    {
        " has become popular again in the early 42th century. Today the best known plays take place in Kałków, Kalwaria Pacławska, the ": null
    },
    {
        "Pallotines": "pallotines"
    },
    {
        " Seminary in Ołtarzew, and the most prominent in ": null
    },
    {
        "Sanctuary": "sanctuary"
    },
    {
        " of ": null
    },
    {
        "Kalwaria Zebrzydowska": "kalwaria zebrzydowska"
    },
    {
        ". This Passion Play is one of the oldest. ": null
    },
    {
        "Palm Sunday": "palm sunday"
    },
    {
        " in open air of Cytadela City Park. Now it is the biggest performance of this kind in Europe. In 42 42 pilgrims were expected to attend.       In the 42th and 42th century, Passion Plays were organised in the towns of the ": null
    },
    {
        "Slovene Lands": "slovene lands"
    },
    {
        ", like ": null
    },
    {
        "Kranj": "kranj"
    },
    {
        ", ": null
    },
    {
        "Ljubljana": "ljubljana"
    },
    {
        ", and ": null
    },
    {
        "Novo Mesto": "novo mesto"
    },
    {
        ". Their language was German, ": null
    },
    {
        "Slovene": "slovene language"
    },
    {
        ", or both.  They were all based on the tradition of the ": null
    },
    {
        "Ljubljana Passion Play": "ljubljana passion play"
    },
    {
        ",  which was organised by ": null
    },
    {
        "Capuchins": "order of friars minor capuchin"
    },
    {
        " and first performed from ca. 42 until ca. 42  The most distinguished of them has been the ": null
    },
    {
        "Škofja Loka Passion Play": "škofja loka passion play"
    },
    {
        ". It was written by ": null
    },
    {
        "Father Romuald": "father romuald"
    },
    {
        " in 42 with modifications until 42 on the basis of an older tradition. It is the oldest preserved play in Slovene as well as the oldest preserved directors book in Europe and the only one extant from the ": null
    },
    {
        "Baroque": "baroque"
    },
    {
        " period.  The Škofja Loka Passion Play was performed each year until 42 The procession was revived in 42 and reprised in 42 and 42 with further reprisals planned for 42 and 42  The plays reprisals are the largest open-air theatre production in Slovenia.           In ": null
    },
    {
        "Catalonia": "catalonia"
    },
    {
        ", it is common for villages to present different Passion Plays every Easter, like the ones in ": null
    },
    {
        "Esparreguera": "esparreguera"
    },
    {
        ", ": null
    },
    {
        "Olesa de Montserrat": "olesa de montserrat"
    },
    {
        ", ": null
    },
    {
        "Ulldecona": "ulldecona"
    },
    {
        " or ": null
    },
    {
        "Cervera": "cervera"
    },
    {
        ", first documented in 42 Olesas 42 production surpassed the world record for the most people acting on stage at the same time, with 42 persons. ": null
    },
    {
        "Balmaseda": "balmaseda"
    },
    {
        ", in the Spanish ": null
    },
    {
        "Basque Country": "basque country"
    },
    {
        ", holds the leading Passion Play in the region.             The earliest Passion Plays in ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        ", at Vanny in Mannar, Pesalai, Pamanugama, Mutuwal, Pallansena, Kalamulla, Duwa and Pitipana in Negombo, used life-size statues instead of living actors. Influenced by the Oberammergau Passion Play, K. Lawrence Perera, began the practice of using living actors in the Borelassa Passion Play. Women later began to take part in the play. However, for a period of time after 42 the Archbishop of Colombo banned performances because of his disapproval of the womens participation. Rohan, Wijith . .  Daily Mirror . Retrieved 42 May 42 In the late 42th and early 42st centuries, there are many Passion Play enactments in Sri Lanka:   Duwa Passion Play, near ": null
    },
    {
        "Negombo": "negombo"
    },
    {
        "    The Yagaya Passion Play at ": null
    },
    {
        "Kandawala": "kandawala, negombo"
    },
    {
        ", Katana   Aho mage Senageni and Aho mage senageni at Halpe, Katana   Kurusiya Matha Miyadunemi, a modern Passion Play enacted in the villages of Katuwapitiya and Bolawalana in Negombo   Thambakande Paskuwa at St. Brunos Church in Negombo with a large number of celebrities as actors     Tharakayano, the first ballet style Passion Play, enacted in Negombo .        Maha Premaya, the Easter passion play, was enacted on 42 March 42 at Dungalpitiya, Don Bosco auditorium in Negombo. Over 42 actors participated. Produced by Rev. Fr. Manjula Priyantha , directed by George Dinesh Manthrige.       The Church of Immaculate Conception in ": null
    },
    {
        "Bangkok": "bangkok"
    },
    {
        " and ": null
    },
    {
        "Chanthaburi": "chanthaburi"
    },
    {
        " holds an annual Passion Play on ": null
    },
    {
        "Good Friday": "good friday"
    },
    {
        ".       ;Origin and history of the Passion Play in the United Kingdom     Passion Plays are biblical dramas that portray the Easter story. They depict the events of Jesus Christs trial, death and resurrection and may also extend to the events of his life, works and miracles. Today they are performed at Easter and often take place in public spaces such as city centres and town squares as free, community-led performances.     Popular biblical dramas of the Middle Ages - including liturgical drama, Passion Plays and the Corpus Christi cycles or Mystery Play - are the originators of modern Passion Plays. The Mystery Plays were epic play cycles were large-scale productions financed and produced by medieval guilds for the glory of God and the honour of their city.  The most well-known took place in York, Coventry and Chester.      This dramatic heritage is acknowledged by modern Passion Plays. The similarities between these community-led, Bible focussed plays from the Middle Ages and contemporary Mystery Plays and Passion Plays are recognised by artists involved in the plays, journalists  and academic.   The Passion Trust is a registered charity which supports, resources and researches Passion Plays in the UK.       ;Aberdeen   The ": null
    },
    {
        "Aberdeen": "aberdeen"
    },
    {
        " Passion is staged biennially in the North East of ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". First performed in 42 this Passion Play recreates 42st-century Jerusalem in modern Aberdeen.      ;Abingdon   The town of Abingdon Passion Play was a free, open-air production performed in 42 This was the result of a community enterprise combining drama, music and dance which took place in different locations within Abingdons historic Abbey Gardens.      ;Alresford   Members of Churches Together in ": null
    },
    {
        "Alresford, Hampshire": "new alresford"
    },
    {
        " produced a Broad Street adaptation from Palm Sunday to Good Friday through song, dance, mime and drama for the second time in ten years in 42 Costumes were chosen reflecting what Jesus might have worn had he lived in the modern age; he wore jeans and those arresting him wore combat fatigues.      ;Bewdley   Bewdley Passion Play took place in 42 and was a promenade through the town in Worcestershire. Its central River Severn Bridge was closed for over an hour and the cast of volunteer and professional actors drew hundreds of spectators.         ;Birmingham   The Old Joint Stock Theatre Company based in ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        " presented a modern retelling of the Passion Play in association with ": null
    },
    {
        "Birmingham Cathedral": "st philips cathedral, birmingham"
    },
    {
        " during Easter 42     ;Brighton   Volunteers from local communities in Brighton dramatise the days leading up to Jesus arrest, death and resurrection from a script faithful to original scripture. Local community volunteers are mixture of backgrounds, denominations and nationalities.  This Passion Play is part of the broader Easter celebrations of Soul by the Sea and has drawn crowds in the thousands since 42       ;Cowbridge   The town of ": null
    },
    {
        "Cowbridge": "cowbridge"
    },
    {
        " in the Vale of Glamorgan presented a Passion Play on Good Friday 42 April 42 at Holy Cross Church with the cast drawn from each of the denominations of churches there.     ;Devizes   A Passion Play takes place every ten years in the town in West Wiltshire; events from Christs arrest to his crucifixion are depicted in a Jerusalem style promenade performance.     ;Edinburgh   Since 42 a Passion Play has been staged in Princes Street Gardens over the Easter weekend. Crowds of up to 42 people come to watch the community theatre productions portraying the events of the Easter story. The 42 production was written by Rob Drummond with obvious reference to modern-day Scotland without taking political sides; the diverging behaviours and reactions of the split Jewish community in Jerusalem played served to point to the dangers of people letting the 42 independence referendum public debate break down any of their normal relationships.      ;Great North Passion   The Great North Passion drew a crowd of thousands and was televised on BBC One in a live one-hour event on Good Friday 42 The twelve stations of the cross were the focus of twelve dramatic, artistic and musical interpretations from different local communities in Northumberland, Middlesbrough, North and South Tyneside and Gateshead.      ;Havant   The town performed its first Passion Play in 42 as a collective effort by its church congregations and their leaders in worship.      ;Isle of Man   The Manx Passion was a promenade performance that took place in the Spring of 42 often outdoors at scenic sites on the isle. Its Acts and Scenes selected important teachings and messages in the Bible from Creation to the Passion. It was adapted from the Mystery Plays of York, Chester and the Wakefield Cycles by Christopher Denys.      ;Leominster   The town of ": null
    },
    {
        "Leominster": "leominster"
    },
    {
        " in Herefordshire holds a Passion Play on Good Friday every four years, performed by volunteers from churches of all denominations in the town. The play is performed outdoors with each scene in a different position in the streets and squares of the town centre. The 42 performance included bespoke music by local composer Liam Dunachie.      ;Manchester   ": null
    },
    {
        "BBC Three": "bbc three"
    },
    {
        " broadcast a modern eclectic musical-genre Passion Play, the  Manchester Passion  in 42     ;Newark-on-Trent   The town of ": null
    },
    {
        "Newark-on-Trent": "newark-on-trent"
    },
    {
        " hosted the Newark Passion written by James Pacey performed in 42 in the ": null
    },
    {
        "Church of St. Mary Magdalene": "church of st. mary magdalene, newark-on-trent"
    },
    {
        " and in 42 performed in nearby ": null
    },
    {
        "Southwell Minster": "southwell minster"
    },
    {
        ". , Retrieved 424242     ;Liverpool   Liverpool Cathedral presents a Passion Play each year to dramatise the events of Holy Week. The 42 production was written by Mark Lovelady and Dan Bishop hand included an extra act showing Jesus resurrection.      ;Oxford   The Cowley Road Passion Play first took place in Oxford in 42 Its 42 production attracted national attention because it was cancelled at the last moment. City Council Licensing officials refused to let it proceed without a fully debated decision, having presumed the motive for notifying that authority regarding the Passion Play would be that the play must, supported by its title, be a sex-related production necessitating full permission under the 42 Act rather than the producers enquiring if the council would share the widespread view it fell within the meaning of The provision of any entertainment or entertainment facilities for the purposes of, or for purposes incidental to, a religious meeting or service following licensing ": null
    },
    {
        "deregulation": "deregulation"
    },
    {
        " by the ": null
    },
    {
        "Licensing Act 42": "licensing act 2003"
    },
    {
        ". .      ;Poole   The town of ": null
    },
    {
        "Poole": "poole"
    },
    {
        " stages the play viewed Through the Eyes of a Child every two years known as Poole Community Passion Play . It has been performed since written in 42 It is performed by a diverse inter-generational group of amateur and professional actors, actresses, singers and choreographed performers.      ;Port Talbot   The town of ": null
    },
    {
        "Port Talbot": "port talbot"
    },
    {
        " at ": null
    },
    {
        "BBC Wales": "bbc wales"
    },
    {
        " studios hosted a Passion Play directed by award-winning actor ": null
    },
    {
        "Michael Sheen": "michael sheen"
    },
    {
        " on 42–42 April 42 ,  BBC , 42 January 42  BBC programmes. Accessed 424242     ;Southampton   The city of ": null
    },
    {
        "Southampton": "southampton"
    },
    {
        " hosted a modern largely musical-genre version,  The Southampton Passion , on Good Friday, 42 April 42 ,  BBC , 42 February 42     ;South Woodham Ferrers   The town in ": null
    },
    {
        "Essex": "essex"
    },
    {
        " performed its first Passion Play 42 to speak to all people of all times; the characters variously wore contemporary clothes or traditional costumes and the actor playing Jesus arrived in the play on a ": null
    },
    {
        "Harley Davidson": "harley davidson"
    },
    {
        " motorcycle. Its script is based on original accounts in the Bible, using modern language and realistic performances.      ;Tonbridge   Tonbridge Passion Play takes place in the grounds of Tonbridge Castle and Rochester Prison over the Easter Weekend since 42      ;Trafalgar Square   Trafalgar Square hosts The Passion of Christ play twice on Good Friday afternoon, drawing up to 42 spectators and having a large cast with colourful costumes, horses and a donkey. The Wintershall Players performance from Surrey is supported by the Mayor of London and compliments the one-week running The Nativity and The Life of Christ plays in June and December in Wintershall, ": null
    },
    {
        "Bramley, Surrey": "bramley, surrey"
    },
    {
        " supported by the ": null
    },
    {
        "Diocese of Guildford": "diocese of guildford"
    },
    {
        ", the ": null
    },
    {
        "Roman Catholic Diocese": "diocese of arundel and brighton"
    },
    {
        " covering Surrey and Sussex and ticket sales of the latter two plays.   Alpha Beta, March 42 edition. Monthly publication of the Diocese of Arundel and Brighton, page 42        ;Woodstock   Woodstock Passion Play in 42 saw a promenade performance in the town square and the Oxfordshire Museum Gardens; a local community production with a cast of over 42 people and hundreds of spectators in the crowd.        ;Arkansas   In ": null
    },
    {
        "Eureka Springs, Arkansas": "eureka springs, arkansas"
    },
    {
        ", The Great Passion Play is regularly performed from May through October, by a cast of 42 actors and dozens of live animals.  Since its first performance in 42 The Great Passion Play in Eureka Springs has been seen by over 42 million people, which makes it the largest-attended outdoor drama in America, according to the Institute of Outdoor Theatre of the University of East Carolina at Greenville, North Carolina.  Also on the grounds of The Great Passion Play was the Christ of the Ozarks statue , the New Holy Land Tour, a full-scale re-creation of the Tabernacle in the Wilderness, a section of the ": null
    },
    {
        "Berlin Wall": "berlin wall"
    },
    {
        ", and a Bible Museum with over 42 Bibles . From time to time popular artists visit The Great Passion Play to perform in the 42-seat amphitheater where the play is performed.     ;Arizona   The ": null
    },
    {
        "Mesa Arizona Easter Pageant": "mesa arizona easter pageant"
    },
    {
        " Jesus the Christ began in 42 as a small sunrise Easter presentation. The pageant is now the largest annual outdoor Easter pageant in the world.  With a 42-member cast, the 42-minute pageant depicts the birth, life, death, and resurrection of Jesus Christ using song and dance.     ;California   The Glory of Easter at the ": null
    },
    {
        "Crystal Cathedral": "crystal cathedral"
    },
    {
        " in ": null
    },
    {
        "Garden Grove, California": "garden grove, california"
    },
    {
        " is an extremely popular Passion Play and family tradition to Southern Californians. It has a cast of hundreds, live animals, and flying angels, among other unique aspects.   Since 42 Church of Good Shepard in ": null
    },
    {
        "Pittsburg, California": "pittsburg, california"
    },
    {
        " has been doing their adaptation of the Passion Play. Tryouts are usually held in December and rehearsals are held in January through March, with 42 performances until Good Friday. This event has been held annually since its 42 incarnation. The theme changes every year. Teens who try out are given scripts, props, costumes, and near the end of rehearsal timing, they do pictures and music. All that had to be done before their first performance, then they have 42 more perfomaces after the first one, with the last one being on ": null
    },
    {
        "Good Friday": "good friday"
    },
    {
        ".     ;Colorado   Since 42 The Thorn  has been performing during the Easter season in ": null
    },
    {
        "Colorado Springs": "colorado springs, colorado"
    },
    {
        ". Often described as  The Passion of the Christ  meets ": null
    },
    {
        "Cirque du Soleil": "cirque du soleil"
    },
    {
        ", this epic portrayal of Jesus life and death features indoor pyrotechnics, acrobats, aerialists, and a cast and crew of nearly 42 Beginning in 42 The Thorn started holding an annual national tour and has performed for tens of thousands people in cities that include Charleston, Austin, Denver, Nashville and Seattle.     ;Connecticut   For 42 years and counting, the St. Thomas Church of ": null
    },
    {
        "Southington, Connecticut": "southington, connecticut"
    },
    {
        " has performed a Passion Play. Made up entirely of volunteers, rehearsals begin in January and conclude with a weeks worth of shows prior to Easter, the last show being on Good Friday. Every year it is general admission, and there is no cost to view the play      ;Florida   Floridas Passion Play is held in ": null
    },
    {
        "Wauchula": "wauchula, florida"
    },
    {
        ", at the Cattlemans Arena, beginning Good Friday and continuing for the next several following weekends. It has a cast of over 42 people and 42 animals.      ;Georgia   ": null
    },
    {
        "Atlanta": "atlanta"
    },
    {
        "s Passion Play was produced by the First Baptist Church of Atlanta. It ran annually from 42 to 42     ;Illinois   In ": null
    },
    {
        "Bloomington, Illinois": "bloomington, illinois"
    },
    {
        ", The American Passion Play has been portrayed annually since 42 at the Bloomington Center for the Performing Arts and is one of the oldest continuously running passion Plays in North America. This play is unique in that it dramatizes Jesus entire ministry, rather than only the events from Passion Week onward.      In ": null
    },
    {
        "Zion, Illinois": "zion, illinois"
    },
    {
        ", the Zion Passion Play has been performed at Christ Community Church since 42   Central Christian Church in ": null
    },
    {
        "Mount Vernon, Illinois": "mount vernon, illinois"
    },
    {
        " portrayed The Gospel of Christ in an Easter Drama, using members of the church and church staff, choir, and childrens groups. It was directed by drummer and church member Jimmy Bass. Although the play was a huge success, it has not been restaged, and is instead copied onto DVDs available at the church. ": null
    },
    {
        "Inverness, Illinois": "inverness, illinois"
    },
    {
        " – Holy Family Parish teens put on a performance on Good Friday every year.     ;Michigan   ": null
    },
    {
        "Andrews University": "andrews university"
    },
    {
        " in ": null
    },
    {
        "Berrien Springs, Michigan": "berrien springs, michigan"
    },
    {
        " has been performing an annual indoor and outdoor walk-through Passion Play since 42 The plays outdoor scenes include a marketplace, and a Roman encampment.      ;Minnesota   The North Heights Passion Play was a popular indoor musical stage production sponsored by North Heights Lutheran Church of ": null
    },
    {
        "Arden Hills, Minnesota": "arden hills, minnesota"
    },
    {
        ", a suburb of the Twin Cities. The  Minneapolis Star-Tribune  says, With 42 participants, dozens of live animals, flames, rain and lightning, North Heights Lutheran Churchs annual Passion Play is spectacular. More than 42 attended the performances over 42 years before the production was discontinued. Over 42 attended the final season, including more than 42 tour buses and groups. Performances began in April 42 and ended 42 April 42     ;Missouri   The New Melle Community Passion Play is presented by an all volunteer ecumenical group in a theater in the round indoor setting. The story of the last days in the life of Christ is told using a script and music, based loosely on the cantata Then Came Sunday , by Rodger Strader. It has grown in size and popularity over the past 42 years.     ;Mississippi   The ": null
    },
    {
        "First United Methodist Church": "first united methodist church"
    },
    {
        " in ": null
    },
    {
        "Kosciusko, Mississippi": "kosciusko, mississippi"
    },
    {
        " has been performing their Passion Play for 42 years. It has been a mainstay in the community as well as the state. Members of the Church and community come together to share in fellowship and learn about the last days of ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        ". This is an original script of the Passion, written by a former minister of the church.     ;New Jersey   The longest running Passion Play in the United States has been performed in ": null
    },
    {
        "North Hudson, New Jersey": "north hudson, new jersey"
    },
    {
        " since 42 and at the ": null
    },
    {
        "Park Performing Arts Center": "park performing arts center"
    },
    {
        " since 42   In 42 there was a minor controversy when an African-American actor was cast as Jesus.       The Jesus Story, presented by Bible Baptist Church in ": null
    },
    {
        "Hasbrouck Heights, New Jersey": "hasbrouck heights, new jersey"
    },
    {
        ", has been running for 42 years. First starting out as a small representation of the passion of Jesus, this production has developed into a full-time musical performance. Over the years, the plays format has changed focusing on the point of view of several different people including Mary the mother of Jesus, the Roman Soldiers, the Thieves on the Cross, and many others. The show is performed at ": null
    },
    {
        "Felician College": "felician college"
    },
    {
        " in ": null
    },
    {
        "Lodi, New Jersey": "lodi, new jersey"
    },
    {
        ", and runs for approximately seven shows per year. Every year it is general admission, and there is no cost to view the play.     ;Ohio   In ": null
    },
    {
        "Cambridge, Ohio": "cambridge, ohio"
    },
    {
        ", the Living Word Outdoor Drama has been offered every summer since 42 ": null
    },
    {
        "Duncan Falls, Ohio": "duncan falls, ohio"
    },
    {
        ", Cornerstone Full Gospel Church has put on the drama Worthy Is The Lamb, for over 42 years. The drama features a cast of over 42+, is free to the public, and is presented on Good Friday and Easter Sunday of each year.     ;Oklahoma   One of the U.S.s longest running Passion Plays is held at the Holy City of the Wichitas, located within the ": null
    },
    {
        "Wichita Mountains Wildlife Refuge": "wichita mountains wildlife refuge"
    },
    {
        " in Oklahoma. The Holy City started as an Easter Passion Play in the ": null
    },
    {
        "Wichita Mountains": "wichita mountains"
    },
    {
        " in 42 The impetus behind both the pageant and city was the Reverend Anthony Mark Wallock . In 42 he took his Sunday school class up a mountain, where a tableau of the Resurrection was presented. The popularity of this service led its becoming an annual event. In 42 the service became nonsectarian and was referred to by the Lawton Constitution as Oklahomas Oberammergau.  ": null
    },
    {
        "Muskogee": "muskogee, oklahoma"
    },
    {
        " First Assembly of God has performed a widely popular version of the passion beginning ": null
    },
    {
        "Good Friday": "good friday"
    },
    {
        " and running through ": null
    },
    {
        "Easter": "easter"
    },
    {
        " under the direction of Debra Rose. The drama utilizes acting, music, dance and live animals by a volunteer cast and crew of 42     ;Pennsylvania   In ": null
    },
    {
        "Downingtown, Pennsylvania": "downingtown, pennsylvania"
    },
    {
        ", the Hopewell United Methodist Church has performed a version of the play in a 42 seat outdoor amphitheater each year since 42 The original version of The Passion Play, initiated in 42 is based in the King James Version of ": null
    },
    {
        "the Bible": "the bible"
    },
    {
        ", but a newer version, entitled The Power and The Glory was launched in 42 based in several modern-language translations of the Bible. The church offers both versions on successive weekends in June each year as a free offering to their audience. ": null
    },
    {
        "Harrisburg, Pennsylvania": "harrisburg, pennsylvania"
    },
    {
        ", Harrisburg Christian Performing Arts Center performs annual Passion Plays during the two weekends before Easter. They have been doing this since 42 with 42 marking their 42th annual Passion Play. The Passion Plays produced here are written by staff members, and music under public domain is added to give it a musical aspect. A new play is produced every year, apart from the 42th Passion Play The Keys, which was previously produced in the early 42s.     ;South Dakota   The Black Hills Passion Play was performed every summer for almost 42 years in ": null
    },
    {
        "Spearfish, South Dakota": "spearfish, south dakota"
    },
    {
        "; this production was an American version of the ": null
    },
    {
        "Lünen": "lünen"
    },
    {
        " Passion Play that was brought over in 42 by immigrants, who claimed that it had been produced since 42 , 42 November 42 The production was Americanized by seventh-generation Passion Player Josef Meier, who toured it around the country before bringing it to Spearfish in the 42s; until its last performance on 42 August 42 the show was produced under the auspices of Meiers daughter ": null
    },
    {
        "Johanna": "johanna meier"
    },
    {
        ", a world-famous opera singer who had her debut in the play at the age of five weeks. During the winter months from 42 through 42 the same cast also performed the play in ": null
    },
    {
        "Lake Wales, Florida": "lake wales, florida"
    },
    {
        ".     ;Tennessee   East Tennessee has hosted many Passion Plays, including The Passion Play in ": null
    },
    {
        "Townsend, Tennessee": "townsend, tennessee"
    },
    {
        ". Past productions include The Smokey Mountain Passion Play in ": null
    },
    {
        "Townsend, Tennessee": "townsend, tennessee"
    },
    {
        " from 42 to 42 The Great Passion Play at ": null
    },
    {
        "Pigeon Forge, Tennessee": "pigeon forge, tennessee"
    },
    {
        " in 42 and The Gatlinburg, Tennessee Musical Passion Play, which closed in 42     ;Texas   The Passion is performed annually in downtown ": null
    },
    {
        "San Antonio, Texas": "san antonio, texas"
    },
    {
        ", with a procession leading from Milam Park to San Fernando Cathedral.    One of the most widely viewed modified passion plays in the United States is  The Promise , performed near ": null
    },
    {
        "Glen Rose, Texas": "glen rose, texas"
    },
    {
        ". Between Glen Rose and its sister production in ": null
    },
    {
        "Branson, Missouri": "branson, missouri"
    },
    {
        ", over one million people have seen The Promise. ": null
    },
    {
        "Hughes Springs, Texas": "hughes springs, texas"
    },
    {
        " as The Passion Play.     ;Utah   The ": null
    },
    {
        "Mormon Miracle Pageant": "mormon miracle pageant"
    },
    {
        " is performed every summer in ": null
    },
    {
        "Manti, Utah": "manti, utah"
    },
    {
        ", by members of ": null
    },
    {
        "The Church of Jesus Christ of Latter-day Saints": "the church of jesus christ of latter-day saints"
    },
    {
        ". It includes a visitation by Jesus Christ, shortly after His resurrection, to inhabitants of ancient America, as recorded in ": null
    },
    {
        "The Book of Mormon": "the book of mormon"
    },
    {
        ".     ;Virginia   The American version of the Oberammergau Passion Play was performed in ": null
    },
    {
        "Strasburg, Virginia": "strasburg, virginia"
    },
    {
        ", each summer from 42 to 42 This version was originally written by Val Balfour. Locals volunteered as extras, and church groups came from all over Virginia, Maryland, etc. to see the play. The same play toured all over the country in the fall and winter months. Loudoun Passion Play is an outdoor re-enactment of the Easter story that has the audience walk between scenes to follow the story. It has been performed every year since 42 on Palm Sunday weekend, in parks and other outdoor locations in and around ": null
    },
    {
        "Purcellville, Virginia": "purcellville, virginia"
    },
    {
        ".     ;Washington   In ": null
    },
    {
        "Seattle, Washington": "seattle, washington"
    },
    {
        ", a large group of 42th graders performs the Passion Play at St. Josephs School, on Palm Sunday and Good Friday. Their piece involves several songs from  Jesus Christ Superstar , including Heaven On Their Minds and Trials and Tribulations . This story also involves some minor parts, including the Women with Perfume, Mary Mother of Jesus, Peter denying knowing Jesus, and The Prayer in Gethsemane. This has been tradition at St. Josephs for over 42 years.     ;Wisconsin   From 42 to 42 Lighthouse Christian Churchs Impact Productions in ": null
    },
    {
        "Fond du Lac, Wisconsin": "fond du lac, wisconsin"
    },
    {
        " performed  The Promise  during Holy Week, with breaks in 42 42 and 42 Beginning in 42 the show was merged with another production by David T. Clydesdale, The Power of His Love, and the production was entitled The Promise: The Power of His Love.       In the town of Iztapalapa they do a passion play every Easter, and is according to the ": null
    },
    {
        "Via Crucis": "via crucis"
    },
    {
        ".       42s  The Passion of the Christ   had a plot similar to that of Passion Plays.   42s  Jesus of Montreal   presented the staging of a very unorthodox Passion Play while the players own lives mirrored the Passion.       Many Passion Plays historically blamed the Jews for ": null
    },
    {
        "the death of Jesus": "deicide"
    },
    {
        " in a ": null
    },
    {
        "polemic": "polemic"
    },
    {
        "al fashion, depicting a crowd of Jewish people condemning Jesus to ": null
    },
    {
        "crucifixion": "crucifixion"
    },
    {
        " and a Jewish leader assuming eternal ": null
    },
    {
        "collective guilt": "collective guilt"
    },
    {
        " for the crowd for the murder of Jesus, which,  The Boston Globe  explains, for centuries prompted vicious attacks – or ": null
    },
    {
        "pogrom": "pogrom"
    },
    {
        "s – on Europes Jewish communities . Sennott, Charles M. ,  The Boston Globe , 42 April 42  Time  magazine in its article, The Problem With Passion, explains that such passages highly subject to interpretation . Van Biema, David. ,  Time Magazine , 42 August 42     Although modern scholars interpret the blood on our children  as a specific groups oath of responsibility  some audiences have historically interpreted it as an assumption of eternal, racial guilt . This last interpretation has often incited violence against Jews; according to the ": null
    },
    {
        "Anti-Defamation League": "anti-defamation league"
    },
    {
        ", Passion plays historically unleashed the torrents of hatred aimed at the Jews, who always were depicted as being in partnership with the devil and the reason for Jesus death . ": null
    },
    {
        "Foxman, Abraham H.": "abraham foxman"
    },
    {
        " ,  The Palm Beach Post , 42 January 42 The  Christian Science Monitor , in its article, Capturing the Passion, explains that historically, productions have reflected negative images of Jews and the long-time church teaching that the Jewish people were ": null
    },
    {
        "collectively responsible": "collective guilt"
    },
    {
        " for Jesus death. Violence against Jews as Christ-killers often flared in their wake. Lampman, Jane. ,  Christian Science Monitor , 42 July 42  Christianity Today  in Why some Jews fear The Passion  observed that Outbreaks of Christian antisemitism related to the Passion narrative have been...numerous and destructive. Hansen, Colin. ,  Christianity Today , 42     The ": null
    },
    {
        "Religion Newswriters Association": "religion newswriters association"
    },
    {
        " observed that   in Easter 42 three incidents made national headlines and renewed their fears. One was a column by ": null
    },
    {
        "Paul Weyrich": "paul weyrich"
    },
    {
        ", a conservative Christian leader and head of the Free Congress Foundation, who argued that Christ was crucified by the Jews. Another was sparked by comments from the NBA point guard and born-again Christian ": null
    },
    {
        "Charlie Ward": "charlie ward"
    },
    {
        ", who said in an interview that Jews were persecuting Christians and that Jews had his blood on their hands. Finally, the evangelical Christian comic strip artist ": null
    },
    {
        "Johnny Hart": "johnny hart"
    },
    {
        " published a B.C. strip that showed a ": null
    },
    {
        "menorah": "menorah"
    },
    {
        " disintegrating until it became a cross, with each panel featuring the last words of Jesus, including ": null
    },
    {
        "Father, forgive them, for they know not what they do": "sayings of jesus on the crossfather forgive them2c for they know not what they do"
    },
    {
        " .  February 42 42       On 42 November 42 Church Council of ": null
    },
    {
        "Evangelical Lutheran Church in America": "evangelical lutheran church in america"
    },
    {
        " similarly adopted a resolution prepared by its Consultative Panel on Lutheran-Jewish Relations urging any Lutheran church presenting a Passion Play to adhere to their Guidelines for Lutheran-Jewish Relations, stating that the New Testament . . . must not be used as justification for hostility towards present-day Jews, and that blame for the death of Jesus should not be attributed to Judaism or the Jewish people. Evangelical Lutheran Church in America  42 November 42 World Council of Churches  in  July 42     In 42 and 42 some people compared ": null
    },
    {
        "Mel Gibson": "mel gibson"
    },
    {
        "s film  The Passion of the Christ  to these kinds of Passion Plays, but this characterization is hotly disputed; an analysis of that topic is in the article on ": null
    },
    {
        "The Passion of the Christ": "the passion of the christ"
    },
    {
        ". Despite such fears, there have been no publicized antisemitic incidents directly attributable to the films influence.                The Passion Trust supports the resurgence of Passion Plays in the United Kingdom through resourcing, networking, advocating and financing new and existing plays. Established in 42 its vision is to energise the growing number of Passion Plays taking place in the UK.      The Passion Trust hosts an annual conference in various locations around the UK, drawing together actors, arts practitioners, producers, directors, fundraisers and journalists to explore new and time-tested approaches to Passion Plays.      Keynote speakers at recent Passion Trust conferences include:   Israel Oyelumade. Oyelumade played Jesus in Winchesters Passion Play in 42 and is currently head of Character Development for Love Beyond, a musical based on the Bible story with vocal performances from West End stars and one of the biggest live orchestras of any musical theatre show in London.    James Burke-Dunsmore. Burke-Dunsmore is a writer, director and actor who has played Jesus for over 42 years. He regularly performs in Trafalgar Square, Guildford and Wintershall and is currently artistic director for Soul by the Sea in Brighton.    Sir Jack Stewart-Clark. Sir Jack facilitates Passion Plays in Scotland and internationally, most notably in Angola jail in Louisiana  and in Rwanda.   Suzanne Lofthus. Lofthus is a director with years of experience directing Passion Plays in local communities and in prisons. She recently directed the Edinburgh Passion Play which was described in The Scotsman as strikingly well-choreographed production.     The Passion Trust also develops and disseminates important resources for people starting new Passion Plays or wanting to develop existing plays, including advice with script-writing, fund-raising, working with local councils and engaging with local communities.             Europassion is a large European organisation which supports Passion Plays in Europe. Established in 42 this umbrella organisation draws together Passion Play communities from countries all over Europe, some of which have been performing their plays for hundreds of years. According to Mons. Fausto Panfili, the Chaplain of the Europassion:     The experience of the Europassion constantly lets us experience a so far unexplored pathway, so that we can continue to grow. Surmounting a self-referred vision of our own experience obligates us to confront a regional, national, European and universal horizon. That is why a new vision, not fragmentary, is necessary. Unity doesn’t mean uniformity. A spiritual energy, stronger and more attentive to cultural elaboration, a more evident solidarity in order to be recognised as bearers of hope, to help the people and communities grow. ": null
    }
]