[
    {
        "                Pasta  is a type of Italian ": null
    },
    {
        "food": "food"
    },
    {
        " typically made from an ": null
    },
    {
        "unleavened": "unleavened"
    },
    {
        " dough": "dough"
    },
    {
        " of ": null
    },
    {
        "durum wheat": "durum wheat"
    },
    {
        " flour  mixed with water or eggs, and formed into sheets or various shapes, then cooked by ": null
    },
    {
        "boiling": "boiling"
    },
    {
        " or ": null
    },
    {
        "baking": "baking"
    },
    {
        ". ": null
    },
    {
        "Rice flour": "rice flour"
    },
    {
        ", or ": null
    },
    {
        "legumes": "legumes"
    },
    {
        " such as beans or ": null
    },
    {
        "lentils": "lentils"
    },
    {
        ", are sometimes used in place of ": null
    },
    {
        "wheat flour": "wheat flour"
    },
    {
        " to yield a different taste and texture, or as a ": null
    },
    {
        "gluten-free": "gluten-free diet"
    },
    {
        " alternative. Pasta is a ": null
    },
    {
        "staple food": "staple food"
    },
    {
        " of ": null
    },
    {
        "Italian cuisine": "italian cuisine"
    },
    {
        ".       Pastas are divided into two broad categories: dried  and fresh . Most dried pasta is produced commercially via an ": null
    },
    {
        "extrusion": "food extrusion"
    },
    {
        " process, although it can be produced at home. Fresh pasta is traditionally produced by hand, sometimes with the aid of simple machines. Hazan, Marcella Essentials of Classic Italian Cooking, Knopf,  Fresh pastas available in grocery stores are produced commercially by large-scale machines.       Both dried and fresh pastas come in a number of shapes and varieties, with 310 specific forms known by over 1300 documented names. Zanini De Vita, Oretta, Encyclopedia of Pasta, ": null
    },
    {
        "University of California Press": "university of california press"
    },
    {
        ",  In Italy, the names of specific pasta shapes or types often vary by locale. For example, the pasta form  cavatelli  is known by 28 different names depending upon the town and region. Common forms of pasta include long and short shapes, tubes, flat shapes or sheets, miniature shapes for soup, those meant to be filled or stuffed, and specialty or decorative shapes. Hazan, Giuliano The Classic Pasta Cookbook, Dorling Kindersley,        As a category in ": null
    },
    {
        "Italian cuisine": "italian cuisine"
    },
    {
        ", both fresh and dried pastas are classically used in one of three kinds of prepared dishes: as pasta asciutta , cooked pasta is plated and served with a complementary side sauce or condiment; a second classification of pasta dishes is pasta in brodo, in which the pasta is part of a ": null
    },
    {
        "soup": "soup"
    },
    {
        "-type dish. A third category is pasta al forno, in which the pasta is incorporated into a dish that is subsequently baked in the oven.  Pasta dishes are generally simple, but individual dishes vary in preparation. Some pasta dishes are served as a small ": null
    },
    {
        "first course": "course"
    },
    {
        " or for light lunches, such as ": null
    },
    {
        "pasta salad": "pasta salad"
    },
    {
        "s. Other dishes may be portioned larger and used for dinner. Pasta ": null
    },
    {
        "sauces": "sauce"
    },
    {
        "similarly may vary in taste, color and texture.        In terms of ": null
    },
    {
        "nutrition": "human nutrition"
    },
    {
        ", cooked plain pasta is 31% ": null
    },
    {
        "carbohydrates": "carbohydrate"
    },
    {
        " , 6% protein, and low in fat, with moderate amounts of ": null
    },
    {
        "manganese": "manganese"
    },
    {
        ", but pasta generally has low ": null
    },
    {
        "micronutrient": "micronutrient"
    },
    {
        " content. Pasta may be ": null
    },
    {
        "enriched or fortified": "food fortification"
    },
    {
        ", or made from ": null
    },
    {
        "whole grain": "whole grain"
    },
    {
        "s.       First attested in English in 1874, the word pasta comes from ": null
    },
    {
        "Italian": "italian language"
    },
    {
        " pasta, in turn from ": null
    },
    {
        "Latin": "latin"
    },
    {
        " pasta, ": null
    },
    {
        "latinisation": "latinisation"
    },
    {
        " of the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " παστά  barley ": null
    },
    {
        "porridge": "porridge"
    },
    {
        " .          In the 1st century AD writings of ": null
    },
    {
        "Horace": "horace"
    },
    {
        ",  lagana   were fine sheets of fried dough and were an everyday foodstuff. Writing in the 2nd century ": null
    },
    {
        "Athenaeus of Naucratis": "athenaeus of naucratis"
    },
    {
        " provides a recipe for lagana which he attributes to the 1st century Chrysippus of Tyana: sheets of dough made of wheat flour and the juice of crushed lettuce, then flavoured with spices and deep-fried in oil. An early 5th century cookbook describes a dish called lagana that consisted of layers of dough with meat stuffing, an ancestor of modern-day  lasagna . However, the method of cooking these sheets of dough does not correspond to our modern definition of either a fresh or dry pasta product, which only had similar basic ingredients and perhaps the shape. The first concrete information concerning pasta products in Italy dates from the 13th or 14th century.     Historians have noted several lexical milestones relevant to pasta, none of which changes these basic characteristics. For example, the works of the 2nd century AD Greek physician ": null
    },
    {
        "Galen": "galen"
    },
    {
        " mention itrion, homogeneous compounds made of flour and water. The ": null
    },
    {
        "Jerusalem Talmud": "jerusalem talmud"
    },
    {
        " records that itrium, a kind of boiled dough, was common in ": null
    },
    {
        "Palestine": "syria palaestina"
    },
    {
        " from the 3rd to 5th centuries AD. A dictionary compiled by the 9th century Arab physician and lexicographer Isho bar Ali A medical text in Arabic written by a Jewish doctor living in Tunisia in the early 900s , according to  defines itriyya, the Arabic cognate, as string-like shapes made of ": null
    },
    {
        "semolina": "semolina"
    },
    {
        " and dried before cooking. The geographical text of ": null
    },
    {
        "Muhammad al-Idrisi": "muhammad al-idrisi"
    },
    {
        ", compiled for the Norman King of Sicily ": null
    },
    {
        "Roger II": "roger ii of sicily"
    },
    {
        " in 1154 mentions itriyya manufactured and exported from Norman Sicily:          One form of itriyya with a long history is laganum , which in Latin refers to a thin sheet of dough, and gives rise to Italian lasagna.           In ": null
    },
    {
        "North Africa": "north africa"
    },
    {
        ", a food similar to pasta, known as ": null
    },
    {
        "couscous": "couscous"
    },
    {
        ", has been eaten for centuries. However, it lacks the distinguishing malleable nature of pasta, couscous being more akin to droplets of dough. At first, dry pasta was a luxury item in Italy because of high labor costs; durum wheat semolina had to be kneaded for a long time.     There is a legend of ": null
    },
    {
        "Marco Polo": "marco polo"
    },
    {
        " importing pasta from ": null
    },
    {
        "China": "china"
    },
    {
        " . National Pasta Association: The story that it was Marco Polo who imported noodles to Italy and thereby gave birth to the countrys pasta culture is the most pervasive myth in the history of Italian food. . which originated with the Macaroni Journal, published by an association of food industries with the goal of promoting pasta in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ". ": null
    },
    {
        "Rustichello da Pisa": "rustichello da pisa"
    },
    {
        " writes in his  Travels  that Marco Polo described a food similar to lagana . ": null
    },
    {
        "Jeffrey Steingarten": "jeffrey steingarten"
    },
    {
        " asserts that ": null
    },
    {
        "Arabs": "arab people"
    },
    {
        " introduced pasta in the ": null
    },
    {
        "Emirate of Sicily": "emirate of sicily"
    },
    {
        " in the ninth century, mentioning also that traces of pasta have been found in ancient Greece and that ": null
    },
    {
        "Jane Grigson": "jane grigson"
    },
    {
        " believed the Marco Polo story to have originated in the 1920s or 30s in an advertisement for a Canadian spaghetti company.      In Greek mythology, it is believed that the god Hephaestus invented a device that made strings of dough. This was the earliest reference to a pasta maker.  /ref ref name Diana Viola  /ref ref name Demetri  /ref  ref  /ref ref name Diana Viola /  ref name something-else  /ref  ref namesomething-else/  ref namesomething-else/  ref name tésztáklexikona  /ref  ref  /ref  ref namesomething-else/ ref  /ref ref name praharadio  /ref ref  /ref  ref name lifeinitaly.com  /ref ref name lifeinitaly.com /  ref  /ref  ref name Zanini /  ref name VriezingaSchweizer2015  /ref  ref name FerreiraDeMello  /ref ref name PadalinoMastromatteo  /ref ref name Zanini /  ref  /ref  gallery mode packed heights 180px  /gallery ref name Quessenberry  /ref ref name Christensen  /ref  ref name Quessenberry /  ref name Laux  /ref ref name Laux /  ref name Christensen /  ref name Quessenberry /  ref  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref name Sicignano  /ref ref name wg  /ref  ref name :0  /ref  ref  /ref  ref name Gao et al 2017  /ref  ref name Gao et al 2017 / ref  /ref ref nameSicignano/ ref  /ref ref name :1  /ref ref  /ref ref name :1 / ref namewg/ ref namewg/ ref name :0 / ref name shewry1  /ref ref nameshewry1/ ref nameshewry1/ ref name :3  /ref ref name :4  /ref ref namewg/ ref name :5  /ref ref name :5 / ref namewg/ ref name :5 / ref nameshewry1/ ref name :5 /  ref  /ref ref name ipo  /ref ref name wte  /ref  ref nameipo/  ref name fb  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref ref  /ref  ref  /ref gallery ": null
    }
]