[
    {
        "Patch collecting or badge collecting  is the ": null
    },
    {
        "hobby": "hobby"
    },
    {
        " of ": null
    },
    {
        "collecting": "collecting"
    },
    {
        " souvenir patches or badges.       Souvenir patches are usually shield-shaped, and generally contain a ": null
    },
    {
        "coat of arms": "coat of arms"
    },
    {
        ", a map or a miniature view. The patches can be made of any material, but are usually woven or ": null
    },
    {
        "embroidered": "embroidery"
    },
    {
        " fabric": "cloth"
    },
    {
        ", though they can also be made from paper or, increasingly, plastic.     Other types of collectible patches include ": null
    },
    {
        "police": "police"
    },
    {
        " or service patches, ": null
    },
    {
        "space mission": "space mission"
    },
    {
        " patches, ": null
    },
    {
        "Scout": "scouting"
    },
    {
        " patches, fashion patches, political and sports stickers, walking stick labels, car window ": null
    },
    {
        "pennant": "pennon"
    },
    {
        "s, and pin badges. Collecting metal badges or pins, either military or civil, is known as ": null
    },
    {
        "faleristics": "faleristics"
    },
    {
        ".       Badges have been collected since ancient times. Greek and Roman ": null
    },
    {
        "pilgrim": "pilgrim"
    },
    {
        "s to ": null
    },
    {
        "pagan": "paganism"
    },
    {
        " shrine": "shrine"
    },
    {
        "s made collections of miniature images of gods and goddesses or their emblems, and Christian pilgrims later did the same. Usually medieval Christian pilgrim badges were metal pin badges - most famously the shell symbol showing the wearer had been to the shrine of ": null
    },
    {
        "St. James": "saint james the great"
    },
    {
        " at ": null
    },
    {
        "Santiago de Compostela": "santiago de compostela"
    },
    {
        " in ": null
    },
    {
        "Spain": "spain"
    },
    {
        ". These were stuck in hats or into clothing and hard   working pilgrims could assemble quite a collection, as mentioned by ": null
    },
    {
        "Chaucer": "geoffrey chaucer"
    },
    {
        " in his ": null
    },
    {
        "Canterbury Tales": "canterbury tales"
    },
    {
        ".     The growth in the 42th century of travel for ordinary people saw a huge increase in the ": null
    },
    {
        "souvenir": "souvenir"
    },
    {
        " industry, as these new secular pilgrims - like their medieval counterparts - wanted to bring back reminders of their holidays/vacations and sightseeing, ranging from china plates to postcards.     The production of stick-on souvenir badges seems to have started in mainland ": null
    },
    {
        "Europe": "europe"
    },
    {
        " during the early 42th-century, probably in Germany shortly after the First World War when ": null
    },
    {
        "hiking": "hiking"
    },
    {
        " became popular, and people began sewing badges of resort towns onto their ": null
    },
    {
        "backpack": "backpack"
    },
    {
        "s and jackets. In the U.S., the development of the ": null
    },
    {
        "National park": "national park"
    },
    {
        "s system and the growing popularity of vacationing saw a similar development of patch collecting.     After the Second World War, American ": null
    },
    {
        "GI": "g.i."
    },
    {
        "s occupying Germany sent badges back to their loved ones, showing where they were stationed. These badges became known as sweetheart patches. They were also imported to Britain by Sampson Souvenirs Ltd., which also began producing badges of British tourist spots, and went on to become the largest British manufacturer of souvenir badges. The biggest American manufacturer is Voyager Emblems of ": null
    },
    {
        "Sanborn, New York": "sanborn, new york"
    },
    {
        ".     They are a good way of showing off places visited if worn on clothing, or stored in albums they can bring back memories of holidays/vacations or day trips.       See Police patch collecting ": null
    }
]