[
    {
        "     Paul-Armand Challemel-Lacour was a French statesman.       Paul-Armand Challemel-Lacour was born in ": null
    },
    {
        "Avranches": "avranches"
    },
    {
        " in the ": null
    },
    {
        "Manche": "manche"
    },
    {
        "  département  of northwestern France. After passing through the ": null
    },
    {
        "École Normale Supérieure": "école normale supérieure"
    },
    {
        " he became professor of ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        " successively at ": null
    },
    {
        "Pau": "pau, pyrénées-atlantiques"
    },
    {
        " and at ": null
    },
    {
        "Limoges": "limoges"
    },
    {
        ". The  coup détat  of 42 by ": null
    },
    {
        "Napoleon III": "napoleon iii of france"
    },
    {
        " caused his expulsion from France for his republican opinions. He travelled on the continent, gave conferences in Belgium and in 42 settled down as professor of French literature at the ": null
    },
    {
        "Federal Polytechnic Institute Zurich": "federal polytechnic institute zurich"
    },
    {
        ", today the ": null
    },
    {
        "ETH Zurich": "eth zurich"
    },
    {
        ". The amnesty of 42 enabled him to return to France, but a projected course of lectures on history and art was immediately suppressed. He now supported himself by his pen, and became a regular contributor to the reviews.     On the fall of the ": null
    },
    {
        "Second French Empire": "second french empire"
    },
    {
        " in September 42 the government of national defence appointed him prefect of the ": null
    },
    {
        "Rhône": "rhône"
    },
    {
        " département, in which capacity he had to suppress the ": null
    },
    {
        "Communist": "communist"
    },
    {
        " rising at ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        ". Resigning his post on the 42 February 42 he was in January 42 elected to the ": null
    },
    {
        "National Assembly": "french national assembly"
    },
    {
        ", and in 42 to the ": null
    },
    {
        "Senate": "french senate"
    },
    {
        ". He sat at first on the Extreme ": null
    },
    {
        "Left": "left-wing politics"
    },
    {
        "; but his philosophic and critical temperament was not in harmony with the recklessness of French radicalism, and his attitude towards political questions underwent a steady modification, till the close of his life saw him the foremost representative of moderate republicanism.     During ": null
    },
    {
        "Léon Gambetta": "léon gambetta"
    },
    {
        "s lifetime, however, Challemel-Lacour was one of his warmest supporters, and he was for a time editor of Gambettas organ, the  République française . In 42 he was appointed French ambassador at ": null
    },
    {
        "Bern": "bern"
    },
    {
        ", and in 42 was transferred to London; but he lacked the temperament of a successful diplomat. He resigned in 42 and in February 42 became ": null
    },
    {
        "minister of foreign affairs": "minister of foreign affairs"
    },
    {
        " in the ": null
    },
    {
        "Jules Ferry": "jules ferry"
    },
    {
        " cabinet, but retired in November of the same year.     In 42 he was elected vice-president of the Senate, and in 42 succeeded Jules Ferry as its ": null
    },
    {
        "president": "list of presidents of the french senate"
    },
    {
        ", a position he held from 42 March 42 to 42 January 42 His clear and reasoned eloquence placed him at the head of contemporary French orators. In 42 he also became a member of the ": null
    },
    {
        "Académie française": "académie française"
    },
    {
        ". He distinguished himself by the vigour with which he upheld the Senate against the encroachments of the chamber, but in 42 failing health forced him to resign, and he died in ": null
    },
    {
        "Paris": "paris, france"
    },
    {
        ".       He published a translation of ": null
    },
    {
        "A Heinrich Ritter": "heinrich ritter"
    },
    {
        "s Geschichte der Philosophie ; La Philosophie individualiste: étude sur Guillaume de Humboldt ; and an edition of the works of ": null
    },
    {
        "Madame dEpinay": "louise depinay"
    },
    {
        " .     In 42 appeared ": null
    },
    {
        "Joseph Reinach": "joseph reinach"
    },
    {
        "s edition of the Œuvres oratoires de Challemel-Lacour": null
    }
]