[
    {
        "     Paul Benjamin Auster is an American writer and film director. His notable works include  The New York Trilogy  ,  Moon Palace  ,  The Music of Chance  ,  The Book of Illusions  ,  The Brooklyn Follies  , Invisible , Sunset Park ,  Winter Journal  , and  4 3 2 1  . His books have been translated into more than forty languages.        Paul Auster was born in ": null
    },
    {
        "Newark, New Jersey": "newark, new jersey"
    },
    {
        ", Freeman, John.  ,  The Jerusalem Post , April 3, 2008. Retrieved September 19, 2008. Like so many people in New York, both of them are spiritual refugees of a sort. Auster hails from Newark, New Jersey, and Hustvedt from Minnesota, where she was raised the daughter of a professor, among a clan of very tall siblings. to ": null
    },
    {
        "Jew": "jew"
    },
    {
        "ish middle-class parents of ": null
    },
    {
        "Polish": "poles"
    },
    {
        " descent, Queenie and Samuel Auster.   He grew up in ": null
    },
    {
        "South Orange, New Jersey": "south orange, new jersey"
    },
    {
        " Begley, Adam. ,  The New York Times , August 30, 1992. Retrieved September 19, 2008. The grandson of first-generation Jewish immigrants, he was born in Newark in 1947, grew up in South Orange and attended high school in Maplewood, 20 miles southwest of New York. and ": null
    },
    {
        "Newark": "newark, new jersey"
    },
    {
        " Auster, Paul. Winter Journal , p. 61. and graduated from ": null
    },
    {
        "Columbia High School": "columbia high school"
    },
    {
        " in ": null
    },
    {
        "Maplewood": "maplewood, new jersey"
    },
    {
        ". Freeman, Hadley. ,  The Guardian , October 26, 2002. Retrieved September 19, 2008. Education: Columbia High School, New Jersey; 1965–69 Columbia College, New York; 69–70 Columbia University, New York       After graduating from ": null
    },
    {
        "Columbia University": "columbia university"
    },
    {
        " with B.A. and M.A. degrees in 1970, he moved to Paris, France where he earned a living translating French literature. Since returning to the U.S. in 1974, he has published poems, essays, and novels, as well as translations of French writers such as ": null
    },
    {
        "Stéphane Mallarmé": "stéphane mallarmé"
    },
    {
        " and ": null
    },
    {
        "Joseph Joubert": "joseph joubert"
    },
    {
        ".        Following his acclaimed debut work, a memoir entitled  The Invention of Solitude , Auster gained renown for a series of three loosely connected stories published collectively as  The New York Trilogy . Although these books allude to the detective genre they are not conventional detective stories organized around a mystery and a series of clues. Rather, he uses the detective form to address ": null
    },
    {
        "existential": "existentialism"
    },
    {
        " issues and questions of identity, space, language, and literature, creating his own distinctively ": null
    },
    {
        "postmodern": "postmodernism"
    },
    {
        " form in the process. According to Auster, ...the Trilogy grows directly out of The Invention of Solitude. Mallia, Joseph. , ": null
    },
    {
        "BOMB Magazine": "bomb magazine"
    },
    {
        " , Spring, 1988.     The search for identity and personal meaning has permeated Austers later publications, many of which concentrate heavily on the role of coincidence and random events  or increasingly, the relationships between people and their peers and environment . Austers heroes often find themselves obliged to work as part of someone elses inscrutable and larger-than-life schemes. In 1995, Auster wrote and co-directed the films  Smoke   and  Blue in the Face . Austers more recent works, from  Oracle Night  to 4 3 2 1 , have also met with critical acclaim.     He was on the ": null
    },
    {
        "PEN American Center": "pen american center"
    },
    {
        " Board of Trustees from 2004 to 2009,   and Vice President during 2005 to 2007.       In 2012, Auster was quoted as saying in an interview that he would not visit ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ", in protest of its treatment of journalists. The Turkish Prime Minister ": null
    },
    {
        "Recep Tayyip Erdoğan": "recep tayyip erdoğan"
    },
    {
        " replied: As if we need you! Who cares if you come or not?  Auster responded: According to the latest numbers gathered by International PEN, there are nearly one hundred writers imprisoned in Turkey, not to speak of independent publishers such as ": null
    },
    {
        "Ragıp Zarakolu": "ragıp zarakolu"
    },
    {
        ", whose case is being closely watched by PEN Centers around the world .      Austers most recent book, A Life in Words, was published in October 2017 by ": null
    },
    {
        "Seven Stories Press": "seven stories press"
    },
    {
        ". It brings together three years of conversations with the Danish scholar I.B. Siegumfeldt about each one of his works, both fiction and non-fiction. It is a primary source for understanding Austers approach to his work.      Auster is willing to give Iranian translators permission to write Persian versions of his works in exchange for a small fee; Iran does not recognize international copyright laws.        Much of the early scholarship about Austers work saw links between it and the theories of such French writers as ": null
    },
    {
        "Jacques Lacan": "jacques lacan"
    },
    {
        ", ": null
    },
    {
        "Jacques Derrida": "jacques derrida"
    },
    {
        ", and others. Auster himself has denied these influences and has asserted in print that Ive read only one short essay by Lacan, the Purloined Letter, in the Yale French Studies issue on poststructuralism—all the way back in 1966.  Other scholars have seen influences in Austers work of the American transcendentalists of the nineteenth century, as exemplified by ": null
    },
    {
        "Henry David Thoreau": "henry david thoreau"
    },
    {
        " and ": null
    },
    {
        "Ralph Waldo Emerson": "ralph waldo emerson"
    },
    {
        ". The transcendentalists believed that the symbolic order of civilization has separated us from the natural order of the world, and that by moving into nature, as Thoreau did, as he described in  Walden , it would be possible to return to this natural order.     ": null
    },
    {
        "Edgar Allan Poe": "edgar allan poe"
    },
    {
        ", ": null
    },
    {
        "Samuel Beckett": "samuel beckett"
    },
    {
        ", and ": null
    },
    {
        "Nathaniel Hawthorne": "nathaniel hawthorne"
    },
    {
        " have also had a strong influence on Austers writing. Auster has specifically referred to characters from Poe and Hawthorne in his novels, for example ": null
    },
    {
        "William Wilson": "william wilson"
    },
    {
        " in City of Glass or Hawthornes ": null
    },
    {
        "Fanshawe": "fanshawe"
    },
    {
        " in The Locked Room, both from  The New York Trilogy .     Paul Austers reappearing subjects are: Dennis Barone : Beyond the Red Notebook. Essays on Paul Auster. Penn Studies in Contemporary American Fiction. University of Pennsylvania Press, Philadelphia   coincidence   frequent portrayal of an ": null
    },
    {
        "ascetic life": "asceticism"
    },
    {
        " Das Motiv des Scheiterns in Paul Austers City of Glass und Music of Chance . unpublished MA dissertation, Christian-Albrechts Universität Kiel, 1998   absence of a father   writing and story telling, ": null
    },
    {
        "metafiction": "metafiction"
    },
    {
        " intertextuality": "intertextuality"
    },
    {
        " Michael Dirda": "michael dirda"
    },
    {
        " in  The New York Review of Books  in 2008, Paul Auster has established one of the most distinctive niches in contemporary literature.  Dirda also has extolled his loaded virtues in  The Washington Post :     Ever since City of Glass, the first volume of his New York Trilogy, Auster has perfected a limpid, confessional style, then used it to set disoriented heroes in a seemingly familiar world gradually suffused with mounting uneasiness, vague menace and possible hallucination. His plots – drawing on elements from suspense stories, existential récit, and autobiography – keep readers turning the pages, but sometimes end by leaving them uncertain about what theyve just been through.      Writing about Austers most recent novel, 4 3 2 1, Booklist critic Donna Seaman remarked: Auster has been turning readers heads for three decades, bending the conventions of storytelling, blurring the line between fiction and autobiography, infusing novels with literary and cinematic allusions, and calling attention to the art of storytelling itself, not with cool, intellectual remove, but rather with wonder, gratitude, daring, and sly humor. ... Austers fiction is rife with cosmic riddles and rich in emotional complexity. He now presents his most capacious, demanding, eventful, suspenseful, erotic, structurally audacious, funny, and soulful novel to date. ... Auster is conducting a grand experiment, not only in storytelling, but also in the endless nature-versus-nurture debate, the perpetual dance between inheritance and free will, intention and chance, dreams and fate. This elaborate investigation into the big what-if is also a mesmerizing dramatization of the multitude of clashing selves we each harbor within. ... A paean to youth, desire, books, creativity, and unpredictability, it is a four-faceted bildungsroman and an ars poetica, in which Auster elucidates his devotion to literature and art. He writes, To combine the strange with the familiar: that was what Ferguson aspired to, to observe the world as closely as the most dedicated realist and yet to create a way of seeing the world through a different, slightly distorting lens. Auster achieves this and much more in his virtuoso, magnanimous, and ravishing opus.      The English critic ": null
    },
    {
        "James Wood": "james wood"
    },
    {
        ", however, offered Auster little praise:     Clichés, borrowed language, bourgeois bêtises are intricately bound up with modern and postmodern literature. For Flaubert, the cliché and the received idea are beasts to be toyed with and then slain. Madame Bovary actually italicizes examples of foolish or sentimental phrasing. Charles Bovarys conversation is likened to a pavement, over which many people have walked; twentieth-century literature, violently conscious of mass culture, extends this idea of the self as a kind of borrowed tissue, full of other peoples germs. Among modern and postmodern writers, Beckett, Nabokov, Richard Yates, Thomas Bernhard, Muriel Spark, Don DeLillo, Martin Amis, and David Foster Wallace have all employed and impaled cliché in their work. Paul Auster is probably Americas best-known postmodern novelist; his New York Trilogy must have been read by thousands who do not usually read avant-garde fiction. Auster clearly shares this engagement with mediation and borrowedness—hence, his cinematic plots and rather bogus dialogue—and yet he does nothing with cliché except use it. This is bewildering, on its face, but then Auster is a peculiar kind of postmodernist. Or is he a postmodernist at all? Eighty per cent of a typical Auster novel proceeds in a manner indistinguishable from American realism; the remaining twenty per cent does a kind of postmodern surgery on the eighty per cent, often casting doubt on the veracity of the plot. Nashe, in The Music of Chance , sounds as if he had sprung from a Raymond Carver story ... One reads Austers novels very fast, because they are lucidly written, because the grammar of the prose is the grammar of the most familiar realism , and because the plots, full of sneaky turns and surprises and violent irruptions, have what the Times once called all the suspense and pace of a bestselling thriller. There are no semantic obstacles, lexical difficulties, or syntactical challenges. The books fairly hum along. The reason Auster is not a realist writer, of course, is that his larger narrative games are anti-realist or surrealist.     Wood also bemoaned Austers b-movie dialogue, absurdity, shallow skepticism, fake realism and balsa-wood backstories. Wood highlighted what he saw as the issues in Austers fiction in a parody:     Roger Phaedo had not spoken to anyone for ten years. He confined himself to his Brooklyn apartment, obsessively translating and retranslating the same short passage from Rousseaus Confessions. A decade earlier, a mobster named Charlie Dark had attacked Phaedo and his wife. Phaedo was beaten to within an inch of his life; Mary was set on fire, and survived just five days in the I.C.U. By day, Phaedo translated; at night, he worked on a novel about Charlie Dark, who was never convicted. Then Phaedo drank himself senseless with Scotch. He drank to drown his sorrows, to dull his senses, to forget himself. The phone rang, but he never answered it. Sometimes, Holly Steiner, an attractive woman across the hall, would silently enter his bedroom, and expertly rouse him from his stupor. At other times, he made use of the services of Aleesha, a local hooker. Aleeshas eyes were too hard, too cynical, and they bore the look of someone who had already seen too much. Despite that, Aleesha had an uncanny resemblance to Holly, as if she were Hollys double. And it was Aleesha who brought Roger Phaedo back from the darkness. One afternoon, wandering naked through Phaedos apartment, she came upon two enormous manuscripts, neatly stacked. One was the Rousseau translation, each page covered with almost identical words; the other, the novel about Charlie Dark. She started leafing through the novel. Charlie Dark! she exclaimed. I knew Charlie Dark! He was one tough cookie. That bastard was in the Paul Auster gang. Id love to read this book, baby, but Im always too lazy to read long books. Why dont you read it to me? And that is how the ten-year silence was broken. Phaedo decided to please Aleesha. He sat down, and started reading the opening paragraph of his novel, the novel you have just read.             Auster was married to the writer ": null
    },
    {
        "Lydia Davis": "lydia davis"
    },
    {
        ". They have one son together, Daniel Auster.      Auster and his second wife, writer ": null
    },
    {
        "Siri Hustvedt": "siri hustvedt"
    },
    {
        " , were married in 1981, and they live in ": null
    },
    {
        "Brooklyn": "brooklyn"
    },
    {
        ". Together they have one daughter, ": null
    },
    {
        "Sophie Auster": "sophie auster"
    },
    {
        ". Denes, Melissa . .  The Guardian .     He has said his politics are far to the left of the ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        " but that he votes Democratic because he doubts a socialist candidate could win.  He has described right-wing ": null
    },
    {
        "Republicans": "republican party"
    },
    {
        " as jihadists  and the election of ": null
    },
    {
        "Donald Trump": "donald trump"
    },
    {
        " as the most appalling thing Ive seen in politics in my life.        1989 ": null
    },
    {
        "Prix France Culture de Littérature Étrangère": "prix france culture de littérature étrangère"
    },
    {
        " for The New York Trilogy ": null
    },
    {
        "Morton Dauwen Zabel Award": "morton dauwen zabel award"
    },
    {
        " from the ": null
    },
    {
        "American Academy of Arts and Letters": "american academy of arts and letters"
    },
    {
        " PEN/Faulkner Award for Fiction": "pen/faulkner award for fiction"
    },
    {
        " finalist for The Music of Chance ": null
    },
    {
        "Prix Médicis Étranger": "prix médicis étranger"
    },
    {
        " for Leviathan ": null
    },
    {
        "Bodil Awards": "bodil awards"
    },
    {
        " – Best American Film:  Smoke  ": null
    },
    {
        "Independent Spirit Award": "independent spirit award"
    },
    {
        " – Best First Screenplay: Smoke ": null
    },
    {
        "John William Corrington Award for Literary Excellence": "john william corrington award for literary excellence"
    },
    {
        " International Dublin Literary Award": "international dublin literary award"
    },
    {
        " longlist for Timbuktu ": null
    },
    {
        "American Academy of Arts and Sciences": "american academy of arts and sciences"
    },
    {
        "    2004 International Dublin Literary Award shortlist for The Book of Illusions Oracle Night ": null
    },
    {
        "Prince of Asturias Award": "prince of asturias award"
    },
    {
        " for Literature   2006 Elected to the ": null
    },
    {
        "American Academy of Arts and Letters": "american academy of arts and letters"
    },
    {
        " for Literature   2007 ": null
    },
    {
        "Honorary doctor": "honorary doctor"
    },
    {
        " from the ": null
    },
    {
        "University of Liège": "university of liège"
    },
    {
        " The Brooklyn Follies ": null
    },
    {
        "Ordre des Arts et des Lettres": "ordre des arts et des lettres"
    },
    {
        "    2008 International Dublin Literary Award longlist for Travels in the Scriptorium  from the website of  LExpress  June 11, 2010   2010 International Dublin Literary Award longlist for Man in the Dark Invisible Sunset Park    2017 Booker Prize Shortlist for 4321             Squeeze Play     The New York Trilogy    City of Glass   Ghosts   The Locked Room    In the Country of Last Things     Moon Palace     The Music of Chance     Auggie Wrens Christmas Story     Leviathan     Mr. Vertigo     Timbuktu     The Book of Illusions     Oracle Night     The Brooklyn Follies     Travels in the Scriptorium     Man in the Dark  Another Paul Auster novel, Man in the Dark, was due to be published by Henry Holt in the U.S. on Monday September 1, 2008.    Invisible      Sunset Park     Day/Night This reprints both Travels in the Scriptorium and Man in the Dark, together in a single volume    4 3 2 1         Unearth   Wall Writing   Fragments from the Cold   Facing the Music    Disappearances: Selected Poems     Ground Work: Selected Poems and Essays 1970-1979     Collected Poems      The Music of Chance     Smoke     Blue in the Face     Lulu on the Bridge     The Inner Life of Martin Frost  The Inner Life of Martin Frost is a fictional movie that is described in full in Austers novel The Book of Illusions. It is the only film that the protagonist watches of Hector Manns later, hidden films. It is the story of a man meeting a girl – an intense relationship with a touch of supernatural elements. Auster later created a real movie of the same name .        The Invention of Solitude    The Art of Hunger    The Red Notebook  . .   Hand to Mouth   Collected Prose     Winter Journal     Here and Now: Letters, 2008–2011  A collection of letters exchanged with ": null
    },
    {
        "J. M. Coetzee": "j. m. coetzee"
    },
    {
        ".    Report from the Interior    A Life in Words: In Conversation with I. B. Siegumfeldt   Talking to Strangers: Selected Essays, Prefaces, and Other Writings, 1967-2017       The Random House Book of Twentieth-Century French Poetry for more information about some of the poets included in this volume see: by Jean-Michel Maulpoix   True Tales of American Life  pdf version for download in http://pt.scribd.com/doc/46890380/Paul-Auster-and-True-Tales-of-American-Life       The Uninhabited: Selected Poems of André du Bouchet   Life/Situations, by Jean-Paul Sartre , 1977   ": null
    },
    {
        "A Tomb for Anatole": "for anatoles tomb"
    },
    {
        ", by Stéphane Mallarmé   Chronicle of the Guayaki Indians    The Notebooks of Joseph Joubert   Vicious Circles: Two fictions & After the Fact , by Maurice Blanchot , 1999   Fits and Starts: Selected Poems of ": null
    },
    {
        "Jacques Dupin": "jacques dupin"
    },
    {
        ", translated by Paul Auster, Living Hand Editions, 1974       ": null
    },
    {
        "The Story of My Typewriter": "the story of my typewriter"
    },
    {
        " with paintings by Sam Messer   The Accidental Rebel   ALONE Prose piece from 1969 published in six copies along with Becoming the Other in Translation by Siri Hustvedt. Published by Danish small press Ark Editions       In 1993, a movie adaptation of ": null
    },
    {
        "The Music of Chance": "the music of chance"
    },
    {
        " was released. Auster features in a cameo role at the end of the film.   In 1994 City of Glass was adapted as a graphic novel by artist David Mazzucchelli and Paul Karasik . Austers friend, noted cartoonist Art Spiegelman , produced the adaptation.   From 1999 to 2001, Auster was part of NPR s  National Story Project , a monthly radio show in which, together With NPR correspondent Jacki Lyden , Auster read stories sent in by NPR listeners across America. Listeners were invited to send in stories of anywhere from two paragraphs to two pages that must be true , from which Auster later selected entries, edited them and subsequently read them on the air. Auster read over 4,000 stories submitted to the show, with a few dozen eventually featured on the show and many more anthologized in two 2002 books edited by Auster.   Jazz trumpeter and composer Michael Mantler s 2001 album Hide and Seek uses words by Auster from the play of the same name.   Paul Auster narrated Ground Zero , an audio guide created by the Kitchen Sisters and Soundwalk Boxer, Sarah. The New York Times. September 11, 2004. Retrieved September 12, 2009. and produced by NPR , . Retrieved September 12, 2009. which won the Dalton Pen Award for Multi-media/Audio, , . Retrieved September 17, 2009. and was nominated for an Audie Award for best Original Work, . Retrieved September 17, 2009.   Austrian composer Olga Neuwirth s composition  ... ce qui arrive ...  combines the recorded voice of Paul Auster with ensemble music and live electronics by Markus Noisternig and Thomas Musil . Paul Auster is heard reading from his books Hand to Mouth and The Red Notebook, either as straight recitation, integrated with other sounds as if in a radio play, or passed through an electronically realized string resonator so that the low tones interact with those of a string ensemble. A film by Dominique Gonzalez-Foerster runs throughout the work featuring the cabaret artist and actress Georgette Dee.   In 2005 his daughter, Sophie , recorded an album of songs in both French and English, entitled Sophie Auster, with the band One Ring Zero . The lyrics of three of the songs are by Paul Auster; and he also provided for the accompanying booklet translations of several French poems which form the lyrics of other songs on the album.   Paul Austers voice may be heard on the 2005 album entitled We Must Be Losing It by The Farangs . The two tracks are entitled Obituary in the Present Tense and Between the Lines .   On the 2006 album ": null
    },
    {
        "As Smart as We Are": "as smart as we are"
    },
    {
        " by New York band One Ring Zero , Auster wrote the lyrics for the song Natty Man Blues based on Cincinnati poet Norman Finkelstein .   In 2006 Paul Auster directed the film ": null
    },
    {
        "The Inner Life of Martin Frost": "the inner life of martin frost"
    },
    {
        ", based on an original screenplay by him. It was shot in Lisbon and Azenhas do Mar and starred David Thewlis , Iréne Jacob , and Michael Imperioli as well as Austers daughter Sophie. Auster provided the narration, albeit uncredited . The film premiered at the European Film Market , as part of the 2007 Berlinale in Berlin, Germany on February 10, 2007, and opened in New York City on September 7 of the same year.   The lyrics of Fionn Regan s 2006 song Put A Penny in the Slot mention Auster and his novella ": null
    },
    {
        "Timbuktu": "timbuktu"
    },
    {
        ".   In the 2008 Russian film Плюс один , the main character is in the process of translating one of Austers books.   In the 2008 novel ": null
    },
    {
        "To the End of the Land": "to the end of the land"
    },
    {
        " by David Grossman , the bedroom bookshelf of the central IDF soldier character Ofer is described as prominently displaying several Auster titles.   In the 2009 documentary ": null
    },
    {
        "Act of God": "act of god"
    },
    {
        ", Auster is interviewed on his experience of watching another boy struck and killed by lightning when he was 14.   In the 2011 documentary on Charlotte Rampling The Look": null
    }
]