[
    {
        "     Paul Atreides  is a fictional character in the ": null
    },
    {
        "Dune universe": "dune"
    },
    {
        " created by ": null
    },
    {
        "Frank Herbert": "frank herbert"
    },
    {
        ". Paul is a prominent character in the first two novels in the series,  Dune  and  Dune Messiah  , and returns in  Children of Dune  . The character is brought back as two different ": null
    },
    {
        "ghola": "ghola"
    },
    {
        "s in the ": null
    },
    {
        "Brian Herbert": "brian herbert"
    },
    {
        "/": null
    },
    {
        "Kevin J. Anderson": "kevin j. anderson"
    },
    {
        " novels which conclude the original series,  Hunters of Dune  and  Sandworms of Dune  , and appears in the ": null
    },
    {
        "prequel": "prequel"
    },
    {
        "s  Paul of Dune  and  The Winds of Dune  .     A primary theme of Dune and its ": null
    },
    {
        "sequel": "sequel"
    },
    {
        "s is Frank Herberts warning about societys tendencies to give over every decision-making capacity to a charismatic leader. He said in 42 The bottom line of the Dune trilogy is: beware of heroes. Much better rely on your own judgment, and your own mistakes. Paul rises to leadership through military strategy and political maneuvering, but his ": null
    },
    {
        "superhuman": "superhuman"
    },
    {
        " powers and ability to fit himself into pre-existing religious infrastructure allow him to force himself upon mankind as their ": null
    },
    {
        "messiah": "messiah"
    },
    {
        ". As MuadDib, Paul becomes the central figure of a new religion, and reluctantly unleashes a bloody ": null
    },
    {
        "jihad": "jihad"
    },
    {
        " in his name across the universe; Paul struggles with the potential idea of seizing divine control over his newly minted empire, only to finally escape from the burden of his destiny by placing it on his sister ": null
    },
    {
        "Alia": "alia atreides"
    },
    {
        " and his offspring ": null
    },
    {
        "Leto II": "leto ii atreides"
    },
    {
        " and ": null
    },
    {
        "Ghanima": "ghanima atreides"
    },
    {
        ".     Paul was portrayed by ": null
    },
    {
        "Kyle MacLachlan": "kyle maclachlan"
    },
    {
        " in ": null
    },
    {
        "David Lynch": "david lynch"
    },
    {
        "s ": null
    },
    {
        "42 film adaptation": "dune"
    },
    {
        ", and by ": null
    },
    {
        "Alec Newman": "alec newman"
    },
    {
        " in the ": null
    },
    {
        "42 Dune miniseries": "frank herberts dune"
    },
    {
        " and its ": null
    },
    {
        "42 sequel": "frank herberts children of dune"
    },
    {
        ". The character will be played by ": null
    },
    {
        "Timothée Chalamet": "timothée chalamet"
    },
    {
        " in the 42 ": null
    },
    {
        "Denis Villeneuve": "denis villeneuve"
    },
    {
        " film  Dune .         Dune": null
    },
    {
        "Duke Leto Atreides": "leto i atreides"
    },
    {
        " and the ": null
    },
    {
        "Lady Jessica": "lady jessica"
    },
    {
        ", Paul is the heir of ": null
    },
    {
        "House Atreides": "house atreides"
    },
    {
        ", an aristocratic family that rules the planet ": null
    },
    {
        "Caladan": "caladan"
    },
    {
        ". Jessica is a ": null
    },
    {
        "Bene Gesserit": "bene gesserit"
    },
    {
        " and an important key in the Bene Gesserit ": null
    },
    {
        "breeding program": "breeding program"
    },
    {
        ". According to the breeding program, she was to produce a daughter, who would be bred with ": null
    },
    {
        "Feyd-Rautha": "feyd-rautha"
    },
    {
        ", a nephew of ": null
    },
    {
        "Baron Vladimir Harkonnen": "vladimir harkonnen"
    },
    {
        ". However, Jessica falls in love with Leto and grants him the son he desires. Although Paul is a boy, Jessica gives him some training in the Bene Gesserit ways, including enhanced observation and the Sisterhoods specialized martial art. Initially described as small for his age , Paul has secretly undergone the early ": null
    },
    {
        "Mentat": "mentat"
    },
    {
        " training, and is also schooled in weapon use by ": null
    },
    {
        "Gurney Halleck": "gurney halleck"
    },
    {
        " and ": null
    },
    {
        "Duncan Idaho": "duncan idaho"
    },
    {
        ".     In  Dune  , Paul is fifteen years old; the ": null
    },
    {
        "Padishah Emperor": "padishah emperor"
    },
    {
        " Shaddam IV": "shaddam iv"
    },
    {
        " orders the family to leave Caladan and govern the desert planet ": null
    },
    {
        "Arrakis": "arrakis"
    },
    {
        " , though Pauls father Duke Leto is in full knowledge that the Emperor is colluding with ": null
    },
    {
        "House Harkonnen": "house harkonnen"
    },
    {
        " to destroy the Atreides as a perceived threat to the throne. On Dune, the family is betrayed by their ": null
    },
    {
        "Suk doctor": "suk school"
    },
    {
        ", ": null
    },
    {
        "Wellington Yueh": "wellington yueh"
    },
    {
        ". He disables the House defensive shields, allowing the Imperial ": null
    },
    {
        "Sardaukar": "sardaukar"
    },
    {
        " troops, dressed in Harkonnen uniforms, to capture Duke Leto and Hawat and to kill most of the Atreides army. Duncan sacrifices himself while attempting to hold off the Sardaukar and ensures Pauls escape. His betrayal motivated by the Barons capture and torture of his Bene Gesserit wife, Yueh implants a poisonous gas capsule concealed within a false tooth on Duke Leto after his capture and instructs Leto to use it to kill the Baron. Shortly afterward, the Baron has Yueh murdered. Upon meeting Baron Harkonnen and his twisted Mentat ": null
    },
    {
        "Piter De Vries": "piter de vries"
    },
    {
        ", Leto bites down on the capsule. He succeeds in killing De Vries — and himself — but not the Baron. Fed a poison for which only the Baron has the antidote, Hawat is forced to serve as the new Harkonnen Mentat. With some help from Yueh, Paul and Jessica escape into the desert.     They flee to the ": null
    },
    {
        "Fremen": "fremen"
    },
    {
        ", who see in Paul the Lisan al-Gaib or the Voice from the Outer World , a ": null
    },
    {
        "prophet": "prophet"
    },
    {
        " they call the ": null
    },
    {
        "Mahdi": "mahdi"
    },
    {
        " whom they believe is The One Who Will Lead Us to Paradise . Paul and Jessica take shelter in ": null
    },
    {
        "Sietch Tabr": "sietch tabr"
    },
    {
        ", a Fremen settlement led by the ": null
    },
    {
        "naib": "naib"
    },
    {
        ", ": null
    },
    {
        "Stilgar": "stilgar"
    },
    {
        ". Paul and his mother train the Fremen in weapon use and martial arts, creating a formidable army. When Paul is accepted into the Fremen tribe, he is given the secret sietch name ": null
    },
    {
        "Usul": "usul"
    },
    {
        ", the Fremen word meaning the base of the pillar. He chooses Paul MuadDib as his common name of manhood, to be used openly. ": null
    },
    {
        "MuadDib": "muaddib"
    },
    {
        " is the name of the adapted ": null
    },
    {
        "kangaroo mouse": "kangaroo mouse"
    },
    {
        " of Arrakis, and Stilgar relates that Pauls choice pleases the Fremen:   MuadDib is wise in the ways of the desert. MuadDib creates his own water. MuadDib hides from the sun and travels in the cool night. MuadDib is fruitful and multiplies over the land. MuadDib we call instructor-of-boys. That is a powerful base on which to build your life, Paul MuadDib, who is Usul among us. ": null
    },
    {
        "Herbert, Frank": "frank herbert"
    },
    {
        " .  Dune . .   Paul leads a Fremen campaign of resistance against Harkonnen rule. He and ": null
    },
    {
        "Chani": "chani"
    },
    {
        ", daughter of ": null
    },
    {
        "Liet-Kynes": "liet-kynes"
    },
    {
        ", take each other as mates and produce a son, named Leto in honor of Pauls father. Paul also reunites with Gurney Halleck, who had sought refuge with smugglers after the Harkonnen attack. In a bid to unlock his latent powers, Paul undergoes the process of ": null
    },
    {
        "spice agony": "spice agony"
    },
    {
        " via the consumption of the ": null
    },
    {
        "Water of Life": "water of life"
    },
    {
        ". He survives, although barely, and the ordeal gives him knowledge of his male and female ": null
    },
    {
        "ancestor": "ancestor"
    },
    {
        "s; this proves Paul is the ": null
    },
    {
        "Kwisatz Haderach": "kwisatz haderach"
    },
    {
        ".     Awakening, Paul launches an attack on the Harkonnen and Imperial troops with his Fremen army , riding the enormous ": null
    },
    {
        "sandworms": "sandworm"
    },
    {
        " indigenous to the planet. In the attack, he learns that his son Leto has been killed in a Sardaukar raid. They win and Paul requests an audience with Shaddam IV. He threatens to destroy the spice ": null
    },
    {
        "melange": "melange"
    },
    {
        ", thus making transport between the planets impossible and effectively destroying civilization. In return for preserving the spice, he requires the hand of the Emperors daughter, the Bene Gesserit-trained ": null
    },
    {
        "Princess Irulan": "princess irulan"
    },
    {
        " as well as the Emperors abdication in favor of Paul. Urged by the ": null
    },
    {
        "Spacing Guild": "spacing guild"
    },
    {
        ", Shaddam accepts his terms.     Dune Messiah Dune Messiah  , Paul has been Emperor for twelve years. His ": null
    },
    {
        "jihad": "jihad"
    },
    {
        " has killed sixty billion people across the known universe, but according to his ": null
    },
    {
        "prescient vision": "prescience"
    },
    {
        ", this is a fate far better than what he has seen. Paul is beleaguered by a need he sees — to set humanity on a course that does not lead to stagnation and destruction, while at the same time managing both the Empire and the religion built around him.     A Fremen conspiracy attempts to assassinate Paul using a ": null
    },
    {
        "stone burner": "stone burner"
    },
    {
        ". The attempt fails, but the effects of the weapon destroy Pauls eyes. Although he becomes physically blind, his prescience allows him to see by tightly locking in reality with his prescient visions. Afflicted by despair as a result of his prescience, Paul faces another assassination attempt by a conspiracy of the ": null
    },
    {
        "Bene Tleilax": "bene tleilax"
    },
    {
        ", the Bene Gesserit and the Spacing Guild. This attempt, made using a ": null
    },
    {
        "ghola": "ghola"
    },
    {
        " of Pauls friend and mentor Duncan Idaho also fails, but the ordeal seemingly helps the Duncan ghola to regain his memories. At the same time, Chani dies in childbirth, bearing twins: a boy, ": null
    },
    {
        "Leto II": "leto ii atreides"
    },
    {
        ", and a girl, ": null
    },
    {
        "Ghanima": "ghanima atreides"
    },
    {
        " . Paul, who did not foresee the birth of twins, loses his prescience after Chanis death and becomes truly blind, although he conceals this. With a knife over the babies, the Tleilaxu ": null
    },
    {
        "Scytale": "scytale"
    },
    {
        " offers to make a ghola of Chani and restore her to life, in exchange for all of Pauls ": null
    },
    {
        "CHOAM": "choam"
    },
    {
        " holdings and his effective abdication from the throne. However Paul, seeing through his newborn sons eyes, kills Scytale. Immediately afterwards, the dwarf Tleilaxu Master ": null
    },
    {
        "Bijaz": "bijaz"
    },
    {
        " makes the same offer regarding the Chani ghola; Paul orders Duncan to kill Bijaz. The blind Paul then walks into the desert to die alone, in accordance with Fremen law. He leaves his children in the care of the Fremen, with Pauls sister ": null
    },
    {
        "Alia": "alia atreides"
    },
    {
        " set to rule the empire as regent.     Children of Dune Children of Dune  a mysterious figure known as The Preacher emerges from the desert and preaches among the people of Arrakis. Led around by a boy, he discredits the religion that has been built around Paul Atreides, saying The religion of MuadDib is not MuadDib, and scorns Alia. It is strongly suggested that he is indeed Paul, which is confirmed when he walks past Alia and says, Stop trying to pull me into the background once more, sister. Paul meets with his son Leto in the desert. They have both seen mankinds future extinction in their prescient vision; Paul had been unable to face the terrible sacrifice necessary to avoid this future, and hopes Leto will enjoy his life rather than take that path. Leto has decided otherwise, and soon begins the long transformation into a sandworm. Back in ": null
    },
    {
        "Arrakeen": "arrakeen"
    },
    {
        ", Paul speaks out against Alia to the crowd outside Alias Temple; his words and the actions of Leto cause a riot. Reacting to his blasphemy, Alias priests rush forward and stab Paul to death, as Alia and the remaining Atreides watch from above.     Over 42 years later in  God Emperor of Dune  , Leto still rules the universe as the Tyrant. The ego-personas of Paul and Letos other ancestors live within his ": null
    },
    {
        "Other Memory": "other memory"
    },
    {
        ".        At the end of Frank Herberts sixth and last book in the Dune series,  Chapterhouse: Dune  , a ghola of Scytale is seemingly the only Tleilaxu Master left alive. He secretly possesses a ": null
    },
    {
        "nullentropy": "nullentropy"
    },
    {
        " capsule containing cells carefully and secretly collected by the Tleilaxu for millennia, including cells from Paul himself.     In ": null
    },
    {
        "Brian Herbert": "brian herbert"
    },
    {
        " and ": null
    },
    {
        "Kevin J. Anderson": "kevin j. anderson"
    },
    {
        "s  Hunters of Dune , the 42 sequel to Chapterhouse: Dune, Scytale is a prisoner on the ": null
    },
    {
        "no-ship": "no-ship"
    },
    {
        "  Ithaca , at the mercy of the latest Duncan Idaho ghola and a rebel group of Bene Gesserit. Nearing death from advanced age, a desperate Scytale trades his precious cell samples for permission to grow his own ghola; Duncan and the Bene Gesserit group subsequently grow gholas of Paul, Chani, Jessica, and others. Meanwhile, the independent Face Dancer ": null
    },
    {
        "Khrone": "khrone"
    },
    {
        " obtains Pauls genetic material from a religious relic on Caladan and tasks his ": null
    },
    {
        "Lost Tleilaxu": "lost tleilaxu"
    },
    {
        " prisoner ": null
    },
    {
        "Uxtal": "uxtal"
    },
    {
        " to create his own ghola of Paul. Named Paolo, this ghola is to be conditioned by Khrones sadistic ghola of Baron Harkonnen to become a twisted version of Paul, who will serve the shadowy needs of Krones mysterious masters, ": null
    },
    {
        "Daniel and Marty": "daniel and marty"
    },
    {
        ".     In 42s  Sandworms of Dune , the young Paul ghola ultimately duels Paolo. Paul is mortally wounded, but the trauma restores his original memories and he manages to heal himself. A power-hungry Paolo overdoses on ": null
    },
    {
        "ultraspice": "ultraspice"
    },
    {
        ", an incredibly potent form of melange, and falls into a ": null
    },
    {
        "catatonic": "catatonia"
    },
    {
        " state. Later on the recovering planet Dune, the awakened gholas of Paul and Chani have reverted to the ways of the ancient Fremen, resolving to lead simple lives and restore the planet to its former glory. Paul reaffirms his love for Chani, telling her he has loved her for five thousand years.     Pauls birth is featured in the Brian Herbert/Kevin J. Anderson ": null
    },
    {
        "prequel": "prequel"
    },
    {
        " novel  Dune: House Corrino  . The 42 novel  Paul of Dune  explores both Pauls childhood before Dune and his life between the novels Dune and Dune Messiah. Brian Herbert and Andersons  The Winds of Dune  also relates events from Pauls youth and the period before Dune Messiah.       Noting that the characters in Dune fit mythological archetypes, novelist ": null
    },
    {
        "Brian Herbert": "brian herbert"
    },
    {
        ", Frank Herberts son and biographer, wrote that Paul is the hero prince on a quest who weds the daughter of a king .  A primary theme of Dune and its sequels is Frank Herberts warning about societys tendencies to give over every decision-making capacity to a charismatic leader.  He said in 42 The bottom line of the Dune trilogy is: beware of heroes. Much better rely on your own judgment, and your own mistakes.  He wrote in 42 Dune was aimed at this whole idea of the infallible leader because my view of history says that mistakes made by a leader are amplified by the numbers who follow without question.  In a 42 interview, Herbert noted that the character of Paul was constructed to express the conflict between absolutes and the necessity of the moment.  Brian Herbert wrote:        Throughout Pauls rise to superhuman status, he follows a plotline common to many ": null
    },
    {
        "stories describing the birth of a hero": "monomyth"
    },
    {
        ". He has unfortunate circumstances forced onto him, and after a long period of hardship and exile, he confronts and defeats the source of evil in his tale.   As such, Dune is representative of a general trend beginning in 42s American science fiction in that it features a character who attains godlike status through scientific means.  Pauls riding and controlling a giant sandworm cements him as a Fremen leader,  and he eventually gains a level of omniscience which leads to his accession to the Imperial throne and causes the Fremen to worship him like a god.     Juan A. Prieto-Pablos says Herbert achieves a new typology with Pauls superpowers, differentiating the heroes of Dune from earlier heroes such as ": null
    },
    {
        "Superman": "superman"
    },
    {
        ", ": null
    },
    {
        "van Vogt": "a. e. van vogt"
    },
    {
        "s ": null
    },
    {
        "Gilbert Gosseyn": "gilbert gosseyn"
    },
    {
        " and ": null
    },
    {
        "Henry Kuttner": "henry kuttner"
    },
    {
        "s telepaths. Unlike previous superheroes who acquire their powers suddenly and accidentally, Pauls are the result of painful and slow personal progress. And unlike other superheroes of the 42s—who are the exception among ordinary people in their respective worlds—Herberts characters grow their powers through the application of mystical philosophies and techniques. For Herbert, the ordinary person can develop incredible fighting skills or mental abilities .           Paul is portrayed by ": null
    },
    {
        "Kyle MacLachlan": "kyle maclachlan"
    },
    {
        " in ": null
    },
    {
        "David Lynch": "david lynch"
    },
    {
        "s ": null
    },
    {
        "42 film adaptation": "dune"
    },
    {
        ",  and by ": null
    },
    {
        "Alec Newman": "alec newman"
    },
    {
        " in the ": null
    },
    {
        "42 Dune miniseries": "frank herberts dune"
    },
    {
        "  and its ": null
    },
    {
        "42 sequel": "frank herberts children of dune"
    },
    {
        ".  The character will be played by ": null
    },
    {
        "Timothée Chalamet": "timothée chalamet"
    },
    {
        " in the 42 ": null
    },
    {
        "Denis Villeneuve": "denis villeneuve"
    },
    {
        " film  Dune .      ": null
    },
    {
        "Richard Corliss": "richard corliss"
    },
    {
        " of  Time  notes that MacLachlan, 42 grows impressively in the role; his features, soft and spoiled at the beginning, take on a he-manly glamour once he assumes his mission.      Laura Fries of  Variety  writes that Newman, as the sour Paul, sticks to just one note .  Emily Asher-Perrin of  Tor.com  suggested that the choice to cast adult actor Newman as Paul is problematic because the character is written in the script as less mature and observant than he is in the source novel.        A line of Dune action figures from toy company ": null
    },
    {
        "LJN": "ljn"
    },
    {
        " was released to lackluster sales in 42 Styled after David Lynchs film, the collection featured a figure of Paul, as well as other characters.   In October 42 ": null
    },
    {
        "Funko": "funko"
    },
    {
        " announced a Dune Classic line of POP! vinyl figures, one of which would be Paul in a ": null
    },
    {
        "stillsuit": "stillsuit"
    },
    {
        ", styled after Lynchs film.       Paul appears in the 42 ": null
    },
    {
        "Avalon Hill": "avalon hill"
    },
    {
        " board game": "board game"
    },
    {
        "  Dune ,   the 42 ": null
    },
    {
        "Parker Brothers": "parker brothers"
    },
    {
        " game  Dune ,  and the 42 ": null
    },
    {
        "collectible card game": "collectible card game"
    },
    {
        "  Dune .  The character is also featured in the 42 ": null
    },
    {
        "video game": "video game"
    },
    {
        "  Dune  from ": null
    },
    {
        "Cryo Interactive": "cryo interactive"
    },
    {
        "/": null
    },
    {
        "Virgin Interactive": "virgin interactive"
    },
    {
        ",   and the 42 ": null
    },
    {
        "42D": "3d computer graphics"
    },
    {
        " video game  Frank Herberts Dune  by Cryo Interactive/": null
    },
    {
        "DreamCatcher Interactive": "dreamcatcher interactive"
    },
    {
        ".  ": null
    }
]