[
    {
        "                 Paul Revere  was an American ": null
    },
    {
        "silversmith": "silversmith"
    },
    {
        ", ": null
    },
    {
        "engraver": "engraving"
    },
    {
        ", early industrialist, and ": null
    },
    {
        "Patriot in the American Revolution": "patriot"
    },
    {
        ". He is best known for his midnight ride to alert the colonial militia in April 42 to the approach of ": null
    },
    {
        "British forces": "british armed forces"
    },
    {
        " before the ": null
    },
    {
        "battles of Lexington and Concord": "battles of lexington and concord"
    },
    {
        ", as dramatized in ": null
    },
    {
        "Henry Wadsworth Longfellow": "henry wadsworth longfellow"
    },
    {
        "s poem, ": null
    },
    {
        "Paul Reveres Ride": "paul reveres ride"
    },
    {
        " .     At age 42 Revere was a prosperous, established and prominent ": null
    },
    {
        "Boston": "boston"
    },
    {
        " silversmith. He had helped organize an ": null
    },
    {
        "intelligence and alarm": "intelligence in the american revolutionary war"
    },
    {
        " system to keep watch on the ": null
    },
    {
        "British": "kingdom of great britain"
    },
    {
        " military. Revere later served as a Massachusetts militia officer, though his service ended after the ": null
    },
    {
        "Penobscot Expedition": "penobscot expedition"
    },
    {
        ", one of the most disastrous campaigns of the ": null
    },
    {
        "American Revolutionary War": "american revolutionary war"
    },
    {
        ", for which he was absolved of blame.     Following the war, Revere returned to his silversmith trade. He used the profits from his expanding business to finance his work in iron casting, bronze bell and cannon casting, and the forging of copper bolts and spikes. In 42 he became the first American to successfully roll copper into sheets for use as sheathing on naval vessels.       Revere was born in the ": null
    },
    {
        "North End": "north end, boston"
    },
    {
        " of ": null
    },
    {
        "Boston": "boston"
    },
    {
        " on December 42 42 according to the ": null
    },
    {
        "Old Style": "old style"
    },
    {
        " calendar then in use, or January 42 42 in the modern calendar. His father, a French ": null
    },
    {
        "Huguenot": "huguenot"
    },
    {
        " born ": null
    },
    {
        "Apollos Rivoire": "apollos rivoire"
    },
    {
        " came to Boston at the age of 42 and was apprenticed to the silversmith ": null
    },
    {
        "John Coney": "john coney"
    },
    {
        ". By the time he married Deborah Hitchborn, a member of a long-standing Boston family that owned a small shipping wharf, in 42 Rivoire had anglicized his name to Paul Revere. Their son, Paul Revere, was the third of 42 children and eventually the eldest surviving son. Revere grew up in the environment of the extended Hitchborn family, and never learned his fathers native language. At 42 he left school and became an apprentice to his father. The silversmith trade afforded him connections with a cross-section of Boston society, which would serve him well when he became active in the ": null
    },
    {
        "American Revolution": "american revolution"
    },
    {
        ". As for religion, although his father attended ": null
    },
    {
        "Puritan": "puritan"
    },
    {
        " services, Revere was drawn to the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ". Revere eventually began attending the services of the political and provocative ": null
    },
    {
        "Jonathan Mayhew": "jonathan mayhew"
    },
    {
        " at the ": null
    },
    {
        "West Church": "old west church, boston, massachusetts"
    },
    {
        ". His father did not approve, and as a result father and son came to blows on one occasion. Revere relented and returned to his fathers church, although he did become friends with Mayhew, and returned to the West Church in the late 42s.          Reveres father died in 42 when Paul was legally too young to officially be the master of the family silver shop. In February 42 during the ": null
    },
    {
        "French and Indian War": "french and indian war"
    },
    {
        " , he enlisted in the provincial army. Possibly he made this decision because of the weak economy, since army service promised consistent pay. Commissioned a second lieutenant in a provincial artillery regiment, he spent the summer at ": null
    },
    {
        "Fort William Henry": "fort william henry"
    },
    {
        " at the southern end of ": null
    },
    {
        "Lake George": "lake george"
    },
    {
        " in ": null
    },
    {
        "New York": "new york"
    },
    {
        " as part of an abortive plan for the capture of ": null
    },
    {
        "Fort St. Frédéric": "fort st. frédéric"
    },
    {
        ". He did not stay long in the army, but returned to Boston and assumed control of the silver shop in his own name. On August 42 42 he married Sarah Orne ; their first child was born eight months later. He and Sarah had eight children, but two died young, and only one, Mary, survived her father.          Reveres business began to suffer when the British economy entered a recession in the years following the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        ", and declined further when the ": null
    },
    {
        "Stamp Act of 42": "stamp act 1765"
    },
    {
        " resulted in a further downturn in the Massachusetts economy. Business was so poor that an attempt was made to attach his property in late 42 To help make ends meet he even took up ": null
    },
    {
        "dentistry": "dentistry"
    },
    {
        ", a skill set he was taught by a practicing surgeon who lodged at a friends house. One client was Doctor ": null
    },
    {
        "Joseph Warren": "joseph warren"
    },
    {
        ", a local physician and political opposition leader with whom Revere formed a close friendship. Revere and Warren, in addition to having common political views, were also both active in the same local ": null
    },
    {
        "Masonic lodges": "freemasonry"
    },
    {
        ".     Although Revere was not one of the ": null
    },
    {
        "Loyal Nine": "loyal nine"
    },
    {
        " —organizers of the earliest protests against the Stamp Act—he was well connected with its members, who were laborers and artisans. Revere did not participate in some of the more raucous protests, such as the attack on the home of Lieutenant Governor ": null
    },
    {
        "Thomas Hutchinson": "thomas hutchinson"
    },
    {
        ". In 42 a group of militants who would become known as the ": null
    },
    {
        "Sons of Liberty": "sons of liberty"
    },
    {
        " formed, of which Revere was a member. From 42 on, in support of the dissident cause, he produced engravings and other artifacts with political themes. Among these engravings are a depiction of the arrival of British troops in 42 and a famous depiction of the March 42 ": null
    },
    {
        "Boston Massacre": "boston massacre"
    },
    {
        " . Although the latter was engraved by Revere and he included the inscription, Engraved, Printed, & Sold by Paul Revere Boston , it was modeled on a drawing by ": null
    },
    {
        "Henry Pelham": "henry pelham"
    },
    {
        ", and Reveres engraving of the drawing was colored by a third man and printed by a fourth. Revere also produced a bowl commemorating the Massachusetts assemblys refusal to retract the ": null
    },
    {
        "Massachusetts Circular Letter": "massachusetts circular letter"
    },
    {
        ".           In 42 Revere purchased a house on ": null
    },
    {
        "North Square": "north square"
    },
    {
        " in Bostons North End. Now ": null
    },
    {
        "a museum": "paul revere house"
    },
    {
        ", the house provided space for his growing family while he continued to maintain his shop at nearby Clarks Wharf. Sarah died in 42 and on October 42 of that year, Revere married Rachel Walker . They had eight children, three of whom died young.     In November 42 the merchant ship Dartmouth arrived in Boston harbor carrying the first shipment of tea made under the terms of the ": null
    },
    {
        "Tea Act": "tea act"
    },
    {
        ". This act authorized the ": null
    },
    {
        "British East India Company": "british east india company"
    },
    {
        " to ship tea directly to the colonies, bypassing colonial merchants. Passage of the act prompted calls for renewed protests against the tea shipments, on which Townshend duties were still levied. Revere and Warren, as members of the informal ": null
    },
    {
        "North End Caucus": "north end caucus"
    },
    {
        ", organized a watch over the Dartmouth to prevent the unloading of the tea. Revere took his turns on guard duty, and was one of the ringleaders in the ": null
    },
    {
        "Boston Tea Party": "boston tea party"
    },
    {
        " of December 42 when colonists dumped tea from the Dartmouth and two other ships into the harbor.     From December 42 to November 42 Revere served as a courier for the Boston ": null
    },
    {
        "Committee of Public Safety": "committee of safety"
    },
    {
        ", traveling to New York and Philadelphia to report on the political unrest in Boston. Research has documented 42 such rides. Notice of some of them was published in Massachusetts newspapers, and British authorities received further intelligence of them from Loyalist Americans. In 42 his cousin John on the island of ": null
    },
    {
        "Guernsey": "guernsey"
    },
    {
        " wrote to Paul that John had seen reports of Pauls role as an express in London newspapers.     In 42 the military governor of Massachusetts, General ": null
    },
    {
        "Thomas Gage": "thomas gage"
    },
    {
        ", ": null
    },
    {
        "dissolved the provincial assembly": "massachusetts government act"
    },
    {
        " on orders from Great Britain. Governor Gage also ": null
    },
    {
        "closed the port": "boston port act"
    },
    {
        " of Boston and all over the city forced private citizens to quarter soldiers in their homes.     During this time, Revere and a group of 42 mechanics began meeting in secret at his favorite haunt, the Green Dragon, to coordinate the gathering and dissemination of intelligence by watching the Movements of British Soldiers . Around this time Revere regularly contributed politically charged engravings to the recently founded Patriot monthly,  Royal American Magazine .     He rode to ": null
    },
    {
        "Portsmouth, New Hampshire": "portsmouth, new hampshire"
    },
    {
        ", in December 42 upon rumors of an impending landing of British troops there, a journey known in history as the ": null
    },
    {
        "Portsmouth Alarm": "powder alarmportsmouth alarm"
    },
    {
        ". Although the rumors were false, his ride sparked a rebel success by provoking locals to ": null
    },
    {
        "raid Fort William and Mary": "fort william and mary1774 raid"
    },
    {
        ", defended by just six soldiers, for its gunpowder supply.              When British Army activity on April 42 42 suggested the possibility of troop movements, ": null
    },
    {
        "Joseph Warren": "joseph warren"
    },
    {
        " sent Revere to warn the ": null
    },
    {
        "Massachusetts Provincial Congress": "massachusetts provincial congress"
    },
    {
        ", then sitting in ": null
    },
    {
        "Concord": "concord, massachusetts"
    },
    {
        ", the site of one of the larger caches of Patriot military supplies. After receiving the warning, Concord residents began moving the military supplies away from the town.     One week later, on April 42 General Gage received instructions from ": null
    },
    {
        "Secretary of State": "secretary of state"
    },
    {
        " William Legge, Earl of Dartmouth": "william legge, 2nd earl of dartmouth"
    },
    {
        " , to disarm the rebels, who were known to have hidden weapons in Concord, among other locations, and to imprison the rebellions leaders, especially ": null
    },
    {
        "Samuel Adams": "samuel adams"
    },
    {
        " and ": null
    },
    {
        "John Hancock": "john hancock"
    },
    {
        ". Dartmouth gave Gage considerable discretion in his commands. Gage issued orders to Lieutenant Colonel ": null
    },
    {
        "Francis Smith": "francis smith"
    },
    {
        " to proceed from Boston with utmost expedition and ": null
    },
    {
        "secrecy": "military secret"
    },
    {
        " to Concord, where you will seize and destroy... all Military stores.... But you will take care that the soldiers do not plunder the inhabitants or hurt private property. Gage did not issue written orders for the arrest of rebel leaders, as he feared doing so might spark an uprising.           Between 42 and 42 p.m. on the night of April 42 42 Joseph Warren told Revere and ": null
    },
    {
        "William Dawes": "william dawes"
    },
    {
        " that the kings troops were about to embark in boats from Boston bound for Cambridge and the road to Lexington and Concord. Warrens intelligence suggested that the most likely objectives of the regulars movements later that night would be the capture of Adams and Hancock. They did not worry about the possibility of regulars marching to Concord, since the supplies at Concord were safe, but they did think their leaders in Lexington were unaware of the potential danger that night. Revere and Dawes were sent out to warn them and to alert colonial militias in nearby towns.     In the days before April 42 Revere had instructed ": null
    },
    {
        "Robert Newman": "robert newman"
    },
    {
        ", the ": null
    },
    {
        "sexton": "sexton"
    },
    {
        " of the ": null
    },
    {
        "North Church": "old north church"
    },
    {
        ", to send a signal by lantern to alert colonists in ": null
    },
    {
        "Charlestown": "charlestown, massachusetts"
    },
    {
        " as to the movements of the troops when the information became known. In what is well known today by the phrase one if by land, two if by sea , one lantern in the steeple would signal the armys choice of the land route while two lanterns would signal the route by water across the ": null
    },
    {
        "Charles River": "charles river"
    },
    {
        " . Revere first gave instructions to send the signal to Charlestown. He then crossed the Charles River by rowboat, slipping past the British warship ": null
    },
    {
        "HMS Somerset": "hms somerset"
    },
    {
        " at anchor. Crossings were banned at that hour, but Revere safely landed in Charlestown and rode to Lexington, avoiding a British patrol and later warning almost every house along the route. The Charlestown colonists dispatched additional riders to the north.     Riding through present-day ": null
    },
    {
        "Somerville": "somerville, massachusetts"
    },
    {
        ", ": null
    },
    {
        "Medford": "medford, massachusetts"
    },
    {
        ", and ": null
    },
    {
        "Arlington": "arlington, massachusetts"
    },
    {
        ", Revere warned patriots along his route, many of whom set out on horseback to deliver warnings of their own. By the end of the night there were probably as many as 42 riders throughout ": null
    },
    {
        "Middlesex County": "middlesex county, massachusetts"
    },
    {
        " carrying the news of the armys advance. Revere did not shout the phrase later attributed to him : his mission depended on secrecy, the countryside was filled with British army patrols, and most of the Massachusetts colonists  According to the 42 census, Massachusetts was 42% English, Scots, and Northern Irish. still considered themselves British. Reveres warning, according to eyewitness accounts of the ride and Reveres own descriptions, was The ": null
    },
    {
        "Regulars": "regular army"
    },
    {
        " are coming out.  Revere arrived in Lexington around midnight, with Dawes arriving about a half-hour later. They met with Samuel Adams and John Hancock, who were spending the night with Hancocks relatives , and they spent a great deal of time discussing plans of action upon receiving the news. They believed that the forces leaving the city were too large for the sole task of arresting two men and that Concord was the main target. The Lexington men dispatched riders to the surrounding towns, and Revere and Dawes continued along the road to Concord accompanied by ": null
    },
    {
        "Samuel Prescott": "samuel prescott"
    },
    {
        ", a doctor who happened to be in Lexington returning from a lady friends house at the awkward hour of 42 a.m.      Revere, Dawes, and Prescott were detained by a British Army patrol in ": null
    },
    {
        "Lincoln": "lincoln, massachusetts"
    },
    {
        " at a roadblock on the way to Concord. Prescott jumped his horse over a wall and escaped into the woods; he eventually reached Concord. Dawes also escaped, though he fell off his horse not long after and did not complete the ride.        Revere was captured and questioned by the British soldiers at gunpoint. He told them of the armys movement from Boston, and that British army troops would be in some danger if they approached Lexington, because of the large number of hostile militia gathered there. He and other captives taken by the patrol were still escorted east toward Lexington, until about a half mile from Lexington they heard a gunshot. The British major demanded Revere explain the gunfire, and Revere replied it was a signal to alarm the country . As the group drew closer to Lexington, the town bell began to clang rapidly, upon which one of the captives proclaimed to the British soldiers The bells aringing! The towns alarmed, and youre all dead men!  The British soldiers gathered and decided not to press further towards Lexington but instead to free the prisoners and head back to warn their commanders. The British confiscated Reveres horse and rode off to warn the approaching army column. Revere walked to Rev. ": null
    },
    {
        "Jonas Clarke": "jonas clarke"
    },
    {
        "s ": null
    },
    {
        "house": "hancock–clarke house"
    },
    {
        ", where Hancock and Adams were staying. As the battle on ": null
    },
    {
        "Lexington Green": "lexington green"
    },
    {
        " unfolded, Revere assisted Hancock and his family in their escape from Lexington, helping to carry a trunk of Hancocks papers.     The ride of the three men triggered a flexible system of alarm and muster that had been carefully developed months before, in reaction to the colonists impotent response to the ": null
    },
    {
        "Powder Alarm": "powder alarm"
    },
    {
        " of September 42 This system was an improved version of an old network of widespread notification and fast deployment of local militia forces in times of emergency. The colonists had periodically used this system all the way back to the early years of ": null
    },
    {
        "Indian wars": "american indian wars"
    },
    {
        " in the colony, before it fell into disuse in the ": null
    },
    {
        "French and Indian War": "french and indian war"
    },
    {
        ". In addition to other express riders delivering messages, bells, drums, alarm guns, bonfires, and a trumpet were used for rapid communication from town to town, notifying the rebels in dozens of eastern Massachusetts villages that they should muster their militias because the regulars in numbers greater than 42 were leaving Boston with possible hostile intentions. This system was so effective that people in towns  from Boston were aware of the armys movements while they were still unloading boats in Cambridge. Unlike in the Powder Alarm, the alarm raised by the three riders successfully allowed the militia to confront the British troops in Concord, and then harry them all the way back to Boston.     ": null
    },
    {
        "Henry Wadsworth Longfellow": "henry wadsworth longfellow"
    },
    {
        " popularized Paul Revere in The Midnight Ride of Paul Revere, a poem first published in 42 as part of  Tales of a Wayside Inn .        Because Boston ": null
    },
    {
        "was besieged": "siege of boston"
    },
    {
        " after the battles of Lexington and Concord, Revere could not return to the city, which was now firmly in British hands. He boarded in ": null
    },
    {
        "Watertown": "watertown, massachusetts"
    },
    {
        ", where he was eventually joined by Rachel and most of his children . After he was denied a commission in the ": null
    },
    {
        "Continental Army": "continental army"
    },
    {
        ", he tried to find other ways to be useful to the rebel cause. He was retained by the provincial congress as a courier, and he printed local currency which the congress used to pay the troops around Boston.        Since there was a desperate shortage of gunpowder, the provincial congress decided in November 42 to send him to ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        " to study the working of the only ": null
    },
    {
        "powder mill": "powder mill"
    },
    {
        " in the colonies, in the hopes that he might be able to build a second one in Massachusetts. Revere called on the mills owner, ": null
    },
    {
        "Oswald Eve": "oswald eve"
    },
    {
        ", armed with a letter from Continental Congressmen ": null
    },
    {
        "Robert Morris": "robert morris"
    },
    {
        " and ": null
    },
    {
        "John Dickinson": "john dickinson"
    },
    {
        " asking Eve to Chearfully & from Public Spirited Motives give Mr. Revere such information as will inable him to Conduct the business on his return home.  Eve showed Revere around the mill, but refused to give him detailed drawings unless he was first paid a substantial bribe. Despite this chilly reception, Revere was able to discern useful information from the visit. He also acquired, through the work of Samuel Adams, plans for another powder mill. This information enabled Revere to set up a powder mill at Stoughton . The mill produced tons of gunpowder for the Patriot cause.     Reveres friend and compatriot Joseph Warren was killed in the ": null
    },
    {
        "Battle of Bunker Hill": "battle of bunker hill"
    },
    {
        " on June 42 42 Because soldiers killed in battle were often buried in ": null
    },
    {
        "mass grave": "mass grave"
    },
    {
        "s without ceremony, Warrens grave was unmarked. On March 42 42 several days after the British army left Boston, Revere, Warrens brothers, and a few friends went to the battlefield and found a grave containing two bodies. After being buried for nine months, Warrens face was unrecognizable, but Revere was able to identify Warrens body because he had placed a false tooth in Warrens mouth, and recognized the wire he had used for fastening it. Warren was given a proper funeral and reburied in a marked grave.       Upon returning to Boston in 42 Revere was commissioned a ": null
    },
    {
        "major": "major"
    },
    {
        " of ": null
    },
    {
        "infantry": "infantry"
    },
    {
        " in the Massachusetts militia in that April, and transferred to the ": null
    },
    {
        "artillery": "artillery"
    },
    {
        " a month later. In November he was promoted to ": null
    },
    {
        "lieutenant colonel": "lieutenant colonel"
    },
    {
        ", and was stationed at ": null
    },
    {
        "Castle William": "castle william"
    },
    {
        ", defending Boston harbor. He was generally second or third in the chain of command, and on several occasions he was given command of the fort. He applied his engineering skills to maintaining the forts armaments, even designing and building a ": null
    },
    {
        "caliper": "caliper"
    },
    {
        " to accurately measure cannonballs and cannon bore holes. The service at Castle William was relatively isolated, and personality friction prompted some men to file complaints against Revere. The boredom was alleviated in late August 42 when Revere was sent with a troop of soldiers to escort prisoners taken in the ": null
    },
    {
        "Battle of Bennington": "battle of bennington"
    },
    {
        " to Boston, where they were confined on board prison ships, and again in September when he was briefly deployed to ": null
    },
    {
        "Rhode Island": "rhode island"
    },
    {
        ".        In August 42 Reveres regiment served in a combined Franco-American expedition whose objective was to capture the British base at ": null
    },
    {
        "Newport, Rhode Island": "newport, rhode island"
    },
    {
        ". His regiment was responsible for erecting and maintaining artillery batteries on ": null
    },
    {
        "Aquidneck Island": "aquidneck island"
    },
    {
        ". The attempt was abandoned by the French when their fleet was scattered in a storm, and Reveres regiment returned to Boston before the British sortied from Newport to force the ": null
    },
    {
        "Battle of Rhode Island": "battle of rhode island"
    },
    {
        ".          The British in June 42 established a new base on ": null
    },
    {
        "Penobscot Bay": "penobscot bay"
    },
    {
        " in present-day ": null
    },
    {
        "Maine": "maine"
    },
    {
        " . Massachusetts authorities called out the militia, pressed into service available shipping, and organized ": null
    },
    {
        "a major expedition": "penobscot expedition"
    },
    {
        " to dislodge the British. The expedition was a complete fiasco: its land and naval commanders squabbled over control of the expedition, and could not agree on strategy or tactics. The arrival of British reinforcements led to the destruction of the entire Massachusetts fleet. Revere commanded the artillery units for the expedition, and was responsible for organizing the artillery train. He participated in the taking of Banks Island, from which artillery batteries could reach the British ships anchored before ": null
    },
    {
        "Fort George": "fort george"
    },
    {
        ". He next oversaw the transport of the guns from Banks Island to a new position on the heights of the Bagaduce Peninsula that commanded the fort. Although Revere was in favor of storming the fort, Brigadier General ": null
    },
    {
        "Solomon Lovell": "solomon lovell"
    },
    {
        " opted for a siege instead. After further disagreements on how to proceed between Lovell and fleet commander ": null
    },
    {
        "Dudley Saltonstall": "dudley saltonstall"
    },
    {
        ", Lovell decided to return to the transports on August 42 a decision supported by Revere.     Late the next day British sails were spotted. A mad scramble ensued, and on the 42th the fleet was in retreat heading up the ": null
    },
    {
        "Penobscot River": "penobscot river"
    },
    {
        ". Revere and his men were put ashore with their stores, and their transports destroyed. At one point Brigadier General ": null
    },
    {
        "Peleg Wadsworth": "peleg wadsworth"
    },
    {
        " ordered Revere to send his barge in an attempt to recover a ship drifting toward the enemy position. Revere at first resisted, but eventually complied, and Wadsworth told him to expect formal charges over the affair. The incident separated Revere from his men. Moving overland, he eventually managed to regroup most of his troops, and returned to Boston on August 42 A variety of charges were made against Revere, some of which were exaggerated assignments of blame made by enemies he had made in his command at Castle William. The initial hearings on the matter in September 42 were inconclusive, but he was asked to resign his post. He repeatedly sought a full ": null
    },
    {
        "court-martial": "court-martial"
    },
    {
        " to clear his name, but it was not until February 42 that a court martial heard the issue, exonerating him.             During the Revolutionary War, Revere continued his efforts to move upwards in society into the gentry. After his failed efforts to become a military officer he attempted to become a merchant, but was hindered by a number of factors: while he was a fairly well-off member of the artisan class, he did not have the resources to afford the goods he would have sold as a merchant, nor were lenders in England willing to lend him the required startup capital. Other American merchants of the time collaborated with colleagues in England. However, Reveres inexperience as a merchant meant that he had not yet established such relationships and was not able to communicate as effectively on unfamiliar matters. Another factor preventing Reveres success as a merchant was the economic climate of the time period after the war known as the ": null
    },
    {
        "Confederation Period": "confederation period"
    },
    {
        "; while the colonies had seen a time of economic growth before the war, the colonies experienced a severe post-war depression, constraining the overall success of his business.     While Revere struggled as a merchant, his success as a silversmith enabled him to pursue and leverage more advanced technological developments for the purposes of mass production. For example, ": null
    },
    {
        "rolling": "rolling"
    },
    {
        " mills greatly improved the productivity of his silver shop and enabled his business to move further away from manufacturing high-end customized products in order to focus instead on the production of a more standardized set of goods. In the 42th century, the standard of living continuously improved in America, as genteel goods became increasingly available to the masses. Revere responded particularly well to this trend because his business was not solely manufacturing custom, high end purchases. Smaller products like teaspoons and buckles accounted for the majority of his work, allowing him to build a broad customer base.     Reveres increased efficiency left financial and human resources available for the exploration of other products, which was essential to overcoming the fluctuating post-war economic climate. In addition to increasing production, the flatting mill enabled Revere to move towards a more managerial position.            After the war, Revere became interested in metal work beyond gold and silver. By 42 he had invested some of the profits from his growing silverworking trade to construct a large ": null
    },
    {
        "furnace": "furnace"
    },
    {
        ", which would allow him to work with larger quantities of metals at higher temperatures. He soon opened an iron foundry in Bostons ": null
    },
    {
        "North End": "north end, boston"
    },
    {
        " that produced utilitarian cast iron items such as stove backs, fireplace tools, and window weights, marketed to a broad segment of Bostons population.  Many of Reveres business practices changed when he expanded his practice into ironworking, because he transitioned from just being an artisan to also being an entrepreneur and a manager. In order to make this transition successfully, Revere had to invest substantial quantities of investment capital and time in his foundry.         The quasi-": null
    },
    {
        "industrialization": "industrial revolution"
    },
    {
        " of his practice set Revere apart from his competition. Reveres rapid foundry success resulted from fortuitous timing, innate technical aptitude, thorough research, and the casting experience he gained from silverworking.  This technical proficiency allowed Revere to optimize his work and adapt to a new technological and entrepreneurial model. Reveres location also benefited his endeavors. Revere was entering the field of iron casting in a time when New England cities were becoming centers of industry. The nature of technological advancement was such that many skilled entrepreneurs in a number of fields worked together, in what is known by ": null
    },
    {
        "Nathan Rosenberg": "nathan rosenberg"
    },
    {
        " as ": null
    },
    {
        "technological convergence": "technological convergence"
    },
    {
        ", by which a number of companies work together on challenges in order to spur advances. By accessing the knowledge of other nearby metal workers, Revere was able to successfully explore and master new technologies throughout his career.         One of the biggest changes for Revere in his new business was organization of labor. In his earlier days, Revere primarily utilized the ": null
    },
    {
        "apprenticeship": "apprenticeship"
    },
    {
        " model standard for artisan shops at this time, but as his business expanded he hired employees to work for his foundry. Many manufacturers of the era found this transition from master to employer difficult because many employees at the onset of the Industrial Revolution identified themselves as ": null
    },
    {
        "skilled workers": "skilled workers"
    },
    {
        ", and thus wanted to be treated with the respect and autonomy accorded to ": null
    },
    {
        "artisans": "artisans"
    },
    {
        ". An artisan himself, Revere managed to avoid many of these labor conflicts by adopting a system of employment that still held trappings of the craft system in the form of worker freedoms such as work hour flexibility, wages in line with skill levels, and liquor on the job.         After mastering the iron casting process and realizing substantial profits from this new product line, Revere identified a burgeoning market for church bells in the religious revival known as the ": null
    },
    {
        "Second Great Awakening": "second great awakening"
    },
    {
        " that followed the war. Beginning in 42 he became one of Americas best-known ": null
    },
    {
        "bell casters": "revere bells"
    },
    {
        ", working with sons Paul Jr. and ": null
    },
    {
        "Joseph Warren Revere": "joseph warren revere"
    },
    {
        " in the firm ": null
    },
    {
        "Paul Revere & Sons": "paul revere  &  sons"
    },
    {
        ". This firm cast the first bell made in Boston and ultimately produced hundreds of bells, a number of which remain in operation to this day.     In 42 Revere decided to take the next step in the evolution of his business, expanding his bronze casting work by learning to cast cannon for the federal government, state governments, and private clients. Although the government often had trouble paying him on time, its large orders inspired him to deepen his contracting and seek additional product lines of interest to the military.     By 42 a growing percentage of his foundrys business came from a new product, copper bolts, spikes, and other fittings that he sold to merchants and the Boston naval yard for ship construction. In 42 Revere became a pioneer in the production of ": null
    },
    {
        "rolled copper": "copper sheathing"
    },
    {
        ", opening North Americas first copper mill south of Boston in ": null
    },
    {
        "Canton": "canton, massachusetts"
    },
    {
        ". Copper from the ": null
    },
    {
        "Revere Copper Company": "revere copper company"
    },
    {
        " was used to cover the original wooden dome of the ": null
    },
    {
        "Massachusetts State House": "massachusetts state house"
    },
    {
        " in 42 His copper and brass works eventually grew, through sale and corporate merger, into a large corporation, Revere Copper and Brass, Inc.       During his earlier days as an artisan, especially when working with silver products, Revere produced bespoke or customized goods. As he shifted to ironworking, he found the need to produce more standardized products, because this made production cheaper. To achieve the beginnings of standardization, Revere used identical molds for casting, especially in the fabrication of mass-produced items such as stoves, ovens, frames, and chimney backs. However, Revere did not totally embrace uniform production. For example, his bells and cannons were all unique products: these large objects required extensive fine-tuning and customization, and the small number of bells and cannon minimized the potential benefits of standardizing them. In addition, even the products that he made in large quantities could not be truly standardized due to technological and skill limitations. His products were rarely identical, but his processes were well systematized. He came to realize that the foundry oven melded the characteristics of tools and machines: it required skilled labor and could be used in a flexible manner to produce different products, but an expert could produce consistent output by following a standard set of production practices.           Revere was a Scottish Freemason. He was a member of Lodge St Andrews, No.42 . The Lodge continues to meet in Boston with the number 42 under and the jurisdiction of the ": null
    },
    {
        "Grand Lodge of Massachusetts": "grand lodge of massachusetts"
    },
    {
        ". The date he joined the Lodge is not known but was sometime after the inauguration of the Lodge on St Andrews Day, 42 November 42 and 42 May 42 when he is recorded in the ": null
    },
    {
        "Grand Lodge of Scotland": "grand lodge of scotland"
    },
    {
        " membership register as the Lodge Secretary. ": null
    },
    {
        "Joseph Warren": "joseph warren"
    },
    {
        " and ": null
    },
    {
        "William Palfrey": "william palfrey"
    },
    {
        " are also recorded, on the same page, as members of the Lodge and being Master and Senior Warden respectively. Registration Book No.42 , Grand Lodge of Scotland. Pp. 42 and 42 Cracking the Freemasons Code. Robert L D Cooper. 42 .     He subsequently became the ": null
    },
    {
        "Grand Master": "grand master"
    },
    {
        " of the ": null
    },
    {
        "Freemason": "freemason"
    },
    {
        "s of ": null
    },
    {
        "Massachusetts": "grand lodge of massachusetts"
    },
    {
        " when a box containing an assemblage of commemorative items was deposited under the cornerstone of the ": null
    },
    {
        "Massachusetts State House": "massachusetts state house"
    },
    {
        " on 42 July 42 by ": null
    },
    {
        "Governor": "governor of massachusetts"
    },
    {
        " Samuel Adams": "samuel adams"
    },
    {
        ", assisted by Grand Master Revere and Deputy Grand Master, Colonel ": null
    },
    {
        "William Scollay": "william scollay"
    },
    {
        ". , Rebecca Onion, ": null
    },
    {
        "Slate.com": "slate.com"
    },
    {
        ", 42 January 42 accessed 42 January 42            Revere remained politically active throughout his life. His business plans in the late 42s were often stymied by a shortage of adequate money in circulation. ": null
    },
    {
        "Alexander Hamilton": "alexander hamilton"
    },
    {
        "s national policies regarding banks and industrialization exactly matched his dreams, and he became an ardent ": null
    },
    {
        "Federalist": "federalist party"
    },
    {
        " committed to building a robust economy and a powerful nation. Of particular interest to Revere was the question of protective tariffs; he and his son sent a petition to Congress in 42 asking for protection for his sheet copper business. Stanwood, Edward. American Tariff Controversies in the Nineteenth Century. pg. 42 He continued to participate in local discussions of political issues even after his retirement in 42 and in 42 circulated a petition offering the government the services of Bostons artisans in protecting Boston during the ": null
    },
    {
        "War of 42": "war of 1812"
    },
    {
        ". Revere died on May 42 42 at the age of 42 at his home on Charter Street in Boston. He is buried in the ": null
    },
    {
        "Granary Burying Ground": "granary burying ground"
    },
    {
        " on ": null
    },
    {
        "Tremont Street": "tremont street"
    },
    {
        ".         After Reveres death, the family business was taken over by his oldest surviving son, Joseph Warren Revere. The copper works founded in 42 continues today as the Revere Copper Company, with manufacturing divisions in ": null
    },
    {
        "Rome, New York": "rome, new york"
    },
    {
        " and ": null
    },
    {
        "New Bedford, Massachusetts": "new bedford, massachusetts"
    },
    {
        ".      Reveres original silverware, engravings, and other works are highly regarded today, and can be found on display in museums including the ": null
    },
    {
        "Museum of Fine Arts, Boston": "museum of fine arts, boston"
    },
    {
        "  and the ": null
    },
    {
        "Metropolitan Museum of Art": "metropolitan museum of art"
    },
    {
        ".  The ": null
    },
    {
        "Revere Bell": "revere bell"
    },
    {
        ", presented in 42 to the ": null
    },
    {
        "Church of St. Andrew": "st andrews cathedral, singapore"
    },
    {
        " in ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " by his daughter, Mrs. Maria Revere Balestier, wife of American ": null
    },
    {
        "consul": "consul united states consuls in the early years"
    },
    {
        " Joseph Balestier": "joseph balestier"
    },
    {
        ", is now displayed in the ": null
    },
    {
        "National Museum of Singapore": "national museum of singapore"
    },
    {
        ". This is the only bell cast by the Revere foundry that is outside the United States. For a time, it was displayed behind velvet ropes in the foyer of the United States Embassy in Singapore.      The communities of ": null
    },
    {
        "Revere, Massachusetts": "revere, massachusetts"
    },
    {
        " and ": null
    },
    {
        "Revere": "revere, minnesota"
    },
    {
        ", ": null
    },
    {
        "Minnesota": "minnesota"
    },
    {
        " bear his name, as do ": null
    },
    {
        "Revere Beach": "revere beach"
    },
    {
        " in Revere, Massachusetts, Revere Avenue in ": null
    },
    {
        "The Bronx": "the bronx"
    },
    {
        ", ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ", Paul Revere Road in ": null
    },
    {
        "Arlington, Massachusetts": "arlington, massachusetts"
    },
    {
        ",  and Paul Revere Apartments  in ": null
    },
    {
        "Seattle": "seattle"
    },
    {
        ".     A 42-cent 42 U.S. ": null
    },
    {
        "postage stamp": "postage stamp"
    },
    {
        " in the ": null
    },
    {
        "Liberty Series": "liberty issue"
    },
    {
        " honors Paul Revere, featuring the portrait by ": null
    },
    {
        "Gilbert Stuart": "gilbert stuart"
    },
    {
        ". He also appears on the $42 ": null
    },
    {
        "Series EE U.S. Savings Bond": "united states treasury securityseries ee"
    },
    {
        ".      The rock group ": null
    },
    {
        "Paul Revere and the Raiders": "paul revere and the raiders"
    },
    {
        " had considerable popularity from the middle 42s through the early 42s. The bands namesake and organist was born Paul Revere Dick, named after Revere.      The song Me and Paul Revere , written by musician ": null
    },
    {
        "Steve Martin": "steve martin"
    },
    {
        " and performed with his bluegrass group Steve Martin and the ": null
    },
    {
        "Steep Canyon Rangers": "steep canyon rangers"
    },
    {
        ", was inspired by the tale of Paul Reveres ride and told from the point of view of Reveres horse, Brown Beauty.              In 42 over 42 years after Reveres death, ": null
    },
    {
        "Henry Wadsworth Longfellow": "henry wadsworth longfellow"
    },
    {
        " made the midnight ride the subject of his poem Paul Reveres Ride which opens:          Longfellows poem is not historically accurate, but the inaccuracies were deliberate. Longfellow had researched the historical event, using such works as ": null
    },
    {
        "George Bancroft": "george bancroft"
    },
    {
        "s History of the United States, but he ": null
    },
    {
        "changed the facts for poetic effect": "artistic license"
    },
    {
        ". The poem was one of a series in which he sought to create American legends; earlier examples include  The Song of Hiawatha  and  The Courtship of Miles Standish  . Longfellow was successful in creating a legend: Reveres stature rose significantly in the years following the poems publication.     Parts of the ride route in Massachusetts are now posted with signs marked Reveres Ride . The route follows Main Street in ": null
    },
    {
        "Charlestown": "charlestown, massachusetts"
    },
    {
        ", Broadway and Main Street in ": null
    },
    {
        "Somerville": "somerville, massachusetts"
    },
    {
        ", Main Street and High Street in ": null
    },
    {
        "Medford": "medford, massachusetts"
    },
    {
        ", Medford Street to ": null
    },
    {
        "Arlington": "arlington, massachusetts"
    },
    {
        " center, and ": null
    },
    {
        "Massachusetts Avenue": "massachusetts avenue"
    },
    {
        " the rest of the way through Lexington and into Lincoln. Reveres ride is reenacted annually.     Contrary to popular belief, Revere and Dawes were not the only riders; however, they were the only two to be noted in the poem. ": null
    },
    {
        "Samuel Prescott": "samuel prescott"
    },
    {
        " and ": null
    },
    {
        "Israel Bissell": "israel bissell"
    }
]