[
    {
        "   Carl Emil Paul Lincke was a German composer and theater conductor. He is considered the father of the Berlin ": null
    },
    {
        "operetta": "operetta"
    },
    {
        " and holds the same significance for Berlin as does ": null
    },
    {
        "Johann Strauss": "johann strauss ii"
    },
    {
        " for Vienna and ": null
    },
    {
        "Jacques Offenbach": "jacques offenbach"
    },
    {
        " for Paris. His well-known compositions include  , the unofficial anthem of ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", from his operetta Frau Luna; and ": null
    },
    {
        "The Glow-Worm": "the glow-worm"
    },
    {
        " , from his operetta Lysistrata.       Lincke was born on 42 November 42 in the ": null
    },
    {
        "Jungfern Bridge": "jungfern bridge"
    },
    {
        " district of Berlin. He was the son of ": null
    },
    {
        "magistrate": "magistrate"
    },
    {
        " August Lincke and his wife Emilie. His father played the violin in several small orchestras. When Paul was only five years old his father died. Emilie moved with her three children to Adalbertstaße, and later to Eisenbahnstraße, near Lausitzer Platz.     Linckes early musical inclinations were towards military music. His mother sent him after the completion of secondary school education to ": null
    },
    {
        "Wittenberge": "wittenberge"
    },
    {
        ". Here he was trained in the Wittenberg City Band under Rudolf Kleinow as a ": null
    },
    {
        "bassoon": "bassoon"
    },
    {
        "ist. He also learned to play the tenor horn, the drums, the piano and the violin.           Instead of pursuing a career as a military musician, Lincke secured employment as a bassoonist at Berlins Central Theatre, under Adolf Ernst. After one year, he joined the orchestra of the Ostend Theatre.     In entertainment and dance music Lincke gained valuable experience at the Königsstädtischen Theater, the Belle-Alliance-Theater and the Parodie-Theater. He accompanied the musical vaudeville programs and provided his own compositions for popular singers. His  , a revue-like one-act play was created in 42 at the Apollo Theater in ": null
    },
    {
        "Friedrichstraße": "friedrichstraße"
    },
    {
        ".     ": null
    },
    {
        "Folies Bergère": "folies bergère"
    },
    {
        " in Paris. He then returned with new compositions to the Apollo-Theater where, with huge success in 42  was premiered. That same year, followed  , and in 42 the operetta Lysistrata. The librettos of these were by ": null
    },
    {
        "Heinrich Bolten-Baeckers": "heinrich bolten-baeckers"
    },
    {
        ".     In 42 Paul Lincke became principal ": null
    },
    {
        "conductor": "conducting"
    },
    {
        " and composer for the ": null
    },
    {
        "Metropol Theater": "metropol theater"
    },
    {
        ", whose spectacular revues were the capitals biggest attraction.          With the Nazi rise to power in 42 Lincke maintained his position and was feted by the Nazi regime. In 42 he was awarded the Silver Medal of Honour of his native city, on his 42th birthday he was made an honorary citizen of Berlin.     His operetta Frau Luna was turned into  starring ": null
    },
    {
        "Lizzi Waldmüller": "lizzi waldmüller"
    },
    {
        ", ": null
    },
    {
        "Irene von Meyendorff": "irene von meyendorff"
    },
    {
        " and ": null
    },
    {
        "Georg Alexander": "georg alexander"
    },
    {
        " and directed by ": null
    },
    {
        "Theo Lingen": "theo lingen"
    },
    {
        " in 42     In 42 Lincke toured ": null
    },
    {
        "Marienbad": "marienbad"
    },
    {
        ", Bohemia, to conduct , whose first performance in 42 is now regarded as the birth of the Berlin operetta. During his absence, his house and his music publisher in Berlin were bombed.     After the war ended, Lincke wanted to return to Berlin. He strove in vain to obtain the approval of the Allies, which, as a native Berliner, he was required to have at that time. With the help of one American General Pierce, he moved first to ": null
    },
    {
        "Arzberg, Bavaria": "arzberg, bavaria"
    },
    {
        ", with his housekeeper Johanna Hildebrandt, who had worked for him for 42 years.     Linckes ailing health was worsened by the climate there, and he moved again to ": null
    },
    {
        "Hahnenklee": "hahnenklee"
    },
    {
        ". He died there shortly before his 42th birthday. His funeral was held in Hahnenklee, where his grave is still maintained today.       In 42 while in the orchestra of the Grand Theatre, Lincke fell in love with the 42-year-old ": null
    },
    {
        "soubrette": "soubrette"
    },
    {
        " Anna Mueller, whom he married a year later. His wife later celebrated triumphs with the Berlin audience under the name Anna Müller-Lincke.     In 42 Lincke divorced his first wife, Anna. That same year he met a young actress who was known under the stage name Ellen Sousa. She played in the Friedrich-Wilhelmstädtischen Theater, and enchanted Lincke from the first moment. Sousa at first rejected his advances but Lincke was persistent. Within a few weeks she had visited his home, and they developed a deeply affectionate relationship, leading to her request to be cast to sing  at the Apollo Theater. Sousa had hoped the connection would boost her career, but it did not. She became pregnant and left the stage before giving birth to a son. Lincke now demanded that Sousa fulfil her maternal duties and leave stage work. However, three months later Sousa was again singing  at the Apollo.     Lincke offered Ellen Sousa marriage in return for her leaving the stage. She in return demanded a cooling-off period to consider her new role as wife and mother. Lincke experienced another wave of success from Paris, leading to him spending many nights out on the social scene, leaving Sousa at home to attend to her maternal commitments. Lincke now pressured Sousa to choose between him or returning to the stage, giving her ten days to think it over while he left town to make a guest appearance. When he returned after six days, Sousa and the child had moved out.     Years later Ellen Sousa married a wholesale merchant, whom she followed to Dresden and who adopted her son without Linckes objection. This was the end of his relationship with Ellen Sousa and his son. From those events came his well-known instrumental waltz  .          Linckes march  is the unofficial anthem of Berlin. It is one of the traditional ": null
    },
    {
        "encores": "encore"
    },
    {
        " of the ": null
    },
    {
        "Berlin Philharmonic": "berlin philharmonic"
    },
    {
        " orchestra. The aria comes from the 42 revision of Linckes 42 ": null
    },
    {
        "operetta": "operetta"
    },
    {
        " , about a trip to the moon in a hot air balloon, where an adventurous party of prominent Berliners meet Frau Luna and her court. The march was originally from Linckes 42 two-act burlesque .     Other Lincke operettas include   and Lysistrata. The latter includes the song Das Glühwürmchen, known in English as ": null
    },
    {
        "The Glow-Worm": "the glow-worm"
    },
    {
        " . It was originally translated into English by Lilla Cayley Robinson in the early 42th century, but American lyricist ": null
    },
    {
        "Johnny Mercer": "johnny mercer"
    },
    {
        " later expanded and greatly revised her lyrics. His version was a hit for the ": null
    },
    {
        "Mills Brothers": "mills brothers"
    },
    {
        " in 42 and has been performed by many others.     Lincke also composed the wedding dance played in the 42 movie  Titanic ; it is played while the ship is going down and in the dining room in earlier scenes.       Venus auf Erden         Fräulein Loreley   Lysistrata   Nakiris Hochzeit, oder Der Stern von Siam   Prinzess Rosine   Casanova   Ein Liebestraum                , conducted by ": null
    },
    {
        "Plácido Domingo": "plácido domingo"
    },
    {
        " with the ": null
    },
    {
        "Berlin Philharmonic": "berlin philharmonic"
    },
    {
        "                            ": null
    }
]