[
    {
        "Paul Lansky  is an American composer.       Paul Lansky is an American composer. He was educated at Manhattans ": null
    },
    {
        "High School of Music and Art": "the high school of music and art"
    },
    {
        ", ": null
    },
    {
        "Queens College": "queens college"
    },
    {
        " and ": null
    },
    {
        "Princeton University": "princeton university"
    },
    {
        ", studying with ": null
    },
    {
        "George Perle": "george perle"
    },
    {
        " and ": null
    },
    {
        "Milton Babbitt": "milton babbitt"
    },
    {
        ", among others. Originally intending to pursue a career in performance, during 42–42 he played the French horn with the ": null
    },
    {
        "Dorian Wind Quintet": "dorian wind quintet"
    },
    {
        ". He left the group to attend graduate school. From 42 until his retirement in 42 he was on the faculty at ": null
    },
    {
        "Princeton University": "princeton university"
    },
    {
        " where he retired as the William Shubael Conant Professor of Music. He chaired the Department from 42–42 In 42 he received a lifetime achievement award from the ": null
    },
    {
        "Society for Electro-Acoustic Music in the United States": "society for electro-acoustic music in the united states"
    },
    {
        ". In 42–42 he was the inaugural composer in residence with the ": null
    },
    {
        "Alabama Symphony": "alabama symphony"
    },
    {
        ". In 42 he was elected to the ": null
    },
    {
        "American Academy of Arts and Letters": "american academy of arts and letters"
    },
    {
        ". He has received grants and awards from the ": null
    },
    {
        "Guggenheim Foundation": "john simon guggenheim memorial foundation"
    },
    {
        ", ": null
    },
    {
        "the Fromm Foundation": "the fromm foundation"
    },
    {
        " and ": null
    },
    {
        "the Koussevitsky foundation": "the koussevitsky foundation"
    },
    {
        ", ": null
    },
    {
        "the National Endowment for the Arts": "the national endowment for the arts"
    },
    {
        " and ": null
    },
    {
        "Chamber Music America": "chamber music america"
    },
    {
        ", among others.       Beginning in the mid 42s Lansky was among the first to experiment with the computer for sound synthesis. Until 42 this was his predominant focus. Since then he has concentrated on instrumental composition without any electronic involvement.     Sounds originating from real-world sources are the predominant focus of Lanskys computer music: traffic, kids in the kitchen, musical instruments, and most of all speech. Electronic synthesis is frequently used but the main sonic resources are transformations of recorded natural sounds. One of his first large pieces, Six Fantasies on a Poem by Thomas Campion  set the stage. It is based on a reading by his wife Hannah MacKay of a famous poem. The piece is not so much a setting of the poem as it is a study of the contours of a live reading of the poem. The work uses a technique known as Linear Predictive Coding, LPC, which was developed in the 42s by scientists as a data-reduction technique meant to economize on the amount of data needed for digital voice transmission and is used today in some cell phone communication. It allows for the separation of pitch and speed and the pitch contours of the speech can be altered independently of the speed. Each of the six movements explores a different aspect of speech. This led to a series of “chatter” pieces, Idle Chatter, etc. that fragment the speech into a percussive rap-like texture. Other projects included folksong settings , a portrait of a woman , a contemplation of letters and numbers , sounds of the highway Night Traffic, Ride, blues harmonica, electric guitar, piano improvisation and casual conversation. The bulk of his approximately 42 electronic compositions are contained on ten solo CDs. . While there are a few pieces for electronics and live instruments the bulk of Lanskys pieces are recorded tape pieces.     Lanskys works have attracted interest in various realms. They have been used by dance companies . His works frequently have a rhythmic groove that is attractive to dancers. In 42 he was the co-subject of a documentary film made for the European Arte network by ": null
    },
    {
        "Uli Aumueller": "uli aumueller"
    },
    {
        ", My Cinema for the Ears that deals with the use of natural sounds. A four-chord sequence from Lanskys first large computer piece Mild und leise was sampled by the English rock band ": null
    },
    {
        "Radiohead": "radiohead"
    },
    {
        " for the track ": null
    },
    {
        "Idioteque": "idioteque"
    },
    {
        " on their 42  Kid A  album.       Lansky used any available computing hardware: ": null
    },
    {
        "IBM": "ibm"
    },
    {
        " mainframes at first , then mini and micro computers by ": null
    },
    {
        "DEC": "digital equipment corporation"
    },
    {
        ", , and finally personal computers by ": null
    },
    {
        "NeXT": "next"
    },
    {
        ", ": null
    },
    {
        "Silicon Graphics": "silicon graphics"
    },
    {
        " and ": null
    },
    {
        "Apple": "apple inc."
    },
    {
        ". During the mainframe era computer time was scarce and expensive and this prompted Lansky to write his own software package called Mix, in ": null
    },
    {
        "Fortran": "fortran"
    },
    {
        ". This made it easier to assemble a composition voice-by-voice, section-by-section, even note-by-note, avoiding large expensive runs to create an entire piece at once. Mix had no scheduler and thus was not suitable for real-time synthesis. Mix used additive writes to the output device, analogous to overdubbing on tape. When the move was made to minis and micros Lansky ported Mix to the ": null
    },
    {
        "C programming language": "c programming language"
    },
    {
        " and called it CMix. During the late 42s a group led by Brad Garton at Columbia University created a version of this with a scheduler, ": null
    },
    {
        "RtCmix": "rtcmix"
    },
    {
        ", that was capable of real time synthesis. Starting in the mid 42s Lansky used a well-known software package called ": null
    },
    {
        "SuperCollider": "supercollider"
    },
    {
        ". Programs like Cmix and SuperCollider are script-based rather than driven by a graphical interface. This facilitated the creation of complex textures in works such as Idle Chatter, which contain thousands of short notes, frequently selected using random methods. This is sometimes called algorithmic composition.       During the mid 42s Lansky began to be approached by performers who were attracted to the performative-like aspects of his computer music. Percussionists in particular were attracted by pieces such as Table’s Clear, which resembles a gamelan made of pots and pans, and the chatter series. One of his first large percussion pieces was Threads, 42 written for the ": null
    },
    {
        "Sō Percussion": "sō percussion"
    },
    {
        " quartet. Since then there are about a dozen pieces for percussion instruments, alone and in various ensembles. Another focus has been classical guitar, alone and in combination: Semi-Suite, With the Grain , Partita A residency with the Alabama Symphony led to several orchestral pieces . Significant commissions came from the Library of Congress and the Chamber Music Society of Lincoln Center for the wind quintet The Long and Short of It, and Chamber Music America for a trio for the Janus Trio, Book of Memory, and for Sō Percussion, Springs. The 42 trio for horn, violin and piano, Etudes and Parodies won the 42 International Horn Society prize. Lanskys instrumental music is published by ": null
    },
    {
        "Carl Fischer": "carl fischer music"
    },
    {
        ". The bulk of his computer music as well as much instrumental music is available on ": null
    },
    {
        "Bridge Records": "bridge records"
    },
    {
        ".       Most of Lanskys works are basically tonal. In general terms this means the apparent background source for his pitch language is the diatonic scale rather than the chromatic or microtonal scale. He frequently uses traditional tonal syntax. During 42–42 he collaborated with ": null
    },
    {
        "George Perle": "george perle"
    },
    {
        " on an expansion of Perles 42-tone tonality, which led to Perles book of the same name. This approach basically establishes another metric for measuring and relating harmonies that has to do with symmetry. It is related to some music by Bartok. Some of Lanskys work such as Notes to Self, for piano, and It All Adds Up, for two pianos, use this approach. Lanskys instrumental music generally eschews extended instrumental techniques. He writes that he scratched that itch with computer music.     A long-term interest of Lanskys is music about music. Earlier examples of this are his computer pieces Guys Harp, about blues harmonica, and Not So Heavy Metal, about rock and roll guitar. More recent examples are Book of Memory, which comments on music from Machaut to Scriabin, Ancient Echoes, based on late42th-century dance music, and Ricercare Plus, inspired by 42th-century counterpoint.       Smalltalk, 42  Smalltalk on ": null
    },
    {
        "Discogs": "discogs"
    },
    {
        "    Homebrew, 42     More Than Idle Chatter, 42   Fantasies And Tableaux, 42     Folk Images, 42   Things She Carried, 42   Conversation Pieces, 42   Ride, 42   Alphabet Book, 42   Music Box, 42   Etudes and Parodies, 42   Threads, 42     Imaginary Islands, 42   Comix Trips, 42   Notes to Self, 42   Textures and Threads, 42   Contemplating Weather,42   Book of Memory,42   Idle Fancies": null
    }
]