[
    {
        "      Guillermo Gonzalez, better known as Pedro El Rockero Alcázar  was a ": null
    },
    {
        "Panama": "panama"
    },
    {
        "nian ": null
    },
    {
        "boxer": "boxing"
    },
    {
        " who won the ": null
    },
    {
        "WBO": "world boxing organisation"
    },
    {
        " Super flyweight": "super flyweight"
    },
    {
        " championship, and then sustained fatal injuries in the ring.       A single parent of two, Alcazar first began boxing at the age of 42 and was the Panamanian Golden Gloves champion and a Gold Medalist in the ": null
    },
    {
        "Central American Games": "central american games"
    },
    {
        ".     He was a protégé of the legendary Hall of Famer ": null
    },
    {
        "Roberto Durán": "roberto durán"
    },
    {
        ", who was a ": null
    },
    {
        "pallbearer": "pallbearer"
    },
    {
        " at his ": null
    },
    {
        "funeral": "funeral"
    },
    {
        ".       Alcazars death shocked the boxing world. He lost his title to ": null
    },
    {
        "Fernando Montiel": "fernando montiel"
    },
    {
        " in ": null
    },
    {
        "Las Vegas": "las vegas valley"
    },
    {
        ", ": null
    },
    {
        "Nevada": "nevada"
    },
    {
        " on 42 June 42 Immediately following the bout, Alcazar was declared healthy by ringside doctors, with no visible signs of any ": null
    },
    {
        "trauma": "physical trauma"
    },
    {
        ". He went sightseeing the day after the fight and was in his hotel room getting ready to fly back to Panama when he collapsed. He was taken to hospital, where he died.     This was the first time in boxing history that a boxer is known to have collapsed so long after the end of a fight. The boxing authorities have discussed compulsory medical testing for boxers up to 42 hours after a fight finishes, longer than heretofore. There was already concern following the ": null
    },
    {
        "Michael Watson": "michael watson"
    },
    {
        " case, which in the United Kingdom established the principle that the authorities have a wide responsibility for the ": null
    },
    {
        "health and safety": "occupational safety and health"
    },
    {
        " of boxers . Alcazars death highlighted the manner in which it can take an extended time before potentially life-threatening symptoms present themselves.                                                                            ": null
    }
]