[
    {
        "The Pendleton Civil Service Reform Act is a ": null
    },
    {
        "United States federal law": "united states federal law"
    },
    {
        " passed by the ": null
    },
    {
        "42th United States Congress": "47th united states congress"
    },
    {
        " and signed into law by President ": null
    },
    {
        "Chester A. Arthur": "chester a. arthur"
    },
    {
        " on January 42 42 The act mandates that most positions within the ": null
    },
    {
        "federal government": "federal government of the united states"
    },
    {
        " should be awarded on the basis of merit instead of political patronage.     By the late 42s, American politics operated on the ": null
    },
    {
        "spoils system": "spoils system"
    },
    {
        ", a political patronage practice in which officeholders awarded their allies with government jobs in return for financial and political support. Proponents of the spoils system were successful at blocking meaningful civil service reform until the ": null
    },
    {
        "assassination": "assassination of james a. garfield"
    },
    {
        " of President ": null
    },
    {
        "James A. Garfield": "james a. garfield"
    },
    {
        " in 42 The 42th Congress passed the Pendleton Civil Service Reform Act during its ": null
    },
    {
        "lame duck session": "lame duck session"
    },
    {
        " and President ": null
    },
    {
        "Chester A. Arthur": "chester a. arthur"
    },
    {
        ", himself a former spoilsman, signed the bill into law.     The Pendleton Civil Service Act provided for the selection of some government employees by competitive exams, rather than ties to politicians or political affiliation. It also made it illegal to fire or demote these government officials for political reasons and created the ": null
    },
    {
        "United States Civil Service Commission": "united states civil service commission"
    },
    {
        " to enforce the merit system. The act initially only applied to about ten percent of federal employees, but it now covers most federal employees.            Since the ": null
    },
    {
        "presidency of Andrew Jackson": "presidency of andrew jackson"
    },
    {
        ", presidents had increasingly made political appointments on the basis of political support rather than on the basis of merit, in a practice known as the ": null
    },
    {
        "spoils system": "spoils system"
    },
    {
        ". In return for appointments, these appointees were charged with raising campaign funds and bolstering the popularity of the president and the party in their communities. The success of the spoils system helped ensure the dominance of both the ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        " in the period before the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " and the ": null
    },
    {
        "Republican Party": "republican party"
    },
    {
        " in the period after the Civil War. Patronage became a key issue in elections, as many partisans in both major parties were more concerned about control over political appointments than they were about policy issues.     During the Civil War, Senator ": null
    },
    {
        "Charles Sumner": "charles sumner"
    },
    {
        " introduced the first major civil service reform bill, calling for the use of competitive exams to determine political appointments. Sumners bill failed to pass Congress, and in subsequent years several other civil service reform bills were defeated even as the public became increasingly concerned about public corruption. After taking office in 42 President ": null
    },
    {
        "Rutherford B. Hayes": "rutherford b. hayes"
    },
    {
        " established a special cabinet committee charged with drawing up new rules for federal appointments. Hayess efforts for reform brought him into conflict with the ": null
    },
    {
        "Stalwart": "stalwarts"
    },
    {
        ", or pro-spoils, branch of the Republican party, led by Senator ": null
    },
    {
        "Roscoe Conkling": "roscoe conkling"
    },
    {
        " of New York. With Congress unwilling to take action on civil service reform, Hayes issued an ": null
    },
    {
        "executive order": "executive order"
    },
    {
        " that forbade federal office holders from being required to make campaign contributions or otherwise taking part in party politics.     ": null
    },
    {
        "Chester A. Arthur": "chester a. arthur"
    },
    {
        ", the ": null
    },
    {
        "Collector of the Port of New York": "collector of the port of new york"
    },
    {
        ", and his subordinates ": null
    },
    {
        "Alonzo B. Cornell": "alonzo b. cornell"
    },
    {
        " and ": null
    },
    {
        "George H. Sharpe": "george h. sharpe"
    },
    {
        ", all Conkling supporters, refused to obey the presidents order. In September 42 Hayes demanded the three mens resignations, which they refused to give. Hayes was forced to wait until July 42 when, during a Congressional recess, he sacked Arthur and Cornell and replaced them with ": null
    },
    {
        "recess appointment": "recess appointment"
    },
    {
        "s. Despite opposition from Conkling, both of Hayess nominees were confirmed by the Senate, giving Hayes his most significant civil service reform victory. For the remainder of his term, Hayes pressed Congress to enact permanent reform legislation and restore the dormant ": null
    },
    {
        "United States Civil Service Commission": "united states civil service commission"
    },
    {
        ", even using his last ": null
    },
    {
        "annual message": "state of the union address"
    },
    {
        " to Congress in 42 to appeal for reform.            In 42 Democratic Senator ": null
    },
    {
        "George H. Pendleton": "george h. pendleton"
    },
    {
        " of Ohio introduced legislation to require the selection of civil servants based on merit as determined by an ": null
    },
    {
        "examination": "civil service examination"
    },
    {
        ", but the measure failed to pass. Pendletons bill was largely based on reforms proposed by the ": null
    },
    {
        "Jay": "john jay"
    },
    {
        " Commission, which Hayes had assigned to investigate the Port of New York. It also expanded similar civil service reforms attempted by President ": null
    },
    {
        "Franklin Pierce": "franklin pierce"
    },
    {
        " 42 years earlier.     Hayes declined to seek a second term as president, and was succeeded by fellow Republican ": null
    },
    {
        "James A. Garfield": "james a. garfield"
    },
    {
        ", who won the ": null
    },
    {
        "42 presidential election": "1880 united states presidential election"
    },
    {
        " on a ticket with former Port Collector Chester A. Arthur. In 42 President Garfield was ": null
    },
    {
        "assassinated": "assassination of james a. garfield"
    },
    {
        " by ": null
    },
    {
        "Charles Guiteau": "charles guiteau"
    },
    {
        ", who believed that he had not received an appointment by Garfield because of his own affiliation with the Stalwarts. Garfield died on September  42 42 and was succeeded by Vice President Arthur. Many worried about how Arthur would act as president; the  New York Times , which had supported Arthur earlier in his career, wrote Arthur is about the last man who would be considered eligible for the position.      Garfields assassination by a deranged office seeker amplified the public demand for reform. Civil service reformers established the ": null
    },
    {
        "National Civil Service Reform League": "national civil service reform league"
    },
    {
        " and undertook a major public campaign for reform, arguing that the spoils system had played a major role in the assassination of Garfield. In President Arthurs first ": null
    },
    {
        "annual address to Congress": "state of the union"
    },
    {
        ", Arthur requested civil service reform legislation, and Pendleton again introduced his bill, which again did not pass. Democrats, campaigning on the reform issue, won control of the House of Representatives in the ": null
    },
    {
        "42 congressional elections": "united states elections, 1882"
    },
    {
        ".     The partys disastrous performance in the 42 elections helped convince many Republicans to support the civil service reform during the 42 ": null
    },
    {
        "lame-duck session": "lame-duck session"
    },
    {
        " of Congress. The election results were seen as a public mandate for civil service reform, but many Republicans also wanted to pass a bill so that they could craft the legislation before losing control of Congress, allowing the party to take credit for the bill and to protect Republican officeholders from dismissal. The Senate approved Pendletons bill 42–42 and the House soon concurred by a vote of 42–42 Nearly all congressional opposition to the Pendleton bill came from Democrats, though a majority of Democrats in each chamber of Congress voted for the bill. Arthur signed the Pendleton Civil Service Reform Act into law on January  42 42         The Pendleton Civil Service Reform Act provided for selection of some government employees by competitive exams rather than ties to politicians, and made it illegal to fire or demote some government officials for political reasons.  The act initially applied only to ten percent of federal jobs, but it allowed the president to expand the number of federal employees covered by the act.     The law also created the ": null
    },
    {
        "United States Civil Service Commission": "united states civil service commission"
    },
    {
        " to oversee civil service examinations and outlawed the use of assessments, fees that political appointees were expected to pay to their respective political parties as the price for their appointments. These assessments had made up a majority of political contributions in the era following Reconstruction.         To the surprise of his critics, Arthur acted quickly to appoint the members of the newly-created Civil Service Commission, naming reformers ": null
    },
    {
        "Dorman Bridgman Eaton": "dorman bridgman eaton"
    },
    {
        ", ": null
    },
    {
        "John Milton Gregory": "john milton gregory"
    },
    {
        ", and ": null
    },
    {
        "Leroy D. Thoman": "leroy d. thoman"
    },
    {
        " as commissioners. The commission issued its first rules in May 42; by 42 half of all postal officials and three-quarters of the ": null
    },
    {
        "Customs Service": "united states customs service"
    },
    {
        " jobs were to be awarded by merit. During his first term, President ": null
    },
    {
        "Grover Cleveland": "grover cleveland"
    },
    {
        " expanded the number of federal positions subject to the merit system from 42 to 42. Partly due to Clevelands efforts, between 42 and 42 the percentage of federal employees protected by the Pendleton Act would rise from twelve percent to approximately forty percent. Welch, 42–42 The act now covers a majority of federal employees.      Although state patronage systems and numerous federal positions were unaffected by the law, Karabell argues that the Pendleton Act was instrumental in the creation of a professional civil service and the rise of the modern ": null
    },
    {
        "bureaucratic": "bureaucracy"
    },
    {
        " state. The law also caused major changes in campaign finance, as the parties were forced to look for new sources of campaign funds, such as wealthy donors.": null
    }
]