[
    {
        "   The Pennyroyal Plateau is a large area of ": null
    },
    {
        "Kentucky": "kentucky"
    },
    {
        " that features rolling hills, ": null
    },
    {
        "cave": "cave"
    },
    {
        "s, and ": null
    },
    {
        "karst": "karst"
    },
    {
        " topography in general. It is named for a ": null
    },
    {
        "wild mint": "hedeoma pulegioides"
    },
    {
        " that grows in the area. It is also called the Mississippian Plateau, for the ": null
    },
    {
        "Mississippian": "mississippian"
    },
    {
        " geologic age in which it was formed.     The Pennyroyal is bordered by the ": null
    },
    {
        "Pottsville Escarpment": "pottsville escarpment"
    },
    {
        " in the east. The Pottsville Escarpment is the transition zone from the central part of Kentucky to the higher and geologically younger ": null
    },
    {
        "Cumberland Plateau": "cumberland plateau"
    },
    {
        " in the eastern part of the state.   The Pennyroyal is bordered on the north by ": null
    },
    {
        "Muldraugh Hill": "muldraugh hill"
    },
    {
        ", the geological escarpment that forms the transition from the geologically older ": null
    },
    {
        "Bluegrass": "bluegrass region"
    },
    {
        " to the Pennyroyal. This is a series of knobs and ridges based on hard ": null
    },
    {
        "siltstone": "siltstone"
    },
    {
        "s.     The Pennyroyal is bordered on the west by the younger ": null
    },
    {
        "Jackson Purchase": "jackson purchase"
    },
    {
        ". The Pennyroyal is often thought by non-geologists to include the ": null
    },
    {
        "West Kentucky Coal Field": "west kentucky coal field"
    },
    {
        " of ": null
    },
    {
        "Pennsylvanian": "pennsylvanian"
    },
    {
        " age, located in the northwestern area of the state, as the southeastern part of the ": null
    },
    {
        "Illinois Basin": "illinois basin"
    },
    {
        ". The coalfield and the Pennyroyal are of different geologic ages and are separated by the Clifty Region, largely of Pennsylvanian sandstone, occasionally bituminous; the boundary with the Pennyroyal is the ": null
    },
    {
        "Dripping Springs Escarpment": "dripping springs escarpment"
    },
    {
        ".     To the south, the Pennyroyal continues as the ": null
    },
    {
        "Highland Rim": "highland rim"
    },
    {
        " of ": null
    },
    {
        "Middle Tennessee": "middle tennessee"
    },
    {
        ".     The Pennyroyal is largely in farmland where the bedrock is ": null
    },
    {
        "limestone": "limestone"
    },
    {
        ", and most of the Pennyroyal is based on Mississippian limestone, particularly the ": null
    },
    {
        "St. Louis Limestone": "st. louis limestone"
    },
    {
        " or ": null
    },
    {
        "Ste. Genevieve Limestone": "ste. genevieve limestone"
    },
    {
        ". In some areas, the limestone is capped with a soft sandstone. This kind of formation is featured in the ": null
    },
    {
        "Mammoth Cave": "mammoth cave"
    },
    {
        " area, and has enabled the formation of the worlds most extensive ": null
    },
    {
        "cave": "cave"
    },
    {
        " system. Numerous other caves exist in the Pennyroyal, where some of the most intensely cave-forming limestones of the world are to be found.     Where the capping sandstone is intact, the land surface is usually forested, rugged hills.                     ": null
    }
]