[
    {
        "In ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", Pentheus  was a king of ": null
    },
    {
        "Thebes": "ancient thebes"
    },
    {
        ". His father was ": null
    },
    {
        "Echion": "echion"
    },
    {
        " , the wisest of the ": null
    },
    {
        "Spartoi": "spartoi"
    },
    {
        ". His mother was ": null
    },
    {
        "Agave": "agave"
    },
    {
        ", the daughter of ": null
    },
    {
        "Cadmus": "cadmus"
    },
    {
        ", the founder of Thebes, and the goddess ": null
    },
    {
        "Harmonia": "harmonia"
    },
    {
        ". His sister was ": null
    },
    {
        "Epeiros": "epirus"
    },
    {
        ".     Much of what is known about the character comes from the interpretation of the myth in ": null
    },
    {
        "Euripides": "euripides"
    },
    {
        " tragic play,  The Bacchae .       The story of Pentheus resistance to Dionysus and his subsequent punishment is presented by Euripides as follows.     Cadmus, the king of Thebes, abdicated due to his old age in favor of his grandson Pentheus. Pentheus soon banned the worship of the god ": null
    },
    {
        "Dionysus": "dionysus"
    },
    {
        ", who was the son of his aunt ": null
    },
    {
        "Semele": "semele"
    },
    {
        ", and did not allow the women of Cadmeia to join in his rites.     An angered Dionysus caused Pentheus mother ": null
    },
    {
        "Agave": "agave"
    },
    {
        " and his aunts ": null
    },
    {
        "Ino": "ino"
    },
    {
        " and ": null
    },
    {
        "Autonoë": "autonoë"
    },
    {
        ", along with all the other women of Thebes, to rush to ": null
    },
    {
        "Mount Cithaeron": "mount cithaeron"
    },
    {
        " in a Bacchic frenzy. Because of this, Pentheus imprisoned Dionysus, thinking the man simply a follower, but his chains fell off and the jail doors opened for him.     Dionysus, disguised as a woman, lured Pentheus out to spy on the Bacchic rites, where Pentheus expected to see sexual activities. The daughters of Cadmus saw him in a tree and thought him to be a wild animal. They pulled Pentheus down and tore him limb from limb . When his true identity was later discovered, officials exiled the women from Thebes. Some say that his own mother was the first to attack him, tearing his arm off and then tearing off his head. She placed the head on a stick and took it back to Thebes, but only realized whose head it was after meeting her father Cadmus.     The name Pentheus , as ": null
    },
    {
        "Dionysus": "dionysus"
    },
    {
        " and ": null
    },
    {
        "Tiresias": "tiresias"
    },
    {
        " both point out, means Man of Sorrows and derives from πένθος, pénthos, sorrow or grief, especially the grief caused by the death of a loved one. His name appeared to mark him for tragedy. Pentheus was succeeded by his uncle ": null
    },
    {
        "Polydorus": "polydorus"
    },
    {
        ".     Before or possibly after Pentheus was killed, his wife gave birth to a son named ": null
    },
    {
        "Menoeceus": "menoeceus"
    },
    {
        ", who became the father of ": null
    },
    {
        "Creon": "creon"
    },
    {
        " and ": null
    },
    {
        "Jocasta": "jocasta"
    },
    {
        ". He became the grandfather of ": null
    },
    {
        "Oedipus": "oedipus"
    },
    {
        ".     The story of Pentheus is also discussed by ": null
    },
    {
        "Ovid": "ovid"
    },
    {
        " in his  Metamorphoses  . Ovids version diverges from Euripides work in several areas. In Ovids Metamorphoses, King Pentheus is warned by the blind seer ": null
    },
    {
        "Tiresias": "tiresias"
    },
    {
        " to welcome Bacchus or else Your blood poured out and defile the woods and your mother and her sisters... Pentheus dismisses Tiresias and ignores his warnings. As ": null
    },
    {
        "Thebes": "ancient thebes"
    },
    {
        " succumbs to the dementia and the delirium of the new god , Pentheus laments the fall of his kingdom and demands the arrest of Bacchus. His guards instead arrest ": null
    },
    {
        "Acoetes": "acoetes"
    }
]