[
    {
        "      Pere Bosch-Gimpera  was a ": null
    },
    {
        "Spanish": "spain"
    },
    {
        "-born Mexican ": null
    },
    {
        "archaeologist": "archaeologist"
    },
    {
        " and ": null
    },
    {
        "anthropologist": "anthropologist"
    },
    {
        ".     He arrived in Mexico with many other intellectuals during the ": null
    },
    {
        "Spanish Civil War": "spanish civil war"
    },
    {
        ". He became a Mexican citizen in 42       Although he began studying Law, he changed to Philology, in which he obtained a doctorate in 42 With the aim of becoming professor of Greek he also obtained a doctorate in History in 42 From 42 to 42 he studied Greek Philology, Prehistory and Ancient History in Berlin, with the aid of a scholarship granted by the Junta de Ampliación de Estudios. Once there, the advice of Wilamowitz-Moellendorf made him change course and he moved from Greek language and literature to prehistoric archaeology.     From 42 to 42 he was chair of Ancient and Medieval History at the University of Barcelona. At the same time he served as director of the Archaeological Research Service of the “Institut dEstudis Catalans”. From the publication in 42 of Prehistòria Catalana, he strongly advocated the use of Catalan in scientific publications. Between 42 and 42 he led the archaeological section of the museums of Barcelona; from 42 to 42 he was dean of the Faculty of Philosophy and Philology; between 42 and 42 he was rector of the University.     Involved in Catalan politics, he was Minister of Justice of Catalonia in the Government of Lluís Companys. After the events of 42 October 42 he was made prisoner along with other members of the Catalan Government on the ship Uruguay, which aroused international complaints. After the Spanish Civil War he went into exile in Mexico, together with many intellectuals. Subsequently, he suffered from a vilifying campaign at the University of Barcelona. He acquired Mexican nationality in 42     He also taught at the universities of Berlin , Edinburgh , Oxford , Paris and Heidelberg , among other European universities. From 42 he was professor at the Autonomous University and the School of Archaeology at the University of Mexico City, positions he held until his death in 42   He was also a professor at the University of Guatemala , director of the Division of Philosophy and Humanities of UNESCO , and secretary general of the Union of Anthropological and Ethnological Sciences       The most important:     Honorary member of the Royal Anthropological Institute of Great Britain and Ireland Society of Antiquaries of London   Honorary member of the Institut dEstudis Catalans of Barcelona   Honorary member of the Deutsches Archaeologisches Institut of Berlín   Honorary member of the Hispanic Society of America of ": null
    },
    {
        "Washington": "washington, d.c."
    },
    {
        " Académie des Inscriptions et Belles Lettres of ": null
    },
    {
        "Paris": "paris"
    },
    {
        " Pontificia Academia Romana di Archeologia of ": null
    },
    {
        "Rome": "rome"
    },
    {
        " Archaeological Society of Jutland       Prehistòria Catalana: edats de la pedra i dels metalls, colonització grega, etnografia   La arqueología preromana hispánica   Etnología de la Península Ibérica   El poblamiento antiguo y la formación de los pueblos de España   El problema indoeuropeo   El Próximo Oriente en la Antigüedad   La Universitat i Catalunya   Historia de Oriente   La América precolombina   Las raíces de Europa   La América prehispánica          at the ": null
    },
    {
        "Universidad de Michoacán": "universidad de michoacán"
    },
    {
        "                                                     ": null
    }
]