[
    {
        "           Perfect Dark is a ": null
    },
    {
        "first-person shooter": "first-person shooter"
    },
    {
        " developed by ": null
    },
    {
        "Rare": "rare"
    },
    {
        " and released for the ": null
    },
    {
        "Nintendo 42": "nintendo 64"
    },
    {
        " video game console in 42 It is the first game of the  Perfect Dark  series and follows ": null
    },
    {
        "Joanna Dark": "joanna dark"
    },
    {
        ", an agent of the Carrington Institute research centre, as she attempts to stop an ": null
    },
    {
        "extraterrestrial": "extraterrestrial life"
    },
    {
        " conspiracy by rival corporation dataDyne. The game features a ": null
    },
    {
        "campaign": "campaign setting"
    },
    {
        " mode where a single player must complete a series of ": null
    },
    {
        "levels": "level"
    },
    {
        " under certain difficulty settings to progress through the story. It also features a range of ": null
    },
    {
        "multiplayer": "multiplayer video game"
    },
    {
        " options, including a ": null
    },
    {
        "co-operative": "cooperative gameplay"
    },
    {
        " mode and traditional ": null
    },
    {
        "deathmatch": "deathmatch"
    },
    {
        " settings with computer-controlled ": null
    },
    {
        "bots": "video game bot"
    },
    {
        ".     As a ": null
    },
    {
        "spiritual successor": "spiritual successor"
    },
    {
        " to Rares 42 first-person shooter  GoldenEye 42 , Perfect Dark shares many features with its predecessor and runs on an upgraded version of its ": null
    },
    {
        "engine": "game engine"
    },
    {
        ". Game designer ": null
    },
    {
        "Martin Hollis": "martin hollis"
    },
    {
        ", who had directed GoldenEye 42, led the games development for the first 42 months of its three-year development cycle. The game is technically one of the most advanced titles for the Nintendo 42 and requires an ": null
    },
    {
        "Expansion Pak": "expansion pak"
    },
    {
        " to access the campaign mode and most of the multiplayer features. Shortly before the games release, a feature which would have allowed players to place a photograph of their choice onto the face of their multiplayer ": null
    },
    {
        "character": "player character"
    },
    {
        " was cut due to sensitive issues surrounding the ability for players to attack images of real people.     Upon release, Perfect Dark received critical acclaim and sold relatively well, eventually joining Nintendos ": null
    },
    {
        "Players Choice": "nintendo selects"
    },
    {
        " game selection. Although critics widely praised its graphics, ": null
    },
    {
        "artificial intelligence": "artificial intelligence in video games"
    },
    {
        ", and number of multiplayer options, they frequently criticised its occasional ": null
    },
    {
        "frame rate": "frame rate"
    },
    {
        " drops. The game received the ": null
    },
    {
        "BAFTA Interactive Entertainment": "bafta interactive entertainment awards"
    },
    {
        " Moving Images Award for 42 and the ": null
    },
    {
        "Golden Satellite Award": "golden satellite award"
    },
    {
        " for Best Interactive Product in 42 The game is occasionally cited as one of the ": null
    },
    {
        "greatest video games of all time": "list of video games considered the best"
    },
    {
        ". A ": null
    },
    {
        "remaster": "remaster"
    },
    {
        ", also titled  Perfect Dark , featuring enhanced graphics and online multiplayer, was released in 42       Perfect Dark is a ": null
    },
    {
        "first-person shooter": "first-person shooter"
    },
    {
        " where players must complete ": null
    },
    {
        "levels": "level"
    },
    {
        " to unlock content and progress through the games storyline. Players manoeuvre their ": null
    },
    {
        "character": "player character"
    },
    {
        " from a ": null
    },
    {
        "first-person": "first-person"
    },
    {
        " perspective and have the ability to lean left or right, look up or down, crouch, crawl, and drop from most ledges. However, there is no jump ability. Interaction with the environment is via a single ": null
    },
    {
        "context-sensitive": "context-sensitive user interface"
    },
    {
        " button, which can activate computers, operate lifts, and open doors. Players can carry an unlimited number of weapons, ranging from ": null
    },
    {
        "handgun": "handgun"
    },
    {
        "s to ": null
    },
    {
        "assault rifle": "assault rifle"
    },
    {
        "s, ": null
    },
    {
        "rocket launcher": "rocket launcher"
    },
    {
        "s, a ": null
    },
    {
        "shotgun": "shotgun"
    },
    {
        ", a ": null
    },
    {
        "sniper rifle": "sniper rifle"
    },
    {
        ", and ": null
    },
    {
        "combat knives": "combat knife"
    },
    {
        ". Besides their primary mode of fire, weapons have a secondary function that enables an alternate fire mode or grants players special abilities. For example, the secondary function of the K42 Avenger assault rifle detects threats like explosive devices. Most weapons have a finite ": null
    },
    {
        "magazine": "magazine"
    },
    {
        " and must be reloaded after a certain number of shots. Some can also be used ": null
    },
    {
        "in duplicate": "dual wield"
    },
    {
        ", one in each hand.     Players have a certain amount of ": null
    },
    {
        "health": "health"
    },
    {
        " which decreases when attacked by opponents. Although the game does not feature health recovery items, players can pick up shields that protect them with a secondary health bar. Players and opponents can disarm each other at close range, and players may use this feature to steal weapons or knock foes unconscious. Damage taken during combat is location-based, with a shot to the torso causing more damage than a shot to a limb. A number of tutorials and training activities can be taken in the games ": null
    },
    {
        "home level": "home level"
    },
    {
        ". The most notable of these is the ": null
    },
    {
        "shooting range": "shooting range"
    },
    {
        ", where players can test their proficiency with the games weapons in individual challenges. In addition to training activities, players can find information about the games diverse locations and characters, which are gradually unlocked as they complete levels.            Perfect Dark features a ": null
    },
    {
        "campaign": "campaign setting"
    },
    {
        " mode where a single player controls the games protagonist, ": null
    },
    {
        "Joanna Dark": "joanna dark"
    },
    {
        ", through a series of levels collected together into missions. In each level, the player must complete a set of objectives while opponents controlled by the games ": null
    },
    {
        "artificial intelligence": "artificial intelligence in video games"
    },
    {
        " try to hinder the players progress. Objectives generally require the recovery and use of high-tech gadgets like ": null
    },
    {
        "night-vision googles": "night-vision device"
    },
    {
        " or door decoders. The player has certain freedom as to how they want to approach encounters with opponents and many objectives can be completed in a ": null
    },
    {
        "nonlinear": "nonlinear gameplay"
    },
    {
        " order. ": null
    },
    {
        "Stealth": "stealth game"
    },
    {
        " is an important element of the gameplay because the player can kill opponents without being seen or remain undetected by using disguises. If Joanna fails an objective or her health is fully depleted, the player must start the level again from the beginning.     Each level can be played on three distinct difficulty settings. These affect aspects such as the number of objectives that must be completed, damage taken from opponents, the effectiveness of the games optional aiming assistance, and the availability of ammunition and protective shields. Four bonus levels may be unlocked by completing the campaign on each difficulty setting and all the challenges in the firing range. Some of these bonus levels allow the player to assume the role of a different character. If all the levels have been completed on the highest difficulty, an additional setting becomes available, allowing the player to customise various aspects of the games opponents, such as their health, aiming accuracy, and the damage they inflict. The player may also unlock ": null
    },
    {
        "cheats": "cheating in video games"
    },
    {
        " by completing levels within a certain time limit.     The campaign includes a ": null
    },
    {
        "co-operative": "cooperative gameplay"
    },
    {
        " mode, allowing two players, or one player and up to four computer-controlled ": null
    },
    {
        "bots": "video game bot"
    },
    {
        ", to tackle a level together. If two players play, the game uses a ": null
    },
    {
        "split screen": "split screen"
    },
    {
        " display, with the option to split horizontally or vertically. Options such as ": null
    },
    {
        "friendly fire": "friendly fire"
    },
    {
        " can be disabled and only one player is required to survive a level. A Counter-Operative mode is also included, allowing one player to play a level as Joanna while another takes over the role of an opponent while attempting to stop her. Although the player-controlled opponent has less health than Joanna, the opposing player can take control of another opponent at any time by swallowing a ": null
    },
    {
        "suicide pill": "suicide pill"
    },
    {
        ". The opposing player also reappears as another opponent when defeated by the player controlling Joanna.       Perfect Dark features a ": null
    },
    {
        "deathmatch": "deathmatch"
    },
    {
        " multiplayer": "multiplayer video game"
    },
    {
        " mode where up to four players and eight computer-controlled bots can compete against each other in several arenas. Again, a split-screen is used if more than one player are playing simultaneously. Players start a game unarmed and with a certain amount of health. Weapons and ammunition are placed around the arena in preset positions. Once a player is killed, they are regenerated elsewhere in the arena, once again unarmed. The overall objective of each game is determined by the scenario being played. Scenarios range from the traditional deathmatch mode, where players score points by killing opponents, to objective-based games such as ": null
    },
    {
        "Capture the Flag": "capture the flag"
    },
    {
        " and ": null
    },
    {
        "King of the Hill": "king of the hill"
    },
    {
        ". Other scenarios include Hold the Briefcase, where players must take a briefcase and survive with it for as long as possible, and Hacker Central, a gametype where players score points by hacking a computer system using a data uplink device.     Aspects of a deathmatch game can be highly customised, including the chosen arena, the winning conditions, and the ability to choose what weapons and items appear where in the arena. Players can also be grouped into teams or compete individually, and they can optionally be shown coloured according to their team. The appearance, team affiliation, skill level and pre-set behaviours of each computer-controlled bot can be customised. Pre-set behaviours range from them pursuing the highest-scoring player to exclusively chasing the player who killed them last. Other behaviours restrict bots to only attack players using fists and disarming moves. On higher skill levels, bots perform actions at a superhuman level. Players may also issue commands to bots of their team to perform certain tasks. For example, a player can order an allied bot to defend an area or attack a designated opponent.     The multiplayer mode includes 42 pre-set challenges against bots that may be tackled by one or more players. These challenges cover a variety of game types, weapon arrangements, and level setups. By completing challenges, additional features such as new weapons, player models, and bot behaviours are unlocked. At the end of a match, the overall results are shown, alongside information about the individual players performance. The game keeps track of player statistics such as damage dealt and distance travelled, and awards players with medals based on how well they performed. Players are also ranked according to their performance; the better the performance, the higher the grade. The players overall progress, multiplayer setups, and character profiles can be saved to the ": null
    },
    {
        "Nintendo 42": "nintendo 64"
    },
    {
        " game cartridge or a ": null
    },
    {
        "Controller Pak": "controller pak"
    },
    {
        ". The game also supports the ": null
    },
    {
        "Rumble Pak": "rumble pak"
    },
    {
        ".       Perfect Dark is set in 42 against the backdrop of an interstellar war between two alien races: the Maians, who resemble the archetypal ": null
    },
    {
        "Grey alien": "grey alien"
    },
    {
        ", and the Skedar, ": null
    },
    {
        "reptile": "reptile"
    },
    {
        "-like creatures who use a ": null
    },
    {
        "cloaking device": "cloaking device"
    },
    {
        " to appear as ": null
    },
    {
        "Nordic": "nordic aliens"
    },
    {
        " men. Using this device, they can interact with humans on Earth without appearing overtly suspicious. Meanwhile, on Earth, there is an ongoing rivalry between two factions: The Carrington Institute, a research centre founded by Daniel Carrington that secretly operates an espionage group in league with the Maians, and dataDyne, a ": null
    },
    {
        "defence contractor": "defence contractor"
    },
    {
        " corporation headed by Cassandra de Vries. In exchange for creating an ": null
    },
    {
        "AI": "artificial intelligence"
    },
    {
        " capable of ": null
    },
    {
        "cracking": "software cracking"
    },
    {
        " an ancient alien spacecraft buried on the bed of the ": null
    },
    {
        "Pacific Ocean": "pacific ocean"
    },
    {
        ", the Skedar have agreed to supply dataDyne with enough alien technology to become the biggest corporation on Earth.     The player is cast as Joanna Dark, an agent of the Carrington Institute whose excellent scores in training have earned her the codename Perfect Dark. On her first mission, she is sent to extract a ": null
    },
    {
        "defector": "defection"
    },
    {
        " known as Dr. Caroll from a dataDyne laboratory. Dr. Caroll is revealed to be the AI created by dataDyne, and is worried about the mission for which it had been designed. After the extraction, Carrington is held captive at his private villa by dataDyne soldiers. When Joanna rescues him, she is informed that Dr. Caroll has been taken to a dataDyne ": null
    },
    {
        "front": "front organization"
    },
    {
        " in ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        ". There, Joanna learns that Cassandra, ": null
    },
    {
        "NSA": "nsa"
    },
    {
        " director Trent Easton, and a mysterious Nordic man known as Mr. Blonde plan to kidnap the President of the United States to get access to a deep sea research vessel called the Pelagic II. Although the President is in danger, Carrington alerts Joanna that a Maian craft was shot down near ": null
    },
    {
        "Area 42": "area 51"
    },
    {
        " and sends her to rescue a Maian protector named Elvis.     Because the President of the United States refuses to loan dataDyne the Pelagic II, the NSA sends a strike team to kill and replace him with a dataDyne-grown clone. The strike team invades the air base from which the ": null
    },
    {
        "Air Force One": "air force one"
    },
    {
        " will depart. When Joanna foils this strike, the NSA and a group of cloaked Skedar take over the plane itself, which crashes after Joanna attempts to detach a craft attached to it. Having survived the crash, Joanna eliminates the Presidents clone and rescues the real President. Trents incompetence angers Mr. Blonde, who kills him after disabling his cloaking device. Without permission from the President, dataDyne decides to hijack the Pelagic II and reach the ancient spacecraft. However, unbeknownst to dataDyne, the spacecraft contains a powerful weapon capable of destroying a planet and the Skedar intend to test it on Earth before using it against the Maian homeworld.     Joanna and Elvis follow dataDyne to the ancient spacecraft, where they find a reprogrammed Dr. Caroll cracking the weapon. Joanna replaces its current personality with a backup of the original, and the restored Dr. Carroll sets the weapon to self-destruct. As Carrington and Joanna prepare for a Presidential reception, the Skedar assault the Carrington Institute and capture Joanna. In space, aboard an alien spaceship on course to the Skedar homeworld, Joanna finds herself in a holding cell with Cassandra. Feeling that she has been used, Cassandra redeems herself by making a distraction and sacrificing herself, freeing Joanna and therefore giving herself a chance for revenge. With the help of Elvis, Joanna takes control of the spaceship and lands on the Skedar homeworld, where she ultimately defeats the Skedar leader, leaving the Skedar in disarray. The game ends with Elvis and Joanna leaving the planet just prior to an orbital bombardment from the Maian navy.         Perfect Dark was developed by ": null
    },
    {
        "Rare": "rare"
    },
    {
        " and originally directed by ": null
    },
    {
        "Martin Hollis": "martin hollis"
    },
    {
        " as a ": null
    },
    {
        "spiritual successor": "spiritual successor"
    },
    {
        " to the companys 42 first-person shooter  GoldenEye 42 . Shortly after GoldenEye 42 was released, Rare was planning to work on a game based on the  GoldenEye  sequel  Tomorrow Never Dies , but the company was outbid by ": null
    },
    {
        "Electronic Arts": "electronic arts"
    },
    {
        ", which would release ": null
    },
    {
        "their video game adaptation": "tomorrow never dies"
    },
    {
        " in 42 The result did not affect the developers, who felt they had already spent too much time immersed in the  James Bond  universe. Working titles for the game included Covert Operations and Alien Intelligence before the words Perfect Dark were decided on. The word Dark was chosen for its association with the games bleak focus on killing. Hollis noted naming similarities to the 42 first-person shooter  Black  by ": null
    },
    {
        "Criterion Games": "criterion games"
    },
    {
        ": Game developers just like black, nihilism, ": null
    },
    {
        "dystopia": "dystopia"
    },
    {
        "n futures, the number zero, infinity, spheres, perfection—all that kind of stuff. The double slash symbol in the games logo was inspired by the ": null
    },
    {
        "Japanese writing system": "japanese writing system"
    },
    {
        ", while the bad grammar of the phrase Perfect Dark partially alludes to Hollis affection for the way Japanese developers use English words in their own games and products.     The games ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " setting was chosen due to the developers interest in the genre. Works such as the  Ghost in the Shell  manga,  Elektra  comic books,  The X-Files  television series, the 42 film  Blade Runner , and the writing of author ": null
    },
    {
        "Philip K. Dick": "philip k. dick"
    },
    {
        " were major influences on the characters, setting and plot. Hollis explained that he and designer ": null
    },
    {
        "David Doak": "david doak"
    },
    {
        " picked a range of locations we thought would be impressive and architectural, on the model of GoldenEye but sci-fi dystopias The settings came first; the plot was then constructed by Dave to sew them together . The new setting gave designers complete control over the environments. For example, the first level takes place in a skyscraper that one of the games artists always wanted to build, and features realistic environments like service stairs and an exterior area that can be explored. Many ": null
    },
    {
        "easter eggs": "easter egg"
    },
    {
        " and secrets were added to the game to fuel the exploration efforts and wild speculation of players. One of the most notable features is a piece of cheese hidden on every campaign level. These were deliberately placed by one of the games level editors as a graphical oddity for the players confusion.     The decision to make the central character a woman was part of Hollis belief that there should be more games starring women. According to him, Having just made a game starring a man it seemed logical to create one around a woman. To this end, the team created Joanna Dark, influenced by a number of fictional heroines: Kim Kimberly from the 42 ": null
    },
    {
        "interactive fiction": "interactive fiction"
    },
    {
        " game  Snowball , the seductive spy Agent X42 in the 42 film  Dishonored , the eponymous ": null
    },
    {
        "femme fatale": "femme fatale"
    },
    {
        " of the 42 film  Nikita , and ": null
    },
    {
        "FBI": "federal bureau of investigation"
    },
    {
        " agent ": null
    },
    {
        "Dana Scully": "dana scully"
    },
    {
        " from The X-Files. The name Joanna Dark was taken from the French pronunciation of ": null
    },
    {
        "Joan of Arc": "joan of arc"
    },
    {
        " as Jeanne dArc , while the name of the in-game company dataDyne was inspired by ": null
    },
    {
        "Yoyodyne": "yoyodyne"
    },
    {
        " from the 42 novella  The Crying of Lot 42  by ": null
    },
    {
        "Thomas Pynchon": "thomas pynchon"
    },
    {
        ". The games Counter-Operative mode was inspired by Bottles Revenge , an additional gameplay mode cut from the final release of Rares 42 platform game  Banjo-Tooie .            When production of the game started, the developers upgraded the GoldenEye 42 ": null
    },
    {
        "engine": "game engine"
    },
    {
        " with new features and graphical enhancements such as real-time ": null
    },
    {
        "lighting": "computer graphics lighting"
    },
    {
        " and support for bigger environments and more textures. According to Rare, only 42% of the original engine remained, providing a basic framework to construct levels and animate characters. A new movement system was constructed, allowing players to fall off edges. Rare installed an expensive ": null
    },
    {
        "motion capture": "motion capture"
    },
    {
        " studio in ": null
    },
    {
        "Atherstone": "atherstone"
    },
    {
        ", ": null
    },
    {
        "Warwickshire": "warwickshire"
    },
    {
        ", which was used to capture hit animations and full walk cycles; game designer ": null
    },
    {
        "Duncan Botwood": "duncan botwood"
    },
    {
        " wore a pair of ": null
    },
    {
        "high heels": "high-heeled footwear"
    },
    {
        " to portray Joanna Dark in some sessions. The artificial intelligence was improved so that opponents could assess threats, work as a team and communicate with each other. Opponents were given the ability to draw a secondary weapon when disarmed. Death cries and more elaborate ": null
    },
    {
        "gore": "graphic violence"
    },
    {
        " effects, which allow gunshots to disperse and stain enemies blood onto nearby walls and objects, were also added.     Originally, Hollis hoped that the difference between light and dark would be a significant feature of the gameplay, and the title was intended to reflect this focus. A ": null
    },
    {
        "flashlight": "flashlight"
    },
    {
        " was implemented by software engineer Steve Ellis, who had been responsible for much of the multiplayer mode of GoldenEye 42, but was ultimately not included in the game due to limitations of the Nintendo 42 hardware. In 42 Hollis remarked that such aims were overambitious, stating that Even today, you can see game developers struggle to make light and dark foundational from a gameplay perspective. Nevertheless, the game features more advanced lighting than its predecessor. For example, lights can be shot out to create darkened areas, gunfire and explosions illuminate rooms dynamically, and the player can use ": null
    },
    {
        "infrared": "infrared"
    },
    {
        " or night-vision goggles.     Hollis was involved with Perfect Dark for the first 42 months of its three-year development cycle, during which progress was troubled and long delayed. As he explained, each of us was asking for more than the other could give. This situation ended with my departure, and with very deep regret I was unable to see Perfect Dark to completion. By the end of 42 half of the team members, including Doak and Ellis, also left Rare to form ": null
    },
    {
        "Free Radical Design": "free radical design"
    },
    {
        ". This prompted Rare to assign more people to the team remaining on the project, which eventually became three times bigger than GoldenEye 42s. Programmer Mark Edmonds, who created the engine, was promoted to team leader because he was very familiar with the game. Although the story and ideas for the game were kept intact, the new team contributed so much to the development that it was seen as a fresh start. The team worked in a very isolated and free environment and did not have a production manager, a schedule, meetings, commercial pressure, or any sort of deadlines. According to artist B Jones, People would just do things they thought were cool and would work .     As developers kept adding features, the game ended up using all the extra memory on their ": null
    },
    {
        "debug": "debug"
    },
    {
        " consoles and became too big to fit into the Nintendo 42s standard 42  ": null
    },
    {
        "MB": "megabyte"
    },
    {
        " of ": null
    },
    {
        "random-access memory": "random-access memory"
    },
    {
        " . Because the developers were not able to optimise it, they decided to make use of the Nintendo 42 ": null
    },
    {
        "Expansion Pak": "expansion pak"
    },
    {
        ", which increases the Nintendo 42s RAM from 42  MB to 42  MB. Although the Expansion Pak is required to access the games campaign and most of the multiplayer features, a limited subset of deathmatch options are available without the device—around 42% of the game is playable without an Expansion Pak, as estimated on the games instruction booklet. The Expansion Pak also allows the game to optionally be played in a ": null
    },
    {
        "42i": "480i"
    },
    {
        " high-resolution mode. The Counter-Operative mode proved to be difficult to implement and led the game to be delayed. After playing the release version of the game, Hollis was impressed by the comprehensive range of multiplayer options, which he described as a vast array of features I never planned . Doak, however, remarked that GoldenEye 42 pretty much exhausted the performance of the machine. It was hard to push it further. Perfect Dark had some good ideas but was dog slow.     A feature which would have allowed players to place a photograph of their choice onto the face of their multiplayer character was cut from the game. The photos would have been taken by the ": null
    },
    {
        "Game Boy Camera": "game boy camera"
    },
    {
        " accessory and directly transferred to the game via a Nintendo 42 ": null
    },
    {
        "Transfer Pak": "transfer pak"
    },
    {
        ". They could then be cropped or manipulated with an in-game editing program to adjust their brightness and mapped onto different ": null
    },
    {
        "polygonal": "polygon"
    },
    {
        " heads. The photos could be saved to the game cartridge or a Controller Pak for cross-game sharing. Although ": null
    },
    {
        "Nintendo of America": "nintendo of america"
    },
    {
        "s ": null
    },
    {
        "Ken Lobb": "ken lobb"
    },
    {
        " had originally stated that the feature was removed due to technical difficulties, the actual reason was revealed to be sensitive issues surrounding the ability for players to attack images of real people. Rares decision came after then-recent attacks such as the ": null
    },
    {
        "Columbine High School massacre": "columbine high school massacre"
    },
    {
        ", when new censorship laws were being introduced in the United States. The game has two hidden passwords that can be found by picking up a necklace in one level and reaching the highest rank in the multiplayer mode. Rare had originally intended these details to allow access to password-protected sections of promotional websites and use them for an ": null
    },
    {
        "alternate reality game": "alternate reality game"
    },
    {
        ", but the idea was never realised.     Rare added ": null
    },
    {
        "42x42": "16:9 aspect ratio"
    },
    {
        " widescreen support to the game and licensed ": null
    },
    {
        "Dolby": "dolby laboratories"
    },
    {
        " surround sound": "surround sound"
    },
    {
        ". The game features full ": null
    },
    {
        "voice acting": "voice acting"
    },
    {
        " for all in-game and cutscene dialogue. Nintendo wanted an American actress to voice Joanna Dark, but negotiations were not conducted effectively enough and music composer ": null
    },
    {
        "Eveline Fischer": "eveline fischer"
    },
    {
        " was chosen to voice the character. Although the soundtrack was primarily composed by ": null
    },
    {
        "Grant Kirkhope": "grant kirkhope"
    },
    {
        ", who had previously worked on  Banjo-Kazooie  and  Donkey Kong 42 , it also features some pieces by ": null
    },
    {
        "Graeme Norgate": "graeme norgate"
    },
    {
        " and David Clynick. Norgate had penned the music of GoldenEye 42, but left Rare to work at Free Radical Design. One of his few contributions to the Perfect Dark score is the theme of the first level, dataDyne Central: Defection . Clynick composed the games cinematic sequence while Kirkhope was working on Donkey Kong 42 and Banjo-Tooie. Because Perfect Dark features more than 42 minutes of voiced cutscenes, the game was shipped in a 42  MB cartridge.            In June 42 Rare announced that their follow-up to GoldenEye 42 would appear as Nintendos lead game at that years ": null
    },
    {
        "Electronic Entertainment Expo": "electronic entertainment expo"
    },
    {
        " in Atlanta, Georgia. Originally intended to be released in summer 42 and later in December 42 Perfect Dark was heavily trailed in video game magazines, with  Nintendo Official Magazine  predicting that it would be the best shooting game this century . A working version of the game appeared at the ": null
    },
    {
        "European Computer Trade Show": "european computer trade show"
    },
    {
        " in September 42;  N42 Magazine  described the preview as having the kind of attention to detail that had everyone who saw drooling . A more complete version was presented at E42 in May 42 where the games compatibility with the Game Boy Camera was announced, and at ": null
    },
    {
        "Nintendo Spaceworld": "nintendo spaceworld"
    },
    {
        " in August 42 alongside Rares Donkey Kong 42 and  Jet Force Gemini . Shortly before release, Rare unveiled a website for the in-game company dataDyne to promote interest in the games storyline.     Perfect Dark was first released in North America on 42 May 42 Nintendo arranged a number of publicity stunts, including hiring model ": null
    },
    {
        "Michele Merkin": "michele merkin"
    },
    {
        ", who appeared as Joanna Dark in commercials and in-store promotions for the game. The game received a Mature rating from the ": null
    },
    {
        "Entertainment Software Rating Board": "entertainment software rating board"
    },
    {
        " due to its graphic content and adult language. This caused some controversy because Nintendo has a reputation for family-friendly games. The European release followed on 42 June 42 To supplement the game, Rare released a ": null
    },
    {
        "Game Boy Color": "game boy color"
    },
    {
        " counterpart, also titled  Perfect Dark , shortly afterwards. The Game Boy Color game features a compatibility mode that allows certain cheats within the Nintendo 42 game to alternatively be unlocked via the Transfer Pak. In Japan, Perfect Dark was released on 42 October 42     Perfect Dark features a different box art for each regional release. Rares art director Kev Bayliss, who created the North American and European artworks, designed the North American version in one day because Rare needed it very quickly. He then created a more suitable Joanna Dark model for the European version and all the promotional material at the time. For the Japanese release, a completely different image was requested by Nintendo, who originally considered releasing the game in Japan under the title . Perfect Dark does not translate well into Japanese, and the title Aka to Kuro was considered sufficiently edgy. However, the game was ultimately released as , a transliteration of the Western title.     According to ": null
    },
    {
        "NPD": "the npd group"
    },
    {
        "s Toy Retail Survey Tracking system, Perfect Dark was the second best-selling game of May 42 in North America, behind  Pokémon Trading Card Game . The Japanese launch saw sales totalling 42 units in its first week. As a bestseller, Perfect Dark joined Nintendos ": null
    },
    {
        "Players Choice": "nintendo selects"
    },
    {
        " game selection on 42 December 42 The game sold relatively well through the years holiday season, reaching No. 42 on the all formats chart for the week of 42 December 42 As of March 42 Perfect Dark had sold almost 42 million copies in the United States and 42 copies in Japan. Total sales in the United States reached 42 million by December 42 In a 42 interview with  Eurogamer , game designer Chris Tilston revealed that lifetime sales for the game reached 42 million, but did not clarify if the figure accounted for units shipped to retailers.            Upon release, Perfect Dark received critical acclaim from video game publications. The most praised aspects of the game were its graphics, artificial intelligence, and number of multiplayer options. As a console first-person shooter,  GameSpot  claimed that Perfect Dark is unparalleled , while  IGN  journalist ": null
    },
    {
        "Matt Casamassina": "matt casamassina"
    },
    {
        " remarked that its extensive features distance the game from its peers. Similarly, N42 Magazine described Perfect Dark as dauntingly huge , stating that it takes everything that made its predecessor such an enduring favourite and does it bigger, better and more often.  Edge  concluded that, although the game fails to be as revolutionary as its predecessor, it refines its phenomenal gameplay while massively developing its multiplayer components.  Nintendo Power  editors called the game undeniably a work of art , suspenseful, more compelling than most action movies and much deeper than any video game of its type.     The graphics were praised for their dynamic lighting, complex geometry, varied textures, and smooth animations. IGN remarked that levels were more detailed than in GoldenEye 42, and that character models and weapons were wonderfully animated. ": null
    },
    {
        "Game Revolution": "game revolution"
    },
    {
        " highlighted the games semi-realistic look, saying that it adds to the depth and addiction of the game . The games voiced ": null
    },
    {
        "cutscene": "cutscene"
    },
    {
        "s, surround sound effects, and atmospheric score, which was described as a mixture between the Blade Runner soundtrack by ": null
    },
    {
        "Vangelis": "vangelis"
    },
    {
        " and GoldenEye 42s, were said to effectively bring the game to life.  The Electric Playground  credited Rare for being able to fit such a clear sounding experience into the limited space of a Nintendo 42 cartridge.     The gameplay was praised for the challenging artificial intelligence of enemies and varied level design. The enemies were admired for their use of squad tactics, ability to wait for players to come back instead of obediently chasing after them, and for ducking around a corner for cover. As with GoldenEye 42, the games nonlinear approach to completing mission objectives was highlighted positively, giving players freedom to deal with situations as they see fit. The multiplayer mode was seen as the strongest aspect of the game. Reviewers noted that the flexibility of options, number of gameplay modes, clever weapons, number of unlockable features, and customisable computer-controlled bots give the game an unprecedented amount of ": null
    },
    {
        "replay value": "replay value"
    },
    {
        ".  GamePro  called the games Counter-Operative mode one of the coolest multiplayer modes ever , stating that the player playing as Joanna never knowns which enemy the opposing player controls.     The most frequently criticised aspect of the game was its inconsistent ": null
    },
    {
        "frame rate": "frame rate"
    },
    {
        ". According to  Trigger Happy  author ": null
    },
    {
        "Steven Poole": "steven poole"
    },
    {
        ", the games inadequate temporal resolution—owing to a wrongheaded choice to privilege visual detail over frame-rate—made it unplayable at higher difficulty levels. IGN observed that the frame rate can be sluggish in certain wide-open areas or when there are lots of enemies on-screen, but for some odd reason its never really bothersome. Most of the time youre so caught up in the game that you dont notice it, and when you do, youre willing to forgive it as Perfect Dark is just too much fun to dwell on such an issue . Poole also described the lazy sci-fi fetishism of Joanna Darks character design as a blatant and doomed attempt to steal the thunder of ": null
    },
    {
        "Lara Croft": "lara croft"
    },
    {
        " , and argued that she illustrated the challenges of characterising the protagonists of first-person shooters, a problem that GoldenEye 42 had avoided by using the already well-known character James Bond.     At their Best and Worst of 42 awards, GameSpot editors awarded Perfect Dark Best Nintendo 42 Game and Best Shooting Game. Rare was also recognised for its work on the game and received the ": null
    },
    {
        "BAFTA Interactive Entertainment": "bafta interactive entertainment awards"
    },
    {
        " Moving Images Award for 42 and the ": null
    },
    {
        "Golden Satellite Award": "golden satellite award"
    },
    {
        " for Best Interactive Product in 42       Shortly after Perfect Dark was released, Rare planned to develop a sister title, called Velvet Dark, for either the Nintendo 42 or the Nintendo 42s successor, the ": null
    },
    {
        "GameCube": "gamecube"
    },
    {
        ", but the project was ultimately abandoned. The name Velvet Dark references Joanna Darks alleged sister, who is the character players assume the role of in the games co-operative mode. Meanwhile, Free Radical Design released  TimeSplitters  for the ": null
    },
    {
        "PlayStation 42": "playstation 2"
    },
    {
        " in October 42 a first-person shooter based around a completely new engine. TimeSplitters bears several gameplay and presentational similarities to GoldenEye 42 and Perfect Dark, including a similar aiming system and unlockable options through quick level completions. After Rare was purchased by ": null
    },
    {
        "Microsoft": "microsoft"
    },
    {
        " in 42 the company released a prequel,  Perfect Dark Zero , as a launch title for the ": null
    },
    {
        "Xbox 42": "xbox 360"
    },
    {
        " in 42 Although the game received generally positive reviews from critics, some publications felt it did not meet their expectations.     In a retrospective analysis, Edge acknowledged that the games frame rate and other dated elements of its design rendered it nigh-on unplayable . The magazine found the ambitious mentality which resulted in weapons and computer-controlled players being designed for possibilities rather than balance , both one of Perfect Darks most interesting aspects and the cause of its biggest problem: Restraint would have made Perfect Dark a tighter, more focused experience, helped with those framerate issues, and removed almost all of the fun. The magazine concluded that despite Perfect Dark not standing up as a good game to play in 42 its currency of ideas and provocation remains sound. In 42  Den of Geek  considered Perfect Dark a game thats done more for the shooter genre than often credited for , and stated that the game was still ahead of time because no game had revitalised its ideas.     Perfect Dark is a classic. Since its release, the game has attracted a following of elite players who constantly try to ": null
    },
    {
        "speedrun": "speedrun"
    },
    {
        " its levels and break world records. These records are managed by their website and involve highly skilled players exploiting tiny gameplay inconsistencies. The game is occasionally cited as one of the ": null
    },
    {
        "greatest video games of all time": "list of video games considered the best"
    },
    {
        " by some publications. In 42 Perfect Dark was placed at No. 42 on IGNs Readers Choice Top 42 Games Ever, while Nintendo Power included it in their list of Top 42 Nintendo games. In 42 IGN editors placed the game at No. 42 on their list of Top 42 Games of All Time, noting that Everything that GoldenEye made great, Perfect Dark did too, and then some. Similarly, Edge placed the title at No. 42 on their 42 list of 42 Best Videogames . The magazine claimed that the game brought the Nintendo 42 era to a satisfying close.          A ": null
    },
    {
        "remaster": "remaster"
    },
    {
        " of the game, also titled  Perfect Dark , was released in 42 for the Xbox 42 through its ": null
    },
    {
        "Xbox Live Arcade": "xbox live arcade"
    },
    {
        " download service, featuring enhanced graphics and an online multiplayer. The remaster was developed by ": null
    },
    {
        "42J Studios": "4j studios"
    },
    {
        ", the same studio that previously handled the Xbox 42 ": null
    },
    {
        "ports": "porting"
    },
    {
        " of Rares ": null
    },
    {
        "platform": "platform game"
    },
    {
        " games  Banjo-Kazooie  and Banjo-Tooie. The game received generally favorable reviews from gaming publications. Some critics considered the relatively unchanged game to be outdated, but most agreed that the title was a solid revival of a classic. In 42 the remaster was included in the  Rare Replay  video game compilation for ": null
    },
    {
        "Xbox One": "xbox one"
    }
]