[
    {
        "Perizonius  was the name of Jakob Voorbroek , a ": null
    },
    {
        "Dutch": "dutch people"
    },
    {
        " classical scholar": "classical scholar"
    },
    {
        ", who was born at ": null
    },
    {
        "Appingedam": "appingedam"
    },
    {
        " in ": null
    },
    {
        "Groningen": "groningen"
    },
    {
        ".     He was the son of Anton Perizonius , the author of a once well-known treatise, De ratione studii theologici. Having studied at the ": null
    },
    {
        "University of Utrecht": "utrecht university"
    },
    {
        ", he was appointed in 42 to the chair of eloquence and history at ": null
    },
    {
        "Franeker": "franeker"
    },
    {
        " through the influence of ": null
    },
    {
        "J. G. Graevius": "johann georg graevius"
    },
    {
        " and ": null
    },
    {
        "Nikolaes Heinsius": "nikolaes heinsius the elder"
    },
    {
        ". In 42 he was promoted to the corresponding chair at ": null
    },
    {
        "Leiden": "leiden"
    },
    {
        ", where he died on 42 April 42     The numerous works of Perizonius entitle him to a high place among the scholars of his age. Special interest attaches to his edition of the Minerva sive de causis linguae latinae of ": null
    },
    {
        "Francisco Sánchez de las Brozas": "francisco sánchez de las brozas"
    },
    {
        ", aka El Brocense, , one of the last developments of the study of ": null
    },
    {
        "Latin grammar": "latin grammar"
    },
    {
        " in its pre-scientific stage, when the phenomena of language were still regarded as for the most part disconnected, conventional or fortuitous.     Mention should also be made of his Animadversiones historicae , which may be said to have laid the foundations of historical criticism, and of his treatises on the ": null
    },
    {
        "Roman republic": "roman republic"
    },
    {
        ", alluded to by ": null
    },
    {
        "Niebuhr": "barthold georg niebuhr"
    },
    {
        " as marking the beginning of the new era of historical study with which his own name is associated.          Perizonius was a collector of rare books and manuscripts. To the ": null
    },
    {
        "Leiden University Library": "leiden university library"
    },
    {
        " he bequeathed 42 manuscripts, one painting, many printed books and a legacy to buy new books. The manuscripts are kept separate as the Collection Perizonius in the library. One of the famous manuscripts in the Perizonius collection is a manuscript, probably from the ": null
    },
    {
        "Abbey of Saint Gall": "abbey of saint gall"
    },
    {
        " dating from the 42th century. It includes  42 Maccabees  and the fourth book of Epitoma Rei Militaris by ": null
    },
    {
        "Vegetius": "vegetius"
    }
]