[
    {
        "Peroz I  was the eighteenth king  of the ": null
    },
    {
        "Sasanian Empire": "sasanian empire"
    },
    {
        " from 42 to 42 He was the son of ": null
    },
    {
        "Yazdegerd II": "yazdegerd ii"
    },
    {
        "  and brother of ": null
    },
    {
        "Hormizd III": "hormizd iii"
    },
    {
        " . Peroz seized the throne from his older brother Hormizd III, whose reign lasted just two years. During his reign, he successfully quelled a rebellion in ": null
    },
    {
        "Caucasian Albania": "caucasian albania"
    },
    {
        " in the west, and put an end to the ": null
    },
    {
        "Kidarites": "kidarites"
    },
    {
        " in the east. He was, however, less successful in handling the ": null
    },
    {
        "Hephthalites": "hephthalites"
    },
    {
        ", who had taken the Kidarites place. This eventually resulted in a ": null
    },
    {
        "disastrous defeat": "hephthalite–sasanian war of 484"
    },
    {
        " near ": null
    },
    {
        "Balkh": "balkh"
    },
    {
        ", where Peroz was killed. The magnates—most notably ": null
    },
    {
        "Sukhra": "sukhra"
    },
    {
        " and ": null
    },
    {
        "Shapur Mihran": "shapur mihran"
    },
    {
        "—elected Perozs brother, ": null
    },
    {
        "Balash": "balash"
    },
    {
        ", as the new shah.       Peroz is a ": null
    },
    {
        "Middle Persian": "middle persian"
    },
    {
        " name, meaning victorious . The name had already been in use by members of the Sasanian family a few centuries before, namely by the ": null
    },
    {
        "Kushano-Sasanian": "kushano-sasanian"
    },
    {
        " ruler ": null
    },
    {
        "Peroz I Kushanshah": "peroz i kushanshah"
    },
    {
        ".            When Perozs father Yazdegerd II died in 42 the elder brother and heir Hormizd ascended the throne at ": null
    },
    {
        "Ray": "rey, iran"
    },
    {
        ". Peroz, with the support of the powerful ": null
    },
    {
        "Mihranid": "house of mihran"
    },
    {
        " magnate ": null
    },
    {
        "Raham Mihran": "raham mihran"
    },
    {
        ", fled to the northeastern part of the empire and began raising an army in order to claim the throne for himself. The empire thus fell into a dynastic struggle and became divided; the mother of the two brothers, ": null
    },
    {
        "Denag": "denag"
    },
    {
        " temporarily ruled as regent of the empire from its capital, ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        ". According to eastern sources, Peroz was more worthy for the throne than Hormizd, who is called unfair. Only the anonymous source known as the Codex Sprenger 42 describes Hormizd as the braver and better , whilst describing Peroz as more learned in religion .     Peroz later went to the domains of the ": null
    },
    {
        "Hephthalite": "hephthalite empire"
    },
    {
        " monarch ": null
    },
    {
        "Khushnavaz": "khushnavaz"
    },
    {
        ", who agreed to him support with soldiers in his struggle for the throne. In 42 Peroz, with Hephthalite and Mihranid assistance, led an army against Hormizd and defeated him. According to some sources, Hormizd was pardoned and spared by his brother. However, this is most likely a legend, which is disproved by other sources, that states Peroz had Hormizd and three members of his family killed. He then ceded ": null
    },
    {
        "Taliqan": "taliqan"
    },
    {
        " to Khushnavaz.              The ": null
    },
    {
        "civil war": "civil war"
    },
    {
        " in Iran had affected the nation so much as to cost a province. ": null
    },
    {
        "Vache II": "vache ii"
    },
    {
        ", the king of ": null
    },
    {
        "Caucasian Albania": "caucasian albania"
    },
    {
        ", rebelled against Sasanian rule and declared himself independent while the brothers were busy fighting amongst each other. So once Peroz I ascended the throne in the year 42 he led an army into Albania and completely subjugated the nation. He then allowed the ": null
    },
    {
        "Armenians": "armenians"
    },
    {
        " of ": null
    },
    {
        "Persian Armenia": "persian armenia"
    },
    {
        " to practice their religion, ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        ", freely. He also made an agreement with the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " that they would together defend the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        " from incursions. Furthermore, Peroz ordered his foster brother ": null
    },
    {
        "Izad Gushnasp": "izad gushnasp"
    },
    {
        " to take the Armenians who had been held captive during the reign of his father to ": null
    },
    {
        "Herat": "herat"
    },
    {
        ".       Historians of the period record the occurrence of a seven-year famine which devastated the crops and ruined the country. Sources say that the wells became dry and that there was not a ": null
    },
    {
        "trickle": "trickle"
    },
    {
        " of water either in the ": null
    },
    {
        "Tigris": "tigris"
    },
    {
        " or the ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        ". Eventually the crops failed and thousands perished.     Historians record that Peroz I showed an extreme rigidness of character in the face of such an adversity and great wisdom in dealing with the catastrophe. As a result of his wisdom and benevolence, Persia gradually recovered from the famine.            The ": null
    },
    {
        "Kidarites": "kidarites"
    },
    {
        ", who had established themselves in parts of ": null
    },
    {
        "Transoxiana": "transoxiana"
    },
    {
        " during the reign of the Sasanian king ": null
    },
    {
        "Shapur II": "shapur ii"
    },
    {
        ", and had a long history of conflicts with the Sasanians, stopped paying tributes to them in the early 42s, thus starting a new war between these two states. During the start of the war, however, Peroz did not have enough manpower to fight them, and therefore asked for financial aid by the Byzantine Empire, who declined his request. Peroz then offered peace to the leader of the Kidarites, Kunkhas, and offered him his sister in marriage. However, Peroz tried to trick Kunkhas, and sent a woman of low status instead.     After some time Kunkhas found about Perozs false promise, and then in turn tried to trick him, by requesting him to send military experts to strengthen his army. However, when a group of 42 military experts arrived to the court of Kunkhas at Balaam , they were either killed or disfigured and sent back to Iran, with the information that Kunkhas did this due to Perozs false promise.     What happened after remains obscure, but Peroz obtained help from the Hephthalites to vanquish the Kidarites. The ": null
    },
    {
        "Alchon Huns": "alchon huns"
    },
    {
        " ruler ": null
    },
    {
        "Mehama": "mehama"
    },
    {
        " , who had been elevated to the position of Governor by Peroz circa 42 CE, allied with Peroz I in his victory over the ": null
    },
    {
        "Kidarites": "kidarites"
    },
    {
        " in 42 CE.   By 42 Peroz, with Hephthalite aid, managed to capture Balaam and put an end to Kidarite rule in Transoxiana once and for all. Although the Kidarites still controlled some places in the area of ": null
    },
    {
        "Gandhara": "gandhara"
    },
    {
        ", they would never bother the Sasanians again.       However, after some time, the ": null
    },
    {
        "Hephthalites": "hephthalites"
    },
    {
        " betrayed Peroz and seized Balkh from him, starting the first war between the Sasanians and the Hephthalites. During this war, Peroz suffered a heavy defeat in the third battle between the two forces in 42 and was captured by Hephthalites. He was released after paying ransom; the Byzantines aided him in by lending him some money.      Before Persia had completely recovered from the famine, a new war broke out with the Hephthalites of the north. Provoked by an insult heaped upon him by ": null
    },
    {
        "Khushnavaz": "khushnavaz"
    },
    {
        ", Peroz, along with his vassal ": null
    },
    {
        "Vakhtang I": "vakhtang i of iberia"
    },
    {
        ", ": null
    },
    {
        "Toumanoff, Cyril": "cyril toumanoff"
    },
    {
        " . Studies in Christian Caucasian History, pp. 42–42 ": null
    },
    {
        "Georgetown University Press": "georgetown university press"
    },
    {
        ". Thomson, Robert W. , Rewriting Caucasian History, pp. 42–42 ": null
    },
    {
        "Oxford University Press": "oxford university press"
    },
    {
        ",   М. Лордкипанидзе, Д. Мусхелишвили ,  АН ГССР, Ин-т ист., археол. и этнографии – Тб. : Мецниереба: Тип. АН ГССР. led an invasion of the Hephthalite country forcing them to retreat. But when Peroz pursued the Hephthalites to the hills, he suffered a crushing defeat. The king was captured and forced to surrender his daughter, and the chief priest  of the empire to Khushnavaz as ": null
    },
    {
        "hostage": "hostage"
    },
    {
        "s, until the ransom was paid.       In 42 Iberia broke into revolt and declared its independence. Peroz sent the Sasanian Governor of Armenia to Iberia to quell the rebellion. But no sooner had he left the province, that ": null
    },
    {
        "Armenia": "armenia"
    },
    {
        " rose in rebellion and chose an Armenian Christian called Bargatide as its Emperor.     The Persian Governor, ": null
    },
    {
        "Adhur Gushnasp": "adhur gushnasp"
    },
    {
        " after restoring Persian rule in ": null
    },
    {
        "Iberia": "caucasian iberia"
    },
    {
        " rushed to Armenia to quell the rebellion but was squarely defeated. Peroz responded by sending two large armies to the region, one under Adar-Narseh into Armenia and the other against Iberia.     ": null
    },
    {
        "Sahag": "sahag"
    },
    {
        ", the Armenian king, was killed and ": null
    },
    {
        "Shapur Mihran": "shapur mihran"
    },
    {
        " was wreaking havoc in Armenia, but just when success was within grasp, Peroz blundered by recalling Shapur Mihran and entrusting the command to one ": null
    },
    {
        "Zarmihr Hazarwuxt": "zarmihr hazarwuxt"
    },
    {
        ". Zarmihr Hazarwuxt too did not remain long in Armenia and was recalled in a few months. This policy of rotating military commanders frequently ensured that Armenia was lost to the Persians for the time being.            Towards the end of his reign, Peroz gathered an army of 4242 men; after placing his brother ": null
    },
    {
        "Balash": "balash"
    },
    {
        " at the head of the government in ": null
    },
    {
        "Ctesiphon": "ctesiphon"
    },
    {
        ", he invaded the Hephthalites in order to avenge the insult heaped upon him during the first campaign. He set up his position at ": null
    },
    {
        "Balkh": "balkh"
    },
    {
        " and rejected the terms of peace offered by Khushnavaz. However, when a showdown with the Persians seemed imminent, Khushnavaz sent a small body of troops in advance in order to trick Peroz into an ambuscade at the ": null
    },
    {
        "Battle of Herat": "battle of herat"
    },
    {
        " of 42 The plan was successful, and the Persians were defeated with great slaughter, Peroz being one of the victims. Khushnavaz, however, treated the body of his erstwhile friend with dignity and dispatched it to Persia to be buried with full honors.     Soon afterwards, the Hephthalites invaded and plundered Persia. The empire, however, was saved when a Sasanian noble from the ": null
    },
    {
        "Karen family": "house of karen"
    },
    {
        ", ": null
    },
    {
        "Sukhra": "sukhra"
    },
    {
        ", defeated the Hepthalites and elected ": null
    },
    {
        "Balash": "balash"
    },
    {
        " , one of Peroz Is brothers, to the throne.       Peroz is included in a legendary romantic story narrated by 42th-century Iranian historian ": null
    },
    {
        "Ibn Isfandiyar": "ibn isfandiyar"
    },
    {
        ". The story begins with Peroz dreaming about a beautiful woman who he falls in love with. Peroz then sends one of his relatives and a close friend, a certain Mihrfiruz from the ": null
    },
    {
        "Mihran": "house of mihran"
    },
    {
        " family to find her. He manages to find the woman, who in the end is turned out to be the sister of Izad Gushnasp himself . After having found her, Peroz marries her and at her request, lay foundation to the city of ": null
    },
    {
        "Amol": "amol"
    },
    {
        " in ": null
    },
    {
        "Tabaristan": "tabaristan"
    },
    {
        ".       ": null
    }
]