[
    {
        "        At the most basic level, Personal Communications Service  describes a set of communications capabilities which allows some combination of terminal mobility, ": null
    },
    {
        "personal mobility": "Personal Mobility"
    },
    {
        ", and service profile management. More specifically, PCS refers to any of several types of wireless voice or wireless data communications systems, typically incorporating digital technology, providing services similar to advanced ": null
    },
    {
        "cellular": "Cellular Network"
    },
    {
        " mobile or ": null
    },
    {
        "paging": "Pager"
    },
    {
        " services. In addition, PCS can also be used to provide other wireless communications services, including services which allow people to place and receive communications while away from their home or office, as well as wireless communications to homes, office buildings and other ": null
    },
    {
        "fixed": "Fixed Wireless"
    },
    {
        " locations. Described in more commercial terms, PCS is a generation of wireless-phone technology that combines a range of features and services surpassing those available in analog- and digital-cellular phone systems, providing a user with an all-in-one wireless phone, paging, messaging, and data service.     The ": null
    },
    {
        "International Telecommunication Union": "International Telecommunication Union"
    },
    {
        " describes Personal Communications Services as a component of the ": null
    },
    {
        "IMT-2000": "Imt-2000"
    },
    {
        " standard. PCS and the IMT-2000 standard of which PCS is a part do not specify a particular ": null
    },
    {
        "air interface": "Air Interface"
    },
    {
        " and ": null
    },
    {
        "channel access method": "Channel Access Method"
    },
    {
        ". Wireless service providers may deploy equipment using any of several air interface and channel access methods, as long as the network meets the service description characteristics described in the standard.     In ": null
    },
    {
        "Canada": "Canada"
    },
    {
        ", ": null
    },
    {
        "Mexico": "Mexico"
    },
    {
        " and the ": null
    },
    {
        "United States": "United States"
    },
    {
        ", PCS are provided in the 1900 MHz band . This frequency band was designated by the United States ": null
    },
    {
        "FCC": "Federal Communications Commission"
    },
    {
        " and ": null
    },
    {
        "Industry Canada": "Industry Canada"
    },
    {
        " to be used for new wireless services to alleviate capacity caps inherent in the original ": null
    },
    {
        "AMPS": "Advanced Mobile Phone System"
    },
    {
        " and ": null
    },
    {
        "D-AMPS": "Digital Amps"
    },
    {
        " cellular networks in the 850 MHz band . These frequency bands are particular to North America and other frequency bands may be designated in other regions.       In the United States, ": null
    },
    {
        "Sprint PCS": "Sprint Corporation"
    },
    {
        " was the first company to build and operate a PCS network, launching service in November 1995 under the Sprint Spectrum brand in the ": null
    },
    {
        "Baltimore-Washington metropolitan area": "Baltimore-Washington Metropolitan Area"
    },
    {
        ". Sprint originally built out the network using ": null
    },
    {
        "GSM": "Gsm"
    },
    {
        " radio interface equipment. Sprint PCS later selected ": null
    },
    {
        "CDMA": "Cdma2000"
    },
    {
        " as the radio interface for its nationwide network and built out a parallel CDMA network in the Baltimore-Washington area, launching service in 1997. Sprint operated the two networks in parallel until finishing a migration of its area customers to the CDMA network. After completing the customer migration, Sprint PCS sold the GSM radio interface network equipment to Omnipoint Communications in January 2000. Omnipoint was later purchased by VoiceStream Wireless which subsequently became ": null
    },
    {
        "T-Mobile USA": "T-Mobile Usa"
    }
]