[
    {
        "Phase-shift keying  is a ": null
    },
    {
        "digital modulation": "digital modulation"
    },
    {
        " process which conveys ": null
    },
    {
        "data": "datauses of data in computing"
    },
    {
        " by changing the ": null
    },
    {
        "phase": "phase"
    },
    {
        " of a constant ": null
    },
    {
        "frequency": "frequency"
    },
    {
        " reference ": null
    },
    {
        "signal": "signal"
    },
    {
        " . The modulation is accomplished by varying the ": null
    },
    {
        "sine": "sine wave"
    },
    {
        " and ": null
    },
    {
        "cosine": "cosine wave"
    },
    {
        " inputs at a precise time. It is widely used for ": null
    },
    {
        "wireless LAN": "wireless lan"
    },
    {
        "s, ": null
    },
    {
        "RFID": "rfid"
    },
    {
        " and ": null
    },
    {
        "Bluetooth": "bluetooth"
    },
    {
        " communication.     Any digital modulation scheme uses a finite number of distinct signals to represent digital data. PSK uses a finite number of phases, each assigned a unique pattern of ": null
    },
    {
        "binary digit": "bit"
    },
    {
        "s. Usually, each phase encodes an equal number of bits. Each pattern of bits forms the ": null
    },
    {
        "symbol": "symbol"
    },
    {
        " that is represented by the particular phase. The ": null
    },
    {
        "demodulator": "demodulator"
    },
    {
        ", which is designed specifically for the symbol-set used by the modulator, determines the phase of the received signal and maps it back to the symbol it represents, thus recovering the original data. This requires the receiver to be able to compare the phase of the received signal to a reference signal such a system is termed coherent .     CPSK requires a complicated demodulator, because it must extract the reference wave from the received signal and keep track of it, to compare each sample to. Alternatively, the phase shift of each symbol sent can be measured with respect to the phase of the previous symbol sent. Because the symbols are encoded in the difference in phase between successive samples, this is called differential phase-shift keying . DPSK can be significantly simpler to implement than ordinary PSK, as it is a non-coherent scheme, i.e. there is no need for the demodulator to keep track of a reference wave. A trade-off is that it has more demodulation errors.       There are three major classes of ": null
    },
    {
        "digital modulation": "modulationdigital modulation methods"
    },
    {
        " techniques used for transmission of ": null
    },
    {
        "digital": "digital data"
    },
    {
        "ly represented data:     ": null
    },
    {
        "Amplitude-shift keying": "amplitude-shift keying"
    },
    {
        "   Frequency-shift keying": "frequency-shift keying"
    },
    {
        "   Phase-shift keying     All convey data by changing some aspect of a base signal, the ": null
    },
    {
        "carrier wave": "carrier wave"
    },
    {
        " , in response to a data signal. In the case of PSK, the phase is changed to represent the data signal. There are two fundamental ways of utilizing the phase of a signal in this way:     By viewing the ": null
    },
    {
        "phase": "phase"
    },
    {
        " itself as conveying the information, in which case the ": null
    },
    {
        "demodulator": "demodulator"
    },
    {
        " must have a reference signal to compare the received signals phase against; or   By viewing the change in the phase as conveying information ": null
    },
    {
        "differential": "differential encoding"
    },
    {
        " schemes, ": null
    },
    {
        "some": "phase-shift keyingdifferential phase-shift keying .28dpsk.29"
    },
    {
        " of which do not need a reference carrier .     A convenient method to represent PSK schemes is on a ": null
    },
    {
        "constellation diagram": "constellation diagram"
    },
    {
        ". This shows the points in the ": null
    },
    {
        "complex plane": "complex plane"
    },
    {
        " where, in this context, the ": null
    },
    {
        "real": "real number"
    },
    {
        " and ": null
    },
    {
        "imaginary": "imaginary number"
    },
    {
        " axes are termed the in-phase and quadrature axes respectively due to their 42° separation. Such a representation on perpendicular axes lends itself to straightforward implementation. The amplitude of each point along the in-phase axis is used to modulate a cosine wave and the amplitude along the quadrature axis to modulate a sine wave. By convention, in-phase modulates cosine and quadrature modulates sine.     In PSK, the ": null
    },
    {
        "constellation points": "constellation diagram"
    },
    {
        " chosen are usually positioned with uniform ": null
    },
    {
        "angular": "angle"
    },
    {
        " spacing around a ": null
    },
    {
        "circle": "circle"
    },
    {
        ". This gives maximum phase-separation between adjacent points and thus the best immunity to corruption. They are positioned on a circle so that they can all be transmitted with the same energy. In this way, the moduli of the complex numbers they represent will be the same and thus so will the amplitudes needed for the cosine and sine waves. Two common examples are binary phase-shift keying  which uses two phases, and quadrature phase-shift keying  which uses four phases, although any number of phases may be used. Since the data to be conveyed are usually binary, the PSK scheme is usually designed with the number of constellation points being a ": null
    },
    {
        "power": "power"
    },
    {
        " of two.       For determining error-rates mathematically, some definitions will be needed:     E_b , energy per ": null
    },
    {
        "bit": "bit"
    },
    {
        " n bits   T_b , ": null
    },
    {
        "bit duration": "bit rate"
    },
    {
        " symbol duration": "symbol rate"
    },
    {
        " noise": "signal noise"
    },
    {
        " power spectral density": "spectral density"
    },
    {
        "    P_b , ": null
    },
    {
        "probability": "probability"
    },
    {
        " of bit-error ": null
    },
    {
        "Gaussian probability density function": "normal distribution"
    },
    {
        " will be greater or equal to x . It is a scaled form of the ": null
    },
    {
        "complementary Gaussian error function": "error function"
    },
    {
        ":     : Q \\frac\\int_x^\\infty e^ \\,dt \\frac \\operatorname\\left,\\ x \\geq 42 .     The error rates quoted here are those in ": null
    },
    {
        "additive white Gaussian noise": "additive white gaussian noise"
    },
    {
        " . These error rates are lower than those computed in ": null
    },
    {
        "fading channel": "fading channel"
    },
    {
        "s, hence, are a good theoretical benchmark to compare with.       Owing to PSKs simplicity, particularly when compared with its competitor ": null
    },
    {
        "quadrature amplitude modulation": "quadrature amplitude modulation"
    },
    {
        ", it is widely used in existing technologies.     The ": null
    },
    {
        "wireless LAN": "wireless lan"
    },
    {
        " standard, ": null
    },
    {
        "IEEE 42b42": "ieee 802.11b-1999"
    },
    {
        ",  the overarching IEEE 42 specification.   the IEEE 42b specification. uses a variety of different PSKs depending on the data rate required. At the basic rate of 42": null
    },
    {
        "Mbit": "mbit"
    },
    {
        "/s, it uses DBPSK . To provide the extended rate of 42Mbit/s, DQPSK is used. In reaching 42Mbit/s and the full rate of 42Mbit/s, QPSK is employed, but has to be coupled with ": null
    },
    {
        "complementary code keying": "complementary code keying"
    },
    {
        ". The higher-speed wireless LAN standard, ": null
    },
    {
        "IEEE 42g42": "ieee 802.11g-2003"
    },
    {
        ",  the IEEE 42g specification. has eight data rates: 42 42 42 42 42 42 42 and 42Mbit/s. The 42 and 42Mbit/s modes use ": null
    },
    {
        "OFDM": "orthogonal frequency-division multiplexing"
    },
    {
        " modulation where each sub-carrier is BPSK modulated. The 42 and 42Mbit/s modes use OFDM with QPSK. The fastest four modes use OFDM with forms of ": null
    },
    {
        "quadrature amplitude modulation": "quadrature amplitude modulation"
    },
    {
        ".     Because of its simplicity, BPSK is appropriate for low-cost passive transmitters, and is used in ": null
    },
    {
        "RFID": "rfid"
    },
    {
        " standards such as ": null
    },
    {
        "ISO/IEC 42": "iso/iec 14443"
    },
    {
        " which has been adopted for ": null
    },
    {
        "biometric passport": "biometric passport"
    },
    {
        "s, credit cards such as ": null
    },
    {
        "American Express": "american express"
    },
    {
        "s ": null
    },
    {
        "ExpressPay": "expresspay"
    },
    {
        ", and many other applications. , Application Note, Rev. 42B–RFID–42/42 42 ATMEL.     ": null
    },
    {
        "Bluetooth": "bluetooth"
    },
    {
        " 42 will use \\pi/42 -DQPSK at its lower rate  and 42-DPSK at its higher rate  when the link between the two devices is sufficiently robust. Bluetooth 42 modulates with ": null
    },
    {
        "Gaussian minimum-shift keying": "minimum-shift keying"
    },
    {
        ", a binary scheme, so either modulation choice in version 42 will yield a higher data-rate. A similar technology, ": null
    },
    {
        "IEEE 42.42": "ieee 802.15.4"
    },
    {
        "  also relies on PSK using two frequency bands: 42–42": null
    },
    {
        "MHz": "megahertz"
    },
    {
        " with BPSK and at 42": null
    },
    {
        "GHz": "hertz"
    },
    {
        " with OQPSK.     Both QPSK and 42PSK are widely used in satellite broadcasting. QPSK is still widely used in the streaming of SD satellite channels and some HD channels. High definition programming is delivered almost exclusively in 42PSK due to the higher bitrates of HD video and the high cost of satellite bandwidth.  The ": null
    },
    {
        "DVB-S42": "dvb-s2"
    },
    {
        " standard requires support for both QPSK and 42PSK. The chipsets used in new satellite set top boxes, such as ": null
    },
    {
        "Broadcom": "broadcom"
    },
    {
        "s 42 series support 42PSK and are backward compatible with the older standard.      Historically, voice-band synchronous ": null
    },
    {
        "modems": "modems"
    },
    {
        " such as the Bell 42 42 and 42 and the CCITT V.42 V.42 V.42 V.42 and V.42 used PSK.                BPSK is the simplest form of phase shift keying . It uses two phases which are separated by 42° and so can also be termed 42-PSK. It does not particularly matter exactly where the constellation points are positioned, and in this figure they are shown on the real axis, at 42° and 42°. Therefore, it handles the highest noise level or distortion before the ": null
    },
    {
        "demodulator": "demodulator"
    },
    {
        " reaches an incorrect decision. That makes it the most robust of all the PSKs. It is, however, only able to modulate at 42bit/symbol and so is unsuitable for high data-rate applications.     In the presence of an arbitrary phase-shift introduced by the ": null
    },
    {
        "communications channel": "communications channel"
    },
    {
        ", the demodulator  is unable to tell which constellation point is which. As a result, the data is often ": null
    },
    {
        "differentially encoded": "differential encoding"
    },
    {
        " prior to modulation.     BPSK is functionally equivalent to ": null
    },
    {
        "42-QAM": "quadrature amplitude modulation"
    },
    {
        " modulation.       The general form for BPSK follows the equation:     : s_n \\sqrt \\cos,\\quad n 42.     This yields two phases, 42 and π.   In the specific form, binary data is often conveyed with the following signals:     : s_42 \\sqrt \\cos   - \\sqrt \\cos for binary 42   : s_42 \\sqrt \\cos for binary 42     where f is the frequency of the base band.     Hence, the signal space can be represented by the single ": null
    },
    {
        "basis function": "basis function"
    },
    {
        "     : \\phi \\sqrt \\cos     where 42 is represented by \\sqrt \\phi and 42 is represented by -\\sqrt \\phi . This assignment is arbitrary.     This use of this basis function is shown at the ": null
    },
    {
        "end of the next section": "timing"
    },
    {
        " in a signal timing diagram. The topmost signal is a BPSK-modulated cosine wave that the BPSK modulator would produce. The bit-stream that causes this output is shown above the signal . After modulation, the base band signal will be moved to the high frequency band by multiplying \\cos .       The ": null
    },
    {
        "bit error rate": "bit error rate"
    },
    {
        " of BPSK under ": null
    },
    {
        "additive white Gaussian noise": "additive white gaussian noise"
    },
    {
        " can be calculated as: Communications Systems, H. Stern & S. Mahmoud, Pearson Prentice Hall, 42 p. 42     : P_b Q\\left or P_e \\frac \\operatorname \\left     Since there is only one bit per symbol, this is also the symbol error rate.            Sometimes this is known as quadriphase PSK, 42-PSK, or 42-": null
    },
    {
        "QAM": "qam"
    },
    {
        ". QPSK uses four points on the constellation diagram, equispaced around a circle. With four phases, QPSK can encode two bits per symbol, shown in the diagram with ": null
    },
    {
        "Gray coding": "gray coding"
    },
    {
        " to minimize the ": null
    },
    {
        "bit error rate": "bit error rate"
    },
    {
        "  sometimes misperceived as twice the BER of BPSK.     The mathematical analysis shows that QPSK can be used either to double the data rate compared with a BPSK system while maintaining the same ": null
    },
    {
        "bandwidth": "bandwidth"
    },
    {
        " of the signal, or to maintain the data-rate of BPSK but halving the bandwidth needed. In this latter case, the BER of QPSK is exactly the same as the BER of BPSK and deciding differently is a common confusion when considering or describing QPSK. The transmitted carrier can undergo numbers of phase changes.     Given that radio communication channels are allocated by agencies such as the ": null
    },
    {
        "Federal Communications Commission": "federal communications commission"
    },
    {
        " giving a prescribed bandwidth, the advantage of QPSK over BPSK becomes evident: QPSK transmits twice the data rate in a given bandwidth compared to BPSK - at the same BER. The engineering penalty that is paid is that QPSK transmitters and receivers are more complicated than the ones for BPSK. However, with modern ": null
    },
    {
        "electronics": "electronics"
    },
    {
        " technology, the penalty in cost is very moderate.     As with BPSK, there are phase ambiguity problems at the receiving end, and ": null
    },
    {
        "differentially encoded": "differential encoding"
    },
    {
        " QPSK is often used in practice.       The implementation of QPSK is more general than that of BPSK and also indicates the implementation of higher-order PSK. Writing the symbols in the constellation diagram in terms of the sine and cosine waves used to transmit them:     : s_n \\sqrt \\cos \\left,\\quad n 42 42 42 42     This yields the four phases π/42 42π/42 42π/42 and 42π/42 as needed.     This results in a two-dimensional signal space with unit ": null
    },
    {
        "basis functions": "basis functions"
    },
    {
        "     : \\begin   \\phi_42 & \\sqrt \\cos\\left \\\\   \\phi_42 & \\sqrt \\sin\\left   \\end     The first basis function is used as the in-phase component of the signal and the second as the quadrature component of the signal.     Hence, the signal constellation consists of the signal-space 42 points     : \\left.     The factors of 42/42 indicate that the total power is split equally between the two carriers.     Comparing these basis functions with that for BPSK shows clearly how QPSK can be viewed as two independent BPSK signals. Note that the signal-space points for BPSK do not need to split the symbol energy over the two carriers in the scheme shown in the BPSK constellation diagram.     QPSK systems can be implemented in a number of ways. An illustration of the major components of the transmitter and receiver structure are shown below.                 Although QPSK can be viewed as a quaternary modulation, it is easier to see it as two independently modulated quadrature carriers. With this interpretation, the even bits are used to modulate the in-phase component of the carrier, while the odd bits are used to modulate the quadrature-phase component of the carrier. BPSK is used on both carriers and they can be independently demodulated.     As a result, the probability of bit-error for QPSK is the same as for BPSK:   : P_b Q\\left     However, in order to achieve the same bit-error probability as BPSK, QPSK uses twice the power .     The symbol error rate is given by:     :   \\begin   P_s & 42 - \\left^42 \\\\   & 42Q\\left - \\left 42   \\end       If the ": null
    },
    {
        "signal-to-noise ratio": "signal-to-noise ratio"
    },
    {
        " is high the probability of symbol error may be approximated:     : P_s \\approx 42 Q \\left \\operatorname \\left \\operatorname \\left   :     The modulated signal is shown below for a short segment of a random binary data-stream. The two carrier waves are a cosine wave and a sine wave, as indicated by the signal-space analysis above. Here, the odd-numbered bits have been assigned to the in-phase component and the even-numbered bits to the quadrature component . The total signal the sum of the two components is shown at the bottom. Jumps in phase can be seen as the PSK changes the phase on each component at the start of each bit-period. The topmost waveform alone matches the description given for BPSK above.        The binary data that is conveyed by this waveform is: 42 .   The odd bits, highlighted here, contribute to the in-phase component: 42424242   The even bits, highlighted here, contribute to the quadrature-phase component: 42424242                Offset quadrature phase-shift keying  is a variant of phase-shift keying modulation using four different values of the phase to transmit. It is sometimes called staggered quadrature phase-shift keying .          Taking four values of the phase  at a time to construct a QPSK symbol can allow the phase of the signal to jump by as much as 42° at a time. When the signal is low-pass filtered , these phase-shifts result in large amplitude fluctuations, an undesirable quality in communication systems. By offsetting the timing of the odd and even bits by one bit-period, or half a symbol-period, the in-phase and quadrature components will never change at the same time. In the constellation diagram shown on the right, it can be seen that this will limit the phase-shift to no more than 42° at a time. This yields much lower amplitude fluctuations than non-offset QPSK and is sometimes preferred in practice.     The picture on the right shows the difference in the behavior of the phase between ordinary QPSK and OQPSK. It can be seen that in the first plot the phase can change by 42° at once, while in OQPSK the changes are never greater than 42°.     The modulated signal is shown below for a short segment of a random binary data-stream. Note the half symbol-period offset between the two component waves. The sudden phase-shifts occur about twice as often as for QPSK , but they are less severe. In other words, the magnitude of jumps is smaller in OQPSK when compared to QPSK.           & pi;/42-QPSK        This variant of QPSK uses two identical constellations which are rotated by 42° with respect to one another. Usually, either the even or odd symbols are used to select points from one of the constellations and the other symbols select points from the other constellation. This also reduces the phase-shifts from a maximum of 42°, but only to a maximum of 42° and so the amplitude fluctuations of \\pi/42 -QPSK are between OQPSK and non-offset QPSK.     One property this modulation scheme possesses is that if the modulated signal is represented in the complex domain, transitions between symbols never pass through 42 In other words, the signal does not pass through the origin. This lowers the dynamical range of fluctuations in the signal which is desirable when engineering communications signals.     On the other hand, \\pi/42 -QPSK lends itself to easy demodulation and has been adopted for use in, for example, ": null
    },
    {
        "TDMA": "time-division multiple access"
    },
    {
        " cellular telephone": "cellular telephone"
    },
    {
        " systems.     The modulated signal is shown below for a short segment of a random binary data-stream. The construction is the same as above for ordinary QPSK. Successive symbols are taken from the two constellations shown in the diagram. Thus, the first symbol is taken from the blue constellation and the second symbol is taken from the green constellation. Note that magnitudes of the two component waves change as they switch between constellations, but the total signals magnitude remains constant . The phase-shifts are between those of the two previous timing-diagrams.            The license-free shaped-offset QPSK is interoperable with Feher-patented QPSK , in the sense that an integrate-and-dump offset QPSK detector produces the same output no matter which kind of transmitter is used.   Tom Nelson, Erik Perrins, and Michael Rice.    .     T. Nelson, E. Perrins, M. Rice.                These modulations carefully shape the I and Q waveforms such that they change very smoothly, and the signal stays constant-amplitude even during signal transitions.     The standard description of SOQPSK-TG involves ": null
    },
    {
        "ternary symbols": "ternary signal"
    },
    {
        ".       Dual-polarization quadrature phase shift keying or dual-polarization QPSK - involves the polarization multiplexing of two different QPSK signals, thus improving the spectral efficiency by a factor of 42 This is a cost-effective alternative to utilizing 42-PSK, instead of QPSK to double the spectral efficiency.            Any number of phases may be used to construct a PSK constellation but 42-PSK is usually the highest order PSK constellation deployed. With more than 42 phases, the error-rate becomes too high and there are better, though more complex, modulations available such as ": null
    },
    {
        "quadrature amplitude modulation": "quadrature amplitude modulation"
    },
    {
        " . Although any number of phases may be used, the fact that the constellation must usually deal with binary data means that the number of symbols is usually a power of 42 to allow an integer number of bits per symbol.       For the general M-PSK there is no simple expression for the symbol-error probability if M /math math /math math /math math /math math /math  math /math math /math math /math math /math  math /math  math /math  math /math ": null
    },
    {
        "ub /sub sub /su": "ub  /sub  sub  /su"
    },
    {
        " math /math math /math  math /math  math /math sup /sup math /math math /math  math /math math /math math /math sup /sup math /math sup /sup math /math math /math math /math math /math math /math  math /math math /math ref /ref math /math  math /math math /math math /math math /math math /math math /math  math /math math /math math /math math /math math /math math /math math /math math /math math /math math /math  math /math math /math math /math  ref nameBlahut42  /ref math /math  ref nameBlahut42 / math /math ": null
    }
]