[
    {
        "Phase inversion is the swapping of the two poles of an ": null
    },
    {
        "alternating current": "alternating current"
    },
    {
        " source. A phase inversion is neither a time shift nor a phase shift, but simply a swap of plus and minus.     For example, in a ": null
    },
    {
        "push–pull": "push–pull output"
    },
    {
        " power amplifier": "power amplifier"
    },
    {
        " using ": null
    },
    {
        "vacuum tube": "vacuum tube"
    },
    {
        "s, the signal is most often split by a ": null
    },
    {
        "phase splitter": "phase splitter"
    },
    {
        " stage which produces two signals, one in phase, and the other out of phase, that is, phase inverted. These two complementary signals then drive the two halves of the first push–pull stage, which may be either the output stage or the driver stage. The other common arrangements for driving a push-pull stage are by using an ": null
    },
    {
        "isolation transformer": "isolation transformer"
    },
    {
        " to produce the split signals, or by using the in-phase half of the first push-pull stage to drive the other half. A common circuit using this last technique is the ": null
    },
    {
        "long-tailed pair": "long-tailed pair"
    },
    {
        ", often seen in ": null
    },
    {
        "television set": "television set"
    },
    {
        "s and ": null
    },
    {
        "oscilloscope": "oscilloscope"
    },
    {
        "s.      In ": null
    },
    {
        "solid-state electronics": "solid-state electronics"
    },
    {
        " all of these techniques can be used, and phase inversion can also be produced by the use of NPN/PNP complementary circuitry, which has no corresponding technique in vacuum tube designs.     Phase inversion may occur with a random or periodic, symmetrical or non-symmetrical ": null
    },
    {
        "waveform": "waveform"
    },
    {
        ", although it is usually produced by the inversion of a symmetrical periodic ": null
    },
    {
        "signal": "signaling"
    },
    {
        ", resulting in a change in sign.     A symmetrical periodic signal represented by f A e^ , after phase inversion, becomes f_42 Ae^   where:   : t the  time    : A the  magnitude  of the vector.   : ω 42πf, the  angular frequency , the rate of change of the function argument in units of ": null
    },
    {
        "radian": "radian"
    },
    {
        "s per second   : f the  ordinary frequency , the number of oscillations that occur each second of time.   : Note that the algebraic sum of f and f_42 will always equal zero.       In ": null
    },
    {
        "emulsion": "emulsion"
    },
    {
        "s a phase inversion is when the dispersed phase becomes the dispersion medium and the dispersion medium becomes the dispersed phase, for example when ": null
    },
    {
        "cream": "cream"
    },
    {
        " becomes ": null
    },
    {
        "butter": "butter"
    },
    {
        ".                           ": null
    }
]