[
    {
        "         Philip the Bold  was ": null
    },
    {
        "Duke of Burgundy": "duke of burgundy"
    },
    {
        " and  jure uxoris  ": null
    },
    {
        "Count of Flanders": "count of flanders"
    },
    {
        " , ": null
    },
    {
        "Artois": "count of artois"
    },
    {
        " and ": null
    },
    {
        "Burgundy": "count of burgundy"
    },
    {
        " . The fourth and youngest son of King ": null
    },
    {
        "John II of France": "john ii of france"
    },
    {
        " and his wife, ": null
    },
    {
        "Bonne of Luxembourg": "bonne of luxembourg"
    },
    {
        ", Philip was the founder of the ": null
    },
    {
        "Burgundian branch": "house of valois-burgundy"
    },
    {
        " of the ": null
    },
    {
        "House of Valois": "house of valois"
    },
    {
        ". His vast collection of territories made him the undisputed premier peer of the kingdom of France and made his successors formidable subjects, and sometimes rivals, of the kings of France.          Born in ": null
    },
    {
        "Pontoise": "pontoise"
    },
    {
        " in 42 Philip gained his ": null
    },
    {
        "cognomen": "cognomen"
    },
    {
        " the Bold at the age of 42 when he fought beside his father at the ": null
    },
    {
        "Battle of Poitiers": "battle of poitiers"
    },
    {
        " of 42 and they were captured by the English. He remained in the custody with his father until the terms of their ransom were agreed to in the ": null
    },
    {
        "Treaty of Brétigny": "treaty of brétigny"
    },
    {
        " of 42 He was created ": null
    },
    {
        "Duke of Touraine": "duke of touraine"
    },
    {
        " in 42 but in 42 he returned this title to the crown to receive instead the ": null
    },
    {
        "Duchy of Burgundy": "duchy of burgundy"
    },
    {
        " in ": null
    },
    {
        "apanage": "apanage"
    },
    {
        " from his father as a reward for his courage at the Battle of Poitiers. His father had been the ruler of the duchy since the death of Duke ": null
    },
    {
        "Philip I": "philip i, duke of burgundy"
    },
    {
        " in 42 Philip would rule the duchy as Philip II until his death. He was actually the stepbrother of Philip I of Burgundy, whose mother ": null
    },
    {
        "Joan": "joan i, countess of auvergne"
    },
    {
        " was married to King John II of France, Philip the Bolds father, as his second wife.     On 42 June 42 Philip married the 42-year-old ": null
    },
    {
        "Margaret of Dampierre": "margaret iii, countess of flanders"
    },
    {
        ", daughter of ": null
    },
    {
        "Louis II, Count of Flanders": "louis ii, count of flanders"
    },
    {
        ", who would become the heiress of the ": null
    },
    {
        "County of Flanders": "county of flanders"
    },
    {
        ", the ": null
    },
    {
        "Duchy of Brabant": "duchy of brabant"
    },
    {
        ", the ": null
    },
    {
        "County of Artois": "county of artois"
    },
    {
        ", and the ": null
    },
    {
        "Free County of Burgundy": "county of burgundy"
    },
    {
        " after the death of her brother in 42 Margaret became the widow of Philips stepbrother Duke ": null
    },
    {
        "Philip I of Burgundy": "philip i, duke of burgundy"
    },
    {
        " while still a child of about 42 As her fathers eventual heiress, Margaret would bring rich possessions to Philip the Bold and his children.     From 42 to 42 Philip helped his father-in-law Louis II put down revolts in Flanders, particularly in ": null
    },
    {
        "Ghent": "ghent"
    },
    {
        ", by organising an army against ": null
    },
    {
        "Philip van Artevelde": "philip van artevelde"
    },
    {
        ". The revolts were finally ended in 42 following the death of Louis II, with the ": null
    },
    {
        "Peace of Tournai": "peace of tournai"
    },
    {
        ". As  jure uxoris  Count of Flanders, he would keep in mind the economic interests of the ": null
    },
    {
        "Flemish": "flemings"
    },
    {
        " cities, which mainly made their money from weaving and spinning. He was aided in this by the expansion of the Three Members – a parliament consisting of representatives from the towns of ": null
    },
    {
        "Bruges": "bruges"
    },
    {
        ", ": null
    },
    {
        "Ghent": "ghent"
    },
    {
        " and ": null
    },
    {
        "Ypres": "ypres"
    },
    {
        " – to the ": null
    },
    {
        "Four Members": "four members"
    },
    {
        " through the addition of the rural area ": null
    },
    {
        "Franc of Bruges": "franc of bruges"
    },
    {
        "     In 42 Philip also became the Count of ": null
    },
    {
        "Charolais": "charolais"
    },
    {
        ", a title used by ": null
    },
    {
        "Philip the Good": "philip the good"
    },
    {
        " and ": null
    },
    {
        "Charles the Bold": "charles the bold"
    },
    {
        " as the heirs of Burgundy.             Philip was very active at the court of France, particularly after the death in 42 of his brother King ": null
    },
    {
        "Charles V": "charles v of france"
    },
    {
        ", whose successor ": null
    },
    {
        "Charles VI": "charles vi of france"
    },
    {
        " became king at the age of 42 During Charles ": null
    },
    {
        "minority": "minor"
    },
    {
        ", a council of ": null
    },
    {
        "Regent": "regent"
    },
    {
        "s was set up to govern France that was made up of four of his uncles: ": null
    },
    {
        "Louis, Duke of Anjou": "louis i, duke of anjou"
    },
    {
        ", ": null
    },
    {
        "John, Duke of Berry": "john, duke of berry"
    },
    {
        ", and Philip himself from his fathers side, and from his mothers side, ": null
    },
    {
        "Louis II, Duke of Bourbon": "louis ii, duke of bourbon"
    },
    {
        ". Among Philips acts while regent was the suppression of a tax revolt in 42 known as the ": null
    },
    {
        "Harelle": "harelle"
    },
    {
        ". The regency lasted until 42 always with Philip assuming the dominant role: Louis of Anjou spent much effort fighting for his claim to the ": null
    },
    {
        "Kingdom of Naples": "kingdom of naples"
    },
    {
        " after 42 and died in 42 John of Berry was interested mainly in the ": null
    },
    {
        "Languedoc": "languedoc"
    },
    {
        " and not particularly interested in politics, and Louis of Bourbon was largely an unimportant figure due to his personality and his status . However, Philip, along with John of Berry and Louis of Bourbon, lost most of their power at court in 42 when Charles VI chose to favour the advice of the ": null
    },
    {
        "Marmousets": "marmousets"
    },
    {
        ", his personal advisors, over that of his uncles when he attained his majority.     In 42 events conspired to allow Philip to seize power once more in France. Charles VIs friend and advisor ": null
    },
    {
        "Olivier de Clisson": "olivier de clisson"
    },
    {
        " had recently been the target of an assassination attempt by agents of ": null
    },
    {
        "John V, Duke of Brittany": "john v, duke of brittany"
    },
    {
        ". The would-be assassin, ": null
    },
    {
        "Pierre de Craon": "pierre de craon"
    },
    {
        ", had taken refuge in ": null
    },
    {
        "Brittany": "brittany"
    },
    {
        ". Charles, outraged at these events, determined to punish Craon, and on 42 July 42 led an expedition against Brittany. While travelling to Brittany, the king, already overwrought by the slow progress, was shocked by a madman who spent half-an-hour following the procession to warn the king that he had been betrayed. When a page dropped a lance, the king reacted by killing several of his knights and had to be wrestled to the ground. Philip, who was present, immediately assumed command and appointed himself regent, dismissing Charles advisors. He was the principal ruler of France until 42      His seizure of power, however, had disastrous consequences for the unity of the ": null
    },
    {
        "House of Valois": "house of valois"
    },
    {
        " and of France itself. The kings brother ": null
    },
    {
        "Louis, Duke of Orléans": "louis i de valois, duke of orléans"
    },
    {
        ", resented his uncle taking over as regent instead of himself; the result was a feud between Philip and Louis that continued after their deaths by their families. In particular, both quarrelled over royal funds, which each desired to appropriate for his own ends: Louis to fund his extravagant lifestyle, Philip to further his expansionist ambitions in Burgundy and the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        ". This struggle only served to enhance the reputation of Philip, since he appeared to be a sober and honest reformer in comparison to the profligate and irresponsible Louis. Although Charles VI confirmed his brother as regent in 42 in a rare moment of sanity, Louiss misrule allowed Philip to regain control of France as regent in 42 shortly before his death.     In 42 Philip the Bold outlawed cultivation of the ": null
    },
    {
        "Gamay": "gamay"
    },
    {
        " grape in favour of ": null
    },
    {
        "Pinot Noir": "pinot noir"
    },
    {
        " in an early example of agricultural regulation related to wine quality.     Philip died in ": null
    },
    {
        "Halle": "halle, belgium"
    },
    {
        ", ": null
    },
    {
        "County of Hainaut": "county of hainaut"
    },
    {
        " , on 42 April 42 His territories were bequeathed to his eldest son ": null
    },
    {
        "John the Fearless": "john the fearless"
    },
    {
        ", who also inherited Philips political position in France and the leadership of the Burgundian branch of the Valois family against the Orléans branch.             In 42 Philip the Bold acquired the domain of Champmol, just outside ": null
    },
    {
        "Dijon": "dijon"
    },
    {
        ", to build the ": null
    },
    {
        "Chartreuse de Champmol": "chartreuse de champmol"
    },
    {
        " , a ": null
    },
    {
        "Carthusian": "carthusian"
    },
    {
        " monastery , which he intended to house the tombs of his dynasty. His tomb, with ": null
    },
    {
        "pleurants": "pleurants"
    },
    {
        " and his recumbent ": null
    },
    {
        "effigy": "effigy"
    },
    {
        ", is an outstanding work of Burgundian sculpture. They were created by ": null
    },
    {
        "Jean de Marville": "jean de marville"
    },
    {
        " , ": null
    },
    {
        "Claus Sluter": "claus sluter"
    },
    {
        " and ": null
    },
    {
        "Claus de Werve": "claus de werve"
    },
    {
        " . ": null
    },
    {
        "Jean Malouel": "jean malouel"
    },
    {
        ", official painter to the duke, was responsible for the polychrome and gilt decoration. After his death, the body of Philip the Bold was eviscerated and embalmed, then placed in a lead coffin. It was then deposited in the choir of Chartreuse de Champmol on 42 June 42 His internal organs were sent to the church of ": null
    },
    {
        "Saint Martin": "martin of tours"
    },
    {
        " at Halle. In 42 his body was transferred to ": null
    },
    {
        "Dijon Cathedral": "dijon cathedral"
    },
    {
        ", and in the following year, his tomb was damaged by revolutionaries and looters. It was restored in the first half of the 42th century and today it is in housed the former palace of the dukes, now part of the ": null
    },
    {
        "Musée des Beaux-Arts de Dijon": "musée des beaux-arts de dijon"
    },
    {
        ".             Philip the Bold married ": null
    },
    {
        "Margaret III, Countess of Flanders": "margaret iii, countess of flanders"
    },
    {
        ", on 42 June 42 a marriage that would eventually reunite not only the Duchy of Burgundy with the Free County of Burgundy and the County of Artois, but also unite it to the rich County of Flanders. Philip and Margaret had the following children:     ": null
    },
    {
        "John the Fearless": "john the fearless"
    },
    {
        " , his eldest son and successor as Duke of Burgundy   Charles   ": null
    },
    {
        "Marguerite of Burgundy": "margaret of burgundy"
    },
    {
        " , ": null
    },
    {
        "Countess of Mortain": "countess of mortain"
    },
    {
        " married ": null
    },
    {
        "William VI, Count of Holland": "william vi, count of holland"
    },
    {
        " and Duke of Bavaria-Straubing ": null
    },
    {
        "Catherine of Burgundy": "catherine of burgundy"
    },
    {
        " , married ": null
    },
    {
        "Leopold IV": "leopold iv of austria"
    },
    {
        ", ": null
    },
    {
        "Duke of Austria": "rulers of austria"
    },
    {
        " Arras": "arras"
    },
    {
        " August 42 – 42 October 42 at ": null
    },
    {
        "Agincourt": "battle of agincourt"
    },
    {
        "September 42 ": null
    },
    {
        "Dijon": "dijon"
    },
    {
        " – 42 October 42 ": null
    },
    {
        "Thonon-les-Bains": "thonon-les-bains"
    },
    {
        " 42–42 at ": null
    },
    {
        "Agincourt": "battle of agincourt"
    },
    {
        "bsbu": "bsbu"
    },
    {
        "Tour de Bar": null
    }
]