[
    {
        "Philipp Franz Balthasar von Siebold was a German ": null
    },
    {
        "physician": "Physician"
    },
    {
        ", ": null
    },
    {
        "botanist": "Botanist"
    },
    {
        ", and traveler. He achieved prominence by his studies of Japanese ": null
    },
    {
        "flora": "Flora"
    },
    {
        " and ": null
    },
    {
        "fauna": "Fauna"
    },
    {
        " and the introduction of Western medicine in Japan. He was the father of the first female Japanese doctor, ": null
    },
    {
        "Kusumoto Ine": "Kusumoto Ine"
    },
    {
        ".                                         Born into a family of doctors and professors of medicine in ": null
    },
    {
        "Würzburg": "Würzburg"
    },
    {
        " , Siebold initially studied medicine at ": null
    },
    {
        "University of Würzburg": "University Of Würzburg"
    },
    {
        " from November 1815,  where he became a member of the ": null
    },
    {
        "Corps": "German Student Corps"
    },
    {
        " Moenania Würzburg. One of his professors was ": null
    },
    {
        "Franz Xaver Heller": "Franz Xaver Heller"
    },
    {
        " , author of the  . ": null
    },
    {
        "Ignaz Döllinger": "Ignaz Döllinger"
    },
    {
        " , his professor of anatomy and physiology, however, most influenced him. Döllinger was one of the first professors to understand and treat medicine as a natural science. Siebold stayed with Döllinger, where he came in regular contact with other scientists. He read the books of ": null
    },
    {
        "Humboldt": "Alexander Von Humboldt"
    },
    {
        ", a famous naturalist and explorer, which probably raised his desire to travel to distant lands. Philipp Franz von Siebold became a physician by earning his ": null
    },
    {
        "M.D.": "Doctor Of Medicine"
    },
    {
        " degree in 1820. He initially practiced medicine in ": null
    },
    {
        "Heidingsfeld": "Heidingsfeld"
    },
    {
        ", in the ": null
    },
    {
        "Kingdom of Bavaria": "Kingdom Of Bavaria"
    },
    {
        ", now part of ": null
    },
    {
        "Würzburg": "Würzburg"
    },
    {
        ".     Invited to Holland by an acquaintance of his family, Siebold applied for a position as a military physician, which would enable him to travel to the Dutch colonies. He entered the Dutch military service on June 19, 1822, and was appointed as ships surgeon on the frigate Adriana, sailing from ": null
    },
    {
        "Rotterdam": "Rotterdam"
    },
    {
        " to Batavia  in the ": null
    },
    {
        "Dutch East Indies": "Dutch East Indies"
    },
    {
        " . On his trip to Batavia on the frigate Adriana, Siebold practiced his knowledge of the Dutch language and also rapidly learned ": null
    },
    {
        "Malay": "Malay Language"
    },
    {
        ", and during the long voyage he began a collection of marine fauna. He arrived in Batavia on February 18, 1823.     As an army medical officer, Siebold was posted to an ": null
    },
    {
        "artillery": "Artillery"
    },
    {
        " unit. However, he was given a room for a few weeks at the residence of the Governor-General of the Dutch East Indies, Baron ": null
    },
    {
        "Godert van der Capellen": "Godert Van Der Capellen"
    },
    {
        ", to recover from an illness. With his erudition, he impressed the Governor-General, and also the director of the botanical garden at Buitenzorg , ": null
    },
    {
        "Caspar Georg Carl Reinwardt": "Caspar Georg Carl Reinwardt"
    },
    {
        ". These men sensed in Siebold a worthy successor to ": null
    },
    {
        "Engelbert Kaempfer": "Engelbert Kaempfer"
    },
    {
        " and ": null
    },
    {
        "Carl Peter Thunberg": "Carl Peter Thunberg"
    },
    {
        ", two former resident physicians at ": null
    },
    {
        "Dejima": "Dejima"
    },
    {
        ", a Dutch trading post in ": null
    },
    {
        "Japan": "Japan"
    },
    {
        ", the latter of whom was the author of . The ": null
    },
    {
        "Batavian Academy of Arts and Sciences": "Batavian Academy Of Arts And Sciences"
    },
    {
        " soon elected Siebold as a member.       On 28 June 1823, after only a few months in the Dutch East Indies, Siebold was posted as resident ": null
    },
    {
        "physician": "Physician"
    },
    {
        " and ": null
    },
    {
        "scientist": "Scientist"
    },
    {
        " to ": null
    },
    {
        "Dejima": "Dejima"
    },
    {
        ", a small artificial island and trading post at ": null
    },
    {
        "Nagasaki": "Nagasaki, Nagasaki"
    },
    {
        ", and arrived there on 11 August 1823. During an eventful voyage to Japan he only just escaped drowning during a ": null
    },
    {
        "typhoon": "Typhoon"
    },
    {
        " in the ": null
    },
    {
        "East China Sea": "East China Sea"
    },
    {
        ". As only a very small number of Dutch personnel were allowed to live on this island, the posts of physician and scientist had to be combined. Dejima had been in the possession of the ": null
    },
    {
        "Dutch East India Company": "Dutch East India Company"
    },
    {
        " since the 17th century, but the Company had gone bankrupt in 1798, after which a trading post was operated there by the Dutch state for political considerations, with notable benefits to the Japanese.     The European tradition of sending doctors with botanical training to Japan was a long one. Sent on a mission by the Dutch East India Company, ": null
    },
    {
        "Engelbert Kaempfer": "Engelbert Kaempfer"
    },
    {
        " , a German physician and botanist who lived in Japan from 1690 until 1692, ushered in this tradition of a combination of physician and botanist. The Dutch East India Company did not, however, actually employ the Swedish botanist and physician ": null
    },
    {
        "Carl Peter Thunberg": "Carl Peter Thunberg"
    },
    {
        " , who had arrived in Japan in 1775.       Japanese scientists invited Siebold to show them the marvels of western science, and he learned in return through them much about the Japanese and their customs. After curing an influential local officer, Siebold gained the permission to leave the trade post. He used this opportunity to treat Japanese patients in the greater area around the trade post. Siebold is credited with the introduction of ": null
    },
    {
        "vaccination": "Vaccination"
    },
    {
        " and pathological anatomy for the first time in Japan.      In 1824, Siebold started a medical school in Nagasaki, the Narutaki-juku,  that grew into a meeting place for around fifty students. They helped him in his botanical and naturalistic studies. The Dutch language became the  lingua franca  for these academic and scholarly contacts for a generation, until the ": null
    },
    {
        "Meiji Restoration": "Meiji Restoration"
    },
    {
        ".     His patients paid him in kind with a variety of objects and artifacts that would later gain historical significance. These everyday objects later became the basis of his large ": null
    },
    {
        "ethnographic": "Ethnography"
    },
    {
        " collection, which consisted of everyday household goods, ": null
    },
    {
        "woodblock prints": "Woodblock Prints"
    },
    {
        ", tools and hand-crafted objects used by the Japanese people.       During his stay in Japan, Siebold lived together with Kusumoto Taki , who gave birth to their daughter ": null
    },
    {
        "Kusumoto Ine": "Kusumoto Ine"
    },
    {
        " in 1827. Siebold used to call his wife Otakusa and named a  Hydrangea  after her. Kusumoto Ine eventually became the first Japanese woman known to have received a physicians training and became a highly regarded practicing physician and court physician to the Empress in 1882. She died at court in 1903.        His main interest, however, focused on the study of Japanese fauna and flora. He collected as much material as he could. Starting a small botanical garden behind his home Siebold amassed over 1,000 native plants. In a specially built ": null
    },
    {
        "glasshouse": "Greenhouse"
    },
    {
        " he cultivated the Japanese plants to endure the ": null
    },
    {
        "Dutch": "Netherlands"
    },
    {
        " climate": "Climate"
    },
    {
        ". Local Japanese artists like ": null
    },
    {
        "Kawahara Keiga": "Kawahara Keiga"
    },
    {
        " drew and painted images of these plants, creating botanical illustrations but also images of the daily life in Japan, which complemented his ethnographic collection. He hired Japanese hunters to track rare animals and collect specimens. Many specimens were collected with the help of his Japanese collaborators ": null
    },
    {
        "Keisuke Ito": "Keisuke Ito"
    },
    {
        " , Mizutani Sugeroku , Ōkochi Zonshin and Katsuragawa Hoken , a physician to the  shōgun . As well, Siebolds assistant and later successor, ": null
    },
    {
        "Heinrich Bürger": "Heinrich Bürger"
    },
    {
        " , proved to be indispensable in carrying on Siebolds work in Japan.     Siebold first introduced to Europe such familiar garden-plants as the  Hosta  and the ": null
    },
    {
        "Hydrangea otaksa": "Hydrangea"
    },
    {
        ". Unknown to the Japanese, he was also able to smuggle out germinative seeds of ": null
    },
    {
        "tea plants": "Camellia Sinensis"
    },
    {
        " to the botanical garden  in Batavia. Through this single act, he started the ": null
    },
    {
        "tea culture": "Tea Culture"
    },
    {
        " in ": null
    },
    {
        "Java": "Java"
    },
    {
        ", a Dutch ": null
    },
    {
        "colony": "Colony"
    },
    {
        " at the time. Until then Japan had strictly guarded the trade in tea plants. Remarkably, in 1833, Java already could boast a half million tea plants.     He also introduced Japanese knotweed , which has become a highly invasive weed in Europe and North America.  All derive from a single female plant collected by Siebold.     During his stay at Dejima, Siebold sent three shipments with an unknown number of herbarium specimens to ": null
    },
    {
        "Leiden": "Leiden"
    },
    {
        ", ": null
    },
    {
        "Ghent": "Ghent"
    },
    {
        ", ": null
    },
    {
        "Brussels": "Brussels"
    },
    {
        " and ": null
    },
    {
        "Antwerp": "Antwerp"
    },
    {
        ". The shipment to Leiden contained the first specimens of the ": null
    },
    {
        "Japanese giant salamander": "Japanese Giant Salamander"
    },
    {
        "  to be sent to Europe.     In 1825 the government of the Dutch-Indies provided him with two assistants: apothecary and mineralogist ": null
    },
    {
        "Heinrich Bürger": "Heinrich Bürger"
    },
    {
        " and the painter ": null
    },
    {
        "Carl Hubert de Villeneuve": "Carl Hubert De Villeneuve"
    },
    {
        ". Each would prove to be useful to Siebolds efforts that ranged from ethnographical to botanical to horticultural, when attempting to document the exotic Eastern Japanese experience. De Villeneuve taught Kawahara the techniques of Western painting.     Reportedly, Siebold was not the easiest man to deal with. He was in continuous conflict with his Dutch superiors who felt he was arrogant. This threat of conflict resulted in his recall in July 1827 back to Batavia. But the ship, the Cornelis Houtman, sent to carry him back to Batavia, was thrown ashore by a typhoon in Nagasaki bay. The same storm badly damaged Dejima and destroyed Siebolds botanical garden. Repaired, the Cornelis Houtman was refloated. It left for Batavia with 89 crates of Siebolds salvaged botanical collection, but Siebold himself remained behind in Dejima.       In 1826 Siebold made the court journey to ": null
    },
    {
        "Edo": "Edo"
    },
    {
        ". During this long trip he collected many plants and animals. But he also obtained from the court astronomer Takahashi Kageyasu several detailed maps of Japan and Korea , an act strictly forbidden by the Japanese government. When the Japanese discovered, by accident, that Siebold had a map of the northern parts of Japan, the government accused him of ": null
    },
    {
        "high treason": "High Treason"
    },
    {
        " and of being a spy for ": null
    },
    {
        "Russia": "Russia"
    },
    {
        ".     The Japanese placed Siebold under house arrest and expelled him from ": null
    },
    {
        "Japan": "Japan"
    },
    {
        " on 22 October 1829. Satisfied that his Japanese collaborators would continue his work, he journeyed back on the frigate Java to his former residence, Batavia, in possession of his enormous collection of thousands of animals and plants, his books and his maps. The botanical garden of  would soon house Siebolds surviving, living flora collection of 2,000 plants. He arrived in the Netherlands on 7 July 1830. His stay in Japan and Batavia had lasted for a period of eight years.       Philipp Franz von Siebold arrived in the Netherlands in 1830, just at a time when political troubles erupted in ": null
    },
    {
        "Brussels": "Brussels"
    },
    {
        ", leading soon to ": null
    },
    {
        "Belgian independence": "Belgian Revolution"
    },
    {
        ". Hastily he salvaged his ethnographic collections in ": null
    },
    {
        "Antwerp": "Antwerp"
    },
    {
        " and his herbarium specimens in Brussels and took them to ": null
    },
    {
        "Leiden": "Leiden"
    },
    {
        ", helped by ": null
    },
    {
        "Johann Baptist Fischer": "Johann Baptist Fischer"
    },
    {
        ". He left behind his botanical collections of living plants that were sent to the ": null
    },
    {
        "University of Ghent": "University Of Ghent"
    },
    {
        ". The consequent expansion of this collection of rare and exotic plants led to the horticultural fame of ": null
    },
    {
        "Ghent": "Ghent"
    },
    {
        ". In gratitude the University of Ghent presented him in 1841 with specimens of every plant from his original collection.     Siebold settled in Leiden, taking with him the major part of his collection. The Philipp Franz von Siebold collection , containing many ": null
    },
    {
        "type specimen": "Type Specimen"
    },
    {
        "s, was the earliest botanical collection from Japan. Even today, it still remains a subject of ongoing research, a testimony to the depth of work undertaken by Siebold. It contained about 12,000 specimens, from which he could describe only about 2,300 species. The whole collection was purchased for a handsome amount by the Dutch government. Siebold was also granted a substantial annual allowance by the Dutch King ": null
    },
    {
        "William II": "William Ii Of The Netherlands"
    },
    {
        " and was appointed Advisor to the King for Japanese Affairs. In 1842, the King even raised Siebold to the nobility as an esquire.     The Siebold collection opened to the public in 1831. He founded a museum in his home in 1837. This small, private museum would eventually evolve into the ": null
    },
    {
        "National Museum of Ethnology": "National Museum Of Ethnology"
    },
    {
        " in Leiden.  Siebolds successor in Japan, Heinrich Bürger, sent Siebold three more shipments of herbarium specimens collected in Japan. This flora collection formed the basis of the Japanese collections of the ": null
    },
    {
        "National Herbarium of the Netherlands": "National Herbarium Of The Netherlands"
    },
    {
        "  in Leiden, while the zoological specimens Siebold collected were kept by the ": null
    },
    {
        "Rijksmuseum van Natuurlijke Historie": "Rijksmuseum Van Natuurlijke Historie"
    },
    {
        "  in Leiden, which later became Naturalis. Both institutions merged into ": null
    },
    {
        "Naturalis Biodiversity Center": "Naturalis Biodiversity Center"
    },
    {
        " in 2010, which now maintains the entire natural history collection that Siebold brought back to Leiden.      In 1845 Siebold married Helene von Gagern , they had three sons and two daughters.       During his stay in Leiden, Siebold wrote Nippon in 1832, the first part of a volume of a richly illustrated ethnographical and geographical work on Japan. The Archiv zur Beschreibung Nippons also contained a report of his journey to the Shogunate Court at Edo. He wrote six further parts, the last ones published posthumously in 1882; his sons published an edited and lower-priced reprint in 1887.          The  appeared between 1833 and 1841. This work was co-authored by Joseph Hoffmann and Kuo Cheng-Chang, a Javanese of Chinese extraction, who had journeyed along with Siebold from Batavia. It contained a survey of Japanese literature and a Chinese, Japanese and Korean dictionary. Siebolds writing on Japanese religion and customs notably shaped early modern European conceptions of ": null
    },
    {
        "Buddhism": "Buddhism"
    },
    {
        " and ": null
    },
    {
        "Shinto": "Shinto"
    },
    {
        "; he notably suggested that Japanese Buddhism was a form of ": null
    },
    {
        "Monotheism": "Monotheism"
    },
    {
        ".      The zoologists ": null
    },
    {
        "Coenraad Temminck": "Coenraad Jacob Temminck"
    },
    {
        " , ": null
    },
    {
        "Hermann Schlegel": "Hermann Schlegel"
    },
    {
        " , and ": null
    },
    {
        "Wilhem de Haan": "Wilhem De Haan"
    },
    {
        " scientifically described and documented Siebolds collection of Japanese animals. The , a series of monographs published between 1833 and 1850, was mainly based on Siebolds collection, making the Japanese fauna the best-described non-European fauna – a remarkable feat . A significant part of the  was also based on the collections of Siebolds successor on Dejima, ": null
    },
    {
        "Heinrich Bürger": "Heinrich Bürger"
    },
    {
        ".     Siebold wrote his  in collaboration with the German botanist ": null
    },
    {
        "Joseph Gerhard Zuccarini": "Joseph Gerhard Zuccarini"
    },
    {
        " . It first appeared in 1835, but the work was not completed until after his death, finished in 1870 by F.A.W. Miquel , director of the Rijksherbarium in Leiden. This work expanded Siebolds scientific fame from Japan to Europe.     From the ": null
    },
    {
        "Hortus Botanicus Leiden": "Hortus Botanicus Leiden"
    },
    {
        " – the botanical garden of Leiden – many of Siebolds plants spread to Europe and from there to other countries. Hosta and  Hortensia ,  Azalea , and the Japanese ": null
    },
    {
        "butterbur": "Butterbur"
    },
    {
        " and the ": null
    },
    {
        "coltsfoot": "Petasites"
    },
    {
        " as well as the ": null
    },
    {
        "Japanese larch": "Japanese Larch"
    },
    {
        " began to inhabit gardens across the world.          After his return to Europe, Siebold tried to exploit his knowledge of Japan. Whilst living in ": null
    },
    {
        "Boppard": "Boppard"
    },
    {
        ", from 1852 he corresponded with Russian diplomats such as ": null
    },
    {
        "Baron von Budberg-Bönninghausen": "Andreas Feodorowitsch Budberg"
    },
    {
        ", the Russian ambassador to ": null
    },
    {
        "Prussia": "Prussia"
    },
    {
        ", which resulted in an invitation to go to St Petersburg to advise the Russian government how to open trade relations with Japan. Though still employed by the Dutch government he did not inform the Dutch of this voyage until after his return.     American Naval Commodore ": null
    },
    {
        "Matthew C. Perry": "Matthew C. Perry"
    },
    {
        " consulted Siebold in advance of his voyage to Japan in 1854.  He notably advised ": null
    },
    {
        "Townsend Harris": "Townsend Harris"
    },
    {
        " on how ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        " might be spread to Japan, alleging based on his time there that the Japanese hated Christianity.      In 1858, the Japanese government lifted the banishment of Siebold. He returned to Japan in 1859 as an adviser to the Agent of the Dutch Trading Society in Nagasaki, Albert Bauduin. After two years the connection with the Trading Society was severed as the advice of Siebold was considered to be of no value. In Nagasaki he fathered another child with one of his female servants.     In 1861 Siebold organised his appointment as an adviser to the Japanese government and went in that function to Edo. There he tried to obtain a position between the foreign representatives and the Japanese government. As he had been specially admonished by the Dutch authorities before going to Japan that he was to abstain from all interference in politics, the Dutch Consul General in Japan, J.K. de Wit, was ordered to ask Siebolds removal.  Siebold was ordered to return to Batavia and from there he returned to Europe.     After his return he asked the Dutch government to employ him as Consul General in Japan but the Dutch government severed all relations with Siebold who had a huge debt because of loans given to him, except for the payment of his pension.     Siebold kept trying to organise another voyage to Japan. After he did not succeed in gaining employment with the Russian government, he went to Paris in 1865 to try to interest the French government in funding another expedition to Japan, but failed The story is told by ": null
    },
    {
        "Alphonse Daudet": "Alphonse Daudet"
    },
    {
        " in the short story LEmpereur aveugle , part of his book Contes du lundi . . He died in ": null
    },
    {
        "Munich": "Munich"
    },
    {
        " on 18 October 1866.         The botanical and horticultural spheres of influence have honored Philipp Franz von Siebold by naming some of the very garden-worthy plants that he studied after him. Examples include:     Acer sieboldianum  or Siebolds Maple: a variety of maple native to Japan    Calanthe sieboldii  or Siebolds Calanthe is a terrestrial evergreen orchid native to Japan, the Ryukyu Islands and Taiwan.    Clematis florida  var. sieboldiana : a somewhat difficult Clematis to grow well but a much sought after plant nevertheless    Corylus sieboldiana : is a species of nut found in northeastern Asia and Japan    Dryopteris sieboldii : a fern with leathery fronds    Hosta sieboldii  of which a large garden may have a dozen quite distinct ": null
    },
    {
        "cultivars": "Cultivar"
    },
    {
        "   Magnolia sieboldii : the under-appreciated small Oyama magnolia    Malus sieboldii : the fragrant Toringo Crab-Apple, , whose pink buds fade to white    Primula sieboldii : the Japanese woodland primula Sakurasou    Prunus sieboldii : a flowering cherry    Sedum sieboldii : a succulent whose leaves form rose-like whorls    Tsuga sieboldii : a Japanese hemlock    Viburnum sieboldii : a deciduous large shrub that has creamy white flowers in spring and red berries that ripen to black in autumn        Enhydris sieboldii  or Siebolds smooth water snake Beolens, Bo; Watkins, Michael; Grayson, Michael . The Eponym Dictionary of Reptiles. Baltimore: Johns Hopkins University Press. xiii + 296 pp. . .   A type of ": null
    },
    {
        "abalone": "Abalone"
    },
    {
        ",  Nordotis gigantea , is known as Siebolds abalone,  and is prized for ": null
    },
    {
        "sushi": "Sushi"
    },
    {
        ".       Though he is well known in Japan, where he is called Shiboruto-san , and although mentioned in the relevant schoolbooks, Siebold is almost unknown elsewhere, except among gardeners who admire the many plants whose names incorporate sieboldii and sieboldiana. The ": null
    },
    {
        "Hortus Botanicus": "Hortus Botanicus Leiden"
    },
    {
        " in Leiden has recently laid out the Von Siebold Memorial Garden , a Japanese garden with plants sent by Siebold. The garden was laid out under a 150-year-old  Zelkova serrata  tree dating from Siebolds lifetime. A video introduces the Siebold Memorial garden. See  Japanese visitors come and visit this garden, to pay their respect for him.             Although he was disillusioned by what he perceived as a lack of appreciation for Japan and his contributions to its understanding, a testimony of the remarkable character of Siebold is found in ": null
    },
    {
        "museums": "Museum"
    },
    {
        "that honor him.   Japan Museum ": null
    },
    {
        "SieboldHuis": "Sieboldhuis"
    },
    {
        " in ": null
    },
    {
        "Leiden": "Leiden"
    },
    {
        ", ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        ", shows highlights from the Leiden Siebold collections in the transformed, refitted, formal, first house of Siebold in Leiden   ": null
    },
    {
        "Naturalis Biodiversity Center": "Naturalis Biodiversity Center"
    },
    {
        ", the National Museum of Natural History in Leiden, Netherlands houses the zoological and botanical specimens Siebold collected during his first stay in Japan . These include 200 mammals, 900 birds, 750 fishes, 170 reptiles, over 5,000 invertebrates, 2,000 different species of plants and 12,000 herbarium specimens. Parts of the Siebold natural history collection have been digitized in recent years, see    The ": null
    },
    {
        "National Museum of Ethnology": "National Museum Of Ethnology"
    },
    {
        " in ": null
    },
    {
        "Leiden": "Leiden"
    },
    {
        ", ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        " houses the large collection which Siebold brought together during his first stay in Japan .   The ": null
    },
    {
        "State Museum of Ethnology": "State Museum Of Ethnology"
    },
    {
        " in Munich, Germany, houses the collection of Philipp Franz von Siebold from his second voyage to Japan and a letter of Siebold to ": null
    },
    {
        "King Ludwig I": "Ludwig I Of Bavaria"
    },
    {
        " in which he urged the monarch to found a museum of ethnology at Munich. Siebolds grave, in the shape of a Buddhist pagoda, is in the  . He is also commemorated in the name of a street and a large number of mentions in the Botanical Garden at Munich.   A Siebold-Museum exists in ": null
    },
    {
        "Würzburg": "Würzburg"
    },
    {
        ", Germany.   Nagasaki, Japan, pays tribute to Siebold by housing the ": null
    },
    {
        "Siebold Memorial Museum": "Siebold Memorial Museum"
    },
    {
        " on property adjacent to Siebolds former residence in the Narutaki neighborhood, the first museum dedicated to a non-Japanese in Japan.     His collections laid the foundation for the ethnographic museums of Munich and Leiden. ": null
    },
    {
        "Alexander von Siebold": "Alexander Von Siebold"
    },
    {
        ", his son by his European wife, donated much of the material left behind after Siebolds death in Würzburg to the ": null
    },
    {
        "British Museum": "British Museum"
    },
    {
        " in London. The Royal Scientific Academy of ": null
    },
    {
        "St. Petersburg": "St. Petersburg"
    },
    {
        " purchased 600 colored plates of the .     Another son, ": null
    },
    {
        "Heinrich von Siebold": "Heinrich Von Siebold"
    },
    {
        " , continued part of his fathers research. He is recognized, together with ": null
    },
    {
        "Edward S. Morse": "Edward S. Morse"
    },
    {
        ", as one of the founders of modern ": null
    },
    {
        "archaeological": "Archaeology"
    },
    {
        " efforts in Japan.       Nippon. Archiv zur Beschreibung von Japan und dessen Neben- und Schutzländern: Jezo mit den Südlichen Kurilen, Krafto, Koorai und den Liukiu-Inseln. 7 volumes, Leiden.   Voyage au Japon Executé Pendant les Années 1823 a 1830 – French abridged version of Nippon – contains 72 plates from Nippon, with a slight variance in size and paper. Published in twelve Deliveries . Each Delivery contains 72 lithographs and each Delivery varies in its lithograph contents by four or five plate variations.   Revised and enlarged edition by his sons in 1897: Nippon. Archiv zur Beschreibung von Japan ..., 2. veränderte und ergänzte Auflage, hrsg. von seinen Söhnen, 2 volumes, Würzburg and Leipzig.   Translation of the part of Nippon on Korea : Boudewijn Walraven , Frits Vos , Korean Studies in Early-nineteenth century Leiden, Korean Histories 2.2, 75-85, 2010   Synopsis Hydrangeae generis specierum Iaponicarum. In: Nova Acta Physico-Medica Academiae Caesareae Leopoldino-Carolina vol 14, part ii.   Flora Japonica. Leiden.   Plantaram, quas in Japonia collegit Dr. Ph. Fr. de Siebold genera nova, notis characteristicis delineationibusque illustrata proponunt. In: Abhandelungen der mathematisch-physikalischen Classe der Königlich Bayerischen Akademie der Wissenschaften vol.3, pp 717–750.   Florae Japonicae familae naturales adjectis generum et specierum exemplis selectis. Sectio prima. Plantae Dicotyledoneae polypetalae. In: Abhandelungen der mathematischphysikalischen Classe der Königlich Bayerischen Akademie der Wissenschaften vol. 4 part iii, pp 109–204.   Florae Japonicae familae naturales adjectis generum et specierum exemplis selectis. Sectio altera. Plantae dicotyledoneae et monocotyledonae. In: Abhandelungen der mathematischphysikalischen Classe der Königlich Bayerischen Akademie der Wissenschaften vol. 4 part iii, pp vol 4 pp 123–240.        The standard ": null
    },
    {
        "author abbreviation": "List Of Botanists By Author Abbreviation"
    },
    {
        " Siebold is used to indicate Philipp Franz von Siebold as the author when ": null
    },
    {
        "citing a botanical name": "Author Citation"
    },
    {
        ". ": null
    }
]