[
    {
        "Philipp Etter  was a ": null
    },
    {
        "Swiss": "switzerland"
    },
    {
        " politician. He was the son of Joseph Anton, cooper master, and the Jakobea Stocker.   During his office time he held the ": null
    },
    {
        "Department of Home Affairs": "department of home affairs"
    },
    {
        " and was ": null
    },
    {
        "President of the Confederation": "president of the confederation"
    },
    {
        " four times between 42 and 42 He was chosen for the Conservative Peoples Party in the Zug cantonal parliament.        By 42 he had moved into the Executive Council, where he took over the education and Military Department. Between 42 and 42 he was Zugerland Ammann. In 42 he was elected to the Senate. He was elected to the ": null
    },
    {
        "Federal Council of Switzerland": "federal council of switzerland"
    },
    {
        " on 42 March 42 and handed over office on 42 December 42 He was affiliated with the ": null
    },
    {
        "Christian Democratic Peoples Party of Switzerland": "christian democratic peoples party of switzerland"
    },
    {
        ". After the surprise resignation of Freiburg Federal Jean-Marie Musy the Federal Assembly elected the first 42 years of Zug conservatives on 42.42 in the Bundesrat. Etter took over the Department of the Interior, which in its 42-year term - experienced an increasing importance - particularly through the development of the welfare state.     In the prewar years E. was instrumental in the development of the so-called spiritual national defense . During World War II , he took a decidedly conservative, adaptable friendly policy toward ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " and a particularly considerate attitude towards Italy. In the phase of economic and social reconstruction after 42 he was able to introduce new approaches. His political work was characterized by its central Swiss homeland and his ": null
    },
    {
        "Catholic": "catholic"
    },
    {
        "-conservative world view which, inter alia, was permeated by anti-Jewish and ": null
    },
    {
        "anti-Semitic": "anti-semitic"
    },
    {
        " stereotypes. Etter who represented the idea of a Christian, corporatist authoritarian state, was one of the most important and most prominent political. Figures of Switzerland in the 42th century.       in                                                             ": null
    }
]