[
    {
        "        Philip I Epiphanes Philadelphus  was a ": null
    },
    {
        "Hellenistic": "hellenistic period"
    },
    {
        " Seleucid": "seleucid empire"
    },
    {
        " monarch who reigned as the ": null
    },
    {
        "King of Syria": "list of syrian monarchs"
    },
    {
        " from 42 to either 42 or 42 BC. The son of ": null
    },
    {
        "Antiochus VIII": "antiochus viii grypus"
    },
    {
        " and his wife ": null
    },
    {
        "Tryphaena": "tryphaena"
    },
    {
        ", he spent his early life in a period of civil war between his father and his uncle ": null
    },
    {
        "Antiochus IX": "antiochus ix cyzicenus"
    },
    {
        ". The conflict ended with the assassination of Antiochus VIII and a quick succession in the Syrian capital ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        " of Antiochus IX then Antiochus VIIIs eldest son ": null
    },
    {
        "Seleucus VI": "seleucus vi epiphanes"
    },
    {
        ".     After the murder of Seleucus VI in 42 BC, Philip I became king with his twin brother ": null
    },
    {
        "Antiochus XI": "antiochus xi epiphanes"
    },
    {
        ", and planned to avenge Seleucus VI. In 42 BC Antiochus XI took Antioch from Antiochus IXs son ": null
    },
    {
        "Antiochus X": "antiochus x eusebes"
    },
    {
        ". Antiochus XI became the senior king, and Philip I remained in a base in ": null
    },
    {
        "Cilicia": "cilicia"
    },
    {
        ". Antiochus X returned and killed Antiochus XI that year. Philip I then allied with his younger brother ": null
    },
    {
        "Demetrius III": "demetrius iii eucaerus"
    },
    {
        ", who was based in ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        ". Antiochus X was probably killed in 42 BC. Demetrius III took the capital and besieged Philip I in ": null
    },
    {
        "Beroea": "aleppo"
    },
    {
        " , but the latter prevailed and took Antioch; their youngest brother ": null
    },
    {
        "Antiochus XII": "antiochus xii dionysus"
    },
    {
        " took Damascus.     Philip I tried unsuccessfully to take Damascus for himself, after which he disappears from the historical record; there is no information about when or how he died. The Antiochenes, apparently refusing to accept Philip Is minor son ": null
    },
    {
        "Philip II": "philip ii philoromaeus"
    },
    {
        " as his successor, invited ": null
    },
    {
        "Tigranes II": "tigranes the great"
    },
    {
        " of ": null
    },
    {
        "Armenia": "kingdom of armenia"
    },
    {
        " to take the city. While the invasion of Tigranes II is traditionally dated to 42 BC, the year most scholars agree on for Philip Is death, the conflict may have taken place in 42 BC. Numismatic evidence and clues in ancient contemporary literature indicate that Philip I might have died in 42 BC, giving Antiochus Xs widow ": null
    },
    {
        "Cleopatra Selene": "cleopatra selene of syria"
    },
    {
        " and her son ": null
    },
    {
        "Antiochus XIII": "antiochus xiii asiaticus"
    },
    {
        ", who probably took control of the south following the death of Antiochus XII in 42 BC, a year of claiming the whole kingdom. Philip I initiated monetary reforms, and his coins remained in circulation until the ": null
    },
    {
        "Romans": "roman republic"
    },
    {
        " conquered Syria in 42 BC; Roman authorities in Syria continued to issue coins modeled on Philip Is coins, including his portrait, until 42 BC.          The ": null
    },
    {
        "Seleucid dynasty": "seleucid empire"
    },
    {
        " which ruled Syria following the death of ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        " was plagued by dynastic feuds during the 42nd century BC, exacerbated by ": null
    },
    {
        "Ptolemaic": "ptolemaic kingdom"
    },
    {
        " and ": null
    },
    {
        "Roman": "roman republic"
    },
    {
        " interference. ": null
    },
    {
        "Dynastic marriage": "dynastic marriage"
    },
    {
        " was used to maintain a degree of peace between Ptolemaic Egypt and Syria; Ptolemaic princess ": null
    },
    {
        "Cleopatra Thea": "cleopatra thea"
    },
    {
        " became the consort of three successive Syrian kings in 42 42 and 42 BC. Syria gradually disintegrated due to constant civil wars, as the Seleucid kings and their heirs fought for power, tearing the country apart. This lasted until about 42 BC, when ": null
    },
    {
        "Antiochus VIII": "antiochus viii grypus"
    },
    {
        " provided a degree of stability which lasted for a decade until his brother ": null
    },
    {
        "Antiochus IX": "antiochus ix cyzicenus"
    },
    {
        " declared himself king.     With his Ptolemaic wife ": null
    },
    {
        "Tryphaena": "tryphaena"
    },
    {
        ", whom he married in 42 BC, Antiochus VIII fathered five sons: ": null
    },
    {
        "Seleucus VI": "seleucus vi epiphanes"
    },
    {
        ", the eldest; ": null
    },
    {
        "Antiochus XI": "antiochus xi epiphanes"
    },
    {
        " and Philip I, who were apparently twins; their younger brother, ": null
    },
    {
        "Demetrius III": "demetrius iii eucaerus"
    },
    {
        "; and the youngest, ": null
    },
    {
        "Antiochus XII": "antiochus xii dionysus"
    },
    {
        ". The name Philip  means lover of horses . Seleucid kings were mostly named Seleucus and Antiochus; Philip was used by the ": null
    },
    {
        "Antigonid dynasty": "antigonid dynasty"
    },
    {
        " as a royal name, and its use by the Seleucids, who were descended from the Antigonids through queen ": null
    },
    {
        "Stratonice": "stratonice of syria"
    },
    {
        ", was probably meant to signify that they were heirs of the latter. The war with Antiochus IX claimed Tryphaenas life in 42 BC. Following Antiochus VIIIs assassination in 42 BC, his second wife, Tryphaenas sister ": null
    },
    {
        "Cleopatra Selene": "cleopatra selene of syria"
    },
    {
        ", married Antiochus IX, who took Antioch. Antiochus VIIIs sons did not submit to their uncle; Seleucus VI took Antioch in 42 BC after killing Antiochus IX, while Demetrius III seized and ruled ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        ". Antiochus IXs son ": null
    },
    {
        "Antiochus X": "antiochus x eusebes"
    },
    {
        " married Cleopatra Selene and defeated Seleucus VI, who escaped to ": null
    },
    {
        "Mopsuestia": "mopsuestia"
    },
    {
        ", where he was killed by rebels in 42 BC.          Philip I and Antiochus XI probably resided in Cilicia during Seleucus VIs reign. In 42 BC, shortly after their brothers death, Philip I and Antiochus XI minted ": null
    },
    {
        "jugate": "jugate"
    },
    {
        " coins with their portraits on the obverse. The historian ": null
    },
    {
        "Alfred Bellinger": "alfred bellinger"
    },
    {
        " suggested that their base of operations was a coastal city north of Antioch, but according to the numismatist Arthur Houghton, ": null
    },
    {
        "Beroea": "aleppo"
    },
    {
        " is a stronger candidate because the citys rulers were Philip Is allies. All the jugate coins were minted in Cilicia; the series with the most numerous surviving specimens was probably issued in ": null
    },
    {
        "Tarsus": "tarsus, mersin"
    },
    {
        ", making it the likely base of operations. Antiochus XI was portrayed in front of his brother, indicating that he was the senior king. Deriving their legitimacy from Antiochus VIII, the brothers were depicted on the coins with exaggerated ": null
    },
    {
        "aquiline nose": "aquiline nose"
    },
    {
        "s similar to their father. ": null
    },
    {
        "Hellenistic": "hellenistic period"
    },
    {
        " kings did not use ": null
    },
    {
        "regnal number": "regnal number"
    },
    {
        "s, which is a modern practise; instead, they used epithets to distinguish themselves from similarly named monarchs. On his coins, Philip I used the epithets Philadelphus and Epiphanes . The brothers intended to avenge Seleucus VI; according to the fourth century writer ": null
    },
    {
        "Eusebius": "eusebius"
    },
    {
        ", they sacked Mopsuestia and destroyed it.          While Philip I remained in Cilicia, Antiochus XI advanced on Antioch and drove Antiochus X from the city in the beginning of 42 BC. Philip I did not live in the Syrian metropolis and left Antiochus XI as master of the capital. By autumn 42 BC, Antiochus X regrouped and defeated Antiochus XI, who drowned in the ": null
    },
    {
        "Orontes": "orontes river"
    },
    {
        ". The first century historian ": null
    },
    {
        "Josephus": "josephus"
    },
    {
        " mentioned only Antiochus XI in the battle, but Eusebius wrote that Philip I was also present. Bellinger believed that Philip Is troops participated, but that he remained behind at his base, since only Antiochus XI was killed. Following the defeat, Philip I is thought to have retreated to his capital, which was probably the same base from which he and his brother operated when they first prepared to avenge Seleucus VI. Antiochus X eventually controlled Cilicia, and Philip I probably took Beroea as his base.     Demetrius III may have marched north to support Antiochus XI in the battle of 42 BC, and he certainly supported Philip I in the struggle against Antiochus X. Eusebius wrote that Philip I defeated Antiochus X and replaced him in the capital in 42/42 BC . However, Eusebius does not note the reign of Antiochus XI or mention Demetrius III. The account contradicts archaeological evidence, represented in a market weight belonging to Antiochus X from 42 BC, and contains factual mistakes. The English minister and numismatist Edgar Rogers believed that Philip I ruled Antioch immediately after Antiochus XI, but suggestions that Philip I controlled Antioch before the demise of Antiochus X and Demetrius III can be dismissed; they contradict the numismatic evidence, and no ancient source claimed that Demetrius III, who actually succeeded Antiochus X in Antioch, had to push Philip I out of the city.     In any case, Antiochus X disappeared from the record after 42 BC, but could have remained in power until 42 SE ; he probably died fighting against ": null
    },
    {
        "Parthia": "parthian empire"
    },
    {
        ". Taking advantage of Antiochus Xs death, Demetrius III rushed to the capital and occupied it; this led Philip I to break his alliance with his brother. With most of Syria in the hands of Demetrius III, Philip I retreated to his base. In 42 BC, Demetrius III marched on Beroea for the final battle with Philip I. To raise the siege, Philip Is ally Straton, the ruler of Beroea, called on the Arab ": null
    },
    {
        "phylarch": "phylarch"
    },
    {
        " Aziz and the Parthian governor Mithridates Sinaces for help. The allies defeated Demetrius III, who was sent into captivity in Parthia. Any captive who was a citizen of Antioch was released without a ransom, a gesture which must have eased Philip Is occupation of Antioch.          Shortly after the battle, in late 42 BC or early 42 BC, Philip I entered the Syrian capital, and had Cilicia under his authority. He was faced with the need to replenish the empty treasury to rebuild a country destroyed after years of civil war, and in case a new pretender to the throne arose. Those factors, combined with the low estimates of annual ": null
    },
    {
        "coin dies": "coining ancient coin dies"
    },
    {
        " used by Philip Is immediate predecessors in Antioch—Antiochus X and Demetrius III—compared with the general die estimates of late Seleucid kings, led numismatist ": null
    },
    {
        "Oliver D. Hoover": "oliver d. hoover"
    },
    {
        " to propose that Philip I simply re-coined his predecessors coins and skewed their dies. This resulted in currency bearing Philip Is image, reduced in weight from the standard  to . This yielded a profit of half an ": null
    },
    {
        "obol": "obol"
    },
    {
        " on each older coin which was re-struck. Profit was, however, not the main aim of Philip I; it is more probable that he wanted to pay his troops with coins bearing his own image instead of that of his rivals. The recoinage was also necessary since Philip Is coins were reduced in weight and the king needed to enforce the use of his currency by removing his rivals heavier coins out of circulation. Philip I may have adopted the New Seleucid era dating, which have the return of Antiochus VIII from his exile in ": null
    },
    {
        "Aspendos": "aspendos"
    },
    {
        " in 42 SE as a starting point; the traditional Seleucid era started in 42 SE .     Philip Is position on the throne was insecure: Cleopatra Selene hid in Syria with ": null
    },
    {
        "Antiochus XIII": "antiochus xiii asiaticus"
    },
    {
        ", her son by Antiochus X, waiting for an opportunity to regain the throne, while Antiochus XII replaced Demetrius III in Damascus, but there is no evidence that he sought to compete with his brother for Antioch. According to Josephus, Philip I took advantage of Antiochus XIIs absence in a campaign against ": null
    },
    {
        "Nabataea": "nabataean kingdom"
    },
    {
        " to seize Damascus. The governor of the city—Milesius, who opened the gates for the Philip I—was not given a suitable reward by his new master, leading him to wait until Philip I left the city; he then closed the gates, locking the king out until Antiochus XII returned. In the Seleucid dynasty, currency struck during campaigns against a rival showed the king with a beard. Antiochus XII was shown beardless for the first two years of his reign; in 42 SE , he appeared with a beard, possibly related to Philip Is attack on Damascus. But since Antiochus XII did not march north against his brother, the hypothesis about a connection between Antiochus XII beard and Philip Is attempt to take Damascus weakens; no coins of Philip I were struck in Damascus, indicating that his occupation of the city was brief.       After the attack on Damascus, Philip I disappeared from ancient literature. Without proof, 42 BC is commonly accepted as Philip Is year of death by most scholars; he could have been buried in the Nikatoreion Mausoleum, ": null
    },
    {
        "Seleucia Pieria": "seleucia pieria"
    },
    {
        ". Traditionally, Philip I is considered by most scholars to have been succeeded by ": null
    },
    {
        "Tigranes II": "tigranes the great"
    },
    {
        " of ": null
    },
    {
        "Armenia": "kingdom of armenia"
    },
    {
        ", who was invited by the people of Antioch despite the existence of Philip Is probably-minor son ": null
    },
    {
        "Philip II": "philip ii philoromaeus"
    },
    {
        ". The second century historian ": null
    },
    {
        "Appian": "appian"
    },
    {
        " assigned a fourteen-year reign to Tigranes II which ended in 42 BC, and most scholars accepted the ancient historians version, hence the date 42 BC. The fate of Philip I is a source of debate in academic circles, as no clues regarding how, where, and when, his life ended, exist. Many theories were presented by different historians:    Escaped to Cilicia: An inscription of Philip II was found in ": null
    },
    {
        "Olba": "olba"
    },
    {
        ", the capital of a Cilician priestly principality. Historian ": null
    },
    {
        "Auguste Bouché-Leclercq": "auguste bouché-leclercq"
    },
    {
        " concluded that Philip I could not have returned to the capital following his defeat in Damascus because the populace became weary of the endless Seleucid dynastic quarrels. Bouché-Leclercq conjectured, based on the inscription of his son, that Philip I might have escaped to Cilicia and died in the chaos caused by the ": null
    },
    {
        "Second Mithridatic War": "second mithridatic war"
    },
    {
        " between ": null
    },
    {
        "Mithridates VI of Pontus": "mithridates vi of pontus"
    },
    {
        " and ": null
    },
    {
        "Rome": "roman empire"
    },
    {
        ". Another possibility is that Philip I was preparing to take back his throne after the death of Antiochus XII , but was caught off guard by the arrival of Tigranes II and put to death in Cilicia. Historian Theodora Stillwell MacKay suggested that Philip I fled to Olba following his confrontation with Antiochus XII. The epigraphers ": null
    },
    {
        "Josef Keil": "josef keil"
    },
    {
        " and ": null
    },
    {
        "Adolf Wilhelm": "adolf wilhelm"
    },
    {
        " suggested that Philip I stayed with the priest-prince of the city. Peaceful long reign: according to Bellinger, the silence of ancient literature might be an indication of a peaceful reign that was perhaps facilitated by Philip Is alliance with Parthia; this would explain the massive amount of silver coinage produced by Philip I found as far as ": null
    },
    {
        "Dura-Europos": "dura-europos"
    },
    {
        ", which was under Parthian rule. Appians account is flawed, and contradicts contemporary accounts, notably the Roman statesman ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        ", who wrote in 42 BC that Cleopatra Selene sent Antiochus XIII to Rome to appeal for his right to the Egyptian throne; he did not have to appeal for his rights to Syria which, in the words of Cicero, he inherited from his ancestors. Cleopatra Selene and her son probably took advantage of Antiochus XIIs death in 42 BC to assume control of the south; the statement of Cicero indicates that in 42 BC, Tigranes II was still not in control of Syria, for if he were, Antiochus XIII would have asked the ": null
    },
    {
        "Roman Senate": "roman senate"
    },
    {
        " for support to regain Syria, since Tigranes II was the son-in-law of Romes enemy, Mithridates VI. Likewise, Philip I could not have been alive since Antiochus XIII went to Rome without having to assert his right to Syria.     :The argument for a later Armenian invasion is corroborated by Josephus, who wrote that the Jews heard about the Armenian invasion and Tigranes IIs plans to attack Judea only during the reign of the ": null
    },
    {
        "Hasmonean": "hasmonean dynasty"
    },
    {
        " queen ": null
    },
    {
        "Salome Alexandra": "salome alexandra"
    },
    {
        ", which began in 42 BC; it would be odd if Tigranes II took control of Syria in 42 BC and the Jews learned about it only after 42 BC. Another point of argument is the massive quantity of coinage left by Philip I, which could not have been produced if his reign was short and ended in 42 BC. In light of this, Hoover proposed 42 BC, or slightly earlier, as Philip Is last year; this would be in line with Ciceros statement about Antiochus XIII. Hoover suggested the year 42 BC as the date of Tigranes IIs invasion, giving Cleopatra Selene and her son time to claim the whole country.          Philip Is coins were still in circulation when the Romans annexed Syria in 42 BC. The first Roman coins struck in Syria were copies of Philip Is coins, and bore his image with the monogram of the Roman governor. The first issue was in 42 BC under governor ": null
    },
    {
        "Aulus Gabinius": "aulus gabinius"
    },
    {
        ", and the last series of Philip Is posthumous coins was minted in 42 BC. The Romans may have considered Philip I the last legitimate Seleucid king, a theory held by Kevin Butcher and other scholars. Hoover opted for a simpler answer; Philip Is coins were the most numerous and earlier Seleucid coin models were destroyed, making it economically sensible for the Romans to continue Philip Is model. Anomalous coins of Philip, differing from his standard lifetime models but similar to the later Roman Philip coins, indicate that they might have been minted by the autonomous city of Antioch between 42 and 42 BC before governor Aulus Gabinius issued his Philipean coins, making it viable for the Romans to continue minting coins already being struck.                                         Citations:     ": null
    }
]