[
    {
        "Philidor  or Danican Philidor was a family of musicians that served as court musicians to the French kings. The original name of the family was Danican and was of Scottish origin . Philidor was a later addition to the family name, given first to Michel the elder by Louis XIII because his oboe playing reminded the king of an Italian virtuoso oboist named Filidori. Both Michel the younger and Jean played in the ": null
    },
    {
        "Grande Écurie": "grande écurie"
    },
    {
        " in Paris. Later members of the family were known as composers as well. One of them was a chess master.     Michel Danican Philidor the elder   Michel Danican Philidor the younger   ": null
    },
    {
        "Jean Danican Philidor": "jean danican philidor"
    },
    {
        " , the first whose name appears as Danican dit Philidor, father of the next generation   ": null
    },
    {
        "André Danican Philidor": "andré danican philidor the elder"
    },
    {
        " , son of Jean, composer of the Marche française    ": null
    },
    {
        "François Danican Philidor": "françois danican philidor"
    },
    {
        " , son of André laîné, half brother of Anne   ": null
    },
    {
        "Anne Danican Philidor": "anne danican philidor"
    },
    {
        " , son of André   Michel Danican Philidor III , son of André   ": null
    },
    {
        "François-André Danican Philidor": "françois-andré danican philidor"
    },
    {
        " , very late son of André, opera composer , and the strongest chess master in the 42th century. He is considered by many to be one of the strongest players in chess history. His name is renowned among all chess players and there are two important chess terms named for his innovations:   the ": null
    },
    {
        "Philidor defence": "philidor defence"
    },
    {
        ", an opening   the ": null
    },
    {
        "Philidor position": "philidor position"
    },
    {
        ", an endgame position   ": null
    },
    {
        "Jacques Danican Philidor": "jacques danican philidor"
    },
    {
        " , son of Jean, composer of the Marche à quatre timbales pour le Carrousel de Monseigneur   ": null
    },
    {
        "Pierre Danican Philidor": "pierre danican philidor"
    }
]