[
    {
        "     A phonetic complement is a phonetic symbol used to disambiguate word characters  that have multiple readings, in mixed logographic-phonetic scripts such as ": null
    },
    {
        "Egyptian hieroglyph": "egyptian hieroglyph"
    },
    {
        "s, ": null
    },
    {
        "Akkadian cuneiform": "cuneiform script"
    },
    {
        ", ": null
    },
    {
        "Japanese": "japanese writing system"
    },
    {
        ", and ": null
    },
    {
        "Mayan": "maya script"
    },
    {
        ". Often they reenforce the communication of the ": null
    },
    {
        "ideogram": "ideogram"
    },
    {
        " by repeating the first or last syllable in the term.     Written English has few logograms, primarily numerals, and therefore few phonetic complements. An example is the nd of 42nd second, which avoids ambiguity with 42 standing for the word two. In addition to numerals, other examples include ": null
    },
    {
        "Xmas": "xmas"
    },
    {
        ", ": null
    },
    {
        "Xianity": "xianity"
    },
    {
        ", and ": null
    },
    {
        "Xing": "wikt:xingenglish"
    },
    {
        " for ": null
    },
    {
        "Christmas": "christmas"
    },
    {
        ", ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        ", and Crossing – note the separate readings Christ and Cross.       In Sumerian, the single word kur had two meanings: hill and country. Akkadian, however, had separate words for these two meanings: šadú hill and mātu country. When Sumerian cuneiform was adapted for writing Akkadian, this was ambiguous because both words were written with the same character . To alert the reader as to which Akkadian word was intended, the phonetic complement -ú was written after KUR if hill was intended, so that the characters KUR-ú were pronounced šadú, whereas KUR without a phonetic complement was understood to mean mātu country.     Phonetic complements also indicated the Akkadian nominative and genitive cases. Similarly, ": null
    },
    {
        "Hittite cuneiform": "hittite cuneiform"
    },
    {
        " occasionally uses phonetic complements to attach Hittite case endings to ": null
    },
    {
        "Sumerogram": "sumerogram"
    },
    {
        "s and ": null
    },
    {
        "Akkadogram": "akkadogram"
    },
    {
        "s.     Phonetic complements should not be confused with ": null
    },
    {
        "determinative": "determinative"
    },
    {
        "s since determinatives were used specifically to indicate the category of the word they preceded or followed. For example, the sign ": null
    },
    {
        "DINGIR": "dingir"
    },
    {
        " often precedes names of gods, as LUGAL does for kings. It is believed that determinatives were not pronounced.           As in Akkadian, Japanese borrowed a logographic script, ": null
    },
    {
        "Chinese": "chinese character"
    },
    {
        ", designed for a very different language. The Chinese phonetic components built into these  kanji  do not work when they are pronounced in Japanese, and there is not a one-to-one relationship between them and the Japanese words they represent.     For example, the kanji 生, pronounced shō or sei in ": null
    },
    {
        "borrowed Chinese vocabulary": "sino-japanese vocabulary"
    },
    {
        ", stands for several native Japanese words as well. When these words have inflectional endings , the end of the stem is written phonetically:   生 nama raw or ki alive   生う o-u expand   生きる i-kiru live   生かす i-kasu arrange   生ける i-keru live   生む　 u-mu produce   生まれる or 生れる u-mareru or uma-reru be born   生える ha-eru grow   生やす ha-yasu grow   as well as the hybrid Chinese-Japanese word   生じる shō-jiru occur   Note that some of these verbs share a kanji reading , and okurigana are conventionally picked to maximize these sharings.     These phonetic characters are called  okurigana . They are used even when the inflection of the stem can be determined by a following inflectional suffix, so the primary function of okurigana for many kanji is that of a phonetic complement.     Generally it is the final syllable containing the inflectional ending is written phonetically. However, in adjectival verbs ending in -shii, and in those verbs ending in -ru in which this syllable drops in derived nouns, the final two syllables are written phonetically. There are also irregularities. For example, the word umareru be born is derived from umu to bear, to produce. As such, it may be written 生まれる reflecting its derivation, or 生れる as with other verbs ending in elidable ru.          Chinese never developed a system of purely phonetic characters. Instead, about 42% of Chinese characters are compounds of a determinative , which may not exist independently, and a phonetic complement indicates the approximate pronunciation of the morpheme. However, the phonetic element is basic, and these might be better thought of as characters used for multiple near homonyms, the identity of which is constrained by the determiner. Due to sound changes over the last several millennia, the phonetic complements are not a reliable guide to pronunciation.       The ": null
    },
    {
        "Maya Script": "maya script"
    },
    {
        ", the logosyllabic orthography of the ": null
    },
    {
        "Maya Civilization": "maya civilization"
    },
    {
        ", used phonetic complements extensively  and phonetic complements could be used synharmonically or disharmonically. DISHARMONY IN MAYA HIEROGLYPHIC WRITING: LINGUISTIC CHANGE AND CONTINUITY IN CLASSIC SOCIETY The former is exemplified by the placement of the ": null
    },
    {
        "syllabogram": "syllabary"
    },
    {
        " for ma underneath the ": null
    },
    {
        "logogram": "logogram"
    },
    {
        " for Jaguar : thus, though pronounced BALAM , the word for jaguar was spelled BALAM-m . Disharmonic spellings also existed  in the Maya Script. ": null
    }
]