[
    {
        "                Physical therapy , also known as physiotherapy, is one of the ": null
    },
    {
        "allied health professions": "allied health professions"
    },
    {
        " that, by using ": null
    },
    {
        "evidence-based": "evidence-based practice"
    },
    {
        " kinesiology": "kinesiology"
    },
    {
        ", ": null
    },
    {
        "electrotherapy": "electrical muscle stimulation"
    },
    {
        ", ": null
    },
    {
        "shockwave modality": "extracorporeal shockwave therapy"
    },
    {
        ", ": null
    },
    {
        "exercise prescription": "exercise prescription"
    },
    {
        ", ": null
    },
    {
        "joint mobilization": "joint mobilization"
    },
    {
        " and ": null
    },
    {
        "health education": "health education"
    },
    {
        ", treats conditions such as chronic or acute ": null
    },
    {
        "pain": "pain"
    },
    {
        ", ": null
    },
    {
        "soft tissue injuries": "soft tissue injury"
    },
    {
        ", ": null
    },
    {
        "cartilage damage": "cartilage damage"
    },
    {
        ", ": null
    },
    {
        "arthritis": "arthritis"
    },
    {
        ", ": null
    },
    {
        "gait disorders": "gait abnormality"
    },
    {
        " and ": null
    },
    {
        "physical impairments": "physical disability"
    },
    {
        " typically of ": null
    },
    {
        "musculoskeletal": "musculoskeletal"
    },
    {
        ", ": null
    },
    {
        "cardiopulmonary": "cardiopulmonary"
    },
    {
        ", ": null
    },
    {
        "neurological": "neurological"
    },
    {
        " and ": null
    },
    {
        "endocrinological": "endocrinological"
    },
    {
        " origins. Physical therapy is used to improve a patients physical functions through ": null
    },
    {
        "physical examination": "physical examination"
    },
    {
        ", diagnosis, prognosis, physical intervention, rehabilitation and ": null
    },
    {
        "patient education": "patient education"
    },
    {
        ". It is practiced by physical therapists .     In addition to clinical practice, other activities encompassed in the physical therapy profession include research, education, consultation and administration. Physical therapy is provided as a ": null
    },
    {
        "primary care": "primary care"
    },
    {
        " treatment or alongside, or in conjunction with, other ": null
    },
    {
        "medical": "medicine"
    },
    {
        " services. In some jurisdictions, such as the United Kingdom, physical therapists have the power to prescribe medication.             Physical therapy attempts to address the illnesses, or injuries that limit a persons abilities to move and perform functional activities in their daily lives.  PTs use an individuals ": null
    },
    {
        "history": "medical history"
    },
    {
        " and ": null
    },
    {
        "physical examination": "physical examination"
    },
    {
        " to arrive at a ": null
    },
    {
        "diagnosis": "medical diagnosis"
    },
    {
        " and establish a management plan and, when necessary, incorporate the results of laboratory and imaging studies like X-rays, CT-scan, or MRI findings. Electrodiagnostic testing  may also be used.  PT management commonly includes prescription of or assistance with specific exercises, manual therapy and manipulation, mechanical devices such as traction, education, electrophysical modalities which include heat, cold, electricity, sound waves, radiation, assistive devices, prostheses, orthoses and other interventions. In addition, PTs work with individuals to prevent the loss of mobility before it occurs by developing fitness and wellness-oriented programs for healthier and more active lifestyles, providing services to individuals and populations to develop, maintain and restore maximum movement and functional ability throughout the lifespan. This includes providing therapeutic treatment in circumstances where movement and function are threatened by aging, injury, disease or environmental factors. Functional movement is central to what it means to be ": null
    },
    {
        "healthy": "healthy"
    },
    {
        ".   Physical therapy is a professional career which has many specialties including ": null
    },
    {
        "musculoskeletal": "musculoskeletal"
    },
    {
        ", ": null
    },
    {
        "orthopedics": "orthopedics"
    },
    {
        ", ": null
    },
    {
        "cardiopulmonary": "cardiopulmonary"
    },
    {
        ", ": null
    },
    {
        "neurology": "neurology"
    },
    {
        ", ": null
    },
    {
        "endocrinology": "endocrinology"
    },
    {
        ", ": null
    },
    {
        "sports medicine": "sports medicine"
    },
    {
        ", ": null
    },
    {
        "geriatrics": "geriatrics"
    },
    {
        ", ": null
    },
    {
        "pediatrics": "pediatrics"
    },
    {
        ", ": null
    },
    {
        "womens health": "womens health"
    },
    {
        ", ": null
    },
    {
        "wound care": "wound care"
    },
    {
        " and ": null
    },
    {
        "electromyography": "electromyography"
    },
    {
        ". ": null
    },
    {
        "Neurological rehabilitation": "neurological rehabilitation"
    },
    {
        " is in particular a rapidly emerging field. PTs practice in many settings, such as private-owned physical therapy clinics, ": null
    },
    {
        "outpatient clinics": "outpatient clinic"
    },
    {
        "or offices, health and wellness clinics, ": null
    },
    {
        "rehabilitation hospitals": "rehabilitation hospital"
    },
    {
        "facilities, skilled nursing facilities, extended care facilities, private homes, education and research centers, ": null
    },
    {
        "schools": "schools"
    },
    {
        ", ": null
    },
    {
        "hospices": "hospices"
    },
    {
        ", industrial and this workplaces or other occupational environments, ": null
    },
    {
        "fitness centers": "health club"
    },
    {
        " and ": null
    },
    {
        "sports training": "sports training"
    },
    {
        " facilities.      Physical therapists also practice in the non-patient care roles such as health policy,  Initiatives in Rehabilitation Research,  health insurance, health care administration and as health care executives. Physical therapists are involved in the medical-legal field serving as experts, performing peer review and ": null
    },
    {
        "independent medical examination": "independent medical examination"
    },
    {
        "s.     Education varies greatly by country. The span of education ranges from some countries having little formal education to others having doctoral degrees and post doctoral residencies and fellowships.               Physicians like ": null
    },
    {
        "Hippocrates": "hippocrates"
    },
    {
        " and later ": null
    },
    {
        "Galen": "galen"
    },
    {
        " are believed to have been the first practitioners of physical therapy, advocating ": null
    },
    {
        "massage": "massage"
    },
    {
        ", ": null
    },
    {
        "manual therapy": "manual therapy"
    },
    {
        " techniques and ": null
    },
    {
        "hydrotherapy": "hydrotherapy"
    },
    {
        " to treat people in 460  BC. Wharton M. A. Health Care Systems I, Slippery Rock University. 1991. After the development of ": null
    },
    {
        "orthopedics": "orthopedics"
    },
    {
        " in the eighteenth century, machines like the ": null
    },
    {
        "Gymnasticon": "gymnasticon"
    },
    {
        " were developed to treat ": null
    },
    {
        "gout": "gout"
    },
    {
        " and similar diseases by systematic exercise of the joints, similar to later developments in physical therapy.      The earliest documented origins of actual physical therapy as a professional group date back to ": null
    },
    {
        "Per Henrik Ling": "per henrik ling"
    },
    {
        ", Father of Swedish Gymnastics, who founded the Royal Central Institute of Gymnastics in 1813 for ": null
    },
    {
        "manipulation": "joint manipulation"
    },
    {
        ", and ": null
    },
    {
        "exercise": "exercise"
    },
    {
        ". The Swedish word for physical therapist is sjukgymnast someone involved in gymnastics for those who are ill. In 1887, PTs were given official registration by Swedens National Board of Health and Welfare.   Other countries soon followed. In 1894, four nurses in Great Britain formed the ": null
    },
    {
        "Chartered Society of Physiotherapy": "chartered society of physiotherapy"
    },
    {
        ".  The School of Physiotherapy at the University of Otago in New Zealand in 1913,  and the United States 1914 ": null
    },
    {
        "Reed College": "reed college"
    },
    {
        " in Portland, Oregon, which graduated reconstruction aides.  Since the professions inception, spinal manipulative therapy has been a component of the physical therapist practice.      Modern physical therapy was established towards the end of the 19th century due to events that had an effect on a global scale, which called for rapid advances in physical therapy. Soon following American orthopedic surgeons began treating children with disabilities and began employing women trained in physical education, and remedial exercise. These treatments were applied and promoted further during the Polio outbreak of 1916. During the First World War, women were recruited to work with and restore physical function to injured soldiers, and the field of physical therapy was institutionalized. In 1918 the term Reconstruction Aide was used to refer to individuals practicing physical therapy. The first school of physical therapy was established at Walter Reed Army Hospital in Washington, D.C., following the outbreak of World War I.  Research catalyzed the physical therapy movement. The first physical therapy research was published in the United States in March 1921 in The PT Review. In the same year, Mary McMillan organized the American Womens Physical Therapeutic Association ": null
    }
]