[
    {
        "         Physical geodesy is the study of the physical properties of the ": null
    },
    {
        "gravity": "gravity"
    },
    {
        " field of the Earth, the ": null
    },
    {
        "geopotential": "geopotential"
    },
    {
        ", with a view to their application in ": null
    },
    {
        "geodesy": "geodesy"
    },
    {
        ".       Traditional geodetic instruments such as ": null
    },
    {
        "theodolite": "theodolite"
    },
    {
        "s rely on the gravity field for orienting their vertical axis along the local ": null
    },
    {
        "plumb line": "plumb line"
    },
    {
        " or local ": null
    },
    {
        "vertical direction": "vertical direction"
    },
    {
        " with the aid of a ": null
    },
    {
        "spirit level": "spirit level"
    },
    {
        ". After that, vertical ": null
    },
    {
        "angle": "angle"
    },
    {
        "s  are obtained with respect to this local vertical, and horizontal angles in the plane of the local horizon, perpendicular to the vertical.     ": null
    },
    {
        "Levelling": "levelling"
    },
    {
        " instruments again are used to obtain ": null
    },
    {
        "geopotential": "geopotential"
    },
    {
        " differences between points on the Earths surface. These can then be expressed as height differences by conversion to metric units.               The Earths gravity field can be described by a ": null
    },
    {
        "potential": "potential"
    },
    {
        " as follows:     :   \\mathbf \\nabla W \\mathrm\\ W \\frac\\mathbf   +\\frac\\mathbf+\\frac\\mathbf       which expresses the gravity acceleration vector as the gradient of W , the potential of gravity. The vector triad \\ is the orthonormal set of base vectors in space, pointing along the X,Y,Z coordinate axes.     Note that both gravity and its potential contain a contribution from the ": null
    },
    {
        "centrifugal pseudo-force": "centrifugal force"
    },
    {
        " due to the Earths rotation. We can write     :   W V + \\Phi\\,       where V is the potential of the gravitational field, W that of the gravity field, and \\Phi that of the centrifugal force field.     The centrifugal force -- per unit of mass, i.e., acceleration -- is given by     :   \\mathbf_c \\omega^42 \\mathbf,       where     :   \\mathbf X\\mathbf+Y\\mathbf42\\cdot\\mathbf       is the vector pointing to the point considered straight from the Earths rotational axis.   It can be shown that this pseudo-force field, in a reference frame co-rotating with the Earth, has a potential associated with it that looks like this:     :   \\Phi \\frac \\omega^42 .       This can be verified by taking the gradient operator of this expression.     Here, X , Y and Z are ": null
    },
    {
        "geocentric coordinates": "geocentric coordinates"
    },
    {
        ".         Gravity is commonly measured in units of m·s −42 . This also can be expressed  as ": null
    },
    {
        "newton": "newton"
    },
    {
        "s per ": null
    },
    {
        "kilogram": "kilogram"
    },
    {
        " of attracted mass.     Potential is expressed as gravity times distance, m 42 ·s −42 . Travelling one metre in the direction of a gravity vector of strength 42 m·s −42 will increase your potential by 42 m 42 ·s −42 . Again employing G as a multiplier, the units can be changed to ": null
    },
    {
        "joule": "joule"
    },
    {
        "s per kilogram of attracted mass.     A more convenient unit is the GPU, or geopotential unit: it equals 42 m 42 ·s −42 . This means that travelling one metre in the vertical direction, i.e., the direction of the 42 m·s −42 ambient gravity, will approximately change your potential by 42 GPU. Which again means that the difference in geopotential, in GPU, of a point with that of sea level can be used as a rough measure of height above sea level in metres.         To a rough approximation, the Earth is a ": null
    },
    {
        "sphere": "sphere"
    },
    {
        ", or to a much better approximation, an ": null
    },
    {
        "ellipsoid": "ellipsoid"
    },
    {
        ". We can similarly approximate the gravity field of the Earth by a spherically symmetric field:     :   W \\approx \\frac       of which the equipotential surfaces—the surfaces of constant potential value—are concentric spheres.     It is more accurate to approximate the geopotential by a field that has the Earth reference ellipsoid as one of its equipotential surfaces, however. The most recent Earth reference ellipsoid is ": null
    },
    {
        "GRS42": "grs80"
    },
    {
        ", or Geodetic Reference System 42 which the Global Positioning system uses as its reference. Its geometric parameters are: semi-major axis a   42  m, and flattening f   42/42.     A geopotential field U is constructed, being the sum of a gravitational potential \\Psi and the known centrifugal potential \\Phi , that has the GRS42 reference ellipsoid as one of its equipotential surfaces. If we also require that the enclosed mass is equal to the known mass of the Earth GM 42 & times; 42 42 m 42 ·s −42 , we obtain for the potential at the reference ellipsoid:     :   U_42 \\ \\textrm m^42 \\, \\textrm s^       Obviously, this value depends on the assumption that the potential goes asymptotically to zero at infinity , as is common in physics. For practical purposes it makes more sense to choose the zero point of ": null
    },
    {
        "normal gravity": "normal gravity"
    },
    {
        " to be that of the ": null
    },
    {
        "reference ellipsoid": "reference ellipsoid"
    },
    {
        ", and refer the potentials of other points to this.         Once a clean, smooth geopotential field U has been constructed matching the known GRS42 reference ellipsoid with an equipotential surface  we can subtract it from the true potential W of the real Earth. The result is defined as T, the disturbing potential:     :   T W-U       The disturbing potential T is numerically a great deal smaller than U or W, and captures the detailed, complex variations of the true gravity field of the actually existing Earth from point-to-point, as distinguished from the overall global trend captured by the smooth mathematical ellipsoid of the normal potential.     Due to the irregularity of the Earths true gravity field, the equilibrium figure of sea water, or the ": null
    },
    {
        "geoid": "geoid"
    },
    {
        ", will also be of irregular form. In some places, like west of ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ", the geoid—mathematical mean sea level—sticks out as much as 42 m above the regular, rotationally symmetric reference ellipsoid of GRS42; in other places, like close to ": null
    },
    {
        "Ceylon": "ceylon"
    },
    {
        ", it dives under the ellipsoid by nearly the same amount. The separation between these two surfaces is called the ": null
    },
    {
        "undulation of the geoid": "undulation of the geoid"
    },
    {
        ", symbol N , and is closely related to the disturbing potential.     According to the famous ": null
    },
    {
        "Bruns": "heinrich bruns"
    },
    {
        " formula, we have     :   NT/\\gamma\\,,       where \\gamma is the force of gravity computed from the normal field potential U .     In 42 the mathematician ": null
    },
    {
        "George Gabriel Stokes": "george gabriel stokes"
    },
    {
        " published the following formula named after him:     :   N\\frac\\iint_\\sigma \\Delta g \\,S\\, d\\sigma.       In this formula, \\Delta g stands for gravity anomalies, differences between true and normal gravity, and S is the Stokes function, a kernel function derived by Stokes in closed analytical form.     Note that determining N anywhere on Earth by this formula requires \\Delta g to be known everywhere on Earth, including oceans, polar areas, and deserts. For terrestrial gravimetric measurements this is a near-impossibility, in spite of close international co-operation within the ": null
    },
    {
        "International Association of Geodesy": "international association of geodesy"
    },
    {
        " , e.g., through the International Gravity Bureau .     Another approach is to combine multiple information sources: not just terrestrial gravimetry, but also satellite geodetic data on the figure of the Earth, from analysis of satellite orbital perturbations, and lately from satellite gravity missions such as ": null
    },
    {
        "GOCE": "goce"
    },
    {
        " and ": null
    },
    {
        "GRACE": "gravity_recovery_and_climate_experiment"
    },
    {
        ". In such combination solutions, the low-resolution part of the geoid solution is provided by the satellite data, while a tuned version of the above Stokes equation is used to calculate the high-resolution part, from terrestrial gravimetric data from a neighbourhood of the evaluation point only.     The ": null
    },
    {
        "geoid": "geoid"
    },
    {
        ", or mathematical mean sea surface, is defined not only on the seas, but also under land; it is the equilibrium water surface that would result, would sea water be allowed to move freely under the land. Technically, an equipotential surface of the true geopotential, chosen to coincide with mean sea level.     As mean sea level is physically realized by tide gauge bench marks on the coasts of different countries and continents, a number of slightly incompatible near-geoids will result, with differences of several decimetres to over one metre between them, due to the ": null
    },
    {
        "dynamic sea surface topography": "dynamic sea surface topography"
    },
    {
        ". These are referred to as vertical or height datum s.     For every point on Earth, the local direction of gravity or ": null
    },
    {
        "vertical direction": "vertical direction"
    },
    {
        ", materialized with the ": null
    },
    {
        "plumb line": "plumb line"
    },
    {
        ", is perpendicular to the geoid. On this is based a method, astrogeodetic levelling , for deriving the local figure of the geoid by measuring  deflections of the vertical  by astronomical means over an area.               Above we already made use of gravity anomalies \\Delta g . These are computed as the differences between true gravity g\\|\\vec\\| , and calculated gravity \\gamma\\|\\vec\\|\\|\\nabla U\\| .  We thus get     :   \\Delta g g - \\gamma.\\,       These anomalies are called ": null
    },
    {
        "free-air anomalies": "free-air anomaly"
    },
    {
        ", and are the ones to be used in the above Stokes equation.     In ": null
    },
    {
        "geophysics": "geophysics"
    },
    {
        ", these anomalies are often further reduced by removing from them the attraction of the topography, which for a flat, horizontal plate  of thickness H is given by     :   a_B42\\pi G\\rho H,\\,       The ": null
    },
    {
        "Bouguer reduction": "bouguer reduction"
    },
    {
        " to be applied as follows:     :   \\Delta g_B \\Delta g_ - a_B,\\,       so-called ": null
    },
    {
        "Bouguer anomalies": "bouguer anomaly"
    },
    {
        ". Here, \\Delta g_ is our earlier \\Delta g , the free-air anomaly.     In case the terrain is not a flat plate we use for H the local terrain height value but apply a further correction called the ": null
    },
    {
        "terrain correction": "terrain correction"
    },
    {
        " ": null
    }
]