[
    {
        "     A physical constant, sometimes fundamental physical constant or universal constant, is a ": null
    },
    {
        "physical quantity": "physical quantity"
    },
    {
        " that is generally believed to be both universal in nature and have ": null
    },
    {
        "constant": "constant"
    },
    {
        " value in time. It is contrasted with a ": null
    },
    {
        "mathematical constant": "mathematical constant"
    },
    {
        ", which has a fixed numerical value, but does not directly involve any physical measurement.     There are many physical constants in science, some of the most widely recognized being the ": null
    },
    {
        "speed of light": "speed of light"
    },
    {
        " in vacuum c, the ": null
    },
    {
        "gravitational constant": "gravitational constant"
    },
    {
        " G, the ": null
    },
    {
        "Planck constant": "planck constant"
    },
    {
        " h, the ": null
    },
    {
        "electric constant": "electric constant"
    },
    {
        " ε 0 , and the ": null
    },
    {
        "elementary charge": "elementary charge"
    },
    {
        " e. Physical constants can take many ": null
    },
    {
        "dimensional": "dimensional analysis"
    },
    {
        " forms: the speed of light signifies a maximum ": null
    },
    {
        "speed": "speed"
    },
    {
        " for any object and its ": null
    },
    {
        "dimension": "dimensional analysis"
    },
    {
        " is ": null
    },
    {
        "length": "length"
    },
    {
        " divided by ": null
    },
    {
        "time": "time"
    },
    {
        "; while the ": null
    },
    {
        "fine-structure constant": "fine-structure constant"
    },
    {
        " α, which characterizes the strength of the ": null
    },
    {
        "electromagnetic interaction": "electromagnetic interaction"
    },
    {
        ", is ": null
    },
    {
        "dimensionless": "dimensionless"
    },
    {
        ".     The term fundamental physical constant is sometimes used to refer to universal but dimensioned physical constants such as those mentioned above.  NIST Increasingly, however, physicists reserve the use of the term fundamental physical constant for ": null
    },
    {
        "dimensionless physical constant": "dimensionless physical constant"
    },
    {
        "s, such as the fine-structure constant α.     Physical constant in the sense under discussion in this article should not be confused with other quantities called constants that are assumed to be constant in a given context without the implication that they are fundamental, such as the ": null
    },
    {
        "time constant": "time constant"
    },
    {
        " characteristic of a given system, or ": null
    },
    {
        "material constants": "list of materials properties"
    },
    {
        ", such as the ": null
    },
    {
        "Madelung constant": "madelung constant"
    },
    {
        ", ": null
    },
    {
        "electrical resistivity": "electrical resistivity and conductivity"
    },
    {
        ", and ": null
    },
    {
        "heat capacity": "heat capacity"
    },
    {
        ".     The ": null
    },
    {
        "International Bureau of Weights and Measures": "international bureau of weights and measures"
    },
    {
        " decided to ": null
    },
    {
        "redefine several SI base units as from 20 May 2019": "2019 redefinition of si base units"
    },
    {
        " by fixing the SI value of several physical constants, including the Planck constant, h, the elementary charge, e, the ": null
    },
    {
        "Boltzmann constant": "boltzmann constant"
    },
    {
        ", k B , and the ": null
    },
    {
        "Avogadro constant": "avogadro constant"
    },
    {
        ", N A . The new fixed values are based on the best measurements of the constants based on the earlier definitions, including the ": null
    },
    {
        "kilogram": "kilogram"
    },
    {
        ", to ensure minimal impact. As a consequence of the redefinition, the uncertainty in the value of many physical constants when expressed in SI units are substantially reduced.       Whereas the ": null
    },
    {
        "physical quantity": "physical quantity"
    },
    {
        " indicated by a physical constant does not depend on the unit system used to express the quantity, the numerical values of dimensional physical constants do depend on choice of unit system.   The term physical constant refers to the physical quantity, and not to the numerical value within any given system of units. For example, the ": null
    },
    {
        "speed of light": "speed of light"
    },
    {
        " is defined as having the numerical value of  when expressed in the ": null
    },
    {
        "SI unit": "si unit"
    },
    {
        " metres per second, and as having the numerical value of 1 when expressed in the ": null
    },
    {
        "natural units": "natural units"
    },
    {
        " Planck length per Planck time. While its numerical value can be defined at will by the choice of units, the speed of light itself is a single physical constant.     Any ": null
    },
    {
        "ratio": "ratio"
    },
    {
        " between physical constants of the same dimensions results in a ": null
    },
    {
        "dimensionless physical constant": "dimensionless physical constant"
    },
    {
        ", for example, the ": null
    },
    {
        "proton-to-electron mass ratio": "proton-to-electron mass ratio"
    },
    {
        ". Any relation between physical quantities can be expressed as a relation between dimensionless ratios via a process known as ": null
    },
    {
        "nondimensionalisation": "nondimensionalisation"
    },
    {
        ".     The term of fundamental physical constant is reserved for physical quantities which, according to the current state of knowledge, are regarded as immutable and as non-derivable from more fundamental principles. Notable examples are the speed of light c, and the ": null
    },
    {
        "gravitational constant": "gravitational constant"
    },
    {
        " G.     The ": null
    },
    {
        "fine-structure constant": "fine-structure constant"
    },
    {
        " α is the best known dimensionless fundamental physical constant. It is the value of the ": null
    },
    {
        "elementary charge": "elementary charge"
    },
    {
        " squared expressed in ": null
    },
    {
        "Planck units": "planck units"
    },
    {
        ". This value has become a standard example when discussing the derivability or non-derivability of physical constants. Introduced by ": null
    },
    {
        "Arnold Sommerfeld": "arnold sommerfeld"
    },
    {
        ", its value as determined at the time was consistent with 1/137. This motivated ": null
    },
    {
        "Arthur Eddington": "arthur eddington"
    },
    {
        " to construct an argument why its value might be 1/137 precisely, which related to the ": null
    },
    {
        "Eddington number": "eddington number"
    },
    {
        ", his estimate of the number of protons in the Universe.    By the 1940s, it became clear that the value of the fine-structure constant deviates significantly from the precise value of 1/137, refuting Eddingtons argument.        With the development of ": null
    },
    {
        "quantum chemistry": "quantum chemistry"
    },
    {
        " in the 20th century, however, a vast number of previously inexplicable dimensionless physical constants were successfully computed from theory. In light of that, some theoretical physicists still hope for continued progress in explaining the values of other dimensionless physical constants.     It is known that ": null
    },
    {
        "the Universe would be very different": "fine-tuned universe"
    },
    {
        " if these constants took values significantly different from those we observe. For example, a few percent change in the value of the fine structure constant would be enough to eliminate stars like our Sun. This has prompted attempts at ": null
    },
    {
        "anthropic": "anthropic principle"
    },
    {
        " explanations of the values of some of the dimensionless fundamental physical constants.          Using ": null
    },
    {
        "dimensional analysis": "dimensional analysis"
    },
    {
        ", it is possible to combine dimensional universal physical constants to define a system of ": null
    },
    {
        "units of measurement": "units of measurement"
    },
    {
        " that has no reference to any human construct. Depending on the choice and arrangement of constants used, the resulting natural units may have useful physical meaning. For example, ": null
    },
    {
        "Planck units": "planck units"
    },
    {
        ", shown in the table below, use ": null
    },
    {
        "c": "speed of light"
    },
    {
        ", ": null
    },
    {
        "G": "gravitational constant"
    },
    {
        ", ": null
    },
    {
        "ħ": "planck constant"
    },
    {
        ", ": null
    },
    {
        "ε 0 ": "electric constant"
    },
    {
        ", and ": null
    },
    {
        "k B ": "boltzmann constant"
    },
    {
        " in such a manner to derive units relevant to unified theories such as ": null
    },
    {
        "quantum gravity": "quantum gravity"
    },
    {
        ".   :       The number of fundamental physical constants depends on the ": null
    },
    {
        "physical theory": "physical theory"
    },
    {
        " accepted as fundamental .   Currently, this is the theory of ": null
    },
    {
        "general relativity": "general relativity"
    },
    {
        " for gravitation and the ": null
    },
    {
        "Standard Model": "standard model"
    },
    {
        " for electromagnetic, weak and strong nuclear interactions and the matter fields.   Between them, these theories account for a total of 19 independent fundamental constants.   There is, however, no single correct way of enumerating them, as it is a matter of arbitrary choice which quantities are considered fundamental and which as derived . Uzan lists 22 unknown constants in the fundamental theories, which give rise to 19 unknown dimensionless parameters , as follows:   the ": null
    },
    {
        "gravitational constant": "gravitational constant"
    },
    {
        " G,   the ": null
    },
    {
        "speed of light": "speed of light"
    },
    {
        " c,   the ": null
    },
    {
        "Planck constant": "planck constant"
    },
    {
        " h,   the 9 ": null
    },
    {
        "Yukawa couplings": "yukawa couplings"
    },
    {
        " for the quarks and leptons ,   2 parameters of the ": null
    },
    {
        "Higgs field": "higgs field"
    },
    {
        " potential,   4 parameters for the ": null
    },
    {
        "quark mixing matrix": "cabibbo–kobayashi–maskawa matrix"
    },
    {
        ",   3 coupling constants for the ": null
    },
    {
        "gauge groups": "gauge group"
    },
    {
        " SU × SU × U": "standard model"
    },
    {
        " ,   a phase for the ": null
    },
    {
        "QCD vacuum": "qcd vacuum"
    },
    {
        ".   The number of 19 independent fundamental physical constants is subject to change under possible ": null
    },
    {
        "extensions of the Standard Model": "physics beyond the standard model"
    },
    {
        ", notably by the introduction of ": null
    },
    {
        "neutrino mass": "neutrino mass"
    },
    {
        " .      The discovery of variability in any of these constants would be equivalent to the discovery of ": null
    },
    {
        "new physics": "new physics"
    },
    {
        " .      The question as to which constants are fundamental is neither straightforward nor meaningless, but a question of interpretation of the physical theory regarded as fundamental; as pointed out by , not all physical constants are of the same importance, with some having a deeper role than others.    proposed a classification schemes of three types of fundamental constant:   A: characteristic of a particular system   B: characteristic of a class of physical phenomena   C: universal constants   The same physical constant may move from one category to another as the understanding of its role deepens; this has notably happened to the ": null
    },
    {
        "speed of light": "speed of light"
    },
    {
        ", which was a class A constant  when it was first measured, but became a class B constant  with the development of ": null
    },
    {
        "classical electromagnetism": "classical electromagnetism"
    },
    {
        ", and finally a class C constant with the discovery of ": null
    },
    {
        "special relativity": "special relativity"
    },
    {
        ".           By definition, fundamental physical constants are subject to ": null
    },
    {
        "measurement": "measurement"
    },
    {
        ", so that their being constant is necessarily an experimental result and subject to verification.     ": null
    },
    {
        "Paul Dirac": "paul dirac"
    },
    {
        " in 1937 speculated that physical constants such as the ": null
    },
    {
        "gravitational constant": "gravitational constant"
    },
    {
        " or the ": null
    },
    {
        "fine-structure constant": "fine-structure constant"
    },
    {
        " might be subject to change over time in proportion of the ": null
    },
    {
        "age of the universe": "age of the universe"
    },
    {
        ". Experiments can in principle only put an upper bound on the relative change per year. For the fine-structure constant, this upper bound is comparatively low, at   roughly 10 −17 per year .        The gravitational constant is much more difficult to measure with precision, and conflicting measurements in the 2000s have inspired the controversial suggestions of a periodic variation of its value in a 2015 paper.  However, while its value is not known to great precision, the possibility of observing ": null
    },
    {
        "type Ia supernovae": "type ia supernovae"
    },
    {
        " which happened in the universes remote past, paired with the assumption that the physics involved in these events is universal, allows for an upper bound of less than 10 −10 per year for the gravitational constant over the last nine billion years.      Similarly, an upper bound of the change in the ": null
    },
    {
        "proton-to-electron mass ratio": "proton-to-electron mass ratio"
    },
    {
        " has been placed at 10 −7 over a period of 7 billion years in a 2012 study based on the observation of ": null
    },
    {
        "methanol": "methanol"
    },
    {
        " in a distant galaxy.       It is problematic to discuss the proposed rate of change of a single dimensional physical constant in isolation. The reason for this is that the choice of units is arbitrary, making the question of whether a constant is undergoing change an artefact of the choice of the units.        For example, in ": null
    },
    {
        "SI units": "si units"
    },
    {
        ", the speed of light was given a defined value in 1983. Thus, it was meaningful to experimentally measure the speed of light in SI units prior to 1983, but it is not so now. Similarly, with effect from May 2019, the Planck constant has a defined value, such that all ": null
    },
    {
        "SI base units": "si base units"
    },
    {
        " are now defined in terms of fundamental physical constants. With this change, the International Prototype Kilogram is being retired as the last physical object used in the definition of any SI unit.     Tests on the immutability of physical constants look at dimensionless quantities, i.e. ratios between quantities of like dimensions, in order to escape this problem. Changes in physical constants are not meaningful if they result in an observationally indistinguishable universe. For example, a ": null
    },
    {
        " change in the speed of light": "variable speed of light"
    },
    {
        " c would be meaningless if accompanied by a corresponding change in the elementary charge e so that the ratio  remained unchanged.    important lesson we learn from the way that pure numbers like α define the World is what it really means for worlds to be different. The pure number we call the fine structure constant and denote by α is a combination of the electron charge, e, the speed of light, c, and Plancks constant, h. At first we might be tempted to think that a world in which the speed of light was slower would be a different world. But this would be a mistake. If c, h, and e were all changed so that the values they have in metric units were different when we looked them up in our tables of physical constants, but the value of α remained the same, this new world would be observationally indistinguishable from our World. The only thing that counts in the definition of worlds are the values of the dimensionless constants of Nature. If all masses were doubled in value you cannot tell, because all the pure numbers defined by the ratios of any pair of masses are unchanged.          Some physicists have explored the notion that if the ": null
    },
    {
        "dimensionless physical constants": "dimensionless physical constant"
    },
    {
        "had sufficiently different values, our Universe would be so radically different that intelligent life would probably not have emerged, and that our Universe therefore seems to be ": null
    },
    {
        "fine-tuned": "fine-tuned universe"
    },
    {
        " for intelligent life. The anthropic principle states a logical ": null
    },
    {
        "truism": "truism"
    },
    {
        ": the fact of our existence as intelligent beings who can measure physical constants requires those constants to be such that beings like us can exist. There are a variety of interpretations of the constants values, including that of a ": null
    },
    {
        "divine creator": "intelligent design"
    },
    {
        " , or that ours is one universe of many in a ": null
    },
    {
        "multiverse": "multiverse"
    },
    {
        " , or even that, ": null
    },
    {
        "if information is an innate property of the universe": "it from bit"
    },
    {
        " and logically inseparable from consciousness, a universe without the capacity for conscious beings cannot exist.            The table below lists some frequently used constants and their CODATA recommended values. For a more extended list, refer to  List of physical constants .     ": null
    }
]