[
    {
        "                The Picts were a confederation of ": null
    },
    {
        "Celtic language": "pictish language"
    },
    {
        "-speaking peoples who lived in what is today eastern and northern ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        " during the Late ": null
    },
    {
        "British Iron Age": "british iron age"
    },
    {
        " and ": null
    },
    {
        "Early Medieval": "scotland in the early middle ages"
    },
    {
        " periods. Where they lived and what their culture was like can be inferred from early medieval texts and ": null
    },
    {
        "Pictish stones": "pictish stones"
    },
    {
        ". Their Latin name, Picti, appears in written records from ": null
    },
    {
        "Late Antiquity": "late antiquity"
    },
    {
        " to the 10th century. They lived to the north of the rivers ": null
    },
    {
        "Forth": "river forth"
    },
    {
        " and ": null
    },
    {
        "Clyde": "river clyde"
    },
    {
        ". Early medieval sources report the existence of a distinct ": null
    },
    {
        "Pictish language": "pictish language"
    },
    {
        ", which today is believed to have been an ": null
    },
    {
        "Insular Celtic language": "insular celtic language"
    },
    {
        ", closely related to the ": null
    },
    {
        "Brittonic": "common brittonic"
    },
    {
        " spoken by the ": null
    },
    {
        "Britons": "britons"
    },
    {
        " who lived to the south.     Picts are assumed to have been the descendants of the ": null
    },
    {
        "Caledonii": "caledonians"
    },
    {
        " and other Iron Age tribes that were mentioned by Roman historians or on the ": null
    },
    {
        "world map": "ptolemys world map"
    },
    {
        " of ": null
    },
    {
        "Ptolemy": "ptolemy"
    },
    {
        ". Pictland, also called Pictavia by some sources, achieved a large degree of political unity in the late 7th and early 8th centuries through the expanding kingdom of ": null
    },
    {
        "Fortriu": "fortriu"
    },
    {
        ", the Iron Age Verturiones. By 900, the resulting Pictish over-kingdom had merged with the ": null
    },
    {
        "Gaelic": "gaels"
    },
    {
        " kingdom of ": null
    },
    {
        "Dál Riata": "dál riata"
    },
    {
        " to form the ": null
    },
    {
        "Kingdom of Alba": "kingdom of alba"
    },
    {
        " ; and by the 13th century Alba had expanded to include the formerly Brittonic ": null
    },
    {
        "kingdom of Strathclyde": "kingdom of strathclyde"
    },
    {
        ", ": null
    },
    {
        "Northumbrian": "kingdom of northumbria"
    },
    {
        " Lothian": "lothian"
    },
    {
        ", ": null
    },
    {
        "Galloway": "galloway"
    },
    {
        " and the ": null
    },
    {
        "Western Isles": "western isles"
    },
    {
        ".     Pictish society was typical of many Iron Age societies in northern Europe, having wide connections and parallels with neighbouring groups.  Archaeology gives some impression of the society of the Picts. While very little in the way of Pictish writing has survived, Pictish history since the late 6th century is known from a variety of sources, including ": null
    },
    {
        "Bedes": "bede"
    },
    {
        "  Historia ecclesiastica gentis Anglorum , ": null
    },
    {
        "saints lives": "hagiography"
    },
    {
        " such as that of ": null
    },
    {
        "Columba": "columba"
    },
    {
        " by ": null
    },
    {
        "Adomnán": "adomnán"
    },
    {
        ", and various ": null
    },
    {
        "Irish annals": "irish annals"
    },
    {
        ".       The term Pict is thought to have originated as a generic ": null
    },
    {
        "exonym": "exonym and endonym"
    },
    {
        " used by the Romans in relation to people living north of the ": null
    },
    {
        "Forth": "river forth"
    },
    {
        "–": null
    },
    {
        "Clyde": "river clyde"
    },
    {
        " isthmus.  The ": null
    },
    {
        "Latin": "latin"
    },
    {
        " word Picti first occurs in a ": null
    },
    {
        "panegyric": "panegyric"
    },
    {
        " written by ": null
    },
    {
        "Eumenius": "eumenius"
    },
    {
        " in AD  297 and is taken to mean painted or ": null
    },
    {
        "tattoo": "tattoo"
    },
    {
        "ed people  .     Pict is Pettr in ": null
    },
    {
        "Old Norse": "old norse"
    },
    {
        ", Peohta in ": null
    },
    {
        "Old English": "old english language"
    },
    {
        ", Pecht in ": null
    },
    {
        "Scots": "scots language"
    },
    {
        " and Peithwyr in Welsh. Some think these words suggest an original ": null
    },
    {
        "Pictish": "pictish language"
    },
    {
        " root, instead of a Latin coinage.   In writings from ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ", the name  Cruthin , Cruthini, Cruthni, Cruithni or Cruithini  was used to refer both to the Picts and to another group of people who lived alongside the ": null
    },
    {
        "Ulaid": "ulaid"
    },
    {
        " in eastern ": null
    },
    {
        "Ulster": "ulster"
    },
    {
        ".  It is generally accepted that this is derived from Qritani, which is the ": null
    },
    {
        "Goidelic": "goidelic languages"
    },
    {
        "/Q-Celtic version of the ": null
    },
    {
        "Britonnic": "brythonic languages"
    },
    {
        "/": null
    },
    {
        "P-Celtic": "p-celtic"
    },
    {
        " Pritani.  From this came Britanni, the ": null
    },
    {
        "Roman": "roman empire"
    },
    {
        " name for those now called the ": null
    },
    {
        "Britons": "britons"
    },
    {
        ". ;      What the Picts called themselves is unknown. It has been proposed that they called themselves Albidosi, a name found in the ": null
    },
    {
        "Chronicle of the Kings of Alba": "chronicle of the kings of alba"
    },
    {
        " during the reign of ": null
    },
    {
        "Máel Coluim mac Domnaill": "máel coluim mac domnaill"
    },
    {
        ", but this idea has been disputed. , note 95;  A unified Pictish identity may have consolidated with the ": null
    },
    {
        "Verturian": "fortriu"
    },
    {
        " hegemony established following the ": null
    },
    {
        "Battle of Dun Nechtain": "battle of dun nechtain"
    },
    {
        " in 685 AD. ,           A Pictish confederation was formed in ": null
    },
    {
        "Late Antiquity": "late antiquity"
    },
    {
        " from a number of tribes—how and why is not known. Some scholars have speculated that it was partly in response to the growth of the Roman Empire. See the discussion of the creation of the Frankish Confederacy in  The ": null
    },
    {
        "Pictish Chronicle": "pictish chronicle"
    },
    {
        ", the ": null
    },
    {
        "Anglo-Saxon Chronicle": "anglo-saxon chronicle"
    },
    {
        " and the early histographers such as ": null
    },
    {
        "Bede": "bede"
    },
    {
        ", ": null
    },
    {
        "Geoffrey of Monmouth": "geoffrey of monmouth"
    },
    {
        ", ": null
    },
    {
        "Holinshed": "holinshed"
    },
    {
        ", etc. all present the Picts as conquerors of Alba from ": null
    },
    {
        "Scythia": "scythia"
    },
    {
        ". However, no credence is now given to that view. ; ; ;      Pictland had previously been described by Roman writers and geographers as the home of the  Caledonii . e.g. by ": null
    },
    {
        "Tacitus": "tacitus"
    },
    {
        ", ": null
    },
    {
        "Ptolemy": "ptolemy"
    },
    {
        ", and as the Dicalydonii by ": null
    },
    {
        "Ammianus Marcellinus": "ammianus marcellinus"
    },
    {
        ". Ptolemy called the sea to the west of Scotland the Oceanus Duecaledonius. These Romans also used other names to refer to tribes living in that area, including  Verturiones ,  Taexali  and  Venicones . e.g. Ptolemy, Ammianus Marcellinus. But they may have heard these other names only second- or third-hand, from speakers of Brittonic or Gaulish languages, who may have used different names for the same group or groups. Caledonii is attested from a grave marker in Roman Britain.     Pictish recorded history begins in the ": null
    },
    {
        "Early Middle Ages": "early middle ages"
    },
    {
        ". At that time, the ": null
    },
    {
        "Gaels": "gael"
    },
    {
        "of ": null
    },
    {
        "Dál Riata": "dál riata"
    },
    {
        " controlled what is now ": null
    },
    {
        "Argyll": "argyll"
    },
    {
        ", as part of a kingdom straddling the sea between Britain and Ireland. The ": null
    },
    {
        "Angles": "angles"
    },
    {
        " of ": null
    },
    {
        "Bernicia": "bernicia"
    },
    {
        ", which merged with ": null
    },
    {
        "Deira": "deira"
    },
    {
        " to form ": null
    },
    {
        "Northumbria": "northumbria"
    },
    {
        ", overwhelmed the adjacent British kingdoms, and for much of the 7th century Northumbria was the most powerful kingdom in Britain. See e.g.  The Picts were probably tributary to Northumbria until the reign of ": null
    },
    {
        "Bridei mac Beli": "bridei iii of the picts"
    },
    {
        ", when, in 685, the Anglians suffered a defeat at the ": null
    },
    {
        "Battle of Dun Nechtain": "battle of dun nechtain"
    },
    {
        " that halted their northward expansion. The Northumbrians continued to dominate southern Scotland for the remainder of the Pictish period.        Dál Riata was subject to the Pictish king ": null
    },
    {
        "Óengus mac Fergusa": "óengus i of the picts"
    },
    {
        " during his reign , and though it had its own kings beginning in the 760s, does not appear to have recovered its political independence from the Picts.  attempts to reconstruct the confused late history of Dál Riata. The silence in the Irish Annals is ignored by . A later Pictish king, ": null
    },
    {
        "Caustantín mac Fergusa": "caustantín of the picts"
    },
    {
        " , placed his son Domnall on the throne of Dál Riata . According to --but the history of Dál Riata after that is obscure. Pictish attempts to achieve a similar dominance over the Britons of ": null
    },
    {
        "Alt Clut": "kingdom of strathclyde"
    },
    {
        "  were not successful. Cf. the failed attempts by ": null
    },
    {
        "Óengus mac Fergusa": "óengus i of the picts"
    },
    {
        ".     The ": null
    },
    {
        "Viking Age": "viking age"
    },
    {
        " brought great changes in Britain and Ireland, no less in Scotland than elsewhere, with the Vikings conquering and settling the islands and various mainland areas, including ": null
    },
    {
        "Caithness": "caithness"
    },
    {
        ", ": null
    },
    {
        "Sutherland": "sutherland"
    },
    {
        " and ": null
    },
    {
        "Galloway": "galloway"
    },
    {
        ". In the middle of the 9th century ": null
    },
    {
        "Ketil Flatnose": "ketil flatnose"
    },
    {
        " is said to have founded the ": null
    },
    {
        "Kingdom of the Isles": "kingdom of the isles"
    },
    {
        ", governing many of these territories, and by the end of that century the Vikings had destroyed the Kingdom of Northumbria, greatly weakened the ": null
    },
    {
        "Kingdom of Strathclyde": "kingdom of strathclyde"
    },
    {
        ", and founded the ": null
    },
    {
        "Kingdom of York": "kingdom of york"
    },
    {
        ". In a major battle in 839, the Vikings killed the King of ": null
    },
    {
        "Fortriu": "fortriu"
    },
    {
        ", ": null
    },
    {
        "Eógan mac Óengusa": "uen of the picts"
    },
    {
        ", the King of Dál Riata ": null
    },
    {
        "Áed mac Boanta": "áed mac boanta"
    },
    {
        ", and many others. Annals of Ulster : The won a battle against the men of Fortriu, and Eóganán son of Aengus, Bran son of Óengus, Aed son of Boanta, and others almost innumerable fell there. In the aftermath, in the 840s, ": null
    },
    {
        "Cínaed mac Ailpín": "kenneth i of scotland"
    },
    {
        " became king of the Picts.     During the reign of Cínaeds grandson, ": null
    },
    {
        "Caustantín mac Áeda": "constantine ii of scotland"
    },
    {
        " , outsiders began to refer to the region as the Kingdom of Alba rather than the Kingdom of the Picts, but it is not known whether this was because a new kingdom was established or Alba was simply a closer approximation of the Pictish name for the Picts. However, though the Pictish language did not disappear suddenly, a process of ": null
    },
    {
        "Gaelicisation": "gaelicisation"
    },
    {
        " was clearly underway during the reigns of Caustantín and his successors. By a certain point, probably during the 11th century, all the inhabitants of northern Alba had become fully Gaelicised Scots, and Pictish identity was forgotten. ; ; ; ; cf. , passim, representing the traditional view. Later, the idea of Picts as a tribe was revived in ": null
    },
    {
        "myth": "mythology"
    },
    {
        " and ": null
    },
    {
        "legend": "legend"
    },
    {
        ". For example, ": null
    },
    {
        "Pechs": "pech"
    },
    {
        ", and perhaps ": null
    },
    {
        "Pixie": "pixie"
    },
    {
        "s. However,  quotes : they are apt all over Scotland to make everything Pictish whose origin they do not know. The same could be said of the Picts in myth.             The early history of Pictland is unclear. In later periods multiple kings existed, ruling over separate kingdoms, with one king, sometimes two, more or less dominating their lesser neighbours. ; for Ireland see, e.g.  and more generally .  De Situ Albanie , a late document, the ": null
    },
    {
        "Pictish Chronicle": "pictish chronicle"
    },
    {
        ", the  Duan Albanach , along with Irish legends, have been used to argue the existence of seven Pictish kingdoms. These are as follows; those in bold are known to have had kings, or are otherwise attested in the Pictish period:     ": null
    },
    {
        "Cait": "kingdom of cat"
    },
    {
        ", or Cat, situated in modern ": null
    },
    {
        "Caithness": "caithness"
    },
    {
        " and ": null
    },
    {
        "Sutherland": "sutherland"
    },
    {
        " Ce": "kingdom of ce"
    },
    {
        ", situated in modern ": null
    },
    {
        "Mar": "marr"
    },
    {
        " and ": null
    },
    {
        "Buchan": "buchan"
    },
    {
        "  Circinn , perhaps situated in modern ": null
    },
    {
        "Angus": "angus, scotland"
    },
    {
        " and ": null
    },
    {
        "the Mearns": "the mearns"
    },
    {
        " ,    Fib, the modern ": null
    },
    {
        "Fife": "fife"
    },
    {
        ", now known as the Kingdom of Fife   Fidach, location unknown, but possibly near ": null
    },
    {
        "Inverness": "inverness"
    },
    {
        " Scotland in the Middle AgesMinor kingdoms": "scotland in the middle agesminor kingdoms"
    },
    {
        " . Irvinemclean.com . Retrieved on 2014-06-20. . Irvinemclean.com . Retrieved on 2014-06-20.   Fotla, modern ": null
    },
    {
        "Atholl": "atholl"
    },
    {
        "  ;     Fortriu , cognate with the Verturiones of the Romans; recently shown to be centred on ": null
    },
    {
        "Moray": "moray"
    },
    {
        " ; . Compare earlier works such as .     More small kingdoms may have existed. Some evidence suggests that a Pictish kingdom also existed in ": null
    },
    {
        "Orkney": "orkney"
    },
    {
        ".  De Situ Albanie is not the most reliable of sources, and the number of kingdoms, one for each of the seven sons of Cruithne, the ": null
    },
    {
        "eponym": "eponym"
    },
    {
        "ous founder of the Picts, may well be grounds enough for disbelief.  Regardless of the exact number of kingdoms and their names, the Pictish nation was not a united one.        For most of Pictish recorded history the kingdom of Fortriu appears dominant, so much so that king of Fortriu and king of the Picts may mean one and the same thing in the annals. This was previously thought to lie in the area around ": null
    },
    {
        "Perth": "perth, scotland"
    },
    {
        " and southern ": null
    },
    {
        "Strathearn": "strathearn"
    },
    {
        "; however, recent work has convinced those working in the field that Moray  was the core of Fortriu.      The Picts are often said to have practised ": null
    },
    {
        "matrilineal": "matrilineal"
    },
    {
        " kingship succession on the basis of Irish legends and a statement in ": null
    },
    {
        "Bedes": "bede"
    },
    {
        "history. Bede, I, c. 1  The kings of the Picts when Bede was writing were Bridei and Nechtan, sons of Der Ilei, who indeed claimed the throne through their mother Der Ilei, daughter of an earlier Pictish king.      In Ireland, kings were expected to come from among those who had a great-grandfather who had been king. , also pp. 108, 287, stating that derbfhine was practised by the cruithni in Ireland. Kingly fathers were not frequently succeeded by their sons, not because the Picts practised matrilineal succession, but because they were usually followed by their own brothers or cousins, more likely to be experienced men with the authority and the support necessary to be king. , Elder for kin, worth for rulership, wisdom for the church. See also ,  This was similar to ": null
    },
    {
        "tanistry": "tanistry"
    },
    {
        ".     The nature of kingship changed considerably during the centuries of Pictish history. While earlier kings had to be successful war leaders to maintain their authority, kingship became rather less personalised and more institutionalised during this time. Bureaucratic kingship was still far in the future when Pictland became Alba, but the support of the church, and the apparent ability of a small number of families to control the kingship for much of the period from the later 7th century onwards, provided a considerable degree of continuity. In much the same period, the Picts neighbours in Dál Riata and Northumbria faced considerable difficulties, as the stability of succession and rule that previously benefited them ended. , ; for Dál Riata, , for a more positive view Sharpe, The thriving of Dalriada ; for Northumbria, Higham, Kingdom of Northumbria, pp. 144–149.     The later ": null
    },
    {
        "Mormaers": "mormaer"
    },
    {
        "are thought to have originated in Pictish times, and to have been copied from, or inspired by, Northumbrian usages.  It is unclear whether the Mormaers were originally former kings, royal officials, or local nobles, or some combination of these. Likewise, the Pictish shires and ": null
    },
    {
        "thanage": "thanage"
    },
    {
        "s, traces of which are found in later times, are thought to have been adopted from their southern neighbours. ,           The archaeological record provides evidence of the ": null
    },
    {
        "material culture": "material culture"
    },
    {
        " of the Picts. It tells of a society not readily distinguishable from its   British, Gaelic, or ": null
    },
    {
        "Anglo-Saxon": "anglo-saxon"
    },
    {
        " neighbours. See, e.g.  for the Gaels of Dál Riata,  for Britons and Anglians. Although analogy and knowledge of other so-called Celtic societies may be a useful guide, these extended across a very large area. Relying on knowledge of pre-Roman ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        ", or 13th-century Ireland, as a guide to the Picts of the 6th century may be misleading if analogy is pursued too far.     As with most peoples in the north of Europe in ": null
    },
    {
        "Late Antiquity": "late antiquity"
    },
    {
        ", the Picts were farmers living in small communities. Cattle and horses were an obvious sign of wealth and prestige, sheep and pigs were kept in large numbers, and place names suggest that ": null
    },
    {
        "transhumance": "transhumance"
    },
    {
        " was common. Animals were small by later standards, although horses from Britain were imported into Ireland as breed-stock to enlarge native horses. From Irish sources it appears that the élite engaged in competitive cattle-breeding for size, and this may have been the case in Pictland also. Carvings show hunting with dogs, and also, unlike in Ireland, with falcons. Cereal crops included ": null
    },
    {
        "wheat": "wheat"
    },
    {
        ", ": null
    },
    {
        "barley": "barley"
    },
    {
        ", ": null
    },
    {
        "oats": "oat"
    },
    {
        "and ": null
    },
    {
        "rye": "rye"
    },
    {
        ". Vegetables included ": null
    },
    {
        "kale": "kale"
    },
    {
        ", ": null
    },
    {
        "cabbage": "cabbage"
    },
    {
        ", ": null
    },
    {
        "onions": "onion"
    },
    {
        "and ": null
    },
    {
        "leek": "leek"
    },
    {
        "s, ": null
    },
    {
        "peas": "pea"
    },
    {
        "and ": null
    },
    {
        "beans": "beans"
    },
    {
        " and ": null
    },
    {
        "turnip": "turnip"
    },
    {
        "s, and some types no longer common, such as ": null
    },
    {
        "skirret": "skirret"
    },
    {
        ". Plants such as ": null
    },
    {
        "wild garlic": "ramsons"
    },
    {
        ", ": null
    },
    {
        "nettles": "urtica dioica"
    },
    {
        "and ": null
    },
    {
        "watercress": "watercress"
    },
    {
        " may have been gathered in the wild. The pastoral economy meant that hides and leather were readily available. ": null
    },
    {
        "Wool": "wool"
    },
    {
        " was the main source of fibres for clothing, and ": null
    },
    {
        "flax": "flax"
    },
    {
        " was also common, although it is not clear if they grew it for fibres, for oil, or as a foodstuff. Fish, shellfish, seals, and whales were exploited along coasts and rivers. The importance of domesticated animals suggests that meat and milk products were a major part of the diet of ordinary people, while the élite would have eaten a diet rich in meat from farming and hunting. .  provides an extensive review of farming in Ireland in the middle Pictish period.     No Pictish counterparts to the areas of denser settlement around important fortresses in ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        " and southern Britain, or any other significant urban settlements, are known. Larger, but not large, settlements existed around royal forts, such as at ": null
    },
    {
        "Burghead Fort": "burghead fort"
    },
    {
        ", or associated with religious foundations. The interior of the fort at Burghead was some 12 acres in size, see ; for Verlamion , a southern British settlement on a very much larger scale, see e.g.  No towns are known in Scotland until the 12th century.      The technology of everyday life is not well recorded, but archaeological evidence shows it to have been similar to that in Ireland and Anglo-Saxon England. Recently evidence has been found of ": null
    },
    {
        "watermills": "watermill"
    },
    {
        "in Pictland.  ": null
    },
    {
        "Kilns": "kilns"
    },
    {
        " were used for drying kernels of wheat or barley, not otherwise easy in the changeable, temperate climate.         The early Picts are associated with piracy and raiding along the coasts of ": null
    },
    {
        "Roman Britain": "roman britain"
    },
    {
        ". Even in the ": null
    },
    {
        "Late Middle Ages": "late middle ages"
    },
    {
        ", the line between traders and pirates was unclear, so that Pictish pirates were probably merchants on other occasions. It is generally assumed that trade collapsed with the Roman Empire, but this is to overstate the case. There is only limited evidence of long-distance trade with Pictland, but tableware and storage vessels from Gaul, probably transported up the ": null
    },
    {
        "Irish Sea": "irish sea"
    },
    {
        ", have been found. This trade may have been controlled from ": null
    },
    {
        "Dunadd": "dunadd"
    },
    {
        " in Dál Riata, where such goods appear to have been common. While long-distance travel was unusual in Pictish times, it was far from unknown as stories of missionaries, travelling clerics and exiles show. Trade, see ; seafaring in general, e.g. , .     ": null
    },
    {
        "Brochs": "broch"
    },
    {
        "are popularly associated with the Picts. Although these were built earlier in the ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        ", with construction ending around 100 AD, they remained in use into and beyond the Pictish period.  chapter 7 ": null
    },
    {
        "Crannogs": "crannogs"
    },
    {
        ", which may originate in ": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " Scotland, may have been rebuilt, and some were still in use in the time of the Picts.  The most common sort of buildings would have been ": null
    },
    {
        "roundhouses": "roundhouse"
    },
    {
        " and rectangular timbered halls.  While many churches were built in wood, from the early 8th century, if not earlier, some were built in stone. See ,      The Picts are often said to have tattooed themselves, but evidence for this is limited. Naturalistic depictions of Pictish nobles, hunters and warriors, male and female, without obvious tattoos, are found on ": null
    },
    {
        "monumental stones": "pictish stones"
    },
    {
        ". These stones include inscriptions in Latin and ": null
    },
    {
        "ogham": "ogham"
    },
    {
        " script, not all of which have been deciphered. The well-known Pictish symbols found on standing stones and other artifacts have defied attempts at translation over the centuries. Pictish art can be classed as ": null
    },
    {
        "Celtic": "celtic art"
    },
    {
        " , and later as ": null
    },
    {
        "Insular": "migration period artinsular art"
    },
    {
        ". For art in general see , , ,  Irish poets portrayed their Pictish counterparts as very much like themselves.                 Early ": null
    },
    {
        "Pictish religion": "pictish religion"
    },
    {
        " is presumed to have resembled ": null
    },
    {
        "Celtic polytheism": "celtic polytheism"
    },
    {
        " in general, although only place names remain from the pre-Christian era. When the Pictish elite converted to ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " is uncertain, but traditions place Saint ": null
    },
    {
        "Palladius": "palladius"
    },
    {
        " in Pictland after he left ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ", and link ": null
    },
    {
        "Abernethy": "abernethy, perth and kinross"
    },
    {
        " with Saint ": null
    },
    {
        "Brigid of Kildare": "brigid of kildare"
    },
    {
        ". ,  ": null
    },
    {
        "Saint Patrick": "saint patrick"
    },
    {
        " refers to apostate Picts , while the poem  Y Gododdin  does not remark on the Picts as pagans. . Bede wrote that ": null
    },
    {
        "Saint Ninian": "saint ninian"
    },
    {
        " , had converted the southern Picts. Bede, III, 4. For the identities of Ninian/Finnian see Yorke, p. 129. Recent archaeological work at ": null
    },
    {
        "Portmahomack": "portmahomack"
    },
    {
        " places the foundation of the ": null
    },
    {
        "monastery": "monastery"
    },
    {
        " there, an area once assumed to be among the last converted, in the late 6th century. Mentioned by Foster, but more information is available from the Tarbat Discovery Programme: see under External links. This is contemporary with ": null
    },
    {
        "Bridei mac Maelchon": "bridei i of the picts"
    },
    {
        " and Columba, but the process of establishing Christianity throughout Pictland will have extended over a much longer period.     Pictland was not solely influenced by ": null
    },
    {
        "Iona": "iona"
    },
    {
        " and Ireland. It also had ties to churches in Northumbria, as seen in the reign of ": null
    },
    {
        "Nechtan mac Der Ilei": "nechtan iv of the picts"
    },
    {
        ". The reported expulsion of Ionan monks and clergy by Nechtan in 717 may have been related to the controversy over the dating of ": null
    },
    {
        "Easter": "easter"
    },
    {
        ", and the manner of ": null
    },
    {
        "tonsure": "tonsure"
    },
    {
        ", where Nechtan appears to have supported the Roman usages, but may equally have been intended to increase royal power over the church. Bede, IV, cc. 21–22, Clancy, Church institutions , Clancy, Nechtan . Nonetheless, the evidence of place names suggests a wide area of Ionan influence in Pictland.  Likewise, the  Cáin Adomnáin   counts Nechtans brother ": null
    },
    {
        "Bridei": "bridei iv of the picts"
    },
    {
        " among its guarantors.     The importance of monastic centres in Pictland was not, perhaps, as great as in Ireland. In areas that have been studied, such as ": null
    },
    {
        "Strathspey": "strathspey, scotland"
    },
    {
        " and ": null
    },
    {
        "Perthshire": "perthshire"
    },
    {
        ", it appears that the parochial structure of the ": null
    },
    {
        "High Middle Ages": "scotland in the high middle ages"
    },
    {
        " existed in early medieval times. Among the major religious sites of eastern Pictland were Portmahomack, Cennrígmonaid , ": null
    },
    {
        "Dunkeld": "dunkeld"
    },
    {
        ", ": null
    },
    {
        "Abernethy": "abernethy, perth and kinross"
    },
    {
        " and ": null
    },
    {
        "Rosemarkie": "rosemarkie"
    },
    {
        ". It appears that these are associated with Pictish kings, which argues for a considerable degree of royal patronage and control of the church. Clancy, Church institutions , Markus, Religious life . Portmahomack in particular has been the subject of recent excavation and research, published by ": null
    },
    {
        "Martin Carver": "martin carver"
    },
    {
        ".     The cult of Saints was, as throughout Christian lands, of great importance in later Pictland. While kings might patronise great Saints, such as ": null
    },
    {
        "Saint Peter": "saint peter"
    },
    {
        " in the case of Nechtan, and perhaps ": null
    },
    {
        "Saint Andrew": "saint andrew"
    },
    {
        " in the case of the second ": null
    },
    {
        "Óengus mac Fergusa": "óengus ii of the picts"
    },
    {
        ", many lesser Saints, some now obscure, were important. The Pictish Saint ": null
    },
    {
        "Drostan": "drostan"
    },
    {
        " appears to have had a wide following in the north in earlier times, although he was all but forgotten by the 12th century. Saint Serf of ": null
    },
    {
        "Culross": "culross"
    },
    {
        " was associated with Nechtans brother Bridei.  ,  It appears, as is well known in later times, that noble kin groups had their own patron saints, and their own churches or abbeys.              Pictish art appears on stones, metalwork and small objects of stone and bone. It uses a distinctive form of the general Celtic Early Medieval development of ": null
    },
    {
        "La Tène style": "la tène style"
    },
    {
        " with increasing influences from the ": null
    },
    {
        "Insular art": "insular art"
    },
    {
        " of 7th and 8th century Ireland and ": null
    },
    {
        "Northumbria": "northumbria"
    },
    {
        ", and then ": null
    },
    {
        "Anglo-Saxon": "anglo-saxon art"
    },
    {
        " and ": null
    },
    {
        "Irish art": "irish art"
    },
    {
        " as the Early Medieval period continues. The most conspicuous survivals are the many ": null
    },
    {
        "Pictish stones": "pictish stones"
    },
    {
        " that are located all over Pictland, from Inverness to Lanarkshire. An illustrated catalogue of these stones was produced by ": null
    },
    {
        "J. Romilly Allen": "j. romilly allen"
    },
    {
        " as part of The Early Christian Monuments of Scotland, with lists of their symbols and patterns. The symbols and patterns consist of animals including the ": null
    },
    {
        "Pictish Beast": "pictish beast"
    },
    {
        ", the rectangle , the mirror and comb , double-disc and Z-rod and the crescent and V-rod , among many others. There are also bosses and lenses with pelta and spiral designs. The patterns are curvilinear with hatchings. The cross-slabs are carved with Pictish symbols, Insular-derived ": null
    },
    {
        "interlace": "interlace"
    },
    {
        " and Christian imagery, though interpretation is often difficult due to wear and obscurity. Several of the Christian images carved on various stones, such as David the harpist, Daniel and the lion, or scenes of St Paul and St Anthony meeting in the desert, have been influenced by the ": null
    },
    {
        "Insular": "insular art"
    },
    {
        " manuscript tradition. ,      Pictish metalwork is found throughout Pictland and also further south; the Picts appeared to have a considerable amount of silver available, probably from raiding further south, or the payment of subsidies to keep them from doing so. The very large hoard of late Roman ": null
    },
    {
        "hacksilver": "hacksilver"
    },
    {
        " found at ": null
    },
    {
        "Traprain Law": "traprain law"
    },
    {
        " may have originated in either way. The largest hoard of early Pictish metalwork was found in 1819 at ": null
    },
    {
        "Norries Law": "norries law"
    },
    {
        " in Fife, but unfortunately much was dispersed and melted down . Two famous 7th century silver and ": null
    },
    {
        "enamel": "vitreous enamel"
    },
    {
        " plaques from the hoard, one shown above, have a Z-rod , one of the Pictish symbols, in a particularly well-preserved and elegant form; unfortunately few comparable pieces have survived. Youngs, 26–28; ": null
    },
    {
        "Poor image of 19th-century illustration": ":file:pictish symbol silver jewelry hoard norries law.jpg"
    },
    {
        " Over ten heavy silver chains, some over 0.5m long, have been found from this period; the double-linked ": null
    },
    {
        "Whitecleuch Chain": "whitecleuch chain"
    },
    {
        " is one of only two that have a ": null
    },
    {
        "penannular": "penannular brooch"
    },
    {
        " linking piece for the ends, with symbol decoration including enamel, which shows how these were probably used as choker necklaces.      In the 8th and 9th centuries, after Christianization, the Pictish elite adopted a particular form of the ": null
    },
    {
        "Celtic brooch": "celtic brooch"
    },
    {
        " from Ireland, preferring true penannular brooches with lobed terminals. Some older Irish ": null
    },
    {
        "pseudo-penannular": "pseudo-penannular"
    },
    {
        " brooches were adapted to the Pictish style, for example the ": null
    },
    {
        "Breadalbane Brooch": "breadalbane brooch"
    },
    {
        " . The ": null
    },
    {
        "St Ninians Isle Treasure": "st ninians islest ninians isle treasure"
    },
    {
        " contains the best collection of Pictish forms. Other characteristics of Pictish metalwork are dotted backgrounds or designs and animal forms influenced by Insular art. The 8th century ": null
    },
    {
        "Monymusk Reliquary": "monymusk reliquary"
    },
    {
        " has elements of Pictish and Irish style.           The ": null
    },
    {
        "Pictish language": "pictish language"
    },
    {
        " is extinct. Evidence is limited to place names, the names of people found on monuments, and the contemporary records in other languages. The evidence of ": null
    },
    {
        "place-names": "toponym"
    },
    {
        " and ": null
    },
    {
        "personal names": "onomastics"
    },
    {
        " argues strongly that the Picts spoke ": null
    },
    {
        "Insular Celtic languages": "insular celtic languages"
    },
    {
        " related to the more southerly ": null
    },
    {
        "Brittonic languages": "brittonic languages"
    },
    {
        ". ; ; ;  For K.H. Jacksons views, see  A number of ": null
    },
    {
        "Ogham": "ogham"
    },
    {
        " inscriptions have been argued to be unidentifiable as Celtic, and on this basis, it has been suggested that non-Celtic languages were also in use. ; discussed by      The absence of surviving written material in Pictish—if the ambiguous Pictish inscriptions in the Ogham script are discounted—does not indicate a pre-literate society. The church certainly required literacy in Latin, and could not function without copyists to produce liturgical documents. Pictish ": null
    },
    {
        "iconography": "iconography"
    },
    {
        " shows books being read, and carried, and its naturalistic style gives every reason to suppose that such images were of real life. Literacy was not widespread, but among the senior clergy, and in monasteries, it would have been common enough.      Place-names often allow us to deduce the existence of historic Pictish settlements in Scotland. Those prefixed with the Brittonic prefixes Aber- , Lhan- , or Pit- are claimed to indicate regions inhabited by Picts in the past . Some of these, such as Pit- , may have been formed after Pictish times, and may refer to previous shires or thanages . For place names in general, see ; . For shires and thanages see      The evidence of place-names may also reveal the advance of Gaelic into Pictland. As noted, ": null
    },
    {
        "Atholl": "atholl"
    },
    {
        ", meaning New Ireland, is attested in the early 8th century. This may be an indication of the advance of Gaelic. Fortriu also contains place-names suggesting Gaelic settlement, or Gaelic influences.  A pre-Gaelic interpretation of the name as Athfocla meaning north pass or north way, as in gateway to Moray, suggests that the Gaelic Athfotla may be a Gaelic misreading of the minuscule c for t.       Medieval Welsh tradition credited the founding of ": null
    },
    {
        "Gwynedd": "kingdom of gwynedd"
    },
    {
        " to the Picts The statement Nid oedhynt y Picteit onyd yr hen Gymry is recorded in Peniarth MS. 118. Op. cit. ": null
    },
    {
        "Wade-Evans, Arthur": "wade-evans, arthur"
    },
    {
        ". Welsh Medieval Law. ": null
    },
    {
        "Introduction": "s:the laws of hywel dda/introduction"
    },
    {
        " . Oxford Univ., 1909. Accessed 30 Jan 2013. and traced their principal royal families—the Houses of ": null
    },
    {
        "Aberffraw": "house of aberffraw"
    },
    {
        " and ": null
    },
    {
        "Dinefwr": "house of dinefwr"
    },
    {
        "—to ": null
    },
    {
        "Cunedda Wledig": "cunedda wledig"
    },
    {
        ", said to have invaded northern Wales from ": null
    },
    {
        "Lothian": "lothian"
    }
]