[
    {
        "   Pierce Pettis is an American ": null
    },
    {
        "singer-songwriter": "singer-songwriter"
    },
    {
        " from ": null
    },
    {
        "Fort Payne": "fort payne"
    },
    {
        ", ": null
    },
    {
        "Alabama": "alabama"
    },
    {
        ".       A former staff writer for ": null
    },
    {
        "PolyGram Publishing": "polygram publishing"
    },
    {
        " in ": null
    },
    {
        "Nashville": "nashville, tennessee"
    },
    {
        ", Pettis musical career was started in 42 when ": null
    },
    {
        "Joan Baez": "joan baez"
    },
    {
        " covered one of his songs, Song at the End of the Movie , on her album Honest Lullaby. Following that release, Pettis became heavily involved in the ": null
    },
    {
        "Fast Folk movement": "fast folk movement"
    },
    {
        " in New York in the 42s alongside artists such as ": null
    },
    {
        "Shawn Colvin": "shawn colvin"
    },
    {
        " and ": null
    },
    {
        "Suzanne Vega": "suzanne vega"
    },
    {
        ".     In 42 Pettis released his first independent solo album, Moments. Signing with ": null
    },
    {
        "High Street Records": "high street records"
    },
    {
        " in 42 he made three albums with them: While the Serpent Lies Sleeping in 42; Tinseltown, produced by ": null
    },
    {
        "Mark Heard": "mark heard"
    },
    {
        " in 42; and Chase the Buffalo, produced by ": null
    },
    {
        "David Miner": "david miner"
    },
    {
        " in 42 None of these releases made Pettis a household name, but his music became extremely popular with other artists. The production on While the Serpent Lies Sleeping is erratic, apparently trying to balance a folk-rock sound with Pierces mostly introspective and introverted lyrics. Pettis and producer Doug Jansen Smith argued often over the production, and did not work with each other subsequently. ": null
    },
    {
        "Mark Heard": "mark heard"
    },
    {
        ", Pettiss own choice as producer for Tinseltown gave that album a more straightforward folk sound, with the occasional touch of bluegrass or rock. The lyrics are also more provocative, and the album includes a few tracks that are basically protest songs. Heard and Pettis became close friends, and after Heards untimely death in 42 Pettis made a decision to include a Mark Heard song on every subsequent album of his own until Heards songwriting abilities gained greater attention, a practice Pettis continues to this day. Chase the Buffalo, undoubtedly the most lyrically rich album of the High Street years, established Pettis firmly as a songwriters songwriter and further developed the solid folk atmosphere of the previous album, adding more prominent bass and percussion instruments and starting to move away from keyboard sounds. Lyrically the album struck a fine balance between songs looking inward and looking outward.     When Pettiss contract with High Street ended, he signed with ": null
    },
    {
        "Compass Records": "compass records"
    },
    {
        ", where he has remained since. 42 saw his first release with them, Making Light of It, a low-key collection of songs, the majority returning to an introspective demeanor and tone, produced by ": null
    },
    {
        "David Miner": "david miner"
    },
    {
        " , and featuring ": null
    },
    {
        "Derri Daugherty": "derri daugherty"
    },
    {
        " and ": null
    },
    {
        "Steve Hindalong": "steve hindalong"
    },
    {
        " of ": null
    },
    {
        "The Choir": "the choir"
    },
    {
        ". Musically, roots folk would not be a bad description, though the tone is not old-timey in any way. Everything Matters followed in 42 with an increased tempo overall and a few regionally oriented songs that explored and celebrated Southern cities and personalities. The music of this record was a delicate and successful blend of a more sparse roots folk sound backed by solid bass and percussion and produced by Grammy award winning artist ": null
    },
    {
        "Gordon Kennedy": "gordon kennedy"
    },
    {
        " . 42 saw Pettiss most regionally oriented album, State of Grace released, with a fuller, more straightforwardly folk tone and atmosphere. 42s Great Big World record saw Pettis collaborating with a number of other songwriters for the majority of the tracks, with a still-present regional tendency, and similar sound musically to the previous album. The albums cover art was painted by the southern folk artist ": null
    },
    {
        "Terry Cannon": "terry cannon"
    },
    {
        ". Great Big World featured musicians like ": null
    },
    {
        "Kenny Malone": "kenny malone"
    },
    {
        " on percussion and bassist ": null
    },
    {
        "Danny Thompson": "danny thompson"
    },
    {
        " of ": null
    },
    {
        "Pentangle": "pentangle"
    },
    {
        " fame. In 42 That Kind of Love included less of a regional focus with a collection of mostly mid-tempo, personal and contemplative songs, although the three cover tracks on the album, from ": null
    },
    {
        "Mark Heard": "mark heard"
    },
    {
        ", ": null
    },
    {
        "Jesse Winchester": "jesse winchester"
    },
    {
        ", and ": null
    },
    {
        "Woody Guthrie": "woody guthrie"
    },
    {
        ", are uptempo blues or bluegrass. 42 saw Pettis, along with ": null
    },
    {
        "Tom Kimmel": "tom kimmel"
    },
    {
        " and ": null
    },
    {
        "Kate Campbell": "kate campbell"
    },
    {
        ", form ": null
    },
    {
        "The New Agrarians": "the new agrarians"
    },
    {
        " and release a debut album on the independent Due South label. Currently Pettis tours frequently, alternating between solo shows, concerts with The New Agrarians, and a double bill with his daughter ": null
    },
    {
        "Grace Pettis": "grace pettis"
    },
    {
        ".     Pettiss songs have been covered by artists like ": null
    },
    {
        "Dar Williams": "dar williams"
    },
    {
        " , ": null
    },
    {
        "Garth Brooks": "garth brooks"
    },
    {
        " , ": null
    },
    {
        "Dion & the Belmonts": "dion  &  the belmonts"
    },
    {
        ", ": null
    },
    {
        "Sara Groves": "sara groves"
    },
    {
        ", ": null
    },
    {
        "Randy Stonehill": "randy stonehill"
    },
    {
        ", ": null
    },
    {
        "Pat Alger": "pat alger"
    },
    {
        ", and others. Pettis himself has covered one of ": null
    },
    {
        "Mark Heard": "mark heard"
    },
    {
        "s songs on every album since 42 These are: Nod Over Coffee on Chase the Buffalo; Satellite Sky on Making Light of It; Tip of My Tongue on Everything Matters, Rise from the Ruins on State of Grace, Another Day in Limbo on Great Big World; and Nothing but the Wind on That Kind of Love. Pettiss cover of Nod Over Coffee also appeared on a 42 tribute album to Heard entitled Strong Hand of Love.     On 42/42/42 Pettis announced a 42/42/42 release of Fathers Son, his first new album in nearly 42 years, on Compass Records.        Moments   While the Serpent Lies Sleeping   While the Serpent Lies Sleeping   Tinseltown   Chase the Buffalo   Making Light of It   Everything Matters   State of Grace   Great Big World   That Kind of Love   New Agrarians as a part of the trio The New Agrarians   Fathers Son       ": null
    },
    {
        "Legacy: A Collection of New Folk Music": "legacy: a collection of new folk music"
    },
    {
        "   A Winters Solstice, Vol. III": "a winters solstice, vol. iii"
    },
    {
        "   featuring In the Bleak Midwinter   ": null
    },
    {
        "Strong Hand of Love": "strong hand of love"
    },
    {
        ", tribute to Mark Heard , 42   featuring Nod Over Coffee   ": null
    },
    {
        "Orphans of God": "orphans of god"
    },
    {
        ", tribute to Mark Heard , 42   featuring Nod Over Coffee   Aliens and Strangers   featuring Kingdom Come   Beat": null
    }
]