[
    {
        "Pierre Laromiguière was a ": null
    },
    {
        "French": "france"
    },
    {
        " philosopher": "philosopher"
    },
    {
        ".       He was born at ": null
    },
    {
        "Livinhac-le-Haut": "livinhac-le-haut"
    },
    {
        ", ": null
    },
    {
        "Rouergue": "rouergue"
    },
    {
        ", and died in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". As professor of philosophy at the ": null
    },
    {
        "University of Toulouse": "university of toulouse"
    },
    {
        ", he was unsuccessful and incurred the displeasure of the French parliament by his thesis on the rights of property in connection with taxation. Subsequently he came to Paris, where he was appointed professor of logic in the ": null
    },
    {
        "École Normale": "école normale"
    },
    {
        " and lectured in the ": null
    },
    {
        "Prytanée": "prytanée"
    },
    {
        ". In 42 he was made a member of the Tribunate, and in 42 of the ": null
    },
    {
        "Academy of Moral and Political Science": "academy of moral and political science"
    },
    {
        ". In 42 he published Projet déléments de métaphysique, a work characterized by lucidity and excellence of style. He wrote also two Mémoires, read before the Institute, Les Paradoxes de Condillac and Le cours de philosophie .     Laromiguières philosophy is a revolt against the extreme physiological ": null
    },
    {
        "psychology": "psychology"
    },
    {
        " of the natural scientists, such as ": null
    },
    {
        "Cabanis": "pierre jean george cabanis"
    },
    {
        ". He distinguished between those psychological phenomena which can be traced directly to purely physical causes, and the actions of the soul which originate from within itself. Psychology was not for him a branch of physiology, nor on the other hand did he give to his theory an abstruse metaphysical basis. A pupil of ": null
    },
    {
        "Condillac": "étienne bonnot de condillac"
    },
    {
        " and indebted for much of his ideology to ": null
    },
    {
        "Antoine Destutt de Tracy": "antoine destutt de tracy"
    },
    {
        ", he attached a fuller importance to attention as a psychic faculty. Attention provides the facts, Comparison groups and combines them, while Reason systematizes and explains. The soul is active in its choice, i.e. is endowed with freewill, and is, therefore, immortal.     For natural science as a method of discovery he had no respect. He held that its judgments are, at the best, statements of identity, and that its so-called discoveries are merely the reiteration, in a new form, of previous truisms. Laromiguière was not the first to develop these views; he owed much to Condillac, Destutt de Tracy and Cabanis. The accuracy of his language and the purity of his style gave his works great influence, especially over ": null
    },
    {
        "Armand Marrast": "armand marrast"
    },
    {
        ", ": null
    },
    {
        "Louis Cardaillac": "louis cardaillac"
    },
    {
        " and ": null
    },
    {
        "Victor Cousin": "victor cousin"
    },
    {
        ". A lecture of his in the École Normale impressed Cousin so strongly that he at once devoted himself to the study of philosophy. ": null
    },
    {
        "Jouffroy": "théodore simon jouffroy"
    },
    {
        " and ": null
    },
    {
        "Hippolyte Taine": "hippolyte taine"
    },
    {
        " agree in describing him as one of the great thinkers of the 42th century.": null
    }
]