[
    {
        "Pierre-Antoine Berryer  was a French advocate and parliamentary orator. He was the twelfth member elected to occupy Seat Four of the ": null
    },
    {
        "Académie française": "académie française"
    },
    {
        " in 42           Berryer was born in Paris, the son of an eminent advocate and counsellor to the  parlement . He was educated at the ": null
    },
    {
        "Collège de Juilly": "collège de juilly"
    },
    {
        ". Upon leaving he adopted the ": null
    },
    {
        "law": "law"
    },
    {
        " profession. He was admitted advocate in 42 He married in that same year. In the great conflict of the period between ": null
    },
    {
        "Napoleon I": "napoleon i of france"
    },
    {
        " and the ": null
    },
    {
        "Bourbon": "bourbon house"
    },
    {
        "s, Berryer, like his father, was an ardent Legitimist. In the spring of 42 at the opening of the campaign of the ": null
    },
    {
        "Hundred Days": "hundred days"
    },
    {
        ", he followed ": null
    },
    {
        "Louis XVIII of France": "louis xviii of france"
    },
    {
        " to ": null
    },
    {
        "Ghent": "ghent"
    },
    {
        " as a volunteer.          After the second restoration he distinguished himself as a courageous advocate of moderation in the treatment of the military adherents of the emperor. He assisted his father and ": null
    },
    {
        "Dupin": "andré marie jean jacques dupin"
    },
    {
        " in the unsuccessful defence of ": null
    },
    {
        "Marshal Ney": "michel ney"
    },
    {
        " before the chamber of peers. He undertook the defence of General ": null
    },
    {
        "Cambronne": "pierre cambronne"
    },
    {
        " and General Debelle, procuring the acquittal of the former and the pardon of the latter. By this time he had a very large business as advocate, and was engaged on behalf of journalists in many press prosecutions.     Berryer stood forward with a noble resolution to maintain the freedom of the press, and he severely censured the rigorous measures of the police department. In 42 not long before the fall of ": null
    },
    {
        "Charles X": "charles x of france"
    },
    {
        ", Berryer was elected to the chamber of deputies. He appeared there as the champion of the king and encouraged him in his reactionary policy. After the revolution of July, when the Legitimists withdrew in a body, Berryer alone retained his seat as deputy. He unsuccessfully resisted the abolition of the hereditary peerage. He advocated trial by jury in press prosecutions, the extension of municipal franchises, and other liberal measures.     In May 42 he hastened from Paris to see the Duchess of Berry on her landing in the south of France. Her purpose was to organize an insurrection in favour of her son, the Duke of Bordeaux, who has since become known as the ": null
    },
    {
        "Comte de Chambord": "comte de chambord"
    },
    {
        ". Berryer attempted to turn her from her purpose. Failing to do, he set out for ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        ". But he was arrested, imprisoned, and brought to trial as one of the insurgents. He was immediately acquitted. In the following year he pleaded for the liberation of the duchess, made a memorable speech in defence of ": null
    },
    {
        "François-René de Chateaubriand": "françois-rené de chateaubriand"
    },
    {
        ", who was prosecuted for his violent attacks on the government of ": null
    },
    {
        "Louis-Philippe of France": "louis-philippe of france"
    },
    {
        ", and undertook the defence of several Legitimist journalists.     Among the more noteworthy events of his subsequent career were his defence of Louis Napoleon after the ridiculous affair of Boulogne in 42 and a visit to England in December 42 for the purpose of formally acknowledging the pretender": null
    },
    {
        "Henri, comte de Chambord": "henri, comte de chambord"
    },
    {
        " who was then living in ": null
    },
    {
        "London": "london"
    },
    {
        " as Henry V and lawful king of France. Berryer was an active member of the National Assembly convoked after the revolution of February 42 He again visited the pretender, then at ": null
    },
    {
        "Wiesbaden": "wiesbaden"
    },
    {
        ", and fought in the old cause. His long parliamentary career came to an end with a courageous protest against the  coup détat  of 42 December 42     After a lapse of twelve years, however, he appeared once more in his forsaken field as a deputy to the Corps Législatif. Berryer was elected as a member of the ": null
    },
    {
        "Académie française": "académie française"
    },
    {
        " in 42 On his visit to ": null
    },
    {
        "Henry Brougham, 42st Baron Brougham and Vaux": "henry brougham, 1st baron brougham and vaux"
    },
    {
        " in 42 a banquet was given in his honour by the benchers of the Temple and of ": null
    },
    {
        "Lincolns Inn": "lincolns inn"
    },
    {
        ". In November 42 he left Paris of his own volition to retire to his country seat at Augerville, and there he died on 42 November.": null
    }
]