[
    {
        "Pierre Brissaud was a French ": null
    },
    {
        "Art Deco": "art deco"
    },
    {
        " illustrator": "list of illustrators"
    },
    {
        ", ": null
    },
    {
        "painter": "painting"
    },
    {
        ", and ": null
    },
    {
        "engraver": "engraving"
    },
    {
        " whose father was Docteur Edouard Brissaud, a student of Docteur Charcot. He was born in Paris and trained at the ": null
    },
    {
        "École des Beaux-Arts": "école des beaux-arts"
    },
    {
        " and Atelier Fernand Cormon in ": null
    },
    {
        "Montmartre": "montmartre"
    },
    {
        ", Paris. His fellow Cormon students were his brother Jacques, ": null
    },
    {
        "André-Édouard Marty": "andré-édouard marty"
    },
    {
        ", ": null
    },
    {
        "Charles Martin": "charles martin"
    },
    {
        ", ": null
    },
    {
        "Georges Lepape": "georges lepape"
    },
    {
        ". Students at the workshop drew, painted and designed wallpaper, furniture and posters. Earlier, ": null
    },
    {
        "Toulouse-Lautrec": "henri de toulouse-lautrec"
    },
    {
        ", ": null
    },
    {
        "van Gogh": "vincent van gogh"
    },
    {
        ", and ": null
    },
    {
        "Henri Matisse": "henri matisse"
    },
    {
        " had studied and worked there. His older brother ": null
    },
    {
        "Jacques Brissaud": "jacques brissaud"
    },
    {
        " was a portrait and genre painter and his uncle ": null
    },
    {
        "Maurice Boutet de Monvel": "maurice boutet de monvel"
    },
    {
        " illustrated the fables of ": null
    },
    {
        "La Fontaine": "la fontaine"
    },
    {
        ", songbooks for children and a life of Joan of Arc. A first cousin was the celebrated artist and celebrity portrait painter ": null
    },
    {
        "Bernard Boutet de Monvel": "bernard boutet de monvel"
    },
    {
        ".     Brissaud is known for his pochoir prints for the fashion magazine  Gazette du Bon Ton  published by Lucien Vogel, Paris. Many of his illustrations are realistic leisure scenes of the well-to-do. They illustrate the designs of Paris fashion houses such as Jeanne Lanvin, ": null
    },
    {
        "Chéruit": "louise chéruit"
    },
    {
        ", Worth, and Doucet. Brissauds illustrations appeared in  Vogue  after it bought Bon Ton in 42 as well as  House & Garden  and  Fortune , and in books like  Madame Bovary ,  Manon Lescaut , Mémoires de Saint-Simon, the autobiographical novels of Anatole France,  Two gentlemen of Verona  and many others.     In 42 he exhibited at the ": null
    },
    {
        "Salon des Indépendants": "salon des indépendants"
    },
    {
        " and the ": null
    },
    {
        "Salon dAutomne": "salon dautomne"
    },
    {
        ".       Dictionnaire critique et documentaire des peintres, sculpteurs, dessinateurs et graveurs, Emmanuel Bénézit, Pub, Paris, Gründ, 42   Dizionario della moda by Mariella Azzali, Pub. Calderini;   Exposition de peintures... Pierre Brissaud..., Louis Vauxcelles, pub. Devambez , , Paris, 42   French Fashion Plates in Full Colour from the Gazette du Bon Ton , Lepape et al., N. Y., Dover, 42   Les Petits Maitres de la Peinture valeur de demain 4242 by Gérald Schurr, pub. Les Editions de lAmateur, Paris, 42   Pierre Brissaud Jean Dulac, pub. Henri Babou, 42 Paris,   Pierre Brissaud: La grande époque, Paris 42 - 42 lart et la                                                    ": null
    }
]