[
    {
        "     Pioneer 11  is a  ": null
    },
    {
        "robotic": "Robotic Spacecraft"
    },
    {
        " space probe": "Space Probe"
    },
    {
        " launched by ": null
    },
    {
        "NASA": "Nasa"
    },
    {
        " on April 6, 1973 to study the ": null
    },
    {
        "asteroid belt": "Asteroid Belt"
    },
    {
        ", the environment around ": null
    },
    {
        "Jupiter": "Jupiter"
    },
    {
        " and ": null
    },
    {
        "Saturn": "Saturn"
    },
    {
        ", ": null
    },
    {
        "solar wind": "Solar Wind"
    },
    {
        " and ": null
    },
    {
        "cosmic ray": "Cosmic Ray"
    },
    {
        "s. It was the first probe to ": null
    },
    {
        "encounter Saturn": "Exploration Of Saturn"
    },
    {
        " and the second to fly through the ": null
    },
    {
        "asteroid belt": "Asteroid Beltexploration"
    },
    {
        " and ": null
    },
    {
        "by Jupiter": "Exploration Of Jupiter"
    },
    {
        ". Thereafter, Pioneer 11 became the ": null
    },
    {
        "second of five artificial objects": "List Of Artificial Objects Leaving The Solar System"
    },
    {
        " to achieve the ": null
    },
    {
        "escape velocity": "Escape Velocity"
    },
    {
        " that will allow them to ": null
    },
    {
        "leave the Solar System": "Solar Systemfarthest Regions"
    },
    {
        ". Due to power constraints and the vast distance to the probe, the last routine contact with the spacecraft was on September 30, 1995, and the last good engineering data was received on November 24, 1995.           Approved in February 1969, Pioneer 11 and its twin probe,  Pioneer 10 , were the first to be designed for exploring the ": null
    },
    {
        "outer Solar System": "Outer Solar System"
    },
    {
        ". Yielding to multiple proposals throughout the 1960s, early mission objectives were defined as:   Explore the ": null
    },
    {
        "interplanetary medium": "Interplanetary Medium"
    },
    {
        " beyond the orbit of Mars   Investigate the nature of the asteroid belt from the scientific standpoint and assess the belts possible hazard to missions to the outer planets.   Explore the ": null
    },
    {
        "environment of Jupiter": "Atmosphere Of Jupiter"
    },
    {
        ".     Subsequent planning for an encounter with Saturn added many more goals:   Map the magnetic field of Saturn and determine its intensity, direction, and structure.   Determine how many electrons and protons of various energies are distributed along the trajectory of the spacecraft through the Saturn system.   Map the interaction of the Saturn system with the ": null
    },
    {
        "solar wind": "Solar Wind"
    },
    {
        ".   Measure the temperature of Saturns atmosphere and that of Titan, the largest satellite of Saturn.   Determine the structure of the upper atmosphere of Saturn where molecules are expected to be electrically charged and form an ionosphere.   Map the thermal structure of ": null
    },
    {
        "Saturns atmosphere": "Atmosphere Of Saturn"
    },
    {
        " by infrared observations coupled with ": null
    },
    {
        "radio occultation": "Radio Occultation"
    },
    {
        " data.   Obtain spin-scan images of the ": null
    },
    {
        "Saturnian system": "Saturnian System"
    },
    {
        " in two colors during the encounter sequence and polarimetry measurements of the planet.   Probe the ring system and the atmosphere of Saturn with S-band radio occultation.   Determine more precisely the masses of Saturn and its larger satellites by accurate observations of the effects of their gravitational fields on the motion of the spacecraft.   As a precursor to the ": null
    },
    {
        "Mariner Jupiter/Saturn mission": "Voyager Program"
    },
    {
        ", verify the environment of the ring plane to find out where it may be safely crossed by the Mariner spacecraft without serious damage. Mark, Hans:      Pioneer 11 was built by ": null
    },
    {
        "TRW": "Trw Inc."
    },
    {
        " and managed as part of the ": null
    },
    {
        "Pioneer program": "Pioneer Program"
    },
    {
        " by ": null
    },
    {
        "NASA Ames Research Center": "Nasa Ames Research Center"
    },
    {
        ".  A backup unit, ": null
    },
    {
        "Pioneer H": "Pioneer H"
    },
    {
        ", is currently on display in the Milestones of Flight exhibit at the ": null
    },
    {
        "National Air and Space Museum": "National Air And Space Museum"
    },
    {
        " in ": null
    },
    {
        "Washington, D.C.": "Washington, D.C."
    },
    {
        ".  Many elements of the mission proved to be critical in the planning of the ": null
    },
    {
        "Voyager program": "Voyager Program"
    },
    {
        ". William E. Burrows, Exploring Space,        The Pioneer 11 bus measures  deep and with six  panels forming the hexagonal structure. The bus houses propellant to control the orientation of the probe and eight of the twelve scientific instruments. The spacecraft has a mass of 260 kilograms.           :Orientation of the spacecraft was maintained with six 4.5-": null
    },
    {
        "N": "Newton"
    },
    {
        ",  ": null
    },
    {
        "hydrazine": "Hydrazine"
    },
    {
        " monopropellant": "Monopropellant Rocket"
    },
    {
        " thrusters: pair one maintains a constant spin-rate of 4.8 ": null
    },
    {
        "rpm": "Revolutions Per Minute"
    },
    {
        ", pair two controls the forward thrust, pair three controls attitude. Information for the orientation is provided by performing ": null
    },
    {
        "conical scanning": "Conical Scanning"
    },
    {
        " maneuvers to track Earth in its orbit,  a ": null
    },
    {
        "star sensor": "Star Trackerstar Tracker"
    },
    {
        " able to reference ": null
    },
    {
        "Canopus": "Canopus"
    },
    {
        ", and two ": null
    },
    {
        "Sun sensor": "Sun Sensor"
    },
    {
        "s.        :The space probe includes a redundant system ": null
    },
    {
        "transceiver": "Transceiver"
    },
    {
        "s, one attached to the ": null
    },
    {
        "high-gain antenna": "High-Gain Antenna"
    },
    {
        ", the other to an omni-antenna and medium-gain antenna. Each transceiver is 8 watts and transmits data across the ": null
    },
    {
        "S-band": "S-Band"
    },
    {
        " using 2110 MHz for the uplink from Earth and 2292 MHz for the downlink to Earth with the ": null
    },
    {
        "Deep Space Network": "Deep Space Network"
    },
    {
        " tracking the signal. Prior to transmitting data, the probe uses a ": null
    },
    {
        "convolutional encoder": "Convolutional Code"
    },
    {
        " to allow ": null
    },
    {
        "correction of errors": "Error Correction"
    },
    {
        " in the received data on Earth.           :Pioneer 11 uses four SNAP-19 ": null
    },
    {
        "radioisotope thermoelectric generators": "Radioisotope Thermoelectric Generator"
    },
    {
        " . They are positioned on two three-rod trusses, each  in length and 120 degrees apart. This was expected to be a safe distance from the sensitive scientific experiments carried on board. Combined, the RTGs provided 155 watts at launch, and decayed to 140 W in transit to Jupiter. The spacecraft requires 100 W to power all systems.        :Much of the computation for the mission was performed on Earth and transmitted to the probe, where it is able to retain in memory, up to five commands of the 222 possible entries by ground controllers. The spacecraft includes two command decoders and a command distribution unit, a very limited form of processor, to direct operations on the spacecraft. This system requires that mission operators prepare commands long in advance of transmitting them to the probe. A data storage unit is included to record up to 6,144 ": null
    },
    {
        "bytes": "Bytes"
    },
    {
        " of information gathered by the instruments. The digital telemetry unit is then be used to prepare the collected data in one of the thirteen possible formats before transmitting it back to Earth.        Pioneer has one additional instrument more than Pioneer 10, a flux-gate magnetometer.    ": null
    }
]