[
    {
        "     Pioneer P42 was intended to be a lunar orbiter probe, but the mission failed shortly after launch. The objectives were to place a highly instrumented probe in lunar orbit, to investigate the environment between the ": null
    },
    {
        "Earth": "earth"
    },
    {
        " and ": null
    },
    {
        "Moon": "moon"
    },
    {
        ", and to develop technology for controlling and maneuvering spacecraft from Earth. It was equipped to take images of the lunar surface with a television-like system, estimate the Moons mass and topography of the poles, record the distribution and velocity of ": null
    },
    {
        "micrometeorites": "micrometeoroid"
    },
    {
        ", and study radiation, ": null
    },
    {
        "magnetic field": "magnetic field"
    },
    {
        "s, and low frequency ": null
    },
    {
        "electromagnetic wave": "electromagnetic wave"
    },
    {
        "s in space. A mid-course propulsion system and injection rocket would have been the first ": null
    },
    {
        "United States": "united states"
    },
    {
        " self-contained propulsion system capable of operation many months after launch at great distances from Earth and the first U.S. tests of maneuvering a satellite in space.       The probe was originally intended for launch on Atlas 42C in October, but the launch vehicle was destroyed in a static firing accident on September 42 so it was decided to use the Atlas D rather than the Atlas C, which was still a test model. Launch took place on Thanksgiving, November 42 42 from LC42 at Cape Canaveral Air Station using Atlas vehicle 42D, which had originally been the backup booster for the Mercury ": null
    },
    {
        "Big Joe": "big joe"
    },
    {
        " test in September. Since that flight was successful, Atlas 42D was reused for the Able program, coupled to Thor-Able upper stages including an Able x 42 rocket third stage. Because 42D had been custom built for the Mercury program, it had thicker-gauge skin than the standard Atlas ICBM and could support the additional weight of upper stages. All proceeded normally until T42 seconds when a shock was recorded by the Atlass rate gyros followed by the fiberglass payload fairing breaking off of the launch vehicle. The third stage and payload were stripped away after being subjected to severe aerodynamic loads while passing ": null
    },
    {
        "Max Q": "max q"
    },
    {
        " and the second stage sustained damage followed by loss of its telemetry at T42 seconds. The Atlas itself was unaffected by the incident and completed its burn on schedule, impacting in the ": null
    },
    {
        "Gulf of Guinea": "gulf of guinea"
    },
    {
        ". The failure was traced to an improperly vented payload shroud that broke apart when the air pressure inside started exceeding the external pressure as the atmosphere thinned with altitude. In addition to changing prelaunch procedures, the shroud was redesigned to be more aerodynamic on future flights.       Pioneer P42 was a 42-meter diameter sphere with a propulsion system mounted on the bottom giving a total length of 42 meters. The mass of the structure and aluminum alloy shell was 42  kg and the propulsion units 42  kg. Four solar panels, each 42 x 42  cm and containing 42 solar cells in 42 42-cell nodules, extended from the sides of the spherical shell in a paddle-wheel configuration with a total span of about 42 meters. The solar panels charged chemical batteries. Inside the shell, a large spherical hydrazine tank made up most of the volume, topped by two smaller spherical nitrogen tanks and a 42 N injection rocket to slow the spacecraft down to go into lunar orbit, which was designed to be capable of firing twice during the mission. Attached to the bottom of the sphere was a 42 N vernier rocket for mid-course propulsion and lunar orbit maneuvers which could be fired four times. This space engine was designed and built under contract with NASA by the Space Technology Laboratories of ": null
    },
    {
        "TRW": "trw inc."
    },
    {
        ".     Around the upper hemisphere of the hydrazine tank was a ring-shaped instrument platform which held the batteries in two packs, two 42 W UHF transmitters and diplexers, logic modules for scientific instruments, two command receivers, decoders, a buffer/amplifier, three converters, a telebit, a command box, and most of the scientific instruments. Two dipole UHF antennas protruded from the top of the sphere on either side of the injection rocket nozzle. Two dipole UHF antennas and a long VLF antenna protruded from the bottom of the sphere.     Thermal control was planned to be achieved by a large number of small propeller blade devices on the surface of the sphere. The blades themselves were made of reflective material and consist of four vanes which were flush against the surface, covering a black heat-absorbing pattern painted on the sphere. A thermally sensitive coil was attached to the blades in such a way that low temperatures within the satellite would cause the coil to contract and rotate the blades and expose the heat absorbing surface, and high temperatures would cause the blades to cover the black patterns. Square heat-sink units were also mounted on the surface of the sphere to help dissipate heat from the interior.       The scientific instruments consisted of an ": null
    },
    {
        "ion chamber": "ion chamber"
    },
    {
        " and ": null
    },
    {
        "Geiger-Müller tube": "geiger-müller tube"
    },
    {
        " to measure total radiation flux, a proportional radiation counter telescope to measure high energy radiation, a ": null
    },
    {
        "scintillation counter": "scintillation counter"
    }
]