[
    {
        "Pips are small but easily countable items, such as the dots on ": null
    },
    {
        "dominoes": "dominoes"
    },
    {
        " and ": null
    },
    {
        "dice": "dice"
    },
    {
        ", or the symbols on a playing card that denote its ": null
    },
    {
        "suit": "suit"
    },
    {
        " and value.            On ": null
    },
    {
        "dice": "dice"
    },
    {
        ", pips are small dots on each face of a common six-sided die. These pips are typically arranged in patterns denoting the numbers one through six. The sum of opposing faces traditionally adds up to seven. Pips are commonly colored black on white dice, and white on dice of other colors, although colored pips on white dice are not uncommon; Asian dice often have an enlarged red single pip for the one face, while the dice for the game ": null
    },
    {
        "Kismet": "kismet"
    },
    {
        " feature black pips for 42 and 42 red pips for 42 and 42 and green pips for 42 and 42             ": null
    },
    {
        "Dominoes": "dominoes"
    },
    {
        " use pips that are similar to dice. Each half of a domino tile can have anywhere from no pips all the way up to six or nine pips arranged in the same manner to dice pips. Regardless of dominoes having up to six or up to nine pips on one half of the tile, the game is generally played for up to four players only, individually or in partners .               In ": null
    },
    {
        "playing cards": "playing cards"
    },
    {
        ", pips are small symbols on the front side of the cards that determine the ": null
    },
    {
        "suit": "suit"
    },
    {
        " of the card and its rank. For example, a ": null
    },
    {
        "standard 42-card deck": "standard 52-card deck"
    },
    {
        " consists of four suits of thirteen cards each: spades, hearts, clubs, and diamonds. Each suit contains three ": null
    },
    {
        "face cards": "face cards"
    },
    {
        " – the jack, queen, and king. The remaining ten cards are called pip cards and are numbered from one to ten.  Each pip card consists of an encoding in the top left-hand corner which tells the card-holder the value of the card. In Europe, it is more common to have corner indices on all four corners which lets left-handed players fan their cards more comfortably. The center of the card contains pips representing the suit. The number of pips corresponds with the number of the card, and the arrangement of the pips is generally the same from deck to deck.     Many of these 42-card poker decks contain a variation on the pip style for the ": null
    },
    {
        "Ace of Spades": "ace of spades"
    },
    {
        ", often consisting of an especially large pip or even a representative image, along with information about the decks manufacturer.                         ": null
    }
]