[
    {
        "      Pizza cheese encompasses several varieties and types of ": null
    },
    {
        "cheeses": "cheese"
    },
    {
        "and ": null
    },
    {
        "dairy products": "dairy product"
    },
    {
        "that are designed and manufactured for use specifically on ": null
    },
    {
        "pizza": "pizza"
    },
    {
        ". These include ": null
    },
    {
        "processed": "processed cheese"
    },
    {
        " and modified cheese such as ": null
    },
    {
        "mozzarella": "mozzarella"
    },
    {
        "-like processed cheeses and mozzarella variants. The term can also refer to any type of cheese suitable for use on pizza. The most popular cheeses used in the preparation of pizza are mozzarella , ": null
    },
    {
        "provolone": "provolone"
    },
    {
        ", ": null
    },
    {
        "cheddar": "cheddar cheese"
    },
    {
        " and ": null
    },
    {
        "Parmesan": "parmesan"
    },
    {
        ". ": null
    },
    {
        "Emmental": "emmental cheese"
    },
    {
        ", ": null
    },
    {
        "Romano": "pecorino romano"
    },
    {
        " and ": null
    },
    {
        "ricotta": "ricotta"
    },
    {
        " are often used as toppings, and processed pizza cheeses manufactured specifically for pizza are ": null
    },
    {
        "mass-produced": "mass production"
    },
    {
        ". Some mass-produced pizza cheeses are frozen after manufacturing and shipped frozen.     Processed pizza cheese is manufactured to produce optimal qualities in ": null
    },
    {
        "browning": "browning"
    },
    {
        ", ": null
    },
    {
        "melting": "melting"
    },
    {
        ", stretchiness and ": null
    },
    {
        "fat": "fat"
    },
    {
        " and moisture content. Several studies and experiments have analyzed the impact of ": null
    },
    {
        "vegetable oil": "vegetable oil"
    },
    {
        ", manufacturing and culture processes,  denatured ": null
    },
    {
        "whey proteins": "whey protein"
    },
    {
        " and other changes to create ideal and economical pizza cheeses. In 1997, it was estimated that annual production of pizza cheese products was 2 billion pounds in the United States and 200 million pounds in Europe, and in 2000 demand for the product in Europe was increasing by 8% per year. The trend of steadily-increasing production and consumption of mozzarella and pizza cheese continued into the first decade of the 21st century in the United States.          The International Dictionary of Food and Cooking defines pizza cheese as a soft spun-curd cheese similar to Mozzarella made from cows milk... that is ...used particularly for pizzas and contains somewhat less water than real Mozzarella...  Most are at least 95 percent ": null
    },
    {
        "Mozzarella": "mozzarella"
    },
    {
        ",  with different moisture and fat densities. Cheese for ": null
    },
    {
        "frozen pizzas": "pizzafrozen pizza"
    },
    {
        " may be comminuted, in which the cheese is processed into minute granules or fragments.  Low-moisture Mozzarella can be formulated specifically for pizza.   Cheese may be processed into blocks, from which the product can be grated, made into granules or sliced for use on pizza   or other foods. Pizza cheese frequently consists of a blend of two or more cheeses, such as low-moisture Mozzarella or Provolone. Low-moisture Mozzarella was first manufactured in dairy factories in the Midwestern United States, and was originally called pizza cheese .  Compared to standard Mozzarella, low-moisture Mozzarella has a firmer ": null
    },
    {
        "texture": "food rheology"
    },
    {
        ", is easier to grate, has better browning and melting characteristics, and is less ": null
    },
    {
        "perishable": "decompositionfood decomposition"
    },
    {
        ".     Globally, Mozzarella is the most popular pizza cheese. However, it has been estimated that in the United States only 30% of all pizza cheese used is actual Mozzarella. ": null
    },
    {
        "Provolone": "provolone"
    },
    {
        " is the second most popular one. ": null
    },
    {
        "Cheddar": "cheddar cheese"
    },
    {
        " may be mixed with Mozzarella to preserve chewiness. Grated ": null
    },
    {
        "Parmesan": "parmigiano-reggiano"
    },
    {
        " may be added to the top of a pizza, and typically does not melt well when cooked. A diverse variety of ": null
    },
    {
        "processed": "processed cheese"
    },
    {
        " pizza cheeses are produced, including analogue cheese. ": null
    },
    {
        "Provel": "provel"
    },
    {
        " is one example. Other pizza cheeses include ": null
    },
    {
        "Emmental": "emmental cheese"
    },
    {
        ", ": null
    },
    {
        "Romano": "pecorino romano"
    },
    {
        " and ": null
    },
    {
        "Ricotta": "ricotta"
    },
    {
        " for ": null
    },
    {
        "calzones": "calzone"
    },
    {
        "or as a topping.     Several cheeses may be mixed together in its formulation, and each has individual browning and blistering characteristics. For example, a combination of Mozzarella and Cheddar may blister less when cooked compared to other combinations, because cheddar has less elasticity, while Mozzarella and provolone may brown less compared to other combinations.               ": null
    },
    {
        "Pasteurized": "pasteurization"
    },
    {
        " and processed cheese-like products for pizza that are quicker and cheaper to produce than real cheese  and designed to melt well and remain chewy are used on many ": null
    },
    {
        "mass-produced": "mass production"
    },
    {
        " pizzas in North America and the United Kingdom.   These products are referred to as analogue  pizza cheese;  in the UK the term cheese analogue is used, making clear that it is not actually cheese. In the book Technology of Cheesemaking, editors Law and Tamimethat state that analogue pizza cheese appears to be the leading type of ": null
    },
    {
        "cheese analogue": "cheese analogue"
    },
    {
        " produced globally.  Each year in the United States, 700 million frozen pizzas are sold, three-quarters of which contain cheese substitutes.      Analogue pizza cheeses may be formulated for processing with less sophisticated ": null
    },
    {
        "cheese-making": "cheesemaker"
    },
    {
        " equipment than is required for Mozzarella cheese, such as using simple mixing and molding.  They tend to have a soft texture and once melted, may have a slightly stringy quality when pulled or bitten into. They may lack in a fusion, or melting together of the shredded product when cooked, in which the cheese gels together. New stabilizer systems have been developed that have helped to enable the creation of analogue pizza cheeses.      An example of a processed pizza cheese is ": null
    },
    {
        "Provel": "provel cheese"
    },
    {
        ", which uses ": null
    },
    {
        "Cheddar": "cheddar cheese"
    },
    {
        ", ": null
    },
    {
        "Swiss": "swiss cheese"
    },
    {
        ", and ": null
    },
    {
        "Provolone": "provolone"
    },
    {
        " cheeses as flavorants.  Some analogue types are made with ": null
    },
    {
        "casein": "casein"
    },
    {
        ", a by-product of milk, and vegetable oil, rather than milk fat.  Casein-based Mozzarella-like imitation processed cheeses prepared using rennet are also used as a Mozzarella substitute on frozen pizzas.     In some instances, the production of analogue pizza cheese can be similar to the production of cream cheese, although production may be different and ": null
    },
    {
        "homogenization": "homogenization"
    },
    {
        " may be avoided. In some varieties, the product is heated to remain at a specific temperature and for a specific amount of time, which causes the proteins in the mix to gelatinize. During this process, salts in the mix serve to ": null
    },
    {
        "emulsify": "emulsion"
    },
    {
        " it and thus improve the meltability of the final product. The heated product is then placed in packaging such as bags-in-boxes while still hot, as it is more easily handled in this state compared to when in a solid state. During packaging, these types of pizza cheeses are then quick-cooled to avoid browning of the product, which can occur via the ": null
    },
    {
        "Maillard reaction": "maillard reaction"
    },
    {
        ".            Manufacturers and academics have conducted studies and experiments in an effort to improve the stretchiness, melting characteristics, browning, fat content and water retention of pizza cheese. Several ": null
    },
    {
        "patents": "patent"
    },
    {
        "exist for specialized varieties of pizza cheese and for its processing.    A study by Rudan and Barbano found that the addition of a thin layer of vegetable oil atop low- and reduced-fat pizza cheese increased meltability and reduced browning and dehydration when the product was cooked, but the texture remained overly chewy and tough. A study by Perry et al. found various methods to heighten the melt of low-fat pizza cheese by increasing its moisture, including the use of pre-acidification, fat-replacers, and exopolysaccharide starter cultures as well as higher pasteurization temperatures.     Manufacturers aim for a moisture content of 50-to-52 percent and a fat-in-dry-matter content of 35-to-40 percent.  A study published in the International Journal of Food & Science Technology found that a 12.5:87.5 blend of ": null
    },
    {
        "vetch": "vetch"
    },
    {
        " milk and bovine milk improved stretchiness and melting characteristics.  Vetch is a ": null
    },
    {
        "legume": "legume"
    },
    {
        " that has seeds which are similar to lentils.  An experiment published in the International Journal of Dairy Technology suggested that the level of ": null
    },
    {
        "galactose": "galactose"
    },
    {
        ", a ": null
    },
    {
        "monosaccharide": "monosaccharide"
    },
    {
        " sugar": "carbohydrate"
    },
    {
        " that is less ": null
    },
    {
        "sweet": "sweetness"
    },
    {
        " than ": null
    },
    {
        "glucose": "glucose"
    },
    {
        " and ": null
    },
    {
        "fructose": "fructose"
    },
    {
        ", can be reduced using different culture techniques. An article in the International Journal of Food Engineering found that ": null
    },
    {
        "trisodium citrate": "trisodium citrate"
    },
    {
        ", a ": null
    },
    {
        "food additive": "food additive"
    },
    {
        " used to preserve and add flavor to foods, slightly improved the preferred qualities of pizza cheese. Research published in Dairy Industries International suggested that denatured whey proteins increased moisture retention, but that the improvements were very slight and not economically worthwhile relative to the minor improvements.     Some consumers prefer pizza cheese with less browning, which can be achieved using low-moisture part-skim Mozzarella with a low galactose content. Galactose is a type of ": null
    },
    {
        "sugar": "sugar"
    },
    {
        " found in ": null
    },
    {
        "dairy products": "dairy product"
    },
    {
        "and other foods that is less sweet than glucose. Sugar in foods can lead to ": null
    },
    {
        "caramelization": "caramelization"
    },
    {
        " when they are cooked, which increases their browning. Some varieties derived from skim mozzarella variants were designed not to require aging or the use of ": null
    },
    {
        "fermentation starter": "fermentation starter"
    },
    {
        ".  Others can be produced through the direct acidification of milk, which may be used in place of bacterial ": null
    },
    {
        "fermentation": "fermentation in food processing"
    },
    {
        ".       In the United States, the production and consumption of Mozzarella and pizza cheese steadily increased in the mid-20th century, and this trend has continued into the first decade of the 21st century.  In the U.S., several hundred million pounds of pizza cheese is consumed annually. In 1997, it was estimated that annual production of the product was 1 million tons in the United States and 100,000 tonnes in Europe.  It has been estimated that 30% of all pizza cheese used in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " is ": null
    },
    {
        "Mozzarella": "mozzarella"
    },
    {
        " cheese.  As of 2000, demand for the product was growing in Europe by 8 percent per year.     Mass-produced pizza cheese is used by the ": null
    },
    {
        "foodservice": "foodservice"
    },
    {
        " industry, ": null
    },
    {
        "quick service restaurant": "quick service restaurant"
    },
    {
        "s, and other industries and businesses. The worlds largest manufacturer of pizza cheese, ": null
    },
    {
        "Leprino Foods Company": "leprino foods"
    },
    {
        ", processes 600,000 tonnes a year. Leprino Foods holds patents for some specialized Mozzarella production processes that enable the quick manufacture of the product.  One such product is a frozen shredded cheese used for pizza that is created in a few hours from milk.  Other U.S. companies also mass-produce pizza cheese, which is shipped in a frozen state.   As of 2000, ": null
    },
    {
        "Glanbia": "glanbia"
    },
    {
        " is the largest producer of pizza cheese in Europe. Some retail and commercially mass-produced frozen pizzas have cheese stuffed into the pizza crust.          Significant amounts of pizza cheese are used in Europe, Australia, New Zealand and the United States. Whole milk mozzarella is popular in pizzas in the East and Southwest regions of the U.S., while one survey showed that Provolone was more popular on the east and west coast. Cheddar may be used more in the Eastern and Southern regions of the U.S. Provel cheese is typically used in the preparation of ": null
    },
    {
        "St. Louis-style pizza": "st. louis-style pizza"
    }
]