[
    {
        "         The piña colada  is a sweet ": null
    },
    {
        "cocktail": "Cocktail"
    },
    {
        " made with ": null
    },
    {
        "rum": "Rum"
    },
    {
        ", ": null
    },
    {
        "cream of coconut": "Cream Of Coconut"
    },
    {
        " or ": null
    },
    {
        "coconut milk": "Coconut Milk"
    },
    {
        ", and ": null
    },
    {
        "pineapple juice": "Pineapple Juice"
    },
    {
        ", usually served either blended or shaken with ice. It may be garnished with either a pineapple wedge, ": null
    },
    {
        "maraschino cherry": "Maraschino Cherry"
    },
    {
        ", or both.   There are two versions of the drinks origin, but both say it originated in ": null
    },
    {
        "Puerto Rico": "Puerto Rico"
    },
    {
        ".       The name piña colada  literally means strained pineapple , a reference to the freshly pressed and strained pineapple juice used in the drinks preparation.          The earliest known story states that in the 19th century, Puerto Rican pirate ": null
    },
    {
        "Roberto Cofresí": "Roberto Cofresí"
    },
    {
        ", to boost his crews morale, gave them a beverage or cocktail that contained coconut, pineapple and white rum.  This was what would be later known as the famous piña colada. With his death in 1825, the recipe for the piña colada was lost. Historian Haydée Reichard disputes this version of the story.     In 1950  The New York Times  reported that Drinks in the West Indies range from Martiniques famous rum punch to Cubas pina colada .      The ": null
    },
    {
        "Caribe Hilton Hotel": "Caribe Hilton Hotel"
    },
    {
        " claims Ramón Monchito Marrero created the Piña Colada in 1954 while a bartender at the hotel. According to this account, Mr. Marrero finally settled upon the recipe for the Piña Colada, which he felt captured the true nature and essence of Puerto Rico.  The hotel was presented with a proclamation in 2004 by Puerto Rico Governor ": null
    },
    {
        "Sila M. Calderón": "Sila M. Calderón"
    },
    {
        " celebrating the drinks 50th anniversary.       Barrachina, a restaurant in Puerto Rico, says that a traditional Spanish bartender Don Ramon Portas Mingot in 1963 created what became the worlds famous drink: the Piña Colada.       In 1978 Puerto Rico proclaimed the cocktail its official drink.         National Piña Colada Day is celebrated on the islands on 10 July.     This cocktail gained fame in Puerto Rico from 1978, and it gained worldwide fame after ": null
    },
    {
        "Rupert Holmes": "Rupert Holmes"
    },
    {
        " released his 1979 song ": null
    },
    {
        "Escape ": "Escape"
    },
    {
        " , which became a popular hit around the world.       Jazz icon and ": null
    },
    {
        "flugelhorn": "Flugelhorn"
    },
    {
        " player ": null
    },
    {
        "Chuck Mangione": "Chuck Mangione"
    },
    {
        " likewise released a tune titled Piña Colada on his 1979 album  Fun and Games .     The cocktail serves as part of the title of the ": null
    },
    {
        "Garth Brooks": "Garth Brooks"
    },
    {
        " song ": null
    },
    {
        "Two Piña Coladas": "Two Piña Coladas"
    },
    {
        " .          As recounted by his friends in José L. Díaz de Villegass book, the original Monchito recipe was to pour 85 grams of cream of coconut, 170 grams of pineapple juice and 43 grams of white rum into a ": null
    },
    {
        "blender": "Blender"
    },
    {
        " or shaker with crushed ice, blend or shake very well until smooth, then pour into chilled glass and garnish with pineapple wedge and/or a maraschino cherry.   Longdrink     There are many recipes for piña colada. The ": null
    },
    {
        "International Bartenders Association": "International Bartenders Association"
    },
    {
        " specifies it is:   ;Ingredients    ": null
    },
    {
        "white rum": "Light Rum"
    },
    {
        "  coconut cream    ": null
    },
    {
        "pineapple juice": "Pineapple Juice"
    },
    {
        "     ;Method   Mix with crushed ice in blender until smooth, then pour into a chilled glass, garnish and serve. Alternately, the three main components can simply be added to a cocktail glass with ice cubes.      In ": null
    },
    {
        "San Juan, Puerto Rico": "San Juan, Puerto Rico"
    },
    {
        " the recipe is:   ;Ingredients    ": null
    },
    {
        "heavy cream": "Creamunited States"
    },
    {
        "  freshly pressed pineapple juice    ": null
    },
    {
        "cream of coconut": "Cream Of Coconut"
    },
    {
        "  rum": "Rum"
    },
    {
        "    crushed ice": "Ice Cubecrushed Ice"
    },
    {
        "   ;Method   In a blender, combine cream of coconut, pineapple juice, heavy cream and rum. Add crushed ice and blend for 15 seconds. Pour in a desired 12-ounce container and use a cherry and fresh pineapple for a garnish.       Different proportions of the core ingredients, as well as different types of rum, may all be used in the piña colada. Frozen piña coladas are also served. Other named variations include:   Amaretto colada – ": null
    },
    {
        "amaretto": "Amaretto"
    },
    {
        " substituted for rum    Chi chi – with ": null
    },
    {
        "vodka": "Vodka"
    },
    {
        " substituted for rum   Lava Flow – strawberry ": null
    },
    {
        "daiquiri": "Daiquiri"
    },
    {
        " and piña colada blended together    Virgin piña colada or piñita colada – without the rum, thus non-alcoholic   Kiwi colada – with ": null
    },
    {
        "kiwifruit": "Kiwifruit"
    },
    {
        " in place of pineapple juice   Soda colada – resembles original recipe but soda is used instead of coconut milk   Kahlua colada – Substitute Kahlua for rum.   Scotsman colada – Substitute Scotch for rum.    ": null
    },
    {
        "Staten Island Ferry": "Staten Island Ferry"
    },
    {
        " is a cocktail consisting of equal parts ": null
    },
    {
        "Malibu": "Malibu"
    },
    {
        " and pineapple juice served over ice. In flavor it resembles a Piña Colada . As it does not require cream of coconut, it is thus more easily prepared in bars that lack the specialty ingredients and blender that a Piña Colada would typically require.   A ": null
    },
    {
        "Blue Hawaiian": "Blue Hawaiian"
    },
    {
        " differs from a piña colada mainly by including ": null
    },
    {
        "blue Curaçao": "Curaçao"
    }
]