[
    {
        "In ": null
    },
    {
        "physics": "physics"
    },
    {
        ", a plane wave is a special case of ": null
    },
    {
        "wave": "wave"
    },
    {
        " or ": null
    },
    {
        "field": "field"
    },
    {
        ": a physical quantity whose value, at any moment, is constant over any plane that is perpendicular to a fixed direction in space.     For any position \\vec x in space and any time t , the value of such a field can be written as   : F G,   where \\vec n is a ": null
    },
    {
        "unit-length vector": "unit vector"
    },
    {
        ", and G is a function that gives the fields value as from only two ": null
    },
    {
        "real": "real number"
    },
    {
        " parameters: the time t , and the displacement d \\vec x \\cdot \\vec n of the point \\vec x along the direction \\vec n . The latter is constant over each plane perpendicular to \\vec n .     The values of the field F may be scalars, vectors, or any other physical or mathematical quantity. They can be ": null
    },
    {
        "complex numbers": "complex numbers"
    },
    {
        ", as in a ": null
    },
    {
        "complex exponential plane wave": "complex exponential plane wave"
    },
    {
        ".     When the values of F are vectors, the wave is said to be a ": null
    },
    {
        "longitudinal wave": "longitudinal wave"
    },
    {
        " if the vectors are always collinear with the vector \\vec n , and a ": null
    },
    {
        "transverse wave": "transverse wave"
    },
    {
        " if they are always orthogonal to it.                Often the term plane wave refers specifically to a ": null
    },
    {
        "traveling plane wave": "traveling plane wave"
    },
    {
        ", whose evolution in time can be described as simple translation of the field at a constant wave speed c along the direction perpendicular to the wavefronts. Such a field can be written as   : FG\\left\\,   where G is now a function of a single real parameter u d - c t , that describes the profile of the wave, namely the value of the field at time t 42 , for each displacement d \\vec x \\cdot \\vec n /math math /math  math /math math /math math /math  math /math math /math  math /math  math /math math /math  math /math math /math  math /math math /math math /math math /math math /math math /math math /math math /math math /math math /math math /math math /math math /math  math /math math /math math /math math /math math /math ": null
    }
]