[
    {
        "Play-by-mail games, or play-by-post games, are ": null
    },
    {
        "game": "game"
    },
    {
        "s, of any type, played through postal ": null
    },
    {
        "mail": "mail"
    },
    {
        " or ": null
    },
    {
        "email": "email"
    },
    {
        ".     ": null
    },
    {
        "Correspondence chess": "correspondence chess"
    },
    {
        " has been played by mail for centuries. The boardgame  Diplomacy  has been played by mail since the 1960s, starting with a printed newsletter  written by ": null
    },
    {
        "John Boardman": "john boardman"
    },
    {
        ". More complex games, moderated entirely or partially by computer programs, were pioneered by ": null
    },
    {
        "Rick Loomis": "rick loomis"
    },
    {
        " of ": null
    },
    {
        "Flying Buffalo": "flying buffalo"
    },
    {
        " in 1970. The first such game offered via major email services was  WebWar II  from Neolithic Enterprises who accepted email turns from all of the major email services including ": null
    },
    {
        "CompuServe": "compuserve"
    },
    {
        " in 1983.     Play by mail games are often referred to as PBM games, and play by email is sometimes abbreviated PBeM—as opposed to face to face or over the board games which are played in person. Another variation on the name is ": null
    },
    {
        "play-by-Internet": "play-by-internet"
    },
    {
        " or play-by-web . In all of these examples, player instructions can be either executed by a human moderator, a computer program, or a combination of the two.      In the 1980s, play-by-mail games reached their peak of popularity with the advent of  Gaming Universal , Paper Mayhem and  Flagship magazine , the first professional magazines devoted to play-by-mail games.  Bob McLain, the publisher and editor of Gaming Universal, further popularized the hobby by writing articles that appeared in many of the leading mainstream gaming magazines of the time. Flagship later bought overseas right to Gaming Universal, making it the leading magazine in the field. Flagship magazine was founded by Chris Harvey and ": null
    },
    {
        "Nick Palmer": "nick palmer"
    },
    {
        ". The magazine still exists, under a new editor, but health concerns have led to worries over the publications long term viability.     In the late 1990s, computer and Internet games marginalized play-by-mail conducted by actual postal mail, but the postal hobby still exists with an estimated 2000–3000 adherents worldwide.          Postal gaming developed as a way for geographically separated gamers to compete with each other. It was especially useful for those living in isolated areas and those whose tastes in games were uncommon.     In the case of a two player game such as ": null
    },
    {
        "chess": "chess"
    },
    {
        ", players would simply send their moves to each other alternately. In the case of a multi-player game such as  Diplomacy , a central ": null
    },
    {
        "game master": "game master"
    },
    {
        " would run the game, receiving the moves and publishing adjudications. Such adjudications were often published in postal game ": null
    },
    {
        "zine": "zine"
    },
    {
        "s, some of which contained far more than just games.     The commercial market for play-by-mail games grew to involve computer servers set up to host potentially thousands of players at once. Players would typically be split up into parallel games in order to keep the number of players per game at a reasonable level, with new games starting as old games ended. A typical closed game session might involve one to two dozen players, although some games claimed to have as many as five hundred people simultaneously competing in the same game world. While the central company was responsible for feeding in moves and mailing the processed output back to players, players were also provided with the mailing addresses of others so that direct contact could be made and negotiations performed. With turns being processed every few weeks , more advanced games could last over a year.     Game themes are heavily varied, and may range from those based on historical or real events to those taking place in alternate or fictional worlds.     One of the most successful and longest running PBM games is TribeNet, a strategy game with themes of exploration, trade and warfare. TribeNet was launched by Jeff Perkins as a PBM in 1985 and was transformed by Peter Rzechorzek into a PBeM when he took over the game in 1997. Peter has remained in charge for over twenty years.     The onset of the computer-moderated PBM game  inevitably meant that the human moderated games became boutique games with little chance of matching the gross revenues that larger, automated games could produce.       The mechanics of play-by-mail games require that players think and plan carefully before making moves. Because planned actions can typically only be submitted at a fixed maximum frequency , the number of discrete actions is limited compared to real-time games. As a result, players are provided with a variety of resources to assist in turn planning, including game aids, maps, and results from previous turns. Using this material, planning a single turn may take a number of hours.     Actual move/turn submission is traditionally carried out by filling in a turn card. This card has formatted entry areas where players enter their planned actions for the upcoming turn. Players are limited to some finite number of actions, and in some cases must split their resources between these actions . The way the card is filled in often implies an ordering between each command, so that they are processed in-order, one after another. Once completed, the card is then mailed to the game master, where it is either processed, or held until the next turn processing window begins.     By gathering turn cards from a number of players and processing them all at the same time, games can provide simultaneous actions for all players. However, for this same reason, co-ordination between players can be difficult to achieve. For example, player A might attempt to move to player Bs current location to do something with player B, while player B might simultaneously attempt to move to player As current location. As such, the output/results of the turn can differ significantly from the submitted plan. Whatever the results, they are mailed back to the player to be studied and used as the basis for the next turn .     While billing is sometimes done using a flat per-game rate , games more typically use a per-turn cost schedule. In such cases, each turn submitted depletes a pool of credit which must periodically be replenished in order to keep playing. Some games have multiple fee schedules, where players can pay more to perform advanced actions, or to take a greater number of actions in a turn.     Some role-playing PBM games also include an element whereby the player may describe actions of their characters in a free text form. The effect and effectiveness of the action is then based on the judgement of the GM who may allow or partially allow the action. This gives the player more flexibility beyond the normal fixed actions at the cost of more complexity and, usually, expense.       With the rise of the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ", ": null
    },
    {
        "email": "email"
    },
    {
        " and ": null
    },
    {
        "websites": "websites"
    },
    {
        " have largely replaced postal gaming and postal games zines. Play-by-email games differ from popular online multiplayer games in that, for most computerized multiplayer games, the players have to be online at the same time - also known as synchronous play. With a play-by-mail game, the players can play whenever they choose, since responses need not be immediate; this is sometimes referred to as ": null
    },
    {
        "turn-based gaming": "turn-based gaming"
    },
    {
        " and is common among ": null
    },
    {
        "browser-based": "browser game"
    },
    {
        " games. Some ": null
    },
    {
        "video games": "video game"
    },
    {
        "can be played in turn-based mode: one player makes a move, declaring it by email, and then the turn passes to another player who to makes his or her move. Depending on the game, a PBEM Aide may be available as an alternative to describing the move with text. Such an aide generally consists of a picture of the board along with movable playing pieces, cards, etc. A player moves the pieces as desired and then can either save a static picture of the new game state, or a replay sequentially showing all changes that transpired during his turn, and send this to his opponent.     Several non-commercial email games played on the ": null
    },
    {
        "Internet": "internet"
    },
    {
        " and ": null
    },
    {
        "BITNET": "bitnet"
    },
    {
        " predate these. Some cards games like poker can also be played by email using cryptography, such as with ": null
    },
    {
        "FXTOP": "fxtop"
    },
    {
        ".         An increasingly popular format for play-by-email games is play-by-web. As with play-by-email games the players are notified by email when it becomes their turn, but they must then return to the games website to continue playing. The game may be either ": null
    },
    {
        "browser-based": "browser game"
    },
    {
        " or a ": null
    },
    {
        "video game": "video game"
    },
    {
        ". The main advantage of this is that the players can be presented with a graphical representation of the game and an interactive interface to guide them through their turn. Since the notifications only have to remind the players that it is their turn they can just as easily be sent via ": null
    },
    {
        "instant messaging": "instant messenger"
    },
    {
        ".     Some sites have extended this gaming style by allowing the players to see each others actions as they are made. This allows for real time playing while everyone is online and active, or slower progress if not.     Increasingly, this format is being adopted by social and mobile games, often described using the term asynchronous multiplayer .     Some video games, such as ": null
    },
    {
        "Civilization": "civilization"
    }
]