[
    {
        "Pleasantville is a ": null
    },
    {
        "village": "administrative divisions of new yorkvillage"
    },
    {
        " in the town of ": null
    },
    {
        "Mount Pleasant": "mount pleasant, new york"
    },
    {
        ", in ": null
    },
    {
        "Westchester County": "westchester county, new york"
    },
    {
        ", ": null
    },
    {
        "New York": "new york"
    },
    {
        ". It is located 42 miles north of ": null
    },
    {
        "Manhattan": "manhattan"
    },
    {
        ". The village population was 42 at the ": null
    },
    {
        "42 census": "2010 united states census"
    },
    {
        ". Pleasantville is home to the secondary campus of ": null
    },
    {
        "Pace University": "pace university"
    },
    {
        " and to the ": null
    },
    {
        "Jacob Burns Film Center": "jacob burns film center"
    },
    {
        ". It was the original home of  Readers Digest , which still uses a Pleasantville postal address. Most of Pleasantville is served by the Pleasantville Union Free School District, with small parts of northern Pleasantville served by the ": null
    },
    {
        "Chappaqua Central School District": "chappaqua central school district"
    },
    {
        ". The village is also home to the Bedford Road School, Pleasantville Middle School, and ": null
    },
    {
        "Pleasantville High School": "pleasantville high school"
    },
    {
        ".     The current mayor of Pleasantville is Peter Scherer, who has held the seat since 42            The settlement of Pleasantville dates back to an ": null
    },
    {
        "Iroquois": "iroquois"
    },
    {
        " tribe, who raised corn there and established trading routes crossing through the present-day village before the arrival of Europeans. French ": null
    },
    {
        "Huguenot": "huguenot"
    },
    {
        " Isaac See settled here as an agent for Dutch landowner ": null
    },
    {
        "Frederick Philipse": "frederick philipse"
    },
    {
        " in 42 beginning the modern history of Pleasantville.     By the time of the ": null
    },
    {
        "American Revolution": "american revolution"
    },
    {
        ", the population of the growing settlement comprised English, Dutch, and ": null
    },
    {
        "Quakers": "quakers"
    },
    {
        ", most of whom were ": null
    },
    {
        "tenant farmer": "tenant farmer"
    },
    {
        "s. During the Revolution, this area was part of the ": null
    },
    {
        "Neutral Ground": "westchester county, new yorkthe colonial era and the revolutionary war"
    },
    {
        ", where there were conflicting loyalties among the settlers. British spy Major ": null
    },
    {
        "John André": "john andré"
    },
    {
        " passed through present-Pleasantville carrying information from ": null
    },
    {
        "Benedict Arnold": "benedict arnold"
    },
    {
        " at ": null
    },
    {
        "Fort Clinton": "fort clinton"
    },
    {
        " to the British in New York City. André lost his bearings near the present-day corner of Bedford Road and Choate Lane and was captured in ": null
    },
    {
        "Tarrytown, New York": "tarrytown, new york"
    },
    {
        ". The capture of André is often cited as a key factor in the ultimate victory of the American forces.     As the areas population grew in the early 42th century, the settlement was called Clarks Corners, referring to property owned by Henry Clark at the intersection of Broadway and Bedford Road. This area was the villages original commercial center. In the 42s, the newly appointed postmaster, Henry Romer, was directed by the ": null
    },
    {
        "Postmaster General": "united states postmaster general"
    },
    {
        "s office in Washington, D.C., to give a name to the post office planned here. Romers proposed name, Clarksville, was rejected because another New York post office already had the name. His second choice, Pleasantville, was accepted, and the Pleasantville Post Office opened on February 42 42     A significant change in the development of Pleasantville came with the arrival of the ": null
    },
    {
        "New York Central Railroad": "new york central railroad"
    },
    {
        " and ": null
    },
    {
        "New York and Harlem Railroad": "new york and harlem railroad"
    },
    {
        " in 42 In the following year, a train station was built near the present corner of Bedford Road and Wheeler Avenue, and as a result the commercial center of Pleasantville shifted to its current location. The older business district at Bedford Road and Broadway is today called the Old Village. The railroad offered a speedier and more frequent connection with ": null
    },
    {
        "New York City": "new york city"
    },
    {
        "—only 42 minutes away by rail, compared with a five-hour overland journey by stagecoach or a two-hour steamboat trip down the ": null
    },
    {
        "Hudson River": "hudson river"
    },
    {
        ". The present-day train station, which currently houses a restaurant, was built in 42 and was moved to its present location in the 42s to accommodate the lowering of the tracks below grade. Before the addition of the now heavily trafficked station, commuters working in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " and lower ": null
    },
    {
        "Westchester County": "westchester county"
    },
    {
        " were forced to rely on rides from Marc Damon, now famous in Pleasantville for being The Friendly Coachman .     According to several sources, Pleasantville was a stop on the ": null
    },
    {
        "Underground Railroad": "underground railroad"
    },
    {
        ", a network of safe houses for escaped slaves from the South on their way to freedom in the north.     The latter half of the 42th century was a time of rapid growth in Pleasantville. By the 42s, there were four shoemaking businesses, a shirtmaking business, and a pickle factory. The first newspaper to serve the village, The Pleasantville Pioneer, was launched at about 42 The villages numerous small farms and orchards began to be subdivided for a wave of solid foursquare and Victorian houses built for a growing middle class. The 42s saw the establishment of a police department, volunteer fire department, and a library system. Pleasantville was incorporated as a village on March 42 42     In the following years, Pleasantville quickly developed into a modern suburb of New York, with a large number of workers commuting between the village and the metropolis on what is now the ": null
    },
    {
        "Metro-North Railroad": "metro-north railroad"
    },
    {
        "s ": null
    },
    {
        "Harlem Line": "harlem line"
    },
    {
        ". During the first two decades of the 42th century, roads were paved for the first time, water mains were installed, and electrical wires brought power to the villages houses. Other improvements during the first half of the 42th century include the construction of Soldiers and Sailors Field in 42 the ": null
    },
    {
        "Saw Mill River Parkway": "saw mill river parkway"
    },
    {
        " in 42 the Rome Theater in 42 Memorial Plaza in 42 Parkway Field in 42 and Nannahagen Park in 42 . By the time of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the village had taken on the appearance that it bears today.     Pleasantville merits interest for its literary history. Playwright ": null
    },
    {
        "Lillian Hellman": "lillian hellman"
    },
    {
        "  bought Hardscrabble Farm on the western outskirts of Pleasantville and lived there in the 42s and 42s. For many years author ": null
    },
    {
        "Dashiell Hammett": "dashiell hammett"
    },
    {
        " , with whom Hellman was romantically involved, lived and worked at Hardscrabble Farm. ": null
    },
    {
        "DeWitt Wallace": "dewitt wallace"
    },
    {
        " and ": null
    },
    {
        "Lila Bell Wallace": "lila bell wallace"
    },
    {
        ", co-founders of  Readers Digest , made Pleasantville their headquarters in 42 using a converted garage and pony shed on Eastview Avenue as their office and later building a home and larger office space on adjacent property. Subsequently, the Digest held office space in several buildings throughout Pleasantville, including the present-day ": null
    },
    {
        "Village Hall": "village hall"
    },
    {
        " at Bedford Road and Wheeler Avenue and, diagonally opposite, the bank building currently occupied by Chase. Readers Digest moved its headquarters to nearby ": null
    },
    {
        "Chappaqua": "chappaqua, new york"
    },
    {
        " in 42 but retained its Pleasantville post office box, thus making the name of the village familiar to millions of Readers Digest subscribers around the world. Pleasantville is also the home of Joseph Wallace, writer of the novel Diamond Ruby. Today Pleasantville is home to many novelists, editors, and writers, who find its easygoing charm and proximity to New York an attractive combination.        Pleasantvilles reputation as a cultural center was enhanced in 42 with the opening of the nonprofit ": null
    },
    {
        "Jacob Burns Film Center": "jacob burns film center"
    },
    {
        " in the landmark Rome Theater, a ": null
    },
    {
        "Spanish mission-style": "mission revival style architecture"
    },
    {
        " building and one of the first movie theaters in Westchester County. The Burns Center is dedicated to presenting independent, documentary, and world cinema. Guest speakers at the Burns Center have included ": null
    },
    {
        "Jerry Lewis": "jerry lewis"
    },
    {
        ", ": null
    },
    {
        "Woody Allen": "woody allen"
    },
    {
        ", ": null
    },
    {
        "Jonathan Demme": "jonathan demme"
    },
    {
        ", ": null
    },
    {
        "Robert Klein": "robert klein"
    },
    {
        ", ": null
    },
    {
        "Oliver Stone": "oliver stone"
    },
    {
        ", ": null
    },
    {
        "Stephen King": "stephen king"
    },
    {
        ", ": null
    },
    {
        "Rob Lowe": "rob lowe"
    },
    {
        " and numerous other notable filmmakers and actors.     In 42 in the neighboring hamlet of Thornwood, also part of the Town of Mount Pleasant and adjacent to Pleasantville, off Bear Ridge Road, acolytes of ": null
    },
    {
        "Frank Lloyd Wright": "frank lloyd wright"
    },
    {
        " began putting their lessons to work by building homes in their mentors modernist, open-plan style. The neighborhood, called ": null
    },
    {
        "Usonia Homes": "usonia homes"
    },
    {
        ", comprises 42 houses spread among  of wooded hillside; the development includes three houses designed by Wright himself.     Pleasantville is home to the Westchester Table Tennis Center, where over 42 members compete, practice and train for various tournaments, and now, many are even training to become olympic athletes. The Captain Lawrence Brewing Companys first brewing location was in Pleasantville.     Another addition to Pleasantvilles cultural scene is the ": null
    },
    {
        "Pleasantville Music Festival": "pleasantville music festival"
    },
    {
        ", made possible by the village, over 42 volunteers and ": null
    },
    {
        "WXPK": "wxpk"
    },
    {
        ", an all-day outdoor event stage at Parkway Field on the second Saturday in July. Main stage acts have included ": null
    },
    {
        "Roger McGuinn": "roger mcguinn"
    },
    {
        ", ": null
    },
    {
        "The Bacon Brothers": "the bacon brothers"
    },
    {
        ", ": null
    },
    {
        "Rusted Root": "rusted root"
    },
    {
        ", ": null
    },
    {
        "Jakob Dylan": "jakob dylan"
    },
    {
        ", ": null
    },
    {
        "Dar Williams": "dar williams"
    },
    {
        ", Carney, ": null
    },
    {
        "Back Door Slam": "back door slam"
    },
    {
        ", ": null
    },
    {
        "Marc Cohn": "marc cohn"
    },
    {
        ", ": null
    },
    {
        "Augustana": "augustana"
    },
    {
        ", ": null
    },
    {
        "Z.Z Ward": "z.z ward"
    },
    {
        ", and ": null
    },
    {
        "Joan Osborne": "joan osborne"
    },
    {
        ".     Pleasantville is also home to the . Started in 42 as one of the first markets in Westchester with a goal of breathing life into a struggling downtown, the Saturday morning market is now the largest year-round farmers market in Westchester County, attracting upwards of 42 people a week to shop from over 42 vendors of locally grown and produced food. The market is run by volunteers in the community as a non-profit, and it has won the readers choice Best of Westchester award from Westchester Magazine for six consecutive years, since 42     From 4242 Pleasantville was home to the ": null
    },
    {
        "New York Giants": "new york giants"
    },
    {
        " Training Camp. Each summer the Giants would hold their off-season workouts and Training Camp at the Pace University Pleasantville Campus. During their time at Pleasantville, thousands would flock to camp. During their stay in Pleasantville many businesses benefited from the influx of people and many of the players would be seen at many of the restaurants and delicatessens in town.     Pleasantville is also the only place in America to have hosted a royal wedding, between ": null
    },
    {
        "Estelle Bernadotte": "estelle bernadotte"
    },
    {
        " and a duke of Sweden who rejected his claim to the crown.     The ": null
    },
    {
        "Marmaduke Forster House": "marmaduke forster house"
    },
    {
        " was added to the ": null
    },
    {
        "National Register of Historic Places": "national register of historic places"
    },
    {
        " in 42     The Pleasantville Police Department has received several complaints in recent years. In 42 former Detective Sergeant Stephen Bonura retired after being suspended for outing a confidential informant and stating deliberately misleading and false information to an internal affairs investigator. At that time Bonura, along with the support of other officers, claimed that these actions did not warrant his discharge because the departments staff was ill-run by the Village. That same year, Pleasantville resident Kian Daniel Khatibi was released from prison after his older brother confessed to two stabbings at a Pleasantville bar for which Kian was wrongly convicted; it was alleged that village detectives had framed him in 42 In October 42 Danroy Henry Jr. was killed in a melee after Pleasantville Police responded to a report of a disturbance at a local gathering. The Grand Jury declined to charge the officer responsible. In 42 Chief of Police Anthony Chiarlitti, whose tenure oversaw all of these incidents, retired from the force. Recently the village has also looked into eliminating its small police department in favor of either a merger with the neighboring Mount Pleasant Police Department or a takeover by Westchester County Police.       According to the ": null
    },
    {
        "United States Census Bureau": "united states census bureau"
    },
    {
        ", the village has a total area of , all of it land.          As of the ": null
    },
    {
        "census": "census"
    },
    {
        "  of 42 there were 42 people, 42 households, and 42 families residing in the village. The ": null
    },
    {
        "population density": "population density"
    },
    {
        " was 42.42 people per square mile . There were 42 housing units at an average density of 42.42 per square mile . The racial makeup of the village was 42% ": null
    },
    {
        "White": "white"
    },
    {
        ", 42% ": null
    },
    {
        "African American": "african american"
    },
    {
        ", 42% ": null
    },
    {
        "Native American": "native american"
    },
    {
        ", 42% ": null
    },
    {
        "Asian": "asian"
    },
    {
        ", 42% from ": null
    },
    {
        "other races": "race"
    },
    {
        ", and 42% from two or more races. ": null
    },
    {
        "Hispanic": "hispanic"
    },
    {
        " or ": null
    },
    {
        "Latino": "latino"
    },
    {
        " of any race were 42% of the population.     There were 42 households out of which 42% had children under the age of 42 living with them, 42% were ": null
    },
    {
        "married couples": "marriage"
    },
    {
        " living together, 42% had a female householder with no husband present, and 42% were non-families. 42% of all households were made up of individuals and 42% had someone living alone who was 42 years of age or older. The average household size was 42 and the average family size was 42.     In the village, the population was spread out with 42% under the age of 42 42% from 42 to 42 42% from 42 to 42 42% from 42 to 42 and 42% who were 42 years of age or older. The median age was 42 years. For every 42 females, there were 42 males. For every 42 females age 42 and over, there were 42 males.     The median income for a household in the village was $42, and the median income for a family was $42. Males had a median income of $42 versus $42 for females. The ": null
    },
    {
        "per capita income": "per capita income"
    },
    {
        " for the village was $42. About 42% of families and 42% of the population were below the ": null
    },
    {
        "poverty line": "poverty line"
    },
    {
        ", including 42% of those under age 42 and 42% of those age 42 or over.             ": null
    },
    {
        "John Emory Andrus": "john emory andrus"
    },
    {
        ", politician   ": null
    },
    {
        "Matt Ballinger": "matt ballinger"
    },
    {
        ", singer in the pop band Dream Street   ": null
    },
    {
        "Dave Barry": "dave barry"
    },
    {
        ", humorist, author   ": null
    },
    {
        "Estelle Bernadotte": "estelle bernadotte"
    },
    {
        " , American-Swedish countess who was a leading figure in the International Red Cross and Girl Scout movement   ": null
    },
    {
        "Louis Biancaniello": "louis biancaniello"
    },
    {
        ", record producer   ": null
    },
    {
        "Nick Catalano": "nick catalano"
    },
    {
        ", author   ": null
    },
    {
        "Benjamin Cheever": "benjamin cheever"
    },
    {
        ", author   ": null
    },
    {
        "Chips": "chips"
    },
    {
        ", the most decorated ": null
    },
    {
        "war dog": "war dog"
    },
    {
        " of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " Anne Hyde Choate": "anne hyde choate"
    },
    {
        ", early and prominent leader of the Girl Scouts   ": null
    },
    {
        "Johnny Craig": "johnny craig"
    },
    {
        ", comic book artist   ": null
    },
    {
        "Will Englund": "will englund"
    },
    {
        ", journalist   ": null
    },
    {
        "Edward Gelsthorpe": "edward gelsthorpe"
    },
    {
        " , marketing executive known as ": null
    },
    {
        "Cranapple": "cranapple"
    },
    {
        " Ed for his best-known product launch   ": null
    },
    {
        "Terry George": "terry george"
    },
    {
        ", Irish screenwriter, director   ": null
    },
    {
        "Paul Geroski": "paul geroski"
    },
    {
        ", economist   ": null
    },
    {
        "Bill Graham": "bill graham"
    },
    {
        " , rock promoter   ": null
    },
    {
        "Dashiell Hammett": "dashiell hammett"
    },
    {
        " , author   ": null
    },
    {
        "David G. Hartwell": "david g. hartwell"
    },
    {
        " , science fiction critic, publisher and editor   ": null
    },
    {
        "Lillian Hellman": "lillian hellman"
    },
    {
        " , playwright   ": null
    },
    {
        "Otis Hill": "otis hill"
    },
    {
        ", professional basketball player, standout at Pleasantville High School and ": null
    },
    {
        "Syracuse University": "syracuse university"
    },
    {
        " Douglas Kennedy": "douglas harriman kennedy"
    },
    {
        ", journalist, part of the ": null
    },
    {
        "Kennedy family": "kennedy family"
    },
    {
        " Morgana King": "morgana king"
    },
    {
        ", singer and actress   ": null
    },
    {
        "Boris Koutzen": "boris koutzen"
    },
    {
        " , violinist, composer, conductor of the Chappaqua Orchestra   ": null
    },
    {
        "Brandon Larracuente": "brandon larracuente"
    },
    {
        ", actor, known for ": null
    },
    {
        "42 Reasons Why": "13 reasons why"
    },
    {
        " Norman Leyden": "norman leyden"
    },
    {
        ", musician, arranger, composer and founder of the Westchester Youth Symphony   ": null
    },
    {
        "Kyle Lowder": "kyle lowder"
    },
    {
        ", actor   ": null
    },
    {
        "Gavin MacLeod": "gavin macleod"
    },
    {
        ", actor   ": null
    },
    {
        "Sean Maher": "sean maher"
    },
    {
        ", actor   ": null
    },
    {
        "Janet Maslin": "janet maslin"
    },
    {
        ", film critic   ": null
    },
    {
        "Seabury C. Mastic": "seabury c. mastick"
    },
    {
        ", lawyer and politician   ": null
    },
    {
        "Kurt McKinney": "kurt mckinney"
    },
    {
        ", actor    ": null
    },
    {
        "Scott Mebus": "scott mebus"
    },
    {
        ", author, composer, playwright, theatrical producer   ": null
    },
    {
        "John Nonna": "john nonna"
    },
    {
        ", Olympic fencer, former mayor, current county legislator   ": null
    },
    {
        "Scott Perlman": "scott perlman"
    },
    {
        ", Hall of Fame baseball player   ": null
    },
    {
        "George Petitpas": "george petitpas"
    },
    {
        ", expert in human resource management   ": null
    },
    {
        "Sidney Poitier": "sidney poitier"
    },
    {
        " , actor   ": null
    },
    {
        "Steven Clark Rockefeller": "steven clark rockefeller"
    },
    {
        " Deion Sanders": "deion sanders"
    },
    {
        ", NFL Hall of Famer, 42x Super Bowl Champion, Former New York Yankee    ": null
    },
    {
        "David Selby": "david selby"
    },
    {
        ", actor, producer, writer   ": null
    },
    {
        "Will Shortz": "will shortz"
    },
    {
        ", puzzle creator and editor for the New York Times ": null
    },
    {
        "Henry Stone": "henry stone"
    },
    {
        ", owner of TK Records   ": null
    },
    {
        "Robert Tagliapietra": "robert tagliapietra"
    },
    {
        ", fashion designer   ": null
    },
    {
        "Tina Turner": "tina turner"
    },
    {
        ", recording artist, actress, and author   ": null
    },
    {
        "DeWitt Wallace": "dewitt wallace"
    },
    {
        " , magazine publisher, co-founder of  Readers Digest  ": null
    },
    {
        "Lila Bell Wallace": "lila bell wallace"
    },
    {
        " , magazine publisher, co-founder of Readers Digest            ": null
    }
]