[
    {
        "              In legal terms, a plea is simply an answer to a claim made by someone in a criminal case under ": null
    },
    {
        "common law": "common law"
    },
    {
        " using the ": null
    },
    {
        "adversarial system": "adversarial system"
    },
    {
        ". Colloquially, a plea has come to mean the assertion   by a ": null
    },
    {
        "defendant": "defendant"
    },
    {
        " at ": null
    },
    {
        "arraignment": "arraignment"
    },
    {
        ", or otherwise in response to a ": null
    },
    {
        "criminal charge": "indictment"
    },
    {
        ", whether that person pleaded ": null
    },
    {
        "guilty": "guilt"
    },
    {
        ", not guilty, ": null
    },
    {
        "no contest": "nolo contendere"
    },
    {
        ",   Alford plea  or  ": null
    },
    {
        "no case to answer": "no case to answer"
    },
    {
        ".     The concept of the plea is one of the major differences between criminal procedure under common law and procedure under the ": null
    },
    {
        "civil law": "civil law"
    },
    {
        " system. Under common law, a defendant who pleads guilty is automatically convicted and the remainder of the ": null
    },
    {
        "trial": "trial"
    },
    {
        " is used to determine the ": null
    },
    {
        "sentence": "sentence"
    },
    {
        ". This produces a system known as ": null
    },
    {
        "plea bargain": "plea bargain"
    },
    {
        "ing, in which defendants may plead guilty in exchange for a more lenient punishment. In civil law jurisdictions, a confession by the defendant is treated like any other piece of evidence, and a full confession does not prevent a full trial from occurring or relieve the prosecutor from having to present a case to the court.       The most common types of plea are guilty and not guilty .     Pleading guilty typically results in a more lenient punishment for the defendant; it is thus a type of ": null
    },
    {
        "mitigating factor": "mitigating factor"
    },
    {
        " in sentencing.  In a ": null
    },
    {
        "plea bargain": "plea bargain"
    },
    {
        " a defendant makes a deal with the prosecution or court to plead guilty in exchange for a more lenient punishment, or for related charges against them to be dropped. A blind plea is a guilty plea entered with no plea agreement in place.  Plea bargains are particularly common in the United States.  Other countries use a more limited form of plea bargaining. In the United Kingdom and Germany, guidelines state that only the timing of the guilty plea can affect the reduction in the punishment, with an earlier plea resulting in a greater reduction.     In the United States, a  Nolo contendere  plea is when the defendant submits a plea that neither admits nor denies the offense. It has the same immediate effect of a guilty plea, in that the trial avoids determining the defendants guilt.            These are pleas which claim that a case cannot proceed for some reason. They are so called because, rather than being an answer to the question of guilt or innocence, they are a claim that the matter of guilt or innocence should not be considered.     They are:     autrefois convict  - where under the doctrine of ": null
    },
    {
        "double jeopardy": "double jeopardy"
    },
    {
        ", he has previously convicted or acquitted of the same charge and hence cannot be tried again.   plea of pardon - where he has been pardoned for the offense.       A defendant who refuses to enter a plea is usually interpreted as giving a plea of not guilty; the ": null
    },
    {
        "Federal Rules of Criminal Procedure": "federal rules of criminal procedure"
    },
    {
        ", for instance, state, If a defendant refuses to enter a plea or if a defendant organization fails to appear, the court must enter a plea of not guilty.  Similarly, if a defendant attempts to enter an unorthodox plea , this will usually be interpreted as a plea of not guilty.  One example of this is a defendant accused of a crime committed while protesting ": null
    },
    {
        "nuclear power": "nuclear power"
    },
    {
        ", who gave his plea as I plead for the beauty that surrounds us .      Until 1772, English law stated that if a defendant refused to plead guilty or not guilty, the trial was delayed from taking place. Some of these defendants were subjected to ": null
    },
    {
        "peine forte et dure": "peine forte et dure"
    },
    {
        " until he or she entered a plea, although some died. The last recorded instance of this was in 1741.           A ": null
    },
    {
        "defendant": "defendant"
    },
    {
        " who enters a plea of guilty must do so, in the phraseology of a 1938 Supreme Court case,  Johnson v. Zerbst , knowingly, voluntarily and intelligently . The burden is on the prosecution to prove that all waivers of the defendants rights complied with due process standards. Accordingly, in cases of all but the most minor offences, the court or the prosecution will engage in a ": null
    },
    {
        "plea colloquy": "plea colloquy"
    },
    {
        " wherein they ask the defendant a series of rote questions about the defendants knowledge of his rights and the voluntariness of the plea. Typically the hearing on the guilty plea is transcribed by a ": null
    },
    {
        "court reporter": "court reporter"
    },
    {
        " and the transcript is made a part of the permanent record of the case in order to preserve the convictions validity from being challenged at some future time. Voluntary has been described as an elusive term which has come to mean not induced by improper inducements, such as ": null
    },
    {
        "bribing": "bribing"
    },
    {
        " or physical violence, but not including the inducements normally associated with ": null
    },
    {
        "charge": "charge bargaining"
    },
    {
        " and ": null
    },
    {
        "sentence bargaining": "sentence bargaining"
    },
    {
        " . Intelligent has been described as also an elusive term, meaning that the defendant knows his rights, the nature of the charge to which he is pleading, and the consequences of his plea.      Virtually all jurisdictions hold that defense counsel need not discuss with defendants the collateral consequences of pleading guilty, such as ": null
    },
    {
        "consecutive sentencing": "consecutive sentencing"
    },
    {
        " or even treatment as an aggravating circumstance in an ongoing capital prosecution.  However, the Supreme Court recognized an important exception in  Padilla v. Kentucky  , in which the Court held that defense counsel is obligated to inform defendants of the potential immigration consequences of a guilty plea. Thus a defendant who is not advised of immigration consequences may have an ": null
    },
    {
        "ineffective assistance of counsel": "ineffective assistance of counsel"
    },
    {
        " argument.     In the U.S. federal system, the court must also satisfy itself that there is a factual basis for the guilty plea.  However, this safeguard may not be very effective, because the parties, having reached a plea agreement, may be reluctant to reveal any information that could disturb the agreement. When a plea agreement has been made, the judges factual basis inquiry is usually perfunctory, and the standard for finding that the plea is factually based is very low.        Other special pleas used in criminal cases include the plea of mental incompetence, challenging the jurisdiction of the court over the defendants person, the plea in bar, attacking the jurisdiction of the court over the crime charged, and the plea in abatement, which is used to address procedural errors in bringing the charges against the defendant, not apparent on the face of the indictment or other charging instrument. Special pleas in federal criminal cases have been abolished, and defenses formerly raised by special plea are now raised by motion to dismiss.     A conditional plea is one where the defendant pleads guilty to the offense, but specifically reserves the right to appeal certain aspects of the charges .     In  United States v. Binion , malingering or feigning illness during a competency evaluation was held to be ": null
    },
    {
        "obstruction of justice": "obstruction of justice"
    },
    {
        " and led to an enhanced sentence. Although the defendant had pleaded guilty, he was not awarded a reduction in sentence because the feigned illness was considered to mean that he was not ": null
    },
    {
        "accepting responsibility": "accepting responsibility"
    },
    {
        " for his illegal behavior.                 A plea in mitigation is a term used during criminal law proceedings in many ": null
    },
    {
        "Commonwealth countries": "commonwealth of nations"
    },
    {
        ". It typically involves a lawyer telling a judge of extenuating circumstances that could result in a lesser sentence for an offender. ": null
    }
]