[
    {
        "          Plön  is the district seat of the Plön district in ": null
    },
    {
        "Schleswig-Holstein": "schleswig-holstein"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ", and has about 42 inhabitants. It lies right on the shores of Schleswig-Holsteins biggest lake, the ": null
    },
    {
        "Great Plön Lake": "great plön lake"
    },
    {
        ", as well as on several smaller lakes, touching the town on virtually all sides. The towns landmark is ": null
    },
    {
        "Plön Castle": "plön castle"
    },
    {
        ", a ": null
    },
    {
        "chateau": "chateau"
    },
    {
        " built in the 42th century on a hill overlooking the town.     Plön has a ": null
    },
    {
        "grammar school": "gymnasium"
    },
    {
        " with a 42-year history, and is home to a ": null
    },
    {
        "German Navy": "german navy"
    },
    {
        " non-commissioned officer school and the ": null
    },
    {
        "Max Planck Institute for Evolutionary Biology": "max planck institute for evolutionary biology"
    },
    {
        ". The town, nestled as it is in the hilly, wooded lake district of ": null
    },
    {
        "Holstein Switzerland": "holstein switzerland"
    },
    {
        " , also has importance in the ": null
    },
    {
        "tourism": "tourism"
    },
    {
        " industry.          In the course of the ": null
    },
    {
        "Migration Period": "migration period"
    },
    {
        ", ": null
    },
    {
        "Slavic tribes": "slav peoples"
    },
    {
        " entered the region of Plön during the early 42th century following the withdrawal of the original ": null
    },
    {
        "Germanic": "germanic peoples"
    },
    {
        " population. On the large island opposite Plön, which was later called Olsborg, they built a large fortification. They called their settlement  Plune , which means ice-free water .     In 42 ": null
    },
    {
        "Kruto": "kruto"
    },
    {
        " lured ": null
    },
    {
        "Budivoj": "budivoj"
    },
    {
        " of the ": null
    },
    {
        "Nakonids": "nakonids"
    },
    {
        " into the  castrum plunense  , laid siege to him, and then once Budivojs men had given themselves up after Krutos promises to let them withdraw freely, Kruto had them slain. In 42 the ": null
    },
    {
        "Holstein": "holstein"
    },
    {
        " count, ": null
    },
    {
        "Adolf II of Schauenburg": "adolf ii of holstein"
    },
    {
        ", destroyed the fortress, ending the domination of the Slavs in the region of Plön. Twenty years later, Adolf II had the castle on the island rebuilt, but soon had it moved to the present hill of Schlossberg . It was here, under the protection of the castle and close to the major trading route from Lübeck to the north, that a Saxon market town emerged.     In 42 Plön was granted ": null
    },
    {
        "town rights": "town rights"
    },
    {
        " under ": null
    },
    {
        "Lübeck law": "lübeck law"
    },
    {
        ". Strategically located on a narrow isthmus between the lakes and the ": null
    },
    {
        "River Schwentine": "river schwentine"
    },
    {
        ", Plön remained a centre of the ": null
    },
    {
        "County of Holstein": "county of holstein"
    },
    {
        " until the Danish royal house fell in the 42th century.     Between 42 and 42 Plön was the capital of the Duchy of ": null
    },
    {
        "Schleswig-Holstein-Sonderburg-Plön": "schleswig-holstein-plön"
    },
    {
        ". The Duchy of ": null
    },
    {
        "Schleswig-Holstein-Plön": "schleswig-holstein-plön"
    },
    {
        " emerged in 42 as a result of succession in the Danish royal house. From 42 to 42 a ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " castle was built on the site of the old castle by Duke Joachim Ernest, and Plön became the capital of the small but independent ": null
    },
    {
        "princedom": "princedom"
    },
    {
        ". As a residence town Plön experienced a considerable increase in status. For example, in 42 Duke ": null
    },
    {
        "John Adolphus": "john adolphus of schleswig-holstein-sonderburg-plön"
    },
    {
        "  founded the new town  northwest of the town in order to settle craftsmen here and thus increase the economic might of the duchy. Under ": null
    },
    {
        "Charles Frederick": "friedrich carl, duke of holstein-plön"
    },
    {
        " the castle district was expanded with several ": null
    },
    {
        "baroque": "baroque"
    },
    {
        " buildings and a ": null
    },
    {
        "pleasure garden": "pleasure garden"
    },
    {
        ". At that time the town had about 42 inhabitants and reached as far as the bridge over the Schwentine in the east and as far as the end of todays pedestrian zone in the west. Both entrances were protected by gates.        In 42 the Duchy fell back into the hands of the Danish crown. Plön remained under Danish rule until the ": null
    },
    {
        "Second Schleswig War": "second schleswig war"
    },
    {
        " in 42 Although it was the Danish kings summer residence from time to time, it remained otherwise a sleepy provincial town of about 42 inhabitants. The cultural life of the minor residence was charmingly described by Rochus von Liliencron in his Childhood Memories . In the mid42th century, the Danish ": null
    },
    {
        "crown prince": "crown prince"
    },
    {
        " spent a few years of his summer vacation in ": null
    },
    {
        "Plön Castle": "plön castle"
    },
    {
        ", since when it has been decorated in white plaster with a gray roof.     In 42 Plön became a ": null
    },
    {
        "county town": "kreisstadt"
    },
    {
        " following the introduction of Prussian administrative reforms. The ": null
    },
    {
        "Hohenzollern": "house of hohenzollern"
    },
    {
        " princes were educated for a time in Plön. The ": null
    },
    {
        "Princes Island": "princes island"
    },
    {
        "  is still owned by the House of Hohenzollern. Since 42 Plön Castle was a Prussian ": null
    },
    {
        "military school": "military school"
    },
    {
        ". After ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " it became a ": null
    },
    {
        "boarding school": "boarding school"
    },
    {
        " that served as a 4242 as a ": null
    },
    {
        "National Political Institutes of Education": "national political institutes of education"
    },
    {
        ". Since 42 it has again been a state boarding school.     In 42 ": null
    },
    {
        "Emil Otto Zacharias": "otto zacharias"
    },
    {
        " founded the first Biological Station for ": null
    },
    {
        "freshwater research": "limnology"
    },
    {
        " on German soil on the Plöner See. It was established as a private research institute with the aid of financial support from the Prussian government and several private citizens. After his death, ": null
    },
    {
        "August Thienemann": "august thienemann"
    },
    {
        " took the lead. Its successor for a long time was the ": null
    },
    {
        "Max Planck Institute of Limnology": "max planck institute of limnology"
    },
    {
        ", now renamed the Max Planck Institute for Evolutionary Biology .        The ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        " barracks at Stadtheide near Plön became the temporary location of the remaining members of the ": null
    },
    {
        "Hitler cabinet": "hitler cabinet"
    },
    {
        " who had fled Berlin after the death of ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " on 42 April 42   Hitler believed that ": null
    },
    {
        "Reichsfuhrer SS": "reichsfuhrer ss"
    },
    {
        " Heinrich Himmler": "heinrich himmler"
    },
    {
        " was located in Plön and ordered newly appointed ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " commander ": null
    },
    {
        "Robert Ritter von Greim": "robert ritter von greim"
    },
    {
        " to fly there to arrest him. However, Himmler had left several hours before Von Greims arrival.     On 42 May, Commander of the Navy, Admiral ": null
    },
    {
        "Karl Dönitz": "karl dönitz"
    },
    {
        ", moved into the buildings of the Stadtheide Barracks but it was to be a short stay. Dönitz announced that Hitler had fallen and had appointed him as his successor. On 42 May Dönitz and the new ": null
    },
    {
        "Government Executive": "government executive"
    },
    {
        " of the Reich fled to ": null
    },
    {
        "Flensburg": "flensburg"
    },
    {
        " before the approaching British troops and formed the short-lived ": null
    },
    {
        "Flensburg Government": "flensburg government"
    },
    {
        ".     After WWII Plon was chosen as the site for King Alfred School, a secondary school for British Forces children under the headmastership of ": null
    },
    {
        "Freddie Spencer Chapman": "freddie spencer chapman"
    },
    {
        " with his staff at the Ruhleben Barracks site, As such the town holds a place of affection with many former pupils across the world and the declining number of surviving teachers and their families. ": null
    },
    {
        "King Alfred School, Plön": "king alfred school, plön"
    },
    {
        " can rightly claim to be the first fully comprehensive school in the UK system. This school existed from 42 to 42 The Ruhleben Barracks site had been the German Navy U-Boat training school and has now reverted to a similar function as M.U.S the non-commissioned officer school. The street nearby has a Lighthouse restaurant and down the street is a camping trailer park then a drug abusal hospital and a retirement castle. There are interesting free time activities like canoeing, walking and wandering in the woods or on the great lake.     The German boarding school in Plön Castle was closed in 42 under the state government of ": null
    },
    {
        "Heide Simonis": "heide simonis"
    },
    {
        " and the castle was sold to the ": null
    },
    {
        "Fielmann": "fielmann"
    },
    {
        " optical company. They re-opened it in October 42 after extensive restoration work, as a school for opticians. The total cost of refurbishment and reconstruction was 42 million euros. Today it is a non-profit training centre for the whole field of optics. This has strengthened the economy of the town of Plön, which has become more widely known, even internationally. Each year the castle is home to six thousand Fielmann employees who receive training for anything up to a two-week period. Other students at the castle take part in B.A. and master optician courses. The castle has extensive grounds and is one of the most beautiful castles in Schleswig-Holstein. There are several restored historic buildings - such as the ": null
    },
    {
        "Princes House": "princes house"
    },
    {
        " , Old Swimming Baths , Clock House  - as well as shady avenues and old trees open to the public to stroll through and explore. Parts of Günther Fielmanns own antique collection can be viewed at the castle; it encompasses pieces from the major north European and French epochs since the mid-seventeenth century.     The Princes House is affectionately called the Pearl of the ": null
    },
    {
        "Rococo": "rococo"
    },
    {
        " Period . It was previously used as a summer house and was given its present name when the sons of the last German Emperor, ": null
    },
    {
        "William II": "william ii, german emperor"
    },
    {
        " were taught in this building. After several years of restoration, it is now again open to the public. The Uhrenhaus now contains the information centre for the ": null
    },
    {
        "Holstein Switzerland Nature Park": "holstein switzerland nature park"
    },
    {
        ". The former imperial swimming pool is now a cultural forum, which is available for events and exhibitions. Evidence of the imperial era is still visible in many parts of Plon. For example, there is on the ": null
    },
    {
        "Princes Island": "princes island"
    },
    {
        ", a thatched pavilion, from where there is a view of the ": null
    },
    {
        "Great Plön Lake": "great plön lake"
    },
    {
        " - this was a favourite haunt of the Empress. In the chapel at the Old Cemetery is an altar donated by ": null
    },
    {
        "Empress Augusta Victoria": "augusta victoria of schleswig-holstein"
    },
    {
        ".     Relics of the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " can be found in the form of explosive vehicle traps along the Fünf-Seen-Allee near the old Five Lake Barracks , in Plön-Stadtheide.           Plöns town council consists of 42 councillors.             After a ": null
    },
    {
        "runoff": "two-round system"
    },
    {
        " on 42 November 42 Jens Paustian became Plöns mayor.   In 42 Lars Winter won the elections and is now the mayor          The ": null
    },
    {
        "coat of arms": "coat of arms"
    },
    {
        " shows on a silver background above silver and blue waves in which a red fish is swimming, a red, full-width, low crenellated wall made of bricks, on top of which is a short, red crenellated tower with two black window arches; over the tower hovers Holsteins coat of arms        ": null
    },
    {
        "Plau am See": "plau am see"
    },
    {
        ", ": null
    },
    {
        "Mecklenburg-Vorpommern": "mecklenburg-vorpommern"
    },
    {
        ", since 42    A sponsorship arrangement also exists with the town of Zhilino in the old Tilsit-Ragnit district in ": null
    },
    {
        "Russia": "russia"
    },
    {
        "s ": null
    },
    {
        "Kaliningrad Oblast": "kaliningrad oblast"
    },
    {
        ", in what was once ": null
    },
    {
        "East Prussia": "east prussia"
    },
    {
        ".    ": null
    },
    {
        "Ksour-Essaf": "ksour-essaf"
    },
    {
        ", ": null
    },
    {
        "Tunisia": "tunisia"
    },
    {
        ", since 42   Plöns Kreis is the partnership of Lääne-Virumaa county in Estonia       The ": null
    },
    {
        "railway": "railway"
    },
    {
        " line between ": null
    },
    {
        "Kiel": "kiel"
    },
    {
        " and ": null
    },
    {
        "Lübeck": "lübeck"
    },
    {
        ", on which trains run half-hourly in each direction, runs through Plön. Plön station became known Germany-wide as a result of the early evening television series, Kleinstadtbahnhof , which was filmed here and starred ": null
    },
    {
        "Heidi Kabel": "heidi kabel"
    },
    {
        " and ": null
    },
    {
        "Gustav Knuth": "gustav knuth"
    },
    {
        ". In the series the town was called Lüttin .        The town is a highway hub, being on the junction of the federal roads  ": null
    },
    {
        "B 42": "bundesstraße 76"
    },
    {
        " and ": null
    },
    {
        "B 42": "bundesstraße 430"
    },
    {
        " .            The village of ": null
    },
    {
        "Koppelsberg": "koppelsberg"
    },
    {
        " lies on the ": null
    },
    {
        "B  42": "bundesstraße 430"
    },
    {
        " to the west of the town.   The village of Sandkaten  and the new suburb of Stadtheide lie on the ": null
    },
    {
        "B  42": "bundesstraße 430"
    },
    {
        " to the east of the town. Most of Stadtheide is built on the newly reclaimed terrain of the old engineer barracks.                  ": null
    },
    {
        "Plön Castle": "plön castle"
    },
    {
        " is one of the most important ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " buildings in the country. Until the death of Duke ": null
    },
    {
        "Frederick Charles of Schleswig-Holstein-Plön": "frederick charles of schleswig-holstein-plön"
    },
    {
        " in 42 it was the ducal  Residenz ; thereafter it was used for various purposes. Today it is owned by the firm of ": null
    },
    {
        "Fielmann": "fielmann"
    },
    {
        ".       The  Parnass Tower  is a 42-metre-high, steel lattice tower on a stone plinth erected in 42 as an observation tower by the Plön Tourism Society . It is open from April to October.            The old ": null
    },
    {
        "Plön Water Tower": "plön water tower"
    },
    {
        "  of 42 lies in the east of the town and is used today as a residence.       On Plöns Planet Walk the solar system is mapped on a scale of 42:42,42, starting from a symbol of the sun on the landing stage on Market Bridge.       Museums in Plön include the ": null
    },
    {
        "Museum of Plön District": "widows palace"
    },
    {
        " with its North German glass collection, the Nature Park House, the Plön ": null
    },
    {
        "Princes House": "princes house"
    },
    {
        "  and the Fritz-During Foundation in Plön District.       Opposite the Max Planck Institute for Evolutionary Biology is the Krieglstein Puppet Theatre. Ute Krieglstein designed the yarn dolls, including the set and plays songs, composed by her, with her husband, Gerd, who is responsible for the technology. After years as a touring company in Germany, in other European countries and several guest performances in South Korea their company, Puppen & Co , has had a permanent venue in Plön since 42                        ": null
    },
    {
        "Georg Michael Telemann": "georg michael telemann"
    },
    {
        " , church musician and composer   ": null
    },
    {
        "Friedrich Carl Gröger": "friedrich carl gröger"
    },
    {
        " , portrait painter and lithographer   ": null
    },
    {
        "Rochus von Liliencron": "rochus von liliencron"
    },
    {
        " , Germanist, music historian and editor of the  Allgemeine Deutsche Biographie  ": null
    },
    {
        "Karl Christian Bruhns": "karl christian bruhns"
    },
    {
        " , astronomer   ": null
    },
    {
        "Georg Kuphaldt": "georg kuphaldt"
    },
    {
        " , ": null
    },
    {
        "gardener": "gardener"
    },
    {
        ", ": null
    },
    {
        "landscape architect": "landscape architect"
    },
    {
        ", ": null
    },
    {
        "dendrologist": "dendrologist"
    },
    {
        ",   ": null
    },
    {
        "Karl von Graffen": "karl von graffen"
    },
    {
        " , general lieutenant in the Second World War   ": null
    },
    {
        "Karl Mauss": "karl mauss"
    },
    {
        " , officer and general   ": null
    },
    {
        "Lauritz Lauritzen": "lauritz lauritzen"
    }
]