[
    {
        "   A points race is a mass start ": null
    },
    {
        "track cycling": "track cycling"
    },
    {
        " event involving large numbers of riders simultaneously on track. It was an ": null
    },
    {
        "Olympic": "olympic games"
    },
    {
        " event for men between 42–42 and for women 42–42 Starting in 42 the points race is one of the ": null
    },
    {
        "omnium": "omnium"
    },
    {
        " events in the Olympics.       This race can be one of the more confusing races to watch for less familiar viewers. Put simply, it is a race over a long distance, with 42 km for men and 42 km for women in UCI championships. A sprint is held every ten laps, with 42 42 42 and 42 point being awarded to the top four finishers in each sprint. The winner of the race is the one to have the most points at the end of the race. In addition to the sprints, any riders managing to lap the main field are awarded an extra 42 points. This is therefore a popular way of gaining the points required to win the race and leads to many such attempts to gain a lap during the race.     Different tactics can be employed to win the race. Some riders may sit back in the main bunch conserving energy, only attacking for the sprints to gain points. Other riders may attempt to gain the lead early on in the race and try to defend the advantage. The most common breakaways seen in the points race are groups of two to five riders, sharing the work to enable them to gain a lap. Although it is a difficult feat to gain the lap on your own, it is not uncommon for the top riders to be able to do this in order to win the race.     At the Olympic Games and World Championships qualification is determined by performance at the World Cup Classics events throughout the season. At the World Cup Classics meetings there are usually two heats taking place to decide qualification for the final. These are commonly half the race distance of the final.             The snowball is a variation on the points race where every sprint, only the first-place finisher is awarded any points. The number of points awarded increases with each sprint: the first sprint gives one point, the second gives two points, the third gives three points, etc. The sprints are also more frequent than in the normal points race, and can happen every lap or every two laps. In the case of a tie, the order of the final sprint is used to break the tie.         The point-a-lap is, as its name would imply, a variation on the points race where a single point is awarded to the first rider to finish each lap. Typically more points are awarded on the final lap, going several riders deep.         The tempo race is the 42nd event of the new ": null
    },
    {
        "Omnium": "omnium"
    },
    {
        " format, it lasts 42 km for women and 42 km for men. During this race one point is awarded to the first rider each lap from the end of the 42th lap. If one rider gains a lap, they score 42 points, if they lose a lap, they lose 42 points.                    ": null
    },
    {
        "nl:BaanwielrennenPuntenkoers": "nl:baanwielrennenpuntenkoers"
    }
]