[
    {
        "              Guam": "guam"
    },
    {
        " is a ": null
    },
    {
        "presidential": "presidential system"
    },
    {
        " representative democracy": "representative democracy"
    },
    {
        ", whereby the ": null
    },
    {
        "Governor": "governor of guam"
    },
    {
        " is ": null
    },
    {
        "head of government": "head of government"
    },
    {
        ", and of a ": null
    },
    {
        "multi-party system": "multi-party system"
    },
    {
        ". Guam is an ": null
    },
    {
        "organized, unincorporated territory": "government of guam"
    },
    {
        " of the ": null
    },
    {
        "United States": "united states"
    },
    {
        " with policy relations between Guam and the US under the jurisdiction of the ": null
    },
    {
        "Office of Insular Affairs": "office of insular affairs"
    },
    {
        ".       The economy of Guam is greatly dependent on the U.S. military bases there. The U.S. connection also contributes to Guams status as a Japanese tourist destination. Some assume the Guamanian population is sympathetic toward the United States, based on common tribulations during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", and on relations with the U.S. military since.     However, maintenance of the status quo vis-à-vis the current political relationship between the territory and the United States is not without controversy. There is a significant movement in favor of the Territory becoming a ": null
    },
    {
        "commonwealth": "commonwealth"
    },
    {
        ", which would give it a political status similar to ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        " and the ": null
    },
    {
        "Northern Mariana Islands": "northern mariana islands"
    },
    {
        ". Competing movements exist, which advocate political independence from the United States, statehood, or a combination with the Northern Mariana Islands as a single territory . These proposals, however, are not seen as favorable by the U.S. federal government, which argues Guam does not have the financial stability or self-sufficiency to warrant such status. They cite Guam’s increasing reliance on Federal spending as evidence, and question how commonwealth status or statehood would benefit the United States as a whole.     A portion of the people on Guam favor a modified version of the current Territorial status, involving greater autonomy from the federal government . Perceived indifference by the U.S. Congress regarding a change-of-status petition submitted by Guam has led many to feel that the territory is being deprived of the benefits of a more equitable union with the United States.. Guam is also listed on the ": null
    },
    {
        "United Nations list of Non-Self-Governing Territories": "united nations list of non-self-governing territories"
    },
    {
        ".       ": null
    }
]