[
    {
        "   The Politics of Mexico take place in a framework of a ": null
    },
    {
        "federal": "Federation"
    },
    {
        " presidential": "Presidential System"
    },
    {
        " representative democratic": "Representative Democracy"
    },
    {
        " republic": "Republic"
    },
    {
        " whose government is based on a ": null
    },
    {
        "congressional system": "Congressional System"
    },
    {
        ", whereby the ": null
    },
    {
        "President of Mexico": "President Of Mexico"
    },
    {
        " is both ": null
    },
    {
        "head of state": "Head Of State"
    },
    {
        " and ": null
    },
    {
        "head of government": "Head Of Government"
    },
    {
        ", and of a ": null
    },
    {
        "multi-party system": "Multi-Party System"
    },
    {
        ". The ": null
    },
    {
        "federal government": "Federal Government Of Mexico"
    },
    {
        " represents the ": null
    },
    {
        "United Mexican States": "Mexico"
    },
    {
        " and is divided into three branches: executive, legislative and judicial, Anahis term as established by the ": null
    },
    {
        "Political Constitution of the United Mexican States": "Constitution Of Mexico"
    },
    {
        ", published in 1917. The ": null
    },
    {
        "constituent states": "State Governments Of Mexico"
    },
    {
        " of the federation must also have a republican form of government based on a congressional system as established by their respective constitutions.     The ": null
    },
    {
        "executive power": "Executive Power"
    },
    {
        " is exercised by the executive branch, which is headed by the President, advised by a cabinet of secretaries that are independent of the legislature. ": null
    },
    {
        "Legislative power": "Legislative Power"
    },
    {
        " is vested upon the ": null
    },
    {
        "Congress of the Union": "Congress Of The Union"
    },
    {
        ", a two-chamber legislature comprising the ": null
    },
    {
        "Senate of the Republic": "Senate Of The Republic"
    },
    {
        " and the ": null
    },
    {
        "Chamber of Deputies": "Chamber Of Deputies"
    },
    {
        ". Judicial power is exercised by the judiciary, consisting of the ": null
    },
    {
        "Supreme Court of Justice of the Nation": "Supreme Court Of Justice Of The Nation"
    },
    {
        ", the Council of the Federal Judiciary and the collegiate, unitary and district tribunals.     The politics of Mexico are dominated by four political parties: ": null
    },
    {
        "Institutional Revolutionary Party": "Institutional Revolutionary Party"
    },
    {
        " , ": null
    },
    {
        "National Action Party": "National Action Party"
    },
    {
        " , ": null
    },
    {
        "Party of the Democratic Revolution": "Party Of The Democratic Revolution"
    },
    {
        " ,  and the ": null
    },
    {
        "National Regeneration Movement": "National Regeneration Movement"
    },
    {
        " . Founded in ": null
    },
    {
        "1929": "1929 In Mexico"
    },
    {
        " as the Partido Nacional Revolucionario , PRI has dominated Mexican politics for over 70 years.  PAN was founded in ": null
    },
    {
        "1939": "1939 In Mexico"
    },
    {
        ", but it did not win its first governorship until ": null
    },
    {
        "1989": "1989 In Mexico"
    },
    {
        "; its candidates won the presidency in ": null
    },
    {
        "2000": "2000 In Mexico"
    },
    {
        " and ": null
    },
    {
        "2006": "2006 In Mexico"
    },
    {
        ".  The beginnings of PRD go back to ": null
    },
    {
        "1988": "1988 In Mexico"
    },
    {
        " when dissident members of PRI decided to challenge the leadership and nominated ": null
    },
    {
        "Cuauhtémoc Cárdenas": "Cuauhtémoc Cárdenas"
    },
    {
        " for president of Mexico. Cardenas lost in a highly contested election, but a new political party was born and the party emerged as a third force in Mexican politics, even though they have never captured the presidency.  MORENA grew out of a dispute between ": null
    },
    {
        "Andrés Manuel López Obrador": "Andrés Manuel López Obrador"
    },
    {
        " and other leaders of PRD after his loss in the ": null
    },
    {
        "2012": "2012 In Mexico"
    },
    {
        " presidential election. MORENA won its official recognition in ": null
    },
    {
        "2014": "2014 In Mexico"
    },
    {
        ", and dominated the ": null
    },
    {
        "2018": "2018 In Mexico"
    },
    {
        " elections.      According to a survey by the ": null
    },
    {
        "National Autonomous University of Mexico": "National Autonomous University Of Mexico"
    },
    {
        " in 2017, 74 percent of Mexicans believe that Mexicos electoral system is not transparent and distrust official results              Constitutionally, political parties in Mexico must promote the participation of the people in the democratic life of the country, contribute in the representation of the nation and citizens, and be the access through which citizens can participate in public office, through whatever programs, principles and ideals they postulate.  All political parties must be registered with the ": null
    },
    {
        "National Electoral Institute": "National Electoral Institute"
    },
    {
        " , the institution in charge of organizing and overseeing the federal electoral processes, and must obtain at least 2% of votes in the federal elections to keep their registry. Registered political parties receive public funding for their operation and can also obtain private funding within the limits prescribed by the law.   As of 2010 the following political parties are registered with the INE and all have representatives at the Congress of the Union:   ": null
    },
    {
        "Institutional Revolutionary Party": "Institutional Revolutionary Party"
    },
    {
        " , founded in 1929;   ": null
    },
    {
        "National Action Party": "National Action Party"
    },
    {
        " , founded in 1939;   ": null
    },
    {
        "Party of the Democratic Revolution": "Party Of The Democratic Revolution"
    },
    {
        " , founded in 1989;   ": null
    },
    {
        "Labor Party": "Labor Party"
    },
    {
        " , founded in 1990;   ": null
    },
    {
        "Green Ecological Party": "Ecologist Green Party Of Mexico"
    },
    {
        " , founded in 1986, but lost its registration for two consecutive elections; it has retained its registration since 1993;   ": null
    },
    {
        "Citizens’ Movement": "Citizens Movement"
    },
    {
        " , founded in 1997;   ": null
    },
    {
        "New Alliance": "New Alliance Party"
    },
    {
        " , founded in 2005;   ": null
    },
    {
        "National Regeneration Movement": "National Regeneration Movement"
    },
    {
        " , founded in 2012;     Political parties are allowed to form alliances or coalitions to nominate candidates for any particular election. The coalition must identify itself with a particular name and logo. Proportional representation seats are assigned to the coalition based on the percentage of votes obtained in the elections, and then the coalition reassigns them to the constituent political parties. Once each party in the coalition has been assigned plurinominal seats, they do not necessarily continue to work as a coalition in government.     Throughout the 20th century, PRI had an almost hegemonic power at the state and federal level, which slowly began to recede in the late 1980s. Even though since the 1940s, PAN had won a couple of seats in the Congress, and in 1947 the first presidential municipality ,  it wasnt until 1989, that the first non-PRI state governor was elected . It was in 1997, that PRI lost its absolute majority at the Congress of the Union. In 2000 the first non-PRI president since 1929 was elected.               Suffrage is universal, free, secret and direct for all Mexican citizens 18 and older, and is compulsory .  The ": null
    },
    {
        "identity document": "Identity Document"
    },
    {
        " in Mexico serves also as the voting card, so all citizens are automatically registered for all elections; that is, no pre-registration is necessary for every election. All elections are direct; that is, no electoral college is constituted for any of the elections at the federal, state or municipal level. Only when an incumbent president is absolutely absent , the Congress of the Union constitutes itself acts as an electoral college to elect an interim president by absolute majority.     Presidential elections are scheduled every six years, except in the exceptional case of absolute absence of the president. However, the term of the current president, ": null
    },
    {
        "Andrés Manuel López Obrador": "Andrés Manuel López Obrador"
    },
    {
        ", will be only 5 years, 10 months  due to a Constitutional change.  Legislative elections are scheduled every six years for the Senate, to be fully renewed in elections held concurrently with the presidential elections; and every three years for the Chamber of Deputies. Elections have traditionally been held on the first Sunday of July, but the new law means they will be held on the first Sunday in June instead. State governors are also elected every six years, except in ": null
    },
    {
        "Baja California": "Baja California"
    },
    {
        ", where the governor is elected for a two-year term.  The state legislatures are renewed every three years. State elections need not be concurrent with federal elections. Federal elections are organized and supervised by the autonomous public ": null
    },
    {
        "Federal Electoral Institute": "Federal Electoral Institute"
    },
    {
        ", whereas state and municipal elections are organized and supervised by electoral institutes constituted by each state of the federation. Elections within Mexico City are also organized by a local electoral institute.     A strongly ingrained concept in Mexican political life is no reelection. The theory was implemented after ": null
    },
    {
        "Porfirio Díaz": "Porfirio Díaz"
    },
    {
        " managed to monopolize the presidency for over 25 years. Presently, Mexican presidents are limited to a single six-year term, and no one who has held the office even on a caretaker basis is allowed to hold the office again. Deputies and senators were not allowed to immediately succeed themselves until 2018; Both may now serve a maximum of 12 consecutive years.              Federal presidential elections were held on July 2, 2006 concurrent with the full renovation of both chambers of the Congress of the Union. In these elections the ": null
    },
    {
        "Party of the Democratic Revolution": "Party Of The Democratic Revolution"
    },
    {
        " , the ": null
    },
    {
        "Labour Party": "Labour Party"
    },
    {
        " and ": null
    },
    {
        "Convergence": "Convergence"
    },
    {
        " formed a coalition called ": null
    },
    {
        "Coalition for the Good of All": "Coalition For The Good Of All"
    },
    {
        ". The ": null
    },
    {
        "Institutional Revolutionary Party": "Institutional Revolutionary Party"
    },
    {
        " and the ": null
    },
    {
        "Ecologist Green Party": "Ecologist Green Party Of Mexico"
    },
    {
        " formed a coalition called ": null
    },
    {
        "Alliance for Mexico": "Alliance For Mexico"
    },
    {
        ". The Federal Electoral Tribunal declared ": null
    },
    {
        "Felipe Calderón": "Felipe Calderón"
    },
    {
        " the winner of the elections on September 5, and president-elect. He took office on December 1, 2006 and his term ended on November 30, 2012. The concurrent congressional elections were not contested by any party. Both chambers were completely renewed and no party obtained an absolute majority.          In 2012, Mexico elected ": null
    },
    {
        "Enrique Peña Nieto": "Enrique Peña Nieto"
    },
    {
        " as President.          In 2018, Mexico elected ": null
    },
    {
        "Andrés Manuel López Obrador": "Andrés Manuel López Obrador"
    },
    {
        " as President.             The elections in each state are done at different times, depending on the state, and are not necessarily held at the same time with the federal elections. :   ": null
    },
    {
        "PRI": "Institutional Revolutionary Party"
    },
    {
        " governs 13 states: ": null
    },
    {
        "Campeche": "Campeche"
    },
    {
        ", ": null
    },
    {
        "Coahuila": "Coahuila"
    },
    {
        ", ": null
    },
    {
        "Colima": "Colima"
    },
    {
        ", ": null
    },
    {
        "Guerrero": "Guerrero"
    },
    {
        ", ": null
    },
    {
        "Hidalgo": "Hidalgo"
    },
    {
        ", ": null
    },
    {
        "Jalisco": "Jalisco"
    },
    {
        ", ": null
    },
    {
        "Mexico": "State Of Mexico"
    },
    {
        ", ": null
    },
    {
        "Oaxaca": "Oaxaca"
    },
    {
        ", ": null
    },
    {
        "San Luis Potosí": "San Luis Potosí"
    },
    {
        ", ": null
    },
    {
        "Sinaloa": "Sinaloa"
    },
    {
        ", ": null
    },
    {
        "Sonora": "Sonora"
    },
    {
        ", ": null
    },
    {
        "Tlaxcala": "Tlaxcala"
    },
    {
        ", ": null
    },
    {
        "Yucatán": "Yucatán"
    },
    {
        " and ": null
    },
    {
        "Zacatecas": "Zacatecas"
    },
    {
        ".   ": null
    },
    {
        "PAN": "National Action Party"
    },
    {
        " governs 11 states: ": null
    },
    {
        "Aguascalientes": "Aguascalientes"
    },
    {
        ", ": null
    },
    {
        "Baja California": "Baja California"
    },
    {
        ", ": null
    },
    {
        "Baja California Sur": "Baja California Sur"
    },
    {
        ", ": null
    },
    {
        "Chihuahua": "Chihuahua"
    },
    {
        ", ": null
    },
    {
        "Durango": "Durango"
    },
    {
        ", ": null
    },
    {
        "Guanajuato": "Guanajuato"
    },
    {
        ", ": null
    },
    {
        "Nayarit": "Nayarit"
    },
    {
        ", ": null
    },
    {
        "Puebla": "Puebla"
    },
    {
        ", ": null
    },
    {
        "Querétaro": "Querétaro"
    },
    {
        ", ": null
    },
    {
        "Tamaulipas": "Tamaulipas"
    },
    {
        ", and ": null
    },
    {
        "Veracruz": "Veracruz"
    },
    {
        ".   ": null
    },
    {
        "PRD": "Party Of The Democratic Revolution"
    },
    {
        " governs 4 states and Mexico City: ": null
    },
    {
        "Mexico City": "Mexico City"
    },
    {
        ", ": null
    },
    {
        "Michoacán": "Michoacán"
    },
    {
        ", ": null
    },
    {
        "Morelos": "Morelos"
    },
    {
        ", ": null
    },
    {
        "Quintana Roo": "Quintana Roo"
    },
    {
        ", and ": null
    },
    {
        "Tabasco": "Tabasco"
    },
    {
        ".   ": null
    },
    {
        "PVEM": "Ecologist Green Party Of Mexico"
    },
    {
        " governs a state: ": null
    },
    {
        "Chiapas": "Chiapas"
    },
    {
        ".   ": null
    },
    {
        "Nuevo León": "Nuevo León"
    },
    {
        " is governed by the countrys first independent governor in modern Mexican history.          The ": null
    },
    {
        "Mexican Revolution": "Mexican Revolution"
    },
    {
        " was followed by the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        ", which led to a severely fragmented society and very weak institutions.  In 1929, all factions and generals of the ": null
    },
    {
        "Mexican Revolution": "Mexican Revolution"
    },
    {
        " were united into a single party, the National Revolutionary Party , with the aim of stabilizing the country and ending internal conflicts. During the following administrations, since 1928, many of the revolutionary ideals were put into effect, among them the free distribution of land to peasants and farmers, the nationalization of the oil companies, the birth and rapid growth of the Social Security Institute as well as that of Labor Unions, and the protection of national industries.     President ": null
    },
    {
        "Lázaro Cárdenas": "Lázaro Cárdenas"
    },
    {
        " was fundamental to recover some of the social control that was lost during the Revolution and the following economic meltdown in the United States. However, Cárdenas was followed by a series of less-talented leaders that were unable to continue this path and establish an effective rule of law on Mexican society. Moreover, Cárdenas presidency happened before the UN focused on states as the rule in the 1940s and 1950s.      The NRP was later renamed the Mexican Revolution Party and finally the ": null
    },
    {
        "Institutional Revolutionary Party": "Institutional Revolutionary Party"
    },
    {
        ". The social institutions created by the party itself provided it with the necessary strength to stay in power. In time, the system gradually became, as some political scientists have labeled it, an electoral authoritarianism , Using the phrase of Schedler A From Electoral Authoritarianism to Democratic Consolidation in Mexicos Democracy at Work, Crandall R, Paz G, Roett R , Lyenne Reinner Publisher, Colorado USA in that the party resorted to any means necessary, except that of the dissolution of the constitutional and electoral system itself, to remain in power. In fact, Mexico was considered a bastion of continued constitutional government in times where ": null
    },
    {
        "coup détats": "Coup Détat"
    },
    {
        "and military dictatorships were the norm in Latin America, in that the institutions were renovated electorally, even if only in appearance and with little participation of the opposition parties at the local level.     The lack of the establishment of a true democracy in Mexico can be partially explained many factors, like the ones described above. However, one of them could also be the oil reserves that exist in the country and that were nationalized by the Cárdenas government. Several empirical studies point to a correlation between the existence of natural resources and the difficulty of turning into a democracy. Clark, William Roberts, Matt Golder, and Sona N. Golder. 2013.  Unpublished manuscript, University of Michigan and Pennsylvania State University.     The first cracks in the system, even though they were merely symbolic, were the 1970s reforms to the electoral system and the composition of the Congress of the Union which for the first time incorporated proportional representation seats allowing opposition parties to obtain seats, though limited in number, in the Chamber of Deputies. As minority parties became involved in the system, they gradually demanded more changes, and a full democratic representation. Even though in the 1960s, a couple municipalities were governed by opposition parties, the first state government to be won by an opposition party was ": null
    },
    {
        "Baja California": "Baja California"
    },
    {
        ", in 1989.     Historically, there were important high-profile defections from the ": null
    },
    {
        "Institutional Revolutionary Party": "Institutional Revolutionary Party"
    },
    {
        ", like the ones of ": null
    },
    {
        "Juan Andreu Almazán": "Juan Andreu Almazán"
    },
    {
        " , ": null
    },
    {
        "Ezequiel Padilla": "Ezequiel Padilla Peñaloza"
    },
    {
        " , ": null
    },
    {
        "Miguel Henríquez Guzmán": "Miguel Henríquez Guzmán"
    },
    {
        " , and ": null
    },
    {
        "Cuahtémoc Cárdenas": "Cuauhtémoc Cárdenas"
    },
    {
        " , son of President Lázaro Cárdenas. These departures happened mainly because they opposed the presidential candidate nominations; however, only Cárdenas departure in 1988 resulted in the establishment of another political party .      The ": null
    },
    {
        "presidential elections": "1988 Mexican General Election"
    },
    {
        " held in 1988 marked a watershed in Mexican politics, as they were the first serious threat to the party in power by an opposition candidate: ": null
    },
    {
        "Cuauhtémoc Cárdenas": "Cuauhtémoc Cárdenas"
    },
    {
        ", who was nominated by a broad coalition of leftist parties. He officially received 31.1 percent of the vote, against 50.4 percent for ": null
    },
    {
        "Carlos Salinas de Gortari": "Carlos Salinas De Gortari"
    },
    {
        ", the PRI candidate, and 17 percent for ": null
    },
    {
        "Manuel Clouthier": "Manuel Clouthier"
    },
    {
        " of the ": null
    },
    {
        "National Action Party": "National Action Party"
    },
    {
        " . It was believed by some that Cardenas had won the election, but that the then government-controlled electoral commission had altered the results after the infamous the system crashed . In the concurrent elections, the PRI came within 11 seats of losing the majority of ": null
    },
    {
        "Chamber of Deputies": "Chamber Of Deputies Of Mexico"
    },
    {
        ", and opposition parties captured 4 of the 64 ": null
    },
    {
        "Senate": "Senate Of Mexico"
    },
    {
        " seats—the first time that the PRI had failed to hold every seat in the Senate. Capitalizing on the popularity of President Salinas, however, the PRI rebounded in the mid-term ": null
    },
    {
        "congressional elections of 1991": "1991 Mexican Legislative Election"
    },
    {
        ", winning 320 seats.     Subsequent changes included the creation of the Federal Electoral Institute in the 1990s and the inclusion of proportional representation and first minority seats in the Senate. The ": null
    },
    {
        "presidential election of 1994": "1994 Mexican General Election"
    },
    {
        " was judged to be the first relatively free election in modern Mexican history. ": null
    },
    {
        "Ernesto Zedillo": "Ernesto Zedillo"
    },
    {
        " of the PRI won with 50.2 percent of the vote, against 26.7 percent for ": null
    },
    {
        "Diego Fernández de Cevallos": "Diego Fernández De Cevallos"
    },
    {
        " of PAN and 17.1 percent for Cardenas, who this time represented the ": null
    },
    {
        "Party of the Democratic Revolution": "Party Of The Democratic Revolution"
    },
    {
        " . Although the opposition campaign was hurt by the desire of the Mexican electorate for stability, following the assassination of ": null
    },
    {
        "Luis Donaldo Colosio": "Luis Donaldo Colosio"
    },
    {
        " and the recent outbreak of ": null
    },
    {
        "hostilities in the state of Chiapas": "Chiapas Conflict"
    },
    {
        ", Zedillos share of the vote was the lowest official percentage for any PRI presidential candidate up to that time.     In the ": null
    },
    {
        "1997 mid-term elections": "1997 Mexican Legislative Election"
    },
    {
        ", no party held majority in the Chamber of Deputies, and in 2000 the first opposition party president was sworn in office since 1929. ": null
    },
    {
        "Vicente Fox": "Vicente Fox"
    },
    {
        " won the election with 43% of the vote, followed by ": null
    },
    {
        "PRI": "Partido Revolucionario Institucional"
    },
    {
        " candidate ": null
    },
    {
        "Francisco Labastida": "Francisco Labastida"
    },
    {
        " with 36%, and ": null
    },
    {
        "Cuauhtémoc Cárdenas": "Cuauhtémoc Cárdenas"
    },
    {
        " of the ": null
    },
    {
        "Party of the Democratic Revolution": "Party Of The Democratic Revolution"
    },
    {
        " with 17%.     Numerous electoral reforms implemented after 1989 aided in the opening of the Mexican political system, and opposition parties made historic gains in elections at all levels. Many of the current electoral concerns have shifted from outright fraud to campaign fairness issues. During 1995-96 the political parties negotiated constitutional amendments to address these issues. Implementing legislation included major points of consensus that had been worked out with the opposition parties. The thrust of the new laws has public financing predominate over private contributions to political parties, tighter procedures for auditing the political parties, and strengthening the authority and independence of electoral institutions. The court system also was given greatly expanded authority to hear civil rights cases on electoral matters brought by individuals or groups. In short, the extensive reform efforts have leveled the playing field for the parties.     The ": null
    },
    {
        "2006 elections": "2006 Mexican Elections"
    },
    {
        " saw the PRI fall to third place behind both the PAN and the PRD. ": null
    },
    {
        "Roberto Madrazo": "Roberto Madrazo"
    }
]