[
    {
        "              Ireland": "Republic Of Ireland"
    },
    {
        " is a ": null
    },
    {
        "parliamentary": "Parliamentary System"
    },
    {
        ", ": null
    },
    {
        "representative democratic": "Representative Democracy"
    },
    {
        " republic and a member state of the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        ". While the ": null
    },
    {
        "head of state": "Head Of State"
    },
    {
        " is the popularly elected ": null
    },
    {
        "President of Ireland": "President Of Ireland"
    },
    {
        ", it is a largely ceremonial position, with real political power being vested in the indirectly elected ": null
    },
    {
        "Taoiseach": "Taoiseach"
    },
    {
        " , who is the head of the ": null
    },
    {
        "government": "Government Of Ireland"
    },
    {
        ".     ": null
    },
    {
        "Executive power": "Executive Power"
    },
    {
        " is exercised by the ": null
    },
    {
        "government": "Irish Government"
    },
    {
        ", which consists of no more than 15 cabinet ministers, inclusive of the Taoiseach and ": null
    },
    {
        "Tánaiste": "Tánaiste"
    },
    {
        " . ": null
    },
    {
        "Legislative power": "Legislative Power"
    },
    {
        " is vested in the ": null
    },
    {
        "Oireachtas": "Oireachtas"
    },
    {
        ", the ": null
    },
    {
        "bicameral": "Bicameralism"
    },
    {
        " national parliament, which consists of ": null
    },
    {
        "Dáil Éireann": "Dáil Éireann"
    },
    {
        ", ": null
    },
    {
        "Seanad Éireann": "Seanad Éireann"
    },
    {
        " and the ": null
    },
    {
        "President of Ireland": "President Of Ireland"
    },
    {
        ". The ": null
    },
    {
        "judiciary": "Judiciary"
    },
    {
        " is ": null
    },
    {
        "independent": "Judicial Independence"
    },
    {
        " of the executive and the legislature. The head of the judiciary is the ": null
    },
    {
        "Chief Justice": "Chief Justice Of Ireland"
    },
    {
        ", who presides over the ": null
    },
    {
        "Supreme Court": "Supreme Court Of Ireland"
    },
    {
        ".     While there are a number of political parties in the state, the political landscape has been ": null
    },
    {
        "dominated": "Two-Party System"
    },
    {
        " for decades by ": null
    },
    {
        "Fianna Fáil": "Fianna Fáil"
    },
    {
        " and ": null
    },
    {
        "Fine Gael": "Fine Gael"
    },
    {
        ", historically opposed and competing entities, which both occupy the traditional centre ground. From the 1930s until ": null
    },
    {
        "2011": "2011 Irish General Election"
    },
    {
        " they were the largest and second-largest parties respectively. Both parties trace their roots back to the opposing sides of the ": null
    },
    {
        "Irish Civil War": "Irish Civil War"
    },
    {
        ". The ": null
    },
    {
        "Labour Party": "Labour Party"
    },
    {
        ", historically the states third political party, has only ever been in power as part of a ": null
    },
    {
        "coalition": "Coalition Government"
    },
    {
        " with either of the two main parties. In 2011, there was a major political realignment in Ireland, with Fine Gael becoming the largest party, Labour the second, and Fianna Fáil dropping to third following a collapse in support, while ": null
    },
    {
        "Sinn Féin": "Sinn Féin"
    },
    {
        " saw a substantial increase in support.     However, in 2016 Fianna Fáil managed to regain support and become the second-largest party, while Labour collapsed to fourth place following backlash over its role in the coalition government. Sinn Féin continued making gains, becoming the third-largest party, while Fine Gael remained the largest party, despite losing seats.                      The state operates under the Constitution of Ireland  which was adopted in 1937 by means of a plebiscite. The constitution falls within the ": null
    },
    {
        "liberal democratic": "Liberal Democracy"
    },
    {
        " tradition. It defines the organs of government and guarantees certain fundamental rights. The Constitution can only be amended by means of a ": null
    },
    {
        "referendum": "Amendments To The Constitution Of Ireland"
    },
    {
        ". Important constitutional referenda have concerned issues such as ": null
    },
    {
        "abortion": "Abortion In The Republic Of Ireland"
    },
    {
        ", the ": null
    },
    {
        "status of the Roman Catholic Church": "Catholic Church In Ireland"
    },
    {
        ", ": null
    },
    {
        "divorce": "Fifteenth Amendment Of The Constitution Of Ireland"
    },
    {
        ", ": null
    },
    {
        "European Union": "Ireland And The European Union"
    },
    {
        " and ": null
    },
    {
        "same-sex marriage": "Same-Sex Marriage In The Republic Of Ireland"
    },
    {
        ".               The head of state is the President of Ireland. In keeping with the states ": null
    },
    {
        "parliamentary system": "Parliamentary System"
    },
    {
        " of government the President exercises a mainly ceremonial role but does possess certain specific powers. The presidency is open to all Irish citizens who are at least 35. They are directly elected by secret ballot under the ": null
    },
    {
        "alternative vote": "Instant-Runoff Voting"
    },
    {
        ". A candidate may be nominated for election as President by no fewer than 20 members of the Oireachtas or by four or more of ": null
    },
    {
        "Irelands 31 County and City Councils": "Local Government In The Republic Of Ireland"
    },
    {
        ". A retiring President may nominate themselves as a candidate for re-election. If only one valid candidate is nominated for election, for example if there is consensus among the political parties to nominate a single candidate, it is unnecessary to proceed to a ballot and that candidate is deemed elected. The President is elected to a seven-year term of office and no person may serve more than two terms.     In carrying out certain of their constitutional functions, the President is aided by the ": null
    },
    {
        "Council of State": "Council Of State"
    },
    {
        ". There is no Vice-President in Ireland. If for any reason the President is unable to carry out his/her functions, or if the Office of President is vacant, the duties of the President are carried out by the ": null
    },
    {
        "Presidential Commission": "Presidential Commission"
    },
    {
        ".               Executive authority is exercised by a cabinet known simply as the Government. Article 28 of the Constitution states that the Government may consist of no less than seven and no more than fifteen members, namely the ": null
    },
    {
        "Taoiseach": "Taoiseach"
    },
    {
        " , the ": null
    },
    {
        "Tánaiste": "Tánaiste"
    },
    {
        " and up to thirteen other ministers. The Taoiseach is appointed by the President, after being nominated by ": null
    },
    {
        "Dáil Éireann": "Dáil Éireann"
    },
    {
        " . The remaining ministers are nominated by the Taoiseach and appointed by the President following their approval by the Dáil. The Government must enjoy the confidence of Dáil Éireann and, in the event that they cease to enjoy the support of the lower house, the Taoiseach must either resign or request the President to dissolve the Dáil, in which case a general election follows.               Article 15 of the ": null
    },
    {
        "Constitution of Ireland": "Constitution Of Ireland"
    },
    {
        " established the Oireachtas as the national parliament of Ireland. The Oireachtas consists of the ": null
    },
    {
        "President of Ireland": "President Of Ireland"
    },
    {
        " and two elected houses: Dáil Éireann and Seanad Éireann . As the Oireachtas also consists of the President the official title of the two law making houses is the Houses of the Oireachtas. The Dáil is by far the dominant House of the legislature. The President may not veto bills passed by the Oireachtas, but may refer them to the ": null
    },
    {
        "Supreme Court of Ireland": "Supreme Court Of Ireland"
    },
    {
        " for a ruling on whether they comply with the constitution.            Members of the Dáil are directly elected at least once in every five years under the ": null
    },
    {
        "single transferable vote": "Single Transferable Vote"
    },
    {
        " form of ": null
    },
    {
        "proportional representation": "Proportional Representation"
    },
    {
        " from multi-seat constituencies. Membership of the house is open to all Irish citizens who are at least 21 and permanently resident in the State. The electorate consists of all Irish and British citizens resident in Ireland over the age of 18. Members of the Dáil are known as ": null
    },
    {
        "Teachta Dála": "Teachta Dála"
    },
    {
        " or TDs. Currently there are 158 TDs, of which one, the ": null
    },
    {
        "Ceann Comhairle": "Ceann Comhairle"
    },
    {
        " , is automatically returned at an election. The Taoiseach, Tánaiste and the Minister for Finance must be members of the Dáil. All other members of the Government must be members of the Dáil, however up to two members may be members of the Seanad. The Dáil is the only House which can introduce and amend money bills . Since the early 1990s no single party has had a majority in Dáil Éireann, so that ": null
    },
    {
        "coalition governments": "Coalition Government"
    },
    {
        "have been the norm.            The Senate is a largely advisory body. It consists of sixty members called Senators. An election for the Seanad must take place no later than 90 days after a general election for the members of the Dáil. Eleven Senators are nominated by the Taoiseach while a further six are elected by certain national universities. The remaining 43 are elected from special vocational panels of candidates, the electorate for which consists of the 60 members of the outgoing Senate, the 158 TDs of the incoming Dáil and the 883 elected members of ": null
    },
    {
        "5 city and 29 county councils": "Local Government In The Republic Of Ireland"
    },
    {
        ". The Senate has the power to delay legislative proposals and is allowed 90 days to consider and amend bills sent to it by the Dáil . The Senate is only allowed 21 days to consider money bills sent to it by the Dáil. The Senate cannot amend money bills but can make recommendations to the Dáil on such bills.               Ireland is a ": null
    },
    {
        "common law": "Common Law"
    },
    {
        " jurisdiction. The judiciary consists of the ": null
    },
    {
        "Supreme Court": "Supreme Court Of Ireland"
    },
    {
        ", the ": null
    },
    {
        "High Court": "High Court Of The Republic Of Ireland"
    },
    {
        " and other lower courts established by law. Judges are appointed by the President after being nominated by the Government and can be removed from office only for misbehaviour or incapacity, and then only by resolution of both houses of the Oireachtas. The final court of appeal is the Supreme Court, which consists of the Chief Justice, seven ordinary judges and ex officio the President of the High Court. The Supreme Court rarely sits as a full bench and normally hears cases in chambers of three, five or seven judges.     Both the Supreme Court and the High Court have the power of ": null
    },
    {
        "judicial review": "Judicial Review"
    },
    {
        " and may declare to be invalid both laws and acts of the state which are repugnant to the constitution.            The Government, through the civil and public services and state-sponsored bodies, is a significant employer in the state; these three sectors are often called the public sector. Management of these various bodies vary, for instance in the civil service there will be clearly defined routes and patterns whilst among public services a sponsoring minister or the ": null
    },
    {
        "Minister for Finance": "Minister For Finance"
    },
    {
        " may appoint a board or commission. Commercial activities, where the state involves itself, are typically through the state-sponsored bodies which are usually organised in a similar fashion to private companies.     A 2005 report on public sector employment, showed that in June 2005 the numbers employed in the public sector stood at 350,100; of these by sector they were 38,700 , 254,100 and 57,300 . The total workforce of the state was 1,857,400 that year, thus the public sector represents approximately 20% of the total workforce.             The civil service of Ireland consists of two broad components, the Civil Service of the Government and the Civil Service of the State. Whilst these two components are largely theoretical, they do have some fundamental operational differences. The civil service is expected to maintain the political impartiality in its work, and some sections of it are entirely independent of Government decision making.            The ": null
    },
    {
        "public service": "Public Services"
    },
    {
        " is a relatively broad term and is not clearly defined and sometimes is taken to include the civil service. The public service proper consists of Government agencies and bodies which provide services on behalf of the Government but are not the core civil service. For instance ": null
    },
    {
        "local authorities": "Local Government In The Republic Of Ireland"
    },
    {
        ", ": null
    },
    {
        "Education and Training Boards": "Education And Training Board"
    },
    {
        "and ": null
    },
    {
        "Garda Síochána": "Garda Síochána"
    },
    {
        " are considered to be public services.          Article 28A of the constitution of Ireland provides a constitutional basis for local government. The Oireachtas is empowered to establish the number, size and powers of local authorities by law. Under Article 28A, members of local authorities must be directly elected by voters at least once every five years.     Local government in Ireland is governed by a series of Local Government Acts, beginning with the ": null
    },
    {
        "Local Government Act 1898": "Local Government  Act 1898"
    },
    {
        ". The most significant of these is the ": null
    },
    {
        "Local Government Act 2001": "Local Government Act 2001"
    },
    {
        ", which established a two-tier structure of local government. The ": null
    },
    {
        "Local Government Reform Act 2014": "Local Government Reform Act 2014"
    },
    {
        " abolished the bottom tier, the town councils, leaving 31 local authorities. There are 26 County Councils , 3 City Councils , and 2 City and County Councils .          A number of political parties are represented in the Dáil and ": null
    },
    {
        "coalition governments": "Coalition Government"
    },
    {
        "are common. The Irish electoral system has been characterised by the two and a half party system, with two large catch all parties dominating. This changed after the 2011 Irish General Election, following the large drop in support for ": null
    },
    {
        "Fianna Fáil": "Fianna Fáil"
    },
    {
        " and the rise in support for other parties.     The current largest party in the state is ": null
    },
    {
        "Fine Gael": "Fine Gael"
    },
    {
        ", which has its origins in the pro-treaty movement of Michael Collins in the ": null
    },
    {
        "Irish Civil War": "Irish Civil War"
    },
    {
        ". Traditionally the party of ": null
    },
    {
        "law and order": "Law And Order"
    },
    {
        ", it is associated with strong belief in pro-enterprise and reward. Despite expressions of ": null
    },
    {
        "Social Democracy": "Social Democracy"
    },
    {
        " by previous leader Garrett Fitzgerald, today, it remains a ": null
    },
    {
        "Christian democratic": "Christian Democratic"
    },
    {
        ", economically liberal party along European lines, with a strongly pro-European outlook. Fine Gael was formed out of a merger of ": null
    },
    {
        "Cumann na nGaedheal": "Cumann Na Ngaedheal"
    },
    {
        ", the ": null
    },
    {
        "Centre Party": "National Centre Party"
    },
    {
        " and the ": null
    },
    {
        "Blueshirts": "Blueshirts"
    },
    {
        ". In recent years it has generally been associated with a liberal outlook. It has formed government in the periods 1922–32 , 1948–51, 1954–57, 1973–77, 1981–82, 1982–87, 1994–97, and 2011 to present.     ": null
    },
    {
        "Fianna Fáil": "Fianna Fáil"
    },
    {
        ", a traditionally ": null
    },
    {
        "Irish republican": "Irish Republicanism"
    },
    {
        " party founded in 1927 by ": null
    },
    {
        "Éamon de Valera": "Éamon De Valera"
    },
    {
        ", is the second largest party and also considered centre-right. It first formed a government on the basis of a ": null
    },
    {
        "populist": "Populism"
    },
    {
        " programme of land redistribution and national preference in trade and republican populism remains a key part of its appeal. It has formed government seven times since Ireland gained independence: 1932–48, 1951–54, 1957–73, 1977–81, 1982, 1987–94, and 1997–2011. ": null
    },
    {
        "Fianna Fáil": "Fianna Fáil"
    },
    {
        " was the largest party in the Dáil to 2011. It lost a huge amount of support in the ": null
    },
    {
        "2011 general election": "2011 Irish General Election"
    },
    {
        " but has since regained some support.     The third largest party is ": null
    },
    {
        "Sinn Féin": "Sinn Féin"
    },
    {
        ", established in its current form in 1970. The original Sinn Féin played a huge role in the ": null
    },
    {
        "Irish War of Independence": "Irish War Of Independence"
    },
    {
        " and the ": null
    },
    {
        "First Dáil": "First Dáil"
    },
    {
        ". ": null
    },
    {
        "Fine Gael": "Fine Gael"
    },
    {
        " and ": null
    },
    {
        "Fianna Fáil": "Fianna Fáil"
    },
    {
        " trace their origins to that party. The current-day party has been historically linked to the ": null
    },
    {
        "Provisional IRA": "Provisional Ira"
    },
    {
        ". The party is a ": null
    },
    {
        "Republican": "Irish Republicanism"
    },
    {
        " party which takes a more left wing stance on economics and social policy than the Labour Party.     The fourth largest party in the state is the centre-left ": null
    },
    {
        "Labour Party": "Labour Party"
    },
    {
        " which was founded by ": null
    },
    {
        "James Connolly": "James Connolly"
    },
    {
        " and ": null
    },
    {
        "Jim Larkin": "Jim Larkin"
    },
    {
        " in 1912. Labour have formal links with the trade union movement and have governed in seven coalition governments – six led by Fine Gael and one by Fianna Fáil. This role as a junior coalition partner has led to Labour being classed as the half party of Irelands two and a half party system.     The ": null
    },
    {
        "Solidarity–People Before Profit": "Solidarity–People Before Profit"
    },
    {
        " electoral alliance, consisting of the ": null
    },
    {
        "Solidarity": "Solidarity"
    },
    {
        " and ": null
    },
    {
        "People Before Profit": "People Before Profit"
    },
    {
        " currently occupy the 5th largest grouping within Dáil Éireann. Formed in 2015, the group represents a left-wing, socialist viewpoint, with particular focus on the abolition of domestic water charges.     Other parties and political alliances represented in the Dáil after the ": null
    },
    {
        "2016 general election": "2016 Irish General Election"
    },
    {
        " are the ": null
    },
    {
        "Independents 4 Change": "Independents 4 Change"
    },
    {
        ", ": null
    },
    {
        "Social Democrats": "Social Democrats"
    },
    {
        " and ": null
    },
    {
        "Green Party": "Green Party"
    },
    {
        ".     A number of ": null
    },
    {
        "independent": "Independent Politicians In Ireland"
    },
    {
        " TDs such as ": null
    },
    {
        "Maureen OSullivan": "Maureen Osullivan"
    },
    {
        ", ": null
    },
    {
        "Mick Wallace": "Mick Wallace"
    },
    {
        ", ": null
    },
    {
        "Finian McGrath": "Finian Mcgrath"
    },
    {
        ", ": null
    },
    {
        "John Halligan": "John Halligan"
    },
    {
        " and ": null
    },
    {
        "Thomas Pringle": "Thomas Pringle"
    },
    {
        " largely hold left-wing views.  The ": null
    },
    {
        "Independent Alliance": "Independent Alliance"
    },
    {
        ", a loose alliance of independents formed in 2015, returned 6 TDs after the 2016 general election. 5 of the 6 helped elect ": null
    },
    {
        "Enda Kenny": "Enda Kenny"
    },
    {
        " as Taoiseach again after the election, and have since entered government in various forms.                       ": null
    }
]