[
    {
        "         Political philosophy, also known as political theory, is the study of topics such as ": null
    },
    {
        "politics": "politics"
    },
    {
        ", ": null
    },
    {
        "liberty": "liberty"
    },
    {
        ", ": null
    },
    {
        "justice": "justice"
    },
    {
        ", ": null
    },
    {
        "property": "property"
    },
    {
        ", ": null
    },
    {
        "rights": "rights"
    },
    {
        ", ": null
    },
    {
        "law": "law"
    },
    {
        ", and the enforcement of laws by ": null
    },
    {
        "authority": "authority"
    },
    {
        ": what they are, if they are needed, what makes a ": null
    },
    {
        "government legitimate": "the purpose of government"
    },
    {
        ", what rights and freedoms it should protect, what form it should take, what the law is, and what duties citizens owe to a legitimate government, if any, and when it may be legitimately overthrown, if ever.     Political theory also engages questions of a broader scope, tackling the political nature of phenomena and categories such as ": null
    },
    {
        "identity": "identity"
    },
    {
        ", ": null
    },
    {
        "culture": "cultural studies"
    },
    {
        ", ": null
    },
    {
        "sexuality": "queer theory"
    },
    {
        ", ": null
    },
    {
        "race": "critical race theory"
    },
    {
        ", ": null
    },
    {
        "wealth": "political economy"
    },
    {
        ", ": null
    },
    {
        "human-nonhuman relations": "critical animal studies"
    },
    {
        ", ": null
    },
    {
        "ecology": "ecosophy"
    },
    {
        ", ": null
    },
    {
        "religion": "political theology"
    },
    {
        ", and more.     Political philosophy is a branch of ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        ", Strauss, Leo . An introduction to Political Philosophy. Detroit: Wayne State University Press, p. 10. but it has also been a major part of ": null
    },
    {
        "political science": "political science"
    },
    {
        ", within which a strong focus has historically been placed on both the history of political thought and contemporary political theory .     In the Oxford Handbook in Political Theory , the field is described as: an interdisciplinary endeavor whose center of gravity lies at the humanities end of the happily still undisciplined discipline of political science ... For a long time, the challenge for the identity of political theory has been how to position itself productively in three sorts of location: in relation to the academic disciplines of political science, history, and philosophy; between the world of politics and the more abstract, ruminative register of theory; between canonical political theory and the newer resources  on which political theorists increasingly draw.                   ": null
    },
    {
        "Indian political philosophy": "indian political philosophy"
    },
    {
        " in ancient times demarcated a clear distinction between nation and state religion and state. The constitutions of Hindu states evolved over time and were based on political and legal treatises and prevalent social institutions. The institutions of state were broadly divided into governance, administration, defense, law and order. Mantranga, the principal governing body of these states, consisted of the King, Prime Minister, Commander in chief of army, Chief Priest of the King. The Prime Minister headed the committee of ministers along with head of executive .     ": null
    },
    {
        "Chanakya": "chanakya"
    },
    {
        " was a 4th-century BC Indian political philosopher. The  Arthashastra  provides an account of the science of politics for a wise ruler, policies for foreign affairs and wars, the system of a spy state and surveillance and economic stability of the state.  Chanakya quotes several authorities including Bruhaspati, Ushanas, Prachetasa Manu, Parasara, and Ambi, and described himself as a descendant of a lineage of political philosophers, with his father Chanaka being his immediate predecessor.  Another influential extant Indian treatise on political philosophy is the Sukra Neeti.   An example of a ": null
    },
    {
        "code of law": "code of law"
    },
    {
        " in ancient India is the ": null
    },
    {
        "Manusmṛti": "manusmṛti"
    },
    {
        " or ": null
    },
    {
        "Laws of Manu": "manu smriti"
    },
    {
        ".                Chinese political philosophy dates back to the ": null
    },
    {
        "Spring and Autumn period": "spring and autumn period"
    },
    {
        ", specifically with Confucius in the 6th century BC. Chinese political philosophy was developed as a response to the social and political breakdown of the country characteristic of the Spring and Autumn period and the ": null
    },
    {
        "Warring States period": "warring states period"
    },
    {
        ". The major philosophies during the period, ": null
    },
    {
        "Confucianism": "confucianism"
    },
    {
        ", ": null
    },
    {
        "Legalism": "legalism"
    },
    {
        ", ": null
    },
    {
        "Mohism": "mohism"
    },
    {
        ", ": null
    },
    {
        "Agrarianism": "school of agrarianism"
    },
    {
        " and ": null
    },
    {
        "Taoism": "taoism"
    },
    {
        ", each had a political aspect to their philosophical schools. Philosophers such as ": null
    },
    {
        "Confucius": "confucius"
    },
    {
        ", ": null
    },
    {
        "Mencius": "mencius"
    },
    {
        ", and ": null
    },
    {
        "Mozi": "mozi"
    },
    {
        ", focused on political unity and political stability as the basis of their political philosophies. Confucianism advocated a hierarchical, ": null
    },
    {
        "meritocratic": "meritocracy"
    },
    {
        " government based on empathy, loyalty, and interpersonal relationships. Legalism advocated a highly ": null
    },
    {
        "authoritarian": "authoritarian"
    },
    {
        " government based on ": null
    },
    {
        "draconian": "wikt:draconian"
    },
    {
        " punishments and laws. ": null
    },
    {
        "Mohism": "mohism"
    },
    {
        " advocated a communal, decentralized government centered on ": null
    },
    {
        "frugality": "frugality"
    },
    {
        " and ": null
    },
    {
        "ascetism": "ascetism"
    },
    {
        ". The Agrarians advocated a peasant ": null
    },
    {
        "utopian": "utopian"
    },
    {
        " communalism": "communalism"
    },
    {
        " and ": null
    },
    {
        "egalitarianism": "egalitarianism"
    },
    {
        ".  Taoism advocated a proto-": null
    },
    {
        "anarchism": "anarchism"
    },
    {
        ". Legalism was the dominant political philosophy of the ": null
    },
    {
        "Qin Dynasty": "qin dynasty"
    },
    {
        ", but was replaced by State Confucianism in the ": null
    },
    {
        "Han Dynasty": "han dynasty"
    },
    {
        ". Prior to Chinas adoption of ": null
    },
    {
        "communism": "communism"
    },
    {
        ", State Confucianism remained the dominant political philosophy of China up to the 20th century.        Western political philosophy originates in the philosophy of ": null
    },
    {
        "ancient Greece": "ancient greece"
    },
    {
        ", where political philosophy dates back to at least ": null
    },
    {
        "Plato": "plato"
    },
    {
        ".  Ancient Greece was dominated by city-states, which experimented with various forms of political organization, grouped by Plato into five categories of descending stability and morality: ": null
    },
    {
        "monarchy": "monarchy"
    },
    {
        ", ": null
    },
    {
        "timocracy": "timocracy"
    },
    {
        ", ": null
    },
    {
        "oligarchy": "oligarchy"
    },
    {
        ", ": null
    },
    {
        "democracy": "democracy"
    },
    {
        " and ": null
    },
    {
        "tyranny": "tyranny"
    },
    {
        ". One of the first, extremely important classical works of political philosophy is Platos Republic, which was followed by ": null
    },
    {
        "Aristotles": "aristotle"
    },
    {
        "  Nicomachean Ethics  and ": null
    },
    {
        "Politics": "politics"
    },
    {
        ".  Roman political philosophy was influenced by the ": null
    },
    {
        "Stoics": "stoics"
    },
    {
        " and the Roman statesman ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        ".                 The early ": null
    },
    {
        "Christian philosophy": "christian philosophy"
    },
    {
        " of ": null
    },
    {
        "Augustine of Hippo": "augustine of hippo"
    },
    {
        " was heavily influenced by Plato. A key change brought about by Christian thought was the moderation of the ": null
    },
    {
        "Stoicism": "stoicism"
    },
    {
        " and theory of ": null
    },
    {
        "justice": "justice"
    },
    {
        " of the Roman world, as well emphasis on the role of the state in applying ": null
    },
    {
        "mercy": "mercy"
    },
    {
        " as a ": null
    },
    {
        "moral example": "moral example"
    },
    {
        ". Augustine also preached that one was not a member of his or her city, but was either a citizen of the ": null
    },
    {
        "City of God": "city of god"
    },
    {
        " or the City of Man . Augustines  City of God  is an influential work of this period that attacked the thesis, held by many Christian Romans, that the Christian view could be realized on ": null
    },
    {
        "Earth": "earth"
    },
    {
        ".             ": null
    },
    {
        "Thomas Aquinas": "thomas aquinas"
    },
    {
        " meticulously dealt with the varieties of ": null
    },
    {
        "philosophy of law": "philosophy of law"
    },
    {
        ". According to Aquinas, there are four kinds of law:     Eternal law   ": null
    },
    {
        "Divine positive law": "divine law"
    },
    {
        "   Natural law": "natural law"
    },
    {
        "   Human law      Aquinas never discusses the nature or categorization of ": null
    },
    {
        "canon law": "canon law"
    },
    {
        ". There is scholarly debate surrounding the place of canon law within the Thomistic jurisprudential framework.     Aquinas was an incredibly influential thinker in the ": null
    },
    {
        "Natural Law tradition": "natural law"
    },
    {
        ".                The rise of ": null
    },
    {
        "Islam": "islam"
    },
    {
        ", based on both the ": null
    },
    {
        "Quran": "quran"
    },
    {
        " and ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        " strongly altered the power balances and perceptions of origin of power in the Mediterranean region. ": null
    },
    {
        "Early Islamic philosophy": "early islamic philosophy"
    },
    {
        " emphasized an inexorable link between ": null
    },
    {
        "science": "science"
    },
    {
        " and ": null
    },
    {
        "religion": "religion"
    },
    {
        ", and the process of ": null
    },
    {
        "ijtihad": "ijtihad"
    },
    {
        " to find ": null
    },
    {
        "truth": "truth"
    },
    {
        "—in effect all philosophy was ": null
    },
    {
        "political": "political aspects of islam"
    },
    {
        " as it had real implications for governance. This view was challenged by the rationalist ": null
    },
    {
        "Mutazilite": "mutazilite"
    },
    {
        " philosophers, who held a more ": null
    },
    {
        "Hellenic": "hellenistic philosophy"
    },
    {
        " view, reason above revelation, and as such are known to modern scholars as the first speculative theologians of Islam; they were supported by a secular aristocracy who sought freedom of action independent of the ": null
    },
    {
        "Caliphate": "caliphate"
    },
    {
        ". By the late ancient period, however, the traditionalist ": null
    },
    {
        "Asharite": "asharite"
    },
    {
        " view of Islam had in general triumphed. According to the Asharites, reason must be subordinate to the Quran and the Sunna.       ": null
    },
    {
        "Islamic political philosophy": "islamic philosophy"
    },
    {
        ", was, indeed, rooted in the very sources of ": null
    },
    {
        "Islam": "islam"
    },
    {
        "—i.e., the ": null
    },
    {
        "Quran": "quran"
    },
    {
        " and the ": null
    },
    {
        "Sunnah": "sunnah"
    },
    {
        ", the words and practices of Muhammad—thus making it essentially theocratic. However, in Western thought, it is generally supposed that it was a specific area peculiar merely to the great philosophers of Islam: ": null
    },
    {
        "al-Kindi": "al-kindi"
    },
    {
        " , ": null
    },
    {
        "al-Farabi": "al-farabi"
    },
    {
        " , ": null
    },
    {
        "İbn Sina": "avicenna"
    },
    {
        " , ": null
    },
    {
        "Ibn Bajjah": "ibn bajjah"
    },
    {
        " and ": null
    },
    {
        "Ibn Rushd": "averroes"
    },
    {
        " . The political conceptions of Islam such as kudrah , ": null
    },
    {
        "sultan": "sultan"
    },
    {
        ", ": null
    },
    {
        "ummah": "ummah"
    },
    {
        ", cemaa -and even the core terms of the Quran—i.e., ": null
    },
    {
        "ibadah": "ibadah"
    },
    {
        " , din , rab and ": null
    },
    {
        "ilah": "ilah"
    },
    {
        " —is taken as the basis of an analysis. Hence, not only the ideas of the Muslim political philosophers but also many other ": null
    },
    {
        "jurists": "fiqh"
    },
    {
        " and ": null
    },
    {
        "ulama": "ulema"
    },
    {
        " posed political ideas and theories. For example, the ideas of the ": null
    },
    {
        "Khawarij": "kharijites"
    },
    {
        " in the very early years of ": null
    },
    {
        "Islamic history": "muslim history"
    },
    {
        " on ": null
    },
    {
        "Khilafa": "caliphate"
    },
    {
        " and ": null
    },
    {
        "Ummah": "ummah"
    },
    {
        ", or that of ": null
    },
    {
        "Shia Islam": "shia islam"
    },
    {
        " on the concept of ": null
    },
    {
        "Imamah": "imamah"
    },
    {
        " are considered proofs of political thought. The clashes between the ": null
    },
    {
        "Ehl-i Sunna": "sunni islam"
    },
    {
        " and ": null
    },
    {
        "Shia": "shia islam"
    },
    {
        " in the 7th and 8th centuries had a genuine political character. Political thought was not purely rooted in theism, however. ": null
    },
    {
        "Aristotleanism": "aristotelianism"
    },
    {
        " flourished as the Islamic Golden Age saw rise to a continuation of the ": null
    },
    {
        "peripatetic": "peripatetic school"
    },
    {
        " philosophers who implemented the ideas of ": null
    },
    {
        "Aristotle": "aristotle"
    },
    {
        " in the context of the Islamic world. Abunaser, Avicenna and Ibn Rushd where part of this philosophical school who claimed that human reason surpassed mere coincidence and revelation. They believed, for example, that natural phenomena occur because of certain rules , not because god interfered directly .        Other notable political philosophers of the time include ": null
    },
    {
        "Nizam al-Mulk": "nizam al-mulk"
    },
    {
        ", a Persian scholar and ": null
    },
    {
        "vizier": "vizier"
    },
    {
        " of the Seljuq Empire who composed the  Siyasatnama , or the Book of Government in English. In it, he details the role of the state in terms of political affairs , as well as its duty to protect the poor and reward the worthy. In his other work, he explains how the state should deal with other issues such as supplying jobs to immigrants like the ": null
    },
    {
        "Turkmens": "turkmens"
    },
    {
        " who were coming from the north .          The 14th-century ": null
    },
    {
        "Arab": "arab"
    },
    {
        " scholar ": null
    },
    {
        "Ibn Khaldun": "ibn khaldun"
    },
    {
        " is considered one of the greatest political theorists. The British philosopher-anthropologist ": null
    },
    {
        "Ernest Gellner": "ernest gellner"
    },
    {
        " considered Ibn Khalduns definition of ": null
    },
    {
        "government": "government"
    },
    {
        ", ...an institution which prevents injustice other than such as it commits itself, the best in the history of political theory. For Ibn Khaldun, government should be restrained to a minimum for as a necessary evil, it is the constraint of men by other men.        ": null
    },
    {
        "Medieval": "medieval"
    },
    {
        " political philosophy in Europe was heavily influenced by Christian thinking. It had much in common with the Mutazilite ": null
    },
    {
        "Islamic": "islamic"
    },
    {
        " thinking in that the ": null
    },
    {
        "Roman Catholics": "roman catholic"
    },
    {
        "thought subordinating ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        " to ": null
    },
    {
        "theology": "theology"
    },
    {
        " did not subject reason to revelation but in the case of contradictions, subordinated reason to faith as the Asharite of Islam. The Scholastics by combining the philosophy of Aristotle with the Christianity of St. Augustine emphasized the potential harmony inherent in reason and revelation.  Perhaps the most influential political philosopher of medieval Europe was St. ": null
    },
    {
        "Thomas Aquinas": "thomas aquinas"
    },
    {
        " who helped reintroduce ": null
    },
    {
        "Aristotles": "aristotle"
    },
    {
        "works, which had only been transmitted to ": null
    },
    {
        "Catholic": "catholic"
    },
    {
        " Europe through ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        " Spain, along with the commentaries of ": null
    },
    {
        "Averroes": "averroes"
    },
    {
        ". Aquinass use of them set the agenda, for ": null
    },
    {
        "scholastic": "scholasticism"
    },
    {
        " political philosophy dominated European thought for centuries even unto the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ".      Some medieval political philosophers, such as Aquinas in his  Summa Theologica , developed the idea that a king who is a tyrant is no king at all and could be overthrown. Others, like ": null
    },
    {
        "Nicole Oresme": "nicole oresme"
    },
    {
        " in his  Livre de Politiques , categorically denied this right to overthrow an unjust ruler.     The ": null
    },
    {
        "Magna Carta": "magna carta"
    },
    {
        ", viewed by many as a cornerstone of Anglo-American political liberty, explicitly proposes the right to revolt against the ruler for justices sake. Other documents similar to Magna Carta are found in other European countries such as Spain and Hungary.        During the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " secular political philosophy began to emerge after about a century of theological political thought in Europe. While the Middle Ages did see secular politics in practice under the rule of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", the academic field was wholly ": null
    },
    {
        "scholastic": "scholasticism"
    },
    {
        " and therefore Christian in nature.         One of the most influential works during this burgeoning period was ": null
    },
    {
        "Niccolò Machiavellis": "niccolò machiavelli"
    },
    {
        "  The Prince , written between 1511–12 and published in 1532, after Machiavellis death. That work, as well as  The Discourses , a rigorous analysis of ": null
    },
    {
        "classical antiquity": "classical antiquity"
    },
    {
        ", did much to influence modern political thought in the West. A minority  interpreted The Prince as a satire meant to be given to the Medici after their recapture of Florence and their subsequent expulsion of Machiavelli from Florence.  Though the work was written for the di Medici family in order to perhaps influence them to free him from exile, Machiavelli supported the ": null
    },
    {
        "Republic of Florence": "republic of florence"
    },
    {
        " rather than the ": null
    },
    {
        "oligarchy": "oligarchy"
    },
    {
        " of the di ": null
    },
    {
        "Medici": "medici"
    },
    {
        " family. At any rate, Machiavelli presents a ": null
    },
    {
        "pragmatic": "pragmatism"
    },
    {
        " and somewhat ": null
    },
    {
        "consequentialist": "consequentialist"
    },
    {
        " view of politics, whereby good and evil are mere means used to bring about an end—i.e., the acquisition and maintenance of absolute power. ": null
    },
    {
        "Thomas Hobbes": "thomas hobbes"
    },
    {
        ", well known for his theory of the ": null
    },
    {
        "social contract": "social contract"
    },
    {
        ", goes on to expand this view at the start of the 17th century during the ": null
    },
    {
        "English Renaissance": "english renaissance"
    },
    {
        ". Although neither Machiavelli nor Hobbes believed in the divine right of kings, they both believed in the inherent selfishness of the individual. It was necessarily this belief that led them to adopt a strong central power as the only means of preventing the disintegration of the social order.        During the ": null
    },
    {
        "Enlightenment": "age of enlightenment"
    },
    {
        " period, new theories emerged about what the human was and is and about the definition of reality and the way it was perceived, along with the discovery of other societies in the Americas, and the changing needs of political societies , and the ": null
    },
    {
        "Haitian Revolution": "haitian revolution"
    },
    {
        ". These new theories led to new questions and insights by such thinkers as ": null
    },
    {
        "Thomas Hobbes": "thomas hobbes"
    },
    {
        ", ": null
    },
    {
        "John Locke": "john locke"
    },
    {
        ", ": null
    },
    {
        "Montesquieu": "montesquieu"
    },
    {
        " and ": null
    },
    {
        "Jean-Jacques Rousseau": "jean-jacques rousseau"
    },
    {
        ".     These theorists were driven by two basic questions: one, by what right or need do people form states; and two, what the best form for a state could be. These fundamental questions involved a conceptual distinction between the concepts of state and government. It was decided that state would refer to a set of enduring institutions through which power would be distributed and its use justified. The term government would refer to a specific group of people who occupied the institutions of the state, and create the laws and ordinances by which the people, themselves included, would be bound. This conceptual distinction continues to operate in ": null
    },
    {
        "political science": "political science"
    },
    {
        ", although some political scientists, philosophers, historians and ": null
    },
    {
        "cultural anthropologists": "cultural anthropology"
    },
    {
        " have argued that most political action in any given society occurs outside of its state, and that there are societies that are not organized into states that nevertheless must be considered in political terms. As long as the concept of ": null
    },
    {
        "natural order": "natural order"
    },
    {
        " was not introduced, the ": null
    },
    {
        "social sciences": "social sciences"
    },
    {
        " could not evolve independently of ": null
    },
    {
        "theistic": "theistic"
    },
    {
        " thinking. Since the cultural revolution of the 17th century in England, which spread to France and the rest of Europe, society has been considered subject to natural laws akin to the physical world.      Political and economic relations were drastically influenced by these theories as the concept of the ": null
    },
    {
        "guild": "guild"
    },
    {
        " was subordinated to the theory of ": null
    },
    {
        "free trade": "free trade"
    },
    {
        ", and ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " dominance of theology was increasingly challenged by ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " churches subordinate to each ": null
    },
    {
        "nation-state": "nation-state"
    },
    {
        ", which also preached in the vulgar or native language of each region. However, the enlightenment was an outright attack on religion, particularly Christianity. The most outspoken critic of the church in France was ": null
    },
    {
        "François Marie Arouet de Voltaire": "françois marie arouet de voltaire"
    },
    {
        ", a representative figure of the enlightenment. After Voltaire, religion would never be the same again in France.      In the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ", these ideological reforms did not take place and these views did not integrate into common thought until much later. As well, there was no spread of this doctrine within the ": null
    },
    {
        "New World": "new world"
    },
    {
        " and the advanced civilizations of the ": null
    },
    {
        "Aztec": "aztec"
    },
    {
        ", ": null
    },
    {
        "Maya": "maya civilization"
    },
    {
        ", ": null
    },
    {
        "Inca": "inca"
    },
    {
        ", ": null
    },
    {
        "Mohican": "mohican"
    },
    {
        ", Delaware, ": null
    },
    {
        "Huron": "wyandot people"
    },
    {
        " and especially the ": null
    },
    {
        "Iroquois": "iroquois"
    },
    {
        ". The ": null
    },
    {
        "Iroquois": "iroquois"
    },
    {
        " philosophy in particular gave much to Christian thought of the time and in many cases actually inspired some of the institutions adopted in the United States: for example, ": null
    },
    {
        "Benjamin Franklin": "benjamin franklin"
    },
    {
        " was a great admirer of some of the methods of the ": null
    },
    {
        "Iroquois Confederacy": "iroquois confederacy"
    },
    {
        ", and much of early American literature emphasized the political philosophy of the natives.          ": null
    },
    {
        "John Locke": "john locke"
    },
    {
        " in particular exemplified this new age of political theory with his work  Two Treatises of Government . In it Locke proposes a state of nature theory that directly complements his conception of how political development occurs and how it can be founded through contractual obligation. Locke stood to refute Sir ": null
    },
    {
        "Robert Filmers": "robert filmer"
    },
    {
        "paternally founded political theory in favor of a natural system based on nature in a particular given system. The theory of the ": null
    },
    {
        "divine right of kings": "divine right of kings"
    },
    {
        " became a passing fancy, exposed to the type of ridicule with which John Locke treated it. Unlike Machiavelli and Hobbes but like Aquinas, Locke would accept Aristotles dictum that man seeks to be happy in a state of social harmony as a social animal. Unlike Aquinass preponderant view on the salvation of the soul from ": null
    },
    {
        "original sin": "original sin"
    },
    {
        ", Locke believes mans mind comes into this world as ": null
    },
    {
        "tabula rasa": "tabula rasa"
    },
    {
        ". For Locke, knowledge is neither innate, revealed nor based on authority but subject to uncertainty tempered by reason, tolerance and moderation. According to Locke, an absolute ruler as proposed by Hobbes is unnecessary, for natural law is based on reason and seeking peace and survival for man.       The ": null
    },
    {
        "Marxist": "karl marx"
    },
    {
        " critique of capitalism—developed with ": null
    },
    {
        "Friedrich Engels": "friedrich engels"
    },
    {
        "—was, alongside liberalism and fascism, one of the defining ideological movements of the twentieth century. The ": null
    },
    {
        "industrial revolution": "industrial revolution"
    },
    {
        " produced a parallel revolution in political thought. ": null
    },
    {
        "Urbanization": "urbanization"
    },
    {
        " and ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        " greatly reshaped society. During this same period, the ": null
    },
    {
        "socialist movement": "history of socialism"
    },
    {
        " began to form. In the mid-19th century, ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        " was developed, and ": null
    },
    {
        "socialism": "socialism"
    },
    {
        " in general gained increasing popular support, mostly from the urban working class. Without breaking entirely from the past, Marx established principles that would be used by future revolutionaries of the 20th century namely ": null
    },
    {
        "Vladimir Lenin": "vladimir lenin"
    },
    {
        ", ": null
    },
    {
        "Mao Zedong": "mao zedong"
    },
    {
        ", ": null
    },
    {
        "Ho Chi Minh": "ho chi minh"
    },
    {
        ", and ": null
    },
    {
        "Fidel Castro": "fidel castro"
    },
    {
        ". Though ": null
    },
    {
        "Hegels": "georg wilhelm friedrich hegel"
    },
    {
        "philosophy of history is similar to ": null
    },
    {
        "Immanuel Kant": "immanuel kant"
    },
    {
        "s, and ": null
    },
    {
        "Karl Marxs": "karl marx"
    },
    {
        "theory of revolution towards the common good is partly based on Kants view of history—Marx declared that he was turning Hegels dialectic, which was standing on its head , the right side up again .  Unlike Marx who believed in ": null
    },
    {
        "historical materialism": "historical materialism"
    },
    {
        ", Hegel believed in the  Phenomenology of Spirit .  By the late 19th century, ": null
    },
    {
        "socialism": "socialism"
    },
    {
        " and ": null
    },
    {
        "trade unions": "trade union"
    },
    {
        "were established members of the political landscape. In addition, the various branches of ": null
    },
    {
        "anarchism": "anarchism"
    },
    {
        ", with thinkers such as ": null
    },
    {
        "Mikhail Bakunin": "mikhail bakunin"
    },
    {
        ", ": null
    },
    {
        "Pierre-Joseph Proudhon": "pierre-joseph proudhon"
    },
    {
        " or ": null
    },
    {
        "Peter Kropotkin": "peter kropotkin"
    },
    {
        ", and ": null
    },
    {
        "syndicalism": "syndicalism"
    },
    {
        " also gained some prominence. In the Anglo-American world, ": null
    },
    {
        "anti-imperialism": "anti-imperialism"
    },
    {
        " and ": null
    },
    {
        "pluralism": "pluralism"
    },
    {
        " began gaining currency at the turn of the 20th century.     ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " was a watershed event in human history, changing views of governments and politics. The ": null
    },
    {
        "Russian Revolution of 1917": "russian revolution of 1917"
    },
    {
        " brought ": null
    },
    {
        "communism": "communism"
    },
    {
        "—and in particular the political theory of ": null
    },
    {
        "Leninism": "leninism"
    },
    {
        ", but also on a smaller level ": null
    },
    {
        "Luxemburgism": "luxemburgism"
    },
    {
        " —on the world stage. At the same time, ": null
    },
    {
        "social democratic": "social democracy"
    },
    {
        " parties won elections and formed governments for the first time, often as a result of the introduction of ": null
    },
    {
        "universal suffrage": "universal suffrage"
    },
    {
        ".        From the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " until 1971, when ": null
    },
    {
        "John Rawls": "john rawls"
    },
    {
        " published  A Theory of Justice , political philosophy declined in the Anglo-American academic world, as analytic philosophers expressed skepticism about the possibility that normative judgments had cognitive content, and political science turned toward statistical methods and ": null
    },
    {
        "behavioralism": "behavioralism"
    },
    {
        ". In continental Europe, on the other hand, the postwar decades saw a huge blossoming of political philosophy, with ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        " dominating the field. This was the time of ": null
    },
    {
        "Jean-Paul Sartre": "jean-paul sartre"
    },
    {
        " and ": null
    },
    {
        "Louis Althusser": "louis althusser"
    },
    {
        ", and the victories of ": null
    },
    {
        "Mao Zedong": "mao zedong"
    },
    {
        " in China and ": null
    },
    {
        "Fidel Castro": "fidel castro"
    },
    {
        " in Cuba, as well as the events of May 1968 led to increased interest in revolutionary ideology, especially by the ": null
    },
    {
        "New Left": "new left"
    },
    {
        ". A number of continental European émigrés to Britain and the United States—including ": null
    },
    {
        "Karl Popper": "karl popper"
    },
    {
        ", ": null
    },
    {
        "Friedrich Hayek": "friedrich hayek"
    },
    {
        ", ": null
    },
    {
        "Leo Strauss": "leo strauss"
    },
    {
        ", ": null
    },
    {
        "Hannah Arendt": "hannah arendt"
    },
    {
        ", ": null
    },
    {
        "Isaiah Berlin": "isaiah berlin"
    },
    {
        ", ": null
    },
    {
        "Eric Voegelin": "eric voegelin"
    },
    {
        " and ": null
    },
    {
        "Judith Shklar": "judith shklar"
    },
    {
        "—encouraged continued study in political philosophy in the Anglo-American world, but in the 1950s and 1960s they and their students remained at odds with the analytic establishment.     ": null
    },
    {
        "Communism": "communism"
    },
    {
        " remained an important focus especially during the 1950s and 1960s. ": null
    },
    {
        "Colonialism": "colonialism"
    },
    {
        " and ": null
    },
    {
        "racism": "racism"
    },
    {
        " were important issues that arose. In general, there was a marked trend towards a ": null
    },
    {
        "pragmatic": "pragmatism"
    },
    {
        " approach to political issues, rather than a philosophical one. Much academic debate regarded one or both of two pragmatic topics: how to apply ": null
    },
    {
        "utilitarianism": "utilitarianism"
    },
    {
        " to problems of political policy, or how to apply economic models  to political issues. The rise of ": null
    },
    {
        "feminism": "feminism"
    },
    {
        ", ": null
    },
    {
        "LGBT social movements": "lgbt social movements"
    },
    {
        " and the end of colonial rule and of the political exclusion of such minorities as ": null
    },
    {
        "African Americans": "african americans"
    },
    {
        " and sexual minorities in the developed world has led to feminist, ": null
    },
    {
        "postcolonial": "postcolonial"
    },
    {
        ", and ": null
    },
    {
        "multicultural": "multicultural"
    },
    {
        " thought becoming significant. This led to a challenge to the ": null
    },
    {
        "social contract": "social contract"
    },
    {
        " by philosophers ": null
    },
    {
        "Charles W. Mills": "charles w. mills"
    },
    {
        " in his book  The Racial Contract  and ": null
    },
    {
        "Carole Pateman": "carole pateman"
    },
    {
        " in her book  The Sexual Contract  that the social contract excluded persons of colour and women respectively.     In Anglo-American academic political philosophy, the publication of ": null
    },
    {
        "John Rawlss": "john rawls"
    },
    {
        "  A Theory of Justice  in 1971 is considered a milestone. Rawls used a ": null
    },
    {
        "thought experiment": "thought experiment"
    },
    {
        ", the ": null
    },
    {
        "original position": "original position"
    },
    {
        ", in which representative parties choose principles of justice for the basic structure of society from behind a veil of ignorance. Rawls also offered a criticism of utilitarian approaches to questions of political justice. ": null
    },
    {
        "Robert Nozicks": "robert nozick"
    },
    {
        "1974 book  Anarchy, State, and Utopia , which won a ": null
    },
    {
        "National Book Award": "national book award"
    },
    {
        ", responded to Rawls from a ": null
    },
    {
        "libertarian": "libertarianism"
    },
    {
        " perspective and gained academic respectability for libertarian viewpoints. David Lewis Schaefer, , ": null
    },
    {
        "The New York Sun": "the new york sun"
    },
    {
        ", April 30, 2008.     Contemporaneously with the rise of analytic ethics in Anglo-American thought, in Europe several new lines of philosophy directed at critique of existing societies arose between the 1950s and 1980s. Most of these took elements of Marxist economic analysis, but combined them with a more cultural or ideological emphasis. Out of the ": null
    },
    {
        "Frankfurt School": "frankfurt school"
    },
    {
        ", thinkers like ": null
    },
    {
        "Herbert Marcuse": "herbert marcuse"
    },
    {
        ", ": null
    },
    {
        "Theodor W. Adorno": "theodor w. adorno"
    },
    {
        ", ": null
    },
    {
        "Max Horkheimer": "max horkheimer"
    },
    {
        ", and ": null
    },
    {
        "Jürgen Habermas": "jürgen habermas"
    },
    {
        " combined Marxian and Freudian perspectives. Along somewhat different lines, a number of other continental thinkers—still largely influenced by Marxism—put new emphases on ": null
    },
    {
        "structuralism": "structuralism"
    },
    {
        " and on a return to ": null
    },
    {
        "Hegel": "hegel"
    },
    {
        " . Within the structuralist line are thinkers such as ": null
    },
    {
        "Gilles Deleuze": "gilles deleuze"
    },
    {
        ", ": null
    },
    {
        "Michel Foucault": "michel foucault"
    },
    {
        ", ": null
    },
    {
        "Claude Lefort": "claude lefort"
    },
    {
        ", and ": null
    },
    {
        "Jean Baudrillard": "jean baudrillard"
    },
    {
        ". The ": null
    },
    {
        "Situationists": "situationist international"
    },
    {
        " were more influenced by Hegel; ": null
    },
    {
        "Guy Debord": "guy debord"
    },
    {
        ", in particular, moved a Marxist analysis of ": null
    },
    {
        "commodity fetishism": "commodity fetishism"
    },
    {
        " to the realm of consumption, and looked at the relation between consumerism and dominant ideology formation.     Another debate developed around the criticisms of liberal political theory made by ": null
    },
    {
        "Michael Walzer": "michael walzer"
    },
    {
        ", ": null
    },
    {
        "Michael Sandel": "michael sandel"
    },
    {
        " and ": null
    },
    {
        "Charles Taylor": "charles taylor"
    },
    {
        ". The ": null
    },
    {
        "liberal": "liberalism"
    },
    {
        "-": null
    },
    {
        "communitarian": "communitarian"
    },
    {
        " debate is often considered valuable for generating a new set of philosophical problems, rather than a profound and illuminating clash of perspective. These and other communitarians  argue that, contra liberalism, communities are prior to individuals and therefore should be the center of political focus. Communitarians tend to support greater local control as well as economic and social policies which encourage the growth of ": null
    },
    {
        "social capital": "social capital"
    },
    {
        ".     A prominent subject in recent political philosophy is the theory of ": null
    },
    {
        "deliberative democracy": "deliberative democracy"
    },
    {
        ". The seminal work was done by Jurgen Habermas in Germany, but the most extensive literature has been in English, led by theorists such as ": null
    },
    {
        "Jane Mansbridge": "jane mansbridge"
    },
    {
        ", Joshua Cohen, Amy Gutmann and Dennis Thompson. Gutmann, Amy, and Dennis Thompson, Democracy and Disagreement . Also see Gutmann and Thompson, Why Deliberative Democracy? .     A pair of overlapping political perspectives arising toward the end of the 20th century are ": null
    },
    {
        "republicanism": "republicanism"
    },
    {
        " and the ": null
    },
    {
        "capability approach": "capability approach"
    },
    {
        ". The resurgent republican movement aims to provide an alternate definition of liberty from ": null
    },
    {
        "Isaiah Berlins": "isaiah berlin"
    },
    {
        "positive and negative forms of liberty, namely liberty as non-domination. Unlike the American liberal movement which understands liberty as non-interference, non-domination entails individuals not being subject to the arbitrary will of any other person. To a republican the mere status as a slave, regardless of how that slave is treated, is objectionable. Prominent republicans include historian ": null
    },
    {
        "Quentin Skinner": "quentin skinner"
    },
    {
        ", jurist ": null
    },
    {
        "Cass Sunstein": "cass sunstein"
    },
    {
        ", and political philosopher ": null
    },
    {
        "Philip Pettit": "philip pettit"
    },
    {
        ". The capability approach, pioneered by economists ": null
    },
    {
        "Mahbub ul Haq": "mahbub ul haq"
    },
    {
        " and ": null
    },
    {
        "Amartya Sen": "amartya sen"
    },
    {
        " and further developed by legal scholar ": null
    },
    {
        "Martha Nussbaum": "martha nussbaum"
    },
    {
        ", understands freedom under allied lines: the real-world ability to act. Both the capability approach and republicanism treat choice as something which must be resourced. In other words, it is not enough to be legally able to do something, but to have the real option of doing it.     Another important strand of contemporary political theory in North America draws on thinkers such as ": null
    },
    {
        "Friedrich Nietzsche": "friedrich nietzsche"
    },
    {
        ", ": null
    },
    {
        "Michel Foucault": "michel foucault"
    },
    {
        ", ": null
    },
    {
        "Jacques Derrida": "jacques derrida"
    },
    {
        ", and ": null
    },
    {
        "Gilles Deleuze": "gilles deleuze"
    },
    {
        ", among others, to develop critiques and articulate alternatives to the sufficiency of the ": null
    },
    {
        "liberal": "liberalism"
    },
    {
        "-": null
    },
    {
        "communitarian": "communitarianism"
    },
    {
        " debate and ": null
    },
    {
        "republicanism": "republicanism"
    },
    {
        " discourse. Since the 1990s, these political theorists, broadly engaging the ": null
    },
    {
        "genealogical approach": "genealogy"
    },
    {
        " ,": null
    },
    {
        " deconstruction": "deconstruction"
    },
    {
        " , and ": null
    },
    {
        " weak ontology": "weak ontology"
    },
    {
        " , have expanded the scope of political theory and issued a variety of arguments on topics such as ": null
    },
    {
        "pluralism": "pluralism"
    },
    {
        ", ": null
    },
    {
        "agonism": "agonism"
    },
    {
        ", ": null
    },
    {
        "gender performativity": "performativity"
    },
    {
        ", secularism   , and more recently the Anthropocene  and the non-human turn  . The works of ": null
    },
    {
        "Judith Butler": "judith butler"
    },
    {
        ", ": null
    },
    {
        "William E. Connolly": "william e. connolly"
    },
    {
        ", ": null
    },
    {
        "Wendy Brown": "wendy brown"
    },
    {
        ", ": null
    },
    {
        "Jane Bennett": "jane bennett"
    },
    {
        ", and ": null
    },
    {
        "Bonnie Honig": "bonnie honig"
    },
    {
        " have been highly pertinent in this regard.       A larger ": null
    },
    {
        "list of political philosophers": "list of political philosophers"
    },
    {
        " is intended to be closer to exhaustive. Listed below are some of the most ": null
    },
    {
        "canonical": "archetype"
    },
    {
        " or important thinkers, and especially philosophers whose central focus was in political philosophy and/or who are good representatives of a particular school of thought.   ": null
    },
    {
        "Thomas Aquinas": "thomas aquinas"
    },
    {
        ": In synthesizing Christian theology and Peripatetic teaching in his  Treatise on Law , Aquinas contends that Gods gift of higher reason—manifest in human law by way of the divine virtues—gives way to the assembly of righteous government.   ": null
    },
    {
        "Aristotle": "aristotle"
    },
    {
        ": Wrote his  Politics  as an extension of his  Nicomachean Ethics . Notable for the theories that humans are social animals, and that the ": null
    },
    {
        "polis": "polis"
    },
    {
        " existed to bring about the good life appropriate to such animals. His political theory is based upon an ethics of ": null
    },
    {
        "perfectionism": "perfectionism"
    },
    {
        " .   ": null
    },
    {
        "Mikhail Bakunin": "mikhail bakunin"
    },
    {
        ": After ": null
    },
    {
        "Pierre Joseph Proudhon": "pierre joseph proudhon"
    },
    {
        ", Bakunin became the most important political philosopher of ": null
    },
    {
        "anarchism": "anarchism"
    },
    {
        ". His specific version of anarchism is called ": null
    },
    {
        "collectivist anarchism": "collectivist anarchism"
    },
    {
        ".   ": null
    },
    {
        "Jeremy Bentham": "jeremy bentham"
    },
    {
        ": The first thinker to analyze social justice in terms of maximization of aggregate individual benefits. Founded the philosophical/ethical school of thought known as ": null
    },
    {
        "utilitarianism": "utilitarianism"
    },
    {
        ".   ": null
    },
    {
        "Isaiah Berlin": "isaiah berlin"
    },
    {
        ": Developed the distinction between positive and negative liberty.   ": null
    },
    {
        "Edmund Burke": "edmund burke"
    },
    {
        ": Irish member of the British parliament, Burke is credited with the creation of ": null
    },
    {
        "conservative": "conservatism"
    },
    {
        " thought. Burkes  Reflections on the Revolution in France  is the most popular of his writings where he denounced the French revolution. Burke was one of the biggest supporters of the American Revolution.   ": null
    },
    {
        "Confucius": "confucius"
    },
    {
        ": The first thinker to relate ethics to the political order.   ": null
    },
    {
        "William E. Connolly": "william e. connolly"
    },
    {
        ": Helped introduce postmodern philosophy into political theory, and promoted new theories of ": null
    },
    {
        "Pluralism": "pluralism"
    },
    {
        " and ": null
    },
    {
        "agonistic democracy": "agonistic democracy"
    },
    {
        ".   ": null
    },
    {
        "John Dewey": "john dewey"
    },
    {
        ": Co-founder of ": null
    },
    {
        "pragmatism": "pragmatism"
    },
    {
        " and analyzed the essential role of education in the maintenance of democratic government.   ": null
    },
    {
        "Han Feizi": "han feizi"
    },
    {
        ": The major figure of the Chinese Fajia  school, advocated government that adhered to laws and a strict method of administration.   ": null
    },
    {
        "Michel Foucault": "michel foucault"
    },
    {
        ": Critiqued the modern conception of power on the basis of the ": null
    },
    {
        "prison complex": "prison–industrial complex"
    },
    {
        " and other prohibitive institutions, such as those that designate sexuality, madness and knowledge as the roots of their infrastructure, a critique that demonstrated that subjection is the power formation of subjects in any linguistic forum and that revolution cannot just be thought as the reversal of power between classes.   ": null
    },
    {
        "Antonio Gramsci": "antonio gramsci"
    },
    {
        ": Instigated the concept of  hegemony . Argued that the ": null
    },
    {
        "state": "sovereign state"
    },
    {
        " and the ruling class uses ": null
    },
    {
        "culture": "culture"
    },
    {
        " and ": null
    },
    {
        "ideology": "ideology"
    },
    {
        " to gain the consent of the classes it rules over.   ": null
    },
    {
        "Thomas Hill Green": "thomas hill green"
    },
    {
        ": Modern liberal thinker and early supporter of ": null
    },
    {
        "positive freedom": "positive freedom"
    },
    {
        ".   ": null
    },
    {
        "Jürgen Habermas": "jürgen habermas"
    },
    {
        ": Contemporary democratic theorist and sociologist. He has pioneered such concepts as the ": null
    },
    {
        "public sphere": "public sphere"
    },
    {
        ", ": null
    },
    {
        "communicative action": "communicative action"
    },
    {
        ", and ": null
    },
    {
        "deliberative democracy": "deliberative democracy"
    },
    {
        ". His early work was heavily influenced by the ": null
    },
    {
        "Frankfurt School": "frankfurt school"
    },
    {
        ".   ": null
    },
    {
        "Friedrich Hayek": "friedrich hayek"
    },
    {
        ": He argued that central planning was inefficient because members of central bodies could not know enough to match the preferences of consumers and workers with existing conditions. Hayek further argued that ": null
    },
    {
        "central economic planning": "command economy"
    },
    {
        "—a mainstay of socialism—would lead to a total state with dangerous power. He advocated ": null
    },
    {
        "free-market": "free-market"
    },
    {
        " capitalism in which the main role of the state is to maintain the ": null
    },
    {
        "rule of law": "rule of law"
    },
    {
        " and let spontaneous order develop.   ": null
    },
    {
        "G. W. F. Hegel": "g. w. f. hegel"
    },
    {
        ": Emphasized the cunning of history, arguing that it followed a rational trajectory, even while embodying seemingly irrational forces; influenced Marx, ": null
    },
    {
        "Kierkegaard": "kierkegaard"
    },
    {
        ", ": null
    },
    {
        "Nietzsche": "nietzsche"
    },
    {
        ", and ": null
    },
    {
        "Oakeshott": "michael oakeshott"
    },
    {
        ".   ": null
    },
    {
        "Thomas Hobbes": "thomas hobbes"
    },
    {
        ": Generally considered to have first articulated how the concept of a ": null
    },
    {
        "social contract": "social contract"
    },
    {
        " that justifies the actions of rulers , can be reconciled with a conception of sovereignty.   ": null
    },
    {
        "David Hume": "david hume"
    },
    {
        ": Hume criticized the social contract theory of John Locke and others as resting on a myth of some actual agreement. Hume was a realist in recognizing the role of force to forge the existence of states and that ": null
    },
    {
        "consent of the governed": "consent of the governed"
    },
    {
        " was merely hypothetical. He also introduced the concept of ": null
    },
    {
        "utility": "utility"
    },
    {
        ", later picked up on and developed by ": null
    },
    {
        "Jeremy Bentham": "jeremy bentham"
    },
    {
        ".   ": null
    },
    {
        "Thomas Jefferson": "thomas jefferson"
    },
    {
        ": Politician and political theorist during the ": null
    },
    {
        "American Enlightenment": "american enlightenment"
    },
    {
        ". Expanded on the philosophy of Thomas Paine by instrumenting ": null
    },
    {
        "republicanism": "republicanism"
    },
    {
        " in the United States. Most famous for the ": null
    },
    {
        "United States Declaration of Independence": "united states declaration of independence"
    },
    {
        ".   ": null
    },
    {
        "Immanuel Kant": "immanuel kant"
    },
    {
        ": Argued that participation in civil society is undertaken not for self-preservation, as per ": null
    },
    {
        "Thomas Hobbes": "hobbes"
    },
    {
        ", but as a moral duty. First modern thinker who fully analyzed structure and meaning of obligation. Argued that an international organization was needed to preserve world peace.   ": null
    },
    {
        "Peter Kropotkin": "peter kropotkin"
    },
    {
        ": One of the classic anarchist thinkers and the most influential theorist of ": null
    },
    {
        "anarcho-communism": "anarcho-communism"
    },
    {
        ".   ": null
    },
    {
        "John Locke": "john locke"
    },
    {
        ": Like Hobbes, described a social contract theory based on citizens fundamental rights in the ": null
    },
    {
        "state of nature": "state of nature"
    },
    {
        ". He departed from Hobbes in that, based on the assumption of a society in which moral values are independent of governmental authority and widely shared, he argued for a government with power limited to the protection of personal property. His arguments may have been deeply influential to the formation of the ": null
    },
    {
        "United States Constitution": "united states constitution"
    },
    {
        ".   ": null
    },
    {
        "Niccolò Machiavelli": "niccolò machiavelli"
    },
    {
        ": First systematic analysis of how politics necessitates expedient and evil actions. Gave an account of statecraft in a realistic point of view instead of relying on idealism. Machiavelli also relays recommendations on how to run a well ordered ": null
    },
    {
        "republican": "republicanism"
    },
    {
        " state, as he viewed them to be better forms of government than autocracies.   ": null
    },
    {
        "James Madison": "james madison"
    },
    {
        ": American politician and protege of Jefferson considered to be Father of the ": null
    },
    {
        "Constitution": "united states constitution"
    },
    {
        " and Father of the ": null
    },
    {
        "Bill of Rights": "united states bill of rights"
    },
    {
        " of the United States. As a political theorist, he believed in ": null
    },
    {
        "separation of powers": "separation of powers"
    },
    {
        " and proposed a comprehensive set of ": null
    },
    {
        "checks and balances": "separation of powerschecks and balances"
    },
    {
        " that are necessary to protect the rights of an individual from the ": null
    },
    {
        "tyranny of the majority": "tyranny of the majority"
    },
    {
        ".   ": null
    },
    {
        "Herbert Marcuse": "herbert marcuse"
    },
    {
        ": Called the father of the ": null
    },
    {
        "new left": "new left"
    },
    {
        ". One of the principal thinkers within the ": null
    },
    {
        "Frankfurt School": "frankfurt school"
    },
    {
        ", and generally important in efforts to fuse the thought of ": null
    },
    {
        "Sigmund Freud": "sigmund freud"
    },
    {
        " and ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        ". Introduced the concept of ": null
    },
    {
        "repressive desublimation": "repressive desublimation"
    },
    {
        " , in which social control can operate not only by direct control, but also by manipulation of desire. His work ": null
    },
    {
        "Eros and Civilization": "eros and civilization"
    },
    {
        " and notion of a non-repressive society was influential on the 1960s and its counter-cultural social movements.   ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        ": In large part, added the historical dimension to an understanding of society, culture and economics. Created the concept of ideology in the sense of beliefs that shape and control social actions. Analyzed the fundamental nature of class as a mechanism of governance and social interaction. Profoundly influenced world politics with his theory of communism.   ": null
    },
    {
        "Mencius": "mencius"
    },
    {
        ": One of the most important thinkers in the Confucian school, he is the first theorist to make a coherent argument for an obligation of rulers to the ruled.   ": null
    },
    {
        "John Stuart Mill": "john stuart mill"
    },
    {
        ": A ": null
    },
    {
        "utilitarian": "utilitarian"
    },
    {
        ", and the person who named the system; he goes further than Bentham by laying the foundation for liberal democratic thought in general and modern, as opposed to classical, liberalism in particular. Articulated the place of individual liberty in an otherwise utilitarian framework.   ": null
    },
    {
        "Baron de Montesquieu": "charles de secondat, baron de montesquieu"
    },
    {
        ": Analyzed protection of the people by a balance of powers in the divisions of a state.   ": null
    },
    {
        "John Rawls": "john rawls"
    },
    {
        ": Revitalized the study of normative political philosophy in Anglo-American universities with his 1971 book ": null
    },
    {
        "A Theory of Justice": "a theory of justice"
    },
    {
        ", which uses a version of ": null
    },
    {
        "social contract theory": "social contract theory"
    },
    {
        " to answer fundamental questions about ": null
    },
    {
        "justice": "justice"
    },
    {
        " and to criticise ": null
    },
    {
        "utilitarianism": "utilitarianism"
    },
    {
        ".   ": null
    },
    {
        "Mozi": "mozi"
    },
    {
        ": Eponymous founder of the Mohist school, advocated a form of ": null
    },
    {
        "consequentialism": "mohist consequentialism"
    },
    {
        ".   ": null
    },
    {
        "Friedrich Nietzsche": "friedrich nietzsche"
    },
    {
        ": Philosopher who became a powerful influence on a broad spectrum of 20th-century political currents in ": null
    },
    {
        "Marxism": "marxism"
    },
    {
        ", ": null
    },
    {
        "anarchism": "anarchism"
    },
    {
        ", ": null
    },
    {
        "fascism": "fascism"
    },
    {
        ", ": null
    },
    {
        "socialism": "socialism"
    },
    {
        ", ": null
    },
    {
        "libertarianism": "libertarianism"
    },
    {
        ", and ": null
    },
    {
        "conservatism": "conservatism"
    },
    {
        ". His interpreters have debated the content of his political philosophy.   ": null
    },
    {
        "Robert Nozick": "robert nozick"
    },
    {
        ": Criticized Rawls, and argued for ": null
    },
    {
        "libertarianism": "libertarianism"
    },
    {
        ", by appeal to a hypothetical history of the ": null
    },
    {
        "state": "state"
    },
    {
        " and of ": null
    },
    {
        "property": "property"
    },
    {
        ".   ": null
    },
    {
        "Thomas Paine": "thomas paine"
    },
    {
        ": ": null
    },
    {
        "Enlightenment": "age of enlightenment"
    },
    {
        " writer who defended ": null
    },
    {
        "liberal democracy": "liberal democracy"
    },
    {
        ", the ": null
    },
    {
        "American Revolution": "american revolution"
    },
    {
        ", and the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " in  Common Sense  and The  Rights of Man .   ": null
    },
    {
        "Plato": "plato"
    },
    {
        ": Wrote a lengthy dialog  The Republic  in which he laid out his political philosophy: citizens should be divided into three categories. One category of people are the rulers: they should be philosophers, according to Plato, this idea is based on his ": null
    },
    {
        "Theory of Forms": "theory of forms"
    },
    {
        ".   ": null
    },
    {
        "Pierre-Joseph Proudhon": "pierre-joseph proudhon"
    },
    {
        ": Commonly considered the father of modern ": null
    },
    {
        "anarchism": "anarchism"
    },
    {
        ", specifically ": null
    },
    {
        "mutualism": "mutualism"
    },
    {
        ".   ": null
    },
    {
        "Ayn Rand": "ayn rand"
    },
    {
        ": Founder of ": null
    },
    {
        "Objectivism": "objectivism"
    },
    {
        " and prime mover of the Objectivist and Libertarian movements in mid-twentieth-century America. Advocated a complete, laissez-faire capitalism. Rand held that the proper role of government was exclusively the protection of individual rights without economic interference. The government was to be separated from economics the same way and for the same reasons it was separated from religion. Any governmental action not directed at the defense of individual rights would constitute the initiation of force , and therefore a violation not only of rights but also of the legitimate function of government.   ": null
    },
    {
        "Murray Rothbard": "murray rothbard"
    },
    {
        ": The central theorist of ": null
    },
    {
        "anarcho-capitalism": "anarcho-capitalism"
    },
    {
        " and an ": null
    },
    {
        "Austrian School": "austrian school"
    },
    {
        " economist.   ": null
    },
    {
        "Jean-Jacques Rousseau": "jean-jacques rousseau"
    },
    {
        ": Analyzed the social contract as an expression of the ": null
    },
    {
        "general will": "general will"
    },
    {
        ", and controversially argued in favor of absolute ": null
    },
    {
        "democracy": "democracy"
    },
    {
        " where the people at large would act as ": null
    },
    {
        "sovereign": "sovereignty"
    },
    {
        ".   ": null
    },
    {
        "Carl Schmitt": "carl schmitt"
    },
    {
        ": German political theorist, tied to the Nazis, who developed the concepts of the Friend/Enemy Distinction and the State of exception. Though his most influential books were written in the 1920s, he continued to write prolifically until his death in 1985. He heavily influenced 20th-century political philosophy both within the Frankfurt School and among others, not all of whom are philosophers, such as ": null
    },
    {
        "Jacques Derrida": "jacques derrida"
    },
    {
        ", ": null
    },
    {
        "Hannah Arendt": "hannah arendt"
    },
    {
        ", and ": null
    },
    {
        "Giorgio Agamben": "giorgio agamben"
    },
    {
        ".   ": null
    },
    {
        "Adam Smith": "adam smith"
    },
    {
        ": Often said to have founded modern ": null
    },
    {
        "economics": "economics"
    },
    {
        "; explained emergence of economic benefits from the self-interested behavior of artisans and traders. While praising its efficiency, Smith also expressed concern about the effects of industrial labor on workers. His work on moral sentiments sought to explain social bonds which enhance economic activity.   ": null
    },
    {
        "Socrates": "socrates"
    },
    {
        ": Widely considered the founder of Western political philosophy, via his spoken influence on Athenian contemporaries; since Socrates never wrote anything, much of what we know about him and his teachings comes through his most famous student, Plato.   ": null
    },
    {
        "Baruch Spinoza": "baruch spinoza"
    },
    {
        ": Set forth the first analysis of  rational egoism , in which the rational interest of self is conformance with pure reason. To Spinozas thinking, in a society in which each individual is guided by reason, political authority would be superfluous.   ": null
    },
    {
        "Max Stirner": "max stirner"
    },
    {
        ": Important thinker within ": null
    },
    {
        "anarchism": "anarchism"
    },
    {
        " and the main representative of the anarchist current known as ": null
    },
    {
        "individualist anarchism": "individualist anarchism"
    },
    {
        ".   ": null
    },
    {
        "Leo Strauss": "leo strauss"
    },
    {
        ": Famously rejected modernity, mostly on the grounds of what he perceived to be modern political philosophys excessive self-sufficiency of reason and flawed philosophical grounds for moral and political normativity. He argued instead we should return to pre-modern thinkers for answers to contemporary issues. His philosophy was influential on the formation of ": null
    },
    {
        "neoconservatism": "neoconservatism"
    },
    {
        ", and a number of his students later were members of the ": null
    },
    {
        "Bush administration": "presidency of george w. bush"
    },
    {
        ".   ": null
    },
    {
        "Henry David Thoreau": "henry david thoreau"
    },
    {
        ": Influential American thinker on such diverse later political positions and topics such as ": null
    },
    {
        "pacifism": "pacifism"
    },
    {
        ", ": null
    },
    {
        "anarchism": "anarchism"
    },
    {
        ", ": null
    },
    {
        "environmentalism": "environmentalism"
    },
    {
        " and ": null
    },
    {
        "civil disobedience": "civil disobedience"
    },
    {
        " who influenced later important political activists such as ": null
    },
    {
        "Martin Luther King": "martin luther king"
    },
    {
        ", ": null
    },
    {
        "Mahatma Gandhi": "mahatma gandhi"
    },
    {
        " and ": null
    },
    {
        "Leo Tolstoy": "leo tolstoy"
    },
    {
        ".   ": null
    },
    {
        "François-Marie Arouet ": "voltaire"
    },
    {
        ": French Enlightenment writer, poet, and philosopher famous for his advocacy of civil liberties, including freedom of religion and free trade.   ": null
    },
    {
        "Bernard Williams": "bernard williams"
    },
    {
        ": A British moral philosopher whose posthumously published work on political philosophy In the Beginning was the Deed has been seen—along with the works of ": null
    },
    {
        "Raymond Geuss": "raymond geuss"
    },
    {
        "—as a key foundational work on political realism.   ": null
    },
    {
        "Alexis de Tocqueville": "alexis de tocqueville"
    },
    {
        ": A French political scientist and diplomat, known for his works  Democracy in America  and  The Old Regime and the Revolution ": null
    }
]