[
    {
        "           Germany": "Germany"
    },
    {
        " is a ": null
    },
    {
        "democratic": "Democracy"
    },
    {
        ", ": null
    },
    {
        "federal": "Federation"
    },
    {
        " parliamentary": "Parliamentary System"
    },
    {
        " republic": "Republic"
    },
    {
        ", where federal ": null
    },
    {
        "legislative power": "Legislative Power"
    },
    {
        " is vested in the ": null
    },
    {
        "Bundestag": "Bundestag"
    },
    {
        " and the ": null
    },
    {
        "Bundesrat": "Bundesrat Of Germany"
    },
    {
        " .     The multilateral system has, since 1949, been dominated by the ": null
    },
    {
        "Christian Democratic Union": "Christian Democratic Union Of Germany"
    },
    {
        " and the ": null
    },
    {
        "Social Democratic Party of Germany": "Social Democratic Party Of Germany"
    },
    {
        " . The ": null
    },
    {
        "judiciary of Germany": "Judiciary Of Germany"
    },
    {
        " is independent of the ": null
    },
    {
        "executive": "Executive"
    },
    {
        " and the ": null
    },
    {
        "legislature": "Legislature"
    },
    {
        ", while it is common for leading members of the executive to be members of the legislature as well. The political system is laid out in the 1949 constitution, the  Grundgesetz  , which remained in effect with minor amendments after ": null
    },
    {
        "German reunification": "German Reunification"
    },
    {
        " in 1990.     The constitution emphasizes the protection of ": null
    },
    {
        "individual liberty": "Individual Liberty"
    },
    {
        " in an extensive catalogue of ": null
    },
    {
        "human": "Human Rights In Germany"
    },
    {
        " and ": null
    },
    {
        "civil rights": "Civil Rights"
    },
    {
        " and divides powers both between the federal and state levels and between the legislative, executive and judicial branches.     West Germany was a founding member of the ": null
    },
    {
        "European Community": "European Communities"
    },
    {
        " in 1958, which became the ": null
    },
    {
        "EU": "European Union"
    },
    {
        " in 1993. It is part of the ": null
    },
    {
        "Schengen Area": "Schengen Area"
    },
    {
        ", and has been a member of the ": null
    },
    {
        "eurozone": "Eurozone"
    },
    {
        " since 1999. It is a member of the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        ", ": null
    },
    {
        "NATO": "Nato"
    },
    {
        ", the ": null
    },
    {
        "G7": "G7"
    },
    {
        ", the ": null
    },
    {
        "G20": "G-20 Major Economies"
    },
    {
        " and the ": null
    },
    {
        "OECD": "Organisation For Economic Co-Operation And Development"
    },
    {
        ".                After 1949, the ": null
    },
    {
        "Federal Republic of Germany": "West Germany"
    },
    {
        " had ": null
    },
    {
        "Christian Democratic": "Cdu/Csu"
    },
    {
        " chancellors for 20 years until a coalition between the ": null
    },
    {
        "Social Democrats": "Social Democratic Party Of Germany"
    },
    {
        " and the ": null
    },
    {
        "Liberals": "Free Democratic Party"
    },
    {
        " took over. From 1982, Christian Democratic leader ": null
    },
    {
        "Helmut Kohl": "Helmut Kohl"
    },
    {
        " was chancellor in a coalition with the Liberals for 16 years. In this period fell the reunification of Germany, in 1990: the ": null
    },
    {
        "German Democratic Republic": "German Democratic Republic"
    },
    {
        " joined the Federal Republic. In the former GDRs territory, five Länder were established or reestablished. The two parts of Berlin united as one Land .     The political system of the Federal Republic remained more or less unchanged. Specific provisions for the former GDR territory were enabled via the unification treaty between the Federal Republic and the GDR prior to the ": null
    },
    {
        "unification day": "German Unity Day"
    },
    {
        " of 3 October 1990. However, Germany saw in the following two distinct party systems: the Green party and the Liberals remained mostly West German parties, while in the East the former socialist state party, now called PDS, flourished along with the Christian Democrats and Social Democrats.               After 16 years of the Christian–Liberal coalition, led by ": null
    },
    {
        "Helmut Kohl": "Helmut Kohl"
    },
    {
        ", the ": null
    },
    {
        "Social Democratic Party of Germany": "Social Democratic Party Of Germany"
    },
    {
        " together with the Greens won the Bundestag elections of 1998. SPD vice chairman ": null
    },
    {
        "Gerhard Schröder": "Gerhard Schröder"
    },
    {
        " positioned himself as a centrist candidate, in contradiction to the leftist SPD chairman ": null
    },
    {
        "Oskar Lafontaine": "Oskar Lafontaine"
    },
    {
        ". The Kohl government was hurt at the polls by slower economic growth in the East in the previous two years, and constantly high unemployment. The final margin of victory was sufficiently high to permit a red-green coalition of the SPD with ": null
    },
    {
        "Alliance 90/The Greens": "Alliance 90/The Greens"
    },
    {
        " , bringing the Greens into a national government for the first time.     Initial problems of the new government, marked by policy disputes between the moderate and traditional left wings of the SPD, resulted in some voter disaffection. Lafontaine left the government in early 1999. The CDU won in some important state elections but was hit in 2000 by a party donation scandal from the Kohl years. As a result of this ": null
    },
    {
        "Christian Democratic Union": "Christian Democratic Union"
    },
    {
        " crisis, ": null
    },
    {
        "Angela Merkel": "Angela Merkel"
    },
    {
        " became chair.     The ": null
    },
    {
        "next election for the Bundestag": "2002 German Federal Election"
    },
    {
        " was on 22 September 2002. Gerhard Schröder led the coalition of SPD and Greens to an eleven-seat victory over the Christian Democrat challengers headed by ": null
    },
    {
        "Edmund Stoiber": "Edmund Stoiber"
    },
    {
        " . Three factors are generally cited that enabled Schröder to win the elections despite poor approval ratings a few months before and a weaker economy: good handling of the ": null
    },
    {
        "100-year flood": "2002 European Floods"
    },
    {
        ", firm opposition to the US ": null
    },
    {
        "2003 invasion of Iraq": "2003 Invasion Of Iraq"
    },
    {
        ", and Stoibers unpopularity in the east, which cost the CDU crucial seats there.     In its second term, the red–green coalition lost several very important state elections, for example in ": null
    },
    {
        "Lower Saxony": "Lower Saxony"
    },
    {
        " where Schröder was the prime minister from 1990 to 1998. On 20 April 2003, chancellor Schröder announced massive labor market reforms, called ": null
    },
    {
        "Agenda 2010": "Agenda 2010"
    },
    {
        ", that cut unemployment benefits. Although these reforms sparked massive protests, they are now credited with being in part responsible for the relatively strong economic performance of Germany during the ": null
    },
    {
        "euro-crisis": "European Debt Crisis"
    },
    {
        " and the decrease in unemployment in Germany in the years 2006-2007.                On 22 May 2005 the SPD received a devastating defeat in its former heartland, ": null
    },
    {
        "North Rhine-Westphalia": "North Rhine-Westphalia"
    },
    {
        ". Half an hour after the election results, the SPD chairman ": null
    },
    {
        "Franz Müntefering": "Franz Müntefering"
    },
    {
        " announced that the chancellor would clear the way for new federal elections.     This took the republic by surprise, especially because the SPD was below 20% in polls at the time. The CDU quickly announced ": null
    },
    {
        "Angela Merkel": "Angela Merkel"
    },
    {
        " as Christian Democrat candidate for chancellor, aspiring to be the first female chancellor in German history.     New for the 2005 election was the alliance between the newly formed ": null
    },
    {
        "Electoral Alternative for Labor and Social Justice": "Electoral Alternative For Labor And Social Justice"
    },
    {
        " and the PDS, planning to fuse into a common party . With the former SPD chairman, Oskar Lafontaine for the WASG and ": null
    },
    {
        "Gregor Gysi": "Gregor Gysi"
    },
    {
        " for the PDS as prominent figures, this alliance soon found interest in the media and in the population. Polls in July saw them as high as 12%.     Whereas in May and June 2005 victory of the Christian Democrats seemed highly likely, with some polls giving them an absolute majority, this picture changed shortly before the election on 18 September 2005.          The election results of 18 September were surprising because they differed widely from the polls of the previous weeks. The Christian Democrats even lost votes compared to 2002, narrowly reaching the first place with only 35.2%, and failed to get a majority for a black–yellow government of ": null
    },
    {
        "CDU/CSU": "Cdu/Csu"
    },
    {
        " and liberal FDP. But the red–green coalition also failed to get a majority, with the SPD losing votes, but polling 34.2% and the greens staying at 8.1%. ": null
    },
    {
        "The Left": "The Left"
    },
    {
        " reached 8.7% and entered the  Bundestag , whereas the far-right ": null
    },
    {
        "NPD": "National Democratic Party Of Germany"
    },
    {
        " only got 1.6%.       The most likely outcome of coalition talks was a so-called grand coalition between the Christian Democrats and the Social Democrats . Three party coalitions and coalitions involving The Left had been ruled out by all interested parties . On 22 November 2005, Angela Merkel was sworn in by president ": null
    },
    {
        "Horst Köhler": "Horst Köhler"
    },
    {
        " for the office of Bundeskanzlerin.     The existence of the grand coalition on federal level helped smaller parties electoral prospects in state elections. Since in 2008, the CSU lost its absolute majority in Bavaria and formed a coalition with the FDP, the grand coalition had no majority in the Bundesrat and depended on FDP votes on important issues. In November 2008, the SPD re-elected its already retired chair ": null
    },
    {
        "Franz Müntefering": "Franz Müntefering"
    },
    {
        " and made ": null
    },
    {
        "Frank-Walter Steinmeier": "Frank-Walter Steinmeier"
    },
    {
        " its leading candidate for the federal election in September 2009.     As a result of ": null
    },
    {
        "that federal election": "2009 German Federal Election"
    },
    {
        ", the grand coalition brought losses for both parties and came to an end. The SPD suffered the heaviest losses in its history and was unable to form a coalition government. The CDU/CSU had only little losses but also reached a new historic low with its worst result since 1949. The three smaller parties thus had more seats in the German Bundestag than ever before, with the liberal party FDP winning 14.6% of votes.                  The CDU/CSU and FDP together held 332 seats and had been in coalition since 27 October 2009. Angela Merkel was re-elected as chancellor, and ": null
    },
    {
        "Guido Westerwelle": "Guido Westerwelle"
    },
    {
        " served as the ": null
    },
    {
        "foreign minister": "Foreign Office"
    },
    {
        " and vice chancellor of Germany. After being elected into the federal government, the FDP suffered heavy losses in the following state elections. The FDP had promised to lower taxes in the electoral campaign, but after being part of the coalition they had to concede that this was not possible due to the ": null
    },
    {
        "economic crisis": "Great Recession"
    },
    {
        " of 2008. Because of the losses, Guido Westerwelle had to resign as chair of the FDP in favor of ": null
    },
    {
        "Philipp Rösler": "Philipp Rösler"
    },
    {
        ", ": null
    },
    {
        "Federal minister of health": "Federal Ministry Of Health"
    },
    {
        ", who was consequently appointed as ": null
    },
    {
        "vice chancellor": "Vice Chancellor Of Germany"
    },
    {
        ". Shortly after, Philipp Rösler changed office and became ": null
    },
    {
        "federal minister of economics and technology": "Federal Ministry Of Economics And Technology"
    },
    {
        ".     After their electoral fall, the Social Democrats were led by ": null
    },
    {
        "Sigmar Gabriel": "Sigmar Gabriel"
    },
    {
        ", a former federal minister and prime minister of Lower Saxony, and by ": null
    },
    {
        "Frank-Walter Steinmeier": "Frank-Walter Steinmeier"
    },
    {
        " as the head of the parliamentary group. He resigned on 16 January 2017 and proposed his longtime friend and president of ": null
    },
    {
        "European Parliament": "European Parliament"
    },
    {
        " Martin Schulz": "Martin Schulz"
    },
    {
        " as his successor and chancellor candidate.    Germany has seen increased political activity by citizens outside the established political parties with respect to local and ": null
    },
    {
        "environmental": "Environmental Activism"
    },
    {
        " issues such as the location of ": null
    },
    {
        "Stuttgart 21": "Stuttgart 21"
    },
    {
        ", a railway hub, and construction of ": null
    },
    {
        "Berlin Brandenburg Airport": "Berlin Brandenburg Airport"
    },
    {
        ".              The 18th federal elections in Germany resulted in the re-election of ": null
    },
    {
        "Angela Merkel": "Angela Merkel"
    },
    {
        " and her Christian democratic parliamentary group of the parties ": null
    },
    {
        "CDU": "Christian Democratic Union Of Germany"
    },
    {
        " and CSU, receiving 41.5% of all votes. Following Merkels first two historically low results, her third campaign marked the CDU/CSUs best result since 1994 and only for the second time in German history the possibility of gaining an absolute majority. Their former coalition partner, the FDP, narrowly failed to reach the 5% threshold and did not gain seats in the ": null
    },
    {
        "Bundestag": "Bundestag"
    },
    {
        ".      Not having reached an absolute majority, the CDU/CSU formed a ": null
    },
    {
        "grand coalition": "Grand Coalition"
    },
    {
        " with the social-democratic ": null
    },
    {
        "SPD": "Spd"
    },
    {
        " after the longest coalition talks in history, making the head of the party ": null
    },
    {
        "Sigmar Gabriel": "Sigmar Gabriel"
    },
    {
        " vice-chancellor": "Vice-Chancellor Of Germany"
    },
    {
        " and federal ": null
    },
    {
        "Minister for Economic Affairs and Energy": "Federal Ministry For Economic Affairs And Energy"
    },
    {
        ". Together they held 504 of a total 631 seats . The only two opposition parties were The Left and Alliance 90/The Greens , which was acknowledged as creating a critical situation in which the opposition parties did not even have enough seats to use the special controlling powers of the opposition.              The 19th federal elections in Germany took place on 24 September 2017. The two big parties, the conservative parliamentary group ": null
    },
    {
        "CDU/CSU": "Cdu/Csu"
    },
    {
        " and the social democrat ": null
    },
    {
        "SPD": "Social Democratic Party Of Germany"
    },
    {
        " were in a similar situation as in 2009, after the last grand coalition had ended, and both had suffered severe losses; reaching their second worst and worst result respectively in 2017.     Many votes in the 2017 elections went to smaller parties, leading the right-wing populist party ": null
    },
    {
        "AfD": "Alternative For Germany"
    },
    {
        " into the ": null
    },
    {
        "Bundestag": "Bundestag"
    },
    {
        " which marked a big shift in German politics since it was the first far-right party to win seats in parliament since the 1950s.     With Merkels candidacy for a fourth term, the CDU/CSU only reached 33.0% of the votes, but won the highest number of seats, leaving no realistic coalition option without the CDU/CSU. As all parties in the Bundestag strictly ruled out a coalition with the AfD, the only options for a majority coalition were a so-called ": null
    },
    {
        " Jamaican coalition": "Germany Coalition"
    },
    {
        "  and a grand coalition with the SPD, which was at first opposed by the Social Democrats and their leader ": null
    },
    {
        "Martin Schulz": "Martin Schulz"
    },
    {
        ".     Coalition talks between the three Jamaican parties were held but the final proposal was rejected by the liberals of the FDP, leaving the government in limbo.   Following the unprecedented situation, for the first time in German history different minority coalitions or even direct snap coalitions were also heavily discussed. At this point, ": null
    },
    {
        "Federal President": "President Of Germany"
    },
    {
        " Steinmeier": "Frank-Walter Steinmeier"
    },
    {
        " invited leaders of all parties for talks about a government, being the first President in the history of the Federal Republic to do so.     Official coalition talks between CDU/CSU and SPD started in January 2018 and led to a renewal of the grand coalition on 12 March 2018 as well as the subsequent re-election of Angela Merkel as chancellor.             The Basic Law for the Federal Republic of Germany is the Constitution of Germany.  It was formally approved on 8 May 1949, and, with the signature of the ": null
    },
    {
        "Allies of World War II": "Allies Of World War Ii"
    },
    {
        " on 12 May, came into effect on 23 May, as the constitution of those states of ": null
    },
    {
        "West Germany": "West Germany"
    },
    {
        " that were initially included within the Federal Republic. The 1949 Basic Law is a response to the perceived flaws of the 1919 ": null
    },
    {
        "Weimar Constitution": "Weimar Constitution"
    },
    {
        ", which failed to prevent the rise of the Nazi party in 1933. Since 1990, in the course of the reunification process after the fall of the Berlin Wall, the Basic Law also applies to the eastern states of the former ": null
    },
    {
        "German Democratic Republic": "East Germany"
    },
    {
        ".                          The German head of state is the Federal President. As in Germanys ": null
    },
    {
        "parliamentary system": "Parliamentary System"
    },
    {
        " of government, the ": null
    },
    {
        "Federal Chancellor": "Chancellor Of Germany"
    },
    {
        " runs the government and day-to-day politics, the role of the Federal President is mostly ceremonial. The Federal President, by their actions and public appearances, represents the state itself, its existence, its legitimacy, and unity. Their office involves an integrative role. Website of the Federal President of Germany  Retrieved 13 April 2014 Nearly all actions of the Federal President become valid only after a ": null
    },
    {
        "countersignature": "Countersignature"
    },
    {
        " of a government member.     The President is not obliged by Constitution to refrain from political views. He or she is expected to give direction to general political and societal debates, but not in a way that links him to party politics. Most German Presidents were active politicians and party members prior to the office, which means that they have to change their political style when becoming President. The function comprises the official residence of ": null
    },
    {
        "Bellevue Palace": "Bellevue Palace"
    },
    {
        ".     Under Article 59 of the ": null
    },
    {
        "Basic Law": "Basic Law For The Federal Republic Of Germany"
    },
    {
        ", the Federal President represents the Federal Republic of Germany in matters of international law, concludes treaties with foreign states on its behalf and accredits diplomats. Website of the Federal President of Germany  Retrieved 28 April 2014.     All federal laws must be signed by the President before they can come into effect; he or she does not have a veto, but the conditions for refusing to sign a law on the basis of unconstitutionality are the subject of debate.  The office is currently held by ": null
    },
    {
        "Frank-Walter Steinmeier": "Frank-Walter Steinmeier"
    },
    {
        " .     The Federal President does have a role in the political system, especially at the establishment of a new government and the dissolution of the Bundestag . This role is usually nominal but can become significant in case of political instability. Additionally, a Federal President together with the Federal Council can support the government in a legislatory emergency state to enable laws against the will of the Bundestag . However, until now the Federal President has never had to use these ": null
    },
    {
        "reserve powers": "Reserve Power"
    },
    {
        " .               The  Bundeskanzler  heads the  Bundesregierung  and thus the ": null
    },
    {
        "executive branch": "Executive Branch"
    },
    {
        " of the federal government. They are elected by and responsible to the  Bundestag , Germanys parliament. The other members of the government are the Federal Ministers; they are chosen by the Chancellor. Germany, like the United Kingdom, can thus be classified as a ": null
    },
    {
        "parliamentary system": "Parliamentary System"
    },
    {
        ". The office is currently held by ": null
    },
    {
        "Angela Merkel": "Angela Merkel"
    },
    {
        " .     The Chancellor cannot be removed from office during a four-year term unless the Bundestag has agreed on a successor. This ": null
    },
    {
        "constructive vote of no confidence": "Constructive Vote Of No Confidence"
    },
    {
        " is intended to avoid a similar situation to that of the ": null
    },
    {
        "Weimar Republic": "Weimar Republic"
    },
    {
        " in which the executive did not have enough support in the legislature to govern effectively, but the legislature was too divided to name a successor. The current system also prevents the Chancellor from calling a ": null
    },
    {
        "snap election": "Snap Election"
    },
    {
        ".     Except in the periods 1969–1972 and 1976–1982, when the Social Democratic party of Chancellor Brandt and Schmidt came in second in the elections, the chancellor has always been the candidate of the largest party, usually supported by a coalition of two parties with a majority in the parliament. The chancellor appoints one of the federal ministers as their deputy, Article 69 of the Basic Law who has the unofficial title ": null
    },
    {
        "Vice Chancellor": "Vice Chancellor Of Germany"
    },
    {
        " . The office is currently held by ": null
    },
    {
        "Olaf Scholz": "Olaf Scholz"
    },
    {
        " .            The German Cabinet is the chief ": null
    },
    {
        "executive": "Executive Branch"
    },
    {
        " body of the Federal Republic of Germany. It consists of the ": null
    },
    {
        "chancellor": "Chancellor Of Germany"
    },
    {
        " and the ": null
    },
    {
        "cabinet minister": "Cabinet Minister"
    },
    {
        "s. The fundamentals of the cabinets organization are set down in articles 62–69 of the ": null
    },
    {
        "Basic Law": "Basic Law For The Federal Republic Of Germany"
    },
    {
        ". The current cabinet is Merkel IV .              Agencies of the German government include:   ": null
    },
    {
        "Federal Intelligence Service": "Federal Intelligence Service"
    },
    {
        "   Federal Bureau of Aircraft Accident Investigation": "German Federal Bureau Of Aircraft Accident Investigation"
    },
    {
        "   Federal Aviation Office": "Luftfahrt-Bundesamt"
    },
    {
        "   Federal Bureau for Maritime Casualty Investigation": "Federal Bureau For Maritime Casualty Investigation"
    },
    {
        "   Federal Maritime and Hydrographic Agency": "Federal Maritime And Hydrographic Agency Of Germany"
    },
    {
        "   Federal Railway Accident Investigation Board": "Eisenbahn-Unfalluntersuchungsstelle Des Bundes"
    },
    {
        "   Federal Railway Authority": "Federal Railway Authority"
    },
    {
        "            Federal legislative power is divided between the Bundestag and the Bundesrat. The Bundestag is directly elected by the German people, while the Bundesrat represents the governments of the regional states . The federal legislature has powers of ": null
    },
    {
        "exclusive jurisdiction": "Exclusive Jurisdiction"
    },
    {
        " and ": null
    },
    {
        "concurrent jurisdiction": "Concurrent Jurisdiction"
    },
    {
        " with the states in areas specified in the constitution.     The Bundestag is more powerful than the Bundesrat and only needs the latters consent for proposed legislation related to revenue shared by the federal and state governments, and the imposition of responsibilities on the states. In practice, however, the agreement of the Bundesrat in the legislative process is often required, since federal legislation frequently has to be executed by state or local agencies. In the event of disagreement between the Bundestag and the Bundesrat, either side can appeal to the  to find a compromise.            The Bundestag is elected for a four-year term and consists of 598 or more members elected by a means of ": null
    },
    {
        "mixed-member proportional representation": "Mixed-Member Proportional Representation"
    },
    {
        ", which Germans call personalised proportional representation . 299 members represent single-seat ": null
    },
    {
        "constituencies": "Constituency"
    },
    {
        " and are elected by a ": null
    },
    {
        "first past the post electoral system": "First Past The Post Electoral System"
    },
    {
        ". Parties that obtain fewer constituency seats than their national share of the vote are allotted seats from party lists to make up the difference. In contrast, parties that obtain more constituency seats than their national share of the vote are allowed to keep these so-called ": null
    },
    {
        "overhang seat": "Overhang Seat"
    },
    {
        "s. In the parliament that was elected in 2009, there were 24 overhang seats, giving the Bundestag a total of 622 members. After Bundestag elections since 2013, other parties obtain extra seats that offset advantages from their rivals overhang seats. The current Bundestag is the largest in German history with 709 members.     A party must receive either five percent of the national vote or win at least three directly elected seats to be eligible for non-constituency seats in the Bundestag. This rule, often called the five percent hurdle , was incorporated into Germanys election law to prevent political fragmentation and strong minor parties. The first Bundestag elections were held in the Federal Republic of Germany on 14 August 1949. Following reunification, ": null
    },
    {
        "elections for the first all-German Bundestag": "1990 German Federal Election"
    },
    {
        " were held on 2 December 1990. The last ": null
    },
    {
        "federal election": "2017 German Federal Election"
    },
    {
        " was held on 24 September 2017.             Germany follows the ": null
    },
    {
        "civil law tradition": "Civil Law"
    },
    {
        ". The judicial system comprises three types of courts.     Ordinary courts, dealing with ": null
    },
    {
        "criminal": "Criminal Law"
    },
    {
        " and most ": null
    },
    {
        "civil": "Private Law"
    },
    {
        " cases, are the most numerous by far. The ": null
    },
    {
        "Federal Court of Justice of Germany": "Federal Court Of Justice Of Germany"
    },
    {
        "  is the highest ordinary court and also the highest court of appeals.   Specialized courts hear cases related to ": null
    },
    {
        "administrative": "Administrative Law"
    },
    {
        ", ": null
    },
    {
        "labour": "Labour Law"
    },
    {
        ", social, fiscal and ": null
    },
    {
        "patent law": "Patent Law"
    },
    {
        ".   Constitutional courts focus on judicial review and constitutional interpretation. The ": null
    },
    {
        "Federal Constitutional Court": "Federal Constitutional Court"
    },
    {
        "  is the highest court dealing with constitutional matters.       The main difference between the Federal Constitutional Court and the Federal Court of Justice is that the Federal Constitutional Court may only be called if a constitutional matter within a case is in question , while the Federal Court of Justice may be called in any case.             Germany maintains a network of 229 diplomatic missions abroad and holds relations with more than 190 countries.  German Federal Foreign Office. Retrieved 31 December 2010. It is the largest contributor to the budget of the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " and third largest contributor to the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " . Germany is a member of the ": null
    },
    {
        "NATO": "Nato"
    },
    {
        " defence alliance, the ": null
    },
    {
        "Organisation of Economic Co-operation and Development ": "Oecd"
    },
    {
        ", the ": null
    },
    {
        "G8": "G8"
    },
    {
        ", the ": null
    },
    {
        "G20": "G20"
    },
    {
        ", the ": null
    },
    {
        "World Bank": "World Bank"
    },
    {
        " and the ": null
    },
    {
        "International Monetary Fund ": "International Monetary Fund"
    },
    {
        ".     Germany has played a leading role in the European Union since its inception and has maintained a ": null
    },
    {
        "strong alliance with France": "Franco-German Cooperation"
    },
    {
        " since the end of World War II. The alliance was especially close in the late 1980s and early 1990s under the leadership of ": null
    },
    {
        "Christian Democrat": "Christian Democratic Union"
    },
    {
        " Helmut Kohl": "Helmut Kohl"
    },
    {
        " and ": null
    },
    {
        "Socialist": "Socialist Party"
    },
    {
        " François Mitterrand": "François Mitterrand"
    },
    {
        ". Germany is at the forefront of European states seeking to advance the creation of a more unified European political, defence, and security apparatus.   Elysee.fr 13 May 3004. Retrieved 3 December 2006. For a number of decades after WWII, the Federal Republic of Germany kept a notably low profile in international relations, because of both its recent history and its occupation by foreign powers. Glaab, Manuela.   Internationale Politik. Spring 2003. Retrieved 3 January 2007.          During the Cold War, Germanys partition by the ": null
    },
    {
        "Iron Curtain": "Iron Curtain"
    },
    {
        " made it a symbol of East–West tensions and a political battleground in Europe. However, Willy Brandts Ostpolitik was a key factor in the  détente  of the 1970s. Harrison, Hope.    German historical institute, Washington, DC, Bulletin supplement 1, 2004, American détente and German ostpolitik, 1969–1972 . In 1999, Chancellor ": null
    },
    {
        "Gerhard Schröders": "Gerhard Schröder"
    },
    {
        "government defined a new basis for German foreign policy by taking a full part in the decisions surrounding the ": null
    },
    {
        "NATO war against Yugoslavia": "Kosovo War"
    },
    {
        " and by sending German troops into combat for the first time since World War II.  ": null
    },
    {
        "Deutsche Welle": "Deutsche Welle"
    },
    {
        ". 14 October 2005. Retrieved 3 December 2006.          The governments of Germany and the United States are close political allies.  U.S. Department of State. 6 July 2006. Retrieved 3 December 2006. The 1948 ": null
    },
    {
        "Marshall Plan": "Marshall Plan"
    },
    {
        " and strong cultural ties have crafted a strong bond between the two countries, although Schröders very vocal opposition to the ": null
    },
    {
        "Iraq War": "Iraq War"
    },
    {
        " had suggested the end of ": null
    },
    {
        "Atlanticism": "Atlanticism"
    },
    {
        " and a relative cooling of German–American relations. , ": null
    },
    {
        "The Economist": "The Economist"
    },
    {
        ", 6 July 2006. Retrieved 31 December 2006. The two countries are also economically interdependent: 5.0% of German exports in goods are US-bound and 3.5% of German imported goods originate from the US with a ": null
    },
    {
        "trade deficit": "Balance Of Trade"
    },
    {
        " of -63,678.5 million dollars for the United States .  Other signs of the close ties include the continuing position of German–Americans as the largest reported ethnic group in the US,   ": null
    },
    {
        "U.S. Census Bureau": "U.S. Census Bureau"
    },
    {
        " 30 June 2004. Retrieved 3 December 2006. and the status of ": null
    },
    {
        "Ramstein Air Base": "Ramstein Air Base"
    },
    {
        "  as the largest US military community outside the US.   U.S. Military. Retrieved 3 December 2006.     The policy on foreign aid is an important area of German foreign policy. It is formulated by the Federal Ministry for Economic Cooperation and Development and carried out by the implementing organisations. The German government sees development policy as a joint responsibility of the international community.  Federal Ministry for Economic Cooperation and Development 10 April 2008. Retrieved 7 December 2008. It is the worlds fourth biggest aid donor after the United States, the United Kingdom and France.   OECD Germany spent 0.37 per cent of its gross domestic product on development, which is below the governments target of increasing aid to 0.51 per cent of GDP by 2010.            Germany comprises ": null
    },
    {
        "sixteen states": "States Of Germany"
    },
    {
        " that are collectively referred to as Länder. The individual denomination is either Land Freistaat or Freie Hansestadt   Due to differences in size and population, the ": null
    },
    {
        "subdivision of these states": "States Of Germanyfurther Subdivisions"
    },
    {
        " varies especially between ": null
    },
    {
        "city-states": "City-State"
    },
    {
        "  and states with larger territories . For regional administrative purposes five states, namely Baden-Württemberg, Bavaria, Hesse, North Rhine-Westphalia and Saxony, consist of a total of 22 ": null
    },
    {
        "Government Districts": "Regierungsbezirke"
    },
    {
        " . As of 2009 Germany is divided into 403 ": null
    },
    {
        "districts": "Districts Of Germany"
    },
    {
        "  on municipal level, these consist of 301 ": null
    },
    {
        "rural districts": "List Of Rural Districts Of Germany"
    },
    {
        " and 102 ": null
    },
    {
        "urban districts": "Urban Districts Of Germany"
    },
    {
        ".           ": null
    }
]