[
    {
        "Politics of Saint Vincent and the Grenadines takes place in the framework of a ": null
    },
    {
        "parliamentary democracy": "parliamentary democracy"
    },
    {
        ". ": null
    },
    {
        "Saint Vincent and the Grenadines": "saint vincent and the grenadines"
    },
    {
        " is an independent ": null
    },
    {
        "Commonwealth realm": "commonwealth realm"
    },
    {
        ", with ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        " as ": null
    },
    {
        "its queen": "queen of saint vincent and the grenadines"
    },
    {
        ", represented by a ": null
    },
    {
        "governor-general": "list of governors-general of saint vincent and the grenadines"
    },
    {
        ", who acts on the advice of the ": null
    },
    {
        "prime minister": "prime minister"
    },
    {
        " and the cabinet. The prime minister is the leader of the majority party of the ": null
    },
    {
        "House of Assembly": "house of assembly of saint vincent and the grenadines"
    },
    {
        ", and the cabinet conducts affairs of state. The governor-general exercises ceremonial functions, but ": null
    },
    {
        "reserve powers": "reserve powers"
    },
    {
        ", under the ": null
    },
    {
        "Saint Vincent and the Grenadines": "saint vincent and the grenadines"
    },
    {
        " constitution, can be used at the governor-generals discretion.     The House of Assembly is a ": null
    },
    {
        "unicameral": "unicameral"
    },
    {
        " parliament with fifteen elected members and six appointed senators. The governor general appoints senators, four on the advice of the prime minister and two on the advice of the leader of the opposition. The parliamentary term of office is five years, although the prime minister may call elections at any time.     As in other English-speaking Caribbean countries, the judiciary in St. Vincent is rooted in ": null
    },
    {
        "English common law": "english common law"
    },
    {
        ". There are eleven courts in three magisterial districts. The Eastern Caribbean Supreme Court, comprising a high court and a court of appeals, is known in St. Vincent as the St. Vincent and the Grenadines supreme court. The court of last resort is the ": null
    },
    {
        "Judicial Committee of the Privy Council": "judicial committee of the privy council"
    },
    {
        " in ": null
    },
    {
        "London": "london"
    },
    {
        ". Moves are currently being made to establish a Caribbean Court of Justice and replace the Privy Council as the countrys highest court of appeal.     There is no local government in St. Vincent, and all six parishes are administered by the central government.       The ": null
    },
    {
        "Peoples Political Party": "peoples political party"
    },
    {
        " , founded in 1952 by ": null
    },
    {
        "Ebenezer Joshua": "ebenezer joshua"
    },
    {
        ", was the first major political party in St. Vincent. The PPP had its roots in the labor movement and was in the forefront of national policy prior to independence, winning elections from 1957 through 1966. With the development of a more conservative ": null
    },
    {
        "Black middle class": "black middle class"
    },
    {
        ", however, the party began to steadily lose support, until it collapsed after a rout in the 1979 elections. The party dissolved itself in 1984.     Founded in 1955, the ": null
    },
    {
        "Saint Vincent Labour Party": "saint vincent labour party"
    },
    {
        " , under ": null
    },
    {
        "Milton Cato": "milton cato"
    },
    {
        ", gained the support of the middle class. With a conservative law-and-order message and a pro-Western foreign policy, the SVLP dominated politics from the mid-1960s until the mid-1980s. Following victories in the 1967 and 1974 elections, the SVLP led the island to independence, winning the first post-independence election in 1979. Expecting an easy victory for the SVLP in 1984, Cato called early elections. The results were surprising: with a record 89% voter turnout, ": null
    },
    {
        "James Fitz-Allen Mitchells": "james fitz-allen mitchell"
    },
    {
        " New Democratic Party": "new democratic party"
    },
    {
        " won nine seats in the house of assembly.     Since the 1984 election, politics in St. Vincent have been dominated by the NDP. Bolstered by a resurgent economy in the mid-1980s, Mitchell led his party to an unprecedented sweep of all fifteen House of Assembly seats in the 1989 elections. The opposition emerged from the election weakened and fragmented but was able to win three seats during the February 1994 elections under a unity coalition. In 1998, Prime Minister Mitchell and the NDP were returned to power for an unprecedented fourth term but only with a slim margin of eight seats to seven seats for the ": null
    },
    {
        "Unity Labour Party": "unity labour party"
    },
    {
        " . The NDP was able to accomplish a return to power while receiving a lesser share of the popular vote, approximately 45% to the ULPs 55%. In March 2001, the ULP, led by ": null
    },
    {
        "Ralph Gonsalves": "ralph gonsalves"
    },
    {
        ", assumed power after winning twelve of the fifteen seats in Parliament. The party was returned to power under the same leadership in December 2005, holding the same twelve seats in Parliament. The ULP was returned to power in 2010 and also following the election on 9 December 2015 when it won 8 out of the 15 constituencies. ": null
    },
    {
        "Ralph Gonsalves": "ralph gonsalves"
    },
    {
        " remains Prime Minister.       As head of state, ": null
    },
    {
        "Queen Elizabeth II": "elizabeth ii of the united kingdom"
    },
    {
        " is represented by a governor general who acts on the advice of the prime minister and the cabinet.    ": null
    },
    {
        "Queen": "monarchy of saint vincent and the grenadines"
    },
    {
        " Elizabeth II": "elizabeth ii"
    },
    {
        " Governor-General": "list of governors-general of saint vincent and the grenadines"
    },
    {
        " Susan Duncan": "susan duncan"
    },
    {
        " Prime Minister": "list of prime ministers of saint vincent and the grenadines"
    },
    {
        " Ralph Gonsalves": "ralph gonsalves"
    },
    {
        " ULP": "unity labour party"
    },
    {
        " based in Saint Lucianonsignatory user": null
    },
    {
        "ganizati": "ganizati"
    }
]