[
    {
        "The politics of Grenada  takes place in a framework of a ": null
    },
    {
        "parliamentary": "parliamentary system"
    },
    {
        " representative democracy": "representative democracy"
    },
    {
        ", whereby the ": null
    },
    {
        "Prime Minister": "list of prime ministers of grenada"
    },
    {
        " is the ": null
    },
    {
        "head of government": "head of government"
    },
    {
        ". Grenada is an independent ": null
    },
    {
        "Commonwealth realm": "commonwealth realm"
    },
    {
        ". It is governed under a ": null
    },
    {
        "multi-party": "multi-party system"
    },
    {
        " parliamentary system whose political and legal traditions closely follow those of the United Kingdom; it has a prime minister and a cabinet, and a bicameral ": null
    },
    {
        "Parliament": "parliament of grenada"
    },
    {
        " with an elected ": null
    },
    {
        "House of Representatives": "house of representatives of grenada"
    },
    {
        " and an appointed ": null
    },
    {
        "Senate": "senate of grenada"
    },
    {
        ". ": null
    },
    {
        "Executive power": "executive power"
    },
    {
        " is exercised by the government. ": null
    },
    {
        "Legislative power": "legislative power"
    },
    {
        " is vested in both the government and parliament. Constitutional safeguards include freedom of speech, press, worship, motion, and association. Grenada is a member of the eastern Caribbean court system. The ": null
    },
    {
        "Judiciary": "judiciary"
    },
    {
        " is independent of the executive and the legislature. Jurisprudence is based on English common law.     Citizens enjoy a wide range of ": null
    },
    {
        "civil and political rights": "civil and political rights"
    },
    {
        " guaranteed by the constitution. Grenadas constitution provides citizens with the right to change their government peacefully. Citizens exercise this right through periodic, free, and fair elections held on the basis of universal suffrage.     Grenada has two significant political parties, both moderate: the ": null
    },
    {
        "National Democratic Congress": "national democratic congress"
    },
    {
        " and the ": null
    },
    {
        "New National Party": "new national party of grenada"
    },
    {
        " . Minor parties include the left-of-center ": null
    },
    {
        "Maurice Bishop Patriotic Movement": "maurice bishop patriotic movement"
    },
    {
        "  and the populist GULP of former Prime Minister Gairy.     At the ": null
    },
    {
        "July 2008": "grenadian general election, 2008"
    },
    {
        ", election the NDC won a comfortable 7 seat majority over the government of former Prime Minister ": null
    },
    {
        "Keith Mitchell": "keith mitchell"
    },
    {
        ". New Prime Minister ": null
    },
    {
        "Tillman Thomas": "tillman thomas"
    },
    {
        " formed a government after narrowly losing by one seat to Mitchells NNP in the ": null
    },
    {
        "November 2003": "grenada parliamentary election, 2003"
    },
    {
        " election. In elections held on February 19, 2013, Keith Mitchells NNP swept all fifteen parliamentary seats.  This historic victory was a repeat of the 1999 elections in which the NNP also swept all 15 seats. Prime Minister Mitchell has the distinction as being the only Caribbean politician to sweep all seats on two separate occasions. Constitutionally, this development means that there is no official opposition in Parliament. As such, Governor General Carlye Glean, who is the titular head of state, will appoint 5 Senators to the Upper House, who will serve as the de facto opposition.     Security in Grenada is maintained by the 650 members of the Royal Grenada Police Force , which included an 80-member paramilitary special services unit and a 30-member coast guard. The U.S. Army and the U.S. Coast Guard provide periodic training and material support for the SSU and the coast guard.       As head of state, ": null
    },
    {
        "Queen Elizabeth II": "elizabeth ii"
    },
    {
        " is represented in Grenada by a governor general who acts on the advice of the prime minister and the cabinet. The leader of the majority party serves as Prime Minister and head of government. The cabinet consists of members, including the ": null
    },
    {
        "Prime Minister": "prime minister"
    },
    {
        " and ministers of executive departments. They answer politically to the House of Assembly. ": null
    }
]