[
    {
        "The politics of Greece takes place in a ": null
    },
    {
        "parliamentary": "parliamentary system"
    },
    {
        " representative democratic": "representative democracy"
    },
    {
        " republic, whereby the ": null
    },
    {
        "Prime Minister of Greece": "prime minister of greece"
    },
    {
        " is the ": null
    },
    {
        "head of government": "head of government"
    },
    {
        ", and of a ": null
    },
    {
        "multi-party system": "multi-party system"
    },
    {
        ". ": null
    },
    {
        "Legislative power": "legislative power"
    },
    {
        " is vested in both the ": null
    },
    {
        "government": "government of greece"
    },
    {
        " and the ": null
    },
    {
        "Hellenic Parliament": "hellenic parliament"
    },
    {
        ". Between the ": null
    },
    {
        "restoration of democracy": "metapolitefsi"
    },
    {
        " in 1974 and the ": null
    },
    {
        "Greek government-debt crisis": "greek government-debt crisis"
    },
    {
        " the party system was dominated by the liberal-conservative ": null
    },
    {
        "New Democracy": "new democracy"
    },
    {
        " and the social-democratic ": null
    },
    {
        "Panhellenic Socialist Movement": "panhellenic socialist movement"
    },
    {
        "     The ": null
    },
    {
        "Judiciary": "judiciary"
    },
    {
        " is independent of the executive and the legislature.     The ": null
    },
    {
        "Constitution of Greece": "constitution of greece"
    },
    {
        ", which describes ": null
    },
    {
        "Greece": "greece"
    },
    {
        " as a presidential parliamentary republic , includes extensive specific guarantees of ": null
    },
    {
        "civil liberties": "civil liberties"
    },
    {
        " and vests the powers of the ": null
    },
    {
        "head of state": "head of state"
    },
    {
        " in a president elected by parliament. The Greek governmental structure is similar to that found in many other Western ": null
    },
    {
        "democracies": "democracy"
    },
    {
        ", and has been described as a compromise between the French and German models. The prime minister and cabinet play the central role in the political process, while the president perform some executive and legislative functions in addition to ceremonial duties. Voting in Greece is compulsory but is not enforced.       The ": null
    },
    {
        "Cabinet of Greece": "cabinet of greece"
    },
    {
        ", which is the main organ of the ": null
    },
    {
        "government": "government of greece"
    },
    {
        ", includes the heads of all executive ministries, appointed by the president on the recommendation of the prime minister.            The President of the Republic is elected by the Parliament for a five-year term , and a maximum of two terms in office. When a presidential term expires, Parliament votes to elect the new President. In the first two votes, a  majority is necessary. The third and final vote requires a  majority.     If the third vote is fruitless, Parliament is dissolved and elections are proclaimed by the outgoing President within the next 30 days. In the new Parliament, the election for President is repeated immediately with a 3/5 majority required for the initial vote, an absolute majority for the second one and a simple majority for the third and final one. The system is so designed as to promote consensus presidential candidates among the main political parties.     The president has the power to ": null
    },
    {
        "declare war": "declare war"
    },
    {
        ", to grant ": null
    },
    {
        "pardon": "pardon"
    },
    {
        " and to conclude agreements of peace, alliance, and participation in international organizations; upon the request of the government a simple parliamentary majority is required to confirm such actions, agreements, or treaties. An absolute or a three-fifths majority is required in exceptional cases .     The president can also exercise certain emergency powers, which must be countersigned by the appropriate cabinet minister. The president may not dissolve parliament, dismiss the government, suspend certain articles of the constitution, issue a proclamation or declare a state of siege without countersigning by the prime minister or the appropriate cabinet minister. To call a referendum, he must obtain approval from parliament.            The prime minister is elected by the Parliament and he or she is usually the leader of the party controlling the absolute majority of MPs. According to the Constitution, the prime minister safeguards the unity of the government and directs its activities. He or she is the most powerful person of the Greek political system and recommends ministers to the President for appointment or dismissal.       Greek parliamentary politics hinge upon the principle of the  , the declared confidence of Parliament to the Prime Minister and his/her administration. This means that the President of the Republic is bound to appoint, as Prime Minister, a person who will be approved by a majority of the Parliaments members . With the current electoral system, it is the leader of the party gaining a plurality of the votes in the Parliamentary elections who gets appointed Prime Minister.     An administration may at any time seek a vote of confidence . Conversely a number of Members of Parliament may ask that a vote of reproach be taken. Both are rare occurrences with usually predictable outcomes as voting outside the party line happens very seldom.     On 4 October 2009, ": null
    },
    {
        "George Papandreou": "george papandreou"
    },
    {
        ", president of the ": null
    },
    {
        "Panhellenic Socialist Movement": "panhellenic socialist movement"
    },
    {
        " party and son and grandson of Prime Ministers, ": null
    },
    {
        "was elected": "2009 greek legislative election"
    },
    {
        " as the new ": null
    },
    {
        "Prime Minister of Greece": "prime minister of greece"
    },
    {
        ", following five years of government under ": null
    },
    {
        "New Democracy": "new democracy"
    },
    {
        " leader ": null
    },
    {
        "Kostas Karamanlis": "kostas karamanlis"
    },
    {
        ", the nephew of long-time Prime Minister and President ": null
    },
    {
        "Konstantinos Karamanlis": "konstantinos karamanlis"
    },
    {
        ".                 Greece elects a legislature by universal suffrage of all citizens over the age of 18. The ": null
    },
    {
        "Greek Parliament": "parliament of greece"
    },
    {
        " has 300 members, elected for a four-year term by a system of reinforced ": null
    },
    {
        "proportional representation": "proportional representation"
    },
    {
        " in 48 multi-seat ": null
    },
    {
        "constituencies": "constituency"
    },
    {
        ", 8 single-seat constituencies and a single nationwide list. 288 of the 300 seats are determined by constituency voting, and voters may select the candidate or candidates of their choice by marking their name on the party ballot. The remaining 12 seats are filled from nationwide party lists on a top-down basis and based on the proportion of the total vote each party received.     Greece uses a complex reinforced proportional representation electoral system which discourages splinter parties and makes a parliamentary majority possible even if the leading party falls short of a majority of the popular vote. Under the current electoral law, any single party must receive at least a 3% nationwide vote tally in order to elect Members of Parliament . The largest party gets a 50-seat bonus ostensibly to ensure elections return viable governing majorities.     The law in its current form favors the ": null
    },
    {
        "first past the post": "first past the post"
    },
    {
        " party to achieve an absolute majority, provided it receives a 41%+ nationwide vote. This is touted to enhance governmental stability. These electoral laws can be changed by simple parliamentary majority, but a law so changed wont come into effect for two election cycles unless passed by a  majority in the Hellenic Parliament.               In Greece the judicial branch is divided into civil, and administrative courts. Civil courts judge civil and penal cases, whereas administrative courts judge administrative cases, namely disputes between the citizens and the State.     The judicial system of Greece comprises three Supreme Courts: the ": null
    },
    {
        "Court of Cassation ": "court of cassation"
    },
    {
        " , the ": null
    },
    {
        "Council of State": "council of state"
    },
    {
        " and the ": null
    },
    {
        "Chamber of Accounts": "chamber of accounts"
    },
    {
        " . These high courts are composed of professional judges, graduates of the National School of Judges. The way the judges are gradually promoted, until they become members of the Supreme Courts, is defined by the Constitution and the existing laws. The presidents and the vice-presidents of the three Supreme Courts are chosen by the ": null
    },
    {
        "Cabinet of Greece": "cabinet of greece"
    },
    {
        " among the serving members of each of the Supreme Courts.     The ": null
    },
    {
        "Court of Cassation": "court of cassation"
    },
    {
        " is the supreme civil and penal court, whereas the ": null
    },
    {
        "Council of State": "council of state"
    },
    {
        " is the supreme administrative court. The ": null
    },
    {
        "Chamber of Accounts": "chamber of accounts"
    },
    {
        " has an ": null
    },
    {
        "exclusive jurisdiction": "exclusive jurisdiction"
    },
    {
        " over certain administrative areas and its decisions are irrevocable. This means that they are not judged at second instance by the Council of State.     Sometimes, the Supreme Courts take contradictory decisions or they judge differently the constitutionality of a legal provision. These disputes are resolved by the ": null
    },
    {
        "Supreme Special Court": "supreme special court"
    },
    {
        ", whose composition and jurisdiction is regulated by the Constitution . As its name reveals, this court is not permanent and it sits when a special case belonging to its jurisdiction arises. When the ": null
    },
    {
        "Supreme Special Court": "supreme special court"
    },
    {
        " sits, it comprises eleven members: the Presidents of the three Supreme Courts, four members of the Court of Cassation and four members of the Council of State.     When it judges the constitutionality of a law or resolves the disputes between Supreme Courts, its composition comprises two more members: two professors of the Law Schools of Greece. The Supreme Special Court is the only court which can declare an unconstitutional legal provision as powerless , while the three Supreme Courts can only declare an unconstitutional legal provision as inapplicable to that particular case. The Supreme Special Court is also the Supreme Electoral Court, judging pleas against the legality of the legislative elections.                  Greece is divided in ": null
    },
    {
        "13 regions": "modern regions of greece"
    },
    {
        ", further divided into ": null
    },
    {
        "74 regional units": "regional units of greece"
    },
    {
        ". The prefectures are each headed by a prefect , who is elected by direct popular vote. The thirteen regional administrative districts , each including a number of prefectures are headed by a regional governor , appointed by the Minister of the Interior. In northern Greece and in greater ": null
    },
    {
        "Athens": "athens"
    },
    {
        ", three areas have an additional administrative position between the nomarch and peripheriarch.     This official, known as the Chair of the prefectural local authorities or superprefect , is elected by direct popular vote together with the nomarchs she or he supervises. Although municipalities and villages have elected officials, they do not have an adequate independent revenue base and must depend on the central government budget for a large part of their financial needs. Consequently, they are subject to numerous central government controls. This also leads to extremely low municipal taxes .     Greece also includes one autonomous region, the ": null
    },
    {
        "Monastic": "monastery"
    },
    {
        " Community of the Holy Mountain, ": null
    },
    {
        "Mount Athos": "mount athos"
    },
    {
        ".            As one of the oldest Euro-Atlantic member states in the region of ": null
    },
    {
        "Southeast Europe": "southeast europe"
    },
    {
        ", Greece enjoys a prominent geopolitical role, due to its political and geographical proximity to ": null
    },
    {
        "Europe": "europe"
    },
    {
        ", ": null
    },
    {
        "Asia": "asia"
    },
    {
        ", the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ", and ": null
    },
    {
        "Africa": "africa"
    },
    {
        ". Its main allies are ": null
    },
    {
        "France": "france"
    },
    {
        ", ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", ": null
    },
    {
        "Bulgaria": "bulgaria"
    },
    {
        ", United States, the other ": null
    },
    {
        "NATO": "nato"
    },
    {
        " countries like ": null
    },
    {
        "Albania": "albania"
    },
    {
        ", and the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ".     Greece also maintains strong diplomatic relations with ": null
    },
    {
        "Cyprus": "cyprus"
    },
    {
        ", ": null
    },
    {
        "Albania": "albania"
    },
    {
        ", ": null
    },
    {
        "Russia": "russia"
    },
    {
        ", ": null
    },
    {
        "Serbia": "serbia"
    },
    {
        ", ": null
    },
    {
        "Armenia": "armenia"
    },
    {
        " and ": null
    },
    {
        "Israel": "israel"
    },
    {
        ", while at the same time focuses at improving further the good relations with ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        " and the ": null
    },
    {
        "Arab World": "arab world"
    },
    {
        ", ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        ", and ": null
    },
    {
        "China": "china"
    },
    {
        ". As member of both the EU and the ": null
    },
    {
        "Union for the Mediterranean": "union for the mediterranean"
    },
    {
        ", Greece is a key player in the eastern Mediterranean region and has encouraged the collaboration between neighbors, as well as promoting the ": null
    },
    {
        "Energy Triangle": "energy triangle"
    },
    {
        ", for gas exports to Europe. Greece also has the largest economy in the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        ", where it is an important regional investor.     Prominent issues in Hellenic foreign policy include the ": null
    },
    {
        "claims in the Aegean Sea": "aegean dispute"
    },
    {
        " and Eastern Mediterranean by ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ", the Turkish ": null
    },
    {
        "occupation of Cyprus": "turkish invasion of cyprus"
    },
    {
        ", and the ": null
    },
    {
        "dispute over the name": "macedonia naming dispute"
    },
    {
        " of ": null
    },
    {
        "North Macedonia": "north macedonia"
    },
    {
        "                 Alexandros Mavrokordatos": "alexandros mavrokordatos"
    },
    {
        " Ioannis Kapodistrias": "ioannis kapodistrias"
    },
    {
        " Spyridon Trikoupis": "spyridon trikoupis"
    },
    {
        " Andreas Metaxas": "andreas metaxas"
    },
    {
        " Dimitrios Kallergis": "dimitrios kallergis"
    },
    {
        " Alexandros Koumoundouros": "alexandros koumoundouros"
    },
    {
        " Ioannis Kolettis": "ioannis kolettis"
    },
    {
        " Epameinondas Deligiorgis": "epameinondas deligiorgis"
    },
    {
        " Charilaos Trikoupis": "charilaos trikoupis"
    },
    {
        " Theodoros Deligiannis": "theodoros deligiannis"
    },
    {
        " Alexandros Rizos Rangavis": "alexandros rizos rangavis"
    },
    {
        " Alexandros Zaimis": "alexandros zaimis"
    },
    {
        " Georgios Christakis-Zografos": "georgios christakis-zografos"
    },
    {
        " Georgios Theotokis": "georgios theotokis"
    },
    {
        " Ioannis Sfakianakis": "ioannis sfakianakis"
    },
    {
        " Stephanos Dragoumis": "stephanos dragoumis"
    },
    {
        " Ion Dragoumis": "ion dragoumis"
    },
    {
        " Eleftherios Venizelos": "eleftherios venizelos"
    },
    {
        " Dimitrios Gounaris": "dimitrios gounaris"
    },
    {
        "    Ioannis Metaxas": "ioannis metaxas"
    },
    {
        " Alexandros Papanastasiou": "alexandros papanastasiou"
    },
    {
        " Themistoklis Sofoulis": "themistoklis sofoulis"
    },
    {
        " Nikos Zachariadis": "nikos zachariadis"
    },
    {
        " Sofoklis Venizelos": "sofoklis venizelos"
    },
    {
        " Georgios Papandreou": "georgios papandreou"
    },
    {
        " Nikolaos Plastiras": "nikolaos plastiras"
    },
    {
        " Grigoris Lambrakis": "grigoris lambrakis"
    },
    {
        " Ilias Iliou": "ilias iliou"
    },
    {
        " Alexandros Panagoulis": "alexandros panagoulis"
    },
    {
        " Alexandros Papagos": "alexandros papagos"
    },
    {
        " Panagiotis Kanellopoulos": "panagiotis kanellopoulos"
    },
    {
        " Spyros Markezinis": "spyros markezinis"
    },
    {
        " Konstantinos Karamanlis": "konstantinos karamanlis"
    },
    {
        " Evangelos Averoff": "evangelos averoff"
    },
    {
        " Leonidas Kyrkos": "leonidas kyrkos"
    },
    {
        " Andreas Papandreou": "andreas papandreou"
    },
    {
        " Georgios Rallis": "georgios rallis"
    },
    {
        " Konstantinos Mitsotakis": "konstantinos mitsotakis"
    },
    {
        "                     Dimitris Avramopoulos": "dimitris avramopoulos"
    },
    {
        " Dora Bakoyannis": "dora bakoyannis"
    },
    {
        " Michalis Chrisochoidis": "michalis chrisochoidis"
    },
    {
        " Maria Damanaki": "maria damanaki"
    },
    {
        " Nikos Dendias": "nikos dendias"
    },
    {
        " Anna Diamantopoulou": "anna diamantopoulou"
    },
    {
        " Stavros Dimas": "stavros dimas"
    },
    {
        " Adonis Georgiades": "adonis georgiades"
    },
    {
        " Pavlos Geroulanos": "pavlos geroulanos"
    },
    {
        " Kostis Hatzidakis": "kostis hatzidakis"
    },
    {
        " Kostas Karamanlis": "kostas karamanlis"
    },
    {
        " Liana Kanelli": "liana kanelli"
    },
    {
        " Nikos Konstantopoulos": "nikos konstantopoulos"
    },
    {
        " Dimitris Koutsoumpas": "dimitris koutsoumpas"
    },
    {
        " Fotis Kouvelis": "fotis kouvelis"
    },
    {
        "    Stefanos Manos": "stefanos manos"
    },
    {
        " Dimitrios Papadimoulis": "dimitrios papadimoulis"
    },
    {
        " Lucas Papademos": "lucas papademos"
    },
    {
        " George Papandreou": "george papandreou"
    },
    {
        " Karolos Papoulias": "karolos papoulias"
    },
    {
        " Prokopis Pavlopoulos": "prokopis pavlopoulos"
    },
    {
        " Giannis Ragousis": "giannis ragousis"
    },
    {
        " Antonis Samaras": "antonis samaras"
    },
    {
        " Costas Simitis": "costas simitis"
    },
    {
        " Alexis Tsipras": "alexis tsipras"
    },
    {
        " Yanis Varoufakis": "yanis varoufakis"
    },
    {
        " Kyriakos Velopoulos": "kyriakos velopoulos"
    },
    {
        " Evangelos Venizelos": "evangelos venizelos"
    },
    {
        "                           Under the Greek constitution, . education is the responsibility of the state. Most Greeks attend public primary and secondary schools. There are a few private schools, which must meet the standard curriculum of and are supervised by the Ministry of Education. The Ministry of Education oversees and directs every aspect of the public education process at all levels, including hiring all teachers and professors and producing all required textbooks.       A recent issue concerning education in Greece is the institutionalisation of private universities. According to the constitution , Section 5: Education at university level shall be provided exclusively by institutions which are fully self-governed public law legal persons . only state-run universities operate on the land. However, in the recent years many foreign private universities have established branches in Greece, offering ": null
    },
    {
        "Bachelors": "bachelors"
    },
    {
        " level degrees, thus creating a legal contradiction between the Greek constitution and the EU laws allowing foreign companies to operate anywhere in the Union. Additionally, every year, tens of thousands of Greek students are not accepted to the state-run University system and become educational immigrants to other countries Higher Education institutions, where they move to study.     This has created a chronic problem for Greece, in terms of loss of capital as well as human resources, since many of those students opt to seek employment in the countries they studied, after completing their studies. It is characteristic that in 2006, Greece, with 11.5  million inhabitants, was fourth in the world in terms of student export in absolute numbers, with 60,000 students abroad, while the first country in this regard, Peoples Republic of China of over 1,3  billion inhabitants, had 100,000 students abroad. In terms of students abroad as a percent of the general population, Greece is by far the leading country, with 5,250 students per million, compared to second Malaysias 1,780 students per million inhabitants.     Citing these problems as a result of the states monopoly on Higher Education, ": null
    },
    {
        "New Democracy": "new democracy"
    },
    {
        " committed to amending the constitution, in order to allow private universities to operate in Greece on a non-profit basis. This proposal was rejected by then-ruling ": null
    },
    {
        "Panhellenic Socialist Movement": "panhellenic socialist movement"
    },
    {
        " in the late nineties, and thus could not muster the support necessary to be put to vote on the constitutional amendment of 2001. However, PASOK has since changed its stance, and now also supports a constitutional provision for the creation of private Universities on a non-profit basis. This proposal continues to encounter the fierce opposition of the Left parties and part of the academic community, both professors and students.     At the outset of 2006, prime minister ": null
    },
    {
        "Kostas Karamanlis": "kostas karamanlis"
    },
    {
        " announced the initiative of his government for a new amendment of the ": null
    },
    {
        "Constitution": "constitution of greece"
    },
    {
        ". According to his assertion one of the main issues of this amendment is going to be the creation of non-state owned universities.            Greece has problems with illegal immigration, especially from or via Turkey. Greek authorities believe that 90% of illegal immigrants in the EU enter through Greece, many fleeing because of unrest and poverty in the Middle East and Africa.       Several European courts have held that Greece is not complying with minimum standards of treatment for asylum seekers, so that illegal migrants who reach other countries cannot be sent back to Greece.      Numerous solutions have been proposed by the Greek government such as building a fence on the Turkish border and setting up detention camps.            One of the main problems of the system is the long-time process needed, even for a simple case, something that negatively impacts investment, entrepreneurship, social relations, corporate governance, and public governance.   Also corruption cases have appeared during the last years, such as the  Paradikastiko  organization scandal.      Manipulation of the judicial system and its decisions by each government, is another common phenomenon which violates the independency of the system.       There are three prison types in Greece: general, special, and therapeutic prisons. General prisons include three different types of inmates: type A inmates, type B inmates, and type C inmates. Special prisons include rural units, juvenile institutions, and semi-liberty centers. One example of a special prison would be an Agricultural Prison. The last prison type is a therapeutic prison; which includes hospitals and rehab centers for inmates.  Within these centers the percentage of female prisoners is 5.5%, which amounts to around 538 female prisoners. The percentage of juveniles in Greek prison is 2.9%. Greece’s occupancy rate in prisons is 99%, which means that Greece’s prisons are near full capacity. With some exceptions occupancy exceeds 100%, and in some establishments, it reaches, or surpasses, 300%.  Because of this the Greek Justice Ministry and the European Council want to improve Greek prison conditions. These improvements include training for guards, improving of medical facilities, and better treatment of prisoners. These selected improvements are three human rights that the Greek correctional system would like to tackle.          The Greek media, collectively, is a very influential institution – usually aggressive, sensationalist. As with many countries, most of the media are owned by businesses with commercial interests in other sectors of the economy. There are often accusations of newspapers, magazines, and radio and television channels being used to promote their commercial enterprises as well as to seek political influence.     In 1994, the ": null
    },
    {
        "Ministry of Press and Media": "minister for the press and the media"
    },
    {
        " was established to deal with media and communication issues. ": null
    },
    {
        "ERT S.A.": "ellinikí radiofonía tileórasi"
    },
    {
        ", a public corporation supervised by the Minister of Press, operates three national television channels and five national radio channels. The Minister of Press also serves as the primary government spokesperson.     The Secretary General of Press and Information prepares the semi-official Athens News Agency Bulletin. Along with ": null
    },
    {
        "AP": "associated press"
    },
    {
        " and ": null
    },
    {
        "Reuters": "reuters"
    },
    {
        ", this is a primary source of information for the Greek press. The Ministry of Press and Information also issues the semi-official Macedonian News Agency Bulletin, which is distributed throughout the Balkan region. For international news, ": null
    },
    {
        "CNN": "cnn"
    },
    {
        " is a particular influence in the Greek market; the major television channels often use it as a source. State and private television stations also use ": null
    },
    {
        "Eurovision": "european broadcasting union"
    },
    {
        " and ": null
    },
    {
        "Visnews": "visnews"
    },
    {
        " as sources. While few papers and stations have overseas correspondents, those few correspondents abroad can be very influential.     In 1988, a new law provided the legal framework for the establishment of private radio stations and, in 1989, private television stations. According to the law, supervision of radio and television is exercised by the National Radio and Television Council. In practice, however, official licensing has been delayed for many years. Because of this, there has been a proliferation of private radio and television stations, as well as European satellite channels, including ": null
    },
    {
        "Euronews": "euronews"
    },
    {
        ". More than 1,000 radio stations were operating before March 2002, when the government implemented plans to reallocate television frequencies and issue licenses as authorized by the 1993 Media Law, effectively reducing this number.       In 2011, the government proposed new measures that will restrict the freedom of speech in the internet. According to some proposals, every individual who would like to use free platforms, such like ": null
    },
    {
        "Blogspot": "blogspot"
    },
    {
        " or ": null
    },
    {
        "WordPress.com": "wordpress.com"
    },
    {
        " will be forced to get officially registered in the courts, as due to tough austerity measures web sites that criticize the government and the political system in general have been multiplied.      ": null
    },
    {
        "Press freedom": "press freedom"
    },
    {
        " sharply eroded in Greece during ": null
    },
    {
        "the economic and financial crisis of 2010–2015": "greek government-debt crisis"
    },
    {
        ", passing from the 35th place in 2009 in ": null
    },
    {
        "Reporters Without Borders": "reporters without borders"
    },
    {
        " Press Freedom Index": "press freedom index"
    },
    {
        " to the 99th place in 2014, well below all ": null
    },
    {
        "Western Balkans": "western balkans"
    },
    {
        " countries as well as states with repressive media policies such as ": null
    },
    {
        "Gabon": "gabon"
    },
    {
        ", ": null
    },
    {
        "Kuwait": "kuwait"
    },
    {
        " or ": null
    },
    {
        "Liberia": "liberia"
    },
    {
        ". Thomas Van Der Heijden, , Euroscope, 28 November 2014 Greece is today the ": null
    },
    {
        "EU member state": "eu member state"
    },
    {
        " where journalism and the media face their most acute crisis . Petros Iosifidis and Dimitris Boucas,  ,  Open Society Foundation report, 1 May 2015            Nine months for all males of 18 years of age; Compulsory with fines and imprisonment if denied, but neither fine nor imprisonment has been imposed since 1994, where the last warrant against a draft-dodger was issued. Members of families with three children serve a reduced time of six months. Military service can also be substituted with a longer public service, which by the standards of Amnesty International, ought to be considered punitive as it is twice as long as the regular tour of duty.     Limited steps have been taken to turn the Greek military into a semi-": null
    },
    {
        "professional army": "professional army"
    },
    {
        " in the last years, leading to the gradual reduction of the service from 18 to 12 to 9 months and the inclusion of a greater number of professional military personnel in most vertices of the force. Recent developments, though, within the anti-conscription movement in Greece, such as the high death rate from suicides during service and work-related accidents, such as the ": null
    },
    {
        "Manitsa": "manitsa"
    },
    {
        " incident, combined with a high rate of draft-dodging, have advanced the idea that mandatory conscription should be abolished and an all-professional/all-volunteer army should be put in place.       Greece directs approximately 1.7% of its GDP to military expenditures, the 7th highest percentage in Europe.  In absolute numbers the Greek ": null
    },
    {
        "military budget": "military budget"
    },
    {
        " ranked 28th in the world in 2005. By the same measure, Greek military budget ranked 6th in the Mediterranean basin  and 2nd in its immediate vicinity, the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        ". All rankings according to the  Greek arms purchasing is among the highest in the world: Greece ranked 3rd in the world in 2004.      These figures are explained  in the light of the ": null
    },
    {
        "arms race": "arms race"
    },
    {
        " between Greece and Turkey with key issues being the ": null
    },
    {
        "Cyprus dispute": "cyprus dispute"
    },
    {
        " and disagreement over ": null
    },
    {
        "sovereignty of certain islets": "aegean dispute"
    },
    {
        " of the ": null
    },
    {
        "Aegean": "aegean sea"
    },
    {
        ". For more information see ": null
    },
    {
        "Greco-Turkish relations": "greco-turkish relations"
    },
    {
        ". Conversely, the foreign relations of Greece as well as many internal policy decisions are largely affected by its arms purchases. The United States, being the major arms seller to Greece has been known to actively intervene in military spending decisions made by the Greek government. : The Greek publication Elevtherotipia reported that former Ambassador Nicholas Burns had taken part in attempting to dissuade Greek officials from purchasing the Eurofighter in favor of a U.S. military aircraft. The US has at times actively stepped in to help avoid large scale crisis, as in the case of the ": null
    },
    {
        "Imia-Kardak crisis": "imia-kardak crisis"
    },
    {
        ".     The reduction of military spending has long been an issue in Greek politics. The former prime minister, ": null
    },
    {
        "Kostas Karamanlis": "kostas karamanlis"
    },
    {
        " had proposed a reduction to military spending through a Defence Eurozone ,  referring to the ": null
    },
    {
        "European Security and Defence Policy": "european security and defence policy"
    },
    {
        ". The previous PASOK administration, also planned on reducing military spending  prior to its failure to be re-elected in 2004, while PASOK politicians usually refer to money saved from reducing military spending as a peace dividend .      Some of the parties on the left, such as the ": null
    },
    {
        "Communist Party of Greece": "communist party of greece"
    },
    {
        " and ": null
    },
    {
        "Synaspismos": "synaspismos"
    },
    {
        ", have been vocal in condemning military spending. Regarding the purchase of 30 ": null
    },
    {
        "F-16": "f-16"
    },
    {
        " and 333 ": null
    },
    {
        "Leopard tanks": "leopard 2"
    },
    {
        "in 2005, both parties criticized the New Democracy administration for spending money on weapons while doing nothing to relieve the lower classes and said that high military spending does not correspond to the real needs of the country but is carried out according to ": null
    },
    {
        "NATO": "nato"
    },
    {
        " planning and to serve weapon manufacturers and the countries that host them .             The ": null
    },
    {
        "Greek Orthodox Church": "church of greece"
    },
    {
        " is under the protection of the State, which pays the clergys salaries, and ": null
    },
    {
        "Orthodox Christianity": "eastern orthodox church"
    },
    {
        " is the prevailing religion of Greece according to the Constitution. The Greek Orthodox Church is self-governing but under the spiritual guidance of the Ecumenical Patriarch in ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ". Freedom of religious beliefs is guaranteed by the Constitution, but ": null
    },
    {
        "proselytism": "proselytism"
    },
    {
        " is officially illegal. According to the most recent Eurostat Eurobarometer poll, in 2005, Eurobarometer,  81% of Greek citizens responded that they believe there is a God , whereas 16% answered that they believe there is some sort of spirit or life force and only 3% that they do not believe there is a God, spirit, nor life force . This would make Greece one of the most religious countries in the European Union of 25 members, after Malta and Cyprus.     The Muslim minority, concentrated in ": null
    },
    {
        "Thrace": "thrace"
    },
    {
        ", was given legal status by provisions of the ": null
    },
    {
        "Treaty of Lausanne ": "treaty of lausanne"
    },
    {
        " and is Greeces only officially recognized religious minority. There are small Roman Catholic communities on some of the ": null
    },
    {
        "Cyclades": "cyclades"
    },
    {
        " and the Ionian Islands, remnants of the long ": null
    },
    {
        "Venetian": "republic of venice"
    },
    {
        " rule over the islands. The recent influx of immigrants from Eastern Europe and the Third World has an expectedly varied multi-religious profile .     During the 2001 constitutional amendment, complete separation of church and state was proposed, but the two major parties, ND and PASOK, decided not to open this controversial matter, which clashes with both the population and the clergy. For example, numerous protests occurred over the removal of the Religious Denomination entry from the National ID card in 2000.         , via the Greek Ministry of Internal Affairs    Greek Elections       dossier by Radio France Internationale in English June 2010                        ": null
    }
]