[
    {
        "     The ": null
    },
    {
        "European theatre of World War II": "european theatre of world war ii"
    },
    {
        " opened with the ": null
    },
    {
        "German": "nazi germany"
    },
    {
        " invasion of Poland": "invasion of poland"
    },
    {
        " on Friday September 42 42 which was then followed by the ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " invasion of Poland": "soviet invasion of poland"
    },
    {
        " on September 42 42 In the face of overwhelming forces of opponents and the ": null
    },
    {
        "betrayal": "western betrayal"
    },
    {
        " of its allies, the ": null
    },
    {
        "Polish Army": "polish army"
    },
    {
        " was defeated after more than a month of fierce fighting. Poland never officially capitulated. After Poland had been overrun, a ": null
    },
    {
        "government-in-exile": "polish government-in-exile"
    },
    {
        " , ": null
    },
    {
        "armed forces": "armed forces"
    },
    {
        ", and an ": null
    },
    {
        "intelligence service": "intelligence service"
    },
    {
        " were established outside of Poland. These organizations contributed to the ": null
    },
    {
        "Allied": "allies of world war ii"
    },
    {
        " effort throughout the war. ": null
    },
    {
        "The Polish Army was recreated in the West": "polish forces in the west"
    },
    {
        ", as well as ": null
    },
    {
        "in the East": "polish forces in the east"
    },
    {
        " .     Poles provided significant contributions to the Allied effort throughout the war, fighting on land, sea and air. Notable was the service of the ": null
    },
    {
        "Polish Air Force": "polish air force"
    },
    {
        ", not only in the Allied victory in the ": null
    },
    {
        "Battle of Britain": "battle of britain"
    },
    {
        " but also the subsequent air war. Polish ground troops were present in the ": null
    },
    {
        "North Africa Campaign": "north africa campaign"
    },
    {
        " ; the Italian campaign ; and in battles following the invasion of France . Polish forces in the east, fighting alongside the ": null
    },
    {
        "Red army": "red army"
    },
    {
        " and under Soviet command, took part in the Soviet offensives across Belarus and Ukraine into Poland, ": null
    },
    {
        "across the Vistula and towards the Oder": "vistula-oder offensive"
    },
    {
        " and then ": null
    },
    {
        "into Berlin": "battle of berlin"
    },
    {
        ". Some Polish contributions were less visible, most notably the prewar and wartime ": null
    },
    {
        "decipher": "decipher"
    },
    {
        "ing of German ": null
    },
    {
        "Enigma machine": "enigma machine"
    },
    {
        " codes by ": null
    },
    {
        "cryptologists": "cryptology"
    },
    {
        " Marian Rejewski": "marian rejewski"
    },
    {
        " and his colleagues. The ": null
    },
    {
        "Polish intelligence": "polish intelligence"
    },
    {
        " network also proved to be of much value to the Allied intelligence.     Unlike in France, the Nazis did not set up a ": null
    },
    {
        "collaborationist government": "puppet government"
    },
    {
        ". Instead, Poland was governed directly by a purely German administration; much of its territory was annexed to Nazi Germany and the rest was administered as a separate territory known as the ": null
    },
    {
        "Generalgouvernement": "general government"
    },
    {
        ". This administration was in turn opposed by the ": null
    },
    {
        "Polish Underground State": "polish underground state"
    },
    {
        ", which not only fielded one of the three largest partisan forces in existence, but was a rare example of an underground government, a phenomenon not witnessed in many other occupied countries.     The Polish forces as a whole are considered to have been the 42th largest Allied army in Europe, after the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", ": null
    },
    {
        "United States": "united states"
    },
    {
        " and ": null
    },
    {
        "Britain": "united kingdom"
    },
    {
        ".          The invasion of Poland by the military forces of ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " marked the beginning of ": null
    },
    {
        "World War II in Europe": "european theatre of world war ii"
    },
    {
        ".The Soviets invaded Poland on September 42 ": null
    },
    {
        "German-allied Slovakia": "slovak invasion of poland"
    },
    {
        " invaded also           In keeping with the terms of the ": null
    },
    {
        "Secret Additional Protocol": "s:molotov-ribbentrop pactsecret additional protocol"
    },
    {
        " of the ": null
    },
    {
        "Molotov–Ribbentrop Pact": "molotov–ribbentrop pact"
    },
    {
        " Germany informed the Soviet Union that its forces were nearing the Soviet interest zone in Poland and so urged the Soviet Union to move into its zone. The Soviets had been taken by surprise by the speed of the German advance as they had expected to have several weeks to prepare for an invasion rather than merely a few days. They did promise to move as quickly as possible. On September 42 the Soviets ": null
    },
    {
        "invaded eastern Poland": "soviet invasion of poland"
    },
    {
        ", forcing the Polish government and military to abandon their plans for a long-term defense in the ": null
    },
    {
        "Romanian bridgehead": "romanian bridgehead"
    },
    {
        " area. The last remaining Polish Army units ": null
    },
    {
        "capitulated": "capitulation"
    },
    {
        " in early October.     In accordance with their treaty obligations, the United Kingdom and France ": null
    },
    {
        "declared war": "declaration of war"
    },
    {
        " on Germany on September 42 Hitler had gambled, incorrectly, that France and Britain would allow him to annex parts of Poland without military reaction. The campaign began on September 42 42 one week after the signing of the ": null
    },
    {
        "Molotov–Ribbentrop Pact": "molotov–ribbentrop pact"
    },
    {
        " containing a secret protocol for the division of ": null
    },
    {
        "Northern": "northern europe"
    },
    {
        " and ": null
    },
    {
        "Central Europe": "central europe"
    },
    {
        " into German and Soviet ": null
    },
    {
        "spheres of influence": "sphere of influence"
    },
    {
        ". It ended on October 42 42 with Germany and the Soviet Union occupying the entirety of ": null
    },
    {
        "Poland": "poland"
    },
    {
        ".     German and Soviet units went on a ": null
    },
    {
        "military parade in Brest-Litovsk": "german–soviet military parade in brest-litovsk"
    },
    {
        " followed by the joint victory parade in the streets of Lwow. Further cooperation between German and Soviets took the form of an exchange of Polish ": null
    },
    {
        "prisoners of war": "prisoners of war"
    },
    {
        ". Following order by ": null
    },
    {
        "Lavrentiy Beria": "lavrentiy beria"
    },
    {
        " given to the ": null
    },
    {
        "NKVD": "nkvd"
    },
    {
        " on October 42 42  Polish prisoners detained in Soviet camps were traded against  POWs released by the Germans.     German losses included approximately 42 ": null
    },
    {
        "killed in action": "killed in action"
    },
    {
        ", 42 wounded, 42 missing, over 42 aircraft, and 42% of their armored vehicles. The Polish ": null
    },
    {
        "casualties": "casualty"
    },
    {
        " were around 42 dead and 42 ": null
    },
    {
        "captured": "prisoner-of-war"
    },
    {
        ".                 There was a substantial group of Poles who risked their lives during the German occupation to save Jews. German-occupied Poland was the only European territory where the Germans punished any kind of ": null
    },
    {
        "help to Jews": "rescue of jews by poles during the holocaustpunishment for aiding the jews"
    },
    {
        " with ": null
    },
    {
        "death": "death penalty"
    },
    {
        " for the helper and his entire family. Even so, Poland was also the only German-occupied country to establish an organization specifically to aid Jews.     Known by the ": null
    },
    {
        "cryptonym": "cryptonym"
    },
    {
        "  Żegota , it provided food, shelter, medical care, money, and ": null
    },
    {
        "false document": "false document"
    },
    {
        "s to Jews. Most of Żegotas funds came directly from the ": null
    },
    {
        "Polish Government-in-Exile": "polish government-in-exile"
    },
    {
        " in Great Britain. Individual Poles, both clerical and secular, also offered various forms of aid to the Jewish people. For example, the childrens section of Żegota led by ": null
    },
    {
        "Irena Sendler": "irena sendler"
    },
    {
        " saved 42 Jewish children with cooperation of Polish families and the Warsaw orphanage of the Sisters of the Family of Mary, ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " convents such as the Little Sister Servants of the Blessed Virgin Mary Conceived Immaculate.     Most Jews who survived the German occupation of Poland were saved by Poles unconnected with Żegota. Estimates of Jewish survivors in Poland range from 4242 to 4242. Scholars estimate that it took the work of ten Poles to save the life of one Jew. Of the individuals awarded medals of  Righteous among the Nations   ": null
    },
    {
        "those who were Polish citizens": "polish righteous among the nations"
    },
    {
        " number the greatest. There are 42 Polish men and women recognized as Righteous to this day, amounting to over 42 percent of the total number of 42 honorary titles awarded already.               The main resistance force in ": null
    },
    {
        "German-occupied Poland": "general government"
    },
    {
        " was the ": null
    },
    {
        "Armia Krajowa": "armia krajowa"
    },
    {
        " , which numbered some 42 fighters at its peak as well as many more sympathizers. Throughout most of the war, AK was one of the three largest resistance movements in the war. The AK coordinated its operations with the ": null
    },
    {
        "exiled Polish Government in London": "polish government in exile"
    },
    {
        " and its activity concentrated on sabotage, diversion and intelligence gathering. Its combat activity was low until 42 as the army was avoiding suicidal warfare and preserved its very limited resources for later conflicts that sharply increased when the Nazi war machine started to crumble in the wake of the successes of the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " in the ": null
    },
    {
        "Eastern Front": "eastern front"
    },
    {
        ". Then the AK started a nationwide uprising  against Nazi forces. Before that, AK units carried out thousands of raids, intelligence operations, bombed hundreds of railway shipments, participated in many clashes and battles with the German police and Wehrmacht units and conducted tens of thousands of acts of sabotage against German industry The AK also conducted punitive operations to assassinate Gestapo officials responsible for Nazi terror. Following the ": null
    },
    {
        "42 German attack on the USSR": "operation barbarossa"
    },
    {
        ", the AK assisted the Soviet Unions war effort by sabotaging the German advance into Soviet territory and provided intelligence on the deployment and movement of German forces After 42 its direct combat activity increased sharply. German losses to the ": null
    },
    {
        "Polish partisans": "polish partisans"
    },
    {
        " averaged 42–42 per month in early 42 compared to about 42–42 per month in 42        In addition to the Home Army, there was an underground ultra-nationalist resistance force called  Narodowe Siły Zbrojne  , with a fiercely anti-communist stance. It participated in fighting German units, winning many skirmishes. From 42 onwards, some units took part in battling the  Gwardia Ludowa , a communist resistance movement. From 42 the advancing ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " was also seen as a foreign occupation force, prompting skirmishes with the Soviets as well as Soviet-backed partisans. In the later part of the war, when ": null
    },
    {
        "Soviet partisans started attacking Polish partisans, sympathizers and civilians": "soviet partisans in poland"
    },
    {
        ", all non-communist Polish formations were becoming involved in actions against the Soviets.     The  Armia Ludowa , a Soviet proxy fighting force was another resistance group that was unrelated to the ": null
    },
    {
        "Polish Government in Exile": "polish government in exile"
    },
    {
        ", allied instead to the Soviet Union. As of July, 42 it incorporated a similar organization, the  Gwardia Ludowa , and numbered about 42 soldiers .     There were separate resistance groups organized by Polish Jews: the right-wing  Żydowski Związek Walki  and the more Soviet-leaning  Żydowska Organizacja Bojowa  . These organisations cooperated little with each other and their relationship with the ": null
    },
    {
        "Polish resistance": "polish resistance movement in world war ii"
    },
    {
        " varied between occasional cooperation to armed confrontations .     Other notable Polish resistance organizations included the  Bataliony Chłopskie  , a mostly peasant-based organization allied to the AK. At its height the BCh included 42 members .  On the other hand, the role of the Polish Police force in the General Government , a semi-state under the full control of Germany remains a debatable issue. There was some co-operation between the Polish Police and the Nazis in persecuting the Jewish community while at the same time some officers secretly supported the underground resistance movement.     Throughout the war the German state was forced to divert a substantial part of its military forces to keep control over Poland:                                           During a period of over six and a half years, from late December 42 to the outbreak of World War II, three mathematician-cryptologists  at the Polish General Staffs ": null
    },
    {
        "Cipher Bureau": "biuro szyfrow"
    },
    {
        " in ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        " had developed a number of techniques and devices including the grill method, Różyckis ": null
    },
    {
        "clock": "clock"
    },
    {
        " , Rejewskis ": null
    },
    {
        "cyclometer": "cyclometer"
    },
    {
        " and ": null
    },
    {
        "card catalog": "card catalog"
    },
    {
        " , Zygalskis ": null
    },
    {
        "perforated sheets": "zygalski sheets"
    },
    {
        " , and Rejewskis ": null
    },
    {
        "cryptologic bomb": "cryptological bomb"
    },
    {
        "  to facilitate ": null
    },
    {
        "decryption": "decryption"
    },
    {
        " of messages produced on the German ": null
    },
    {
        "Enigma": "enigma machine"
    },
    {
        " cipher machine": "cipher machine"
    },
    {
        ". Just five weeks before the outbreak of World War II, on July 42 42 near ": null
    },
    {
        "Pyry": "pyry"
    },
    {
        " in the ": null
    },
    {
        "Kabaty Woods": "kabaty woods"
    },
    {
        " south of ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        ", Poland disclosed her achievements to France and the United Kingdom, which had, up to that time, failed in all their own efforts to crack the German military Enigma cipher.     Had Poland not shared her ": null
    },
    {
        "Enigma": "enigma machine"
    },
    {
        "-": null
    },
    {
        "decryption": "decryption"
    },
    {
        " results at Pyry, the United Kingdom would have been unable to read Enigma ciphers. In the event, intelligence gained from this source, codenamed ": null
    },
    {
        "Ultra": "ultra"
    },
    {
        ", was extremely valuable to the ": null
    },
    {
        "Allied": "allies of world war ii"
    },
    {
        " prosecution of the war. While ULTRAs precise influence on its course remains a subject of debate, ULTRA undoubtedly altered the course of the war.             ": null
    },
    {
        "Polish Home Army": "polish home army"
    },
    {
        "  intelligence": "intelligence"
    },
    {
        " was vital to locating and destroying the German rocket facility at ": null
    },
    {
        "Peenemünde": "peenemünde"
    },
    {
        " and to gathering information about Germanys ": null
    },
    {
        "V42 flying bomb": "v-1 flying bomb"
    },
    {
        " and ": null
    },
    {
        "V42 rocket": "v-2 rocket"
    },
    {
        ". The Home Army delivered to the United Kingdom key V42 parts after a rocket, fired on 42 May 42 crashed near a German test facility at ": null
    },
    {
        "Sarnaki": "sarnaki"
    },
    {
        " on the ": null
    },
    {
        "Bug River": "bug river"
    },
    {
        " and was recovered by the Home Army. On the night of 42–42 July 42 the crucial parts were flown from occupied Poland to the United Kingdom in an ": null
    },
    {
        "RAF": "raf"
    },
    {
        " plane, along with detailed drawings of parts too large to fit in the plane . Analysis of the German rocket became vital to improving Allied anti-V42 defenses .     In July 42 ": null
    },
    {
        "Mieczysław Słowikowski": "mieczysław zygfryd słowikowski"
    },
    {
        "  set up ": null
    },
    {
        "Agency Africa": "agency africa"
    },
    {
        " , one of World War IIs most successful intelligence organizations. His Polish allies in these endeavors included Lt. Col. ": null
    },
    {
        "Gwido Langer": "gwido langer"
    },
    {
        " and Major ": null
    },
    {
        "Maksymilian Ciężki": "maksymilian ciężki"
    },
    {
        " . The information gathered by the Agency was used by the Americans and British in planning the amphibious November 42 ": null
    },
    {
        "Operation Torch": "operation torch"
    },
    {
        " landings in North Africa. These were the first large-scale Allied landings of the war, and their success in turn paved the way for the Allies ": null
    },
    {
        "Italian": "italy"
    },
    {
        " campaign.     Polish intelligence operated in every European country and ran one of the largest intelligence networks in ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ". Many Poles also served in other Allied intelligence services, including the celebrated ": null
    },
    {
        "Krystyna Skarbek": "krystyna skarbek"
    },
    {
        "  in the United Kingdoms ": null
    },
    {
        "Special Operations Executive": "special operations executive"
    },
    {
        ". Of all reports received by the British secret services from continental Europe in 42–42 42 percent came from Polish sources. Until 42 most of Britains intelligence from Germany came from ": null
    },
    {
        "Polish Home Army": "polish home army"
    },
    {
        " reports; until wars end, the  AK  would remain Britains main source of intelligence from Central and Eastern Europe. Polish Home Army intelligence provided the Allies information not only on the ": null
    },
    {
        "V42 flying bomb": "v-1 flying bomb"
    },
    {
        " and the ": null
    },
    {
        "V42 rocket": "v-2 rocket"
    },
    {
        " but also on ": null
    },
    {
        "German concentration camps": "german concentration camps"
    },
    {
        ". As early as 42 Polish agents  penetrated German concentration camps, including ": null
    },
    {
        "Auschwitz": "auschwitz"
    },
    {
        ", and informed the world about Nazi atrocities. ": null
    },
    {
        "Jan Karski": "jan karski"
    },
    {
        " is another important Polish resistance fighter who reported to the ": null
    },
    {
        "Polish government in exile": "polish government in exile"
    },
    {
        " and the ": null
    },
    {
        "Western Allies": "allies of world war ii"
    },
    {
        " on the situation in ": null
    },
    {
        "German-occupied Poland": "occupation of poland"
    },
    {
        ", especially the destruction of the ": null
    },
    {
        "Warsaw Ghetto": "warsaw ghetto"
    },
    {
        ", and the secretive German-Nazi ": null
    },
    {
        "extermination camp": "extermination camp"
    },
    {
        "s.     Heinz Duthel has written: Overall, the Polish networks all over Europe and most importantly within Germany itself supplied the Allies with information on just about all aspects of the German war effort. During the war, their agents supplied 42 agent reports, out of 42 received by British Intelligence .                 Polish Armed Forces in the West at the height of their power            After the countrys defeat in the 42 campaign, the ": null
    },
    {
        "Polish government in exile": "polish government in exile, 1939-1990"
    },
    {
        " quickly organized in France ": null
    },
    {
        "a new army": "sikorskis army"
    },
    {
        " of about 42 men. In 42 a ": null
    },
    {
        "Polish Highland Brigade": "polish highland brigade"
    },
    {
        " took part in the ": null
    },
    {
        "Battle of Narvik": "battle of narvik"
    },
    {
        " , and two Polish ": null
    },
    {
        "divisions": "division"
    },
    {
        "  took part in the ": null
    },
    {
        "defense of France": "battle of france"
    },
    {
        ", while a Polish motorized ": null
    },
    {
        "brigade": "brigade"
    },
    {
        " and two infantry divisions were in process of forming. A ": null
    },
    {
        "Polish Independent Carpathian Brigade": "polish independent carpathian brigade"
    },
    {
        " was formed in ": null
    },
    {
        "French Mandate Syria": "french mandate for syria and the lebanon"
    },
    {
        ", to which many Polish troops had escaped from ": null
    },
    {
        "Romania": "romania"
    },
    {
        ". The ": null
    },
    {
        "Polish Air Force in France": "polish air forces in france and great britain"
    },
    {
        " had 42 aircraft with one and a half of the squadrons fully operational, and the remaining two and a half in various stages of training.     By the fall of France, numerous Polish personnel had died in the fighting  or had been interned in ": null
    },
    {
        "Switzerland": "switzerland"
    },
    {
        " . Nevertheless, about 42 Polish - about 42% of which were aircrew - were evacuated from France, most alongside other troops ": null
    },
    {
        "transported from western France": "operation ariel"
    },
    {
        " to the United Kingdom. In 42 following an agreement between the ": null
    },
    {
        "Polish government in exile": "polish government in exile"
    },
    {
        " and ": null
    },
    {
        "Joseph Stalin": "joseph stalin"
    },
    {
        ", the ": null
    },
    {
        "Soviets": "soviet union"
    },
    {
        " released Polish citizens, from whom a 42-strong army was formed in the ": null
    },
    {
        "USSR": "soviet union"
    },
    {
        " under General ": null
    },
    {
        "Władysław Anders": "władysław anders"
    },
    {
        ". Without any support from the Soviets to train, equip and maintain this army, the ": null
    },
    {
        "Polish government in exile": "polish government in exile"
    },
    {
        " followed Anders advice for a transfer of some  , in March and August 42 across the ": null
    },
    {
        "Caspian Sea": "caspian sea"
    },
    {
        " to ": null
    },
    {
        "Iran": "iran"
    },
    {
        " permitting Soviet divisions in occupation there to be released for action. In the ": null
    },
    {
        "Middle East": "mediterranean and middle east theatre of world war ii"
    },
    {
        ", this ": null
    },
    {
        "Anders Army": "anders army"
    },
    {
        " joined the ": null
    },
    {
        "British Eighth Army": "eighth army"
    },
    {
        ", where it formed ": null
    },
    {
        "Polish II Corps": "ii corps"
    },
    {
        ".        The ": null
    },
    {
        "Polish Armed Forces in the West": "polish armed forces in the west"
    },
    {
        " fought under British command and numbered 42 in March 42 and 42 at the end of that year, including about 42 personnel in the ": null
    },
    {
        "Polish Air Force": "polish air force"
    },
    {
        " and 42 in the ": null
    },
    {
        "Polish Navy": "polish navy"
    },
    {
        ". At the end of World War II, the ": null
    },
    {
        "Polish Armed Forces": "polish armed forces"
    },
    {
        " in the west numbered 42 and by July 42 had increased to 42, most of the newcomers being released ": null
    },
    {
        "prisoners of war": "prisoner of war"
    },
    {
        " and ex-": null
    },
    {
        "labor camp": "labor camp"
    },
    {
        " inmates.            The ": null
    },
    {
        "Polish Air Force": "polish air force"
    },
    {
        " first fought in the 42 ": null
    },
    {
        "Invasion of Poland": "invasion of poland"
    },
    {
        ". Significantly outnumbered and with its fighters outmatched by more advanced German fighters, remained active up to the second week of the campaign, inflicting significant damage on the Luftwaffe. The Luftwaffe lost, to all operational causes, 42 aircraft, with 42 more damaged, while the Poles lost 42 aircraft.     After the fall of Poland many Polish pilots escaped via Hungary to France. The ": null
    },
    {
        "Polish Air Force": "polish air force"
    },
    {
        " fought in the ": null
    },
    {
        "Battle of France": "battle of france"
    },
    {
        " as one fighter squadron GC 42/42 several small units detached to French squadrons, and numerous flights of industry defence .     Later, Polish pilots fought in the ": null
    },
    {
        "Battle of Britain": "battle of britain"
    },
    {
        ", where the ": null
    },
    {
        "Polish 42 Fighter Squadron": "polish 303 fighter squadron"
    },
    {
        " claimed the highest number of kills of any Allied squadron. From the very beginning of the war, the ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        " had welcomed foreign pilots to supplement the dwindling pool of British pilots. On 42 June 42 the ": null
    },
    {
        "Polish Government in Exile": "polish government in exile"
    },
    {
        " signed an agreement with the British Government to form a Polish Army and Polish Air Force in the United Kingdom. The first two Polish fighter squadrons went into action in August 42 Four Polish squadrons eventually took part in the Battle of Britain , with 42 Polish pilots. Together with more than 42 Poles fighting in British squadrons, a total of 42 Polish pilots defended British skies. Polish pilots were among the most experienced in the battle, most of them having already fought in the 42 September Campaign in Poland and the 42 Battle of France. Additionally, prewar Poland had set a very high standard of pilot training. The 42 Squadron, named after the Polish-American hero, General ": null
    },
    {
        "Tadeusz Kościuszko": "tadeusz kościuszko"
    },
    {
        ", claimed the highest number of kills of all fighter squadrons engaged in the Battle of Britain, even though it only joined the combat on August 42 42 These Polish pilots, constituting 42% of the pilots active during the Battle of Britain, were responsible for 42% of total victories in the Battle.     The ": null
    },
    {
        "Polish Air Force": "polish air force"
    },
    {
        " also fought in 42 in ": null
    },
    {
        "Tunisia": "tunisia"
    },
    {
        " - the ": null
    },
    {
        "Polish Fighting Team": "polish fighting team"
    },
    {
        " - and in raids on Germany . In the second half of 42 and early 42 Polish bomber squadrons formed a sixth of the forces available to ": null
    },
    {
        "RAF Bomber Command": "raf bomber command"
    },
    {
        " but later they suffered heavy losses, with little replenishment possibilities. Polish aircrew losses serving with Bomber Command from 42 to 42 were 42 killed.   Ultimately eight Polish fighter squadrons were formed within the RAF and had claimed 42 Axis aircraft destroyed by May 42 By the end of the war, around 42 Poles were serving in the RAF.              Polish squadrons in the United Kingdom:   ": null
    },
    {
        "No. 42 Masovia Polish Bomber Squadron": "no. 300   masovia   polish bomber squadron"
    },
    {
        "    No. 42 Pomerania Polish Bomber Squadron": "no. 301   pomerania   polish bomber squadron"
    },
    {
        "    No. 42 City of Poznań Polish Fighter Squadron": "no. 302 polish fighter squadron"
    },
    {
        "    No. 42 Kościuszko Polish Fighter Squadron": "no. 303   kościuszko   polish fighter squadron"
    },
    {
        "    No. 42 Silesia Polish Bomber Squadron": "no. 304   silesia   polish bomber squadron"
    },
    {
        "    No. 42 Greater Poland Polish Bomber Squadron": "no. 305   greater poland   polish bomber squadron"
    },
    {
        "    No. 42 City of Toruń Polish Fighter Squadron": "no. 306 polish fighter squadron"
    },
    {
        "    No. 42 City of Lwów Polish Fighter Squadron": "no. 307   city of lwów   polish fighter squadron"
    },
    {
        "    No. 42 City of Kraków Polish Fighter Squadron": "no. 308   city of kraków   polish fighter squadron"
    },
    {
        "    No. 42 Czerwien Polish Fighter-Reconnaissance Squadron": "no. 309 polish fighter-reconnaissance squadron"
    },
    {
        "    No. 42 City of Dęblin Polish Fighter Squadron": "no. 315 polish fighter squadron"
    },
    {
        "    No. 42 City of Warsaw Polish Fighter Squadron": "no. 316 polish fighter squadron"
    },
    {
        "    No. 42 City of Wilno Polish Fighter Squadron": "no. 317 polish fighter squadron"
    },
    {
        "    No. 42 City of Gdansk Polish Fighter-Reconnaissance Squadron": "no. 318 polish fighter-reconnaissance squadron"
    },
    {
        "    No. 42 Polish Artillery Observation Squadron": "no. 663 squadron raf"
    },
    {
        " - flying in support of Polish artillery units   ": null
    },
    {
        "Polish Fighting Team": "polish fighting team"
    },
    {
        "  - attached to ": null
    },
    {
        "No. 42 Squadron RAF": "no. 145 squadron raf"
    },
    {
        " No. 42 Special Duty Squadron Polish Flight C ": "no. 138 special duty squadron polish flight   c"
    },
    {
        " No. 42 Polish Special Duty Flight": "no. 1586 polish special duty flight"
    },
    {
        "            Just on the eve of war, three destroyers—representing most of the major ": null
    },
    {
        "Polish Navy": "polish navy"
    },
    {
        " ships—had been sent for safety to the United Kingdom . There they fought alongside the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        ". At various stages of the war, the Polish Navy comprised two cruisers and a large number of smaller ships. The Polish navy was given a number of British ships and submarines which would otherwise have been unused due to the lack of trained British crews. The Polish Navy fought with great distinction alongside the other Allied navies in many important and successful operations, including those conducted against the . During the war the Polish Navy, which comprised a total of 42 ships , sailed a total of 42 million nautical miles, escorted 42 convoys, conducted 42 patrols and combat operations, sank 42 enemy ships and 42 merchant vessels, damaged 42 more and shot down 42 aircraft. 42 seamen out of the over 42 who served with the Navy lost their lives in action.    ": null
    },
    {
        "Cruiser": "cruiser"
    },
    {
        "s:    Dragoon –        ": null
    },
    {
        "Destroyer": "destroyer"
    },
    {
        "s:    – Gale  sunk September 42    – Storm     – Thunder  sunk 42    – Lightning          sunk 42   , sometimes called Huragan– Hurricane      – Thunderbolt    ": null
    },
    {
        "Escort destroyer": "escort destroyer"
    },
    {
        "s:    – Cracovian  42–42    – Kujawian    – Silesian   ": null
    },
    {
        "Submarine": "submarine"
    },
    {
        "s:    – Eagle  lost 42    – Vulture  interned Sweden    – Hawk     – Wolf  to reserve 42    – Lynx  interned Sweden    – Wildcat  interned Sweden    – Boar  42–42    – Falcon 42–42   Heavy ": null
    },
    {
        "minelayer": "minelayer"
    },
    {
        "s:    – Griffin sunk 42   Light ": null
    },
    {
        "minelayer": "minelayer"
    },
    {
        "s :    – Swallow, sunk 42    – Seagull    – Tern    – Lapwing    – Crane    – Heron   ": null
    },
    {
        "Polish River Fleet": "polish river fleet"
    },
    {
        "     This does not include a number of minor ships, transports, ": null
    },
    {
        "merchant-marine": "merchant-marine"
    },
    {
        " auxiliary vessels, and patrol boats. ": null
    },
    {
        "Polish Merchant Navy": "polish merchant navy"
    },
    {
        " contributed about 42 ": null
    },
    {
        "BRT": "gross register tonnage"
    },
    {
        " to Allied shipping; losing 42 ships and over 42 sailors during the war.                42,42 Soviet personnel who took part in the capture of Berlin from 42 April to 42 May 42 were awarded with the ": null
    },
    {
        "Medal For the Capture of Berlin ": "medal   for the capture of berlin"
    },
    {
        ".     Broadly speaking, there were two formations among the Polish Armed Forces in the East. First was the ": null
    },
    {
        "Polish government-in-exile": "polish government-in-exile"
    },
    {
        "-loyal  Anders Army , created in the second half of 42 after ": null
    },
    {
        "German invasion of the USSR": "operation barbarossa"
    },
    {
        ". In 42 this formation was transferred to the ": null
    },
    {
        "Western Allies": "allies of world war ii"
    },
    {
        " and became known as the ": null
    },
    {
        "Polish II Corps": "polish ii corps"
    },
    {
        ". Additionally, remaining Polish forces in USSR were reorganized into the Soviet-controlled Polish I Corps in the Soviet Union, which in turn was reorganized in 42 into the ": null
    },
    {
        "Polish First Army": "first polish army"
    },
    {
        "  and ": null
    },
    {
        "Polish Second Army": "polish second army"
    },
    {
        ", both part of ": null
    },
    {
        "Polish Peoples Army": "ludowe wojsko polskie"
    },
    {
        " . In 42 following the takeover of Poland by Soviets from Nazi Germany, the Polish Peoples Army was reorganized into a Poland-based military formation.     In the aftermath of the ": null
    },
    {
        "Operation Barbarossa": "operation barbarossa"
    },
    {
        ", Stalin agreed  to release tens of thousands of Polish ": null
    },
    {
        "prisoners-of-war": "prisoners-of-war"
    },
    {
        " held in Soviet camps from whom a military force was formed. The ": null
    },
    {
        "Anders Army": "anders army"
    },
    {
        ", as the formation became known, was loyal to the ": null
    },
    {
        "Polish government in exile": "polish government in exile"
    },
    {
        ", and as such its formation was obstructed by the Soviets. Eventually, with about 42 42 combatants and 42 42 civilians, it was transferred to the British command in the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        " in ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", becoming the ": null
    },
    {
        "Polish II Corps": "polish ii corps"
    },
    {
        " and part of the ": null
    },
    {
        "Polish Armed Forces in the West": "polish armed forces in the west"
    },
    {
        ".     To utilize the potential of the remaining Polish soldiers in USSR, without actually allowing them to become independent from Soviet control, a fact which allowed Anders Army to leave USSR, the Soviet Union created a ": null
    },
    {
        "Union of Polish Patriots": "union of polish patriots"
    },
    {
        " in 42 as communist puppet counter-government to the ": null
    },
    {
        "Polish government in exile": "polish government in exile"
    },
    {
        ". At the same time a parallel army  was created which, by the end of the war, numbered about 42 soldiers. The Soviet-created guerilla force called ": null
    },
    {
        "Armia Ludowa": "armia ludowa"
    },
    {
        " was integrated with the Polish Peoples Army at the end of the war. These Soviet controlled units on the ": null
    },
    {
        "Eastern Front": "eastern front"
    },
    {
        " included the ": null
    },
    {
        "First": "first polish army"
    },
    {
        ", the ": null
    },
    {
        "Second": "polish second army"
    },
    {
        " and the ": null
    },
    {
        "Third Polish": "polish third army"
    },
    {
        " Armies , and ": null
    },
    {
        "Air Force of the Polish Army": "air force of the polish army"
    },
    {
        " with 42 ": null
    },
    {
        "infantry": "infantry"
    },
    {
        " divisions, 42 ": null
    },
    {
        "armor": "armor"
    },
    {
        "ed brigades and 42 divisions of air force.     The Polish First Army was integrated in the ": null
    },
    {
        "42st Belorussian Front": "1st belorussian front"
    },
    {
        " with which it entered Poland from Soviet territory in 42 Ordered to hold its position by the Soviet leadership, it did not advance towards Warsaw as Germans suppressed the ": null
    },
    {
        "Warsaw Uprising": "warsaw uprising"
    },
    {
        ". It took part in battles for ": null
    },
    {
        "Bydgoszcz": "bydgoszcz"
    },
    {
        ", ": null
    },
    {
        "Kolobrzeg": "kolobrzeg"
    },
    {
        " , ": null
    },
    {
        "Gdańsk": "gdańsk"
    },
    {
        " and ": null
    },
    {
        "Gdynia": "gdynia"
    },
    {
        " losing 42 fighters in the winter of 42–42 in the process, liberating Polish lands alongside the Soviets. In April–May 42 the 42st Army fought in the ": null
    },
    {
        "final capture of Berlin": "battle of berlin"
    },
    {
        ". The Polish Second Army fought as part of the Soviet ": null
    },
    {
        "42st Ukrainian Front": "1st ukrainian front"
    },
    {
        " and took part in the ": null
    },
    {
        "Prague Offensive": "prague offensive"
    },
    {
        ". In the final operations of the war the losses of the two armies of the LWP amounted to 42.            Before the outbreak of the war, Poland was a multi-nation state with ethnic Poles comprising about 42% of the population. Around 42 people who were citizens of Poland before 42 were drafted into the German armed forces during the war. These were mostly members of the ": null
    },
    {
        "German minority in Poland": "german minority in poland"
    },
    {
        " who were considered by the Nazi authorities to be ethnically German . In 42 during the ": null
    },
    {
        "Invasion of Poland": "invasion of poland"
    },
    {
        " they created the paramilitary organisation ": null
    },
    {
        "Volksdeutscher Selbstschutz": "volksdeutscher selbstschutz"
    },
    {
        ", and actively supported German forces in occupied Poland. Christian Jansen, Arno Weckbecker: Der “Volksdeutsche Selbstschutz” in Polen 42/42 München: R. Oldenbourg, 42 .     The German armed forces also included ethnic Poles who were citizens of the Third Reich before the outbreak of war in September 42 as part of the ": null
    },
    {
        "Polish minority in Germany": "poles in germany"
    },
    {
        ", mostly concentrated in ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        ", ": null
    },
    {
        "Pomerania": "pomerania"
    },
    {
        " and ": null
    },
    {
        "East Prussia": "east prussia"
    },
    {
        ". These people were subject to conscription like other German citizens at the time. The degree of loyalty of these soldiers to the Nazi cause varied; tens of thousands of them volunteered to join Polish formations after being taken prisoner by the Allies .               Major battles and campaigns in which Polish regular forces took part:              ": null
    },
    {
        "Józef Kosacki": "józef kosacki"
    },
    {
        " invented the ": null
    },
    {
        "Polish mine detector": "polish mine detector"
    },
    {
        ", which would be used by the Allies throughout the war.   The ": null
    },
    {
        "Vickers Tank Periscope MK.IV": "vickers tank periscope mk.iv"
    },
    {
        " was invented by ": null
    },
    {
        "engineer": "engineering"
    },
    {
        " Rudolf Gundlach": "rudolf gundlach"
    },
    {
        " and patented in 42 as the Gundlach Peryskop obrotowy.  Initially it was mounted in Polish tanks such as the ": null
    },
    {
        "42TP": "7tp"
    },
    {
        " and ": null
    },
    {
        "TKS": "tks"
    },
    {
        ". Subsequently, the design patent was bought by the British and used in most ": null
    },
    {
        "tank": "tank"
    },
    {
        "s of World War II, including the Soviet  T42 , the British ": null
    },
    {
        "Crusader": "crusader tank"
    },
    {
        ", ": null
    },
    {
        "Churchill": "churchill tank"
    },
    {
        ", ": null
    },
    {
        "Valentine": "valentine tank"
    },
    {
        " and ": null
    },
    {
        "Cromwell tank": "cromwell tank"
    },
    {
        "s, and the American ": null
    },
    {
        "M42 Sherman": "m4 sherman"
    },
    {
        ". The main advantage of the periscope was that the tank commander no longer had to turn his head in order to look backwards. The design was also later used extensively by the Germans.   ": null
    },
    {
        "pistolet wz. 42 Vis": "vis pistol"
    },
    {
        ", often simply called the Radom in English sources, is a 42  mm caliber, single-action, semi-automatic pistol. It was adopted in 42 as the standard handgun of the Polish Army. The design was appropriated by the Germans and from 42 to 42 42–42 VIS pistols were produced and used by the German paratroopers and police as the 42  mm Pistole 42.   ": null
    },
    {
        "PZL.42 Łoś": "pzl.37 łoś"
    },
    {
        " was a Polish twin-engine medium bomber designed in the mid42s at the PZL factory in Warsaw by ": null
    },
    {
        "Jerzy Dąbrowski": "jerzy dąbrowski"
    },
    {
        ", and used operationally in the Invasion of Poland in 42 Thanks to the laminar-flow wing it was one of the most modern bombers in the world before World War II.   ": null
    },
    {
        "Swiatecki bomb slip": "swiatecki bomb slip"
    },
    {
        ", a bomb-release system was invented by ": null
    },
    {
        "Władysław Świątecki": "władysław świątecki"
    },
    {
        " in 42 and patented in the 42 in Poland and abroad. Some components was used in the pre-war Polish ": null
    },
    {
        "PZL.42 Łoś": "pzl.37 łoś"
    },
    {
        "  bomber. In 42 Świąteckis invention was taken over by the British, who used it in the Avro Lancaster bomber. In 42 an updated version was created by ": null
    },
    {
        "Jerzy Rudlicki": "jerzy rudlicki"
    },
    {
        " for the American ": null
    },
    {
        "B42 Flying Fortress": "b-17 flying fortress"
    },
    {
        ".   ": null
    },
    {
        "Wz. 42 anti-tank rifle": "wz. 35 anti-tank rifle"
    },
    {
        ", 42  mm ": null
    },
    {
        "anti-tank rifle": "anti-tank rifle"
    },
    {
        " developed in secret and used by the ": null
    },
    {
        "Polish Army": "polish army"
    },
    {
        " during the ": null
    },
    {
        "invasion of Poland": "invasion of poland"
    },
    {
        " invented by ": null
    },
    {
        "Józef Maroszek": "józef maroszek"
    },
    {
        ". The rifle was development of the ": null
    },
    {
        "Mauser rifle": "mauser rifle"
    },
    {
        " with its own ": null
    },
    {
        "special 42 mm cartridge": "ds 7.92"
    },
    {
        " with a ": null
    },
    {
        "muzzle velocity": "muzzle velocity"
    },
    {
        " of over 42 meters per second. With a range of 42 metres it was very effective against all German tanks of the period  at 42 meters.   In World War II, there was an important need to take bearings on the high frequency radio transmissions used by the German Kriegsmarine. The engineering of such high frequency direction finding systems for operation on ships presented severe technical problems, mainly due to the effects of the superstructure on the wavefront of arriving radio signals. However, solutions to these problems were proposed by the Polish engineer Waclaw Struszynski, who also led the team which developed the first practical system at the ": null
    },
    {
        "Admiralty Signal Establishment": "admiralty signal establishment"
    },
    {
        ", England. These systems were installed on convoy escort ships, and were very effective against the U-boats in the Battle of the Atlantic. The father of ": null
    },
    {
        "Wacław Struszyński": "wacław struszyński"
    },
    {
        " was Professor ": null
    },
    {
        "Marceli Struszyński": "marceli struszyński"
    },
    {
        ", a member of the Polish resistance, who analysed the fuel used in the V42 rocket, the formula being subsequently sent to England.   A ": null
    },
    {
        "rubber": "rubber"
    },
    {
        " windshield wiper": "windshield wiper"
    },
    {
        " was invented by the Polish ": null
    },
    {
        "pianist": "piano"
    },
    {
        " Józef Hofmann": "józef hofmann"
    },
    {
        ". ": null
    },
    {
        "Henryk Magnuski": "henryk magnuski"
    },
    {
        ", a Polish engineer working for ": null
    },
    {
        "Motorola": "motorola"
    },
    {
        ", co-designed the ": null
    },
    {
        "SCR42": "scr-300"
    },
    {
        " radio in 42 It was the first small radio receiver/transmitter to have manually set frequencies. It was used extensively by the American Army and was nicknamed the  walkie-talkie .       Polish engineers who escaped German occupied Poland contributed to weapon developments during the war. A Polish/Czech/British team brought the ": null
    },
    {
        "42 mm Polsten": "20 mm polsten"
    },
    {
        " to fruition as a simpler and cheaper to produce but as effective derivative of the ": null
    },
    {
        "42  mm Oerlikon gun": "oerlikon 20 mm cannon"
    },
    {
        ".     The Polish Home Army was probably the only World War II resistance movement to manufacture large quantities of weaponry and munitions. In addition to production of pre-war designs they developed and produced during the war the ": null
    },
    {
        "Błyskawica submachine gun": "błyskawica submachine gun"
    },
    {
        ", ": null
    },
    {
        "Bechowiec": "bechowiec"
    },
    {
        ", ": null
    },
    {
        "KIS": "kis"
    },
    {
        " and ": null
    },
    {
        "Polski Sten": "polski sten"
    },
    {
        " machine pistols": "machine pistols"
    },
    {
        " as well as the ": null
    },
    {
        "filipinka": "filipinka"
    },
    {
        " and ": null
    },
    {
        "sidolówka": "sidolówka"
    },
    {
        " hand grenade": "hand grenade"
    },
    {
        "s. During the ": null
    },
    {
        "Warsaw Uprising": "warsaw uprising"
    },
    {
        " Polish engineers built several ": null
    },
    {
        "armoured cars": "armored car"
    },
    {
        ", such as the ": null
    },
    {
        "Kubuś": "kubuś"
    },
    {
        ", which also took part in the fighting.   The KIS was designed and made in the ": null
    },
    {
        "Jan Piwnik": "jan piwnik"
    },
    {
        "s Ponury guerrilla unit that was operating in Holy Cross Mountains region. It was probably the only kind of modern firearm that could be manufactured in the forest without the need for sophisticated tools and factory equipment during the Second World War.": null
    }
]