[
    {
        "   The Republic of Uzbekistan is a ": null
    },
    {
        "presidential": "presidential republic"
    },
    {
        " constitutional republic, whereby the ": null
    },
    {
        "President of Uzbekistan": "president of uzbekistan"
    },
    {
        " is both ": null
    },
    {
        "head of state": "head of state"
    },
    {
        " and ": null
    },
    {
        "head of government": "head of government"
    },
    {
        ". ": null
    },
    {
        "Executive power": "executive power"
    },
    {
        " is exercised by the ": null
    },
    {
        "government": "government of uzbekistan"
    },
    {
        ". Legislative power is vested in the two chambers of the Supreme Assembly, the ": null
    },
    {
        "Senate": "senate of uzbekistan"
    },
    {
        " and the ": null
    },
    {
        "Legislative Chamber": "legislative chamber of uzbekistan"
    },
    {
        ". The judicial branch , is composed of the ": null
    },
    {
        "Supreme Court": "supreme court of uzbekistan"
    },
    {
        ", ": null
    },
    {
        "Constitutional Court": "constitutional court of uzbekistan"
    },
    {
        ", and ": null
    },
    {
        "Higher Economic Court": "higher economic court of uzbekistan"
    },
    {
        " that exercises ": null
    },
    {
        "judicial power": "judiciary"
    },
    {
        ".     The movement toward economic reform in ": null
    },
    {
        "Uzbekistan": "uzbekistan"
    },
    {
        " has not been matched by movement toward political reform. The government of Uzbekistan has instead tightened its grip since independence , cracking down increasingly on opposition groups. Although the names have changed, the institutions of government remain similar to those that existed before the breakup of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". The government has justified its restraint of public assembly, opposition parties, and the media by emphasizing the need for stability and a gradual approach to change during the transitional period, citing the conflict and chaos in the other former republics . This approach has found credence among a large share of Uzbekistans population, although such a position may not be sustainable in the long run.     Despite the trappings of institutional change, the first years of independence saw more resistance than acceptance of the institutional changes required for democratic reform to take hold. Whatever initial movement toward ": null
    },
    {
        "democracy": "democracy"
    },
    {
        " existed in Uzbekistan in the early days of independence seems to have been overcome by the inertia of the remaining Soviet-style strong centralized leadership.       In the Soviet era, Uzbekistan organized its government and its local communist party in conformity with the structure prescribed for all the republics. The ": null
    },
    {
        "Communist Party of the Soviet Union": "communist party of the soviet union"
    },
    {
        " occupied the central position in ruling the country. The party provided both the guidance and the personnel for the government structure. The system was strictly bureaucratic: every level of government and every governmental body found its mirror image in the party. The instrument used by the CPSU to control the bureaucracy was the system of  nomenklatura , a list of sensitive jobs in the government and other important organizations that could be filled only with party approval. The nomenklatura defined the Soviet political leadership, and the people on the list invariably were members of the CPSU.     Following the failure of the ": null
    },
    {
        "coup": "1991 soviet coup détat attempt"
    },
    {
        " against the government of ": null
    },
    {
        "Mikhail Gorbachev": "mikhail gorbachev"
    },
    {
        " in ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        " in August 42 Uzbekistans ": null
    },
    {
        "Supreme Soviet": "supreme soviet"
    },
    {
        " declared the independence of the republic, henceforth to be known as the Republic of Uzbekistan. At the same time, the ": null
    },
    {
        "Communist Party of Uzbekistan": "communist party of uzbekistan"
    },
    {
        " voted to cut its ties with the CPSU; three months later, it changed its name to the ": null
    },
    {
        "Peoples Democratic Party of Uzbekistan": "peoples democratic party of uzbekistan"
    },
    {
        " , but the party leadership, under President ": null
    },
    {
        "Islam Karimov": "islam karimov"
    },
    {
        ", remained in place. Independence brought a series of institutional changes, but the substance of governance in Uzbekistan changed much less dramatically.     On December 42 42 together with the leaders of ten other Soviet republics, Karimov agreed to dissolve the Soviet Union and form the ": null
    },
    {
        "Commonwealth of Independent States": "commonwealth of independent states"
    },
    {
        ", of which Uzbekistan became a charter member according to the ": null
    },
    {
        "Alma-Ata Declaration": "alma-ata protocol"
    },
    {
        ". Shortly thereafter, Karimov was elected president of independent Uzbekistan in the new countrys first contested election. Karimov drew 42% of the vote against opposition candidate ": null
    },
    {
        "Muhammad Salih": "muhammad salih"
    },
    {
        " , whose showing experts praised in view of charges that the election had been rigged. The major opposition party, ": null
    },
    {
        "Birlik": "unity"
    },
    {
        ", had been refused registration in time for the election.     In 42 the PDPU retained the dominant position in the executive and legislative branches of government that the Communist Party of Uzbekistan had enjoyed. All true opposition groups were repressed and physically discouraged. Birlik, the original opposition party formed by intellectuals in 42 was banned for allegedly subversive activities, establishing the Karimov regimes dominant rationalization for increased authoritarianism: ": null
    },
    {
        "Islamic fundamentalism": "islamic fundamentalism"
    },
    {
        " threatened to overthrow the secular state and establish an Islamic regime similar to that in ": null
    },
    {
        "Iran": "iran"
    },
    {
        ". The constitution ratified in December 42 reaffirmed that Uzbekistan was a ": null
    },
    {
        "secular": "secular"
    },
    {
        " state. Although the constitution prescribed a new form of legislature, the PDPU-dominated Supreme Soviet remained in office for nearly two years until the first election to the new parliament, the ": null
    },
    {
        "Supreme Assembly of Uzbekistan": "supreme assembly of uzbekistan"
    },
    {
        " , which took place in December 42 and January 42     In 42 Karimovs concern about the spread of Islamic fundamentalism spurred Uzbekistans participation in the multinational CIS peacekeeping force sent to quell the civil war in nearby Tajikistan - a force that remained in place three years later because of continuing hostilities. Meanwhile, in 42 and 42 continued repression by the Karimov regime brought strong criticism from international human rights organizations. In March 42 Karimov took another step in the same direction by securing a 42% majority in a referendum on extending his term as president from the prescribed next election in 42 to 42 In early 42 Karimov announced a new policy of toleration for opposition parties and coalitions, apparently in response to the need to improve Uzbekistans international commercial position. A few new parties were registered in 42 although the degree of their opposition to the government was doubtful, and some imprisonments of opposition political figures continued.     The parliamentary election, the first held under the new constitutions guarantee of universal suffrage to all citizens 42 years of age or older, excluded all parties except the PDPU and the pro-government ": null
    },
    {
        "Progress of the Fatherland Party": "progress of the fatherland party"
    },
    {
        ", despite earlier promises that all parties would be free to participate. The new, 42-seat Oliy Majlis included only 42 members elected as PDPU candidates, but an estimated 42 more deputies were PDPU members technically nominated to represent local councils rather than the PDPU. The result was that Karimovs solid majority continued after the new parliament went into office.       From the beginning of his presidency, Karimov remained nominally committed to instituting democratic reforms. A new constitution was adopted by the legislature in December 42 Officially it created a separation of powers among a strong presidency, the Oliy Majlis, and the judiciary. In practice, however, these changes have been largely cosmetic. Although the language of the new constitution includes many democratic features, it can be superseded by executive decrees and legislation, and often constitutional law simply is ignored.     The president, who is directly elected to a five-year term that can be repeated once, is the head of state and is granted supreme executive power by the constitution. As commander in chief of the armed forces, the president also may declare a state of emergency or of war. The president is empowered to appoint the prime minister and full cabinet of ministers and the judges of the three national courts, subject to the approval of the Oliy Majlis, and to appoint all members of lower courts. The president also has the power to dissolve the parliament, in effect negating the Oliy Majliss veto power over presidential nominations in a power struggle situation.     Deputies to the Oliy Majlis, the highest legislative body, are elected to five-year terms. The body may be dismissed by the president with the concurrence of the Constitutional Court; because that court is subject to presidential appointment, the dismissal clause weights the balance of power heavily toward the executive branch. The Oliy Majlis enacts legislation, which may be initiated by the president, within the parliament, by the high courts, by the procurator general , or by the government of the Autonomous Province of Karakalpakstan. Besides legislation, international treaties, presidential decrees, and states of emergency also must be ratified by the Oliy Majlis.     The national judiciary includes the Supreme Court, the Constitutional Court, and the High Economic Court. Lower court systems exist at the regional, district, and town levels. Judges at all levels are appointed by the president and approved by the Oliy Majlis. Nominally independent of the other branches of government, the courts remain under complete control of the executive branch. As in the system of the Soviet era, the procurator general and his regional and local equivalents are both the states chief prosecuting officials and the chief investigators of criminal cases, a configuration that limits the pretrial rights of defendants.       Also passed in the 42 referendum was a plan to create a bicameral parliament. Several political parties have been formed with government approval but have yet to show interest in advocating alternatives to government policy. Similarly, although multiple media outlets have been established, these either remain under government control, or rarely broach political topics. Independent political parties have been denied registration under restrictive registration procedures.     Despite extensive constitutional protections, the Karimov government has actively suppressed the activities of political movements, continues to ban unsanctioned public meetings and demonstrations, and continues to suppress opposition figures. The repression reduces constructive opposition even when institutional changes have been made. In the mid42s, legislation established significant rights for independent trade unions, separate from the government, and enhanced individual rights; but enforcement is uneven, and the role of the state security agencies, principally the National Security Service , remains central.     With the exception of sporadic liberalization, all opposition movements and independent media are essentially banned in Uzbekistan. The early 42s were characterized by arrests and beatings of opposition figures on fabricated charges. For example, one prominent Uzbek, Ibrahim Bureyev, was arrested in 42 after announcing plans to form a new opposition party. After reportedly being freed just before the March referendum, Bureyev shortly thereafter was arrested again on charges of possessing illegal firearms and drugs. In April 42 fewer than two weeks after the referendum extending President Karimovs term, six dissidents were sentenced to prison for distributing the party newspaper of Erk/Liberty and inciting the overthrow of Karimov. Members of opposition groups have been harassed by Uzbekistans SNB as far away as Moscow.       The government severely represses those it suspects of Islamic extremism. Some 42 suspected members of Hizb ut-Tahrir are among those incarcerated, and some are believed to have died over the past several years from prison disease, torture, and abuse. With few options for religious instruction, some young Muslims have turned to underground Islamic movements. The police force and the SNB use torture as a routine investigation technique. The government has begun to bring to trial some officers accused of torture. Four police officers and three SNB officers have been convicted. The government has granted amnesties to political and non-political prisoners, but this was believed to have benefited only a small proportion of those detained. In 42 and the beginning of 42 the government arrested fewer suspected Islamic fundamentalists than in the past. However, in May 42 hundreds were killed by police in a massacre of protesters in the city of Andijan .     In a move welcomed by the international community, the government of Uzbekistan has ended prior censorship, though the media remain tightly controlled.         | President   | Shavkat Mirziyoyev   | Uzbekistan Liberal Democratic Party   |42 September 42   |-   | Prime Minister   | Abdulla Oripov   | Uzbekistan Liberal Democratic Party   |42 December 42   |Parliament of UzbekistanLower HouseOliy Majlissingular - viloyatrespublikasishahri Andijan Bukhara Fergana Jizzakh Urganch Namangan Navoi Qarshi Nukus Samarkand Guliston Termiz Tashkent exceptions and alternate spellings have the administrative center name following in parentheses ": null
    },
    {
        "bekist": "bekist"
    },
    {
        "bekist": "bekist"
    },
    {
        "bekist": "bekist"
    },
    {
        "bekist": "bekist"
    },
    {
        "bekist": "bekist"
    },
    {
        "bekist": "bekist"
    },
    {
        "bekist": "bekist"
    },
    {
        "bekist": "bekist"
    },
    {
        " bekist": "bekist"
    },
    {
        "ner": "ner"
    },
    {
        " bekist": "bekist"
    },
    {
        "bekist": "bekist"
    },
    {
        " bekist": "bekist"
    },
    {
        " bekist": "bekist"
    },
    {
        "bekist": "bekist"
    },
    {
        " bekist": "bekist"
    },
    {
        "bekist": "bekist"
    },
    {
        "ganizati": "ganizati"
    }
]