[
    {
        "        The politics of Panama take place in a framework of a ": null
    },
    {
        "presidential": "Presidential System"
    },
    {
        " representative democratic": "Representative Democracy"
    },
    {
        " republic": "Republic"
    },
    {
        " with ": null
    },
    {
        "multi-party system": "Multi-Party System"
    },
    {
        ", whereby the ": null
    },
    {
        "President of Panama": "President Of Panama"
    },
    {
        " is both ": null
    },
    {
        "head of state": "Head Of State"
    },
    {
        " and ": null
    },
    {
        "head of government": "Head Of Government"
    },
    {
        ".     ": null
    },
    {
        "Executive power": "Executive Power"
    },
    {
        " is exercised by the president. ": null
    },
    {
        "Legislative power": "Legislative Power"
    },
    {
        " is vested in the ": null
    },
    {
        "National Assembly": "National Assembly Of Panama"
    },
    {
        ". The ": null
    },
    {
        "Judiciary": "Judiciary"
    },
    {
        " is independent of the executive and the legislature. The branches are according to ": null
    },
    {
        "Panamas Political Constitution of 1972": "Constitution Of Panama"
    },
    {
        ", reformed by the Actos Reformatorios of 1978 and the Acto Constitucional of 1983, united in cooperation and limited through a system of checks and balances.     Three independent organizations with clearly defined responsibilities are found in the constitution: the Comptroller General of the Republic has the responsibility to manage public funds; the Electoral Tribunal has the responsibility to guarantee liberty, transparency, and the efficacy of the popular vote; and the Ministry of the Public oversees interests of State and of the municipalities.                 The Executive Branch includes a president and one vice-president. The president and vice-president are elected on a single ballot for a five-year term by direct popular vote. Presidents are not allowed to immediately run for re-election, but can run again after waiting five years.       Minister of Agricultural and Livestock Development: Enrique Carles   Minister of Canal Affairs: ": null
    },
    {
        "Roberto Roy": "Roberto Roy"
    },
    {
        "    Ministry of Environment: ": null
    },
    {
        "Emilio Sempris": "Emilio Sempris"
    },
    {
        " Alejandro Ferrer": "Alejandro Ferrer"
    },
    {
        " Rosario Turner Montenegro": "Rosario Turner Montenegro"
    },
    {
        "    Minister of Housing: Mario Etchelecu   Minister of Government: María Luisa Romero   Minister of the Presidency: ": null
    },
    {
        "Álvaro Alemán": "Álvaro Alemán"
    },
    {
        " Alexis Bethancourt": "Alexis Bethancourt"
    },
    {
        " Ramón Arosemena": "Ramón Arosemena"
    },
    {
        " Alcibiades Vásquez": "Alcibiades Vásquez"
    },
    {
        " Luis Ernesto Carles": "Luis Ernesto Carles"
    },
    {
        " Kenia Isolda Porcell Alvarado": "Kenia Isolda Porcell Alvarado"
    },
    {
        " Rolando Julio de León Alba": "Rolando Julio De León Alba"
    },
    {
        " Laura E. Flores H.": "Laura E. Flores H."
    },
    {
        "                The legislative branch consists of a ": null
    },
    {
        "unicameral": "Unicameralism"
    },
    {
        " National Assembly": "National Assembly Of Panama"
    },
    {
        " , composed of 71 members elected to five-year terms from single- and multi-seat ": null
    },
    {
        "constituencies": "Constituency"
    },
    {
        ".       The Judicial Organ administers justice in a permanent, free and expeditious manner. It comprises the Supreme Court of Justice, the Tribunals, and the judges established by law, according to the constitution of Panama .            An autonomous Electoral Tribunal supervises voter registration, the election process, and the activities of political parties. Everyone over the age of 18 are required to vote, although those who fail to do so are not penalized.                    The dominant political parties in Panamanian history have been the PRD and the Panameñista . These parties were founded by charismatic and strong political enemies, ": null
    },
    {
        "Omar Torrijos": "Omar Torrijos"
    },
    {
        " —the deceased father of the previous president, ": null
    },
    {
        "Martín Torrijos": "Martín Torrijos"
    },
    {
        "—and ": null
    },
    {
        "Arnulfo Arias": "Arnulfo Arias"
    },
    {
        " , late husband of the ex-president, Mireya Moscoso. Even though these leaders died years ago, their aura is revived by their followers, and they are present in every election.     Panamanian politics have historically been corrupt.": null
    }
]