[
    {
        "           Polish notation , also known as normal Polish notation , Łukasiewicz notation, Warsaw notation, Polish prefix notation or simply prefix notation, is a mathematical notation in which ": null
    },
    {
        "operators": "Operation"
    },
    {
        " precede their ": null
    },
    {
        "operand": "Operand"
    },
    {
        "s, in contrast to the more common ": null
    },
    {
        "infix notation": "Infix Notation"
    },
    {
        ", in which operators are placed between operands, as well as ": null
    },
    {
        "reverse Polish notation": "Reverse Polish Notation"
    },
    {
        " , in which operators follow their operands. It does not need any parentheses as long as each operator has a fixed ": null
    },
    {
        "number of operands": "Arity"
    },
    {
        ". The description Polish refers to the ": null
    },
    {
        "nationality": "Nationality"
    },
    {
        " of ": null
    },
    {
        "logician": "Logician"
    },
    {
        " Jan Łukasiewicz": "Jan Łukasiewicz"
    },
    {
        ", who invented Polish notation in 1924.     The term Polish notation is sometimes taken  to also include reverse Polish notation.     When Polish notation is used as a syntax for mathematical expressions by ": null
    },
    {
        "programming language": "Programming Language"
    },
    {
        " interpreter": "Interpreter"
    },
    {
        "s, it is readily parsed into ": null
    },
    {
        "abstract syntax trees": "Abstract Syntax Tree"
    },
    {
        "and can, in fact, define a ": null
    },
    {
        "one-to-one representation": "Bijection"
    },
    {
        " for the same. Because of this, ": null
    },
    {
        "Lisp": "Lisp"
    },
    {
        "  and related programming languages define their entire syntax in prefix notation .     A quotation from a paper by ": null
    },
    {
        "Jan Łukasiewicz": "Jan Łukasiewicz"
    },
    {
        ", Remarks on Nicods Axiom and on Generalizing Deduction , page 180, states how the notation was invented:   I came upon the idea of a parenthesis-free notation in 1924. I used that notation for the first time in my article Łukasiewicz, p. 610, footnote.     The reference cited by Łukasiewicz is apparently a lithographed report in ": null
    },
    {
        "Polish": "Polish Language"
    },
    {
        ". The referring paper by Łukasiewicz Remarks on Nicods Axiom and on Generalizing Deduction  was reviewed by ": null
    },
    {
        "Henry A. Pogorzelski": "Henry Pogorzelski"
    },
    {
        " in the Journal of Symbolic Logic in 1965. ": null
    },
    {
        "Heinrich Behmann": "Heinrich Behmann"
    },
    {
        ", editor in 1924 of the article of ": null
    },
    {
        "Moses Schönfinkel": "Moses Schönfinkel"
    },
    {
        " already had the idea of eliminating parentheses in logic formulas.     ": null
    },
    {
        "Alonzo Church": "Alonzo Church"
    },
    {
        " mentions this notation in his classic book on ": null
    },
    {
        "mathematical logic": "Mathematical Logic"
    },
    {
        " as worthy of remark in notational systems even contrasted to ": null
    },
    {
        "Alfred Whitehead": "Alfred North Whitehead"
    },
    {
        " and ": null
    },
    {
        "Bertrand Russells": "Bertrand Russell"
    },
    {
        "logical notational exposition and work in ": null
    },
    {
        "Principia Mathematica": "Principia Mathematica"
    },
    {
        ".     In Łukasiewiczs 1951 book, Aristotles Syllogistic from the Standpoint of Modern Formal Logic, he mentions that the principle of his notation was to write the ": null
    },
    {
        "functors": "Function Symbol"
    },
    {
        "before the ": null
    },
    {
        "arguments": "Argument Of A Function"
    },
    {
        "to avoid brackets and that he had employed his notation in his logical papers since 1929. He then goes on to cite, as an example, a 1930 paper he wrote with ": null
    },
    {
        "Alfred Tarski": "Alfred Tarski"
    },
    {
        " on the ": null
    },
    {
        "sentential calculus": "Propositional Calculus"
    },
    {
        ".     While no longer used much in logic, Polish notation has since found a place in ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        ".       The expression for adding the numbers 1 and 2 is written in Polish notation as  , rather than as  . In more complex expressions, the operators still precede their operands, but the operands may themselves be expressions including again operators and their operands. For instance, the expression that would be written in conventional infix notation as   :    can be written in Polish notation as   :    Assuming a given ": null
    },
    {
        "arity": "Arity"
    },
    {
        " of all involved operators , any well formed prefix representation thereof is unambiguous, and brackets within the prefix expression are unnecessary. As such, the above expression can be further simplified to   :      The processing of the product is deferred until its two operands are available . As with any notation, the innermost expressions are evaluated first, but in Polish notation this innermost-ness can be conveyed by the sequence of operators and operands rather than by bracketing.     In the conventional infix notation, parentheses are required to override the standard ": null
    },
    {
        "precedence rules": "Order Of Operations"
    },
    {
        ", since, referring to the above example, moving them   :    or removing them   :    changes the meaning and the result of the expression. This version is written in Polish notation as   : .     When dealing with non-commutative operations, like division or subtraction, it is necessary to coordinate the sequential arrangement of the operands with the definition of how the operator takes its arguments, i.e., from left to right. For example, , with 10 left to 5, has the meaning of 10 ÷ 5 , or , with 7 left to 6, has the meaning of 7 - 6 .       Prefix/postfix notation is especially popular for its innate ability to express the intended order of operations without the need for parentheses and other precedence rules, as are usually employed with ": null
    },
    {
        "infix notation": "Infix Notation"
    },
    {
        ". Instead, the notation uniquely indicates which operator to evaluate first. The operators are assumed to have a fixed ": null
    },
    {
        "arity": "Arity"
    },
    {
        " each, and all necessary operands are assumed to be explicitly given. A valid prefix expression always starts with an operator and ends with an operand. Evaluation can either proceed from left to right, or in the opposite direction. Starting at the left, the input string, consisting of tokens denoting operators or operands, is pushed token for token on a ": null
    },
    {
        "stack": "Stack"
    },
    {
        ", until the top entries of the stack contain the number of operands that fits to the top most operator . This group of tokens at the stacktop is replaced by the result of executing the operator on these/this operand. Then the processing of the input continues in this manner. The rightmost operand in a valid prefix expression thus empties the stack, except for the result of evaluating the whole expression. When starting at the right, the pushing of tokens is performed similarly, just the evaluation is triggered by an operator, finding the appropriate number of operands that fits its arity already at the stacktop. Now the leftmost token of a valid prefix expression must be an operator, fitting to the number of operands in the stack, which again yields the result. As can be seen from the description, a ": null
    },
    {
        "push-down store": "Deterministic Pushdown Automaton"
    },
    {
        " with no capability of arbitrary stack inspection suffices to implement this ": null
    },
    {
        "parsing": "Parsing"
    },
    {
        ".     The above sketched stack manipulation works –with mirrored input– also for expressions in ": null
    },
    {
        "reverse Polish notation": "Reverse Polish Notation"
    },
    {
        ".       The table below shows the core of ": null
    },
    {
        "Jan Łukasiewiczs": "Jan Łukasiewicz"
    },
    {
        "notation for ": null
    },
    {
        "sentential logic": "Sentential Logic"
    },
    {
        ". Some letters in the Polish notation table stand for particular words in ": null
    },
    {
        "Polish": "Polish Language"
    },
    {
        ", as shown:          Note that the quantifiers ranged over propositional values in Łukasiewiczs work on many-valued logics.     ": null
    },
    {
        "Bocheński": "Józef Maria Bocheński"
    },
    {
        " introduced a system of Polish notation that names all 16 binary ": null
    },
    {
        "connectives": "Logical Connective"
    },
    {
        " of classical propositional logic. For classical propositional logic, it is a compatible extension of the notation of Łukasiewicz. But the notations are incompatible in the sense that Bocheński uses L and M in propositional logic and Łukasiewicz uses L and M in modal logic.       Prefix notation has seen wide application in ": null
    },
    {
        "Lisp": "Lisp"
    },
    {
        " s-expressions": "S-Expressions"
    },
    {
        ", where the brackets are required since the operators in the language are themselves data . Lisp functions may also be ": null
    },
    {
        "variadic": "Variadic Function"
    },
    {
        ". The ": null
    },
    {
        "Tcl": "Tcl"
    },
    {
        " programming language, much like Lisp also uses Polish notation through the mathop library. The Ambi programming language uses Polish notation for arithmetic operations and program construction.     Postfix notation is used in many ": null
    },
    {
        "stack-oriented programming languages": "Stack-Oriented Programming Language"
    },
    {
        "like ": null
    },
    {
        "PostScript": "Postscript"
    },
    {
        " and ": null
    },
    {
        "Forth": "Forth"
    },
    {
        ". ": null
    },
    {
        "CoffeeScript": "Coffeescript"
    },
    {
        " syntax also allows functions to be called using prefix notation, while still supporting the unary postfix syntax common in other languages.     The number of return values of an expression equals the difference between the number of operands in an expression and the total arity of the operators minus the total number of return values of the operators.     Polish notation, usually in postfix form, is the chosen notation of certain ": null
    },
    {
        "calculator": "Calculator"
    },
    {
        "s, notably from ": null
    },
    {
        "Hewlett-Packard": "Hp Calculators"
    },
    {
        ". At a lower level, postfix operators are used by some ": null
    },
    {
        "stack machines": "Stack Machines"
    },
    {
        " such as the ": null
    },
    {
        "Burroughs large systems": "Burroughs Large Systems"
    }
]