[
    {
        "     Politics of Saint Lucia  takes place in the framework of an independent ": null
    },
    {
        "parliamentary democratic": "Parliamentary Democracy"
    },
    {
        " constitutional monarchy": "Constitutional Monarchy"
    },
    {
        ", with ": null
    },
    {
        "Queen Elizabeth II": "Elizabeth Ii"
    },
    {
        " as its ": null
    },
    {
        "head of state": "Head Of State"
    },
    {
        ", represented by a ": null
    },
    {
        "Governor General": "List Of Governors-General Of Saint Lucia"
    },
    {
        ", who acts on the advice of the ": null
    },
    {
        "prime minister": "Prime Minister"
    },
    {
        " and the cabinet. The prime minister is the leader of the majority party of the house, and the cabinet conducts affairs of state. The Governor General exercises basically ceremonial functions, but residual powers, under the ": null
    },
    {
        "constitution": "Constitution Of Saint Lucia"
    },
    {
        ", can be used at the governor generals discretion. The actual power in St. Lucia lies with the ": null
    },
    {
        "prime minister": "Prime Minister Of Saint Lucia"
    },
    {
        " and the cabinet, usually representing the majority party in ": null
    },
    {
        "parliament": "Parliament Of Saint Lucia"
    },
    {
        ".         Politics in St. Lucia was once dominated by the ": null
    },
    {
        "United Workers Party": "United Workers Party"
    },
    {
        " , which, until 1997 had governed the country for all but three years since independence. ": null
    },
    {
        "John Compton": "John Compton"
    },
    {
        " was premier of St. Lucia from 1964 until independence in February 1979.     The ": null
    },
    {
        "Saint Lucia Labour Party": "Saint Lucia Labour Party"
    },
    {
        " won the first post-independence elections in July 1979, taking 12 of 17 seats in parliament. A period squabbling within the party ensued, which led to several changes of prime minister. Pressure from the private sector and the unions forced the government to resign in 1982. New elections were then called and were won resoundingly by Comptons UWP, which took 14 of 17 seats.     The UWP was elected for a second time on April 16, 1987, but with only nine of 17 seats. Seeking to increase his slim margin, Prime Minister Compton suspended parliament and called new elections on April 30. This unprecedented snap election, however, gave the same results as before—the UWP retained nine seats and the SLP eight. In April 1992, Prime Minister Comptons government again defeated the SLP, but this time increased its majority in parliament to 11 of 17 seats.     In 1996, Compton announced his resignation as prime minister in favor of his chosen successor Dr. ": null
    },
    {
        "Vaughan Lewis": "Vaughan Lewis"
    },
    {
        ", former director-general of the ": null
    },
    {
        "Organisation of Eastern Caribbean States": "Organisation Of Eastern Caribbean States"
    },
    {
        " . Dr. Lewis became prime minister and minister of finance, planning and development on April 2, 1996. The SLP also had a change of leadership with former ": null
    },
    {
        "CARICOM": "Caribbean Community"
    },
    {
        " official Dr. ": null
    },
    {
        "Kenny Anthony": "Kenny Anthony"
    },
    {
        " succeeding businessman ": null
    },
    {
        "Julian Hunte": "Julian Hunte"
    },
    {
        ".     In elections held May 23, 1997, the St. Lucia Labour Party won all but one of the 17 seats in Parliament, and Dr. Kenny Anthony became Prime Minister and Minister of Finance, Planning and Development on 24 May 1997.     In elections of December 3, 2001 the St. Lucia Labour Party won 14 of the 17 available seats. The leader of the UWP, Dr. ": null
    },
    {
        "Morella Joseph": "Morella Joseph"
    },
    {
        " failed to win a seat. ": null
    },
    {
        "Arsene James": "Arsene James"
    },
    {
        " is the leader of the Parliamentary Opposition.     In the general elections held on December 11, 2006 the UWP, once again led by Sir John Compton, defeated the SLP, winning 11 of the 17 seats. The next elections in St Lucia are constitutionally due in December 2011. The governing United Workers Party, and the opposition St Lucia Labour Party, along with the newly formed Lucian Peoples Movement, are expected to contest the next elections.       As head of state, Queen ": null
    },
    {
        "Elizabeth II": "Elizabeth Ii"
    },
    {
        " is represented by a governor general who acts on the advice of the prime minister and the cabinet. Following legislative elections, the leader of the majority party or leader of a majority coalition is usually appointed prime minister by the governor general; the deputy prime minister is appointed by the governor general.    ": null
    },
    {
        "Queen": "Monarch Of Saint Lucia"
    },
    {
        " Elizabeth II": "Elizabeth Ii"
    },
    {
        " Governor-General": "List Of Governors-General Of Saint Lucia"
    },
    {
        " Neville Cenac": "Neville Cenac"
    },
    {
        " Prime Minister": "List Of Prime Ministers Of Saint Lucia"
    },
    {
        " Allen Chastanet": "Allen Chastanet"
    },
    {
        " United Workers Party": "United Workers Party"
    },
    {
        " ": null
    }
]