[
    {
        "   The first fully democratic Presidential election since 1960 occurred on 11 March 2007. The election was the final transfer from military to civilian rule following the military coup in 2005. This was the first time the president was selected by ballot in the countrys history. The election was won by ": null
    },
    {
        "Sidi Ould Cheikh Abdallahi": "sidi ould cheikh abdallahi"
    },
    {
        ", who was ousted by a military coup in 2008 and replaced by general ": null
    },
    {
        "Mohamed Ould Abdel Aziz": "mohamed ould abdel aziz"
    },
    {
        ".     Personalities have long exercised an important influence in the politics of ": null
    },
    {
        "Mauritania": "mauritania"
    },
    {
        " - the effective exercise of political power in the country depends on control over resources; perceived ability or integrity; and tribal, ethnic, family, and personal considerations. Conflict between white ": null
    },
    {
        "Moor": "moors"
    },
    {
        ", black Moor, and non-Moor ethnic groups, centering on language, land tenure, and other issues, continues to pose challenges to the idea of national unity.       The government bureaucracy comprises traditional ministries, special agencies, and parastatal companies. The Ministry of Interior controls a system of regional governors and prefects modeled on the French system of local administration. Under this system, Mauritania has 13 regions , including the capital district, ": null
    },
    {
        "Nouakchott": "nouakchott"
    },
    {
        ". Control remains tightly concentrated in the executive branch of the central government, but a series of national and municipal elections since 1992 have produced some limited decentralization.          Mauritania achieved independence from France in 1960. After independence, President ": null
    },
    {
        "Moktar Ould Daddah": "moktar ould daddah"
    },
    {
        ", originally installed by the French, formalized Mauritania into a ": null
    },
    {
        "one-party state": "one-party state"
    },
    {
        " in 1964 with a new ": null
    },
    {
        "constitution": "constitution of mauritania"
    },
    {
        ", which set up an ": null
    },
    {
        "authoritarian": "authoritarianism"
    },
    {
        " presidential regime. Daddahs own ": null
    },
    {
        "Parti du Peuple Mauritanien": "parti du peuple mauritanien"
    },
    {
        " became the ruling organization. The President justified this decision on the grounds that he considered Mauritania unready for western-style ": null
    },
    {
        "multi-party democracy": "multi-party system"
    },
    {
        ". Under this one-party constitution, Daddah was reelected in uncontested elections in 1966, 1971 and 1976. Daddah was ousted in a bloodless coup on July 10, 1978.     A committee of military officers governed Mauritania from July 1978 to April 1992. A referendum approved the current constitution in July 1991.            The  Parti Républicain Démocratique et Social  , led by President ": null
    },
    {
        "Maaouya Ould SidAhmed Taya": "maaouya ould sidahmed taya"
    },
    {
        ", has dominated Mauritanian politics since the countrys first multi-party elections in April 1992 following the approval by ": null
    },
    {
        "referendum": "referendum"
    },
    {
        " of the current ": null
    },
    {
        "constitution": "constitution"
    },
    {
        " in July 1991. President Taya, who won elections in 1992 and 1997, first became chief of state through a December 12, 1984 bloodless coup which made him chairman of the ": null
    },
    {
        "committee of military officers": "military committee for national salvation"
    },
    {
        " that governed Mauritania from July 1978 to April 1992.     ": null
    },
    {
        "Political parties": "list of political parties in mauritania"
    },
    {
        " were legalized again in 1991. By April 1992, as civilian rule returned, 16 major political parties had been recognized; 12 major political parties were active in 2004. By April 1992, as civilian rule returned, 15 political parties had gained recognition. Among the mostly small groupings, two main opposition parties emerged:   the ": null
    },
    {
        "Rally of Democratic Forces": "rally of democratic forces"
    },
    {
        "   the ": null
    },
    {
        "Action for Change": "action for change"
    },
    {
        " --traditionally considered the party of the ": null
    },
    {
        "Haratine": "haratine"
    },
    {
        "s.     Most opposition parties boycotted the first legislative election in 1992, and for nearly a decade the ": null
    },
    {
        "Democratic and Social Republican Party": "democratic and social republican party"
    },
    {
        " dominated the parliament. The opposition participated in municipal elections in January–February 1994 and in subsequent elections for the Senate, gaining representation at the local level as well as one seat in the Senate. Noting procedural changes and opposition gains in municipal and legislative contests, most local observers considered the October 2001 elections open and transparent. The opposition participated in municipal elections in January–February 1994 and subsequent ": null
    },
    {
        "Senate": "senate"
    },
    {
        " elections, most recently in April 2004, gaining representation at the local level as well as three seats in the Senate.     In October 2001, ": null
    },
    {
        "Mauritania": "mauritania"
    },
    {
        " held its third legislative and fifth municipal elections since the establishment of multi-party politics under the 1991 constitution. In an effort to forestall the sort of widespread accusations of fraud and manipulation which had accompanied previous elections, the government introduced new safeguards, including published voter lists and a hard-to-falsify voter identification card. Reversing a trend of election boycotts, 15 opposition parties nominated candidates for more than 3,000 municipal posts and for the 81-member National Assembly. Four opposition parties won a combined 11 seats in the National Assembly and took 15% of the municipal posts. The ruling ": null
    },
    {
        "Democratic and Social Republican Party": "democratic and social republican party"
    },
    {
        " , in conjunction with two coalition parties, won the remaining contests.   See ": null
    },
    {
        "2003 Mauritania election": "2003 mauritania election"
    },
    {
        "     Mauritanias ": null
    },
    {
        "presidential election": "mauritanian presidential election, 2003"
    },
    {
        ", its third since adopting the ": null
    },
    {
        "democratic": "democracy"
    },
    {
        " process in 1992, took place on November 7, 2003. Six candidates, including Mauritanias first female and first ": null
    },
    {
        "Haratine": "haratine"
    },
    {
        "  candidates, represented a wide variety of political goals and backgrounds. ": null
    },
    {
        "Incumbent": "incumbent"
    },
    {
        " President ": null
    },
    {
        "Maaouya Ould SidAhmed Taya": "maaouya ould sidahmed taya"
    },
    {
        " won reelection with 67.02% of the popular vote, according to the official figures, with ex-": null
    },
    {
        "head-of-state": "head-of-state"
    },
    {
        " Col.": "col."
    },
    {
        " Mohamed Khouna Ould Haidalla": "mohamed khouna ould haidalla"
    },
    {
        " finishing second.     SidAhmed Taya recognized the ": null
    },
    {
        "State of Israel": "state of israel"
    },
    {
        " some years before his fall, and started cooperating with the ": null
    },
    {
        "United States": "united states"
    },
    {
        " in ": null
    },
    {
        "antiterrorism": "antiterrorism"
    },
    {
        " activities. His antiterrorist crackdowns were criticized by some ": null
    },
    {
        "human rights": "human rights"
    },
    {
        " NGO": "ngo"
    },
    {
        "s, who talked of an exaggeration and instrumentalization of alleged terrorist activities for political aims.     A group identifying itself as the ": null
    },
    {
        "Military Council for Justice and Democracy": "military council for justice and democracy"
    },
    {
        " overthrew the Taya government on 3 August 2005 during the absence of the President in Saudi Arabia. The ": null
    },
    {
        "military dictatorship": "military dictatorship"
    },
    {
        " said it would remain in power for two years in order to allow time for implementing democratic institutions.       In August 2005, a military coup led by Col. ": null
    },
    {
        "Ely Ould Mohamed Vall": "ely ould mohamed vall"
    },
    {
        " ended Maaouya Ould SidAhmed Tayas 21 years of strong-arm rule.     On August 3, the Mauritanian military, including members of the presidential guard, seized control of key points in the capital of ": null
    },
    {
        "Nouakchott": "nouakchott"
    },
    {
        ". They took advantage of President Tayas attendance at the funeral of ": null
    },
    {
        "Saudi": "saudi arabia"
    },
    {
        " King Fahd": "king fahd"
    },
    {
        " to organize the coup, which took place without loss of life. The officers, calling themselves the Military Council for Justice and Democracy, released the following statement:     :The national armed forces and security forces have unanimously decided to put a definitive end to the oppressive activities of the defunct authority, which our people have suffered from during the past years.      The Military Council later issued another statement naming as president Col. Mohamed Vall, director of the national police force, the  Sûreté Nationale , since 1987, and listing 16 other officers as members.     Col. Mohamed Vall was once regarded as a firm ally of the now-ousted president SidAhmed Taya, even aiding him in the original coup that brought him to power, and later serving as his security chief. This high-level betrayal of the former president suggests broad discontent within the branches of local government, which is further supported by the lack of bloodshed and the populations support of the rebel militaries.     Applauded by the Mauritanian people, but cautiously watched by the international community, the coup has since been generally accepted, while the military junta has promised to organize elections within two years.     Parliamentary and municipal elections were held on the 19 November 2006 .     Israels recognition by the Islamic Republic of Mauritania was maintained by the new regime.       In February 2006, the Mauritanian government denounced amendments to an oil contract made by former leader Maaouiya Ould Taya with ": null
    },
    {
        "Woodside Petroleum": "woodside petroleum"
    },
    {
        ", an Australian company. In 2004, Woodside had agreed to invest $US 600 million in developing Mauritanias ": null
    },
    {
        "Chinguetti offshore oil project": "chinguetti deposit"
    },
    {
        ". The controversial amendments, which Mauritanian authorities declared had been signed outside the legal framework of normal practice, to the great detriment of our country , could cost Mauritania up to $200 million a year, according to  BBC News . Signed by Woodside two weeks after the February 1, 2005 legislation authorizing the four amendments, they provided for a lower state quota in the  profit-oil , and reduced taxes by 15 percent in certain zones. They also eased ": null
    },
    {
        "environmental": "environmental policy"
    },
    {
        " constraints, and extended the length and scope of the exploitation and exploration ": null
    },
    {
        "monopoly": "monopoly"
    },
    {
        ", among other measures.     The disputed amendments were signed by former oil minister Zeidane Ould Hmeida in February 2004 and March 2005. Hmeida was arrested in January 2006 on charges of serious crimes against the countrys essential economic interests .     Nouakchotts authorities declared that the government would likely seek international arbitration, which Woodside  also contemplated.     Discovered in 2001, Chinguetti has proven reserves of about  of oil. At the end of December 2005, authorities estimated that in 2006, the oil profits would be 47 billion  ouguiya s and represent a quarter of the ": null
    },
    {
        "state budget": "state budget"
    },
    {
        ", according to  RFI .        The first fully democratic Presidential election since 1960 occurred on 11 March 2007. The election is the final transfer from military to civilian rule following the military coup in 2005. This is the first time the president will have been selected by ": null
    },
    {
        "ballot": "ballot"
    },
    {
        " in the countrys history.      The election was won by ": null
    },
    {
        "Sidi Ould Cheikh Abdallahi": "sidi ould cheikh abdallahi"
    },
    {
        "     Slavery is still said to exist in Mauritania, some 100 years after slavery officially ended in the West and since it was officially abolished in the country in 1981.       On August 6, 2008, Mauritanias presidential spokesman Abdoulaye Mamadouba said President ": null
    },
    {
        "Sidi Ould Cheikh Abdallahi": "sidi ould cheikh abdallahi"
    },
    {
        ", Prime Minister ": null
    },
    {
        "Yahya Ould Ahmed Waghf": "yahya ould ahmed waghf"
    },
    {
        " and the interior minister, were arrested by renegade Senior Mauritanian army officers, unknown troops and a group of generals, and were held under house arrest at the presidential palace in ": null
    },
    {
        "Nouakchott": "nouakchott"
    },
    {
        ".    In the apparently successful and bloodless ": null
    },
    {
        "coup détat": "coup détat"
    },
    {
        ", Abdallahi daughter, Amal Mint Cheikh Abdallahi said: The security agents of the BASEP came to our home and took away my father.  The coup plotters are top fired Mauritania’s security forces, which include General Muhammad Ould ‘Abd Al-‘Aziz, General Muhammad Ould Al-Ghazwani, General Philippe Swikri, and Brigadier General Ahmad Ould Bakri.  Mauritanian lawmaker, Mohammed Al Mukhtar, announced that many of the countrys people were supporting the takeover attempt and the government is an authoritarian regime and that the president had marginalized the majority in parliament.         ": null
    },
    {
        "President": "heads of state of mauritania"
    },
    {
        " Mohamed Ould Ghazouani": "mohamed ould ghazouani"
    },
    {
        " Union for the Republic": "union for the republic"
    },
    {
        " Prime Minister": "list of heads of government of mauritania"
    },
    {
        " Ismail Ould Bedda Ould Cheikh Sidiya": "ismail ould bedda ould cheikh sidiya"
    },
    {
        " Union for the Republic": "union for the republic"
    },
    {
        "        The ": null
    },
    {
        "Parliament": "parliament of mauritania"
    },
    {
        "  has two ": null
    },
    {
        "chambers": "bicameralism"
    },
    {
        ". The ": null
    },
    {
        "National Assembly": "national assembly of mauritania"
    },
    {
        "  has 81 members, elected for a five-year term in single-seat ": null
    },
    {
        "constituencies": "constituency"
    },
    {
        ". The ": null
    },
    {
        "Senate": "senate of mauritania"
    },
    {
        "  has 56 members, 53 members elected for a six-year term by municipal councillors with one third renewed every two years and 3 members elected by Mauritanians abroad.   The position of the parliament in the present situation is unclear.                       Mauritania is divided in 12 regions and 1 capital district; ": null
    },
    {
        "Adrar": "adrar region"
    },
    {
        ", ": null
    },
    {
        "Assaba": "assaba"
    },
    {
        ", ": null
    },
    {
        "Brakna": "brakna"
    },
    {
        ", ": null
    },
    {
        "Dakhlet Nouadhibou": "dakhlet nouadhibou"
    },
    {
        ", ": null
    },
    {
        "Gorgol": "gorgol region"
    },
    {
        ", ": null
    },
    {
        "Guidimaka": "guidimaka"
    },
    {
        ", ": null
    },
    {
        "Hodh Ech Chargui": "hodh ech chargui"
    },
    {
        ", ": null
    },
    {
        "Hodh El Gharbi": "hodh el gharbi"
    },
    {
        ", ": null
    },
    {
        "Inchiri": "inchiri"
    },
    {
        ", ": null
    },
    {
        "Nouakchott": "nouakchott"
    },
    {
        " Tagant": "tagant region"
    },
    {
        ", ": null
    },
    {
        "Tiris Zemmour": "tiris zemmour"
    },
    {
        ", ": null
    },
    {
        "Trarza": "trarza"
    },
    {
        "       ABEDA": "abeda"
    },
    {
        ", ": null
    },
    {
        "ACCT": "agence de coopération culturelle et technique"
    },
    {
        " , ": null
    },
    {
        "ACP": "acp"
    },
    {
        ", ": null
    },
    {
        "AfDB": "african development bank"
    },
    {
        ", ": null
    },
    {
        "AFESD": "arab fund for economic and social development"
    },
    {
        ", ": null
    },
    {
        "AL": "arab league"
    },
    {
        ", ": null
    },
    {
        "AMF": "arab monetary fund"
    },
    {
        ", ": null
    },
    {
        "AMU": "arab maghreb union"
    },
    {
        ", ": null
    },
    {
        "CAEU": "council of arab economic unity"
    },
    {
        ", ": null
    },
    {
        "CCC": "customs cooperation council"
    },
    {
        ", ": null
    },
    {
        "ECA": "united nations economic commission for africa"
    },
    {
        ", ": null
    },
    {
        "ECOWAS": "economic community of west african states"
    },
    {
        ", ": null
    },
    {
        "FAO": "food and agriculture organization"
    },
    {
        ", ": null
    },
    {
        "G-77": "group of 77"
    },
    {
        ", ": null
    },
    {
        "IBRD": "international bank for reconstruction and development"
    },
    {
        ", ": null
    },
    {
        "ICAO": "international civil aviation organization"
    },
    {
        ", ": null
    },
    {
        "ICRM": "international red cross and red crescent movement"
    },
    {
        ", ": null
    },
    {
        "IDA": "international development association"
    },
    {
        ", ": null
    },
    {
        "IDB": "islamic development bank"
    },
    {
        ", ": null
    },
    {
        "IFAD": "international fund for agricultural development"
    },
    {
        ", ": null
    },
    {
        "IFC": "international finance corporation"
    },
    {
        ", ": null
    },
    {
        "IFRCS": "international red cross and red crescent movement"
    },
    {
        ", ": null
    },
    {
        "IHO": "international hydrographic organization"
    },
    {
        " , ": null
    },
    {
        "ILO": "international labour organization"
    },
    {
        ", ": null
    },
    {
        "IMF": "international monetary fund"
    },
    {
        ", ": null
    },
    {
        "International Maritime Organization": "international maritime organization"
    },
    {
        ", ": null
    },
    {
        "Intelsat": "intelsat"
    },
    {
        ", ": null
    },
    {
        "Interpol": "interpol"
    },
    {
        ", ": null
    },
    {
        "IOC": "ioc"
    },
    {
        ", ": null
    },
    {
        "ITU": "international telecommunication union"
    },
    {
        ", ": null
    },
    {
        "NAM": "non-aligned movement"
    },
    {
        ", ": null
    },
    {
        "OAU": "organisation of african unity"
    },
    {
        ", ": null
    },
    {
        "OIC": "organisation of islamic cooperation"
    },
    {
        ", ": null
    },
    {
        "OPCW": "organisation for the prohibition of chemical weapons"
    },
    {
        ", ": null
    },
    {
        "UN": "united nations"
    },
    {
        ", ": null
    },
    {
        "UNCTAD": "united nations conference on trade and development"
    },
    {
        ", ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        ", ": null
    },
    {
        "UNIDO": "united nations industrial development organization"
    },
    {
        ", ": null
    },
    {
        "UPU": "universal postal union"
    },
    {
        ", ": null
    },
    {
        "WHO": "world health organization"
    },
    {
        ", ": null
    },
    {
        "WIPO": "world intellectual property organization"
    },
    {
        ", ": null
    },
    {
        "WMO": "world meteorological organization"
    },
    {
        ", ": null
    },
    {
        "WToO": "world tourism organization"
    },
    {
        ", ": null
    },
    {
        "WTrO": "world trade organization"
    }
]