[
    {
        "      The politics of Luxembourg takes place in a framework of a ": null
    },
    {
        "parliamentary": "parliamentary system"
    },
    {
        " representative democratic": "representative democracy"
    },
    {
        " monarchy": "monarchy"
    },
    {
        ", whereby the ": null
    },
    {
        "Prime Minister of Luxembourg": "prime minister of luxembourg"
    },
    {
        " is the ": null
    },
    {
        "head of government": "head of government"
    },
    {
        ", and the ": null
    },
    {
        "multi-party system": "multi-party system"
    },
    {
        ". ": null
    },
    {
        "Executive power": "executive power"
    },
    {
        " is under the constitution of 1868, as amended, exercised by the government, by the ": null
    },
    {
        "Grand Duke": "grand duke of luxembourg"
    },
    {
        " and the ": null
    },
    {
        "Council of Government": "council of government of luxembourg"
    },
    {
        " , which consists of a prime minister and several other ministers. Usually the prime minister is the leader of the political party or coalition of parties having the most seats in parliament. ": null
    },
    {
        "Legislative power": "legislative power"
    },
    {
        " is vested in both the government and parliament. The ": null
    },
    {
        "judiciary": "judiciary"
    },
    {
        " is independent of the executive and the legislature.     Legislative power is vested in the ": null
    },
    {
        "Chamber of Deputies": "chamber of deputies of luxembourg"
    },
    {
        ", elected directly to five-year terms.            Since the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the ": null
    },
    {
        "Christian Social Peoples Party": "christian social peoples party"
    },
    {
        " has been the senior partner in all governing coalitions with two exceptions: 1974-79 and since 2013 . The Catholic-oriented CSV resembles ": null
    },
    {
        "Christian democratic": "christian democracy"
    },
    {
        " political parties in other West European nations, and enjoys broad popular support making it the strongest party in the country and the second strongest in those regions where it is not the number one .     The ": null
    },
    {
        "Luxembourg Socialist Workers Party": "luxembourg socialist workers party"
    },
    {
        " is a party of ": null
    },
    {
        "social-democratic": "social democracy"
    },
    {
        " orientation which has been a junior partner in most governments since 1974 either with the CSV in 1984–1999 and 2004-2013, or the Democratic Party in 1974-1979. Its stronghold lies in the industrial belt in the south of the country .     The ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        " is a ": null
    },
    {
        "liberal": "liberalism"
    },
    {
        " party, drawing support from self-employed persons, the business community and the urban upper middle class. Like other West European liberal parties, it advocates a mixture of basic social legislation and minimum government involvement in the economy. It is strongly pro-NATO and defends the idea of a secular state in which religion should not play any role in public life. The DP had been a junior partner in coalition governments with the CSV in 1979–1984 and 1999–2004, and senior partner in a coalition government with the LSAP in 1974-1979.   The traditional stronghold of the party is the City of Luxembourg, the Buergermeeschter of the nations capital coming usually from the ranks of the DP.     The ": null
    },
    {
        "Communist Party": "communist party of luxembourg"
    },
    {
        " , which received 10%-18% of the vote in national elections from World War II to the 1960s, won only two seats in the 1984 elections, one in 1989, and none in 1994. Its small remaining support lies in the heavily industrialized south.     ": null
    },
    {
        "The Greens": "the greens"
    },
    {
        " have received growing support since it was officially formed in 1983. It opposes both nuclear weapons and nuclear power and supports environmental and ecological preservation measures. This party generally opposes Luxembourgs military policies, including its membership in the ": null
    },
    {
        "North Atlantic Treaty Organization": "nato"
    },
    {
        ".     In the June 2004 parliamentary elections, the CSV won 24 seats, the LSAP 14, the DP 10, the Greens 7, and the ": null
    },
    {
        "Alternative Democratic Reform Party": "alternative democratic reform party"
    },
    {
        " 5. ": null
    },
    {
        "The Left": "the left"
    },
    {
        " and the Communist Party each lost its single seat in part due to their separate campaigns. The Democratic Party which had become the junior coalition partner in 1999 registered heavy losses. The long-reigning CSV was the main winner, partly due to the personal popularity of the prime minister ": null
    },
    {
        "Jean-Claude Juncker": "jean-claude juncker"
    },
    {
        " . In July 2004, it chose the LSAP as its coalition partner. Jean Asselborn was appointed as the Vice Prime Minister and Minister of Foreign Affairs and Immigration. In 2013, the CSV lost one seat .     A complete list of all governments is maintained on the website of the Government of Luxembourg.      In 2008, a bitter controversy over ": null
    },
    {
        "euthanasia": "euthanasia"
    },
    {
        " had parliament pass a measure which would restrict the legislative veto powers of the Grand Duke, who had opposed the pro-euthanasia law on the grounds of his personal moral standards based on the Christian faith, a problem of private conscience very similar to what had occurred in Belgium in the early 1990s when King Baudouin expressed his opposition to a law liberalizing ": null
    },
    {
        "abortion": "abortion"
    },
    {
        ".         ": null
    },
    {
        "Grand Duke": "grand duke of luxembourg"
    },
    {
        " Henri": "henri of luxembourg"
    },
    {
        " Prime Minister": "prime minister of luxembourg"
    },
    {
        " Xavier Bettel": "xavier bettel"
    },
    {
        " DP": "democratic party"
    },
    {
        " Deputy Prime Minister": "deputy prime minister of luxembourg"
    },
    {
        " Etienne Schneider": "etienne schneider"
    },
    {
        " LSAP": "luxembourg socialist workers party"
    },
    {
        " Luxembourgish: DChamber; French: Chambre des DéputésLuxembourgish: Staatsrot; French: Conseil dÉtatusually politicians or senior public servants with good political tiesLuxembourgish: Iewechte Geriichtshaff; French: Cour Supérieure de JusticeLuxembourgish: Verwaltungsgeriicht; French: Cour Administrative": null
    },
    {
        "stri": "stri"
    },
    {
        "stri": "stri"
    },
    {
        "stri": "stri"
    },
    {
        "multi-seatedAWACS": null
    },
    {
        "ganizati": "ganizati"
    }
]