[
    {
        "   The politics of Malta takes place within a framework of a ": null
    },
    {
        "parliamentary": "parliamentary system"
    },
    {
        " representative democratic": "representative democracy"
    },
    {
        " republic": "republic"
    },
    {
        ", whereby the ": null
    },
    {
        "President of Malta": "president of malta"
    },
    {
        " is the constitutional head of state. Executive Authority is vested in the President of Malta with the general direction and control of the ": null
    },
    {
        "Government of Malta": "government of malta"
    },
    {
        " remaining with the ": null
    },
    {
        "Prime Minister of Malta": "prime minister of malta"
    },
    {
        " who is the ": null
    },
    {
        "head of government": "head of government"
    },
    {
        " and the cabinet. ": null
    },
    {
        "Legislative power": "legislative power"
    },
    {
        " is vested in the ": null
    },
    {
        "Parliament of Malta": "parliament of malta"
    },
    {
        " which consists of the ": null
    },
    {
        "President of Malta": "president of malta"
    },
    {
        " and the unicameral ": null
    },
    {
        "House of Representatives of Malta": "house of representatives of malta"
    },
    {
        " with the ": null
    },
    {
        "Speaker": "speaker of the house of representatives of malta"
    },
    {
        " presiding officer of the legislative body. ": null
    },
    {
        "Judicial power": "judicial power"
    },
    {
        " remains with the ": null
    },
    {
        "Chief Justice": "chief justice of malta"
    },
    {
        " and the ": null
    },
    {
        "Judiciary of Malta": "judiciary of malta"
    },
    {
        ". Since ": null
    },
    {
        "Independence": "independence day"
    },
    {
        ", the party electoral system has been dominated by the ": null
    },
    {
        "Christian democratic": "christian democratic"
    },
    {
        " Nationalist Party": "nationalist party"
    },
    {
        "  and the ": null
    },
    {
        "social democratic": "social democratic"
    },
    {
        " Labour Party": "labour party"
    },
    {
        " .              Since independence, two parties have dominated Maltas polarized and evenly divided politics during this period: the centre-right ": null
    },
    {
        "Nationalist Party": "nationalist party"
    },
    {
        " and the centre-left ": null
    },
    {
        "Labour Party": "labour party"
    },
    {
        ". Third parties have failed to score any electoral success since the pre-independence ": null
    },
    {
        "1962 general election": "1962 maltese general election"
    },
    {
        ". In the ": null
    },
    {
        "2013 election": "2013 maltese general election"
    },
    {
        ", the ": null
    },
    {
        "Democratic Alternative": "democratic alternative"
    },
    {
        "  managed to secure only 1.80% of the first preference votes nationwide.     The 1996 elections resulted in the election of the Labour Party, by 8,000 votes, to replace the Nationalists who had won in 1987 and 1992. Voter turnout was characteristically high at 96%, with the Labour Party receiving 50.72%, the Nationalist Party 47.8%, the ": null
    },
    {
        "Democratic Alternative": "democratic alternative"
    },
    {
        " 1.46%, and independent candidates 0.02%. In 1998, the Labour Partys loss in a parliamentary vote led the Prime Minister to call an early election. The Nationalist Party was returned to office in September 1998 by a majority of 13,000 votes, holding a five-seat majority in Parliament. Voter turnout was 95%, with the Nationalist Party receiving 51.81%, the Labour Party 46.97%, the Democratic Alternative 1.21%, and independent candidates 0.01%.     The Nationalist government wrapped up negotiations for ": null
    },
    {
        "European Union": "european union"
    },
    {
        " membership by the end of 2002. A ": null
    },
    {
        "referendum": "referendum"
    },
    {
        " on the issue was called in March 2003 for which the Nationalists and the Democratic Alternative campaigned for a yes vote while Labour campaigned heavily for no vote, invalidate their vote or abstain. Turnout was 91%, with more than 53% voting yes .     The Labour Party argued that the yes votes amounted to less than 50% of the overall votes, hence, and citing the ": null
    },
    {
        "1956 Integration referendum": "1956 maltese united kingdom integration referendum"
    },
    {
        " as an example, they claimed that the yes had not in fact won the referendum. The then MLP Leader ": null
    },
    {
        "Alfred Sant": "alfred sant"
    },
    {
        " said that the General Elections that was to be held within a month would settle the affair. In the General Elections the Nationalists were returned to office with 51.79% of the vote to Labours 47.51%. The Democratic Alternative managed 0.68%. The Nationalists were thus able to form a government and sign and ratify the EU Accession Treaty on 16 April 2003.     On 1 May 2004 Malta joined the EU and on 1 January 2008, the ": null
    },
    {
        "Eurozone": "eurozone"
    },
    {
        " with the ": null
    },
    {
        "euro": "euro"
    },
    {
        " as the national currency. The first elections after membership were held in March 2008 resulting in a narrow victory for the Nationalist Party with 49.34% of first preference votes. In May 2011, a nationwide ": null
    },
    {
        "referendum": "2011 maltese divorce referendum"
    },
    {
        " was held on the introduction of ": null
    },
    {
        "divorce": "divorce"
    },
    {
        ". This was the first time in the history of parliament that a motion originating outside from the Cabinet had been approved by Parliament.     In March 2013, the slim majority enjoyed by the Nationalists was overturned dramatically with the Labour Party returning to Government after fifteen years in Opposition. A record-breaking vote disparity of 36,000 was achieved by the Labour Party leading to the resignation of the Nationalist leader ": null
    },
    {
        "Lawrence Gonzi": "lawrence gonzi"
    },
    {
        "     In June 2017, after a snap election was called by the Labour Party on its ": null
    },
    {
        "May Day": "may day"
    },
    {
        " celebrations. The record-breaking vote disparity achieved by the Labour Party in 2013 was again increased to around 40,000 votes. The then new leader of the opposition ": null
    },
    {
        "Simon Busuttil": "simon busuttil"
    },
    {
        " announced his resignation shortly thereafter. This election saw the first third party elected to Maltas Parliament since before Independence, with the election of ": null
    },
    {
        "Marlene Farrugia": "marlene farrugia"
    },
    {
        " in the 10th District representing the ": null
    },
    {
        "Democratic Party": "democratic party"
    },
    {
        ".        Under its 1964 constitution, Malta became a ": null
    },
    {
        "parliamentary democracy": "parliamentary democracy"
    },
    {
        " within the Commonwealth. Queen ": null
    },
    {
        "Elizabeth II of the United Kingdom": "elizabeth ii of the united kingdom"
    },
    {
        " was sovereign of Malta, and a ": null
    },
    {
        "Governor-General": "governor-general"
    },
    {
        " exercised executive authority on her behalf, while the actual direction and control of the government and the nations affairs were in the hands of the cabinet under the leadership of a Maltese prime minister.     On December 13, 1974, the constitution was revised, and Malta became a republic within the Commonwealth, with executive authority vested in the ": null
    },
    {
        "President of Malta": "president of malta"
    },
    {
        " which can be exercised directly or through officers subordinate to him. The president is elected by the House of Representatives for a five-year term. They appoint as Prime Minister the leader of the party with a majority of seats in the ": null
    },
    {
        "unicameral": "unicameral"
    },
    {
        " House of Representatives, known in Maltese as Kamra tad-Deputati.     The President also nominally appoints, upon recommendation of the Prime Minister, the individual ministers. Ministers are selected from among the members of the House of Representatives, which usually consists of 65 members unless bonus seats are given to a party which gains an absolute majority of votes but not a Parliamentary majority. Elections must be held at least every 5 years and the electoral system used is ": null
    },
    {
        "single transferable vote": "single transferable vote"
    },
    {
        ".       Malta is divided into 68 elected ": null
    },
    {
        "local councils": "local councils of malta"
    },
    {
        ", with each council responsible for the administration of cities or regions of varying sizes. Administrative responsibility is distributed between the local councils and the central government in Valletta.   The ": null
    },
    {
        "Local Councils Act, 1993": "local councils act, 1993"
    },
    {
        " was published on June 30, 1993, subdividing Malta into 54 local councils in Malta and 14 in ": null
    },
    {
        "Gozo": "gozo"
    },
    {
        ". The inhabitants who are registered elect the Council every three years, as voters in the ": null
    },
    {
        "Local Councils Electoral Register": "local councils electoral register"
    },
    {
        ". Elections are held by means of the system of proportional representation using the single transferable vote. The mayor is the head of the Local Council and the representative of the Council for all effects under the Act. The Executive Secretary, who is appointed by the Council, is the executive, administrative, and financial head of the Council. All decisions are taken collectively with the other members of the Council. Local councils are responsible for the general upkeep and embellishment of the locality, local wardens, and refuse collection, and carry out general administrative duties for the central government such as collection of government rents and funds, and answering government-related public inquiries.     There are also Administrative Committees elected with responsibility for smaller regions.       Elections to the ": null
    },
    {
        "House of Representatives": "house of representatives of malta"
    },
    {
        "  are based on the ": null
    },
    {
        "single transferable vote": "single transferable vote"
    },
    {
        " system, a variant of the ": null
    },
    {
        "proportional representation": "proportional representation"
    },
    {
        " electoral system. First vacancies are filled through ": null
    },
    {
        "casual election": "casual election"
    },
    {
        " and subsequent vacancies through co-option, meaning that no ": null
    },
    {
        "by-elections": "by-election"
    },
    {
        "are held between one general election and the other. The Parliamentary term cannot exceed five years.     Ordinarily, 65 members are elected to the House from 13 multi-seat ": null
    },
    {
        "constituencies": "constituency"
    },
    {
        " each returning 5 MPs. Additional MPs are elected in two circumstances:     when a party achieves 50%+1 of first-preference valid votes in the election but does not secure a Parliamentary majority it is awarded enough seats to make a Parliamentary majority   when in an election contested by more than two parties only two parties are elected to Parliament and the relative Parliamentary strength is not proportionate to the first preference votes obtained, additional seats are allocated to establish proportionality     A third electoral amendment has been enacted which guarantees strict-proportionality with respect to votes and seats to parliamentary political groups.                    The Judicial system in Malta comprises Inferior Courts, Civil and Criminal Courts of   Appeal, and a Constitutional Court. , Malta pre-accession report 2003, p.13 Inferior courts are presided over by a Magistrates which have original jurisdiction in criminal and civil actions. In the Criminal Courts, the presiding judge sits with a jury of nine. The Court of Appeal and the Court of Criminal Appeal hear appeals from decisions of the civil and criminal actions respectively.     The highest court, the Constitutional Court, has both original and appellate jurisdiction. In its appellate jurisdiction it adjudicates cases involving violations of human rights and interpretation of the Constitution. It can also perform ": null
    },
    {
        "judicial review": "judicial review"
    },
    {
        ". In its original jurisdiction it has jurisdiction over disputed parliamentary elections and electoral corrupt practices.     There is a legal aid scheme offered to citizens lacking the means to afford legal defence.     According to the Constitution, the President appoints the ": null
    },
    {
        "Chief Justice of Malta": "chief justice of malta"
    },
    {
        " and the judges of the superior courts on the advice of the ": null
    },
    {
        "Prime Minister of Malta": "prime minister of malta"
    },
    {
        ".   Guarantees for the independence of the judiciary include the security of tenure for judges until their mandatory retiring age set at 65, or until ": null
    },
    {
        "impeachment": "impeachment"
    },
    {
        ". The impeachment procedure for judges foresees a removal decision of the President upon request by the House of   Representatives supported by a two-thirds majority of its members. Impeachment may be based on the grounds of proved inability to perform judiciary functions in office or proved misbehavior by the ": null
    },
    {
        "Commission for the Administration of Justice": "commission for the administration of justice of malta"
    },
    {
        ".   The independence of the judiciary is also guaranteed by the constitutional requirement that the judges’ salaries are paid from the Consolidated Fund and thus the government may not diminish or amend them to their prejudice.     The Maltese system is considered in line with the principles of separation of powers and of independence of the judiciary. However, in its pre-accession evaluation reports, the ": null
    },
    {
        "European Commission": "european commission"
    },
    {
        " has suggested in 2003 the need to reform the procedure for appointment of the members of the judiciary, currently controlled by political bodies , in order to improve its objectivity. The Commission has also pointed to the need to check the compliance of the procedure for challenging judges and magistrates provided for by Article 738 of the Code of Organisation and Civil Procedure with the principle of an impartial tribunal enshrined in the ": null
    },
    {
        "European Convention on Human Rights": "european convention on human rights"
    },
    {
        ". , Malta pre-accession report 2002, p.17       Malta is a member of the ": null
    },
    {
        "Commonwealth of Nations": "commonwealth of nations"
    },
    {
        ", ": null
    },
    {
        "CE": "council of europe"
    },
    {
        ", ": null
    },
    {
        "EBRD": "european bank for reconstruction and development"
    },
    {
        ", ": null
    },
    {
        "ECE": "united nations economic commission for europe"
    },
    {
        ", ": null
    },
    {
        "EU": "european union"
    },
    {
        " , ": null
    },
    {
        "FAO": "food and agriculture organization"
    },
    {
        ", ": null
    },
    {
        "IAEA": "international atomic energy agency"
    },
    {
        ", ": null
    },
    {
        "IBRD": "international bank for reconstruction and development"
    },
    {
        ", ": null
    },
    {
        "ICAO": "international civil aviation organization"
    },
    {
        ", ": null
    },
    {
        "ICCt": "international criminal court"
    },
    {
        ", ": null
    },
    {
        "ICFTU": "international confederation of free trade unions"
    },
    {
        ", ": null
    },
    {
        "ICRM": "international red cross and red crescent movement"
    },
    {
        ", ": null
    },
    {
        "IFAD": "international fund for agricultural development"
    },
    {
        ", ": null
    },
    {
        "IFRCS": "international red cross and red crescent movement"
    },
    {
        ", ": null
    },
    {
        "ILO": "international labour organization"
    },
    {
        ", ": null
    },
    {
        "IMF": "international monetary fund"
    },
    {
        ", ": null
    },
    {
        "IMO": "international maritime organization"
    },
    {
        ", ": null
    },
    {
        "Inmarsat": "international mobile satellite organization"
    },
    {
        ", ": null
    },
    {
        "Intelsat": "intelsat"
    },
    {
        ", ": null
    },
    {
        "Interpol": "interpol"
    },
    {
        ", ": null
    },
    {
        "IOC": "ioc"
    },
    {
        ", ": null
    },
    {
        "IOM": "international organization for migration"
    },
    {
        ", ": null
    },
    {
        "ISO": "international organization for standardization"
    },
    {
        ", ": null
    },
    {
        "ITU": "international telecommunication union"
    },
    {
        ", ": null
    },
    {
        "OPCW": "organisation for the prohibition of chemical weapons"
    },
    {
        ", ": null
    },
    {
        "OSCE": "organization for security and co-operation in europe"
    },
    {
        ", ": null
    },
    {
        "PCA": "permanent court of arbitration"
    },
    {
        ", ": null
    },
    {
        "UN": "united nations"
    },
    {
        ", ": null
    },
    {
        "UNCTAD": "united nations conference on trade and development"
    },
    {
        ", ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        ", ": null
    },
    {
        "UNIDO": "united nations industrial development organization"
    },
    {
        ", ": null
    },
    {
        "UPU": "universal postal union"
    },
    {
        ", ": null
    },
    {
        "WCL": "world confederation of labour"
    },
    {
        ", ": null
    },
    {
        "WCO": "world customs organization"
    },
    {
        ", ": null
    },
    {
        "WHO": "world health organization"
    },
    {
        ", ": null
    },
    {
        "WIPO": "world intellectual property organization"
    },
    {
        ", ": null
    },
    {
        "WMO": "world meteorological organization"
    },
    {
        ", ": null
    },
    {
        "WToO": "world tourism organization"
    },
    {
        ", ": null
    },
    {
        "WTrO": "world trade organization"
    },
    {
        "     Malta was a long-time member of the ": null
    },
    {
        "Non-Aligned Movement": "non-aligned movement"
    }
]