[
    {
        "       New Caledonia  is a ": null
    },
    {
        "French": "france"
    },
    {
        " sui generis collectivity": "overseas departments and territories of francespecial collectivity"
    },
    {
        " with a system of government based on ": null
    },
    {
        "parliamentarism": "parliamentary system"
    },
    {
        " and ": null
    },
    {
        "representative democracy": "representative democracy"
    },
    {
        ". The President of the Government is the ": null
    },
    {
        "head of government": "head of government"
    },
    {
        ", and there is a ": null
    },
    {
        "multi-party system": "multi-party system"
    },
    {
        ", with ": null
    },
    {
        "Executive power": "executive power"
    },
    {
        " being exercised by the government. ": null
    },
    {
        "Legislative power": "legislative power"
    },
    {
        " is vested in both the ": null
    },
    {
        "government": "government"
    },
    {
        " and the ": null
    },
    {
        "Congress of New Caledonia": "congress of new caledonia"
    },
    {
        ". The ": null
    },
    {
        "judiciary": "judiciary"
    },
    {
        " is independent of the executive and the legislature.       Article 77 of the ": null
    },
    {
        "Constitution of France": "constitution of france"
    },
    {
        " and the ": null
    },
    {
        "Organic Law": "organic law"
    },
    {
        " 99-209 confers a unique status on New Caledonia between that of an independent country and a regular  collectivité doutre-mer  or overseas collectivité of France. A territorial congress and government have been established, and the 1998 ": null
    },
    {
        "Nouméa Accord": "nouméa accord"
    },
    {
        " organized a devolution of powers. Key areas such as taxation, labor law, health and hygiene and foreign trade are already in the hands of the Congress. Further powers will supposedly be given to the Congress in the near future.     Under article 4 of the ": null
    },
    {
        "Organic Law": "organic law"
    },
    {
        " 99-209 a New Caledonian citizenship has also been introduced: only New Caledonian citizens have the right to vote in the local elections. This measure has been criticized, because it creates a second-class status for French citizens living in New Caledonia who do not possess New Caledonian citizenship . New Caledonia is also allowed to engage in international cooperation with independent countries of the ": null
    },
    {
        "Pacific Ocean": "pacific ocean"
    },
    {
        ". Finally, the territorial Congress is allowed to pass statutes that are contrary to ": null
    },
    {
        "French law": "french law"
    },
    {
        " in a certain number of areas.     On the other hand, New Caledonia remains an integral part of the French Republic. Inhabitants of New Caledonia are French citizens and carry French passports. They take part in the legislative and presidential French elections. New Caledonia sends two representatives to the ": null
    },
    {
        "French National Assembly": "french national assembly"
    },
    {
        " and two senators to the ": null
    },
    {
        "French Senate": "french senate"
    },
    {
        ". The representative of the French central state in New Caledonia is the ": null
    },
    {
        "High Commissioner of the Republic": "high commissioner of the republic"
    },
    {
        " , who is the head of civil services, and who sits in the government of the territory.     The ": null
    },
    {
        "Nouméa Accord": "nouméa accord"
    },
    {
        " stipulates that the Congress will have the right to call for a ": null
    },
    {
        "referendum": "referendum"
    },
    {
        " on ": null
    },
    {
        "independence": "independence"
    },
    {
        " after 2014, at a time of its choosing. Following the timeline set by the Nouméa Accord, the groundwork was laid for a Referendum on full independence from France at a meeting chaired by the French Prime Minister ": null
    },
    {
        "Édouard Philippe": "édouard philippe"
    },
    {
        " on 2 November 2017, with the referendum to be held by November 2018. Voter list eligibility had been a subject of a long dispute, but the details have were resolved at this meeting.  In the 2018 referendum, voters narrowly chose to remain a part of France.     The current president of the government elected by the Congress is ": null
    },
    {
        "Philippe Germain": "philippe germain"
    },
    {
        ", from the loyalist ": null
    },
    {
        "Caledonia Together": "caledonia together"
    },
    {
        " political party.        ": null
    },
    {
        "Vincent Bouvier": "vincent bouvier"
    },
    {
        " Philippe Germain": "philippe germain"
    },
    {
        " TE": "caledonia together"
    },
    {
        " Congrèstwo members from each of the eight customary airesfirst constituency, ": null
    },
    {
        "Caledonia Together": "caledonia together"
    },
    {
        ", CEsecond constituency, Caledonia Together, CERassemblement-UMPRassemblement-UMP": null
    },
    {
        "an": "an"
    },
    {
        "   associateSPCassociate ": null
    }
]