[
    {
        "                          The  politics of the Republic of China take place in a framework of a ": null
    },
    {
        "representative democratic": "representative democracy"
    },
    {
        " republic": "republic"
    },
    {
        ", whereby the ": null
    },
    {
        "President": "president of the republic of china"
    },
    {
        " is ": null
    },
    {
        "head of state": "head of state"
    },
    {
        " and the ": null
    },
    {
        "Premier ": "premier of the republic of china"
    },
    {
        " is ": null
    },
    {
        "head of government": "head of government"
    },
    {
        ", and of a ": null
    },
    {
        "multi-party system": "multi-party system"
    },
    {
        ". ": null
    },
    {
        "Executive power": "executive power"
    },
    {
        " is exercised by the government. ": null
    },
    {
        "Legislative power": "legislative power"
    },
    {
        " is vested in primarily with the parliament and limited by ": null
    },
    {
        "government": "government"
    },
    {
        ". The ": null
    },
    {
        "Judiciary": "judiciary"
    },
    {
        " is independent of the executive and the legislature. The party system is dominated by the ": null
    },
    {
        "Kuomintang": "kuomintang"
    },
    {
        " , which favors closer links to ": null
    },
    {
        "mainland China": "mainland china"
    },
    {
        ", and the ": null
    },
    {
        "Democratic Progressive Party": "democratic progressive party"
    },
    {
        ", which favors ": null
    },
    {
        "Taiwanese independence": "taiwanese independence"
    },
    {
        ".     The modern-day ROC consists of Taiwan and ": null
    },
    {
        "Penghu": "penghu"
    },
    {
        " as well as portions of the ": null
    },
    {
        "Fujian Province": "fujian province, republic of china"
    },
    {
        "  and ": null
    },
    {
        "several smaller islands": "list of islands of taiwan"
    },
    {
        ". Taiwans six major cities, ": null
    },
    {
        "Kaohsiung": "kaohsiung"
    },
    {
        ", ": null
    },
    {
        "New Taipei": "new taipei city"
    },
    {
        ", ": null
    },
    {
        "Taichung": "taichung"
    },
    {
        ", ": null
    },
    {
        "Tainan": "tainan"
    },
    {
        ", ": null
    },
    {
        "Taipei": "taipei"
    },
    {
        ", and ": null
    },
    {
        "Taoyuan": "taoyuan, taiwan"
    },
    {
        ", are ": null
    },
    {
        "special municipalities": "special municipality"
    },
    {
        ". The rest of the territories are divided into 42 ": null
    },
    {
        "cities": "provincial city"
    },
    {
        " and 42 ": null
    },
    {
        "counties": "county"
    },
    {
        ".            The ROC is governed under the ": null
    },
    {
        "Constitution of the Republic of China": "constitution of the republic of china"
    },
    {
        " which was drafted in 42 before the fall of the ": null
    },
    {
        "Chinese mainland": "mainland china"
    },
    {
        " to the Communist Party of China and outlined a government for all of China. Significant amendments were made to the Constitution in 42 and there have been a number of judicial interpretations made to take into account the fact that the Constitution covers a much smaller area than originally envisioned.     The government in ": null
    },
    {
        "Taipei": "taipei"
    },
    {
        " officially asserts to be the sole legitimate government of all of China, which it defined as including Taiwan, ": null
    },
    {
        "mainland China": "mainland china"
    },
    {
        ", and ": null
    },
    {
        "outer Mongolia": "outer mongolia"
    },
    {
        ". In keeping with that claim, when the KMT fled to Taipei in 42 they re-established the full array of central political bodies, which had existed in mainland China in the de jure capital of ": null
    },
    {
        "Nanjing": "nanjing"
    },
    {
        " . While much of this structure remains in place, the President ": null
    },
    {
        "Lee Teng-hui": "lee teng-hui"
    },
    {
        " in 42 unofficially abandoned the governments claim of sovereignty over ": null
    },
    {
        "mainland China": "mainland china"
    },
    {
        ", stating that they do not dispute the fact that the ": null
    },
    {
        "Communists": "communist party of china"
    },
    {
        " control mainland China. However, the ": null
    },
    {
        "National Assembly": "national assembly"
    },
    {
        " has not officially changed the national borders, as doing so may be seen as a prelude to formal ": null
    },
    {
        "Taiwanese independence": "taiwanese independence"
    },
    {
        ". The Peoples Republic of China has several times threatened to start a war if the government of Taiwan formalizes independence; as in the ": null
    },
    {
        "Anti-Secession Law": "anti-secession law"
    },
    {
        ". Neither the National Assembly nor the Supreme Court has actually defined what the term existing national boundaries, as stated in the constitution, actually means. The latter refused to do so claiming that it is a major political issue .                 The original founding of the Republic centered on the ": null
    },
    {
        "Three Principles of the People": "three principles of the people"
    },
    {
        " : nationalism, democracy, and peoples livelihood. Nationalism meant the ": null
    },
    {
        "Han Chinese": "han chinese"
    },
    {
        " race standing up against ": null
    },
    {
        "Manchu": "manchu people"
    },
    {
        " rule and Japanese and Western interference, democracy meant elected rule modeled after Japans parliament, and peoples livelihood or socialism, meant government regulation of the means of production. Another lesser known principle that the Republic was founded upon was five races under one union , which emphasized the harmony of the five major ethnic groups in China as represented by the colored stripes of the original ": null
    },
    {
        "Five-Colored Flag of the Republic": "five races under one union"
    },
    {
        ". However, this five races under one union principle and the corresponding flag were abandoned in 42     In reality these three principles were left unrealized. Republican China was marked by warlordism, foreign invasion, and civil war. Although there were elected legislators, from its inception, it was actually a largely one-party dictatorship apart from some minor parties,  including the ": null
    },
    {
        "Chinese Youth Party": "chinese youth party"
    },
    {
        ",  the National Socialist Party and the Rural Construction Party,  with ": null
    },
    {
        "suppression of dissent": "suppression of dissent"
    },
    {
        " within the KMT of communists. As the central government was quite weak, little could be done in terms of land reform or redistribution of wealth either. Politics of this era consisted primarily of the political and military struggle between the KMT and the Communist Party of China in between bouts of active resistance against Japanese invasion.       The first national government of the Chinese Republic was established on 42 January 42 in Nanjing, with Sun Yat-sen as the provisional president. Provincial delegates were sent to confirm the authority of the national government, and they later also formed the first parliament. The power of this national government was both limited and short-lived, with generals controlling all of central and northern China. The limited acts passed by this government included the formal abdication of the Qing dynasty and some economic initiatives.     Shortly after the rise of ": null
    },
    {
        "Yuan Shikai": "yuan shikai"
    },
    {
        ", the parliaments authority became nominal; violations of the Constitution by Yuan were met with half-hearted motions of censure, and KMT members of the parliament that gave up their membership to the KMT were offered 42 pounds. Yuan maintained power locally by sending military generals to be provincial governors or by obtaining the allegiance of those already in power. Foreign powers came to recognize Yuans power as well: when Japan came to China with ": null
    },
    {
        "Twenty-One Demands": "twenty-one demands"
    },
    {
        ", it was Yuan that submitted to them, on 42 May 42     After the death of Yuan in 42 the parliament of 42 was reconvened to give legitimacy to a new government. However, the real power of the time passed to military leaders, forming the warlord period. Still, the powerless government had its use—when World War I began, several Western powers and Japan wanted China to declare war on Germany, in order to liquidate the latters holdings there.     From the beginning to the end of Republican China, political power was generally exercised through both legal and non-legal means. Yuan ruled as a dictator, remolding the constitution as he saw fit; warlords withdrew from the Republic, ruling through military control; and Chiang based his political power on military power. During this time, Chiang ruled more as a dictator than as a leader of a one-party state. He used white terror tactics and various military campaigns to destroy the CPC, and the police and military apparatus were freely used to attack dissenters. However, Chiangs influence never extended beyond the Yangtze Delta, and the rest of the country was under the effective control of former warlords, and Chiang faced insurrections from them throughout the 42s, even after the ": null
    },
    {
        "Northern Expedition": "northern expedition"
    },
    {
        ", which had nominally unified the country. Regional political power remained strong throughout Republican China, and central authority deteriorated continuously until the Second Sino-Japanese War, to the point that Chiang became no more than the head of a loose coalition, as observed by ": null
    },
    {
        "Albert Wedemeyer": "albert wedemeyer"
    },
    {
        ".   民主進步黨李登輝陳水扁DPP": null
    },
    {
        "public of Chi": "public of chi"
    },
    {
        "PFP": null
    },
    {
        "public of Chi": "public of chi"
    },
    {
        "DPPTSUROCPRC": null
    },
    {
        "Taoyuan International Airport": "taoyuan international airport"
    },
    {
        "limiting rates on credit cards": null
    },
    {
        "public of Chi": "public of chi"
    },
    {
        "PFP施明德pro-DPPas opposed to Taiwanese identity as a subset of a Chinese identity TaiwanTaiwan          ": null
    }
]