[
    {
        "        Politics of Nauru  takes place in a framework of a ": null
    },
    {
        "parliamentary": "parliamentary system"
    },
    {
        " representative democratic": "representative democracy"
    },
    {
        " republic, whereby the ": null
    },
    {
        "President of Nauru": "president of nauru"
    },
    {
        " is the ": null
    },
    {
        "head of government": "head of government"
    },
    {
        " of the ": null
    },
    {
        "executive branch": "executive branch"
    },
    {
        ". ": null
    },
    {
        "Legislative power": "legislative power"
    },
    {
        " is vested in both the government and the parliament. The ": null
    },
    {
        "Judiciary": "judiciary"
    },
    {
        " is ": null
    },
    {
        "independent": "separation of powers"
    },
    {
        " of the ": null
    },
    {
        "executive": "executive branch"
    },
    {
        " and the ": null
    },
    {
        "legislature": "legislative branch"
    },
    {
        ".                ": null
    },
    {
        "Naurus": "nauru"
    },
    {
        "economic viability has historically rested on its ": null
    },
    {
        "phosphate reserves": "phosphate mining in nauru"
    },
    {
        ". ": null
    },
    {
        "Phosphate": "phosphate"
    },
    {
        " has been mined on the island since 1906. After its independence in 1968, this small Pacific nation generated healthy revenues from this lucrative—but finite—resource. The phosphate supply has been largely exhausted in recent years, and the economy has declined since its peak near 1980.       In this regard, the government has tried to develop the island into an ": null
    },
    {
        "offshore financial centre": "offshore financial centre"
    },
    {
        ", imitating the success of the Bahamas and other island nations around the world that have emerged as major ": null
    },
    {
        "offshore banking": "offshore banking"
    },
    {
        " centres. The government has also invested in property on other islands and the United States through its ": null
    },
    {
        "Nauru Phosphate Royalties Trust": "nauru phosphate royalties trust"
    },
    {
        ".     Over the course of recent years, however, offshore banking institutions and instruments have come under increasing scrutiny by international bodies seeking to make international finance a more transparent system. Nauru, as a result, has been a casualty of this movement.     In December 1999, four major international banks banned dollar transactions with Nauru.  The ": null
    },
    {
        "United States Department of State": "united states department of state"
    },
    {
        " issued a report identifying Nauru as a major money laundering centre, used by narcotics traffickers and organized crime figures.       The last few years has seen repeated changes of government. Naurus unsettled political situation never led to civil disturbances; the transitions were always sanctioned by parliament and occurred peacefully.     President ": null
    },
    {
        "Bernard Dowiyogo": "bernard dowiyogo"
    },
    {
        " took office in April 2000 for his fourth and, after a minimal hiatus, fifth stints as Naurus top executive. Dowiyogo first served as president from 1976 to 1978. He returned to that office in 1989, and was re-elected in 1992. A vote in parliament, however, forced him to yield power to ": null
    },
    {
        "Kinza Clodumar": "kinza clodumar"
    },
    {
        " in 1995. Dowiyogo regained the presidency when the Clodumar government fell in mid-1998.     In April 2000, ": null
    },
    {
        "René Harris": "rené harris"
    },
    {
        ", former chairman of the ": null
    },
    {
        "Nauru Phosphate Corporation": "nauru phosphate corporation"
    },
    {
        ", became president as he briefly assembled support in parliament. Harris attempt to put together an administration lasted for only a few days of parliamentary maneuvering. In the end, Harris proved unable to secure parliaments confidence, and Dowiyogo returned yet again to the presidency by the end of the month.     Rene Harris was finally able to claim power as the president of Nauru in March 2001 when he was elected to the presidency by the parliament; his term was to last three years, presumably ending in 2004.       Phosphate depletion will likely be one of the most important considerations for the government in the next few years as the supply is forecast to be exhausted by 2003. Since Nauru imports almost everything it consumes the need to diversify the economy and to generate other sources of revenue is of paramount importance.     As noted above, offshore banking has been one arena into which Nauru has traversed, however, the rewards are limited by growing concern about the ethical parameters of this business. Tourism is another industry that is also being gradually built.     Yet another concern is the ": null
    },
    {
        "ecological damage": "environmental degradation"
    },
    {
        " that resulted from a century of phosphate mining. Along with the United Kingdom, Australia and New Zealand were responsible for the large scale and indiscriminate mining of phosphate on the tiny island for most of the 20th century.     The mining left an ecological and economic disaster for Nauru to handle when the country achieved independence in 1968. Not only was the countrys principal resource and employment generating activity almost entirely depleted by the rapid mining done by the three countries, the mining companies had also failed to follow the basic principles of restoring and regenerating the lands where mining had been completed. Thus, Nauru was left to handle the immense and expensive task of restoring large chunks of land which were destroyed by the mining.     Nauru demanded compensation from the three nations, but was refused. Finally, in 1993, Nauru was forced to turn to the International Court of Justice at The Hague in The Netherlands. It filed a claim of $73 million against the three countries. The case was soon afterwards settled out of court by Australia, with Britain and New Zealand also contributing to the reparations sought by Nauru.     Today, Nauru is almost totally dependent on trade with New Zealand, Australia and Fiji. Arable land is very limited as are all other natural resources, now that its long-time economic base of phosphate mines has been almost completely depleted.       On the international front, in late July 2002, ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        " cut its diplomatic ties with Nauru. Taiwan and Nauru had shared diplomatic ties for 22 years; Taiwan has enjoyed diplomatic ties with several Pacific countries even in the face of the ": null
    },
    {
        "One China policy": "one china policy"
    },
    {
        " by Beijing. Nevertheless, this particular 22-year-long legacy was broken when Naurus president decided to change its allegiance and establish formal relations with China. The move effectively shifted diplomatic recognition from Taipei to Beijing, thus angering the government of Taiwan, which described the shift in policy as reckless.     Naurus decision to recognize Beijing via the signing of diplomatic papers and a joint communique ultimately resulted in the cessation of Taiwanese aid. Nauru instead received a US$150 million aid package from Beijing.     In April 2005, during a state visit to the Marshall Islands, President Chen Shui-bian of Taiwan met and spoke with the Nauruan President Ludwig Scotty. On 14 May 2005, the two countries signed the necessary documents to restore formal ties and reopen embassies.  The Peoples Republic of China consequently severed ties two weeks later on 31 May.       In early 2003, a fight for power emerged between President Rene Harris and former President Bernard Dowiyogo. The power struggle occurred following a non-confidence vote in parliament, which effectively ejected Harris from the position of president. Reports suggested that Harris was ousted because of rising anxieties regarding economic mismanagement. At the time, Dowiyogo referred to Naurus political scenario as being critical.     It was reported that Dowiyogo became the president replacing Harris, however, information surrounding the shift in power was sparse. There was very little international coverage of the matter. Regardless, Dowiyogos tenure did not last for long. In March 2003, Dowiyogo had heart surgery in the United States and died.       In May 2003, elections were held within the parliament to select a new president. In those elections, Ludwig Scotty gained the most support and became the new president. The actual results of the parliamentary vote were as follows: Ludwig Scotty—10 parliamentary votes, Kinza Clodumar—7 parliamentary votes. President Scotty became president on 29 May 2003. He served only until August 2003 when he was ousted in a non-confidence measure. Rene Harris was elected as president.     Meanwhile, in ": null
    },
    {
        "parliamentary elections held in May 2003": "2003 nauruan parliamentary election"
    },
    {
        ", Nauru First Party won 3 seats and independents garnered 15 in total.     In late June 2004, Naurus former parliament speaker Ludwig Scotty became the countrys new president. His presidency followed the exit of outgoing President Rene Harris following yet another non-confidence measure.     For his part, Scotty had resigned as parliamentary speaker in April 2004 in protest of the Naurus financial crisis which included the commencement of receivership proceedings by corporate giant, General Electric. During that period, Nauru faced the seizure of its assets if the country failed to honor its debt payments.     Since Scottys resignation as parliamentary speaker, the parliament was unable to convene as members of parliament could not decide whom to appoint as his replacement. The scenario led to a political crisis, the financial crisis notwithstanding.     In mid-2004, the government of Australia sent envoys to help Nauru deal with its financial crisis. By August 2004, a report by the Australian Centre for Independent Studies suggested that Nauru might consider relinquishing its independent status in favor of becoming an Australian territory. The report called for radical economic reform as well as the restructuring of both governmental instruments and public service. The author of the report has offered Nauru economic advice in the past.      Scotty was re-elected to serve a full term in October 2004. Following a vote of no confidence by Parliament against President Scotty on 19 December 2007, Marcus Stephen became the President. Following Stephen’s resignation in November 2011, Freddie Pitcher became President. Sprent Dabwido then moved a motion of no confidence in Pitcher, and Dabwido was duly elected President by the parliament, with nine votes supporting his nomination and eight votes opposing.     Elections for Parliament were held in ": null
    },
    {
        "2013": "2013 nauruan parliamentary election"
    },
    {
        ", after which ": null
    },
    {
        "Baron Waqa": "baron waqa"
    },
    {
        " was elected by Parliament as President.          In January 2014, ": null
    },
    {
        "Naurus": "nauru"
    },
    {
        "President ": null
    },
    {
        "Baron Waqa": "baron waqa"
    },
    {
        " fired the countrys only magistrate Peter Law  and its Chief Justice Geoffrey Eames . Eames, himself, was fired after issuing an injunction to temporarily halt Laws deportation.       In May and June 2014, Waqa suspended 5 of the 7 members of Naurus Opposition from Parliament indefinitely. Radio NZ – Nauru opposition MPs still in limbo over suspensions –      Three of the MPs, ": null
    },
    {
        "Mathew Batsiua": "mathew batsiua"
    },
    {
        ", ": null
    },
    {
        "Kieren Keke": "kieren keke"
    },
    {
        " and ": null
    },
    {
        "Roland Kun": "roland kun"
    },
    {
        ", were suspended in May 2014 for making comments to international media critical of the government and the alleged breakdown of the rule of law. Radio NZ – Naurus Govt suspends opposition MPs –  Another two, ": null
    },
    {
        "Sprent Dabwido": "sprent dabwido"
    },
    {
        " and ": null
    },
    {
        "Squire Jeremiah": "squire jeremiah"
    },
    {
        " were suspended a month later for behaving in an unruly manner. The Guardian – Nauru Suspends Two More Opposition MPs – 5 June 2015http://www.theguardian.com/world/2014/jun/05/nauru-suspends-two-more-opposition-mps Nauru suspends two more opposition MPs ahead of budget hand down     In June 2015, Jeremiah, Dabwido, and Batsiua were arrested and Kun had his passport cancelled amid claims that they had been trying to destabilize the Government by talking to foreign media. NZ Herald – Extra cops called in to protect Nauru Govt – 26 June 2015  & objectid11468615 Radio NZ – Arrested MPs to appear in court – 20 June 2015         ": null
    },
    {
        "President of Nauru": "president of nauru"
    },
    {
        " Lionel Aingimea": "lionel aingimea"
    },
    {
        " Nonpartisan": "nonpartisan"
    },
    {
        " u": "u"
    },
    {
        "NIC": null
    }
]