[
    {
        "         The politics of Hong Kong takes place in a framework of a political system dominated by its quasi-constitutional document, the ": null
    },
    {
        "Hong Kong Basic Law": "hong kong basic law"
    },
    {
        ", its ": null
    },
    {
        "own legislature": "legislative council of hong kong"
    },
    {
        ", the ": null
    },
    {
        "Chief Executive": "chief executive of hong kong"
    },
    {
        " as the ": null
    },
    {
        "head of government": "head of government"
    },
    {
        " and of the ": null
    },
    {
        "Special Administrative Region": "hong kong special administrative region"
    },
    {
        " and of a politically constrained ": null
    },
    {
        "multi-party system": "multi-party system"
    },
    {
        ". The Government of the Hong Kong Special Administrative Region of the People’s Republic of China is led by the ": null
    },
    {
        "Chief Executive": "chief executive of hong kong"
    },
    {
        ", the head of government.     On 1 July 1997, ": null
    },
    {
        "sovereignty of Hong Kong was transferred": "transfer of the sovereignty of hong kong"
    },
    {
        " to ": null
    },
    {
        "China": "china"
    },
    {
        " , ending over one and a half centuries of ": null
    },
    {
        "British rule": "british hong kong"
    },
    {
        ". ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " became a ": null
    },
    {
        "Special Administrative Region": "special administrative regions of china"
    },
    {
        " of the PRC with a high degree of autonomy in all matters except foreign affairs and defence, which are responsibilities of the PRC government. According to the ": null
    },
    {
        "Sino-British Joint Declaration": "sino-british joint declaration"
    },
    {
        " and the Basic Law, Hong Kong will retain its political, economic and judicial systems and unique way of life and continue to participate in international agreements and organisations as a dependent territory for at least 50 years after ": null
    },
    {
        "retrocession": "cessionretrocession"
    },
    {
        ". For instance, the ": null
    },
    {
        "International Olympic Committee": "international olympic committee"
    },
    {
        " recognises Hong Kong as a participating dependency under the name, Hong Kong, China , separate from the delegation from the ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        ".            In accordance with Article 31 of the ": null
    },
    {
        "Constitution of the Peoples Republic of China": "constitution of the peoples republic of china"
    },
    {
        ", Hong Kong has ": null
    },
    {
        "Special Administrative Region": "special administrative region of the peoples republic of china"
    },
    {
        " status which provides constitutional guarantees for implementing the policy of ": null
    },
    {
        "one country, two systems": "one country, two systems"
    },
    {
        " . Wong, Yiu-chung. . One Country, Two Systems in Crisis: Hong Kongs Transformation. Lexington Books. Hong Kong. . The ": null
    },
    {
        "Basic Law": "hong kong basic law"
    },
    {
        ", Hong Kongs constitutional document, was approved in March 1990 by ": null
    },
    {
        "National Peoples Congress": "national peoples congress"
    },
    {
        " of China, and entered into force upon the transfer of sovereignty on 1 July 1997.     The Hong Kong government is ": null
    },
    {
        "economically liberal": "economically liberal"
    },
    {
        ", but currently ": null
    },
    {
        "universal suffrage": "universal suffrage"
    },
    {
        " is only granted in ": null
    },
    {
        "District Council": "district council of hong kong"
    },
    {
        " elections, and in elections for half of the Legislative Council. The head of the government  is elected through an ": null
    },
    {
        "electoral college": "election committee"
    },
    {
        " with the majority of its members elected by a limited number of voters mainly within business and professional sectors.              The ": null
    },
    {
        "Chief Executive": "chief executive of hong kong"
    },
    {
        " is the head of the special administrative region, and is also the highest-ranking official in the Government of Hong Kong Special Administrative Region, and is the head of the executive branch.     The Chief Executive is elected by a 1200-member Election Committee drawn mostly from the voters in the ": null
    },
    {
        "functional constituencies": "functional constituency"
    },
    {
        " but also from religious organisations and municipal and central government bodies. The ": null
    },
    {
        "Executive Council": "executive council of hong kong"
    },
    {
        ", the top policy organ of the executive government that advises on policy matters, is entirely appointed by the Chief Executive.          In accordance with Article 26 of the Basic Law of the Hong Kong Special Administrative Region, permanent residents of Hong Kong are eligible to vote in direct elections for the 35 seats representing geographical constituencies and 35 seats from ": null
    },
    {
        "functional constituencies": "functional constituency"
    },
    {
        " in the 70-seat, unicameral ": null
    },
    {
        "Legislative Council": "legislative council of hong kong"
    },
    {
        " .     Within functional constituencies, 5 seats attribute to ": null
    },
    {
        "District Council ": "district council"
    },
    {
        " which virtually regards the entire city as a single electoral constituency. The franchise for the other 30 seats is limited to about 230,000 voters in the other functional constituencies .          The Judiciary consists of a series of courts, of which the ": null
    },
    {
        "court of final adjudication": "court of last resort"
    },
    {
        " is the ": null
    },
    {
        "Court of Final Appeal": "court of final appeal"
    },
    {
        ".     While Hong Kong retains the ": null
    },
    {
        "common law": "common law"
    },
    {
        " system, the ": null
    },
    {
        "Standing Committee of the National Peoples Congress of China": "standing committee of the national peoples congress of china"
    },
    {
        " has the power of final interpretation of national laws affecting Hong Kong, including the Basic Law, and its opinions are therefore binding on Hong Kong courts on a prospective basis.                 On 29 January 1999, the Court of Final Appeal, the highest judicial authority in Hong Kong interpreted several Articles of the ": null
    },
    {
        "Basic Law": "hong kong basic law"
    },
    {
        ", in such a way that the Government estimated would allow 1.6  million ": null
    },
    {
        "Mainland China": "mainland china"
    },
    {
        " immigrants to enter Hong Kong within ten years. This caused widespread concerns among the public on the social and economic consequences.     While some in the legal sector advocated that the ": null
    },
    {
        "National Peoples Congress": "national peoples congress"
    },
    {
        " should be asked to amend the part of the Basic Law to redress the problem, the ": null
    },
    {
        "Government of Hong Kong": "government of hong kong"
    },
    {
        " decided to seek an interpretation to, rather than an amendment of, the relevant Basic Law provisions from the ": null
    },
    {
        "Standing Committee of the National Peoples Congress": "standing committee of the national peoples congress"
    },
    {
        " . The NPCSC issued an interpretation in favour of the Hong Kong Government in June 1999, thereby overturning parts of the court decision. While the full powers of NPCSC to interpret the Basic Law is provided for in the Basic Law itself, some critics argue this undermines ": null
    },
    {
        "judicial independence": "judicial independence"
    },
    {
        ".          The Hong Kong 1 July March is an annual protest rally led by the ": null
    },
    {
        "Civil Human Rights Front": "civil human rights front"
    },
    {
        " since the 1997 handover on the ": null
    },
    {
        "HKSAR establishment day": "hong kong special administrative region establishment day"
    },
    {
        ". However, it was only in 2003 when it drew large public attention by opposing the bill of the Article 23. It has become the annual platform for demanding universal suffrage, calling for observance and preservation ": null
    },
    {
        "civil liberties": "civil liberties"
    },
    {
        " such as ": null
    },
    {
        "free speech": "freedom of speech"
    },
    {
        ", venting dissatisfaction with the ": null
    },
    {
        "Hong Kong Government": "hong kong government"
    },
    {
        " or the Chief Executive, rallying against actions of the Pro-Beijing camp.     In 2003, the HKSAR Government proposed to implement Article 23 of the Basic Law by enacting ": null
    },
    {
        "national security bill": "national security  bill 2003"
    },
    {
        " against acts such as ": null
    },
    {
        "treason": "treason"
    },
    {
        ", ": null
    },
    {
        "subversion": "subversion"
    },
    {
        ", ": null
    },
    {
        "secession": "secession"
    },
    {
        " and ": null
    },
    {
        "sedition": "sedition"
    },
    {
        ". Executive Council of HKSAR.  . Retrieved on 26 August 2013. However, there were concerns that the legislation would infringe human rights by introducing the mainlands concept of national security into the HKSAR. Together with the general dissatisfaction with the Tung administration, about 500,000 people participated in this protest. Article 23 enactment was temporarily suspended . Wong, Yiu-Chung. One Country, Two Systems in Crisis: Hong Kongs Transformation Since the Handover. Lexington books. .          Towards the end of 2003, the focus of political controversy shifted to the dispute of how subsequent Chief Executives get elected. The ": null
    },
    {
        "Basic Laws Article 45": "hong kong basic law article 45"
    },
    {
        " stipulates that the ultimate goal is ": null
    },
    {
        "universal suffrage": "universal suffrage"
    },
    {
        "; when and how to achieve that goal, however, remains open but controversial. Under the Basic Law, electoral law could be amended to allow for this as soon as ": null
    },
    {
        "2007": "2007 hong kong chief executive election"
    },
    {
        " . Arguments over this issue seemed to be responsible for a series of Mainland Chinese newspapers commentaries in February 2004 which stated that power over Hong Kong was only fit for patriots.     The interpretation of the NPCSC to Annex I and II of the Basic Law, promulgated on 6 April 2004, made it clear that the ": null
    },
    {
        "National Peoples Congress": "national peoples congress"
    },
    {
        " support is required over proposals to amend the electoral system under Basic Law. On 26 April 2004, the Standing Committee of National Peoples Congress denied the possibility of universal suffrage in 2007 and 2008 .     The NPCSC interpretation and decision were regarded as obstacles to the democratic development of Hong Kong by the democratic camp, and were criticised for lack of consultation with Hong Kong residents. On the other hand, the pro-government camp considered them to be in compliance with the legislative intent of the Basic Law and in line with the ": null
    },
    {
        "One country, two systems": "one country, two systems"
    },
    {
        " principle, and hoped that this would put an end to the controversies on development of political structure in Hong Kong.     In 2007 Chief Executive Sir Donald Tsang requested for Beijing to allow direct elections for the Chief Executive. He referred to a survey which said more than half of the citizens of Hong Kong wanted direct elections by 2012. However, he said waiting for 2017 may be the best way to get two-thirds of the support of Legislative Council.  Donald Tsang announced that the NPC said it planned to allow the 2017 Chief Executive elections and the 2020 Legislative Council elections to take place by universal suffrage.      In 2013, public concern was sparked that the election process for the Chief Executive would involve a screening process that swipes out candidates deemed suitable for the position by Beijing, incited by a comment made by a Deputy of the National Peoples Congress at an off-the-recorded gathering.           On 12 March 2005, the Chief Executive, Tung Chee-hwa, resigned. Immediately after Tungs resignation, there was dispute over the length of the term of the Chief Executive. To most local legal professionals, the length is obviously five years, under whatever circumstances. It should also be noted that the wording of the Basic Law on the term of the Chief Executive is substantially different from the articles in the PRC constitution concerning the length of term of the president, premier, etc. Nonetheless, legal experts from the mainland said it is a convention a successor will only serve the remainder of the term if the position is vacant because the predecessor resigned.     The ": null
    },
    {
        "Standing Committee of the National Peoples Congress": "standing committee of the national peoples congress"
    },
    {
        " exercised its right to interpret the Basic Law, and affirmed that the successor would only serve the remainder of the term. Many in Hong Kong saw this as having an adverse impact on one country, two systems, as the ": null
    },
    {
        "Central Peoples Government": "central peoples government"
    },
    {
        " interpret the Basic Law to serve its need, that is, a two-year probation for Tsang, instead of a five-year term.               On 4 December 2005, people in Hong Kong demonstrated against Sir ": null
    },
    {
        "Donald Tsangs": "donald tsang"
    },
    {
        "proposed reform package, before a vote on 21 December. According to the organisers,  Legislative Council of the HKSAR. Retrieved on 26 August 2013 an estimated 250,000 turned out into the streets. The police supplied a figure of 63,000, and Michael de Golyer of Baptist University estimated between 70,000 and 100,000. The Standard. . Turnout is substantial however one cuts it . Retrieved on 13 January 2009.     The march has sent a strong message to hesitant pro-democracy legislators to follow public opinion. The pro-government camp claims to have collected 700,000 signatures on a petition backing Mr. Tsangs reform package. This number, however, is widely seen as too small to influence pro-democracy lawmakers. The Reform Package debate has seen the return of key political figure and former Chief Secretary ": null
    },
    {
        "Anson Chan": "anson chan"
    },
    {
        ", raising speculations of a possible run up for the 2007 Chief Executive election, though she dismissed having a personal interest in standing for the next election.     In an attempt to win last minute votes from moderate pro-democracy lawmakers, the government amended its reform package on 19 December by proposing a gradual cut in the number of ": null
    },
    {
        "district council": "district councils of hong kong"
    },
    {
        " members appointed by the Chief Executive. Their number would be reduced from 102 to 68 by 2008. It would then be decided in 2011 whether to scrap the remaining seats in 2012 or in 2016.   The amendment has been seen as a reluctant response by Sir Donald Tsang to give satisfaction to the democratic demands made by demonstrators on 4 December. The move has been qualified Too little, too late by pan-democrats in general.     On 21 December 2005, the reform political reform package was vetoed by the pro-democracy lawmakers. Chief Secretary ": null
    },
    {
        "Rafael Hui": "rafael hui"
    },
    {
        " openly criticised pro-democracy ": null
    },
    {
        "Martin Lee": "martin lee"
    },
    {
        " and ": null
    },
    {
        "Bishop Zen": "bishop zen"
    },
    {
        " for blocking the proposed changes.          The 24 non-civil service positions under the political appointment system comprise 11 undersecretaries and 13 political assistants. Bonnie Chen,  ,  The Standard , 4 March 2008     The government named eight newly appointed ": null
    },
    {
        "Undersecretaries": "undersecretary"
    },
    {
        " on 20 May, and nine Political Assistants on 22 May 2008. The posts were newly created, ostensibly to work closely with bureau secretaries and top civil servants in implementing the Chief Executives policy blueprint and agenda in an executive-led government. Donald Tsang described the appointments as a milestone in the development of Hong Kongs political appointment system. Diana Lee, , The Standard, 21 May 2008 Controversies arose with the disclosure of foreign passports and salaries. Page A1, ": null
    },
    {
        "South China Morning Post": "south china morning post"
    },
    {
        ", 5 June 2008 Pressure for disclosure continued to mount despite government insistence on the right of the individuals to privacy: on 10 June 2008, newly appointed Undersecretaries and political assistants, who had previously argued were contractually forbidden from disclosing their remuneration, revealed their salaries. The Government news release stated that the appointees had voluntarily disclosed their salaries, given the sustained public interest in the issue.  , Hong Kong Government, 10 June 2008, retrieved 12 June 2008          On 16 July 2008, ": null
    },
    {
        "Donald Tsang": "donald tsang"
    },
    {
        " announced some extraordinary measures for extraordinary times , giving a total of HK$11  billion in inflation relief to help families finances. Of which, the Employee Retraining levy on the employment of ": null
    },
    {
        "Foreign domestic helpers": "foreign domestic helpers in hong kong"
    },
    {
        " would be temporarily waived,  at an estimated cost of $HK2  billion. It was intended that the levy would be waived for a two-year period on all helpers employment contracts signed on or after 1 September 2008, but would not apply to ongoing contracts. The Immigration Department said it would not reimburse levies, which are prepaid half-yearly or yearly in advance. The announcement resulted in chaos and confusion, and uncertainty for the helpers as some employers deferred contracts or had dismissed helpers pending confirmation of the effective date, leaving helpers in limbo.      On 20 July, ": null
    },
    {
        "Secretary for Labour and Welfare": "secretary for labour and welfare"
    },
    {
        " Matthew Cheung": "matthew cheung"
    },
    {
        " announced the waiver commencement date would be brought forward by one month. The Immigration Department would relax its 14-day re-employment requirement for helpers whose contracts expired.  On 30 July, the ": null
    },
    {
        "Executive Council": "executive council of hong kong"
    },
    {
        " approved the measures. After widespread criticism of the situation, the government also conceded that maids having advanced renewal of contract would not be required to leave Hong Kong through the discretion exercised by the ": null
    },
    {
        "Director of Immigration": "director of immigration"
    },
    {
        ", and employers would benefit from the waiver simply by renewing the contract within the two-year period, admitting that some employers could benefit from the waiver for up to 4 years.  The administrations poor handling of the matter came in for heavy criticism. The administrative credibility and competence were called into question by journals from all sides of the political spectrum,  and by helpers and employers alike.          In August 2008, the appointment of ": null
    },
    {
        "Leung Chin-man": "leung chin-man"
    },
    {
        " as deputy managing director and executive director of ": null
    },
    {
        "New World China Land": "new world china land"
    },
    {
        ", subsidiary of ": null
    },
    {
        "New World Development": "new world development"
    },
    {
        " , was greeted with uproar amidst widespread public suspicion that job offer was a  quid pro quo  for the favours he allegedly granted to NWD. Leung was seen to have been involved with the sale of the ": null
    },
    {
        "Hung Hom Peninsula": "harbour placehunghom peninsula"
    },
    {
        " Home Ownership Scheme": "home ownership scheme"
    },
    {
        " public housing estate": "public housing in hong kong"
    },
    {
        " to NWD at under-value in 2004.      After a 12-month sterilisation period after retirement, Leung submitted an application to the government on 9 May for approval to take up employment with New World China Land.  The ": null
    },
    {
        "Secretary for the Civil Service": "secretary for the civil service"
    },
    {
        ", ": null
    },
    {
        "Denise Yue Chung-yee": "denise yue"
    },
    {
        ", signed off on the approval for him to take up the job after his request passed through the vetting committee.      Controversies surrounded not only the suspicions of Leungs own conflict of interest, but also of the insensitivity of the committee which recommended the approval for him to take up his lucrative new job less than two years after his official retirement. New World argued that they hired Leung in good faith after government clearance.     On 15 August, the ": null
    },
    {
        "Civil Service Bureau": "civil service bureau"
    },
    {
        " issued the report requested by Donald Tsang, where they admitted that they had neglected to consider Leungs role in the Hung Hom Peninsula affair.  Donald Tsang asked the SCS  to reassess the approval, and submit a report to him.  New World Development announced in the early hours of 16 August that Leung had resigned from his post, without any compensation from either side or from the government, for the termination.      The next day, Donald Tsang confirmed that Denise Yue would not have to resign. He was satisfied with her apology and with the explanations offered by her. Tsang ordered a committee, of which Yue was to be a member, to be set up to perform a sweeping review of the system to process applications for former civil servants.           In January 2010, five pan-democrats resigned from the ": null
    },
    {
        "Legislative Council of Hong Kong": "legislative council of hong kong"
    },
    {
        " to trigger a by-election in response to the lack of progress in the move towards universal suffrage.     They wanted to use the by-election as a de facto referendum for universal suffrage and the abolition of the ": null
    },
    {
        "functional constituencies": "functional constituency"
    },
    {
        ".       The ": null
    },
    {
        "Umbrella Revolution": "umbrella revolution"
    },
    {
        " erupted spontaneously in September 2014 in protest of a decision by Chinas ": null
    },
    {
        "Standing Committee of the National Peoples Congress": "standing committee of the national peoples congress"
    },
    {
        " on ": null
    },
    {
        "proposed electoral reform": "2014 hong kong electoral reform"
    },
    {
        ".      The austere package provoked mobilisation by students, and the effects became amplified into ": null
    },
    {
        "a political movement": "umbrella movement"
    },
    {
        " involving hundreds of thousands of Hong Kong citizens by heavy-handed policing and government tactics.           In February 2019, the Legislative Council proposed a bill to amend extradition rights between Hong Kong and other countries. This bill was proposed because of an incident in which a Hong Kong citizen killed his pregnant girlfriend on vacation in Taiwan. However, there is no agreement to extradite to Taiwan, so he was unable to be charged in Taiwan. The bill proposes a mechanism for transfers of fugitives not only for Taiwan, but also for Mainland China and Macau, which are not covered in the existing laws.     There have been ": null
    },
    {
        "multiple protests": "2019 hong kong anti-extradition bill protests"
    },
    {
        " against the bill, most notably on 9 June and 16 June, which were estimated to number one million and two million protesters, respectively.     On 15 June 2019, Chief Executive Carrie Lam decided to indefinitely suspend the bill in light of the protest, but also made it clear in her remarks that the bill was not withdrawn.     On 4 September 2019, Chief Executive Carrie Lam announced that the government would formally withdraw the Fugitive Offenders Bill, as well as enacting a number of other reforms.      The protests continue until today, mostly happening on weekends. It is not certain when the violence will die down, but it has been quieter since the ": null
    },
    {
        "2019 District Council Elections": "2019 hong kong local elections"
    },
    {
        ".                            All people of Chinese descent, who were born in Hong Kong on or before 30 June 1997, had access to only British nationality. They are therefore British nationals by birth, with the designation of “second class citizen” with no rights of abode in the U.K. The Chinese nationality of such British nationals was enforced involuntarily after 1 July 1997.     Before and after the ": null
    },
    {
        "handover": "transfer of the sovereignty of hong kong"
    },
    {
        ", the Peoples Republic of China has recognised ethnic Chinese people in Hong Kong as its ": null
    },
    {
        "citizens": "chinese nationality law"
    },
    {
        ". The PRC issues ": null
    },
    {
        "Home Return Permits": "home return permit"
    },
    {
        "for them to enter ": null
    },
    {
        "mainland China": "mainland china"
    },
    {
        ". Hong Kong issues the ": null
    },
    {
        "HKSAR passport": "hong kong special administrative region passport"
    },
    {
        " through its Immigration Department GovHK. . HK SAR passport. Retrieved on 28 December 2007. to all PRC citizens who are permanent residents of Hong Kong fitting the ": null
    },
    {
        "right of abode": "right of abode"
    },
    {
        " rule.     The HKSAR passport is not the same as the ordinary ": null
    },
    {
        "PRC passport": "peoples republic of china passport"
    },
    {
        ", which is issued to residents of ": null
    },
    {
        "mainland China": "mainland china"
    },
    {
        ". Only permanent residents of Hong Kong who are PRC nationals are eligible to apply. To acquire the status of permanent resident one has to have ordinarily resided in Hong Kong for a period of seven years and adopted Hong Kong as their permanent home. Therefore, citizenships rights enjoyed by residents of mainland China and residents Hong Kong are differentiated even though both hold the same citizenship.     New immigrants from mainland China to Hong Kong are denied from getting PRC passport from the mainland authorities, and are not eligible to apply for an HKSAR passport. They usually hold the ": null
    },
    {
        "Document of Identity": "hong kong document of identity"
    },
    {
        " as the travel document, until the permanent resident status is obtained after seven years of residence.     ": null
    },
    {
        "Naturalisation": "naturalisation"
    },
    {
        " as a PRC Citizen is common among ethnic Chinese people in Hong Kong who are not PRC Citizens. Some who have surrendered their PRC citizenship, usually those who have emigrated to foreign countries and have retained the permanent resident status, can apply for PRC citizenship at the Immigration Department, though they must renounce their original nationality in order to acquire the PRC citizenship.     Naturalisation of persons of non-Chinese ethnicity is rare because China does not allow dual citizenship and becoming a Chinese citizen requires the renouncement of other passports. A notable example is ": null
    },
    {
        "Michael Rowse": "michael rowse"
    },
    {
        ", a permanent resident of Hong Kong and the current Director-General of Investment Promotion of Hong Kong Government, naturalised and became a PRC citizen, for the offices of secretaries of the ": null
    },
    {
        "policy bureaux": "government of hong kong"
    },
    {
        " are only open to PRC citizens.     In 2008, a row erupted over ": null
    },
    {
        "political appointees": "political appointments system"
    },
    {
        ". Five newly appointed ": null
    },
    {
        "Undersecretaries": "undersecretary"
    },
    {
        " declared that they were in the process of renouncing foreign citizenship as at 4 June 2008, citing ": null
    },
    {
        "public opinion": "public opinion"
    },
    {
        " as an overriding factor, and one Assistant had initiated the renunciation process. This was done despite there being no legal or constitutional barrier for officials at this level of government to have foreign nationality.           Hong Kong residents who were born in Hong Kong in the British-administered era could acquire the British Dependent Territories citizenship. Hong Kong residents who were not born in Hong Kong could also naturalise as a ": null
    },
    {
        "British Dependent Territories Citizen": "british overseas territories citizen"
    },
    {
        " before the handover. To allow them to retain the status of British national while preventing a possible flood of immigrants from Hong Kong, the United Kingdom created a new nationality status, ": null
    },
    {
        "British National ": "british national"
    },
    {
        " that Hong Kong British Dependent Territories citizens could apply for. Holders of the ": null
    },
    {
        "British National passport": "british national  passport"
    },
    {
        " - BN - have no right of abode in the United Kingdom. See ": null
    },
    {
        "British nationality law and Hong Kong": "british nationality law and hong kong"
    },
    {
        " for details.     British National status was given effect by the Hong Kong Order 1986. Article 4 of the Order provided that on and after 1 July 1987, there would be a new form of British nationality, the holders of which would be known as British Nationals . Article 4 of the Order provided that adults and minors who had a connection to Hong Kong were entitled to make an application to become British Nationals by registration.     Becoming a British National was therefore not an automatic or involuntary process and indeed many eligible people who had the requisite connection with Hong Kong never applied to become British Nationals . Acquisition of the new status had to be voluntary and therefore a conscious act. To make it involuntary or automatic would have been contrary to the assurances given to the Chinese government which led to the words eligible to being used in paragraph of the United Kingdom Memorandum to the ": null
    },
    {
        "Sino-British Joint Declaration": "sino-british joint declaration"
    },
    {
        ". The deadline for applications passed in 1997. Any person who failed to register as a British Nationals by 1 July 1997 and were eligible to become PRC citizens became solely PRC citizens on 1 July 1997. However, any person who would be rendered stateless by failure to register as a British Nationals automatically became a British Overseas citizen under article 6 of the Hong Kong Order 1986.     After the ": null
    },
    {
        "Tiananmen Square protests of 1989": "tiananmen square protests of 1989"
    },
    {
        ", people urged the British Government to grant full British citizenship to all Hong Kong BDTCs – but this request was never accepted. However, it was considered necessary to devise a ": null
    },
    {
        "British Nationality Selection Scheme": "british nationality selection scheme"
    },
    {
        " to enable some of the population to obtain British citizenship. The United Kingdom made provision to grant citizenship to 50,000 families whose presence was important to the future of Hong Kong under the ": null
    },
    {
        "British Nationality Act 1990": "british nationality  act 1990"
    },
    {
        ".  legislation.gov.uk, retrieved 8 March 2013     After reunification, all PRC citizens with the right of abode in Hong Kong are eligible to apply for the HKSAR passport issued by the Hong Kong Immigration Department. As the visa-free-visit destinations of the HKSAR passport are very similar with that of a BN passport and the application fee for the former is much lower , the HKSAR passport is becoming more popular among residents of Hong Kong.     Hong Kong residents who were not born in Hong Kong could only apply for the ": null
    },
    {
        "Certificate of identity": "certificate of identity"
    },
    {
        " from the colonial government as travel document. They are not issued after handover. Former CI holders holding PRC Citizenship and are permanent residents of Hong Kong are now eligible for the HKSAR passports, making the HKSAR passports more popular.     Recent changes to Indias Citizenship Act, 1955  will also allow some children of Indian origin, born in Hong Kong after 7 January 2004, who have a solely BN parent to automatically acquire British Overseas citizenship at birth under the provisions for reducing statelessness in article 6 or 6 of the Hong Kong Order 1986. If they have acquired no other nationality after birth, they will be entitled to subsequently register for full British citizenship with right of abode in the UK.                The four main political parties are as follows. Each holds a significant portion of LegCo. Thirteen members are registered as affiliated with the DAB, eight with the Democratic Party, five with the Civic Party, three with the Liberal Party and three with the League of Social Democrats.     There are also many unofficial party members: politicians who are members of political parties but have not registered such status in their election applications. There are two major blocs: the pro-democracy camp and the pro-Beijing camp .       ": null
    },
    {
        "Democratic Alliance for the Betterment and Progress of Hong Kong": "democratic alliance for the betterment and progress of hong kong"
    },
    {
        "    Hong Kong Federation of Trade Unions": "hong kong federation of trade unions"
    },
    {
        "    Business and Professionals Alliance for Hong Kong": "business and professionals alliance for hong kong"
    },
    {
        "    Liberal Party": "liberal party"
    },
    {
        "    New Peoples Party": "new peoples party"
    },
    {
        "        Democratic Party": "democratic party"
    },
    {
        "    Civic Party": "civic party"
    },
    {
        "    Labour Party": "labour party"
    },
    {
        "    League of Social Democrats": "league of social democrats"
    },
    {
        "    People Power": "people power"
    },
    {
        "   Neo Democrats": "neo democrats"
    },
    {
        "    Hong Kong First": "hong kong first"
    },
    {
        "    Association for Democracy and Peoples Livelihood": "association for democracy and peoples livelihood"
    },
    {
        "    Professional Commons": "professional commons"
    },
    {
        "           Hong Kong Confederation of Trade Unions": "hong kong confederation of trade unions"
    },
    {
        "     Hong Kong Federation of Students": "hong kong federation of students"
    },
    {
        "   Scholarism": "scholarism"
    },
    {
        "   Civic Passion": "civic passion"
    },
    {
        "    Proletariat Political Institute": "proletariat political institute"
    },
    {
        "   Hong Kong Resurgence Order": "hong kong resurgence order"
    },
    {
        "   Hong Kong Indigenous": "hong kong indigenous"
    },
    {
        "   Hong Kong National Party": "hong kong national party"
    },
    {
        "   Hong Kong National Front   ": null
    },
    {
        "Hong Kong Localism Power": "hong kong localism power"
    },
    {
        "   Hong Kong Civic Association": "hong kong civic association"
    },
    {
        " International Action": "international action"
    },
    {
        " Hong Kong Federation of Trade Unions": "hong kong federation of trade unions"
    },
    {
        "    The Hong Kong Alliance in Support of Patriotic Democratic Movements in China": "the hong kong alliance in support of patriotic democratic movements in china"
    },
    {
        "  Hong Kong Professional Teachers Union": "hong kong professional teachers union"
    }
]