[
    {
        "Politics of Eritrea takes place in a framework of a ": null
    },
    {
        "single-party": "single-party"
    },
    {
        " presidential": "presidential system"
    },
    {
        " republic": "republic"
    },
    {
        "an ": null
    },
    {
        "totalitarian": "totalitarian"
    },
    {
        " dictatorship": "dictatorship"
    },
    {
        ". The ": null
    },
    {
        "President": "president of eritrea"
    },
    {
        " officially serves as both ": null
    },
    {
        "head of state": "head of state"
    },
    {
        " and ": null
    },
    {
        "head of government": "head of government"
    },
    {
        ". The ": null
    },
    {
        "Peoples Front for Democracy and Justice": "peoples front for democracy and justice"
    },
    {
        " is the only political party legally permitted to exist in Eritrea. The popularly elected ": null
    },
    {
        "National Assembly": "national assembly of eritrea"
    },
    {
        " of 150 seats, formed in 1993 shortly after independence, elected the current president, ": null
    },
    {
        "Isaias Afewerki": "isaias afewerki"
    },
    {
        ". There have been no ": null
    },
    {
        "general elections": "elections in eritrea"
    },
    {
        " since its official independence in 1993. They are governed under the constitution of 1993. A ": null
    },
    {
        "new constitution": "constitution of eritrea"
    },
    {
        " was ratified in 1997, but has not been implemented. Since the National Assembly last met in 2002, President ": null
    },
    {
        "Isaias Afwerki": "isaias afwerki"
    },
    {
        " has exercised the powers of both the ": null
    },
    {
        "executive": "executive branch"
    },
    {
        " and ": null
    },
    {
        "legislative branch": "legislative branch"
    },
    {
        "es of government.     Following a ": null
    },
    {
        "successful referendum": "united nations observer mission to verify the referendum in eritrea"
    },
    {
        " on independence for the Autonomous Region of Eritrea between 23 and 25 April 1993, on 19 May of that year the Provisional Government of Eritrea issued a Proclamation regarding the reorganization of the Government. It declared that during a four-year transition period, and sooner if possible, it would draft and ratify a constitution, prepare a law on political parties, prepare a press law, and carry out elections for a constitutional government. In March 1994, the PGE created a constitutional commission charged with drafting a constitution flexible enough to meet the current needs of a population suffering from 30 years of civil war as well as those of the future, when stability and prosperity change the political landscape.     Commission members have traveled throughout the country and to Eritrean communities abroad holding meetings to explain constitutional options to the people and to solicit their input. A new constitution was promulgated in 1997 but has not yet been implemented, and general elections have been postponed. A National Assembly, composed entirely of the PFDJ and its allies, was established as a transitional legislature; elections have been postponed indefinitely since a ": null
    },
    {
        "border war with Ethiopia": "eritrean-ethiopian war"
    },
    {
        ".     Independent local sources of political information on Eritrean domestic politics are scarce; in September 2001 the government closed down all of the nations privately owned print ": null
    },
    {
        "media": "news media"
    },
    {
        ", and outspoken critics of the government have been ": null
    },
    {
        "arrest": "arrest"
    },
    {
        "ed and held without ": null
    },
    {
        "trial": "trial"
    },
    {
        ", according to domestic and international observers, including ": null
    },
    {
        "Human Rights Watch": "human rights watch"
    },
    {
        " and ": null
    },
    {
        "Amnesty International": "amnesty international"
    },
    {
        ". In 2004 the ": null
    },
    {
        "U.S. State Department": "united states department of state"
    },
    {
        " declared Eritrea a ": null
    },
    {
        "Country of Particular Concern": "country of particular concern"
    },
    {
        " for its alleged record of ": null
    },
    {
        "religious persecution": "religious persecution"
    },
    {
        ".     At independence, the government faced formidable challenges. Beginning with a nascent judicial system, and an education system in shambles, it has attempted to build the institutions of government from scratch, with varying success. Since then, the impact of the border war with Ethiopia, and continued army mobilisation, has contributed to the lack of a skilled workforce. The present government includes ": null
    },
    {
        "legislative": "legislature"
    },
    {
        ", ": null
    },
    {
        "executive": "executive"
    },
    {
        ", and ": null
    },
    {
        "judicial bodies": "judiciary"
    },
    {
        ".        ": null
    },
    {
        "President": "heads of state of eritrea"
    },
    {
        " Isaias Afewerki": "isaias afewerki"
    },
    {
        " PFDJ": "peoples front for democracy and justice"
    },
    {
        "    PFDJPFDJ EIJELF ": null
    },
    {
        "litici": "litici"
    },
    {
        "died 26 March 2014ELF-UO  EPDF ": null
    },
    {
        "M": "m"
    },
    {
        " DMLEK KernelewosPERArightsrightsfreedomsfrom the Civil CourtELFor zobas ": null
    },
    {
        "UNMEE": "unmee"
    }
]