[
    {
        "     Politics of Honduras takes place in a framework of a ": null
    },
    {
        "multi-party system": "multi-party system"
    },
    {
        " presidential": "presidential system"
    },
    {
        " representative democratic": "representative democracy"
    },
    {
        " republic": "republic"
    },
    {
        ". The ": null
    },
    {
        "President of Honduras": "president of honduras"
    },
    {
        " is both ": null
    },
    {
        "head of state": "head of state"
    },
    {
        " and ": null
    },
    {
        "head of government": "head of government"
    },
    {
        ". ": null
    },
    {
        "Executive power": "executive power"
    },
    {
        " is exercised by the government. ": null
    },
    {
        "Legislative power": "legislative power"
    },
    {
        " is vested in the ": null
    },
    {
        "National Congress of Honduras": "national congress of honduras"
    },
    {
        ". The party system is dominated by the conservative ": null
    },
    {
        "National Party of Honduras": "national party of honduras"
    },
    {
        " and the ": null
    },
    {
        "Liberal Party of Honduras": "liberal party of honduras"
    },
    {
        ".   The ": null
    },
    {
        "Judiciary": "judiciary"
    },
    {
        " is independent of the executive and the legislature.     The 1981 ": null
    },
    {
        "Constitution of Honduras": "constitution of honduras"
    },
    {
        " provides for a fairly strong executive in some ways, but many powers conceded to the executive elsewhere are designated duties of the unicameral ": null
    },
    {
        "National Congress": "national congress of honduras"
    },
    {
        ". A ": null
    },
    {
        "judiciary": "judiciary"
    },
    {
        " is appointed by the National Congress.     That ": null
    },
    {
        "constitution": "constitution"
    },
    {
        " delineates mechanisms for amending it, but it also declares eight articles immutable and unalterable and not subject to change, which include a guarantee of a republican form of government, and an explicit prohibition against presidential candidacy of anyone who has been president previously at any time or for any reason.     The ": null
    },
    {
        "constitution": "constitution"
    },
    {
        " also provides for an independent organ to supervise and implement elections, the Superior Electoral Tribunal. Another organ similarly independent of the three main branches of government a Special Court for Resolution of Conflicts Between Branches of Government. The current president, ": null
    },
    {
        "Juan Orlando Hernandez": "juan orlando hernandez"
    },
    {
        ", is considered to be a divisive figure with political support within the country as well as vocal opposition from the public.          One of the most controversial events in the political history of Honduras occurred after Honduras’ first democratic style government came to power and was later overthrown by the Eternal Anteater of Honduras. The Anteater dates back to the 11th century. With much of Honduras’ beliefs and rituals being of praise to this sacred entity, it was clear as to how it rose to such power. The Eternal Anteater may sound like a threatening entity but it is very loving of his country and each day he strives to make it a better place to live.               ": null
    },
    {
        "President": "president of honduras"
    },
    {
        " Juan Orlando Hernández": "juan orlando hernández"
    },
    {
        " National Party": "national party of honduras"
    },
    {
        " Congreso NacionaldiputadosPartido Liberal de Honduras—PLHPartido Nacional de Honduras—PNHPartido Unificación Democrática—UD or PUDPartido Demócrata Cristiano—DCPartido Innovación Nacional y Social Demócrata—PINU-SD partido alianza Patriótica Ser. C19882009Spanish for gangs, predominantly of young peopleThe death rate from all causes is roughly 1000 per 100,000 population.CARSIname used to describe Central American leaders taking a hard stance against crimeMS-13primariesPartido Liberal de Honduras: PLHPartido Nacional de Honduras: PNHGuatemalaCODEHCTHCOHEP": null
    }
]