[
    {
        "        Politics of Mauritius  takes place in a framework of a ": null
    },
    {
        "parliamentary": "Parliamentary System"
    },
    {
        " democracy": "Representative Democracy"
    },
    {
        ". The separation of powers is among the three branches of the ": null
    },
    {
        "Government of Mauritius": "Government Of Mauritius"
    },
    {
        ", namely the ": null
    },
    {
        "legislative": "Legislative Power"
    },
    {
        ", the ": null
    },
    {
        "executive": "Executive Power"
    },
    {
        " and the ": null
    },
    {
        "Judiciary": "Judiciary Of Mauritius"
    },
    {
        ", is embedded in the ": null
    },
    {
        "Constitution of Mauritius": "Constitution Of Mauritius"
    },
    {
        ".     Being a ": null
    },
    {
        "Westminster system": "Westminster System"
    },
    {
        " of government, Mauritiuss ": null
    },
    {
        "unicameral": "Unicameral"
    },
    {
        " house of parliament officially, the ": null
    },
    {
        "National Assembly": "National Assembly Of Mauritius"
    },
    {
        ", is supreme. It elects the President and the Prime Minister. While the President is voted by a single majority of votes in the house, the Prime Minister is the MP who supports a majority in the house.     The ": null
    },
    {
        "President": "President Of Mauritius"
    },
    {
        " is the ": null
    },
    {
        "Head of State": "Head Of State"
    },
    {
        " while the ": null
    },
    {
        "Prime Minister": "Prime Minister Of Mauritius"
    },
    {
        " has full ": null
    },
    {
        "executive power": "Executive Power"
    },
    {
        " and is the ": null
    },
    {
        "Head of Government": "Head Of Government"
    },
    {
        " who is assisted by a ": null
    },
    {
        "council of Ministers": "Cabinet Of Ministers Of Mauritius"
    },
    {
        ". Mauritius has a ": null
    },
    {
        "multi-party system": "Multi-Party System"
    },
    {
        ".      Historically, Mauritiuss government has been led by the ": null
    },
    {
        "Labour Party": "Labour Party"
    },
    {
        " or the ": null
    },
    {
        "MSM": "Militant Socialist Movement"
    },
    {
        " for the exception of short periods from 1982–1983 and 2003–2005 where the ": null
    },
    {
        "MMM": "Mauritian Militant Movement"
    },
    {
        " was at the head of the country. LAlliance Lepep, a coalition of several political parties including MSM, Muvmen Liberater and PMSD, won the 2014 elections.  Two years into the political term, the PMSD announced their resignation from the coalition government on 19 December 2016, and joined the ranks of the opposition.   On January 23, 2017, the then Prime Minister, 86 year old Sir Aneerood Jugnauth,  a key political figure in Mauritian politics who has previously served several political terms spanning over many decades, announced that he was stepping down as Prime Minister.  Following the Westminster tradition, the leader of the governing party in the coalition government, Pravind Jugnauth who is Sir Aneerood Jugnauths son and then Minister of Finance, was sworn in as Prime Minister. Although Sir Aneerood Jugnauth resigned as Prime Minister, he is still serving as Minister Mentor, Minister of Defence, Minister for Rodrigues.            The president and vice president are elected by the National Assembly for five-year terms. They form part along with the Speaker of the National Assembly, the legislative offices which under the constitution have the final decision and last word on any legislative matter including the laws of Mauritius. Most of the work is executed by the Executive Branch which consists of the ": null
    },
    {
        "Cabinet of Ministers": "Cabinet Of Ministers Of Mauritius"
    },
    {
        ", ": null
    },
    {
        "Leader of the Opposition": "Leader Of The Opposition"
    },
    {
        " and also other members of the parliament.       Another important structure of the government of Mauritius is the executive branch . The Prime Minister is appointed by the president and is responsible to the National Assembly. The ": null
    },
    {
        "Council of Ministers": "Cabinet Of Ministers Of Mauritius"
    },
    {
        " is appointed by the president on the recommendation of the prime minister. The Council of Ministers , responsible for the direction and control of the government, consists of the prime minister , the leader of the majority party in the legislature, and about 24 ministers including one Deputy Prime Minister and/or one Vice Prime Minister.     The Executive branch being with the Cabinet have 4 most powerful executive offices, Prime Minister, Deputy Prime Minister and 2 offices of Vice Prime Minister. They have the executive power and authority over the cabinet and also help the Prime Minister in his tasks and responsibilities.      ": null
    },
    {
        "President": "President Of Mauritius"
    },
    {
        " Ameenah Gurib": "Ameenah Gurib"
    },
    {
        " Independent": "Independent Politician"
    },
    {
        " Prime Minister": "Prime Minister Of Mauritius"
    },
    {
        " Pravind Jugnauth": "Pravind Jugnauth"
    },
    {
        " Militant Socialist Movement": "Militant Socialist Movement"
    },
    {
        " ": null
    }
]