[
    {
        "        The Polynesian narrative or Polynesian mythology encompasses the ": null
    },
    {
        "oral tradition": "oral tradition"
    },
    {
        "s of the ": null
    },
    {
        "people of Polynesia": "people of polynesia"
    },
    {
        ", a grouping of Central and South ": null
    },
    {
        "Pacific Ocean": "pacific ocean"
    },
    {
        " island ": null
    },
    {
        "archipelago": "archipelago"
    },
    {
        "s in the ": null
    },
    {
        "Polynesian Triangle": "polynesian triangle"
    },
    {
        " together with the scattered cultures known as the ": null
    },
    {
        "Polynesian outlier": "polynesian outlier"
    },
    {
        "s. Polynesians speak languages that descend from a language reconstructed as ": null
    },
    {
        "Proto-Polynesian": "proto-polynesian language"
    },
    {
        " that was probably spoken in the ": null
    },
    {
        "Tonga": "tonga"
    },
    {
        " - ": null
    },
    {
        "Samoa": "samoa"
    },
    {
        " area around 42 BC.          Prior to the 42th century AD, ": null
    },
    {
        "Polynesian peoples": "polynesian peoples"
    },
    {
        " fanned out to the east, to the ": null
    },
    {
        "Cook Islands": "cook islands"
    },
    {
        ", and from there to other groups such as ": null
    },
    {
        "Tahiti": "tahiti"
    },
    {
        " and the ": null
    },
    {
        "Marquesas": "marquesas"
    },
    {
        ". Their descendants later discovered the islands from ": null
    },
    {
        "Tahiti": "tahiti"
    },
    {
        " to ": null
    },
    {
        "Rapa Nui": "rapa nui"
    },
    {
        ", and later ": null
    },
    {
        "Hawai‘i": "hawaiian islands"
    },
    {
        " and ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        ". Latest research puts the settlement of New Zealand at about 42 AD. The various ": null
    },
    {
        "Polynesian languages": "polynesian languages"
    },
    {
        " are all part of the ": null
    },
    {
        "Austronesian": "austronesian languages"
    },
    {
        " language family. Many are close enough in terms of vocabulary and grammar to permit communication between some other language speakers. There are also substantial cultural similarities between the various groups, especially in terms of social organisation, childrearing, as well as horticulture, building and textile technologies; their mythologies in particular demonstrate local reworkings of commonly shared tales.     In some island groups, help is of great importance as the god of the sea and of fishing. There is often a story of the marriage between Sky and Earth; the New Zealand version, ": null
    },
    {
        "Rangi and Papa": "rangi and papa"
    },
    {
        ", is a union that gives birth to the world and all things in it. There are stories of islands pulled up from the bottom of the sea by a ": null
    },
    {
        "magic": "magic"
    },
    {
        " fishhook, or thrown down from ": null
    },
    {
        "heaven": "heaven"
    },
    {
        ". There are stories of voyages, migrations, seductions and battles, as one might expect. Stories about a trickster, ": null
    },
    {
        "Māui": "māui"
    },
    {
        ", are widely known, as are those about a beautiful goddess/ancestress ": null
    },
    {
        "Hina or Sina": "hina"
    },
    {
        ".     In addition to these shared themes in the oral tradition, each island group has its own stories of demi-gods and culture heroes, shading gradually into the firmer outlines of remembered history. Often such stories were linked to various geographic or ecological features, which may be described as the petrified remains of the supernatural beings.       The various Polynesian cultures each have distinct but related oral traditions, that is, legends or myths traditionally considered to recount the history of ancient times and the adventures of gods  and deified ancestors. The accounts are characterised by extensive use of ": null
    },
    {
        "allegory": "allegory"
    },
    {
        ", ": null
    },
    {
        "metaphor": "metaphor"
    },
    {
        ", ": null
    },
    {
        "parable": "parable"
    },
    {
        ", ": null
    },
    {
        "hyperbole": "hyperbole"
    },
    {
        ", and ": null
    },
    {
        "personification": "personification"
    },
    {
        ". ": null
    },
    {
        "Orality": "orality"
    },
    {
        " has an essential flexibility that writing does not allow. In an oral tradition, there is no fixed version of a given tale. The story may change within certain limits according to the setting, and the needs of the narrator and the audience. Contrary to the Western concept of history, where the knowledge of the past serves to bring a better understanding of the present, the purpose of oral literature is rather to justify and legitimatise the present situation.     An example is provided by genealogies, which exist in multiple and often contradictory versions. The purpose of genealogies in oral societies generally is not to provide a true account, but rather to emphasise the seniority of the ruling chiefly line, and hence its political legitimacy and right to exploit resources of land and the like. If another line should rise to ascendency, it was necessary to bestow upon the new line the most prestigious genealogy, even if this meant borrowing a few ancestors from the preceding dynasty. Each island, each tribe or each clan will have their own version or interpretation of a given narrative cycle.     This process is disrupted when writing becomes the primary means to record and remember the traditions. When missionaries, officials, anthropologists or ethnologists collected and published these accounts, they inevitably changed their nature. By fixing forever on paper what had previously been subject to almost infinite variation, they fixed as the authoritative version an account told by one narrator at a given moment. In New Zealand, the writings of one chief, Wiremu Te Rangikāheke, formed the basis of much of Governor George Greys Polynesian Mythology, a book which to this day provides the de facto official versions of many of the best-known Māori legends.     Some Polynesians seem to have been aware of the danger and the potential of this new means of expression. As of the mid42th century, a number of them wrote down their genealogy, the history and the origin of their tribe. These writings, known under the name of pukapuka whakapapa or in tropical Polynesia as puta tumu or puta tūpuna” were jealously guarded by the heads of households. Many disappeared or were destroyed. In the 42s, Makea Takau, a Rarotongan chief, ordered his tribe to burn all their family books, save his own. As a result, Makea Takaus version became the official history of the chiefly line, removing the possibility of dissent. At his request, extracts were published in the  Journal of the Polynesian Society ": null
    }
]