[
    {
        "   In elementary ": null
    },
    {
        "geometry": "geometry"
    },
    {
        ", a polytope is a geometric object with flat sides. It is a generalization in any number of dimensions of the three-dimensional ": null
    },
    {
        "polyhedron": "polyhedron"
    },
    {
        ". Polytopes may exist in any general number of dimensions n as an n-dimensional polytope or n-polytope. Flat sides mean that the sides of a -polytope consist of k-polytopes that may have -polytopes in common. For example, a two-dimensional ": null
    },
    {
        "polygon": "polygon"
    },
    {
        " is a 2-polytope and a three-dimensional polyhedron is a 3-polytope.     Some theories further generalize the idea to include such objects as unbounded ": null
    },
    {
        "apeirotopes": "apeirotope"
    },
    {
        "and ": null
    },
    {
        "tessellation": "tessellation"
    },
    {
        "s, decompositions or tilings of curved ": null
    },
    {
        "manifolds": "manifold"
    },
    {
        "including ": null
    },
    {
        "spherical polyhedra": "spherical polyhedra"
    },
    {
        ", and set-theoretic ": null
    },
    {
        "abstract polytope": "abstract polytope"
    },
    {
        "s.     Polytopes in more than three dimensions were first discovered by ": null
    },
    {
        "Ludwig Schläfli": "ludwig schläfli"
    },
    {
        ". The ": null
    },
    {
        "German": "german language"
    },
    {
        " term polytop was coined by the mathematician ": null
    },
    {
        "Reinhold Hoppe": "reinhold hoppe"
    },
    {
        ", and was introduced to English mathematicians as polytope by ": null
    },
    {
        "Alicia Boole Stott": "alicia boole stott"
    },
    {
        ".       The term polytope is nowadays a broad term that covers a wide class of objects, and different definitions are attested in mathematical literature. Many of these definitions are not equivalent, resulting in different sets of objects being called polytopes. They represent different approaches to generalizing the ": null
    },
    {
        "convex polytopes": "convex polytope"
    },
    {
        "to include other objects with similar properties.     The original approach broadly followed by ": null
    },
    {
        "Ludwig Schläfli": "ludwig schläfli"
    },
    {
        ", ": null
    },
    {
        "Thorold Gosset": "thorold gosset"
    },
    {
        " and others begins with the extension by analogy into four or more dimensions, of the idea of a polygon and polyhedron respectively in two and three dimensions. Coxeter     Attempts to generalise the ": null
    },
    {
        "Euler characteristic": "euler characteristic"
    },
    {
        " of polyhedra to higher-dimensional polytopes led to the development of ": null
    },
    {
        "topology": "topology"
    },
    {
        " and the treatment of a decomposition or ": null
    },
    {
        "CW-complex": "cw-complex"
    },
    {
        " as analogous to a polytope. Richeson, S.; Eulers Gem: The Polyhedron Formula and the Birth of Topology, Princeton University, 2008. In this approach, a polytope may be regarded as a ": null
    },
    {
        "tessellation": "tessellation"
    },
    {
        " or decomposition of some given ": null
    },
    {
        "manifold": "manifold"
    },
    {
        ". An example of this approach defines a polytope as a set of points that admits a ": null
    },
    {
        "simplicial decomposition": "simplicial complex"
    },
    {
        ". In this definition, a polytope is the union of finitely many ": null
    },
    {
        "simplices": "simplices"
    },
    {
        ", with the additional property that, for any two simplices that have a nonempty intersection, their intersection is a vertex, edge, or higher dimensional face of the two. Grünbaum However this definition does not allow ": null
    },
    {
        "star polytopes": "star polytope"
    },
    {
        "with interior structures, and so is restricted to certain areas of mathematics.     The discovery of ": null
    },
    {
        "star polyhedra": "star polyhedron"
    },
    {
        " and other unusual constructions led to the idea of a polyhedron as a bounding surface, ignoring its interior. Cromwell, P.; Polyhedra, CUP pp 205 ff. In this light convex polytopes in p-space are equivalent to ": null
    },
    {
        "tilings of the -sphere": "spherical tiling"
    },
    {
        ", while others may be tilings of other ": null
    },
    {
        "elliptic": "elliptic space"
    },
    {
        ", flat or ": null
    },
    {
        "toroid": "toroid"
    },
    {
        "al -surfaces – see ": null
    },
    {
        "elliptic tiling": "elliptic tiling"
    },
    {
        " and ": null
    },
    {
        "toroidal polyhedron": "toroidal polyhedron"
    },
    {
        ". A ": null
    },
    {
        "polyhedron": "polyhedron"
    },
    {
        " is understood as a surface whose ": null
    },
    {
        "faces": "face"
    },
    {
        " are ": null
    },
    {
        "polygons": "polygons"
    },
    {
        ", a ": null
    },
    {
        "4-polytope": "4-polytope"
    },
    {
        " as a hypersurface whose facets  are polyhedra, and so forth.     The idea of constructing a higher polytope from those of lower dimension is also sometimes extended downwards in dimension, with an  seen as a ": null
    },
    {
        "1-polytope": "1-polytope"
    },
    {
        " bounded by a point pair, and a point or ": null
    },
    {
        "vertex": "vertex"
    },
    {
        " as a 0-polytope. This approach is used for example in the theory of ": null
    },
    {
        "abstract polytope": "abstract polytope"
    },
    {
        "s.     In certain fields of mathematics, the terms polytope and polyhedron are used in a different sense: a polyhedron is the generic object in any dimension  and polytope means a ": null
    },
    {
        "bounded": "bounded set"
    },
    {
        " polyhedron. Nemhauser and Wolsey, Integer and Combinatorial Optimization, 1999, , Definition 2.2. This terminology is typically confined to polytopes and polyhedra that are ": null
    },
    {
        "convex": "convex body"
    },
    {
        ". With this terminology, a convex polyhedron is the intersection of a finite number of ": null
    },
    {
        "halfspaces": "half-space"
    },
    {
        " and is defined by its sides while a convex polytope is the ": null
    },
    {
        "convex hull": "convex hull"
    },
    {
        " of a finite number of points and is defined by its vertices.     Polytopes in lower numbers of dimensions have standard names:          A polytope comprises elements of different dimensionality such as vertices, edges, faces, cells and so on. Terminology for these is not fully consistent across different authors. For example, some authors use face to refer to an -dimensional element while others use face to denote a 2-face specifically. Authors may use j-face or j-facet to indicate an element of j dimensions. Some use edge to refer to a ridge, while ": null
    },
    {
        "H. S. M. Coxeter": "h. s. m. coxeter"
    },
    {
        " uses cell to denote an -dimensional element. Regular polytopes, p. 127 The part of the polytope that lies in one of the hyperplanes is called a cell      The terms adopted in this article are given in the table below:          An n-dimensional polytope is bounded by a number of -dimensional  facets . These facets are themselves polytopes, whose facets are -dimensional  ridges  of the original polytope. Every ridge arises as the intersection of two facets . Ridges are once again polytopes whose facets give rise to -dimensional boundaries of the original polytope, and so on. These bounding sub-polytopes may be referred to as ": null
    },
    {
        "faces": "face"
    },
    {
        ", or specifically j-dimensional faces or j-faces. A 0-dimensional face is called a vertex, and consists of a single point. A 1-dimensional face is called an edge, and consists of a line segment. A 2-dimensional face consists of a ": null
    },
    {
        "polygon": "polygon"
    },
    {
        ", and a 3-dimensional face, sometimes called a  cell , consists of a ": null
    },
    {
        "polyhedron": "polyhedron"
    },
    {
        ".              A polytope may be convex. The convex polytopes are the simplest kind of polytopes, and form the basis for several different generalizations of the concept of polytopes. A convex polytope is sometimes defined as the intersection of a set of ": null
    },
    {
        "half-space": "half-space"
    },
    {
        "s. This definition allows a polytope to be neither bounded nor finite. Polytopes are defined in this way, e.g., in ": null
    },
    {
        "linear programming": "linear programming"
    },
    {
        ". A polytope is bounded if there is a ball of finite radius that contains it. A polytope is said to be pointed if it contains at least one vertex. Every bounded nonempty polytope is pointed. An example of a non-pointed polytope is the set \\ . A polytope is finite if it is defined in terms of a finite number of objects, e.g., as an intersection of a finite number of half-planes.   It is an ": null
    },
    {
        "integral polytope": "integral polytope"
    },
    {
        " if all of its vertices have integer coordinates.     A certain class of convex polytopes are reflexive polytopes. An integral d -polytope \\mathcal is reflexive if for some ": null
    },
    {
        "integral matrix": "integer matrix"
    },
    {
        " \\mathbf , \\mathcal \\ , where \\mathbf denotes a vector of all ones, and the inequality is component-wise. It follows from this definition that \\mathcal is reflexive if and only if \\mathcal^\\circ \\cap \\mathbb^d t\\mathcal \\cap \\mathbb^d for all t \\in \\mathbb_ . In other words, a -dilate of \\mathcal differs, in terms of integer lattice points, from a t -dilate of \\mathcal only by lattice points gained on the boundary. Equivalently, \\mathcal is reflexive if and only if its ": null
    },
    {
        "dual polytope": "dual polyhedron"
    },
    {
        " \\mathcal^ is an integral polytope. Beck, Matthias; Robins, Sinai , Computing the Continuous Discretely, Integer-point enumeration in polyhedra, Undergraduate Texts in Mathematics, New York: Springer-Verlag, , MR 2271992          A regular polytope is the most highly symmetrical kind, with the various groups of elements being transitive on the symmetries of the polytope, such that the polytope is said to be transitive on its ": null
    },
    {
        "flags": "flag"
    },
    {
        ". Thus, the ": null
    },
    {
        "dual": "dual polytope"
    },
    {
        " of a regular polytope is also regular.     There are three main classes of regular polytope which occur in any number n of dimensions:   ": null
    },
    {
        "Simplices": "simplex"
    },
    {
        ", including the ": null
    },
    {
        "equilateral triangle": "equilateral triangle"
    },
    {
        " and the ": null
    },
    {
        "regular tetrahedron": "regular tetrahedron"
    },
    {
        ".   ": null
    },
    {
        "Hypercubes": "hypercube"
    },
    {
        "or measure polytopes, including the ": null
    },
    {
        "square": "square"
    },
    {
        " and the ": null
    },
    {
        "cube": "cube"
    },
    {
        ".   ": null
    },
    {
        "Orthoplex": "orthoplex"
    },
    {
        "es or cross polytopes, including the ": null
    },
    {
        "square": "square"
    },
    {
        " and ": null
    },
    {
        "regular octahedron": "regular octahedron"
    },
    {
        ".     Dimensions two, three and four include regular figures which have fivefold symmetries and some of which are non-convex stars, and in two dimensions there are infinitely many ": null
    },
    {
        "regular polygons": "regular polygon"
    },
    {
        "of n-fold symmetry, both convex and  star. But in higher dimensions there are no other regular polytopes.     In three dimensions the convex ": null
    },
    {
        "Platonic solids": "platonic solid"
    },
    {
        "include the fivefold-symmetric ": null
    },
    {
        "dodecahedron": "dodecahedron"
    },
    {
        " and ": null
    },
    {
        "icosahedron": "icosahedron"
    },
    {
        ", and there are also four star ": null
    },
    {
        "Kepler-Poinsot polyhedra": "kepler-poinsot polyhedra"
    },
    {
        " with fivefold symmetry, bringing the total to nine regular polyhedra.     In four dimensions the ": null
    },
    {
        "regular 4-polytopes": "regular 4-polytope"
    },
    {
        "include one additional convex solid with fourfold symmetry and two with fivefold symmetry. There are ten star ": null
    },
    {
        "Schläfli-Hess 4-polytope": "schläfli-hess 4-polytope"
    },
    {
        "s, all with fivefold symmetry, giving in all sixteen regular 4-polytopes.          A non-convex polytope may be self-intersecting; this class of polytopes include the ": null
    },
    {
        "star polytope": "star polytope"
    },
    {
        "s. Some regular polytopes are stars.           Not all manifolds are finite. Where a polytope is understood as a tiling or decomposition of a manifold, this idea may be extended to infinite manifolds. ": null
    },
    {
        "plane tilings": "tessellation"
    },
    {
        ", space-filling  and ": null
    },
    {
        "hyperbolic tilings": "hyperbolic tiling"
    },
    {
        "are in this sense polytopes, and are sometimes called ": null
    },
    {
        "apeirotopes": "apeirotope"
    },
    {
        "because they have infinitely many cells.     Among these, there are regular forms including the ": null
    },
    {
        "regular skew polyhedra": "regular skew polyhedron"
    },
    {
        " and the infinite series of tilings represented by the regular ": null
    },
    {
        "apeirogon": "apeirogon"
    },
    {
        ", square tiling, cubic honeycomb, and so on.            The theory of ": null
    },
    {
        "abstract polytopes": "abstract polytope"
    },
    {
        "attempts to detach polytopes from the space containing them, considering their purely combinatorial properties. This allows the definition of the term to be extended to include objects for which it is difficult to define an intuitive underlying space, such as the ": null
    },
    {
        "11-cell": "11-cell"
    },
    {
        ".     An abstract polytope is a ": null
    },
    {
        "partially ordered set": "partially ordered set"
    },
    {
        " of elements or members, which obeys certain rules. It is a purely algebraic structure, and the theory was developed in order to avoid some of the issues which make it difficult to reconcile the various geometric classes within a consistent mathematical framework. A geometric polytope is said to be a realization in some real space of the associated abstract polytope.             Structures analogous to polytopes exist in complex ": null
    },
    {
        "Hilbert spaces": "hilbert space"
    },
    {
        " \\Complex^n where n real dimensions are accompanied by n ": null
    },
    {
        "imaginary": "imaginary number"
    },
    {
        " ones. ": null
    },
    {
        "Regular complex polytopes": "regular complex polytope"
    },
    {
        "are more appropriately treated as ": null
    },
    {
        "configurations": "configuration"
    },
    {
        ". Coxeter, H.S.M.; Regular Complex Polytopes, 1974       Every n-polytope has a dual structure, obtained by interchanging its vertices for facets, edges for ridges, and so on generally interchanging its -dimensional elements for -dimensional elements , while retaining the connectivity or incidence between elements.     For an abstract polytope, this simply reverses the ordering of the set. This reversal is seen in the ": null
    },
    {
        "Schläfli symbols": "schläfli symbol"
    },
    {
        "for regular polytopes, where the symbol for the dual polytope is simply the reverse of the original. For example, is dual to .     In the case of a geometric polytope, some geometric rule for dualising is necessary, see for example the rules described for ": null
    },
    {
        "dual polyhedra": "dual polyhedra"
    },
    {
        ". Depending on circumstance, the dual figure may or may not be another geometric polytope. Wenninger, M.; Dual Models, CUP .     If the dual is reversed, then the original polytope is recovered. Thus, polytopes exist in dual pairs.          If a polytope has the same number of vertices as facets, of edges as ridges, and so forth, and the same connectivities, then the dual figure will be similar to the original and the polytope is self-dual.     Some common self-dual polytopes include:   Every regular n-": null
    },
    {
        "simplex": "simplex"
    },
    {
        ", in any number of dimensions, with ": null
    },
    {
        "Schlafli symbol": "schlafli symbol"
    },
    {
        " . These include the ": null
    },
    {
        "equilateral triangle": "equilateral triangle"
    },
    {
        " , ": null
    },
    {
        "regular tetrahedron": "regular tetrahedron"
    },
    {
        " , and ": null
    },
    {
        "5-cell": "5-cell"
    },
    {
        " .   Every ": null
    },
    {
        "hypercubic honeycomb": "hypercubic honeycomb"
    },
    {
        ", in any number of dimensions. These include the ": null
    },
    {
        "apeirogon": "apeirogon"
    },
    {
        " , ": null
    },
    {
        "square tiling": "square tiling"
    },
    {
        " and ": null
    },
    {
        "cubic honeycomb": "cubic honeycomb"
    },
    {
        " .   Numerous compact, paracompact and noncompact hyperbolic tilings, such as the ": null
    },
    {
        "icosahedral honeycomb": "icosahedral honeycomb"
    },
    {
        " , and ": null
    },
    {
        "order-5 pentagonal tiling": "order-5 pentagonal tiling"
    },
    {
        " .   In 2 dimensions, all ": null
    },
    {
        "regular polygons": "regular polygon"
    },
    {
        "   In 3 dimensions, the ": null
    },
    {
        "canonical": "canonical form"
    },
    {
        "polygonal pyramids": "polygonal pyramid"
    },
    {
        "and ": null
    },
    {
        "elongated pyramid": "elongated pyramid"
    },
    {
        "s, and ": null
    },
    {
        "tetrahedrally diminished dodecahedron": "tetrahedrally diminished dodecahedron"
    },
    {
        ".   In 4 dimensions, the ": null
    },
    {
        "24-cell": "24-cell"
    },
    {
        ", with ": null
    },
    {
        "Schlafli symbol": "schlafli symbol"
    },
    {
        " . Also the ": null
    },
    {
        "great 120-cell": "great 120-cell"
    },
    {
        " and ": null
    },
    {
        "grand stellated 120-cell": "grand stellated 120-cell"
    },
    {
        " .       Polygons and polyhedra have been known since ancient times.     An early hint of higher dimensions came in 1827 when ": null
    },
    {
        "August Ferdinand Möbius": "august ferdinand möbius"
    },
    {
        " discovered that two mirror-image solids can be superimposed by rotating one of them through a fourth mathematical dimension. By the 1850s, a handful of other mathematicians such as ": null
    },
    {
        "Arthur Cayley": "arthur cayley"
    },
    {
        " and ": null
    },
    {
        "Hermann Grassmann": "hermann grassmann"
    },
    {
        " had also considered higher dimensions.     ": null
    },
    {
        "Ludwig Schläfli": "ludwig schläfli"
    },
    {
        " was the first to consider analogues of polygons and polyhedra in these higher spaces. He described the six ": null
    },
    {
        "convex regular 4-polytopes": "convex regular 4-polytope"
    },
    {
        "in 1852 but his work was not published until 1901, six years after his death. By 1854, ": null
    },
    {
        "Bernhard Riemanns": "bernhard riemann"
    },
    {
        "  Habilitationsschrift  had firmly established the geometry of higher dimensions, and thus the concept of n-dimensional polytopes was made acceptable. Schläflis polytopes were rediscovered many times in the following decades, even during his lifetime.     In 1882 ": null
    },
    {
        "Reinhold Hoppe": "reinhold hoppe"
    },
    {
        ", writing in German, coined the word  polytop  to refer to this more general concept of polygons and polyhedra. In due course ": null
    },
    {
        "Alicia Boole Stott": "alicia boole stott"
    },
    {
        ", daughter of logician ": null
    },
    {
        "George Boole": "george boole"
    },
    {
        ", introduced the anglicised polytope into the English language.      In 1895, ": null
    },
    {
        "Thorold Gosset": "thorold gosset"
    },
    {
        " not only rediscovered Schläflis regular polytopes but also investigated the ideas of ": null
    },
    {
        "semiregular polytopes": "semiregular polytope"
    },
    {
        "and space-filling ": null
    },
    {
        "tessellations": "tessellation"
    },
    {
        "in higher dimensions. Polytopes also began to be studied in non-Euclidean spaces such as hyperbolic space.     An important milestone was reached in 1948 with ": null
    },
    {
        "H. S. M. Coxeters": "harold scott macdonald coxeter"
    },
    {
        "book  Regular Polytopes , summarizing work to date and adding new findings of his own.     Meanwhile, the French mathematician ": null
    },
    {
        "Henri Poincaré": "henri poincaré"
    },
    {
        " had developed the ": null
    },
    {
        "topological": "topology"
    },
    {
        " idea of a polytope as the piecewise decomposition  of a ": null
    },
    {
        "manifold": "manifold"
    },
    {
        ". ": null
    },
    {
        "Branko Grünbaum": "branko grünbaum"
    },
    {
        " published his influential work on Convex Polytopes in 1967.     In 1952 ": null
    },
    {
        "Geoffrey Colin Shephard": "geoffrey colin shephard"
    },
    {
        " generalised the idea as ": null
    },
    {
        "complex polytopes": "complex polytope"
    },
    {
        "in complex space, where each real dimension has an imaginary one associated with it. Coxeter developed the theory further.     The conceptual issues raised by complex polytopes, non-convexity, duality and other phenomena led Grünbaum and others to the more general study of abstract combinatorial properties relating vertices, edges, faces and so on. A related idea was that of incidence complexes, which studied the incidence or connection of the various elements with one another. These developments led eventually to the theory of ": null
    },
    {
        "abstract polytopes": "abstract polytope"
    },
    {
        "as partially ordered sets, or posets, of such elements. ": null
    },
    {
        "Peter McMullen": "peter mcmullen"
    },
    {
        " and Egon Schulte published their book Abstract Regular Polytopes in 2002.     Enumerating the ": null
    },
    {
        "uniform polytope": "uniform polytope"
    },
    {
        "s, convex and nonconvex, in four or more dimensions remains an outstanding problem.     In modern times, polytopes and related concepts have found many important applications in fields as diverse as ": null
    },
    {
        "computer graphics": "computer graphics"
    },
    {
        ", ": null
    },
    {
        "optimization": "optimization"
    },
    {
        ", ": null
    },
    {
        "search engine": "search engine"
    },
    {
        "s, ": null
    },
    {
        "cosmology": "cosmology"
    },
    {
        ", ": null
    },
    {
        "quantum mechanics": "quantum mechanics"
    },
    {
        " and numerous other fields. In 2013 the ": null
    },
    {
        "amplituhedron": "amplituhedron"
    },
    {
        " was discovered as a simplifying construct in certain calculations of theoretical physics.       In the field of ": null
    },
    {
        "optimization": "optimization"
    },
    {
        ", ": null
    },
    {
        "linear programming": "linear programming"
    },
    {
        " studies the ": null
    },
    {
        "maxima and minima": "maxima and minima"
    },
    {
        " of ": null
    },
    {
        "linear": "linear"
    },
    {
        " functions; these maxima and minima occur on the ": null
    },
    {
        "boundary": "boundary"
    },
    {
        " of an n-dimensional polytope. In linear programming, polytopes occur in the use of ": null
    },
    {
        "generalized barycentric coordinates": "generalized barycentric coordinates"
    },
    {
        " and ": null
    },
    {
        "slack variable": "slack variable"
    },
    {
        "s.     In ": null
    },
    {
        "twistor theory": "twistor theory"
    },
    {
        ", a branch of ": null
    },
    {
        "theoretical physics": "theoretical physics"
    },
    {
        ", a polytope called the ": null
    },
    {
        "amplituhedron": "amplituhedron"
    },
    {
        " is used in to calculate the scattering amplitudes of subatomic particles when they collide. The construct is purely theoretical with no known physical manifestation, but is said to greatly simplify certain calculations. ": null
    }
]