[
    {
        "      In ": null
    },
    {
        "geometry": "geometry"
    },
    {
        ", a polyhedron  is a ": null
    },
    {
        "solid": "solid"
    },
    {
        " in ": null
    },
    {
        "three dimensions": "three-dimensional space"
    },
    {
        " with flat ": null
    },
    {
        "polygon": "polygon"
    },
    {
        "al ": null
    },
    {
        "faces": "face"
    },
    {
        ", straight ": null
    },
    {
        "edges": "edge"
    },
    {
        " and sharp corners or ": null
    },
    {
        "vertices": "vertex"
    },
    {
        ". The word polyhedron comes from the ": null
    },
    {
        "Classical Greek": "greek language"
    },
    {
        " πολύεδρον, as poly- + -hedron .     A ": null
    },
    {
        "convex polyhedron": "convex polyhedron"
    },
    {
        " is the ": null
    },
    {
        "convex hull": "convex hull"
    },
    {
        " of finitely many points, not all on the same plane.   ": null
    },
    {
        "Cubes": "cube"
    },
    {
        " and ": null
    },
    {
        "pyramids": "pyramid"
    },
    {
        " are examples of convex polyhedra.     A polyhedron is a 3-dimensional example of the more general ": null
    },
    {
        "polytope": "polytope"
    },
    {
        " in any number of dimensions.               ": null
    },
    {
        "Convex polyhedra": "convex polyhedron"
    },
    {
        " are well-defined, with several equivalent standard definitions. However, the formal mathematical definition of polyhedra that are not required to be convex has been problematic.   Many definitions of polyhedron have been given within particular contexts, . some more rigorous than others, and there is not universal agreement over which of these to choose.   Some of these definitions exclude shapes that have often been counted as polyhedra  or include   shapes that are often not considered as valid polyhedra . As ": null
    },
    {
        "Branko Grünbaum": "branko grünbaum"
    },
    {
        " observed,      Nevertheless, there is general agreement that a polyhedron is a solid or surface that can be described by its ": null
    },
    {
        "vertices": "vertex"
    },
    {
        " , ": null
    },
    {
        "edges": "edge"
    },
    {
        " ,   ": null
    },
    {
        "faces": "face"
    },
    {
        " , and sometimes by its three-dimensional interior ": null
    },
    {
        "volume": "volume"
    },
    {
        ".   One can distinguish among these different definitions according to whether they describe the polyhedron as a solid, whether they describe it as a surface, or whether they describe it more abstractly based on its ": null
    },
    {
        "incidence geometry": "incidence geometry"
    },
    {
        ".   A common and somewhat naive definition of a polyhedron is that it is a solid whose boundary can be covered by finitely many planes . . or that it is a solid formed as the union of finitely many convex polyhedra.  Natural refinements of this definition require the solid to be bounded, to have a connected interior, and possibly also to have a connected boundary. The faces of such a polyhedron can be defined as the ": null
    },
    {
        "connected components": "connected component"
    },
    {
        " of the parts of the boundary within each of the planes that cover it, and the edges and vertices as the line segments and points where the faces meet. However, the polyhedra defined in this way do not include the self-crossing star polyhedra, their faces may not form ": null
    },
    {
        "simple polygon": "simple polygon"
    },
    {
        "s, and some edges may belong to more than two faces. .   Definitions based on the idea of a bounding surface rather than a solid are also common. Cromwell , pp.  206–209. For instance,  defines a polyhedron as a union of ": null
    },
    {
        "convex polygons": "convex polygon"
    },
    {
        ", arranged in space so that the intersection of any two polygons is a shared vertex or edge or the ": null
    },
    {
        "empty set": "empty set"
    },
    {
        " and so that their union is a ": null
    },
    {
        "manifold": "manifold"
    },
    {
        ". . If a planar part of such a surface is not itself a convex polygon, ORourke requires it to be subdivided into smaller convex polygons, with flat ": null
    },
    {
        "dihedral angles": "dihedral angle"
    },
    {
        "between them. Somewhat more generally, Grünbaum defines an acoptic polyhedron to be a collection of simple polygons that form an embedded manifold, with each vertex incident to at least three edges and each two faces intersecting only in shared vertices and edges of each. . Cromwell gives a similar definition but without the restriction of three edges per vertex. Again, this type of definition does not encompass the self-crossing polyhedra. , p.  209. Similar notions form the basis of topological definitions of polyhedra, as subdivisions of a topological manifold into ": null
    },
    {
        "topological disks": "disk"
    },
    {
        " whose pairwise intersections are required to be points , topological arcs , or the empty set. However, there exist topological polyhedra that cannot be realized as acoptic polyhedra. .   One modern approach is based on the theory of ": null
    },
    {
        "abstract polyhedra": "abstract polyhedron"
    },
    {
        ". These can be defined as ": null
    },
    {
        "partially ordered sets": "partially ordered set"
    },
    {
        "whose elements are the vertices, edges, and faces of a polyhedron. A vertex or edge element is less than an edge or face element when the vertex or edge is part of the edge or face. Additionally, one may include a special bottom element of this partial order and a top element representing the whole polyhedron. If the sections of the partial order between elements three levels apart have the same structure as the abstract representation of a polygon, then these partially ordered sets carry exactly the same information as a topological polyhedron. However, these requirements are often relaxed, to instead require only that sections between elements two levels apart have the same structure as the abstract representation of a line segment. . Geometric polyhedra, defined in other ways, can be described abstractly in this way, but it is also possible to use abstract polyhedra as the basis of a definition of geometric polyhedra. A realization of an abstract polyhedron is generally taken to be a mapping from the vertices of the abstract polyhedron to geometric points, such that the points of each face are coplanar. A geometric polyhedron can then be defined as a realization of an abstract polyhedron. , pp.  468–469. Realizations that forgo the requirement of planarity, that impose additional requirements of symmetry, or that map the vertices to higher dimensional spaces have also been considered. Unlike the solid-based and surface-based definitions, this works perfectly well for star polyhedra. However, without additional restrictions, this definition allows ": null
    },
    {
        "degenerate": "degeneracy"
    },
    {
        " or unfaithful polyhedra and the question of how to constrain realizations to avoid these degeneracies has not been settled.     In all of these definitions, a polyhedron is typically understood as a three-dimensional example  of the more general ": null
    },
    {
        "polytope": "polytope"
    },
    {
        " in any number of dimensions. For example, a polygon has a two-dimensional body and no faces, while a ": null
    },
    {
        "4-polytope": "4-polytope"
    },
    {
        " has a four-dimensional body and an additional set of three-dimensional cells .   However, some of the literature on higher-dimensional geometry uses the term polyhedron to mean something else: not a three-dimensional polytope, but a shape that is different from a polytope in some way. For instance, some sources define a convex polyhedron to be the intersection of finitely many ": null
    },
    {
        "half-spaces": "half-space"
    },
    {
        ", and a polytope to be a bounded polyhedron. . . The remainder of this article considers only three-dimensional polyhedra.           Polyhedra may be classified and are often named according to the number of faces. The naming system is based on Classical Greek, for example ": null
    },
    {
        "tetrahedron": "tetrahedron"
    },
    {
        " , ": null
    },
    {
        "pentahedron": "pentahedron"
    },
    {
        " , ": null
    },
    {
        "hexahedron": "hexahedron"
    },
    {
        " , ": null
    },
    {
        "triacontahedron": "triacontahedron"
    },
    {
        " , and so on.     For a complete list of the Greek numeral prefixes see ": null
    },
    {
        "Numeral prefixe": "numeral prefixtable of number prefixes in english"
    },
    {
        "  ": null
    }
]