[
    {
        "        Pompeu Fabra i Poch  was a Spanish engineer and ": null
    },
    {
        "grammarian": "linguist"
    },
    {
        ". He was the main author of the normative reform of contemporary ": null
    },
    {
        "Catalan language": "catalan language"
    },
    {
        ".       Pompeu Fabra was born in Gràcia, which at that time was still separate from Barcelona, in 42 He was the last of twelve children born to Josep Fabra i Roca and his wife Carolina Poch i Martí. When Pompeu was six, the family moved to Barcelona.     From a fairly young age Fabra dedicated himself to the study of the Catalan language. Through the journal and publishing house  LAvenç , he participated in a campaign to reform ": null
    },
    {
        "Catalan orthography": "catalan orthography"
    },
    {
        " between 4242 He published Tractat dortografia catalana with the writer and publisher ": null
    },
    {
        "Jaume Massó i Torrents": "jaume massó i torrents"
    },
    {
        " and ": null
    },
    {
        "Joaquim Casas i Carbó": "joaquim casas i carbó"
    },
    {
        ", a famous lawyer and writer, in 42     Despite his personal interest in linguistics, Fabra studied industrial engineering in ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        " and in 42 accepted a chair of chemistry position at the School of Engineering in ": null
    },
    {
        "Bilbao": "bilbao"
    },
    {
        ". During his tenure in Bilbao, Fabra participated actively in the ": null
    },
    {
        "First International Congress of the Catalan Language": "first international congress of the catalan language"
    },
    {
        " held in 42 This event gave him a certain prestige in the field of Catalan linguistics. In 42 he returned to Barcelona to become a professor  of Catalan & mdash; a position created by the diputació of Barcelona & mdash; and a member of the department of ": null
    },
    {
        "philology": "philology"
    },
    {
        " at the newly created ": null
    },
    {
        "Institut dEstudis Catalans": "institut destudis catalans"
    },
    {
        ", of which he would later become president. In 42 he published his Gramática de la lengua catalana .     The Institute published the Normes ortogràfiques in 42 the Diccionari ortogràfic in 42 and its official Gramàtica catalana in 42 That same year, Fabra also edited the textbook Curs mitjà de gramàtica catalana, published by lAssociació Protectora de lEnsenyança Catalana. His Converses filològiques, first published in the newspaper ": null
    },
    {
        "La Publicitat": "la publicitat"
    },
    {
        ", were later collected as Popular Barcino. Probably his most famous work was the  Diccionari General de la Llengua Catalana  , the first edition of which later became the Institutes official dictionary.     In 42 owing to his scientific prestige, he was unanimously named a professor  of the Republican Universitat Autònoma de Barcelona . The following year he was named President of the Universitys governing council, which resulted in his imprisonment in 42 following the events of 42 October when troops of the ": null
    },
    {
        "Second Spanish Republic": "second spanish republic"
    },
    {
        " put down a Catalan government uprising led by ": null
    },
    {
        "Lluis Companys": "lluis companys"
    },
    {
        ".     Fabra was reinstated to his faculty position after the elections of February 42 but the ": null
    },
    {
        "Spanish Civil War": "spanish civil war"
    },
    {
        " began in July of that year, and he had to flee his country when Barcelona was being invaded by the Francoist army. By 42 he was in exile in ": null
    },
    {
        "France": "france"
    },
    {
        " where he endured many hardships. He lived in ": null
    },
    {
        "Paris": "paris"
    },
    {
        " and ": null
    },
    {
        "Montpellier": "montpellier"
    },
    {
        ", where he presided over the  Jocs Florals  literary competition in 42 He eventually moved to ": null
    },
    {
        "Prada de Conflent": "prada de conflent"
    },
    {
        " in the ": null
    },
    {
        "Catalan": "catalan language"
    },
    {
        "-speaking area of France, where he died on 42 December 42 At some point during the exile he made his will in ": null
    },
    {
        "Andorra": "andorra"
    },
    {
        ", so that it would be done in a country where Catalan was the official language.       Every year, his tomb in the ": null
    },
    {
        "Cuixà": "saint-michel-de-cuxa"
    },
    {
        " monastery near Prada is visited by thousands of Catalans.     The ": null
    },
    {
        "Universitat Pompeu Fabra": "universitat pompeu fabra"
    },
    {
        " in Barcelona bears his name.        Tractat de ortografia catalana   Qüestions de gramàtica catalana   La coordinació i la subordinació en els documents de la cancilleria catalana durant el segle XIV   Diccionari ortogràfic abreujat   La conjugació dels verbs en català   Diccionari ortogràfic: precedit duna exposició de lortografia catalana   El català literari": null
    }
]