[
    {
        "     Pompeu Fabra University  is a ": null
    },
    {
        "public": "public university"
    },
    {
        " university": "university"
    },
    {
        " in ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        ", ": null
    },
    {
        "Spain": "spain"
    },
    {
        ". It was created by the Autonomous Government of Catalonia in 42 and was named after the linguist ": null
    },
    {
        "Pompeu Fabra": "pompeu fabra"
    },
    {
        ", an expert on the Catalan language.     It was designated as an “International Excellence Campus” by the Spanish Ministry of Education in 42     The universitys Faculty of Economics and Business Sciences is the first and only faculty in Spain to be awarded the ": null
    },
    {
        "Certificate for Quality in Internationalization": "certificate for quality in internationalization"
    },
    {
        " granted by a consortium of 42 European accreditation agencies.       The university offers its studies around three areas of knowledge, each one developed in a different campus:   the social sciences and humanities   the health and life sciences   the ICT and communication sciences     Specifically, teaching is organized in seven colleges and one engineering school:   Humanities   Health and Life Sciences   Economics and Business   Political and Social Science   Communication   Law   Translation and Language Sciences   Engineering School       Finally, the University also has five higher education affiliated centers:   UPF Barcelona School of Management   International Trade Business School -ESCI-   ": null
    },
    {
        "Elisava School of Design": "elisava school of design"
    },
    {
        " Tecnocampus": "tecnocampus"
    },
    {
        "         The University model is primarily based on a policy of being an institution that is open to the world, incorporating prominent national and international researchers. This commitment is reflected in excellent indicators in research, such as the volume of funds coming from Europe or indicators of scientific production.     Research is organized in eight departments:   Economics and Business   Law   Political and Social Science   Humanities   Experimental Sciences and Health   ICT   Communication   Translation & Language Sciences     Moreover, in order to promote research and transfer activities undertaken by university researchers and provide them with greater international visibility, the University is developing the UPF Research Park in the fields of social sciences, humanities, communication and information technologies. The UPF Research Park, which develops its activity at Ciutadella and Poblenou campuses, coordinates its activities in the fields of health and life sciences with the ": null
    },
    {
        "Barcelona Biomedical Research Park": "barcelona biomedical research park"
    },
    {
        " , located at Mar campus.       Institut Barcelona dEstudis Internacionals                 The Research Centre for International Economics  is a research institute sponsored by the government of Catalonia  and the UPF led by the economist Jordi Galí. Its headquarters is on the campus of UPF in Barcelona, near the Department of Economics and Business at UPF , which collaborates in many research and teaching fields.     The research activities are focused on international economics and macroeconomics . It tries to emphasize these fields of studies in the European dimension.       Enric Argullol served as rector from the founding until June 42 followed by M. Rosa Virós i Galtier and ": null
    },
    {
        "Josep Joan Moreso": "josep joan moreso"
    },
    {
        " . The current rector, ": null
    },
    {
        "Jaume Casals": "jaume casals"
    },
    {
        ", was reelected for a second term in April 42             The UPF is located in three separate ": null
    },
    {
        "campuses": "campuses"
    },
    {
        ", each associated to its own area of knowledge:   Social Sciences and Humanities   ITC and communication sciences   Health and Life Sciences       The position of UPF is presented in the following international rankings: , , the one published by , , and , which is focused on research. More information on rankings  can be found at .    ": null
    },
    {
        "Pol Antràs": "pol antràs"
    },
    {
        ", economist and professor at Harvard   ": null
    },
    {
        "Gloria Aura Bortolini": "gloria aura bortolini"
    },
    {
        "; journalist, photographer and filmmaker   ": null
    },
    {
        "Diego Comin": "diego comin"
    },
    {
        ", economist   ": null
    },
    {
        "Lluís Galter": "lluís galter"
    },
    {
        ", cinema director   ": null
    },
    {
        "Uri Giné": "uri giné"
    },
    {
        ", musician   ": null
    },
    {
        "Neus Munté": "neus munté"
    },
    {
        ", politician   ": null
    },
    {
        "Gabriel Rufián": "gabriel rufián"
    },
    {
        ", politician   ": null
    },
    {
        "Sandra Sabatés": "sandra sabatés"
    },
    {
        ", journalist       ": null
    },
    {
        "Jaume Casals": "jaume casals"
    },
    {
        ", philosopher   ": null
    },
    {
        "Josep Joan Moreso": "josep joan moreso"
    },
    {
        ", legal scholar   ": null
    },
    {
        "Vicenç Navarro": "vicenç navarro"
    },
    {
        ", sociologist   ": null
    },
    {
        "Xavier Sala-i-Martin": "xavier sala-i-martin"
    },
    {
        ", economist   ": null
    },
    {
        "Eugenio Trías Sagnier": "eugenio trías sagnier"
    },
    {
        ", philosopher   ": null
    },
    {
        "Teun A. van Dijk": "teun a. van dijk"
    },
    {
        ", linguist   ": null
    },
    {
        "Xavier Serra": "xavier serra"
    },
    {
        ", music technology scholar   ": null
    },
    {
        "Andreu Mas-Colell": "andreu mas-colell"
    },
    {
        ", economist   ": null
    },
    {
        "Jordi Galí": "jordi galí"
    },
    {
        ", economist   ": null
    },
    {
        "Sergi Jordà": "sergi jordà"
    },
    {
        ", music technology scholar   ": null
    },
    {
        "Paul Verschure": "paul verschure"
    },
    {
        ", cognitive systems and neuro-robotics     ": null
    },
    {
        "Lydia Zimmermann": "lydia zimmermann"
    },
    {
        ", filmmaker   ": null
    },
    {
        "Gøsta Esping-Andersen": "gøsta esping-andersen"
    },
    {
        ", sociologist   ": null
    },
    {
        "Guillem López Casasnovas": "guillem lópez casasnovas"
    },
    {
        ", economist   ": null
    },
    {
        "Xavier Freixas": "xavier freixas"
    }
]