[
    {
        "      Pontius Pilate  was the fifth governor of the Roman province of ": null
    },
    {
        "Judaea": "judea"
    },
    {
        ", serving under Emperor ": null
    },
    {
        "Tiberius": "tiberius"
    },
    {
        " from 42/42 to 42/42 ": null
    },
    {
        "CE": "common era"
    },
    {
        ". He is best known today for being the official who presided over the ": null
    },
    {
        "trial": "pilates court"
    },
    {
        " of ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " and ordered his ": null
    },
    {
        "crucifixion": "crucifixion of jesus"
    },
    {
        ". Pilates importance in modern Christianity is underscored by his prominent place in both the ": null
    },
    {
        "Apostles": "apostles creed"
    },
    {
        " and ": null
    },
    {
        "Nicene Creed": "nicene creed"
    },
    {
        "s. Due to the Gospels portrayal of Pilate as reluctant to execute Jesus, the ": null
    },
    {
        "Coptic": "coptic orthodox church of alexandria"
    },
    {
        " and ": null
    },
    {
        "Ethiopian Churches": "ethiopian orthodox tewahedo church"
    },
    {
        " believe that Pilate became a Christian and venerate him as a martyr and saint.     Although Pilate is the best-attested governor of Judaea, few sources on his rule have survived. He appears to have belonged to the well-attested ": null
    },
    {
        "Pontii": "pontia gens"
    },
    {
        " family, but nothing is known for certain about his life before he became governor of Judaea, nor of the circumstances that led to his appointment to the governorship. A single inscription from Pilates governorship has survived, the so-called ": null
    },
    {
        "Pilate stone": "pilate stone"
    },
    {
        ", as have coins that he minted. The Jewish historian ": null
    },
    {
        "Josephus": "josephus"
    },
    {
        " and philosopher ": null
    },
    {
        "Philo of Alexandria": "philo of alexandria"
    },
    {
        " both mention incidents of tension and violence between the Jewish population and Pilates administration. Many of these involve Pilate acting in ways that offended the religious sensibilities of the Jews. The Christian ": null
    },
    {
        "Gospels": "gospels"
    },
    {
        " record that Pilate ordered the crucifixion of Jesus at some point during his time in office; Josephus and the Roman historian ": null
    },
    {
        "Tacitus": "tacitus"
    },
    {
        " also appear to have recorded this information. According to Josephus, Pilates removal from office occurred because he violently suppressed an armed ": null
    },
    {
        "Samaritan": "samaritans"
    },
    {
        " movement at ": null
    },
    {
        "Mount Gerizim": "mount gerizim"
    },
    {
        ". He was sent back to Rome by the legate of ": null
    },
    {
        "Syria": "roman syria"
    },
    {
        " to answer for this before Tiberius, who, however, had died before he arrived. Nothing is known for certain about what happened to him after this. On the basis of a mention in the second-century pagan philosopher ": null
    },
    {
        "Celsus": "celsus"
    },
    {
        " and Christian apologist ": null
    },
    {
        "Origen": "origen"
    },
    {
        ", most modern historians believe that Pilate simply retired after his dismissal. Modern historians have differing assessments of Pilate as an effective ruler; while some believe he was a particularly brutal and ineffective governor, others argue that his long time in office means he must have been reasonably competent. According to one prominent ": null
    },
    {
        "post-war": "post-war"
    },
    {
        " theory, Pilate was motivated by ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        " in his treatment of the Jews, but this theory has been mostly abandoned.     In ": null
    },
    {
        "Late Antiquity": "late antiquity"
    },
    {
        " and the ": null
    },
    {
        "Early Middle Ages": "early middle ages"
    },
    {
        ", Pilate became the focus of a large group of ": null
    },
    {
        "New Testament apocrypha": "new testament apocrypha"
    },
    {
        " expanding on his role in the Gospels. In many of these, particularly the earlier texts from the ": null
    },
    {
        "Eastern Roman Empire": "eastern roman empire"
    },
    {
        ", Pilate was portrayed as a positive figure. In some, he became a Christian ": null
    },
    {
        "martyr": "martyr"
    },
    {
        ". In later, particularly Western Christian texts, he was instead portrayed as a negative figure and villain, with traditions surrounding his death by suicide featuring prominently. Pilate was also the focus of numerous medieval ": null
    },
    {
        "legend": "legend"
    },
    {
        "s, which invented a complete biography for him and portrayed him as villainous and cowardly. Many of these legends connected Pilates place of birth or death to particular locations around ": null
    },
    {
        "Western Europe": "western europe"
    },
    {
        ".     Pilate has frequently been a subject of artistic representation. ": null
    },
    {
        "Medieval art": "medieval art"
    },
    {
        " frequently portrayed scenes of Pilate and Jesus, often in the scene where he washes his hands of guilt for Jesuss death. In the art of the ": null
    },
    {
        "Late Middle Ages": "late middle ages"
    },
    {
        " and the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ", Pilate is often depicted as a Jew. The nineteenth century saw a renewed interest in depicting Pilate, with numerous images made. He plays an important role in medieval ": null
    },
    {
        "passion plays": "passion plays"
    },
    {
        ", where he is often a more prominent character than Jesus. His characterization in these plays varies greatly, from weak-willed and coerced into crucifying Jesus to being an evil person who demands Jesuss crucifixion. Modern authors who feature Pilate prominently in their works include ": null
    },
    {
        "Anatole France": "anatole france"
    },
    {
        ", ": null
    },
    {
        "Mikhail Bulgakov": "mikhail bulgakov"
    },
    {
        ", and ": null
    },
    {
        "Chingiz Aitmatov": "chingiz aitmatov"
    },
    {
        ", with a majority of modern treatments of Pilate dating to after the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ". Pilate has also frequently been portrayed in film.         Sources on Pontius Pilate are limited, although modern scholars know more about him than about other ": null
    },
    {
        "Roman governors of Judaea": "roman administration of judaea"
    },
    {
        ". The most important sources are the Embassy to Gaius by contemporary Jewish writer ": null
    },
    {
        "Philo of Alexandria": "philo of alexandria"
    },
    {
        " , the Jewish Wars and Antiquities of the Jews by the Jewish historian ": null
    },
    {
        "Josephus": "josephus"
    },
    {
        ", as well as the four canonical Christian ": null
    },
    {
        "Gospel": "gospel"
    },
    {
        "s, ": null
    },
    {
        "Mark": "gospel of mark"
    },
    {
        " , ": null
    },
    {
        "Luke": "gospel of luke"
    },
    {
        " , ": null
    },
    {
        "Matthew": "gospel of matthew"
    },
    {
        " , and ": null
    },
    {
        "John": "gospel of john"
    },
    {
        " . He is also briefly mentioned in  Annals  of the Roman historian ": null
    },
    {
        "Tacitus": "tacitus"
    },
    {
        " , who simply says that he put Jesus to death. Two additional chapters of Tacituss Annals that might have mentioned Pilate have been lost. Besides these texts, coins minted by Pilate have survived, as well as a fragmentary short inscription that names Pilate, known as the ": null
    },
    {
        "Pilate Stone": "pilate stone"
    },
    {
        ", the only inscription about a Roman governor of Judaea predating the ": null
    },
    {
        "Roman-Jewish Wars": "roman-jewish wars"
    },
    {
        " to survive. The written sources provide only limited information and each has its own biases, with the gospels in particular providing a theological rather than historical perspective on Pilate.       The sources give no indication of Pilates life prior to his becoming governor of Judaea. His ": null
    },
    {
        "praenomen": "praenomen"
    },
    {
        " is unknown; his ": null
    },
    {
        "cognomen": "cognomen"
    },
    {
        " Pilatus might mean skilled with the javelin , but it could also refer to the  or ": null
    },
    {
        "Phrygian cap": "phrygian cap"
    },
    {
        ", possibly indicating that one of Pilates ancestors was a ": null
    },
    {
        "freedman": "freedman"
    },
    {
        ". If it means skilled with the javelin, it is possible that Pilate won the cognomen for himself while serving in the ": null
    },
    {
        "Roman military": "military of ancient rome"
    },
    {
        "; it is also possible that his father acquired the cognomen through military skill. In the Gospels of Mark and John, Pilate is only called by his cognomen, which Marie-Joseph Ollivier takes to mean that this was the name by which he was generally known in common speech. The name Pontius indicates that he belonged to the ": null
    },
    {
        "Pontii family": "pontia gens"
    },
    {
        ", a well-known family of ": null
    },
    {
        "Samnite": "samnites"
    },
    {
        " origin which produced a number of important individuals in the late ": null
    },
    {
        "Republic": "roman republic"
    },
    {
        " and ": null
    },
    {
        "early Empire": "principate"
    },
    {
        ". Like all but one other governor of Judaea, Pilate was of the ": null
    },
    {
        "equestrian order": "equites"
    },
    {
        ", a middle rank of the Roman nobility. As one of the attested Pontii, ": null
    },
    {
        "Pontius Aquila": "pontius aquila"
    },
    {
        ", an assassin of ": null
    },
    {
        "Julius Caesar": "julius caesar"
    },
    {
        ", was a ": null
    },
    {
        "Tribune of the Plebs": "tribune of the plebs"
    },
    {
        ", the family must have originally been of ": null
    },
    {
        "Plebeian": "plebs"
    },
    {
        " origin. They became ennobled as equestrians.     Pilate was likely educated, somewhat wealthy, and well-connected politically and socially. He was probably married, but the only extant reference to ": null
    },
    {
        "his wife": "pontius pilates wife"
    },
    {
        ", in which she tells him after a disturbing dream not to interact with Jesus , is generally dismissed as legendary. According to the  cursus honorum  established by ": null
    },
    {
        "Augustus": "augustus"
    },
    {
        " for office holders of equestrian rank, Pilate would have had a military command before becoming prefect of Judaea; ": null
    },
    {
        "Alexander Demandt": "alexander demandt"
    },
    {
        " speculates that this could have been with a legion stationed at the ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        " or ": null
    },
    {
        "Danube": "danube"
    },
    {
        ". Although it is therefore likely Pilate served in the military, it is nevertheless not certain.          Pilate was the fifth governor of the Roman province of Judaea, during the reign of the emperor ": null
    },
    {
        "Tiberius": "tiberius"
    },
    {
        ". The post of governor of Judaea was of relatively low prestige and nothing is known of how Pilate obtained the office. Josephus states that Pilate governed for 42 years , and these are traditionally dated from 42 to 42/42 CE, making him one of the two longest-serving governors of the province. As Tiberius had retired to the island of ": null
    },
    {
        "Capri": "capri"
    },
    {
        " in 42 CE, scholars such as E. Stauffer have argued that Pilate may have actually been appointed by the powerful ": null
    },
    {
        "Praetorian Prefect": "praetorian prefect"
    },
    {
        " Sejanus": "sejanus"
    },
    {
        ", who was executed for treason in 42 CE. Other scholars have cast doubt on any link between Pilate and Sejanus. ": null
    },
    {
        "Daniel R. Schwartz": "daniel r. schwartz"
    },
    {
        " and Kenneth Lönnqvist both argue that the traditional dating of the beginning of Pilates governorship is based on an error in Josephus; Schwartz argues that he was appointed instead in 42 CE, while Lönnqvist argues for 42/42 CE. This redating has not been widely accepted by other scholars.     Pilates title as governor, as attested on the Pilate stone, is ": null
    },
    {
        "prefect": "prefectancient rome"
    },
    {
        " of Judaea . His title is given as  in Tacitus, and with the Greek equivalent   in Josephus and Philo. The title prefect was later changed to procurator under the emperor ": null
    },
    {
        "Claudius": "claudius"
    },
    {
        ", explaining why later sources give Pilate this title. The ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        " uses the generic Greek term  , a term also applied to Pilate in Josephus. The title of prefect implies that Pilates duties were primarily military; however, Pilates troops were meant more as a police than a military force, and Pilates duties extended beyond military matters. As Roman governor, he was head of the judicial system. He had the power to inflict ": null
    },
    {
        "capital punishment": "capital punishment"
    },
    {
        ", and was responsible for collecting tributes and taxes, and for disbursing funds, including the minting of coins. Because the Romans allowed a certain degree of local control, Pilate shared a limited amount of civil and religious power with the Jewish ": null
    },
    {
        "Sanhedrin": "sanhedrin"
    },
    {
        ".     Pilate was subordinate to the legate of ": null
    },
    {
        "Syria": "roman syria"
    },
    {
        "; however, for the first six years in which he held office, Syria lacked a legate, something which ": null
    },
    {
        "Helen Bond": "helen bond"
    },
    {
        " believes may have presented difficulties to Pilate. He seems to have been free to govern the province as he wished, with intervention by the legate of Syria only coming at the end of his tenure. Like other Roman governors of Judaea, Pilate made his primary residence in ": null
    },
    {
        "Caesarea": "caesarea"
    },
    {
        ", going to ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        " mainly for major feasts in order to maintain order. He also would have toured around the province in order to hear cases and administer justice.     As governor, Pilate had the right to appoint the Jewish ": null
    },
    {
        "High Priest": "high priest of israel"
    },
    {
        " and also officially controlled the vestiments of the High Priest in the ": null
    },
    {
        "Antonia Fortress": "antonia fortress"
    },
    {
        ". Unlike his predecessor, ": null
    },
    {
        "Valerius Gratus": "valerius gratus"
    },
    {
        ", Pilate retained the same high priest, ": null
    },
    {
        "Caiaphas": "caiaphas"
    },
    {
        ", for his entire tenure. Caiaphas would be removed following Pilates own removal from the governorship. This indicates that Caiaphas and the priests of the ": null
    },
    {
        "Sadducee sect": "sadducees"
    },
    {
        " were reliable allies to Pilate. Moreover, Maier argues that Pilate could not have used the ": null
    },
    {
        "temple treasury": "temple treasury"
    },
    {
        " to construct an aqueduct, as recorded by Josephus, without the cooperation of the priests. Similarly, Helen Bond argues that Pilate is depicted working closely with the Jewish authorities in the execution of Jesus. Jean-Pierre Lémonon argues that official cooperation with Pilate was limited to the Sadducees, noting that the ": null
    },
    {
        "Pharisees": "pharisees"
    },
    {
        " are absent from the gospel accounts of Jesuss arrest and trial.     Daniel Schwartz takes the note in the ": null
    },
    {
        "Gospel of Luke": "gospel of luke"
    },
    {
        "  that Pilate had a difficult relationship with the Galilean Jewish king ": null
    },
    {
        "Herod Antipas": "herod antipas"
    },
    {
        " as potentially historical. He also finds historical the information that their relationship mended following the execution of Jesus. Based on ": null
    },
    {
        "John 42": "john 19"
    },
    {
        ":42 it is possible that Pilate held the title friend of Caesar , a title also held by the Jewish kings ": null
    },
    {
        "Herod Agrippa I": "herod agrippa i"
    },
    {
        " and ": null
    },
    {
        "Herod Agrippa II": "herod agrippa ii"
    },
    {
        " and by close advisors to the emperor. Both Daniel Schwartz and Alexander Demandt do not think this information especially likely.         Various disturbances during Pilates governship are recorded in the sources. In some cases, it is unclear if they may be referring to the same event, and it is difficult to establish a chronology of events for Pilates rule. Joan Taylor argues that Pilate had a policy of promoting the ": null
    },
    {
        "imperial cult": "imperial cult of ancient rome"
    },
    {
        ", which may have caused some of the friction with his Jewish subjects. Schwartz suggests that Pilates entire tenure was characterized by continued underlying tension between governor and governed, now and again breaking out in brief incidents.      According to Josephus in his  The Jewish War  and  Antiquities of the Jews  , Pilate offended the Jews by moving imperial standards with the image of Caesar into Jerusalem. This resulted in a crowd of Jews surrounding Pilates house in Caesarea for five days. Pilate then summoned them to an ": null
    },
    {
        "arena": "arena"
    },
    {
        ", where the Roman soldiers drew their swords. But the Jews showed so little fear of death, that Pilate relented and removed the standards. Bond argues that the fact that Josephus says that Pilate brought in the standards by night, shows that he knew that the images of the emperor would be offensive. She dates this incident to early in Pilates tenure as governor. Daniel Schwartz and Alexander Demandt both suggest that this incident is in fact identical with the incident with the shields reported in Philos Embassy to Gaius, an identification first made by the early church historian ": null
    },
    {
        "Eusebius": "eusebius"
    },
    {
        ". Lémonon, however, argues against this identification.     According to Philos Embassy to Gaius , Pilate offended against ": null
    },
    {
        "Jewish law": "halakha"
    },
    {
        " by bringing golden shields into Jerusalem, and placing them on ": null
    },
    {
        "Herods Palace": "herods palace"
    },
    {
        ". The sons of ": null
    },
    {
        "Herod the Great": "herod the great"
    },
    {
        " petitioned him to remove the shields, but Pilate refused. Herods sons then threatened to petition the emperor, an action which Pilate feared that would expose the crimes he had committed in office. He did not prevent their petition. Tiberius received the petition and angrily reprimanded Pilate, ordering him to remove the shields. Helen Bond, Daniel Schwartz, and ": null
    },
    {
        "Warren Carter": "warren carter"
    },
    {
        " argue that Philos portrayal is largely stereotyped and rhetorical, portraying Pilate with the same words as other opponents of Jewish law, while portraying Tiberius as just and supportive of Jewish law. It is unclear why the shields offended against Jewish law: it is likely that they contained an inscription referring to Tiberius as  . Bond dates the incident to 42 CE, sometime after Sejanuss death in October 42     In another incident recorded in both the Jewish Wars and the Antiquities of the Jews , Josephus relates that Pilate offended the Jews by using up the ": null
    },
    {
        "temple treasury": "temple treasury"
    },
    {
        "  to pay for a new aqueduct to Jerusalem. When a mob formed while Pilate was visiting Jerusalem, Pilate ordered his troops to beat them with clubs; many perished from the blows or from being trampled by horses, and the mob was dispersed. The dating of the incident is unknown, but Bond argues that it must have occurred between 42 and 42 or 42 CE, based on Josephuss chronology.     The Gospel of Luke mentions in passing Galileans whose blood Pilate had mingled with their sacrifices . This reference has been variously interpreted as referring to one of the incidents recorded by Josephus, or to an entirely unknown incident. Bond argues that the number of Galileans killed does not seem to have been particularly high. In Bonds view, the reference to sacrifices likely means that this incident occurred at ": null
    },
    {
        "Passover": "passover"
    },
    {
        " at some unknown date. She argues that is not only possible but quite likely that Pilates governorship contained many such brief outbreaks of trouble about which we know nothing. The insurrection in which ": null
    },
    {
        "Barabbas": "barabbas"
    },
    {
        " was caught up, if historical, may well be another example.              At the ": null
    },
    {
        "Passover": "passover"
    },
    {
        " of most likely 42 or 42 CE, Pontius Pilate condemned ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " of Nazareth to death by ": null
    },
    {
        "crucifixion": "crucifixion"
    },
    {
        " in Jerusalem. The main sources on the crucifixion are the four canonical Christian ": null
    },
    {
        "Gospel": "gospel"
    },
    {
        "s, the accounts of which vary. Helen Bond argues that   the evangelists portrayals of Pilate have been shaped to a great extent by their own particular theological and apologetic concerns. Legendary or theological additions have also been made to the narrative Despite extensive differences, however, there is a certain agreement amongst the evangelists regarding the basic facts, an agreement which may well go beyond literary dependency and reflect actual historical events.   Pilates role in condemning Jesus to death is also attested by the Roman historian ": null
    },
    {
        "Tacitus": "tacitus on christ"
    },
    {
        ", who, when explaining ": null
    },
    {
        "Nero": "nero"
    },
    {
        "s persecution of the Christians, explains: Christus, the founder of the name, had undergone the death penalty in the reign of Tiberius, by sentence of the procurator Pontius Pilate, and the pernicious ": null
    },
    {
        "superstition": "superstition"
    },
    {
        " was checked for a moment... . The authenticity of this passage has been disputed, and it is possible that Tacitus received this information from Christian informants. Josephus appears also ": null
    },
    {
        "to have mentioned Jesus": "josephus on jesus"
    },
    {
        "s execution by Pilate at the request of prominent Jews . However, the original text has been greatly altered by later ": null
    },
    {
        "Christian interpolation": "christian interpolation"
    },
    {
        ", so that it is impossible to know what Josephus may have originally said. Discussing the paucity of extra-biblical mentions of the crucifixion, Alexander Demandt argues that the execution of Jesus was probably not seen as a particularly important event by the Romans, as many other people were crucified at the time and forgotten.     Bond argues that Jesuss arrest was made with Pilates prior knowledge and involvement, based on the presence of a 42-strong Roman cohort among the party that arrests Jesus in John 42. Demandt dismisses the notion that Pilate was involved. It is generally assumed, based on the unanimous testimony of the gospels, that the crime for which Jesus was brought to Pilate and executed was sedition, founded on his claim to be ": null
    },
    {
        "king of the Jews": "kings of israel and judah"
    },
    {
        ". Pilate may have judged Jesus according to the  cognitio  , a form of trial for ": null
    },
    {
        "capital punishment": "capital punishment"
    },
    {
        " used in the Roman provinces and applied to ": null
    },
    {
        "non-Roman citizens": "roman citizenship"
    },
    {
        " that provided the prefect with greater flexibility in handling the case. All four gospels also mention that Pilate had the custom of releasing one captive in honor of the ": null
    },
    {
        "Passover": "passover"
    },
    {
        " festival; this custom is not attested in any other source. Historians disagree on whether or not such a custom is a fictional element of the gospels, reflects historical reality, or perhaps represents a single ": null
    },
    {
        "amnesty": "amnesty"
    },
    {
        " in the year of Jesuss crucifixion.        The Gospels portrayal of Pilate is widely assumed to diverge greatly from that found in Josephus and Philo, as Pilate is portrayed as reluctant to execute Jesus and pressured to do so by the crowd and Jewish authorities. John P. Meier notes that in Josephus, by contrast, Pilate alone is said to condemn Jesus to the cross.  Some scholars believe that the Gospel accounts are completely untrustworthy: S. G. F. Brandon argued that in reality, rather than vacilating on condemning Jesus, Pilate unhesitatingly executed him as a rebel. Paul Winter explained the discrepancy between Pilate in other sources and Pilate in the gospels by arguing that Christians became more and more eager to portray Pontius Pilate as a witness to Jesus innocence, as persecution of Christians by the Roman authorities increased. ": null
    },
    {
        "Bart Ehrman": "bart ehrman"
    },
    {
        " argues that the earliest Gospel, Mark, shows the Jews and Pilate to be in agreement about executing Jesus , while the later gospels progressively reduce Pilates culpability, culminating in Pilate allowing the Jews to crucify Jesus in John . He connects this change to increased anti-Judaism.  Others have tried to explain Pilates behavior in the Gospels as motivated by a change of circumstances from that shown in Josephus and Philo, usually presupposing a connection between Pilates caution and the death of Sejanus. Yet other scholars, such as Brian McGing and Bond, have argued that there is no real discrepancy between Pilates behavior in Josephus and Philo and that in the Gospels. Warren Carter argues that Pilate is portrayed as skillful, competent, and manipulative of the crowd in Mark, Matthew, and John, only finding Jesus innocent and executing him under pressure in Luke.       According to Josephus Antiquities of the Jews , Pilates removal as governor occurred after Pilate slaughtered a group of armed ": null
    },
    {
        "Samaritans": "samaritans"
    },
    {
        " at a village called Tirathana near ": null
    },
    {
        "Mount Gerizim": "mount gerizim"
    },
    {
        ", where they hoped to find artifacts that had been buried there by ": null
    },
    {
        "Moses": "moses"
    },
    {
        ". Alexander Demandt suggests that the leader of this movement may have been ": null
    },
    {
        "Dositheos": "dositheos"
    },
    {
        ", a ": null
    },
    {
        "messiah": "messiah"
    },
    {
        "-like figure among the Samaritans who was known to have been active around this time. The Samaritans, claiming not to have been armed, complained to ": null
    },
    {
        "Lucius Vitellius the Elder": "lucius vitellius the elder"
    },
    {
        ", the ": null
    },
    {
        "governor of Syria": "list of roman governors of syria"
    },
    {
        " , who had Pilate recalled to Rome to be judged by Tiberius. Tiberius however, had died before his arrival. This dates the end of Pilates governorship to 42/42 CE. Tiberius died in ": null
    },
    {
        "Misenum": "misenum"
    },
    {
        " on 42 March AD  42 in his seventy-eighth year . Karen Cokayne, Experiencing Old Age In Ancient Rome, p.42     Following Tiberiuss death, Pilates hearing would have been handled by the new emperor ": null
    },
    {
        "Gaius Caligula": "gaius caligula"
    },
    {
        ": it is unclear whether any hearing took place, as new emperors often dismissed outstanding legal matters from previous reigns. The only sure outcome of Pilates return to Rome is that he was not reinstated as governor of Judaea, either because the hearing went badly, or because Pilate did not wish to return. J. P. Lémonon argues that the fact that Pilate was not reinstated by Caligula does not mean that his trial went badly, but may simply have been because after ten years in the position it was time for him to take a new posting. Joan Taylor, on the other hand, argues that Pilate seems to have ended his career in disgrace, using his unflattering portrayal in Philo, written only a few years after his dismissal, as proof.        The church historian ": null
    },
    {
        "Eusebius": "eusebius"
    },
    {
        " , writing in the early fourth century, claims that tradition relates that Pilate committed suicide after he was recalled to Rome due to the disgrace he was in. Eusebius dates this to 42 CE. Paul Maier notes that no other surviving records corroborate Pilates suicide, which is meant to document Gods wrath for Pilates role in the crucifixion, and that Eusebius explicitly states that tradition is his source, indicating that he had trouble documenting Pilates presumed suicide . Daniel Schwartz, however, argues that Eusebiuss claims should not lightly be dismissed.  More information on the potential fate of Pontius Pilate can be gleaned from other sources. The second-century pagan philosopher ": null
    },
    {
        "Celsus": "celsus"
    },
    {
        " polemically asked why, if Jesus was God, God had not punished Pilate, indicating that he did not believe that Pilate shamefully committed suicide. Responding to Celsus, the Christian apologist ": null
    },
    {
        "Origen": "origen"
    },
    {
        ", writing c. 42 CE, argued that nothing bad happened to Pilate, because the Jews and not Pilate were responsible for Jesus death; he therefore also assumed that Pilate did not die a shameful death. Pilates supposed suicide is also left unmentioned in Josephus, Philo, or Tacitus. Maier argues that all probability, then, the fate of Pontius Pilate lay clearly in the direction of a retired government official, a pensioned Roman ex-magistrate, than in anything more disastrous.  Taylor notes that Philo discusses Pilate as though he were already dead in the Embassy to Gaius, although he is writing only a few years after Pilates tenure as governor.          A single inscription by Pilate has survived in Caesarea, on the so-called ": null
    },
    {
        "Pilate Stone": "pilate stone"
    },
    {
        " . The inscription is as follows:        Vardaman freely translates it as follows: Tiberium Pontius Pilate, Prefect of Judea . The fragmentary nature of the inscription has led to some disagreement about the correct reconstruction, so that apart from Pilate’s name and title the inscription is unclear.  Originally, the inscription would have included an abbreviated letter for Pilates ": null
    },
    {
        "praenomen": "praenomen"
    },
    {
        " . The stone attests Pilates title of prefect and the inscription appears to refer to some kind of building called a Tiberieum, a word otherwise unattested but following a pattern of naming buildings about Roman emperors. Bond argues that we cannot be sure what kind of building this referred to. G. Alföldy argued that it was some sort of secular building, namely a lighthouse, while Joan Taylor and Jerry Vardaman argue that it was a temple dedicated to Tiberius.     A second inscription, which has since been lost, has historically been associated with Pontius Pilate. It was a fragmentary, undated inscription on a large piece of marble recorded in ": null
    },
    {
        "Ameria": "amelia, umbria"
    },
    {
        ", a village in ": null
    },
    {
        "Umbria": "umbria"
    },
    {
        ", Italy. The inscription read as follows:      :     The only clear items of text are the names Pilate and the title ": null
    },
    {
        "quattuorvir": "quattuorvir"
    },
    {
        " , a type of local city official responsible for conducting a ": null
    },
    {
        "census": "census"
    },
    {
        " every five years. The inscription was formerly found outside the church of St. Secundus, where it had been copied from a presumed original. At the turn of the twentieth century, it was generally held to be fake, a forgery in support of a local legend that Pontius Pilate died in exile in Ameria. The more recent scholars Alexander Demandt and Henry MacAdam both believe that the inscription is genuine, but attests to a person who simply had the same ": null
    },
    {
        "cognomen": "cognomen"
    },
    {
        " as Pontius Pilate. MacAdam argues that is far easier to believe that this very fragmentary inscription prompted the legend of Pontius Pilate’s association with the Italian village of Ameria than it is to posit someone forging the inscription two centuries ago—quite creatively, it would seem—to provide substance for the legend.         As governor, Pilate was responsible for minting coins in the province: he appears to have struck them in 42/42 42/42 and 42/42 CE, thus the fourth, fifth, and sixth years of his governorship. The coins belong to a type called a perutah , measured between 42 and 42mm, were minted in Jerusalem, and are fairly crudely made. Earlier coins read  on the obverse and  on the reverse, referring to the emperor Tiberius and his mother ": null
    },
    {
        "Livia": "livia"
    },
    {
        " . Following Livias death, the coins only read . As was typical of Roman coins struck in Judaea, they did not have a portrait of the emperor, though they included some pagan designs.     Attempts to identify the ": null
    },
    {
        "aqueduct": "roman aqueduct"
    },
    {
        " that is attributed to Pilate in Josephus date to the nineteenth century. In the mid twentieth century, A. Mazar tentatively identified the aqueduct as the Arrub aqueduct that brought water from ": null
    },
    {
        "Solomons Pools": "solomons pools"
    },
    {
        " to Jerusalem, an identification supported in 42 by Kenneth Lönnqvist. Lönnqvist notes that the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        "  records the destruction of an aqueduct from Solomons Pools by the ": null
    },
    {
        "Sicarii": "sicarii"
    },
    {
        ", a group of fanatical religious ": null
    },
    {
        "Zealots": "zealots"
    },
    {
        ", during the ": null
    },
    {
        "First Jewish-Roman War": "first jewish-roman war"
    },
    {
        " ; he suggests that if the aqueduct had been funded by the temple treasury as recorded in Josephus, this might explain the Sicariis targeting of this particular aqueduct.     In 42 an inscription on a thin copper-alloy sealing ring that had been discovered at ": null
    },
    {
        "Herodium": "herodium"
    },
    {
        " was uncovered using modern scanning techniques. The inscription reads  , meaning of Pilate . The name Pilatus is rare, so the ring could be associated with Pontius Pilate; however, given the cheap material, it is unlikely that he would have owned it. It is possible that the ring belonged to another individual named Pilate, or that it belonged to someone who worked for Pontius Pilate.       Due to his role in Jesus trial, Pilate became an important figure in both pagan and Christian propaganda in late antiquity. Perhaps the earliest apocryphal texts attributed to Pilate are denunciations of Christianity and of Jesus that claim to be Pilates report on the crucifixion. According to ": null
    },
    {
        "Eusebius": "eusebius"
    },
    {
        " , these texts were distributed during the persecution of Christians conducted by the emperor ": null
    },
    {
        "Maximinus II": "maximinus ii"
    },
    {
        " . None of these texts survive, but Tibor Grüll argues that their contents can be reconstructed from Christian apologetic texts.     Positive traditions about Pilate are frequent in Eastern Christianity, particularly in Egypt and Ethiopia, whereas negative traditions predominate in Western and Byzantine Christianity. Additionally, earlier Christian traditions portray Pilate more positively than later ones, a change which Ann Wroe suggests reflects the fact that, following the legalization of Christianity in the Roman Empire by the ": null
    },
    {
        "Edict of Milan": "edict of milan"
    },
    {
        " , it was no longer necessary to deflect criticism of Pilate for his role in Jesuss crucifixion onto the Jews. ": null
    },
    {
        "Bart Ehrman": "bart ehrman"
    },
    {
        ", on the other hand, argues that the tendency in the Early Church to exonerate Pilate and blame the Jews prior to this time reflects an increasing anti-Judaism among Early Christians. The earliest attestation of a positive tradition about Pilate comes from the late first-, early second-century Christian author ": null
    },
    {
        "Tertullian": "tertullian"
    },
    {
        ", who, claiming to have seen Pilates report to Tiberius, states Pilate had become already a Christian in his conscience.  An earlier reference to Pilates records of Jesuss trial is given by Christian apologist ": null
    },
    {
        "Justin Martyr": "justin martyr"
    },
    {
        " around 42 CE. Tibor Grüll believes that this could be a reference to Pilates actual records, but other scholars argue that Justin has simply invented the records as a source on the assumption that they existed without ever having verified their existence.       Beginning in the fourth century, a large body of Christian apocryphal texts developed concerning Pilate, making up one of the largest groups of surviving ": null
    },
    {
        "New Testament Apocrypha": "new testament apocrypha"
    },
    {
        ". Originally, these texts served both to unburden Pilate of guilt for the death of Jesus as well as to provide more complete records of Jesuss trial. The apocryphal ": null
    },
    {
        "Gospel of Peter": "gospel of peter"
    },
    {
        " completely exonerates Pilate for the crucifixion, which is instead performed by Herod. Moreover, the text makes explicit that while Pilate washes his hands of guilt, neither the Jews nor Herod do so. The Gospel includes a scene in which the centurions who had been guarding Jesus tomb report to Pilate that Jesus has been resurrected.     The fragmentary third-century ": null
    },
    {
        "Manichaean": "manichaean"
    },
    {
        "  Gospel of Mani  has Pilate refer to Jesus as the Son of God and telling his centurions to ep this secret .     In the most common version of the passion narrative in the apocryphal ": null
    },
    {
        "Gospel of Nicodemus": "gospel of nicodemus"
    },
    {
        " , Pilate is portrayed as forced to execute Jesus by the Jews and as distraught at having done so. One version claims to have been discovered and translated by a Jewish convert named Ananias, portraying itself as the official Jewish records of the crucifixion. Another claims that the records were made by Pilate himself, relying on reports made to him by Nicodemus and ": null
    },
    {
        "Joseph of Arimathea": "joseph of arimathea"
    },
    {
        ". Some Eastern versions of the Gospel of Nicodemus claim that Pilate was born in Egypt, which likely aided his popularity there. The Christian Pilate literature surrounding the Gospel of Nicodemus includes at least fifteen late antique and early medieval texts, called the Pilate cycle , written and preserved in various languages and versions and dealing largely with Pontius Pilate. Two of these include purported reports made by Pilate to the emperor  on the crucifixion, in which Pilate recounts Jesus death and resurrection, blaming the Jews. Another purports to be an angry reply by Tiberius, condemning Pilate for his role in Jesus death. Another early text is an apocryphal letter attributed to Herod , which claims to respond to a letter from Pilate in which Pilate spoke of his remorse for Jesus crucifixion and of having had a vision of the risen Christ; Herod asks Pilate to pray for him.     In the so-called Book of the Cock, a late-antique apocryphal passion Gospel only preserved in ": null
    },
    {
        "Geez": "geez"
    },
    {
        " but translated from Arabic, Pilate attempts to avoid Jesuss execution by sending him to Herod and writing further letters arguing with Herod not to execute Jesus. Pilates family become Christians after Jesus miraculously cures Pilates daughters of their deaf-muteness. Pilate is nevertheless forced to execute Jesus by the increasingly angry crowd, but Jesus tells Pilate that he does not hold him responsible. This book enjoys a quasi-canonical status among Ethiopian Christians to this day and continues to be read beside the canonical gospels during ": null
    },
    {
        "Holy Week": "holy week"
    },
    {
        ".       Seven of the Pilate texts mention Pilates fate after the crucifixion: in three, he becomes a very positive figure, while in four he is presented as diabolically evil. A fifth-century ": null
    },
    {
        "Syriac": "syriac language"
    },
    {
        " version of the Acts of Pilate explains Pilates conversion as occurring after he has blamed the Jews for Jesus death in front of Tiberius; prior to his execution, Pilate prays to God and converts, thereby becoming a Christian martyr. In the Greek Paradosis Pilati , Pilate is arrested and martyred as a follower of Christ. His beheading is accompanied by a voice from heaven calling him blessed and saying he will be with Jesus at ": null
    },
    {
        "the Second Coming": "the second coming"
    },
    {
        ". The Evangelium Gamalielis, possibly of medieval origin and preserved in Arabic, Coptic, and ": null
    },
    {
        "Geez": "geez"
    },
    {
        ", says Jesus was crucified by Herod, whereas Pilate was a true believer in Christ who was martyred for his faith; similarly, the Martyrium Pilati, possibly medieval and preserved in Arabic, Coptic, and Geez, portrays Pilate, as well as his wife and two children, as being crucified twice, once by the Jews and once by Tiberius, for his faith.     In addition to the report on Pilates suicide in Eusebius, Grüll notes three Western apocryphal traditions about Pilates suicide. In the  Cura sanitatis Tiberii  , the emperor Tiberius is healed by an image of Jesus brought by ": null
    },
    {
        "Saint Veronica": "saint veronica"
    },
    {
        ", ": null
    },
    {
        "Saint Peter": "saint peter"
    },
    {
        " then confirms Pilates report on Jesuss miracles, and Pilate is exiled by the emperor ": null
    },
    {
        "Nero": "nero"
    },
    {
        ", after which he commits suicide. A similar narrative plays out in the  Vindicta Salvatoris  . In the Mors Pilati , Pilate was forced to commit suicide and his body thrown in the Tiber. However, the body is surrounded by demons and storms, so that it is removed from the Tiber and instead cast into the Rhone, where the same thing happens. Finally, the corpse is taken to ": null
    },
    {
        "Lausanne": "lausanne"
    },
    {
        " in modern Switzerland and buried in an isolated pit, where demonic visitations continue to occur.          Beginning in the eleventh century, more extensive legendary biographies of Pilate were written in Western Europe, adding details to information provided by the bible and apocrypha. The legend exists in many different versions and was extremely widespread in both Latin and the vernacular, and each version contains significant variation, often relating to local traditions. The earliest extant legendary biography is the De Pilato of c. 42 with three further Latin versions appearing in the mid-twelfth century, followed by many vernacular translations. Howard Martin summarizes the general content of these legendary biographies as follows: a king who was skilled in ": null
    },
    {
        "astrology": "astrology"
    },
    {
        " and named Atus lived in ": null
    },
    {
        "Mainz": "mainz"
    },
    {
        ". The king reads in the stars that he will bear a son who will rule over many lands, so he has a millers daughter named Pila brought to him whom he impregnates; Pilates name thus results from the combination of the names Pila with Atus. A few years later, Pilate is brought to his fathers court where he kills his half-brother. As a result, he is sent as a hostage to Rome, where he kills another hostage. As punishment he is sent to the island of Pontius, whose inhabitants he subjugates, thus acquiring the name Pontius Pilate. King Herod hears of this accomplishment and asks him to come to Palestine to aid his rule there; Pilate comes but soon usurps Herods power. The trial and judgment of Jesus then happens as in the gospels. The emperor in Rome is suffering from a terrible disease at this time, and hearing of Christs healing powers, sends for him only to learn from ": null
    },
    {
        "Saint Veronica": "saint veronica"
    },
    {
        " that Christ has been crucified, but she possesses a cloth with the image of his face. Pilate is taken as a prisoner with her to Rome to be judged, but every time the emperor sees Pilate to condemn him, his anger dissipates. This is revealed to be because Pilate is wearing Jesuss coat; when the coat is removed, the Emperor condemns him to death, but Pilate commits suicide first. The body is first thrown in the Tiber, but because it causes storms it is then moved to Vienne, and then thrown in a lake in the high Alps.     One important version of the Pilate legend is found in the  Golden Legend  by ": null
    },
    {
        "Jacobus de Voragine": "jacobus de voragine"
    },
    {
        " , one of the most popular books of the later Middle Ages. In the Golden Legend, Pilate is portrayed as closely associated with ": null
    },
    {
        "Judas": "judas"
    },
    {
        ", first coveting the fruit in the orchard of Judass father Ruben, then granting Judas Rubens property after Judas has killed his own father.     Several places in Western Europe have traditions associated with Pilate. The cities of ": null
    },
    {
        "Lyon": "lyon"
    },
    {
        " and ": null
    },
    {
        "Vienne": "vienne"
    },
    {
        " in modern France claim to be Pilates birthplace: Vienne has a Maison de Pilate, a Prétoire de Pilate and a Tour de Pilate. One tradition states the Pilate was banished to Vienne where a Roman ruin is associated with his tomb; according to another, Pilate took refuge in a mountain  in modern Switzerland, before eventually committing suicide in a lake on its summit. This connection to Mount Pilatus is attested from 42 onwards, while ": null
    },
    {
        "Lake Lucerne": "lake lucerne"
    },
    {
        " has been called Pilatus-See beginning in the fourteenth century. A number of traditions also connected Pilate to Germany. In addition to Mainz, ": null
    },
    {
        "Bamberg": "bamberg"
    },
    {
        ", ": null
    },
    {
        "Hausen, Upper Franconia": "hausen, upper franconia"
    },
    {
        " were also claimed to be his place of birth, while some traditions place his death in the ": null
    },
    {
        "Saarland": "saarland"
    },
    {
        ". The town of ": null
    },
    {
        "Tarragona": "tarragona"
    },
    {
        " in modern Spain possesses a first-century Roman tower, which, since the eighteenth-century, has been called the Torre del Pilatos, in which Pilate is claimed to have spent his last years. The tradition may go back to a misread Latin inscription on the tower. The cities of ": null
    },
    {
        "Huesca": "huesca"
    },
    {
        " and ": null
    },
    {
        "Seville": "seville"
    },
    {
        " are other cities in Spain associated with Pilate.     Pilate also continued to be the subject of legends in Eastern Christianity. The Byzantine chronicler ": null
    },
    {
        "George Kedrenos": "george kedrenos"
    },
    {
        " wrote that Pilate was condemned by Caligula to die by being left in the sun closed inside the skin of a freshly slaughtered cow together with a chicken, a snake, and a monkey. In a legend from medieval ": null
    },
    {
        "Rus": "rus"
    },
    {
        ", Pilate attempts in vain to save ": null
    },
    {
        "Saint Stephen": "saint stephen"
    },
    {
        " from being executed; Pilate, his wife and children have themselves baptized and bury Stephen in a guilded silver coffin. He then builds a church in the honor of Stephen, Gamaliel, and Nicodemus, who were martyred with Stephen, before he dies seven months later. In the medieval ": null
    },
    {
        "Slavonic Josephus": "slavonic josephus"
    },
    {
        ", an ": null
    },
    {
        "Old Church Slavonic": "old church slavonic"
    },
    {
        " translation of Josephus with legendary additions, Pilate kills many of Jesuss followers but finds Jesus innocent. After Jesus heals Pilates wife of a fatal illness, the Jews bribe Pilate with 42 talents to crucify Jesus.              Pilate is one of the most important figures in ": null
    },
    {
        "early Christian art": "early christian art and architecture"
    },
    {
        "; he is often given greater prominence than Jesus himself. He is, however, entirely absent from the earliest Christian art; all images postdate the emperor ": null
    },
    {
        "Constantine": "constantine"
    },
    {
        " and can be classified as early ": null
    },
    {
        "Byzantine art": "byzantine art"
    },
    {
        ". Pilate first appears in art in on a Christian ": null
    },
    {
        "sarcophagus": "sarcophagus"
    },
    {
        " in 42 CE; in the earliest depictions he is shown washing his hands without Jesus being present. In later images he is typically shown washing his hands of guilt in Jesus presence. 42 depictions of Pilate predate the sixth century and are found on ivory, in mosaics, in manuscripts as well as on sarcophagi. Pilates iconography as a seated Roman judge derives from depictions of the Roman emperor, causing him to take on various attributes of an emperor or king, including the raised seat and clothing.        The older Byzantine model of depicting Pilate washing his hands continues to appear on artwork into the tenth century; beginning in the seventh century, however, a new iconography of Pilate also emerges, which does not always show him washing his hands, includes him in additional scenes, and is based on contemporary medieval rather than Roman models. The majority of depictions from this time period come from France or Germany, belonging to ": null
    },
    {
        "Carolingian": "carolingian art"
    },
    {
        " or later ": null
    },
    {
        "Ottonian art": "ottonian art"
    },
    {
        ", and are mostly on ivory, with some in frescoes, but no longer on sculpture except in Ireland. New images of Pilate that appear in this period include depictions of the ": null
    },
    {
        "Ecce homo": "ecce homo"
    },
    {
        ", Pilates presentation of the scourged Jesus to the crowd in ": null
    },
    {
        "John 42:42": "s:bible /john19:5"
    },
    {
        ", as well as scenes deriving from the apocryphal  Acts of Pilate . Pilate also comes to feature in scenes such as the ": null
    },
    {
        "Flagellation of Christ": "flagellation of christ"
    },
    {
        ", where he is not mentioned in the Bible.        The eleventh century sees Pilate iconography spread from France and Germany to Great Britain and further into the eastern Mediterranean. Images of Pilate are found on new materials such as metal, while he appeared less frequently on ivory, and continues to be a frequent subject of gospel and psalter manuscript illuminations. Depictions continue to be greatly influenced by the Acts of Pilate, and the number of situations in which Pilate is depicted also increases. From the eleventh century onward, Pilate is frequently represented as a Jewish king, wearing a beard and a ": null
    },
    {
        "Jewish hat": "jewish hat"
    },
    {
        ". In many depictions he is no longer depicted washing his hands, or is depicted washing his hands but not in the presence of Jesus, or else he is depicted in passion scenes in which the Bible does not mention him.     Despite being venerated as a saint by the ": null
    },
    {
        "Coptic": "coptic church"
    },
    {
        " and ": null
    },
    {
        "Ethiopian Church": "ethiopian church"
    },
    {
        "es, very few images of Pilate exist in these traditions from any time period.          In the thirteenth century, depictions of the events of Christs passion came to dominate all visual art forms—these depictions of the Passion cycle do not always include Pilate, but they often do so; when he is included, he is often given stereotyped Jewish features. Pilate is typically represented in fourteen different scenes from his life; however, more than half of all thirteenth century representations of Pilate show the trial of Jesus. Pilate also comes to be frequently depicted as present at the crucifixion, by the fifteenth century being a standard element of crucifixion artwork. While many images still draw from the Acts of Pilate, the  Golden Legend  of ": null
    },
    {
        "Jacobus de Voragine": "jacobus de voragine"
    },
    {
        " is the primary source for depictions of Pilate from the second half of the thirteenth century onward. Pilate now frequently appears in illuminations for ": null
    },
    {
        "books of hours": "book of hours"
    },
    {
        ", as well as in the richly illuminated ": null
    },
    {
        "Bibles moralisées": "bible moralisée"
    },
    {
        ", which include many biographical scenes adopted from the legendary material, although Pilates washing of hands remains the most frequently depicted scene. In the , Pilate is generally depicted as a Jew. In many other images, however, he is depicted as a king or with a mixture of attributes of a Jew and a king.        The fourteenth and fifteenth centuries see fewer depictions of Pilate, although he generally appears in cycles of artwork on the passion. He is sometimes replaced by Herod, Annas, and Caiaphas in the trial scene. Depictions of Pilate in this period are mostly found in private devotional settings such as on ivory or in books; he is also a major subject in a number of panel-paintings, mostly German, and frescoes, mostly Scandinavian. The most frequent scene to include Pilate is his washing of his hands; Pilate is typically portrayed similarly to the high priests as an old, bearded man, often wearing a Jewish hat but sometimes a crown, and typically carrying a scepter. Images of Pilate were especially popular in Italy, where, however, he was almost always portrayed as a Roman, and often appears in the new medium of large-scale church paintings. Pilate continued to be represented in various manuscript picture bibles and devotional works as well, often with innovative iconography, sometimes depicting scenes from the Pilate legends. Many, mostly German, engravings and woodcuts of Pilate were created in the fifteenth century. Images of Pilate were printed in the  Biblia pauperum  , picture bibles focusing on the life of Christ, as well as the  Speculum Humanae Salvationis  , which continued to be printed into the sixteenth century.          In the ": null
    },
    {
        "modern period": "modern period"
    },
    {
        ", depictions of Pilate become less frequent, though occasional depictions are still made of his encounter with Jesus. In the sixteenth and seventeenth centuries, Pilate was frequently dressed as an Arab, wearing a turban, long robes, and a long beard, given the same characteristics as the Jews. Notable paintings of this era include ": null
    },
    {
        "Tintoretto": "tintoretto"
    },
    {
        "s Christ before Pilate , in which Pilate is given the forehead of a philosopher, and ": null
    },
    {
        "Gerrit van Honthorst": "gerrit van honthorst"
    },
    {
        "s 42 Christ before Pilate, which was later recatalogued as Christ before the High Priest due to Pilates Jewish appearance.     Following this longer period in which few depictions of Pilate were made, the increased religiosity of the mid-nineteenth century caused a slew of new depictions of Pontius Pilate to be created, now depicted as a Roman. In 42 ": null
    },
    {
        "J. M. W. Turner": "j. m. w. turner"
    },
    {
        " painted Pilate Washing His Hands, in which the governor himself is not visible, but rather only the back of his chair, with lamenting women in the foreground. One famous nineteenth-century painting of Pilate is Christ before Pilate by Hungarian painter ": null
    },
    {
        "Mihály Munkácsy": "mihály munkácsy"
    },
    {
        ": the work brought Munkácsy great fame and celebrity in his lifetime, making his reputation and being popular in the United States in particular, where the painting was purchased. In 42 Munkácsy painted a second painting featuring Christ and Pilate, Ecce homo, which however was never exhibited in the United States; both paintings portray Jesuss fate as in the hands of the crowd rather than Pilate. The most famous of nineteenth-century pictures  of Pilate is What is truth?  by the Russian painter ": null
    },
    {
        "Nikolai Ge": "nikolai ge"
    },
    {
        ", which was completed in 42; the painting was banned from exhibition in Russia in part because the figure of Pilate was identified as representing the ": null
    },
    {
        "tsarist": "tsarist"
    },
    {
        " authorities. In 42 Ge painted another another painting, Golgotha, in which Pilate is represented only by his commanding hand, sentencing Jesus to death. The ": null
    },
    {
        "Scala sancta": "scala sancta"
    },
    {
        ", supposedly the staircase from Pilates praetorium, now located in Rome, is flanked by a life-sized sculpture of Christ and Pilate in the Ecce homo scene made in the nineteenth century by the Italian sculptor ": null
    },
    {
        "Ignazio Jacometti": "ignazio jacometti"
    },
    {
        ".     The image of Pilate condemning Jesus to death is commonly encountered today as the first scene of the ": null
    },
    {
        "Stations of the Cross": "stations of the cross"
    },
    {
        ", first found in ": null
    },
    {
        "Franciscan": "franciscan"
    },
    {
        " Catholic church": "catholic church"
    },
    {
        "es in the seventeenth century and found in almost all Catholic churches since the nineteenth century. The Catholic Encyclopedia . s.v. .       Pilate plays a major role in the medieval ": null
    },
    {
        "passion play": "passion play"
    },
    {
        ". He is frequently depicted as a more important character to the narrative than even Jesus, and became one of the most important figures of medieval drama in the fifteenth century. The three most popular scenes in the plays to include Pilate are his washing of hands, the warning of his wife Procula not to harm Jesus, and the writing of the titulus on Jesus cross. Pilates characterization varies greatly from play to play, but later plays frequently portray Pilate somewhat ambiguously, though he is usually a negative character, and sometimes an evil villain. While in some plays Pilate is opposed to the Jews and condemns them, in others he describes himself as a Jew or supports their wish to kill Christ.     In the passion plays from the continental Western Europe, Pilates characterization varies from good to evil, but he is mostly a benign figure. The earliest surviving passion play, the thirteenth-century  from ": null
    },
    {
        "Klosterneuburg": "klosterneuburg"
    },
    {
        ", portrays Pilate as a weak administrator who succumbs to the whims of the Jews in having Christ crucified. Pilate goes on to play an important role in the increasingly long and elaborate passion plays performed in the German-speaking countries and in France. In ": null
    },
    {
        "Arnoul Gréban": "arnoul gréban"
    },
    {
        "s fifteenth-century Passion, Pilate instructs the flagellators on how best to whip Jesus. The 42  portrays Pilate as condemning Christ to death out of fear of losing Herods friendship and to earn the Jews good will, despite his long dialogues with the Jews in which he professes Christs innocence. He eventually becomes a Christian himself. In the 42 , on the other hand, Pilate himself accuses Christ. The fifteenth-century German Benediktbeuern passion play depicts Pilate as a good friend of Herods, kissing him in a reminiscence of the kiss of Judas. Colum Hourihane argues that all of these plays supported antisemitic tropes and were written at times when persecution of Jews on the continent were high.     The fifteenth-century Roman  depicts Pilate as trying to save Jesus against the wishes of the Jews. In the Italian passion plays, Pilate never identifies himself as a Jew, condemning them in the fifteenth-century  and stressing the Jews fear of the new law of Christ.     Hourihane argues that in England, where the Jews had been expelled in 42 Pilates characterization may have been used primarily to satyrize corrupt officials and judges rather than to stoke antisemitism. In several English plays, Pilate is portrayed speaking French or Latin, the languages of the ruling classes and the law. In the Wakefield plays, Pilate is portrayed as wickedly evil, describing himself as Satans agent  while plotting Christs torture so as to extract the most pain. He nonetheless washes his hands of guilt after the tortures have been administered. In the fifteenth-century English Townley Cycle, Pilate is portrayed as a pompous lord and prince of the Jews, but also as forcing Christs torturer to give him Christs clothes at the foot of the cross. It is he alone who wishes to kill Christ rather than the high priests, conspiring together with Judas. In the fifteenth-century English York passion play, Pilate judges Jesus together with ": null
    },
    {
        "Annas": "annas"
    },
    {
        " and ": null
    },
    {
        "Caiaphas": "caiaphas"
    },
    {
        ", becoming a central character of the passion narrative who converses with and instructs other characters. In this play, when Judas comes back to Pilate and the priests to tell them he no longer wishes to betray Jesus, Pilate browbeats Judas into going through with the plan. Not only does Pilate force Judas to betray Christ, he double-crosses him and refuses to take him on as a servant once Judas has done so. Moreover, Pilate also swindles his way into possession of the ": null
    },
    {
        "Potters field": "potters field"
    },
    {
        ", thus owning the land on which Judas commits suicide. In the York passion cycle, Pilate describes himself as a courtier, but in most English passion plays he proclaims his royal ancestry. The actor who portrayed Pilate in the English plays would typically speak loudly and authoritatively, a fact which was parodied in ": null
    },
    {
        "Geoffrey Chaucer": "geoffrey chaucer"
    },
    {
        "s  Canterbury Tales .     The fifteenth century also sees Pilate as a character in plays based on legendary material: one, , exists in two dramatic treatments focusing on the horrible fates that befell Christs tormenters: it portrays Pilate being tied to a pillar, covered with oil and honey, and then slowly dismembered over 42 days; he is carefully tended to so that he does not die until the end. Another play focusing on Pilates death is Cornish and based on the . The  by ": null
    },
    {
        "Jean Michel": "jean michel"
    },
    {
        " includes legendary scenes of Pilates life before the passion.       Pontius Pilate appears as a character in a large number of literary works, typically as a character in the judgment of Christ. One of the earliest literary works in which he plays a large role is French writer ": null
    },
    {
        "Anatole France": "anatole france"
    },
    {
        "s 42 short story  , which portrays an elderly Pilate who has been banished to ": null
    },
    {
        "Sicily": "sicily"
    },
    {
        ". There he lives happily as a farmer and is looked after by his daughter, but suffers from gout and obesity and broods over his time as governor of Judaea. Spending his time at the baths of ": null
    },
    {
        "Baiae": "baiae"
    },
    {
        ", Pilate is unable to remember Jesus at all.     Pilate makes a brief appearance in the preface to ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        "s 42 play  On the Rocks  where he argues against Jesus about the dangers of revolution and of new ideas. Shortly afterwards, French writer ": null
    },
    {
        "Roger Caillois": "roger caillois"
    },
    {
        " wrote a novel Pontius Pilate , in which Pilate acquits Jesus.     Pilate features prominently in Russian author ": null
    },
    {
        "Mikhail Bulgakov": "mikhail bulgakov"
    },
    {
        "s novel  The Master and Margarita , which was written in the 42s but only published in 42 twenty six years after the authors death. Henry I. MacAdam describes it as the cult classic of Pilate-related fiction.  The work features a novel within the novel about Pontius Pilate and his encounter with Jesus by an author only called the Master. Because of this subject matter, the Master has been attacked for Pilatism by the Soviet literary establishment and he has tried to burn his manuscript. Five chapters of the novel are featured as chapters of The Master and Margarita. In them, Pilate is portrayed as wishing to save Jesus, being affected by his charisma, but too cowardly to do so. Russian critics in the 42s interpreted this Pilate as a model of the spineless provincial bureaucrats of Stalinist Russia.  Pilate becomes obsessed with his guilt for having killed Jesus. Because he betrayed his desire to follow his morality and free Jesus, Pilate must suffer for eternity. Pilates burden of guilt is finally lifted by the Master, who alone can release him when encounters him at the end of Bulgakovs novel.     The majority of literary texts about Pilate come from the time after the Second World War, a fact which Alexander Demandt suggests shows a cultural dissatisfaction with Pilate having washed his hands of guilt. One of Swiss writer ": null
    },
    {
        "Friedrich Dürrenmatt": "friedrich dürrenmatt"
    },
    {
        "s earliest stories portrays Pilate as aware that he is torturing God in the trial of Jesus. Swiss playwright ": null
    },
    {
        "Max Frisch": "max frisch"
    },
    {
        "s comedy  portrays Pilate as a skeptical intellectual who refuses to take responsibility for the suffering he has caused. The German Catholic novelist ": null
    },
    {
        "Gertrud von Le Fort": "gertrud von le fort"
    },
    {
        "s  portrays Pilates wife as converting to Christianity after attempting to save Jesus and assuming Pilates guilt for herself; Pilate executes her as well.     In 42 Soviet-Kyrgiz writer ": null
    },
    {
        "Chingiz Aitmatov": "chingiz aitmatov"
    },
    {
        " published a novel in Russian featuring Pilate titled  . The novel centers on an extended dialogue between Pilate and Jesus witnessed in a vision by the narrator Avdii Kallistratov, a former seminarian. Pilate is presented as an materialist pessimist who believes mankind will soon destroy itself, whereas Jesus offers a message of hope. Among other topics, the two anachronistically discuss the meaning of the last judgment and the second coming; Pilate fails to comprehend Jesuss teachings and is complacent as he sends him to his death.       Pilate has been depicted in a number of films, being included in portrayals of Christs passion already in some of the earliest films produced. In the 42 silent film  The King of Kings , Pilate is played by Hungarian-American actor ": null
    },
    {
        "Victor Varconi": "victor varconi"
    },
    {
        ", who is introduced seated under an enormous 42 feet high ": null
    },
    {
        "Roman eagle": "aquila"
    },
    {
        ", which Christopher McDonough argues symbolizes not power that he possesses but power that possesses him . During the Ecce homo scene, the eagle stands in the background between Jesus and Pilate, with a wing above each figure; after hesitantly condemning Jesus, Pilate passes back to the eagle, which is now framed beside him, showing his isolation in his decision and, McDonough suggests, causing the audience to question how well he has served the emperor.     The film  The Last Days of Pompeii  portrays Pilate as a representative of the gross materialism of the Roman empire , with the actor ": null
    },
    {
        "Basil Rathbone": "basil rathbone"
    },
    {
        " giving him long fingers and a long nose. Following the Second World War, Pilate and the Romans often take on a villainous role in American film. The 42 film  The Robe  portrays Pilate as completely covered with gold and rings as a sign of Roman decadence. The 42 film  Ben-Hur  shows Pilate presiding over a chariot race, in a scene that Ann Wroe says seemed closely modeled on the Hitler footage of the ": null
    },
    {
        "42 Olympics": "1936 summer olympics"
    },
    {
        ", with Pilate bored and sneering. Martin Winkler, however, argues that Ben-Hur provides a more nuanced and less condemnatory portrayal of Pilate and the Roman Empire than most American films of the period.        Only one film has been made entirely in Pilates perspective, the 42 French-Italian  Ponzio Pilato , where Pilate was played by ": null
    },
    {
        "Jean Marais": "jean marais"
    },
    {
        ". In the 42 film ": null
    },
    {
        "Jesus Christ Superstar": "jesus christ superstar"
    },
    {
        ", the trial of Jesus takes place in the ruins of a Roman theater, suggesting the collapse of Roman authority and the collapse of all authority, political or otherwise . The Pilate in the film, played by ": null
    },
    {
        "Barry Dennen": "barry dennen"
    },
    {
        ", expands on ": null
    },
    {
        "John 42:42": "john 18:38"
    },
    {
        " to question Jesus on the truth and appears, in McDonoughs view, as an anxious representative of moral relativism . Speaking of Dennens portrayal in the trial scene, McDonough describes him as a cornered animal.  Wroe argues that later Pilates took on a sort of effeminancy, illustrated by the Pilate in  Monty Pythons Life of Brian , where Pilate lisps and mispronounces his rs as ws. In ": null
    },
    {
        "Martin Scorsese": "martin scorsese"
    },
    {
        "s  The Last Temptation of Christ  , Pilate is played by ": null
    },
    {
        "David Bowie": "david bowie"
    },
    {
        ", who appears as a gaunt and eerily hermaphrodite.  Bowies Pilate speaks with a British accent, contrasting with the American accent of Jesus . The trial takes place in Pilates private stables, implying that Pilate does not think the judgment of Jesus very important, and no attempt is made to take any responsibility from Pilate for Jesuss death, which he orders without any qualms.     ": null
    },
    {
        "Mel Gibson": "mel gibson"
    },
    {
        "s 42 film  The Passion of the Christ  portrays Pilate, played by ": null
    },
    {
        "Hristo Shopov": "hristo shopov"
    },
    {
        ", as a sympathetic, noble-minded character, fearful that the Jewish priest Caiaphas will start an uprising if he does not give in to his demands. He expresses disgust at the Jewish authorities treatment of Jesus when Jesus is brought before him and offers Jesus a drink of water. McDonough argues that Shopov gives US a very subtle Pilate, one who manages to appear alarmed though not panicked before the crowd, but who betrays far greater misgivings in private conversation with his wife.        Pontius Pilate is mentioned as having been involved in the crucifixion in both the ": null
    },
    {
        "Nicene Creed": "nicene creed"
    },
    {
        " and the ": null
    },
    {
        "Apostles Creed": "apostles creed"
    },
    {
        ". The Apostles Creed states that Jesus suffered under Pontius Pilate, was crucified, died, and was buried.  The Nicene Creed states For our sake was crucified under Pontius Pilate; he suffered death and was buried. ": null
    },
    {
        "Nicene Creed in English": "s:nicene creed"
    },
    {
        " These creeds are recited weekly by many Christians. Pilate is the only person besides Jesus and ": null
    },
    {
        "Mary": "mary, mother of jesus"
    },
    {
        " mentioned by name in the creeds.     He is venerated as a saint by the ": null
    },
    {
        "Ethiopian Church": "ethiopian orthodox tewahedo church"
    },
    {
        " with a feast day on June 42 and by the ": null
    },
    {
        "Coptic Church": "coptic church"
    },
    {
        ", with a feast day of June 42     Pilates washing his hands of responsibility for Jesuss death in Matthew 42:42 is a commonly encountered image in the popular imagination, and is the origin of the English phrase ": null
    },
    {
        " to wash ones hands of ": "wiktionary:wash ones hands of"
    },
    {
        ", meaning to refuse further involvement with or responsibility for something. Parts of the dialogue attributed to Pilate in the ": null
    },
    {
        "Gospel of John": "gospel of john"
    },
    {
        " have become particularly famous sayings, especially quoted in the Latin version of the ": null
    },
    {
        "Vulgate": "vulgate"
    },
    {
        ". These include  , ": null
    },
    {
        "John 42:42": "john 18:38"
    },
    {
        " , ": null
    },
    {
        "John 42:42": "john 19verse 5"
    },
    {
        " ,  , and  .     The Gospels deflection of responsibility for Jesuss crucifixion from Pilate to the Jews has been blamed for fomenting ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        " from the Middle Ages through the nineteenth and twentieth centuries.       The main ancient sources on Pilate offer very different views on his governorship and personality. Philo is hostile, Josephus mostly neutral, and the Gospels comparatively friendly.  This, combined with the general lack of information on Pilates long time in office, has resulted in a wide range of assessments by modern scholars.     On the basis of the many offenses that Pilate caused to the Judaean populace, some scholars find Pilate to have been a particularly bad governor. M. P. Charlesworth argues that Pilate was a man whose character and capacity fell below those of the ordinary provincial official in ten years he had piled blunder on blunder in his scorn for and misunderstanding of the people he was sent to rule.  However, Paul Maier argues that Pilates long term as governor of Judaea indicates he must have been a reasonably competent administrator, while Henry MacAdam argues that ong the Judaean governors prior to the Jewish War, Pilate must be ranked as more capable than most.  Other scholars have argued that Pilate was simply culturally insensitive in his interactions with the Jews and in this way a typical Roman official.     Beginning with E. Stauffer in 42 scholars have argued, on the basis of his possible appointment by ": null
    },
    {
        "Sejanus": "sejanus"
    },
    {
        ", that Pilates offenses against the Jews were directed by Sejanus out of hatred of the Jews and a desire to destroy their nation, a theory supported by the pagan imagery on Pilates coins. According to this theory, following Sejanuss execution in 42 CE and Tiberiuss purges of his supporters, Pilate, fearful of being removed himself, became far more cautious, explaining his apparently weak and vaciliating attitude at the trial of Jesus. Helen Bond argues that ven the history of pagan designs throughout Judaean coinage, particularly from Herod and Gratus, Pilates coins do not seem to be deliberately offensive,  and that the coins offer little evidence of any connection between Pilate and Sejanus. Carter notes this theory arose in the context of the aftermath of the ": null
    },
    {
        "Holocaust": "holocaust"
    },
    {
        ", that the evidence that Sejanus was anti-Semitic depends entirely on Philo, and that st scholars have not been convinced that it is an accurate or a fair picture of Pilate. ": null
    }
]