[
    {
        "              Pope Innocent II , born Gregorio Papareschi, was head of the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        " and ruler of the ": null
    },
    {
        "Papal States": "papal states"
    },
    {
        " from 14 February 1130 to his death in 1143. His election was controversial and the first eight years of his reign were marked by a struggle for recognition against the supporters of ": null
    },
    {
        "Antipope Anacletus II": "antipope anacletus ii"
    },
    {
        ". He reached an understanding with ": null
    },
    {
        "Lothair II, Holy Roman Emperor": "lothair ii, holy roman emperor"
    },
    {
        " who supported him against Anacletus and whom he crowned ": null
    },
    {
        "King of the Romans": "king of the romans"
    },
    {
        ". Innocent went on to preside over the ": null
    },
    {
        "Second Lateran council": "second council of the lateran"
    },
    {
        ".       Papareschi came from a Roman family, probably of the ": null
    },
    {
        "rione Trastevere": "trastevere"
    },
    {
        ". He was probably one of the clergy in personal attendance on the ": null
    },
    {
        "Antipope Clement III": "antipope clement iii"
    },
    {
        " .     ": null
    },
    {
        "Pope Urban II": "pope urban ii"
    },
    {
        " made him a ": null
    },
    {
        "cardinal deacon": "cardinal deacon"
    },
    {
        " in ": null
    },
    {
        "1088": "1088"
    },
    {
        ". In this capacity, he accompanied ": null
    },
    {
        "Pope Gelasius II": "pope gelasius ii"
    },
    {
        " when he was driven into France. New Schaff-Herzog Encyclopedia, vol. 5, s.v. Onnocent II . He was selected by ": null
    },
    {
        "Pope Callixtus II": "pope callixtus ii"
    },
    {
        " for various important and difficult missions, such as the one to ": null
    },
    {
        "Worms": "worms, germany"
    },
    {
        " for the conclusion of the ": null
    },
    {
        "Concordat of Worms": "concordat of worms"
    },
    {
        ", the peace accord made with ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        " Henry V": "henry v, holy roman emperor"
    },
    {
        " in 1122, and also the one to France in 1123 that made peace with King ": null
    },
    {
        "Louis VI": "louis vi of france"
    },
    {
        ".            In 1130, as ": null
    },
    {
        "Pope Honorius II": "pope honorius ii"
    },
    {
        " lay dying, the cardinals decided to entrust the election to a commission of eight men led by papal chancellor Haimeric, who had his candidate Cardinal Gregory Papareschi hastily elected as Pope Innocent II. The  Historia Compostelana , composed in Galicia for the bishop of Santiago de Compostela, provides information on the details of the disputed election of 1130. He was consecrated on 14 February, the day after Honorius death. The other cardinals announced that Innocent had not been canonically elected and chose Cardinal Pietro Pierleoni, a Roman whose family were the enemy of Haimerics supporters, the Frangipani; Pierleoni took the name ": null
    },
    {
        "Pope Anacletus II": "pope anacletus ii"
    },
    {
        ". Anacletus mixed group of supporters were powerful enough to take control of Rome while Innocent was forced to flee north. Based on a simple majority of the entire college of cardinals, Anacletus was the canonically elected pope, and Innocent was the anti-Pope. However, the ": null
    },
    {
        "legislation of Pope Nicholas II": "in nomine domini"
    },
    {
        " pre-empted the choice of the majority of the cardinal priests and cardinal deacons. This rule was changed by the ": null
    },
    {
        "Second Lateran council": "second council of the lateran"
    },
    {
        " of 1139.       Anacletus had control of Rome, so Innocent II took ship for ": null
    },
    {
        "Pisa": "pisa"
    },
    {
        ", and thence sailed by way of ": null
    },
    {
        "Genoa": "genoa"
    },
    {
        " to France, where the influence of ": null
    },
    {
        "Bernard of Clairvaux": "bernard of clairvaux"
    },
    {
        " readily secured his cordial recognition by the clergy and the court. In October of the same year he was duly acknowledged by Holy Roman Emperor ": null
    },
    {
        "Lothair III": "lothair iii, holy roman emperor"
    },
    {
        " and his bishops at the synod of ": null
    },
    {
        "Würzburg": "würzburg"
    },
    {
        ". In January 1131, he had also a favourable interview with ": null
    },
    {
        "Henry I of England": "henry i of england"
    },
    {
        ", and in August 1132 Lothar III undertook an expedition to Italy for the double purpose of setting aside Anacletus as ": null
    },
    {
        "antipope": "antipope"
    },
    {
        " and of being crowned by Innocent. Anacletus and his supporters being in secure control of ": null
    },
    {
        "St. Peters Basilica": "st. peters basilica"
    },
    {
        ", the coronation ultimately took place in the Lateran Church , but otherwise the expedition proved abortive. At the investiture of Lothair as Emperor he gained the territories belonging to ": null
    },
    {
        "Matilda of Tuscany": "matilda of tuscany"
    },
    {
        " in return for an annuity to be paid to the pope, in consequence of which the curial party based the contention that the Emperor was a ": null
    },
    {
        "vassal": "vassal"
    },
    {
        " of the Papal see. Schaff-Herzog, ibid.     A second expedition by Lothar III in 1136 was not more decisive in its results, and the protracted struggle between the rival pontiffs was terminated only by the death of Anacletus II on 25 January 1138.          Innocent took as ": null
    },
    {
        "cardinal-nephew": "cardinal-nephew"
    },
    {
        " first his nephew, ": null
    },
    {
        "Gregorio Papareschi": "gregorio papareschi"
    },
    {
        ", whom he elevated to cardinal in 1134, and then his brother ": null
    },
    {
        "Pietro Papareschi": "pietro papareschi"
    },
    {
        ", whom he elevated to cardinal in 1142. Miranda, Salvator. 1998. . Another nephew, Cinzio Papareschi , was also a cardinal, raised to the cardinalate in 1158, after Innocents death. Miranda, Salvator. 1998. .       By the ": null
    },
    {
        "Second Lateran council": "second council of the lateran"
    },
    {
        " of 1139, at which King ": null
    },
    {
        "Roger II of Sicily": "roger ii of sicily"
    },
    {
        ", Innocent IIs most uncompromising foe, was ": null
    },
    {
        "excommunicated": "excommunication"
    },
    {
        ", peace was at last restored to the Church. Aside from the complete rebuilding of the ancient church of ": null
    },
    {
        "Santa Maria in Trastevere": "santa maria in trastevere"
    },
    {
        ", which boldly features Ionic capitals from former colonnades in the ": null
    },
    {
        "Baths of Caracalla": "baths of caracalla"
    },
    {
        " and other richly detailed spolia from Roman monuments, Dale Kinney, Spolia from the Baths of Caracalla in Sta. Maria in Trastevere , The Art Bulletin 68.3 . the remaining years of this Popes life were almost as barren of permanent political results as the first had been. His efforts to undo the mischief wrought in Rome by the long schism were almost entirely neutralized by a quarrel with his erstwhile supporter, ": null
    },
    {
        "Louis VII of France": "louis vii of france"
    },
    {
        " over the candidate for ": null
    },
    {
        "archbishop of Bourges": "archbishop of bourges"
    },
    {
        ", in the course of which that kingdom was laid under an ": null
    },
    {
        "interdict": "interdict"
    },
    {
        " to press for the papal candidate, and by a struggle with the town of ": null
    },
    {
        "Tivoli": "tivoli, italy"
    },
    {
        " in which he became involved. As a result, Roman factions that wished Tivoli annihilated took up arms against Innocent.     It was also in 1139 that, in the  Omne Datum Optimum , Innocent II declared that the ": null
    },
    {
        "Knights Templar": "knights templar"
    },
    {
        "—a religious and military organization then twenty-one years old—should in the future be answerable only to the papacy. This was a keystone in the Templars ever increasing power and wealth, and ironically helped to bring about their violent suppression in October 1307.     Can. 29 of the ": null
    },
    {
        "Second Lateran Council": "second lateran council"
    },
    {
        " under Pope Innocent II in 1139 banned the use of crossbows, as well as slings and bows, against Christians. The sources are collected in Hefele, Histoire des conciles dapres les documents originaux, trans. and continued by H. Leclerq 1907–52., 5/1, 721–722; but see also, Bernhardi Jahrbuecher der deutschen Geschichte, I Leipzig 1883, 154–160:        On 22 July 1139, at ": null
    },
    {
        "Galluccio": "galluccio"
    },
    {
        ", Roger IIs son ": null
    },
    {
        "Roger III, Duke of Apulia": "roger iii, duke of apulia"
    },
    {
        ", ambushed the papal troops with a thousand knights and captured Innocent. On 25 July 1139, Innocent was forced to acknowledge the kingship and possessions of Roger with the ": null
    },
    {
        "Treaty of Mignano": "treaty of mignano"
    },
    {
        ". In 1143, Innocent refused to recognise the ": null
    },
    {
        "Treaty of Mignano": "treaty of mignano"
    },
    {
        " with Roger of Sicily, who sent ": null
    },
    {
        "Robert of Selby": "robert of selby"
    },
    {
        " to march on papal ": null
    },
    {
        "Benevento": "benevento"
    },
    {
        ". The terms agreed upon at Mignano were then recognised. Innocent II died on 24 September 1143 and was succeeded by ": null
    },
    {
        "Pope Celestine II": "pope celestine ii"
    },
    {
        ".     The doctrinal questions which he was called on to decide were those that condemned the opinions of ": null
    },
    {
        "Pierre Abélard": "pierre abélard"
    },
    {
        " and of ": null
    },
    {
        "Arnold of Brescia": "arnold of brescia"
    },
    {
        ".     In 1143, as the Pope lay dying, the ": null
    },
    {
        "Commune of Rome": "commune of rome"
    },
    {
        ", to resist papal power, began deliberations that officially reinstated the ": null
    },
    {
        "Roman Senate": "roman senate"
    },
    {
        " the following year. The Pope was interred in a porphyry sarcophagus that contemporary tradition asserted had been the Emperor ": null
    },
    {
        "Hadrian": "hadrian"
    }
]