[
    {
        "        Pope Miltiades , also known as Melchiades the African , was ": null
    },
    {
        "Pope": "pope"
    },
    {
        " of the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        " from 311 to his death in 314. It was during his pontificate that ": null
    },
    {
        "Emperor ConstantineI": "constantine the great"
    },
    {
        " issued the ": null
    },
    {
        "Edict of Milan": "edict of milan"
    },
    {
        " , giving ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " legal status within the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ". The Pope also received the palace of ": null
    },
    {
        "Empress Fausta": "fausta"
    },
    {
        " where the ": null
    },
    {
        "Lateran Palace": "lateran palace"
    },
    {
        ", the papal seat and residence of the papal administration, would be built. At the ": null
    },
    {
        "Lateran Council": "lateran council"
    },
    {
        ", during the schism with the ": null
    },
    {
        "Church of Carthage": "church of carthage"
    },
    {
        ", Miltiades condemned the rebaptism of ": null
    },
    {
        "apostatised": "apostasy"
    },
    {
        " bishops and priests, teaching of ": null
    },
    {
        "Donatus Magnus": "donatus magnus"
    },
    {
        ".       The year of Miltiades birth is unknown but it is known that he was of North African ": null
    },
    {
        "Berber": "berbers"
    },
    {
        " descent and, according to the  Liber Pontificalis , compiled from the 5th century onwards, a ": null
    },
    {
        "Roman": "roman empire"
    },
    {
        " citizen. Miltiades and his successor, ": null
    },
    {
        "Sylvester I": "pope sylvester i"
    },
    {
        ", were part of the clergy of ": null
    },
    {
        "Pope Marcellinus": "pope marcellinus"
    },
    {
        ". It has been suggested that he was a party to the alleged apostasy of Pope Marcellinus, which was repudiated by ": null
    },
    {
        "Augustine of Hippo": "augustine of hippo"
    },
    {
        ". This view originated from letters, dated to between 400 and 410, written by ": null
    },
    {
        "Donatist": "donatism"
    },
    {
        " Bishop ": null
    },
    {
        "Petilianus": "petilianus"
    },
    {
        " of Constantine, who claimed that Marcellinus, along with Miltiades and Sylvester, surrendered sacred texts and offered incense to Roman deities.         In April 311, the ": null
    },
    {
        "Edict of Toleration": "edict of toleration by galerius"
    },
    {
        " was issued in ": null
    },
    {
        "Serdica": "sofia"
    },
    {
        " by the Roman emperor ": null
    },
    {
        "Galerius": "galerius"
    },
    {
        ", officially ending the ": null
    },
    {
        "Diocletianic Persecution": "diocletianic persecution"
    },
    {
        " of Christianity.     The election of Miltiades to the papacy on 2 July 311, according to the ": null
    },
    {
        "Liberian Catalogue": "liberian catalogue"
    },
    {
        ", marked the end of a  sede vacante , the vacancy of the papacy, following the death of ": null
    },
    {
        "Pope Eusebius": "pope eusebius"
    },
    {
        " on 17 August 310 or 309 according to Liber Pontificalis not long after his exile to Sicily by the Emperor ": null
    },
    {
        "Maxentius": "maxentius"
    },
    {
        ". After his election, Church property that was confiscated during the Diocletianic Persecution was restored by Maxentius. This order, however, probably did not extend to all of the parts of Maxentius jurisdiction.     The Liber Pontificalis, attributed the introduction of several later customs to Miltiades, such as not fasting on Thursdays or Sundays, although subsequent scholarship now believes the customs likely pre-dated Miltiades. Miltades prescribed the distribution of portions of the bread consecrated by the Pope at all of the churches around Rome, the ": null
    },
    {
        "fermentum": "fermentum"
    },
    {
        ", as a sign of unity.     In October 312, ": null
    },
    {
        "Constantine": "constantine the great"
    },
    {
        " defeated Maxentius at the ": null
    },
    {
        "Battle of the Milvian Bridge": "battle of the milvian bridge"
    },
    {
        " to become emperor. He later presented the Pope with the palace of Empress ": null
    },
    {
        "Fausta": "fausta"
    },
    {
        ", where the ": null
    },
    {
        "Lateran Palace": "lateran palace"
    },
    {
        ", the papal residence and seat of central Church administration, would be built.     Being the first ": null
    },
    {
        "Pope under Constantine": "bishops of rome under constantine i"
    },
    {
        ", his pontificate coincided with the peace Constantine gave to the Church. In February 313, Constantine and ": null
    },
    {
        "Licinius": "licinius"
    },
    {
        ", emperor of the eastern part of the Roman Empire, agreed to extend tolerance of Christianity to Licinius territory, proclaimed by the ": null
    },
    {
        "Edict of Milan": "edict of milan"
    },
    {
        ". Consequently, Christians not only attained the freedom of worship, but also all places of Christian worship were restored and all confiscated property returned.         During Miltiades tenure as pontiff, a ": null
    },
    {
        "schism": "schism"
    },
    {
        " over the election of Bishop ": null
    },
    {
        "Caecilianus": "caecilianus"
    },
    {
        " split the ": null
    },
    {
        "Church of Carthage": "church of carthage"
    },
    {
        ". The opposing parties were those of Caecilianus, who was supported by Rome, and of ": null
    },
    {
        "Donatus": "donatus magnus"
    },
    {
        ", mainly clergymen from North Africa who demanded that schismatics, and heretics, be re-baptised and re-ordained before taking office, the central issue dividing ": null
    },
    {
        "Donatists": "donatism"
    },
    {
        " and Catholics. The supporters of Donatus appealed to Constantine and requested that judges from ": null
    },
    {
        "Gaul": "gaul"
    },
    {
        " be assigned to adjudicate. Constantine agreed and commissioned Miltiades together with three Gallic bishops to resolve the dispute, the first time an emperor had interfered in church affairs. Miltiades, unwilling to jeopardise his relationship with the Emperor, but also unwilling to preside over a council with an uncertain outcome, changed the proceedings into a regular church synod and appointed an additional 15 Italian bishops.     The ": null
    },
    {
        "Lateran Council": "lateran council"
    },
    {
        " was held for three days from 2–4 October 313. The process was modeled on Roman civil proceedings, with Miltiades insisting on strict rules of evidence and argument. This frustrated the Donatists who left the council without presenting their case, which led Miltiades to rule in favour of Caecilianus by default. The council thus ended after only three sessions. The Pope retained Caecilianus as Bishop of Carthage and condemned Donatus teachings of rebaptism of bishops and priests. The adverse rulings failed to stop the continuing spread of Donatism across North Africa.     The Donatists again appealed to the Emperor, who responded by convening the ": null
    },
    {
        "Council of Arles": "council of arles"
    },
    {
        " in 314 but it too ruled against the Donatists. By the time the council was convened, Miltiades had died on 10 or 11 January 314. He had been succeeded by ": null
    },
    {
        "Sylvester I": "pope sylvester i"
    },
    {
        ". He was buried in the ": null
    },
    {
        "Catacomb of Callixtus": "catacomb of callixtus"
    },
    {
        " at the ": null
    },
    {
        "Appian Way": "appian way"
    },
    {
        " and venerated as a saint. Licinius, who promulgated the Edict of Milan, violated the edict in 320 by persecuting Christians, sacking them from public offices, forbidding synods and condoning executions. A civil war broke out between him and Constantine, with Constantine eventually defeating him in 324.         The feast of Miltiades in the 4th century, according to the Martyrologium Hieronymianum, was celebrated on 10 January. In the 13th century, the feast of Saint Melchiades was included, with the mistaken qualification of martyr , in the ": null
    },
    {
        "General Roman Calendar": "general roman calendar"
    },
    {
        " for celebration on 10 December. In 1969, the celebration was removed from that calendar of obligatory liturgical celebrations, and moved to the day of his death, 10 January, with his name given in the form Miltiades but without the indication martyr .": null
    }
]