[
    {
        "Pope Formosus  was ": null
    },
    {
        "Cardinal-bishop": "cardinal-bishop"
    },
    {
        " and ": null
    },
    {
        "Pope": "pope"
    },
    {
        ", his papacy lasting from 6 October 891 to his death in 896. His brief reign as Pope was troubled, marked by interventions in power struggles over the ": null
    },
    {
        "Patriarchate of Constantinople": "ecumenical patriarchate of constantinople"
    },
    {
        ", the ": null
    },
    {
        "kingdom of West Francia": "west francia"
    },
    {
        ", and the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ". Formosuss remains were ": null
    },
    {
        "exhumed": "exhumation"
    },
    {
        " and put on trial in the ": null
    },
    {
        "Cadaver Synod": "cadaver synod"
    },
    {
        ".       Probably a native of Rome, Formosus was born around 816. He became ": null
    },
    {
        "Cardinal Bishop": "cardinal bishop"
    },
    {
        " of ": null
    },
    {
        "Porto": "roman catholic suburbicarian diocese of porto-santa rufina"
    },
    {
        " in 864. Two years later, ": null
    },
    {
        "Pope Nicholas I": "pope nicholas i"
    },
    {
        " appointed him a papal legate to ": null
    },
    {
        "Bulgaria": "bulgaria"
    },
    {
        " . He also undertook diplomatic missions to ": null
    },
    {
        "France": "france"
    },
    {
        " .     Upon the death of ": null
    },
    {
        "Louis II of Italy": "louis ii of italy"
    },
    {
        " in 875, the nobles elected his uncle, ": null
    },
    {
        "Charles the Bald": "charles the bald"
    },
    {
        ", King of the Franks to be the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ". Formosus conveyed ": null
    },
    {
        "Pope John VIIIs": "pope john viii"
    },
    {
        "invitation for King Charles to come to Rome to be crowned emperor. Charles took the crown at Pavia and received the imperial insignia in Rome on 29 December. Those who favored the widowed ": null
    },
    {
        "Empress Engelberga": "engelberga"
    },
    {
        " or her brother-in-law, ": null
    },
    {
        "Louis the German": "louis the german"
    },
    {
        ", did not support the coronation. Fearing political retribution, many of them left Rome surreptitiously. Formosus fled to Tours after despoiling the cloisters in Rome. On April 19, John VIII called a synod which ordered Formosus and other papal officials to return to Rome. When Formosus did not comply, he was removed from the ranks of the clergy and excommunicated on the grounds that he had deserted his diocese without papal permission, and had aspired to the position of Archbishop of Bulgaria. Additional charges included the accusations that he had opposed the emperor; conspired with certain iniquitous men and women for the destruction of the Papal See ; and had despoiled the ": null
    },
    {
        "cloisters": "cloister"
    },
    {
        "in Rome.     The condemnation of Formosus and others was announced in July 872. In 878 the sentence of excommunication was withdrawn after he promised never to return to Rome or exercise his priestly functions. : And it is not unlikely that it was because John VIII. saw that Formosus might easily become the tool of designing men  – or that at least the faction which had secured his interest might cloak their nefarious plans under the good name of the Bishop of Porto  – that he forbade him to come to Rome again.     In 867, while Formosus was serving as legate to the Bulgarian court, Prince Bogoris requested that he be named Archbishop of Bulgaria. Since the canons forbade a bishop to leave his own see to undertake the government of another, the request was denied. As early as 872 he was a candidate for the papacy; ": null
    },
    {
        "Johann Peter Kirsch": "johann peter kirsch"
    },
    {
        " suggests that the Pope may have viewed the cardinal as a potential rival.     In 883, Johns successor, Pope Marinus I, restored Formosus to his ": null
    },
    {
        "suburbicarian": "suburbicarian"
    },
    {
        " diocese of Portus": "diocese of portus"
    },
    {
        ". Following the reigns of Marinus, ": null
    },
    {
        "Pope Hadrian III": "pope hadrian iii"
    },
    {
        " and ": null
    },
    {
        "Pope Stephen V": "pope stephen v"
    },
    {
        " , Formosus was unanimously elected Pope on 6 October 891.       Shortly after Formosus election, he was asked to intervene in ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ", where ": null
    },
    {
        "Patriarch Photius I": "photius i of constantinople"
    },
    {
        " had been ejected and ": null
    },
    {
        "Stephen": "stephen i of constantinople"
    },
    {
        ", the son of Emperor ": null
    },
    {
        "Basil I": "basil i"
    },
    {
        ", had taken the office. Formosus refused to reinstate those who had been ordained by Photius, as his predecessor, Stephen V, had nullified all of Photius ordinations. However, the eastern Bishops determined to recognize Photius ordinations nonetheless.     Formosus also immediately immersed himself in the dispute between ": null
    },
    {
        "Odo, Count of Paris": "odo, count of paris"
    },
    {
        ", and ": null
    },
    {
        "Charles the Simple": "charles the simple"
    },
    {
        " for the ": null
    },
    {
        "French": "france"
    },
    {
        " crown; the Pope sided with Charles, and zealously exhorted Odo to abdicate on Charles behalf, to no avail.     Formosus was deeply distrustful of ": null
    },
    {
        "Guy III of Spoleto": "guy iii of spoleto"
    },
    {
        ", the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ", and began looking for support against the Emperor. To bolster his position, Guy III forced Formosus to crown his son ": null
    },
    {
        "Lambert": "lambert ii of spoleto"
    },
    {
        " as co-Emperor in April 892. The following year, however, Formosus persuaded ": null
    },
    {
        "Arnulf of Carinthia": "arnulf of carinthia"
    },
    {
        " to advance to Rome, invade the Italian peninsula, and liberate ": null
    },
    {
        "Italy": "italy"
    },
    {
        " from the control of Spoleto.     In 894, Arnulfs army occupied all the country north of the ": null
    },
    {
        "Po River": "po river"
    },
    {
        ". Guy III of Spoleto died in December, leaving his son Lambert in the care of his mother ": null
    },
    {
        "Agiltrude": "agiltrude"
    },
    {
        ", an opponent of the ": null
    },
    {
        "Carolingian": "carolingian"
    },
    {
        "s. In autumn 895 Arnulf undertook his second Italian campaign, progressing to Rome by February and seizing the city from Agiltrude by force on February 21. The following day, Formosus crowned Arnulf Holy Roman Emperor in ": null
    },
    {
        "St. Peters Basilica": "old st. peters basilica"
    },
    {
        ". The new emperor moved against Spoleto but was struck with ": null
    },
    {
        "paralysis": "paralysis"
    },
    {
        " on the way and was unable to continue the campaign.     During his papacy he also had to contend with the ": null
    },
    {
        "Saracens": "saracens"
    },
    {
        ", who were attacking ": null
    },
    {
        "Lazio": "lazio"
    },
    {
        ".     On 4 April 896, Formosus died. He was succeeded by ": null
    },
    {
        "Pope Boniface VI": "pope boniface vi"
    },
    {
        ".             ": null
    },
    {
        "Pope Stephen VI": "pope stephen vi"
    },
    {
        ", the successor of Boniface, influenced by Lambert and Agiltrude, sat in judgment of Formosus in 897, in what was called the ": null
    },
    {
        "Cadaver Synod": "cadaver synod"
    },
    {
        ". The corpse was disinterred, clad in papal vestments, and seated on a throne to face all the charges from John VIII. The verdict was that the deceased had been unworthy of the pontificate. The , an old judicial practice from ": null
    },
    {
        "Ancient Rome": "ancient rome"
    },
    {
        ", was applied to Formosus, all his measures and acts were annulled and the orders conferred by him were declared invalid. The papal vestments were torn from his body, the three fingers from his right hand he had used in blessings were cut off and the corpse was thrown into the ": null
    },
    {
        "Tiber": "tiber"
    },
    {
        " .     Following the death of Stephen VI, Formosus body was reinterred in ": null
    },
    {
        "St Peters Basilica": "st peters basilica"
    },
    {
        ". Further trials of this nature against deceased persons were banned, but ": null
    },
    {
        "Pope Sergius III": "pope sergius iii"
    },
    {
        " reapproved the decisions against Formosus. Sergius demanded the re-ordination of the bishops consecrated by Formosus, who in turn had conferred orders on many other clerics, causing great confusion. Later the validity of Formosus work was re-reinstated. The decision of Sergius with respect to Formosus has subsequently been universally disregarded by the ": null
    },
    {
        "Church": "catholic church"
    },
    {
        ", since Formosus condemnation had little to do with piety and more to do with politics.     Bartolomeo Platina writes that Sergius had the much-abused corpse of Formosus exhumed once more, tried, found guilty again, and beheaded, thus in effect conducting a second Cadaver Synod, : Nor was he content with thus dishonouring the dead Pope but he drags his carcass again out of the grave, beheads it as if it had been alive, and then throws it into the Tiber, as unworthy the honour of human burial. while Joseph Brusher says that Sergius indulged in no resurrection-man tactics himself  and ": null
    },
    {
        "Schaff": "philip schaff"
    },
    {
        ", ": null
    },
    {
        "Milman": "henry hart milman"
    },
    {
        ",": null
    },
    {
        "Gregorovius": "ferdinand gregorovius"
    },
    {
        ", ": null
    },
    {
        "von Mosheim": "johann lorenz von mosheim"
    },
    {
        ",    ": null
    },
    {
        "Miley": "john miley"
    },
    {
        ", Mann, ": null
    },
    {
        "Darras": "joseph-epiphane darras"
    },
    {
        ", ": null
    },
    {
        "John the Deacon of Naples": "john, deacon of naples"
    },
    {
        ", ": null
    },
    {
        "Flodoard": "flodoard"
    }
]