[
    {
        "In ": null
    },
    {
        "science": "science"
    },
    {
        ", specifically ": null
    },
    {
        "statistical mechanics": "statistical mechanics"
    },
    {
        ", a population inversion occurs while a ": null
    },
    {
        "system": "thermodynamic system"
    },
    {
        "  exists in a state in which more members of the system are in higher, ": null
    },
    {
        "excited states": "excited state"
    },
    {
        " than in lower, unexcited ": null
    },
    {
        "energy state": "energy state"
    },
    {
        "s. It is called an inversion because in many familiar and commonly encountered physical systems, this is not possible. This concept is of fundamental importance in ": null
    },
    {
        "laser science": "laser science"
    },
    {
        " because the production of a population inversion is a necessary step in the workings of a standard ": null
    },
    {
        "laser": "laser"
    },
    {
        ".       To understand the concept of a population inversion, it is necessary to understand some ": null
    },
    {
        "thermodynamics": "thermodynamics"
    },
    {
        " and the way that ": null
    },
    {
        "light": "light"
    },
    {
        " interacts with ": null
    },
    {
        "matter": "matter"
    },
    {
        ". To do so, it is useful to consider a very simple assembly of ": null
    },
    {
        "atoms": "atom"
    },
    {
        "forming a ": null
    },
    {
        "laser medium": "active laser medium"
    },
    {
        ".     Assume there are a group of N atoms, each of which is capable of being in one of two ": null
    },
    {
        "energy state": "energy state"
    },
    {
        "s: either   The ground state, with energy E 1 ; or   The excited state, with energy E 2 , with E 2 & gt; E 1 .   The number of these atoms which are in the ": null
    },
    {
        "ground state": "ground state"
    },
    {
        " is given by N 1 , and the number in the excited state N 2 . Since there are N atoms in total,   : N_1+N_2 N   The energy difference between the two states, given by   : \\Delta E_ E_2-E_1,   determines the characteristic ": null
    },
    {
        "frequency": "frequency"
    },
    {
        " \\nu_ of light which will interact with the atoms; This is given by the relation   : E_2-E_1 \\Delta E_ h\\nu_,   h being ": null
    },
    {
        "Plancks constant": "plancks constant"
    },
    {
        ".     If the group of atoms is in ": null
    },
    {
        "thermal equilibrium": "thermal equilibrium"
    },
    {
        ", it can be shown from ": null
    },
    {
        "Maxwell–Boltzmann statistics": "maxwell–boltzmann statistics"
    },
    {
        " that the ratio of the number of atoms in each state is given by the ratio of two ": null
    },
    {
        "Boltzmann distribution": "boltzmann distribution"
    },
    {
        "s, the Boltzmann factor:   : \\frac \\exp,   where T is the ": null
    },
    {
        "thermodynamic temperature": "thermodynamic temperature"
    },
    {
        " of the group of atoms, and k is ": null
    },
    {
        "Boltzmanns constant": "boltzmann constant"
    },
    {
        ".     We may calculate the ratio of the populations of the two states at ": null
    },
    {
        "room temperature": "room temperature"
    },
    {
        "  for an energy difference ΔE that corresponds to light of a frequency corresponding to visible light . In this case ΔE E 2 - E 1 ≈ 2.07  eV, and kT ≈ 0.026  eV. Since E 2 - E 1 ≫ kT, it follows that the argument of the exponential in the equation above is a large negative number, and as such N 2 /N 1 is vanishingly small; i.e., there are almost no atoms in the excited state. When in thermal equilibrium, then, it is seen that the lower energy state is more populated than the higher energy state, and this is the normal state of the system. As T increases, the number of electrons in the high-energy state  increases, but N 2 never exceeds N 1 for a system at thermal equilibrium; rather, at infinite temperature, the populations N 2 and N 1 become equal. In other words, a population inversion  can never exist for a system at thermal equilibrium. To achieve population inversion therefore requires pushing the system into a non-equilibrated state.       There are three types of possible interactions between a system of atoms and light that are of interest:            If light  of ": null
    },
    {
        "frequency": "frequency"
    },
    {
        " ν 12 passes through the group of atoms, there is a possibility of the light being absorbed by electrons which are in the ground state, which will cause them to be excited to the higher energy state. The rate of absorption is ": null
    },
    {
        "proportional": "proportionality"
    },
    {
        " to the radiation intensity of the light, and also to the number of atoms currently in the ground state, N 1 .          If atoms are in the excited state, spontaneous decay events to the ground state will occur at a rate proportional to N 2 , the number of atoms in the excited state. The energy difference between the two states ΔE 21 is emitted from the atom as a photon of frequency ν 21 as given by the frequency-energy relation above.     The photons are emitted ": null
    },
    {
        "stochastic": "stochastic"
    },
    {
        "ally, and there is no fixed ": null
    },
    {
        "phase": "phase"
    },
    {
        " relationship between photons emitted from a group of excited atoms; in other words, spontaneous emission is ": null
    },
    {
        "incoherent": "coherence"
    },
    {
        ". In the absence of other processes, the number of atoms in the excited state at time t, is given by   : N_2 N_2 \\exp,   where N 2 is the number of excited atoms at time t    0, and τ 21 is the  mean lifetime  of the transition between the two states.          If an atom is already in the excited state, it may be agitated by the passage of a photon that has a ": null
    },
    {
        "frequency": "frequency"
    },
    {
        " ν 21 corresponding to the energy gap ΔE of the excited state to ground state transition. In this case, the excited atom relaxes to the ground state, and it produces a second photon of frequency ν 21 . The original photon is not absorbed by the atom, and so the result is two photons of the same frequency. This process is known as stimulated emission.     Specifically, an excited atom will act like a small electric dipole which will oscillate with the external field provided. One of the consequences of this oscillation is that it encourages electrons to decay to the lowest energy state. When this happens due to the presence of the electromagnetic field from a photon, a photon is released in the same phase and direction as the stimulating photon, and is called stimulated emission.          The rate at which stimulated emission occurs is proportional to the number of atoms N 2 in the excited state, and the radiation density of the light. The base probability of a photon causing stimulated emission in a single excited atom was shown by ": null
    },
    {
        "Albert Einstein": "albert einstein"
    },
    {
        " to be exactly equal to the probability of a photon being absorbed by an atom in the ground state. Therefore, when the numbers of atoms in the ground and excited states are equal, the rate of stimulated emission is equal to the rate of absorption for a given radiation density.     The critical detail of stimulated emission is that the induced photon has the same ": null
    },
    {
        "frequency": "frequency"
    },
    {
        " and ": null
    },
    {
        "phase": "phase"
    },
    {
        " as the incident photon. In other words, the two photons are ": null
    },
    {
        "coherent": "coherence"
    },
    {
        ". It is this property that allows ": null
    },
    {
        "optical amplification": "optical amplifier"
    },
    {
        ", and the production of a ": null
    },
    {
        "laser": "laser"
    },
    {
        " system. During the operation of a laser, all three light-matter interactions described above are taking place. Initially, atoms are energized from the ground state to the excited state by a process called  pumping , described below. Some of these atoms decay via spontaneous emission, releasing incoherent light as photons of frequency, ν. These photons are fed back into the laser medium, usually by an ": null
    },
    {
        "optical resonator": "optical cavity"
    },
    {
        ". Some of these photons are absorbed by the atoms in the ground state, and the photons are lost to the laser process. However, some photons cause stimulated emission in excited-state atoms, releasing another coherent photon. In effect, this results in optical amplification.     If the number of photons being amplified per unit time is greater than the number of photons being absorbed, then the net result is a continuously increasing number of photons being produced; the laser medium is said to have a gain of greater than unity.     Recall from the descriptions of absorption and stimulated emission above that the rates of these two processes are proportional to the number of atoms in the ground and excited states, N 1 and N 2 , respectively. If the ground state has a higher population than the excited state , then the absorption process dominates, and there is a net attenuation of photons. If the populations of the two states are the same , the rate of absorption of light exactly balances the rate of emission; the medium is then said to be optically transparent.     If the higher energy state has a greater population than the lower energy state , then the emission process dominates, and light in the system undergoes a net increase in intensity. It is thus clear that to produce a faster rate of stimulated emissions than absorptions, it is required that the ratio of the populations of the two states is such that   N 2 /N 1 & gt; 1; In other words, a population inversion is required for laser operation.          Many transitions involving electromagnetic radiation are strictly forbidden under quantum mechanics. The allowed transitions are described by so-called ": null
    },
    {
        "selection rule": "selection rule"
    },
    {
        "s, which describe the conditions under which a radiative transition is allowed. For instance, transitions are only allowed if ΔS    0, S being the total spin angular momentum of the system. In real materials other effects, such as interactions with the crystal lattice, intervene to circumvent the formal rules by providing alternate mechanisms. In these systems the forbidden transitions can occur, but usually at slower rates than allowed transitions. A classic example is ": null
    },
    {
        "phosphorescence": "phosphorescence"
    },
    {
        " where a material has a ground state with S    0, an excited state with S    0, and an intermediate state with S    1. The transition from the intermediate state to the ground state by emission of light is slow because of the selection rules. Thus emission may continue after the external illumination is removed. In contrast ": null
    },
    {
        "fluorescence": "fluorescence"
    },
    {
        " in materials is characterized by emission which ceases when the external illumination is removed.     Transitions which do not involve the absorption or emission of radiation are not affected by selection rules. Radiationless transition between levels, such as between the excited S    0 and S    1 states, may proceed quickly enough to siphon off a portion of the S    0 population before it spontaneously returns to the ground state.     The existence of intermediate states in materials is essential to the technique of optical pumping of lasers .       As described above, a population inversion is required for ": null
    },
    {
        "laser": "laser"
    },
    {
        " operation, but cannot be achieved in our theoretical group of atoms with two energy-levels when they are in thermal equilibrium. In fact, any method by which the atoms are directly and continuously excited from the ground state to the excited state will eventually reach equilibrium with the de-exciting processes of spontaneous and stimulated emission. At best, an equal population of the two states, N 1 N 2 N/2, can be achieved, resulting in optical transparency but no net optical gain.          To achieve non-equilibrium conditions, an indirect method of populating the excited state must be used. To understand how this is done, we may use a slightly more realistic model, that of a three-level laser. Again consider a group of N atoms, this time with each atom able to exist in any of three energy states, levels 1, 2 and 3, with energies E 1 , E 2 , and E 3 , and populations N 1 , N 2 , and N 3 , respectively.     We assume that E 1 & lt; E 2 & lt; E 3 ; that is, the energy of level 2 lies between that of the ground state and level 3.     Initially, the system of atoms is at thermal equilibrium, and the majority of the atoms will be in the ground state, i.e., N 1 ≈ N, N 2 ≈ N 3 ≈ 0. If we now subject the atoms to light of a frequency \\scriptstyle\\nu_ \\,\\, \\frac\\left , the process of optical absorption will excite electrons from the ground state to level 3. This process is called  pumping , and does not necessarily always directly involve light absorption; other methods of exciting the laser medium, such as electrical discharge or chemical reactions, may be used. The level 3 is sometimes referred to as the pump level or pump band, and the energy transition E 1 → E 3 as the pump transition, which is shown as the arrow marked P in the diagram on the right.     Upon pumping the medium, an appreciable number of atoms will transition to level 3, such that N 3 & gt; 0. To have a medium suitable for laser operation, it is necessary that these excited atoms quickly decay to level 2. The energy released in this transition may be emitted as a photon , however in practice the 3→2 transition  is usually radiationless, with the energy being transferred to vibrational motion  of the host material surrounding the atoms, without the generation of a photon.     An electron in level 2 may decay by spontaneous emission to the ground state, releasing a photon of frequency ν 12 , which is shown as the transition L, called the laser transition in the diagram. If the lifetime of this transition, τ 21 is much longer than the lifetime of the radiationless 3 → 2 transition τ 32 , the population of the E 3 will be essentially zero  and a population of excited state atoms will accumulate in level 2  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub  sub /sub sub /sub ": null
    }
]