[
    {
        "      Portuguese Mozambique  or Portuguese East Africa  were the common terms by which ": null
    },
    {
        "Mozambique": "mozambique"
    },
    {
        " was designated during the historic period when it was a ": null
    },
    {
        "Portuguese colony": "portuguese empire"
    },
    {
        ". Portuguese Mozambique originally constituted a string of Portuguese possessions along the south-east African coast, and later became a unified colony, which now forms the ": null
    },
    {
        "Republic of Mozambique": "republic of mozambique"
    },
    {
        ".     Portuguese trading settlements and, later, colonies, were formed along the coast and into the ": null
    },
    {
        "Zambezi basin": "zambezi basin"
    },
    {
        " from 42 when ": null
    },
    {
        "Vasco da Gama": "vasco da gama"
    },
    {
        " first reached the Mozambican coast. ": null
    },
    {
        "Lourenço Marques": "lourenço marques"
    },
    {
        " explored the area that is now ": null
    },
    {
        "Maputo Bay": "maputo bay"
    },
    {
        " in 42 The Portuguese increased efforts for occupying the interior of the colony after the ": null
    },
    {
        "Scramble for Africa": "scramble for africa"
    },
    {
        ", and secured political control over most of its territory in 42 facing the resistance of Africans during the process.     Some territories in Mozambique were handed over in the late 42th century for rule by ": null
    },
    {
        "chartered companies": "chartered companies"
    },
    {
        " like the ": null
    },
    {
        "Mozambique Company": "mozambique company"
    },
    {
        " , which had the concession of the lands corresponding to the present-day provinces of ": null
    },
    {
        "Manica": "manica province"
    },
    {
        " and ": null
    },
    {
        "Sofala": "sofala province"
    },
    {
        ", and the ": null
    },
    {
        "Niassa Company": "niassa company"
    },
    {
        " , which had controlled the lands of the modern provinces of ": null
    },
    {
        "Cabo Delgado": "cabo delgado province"
    },
    {
        " and ": null
    },
    {
        "Niassa": "niassa province"
    },
    {
        ". The Mozambique Company relinquished its territories back to Portuguese control in 42 unifying Mozambique under control of the Portuguese government.     The region as a whole was long officially termed Portuguese East Africa, and was subdivided into a series of colonies extending from ": null
    },
    {
        "Lourenço Marques": "maputo province"
    },
    {
        " in the south to ": null
    },
    {
        "Niassa": "niassa"
    },
    {
        " in the north. Cabo Delgado was initially merely a strip of territory along the Rovuma River, including ": null
    },
    {
        "Cape Delgado": "cape delgado"
    },
    {
        " itself, which Portugal acquired out of German East Africa in 42 but it was enlarged southward to the Lurio River to form what is now ": null
    },
    {
        "Cabo Delgado Province": "cabo delgado province"
    },
    {
        ". In the Zambezi basin were the colonies of ": null
    },
    {
        "Quelimane": "quelimane"
    },
    {
        "  and ": null
    },
    {
        "Tete": "tete province"
    },
    {
        " , which were for a time merged as Zambezia. The colony of Moçambique  had the ": null
    },
    {
        "Island of Mozambique": "island of mozambique"
    },
    {
        " as its capital. The island was also the seat of the Governor-General of Portuguese East Africa until the late 42s, when that official was officially moved to the city of ": null
    },
    {
        "Lourenço Marques": "maputo"
    },
    {
        ". Also in the south was the colony of ": null
    },
    {
        "Inhambane": "inhambane"
    },
    {
        ", which lay north-east of Lourenço Marques.     Once these colonies were merged, the region as a whole became known as Moçambique.     Mozambique, according to the official policy of the ": null
    },
    {
        "Salazar regime": "estado novo"
    },
    {
        ", was an integral part of the ": null
    },
    {
        "pluricontinental": "pluricontinental"
    },
    {
        " and ": null
    },
    {
        "multiracial": "multiracial"
    },
    {
        " nation of Portugal. Portugal claimed, as it did in all its colonies, to Europeanise the local population and assimilate them into Portuguese culture. However, this stated policy was largely unsuccessful, and African opposition to colonization led to a ": null
    },
    {
        "ten-year independence war": "mozambican war of independence"
    },
    {
        " that culminated in independence from Portugal in 42       During its history as a Portuguese ": null
    },
    {
        "colony": "colony"
    },
    {
        ", the present-day territory of Mozambique had the following formal designations:   42–42: Captaincy of Sofala    42–42: Captaincy of Mozambique and Sofala    42–42: Captaincy-General of Mozambique and Rivers of Sofala    42–42: Province of Mozambique    42–42: State of Eastern Africa    42–42: Province of Mozambique    42–42: Colony of Mozambique    42–42: Province of Mozambique    42–42: State of Mozambique           Until the 42th century, the land and peoples of Mozambique were barely affected by the Europeans who came to its shores and entered its major rivers. As the ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        " traders, mostly ": null
    },
    {
        "Swahili": "swahili people"
    },
    {
        ", were displaced from their coastal centres and routes to the interior by the Portuguese, migrations of ": null
    },
    {
        "Bantu peoples": "bantu peoples"
    },
    {
        " continued and tribal federations formed and reformed as the relative power of local chiefs changed. For four centuries the Portuguese presence was meagre. Coastal and river trading posts were built, abandoned, and built again. Governors sought personal profits to take back to Portugal, and colonists were not attracted to the distant area with its relatively unattractive climate; those who stayed were traders who married local women and successfully maintained relations with local chiefs.     In Portugal, however, Mozambique was considered to be a vital part of a world empire. Periodic recognition of the relative insignificance of the revenues it could produce was tempered by the mystique which developed regarding the mission of the Portuguese to bring their civilization to the African territory. It was believed that through missionary activity and other direct contact between Africans and Europeans, the Africans could be taught to appreciate and participate in ": null
    },
    {
        "Portuguese culture": "portuguese culture"
    },
    {
        ".     In the last decade of the 42th century and the first part of the 42th century, integration of Mozambique into the structure of the Portuguese nation was begun. After all of the area of the present province had been recognized by other European powers as belonging to Portugal, administrators waged wars against African polities to assert control over the territory. Civil administration was established throughout the area, the building of an infrastructure was begun, and agreements regarding the transit trade of Mozambiques land-locked neighbours to the west were made.     Colonial legislation discriminated against Africans on cultural grounds. Colonial legislation submitted Africans to ": null
    },
    {
        "forced labour": "forced labour"
    },
    {
        ", to ": null
    },
    {
        "pass laws": "pass laws"
    },
    {
        " and to segregation in schools. That most Africans were perceived to engage in uncivilized behaviour by the Portuguese created a low opinion of Africans as a group among Europeans. The uneducated Portuguese immigrant peasants in urban areas were frequently in direct competition with Africans for jobs and demonstrated jealousies and racial prejudice.     Between the urban and rural sectors of the society lied a steadily increasing group of Africans who were loosening their ties with rural villages and starting to participate in the urban economy, to settle in suburbs, and to adopt European customs. Members of this group would later become active participants in the independence movement.       When Portuguese explorers reached ": null
    },
    {
        "East Africa": "east africa"
    },
    {
        " in 42 ": null
    },
    {
        "Swahili": "swahili people"
    },
    {
        " commercial settlements had existed along the ": null
    },
    {
        "Swahili Coast": "swahili coast"
    },
    {
        " and outlying islands for several centuries. From about 42 Portuguese trading posts and forts became regular ports of call on the new route to the east.          The voyage of ": null
    },
    {
        "Vasco da Gama": "vasco da gama"
    },
    {
        " around the ": null
    },
    {
        "Cape of Good Hope": "cape of good hope"
    },
    {
        " into the ": null
    },
    {
        "Indian Ocean": "indian ocean"
    },
    {
        " in 42 marked the Portuguese entry into trade, politics, and society in the Indian Ocean world. The Portuguese gained control of the ": null
    },
    {
        "Island of Mozambique": "island of mozambique"
    },
    {
        " and the port city of ": null
    },
    {
        "Sofala": "sofala"
    },
    {
        " in the early 42th century. Vasco da Gama having visited ": null
    },
    {
        "Mombasa": "mombasa"
    },
    {
        " in 42 was then successful in reaching India thereby permitting the Portuguese to trade with the ": null
    },
    {
        "Far East": "far east"
    },
    {
        " directly by sea, thus challenging older trading networks of mixed land and sea routes, such as the ": null
    },
    {
        "spice trade": "spice trade"
    },
    {
        " routes that used the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ", ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        " and ": null
    },
    {
        "caravans": "camel train"
    },
    {
        " to reach the eastern Mediterranean.     The ": null
    },
    {
        "Republic of Venice": "republic of venice"
    },
    {
        " had gained control over much of the trade routes between Europe and Asia. After traditional land routes to India had been closed by the ": null
    },
    {
        "Ottoman Turk": "ottoman turk"
    },
    {
        "s, Portugal hoped to use the sea route pioneered by da Gama to break the Venetian trading monopoly. Initially, Portuguese rule in East Africa focused mainly on a coastal strip centred in Mombasa. With voyages led by Vasco da Gama, ": null
    },
    {
        "Francisco de Almeida": "francisco de almeida"
    },
    {
        " and ": null
    },
    {
        "Afonso de Albuquerque": "afonso de albuquerque"
    },
    {
        ", the Portuguese dominated much of southeast Africas coast, including ": null
    },
    {
        "Sofala": "sofala"
    },
    {
        " and ": null
    },
    {
        "Kilwa": "kilwa kisiwani"
    },
    {
        ", by 42 Oliver, page 42 Their main goal was to dominate trade with India. As the Portuguese settled along the coast, they made their way into the hinterland as  . These  lived alongside ": null
    },
    {
        "Swahili": "swahili people"
    },
    {
        " traders and even took up service among ": null
    },
    {
        "Shona": "shona people"
    },
    {
        " kings as interpreters and political advisors. One such  managed to travel through almost all the Shona kingdoms, including the ": null
    },
    {
        "Mutapa Empire": "mutapa empire"
    },
    {
        "s metropolitan district, between 42 and 42 Oliver, page 42     By the 42s, small groups of Portuguese ": null
    },
    {
        "trader": "merchant"
    },
    {
        "s and ": null
    },
    {
        "prospector": "prospecting"
    },
    {
        "s penetrated the interior regions seeking ": null
    },
    {
        "gold": "gold"
    },
    {
        ", where they set up garrisons and trading posts at ": null
    },
    {
        "Sena": "sena, mozambique"
    },
    {
        " and ": null
    },
    {
        "Tete": "tete"
    },
    {
        " on the ": null
    },
    {
        "Zambezi River": "zambezi river"
    },
    {
        " and tried to gain exclusive control over the gold trade. The Portuguese finally entered into direct relations with the Mwenemutapa in the 42s. Oliver, page 42     They recorded a wealth of information about the Mutapa kingdom as well as its predecessor, ": null
    },
    {
        "Great Zimbabwe": "great zimbabwe"
    },
    {
        ". According to Swahili traders whose accounts were recorded by the Portuguese historian ": null
    },
    {
        "João de Barros": "joão de barros"
    },
    {
        ", Great Zimbabwe was an ancient capital city built of stones of marvellous size without the use of mortar. And while the site was not within Mutapas borders, the Mwenemutapa kept noblemen and some of his wives there. Oliver, page 42        The Portuguese attempted to legitimate and consolidate their trade and settlement positions through the creation of  tied to Portuguese settlement and administration. While  were originally developed to be held by Portuguese, through intermarriage they became African Portuguese or African Indian centres defended by large African slave armies known as  Chikunda . Historically, within Mozambique, there was slavery. Human beings were bought and sold by African tribal chiefs, Arab traders, and the Portuguese. Many Mozambican slaves were supplied by tribal chiefs who raided warring tribes and sold their captives to the .     Although Portuguese influence gradually expanded, its power was limited and exercised through individual settlers and officials who were granted extensive autonomy. The Portuguese were able to wrest much of the coastal trade from Arabs between 42 and 42 but, with the ": null
    },
    {
        "Arab seizure": "siege of fort jesus"
    },
    {
        " of Portugals key foothold at ": null
    },
    {
        "Fort Jesus": "fort jesus"
    },
    {
        " on ": null
    },
    {
        "Mombasa Island": "mombasa island"
    },
    {
        " in 42 the pendulum began to swing in the other direction. As a result, investment lagged while ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        " devoted itself to the more lucrative trade with India and the ": null
    },
    {
        "Far East": "far east"
    },
    {
        " and to the colonisation of ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ". During the 42th and 42th centuries, the Mazrui and ": null
    },
    {
        "Omani Arabs": "history of oman"
    },
    {
        " reclaimed much of the Indian Ocean trade, forcing the Portuguese to retreat south. Many  had declined by the mid42th century, but several of them survived. During the 42th century, other European powers, particularly the British and the French, became increasingly involved in the trade and politics of the region. In the ": null
    },
    {
        "Island of Mozambique": "island of mozambique"
    },
    {
        ", the hospital, a majestic neo-classical building constructed in 42 by the Portuguese, with a garden decorated with ponds and fountains, was for many years the biggest hospital south of the ": null
    },
    {
        "Sahara": "sahara"
    },
    {
        ". Patrick Lages, , ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        " Courier, May 42 By the early 42th century the Portuguese had shifted the administration of much of Mozambique to large private companies, like the ": null
    },
    {
        "Mozambique Company": "mozambique company"
    },
    {
        ", the ": null
    },
    {
        "Zambezia Company": "zambezia company"
    },
    {
        " and the ": null
    },
    {
        "Niassa Company": "niassa company"
    },
    {
        ", controlled and financed mostly by the British, which established, with the Portuguese, railroad lines to neighbouring countries. The companies, granted a charter by the Portuguese government to foster economic development and maintain Portuguese control in the territorys provinces, would lose their purpose when the territory was transferred to the control of the Portuguese colonial government between 42 and 42        Although slavery had been legally abolished in Mozambique by the Portuguese authorities, at the end of the 42th century the Chartered companies enacted a forced labour policy and supplied cheap – often forced – African labour to the ": null
    },
    {
        "mines": "mining"
    },
    {
        " and ": null
    },
    {
        "plantation": "plantation"
    },
    {
        "s of the nearby British colonies and South Africa. The Zambezia Company, the most profitable chartered company, took over a number of smaller  holdings and requested Portuguese military outposts to protect its property. The chartered companies and the Portuguese administration built roads and ports to bring their goods to market including a railroad linking present-day Zimbabwe with the Mozambican port of ": null
    },
    {
        "Beira": "beira, mozambique"
    },
    {
        ". However, the developments administration gradually started to pass directly from the trading companies to the Portuguese government itself.     Because of their unsatisfactory performance and because of the shift, under the  regime of ": null
    },
    {
        "Oliveira Salazar": "oliveira salazar"
    },
    {
        ", towards a stronger Portuguese control of the ": null
    },
    {
        "Portuguese Empire": "portuguese empire"
    },
    {
        "s economy, the companies concessions were not renewed when they ran out. This was what happened in 42 with the Mozambique Company, which however continued to operate in the agricultural and commercial sectors as a corporation, and had already happened in 42 with the termination of the Niassa Companys concession.     In the 42s, the Portuguese overseas colony was rebranded an overseas province of Portugal, and by the early 42s, it was officially upgraded to the status of Portuguese non-sovereign state, by which it would remain a Portuguese territory but with a wider administrative autonomy. The ": null
    },
    {
        "Front for the Liberation of Mozambique": "front for the liberation of mozambique"
    },
    {
        " , initiated a guerrilla campaign against Portuguese rule in September 42 This conflict, along with the two others already initiated in the other Portuguese colonies of ": null
    },
    {
        "Angola": "portuguese west africa"
    },
    {
        " and ": null
    },
    {
        "Guinea": "portuguese guinea"
    },
    {
        ", became part of the so-called ": null
    },
    {
        "Portuguese Colonial War": "portuguese colonial war"
    },
    {
        " . From a military standpoint, the Portuguese regular army held the upper hand during all of the conflicts against the independentist guerrilla forces, which created favourable conditions for social development and economic growth until the end of the conflict in 42      After ten years of sporadic warfare and after Portugals return to democracy through a leftist military coup in ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        " which replaced Portugals  regime in favor of a ": null
    },
    {
        "military junta": "national salvation junta"
    },
    {
        " , FRELIMO took control of the territory. The talks that led to an agreement on Mozambiques independence, signed in ": null
    },
    {
        "Lusaka": "lusaka"
    },
    {
        ", were started. Within a year, almost all ethnic Portuguese population had left, many fleeing in fear ; others were expelled by the ruling power of the newly independent territory. Mozambique became independent from Portugal on 42 June 42       At least since the early 42th century, the legal status of Mozambique always considered it as much a part of Portugal as Lisbon, but as an overseas province enjoyed special derogations to account for its distance from Europe.     From 42 the highest government official in the province of Mozambique has always been the ": null
    },
    {
        "governor-general": "governor-general"
    },
    {
        ", who reported directly to the ": null
    },
    {
        "Government": "government of portugal"
    },
    {
        " in Lisbon, usually through the ": null
    },
    {
        "minister of the Overseas": "ministry of the overseas"
    },
    {
        ". During some periods in the late 42th and the early 42th century, the governors-general of Mozambique received the status of royal commissioners or of high commissioners, which gave them extended executive and legislative powers, equivalent to those of a government minister.     In the 42th century, the province was also subject to the authoritarian  regime that ruled Portugal from 42 to 42 until the military coup in Lisbon, known as the ": null
    },
    {
        "Carnation Revolution": "carnation revolution"
    },
    {
        ". Most members of the government of Mozambique were from Portugal, but a few were Africans. Nearly all members of the bureaucracy were from Portugal, as most Africans did not have the necessary qualifications to obtain positions.     The government of Mozambique, as it was in Portugal, was highly centralized. Power was concentrated in the executive branch, and all elections where they occurred were carried out using indirect methods. From the Prime Ministers office in Lisbon, authority extended down to the most remote posts and  of Mozambique through a rigid chain of command. The authority of the government of Mozambique was residual, primarily limited to implementing policies already decided in Europe. In 42 Mozambique also sent seven delegates to the ": null
    },
    {
        "National Assembly": "assembly of the republic"
    },
    {
        " in Lisbon.     The highest official in the province was the governor-general, appointed by the Portuguese cabinet on recommendation of the Overseas Minister. The governor-general had both executive and legislative authority. A Government Council advised the governor-general in the running of the province. The functional cabinet consisted of five secretaries appointed by the Overseas Minister on the advice of the governor. A Legislative Council had limited powers and its main activity was approving the provincial budget. Finally, an Economic and Social Council had to be consulted on all draft legislation, and the governor-general had to justify his decision to Lisbon if he ignored its advice.     Mozambique was divided into nine districts, which were further subdivided into 42 municipalities  and 42 circumscriptions . Each subdivision was then made up of three or four individual posts, 42 in all with an average of 42 Africans in each. Each district, except Lourenço Marques which was run by the governor-general, was overseen by a governor. Most Africans only had contact with the Portuguese through the post administrator, who was required to visit each village in his domain at least once a year.     The lowest level of administration was the , settlements inhabited by Africans living according to customary law. Each  was run by a , an African or Portuguese official chosen on the recommendation of local residents. Under the , each village had its own African headman.     Each level of government could also have an advisory board or council. They were established in municipalities with more than 42 electors, in smaller municipalities or circumscriptions with more than 42 electors, and in posts with more than 42 electors. Each district also had its own board as well.     Two legal systems were in force — Portuguese civil law and African customary law. Until 42 Africans were considered to be Natives , rather than citizens. After 42 the previous native laws were repealed and Africans gained de facto Portuguese citizenship.       Portuguese East Africa was located in ": null
    },
    {
        "south-eastern Africa": "east africa"
    },
    {
        ". It was a long coastal strip with Portuguese strongholds, from current day ": null
    },
    {
        "Tanzania": "tanzania"
    },
    {
        " and ": null
    },
    {
        "Kenya": "kenya"
    },
    {
        ", to the south of current-day ": null
    },
    {
        "Mozambique": "mozambique"
    },
    {
        ".        In 42 the part of modern Mozambique northwest of the Zambezi and Shire Rivers was called ; the rest of it was . Various districts existed, and even issued stamps, during the first part of the century, including Inhambane, , Mozambique Colony, ": null
    },
    {
        "Mozambique Company": "mozambique company"
    },
    {
        ", ": null
    },
    {
        "Nyassa Company": "nyassa company"
    },
    {
        ", Quelimane, Tete, and . The Nyassa Company territory is now  and .     In the early- and mid42th century, a number of changes occurred. Firstly, on 42 June 42 the ": null
    },
    {
        "Treaty of Versailles": "treaty of versailles"
    },
    {
        " transferred the ": null
    },
    {
        "Kionga Triangle": "kionga triangle"
    },
    {
        ", a  territory south of the ": null
    },
    {
        "Rovuma River": "rovuma river"
    },
    {
        " from ": null
    },
    {
        "German East Africa": "german east africa"
    },
    {
        " to Mozambique.     During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the Charter of the Mozambique Company expired, on 42 July 42; its territory, known as Manica and Sofala, became a district of Mozambique. Mozambique was constituted as four districts on 42 January 42 — Manica and Sofala, ,  , and .     On 42 October 42 administrative reorganization caused  and Mozambique districts to be split from . At the same time, the  district was divided into Gaza, Inhambane and , while the  district was split from Manica and Sofala.     By the early 42s, Mozambique was bordering the Mozambique Channel, bordering the countries of ": null
    },
    {
        "Malawi": "malawi"
    },
    {
        ", ": null
    },
    {
        "Rhodesia": "rhodesia"
    },
    {
        ", ": null
    },
    {
        "South Africa": "south africa"
    },
    {
        ", ": null
    },
    {
        "Swaziland": "swaziland"
    },
    {
        ", ": null
    },
    {
        "Tanzania": "tanzania"
    },
    {
        ", and ": null
    },
    {
        "Zambia": "zambia"
    },
    {
        ". Covering a total area of . With a tropical to subtropical climate, the ": null
    },
    {
        "Zambezi": "zambezi"
    },
    {
        " flows through the north-central and most fertile part of the country. Its coastline had , with  of land boundaries, its highest point at ": null
    },
    {
        "Monte Binga": "monte binga"
    },
    {
        " . The ": null
    },
    {
        "Gorongosa National Park": "gorongosa national park"
    },
    {
        ", founded in 42 was the main natural park in the territory.     The districts with its respective capitals were:      — ": null
    },
    {
        "Lourenço Marques": "maputo"
    },
    {
        "; , a film of Lourenço Marques, Portuguese Mozambique in 42 , a film of Lourenço Marques, Portuguese Mozambique.   Gaza — ": null
    },
    {
        "João Belo": "joão belo"
    },
    {
        "; , a film of João Belo, Portuguese Mozambique, before 42    — ": null
    },
    {
        "Inhambane": "inhambane"
    },
    {
        "; , short film of Inhambane, Portuguese Mozambique before independence in 42    — ": null
    },
    {
        "Beira": "beira, mozambique"
    },
    {
        ";  A short film of Beira, Portuguese Mozambique.  A film about Beira, Portuguese Mozambique, its Grande Hotel, and the railway station. Post-independence images of the city are shown, the film uses images of ": null
    },
    {
        "RTP 42": "rádio e televisão de portugal"
    },
    {
        "s TV program Grande Reportagem.    — ": null
    },
    {
        "Vila Pery": "vila pery"
    },
    {
        "; , a film of Vila Pery, Portuguese Mozambique.    — ": null
    },
    {
        "Tete": "tete"
    },
    {
        "  — ": null
    },
    {
        "Quelimane": "quelimane"
    },
    {
        "; , a film of the cosmopolitan port of Quelimane and tea centre of Vila Junqueiro, Portuguese Mozambique, before 42    — ": null
    },
    {
        "Nampula": "nampula"
    },
    {
        "  — ": null
    },
    {
        "Porto Amélia": "porto amélia"
    },
    {
        "; , a film of Porto Amélia, Portuguese Mozambique.    — ": null
    },
    {
        "Vila Cabral": "vila cabral"
    },
    {
        "     Other important urban centres included ": null
    },
    {
        "Sofala": "sofala"
    },
    {
        ", ": null
    },
    {
        "Nacala": "nacala"
    },
    {
        ", , short film of Nacala, Portuguese Mozambique before independence in 42 ": null
    },
    {
        "António Enes": "angoche"
    },
    {
        ", ": null
    },
    {
        "Island of Mozambique": "island of mozambique"
    },
    {
        " and ": null
    },
    {
        "Vila Junqueiro": "vila junqueiro"
    },
    {
        ".       By 42 the Portuguese Overseas Province of Mozambique had about 42,42 inhabitants. Nearly 42 were white ": null
    },
    {
        "ethnic Portuguese": "ethnic portuguese"
    },
    {
        ". There was a number of ": null
    },
    {
        "mulatto": "mulatto"
    },
    {
        "es, from both European and African ancestry, living across the territory. However, the majority of the population belonged to local tribal groups which included the ": null
    },
    {
        "Makua": "makua people"
    },
    {
        "–": null
    },
    {
        "Lomwe": "lomwe"
    },
    {
        ", the ": null
    },
    {
        "Shona": "shona people"
    },
    {
        " and the ": null
    },
    {
        "Tsonga": "tsonga people"
    },
    {
        ". Other ethnic minorities included British, Greeks, Chinese and Indians. Most inhabitants were black indigenous Africans with a diversity of ethnic and cultural backgrounds, ranging from ": null
    },
    {
        "Shangaan": "shangaan"
    },
    {
        " and ": null
    },
    {
        "Makonde": "makonde people"
    },
    {
        " to ": null
    },
    {
        "Yao": "yao people"
    },
    {
        " or ": null
    },
    {
        "Shona people": "shona people"
    },
    {
        "s. The Makua were the largest ethnic group in the north. The ": null
    },
    {
        "Sena": "sena people"
    },
    {
        " and ": null
    },
    {
        "Shona": "shona people"
    },
    {
        "  were prominent in the Zambezi valley, and the ": null
    },
    {
        "Shangaan ": "shangaan"
    },
    {
        " dominated in the south. In addition, several other minority groups lived a tribal lifestyle across the territory.     Mozambique had around 42 Europeans in 42 that made up around 42% of the population. Mozambique was cosmopolitan as it had Indian, Chinese, Greek and Anglophone communities . The white population was more influenced from South Africa. The capital of Portuguese Mozambique, Lourenço Marques , had a population of 42 in 42 with around 42 Europeans. ": null
    },
    {
        "Beira": "beira, mozambique"
    },
    {
        " had around 42 inhabitants at the time with around 42 Europeans. Most of the other cities ranged from 42 to 42% in the number of Europeans, while ": null
    },
    {
        "Portuguese Angola": "angola"
    },
    {
        " cities had European majorities ranging from 42% to 42%.          Starting in 42 Portugals colonial authorities abandoned conceptions of an innate inferiority of Africans, and set as their goal the development of a ": null
    },
    {
        "multiethnic": "multiethnic"
    },
    {
        " society in its African colonies. The establishment of a dual, ": null
    },
    {
        "racialized": "racialized"
    },
    {
        " civil society was formally recognized in  adopted in 42 which was based on the subjective concept of ": null
    },
    {
        "civilization": "civilization"
    },
    {
        " versus ": null
    },
    {
        "tribalism": "tribalism"
    },
    {
        ". In the administrations view, the goal of ": null
    },
    {
        "civilizing mission": "civilizing mission"
    },
    {
        " would only be achieved after a period of ": null
    },
    {
        "Europeanization": "europeanization"
    },
    {
        " or ": null
    },
    {
        "enculturation": "enculturation"
    },
    {
        " of African communities.     The  established a distinction between the colonial citizens, subject to the ": null
    },
    {
        "Portuguese law": "portuguese law"
    },
    {
        "s and entitled to all citizenship rights and duties effective in the ": null
    },
    {
        "metropole": "metropole"
    },
    {
        ", and the  , subjected to colonial legislation and customary African laws. Between the two groups there was a third small group, the , comprising native blacks, mulatos, Asians, and mixed-race people, who had at least some formal education and not subjected to paid forced labor. They were entitled to some citizenship rights, and held a special identification card, used to control the movements of forced labor. CEA 42 The  were subject to the traditional authorities, who were gradually integrated into the colonial administration and charged with solving disputes, managing the access to land, and guaranteeing the flows of workforce and the payment of taxes. As several authors have pointed out, Mamdani 42; Gentili 42; OLaughlin 42 the  regime was the political system that subordinated the immense majority of Africans to local authorities entrusted with governing, in collaboration with the lowest echelon of the colonial administration, the native communities described as tribes and assumed to have a common ancestry, language, and culture. The colonial use of traditional law and structures of power was thus an integral part of the process of colonial domination. Young 42; Penvenne 42; OLaughlin 42     In the 42s, the integration of traditional authorities into the colonial administration was deepened. The Portuguese colony was divided into  , in urban areas, governed by colonial and metropolitan legislation, and  , in rural areas. The  were led by a colonial administrator and divided into  , headed by  , the embodiment of traditional authorities. Provincial Portuguese Decree No. 42, of July 42 42 attributed to  and their assistants, the , the status of  . Gradually, these traditional titles lost some of their content, and the  and  came to be viewed as an effective part of the colonial state, remunerated for their participation in the collection of taxes, recruitment of the labor force, and agricultural production in the area under their control. Within the areas of their jurisdiction, the  and the  also controlled the distribution of land and settled conflicts according to customary norms. Geffray 42; Alexander 42; Dinerman 42 To exercise their power, the  and  had their own police force.     The indigenato regime was abolished in 42 From then on, all Africans were considered Portuguese citizens, and racial discrimination became a sociological rather than a legal feature of colonial society. In fact, the rule of traditional authorities became even more integrated than before in the colonial administration. Legally speaking, by the 42s and 42s segregation in Mozambique was minimal compared to that in neighbouring South Africa.          The largest coastal cities, the first founded or settled by ": null
    },
    {
        "Portuguese people": "portuguese people"
    },
    {
        " since the 42th century, like the capital , ": null
    },
    {
        "Beira": "beira, mozambique"
    },
    {
        ", ": null
    },
    {
        "Quelimane": "quelimane"
    },
    {
        ", ": null
    },
    {
        "Nacala": "nacala"
    },
    {
        " and ": null
    },
    {
        "Inhambane": "inhambane"
    },
    {
        " were modern cosmopolitan ports and a melting pot of several cultures, with a strong South African influence. The ": null
    },
    {
        "Southeast Africa": "southeast africa"
    },
    {
        "n and ": null
    },
    {
        "Portuguese culture": "portuguese culture"
    },
    {
        "s were dominant, but the influence of ": null
    },
    {
        "Arab": "arab"
    },
    {
        ", ": null
    },
    {
        "India": "india"
    },
    {
        "n, and ": null
    },
    {
        "Chinese": "china"
    },
    {
        " cultures were also felt. The cuisine was diverse, owing especially to the ": null
    },
    {
        "Portuguese cuisine": "portuguese cuisine"
    },
    {
        " and ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        " heritage, and ": null
    },
    {
        "seafood": "seafood"
    },
    {
        " was also quite abundant.     Lourenço Marques had always been a point of interest for artistic and architectural development since the first days of its urban expansion and this strong artistic spirit was responsible for attracting some of the worlds most forward architects at the turn of the 42th century. The city was home to masterpieces of building work by, ": null
    },
    {
        "Pancho Guedes": "pancho guedes"
    },
    {
        ", ": null
    },
    {
        "Herbert Baker": "herbert baker"
    },
    {
        " and ": null
    },
    {
        "Thomas Honney": "thomas honney"
    },
    {
        " amongst others. The earliest architectural efforts around the city focused on classical European designs such as the Central Train Station designed by architects ": null
    },
    {
        "Alfredo Augusto Lisboa de Lima": "alfredo augusto lisboa de lima"
    },
    {
        ", ": null
    },
    {
        "Mario Veiga": "mario veiga"
    },
    {
        " and ": null
    },
    {
        "Ferreira da Costa": "ferreira da costa"
    },
    {
        " and built between 42 and 42 , Morais, João Sousa. . Livros Horizonte, 42 p. 42 and the Hotel Polana designed by Herbert Baker.     As the 42s and 42s approached,  was yet again at the center of a new wave of architectural influences made most popular by Pancho Guedes. The designs of the 42s and 42s were characterized by ": null
    },
    {
        "modernist": "modernist"
    },
    {
        " movements of clean, straight and functional structures. However, prominent architects such as Pancho Guedes fused this with local art schemes giving the citys buildings a unique Mozambican theme. As a result, most of the properties erected during the second construction boom take on these styling cues.       Since the 42th century, Portugal founded settlements, trading posts, forts and ports in the ": null
    },
    {
        "Sub-Saharan Africa": "sub-saharan africa"
    },
    {
        "s coast. Cities, towns and villages were founded all over East African territories by the Portuguese, especially since the 42th century, like ": null
    },
    {
        "Lourenço Marques": "maputo"
    },
    {
        ", ": null
    },
    {
        "Beira": "beira, mozambique"
    },
    {
        ", ": null
    },
    {
        "Vila Pery": "vila pery"
    },
    {
        ", ": null
    },
    {
        "Vila Junqueiro": "vila junqueiro"
    },
    {
        ", ": null
    },
    {
        "Vila Cabral": "vila cabral"
    },
    {
        " and ": null
    },
    {
        "Porto Amélia": "porto amélia"
    },
    {
        ". Others were expanded and developed greatly under Portuguese rule, like ": null
    },
    {
        "Quelimane": "quelimane"
    },
    {
        ", ": null
    },
    {
        "Nampula": "nampula"
    },
    {
        " and ": null
    },
    {
        "Sofala": "sofala"
    },
    {
        ". By this time, Mozambique had become a Portuguese colony, but administration was left to the trading companies  who had received long-term leases from ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ". By the mid42s, the Portuguese succeeded in creating a highly exploitative and coercive settler economy, in which African natives were forced to work on the fertile lands taken over by Portuguese settlers. Indigenous African peasants mainly produced ": null
    },
    {
        "cash crop": "cash crop"
    },
    {
        "s designated for sale in the markets of the colonial ": null
    },
    {
        "metropole": "metropole"
    },
    {
        " . Major cash crops included ": null
    },
    {
        "cotton": "cotton"
    },
    {
        ", ": null
    },
    {
        "cashews": "cashews"
    },
    {
        ", ": null
    },
    {
        "tea": "tea"
    },
    {
        " and ": null
    },
    {
        "rice": "rice"
    },
    {
        ". This arrangement ended in 42 after the takeover in Portugal by the new ": null
    },
    {
        "António de Oliveira Salazar": "antónio de oliveira salazar"
    },
    {
        "s government — the . Thereafter, Mozambique, along with other Portuguese colonies, was put under the direct control of Lisbon. In 42 it became an overseas province. The economy expanded rapidly during the 42s and 42s, attracting thousands of Portuguese settlers to the country. It was around this time that the first nationalist guerrilla groups began to form in ": null
    },
    {
        "Tanzania": "tanzania"
    },
    {
        " and other African countries. The strong industrial and agricultural development that did occur throughout the 42s, 42s and early 42s was based on Portuguese development plans, and also included British and South African investment.     In 42–42 Mozambiques major exports included ": null
    },
    {
        "cotton": "cotton"
    },
    {
        ", ": null
    },
    {
        "cashew nut": "cashew nut"
    },
    {
        "s, ": null
    },
    {
        "tea": "tea"
    },
    {
        ", ": null
    },
    {
        "sugar": "sugar"
    },
    {
        ", ": null
    },
    {
        "copra": "copra"
    },
    {
        " and ": null
    },
    {
        "sisal": "sisal"
    },
    {
        ". Other major agricultural productions included ": null
    },
    {
        "rice": "rice"
    },
    {
        " and ": null
    },
    {
        "coconut": "coconut"
    },
    {
        ". The expanding economy of the Portuguese overseas province was fuelled by ": null
    },
    {
        "foreign direct investment": "foreign direct investment"
    },
    {
        ", and public investment which included ambitious state-managed development plans. British capital owned two of the large sugar concessions , including the famous Sena states. The Matola Oil Refinery, Procon, was controlled by Britain and the United States. In 42 the petroleum concession was given to the Mozambique Gulf Oil Company. At Maotize ": null
    },
    {
        "coal": "coal"
    },
    {
        " was mined; the industry was chiefly financed by Belgian capital. 42% of the capital of the  was held by the , 42% by the ": null
    },
    {
        "Mozambique Company": "mozambique company"
    },
    {
        ", and the remaining 42% by the Government of the territory. Three banks were in operation, the , Portuguese, ": null
    },
    {
        "Barclays Bank": "barclays bank"
    },
    {
        ", D.C.O., British, and the  . Nine out of the twenty-three insurance companies were Portuguese. 42% of ": null
    },
    {
        "life assurance": "life assurance"
    },
    {
        " was in the hands of foreign companies which testifies to the ": null
    },
    {
        "openness of the economy": "open economy"
    },
    {
        ".      The Portuguese overseas province of Mozambique was the first territory of Portugal, including the European ": null
    },
    {
        "mainland": "mainland portugal"
    },
    {
        ", to distribute ": null
    },
    {
        "Coca-Cola": "coca-cola"
    },
    {
        ". Lately the  Oil Refinery was established by the  — a Franco-Portuguese syndicate. In the sisal plantations Swiss capital was invested, and in copra concerns, a combination of Portuguese, Swiss and French capital was invested. The large availability of capital from both Portuguese and international origin, allied to the wide range of natural resources and the growing urban population, lead to an impressive growth and development of the economy.     From the late stages of this notable period of high growth and huge development effort started in the 42s, was the construction of ": null
    },
    {
        "Cahora Bassa": "cahora bassa"
    },
    {
        " dam by the Portuguese, which started to fill in December 42 after construction was commenced in 42 In 42 construction work of the ": null
    },
    {
        "Massingir Dam": "massingir dam"
    },
    {
        " began. At independence, Mozambiques industrial base was well-developed by Sub-Saharan Africa standards, thanks to a boom in investment in the 42s and early 42s. Indeed, in 42 ": null
    },
    {
        "value added": "value added"
    },
    {
        " in manufacturing was the sixth highest in Sub-Saharan Africa.     Economically, Mozambique was a source of agricultural raw materials and an earner of foreign exchange. It also provided a market for Portuguese manufacturers which were protected from local competition. Transportation facilities had been developed to exploit the transit trade of South Africa, ": null
    },
    {
        "Swaziland": "swaziland"
    },
    {
        ", ": null
    },
    {
        "Rhodesia": "rhodesia"
    },
    {
        ", ": null
    },
    {
        "Malawi": "malawi"
    },
    {
        ", and ": null
    },
    {
        "Zambia": "zambia"
    },
    {
        ", agricultural production for export purposes had been encouraged, and profitable arrangements for the export of labour had been made with neighbouring countries. Industrial production had been relatively insignificant but did begin to increase in the 42s. The economic structure generally favoured the taking of profits to Portugal rather than their reinvestment in Mozambique. The Portuguese interests which dominate in banking, industry, and agriculture, exerted a powerful influence on policy.          Mozambiques rural black populations were largely illiterate. However, some thousands of Africans were educated in religion, Portuguese language, and Portuguese history by Catholic and Protestant ": null
    },
    {
        "missionary": "missionary"
    },
    {
        " schools established in cities and in the countryside.     In 42 primary schooling became racially segregated.  Africans who did not hold assimilated status had to enroll in rudimentary schools, whereas whites and the few thousand assimilated Africans had access to primary schools of better quality.     Starting in the early 42s, access to education was expanded in all levels. Nevertheless, rudimentary schools retained their poor quality. In 42 there were 42 African students enrolled in first grade. Of these, only 42 had successfully passed third grade in 42  By 42 only 42% of Mozambiques population was literate.      A comprehensive network of ": null
    },
    {
        "secondary school": "secondary school"
    },
    {
        "s  and technical or ": null
    },
    {
        "vocational education": "vocational education"
    },
    {
        " schools were implemented across the cities and main towns of the territory. However, access to these institutions was largely limited to whites. In 42 only 42 out of 42 students of the Liceu Salazar were Africans, in spite of whites making up only 42% of the Mozambican population.      In 42 the first Mozambican ": null
    },
    {
        "university": "university"
    },
    {
        " was founded by the Portuguese authorities: the .       The Portuguese-ruled territory was introduced to several popular European and North American sports disciplines since the early urbanistic and economic booms of the 42s and 42s. This period was a time of city and town expansion and modernization that included the construction of several sports facilities for ": null
    },
    {
        "football": "association football"
    },
    {
        ", ": null
    },
    {
        "rink hockey": "rink hockey"
    },
    {
        ", ": null
    },
    {
        "basketball": "basketball"
    },
    {
        ", ": null
    },
    {
        "volleyball": "volleyball"
    },
    {
        ", ": null
    },
    {
        "handball": "team handball"
    },
    {
        ", ": null
    },
    {
        "athletics": "athletics"
    },
    {
        ", ": null
    },
    {
        "gymnastics": "gymnastics"
    },
    {
        " and ": null
    },
    {
        "swimming": "swimming"
    },
    {
        ". Several ": null
    },
    {
        "sports clubs": "sports clubs"
    },
    {
        " were founded across the entire territory, among them were some of the largest and oldest sports organizations of Mozambique like  established in 42 Other major sports clubs were founded in the following years like  ,  ,  ,  ,  , and  . Several sportsmen, especially football players, that achieved wide notability in Portuguese sports were from Mozambique. ": null
    },
    {
        "Eusébio": "eusébio"
    },
    {
        " and ": null
    },
    {
        "Mário Coluna": "mário coluna"
    },
    {
        " were examples of that, and excelled in the ": null
    },
    {
        "Portugal national football team": "portugal national football team"
    },
    {
        ". Since the 42s, with the latest developments on ": null
    },
    {
        "commercial aviation": "commercial aviation"
    },
    {
        ", the highest ranked football teams of Mozambique and the other African overseas provinces of Portugal, started to compete in the  . There were also several facilities and organizations for ": null
    },
    {
        "golf": "golf"
    },
    {
        ", ": null
    },
    {
        "tennis": "tennis"
    },
    {
        " and ": null
    },
    {
        "wild hunting": "wild hunting"
    },
    {
        ".     The ": null
    },
    {
        "nautical sports": "nautical sports"
    },
    {
        " were also well developed and popular, especially in , home to the . The largest stadium was the , located near . Opened in 42 it was at the time the most advanced in Mozambique conforming to standards set by both ": null
    },
    {
        "FIFA": "fifa"
    },
    {
        " and the ": null
    },
    {
        "Union Cycliste Internationale": "union cycliste internationale"
    },
    {
        " . The ": null
    },
    {
        "cycling": "cycling"
    },
    {
        " track could be adjusted to allow for 42 more seats.    Beginning in the 42s, motorsport was introduced to Mozambique. At first race cars would compete in areas around the city, Polana and along the  but as funding and interest increased, a dedicated race track was built in the ": null
    },
    {
        "Costa Do Sol": "costa do sol"
    },
    {
        " area along and behind the  with the ocean to the east with a length of . The initial surface of the new track, named  did not provide enough grip and an accident in the late 42s killed 42 people and injured many more. Therefore, in 42 the track was renovated and the surface changed to meet the highest international safety requirements that were needed at large events with many spectators. The length then increased to . The city became host to several international and local events beginning with the inauguration on 42 November 42           As ": null
    },
    {
        "communist": "communist"
    },
    {
        " and ": null
    },
    {
        "anti-colonial": "anti-colonial"
    },
    {
        " ideologies spread out across Africa, many clandestine political movements were established in support of Mozambiques independence. These movements claimed that policies and development plans were primarily designed by the ruling authorities for the benefit of the ethnic Portuguese population, affecting a majority of the indigenous population who suffered both state-sponsored discrimination and enormous social pressure. Many felt they had received too little opportunity or resources to upgrade their skills and improve their economic and social situation to a degree comparable to that of the Europeans. Statistically, Portuguese Mozambiques whites were indeed wealthier and more skilled than the black indigenous majority, in spite of decreasing legal discrimination of Africans starting in the 42s.     The ": null
    },
    {
        "Front for the Liberation of Mozambique": "front for the liberation of mozambique"
    },
    {
        " , headquartered in ": null
    },
    {
        "Tanzania": "tanzania"
    },
    {
        ", initiated a ": null
    },
    {
        "guerrilla": "guerrilla"
    },
    {
        " campaign against Portuguese rule in September 42 This conflict, along with the two others already initiated in the other Portuguese overseas territories of ": null
    },
    {
        "Angola": "portuguese angola"
    },
    {
        " and ": null
    },
    {
        "Portuguese Guinea": "portuguese guinea"
    },
    {
        ", became part of the ": null
    },
    {
        "Portuguese Colonial War": "portuguese colonial war"
    },
    {
        " . Several African territories under European rule had achieved independence in recent decades. ": null
    },
    {
        "Oliveira Salazar": "oliveira salazar"
    },
    {
        " attempted to resist this tide and maintain the integrity of the ": null
    },
    {
        "Portuguese empire": "portuguese empire"
    },
    {
        ". By 42 the anti-guerrilla war in Africa was consuming an important part of the Portuguese budget and there was no sign of a final solution in sight. This year was marked by a large-scale military operation in northern Mozambique, the ": null
    },
    {
        "Gordian Knot Operation": "gordian knot operation"
    },
    {
        ", which displaced the FRELIMOs bases and destroyed much of the guerrillas military capacity. At a military level, a part of Guinea-Bissau was de facto independent since 42 but the capital and the major towns were still under Portuguese control. In Angola and Mozambique, independence movements were only active in a few remote countryside areas from where the Portuguese Army had retreated. However, their impending presence and the fact that they wouldnt go away dominated public anxiety. Throughout the war period Portugal faced increasing dissent, arms embargoes and other punitive sanctions imposed by most of the international community. For the Portuguese society the war was becoming even more unpopular due to its length and financial costs, the worsening of diplomatic relations with other United Nations members, and the role it had always played as a factor of perpetuation of the  regime. It was this escalation that would lead directly to the mutiny of members of the FAP in the ": null
    },
    {
        "Carnation Revolution": "carnation revolution"
    },
    {
        " in 42 – an event that would lead to the independence of the former Portuguese colonies in Africa. A leftist ": null
    },
    {
        "military coup": "military coup"
    },
    {
        " in Lisbon on 42 April 42 by the  , overthrew the ": null
    },
    {
        "Estado Novo": "estado novo"
    },
    {
        " regime headed by Prime Minister ": null
    },
    {
        "Marcelo Caetano": "marcelo caetano"
    },
    {
        ".     As one of the objectives of the MFA, all the Portuguese overseas territories in Africa were offered independence. FRELIMO took complete control of the Mozambican territory after a transition period, as agreed in the ": null
    },
    {
        "Lusaka Accord": "lusaka accord"
    },
    {
        " which recognized Mozambiques right to independence and the terms of the transfer of power.     Within a year of the Portuguese military coup at Lisbon, almost all of the Portuguese population had left the African territory as refugees  – some expelled by the new ruling power of Mozambique, some fleeing in fear. A parade and a state banquet completed the independence festivities in the capital, which was expected to be renamed Can Phumo, or Place of Phumo , after a ": null
    },
    {
        "Tsonga": "tsonga people"
    },
    {
        " chief who lived in the area before the Portuguese navigator  founded the city in 42 and gave his name to it. Most city streets, named for Portuguese heroes or important dates in ": null
    },
    {
        "Portuguese history": "history of portugal"
    },
    {
        ", had their names changed.            ": null
    },
    {
        "Alberto da Costa Pereira": "alberto da costa pereira"
    },
    {
        "    Alexandre Quintanilha": "alexandre quintanilha"
    },
    {
        "   António de Almeida Santos": "antónio de almeida santos"
    },
    {
        "   Armando Guebuza": "armando guebuza"
    },
    {
        "   Carlos Cardoso": "carlos cardoso"
    },
    {
        "   Carlos Queiroz": "carlos queiroz"
    },
    {
        "   Carlos Xavier": "carlos xavier"
    },
    {
        "   Daúto Faquirá": "daúto faquirá"
    },
    {
        "   Eduardo Mondlane": "eduardo mondlane"
    },
    {
        "   Francisco Barreto": "francisco barreto"
    },
    {
        "   Eusébio da Silva Ferreira": "eusébio da silva ferreira"
    },
    {
        "   Graça Machel": "graça machel"
    },
    {
        "   Guilherme de Melo": "guilherme de melo"
    },
    {
        "   Gungunhana": "gungunhana"
    },
    {
        "   João Carqueijeiro": "joão carqueijeiro"
    },
    {
        "    João de Deus Pinheiro": "joão de deus pinheiro"
    },
    {
        "   João Maria Tudela": "joão maria tudela"
    },
    {
        "   Joaquim Augusto Mouzinho de Albuquerque": "joaquim augusto mouzinho de albuquerque"
    },
    {
        "   Joaquim Chissano": "joaquim chissano"
    },
    {
        "   Jorge Cadete": "jorge cadete"
    },
    {
        "   José Craveirinha": "josé craveirinha"
    },
    {
        "   José Rodrigues dos Santos": "josé rodrigues dos santos"
    },
    {
        "    Lourenço Marques": "lourenço marques"
    },
    {
        "   Luis de Matos": "luis de matos"
    },
    {
        "   Malangatana": "malangatana ngwenya"
    },
    {
        "   Marcelino dos Santos": "marcelino dos santos"
    },
    {
        "   Mário Coluna": "mário coluna"
    },
    {
        "   Mário Crespo": "mário crespo"
    },
    {
        "   Mário Simões Dias": "mário simões dias"
    },
    {
        "   Mariza": "mariza"
    },
    {
        "   Matateu": "matateu"
    },
    {
        "   Mia Couto": "mia couto"
    },
    {
        "   Noémia de Sousa": "noémia de sousa"
    },
    {
        "   Orlando da Costa": "orlando da costa"
    },
    {
        "   Otelo Saraiva de Carvalho": "otelo saraiva de carvalho"
    },
    {
        "   Pancho Guedes": "pancho guedes"
    },
    {
        "   Paulo Furtado": "paulo furtado"
    },
    {
        "   Ricardo Rangel": "ricardo rangel"
    },
    {
        "   Samora Machel": "samora machel"
    },
    {
        "   Sancho de Tovar": "sancho de tovar"
    },
    {
        "   Shéu": "shéu"
    },
    {
        "   Soshangane": "soshangane"
    },
    {
        "   Teresa Heinz": "teresa heinz"
    },
    {
        "   Zeca Afonso": "zeca afonso"
    },
    {
        "   Al Bowlly": "al bowlly"
    },
    {
        " ": null
    }
]