[
    {
        "            A preacher is a person who delivers ": null
    },
    {
        "sermons": "sermon"
    },
    {
        "or ": null
    },
    {
        "homilies": "homily"
    },
    {
        " on religious topics to an assembly of people. Less common are preachers who ": null
    },
    {
        "preach on the street": "open-air preaching"
    },
    {
        ", or those whose message is not necessarily religious, but who preach components such as a moral or social ": null
    },
    {
        "worldview": "worldview"
    },
    {
        " or ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        ".       Preachers are common throughout most cultures. They can take the form of a ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " minister": "minister"
    },
    {
        " on a Sunday morning, or an Islamic ": null
    },
    {
        "Imam": "imam"
    },
    {
        ". A Muslim preacher in general is referred to as a  dā‘ī , while one giving sermons on a Friday afternoon is called a  khatib .     The sermon or homily has been an important part of Christian services since Early Christianity, and remains prominent in both ": null
    },
    {
        "Roman Catholicism": "roman catholic church"
    },
    {
        " and ": null
    },
    {
        "Protestantism": "protestantism"
    },
    {
        ". ": null
    },
    {
        "Lay": "laity"
    },
    {
        " preachers sometimes figure in these traditions of worship, for example the ": null
    },
    {
        "Methodist local preacher": "methodist local preacher"
    },
    {
        "s, but in general preaching has usually been a function of the ": null
    },
    {
        "clergy": "clergy"
    },
    {
        ". The ": null
    },
    {
        "Dominican Order": "dominican order"
    },
    {
        " is officially known as the Order of Preachers ; ": null
    },
    {
        "friars": "friar"
    },
    {
        "of this order were trained to publicly preach in ": null
    },
    {
        "vernacular": "vernacular"
    },
    {
        " languages, and the order was created by ": null
    },
    {
        "Saint Dominic": "saint dominic"
    },
    {
        " to preach to the ": null
    },
    {
        "Cathars": "cathar"
    },
    {
        "of southern France in the early thirteenth century. The ": null
    },
    {
        "Franciscans": "franciscans"
    },
    {
        " are another important preaching order; Travelling preachers, usually friars, were an important feature of late medieval Catholicism.     In most denominations, modern preaching is kept below about 40 minutes, but historic preachers of all denominations could at times speak for well over an hour, sometimes for two or three hours, Francis, 10 and use techniques of ": null
    },
    {
        "rhetoric": "rhetoric"
    },
    {
        " and theatre that are today somewhat out of fashion in mainline churches.     In many churches in the United States, the title Preacher is synonymous with ": null
    },
    {
        "pastor": "pastor"
    },
    {
        " or ": null
    },
    {
        "minister": "minister"
    },
    {
        " , and the churchs minister is often referred to simply as our/the preacher or by name such as Preacher Smith . However, among some Chinese churches, preacher is different from pastor . A preacher in the Protestant church is one of the younger clergy, but they are not officially recognised as pastors until they can prove their capability of leading the church.       Preacher is also the author of the Book of ": null
    },
    {
        "Ecclesiastes": "ecclesiastes"
    },
    {
        " according to the King James Version. Preacher is one translation of the ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " word קהלת . There is much debate about the identity of this Preacher; many believe it is ": null
    },
    {
        "Solomon": "solomon"
    }
]