[
    {
        "In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", specifically in ": null
    },
    {
        "category theory": "category theory"
    },
    {
        ", a preadditive category is   another name for an Ab-category, i.e., a ": null
    },
    {
        "category": "category"
    },
    {
        " that is ": null
    },
    {
        "enriched": "enriched category"
    },
    {
        " over the ": null
    },
    {
        "category of abelian groups": "category of abelian groups"
    },
    {
        ", Ab.   That is, an Ab-category C is a ": null
    },
    {
        "category": "category"
    },
    {
        " such that   every ": null
    },
    {
        "hom-set": "hom-set"
    },
    {
        " Hom in C has the structure of an abelian group, and composition of morphisms is ": null
    },
    {
        "bilinear": "bilinear operator"
    },
    {
        ", in the sense that composition of morphisms distributes over the group operation.   In formulas:     f\\circ +     and     \\circ h + ,     where + is the group operation.     Some authors have used the term additive category for preadditive categories, but here we follow the current trend of reserving this word for certain special preadditive categories .         The most obvious example of a preadditive category is the category Ab itself. More precisely, Ab is a ": null
    },
    {
        "closed monoidal category": "closed monoidal category"
    },
    {
        ". Note that ": null
    },
    {
        "commutativity": "commutativity"
    },
    {
        " is crucial here; it ensures that the sum of two ": null
    },
    {
        "group homomorphism": "group homomorphism"
    },
    {
        "s is again a homomorphism. In contrast, the category of all ": null
    },
    {
        "group": "group"
    },
    {
        "s is not closed. See ": null
    },
    {
        "Medial category": "medial category"
    },
    {
        ".     Other common examples:   The category of ": null
    },
    {
        "module": "module"
    },
    {
        "s over a ": null
    },
    {
        "ring": "ring"
    },
    {
        " R, in particular:   the ": null
    },
    {
        "category of vector spaces": "category of vector spaces"
    },
    {
        " over a ": null
    },
    {
        "field": "field"
    },
    {
        " K.   The algebra of ": null
    },
    {
        "matrices": "matrix"
    },
    {
        " over a ring, thought of as a category as described in the article ": null
    },
    {
        "Additive category": "additive category"
    },
    {
        ".   Any ring, thought of as a category with only one object, is a preadditive category. Here composition of morphisms is just ring multiplication and the unique hom-set is the underlying abelian group.     These will give you an idea of what to think of; for more examples, follow the links to  below.         Because every hom-set Hom is an abelian group, it has a ": null
    },
    {
        "zero": "0"
    },
    {
        " element 42 This is the  zero morphism  from A to B. Because composition of morphisms is bilinear, the composition of a zero morphism and any other morphism must be another zero morphism. If you think of composition as analogous to multiplication, then this says that multiplication by zero always results in a product of zero, which is a familiar intuition. Extending this analogy, the fact that composition is bilinear in general becomes the ": null
    },
    {
        "distributivity": "distributivity"
    },
    {
        " of multiplication over addition.     Focusing on a single object A in a preadditive category, these facts say that the ": null
    },
    {
        "endomorphism": "endomorphism"
    },
    {
        " hom-set Hom is a ": null
    },
    {
        "ring": "ring"
    },
    {
        ", if we define multiplication in the ring to be composition. This ring is the  endomorphism ring  of A. Conversely, every ring  is the endomorphism ring of some object in some preadditive category. Indeed, given a ring R, we can define a preadditive category R to have a single object A, let Hom be R, and let composition be ring multiplication. Since R is an abelian group and multiplication in a ring is bilinear , this makes R a preadditive category. Category theorists will often think of the ring R and the category R as two different representations of the same thing, so that a particularly ": null
    },
    {
        "perverse": "abstract nonsense"
    },
    {
        " category theorist might define a ring as a preadditive category with exactly ": null
    },
    {
        "one": "1"
    },
    {
        " object .     In this way, preadditive categories can be seen as a generalisation of rings. Many concepts from ring theory, such as ": null
    },
    {
        "ideal": "ideal"
    },
    {
        "s, ": null
    },
    {
        "Jacobson radical": "jacobson radical"
    },
    {
        "s, and ": null
    },
    {
        "factor ring": "factor ring"
    },
    {
        "s can be generalized in a straightforward manner to this setting. When attempting to write down these generalizations, one should think of the morphisms in the preadditive category as the elements of the generalized ring .         If C and D are preadditive categories, then a ": null
    },
    {
        "functor": "functor"
    },
    {
        " F:  C  →  D is additive if it too is ": null
    },
    {
        "enriched": "enriched functor"
    },
    {
        " over the category Ab. That is, F is additive ": null
    },
    {
        "if and only if": "if and only if"
    },
    {
        ", given any objects A and B of C, the ": null
    },
    {
        "function": "function"
    },
    {
        " f:  Hom  → Hom is a ": null
    },
    {
        "group homomorphism": "group homomorphism"
    },
    {
        ". Most functors studied between preadditive categories are additive.     For a simple example, if the rings R and S are represented by the one-object preadditive categories R and S, then a ": null
    },
    {
        "ring homomorphism": "ring homomorphism"
    },
    {
        " from R to S is represented by an additive functor from R to S, and conversely.     If C and D are categories and D is preadditive, then the ": null
    },
    {
        "functor category": "functor category"
    },
    {
        " D C is also preadditive, because ": null
    },
    {
        "natural transformation": "natural transformation"
    },
    {
        "s can be added in a natural way.   If C is preadditive too, then the category Add of additive functors and all natural transformations between them is also preadditive.     The latter example leads to a generalization of ": null
    },
    {
        "module": "module"
    },
    {
        "s over rings: If C is a preadditive category, then Mod  : Add is called the module category over C. When C is the one-object preadditive category corresponding to the ring R, this reduces to the ordinary category of ": null
    },
    {
        " R-modules": "category of modules"
    },
    {
        ". Again, virtually all concepts from the theory of modules can be generalised to this setting.     -linear categories C enriched over the monoidal category of ": null
    },
    {
        "modules": "module"
    },
    {
        " over a ": null
    },
    {
        "commutative ring": "commutative ring"
    },
    {
        " , called an -linear category. In other words, each ": null
    },
    {
        "hom-set": "hom-set"
    },
    {
        " Hom in C has the structure of an -module, and composition of morphisms is -bilinear.     When considering functors between two -linear categories, one often restricts to those that are -linear, so those that induce -linear maps on each hom-set.              Any ": null
    },
    {
        "finite": "finite set"
    },
    {
        " product": "product"
    },
    {
        " in a preadditive category must also be a ": null
    },
    {
        "coproduct": "coproduct"
    },
    {
        ", and conversely. In fact, finite products and coproducts in preadditive categories can be characterised by the following biproduct condition:   :The object B is a biproduct of the objects A 42 ,...,A n  ": null
    },
    {
        "if and only if": "if and only if"
    },
    {
        " there are projection morphisms p j :  B  →  A j  and injection morphisms i j :  A j   →  B, such that   + ···  +  is the identity morphism of B, p j    o  i j  is the ": null
    },
    {
        "identity morphism": "identity morphism"
    },
    {
        " of A j , and p j    o  i k  is the zero morphism from A k  to A j  whenever j and k are ": null
    },
    {
        "distinct": "distinct"
    },
    {
        ".     This biproduct is often written A 42  ⊕ ···  ⊕  A n , borrowing the notation for the ": null
    },
    {
        "direct sum": "direct sum"
    },
    {
        ". This is because the biproduct in well known preadditive categories like Ab is the direct sum. However, although ": null
    },
    {
        "infinite": "infinity"
    },
    {
        " direct sums make sense in some categories, like Ab, infinite biproducts do not make sense.     The biproduct condition in the case n    42 simplifies drastically; B is a nullary biproduct if and only if the identity morphism of B is the zero morphism from B to itself, or equivalently if the hom-set Hom is the ": null
    },
    {
        "trivial ring": "trivial ring"
    },
    {
        ". Note that because a nullary biproduct will be both ": null
    },
    {
        "terminal": "terminal object"
    },
    {
        " and ": null
    },
    {
        "coterminal": "coterminal"
    },
    {
        " , it will in fact be a  zero object .   Indeed, the term zero object originated in the study of preadditive categories like Ab, where the zero object is the ": null
    },
    {
        "zero group": "trivial group"
    },
    {
        ".     A preadditive category in which every biproduct exists is called  additive . Further facts about biproducts that are mainly useful in the context of additive categories may be found under that subject.         Because the hom-sets in a preadditive category have zero morphisms,   the notion of ": null
    },
    {
        "kernel": "kernel"
    },
    {
        " and ": null
    },
    {
        "cokernel": "cokernel"
    },
    {
        "   make sense. That is, if f:  A  →  B is a   morphism in a preadditive category, then the kernel of f is the   ": null
    },
    {
        "equaliser": "equaliser"
    },
    {
        " of f and the zero morphism from A to B, while the cokernel of f is the ": null
    },
    {
        "coequaliser": "coequaliser"
    },
    {
        " of f and this zero morphism. Unlike with products and coproducts, the kernel and cokernel of f are generally not equal in a preadditive category.     When specializing to the preadditive categories of abelian groups or modules over a ring, this notion of kernel coincides with the ordinary notion of a ": null
    },
    {
        "kernel": "kernel"
    },
    {
        " of a homomorphism, if one identifies the ordinary kernel K of f:  A  →  B with its embedding K  →  A. However, in a general preadditive category there may exist morphisms without kernels and/or cokernels.     There is a convenient relationship between the kernel and cokernel and the abelian group structure on the hom-sets. Given parallel morphisms f and g, the equaliser of f and g is just the kernel of g   & minus;  f, if either exists, and the analogous fact is true for coequalisers. The alternative term difference kernel for binary equalisers derives from this fact.     A preadditive category in which all biproducts, kernels, and cokernels exist is called  pre-abelian . Further facts about kernels and cokernels in preadditive categories that are mainly useful in the context of pre-abelian categories may be found under that subject.         Most of these special cases of preadditive categories have all been mentioned above, but theyre gathered here for reference.   A  ring  is a preadditive category with exactly one object.   An  additive category  is a preadditive category with all finite biproducts.   A  pre-abelian category  is an additive category with all kernels and cokernels.   An  abelian category  is a pre-abelian category such that every ": null
    },
    {
        "monomorphism": "monomorphism"
    },
    {
        " and ": null
    },
    {
        "epimorphism": "epimorphism"
    },
    {
        " is ": null
    },
    {
        "normal": "normal monomorphism"
    },
    {
        ".   The preadditive categories most commonly studied are in fact abelian categories; for example, Ab": null
    }
]