[
    {
        "         A prefecture  is an administrative jurisdiction or subdivision in any of various countries and within some international church structures, and in antiquity a Roman district governed by an appointed prefect.         Prefecture most commonly refers to a self-governing body or area since the ": null
    },
    {
        "tetrarchy": "tetrarchy"
    },
    {
        " when Emperor ": null
    },
    {
        "Diocletian": "diocletian"
    },
    {
        " divided the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        " into four districts , grouped under a Vicarius  , although he maintained two pretorian prefectures as an administrative level above the also surviving dioceses .          As ": null
    },
    {
        "canon law": "canon law"
    },
    {
        " is strongly inspired by Roman law, it is not surprising that the Catholic Church has several offices under a prefect. That term occurs also in otherwise styled offices, such as the head of a congregation or department of the ": null
    },
    {
        "Roman Curia": "roman curia"
    },
    {
        ". Various ecclesiastical areas, too small for a ": null
    },
    {
        "diocese": "diocese"
    },
    {
        ", are termed prefects.       prefecture": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ", the prefecture  is the ": null
    },
    {
        "executive branch": "executive"
    },
    {
        " of the government of each Brazilian ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " . The term also refers to the office of the ": null
    },
    {
        "mayor": "mayor"
    },
    {
        " .       The ": null
    },
    {
        "Central African Republic": "central african republic"
    },
    {
        " is divided into sixteen ": null
    },
    {
        "prefectures": "prefectures of the central african republic"
    },
    {
        ".     prefecture   From 42 until 42 modern ": null
    },
    {
        "Greece": "greece"
    },
    {
        " was divided into   which formed the countrys main administrative units. These are most commonly translated into ": null
    },
    {
        "English": "english language"
    },
    {
        " as prefectures or counties .     Each  was headed by a prefect , who was a ministerial appointee until ca. 42 but was then elected by direct popular vote in a process of decentralization that saw the prefectures become ": null
    },
    {
        "local government": "local government"
    },
    {
        " units. Municipal elections in Greece are held every four years and voting for the election of prefects and mayors was carried out concurrently but with separate ballots.     The 42 ": null
    },
    {
        "Kallikratis plan": "kallikratis plan"
    },
    {
        ", which took effect on 42 January 42 abolished the prefectures as separate administrative units, and transformed them into ": null
    },
    {
        "regional units": "regional units of greece"
    },
    {
        " within the countrys thirteen ": null
    },
    {
        "administrative regions": "administrative regions of greece"
    },
    {
        ".     prefecture       ;Xian       When used in the context of ": null
    },
    {
        "Chinese history": "chinese history"
    },
    {
        ", especially China before the ": null
    },
    {
        "Tang Dynasty": "tang dynasty"
    },
    {
        ", the word prefecture is used to translate xian . This unit of administration is translated as county when used in a contemporary context, because of the increase of the number of xian and the decrease of their sizes over time in the Chinese history.     ;Zhou  or Fu       In the context of Chinese history during or after the ": null
    },
    {
        "Tang Dynasty": "tang dynasty"
    },
    {
        ", the word prefecture is used to translate zhou ": null
    }
]