[
    {
        "      In ": null
    },
    {
        "mammal": "Mammal"
    },
    {
        "s, pregnancy is the period of ": null
    },
    {
        "reproduction": "Reproduction"
    },
    {
        " during which a ": null
    },
    {
        "female": "Female"
    },
    {
        " carries one or more live offspring from ": null
    },
    {
        "implantation": "Implantation"
    },
    {
        " in the uterus through ": null
    },
    {
        "gestation": "Gestation"
    },
    {
        ". It begins when a ": null
    },
    {
        "fertilized": "Fertilisation"
    },
    {
        " zygote": "Zygote"
    },
    {
        " implants in the females ": null
    },
    {
        "uterus": "Uterus"
    },
    {
        ", and ends once it leaves the uterus.       During ": null
    },
    {
        "copulation": "Animal Sexual Behaviour"
    },
    {
        ", the male ": null
    },
    {
        "inseminates": "Insemination"
    },
    {
        " the female. The ": null
    },
    {
        "spermatozoon": "Spermatozoon"
    },
    {
        "fertilizes": "Fertilisation"
    },
    {
        "an ": null
    },
    {
        "ovum": "Ovum"
    },
    {
        " or various ova in the uterus or ": null
    },
    {
        "fallopian tube": "Fallopian Tube"
    },
    {
        "s, and this results in one or multiple ": null
    },
    {
        "zygote": "Zygote"
    },
    {
        "s. Sometimes, a zygote can be created by humans outside of the animals body in the artificial process of ": null
    },
    {
        "in-vitro fertilization": "In Vitro Fertilisation"
    },
    {
        ". After fertilization, the newly formed zygote then begins to divide through ": null
    },
    {
        "mitosis": "Mitosis"
    },
    {
        ", forming an ": null
    },
    {
        "embryo": "Embryo"
    },
    {
        ", which implants in the females ": null
    },
    {
        "endometrium": "Endometrium"
    },
    {
        ". At this time, the embryo usually consists of 50 cells.              A ": null
    },
    {
        "blastocoele": "Blastocoele"
    },
    {
        " is a small cavity on the center of the embryo, and the developing embryonary cells will grow around it. Then, a flat layer cell forms on the exterior of this cavity, and the ": null
    },
    {
        "zona pellucida": "Zona Pellucida"
    },
    {
        ", the blastocysts barrier, remains the same size as before. Cells grow increasingly smaller to fit in. This new structure with a cavity in the center and the developing cells around it is known as a ": null
    },
    {
        "blastocyst": "Blastocyst"
    },
    {
        ".     The presence of the blastocyst means that two types of cells are forming, an inner-cell mass growing on the interior of the blastocele and cells growing on the exterior of it. In 24 to 48 hours, the zona pellucida breaches. The cells on the exterior of the blastocyst begin excreting an enzyme which erodes ": null
    },
    {
        "epithelial": "Epithelium"
    },
    {
        " uterine lining and creates a site for implantation.       The cells surrounding the blastocyst now destroy cells in the uterine lining, forming small pools of blood, which in turn stimulate the production of capillaries. This is the first stage in the growth of the ": null
    },
    {
        "placenta": "Placenta"
    },
    {
        ". The inner cell mass of the blastocyst divides rapidly, forming two layers. The top layer becomes the embryo, and cells from there occupy the ": null
    },
    {
        "amniotic cavity": "Amniotic Cavity"
    },
    {
        ". At the same time, the bottom layer forms a small sac .     Several days later, ": null
    },
    {
        "chorionic villi": "Chorionic Villi"
    },
    {
        " in the forming placenta anchor the implantation site to the uterus. A system of blood and ": null
    },
    {
        "blood vessels": "Blood Vessel"
    },
    {
        "now develops at the point of the newly forming placenta, growing near the implantation site. The small sac inside the blastocyst begins producing ": null
    },
    {
        "red blood cell": "Red Blood Cell"
    },
    {
        "s. For the next 24 hours, ": null
    },
    {
        "connective tissue": "Connective Tissue"
    },
    {
        " develops between the developing placenta and the growing ": null
    },
    {
        "embryo": "Embryo"
    },
    {
        ". This later develops into the ": null
    },
    {
        "umbilical cord": "Umbilical Cord"
    },
    {
        ".       Following this, a narrow line of cells appears on the surface on the embryo. Its growth makes the embryo undergo ": null
    },
    {
        "gastrulation": "Gastrulation"
    },
    {
        ", in which the three ": null
    },
    {
        "primary tissue layers": "Germ Layer"
    },
    {
        " of the fetus, the ": null
    },
    {
        "ectoderm": "Ectoderm"
    },
    {
        ", ": null
    },
    {
        "mesoderm": "Mesoderm"
    },
    {
        ", and ": null
    },
    {
        "endoderm": "Endoderm"
    },
    {
        ", develop. The narrow line of cells begin to form the endoderm and mesoderm. The ectoderm begins to grow rapidly as a result of chemicals being produced by the mesoderm. These three layers give rise to all the various types of tissue in the body.     The endoderm later forms the lining of the ": null
    },
    {
        "tongue": "Tongue"
    },
    {
        ", ": null
    },
    {
        "digestive tract": "Gut"
    },
    {
        ", ": null
    },
    {
        "lung": "Lung"
    },
    {
        "s, ": null
    },
    {
        "bladder": "Urinary Bladder"
    },
    {
        " and several ": null
    },
    {
        "gland": "Gland"
    },
    {
        "s. The mesoderm forms ": null
    },
    {
        "muscle": "Muscle"
    },
    {
        ", ": null
    },
    {
        "bone": "Bone"
    },
    {
        ", and ": null
    },
    {
        "lymph": "Lymph"
    },
    {
        " tissue, as well as the interior of the lungs, ": null
    },
    {
        "heart": "Heart"
    },
    {
        ", and ": null
    },
    {
        "reproductive": "Reproductive System"
    },
    {
        " and ": null
    },
    {
        "excretory system": "Excretory System"
    },
    {
        "s. It also gives rise to the ": null
    },
    {
        "spleen": "Spleen"
    },
    {
        ", and produces blood cells. The ectoderm forms the ": null
    },
    {
        "skin": "Skin"
    },
    {
        ", ": null
    },
    {
        "nail": "Nail"
    },
    {
        "s, ": null
    },
    {
        "hair": "Hair"
    },
    {
        ", ": null
    },
    {
        "cornea": "Cornea"
    },
    {
        ", lining of the internal and external ": null
    },
    {
        "ear": "Ear"
    },
    {
        ", ": null
    },
    {
        "nose": "Nose"
    },
    {
        ", ": null
    },
    {
        "sinus": "Paranasal Sinuses"
    },
    {
        "es, ": null
    },
    {
        "mouth": "Mouth"
    },
    {
        ", ": null
    },
    {
        "anus": "Anus"
    },
    {
        ", ": null
    },
    {
        "teeth": "Tooth"
    },
    {
        ", ": null
    },
    {
        "pituitary gland": "Pituitary Gland"
    },
    {
        ", ": null
    },
    {
        "mammary gland": "Mammary Gland"
    },
    {
        "s, ": null
    },
    {
        "eye": "Eye"
    },
    {
        "s, and all parts of the ": null
    },
    {
        "nervous system": "Nervous System"
    },
    {
        ".     Approximately 18 days after fertilization, the embryo has divided to form much of the tissue it will need. It is shaped like a pear, where the head region is larger than the tail. The embryos nervous system is one of the first organic systems to grow. It begins growing in a concave area known as the ": null
    },
    {
        "neural groove": "Neural Groove"
    },
    {
        ".     The blood system continues to grow networks which allow the blood to flow around the embryo. Blood cells are already being produced and are flowing through these developing networks. Secondary blood vessels also begin to develop around the placenta, to supply it with more nutrients. Blood cells begin to form on the sac in the center of the embryo, as well as cells which begin to ": null
    },
    {
        "differentiate": "Cellular Differentiation"
    },
    {
        " into blood vessels. ": null
    },
    {
        "Endocardial": "Endocardium"
    },
    {
        " cells begin to form the ": null
    },
    {
        "myocardium": "Cardiac Muscle"
    },
    {
        ".     At about 24 days past fertilization, there is a primitive S-shaped tubule heart which begins beating. The flow of fluids throughout the embryo begins at this stage.              For ": null
    },
    {
        "mammals": "Mammal"
    },
    {
        "the  gestation period is the time in which a ": null
    },
    {
        "fetus": "Fetus"
    },
    {
        " develops, beginning with fertilization and ending at birth.  The duration of this period varies between species.     For most species, the amount a ": null
    },
    {
        "fetus": "Fetus"
    },
    {
        " grows before birth determines the length of the gestation period. Smaller species normally have a shorter gestation period than larger animals.  For example, ": null
    },
    {
        "a cats gestation": "Catreproduction"
    },
    {
        " normally takes 58–65 days while ": null
    },
    {
        "an elephants": "Elephantbirthing And Calves"
    },
    {
        " takes nearly 2 years .  However, growth does not necessarily determine the length of gestation for all species, especially for those with a ": null
    },
    {
        "breeding season": "Breeding Season"
    },
    {
        ". Species that use a breeding season usually give birth during a specific time of year when food is available.     Various other factors can come into play in determining the duration of gestation. For humans, male fetuses normally gestate several days longer than females and ": null
    },
    {
        "multiple pregnancies": "Multiple Birth"
    },
    {
        " gestate for a shorter period. Ethnicity in humans is also a factor that may lengthen or shorten gestation.  In dogs there is a positive correlation between a longer gestation time and fewer members of the litter. ": null
    }
]