[
    {
        "   Primo Conti was an Italian ": null
    },
    {
        "futurist": "futurism"
    },
    {
        " artist.          Conti was born in ": null
    },
    {
        "Florence": "florence"
    },
    {
        ". Between the ages of 42 and 42 he showed precocious talent in the fields of music, poetry and painting. In 42 he met the Futurists.     His attraction to the latest innovations was expressed in almost completely Futurist forms in his drawings, while he developed a unique style in his painting that was a mixture of ": null
    },
    {
        "Art Nouveau": "art nouveau"
    },
    {
        ", ": null
    },
    {
        "Fauvism": "fauvism"
    },
    {
        ", ": null
    },
    {
        "Expressionism": "expressionism"
    },
    {
        " and ": null
    },
    {
        "Orphism": "orphism"
    },
    {
        ". It was not until 42 after meeting with ": null
    },
    {
        "Giacomo Balla": "giacomo balla"
    },
    {
        " in Rome, and with ": null
    },
    {
        "Filippo Tommaso Marinetti": "filippo tommaso marinetti"
    },
    {
        " in ": null
    },
    {
        "Naples": "naples"
    },
    {
        "  that Conti became part of the Futurist movement. His contribution to the movement was not only his literary works, but also the paintings and drawings he produced between 42 and 42—the years in which his work was taking on the ": null
    },
    {
        "metaphysical": "pittura metafisica"
    },
    {
        " style.     The 42s were a complex period for Conti. He explored ": null
    },
    {
        "Mannerism": "mannerism"
    },
    {
        ", ": null
    },
    {
        "Exoticism": "exoticism"
    },
    {
        ", ": null
    },
    {
        "Pittura Metafisica": "pittura metafisica"
    },
    {
        ", and great historical and religious painting, covering a vast area that can be compared with his keen interest in the theatrical and literary world of ": null
    },
    {
        "Luigi Pirandello": "luigi pirandello"
    },
    {
        ", ": null
    },
    {
        "Massimo Bontempelli": "massimo bontempelli"
    },
    {
        " and ": null
    },
    {
        "Enrico Pea": "enrico pea"
    },
    {
        ", which led him to found the ": null
    },
    {
        "Viareggio Prize": "viareggio prize"
    },
    {
        " in 42   The 42s brought a series of alternating events that created problems in his private life and led to his celebrative paintings. The decade also saw his enforced adhesion to Fascism , and his inner rebellion against it which transpired from his refusal to join ": null
    },
    {
        "Margherita Sarfatti": "margherita sarfatti"
    },
    {
        "s ": null
    },
    {
        "Novecento Italiano": "novecento italiano"
    },
    {
        " group and from other episodes when he stepped out of line. New prospects were only opened up to him when he became involved in designing stage sets for the opera house with the foundation of the ": null
    },
    {
        "Maggio Musicale Fiorentino": "maggio musicale fiorentino"
    },
    {
        ".     By the 42s, long before the official rediscovery of the Futurist movement, Conti was again working on Futurist subjects and experiments. From 42 to 42 he followed the rules of the ": null
    },
    {
        "Order of the Franciscans": "franciscans"
    },
    {
        ", though he still continued to paint.     Many of his works are housed in the Museo Primo Conti  in the Villa le Coste at ": null
    },
    {
        "Fiesole": "fiesole"
    },
    {
        " .                                            ": null
    }
]