[
    {
        "              A prime minister is the head of a ": null
    },
    {
        "cabinet": "cabinet"
    },
    {
        " and the leader of the ": null
    },
    {
        "ministers": "minister"
    },
    {
        " in the ": null
    },
    {
        "executive": "executive"
    },
    {
        " branch of ": null
    },
    {
        "government": "government"
    },
    {
        ", often in a ": null
    },
    {
        "parliamentary": "parliamentary system"
    },
    {
        " or ": null
    },
    {
        "semi-presidential system": "semi-presidential system"
    },
    {
        ". A prime minister is not the ": null
    },
    {
        "head of state": "head of state"
    },
    {
        " of their respective nation nor a monarch, rather they are the ": null
    },
    {
        "head of government": "head of government"
    },
    {
        ", serving typically under a ": null
    },
    {
        "monarch": "monarch"
    },
    {
        " in a ": null
    },
    {
        "hybrid of aristocratic and democratic": "parliamentary system"
    },
    {
        " government forms or a ": null
    },
    {
        "president": "president"
    },
    {
        " in a ": null
    },
    {
        "republican": "republic"
    },
    {
        " form of ": null
    },
    {
        "government": "government"
    },
    {
        ".     In parliamentary systems fashioned after the ": null
    },
    {
        "Westminster system": "westminster system"
    },
    {
        ", the prime minister is the presiding and actual ": null
    },
    {
        "head of government": "head of government"
    },
    {
        " and head of the executive branch. In such systems, the ": null
    },
    {
        "head of state": "head of state"
    },
    {
        " or the head of states official representative usually holds a largely ceremonial position, although often with ": null
    },
    {
        "reserve power": "reserve power"
    },
    {
        "s.     In many systems, the prime minister selects and may dismiss other members of the cabinet, and allocates posts to members within the government. In most systems, the prime minister is the presiding member and ": null
    },
    {
        "chairman": "chairman"
    },
    {
        " of the cabinet. In a minority of systems, notably in ": null
    },
    {
        "semi-presidential systems": "semi-presidential system"
    },
    {
        "of government, a prime minister is the official who is appointed to manage the ": null
    },
    {
        "civil service": "civil service"
    },
    {
        " and execute the directives of the ": null
    },
    {
        "head of state": "head of state"
    },
    {
        ".        The prime minister is often, but not always, a member of the Legislature or the Lower House thereof and is expected with other ministers to ensure the passage of bills through the ": null
    },
    {
        "legislature": "legislature"
    },
    {
        ". In some ": null
    },
    {
        "monarchies": "monarchy"
    },
    {
        " the monarch may also exercise executive powers  that are constitutionally vested in the crown and may be exercised without the approval of parliament.     As well as being head of government, a prime minister may have other roles or posts—the ": null
    },
    {
        "Prime Minister of the United Kingdom": "prime minister of the united kingdom"
    },
    {
        ", for example, is also ": null
    },
    {
        "First Lord of the Treasury": "first lord of the treasury"
    },
    {
        " and ": null
    },
    {
        "Minister for the Civil Service": "minister for the civil service"
    },
    {
        ". Contrary to popular perception, the two posts are separate and need not be held by the one person. The last prime minister not to be First Lord of the Treasury was Lord Salisbury at the turn of the 20th century. ": null
    },
    {
        "10 Downing Street": "10 downing street"
    },
    {
        " is actually the First Lords residence, not the Prime Ministers. As Salisbury was not First Lord, he had to live elsewhere as prime minister. Prime ministers may take other ministerial posts. Also during the Second World War, ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        " was also ": null
    },
    {
        "Minister of Defence": "minister of defence"
    },
    {
        " . Another example is, the ": null
    },
    {
        "Thirty-fourth government of Israel": "thirty-fourth government of israel"
    },
    {
        " ,Where ": null
    },
    {
        "Benjamin Netanyahu": "benjamin netanyahu"
    },
    {
        " at one point served as the ": null
    },
    {
        "Ministers of Communications": "ministry of communications"
    },
    {
        ", ": null
    },
    {
        "Foreign Affairs": "ministry of foreign affairs"
    },
    {
        ", ": null
    },
    {
        "Regional Cooperation": "regional cooperation minister of israel"
    },
    {
        ", ": null
    },
    {
        "Economy": "ministry of economy"
    },
    {
        ", ": null
    },
    {
        "Defense": "ministry of defense"
    },
    {
        " and ": null
    },
    {
        "Interior": "ministry of interior"
    },
    {
        ".       The term prime minister in its French form, premier ministre, is attested in 17th Century sources referring to ": null
    },
    {
        "Cardinal Richelieu": "cardinal richelieu"
    },
    {
        "  after he was named to head the royal council in 1624. The title was however informal and used alongside the equally informal  principal ministre dÉtat  more as a job description. After 1661, ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        " and his descendants refused to allow one of their ministers to be more important than the others, so the term was not in use.   in Encyclopédie Larousse     The term prime minister in the sense that we know it originated in the 18th century in the United Kingdom when members of parliament disparagingly used the title in reference to ": null
    },
    {
        "Sir Robert Walpole": "sir robert walpole"
    },
    {
        " . During the whole of the 18th Century, Britain was involved in a prolonged conflict with France, periodically bursting into all-out war, and Britons took outspoken pride in their Liberty as contrasted to the Tyranny of French Absolute Monarchy; therefore, being implicitly compared with Richelieu was no compliment to Walpole. Over time, however, the title became honorific and remains so in the 21st century.                  The monarchs of England and the United Kingdom had ministers in whom they placed special trust and who were regarded as the head of the government. Examples were ": null
    },
    {
        "Thomas Cromwell": "thomas cromwell, 1st earl of essex"
    },
    {
        " under ": null
    },
    {
        "Henry VIII": "henry viii of england"
    },
    {
        "; ": null
    },
    {
        "William Cecil, Lord Burghley": "william cecil, 1st baron burghley"
    },
    {
        " under ": null
    },
    {
        "Elizabeth I": "elizabeth i of england"
    },
    {
        "; ": null
    },
    {
        "Clarendon": "edward hyde, 1st earl of clarendon"
    },
    {
        " under ": null
    },
    {
        "Charles II": "charles ii of england"
    },
    {
        " and ": null
    },
    {
        "Godolphin": "sidney godolphin, 1st earl of godolphin"
    },
    {
        " under ": null
    },
    {
        "Queen Anne": "anne, queen of great britain"
    },
    {
        ". These ministers held a variety of formal posts, but were commonly known as the minister , the chief minister , the first minister and finally the prime minister .     The power of these ministers depended entirely on the personal favour of the monarch. Although managing the parliament was among the necessary skills of holding high office, they did not depend on a parliamentary majority for their power. Although there was a ": null
    },
    {
        "cabinet": "cabinet"
    },
    {
        ", it was appointed entirely by the monarch, and the monarch usually presided over its meetings.     When the monarch grew tired of a first minister, he or she could be dismissed, or worse: Cromwell was executed and Clarendon driven into exile when they lost favour. Kings sometimes divided power equally between two or more ministers to prevent one minister from becoming too powerful. Late in Annes reign, for example, the ": null
    },
    {
        "Tory": "tory"
    },
    {
        " ministers ": null
    },
    {
        "Harley": "robert harley, 1st earl of oxford and mortimer"
    },
    {
        " and ": null
    },
    {
        "Viscount Bolingbroke": "henry st john, 1st viscount bolingbroke"
    },
    {
        " shared power.          In the mid 17th century, after the ": null
    },
    {
        "English Civil War": "english civil war"
    },
    {
        " , Parliament strengthened its position relative to the monarch then gained more power through the ": null
    },
    {
        "Glorious Revolution": "glorious revolution"
    },
    {
        " of 1688 and passage of the ": null
    },
    {
        "Bill of Rights": "bill of rights 1689"
    },
    {
        " in 1689.  The monarch could no longer establish any law or impose any tax without its permission and thus the House of Commons became a part of the government. It is at this point that a modern style of prime minister begins to emerge.       A tipping point in the evolution of the prime ministership came with the death of Anne in 1714 and the accession of ": null
    },
    {
        "George I": "george i of great britain"
    },
    {
        " to the throne. George spoke no English, spent much of his time at his home in ": null
    },
    {
        "Hanover": "hanover"
    },
    {
        ", and had neither knowledge of, nor interest in, the details of English government. In these circumstances it was inevitable that the kings first minister would become the de facto head of the government.     From 1721 this was the ": null
    },
    {
        "Whig": "british whig party"
    },
    {
        " politician ": null
    },
    {
        "Robert Walpole": "robert walpole"
    },
    {
        ", who held office for twenty-one years. Walpole chaired cabinet meetings, appointed all the other ministers, dispensed the royal patronage and packed the ": null
    },
    {
        "House of Commons": "british house of commons"
    },
    {
        " with his supporters. Under Walpole, the doctrine of cabinet solidarity developed. Walpole required that no minister other than himself have private dealings with the king, and also that when the cabinet had agreed on a policy, all ministers must defend it in public, or resign. As a later prime minister, ": null
    },
    {
        "Lord Melbourne": "william lamb, 2nd viscount melbourne"
    },
    {
        ", said, It matters not what we say, gentlemen, so long as we all say the same thing.     Walpole always denied that he was prime minister , and throughout the 18th century parliamentarians and legal scholars continued to deny that any such position was known to the Constitution. ": null
    },
    {
        "George II": "george ii of great britain"
    },
    {
        " and ": null
    },
    {
        "George III": "george iii of great britain"
    },
    {
        " made strenuous efforts to reclaim the personal power of the monarch, but the increasing complexity and expense of government meant that a minister who could command the loyalty of the Commons was increasingly necessary. The long tenure of the wartime prime minister ": null
    },
    {
        "William Pitt the Younger": "william pitt the younger"
    },
    {
        " , combined with the mental illness of George III, consolidated the power of the post. The title was first referred to on government documents during the administration of ": null
    },
    {
        "Benjamin Disraeli": "benjamin disraeli"
    },
    {
        " but did not appear in the formal British ": null
    },
    {
        "Order of precedence": "order of precedence"
    },
    {
        " until 1905.     The prestige of British institutions in the 19th century and the growth of the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        " saw the British model of cabinet government, headed by a prime minister, widely copied, both in other European countries and in British colonial territories as they developed self-government.    In some places alternative titles such as premier , chief minister , first minister of state , president of the council or chancellor were adopted, but the essentials of the office were the same.       By the late 20th century,   the majority of the worlds countries had a prime minister or equivalent minister, holding office under either a ": null
    },
    {
        "constitutional monarchy": "constitutional monarchy"
    },
    {
        " or a ceremonial president. The main exceptions to this system have been the United States and the presidential republics in Latin America modelled on the U.S. system, in which the president directly exercises executive authority.     ": null
    },
    {
        "Bahrains": "bahrain"
    },
    {
        "prime minister, ": null
    },
    {
        "Sheikh": "sheikh"
    },
    {
        " Khalifah bin Sulman Al Khalifah": "khalifah bin sulman al khalifah"
    },
    {
        " has been in the post since 1970, making him the longest serving non-elected prime minister.       The post of prime minister may be encountered both in constitutional ": null
    },
    {
        "monarch": "monarch"
    },
    {
        "ies , and in ": null
    },
    {
        "parliamentary republics": "parliamentary republic"
    },
    {
        "in which the head of state is an elected official . See also ": null
    },
    {
        "First Minister": "first minister"
    },
    {
        " , ": null
    },
    {
        "Premier": "premier"
    },
    {
        " , ": null
    },
    {
        "Chief Minister": "chief minister"
    },
    {
        " , ": null
    },
    {
        "Chancellor": "chancellor"
    },
    {
        " , ": null
    },
    {
        "Taoiseach": "taoiseach"
    },
    {
        " , Minister of State  , President of the Government , President of the Council of Minister and ": null
    },
    {
        "Secretary of State": "secretary of state"
    },
    {
        " : alternative titles usually equivalent in meaning to, or translated as, prime minister .     This contrasts with the ": null
    },
    {
        "presidential system": "presidential system"
    },
    {
        ", in which the ": null
    },
    {
        "president": "president"
    },
    {
        " is both the head of state and the head of the government. In some ": null
    },
    {
        "presidential": "presidential system"
    },
    {
        " and all ": null
    },
    {
        "semi-presidential": "semi-presidential system"
    },
    {
        " systems, such as those of ": null
    },
    {
        "France": "politics of france"
    },
    {
        ", ": null
    },
    {
        "Russia": "politics of russia"
    },
    {
        " or ": null
    },
    {
        "South Korea": "politics of south korea"
    },
    {
        ", the prime minister is an official generally appointed by the president but usually approved by the legislature and responsible for carrying out the directives of the president and managing the civil service. The head of government of the ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        " is referred to as the ": null
    },
    {
        "Premier of the State Council": "premier of the peoples republic of china"
    },
    {
        " and the premier of the ": null
    },
    {
        "Republic of China ": "politics of the republic of china"
    },
    {
        " is also appointed by the ": null
    },
    {
        "president": "president of the republic of china"
    },
    {
        ", but requires no approval by the legislature.     Appointment of the prime minister of France requires no approval by the parliament either, but the parliament may force the resignation of the government. In these systems, it is possible for the president and the prime minister to be from different political parties if the legislature is controlled by a party different from that of the president. When it arises, such a state of affairs is usually referred to as ": null
    },
    {
        "cohabitation": "cohabitation"
    },
    {
        ".       In parliamentary systems a prime minister may enter into office by several means.     The head of state appoints a prime minister, of their personal choice: Example: ": null
    },
    {
        "France": "france"
    },
    {
        ", where the President has the power to appoint the Prime Minister of their choice, though the ": null
    },
    {
        "National Assembly": "national assembly"
    },
    {
        " can force a government to resign, they cannot nominate or appoint a new candidate.   :While in practice most prime ministers under the ": null
    },
    {
        "Westminster system": "westminster system"
    },
    {
        "  are the leaders of the largest party or ": null
    },
    {
        "coalition": "political alliance"
    },
    {
        " in parliament, technically the appointment of the prime minister is a prerogative exercised by the head of state.   The head of state appoints a prime minister who has a set timescale within which they must gain a vote of confidence: Example: ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", ": null
    },
    {
        "Romania": "romania"
    },
    {
        ", ": null
    },
    {
        "Thailand": "thailand"
    },
    {
        " The head of state appoints a prime minister from among the members of Parliament, who then has a set timescale within which they must form a cabinet, and receive the confidence of Parliament after presenting the Cabinet Composition and Legislative Program to Parliament: Example: Israel   The head of state appoints the leader of the political party with the majority of the seats in the Parliament as Prime Minister, if no party has a majority then the leader of the party with a plurality of seats is given an exploratory mandate to receive the confidence of the parliament within three days, if this is not possible then the leader of the party with the second highest seat number is given the exploratory mandate, if this fails then the leader of the third largest party is given it and so on: Example: Greece, see ": null
    },
    {
        "Prime Minister of Greece": "prime minister of greece"
    },
    {
        " The head of state nominates a candidate for prime minister who is then submitted to parliament for approval before appointment as prime minister: Example: Spain, where the King sends a nomination to parliament for approval. Also Germany where under the ": null
    },
    {
        "German Basic Law": "basic law of the federal republic of germany"
    },
    {
        " the ": null
    },
    {
        "Bundestag": "bundestag"
    },
    {
        " votes on a candidate nominated by the federal president. In the Philippines under the 1973 Constitution as amended after martial law, the Prime Minister was elected by the ": null
    },
    {
        "Batasang Pambansâ": "batasang pambansâ"
    },
    {
        " upon nomination by the President. In these cases, parliament can choose another candidate who then would be appointed by the head of state .   Parliament nominates a candidate who the head of state is then constitutionally obliged to appoint as prime minister: Example: ": null
    },
    {
        "Ireland": "republic of ireland"
    },
    {
        ", where the ": null
    },
    {
        "President": "president of ireland"
    },
    {
        " appoints the ": null
    },
    {
        "Taoiseach": "taoiseach"
    },
    {
        " on the nomination of ": null
    },
    {
        "Dáil Éireann": "dáil éireann"
    },
    {
        ". Also ": null
    },
    {
        "Japan": "japan"
    },
    {
        ".   Election by the Legislature: Example: ": null
    },
    {
        "The Philippines": "the philippines"
    },
    {
        " under the unamended 1973 Constitution, where the prime minister was supposed to be elected by the Batasang Pambansâ; these provisions were never used because the Philippines was under martial law at the time. Also ": null
    },
    {
        "Vanuatu": "vanuatu"
    },
    {
        ".   Direct election by popular vote: Example: ": null
    },
    {
        "Israel": "israel"
    },
    {
        ", 1996–2001, where the prime minister was elected in a general election, with no regard to political affiliation.   Nomination by a state office holder other than the head of state or his/her representative: Example: Under the modern Swedish ": null
    },
    {
        "Instrument of Government": "constitution of sweden"
    },
    {
        ", the power to appoint someone to form a government has been moved from the ": null
    },
    {
        "monarch": "monarch of sweden"
    },
    {
        " to the Speaker of Parliament and the parliament itself. The speaker nominates a candidate, who is then elected to prime minister  by the parliament if an absolute majority of the members of parliament does not vote no .          The position, power and status of prime ministers differ depending on the age of the constitution.     Australias ": null
    },
    {
        "constitution": "constitution of australia"
    },
    {
        " makes no mention of a ": null
    },
    {
        "Prime Minister of Australia": "prime minister of australia"
    },
    {
        " and the office only exists by convention, based on the British model.     Bangladeshs ": null
    },
    {
        "constitution": "constitution of bangladesh"
    },
    {
        " clearly outlines the functions and powers of the ": null
    },
    {
        "Prime Minister": "prime minister of bangladesh"
    },
    {
        ", and also details the process of his/her appointment and dismissal.     The Peoples Republic of China ": null
    },
    {
        "constitution": "constitution of the peoples republic of china"
    },
    {
        " set a ": null
    },
    {
        "premier": "premier of the peoples republic of china"
    },
    {
        " just one place below the ": null
    },
    {
        "National Peoples Congress": "national peoples congress"
    },
    {
        " in China. Premier read as  in Chinese.     Canadas ": null
    },
    {
        "constitution": "constitution of canada"
    },
    {
        ", being a mixed or hybrid constitution originally did not make any reference whatsoever to a prime minister, with her or his specific duties and method of appointment instead dictated by convention . In the  Constitution Act, 1982 , passing reference to a ": null
    },
    {
        "Prime Minister of Canada": "prime minister of canada"
    },
    {
        " is added, though only regarding the composition of ": null
    },
    {
        "conferences": "first ministers conference"
    },
    {
        " of federal and provincial ": null
    },
    {
        "first minister": "first ministercanada"
    },
    {
        "s.     Czech Republics ": null
    },
    {
        "constitution": "constitution of the czech republic"
    },
    {
        " clearly outlines the functions and powers of the ": null
    },
    {
        "Prime Minister of the Czech Republic": "prime minister of the czech republic"
    },
    {
        ", and also details the process of his/her appointment and dismissal.     Frances ": null
    },
    {
        "constitution": "constitution of france"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of France": "prime minister of france"
    },
    {
        ".     Germanys ": null
    },
    {
        "Basic Law": "basic law of the federal republic of germany"
    },
    {
        " lists the powers, functions and duties of the federal ": null
    },
    {
        "chancellor": "chancellor of germany"
    },
    {
        ".     Greeces ": null
    },
    {
        "constitution": "constitution of greece"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of Greece": "prime minister of greece"
    },
    {
        ".     Hungarys ": null
    },
    {
        "constitution": "constitution of hungary"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of Hungary": "prime minister of hungary"
    },
    {
        ".     Indias ": null
    },
    {
        "constitution": "constitution of india"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of India": "prime minister of india"
    },
    {
        ". In India, prime ministerial candidates must be a member of parliament, i.e. of either the Lok Sabha or Rajya Sabha . No parliamentary vote takes place on who forms a government.     Irelands ": null
    },
    {
        "constitution": "constitution of ireland"
    },
    {
        " , provides for the office of ": null
    },
    {
        "Taoiseach": "taoiseach"
    },
    {
        " in detail, listing powers, functions and duties.     Italys ": null
    },
    {
        "constitution": "constitution of italy"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "President of the Council of Ministers": "prime minister of italy"
    },
    {
        ".     Japans ": null
    },
    {
        "constitution": "constitution of japan"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of Japan": "prime minister of japan"
    },
    {
        ".     The Republic of Koreas ": null
    },
    {
        "constitution": "constitution of south korea"
    },
    {
        " sections 86–87 list the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of the Republic of Korea": "prime minister of south korea"
    },
    {
        ".     Maltas ": null
    },
    {
        "constitution": "constitution of malta"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of Malta": "prime minister of malta"
    },
    {
        ".     Malaysias ": null
    },
    {
        "constitution": "constitution of malaysia"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of Malaysia": "prime minister of malaysia"
    },
    {
        ".     Norways ": null
    },
    {
        "constitution": "constitution of norway"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of Norway": "prime minister of norway"
    },
    {
        "     Pakistans ": null
    },
    {
        "constitution": "constitution of pakistan"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of Pakistan": "prime minister of pakistan"
    },
    {
        ".     Spains ": null
    },
    {
        "constitution": "spanish constitution of 1978"
    },
    {
        " regulates the appointment, dismissal, powers, functions and duties of the ": null
    },
    {
        "President of the Government": "prime minister of spain"
    },
    {
        ".     Thailands ": null
    },
    {
        "constitution": "constitution of thailand"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of Thailand": "prime minister of thailand"
    },
    {
        ".     Taiwans ": null
    },
    {
        "constitution": "constitution of the republic of china"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "President of the Executive Yuan": "president of the executive yuan"
    },
    {
        ".     The United Kingdoms ": null
    },
    {
        "constitution": "constitution of the united kingdom"
    },
    {
        ", being ": null
    },
    {
        "uncodified": "uncodified constitution"
    },
    {
        " and largely unwritten, makes no mention of a ": null
    },
    {
        "prime minister": "prime minister of the united kingdom"
    },
    {
        ". Though it had  de facto  existed for centuries, its first mention in official state documents did not occur until the first decade of the twentieth century. Accordingly, it is often said not to exist , indeed there are several instances of parliament declaring this to be the case. The prime minister sits in the cabinet solely by virtue of occupying another office, either ": null
    },
    {
        "First Lord of the Treasury": "first lord of the treasury"
    },
    {
        " , or more rarely ": null
    },
    {
        "Chancellor of the Exchequer": "chancellor of the exchequer"
    },
    {
        " . However as the government will have to outline its legislative programme to parliament in, for example, the ": null
    },
    {
        "Speech from the Throne": "speech from the throne"
    },
    {
        ", the speech is sometimes used to test parliamentary support. A defeat of the Speech is taken to mean a ": null
    },
    {
        "loss of confidence": "motion of confidence"
    },
    {
        " and so requires either a new draft, resignation, or a request for a dissolution of parliament. Until the early 20th century governments when defeated in a general election remained in power until their Speech from the Throne was defeated and then resigned. No government has done so for one hundred years, though ": null
    },
    {
        "Edward Heath": "edward heath"
    },
    {
        " in 1974 did delay his resignation while he explored whether he could form a government with ": null
    },
    {
        "Liberal party": "liberal party"
    },
    {
        " support.   :In such systems unwritten constitutional conventions often outline the order in which people are asked to form a government. If the prime minister resigns after a general election, the monarch usually asks the leader of the opposition to form a government. Where however a resignation occurs during a parliament session the monarch will ask another member of the government to form a government. While previously the monarch had some leeway in whom to ask, all British political parties now elect their leaders . The last time the monarch had a choice over the appointment occurred in 1963 when the ": null
    },
    {
        "Earl of Home": "alec douglas-home"
    },
    {
        " was asked to become Prime Minister ahead of ": null
    },
    {
        "Rab Butler": "rab butler"
    },
    {
        ".   During the period between the time it is clear that the incumbent government has been defeated at a general election, and the actual swearing-in of the new prime minister by the monarch, governor-general, or president, that person is referred to as the prime minister-elect or prime minister-designate . Neither term is strictly correct from a constitutional point of view, but they have wide acceptance. In a situation in which a ruling party elects or appoints a new leader, the incoming leader will usually be referred as prime minister-in-waiting . An example or this situation was in 2016 in the United Kingdom when ": null
    },
    {
        "Theresa May": "theresa may"
    },
    {
        " was elected leader of the ": null
    },
    {
        "Conservative Party": "conservative party"
    },
    {
        " while ": null
    },
    {
        "David Cameron": "david cameron"
    },
    {
        " was still prime minister.     Ukraines ": null
    },
    {
        "constitution": "constitution of ukraine"
    },
    {
        " lists the powers, functions and duties of the ": null
    },
    {
        "Prime Minister of Ukraine": "prime minister of ukraine"
    },
    {
        ".       Most prime ministers in ": null
    },
    {
        "parliament": "parliament"
    },
    {
        "ary systems are not appointed for a specific term in office and in effect may remain in power through a number of ": null
    },
    {
        "elections": "election"
    },
    {
        "and parliaments. For example, ": null
    },
    {
        "Margaret Thatcher": "margaret thatcher"
    },
    {
        " was only ever appointed prime minister on one occasion, in 1979. She remained continuously in power until 1990, though she used the assembly of each ": null
    },
    {
        "House of Commons": "british house of commons"
    },
    {
        " after a ": null
    },
    {
        "general election": "general election"
    },
    {
        " to ": null
    },
    {
        "reshuffle her cabinet": "cabinet reshuffle"
    },
    {
        ".     Some states, however, do have a term of office of the prime minister linked to the period in office of the parliament. Hence the ": null
    },
    {
        "Irish": "republic of ireland"
    },
    {
        " Taoiseach": "taoiseach"
    },
    {
        " is formally ": null
    },
    {
        "renominated": "renominated"
    },
    {
        " after every general election.  The position of prime minister is normally chosen from the political party that commands majority of seats in the lower house of parliament.     In parliamentary systems, ": null
    },
    {
        "governments": "government"
    },
    {
        "are generally required to have the confidence of the ": null
    },
    {
        "lower house of parliament": "lower house"
    },
    {
        " . Where they lose a  vote of confidence , have a  motion of no confidence  passed against them, or where they lose supply, most ": null
    },
    {
        "constitution": "constitution"
    },
    {
        "al systems require either:          The latter in effect allows the government to appeal the ": null
    },
    {
        "opposition": "opposition"
    },
    {
        " of parliament to the ": null
    },
    {
        "electorate": "constituency"
    },
    {
        ". However, in many ": null
    },
    {
        "jurisdictions": "jurisdiction"
    },
    {
        "a head of state may refuse a parliamentary dissolution, requiring the resignation of the prime minister and his or her government. In most modern parliamentary systems, the prime minister is the person who decides when to request a parliamentary dissolution.     Older constitutions often vest this power in the ": null
    },
    {
        "cabinet": "cabinet"
    },
    {
        ". In the United Kingdom, for example, the tradition whereby it is the prime minister who requests a dissolution of parliament dates back to 1918. Prior to then, it was the entire government that made the request. Similarly, though the modern 1937 Irish constitution grants to the Taoiseach the right to make the request, the earlier 1922 ": null
    },
    {
        "Irish Free State Constitution": "irish free state constitution"
    },
    {
        " vested the power in the  Executive Council  .     In ": null
    },
    {
        "Australia": "australia"
    },
    {
        ", the Prime Minister is expected to step down if they loses the majority support of their party under a ": null
    },
    {
        "spill motion": "spill motion"
    },
    {
        " as have many such as ": null
    },
    {
        "Tony Abbott": "tony abbott"
    },
    {
        ", ": null
    },
    {
        "Julia Gillard": "julia gillard"
    },
    {
        ", ": null
    },
    {
        "Kevin Rudd": "kevin rudd"
    },
    {
        " and ": null
    },
    {
        "Malcolm Turnbull": "malcolm turnbull"
    },
    {
        ".       In ": null
    },
    {
        "the Russian constitution": "constitution of russia"
    },
    {
        " the prime minister is actually titled Chairman of the government while the Irish prime minister is called the  , and in ": null
    },
    {
        "Israel": "israel"
    },
    {
        " he is Rosh HaMemshalah meaning head of the government . In many cases, though commonly used, prime minister is not the official title of the office-holder; the Spanish prime minister is the ": null
    },
    {
        "President of the Government": "prime minister of spain"
    },
    {
        " .     Other common forms include ": null
    },
    {
        "president of the council of ministers": "president of the council of ministers"
    },
    {
        " , ": null
    },
    {
        "President of the Executive Council": "minister-president"
    },
    {
        ", or ": null
    },
    {
        "Minister-President": "minister-president"
    },
    {
        ". In the Nordic countries the prime minister is called Statsminister, meaning Minister of State . In ": null
    },
    {
        "federation": "federation"
    },
    {
        "s, the head of government of ": null
    },
    {
        "subnational entities": "subnational entities"
    },
    {
        " such as ": null
    },
    {
        "provinces": "province"
    },
    {
        "is most commonly known as the ": null
    },
    {
        "premier": "premier"
    },
    {
        ", ": null
    },
    {
        "chief minister": "chief minister"
    },
    {
        ", ": null
    },
    {
        "governor": "governor"
    },
    {
        " or ": null
    },
    {
        "minister-president": "minister-president"
    },
    {
        ".     The convention in the English language is to call nearly all national heads of government prime minister except in the cases where the head of state and head of government are fused into one position, usually a presidency, regardless of the correct title of the head of government as applied in his or her respective country. The few exceptions to the rule are Germany and Austria, whose heads of government titles are almost always translated as Chancellor; Monaco, whose head of government is referred to as the Minister of State; and Vatican City, for which the head of government is titled the Secretary of State. In the case of Ireland, the head of government is occasionally referred to as the Taoiseach by English speakers. A stand-out case is the President of Iran, who is not actually a head of state, but the head of the government of Iran. He is referred to as president in both the ": null
    },
    {
        "Persian": "persian language"
    },
    {
        " and English languages.     In non-Commonwealth countries the prime minister may be entitled to the style of ": null
    },
    {
        "Excellency": "excellency"
    },
    {
        " like a president. In some Commonwealth countries prime ministers and former prime ministers are styled ": null
    },
    {
        "Right Honourable": "right honourable"
    },
    {
        " due to their position, for example in the ": null
    },
    {
        "Prime Minister of Canada": "prime minister of canada"
    },
    {
        ". In the United Kingdom the prime minister and former prime ministers may appear to also be styled ": null
    },
    {
        "Right Honourable": "right honourable"
    },
    {
        ", however this is not due to their position as head of government but as a ": null
    },
    {
        "privilege": "privilege"
    },
    {
        " of being current members of ": null
    },
    {
        "Her Majestys Most Honourable Privy Council": "her majestys most honourable privy councilrights and privileges of members"
    },
    {
        ".      In the UK, where devolved government is in place, the leaders of the ": null
    },
    {
        "Scottish": "scottish government"
    },
    {
        ", ": null
    },
    {
        "Northern Irish": "northern ireland executive"
    },
    {
        " and ": null
    },
    {
        "Welsh": "welsh assembly government"
    },
    {
        " Governments are styled ": null
    },
    {
        "First Minister": "first minister"
    },
    {
        ". Between 1921 and 1972, when Northern Ireland was a Majority Rule Parliament the head of government would be known as the ": null
    },
    {
        "Prime Minister of Northern Ireland": "prime minister of northern ireland"
    },
    {
        ". In India, the Prime Minister is called Pradhan Mantri meaning the Prime Minister. In Pakistan, the prime minister is referred to as Wazir-e-Azam, meaning Grand Vizier .               The Prime Ministers executive office is usually called the Office of the Prime Minister in the case of the Canada and other Commonwealth countries, it is called ": null
    },
    {
        "Cabinet Office": "cabinet office"
    },
    {
        " in United Kingdom. Some Prime Ministers office do include the role of Cabinet. In other countries, it is called the Prime Ministers Department or the Department of the Prime Minister and Cabinet as for Australia. In Israel, the Prime Ministers executive office is officially titled the Prime Ministers Office in English, but the original Hebrew term can also be translated as the Prime Ministers Ministry.       ": null
    },
    {
        "Wilfried Martens": "wilfried martens"
    },
    {
        ", who served as Prime Minister of Belgium, described his role as follows:     :First of all the Prime Minister must listen a lot, and when deep disagreements occur, he must suggest a solution to the matter. This can be done in different ways. Sometimes during the discussion, I note the elements of the problem and think of a proposal I can formulate to the Council , the Secretary taking notes. The Ministers then insist on changing game ages. The Prime Minister can also make a proposal which leaves enough room for amendments in order to keep the current discussion on the right tracks. When a solution must be found in order to reach a consensus, he can force one or two Ministers to join or resign.               The following table groups the list of past and present prime ministers and details information available in those lists.     ": null
    }
]