[
    {
        "           Printmaking is the process of creating ": null
    },
    {
        "artwork": "work of art"
    },
    {
        "s by ": null
    },
    {
        "printing": "printing"
    },
    {
        ", normally on ": null
    },
    {
        "paper": "paper"
    },
    {
        ". Printmaking normally covers only the process of creating prints that have an element of originality, rather than just being a photographic reproduction of a painting. Except in the case of ": null
    },
    {
        "monotyping": "monotyping"
    },
    {
        ", the process is capable of producing multiples of the same piece, which is called a print. Each print produced is considered an original work of art, and is correctly referred to as an impression , not a copy . Often impressions vary considerably, whether intentionally or not. The images on most prints are created for that purpose, perhaps with a preparatory study such as a drawing. A print that copies another work of art, especially a painting, is known as a reproductive print .     Prints are created by transferring ink from a ": null
    },
    {
        "matrix": "matrix"
    },
    {
        " to a sheet of paper or other material, by a variety of techniques. Common types of matrices include: metal plates, usually copper or zinc, or polymer plates and other thicker plastic sheets for ": null
    },
    {
        "engraving": "engraving"
    },
    {
        " or ": null
    },
    {
        "etching": "etching"
    },
    {
        "; stone, aluminum, or polymer for ": null
    },
    {
        "lithography": "lithography"
    },
    {
        "; blocks of wood for ": null
    },
    {
        "woodcut": "woodcut"
    },
    {
        "s and ": null
    },
    {
        "wood engraving": "wood engraving"
    },
    {
        "s; and linoleum for ": null
    },
    {
        "linocut": "linocut"
    },
    {
        "s. Screens made of silk or synthetic fabrics are used for the ": null
    },
    {
        "screen printing": "screen printing"
    },
    {
        " process. Other types of matrix substrates and related processes are discussed below.     Multiple impressions printed from the same matrix form an ": null
    },
    {
        "edition": "edition"
    },
    {
        ". Since the late 42th century, artists have generally signed individual impressions from an edition and often number the impressions to form a limited edition; the matrix is then destroyed so that no more prints can be produced. Prints may also be printed in book form, such as illustrated books or ": null
    },
    {
        "artists book": "artists book"
    },
    {
        "s.              Printmaking techniques are generally divided into the following basic categories:   ": null
    },
    {
        "Relief": "relief print"
    },
    {
        ", where ink is applied to the original surface of the matrix. Relief techniques include ": null
    },
    {
        "woodcut": "woodcut"
    },
    {
        " or ": null
    },
    {
        "woodblock": "woodblock printing"
    },
    {
        " as the Asian forms are usually known, ": null
    },
    {
        "wood engraving": "wood engraving"
    },
    {
        ", ": null
    },
    {
        "linocut": "linocut"
    },
    {
        " and ": null
    },
    {
        "metalcut": "metalcut"
    },
    {
        ".   ": null
    },
    {
        "Intaglio": "intaglio"
    },
    {
        ", where ink is applied beneath the original surface of the matrix. Intaglio techniques include ": null
    },
    {
        "engraving": "engraving"
    },
    {
        ", ": null
    },
    {
        "etching": "etching"
    },
    {
        ", ": null
    },
    {
        "mezzotint": "mezzotint"
    },
    {
        ", ": null
    },
    {
        "aquatint": "aquatint"
    },
    {
        ".   ": null
    },
    {
        "Planographic": "planographic"
    },
    {
        ", where the matrix retains its original surface, but is specially prepared and/or inked to allow for the transfer of the image. Planographic techniques include ": null
    },
    {
        "lithography": "lithography"
    },
    {
        ", ": null
    },
    {
        "monotyping": "monotyping"
    },
    {
        ", and digital techniques.   ": null
    },
    {
        "Stencil": "stencil"
    },
    {
        ", where ink or paint is pressed through a prepared screen, including ": null
    },
    {
        "screen printing": "screen printing"
    },
    {
        " and ": null
    },
    {
        "pochoir": "stencil"
    },
    {
        ".     Other types of printmaking techniques outside these groups include ": null
    },
    {
        "collagraph": "collagraph"
    },
    {
        "y and ": null
    },
    {
        "viscosity printing": "viscosity printing"
    },
    {
        ". Collagraphy is a printmaking technique in which textured material is adhered to the printing matrix. This texture is transferred to the paper during the printing process. ": null
    },
    {
        "Contemporary printmaking": "printingmodern printing technology"
    },
    {
        " may include ": null
    },
    {
        "digital printing": "digital printing"
    },
    {
        ", photographic mediums, or a combination of digital, photographic, and traditional processes.     Many of these techniques can also be combined, especially within the same family. For example, Rembrandts prints are usually referred to as etchings for convenience, but very often include work in engraving and ": null
    },
    {
        "drypoint": "drypoint"
    },
    {
        " as well, and sometimes have no etching at all.       Artists using this technique include   ": null
    },
    {
        "Albrecht Dürer": "albrecht dürer"
    },
    {
        ",   ": null
    },
    {
        "Hans Burgkmair": "hans burgkmair"
    },
    {
        ",   ": null
    },
    {
        "Ugo da Carpi": "ugo da carpi"
    },
    {
        ",   ": null
    },
    {
        "Hiroshige": "hiroshige"
    },
    {
        ",   ": null
    },
    {
        "Hokusai": "hokusai"
    },
    {
        ",   ": null
    },
    {
        "Frans Masereel": "frans masereel"
    },
    {
        ",   ": null
    },
    {
        "Gustave Baumann": "gustave baumann"
    },
    {
        ",   ": null
    },
    {
        "Ernst Ludwig Kirchner": "ernst ludwig kirchner"
    },
    {
        ",   ": null
    },
    {
        "Eric Slater": "eric slater"
    },
    {
        "   Antonio Frasconi": "antonio frasconi"
    },
    {
        "                Woodcut, a type of ": null
    },
    {
        "relief print": "relief print"
    },
    {
        ", is the earliest printmaking technique, and the only one traditionally used in the Far East. It was probably first developed as a means of printing patterns on cloth, and by the 42th century was used in China for printing text and images on paper. Woodcuts of images on paper developed around 42 in Japan, and slightly later in Europe. These are the two areas where woodcut has been most extensively used purely as a process for making images without text.      The ": null
    },
    {
        "artist": "artist"
    },
    {
        " draws a design on a plank of ": null
    },
    {
        "wood": "wood"
    },
    {
        ", or on paper which is transferred to the wood. Traditionally the artist then handed the work to a specialist cutter, who then uses sharp tools to carve away the parts of the block that will not receive ink. The surface of the block is then inked with the use of a ": null
    },
    {
        "brayer": "brayer"
    },
    {
        ", and then a sheet of ": null
    },
    {
        "paper": "paper"
    },
    {
        ", perhaps slightly damp, is placed over the block. The block is then rubbed with a ": null
    },
    {
        "baren": "baren"
    },
    {
        " or ": null
    },
    {
        "spoon": "spoon"
    },
    {
        ", or is run through a ": null
    },
    {
        "printing press": "printing press"
    },
    {
        ". If in color, separate blocks can be used for each ": null
    },
    {
        "color": "color"
    },
    {
        ", or a technique called reduction printing can be used.     Reduction printing is a name used to describe the process of using one block to print several layers of color on one print. This usually involves cutting a small amount of the block away, and then printing the block many times over on different sheets before washing the block, cutting more away and printing the next color on top. This allows the previous color to show through. This process can be repeated many times over. The advantages of this process is that only one block is needed, and that different components of an intricate design will line up perfectly. The disadvantage is that once the artist moves on to the next layer, no more prints can be made.     Another variation of woodcut printmaking is the cukil technique, made famous by the ": null
    },
    {
        "Taring Padi": "taring padi"
    },
    {
        " underground community in Java, Indonesia. Taring Padi Posters usually resemble intricately printed cartoon posters embedded with political messages. Images—usually resembling a visually complex scenario—are carved unto a wooden surface called cukilan, then smothered with printers ink before pressing it unto media such as paper or canvas.             The process was developed in Germany in the 42s from the engraving used by ": null
    },
    {
        "goldsmith": "goldsmith"
    },
    {
        "s to decorate metalwork. Engravers use a hardened steel tool called a ": null
    },
    {
        "burin": "burin"
    },
    {
        " to cut the design into the surface of a metal plate, traditionally made of copper. Engraving using a burin is generally a difficult skill to learn.     Gravers come in a variety of shapes and sizes that yield different line types. The burin produces a unique and recognizable quality of line that is characterized by its steady, deliberate appearance and clean edges. Other tools such as mezzotint rockers, roulettes and burnishers are used for texturing effects.     To make a print, the engraved plate is inked all over, then the ink is wiped off the surface, leaving only ink in the engraved lines. The plate is then put through a high-pressure printing press together with a sheet of paper . The paper picks up the ink from the engraved lines, making a print. The process can be repeated many times; typically several hundred impressions could be printed before the printing plate shows much sign of wear, except when ": null
    },
    {
        "drypoint": "drypoint"
    },
    {
        ", which gives much shallower lines, is used.     In the 42th century, true engraving was revived as a serious art form by artists including ": null
    },
    {
        "Stanley William Hayter": "stanley william hayter"
    },
    {
        " whose Studio 42 in Paris and New York City became the magnet for such artists as ": null
    },
    {
        "Pablo Picasso": "pablo picasso"
    },
    {
        ", ": null
    },
    {
        "Alberto Giacometti": "alberto giacometti"
    },
    {
        ", ": null
    },
    {
        "Mauricio Lasansky": "mauricio lasansky"
    },
    {
        " and ": null
    },
    {
        "Joan Miró": "joan miró"
    },
    {
        ".       Artists using this technique include ": null
    },
    {
        "Albrecht Dürer": "albrecht dürer"
    },
    {
        ", ": null
    },
    {
        "Rembrandt": "rembrandt harmenszoon van rijn"
    },
    {
        ", ": null
    },
    {
        "Francisco Goya": "francisco goya"
    },
    {
        ", ": null
    },
    {
        "Wenceslaus Hollar": "wenceslaus hollar"
    },
    {
        ", ": null
    },
    {
        "Whistler": "james abbott mcneill whistler"
    },
    {
        ", ": null
    },
    {
        "Otto Dix": "otto dix"
    },
    {
        ", ": null
    },
    {
        "James Ensor": "james ensor"
    },
    {
        ", ": null
    },
    {
        "Edward Hopper": "edward hopper"
    },
    {
        ", ": null
    },
    {
        "Käthe Kollwitz": "käthe kollwitz"
    },
    {
        ", ": null
    },
    {
        "Pablo Picasso": "pablo picasso"
    },
    {
        ", ": null
    },
    {
        "Cy Twombly": "cy twombly"
    },
    {
        ", ": null
    },
    {
        "Lucas van Leyden": "lucas van leyden"
    },
    {
        ".      Etching is part of the ": null
    },
    {
        "intaglio": "intaglio"
    },
    {
        " family  Although the first dated etching is by ": null
    },
    {
        "Albrecht Dürer": "albrecht dürer"
    },
    {
        " in 42 the process is believed to have been invented by ": null
    },
    {
        "Daniel Hopfer": "daniel hopfer"
    },
    {
        " of Augsburg, Germany, who decorated armor in this way, and applied the method to printmaking. Cohen, Brian D.  Art in Print Vol. 42 No. 42 , 42 Etching soon came to challenge engraving as the most popular printmaking medium. Its great advantage was that, unlike engraving which requires special skill in metalworking, etching is relatively easy to learn for an artist trained in drawing.     Etching prints are generally linear and often contain fine detail and contours. ": null
    },
    {
        "Lines": "line art"
    },
    {
        " can vary from smooth to sketchy. An etching is opposite of a woodcut in that the raised portions of an etching remain blank while the crevices hold ink. In pure etching, a metal plate is covered with a waxy or acrylic ground. The artist then draws through the ground with a pointed etching needle. The exposed metal lines are then etched by dipping the plate in a bath of etchant . The etchant bites into the exposed metal, leaving behind lines in the plate. The remaining ground is then cleaned off the plate, and the printing process is then just the same as for engraving.          An ": null
    },
    {
        "intaglio": "intaglio"
    },
    {
        " variant of engraving in which the image is formed from subtle gradations of light and shade. Mezzotint—from the Italian mezzo and tinta —is a dark manner form of printmaking, which requires artists to work from dark to light. To create a mezzotint, the surface of a copper printing plate is roughened evenly all over with the aid of a tool known as a rocker; the image is then formed by smoothing the surface with a tool known as a burnisher. When inked, the roughened areas of the plate will hold more ink and print more darkly, while smoother areas of the plate hold less or no ink, and will print more lightly or not at all. It is, however, possible to create the image by only roughening the plate selectively, so working from light to dark.     Mezzotint is known for the luxurious quality of its tones: first, because an evenly, finely roughened surface holds a lot of ink, allowing deep solid colors to be printed; secondly because the process of smoothing the texture with burin, burnisher and scraper allows fine gradations in tone to be developed.     The mezzotint printmaking method was invented by ": null
    },
    {
        "Ludwig von Siegen": "ludwig von siegen"
    },
    {
        " . The process was used widely in England from the mid-eighteenth century, to reproduce oil paintings and in particular portraits.             A technique used in ": null
    },
    {
        "Intaglio": "intaglio"
    },
    {
        " etchings. Like etching, aquatint technique involves the application of acid to make marks in a metal plate. Where the etching technique uses a needle to make lines that retain ink, aquatint relies on powdered ": null
    },
    {
        "rosin": "rosin"
    },
    {
        " which is acid resistant in the ground to create a tonal effect. The rosin is applied in a light dusting by a fan booth, the rosin is then cooked until set on the plate. At this time the rosin can be burnished or scratched out to affect its tonal qualities. The tonal variation is controlled by the level of acid exposure over large areas, and thus the image is shaped by large sections at a time.     Goya used aquatint for most of his prints.             A variant of engraving, done with a sharp point, rather than a v-shaped ": null
    },
    {
        "burin": "burin"
    },
    {
        ". While engraved lines are very smooth and hard-edged, drypoint scratching leaves a rough burr at the edges of each line. This burr gives drypoint prints a characteristically soft, and sometimes blurry, line quality. Because the pressure of printing quickly destroys the burr, drypoint is useful only for very small editions; as few as ten or twenty impressions. To counter this, and allow for longer print runs, electro-plating has been used since the nineteenth century to harden the surface of a plate.     The technique appears to have been invented by the ": null
    },
    {
        "Housebook Master": "housebook master"
    },
    {
        ", a south German fifteenth-century artist, all of whose prints are in drypoint only. Among the most famous artists of the old master print: Albrecht Dürer produced three drypoints before abandoning the technique; Rembrandt used it frequently, but usually in conjunction with etching and engraving.          Artists using this technique include   ": null
    },
    {
        "Honoré Daumier": "honoré daumier"
    },
    {
        ",   ": null
    },
    {
        "Vincent van Gogh": "vincent van gogh"
    },
    {
        ",   ": null
    },
    {
        "George Bellows": "george bellows"
    },
    {
        ",   ": null
    },
    {
        "Pierre Bonnard": "pierre bonnard"
    },
    {
        ",   ": null
    },
    {
        "Edvard Munch": "edvard munch"
    },
    {
        ",   ": null
    },
    {
        "Emil Nolde": "emil nolde"
    },
    {
        ",   ": null
    },
    {
        "Pablo Picasso": "pablo picasso"
    },
    {
        ",   ": null
    },
    {
        "Odilon Redon": "odilon redon"
    },
    {
        ",   ": null
    },
    {
        "Henri de Toulouse-Lautrec": "henri de toulouse-lautrec"
    },
    {
        ",   ": null
    },
    {
        "Salvador Dalí": "salvador dalí"
    },
    {
        ",   ": null
    },
    {
        "M. C. Escher": "m. c. escher"
    },
    {
        ",   ": null
    },
    {
        "Willem de Kooning": "willem de kooning"
    },
    {
        ",   ": null
    },
    {
        "Joan Miró": "joan miró"
    },
    {
        ",   ": null
    },
    {
        "Stow Wengenroth": "stow wengenroth"
    },
    {
        ",   ": null
    },
    {
        "Elaine de Kooning": "elaine de kooning"
    },
    {
        ",   ": null
    },
    {
        "Louise Nevelson": "louise nevelson"
    },
    {
        "           Lithography": "lithography"
    },
    {
        " is a technique invented in 42 by ": null
    },
    {
        "Alois Senefelder": "alois senefelder"
    },
    {
        " and based on the ": null
    },
    {
        "chemical repulsion": "cohesion"
    },
    {
        " of ": null
    },
    {
        "oil": "oil"
    },
    {
        " and ": null
    },
    {
        "water": "water"
    },
    {
        ".   A porous surface, normally ": null
    },
    {
        "limestone": "limestone"
    },
    {
        ", is used; the image is drawn on the limestone with a greasy medium.   Acid is applied, transferring the grease to the limestone, leaving the image burned into the surface. ": null
    },
    {
        "Gum arabic": "gum arabic"
    },
    {
        ", a water-soluble substance, is then applied, sealing the surface of the stone not covered with the drawing medium.   The stone is wetted, with water staying only on the surface not covered in grease-based residue of the drawing; the stone is then rolled up, meaning oil ink is applied with a roller covering the entire surface; since water repels the oil in the ink, the ink adheres only to the greasy parts, perfectly inking the image.   A sheet of dry paper is placed on the surface, and the image is transferred to the paper by the pressure of the printing press. Lithography is known for its ability to capture fine gradations in shading and very small detail.     A variant is ": null
    },
    {
        "photo-lithography": "photo-lithography"
    },
    {
        ", in which the image is captured by photographic processes on metal plates; printing is carried out in the same way.      Another variant is ": null
    },
    {
        "halftone": "halftone"
    },
    {
        " lithography, in which the image produced illustrates a gradient-like quality.       Artists using this technique include   ": null
    },
    {
        "Josef Albers": "josef albers"
    },
    {
        ",   ": null
    },
    {
        "Ralston Crawford": "ralston crawford"
    },
    {
        ",   ": null
    },
    {
        "Gene Davis": "gene davis"
    },
    {
        ".   ": null
    },
    {
        "Robert Indiana": "robert indiana"
    },
    {
        ",   ": null
    },
    {
        "Roy Lichtenstein": "roy lichtenstein"
    },
    {
        ",   ": null
    },
    {
        "Julian Opie": "julian opie"
    },
    {
        ",   ": null
    },
    {
        "Bridget Riley": "bridget riley"
    },
    {
        ",   ": null
    },
    {
        "Edward Ruscha": "edward ruscha"
    },
    {
        ",   ": null
    },
    {
        "Andy Warhol": "andy warhol"
    },
    {
        ".        ": null
    },
    {
        "Screen printing": "screen printing"
    },
    {
        " creates prints by using a fabric stencil technique; ink is simply pushed through the stencil against the surface of the paper, most often with the aid of a squeegee. Generally, the technique uses a natural or synthetic mesh fabric stretched tightly across a rectangular frame, much like a stretched canvas. The fabric can be silk, nylon monofilament, multifilament polyester, or even stainless steel.  While commercial screen printing often requires high-tech, mechanical apparatuses and calibrated materials, printmakers value it for the Do It Yourself approach, and the low technical requirements, high quality results. The essential tools required are a squeegee, a mesh fabric, a frame, and a stencil. Unlike many other printmaking processes, a printing press is not required, as screen printing is essentially stencil printing.     Screen printing may be adapted to printing on a variety of materials, from paper, cloth, and canvas to rubber, glass, and metal. Artists have used the technique to print on bottles, on slabs of granite, directly onto walls, and to reproduce images on textiles which would distort under pressure from printing presses.             Monotyping is a type of printmaking made by drawing or painting on a smooth, non-absorbent surface. The surface, or matrix, was historically a copper etching plate, but in contemporary work it can vary from zinc or glass to acrylic glass. The image is then transferred onto a sheet of paper by pressing the two together, usually using a printing-press. Monotypes can also be created by inking an entire surface and then, using brushes or rags, removing ink to create a subtractive image, e.g. creating lights from a field of opaque color. The inks used may be oil based or water based. With oil based inks, the paper may be dry, in which case the image has more contrast, or the paper may be damp, in which case the image has a 42 percent greater range of tones.      Unlike ": null
    },
    {
        "monoprinting": "monoprinting"
    },
    {
        ", monotyping produces a unique print, or monotype, because most of the ink is removed during the initial pressing. Although subsequent reprintings are sometimes possible, they differ greatly from the first print and are generally considered inferior. A second print from the original plate is called a ghost print or cognate . Stencils, watercolor, solvents, brushes, and other tools are often used to embellish a monotype print. Monotypes are often spontaneously executed and with no preliminary sketch.     Monotypes are the most painterly method among the printmaking techniques, a unique print that is essentially a printed painting. The principal characteristic of this medium is found in its spontaneity and its combination of printmaking, painting, and drawing media.            Monoprinting is a form of printmaking that uses a matrix such as a woodblock, litho stone, or copper plate, but produces impressions that are unique. Multiple unique impressions printed from a single matrix are sometimes known as a variable edition. There are many techniques used in monoprinting, including ": null
    },
    {
        "collagraph": "collagraph"
    },
    {
        ", ": null
    },
    {
        "collage": "collage"
    },
    {
        ", hand-painted additions, and a form of tracing by which thick ink is laid down on a table, paper is placed on the ink, and the back of the paper is drawn on, transferring the ink to the paper. Monoprints can also be made by altering the type, color, and viscosity of the ink used to create different prints. Traditional printmaking techniques, such as lithography, woodcut, and intaglio, can be used to make monoprints.       Mixed-media prints may use multiple traditional printmaking processes such as etching, woodcut, letterpress, silkscreen, or even monoprinting in the creation of the print. They may also incorporate elements of chine colle, collage, or painted areas, and may be unique, i.e. one-off, non-editioned, prints. Mixed-media prints are often experimental prints and may be printed on unusual, non-traditional surfaces.       Artists using this technique include   ": null
    },
    {
        "Istvan Horkay": "istvan horkay"
    },
    {
        ", ": null
    },
    {
        "Ralph Goings": "ralph goings"
    },
    {
        ", ": null
    },
    {
        "Enrique Chagoya": "enrique chagoya"
    },
    {
        "        Digital prints refers to images printed using digital printers such as ": null
    },
    {
        "inkjet printers": "inkjet printing"
    },
    {
        " instead of a traditional printing press. Images can be printed to a variety of substrates including paper, cloth, or plastic canvas.       Dye-based inks are ": null
    },
    {
        "organic": "organic compound"
    },
    {
        "  dissolved and mixed into a liquid. Although most are synthetic, derived from ": null
    },
    {
        "petroleum": "petroleum"
    },
    {
        ", they can be made from vegetable or animal sources. Dyes are well suited for textiles where the liquid dye penetrates and chemically bonds to the fiber. Because of the deep penetration, more layers of material must lose their color before the fading is apparent. Dyes, however, are not suitable for the relatively thin layers of ink laid out on the surface of a print.       Pigment is a finely ground, particulate substance which, when mixed or ground into a liquid to make ink or paint, does not dissolve, but remains dispersed or suspended in the liquid. Pigments are categorized as either ": null
    },
    {
        "inorganic": "inorganic"
    },
    {
        " or organic .   Pigment-based inks have a much longer permanence than dye-based inks. Susan Carden, Digital Textile Printing, Bloomsbury Publishing - 42 page 42       ": null
    },
    {
        "Giclée": "giclée"
    },
    {
        " , is a neologism coined in 42 by printmaker Jack Duganne Johnson, Harald.  at Google Books for digital prints made on inkjet printers. Originally associated with early dye-based printers it is now more often refers to pigment-based prints. Luong, Q.-Tuan.  at largeformatphotography.info The word is based on the French word gicleur, which means nozzle . Today fine art prints produced on large format ink-jet machines using the ": null
    },
    {
        "CcMmYK color model": "ccmmyk color model"
    },
    {
        " are generally called Giclée .       In art, foil imaging is a printmaking technique made using the Iowa Foil Printer, developed by ": null
    },
    {
        "Virginia A. Myers": "virginia a. myers"
    },
    {
        " from the commercial ": null
    },
    {
        "foil stamping": "foil stamping"
    },
    {
        " process. This uses gold leaf and acrylic ": null
    },
    {
        "foil": "foil"
    },
    {
        " in the printmaking process.          Printmakers apply color to their prints in many different ways. Some coloring techniques include positive surface roll, negative surface roll, and ": null
    },
    {
        "A la poupée": "a la poupée"
    },
    {
        ". Often color in printmaking that involves etching, ": null
    },
    {
        "screen printing": "screen printing"
    },
    {
        ", woodcut, or ": null
    },
    {
        "linocut": "linocut"
    },
    {
        " is applied by either using separate plates, blocks or screens or by using a reductionist approach. In multiple plate color techniques, a number of plates, screens or blocks are produced, each providing a different color. Each separate plate, screen, or block will be inked up in a different color and applied in a particular sequence to produce the entire picture. On average about three to four plates are produced, but there are occasions where a printmaker may use up to seven plates. Every application of another plate of color will interact with the color already applied to the paper, and this must be kept in mind when producing the separation of colors. The lightest colors are often applied first, and then darker colors successively until the darkest.     The reductionist approach to producing color is to start with a lino or wood block that is either blank or with a simple etching. Upon each printing of color the printmaker will then further cut into the lino or woodblock removing more material and then apply another color and reprint. Each successive removal of lino or wood from the block will expose the already printed color to the viewer of the print. Picasso is often cited as the inventor of reduction printmaking, although there is evidence of this method in use 42 years before Picassos linocuts.      The ": null
    },
    {
        "subtractive color": "subtractive color"
    },
    {
        " concept is also used in ": null
    },
    {
        "offset": "offset printing"
    },
    {
        " or ": null
    },
    {
        "digital print": "digital print"
    },
    {
        " and is present in bitmap or vectorial software in ": null
    },
    {
        "CMYK": "cmyk color model"
    },
    {
        " or other color spaces.       In printmaking processes requiring more than one application of ink or other medium, the problem exists as to how to line up properly areas of an image to receive ink in each application. The most obvious example of this would be a multi-color image in which each color is applied in a separate step. The lining up of the results of each step in a multistep printmaking process is called registration. Proper registration results in the various components of an image being in their proper place. But, for artistic reasons, improper registration is not necessarily the ruination of an image.     This can vary considerably from process to process. It generally involves placing the substrate, generally paper, in correct alignment with the printmaking element that will be supplying it with coloration.        Protective clothing is very important for printmakers who engage in etching and lithography . Whereas in the past printmakers put their plates in and out of acid baths with their bare hands, today printmakers use rubber gloves. They also wear industrial ": null
    },
    {
        "respirator": "respirator"
    },
    {
        "s for protection from caustic vapors. Most acid baths are built with ventilation hoods above them.     Protective respirators and masks should have particle filters, particularly for aquatinting. As a part of the aquatinting process, a printmaker is often exposed to ": null
    },
    {
        "rosin": "rosin"
    },
    {
        " powder. Rosin is a serious health hazard, especially to printmakers who, in the past, simply used to hold their breath ": null
    }
]