[
    {
        "            The Prince-electors  of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", or Electors for short, were the members of the ": null
    },
    {
        "electoral college": "electoral college"
    },
    {
        " that elected the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ".     From the 13th century onwards, the Prince-Electors had the privilege of ": null
    },
    {
        "electing the monarch": "imperial election"
    },
    {
        " who would receive the ": null
    },
    {
        "coronation": "coronation of the holy roman emperor"
    },
    {
        " at the hands of the ": null
    },
    {
        "Pope": "pope"
    },
    {
        ". After 1508, the election was sufficient to acquire the Imperial title. ": null
    },
    {
        "Charles V": "charles v, holy roman emperor"
    },
    {
        " was the last person to be a crowned Emperor ; his successors were only elected Emperors by the electoral college, each being titled Elected Emperor of the Romans . In practice, election by the princely electoral college was merely a ": null
    },
    {
        "de jure": "de jure"
    },
    {
        " requirement. ": null
    },
    {
        "De facto": "de facto"
    },
    {
        " the Imperial throne followed the ": null
    },
    {
        "order of succession": "order of succession"
    },
    {
        " of the Austrian ": null
    },
    {
        "House of Habsburg": "house of habsburg"
    },
    {
        ": every emperor from 1440 onwards came from the ": null
    },
    {
        "House of Austria": "house of austria"
    },
    {
        " except for ": null
    },
    {
        "Charles VII": "charles vii, holy roman emperor"
    },
    {
        " and ": null
    },
    {
        "Francis I": "francis i, holy roman emperor"
    },
    {
        " , both of whom were related to the Habsburgs by blood and/or marriage. The Electors merely ratified such inheritance.     The dignity of Elector carried great prestige and was considered to be second only to that of King or Emperor.  The Electors had exclusive privileges that were not shared with the other princes of the Empire, and they continued to hold their original titles alongside that of Elector. The ": null
    },
    {
        "heir apparent": "heir apparent"
    },
    {
        " to a secular prince-elector was known as an electoral prince .     Kurfürst Kur- is based on the ": null
    },
    {
        "Middle High German": "middle high german"
    },
    {
        " irregular verb kiesen ": null
    },
    {
        "Deutsches Wörterbuch": "deutsches wörterbuch"
    },
    {
        ": ,  and  and is related etymologically to the English word choose . In English, the s / r mix in the Germanic verb conjugation has been regularized to s throughout, while German retains the r in Kur-. There is also a modern German verb küren which means to choose in a ceremonial sense.  Fürst  is German for prince, but while the German language distinguishes between the head of a principality  and the son of a monarch , English uses prince for both concepts. Fürst itself is related to English first and is thus the foremost person in his realm. Note that prince derives from Latin princeps, which carried the same meaning.       Electors were reichsstände , enjoying precedence over the other princes. They were, until the 18th century, exclusively entitled to be addressed with the title Durchlaucht . In 1742, the electors became entitled to the superlative Durchläuchtigste , while other princes were promoted to Durchlaucht.     As Imperial Estates, the electors enjoyed all the privileges of the other princes enjoying that status, including the right to enter into alliances, autonomy in relation to dynastic affairs and precedence over other subjects. The Golden Bull had granted them the ": null
    },
    {
        "Privilegium de non appellando": "privilegium de non appellando"
    },
    {
        ", which prevented their subjects from lodging an appeal to a higher Imperial court. However, while this privilege, and some others, were automatically granted to Electors, they were not exclusive to them and many of the larger Imperial Estates were also to be individually granted some or all those rights and privileges. Even a small ": null
    },
    {
        "Free Imperial City": "free imperial city"
    },
    {
        " such as ": null
    },
    {
        "Schwäbisch Gmünd": "schwäbisch gmünd"
    },
    {
        " had been granted the Privilegium de non appellando in 1475. Cf. ": null
    },
    {
        "Kaiser Friedrich III.: Privilegium de non appellando für Schwäbisch Gmünd, 1475": ":s:de:kaiser friedrich iii.: privilegium de non appellando für schwäbisch gmünd, 1475"
    },
    {
        "       The electors, like the other princes ruling States of the Empire, were members of the ": null
    },
    {
        "Imperial Diet": "imperial diet"
    },
    {
        ", which was divided into three collegia: the Council of Electors, the Council of Princes, and the Council of Cities. In addition to being members of the Council of Electors, several lay electors were therefore members of the Council of Princes as well by virtue of other territories they possessed. In many cases, the lay electors ruled numerous States of the Empire, and therefore held several votes in the Council of Princes. In 1792, the King of Bohemia held three votes, the Elector of Bavaria six votes, the Elector of Brandenburg eight votes, and the Elector of Hanover six votes. Thus, of the hundred votes in the ": null
    },
    {
        "Council of Princes in 1792": "list of imperial diet participants"
    },
    {
        ", twenty-three belonged to electors. The lay electors therefore exercised considerable influence, being members of the small Council of Electors and holding a significant number of votes in the Council of Princes. The assent of both bodies was required for important decisions affecting the structure of the Empire, such as the creation of new electorates or States of the Empire.     In addition to voting by colleges or councils, the Imperial Diet also voted on religious lines, as provided for by the ": null
    },
    {
        "Peace of Westphalia": "peace of westphalia"
    },
    {
        ". The Archbishop of Mainz presided over the ": null
    },
    {
        "Catholic": "roman catholicism"
    },
    {
        " body, or corpus catholicorum, while the Elector of Saxony presided over the ": null
    },
    {
        "Protestant": "protestantism"
    },
    {
        " body, or  corpus evangelicorum . The division into religious bodies was on the basis of the official religion of the state, and not of its rulers. Thus, even when the Electors of Saxony were Catholics during the eighteenth century, they continued to preside over the corpus evangelicorum, since the state of Saxony was officially Protestant.             The electors were originally summoned by the Archbishop of Mainz within one month of an Emperors death, and met within three months of being summoned. During the interregnum, imperial power was exercised by two ": null
    },
    {
        "imperial vicar": "imperial vicar"
    },
    {
        "s. Each vicar, in the words of the Golden Bull, was the administrator of the empire itself, with the power of passing judgments, of presenting to ecclesiastical benefices, of collecting returns and revenues and investing with fiefs, of receiving oaths of fealty for and in the name of the holy empire . The Elector of Saxony was vicar in areas operating under Saxon law , while the Elector Palatine was vicar in the remainder of the Empire . The Elector of Bavaria replaced the Elector Palatine in 1623, but when the latter was granted a new electorate in 1648, there was a dispute between the two as to which was vicar. In 1659, both purported to act as vicar, but the other vicar recognised the Elector of Bavaria. Later, the two electors made a pact to act as joint vicars, but the Imperial Diet rejected the agreement. In 1711, while the Elector of Bavaria was under the ": null
    },
    {
        "ban of the Empire": "ban of the empire"
    },
    {
        ", the Elector Palatine again acted as vicar, but his cousin was restored to his position upon his restoration three years later. Finally, in 1745, the two agreed to alternate as vicars, with Bavaria starting first. This arrangement was upheld by the Imperial Diet in 1752. In 1777 the question was settled when the Elector Palatine inherited Bavaria. On many occasions, however, there was no interregnum, as a new king had been elected during the lifetime of the previous Emperor.     ": null
    },
    {
        "Frankfurt": "frankfurt am main"
    },
    {
        " regularly served as the site of the election from the fifteenth century on, but elections were also held at ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        " , ": null
    },
    {
        "Regensburg": "regensburg"
    },
    {
        " , and ": null
    },
    {
        "Augsburg": "augsburg"
    },
    {
        " . An elector could appear in person or could appoint another elector as his proxy. More often, an electoral suite or embassy was sent to cast the vote; the credentials of such representatives were verified by the Archbishop of Mainz, who presided over the ceremony. The deliberations were held at the city hall, but voting occurred in the cathedral. In Frankfurt, a special electoral chapel, or Wahlkapelle, was used for elections. Under the Golden Bull, a majority of electors sufficed to elect a king, and each elector could cast only one vote. Electors were free to vote for whomsoever they pleased , but dynastic considerations played a great part in the choice. Electors drafted a  Wahlkapitulation , or electoral capitulation, which was presented to the king-elect. The capitulation may be described as a contract between the princes and the king, the latter conceding rights and powers to the electors and other princes. Once an individual swore to abide by the electoral capitulation, he assumed the office of King of the Romans.     In the 10th and 11th centuries, princes often acted merely to confirm hereditary succession in the Saxon ": null
    },
    {
        "Ottonian dynasty": "ottonian dynasty"
    },
    {
        " and Franconian ": null
    },
    {
        "Salian dynasty": "salian dynasty"
    },
    {
        ". But with the actual formation of the prince-elector class, elections became more open, starting with the election of ": null
    },
    {
        "Lothair II": "lothair ii, holy roman emperor"
    },
    {
        " in 1125. The ": null
    },
    {
        "Staufen": "hohenstaufen"
    },
    {
        " dynasty managed to get its sons formally elected in their fathers lifetimes almost as a formality. After these lines ended in extinction, the electors began to elect kings from different families so that the throne would not once again settle within a single dynasty. For some two centuries, the monarchy was elective both in theory and in practice; the arrangement, however, did not last, since the powerful ": null
    },
    {
        "House of Habsburg": "house of habsburg"
    },
    {
        " managed to secure succession within their dynasty during the fifteenth century. All kings elected from 1438 onwards were from among the Habsburg Archdukes of Austria until 1740, when the archduchy was inherited by a woman, ": null
    },
    {
        "Maria Theresa": "maria theresa of austria"
    },
    {
        ", sparking the ": null
    },
    {
        "War of the Austrian Succession": "war of the austrian succession"
    },
    {
        ". A representative of the House of Wittelsbach was elected for a short period of time, but in 1745, Maria Theresas husband, ": null
    },
    {
        "Francis I": "francis i, holy roman emperor"
    },
    {
        " of the Habsburg-Lorraine dynasty, became King. All of his successors were also from the same family. Hence, for the greater part of the Empires history, the role of the electors was largely ceremonial.                  Each elector held a High Office of the Empire  and was a member of the ": null
    },
    {
        "Imperial Household": "imperial household"
    },
    {
        ". The three spiritual electors were all Arch-Chancellors : the ": null
    },
    {
        "Archbishop of Mainz": "archbishop of mainz"
    },
    {
        " was Arch-Chancellor of Germany, the ": null
    },
    {
        "Archbishop of Cologne": "archbishop of cologne"
    },
    {
        " was Arch-Chancellor of Italy, and the ": null
    },
    {
        "Archbishop of Trier": "archbishop of trier"
    },
    {
        " was Arch-Chancellor of Burgundy. The other offices were as follows:          When the ": null
    },
    {
        "Duke of Bavaria": "duke of bavaria"
    },
    {
        " replaced the Elector Palatine in 1623, he assumed the latters office of Arch-Steward. When the Count Palatine was granted a new electorate, he assumed the position of Arch-Treasurer of the Empire. When the Duke of Bavaria was banned in 1706, the Elector Palatine returned to the office of Arch-Steward, and in 1710 the Elector of Hanover was promoted to the post of Arch-Treasurer. Matters were complicated by the Duke of Bavarias restoration in 1714; the Elector of Bavaria resumed the office of Arch-Steward, while the Elector Palatine returned to the post of Arch-Treasurer, and the Elector of Hanover was given the new office of Archbannerbearer. The Electors of Hanover, however, continued to be styled Arch-Treasurers, though the Elector Palatine was the one who actually exercised the office until 1777, when he inherited Bavaria and the Arch-Stewardship. After 1777, no further changes were made to the Imperial Household; new offices were planned for the Electors admitted in 1803, but the Empire was abolished before they could be created. The Duke of Württemberg, however, started to adopt the trappings of the Arch-Bannerbearer.     Many High Officers were entitled to use ": null
    },
    {
        "augmentations": "augmentation of honour"
    },
    {
        " on their ": null
    },
    {
        "coats of arms": "heraldry"
    },
    {
        "; these augmentations, which were special marks of honour, appeared in the centre of the electors shields atop the other charges . The Arch-Steward used  gules an orb Or  . The Arch-Marshal utilised the more complicated  per fess sable and argent , two swords in saltire gules . The Arch-Chamberlains augmentation was  azure a sceptre palewise Or , while the Arch-Treasurers was gules the crown of Charlemagne Or . As noted above, the Elector Palatine and the Elector of Hanover styled themselves Arch-Treasurer from 1714 until 1777; during this time, both electors used the corresponding augmentations. The three Arch-Chancellors and the Arch-Cupbearer did not use any augmentations.     The electors discharged the ceremonial duties associated with their offices only during coronations, where they bore the crown and regalia of the Empire. Otherwise, they were represented by holders of corresponding ": null
    },
    {
        "Hereditary Offices of the Household": "hereditary offices of the household"
    },
    {
        " . The Arch-Butler was represented by the Butler  , the Arch-Seneschal by the ": null
    },
    {
        "Steward": "steward"
    },
    {
        " , the Arch-Chamberlain by the ": null
    },
    {
        "Chamberlain": "chamberlain"
    },
    {
        " , the Arch-Marshal by the ": null
    },
    {
        "Marshal": "marshal"
    },
    {
        " , and the Arch-Treasurer by the ": null
    },
    {
        "Treasurer": "treasurer"
    },
    {
        " . The Duke of Württemberg assigned the count of Zeppelin-": null
    },
    {
        "Aschhausen": "aschhausen"
    },
    {
        " as hereditary Bannerbearer.            The German practice of electing ": null
    },
    {
        "monarchs": "monarch"
    },
    {
        "began when ancient ": null
    },
    {
        "Germanic tribes": "germanic peoples"
    },
    {
        " formed ad hoc coalitions and elected the leaders thereof. Elections were irregularly held by the ": null
    },
    {
        "Franks": "franks"
    },
    {
        ", whose ": null
    },
    {
        "successor states": "successor state"
    },
    {
        "include ": null
    },
    {
        "France": "france"
    },
    {
        " and the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ". The ": null
    },
    {
        "French monarchy": "list of french monarchs"
    },
    {
        " eventually became ": null
    },
    {
        "hereditary": "heredity"
    },
    {
        ", but the Holy Roman Emperors remained elective, at least in theory, although the Habsburgs provided most of the later monarchs. While all free men originally exercised the right to vote in such elections, suffrage eventually came to be limited to the leading men of the realm. In the election of ": null
    },
    {
        "Lothar II": "lothar ii, holy roman emperor"
    },
    {
        " in 1125, a small number of eminent ": null
    },
    {
        "nobles": "nobility"
    },
    {
        "chose the monarch and then submitted him to the remaining magnates for their approbation.     Soon, the right to choose the monarch was settled on an exclusive group of princes, and the procedure of seeking the approval of the remaining nobles was abandoned. The college of electors was mentioned in 1152 and again in 1198. The composition of electors at that time is unclear, but appears to have included representatives of the church and the ": null
    },
    {
        "dukes": "duke"
    },
    {
        "of the ": null
    },
    {
        "four nations of Germany": "stem duchy"
    },
    {
        ": the ": null
    },
    {
        "Franks": "franks"
    },
    {
        " , ": null
    },
    {
        "Swabians": "swabians"
    },
    {
        " , ": null
    },
    {
        "Saxons": "saxons"
    },
    {
        "  and ": null
    },
    {
        "Bavarians": "bavarians"
    },
    {
        " .         The electoral college is known to have existed by 1152, but its composition is unknown. A letter written by ": null
    },
    {
        "Pope Urban IV": "pope urban iv"
    },
    {
        " in 1265 suggests that by ": null
    },
    {
        "immemorial custom": "time immemorial"
    },
    {
        " , seven princes had the right to elect the King and future Emperor. The pope wrote that the seven electors were those who had just voted in the election of 1257, which resulted in the election of two kings.      Three ecclesiastical Electors:   The ": null
    },
    {
        "Archbishop of Mainz": "archbishopric of mainz"
    },
    {
        " Archbishop of Trier": "electorate of trier"
    },
    {
        " Archbishop of Cologne": "electorate of cologne"
    },
    {
        " King of Bohemia": "king of bohemia"
    },
    {
        " Count Palatine of the Rhine": "electorate of the palatinate"
    },
    {
        " Duke of Saxony": "electorate of saxony"
    },
    {
        " Margrave of Brandenburg": "margraviate of brandenburg"
    },
    {
        "     The three Archbishops oversaw the most venerable and powerful ": null
    },
    {
        "sees": "episcopal see"
    },
    {
        "in Germany, while the other four were supposed to represent the dukes of the four nations. The Count Palatine of the Rhine held most of the former Duchy of Franconia after the last Duke died in 1039. The Margrave of Brandenburg became an Elector when the Duchy of Swabia was dissolved after the last Duke of Swabia was beheaded in 1268. Saxony, even with diminished territory, retained its eminent position.     The Palatinate and Bavaria were originally held by the same individual, but in 1253, they were divided between two members of the ": null
    },
    {
        "House of Wittelsbach": "house of wittelsbach"
    },
    {
        ". The other electors refused to allow two princes from the same dynasty to have electoral rights, so a heated rivalry arose between the Count Palatine and the Duke of Bavaria over who should hold the Wittelsbach seat.     Meanwhile, the King of Bohemia, who held the ancient imperial office of Arch-Cupbearer, asserted his right to participate in elections. Sometimes he was challenged on the grounds that his kingdom was not German, though usually he was recognized, instead of Bavaria which after all was just a younger line of Wittelsbachs.     The ": null
    },
    {
        "Declaration of Rhense": "declaration of rhense"
    },
    {
        " issued in 1338 had the effect that election by the majority of the electors automatically conferred the royal title and rule over the empire, without papal confirmation. The ": null
    },
    {
        "Golden Bull of 1356": "golden bull of 1356"
    },
    {
        " finally resolved the disputes among the electors. Under it, the Archbishops of ": null
    },
    {
        "Mainz": "archbishop of mainz"
    },
    {
        ", ": null
    },
    {
        "Trier": "archbishop of trier"
    },
    {
        ", and ": null
    },
    {
        "Cologne": "electorate of cologne"
    },
    {
        ", as well as the ": null
    },
    {
        "King of Bohemia": "king of bohemia"
    },
    {
        ", the ": null
    },
    {
        "Count Palatine of the Rhine": "electorate of the palatinate"
    },
    {
        ", the ": null
    },
    {
        "Duke of Saxony": "duke of saxony"
    },
    {
        ", and the ": null
    },
    {
        "Margrave of Brandenburg": "margrave of brandenburg"
    },
    {
        " held the right to elect the King.          The colleges composition remained unchanged until the 17th century, although the Electorate of Saxony was transferred from the senior to the junior branch of the Wettin family in 1547, in the aftermath of the ": null
    },
    {
        "Schmalkaldic War": "schmalkaldic war"
    },
    {
        ".         In 1621, the Elector Palatine, ": null
    },
    {
        "Frederick V": "frederick v, elector palatine"
    },
    {
        ", came under the ": null
    },
    {
        "imperial ban": "imperial ban"
    },
    {
        " after participating in the ": null
    },
    {
        "Bohemian Revolt": "thirty years warthe bohemian revolt"
    },
    {
        " . The Elector Palatines seat was conferred on the Duke of Bavaria, the head of a junior branch of his family. Originally, the Duke held the electorate personally, but it was later made hereditary along with the duchy. When the Thirty Years War concluded with the ": null
    },
    {
        "Peace of Westphalia": "peace of westphalia"
    },
    {
        " in 1648, a new electorate was created for the Count Palatine of the Rhine. Since the Elector of Bavaria retained his seat, the number of electors increased to eight; the two Wittelsbach lines now sufficiently estranged so as not to pose a combined potential threat.     In 1685, the religious composition of the College of Electors was disrupted when a Catholic branch of the Wittelsbach family inherited the Palatinate. A new Protestant electorate was created in 1692 for the Duke of Brunswick-Lüneburg, who became known as the Elector of Hanover . The Elector of Saxony converted to Catholicism in 1697 so that he could become King of Poland, but no additional Protestant electors were created. Although the Elector of Saxony was personally Catholic, the Electorate itself remained officially Protestant, and the Elector even remained the leader of the ": null
    },
    {
        "Protestant body in the Reichstag": "imperial diet religious bodies"
    },
    {
        ".     In 1706, the Elector of Bavaria and Archbishop of Cologne were ": null
    },
    {
        "banned": "imperial ban"
    },
    {
        " during the ": null
    },
    {
        "War of the Spanish Succession": "war of the spanish succession"
    },
    {
        ", but both were restored in 1714 after the ": null
    },
    {
        "Peace of Baden": "treaty of baden"
    },
    {
        ". In 1777, the number of electors was reduced to eight when the Elector Palatine inherited Bavaria.     Many changes to the composition of the college were necessitated by ": null
    },
    {
        "Napoleons": "napoleon i of france"
    },
    {
        "aggression during the early 19th century. The ": null
    },
    {
        "Treaty of Lunéville": "treaty of lunéville"
    },
    {
        " , which ceded territory on the ": null
    },
    {
        "Rhines": "rhine"
    },
    {
        "left bank to ": null
    },
    {
        "France": "france"
    },
    {
        ", led to the abolition of the archbishoprics of Trier and Cologne, and the transfer of the remaining spiritual Elector from Mainz to ": null
    },
    {
        "Regensburg": "regensburg"
    },
    {
        ". In 1803, electorates were created for the ": null
    },
    {
        "Duke of Württemberg": "rulers of württemberg"
    },
    {
        ", the ": null
    },
    {
        "Margrave of Baden": "margrave of baden"
    },
    {
        ", the ": null
    },
    {
        "Landgrave of Hesse-Kassel": "landgrave of hesse-kassel"
    },
    {
        ", and the ": null
    },
    {
        "Duke of Salzburg": "duchy of salzburg"
    },
    {
        ", bringing the total number of electors to ten. When ": null
    },
    {
        "Austria": "austria"
    },
    {
        " annexed Salzburg under the ": null
    },
    {
        "Treaty of Pressburg ": "treaty of pressburg"
    },
    {
        ", the Duke of Salzburg moved to the ": null
    },
    {
        "Grand Duchy of Würzburg": "grand duchy of würzburg"
    },
    {
        " and retained his electorate. None of the new electors, however, had an opportunity to cast votes, as the Holy Roman Empire was abolished in 1806, and the new electorates were never confirmed by the Emperor.         After the abolition of the Holy Roman Empire in August 1806, the Electors continued to reign over their territories, many of them taking higher titles. The Electors of Bavaria, Württemberg, and Saxony styled themselves Kings, while the Electors of Baden, Hesse-Darmstadt, ": null
    },
    {
        "Regensburg": "karl theodor anton maria von dalberg"
    },
    {
        ", and ": null
    },
    {
        "Würzburg": "ferdinand iii, grand duke of tuscany"
    },
    {
        " became Grand Dukes. The Elector of Hesse-Kassel, however, retained the meaningless title Elector of Hesse , thus distinguishing himself from other Hessian princes . Napoleon soon exiled him and Kassel was annexed to the ": null
    },
    {
        "Kingdom of Westphalia": "kingdom of westphalia"
    },
    {
        ", a new creation. The King of Great Britain remained at war with Napoleon and continued to style himself Elector of Hanover, while the Hanoverian government continued to operate in London.     The ": null
    },
    {
        "Congress of Vienna": "congress of vienna"
    },
    {
        " accepted the Electors of Bavaria, Württemberg, and Saxony as Kings, along with the newly created Grand Dukes. The Elector of Hanover finally joined his fellow Electors by declaring himself the King of Hanover. The restored Elector of Hesse, a Napoleonic creation, tried to be recognized as the King of the ": null
    },
    {
        "Chatti": "chatti"
    },
    {
        ". However, the European powers refused to acknowledge this title at the ": null
    },
    {
        "Congress of Aix-la-Chapelle ": "congress of aix-la-chapelle"
    },
    {
        " and instead listed him with the ": null
    },
    {
        "grand dukes": "grand duchy"
    },
    {
        " as a Royal Highness .  Believing the title of Prince-Elector to be superior in dignity to that of Grand Duke, the Elector of Hesse-Kassel chose to remain an Elector, even though there was no longer a Holy Roman Emperor to elect. Hesse-Kassel remained the only Electorate in Germany until 1866, when the country backed the losing side in the ": null
    },
    {
        "Austro-Prussian War": "austro-prussian war"
    },
    {
        " and was absorbed into Prussia.         Religion was a factor in the election of the Holy Roman Emperor, as some ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " electors would refuse to vote for a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " and ": null
    },
    {
        "vice versa": "vice versa"
    },
    {
        ". Most of the time, religion played a minor role and was overshadowed by other factors, including dynastic, territorial and other political interests. For example, the Protestant ": null
    },
    {
        "Elector of Saxony": "elector of saxony"
    },
    {
        " voted for ": null
    },
    {
        "Ferdinand II, Archduke of Austria": "ferdinand ii, holy roman emperor"
    },
    {
        ", putting his political interests first even though Ferdinand was a staunch ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " who would eventually lead the Empire into the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ".     At the height of the ": null
    },
    {
        "Protestant Reformation": "protestant reformation"
    },
    {
        ", there were times when the electoral college had a Protestant majority. However, all of the Holy Roman Emperors were Catholic. Some historians maintain that ": null
    },
    {
        "Ferdinand I": "ferdinand i, holy roman emperor"
    },
    {
        " had been touched by the reformed philosophies and was probably the closest the Holy Roman Empire ever came to a Protestant emperor; he remained nominally a Catholic throughout his life, although reportedly he refused last rites on his deathbed. See Parker, pp. 20–50. Other historians maintain he was as Catholic as his brother, but tended to see religion as outside the political sphere. Holborn, pp. 250–251.         The ": null
    },
    {
        "Elector of Mainz": "archbishopric of mainz"
    },
    {
        " was always a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ".   The ": null
    },
    {
        "Elector of Trier": "electorate of trier"
    },
    {
        " was always a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ".   The ": null
    },
    {
        "Elector of Cologne": "electorate of cologne"
    },
    {
        " was usually a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ", with the exception of ": null
    },
    {
        "Hermann V von Wied": "hermann v von wied"
    },
    {
        "  and ": null
    },
    {
        "Gebhard Truchsess von Waldburg": "gebhard truchsess von waldburg"
    },
    {
        " .       The ": null
    },
    {
        "Elector of Bohemia": "kingdom of bohemia"
    },
    {
        " was usually a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ", with the exception of ": null
    },
    {
        "George of Podebrady": "george of podebrady"
    },
    {
        "  and ": null
    },
    {
        "Frederick I": "frederick v of the palatinate"
    },
    {
        " .   The ": null
    },
    {
        "Elector of Brandenburg": "margraviate of brandenburg"
    },
    {
        ", who was also ": null
    },
    {
        "Duke of Prussia": "list of monarchs of prussia"
    },
    {
        " from 1618 , was a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " until 1539, then a ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " until 1613, then a ": null
    },
    {
        "Calvinist": "calvinist"
    },
    {
        " until the end of the Empire.   The ": null
    },
    {
        "Elector Palatine": "electoral palatinate"
    },
    {
        " was a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " until the 1530s, then a ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " until 1559, then a ": null
    },
    {
        "Calvinist": "calvinist"
    },
    {
        " until 1575, then again a ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " until 1583, then again a ": null
    },
    {
        "Calvinist": "calvinist"
    },
    {
        " until 1623, when the electoral dignity was lost to ": null
    },
    {
        "Bavaria": "electoral bavaria"
    },
    {
        ".   The ": null
    },
    {
        "Elector of Saxony": "electorate of saxony"
    },
    {
        " was a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " until 1525, then a ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " until 1697, and then again a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ".       The ": null
    },
    {
        "Elector of Bavaria": "electorate of bavaria"
    },
    {
        " was always a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ".   The ": null
    },
    {
        "Elector of Hanover": "elector of hanover"
    },
    {
        ", was a ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        " until 1714, when he became ": null
    },
    {
        "King of Great Britain": "list of british monarchs"
    },
    {
        " and also the head of the ": null
    },
    {
        "Anglican": "anglican"
    },
    {
        " Church of England": "church of england"
    },
    {
        ".       The ": null
    },
    {
        "Elector of Regensburg": "principality of regensburg"
    },
    {
        " Karl Theodor Anton Maria von Dalberg": "karl theodor anton maria von dalberg"
    },
    {
        " was a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ".   The ": null
    },
    {
        "Elector of Salzburg": "electorate of salzburg"
    },
    {
        " and ": null
    },
    {
        "Würzburg": "grand duchy of würzburg"
    },
    {
        " Ferdinand III and I": "ferdinand iii, grand duke of tuscany"
    },
    {
        " was a ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ".   The ": null
    },
    {
        "Elector of Württemberg": "electorate of württemberg"
    },
    {
        " Frederick I": "frederick i of württemberg"
    },
    {
        " was a ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        ".   The ": null
    },
    {
        "Elector of Baden": "electorate of baden"
    },
    {
        " Charles Frederick": "charles frederick, grand duke of baden"
    },
    {
        " was a ": null
    },
    {
        "Lutheran": "lutheran"
    },
    {
        ".   The ": null
    },
    {
        "Elector of Hesse": "electorate of hesse"
    },
    {
        " William I": "william i, elector of hesse"
    },
    {
        " was a ": null
    },
    {
        "Calvinist": "calvinist"
    },
    {
        " Archbishop of Mainz": "electorate of mainz"
    },
    {
        " Archbishop of Trier": "electorate of trier"
    },
    {
        " Archbishop of Cologne": "electorate of cologne"
    },
    {
        " Kingdom of Bohemia": "kingdom of bohemia"
    },
    {
        " County Palatine of the Rhine": "electoral palatine"
    },
    {
        " Duchy of Saxony": "electorate of saxony"
    },
    {
        " Margraviate of Brandenburg": "margraviate of brandenburg"
    },
    {
        " Duchy of Bavaria": "electorate of bavaria"
    },
    {
        " was granted electoral dignity by ": null
    },
    {
        "Ferdinand II": "ferdinand ii, holy roman emperor"
    },
    {
        " in 1623, removing the dignity from the County Palatine of the Rhine   Coat_of_Arms_of_George_I_Louis,_Elector_of_Hanover_.svg|": null
    },
    {
        "Electorate of Hanover": "electorate of hanover"
    },
    {
        " , made an elector by ": null
    },
    {
        "Leopold I": "leopold i, holy roman emperor"
    },
    {
        " in 1692 as a reward for aid given in the ": null
    },
    {
        "War of the Grand Alliance": "war of the grand alliance"
    },
    {
        " Principality of Regensburg": "electorate of regensburg"
    },
    {
        " Grand Duchy of Salzburg": "electorate of salzburg"
    },
    {
        " was added in 1803. After being ": null
    },
    {
        "mediatised to Austria": "peace of pressburg"
    },
    {
        " in 1805, its electoral vote was transferred to Würzburg. Salzburg and Würzburg were ruled by the same person, ": null
    },
    {
        "Ferdinand III": "ferdinand iii, grand duke of tuscany"
    },
    {
        " Grand Duchy of Würzburg": "electorate of würzburg"
    },
    {
        " Duchy of Württemberg": "electorate of württemberg"
    },
    {
        " was raised to an electorate by ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        " Margraviate of Baden": "electorate of baden"
    },
    {
        " Landgraviate of Hesse-Kassel": "electorate of hesse"
    }
]