[
    {
        "   In ": null
    },
    {
        "telecommunication": "telecommunication"
    },
    {
        ", a private line is typically a telephone company service that uses a dedicated, usually unswitched point-to-point circuit, but it may involve private ": null
    },
    {
        "switching": "circuit switching"
    },
    {
        " arrangements, or predefined ": null
    },
    {
        "transmission": "transmission"
    },
    {
        " physical or virtual paths. Most private lines connect only two locations, but some have multiple drop points. If the circuit is used for interconnecting switching systems, including manual switchboards, it is often called a ": null
    },
    {
        "tie line": "tie line"
    },
    {
        ".     Among subscribers to the ": null
    },
    {
        "public switched telephone network": "public switched telephone network"
    },
    {
        ", the term private line is often erroneously used to describe an individual ": null
    },
    {
        "telephone line": "telephone line"
    },
    {
        " for service for only one subscriber, as opposed to a ": null
    },
    {
        "party line": "party line"
    },
    {
        " with multiple stations connected.     In radio or ": null
    },
    {
        "wireless telephony": "wireless telephony"
    },
    {
        ", Private Line is a term trademarked by Motorola to describe an implementation of a ": null
    },
    {
        "Continuous Tone-Coded Squelch System": "continuous tone-coded squelch system"
    },
    {
        " , a method of using low-frequency subaudible tones to share a single radio channel among multiple users. Each user group would use a different low frequency tone. Motorolas trade name, especially the abbreviation PL, has become a ": null
    },
    {
        "genericized trademark": "genericized trademark"
    },
    {
        " for the method. General Electric used the term Channel Guard to describe the same system and other manufacturers used other terms.     A later digital version of a private line is called digital private line": null
    }
]