[
    {
        "Procedural law, adjective law, in some jurisdictions referred to as remedial law, or rules of court comprises the rules by which a ": null
    },
    {
        "court": "court"
    },
    {
        " hears and determines what happens in ": null
    },
    {
        "civil": "civil procedure"
    },
    {
        ", ": null
    },
    {
        "lawsuit": "lawsuit"
    },
    {
        ", ": null
    },
    {
        "criminal": "criminal procedure"
    },
    {
        " or administrative ": null
    },
    {
        "proceeding": "wikt:proceeding"
    },
    {
        "s. The rules are designed to ensure a fair and consistent application of ": null
    },
    {
        "due process": "due process"
    },
    {
        " or ": null
    },
    {
        "fundamental justice": "fundamental justice"
    },
    {
        "  to all cases that come before a court.     ": null
    },
    {
        "Substantive law": "substantive law"
    },
    {
        ", which refers to the actual ": null
    },
    {
        "claim": "claim_"
    },
    {
        " and ": null
    },
    {
        "defense": "defense_"
    },
    {
        " whose validity is tested through the procedures of procedural law, is different from procedural law.     In the context of procedural law, procedural rights  may also refer not exhaustively to ": null
    },
    {
        "rights to information": "right to information act, 2005"
    },
    {
        ", access to ": null
    },
    {
        "justice": "justice"
    },
    {
        ", and ": null
    },
    {
        "rights": "rights"
    },
    {
        " to ": null
    },
    {
        "public participation": "public participation"
    },
    {
        ", with those rights encompassing, general civil and political rights. In ": null
    },
    {
        "environmental law": "environmental law"
    },
    {
        ", these procedural Rights have been reflected within the ": null
    },
    {
        "UNECE": "unece"
    },
    {
        " Convention": "treaty"
    },
    {
        " on Access to Information, Public Participation in Decision-making and Access to Justice in Environmental Matters known as the ": null
    },
    {
        "Aarhus Convention": "aarhus convention"
    },
    {
        " .       Although different ": null
    },
    {
        "legal process": "legal process"
    },
    {
        "es aim to resolve many kinds of legal disputes, the legal procedures share some common features. All legal procedure, for example, is concerned with ": null
    },
    {
        "due process": "due process"
    },
    {
        ". Absent very special conditions, a ": null
    },
    {
        "court": "court"
    },
    {
        " can not impose a penalty - ": null
    },
    {
        "civil": "civil law"
    },
    {
        " or ": null
    },
    {
        "criminal": "criminal law"
    },
    {
        " - against an individual who has not received   ": null
    },
    {
        "notice": "notice"
    },
    {
        " of a ": null
    },
    {
        "lawsuit": "lawsuit"
    },
    {
        " being brought against them, or who has not received a fair opportunity to present evidence for themselves.     The standardization for the means by which cases are brought, parties are informed, evidence is presented, and facts are determined is intended to maximize the fairness of any proceeding. Nevertheless, strict procedural rules have certain drawbacks. For example, they impose specific time limitations upon the parties that may either hasten or slow down the pace of proceedings. Furthermore, a party who is unfamiliar with procedural rules may run afoul of guidelines that have nothing to do with the merits of the case, and yet the failure to follow these guidelines may severely damage the partys chances. Procedural systems are constantly torn between arguments that judges should have greater discretion in order to avoid the rigidity of the rules, and arguments that judges should have less discretion in order to avoid an outcome based more on the personal preferences of the judge than on the law or the facts.     Legal procedure, in a larger sense, is also designed to effect the best distribution of judicial resources. For example, in most courts of ": null
    },
    {
        "general jurisdiction": "general jurisdiction"
    },
    {
        " in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", criminal cases are given priority over civil cases, because criminal defendants stand to lose their freedom, and should therefore be accorded the first opportunity to have their case heard.           Procedural law in contrast to ": null
    },
    {
        "substantive law": "substantive law"
    },
    {
        " is a concept available in various legal systems and languages. Similar to the English expressions are the Spanish words derecho adjetivo and derecho material or derecho sustantivo, as well as the Portuguese terms for them, direito adjetivo and direito substantivo. Other ideas are behind the German expressions formelles Recht  and materielles Recht as well as the French droit formel/droit matériel, the Italian diritto formale/diritto materiale and the Swedish formell rätt/materiell rätt; all of which, taken literally, mean formal and material law. The same opposition can be found in the Russian legal vocabulary, with материальное право for substantive law and процессуальное право for procedural. Similar to Russian, in ": null
    },
    {
        "Bulgarian": "bulgarian language"
    },
    {
        " материално право means substantive law and процесуално право is used for procedural. In Chinese, procedural law and substantive law are represented by these characters: 程序法 and 实体法 .     In Germany, the expressions formelles Recht and materielles Recht were developed in the 19th century, because only during that time was the Roman actio split into procedural and substantive components.       In the European legal systems the ": null
    },
    {
        "Roman law": "roman law"
    },
    {
        " had been of great influence. In ancient times the Roman civil procedure applied to many countries. One of the main issues of the procedure has been the actio . In the procedure of the legis actiones the actio included both procedural and substantive elements. Because during this procedure the  praetor  had granted, or denied, litigation by granting or denying, respectively, an actio. By granting the actio the praetor in the end has created claims. I.e. a procedural act caused substantive claims to exist. Such priority is contrary to what we think of the relationship nowadays. But it has not only been an issue of priority and whether the one serves the other. Since the actio had been composed of elements of procedure and substance it was difficult to separate both parts again.     Even the scientific handling of law, which developed during medieval times in the new universities in Italy , did not come to a full and clear separation.      In Germany the unity of procedure and substance in the actio definitely was brought to an end with the codification of the  Bürgerliches Gesetzbuch  which came into force on January 1, 1900. The expression Anspruch - meaning claim - has been cleared from procedural elements. And this was the time for founding the terms formelles / materielles Recht. However, after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " the expression formelles Recht obviously was found to be contaminated and to a broad extent has been replaced by Prozessrecht": null
    }
]