[
    {
        "                  A computer programmer, sometimes called more recently a coder , is a person who creates ": null
    },
    {
        "computer software": "Computer Software"
    },
    {
        ". The term computer programmer can refer to a specialist in one area of ": null
    },
    {
        "computers": "Computers"
    },
    {
        ", or to a generalist who writes code for many kinds of software.     A programmers most oft-used ": null
    },
    {
        "computer language": "Computer Language"
    },
    {
        "  may be prefixed to the term programmer. Some who work with ": null
    },
    {
        "web": "World Wide Web"
    },
    {
        " programming languages also prefix their titles with web.     A range of occupations that involve programming also often require a range of other, similar skills, for example: developer, ": null
    },
    {
        "web developer": "Web Developer"
    },
    {
        ", ": null
    },
    {
        "mobile applications": "Mobile Applications"
    },
    {
        " developer, embedded ": null
    },
    {
        "firmware": "Firmware"
    },
    {
        " developer, ": null
    },
    {
        "software engineer": "Software Engineer"
    },
    {
        ", ": null
    },
    {
        "computer scientist": "Computer Scientist"
    },
    {
        ", ": null
    },
    {
        "game programmer": "Game Programmer"
    },
    {
        ", ": null
    },
    {
        "game developer": "Video Game Developer"
    },
    {
        " and ": null
    },
    {
        "software analyst": "Software Analyst"
    },
    {
        ". The use of the term programmer as applied to these positions is sometimes considered an insulting simplification or even derogatory.               British ": null
    },
    {
        "count": "Count"
    },
    {
        "ess and mathematician ": null
    },
    {
        "Ada Lovelace": "Ada Lovelace"
    },
    {
        " is often considered to be the first computer programmer, as she was the first to publish part of a program  intended for implementation on ": null
    },
    {
        "Charles Babbages": "Charles Babbage"
    },
    {
        " analytical engine": "Analytical Engine"
    },
    {
        ", in October 1842. The algorithm was used to calculate ": null
    },
    {
        "Bernoulli number": "Bernoulli Number"
    },
    {
        "s.  Because Babbages machine was never completed as a functioning standard in Lovelaces time, she unfortunately never had the opportunity to see the algorithm in action.     The first person to execute a program on a functioning, modern, electronic computer was the renowned ": null
    },
    {
        "computer scientist": "Computer Scientist"
    },
    {
        " Konrad Zuse": "Konrad Zuse"
    },
    {
        ", in 1941.          The ": null
    },
    {
        "ENIAC": "Eniac"
    },
    {
        " programming team, consisting of ": null
    },
    {
        "Kay McNulty": "Kathleen Antonelli"
    },
    {
        ", ": null
    },
    {
        "Betty Jennings": "Jean Bartik"
    },
    {
        ", ": null
    },
    {
        "Betty Snyder": "Betty Holberton"
    },
    {
        ", ": null
    },
    {
        "Marlyn Wescoff": "Marlyn Meltzer"
    },
    {
        ", ": null
    },
    {
        "Fran Bilas": "Frances Spence"
    },
    {
        " and ": null
    },
    {
        "Ruth Lichterman": "Ruth Teitelbaum"
    },
    {
        " were the first regularly working programmers.     International Programmers Day is celebrated annually on 7 January.  In 2009, the ": null
    },
    {
        "government of Russia": "Government Of Russia"
    },
    {
        " decreed a professional annual holiday known as ": null
    },
    {
        "Programmers Day": "Programmers Day"
    },
    {
        " to be celebrated on 13 September . It had already been an unofficial holiday before that in many countries.       The word software was used as early as 1953, but did not regularly appear in print until the 1960s.  adapted from Sophisticated: The Magazine  Before this time, computers were programmed either by customers or the few commercial computer manufacturers of the time, such as ": null
    },
    {
        "UNIVAC": "Univac"
    },
    {
        " and ": null
    },
    {
        "IBM": "Ibm"
    },
    {
        ". The first company founded to specifically provide software products and services was the ": null
    },
    {
        "Computer Usage Company": "Computer Usage Company"
    },
    {
        ", in 1955.      The software industry expanded in the early 1960s, almost immediately after computers were first sold in mass-produced quantities. Universities, governments and businesses created a demand for software. Many of these programs were written in-house by full-time staff programmers; some were distributed freely between users of a particular machine for no charge. And others were developed on a commercial basis. Other firms, such as ": null
    },
    {
        "Computer Sciences Corporation": "Computer Sciences Corporation"
    },
    {
        " also started to grow. The computer/": null
    },
    {
        "hardware": "Computer Hardware"
    },
    {
        " manufacturers soon started bundling ": null
    },
    {
        "operating systems": "Operating Systems"
    },
    {
        ", ": null
    },
    {
        "system software": "System Software"
    },
    {
        " and programming environments with their machines.     The industry expanded greatly with the rise of the ": null
    },
    {
        "personal computer": "Personal Computer"
    },
    {
        " in the mid-1970s, which brought computing to the average office worker. In the following years the PC also helped create a constantly-growing market for games, applications and utilities software. CP/M, later replaced by ": null
    },
    {
        "DOS": "Dos"
    },
    {
        ", ": null
    },
    {
        "Microsofts": "Microsoft"
    },
    {
        " Windows": "Microsoft Windows"
    },
    {
        " popular operating system of the time.      In the early years of the 21st century, another successful ": null
    },
    {
        "business model": "Business Model"
    },
    {
        " has arisen for hosted software, called ": null
    },
    {
        "software-as-a-service": "Software-As-A-Service"
    },
    {
        ", or SaaS; this was at least the third time this model had been attempted. From the point of view of producers of some ": null
    },
    {
        "proprietary software": "Proprietary Software"
    },
    {
        ", SaaS reduces the concerns about ": null
    },
    {
        "unauthorized copying": "Software Copyright"
    },
    {
        ", since it can only be accessed through the Web, and by definition, no ": null
    },
    {
        "client software": "Client Software"
    },
    {
        " is loaded onto the end users PC. By 2014, the role of ": null
    },
    {
        "cloud": "Cloud Computing"
    },
    {
        " developer had been defined; in this context, one definition of a developer in general was published:        :Some of this section is from the 2006–07 Edition, which is in the public domain as a work of the United States Government .     Computer programmers write, test, ": null
    },
    {
        "debug": "Debug"
    },
    {
        ", and maintain the detailed instructions, called ": null
    },
    {
        "computer programs": "Computer Programs"
    },
    {
        ", that computers must follow to perform their functions. Programmers also conceive, design, and test logical structures for solving problems by computer. Many technical innovations in programming  — advanced computing technologies and sophisticated new languages and programming tools  — have redefined the role of a programmer and elevated much of the programming work done today. Job titles and descriptions may vary, depending on the organization.     Programmers work in many settings, including corporate ": null
    },
    {
        "information technology": "Information Technology"
    },
    {
        " departments, big ": null
    },
    {
        "software companies": "Software Companies"
    },
    {
        ", small service firms and government entities of all sizes. Many professional programmers also work for consulting companies at client sites as ": null
    },
    {
        "contractors": "Independent Contractor"
    },
    {
        ". ": null
    },
    {
        "Licensing": "License"
    },
    {
        " is not typically required to work as a programmer, although ": null
    },
    {
        "professional certifications": "Professional Certification"
    },
    {
        "are commonly held by programmers. Programming is widely considered a ": null
    },
    {
        "profession": "Profession"
    },
    {
        " .     Programmers work varies widely depending on the type of business for which they are writing programs. For example, the instructions involved in updating financial records are very different from those required to duplicate conditions on an aircraft for pilots training in a flight simulator. Simple programs can be written in a few hours, more complex ones may require more than a year of work, while others are never considered complete but rather are continuously improved as long as they stay in use. In most cases, several programmers work together as a team under a senior programmers supervision.      Programmers write programs according to the specifications determined primarily by more senior programmers and by ": null
    },
    {
        "systems analyst": "Systems Analyst"
    },
    {
        "s. After the design process is complete, it is the job of the programmer to convert that design into a logical series of instructions that the computer can follow. The programmer codes these instructions in one of many programming languages. Different programming languages are used depending on the purpose of the program. ": null
    },
    {
        "COBOL": "Cobol"
    },
    {
        ", for example, is commonly used for business applications that typically run on ": null
    },
    {
        "mainframe": "Mainframe Computer"
    },
    {
        " and ": null
    },
    {
        "midrange": "Minicomputer"
    },
    {
        " computers, whereas ": null
    },
    {
        "Fortran": "Fortran"
    },
    {
        " is used in science and engineering. ": null
    },
    {
        "C++": "C++"
    },
    {
        " is widely used for both scientific and business applications. ": null
    },
    {
        "Java": "Java"
    },
    {
        ", ": null
    },
    {
        "C": "C Sharp"
    },
    {
        ", ": null
    },
    {
        "VB": "Visual Basic"
    },
    {
        " and ": null
    },
    {
        "PHP": "Php"
    },
    {
        " are popular programming languages for Web and business applications. Programmers generally know more than one programming language and, because many languages are similar, they often can learn new languages relatively easily. In practice, programmers often are referred to by the language they know, e.g. as Java programmers, or by the type of function they perform or environment in which they work: for example,  database programmers, mainframe programmers, or ": null
    },
    {
        "Web developer": "Web Developer"
    },
    {
        "s.     When making changes to the ": null
    },
    {
        "source code": "Source Code"
    },
    {
        " that programs are made up of, programmers need to make other programmers aware of the task that the routine is to perform. They do this by inserting comments in the ": null
    },
    {
        "source code": "Source Code"
    },
    {
        " so that others can understand the program more easily and by ": null
    },
    {
        "documenting their code": "Software Documentation"
    },
    {
        ". To save work, programmers often use ": null
    },
    {
        "libraries": "Library"
    },
    {
        " of basic code that can be modified or customized for a specific application. This approach yields more reliable and consistent programs and increases programmers productivity by eliminating some routine steps.       Programmers test a program by running it and looking for ": null
    },
    {
        "bugs": "Software Bug"
    },
    {
        " . As they are identified, the programmer usually makes the appropriate corrections, then rechecks the program until an acceptably low level and severity of bugs remain. This process is called ": null
    },
    {
        "testing": "Software Testing"
    },
    {
        " and ": null
    },
    {
        "debugging": "Debugging"
    },
    {
        ". These are important parts of every programmers job. Programmers may continue to fix these problems throughout the life of a program. Updating, repairing, modifying, and expanding existing programs is sometimes called maintenance programming. Programmers may contribute to ": null
    },
    {
        "user guides": "User Guide"
    },
    {
        "and ": null
    },
    {
        "online help": "Online Help"
    },
    {
        ", or they may work with ": null
    },
    {
        "technical writers": "Technical Writer"
    },
    {
        "to do such work.       Computer programmers often are grouped into two broad types: application programmers and systems programmers. Application programmers write programs to handle a specific job, such as a program to track inventory within an organization. They also may revise existing packaged software or customize generic applications which are frequently purchased from ": null
    },
    {
        "independent software vendor": "Independent Software Vendor"
    },
    {
        "s. Systems programmers, in contrast, write programs to maintain and control computer systems software, such as ": null
    },
    {
        "operating systems": "Operating System"
    },
    {
        "and ": null
    },
    {
        "database management system": "Database Management System"
    },
    {
        "s. These workers make changes in the instructions that determine how the network, workstations, and ": null
    },
    {
        "CPU": "Central Processing Unit"
    },
    {
        " of the system handle the various jobs they have been given and how they communicate with peripheral equipment such as ": null
    },
    {
        "printers": "Computer Printer"
    },
    {
        " and ": null
    },
    {
        "disk drives": "Data Storage Device"
    },
    {
        ".       A software developer needs to have deep technical expertise with certain aspects of computing. Some positions will require a degree in a relevant field such as computer science, information technology, engineering, programming, or any other IT related post graduate studies.  An ideal software developer is a self-motivated professional carrying a dynamic hands-on experience on key languages of programming such as ": null
    },
    {
        "C++": "C++"
    },
    {
        ", ": null
    },
    {
        "C": "C Sharp"
    },
    {
        ", ": null
    },
    {
        "PHP": "Php"
    },
    {
        ", ": null
    },
    {
        "Java": "Java"
    },
    {
        ", ": null
    },
    {
        "C": "C"
    },
    {
        ", ": null
    },
    {
        "Javascript": "Javascript"
    },
    {
        ", VB, Python, Smalltalk.     According to developer Eric Sink, the differences between system design, ": null
    },
    {
        "software development": "Software Development"
    },
    {
        ", and programming are more apparent. Already in the current market place there can be found a segregation between programmers and developers, in that one who implements is not the same as the one who designs the ": null
    },
    {
        "class": "Class"
    },
    {
        "structure or hierarchy. Even more so that developers become ": null
    },
    {
        "software architects": "Software Architect"
    },
    {
        "or ": null
    },
    {
        "systems architect": "Systems Architect"
    },
    {
        "s, those who design the multi-leveled architecture or component interactions of a large software system.        Programmers in software development companies may work directly with experts from various fields to create software  – either programs designed for specific clients or packaged software for general use  – ranging from ": null
    },
    {
        "video games": "Video Game"
    },
    {
        "to educational software to programs for ": null
    },
    {
        "desktop publishing": "Desktop Publishing"
    },
    {
        " and financial planning. Programming of packaged software constitutes one of the most rapidly growing segments of the computer services industry. Some companies or organizations – even small ones – have set up their own IT team to ensure the design and development of in-house software to answer to very specific needs from their internal end-users, especially when existing software are not suitable or too expensive. This is for example the case in ": null
    },
    {
        "research laboratories": "Research Laboratories"
    },
    {
        ".     In some organizations, particularly small ones, people commonly known as programmer analysts are responsible for both the systems analysis and the actual programming work. The transition from a mainframe environment to one that is based primarily on ": null
    },
    {
        "personal computers": "Personal Computers"
    },
    {
        " has blurred the once rigid distinction between the programmer and the user. Increasingly, adept end users are taking over many of the tasks previously performed by programmers. For example, the growing use of packaged software, such as spreadsheet and database management software packages, allows users to write simple programs to access data and perform calculations.     In addition, the rise of the Internet has made ": null
    },
    {
        "web development": "Web Development"
    },
    {
        " a huge part of the programming field. Currently more software applications are ": null
    },
    {
        "web applications": "Web Application"
    },
    {
        "that can be used by anyone with a ": null
    },
    {
        "web browser": "Web Browser"
    },
    {
        ". Examples of such applications include the ": null
    },
    {
        "Google": "Google"
    },
    {
        " search service, the ": null
    },
    {
        "Outlook.com": "Outlook.Com"
    },
    {
        " e-mail service, and the ": null
    },
    {
        "Flickr": "Flickr"
    },
    {
        " photo-sharing service.     Programming editors, also known as ": null
    },
    {
        "source code editor": "Source Code Editor"
    },
    {
        "s, are text editors that are specifically designed for programmers or developers for writing the source code of an application or a program. Most of these editors include features useful for programmers, which may include color ": null
    },
    {
        "syntax highlighting": "Syntax Highlighting"
    },
    {
        ", auto indentation, ": null
    },
    {
        "auto-complete": "Auto-Complete"
    },
    {
        ", bracket matching, ": null
    },
    {
        "syntax check": "Syntax Checker"
    },
    {
        ", and allows ": null
    },
    {
        "plug-in": "Plug-In"
    },
    {
        "s. These features aid the users during coding, ": null
    },
    {
        "debugging": "Debugging"
    },
    {
        " and testing.               According to BBC News, 17% of computer science students could not find work in their field 6 months after graduation in 2009 which was the highest rate of the university subjects surveyed while 0% of medical students were unemployed in the same survey.  The UK category system does, however, class such degrees as ": null
    },
    {
        "information technology": "Information Technology"
    },
    {
        " and ": null
    },
    {
        "game design": "Game Design"
    },
    {
        " as computer science, industries in which jobs can be extremely difficult to find, somewhat inflating the actual figure.  ATAS classifications        Computer programming, ": null
    },
    {
        "offshore outsourcing": "Offshore Outsourcing"
    },
    {
        ", and ": null
    },
    {
        "Foreign Worker Visas": "Foreign Worker Visa"
    },
    {
        "became a controversial topic after the crash of the ": null
    },
    {
        "dot-com bubble": "Dot-Com Bubble"
    },
    {
        " left many programmers without work or with lower wages. Programming was even mentioned in the 2004 US Presidential debate on the topic of ": null
    },
    {
        "offshore outsourcing": "Offshore Outsourcing"
    },
    {
        ".      Large companies claim there is a ": null
    },
    {
        "skills shortage": "Skills Shortage"
    },
    {
        " with regard to programming talent. However, US programmers and unions counter that large companies are exaggerating their case in order to obtain cheaper programmers from developing countries and avoid previously employer paid training using industry specific technologies not covered in most accredited degree programs.  Migration Letters, Volume: 10, No: 2, pp. 211 – 228  & e Other reasons for employers claiming skill shortages is the result of their own cost saving combining of several disparate skill sets previously held by several specialized programmers into fewer generalized ": null
    },
    {
        "multifaceted": "Mechatronics"
    },
    {
        " positions that are unlikely to have enough ": null
    },
    {
        " qualified candidates": "Purple Squirrel"
    },
    {
        " with the desired experience. Purple Squirrels and the Reserve Army of the Unemployed Paul Solman  ": null
    },
    {
        "PBS": "Pbs"
    },
    {
        "August 15, 2012 accessdate 2016-06-10     Enrollment in computer-related degrees in US has dropped recently due to lack of general interests in science and mathematics and also out of an apparent fear that programming will be subject to the same pressures as manufacturing and agriculture careers. Theresa Beaubouef and John Mason, , ACM SIGCSE Bulletin, 2005 This situation has resulted in confusion about whether the US economy is entering a post-": null
    },
    {
        "information": "Quaternary Sector Of The Economy"
    },
    {
        " age and the nature of US ": null
    },
    {
        "comparative advantage": "Comparative Advantage"
    },
    {
        "s. Most academic institutions have an ": null
    },
    {
        "Institutional research": "Institutional Research"
    },
    {
        " office that keep past statistics of degrees conferred which show several dips and rises in Computer Science degrees over the past 30 years. The overall trend shows a slightly overall decline in growth since certain peaks of ": null
    },
    {
        "1986": "Early 1980S Recession In The United States"
    },
    {
        ", ": null
    },
    {
        "1992": "Early 1990S Recession In The United States"
    },
    {
        ", ": null
    },
    {
        "2002": "Dot-Com Bubble"
    },
    {
        ", and ": null
    },
    {
        "2008": "Great Recession"
    },
    {
        " showing periods of flat growth or even declines.  In addition the U.S. Bureau of Labor Statistics Occupational Outlook 2016-26 is -7% for Computer Programmers because ": null
    },
    {
        "Computer programming": "Computer Programming"
    },
    {
        " can be done from anywhere in the world, so companies sometimes hire programmers in countries where wages are lower. ": null
    }
]