[
    {
        "     Progressive multifocal leukoencephalopathy  is a rare and often fatal ": null
    },
    {
        "viral": "virus"
    },
    {
        " disease characterized by progressive damage  or ": null
    },
    {
        "inflammation": "inflammation"
    },
    {
        " of the ": null
    },
    {
        "white matter": "white matter"
    },
    {
        "  of the ": null
    },
    {
        "brain": "human brain"
    },
    {
        "  at multiple locations . It is caused by the ": null
    },
    {
        "JC virus": "jc virus"
    },
    {
        ", which is normally present and kept under control by the immune system. The JC virus is harmless except in cases of weakened immune systems. In general, PML has a mortality rate of 30–50% in the first few months, and those who survive can be left with varying degrees of neurological disabilities.     PML occurs almost exclusively in patients with severe ": null
    },
    {
        "immune deficiency": "immune deficiency"
    },
    {
        ", most commonly among patients with ": null
    },
    {
        "acquired immune deficiency syndrome": "acquired immune deficiency syndrome"
    },
    {
        " , but people on chronic ": null
    },
    {
        "immunosuppressive": "immunosuppressive"
    },
    {
        " medications including ": null
    },
    {
        "chemotherapy": "chemotherapy"
    },
    {
        " are also at increased risk of PML, such as patients with transplants, ": null
    },
    {
        "Hodgkins lymphoma": "hodgkins lymphoma"
    },
    {
        ", ": null
    },
    {
        "multiple sclerosis": "multiple sclerosis"
    },
    {
        ", ": null
    },
    {
        "psoriasis": "psoriasis"
    },
    {
        ", and other autoimmune diseases.       Symptoms can develop over several weeks to months, and they depend on location of damage in the brain and the degree of damage. The most prominent symptoms are clumsiness, progressive weakness, and visual, speech, and sometimes personality changes .   The lesions affecting the ": null
    },
    {
        "parietal": "parietal lobe"
    },
    {
        " and ": null
    },
    {
        "occipital": "occipital lobe"
    },
    {
        " lobes of the brain can lead to a phenomenon known as ": null
    },
    {
        "alien hand syndrome": "alien hand syndrome"
    },
    {
        ".            The cause of PML is a type of ": null
    },
    {
        "polyomavirus": "polyomavirus"
    },
    {
        " called the ": null
    },
    {
        "JC virus": "jc virus"
    },
    {
        " , after the initials of the person from whose tissue the virus was first successfully cultured. Recent publications indicate 39  to 58%  of the general population are seropositive for antibodies to JCV, indicating current or previous infection with the virus. Other publications put the percentage at 70 to 90% of the general population.  JCV causes persistent asymptomatic infection in about one-third of the adult population, based on viral shedding into the urine from the site of asymptomatic infection in the kidney. The virus causes disease only when the immune system has been severely weakened.       PML is most common in people with HIV1 infection; prior to the advent of effective ": null
    },
    {
        "antiretroviral therapy": "haart"
    },
    {
        ", as many as 5% of people with AIDS eventually developed PML.  It is unclear why PML occurs more frequently in people with AIDS than in other immunosuppressive conditions; some research suggests the effects of HIV on brain tissue, or on JCV itself, make JCV more likely to become active in the brain and increase its damaging inflammatory effects.      PML can still occur in people on immunosuppressive therapy, such as ": null
    },
    {
        "efalizumab": "efalizumab"
    },
    {
        ", ": null
    },
    {
        "belatacept": "belatacept"
    },
    {
        ", and various transplant drugs, which are meant to weaken the immune system.       ": null
    },
    {
        "Natalizumab": "natalizumab"
    },
    {
        " was approved in 2004 by the FDA for MS. It was subsequently ": null
    },
    {
        "withdrawn from the market": "list of withdrawn drugs"
    },
    {
        " by its manufacturer after it was linked with three cases of PML.  All three initial cases were taking natalizumab in combination with ": null
    },
    {
        "interferon beta-1a": "interferon beta-1a"
    },
    {
        ". After a safety review, the drug was returned to the market in 2006 as a monotherapy for MS under a special prescription program. As of May 2011, over 130 cases of PML had been reported in MS patients, all in patients who had taken natalizumab for more than a year. While none of them had taken the drug in combination with other disease-modifying treatments, previous use of MS treatments increases the risk of PML between three and four-fold. The estimated ": null
    },
    {
        "prevalence": "prevalence"
    },
    {
        " of PML in MS is 1.5 cases per thousand natalizumab users. Around 20% of MS patients with PML die, and most of the rest are very disabled.   A person with MS developed PML and died during a 4-year course of ": null
    },
    {
        "dimethyl fumarate": "dimethyl fumarate"
    },
    {
        ".      ": null
    },
    {
        "Fingolimod": "fingolimod"
    },
    {
        " was  by the FDA for MS. In 2015, the first case of PML, as well as a case of probable PML was reported by two Gilenya users that could not be tied to previous immunosuppressant therapies. These new cases are now being added to the drug information sheet included with every prescription .        PML is a ": null
    },
    {
        "demyelinating disease": "demyelinating disease"
    },
    {
        ", in which the ": null
    },
    {
        "myelin": "myelin"
    },
    {
        " sheath covering the ": null
    },
    {
        "axons": "axon"
    },
    {
        "of nerve cells is gradually destroyed, impairing the transmission of nerve impulses. It affects the subcortical white matter, particularly that of the parietal and occipital lobes. PML destroys ": null
    },
    {
        "oligodendrocytes": "oligodendrocyte"
    },
    {
        "and produces ": null
    },
    {
        "intranuclear": "intranuclear"
    },
    {
        " inclusions. It is similar to another demyelinating disease, MS, but progresses much more quickly. The breakdown of myelin is commensurate with the degree of immunocompromise.        PML is diagnosed in a patient with a progressive course of the disease, finding JC virus ": null
    },
    {
        "DNA": "dna"
    },
    {
        " in ": null
    },
    {
        "spinal fluid": "cerebrospinal fluid"
    },
    {
        " together with consistent white-matter lesions on brain ": null
    },
    {
        "magnetic resonance imaging": "magnetic resonance imaging"
    },
    {
        " ; alternatively, a brain ": null
    },
    {
        "biopsy": "biopsy"
    },
    {
        " is diagnostic when the typical histopathology of demyelination, bizarre astrocytes, and enlarged oligodendroglial nuclei are present, coupled with techniques showing the presence of JC virus.      Characteristic evidence of PML on brain ": null
    },
    {
        "CT scan": "ct scan"
    },
    {
        " images are multifocal, non": null
    },
    {
        "contrast": "radiocontrast agent"
    },
    {
        " enhancing hypodense lesions without ": null
    },
    {
        "mass effect": "mass effect"
    },
    {
        ", but MRI is far more sensitive than CT. The most common area of involvement is the cortical white matter of ": null
    },
    {
        "frontal": "frontal lobe"
    },
    {
        " and ": null
    },
    {
        "parieto": "parietal lobe"
    },
    {
        "occipital lobe": "occipital lobe"
    },
    {
        "s, but lesions may occur anywhere in the brain, such as the ": null
    },
    {
        "basal ganglia": "basal ganglia"
    },
    {
        ", ": null
    },
    {
        "external capsule": "external capsule"
    },
    {
        ", and ": null
    },
    {
        "posterior cranial fossa": "posterior cranial fossa"
    },
    {
        " structures such as the brain stem and cerebellum.   Although typically multifocal, natalizumab-associated PML is often monofocal, predominantly in the frontal lobe.       No drugs effectively inhibit or cure the virus infection without toxicity. Therefore, treatment aims at reversing the immune deficiency to slow or stop the disease progress. In patients on immunosuppression, this means stopping the drugs or using plasma exchange to accelerate the removal of the biologic agent that put the person at risk for PML.     In HIV-infected people, this may mean starting ": null
    },
    {
        "highly active antiretroviral therapy": "antiretroviral drug"
    },
    {
        " . AIDS patients starting HAART after being diagnosed with PML tend to have a slightly longer survival time than patients who were already on HAART and then develop PML.  Some AIDS patients with PML have been able to survive for several years, with HAART.  A rare complication of effective HAART is ": null
    },
    {
        "immune reconstitution inflammatory syndrome": "immune reconstitution inflammatory syndrome"
    },
    {
        " , in which increased immune system activity actually increases the damage caused by the JCV infection; although IRIS can often be managed with medication, it is extremely dangerous in PML.      Cidofovir was studied as possible treatment for PML  and has been used on a case-by-case basis, working in some, but not others.     Cytarabine , a chemotherapy drug used to treat certain cancers, has been prescribed on an experimental basis for a small number of non-AIDS PML patients, and stabilized the neurological condition of a minority of these patients.  One patient regained some cognitive function lost as a result of PML.      In June 2010, the first ": null
    },
    {
        "case report": "case report"
    },
    {
        " appeared of a PML patient being successfully treated with the antimalarial drug ": null
    },
    {
        "mefloquine": "mefloquine"
    },
    {
        " with activity against the JC virus. The patient cleared the virus and had no further neurological deterioration.      Two case reports of using ": null
    },
    {
        "interleukin-2": "interleukin-2"
    },
    {
        " successfully have been published.  Some success have been reported with ": null
    },
    {
        "mirtazapine": "mirtazapine"
    },
    {
        ", but this has not been demonstrated in clinical trials.      A number of drugs work against JC virus in ": null
    },
    {
        "cell culture": "cell culture"
    },
    {
        ", but no proven, effective therapy is known in humans.    For example, 1-O-hexadecyloxypropyl-cidofovir , suppresses JCV,  but has been found to have toxicity at therapeutic dosage.      Infusion of donor T cells specific to the related BK polyomavirus has shown possible effect in treating PML in one small study by Katy Rezvanis group, but needs further study. ": null
    }
]