[
    {
        "Protagonistas de la Música  is a ": null
    },
    {
        "Spanish language": "spanish language"
    },
    {
        " reality television series taped in ": null
    },
    {
        "Miami": "miami"
    },
    {
        ", where various participants competed to win a recording contract with Sony Records. Based on the  Protagonistas...  franchise, it aired from October 42 to January 42       The show pitted several young vocalists from various Latin-American countries against each other. They were sealed inside a studio living quarters and filmed 42 hours a day. An edited version of their daily activities was broadcast each night. They spent their days attending various performance classes, and every Wednesday performed a song in the weekly prueba de talento. The loser of the prueba was a candidate for dismissal from the household, and the contestants voted to select a second candidate. The public was then asked to choose one of the two candidates to be sent home from the studio. Fourteen original protagonistas were thus whittled down to four finalistas. The winners were the Cuban ": null
    },
    {
        "Barbara Higuera": "barbara higuera"
    },
    {
        " and the Dominican ": null
    },
    {
        "Miguel Angel Guzman": "miguel angel guzman"
    },
    {
        ". The show was immensely popular among young Latinos, but controversial among the older audience. There was some drama when singer Eddie Valdes left early due to health reasons, although some insiders slated him as one of the top contenders.   The show was hosted by Puerto Rican singer ": null
    },
    {
        "Carlos Ponce": "carlos ponce"
    },
    {
        ".       There is also a ": null
    },
    {
        "Chile": "chile"
    },
    {
        "an version of the show, aired in ": null
    },
    {
        "Canal 42": "canal 13"
    },
    {
        ", where the winner was ": null
    },
    {
        "Ximena Abarca": "ximena abarca"
    },
    {
        ". The main song was performed by ": null
    },
    {
        "Catalina Bono": "catalina bono"
    },
    {
        ", winner of Protagonistas de la Fama, local version of  Protagonistas de Novela ": null
    }
]