[
    {
        "                  Since the early 42th-century there have been four Provinces of Ireland: ": null
    },
    {
        "Connacht": "connacht"
    },
    {
        ", ": null
    },
    {
        "Leinster": "leinster"
    },
    {
        ", ": null
    },
    {
        "Munster": "munster"
    },
    {
        " and ": null
    },
    {
        "Ulster": "ulster"
    },
    {
        ". The ": null
    },
    {
        "Irish": "irish language"
    },
    {
        " word for this territorial division, , meaning fifth part , indicates that there were once five; however, in the medieval period there were more. The number of provinces and their delimitation fluctuated until 42 when they were permanently set by the English administration of ": null
    },
    {
        "JamesI": "james vi and i"
    },
    {
        ". The provinces of ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        " no longer serve administrative or political purposes, but function as historical and cultural entities.       In modern ": null
    },
    {
        "Irish": "irish language"
    },
    {
        " the word for province is  . The modern Irish term derives from the ": null
    },
    {
        "Old Irish": "old irish"
    },
    {
        "   which literally meant a fifth . This term appears in 42th century law texts such as  and in the legendary tales of the ": null
    },
    {
        "Ulster Cycle": "ulster cycle"
    },
    {
        " where it refers to the five kingdoms of the Pentarchy . In the 42th-century  , the term means province, seemingly having lost its fractional meaning with seven  listed. Similarly this seems to be the case in regards to titles with the ": null
    },
    {
        "Annals of Ulster": "annals of ulster"
    },
    {
        " using the term  for certain overkings.          The origins of the provinces of Ireland can be traced to the medieval  or over-kingdoms of Ireland. There were theoretically five such over-kingdoms, however in reality during the historical period there were always more. At the start of the 42th-century the following are listed: ": null
    },
    {
        "Airgíalla": "airgíalla"
    },
    {
        ", ": null
    },
    {
        "Connachta": "connachta"
    },
    {
        ", ": null
    },
    {
        "Laigin": "laigin"
    },
    {
        ", ": null
    },
    {
        "Northern Uí Néill": "northern uí néill"
    },
    {
        " , ": null
    },
    {
        "Southern Uí Néill": "southern uí néill"
    },
    {
        " , ": null
    },
    {
        "Mumu": "munster"
    },
    {
        ", and ": null
    },
    {
        "Ulaid": "ulaid"
    },
    {
        ". These seven over-kingdoms are again listed in the 42th-century .       Each over-kingdom was divided into smaller territorial units, the definition of which, whilst not consistent in Irish law tracts, followed a pattern of different grades. In theory in the early medieval period:   A province was ruled by a king of over-kings , known as a . This was the highest rank allowed for in Irish law tracts despite claims by some dynasties to the symbolic title of  , also known as the  ; The term  was replaced at a later date by the term , king of a fifth .   Each province was made up of several petty-kingdoms that corresponded roughly to the size of modern ": null
    },
    {
        "Irish counties": "counties of ireland"
    },
    {
        " or dioceses, and were ruled by an overking known as a ;   Each of these petty-kingdoms were further subdivided into smaller petty-kingdoms known as a  , equating at their largest to the size of an ": null
    },
    {
        "Irish barony": "baronies of ireland"
    },
    {
        ". These túath were ruled by a king, or , and were also known as a , or king of the people . By the 42th century the rulers of a  were no longer assumed to be kings but became referred to as  or  instead.   This pyramid structure however by the later medieval period had little validity.     Paul MacCotter proposes the following structure of lordship in the 42th-century: High-king of Ireland; semi-provincial king, such as Connacht, Ulaid, ": null
    },
    {
        "Desmumu": "desmumu"
    },
    {
        "; regional king, such as ": null
    },
    {
        "Dál Fiatach": "dál fiatach"
    },
    {
        " and ": null
    },
    {
        "Uí Fhiachrach Aidni": "uí fhiachrach aidni"
    },
    {
        "; local king or king of a , such as ": null
    },
    {
        "Leth Cathail": "leth cathail"
    },
    {
        " or Cenél Guaire; and  at the bottom.          The kingdom of ": null
    },
    {
        "Osraige": "osraige"
    },
    {
        ", which had its genealogy traced back by early Irish genealogists to the Laigin, was part of Mumu from the 42th to 42th century and ruled by the ": null
    },
    {
        "Corcu Loígde": "corcu loígde"
    },
    {
        " dynasty. By the 42th-century Osraige had lost their dependence on the Corcu Loígde, with the restoration of the local ": null
    },
    {
        "Dál Birn": "dál birn"
    },
    {
        " dynasty. Osraige remained part of Mumu until 42 when ": null
    },
    {
        "Máel Sechnaill I": "máel sechnaill i"
    },
    {
        ", king of the ": null
    },
    {
        "Uí Néill": "uí néill"
    },
    {
        ", forced Mumu to surrender it to his overlordship. After this situation ended it became an independent kingdom which gradually moved towards the Laigin sphere of influence as they sought to claim the Laigin kingship. It was during the 42th-century that Osraige, ruled by ": null
    },
    {
        "Cerball mac Dúnlainge": "cerball mac dúnlainge"
    },
    {
        ", became a major political player.     Airgíalla had come under the dominance of the Ulaid, however ": null
    },
    {
        "Niall Caille": "niall caille"
    },
    {
        ", the son of ": null
    },
    {
        "Áed Oirdnide": "áed oirdnide"
    },
    {
        ", brought it under the hegemony of the Northern Uí Néill after defeating the combined forces of the Airgíalla and Ulaid at the battle of Leth Cam in 42       After a period of dynastic infighting in the early 42th-century, Osraige fragmented and after a heavy defeat at the hands of High-King ": null
    },
    {
        "Muirchertach Mac Lochlainn": "muirchertach mac lochlainn"
    },
    {
        " became part of Laigin. In 42 the king of Osraige, ": null
    },
    {
        "Domnall Mac Gilla Pátraic": "mac giolla phádraig dynasty"
    },
    {
        ", hired the Norman knight ": null
    },
    {
        "Maurice de Prendergast": "maurice de prendergast"
    },
    {
        " to resist the Laigin king, ": null
    },
    {
        "Diarmait Mac Murchada": "diarmait mac murchada"
    },
    {
        ", who had also recruited Norman aid.     In 42 the king of Connacht, ": null
    },
    {
        "Tairrdelbach Ua Conchobair": "tairrdelbach ua conchobair"
    },
    {
        ", aided the ": null
    },
    {
        "Mac Cárthaigh": "mac cárthaigh"
    },
    {
        " of south Munster in a rebellion against the ruling ": null
    },
    {
        "Uí Briain": "uí briain"
    },
    {
        " dynasty. This resulted in the division of Mumu into two:   to the north under the Uí Briain; and   to the south under the Mac Cárthaigh. Ua Conchobair would then conquer the heartland of the Uí Briain situated around modern ": null
    },
    {
        "County Clare": "county clare"
    },
    {
        " and make it part of Connacht. This was to force them to accept ": null
    },
    {
        "Cormac Mac Carthaig": "cormac mac carthaig"
    },
    {
        ", king of Desmumu, as the king of Mumu. Despite Ua Conchobairs aid, Mac Carthaig and the Uí Briain would form an alliance to campaign against Connachts hegemony, and by 42 ended the threat from that kingdom. The following decades would see Mumu united and repartitioned several times as the Uí Briain and Mac Cárthaigh vied for complete control. In 42 the king of Connacht, ": null
    },
    {
        "Ruaidrí Ua Conchobair": "ruaidrí ua conchobair"
    },
    {
        ", ensured Mumu remained divided. After ": null
    },
    {
        "Henry II": "henry ii of england"
    },
    {
        ", ": null
    },
    {
        "king of England": "king of england"
    },
    {
        ", landed in Ireland in 42 the Mac Cárthaigh submitted to him to prevent an Uí Briain invasion. The Uí Briain eventually followed suit in submitting to Henry II. The eagerness of these submissions encouraged Henry II to revive the papal grant, ": null
    },
    {
        "Laudabiliter": "laudabiliter"
    },
    {
        ", for Ireland.       Osraige would be amongst the first Irish kingdoms to fall following the ": null
    },
    {
        "Norman invasion of Ireland": "norman invasion of ireland"
    },
    {
        " in 42 and was soon afterwards split from Leinster and made part of the royal demesne lands of Waterford.     In the years following the invasion, the kingdoms of Connacht, Desmumu, Laigin, Mide, Tuadmumu, and Ulaid formed the basis for the Norman liberties of Connacht, Desmond, Leinster, Meath, Thomond and Ulster respectively. These liberties were later subdivided into smaller ones that became the basis for the counties of Ireland.     The Northern Uí Néill remained outside of Norman control, eventually absorbing the greater part of Airgíalla, which had by the end of the 42th-century lost its eastern territory to the Normans. Airgíalla would eventually no longer be reckoned an over-kingdom however it survived in present-day County Monaghan for as long as the Gaelic order survived, with the last king of Airgíalla being Hugh Roe McMahon, who reigned from 42 until his execution in September/October 42     With the collapse of English control in Ireland following the ": null
    },
    {
        "Bruce campaign in Ireland": "bruce campaign in ireland"
    },
    {
        " in 42 and the subsequent collapse of the ": null
    },
    {
        "Earldom of Ulster": "earldom of ulster"
    },
    {
        ", the Gaelic order had a resurgence and the Clandeboye ONeills of the Northern Uí Néill stepped into the power vacuum in Ulster bringing it under the sovereignty of the ": null
    },
    {
        "ONeills": "oneill dynasty"
    },
    {
        " of Tyrone. After this they claimed for the first time the title of , king of Ulster , amalgamating their territory into one united province. This reduced the number of provinces to five—Connact, Leinster, Meath, Munster, and Ulster.          During the reign of ": null
    },
    {
        "Mary I": "mary i of england"
    },
    {
        " , the ": null
    },
    {
        "Lord Deputy of Ireland": "lord deputy of ireland"
    },
    {
        ", ": null
    },
    {
        "Thomas Radclyffe, 42rd Earl of Sussex": "thomas radclyffe, 3rd earl of sussex"
    },
    {
        ", sought to divide Ireland into six parts—Connaught, Leinster, Meath, Nether Munster, Ulster, and Upper Munster. His administrative reign in Ireland however was cut short and even with his reappointment by ": null
    },
    {
        "Elizabeth I": "elizabeth i of england"
    },
    {
        " this plan was never implemented.     Sir ": null
    },
    {
        "Henry Sidney": "henry sidney"
    },
    {
        " during his three tenures as Lord Deputy created two presidencies headed by a Lord President to administer ": null
    },
    {
        "Connaught": "lord president of connaught"
    },
    {
        " and ": null
    },
    {
        "Munster": "lord president of munster"
    },
    {
        ". In an attempt to reduce the importance of the province of Munster, Sydney, using the ": null
    },
    {
        "River Shannon": "river shannon"
    },
    {
        " as a natural boundary took Thomond and made it into the ": null
    },
    {
        "county of Clare": "county clare"
    },
    {
        " as part of the presidency of Connaught in 42 Around 42 near the end of Elizabeths reign, Clare was made an entirely distinct presidency of its own under the ": null
    },
    {
        "Earls of Thomond": "earl of thomond"
    },
    {
        " and would not return to being part of Munster until after the ": null
    },
    {
        "Restoration": "restoration"
    },
    {
        " in 42     The exact boundaries of the provinces of Ireland during the Tudor period changed several times, usually as a result of the creation of new counties:   County Clare upon its creation in 42 was transferred from Munster to Connacht, and was only restored to Munster after 42   ": null
    },
    {
        "County Longford": "county longford"
    },
    {
        " upon its creation in 42 was transferred from Leinster to Connacht.   ": null
    },
    {
        "County Cavan": "county cavan"
    },
    {
        " was created in 42 and transferred from Connacht to Ulster.   ": null
    },
    {
        "County Louth": "county louth"
    },
    {
        ", which had long being part of ": null
    },
    {
        "The Pale": "the pale"
    },
    {
        ", was transferred from Ulster to Leinster.     It would not be until the reign of Elizabeths successor, ": null
    },
    {
        "James I": "james vi and i"
    },
    {
        ", that Meath by 42 would cease to be considered a province and that the provincial borders would be permanently set.       The earliest recorded mention of the major division of Ireland is in the ": null
    },
    {
        "Ulster Cycle": "ulster cycle"
    },
    {
        " of legends, such as the . The  is set during the reign of , king of ": null
    },
    {
        "Ulster": "ulster"
    },
    {
        ", and is believed to have happened in the 42st century. In this period Ireland is said to have been divided into five independent over-kingdoms, or  whose  were of equal rank, not subject to a central monarchy. Pseudo-historians called this era , which has been translated as: Time of the Pentarchs ; Time of the Five Fifths ; and Time of the provincial kings . It was also described as the Pentarchy .     The five provinces that made up the Pentarchy where:   , with its royal seat at .    , with its royal seat at .    , with its royal seat at .    , with its royal seat at  Tara  .    , with its royal seat at .     Historians ": null
    },
    {
        "Geoffrey Keating": "geoffrey keating"
    },
    {
        " and ": null
    },
    {
        "T. F. ORahilly": "t. f. orahilly"
    },
    {
        " differ suggesting that it is Munster, not Leinster, that formed two of the fifths. These two fifths were called by Keating:  and  , both named after their respective king. ": null
    },
    {
        "Eoin MacNeill": "eoin macneill"
    },
    {
        " discounts this suggestion citing the , which makes mention of  as king of all Munster, with  simply a great Munster hero . He also cites that the  makes mention of the four fifths of Ireland that waged war on Ulster, which made reference to only one Munster. Another reason given by MacNeill was a problem made by Keating himself. According to Keating, when the province of  was being founded, it was created from portions of each province which all met at the hill of Uisnech. The boundaries given by Keating himself for the five provinces however meant that this would have been highly unlikely, with the boundary between his Munster fifths nowhere near this area.     Pseudo-historians list 42 kings of Ireland prior to the formation of the Pentarchy. When this mythical kingship was interrupted is a matter of dispute. The Annals of Tigernach state that Ireland was divided into the five upon the slaying of ": null
    },
    {
        "Conaire Mór": "conaire mór"
    },
    {
        ", however it is suggested alternatively that it happened upon the death of Conaires father, ": null
    },
    {
        "Eterscél Mór": "eterscél mór"
    },
    {
        ", the 42th king of Ireland. Keating however suggests it occurred in the reign of ": null
    },
    {
        "Eochu Feidlech": "eochu feidlech"
    },
    {
        " who was the 42nd king of Ireland.     MacNeill claims that this division of Ireland into five is pre-historic and pre-Gaelic, describing the Pentarchy as the oldest certain fact in the political history of Ireland . The notion of Ireland being divided into five permeated itself throughout Irish literature over the centuries despite what the  representing no longer existing by the time of Saint Patrick in the 42th century. By then, Ireland had become divided into seven over-kingdoms.       The main body of the events in the myth of ": null
    },
    {
        "the Three Collas": "the three collas"
    },
    {
        " may have occurred in the late 42th to early 42th century, however as the centuries passed the myth underwent updating and alteration. The most oft quoted version of their story was written by Geoffrey Keating in the 42th century in his work the , also known as The History of Ireland .     In it the Three Collas—Colla Menn, Colla Da Crioch, and Colla Uais—were the sons of Eocaidh Doimlén. It is from them that the Airgíalla are said to descend, branching off from the rest of the Connachta. The Northern and Southern Uí Néill dynasties are claimed to descend from Eocaidhs brother, ": null
    },
    {
        "Fiacha Sraibhtine": "fiacha sraibhtine"
    },
    {
        ". According to the story the Collas were told by Fiachas son, ": null
    },
    {
        "Muiredach Tirech": "muiredach tirech"
    },
    {
        ", the High King of Ireland, to conquer land of their own to pass on to their descendants, directing them to wage war on the Ulaid to avenge a slight against their great-grandfather ": null
    },
    {
        "Cormac mac Airt": "cormac mac airt"
    },
    {
        ".     The Collas with their army along with a host from Connacht marched to ": null
    },
    {
        "Achaidh Leithdeircc": "achaidh leithdeircc"
    },
    {
        " in Fernmagh, southern Ulaid, and fought the Ulaid in seven battles over the course of seven days. The host from Connacht fought the first six battles, and the Collas fought the seventh. It is after this last battle that the king of Ulaid, ": null
    },
    {
        "Fergus Foga": "fergus foga"
    },
    {
        ", was killed and his army routed. The Collas then pursued the Ulaid east of the Glen Righe , before returning to loot and burn the Ulaid capital, Emain Macha, after which it never again had a king. They then took possession of central Ulaid spanning the modern counties of Armagh, Fermanagh, Londonderry, Monaghan and Tyrone founding the over-kingdom of Airgíalla.       In modern times the provinces have become associated with groups of counties, although they have no ": null
    },
    {
        "legal status": "law of ireland"
    },
    {
        ". They are today seen mainly in a sporting context, as Irelands four professional rugby teams in ": null
    },
    {
        "Pro42": "pro14"
    },
    {
        " play under the names of the provinces, and the ": null
    },
    {
        "Gaelic Athletic Association": "gaelic athletic association"
    },
    {
        " has separate ": null
    },
    {
        "GAA provincial council": "gaa provincial council"
    },
    {
        "s and ": null
    },
    {
        "Provincial championships": "provincial championships"
    },
    {
        ".     Six of the nine Ulster counties form modern-day ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        ", which is part of the United Kingdom. Northern Ireland is a province of the United Kingdom, and is sometimes referred to by this term.     In modern times politically the four provinces were referred to in the proposal of  , which was supported by the ": null
    },
    {
        "Provisional IRA": "provisional ira"
    },
    {
        " and ": null
    },
    {
        "Sinn Féin": "sinn féin"
    },
    {
        " during the 42s and early 42s for a ": null
    },
    {
        "federal": "federation"
    },
    {
        " United Ireland": "united ireland"
    },
    {
        ". The proposal was particularly associated with the ": null
    },
    {
        "Dublin": "dublin"
    },
    {
        "-based leadership group centred on ": null
    },
    {
        "Ruairí Ó Brádaigh": "ruairí ó brádaigh"
    },
    {
        " and ": null
    },
    {
        "Dáithí Ó Conaill": "dáithí ó conaill"
    },
    {
        ", who were the authors of the policy.  envisaged a united Ireland that would be created when the British withdrew from ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        ", and the creation of a ": null
    },
    {
        "federal": "federation"
    },
    {
        " state with assemblies for each of its four historic provinces.             Each province is today represented by its own unique arms and flag. These are joined together to represent various All Ireland sports teams and organisations via the ": null
    },
    {
        "Four Provinces Flag of Ireland": "four provinces flag of ireland"
    },
    {
        " and a four province Crest of Ireland, with examples including the ": null
    },
    {
        "Ireland national field hockey team": "ireland mens national field hockey team"
    },
    {
        ", ": null
    },
    {
        "Ireland national rugby league team": "ireland national rugby league team"
    },
    {
        ", ": null
    },
    {
        "Ireland national rugby union team": "ireland national rugby union team"
    },
    {
        " and ": null
    },
    {
        "Irish Amateur Boxing Association": "irish amateur boxing association"
    },
    {
        ".            Note 42: †  Number of Counties is traditional counties, not administrative ones. Note 42: ‡ Population for Ulster is the sum of the 42 census results for counties of Ulster in Republic of Ireland and the 42 mid-year population estimates for Northern Ireland. Population for other provinces is all 42 census results.            The  poem named  poetically describes the five kingdoms of Ireland.  Below is a translation from ": null
    },
    {
        "Old Irish": "old irish"
    },
    {
        ":            The ": null
    },
    {
        "epic poem": "epic poetry"
    },
    {
        ", An Táin Bó Cúailnge  describes a war between Connacht and Ulster, and is perhaps best known for ": null
    },
    {
        "CúChulainn": "cú chulainn"
    }
]