[
    {
        "      Ávila  is a ": null
    },
    {
        "province": "provinces of spain"
    },
    {
        " of central-western ": null
    },
    {
        "Spain": "spain"
    },
    {
        ", in the southern part of the ": null
    },
    {
        "autonomous community": "autonomous communities of spain"
    },
    {
        " of ": null
    },
    {
        "Castile and León": "castile and león"
    },
    {
        ". It is bordered on the south by the provinces of ": null
    },
    {
        "Toledo": "toledo province"
    },
    {
        " and ": null
    },
    {
        "Cáceres": "cáceres province"
    },
    {
        ", on the west by ": null
    },
    {
        "Salamanca": "salamanca province"
    },
    {
        ", on the north by ": null
    },
    {
        "Valladolid": "valladolid province"
    },
    {
        ", and on the east by ": null
    },
    {
        "Segovia": "segovia province"
    },
    {
        " and ": null
    },
    {
        "Madrid": "madrid province"
    },
    {
        ". Ávila has a population of 42 and is ranked 42th out of 42 of Spanish provinces in population. Its capital is ": null
    },
    {
        "Ávila": "ávila, spain"
    },
    {
        ".            Ávila is naturally divided into two sections, differing completely in soil and climate. The northern portion is generally level; the soil is of indifferent quality, strong and ": null
    },
    {
        "marly": "wiktionary:marletymology"
    },
    {
        " in a few places, but rocky in all the valleys of the Sierra de Ávila; and the climate alternates from severe cold in winter to extreme heat in summer. The population of this part is mainly agricultural. The southern division is one mass of rugged granitic sierras, interspersed, however, with sheltered and well-watered valleys, abounding with rich vegetation.     The winter here, especially in the elevated region of the Paramera and the waste lands of Ávila, is long and severe, but the climate is not unhealthy.     The principal mountain chains are the Guadarrama, separating this province from Madrid; the Paramera and ": null
    },
    {
        "Sierra de Ávila": "sierra de ávila"
    },
    {
        ", west of the Guadarrama; and the vast wall of the ": null
    },
    {
        "Sierra de Gredos": "sierra de gredos"
    },
    {
        " along the southern frontier, where its outstanding peaks rise to 42 or even 42  ft. ": null
    },
    {
        "Pico Almanzor": "pico almanzor"
    },
    {
        " is the highest point. The ridges which ": null
    },
    {
        "ramify": "wiktionary:ramifyenglish"
    },
    {
        " from the Paramera are covered with valuable forests of beeches, oaks and firs, presenting a striking contrast to the bare peaks of the Sierra de Gredos.     The principal rivers are the ": null
    },
    {
        "Alberche": "alberche"
    },
    {
        " and ": null
    },
    {
        "Tiétar": "tiétar river"
    },
    {
        ", belonging to the basin of the ": null
    },
    {
        "Tagus": "tagus"
    },
    {
        ", and the Tormes, Trabancos and Adaja, belonging to that of the ": null
    },
    {
        "Douro": "douro"
    },
    {
        ".       The first recorded inhabitants of Ávila were the ": null
    },
    {
        "Celts": "celts"
    }
]