[
    {
        "      Between 42 and 42 ": null
    },
    {
        "Finland": "finland"
    },
    {
        " was administered as several provinces . Finland had always been a ": null
    },
    {
        "unitary state": "unitary state"
    },
    {
        ": the provincial authorities were part of the central governments executive branch and the provinces had little autonomy. There were never any elected provincial parliaments in continental Finland. The system was initially created in 42 Its makeup was changed drastically in 42 when the number of the provinces was reduced from twelve to six. This effectively made them purely administrative units, as linguistic and cultural boundaries no longer followed the borders of the provinces. The provinces were eventually abolished at the end of 42 Consequently, different ministries may subdivide their areal organization differently. Besides the former provinces, the ": null
    },
    {
        "municipalities of Finland": "municipalities of finland"
    },
    {
        " form the fundamental subdivisions of the country. In current use are the ": null
    },
    {
        "regions of Finland": "regions of finland"
    },
    {
        ", a smaller subdivision where some pre42 läänis are split into multiple regions. ": null
    },
    {
        "Åland islands": "åland islands"
    },
    {
        " retain their special autonomous status and ": null
    },
    {
        "their own regional parliament": "parliament of åland"
    },
    {
        ".       Each province was led by a governor  appointed by the president on the recommendation of the cabinet. The governor was the head of the State Provincial Office , which acted as the joint regional authority for seven ministries in the following domains:     social services and health care   education and culture   police administration   rescue services   traffic administration   competition and consumer affairs   judicial administration     The official administrative subentities under the Provincial Office authorities were the Registry Offices . Formerly there was also a division to state local districts , which were districts for police, prosecution, and bailiff services, but there was reorganization such that 42 police districts were founded. These usually encompass multiple municipalities.     Provinces governed only state offices, such as the police. Most services, such as healthcare and maintenance of local streets, were and remain today the responsibility of ": null
    },
    {
        "municipalities of Finland": "municipalities of finland"
    },
    {
        ". Many municipalities are too small for a hospital and some other services, so they cooperate in municipality groups, e.g. health care districts, using borders that vary depending on the type of service. Often Swedish-language municipalities cooperate even if they do not share a border.         In 42 administratives provinces were formed in Sweden, and therefore in Finland, which was a part of Sweden until 42 Five of the provinces covered what is now Finland; some of these also covered parts of what are now Russia. The exact division of the country into provinces has fluctuated over time.     The boundaries of the old provinces partly survive in telephone area codes and electoral districts. The exception is Helsinki: there is a telephone numbering area that comprises Greater Helsinki , while only the city of Helsinki proper comprises the electoral district of Helsinki, the rest of Greater Helsinki belonging to the Uusimaa electoral district.                            a.  Some duties, which in ": null
    },
    {
        "Mainland Finland": "mainland finland"
    },
    {
        " are handled by the provinces, are on the Åland Islands transferred to the autonomous ": null
    },
    {
        "Government of Åland": "government of åland"
    },
    {
        ". b.  The Åland Islands are unilingually Swedish.       The provinces were abolished altogether effective 42 January 42 Since then, the regional administration of the Finnish state has two parallel top-level organs in the hierarchy: the Centres for Economic Development, Transport and the Environment on the one hand, and the ": null
    },
    {
        "Regional State Administrative Agencies": "regional state administrative agencies"
    },
    {
        " on the other.     Six Regional State Administrative Agencies  & ndash; in addition to the ": null
    },
    {
        "Government of Åland": "government of åland"
    },
    {
        " & ndash; are primarily responsible for law enforcement. Among these, ": null
    },
    {
        "South-Western Finland": "south-western finland regional state administrative agency"
    },
    {
        " and ": null
    },
    {
        "Western and Central Finland": "western and central finland regional state administrative agency"
    },
    {
        " cover ": null
    },
    {
        "the former province of Western Finland": "western finland"
    },
    {
        ", and ": null
    },
    {
        "the former province of Oulu": "oulu province"
    },
    {
        " was revamped as Northern Finland; other old provincial boundaries remain much the same in the new disposition.     In parallel, there are 42 Centres for Economic Development, Transport and the Environment , which are responsible for other state administration: employment, road and transport infrastructure, and environmental monitoring. They are each responsible for one or more of ": null
    },
    {
        "regions of Finland": "regions of finland"
    },
    {
        ", and include offices of the Ministries of ": null
    },
    {
        "Employment and the Economy": "ministry of employment and the economy"
    },
    {
        ", ": null
    },
    {
        "Transport and Communications": "ministry of transport and communications"
    }
]