[
    {
        "        Lugo is a ": null
    },
    {
        "province": "province"
    },
    {
        " of northwestern Spain, in the northeastern part of the ": null
    },
    {
        "autonomous community": "autonomous communities of spain"
    },
    {
        " of ": null
    },
    {
        "Galicia": "galicia"
    },
    {
        ". It is bordered by the provinces of ": null
    },
    {
        "Ourense": "ourense province"
    },
    {
        ", ": null
    },
    {
        "Pontevedra": "pontevedra province"
    },
    {
        ", and ": null
    },
    {
        "A Coruña": "a coruña province"
    },
    {
        ", the principality of ": null
    },
    {
        "Asturias": "asturias"
    },
    {
        ", the State of ": null
    },
    {
        "León": "león province"
    },
    {
        ", and in the north by the Cantabrian Sea .     The population is 42 , of whom a quarter live in the capital ": null
    },
    {
        "Lugo": "lugo"
    },
    {
        ". The capital city was an ancient Celtic settlement named in honour of the god ": null
    },
    {
        "Lugh": "lugh"
    },
    {
        " , later Latinised as Lucus Augusti, and which became one of the three main important ": null
    },
    {
        "Galician-Roman": "galicia history"
    },
    {
        " centres alongside Braccara Augusta and Asturica Augusta . The province has 42 municipalities.       The vast majority of people have a common language which is ": null
    },
    {
        "Galician": "galician language"
    },
    {
        ". Some people, especially the older generation, are monolingual and only speak Galician. There are only a few people bilingual in Galician and Castilian of the little over 42 inhabitants. Even in the capital, the vitality of the Galician language in conversation is very strong.     The inhabitants speak several variants of Galician in the province of Lugo. They have the characteristics of being the closest to León isoglosses and therefore also the Castilian language. So they have some grammatical and phonetic signs that are mistakenly considered influences of the Castilian or Leonese languages. However, the language of Galicia in Lugo, especially in non-coastal areas, is probably the most genuine in Galicia, due to almost no historic pressure  of Castilian exercised on the rural population.           The estuaries of the Lugo province are part of the Atlas estuaries. From west to east they are:   O Barqueiro estuary   Viveiro estuary   Foz estuary   Ribadeo estuary       Miño river   Sil river   Landro river   Ouro river   Masmo river            ": null
    }
]