[
    {
        "     The Province of Massa-Carrara  is a ": null
    },
    {
        "province": "provinces of italy"
    },
    {
        " in the ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        " region of central ": null
    },
    {
        "Italy": "italy"
    },
    {
        ". It is named after the two main towns in its territory: ": null
    },
    {
        "Massa": "massa di carrara"
    },
    {
        ", its capital, and ": null
    },
    {
        "Carrara": "carrara"
    },
    {
        ".            The province of Massa e Carrara was born in 1859 from the separation of the ": null
    },
    {
        "Lunigiana": "lunigiana"
    },
    {
        " and the ": null
    },
    {
        "Garfagnana": "garfagnana"
    },
    {
        " from the ": null
    },
    {
        "Duchy of Modena": "duchy of modena"
    },
    {
        ". Originally it was composed of three circondari: I° Circondario of Massa and Carrara , II° Circondario of Castelnuovo Garfagnana , III° Circondario of Pontremoli .     Until the census of 1861, the province appears as part of Compartimento territoriale Modena, Reggio and Massa, but since the census of the population of 1871 it has been counted as part of ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        ". Later, with the Regio Decreto n. 1913 of September 2, 1923 , the municipalities of Calice al Cornoviglio and Rocchetta Vara were detached from the province, and added to the new ": null
    },
    {
        "province of La Spezia": "province of la spezia"
    },
    {
        ". In the same period the 17 municipalities of the Circondario Castelnuovo Garfagnana were removed from Emilia and assigned to the ": null
    },
    {
        "province of Lucca": "province of lucca"
    },
    {
        ", in order to compensate for the passage to the new ": null
    },
    {
        "province of Pistoia": "province of pistoia"
    },
    {
        " of all the municipalities of the ": null
    },
    {
        "Val di Nievole": "val di nievole"
    },
    {
        ".     The province of Massa and Carrara was left crippled, waiting for a reorganization. In 1938, the municipalities of Carrara, Massa and Montignoso joined and became the municipality of Apuania. In the same year, the industrial zone Apuana was instituted, including in relative Consortium C.Z.I.A the municipalities of neighbouring ": null
    },
    {
        "Versilia": "versilia"
    },
    {
        ", and the province assumed the name of province of Apuania. In 1946, with decree Lieutenant one the new municipality of Apuania was formed, and the province resumptions the denomination does not date from 1859 when it was Massa and Carrara but Massa. This was the name that had been designated to the city of Massa or Massa of Carrara from 1700 until the formation of the ": null
    },
    {
        "Kingdom of Italy": "kingdom of italy"
    },
    {
        " , to distinguish it from other homonymous cities.     In 2009 both decrees of 1938 and 1946 were abolished, restoring the old name.           The province covers an area of  and a total population of about 200,000.   There are 17  comuni   in the province.                The provinces economical relevance, once mainly based on the production of the famous white Carrara ": null
    },
    {
        "marble": "marble"
    },
    {
        ", has now shifted to the importation and fabrication of blocks of marble and granite from all over the world.": null
    }
]