[
    {
        "Pteranodon  is a ": null
    },
    {
        "genus": "genus"
    },
    {
        " of ": null
    },
    {
        "pterosaur": "pterosaur"
    },
    {
        " that included some of the largest known flying ": null
    },
    {
        "reptile": "reptile"
    },
    {
        "s, with wingspans over 7 meters . They lived during the late ": null
    },
    {
        "Cretaceous": "cretaceous"
    },
    {
        " geological period of ": null
    },
    {
        "North America": "north america"
    },
    {
        " in present-day ": null
    },
    {
        "Kansas": "kansas"
    },
    {
        ", ": null
    },
    {
        "Alabama": "alabama"
    },
    {
        ", ": null
    },
    {
        "Nebraska": "nebraska"
    },
    {
        ", ": null
    },
    {
        "Wyoming": "wyoming"
    },
    {
        ", and ": null
    },
    {
        "South Dakota": "south dakota"
    },
    {
        ". More ": null
    },
    {
        "fossil": "fossil"
    },
    {
        " specimens of Pteranodon have been found than any other pterosaur, with about 1,200 specimens known to science, many of them well preserved with nearly complete skulls and articulated skeletons. It was an important part of the animal community in the ": null
    },
    {
        "Western Interior Seaway": "western interior seaway"
    },
    {
        ".     Pteranodon were pterosaurs, not ": null
    },
    {
        "dinosaur": "dinosaur"
    },
    {
        "s. By definition, all dinosaurs belong to one of the two groups within ": null
    },
    {
        "Dinosauria": "dinosauria"
    },
    {
        ", i.e. ": null
    },
    {
        "Saurischia": "saurischia"
    },
    {
        " or ": null
    },
    {
        "Ornithischia": "ornithischia"
    },
    {
        ". As such, this excludes pterosaurs. Nonetheless, Pteranodon are frequently featured in dinosaur media and are strongly associated with dinosaurs by the general public. While not dinosaurs, pterosaurs such as Pteranodon form a sister ": null
    },
    {
        "clade": "clade"
    },
    {
        " to dinosaurs within the clade ": null
    },
    {
        "Avemetatarsalia": "avemetatarsalia"
    },
    {
        ".          Pteranodon species are extremely well represented in the fossil record, allowing for detailed descriptions of their anatomy and analysis of their life history. Over 1,000 specimens have been identified, though less than half are complete enough to give researchers good anatomical information. Still, this is more fossils material than is known for any other pterosaur, and it includes both male and female specimens of various age groups and possibly species.     Adult Pteranodon specimens from the two major species can be divided into two distinct size classes. The smaller class of specimens have small, rounded head crests and very wide pelvic canals, even wider than those of the much larger size class. The size of the pelvic canal probably allowed the laying of eggs, indicating that these smaller adults are females. The larger size class, representing male individuals, have narrow hips and very large crests, which were probably for display.     Adult male Pteranodon were among the largest pterosaurs, and were the largest flying animals known until the late 20th century, when the giant ": null
    },
    {
        "azhdarchid": "azhdarchid"
    },
    {
        " pterosaurs were discovered. The wingspan of an average adult male Pteranodon was . Adult females were much smaller, averaging  in wingspan. The largest specimen of Pteranodon longiceps from the ": null
    },
    {
        "Niobrara Formation": "niobrara formation"
    },
    {
        " measured  from wingtip to wingtip. An even larger specimen is known from the ": null
    },
    {
        "Pierre Shale Formation": "pierre shale formation"
    },
    {
        ", with a wingspan of , though this specimen may belong to the distinct genus and species  Geosternbergia maysei .  While most specimens are found crushed, enough fossils exist to put together a detailed description of the animal.      Methods used to estimate the mass of large male Pteranodon specimens have been notoriously unreliable, producing a wide range of estimates from as low as  to as high as . In a review of pterosaur size estimates published in 2010, researchers Mark Witton and Mike Habib demonstrated that the latter, largest estimates are almost certainly incorrect given the total volume of a Pteranodon body, and could only be correct if the animal was principally  ": null
    },
    {
        "aluminium": "aluminium"
    },
    {
        " . Witton and Habib considered the methods used by researchers who obtained smaller mass estimates equally flawed. Most have been produced by scaling modern animals such as bats and birds up to Pteranodon size, despite the fact that pterosaurs have vastly different body proportions and soft tissue anatomy from any living animal.     Other distinguishing characteristics that set Pteranodon apart from other pterosaurs include narrow ": null
    },
    {
        "neural spines": "neural spine"
    },
    {
        "on the vertebrae, plate-like bony ligaments strengthening the vertebrae above the hip, and a relatively short tail in which the last few vertebrae are fused into a long rod. Bennett, S. C. . New evidence on the tail of the pterosaur Pteranodon . Pp. 18–23 in Currie, P. J. and E. H. Koster , Fourth Symposium on Mesozoic Terrestrial Ecosystems, Short Papers. Occasional Papers of the Tyrrell Museum of Paleontology, 3. The entire length of the tail was about 3.5% as long as the wingspan, or up to  in the largest males.          Unlike earlier pterosaurs, such as  Rhamphorhynchus  and  Pterodactylus , Pteranodon had toothless ": null
    },
    {
        "beak": "beak"
    },
    {
        "s, similar to those of ": null
    },
    {
        "bird": "bird"
    },
    {
        "s. Pteranodon beaks were made of solid, bony margins that projected from the base of the jaws. The beaks were long, slender, and ended in thin, sharp points. The upper jaw, which was longer than the lower jaw, was curved upward; while this normally has been attributed only to the upward-curving beak, one specimen has a curvature corresponding with the beak widening towards the tip. While the tip of the beak is not known in this specimen, the level of curvature suggests it would have been extremely long. The unique form of the beak in this specimen led ": null
    },
    {
        "Alexander Kellner": "alexander kellner"
    },
    {
        " to assign it to a distinct genus,  Dawndraco , in 2010.      The most distinctive characteristic of Pteranodon is its cranial crest. These crests consisted of skull bones projecting upward and backward from the skull. The size and shape of these crests varied due to a number of factors, including age, sex, and species. Male Pteranodon sternbergi, the older species of the two described to date , had a more vertical crest with a broad forward projection, while their descendants, Pteranodon longiceps, evolved a narrower, more backward-projecting crest. Females of both species were smaller and bore small, rounded crests. The crests were probably mainly display structures, though they may have had other functions as well.              The wing shape of Pteranodon suggests that it would have flown rather like a modern-day ": null
    },
    {
        "albatross": "albatross"
    },
    {
        ". This is based on the fact that Pteranodon had a high ": null
    },
    {
        "aspect ratio": "aspect ratio"
    },
    {
        "  similar to that of the albatross — 9:1 for Pteranodon, compared to 8:1 for an albatross. Albatrosses spend long stretches of time at sea fishing, and use a flight pattern called ": null
    },
    {
        "dynamic soaring": "dynamic soaring"
    },
    {
        " which exploits the vertical gradient of wind speed near the ocean surface to travel long distances without flapping, and without the aid of ": null
    },
    {
        "thermals": "thermal"
    },
    {
        ".  While most of a Pteranodon flight would have depended on soaring, like long-winged seabirds, it probably required an occasional active, rapid burst of flapping, and studies of Pteranodon wing loading indicate that they were capable of substantial flapping flight, contrary to some earlier suggestions that they were so big they could only glide.      Like other pterosaurs, Pteranodon probably took off from a standing, quadrupedal position. Using their long forelimbs for leverage, they would have vaulted themselves into the air in a rapid leap. Almost all of the energy would have been generated by the forelimbs. The upstroke of the wings would have occurred when the animal cleared the ground followed by a rapid down-stroke to generate additional lift and complete the launch into the air.             Historically, the terrestrial locomotion of Pteranodon, especially whether it was ": null
    },
    {
        "biped": "biped"
    },
    {
        "al or ": null
    },
    {
        "quadruped": "quadruped"
    },
    {
        "al, has been the subject of debate. Today, most pterosaur researchers agree that pterosaurs were quadrupedal, thanks largely to the discovery of pterosaur ": null
    },
    {
        "trackway": "fossil trackway"
    },
    {
        "s.      The possibility of aquatic locomotion via swimming has been discussed briefly in several papers .          The diet of Pteranodon is known to have included ": null
    },
    {
        "fish": "fish"
    },
    {
        "; fossilized fish bones have been found in the ": null
    },
    {
        "stomach": "stomach"
    },
    {
        " area of one Pteranodon, and a fossilized fish ": null
    },
    {
        "bolus": "bolus"
    },
    {
        " has been found between the jaws of another Pteranodon, specimen AMNH 5098. Numerous other specimens also preserve fragments of fish scales and vertebrae near the torso, indicating that fish made up a majority of the diet of Pteranodon .     Traditionally, most researchers have suggested that Pteranodon would have taken fish by dipping their beaks into the water while in low, soaring flight. However, this was probably based on the assumption that the animals could not take off from the water surface. It is more likely that Pteranodon could take off from the water, and would have dipped for fish while swimming rather than while flying. Even a small, female Pteranodon could have reached a depth of at least  with its long bill and neck while floating on the surface, and they may have reached even greater depths by plunge-diving into the water from the air like some modern long-winged seabirds. In 1994, Bennett noted that the head, neck, and shoulders of Pteranodon were as heavily built as diving birds, and suggested that they could dive by folding back their wings like the modern ": null
    },
    {
        "gannet": "gannet"
    },
    {
        ".          Pteranodon was notable for its skull crest, though the function of this crest has been a subject of debate. Most explanations have focused on the blade-like, backward pointed crest of male P. longiceps, however, and ignored the wide range of variation across age and sex. The fact that the crests vary so much rules out most practical functions other than for use in mating displays.  Therefore, display was probably the main function of the crest, and any other functions were secondary.     Scientific interpretations of the crests function began in 1910, when George Francis Eaton proposed two possibilities: an aerodynamic counterbalance and a muscle attachment point. He suggested that the crest might have anchored large, long jaw muscles, but admitted that this function alone could not explain the large size of some crests. Eaton, G.F. . Osteology of Pteranodon. Memoirs of the Connecticut Academy of Arts and Sciences, 2:1–38, pls. i–xxxi. Bennett agreed with Eatons own assessment that the crest was too large and variable to have been a muscle attachment site. Eaton had suggested that a secondary function of the crest might have been as a counterbalance against the long beak, reducing the need for heavy neck muscles to control the orientation of the head. Wind tunnel tests showed that the crest did function as an effective counterbalance to a degree, but Bennett noted that, again, the hypothesis focuses only on the long crests of male P. longiceps, not on the larger crests of P. sternbergi and very small crests that existed among the females. Bennett found that the crests of females had no counterbalancing effect, and that the crests of male P. sternbergi would, by themselves, have a negative effect on the balance of the head. In fact, side to side movement of the crests would have required more, not less, neck musculature to control balance.     In 1943, Dominik von Kripp suggested that the crest may have served as a ": null
    },
    {
        "rudder": "rudder"
    },
    {
        ", an idea embraced by several later researchers. von Kripp, D. . Ein Lebensbild von Pteranodon ingens auf flugtechnischer Grundlage. Nova Acta Leopoldina, N.F., 12: 16–32 One researcher, Ross S. Stein, even suggested that the crest may have supported a membrane of skin connecting the backward-pointing crest to the neck and back, increasing its surface area and effectiveness as a rudder.  The rudder hypothesis, again, does not take into account females nor P. sternbergi, which had an upward-pointing, not backward-pointing crest. Bennett also found that, even in its capacity as a rudder, the crest would not provide nearly so much directional force as simply maneuvering the wings. The suggestion that the crest was an air brake, and that the animals would turn their heads to the side in order to slow down, suffers from a similar problem. Bramwell, C.D. and Whitfield, G.R. . Biomechanics of Pteranodon. Philosophical Transactions Royal Society B, 267. Additionally, the rudder and air brake hypotheses do not explain why such large variation exists in crest size even among adults.     ": null
    },
    {
        "Alexander Kellner": "alexander kellner"
    },
    {
        " suggested that the large crests of the pterosaur  Tapejara , as well as other species, might be used for heat exchange, allowing these pterosaurs to absorb or shed heat and regulate body temperature, which also would account for the correlation between crest size and body size. There is no evidence of extra blood vessels in the crest for this purpose, however, and the large, membranous wings filled with blood vessels would have served that purpose much more effectively.     With these hypotheses ruled out, the best-supported hypothesis for crest function seems to be as a sexual display. This is consistent with the size variation seen in fossil specimens, where females and juveniles have small crests and males large, elaborate, variable crests.          Adult Pteranodon specimens may be divided into two distinct size classes, small and large, with the large size class being about one and a half times larger than the small class, and the small class being twice as common as the large class. Both size classes lived alongside each other, and while researchers had previously suggested that they represent different species, Christopher Bennett showed that the differences between them are consistent with the concept that they represent females and males, and that Pteranodon species were ": null
    },
    {
        "sexually dimorphic": "sexual dimorphism"
    },
    {
        ". Skulls from the larger size class preserve large, upward and backward pointing crests, while the crests of the smaller size class are small and triangular. Some larger skulls also show evidence of a second crest that extended long and low, toward the tip of the beak, which is not seen in smaller specimens.      The sex of the different size classes was determined, not from the skulls, but from the pelvic bones. Contrary to what may be expected, the smaller size class had disproportionately large and wide-set pelvic bones. Bennett interpreted this as indicating a more spacious birth canal, through which eggs would pass. He concluded that the small size class with small, triangular crests represent females, and the larger, large-crested specimens represent males.     Note that the overall size and crest size also corresponds to age. Immature specimens are known from both females and males, and immature males often have small crests similar to adult females. Therefore, it seems that the large crests only developed in males when they reached their large, adult size, making the sex of immature specimens difficult to establish from partial remains.      The fact that females appear to have outnumbered males two to one suggests that, as with modern animals with size-related sexual dimorphism, such as ": null
    },
    {
        "sea lions": "sea lion"
    },
    {
        "and other ": null
    },
    {
        "pinniped": "pinniped"
    },
    {
        "s, Pteranodon might have been ": null
    },
    {
        "polygynous": "polygyny"
    },
    {
        ", with a few males competing for association with groups consisting of large numbers of females. Similar to modern pinnipeds, Pteranodon may have competed to establish territory on rocky, offshore rookeries, with the largest, and largest-crested, males gaining the most territory and having more success mating with females. The crests of male Pteranodon would not have been used in competition, but rather as visual dominance-rank symbols , with display rituals taking the place of physical competition with other males. If this ": null
    },
    {
        "hypothesis": "hypothesis"
    },
    {
        " is correct, it also is likely that male Pteranodon played little to no part in rearing the young; such a behavior is not found in the males of modern polygynous animals who father many offspring at the same time.             Specimens assigned to Pteranodon have been found in both the ": null
    },
    {
        "Smoky Hill Chalk": "smoky hill chalk"
    },
    {
        " deposits of the ": null
    },
    {
        "Niobrara Formation": "niobrara formation"
    },
    {
        ", and the slightly younger Sharon Springs deposits of the ": null
    },
    {
        "Pierre Shale Formation": "pierre shale formation"
    },
    {
        ". When Pteranodon was alive, this area was covered by a large inland sea, known as the ": null
    },
    {
        "Western Interior Seaway": "western interior seaway"
    },
    {
        ". Famous for fossils collected since 1870, these formations extend from as far south as ": null
    },
    {
        "Kansas": "kansas"
    },
    {
        " in the United States to ": null
    },
    {
        "Manitoba": "manitoba"
    },
    {
        " in Canada. However, Pteranodon specimens have only been found in the southern half of the formation, in Kansas, ": null
    },
    {
        "Wyoming": "wyoming"
    },
    {
        ", and ": null
    },
    {
        "South Dakota": "south dakota"
    },
    {
        ". Despite the fact that numerous fossils have been found in the contemporary parts of the formation in Canada, no pterosaur specimens have ever been found there. This strongly suggests that the natural geographic range of Pteranodon covered only the southern part of the Niobrara, and that its habitat did not extend farther north than South Dakota.     Some very fragmentary fossils belonging to pteranodontian pterosaurs, and possibly Pteranodon itself, have also been found on the ": null
    },
    {
        "Gulf Coast": "gulf coast of the united states"
    },
    {
        " and ": null
    },
    {
        "East Coast of the United States": "east coast of the united states"
    },
    {
        ". For example, some bone fragments from the ": null
    },
    {
        "Mooreville Formation": "mooreville formation"
    },
    {
        " of ": null
    },
    {
        "Alabama": "alabama"
    },
    {
        " and the ": null
    },
    {
        "Merchantville Formation": "merchantville formation"
    },
    {
        " of ": null
    },
    {
        "Delaware": "delaware"
    },
    {
        " may have come from Pteranodon, though they are too incomplete to make a definite identification. Some remains from Japan have also been tentatively attributed to Pteranodon, but their distance from its known Western Interior Seaway habitat makes this identification unlikely.      Pteranodon longiceps would have shared the sky with the giant-crested pterosaur  Nyctosaurus . Compared to P. longiceps, which was a very common species, Nyctosaurus was rare, making up only 3% of pterosaur fossils from the formation. Also less common was the early toothed ": null
    },
    {
        "bird": "bird"
    },
    {
        ",  Ichthyornis .     It is likely that, as in other polygynous animals , Pteranodon lived primarily on offshore rookeries, where they could nest away from land-based predators and feed far from shore; most Pteranodon fossils are found in locations which at the time, were hundreds of kilometres from the coastline.     Below the surface, the sea was populated primarily by invertebrates such as ": null
    },
    {
        "ammonites": "ammonite"
    },
    {
        "and ": null
    },
    {
        "squid": "squid"
    },
    {
        ". Vertebrate life, apart from basal fish, included ": null
    },
    {
        "sea turtle": "sea turtle"
    },
    {
        "s, such as  Toxochelys , the ": null
    },
    {
        "plesiosaur": "plesiosaur"
    },
    {
        "  Styxosaurus , and the flightless diving bird  Parahesperornis . ": null
    },
    {
        "Mosasaurs": "mosasaur"
    },
    {
        "were the most common marine reptiles, with genera including  Clidastes  and  Tylosaurus . At least some of these marine reptiles are known to have fed on Pteranodon. ": null
    },
    {
        "Barnum Brown": "barnum brown"
    },
    {
        ", in 1904, reported plesiosaur stomach contents containing pterodactyl bones, most likely from Pteranodon.      Fossils from terrestrial ": null
    },
    {
        "dinosaurs": "dinosaur"
    },
    {
        "also have been found in the Niobrara Chalk, suggesting that animals who died on shore must have been washed out to sea .               Pteranodon was the first pterosaur found outside of ": null
    },
    {
        "Europe": "europe"
    },
    {
        ". Its fossils first were found by ": null
    },
    {
        "Othniel Charles Marsh": "othniel charles marsh"
    },
    {
        " in 1870, in the Late Cretaceous ": null
    },
    {
        "Smoky Hill Chalk": "smoky hill chalk"
    },
    {
        " deposits of western Kansas. These ": null
    },
    {
        "chalk": "chalk"
    },
    {
        " beds were deposited at the bottom of what was once the ": null
    },
    {
        "Western Interior Seaway": "western interior seaway"
    },
    {
        ", a large shallow sea over what now is the midsection of the North American continent. These first specimens, YPM 1160 and YPM 1161, consisted of partial wing bones, as well as a tooth from the prehistoric fish  Xiphactinus , which Marsh mistakenly believed to belong to this new pterosaur . In 1871, Marsh named the find Pterodactylus oweni , assigning it to the well-known European ": null
    },
    {
        "genus": "genus"
    },
    {
        "  Pterodactylus . Marsh also collected more wing bones of the large pterosaur in 1871. Realizing that the name he had chosen had already been used for Harry Seeleys European pterosaur species  Pterodactylus oweni  in 1864, Marsh re-named his giant North American pterosaur Pterodactylus occidentalis, meaning Western wing finger, in his 1872 description of the new specimen. He also named two additional species, based on size differences: Pterodactylus ingens , and Pterodactylus velox .     Meanwhile, Marshs rival ": null
    },
    {
        "Edward Drinker Cope": "edward drinker cope"
    },
    {
        " also had unearthed several specimens of the large North American pterosaur. Based on these specimens, Cope named two new species, Ornithochirus umbrosus and Ornithochirus harpyia, in an attempt to assign them to the large European genus  Ornithocheirus , though he misspelled the name . Copes paper naming his species was published in 1872, just five days after Marshs paper. This resulted in a dispute, fought in the published literature, over whose names had priority in what obviously were the same species. Cope conceded in 1875 that Marshs names did have priority over his, but maintained that Pterodactylus umbrosus was a distinct species from any that Marsh had named previously. Cope, E.D. . The Vertebrata of the Cretaceous formations of the West. Report, U. S. Geological Survey of the Territories , 2: 302 pp., 57 pls. Re-evaluation by later scientists has supported Marshs case, and found that Copes assertion that P. umbrosus was a larger, distinct species were incorrect.          While the first Pteranodon wing bones were collected by Marsh and Cope in the early 1870s, the first Pteranodon skull was found on May 2, 1876, along the ": null
    },
    {
        "Smoky Hill River": "smoky hill river"
    },
    {
        " in ": null
    },
    {
        "Wallace County": "wallace county, kansas"
    },
    {
        " , Kansas, USA, by ": null
    },
    {
        "Samuel Wendell Williston": "samuel wendell williston"
    },
    {
        ", a fossil collector working for Marsh. Bennett, S.C. . Inferring stratigraphic position of fossil vertebrates from the Niobrara Chalk of western Kansas. Current Research in Earth Sciences: Kansas Geological Survey Bulletin, 244: 26 pp. A second, smaller skull soon was discovered as well. These skulls showed that the North American pterosaurs were different from any European species, in that they lacked teeth and had bony crests on their skulls. Marsh recognized this major difference, describing the specimens as distinguished from all previously known genera of the order Pterosauria by the entire absence of teeth. Marsh recognized that this characteristic warranted a new genus, and he coined the name Pteranodon in 1876. Marsh reclassified all the previously named North American species from Pterodactylus to Pteranodon. He considered the smaller skull to belong to Pteranodon occidentalis, based on its size. Marsh classified the larger skull, YPM 1117, in the new species Pteranodon longiceps, which he thought to be a medium-sized species in between the small P. occidentalis and the large P. ingens.  Marsh also named several additional species: Pteranodon comptus and  Pteranodon nanus  were named for fragmentary skeletons of small individuals, while Pteranodon gracilis was based on a wing bone that he mistook for a pelvic bone. He soon realized his mistake, and re-classified that specimen again into a separate genus, which he named  Nyctosaurus . P, nanus was also later recognized as a Nyctosaurus specimen.      In 1892, Samuel Williston examined the question of Pteranodon classification. He noticed that, in 1871, Seeley had mention the existence of a partial set of toothless pterosaur jaws from the ": null
    },
    {
        "Cambridge Greensand": "cambridge greensand"
    },
    {
        " of ": null
    },
    {
        "England": "england"
    },
    {
        ", which he named Ornithostoma . Because the primary characteristic Marsh had used to separate Pteranodon from other pterosaurs was its lack of teeth, Williston concluded that ": null
    },
    {
        "Ornithostoma": "ornithostoma"
    },
    {
        " must be considered the senior synonym of Pteranodon. However, in 1901, Pleininger pointed out that Ornithostoma had never been scientifically described or even assigned a species name until Willistons work, and therefore had been a  nomen nudum  and could not beat out Pteranodon for naming priority. Williston accepted this conclusion and went back to calling the genus Pteranodon. However, both Williston and Pleininger were incorrect, because unnoticed by both of them was the fact that, in 1891, Seeley himself had finally described and properly named Ornithostoma, assigning it to the species O. sedgwicki. In the 2010s, more research on the identity of Ornithostoma showed that it was probably not Pteranodon or even a close relative, but may in fact have been an ": null
    },
    {
        "azhdarchoid": "azhdarchoidea"
    },
    {
        ", a different type of toothless pterosaur.        Williston was also the first scientist to critically evaluate all of the pteranodont species classified by Cope and Marsh. He agreed with most of Marshs classification, with a few exceptions. First, he did not believe that P. ingens and P. umbrosus could be considered synonyms, which even Cope had come to believe. He considered both P. velox and P. longiceps to be dubious; the first was based on non-diagnostic fragments, and the second, though known from a complete skull, probably belonged to one of the other, previously-named species. In 1903, Williston revisited the question of Pteranodon classification, and revised his earlier conclusion that there were seven species down to just three. He considered both P. comptus and P. nanus to be specimens of Nyctosaurus, and divided the others into small , medium , and large species , based primarily on the shape of their upper arm bones. He thought P. longiceps, the only one known from a skull, could be a synonym of either P. velox or P. occidentalis, based on its size.     In 1910, Eaton became the first scientist to publish a more detailed description of the entire Pteranodon skeleton, as it was known at the time. He used his findings to revise the classification of the genus once again based on a better understanding of the differences in pteranodont anatomy. Eaton conducted experiments using clay models of bones to help determine the effects of crushing and flattening on the shapes of the arm bones Williston had used in his own classification. Eaton found that most of the differences in bone shapes could be easily explained by the pressures of fossilization, and concluded that no Pteranodon skeletons had any significant differences from each other besides their size. Therefore, Eaton was left to decide his classification scheme based on differences in the skulls alone, which he assigned to species just as Marsh did, by their size. In the end, Eaton recognized only three valid species: P. occidentalis, P. ingens, and P. longiceps.     The discovery of specimens with upright crests, classified by Harksen in 1966 as the new species  Pteranodon sternbergi , complicated the situation even further, prompting another revision of the genus by Miller in 1972. Because it was impossible to determine crest shape for all of the species based on headless skeletons, Miller concluded that all Pteranodon species except the two based on skulls  must be considered  nomena dubia  and abandoned. The skull Eaton thought belonged to P. ingens was placed in the new species Pteranodon marshi, and the skull Eaton assigned to P. occidentalis was re-named Pteranodon eatoni. Miller also recognized another species based on a skull with a crest similar to that of P. sternbergi; Miller named this Pteranodon walkeri. To help bring order to this tangle of names, Miller created three categories or subgenera for them. P. marshi and P. longiceps were placed in the subgenus Longicepia, though this was later changed to simply Pteranodon due to the rules of priority. P. sternbergi and P. walkeri, the upright-crested species, were given the subgenus Sternbergia, which was later changed to  Geosternbergia  because Sternbergia was already in use . Finally, Miller named the subgenus Occidentalia for P. eatoni, the skull formerly associated with P. occidentalis. Miller further expanded the concept of Pteranodon to include  Nyctosaurus  as a fourth subgenus. Miller considered these to be an evolutionary progression, with the primitive Nyctosaurus, at the time thought to be crestless, giving rise to Occidentalia , which in turn gave rise to Pteranodon with its long backwards crest, finally leading to Geosternbergia with its large, upright crest. However, Miller made several mistakes in his study concerning which specimens Marsh had assigned to which species, and most scientists disregarded his work on the subject in their later research, though Wellnhofer followed Millers species list. and Schoch somewhat oddly published another revision that essentially returned to Marshs original classification scheme, most notably sinking P. longiceps as a synonym of P. ingens.       During the early 1990s, S. Christopher Bennett also published several major papers reviewing the anatomy, taxonomy and life history of Pteranodon.     Fragmentary fossils assigned to Pteranodon have also been discovered in ": null
    },
    {
        "Skåne": "skåne"
    },
    {
        ", ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ". Allt om Vetenskap, 10-2012, p.72              Pteranodon fossils are known primarily from the ": null
    },
    {
        "Niobrara Formation": "niobrara formation"
    },
    {
        " of the central United States. Broadly defined, Pteranodon existed for more than four million years, during the late ": null
    },
    {
        "Coniacian": "coniacian"
    },
    {
        " to early ": null
    },
    {
        "Campanian": "campanian"
    },
    {
        " stages of the ": null
    },
    {
        "Cretaceous": "cretaceous"
    },
    {
        " period.  The genus is present in most layers of the Niobrara Formation except for the upper two; in 2003, ": null
    },
    {
        "Kenneth Carpenter": "kenneth carpenter"
    },
    {
        " surveyed the distribution and dating of fossils in this formation, demonstrating that Pteranodon sternbergi existed there from 88 to 85 million years ago, while P. longiceps existed between 86 and 84.5 million years ago. A possible third species, which Kellner named  Geosternbergia maysei  in 2010, is known from the Sharon Springs member of the ": null
    },
    {
        "Pierre Shale Formation": "pierre shale formation"
    },
    {
        " in Kansas, ": null
    },
    {
        "Wyoming": "wyoming"
    },
    {
        ", and ": null
    },
    {
        "South Dakota": "south dakota"
    },
    {
        ", dating to between 81.5 and 80.5 million years ago.      In the early 1990s, Bennett noted that the two major ": null
    },
    {
        "morphs": "polymorphism"
    },
    {
        " of pteranodont present in the Niobrara Formation were precisely separated in time with little, if any, overlap. Due to this, and to their gross overall similarity, he suggested that they probably represent  chronospecies  within a single evolutionary lineage lasting about 4 million years. In other words, only one species of Pteranodon would have been present at any one time, and P. sternbergi  in all likelihood was the direct ancestor species of P. longiceps.       Many researchers consider there to be at least two species of Pteranodon. However, aside from the differences between males and females described above, the post-cranial skeletons of Pteranodon show little to no variation between species or specimens, and the bodies and wings of all pteranodonts were essentially identical.     Two species of Pteranodon are traditionally recognized as valid: Pteranodon longiceps, the ": null
    },
    {
        "type species": "type species"
    },
    {
        ", and Pteranodon sternbergi. The species differ only in the shape of the crest in adult males , and possibly in the angle of certain skull bones. Because well-preserved Pteranodon skull fossils are extremely rare, researchers use stratigraphy to determine species identity in most cases.     Pteranodon sternbergi is the only known species of Pteranodon with an upright crest. The lower jaw of P. sternbergi was  long. Zimmerman, H., Preiss, B., and Sovak, J. . Beyond the Dinosaurs!: sky dragons, sea monsters, mega-mammals, and other prehistoric beasts, Simon and Schuster. . It was collected by ": null
    },
    {
        "George F. Sternberg": "george f. sternberg"
    },
    {
        " in 1952 and described by John Christian Harksen in 1966, from the lower portion of the Niobrara Formation. It was older than P. longiceps and is considered by Bennett to be the direct ancestor of the later species.     Because fossils identifiable as P. sternbergi are found exclusively in the lower layers of the Niobrara Formation, and P. longiceps fossils exclusively in the upper layers, a fossil lacking the skull can be identified based on its position in the geologic column .      Below is a ": null
    },
    {
        "cladogram": "cladogram"
    },
    {
        " showing the phylogenetic placement of this genus within Pteranodontia from Andres and Myers .              Due to the subtle variations between specimens of pteranodontid from the Niobrara Formation, most researchers have assigned all of them to the single genus Pteranodon, in at least two species  distinguished mainly by the shape of the crest. However, the classification of these two forms has varied from researcher to researcher. In 1972, Halsey Wilkinson Miller published a paper arguing that the various forms of Pteranodon were different enough to be placed in distinct subgenera. He named these Pteranodon occidentalis  and Pteranodon sternbergi. However, the name Sternbergia was preoccupied, and in 1978 Miller re-named the species Pteranodon sternbergi, and named a third subgenus/species combination for P. longiceps, as Pteranodon longiceps. Most prominent pterosaur researchers of the late 20th century however, including S. Christopher Bennett and ": null
    },
    {
        "Peter Wellnhofer": "peter wellnhofer"
    },
    {
        ", did not adopt these subgeneric names, and continued to place all pteranodont species into the single genus Pteranodon.     In 2010, pterosaur researcher ": null
    },
    {
        "Alexander Kellner": "alexander kellner"
    },
    {
        " revisited H.W. Millers classification. Kellner followed Millers opinion that the differences between the Pteranodon species were great enough to place them into different genera. He placed P. sternbergi into the genus named by Miller, Geosternbergia, along with the Pierre Shale skull specimen which Bennett had previously considered to be a large male P. longiceps. Kellner argued that this specimens crest, though incompletely preserved, was most similar to Geosternbergia. Because the specimen was millions of years younger than any known Geosternbergia, he assigned it to the new species Geosternbergia maysei. Numerous other pteranodont specimens are known from the same formation and time period, and Kellner suggested they may belong to the same species as G. maysei, but because they lack skulls, he could not confidently identify them.          A number of additional species of Pteranodon have been named since the 1870s, although most now are considered to be junior synonyms of two or three valid species. The best-supported is the ": null
    },
    {
        "type species": "type species"
    },
    {
        ", P. longiceps, based on the well-preserved specimen including the first-known skull found by S. W. Williston. This individual had a wingspan of .  Other valid species include the possibly larger P. sternbergi, with a wingspan originally estimated at . P. oweni , P. velox, P. umbrosus, P. harpyia, and P. comptus are considered to be nomina dubia by Bennett and others who question their validity. All probably are synonymous with the more well-known species.     Because the key distinguishing characteristic Marsh noted for Pteranodon was its lack of teeth, any toothless pterosaur jaw fragment, wherever it was found in the world, tended to be attributed to Pteranodon during the late nineteenth and early twentieth centuries. This resulted in a plethora of species and a great deal of confusion. The name became a ": null
    },
    {
        "wastebasket taxon": "wastebasket taxon"
    },
    {
        ", rather like the dinosaur  Megalosaurus , to label any pterosaur remains that could not be distinguished other than by the absence of teeth. Species have been reclassified a number of times, and several ": null
    },
    {
        "subgenera": "genus"
    },
    {
        " have in the 1970s been erected by Halsey Wilkinson Miller to hold them in various combinations, further confusing the taxonomy . Notable authors who have discussed the various aspects of Pteranodon include Bennett, Padian, Unwin, Kellner, and Wellnhofer. Two species, P. orogensis and P. orientalis, are not pteranodontids and have been renamed  Bennettazhia oregonensis and  Bogolubovia orientalis respectively.       Status of names listed below follow a survey by Bennett, 1994 unless otherwise noted.   ": null
    }
]