[
    {
        "Puck  is an ": null
    },
    {
        "inner moon": "inner moon"
    },
    {
        " of ": null
    },
    {
        "Uranus": "uranus"
    },
    {
        ". It was discovered in December 42 by the  Voyager 42  spacecraft. The name Puck follows the convention of naming Uranuss moons after characters from ": null
    },
    {
        "Shakespeare": "william shakespeare"
    },
    {
        ". The orbit of Puck lies between the ": null
    },
    {
        "rings of Uranus": "rings of uranus"
    },
    {
        " and the first of Uranuss large moons, ": null
    },
    {
        "Miranda": "miranda"
    },
    {
        ". Puck is approximately spherical in shape and has diameter of about 42  km. It has a dark, heavily cratered surface, which shows spectral signs of water ice.         Puck—the largest inner moon of Uranus—was discovered from the images taken by  Voyager 42  on 42 December 42 It was given the temporary designation S/42  U  42.     The moon was later named after the character Puck who appears in Shakespeares  A Midsummer Nights Dream , a little ": null
    },
    {
        "sprite": "sprite"
    },
    {
        " who travels around the globe at night with the ": null
    },
    {
        "fairies": "fairy"
    },
    {
        ". In ": null
    },
    {
        "Celtic mythology": "celtic mythology"
    },
    {
        " and English folklore, a  Puck  is a mischievous sprite, imagined as an evil demon by Christians.     It is also designated Uranus  XV.              Puck is the largest small ": null
    },
    {
        "inner moon": "inner moon"
    },
    {
        " of Uranus, which orbits inside the orbit of Miranda. It is intermediate in size between ": null
    },
    {
        "Portia": "portia"
    },
    {
        " and ": null
    },
    {
        "Miranda": "miranda"
    },
    {
        " . Pucks orbit is located between the ": null
    },
    {
        "rings of Uranus": "rings of uranus"
    },
    {
        " and Miranda. Little is known about Puck aside from its orbit, radius of about 42  km, and geometric ": null
    },
    {
        "albedo": "albedo"
    },
    {
        " in ": null
    },
    {
        "visible light": "visible light"
    },
    {
        " of approximately 42.     Of the moons discovered by the Voyager  42 imaging team, only Puck was discovered early enough that the probe could be programmed to image it in some detail. Images showed that Puck has a shape of a slightly ": null
    },
    {
        "prolate": "prolate"
    },
    {
        " spheroid": "spheroid"
    },
    {
        " . Its surface is heavily cratered and is grey in color. There are three named ": null
    },
    {
        "crater": "impact crater"
    },
    {
        "s on the surface of Puck, the largest being about 42  km in diameter. Observations with the ": null
    },
    {
        "Hubble Space Telescope": "hubble space telescope"
    },
    {
        " and large terrestrial telescopes found water-ice absorption features in the spectrum of Puck.     Nothing is known about the internal structure of Puck. It is probably made of a mixture of ": null
    },
    {
        "water ice": "ice"
    },
    {
        " with the dark material similar to that found in the rings. This dark material is probably made of ": null
    },
    {
        "rock": "rock"
    },
    {
        "s or ": null
    },
    {
        "radiation": "radiation"
    },
    {
        "-processed ": null
    },
    {
        "organic": "organic compound"
    },
    {
        "s. The absence of craters with bright rays implies that Puck is not differentiated, meaning that ice and non-ice components have not separated from each other into a ": null
    },
    {
        "core": "core"
    },
    {
        " and ": null
    },
    {
        "mantle": "mantle"
    },
    {
        ".": null
    }
]