[
    {
        "              The punk subculture includes a diverse array of ": null
    },
    {
        "ideologies": "Punk Ideologies"
    },
    {
        ", ": null
    },
    {
        "fashion": "Punk Fashion"
    },
    {
        ", and other forms of expression, ": null
    },
    {
        "visual art": "Punk Visual Art"
    },
    {
        ", dance, ": null
    },
    {
        "literature": "Punk Literature"
    },
    {
        " and film. It is largely characterised by anti-establishment views, the promotion of individual freedom, ": null
    },
    {
        "DIY ethic": "Diy Ethic"
    },
    {
        "s, and is centred on a loud, aggressive genre of rock music called ": null
    },
    {
        "punk rock": "Punk Rock"
    },
    {
        ". Its adherents are referred to as punks .     Punk politics cover the entire political spectrum. The punk ethos is primarily made up of beliefs such as non-conformity, ": null
    },
    {
        "anti-authoritarianism": "Anti-Authoritarianism"
    },
    {
        ", ": null
    },
    {
        "anti-corporatism": "Anti-Corporatism"
    },
    {
        ", a ": null
    },
    {
        "do-it-yourself ethic": "Diy Ethic"
    },
    {
        ", ": null
    },
    {
        "anti-consumerist": "Anti-Consumerist"
    },
    {
        ", anti-conservative, anti-": null
    },
    {
        "corporate greed": "Corporate Greed"
    },
    {
        ", ": null
    },
    {
        "direct action": "Direct Action"
    },
    {
        " and not ": null
    },
    {
        "selling out": "Selling Out"
    },
    {
        " .     There is a wide range of punk fashion, including deliberately offensive T-shirts, leather jackets, ": null
    },
    {
        "Dr. Martens": "Dr. Martens"
    },
    {
        " boots, hairstyles such as brightly coloured hair and spiked mohawks, cosmetics, tattoos, jewellery and ": null
    },
    {
        "body modification": "Body Modification"
    },
    {
        ". Women in the hardcore scene typically wore masculine clothing.    \t   An important aspect of punk was creating explicitly outward identities of sexuality. Everything that was normally supposed to be hidden was brought to the front.     Punk aesthetics determine the type of art punks enjoy, which typically has ": null
    },
    {
        "underground": "Underground Art"
    },
    {
        ", ": null
    },
    {
        "minimalist": "Minimalism"
    },
    {
        ", ": null
    },
    {
        "iconoclastic": "Iconoclasm"
    },
    {
        " and ": null
    },
    {
        "satirical": "Satire"
    },
    {
        " sensibilities. Punk has generated a considerable amount of poetry and ": null
    },
    {
        "prose": "Prose"
    },
    {
        ", and has its own ": null
    },
    {
        "underground press": "Underground Press"
    },
    {
        " in the form of ": null
    },
    {
        "zines": "Punk Zine"
    },
    {
        ". Many ": null
    },
    {
        "punk-themed films": "List Of Punk Films"
    },
    {
        " and videos have been made.             The punk subculture emerged in the United Kingdom and the United States in the mid-1970s. Exactly which region originated punk has long been a matter of controversy within the movement.    Savage, Jon. Englands Dreaming: The Sex Pistols and Punk Rock. ": null
    },
    {
        "Faber and Faber": "Faber And Faber"
    },
    {
        ", 1991.     Early punk had an abundance of antecedents and influences, and ": null
    },
    {
        "Jon Savage": "Jon Savage"
    },
    {
        " describes the subculture as a ": null
    },
    {
        "bricolage": "Bricolage"
    },
    {
        " of almost every previous youth culture in the ": null
    },
    {
        "Western world": "Western World"
    },
    {
        " since World War II, stuck together with safety pins . Savage, Jon. Teenage: The Creation of Youth Culture. P. xvi. 2007. Viking. England. Various musical, ": null
    },
    {
        "philosophical": "Philosophical Movement"
    },
    {
        ", ": null
    },
    {
        "political": "Political Movement"
    },
    {
        ", literary and ": null
    },
    {
        "artistic movements": "Artistic Movements"
    },
    {
        " influenced the subculture.     In the late 1970s, the subculture began to diversify, which led to the proliferation of factions such as ": null
    },
    {
        "new wave": "New Wave Music"
    },
    {
        ", ": null
    },
    {
        "post-punk": "Post-Punk"
    },
    {
        ", ": null
    },
    {
        "2 Tone": "2 Tone"
    },
    {
        ", ": null
    },
    {
        "pop punk": "Pop Punk"
    },
    {
        ", ": null
    },
    {
        "hardcore punk": "Hardcore Punk"
    },
    {
        ", ": null
    },
    {
        "no wave": "No Wave"
    },
    {
        ", ": null
    },
    {
        "street punk": "Street Punk"
    },
    {
        " and ": null
    },
    {
        "Oi!": "Oi!"
    },
    {
        ". Hardcore punk, street punk and Oi! sought to do away with the frivolities introduced in the later years of the original punk movement. ": null
    },
    {
        "AllMusic": "Allmusic"
    },
    {
        ",  ": null
    },
    {
        "underground music": "Underground Music"
    },
    {
        " scenes such as ": null
    },
    {
        "alternative rock": "Alternative Rock"
    },
    {
        ", ": null
    },
    {
        "indie music": "Indie Music"
    },
    {
        ", ": null
    },
    {
        "crossover thrash": "Crossover Thrash"
    },
    {
        " and the extreme subgenres of ": null
    },
    {
        "heavy metal": "Heavy Metal Music"
    },
    {
        " . A new movement in the United States became visible in the early and mid-1990s that sought to revive the punk movement, doing away with some of the trappings of hardcore.             The punk subculture is centered on a loud, aggressive genre of rock music called punk rock, usually played by bands consisting of a vocalist, one or two electric guitarists, an electric bassist and a drummer. In some bands, the musicians contribute backup vocals, which typically consist of shouted slogans, choruses or ": null
    },
    {
        "football-style chants": "Football Chant"
    },
    {
        ".     While most punk rock uses the distorted guitars and noisy drumming sounds derived from 1960s ": null
    },
    {
        "garage rock": "Garage Rock"
    },
    {
        " and 1970s ": null
    },
    {
        "pub rock": "Pub Rock"
    },
    {
        ", some punk bands incorporate elements from other subgenres, such as ": null
    },
    {
        "surf rock": "Surf Rock"
    },
    {
        ", ": null
    },
    {
        "rockabilly": "Rockabilly"
    },
    {
        " or ": null
    },
    {
        "reggae": "Reggae"
    },
    {
        ". Most punk rock songs are short, have simple and somewhat basic arrangements using relatively few chords, and they typically have lyrics that express punk ideologies and values, although some punk lyrics are about lighter topics such as partying or ": null
    },
    {
        "romantic relationships": "Intimate Relationship"
    },
    {
        ".     Different punk subcultures often distinguish themselves by having a unique style of punk rock, although not every style of punk rock has its own associated subculture.     The earliest form of music to be called punk rock was 1960s ": null
    },
    {
        "garage rock": "Garage Rock"
    },
    {
        ", and the term was applied to the genre retroactively by influential rock critics in the early 1970s. Bangs, Lester. Psychotic Reactions and Carburetor Dung. Anchor Books, a division of Random House. 2003. pg. 8, 56, 57, 61, 64, 101: reprints of articles which appeared in 1971 and 1972, that refer to garage bands such as the Count Five and the Troggs as punk ; pg. 101 associates Iggy and Jonathan of Modern Lovers with the Troggs and their ilk ; pg. 112-113 speak of the Guess Who as punk --": null
    },
    {
        "The Guess Who": "The Guess Who"
    },
    {
        " had made recordings as a garage rock outfit in the mid 60s; pg. 8 makes a general statement about punk rock as a genre: ...then punk bands started cropping up who were writing their own songs but taking the Yardbirds sound and reducing it to this kind of goony fuzztone clatter...oh, it was beautiful, it was pure folklore, Old America, and sometimes I think those were the best days ever. ; pg. 225 is a reprint from article which appeared in late-70s, that refers back to garage bands as punk Laing, Dave. One Chord Wonders: Power and Meaning in Punk Rock. PM Press. Oakland, CA 2015, 1984. pg. 22-23 - Laing writes that the term, punk rock was used generically in the early 70s to describe mid-60s garage rock bands & mdash;he quotes Greg Shaw from the late 70s referring to how it was used in the early 70s to designate the genre: Punk rock in those days was a quaint fanzine term for a transient form of mid-60s music...  ": null
    }
]