[
    {
        "         Q is a fictional character as well as the name of a race in  Star Trek  appearing in the  Next Generation ,  Deep Space Nine , and  Voyager  series, as well as in related media. The most familiar Q is portrayed by ": null
    },
    {
        "John de Lancie": "john de lancie"
    },
    {
        ". He is an extra-dimensional being of unknown origin who possesses immeasurable power over normal human notions of time, space, the laws of physics, and reality itself, being capable of altering it to his whim. Despite his vast knowledge and experience spanning untold eons , he is not above practical jokes for his own personal amusement, for a Machiavellian and manipulative purpose, or to prove a point. He is said to be almost ": null
    },
    {
        "omnipotent": "omnipotence"
    },
    {
        ", and he is continually evasive regarding his true motivations.     The name Q applies to the names of the individuals portrayed , it also applies to the name of their race and to the Q Continuum itself – an ": null
    },
    {
        "alternate dimension": "parallel universe"
    },
    {
        " accessible to only the Q and their invited guests. The true nature of the realm is said to be beyond the comprehension of lesser beings such as humans, therefore it is shown to humans only in ways they can understand; e.g., a run-down gas station in the middle of nowhere.     Beginning with the pilot episode ": null
    },
    {
        "Encounter at Farpoint": "encounter at farpoint"
    },
    {
        " of  The Next Generation , Q became a recurring character, with pronounced comedic and dramatic chemistry with ": null
    },
    {
        "Jean-Luc Picard": "jean-luc picard"
    },
    {
        ". He serves as a major antagonist throughout The Next Generation, playing a pivotal role in both the first and final episodes. Q is initially presented as a cosmic force judging humanity to see if it is becoming a threat to the universe, but as the series progresses, his role morphs more into one of a teacher to Picard and the human race generally – albeit often in seemingly destructive or disruptive ways, subject to his own amusement. Other times, notably during ": null
    },
    {
        "Deja Q": "deja q"
    },
    {
        " and Voyager, Q appears to the crew seeking assistance.     ": null
    },
    {
        "Gene Roddenberry": "gene roddenberry"
    },
    {
        " chose the letter ": null
    },
    {
        "Q": "q"
    },
    {
        " in honor of his friend, Janet Quarton. Star Trek Creator – The Authorized Biography of Gene Roddenberry by David Alexander p. 536     Star Trek mediaStar Trek television episodes and novels have featured Q, and often have titles that play on the letter Q .        Star Trek: The Next Generation :   ": null
    },
    {
        "Encounter at Farpoint": "encounter at farpoint"
    },
    {
        "   Hide and Q": "hide and q"
    },
    {
        "   Q Who": "q who"
    },
    {
        "   Déjà Q": "déjà q"
    },
    {
        "   Qpid": "qpid"
    },
    {
        "   True Q": "true q"
    },
    {
        "   Tapestry": "tapestry"
    },
    {
        "   All Good Things...": "all good things..."
    },
    {
        "    Star Trek: Deep Space Nine :   ": null
    },
    {
        "Q-Less": "q-less"
    },
    {
        "    Star Trek: Voyager :   ": null
    },
    {
        "Death Wish": "death wish"
    },
    {
        "   The Q and the Grey": "the q and the grey"
    },
    {
        "   Q2": "q2"
    },
    {
        "    Novels": "novels"
    },
    {
        ", :    Q-in-Law  1    Q-Squared  1    I, Q  1    The Q Continuum   String Theory   Star Trek: Borg   Planet X  The Eternal Tide ": null
    },
    {
        "John de Lancie": "john de lancie"
    },
    {
        " and ": null
    },
    {
        "Leonard Nimoy": "leonard nimoy"
    },
    {
        " features Q as host of a trivia contest and unwanted": null
    },
    {
        "C-1701": "c-1701"
    },
    {
        "ar Tr": "ar tr"
    },
    {
        "having previously attacked Federation and Romulan outposts in the first-season episode, ": null
    },
    {
        "The Neutral Zone": "the neutral zone"
    },
    {
        " ar Trek: Enterpri": "ar trek: enterpri"
    },
    {
        "sacrificing his life so that a race attacking him will not destroy the Enterprise": null
    },
    {
        "ar Trek: The Next Generati": "ar trek: the next generati"
    },
    {
        "although whether Q actually appeared in this episode or was merely a ": null
    },
    {
        "hallucination": "hallucination"
    },
    {
        " Picard experienced during surgery is deliberately left ambiguous": null
    },
    {
        "ar Tr": "ar tr"
    },
    {
        "ar Trek: Voyag": "ar trek: voyag"
    },
    {
        "Suzie Plakson": "suzie plakson"
    },
    {
        "referred to in Star Trek novels as Lady Q": null
    },
    {
        "ar Trek: Voyag": "ar trek: voyag"
    },
    {
        "played by John de Lancies real-life son ": null
    },
    {
        "Keegan de Lancie": "keegan de lancie"
    },
    {
        ", and referred to in the novels as Little Q or q with it being all-but-explicitly stated that Q is actually Trelanes biological father, although the truth of this is kept an official secretalthough an injury of some sort prevents 0 travelling faster than light under his own power, even if he can still teleport short distancesthe being who impersonated ": null
    },
    {
        "God": "god"
    },
    {
        " in  Star Trek V: The Final Frontier the entity from ": null
    },
    {
        "Day of the Dove": "day of the dove"
    },
    {
        " which thrived on violent conflictalthough he swiftly gets over this hostility off-screenfilmmagazine": null
    }
]