[
    {
        "     The Qibla al-Qudsiyya is the name given to a small sect of the ": null
    },
    {
        "Jew": "jew"
    },
    {
        "s of ": null
    },
    {
        "Medina": "medina"
    },
    {
        " who converted to ": null
    },
    {
        "Islam": "islam"
    },
    {
        " in 42/42 When the ": null
    },
    {
        "qibla": "qibla"
    },
    {
        " was changed from ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        "  to ": null
    },
    {
        "Mecca": "mecca"
    },
    {
        ", these Jews protested and finally declined the change. They remained Muslims, but did not accept any of the verses in the ": null
    },
    {
        "Quran": "quran"
    },
    {
        " written after the date of the split. Little is known of the existence of these Islamic Jews afterwards.       The Quranic verses referring to the change of ": null
    },
    {
        "Qiblah": "qiblah"
    },
    {
        " are all within the second chapter,  Al-Baqarah  . One verse reads thus:  The fools among the people will say: What hath turned them from the Qibla to which they were used? Say: To God belong both east and West: He guideth whom He will to a Way that is straight.       It is conceivable that the sources mentioning the Qibla al-Qudsiyya like the Sirat un-Nabi could in fact be trying to fill in the gaps of Muhammads biography by taking Quranic verses and drawing implicit information from them. The verses in the chapter in question clearly indicate a group of people who dislike the change of direction from Jerusalem to Makkah. The commentary in the translation of Abdullah Y. Ali - which is the most widespread English translation of the Quran - indicate that this group in fact were the Arabs and not Jews:  The Qibla of Jerusalem might itself have seemed strange to the Arabs, and the change from it to the Kaba might have seemed strange after they had become used to the other. In reality one direction or another, or east or west, in itself did not matter, as God is in all places, and is independent of Time and Place.       The subsequent verse mentions the unwillingness of the People of the Book to follow the Qibla of Islam:  Even if thou wert to bring to the people of the Book all the Signs , they would not follow Thy Qibla; nor art thou going to follow their Qibla; nor indeed will they follow each others Qibla. If thou after the knowledge hath reached thee, Wert to follow their desires,-then wert thou Indeed in the wrong.      According to the commentary of the same scholar this does not refer to Jewish converts to Islam, rather the main corpus of the Jews, arguing that it refers to the traditions mentioned in the Bible:  His window being open in his chambers towards Jerusalem, he kneeled upon his knees three times a day, and prayed, and gave thanks before his God as he gave aforetime.      Thus rationalizing the criticism that the Quran would direct towards the main corpus of ": null
    },
    {
        "Jews": "jews"
    },
    {
        "  for not accepting the concept of Qibla, particularly that of Kaaba. Or in Quranic wording:  The people of the Book know this as they know their own sons; but some of them conceal the truth which they themselves know.      If this understanding of these verses is correct that would render the need for a specific group of Jewish converts which did not accept the new Qiblah of Kaaba to fill in the gap in story, if this is in fact what has been done.     cf.   ": null
    },
    {
        "Sirat un-Nabi": "sirat un-nabi"
    },
    {
        "   Jahiz": "jahiz"
    },
    {
        " - ": null
    },
    {
        "Kitab al-Bukhala": "kitab al-bukhala"
    },
    {
        "              ": null
    }
]