[
    {
        "      In ": null
    },
    {
        "Euclidean plane geometry": "euclidean geometry"
    },
    {
        ", a quadrilateral is a ": null
    },
    {
        "polygon": "polygon"
    },
    {
        " with four ": null
    },
    {
        "edges": "edge"
    },
    {
        " and four ": null
    },
    {
        "vertices": "vertex"
    },
    {
        " or corners. Sometimes, the term quadrangle is used, by analogy with ": null
    },
    {
        "triangle": "triangle"
    },
    {
        ", and sometimes tetragon for consistency with ": null
    },
    {
        "pentagon": "pentagon"
    },
    {
        " , ": null
    },
    {
        "hexagon": "hexagon"
    },
    {
        " and so on.     The word quadrilateral is derived from the Latin words quadri, a variant of four, and latus, meaning side .     Quadrilaterals are ": null
    },
    {
        "simple": "simple polygon"
    },
    {
        " or ": null
    },
    {
        "complex": "complex polygon"
    },
    {
        " , also called crossed. Simple quadrilaterals are either ": null
    },
    {
        "convex": "convex polygon"
    },
    {
        " or ": null
    },
    {
        "concave": "concave polygon"
    },
    {
        ".     The ": null
    },
    {
        "interior angles": "internal and external angle"
    },
    {
        " of a simple quadrilateral ABCD add up to 360 ": null
    },
    {
        "degrees of arc": "degrees of arc"
    },
    {
        ", that is   : \\angle A+\\angle B+\\angle C+\\angle D360^.     This is a special case of the n-gon interior angle sum formula  × 180°.     All non-self-crossing quadrilaterals ": null
    },
    {
        "tile the plane": "tessellation"
    },
    {
        " by repeated rotation around the midpoints of their edges.       Any quadrilateral that is not self-intersecting is a simple quadrilateral.             In a convex quadrilateral, all interior angles are less than 180° and the two diagonals both lie inside the quadrilateral.   Irregular quadrilateral  or trapezium : no sides are parallel.    ": null
    },
    {
        "Trapezium": "trapezoid"
    },
    {
        " or ": null
    },
    {
        "trapezoid": "trapezoid"
    },
    {
        " : at least one pair of opposite sides are ": null
    },
    {
        "parallel": "parallel"
    },
    {
        ". Trapezia and trapezoids include parallelograms.     ": null
    },
    {
        "Isosceles trapezium": "isosceles trapezium"
    },
    {
        " or ": null
    },
    {
        "isosceles trapezoid": "isosceles trapezoid"
    },
    {
        " : one pair of opposite sides are parallel and the base ": null
    },
    {
        "angles": "angle"
    },
    {
        "are equal in measure. Alternative definitions are a quadrilateral with an axis of symmetry bisecting one pair of opposite sides, or a trapezoid with diagonals of equal length.   ": null
    },
    {
        "Parallelogram": "parallelogram"
    },
    {
        ": a quadrilateral with two pairs of parallel sides. Equivalent conditions are that opposite sides are of equal length; that opposite angles are equal; or that the diagonals bisect each other. Parallelograms include rhombi and rhomboids . In other words, parallelograms include all rhombi and all rhomboids, and thus also include all rectangles.   ": null
    },
    {
        "Rhombus": "rhombus"
    },
    {
        " or rhomb: all four sides are of equal length. An equivalent condition is that the diagonals perpendicularly bisect each other. Informally: a pushed-over square .   ": null
    },
    {
        "Rhomboid": "rhomboid"
    },
    {
        ": a parallelogram in which adjacent sides are of unequal lengths and some angles are ": null
    },
    {
        "oblique": "angletypes of angles"
    },
    {
        " . Informally: a pushed-over oblong . Not all references agree, some define a rhomboid as a parallelogram that is not a rhombus.    ": null
    },
    {
        "Rectangle": "rectangle"
    },
    {
        ": all four angles are right angles. An equivalent condition is that the diagonals bisect each other and are equal in length. Rectangles include squares and oblongs. Informally: a box or oblong .   ": null
    },
    {
        "Square": "square"
    },
    {
        " : all four sides are of equal length , and all four angles are right angles. An equivalent condition is that opposite sides are parallel , that the diagonals perpendicularly bisect each other, and are of equal length. A quadrilateral is a square if and only if it is both a rhombus and a rectangle .   Oblong: a term sometimes used to denote a rectangle that has unequal adjacent sides .    ": null
    },
    {
        "Kite": "kite"
    },
    {
        ": two pairs of adjacent sides are of equal length. This implies that one diagonal divides the kite into ": null
    },
    {
        "congruent triangles": "congruent triangles"
    },
    {
        ", and so the angles between the two pairs of equal sides are equal in measure. It also implies that the diagonals are perpendicular. Kites include rhombi.    ": null
    },
    {
        "Tangential quadrilateral": "tangential quadrilateral"
    },
    {
        ": the four sides are tangents to an inscribed circle. A convex quadrilateral is tangential if and only if opposite sides have equal sums.   ": null
    },
    {
        "Tangential trapezoid": "tangential trapezoid"
    },
    {
        ": a trapezoid where the four sides are ": null
    },
    {
        "tangents": "tangent"
    },
    {
        "to an ": null
    },
    {
        "inscribed circle": "inscribed circle"
    },
    {
        ".   ": null
    },
    {
        "Cyclic quadrilateral": "cyclic quadrilateral"
    },
    {
        ": the four vertices lie on a ": null
    },
    {
        "circumscribed circle": "circumscribed circle"
    },
    {
        ". A convex quadrilateral is cyclic if and only if opposite angles sum to 180°.   ": null
    },
    {
        "Right kite": "right kite"
    },
    {
        ": a kite with two opposite right angles. It is a type of cyclic quadrilateral.   ": null
    },
    {
        "Harmonic quadrilateral": "harmonic quadrilateral"
    },
    {
        ": the products of the lengths of the opposing sides are equal. It is a type of cyclic quadrilateral.   ": null
    },
    {
        "Bicentric quadrilateral": "bicentric quadrilateral"
    },
    {
        ": it is both tangential and cyclic.   ": null
    },
    {
        "Orthodiagonal quadrilateral": "orthodiagonal quadrilateral"
    },
    {
        ": the diagonals cross at ": null
    },
    {
        "right angle": "right angle"
    },
    {
        "s.   ": null
    },
    {
        "Equidiagonal quadrilateral": "equidiagonal quadrilateral"
    },
    {
        ": the diagonals are of equal length.   ": null
    },
    {
        "Ex-tangential quadrilateral": "ex-tangential quadrilateral"
    },
    {
        ": the four extensions of the sides are tangent to an ": null
    },
    {
        "excircle": "excircle"
    },
    {
        ".   An equilic quadrilateral has two opposite equal sides that, when extended, meet at 60°.   A Watt quadrilateral is a quadrilateral with a pair of opposite sides of equal length.    A quadric quadrilateral is a convex quadrilateral whose four vertices all lie on the perimeter of a square.    A diametric quadrilateral is a cyclic quadrilateral having one of its sides as a diameter of the circumcircle.    A Hjelmslev quadrilateral is a quadrilateral with two right angles at opposite vertices.        In a concave quadrilateral, one interior angle is bigger than 180° and one of the two diagonals lies outside the quadrilateral.   A dart is a ": null
    },
    {
        "concave": "concave polygon"
    },
    {
        " quadrilateral with bilateral symmetry like a kite, but one interior angle is reflex. See ": null
    },
    {
        " kite": "kite"
    },
    {
        ".          A ": null
    },
    {
        "self-intersecting": "list of self-intersecting polygons"
    },
    {
        " quadrilateral is called variously a cross-quadrilateral, crossed quadrilateral,  butterfly quadrilateral or  bow-tie quadrilateral. In a crossed quadrilateral, the four interior angles on either side of the crossing  add up to 720°.      Crossed trapezoid or trapezium :  a crossed quadrilateral in which  one pair of nonadjacent sides is parallel   ": null
    },
    {
        "Antiparallelogram": "antiparallelogram"
    },
    {
        ": a crossed quadrilaterals in which  each pair of nonadjacent sides have equal lengths.   ": null
    },
    {
        "Crossed rectangle": "crossed rectangle"
    },
    {
        ": an antiparallelogram whose sides are two opposite sides and the two diagonals of a ": null
    },
    {
        "rectangle": "rectangle"
    },
    {
        ", hence having one pair of opposite sides parallel.   ": null
    },
    {
        "Crossed square": "squarecrossed square"
    },
    {
        ": a special case of a crossed rectangle where two of the sides intersect at right angles.       The two ": null
    },
    {
        "diagonals": "diagonal"
    },
    {
        "of a convex quadrilateral are the ": null
    },
    {
        "line segments": "line segment"
    },
    {
        "that connect opposite vertices.     The two bimedians of a convex quadrilateral are the line segments that connect the midpoints of opposite sides.  They intersect at the vertex centroid of the quadrilateral .     The four maltitudes of a convex quadrilateral are the perpendiculars to a side through the midpoint of the opposite side.        There are various general formulas for the ": null
    },
    {
        "area": "area"
    },
    {
        " K of a convex quadrilateral ABCD with sides .       The area can be expressed in trigonometric terms as   : K \\tfrac pq \\cdot \\sin \\theta,     where the lengths of the diagonals are p and q and the angle between them is θ. Harries, J. Area of a quadrilateral, Mathematical Gazette 86, July 2002, 310–311. In the case of an orthodiagonal quadrilateral , this formula reduces to K\\tfracpq since θ is 90°.     The area can be also expressed in terms of bimedians as   : K mn \\cdot \\sin \\varphi,   where the lengths of the bimedians are m and n and the angle between them is φ.     ": null
    },
    {
        "Bretschneiders formula": "bretschneiders formula"
    },
    {
        " R. A. Johnson, Advanced Euclidean Geometry, 2007, ": null
    },
    {
        "Dover Publ.": "dover publications"
    },
    {
        ", p. 82. expresses the area in terms of the sides and two opposite angles:   : \\begin   K & \\sqrt \\\\   & \\sqrt   \\end     where the sides in sequence are a, b, c, d, where s is the semiperimeter, and A and C are two opposite angles. This reduces to ": null
    },
    {
        "Brahmaguptas formula": "brahmaguptas formula"
    },
    {
        " for the area of a cyclic quadrilateral when .     Another area formula in terms of the sides and angles, with angle C being between sides b and c, and A being between sides a and d, is   : K \\tfracad \\cdot \\sin + \\tfracbc \\cdot \\sin.     In the case of a cyclic quadrilateral, the latter formula becomes K \\tfrac\\sin.     In a parallelogram, where both pairs of opposite sides and angles are equal, this formula reduces to Kab \\cdot \\sin.     Alternatively, we can write the area in terms of the sides and the intersection angle θ of the diagonals, so long as this angle is not 90°: Mitchell, Douglas W., The area of a quadrilateral, Mathematical Gazette 93, July 2009, 306–309.   : K \\frac \\cdot \\left| a^2 + c^2 - b^2 - d^2 \\right|.     In the case of a parallelogram, the latter formula becomes K \\tfrac|\\tan \\theta|\\cdot \\left| a^2 - b^2 \\right|.     Another area formula including the sides a, b, c, d is .   : K\\tfrac\\sqrt\\sin   where x is the distance between the midpoints of the diagonals and φ is the angle between the ": null
    },
    {
        "bimedian": "quadrilateralspecial line segments"
    },
    {
        "s.     The last trigonometric area formula including the sides a, b, c, d and the angle α between a and b is:    : K\\tfracab\\cdot\\sin+\\tfrac\\sqrt ,   which can also be used for the area of a concave quadrilateral  just changing the first sign + to - .       The following two formulas express the area in terms of the sides a, b, c, d, the ": null
    },
    {
        "semiperimeter": "semiperimeterquadrilaterals"
    },
    {
        " s, and the diagonals p, q:     : K \\sqrt, J. L. Coolidge, A historically interesting formula for the area of a quadrilateral , American Mathematical Monthly, 46 345–347.     : K \\tfrac \\sqrt.      The first reduces to Brahmaguptas formula in the cyclic quadrilateral case, since then pq ac + bd.     The area can also be expressed in terms of the bimedians m, n and the diagonals p, q:     : K\\tfrac\\sqrt, Archibald, R. C., The Area of a Quadrilateral , American Mathematical Monthly, 29 pp. 29–36.     : K\\tfrac\\sqrt. .      In fact, any three of the four values m, n, p, and q suffice for determination of the area, since in any quadrilateral the four values are related by p^2+q^22.  The corresponding expressions are: Josefsson, Martin ‘100.31 Heron-like formulas for quadrilaterals’, The Mathematical Gazette, 100 , pp. 505–508.     : K\\tfrac\\sqrt,   if the lengths of two bimedians and one diagonal are given, and     : K\\tfrac\\sqrt,   if the lengths of two diagonals and one bimedian are given.       The area of a quadrilateral ABCD can be calculated using ": null
    },
    {
        "vectors": "vector"
    },
    {
        ". Let vectors AC and BD form the diagonals from A to C and from B to D. The area of the quadrilateral is then   : K \\tfrac |\\mathbf\\times\\mathbf|,     which is half the magnitude of the ": null
    },
    {
        "cross product": "cross product"
    },
    {
        " of vectors AC and BD. In two-dimensional Euclidean space, expressing vector AC as a ": null
    },
    {
        "free vector in Cartesian space": "euclidean vectorin cartesian space"
    },
    {
        " equal to  and BD as , this can be rewritten as:   : K \\tfrac |x_1 y_2 - x_2 y_1|.         In the following table it is listed if the diagonals in some of the most basic quadrilaterals bisect each other, if their diagonals are perpendicular , and if their diagonals have equal length. Kahle, Jennifer, Geometry: Basic ideas, accessed 28 December 2012. The list applies to the most general cases, and excludes named subsets.         Note 1: The most general trapezoids and isosceles trapezoids do not have perpendicular diagonals, but there are infinite numbers of trapezoids and isosceles trapezoids that do have perpendicular diagonals and are not any other named quadrilateral.     Note 2: In a kite, one diagonal bisects the other. The most general kite has unequal diagonals, but there is an infinite number of kites in which the diagonals are equal in length .       The lengths of the diagonals in a convex quadrilateral ABCD can be calculated using the law of cosines on each triangle formed by one diagonal and two sides of the quadrilateral. Thus   : p\\sqrt\\sqrt     and   : q\\sqrt\\sqrt.     Other, more symmetric formulas for the lengths of the diagonals, are Rashid, M. A. & Ajibade, A. O., Two conditions for a quadrilateral to be cyclic expressed in terms of the lengths of its sides , Int. J. Math. Educ. Sci. Technol., vol. 34 no. 5, pp. 739–799.   : p\\sqrt     and   : q\\sqrt.       In any convex quadrilateral ABCD, the sum of the squares of the four sides is equal to the sum of the squares of the two diagonals plus four times the square of the line segment connecting the midpoints of the diagonals. Thus   : a^2 + b^2 + c^2 + d^2 p^2 + q^2 + 4x^2     where x is the distance between the midpoints of the diagonals. This is sometimes known as Eulers quadrilateral theorem and is a generalization of the parallelogram law .     The German mathematician Carl Anton Bretschneider derived in 1842 the following generalization of Ptolemys theorem , regarding the product of the diagonals in a convex quadrilateral Andreescu, Titu & Andrica, Dorian, Complex Numbers from A to...Z, Birkhäuser, 2006, pp. 207–209.   : p^2q^2a^2c^2+b^2d^2-2abcd\\cos.     This relation can be considered to be a law of cosines for a quadrilateral. In a cyclic quadrilateral , where A + C 180°, it reduces to pq ac + bd. Since cos  ≥ & minus;1, it also gives a proof of Ptolemys inequality.       If X and Y are the feet of the normals from B and D to the diagonal AC p in a convex quadrilateral ABCD with sides a AB, b BC, c CD, d DA, then   : XY\\frac.     In a convex quadrilateral ABCD with sides a AB, b BC, c CD, d DA, and where the diagonals intersect at E,   : efgh     where e AE, f BE, g CE, and h DE. .     The shape and size of a convex quadrilateral are fully determined by the lengths of its sides in sequence and of one diagonal between two specified vertices. The two diagonals p, q and the four side lengths a, b, c, d of a quadrilateral are related by the Cayley-Menger determinant , as follows:   : \\det \\begin   0 & a^2 & p^2 & d^2 & 1 \\\\   a^2 & 0 & b^2 & q^2 & 1 \\\\   p^2 & b^2 & 0 & c^2 & 1 \\\\   d^2 & q^2 & c^2 & 0 & 1 \\\\   1 & 1 & 1 & 1 & 0   \\end 0.       The internal angle bisector s of a convex quadrilateral either form a cyclic quadrilateral or they are concurrent . In the latter case the quadrilateral is a tangential quadrilateral .     In quadrilateral ABCD, if the angle bisectors of A and C meet on diagonal BD, then the angle bisectors of B and D meet on diagonal AC. Leversha, Gerry, A property of the diagonals of a cyclic quadrilateral , Mathematical Gazette": null
    }
]