[
    {
        "             In ": null
    },
    {
        "theoretical physics": "theoretical physics"
    },
    {
        ", quantum chromodynamics  is the theory of the ": null
    },
    {
        "strong interaction": "strong interaction"
    },
    {
        " between ": null
    },
    {
        "quarks": "quark"
    },
    {
        "and ": null
    },
    {
        "gluon": "gluon"
    },
    {
        "s, the fundamental particles that make up composite ": null
    },
    {
        "hadrons": "hadron"
    },
    {
        "such as the ": null
    },
    {
        "proton": "proton"
    },
    {
        ", ": null
    },
    {
        "neutron": "neutron"
    },
    {
        " and ": null
    },
    {
        "pion": "pion"
    },
    {
        ". QCD is a type of ": null
    },
    {
        "quantum field theory": "quantum field theory"
    },
    {
        " called a ": null
    },
    {
        "non-abelian gauge theory": "non-abelian gauge theory"
    },
    {
        ", with symmetry group ": null
    },
    {
        "SU": "special unitary group"
    },
    {
        ". The QCD analog of electric charge is a property called color. Gluons are the ": null
    },
    {
        "force carrier": "force carrier"
    },
    {
        " of the theory, like photons are for the electromagnetic force in ": null
    },
    {
        "quantum electrodynamics": "quantum electrodynamics"
    },
    {
        ". The theory is an important part of the ": null
    },
    {
        "Standard Model": "standard model"
    },
    {
        " of ": null
    },
    {
        "particle physics": "particle physics"
    },
    {
        ". A large body of ": null
    },
    {
        "experimental evidence for QCD": "quantum chromodynamicsexperimental tests"
    },
    {
        " has been gathered over the years.     QCD exhibits two main properties:   ": null
    },
    {
        "Color confinement": "color confinement"
    },
    {
        ". This is a consequence of the constant force between two color charges as they are separated: In order to increase the separation between two quarks within a hadron, ever-increasing amounts of energy are required. Eventually this energy becomes so great as to ": null
    },
    {
        "spontaneously produce": "mass–energy equivalence"
    },
    {
        " a quark–antiquark pair, turning the initial hadron into a pair of hadrons instead of producing an isolated color charge. Although analytically unproven, color confinement is well established from ": null
    },
    {
        "lattice QCD": "lattice qcd"
    },
    {
        " calculations and decades of experiments.      ": null
    },
    {
        "Asymptotic freedom": "asymptotic freedom"
    },
    {
        ", a steady reduction in the strength of interactions between quarks and gluons as the energy scale of those interactions increases . The asymptotic freedom of QCD was discovered in 1973 by ": null
    },
    {
        "David Gross": "david gross"
    },
    {
        " and ": null
    },
    {
        "Frank Wilczek": "frank wilczek"
    },
    {
        ",    and independently by ": null
    },
    {
        "David Politzer": "david politzer"
    },
    {
        " in the same year.    For this work all three shared the 2004 ": null
    },
    {
        "Nobel Prize in Physics": "nobel prize in physics"
    },
    {
        ".        Physicist ": null
    },
    {
        "Murray Gell-Mann": "murray gell-mann"
    },
    {
        " coined the word quark in its present sense. It originally comes from the phrase Three quarks for Muster Mark in  Finnegans Wake  by ": null
    },
    {
        "James Joyce": "james joyce"
    },
    {
        ". On June 27, 1978, Gell-Mann wrote a private letter to the editor of the Oxford English Dictionary, in which he related that he had been influenced by Joyces words: The allusion to three quarks seemed perfect.        The three kinds of ": null
    },
    {
        "charge": "charge"
    },
    {
        " in QCD  are usually referred to as ": null
    },
    {
        "color charge": "color charge"
    },
    {
        " by loose analogy to the three kinds of ": null
    },
    {
        "color": "color"
    },
    {
        " perceived by humans": "color vision"
    },
    {
        ". Other than this nomenclature, the quantum parameter color is completely unrelated to the everyday, familiar phenomenon of color.     The force between quarks is known as the colour force ": null
    },
    {
        "wikt:colour force": "wikt:colour force"
    },
    {
        "  or ": null
    },
    {
        "strong interaction": "strong interaction"
    },
    {
        ", and is responsible for the ": null
    },
    {
        "strong nuclear force": "strong nuclear force"
    },
    {
        ".     Since the theory of electric charge is dubbed ": null
    },
    {
        "electrodynamics": "electrodynamics"
    },
    {
        " , the ": null
    },
    {
        "Greek": "ancient greek"
    },
    {
        " word χρῶμα chroma color is applied to the theory of color charge, chromodynamics .          With the invention of ": null
    },
    {
        "bubble chambers": "bubble chamber"
    },
    {
        "and ": null
    },
    {
        "spark chambers": "spark chamber"
    },
    {
        "in the 1950s, experimental ": null
    },
    {
        "particle physics": "particle physics"
    },
    {
        " discovered a large and ever-growing number of particles called ": null
    },
    {
        "hadron": "hadron"
    },
    {
        "s. It seemed that such a large number of particles could not all be ": null
    },
    {
        "fundamental": "fundamental particles"
    },
    {
        ". First, the particles were classified by ": null
    },
    {
        "charge": "charge"
    },
    {
        " and ": null
    },
    {
        "isospin": "isospin"
    },
    {
        " by ": null
    },
    {
        "Eugene Wigner": "eugene wigner"
    },
    {
        " and ": null
    },
    {
        "Werner Heisenberg": "werner heisenberg"
    },
    {
        "; then, in 1953–56,          according to ": null
    },
    {
        "strangeness": "strangeness"
    },
    {
        " by ": null
    },
    {
        "Murray Gell-Mann": "murray gell-mann"
    },
    {
        " and ": null
    },
    {
        "Kazuhiko Nishijima": "kazuhiko nishijima"
    },
    {
        " . To gain greater insight, the hadrons were sorted into groups having similar properties and masses using the  eightfold way , invented in 1961 by Gell-Mann Gell-Mann, M. . The Eightfold Way: A Theory of strong interaction symmetry . California Inst. of Tech., Pasadena. Synchrotron Lab . and ": null
    },
    {
        "Yuval Neeman": "yuval neeman"
    },
    {
        ". Gell-Mann and ": null
    },
    {
        "George Zweig": "george zweig"
    },
    {
        ", correcting an earlier approach of ": null
    },
    {
        "Shoichi Sakata": "shoichi sakata"
    },
    {
        ", went on to propose in 1963 that the structure of the groups could be explained by the existence of three ": null
    },
    {
        "flavors": "flavour"
    },
    {
        "of smaller particles inside the hadrons: the ": null
    },
    {
        "quark": "quark"
    },
    {
        "s.     Perhaps the first remark that quarks should possess an additional quantum number was made    as a short footnote in the preprint of ": null
    },
    {
        "Boris Struminsky": "boris struminsky"
    },
    {
        " B. V. Struminsky, Magnetic moments of baryons in the quark model. ": null
    },
    {
        "JINR": "jinr"
    },
    {
        "-Preprint P-1939, Dubna, Russia. Submitted on January 7, 1965. in connection with the Ω − ": null
    },
    {
        "hyperon": "omega baryon"
    },
    {
        " being composed of three ": null
    },
    {
        "strange quarks": "strange quark"
    },
    {
        "with parallel spins :  Boris Struminsky was a PhD student of ": null
    },
    {
        "Nikolay Bogolyubov": "nikolay bogolyubov"
    },
    {
        ". The problem considered in this preprint was suggested by Nikolay Bogolyubov, who advised Boris Struminsky in this research. In the beginning of 1965, ": null
    },
    {
        "Nikolay Bogolyubov": "nikolay bogolyubov"
    },
    {
        ", ": null
    },
    {
        "Boris Struminsky": "boris struminsky"
    },
    {
        " and ": null
    },
    {
        "Albert Tavkhelidze": "albert tavkhelidze"
    },
    {
        " wrote a preprint with a more detailed discussion of the additional quark quantum degree of freedom. ": null
    },
    {
        "N. Bogolubov": "nikolay bogolyubov"
    },
    {
        ", B. Struminsky, A. Tavkhelidze. On composite models in the theory of elementary particles. ": null
    },
    {
        "JINR": "jinr"
    },
    {
        " Preprint D-1968, ": null
    },
    {
        "Dubna": "dubna"
    },
    {
        " 1965. This work was also presented by Albert Tavkhelidze without obtaining consent of his collaborators for doing so at an international conference in ": null
    },
    {
        "Trieste": "trieste"
    },
    {
        " , in May 1965. A. Tavkhelidze. Proc. Seminar on High Energy Physics and Elementary Particles, Trieste, 1965, Vienna IAEA, 1965, p. 763. V. A. Matveev and A. N. Tavkhelidze   . Report presented at the 99th Session of the JINR Scientific Council, Dubna, 19–20 January 2006.     A similar mysterious situation was with the ": null
    },
    {
        "Δ ++ baryon": "delta baryon"
    },
    {
        "; in the quark model, it is composed of three ": null
    },
    {
        "up quarks": "up quark"
    },
    {
        "with parallel spins. In 1964–65, ": null
    },
    {
        "Greenberg": "oscar w. greenberg"
    },
    {
        " O. W. Greenberg, Spin and Unitary Spin Independence in a Paraquark Model of Baryons and Mesons. Phys. Rev. Lett. 13, 598–602 . and ": null
    },
    {
        "Han": "moo-young han"
    },
    {
        "–": null
    },
    {
        "Nambu": "yoichiro nambu"
    },
    {
        " M. Y. Han and Y. Nambu, Three-Triplet Model with Double SU Symmetry. Phys. Rev. 139, B1006–B1010 independently resolved the problem by proposing that quarks possess an additional ": null
    },
    {
        "SU": "special unitary group"
    },
    {
        " gauge": "gauge theory"
    },
    {
        " degree of freedom": "degrees of freedom"
    },
    {
        ", later called color charge. Han and Nambu noted that quarks might interact via an octet of vector ": null
    },
    {
        "gauge boson": "gauge boson"
    },
    {
        "s: the ": null
    },
    {
        "gluon": "gluon"
    },
    {
        "s.     Since free quark searches consistently failed to turn up any evidence for the new particles, and because an elementary particle back then was defined as a particle which could be separated and isolated, Gell-Mann often said that quarks were merely convenient mathematical constructs, not real particles. The meaning of this statement was usually clear in context: He meant quarks are confined, but he also was implying that the strong interactions could probably not be fully described by quantum field theory.     ": null
    },
    {
        "Richard Feynman": "richard feynman"
    },
    {
        " argued that high energy experiments showed quarks are real particles: he called them  partons  . By particles, Feynman meant objects which travel along paths, elementary particles in a field theory.     The difference between Feynmans and Gell-Manns approaches reflected a deep split in the theoretical physics community. Feynman thought the quarks have a distribution of position or momentum, like any other particle, and he believed that the diffusion of parton momentum explained ": null
    },
    {
        "diffractive scattering": "pomeron"
    },
    {
        ". Although Gell-Mann believed that certain quark charges could be localized, he was open to the possibility that the quarks themselves could not be localized because space and time break down. This was the more radical approach of ": null
    },
    {
        "S-matrix theory": "s-matrix theory"
    },
    {
        ".     ": null
    },
    {
        "James Bjorken": "james daniel bjorken"
    },
    {
        " proposed that pointlike partons would imply certain relations in ": null
    },
    {
        "deep inelastic scattering": "deep inelastic scattering"
    },
    {
        " of ": null
    },
    {
        "electrons": "electron"
    },
    {
        "and protons, which were verified in experiments at ": null
    },
    {
        "SLAC": "slac"
    },
    {
        " in 1969. This led physicists to abandon the S-matrix approach for the strong interactions.     In 1973 the concept of ": null
    },
    {
        "color": "color charge"
    },
    {
        " as the source of a strong field was developed into the theory of QCD by physicists ": null
    },
    {
        "Harald Fritzsch": "harald fritzsch"
    },
    {
        " and ": null
    },
    {
        "Heinrich Leutwyler": "heinrich leutwyler"
    },
    {
        ", together with physicist Murray Gell-Mann.  In particular, they employed the general field theory developed in 1954 by ": null
    },
    {
        "Chen Ning Yang": "chen ning yang"
    },
    {
        " and ": null
    },
    {
        "Robert Mills": "robert mills"
    },
    {
        "  , in which the carrier particles of a force can themselves radiate further carrier particles.     The discovery of ": null
    },
    {
        "asymptotic freedom": "asymptotic freedom"
    },
    {
        " in the strong interactions by ": null
    },
    {
        "David Gross": "david gross"
    },
    {
        ", ": null
    },
    {
        "David Politzer": "david politzer"
    },
    {
        " and ": null
    },
    {
        "Frank Wilczek": "frank wilczek"
    },
    {
        " allowed physicists to make precise predictions of the results of many high energy experiments using the quantum field theory technique of ": null
    },
    {
        "perturbation theory": "perturbation theory"
    },
    {
        ". Evidence of gluons was discovered in ": null
    },
    {
        "three-jet events": "three-jet event"
    },
    {
        "at ": null
    },
    {
        "PETRA": "petra"
    },
    {
        " in 1979. These experiments became more and more precise, culminating in the verification of ": null
    },
    {
        "perturbative QCD": "perturbative qcd"
    },
    {
        " at the level of a few percent at the ": null
    },
    {
        "LEP": "lep"
    },
    {
        " in ": null
    },
    {
        "CERN": "cern"
    },
    {
        ".     The other side of asymptotic freedom is ": null
    },
    {
        "confinement": "color confinement"
    },
    {
        ". Since the force between color charges does not decrease with distance, it is believed that quarks and gluons can never be liberated from hadrons. This aspect of the theory is verified within ": null
    },
    {
        "lattice QCD": "lattice qcd"
    },
    {
        " computations, but is not mathematically proven. One of the ": null
    },
    {
        "Millennium Prize Problems": "millennium prize problems"
    },
    {
        " announced by the ": null
    },
    {
        "Clay Mathematics Institute": "clay mathematics institute"
    },
    {
        " requires a claimant to produce such a proof. Other aspects of ": null
    },
    {
        "non-perturbative": "non-perturbative"
    },
    {
        " QCD are the exploration of phases of ": null
    },
    {
        "quark matter": "qcd matter"
    },
    {
        ", including the ": null
    },
    {
        "quark–gluon plasma": "quark–gluon plasma"
    },
    {
        ".     The relation between the short-distance particle limit and the confining long-distance limit is one of the topics recently explored using ": null
    },
    {
        "string theory": "string theory"
    },
    {
        ", the modern form of S-matrix theory.                    Every field theory of ": null
    },
    {
        "particle physics": "particle physics"
    },
    {
        " is based on certain symmetries of nature whose existence is deduced from observations. These can be   ": null
    },
    {
        "local symmetries": "local symmetry"
    },
    {
        ", that are the symmetries that act independently at each point in ": null
    },
    {
        "spacetime": "spacetime"
    },
    {
        ". Each such symmetry is the basis of a ": null
    },
    {
        "gauge theory": "gauge theory"
    },
    {
        " and requires the introduction of its own ": null
    },
    {
        "gauge boson": "gauge boson"
    },
    {
        "s.   ": null
    },
    {
        "global symmetries": "global symmetry"
    },
    {
        ", which are symmetries whose operations must be simultaneously applied to all points of spacetime.     QCD is a non-abelian gauge theory  of the ": null
    },
    {
        "SU": "special unitary group"
    },
    {
        " gauge group obtained by taking the ": null
    },
    {
        "color charge": "color charge"
    },
    {
        " to define a local symmetry.     Since the strong interaction does not discriminate between different flavors of quark, QCD has approximate flavor symmetry, which is broken by the differing masses of the quarks.     There are additional global symmetries whose definitions require the notion of ": null
    },
    {
        "chirality": "chirality"
    },
    {
        ", discrimination between left and right-handed. If the ": null
    },
    {
        "spin": "spin"
    },
    {
        " of a particle has a positive ": null
    },
    {
        "projection": "projection"
    },
    {
        " on its direction of motion then it is called left-handed; otherwise, it is right-handed. Chirality and handedness are not the same, but become approximately equivalent at high energies.   Chiral symmetries involve independent transformations of these two types of particle.   Vector symmetries mean the same transformation is applied on the two chiralities.   Axial symmetries are those in which one transformation is applied on left-handed particles and the inverse on the right-handed particles.       As mentioned, asymptotic freedom means that at large energy – this corresponds also to short distances – there is practically no interaction between the particles. This is in contrast – more precisely one would say  dual – to what one is used to, since usually one connects the absence of interactions with large  distances. However, as already mentioned in the original paper of Franz Wegner, F. Wegner, Duality in Generalized Ising Models and Phase Transitions without Local Order Parameter, J. Math. Phys. 12 2259–2272.     : Reprinted in ": null
    },
    {
        "Claudio Rebbi": "claudio rebbi"
    },
    {
        " , Lattice Gauge Theories and Monte Carlo Simulations, World Scientific, Singapore , p. 60–73. Abstract:   a solid state theorist who introduced 1971 simple gauge invariant lattice models, the high-temperature behaviour of the original model, e.g. the strong decay of correlations at large distances, corresponds to the low-temperature behaviour of the dual model, namely the asymptotic decay of non-trivial correlations, e.g. short-range deviations from almost perfect arrangements, for short distances. Here, in contrast to Wegner, we have only the dual model, which is that one described in this article. Perhaps one can guess that in the original model mainly the quarks would fluctuate, whereas in the present one, the dual model, mainly the gluons do.       The color group SU corresponds to the local symmetry whose gauging gives rise to QCD. The electric charge labels a representation of the local symmetry group U which is gauged to give ": null
    },
    {
        "QED": "quantum electrodynamics"
    },
    {
        ": this is an ": null
    },
    {
        "abelian group": "abelian group"
    },
    {
        ". If one considers a version of QCD with N f  flavors of massless quarks, then there is a global  flavor symmetry group SU L  & times; SU R  & times; U B & times; U A . The chiral symmetry is ": null
    },
    {
        "spontaneously broken": "spontaneous symmetry breaking"
    },
    {
        " by the ": null
    },
    {
        "QCD vacuum": "qcd vacuum"
    },
    {
        " to the vector SU V  with the formation of a ": null
    },
    {
        "chiral condensate": "chiral condensate"
    },
    {
        ". The vector symmetry, U B corresponds to the baryon number of quarks and is an exact symmetry. The axial symmetry U A is exact in the classical theory, but broken in the quantum theory, an occurrence called an ": null
    },
    {
        "anomaly": "anomaly"
    },
    {
        ". Gluon field configurations called ": null
    },
    {
        "instantons": "instanton"
    },
    {
        "are closely related to this anomaly.     There are two different types of SU symmetry: there is the symmetry that acts on the different colors of quarks, and this is an exact gauge symmetry mediated by the gluons, and there is also a flavor symmetry which rotates different flavors of quarks to each other, or flavor SU. Flavor SU is an approximate symmetry of the vacuum of QCD, and is not a fundamental symmetry at all. It is an accidental consequence of the small mass of the three lightest quarks.     In the ": null
    },
    {
        "QCD vacuum": "qcd vacuum"
    },
    {
        " there are vacuum condensates of all the quarks whose mass is less than the QCD scale. This includes the up and down quarks, and to a lesser extent the strange quark, but not any of the others. The vacuum is symmetric under SU ": null
    },
    {
        "isospin": "isospin"
    },
    {
        " rotations of up and down, and to a lesser extent under rotations of up, down and strange, or full flavor group SU, and the observed particles make isospin and SU multiplets.     The approximate flavor symmetries do have associated gauge bosons, observed particles like the rho and the omega, but these particles are nothing like the gluons and they are not massless. They are emergent gauge bosons in an approximate ": null
    },
    {
        "string description of QCD": "ads/qcd"
    },
    {
        ".       The dynamics of the quarks and gluons are controlled by the quantum chromodynamics ": null
    },
    {
        "Lagrangian": "lagrangian"
    },
    {
        ". The ": null
    },
    {
        "gauge invariant": "gauge invariant"
    },
    {
        " QCD Lagrangian is          where \\psi_i \\, is the quark field, a dynamical function of spacetime, in the ": null
    },
    {
        "fundamental representation": "fundamental representation"
    },
    {
        " of the ": null
    },
    {
        "SU": "su"
    },
    {
        " gauge ": null
    },
    {
        "group": "group"
    },
    {
        ", indexed by i,\\,j,\\,\\ldots ; D_\\mu is the ": null
    },
    {
        "gauge covariant derivative": "gauge covariant derivative"
    },
    {
        "; the γ μ are ": null
    },
    {
        "Dirac matrices": "dirac matrices"
    },
    {
        " connecting the spinor representation to the vector representation of the ": null
    },
    {
        "Lorentz group": "lorentz group"
    },
    {
        ".     The symbol G^a_ \\, represents the gauge invariant ": null
    },
    {
        "gluon field strength tensor": "gluon field strength tensor"
    },
    {
        ", analogous to the ": null
    },
    {
        "electromagnetic field strength tensor": "electromagnetic tensor"
    },
    {
        ", F μν , in ": null
    },
    {
        "quantum electrodynamics": "quantum electrodynamics"
    },
    {
        ". It is given by:      : G^a_ \\partial_\\mu \\mathcal^a_\\nu - \\partial_\\nu \\mathcal^a_\\mu + g f^ \\mathcal^b_\\mu \\mathcal^c_\\nu \\,,     where \\mathcal^a_\\mu \\, are the ": null
    },
    {
        "gluon field": "gluon field"
    },
    {
        "s, dynamical functions of spacetime, in the ": null
    },
    {
        "adjoint representation": "adjoint representation"
    },
    {
        " of the SU gauge group, indexed by a, b,...; and f abc  are the ": null
    },
    {
        "structure constants": "structure constants"
    },
    {
        " of SU. Note that the rules to move-up or pull-down the a, b, or c indices are trivial, , so that f abc  f abc  f a bc whereas for the μ or ν indices one has the non-trivial relativistic rules corresponding to the ": null
    },
    {
        "metric signature": "metric signature"
    },
    {
        " .     The variables m and g correspond to the quark mass and coupling of the theory, respectively, which are subject to renormalization.     An important theoretical concept is the  Wilson loop  . In lattice QCD, the final term of the above Lagrangian is discretized via Wilson loops, and more generally the behavior of Wilson loops can distinguish ": null
    },
    {
        "confined": "color confinement"
    },
    {
        " and deconfined phases.            Quarks are massive spin- ": null
    },
    {
        "fermions": "fermion"
    },
    {
        "which carry a ": null
    },
    {
        "color charge": "color charge"
    },
    {
        " whose gauging is the content of QCD. Quarks are represented by ": null
    },
    {
        "Dirac fields": "dirac field"
    },
    {
        "in the ": null
    },
    {
        "fundamental representation": "fundamental representation"
    },
    {
        " 3 of the ": null
    },
    {
        "gauge group": "gauge group"
    },
    {
        " SU": "su"
    },
    {
        ". They also carry electric charge  and participate in ": null
    },
    {
        "weak interactions": "weak interactions"
    },
    {
        " as part of ": null
    },
    {
        "weak isospin": "weak isospin"
    },
    {
        " doublets. They carry global quantum numbers including the ": null
    },
    {
        "baryon number": "baryon number"
    },
    {
        ", which is  for each quark, ": null
    },
    {
        "hypercharge": "hypercharge"
    },
    {
        " and one of the ": null
    },
    {
        "flavor quantum numbers": "flavor"
    },
    {
        ".     Gluons are spin-1 ": null
    },
    {
        "bosons": "boson"
    },
    {
        "which also carry ": null
    },
    {
        "color charge": "color charge"
    },
    {
        "s, since they lie in the ": null
    },
    {
        "adjoint representation": "adjoint representation of a lie group"
    },
    {
        " 8 of SU. They have no electric charge, do not participate in the weak interactions, and have no flavor. They lie in the ": null
    },
    {
        "singlet representation": "singlet state"
    },
    {
        " 1 of all these symmetry groups.     Every quark has its own antiquark. The charge of each antiquark is exactly the opposite of the corresponding quark.       According to the rules of ": null
    },
    {
        "quantum field theory": "quantum field theory"
    },
    {
        ", and the associated ": null
    },
    {
        "Feynman diagram": "feynman diagram"
    },
    {
        "s, the above theory gives rise to three basic interactions: a quark may emit a gluon, a gluon may emit a gluon, and two gluons may directly interact. This contrasts with ": null
    },
    {
        "QED": "quantum electrodynamics"
    },
    {
        ", in which only the first kind of interaction occurs, since ": null
    },
    {
        "photons": "photon"
    },
    {
        "have no charge. Diagrams involving ": null
    },
    {
        "Faddeev–Popov ghosts": "faddeev–popov ghost"
    },
    {
        "must be considered too .       Detailed computations with the above-mentioned Lagrangian See all standard textbooks on the QCD, e.g., those noted above show that the effective potential between a quark and its anti-quark in a ": null
    },
    {
        "meson": "meson"
    },
    {
        " contains a term that increases in proportion to the distance between the quark and anti-quark , which represents some kind of stiffness of the interaction between the particle and its anti-particle at large distances, similar to the ": null
    },
    {
        "entropic elasticity": "entropic force"
    },
    {
        " of a ": null
    },
    {
        "rubber": "rubber"
    },
    {
        " band . This leads to confinement   Confinement gives way to a ": null
    },
    {
        "quark–gluon plasma": "quark–gluon plasma"
    },
    {
        " only at extremely large pressures and/or temperatures, e.g. for T \\approx 5\\cdot 10^    K or larger. of the quarks to the interior of hadrons, i.e. ": null
    },
    {
        "mesons": "meson"
    },
    {
        "and ": null
    },
    {
        "nucleon": "nucleon"
    },
    {
        "s, with typical radii R c , corresponding to former ": null
    },
    {
        "Bag models": "bag model"
    },
    {
        " of the hadrons ": null
    },
    {
        "Kenneth A. Johnson": "kenneth a. johnson"
    },
    {
        ". . The bag model of quark confinement. Scientific American. The order of magnitude of the bag radius is 1  fm . Moreover, the above-mentioned stiffness is quantitatively related to the so-called area law behaviour of the expectation value of the ": null
    },
    {
        "Wilson loop": "wilson loop"
    },
    {
        " product P W of the ordered coupling constants around a closed loop W; i.e. \\,\\langle P_W\\rangle is proportional to the area enclosed by the loop. For this behaviour the non-abelian behaviour of the gauge group is essential.       Further analysis of the content of the theory is complicated. Various techniques have been developed to work with QCD. Some of them are discussed briefly below.          This approach is based on asymptotic freedom, which allows ": null
    },
    {
        "perturbation theory": "perturbation theory"
    },
    {
        " to be used accurately in experiments performed at very high energies. Although limited in scope, this approach has resulted in the most precise tests of QCD to date.          called the latticee.g. nuclear matter or the interior of neutron stars23which expands around heavy quark mass near infinitywhich expands around large ratios of energy scalesChiral limit i.e. massless fermions": null
    },
    {
        "rticle physi": "rticle physi"
    },
    {
        " this includes the ": null
    },
    {
        "Drell-Yan process": "drell-yan process"
    },
    {
        " 1976i,k\\,s_i\\to s_i\\cdot\\epsilon_i\\quad\\,J_\\to \\epsilon_i J_\\epsilon_k\\,\\quad s_k\\to s_k\\cdot\\epsilon_k \\,\\mathcal Hi,ki,kquenchingannealingsee below1977i,kk,ln,mm,i3the spin glasses belong to themforce proportional to the length3where R c  is a characteristic correlation length for the glued loops, corresponding to the above-mentioned bag radius , while λ w is the wavelength of an excitationRPHD72004": null
    }
]