[
    {
        "             Quikscript  is an ": null
    },
    {
        "alphabet": "alphabet"
    },
    {
        "  specifically designed for the ": null
    },
    {
        "English language": "english language"
    },
    {
        ". Quikscript replaces traditional English orthography, which uses the ": null
    },
    {
        "Latin alphabet": "latin alphabet"
    },
    {
        ", with completely new letters. It is phonemically regular, compact, and designed to be comfortably and quickly written. There are also Quikscript alphabets adapted for other languages, using the same letters for sounds which do not exist in English.          ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        ", the writer, critic and playwright, was a highly vocal critic of English spelling because it lacked a coherent system for representing the phonemes of English accurately. As a result, for years he wrote his literary works using ": null
    },
    {
        "Pitman shorthand": "pitman shorthand"
    },
    {
        ". However, he found its limitations frustrating as well and realized that it was not a suitable replacement for the Latin alphabet, being difficult to use to produce printed material and impossible to type. A shorthand is, by definition, more specialized than an alphabet, which represents the standard written form of a language. Shaw desired and advocated a phonetic reworking of written English, and this called for a new alphabet.     To that end, Shaw placed in his will provisions instructing his executor to organize a world-wide competition to design an improved English alphabet. A British designer, ": null
    },
    {
        "Ronald Kingsley Read": "ronald kingsley read"
    },
    {
        ", who had corresponded extensively with Shaw for several years regarding just such an alphabet, was selected along with three other finalists as the winners of the competition. Read was chosen to design the final form of the alphabet. The Shaw Alphabet or ": null
    },
    {
        "Shavian": "shavian"
    },
    {
        " , as it is now generally known, was the result.     To provide field testing of the new alphabet, Read organized a lengthy public testing phase of Shavian by some 42 users from around the world who spoke different dialects of English. Once he had analyzed the results of those tests, Read decided to revise Shavian to incorporate a number of changes to improve the alphabet and make it both easier and faster to write. He called the revised alphabet Quikscript . In 42 he published the Quikscript manual which set out the alphabets rationale, and briefly discussed different possible methods of alphabet reform. The heart of the manual provided comprehensive instructions regarding the use of the alphabet along with reading samples.          Each Quikscript letter represents one, and only one, English phoneme. There are 42 consonants and 42 vowels, totaling in all 42 letters. The letters are also designed to be written easily and each of them only requires a single stroke of pen.     Just as in the Roman alphabet, there are short letters, a, c, e, m, and n, written between the base writing line and the upper parallel , tall letters, b, d, f, k, and t, which ascend above the top of the short letters, and deep letters, g, j, p and y, which descend below the base writing line. Quikscript, however, makes better use of these possibilities by using 42 tall, 42 deep, and 42 short letters. All vowels are short letters, just as they are in the Roman alphabet.   The most common phonemes have the simplest letter shapes.   Similar sounding phonemes have similar letter shapes. Examples:   Long vowels and glides are written with a larger bend or loop, while short vowels have a simpler shape.   Every voiced consonant is written with a deep letter similar in shape to the corresponding voiceless consonant which in turn is written with a tall letter.   While the Roman alphabet has two distinct forms in common use, which are designated as lower and upper case, this concept does not exist in the Quikscript alphabet. There is only one form for the majority of the letters. Names and proper nouns are preceded with a mid-line dot which is sufficient to distinguish them from ordinary words.   Beginners learn Junior Quikscript first. Each word is spelled as it is spoken . Each letter is written separately from the next so that it is equivalent to what is termed printing in the Roman alphabet. Some people may prefer Junior Quikscript for printed texts as readers are used to the Roman alphabet being printed in that manner.   Senior QuikScript introduces a number of advanced techniques which save time in writing. The most obvious difference between the two is that Senior encourages the connection of one letter to the next as long as the shapes of the letters are not altered. The design of the alphabet fosters these natural connections, as each Quikscript letter either begins or ends on the base line or the upper parallel. This structure permits letters to connect easily yet maintains the shapes of the individual letters because there are no connecting strokes between letters as there are in cursive Roman alphabet writing. It is common that Senior writing will have several letters in a row which are connected to each other, but when such a connection is not possible, the letters are simply left unconnected. Read added a very small number of alternative letter forms, which permit even more letters to connect easily. It is the writers choice whether to use them or not.   Senior Quikscript also introduces the concept of half-letters. Read recognized that the top half of several tall letters and the bottom half of several deep letters clearly distinguish those letters. Therefore, the portion of the vertical shafts of those letters which lie between the base line and upper parallel can be discarded without legibility being affected. Using half-letters increases the number of letters which can connect with each other. This produces several benefits: 42": null
    }
]