[
    {
        "               QWERTY  is a ": null
    },
    {
        "keyboard": "Keyboard Layout"
    },
    {
        " design for ": null
    },
    {
        "Latin-script alphabet": "Latin-Script Alphabet"
    },
    {
        "s. The name comes from the order of the first six ": null
    },
    {
        "keys": "Computer Keyboard Keyskey Types"
    },
    {
        " on the top left letter row of the keyboard . The QWERTY design is based on a layout created for the ": null
    },
    {
        "Sholes and Glidden typewriter": "Sholes And Glidden Typewriter"
    },
    {
        " and sold to ": null
    },
    {
        "E. Remington and Sons": "E. Remington And Sons"
    },
    {
        " in 1873. It became popular with the success of the Remington No. 2 of 1878, and remains in ubiquitous use.             The QWERTY layout was devised and created in the early 1870s by ": null
    },
    {
        "Christopher Latham Sholes": "Christopher Latham Sholes"
    },
    {
        ", a ": null
    },
    {
        "newspaper": "Newspaper"
    },
    {
        " editor and printer who lived in ": null
    },
    {
        "Kenosha": "Kenosha"
    },
    {
        ", ": null
    },
    {
        "Wisconsin": "Wisconsin"
    },
    {
        ". In October 1867, Sholes filed a patent application for his early writing machine he developed with the assistance of his friends ": null
    },
    {
        "Carlos Glidden": "Carlos Glidden"
    },
    {
        " and ": null
    },
    {
        "Samuel W. Soulé": "Samuel W. Soule"
    },
    {
        ".      The first model constructed by Sholes used a piano-like keyboard with two rows of characters arranged alphabetically as shown below:        The construction of the Type Writer had two flaws that made the product susceptible to jams.   Firstly, characters were mounted on metal arms or ": null
    },
    {
        "type bars": "Typebars"
    },
    {
        ", which would clash and jam if neighbouring arms were pressed at the same time or in rapid succession. Secondly, its printing point was located beneath the paper carriage, invisible to the operator, a so-called up-stroke design. Consequently, jams were especially serious, because the typist could only discover the mishap by raising the carriage to inspect what had been typed. The solution was to place commonly used letter-pairs so that their type bars were not neighbouring, avoiding jams.      Sholes struggled for the next five years to perfect his invention, making many trial-and-error rearrangements of the original machines alphabetical key arrangement. The study of ": null
    },
    {
        "bigram frequency": "Bigram Frequency"
    },
    {
        " by educator Amos Densmore, brother of the financial backer ": null
    },
    {
        "James Densmore": "James Densmore"
    },
    {
        ", is believed to have influenced the array of letters, but the contribution was later called into question. Koichi Yasuoka: , entry dated 1 August 2006. Others suggest instead that the letter groupings evolved from ": null
    },
    {
        "telegraph": "Telegraph"
    },
    {
        " operators feedback.      In November 1868 he changed the arrangement of the latter half of the alphabet, O to Z, right-to-left. Koichi and Motoko Yasuoka: Myth of QWERTY Keyboard, Tokyo: NTT Publishing, 2008.  In April 1870 he arrived at a four-row, upper case keyboard approaching the modern QWERTY standard, moving six vowel letters, A, E, I, O, U, and Y, to the upper row as follows: Koichi and Motoko Yasuoka: Myth of QWERTY Keyboard, Tokyo: NTT Publishing, 2008.       In 1873 Sholess backer, James Densmore, successfully sold the manufacturing rights for the Sholes & Glidden Type-Writer to ": null
    },
    {
        "E. Remington and Sons": "E. Remington And Sons"
    },
    {
        ". The keyboard layout was finalized within a few months by Remingtons mechanics and was ultimately presented: Koichi and Motoko Yasuoka: , ZINBUN, No.42, pp.161-174, 2011.      After they purchased the device, Remington made several adjustments, creating a keyboard with essentially the modern QWERTY layout. These adjustments included placing the R key in the place previously allotted to the period key. Apocryphal claims that this change was made to let salesmen impress customers by pecking out the brand name TYPE WRITER QUOTE from one keyboard row are not formally substantiated. Vestiges of the original alphabetical layout remained in the ": null
    },
    {
        "home row": "Home Row"
    },
    {
        " sequence DFGHJKL.      The modern layout is:      The QWERTY layout became popular with the success of the Remington No. 2 of 1878, the first typewriter to include both upper and lower case letters, using a ": null
    },
    {
        "shift key": "Shift Key"
    },
    {
        ".                The QWERTY layout depicted in Sholess 1878 patent is slightly different from the modern layout, most notably in the absence of the numerals 0 and 1, with each of the remaining numerals shifted one position to the left of their modern counterparts. The letter M is located at the end of the third row to the right of the letter L rather than on the fourth row to the right of the N, the letters X and C are reversed, and most ": null
    },
    {
        "punctuation marks": "Punctuation"
    },
    {
        " are in different positions or are missing entirely.  0 and 1 were omitted to simplify the design and reduce the manufacturing and maintenance costs; they were chosen specifically because they were redundant and could be recreated using other keys. Typists who learned on these machines learned the habit of using the uppercase letter ": null
    },
    {
        "I": "I"
    },
    {
        "  for the digit one, and the uppercase ": null
    },
    {
        "O": "O"
    },
    {
        " for the zero.           In early designs, some characters were produced by printing two symbols with the ": null
    },
    {
        "carriage": "Typewriter Carriage"
    },
    {
        " in the same position. For instance, the ": null
    },
    {
        "exclamation point": "Exclamation Mark"
    },
    {
        ", which shares a key with the numeral 1 on post-mechanical keyboards, could be reproduced by using a three-stroke combination of an apostrophe, a backspace, and a period. A semicolon was produced by printing a comma over a colon . As the backspace key is slow in simple mechanical typewriters , a more professional approach was to block the carriage by pressing and holding the space bar while printing all characters that needed to be in a shared position. To make this possible, the carriage was designed to advance forward only after releasing the space bar.     The 0 key was added and standardized in its modern position early in the history of the typewriter, but the 1 and exclamation point were left off some typewriter keyboards into the 1970s. See for example the , introduced in 1972     In the era of mechanical typewriters, combined characters such as é and õ were created by the use of ": null
    },
    {
        "dead keys": "Dead Key"
    },
    {
        "for the ": null
    },
    {
        "diacritics": "Diacritic"
    },
    {
        "  , which did not move the paper forward. Thus the ′ and e would be printed at the same location on the paper, creating é.       There were no particular technological requirements for the QWERTY layout, since at the time there were ways to make a typewriter without the up-stroke typebar mechanism that had required it to be devised. Not only were there rival machines with down-stroke and frontstroke positions that gave a visible printing point, the problem of typebar clashes could be circumvented completely: examples include ": null
    },
    {
        "Thomas Edisons": "Thomas Edison"
    },
    {
        "1872 electric print-wheel device which later became the basis for ": null
    },
    {
        "Teletype": "Teleprinter"
    },
    {
        " machines; ": null
    },
    {
        "Lucien Stephen Crandalls": "Lucien Stephen Crandall"
    },
    {
        "typewriter whose type was arranged on a cylindrical sleeve; the Hammond typewriter of 1887 which used a semi-circular type-shuttle of hardened rubber ; and the ": null
    },
    {
        "Blickensderfer typewriter": "Blickensderfer Typewriter"
    },
    {
        " of 1893 which used a type wheel. The early Blickensderfers Ideal keyboard was also non-QWERTY, instead having the sequence DHIATENSOR in the ": null
    },
    {
        "home row": "Home Row"
    },
    {
        ", these 10 letters being capable of composing 70% of the words in the English language.        Alternating hands while typing is a desirable trait in a keyboard design. While one hand types a letter, the other hand can prepare to type the next letter, making the process faster and more efficient. However, when a string of letters is typed with the same hand, the chances of stuttering are increased and a rhythm can be broken, thus decreasing speed and increasing errors and fatigue. In the QWERTY layout many more words can be spelled using only the left hand than the right hand. In fact, thousands of English words can be spelled using only the left hand, while only a couple of hundred words can be typed using only the right hand  . In addition, more typing strokes are done with the left hand in the QWERTY layout. This is helpful for left-": null
    },
    {
        "handed": "Handedness"
    },
    {
        " people but disadvantages right-handed people.     Contrary to popular belief, the QWERTY layout was not designed to slow the typist down, but rather to speed up typing by preventing jams. Indeed, there is evidence that, aside from the issue of jamming, placing often-used keys farther apart increases typing speed, because it encourages alternation between the hands.  There is another origin story in the Smithsonian that the QWERTY keyboard was made for telegraph operators and has this layout to make it easy for the telegraph operator to work.   Almost every word in the English language contains at least one vowel letter, but on the QWERTY keyboard only the vowel letter A is on the home row, which requires the typists fingers to leave the home row for most words.     A feature much less commented-on than the order of the keys is that the keys do not form a rectangular grid, but rather each column slants diagonally. This is because of the mechanical linkages – each key is attached to a lever, and hence the offset prevents the levers from running into each other – and has been retained in most electronic keyboards. Some keyboards, such as the ": null
    },
    {
        "Kinesis": "Kinesis"
    },
    {
        " or ": null
    },
    {
        "TypeMatrix": "Typematrix"
    },
    {
        ", retain the QWERTY layout but arrange the keys in vertical columns, to reduce unnecessary lateral finger motion.   – Vertical key layout      The words typewriter, proprietor, perpetuity, and repertoire are the longest English words that can be written using only the keys in the top row.            The first computer terminals such as the Teletype were typewriters that could produce and be controlled by various computer codes. These used the QWERTY layouts and added keys such as ": null
    },
    {
        "escape": "Esc Key"
    },
    {
        " which had special meanings to computers. Later keyboards added ": null
    },
    {
        "function keys": "Function Key"
    },
    {
        "and ": null
    },
    {
        "arrow keys": "Arrow Keys"
    },
    {
        ". Since the standardization of PC-compatible computers and Windows after the 1980s, most full-sized computer keyboards have followed this standard . This layout has a separate ": null
    },
    {
        "numeric keypad": "Numeric Keypad"
    },
    {
        " for data entry at the right, 12 function keys across the top, and a cursor section to the right and center with keys for ": null
    },
    {
        "Insert": "Insert Key"
    },
    {
        ", ": null
    },
    {
        "Delete": "Delete Key"
    },
    {
        ", ": null
    },
    {
        "Home": "Home Key"
    },
    {
        ", ": null
    },
    {
        "End": "End Key"
    },
    {
        ", ": null
    },
    {
        "Page Up, and Page Down": "Page Up And Page Down Keys"
    },
    {
        " with cursor arrows in an inverted-T shape.        Different computer operating systems have methods of support for input of different languages such as Chinese, Hebrew or Arabic. QWERTY was designed for ": null
    },
    {
        "English": "English Language"
    },
    {
        ", a language with accents appearing only in a few words of foreign origin. Thus, QWERTY ": null
    },
    {
        "keyboards": "Keyboard"
    },
    {
        " have no standard way of typing these ": null
    },
    {
        "diacritics": "Diacritic"
    },
    {
        " . The standard US keyboard for ": null
    },
    {
        "Microsoft Windows": "Microsoft Windows"
    },
    {
        " has no provision for it at all; the need was later met by the so called US-International keyboard layout, which uses ": null
    },
    {
        "dead keys": "Dead Key"
    },
    {
        " to type accents without having to add more keys. The same principle is used in the standard U.S. keyboard layout for ": null
    },
    {
        "MacOS": "Macos"
    },
    {
        ", but in a different way. Other layouts exist that try to overcome this shortcoming, including ": null
    },
    {
        "EurKEY": "Eurkey"
    },
    {
        " which is available for Windows, MacOS, and Linux.     Depending on the ": null
    },
    {
        "operating system": "Operating System"
    },
    {
        " and sometimes the ": null
    },
    {
        "application program": "Application Program"
    },
    {
        " being used, there are many ways to generate Latin characters with accents independently of the layout in use. Naturally, this can lead to confusion, when the imprints on the keys are different from what the software produces.              Minor changes to the arrangement are made for other languages. There are a large number of different keyboard layouts used for different languages written in Latin script. They can be divided into three main families according to where the , , , , and  keys are placed on the keyboard. These are usually named after the first six letters.     The following sections give general descriptions of QWERTY keyboard variants along with details specific to certain operating systems. The emphasis there is on Microsoft Windows.            English-speaking Canadians have traditionally used the same keyboard layout as in the United States, unless they are in a position where they have to write French on a regular basis. French-speaking Canadians respectively have favoured the Canadian French keyboard layout .                The Canadian Multilingual Standard keyboard layout is used by some Canadians. Though the ": null
    },
    {
        "caret": "Caret"
    },
    {
        " is missing, it is easily inserted by typing the circumflex accent followed by a space.             This keyboard layout is commonly used in Canada by ": null
    },
    {
        "French-speaking Canadians": "French Language In Canada"
    },
    {
        ". It is the most common layout for ": null
    },
    {
        "laptops": "Laptop"
    },
    {
        "and stand-alone keyboards targeting French speakers. Unlike the ": null
    },
    {
        "French layout": "Azerty"
    },
    {
        " used in France and Belgium, it is a true QWERTY layout and as such is also relatively commonly used by English speakers in the US and Canada for easy access to the accented letters found in some French ": null
    },
    {
        "loanword": "Loanword"
    },
    {
        "s. It can be used to type all accented French characters, as well as some from other languages, and serves all English functions as well. It is popular mainly because of its close similarity to the basic US keyboard commonly used by English-speaking Canadians and Americans, historical use of US-made typewriters by French-Canadians, and is the standard for keyboards in Quebec. It can also easily map to a standard English QWERTY keyboard with the sole loss the ": null
    },
    {
        "guillemet": "Guillemet"
    },
    {
        "/": null
    },
    {
        "degree sign": "Degree Sign"
    },
    {
        " key. Use of the European French layout in Quebec is practically unheard of.     In some variants, the key names are translated to French:    is  or  .    is .     is .               The typewriter came to the ": null
    },
    {
        "Czech": "Czech Language"
    },
    {
        "-speaking area in the late 19th century, when it was part of ": null
    },
    {
        "Austria-Hungary": "Austria-Hungary"
    },
    {
        " where German was the dominant language of administration. Therefore, Czech typewriters have the ": null
    },
    {
        "QWERTZ layout": "Qwertzczech"
    },
    {
        ".   However, with the introduction of imported computers, especially since the 1990s, the QWERTY keyboard layout is frequently used for computer keyboards. The Czech QWERTY layout differs from QWERTZ in that the characters missing from the Czech keyboard are accessible with AltGr on the same keys where they are located on an ": null
    },
    {
        "American keyboard": "United States"
    },
    {
        ". In Czech QWERTZ keyboards the positions of these characters accessed through AltGr differs.                 Both the Danish and ": null
    },
    {
        "Norwegian keyboards": "Norwegian"
    },
    {
        " include dedicated keys for the letters ": null
    },
    {
        "Å/å": "Å"
    },
    {
        ", ": null
    },
    {
        "Æ/æ": "Æ"
    },
    {
        " and ": null
    },
    {
        "Ø/ø": "Ø"
    },
    {
        ", but the placement is a little different, as the  and  keys are swapped on the Norwegian layout.                Though it is seldom used ,  the Dutch layout uses QWERTY but has additions for the € sign, the ": null
    },
    {
        "diaresis ": "Diaeresis"
    },
    {
        ", and the ": null
    },
    {
        "braces ": "Braces"
    },
    {
        " as well as different locations for other symbols. An older version contained a single-stroke key for the Dutch character ": null
    },
    {
        "IJ/ij": "Ij"
    },
    {
        ", which is usually typed by the combination of  and . In the 1990s, there was a version with the now-obsolete ": null
    },
    {
        "florin sign": "Florin Sign"
    },
    {
        " for IBM PCs. In ": null
    },
    {
        "Flanders": "Flemish Community"
    },
    {
        " , AZERTY keyboards are used instead, due to influence from the French-speaking part of Belgium.             The keyboard layout used in ": null
    },
    {
        "Estonia": "Estonia"
    },
    {
        " is virtually the same as the ": null
    },
    {
        "Swedish layout": "Swedish"
    },
    {
        ". The main difference is that the  and  keys  are replaced with  and  respectively . Some special symbols and ": null
    },
    {
        "dead keys": "Dead Keys"
    },
    {
        " are also moved around.             The same as the Danish layout with added  , since the ": null
    },
    {
        "Faroe Islands": "Faroe Islands"
    },
    {
        " are a self-governed part of the ": null
    },
    {
        "Kingdom of Denmark": "Kingdom Of Denmark"
    },
    {
        ".             The visual layout used in ": null
    },
    {
        "Finland": "Finland"
    },
    {
        " is basically the same as the ": null
    },
    {
        "Swedish layout": "Swedish"
    },
    {
        ". This is practical, as ": null
    },
    {
        "Finnish": "Finnish Language"
    },
    {
        " and ": null
    },
    {
        "Swedish": "Swedish Language"
    },
    {
        " share the special characters ": null
    },
    {
        "Ä/ä": "Ä"
    },
    {
        " and ": null
    },
    {
        "Ö/ö": "Ö"
    },
    {
        ", and while the Swedish ": null
    },
    {
        "Å/å": "Å"
    },
    {
        " is unnecessary for writing Finnish, it is needed by ": null
    },
    {
        "Swedish-speaking Finns": "Swedish-Speaking Finns"
    },
    {
        " and to write Swedish family names which are common.     As of 2008, there is a new standard for the Finnish multilingual keyboard layout, developed as part of a ": null
    },
    {
        "localization": "Internationalization And Localization"
    },
    {
        " project by ": null
    },
    {
        "CSC": "Csc - It Center For Science Ltd."
    },
    {
        ". All the engravings of the traditional Finnish–Swedish visual layout have been retained, so there is no need to change the hardware, but the functionality has been extended considerably, as additional characters  are available through the  key, as well as ": null
    },
    {
        "dead key": "Dead Key"
    },
    {
        "s, which allow typing a wide variety of letters with ": null
    },
    {
        "diacritics": "Diacritic"
    },
    {
        " . . Finnish-Swedish multilingual keyboard setting.      Based on the ": null
    },
    {
        "Latin": "Latin Script"
    },
    {
        " letter repertory included in the Multilingual European Subset No. 2  of the Unicode standard, the layout has three main objectives. First, it provides for easy entering of text in both Finnish and Swedish, the two official ": null
    },
    {
        "languages of Finland": "Languages Of Finland"
    },
    {
        ", using the familiar keyboard layout but adding some advanced punctuation options, such as ": null
    },
    {
        "dash": "Dash"
    },
    {
        "es, typographical ": null
    },
    {
        "quotation marks": "Quotation Mark, Non-English Usage"
    },
    {
        ", and the ": null
    },
    {
        "non-breaking space": "Non-Breaking Space"
    },
    {
        " .     Second, it is designed to offer an indirect but intuitive way to enter the special letters and diacritics needed by the other three ": null
    },
    {
        "Nordic": "Nordic Countries"
    },
    {
        " national languages  as well as the regional and minority languages .     As a third objective, it allows for relatively easy entering of particularly names in a variety of European languages using a more or less extended Latin alphabet, such as the official ": null
    },
    {
        "languages of the European Union": "Languages Of The European Union"
    },
    {
        " . Some letters, like ": null
    },
    {
        "Ł/ł": "Ł"
    },
    {
        " needed for Slavic languages, are accessed by a special overstrike key combination acting like a dead key.    However, the ": null
    },
    {
        "Romanian": "Romanian Language"
    },
    {
        " letters ": null
    },
    {
        "Ș/ș": "Ș"
    },
    {
        " and ": null
    },
    {
        "Ț/ț": "Ț"
    },
    {
        "  are not supported; the presumption is that ": null
    },
    {
        "Ş/ş": "Ş"
    },
    {
        " and ": null
    },
    {
        "Ţ/ţ": "Ţ"
    },
    {
        "  suffice as surrogates.                         Germany, Austria, Switzerland, Liechtenstein, and Luxembourg use ": null
    },
    {
        "QWERTZ": "Qwertz"
    },
    {
        " layouts, where the letter Z is to the right of T.               The Icelandic keyboard layout is different from the standard QWERTY keyboard because the Icelandic alphabet has some special letters, most of which it shares with the other Nordic countries:   Þ/þ, Ð/ð, Æ/æ, and Ö/ö. .     The letters Á/á, Ý/ý, Ú/ú, Í/í, and É/é are produced by first pressing the  ": null
    },
    {
        "dead key": "Dead Key"
    },
    {
        " and then the corresponding letter. The Nordic letters Å/å and Ä/ä can be produced by first pressing , located below the  key, and  which also works for the non-Nordic ÿ, Ü/ü, Ï/ï, and Ë/ë. These letters are not used natively in Icelandic, but may have been implemented for ease of communication in other Nordic languages. Additional diacritics may be found behind the  key:  for ˋ and  for ˆ .               ": null
    },
    {
        "Microsoft Windows": "Microsoft Windows"
    },
    {
        " includes an Irish layout which supports acute accents with  for the ": null
    },
    {
        "Irish language": "Irish Language"
    },
    {
        " and grave accents with the  ": null
    },
    {
        "dead key": "Dead Key"
    },
    {
        " for ": null
    },
    {
        "Scottish Gaelic": "Scottish Gaelic"
    },
    {
        ". The other ": null
    },
    {
        "Insular Celtic languages": "Insular Celtic Languages"
    },
    {
        " have their own layout.   The UK or UK-Extended layout is also frequently used.           ++, and ++; Windows might not recognise these keybindingsE followed by an ": null
    },
    {
        "apostrophe": "Apostrophe"
    },
    {
        "in this case  + in this case  + āčēģīķļņšūž, sometimes ō and ŗWindows default for Latvian layoutUTF-8together with à À; è È; ì Ì; ò Ò; ù Ù": null
    },
    {
        "backslash": "Backslash"
    },
    {
        "also known as Lapp": null
    },
    {
        "ERTZ PN-": "Ertz Pn-"
    },
    {
        "with diacritical marksofficially approved as Typists keyboard , , Polish Standard PN-87except custom-made, e.g., in public sector and some Apple computersthese usually work only with the left Alt Shift+with diacritical marksShift+": null
    },
    {
        "az": "Az"
    },
    {
        "alphanumeric portionnumeric portion": null
    },
    {
        "Unicode": "Unicode"
    },
    {
        " 0x20A2the common abbreviation in the eighties and nineties used to be Cr$Unicode U+00A7MS Windows treats both variants as the same layoutcompared to the American standard of 10 and the international of 11/?°": null
    },
    {
        "rtug": "Rtug"
    },
    {
        "Unicode": "Unicode"
    },
    {
        " 0x20ACU+0218, S with commaU+015E, S with cedillaU+0219, s with commaU+015F, s with cedillaU+021A, T with commaU+0162, T with cedillaU+021B, t with commaU+0163, t with cedillathey came to be used due to a historic bug@$": null
    },
    {
        "ER": "Er"
    },
    {
        "acrit": "Acrit"
    },
    {
        "¿, ¡º, ª": null
    },
    {
        "nguisti": "Nguisti"
    },
    {
        " / , used in l·l, n·h, s·h; located at Shift-3used in French and Portuguese among othersused in both Spanish and Portuguesehistorically, general support for these two has been poor – they arent present in the ": null
    },
    {
        "ISO 8859-1": "Iso 8859-1"
    },
    {
        " character encoding standard, or any other ": null
    },
    {
        "ISO/IEC 8859": "Iso/Iec 8859"
    },
    {
        " standardsee the ": null
    },
    {
        "Other original layouts and layout design software": "Keyboard Layoutother Original Layouts And Layout Design Software"
    },
    {
        " section for more informationInsInsSuprDelRe PágPgUpAv PágPgDnImpr Pant/PetSisPrtScn/SysRqBloq MayúsBloq NumBloq DesplPausa/Inter   R1999": null
    },
    {
        "acrit": "Acrit"
    }
]