[
    {
        "        Richard Bedford Bennett, 1st Viscount Bennett,  was a Canadian lawyer, businessman and politician. He served as the 11th ": null
    },
    {
        "prime minister of Canada": "Prime Minister Of Canada"
    },
    {
        ", in office from 1930 to 1935. He led the ": null
    },
    {
        "Conservative Party": "Conservative Party Of Canada"
    },
    {
        " from 1927 to 1938.     Bennetts prime ministership is widely regarded as a failure by historians, although he left lasting legacies in the form of the ": null
    },
    {
        "Canadian Broadcasting Corporation": "Canadian Broadcasting Corporation"
    },
    {
        " and the ": null
    },
    {
        "Bank of Canada": "Bank Of Canada"
    },
    {
        " .     Bennett was born in ": null
    },
    {
        "Hopewell Hill, New Brunswick": "Hopewell Hill, New Brunswick"
    },
    {
        ", and grew up in nearby ": null
    },
    {
        "Hopewell Cape": "Hopewell Cape"
    },
    {
        ". He studied law at ": null
    },
    {
        "Dalhousie University": "Dalhousie University"
    },
    {
        ", graduating in 1893, and in 1897 moved to ": null
    },
    {
        "Calgary": "Calgary"
    },
    {
        " to establish a law firm in partnership with ": null
    },
    {
        "James Lougheed": "James Alexander Lougheed"
    },
    {
        ".     Bennett served in the ": null
    },
    {
        "Legislative Assembly of the Northwest Territories": "Legislative Assembly Of The Northwest Territories"
    },
    {
        " from 1898 to 1905, and later in the ": null
    },
    {
        "Alberta Legislature": "Alberta Legislature"
    },
    {
        " from 1909 to 1911. He was the inaugural leader of the ": null
    },
    {
        "Alberta Conservative Party": "Alberta Conservative Party"
    },
    {
        " from 1905, resigning upon his election to the ": null
    },
    {
        "House of Commons": "House Of Commons Of Canada"
    },
    {
        " in 1911. From 1920 to 1921, Bennett was ": null
    },
    {
        "Minister of Justice": "Minister Of Justice"
    },
    {
        " under ": null
    },
    {
        "Arthur Meighen": "Arthur Meighen"
    },
    {
        ". He also served briefly as ": null
    },
    {
        "Minister of Finance": "Minister Of Finance"
    },
    {
        " in Meighens second government in 1926, which lasted just a month. Meighen resigned the Conservative Partys leadership after its defeat at the ": null
    },
    {
        "1926 election": "1926 Canadian Federal Election"
    },
    {
        ", with Bennett elected as his replacement .     Bennett became prime minister after the ": null
    },
    {
        "1930 election": "1930 Canadian Federal Election"
    },
    {
        ", where the Conservatives won a landslide victory over ": null
    },
    {
        "Mackenzie Kings": "William Lyon Mackenzie King"
    },
    {
        " Liberal Party": "Liberal Party Of Canada"
    },
    {
        ". He was the first prime minister to represent a constituency in Alberta. The main difficulty during Bennetts prime ministership was the ": null
    },
    {
        "Great Depression": "Great Depression In Canada"
    },
    {
        ". He and his party initially tried to combat the crisis with  laissez-faire  policies, but these were largely ineffective. However, over time Bennetts government became increasingly interventionist, attempting to replicate the popular ": null
    },
    {
        "New Deal": "New Deal"
    },
    {
        " enacted by ": null
    },
    {
        "Franklin Roosevelt": "Franklin Roosevelt"
    },
    {
        " to the south. This about-face prompted a split within Conservative ranks, and was regarded by the general public as evidence of incompetence.     Bennett suffered a landslide defeat at the ": null
    },
    {
        "1935 election": "1935 Canadian Federal Election"
    },
    {
        ", with Mackenzie King returning for a third term. Bennett remained leader of the Conservative Party until 1938, when he retired to England.     He was created Viscount Bennett, the only Canadian prime minister to be honoured with elevation to the ": null
    },
    {
        "peerage": "Peerage Of The United Kingdom"
    },
    {
        ".       Bennett was born on 3 July 1870, when his mother, Henrietta Stiles, was visiting at her parents home in ": null
    },
    {
        "Hopewell Hill, New Brunswick": "Hopewell Hill, New Brunswick"
    },
    {
        ", Canada. He was the eldest of six children, and grew up nearby at the ": null
    },
    {
        "Bay of Fundy": "Bay Of Fundy"
    },
    {
        " home of his father, Henry John Bennett, in ": null
    },
    {
        "Hopewell Cape": "Hopewell Cape"
    },
    {
        ", the ": null
    },
    {
        "shire town": "Shire Town"
    },
    {
        " of ": null
    },
    {
        "Albert County": "Albert County"
    },
    {
        ", then a town of 1,800 people.     His father descended from English ancestors who had emigrated to ": null
    },
    {
        "Connecticut": "Connecticut"
    },
    {
        " in the 17th century.  His great-great-grandfather, Zadock Bennett, migrated from ": null
    },
    {
        "New London, Connecticut": "New London, Connecticut"
    },
    {
        ", to ": null
    },
    {
        "Nova Scotia": "Nova Scotia"
    },
    {
        " c. 1760, before the ": null
    },
    {
        "American Revolution": "American Revolution"
    },
    {
        ", as one of the ": null
    },
    {
        "New England Planters": "New England Planters"
    },
    {
        " who took the lands forcibly removed from the deported ": null
    },
    {
        "Acadians": "Acadian"
    },
    {
        "during the ": null
    },
    {
        "Great Upheaval": "Great Upheaval"
    },
    {
        ".     R. B. Bennetts family was poor, subsisting mainly on the produce of a small farm. His early days inculcated a lifelong habit of thrift. The driving force in his family was his mother. She was a Wesleyan ": null
    },
    {
        "Methodist": "Methodist"
    },
    {
        " and passed this faith and the ": null
    },
    {
        "Protestant ethic": "Protestant Ethic"
    },
    {
        " on to her son. Bennetts father does not appear to have been a good provider for his family, though the reason is unclear. He operated a general store for a while and tried to develop some ": null
    },
    {
        "gypsum": "Gypsum"
    },
    {
        " deposits.     The Bennetts had previously been a relatively prosperous family, operating a shipyard in Hopewell Cape, but the change to steam-powered vessels in the mid-19th century meant the gradual winding down of their business. However, the household was a literate one, subscribing to three newspapers. They were strong ": null
    },
    {
        "Conservatives": "Conservatism"
    },
    {
        "; indeed one of the largest and last ships launched by the Bennett shipyard was the Sir John A. Macdonald .     Educated in the local school, Bennett was a very good student, but something of a loner. In addition to his ": null
    },
    {
        "Protestant": "Protestant"
    },
    {
        " faith, Bennett grew up with an abiding love of the ": null
    },
    {
        "British Empire": "British Empire"
    },
    {
        ", then at its apogee. A small legacy his mother received opened the doors for him to attend the ": null
    },
    {
        "Normal school": "Normal School"
    },
    {
        " in ": null
    },
    {
        "Fredericton": "Fredericton"
    },
    {
        ", where he trained to be a teacher; he then taught for several years at Irishtown, north of ": null
    },
    {
        "Moncton": "Moncton"
    },
    {
        ", saving his money for law school. Canadas Prime Ministers: Macdonald to Trudeau , edited by Ramsay Cook and Real Belanger, University of Toronto Press, 2007, p. 300,        One day, while Bennett was crossing the ": null
    },
    {
        "Miramichi River": "Miramichi River"
    },
    {
        " on the ferry boat, a well-dressed lad about nine years younger came over to him and struck up a conversation. This was the beginning of an improbable but important friendship with ": null
    },
    {
        "Max Aitken": "Max Aitken"
    },
    {
        ", later the ": null
    },
    {
        "industrialist": "Industrialist"
    },
    {
        " and British press baron, ": null
    },
    {
        "Lord Beaverbrook": "Lord Beaverbrook"
    },
    {
        ". The agnostic Aitken liked to tease the Methodist Bennett, whose fiery temper contrasted with Aitkens ability to turn away wrath with a joke. This friendship would become important to his success later in life, as would his friendship with the ": null
    },
    {
        "Chatham": "Chatham, New Brunswick"
    },
    {
        " lawyer, ": null
    },
    {
        "Lemuel J. Tweedie": "Lemuel J. Tweedie"
    },
    {
        ", a prominent Conservative politician. He began to study ": null
    },
    {
        "law": "Law"
    },
    {
        " with Tweedie on weekends and during summer holidays. Another important friendship was with the prominent Shirreff family of Chatham, the father being ": null
    },
    {
        "High Sheriff": "High Sheriff"
    },
    {
        " of ": null
    },
    {
        "Northumberland County": "Northumberland County, New Brunswick"
    },
    {
        " for 25 years. The son, Harry, joined the ": null
    },
    {
        "E. B. Eddy Company": "E. B. Eddy Company"
    },
    {
        ", a large ": null
    },
    {
        "pulp and paper": "Pulp And Paper"
    },
    {
        " industrial concern, and was transferred to ": null
    },
    {
        "Halifax": "City Of Halifax"
    },
    {
        ". His sister moved there to study nursing, and soon Bennett joined them to study law at ": null
    },
    {
        "Dalhousie University": "Dalhousie University"
    },
    {
        ". Their friendship was renewed there, and became crucial to his later life when Jennie Shirreff married the head of the Eddy Company. She later made Bennett the lawyer for her extensive interests.       Bennett started at ": null
    },
    {
        "Dalhousie University": "Dalhousie University"
    },
    {
        " in 1890, graduating in 1893 with a law degree and very high standing. He worked his way through with a job as assistant in the library, being recommended by the Dean, Dr. ": null
    },
    {
        "Richard Chapman Weldon": "Richard Chapman Weldon"
    },
    {
        ", MP, and participated in debating and moot court activities. Canadas Prime Ministers: Macdonald to Trudeau , 2007, p. 301     He was then a partner in the Chatham law firm of Tweedie and Bennett. Max Aitken  was his office boy, while ": null
    },
    {
        "articling": "Articling"
    },
    {
        " as a lawyer, acting as a stringer for the ": null
    },
    {
        "Montreal Gazette": "Montreal Gazette"
    },
    {
        ", and selling life insurance. Aitken persuaded him to run for ": null
    },
    {
        "alderman": "Alderman"
    },
    {
        " in the first Town Council of Chatham, and managed his campaign. Bennett was elected by one vote, and was later furious with Aitken when he heard all the promises he had made on Bennetts behalf.       Despite his election to the Chatham town council, Bennetts days in the town were numbered. He was ambitious and saw that the small community was too narrow a field for him. He was already negotiating with Sir ": null
    },
    {
        "James Lougheed": "James Lougheed"
    },
    {
        " to move to the ": null
    },
    {
        "North-West Territories": "Northwest Territories"
    },
    {
        " and become his law partner in ": null
    },
    {
        "Calgary": "Calgary"
    },
    {
        ", on Weldons recommendation. Lougheed was Calgarys richest man and most successful lawyer.        Bennett moved to Calgary in 1897. A lifelong bachelor and ": null
    },
    {
        "teetotaler": "Teetotaler"
    },
    {
        " , he led a rather lonely life in a hotel and later, in a boarding house. For a while a younger brother roomed with him. He ate his noon meal on workdays at the Alberta Hotel. Social life, such as it was, centred on church. There was, however, no scandal attached to his personal life. Bennett worked hard and gradually built up his legal practice. In 1908 he was one of five people appointed to the first Library Board for the city of Calgary and was instrumental in establishing the ": null
    },
    {
        "Calgary Public Library": "Calgary Public Library"
    },
    {
        ". E. Gorosh, Calgarys Temple of Knowledge : A History of the Public Library. 1975 Century Calgary Publications. p.5.     In 1910, Bennett became a director of Calgary Power Ltd.  and just a year later he became President. During his leadership projects completed included the first storage reservoir at Lake Minnewanka, a second transmission line to Calgary and the construction of the ": null
    },
    {
        "Kananaskis Falls": "Kananaskis River"
    },
    {
        " hydro station. At that time, he was also director of Rocky Mountains Cement Company and Security Trust.      Bennett developed an extensive legal practice in Calgary. In 1922, he started the partnership Bennett, Hannah & Sanford, which would eventually become ": null
    },
    {
        "Bennett Jones LLP": "Bennett Jones Llp"
    },
    {
        ".  In 1929-30, he served as national President of the ": null
    },
    {
        "Canadian Bar Association": "Canadian Bar Association"
    },
    {
        ".  His successor in that office was ": null
    },
    {
        "Louis St. Laurent": "Louis St. Laurent"
    },
    {
        ", another future Prime Minister.          He was elected to the ": null
    },
    {
        "Legislative Assembly of the North-West Territories": "Legislative Assembly Of The North-West Territories"
    },
    {
        " in the ": null
    },
    {
        "1898 general election": "1898 Northwest Territories General Election"
    },
    {
        ", representing the riding of ": null
    },
    {
        "West Calgary": "West Calgary"
    },
    {
        ". He was re-elected to a second term in office in 1902 as an Independent in the North-West Territories legislature.     In 1905, when ": null
    },
    {
        "Alberta": "Alberta"
    },
    {
        " was carved out of the Territories and made a ": null
    },
    {
        "province": "Canadian Province"
    },
    {
        ", Bennett became the first leader of the ": null
    },
    {
        "Alberta Conservative Party": "Alberta Progressive Conservatives"
    },
    {
        ". In 1909, he won a seat in the provincial ": null
    },
    {
        "legislature": "Legislature"
    },
    {
        ", before resigning and switching to federal politics. He was elected to the ": null
    },
    {
        "House of Commons of Canada": "House Of Commons Of Canada"
    },
    {
        " in ": null
    },
    {
        "1911": "1911 Canadian Federal Election"
    },
    {
        ".     At age 44, he tried to enlist in the Canadian military once ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " broke out, but was turned down as being medically unfit. In 1916, Bennett was appointed director general of the ": null
    },
    {
        "National service": "National Service"
    },
    {
        " Board, which was in charge of identifying the number of potential recruits in the country.     While Bennett supported the ": null
    },
    {
        "Conservatives": "Conservative Party Of Canada"
    },
    {
        ", he opposed Prime Minister ": null
    },
    {
        "Robert Bordens": "Robert Borden"
    },
    {
        "proposal for a ": null
    },
    {
        "Union Government": "Union Government"
    },
    {
        " that would include both Conservatives and Liberals, fearing that this would ultimately hurt the Conservative Party; he was proven to be correct in this analysis. While he campaigned for Conservative candidates in the ": null
    },
    {
        "1917 federal election": "1917 Canadian Federal Election"
    },
    {
        " he did not stand for re-election himself.       Nevertheless, Bordens successor, ": null
    },
    {
        "Arthur Meighen": "Arthur Meighen"
    },
    {
        " appointed Bennett ": null
    },
    {
        "Minister of Justice": "Minister Of Justice"
    },
    {
        " in his government, as it headed into the ": null
    },
    {
        "1921 federal election": "1921 Canadian Federal Election"
    },
    {
        " in which both the government and Bennett were defeated. Bennett won the seat of ": null
    },
    {
        "Calgary West": "Calgary West"
    },
    {
        " in the ": null
    },
    {
        "1925 federal election": "1925 Canadian Federal Election"
    },
    {
        " and was returned to government as ": null
    },
    {
        "Minister of Finance": "Minister Of Finance"
    },
    {
        " in Meighens short-lived government in 1926. The government was defeated in the ": null
    },
    {
        "1926 federal election": "1926 Canadian Federal Election"
    },
    {
        ". Meighen stepped down as Tory leader, and Bennett became the partys leader in 1927 at the first ": null
    },
    {
        "Conservative leadership convention": "Progressive Conservative Leadership Convention"
    },
    {
        ".     As Opposition leader, Bennett faced off against the more experienced Liberal Prime Minister ": null
    },
    {
        "William Lyon Mackenzie King": "William Lyon Mackenzie King"
    },
    {
        " in Commons debates, and took some time to acquire enough experience to hold his own with King. In 1930, King blundered badly when he made overly partisan statements in response to criticism over his handling of the economic downturn, which was hitting Canada very hard. Kings worst error was in stating that he would not give Tory provincial governments a five-cent piece! This serious mistake, which drew wide press coverage, gave Bennett his needed opening to attack King, which he did successfully in the election campaign which followed. Mr. Prime Minister 1867-1964, by ": null
    },
    {
        "Bruce Hutchison": "Bruce Hutchison"
    },
    {
        ", ": null
    },
    {
        "Toronto": "Toronto"
    },
    {
        " 1964, Longmans Canada            As the leader of the Conservative party, Bennett adapted its program, organization image to promote more rapid modernization of Canada. The New Deal was largely a mirror of the American program. The party was torn between reaction and reform, with deep internal factionalism that led to its defeat in 1935. Bennetts critics on the left had the last word, and textbooks typically portray him as a hard-driving capitalist, pushing for American-style high tariffs and British-style imperialism, while ignoring his reform efforts. Larry A. Glassford, Reaction and Reform: The Politics of the Conservative Party under R.B. Bennett, 1927-1938            By defeating the ": null
    },
    {
        "William Lyon Mackenzie King": "William Lyon Mackenzie King"
    },
    {
        " in the ": null
    },
    {
        "1930 federal election": "1930 Canadian Federal Election"
    },
    {
        ", he had the misfortune of taking office during the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        ". Bennett tried to combat the depression by increasing trade within the ": null
    },
    {
        "British Empire": "British Empire"
    },
    {
        " and imposing ": null
    },
    {
        "tariffs": "Tariffs"
    },
    {
        " for imports from outside the Empire, promising that his measures would blast Canadian exports into world markets. His success was limited however, and his own wealth and impersonal style alienated many struggling Canadians.     While he was the first Prime Minister representing a constituency in Alberta, his party only won four of the provinces 16 seats. His speeches to the Empire Clubs in ": null
    },
    {
        "Toronto": "Toronto"
    },
    {
        " and ": null
    },
    {
        "Montreal": "Montreal"
    },
    {
        ", when chairman of the House of Commons Committee on Representation under Borden, that while settlers from the United States were suitable to be included with those entitled to vote, they however lacked the noble element normally found in the British, caused controversy. At the time, the federal government was required, under a Statute of British Parliament, to re-adjust representation to Alberta and Saskatchewan based on the 1911 census. The re-adjustment made to the four western provinces at the time can only be correlated if only those having British and French origins are considered.     When his ": null
    },
    {
        "Imperial Preference": "Imperial Preference"
    },
    {
        " policy failed to generate the desired result, Bennetts government had no real contingency plan. The partys pro-business and pro-banking inclinations provided little relief to the millions of increasingly desperate and agitated unemployed. Despite the economic crisis, ": null
    },
    {
        "laissez-faire": "Laissez-Faire"
    },
    {
        " persisted as the guiding economic principle of Conservative Party ideology; similar attitudes dominated worldwide as well during this era. Government relief to the unemployed was considered a disincentive to individual initiative, and was therefore only granted in the most minimal amounts and attached to work programs. An additional concern of the federal government was that large numbers of disaffected unemployed men concentrating in urban centres created a volatile situation. As an alternative to bloodshed on the streets , the stop-gap solution for unemployment chosen by the Bennett government was to establish military-run and -styled relief camps in remote areas throughout the country, where single unemployed men toiled for twenty cents a day.  Any relief beyond this was left to provincial and municipal governments, many of which were either insolvent or on the brink of bankruptcy, and which railed against the inaction of other levels of government. Partisan differences began to sharpen on the question of government intervention in the economy, since lower levels of government were largely in Liberal hands, and protest movements were beginning to send their own parties into the political mainstream, notably the ": null
    },
    {
        "Cooperative Commonwealth Federation": "Cooperative Commonwealth Federation"
    },
    {
        " and ": null
    },
    {
        "William Aberharts": "William Aberhart"
    },
    {
        " Social Credit Party": "Social Credit Party Of Alberta"
    },
    {
        " in ": null
    },
    {
        "Alberta": "Alberta"
    },
    {
        ".     In July 1931, Bennetts government passed the ": null
    },
    {
        "Unemployment and Farm Relief Act": "Unemployment And Farm Relief Act"
    },
    {
        " in an effort to stanch the depression, but events were rapidly falling out of their control.          Bennett hosted the 1932 ": null
    },
    {
        "Imperial Economic Conference": "British Empire Economic Conference"
    },
    {
        " in ": null
    },
    {
        "Ottawa": "Ottawa"
    },
    {
        "; this was the first time Canada had hosted the meetings. It was attended by the leaders of the independent dominions of the British Empire . Bennett dominated the meetings, which were ultimately unproductive, due to the inability of leaders to agree on policies, mainly to combat the economic woes dominating the world at the time. Mr. Prime Minister 1867-1964, by ": null
    },
    {
        "Bruce Hutchison": "Bruce Hutchison"
    },
    {
        ", Toronto 1964, Longmans Canada.       A nickname that would stick with Bennett for the remainder of his political career, Iron Heel Bennett , came from a 1932 speech he gave in Toronto that ironically, if unintentionally, alluded to ": null
    },
    {
        "Jack Londons": "Jack London"
    },
    {
        "socialist ": null
    },
    {
        "novel": "The Iron Heel"
    },
    {
        ":     What do they offer you in exchange for the present order? Socialism, Communism, dictatorship. They are sowing the seeds of unrest everywhere. Right in this city such propaganda is being carried on and in the little out of the way places as well. And we know that throughout Canada this propaganda is being put forward by organizations from foreign lands that seek to destroy our institutions. And we ask that every man and woman put the iron heel of ruthlessness against a thing of that kind. The quote is from: ; the irony of the allusion is noted in      Reacting to fears of ": null
    },
    {
        "communist": "Communist"
    },
    {
        " subversion, Bennett invoked the controversial ": null
    },
    {
        "Section 98": "Section 98"
    },
    {
        " of the ": null
    },
    {
        "Criminal Code": "Criminal Code"
    },
    {
        ". Enacted in the aftermath of the ": null
    },
    {
        "Winnipeg general strike": "Winnipeg General Strike"
    },
    {
        ", section 98 dispensed with the ": null
    },
    {
        "presumption of innocence": "Presumption Of Innocence"
    },
    {
        " in outlawing potential threats to the state: specifically, anyone belonging to an organization that officially advocated the violent overthrow of the government. Even if the accused had never committed an act of violence or personally supported such an action, they could be incarcerated merely for attending meetings of such an organization, publicly speaking in its defense, or distributing its literature.  Despite the broad power authorized under section 98, it targeted specifically the ": null
    },
    {
        "Communist Party of Canada": "Communist Party Of Canada"
    },
    {
        ". Eight of the top party leaders, including ": null
    },
    {
        "Tim Buck": "Tim Buck"
    },
    {
        ", were arrested on 11 August 1931 and convicted under section 98. This plan to stamp out communism backfired, however, and proved to be a damaging embarrassment for the government, especially after Buck was the target of an apparent ": null
    },
    {
        "assassination": "Assassination"
    },
    {
        " attempt. While confined to his cell during a ": null
    },
    {
        "prison riot": "Prison Riot"
    },
    {
        ", despite not participating in the riot, shots were fired into his cell. When an ": null
    },
    {
        "agit-prop": "Agit-Prop"
    },
    {
        " play": "Play"
    },
    {
        " depicting these events,  Eight Men Speak , was suppressed on 4 December 1933 by the Toronto police, a protest meeting was held where Communist politician ": null
    },
    {
        "A. E. Smith": "Albert Edward Smith"
    },
    {
        " repeated the plays allegations, and he was consequently arrested for ": null
    },
    {
        "sedition": "Sedition"
    },
    {
        ". This created a storm of public protest, compounded when Buck was called as a witness to the trial and repeated the allegations in open court. Although the remarks were stricken from the record, they still discredited the prosecutions case and Smith was acquitted. As a result, the governments case against Buck lost any credibility, and Buck and his comrades were released early and fêted as heroic champions of ": null
    },
    {
        "civil liberties": "Civil Liberties"
    },
    {
        ".          Having survived section 98, and benefiting from the public sympathy wrought by persecution, Communist Party members set out to organize workers in the relief camps set up by the ": null
    },
    {
        "Unemployment and Farm Relief Act": "Unemployment And Farm Relief Act"
    },
    {
        ". Camp workers laboured on a variety of infrastructure projects, including such things as municipal airports, roads, and park facilities, along with a number of other make-work schemes. Conditions in the camps were poor, not only because of the low pay, but also the lack of recreational facilities, isolation from family and friends, poor quality food, and the use of ": null
    },
    {
        "military discipline": "Military Discipline"
    },
    {
        ". Communists thus had ample grounds on which to organize camp workers, although the workers were there of their own volition.  The ": null
    },
    {
        "Relief Camp Workers Union": "Relief Camp Workers Union"
    },
    {
        " was formed and affiliated with the ": null
    },
    {
        "Workers Unity League": "Workers Unity League"
    },
    {
        ", the trade union umbrella of the Communist Party. Camp workers in BC struck on 4 April 1935, and, after two months of protesting in Vancouver, began the ": null
    },
    {
        "On-to-Ottawa Trek": "On-To-Ottawa Trek"
    },
    {
        " to bring their grievances to Bennetts doorstep. The Prime Minister and his Minister of Justice, ": null
    },
    {
        "Hugh Guthrie": "Hugh Guthrie"
    },
    {
        ", treated the trek as an attempted insurrection, and ordered it to be stopped. The ": null
    },
    {
        "Royal Canadian Mounted Police": "Royal Canadian Mounted Police"
    },
    {
        " read the ": null
    },
    {
        "Riot Act": "Riot Actcanada"
    },
    {
        " to a crowd of 3,000 strikers and their supporters in ": null
    },
    {
        "Regina": "Regina, Saskatchewan"
    },
    {
        " on 1 July 1935, resulting in two deaths and dozens of injured. All told, Bennetts anti-Communist policy would not bode well for his political career.            In January 1934, Bennett told the provinces that they were wasteful and extravagant , and even told Quebec and Ontario that they were wealthy enough to manage their own problems.  One year later, he had changed his tune. Following the lead of ": null
    },
    {
        "President": "President Of The United States"
    },
    {
        "Roosevelts": "Franklin D. Roosevelt"
    },
    {
        " New Deal": "New Deal"
    },
    {
        " in the United States, Bennett, under the advice of ": null
    },
    {
        "William Duncan Herridge": "William Duncan Herridge"
    },
    {
        ", who was Canadas ": null
    },
    {
        "Envoy": "Envoy"
    },
    {
        " to the United States, the government eventually began to follow the Americans lead. In a series of five radio speeches to the nation in January 1935, Bennett introduced a Canadian version of the New Deal , involving unprecedented public spending and federal intervention in the economy. ": null
    },
    {
        "Progressive income tax": "Progressive Income Tax"
    },
    {
        "ation, a ": null
    },
    {
        "minimum wage": "Minimum Wage"
    },
    {
        ", a maximum number of working hours per week, ": null
    },
    {
        "unemployment insurance": "Unemployment Insurance"
    },
    {
        ", ": null
    },
    {
        "health insurance": "Health Insurance"
    },
    {
        ", an expanded ": null
    },
    {
        "pension": "Pension"
    },
    {
        " program, and grants to farmers were all included in the plan. , The Canadian Encyclopedia     In one of his addresses to the nation, Bennett said:        Bennetts conversion, however, was seen as too little too late, and he faced criticism that his reforms either went too far, or did not go far enough,  including from one of his cabinet ministers ": null
    },
    {
        "H. H. Stevens": "Henry Herbert Stevens"
    },
    {
        ", who bolted the government to form the ": null
    },
    {
        "Reconstruction Party of Canada": "Reconstruction Party Of Canada"
    },
    {
        ". Some of the measures were alleged to have encroached on provincial jurisdictions laid out in section 92 of the ": null
    },
    {
        "British North America Act, 1867": "British North America Act, 1867"
    },
    {
        ". The courts, including the ": null
    },
    {
        "Judicial Committee of the Privy Council": "Judicial Committee Of The Privy Council"
    },
    {
        ", agreed and eventually struck down virtually all of Bennetts reforms.  However, some of Bennetts initiatives, such as the ": null
    },
    {
        "Bank of Canada": "Bank Of Canada"
    },
    {
        ", which he founded in 1934, remain in place to this day, and the ": null
    },
    {
        "Canadian Wheat Board": "Canadian Wheat Board"
    },
    {
        " remained in place until 2011 when the government of ": null
    },
    {
        "Stephen Harper": "Stephen Harper"
    },
    {
        " abolished it.          Although there was no unity among the motley political groups that constituted Bennetts opposition, a consensus emerged that his handling of the economic crisis was insufficient and inappropriate, even from Conservative quarters. Bennett personally became a symbol of the political failings underscoring the depression. Car owners, for example, who could no longer afford gasoline, had horses pull their vehicles, which they named ": null
    },
    {
        "Bennett buggies": "Bennett Buggy"
    },
    {
        " . Unity in his own administration suffered, notably by the defection of his Minister of Trade, ": null
    },
    {
        "Henry Herbert Stevens": "Henry Herbert Stevens"
    },
    {
        ". Stevens left the Conservatives and formed the ": null
    },
    {
        "Reconstruction Party of Canada": "Reconstruction Party Of Canada"
    },
    {
        ", after Bennett refused to implement Stevens plan for drastic economic reform to deal with the economic crisis.     The beneficiary of the overwhelming opposition during Bennetts tenure was the Liberal Party. The Tories were decimated in the ": null
    },
    {
        "October 1935 general election": "1935 Canadian Federal Election"
    },
    {
        ", winning only 40 seats to 173 for Mackenzie Kings Liberals. The Tories would not form a majority government again in Canada until 1958. Kings government soon implemented its own moderate reforms, including the replacement of relief camps with a scaled down provincial relief project scheme, and the repeal of section 98. Ultimately, Canada pulled out of the depression as a result of government-funded jobs associated with the preparation for and onset of the ": null
    },
    {
        "Second World War": "World War Ii"
    },
    {
        ".       Bennett was something of a far sighted man. For example, during his tenure,   he launched the ": null
    },
    {
        "Canadian Radio Broadcasting Commission": "Canadian Radio Broadcasting Commission"
    },
    {
        ";   he laid the ground for a national air transport system;   he passed the ": null
    },
    {
        "Natural Products Marketing Act": "Natural Products Marketing Act"
    },
    {
        " in 1934;   he cut the salaries of the federal civil service by 10%;    he established the ": null
    },
    {
        "Bank of Canada": "Bank Of Canada"
    },
    {
        ". Canadas Prime Ministers: Macdonald to Trudeau , 2007, p. 320       Bennett retired to Britain in 1938, and, on 12 June 1941, became the first and only former Canadian ": null
    },
    {
        "Prime Minister": "Prime Minister"
    },
    {
        " to be elevated to the peerage as Viscount Bennett, of ": null
    },
    {
        "Mickleham": "Mickleham, Surrey"
    },
    {
        " in the ": null
    },
    {
        "County of Surrey": "Surrey"
    },
    {
        " and of ": null
    },
    {
        "Calgary": "Calgary"
    },
    {
        " and ": null
    },
    {
        "Hopewell": "Hopewell Hill, New Brunswick"
    },
    {
        " in the ": null
    },
    {
        "Dominion of Canada": "Canada"
    },
    {
        ".    The honour, conferred by British PM ": null
    },
    {
        "Winston Churchill": "Winston Churchill"
    },
    {
        ", was in recognition for Bennetts valuable unsalaried work in the Ministry of Aircraft Production, managed by his lifelong friend Lord Beaverbrook. Bennett took an active role in the House of Lords, and attended frequently until his death. Canadas Prime Ministers: Macdonald to Trudeau , 2007, pp. 325-326     Bennetts interest in increasing public awareness and accessibility to Canadas historical records, led him to serve as Vice-President of ": null
    },
    {
        "The Champlain Society": "Champlain Society"
    },
    {
        " from 1933 until his death.      He died after suffering a ": null
    },
    {
        "heart attack": "Myocardial Infarction"
    },
    {
        " while taking a bath on 26 June 1947 at Mickleham. He was exactly one week shy of his 77th birthday. He is buried there in ": null
    },
    {
        "St. Michaels Churchyard, Mickleham": "St. Michaels Churchyard, Mickleham"
    },
    {
        ".  The tomb, and Government of Canada marker outside, are steps from the front doors of the church. He is the only deceased former Canadian Prime Minister not buried in Canada. Unmarried, Bennett was survived by nephews William Herridge, Jr., and Robert Coats, and by brother Ronald V. Bennett. The viscountcy became extinct on his death.       While Bennett was, and is still, often criticized for lack of compassion for the impoverished masses, he stayed up through many nights reading and responding to personal letters from ordinary citizens asking for his help, and often dipped into his personal fortune to send a five-dollar bill to a starving family. The total amount he gave personally is uncertain, although he personally estimated that in 1927–37 he spent well over 2.3 million dollars. Dictionary of Canadian Biography Online- ? & id_nbr7997 Bennett was a controlling owner of the ": null
    },
    {
        "E.  B. Eddy match company": "Eddy Match Company"
    },
    {
        ", which was the largest safety match manufacturer in Canada, and he was one of the richest Canadians at that time. Bennett helped put many poor, struggling young men through university. Relative to the times he lived in, he was likely the wealthiest Canadian to become prime minister.     Bennett worked an exhausting schedule throughout his years as prime minister, often more than 14 hours per day, and dominated his government, usually holding several cabinet posts. He lived in a suite in the ": null
    },
    {
        "Château Laurier": "Château Laurier"
    },
    {
        " hotel, a short walk from Parliament Hill. The respected author ": null
    },
    {
        "Bruce Hutchison": "Bruce Hutchison"
    },
    {
        " wrote that had the economic times been more normal, Bennett would likely have been regarded as a good, perhaps great, Canadian prime minister.     Bennett was also a noted talent spotter. He took note of and encouraged the young ": null
    },
    {
        "Lester Pearson": "Lester Pearson"
    },
    {
        " in the early 1930s, and appointed Pearson to significant roles on two major government inquiries: the 1931 Royal Commission on Grain Futures, and the 1934 Royal Commission on Price Spreads. Bennett saw that Pearson was recognized with an ": null
    },
    {
        "OBE": "Obe"
    },
    {
        " after he shone in that work, arranged a bonus of $1,800, and invited him to a London conference. Former Prime Minister ": null
    },
    {
        "John Turner": "John Turner"
    },
    {
        ", who as a child, knew Bennett while he was prime minister, praised Bennetts promotion of Turners ": null
    },
    {
        "economist": "Economist"
    },
    {
        " mother to the highest civil service post held by a Canadian woman to that time. The Authentic Voice of Canada, by Christopher McCreery and Arthur Milnes , McGill - Queens University Press, ": null
    },
    {
        "Kingston, Ontario": "Kingston, Ontario"
    },
    {
        ", 2009, p. xiv.         Most historians consider his premiership to have been a failure at a time of severe economic crisis. Larry Glassford, Review of Boyko, John, Bennett: The Rebel Who Challenged and Changed a Nation. Boyko says he was a success. ": null
    },
    {
        "H. Blair Neatby": "H. Blair Neatby"
    },
    {
        " says categorically that as a politician he was a failure . ": null
    },
    {
        "H. Blair Neatby": "H. Blair Neatby"
    },
    {
        ", The Politics of Chaos: Canada in the Thirties , p 53. ": null
    },
    {
        "Jack Granatstein": "Jack Granatstein"
    },
    {
        " and ": null
    },
    {
        "Norman Hillmer": "Norman Hillmer"
    },
    {
        ", comparing him to all other Canadian prime ministers concluded, Bennett utterly failed as a leader. Everyone was alienated by the end—Cabinet, caucus, party, voter and foreigner. J. L. Granatstein and Norman Hillmer, Prime Ministers: Ranking Canadas Leaders , p 113.     Bennett was ranked 12 by a survey of Canadian historians out of the then 20 Prime Ministers of Canada through ": null
    },
    {
        "Jean Chrétien": "Jean Chrétien"
    },
    {
        ". The results of the survey were included in the book Prime Ministers: Ranking Canadas Leaders by ": null
    },
    {
        "J. L. Granatstein": "J. L. Granatstein"
    },
    {
        " and ": null
    },
    {
        "Norman Hillmer": "Norman Hillmer"
    },
    {
        ".     A 2001 book by ": null
    },
    {
        "Quebec nationalist": "Quebec Separatism"
    },
    {
        " writer ": null
    },
    {
        "Normand Lester": "Normand Lester"
    },
    {
        ",  Le Livre noir du Canada anglais   accused Bennett of having a political affiliation with, and of having provided financial support to, ": null
    },
    {
        "fascist": "Fascism"
    },
    {
        " Quebec writer ": null
    },
    {
        "Adrien Arcand": "Adrien Arcand"
    },
    {
        ". This is based on a series of letters sent to Bennett following his election as Prime Minister by Arcand, his colleague Ménard and two Conservative caucus members asking for financial support for Arcands antisemitic newspaper  Le Goglu . Lester, Normand Le Livre noir du Canada anglais; Montreal: Les Éditions des Intouchables, p.255. The letter is conserved at the National Archives of Canada in Ottawa. A photocopy can be found at the archives of the Canadian Jewish Council in Montreal, under P0005 ARCAND, Adrien . The book also claims that in a 1936 letter to Bennett, A. W. Reid, a Conservative organizer, estimated that Conservative Party members gave Arcand a total of $27,000 .       Bennett chose the following jurists to be appointed as justices of the ": null
    },
    {
        "Supreme Court of Canada": "Supreme Court Of Canada"
    },
    {
        " by the ": null
    },
    {
        "Governor General": "Governor General Of Canada"
    },
    {
        ":   ": null
    },
    {
        "Oswald Smith Crocket": "Oswald Smith Crocket"
    },
    {
        "   Frank Joseph Hughes": "Frank Joseph Hughes"
    },
    {
        "   Sir ": null
    },
    {
        "Lyman Poore Duff": "Lyman Poore Duff"
    },
    {
        " ": null
    }
]