[
    {
        "           Rabbit is a character in the ": null
    },
    {
        "fiction": "fiction"
    },
    {
        "al world of the ": null
    },
    {
        "book series": "book series"
    },
    {
        " and ": null
    },
    {
        "cartoon": "cartoon"
    },
    {
        "s  Winnie-the-Pooh . He is a friend of ": null
    },
    {
        "Winnie-the-Pooh": "winnie-the-pooh"
    },
    {
        ", regards himself as practical and tends to take the lead, though not always with the results that he intends.       The first appearance of Rabbit is in chapter II in the  Winnie-the-Pooh  book by ": null
    },
    {
        "A. A. Milne": "a. a. milne"
    },
    {
        ". He also appears in chapters VII, VIII, IX and X of that book, as well as in chapters III, V, VI, VII, VIII, IX, and X in  The House at Pooh Corner .     While most of the cast in the books are based on stuffed animals owned by ": null
    },
    {
        "Christopher Robin Milne": "christopher robin milne"
    },
    {
        ", ": null
    },
    {
        "Ernest H. Shepard": "ernest h. shepard"
    },
    {
        "s illustrations of Rabbit look more like a living animal. Rabbit resembles an ordinary rabbit, except that he walks on two legs and uses his front paws as hands. The top of his head reaches about to Poohs nose.     Rabbit lives in a house in the north-central part of the ": null
    },
    {
        "Hundred Acre Wood": "hundred acre wood"
    },
    {
        ", between the sandy pit where Roo plays and the area where the animals he calls his Friends-and-Relations live. Rabbit likes to take charge and come up with elaborate plans, such as the one to scare ": null
    },
    {
        "Kanga": "kanga"
    },
    {
        " by hiding ": null
    },
    {
        "Roo": "roo"
    },
    {
        ", and the one to unbounce ": null
    },
    {
        "Tigger": "tigger"
    },
    {
        ". He is also an organizer, as in the case of the Search for Small. As detailed as his plans are, they often miss certain key points and go wrong.     Rabbit tends to include Pooh and ": null
    },
    {
        "Piglet": "piglet"
    },
    {
        " in his plans, and he goes to Owl when there is thinking to be done . He likes to be put in charge of things and is sometimes bossy, and he sees his relationship to ": null
    },
    {
        "Christopher Robin": "christopher robin"
    },
    {
        " as being the one that Christopher depends on. While loyal to the friends he knows, Rabbit shows a certain reluctance to welcome newcomers, as evidenced by his initial negative reaction to the arrival of Kanga and Roo in the first book, and to Tigger in the second book. Nonetheless, he warms up to all of them in time.     While the literacy of Pooh, Owl, and Eeyore becomes a plot point in The House at Pooh Corner, Rabbits ease with reading and writing is taken for granted.     Rabbit also has good relationships with the minor animals in the forest, known as Rabbits Friends-and-Relations . Several are mentioned by name, including ": null
    },
    {
        "beetle": "beetle"
    },
    {
        "s called Small, Alexander Beetle and Henry Rush, and three unspecified creatures called Smallest-of-All, Late, and Early. According to the illustrations of the book, his Friends-and-Relations include other ": null
    },
    {
        "rabbit": "rabbit"
    },
    {
        "s, a ": null
    },
    {
        "squirrel": "squirrel"
    },
    {
        ", a ": null
    },
    {
        "hedgehog": "hedgehog"
    },
    {
        ", ": null
    },
    {
        "mice": "mice"
    },
    {
        ", and ": null
    },
    {
        "insect": "insect"
    },
    {
        "s. At one point, Rabbit estimates that he would need seventeen pockets if he were going to carry all his family about with him. Whether that number refers just to his relatives or to the friends-and-relations as a group is unknown, if it had any basis at all.     In  Return to the Hundred Acre Wood , a sequel not written by A. A. Milne but by ": null
    },
    {
        "David Benedictus": "david benedictus"
    },
    {
        ", Rabbit tries to organize things further. He tries to have a census in the forest, but it does not work out very well. Rabbit also attempts to teach a Household Management class and is the one who discovers Lottie the otter. His grandfather, Grandad Buck, appears in the book.          Rabbit appears in most Disney Winnie the Pooh cartoons, but he is yellow in color, instead of brown. An added element is his keeping of a garden, of which he is strongly protective, becoming angered when any creature seeks to damage it. Although he is not described as having a garden in either of the A. A. Milne books, he has one in David Benedictuss Return to the Hundred Acre Wood.     The Disney adaptations also develop his personality further, expanding the original organized character into a ": null
    },
    {
        "control freak": "control freak"
    },
    {
        " with a short temper, although his care for his friends remains. The film characters willingness to do things by the book appeared in  Poohs Grand Adventure: The Search for Christopher Robin , in which he consistently follows written instructions for fear of being unable to think well for himself, although he later produces a competent plan. Despite occasional malevolent behavior, he always learns from his wrongdoing; while a leading character in the film  Springtime with Roo , he abandons his selfishness after considering the possibility that it will drive all of the other characters away from the forest.     In the Disney adaptations, Rabbit and ": null
    },
    {
        "Tigger": "tigger"
    },
    {
        " are usually ": null
    },
    {
        "foils": "foil"
    },
    {
        " for each other. In the original featurettes, Rabbit outright dislikes Tigger. By  The New Adventures of Winnie the Pooh , however, they have become close friends, though very dysfunctional ones, who regularly work together. Tiggers antics continue to annoy Rabbit and make trouble for him, while Rabbits harsh attitude and attempts to teach Tigger a lesson still come off as unkind. Nevertheless, Tigger is usually the first one to help Rabbit when he needs it and Rabbit cannot deny their closeness.     His character is consistent in most of the Disney adaptations, although in  Welcome to Pooh Corner , he is a talented magician and in The New Adventures of Winnie the Pooh, he is pale green instead of yellow. At one point in the latter series, Rabbit adopts a bluebird named ": null
    },
    {
        "Kessie": "kessie"
    },
    {
        ". , Rabbit now appears at ": null
    },
    {
        "Walt Disney World": "walt disney world"
    },
    {
        " in ": null
    },
    {
        "Lake Buena Vista, FL": "lake buena vista, fl"
    },
    {
        " and ": null
    },
    {
        "Disneyland": "disneyland"
    },
    {
        " in ": null
    },
    {
        "Anaheim, CA": "anaheim, ca"
    },
    {
        " for meet and greets.       ": null
    },
    {
        "Junius Matthews": "junius matthews"
    },
    {
        " was the voice of Rabbit in the first three Disney films. After his death, ": null
    },
    {
        "Ray Erlenborn": "ray erlenborn"
    },
    {
        " briefly voiced him in  Winnie the Pooh Discovers the Seasons . ": null
    },
    {
        "Will Ryan": "will ryan"
    },
    {
        " took over the role for  Winnie the Pooh and a Day for Eeyore  and performed both Rabbit and ": null
    },
    {
        "Tigger": "tigger"
    },
    {
        " in  Welcome to Pooh Corner .     ": null
    },
    {
        "Ken Sansom": "ken sansom"
    },
    {
        " replaced Ryan beginning with  The New Adventures of Winnie the Pooh  and is to date Rabbits longest-running portrayer, having continued the voice up to and including  My Friends Tigger and Pooh .  ": null
    },
    {
        "Tom Kenny": "tom kenny"
    },
    {
        " most recently provided the voice for the 42 film,  Winnie the Pooh . ": null
    },
    {
        "Peter Capaldi": "peter capaldi"
    },
    {
        " voiced Rabbit in  Christopher Robin ": null
    }
]