[
    {
        "      Radon is a ": null
    },
    {
        "chemical element": "chemical element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "symbol"
    },
    {
        "  Rn and ": null
    },
    {
        "atomic number": "atomic number"
    },
    {
        "  86. It is a ": null
    },
    {
        "radioactive": "radioactive decay"
    },
    {
        ", colorless, odorless, tasteless ": null
    },
    {
        "noble gas": "noble gas"
    },
    {
        ". It occurs naturally in minute quantities as an intermediate step in the normal radioactive ": null
    },
    {
        "decay chains": "decay chain"
    },
    {
        "through which ": null
    },
    {
        "thorium": "thorium"
    },
    {
        " and ": null
    },
    {
        "uranium": "uranium"
    },
    {
        " slowly decay into ": null
    },
    {
        "lead": "lead"
    },
    {
        " and various other short-lived radioactive elements; radon itself is the immediate ": null
    },
    {
        "decay product": "decay product"
    },
    {
        " of ": null
    },
    {
        "radium": "radium"
    },
    {
        ". Its most stable ": null
    },
    {
        "isotope": "isotope"
    },
    {
        ", ": null
    },
    {
        " 222 Rn": "radon-222"
    },
    {
        ", has a ": null
    },
    {
        "half-life": "half-life"
    },
    {
        " of only 3.8 days, making radon one of the rarest elements since it decays away so quickly. However, since thorium and uranium are two of the most common radioactive elements on Earth, and they have three isotopes with very long half-lives, on the order of several billions of years, radon will be present on Earth long into the future in spite of its short half-life as it is continually being generated. The decay of radon produces many other short-lived ": null
    },
    {
        "nuclides": "nuclide"
    },
    {
        "known as radon daughters, ending at stable isotopes of ": null
    },
    {
        "lead": "lead"
    },
    {
        ". , ": null
    },
    {
        "Agency for Toxic Substances and Disease Registry": "agency for toxic substances and disease registry"
    },
    {
        ", U.S. Public Health Service, In collaboration with U.S. Environmental Protection Agency, December 1990.     Unlike all the other intermediate elements in the aforementioned decay chains, radon is, under normal conditions, gaseous and easily inhaled. Radon gas is considered a health hazard. It is often the single largest contributor to an individuals ": null
    },
    {
        "background radiation": "background radiation"
    },
    {
        " dose, but due to local differences in geology,  the level of the radon-gas hazard differs from location to location. Despite its short lifetime, radon gas from natural sources, such as uranium-containing minerals, can accumulate in buildings, especially, due to its high density, in low areas such as basements and crawl spaces. Radon can also occur in ground water – for example, in some ": null
    },
    {
        "spring": "spring"
    },
    {
        " waters and hot springs.      ": null
    },
    {
        "Epidemiological": "epidemiological"
    },
    {
        " studies have shown a clear link between breathing high concentrations of radon and incidence of ": null
    },
    {
        "lung cancer": "lung cancer"
    },
    {
        ". Radon is a contaminant that affects ": null
    },
    {
        "indoor air quality": "indoor air quality"
    },
    {
        " worldwide. According to the ": null
    },
    {
        "United States Environmental Protection Agency": "united states environmental protection agency"
    },
    {
        " , radon is the second most frequent cause of lung cancer, after cigarette smoking, causing 21,000 lung cancer deaths per year in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ". About 2,900 of these deaths occur among people who have never smoked. While radon is the second most frequent cause of lung cancer, it is the number one cause among non-smokers, according to EPA policy-oriented estimates. Significant uncertainties exist for the health effects of low-dose exposures.  Unlike the gaseous radon itself, radon daughters are solids and stick to surfaces, such as dust particles in the air. If such contaminated dust is inhaled, these particles can also cause lung cancer.               Radon is a colorless, odorless, and tasteless  gas and therefore is not detectable by human senses alone. At ": null
    },
    {
        "standard temperature and pressure": "standard conditions for temperature and pressure"
    },
    {
        ", radon forms a ": null
    },
    {
        "monatomic gas": "monatomic gas"
    },
    {
        " with a density of 9.73  kg/m 3 , about 8 times the density of the ": null
    },
    {
        "Earths atmosphere": "atmosphere of earth"
    },
    {
        " at sea level, 1.217  kg/m 3 .  Radon is one of the densest gases at room temperature and is the densest of the noble gases. Although colorless at standard temperature and pressure, when cooled below its ": null
    },
    {
        "freezing point": "freezing point"
    },
    {
        " of , radon emits a brilliant ": null
    },
    {
        "radioluminescence": "radioluminescence"
    },
    {
        " that turns from yellow to orange-red as the temperature lowers.  Upon ": null
    },
    {
        "condensation": "condensation"
    },
    {
        ", radon glows because of the intense radiation it produces.  Radon is sparingly ": null
    },
    {
        "soluble": "soluble"
    },
    {
        " in water, but more soluble than lighter noble gases. Radon is appreciably more soluble in ": null
    },
    {
        "organic liquids": "organic liquid"
    },
    {
        "than in water.       Radon is a member of the zero-": null
    },
    {
        "valence": "valence"
    },
    {
        " elements that are called noble gases, and is chemically not very ": null
    },
    {
        "reactive": "reactivity"
    },
    {
        ". However, the 3.8-day half-life of radon-222 makes it useful in physical sciences as a natural ": null
    },
    {
        "tracer": "radioactive tracer"
    },
    {
        ". Because radon is a gas at standard conditions, unlike its decay-chain parents, it can readily be extracted from them for research.     It is ": null
    },
    {
        "inert": "inert gas"
    },
    {
        " to most common chemical reactions, such as ": null
    },
    {
        "combustion": "combustion"
    },
    {
        ", because the outer ": null
    },
    {
        "valence shell": "valence shell"
    },
    {
        " contains eight ": null
    },
    {
        "electron": "electron"
    },
    {
        "s. This produces a stable, minimum energy configuration in which the outer electrons are tightly bound.  Its ": null
    },
    {
        "first ionization energy": "first ionization energy"
    },
    {
        "—the minimum energy required to extract one electron from it—is 1037  kJ/mol.  In accordance with ": null
    },
    {
        "periodic trends": "periodic table"
    },
    {
        ", radon has a lower ": null
    },
    {
        "electronegativity": "electronegativity"
    },
    {
        " than the element one period before it, ": null
    },
    {
        "xenon": "xenon"
    },
    {
        ", and is therefore more reactive. Early studies concluded that the stability of radon ": null
    },
    {
        "hydrate": "hydrate"
    },
    {
        " should be of the same order as that of the hydrates of ": null
    },
    {
        "chlorine": "chlorine"
    },
    {
        "  or ": null
    },
    {
        "sulfur dioxide": "sulfur dioxide"
    },
    {
        " , and significantly higher than the stability of the hydrate of ": null
    },
    {
        "hydrogen sulfide": "hydrogen sulfide"
    },
    {
        " .      Because of its cost and radioactivity, experimental chemical research is seldom performed with radon, and as a result there are very few reported compounds of radon, all either ": null
    },
    {
        "fluorides": "fluoride"
    },
    {
        "or ": null
    },
    {
        "oxide": "oxide"
    },
    {
        "s. Radon can be ": null
    },
    {
        "oxidized": "oxidation"
    },
    {
        " by powerful oxidizing agents such as ": null
    },
    {
        "fluorine": "fluorine"
    },
    {
        ", thus forming ": null
    },
    {
        "radon difluoride": "radon fluoride"
    },
    {
        " .   It decomposes back to its elements at a temperature of above , and is reduced by water to radon gas and hydrogen fluoride: it may also be reduced back to its elements by ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        " gas. It has a low ": null
    },
    {
        "volatility": "volatility"
    },
    {
        " and was thought to be . Because of the short half-life of radon and the radioactivity of its compounds, it has not been possible to study the compound in any detail. Theoretical studies on this molecule predict that it should have a Rn–F ": null
    },
    {
        "bond distance": "bond length"
    },
    {
        " of 2.08  ": null
    },
    {
        "ångström": "ångström"
    },
    {
        " , and that the compound is thermodynamically more stable and less volatile than its lighter counterpart ": null
    },
    {
        "xenon difluoride": "xenon difluoride"
    },
    {
        " .  The ": null
    },
    {
        "octahedral molecule": "octahedral molecular geometry"
    },
    {
        "  was predicted to have an even lower ": null
    },
    {
        "enthalpy of formation": "enthalpy of formation"
    },
    {
        " than the difluoride.  The + ": null
    },
    {
        "ion": "ion"
    },
    {
        " is believed to form by the following reaction:      : Rn + 2  →  + 2      For this reason, ": null
    },
    {
        "antimony pentafluoride": "antimony pentafluoride"
    },
    {
        " together with ": null
    },
    {
        "chlorine trifluoride": "chlorine trifluoride"
    },
    {
        " and  have been considered for radon gas removal in ": null
    },
    {
        "uranium mines": "uranium mining"
    },
    {
        " due to the formation of radon–fluorine compounds.  Radon compounds can be formed by the decay of radium in radium halides, a reaction that has been used to reduce the amount of radon that escapes from targets during ": null
    },
    {
        "irradiation": "irradiation"
    },
    {
        ". Additionally, salts of the + cation with the anions , , and  are known.  Radon is also oxidised by ": null
    },
    {
        "dioxygen difluoride": "dioxygen difluoride"
    },
    {
        " to  at .     Radon oxides are among the few other reported ": null
    },
    {
        "compounds of radon": ":category:radon compounds"
    },
    {
        ";  only the trioxide  has been confirmed. The higher fluorides  and  have been claimed, and are calculated to be stable,  but it is doubtful whether they have yet been synthesized.  They may have been observed in experiments where unknown radon-containing products distilled together with ": null
    },
    {
        "xenon hexafluoride": "xenon hexafluoride"
    },
    {
        ": these may have been , , or both. Trace-scale heating of radon with xenon, fluorine, ": null
    },
    {
        "bromine pentafluoride": "bromine pentafluoride"
    },
    {
        ", and either ": null
    },
    {
        "sodium fluoride": "sodium fluoride"
    },
    {
        " or ": null
    },
    {
        "nickel fluoride": "nickel fluoride"
    },
    {
        " was claimed to produce a higher fluoride as well which ": null
    },
    {
        "hydrolysed": "hydrolysis"
    },
    {
        " to form . While it has been suggested that these claims were really due to radon precipitating out as the solid complex RnF 2− , the fact that radon ": null
    },
    {
        "coprecipitates": "coprecipitation"
    },
    {
        " from ": null
    },
    {
        "aqueous solution": "aqueous solution"
    },
    {
        " with  has been taken as confirmation that  was formed, which has been supported by further studies of the hydrolysed solution. That − did not form in other experiments may have been due to the high concentration of fluoride used. ": null
    },
    {
        "Electromigration": "electromigration"
    },
    {
        " studies also suggest the presence of cationic + and anionic − forms of radon in ": null
    },
    {
        "weakly acidic": "weak acid"
    },
    {
        " aqueous solution , the procedure having previously been validated by examination of the homologous xenon trioxide.     It is likely that the difficulty in identifying higher fluorides of radon stems from radon being kinetically hindered from being oxidised beyond the divalent state because of the strong ionicity of ": null
    },
    {
        "radon difluoride": "radon difluoride"
    },
    {
        "  and the high positive charge on radon in RnF + ; spatial separation of RnF 2 molecules may be necessary to clearly identify higher fluorides of radon, of which  is expected to be more stable than  due to ": null
    },
    {
        "spin–orbit": "spin–orbit interaction"
    },
    {
        " splitting of the 6p shell of radon . Therefore, while  should have a similar stability to ": null
    },
    {
        "xenon tetrafluoride": "xenon tetrafluoride"
    },
    {
        " ,  would likely be much less stable than ": null
    },
    {
        "xenon hexafluoride": "xenon hexafluoride"
    },
    {
        " : radon hexafluoride would also probably be a ": null
    },
    {
        "regular octahedral": "octahedral molecular geometry"
    },
    {
        " molecule, unlike the distorted octahedral structure of , because of the ": null
    },
    {
        "inert pair effect": "inert pair effect"
    },
    {
        ".   Extrapolation down the noble gas group would suggest also the possible existence of RnO, RnO 2 , and RnOF 4 , as well as the first chemically stable noble gas chlorides RnCl 2 and RnCl 4 , but none of these have yet been found.     Radon ": null
    },
    {
        "carbonyl": "carbonyl"
    },
    {
        " has been predicted to be stable and to have a ": null
    },
    {
        "linear molecular geometry": "linear molecular geometry"
    },
    {
        ".  The molecules  and RnXe were found to be significantly stabilized by ": null
    },
    {
        "spin-orbit coupling": "angular momentum coupling"
    },
    {
        ".  Radon caged inside a ": null
    },
    {
        "fullerene": "fullerene"
    },
    {
        " has been proposed as a drug for ": null
    },
    {
        "tumors": "tumors"
    },
    {
        ".   Despite the existence of Xe, no Rn compounds have been claimed to exist; RnF 8 should be highly unstable chemically . It is predicted that the most stable Rn compound would be barium perradonate , analogous to barium ": null
    },
    {
        "perxenate": "perxenate"
    },
    {
        ". The instability of Rn is due to the ": null
    },
    {
        "relativistic": "relativistic quantum chemistry"
    },
    {
        " stabilization of the 6s shell, also known as the ": null
    },
    {
        "inert pair effect": "inert pair effect"
    },
    {
        ".     Radon reacts with the liquid ": null
    },
    {
        "halogen fluorides": "interhalogen"
    },
    {
        " ClF, ClF 3 , ClF 5 , BrF 3 , BrF 5 , and IF 7 to form RnF 2 . In halogen fluoride solution, radon is nonvolatile and exists as the RnF + and Rn 2+ cations; addition of fluoride anions results in the formation of the complexes  and , paralleling the chemistry of ": null
    },
    {
        "beryllium": "beryllium"
    },
    {
        " and ": null
    },
    {
        "aluminium": "aluminium"
    },
    {
        ". The ": null
    },
    {
        "standard electrode potential": "standard electrode potential"
    },
    {
        " of the Rn 2+ /Rn couple has been estimated as +2.0  V,  although there is no evidence for the formation of stable radon ions or compounds in aqueous solution.             Radon has no ": null
    },
    {
        "stable isotope": "stable isotope"
    },
    {
        "s. Thirty-nine radioactive isotopes have been characterized, with ": null
    },
    {
        "atomic mass": "atomic mass"
    },
    {
        "es ranging from 193 to 231.   The most stable isotope is 222 Rn, which is a decay product of ": null
    },
    {
        " 226 Ra": "radium-226"
    },
    {
        ", a decay product of ": null
    },
    {
        " 238 U": "uranium-238"
    },
    {
        ".  A trace amount of the isotope 218 Rn is also among the daughters of 222 Rn.     Three other radon isotopes have a half-life of over an hour: 211 Rn, 210 Rn and 224 Rn. The 220 Rn isotope is a natural decay product of the most stable thorium isotope , and is commonly referred to as thoron. It has a half-life of 55.6 seconds and also emits ": null
    },
    {
        "alpha radiation": "alpha radiation"
    },
    {
        ". Similarly, 219 Rn is derived from the most stable isotope of ": null
    },
    {
        "actinium": "actinium"
    },
    {
        " —named actinon —and is an alpha emitter with a half-life of 3.96 seconds. No radon isotopes occur significantly in the ": null
    },
    {
        "neptunium": "neptunium"
    },
    {
        " decay series": "neptunium series"
    },
    {
        ", though a trace amount of the isotope 217 Rn is produced.          222 Rn belongs to the radium and uranium-238 decay chain, and has a half-life of 3.8235 days. Its four first products  are very short-lived, meaning that the corresponding disintegrations are indicative of the initial radon distribution. Its decay goes through the following sequence:   222 Rn, 3.82 days, ": null
    },
    {
        "alpha decay": "alpha decay"
    },
    {
        "ing to...   218 ": null
    },
    {
        "Po": "polonium"
    },
    {
        ", 3.10 minutes, alpha decaying to...   214 ": null
    },
    {
        "Pb": "lead"
    },
    {
        ", 26.8 minutes, ": null
    },
    {
        "beta decay": "beta decay"
    },
    {
        "ing to...   214 ": null
    },
    {
        "Bi": "bismuth"
    },
    {
        ", 19.9 minutes, beta decaying to...   214 Po, 0.1643  ms, alpha decaying to...   210 Pb, which has a much longer half-life of 22.3 years, beta decaying to...   210 Bi, 5.013 days, beta decaying to...   210 Po, 138.376 days, alpha decaying to...   206 Pb, stable.     The radon equilibrium factor  is the ratio between the activity of all short-period radon progenies , and the activity that would be at equilibrium with the radon parent.     If a closed volume is constantly supplied with radon, the concentration of short-lived isotopes will increase until an equilibrium is reached where the rate of decay of each decay product will equal that of the radon itself. The equilibrium factor is 1 when both activities are equal, meaning that the decay products have stayed close to the radon parent long enough for the equilibrium to be reached, within a couple of hours. Under these conditions, each additional pCi/L of radon will increase exposure by 0.01   working level  . These conditions are not always met; in many homes, the equilibrium factor is typically 40%; that is, there will be 0.004  WL of daughters for each pCi/L of radon in the air. 210 Pb takes much longer to come in equilibrium with radon, but, if the environment permits accumulation of dust over extended periods of time, 210 Pb and its decay products may contribute to overall radiation levels as well.     Because of their ": null
    },
    {
        "electrostatic charge": "electrostatic charge"
    },
    {
        ", radon progenies adhere to surfaces or dust particles, whereas gaseous radon does not. Attachment removes them from the air, usually causing the equilibrium factor in the atmosphere to be less than 1. The equilibrium factor is also lowered by air circulation or air filtration devices, and is increased by airborne dust particles, including cigarette smoke. The equilibrium factor found in epidemiological studies is 0.4.             Radon was the fifth radioactive element to be discovered, in 1899 by ": null
    },
    {
        "Ernest Rutherford": "ernest rutherford"
    },
    {
        " and ": null
    },
    {
        "Robert B. Owens": "robert b. owens"
    },
    {
        ",  after uranium, thorium, radium, and polonium.     In 1900, ": null
    },
    {
        "Friedrich Ernst Dorn": "friedrich ernst dorn"
    },
    {
        " reported some experiments in which he noticed that radium compounds emanate a radioactive gas he named radium emanation .  Before that, in 1899, ": null
    },
    {
        "Pierre": "pierre curie"
    },
    {
        " and ": null
    },
    {
        "Marie Curie": "marie curie"
    },
    {
        " observed that the gas emitted by radium remained radioactive for a month.  Later that year, Robert B. Owens and Ernest Rutherford, at ": null
    },
    {
        "McGill University": "mcgill university"
    },
    {
        " in ": null
    },
    {
        "Montreal": "montreal"
    },
    {
        ", noticed variations when trying to measure radiation from thorium oxide. : The radiation from thorium oxide was not constant, but varied in a most capricious manner , whereas All the compounds of Uranium give out a radiation which is remarkably constant. Rutherford noticed that the compounds of thorium continuously emit a radioactive gas that retains the radioactive powers for several minutes, and called this gas emanation ,  and later thorium emanation . In 1901, Rutherford and ": null
    },
    {
        "Harriet Brooks": "harriet brooks"
    },
    {
        " demonstrated that the emanations are radioactive, but credited the Curies for the discovery of the element.  In 1903, similar emanations were observed from actinium by ": null
    },
    {
        "André-Louis Debierne": "andré-louis debierne"
    },
    {
        ",   and were called actinium emanation .     Several shortened names were soon suggested for the three emanations: exradio, exthorio, and exactinio in 1904;  radon , thoron , and akton or acton in 1918;  radeon, thoreon, and actineon in 1919,  and eventually radon, thoron, and actinon in 1920.   The likeness of the ": null
    },
    {
        "spectra": "spectral line"
    },
    {
        " of these three gases with those of argon, krypton, and xenon, and their observed chemical inertia led Sir ": null
    },
    {
        "William Ramsay": "william ramsay"
    },
    {
        " to suggest in 1904 that the emanations might contain a new element of the noble-gas family.     In the early part of the 20th century in the US, gold contaminated with the radon daughter 210 Pb entered the jewelry industry. This was from gold seeds that had held 222 Rn that had been melted down after the radon had decayed.       In 1909, ": null
    },
    {
        "Ramsay": "william ramsay"
    },
    {
        " and ": null
    },
    {
        "Robert Whytlaw-Gray": "robert whytlaw-gray"
    },
    {
        " isolated radon and determined its ": null
    },
    {
        "melting temperature": "melting point"
    },
    {
        " and approximate ": null
    },
    {
        "density": "density"
    },
    {
        ". In 1910, they determined that it was the heaviest known gas.  . They wrote that  and suggested the new name niton  to emphasize the radioluminescence property,  and in 1912 it was accepted by the ": null
    },
    {
        "International Commission for Atomic Weights": "commission on isotopic abundances and atomic weights"
    },
    {
        ". In 1923, the International Committee for Chemical Elements and ": null
    },
    {
        "International Union of Pure and Applied Chemistry": "international union of pure and applied chemistry"
    },
    {
        " chose among the names radon , thoron , and actinon . Later, when isotopes were numbered instead of named, the element took the name of the most stable isotope, radon, while Tn was renamed ": null
    },
    {
        " 220 Rn": "radon-220"
    },
    {
        " and An was renamed 219 Rn, which caused some confusion in the literature regarding the elements discovery as while Dorn had discovered radon the isotope, he had not been the first to discover radon the element. As late as the 1960s, the element was also referred to simply as emanation.  The first synthesized compound of radon, radon fluoride, was obtained in 1962.  Even today, the word radon may refer to either the element or its isotope 222 Rn, with thoron remaining in use as a short name for 220 Rn to stem this ambiguity.      The danger of high exposure to radon in mines, where exposures can reach 1,000,000  ": null
    },
    {
        "Bq": "becquerel"
    },
    {
        "/m 3 , has long been known. In 1530, ": null
    },
    {
        "Paracelsus": "paracelsus"
    },
    {
        " described a wasting disease of miners, the mala metallorum, and ": null
    },
    {
        "Georg Agricola": "georg agricola"
    },
    {
        " recommended ventilation in mines to avoid this mountain sickness . Masse, Roland . radon-france.com. , Agency for Toxic Substances and Disease Registry, 2000. In 1879, this condition was identified as lung cancer by Harting and Hesse in their investigation of miners from Schneeberg, Germany. The first major studies with radon and health occurred in the context of uranium mining in the ": null
    },
    {
        "Joachimsthal": "jáchymov"
    },
    {
        " region of ": null
    },
    {
        "Bohemia": "bohemia"
    },
    {
        ". Proctor, Robert N. The Nazi War on Cancer. Princeton University Press, 2000 p. 99. . In the US, studies and mitigation only followed decades of health effects on uranium miners of the ": null
    },
    {
        "Southwestern US": "southwestern united states"
    },
    {
        " employed during the early ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        "; standards were not implemented until 1971. Edelstein, Michael R., William J. Makofske. Radons deadly daughters: science, environmental policy, and the politics of risk. Rowman & Littlefield, 1998, pp. 36–39. .     The presence of radon in indoor air was documented as early as 1950. Beginning in the 1970s, research was initiated to address sources of indoor radon, determinants of concentration, health effects, and mitigation approaches. In the US, the problem of indoor radon received widespread publicity and intensified investigation after a widely publicized incident in 1984. During routine monitoring at a Pennsylvania nuclear power plant, a worker was found to be contaminated with radioactivity. A high concentration of radon in his home was subsequently identified as responsible.                    All discussions of radon concentrations in the environment refer to 222 Rn. While the average rate of production of 220 Rn is about the same as that of 222 Rn, the amount of 220 Rn in the environment is much less than that of 222 Rn because of the short half-life of 220 Rn .     Radon concentration in the atmosphere is usually measured in ": null
    },
    {
        "becquerel": "becquerel"
    },
    {
        " per cubic meter , the ": null
    },
    {
        "SI derived unit": "si derived unit"
    },
    {
        ". Another unit of measurement common in the US is ": null
    },
    {
        "picocuries": "picocurie"
    },
    {
        "per liter ; 1  pCi/L37  Bq/m 3 .  Typical domestic exposures average about 48  Bq/m 3 indoors, though this varies widely, and 15  Bq/m 3 outdoors.     In the mining industry, the exposure is traditionally measured in  working level  , and the cumulative exposure in working level month ; 1  WL equals any combination of short-lived 222 Rn daughters in 1 liter of air that releases 1.3  ×  10 5  MeV of potential alpha energy; 1 WL is equivalent to 2.08  ×  10 −5 joules per cubic meter of air . The SI unit of cumulative exposure is expressed in joule-hours per cubic meter . One WLM is equivalent to 3.6  ×  10 −3 J·h/m 3 . An exposure to 1  WL for 1 working-month equals 1  WLM cumulative exposure. A cumulative exposure of 1  WLM is roughly equivalent to living one year in an atmosphere with a radon concentration of 230  Bq/m 3 . . CEA. 12 April 2005.     222 Rn decays to 210 Pb and other radioisotopes. The levels of 210 Pb can be measured. The rate of deposition of this radioisotope is weather-dependent.     Radon concentrations found in natural environments are much too low to be detected by chemical means. A 1,000  Bq/m 3 concentration corresponds to 0.17  ": null
    },
    {
        "picogram": "pico-"
    },
    {
        " per cubic meter . The average concentration of radon in the atmosphere is about 6 ": null
    },
    {
        "molar percent": "molar percent"
    },
    {
        ", or about 150 atoms in each milliliter of air.  The radon activity of the entire Earths atmosphere originates from only a few tens of grams of radon, consistently replaced by decay of larger amounts of radium, thorium, and uranium.             Radon is produced by the radioactive decay of radium-226, which is found in uranium ores, phosphate rock, shales, igneous and metamorphic rocks such as granite, gneiss, and schist, and to a lesser degree, in common rocks such as limestone. Every square mile of surface soil, to a depth of 6  inches , contains approximately 1  gram of radium, which releases radon in small amounts to the atmosphere. On a global scale, it is estimated that 2.4 billion curies of radon are released from soil annually. Harley, J. H. in      Radon concentration can differ widely from place to place. In the open air, it ranges from 1 to 100  Bq/m 3 , even less above the ocean. In caves or ventilated mines, or poorly ventilated houses, its concentration climbs to 20–2,000  Bq/m 3 .      Radon concentration can be much higher in mining contexts. Ventilation regulations instruct to maintain radon concentration in uranium mines under the working level , with 95th percentile levels ranging up to nearly 3  WL .   The concentration in the air at the ": null
    },
    {
        "Gastein": "bad gastein"
    },
    {
        " Healing Gallery averages 43  kBq/m 3 with maximal value of 160  kBq/m 3 .      Radon mostly appears with the decay chain of the radium and ": null
    },
    {
        "uranium": "uranium"
    },
    {
        " series , and marginally with the thorium series . The element emanates naturally from the ground, and some building materials, all over the world, wherever traces of uranium or thorium can be found, and particularly in regions with soils containing ": null
    },
    {
        "granite": "granite"
    },
    {
        " or ": null
    },
    {
        "shale": "shale"
    },
    {
        ", which have a higher concentration of uranium. Not all granitic regions are prone to high emissions of radon. Being a rare gas, it usually migrates freely through faults and fragmented soils, and may accumulate in caves or water. Owing to its very short half-life , radon concentration decreases very quickly when the distance from the production area increases. Radon concentration varies greatly with season and atmospheric conditions. For instance, it has been shown to accumulate in the air if there is a ": null
    },
    {
        "meteorological inversion": "inversion"
    },
    {
        " and little wind.      High concentrations of radon can be found in some spring waters and hot springs.  The towns of ": null
    },
    {
        "Boulder, Montana": "boulder, montana"
    },
    {
        "; ": null
    },
    {
        "Misasa": "misasa, tottori"
    },
    {
        "; ": null
    },
    {
        "Bad Kreuznach": "bad kreuznach"
    },
    {
        ", Germany; and the country of Japan have radium-rich springs that emit radon. To be classified as a radon mineral water, radon concentration must be above 2  nCi/L .  The activity of radon mineral water reaches 2,000  kBq/m 3 in Merano and 4,000  kBq/m 3 in Lurisia .     Natural radon concentrations in the ": null
    },
    {
        "Earths atmosphere": "earths atmosphere"
    },
    {
        " are so low that radon-rich water in contact with the atmosphere will continually lose radon by ": null
    },
    {
        "volatilization": "volatilization"
    },
    {
        ". Hence, ": null
    },
    {
        "ground water": "ground water"
    },
    {
        " has a higher concentration of 222 Rn than ": null
    },
    {
        "surface water": "surface water"
    },
    {
        ", because radon is continuously produced by radioactive decay of 226 Ra present in rocks. Likewise, the ": null
    },
    {
        "saturated zone": "aquifer"
    },
    {
        " of a soil frequently has a higher radon content than the ": null
    },
    {
        "unsaturated zone": "vadose zone"
    },
    {
        " because of ": null
    },
    {
        "diffusion": "diffusion"
    },
    {
        "al losses to the atmosphere.       In 1971, ": null
    },
    {
        "Apollo 15": "apollo 15"
    },
    {
        " passed  above the ": null
    },
    {
        "Aristarchus plateau": "aristarchus"
    },
    {
        " on the ": null
    },
    {
        "Moon": "moon"
    },
    {
        ", and detected a significant rise in ": null
    },
    {
        "alpha particles": "alpha particle"
    },
    {
        "thought to be caused by the decay of 222 Rn. The presence of 222 Rn has been inferred later from data obtained from the ": null
    },
    {
        "Lunar Prospector": "lunar prospector"
    },
    {
        " alpha particle spectrometer.      Radon is found in some ": null
    },
    {
        "petroleum": "petroleum"
    },
    {
        ". Because radon has a similar pressure and temperature curve to ": null
    },
    {
        "propane": "propane"
    },
    {
        ", and ": null
    },
    {
        "oil refineries": "oil refineries"
    },
    {
        " separate petrochemicals based on their boiling points, the piping carrying freshly separated propane in oil refineries can become radioactive because of decaying radon and its products.      Residues from the petroleum and ": null
    },
    {
        "natural gas": "natural gas"
    },
    {
        " industry often contain radium and its daughters. The sulfate scale from an ": null
    },
    {
        "oil well": "oil well"
    },
    {
        " can be radium rich, while the water, oil, and gas from a well often contains radon. Radon decays to form solid radioisotopes that form coatings on the inside of pipework.               High concentrations of radon in homes were discovered by chance in 1985 after the stringent radiation testing conducted at a nuclear power plant entrance revealed that ": null
    },
    {
        "Stanley Watras": "health effects of radonstanley watras"
    },
    {
        ", an engineer at the plant, was contaminated by radioactive substances.  Typical domestic exposures are of approximately 100  Bq/m 3 indoors. Some level of radon will be found in all buildings. Radon mostly enters a building directly from the soil through the lowest level in the building that is in contact with the ground. High levels of radon in the water supply can also increase indoor radon air levels. Typical entry points of radon into buildings are cracks in solid foundations and walls, construction joints, gaps in suspended floors and around service pipes, cavities inside walls, and the water supply.  Radon concentrations in the same location may differ by a factor of two over a period of one hour. Also, the concentration in one room of a building may be significantly different from the concentration in an adjoining room. The soil characteristics of the dwellings are the most important source of radon for the ground floor and higher concentration of indoor radon observed on lower floors. Most of the high radon concentrations have been reported from places near ": null
    },
    {
        "fault zones": "fault"
    },
    {
        "; hence the existence of a relation between the exhalation rate from faults and indoor radon concentrations is obvious.     The distribution of radon concentrations will generally differ from room to room, and the readings are averaged according to regulatory protocols. Indoor radon concentration is usually assumed to follow a ": null
    },
    {
        "lognormal distribution": "lognormal distribution"
    },
    {
        " on a given territory. Numerous references, see, for instance,  or  for a discussion. Thus, the ": null
    },
    {
        "geometric mean": "geometric mean"
    },
    {
        " is generally used for estimating the average radon concentration in an area.      The mean concentration ranges from less than 10  Bq/m 3 to over 100  Bq/m 3 in some European countries.  Typical ": null
    },
    {
        "geometric standard deviations": "geometric standard deviation"
    },
    {
        "found in studies range between 2 and 3, meaning  that the radon concentration is expected to be more than a hundred times the mean concentration for 2 to 3% of the cases.     Some of the highest radon hazard in the US is found in ": null
    },
    {
        "Iowa": "iowa"
    },
    {
        " and in the ": null
    },
    {
        "Appalachian Mountain": "appalachian mountains"
    },
    {
        " areas in southeastern Pennsylvania.  Iowa has the highest average radon concentrations in the US due to significant ": null
    },
    {
        "glaciation": "glaciation"
    },
    {
        " that ground the granitic rocks from the ": null
    },
    {
        "Canadian Shield": "canadian shield"
    },
    {
        " and deposited it as soils making up the rich Iowa farmland.  Many cities within the state, such as ": null
    },
    {
        "Iowa City": "iowa city"
    },
    {
        ", have passed requirements for radon-resistant construction in new homes. The second highest readings in Ireland were found in office buildings in the Irish town of ": null
    },
    {
        "Mallow, County Cork": "mallow, county cork"
    },
    {
        ", prompting local fears regarding lung cancer.      In a few locations, ": null
    },
    {
        "uranium tailings": "uranium tailings"
    },
    {
        " have been used for ": null
    },
    {
        "landfills": "landfills"
    },
    {
        " and were subsequently built on, resulting in possible increased exposure to radon.     Since radon is a colorless, odorless gas, the only way to know how much is present in the air or water is to perform tests. In the US, radon test kits are available to the public at retail stores, such as hardware stores, for home use, and testing is available through licensed professionals, who are often ": null
    },
    {
        "home inspector": "home inspector"
    },
    {
        "s. Efforts to reduce indoor radon levels are called ": null
    },
    {
        "radon mitigation": "radon mitigation"
    },
    {
        ". In the US, the EPA recommends all houses be tested for radon.       Radon is obtained as a by-product of ": null
    },
    {
        "uraniferous ores": "uranium ore deposits"
    },
    {
        " processing after transferring into 1% solutions of ": null
    },
    {
        "hydrochloric": "hydrochloric acid"
    },
    {
        " or ": null
    },
    {
        "hydrobromic acid": "hydrobromic acid"
    },
    {
        "s. The gas mixture extracted from the solutions contains , , He, Rn, ,  and ": null
    },
    {
        "hydrocarbon": "hydrocarbon"
    },
    {
        "s. The mixture is purified by passing it over copper at  to remove the  and the , and then ": null
    },
    {
        "KOH": "potassium hydroxide"
    },
    {
        " and  are used to remove the acids and moisture by ": null
    },
    {
        "sorption": "sorption"
    },
    {
        ". Radon is condensed by liquid nitrogen and purified from residue gases by ": null
    },
    {
        "sublimation": "sublimation"
    },
    {
        ".      Radon commercialization is regulated, but it is available in small quantities for the calibration of 222 Rn measurement systems, at a price, in 2008, of almost  per milliliter of radium solution .    Radon is produced by a solution of radium-226 . Radium-226 decays by alpha-particle emission, producing radon that collects over samples of radium-226 at a rate of about 1  mm 3 /day per gram of radium; equilibrium is quickly achieved and radon is produced in a steady flow, with an activity equal to that of the radium . Gaseous 222 Rn escapes from the capsule through ": null
    },
    {
        "diffusion": "diffusion"
    },
    {
        ".         ref  /ref ref name Radon seeds  /ref  ref  /ref ref nameHg  /ref  ref  /ref  ref nameHg/ ref  /ref  ref name Radon seeds / sup /sup sup /sup sup /sup  ref  /ref  ref  /ref  ref  /ref ref /ref ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref ref  /ref  ref  /ref ref  /ref ref  /ref ref name Darby05 / ref nameUNSCEAR06  /ref ref  /ref  ref  /ref  ref name epa  /ref  ref  /ref ref  /ref ref  /ref ref  /ref sup /sup ref  /ref ref name Darby05 / ref  /ref ref name Darby05  /ref ref nameCatelinois  /ref sup /sup sup /sup ref  /ref sup /sup ref name EPA radon  /ref  sup /sup sup /sup ref  /ref sup /sup sup /sup ref name HPA radon  /ref  ref name epa /  ref name bmj38308  /ref ref name bmj38308 /  ref name bmj38308 / ref  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref ref  /ref sup /sup ref name Thad. Godish 2001  /ref  ref nameepa / ref  /ref ref name Thad. Godish 2001 / ref nameepa / ref nameUSPHS90/ ref nameepa / ref nameepa/ ref name WHO291  /ref ref name epa / ref name epa.gov  /ref  ref nameepa/ ref ": null
    }
]