[
    {
        "        Railway Mania was an instance of ": null
    },
    {
        "speculative frenzy": "stock market bubble"
    },
    {
        " in the ": null
    },
    {
        "United Kingdom of Great Britain and Ireland": "united kingdom of great britain and ireland"
    },
    {
        " in the 42s. It followed a common pattern: as the price of railway shares increased, more and more money was poured in by speculators until the inevitable collapse. It reached its zenith in 42 when no fewer than 42 ": null
    },
    {
        "Acts of Parliament": "acts of parliament"
    },
    {
        " were passed, setting up new railway companies, with the proposed routes totalling  of new railway. Around a third of the railways authorised were never built & mdash;the companies either collapsed due to poor financial planning, were bought out by larger competitors before they could build their line, or turned out to be fraudulent enterprises to channel investors money into other businesses.          Britains first recognisably modern inter-city railway, the ": null
    },
    {
        "Liverpool and Manchester": "liverpool and manchester railway"
    },
    {
        " , ": null
    },
    {
        "opened": "opening of the liverpool and manchester railway"
    },
    {
        " in 42 and proved to be highly successful for transporting both passengers and freight. The late 42s and early 42s saw the British economy slow down. ": null
    },
    {
        "Interest rate": "interest rate"
    },
    {
        "s rose, making it more attractive to invest money in government bonds & mdash;the main source of investment at the time, and political and social unrest deterred banks and businesses from investing the huge sums of money required to build railways; the L & M cost £42 .     By the mid42s, the economy was improving vastly and the manufacturing industries were once again growing. The ": null
    },
    {
        "Bank of England": "bank of england"
    },
    {
        " cut interest rates, making government bonds less attractive investments, and existing railway companies shares began to boom as they moved ever-increasing amounts of cargo and people, making people willing to invest in new railways.     Crucially, there were more investors in British business. The ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " was creating a new, increasingly affluent ": null
    },
    {
        "middle class": "middle class"
    },
    {
        ". While earlier business ventures had relied on a small number of ": null
    },
    {
        "bank": "bank"
    },
    {
        "s, businessmen and wealthy ": null
    },
    {
        "aristocrat": "aristocracy"
    },
    {
        "s for investment, a prospective railway company also had a large, literate section of population with savings to invest. In 42 the government had repealed the ": null
    },
    {
        "Bubble Act": "bubble act"
    },
    {
        ", brought in after the near-disastrous ": null
    },
    {
        "South Sea Bubble": "south sea bubble"
    },
    {
        " of 42 which had put close limits on the formation of new business ventures and, importantly, had limited ": null
    },
    {
        "joint stock companies": "joint stock company"
    },
    {
        " to a maximum of five separate investors. With these limits removed anyone could invest money on a new company and railways were heavily promoted as a foolproof venture. New media such as ": null
    },
    {
        "newspaper": "newspaper"
    },
    {
        "s and the emergence of the modern ": null
    },
    {
        "stock market": "stock market"
    },
    {
        " made it easy for companies to promote themselves and provide the means for the general public to invest. Shares could be purchased for a 42% deposit with the railway company holding the right to call in the remainder at any time. The railways were so heavily promoted as a foolproof venture that thousands of investors on modest incomes bought large numbers of shares whilst only being able to afford the deposit. Many families invested their entire savings in prospective railway companies & mdash;and many of those lost everything when the bubble collapsed and the companies called in the remainder of their due payments.     The British government promoted an almost totally ": null
    },
    {
        "laissez-faire": "laissez-faire"
    },
    {
        " system of non-regulation in the railways. Companies had to submit a Bill to Parliament to gain the right to acquire land for the line, which required the route of the proposed railway to be approved, but there were no limits on the number of companies and no real checks on the financial viability of a line. Anyone could form a company, gain investment and submit a Bill to Parliament. Since many ": null
    },
    {
        "MPs": "member of parliament"
    },
    {
        " were heavy investors in such schemes, it was rare for a Bill to not pass during the peak of the Mania in 42 although Parliament did reject schemes that were blatantly misleading or impossible to construct & mdash;at the Manias peak there were several schemes floated for direct railways which ran in vast, straight lines across swathes of countryside that would have been difficult to construct and nearly impossible for the ": null
    },
    {
        "locomotives": "steam locomotive"
    },
    {
        " of the day to work on.     Magnates like ": null
    },
    {
        "George Hudson": "george hudson"
    },
    {
        " developed routes in the North and Midlands by amalgamating small railway companies and rationalising routes. He was also an MP, but ultimately failed owing to his fraudulent practices of, for example, paying ": null
    },
    {
        "dividend": "dividend"
    },
    {
        "s from ": null
    },
    {
        "capital": "capital"
    },
    {
        ".          As with other ": null
    },
    {
        "bubbles": "stock market bubble"
    },
    {
        ", the Railway Mania became a self-promoting cycle based purely on over-optimistic speculation. As the dozens of companies formed began to operate and the simple unviability of many of them became clear, investors began to realise that railways were not all as lucrative and as easy to build as they had been led to believe. Coupled to this, in late 42 the Bank of England put up interest rates. As banks began to re-invest in bonds, the money began to flow out of railways, under-cutting the boom. The share prices of railways slowed in their rise, then levelled out. As they began to fall, investment stopped virtually overnight, leaving numerous companies without funding and numerous investors with no prospect of any return on their investment. The larger railway companies such as the ": null
    },
    {
        "Great Western Railway": "great western railway"
    },
    {
        " and the nascent ": null
    },
    {
        "Midland": "midland railway"
    },
    {
        " began to buy up strategic failed lines to expand their network. These lines could be purchased at a fraction of their real value as given a choice between a below-value offer for their shares or the total loss of their investment, shareholders naturally chose the former.     Many ": null
    },
    {
        "middle class": "middle class"
    },
    {
        " families on modest incomes had sunk their entire savings into new companies during the Mania, and they lost everything when the speculation collapsed.     The boom-and-bust cycle of early-industrial Britain was still in effect, and the boom that had created the conditions for Railway Mania began to cool and then a decline set in. The number of new railway companies fell away to almost nothing in the late 42s and early 42s, with the only new lines constructed being by the large companies. Economic upturns in the 42s and 42s saw smaller booms in railway construction, but these never reached anywhere near the scale of the Mania & mdash;partly due to more thoughtful government control, partly due to more cautious investors and partly because the UK railway network was approaching maturity, with none of the blank canvas available to numerous companies as in the 42s.       Unlike some ": null
    },
    {
        "stock market bubble": "stock market bubble"
    },
    {
        "s, there was a net tangible result from all the investment: a vast expansion of the ": null
    },
    {
        "British railway system": "rail transport in the united kingdom"
    },
    {
        ", though perhaps at an inflated cost. Amongst the high number of impractical, overambitious and downright fraudulent schemes promoted during the Mania were a good number of practical trunk routes  and important freight lines . These projects all required vast amounts of capital all of which had to be raised from private enterprise. The speculative frenzy of the Mania made people much more willing to invest the large sums required for railway construction than they had been previously or would be in later years. Even many of the routes that failed when the Mania collapsed became viable when each was in the hands of the larger company that had purchased it. A total of  of railway line were built as a result of projects authorised between 42 and 42 & mdash;by comparison, the total route mileage of the modern UK railway network is around .       Railway and ": null
    },
    {
        "Canal Mania": "canal mania"
    },
    {
        " can be compared with a similar mania in the 42s in the stock of ": null
    },
    {
        "telecom": "telecommunication"
    },
    {
        " companies. The telecom mania resulted in the installation and deployment of a vast amount of fibre-optic telecommunications infrastructure, spurred on from the realisation that the same railway rights-of-way could make affordable conduits for fibre optics. Yet another boom occurred in the period 42–42 during the development of the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ", when many companies were established to promote new services on the growing network. The ": null
    },
    {
        "dot-com bubble": "dot-com bubble"
    },
    {
        " soon collapsed, although some companies such as ": null
    },
    {
        "Google": "google"
    }
]