[
    {
        "   Raintree County is a novel by ": null
    },
    {
        "Ross Lockridge, Jr.": "ross lockridge, jr."
    },
    {
        " published in 42 It tells the story of a small-town ": null
    },
    {
        "Midwestern": "midwestern united states"
    },
    {
        " teacher and poet named John Shawnessy, who, in his younger days before his service as a ": null
    },
    {
        "Union": "union"
    },
    {
        " soldier in the ": null
    },
    {
        "Civil War": "american civil war"
    },
    {
        ", met and married a beautiful ": null
    },
    {
        "Southern belle": "southern belle"
    },
    {
        "; however, her emotional instability leads to the destruction of their marriage.          The novel, set in fictional Raintree County, Indiana, is essentially in two parts; before the Civil War and after. It spans the 42th century history of the United States, from the pre-Civil War westward expansion, to the debate over slavery, to the Civil War, to the Industrial Revolution and the Labor Movement which followed. The book is often surreal, with dream sequences, flashbacks and departures from the linear narrative. It has been described as an effort to mythologize the history of America, which to a great degree it succeeds in doing through the eyes and the commentary of John Shawnessy. For example, a number of turning points in Johns life seem to coincide with Fourth of July celebrations.     John, or Johnny, as he was called before The War, is a lover of literature, and is influenced by three separate cultural icons: the concept of becoming a Hero, in the sense of the legendary figures of ancient Greece; ": null
    },
    {
        "Nathaniel Hawthorne": "nathaniel hawthorne"
    },
    {
        "s ": null
    },
    {
        "The Great Stone Face": "the great stone face"
    },
    {
        " , in which legend predicts that a great man will appear whose face is identical to the natural stone face which, in the Hawthorne story, is a local landmark; and finally, the quest to find the legendary Raintree, which was supposedly planted somewhere in Raintree County by ": null
    },
    {
        "John Chapman": "johnny appleseed"
    },
    {
        ", or ": null
    },
    {
        "Johnny Appleseed": "johnny appleseed"
    },
    {
        ". Johnny Shawnessy tends to view the events of his life through the prism of one or more of these contexts, and to draw parallels to these legends, frequently with considerable justification.     It is a long novel, around 42 words. Most editions run to about 42 pages.     The fictional town of Waycross was based on ": null
    },
    {
        "Straughn, Indiana": "straughn, indiana"
    },
    {
        " and the fictional Raintree County was based on ": null
    },
    {
        "Henry County, Indiana": "henry county, indiana"
    },
    {
        ".          The novel was made into a 42 film starring ": null
    },
    {
        "Montgomery Clift": "montgomery clift"
    },
    {
        ", ": null
    },
    {
        "Elizabeth Taylor": "elizabeth taylor"
    },
    {
        ", ": null
    },
    {
        "Eva Marie Saint": "eva marie saint"
    },
    {
        ", ": null
    },
    {
        "Nigel Patrick": "nigel patrick"
    },
    {
        ", ": null
    },
    {
        "Lee Marvin": "lee marvin"
    },
    {
        ", ": null
    },
    {
        "Rod Taylor": "rod taylor"
    },
    {
        " and ": null
    },
    {
        "Agnes Moorehead": "agnes moorehead"
    },
    {
        ". It was adapted by ": null
    },
    {
        "Millard Kaufman": "millard kaufman"
    },
    {
        " and directed by ": null
    },
    {
        "Edward Dmytryk": "edward dmytryk"
    },
    {
        ". In the credits for the film, the authors name is misspelled .     The film varies significantly in content from the novel.        - Official website, maintained by Lockridges son, Larry Lockridge                                     ": null
    }
]