[
    {
        "               Rajiv Gandhi  was an Indian politician who served as the 6th ": null
    },
    {
        "Prime Minister of India": "List Of Prime Ministers Of India"
    },
    {
        " from 1984 to 1989. He took office after the ": null
    },
    {
        "1984 assassination": "Assassination Of Indira Gandhi"
    },
    {
        " of his mother, Prime Minister ": null
    },
    {
        "Indira Gandhi": "Indira Gandhi"
    },
    {
        ", to become the youngest Indian Prime Minister at the age of 40.     Gandhi was a ": null
    },
    {
        "scion": "Lineal Descendant"
    },
    {
        " of the politically powerful ": null
    },
    {
        "Nehru–Gandhi family": "Nehru–Gandhi Family"
    },
    {
        ", which had been associated with the ": null
    },
    {
        "Indian National Congress": "Indian National Congress"
    },
    {
        " party. For much of his childhood, his maternal grandfather ": null
    },
    {
        "Jawaharlal Nehru": "Jawaharlal Nehru"
    },
    {
        " was Prime Minister. Gandhi attended college in the United Kingdom. He returned to India in 1966 and became a professional pilot for the state-owned ": null
    },
    {
        "Indian Airlines": "Indian Airlines"
    },
    {
        ". In 1968, he married ": null
    },
    {
        "Sonia Gandhi": "Sonia Gandhi"
    },
    {
        "; the couple settled in Delhi to a domestic life with their children ": null
    },
    {
        "Rahul Gandhi": "Rahul Gandhi"
    },
    {
        " and ": null
    },
    {
        "Priyanka Gandhi Vadra": "Priyanka Gandhi Vadra"
    },
    {
        ". For much of the 1970s, his mother ": null
    },
    {
        "Indira Gandhi": "Indira Gandhi"
    },
    {
        " was prime minister and his brother ": null
    },
    {
        "Sanjay Gandhi": "Sanjay Gandhi"
    },
    {
        " an MP; despite this, Rajiv Gandhi remained apolitical. After Sanjays death in a fighter plane crash in 1980, Gandhi reluctantly entered politics at the behest of Indira. The following year he won his brothers Parliamentary seat of ": null
    },
    {
        "Amethi": "Amethi"
    },
    {
        " and became a member of the ": null
    },
    {
        "Lok Sabha": "Lok Sabha"
    },
    {
        "—the lower house of ": null
    },
    {
        "Indias Parliament": "Parliament Of India"
    },
    {
        ". As part of his political grooming, Rajiv was made general secretary of the Congress party and given significant responsibility in organising the ": null
    },
    {
        "1982 Asian Games": "1982 Asian Games"
    },
    {
        ".     On the morning of 31 October 1984, his mother was assassinated by one of her bodyguards; later that day, Gandhi was appointed Prime Minister. His leadership was tested over the next few days as organised mobs ": null
    },
    {
        "rioted against the Sikh community": "1984 Anti-Sikh Riots"
    },
    {
        ", resulting in anti-Sikh riots in Delhi. That December, Congress party won the largest Lok Sabha majority to date, ": null
    },
    {
        "411 seats out of 542": "1984 Indian General Election"
    },
    {
        ". Rajiv Gandhis period in office was mired in controversies; perhaps the greatest crises were the ": null
    },
    {
        "Bhopal disaster": "Bhopal Disaster"
    },
    {
        ", ": null
    },
    {
        "Bofors scandal": "Bofors Scandal"
    },
    {
        " and the ": null
    },
    {
        "Shah Bano case": "Shah Bano Case"
    },
    {
        ". In 1988, he reversed the ": null
    },
    {
        "coup in Maldives": "1988 Maldives Coup"
    },
    {
        ", antagonising militant Tamil groups such as ": null
    },
    {
        "PLOTE": "Peoples Liberation Organisation Of Tamil Eelam"
    },
    {
        ", intervening and then sending ": null
    },
    {
        "peacekeeping": "Indian Peace Keeping Force"
    },
    {
        " troops to Sri Lanka in 1987, leading to open conflict with the ": null
    },
    {
        "Liberation Tigers of Tamil Eelam": "Liberation Tigers Of Tamil Eelam"
    },
    {
        " . In mid-1987, the ": null
    },
    {
        "Bofors scandal": "Bofors Scandal"
    },
    {
        " damaged his corruption-free image and resulted in a major defeat for his party in the ": null
    },
    {
        "1989 election": "1989 Indian General Election"
    },
    {
        ".     Gandhi remained ": null
    },
    {
        "Congress President": "Congress President"
    },
    {
        " until the ": null
    },
    {
        "elections in 1991": "1991 Indian General Election"
    },
    {
        ". While campaigning for the elections, ": null
    },
    {
        "he was assassinated": "Assassination Of Rajiv Gandhi"
    },
    {
        " by a suicide bomber from the LTTE. His widow Sonia became the president of the Congress party in 1998 and led the party to victory in the 2004 and 2009 parliamentary elections. His son Rahul Gandhi is a Member of Parliament and the current President of Indian National Congress. In 1991, Indian government posthumously awarded Gandhi the ": null
    },
    {
        "Bharat Ratna": "Bharat Ratna"
    },
    {
        ", the countrys highest civilian award. At the India Leadership Conclave in 2009, the Revolutionary Leader of Modern India award was conferred posthumously on Gandhi.              Rajiv Gandhi was born in ": null
    },
    {
        "Bombay": "Bombay"
    },
    {
        " on 20 August 1944 to ": null
    },
    {
        "Indira": "Indira Gandhi"
    },
    {
        " and ": null
    },
    {
        "Feroze Gandhi": "Feroze Gandhi"
    },
    {
        ". In 1951, Rajiv and Sanjay were admitted to Shiv Niketan school, where the teachers said Rajiv was shy and introverted, and greatly enjoyed painting and drawing .      He was admitted to the ": null
    },
    {
        "Welham Boys School": "Welham Boys School"
    },
    {
        ", ": null
    },
    {
        "Dehradun": "Dehradun"
    },
    {
        " and ": null
    },
    {
        "Doon School": "Doon School"
    },
    {
        ", ": null
    },
    {
        "Dehradun": "Dehradun"
    },
    {
        " in 1954, where Sanjay joined him two years later. Agarwal, p. 17 Rajiv was sent to London in 1961 to study ": null
    },
    {
        "A-level": "A-Level"
    },
    {
        "s. From 1962 to 1965 he studied engineering at ": null
    },
    {
        "Trinity College, Cambridge": "Trinity College, Cambridge"
    },
    {
        ", but did not obtain a degree.  In 1966 he began a course in mechanical engineering at ": null
    },
    {
        "Imperial College London": "Imperial College London"
    },
    {
        ", but did not complete it. Gandhi really was not studious enough, as he went on to admit later. GANDHI, Rajiv, Who Was Who, A & C Black, an imprint of Bloomsbury Publishing plc, 1920–2016; online edn, Oxford University Press, 2014; online edn, April 2014      Gandhi returned to India in 1966, the year his mother became ": null
    },
    {
        "Prime Minister": "Prime Minister"
    },
    {
        ". He went to Delhi and became a member of the ": null
    },
    {
        "Flying Club": "Flying Club"
    },
    {
        ", where he was trained as a pilot. In 1970, he was employed as a pilot by ": null
    },
    {
        "Air India": "Air India"
    },
    {
        "; unlike Sanjay, he did not exhibit any interest of joining politics. Agarwal, p. 18 In 1968, after three years of courtship, he married ": null
    },
    {
        "Edvige Antonia Albina Màino": "Sonia Gandhi"
    },
    {
        ", who changed her name to Sonia Gandhi and made India her home. Their first child, a son, ": null
    },
    {
        "Rahul Gandhi": "Rahul Gandhi"
    },
    {
        " was born in 1970. In 1972, the couple had a daughter, ": null
    },
    {
        "Priyanka Gandhi": "Priyanka Gandhi"
    },
    {
        ", who married ": null
    },
    {
        "Robert Vadra": "Robert Vadra"
    },
    {
        ". Khan, p. 76       On 23 June 1980, Rajivs younger brother ": null
    },
    {
        "Sanjay Gandhi": "Sanjay Gandhi"
    },
    {
        " died unexpectedly in an ": null
    },
    {
        "aeroplane": "Aeroplane"
    },
    {
        " crash. At that time, Rajiv Gandhi was in London as part of his foreign tour. Hearing the news, he returned to Delhi and cremated Sanjays body. Agarwal, p. 20 As per Agarwal, in the week following Sanjays death, Shankaracharya Swami Shri Swaroopanand, a saint from ": null
    },
    {
        "Badrinath": "Badrinath"
    },
    {
        ", visited the familys house to offer his condolences. Agarwal, p. 21 He advised Rajiv not to fly aeroplanes and instead dedicate himself to the service of the nation . Agarwal, p. 22 70 members of the Congress party signed a proposal and went to Indira, urging Rajiv to enter politics. Indira told them it was Rajivs decision whether to enter politics. When he was questioned about it, he replied, If my mother gets help from it, then I will enter politics . Rajiv entered politics on 16 February 1981, when he addressed a national farmers rally in Delhi. Agarwal, p. 23 During this time, he was still an employee of Air India.        On 4 May 1981, Indira Gandhi presided over a meeting of the ": null
    },
    {
        "All India Congress Committee": "All India Congress Committee"
    },
    {
        ". ": null
    },
    {
        "Vasantdada Patil": "Vasantdada Patil"
    },
    {
        " proposed Rajiv as a candidate for the ": null
    },
    {
        "Amethi constituency": "Amethi"
    },
    {
        ", which was accepted by all members at the meeting. A week later, the party officially announced his candidacy for the constituency. He then paid the party membership fees of the party and flew to ": null
    },
    {
        "Sultanpur": "Sultanpur, Uttar Pradesh"
    },
    {
        " to file his nomination papers and completed other formalities. Agarwal, p. 24 He won the seat, defeating ": null
    },
    {
        "Lok Dal": "Lok Dal"
    },
    {
        " candidate ": null
    },
    {
        "Sharad Yadav": "Sharad Yadav"
    },
    {
        " by a margin of 237,000 votes.  He took his oath on 17 August as ": null
    },
    {
        "Member of Parliament": "Member Of Parliament"
    },
    {
        ".     Rajiv Gandhis first political tour was to England, where he attended the wedding ceremony of ": null
    },
    {
        "Prince Charles": "Prince Charles"
    },
    {
        " and ": null
    },
    {
        "Lady Diana Spencer": "Diana, Princess Of Wales"
    },
    {
        " on 29 July 1981. Agarwal, p. 25 In December the same year, he was put in charge of the ": null
    },
    {
        "Indian Youth Congress": "Indian Youth Congress"
    },
    {
        ". He first showed his organisational ability by working round the clock on the ": null
    },
    {
        "1982 Asian Games": "1982 Asian Games"
    },
    {
        ". He was one of 33 members of the Indian parliament who were part of the Games organising committee; sports historian ": null
    },
    {
        "Boria Majumdar": "Boria Majumdar"
    },
    {
        " writes that being son of the prime minister he had a moral and unofficial authority over the others.  The report submitted by the Asian Games committee mentions Gandhis drive, zeal and initiative for the outstanding success of the games.                  On 31 October 1984, the Prime Minister, Rajiv Gandhis mother Indira Gandhi, was assassinated by her Sikh bodyguards, which led to violent riots against Sikhs. At a Boat Club rally 19 days after the assassination, Gandhi said, Some riots took place in the country following the murder of Indiraji. We know the people were very angry and for a few days it seemed that India had been shaken. But, when a mighty tree falls, it is only natural that the earth around it does shake a little .  According to Verinder Grover, the statement made by Gandhi was a virtual justification of the riots.  Congress leader ": null
    },
    {
        "Mani Shankar Aiyar": "Mani Shankar Aiyar"
    },
    {
        " wrote, Did it constitute an incitement to mass murder? He also criticised Gandhi for his reluctance to bring the army from ": null
    },
    {
        "Meerut": "Meerut"
    },
    {
        " to handle the mob. Aiyar, p. 194       Rajiv Gandhi was in West Bengal on 31 October 1984 when his mother, Prime Minister Indira Gandhi, was assassinated by two of her Sikh bodyguards, ": null
    },
    {
        "Satwant Singh": "Satwant Singh"
    },
    {
        " and ": null
    },
    {
        "Beant Singh": "Beant Singh"
    },
    {
        ", to avenge the military attack on the ": null
    },
    {
        "Golden Temple": "Harmandir Sahib"
    },
    {
        " during ": null
    },
    {
        "Operation Blue Star": "Operation Blue Star"
    },
    {
        ". Sardar Buta Singh and President ": null
    },
    {
        "Zail Singh": "Zail Singh"
    },
    {
        " pressed Rajiv to succeed his mother as Prime Minister within hours of her murder. Commenting on the anti-Sikh riots in Delhi, Rajiv Gandhi said, When a giant tree falls, the earth below shakes ;  a statement for which he was widely criticised. Many Congress politicians were accused of orchestrating the violence.           Soon after assuming office, Gandhi asked President Singh to dissolve Parliament and hold fresh elections, as the Lok Sabha had completed its five-year term. Gandhi officially became the President of the Congress party, which won a landslide victory with the largest majority in history of the Indian Parliament, giving Gandhi absolute control of government. He benefited from his youth and a general perception of being free of a background in corrupt politics.  Gandhi took his oath on 31 December 1984; at 40, he was the youngest Prime Minister of India. Historian Meena Agarwal writes that even after taking the Prime Ministerial oath, he was a relatively unknown figure, novice in politics as he assumed the post after being an MP for three years. Agarwal, p. 28          After his swearing-in as Prime Minister, Gandhi appointed his fourteen-member cabinet. He said he would monitor their performance and would fire ministers who do not come to the mark . From the ": null
    },
    {
        "Third Indira Gandhi ministry": "Third Indira Gandhi Ministry"
    },
    {
        ", he removed two powerful figures; Finance Minister ": null
    },
    {
        "Pranab Mukherjee": "Pranab Mukherjee"
    },
    {
        " and Railway Minister ": null
    },
    {
        "A. B. A. Ghani Khan Choudhury": "A. B. A. Ghani Khan Choudhury"
    },
    {
        ". ": null
    },
    {
        "Mohsina Kidwai": "Mohsina Kidwai"
    },
    {
        " became the Minister of Railways; she was the only female figure in the cabinet. Former Home Minister ": null
    },
    {
        "PV Narasimha Rao": "Pv Narasimha Rao"
    },
    {
        " was put in charge of ": null
    },
    {
        "defence": "Minister Of Defence"
    },
    {
        ".  ": null
    },
    {
        "V.P. Singh": "V.P. Singh"
    },
    {
        " who was initially appointed as the ": null
    },
    {
        "Finance Minister": "Minister Of Finance"
    },
    {
        ", was given the Defence Ministry in 1987.  During his tenure as Prime Minister, Gandhi frequently shuffled his cabinet ministers, drawing criticism from the magazine  India Today , which called it a wheel of confusion . The ": null
    },
    {
        "West Bengal": "West Bengal"
    },
    {
        " chief minister ": null
    },
    {
        "Jyoti Basu": "Jyoti Basu"
    },
    {
        " said, The Cabinet change reflects the instability of the Congress Government at the Centre .        Gandhis first action as Prime Minister was passing the ": null
    },
    {
        "anti-defection law": "Parliamentary System"
    },
    {
        " in January 1985. According to this law, an elected Member of Parliament or legislative assembly could not join an opposition party until the next election. Historian Manish Telikicherla Chary calls it a measure of curbing corruption and bribery of ministers by switching parties so they could gain majority. Chary, p. 129 Many such defections occurred during the 1980s as elected leaders of the Congress party joined opposition parties.             In 1985, the ": null
    },
    {
        "Supreme Court of India": "Supreme Court Of India"
    },
    {
        " ruled in favour of Muslim divorcee ": null
    },
    {
        "Shah Bano": "Shah Bano"
    },
    {
        ", declaring that her husband should give her ": null
    },
    {
        "alimony": "Alimony"
    },
    {
        ". Some Indian Muslims treated it as an encroachment upon ": null
    },
    {
        "Muslim Personal Law": "Muslim Personal Law"
    },
    {
        " and protested against it. Gandhi agreed to their demands.  In 1986, the Parliament of India passed ": null
    },
    {
        "The Muslim Women Act 1986": "The Muslim Women  Act 1986"
    },
    {
        ", which nullified the Supreme Courts judgment in the Shah Bano case. The Act diluted the Supreme Court judgment and allowed maintenance payments to divorced women only during the period of ": null
    },
    {
        "Iddah": "Iddah"
    },
    {
        ", or until 90 days after the divorce, according to the provisions of Islamic law. This was in contrast to Section 125 of the Code.   Indian magazine Business and Economics called it a minority appeasement by Gandhi.  Lawyer and former Law Minister of India, ": null
    },
    {
        "Ram Jethmalani": "Ram Jethmalani"
    },
    {
        ", called the Act retrogressive obscurantism for short-term minority populism .  Gandhis colleague ": null
    },
    {
        "Arif Mohammad Khan": "Arif Mohammad Khan"
    },
    {
        ", who was then a Member of Parliament, resigned in protest.             In his election manifesto for the ": null
    },
    {
        "1984 general election": "1984 Indian General Election"
    },
    {
        ", he did not mention any economic reforms, but after assuming office he tried to liberalise the countrys economy. Kohli, p. 103 He did so by providing incentives to make private production profitable. Subsidies were given to corporate companies to increase industrial production, especially of ": null
    },
    {
        "durable goods": "Durable Goods"
    },
    {
        ". It was hoped this would increase economic growth and improve the quality of investment. Kohli, p. 102 But according to Professor ": null
    },
    {
        "Atul Kohli": "Atul Kohli"
    },
    {
        " of ": null
    },
    {
        "Princeton University": "Princeton University"
    },
    {
        " in a book published by Cambridge University, Gandhi faced stiff opposition from Congress leadership who thought it would open the economy to external economic influences . Rural and tribal people protested because they saw them as pro-rich and pro-city reforms.     Gandhi increased government support for science, technology and associated industries, and reduced import quotas, taxes and tariffs on technology-based industries, especially computers, airlines, defence and telecommunications. In 1986, he announced a ": null
    },
    {
        "National Policy on Education": "National Policy On Education"
    },
    {
        " to modernise and expand higher education programs across India. In 1986, he founded the ": null
    },
    {
        "Jawahar Navodaya Vidyalaya": "Jawahar Navodaya Vidyalaya"
    },
    {
        " System, which is a Central government-based education institution that provides rural populations with free residential education from grades six to twelve.  His efforts created ": null
    },
    {
        "MTNL": "Mtnl"
    },
    {
        " in 1986, and his public call offices—better known as PCOs—helped develop the telephone network in rural areas.  He introduced measures to significantly reduce the  Licence Raj  after 1990, allowing businesses and individuals to purchase capital, consumer goods and import without bureaucratic restrictions.             According to ": null
    },
    {
        "Rejaul Karim Laskar": "Rejaul Karim Laskar"
    },
    {
        ", a scholar of ": null
    },
    {
        "Indian foreign policy": "Indian Foreign Policy"
    },
    {
        " and an ideologue of ": null
    },
    {
        "Congress party": "Indian National Congress"
    },
    {
        ", Rajiv Gandhis vision for a new world order was premised on ": null
    },
    {
        "Indias": "India"
    },
    {
        "place in its front rank.  According to ": null
    },
    {
        "Laskar": "Rejaul Karim Laskar"
    },
    {
        ", the whole gamut of Rajiv Gandhis ": null
    },
    {
        "foreign policy": "Foreign Policy"
    },
    {
        " was geared towards making India strong, independent, self-reliant and in the front rank of the nations of the world. According to ": null
    },
    {
        "Laskar": "Rejaul Karim Laskar"
    },
    {
        ", Rajiv Gandhis diplomacy was properly calibrated so as to be conciliatory and accommodating when required and assertive when the occasion demanded.     In 1986, by request of the President of Seychelles ": null
    },
    {
        "France-Albert René": "France-Albert René"
    },
    {
        ", Gandhi sent Indias navy to ": null
    },
    {
        "Seychelles": "Seychelles"
    },
    {
        " to oppose an attempted coup against René. The intervention of India averted the coup. This mission was codenamed as ": null
    },
    {
        "Operation Flowers are Blooming": "Operation Flowers Are Blooming"
    },
    {
        ".  In 1987, India re-occupied the Quaid Post in the disputed ": null
    },
    {
        "Siachen": "Siachen"
    },
    {
        " region of the ": null
    },
    {
        "Indo-Pakistani border": "Indo-Pakistani Border"
    },
    {
        " after winning what was termed ": null
    },
    {
        "Operation Rajiv": "Operation Rajiv"
    },
    {
        ".  In the ": null
    },
    {
        "1988 Maldives coup détat": "1988 Maldives Coup Détat"
    },
    {
        ", the Maldives president ": null
    },
    {
        "Maumoon Abdul Gayoom": "Maumoon Abdul Gayoom"
    },
    {
        " asked for help from Gandhi. He dispatched 1500 soldiers and the coup was suppressed. Agarwal, p. 141      On Thursday, 9 June 1988, at the fifteenth special session of the ": null
    },
    {
        "United Nations General Assembly": "United Nations General Assembly"
    },
    {
        ", held at Headquarters, New York, Gandhi made vocal his views on a world free of nuclear weapons, to be realised through an, Action Plan for Ushering in a Nuclear-Weapon Free and Non-Violent World Order.  PM Rajeev Gandhi at the Fifteenth special session of ": null
    },
    {
        "United Nations General Assembly": "United Nations General Assembly"
    },
    {
        "     He said:     Alas, nuclear weapons are not the only weapons of mass destruction. New knowledge is being generated in the life sciences. Military applications of these developments could rapidly undermine the existing convention against the military use of biological weapons. The ambit of our concern must extend to all means of mass ": null
    },
    {
        "annihilation": "Annihilation"
    },
    {
        ".     This was based on his prior historic speech before the Japanese ": null
    },
    {
        "National Diet": "National Diet"
    },
    {
        " on 29 November 1985, in which he said:     Let us remove the mental partitions which obstruct the ennobling vision of the human family linked together in peace and prosperity. The Buddhas message of compassion is the very condition of human survival in our age. Japanese ": null
    },
    {
        "National Diet": "National Diet"
    },
    {
        " on 29 November 1985    Speech by Prime Minister Rajiv Gandhi of India at the Joint Session of the Japanese Upper and Lower Houses      The foiled bid of India recently to enter the ": null
    },
    {
        "Nuclear Suppliers Group": "Nuclear Suppliers Group"
    },
    {
        ", echoed his policy of non-proliferation to be linked to universal disarmament, which the ": null
    },
    {
        "World Nuclear Association": "World Nuclear Association"
    },
    {
        " refuses to recognise; non-proliferation being seen by India as essentially a weapon of the arms control regime, of the big nuclear powers as United States, Russia, United Kingdom, France, and China.         In February 1987, the Pakistani President ": null
    },
    {
        "Zia-ul-Haq": "Muhammad Zia-Ul-Haq"
    },
    {
        " visited Delhi, where he met Gandhi to discuss routine military exercises of the Indian army on the borders of ": null
    },
    {
        "Rajasthan": "Rajasthan"
    },
    {
        " and ": null
    },
    {
        "Punjab": "Punjab, India"
    },
    {
        ". Gandhi reciprocated, in December 1988, by visiting ": null
    },
    {
        "Islamabad": "Islamabad"
    },
    {
        " and meeting the new Prime Minister of Pakistan, ": null
    },
    {
        "Benazir Bhutto": "Benazir Bhutto"
    },
    {
        ", to reaffirm the ": null
    },
    {
        "1972 Shimla agreement": "1972 Shimla Agreement"
    },
    {
        ". Sharma, p. 16          The ": null
    },
    {
        "Sri Lankan Civil War": "Sri Lankan Civil War"
    },
    {
        " broke out with the ": null
    },
    {
        "Liberation Tigers of Tamil Eelam": "Liberation Tigers Of Tamil Eelam"
    },
    {
        " , which was demanding an independent ": null
    },
    {
        "Tamil": "Tamil People"
    },
    {
        " state in Sri Lanka. Gandhi discussed the matter with the Sri Lankan Prime Minister ": null
    },
    {
        "Ranasinghe Premadasa": "Ranasinghe Premadasa"
    },
    {
        " at the ": null
    },
    {
        "SAARC": "Saarc"
    },
    {
        " meeting in 1986. In that year, the Sri Lankan army blockaded the Tamil majority district of ": null
    },
    {
        "Jaffna": "Jaffna District"
    },
    {
        "; Gandhi ordered relief supplies to be dropped into the area by parachute because the Sri Lankan navy did not allow the ": null
    },
    {
        "Indian Navy": "Indian Navy"
    },
    {
        " to enter. Sharma, p. 14     Gandhi signed the ": null
    },
    {
        "Indo-Sri Lanka Accord": "Indo-Sri Lanka Accord"
    },
    {
        " in July 1987. The accord envisaged a devolution of power to the Tamil-majority areas , dissolved the LTTE, and designated ": null
    },
    {
        "Tamil": "Tamil Language"
    },
    {
        " as an official language of Sri Lanka. Gandhi said:     The Government of India believe that, despite some problems and delays, many of which were foreseen but unavoidable in the resolution of an issue of this magnitude and complexity, this Agreement represents the only way of safeguarding legitimate Tamil interests and ensuring a durable peace in Sri Lanka. Some have chosen to criticise the Agreement. None has shown a better way of meeting the legitimate aspirations of the Tamils in Sri Lanka, restoring peace in that country and of meeting our own security concern in the region. We have accepted a role which is difficult, but which is in our national interests to discharge. We shall not shrink our obligations and commitments. This is a national endeavour. Sharma, p. 15     Chanderasekar withdrew the IPKF in 1989.       On 30 July 1987, a day after Gandhi went to Sri Lanka and signed the Indo-Sri Lanka Accord, an honour guard named ": null
    },
    {
        "Vijitha Rohana": "Vijitha Rohana"
    },
    {
        " hit him on his shoulder with his rifle; Gandhis quick reflexes saved him from injury. The guard was then dragged off by his security personnel.  The guard said his intention was to kill Gandhi because of the damage he had caused to Sri Lanka. Wijemuni was imprisoned for two-and-a-half years for the assault. Gandhi later said about the incident:     When I was inspecting the guard of honour and as I walked past one person, I saw through the corner of my eye some movement. I ducked down a little bit in a reflex action. By my ducking, he missed my head and the brunt of the blow came on my shoulder below the left ear.               Soon after assuming office, Gandhi released the leaders of the ": null
    },
    {
        "Akali Dal": "Akali Dal"
    },
    {
        " who had been imprisoned since 1984s Operation Blue Star during Indira Gandhis prime ministership. He lifted the ban on ": null
    },
    {
        "All India Sikh Students Federation": "All India Sikh Students Federation"
    },
    {
        " and filed an inquiry into the ": null
    },
    {
        "1984 Anti-Sikh Riots": "1984 Anti-Sikh Riots"
    },
    {
        ". He also held a closed-door meeting with senior Akali Dal leaders to find a solution to the Punjab problem. Despite Akali opposition, in January 1985, Gandhi signed the ": null
    },
    {
        "Rajiv-Longowal Accord": "Rajiv-Longowal Accord"
    },
    {
        " with Akali leader HS Longowal. Punjabs state assembly election was scheduled in September 1985, but Longowal died and was replaced by ": null
    },
    {
        "Surjit Singh Barnala": "Surjit Singh Barnala"
    },
    {
        ", who formed the government. After two years, in 1987, Barnala resigned his office because of a breakdown of law and order, leading to the implementation of ": null
    },
    {
        "Presidents rule": "Presidents Rule"
    },
    {
        " in the state. Sharma, p. 10     In May 1988, Gandhi launched the ": null
    },
    {
        "Operation Black Thunder": "Operation Black Thunder"
    },
    {
        " to clear the Golden Temple in ": null
    },
    {
        "Amritsar": "Amritsar"
    },
    {
        " of arms and gunmen. Two groups called National Security Guard and Special Action Group were created; they surrounded the temple in a 10-day siege during which the extremists weapons were confiscated. Congress leader ": null
    },
    {
        "Anand Sharma": "Anand Sharma"
    },
    {
        " said, Operation Black Thunder effectively demonstrated the will of Rajiv Gandhis government to take firm action to bring peace to Punjab . Sharma, p. 11       Gandhis prime-ministership marked an increase of ": null
    },
    {
        "insurgency in northeast India": "Insurgency In Northeast India"
    },
    {
        ". ": null
    },
    {
        "Mizo National Front": "Mizo National Front"
    },
    {
        " demanded independence for ": null
    },
    {
        "Mizoram": "Mizoram"
    },
    {
        ". In 1987, Gandhi addressed this problem; Mizoram and ": null
    },
    {
        "Arunachal Pradesh": "Arunachal Pradesh"
    },
    {
        " were given the status of states that were earlier union territories. Sharma, p. 12 Gandhi also ended the ": null
    },
    {
        "Assam Movement": "Assam Movement"
    },
    {
        ", which was launched by Assamese people to protest against the alleged illegal migration of Bangladeshi Muslims and immigration of other Bengalis to their state, which had reduced the Assamese to a minority there. He signed the ": null
    },
    {
        "Assam Accord": "Assam Accord"
    },
    {
        " on 15 August 1985. According to the accord, foreigners who came to the state between 1951 and 1961 were given full citizenship but those who arrived there between 1961 and 1971 did not get right to vote for the next ten years. Sharma, p. 13       Gandhi employed former ": null
    },
    {
        "Rockwell International": "Rockwell International"
    },
    {
        " executive ": null
    },
    {
        "Sam Pitroda": "Sam Pitroda"
    },
    {
        " as his adviser on public information infrastructure and innovation. During Gandhis time in office, public sector telecom companies ": null
    },
    {
        "MTNL": "Mtnl"
    },
    {
        " and ": null
    },
    {
        "VSNL": "Vsnl"
    },
    {
        " was developed.  According to Pitroda, Gandhis ability to resist pressure from multi-national companies to abandon his plan to spread telecommunication services has been an important factor in Indias development. According to news website ": null
    },
    {
        "Oneindia": "Oneindia"
    },
    {
        ", About 20 years ago telephones were considered to be a thing for the use of the rich, but credit goes to Rajiv Gandhi for taking them to the rural masses .  Pitroda also said their plan to expand Indias telephone network succeeded because of Gandhis political support. According to Pitroda, by 2007 they were adding six million phones every month . Gandhis government also allowed the import of fully assembled motherboards, which led to the price of computers being reduced. According to some commentators, the seed for the information technology revolution was also planted during Rajiv Gandhis time.             Rajiv Gandhis finance minister, ": null
    },
    {
        "V. P. Singh": "V. P. Singh"
    },
    {
        ", uncovered compromising details about government and political corruption, to the consternation of Congress leaders. Transferred to the Defence Ministry, Singh uncovered what became known as the Bofors scandal, which involved millions of US dollars and concerned alleged payoffs by the Swedish arms company ": null
    },
    {
        "Bofors": "Bofors"
    },
    {
        " through Italian businessman and Gandhi family associate ": null
    },
    {
        "Ottavio Quattrocchi": "Ottavio Quattrocchi"
    },
    {
        ", in return for Indian contracts. Upon discovering the scandal, Singh was dismissed from office and later resigned his Congress membership. Gandhi was later personally implicated in the scandal when the investigation was continued by ": null
    },
    {
        "Narasimhan Ram": "Narasimhan Ram"
    },
    {
        " and Chitra Subramaniam of  The Hindu  newspaper, damaging his image as an honest politician. In 2004, he was posthumously cleared of this allegation.      In an interview in July 2005, V.P.Singh explained that his fall out with Rajiv Gandhi was not due to the Bofors deal, but rather due to the ": null
    },
    {
        "HDW deal": "Shishumar-Class Submarine"
    },
    {
        ". Courtesy a contract signed with the Germany company ": null
    },
    {
        "HDW": "Hdw"
    },
    {
        " in 1981, the Indian government had agreed to purchase two ready submarines built in Germany by HDW and two submarines in CKD form to be assembled in Mazagaon docks. V.P.Singh had received a telegram from the Indian ambassador in Germany, stating that an Indian agents had received commissions in the ": null
    },
    {
        "HDW submarine": "Shishumar-Class Submarine"
    },
    {
        " deal. He told Rajiv Gandhi about this and instituted an enquiry. This led to differences and V.P.Singh resigned from the cabinet.      In his book, Unknown Facets of Rajiv Gandhi, Jyoti Basu and Indrajit Gupta, released in November 2013, former ": null
    },
    {
        "CBI": "Central Bureau Of Investigation"
    },
    {
        " director Dr. A P Mukherjee wrote that Gandhi wanted commission paid by defence suppliers to be used exclusively for meeting running expenses of the Congress party. . Indian Express . Retrieved on 21 May 2014. Mukherjee said Gandhi explained his position in a meeting between the two at the Prime Ministers residence on 19 June 1989. FTP ACCESS In May 2015, Indian president Pranab Mukherjee said the scandal was a media trial as no Indian court has as yet established it as a scandal .      Opposition parties Lok Dal, ": null
    },
    {
        "Indian National Congress ": "Indian National Congress"
    },
    {
        " and ": null
    },
    {
        "Jan Morcha": "Jan Morcha"
    },
    {
        " united under Singh to form the ": null
    },
    {
        "Janata Dal": "Janata Dal"
    },
    {
        ".  Singh led the ": null
    },
    {
        "National Front": "National Front"
    },
    {
        " coalition to victory in ": null
    },
    {
        "1989 elections": "1989 Indian General Election"
    },
    {
        " and he was sworn in as Prime Minister. Though the coalition won 143 seats compared to Congresss 197, it gained majority in the lower house of the parliament through outside support from the ": null
    },
    {
        "Bharatiya Janta Party": "Bharatiya Janta Party"
    },
    {
        " under the leadership of ": null
    },
    {
        "Atal Bihari Vajpayee": "Atal Bihari Vajpayee"
    },
    {
        " and ": null
    },
    {
        "Lal Krishna Advani": "Lal Krishna Advani"
    },
    {
        " and the left parties such as the ": null
    },
    {
        "Communist Party of India ": "Communist Party Of India"
    },
    {
        " and the ": null
    },
    {
        "Communist Party of India": "Communist Party Of India"
    },
    {
        ".  Eminent lawyer and politician, former ": null
    },
    {
        "Law Minister of India": "Ministry Of Law And Justice"
    },
    {
        " Ram Jethmalani": "Ram Jethmalani"
    },
    {
        " said that as Prime Minister, Gandhi was lacklustre and mediocre .           In November 1991,  Schweizer Illustrierte  magazine published an article on ": null
    },
    {
        "black money": "Black Money"
    },
    {
        " held in secret accounts by ": null
    },
    {
        "Imelda Marcos": "Imelda Marcos"
    },
    {
        " and 14 other rulers of ": null
    },
    {
        "Third World": "Third World"
    },
    {
        " countries. Citing ": null
    },
    {
        "McKinsey": "Mckinsey  &  Company"
    },
    {
        " as a source, the article stated that Rajiv Gandhi held 2.5 billion ": null
    },
    {
        "Swiss francs": "Swiss Franc"
    },
    {
        "in secret Indian accounts in Switzerland.   Several leaders of opposition parties in India raised the issue, citing the Schweizer Illustrierte article. In December 1991, Amal Datta raised the issue in the Indian Parliament; the Speaker of the Lok Sabha, ": null
    },
    {
        "Shivraj Patil": "Shivraj Patil"
    },
    {
        ", expunged Rajiv Gandhis name from the proceedings. In December 2011, ": null
    },
    {
        "Subramanian Swamy": "Subramanian Swamy"
    },
    {
        " wrote to the director of the Central Bureau of Investigation, citing the article and asking him to take action on black money accounts of the ": null
    },
    {
        "Nehru-Gandhi family": "Nehru–Gandhi Family"
    },
    {
        ".  On 29 December 2011, Ram Jethmalani made an indirect reference to the issue in the ": null
    },
    {
        "Rajya Sabha": "Rajya Sabha"
    },
    {
        ", calling it a shame that one of Indias former Prime Ministers was named by a Swiss magazine. This was met by an uproar and a demand for withdrawal of the remark by the ruling Congress party members.        In 1992, the Indian newspapers  Times of India  and  The Hindu  published reports alleging that Rajiv Gandhi had received funds from the ": null
    },
    {
        "KGB": "Kgb"
    },
    {
        ".  The Russian government confirmed this disclosure and defended the payments as necessary for Soviet ideological interest. In their 1994 book The State Within a State, journalists ": null
    },
    {
        "Yevgenia Albats": "Yevgenia Albats"
    },
    {
        " and ": null
    },
    {
        "Catherine Fitzpatrick": "Catherine A. Fitzpatrick"
    },
    {
        " quoted a letter signed by ": null
    },
    {
        "Viktor Chebrikov": "Viktor Chebrikov"
    },
    {
        ", head of the KGB, in the 1980s. The letter says the KGB maintained contact with Gandhi, who expressed his gratitude to the KGB for benefits accruing to his family from commercial dealings of a controlled firm. A considerable portion of funds obtained from this channel were used to support his party.  Albats later said that in December 1985, Chebrikov had asked for authorisation from the ": null
    },
    {
        "Central Committee of the Communist Party of the Soviet Union": "Central Committee Of The Communist Party Of The Soviet Union"
    },
    {
        " to make payments to family members of Rajiv Gandhi, including Sonia Gandhi and Rahul Gandhi.  The payments were authorised by a resolution and endorsed by the USSR Council of Ministers, and had been paid since 1971. In December 2001, Subramanian Swamy filed a writ petition in the Delhi High Court; the Court ordered CBI to ascertain the truth of the allegations in May 2002. After two years, the CBI told the Court Russia would not entertain such queries without a registered FIR.            Rajiv Gandhis last public meeting was on 21 May 1991, at ": null
    },
    {
        "Sriperumbudur": "Sriperumbudur"
    },
    {
        ", a village approximately  from ": null
    },
    {
        "Madras": "Madras"
    },
    {
        " , where he was assassinated while campaigning for the Sriperumbudur Lok Sabha Congress candidate. At 10:10 pm, a woman later identified as ": null
    },
    {
        "Thenmozhi Rajaratnam": "Thenmozhi Rajaratnam"
    },
    {
        " approached Gandhi in public and greeted him. She then bent down to touch his feet and detonated a belt laden with  of ": null
    },
    {
        "RDX": "Rdx"
    },
    {
        " explosives tucked under her dress.  The explosion killed Gandhi, Rajaratnam, and at least 25 other people. The assassination was captured by a 21-year-old local photographer, whose camera and film were found at the site. The cameraman, named Haribabu, died in the blast but the camera remained intact.  Gandhis mutilated body was airlifted to the ": null
    },
    {
        "All India Institute of Medical Sciences": "All India Institute Of Medical Sciences"
    },
    {
        " in New Delhi for post-mortem, reconstruction and embalming.      A state funeral was held for Gandhi on 24 May 1991; it was telecast live and was attended by dignitaries from over 60 countries.  He was cremated at ": null
    },
    {
        "Veer Bhumi": "Raj Ghat And Associated Memorials"
    },
    {
        ", on the banks of the river ": null
    },
    {
        "Yamuna": "Yamuna River"
    },
    {
        " near the ": null
    },
    {
        "shrines": "Samadhi"
    },
    {
        "of his mother Indira Gandhi, brother Sanjay Gandhi, and grandfather Jawaharlal Nehru.            The Supreme Court judgement, by Justice ": null
    },
    {
        "K. T. Thomas": "K. T. Thomas"
    },
    {
        ", confirmed that Gandhi was killed because of personal animosity by the LTTE chief ": null
    },
    {
        "Prabhakaran": "Velupillai Prabhakaran"
    },
    {
        " arising from his sending the Indian Peace Keeping Force to Sri Lanka and the alleged IPKF atrocities against Sri Lankan Tamils. State of Tamil Nadu through Superintendent of Police, CBI/SIT vs. Nalini & 25 Ors., Death Ref. Case No. 1 of 1998 per  , para. 163 The Gandhi administration had already antagonised other Tamil militant organisations like ": null
    },
    {
        "PLOTE": "Peoples Liberation Organisation Of Tamil Eelam"
    },
    {
        " for reversing ": null
    },
    {
        "the 1988 military coup in Maldives": "1988 Maldives Coup"
    },
    {
        ". The judgement further cites the death of ": null
    },
    {
        "Thileepan": "Thileepan"
    },
    {
        " in a hunger strike and the suicide by 12 LTTE cadres in a vessel in Oct 1987.      In the ": null
    },
    {
        "Jain Commission": "Jain Commission"
    },
    {
        " report, various people and agencies are named as suspects in the murder of Rajiv Gandhi. Among them, the cleric ": null
    },
    {
        "Chandraswami": "Chandraswami"
    },
    {
        " was suspected of involvement, including financing the assassination.     Nalini Sriharan, the only surviving member of the five-member squad behind the assassination of Rajiv Gandhi, is serving life imprisonment. Arrested on 14 June 1991, she and 25 others were sentenced to death by a special court on 28 January 1998. The court confirmed the death sentences of four of the convicts, including Nalini, on 11 May 1999. State of Tamil Nadu through Superintendent of Police, CBI/SIT vs. Nalini & 25 Ors., Death Ref. Case No. 1 of 1998 per  and  Nalini was a close friend of an LTTE operative known as Sriharan alias Murugan, another convict in the case who has been sentenced to death. Nalini later gave birth to a girl, Harithra, in prison. Nalinis death sentence was commuted to life imprisonment in April 2000. G.O.Ms.No.406, Home Department, dated 24 April 2000 Rajivs widow, Sonia Gandhi, intervened and asked for clemency for Nalini on the grounds of the latter being a mother.  Later, it was reported that Gandhis daughter, ": null
    },
    {
        "Priyanka Gandhi Vadra": "Priyanka Gandhi Vadra"
    },
    {
        ", had met Nalini at Vellore Central Prison in March 2008.  Nalini regrets the killing of Gandhi and said the real conspirators have not been caught yet.       In August 2011, the President of India rejected the clemency pleas of Murugan and two others on death row—Suthendraraja, alias Santhan, and Perarivalan, alias Arivu.  The execution of the three convicts was scheduled for 9 September 2011. However, the ": null
    },
    {
        "Madras High Court": "Madras High Court"
    },
    {
        " intervened and stayed their executions for eight weeks based on their petitions. In 2010, Nalini had petitioned the Madras High Court seeking release because she had served more than 20 years in prison. She argued that even life convicts were released after 14 years. The state government rejected her request.    Murugan, Santhan and Perarivalan have said they are political prisoners rather than ordinary criminals.    On 18 February 2014, the Supreme Court of India commuted the death sentences of Murugan, Santhan and Perarivalan to life imprisonment, holding that the 11-year-long delay in deciding their mercy petition had a dehumanising effect on them.  citing   On 19 February 2014 Tamil Nadu government decided to release all seven convicts in Rajiv Gandhis assassination case, including A. G. Perarivalan and Nalini.  The ": null
    },
    {
        "Union of India": "Union Of India"
    },
    {
        " challenged this decision before the Supreme Court, which referred the case to a Constitution Bench.      The report of the Jain Commission created controversy when it accused the ": null
    },
    {
        "Tamil Nadu": "Tamil Nadu"
    },
    {
        " chief minister ": null
    },
    {
        "Karunanidhi": "Karunanidhi"
    },
    {
        " of a role in the assassination, leading to Congress withdrawing its support for the ": null
    },
    {
        "I. K. Gujral": "I. K. Gujral"
    },
    {
        " government and fresh elections in 1998. LTTE spokesman ": null
    },
    {
        "Anton Balasingham": "Anton Balasingham"
    },
    {
        " told the Indian television channel ": null
    },
    {
        "NDTV": "Ndtv"
    },
    {
        " the killing was a great tragedy, a monumental historical tragedy which we deeply regret .   A memorial called ": null
    },
    {
        "Veer Bhumi": "Raj Ghat And Other Memorials"
    },
    {
        " was constructed at the place of Gandhis cremation in Delhi. In 1992, the ": null
    },
    {
        "Rajiv Gandhi National Sadbhavana Award": "Rajiv Gandhi National Sadbhavana Award"
    },
    {
        " was instituted by the Indian National Congress Party.     Since his death, 21 May has been declared Anti-Terrorism Day in India.             A ": null
    },
    {
        "Right to Information": "Right To Information"
    },
    {
        " request filed in August 2009 found that more than 450 government projects and schemes are named after the ": null
    },
    {
        "Gandhi-Nehru family": "Gandhi-Nehru Family"
    },
    {
        ".  In May 2012,  Zee News  reported there were 16 government schemes named after Gandhi, including  Rajiv Awas Yojana  and Rajiv Gandhi Udyami Mitra Yojana.  In March 2015, ": null
    },
    {
        "Haryana": "Haryana"
    },
    {
        " sports minister ": null
    },
    {
        "Anil Vij": "Anil Vij"
    },
    {
        " said that at that time there were 232 rural stadia in India, with 226 of them being named after him. He said the government was planning to rename all the stadia in Haryana state named after him. Vij drew criticism from Congress leader ": null
    },
    {
        "Kuldeep Sharma": "Kuldeep Sharma"
    },
    {
        ", who said it was an insult to their national leaders .        A movie titled  Madras Cafe  showed the planning of an intelligence agency to stop the assassination and catch the LTTE leader. However, at the end, they were unable to save Rajiv Gandhi.       ": null
    }
]