[
    {
        "In ": null
    },
    {
        "combinatorial mathematics": "combinatorics"
    },
    {
        ", Ramseys theorem states that one will find monochromatic ": null
    },
    {
        "cliques": "clique"
    },
    {
        " in any ": null
    },
    {
        "edge labelling": "graph labeling"
    },
    {
        " of a sufficiently large ": null
    },
    {
        "complete graph": "complete graph"
    },
    {
        ". To demonstrate the theorem for two colours , let r and s be any two positive integers. Ramseys theorem states that there exists a least positive integer  for which every blue-red edge colouring of the ": null
    },
    {
        "complete graph": "complete graph"
    },
    {
        " on  vertices contains a blue clique on r vertices or a red clique on s vertices.      Ramseys theorem is a foundational result in combinatorics. The first version of this result was proved by ": null
    },
    {
        "F. P. Ramsey": "f. p. ramsey"
    },
    {
        ". This initiated the combinatorial theory now called ": null
    },
    {
        "Ramsey theory": "ramsey theory"
    },
    {
        ", that seeks regularity amid disorder: general conditions for the existence of substructures with regular properties. In this application it is a question of the existence of monochromatic subsets, that is, subsets of connected edges of just one colour.     An extension of this theorem applies to any finite number of colours, rather than just two. More precisely, the theorem states that for any given number of colours, c, and any given integers n 42 , …, n c , there is a number, R, such that if the edges of a complete graph of order R are coloured with c different colours, then for some i between 42 and c, it must contain a complete subgraph of order n i whose edges are all colour i. The special case above has c 42 .     R 42     Suppose the edges of a complete graph on 42 vertices are coloured red and blue. Pick a vertex, v. There are 42 edges incident to v and so  at least 42 of them must be the same colour. ": null
    },
    {
        "Without loss of generality": "without loss of generality"
    },
    {
        " we can assume at least 42 of these edges, connecting the vertex, v, to vertices, r, s and t, are blue. If any of the edges, , , , are also blue then we have an entirely blue triangle. If not, then those three edges are all red and we have an entirely red triangle. Since this argument works for any colouring, any K 42 contains a monochromatic K 42 , and therefore R ≤ 42 The popular version of this is called the ": null
    },
    {
        "theorem on friends and strangers": "theorem on friends and strangers"
    },
    {
        ".     An alternative proof works by ": null
    },
    {
        "double counting": "double counting"
    },
    {
        ". It goes as follows: Count the number of ordered triples of vertices, x, y, z, such that the edge, , is red and the edge, , is blue. Firstly, any given vertex will be the middle of either 42  ×  42    42 , 42  ×  42    42 , or 42  ×  42    42 such triples. Therefore, there are at most 42  ×  42    42 such triples. Secondly, for any non-monochromatic triangle , there exist precisely two such triples. Therefore, there are at most 42 non-monochromatic triangles. Therefore, at least 42 of the 42 triangles in the K 42 are monochromatic.     Conversely, it is possible to 42-colour a K 42 without creating any monochromatic K 42 , showing that R   ref /ref  blockquote  /blockquote  sub /sub  sub  /sub  sub /sub  ref  /ref  math /math math /math  math /math  math /math math /math  math /math math /math  math /math math /math math /math math /math math /math math /math math /math math /math math /math math /math math /math blockquote  ... ": null
    }
]