[
    {
        "               Rastafari, also known as Rastafarianism, is an ": null
    },
    {
        "Abrahamic": "abrahamic religion"
    },
    {
        " religion": "religion"
    },
    {
        " that developed in ": null
    },
    {
        "Jamaica": "jamaica"
    },
    {
        " during the 42s. It is classified as both a ": null
    },
    {
        "new religious movement": "new religious movement"
    },
    {
        " and a ": null
    },
    {
        "social movement": "social movement"
    },
    {
        " by ": null
    },
    {
        "scholars of religion": "religious studies"
    },
    {
        ". There is no central authority in control of the movement and much diversity exists among practitioners, who are known as Rastafari, Rastafarians, or Rastas.     Rasta beliefs are based on a specific interpretation of the ": null
    },
    {
        "Bible": "bible"
    },
    {
        ". Central is a ": null
    },
    {
        "monotheistic": "monotheistic"
    },
    {
        " belief in a single God—referred to as ": null
    },
    {
        "Jah": "jah"
    },
    {
        "—who partially resides within each individual. Rastafari also maintains that Jah incarnated in human form as ": null
    },
    {
        "Jesus Christ": "jesus of nazareth"
    },
    {
        ". Rastas accord ": null
    },
    {
        "Haile Selassie": "haile selassie"
    },
    {
        ", the ": null
    },
    {
        "Emperor of Ethiopia": "emperor of ethiopia"
    },
    {
        " between 42 and 42 central importance; many regard him as the ": null
    },
    {
        "Second Coming": "second coming of christ"
    },
    {
        " of Christ and thus Jah incarnate, while others see him as a human prophet who fully recognized the inner divinity in every individual. Rastafari is ": null
    },
    {
        "Afrocentric": "afrocentrism"
    },
    {
        " and focuses its attention on the ": null
    },
    {
        "African diaspora": "african diaspora"
    },
    {
        ", which it believes is oppressed within Western society, or Babylon . Many Rastas call for the resettlement of the African diaspora in Africa, referring to this continent as the ": null
    },
    {
        "Promised Land": "promised land"
    },
    {
        " of Zion . Rastas refer to their practices as ": null
    },
    {
        "livity": "livity"
    },
    {
        " . Communal meetings are known as groundations , and are typified by music, chanting, discussions, and the ": null
    },
    {
        "smoking of cannabis": "entheogenic use of cannabis"
    },
    {
        ", the latter being regarded as a ": null
    },
    {
        "sacrament": "sacrament"
    },
    {
        " with beneficial properties. Rastas place emphasis on what they regard as living naturally , adhering to ": null
    },
    {
        "ital": "ital"
    },
    {
        " dietary requirements, twisting their hair into ": null
    },
    {
        "dreadlocks": "dreadlocks"
    },
    {
        ", and following ": null
    },
    {
        "patriarchal": "patriarchy"
    },
    {
        " gender roles.     Rastafari originated among impoverished and socially disenfranchised ": null
    },
    {
        "Afro-Jamaican": "afro-jamaican"
    },
    {
        " communities in 42s Jamaica. Its Afrocentric ideology was largely a reaction against Jamaicas then-dominant ": null
    },
    {
        "British colonial culture": "colony of jamaica"
    },
    {
        ". It was influenced by both ": null
    },
    {
        "Ethiopianism": "ethiopian movement"
    },
    {
        " and the ": null
    },
    {
        "Back-to-Africa movement": "back-to-africa movement"
    },
    {
        " promoted by ": null
    },
    {
        "black nationalist": "black nationalism"
    },
    {
        " figures like ": null
    },
    {
        "Marcus Garvey": "marcus garvey"
    },
    {
        ". The movement developed after several ": null
    },
    {
        "Protestant": "protestantism"
    },
    {
        " Christian": "christianity"
    },
    {
        " clergymen, most notably ": null
    },
    {
        "Leonard Howell": "leonard howell"
    },
    {
        ", proclaimed that Haile Selassies crowning as emperor in 42 fulfilled a Biblical prophecy. By the 42s, Rastafaris ": null
    },
    {
        "counter-cultural": "counter-culture"
    },
    {
        " stance had brought the movement into conflict with wider Jamaican society, including violent clashes with law enforcement. In the 42s and 42s it gained increased respectability within Jamaica and greater visibility abroad through the popularity of Rasta-inspired ": null
    },
    {
        "reggae": "reggae"
    },
    {
        " musicians like ": null
    },
    {
        "Bob Marley": "bob marley"
    },
    {
        ". Enthusiasm for Rastafari declined in the 42s, following the deaths of Haile Selassie and Marley, but the movement survived and has a presence in many parts of the world.     The Rasta movement is decentralised and organised on a largely cellular basis. There are several denominations, or ": null
    },
    {
        "Mansions of Rastafari": "mansions of rastafari"
    },
    {
        " , the most prominent of which are the ": null
    },
    {
        "Nyahbinghi": "nyahbinghi"
    },
    {
        ", ": null
    },
    {
        "Bobo Ashanti": "bobo ashanti"
    },
    {
        ", and the ": null
    },
    {
        "Twelve Tribes of Israel": "twelve tribes of israel"
    },
    {
        ", each offering a different interpretation of Rasta belief. There are an estimated 42 to 42 million Rastas across the world; the largest population is in Jamaica, although communities can be found in most of the worlds major population centres. The majority of practitioners are of black African descent, although a minority come from other ethnic groups.              ": null
    },
    {
        "Scholars of religion": "religious studies"
    },
    {
        " have categorised Rastafari as a ": null
    },
    {
        "new religious movement": "new religious movement"
    },
    {
        ". Leonard E. Barrett referred to it as a ": null
    },
    {
        "sect": "sect"
    },
    {
        ", while ": null
    },
    {
        "Sheila Kitzinger": "sheila kitzinger"
    },
    {
        " and Ernest Cashmore called it a ": null
    },
    {
        "cult": "cult"
    },
    {
        ", and Ennis B. Edmonds argued that it could best be understood as a ": null
    },
    {
        "revitalization movement": "revitalization movement"
    },
    {
        ". In various countries, it has received legal recognition as a religion. Other scholars have categorized it in different ways. Emphasising its political stance, particularly in support of ": null
    },
    {
        "African nationalism": "african nationalism"
    },
    {
        " and ": null
    },
    {
        "Pan-Africanism": "pan-africanism"
    },
    {
        ", some have seen it as a political movement, or as a politico-religious movement. It has alternatively been labelled a ": null
    },
    {
        "social movement": "social movement"
    },
    {
        ", or more specifically as a ": null
    },
    {
        "new social movement": "new social movement"
    },
    {
        ".     Although Rastafari focuses on Africa as a source of identity, Maboula Soumahoro noted that it was not an authentic African religion but an example of ": null
    },
    {
        "creolization": "creolization"
    },
    {
        ", a product of the unique social environment that existed in the Americas. Katrin Hansing described it as one of the leading Afro-Caribbean religions . Edmonds also suggested that Rastafari was emerging as a ": null
    },
    {
        "world religion": "world religion"
    },
    {
        ", not because of the number of adherents that it had, but because of its global spread.   Many Rastas themselves, however, do not regard it as a religion, instead referring to it as a way of life , or as a ": null
    },
    {
        "spirituality": "spirituality"
    },
    {
        " . Midas H. Chawane nevertheless noted that it met many of the proposed definitions of a religion. In 42 a British Industrial Tribunal concluded that—for the purposes of the ": null
    },
    {
        "Race Relations Act 42": "race relations act 1976"
    },
    {
        "—Rastafarians could be considered an ethnic group because they have a long, shared heritage which distinguished themselves from other groups, their own cultural traditions, a common language, and a common religion.     Rastafari is a decentralised and heterogeneous movement; it is neither monolithic nor homogenous. The movement has continuously changed and developed over the course of its history. It is thus difficult to make broad generalisations about the movement without obscuring the complexities within it. Darren J. N. Middleton suggested that it was appropriate to speak of a plethora of Rasta spiritualities displaying a shifting eclecticism , while William F. Lewis commented that the movements diversity has produced a complexity which is overwhelming to the observer .         The term Rastafari derives from the pre-regnal title of Haile Selassie, Ras Tafari Makonnen ; the term Ras means a duke or prince, while Tafari Makonen was his name. It is unknown why the early Rastas adopted this form of Haile Selassies name as the basis of their religions name. As well as being the religions name, it is also used for the religions practitioners themselves.     Many commentators—including some academic sources—refer to the movement as Rastafarianism . This term has also been used by some practitioners. However, the term Rastafarianism is considered embarrassing by many Rastas, who believe it has connotations of doctrine and organisation which they wish to avoid. Cashmore urged fellow academics not to use this term, which he described as insensitive .            Rastas refer to the totality of their religions ideas and beliefs as Rastalogy . Edmonds described Rastafari as having a fairly cohesive worldview ; however, Cashmore thought that its beliefs were fluid and open to interpretation . Attempts have been made to summarise Rastafari belief, but these have never been accorded the status of a ": null
    },
    {
        "catechism": "catechism"
    },
    {
        " or ": null
    },
    {
        "creed": "creed"
    },
    {
        " within the movement.     Rastas place great emphasis on the idea that personal experience and intuitive understanding should be used to determine the truth or validity of a particular belief or practice. No Rasta, therefore, has the authority to declare what beliefs and practices are ": null
    },
    {
        "orthodox": "orthodoxy"
    },
    {
        " and which are ": null
    },
    {
        "heterodox": "heterodox"
    },
    {
        ". The conviction that Rastafari has no dogma is so strong that it has itself become something of a dogma , according to Clarke.     Rastafari is deeply influenced by ": null
    },
    {
        "Judeo-Christian": "judeo-christian"
    },
    {
        " religion, and shares many commonalities with Christianity. It accords the ": null
    },
    {
        "Bible": "bible"
    },
    {
        " a central place in its belief system, regarding it as a holy book, and adopts a ": null
    },
    {
        "literalist interpretation": "biblical literalism"
    },
    {
        " of its contents. According to the anthropologist ": null
    },
    {
        "Stephen D. Glazier": "stephen d. glazier"
    },
    {
        ", Rasta approaches to the Bible result in the religion adopting an outlook that is very similar to forms of ": null
    },
    {
        "Protestantism": "protestantism"
    },
    {
        ". Rastas regard the Bible as an authentic account of early black African history and their place as Gods favoured people. They regard the Bible as the key to understanding both the past and the present and for predicting the future, while also regarding it as a source book from which they can form and legitimate their religious beliefs and practices. Rastas commonly regard the final book of the Bible, the ": null
    },
    {
        "Book of Revelation": "book of revelation"
    },
    {
        ", as the most important part, because they see its contents as having particular significance for the worlds present situation.     Contrary to scholarly understandings of how the Bible was compiled, Rastas commonly believe it was originally written on stone in the Ethiopian language of ": null
    },
    {
        "Amharic": "amharic"
    },
    {
        ". They also believe that the Bibles true meaning has been warped, both through mistranslation into other languages and by deliberate manipulation by those seeking to deny black Africans their history. They also regard it as cryptographic, meaning that it has many hidden meanings. They believe that its true teachings can be revealed through intuition and meditation with the book within . As a result of what they regard as the corruption of the Bible, Rastas also turn to other sources that they believe shed light on black African history. Common texts used for this purpose include ": null
    },
    {
        "Leonard Howell": "leonard howell"
    },
    {
        "s 42 work  The Promised Key , ": null
    },
    {
        "Robert Athlyi Rogers": "robert athlyi rogers"
    },
    {
        " 42 book  Holy Piby , and ": null
    },
    {
        "Fitz Balintine Pettersburg": "fitz balintine pettersburg"
    },
    {
        " 42s work, the  Royal Parchment Scroll of Black Supremacy .              Rastafari are ": null
    },
    {
        "monotheists": "monotheism"
    },
    {
        ", worshiping a singular God whom they call ": null
    },
    {
        "Jah": "jah"
    },
    {
        ". The term Jah is a shortened version of ": null
    },
    {
        "Jehovah": "jehovah"
    },
    {
        " , the name of God in English translations of the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        ". As well as regarding Jah as a deity, Rastas also believe that Jah is inherent within each human individual. This belief is reflected in the aphorism, often cited by Rastas, that God is man and man is God . Rastas speak of knowing Jah, rather than simply believing in him. In seeking to narrow the distance between humanity and divinity, Rastafari embraces ": null
    },
    {
        "mysticism": "mysticism"
    },
    {
        ".     ": null
    },
    {
        "Jesus of Nazareth": "jesus of nazareth"
    },
    {
        " is an important figure in Rastafari. However, practitioners reject the traditional Christian view of Jesus, particularly the depiction of him as a white European, believing that this is a perversion of the truth. They believe that Jesus was a black African and that he was a Rasta. Many Rastas regard Christianity as the creation of the white man; they treat it with suspicion out of the view that the oppressors and the oppressed cannot share the same God. Many Rastas take the view that the God worshipped by most white Christians is actually ": null
    },
    {
        "the Devil": "the devil"
    },
    {
        ", and a recurring saying among Rastas is that The Pope is Satan . Rastas therefore often view Christian preachers as deceivers, and regard Christianity as being guilty of furthering the oppression of the African diaspora, often referring to it as having perpetrated mental enslavement . Jesus is given particular prominence among a Rastafari denomination known as the Twelve Tribes of Israel. Rastas belonging to this group refer to Jesus as Yahshua and Yesus Kritos, and believe that his second coming is imminent.       From its origins, Rastafari was intrinsically linked with Haile Selassie, the Emperor of Ethiopia from 42 to 42 He remains the central figure in Rastafari ideology, and although all Rastas hold him in esteem, precise interpretations of his identity differ. Understandings of how Haile Selassie relates to Jesus differ among Rastas. Many, although not all, believe that the Ethiopian monarch was the ": null
    },
    {
        "Second Coming": "second coming"
    },
    {
        " of Jesus, legitimating this by reference to their interpretation of the nineteenth chapter of the ": null
    },
    {
        "Book of Revelation": "book of revelation"
    },
    {
        ". By viewing Haile Selassie as Jesus, these Rastas also regard him as the ": null
    },
    {
        "messiah": "messiah"
    },
    {
        " prophesied in the Old Testament, the manifestation of God in human form, and the living God . Some perceive him as part of a ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        ", alongside God as Creator and the ": null
    },
    {
        "Holy Spirit": "holy spirit"
    },
    {
        ", the latter referred to as the Breath within the temple . Rastas who view Haile Selassie as Jesus argue that both were descendants from the royal line of the Biblical king ": null
    },
    {
        "David": "david"
    },
    {
        ", while Rastas also emphasise the fact that the Makonnen dynasty, of which Haile Selassie was a member, claimed descent from the Biblical figures ": null
    },
    {
        "Solomon": "solomon"
    },
    {
        " and the ": null
    },
    {
        "Queen of Sheba": "queen of sheba"
    },
    {
        ".          Other Rastas see Selassie as embodying Jesus teachings and essence but reject the idea that he was the literal reincarnation of Jesus. Members of the Twelve Tribes of Israel denomination, for instance, reject the idea that Selassie was the Second Coming, arguing that that event has yet to occur. From this perspective, Selassie is perceived as a messenger or emissary of God rather than a manifestation of God himself. This attitude may be more pervasive among Rastas living in Africa itself, who are more familiar with the continents political problems. Rastas holding to this view sometimes regard the deification of Haile Selassie as naïve or ignorant; there are various Rastas who went from believing that Haile Selassie was both God incarnate and the Second Coming of Jesus to seeing him as something distinct.     On being crowned, Haile Selassie was given the title of King of Kings and Lord of Lords, Conquering Lion of the Tribe of Judah . Rastas use this title for Haile Selassie alongside others, such as Almighty God , Judge and Avenger , King Alpha and Queen Omega , Returned Messiah , Elect of God , and Elect of Himself . Rastas also view Haile Selassie as a symbol of their positive affirmation of Africa as a source of spiritual and cultural heritage.     During the 42s, many Jamaican Rastas professed the belief that Haile Selassie would never die. The 42 overthrow of Haile Selassie by the military ": null
    },
    {
        "Derg": "derg"
    },
    {
        " and his subsequent death in 42 resulted in a crisis of faith for many Rastas. Some practitioners left the movement altogether. Others remained, and developed new strategies for dealing with the news. Some Rastas believed that Selassie did not really die and that claims to the contrary were Western misinformation. To bolster their argument, they pointed to the fact that no corpse had been produced; in reality, Haile Selassies body had been buried beneath a toilet in his palace, remaining undiscovered there until 42 Another perspective within Rastafari acknowledged that Haile Selassies body had perished, but claimed that his inner essence survived as a spiritual force. A third response within the Rastafari community was that Selassies death was inconsequential as he had only been a personification of Jah rather than Jah himself.     During his life, Selassie described himself as a devout Christian. In a 42 interview, Selassie was asked about the Rastas views about him being the Second Coming of Jesus, to which he responded that: I have heard of this idea. I also met certain Rastafarians. I told them clearly that I am a man, that I am mortal, and that I will be replaced by the oncoming generation, and that they should never make a mistake in assuming or pretending that a human being is emanated from a deity.  His grandson ": null
    },
    {
        "Ermias Sahle Selassie": "ermias sahle selassie"
    },
    {
        " has said that there is no doubt that Haile Selassie did not encourage the Rastafari movement . Critics of Rastafari has used this as evidence that Rasta theological beliefs are incorrect, however for some Rastas, Selassies denials are taken as evidence was that he was indeed the incarnation of God.            According to Clarke, Rastafari is concerned above all else with black consciousness, with rediscovering the identity, personal and racial, of black people . The Rastafari movement began among Afro-Jamaicans who wanted to reject the British imperial culture that dominated Jamaica while creating a new identity based on a re-appropriation of their African heritage. Rastas equate blackness with the African continent and thus endorse a form of ": null
    },
    {
        "Pan-Africanism": "pan-africanism"
    },
    {
        ".     Practitioners of Rastafari identify themselves with the ancient ": null
    },
    {
        "Israelites": "israelites"
    },
    {
        "—Gods ": null
    },
    {
        "chosen people": "chosen people"
    },
    {
        " in the Old Testament—and believe that black Africans broadly or Rastas more specifically are either the descendants or reincarnations of this ancient people. This is similar to beliefs in ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        ", although many Rastas believe that modern Jews claims to be the descendants of the ancient Israelites are false. Rastas typically believe that black Africans are Gods chosen people, meaning that they made a deal with him and thus have a special responsibility. Rastafari espouses the view that the true identity of black Africans has been lost and needs to be reclaimed. In reclaiming this identity, Rastas believe, they will help to rid themselves of any feelings of inferiority.     There is no uniform Rasta view on race. Many Rastas endorse ": null
    },
    {
        "black supremacy": "black supremacy"
    },
    {
        ", believing in ": null
    },
    {
        "the existence of a distinct black African race": "scientific racism"
    },
    {
        " that is superior to other racial groups. This has opened the religion up to accusations of ": null
    },
    {
        "racism": "racism"
    },
    {
        " from its critics, including black Jamaicans. Cashmore noted that there was an implicit potential for racism in Rasta beliefs but that racism was not intrinsic to the religion. Some Rastas have acknowledged that there is racism in the movement, primarily against Europeans, Asians, and also against white European Rastas. Some Rasta sects reject the idea that a white European can ever be a legitimate Rasta. Others believe that an African identity is not inherently linked to black skin but rather is about whether an individual displays an African attitude or spirit .         Rastafari teaches that the black African diaspora are exiles living in Babylon , a term applied to ": null
    },
    {
        "Western society": "western world"
    },
    {
        ". For Rastas, European ": null
    },
    {
        "colonialism": "colonialism"
    },
    {
        " and global ": null
    },
    {
        "capitalism": "capitalism"
    },
    {
        " are regarded as manifestations of Babylon, while police and soldiers are viewed as its agents. The term Babylon is adopted because of its Biblical associations. In the Old Testament, ": null
    },
    {
        "Babylon": "babylon"
    },
    {
        " is the ": null
    },
    {
        "Mesopotamia": "mesopotamia"
    },
    {
        "n city which conquered and deported the Israelites from their homeland between 42 and 42 BCE. In the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        ", Babylon is used as a euphemism for the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ", which was regarded as acting in a destructive manner akin to the ancient Babylonians. Rastas view Babylon as being responsible for both the ": null
    },
    {
        "Atlantic slave trade": "atlantic slave trade"
    },
    {
        " which removed enslaved Africans from their continent and for the ongoing poverty facing the African diaspora. Rastas turn to scripture to explain the Atlantic slave trade. Rastas believe that the slavery, exile, and exploitation of black Africans was punishment for failing to live up to their status as Jahs chosen people.     Rastas regard Babylon as the ultimate ": null
    },
    {
        "evil": "evil"
    },
    {
        ". They perceive the exile of the black African diaspora in Babylon as an experience of great suffering, with the term suffering having a significant place in Rasta discourse. Rastas seek to delegitimise and destroy Babylon, something often conveyed in the Rasta aphorism Chant down Babylon . Adopting a Pan-Africanist ethos, many Rastas have criticised the division of Africa into nation-states, regarding this as a Babylonian development, and are often hostile to Western resource extraction from the continent. Rastas often expect white-dominant society to dismiss their beliefs as false, and when this happens they see it as confirmation of the correctness of their faith.        Rastas view ": null
    },
    {
        "Zion": "zion"
    },
    {
        " as an ideal to which they aspire. As with Babylon , this is again a term derived from the Bible, where it referred to an idealised ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        ", regarded as the City of God. Rastas use the term in reference either to Ethiopia or to Africa more widely, a land which has an almost mythological identity in Rasta discourse; many Rastas use the term Ethiopia synonymously with Africa . In doing so, Rastas reflect their desire to escape what they perceive as the domination and degradation that they experience in Babylon. During the first three decades of the Rastafari movement, it placed strong emphasis on the need for the African diaspora to be repatriated to Africa. To this end, various Rastas lobbied the Jamaican government and ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " to oversee this resettlement process. Other Rastas organised their own transportation to the African continent. Critics of the movement have argued that the migration of the entire African diaspora to Africa is implausible, particularly as no African country would welcome this.     By the movements fourth decade, the desire for physical repatriation to Africa had declined among Rastas. This change was influenced by observation of the ": null
    },
    {
        "42–42 famine in Ethiopia": "1983–1985 famine in ethiopia"
    },
    {
        ". Rather, many Rastas saw the idea of returning to Africa in a metaphorical sense, entailing restoring their pride and self-confidence as people of black African descent. The term liberation before repatriation began to be used within the movement. Some Rastas seek to transform Western society so that they may more comfortably live within it rather than seeking to move to Africa. There are nevertheless many Rastas who continue to emphasise the need for physical resettlement of the African diaspora in Africa. Some Rastas living elsewhere in Africa see no need to migrate to Ethiopia specifically because they believe that all of Africa falls under the Biblical understanding of Ethiopia ; thus, Rastas in Ghana for instance described themselves as already living within Ethiopia .         Rastafari is a ": null
    },
    {
        "millenarianist": "millenarianism"
    },
    {
        " movement, for it espouses the idea that the present age will come to an apocalyptic end. Many practitioners believe that on this ": null
    },
    {
        "Day of Judgement": "day of judgement"
    },
    {
        ", Babylon will be overthrown, with Rastas being the chosen few who survive the upheaval. With Babylon destroyed, Rastas believe that humanity will be ushered into a new age . This is conceived as being a millennium of peace, justice, and happiness in which the righteous shall live in Africa, which will be a paradise. In the 42s, Rastas believed that the Day of Judgment would happen around the year 42 A common view in the Rasta community was that the worlds white people would wipe themselves out through ": null
    },
    {
        "nuclear war": "nuclear war"
    },
    {
        ", with black Africans then ruling the world, something that they argue is prophesied in the ": null
    },
    {
        "Book of Daniel": "book of daniel"
    },
    {
        " .     Rastas do not believe that there is a specific ": null
    },
    {
        "afterlife": "afterlife"
    },
    {
        " to which human individuals go following bodily death. They believe in the possibility of eternal life, and that only those who shun righteousness will actually die. One Rasta view is that those who are righteous are believed to undergo ": null
    },
    {
        "reincarnation": "reincarnation"
    },
    {
        ", with an individuals identity remaining throughout each of their incarnations. Barrett observed some Jamaican Rastas who believed that those practitioners who did die had not been faithful to Jah. He suggested that this attitude stemmed from the large numbers of young people that were then members of the movement, and who had thus seen only few Rastas die. In keeping with their views on death, Rastas eschew celebrating physical death and often avoid funerals, also repudiating the practice of ": null
    },
    {
        "ancestor veneration": "ancestor veneration"
    },
    {
        " that is common among ": null
    },
    {
        "African traditional religion": "african traditional religion"
    },
    {
        "s.            Most Rastas share a pair of fundamental moral principles known as the two great commandments : love of God and love of neighbour. Rastafari promotes the idea of living naturally , in accordance with what Rastas regard as natures laws. It endorses the idea that Africa is the natural abode of black Africans, a continent where they can live according to African culture and tradition and be themselves on a physical, emotional, and intellectual level. Practitioners believe that Westerners and Babylon have detached themselves from nature through technological development and thus have become debilitated, slothful, and decadent. Some Rastas express the view that they should adhere to what they regard as African laws rather than the laws of Babylon, thus defending their involvement in certain acts which may be illegal in the countries that they are living in.     Some Rastas have promoted activism as a means of achieving socio-political change, while others believe in awaiting change that will be brought about through divine intervention in human affairs. In Jamaica, Rastas typically do not vote, derogatorily dismissing politics as politricks . The Rasta tendency to believe that socio-political change is inevitable opens the religion up to the criticism from the ": null
    },
    {
        "political left": "left-wing politics"
    },
    {
        " that it encouraged adherents to do little or nothing to change the status quo. Other Rastas do engage in political activism; the Ghanaian Rasta singer-songwriter ": null
    },
    {
        "Rocky Dawuni": "rocky dawuni"
    },
    {
        " for instance was involved in campaigns promoting democratic elections, while in ": null
    },
    {
        "Grenada": "grenada"
    },
    {
        ", many Rastas joined the ": null
    },
    {
        "Peoples Revolutionary Government": "peoples revolutionary government"
    },
    {
        " which was formed in 42         Rastafari promotes what it regards as the restoration of black manhood, believing that men in the African diaspora have been emasculated by Babylon. It espouses ": null
    },
    {
        "patriarchal": "patriarchy"
    },
    {
        " principles, including the idea that women should submit to male leadership. External observers—including scholars like Cashmore and Edmonds—have claimed that Rastafari accords women an inferior position to men. Rastafari women usually accept this subordinate position and regard it as their duty to obey their men; the academic Maureen Rowe suggested that women were willing to join the religion despite its restrictions because they valued the life of structure and discipline it provided. Rasta discourse often presents women as morally weak and susceptible to deception by ": null
    },
    {
        "evil": "evil"
    },
    {
        ", and claims that they are impure while ": null
    },
    {
        "menstruating": "menstruation"
    },
    {
        ". Rastas legitimise these gender roles by citing Biblical passages, particularly those in the ": null
    },
    {
        "Book of Leviticus": "book of leviticus"
    },
    {
        ", and in the writings of ": null
    },
    {
        "Paul the Apostle": "paul the apostle"
    },
    {
        ".          Rasta women usually wear clothing that covers their head and masks their body contours. Long skirts are usually worn rather than trousers, and women are expected to cover their head while praying. Rasta discourse insists this female dress code is necessary to prevent women attracting men and presents it as an antidote to the ": null
    },
    {
        "sexual objectification": "sexual objectification"
    },
    {
        " of women in Babylon. Rasta men are permitted to wear whatever they choose. Although men and women took part in early Rasta rituals alongside each other, from the late 42s and 42s a more radical movement within the Rasta community encouraged gender segregation for ceremonies. This was legitimised with the explanation that women were impure through menstruation and that their presence at the ceremonies would distract male participants.     As it existed in Jamaica, Rastafari did not promote monogamy. Rasta men are permitted multiple female sex partners, while women are expected to reserve their sexual activity for their one male partner. Marriage is not usually formalised through legal ceremonies but is a ": null
    },
    {
        "common law": "common law marriage"
    },
    {
        " affair, although there are many Rastas who are legally married. Rasta men refer to their female partners as queens , or empresses , while the males in these relationships are known as kingmen . Rastafari places great importance on family life and the raising of children, with reproduction being encouraged. The religion emphasises the place of men in child-rearing, associating this with the recovery of African manhood. Women often work, sometimes while the man is left to raise the children at home. Rastafari typically rejects ": null
    },
    {
        "feminism": "feminism"
    },
    {
        ", although since the 42s there have been increasing numbers of Rasta women calling for greater gender equity within the Rastafari movement. The scholar Terisa E. Turner for instance encountered Kenyan feminists who were appropriating Rastafari and redefining its content to suit their political agenda. Some Rasta women have challenged gender norms by wearing their hair uncovered in public and donning trousers.     Both ": null
    },
    {
        "contraception": "contraception"
    },
    {
        " and ": null
    },
    {
        "abortion": "abortion"
    },
    {
        " are usually censured by Rastas, and a common claim in Rasta discourse is that these were inventions of Babylon created in an attempt to decrease the black African birth-rate. Rastas typically express hostile attitudes to homosexuality, regarding homosexuals as evil and unnatural; this attitude derives from ": null
    },
    {
        "references to same-sex sexual activity in the Bible": "the bible and homosexuality"
    },
    {
        ". Homosexual Rastas probably conceal their sexual orientation because of these attitudes. Rastas typically see the growing acceptance of birth control and homosexuality in Western society as evidence of the degeneration of Babylon as it approaches its apocalyptic end.            Rastas refer to their cultural and religious practices as livity . Rastafari has no professional priesthood, with Rastas believing that there is no need for a priest to act as mediator between the worshipper and divinity. It nevertheless has Elders , an honorific title bestowed upon those with a good reputation among the community. Although respected figures, they do not necessarily have any administrative functions or responsibilities. When they do oversee ritual meetings, they are often responsible for helping to interpret current events in terms of Biblical scripture. Elders are often in communication with each other through a network.            The term grounding is used among Rastas to refer to the establishment of relationships between like-minded practitioners. Groundings often take place in a commune or yard, and are presided over by an elder. The elder is charged with keeping discipline in the group, and can ban certain individuals from attending. The number of participants can range from a handful to several hundred. Activities that take place at groundings include the playing of drums, chanting, the singing of hymns, and the recitation of poetry. Ganja, or cannabis, is often smoked. Most groundings contain only men, with women being excluded. Some Rasta women have established their own, all-female grounding circles.     One of the central activities at groundings is ": null
    },
    {
        "reasoning": "reasoning"
    },
    {
        " . This is a discussion among assembled Rastas about the religions principles and their relevance to current events. These discussions are supposed to be non-combative, although attendees can point out the fallacies in any arguments presented. Those assembled inform each other about the revelations that they have received through meditation and dream. Each contributor is supposed to push the boundaries of understanding until the entire group has gained greater insight into the topic under discussion. In meeting together with likeminded individuals, reasoning helps Rastas to reassure one another of the correctness of their beliefs. Rastafari meetings are opened and closed with prayers. These involve supplication of God, the supplication for the hungry, sick, and infants, calls for the destruction of the Rastas enemies, and then closes with statements of adoration.          The largest groundings were known as groundations or grounations in the 42s, although were subsequently re-termed Nyabinghi Issemblies . The term ": null
    },
    {
        "Nyabinghi": "nyabinghi"
    },
    {
        " is adopted from the name of a mythical African queen. Nyabinghi Issemblies are often held on dates associated with Ethiopia and Haile Selassie. These include Ethiopian Christmas , the day on which Haile Selassie visited Jamaica , Selassies birthday , Ethiopian New Year , and Selassies coronation day . Some Rastas also organise Nyabinghi Issemblies to mark Jamaicas Emancipation Day and ": null
    },
    {
        "Marcus Garvey": "marcus garvey"
    },
    {
        "s birthday .     Nyabinghi Issemblies typically take place in rural areas, being situated in the open air or in temporary structures—known as temples or tabernacles —which are specifically constructed for the purpose. Any elder seeking to sponsor a Nyabinghi Issembly must have approval from other elders to do so, and requires the adequate resources to organise such an event. The assembly usually lasts between three and seven days. During the daytime, those Rastas attending the event engage in food preparation, ganja smoking, and reasoning, while at night they focus on drumming and dancing around bonfires.   Nyabinghi Issemblies often attract Rastas from a wide area, including from different countries. They establish and maintain a sense of solidarity among the Rasta community and cultivate a feeling of collective belonging. Unlike in many other religions, ": null
    },
    {
        "rites of passage": "rites of passage"
    },
    {
        " play no role in Rastafari; on death, various Rastas have been given Christian funerals by their relatives, as there are no established Rasta funereal rites.          The principle ritual of Rastafari is the smoking of ganja, or ": null
    },
    {
        "cannabis": "cannabis"
    },
    {
        ". Among the names that Rastas give to the plant are callie, Iley, the herb , the holy herb , the grass , and the weed . In addition to smoking it, Rastas also ingest cannabis in a tea, as a spice in cooking, and as an ingredient in medicine. Cannabis is usually smoked during groundings; some Rastas smoke it almost all of the time, a view that other practitioners regard as excessive. However, not all Rastas use ganja, explaining that they have already achieved a higher level of consciousness and thus do not require it.          Rastas argue that the use of ganja is promoted in the Bible, specifically in Genesis 42:42 Psalms 42:42 and Revelation 42:42 They regard it as having healing properties, eulogise it for inducing feelings of peace and love , and claim that it cultivates a form of personal introspection that allows the smoker to discover their inner divinity, or InI consciousness . Some Rastas express the view that cannabis smoke serves as an incense that counteracts perceived immoral practices in society.     Rastas typically smoke cannabis through a form of large cigarette known as a ": null
    },
    {
        "spliff": "spliff"
    },
    {
        ". This is often rolled together while a prayer is offered to Jah; only once this is completed is the spliff lit and smoked. At other times, cannabis is smoked in a ": null
    },
    {
        "water pipe": "bong"
    },
    {
        " referred to as a chalice : styles include ": null
    },
    {
        "kutchie": "kutchie"
    },
    {
        "s, ": null
    },
    {
        "chillum": "chillum"
    },
    {
        "s, and steamers. The pipe is passed in a counter-clockwise direction around the assembled circle of Rastas.     There are various methods of transmission that might explain how cannabis smoking came to be part of Rastafari. By the 42th century, Arab traders had introduced cannabis to Central and Southern Africa. In the 42th century, enslaved ": null
    },
    {
        "Bakongo": "kongo people"
    },
    {
        " people arrived in Jamaica, where they established the religion of ": null
    },
    {
        "Kumina": "kumina"
    },
    {
        ". In Kumina, cannabis was smoked during religious ceremonies in the belief that it facilitated possession by ancestral spirits. The religion was largely practiced in south-east Jamaicas ": null
    },
    {
        "Saint Thomas Parish": "saint thomas parish, jamaica"
    },
    {
        ", where a prominent early Rasta, ": null
    },
    {
        "Leonard Howell": "leonard howell"
    },
    {
        ", lived while he was developing many of Rastafaris beliefs and practices; it may have been through Kumina that cannabis became part of Rastafari. A second possible source was the use of cannabis in ": null
    },
    {
        "Hindu": "hinduism"
    },
    {
        " rituals. Hindu migrants arrived in Jamaica as indentured servants from ": null
    },
    {
        "British India": "british india"
    },
    {
        " between 42 and 42 and brought cannabis with them. A Jamaican Hindu priest, Laloo, was one of Howells spiritual advisors, and may have influenced his adoption of ganja.     The adoption of cannabis may also have been influenced by the widespread medicinal and recreational use of cannabis among Afro-Jamaicans in the early 42th century. Early Rastafarians may have taken an element of Jamaican culture which they associated with their peasant past and the rejection of capitalism and sanctified it by according it Biblical correlates. In many countries, cannabis is illegal and by using it, Rastas protest the rules and regulations of Babylon. Rastas have also advocated for the legalisation of cannabis.            Rastafari music developed at reasoning sessions, where drumming, chanting, and dancing are all present. Rasta music is performed to praise and commune with Jah, and to reaffirm the rejection of Babylon. Rastas believe that their music has healing properties, with the ability to cure colds, fevers, and headaches. Many of these songs are sung to the tune of older Christian hymns, but others are original Rasta creations.     The bass-line of Rasta music is provided by the ": null
    },
    {
        "akete": "akete"
    },
    {
        ", a three-drum set, which is accompanied by ": null
    },
    {
        "percussion instruments": "percussion instruments"
    },
    {
        " like ": null
    },
    {
        "rattle": "rattle"
    },
    {
        "s and ": null
    },
    {
        "tambourine": "tambourine"
    },
    {
        "s. A syncopated rhythm is then provided by the ": null
    },
    {
        "fundeh": "fundeh"
    },
    {
        " drum. In addition, a ": null
    },
    {
        "peta": "peta"
    },
    {
        " drum improvises over the rhythm. The different components of the music are regarded as displaying different symbolism; the bassline symbolises blows against Babylon, while the lighter beats denote hope for the future.     As Rastafari developed, popular music became its chief communicative medium. During the 42s, ": null
    },
    {
        "ska": "ska"
    },
    {
        " was a popular musical style in Jamaica, and although its protests against social and political conditions were mild, it gave early expression to Rasta socio-political ideology. Particularly prominent in the connection between Rastafari and ska were the musicians ": null
    },
    {
        "Count Ossie": "count ossie"
    },
    {
        " and ": null
    },
    {
        "Don Drummond": "don drummond"
    },
    {
        ". Ossie was a drummer who believed that black people needed to develop their own style of music; he was heavily influenced by ": null
    },
    {
        "Kumina": "kumina"
    },
    {
        " and ": null
    },
    {
        "Burru": "burru"
    },
    {
        ", two drumming styles developed by African-Jamaicans. Ossie subsequently popularised this new Rastafari ritual music by playing at various groundings and groundations around Jamaica, with songs like Another Moses and Babylon Gone reflecting Rasta influence. Rasta themes also appeared in Drummonds work, with songs such as Reincarnation and Tribute to Marcus Garvey .     42 saw the development of ": null
    },
    {
        "reggae": "reggae"
    },
    {
        " in Jamaica, a musical style typified by slower, heavier rhythms than ska and the increased use of ": null
    },
    {
        "patois": "patois"
    },
    {
        ". Although like ": null
    },
    {
        "calypso": "calypso music"
    },
    {
        ", reggae was a medium for ": null
    },
    {
        "social commentary": "social commentary"
    },
    {
        ", it demonstrated a wider use of radical political and Rasta themes than were previously present in Jamaican popular music. Reggae artists incorporated Rasta ritual rhythms, and also adopted Rasta chants, language, motifs, and social critiques. Songs like ": null
    },
    {
        "The Wailers": "the wailers"
    },
    {
        " African Herbsman": "african herbsman"
    },
    {
        " and ": null
    },
    {
        "Peter Tosh": "peter tosh"
    },
    {
        "s Legalize It referenced cannabis use, while tracks like ": null
    },
    {
        "The Melodians": "the melodians"
    },
    {
        " Rivers of Babylon": "rivers of babylon"
    },
    {
        " and ": null
    },
    {
        "Junior Byles": "junior byles"
    },
    {
        " Beat Down Babylon referenced Rasta beliefs in Babylon. Reggae gained widespread international popularity during the mid42s, coming to be viewed as music of the oppressed by black people in many different countries. Many Rastas grew critical of reggae, believing that it had commercialised their religion. Although reggae contains much Rastafari symbolism, and the two are widely associated, the connection is often exaggerated by non-Rastas. Most Rastas do not listen to reggae music. Out of reggae came ": null
    },
    {
        "dub music": "dub music"
    },
    {
        "; dub artists often employ Rastafari terminology, even when not Rastas themselves.            In the 42s, a distinct form of Rasta language, often known as dreadtalk , developed among Jamaican practitioners. Rastas typically regard words as having an intrinsic power, with Rastafari language reflecting Rastas own experiences, as well as fostering a group identity and cultivating particular values. Rastas seek to avoid language that contributes to servility, self-degradation, and the objectification of the person. They believe that by formulating their own language they are launching an ideological attack on the integrity of the ": null
    },
    {
        "English language": "english language"
    },
    {
        ", which they view as a tool of Babylon. The use of this language helps Rastas distinguish themselves from non-Rastas, for whom—according to Barrett—Rasta rhetoric can be meaningless babbling .        Rastas make wide use of the pronoun I . The use of this word denotes the Rasta view that the self is divine. It also reminds each Rasta that they are a human being, not a slave, and that they have value, worth, and dignity as a human being. For instance, Rastas use I in place of me , I and I in place of we , I-ceive in place of receive , I-sire in place of desire , I-rate in place of create , and I-men in place of ": null
    },
    {
        "Amen": "amen"
    },
    {
        " . Rastas refer to this process as InI Consciousness or Isciousness . Rastas typically refer to Haile Selaisse as Haile Selassie I , thus indicating their belief in his divinity. Rastas also typically believe that the ": null
    },
    {
        "phonetics": "phonetics"
    },
    {
        " of a word should be linked to its meaning. For instance, Rastas often use the word downpression in place of oppression because oppression bears down on people rather than lifting them up, with up being phonetically akin to the opp- . Similarly, they often favour livicate over dedicate because ded- is phonetically akin to the word dead . In its early decades, Rastas often said Peace and Love as a greeting, although the use of this declined as the religion aged.     Rastas often make use of the colours red, black, green, and gold. Red, gold, and green were used in the ": null
    },
    {
        "Ethiopian flag": "flag of ethiopia"
    },
    {
        " while, prior to the development of Rastafari, the Jamaican ": null
    },
    {
        "black nationalist": "black nationalism"
    },
    {
        " activist Marcus Garvey had used red, green, and black as the colours for his ": null
    },
    {
        "United Negro Improvement Association": "united negro improvement association"
    },
    {
        ". According to Garvey, the red symbolised the blood of martyrs, the black symbolised the skin of Africans, and the green represented the vegetation of the land. Many Rastas endorse these associations to the colours. The colour gold is often included alongside Garveys three colours; it has been adopted from the ": null
    },
    {
        "Jamaican flag": "flag of jamaica"
    },
    {
        ", and is often interpreted as symbolising the minerals and raw materials which constitute Africas wealth. Rastas often paint these colours onto their buildings, vehicles, kiosks, and other items, or display them on their clothing, helping to demarcate Rastas from non-Rastas and allowing adherents to recognise their co-religionists. As well as being used by Rastas, the colour set has also been adopted by Pan-Africanists more broadly, who use it to display their identification with Afrocentricity; for this reason it was adopted on the flags of many post-independence African states. Rastas often accompany the use of these three or four colours with the image of the ": null
    },
    {
        "Lion of Judah": "lion of judah"
    },
    {
        ", also adopted from the Ethiopian flag and symbolizing Haile Selassie.               Rastas seek to produce food naturally , eating what they call ": null
    },
    {
        "ital": "ital"
    },
    {
        ", or natural food. This is often produced ": null
    },
    {
        "organically": "organic farming"
    },
    {
        ", and locally. Most Rastas adhere to the ": null
    },
    {
        "dietary laws": "kosher"
    },
    {
        " outlined in the Book of Leviticus, and thus avoid eating pork or crustaceans. Other Rastas remain totally ": null
    },
    {
        "vegetarian": "vegetarianism"
    },
    {
        ", and also avoid the addition of any additives, including sugar and salt, to their food. Rasta dietary practices have come under ridicule from non-Rastas; in Ghana for example, where food traditionally includes a high meat content, the Rastas emphasis on vegetable produce has led to the joke that they eat like sheep and goats . In Jamaica, Rasta practitioners have commercialised ital food, for instance by selling fruit juices prepared according to Rasta custom.     Rastafarians typically avoid food produced by non-Rastas or from unknown sources. Rasta men refuse to eat food prepared by a woman while she is menstruating, and some will avoid any food prepared by a woman at any time. Rastas also generally avoid ": null
    },
    {
        "alcohol": "alcohol"
    },
    {
        ", ": null
    },
    {
        "cigarettes": "cigarettes"
    },
    {
        ", and hard drugs such as ": null
    },
    {
        "heroin": "heroin"
    },
    {
        " and ": null
    },
    {
        "cocaine": "cocaine"
    },
    {
        ".            Rastas use their physical appearance as a means of visually demarcating themselves from non-Rastas. Male practitioners will often grow long beards. However, it is the formation of hair into ": null
    },
    {
        "dreadlocks": "dreadlocks"
    },
    {
        " that is one of the most recognisable Rasta symbols. Rastas believe that dreadlocks are promoted in the Bible, specifically in the ": null
    },
    {
        "Book of Numbers": "book of numbers"
    },
    {
        " , and regard them as a symbol of strength linked to the hair of the Biblical figure of ": null
    },
    {
        "Samson": "samson"
    },
    {
        ". They argue that their dreadlocks mark a covenant that they have made with Jah, and reflect their commitment to the idea of naturalness. They also perceive the wearing of dreads as a symbolic rejection of Babylon and a refusal to conform to its norms regarding grooming aesthetics. Rastas are often critical of black people who straighten their hair, believing that it is an attempt to imitate white European hair and thus reflects alienation from a persons African identity. Sometimes this dreadlocked hair is then shaped and styled, often inspired by a lions mane symbolising Haile Selassie, who is regarded as the Conquering Lion of Judah .     Some Rastas do not wear their hair in dreadlocks; within the religion they are often termed cleanface Rastas, with those wearing dreadlocked hair often called locksmen . Some Rastas have also joined the ": null
    },
    {
        "Ethiopian Orthodox Church": "ethiopian orthodox church"
    },
    {
        ", the Christian organisation to which Haile Selassie belonged, and these individuals are forbidden from putting their hair in deadlocks by the Church. In reference to Rasta hairstyles, Rastas often refer to non-Rastas as baldheads , while those who are new to Rastafari and who have only just started to grow their hair into dreads are known as nubbies . Members of the Bobo Ashanti sect of Rastas conceal their dreadlocks within turbans, while some Rastas tuck their dreads under a ": null
    },
    {
        "tam": "tam o shanter"
    },
    {
        " headdress; these are typically coloured green, red, black, and yellow to symbolise allegiance and identification with Ethiopia.   Dreadlocks and Rastafari-inspired clothing have also been worn for aesthetic reasons by non-Rastas. For instance, many reggae musicians who do not adhere to the Rastafari religion wear their hair in dreads.          From the beginning of the Rastafari movement in the 42s, adherents typically grew beards and tall hair, perhaps in imitation of Haile Selassie. The wearing of hair as dreadlocks then emerged as a Rasta practice in the 42s; there were firm debates within the movement as to whether dreadlocks should be worn or not, with proponents of the style becoming dominant. Within the oral culture of the movement, there are various different claims as to how this practice was adopted. One claim is that it was adopted in imitation of certain African nations, such as the ": null
    },
    {
        "Maasai": "maasai people"
    },
    {
        ", ": null
    },
    {
        "Somalis": "somalis"
    },
    {
        ", or ": null
    },
    {
        "Oromo": "oromo people"
    },
    {
        ", or that it was inspired by the hairstyles worn by some of those involved in the anti-colonialist ": null
    },
    {
        "Mau Mau Uprising": "mau mau uprising"
    },
    {
        " in Kenya. An alternative explanation is that it was inspired by the hairstyles of the ": null
    },
    {
        "Hindu": "hinduism"
    },
    {
        " sadhus": "sadhus"
    },
    {
        ".     The wearing of dreadlocks has contributed to negative views of Rastafari among non-Rastas, many of whom regard it as wild and unattractive. Dreadlocks remain socially stigmatised in many societies; in Ghana for example, they are often associated with the homeless mentally ill, with such associations of marginality extending onto Ghanaian Rastas. In Jamaica during the mid42th century, teachers and police officers used to cut off the dreads of Rastas. In the United States, several public schools and workplaces have lost lawsuits as the result of banning locks. In 42 a Rasta group settled a federal lawsuit with the ": null
    },
    {
        "Grand Central Partnership": "grand central partnership"
    },
    {
        " in New York City, allowing them to wear their locks in ponytails, rather than be forced to painfully tuck in their long hair in their uniform caps.          The Rastafari movement developed out of the legacy of the ": null
    },
    {
        "Atlantic slave trade": "atlantic slave trade"
    },
    {
        ", in which over ten million Africans were enslaved and transported from Africa to the Americas between the sixteenth and nineteenth centuries. Here, they were sold to European planters and forced to work on the plantations. Around a third of these transported Africans were relocated in the Caribbean, with under 42 being settled in Jamaica. In 42 slavery in Jamaica was abolished after the British government passed the ": null
    },
    {
        "Slavery Abolition Act 42": "slavery abolition act 1833"
    },
    {
        ". Racial prejudice nevertheless remained prevalent across Jamaican society, with the overwhelming majority of Jamaicas legislative council remaining white throughout the nineteenth century, and those of African descent being treated as ": null
    },
    {
        "second-class citizen": "second-class citizen"
    },
    {
        "s.     Christian Revivalism was a key influence on Rastafari. Many Afro-Jamaicans joined Christian churches during the Great Revival of 42–42 They brought with them many inherited African beliefs and rituals, which syncretised with Christianity in various ways and to varying degrees. Some of the new religions that emerged, such as Pukkumina, remained heavily based on traditional African religion, while others, like Revival Zion, were more fully Christian. The majority of these groups practiced spiritual healing and incorporated drumming and chanting, counselling, and spirit possession into their structures. Increasing numbers of ": null
    },
    {
        "Pentecostal": "pentecostalism"
    },
    {
        " missionaries from the United States arrived in Jamaica during the early twentieth century, reaching a climax in the 42s. They provided a way for black Jamaicans—who continued to live with the social memory of enslavement and who were denied any substantial participation in Jamaicas political institutions—to express their hopes, fears, and aspirations.            According to Edmonds, Rastafari emerged from the convergence of several religious, cultural, and intellectual streams , while fellow scholar Wigmoore Francis described it as owing much of its self-understanding to intellectual and conceptual frameworks dating from the nineteenth and early twentieth centuries. Both ": null
    },
    {
        "Ethiopianism": "ethiopianism"
    },
    {
        " and the ": null
    },
    {
        "Back to Africa": "back to africa"
    },
    {
        " ethos remain fundamental ingredients of Rastafarian ideology . These two movements predated Rastafari and can be traced back to the eighteenth century.     In the nineteenth century, there were growing calls for the African diaspora located in Western Europe and the Americas to be resettled in Africa. In that century, many members of the African diaspora were moved to Sierra Leone and Liberia. Based in Liberia, the black Christian preacher ": null
    },
    {
        "Edward Wilmot Blyden": "edward wilmot blyden"
    },
    {
        " began promoting African pride and the preservation of African tradition, customs, and institutions. Blyden sought to promote a form of Christianity that was suited to the African context, and believed that black people had to acquire their own historical knowledge about themselves. The idea of the African diasporas return to Africa was given impetus by the creation of the ": null
    },
    {
        "State of Israel": "israel"
    },
    {
        " in 42 as a nation-state for the ": null
    },
    {
        "Jewish diaspora": "jewish diaspora"
    },
    {
        " to return to.     Also spreading through Africa was Ethiopianism, a movement that accorded special status to the east African nation of Ethiopia because it was mentioned in various Biblical passages. For adherents of Ethiopianism, Ethiopia was regarded as a synonym of Africa as a whole. Across the continent, although particularly in South Africa, Christian churches were established that referred to themselves as Ethiopian ; these groups were at the forefront of the burgeoning African nationalist movement that sought liberation from European colonial rule.     Of significant influence on Rastafari was the Jamaican-born activist Marcus Garvey, who spent much of his adult life in the United States and United Kingdom. Garvey supported the idea of global ": null
    },
    {
        "racial separatism": "black separatism"
    },
    {
        " and rejected the idea that black people of African descent living in the Americas should campaign for their civil rights; instead he believed that they should migrate en masse back to Africa. His ideas were opposed by many blacks in the Americas and he experienced hostility from African-American civil rights activists like ": null
    },
    {
        "W. E. B. Du Bois": "w. e. b. du bois"
    },
    {
        ". He also faced opposition from the government of Liberia, which did not want millions of unskilled migrants arriving on its shores. As a mass movement, Garveyism declined in the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        " of the 42s.     A rumour later spread that in 42 Garvey had called on his supporters to look to Africa for the crowning of a black king; this quote was never verified. Soumahoro noted that this statement was legendary . Rather, Garvey was critical of Haile Selassie for leaving Ethiopia at the time of the Italian Fascist occupation, describing the king as a great coward who rules a country where black men are chained and flogged.  Rastafari does not promote all of the views that Garvey espoused, but nevertheless shares many of the same perspectives, with many Rastas regarding Garvey as a prophet. According to Soumahoro, Rastafari emerged from the socio-political ferment inaugurated by Marcus Garvey , while for Cashmore, Garvey was the most important precursor of the Rastafari movement.         Haile Selassie was crowned Emperor of Ethiopia in 42 A number of Jamaicas Christian clergymen claimed that Selassies coronation was evidence that he was the black messiah that they believed was prophesied in the Book of Revelation , the ": null
    },
    {
        "Book of Daniel": "book of daniel"
    },
    {
        " , and the ": null
    },
    {
        "Book of Psalms": "psalms"
    },
    {
        " . Over the following years, a number of street preachers—most notably ": null
    },
    {
        "Leonard Howell": "leonard howell"
    },
    {
        ", ": null
    },
    {
        "Archibald Dunkley": "archibald dunkley"
    },
    {
        ", ": null
    },
    {
        "Robert Hinds": "robert hinds"
    },
    {
        ", and ": null
    },
    {
        "Joseph Hibbert": "joseph hibbert"
    },
    {
        "—began promoting the idea that Haile Selassie was the returned Jesus. These preachers began promoting this idea within Kingston, and soon the message spread throughout 42s Jamaica. Clarke stated that to all intents and purposes this was the beginning of the Rastafari movement.          Howell has been described as the leading figure in the early Rastafari movement. Howell preached that black Africans were superior to white Europeans and that Afro-Jamaicans should owe their allegiance to Haile Selassie rather than to ": null
    },
    {
        "George V": "george v of the united kingdom"
    },
    {
        ", King of ": null
    },
    {
        "Great Britain and Ireland": "united kingdom of great britain and ireland"
    },
    {
        ". The islands British authorities arrested him and charged him with sedition, resulting in a two-year imprisonment. Following his release, Howell established the ": null
    },
    {
        "Ethiopian Salvation Society": "ethiopian salvation society"
    },
    {
        " and in 42 created a Rasta community known as Pinnacle, in St Catherine. The community attracted between 42 and 42 people, who were largely self-sufficient. Police feared that Howell was training his followers for an armed rebellion and were angered that it was producing marijuana for sale among the wider community. They raided the community on several occasions and Howell was imprisoned for a further two years. On his release he returned to Pinnacle, but the police continued with their raids and shut down the community in 42; Howell himself was committed to a mental hospital.     In 42 Italy ": null
    },
    {
        "invaded and occupied Ethiopia": "second italo-ethiopian war"
    },
    {
        ", with Haile Selassie going into exile. The event brought international condemnation and growing sympathy for the Ethiopian cause. In 42 Selassie then created the ": null
    },
    {
        "Ethiopian World Federation": "ethiopian world federation"
    },
    {
        ", which established a branch in Jamaica in 42 In 42 the Italians were driven out of Ethiopia and Selassie returned. For many Rastas, this event was interpreted as the fulfilment of an event described in the Book of Revelation .         Rastafaris main appeal was among the lower classes of Jamaican society. For its first thirty years, Rastafari was in a conflictual relationship with the Jamaican authorities. Jamaicas Rastas expressed contempt for many aspects of the islands society, viewing the government, police, bureaucracy, professional classes, and established churches as instruments of Babylon. Relations between practitioners and the police were strained, with Rastas often being arrested for cannabis possession. During the 42s the movement grew rapidly in Jamaica itself and also spread to other Caribbean islands, the United States, and the United Kingdom.        In the 42s and 42s, a more militant brand of Rastafari emerged. The vanguard of this was the ": null
    },
    {
        "House of Youth Black Faith": "house of youth black faith"
    },
    {
        ", a group whose members were largely based in ": null
    },
    {
        "West Kingston": "west kingston, jamaica"
    },
    {
        ".   Backlash against the Rastas grew after a practitioner of the religion allegedly killed a woman in 42 In March 42 the first Rastafarian Universal Convention was held in ": null
    },
    {
        "Back-o-Wall": "back-o-wall"
    },
    {
        ", Kingston. Following the event, militant Rastas unsuccessfully tried to capture the city in the name of Haile Selassie. Later that year they tried again in ": null
    },
    {
        "Spanish Town": "spanish town"
    },
    {
        ". The increasing militancy of some Rastas resulted in growing alarm about the religion in Jamaica. According to Cashmore, the Rastas became folk devils in Jamaican society. In 42 the self-declared prophet and founder of the ": null
    },
    {
        "African Reform Church": "african reform church"
    },
    {
        ", ": null
    },
    {
        "Claudius Henry": "claudius henry"
    },
    {
        ", sold thousands of black Jamaicans, including many Rastas, tickets for a ship that he claimed would take them to Africa. The ship never arrived and Henry was charged with fraud. In 42 he was sentenced to six years imprisonment for conspiring to overthrow the government. Henrys son was accused of being part of a paramilitary cell and executed, confirming public fears about Rasta violence. One of the most prominent clashes between Rastas and law enforcement was the ": null
    },
    {
        "Coral Gardens incident": "coral gardens incident"
    },
    {
        " of 42 Clamping down on the Rasta movement, in 42 the islands government implemented tougher laws surrounding marijuana use.     At the invite of Jamaicas government, Haile Selassie visited the island for the first time in August 42 with crowds of Rastas assembling to meet him at the airport. The event was the high point for many of the religions members. Over the course of the 42s, Jamaicas Rasta community underwent a process of ": null
    },
    {
        "routinization": "charismatic authorityroutinizing charisma"
    },
    {
        ", with the late 42s witnessing the launch of the first official Rastafarian newspaper, the ": null
    },
    {
        "Rastafarian Movement Association": "rastafarian movement association"
    },
    {
        "s Rasta Voice. The decade also saw Rastafari develop in increasingly complex ways. During that decade, some Rastas began to reinterpret the idea that salvation required a physical return to Africa, instead interpreting salvation as coming through a process of mental decolonisation that embraced African approaches to life.     Whereas its membership had previously come predominantly from poorer sectors of Jamaican society, in the 42s Rastafari began to attract support from more privileged groups like students and professional musicians. The foremost group emphasising this approach were the Twelve Tribes of Israel, whose members came to be known as Uptown Rastas . Among those attracted to Rastafari in this decade were middle-class intellectuals like ": null
    },
    {
        "Leahcim Semaj": "leahcim semaj"
    },
    {
        ", who called for the religious community to place greater emphasis on scholarly social theory as a method of achieving change. Although some Jamaican Rastas were critical of him, many came under the influence of the Guyanese black nationalist academic ": null
    },
    {
        "Walter Rodney": "walter rodney"
    },
    {
        ", who lectured to their community in 42 before publishing his thoughts as the pamphlet Groundings. Like Rodney, many Jamaican Rastas were influenced by the U.S.-based ": null
    },
    {
        "Black Power": "black power"
    },
    {
        " movement. After Black Power declined following the deaths of prominent exponents such as ": null
    },
    {
        "Malcolm X": "malcolm x"
    },
    {
        ", ": null
    },
    {
        "Michael X": "michael x"
    },
    {
        ", and ": null
    },
    {
        "George Jackson": "george jackson"
    },
    {
        ", Rastafari filled the vacuum it left for many black youth.            In the mid42s, reggaes international popularity exploded. The most successful reggae artist was Bob Marley, who—according to Cashmore— more than any other individual, was responsible for introducing Rastafarian themes, concepts and demands to a truly universal audience . Reggaes popularity led to a growth in pseudo-Rastafarians , individuals who listened to reggae and wore Rasta clothing but did not share its belief system. Many Rastas were angered by this, believing it commercialised their religion.     Through reggae, Rasta musicians became increasingly important in Jamaicas political life during the 42s. In his desire to move towards ": null
    },
    {
        "democratic socialism": "democratic socialism"
    },
    {
        ", Jamaican Prime Minister ": null
    },
    {
        "Michael Manley": "michael manley"
    },
    {
        " employed some Rasta imagery, and also courted and obtained support from Marley and other reggae musicians, thus helping to bolster his popularity with the electorate. Manley described Rastas as a beautiful and remarkable people , and carried a cane, the rod of correction , which he claimed was a gift from Haile Selassie. Following Manleys example, Jamaican political groups increasingly employed Rasta language, symbols, and reggae references in their campaigns, while Rasta symbols became increasingly mainstream in Jamaican society. This helped to confer greater legitimacy on Rastafari, with reggae and Rasta imagery being increasingly presented as a core part of Jamaicas ": null
    },
    {
        "cultural heritage": "cultural heritage"
    },
    {
        " for the marketing purposes of the growing tourist industry.     Enthusiasm for Rastafari was likely dampened by the death of Haile Selassie in 42 and that of Marley in 42 During the 42s, the number of Rastas in Jamaica declined, with Pentecostal and other Charismatic Christian groups proving more successful at attracting young recruits. Several publicly prominent Rastas converted to Christianity, and two of those who did so—": null
    },
    {
        "Judy Mowatt": "judy mowatt"
    },
    {
        " and ": null
    },
    {
        "Tommy Cowan": "tommy cowan"
    },
    {
        "—maintained that Marley had converted from Rastafari to Christianity, in the form of the ": null
    },
    {
        "Ethiopian Orthodox Church": "ethiopian orthodox church"
    },
    {
        ", during his final days. The significance of Rastafari messages in reggae also declined with the growing popularity of ": null
    },
    {
        "dancehall": "dancehall"
    },
    {
        ", a Jamaican musical genre that typically foregrounded lyrical themes of hyper-masculinity, violence, and sexual activity rather than religious symbolism. However, in the 42s, a Rasta practitioner, ": null
    },
    {
        "Barbara Makeda Blake Hannah": "barbara makeda blake hannah"
    },
    {
        ", was appointed a Senator in the Jamaican Parliament.     The mid42s saw a revival of Rastafari-focused reggae associated with musicians like ": null
    },
    {
        "Anthony B": "anthony b"
    },
    {
        ", ": null
    },
    {
        "Buju Banton": "buju banton"
    },
    {
        ", ": null
    },
    {
        "Luciano": "luciano"
    },
    {
        ", ": null
    },
    {
        "Sizzla": "sizzla"
    },
    {
        ", and ": null
    },
    {
        "Capleton": "capleton"
    },
    {
        ". From the 42s, Jamaica also witnessed the growth of organised political activity within the Rasta community, seen for instance through campaigns for the legalisation of marijuana and the creation of political parties like the ": null
    },
    {
        "Jamaican Alliance Movement": "jamaican alliance movement"
    },
    {
        " and the ": null
    },
    {
        "Imperial Ethiopian World Federation Incorporated Political Party": "imperial ethiopian world federation incorporated political party"
    },
    {
        ", none of which attained more than minimal electoral support.         Rastafari is not a homogeneous movement and has no single administrative structure, nor any single leader. Rastas avoid centralised and hierarchical structures because they do not want to replicate the structures of Babylon and because their religions ultra-individualistic ethos places emphasis on inner divinity. The structure of Rastafari groups is less like those of Christian denominations and is instead akin to the cellular structure of other African diasporic traditions like ": null
    },
    {
        "Haitian Vodou": "haitian vodou"
    },
    {
        ", Cuban ": null
    },
    {
        "Santería": "santería"
    },
    {
        ", and Jamaicas ": null
    },
    {
        "Revival Zion": "revival zion"
    },
    {
        ". Since the 42s, there have been attempts to unify all Rastas, namely through the establishment of the ": null
    },
    {
        "Rastafari Movement Association": "rastafari movement association"
    },
    {
        ", which sought political mobilisation. In 42 the first international assembly of Rastafari groups took place in ": null
    },
    {
        "Toronto": "toronto"
    },
    {
        ", Canada. This and subsequent international conferences, assemblies, and workshops have helped to cement global networks and cultivate an international community of Rasta practitioners.            Sub-divisions of Rastafari are often referred to as houses or mansions , in keeping with a passage from the ": null
    },
    {
        "Gospel of John": "gospel of john"
    },
    {
        " : as translated in the ": null
    },
    {
        "King James Bible": "king james bible"
    },
    {
        ", Jesus states In my fathers house are many mansions . The three most prominent branches are the House of Nyabinghi, the Bobo Ashanti, and the Twelve Tribes of Israel, although other important groups include the Church of Haile Selassie I, Inc., and the Fulfilled Rastafari.     Probably the largest Rastafari group, the ": null
    },
    {
        "House of Nyabinghi": "nyabinghi"
    },
    {
        " is an aggregate of more traditional and militant Rastas who seek to retain the movement close to the way in which it existed during the 42s. They stress the idea that Haile Selassie was Jah and the reincarnation of Jesus. The wearing of dreadlocks is regarded as indispensable and patriarchal gender roles are strongly emphasised, while, according to Cashmore, they are vehemently anti-white . Nyabinghi Rastas refuse to compromise with Babylon, and are often critical of reggae musicians like Marley, whom they regard as having collaborated with the commercial music industry.     The ": null
    },
    {
        "Bobo Ashanti": "bobo ashanti"
    },
    {
        " sect was founded in Jamaica by ": null
    },
    {
        "Emanuel Charles Edwards": "charles edwards"
    },
    {
        " through the establishment of his Ethiopia Africa Black International Congress in 42 The group established a commune in ": null
    },
    {
        "Bull Bay": "bull bay"
    },
    {
        ", where they were led by Edwards until his 42 death. The group hold to a highly rigid ethos. Edwards advocated the idea of a new trinity, with Haile Selassie as the living God, himself as the Christ, and Garvey as the prophet. Male members are divided into two categories: the priests who conduct religious services and the prophets who take place in reasoning sessions. Women are regarded as impure because of menstruation and childbirth, and so are not permitted to cook for men. The group teaches that black Africans are Gods chosen people and are superior to white Europeans, with members often refusing to associate with white people. Bobo Ashanti Rastas are recognisable by their long, flowing robes and turbans.          The ": null
    },
    {
        "Twelve Tribes of Israel": "twelve tribes of israel"
    },
    {
        " sect was founded in 42 in Kingston by ": null
    },
    {
        "Vernon Carrington": "vernon carrington"
    },
    {
        ". He proclaimed himself the reincarnation of the Old Testament prophet ": null
    },
    {
        "Gad": "gad"
    },
    {
        " and his followers call him Prophet Gad , Brother Gad , or Gadman . It is commonly regarded as the most liberal form of Rastafari and the closest to Christianity; some Rastas regard it as being heretical. Practitioners are often dubbed Christian Rastas because they believe Jesus is the only saviour; Haile Selassie is accorded importance, but is not viewed as the second coming of Jesus. The group divides its members into twelve groups according to which ": null
    },
    {
        "Hebrew calendar": "hebrew calendar"
    },
    {
        " month they were born; each month is associated with a particular colour, body part, and mental function. Maintaining dreadlocks and an ital diet are considered commendable but not essential, while adherents are called upon to read a chapter of the Bible each day.     The Twelve Tribes peaked in popularity during the 42s, when it attracted artists, musicians, and many middle-class followers, resulting in the term middle-class Rastas and uptown Rastas being applied to members of the group. Marley was one such of these musicians belonging to the Twelve Tribes. Carrington died in 42 since which time the Twelve Tribes of Israel have been led by an executive council. As of 42 it was recorded as being the largest of the centralized Rasta groups. It remains headquartered in Kingston, although has followers outside Jamaica; it was responsible for establishing the Rasta community in Shashame, Ethiopia.     The Church of Haile Selassie, Inc was founded by Abuna Foxe, and operated much like a mainstream Christian church, with a hierarchy of functionaries, weekly services, and ": null
    },
    {
        "Sunday schools": "sunday schools"
    },
    {
        ". In adopting this broad approach, the Church seeks to develop Rastafaris respectability in wider society. Fulfilled Rastafari is a multi-ethnic movement that has spread in popularity during the twenty-first century, in large part through the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ". The Fulfilled Rastafari group accept Haile Selassies statements that he was a man and that he was a devout Christian, and so place emphasis on worshipping Jesus through the example set forth by Haile Selassie. The wearing of dreadlocks and the adherence to an ital diet are considered issues up to the individual.              As of 42 there were an estimated 42 to 42 million Rastas worldwide. They can be found in many different regions, including most of the worlds major population centers. Rastafaris influence on wider society has been more substantial than its numerical size, particularly in fostering a racial, political, and cultural consciousness among the African diaspora, Africans themselves, and other dominated communities across the world. Men dominate Rastafari. In its early years, most of its followers were men, and the women who did adhere to it tended to remain in the background. This picture of Rastafaris demographics has been confirmed by ethnographic studies conducted in the late twentieth and twenty-first centuries.     The Rasta message resonates with many people who feel marginalised and alienated by the values and institutions of their society. Internationally, it has proved most popular among the poor and among marginalised youth. In valorising Africa and blackness, Rastafari provides a positive identity for youth in the African diaspora by allowing them to psychologically reject their social stigmatisation. It then provides these disaffected people with the discursive stance from which they can challenge capitalism and consumerism, providing them with symbols of resistance and defiance. Cashmore expressed the view that whenever there are black people who sense an injust disparity between their own material conditions and those of the whites who surround them and tend to control major social institutions, the Rasta messages have relevance.          Rastafari is a non-missionary religion. However, elders from Jamaica often go trodding to instruct new converts in the fundamentals of the religion. On researching English Rastas during the 42s, Cashmore noted that they had not ": null
    },
    {
        "converted": "religious conversion"
    },
    {
        " instantaneously, but rather had undergone a process of drift through which they gradually adopted Rasta beliefs and practices, resulting in their ultimate acceptance of Haile Selassies central importance. Rastas often claim that—rather than converting to the religion—they were actually always a Rasta and that their embrace of its beliefs was merely the realisation of this. There is no formal ritual carried out to mark an individuals entry into the Rastafari movement. Rastas regard themselves as an exclusive and elite community, membership of which is restricted to those who have the insight to recognise Haile Selassies importance. Practitioners thus often regard themselves as the enlightened ones who have seen the light . Many see no point in establishing good relations with non-Rastas, believing that the latter will never accept Rastafari doctrine as truth.     Some Rastas have left the religion. Clarke noted that among British Rastas, some returned to Pentecostalism and other forms of Christianity, while others embraced ": null
    },
    {
        "Islam": "islam"
    },
    {
        " or no religion. Some English ex-Rastas described disillusionment when the societal transformation promised by Rastafari failed to appear, while others felt that while Rastafari would be appropriate for agrarian communities in Africa and the Caribbean, it was not suited to industrialised British society. Some experienced disillusionment after developing the view that Haile Selassie had been an oppressive leader of the Ethiopian people. Cashmore found that some British Rastas who had more militant views left the religion after finding its focus on reasoning and music insufficient for the struggle against white domination and racism.       Rastafari has spread to many areas of the world and adapted into many localised variants. It has spread primarily in Anglophone regions and countries, largely because reggae music has primarily been produced in the English language. It is thus most commonly found in the Anglophone Caribbean, United States, Canada, United Kingdom, Australia and New Zealand, and Anglophone parts of Africa.            Barrett described Rastafari as the largest, most identifiable, indigenous movement in Jamaica.  In the mid42s, there were approximately 42 members and sympathisers of Rastafari in Jamaica. The majority of them were male, working-class, former Christians aged between 42 and 42 In the 42 Jamaican census, 42 individuals identified as Rastas.  Jamaicas Rastas were initially entirely from the Afro-Jamaican majority, and although most remain Afro-Jamaican, Rastafari has also gained members from the islands ": null
    },
    {
        "Chinese": "chinese jamaicans"
    },
    {
        ", ": null
    },
    {
        "Indian": "indo-jamaicans"
    },
    {
        ", Afro-Chinese, Afro-Jewish, ": null
    },
    {
        "mulatto": "mulatto"
    },
    {
        ", and ": null
    },
    {
        "white": "white jamaican"
    },
    {
        " minorities. Until 42 the vast majority were from the lower classes, although it has since attracted many middle-class members; by the 42s there were Jamaican Rastas working as lawyers and university professors. Jamaica is often valorised by Rastas as the fountain-head of their faith, and many Rastas living elsewhere travel to the island on ": null
    },
    {
        "pilgrimage": "pilgrimage"
    },
    {
        ".     Through reggaes popularity, Rastafari spread across the eastern Caribbean during the 42s, where its ideas complemented the anti-colonial and Afrocentric views prevalent in countries like Trinidad, Grenada, Dominica, and St Vincent. In these countries, the early Rastas often engaged in cultural and political movements to a greater extent than their Jamaican counterparts had. Various Rastas were involved in Grenadas 42 ": null
    },
    {
        "New Jewel Movement": "new jewel movement"
    },
    {
        " and were given positions in the Grenadine government until it was overthrown and replaced following the ": null
    },
    {
        "U.S. invasion of 42": "invasion of grenada"
    },
    {
        ". Although ": null
    },
    {
        "Fidel Castro": "fidel castro"
    },
    {
        "s Marxist–Leninist government generally discouraged foreign influences, Rastafari was introduced to Cuba alongside reggae in the 42s. Foreign Rastas studying in Cuba during the 42s connected with its reggae scene and helped to further ground it in Rasta beliefs. In Cuba, most Rastas have been male and from the ": null
    },
    {
        "Afro-Cuban": "afro-cuban"
    },
    {
        " population.     Rastafari was introduced to the United States and Canada with the migration of Jamaicans to continental North America in the 42s and 42s. American police were often suspicious of Rastas and regarded Rastafari as a criminal sub-culture. Rastafari also attracted converts from within several Native American communities. In Latin America, small communities of Rastas have also established in Brazil, Panama, and Nicaragua.         Some Rastas in the African diaspora have followed through with their beliefs about resettlement in Africa, with Ghana and Nigeria being particularly favoured. Caribbean Rastas arrived in Ghana during the 42s, encouraged by its first post-independence president, ": null
    },
    {
        "Kwame Nkrumah": "kwame nkrumah"
    },
    {
        ", while some native Ghanaians also converted to the religion. The largest congregation of Rastas has been in southern parts of Ghana, around ": null
    },
    {
        "Accra": "accra"
    },
    {
        ", ": null
    },
    {
        "Tema": "tema"
    },
    {
        ", and the ": null
    },
    {
        "Cape Coast": "cape coast"
    },
    {
        ", although Rasta communities also exist in the Muslim-majority area of northern Ghana. The Rasta migrants wearing of dreadlocks was akin to that of the native ": null
    },
    {
        "fetish priest": "fetish priest"
    },
    {
        "s, which may have assisted the presentation of these Rastas as having authentic African roots in Ghanaian society. However, Ghanaian Rastas have complained of social ostracism and prosecution for cannabis possession, while non-Rastas in often consider them to be drop-outs , too Western , and not African enough .          In the 42s, a Rasta settlement was established in ": null
    },
    {
        "Shashamane": "shashamane"
    },
    {
        ", Ethiopia, on land made available by Haile Selassies Ethiopian World Federation. The community faced many problems; 42 acres were confiscated by the Marxist government of ": null
    },
    {
        "Mengistu Haile Mariam": "mengistu haile mariam"
    },
    {
        ". There were also conflicts with local Ethiopians, who largely regarded the incoming Rastas, and their Ethiopia-born children, as foreigners. The Shashamane community peaked at a population of 42, although subsequently declined to around 42     By the early 42s, a Rasta community was present in ": null
    },
    {
        "Nairobi": "nairobi"
    },
    {
        ", Kenya, whose approach to the religion was informed both by reggae and by traditional ": null
    },
    {
        "Kikuyu": "kikuyu people"
    },
    {
        " religion. Rastafari groups have also appeared in Zimbabwe, and in South Africa; in 42 there were at least 42 Rastas in the country. At an ": null
    },
    {
        "African Union": "african union"
    },
    {
        "/": null
    },
    {
        "Caribbean Diaspora": "caribbean diaspora"
    },
    {
        " conference in South Africa in 42 a statement was released characterising Rastafari as a force for integration of Africa and the African diaspora.            During the 42s and 42s, Rastas were among the ": null
    },
    {
        "thousands of Caribbean migrants settling in the United Kingdom": "british african-caribbean people"
    },
    {
        ". In 42 a short-lived Rasta group was established in ": null
    },
    {
        "Brixton": "brixton"
    },
    {
        ", South London, and by the latter part of the 42s, a Rasta community had settled in the ": null
    },
    {
        "Notting Hill": "notting hill"
    },
    {
        " area of Northwest London. By the late 42s, Rastafari had attracted converts from the second-generation of British Caribbean people, offering an outlet for the economic hardship, racial discrimination, and social isolation that many faced. It spread among the black working-classes not just of London, but also in ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        ", ": null
    },
    {
        "Leicester": "leicester"
    },
    {
        ", ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        ", ": null
    },
    {
        "Manchester": "manchester"
    },
    {
        ", and ": null
    },
    {
        "Bristol": "bristol"
    },
    {
        ". Its spread was aided by the ": null
    },
    {
        "gang": "gang"
    },
    {
        " structures that had been cultivated among black British youth by the ": null
    },
    {
        "rudeboy": "rudeboy"
    },
    {
        " subculture; these gangs proved to be a breeding ground for Rastafari themes. British Rastafari gained increasing attention in the 42s through reggaes popularity, although the police commonly regarded it as a criminal sub-culture. Following Marleys death, the British Rasta community declined. According to the ": null
    },
    {
        "42 United Kingdom Census": "2001 united kingdom census"
    },
    {
        " there are about 42 Rastafari living in ": null
    },
    {
        "England and Wales": "england and wales"
    },
    {
        ".  Clarke described Rastafari as a numerically small but extremely influential component of black British life.     Rastafari also established in various continental European countries, among them the Netherlands, Germany, Portugal, and France, gaining a particular foothold among black migrant populations but also attracting white converts. In France for instance it established a presence in two cities with substantial black populations, ": null
    },
    {
        "Paris": "paris"
    },
    {
        " and ": null
    },
    {
        "Bordeaux": "bordeaux"
    },
    {
        ", while in the Netherlands, it attracted converts within the ": null
    },
    {
        "Surinamese migrant community": "surinamese people in the netherlands"
    },
    {
        ".         Rastafari attracted membership from within the ": null
    },
    {
        "Maori": "māori people"
    },
    {
        " population of New Zealand, and the Aboriginal population of Australia. A small Rasta community developed in ": null
    },
    {
        "Japan": "japan"
    },
    {
        " in the late 42s and early 42s,  promoted by a practitioner named Jah Hiro. Rastafarian culture is also found in Israel, primarily with those who espouse the similarities between ": null
    },
    {
        "Judaism and Rastafarianism": "judaism and rastafarianism"
    },
    {
        ". ": null
    }
]