[
    {
        "Raymond of Poitiers was ": null
    },
    {
        "Prince of Antioch": "principality of antioch"
    },
    {
        " from 42 to 42 He was the younger son of ": null
    },
    {
        "William IX": "william ix of aquitaine"
    },
    {
        ", ": null
    },
    {
        "Duke of Aquitaine": "duke of aquitaine"
    },
    {
        " and his wife ": null
    },
    {
        "Philippa": "philippa of toulouse"
    },
    {
        ", Countess of Toulouse, born in the very year that his father the Duke began his infamous liaison with ": null
    },
    {
        "Dangereuse de Chatelherault": "dangereuse de chatelherault"
    },
    {
        ".       Following the death of Prince ": null
    },
    {
        "Bohemund II of Antioch": "bohemund ii of antioch"
    },
    {
        " in 42 the principality came under the ": null
    },
    {
        "regency": "regent"
    },
    {
        " first of King ": null
    },
    {
        "Baldwin II": "baldwin ii of jerusalem"
    },
    {
        " , then King ": null
    },
    {
        "Fulk": "fulk of jerusalem"
    },
    {
        " , and finally Princess ": null
    },
    {
        "Alice": "alice of antioch"
    },
    {
        " , Bohemonds widow. The reigning princess was Bohemond IIs daughter, ": null
    },
    {
        "Constance": "constance of antioch"
    },
    {
        " . Against the wishes of Alice, a marriage was arranged for Constance with Raymond, at the time staying in England, which he left only after the death of ": null
    },
    {
        "Henry I": "henry i of england"
    },
    {
        " on 42 December 42     Upon hearing word that Raymond was going to pass through his lands in order to marry the princess of Antioch, King ": null
    },
    {
        "Roger II of Sicily": "roger ii of sicily"
    },
    {
        " ordered him arrested. By a series of subterfuges, Raymond passed through southern Italy and only arrived at Antioch after 42 April 42 Patriarch ": null
    },
    {
        "Ralph of Domfront": "ralph of domfront"
    },
    {
        " then convinced Alice that Raymond was there to marry her, whereupon she allowed him to enter Antioch and the patriarch married him to Constance. Alice then left the city, now under the control of Raymond and Ralph.     The first years of their joint rule were spent in conflicts with the ": null
    },
    {
        "Byzantine Emperor": "byzantine emperor"
    },
    {
        " John II Comnenus": "john ii comnenus"
    },
    {
        ", who had come south partly to recover ": null
    },
    {
        "Cilicia": "cilicia"
    },
    {
        " from ": null
    },
    {
        "Leo of Armenia": "leo i of armenia"
    },
    {
        ", and to reassert his rights over Antioch. Raymond was forced to pay homage, and even to promise to cede his principality as soon as he was recompensed by a new ": null
    },
    {
        "fief": "fiefdom"
    },
    {
        ", which John promised to carve out for him in the Muslim territory to the east of Antioch. The expedition of 42 in which Raymond joined with John, and which was to conquer this territory, proved a failure. The expedition culminated in the unsuccessful ": null
    },
    {
        "Siege of Shaizar": "siege of shaizar"
    },
    {
        ". Raymond was not anxious to help the emperor to acquire new territories, when their acquisition only meant for him the loss of Antioch. John Comnenus returned unsuccessful to Constantinople, after demanding from Raymond, without response, the surrender of the ": null
    },
    {
        "citadel": "citadel"
    },
    {
        " of Antioch.       There followed a struggle between Raymond and the ": null
    },
    {
        "patriarch": "patriarch"
    },
    {
        ". Raymond was annoyed by the homage which he had been forced to pay to the patriarch in 42 and the dubious validity of the patriarchs election offered a handle for opposition. Eventually Raymond triumphed, and the patriarch was deposed . In 42 John Comnenus returned to the attack, but Raymond refused to recognize or renew his previous submission, and John, though he ravaged the neighborhood of Antioch, was unable to effect anything against him. When, however Raymond demanded from ": null
    },
    {
        "Manuel": "manuel i comnenus"
    },
    {
        ", who had succeeded John in 42 the cession of some of the ": null
    },
    {
        "Cilicia": "cilicia"
    },
    {
        "n towns, he found that he had met his match. Manuel forced him to a humiliating visit to ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ", during which he renewed his oath of homage and promised to acknowledge a ": null
    },
    {
        "Greek patriarch": "greek patriarch of antioch"
    },
    {
        ".          In the last year of Raymonds life ": null
    },
    {
        "Louis VII": "louis vii of france"
    },
    {
        " and his wife ": null
    },
    {
        "Eleanor of Aquitaine": "eleanor of aquitaine"
    },
    {
        " visited Antioch during the ": null
    },
    {
        "Second Crusade": "second crusade"
    },
    {
        ". Raymond sought to prevent Louis from going south to ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        " and to induce him to stay in Antioch and help in the conquest of ": null
    },
    {
        "Aleppo": "aleppo"
    },
    {
        " and ": null
    },
    {
        "Caesarea": "caesarea palaestina"
    },
    {
        ". Raymond was also suspected of having an incestuous affair with his beautiful niece Eleanor. According to ": null
    },
    {
        "John of Salisbury": "john of salisbury"
    },
    {
        ", Louis became suspicious of the attention Raymond lavished on Eleanor, and the long conversations they enjoyed. ": null
    },
    {
        "William of Tyre": "william of tyre"
    },
    {
        " claims that Raymond seduced Eleanor to get revenge on her husband, who refused to aid him in his wars against the Saracens, and that contrary to royal dignity, she disregarded her marriage vows and was unfaithful to her husband. Most modern historians dismiss such rumours, however, pointing out the closeness of Raymond and his niece during her early childhood, and the effulgent Aquitainian manner of behaviour. Also, as the pious Louis continued to have relations with his wife, it is doubtful that he believed his charge of incest.     Louis hastily left Antioch and Raymond was balked in his plans. In 42 he was killed in the ": null
    },
    {
        "Battle of Inab": "battle of inab"
    },
    {
        " during an expedition against ": null
    },
    {
        "Nur ad-Din Zangi": "nur ad-din zangi"
    },
    {
        ". He was beheaded by ": null
    },
    {
        "Shirkuh": "shirkuh"
    },
    {
        ", the uncle of ": null
    },
    {
        "Saladin": "saladin"
    },
    {
        ", and his head was placed in a silver box and sent to the ": null
    },
    {
        "Caliph": "caliph"
    },
    {
        " of ": null
    },
    {
        "Baghdad": "baghdad"
    },
    {
        " as a gift.            Raymond is described by ": null
    },
    {
        "William of Tyre": "william of tyre"
    },
    {
        " as a lord of noble descent, of tall and elegant figure, the handsomest of the princes of the earth, a man of charming affability and conversation, open-handed and magnificent beyond measure ; pre-eminent in the use of arms and military experience; litteratorum, licet ipse esset, cultor ; a regular churchman and faithful husband; but headstrong, irascible and unreasonable, with too great a passion for gambling . For his career see Rey, in the  Revue de lorient latin , vol. iv.     With Constance he had the following children:   ": null
    },
    {
        "Bohemond III": "bohemund iii of antioch"
    },
    {
        " Maria": "maria of antioch"
    },
    {
        ", married emperor ": null
    },
    {
        "Manuel I Komnenos": "manuel i komnenos"
    },
    {
        " Philippa": "philippa of antioch"
    },
    {
        "                                                  ": null
    }
]