[
    {
        "     Raynald of Châtillon, also known as Reynald or Reginald of Châtillon , was ": null
    },
    {
        "Prince of Antioch": "prince of antioch"
    },
    {
        " from 42 to 42 or 42 and ": null
    },
    {
        "Lord of Oultrejordain": "lord of oultrejordain"
    },
    {
        " from 42 until his death. He was born as his fathers second son into a ": null
    },
    {
        "French noble": "french nobility"
    },
    {
        " family. After losing a part of his patrimony, he joined the ": null
    },
    {
        "Second Crusade": "second crusade"
    },
    {
        " in 42 He settled in the ": null
    },
    {
        "Kingdom of Jerusalem": "kingdom of jerusalem"
    },
    {
        " and served in the royal army as a mercenary.     Raynald married ": null
    },
    {
        "Constance": "constance of antioch"
    },
    {
        ", the reigning Princess of Antioch, in 42 in spite of her subjects opposition. He was always in need of funds. He captured and tortured ": null
    },
    {
        "Aimery of Limoges": "aimery of limoges"
    },
    {
        ", ": null
    },
    {
        "Latin Patriarch of Antioch": "latin patriarch of antioch"
    },
    {
        ", because Aimery had refused to pay a subsidy to him. Raynald launched a plundering raid in ": null
    },
    {
        "Cyprus": "cyprus"
    },
    {
        " in 42 causing great destruction. Four years later, the ": null
    },
    {
        "Byzantine Emperor": "list of byzantine emperors"
    },
    {
        ", ": null
    },
    {
        "Manuel I Komnenos": "manuel i komnenos"
    },
    {
        ", came to Antioch at the head of a large army, forcing Raynald to beg for his mercy. Raynald made a raid in the valley of the river ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        " at ": null
    },
    {
        "Marash": "marash"
    },
    {
        " to seize booty from the local peasants in 42 or 42 but he was captured by the governor of ": null
    },
    {
        "Aleppo": "aleppo"
    },
    {
        ".     Raynald was held in prison until 42 After his release for a large ransom, he did not return to Antioch, because his wife had meanwhile died. He married ": null
    },
    {
        "Stephanie of Milly": "stephanie of milly, lady of oultrejordain"
    },
    {
        ", the wealthy heiress of Oultrejordain. Since ": null
    },
    {
        "Baldwin IV of Jerusalem": "baldwin iv of jerusalem"
    },
    {
        " also granted ": null
    },
    {
        "Hebron": "hebron"
    },
    {
        " to him, Raynald was one of the wealthiest barons of the realm. He controlled the caravan routes between Egypt and Syria. Baldwin, who suffered from ": null
    },
    {
        "leprosy": "leprosy"
    },
    {
        ", made him regent in 42 Raynald led the crusader army that defeated ": null
    },
    {
        "Saladin": "saladin"
    },
    {
        " at the ": null
    },
    {
        "Battle of Montgisard": "battle of montgisard"
    },
    {
        ". He was the only Christian leader to pursue an offensive policy against Saladin, making plundering raids against the caravans travelling near his domains. He built a fleet of five ships which plundered the coast of the Red Sea, threatening the route of the Muslim pilgrims towards ": null
    },
    {
        "Mecca": "mecca"
    },
    {
        " in early 42 Saladin pledged that he would never forgive Raynald.     Raynald was a firm supporter of Baldwin IVs sister, ": null
    },
    {
        "Sybilla": "sibylla, queen of jerusalem"
    },
    {
        ", and her husband, ": null
    },
    {
        "Guy of Lusignan": "guy of lusignan"
    },
    {
        ", during conflicts regarding the succession of the king. Sibylla and Guy were able to seize the throne in 42 due to Raynalds co-operation with her uncle, ": null
    },
    {
        "Joscelin III of Courtenay": "joscelin iii of courtenay"
    },
    {
        ". Raynald attacked a caravan travelling from Egypt to Syria in late 42 or early 42 claiming that the truce between Saladin and the Kingdom of Jerusalem did not bind him. After Raynald refused to pay a compensation, Saladin invaded the kingdom and annihilated the crusader army in the ": null
    },
    {
        "Battle of Hattin": "battle of hattin"
    },
    {
        ". Raynald was captured in the battlefield. Saladin personally beheaded him after he refused to ": null
    },
    {
        "convert to Islam": "conversion to islam"
    },
    {
        ". Most historians have regarded Raynald as an irresponsible adventurer whose lust for booty caused the fall of the Kingdom of Jerusalem. On the other hand, Bernard Hamilton says that he was the only crusader leader who tried to prevent Saladin from unifying the nearby Muslim states.         Raynald was the younger son of Hervé II, ": null
    },
    {
        "Lord of Donzy": "lord of donzy"
    },
    {
        ". In older historiography, Raynald was described as the son of Geoffrey, Count of Gien, but in 42 ": null
    },
    {
        "Jean Richard": "jean richard"
    },
    {
        " demonstrated Raynalds kinship with the Lords of Donzy. They were influential noblemen in the ": null
    },
    {
        "Duchy of Burgundy": "duchy of burgundy"
    },
    {
        ", claiming the Palladii  as their ancestors.     Raynald was born around 42 He received ": null
    },
    {
        "Châtillon-sur-Loire": "châtillon-sur-loire"
    },
    {
        ", but a part of his patrimony was violently and unjustly confiscated , according to one of his letters. He came to the ": null
    },
    {
        "Kingdom of Jerusalem": "kingdom of jerusalem"
    },
    {
        " before 42 when he was mentioned as a mercenary fighting in the army of ": null
    },
    {
        "Baldwin III of Jerusalem": "baldwin iii of jerusalem"
    },
    {
        ". According to modern historians, he had joined the ": null
    },
    {
        "crusade": "second crusade"
    },
    {
        " of ": null
    },
    {
        "Louis VII of France": "louis vii of france"
    },
    {
        ". Louis departed from France in June 42 The 42th-century historian ": null
    },
    {
        "William of Tyre": "william of tyre"
    },
    {
        ", who was Raynalds opponent, claimed that Raynald was almost a common soldier . LouisVII left the Holy Land for France in the summer of 42 but Raynald stayed behind in Palestine.     ": null
    },
    {
        "Raymond": "raymond of poitiers"
    },
    {
        ", ": null
    },
    {
        "Prince of Antioch": "prince of antioch"
    },
    {
        ", and thousands of his soldiers fell in the ": null
    },
    {
        "Battle of Inab": "battle of inab"
    },
    {
        " on 42June 42 leaving the principality almost undefended. BaldwinIII of Jerusalem  came to Antioch at the head of his army at least three times during the following years. To secure the defence of the principality, Baldwin tried to persuade her to remarry, but she did not accept his candidates. She also refused ": null
    },
    {
        "John Roger": "john rogerios dalassenos"
    },
    {
        ", whom the Byzantine Emperor, ": null
    },
    {
        "Manuel I Komnenos": "manuel i komnenos"
    },
    {
        ", proposed for her husband.     Raynald accompanied Baldwin to Antioch in 42 and settled in the principality, according to ": null
    },
    {
        "Steven Runciman": "steven runciman"
    },
    {
        ". It is certain that Raynald fought in Baldwins army during the ": null
    },
    {
        "Siege of Ascalon": "siege of ascalon"
    },
    {
        " in early 42 He may have already been engaged to Constance of Antioch , or their betrothal took place during Raynalds visit to the principality before the end of the siege . They kept their betrothal a secret until Baldwin gave his permission to their marriage.                 After Baldwin granted his consent, Constance married Raynald. He was installed prince in or shortly before May 42 In that month, he confirmed the privileges of the Venetian merchants. ": null
    },
    {
        "William of Tyre": "william of tyre"
    },
    {
        " recorded that his subjects were astonished that their famous, powerful and well-born princess condescended to marry a kind of mercenary knight . The wealthy ": null
    },
    {
        "Latin Patriarch of Antioch": "latin patriarch of antioch"
    },
    {
        ", ": null
    },
    {
        "Aimery of Limoges": "aimery of limoges"
    },
    {
        ", was Raynalds principal opponent. He even refused to pay a subsidy to him. In retaliation, Raynald captured and tortured Aimery, forcing him to sit naked and covered with honey in the sun, before imprisoning him. Aimery was only released on BaldwinIIIs demand, but he soon left his ": null
    },
    {
        "see": "episcopal see"
    },
    {
        " for Jerusalem.     Emperor Manuel sent his envoys to Antioch, proposing to recognize Raynald as the new prince if he launched a campaign against the ": null
    },
    {
        "Armenians": "armenians"
    },
    {
        " of ": null
    },
    {
        "Cilicia": "kingdom of cilicia"
    },
    {
        ", who had risen up against Byzantine rule. Manuel also promised that he would compensate Raynald for the expenses of the campaign. After Raynald defeated the Armenians at ": null
    },
    {
        "Alexandretta": "alexandretta"
    },
    {
        " in 42 the ": null
    },
    {
        "Knights Templar": "knights templar"
    },
    {
        " seized the region of the ": null
    },
    {
        "Syrian Gates": "syrian gates"
    },
    {
        " that the Armenians had recently captured. Although the sources are unclear, Runciman and Barber agree that it was Raynald who granted the territory to them.     Always in need of funds, Raynald urged Manuel to send the promised subsidy to him, but Manuel failed to pay the money. Raynald made an alliance with ": null
    },
    {
        "Thoros II of Cilicia": "thoros ii, prince of armenia"
    },
    {
        ". They attacked Cyprus, subjecting the Byzantine island to a three-week orgy of violence in early 42 They only left Cyprus on the rumour of an imperial fleet approaching the island, but only after they had forced all Cypriots to ransom themselves, with the exception of the wealthiest individuals , whom they carried off to Antioch. Cyprus would never entirely recover from the devastation that Raynalds and Thoross marauding raid caused.     Taking advantage of the presence of ": null
    },
    {
        "Thierry, Count of Flanders": "thierry, count of flanders"
    },
    {
        ", and his army in the Holy Land and an earthquake that destroyed most towns of Northern Syria, BaldwinIII of Jerusalem invaded the Muslim territories in the valley of the ": null
    },
    {
        "Orontes River": "orontes river"
    },
    {
        " in the autumn of 42 Raynald joined the royal army, and they laid siege to ": null
    },
    {
        "Shaizar": "shaizar"
    },
    {
        ". Shaizar was held by a band of ": null
    },
    {
        "Assassins": "order of assassins"
    },
    {
        ", but it had been ruled by the ": null
    },
    {
        "Munqidhites": "banu munqidh"
    },
    {
        " who paid an annual tribute to Raynald. Before the capitulation of the garrison, Baldwin decided to grant the fortress to Thierry of Flanders, but Raynald demanded that the count should pay homage to him for the town. After Thierry sharply refused to swear fealty to an upstart, the crusaders abandoned the siege. They marched on Harenc , which had been an Antiochene fortress before ": null
    },
    {
        "Nur ad-Din, atabeg of Aleppo": "nur ad-din, atabeg of aleppo"
    },
    {
        ", captured it in 42 After the crusaders captured Harenc in February 42 Raynald granted it to the Flemish Raynald of Saint-Valery.     Emperor Manuel unexpectedly invaded Cilicia, forcing ThorosII to seek refuge in the mountains in December 42 Raynald hurried to ": null
    },
    {
        "Mamistra": "mamistra"
    },
    {
        " to voluntarily make his submission to the emperor. On Manuels demand, he and his retainers walked barefoot and bareheaded through the streets of the town to the imperial tent where he prostrated himself, begging for mercy. William of Tyre stated that the glory of the Latin world was put to shame on this occasion, because envoys from the nearby Muslim and Christian rulers were also present at Raynalds humiliation. Manuel only forgave him after Raynald agreed to accept a ": null
    },
    {
        "Greek Patriarch": "list of orthodox patriarchs of antioch"
    },
    {
        " in Antioch. Raynald also had to promise that he would allow a Byzantine garrison to stay in the citadel whenever it was required and would send a troop to fight in the Byzantine army. Before long, BaldwinIII of Jerusalem persuaded Manuel to consent to the return of the Latin patriarch, Aimery, to Antioch, instead of installing a Greek patriarch. When the emperor entered Antioch with much pomp and ceremony on 42April 42 Reginald held the bridle of Manuels horse. Manuel left the town eight days later.     Raynald made a plundering raid in the valley of the river ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        " at ": null
    },
    {
        "Marash": "marash"
    },
    {
        " to seize cattle, horses and camels from the local peasants in November 42 or 42 Majd al-Din, governor of Aleppo, attacked Raynald and his retinue on the way back to Antioch. Raynald fought bravely, but the Muslim warriors unhorsed and captured him. He was sent to Aleppo where he was put in jail.              Almost nothing is known about Raynalds life while he was kept in jail for fifteen years. He shared his prison with ": null
    },
    {
        "Joscelin III of Courtenay": "joscelin iii of courtenay"
    },
    {
        ", who had been captured a couple of months before. In Raynalds absence, Constance wanted to rule alone, but BaldwinIII of Jerusalem made Patriarch Aimery regent for her fifteen-year-old son , ": null
    },
    {
        "Bohemond III of Antioch": "bohemond iii of antioch"
    },
    {
        ". Constance died around 42 shortly after her son reached the age of majority. Her death deprived Raynald of his claim to Antioch. However, he had become an important personality, with prominent family connections. His stepdaughter, ": null
    },
    {
        "Maria of Antioch": "maria of antioch"
    },
    {
        ", married ManuelI Komnenos in 42 Raynalds own daughter, ": null
    },
    {
        "Agnes": "agnes of antioch"
    },
    {
        ", became the wife of ": null
    },
    {
        "Béla III of Hungary": "béla iii of hungary"
    },
    {
        ".     When Gümüshtekin, governor of Aleppo, one of the last independent Muslim rulers in Syria after ": null
    },
    {
        "Saladin": "saladin"
    },
    {
        ", had conquered almost all neighboring states, he released Raynald, along with Joscelin of Courtenay and all other Christians prisoners in 42 Raynalds ransom, fixed at 42 gold dinars, reflected his prestige. It was most probably paid by ManuelI Komnenos, according to Barber and Bernard Hamilton.     Raynald came to Jerusalem with Joscelin before 42September 42  where he became a close ally of Joscelins sister, ": null
    },
    {
        "Agnes of Courtenay": "agnes of courtenay"
    },
    {
        ". She was the mother of the young ": null
    },
    {
        "Baldwin IV of Jerusalem": "baldwin iv of jerusalem"
    },
    {
        ", who suffered from leprosy. ": null
    },
    {
        "Hugo Etherianis": "hugo etherianis"
    },
    {
        ", who lived in ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " after around 42 mentioned in the preface of his About the Procession of the Holy Spirit that he had asked Prince Raynald to deliver a copy of the work to Aimery of Limoges. According to historian Bernard Hamilton, these words suggest that Raynald led the embassy that BaldwinIV sent to Constantinople to confirm an alliance between Jerusalem and the Byzantine Empire against Egypt.                Raynald married ": null
    },
    {
        "Stephanie of Milly": "stephanie of milly, lady of oultrejordain"
    },
    {
        ", the lady of ": null
    },
    {
        "Oultrejordain": "oultrejordain"
    },
    {
        ", and BaldwinIV also granted him ": null
    },
    {
        "Hebron": "hebron"
    },
    {
        ". The first extant charter styling Raynald as Lord of Hebron and Montréal was issued in November 42 He owed service of 42 knights to the Crown, showing that he had become one of the wealthiest barons of the realm. From his castles at ": null
    },
    {
        "Kerak": "kerak castle"
    },
    {
        " and ": null
    },
    {
        "Montréal": "montreal"
    },
    {
        ", he controlled the routes between the two main parts of Saladins empire, Syria and Egypt. Raynald and BaldwinIVs brother-in-law, ": null
    },
    {
        "William of Montferrat": "william of montferrat, count of jaffa and ascalon"
    },
    {
        ", jointly granted large estates to ": null
    },
    {
        "Rodrigo Álvarez": "rodrigo álvarez"
    },
    {
        ", the founder of the ": null
    },
    {
        "Order of Mountjoy": "order of mountjoy"
    },
    {
        ", to strengthen the defence of the southern and eastern frontier of the kingdom. After William of Montferrat died in June 42 the king made Raynald regent.     Baldwin IVs cousin, ": null
    },
    {
        "Philip I, Count of Flanders": "philip i, count of flanders"
    },
    {
        ", came to the Holy Land at the head of a crusader army in early August 42 The king offered him the regency, but Philip refused the offer, saying that he did not want to stay in the kingdom. Philip declared that he was willing to take orders from anybody, but he protested when Baldwin confirmed Raynalds position as regent of the kingdom and of the armies . Philip left the kingdom a month after his arrival.     Saladin invaded the region of ": null
    },
    {
        "Ascalon": "ashkelon"
    },
    {
        ", but the royal army launched an attack on him in the ": null
    },
    {
        "Battle of Montgisard": "battle of montgisard"
    },
    {
        " on 42November, leading to his defeat. William of Tyre and Ernoul attributed the victory to the king, but ": null
    },
    {
        "Baha ad-Din ibn Shaddad": "baha ad-din ibn shaddad"
    },
    {
        " and other Muslim authors recorded that Raynald was the supreme commander. Saladin himself referred to the battle as a major defeat which God mended with the famous battle of Hattin , The Rare and Excellent History of Saladin, p. 42 according to Baha ad-Din.     Raynald was the first among the witnesses to sign most royal charters between 42 and 42 showing that he was the kings most influential official during this period. Raynald became one of the principal supporters of ": null
    },
    {
        "Guy of Lusignan": "guy of lusignan"
    },
    {
        ", who married the kings elder sister, ": null
    },
    {
        "Sybilla": "sibylla, queen of jerusalem"
    },
    {
        ", in early 42 although many barons of the realm had opposed the marriage. The kings half sister, ": null
    },
    {
        "Isabella": "isabella i of jerusalem"
    },
    {
        "  was engaged to Raynalds stepson, ": null
    },
    {
        "Humphrey IV of Toron": "humphrey iv of toron"
    },
    {
        ", in autumn 42 BaldwinIV dispatched Raynald, along with ": null
    },
    {
        "Heraclius": "patriarch heraclius of jerusalem"
    },
    {
        ", ": null
    },
    {
        "Latin Patriarch of Jerusalem": "latin patriarch of jerusalem"
    },
    {
        ", to mediate a reconciliation between Bohemond III of Antioch and Patriarch Aimery in early 42 ": null
    },
    {
        "Roupen III, Lord of Cilician Armenia": "ruben iii, prince of armenia"
    },
    {
        ", married Raynalds stepdaughter, ": null
    },
    {
        "Isabella of Toron": "isabella of toron"
    },
    {
        ".              Raynald was the only Christian leader who fought against Saladin in the 42s. The contemporaneous Ernoul mentioned two raids that Raynald made against caravans travelling between Egypt and Syria, breaking the truce. Modern historians debate whether Raynalds desire for booty inspired these military actions, or were deliberate maneuvers to prevent Saladin from annexing new territories. Saladin tried to seize ": null
    },
    {
        "Aleppo": "aleppo"
    },
    {
        " after ": null
    },
    {
        "As-Salih Ismail al-Malik": "as-salih ismail al-malik"
    },
    {
        ", the ": null
    },
    {
        "Zengid": "zengid dynasty"
    },
    {
        " emir of the town, died on 42November 42 Raynald stormed into Saladins territory, reaching as far as ": null
    },
    {
        "Tabuk": "tabuk, saudi arabia"
    },
    {
        " on the route between ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        " and ": null
    },
    {
        "Mecca": "mecca"
    },
    {
        " in late 42 Saladins nephew, ": null
    },
    {
        "Farrukh Shah": "farrukh shah"
    },
    {
        ", invaded Oultrejourdain instead of attacking Aleppo to compel Raynald to return from the Arabian desert. Before long, Raynald seized a caravan and imprisoned its members. On Saladins protest, BaldwinIV ordered Raynald to free them, but Raynald did not obey him. His defiance annoyed the king, enabling ": null
    },
    {
        "Raymond III of Tripoli": "raymond iii of tripoli"
    },
    {
        "s partisans to reconcile him with the monarch. Raymonds return to the royal court put an end to his paramount position. He accepted the new situation and cooperated with the king and Raymond during the fights against Saladin in summer 42     Saladin revived the Egyptian naval force and tried to capture Beirut, but his ships were forced to retreat. Raynald ordered the building of five ships which were carried to the ": null
    },
    {
        "Gulf of Aqaba": "gulf of aqaba"
    },
    {
        " at the northern end of the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        " in February 42 Raynald laid siege to the Egyptian fortress on ": null
    },
    {
        "Ile de Graye": "ile de graye"
    },
    {
        ". Part of his fleet made a plundering raid along the coasts, threatening the security of the holy cities of Mecca and Medina. Raynald left Ile de Graye, but his fleet continued the siege. Saladins brother, ": null
    },
    {
        "Al-Adil": "al-adil i"
    },
    {
        ", the governor of Egypt, dispatched a fleet to the Red Sea. The Egyptians relieved Ile de Graye and destroyed the Christian fleet. Raynalds soldiers were executed, and Saladin took an oath that he would never forgive him. Though Raynalds naval expedition showed a remarkable degree of initiative , according to historian Bernard Hamilton, most modern historians agree that it contributed to the unification of Syria and Egypt under Saladins rule. Saladin captured Aleppo in June 42 completing the encirclement of the crusader states.     Baldwin IV, who had become seriously ill, made Guy of Lusignan bailli  in October 42 Within a month, Baldwin dismissed Guy, and had Guys five-year-old stepson, ": null
    },
    {
        "Baldwin V": "baldwin v of jerusalem"
    },
    {
        ", crowned king. Raynald was not present at the childs coronation, because he attended the wedding of his stepson, Humphrey, and BaldwinIVs sister, Isabella, in Kerak. Saladin unexpectedly invaded Oultrejordain, forcing the local inhabitants to seek refuge in Kerak. After Saladin broke into the town, Raynald only managed to escape to the fortress because one of his retainers had hindered the attackers from seizing the bridge between the town and the castle. Saladin ": null
    },
    {
        "laid siege to Kerak": "siege of kerak"
    },
    {
        ". According to Ernoul, Raynalds wife sent dishes from the wedding to Saladin, persuading him to stop bombarding the tower where her son and his wife stayed. After envoys from Kerak informed BaldwinIV of the siege, the royal army left Jerusalem for Kerak under the command of the king and RaymondIII of Tripoli. Saladin abandoned the siege before their arrival on 42December. On Saladins order, ": null
    },
    {
        "Izz al-Din Usama": "izz al-din usama"
    },
    {
        " had a fortress built at ": null
    },
    {
        "Ajloun": "ajloun"
    },
    {
        ", near the northern border of Raynalds domains.              Baldwin IV died in early 42 His successor, the child BaldwinV died in late summer 42 The ": null
    },
    {
        "High Court of Jerusalem": "high court of jerusalem"
    },
    {
        " had ruled that neither BaldwinVs mother, Sybilla , nor her sister, Isabella , could be crowned without the decision of the pope, the Holy Roman Emperor, and the kings of France and England about BaldwinVs lawful successor. However, Sybillas uncle, JoscelinIII of Courtenay, took control of Jerusalem with the support of Raynald and other influential prelates and royal officials. Raynald urged the townspeople to accept Sybilla as the lawful monarch, according to the  Estoire de Eracles . The bailli, RaymondIII of Tripoli, and his supporters tried to prevent her coronation and reminded her partisans of the decision of the High Court. Ignoring their protest, Raynald and ": null
    },
    {
        "Gerard of Ridefort": "gerard of ridefort"
    },
    {
        ", ": null
    },
    {
        "Grand Master of the Knights Templar": "grand master of the knights templar"
    },
    {
        ", accompanied Sybilla to the ": null
    },
    {
        "Holy Sepulchre": "holy sepulchre"
    },
    {
        ", where she was crowned. She also arranged the coronation of her husband, although he was unpopular even among her supporters. Her opponents tried to persuade Raynalds stepson, Humphrey, to claim the crown on his wifes behalf, but Humphrey deserted them and swore fealty to Sybilla and Guy. Raynald headed the list of secular witnesses in four royal charters issued between 42October 42 and 42March 42 showing that he had become a principal figure in the new kings court.     ": null
    },
    {
        "Ali ibn al-Athir": "ali ibn al-athir"
    },
    {
        " and other Muslim historians recorded that Raynald made a truce with Saladin in 42 This seems unlikely to be true , according to historian Bernard Hamilton, because the truce between the Kingdom of Jerusalem and Saladin covered Raynalds domains. In late 42 or early 42 a rich caravan travelled through Oultrejordain from Egypt to Syria. Ali ibn al-Athir mentioned that a group of armed men accompanied the caravan. Raynald seized the caravan, possibly because he regarded the presence of soldiers as a breach of the truce, according to Hamilton. He took all the merchants and their families prisoner, seized a large amount of booty, and refused to receive envoys from Saladin demanding compensation. Saladin sent his envoys to Guy of Lusignan, who accepted his demands. However, Raynald refused to obey the king, stating that he was lord of his land, just as Guy was lord of his, and he had no truces with the Saracens . Saladin proclaimed a  jihad  against the kingdom, taking an oath that he would personally kill Raynald for breaking the truce.     who was presentincluding brigandage and blasphemy": null
    },
    {
        " Anna[[Matthias Church]], Budape": "anna[[matthias church]], budape"
    },
    {
        "born in 42entitled Passion of Prince Raynald of Antiochfilm42 TV series": null
    }
]