[
    {
        "                   The   was the period in the history of the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        " of about 780 years between the ": null
    },
    {
        "Umayyad conquest of Hispania": "umayyad conquest of hispania"
    },
    {
        " in 711 and the ": null
    },
    {
        "fall of the Nasrid kingdom of Granada": "granada warlast stand at granada"
    },
    {
        " to the expanding ": null
    },
    {
        "Christian kingdoms": "christendom"
    },
    {
        " in 1492.     The beginning of the  is traditionally marked with the ": null
    },
    {
        "Battle of Covadonga": "battle of covadonga"
    },
    {
        " , the first known victory in Hispania by Christian military forces since the 711 military invasion undertaken by combined ": null
    },
    {
        "Arab": "arab"
    },
    {
        "-": null
    },
    {
        "Berber": "berbers"
    },
    {
        " forces. In that small battle, a group led by the nobleman ": null
    },
    {
        "Pelagius": "pelagius of asturias"
    },
    {
        " defeated a Muslim patrol in the mountains of northern Iberia and established the independent Christian ": null
    },
    {
        "Kingdom of Asturias": "kingdom of asturias"
    },
    {
        ". In the late 10th century, the Umayyad  ": null
    },
    {
        "vizier": "vizier"
    },
    {
        " Almanzor": "almanzor"
    },
    {
        " waged military campaigns for 30 years to subjugate the northern Christian kingdoms. His armies, mostly composed of Slavic and African ": null
    },
    {
        "Mamluks": "mamluk"
    },
    {
        ", ravaged the north, even sacking the great ": null
    },
    {
        "shrine of Santiago de Compostela": "santiago_de_compostela_cathedralhistory"
    },
    {
        ".     When the government of ": null
    },
    {
        "Córdoba": "caliphate of córdoba"
    },
    {
        " disintegrated in the early 11th century, a series of petty successor states known as  taifa s  emerged. The northern kingdoms took advantage of this situation and struck deep into ": null
    },
    {
        "Al-Andalus": "al-andalus"
    },
    {
        "; they fostered civil war, intimidated the weakened  taifas,  and made them pay large tributes  for protection. After a Muslim resurgence in the 12th century the great Moorish strongholds in the south fell to Christian forces in the 13th century—": null
    },
    {
        "Córdoba in 1236": "siege of córdoba"
    },
    {
        " and ": null
    },
    {
        "Seville in 1248": "siege of seville"
    },
    {
        "—leaving only the Muslim enclave of Granada as a ": null
    },
    {
        "tributary state": "tributary state"
    },
    {
        " in the south. After 1491, the entire peninsula was controlled by Christian rulers. The conquest was followed by the ": null
    },
    {
        "Alhambra Decree": "alhambra decree"
    },
    {
        " which ": null
    },
    {
        "expelled Jews": "expulsion of jews from spain"
    },
    {
        " who would not convert to Christianity from Castile and Aragon, and a series of edicts which ": null
    },
    {
        "forced the conversions of the Muslims in Spain": "forced conversions of muslims in spain"
    },
    {
        ", although later a significant part of them were expelled from the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        ".       Traditional historiography uses the term Reconquista starting at 19th. century  for what was earlier thought of as a restoration of the ": null
    },
    {
        "Visigothic Kingdom": "visigothic kingdom"
    },
    {
        " over conquered territories.  Sanjuán, Alejandro García.  A 1300 Años de la conquista de Al-Andalus  : 65. The concept of Reconquista, consolidated in Spanish historiography in the second half of the 19th century, was associated with the development of a Spanish national identity, emphasizing nationalistic and romantic, and occasionally, colonialist, aspects.        Since the 19th century traditional ": null
    },
    {
        "historiography": "historiography"
    },
    {
        " has stressed the existence of the Reconquista,  a continuous phenomenon by which the Christian Iberian kingdoms opposed and conquered the Muslim kingdoms, understood as a common enemy who had militarily seized territory from native Iberian Christians.    The concept of a Christian reconquest of the peninsula first emerged, in tenuous form, at the end of the 9th century.  A landmark was set by the Christian  Chronica Prophetica  , a document stressing the Christian and Muslim cultural and religious divide in Iberia and the necessity to drive the Muslims out.          Both Christian and Muslim rulers fought amongst themselves. Alliances between Muslims and Christians were not uncommon. Blurring distinctions even further were the mercenaries from both sides who simply fought for whoever paid the most. The period is seen today to have had long episodes of relative religious tolerance. María Rosa Menocal, The Ornament of the World: How Muslims, Jews and Christians Created a Culture of Tolerance in Medieval Spain, Back Bay Books, 2003, , and see ": null
    },
    {
        "Golden age of Jewish culture in Spain": "golden age of jewish culture in spain"
    },
    {
        ".     The ": null
    },
    {
        "Crusades": "crusades"
    },
    {
        ", which started late in the 11th century, bred the religious ideology of a Christian reconquest, confronted at that time with a similarly staunch Muslim ": null
    },
    {
        "Jihad": "jihad"
    },
    {
        " ideology in ": null
    },
    {
        "Al-Andalus": "al-andalus"
    },
    {
        " by the ": null
    },
    {
        "Almoravids": "almoravids"
    },
    {
        ", and to an even greater degree by the ": null
    },
    {
        "Almohads": "almohads"
    },
    {
        ". In fact, previous documents from the 10th and 11th centuries are mute on any idea of reconquest .  Propaganda accounts of Muslim-Christian hostility came into being to support that idea, most notably the  Chanson de Roland , a fictitious 11th-century French version of the ": null
    },
    {
        "Battle of Roncevaux Pass ": "battle of roncevaux pass"
    },
    {
        " dealing with the Iberian  Saracen s , and taught as historical fact in the French educational system since 1880.       The modern idea of Reconquista is inextricably linked to the foundational myths of ": null
    },
    {
        "Spanish nationalism": "spanish nationalism"
    },
    {
        " in the 19th century, and consolidated by the mid-20th century during ": null
    },
    {
        "Francos": "francisco franco"
    },
    {
        " National-Catholic": "national-catholicism"
    },
    {
        " dictatorship, based on a strong underlying Castilian ideological element. García Fitz, Francisco. 2009, p. 144 García Fitz, Francisco. 2009, pp. 146–147  The idea of a liberation war of reconquest against the Muslims, depicted as foreigners, suited well the anti-Republican rebels during the ": null
    },
    {
        "Spanish Civil War": "spanish civil war"
    },
    {
        " who agitated for the banner of a Spanish fatherland threatened by regional nationalisms and communism. Their rebellious pursuit was thus a crusade for the restoration of the Churchs unity, where Franco stood for both ": null
    },
    {
        "Pelagius of Asturias": "pelagius of asturias"
    },
    {
        " and ": null
    },
    {
        "El Cid": "el cid"
    },
    {
        ". The Reconquista has become a rallying call for right and far-right parties in Spain to expel from office incumbent progressive or peripheral nationalist options, as well as their values, in different political contexts as of 2018.         Some contemporary authors consider it proved that the process of Christian state-building in Iberia was indeed often defined by the reclamation of lands that had been lost to the ": null
    },
    {
        "Moors": "moors"
    },
    {
        " in generations past. In this way, state-building might be characterised—at least in ideological, if not practical, terms—as a process by which Iberian states were being rebuilt.  In turn, other recent historians dispute the whole concept of Reconquista as a concept created a posteriori in the service of later political goals. A few historians point out that Spain and Portugal did not previously exist as nations, and therefore the heirs of the Christian Visigothic Kingdom were not technically reconquering them, as the name suggests. Eugènia de Pagès, La Reconquista, allò que mai no va existir , La Lamentable, July 11, 2014,  Martín M. Ríos Saloma, La Reconquista. Génesis de un mito historiográfico , Historia y Grafía, 30, 2008, pp. 191–216, , Retrieved October 12, 2014. One of the first Spanish intellectuals to question the idea of a reconquest that lasted for eight centuries was ": null
    },
    {
        "José Ortega y Gasset": "josé ortega y gasset"
    },
    {
        ", writing in the first half of the 20th century. Yo no entiendo cómo se puede llamar reconquista a una cosa que dura ocho siglos , in España invertebrada. Quoted by De Pagès, E. July 11, 2014. However, the term reconquista is still widely in use.                   In 711, North African ": null
    },
    {
        "Berber": "berber people"
    },
    {
        " soldiers with some ": null
    },
    {
        "Arabs": "arab"
    },
    {
        "commanded by ": null
    },
    {
        "Tariq ibn Ziyad": "tariq ibn ziyad"
    },
    {
        " crossed the ": null
    },
    {
        "Strait of Gibraltar": "strait of gibraltar"
    },
    {
        ", engaging a Visigothic force led by King ": null
    },
    {
        "Roderic": "roderic"
    },
    {
        " at the Battle of Guadalete in a moment of serious in-fighting and division across the ": null
    },
    {
        "Visigothic Kingdom of Hispania": "visigothic kingdom"
    },
    {
        ".     After Roderics defeat, the Umayyad governor of ": null
    },
    {
        "Ifrikiya": "ifriqiya"
    },
    {
        " Musa ibn-Nusayr": "musa ibn nusayr"
    },
    {
        " joined Tariq, directing a campaign against different towns and strongholds in Iberia. Some, like Merida, Cordova, or ": null
    },
    {
        "Zaragoza": "zaragoza"
    },
    {
        " in 712, probably ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        ", were taken by storm or after resistance, but many agreed to a treaty in exchange for maintaining autonomy, in ": null
    },
    {
        "Theodemirs": "theodemir"
    },
    {
        "dominion , or ": null
    },
    {
        "Pamplona": "pamplona"
    },
    {
        ", for example.  The invading Islamic armies did not exceed 60,000 men.             After the establishment of a local ": null
    },
    {
        "Emirate": "emirate"
    },
    {
        ", ": null
    },
    {
        "Caliph": "caliph"
    },
    {
        " Al-Walid I": "al-walid i"
    },
    {
        ", ruler of the ": null
    },
    {
        "Umayyad Caliphate": "umayyad caliphate"
    },
    {
        ", removed many of the successful Muslim commanders. Tariq ibn Ziyad was recalled to ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        " and replaced with Musa ibn-Nusayr, who had been his former superior. Musas son, Abd al-Aziz ibn Musa, apparently married ": null
    },
    {
        "Egilona": "egilona"
    },
    {
        ", ": null
    },
    {
        "Roderics": "roderic"
    },
    {
        "widow, and established his regional government in ": null
    },
    {
        "Seville": "seville"
    },
    {
        ". He was suspected of being under the influence of his wife and was accused of wanting to convert to Christianity and of planning a secessionist rebellion. Apparently a concerned Al-Walid I ordered Abd al-Azizs assassination. Caliph Al-Walid I died in 715 and was succeeded by his brother ": null
    },
    {
        "Sulayman ibn Abd al-Malik": "sulayman ibn abd al-malik"
    },
    {
        ". Sulayman seems to have punished the surviving Musa ibn-Nusayr, who very soon died during a pilgrimage in 716. In the end, Abd al-Aziz ibn Musas cousin, ": null
    },
    {
        "Ayyub ibn Habib al-Lakhmi": "ayyub ibn habib al-lakhmi"
    },
    {
        " became the wali of Al-Andalus.     The conquering generals were necessarily acting independently, due to the methods of communication available. Successful generals in the field and in a distant province would gain the personal loyalty of their officers and warriors and their ambitions were likely watched by certain circles of the distant government with a degree of concern and suspicion. Old rivalries and perhaps even full-fledged conspiracies between generals may have had influence over this development. In the end, the formerly successful generals were replaced by a younger generation considered more loyal to the government in Damascus.     A serious weakness amongst the Muslim conquerors was the ethnic tension between Berbers and Arabs. ": null
    },
    {
        "Chris Lowney": "chris lowney"
    },
    {
        ", A Vanished World: Muslims, Christians, and Jews in Medieval Spain, , 40. The Berbers were indigenous inhabitants of North Africa who had only recently converted to Islam; they provided most of the soldiery of the invading Islamic armies but sensed Arab discrimination against them. Roger Collins, Early Medieval Spain, , 164. This latent internal conflict jeopardized Umayyad unity. The Ummyyad forces arrived and crossed the Pyrenees by 719. The last Visigothic king ": null
    },
    {
        "Ardo": "ardo"
    },
    {
        " resisted them in Septimania, where he fended off the Berber-Arab armies until 720.      After the Islamic Moorish conquest of most of the Iberian Peninsula in 711–718 and the establishment of the emirate of Al-Andalus, an Umayyad expedition suffered a major defeat at the ": null
    },
    {
        "Battle of Toulouse": "battle of toulouse"
    },
    {
        " and was halted for a while on its way north. ": null
    },
    {
        "Odo of Aquitaine": "odo of aquitaine"
    },
    {
        " had married his daughter to ": null
    },
    {
        "Uthman ibn Naissa": "uthman ibn naissa"
    },
    {
        ", a rebel Berber and lord of ": null
    },
    {
        "Cerdanya": "cerdanya"
    },
    {
        " , in an attempt to secure his southern borders in order to fend off ": null
    },
    {
        "Charles Martels": "charles martel"
    },
    {
        "attacks on the north. However, a major ": null
    },
    {
        "punitive expedition": "punitive expedition"
    },
    {
        " led by ": null
    },
    {
        "Abdul Rahman Al Ghafiqi": "abdul rahman al ghafiqi"
    },
    {
        ", the latest emir of Al-Andalus, defeated and killed Uthman, and the Muslim governor mustered an expedition north across the western Pyrenees, looted areas up to Bordeaux, and defeated Odo in the ": null
    },
    {
        "Battle of the River Garonne": "battle of the river garonne"
    },
    {
        " in 732.     A desperate Odo turned to his archrival Charles Martel for help, who led the Frankish and remaining Aquitanian armies against the Umayyad armies and defeated them at the ": null
    },
    {
        "Battle of Tours": "battle of tours"
    },
    {
        " in 732, killing Abdul Rahman Al Ghafiqi. While Moorish rule began to recede, it would remain in parts of the Iberian peninsula for another 760 years.       Reconquista       A drastic increase of taxes by the emir ": null
    },
    {
        "Anbasa ibn Suhaym Al-Kalbi": "anbasa ibn suhaym al-kalbi"
    },
    {
        " provoked several rebellions in Al-Andalus, which a series of succeeding weak emirs were unable to suppress. Around 722, a Muslim military expedition was sent into the north in late summer to suppress a rebellion led by ": null
    },
    {
        "Pelagius of Asturias": "pelagius of asturias"
    },
    {
        " . Traditional historiography has hailed Pelagius ": null
    },
    {
        "victory at Covadonga": "battle of covadonga"
    },
    {
        " as the beginning of the Reconquista. No Muslim source mentions the battle at Covadonga, in contrast with the ": null
    },
    {
        "Battle of Toulouse": "battle of toulouse"
    },
    {
        " in 721, with a death toll of perhaps tens of thousands, which was mourned for centuries as a large scale tragedy by the Iberian Muslims. For Pelagius, however, the Christian victory secured his independent rule, while the precise date and circumstances of the battle are unclear. Among the possibilities is that Pelagius rebellion was successful because the greater part of the Muslim forces were focusing in ": null
    },
    {
        "Septimania": "septimania"
    },
    {
        " and Toulouse .     Two northern realms, the Basque Navarre  and Asturias, despite their small size, demonstrated an ability to maintain their independence. Because the Umayyad rulers based in ": null
    },
    {
        "Córdoba": "córdoba, andalusia"
    },
    {
        " were unable to extend their power over the Pyrenees, they decided to consolidate their power within the Iberian peninsula. Arab-Berber forces made periodic incursions deep into Asturias, but this area was a cul-de-sac on the fringes of the Islamic world fraught with inconveniences during campaigns and little interest.      It comes then as no surprise that, besides focusing on raiding the Arab-Berber strongholds of the Meseta, Alphonse I centred on expanding his domains at the expense of the neighbouring Galicians and Basques at either side of his realm just as much.  During the first decades, Asturian control over part of the kingdom was weak, and for this reason it had to be continually strengthened through matrimonial alliances and war with other peoples from the north of the Iberian Peninsula. After Pelayos death in 737, his son ": null
    },
    {
        "Favila of Asturias": "favila of asturias"
    },
    {
        " was elected king. Favila, according to the chronicles, was killed by a bear during a trial of courage. Pelayos dynasty in Asturias survived and gradually expanded the kingdoms boundaries until all of northwest Iberia was included by roughly 775. However, credit is due not to him but to his successors, the Banu Alfons from the Arab chronicles. Further expansion of the northwestern kingdom towards the south occurred during the reign of Alfonso II . A kings expedition arrived in and pillaged Lisbon in 798, probably concerted with the Carolingians.      The Asturian kingdom became firmly established with the recognition of Alfonso II as king of Asturias by ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        " and the Pope. During his reign, the bones of ": null
    },
    {
        "St. James the Great": "james, son of zebedee"
    },
    {
        " were declared to have been found in Galicia, at ": null
    },
    {
        "Santiago de Compostela": "santiago de compostela"
    },
    {
        ". Pilgrims from all over Europe opened a channel of communication between the isolated Asturias and the Carolingian lands and beyond, centuries later.            After the Umayyad conquest of the Iberian heartland of the Visigothic kingdom, the Muslims crossed the Pyrenees and gradually took control of ": null
    },
    {
        "Septimania": "septimania"
    },
    {
        ", starting in 719 with the conquest of ": null
    },
    {
        "Narbonne": "narbonne"
    },
    {
        " through 725 when ": null
    },
    {
        "Carcassonne": "carcassonne"
    },
    {
        " and ": null
    },
    {
        "Nîmes": "nîmes"
    },
    {
        " were secured. From the stronghold of Narbonne, they tried to conquer ": null
    },
    {
        "Aquitaine": "aquitaine"
    },
    {
        " but suffered a major defeat at the ": null
    },
    {
        "Battle of Toulouse ": "battle of toulouse"
    },
    {
        ".      Ten years after halting their advance north, ": null
    },
    {
        "Odo of Aquitaine": "odo of aquitaine"
    },
    {
        " married his daughter to ": null
    },
    {
        "Uthman ibn Naissa": "uthman ibn naissa"
    },
    {
        ", a rebel Berber and lord of ": null
    },
    {
        "Cerdanya": "cerdanya"
    },
    {
        " , in an attempt to secure his southern borders to fend off ": null
    },
    {
        "Charles Martels": "charles martel"
    },
    {
        "attacks on the north. However, a major ": null
    },
    {
        "punitive expedition": "punitive expedition"
    },
    {
        " led by ": null
    },
    {
        "Abdul Rahman Al Ghafiqi": "abdul rahman al ghafiqi"
    },
    {
        ", the latest emir of Al-Andalus, defeated and killed Uthman.       After expelling the Muslims ": null
    },
    {
        "from Narbonne in 759": "siege of narbonne"
    },
    {
        " and driving their forces back over the Pyrenees, the Carolingian king ": null
    },
    {
        "Pepin the Short conquered Aquitaine": "pepin the shortexpansion of the frankish realm"
    },
    {
        " in a ruthless eight-year war. Charlemagne followed his father by subduing Aquitaine by creating counties, taking the Church as his ally and appointing counts of Frankish or Burgundian stock, like his loyal ": null
    },
    {
        "William of Gellone": "william of gellone"
    },
    {
        ", making ": null
    },
    {
        "Toulouse": "toulouse"
    },
    {
        " his base for expeditions against Al-Andalus. Charlemagne decided to organize a regional subkingdom in order to keep the Aquitanians in check and to secure the southern border of the ": null
    },
    {
        "Carolingian Empire": "carolingian empire"
    },
    {
        " against Muslim incursions. In 781, his three-year-old son ": null
    },
    {
        "Louis": "louis the pious"
    },
    {
        " was crowned king of ": null
    },
    {
        "Aquitaine": "aquitaine"
    },
    {
        ", under the supervision of Charlemagnes trustee William of Gellone, and was nominally in charge of the incipient ": null
    },
    {
        "Spanish March": "spanish march"
    },
    {
        ".     Meanwhile, the takeover of the southern fringes of Al-Andalus by Abd ar-Rahman I in 756 was opposed by ": null
    },
    {
        "Yusuf ibn Abd al-Rahman": "yusuf ibn abd al-rahman al-fihri"
    },
    {
        ", autonomous governor  or king  of al-Andalus. Abd ar-Rahman I expelled Yusuf from Cordova,  but it took still decades for him to expand to the north-western Andalusian districts. He was also opposed externally by the ": null
    },
    {
        "Abbasids": "abbasid caliphate"
    },
    {
        " of Baghdad who failed in their attempts to overthrow him. In 778, Abd al-Rahman closed in on the Ebro valley. Regional lords saw the Umayyad emir at the gates and decided to enlist the nearby Christian Franks. According to ": null
    },
    {
        "Ali ibn al-Athir": "ali ibn al-athir"
    },
    {
        ", a Kurdish historian of the 12th century, Charlemagne received the envoys of ": null
    },
    {
        "Sulayman al-Arabi": "sulayman al-arabi"
    },
    {
        ", Husayn, and ": null
    },
    {
        "Abu Taur": "abu taur of huesca"
    },
    {
        " at the Diet of Paderborn in 777. These rulers of ": null
    },
    {
        "Zaragoza": "zaragoza"
    },
    {
        ", ": null
    },
    {
        "Girona": "girona"
    },
    {
        ", ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        ", and ": null
    },
    {
        "Huesca": "huesca"
    },
    {
        " were enemies of Abd ar-Rahman I, and in return for Frankish military aid against him offered their homage and allegiance.      Charlemagne, seeing an opportunity, agreed upon an expedition and crossed the Pyrenees in 778. Near the city of ": null
    },
    {
        "Zaragoza": "zaragoza"
    },
    {
        " Charlemagne received the homage of ": null
    },
    {
        "Sulayman al-Arabi": "sulayman al-arabi"
    },
    {
        ". However the city, under the leadership of ": null
    },
    {
        "Husayn": "husayn of zaragoza"
    },
    {
        ", closed its gates and refused to submit. Unable to conquer the city by force, Charlemagne decided to retreat. On the way home the rearguard of the army was ambushed and destroyed by Basque forces at the ": null
    },
    {
        "Battle of Roncevaux Pass": "battle of roncevaux pass"
    },
    {
        ". ": null
    },
    {
        "The Song of Roland": "the song of roland"
    },
    {
        ", a highly romanticized account of this battle, would later become one of the most famous ": null
    },
    {
        "chansons de geste": "chanson de geste"
    },
    {
        " of the Middle Ages. Around 788 Abd ar-Rahman I died and was succeeded by ": null
    },
    {
        "Hisham I": "hisham i of córdoba"
    },
    {
        ". In 792 Hisham proclaimed a ": null
    },
    {
        "jihad": "jihad"
    },
    {
        ", advancing in 793 against the ": null
    },
    {
        "Kingdom of Asturias": "kingdom of asturias"
    },
    {
        " and Carolingian ": null
    },
    {
        "Septimania ": "septimania"
    },
    {
        ". They defeated William of Gellone, Count of Toulouse, in battle, but ": null
    },
    {
        "William": "william of gellone"
    },
    {
        " led an expedition the following year across the eastern Pyrenees. ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        ", a major city, became a potential target for the Franks in 797, as its governor Zeid rebelled against the Umayyad emir of Córdoba. An army of the emir managed to recapture it in 799, but Louis, at the head of an army, crossed the Pyrenees and besieged the city for two years until it finally capitulated in 801.  It took place on 28 December 801.     The main passes in the Pyrenees were ": null
    },
    {
        "Roncesvalles": "roncesvalles"
    },
    {
        ", ": null
    },
    {
        "Somport": "somport"
    },
    {
        " and ": null
    },
    {
        "La Jonquera": "la jonquera"
    },
    {
        ". Charlemagne established across them the vassal regions of ": null
    },
    {
        "Pamplona": "pamplona"
    },
    {
        ", ": null
    },
    {
        "Aragon": "aragon"
    },
    {
        ", and ": null
    },
    {
        "Catalonia": "catalonia"
    },
    {
        " respectively. Catalonia was itself formed from a number of ": null
    },
    {
        "small counties": "catalan counties"
    },
    {
        ", including ": null
    },
    {
        "Pallars": "county of pallars"
    },
    {
        ", ": null
    },
    {
        "Girona": "girona"
    },
    {
        ", and ": null
    },
    {
        "Urgell": "urgell"
    },
    {
        "; it was called the Marca Hispanica by the late 8th century. They protected the eastern Pyrenees passes and shores and were under the direct control of the Frankish kings. Pamplonas first king was ": null
    },
    {
        "Iñigo Arista": "iñigo arista"
    },
    {
        ", who allied with his Muslim kinsmen the ": null
    },
    {
        "Banu Qasi": "banu qasi"
    },
    {
        " and rebelled against Frankish overlordship and overcame a ": null
    },
    {
        "Carolingian expedition in 824": "battle of roncevaux pass"
    },
    {
        " that led to the setup of the ": null
    },
    {
        "Kingdom of Pamplona": "kingdom of pamplona"
    },
    {
        ". Aragon, founded in 809 by ": null
    },
    {
        "Aznar Galíndez": "aznar galíndez"
    },
    {
        ", grew around ": null
    },
    {
        "Jaca": "jaca"
    },
    {
        " and the high valleys of the ": null
    },
    {
        "Aragon River": "aragon river"
    },
    {
        ", protecting the old Roman road. By the end of the 10th century, Aragon was annexed by Navarre. Sobrarbe and Ribagorza were small counties and had little significance to the progress of the Reconquista.     In the late 9th century under ": null
    },
    {
        "Count Wilfred": "wilfred the hairy, count of barcelona"
    },
    {
        ", Barcelona became the de facto capital of the region. It controlled the other counties policies in a union, which led in 948 to the independence of Barcelona under ": null
    },
    {
        "Count Borrel II": "borrell ii, count of barcelona"
    },
    {
        ", who declared that the new dynasty in France  were not the legitimate rulers of France nor, as a result, of his county. These states were small and, with the exception of Navarre, did not have the capacity for attacking the Muslims in the way that Asturias did, but their mountainous geography rendered them relatively safe from being conquered, and their borders remained stable for two centuries.          In the ": null
    },
    {
        "High Middle Ages": "high middle ages"
    },
    {
        ", the fight against the Moors in the Iberian Peninsula became linked to the fight of the whole of ": null
    },
    {
        "Christendom": "christendom"
    },
    {
        ". The Reconquista was originally a mere war of conquest. It only later underwent a significant shift in meaning toward a religiously justified war of liberation . The ": null
    },
    {
        "papacy": "papacy"
    },
    {
        " and the influential ": null
    },
    {
        "Abbey of Cluny": "abbey of cluny"
    },
    {
        " in Burgundy not only justified the acts of war but actively encouraged Christian knights to seek armed confrontation with Moorish infidels instead of with each other.     From the 11th century onwards ": null
    },
    {
        "indulgences": "indulgences"
    },
    {
        " were granted: In 1064 ": null
    },
    {
        "Pope Alexander II": "pope alexander ii"
    },
    {
        " promised the participants of ": null
    },
    {
        "an expedition against Barbastro": "war of barbastro"
    },
    {
        "  a collective indulgence 30 years before ": null
    },
    {
        "Pope Urban II": "pope urban ii"
    },
    {
        " called the ": null
    },
    {
        "First Crusade": "first crusade"
    },
    {
        ". Papal interest in Christian-Muslim relations in the peninsula was not without precedent  – Popes Leo IV , John VIII and John XIX are all known to have displayed substantial interest in the region. Not until 1095 and the ": null
    },
    {
        "Council of Clermont": "council of clermont"
    },
    {
        " did the Reconquista amalgamate the conflicting concepts of a peaceful pilgrimage and armed knight-errantry. But the papacy left no doubt about the heavenly reward for knights fighting for Christ : in a letter, Urban II tried to persuade the reconquistadores fighting at ": null
    },
    {
        "Tarragona": "tarragona"
    },
    {
        " to stay in the Peninsula rather than joining the armed pilgrimage to conquer Jerusalem, saying that their contribution for Christianity was equally important. The pope promised them the same indulgences that he had promised to those who chose to join the First Crusade.     Later ": null
    },
    {
        "military orders": "military order"
    },
    {
        " such as the ": null
    },
    {
        "Order of Santiago": "order of santiago"
    },
    {
        ", ": null
    },
    {
        "Montesa": "order of montesa"
    },
    {
        ", ": null
    },
    {
        "Order of Calatrava": "order of calatrava"
    },
    {
        ", and the ": null
    },
    {
        "Knights Templar": "knights templar"
    },
    {
        " were founded or called to fight in Iberia. The Popes called the knights of Europe to join the effort to destroy the Muslim states of the peninsula. After the so-called ": null
    },
    {
        "Disaster of Alarcos": "battle of alarcos"
    },
    {
        ", French, Navarrese, Castilian, Portuguese and Aragonese armies united against the Muslim forces in the massive  battle of Las Navas de Tolosa  . The large territories awarded to military orders and nobles were the origin of the ": null
    },
    {
        "latifundia": "latifundia"
    },
    {
        " in todays ": null
    },
    {
        "Andalusia": "andalusia"
    },
    {
        " and ": null
    },
    {
        "Extremadura": "extremadura"
    },
    {
        " in Spain, and ": null
    },
    {
        "Alentejo": "alentejo"
    },
    {
        " in Portugal.            In an atmosphere of constant conflict, warfare and daily life were strongly intertwined during this period. Small, lightly equipped armies reflected the need for society to be on constant alert during the first chapters of the Reconquista. These forces were capable of moving long distances in short times, allowing a quick return home after sacking a target. The initial battles were mainly waged between clans, expelling intruder armies or sacking expeditions.     In the context of the relative isolation of the Iberian Peninsula from the rest of Europe, and the contact with Moorish culture, there were military strategies and tactics that were slightly different from those found in the rest of western Europe during the early stages of the Reconquista.     Medieval Iberian armies mainly comprised two types of forces: the cavalry and the infantry, or peones . Infantry only went to war if needed, which was not frequent.         Iberian ": null
    },
    {
        "cavalry tactics": "cavalry tactics"
    },
    {
        " involved knights approaching the enemy, throwing ": null
    },
    {
        "javelin": "javelin"
    },
    {
        "s, then withdrawing to a safe distance before commencing another assault. Once the enemy formation was sufficiently weakened, the knights charged with thrusting ": null
    },
    {
        "spears": "spear"
    },
    {
        " . There were three types of knights : royal knights, noble knights , and commoner knights . Royal knights were mainly nobles with a close relationship with the king, and thus claimed a direct Gothic inheritance.     Royal knights in the early stages of the Reconquista were equipped in the same manner as their ": null
    },
    {
        "Gothic": "goths"
    },
    {
        " predecessors: mail ": null
    },
    {
        "hauberk": "hauberk"
    },
    {
        ", kite shield, a long ": null
    },
    {
        "sword": "sword"
    },
    {
        " , javelins, spears and a ": null
    },
    {
        "Visigothic axe": "francisca"
    },
    {
        ". Noble knights came from the ranks of the infanzones or lower nobles, whereas the commoner knights were not noble but were wealthy enough to afford a horse. Uniquely in Europe, these horsemen comprised a militia cavalry force with no feudal links, being under the sole control of the king or the count of ": null
    },
    {
        "Castile": "kingdom of castile"
    },
    {
        " because of  fueros  with the crown. Both noble and common knights wore padded armour and carried javelins, spears and round-tasselled shields , as well as a sword.     The peones were ": null
    },
    {
        "peasants": "peasants"
    },
    {
        " who went to battle in service of their ": null
    },
    {
        "feudal": "feudal"
    },
    {
        " lord. Poorly equipped, with bows and arrows, spears and short swords, they were mainly used as auxiliary troops. Their function in battle was to contain the enemy troops until the cavalry arrived and to block the enemy infantry from charging the knights. The ": null
    },
    {
        "longbow": "longbow"
    },
    {
        ", the ": null
    },
    {
        "composite bow": "composite bow"
    },
    {
        ", and the ": null
    },
    {
        "crossbow": "crossbow"
    },
    {
        " were the basic types of bows and were especially popular in the infantry.     In the early Middle Age Iberian armour was typically made of leather, with iron scales. Head protections consisted of a round helmet with nose protector  and a chain mail headpiece. Shields were often round or kidney-shaped, except for the kite-shaped designs used by the royal knights. Usually adorned with geometric designs, crosses or tassels, shields were made out of wood and had a leather cover.     Steel swords were the most common weapon. The cavalry used long double-edged swords and the infantry short, single-edged ones. Guards were either semicircular or straight, but always highly ornamented with geometrical patterns. Spears and javelins were up to 1.5 metres long and had an iron tip. The double-axe – made of iron, 30  cm long, and possessing an extremely sharp edge – was designed to be equally useful as a thrown weapon or in close combat. Maces and hammers were not common, but some specimens have remained and are thought to have been used by members of the cavalry.     Finally, mercenaries were an important factor, as many kings did not have enough soldiers available. ": null
    },
    {
        "Norsemen": "norsemen"
    },
    {
        ", ": null
    },
    {
        "Flemish": "flemings"
    },
    {
        " spearmen, Frankish knights, Moorish mounted archers, and Berber light cavalry were the main types of mercenaries available and used in the conflict.         This style of warfare remained dominant in the Iberian Peninsula until the late 11th century, when lance tactics entered from France, although the traditional horse javelin-shot techniques continued to be used. In the 12th and 13th centuries, soldiers typically carried a sword, a lance, a javelin, and either bow and arrows or crossbow and darts/bolts. Armor consisted of a coat of mail over a quilted jacket, extending at least to the knees, a helmet or iron cap, and bracers protecting the arms and thighs, either metal or leather.          Shields were round or triangular, made of wood, covered with leather, and protected by an iron band; the shields of knights and nobles would bear the familys coat of arms. Knights rode in both the Muslim style, a la jineta , a short stirrup strap and bended knees allowed for better control and speed, or in the French style, a la brida, a long stirrup strap allowed for more security in the saddle when acting as heavy cavalry. Horses were occasionally fitted with a coat of mail as well.     Around the 14th and 15th centuries heavy cavalry gained a predominant role, where knights used to wear full plate armors.       The northern principalities and kingdoms survived in their mountainous strongholds . However, they started a definite territorial expansion south at the turn of the 10th century . The fall of the Caliphate of Cordova heralded a period of military expansion for the northern kingdoms, now divided into several mighty regional powers after the division of the Kingdom of Navarre . A myriad of autonomous Christian kingdoms emerged thereafter.             The Kingdom of Asturias was located in the ": null
    },
    {
        "Cantabrian Mountains": "cantabrian mountains"
    },
    {
        ", a wet and mountainous region in the north of the Iberian Peninsula. It was the first Christian power to emerge. The kingdom was established by a nobleman, ": null
    },
    {
        "Pelagius": "pelagius of asturias"
    },
    {
        " , who had possibly returned after the Battle of Guadalete in 711 and was elected leader of the Asturians, laying the foundations for the ": null
    },
    {
        "Kingdom of Asturias": "kingdom of asturias"
    },
    {
        " and starting the ": null
    },
    {
        "Astur-Leonese dynasty": "astur-leonese dynasty"
    },
    {
        " that spanned from 718 to 1037 and led the initial efforts in the Iberian peninsula to take back the territories then ruled by the Moors. Ruiz De La Peña. La monarquia asturiana 718–910, p. 27. Cangas de Onís, 2000.  / Fernández Conde. Estudios Sobre La Monarquía Asturiana, pp. 35–76. Estudios Históricos La Olmeda, 2015.  Although the new dynasty first ruled in the mountains of Asturias, with the capital of the kingdom established initially in ": null
    },
    {
        "Cangas de Onís": "cangas de onís"
    },
    {
        ", and was in its dawn mostly concerned with securing the territory and settling the monarchy, the latest kings  emphasized the nature of the new kingdom as heir of that in ": null
    },
    {
        "Toledo": "visigothic kingdom"
    },
    {
        " and the restoration of the Visigothic nation in order to vindicate the expansion to the south. Casariego, J.E.: Crónicas de los reinos de Asturias y León. Biblioteca Universitaria Everest, León 1985, p. 68.  However, such claims have been overall dismissed by modern historiography, emphasizing the distinct, autochthonous nature of the Cantabro-Asturian and Vasconic domains with no continuation to the Gothic Kingdom of Toledo. García Fitz, Francisco. 2009, pp. 149–150     Pelagius kingdom initially was little more than a gathering point for the existing guerrilla forces. During the first decades, the Asturian dominion over the different areas of the kingdom was still lax, and for this reason it had to be continually strengthened through matrimonial alliances with other powerful families from the north of the Iberian Peninsula. Thus, Ermesinda, Pelagius daughter, was married to ": null
    },
    {
        "Alfonso": "alfonso i of asturias"
    },
    {
        ", ": null
    },
    {
        "Dux Peter of Cantabrias": "duchy of cantabria"
    },
    {
        "son. Alfonsos son ": null
    },
    {
        "Fruela": "fruela i of asturias"
    },
    {
        " married Munia, a Basque from ": null
    },
    {
        "Álava": "álava"
    },
    {
        ", after crushing a Basque uprising . Their son is reported to be ": null
    },
    {
        "Alfonso II": "alfonso ii of asturias"
    },
    {
        ", while Alfonso Is daughter Adosinda married Silo, a local chief from the area of Flavionavia, Pravia.     Alfonsos military strategy was typical of Iberian warfare at the time. Lacking the means needed for wholesale conquest of large territories, his tactics consisted of raids in the border regions of ": null
    },
    {
        "Vardulia": "vardulia"
    },
    {
        ". With the plunder he gained further military forces could be paid, enabling him to raid the Muslim cities of ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        ", ": null
    },
    {
        "Zamora": "zamora"
    },
    {
        ", and ": null
    },
    {
        "Coimbra": "coimbra"
    },
    {
        ". Alfonso I also expanded his realm westwards conquering ": null
    },
    {
        "Galicia": "galicia"
    },
    {
        ".          During the reign of ": null
    },
    {
        "King Alfonso II": "alfonso ii of asturias"
    },
    {
        " , the kingdom was firmly established, and a series of Muslim raids caused the transfer of the Asturian capital to ": null
    },
    {
        "Oviedo": "oviedo"
    },
    {
        ". The king is believed to have initiated diplomatic contacts with the kings of ": null
    },
    {
        "Pamplona": "pamplona"
    },
    {
        " and the ": null
    },
    {
        "Carolingian": "carolingian"
    },
    {
        "s, thereby gaining official recognition for his kingdom and his crown from the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " and ": null
    },
    {
        "Charlemagne": "charlemagne"
    },
    {
        ".     The ": null
    },
    {
        "bones": "relic"
    },
    {
        " of St. ": null
    },
    {
        "James the Great": "james the great"
    },
    {
        " were proclaimed to have been found in Iria Flavia  in 813 or probably two or three decades later. The cult of the saint was transferred later to ": null
    },
    {
        "Compostela": "santiago de compostela"
    },
    {
        " , possibly in the early 10th century when the focus of Asturian power moved from the mountains over to León, to become the ": null
    },
    {
        "Kingdom of León": "kingdom of león"
    },
    {
        " or Galicia-León. Santiagos were among many saint relics proclaimed to have been found across north-western Iberia. Pilgrims started to flow in from other Iberian Christian realms, sowing the seeds of the later ": null
    },
    {
        "Way of Saint James": "way of saint james"
    },
    {
        " that sparked the enthusiasm and religious zeal of continental ": null
    },
    {
        "Christian Europe": "christian europe"
    },
    {
        " for centuries.     Despite numerous battles, neither the Umayyads nor the Asturians had sufficient forces to secure control over these northern territories. Under the reign of ": null
    },
    {
        "Ramiro": "ramiro i of asturias"
    },
    {
        ", famed for the highly legendary ": null
    },
    {
        "Battle of Clavijo": "battle of clavijo"
    },
    {
        ", the border began to slowly move southward and Asturian holdings in ": null
    },
    {
        "Castile": "castile"
    },
    {
        ", Galicia, and ": null
    },
    {
        "León": "león"
    },
    {
        " were fortified, and an intensive program of re-population of the countryside began in those territories. In 924 the Kingdom of Asturias became the ": null
    },
    {
        "Kingdom of León": "kingdom of león"
    },
    {
        ", when León became the seat of the royal court .          ": null
    },
    {
        "Alfonso III of Asturias": "alfonso iii of asturias"
    },
    {
        " repopulated the strategically important city ": null
    },
    {
        "León": "león, spain"
    },
    {
        " and established it as his capital. King Alfonso began a series of campaigns to establish control over all the lands north of the ": null
    },
    {
        "Douro": "douro"
    },
    {
        " river. He reorganized his territories into the major duchies  and major counties , and fortified the borders with many castles. At his death in 910 the shift in regional power was completed as the kingdom became the ": null
    },
    {
        "Kingdom of León": "kingdom of león"
    },
    {
        ". From this power base, his heir ": null
    },
    {
        "Ordoño II": "ordoño ii of león"
    },
    {
        " was able to organize attacks against ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        " and even ": null
    },
    {
        "Seville": "seville"
    },
    {
        ".     The ": null
    },
    {
        "Caliphate of Córdoba": "caliphate of córdoba"
    },
    {
        " was gaining power, and began to attack León. King Ordoño allied with Navarre against Abd-al-Rahman, but they were ": null
    },
    {
        "defeated in Valdejunquera": "battle of valdejunquera"
    },
    {
        " in 920. For the next 80 years, the Kingdom of León suffered civil wars, Moorish attack, internal intrigues and assassinations, and the partial independence of Galicia and Castile, thus delaying the reconquest and weakening the Christian forces. It was not until the following century that the Christians started to see their conquests as part of a long-term effort to restore the unity of the Visigothic kingdom.     The only point during this period when the situation became hopeful for León was the reign of ": null
    },
    {
        "Ramiro II": "ramiro ii of león"
    },
    {
        ". King Ramiro, in alliance with ": null
    },
    {
        "Fernán González of Castile": "fernán gonzález of castile"
    },
    {
        " and his retinue of caballeros villanos, ": null
    },
    {
        "defeated the Caliph in Simancas": "battle of simancas"
    },
    {
        " in 939. After this battle, when the Caliph barely escaped with his guard and the rest of the army was destroyed, King Ramiro obtained 12 years of peace, but he had to give González the independence of Castile as payment for his help in the battle. After this defeat, Moorish attacks abated until ": null
    },
    {
        "Almanzor": "almanzor"
    },
    {
        " began his campaigns. ": null
    },
    {
        "Alfonso V": "alfonso v of león"
    },
    {
        " finally regained control over his domains in 1002. Navarre, though attacked by Almanzor, remained intact.     The conquest of León did not include Galicia which was left to temporary independence after the withdrawal of the Leonese king. Galicia was conquered soon after . However, this brief period of independence meant that Galicia remained a kingdom and fief of Leon, which is the reason it is part of Spain and not Portugal. Subsequent kings titled themselves kings of Galicia and León, instead of merely king of León as the two were united personally and not in union.             ": null
    },
    {
        "Ferdinand I of León": "ferdinand i of león"
    },
    {
        " was the leading king of the mid-11th century. He conquered ": null
    },
    {
        "Coimbra": "coimbra"
    },
    {
        " and attacked the ": null
    },
    {
        "taifa": "taifa"
    },
    {
        " kingdoms, often demanding the tributes known as ": null
    },
    {
        "parias": "parias"
    },
    {
        ". Ferdinands strategy was to continue to demand parias until the taifa was greatly weakened both militarily and financially. He also repopulated the Borders with numerous fueros. Following the Navarrese tradition, on his death in 1064 he divided his kingdom between his sons. His son ": null
    },
    {
        "Sancho II of Castile": "sancho ii of castile"
    },
    {
        " wanted to reunite the kingdom of his father and attacked his brothers, with a young noble at his side: Rodrigo Díaz, later known as ": null
    },
    {
        "El Cid Campeador": "el cid campeador"
    },
    {
        ". Sancho was killed in the siege of ": null
    },
    {
        "Zamora": "zamora"
    },
    {
        " by the traitor Bellido Dolfos in 1072. His brother ": null
    },
    {
        "Alfonso VI": "alfonso vi of castile"
    },
    {
        " took over León, Castile and Galicia.     Alfonso VI the Brave gave more power to the fueros and repopulated ": null
    },
    {
        "Segovia": "segovia"
    },
    {
        ", ": null
    },
    {
        "Ávila": "ávila"
    },
    {
        " and ": null
    },
    {
        "Salamanca": "salamanca"
    },
    {
        ". Once he had secured the Borders, King Alfonso conquered the powerful ": null
    },
    {
        "Taifa kingdom of Toledo": "taifa of toledo"
    },
    {
        " in 1085. ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        ", which was the former capital of the Visigoths, was a very important landmark, and the conquest made Alfonso renowned throughout the Christian world. However, this conquest was conducted rather gradually, and mostly peacefully, during the course of several decades. It was not until after sporadic and consistent population resettlements had taken place that Toledo was decisively conquered.     Alfonso VI was first and foremost a tactful monarch who chose to understand the kings of taifa and employed unprecedented diplomatic measures to attain political feats before considering the use of force. He adopted the title  Imperator totius Hispaniae  . Alfonsos more aggressive policy towards the taifas worried the rulers of those kingdoms, who called on the African ": null
    },
    {
        "Almoravids": "almoravid"
    },
    {
        "for help.          The ": null
    },
    {
        "Kingdom of Pamplona": "kingdom of pamplona"
    },
    {
        " primarily extended along either side of the Pyrenees on the Atlantic Ocean. The kingdom was formed when local leader Íñigo Arista led a revolt against the regional Frankish authority and was elected or declared King in Pamplona , establishing a kingdom inextricably linked at this stage to their kinsmen, the ": null
    },
    {
        "muwallad": "muwallad"
    },
    {
        " Banu Qasi": "banu qasi"
    },
    {
        " of Tudela.     Although relatively weak until the early 11th century, Pamplona took a more active role after the accession of ": null
    },
    {
        "Sancho the Great": "sancho iii of pamplona"
    },
    {
        " . The kingdom expanded greatly under his reign, as it absorbed Castile, Leon, and what was to be Aragon, in addition to other small counties that would unite and become the ": null
    },
    {
        "Principality of Catalonia": "principality of catalonia"
    },
    {
        ". This expansion also led to the independence of Galicia, as well as gaining overlordship over ": null
    },
    {
        "Gascony": "gascony"
    },
    {
        ".     In the 12th century, however, the kingdom contracted to its core, and in 1162 King ": null
    },
    {
        "Sancho VI": "sancho vi of navarre"
    },
    {
        " declared himself ": null
    },
    {
        "king of Navarre": "kingdom of navarre"
    },
    {
        ". Throughout its early history, the Navarrese kingdom engaged in frequent skirmishes with the Carolingian Empire, from which it maintained its independence, a key feature of its history until 1513.               The Kingdom of Aragon started off as an offshoot of the Kingdom of Navarre. It was formed when ": null
    },
    {
        "Sancho III of Navarre": "sancho iii of navarre"
    },
    {
        " decided to divide his large realm among all his sons. Aragon was the portion of the realm which passed to ": null
    },
    {
        "Ramiro I of Aragon": "ramiro i of aragon"
    },
    {
        ", an illegitimate son of Sancho III. The kingdoms of Aragon and Navarre were several times united in personal union until the death of ": null
    },
    {
        "Alfonso the Battler": "alfonso the battler"
    },
    {
        " in 1135.     In 1137 the heiress of the kingdom married the ": null
    },
    {
        "count of Barcelona": "count of barcelona"
    },
    {
        ", and their son ": null
    },
    {
        "Alfonso II": "alfonso ii of aragon"
    },
    {
        " ruled from 1162 the combined possessions of his parents, resulting in what modern historians call the ": null
    },
    {
        "Crown of Aragon": "crown of aragon"
    },
    {
        ".     In the following centuries, the Crown of Aragon conquered a number of territories in the Iberian peninsula and the Mediterranean, including the ": null
    },
    {
        "kingdom of Valencia": "kingdom of valencia"
    },
    {
        " and the ": null
    },
    {
        "kingdom of Mallorca": "kingdom of mallorca"
    },
    {
        ". ": null
    },
    {
        "James I of Aragon": "james i of aragon"
    },
    {
        ", also known as James the Conqueror, expanded his territories to the north, south and east. James also signed the ": null
    },
    {
        "Treaty of Corbeil ": "treaty of corbeil"
    },
    {
        ", which released him from the nominal suzerainty of the King of France.     Early in his reign, James attempted to reunite the Aragonese and Navarrese crowns through a treaty with the childless ": null
    },
    {
        "Sancho VII of Navarre": "sancho vii of navarre"
    },
    {
        ". But the Navarrese nobles rejected him, and chose ": null
    },
    {
        "Theobald IV of Champagne": "theobald iv of champagne"
    },
    {
        " in his stead.     Later on, ": null
    },
    {
        "Ferdinand II of Aragon": "ferdinand ii of aragon"
    },
    {
        ", married ": null
    },
    {
        "Isabella of Castile": "isabella of castile"
    },
    {
        ", leading to a dynastic union which eventually gave birth to modern ": null
    },
    {
        "Spain": "spain"
    },
    {
        ", after the conquest of Upper ": null
    },
    {
        "Navarre": "kingdom of navarre"
    },
    {
        " and the ": null
    },
    {
        "kingdom of Granada": "kingdom of granada"
    },
    {
        ".               In 1139, after an overwhelming victory in the ": null
    },
    {
        "Battle of Ourique": "battle of ourique"
    },
    {
        " against the ": null
    },
    {
        "Almoravids": "almoravid dynasty"
    },
    {
        ", ": null
    },
    {
        "Afonso Henriques": "afonso henriques"
    },
    {
        " was proclaimed the first ": null
    },
    {
        "King of Portugal": "list of portuguese monarchs"
    },
    {
        " by his troops. According to the legend, Christ announced from heaven Afonsos great deeds, whereby he would establish the first ": null
    },
    {
        "Portuguese Cortes": "portuguese cortes"
    },
    {
        " at ": null
    },
    {
        "Lamego": "lamego"
    },
    {
        " and be crowned by the ": null
    },
    {
        "Primate": "primate"
    },
    {
        " Archbishop of Braga": "archbishop of braga"
    },
    {
        ". In the ": null
    },
    {
        "Treaty of Zamora": "treaty of zamora"
    },
    {
        " in 1143, ": null
    },
    {
        "Alfonso VII of León and Castile": "alfonso vii of león and castile"
    },
    {
        " recognized Portuguese independence from the Kingdom of León.     In 1147, Portugal ": null
    },
    {
        "captured Santarém": "conquest of santarém"
    },
    {
        ", and seven months later the city of ": null
    },
    {
        "Lisbon": "lisbon"
    },
    {
        " was also brought under Portuguese control after the ": null
    },
    {
        "Siege of Lisbon": "siege of lisbon"
    },
    {
        ". By the papal bull ": null
    },
    {
        "Manifestis Probatum": "manifestis probatum"
    },
    {
        ", ": null
    },
    {
        "Pope Alexander III": "pope alexander iii"
    },
    {
        " recognized Afonso Henriques as King of Portugal in 1179.     With ": null
    },
    {
        "Portugal": "portugal"
    },
    {
        " finally recognized as an independent kingdom by its neighbours, ": null
    },
    {
        "Afonso Henriques": "afonso henriques"
    },
    {
        " and his successors, aided by ": null
    },
    {
        "Crusaders": "crusades"
    },
    {
        " and the military monastic orders the ": null
    },
    {
        "Knights Templar": "knights templar"
    },
    {
        ", the ": null
    },
    {
        "Order of Aviz": "order of aviz"
    },
    {
        " or the ": null
    },
    {
        "Order of Saint James": "order of saint james of the sword"
    },
    {
        ", pushed the ": null
    },
    {
        "Moors": "moors"
    },
    {
        " to the ": null
    },
    {
        "Algarve": "algarve"
    },
    {
        " on the southern coast of Portugal. After several campaigns, the Portuguese part in the Reconquista came to an end with the definitive capture of the Algarve in 1249. With all of Portugal now under the control of ": null
    },
    {
        "Afonso III of Portugal": "afonso iii of portugal"
    },
    {
        ", religious, cultural and ethnic groups became gradually homogenized.          After the completion of the Reconquista, the Portuguese territory was a Roman Catholic realm. Nonetheless, ": null
    },
    {
        "Denis of Portugal": "denis of portugal"
    },
    {
        " carried out a short war with ": null
    },
    {
        "Castile": "crown of castile"
    },
    {
        " for possession of the towns of ": null
    },
    {
        "Serpa": "serpa"
    },
    {
        " and ": null
    },
    {
        "Moura": "moura municipality"
    },
    {
        ". After this, Denis avoided war; he signed the ": null
    },
    {
        "Treaty of Alcanizes": "treaty of alcanizes"
    },
    {
        " with ": null
    },
    {
        "Ferdinand IV of Castile": "ferdinand iv of castile"
    },
    {
        " in 1297, establishing the present-day borders.     During the suppression of the Knights Templar all over ": null
    },
    {
        "Europe": "europe"
    },
    {
        ", under the influence of ": null
    },
    {
        "Philip IV of France": "philip iv of france"
    },
    {
        " and ": null
    },
    {
        "Pope Clement V": "pope clement v"
    },
    {
        " requesting its annihilation by 1312, King Denis reinstituted the Templars of ": null
    },
    {
        "Tomar": "tomar"
    },
    {
        " as the ": null
    },
    {
        "Order of Christ": "order of christ"
    },
    {
        " in 1319. Denis believed that the Orders assets should by their nature stay in any given Order instead of being taken by the King, largely for the Templars contribution to the Reconquista and the reconstruction of Portugal after the wars.     The experience gained during the battles of the Reconquista was fundamental to ": null
    },
    {
        "Conquest of Ceuta": "conquest of ceuta"
    },
    {
        ", the first step to the establishment of the ": null
    },
    {
        "Portuguese Empire": "portuguese empire"
    },
    {
        ". Likewise, the contact with ": null
    },
    {
        "Muslims navigation techniques and sciences": "islamic golden age"
    },
    {
        " enabled the creation of ": null
    },
    {
        "Portuguese nautical innovations": "portuguese renaissance"
    },
    {
        " such as the ": null
    },
    {
        "caravel": "caravel"
    },
    {
        " – the principal Portuguese ship during their voyages of exploration in the ": null
    },
    {
        "Age of Discovery": "age of discovery"
    },
    {
        ".        Minor Christian realms were the ": null
    },
    {
        "Kingdom of Viguera": "kingdom of viguera"
    },
    {
        " , the ": null
    },
    {
        "Lordship of Albarracín": "lordship of albarracín"
    },
    {
        " and the ": null
    },
    {
        "Principality of Valencia": ":es:señorío de valencia"
    },
    {
        " .       Clashes and raids on bordering Andalusian lands did not keep the Christian kingdoms from battling among themselves or allying with Muslim kings. Some Muslim kings had Christian-born wives or mothers. Some Christian champions, like ": null
    },
    {
        "El Cid": "el cid"
    },
    {
        ", were contracted by ": null
    },
    {
        "taifa": "taifa"
    },
    {
        " kings to fight against their neighbours. Indeed, ": null
    },
    {
        "El Cids": "el cid"
    },
    {
        "first battle experience was gained fighting for a Muslim state against a Christian state. At the ": null
    },
    {
        "Battle of Graus": "battle of graus"
    },
    {
        " in 1063, he and other Castilians fought on the side of ": null
    },
    {
        "al-Muqtadir": "ahmad al-muqtadir"
    },
    {
        ", Muslim ": null
    },
    {
        "sultan": "sultan"
    },
    {
        " of ": null
    },
    {
        "Zaragoza": "zaragoza"
    },
    {
        ", against the forces of ": null
    },
    {
        "Ramiro I of Aragon": "ramiro i of aragon"
    },
    {
        ". There is even an instance of a crusade being declared against another Christian king in Iberia. Joseph OCallaghan . Reconquest and Crusade in Medieval Spain, Philadelphia: University of Philadelphia Press. p.  62.     Following the disastrous defeat of ": null
    },
    {
        "Alfonso VIII": "alfonso viii"
    },
    {
        ", King of Castile, at ": null
    },
    {
        "Alarcos": "battle of alarcos"
    },
    {
        ", Kings ": null
    },
    {
        "Alfonso IX": "alfonso ix"
    },
    {
        " of León and ": null
    },
    {
        "Sancho VII": "sancho vii"
    },
    {
        " of Navarre entered an alliance with the ": null
    },
    {
        "Almohads": "almohad caliphate"
    },
    {
        " and invaded Castile in 1196. By the end of the year Sancho VII had dropped out of the war under Papal pressure. Early in 1197, at the request of ": null
    },
    {
        "Sancho I": "sancho i of portugal"
    },
    {
        ", King of Portugal, Pope ": null
    },
    {
        "Celestine III": "celestine iii"
    },
    {
        " declared a crusade against Alfonso IX and released his subjects from their responsibilities to the king, declaring that the men of his realm shall be absolved from their fidelity and his dominion by authority of the apostolic see. Together the Kings of Portugal, Castile, and ": null
    },
    {
        "Aragon": "kingdom of aragon"
    },
    {
        " invaded León. In the face of this onslaught combined with pressure from the Pope, Alfonso IX was finally forced to sue for peace in October 1197.     In the late years of Al-Andalus, Castile had the might to conquer the remnants of the kingdom of ": null
    },
    {
        "Granada": "granada"
    },
    {
        ", but the kings preferred to claim the tribute of the Muslim  parias . The trade of Granadan goods and the parias were a major means by which African gold entered ": null
    },
    {
        "medieval Europe": "medieval europe"
    },
    {
        ".          The Reconquista was a process not only of war and conquest, but also of ": null
    },
    {
        "repopulation": "colonization"
    },
    {
        ". Christian kings moved their own people to locations abandoned by Muslims in order to have a population capable of defending the borders. The main repopulation areas were the ": null
    },
    {
        "Douro": "douro"
    },
    {
        " Basin , the high ": null
    },
    {
        "Ebro": "ebro"
    },
    {
        " valley  and central ": null
    },
    {
        "Catalonia": "catalonia"
    },
    {
        ". The repopulation of the ": null
    },
    {
        "Douro": "douro"
    },
    {
        " Basin took place in two distinct phases. North of the river, between the 9th and 10th centuries, the pressure  system was employed. South of the ": null
    },
    {
        "Douro": "douro"
    },
    {
        ", in the 10th and 11th centuries, the presura led to the charters . Fueros were used even south of the Central Range.     The presura referred to a group of peasants who crossed the mountains and settled in the abandoned lands of the Douro Basin. Asturian laws promoted this system, for instance granting a peasant all the land he was able to work and defend as his own property. Of course, Asturian and Galician minor nobles and clergymen sent their own expeditions with the peasants they maintained. This led to very feudalised areas, such as ": null
    },
    {
        "León": "león"
    },
    {
        " and Portugal, whereas Castile, an arid land with vast plains and harsh climate, only attracted peasants with no hope in Biscay. As a consequence, Castile was governed by a single count, but had a largely non-feudal territory with many ": null
    },
    {
        "free": "wikt:freeman"
    },
    {
        " peasants. Presuras also appear in Catalonia, when the count of Barcelona ordered the Bishop of Urgell and the count of Gerona to repopulate the plains of ": null
    },
    {
        "Vic": "vic"
    },
    {
        ".     During the 10th century and onwards, cities and towns gained more importance and power, as commerce reappeared and the population kept growing.  Fuero s were ": null
    },
    {
        "charters": "charter"
    },
    {
        "documenting the privileges and usages given to all the people repopulating a town. The fueros provided a means of escape from the ": null
    },
    {
        "feudal system": "feudal system"
    },
    {
        ", as fueros were only granted by the monarch. As a result, the town council was dependent on the monarch alone and, in turn, was required to provide auxilium – aid or troops – for their monarch. The military force of the towns became the caballeros villanos. The first fuero was given by count ": null
    },
    {
        "Fernán González": "fernán gonzález"
    },
    {
        " to the inhabitants of ": null
    },
    {
        "Castrojeriz": "castrojeriz"
    },
    {
        " in the 940s. The most important towns of medieval Iberia had fueros, or forais. In Navarre, fueros were the main repopulating system. Later on, in the 12th century, Aragon also employed the system; for example, the fuero of ": null
    },
    {
        "Teruel": "teruel"
    },
    {
        ", which was one of the last fueros, in the early 13th century.     From the mid-13th century on, no more charters were granted, as the demographic pressure had disappeared and other means of re-population were created. Fueros remained as city charters until the 18th century in Aragon, Valencia and Catalonia and until the 19th century in Castile and Navarre. Fueros had an immense importance for those living under them, who were prepared to go to war to defend their rights under the charter. In the 19th century, the abolition of the fueros in Navarre would be one of the causes of the ": null
    },
    {
        "Carlist Wars": "carlist wars"
    },
    {
        ". In Castile, disputes over the system contributed to the war against Charles I .                During the 9th century the Berbers returned to North Africa in the aftermath of revolts. Many governors of large cities distant from the capital, Córdoba, had planned to establish their independence. Then, in 929, the ": null
    },
    {
        "Emir of Córdoba": "emir of córdoba"
    },
    {
        " , the leader of the Umayyad dynasty, declared himself ": null
    },
    {
        "Caliph": "caliph"
    },
    {
        ", independent from the ": null
    },
    {
        "Abbasids": "abbasid"
    },
    {
        "in ": null
    },
    {
        "Baghdad": "baghdad"
    },
    {
        ". He took all the military, religious, and political power and reorganised the army and the bureaucracy.     After regaining control over the dissident governors, Abd-ar-Rahman III tried to conquer the remaining Christian kingdoms of the Iberian peninsula, attacking them several times and forcing them back beyond the ": null
    },
    {
        "Cantabrian Mountains": "cantabrian mountains"
    },
    {
        ". Abd-ar-Rahmans grandson later became a puppet in the hands of the great ": null
    },
    {
        "Vizier": "vizier"
    },
    {
        " Almanzor": "al-mansur ibn abi aamir"
    },
    {
        " . Almanzor waged several campaigns attacking and sacking ": null
    },
    {
        "Burgos": "burgos"
    },
    {
        ", León, ": null
    },
    {
        "Pamplona": "pamplona"
    },
    {
        ", ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        ", and ": null
    },
    {
        "Santiago de Compostela": "santiago de compostela"
    },
    {
        " before his death in 1002.     Between Almanzors death and 1031, Al-Andalus suffered many civil wars, which ended in the division into the ": null
    },
    {
        "Taifa kingdoms": "taifa"
    },
    {
        ". The taifas were small kingdoms, established by the city governors. The result was many small kingdoms, each centered upon its capital. Their governors had no larger-scale vision of the Moorish presence in the Iberian peninsula and had no qualms about attacking their neighbouring kingdoms whenever they could gain advantage by doing so.     The split into the taifa states weakened the Islamic presence, and the Christian kingdoms further advanced as ": null
    },
    {
        "Alfonso VI of León and Castile": "alfonso vi of león and castile"
    },
    {
        " conquered ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        " in 1085. Surrounded by enemies, taifa rulers sent a desperate appeal to the Berber chieftain ": null
    },
    {
        "Yusuf ibn Tashfin": "yusuf ibn tashfin"
    },
    {
        ", leader of the Almoravids.                The ": null
    },
    {
        "Almoravids": "almoravid"
    },
    {
        "were a Muslim militia primarily composed of Berber and ": null
    },
    {
        "African": "ethnic groups of africa"
    },
    {
        " Moors, and unlike previous Muslim rulers, they were not so tolerant towards Christians and Jews. Their armies entered the Iberian peninsula on several occasions and defeated King Alfonso at the ": null
    },
    {
        "Battle of Sagrajas": "battle of sagrajas"
    },
    {
        " in 1086, but initially their purpose was to unite all the taifas into a single Almoravid Caliphate. Their actions halted the southward expansion of the Christian kingdoms. Their only defeat came at ": null
    },
    {
        "Valencia": "valencia"
    },
    {
        " in 1094, due to the actions of ": null
    },
    {
        "El Cid": "el cid"
    },
    {
        ".     Meanwhile, Navarre lost all importance under King ": null
    },
    {
        "Sancho IV": "sancho iv of navarre"
    },
    {
        ", for he lost Rioja to ": null
    },
    {
        "Sancho II of Castile": "sancho ii of castile"
    },
    {
        ", and nearly became the vassal of Aragon. At his death, the Navarrese chose as their king ": null
    },
    {
        "Sancho Ramírez": "sancho ramírez"
    },
    {
        ", King of Aragon, who thus became Sancho V of Navarre and I of Aragon. Sancho Ramírez gained international recognition for Aragon, uniting it with Navarre and expanding the borders south, conquering Wasqa t  ": null
    },
    {
        "Huesca": "huesca"
    },
    {
        " deep in the valleys in 1096 and building a fort, El Castellar, 25  km from Saraqusta t  ": null
    },
    {
        "Zaragoza": "zaragoza"
    },
    {
        ".     Catalonia came under intense pressure from the taifas of Zaragoza and ": null
    },
    {
        "Lérida": "taifa of lérida"
    },
    {
        ", as well as from internal disputes, as Barcelona suffered a dynastic crisis that led to open war among the smaller counties. But by the 1080s, the situation had calmed down, and the dominion of Barcelona over the smaller counties was restored.             After a brief period of disintegration , the Almohads, the rising power in North Africa, took over most of Al-Andalus. However they were decisively defeated at the ": null
    },
    {
        "Battle of Las Navas de Tolosa": "battle of las navas de tolosa"
    },
    {
        " by a Christian coalition, losing almost all the remaining lands of Al-Andalus in the following decades. By 1252 only the ": null
    },
    {
        "Kingdom of Granada": "kingdom of granada"
    },
    {
        " remained intact but as a vassal state of Castile.          ": null
    },
    {
        "Ferdinand and Isabella": "catholic monarchs"
    },
    {
        " completed the Reconquista with a war against the ": null
    },
    {
        "Emirate of Granada": "emirate of granada"
    },
    {
        " that started in 1482 and ended with Granadas surrender on January 2, 1492. The Moors in Castile previously numbered half a million within the realm . By 1492 some 100,000 had died or been enslaved, 200,000 had emigrated, and 200,000 remained in Castile. Many of the Muslim elite, including Granadas former Emir ": null
    },
    {
        "Muhammad XII": "muhammad xii of granada"
    },
    {
        ", who had been given the area of the ": null
    },
    {
        "Alpujarras": "alpujarras"
    },
    {
        " mountains as a principality, found life under Christian rule intolerable and emigrated to ": null
    },
    {
        "Tlemcen": "tlemcen"
    },
    {
        " in North Africa. Kamen, Henry. Spain 1469 – 1714 A Society of Conflict. Third edition. pp. 37–38     In 1497 Spanish forces took ": null
    },
    {
        "Melilla": "melilla"
    },
    {
        ", west of Oran, and the island of ": null
    },
    {
        "Djerba": "djerba"
    },
    {
        ", south of Tunis, and went on to more important gains, with the bloody ": null
    },
    {
        "seizure of Oran in 1509": "spanish conquest of oran"
    },
    {
        ", and the capture of ": null
    },
    {
        "Bougie": "bougie"
    },
    {
        " and ": null
    },
    {
        "Tripoli in 1510": "spanish conquest of tripoli"
    },
    {
        ". The Spanish capture of ": null
    },
    {
        "Tripoli": "tripoli"
    },
    {
        " cost them some 300 men, while the inhabitants suffered between 3,000 and 5,000 killed and another 5,000–6,000 carried off as slaves.  Soon thereafter, however, they faced competition from the rapidly expanding ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " in the east and were pushed back.               As elsewhere in the Muslim world, Christians and Jews were allowed to retain their religions, with their own legal systems and courts, by paying a tax, the  jizya . The penalty for not paying it was imprisonment and death.     The new Christian hierarchy demanded heavy taxes from non-Christians and gave them rights, such as in the ": null
    },
    {
        "Treaty of Granada ": "treaty of granada"
    },
    {
        " only for Moors in recently Islamic Granada. On July 30, 1492, all the Jewish community – some 200,000 people – were forcibly expelled. , The Jewish Virtual Library. The next year the ": null
    },
    {
        "Alhambra decree": "alhambra decree"
    },
    {
        " ordered the expulsion of practicing Jews, leading many to convert to Catholicism. In 1502, Queen Isabella I declared conversion to Catholicism compulsory within the Kingdom of Castile. King ": null
    },
    {
        "Charles V": "charles v, holy roman emperor"
    },
    {
        " did the same to Moors in the Kingdom of Aragon in 1526, forcing conversions of its Muslim population during the ": null
    },
    {
        "Revolt of the Germanies": "revolt of the germanies"
    },
    {
        ". , Ignacio Tofiño-Quesada. Graduate Center, CUNY. Many local officials took advantage of the situation to seize property.            Most of the descendants of those Muslims who submitted to conversion to Christianity – rather than exile – during the early periods of the Spanish and Portuguese Inquisition, the Moriscos, were later ": null
    },
    {
        "expelled from Spain": "expulsion of the moriscos"
    },
    {
        " after serious social upheaval, when the Inquisition was at its height. The expulsions were carried out more severely in eastern Spain due to local animosity towards Muslims and Moriscos where they were seen as economic rivals by local workers who saw them as cheap labor undermining their bargaining position with the landlords. Exactions imposed on the Moriscos paved the way to a major ": null
    },
    {
        "Morisco revolt": "morisco revolt"
    },
    {
        " happening in 1568, with the final ": null
    },
    {
        "expulsion of the Moriscos": "expulsion of the moriscos"
    },
    {
        " from ": null
    },
    {
        "Castile": "kingdom of castile"
    },
    {
        " taking place in 1609; they were driven from ": null
    },
    {
        "Aragon": "aragon"
    },
    {
        " at about the same time.     Making things more complex were the many former Muslims and Jews known as  Morisco s,  Marrano s, and  Converso s, who shared ancestors in common with many Christians, especially among the aristocracy, causing much concern over loyalty and attempts by the aristocracy to hide their non-Christian ancestry. Some – the numbers are debated – continued to secretly practice their religions and use their languages well into the sixteenth century.   Those that the ": null
    },
    {
        "Spanish Inquisition": "spanish inquisition"
    },
    {
        " found to be secretly practicing Islam or Judaism were executed, imprisoned, or exiled. Nevertheless, all those deemed to be New Christians were repeatedly suspected of illegally continuing in secret to practice their religions various ": null
    },
    {
        "crimes against the Spanish state": "treason"
    },
    {
        " including continued practice of Islam or Judaism. New Christians were subject to many discriminatory practices starting in the sixteenth century.          The many advances and retreats created several social types:   The  Muladi : Christians under Islamic rule who converted to Islam after the arrival of the Berbers.   The  Mozarab s: Christians in Muslim-held lands. Some of them migrated to the north of the peninsula in times of persecution bringing elements of the styles, food and agricultural practices learned from the Andalusians, while they continued practicing their Christianity with older forms of Catholic worship and their own versions of the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " language.   ": null
    },
    {
        "New Christians": "new christians"
    },
    {
        " : Jews converting to Christianity called  conversos , or pejoratively  Marrano s. Jews converted to Christianity voluntarily or through force. Some were ": null
    },
    {
        "Crypto-Jews": "crypto-jews"
    },
    {
        " who continued practicing ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        " secretly. All remaining Jews were expelled from Spain as a consequence of the 1492 ": null
    },
    {
        "Alhambra Decree": "alhambra decree"
    },
    {
        ", and from Portugal in 1497. Former Jews were subject to the ": null
    },
    {
        "Spanish": "spanish inquisition"
    },
    {
        " and ": null
    },
    {
        "Portuguese Inquisition": "portuguese inquisition"
    },
    {
        "s, established to enforce Christian faith and practice, which often resulted in secret investigations and public punishments of conversos in ": null
    },
    {
        "autos-da-fé": "auto-da-fé"
    },
    {
        " , often public executions by burning the victim alive.   The  Mudéjar : Muslims in Christian-held lands.    Morisco s: Muslim conversos. Muslims who were forced to convert to Catholicism. A significant number were Crypto-Muslims who continued practicing Islam secretly. They ranged from successful skilled artisans, valued and protected in Aragon, to impoverished peasants in Castile. After the Alhambra Decree the entire Islamic population was forced to convert or leave, and at the beginning of the seventeenth century a significant number were expelled in the ": null
    },
    {
        "expulsion of the Moriscos": "expulsion of the moriscos"
    },
    {
        ".            Real, legendary, and fictional episodes from the Reconquista are the subject of much of medieval ": null
    },
    {
        "Galician-Portuguese": "galician-portuguese"
    },
    {
        ", ": null
    },
    {
        "Spanish": "spanish literature"
    },
    {
        ", and ": null
    },
    {
        "Catalan literature": "catalan literature"
    },
    {
        " such as the  cantar de gesta .      Some noble ": null
    },
    {
        "genealogies": "genealogy"
    },
    {
        " show the close relations between Muslims and Christians. For example, ": null
    },
    {
        "Al-Mansur Ibn Abi Aamir": "al-mansur ibn abi aamir"
    },
    {
        ", whose rule is considered to have marked the peak of power for Moorish Al-Andalus Iberia, married Abda, daughter of ": null
    },
    {
        "Sancho Garcés II": "sancho ii of navarra"
    },
    {
        " of ": null
    },
    {
        "Navarra": "navarra"
    },
    {
        ", who bore him a son, named Abd al-Rahman and commonly known in a pejorative sense as ": null
    },
    {
        "Sanchuelo": "sanchuelo"
    },
    {
        " .     After his fathers death, Sanchuelo/Abd al-Rahman, as a son of a Christian princess, was a strong contender to take over the ultimate power in Muslim al-Andalus. A hundred years later, King ": null
    },
    {
        "Alfonso VI of Castile": "alfonso vi of castile"
    },
    {
        ", considered among the greatest of the Medieval Spanish kings, designated as his heir his son by the refugee ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        " princess ": null
    },
    {
        "Zaida of Seville": "zaida of seville"
    },
    {
        ".     The Reconquista was a war with long periods of respite between the adversaries, partly for pragmatic reasons and also due to infighting among the Christian kingdoms of the North spanning over seven centuries. Some populations practiced Islam or Christianity as their own religion during these centuries, so the identity of contenders changed over time.          Currently, festivals called  moros y cristianos  , moros i cristians , mouros e cristãos and mouros e cristiáns , which all mean Moors and Christians , recreate the fights as colorful parades with elaborate garments and lots of fireworks, especially on the central and southern towns of the ": null
    },
    {
        "Land of Valencia": "land of valencia"
    },
    {
        ", like ": null
    },
    {
        "Alcoi": "alcoi"
    },
    {
        ", ": null
    },
    {
        "Ontinyent": "ontinyent"
    },
    {
        " or ": null
    },
    {
        "Villena": "villena"
    },
    {
        ".       A 2016 study found that the rate of Reconquest —how rapidly the Christian frontier was expanded—has persistent effects on the Spanish economy to this day. After an initial phase of military conquest, Christians states incorporated the conquered land. When large frontier regions were incorporated at once, the land was mostly given to the nobility and the military orders, with negative effects on long-term development. The incorporation of small regions, on the other hand, generally allowed for the participation of individual settlers and was more likely to fall under the auspices of the crown. This led to a more equitable distribution of land and greater social equality, with positive effects on long-term development.           On the conclusion of Iberian victory over the Moors, the Iberian powers, Spain and Portugal didnt stop their warring against the Muslims solely in their homelands—they extended the conflict against Islam overseas. The Spanish under the Habsburg dynasty soon became the champions of Roman Catholicism in Europe and the Mediterranean against the encroaching threat of the ": null
    },
    {
        "Ottoman Empire": "ottoman-habsburg wars"
    },
    {
        ". In a similar vein, the Portuguese also extended the Reconquista, this time against Muslim states overseas. The ": null
    },
    {
        "conquest of Ceuta": "conquest of ceuta"
    },
    {
        " marked the beginning of Portuguese expansion into Muslim Africa. Soon, the Portuguese also ": null
    },
    {
        "went into conflict with the Ottoman Caliphate": "ottoman–portuguese conflicts"
    },
    {
        " in the ": null
    },
    {
        "Mediterranean": "portuguese expedition to otranto"
    },
    {
        " proficiscitur Hydruntum classis quam ex Portugallia accersivimus. . . Speramus illam magno usui Hydruntine expugnationi futuram. . . , ": null
    },
    {
        "Indian Ocean": "ottoman naval expeditions in the indian ocean"
    },
    {
        "  and ": null
    },
    {
        "Southeast Asia": "ottoman expedition to aceh"
    },
    {
        " as the Portuguese conquered the Ottomans allies: the ": null
    },
    {
        "Sultanate of Adal": "adal sultanate"
    },
    {
        " in East Africa, the ": null
    },
    {
        "Sultanate of Delhi": "sultanate of delhi"
    },
    {
        " in South Asia and the ": null
    },
    {
        "Sultanate of Malacca": "sultanate of malacca"
    },
    {
        " in Southeast Asia. João Paulo de Oliveira e Costa, Vítor Luís Gaspar Rodrigues  Meanwhile, the Spanish also went to war against the Sultanate of Brunei in Southeast Asia. The Spanish sent expeditions from ": null
    },
    {
        "New Spain": "new spain"
    },
    {
        " to conquer and Christianize the ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        ", then a territory of the ": null
    },
    {
        "Sultanate of Brunei": "sultanate of brunei"
    },
    {
        ". Brunei itself was assaulted during the ": null
    },
    {
        "Castilian War": "castilian war"
    },
    {
        ".   Spain also went to war against the Sultanates of ": null
    },
    {
        "Sulu": "sultanate of sulu"
    },
    {
        ", ": null
    },
    {
        "Maguindanao": "sultanate of maguindanao"
    },
    {
        ", and ": null
    },
    {
        "Lanao": "confederation of sultanates in lanao"
    },
    {
        " in the ": null
    },
    {
        "Spanish-Moro Conflict": "spanish-moro conflict"
    },
    {
        ". Charles A. Truxillo , Jain Publishing Company, Crusaders in the Far East: The Moro Wars in the Philippines in the Context of the Ibero-Islamic World War . The primary inspiration for these wars against Muslim states overseas was the Reconquista.        ": null
    },
    {
        "Umayyad Caliphate": "umayyad caliphate"
    },
    {
        " begins.   717: First Umayyad foray ": null
    },
    {
        "over the Pyrenees into Visigothic Gaul": "islamic invasion of gaul"
    },
    {
        ".   719: ": null
    },
    {
        "Islam": "islam"
    },
    {
        "ic ": null
    },
    {
        "Umayyad": "umayyad caliphate"
    },
    {
        " rule in Iberia at its widest, covering almost all of the Iberian Peninsula and across the ": null
    },
    {
        "Pyrenees": "pyrenees"
    },
    {
        " in ": null
    },
    {
        "Narbonne": "narbonne"
    },
    {
        ".   718 or 722: ": null
    },
    {
        "Battle of Covadonga": "battle of covadonga"
    },
    {
        " in the north-west of Iberia, establishing a Christian Kingdom in ": null
    },
    {
        "Asturias": "asturias"
    },
    {
        ".   739: Berber garrison driven from the ": null
    },
    {
        "Kingdom of Galicia": "kingdom of galicia"
    },
    {
        ". ": null
    },
    {
        "Duero River": "duero river"
    },
    {
        " to join the ": null
    },
    {
        "Berber rebellion": "berber revolt"
    },
    {
        ".   759: ": null
    },
    {
        "Pepin the Short": "pepin the short"
    },
    {
        " conquers the last Muslim strongholds in present-day France.   801: The Carolingians led by ": null
    },
    {
        "Louis the Pious": "louis the pious"
    },
    {
        " conquer ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        ", sack ": null
    },
    {
        "Lleida": "lleida"
    },
    {
        ", and establish the ": null
    },
    {
        "Spanish March": "marca hispanica"
    },
    {
        ".   809: The Carolingians fail to take and hold ": null
    },
    {
        "Tarragona": "tarragona"
    },
    {
        " and ": null
    },
    {
        "Tortosa": "tortosa"
    },
    {
        ", retreating to the ": null
    },
    {
        "Ebro": "ebro"
    },
    {
        " marches.   ": null
    },
    {
        "Porto": "porto"
    },
    {
        ", leading to the establishment of the ": null
    },
    {
        "County of Portucale": "county of portucale"
    },
    {
        " .   871: Capture of ": null
    },
    {
        "Coimbra": "coimbra"
    },
    {
        " by the ": null
    },
    {
        "Asturians": "asturias"
    },
    {
        "; ": null
    },
    {
        "County of Coimbra": "county of coimbra"
    },
    {
        " established.   914: ": null
    },
    {
        "Muslims": "al-andalus"
    },
    {
        " briefly retake ": null
    },
    {
        "Barcelona": "barcelona"
    },
    {
        ".   929: ": null
    },
    {
        "Abd al-Rahman III": "abd al-rahman iii"
    },
    {
        " declares ": null
    },
    {
        "caliphate": "caliphate"
    },
    {
        " in ": null
    },
    {
        "Córdoba": "córdoba, andalusia"
    },
    {
        ", taking the title of commander of the faithful . Kennedy, Hugh. Muslim Spain and Portugal: A Political History of Al-Andalus. London: Longman, 1996. p. 84   1085: Landmark conquest of ": null
    },
    {
        "Toledo": "toledo, spain"
    },
    {
        " by Castilian forces. Over half of Iberia conquered by Christian-ruled kingdoms.   1086: ": null
    },
    {
        "Almoravid": "almoravid"
    },
    {
        " defeated Castilian army and halted its advance at ": null
    },
    {
        "Battle of Sagrajas": "battle of sagrajas"
    },
    {
        ".   1097: ": null
    },
    {
        "First Crusade": "first crusade"
    },
    {
        "; two-thirds of the Iberian peninsula conquered by Christian-ruled kingdoms.   1118: Navarro-Aragonese troops capture the Muslim strongholds of ": null
    },
    {
        "Tudela": "tudela, navarre"
    },
    {
        " and ": null
    },
    {
        "Zaragoza": "zaragoza"
    },
    {
        ".   1147: ": null
    },
    {
        "Siege of Lisbon": "siege of lisbon"
    },
    {
        ", where ": null
    },
    {
        "Second Crusade": "second crusade"
    },
    {
        " and the ": null
    },
    {
        "Kingdom of Portugal": "kingdom of portugal"
    },
    {
        " defeat the ": null
    },
    {
        "Almoravids": "almoravids"
    },
    {
        ".   1148: ": null
    },
    {
        "Siege of Tortosa": "siege of tortosa"
    },
    {
        ", part of the Second Crusade   1195: The ": null
    },
    {
        "Battle of Alarcos": "battle of alarcos"
    },
    {
        " establishes ": null
    },
    {
        "Almohad": "almohad caliphate"
    },
    {
        " authority in the south of the Iberia.   1212: The key battle of ": null
    },
    {
        "Navas de Tolosa": "navas de tolosa"
    },
    {
        " heralds the steady political decline of the Iberian Muslim kingdoms.   1236: ": null
    },
    {
        "Cádiz": "cádiz"
    },
    {
        " and the former capital of the caliphate ": null
    },
    {
        "Córdoba": "córdoba, andalusia"
    },
    {
        " are conquered by Castilian forces.   1248: Christian armies under ": null
    },
    {
        "Ferdinand III of Castile": "ferdinand iii of castile"
    },
    {
        " take ": null
    },
    {
        "Seville": "seville"
    },
    {
        " after 16 months of siege.   1249: King ": null
    },
    {
        "Afonso III of Portugal": "afonso iii of portugal"
    },
    {
        " takes ": null
    },
    {
        "Faro": "faro, portugal"
    },
    {
        " , ending the Portuguese Reconquista in 1249. Setton, Kenneth Meyer, A History of the Crusades: The Fourteenth and Fifteenth Centuries, , 432.   1249: The ": null
    },
    {
        "Emirate of Granada": "emirate of granada"
    },
    {
        " is now the only Islamic state in Iberia.   14th and 15th centuries: Marinid Muslims seize control of some towns on the southern coast but are soon driven out, leaving only a few isolated towns in the south of Granada still controlled by the Moors.   1492: Following the ": null
    },
    {
        "Treaty of Granada": "treaty of granada"
    },
    {
        " , the Moors surrender the city, completing the military phase of the Reconquista.   1492 and 1502: ": null
    },
    {
        "royal decrees": "alhambra decree"
    },
    {
        " order Muslims and Jews to convert to Catholicism or leave ": null
    },
    {
        "Castile": "crown of castile"
    },
    {
        ".    1492: ": null
    },
    {
        "Alhambra Decree": "alhambra decree"
    },
    {
        " issued by the ": null
    },
    {
        "Catholic Monarchs": "catholic monarchs"
    },
    {
        " March 31 expelling Jews from Spain    1609 April 9, King Philip III of Spain decrees ": null
    },
    {
        "expulsion of the Moriscos": "expulsion of the moriscos"
    }
]