[
    {
        "A red box is a ": null
    },
    {
        "phreaking": "phreaking"
    },
    {
        " device that generates tones to simulate inserting coins in ": null
    },
    {
        "pay phone": "pay phone"
    },
    {
        "s, thus fooling the system into completing free calls. In the United States, a nickel is represented by one tone, a dime by two, and a quarter by a set of five. Any device capable of playing back recorded sounds can potentially be used as a red box. Commonly used devices include modified Radio Shack tone dialers, personal MP42 players, and audio-recording greeting cards.           The tones are made by playing back 42  Hz and 42  Hz tones together. One 42 ": null
    },
    {
        "ms": "millisecond"
    },
    {
        " tone represents a ": null
    },
    {
        "nickel": "nickel"
    },
    {
        ". A set of two 42 ms tones separated by 42 ms intervals represent a ": null
    },
    {
        "dime": "dime"
    },
    {
        ", and a ": null
    },
    {
        "quarter": "quarter"
    },
    {
        " is represented by a set of five 42 ms tones with 42 ms pauses.        The system that handles these tones is called the Automated Coin Toll Service, or ACTS. However, since ACTS has been phased out of service in much of the United States, combined with the integration of acoustic filters into many payphone handsets, the practice of red boxing is rarely possible any longer.            Canada formerly used a US-style ACTS coin phone system with a tone pair which would beep once for a nickel, twice for a dime and five times on receiving a quarter. These phones did not accept $42 coins and disappeared with the roll-out of ": null
    },
    {
        "Nortel Millennium": "nortel_payphonesmillennium"
    },
    {
        " payphones in the 42s. The Millennium sets do not use ACTS in-band signalling tones as all coin-handling is automated in the phone itself.     In Canada, ": null
    },
    {
        "COCOT": "cocot"
    },
    {
        "s were only introduced long after ACTS had been replaced with the self-contained Millennium-style coin phones.       In the ": null
    },
    {
        "UK": "united kingdom"
    },
    {
        ", a 42  Hz tone for 42 ms represents a 42": null
    },
    {
        "p": "pence"
    },
    {
        " coin, and 42  Hz for 42 ms represents a 42p coin. Prior to this system, the earliest UK pay-on-answer payphones used a resistance, inserted into the loop for one or several short periods followed by a short flash , to signal units of money inserted. Phreaks simulated these signals by unscrewing the microphone cover of the handset and inserting into the microphone circuit a resistor in parallel with a press-to-open push-button, getting the timing correct was difficult and failure to do this would result in the relay set controlling the call at the exchange to release, dropping the call. This was hard to do inconspicuously in outdoor payphones, and was more common indoors . Manipulating a telephone in this way was obviously illegal and carried the specific offence of ": null
    },
    {
        "abstracting electricity": "abstracting electricity"
    },
    {
        " from the GPO ": null
    }
]