[
    {
        "               The Workers and Peasants Red Army, frequently shortened to Red Army, was the army and the air force of the ": null
    },
    {
        "Russian Soviet Federative Socialist Republic": "Russian Soviet Federative Socialist Republic"
    },
    {
        " and, after 1922, the ": null
    },
    {
        "Union of Soviet Socialist Republics": "Union Of Soviet Socialist Republics"
    },
    {
        ". The army was established immediately after the 1917 ": null
    },
    {
        "October Revolution": "October Revolution"
    },
    {
        ". The ": null
    },
    {
        "Bolsheviks": "Bolsheviks"
    },
    {
        " raised an army to oppose the military confederations  of their adversaries during the ": null
    },
    {
        "Russian Civil War": "Russian Civil War"
    },
    {
        ". Beginning in February 1946, the Red Army, along with the ": null
    },
    {
        "Soviet Navy": "Soviet Navy"
    },
    {
        ", embodied the main component of the ": null
    },
    {
        "Soviet Armed Forces": "Soviet Armed Forces"
    },
    {
        "; taking the official name of ": null
    },
    {
        "Soviet Army": "Soviet Army"
    },
    {
        " , until its dissolution in December 1991. The former official name Red Army continued to be used as a nickname by both sides throughout the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        ".     The Red Army provided the largest ": null
    },
    {
        "land force": "Land Warfare"
    },
    {
        " in the Allied victory in the ": null
    },
    {
        "European theatre of World War II": "European Theatre Of World War Ii"
    },
    {
        ", and its ": null
    },
    {
        "invasion of Manchuria": "Soviet Invasion Of Manchuria"
    },
    {
        " assisted the unconditional surrender of ": null
    },
    {
        "Imperial Japan": "Empire Of Japan"
    },
    {
        ". During operations on the ": null
    },
    {
        "Eastern Front": "Eastern Front"
    },
    {
        ", it accounted for 75–80% of casualties the ": null
    },
    {
        "Wehrmacht": "Wehrmacht"
    },
    {
        " and ": null
    },
    {
        "Waffen-SS": "Waffen-Ss"
    },
    {
        " suffered during the war and ultimately captured the ": null
    },
    {
        "Nazi German": "Nazi Germany"
    },
    {
        " capital, ": null
    },
    {
        "Berlin": "Berlin"
    },
    {
        ". .          In September 1917, ": null
    },
    {
        "Vladimir Lenin": "Vladimir Lenin"
    },
    {
        " wrote: There is only one way to prevent the restoration of the police, and that is to create a peoples militia and to fuse it with the army . . At the time, the ": null
    },
    {
        "Imperial Russian Army": "Imperial Russian Army"
    },
    {
        " had started to collapse. Approximately 23% of the male population of the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        " were mobilized; however, most of them were not equipped with any weapons and had support roles such as maintaining the ": null
    },
    {
        "lines of communication": "Line Of Communication"
    },
    {
        " and the base areas. The Tsarist general ": null
    },
    {
        "Nikolay Dukhonin": "Nikolay Dukhonin"
    },
    {
        " estimated that there had been 2 million deserters, 1.8  million dead, 5  million wounded and 2  million prisoners. He estimated the remaining troops as numbering 10  million. .          While the Imperial Russian Army was being taken apart, it became apparent that the rag-tag Red Guard units and elements of the imperial army who had gone over the side of the Bolsheviks were quite inadequate to the task of defending the new government against external foes. Therefore, the ": null
    },
    {
        "Council of Peoples Commissars": "Council Of Peoples Commissars"
    },
    {
        " decided to form the Red Army on 28 January 1918. They envisioned a body formed from the class-conscious and best elements of the working classes. All citizens of the Russian republic aged 18 or older were eligible. Its role being the defense of the Soviet authority, the creation of a basis for the transformation of the standing army into a force deriving its strength from a nation in arms, and, furthermore, the creation of a basis for the support of the coming Socialist Revolution in Europe. Enlistment was conditional upon guarantees being given by a military or civil committee functioning within the territory of the Soviet Power, or by party or trade union committees or, in extreme cases, by two persons belonging to one of the above organizations. In the event of an entire unit wanting to join the Red Army, a collective guarantee and the affirmative vote of all its members would be necessary. . . Because the Red Army was composed mainly of peasants, the families of those who served were guaranteed rations and assistance with farm work.  Some peasants who remained at home yearned to join the Army; men, along with some women, flooded the recruitment centres. If they were turned away they would collect scrap metal and prepare care-packages. In some cases the money they earned would go towards tanks for the Army. .     The Council of Peoples Commissars appointed itself the supreme head of the Red Army, delegating command and administration of the army to the Commissariat for Military Affairs and the Special All-Russian College within this commissariat. ": null
    },
    {
        "Nikolai Krylenko": "Nikolai Krylenko"
    },
    {
        " was the supreme commander-in-chief, with ": null
    },
    {
        "Aleksandr Myasnikyan": "Aleksandr Myasnikyan"
    },
    {
        " as deputy. . ": null
    },
    {
        "Nikolai Podvoisky": "Nikolai Podvoisky"
    },
    {
        " became the ": null
    },
    {
        "commissar": "Commissar"
    },
    {
        " for war, ": null
    },
    {
        "Pavel Dybenko": "Pavel Dybenko"
    },
    {
        ", commissar for the fleet. Proshyan, Samoisky, Steinberg were also specified as peoples commissars as well as ": null
    },
    {
        "Vladimir Bonch-Bruyevich": "Vladimir Bonch-Bruyevich"
    },
    {
        " from the Bureau of Commissars. At a joint meeting of ": null
    },
    {
        "Bolsheviks": "Bolsheviks"
    },
    {
        " and ": null
    },
    {
        "Left Socialist-Revolutionaries": "Left Socialist-Revolutionaries"
    },
    {
        ", held on 22 February 1918, Krylenko remarked: We have no army. The demoralized soldiers are fleeing, panic-stricken, as soon as they see a ": null
    },
    {
        "German helmet": "Stahlhelm"
    },
    {
        " appear on the horizon, abandoning their artillery, convoys and all war material to the ": null
    },
    {
        "triumphantly advancing": "Operation Faustschlag"
    },
    {
        " enemy. The Red Guard units are brushed aside like flies. We have no power to stay the enemy; only an immediate signing of the peace treaty will save us from destruction.                   The Russian Civil War occurred in three periods:   October 1917 – November 1918: From the Bolshevik Revolution to the ": null
    },
    {
        "First World War": "World War I"
    },
    {
        " Armistice": "Armistice"
    },
    {
        ", developed from the Bolshevik governments ": null
    },
    {
        "nationalization": "Nationalization"
    },
    {
        " of traditional ": null
    },
    {
        "Cossack": "Cossack"
    },
    {
        " lands in November 1917. This provoked the insurrection of General ": null
    },
    {
        "Alexey Maximovich Kaledins": "Alexey Kaledin"
    },
    {
        " Volunteer Army": "Volunteer Army"
    },
    {
        " in the ": null
    },
    {
        "River Don": "Don River, Russia"
    },
    {
        " region. The ": null
    },
    {
        "Treaty of Brest-Litovsk": "Treaty Of Brest-Litovsk"
    },
    {
        " aggravated Russian internal politics. The overall situation encouraged direct ": null
    },
    {
        "Allied intervention in the Russian Civil War": "Allied Intervention In The Russian Civil War"
    },
    {
        ", in which twelve foreign countries supported anti-Bolshevik militias. A series of engagements resulted, involving, amongst others, the ": null
    },
    {
        "Czechoslovak Legion": "Czechoslovak Legion"
    },
    {
        ", the ": null
    },
    {
        "Polish 5th Rifle Division": "Polish 5Th Rifle Division"
    },
    {
        ", and the pro-Bolshevik Red ": null
    },
    {
        "Latvian Riflemen": "Latvian Riflemen"
    },
    {
        ".   January 1919 – November 1919: Initially the White armies advanced successfully: from the south, under General ": null
    },
    {
        "Anton Denikin": "Anton Denikin"
    },
    {
        "; from the east, under Admiral ": null
    },
    {
        "Aleksandr Vasilevich Kolchak": "Aleksandr Vasilevich Kolchak"
    },
    {
        "; and from the northwest, under General ": null
    },
    {
        "Nikolai Nikolaevich Yudenich": "Nikolai Nikolaevich Yudenich"
    },
    {
        ". The Whites defeated the Red Army on each front. ": null
    },
    {
        "Leon Trotsky": "Leon Trotsky"
    },
    {
        " reformed and counterattacked: the Red Army repelled Admiral Kolchaks army in June, and the armies of General Denikin and General Yudenich in October. . By mid-November the White armies were all almost completely exhausted. In January 1920 ": null
    },
    {
        "Budennys": "Semyon Budyonny"
    },
    {
        "First Cavalry Army entered ": null
    },
    {
        "Rostov-on-Don": "Rostov-On-Don"
    },
    {
        ".   1919 to 1923: Some peripheral battles continued for two more years, and remnants of the White forces continued in the Far East into 1923.     At the start of the civil war, the Red Army consisted of 299 infantry regiments. . The civil war intensified after Lenin dissolved the ": null
    },
    {
        "Russian Constituent Assembly": "Russian Constituent Assembly"
    },
    {
        " and the Soviet government signed the ": null
    },
    {
        "Treaty of Brest-Litovsk": "Treaty Of Brest-Litovsk"
    },
    {
        " , removing Russia from the ": null
    },
    {
        "Great War": "First World War"
    },
    {
        ". Free from international war, the Red Army confronted an internecine war against a variety of opposing anti-Communist forces, including the ": null
    },
    {
        "Revolutionary Insurrectionary Army of Ukraine": "Revolutionary Insurrectionary Army Of Ukraine"
    },
    {
        ", the ": null
    },
    {
        " Black Army ": "Black Guards"
    },
    {
        " led by ": null
    },
    {
        "Nestor Makhno": "Nestor Makhno"
    },
    {
        ", the anti-White and anti-Red ": null
    },
    {
        "Green armies": "Green Armies"
    },
    {
        ", efforts to restore the defeated Provisional Government, monarchists, but mainly the ": null
    },
    {
        "White Movement": "White Movement"
    },
    {
        " of several different anti-socialist military confederations. Red Army Day , 23 February 1918, has a two-fold historical significance: it was the first day of drafting recruits , and the first day of combat against the occupying ": null
    },
    {
        "Imperial German": "German Empire"
    },
    {
        " Army.  cited in .           On 6 September 1918 the Bolshevik militias consolidated under the supreme command of the ": null
    },
    {
        "Revolutionary Military Council": "Revolutionary Military Council"
    },
    {
        " of the Republic . The first chairman was ": null
    },
    {
        "Leon Trotsky": "Leon Trotsky"
    },
    {
        ", and the first commander-in-chief was ": null
    },
    {
        "Jukums Vācietis": "Jukums Vācietis"
    },
    {
        " from the ": null
    },
    {
        "Latvian Riflemen": "Latvian Riflemen"
    },
    {
        "; in July 1919 he was replaced by ": null
    },
    {
        "Sergey Kamenev": "Sergey Kamenev"
    },
    {
        ". Soon afterwards Trotsky established the ": null
    },
    {
        "GRU": "Glavnoye Razvedyvatelnoye Upravleniye"
    },
    {
        " to provide political and military intelligence to Red Army commanders. Trotsky founded the Red Army with an initial Red Guard organization and a core soldiery of Red Guard militiamen and ": null
    },
    {
        "Chekist": "Cheka"
    },
    {
        " secret police. ": null
    },
    {
        "Conscription": "Conscription In The Soviet Union"
    },
    {
        " began in June 1918,  and opposition to it was violently suppressed. To control the multi-ethnic and multi-cultural Red Army soldiery, the ": null
    },
    {
        "Cheka": "Cheka"
    },
    {
        " operated special punitive brigades which suppressed ": null
    },
    {
        "anti-communists": "Anti-Communism"
    },
    {
        ", deserters, and enemies of the state . .  Wartime pragmatism allowed the recruitment of ex-Tsarist officers and sergeants into the Red Army. Lev Glezarovs special commission recruited and screened them. By mid-August 1920 the Red Armys former Tsarist personnel included 48,000 officers, 10,300 administrators, and 214,000 NCOs. , cited in . At the civil wars start, ex-Tsarists made up 75% of the Red Army officer-corps, .  who were employed as military specialists . The Bolsheviks occasionally enforced the loyalty of such recruits by holding their families as hostages.  When the civil war ended in 1922, ex-Tsarists constituted 83% of the Red Armys divisional and corps commanders.          The Red Army used special regiments for ethnic minorities, such as the Dungan Cavalry Regiment commanded by the ": null
    },
    {
        "Dungan": "Dungan People"
    },
    {
        " Magaza Masanchi": "Magaza Masanchi"
    },
    {
        ".      The Red Army also co-operated with armed Bolshevik Party-oriented volunteer units, the Части особого назначения – ЧОН  from 1919 to 1925.      Compare ": null
    },
    {
        "spetsnaz": "Spetsnaz"
    },
    {
        ".       The slogan exhortation, organization, and reprisals expressed the discipline and motivation which helped ensure the Red Armys tactical and strategic success. On campaign, the attached Cheka Special Punitive Brigades conducted summary field ": null
    },
    {
        "courts-martial": "Courts-Martial"
    },
    {
        " and executions of deserters and slackers.  Under Commissar ": null
    },
    {
        "Yan Karlovich Berzin": "Yan Karlovich Berzin"
    },
    {
        " the Special Punitive Brigades took hostages from the villages of deserters to compel their surrender; one in ten of those returning was executed. The same tactic also suppressed peasant rebellions in areas controlled by the Red Army, the biggest of these being the ": null
    },
    {
        "Tambov Rebellion": "Tambov Rebellion"
    },
    {
        ". . The Soviets enforced the loyalty of the various political, ethnic, and national groups in the Red Army through ": null
    },
    {
        "political commissars": "Political Commissar"
    },
    {
        "attached at the ": null
    },
    {
        "brigade": "Brigade"
    },
    {
        " and regimental levels. The commissars also had the task of spying on commanders for ": null
    },
    {
        "political incorrectness": "Political Correctness"
    },
    {
        ". Political commissars whose Chekist detachments retreated or broke in the face of the enemy earned the death penalty. In August 1918, Trotsky authorized General ": null
    },
    {
        "Mikhail Tukhachevsky": "Mikhail Tukhachevsky"
    },
    {
        " to place ": null
    },
    {
        "blocking units": "Barrier Troops"
    },
    {
        " behind politically unreliable Red Army units, to shoot anyone who retreated without permission. . In 1942, during the ": null
    },
    {
        "Great Patriotic War": "Great Patriotic War"
    },
    {
        " Joseph Stalin": "Joseph Stalin"
    },
    {
        " reintroduced the blocking policy and ": null
    },
    {
        "penal battalions": "Penal Military Unit"
    },
    {
        " with ": null
    },
    {
        "Order 227": "Order No. 227"
    },
    {
        "     The Red Army controlled by the Russian Soviet Federative Socialist Republic invaded and annexed non-Russian lands helping to create the Soviet Union.   Richard Pipes, The Formation of the Soviet Union, Communism and Nationalism, 1917–1923         The ": null
    },
    {
        "Soviet westward offensive of 1918–19": "Soviet Westward Offensive Of 1918–19"
    },
    {
        " occurred at the same time as the general Soviet move into the areas abandoned by the Ober Ost garrisons. This merged into the 1919–1921 ": null
    },
    {
        "Polish–Soviet War": "Polish–Soviet War"
    },
    {
        ", in which the Red Army reached central Poland in 1920, but then suffered a ": null
    },
    {
        "defeat": "Battle Of Warsaw"
    },
    {
        " there, which put an end to the war. During the Polish Campaign the Red Army numbered some 6.5  million men, many of whom the Army had difficulty supporting, around 581,000 in the two operational fronts, western and southwestern. Around 2.5  million men and women were immobilized in the interior as part of reserve armies.       The XI Congress of the ": null
    },
    {
        "Russian Communist Party ": "Communist Party Of The Soviet Union"
    },
    {
        " adopted a resolution on the strengthening of the Red Army. It decided to establish strictly organized military, educational and economic conditions in the army. However, it was recognized that an army of 1,600,000 would be burdensome. By the end of 1922, after the Congress, the Party Central Committee decided to reduce the Red Army to 800,000. This reduction necessitated the reorganization of the Red Armys structure. The supreme military unit became corps of two or three divisions. Divisions consisted of three regiments. Brigades as independent units were abolished. The formation of departments ": null
    },
    {
        "rifle corps": "Rifle Corps"
    },
    {
        " began.         After four years of warfare, the Red Armys defeat of ": null
    },
    {
        "Pyotr Nikolayevich Wrangel": "Pyotr Nikolayevich Wrangel"
    },
    {
        " in the south in 1920   Compare:        allowed the foundation of the ": null
    },
    {
        "Union of Soviet Socialist Republics": "Soviet Union"
    },
    {
        " in December 1922. Historian ": null
    },
    {
        "John Erickson": "John Erickson"
    },
    {
        " sees 1 February 1924, when ": null
    },
    {
        "Mikhail Frunze": "Mikhail Frunze"
    },
    {
        " became head of the Red Army staff, as marking the ascent of the ": null
    },
    {
        "general staff": "General Staff Of The Armed Forces Of The Russian Federation"
    },
    {
        ", which came to dominate Soviet military planning and operations. By 1 October 1924 the Red Armys strength had diminished to 530,000. The ": null
    },
    {
        "list of Soviet Union divisions 1917–1945": "List Of Soviet Union Divisions 1917–1945"
    },
    {
        " details the formations of the Red Army in that time.     In the late 1920s and throughout the 1930s, Soviet military theoreticians – led by Marshal ": null
    },
    {
        "Mikhail Tukhachevsky": "Mikhail Tukhachevsky"
    },
    {
        " – developed the ": null
    },
    {
        "deep-operations": "Deep Operations"
    },
    {
        " doctrine, . a direct consequence of their experiences in the Polish-Soviet War and in the Russian Civil War. To achieve victory, deep operations envisage simultaneous ": null
    },
    {
        "corps": "Corps"
    },
    {
        "- and army-size unit maneuvers of simultaneous parallel attacks throughout the depth of the enemys ground forces, inducing catastrophic defensive failure. The deep-battle doctrine relies upon aviation and armor advances with the expectation that ": null
    },
    {
        "maneuver warfare": "Maneuver Warfare"
    },
    {
        " offers quick, efficient, and decisive victory. Marshal Tukhachevsky said that ": null
    },
    {
        "aerial warfare": "Aerial Warfare"
    },
    {
        " must be employed against targets beyond the range of ": null
    },
    {
        "infantry": "Infantry"
    },
    {
        ", ": null
    },
    {
        "artillery": "Artillery"
    },
    {
        ", and other arms. For maximum tactical effect aircraft should be employed ": null
    },
    {
        "en masse": "Wikt:En Masse"
    },
    {
        ", concentrated in time and space, against targets of the highest tactical importance.   Compare:               Red Army deep operations found their first formal expression in the 1929 Field Regulations, and became codified in the 1936 Provisional Field Regulations . The ": null
    },
    {
        "Great Purge": "Great Purge"
    },
    {
        " of 1937–1939 and the ": null
    },
    {
        "Purge of 1940–1942": "Purge Of The Red Army In 1941"
    },
    {
        " removed many leading officers from the Red Army, including Tukhachevsky himself and many of his followers, and the doctrine was abandoned. Thus at the ": null
    },
    {
        "Battle of Lake Khasan": "Battle Of Lake Khasan"
    },
    {
        " in 1938 and in the ": null
    },
    {
        "Battle of Khalkhin Gol": "Battle Of Khalkhin Gol"
    },
    {
        " in 1939 , the doctrine was not used. Only in the Second World War did deep operations come into play.       The Red army was involved in armed conflicts in the ": null
    },
    {
        "Republic of China": "Republic Of China"
    },
    {
        " during the ": null
    },
    {
        "Sino-Soviet conflict ": "Sino-Soviet Conflict"
    },
    {
        ", the ": null
    },
    {
        "Soviet Invasion of Xinjiang": "Soviet Invasion Of Xinjiang"
    },
    {
        " , when it was assisted by White Russian forces, and the ": null
    },
    {
        "Xinjiang rebellion ": "Xinjiang War"
    },
    {
        ". The Red Army achieved its objectives; it maintained effective control over the Manchurian ": null
    },
    {
        "Chinese Eastern Railway": "Chinese Eastern Railway"
    },
    {
        ", and successfully installed a pro-Soviet regime in ": null
    },
    {
        "Xinjiang": "Xinjiang"
    },
    {
        ". .               The Winter War  was a war between the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " and ": null
    },
    {
        "Finland": "Finland"
    },
    {
        ". It began with a Soviet offensive on 30 November 1939—three months after the start of World War II and the ": null
    },
    {
        "Soviet invasion of Poland": "Soviet Invasion Of Poland"
    },
    {
        ", and ended on 13 March 1940 with the ": null
    },
    {
        "Moscow Peace Treaty": "Moscow Peace Treaty"
    },
    {
        ". The ": null
    },
    {
        "League of Nations": "League Of Nations"
    },
    {
        " deemed the attack illegal and expelled the Soviet Union on 14 December 1939.      The Soviet forces led by ": null
    },
    {
        "Semyon Timoshenko": "Semyon Timoshenko"
    },
    {
        " had three times as many soldiers as the Finns, thirty times as many aircraft, and a hundred times as many ": null
    },
    {
        "tank": "Tank"
    },
    {
        "s. The Red Army, however, had been hindered by Soviet leader ": null
    },
    {
        "Joseph Stalins": "Joseph Stalin"
    },
    {
        " Great Purge": "Great Purge"
    },
    {
        " of 1937, reducing the armys morale and efficiency shortly before the outbreak of the fighting. ": null
    },
    {
        "Bullock ": "Bullock1993"
    },
    {
        ". p. 489. With over 30,000 of its army officers executed or imprisoned, most of whom were from the highest ranks, the Red Army in 1939 had many inexperienced senior officers. ": null
    },
    {
        "Glanz ": "Glanz1998"
    },
    {
        ". p. 58. ": null
    },
    {
        "Ries ": "Ries1988"
    },
    {
        "  Because of these factors, and high commitment and morale in the Finnish forces, Finland was able to resist the Soviet invasion for much longer than the Soviets expected. Finnish forces inflicted stunning losses on the Red Army for the first three months of the war while suffering very few losses themselves.      Hostilities ceased in March 1940 with the signing of the Moscow Peace Treaty. Finland ceded 11% of its pre-war territory and 30% of its economic assets to the Soviet Union. .  Soviet losses on the front were heavy, and the countrys international reputation suffered.  The Soviet forces did not accomplish their objective of the total conquest of Finland but conquered significant territory along ": null
    },
    {
        "Lake Ladoga": "Lake Ladoga"
    },
    {
        ", ": null
    },
    {
        "Petsamo": "Pechengsky District"
    },
    {
        " and ": null
    },
    {
        "Salla": "Salla"
    },
    {
        ". The Finns retained their ": null
    },
    {
        "sovereignty": "Sovereignty"
    },
    {
        " and improved their international reputation, which bolstered their morale in the ": null
    },
    {
        "Continuation War": "Continuation War"
    },
    {
        ".                  In accordance with the Soviet-Nazi ": null
    },
    {
        "Molotov–Ribbentrop Pact": "Molotov–Ribbentrop Pact"
    },
    {
        " of 23 August 1939, the ": null
    },
    {
        "Red Army invaded Poland": "Soviet Invasion Of Poland"
    },
    {
        " on 17 September 1939, after the ": null
    },
    {
        "Nazi invasion": "Invasion Of Poland"
    },
    {
        " on 1 September 1939. On 30 November the Red Army also attacked Finland, in the ": null
    },
    {
        "Winter War": "Winter War"
    },
    {
        " of 1939–1940. By autumn 1940, after conquering its portion of Poland, the ": null
    },
    {
        "Third Reich": "Third Reich"
    },
    {
        " shared an extensive border with USSR, with whom it remained neutrally bound by their ": null
    },
    {
        "non-aggression pact": "Non-Aggression Pact"
    },
    {
        " and ": null
    },
    {
        "trade agreement": "Trade Agreement"
    },
    {
        "s. Another consequence of the Molotov-Ribbentrop Pact was the ": null
    },
    {
        "Soviet occupation of Bessarabia and Northern Bukovina": "Soviet Occupation Of Bessarabia And Northern Bukovina"
    },
    {
        ", carried out by the ": null
    },
    {
        "Southern Front": "Southern Front"
    },
    {
        " in June–July 1940 and ": null
    },
    {
        "Soviet occupation of the Baltic states ": "Soviet Occupation Of The Baltic States"
    },
    {
        ". These conquests also added to the border the Soviet Union shared with Nazi-controlled areas. For ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        ", the circumstance was no dilemma, because , cited in . the  Drang nach Osten  policy secretly remained in force, culminating on 18 December 1940 with Directive No. 21, Operation Barbarossa , approved on 3 February 1941, and scheduled for mid-May 1941.     When Germany invaded the Soviet Union in June 1941, in Operation Barbarossa, the Red Armys ground forces had 303 divisions and 22 separate brigades including 166 divisions and brigades garrisoned in the western military districts.   The Axis forces deployed on the ": null
    },
    {
        "Eastern Front": "Eastern Front"
    },
    {
        " consisted of 181 divisions and 18 brigades . Three Fronts, the ": null
    },
    {
        "Northwestern": "Northwestern Front"
    },
    {
        ", ": null
    },
    {
        "Western": "Western Front"
    },
    {
        ", and ": null
    },
    {
        "Southwestern": "Southwestern Front"
    },
    {
        " conducted the defense of the western borders of the USSR. In the first weeks of the Great Patriotic War the Wehrmacht defeated many Red Army units. The Red Army lost millions of men as prisoners and lost much of its pre-war matériel. ": null
    },
    {
        "Stalin": "Joseph Stalin"
    },
    {
        " increased mobilization, and by 1 August 1941, despite 46 divisions lost in combat, the Red Armys strength was 401 divisions.     The Soviet forces were apparently unprepared despite numerous warnings from a variety of sources.  They suffered much damage in the field because of mediocre officers, partial mobilization, and an incomplete reorganization.  The hasty pre-war forces expansion and the over-promotion of inexperienced officers  favored the Wehrmacht in combat. The Axiss numeric superiority rendered the combatants divisional strength approximately equal. A generation of Soviet commanders  learned from the defeats, and Soviet victories in the ": null
    },
    {
        "Battle of Moscow": "Battle Of Moscow"
    },
    {
        ", at ": null
    },
    {
        "Stalingrad": "Battle Of Stalingrad"
    },
    {
        ", ": null
    },
    {
        "Kursk": "Battle Of Kursk"
    },
    {
        " and later in ": null
    },
    {
        "Operation Bagration": "Operation Bagration"
    },
    {
        " proved decisive.      In 1941, the Soviet government raised the bloodied Red Armys esprit de corps with propaganda stressing the defense of Motherland and nation, employing historic exemplars of Russian courage and bravery against foreign aggressors. The anti-Nazi  Great Patriotic War  was conflated with the ": null
    },
    {
        "Patriotic War of 1812": "Patriotic War Of 1812"
    },
    {
        " against ": null
    },
    {
        "Napoleon": "Napoleon I Of France"
    },
    {
        ", and historical Russian military heroes, such as ": null
    },
    {
        "Alexander Nevski": "Alexander Nevski"
    },
    {
        " and ": null
    },
    {
        "Mikhail Kutuzov": "Mikhail Kutuzov"
    },
    {
        ", appeared. Repression of the ": null
    },
    {
        "Russian Orthodox Church": "Russian Orthodox Church"
    },
    {
        " temporarily ceased, and priests revived the tradition of blessing arms before battle.     To encourage the initiative of Red Army commanders, the CPSU temporarily abolished ": null
    },
    {
        "political commissar": "Political Commissar"
    },
    {
        "s, reintroduced formal military ranks and decorations, and introduced the ": null
    },
    {
        "Guards unit": "Guards Unit"
    },
    {
        " concept. Exceptionally heroic or high-performing units earned the Guards title , an elite designation denoting superior training, materiel, and pay. Punishment also was used; slackers, malingerers, those avoiding combat with self-inflicted wounds cowards, thieves, and deserters were disciplined with beatings, demotions, undesirable/dangerous duties, and summary execution by ": null
    },
    {
        "NKVD": "Nkvd"
    },
    {
        " punitive detachments.        At the same time, the osobist became a key Red Army figure with the power to condemn to death and to spare the life of any soldier and officer of the unit to which he was attached. In 1942, Stalin established the ": null
    },
    {
        "penal battalions": "Penal Military Unit"
    },
    {
        " composed of  gulag  inmates, Soviet PoWs, disgraced soldiers, and deserters, for hazardous front-line duty as tramplers clearing Nazi minefields, et cetera.   Given the dangers, the maximum sentence was three months. Likewise, the Soviet treatment of Red Army personnel captured by the Wehrmacht was especially harsh. Per a ": null
    },
    {
        "1941 Stalin directive": "Order No. 270"
    },
    {
        ", Red Army officers and soldiers were to fight to the last rather than surrender; Stalin stated: There are no Soviet prisoners of war, only traitors. . During and after World War II ": null
    },
    {
        "freed POWs": "Soviet Repressions Against Former Prisoners Of War"
    },
    {
        " went to special ": null
    },
    {
        "filtration camps": "Nkvd Filtration Camp"
    },
    {
        " . Of these, by 1944, more than 90% were cleared, and about 8% were arrested or condemned to serve in ": null
    },
    {
        "penal battalions": "Penal Military Unitsoviet Union"
    },
    {
        ". In 1944, they were sent directly to reserve military formations to be cleared by the ": null
    },
    {
        "NKVD": "Nkvd"
    },
    {
        ". Further, in 1945, about 100 filtration camps were set for repatriated POWs, and other ": null
    },
    {
        "displaced persons": "Displaced Persons Camp"
    },
    {
        ", which processed more than 4,000,000 people. By 1946, 80% civilians and 20% of POWs were freed, 5% of civilians, and 43% of POWs were re-drafted, 10% of civilians and 22% of POWs were sent to labor battalions, and 2% of civilians and 15% of the POWs were transferred to the ": null
    },
    {
        "Gulag": "Gulag"
    },
    {
        ". The Lesser Terror: Soviet State Security, 1939–1953             During the Great Patriotic War, the Red Army ": null
    },
    {
        "conscripted": "Conscription"
    },
    {
        " 29,574,900 men in addition to the 4,826,907 in service at the beginning of the war. Of this total of 34,401,807 it lost 6,329,600 ": null
    },
    {
        "killed in action": "Killed In Action"
    },
    {
        " , 555,400 deaths by disease and 4,559,000 ": null
    },
    {
        "missing in action": "Missing In Action"
    },
    {
        " . Of these 11,444,000, however, 939,700 rejoined the ranks in the subsequently liberated Soviet territory, and a further 1,836,000 returned from German captivity. Thus the grand total of losses amounted to 8,668,400. .  This is the ": null
    },
    {
        "official total dead": "World War Ii Casualties Of The Soviet Union"
    },
    {
        ", but other estimates give the number of total dead up to almost 11 million men, including 7.7  million killed or missing in action and 2.6  million POW dead , plus 400,000 paramilitary and Soviet partisan losses. . The majority of the losses, excluding ": null
    },
    {
        "POW": "Pow"
    },
    {
        "s, were ethnic ": null
    },
    {
        "Russians": "Russians"
    },
    {
        " , followed by ethnic ": null
    },
    {
        "Ukrainians": "Ukrainians"
    },
    {
        " . However, as many as 8 million of the 34  million mobilized were non-Slavic minority soldiers, and around 45 divisions formed from national minorities served from 1941 to 1943.        The German losses on the Eastern Front consisted of an estimated 3,604,800 KIA/MIA within the 1937 borders plus 900,000 ethnic Germans and Austrians outside the 1937 border  and 3,576,300 men reported captured ; the losses of the German satellites on the Eastern Front approximated 668,163 KIA/MIA and 799,982 captured . Of these 9,549,245, the Soviets released 3,572,600 from captivity after the war, thus the grand total of the Axis losses came to an estimated 5,976,645. Regarding ": null
    },
    {
        "prisoners of war": "Prisoners Of War"
    },
    {
        ", both sides captured large numbers and had many die in captivity – one recent British . figure says 3.6 of 6 million Soviet POWs died in German camps, while 300,000 of 3  million German POWs died in Soviet hands. .       In 1941 the rapid progress of the initial German air and land attacks into the Soviet Union made Red Army logistical support difficult, because many depots, and most of the USSRs industrial manufacturing base, lay in the countrys invaded western areas, obliging their re-establishment east of the Ural Mountains. Until then the Red Army was often required to improvise or go without weapons, vehicles, and other equipment. The 1941 decision to physically move their manufacturing capacity east of the Ural mountains kept the main Soviet support system out of German reach.  In the later stages of the war, the Red Army fielded some excellent weaponry, especially artillery and tanks. The Red Armys heavy ": null
    },
    {
        "KV-1": "Kv-1"
    },
    {
        " and medium ": null
    },
    {
        "T-34": "T-34"
    },
    {
        " tanks outclassed most Wehrmacht armor,  but in 1941 most Soviet tank units used older and inferior models.        Military administration after the October Revolution was taken over by the Peoples Commissariat of war and marine affairs headed by a collective committee of ": null
    },
    {
        "Vladimir Antonov-Ovseyenko": "Vladimir Antonov-Ovseyenko"
    },
    {
        ", ": null
    },
    {
        "Pavel Dybenko": "Pavel Dybenko"
    },
    {
        ", and ": null
    },
    {
        "Nikolai Krylenko": "Nikolai Krylenko"
    },
    {
        ". At the same time, ": null
    },
    {
        "Nikolay Dukhonin": "Nikolay Dukhonin"
    },
    {
        " was acting as the Supreme Commander-in-Chief after ": null
    },
    {
        "Alexander Kerensky": "Alexander Kerensky"
    },
    {
        " fled from Russia. On 12 November 1917 the Soviet government appointed Krylenko as the Supreme Commander-in-Chief, and because of an accident during the forceful displacement of the commander-in-chief, Dukhonin was killed on 20 November 1917. ": null
    },
    {
        "Nikolai Podvoisky": "Nikolai Podvoisky"
    },
    {
        " was appointed as the Narkom of War Affairs, leaving Dybenko in charge of the Narkom of Marine Affairs and Ovseyenko – the expeditionary forces to the Southern Russia on 28 November 1917. The Bolsheviks also sent out their own representatives to replace front commanders of the ": null
    },
    {
        "Russian Imperial Army": "Russian Imperial Army"
    },
    {
        ".     After the signing of ": null
    },
    {
        "Treaty of Brest-Litovsk": "Treaty Of Brest-Litovsk"
    },
    {
        " on 3 March 1918, a major reshuffling took place in the Soviet military administration. On 13 March 1918 the Soviet government accepted the official resignation of Krylenko and the post of Supreme Commander-in-Chief was liquidated. On 14 March 1918 ": null
    },
    {
        "Leon Trotsky": "Leon Trotsky"
    },
    {
        " replaced Podvoisky as the Narkom of War Affairs. On 16 March 1918 Pavel Dybenko was relieved from the office of Narkom of Marine Affairs. On 8 May 1918 the All-Russian Chief Headquarters was created, headed by ": null
    },
    {
        "Nikolai Stogov": "Nikolai Stogov"
    },
    {
        " and later ": null
    },
    {
        "Alexander Svechin": "Alexander Andreyevich Svechin"
    },
    {
        ".     On 2 September 1918 the ": null
    },
    {
        "Revolutionary Military Council": "Revolutionary Military Council"
    },
    {
        " was established as the main military administration under Leon Trotsky, the Narkom of War Affairs. On 6 September 1918 alongside the chief headquarters the Field Headquarters of RMC was created, initially headed by ": null
    },
    {
        "Nikolai Rattel": "Nikolai Rattel"
    },
    {
        ". On the same day the office of the Commander-in-Chief of the Armed Forces was created, and initially assigned to ": null
    },
    {
        "Jukums Vācietis": "Jukums Vācietis"
    },
    {
        " . The Commander-in-Chief of the Armed Forces existed until April 1924, the end of ": null
    },
    {
        "Russian Civil War": "Russian Civil War"
    },
    {
        ".     In November 1923, after the establishment of the Soviet Union, the Russian Narkom of War Affairs was transformed into the Soviet Narkom of War and Marine Affairs.               At the beginning of its existence, the Red Army functioned as a voluntary formation, without ranks or insignia. Democratic elections selected the officers. However, a decree of 29 May 1918 imposed obligatory military service for men of ages 18 to 40. To service the massive draft, the Bolsheviks formed regional military commissariats , which as of 2006 still exist in Russia in this function and under this name. Military commissariats, however, should not be confused with the institution of military ": null
    },
    {
        "political commissar": "Political Commissar"
    },
    {
        "s.     In the mid-1920s the territorial principle of manning the Red Army was introduced. In each region able-bodied men were called up for a limited period of active duty in territorial units, which constituted about half the armys strength, each year, for five years. The first call-up period was for three months, with one month a year thereafter. A regular cadre provided a stable nucleus. By 1925 this system provided 46 of the 77 infantry divisions and one of the eleven cavalry divisions. The remainder consisted of regular officers and enlisted personnel serving two-year terms. The territorial system was finally abolished, with all remaining formations converted to the other cadre divisions, in 1937–1938.       The Soviet military received ample funding and was innovative in its technology. An American journalist wrote in 1941:              Under Stalins campaign for mechanization, the army formed its first mechanized unit in 1930. The 1st Mechanized Brigade consisted of a tank regiment, a motorized infantry regiment, as well as reconnaissance and artillery battalions. , cited at . From this humble beginning, the Soviets would go on to create the first operational-level armored formations in history, the ": null
    },
    {
        "11th": "11Th Mechanized Corps"
    },
    {
        " and ": null
    },
    {
        "45th Mechanized Corps": "45Th Mechanized Corps"
    },
    {
        ", in 1932. These were tank-heavy formations with combat support forces included so they could survive while operating in enemy rear areas without support from a parent ": null
    },
    {
        "front": "Front"
    },
    {
        ".     Impressed by the German campaign of 1940 against France, the Soviet ": null
    },
    {
        "Peoples Commissariat of Defence": "Peoples Commissariat Of Defence"
    },
    {
        " ordered the creation of nine mechanized corps on 6 July 1940. Between February and March 1941 the NKO ordered another twenty to be created. All of these formations were larger than those theorized by ": null
    },
    {
        "Tukhachevsky": "Mikhail Tukhachevsky"
    },
    {
        ". Even though the Red Armys 29 mechanized corps had an authorized strength of no less than 29,899 tanks by 1941, they proved to be a paper tiger. There were actually only 17,000 tanks available at the time, meaning several of the new mechanized corps were badly under strength. The pressure placed on factories and military planners to show production numbers also led to a situation where the majority of armored vehicles were obsolescent models, critically lacking in spare parts and support equipment, and nearly three-quarters were overdue for major maintenance. By 22 June 1941 there were only 1,475 of the modern T-34s and KV series tanks available to the Red Army, and these were too dispersed along the front to provide enough mass for even local success. To illustrate this, the ": null
    },
    {
        "3rd Mechanized Corps": "3Rd Mechanised Corps"
    },
    {
        " in Lithuania was formed up of a total of 460 tanks; 109 of these were newer KV-1s and T-34s. This corps would prove to be one of the lucky few with a substantial number of newer tanks. However, the ": null
    },
    {
        "4th Army": "4Th Army"
    },
    {
        " was composed of 520 tanks, all of which were the obsolete T-26, as opposed to the authorized strength of 1,031 newer medium tanks. This problem was universal throughout the Red Army, and would play a crucial role in the initial defeats of the Red Army in 1941 at the hands of the German armed forces.             War experience prompted changes to the way frontline forces were organised. After six months of combat against the Germans, the ": null
    },
    {
        "Stavka": "Stavka"
    },
    {
        " abolished the rifle corps which was intermediate between the ": null
    },
    {
        "army": "Army"
    },
    {
        " and ": null
    },
    {
        "division": "Division"
    },
    {
        " level because, while useful in theory, in the state of the Red Army in 1941, they proved ineffective in practice. Following the decisive victory in the ": null
    },
    {
        "Battle of Moscow": "Battle Of Moscow"
    },
    {
        " in January 1942, the high command began to reintroduce rifle corps into its more experienced formations. The total number of rifle corps started at 62 on 22 June 1941, dropped to six by 1 January 1942, but then increased to 34 by February 1943, and 161 by New Years Day 1944. Actual strengths of front-line rifle divisions, authorised to contain 11,000 men in July 1941, were mostly no more than 50% of establishment strengths during 1941, and divisions were often worn down, because of continuous operations, to hundreds of men or even less.     On the outbreak of war, the Red Army deployed mechanised corps and tank divisions whose development has been described above. The initial German attack destroyed many and, in the course of 1941, virtually all of them,. The remnants were disbanded. It was much easier to coordinate smaller forces, and separate tank brigades and battalions were substituted. It was late 1942 and early 1943 before larger ": null
    },
    {
        "tank formations of corps size": "Tank Corps"
    },
    {
        " were fielded to employ armour in mass again. By mid-1943, these corps were being grouped together into tank armies whose strength by the end of the war could be up to 700 tanks and 50,000 men.       The Bolshevik authorities assigned to every unit of the Red Army a ": null
    },
    {
        "political commissar": "Political Commissar"
    },
    {
        ", or politruk, who had the authority to override unit commanders decisions if they ran counter to the principles of the Communist Party. Although this sometimes resulted in inefficient command according to most historians, the Party leadership considered political control over the military absolutely necessary, as the army relied more and more on officers from the pre-revolutionary Imperial period and understandably feared a military coup. This system was abolished in 1925, as there were by that time enough trained Communist officers to render the counter-signing unnecessary.          The early Red Army abandoned the institution of a professional ": null
    },
    {
        "officer corps": "Officer"
    },
    {
        " as a heritage of tsarism in the course of the Revolution. In particular, the Bolsheviks condemned the use of the word officer and used the word commander instead. The Red Army abandoned ": null
    },
    {
        "epaulettes": "Epaulette"
    },
    {
        "and ": null
    },
    {
        "ranks": "Military Rank"
    },
    {
        ", using purely functional titles such as Division Commander , Corps Commander and similar titles. Insignia for these functional titles existed, consisting of triangles, squares and rhombuses .     In 1924 personal or service categories were introduced, from K1 to K14 . Service category insignia again consisted of triangles, squares and rhombuses, but also rectangles .     On 22 September 1935 the Red Army abandoned service categories and introduced personal ranks. These ranks, however, used a unique mix of functional titles and traditional ranks. For example, the ranks included Lieutenant and ": null
    },
    {
        "Comdiv": "Comdiv"
    },
    {
        " . Further complications ensued from the functional and categorical ranks for political officers , for technical corps , and for administrative, medical and other non-combatant branches.     The ": null
    },
    {
        "Marshal of the Soviet Union": "Marshal Of The Soviet Union"
    },
    {
        " rank was introduced on 22 September 1935. On 7 May 1940 further modifications to rationalise the system of ranks were made on the proposal by Marshal ": null
    },
    {
        "Voroshilov": "Kliment Voroshilov"
    },
    {
        ": the ranks of General and ": null
    },
    {
        "Admiral": "Admiral"
    },
    {
        " replaced the senior functional ranks of ": null
    },
    {
        "Combrig": "Combrig"
    },
    {
        ", ": null
    },
    {
        "Comdiv": "Comdiv"
    },
    {
        ", ": null
    },
    {
        "Comcor": "Comcor"
    },
    {
        ", ": null
    },
    {
        "Comandarm": "Comandarm"
    },
    {
        " in the Red Army and ": null
    },
    {
        "Flagman": "Flagman"
    },
    {
        " 1st rank etc. in the ": null
    },
    {
        "Red Navy": "Red Navy"
    },
    {
        "; the other senior functional ranks remained unaffected. The arm or service distinctions remained . For the most part the new system restored that used by the ": null
    },
    {
        "Imperial Russian Army": "Imperial Russian Army"
    },
    {
        " at the conclusion of its participation in World War I.     In early 1943 a unification of the system saw the abolition of all the remaining functional ranks. The word officer became officially endorsed, together with the use of ": null
    },
    {
        "epaulette": "Epaulette"
    },
    {
        "s, which superseded the previous rank insignia. The ranks and insignia of 1943 did not change much until the last days of the USSR; the contemporary ": null
    },
    {
        "Russian Army": "Russian Ground Forces"
    },
    {
        " uses largely the same system.               During the ": null
    },
    {
        "Civil War": "Russian Civil War"
    },
    {
        " the commander cadres were trained at the ": null
    },
    {
        "Nicholas General Staff Academy": "Nicholas General Staff Academy"
    },
    {
        " of the Russian Empire, which became the ": null
    },
    {
        "Frunze Military Academy": "Frunze Military Academy"
    },
    {
        " in the 1920s. Senior and supreme commanders were trained at the Higher Military Academic Courses, renamed the Advanced Courses for Supreme Command in 1925. The 1931 establishment of an Operations Faculty at the Frunze Military Academy supplemented these courses. The ": null
    },
    {
        "General staff Academy": "General Staff Academy"
    },
    {
        " was reinstated on 2 April 1936, and became the principal military school for the senior and supreme commanders of the Red Army. .               The late 1930s saw purges of the Red Army leadership which occurred concurrently with Stalins ": null
    },
    {
        "Great Purge": "Great Purge"
    },
    {
        " of Soviet society. In 1936 and 1937, at the orders of Stalin, thousands of Red Army senior officers were dismissed from their commands. The purges had the objective of cleansing the Red Army of the politically unreliable elements, mainly among higher-ranking officers. This inevitably provided a convenient pretext for the settling of personal vendettas or to eliminate competition by officers seeking the same command. Many army, corps, and divisional commanders were sacked: most were imprisoned or sent to labor camps; others were executed. Among the victims was the Red Armys primary military theorist, Marshal ": null
    },
    {
        "Mikhail Tukhachevsky": "Mikhail Tukhachevsky"
    },
    {
        ", who was perceived by Stalin as a potential political rival.  Officers who remained soon found all of their decisions being closely examined by political officers, even in mundane matters such as record-keeping and field training exercises. An atmosphere of fear and unwillingness to take the initiative soon pervaded the Red Army; suicide rates among junior officers rose to record levels. The purges significantly impaired the combat capabilities of the Red Army. Hoyt concludes the Soviet defense system was damaged to the point of incompetence and stresses the fear in which high officers lived. Edwin P. Hoyt. 199 Days: The Battle for Stalingrad p 20 Clark says, Stalin not only cut the heart out of the army, he also gave it brain damage.  Lewin identifies three serious results: the loss of experienced and well-trained senior officers; the distrust it caused among potential allies especially France; and the encouragement it gave Germany.          Recently declassified data indicate that in 1937, at the height of the Purges, the Red Army had 114,300 officers, of whom 11,034 were dismissed. In 1938, the Red Army had 179,000 officers, 56% more than in 1937, of whom a further 6,742 were dismissed. In the highest echelons of the Red Army the Purges removed 3 of 5 marshals, 13 of 15 army generals, 8 of 9 admirals, 50 of 57 army corps generals, 154 out of 186 division generals, all 16 army commissars, and 25 of 28 army corps commissars. .     The result was that the Red Army officer corps in 1941 had many inexperienced senior officers. While 60% of regimental commanders had two years or more of command experience in June 1941, and almost 80% of rifle division commanders, only 20% of corps commanders, and 5% or fewer army and military district commanders, had the same level of experience.        The significant growth of the Red Army during the high point of the purges may have worsened matters. In 1937, the Red Army numbered around 1.3  million, increasing to almost three times that number by June 1941. The rapid growth of the army necessitated in turn the rapid promotion of officers regardless of experience or training. Junior officers were appointed to fill the ranks of the senior leadership, many of whom lacked broad experience. This action in turn resulted in many openings at the lower level of the officer corps, which were filled by new graduates from the service academies. In 1937, the entire junior class of one academy was graduated a year early to fill vacancies in the Red Army. Hamstrung by inexperience and fear of reprisals, many of these new officers failed to impress the large numbers of incoming draftees to the ranks; complaints of insubordination rose to the top of offenses punished in 1941, and may have exacerbated instances of Red Army soldiers deserting their units during the initial phases of the German offensive of that year.     By 1940, Stalin began to relent, restoring approximately one-third of previously dismissed officers to duty. However, the effect of the purges would soon manifest itself in the ": null
    },
    {
        "Winter War": "Winter War"
    },
    {
        " of 1940, where Red Army forces generally performed poorly against the much smaller Finnish Army, and later during the ": null
    },
    {
        "German invasion": "Operation Barbarossa"
    },
    {
        " of 1941, in which the Germans were able to rout the Soviet defenders partially due to inexperience amongst the Soviet officers.          In Lithuania, Red Army personnel robbed local shops.  Following the fall of East Prussia, Soviet soldiers carried out large-scale rapes in Germany, especially noted in Berlin until the beginning of May 1945. . . They were often committed by rear echelon units.           The Soviet Union expanded its indigenous arms industry as part of ": null
    },
    {
        "Stalins industrialisation program": "History Of The Soviet Union Industrialization In Practice"
    },
    {
        " in the 1920s and 1930s.": null
    }
]