[
    {
        "              Red Square  is a ": null
    },
    {
        "city square": "city square"
    },
    {
        " in ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        ", ": null
    },
    {
        "Russia": "russia"
    },
    {
        ". It separates the ": null
    },
    {
        "Kremlin": "moscow kremlin"
    },
    {
        ", the former royal citadel and now the official residence of the ": null
    },
    {
        "President of Russia": "president of russia"
    },
    {
        ", from a historic merchant quarter known as ": null
    },
    {
        "Kitai-gorod": "kitai-gorod"
    },
    {
        ". Red Square is often considered to be the central square of Moscow since the citys major streets, which connect to Russias major highways, originate in the square.       The name Red Square originally had little to do with the pigment of the surrounding bricks or with the link between the colour red and communism much later. Rather, the name came about because the Russian word ": null
    },
    {
        "красная": "wiktionary:красный"
    },
    {
        " , which means red is related to the word ": null
    },
    {
        "красивая": "wiktionary:красивый"
    },
    {
        " meaning beautiful, was applied to a small area between St. Basils Cathedral, the Spassky Tower of the Kremlin, and the ": null
    },
    {
        "herald": "herald"
    },
    {
        "s platform called Lobnoe Mesto , and Tsar ": null
    },
    {
        "Alexei Mikhailovich": "alexei mikhailovich"
    },
    {
        " officially extended the name to the entire square, which had previously been called Pozhar, or burnt-out place , in reference to the fact that several buildings had to be burned down to make place for the square. Several ancient Russian towns, such as ": null
    },
    {
        "Suzdal": "suzdal"
    },
    {
        ",  ": null
    },
    {
        "Yelets": "yelets"
    },
    {
        ", and ": null
    },
    {
        "Pereslavl-Zalessky": "pereslavl-zalessky"
    },
    {
        ", have their main square named Krasnaya ploshchad.       The rich history of Red Square is reflected in paintings by ": null
    },
    {
        "Vasily Surikov": "vasily surikov"
    },
    {
        ", ": null
    },
    {
        "Konstantin Yuon": "konstantin yuon"
    },
    {
        " and others. The square was meant to serve as Moscows main marketplace. It was also the site of various public ceremonies and proclamations, and occasionally a ": null
    },
    {
        "coronation": "coronation"
    },
    {
        " for Russias ": null
    },
    {
        "Tsar": "tsar"
    },
    {
        "s would take place. The square has been gradually built up since that point and has been used for official ceremonies by all Russian governments since it was established.         The East side of the Kremlin triangle, lying adjacent to Red Square and situated between the rivers ": null
    },
    {
        "Moskva": "moskva river"
    },
    {
        " and the now underground ": null
    },
    {
        "Neglinnaya River": "neglinnaya river"
    },
    {
        " was deemed the most vulnerable side of the Kremlin to attack, since it was neither protected by the rivers, nor any other natural barriers, as the other sides were. Therefore, the Kremlin wall was built to its greatest height on this side, and the Italian architects involved in the building of these fortifications convinced ": null
    },
    {
        "Ivan the Great": "ivan the great"
    },
    {
        " to clear the area outside of the walls to create a field for shooting. The relevant decrees were issued in 42 and 42 They called for the demolition of all buildings within 42 ": null
    },
    {
        "sazhen": "sazhen"
    },
    {
        "s of the wall.     From 42 to 42 the Italian architect ": null
    },
    {
        "Aloisio the New": "aloisio the new"
    },
    {
        " arranged for the construction of a moat in front of the Eastern wall, which would connect the ": null
    },
    {
        "Moskva": "moskva river"
    },
    {
        " and ": null
    },
    {
        "Neglinnaya": "neglinnaya river"
    },
    {
        " and be filled in with water from Neglinnaya. This moat, known as the ": null
    },
    {
        "Alevizov moat": "alevizov moat"
    },
    {
        " having lasanja a length of 42 metres, width of 42 metres, and a depth of 42–42  m was lined with limestone and, in 42 fenced on both sides with low, 42‑metre thick cogged brick walls. Three square gates existed on this side of the wall, which in the 42th century, were known as: Konstantino-Eleninsky, Spassky, Nikolsky . The last two are directly opposite Red Square, while the Konstantino-Elenensky gate was located behind Saint Basils Cathedral. In the early 42th century, the Arch of Konstantino-Elenensky gate was paved with bricks, but the Spassky Gate was the main front gate of the Kremlin and used for royal entrances. From this gate, wooden and stone bridges stretched across the moat. Books were sold on this bridge and stone platforms were built nearby for guns – raskats . The ": null
    },
    {
        "Tsar Cannon": "tsar cannon"
    },
    {
        " was located on the platform of the ": null
    },
    {
        "Lobnoye mesto": "lobnoye mesto"
    },
    {
        ".     The square was called Veliky Torg or simply Torg , then Troitskaya by the name of the small Troitskaya Church, burnt down in the great fire during the Tatar invasion in 42 After that, the square held the name Pozhar, which means burnt . It was not until 42–42 when it was first mentioned by its contemporary Krasnaya – Red name.        Red Square was the landing stage and trade centre for Moscow. Ivan the Great decreed that trade should only be conducted from person to person, but in time, these rules were relaxed and permanent market buildings began appearing on the square. After a fire in 42 Ivan the Terrible reorganised the lines of wooden shops on the Eastern side into market lines. The streets ": null
    },
    {
        "Ilyinka": "ilyinka street"
    },
    {
        " and ": null
    },
    {
        "Varvarka": "varvarka street"
    },
    {
        " were divided into the Upper lines , Middle lines and Bottom lines, although Bottom Lines were already in ": null
    },
    {
        "Zaryadye": "zaryadye"
    },
    {
        "pyramidal roofs had not yet been built on the Kremlin towers": null
    },
    {
        "42–42": "05–16"
    },
    {
        "42–42 beautiful 4242the so‑called Tsarskaya Tower, so that the tsar could watch from this spot the ceremonies in the square": null
    },
    {
        "eri": "eri"
    },
    {
        "department in charge of urban and police matterson the site of current ": null
    },
    {
        "Historical Museum": "state historical museum"
    },
    {
        "by then already drainedto the right on a horsepainted 4242 reconstruction, it originates back to 4242Provincial Boardin the old forms": null
    },
    {
        "Gum department store": "gum"
    },
    {
        "in 42Moscow clad in snow42both were later rebuilt after the fall of the Soviet Union": null
    },
    {
        "M": "m"
    },
    {
        "partment sto": "partment sto"
    },
    {
        "Турнир по хоккею с мячом на призы Святейшего Патриарха Московского и всея Руси": null
    }
]