[
    {
        "        Reform Judaism  is a major ": null
    },
    {
        "Jewish denomination": "jewish religious movements"
    },
    {
        " that emphasizes the evolving nature of the faith, the superiority of its ": null
    },
    {
        "ethical aspects": "jewish ethics"
    },
    {
        " to the ceremonial ones, and belief in a continuous ": null
    },
    {
        "revelation": "revelation"
    },
    {
        ", closely intertwined with human reason and intellect, and not centered on the ": null
    },
    {
        "theophany at Mount Sinai": "theophanyon mount sinai"
    },
    {
        ". A ": null
    },
    {
        "liberal": "liberal religion"
    },
    {
        " strand of ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        ", it is characterized by a lessened stress on ritual and personal observance, regarding ": null
    },
    {
        "Jewish Law": "halakha"
    },
    {
        " as non-binding and the individual Jew as autonomous, and great openness to external influences and progressive values. The origins of Reform Judaism lie in ": null
    },
    {
        "19th-century Germany": "german confederation"
    },
    {
        ", where its early principles were formulated by ": null
    },
    {
        "Rabbi": "rabbi"
    },
    {
        " Abraham Geiger": "abraham geiger"
    },
    {
        " and his associates. Since the 1970s, the movement has adopted a policy of inclusiveness and acceptance, inviting as many as possible to partake in its communities, rather than strict theoretical clarity. It is strongly identified with ": null
    },
    {
        "progressive political and social agendas": "progressivism"
    },
    {
        ", mainly under the traditional Jewish rubric  Tikkun Olam , or Repairing of the World . Tikkun Olam is a central motto of Reform Judaism, and action for its sake is one of the main channels for adherents to express their affiliation. The movements greatest center today is in ": null
    },
    {
        "North America": "north america"
    },
    {
        ".     The various regional branches sharing these beliefs, including the American ": null
    },
    {
        "Union for Reform Judaism": "union for reform judaism"
    },
    {
        " , the ": null
    },
    {
        "Movement for Reform Judaism": "movement for reform judaism"
    },
    {
        " and ": null
    },
    {
        "Liberal Judaism": "liberal judaism"
    },
    {
        " in ": null
    },
    {
        "Britain": "united kingdom"
    },
    {
        ", and the ": null
    },
    {
        "Israel Movement for Reform and Progressive Judaism": "israel movement for reform and progressive judaism"
    },
    {
        ", are all united within the international ": null
    },
    {
        "World Union for Progressive Judaism": "world union for progressive judaism"
    },
    {
        ". Founded in 1926, the WUPJ estimates it represents at least 1.8 million people in 50 countries: close to a million registered adult congregants, as well as almost as many unaffiliated individuals who identify with the denomination. This makes it the second-largest Jewish denomination worldwide.       Its inherent pluralism and great importance placed on individual autonomy impede any simplistic definition of Reform Judaism; its various strands regard Judaism throughout the ages as derived from a process of constant evolution. They warrant and obligate further modification and reject any fixed, permanent set of beliefs, laws or practices. A clear description became particularly challenging since the turn toward a policy favouring inclusiveness over a coherent theology in the 1970s. This largely overlapped with what researchers termed as the transition from Classical to New Reform in America, paralleled in the other, smaller branches across the world.   The movement ceased stressing principles and core beliefs, focusing more on the personal spiritual experience and communal participation. This shift was not accompanied by a distinct new doctrine or by the abandonment of the former, but rather with ambiguity. The leadership allowed and encouraged a wide variety of positions, from selective adoption of  halakhic  observance to elements approaching ": null
    },
    {
        "religious humanism": "religious humanism"
    },
    {
        ".     The declining importance of the theoretical foundation, in favour of pluralism and equivocalness, did draw large crowds of newcomers. It also diversified Reform to a degree that made it hard to formulate a clear definition of it. Early and Classical Reform were characterized by a move away from traditional forms of Judaism combined with a coherent theology; New Reform sought, to a certain level, the reincorporation of many formerly discarded elements within the framework established during the Classical stage, though this very doctrinal basis became increasingly obfuscated. Critics, like Rabbi ": null
    },
    {
        "Dana Evan Kaplan": "dana evan kaplan"
    },
    {
        ", warned that Reform became more of a Jewish activities club, a means to demonstrate some affinity to ones heritage in which even rabbinical students do not have to believe in any specific theology or engage in any particular practice, rather than a defined belief system. Kaplan, Contemporary Debates, pp. 136–142; New Reform Judaism, pp. 6–8. Quote from: Kaplan, ,  Jewish Ideas Daily , 19 April 2013.           In regard to God, while some voices among the spiritual leadership approached ": null
    },
    {
        "religious": "religious humanism"
    },
    {
        " and even ": null
    },
    {
        "secular humanism": "secular humanism"
    },
    {
        " – a tendency that grew increasingly from the mid-20th century, both among clergy and constituents, leading to broader, dimmer definitions of the concept – the movement had always officially maintained a ": null
    },
    {
        "theistic": "theistic"
    },
    {
        " stance, affirming the belief in a ": null
    },
    {
        "personal God": "personal god"
    },
    {
        ". Kaplan, American Reform: an Introduction, p. 29; Challenges and Reflections, p. 36; Contemporary Debates, 136–142.;": null
    },
    {
        "Jonathan Romain": "jonathan romain"
    },
    {
        " Reform Judaism and Modernity: A Reader, SCM Press, 2004. p. 145.     Early Reform thinkers in Germany clung to this precept; Meyer, p. 96. the 1885 ": null
    },
    {
        "Pittsburgh Platform": "pittsburgh platform"
    },
    {
        " described the One God... The God-Idea as taught in our sacred Scripture as consecrating the Jewish people to be its priests. It was grounded on a wholly theistic understanding, although the term God-idea was excoriated by outside critics. So was the 1937 Columbus Declaration of Principles, which spoke of One, living God who rules the world . Challenges and Reflections, pp. 34–36. Even the 1976 San Francisco Centenary Perspective, drafted at a time of great discord among Reform theologians, upheld the affirmation of God... Challenges of modern culture have made steady belief difficult for some. Nevertheless, we ground our lives, personally and communally, on Gods reality. Kaplan, Contemporary American Judaism: Transformation and Renewal, pp. 131. The 1999 Pittsburgh Statement of Principles declared the reality and oneness of God . British ": null
    },
    {
        "Liberal Judaism": "liberal judaism"
    },
    {
        " affirms the Jewish conception of God: One and indivisible, transcendent and immanent, Creator and Sustainer .       The basic tenet of Reform theology is a belief in a continuous, or progressive, ": null
    },
    {
        "revelation": "revelation"
    },
    {
        ", Dana Evan Kaplan, Contemporary Debates in American Reform Judaism, Routledge, 2013. p. 239.; Challenges and Reflections, pp. 27, 46, 148.; Elliot N. Dorff, Conservative Judaism: Our Ancestors to Our Descendants, United Synagogue of Conservative Judaism, 1979. pp. 104–105. Eugene B. Borowitz, Reform Judaism Today, Behrman House, 1993. pp. 147–148. occurring continuously and not limited to the ": null
    },
    {
        "theophany at Sinai": "mattan torah"
    },
    {
        ", the defining event in traditional interpretation. According to this view, all holy scripture of Judaism, including the ": null
    },
    {
        "Pentateuch": "pentateuch"
    },
    {
        ", were authored by human beings who, although under divine inspiration, inserted their understanding and reflected the spirit of their consecutive ages. All the People Israel are a further link in the chain of revelation, capable of reaching new insights: religion can be renewed without necessarily being dependent on past conventions. The chief promulgator of this concept was ": null
    },
    {
        "Abraham Geiger": "abraham geiger"
    },
    {
        ", generally considered the founder of the movement. After critical research led him to regard scripture as a human creation, bearing the marks of historical circumstances, he abandoned the belief in the unbroken perpetuity of tradition derived from Sinai and gradually replaced it with the idea of progressive revelation.     As in other ": null
    },
    {
        "liberal denominations": "liberal religion"
    },
    {
        ", this notion offered a conceptual framework for reconciling the acceptance of critical research with the maintenance of a belief in some form of divine communication, thus preventing a rupture among those who could no longer accept a literal understanding of revelation. No less importantly, it provided the clergy with a rationale for adapting, changing and excising traditional mores and bypassing the accepted conventions of Jewish Law, rooted in the orthodox concept of the explicit transmission of both scripture and its ": null
    },
    {
        "oral interpretation": "oral torah"
    },
    {
        ". While also subject to change and new understanding, the basic premise of progressive revelation endures in Reform thought. See also: ": null
    },
    {
        "Dana Evan Kaplan": "dana evan kaplan"
    },
    {
        ", ,  The Forward , 16 March 2011.     In its early days, this notion was greatly influenced by the philosophy of ": null
    },
    {
        "German idealism": "german idealism"
    },
    {
        ", from which its founders drew much inspiration: belief in humanity marching toward a full understanding of itself and the divine, manifested in moral progress towards perfection. This highly rationalistic view virtually identified human reason and intellect with divine action, leaving little room for direct influence by God. Geiger conceived revelation as occurring via the inherent genius of the People Israel, and his close ally ": null
    },
    {
        "Solomon Formstecher": "solomon formstecher"
    },
    {
        " described it as the awakening of oneself into full consciousness of ones religious understanding. The American theologian ": null
    },
    {
        "Kaufmann Kohler": "kaufmann kohler"
    },
    {
        " also spoke of the special insight of Israel, almost fully independent from direct divine participation, and English thinker ": null
    },
    {
        "Claude Montefiore": "claude montefiore"
    },
    {
        ", founder of ": null
    },
    {
        "Liberal Judaism": "liberal judaism"
    },
    {
        ", reduced revelation to inspiration , according intrinsic value only to the worth of its content, while it is not the place where they are found that makes them inspired . Common to all these notions was the assertion that present generations have a higher and better understanding of divine will, and they can and should unwaveringly change and refashion religious precepts. Jakob Josef Petuchowski, The Concept of Revelation in Reform Judaism , in Studies in Modern Theology and Prayer, Jewish Publication Society, 1998. pp. 101–112.     In the decades around ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", this rationalistic and optimistic theology was challenged and questioned. It was gradually replaced, mainly by the ": null
    },
    {
        "Jewish existentialism": "jewish existentialism"
    },
    {
        " of ": null
    },
    {
        "Martin Buber": "martin buber"
    },
    {
        " and ": null
    },
    {
        "Franz Rosenzweig": "franz rosenzweig"
    },
    {
        ", centered on a complex, personal relationship with the creator, and a more sober and disillusioned outlook. Robert G. Goldy, The Emergence of Jewish Theology in America, Indiana University Press, 1990. pp. 24–25. The identification of human reason with Godly inspiration was rejected in favour of views such as Rosenzweigs, who emphasized that the only content of revelation is it in itself, while all derivations of it are subjective, limited human understanding. However, while granting higher status to historical and traditional understanding, both insisted that revelation is certainly not Law giving and that it did not contain any finished statements about God , but, rather, that human subjectivity shaped the unfathomable content of the Encounter and interpreted it under its own limitations. The senior representative of postwar Reform theology, ": null
    },
    {
        "Eugene Borowitz": "eugene borowitz"
    },
    {
        ", regarded theophany in postmodern terms and closely linked it with quotidian human experience and interpersonal contact. He rejected the notion of progressive revelation in the meaning of comparing human betterment with divine inspiration, stressing that past experiences were unique and of everlasting importance. Yet he stated that his ideas by no means negated the concept of ongoing, individually experienced revelation by all.       Reform Judaism emphasizes the ethical facets of the faith as its central attribute, superseding the ceremonial ones. Reform thinkers often cited the ": null
    },
    {
        "Prophets": "neviimlatter prophets"
    },
    {
        " condemnations of ceremonial acts, lacking true intention and performed by the morally corrupt, as testimony that rites have no inherent quality. Geiger centered his philosophy on the Prophets teachings , regarding morality and ethics as the stable core of a religion in which ritual observance transformed radically through the ages. However, practices were seen as a means to elation and a link to the heritage of the past, and Reform generally argued that rituals should be maintained, discarded or modified based on whether they served these higher purposes. This stance allowed a great variety of practice both in the past and the present. In Classical times, personal observance was reduced to little beyond nothing. The postwar New Reform lent renewed importance to practical, regular action as a means to engage congregants, abandoning the sanitized forms of the Classical .     Another key aspect of Reform doctrine is the personal autonomy of each adherent, who may formulate his own understanding and expression of his religiosity. Reform is unique among all Jewish denominations in placing the individual as the authorized interpreter of Judaism. Dorff, p. 132; Dana Evan Kaplan, American Reform Judaism: An Introduction, Rutgers University Press, 2009. pp. 41–42; Jonathan Sacks, Crisis and Covenant: Jewish Thought After the Holocaust, Manchester Uni. Press, 1992. p. 158. This position was originally influenced by ": null
    },
    {
        "Kantian": "kantian"
    },
    {
        " philosophy and the great weight it lent to personal judgement and free will. This highly individualistic stance also proved one of the movements great challenges, for it impeded the creation of clear guidelines and standards for positive participation in religious life and definition of what was expected from members.     The notion of autonomy coincided with the gradual abandonment of traditional practice in the early stages of the movement. It was a major characteristic during the Classical period, when Reform closely resembled Protestant surroundings. Later, it was applied to encourage adherents to seek their own means of engaging Judaism. New Reform embraced the criticism levied by Rosenzweig and other thinkers at extreme individualism, laying a greater stress on community and tradition. Though by no means declaring that members were bound by a compelling authority of some sort – the notion of an intervening, commanding God remained foreign to denominational thought. The New Reform approach to the question is characterized by an attempt to strike a mean between autonomy and some degree of conformity, focusing on a dialectic relationship between both. Leon A. Morris, Beyond Autonomy: the Texts and Our Lives , in: Dana Evan Kaplan, Platforms and Prayer Books: Theological and Liturgical Perspectives on Reform Judaism, Rowman & Littlefield Publishers, 2002. pp. 271–284.     The movement never entirely abandoned  halakhic  argumentation, both due to the need for precedent to counter external accusations and the continuity of heritage, but had largely made ethical considerations or the spirit of the age the decisive factor in determining its course. The German founding fathers undermined the principles behind the legalistic process, which was based on a belief in an unbroken tradition through the ages merely elaborated and applied to novel circumstances, rather than subject to change. Rabbi ": null
    },
    {
        "Samuel Holdheim": "samuel holdheim"
    },
    {
        " advocated a particularly radical stance, arguing that the halakhic ": null
    },
    {
        "Law of the Land is Law": "dina dmalkhuta dina"
    },
    {
        " principle must be universally applied and subject virtually everything to current norms and needs, far beyond its weight in conventional Jewish Law.     While Reform rabbis in 19th-century Germany had to accommodate conservative elements in their communities, at the height of Classical Reform in the United States, halakhic considerations could be virtually ignored and Holdheims approach embraced. In the 1930s and onwards, Rabbi ": null
    },
    {
        "Solomon Freehof": "solomon freehof"
    },
    {
        " and his supporters reintroduced such elements, but they too regarded Jewish Law as too rigid a system. Instead, they recommended that selected features will be readopted and new observances established in a piecemeal fashion, as spontaneous  minhag  emerging by trial and error and becoming widespread if it appealed to the masses. The advocates of this approach also stress that their ": null
    },
    {
        "responsa": "responsain judaism"
    },
    {
        " are of non-binding nature, and their recipients may adapt them as they see fit. Walter Jacob, Liberal Judaism and Halakhah, Rodef Shalom Press, 1988. pp. 90–94.; Michael A. Meyer, , Proceedings of the World Congress of Jewish Studies, 1993. Freehofs successors, such as Rabbis ": null
    },
    {
        "Walter Jacob": "walter jacob"
    },
    {
        " and ": null
    },
    {
        "Moshe Zemer": "moshe zemer"
    },
    {
        ", further elaborated the notion of Progressive Halakha along the same lines.       Reform sought to accentuate and greatly augment the universalist traits in Judaism, turning it into a faith befitting the Enlightenment ideals ubiquitous at the time it emerged. The tension between universalism and the imperative to maintain uniqueness characterized the movement throughout its entire history. Its earliest proponents rejected ": null
    },
    {
        "Deism": "deism"
    },
    {
        " and the belief that all religions would unite into one, and it later faced the challenges of the ": null
    },
    {
        "Ethical movement": "ethical movement"
    },
    {
        " and ": null
    },
    {
        "Unitarianism": "unitarianism"
    },
    {
        ". Parallel to that, it sought to diminish all components of Judaism that it regarded as overly particularist and self-centered: petitions expressing hostility towards gentiles were toned down or excised, and practices were often streamlined to resemble surrounding society. New Reform laid a renewed stress on Jewish particular identity, regarding it as better suiting popular sentiment and need for preservation.     One major expression of that, which is the first clear Reform doctrine to have been formulated, is the idea of universal ": null
    },
    {
        "Messianism": "messiah in judaism"
    },
    {
        ". The belief in redemption was unhinged from the traditional elements of ": null
    },
    {
        "return to Zion": "return to zion"
    },
    {
        " and restoration of the ": null
    },
    {
        "Temple": "third temple"
    },
    {
        " and the sacrificial cult therein, and turned into a general hope for ": null
    },
    {
        "salvation": "salvation"
    },
    {
        ". This was later refined when the notion of a personal Messiah who would reign over Israel was officially abolished and replaced by the concept of a ": null
    },
    {
        "Messianic Age": "messianic age"
    },
    {
        " of universal harmony and perfection. The considerable loss of faith in human progress around World War II greatly shook this ideal, but it endures as a precept of Reform. Borowitz, Reform Judaism Today, pp. 81, 88–90.     Another key example is the reinterpretation of the ": null
    },
    {
        "election of Israel": "jews as the chosen people"
    },
    {
        ". The movement maintained the idea of the Chosen People of God, but recast it in a more universal fashion: it isolated and accentuated the notion that the mission of Israel was to spread among all nations and teach them divinely-inspired ethical monotheism, bringing them all closer to the Creator. One extreme Classical promulgator of this approach, Rabbi ": null
    },
    {
        "David Einhorn": "david einhorn"
    },
    {
        ", substituted the lamentation on the ": null
    },
    {
        "Ninth of Av": "ninth of av"
    },
    {
        " for a celebration, regarding the destruction of Jerusalem as fulfilling Gods scheme to bring his word, via his people, to all corners of the earth. Highly self-centered affirmations of Jewish exceptionalism were moderated, although the general notion of a kingdom of priests and a holy nation retained. On the other hand, while embracing a less strict interpretation compared to the traditional one, Reform also held to this tenet against those who sought to deny it. When secularist thinkers like ": null
    },
    {
        "Ahad Haam": "ahad haam"
    },
    {
        " and ": null
    },
    {
        "Mordecai Kaplan": "mordecai kaplan"
    },
    {
        " forwarded the view of ": null
    },
    {
        "Judaism as a civilization": "cultural judaism"
    },
    {
        ", portraying it as a culture created by the Jewish people, rather than a God-given faith defining them, Reform theologians decidedly rejected their position – although it became popular and even dominant among rank-and-file members. Like the Orthodox, they insisted that the People Israel was created by divine election alone, and existed solely as such. The 1999 Pittsburgh Platform and other official statements affirmed that the Jewish people is bound to God by an eternal Brit, covenant .       As part of its philosophy, Reform anchored reason in divine influence, accepted scientific criticism of hallowed texts and sought to adapt Judaism to modern notions of rationalism. In addition to the other traditional precepts its founders rejected, they also denied the belief in the future bodily ": null
    },
    {
        "resurrection of the dead": "resurrection of the dead"
    },
    {
        ". It was viewed both as irrational and an import from ancient middle-eastern pagans. Notions of afterlife were reduced merely to the ": null
    },
    {
        "immortality of the soul": "immortalityjudaism"
    },
    {
        ". While the founding thinkers, like Montefiore, all shared this belief, the existence of a soul became harder to cling to with the passing of time. In the 1980s, Borowitz could state that the movement had nothing coherent to declare in the matter. The various streams of Reform still largely, though not always or strictly, uphold the idea. Martha Himmelfarb, Resurrection , in: Adele Berlin , The Oxford Dictionary of the Jewish Religion, Oxford University Press, 2011. p. 624.; Kaplan, Platforms and Prayer Books, p. 217. The 1999 Pittsburgh Statement of Principles, for example, used the somewhat ambiguous formula the spirit within us is eternal . Kaplan, Contemporary Debates, p. 106.     Along these lines, the concept of ": null
    },
    {
        "reward and punishment": "jewish principles of faithreward and punishment"
    },
    {
        " in the ": null
    },
    {
        "world to come": "world to come"
    },
    {
        " was abolished as well. The only perceived form of retribution for the wicked, if any, was the anguish of their soul after death, and vice versa, bliss was the single accolade for the spirits of the righteous. Angels and heavenly hosts were also deemed a foreign superstitious influence, especially from early ": null
    },
    {
        "Zoroastrian": "zoroastrian"
    },
    {
        " sources, and denied. Romain, p. 8; Borowitz, Today, p. 168; Petuchowski, pp. 183–184. Walter Homolka, Liturgie als Theologie: das Gebet als Zentrum im jüdischen Denken, Frank & Timme GmbH, 2005. pp. 63–98; and especially: J. J. Petuchowski, Prayerbook Reform in Europe: the Liturgy of European Liberal and Reform Judaism, World Union for Progressive Judaism, 1968.           The first and primary field in which Reform convictions were expressed was that of prayer forms. From its beginning, Reform Judaism attempted to harmonize the language of petitions with modern sensibilities and what the constituents actually believed in. ": null
    },
    {
        "Jakob Josef Petuchowski": "jakob josef petuchowski"
    },
    {
        ", in his extensive survey of Progressive liturgy, listed several key principles that defined it through the years and many transformations it underwent. The prayers were abridged, whether by omitting repetitions, excising passages or reintroducing the ancient ": null
    },
    {
        "triennial cycle": "triennial cycle"
    },
    {
        " for reading the Torah; vernacular segments were added alongside or instead of the ": null
    },
    {
        "Hebrew and Aramaic": "leshon hakodesh"
    },
    {
        " text, to ensure the congregants understood the petitions they expressed; and some new prayers were composed to reflect the spirit of changing times. But chiefly, liturgists sought to reformulate the prayerbooks and have them express the movements theology. Blessings and passages referring to the coming of the Messiah, return to Zion, renewal of the sacrificial cult, resurrection of the dead, reward and punishment and overt particularism of the People Israel were replaced, recast or excised altogether.     In its early stages, when Reform Judaism was more a tendency within unified communities in Central Europe than an independent movement, its advocates had to practice considerable moderation, lest they provoke conservative animosity. German prayerbooks often relegated the more contentious issues to the vernacular translation, treating the original text with great care and sometimes having problematic passages in small print and untranslated. When institutionalized and free of such constraints, it was able to pursue a more radical course. In American Classical or British Liberal prayerbooks, a far larger vernacular component was added and liturgy was drastically shortened, and petitions in discord with denominational theology eliminated.     New Reform , both in the United States and in Britain and the rest of the world, is characterized by larger affinity to traditional forms and diminished emphasis on harmonizing them with prevalent beliefs. Concurrently, it is also more inclusive and accommodating, even towards beliefs that are officially rejected by Reform theologians, sometimes allowing alternative differing rites for each congregation to choose from. Thus, prayerbooks from the mid–20th century onwards incorporated more Hebrew, and restored such elements as blessing on ": null
    },
    {
        "phylacteries": "tefillin"
    },
    {
        ". More profound changes included restoration of the Gevorot benediction in the 2007  Mishkan Tfilah , with the optional give life to all/revive the dead formula. The CCAR stated this passage did not reflect a belief in Resurrection, but Jewish heritage. On the other extreme, the 1975  Gates of Prayer  substituted the Eternal One for God in the English translation , a measure that was condemned by several Reform rabbis as a step toward ": null
    },
    {
        "religious humanism": "religious humanism"
    },
    {
        ". For a concise introduction, see: Dalia Marks, https://www.academia.edu/35401476 Reform Liturgy: Then and now, in: A Life of Meaning: Embracing Reform Judaisms Sacred Path. CCAR Press, 2017.       During its formative era, Reform was oriented toward lesser ceremonial obligations. In 1846, the Breslau rabbinical conference abolished the ": null
    },
    {
        "second day of festivals": "yom tov sheni shel galuyot"
    },
    {
        "; during the same years, the Berlin Reform congregation held prayers without ": null
    },
    {
        "blowing the Rams Horn": "shofar blowing"
    },
    {
        ", ": null
    },
    {
        "phylacteries": "tefillin"
    },
    {
        ", ": null
    },
    {
        "mantles": "tallit"
    },
    {
        " or ": null
    },
    {
        "head covering": "kippah"
    },
    {
        ", and held its Sabbath services on Sunday. In the late 19th and early 20th Century, American Classical Reform often emulated Berlin on a mass scale, with many communities conducting prayers along the same style and having additional services on Sunday. An official rescheduling of Sabbath to Sunday was advocated by ": null
    },
    {
        "Kaufmann Kohler": "kaufmann kohler"
    },
    {
        " for some time, though he retracted it eventually. ": null
    },
    {
        "Religious divorce": "get"
    },
    {
        " was declared redundant and the civil one recognized as sufficient by American Reform in 1869, and in Germany by 1912; the laws concerning ": null
    },
    {
        "dietary": "kashrut"
    },
    {
        " and ": null
    },
    {
        "personal": "tumah and taharah"
    },
    {
        " purity, the ": null
    },
    {
        "priestly": "kohen"
    },
    {
        " prerogatives, ": null
    },
    {
        "marital ordinances": "jewish views on marriage"
    },
    {
        " and so forth were dispensed with, and openly revoked by the 1885 ": null
    },
    {
        "Pittsburgh Platform": "pittsburgh platform"
    },
    {
        ", which declared all ceremonial acts binding only if they served to enhance religious experience. From 1890, converts were no longer obligated to be circumcised. Similar policy was pursued by ": null
    },
    {
        "Claude Montefiores": "claude montefiore"
    },
    {
        "Jewish Religious Union, established at Britain in 1902. The Vereinigung für das Liberale Judentum in Germany, which was more moderate, declared virtually all personal observance voluntary in its 1912 guidelines.     New Reform saw the establishment and membership lay greater emphasis on the ceremonial aspects, after the former sterile and minimalist approach was condemned as offering little to engage in religion and encouraging apathy. Numerous rituals became popular again, often after being recast or reinterpreted, though as a matter of personal choice for the individual and not an authoritative obligation. ": null
    },
    {
        "Circumcision": "circumcision"
    },
    {
        " or ": null
    },
    {
        "Letting of Blood": "hatafat dam brit"
    },
    {
        " for converts and newborn babies became virtually mandated in the 1980s; ": null
    },
    {
        "ablution": "ritual washing in judaism"
    },
    {
        " for menstruating women gained great grassroots popularity at the turn of the century, and some synagogues built ": null
    },
    {
        "mikvehs": "mikveh"
    },
    {
        ". A renewed interest in dietary laws also surfaced at the same decades, as were phylacteries, prayer shawls and head coverings. Reform is still characterized by having the least engaged public on average: ": null
    },
    {
        "Jack Wertheimer": "jack wertheimer"
    },
    {
        ", ": null
    },
    {
        "Steven M. Cohen": "steven m. cohen"
    },
    {
        ", , Mosaic Magazine, 2 November 2014. for example, of those polled by ": null
    },
    {
        "Pew": "pew research center"
    },
    {
        " in 2013, only 34% of registered synagogue members attend services once a month and more.      While defined mainly by their progress away from ritual, proto-Reform also pioneered new ones. In the 1810s and 1820s, the circles  that gave rise to the movement introduced ": null
    },
    {
        "confirmation": "confirmation"
    },
    {
        " ceremonies for boys and girls, in emulation of parallel Christian initiation rite. These soon spread outside the movement, though many of a more traditional leaning rejected the name confirmation . In the New Reform , ": null
    },
    {
        "Bar Mitzvah": "bar mitzvah"
    },
    {
        " largely replaced it as part of the re-traditionalization, but many young congregants in the United States still perform one, often at the ": null
    },
    {
        "Feast of Weeks": "feast of weeks"
    },
    {
        ". Confirmation for girls eventually developed into the ": null
    },
    {
        "Bat Mitzvah": "bat mitzvah"
    },
    {
        ", now popular among all except strictly Orthodox Jews.     Some branches of Reform, while subscribing to its differentiation between ritual and ethics, chose to maintain a considerable degree of practical observance, especially in areas where a conservative Jewish majority had to be accommodated. Most Liberal communities in Germany maintained dietary standards and the like in the public sphere, both due to the moderation of their congregants and threats of Orthodox secession. A similar pattern characterizes the ": null
    },
    {
        "Movement for Reform Judaism": "movement for reform judaism"
    },
    {
        " in Britain, which attempted to appeal to newcomers from the ": null
    },
    {
        "United Synagogue": "united synagogue"
    },
    {
        ", or to the ": null
    },
    {
        "IMPJ": "israel movement for reform and progressive judaism"
    },
    {
        " in Israel.       Its philosophy made Progressive Judaism, in all its variants, much more able to embrace change and new trends than any of the major denominations. It was the first to adopt innovations such as gender equality in religious life. As early as 1846, the Breslau conference announced that women must enjoy identical obligations and prerogatives in worship and communal affairs, though this decision had virtually no effect in practice. ": null
    },
    {
        "Lily Montagu": "lily montagu"
    },
    {
        ", who served as a driving force behind British Liberal Judaism and WUPJ, was the first woman in recorded history to deliver a sermon at a synagogue in 1918, and set another precedent when she conducted a prayer two years later. ": null
    },
    {
        "Regina Jonas": "regina jonas"
    },
    {
        ", ordained in 1935 by later chairman of the Vereinigung der liberalen Rabbiner Max Dienemann, was the earliest known female rabbi to officially be granted the title. In 1972, ": null
    },
    {
        "Sally Priesand": "sally priesand"
    },
    {
        " was ordained by ": null
    },
    {
        "Hebrew Union College": "hebrew union college"
    },
    {
        ", which made her Americas first female rabbi ordained by a rabbinical seminary, and the second formally ordained female rabbi in Jewish history, after Regina Jonas.    Reform also pioneered family seating, an arrangement that spread throughout American Jewry but was only applied in continental Europe after World War II. Egalitarianism in prayer became universally prevalent in the WUPJ by the end of the 20th Century.     Tolerance for ": null
    },
    {
        "LGBT": "lgbt"
    },
    {
        " and ordination of LGBT rabbis were also pioneered by the movement. Intercourse between consenting adults was declared as legitimate by the ": null
    },
    {
        "Central Conference of American Rabbis": "central conference of american rabbis"
    },
    {
        " in 1977, and openly gay clergy were admitted by the end of the 1980s. Same-sex marriage were sanctioned by the end of the following decade. In 2015, the URJ adopted a Resolution on the Rights of ": null
    },
    {
        "Transgender": "transgender"
    },
    {
        " and Gender Non-Conforming People, urging clergy and synagogue attendants to actively promote tolerance and inclusion of such individuals.     American Reform, especially, turned action for social and progressive causes into an important part of religious commitment. From the second half of the 20th Century, it employed the old rabbinic notion of  Tikkun Olam , repairing the world , as a slogan under which constituents were encouraged to partake in various initiatives for the betterment of society. The ": null
    },
    {
        "Religious Action Center of Reform Judaism": "religious action center of reform judaism"
    },
    {
        " became an important lobby in service of progressive causes such as the rights of women, minorities, LGBT, and the like. Tikkun Olam has become the central venue for active participation for many affiliates, even leading critics to negatively describe Reform as little more than a means employed by Jewish liberals to claim that commitment to their political convictions was also a religious activity and demonstrates fealty to Judaism. ": null
    },
    {
        "Dana Evan Kaplan": "dana evan kaplan"
    },
    {
        " stated that Tikkun Olam has incorporated only leftist, socialist-like elements. In truth, it is political, basically a mirror of the most radically leftist components of the Democratic Party platform, causing many to say that Reform Judaism is simply the Democratic Party with Jewish holidays. Contemporary Debates, pp. 122–123. See also: Darren Kleinberg, https://www.academia.edu/28603703 Reform Judaism and the Jewish Social Gospel . CCAR Journal: The Reform Jewish Quarterly, Fall 2009. Rabbi ": null
    },
    {
        "Jakob Josef Petuchowski": "jakob josef petuchowski"
    },
    {
        " complained that under the influence of secular Jews who constitute most of its congregants since the 1950s, when lack of religious affiliation was particularly frowned upon, Reform Judaism is today in the forefront of secularism in America... Very often indistinguishable from the ": null
    },
    {
        "ACLU": "aclu"
    },
    {
        "... The fact of the matter is that it has, somewhere along the line, lost its religious moorings. In Israel, the ": null
    },
    {
        "Religious Action Center": "israel religious action center"
    },
    {
        " is very active in the judicial field, often resorting to litigation both in cases concerning civil rights in general and the official status of Reform within the state, in particular. ": null
    },
    {
        "Aviad haCohen": "aviad hacohen"
    },
    {
        ", ?בית המשפט ובג ץ: תל פיות לתנועה הרפורמית, in: Rosenak ed., pp. 439–479.       While opposed to ": null
    },
    {
        "interfaith marriage": "interfaith marriage in judaism"
    },
    {
        " in principle, officials of the major Reform rabbinical organisation, the ": null
    },
    {
        "Central Conference of American Rabbis": "central conference of american rabbis"
    },
    {
        " , estimated in 2012 that about half of their rabbis partake in such ceremonies. The need to cope with this phenomenon – 80% of all Reform-raised Jews in the United States wed between 2000 and 2013 were intermarried – led to the recognition of ": null
    },
    {
        "patrilineal descent": "matrilineality in judaism"
    },
    {
        ": all children born to a couple in which a single member was Jewish, whether mother or father, was accepted as a Jew on condition that they received corresponding education and committed themselves as such. Conversely, offspring of a Jewish mother only are not accepted if they do not demonstrate affinity to the faith. A Jewish status is conferred unconditionally only on the children of two Jewish parents.     This decision was taken by the British Liberal Judaism already in the 1950s. The North American ": null
    },
    {
        "Union for Reform Judaism": "union for reform judaism"
    },
    {
        " accepted it in 1983, and The British ": null
    },
    {
        "Movement for Reform Judaism": "movement for reform judaism"
    },
    {
        " affirmed it in 2015. The various strands also adopted a policy of embracing the intermarried and their spouses. British Liberals offer blessing ceremonies if the child is to be raised Jewish, and the MRJ allows its clergy to participate in celebration of civil marriage, though none allow a full Jewish ceremony with  Chupah  and the like. In American Reform, 17% of synagogue-member households have a converted spouse, and 26% an unconverted one. Its policy on conversion and Jewish status led the WUPJ into conflict with more traditional circles, and a growing number of its adherents are not accepted as Jewish by either the ": null
    },
    {
        "Conservative": "conservative judaism"
    },
    {
        " or the ": null
    },
    {
        "Orthodox": "orthodox judaism"
    },
    {
        ". Outside North America and Britain, patrilineal descent was not accepted by most. As in other fields, small WUPJ affiliates are less independent and often have to deal with more conservative Jewish denominations in their countries, such as vis-à-vis the Orthodox rabbinate in Israel or continental Europe.          The term Reform was first applied institutionally – not generically, as in for reform – to the Berlin Reformgemeinde , established in 1845. Meyer, Response, p. 425. Apart from it, most German communities that were oriented in that direction preferred the more ambiguous Liberal , which was not exclusively associated with Reform Judaism. It was more prevalent as an appellation for the religiously apathetic majority among German Jews, and also to all rabbis who were not clearly Orthodox . The title Reform became much more common in the United States, where an independent denomination under this name was fully identified with the religious tendency. However, ": null
    },
    {
        "Isaac Meyer Wise": "isaac meyer wise"
    },
    {
        " suggested in 1871 that Progressive Judaism was a better epithet. Isaac Meyer Wise, Reformed Judaism, 1871.  When the movement was institutionalized in Germany between in 1898 and 1908, its leaders chose Liberal as self-designation, founding the Vereinigung für das Liberale Judentum. In 1902, ": null
    },
    {
        "Claude Montefiore": "claude montefiore"
    },
    {
        " termed the doctrine espoused by his new Jewish Religious Union as Liberal Judaism , too, though it belonged to the more radical part of the spectrum in relation to the German one.     In 1926, British Liberals, American Reform and German Liberals consolidated their worldwide movement – united in affirming tenets such as progressive revelation, supremacy of ethics above ritual and so forth – at a meeting held in London. Originally carrying the provisional title International Conference of Liberal Jews , after deliberations between Liberal , Reform and Modern , it was named ": null
    },
    {
        "World Union for Progressive Judaism": "world union for progressive judaism"
    },
    {
        " on 12 July, at the conclusion of a vote. For the protocol of the vote, see: , Jewish Religious Union. pp. 118–130. The WUPJ established further branches around the planet, alternatively under the names Reform , Liberal and Progressive . In 1945, the Associated British Synagogues  joined as well. In 1990, ": null
    },
    {
        "Reconstructionist Judaism": "reconstructionist judaism"
    },
    {
        " entered the WUPJ as an observer. Espousing another religious worldview, it became the only non-Reform member. ": null
    },
    {
        "American Jewish Committee": "american jewish committee"
    },
    {
        ", American Jewish Year Book, 1992, ": null
    },
    {
        "University of Nebraska Press": "university of nebraska press"
    },
    {
        ", 1992. p. 257. The WUPJ claims to represent a total of at least 1.8 million people – these figures do not take into account the 2013 PEW survey, and rely on the older URJ estimate of a total of 1.5 million presumed to have affinity, since updated to 2.2 million – both registered synagogue members and non-affiliates who identify with it.     Worldwide, the movement is mainly centered in North America. The largest WUPJ constituent by far is the ": null
    },
    {
        "Union for Reform Judaism": "union for reform judaism"
    },
    {
        " in the United States and Canada. As of 2013, the ": null
    },
    {
        "Pew Research Center": "pew research center"
    },
    {
        " survey calculated it represented about 35% of all 5.3 million Jewish adults in the U.S., making it the single most numerous Jewish religious group in the country. , 1 October 2013. ": null
    },
    {
        "Steven M. Cohen": "steven m. cohen"
    },
    {
        " deduced there were 756,000 adult Jewish synagogue members – about a quarter of households had an unconverted spouse , adding some 90,000 non-Jews and making the total constituency roughly 850,000 – and further 1,154,000 Reform-identified non-members in the United States. There are also 30,000 in Canada. Steven M. Cohen, ,  The Forward , 5 November 2015. ": null
    },
    {
        "Steven M. Cohen": "steven m. cohen"
    },
    {
        ", , S3K Report, Fall 2006 Based on these, the URJ claims to represent 2.2 million people. , urj.org. It has 846 congregations in the U.S. and 27 in Canada, the vast majority of the 1,170 affiliated with the WUPJ that are not Reconstructionist. , urj.org. For the mutually exclusive of list of Reconstructionist congregations worldwide, see , jewishrecon.org. Its rabbinical arm is the ": null
    },
    {
        "Central Conference of American Rabbis": "central conference of american rabbis"
    },
    {
        ", with some 2,300 member rabbis, mainly trained in ": null
    },
    {
        "Hebrew Union College": "hebrew union college"
    },
    {
        ". As of 2015, the URJ was led by President Rabbi ": null
    },
    {
        "Richard Jacobs": "richard jacobs"
    },
    {
        ", and the CCAR headed by Rabbi ": null
    },
    {
        "Denise Eger": "denise eger"
    },
    {
        ".     The next in size, by a wide margin, are the two British WUPJ-affiliates. In 2010, the ": null
    },
    {
        "Movement for Reform Judaism": "movement for reform judaism"
    },
    {
        " and ": null
    },
    {
        "Liberal Judaism": "liberal judaism"
    },
    {
        " respectively had 16,125 and 7,197 member households in 45 and 39 communities, or 19.4% and 8.7% of British Jews registered at a synagogue. Other member organizations are based in forty countries around the world. They include the ": null
    },
    {
        "Union progressiver Juden in Deutschland": "union progressiver juden in deutschland"
    },
    {
        ", which had some 4,500 members in 2010 and incorporates 25 congregations, one in Austria; the ": null
    },
    {
        "Nederlands Verbond voor Progressief Jodendom": "nederlands verbond voor progressief jodendom"
    },
    {
        ", with 3,500 affiliates in 10 communities; the 13 Liberal synagogues in France; the ": null
    },
    {
        "Israel Movement for Reform and Progressive Judaism": "israel movement for reform and progressive judaism"
    },
    {
        " ; the Movement for Progressive Judaism in the ": null
    },
    {
        "CIS": "commonwealth of independent states"
    },
    {
        " and ": null
    },
    {
        "Baltic States": "baltic states"
    },
    {
        ", with 61 affiliates in ": null
    },
    {
        "Russia": "russia"
    },
    {
        ", ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        " and ": null
    },
    {
        "Belarus": "belarus"
    },
    {
        " and several thousands of regular constituents; and many other, smaller ones.                 With the advent of ": null
    },
    {
        "Jewish emancipation": "jewish emancipation"
    },
    {
        " and ": null
    },
    {
        "acculturation": "acculturation"
    },
    {
        " in Central Europe during the late 18th Century, and the breakdown of traditional patterns and norms, the response Judaism should offer to the changed circumstances became a heated concern. Radical, second-generation Berlin  maskilim  , like ": null
    },
    {
        "Lazarus Bendavid": "lazarus bendavid"
    },
    {
        " and ": null
    },
    {
        "David Friedländer": "david friedländer"
    },
    {
        ", proposed to reduce it to little above ": null
    },
    {
        "Deism": "deism"
    },
    {
        " or allow it to dissipate. A more palatable course was the reform of worship in synagogues, making it more attractive to a Jewish public whose aesthetic and moral taste became attuned to that of Christian surroundings. Meyer, Response, pp. 16–22. The first considered to have implemented such a course was the ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        " Ashkenazi": "ashkenazi"
    },
    {
        " congregation, Adath Jessurun. In 1796, emulating the local ": null
    },
    {
        "Sephardic": "sephardim"
    },
    {
        " custom, it omitted the ": null
    },
    {
        "Father of Mercy": "av harachamim"
    },
    {
        " prayer, beseeching God to take revenge upon the gentiles. The short-lived Adath Jessurun employed fully traditional argumentation to legitimize its actions, but is often regarded a harbinger by historians. David Harry Ellenson, After Emancipation: Jewish Religious Responses to Modernity, Hebrew Union College Press, 2004. p. 103.     A relatively thoroughgoing program was adopted by ": null
    },
    {
        "Israel Jacobson": "israel jacobson"
    },
    {
        ", a philanthropist from the ": null
    },
    {
        "Kingdom of Westphalia": "kingdom of westphalia"
    },
    {
        ". Faith and dogma were eroded for decades both by Enlightenment criticism and apathy, but Jacobson himself did not bother with those. He was interested in decorum, believing its lack in services was driving the young away. Many of the aesthetic reforms he pioneered, like a regular vernacular sermon on moralistic themes, would be later adopted by the ": null
    },
    {
        "modernist Orthodox": "torah im derech eretz"
    },
    {
        ". Dr. Michael K. Silber, , ": null
    },
    {
        "The YIVO Encyclopedia of Jews in Eastern Europe": "the yivo encyclopedia of jews in eastern europe"
    },
    {
        ". On 17 July 1810, he dedicated a synagogue in ": null
    },
    {
        "Seesen": "seesen"
    },
    {
        " that employed an organ and a choir during prayer and introduced some German liturgy. While Jacobson was far from full-fledged Reform Judaism, this day was adopted by the movement worldwide as its foundation date. The Seesen temple – a designation quite common for prayerhouses at the time; temple would later become, somewhat misleadingly , identified with Reform institutions via association with the elimination of prayers for the Jerusalem Temple – Meyer, p. 42. closed in 1813. Jacobson moved to Berlin and established a similar one, which became a hub for like-minded individuals. Though the prayerbook used in Berlin did introduce several deviations from the received text, it did so without an organizing principle. In 1818, Jacobsons acquaintance Edward Kley founded the ": null
    },
    {
        "Hamburg Temple": "hamburg temple"
    },
    {
        ". Here, changes in the rite were eclectic no more and had severe dogmatic implications: prayers for the ": null
    },
    {
        "restoration of sacrifices": "third temple"
    },
    {
        " by the ": null
    },
    {
        "Messiah": "messiah in judaism"
    },
    {
        " and ": null
    },
    {
        "Return to Zion": "gathering of israel"
    },
    {
        " were quite systematically omitted. The Hamburg edition is considered the first comprehensive Reform liturgy.     While Orthodox protests to Jacobsons initiatives were scant, dozens of rabbis throughout Europe united to ban the Hamburg Temple. Its leaders attempted to justify themselves based on canonical sources, being still attached to old modes of thought. They had the grudging support of one rabbi, ": null
    },
    {
        "Aaron Chorin": "aaron chorin"
    },
    {
        " of ": null
    },
    {
        "Arad": "arad, romania"
    },
    {
        " . The massive Orthodox reaction halted the advance of the new trend, confining it to the port city for the next twenty years. Although many synagogues introduced mild aesthetic modifications as the process of acculturation spread throughout Central Europe, synchronized with the breakdown of traditional society and growing religious laxity, those were carefully crafted in order to assuage conservative elements – albeit the latter often opposed them anyhow; vernacular sermons or secular education for rabbis were much resisted – and lacked a serious ideological undertone. One of the first to adopt such was Hamburgs own Orthodox community under the newly appointed Rabbi ": null
    },
    {
        "Isaac Bernays": "isaac bernays"
    },
    {
        ". The less strict but still traditional ": null
    },
    {
        "Isaac Noah Mannheimer": "isaac noah mannheimer"
    },
    {
        " of the ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " Stadttempel": "stadttempel"
    },
    {
        " and ": null
    },
    {
        "Michael Sachs": "michael sachs"
    },
    {
        " in ": null
    },
    {
        "Prague": "prague"
    },
    {
        ", who both significantly altered custom but wholly avoided dogmatic issues or overt injury to Jewish Law, set the pace for most of Europe. Meyer, Response, pp. 55–58, 111–115, 150–157.      An isolated, yet much more radical step in the same direction as Hamburgs was taken across the ocean in 1824. The younger congregants in the ": null
    },
    {
        "Charleston": "charleston, south carolina"
    },
    {
        " synagogue ": null
    },
    {
        "Beth Elohim": "congregation kahal kadosh beth elohim"
    },
    {
        " were disgruntled by present conditions and demanded change. Led by ": null
    },
    {
        "Isaac Harby": "isaac harby"
    },
    {
        " and other associates, they formed their own prayer group, The Reformed Society of Israelites . Apart from strictly aesthetic matters, like having sermons and synagogue affairs delivered in English, rather than ": null
    },
    {
        "Middle Spanish": "middle spanish"
    },
    {
        " , they had almost their entire liturgy solely in the vernacular, in a far greater proportion compared to the Hamburg rite. And chiefly, they felt little attachment to the traditional Messianic doctrine and possessed a clearly heterodox religious understanding. In their new prayerbook, authors Harby, Abram Moïse and David Nunes Carvalho unequivocally excised pleas for the restoration of the Jerusalem Temple; during his inaugural address on 21 November 1825, Harby stated their native country was their only Zion, not some stony desert , and described the rabbis of old as Fabulists and Sophists... Who tortured the plainest precepts of the Law into monstrous and unexpected inferences . The Society was short-lived, and they merged back into Beth Elohim in 1833. As in Germany, the reformers were laymen, operating in a country with little rabbinic presence. Meyer, Response, pp. 232–235. See Harbys discourse in: ": null
    }
]