[
    {
        "A reform of the date of Easter has been proposed several times because the current system for determining the date of ": null
    },
    {
        "Easter": "Easter"
    },
    {
        " is seen as presenting two significant problems:     Its ": null
    },
    {
        "date varies from year to year": "Moveable Feast"
    },
    {
        ". It can fall on up to 35 days in March and April of the respective calendar. While many Christians do not consider this to be a problem, it can cause frequent difficulties of co-ordination with ": null
    },
    {
        "civil calendar": "Civil Calendar"
    },
    {
        "s, for example ": null
    },
    {
        "academic term": "Academic Term"
    },
    {
        "s. Many countries have ": null
    },
    {
        "public holidays": "Public Holiday"
    },
    {
        "around Easter weekend or tied to the date of Easter but spread from February to June, such as ": null
    },
    {
        "Shrove Tuesday": "Shrove Tuesday"
    },
    {
        " or ": null
    },
    {
        "Ascension": "Feast Of The Ascension"
    },
    {
        " and ": null
    },
    {
        "Pentecost": "Pentecost"
    },
    {
        ".   Many ": null
    },
    {
        "Eastern churches": "Eastern Christianity"
    },
    {
        " calculate the date of Easter using the ": null
    },
    {
        "Julian calendar": "Julian Calendar"
    },
    {
        ", whereas some Eastern churches use the ": null
    },
    {
        "Revised Julian calendar": "Revised Julian Calendar"
    },
    {
        " and all ": null
    },
    {
        "Western churches": "Western Christianity"
    },
    {
        " and civil authorities have adopted the ": null
    },
    {
        "Gregorian reforms": "Gregorian Calendar"
    },
    {
        " for all calendrical purposes. Hence in most years, Easter is celebrated on a later date in the East than in the West.     There have been ": null
    },
    {
        "controversies about the correct date of Easter": "Easter Controversy"
    },
    {
        " since antiquity, leading to ": null
    },
    {
        "schisms": "Schism"
    },
    {
        "and excommunications or even executions due to ": null
    },
    {
        "heresy": "Heresy In Christianity"
    },
    {
        ", but most Christian churches today agree on certain points. Easter should therefore be celebrated:     on a ": null
    },
    {
        "Sunday": "Sunday"
    },
    {
        " ,   after the ": null
    },
    {
        "Northward equinox": "Northward Equinox"
    },
    {
        " , that is in Northern Hemisphere spring,   after the nominal Paschal ": null
    },
    {
        "full moon": "Full Moon"
    },
    {
        ".     There is less agreement whether Easter also should occur:     so that ": null
    },
    {
        "Annunciation": "Feast Of The Annunciation"
    },
    {
        " – usually celebrated 25 March, 9 months before ": null
    },
    {
        "Christmas": "Christmas"
    },
    {
        " – does not fall on any day from the ": null
    },
    {
        "Sunday before Easter": "Palm Sunday"
    },
    {
        " to the ": null
    },
    {
        "Sunday after": "Octave Of Easter"
    },
    {
        ",   on or after the ": null
    },
    {
        "14th day": "Quartodecimanism"
    },
    {
        " of the lunar month of ": null
    },
    {
        "Nisan": "Nisan"
    },
    {
        ",   not before ": null
    },
    {
        "Jewish Pesach": "Passover"
    },
    {
        ".      The disagreements have been particularly about the determination of moon phases and the equinox, some still preferring astronomical observation from a certain location , most others following nominal approximations of these in either the ": null
    },
    {
        "Hebrew": "Hebrew Calendar"
    },
    {
        ", Julian or Gregorian calendar using different lookup tables and cycles in their algorithms.         It has been proposed that the first problem could be resolved by making Easter occur on a date fixed relative to the western ": null
    },
    {
        "Gregorian calendar": "Gregorian Calendar"
    },
    {
        " every year, or alternatively on a Sunday within a fixed range of seven or eight dates. While tying Easter to one fixed date would serve to underline the belief that it commemorates an actual historical event, without an accompanying ": null
    },
    {
        "calendar reform": "Calendar Reform"
    },
    {
        " that changes the pattern of the days of the week  or adopted a ": null
    },
    {
        "leap week": "Leap Week"
    },
    {
        ", it would also break the tradition of Easter always being on a Sunday, established since the 2nd century and by now deeply embedded in the ": null
    },
    {
        "liturgical": "Liturgy"
    },
    {
        " practice and ": null
    },
    {
        "theological": "Theology"
    },
    {
        " understanding of almost all ": null
    },
    {
        "Christian denomination": "Christian Denomination"
    },
    {
        "s.     The Second Ecumenical Council of the Vatican agreed in 1963 to accept a fixed Sunday in the Gregorian calendar as the date for Easter as long as other Christian churches agreed on it as well. They also agreed in principle to adopt a civil calendar reform as long as there were never any days outside the cycle of seven days per week.         The Pepuzites, a 5th-century sect, celebrated Easter on the Sunday following April 6 .  This is equivalent to the Sunday closest to April 9. The April 6 date was apparently arrived at because it was equivalent to the 14th of the month of ": null
    },
    {
        "Artemisios": "Artemisios"
    },
    {
        " in an earlier calendar used in the area, hence, the 14th of the first month of spring.         The two most widespread proposals for fixing the date of Easter would set it on either the second Sunday in April , or the Sunday after the second Saturday in April . They only differ in years with dominical letter G or AG where 1 April is a Sunday. In both schemes, account has been taken of the fact that—in spite of the many difficulties in establishing the dates of the historical events involved—many scholars attribute a high degree of probability to ": null
    },
    {
        "Friday": "Good Friday"
    },
    {
        " 7 April 30, as the date of the ": null
    },
    {
        "crucifixion": "Crucifixion"
    },
    {
        " of ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        ", which would make 9 April the date of the ": null
    },
    {
        "Resurrection": "Resurrection"
    },
    {
        ". Another date which is supported by many scholars is 3 April 33,       making 5 April the date of the ": null
    },
    {
        "Resurrection": "Resurrection Of Jesus"
    },
    {
        ".     In the late 1920s and 1930s, this idea gained some momentum along with other calendar reform proposals, such as the ": null
    },
    {
        "International Fixed Calendar": "International Fixed Calendar"
    },
    {
        " and the ": null
    },
    {
        "World Calendar": "World Calendar"
    },
    {
        ". In 1928, ": null
    },
    {
        "a law": "Easter Act 1928"
    },
    {
        " was passed in the United Kingdom authorising an Order in Council which would fix the date of Easter in that country as the Sunday after the second Saturday in April.  However, this was never implemented.        The Sunday after the first Wednesday in April would always be in ISO week 14, except for leap years starting on Thursday where the week count is one higher than in otherwise equivalent common years after February. The ": null
    },
    {
        "Symmetry454 Calendar": "Symmetry454 Calendar"
    },
    {
        " proposes a fixed date of Easter in week 14, which would agree with the aforementioned proposals in most years, but would be 1 week earlier in F/GF years and also in DC, D/ED and E/FE years.     The Sunday of an ordinal ISO week n is also the nth Sunday of the year, except in A/AG, B/BA and C/CB years where it is the n+1st Sunday, so both major proposals put Easter on the 15th Sunday of the year except either in common years starting on Monday , where 8 April, i.e. the second Sunday in April, is the 14th Sunday of the year, or in leap years starting on Sunday , where 15 April, i.e. the Sunday after the second Saturday in April, is the 16th Sunday of the year.     :     In 1977, some Eastern Orthodox representatives objected to separating the date of Easter from lunar phases.          Proposals to resolve the second problem have made greater progress, but they are yet to be adopted.            An astronomical rule for Easter was proposed by the 1923  that also proposed the ": null
    },
    {
        "Revised Julian calendar": "Revised Julian Calendar"
    },
    {
        ": Easter was to be the Sunday after the midnight-to-midnight day at the meridian of the ": null
    },
    {
        "Church of the Holy Sepulchre": "Church Of The Holy Sepulchre"
    },
    {
        " in ": null
    },
    {
        "Jerusalem": "Jerusalem"
    },
    {
        " during which the first ": null
    },
    {
        "full moon": "Full Moon"
    },
    {
        " after the vernal equinox occurs.       Although the instant of the full moon must occur after the instant of the vernal equinox, it may occur on the same day. If the full moon occurs on a Sunday, Easter is the following Sunday. This proposed astronomical rule was rejected by all Orthodox churches and was never considered by any Western church.            The ": null
    },
    {
        "World Council of Churches": "World Council Of Churches"
    },
    {
        " proposed a ": null
    },
    {
        "reform of the method of determining the date of Easter": "Aleppo Easter Dating Method"
    },
    {
        " at a summit in ": null
    },
    {
        "Aleppo": "Aleppo"
    },
    {
        ", ": null
    },
    {
        "Syria": "Syria"
    },
    {
        ", in 1997:  Easter would be defined as the first Sunday following the first ": null
    },
    {
        "astronomical": "Astronomy"
    },
    {
        " full moon": "Full Moon"
    },
    {
        " following the astronomical ": null
    },
    {
        "vernal equinox": "Vernal Equinox"
    },
    {
        ", as determined from the ": null
    },
    {
        "meridian": "Meridian"
    },
    {
        " of ": null
    },
    {
        "Jerusalem": "Jerusalem In Christianity"
    },
    {
        ".  The reform would have been implemented starting in 2001, since in that year the Eastern and Western dates of Easter would coincide.     This reform has not been implemented. It would have relied mainly on the co-operation of the ": null
    },
    {
        "Eastern Orthodox Church": "Eastern Orthodox Church"
    },
    {
        ", since the date of Easter would change for them immediately; whereas for the Western churches, the new system would not differ from that currently in use until 2019. However, Eastern Orthodox support was not forthcoming, and the reform failed.  The much greater impact that this reform would have had on the Eastern churches in comparison with those of the West led some Orthodox to suspect that the WCCs decision was an attempt by the West to impose its viewpoint unilaterally on the rest of the world under the guise of ": null
    },
    {
        "ecumenism": "Ecumenism"
    },
    {
        ". However, it could also be argued that it is fair to ask a significant change of Eastern Christians, as they would be simply making the same substantial changes the various Western Churches have already made in 1582 and subsequent years so as to bring the calendar and Easter more in line with the seasons.         In 2008 and 2009, there was a new attempt to reach a consensus on a unified date on the part of Catholic, Orthodox and Protestant leaders.   This effort largely relies on earlier work carried out during the 1997 Aleppo conference.  It was organized by academics working at the Institute of Ecumenical Studies of ": null
    },
    {
        "Lviv University": "Lviv University"
    },
    {
        ".      Part of this attempt was reportedly influenced by ecumenical efforts in Syria and Lebanon, where the ": null
    },
    {
        "Greek-Melkite Church": "Melkite Greek Catholic Church"
    },
    {
        " has played an important role in improving ties with the Orthodox.   There is also a series of apparition phenomena known as ": null
    },
    {
        "Our Lady of Soufanieh": "Our Lady Of Soufanieh"
    },
    {
        " that has urged for a common date of Easter.          In May 2014, on the anniversary of the meeting between himself and Pope Francis, ": null
    },
    {
        "Coptic": "Coptic Orthodox"
    },
    {
        " Pope Tawadros II": "Pope Tawadros Ii"
    },
    {
        " wrote a letter to Pope Francis asking for him to consider making renewed effort at a unified date for Easter. , ": null
    },
    {
        "Catholic News Agency": "Catholic News Agency"
    },
    {
        ", 19 June 2015, accessed 21 June 2015     In response, on 12 June 2015, Catholic ": null
    },
    {
        "Pope Francis": "Pope Francis"
    },
    {
        " remarked to the ": null
    },
    {
        "International Catholic Charismatic Renewal Services": "Catholic Charismatic Renewal"
    },
    {
        " 3rd World Retreat of Priests at the ": null
    },
    {
        "Basilica of Saint John Lateran": "Basilica Of Saint John Lateran"
    },
    {
        " in ": null
    },
    {
        "Rome": "Rome"
    },
    {
        " that we have to come to an agreement for a common date on Easter, the date calculated under the Orthodox churches ": null
    },
    {
        "Gregorian Calendar": "Gregorian Calendar"
    },
    {
        ". , an historian, writing in the Vatican daily newspaper ": null
    },
    {
        "LOsservatore Romano": "Losservatore Romano"
    },
    {
        ", said the Pope is offering this initiative to change the date of Easter as a gift of unity with the other Christian churches adding that a common date for Easter would encourage reconciliation between the Christian churches and …a sort of making sense out of the calendar . A week later ": null
    },
    {
        "Aphrem II": "Aphrem Ii"
    },
    {
        ", the ": null
    },
    {
        "Syriac Orthodox": "Syriac Orthodox Church"
    },
    {
        " Patriarch of Antioch": "Patriarch Of Antiochcurrent Patriarchs"
    },
    {
        ", met with Pope Francis and noted that the celebration of Easter on two different dates is a source of great discomfort and weakens the common witness of the church in the world.      In January 2016, the ": null
    },
    {
        "Archbishop of Canterbury": "Archbishop Of Canterbury"
    },
    {
        " Justin Welby": "Justin Welby"
    },
    {
        " announced that he on behalf of the ": null
    },
    {
        "Anglican Communion": "Anglican Communion"
    },
    {
        " had joined discussions with Catholic, Coptic and Orthodox representatives over a fixed date for Easter, and that he hoped it would happen within the next five to ten years.  Welby has suggested that Easter be fixed on either the second or third Sunday of April relative to the Gregorian calendar.  This proposal remains to be approved, especially by Eastern churches which currently determine Easter using the Julian calendar.     According to ": null
    },
    {
        "international standards": "Iso Week Date"
    },
    {
        ", Easter Sunday ends the week containing Good Friday and the week of the second Sunday in April has the ordinal number 14 or 15 , hence the third Sunday is one respective week later. There currently is no public proposal under discussion that used a fixed ": null
    },
    {
        "week": "Week"
    }
]