[
    {
        "                                 Reggae  is a ": null
    },
    {
        "music genre": "Music Genre"
    },
    {
        " that originated in ": null
    },
    {
        "Jamaica": "Jamaica"
    },
    {
        " in the late 1960s. The term also denotes the modern popular music of Jamaica and its ": null
    },
    {
        "diaspora": "Jamaican Diaspora"
    },
    {
        ". Stephen Davis. Reggae. Grove Music Online. Oxford Music Online. Oxford University Press. Web.16 Feb. 2016. A 1968 single by ": null
    },
    {
        "Toots and the Maytals": "Toots And The Maytals"
    },
    {
        ", ": null
    },
    {
        "Do the Reggay": "Do The Reggay"
    },
    {
        " was the first popular song to use the word reggae , effectively naming the genre and introducing it to a global audience.   While sometimes used in a broad sense to refer to most types of popular ": null
    },
    {
        "Jamaican dance music": "Music Of Jamaica"
    },
    {
        ", the term reggae more properly denotes a particular music style that was strongly influenced by traditional ": null
    },
    {
        "mento": "Mento"
    },
    {
        " as well as American ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        " and ": null
    },
    {
        "rhythm and blues": "Rhythm And Blues"
    },
    {
        ", especially the New Orleans R & B practiced by ": null
    },
    {
        "Fats Domino": "Fats Domino"
    },
    {
        " and ": null
    },
    {
        "Allen Toussaint": "Allen Toussaint"
    },
    {
        ", and evolved out of the earlier genres ": null
    },
    {
        "ska": "Ska"
    },
    {
        " and ": null
    },
    {
        "rocksteady": "Rocksteady"
    },
    {
        ".  Reggae usually relates news, social gossip, and political comment. Reggae spread into a commercialized jazz field, being known first as Rudie Blues , then Ska , later Blue Beat , and Rock Steady . Reggae. The Oxford Dictionary of Music, 2nd ed. rev. Ed. Michael Kennedy. Oxford Music Online.Oxford University Press. Web. 16 Feb. 2016. It is instantly recognizable from the counterpoint between the bass and drum downbeat, and the offbeat rhythm section. The immediate origins of reggae were in ska and rocksteady; from the latter, reggae took over the use of the bass as a percussion instrument. Wilton, Peter. reggae. The Oxford Companion to Music. Ed. Alison Latham. Oxford Music Online.Oxford University Press. Web. 16 Feb. 2016.     Reggae is deeply linked to the ": null
    },
    {
        "Rastafari": "Rastafari"
    },
    {
        ", an ": null
    },
    {
        "Afrocentric": "Afrocentrism"
    },
    {
        " religion which developed in Jamaica in the 1930s, aiming at promoting ": null
    },
    {
        "Pan Africanism": "Pan-Africanism"
    },
    {
        ".    Soon after the ": null
    },
    {
        "Rastafari": "Rastafari"
    },
    {
        "an movement appeared, the international popularity of reggae music became associated with and increased the visibility of Rastafarianism spreading the ": null
    },
    {
        "Rastafari": "Rastafari"
    },
    {
        " gospel throughout the world. Reggae music is an important means of transporting vital messages of ": null
    },
    {
        "Rastafarianism": "Rastafarianism"
    },
    {
        ". The musician becomes the messenger, and as Rastafarians see it, the soldier and the musician are tools for change.      Stylistically, reggae incorporates some of the musical elements of ": null
    },
    {
        "rhythm and blues": "Rhythm And Blues"
    },
    {
        ", ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        ", ": null
    },
    {
        "mento": "Mento"
    },
    {
        " ,  calypso, Anderson, Rick. Reggae Music: A History and Selective Discography”. Notes 61.1 : 206–214. and also draws influence from traditional African folk rhythms. One of the most easily recognizable elements is offbeat rhythms; staccato chords played by a guitar or piano on the offbeats of the measure. The tempo of reggae is usually slower paced than both ska and rocksteady.  The concept of ": null
    },
    {
        "call and response": "Call And Response"
    },
    {
        " can be found throughout reggae music.The genre of reggae music is led by the drum and bass.    Some key players in this sound are Jackie Jackson from ": null
    },
    {
        "Toots and the Maytals": "Toots And The Maytals"
    },
    {
        ",  ": null
    },
    {
        "Carlton Barrett": "Carlton Barrett"
    },
    {
        " from ": null
    },
    {
        "Bob Marley and the Wailers": "Bob Marley And The Wailers"
    },
    {
        ",  ": null
    },
    {
        "Lloyd Brevett": "Lloyd Brevett"
    },
    {
        " from ": null
    },
    {
        "The Skatalites": "The Skatalites"
    },
    {
        ",  ": null
    },
    {
        "Paul Douglas": "Paul Douglas"
    },
    {
        " from ": null
    },
    {
        "Toots and the Maytals": "Toots And The Maytals"
    },
    {
        ",  ": null
    },
    {
        "Lloyd Knibb": "Lloyd Knibb"
    },
    {
        " from ": null
    },
    {
        "The Skatalites": "The Skatalites"
    },
    {
        ", Lloyd Knibb revolutionised Jamaican drumming, says PJ . Jamaica Observer. Web. May 27, 2011.  Retrieved November 22, 2016. ": null
    },
    {
        "Winston Grennan": "Winston Grennan"
    },
    {
        ",  ": null
    },
    {
        "Sly Dunbar": "Sly Dunbar"
    },
    {
        ",  and Anthony Benbow Creary from ": null
    },
    {
        "The Upsetters": "The Upsetters"
    },
    {
        ".  The ": null
    },
    {
        "bass guitar": "Bass Guitar"
    },
    {
        " often plays the dominant role in reggae. The bass sound in reggae is thick and heavy, and ": null
    },
    {
        "equalized": "Equalization"
    },
    {
        " so the upper frequencies are removed and the lower frequencies emphasized. The ": null
    },
    {
        "guitar": "Guitar"
    },
    {
        " in reggae usually plays on the off beat of the rhythm. It is common for reggae to be sung in ": null
    },
    {
        "Jamaican Patois": "Jamaican Patois"
    },
    {
        ", ": null
    },
    {
        "Jamaican English": "Jamaican English"
    },
    {
        ", and ": null
    },
    {
        "Iyaric": "Iyaric"
    },
    {
        " dialects. Reggae is noted for its tradition of social criticism and religion in its lyrics,  although many reggae songs discuss lighter, more personal subjects, such as love and socializing.     Reggae has spread to many countries across the world, often incorporating local instruments and fusing with other genres. ": null
    },
    {
        "Reggae en Español": "Reggae En Español"
    },
    {
        " spread from the Spanish speaking Central American country of Panama to the mainland South American countries of ": null
    },
    {
        "Venezuela": "Venezuela"
    },
    {
        " and ": null
    },
    {
        "Guyana": "Guyana"
    },
    {
        " then to the rest of South America. ": null
    },
    {
        "Caribbean music in the United Kingdom": "Caribbean Music In The United Kingdom"
    },
    {
        ", including reggae, has been popular since the late 1960s, and has evolved into several subgenres and fusions. Many reggae artists began their careers in the UK, and there have been a number of European artists and bands drawing their inspiration directly from Jamaica and the Caribbean community in Europe. Reggae in Africa was boosted by the visit of ": null
    },
    {
        "Bob Marley": "Bob Marley"
    },
    {
        " to Zimbabwe in 1980. In Jamaica, authentic reggae is one of the biggest sources of income. Bennetzen, Jørgen, and Kirsten Maegaard. Reggae . Fontes Artis Musicae 29.4 : 182–186.       The 1967 edition of the Dictionary of Jamaican English  lists reggae as a recently estab. sp. for rege , as in rege-rege, a word that can mean either rags, ragged clothing or a quarrel, a row . 1967, Dictionary of Jamaican English,  Reggae as a musical term first appeared in print with the 1968 rocksteady hit ": null
    },
    {
        "Do the Reggay": "Do The Reggay"
    },
    {
        " by ": null
    },
    {
        "The Maytals": "Toots  &  The Maytals"
    },
    {
        " which named the genre of Reggae for the world.     Reggae historian ": null
    },
    {
        "Steve Barrow": "Steve Barrow"
    },
    {
        " credits ": null
    },
    {
        "Clancy Eccles": "Clancy Eccles"
    },
    {
        " with altering the ": null
    },
    {
        "Jamaican patois": "Jamaican Patois"
    },
    {
        " word streggae into reggae. However, ": null
    },
    {
        "Toots Hibbert": "Toots Hibbert"
    },
    {
        " said:     Theres a word we used to use in Jamaica called streggae. If a girl is walking and the guys look at her and say Man, shes streggae it means she dont dress well, she look raggedy. The girls would say that about the men too. This one morning me and my two friends were playing and I said, OK man, lets do the reggay. It was just something that came out of my mouth. So we just start singing Do the reggay, do the reggay and created a beat. People tell me later that we had given the sound its name. Before that people had called it blue-beat and all kind of other things. Now its in the Guinness World of Records. Sturges, Fiona   ,  The Independent , 4 June 2004, retrieved 11 December 2009; cf. many similar statements by Hibbert in recent years. In earlier interviews, Hibbert used to claim the derivation was from English regular, in reference to the beat.     ": null
    },
    {
        "Bob Marley": "Bob Marley"
    },
    {
        " claimed that the word reggae came from a Spanish term for the kings music .  The liner notes of To the King, a compilation of Christian gospel reggae, suggest that the word reggae was derived from the Latin regi meaning to the king .              Reggaes direct origins are in the ": null
    },
    {
        "ska": "Ska"
    },
    {
        " and ": null
    },
    {
        "rocksteady": "Rocksteady"
    },
    {
        " of 1960s Jamaica, strongly influenced by traditional Caribbean ": null
    },
    {
        "mento": "Mento"
    },
    {
        " and ": null
    },
    {
        "calypso music": "Calypso Music"
    },
    {
        ", as well as American ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        " and ": null
    },
    {
        "rhythm and blues": "Rhythm And Blues"
    },
    {
        ". Ska was originally a generic title for Jamaican music recorded between 1961 and 1967 and emerged from Jamaican R & B, which was based largely on American R & B and doo-wop. Ska. Encyclopedia of Popular Music, 4th ed. Ed. Colin Larkin. Oxford Music Online. Oxford University Press. Web. 16 Feb. 2016. Rastafari entered some countries primarily through reggae music; thus, the movement in these places is more stamped by its origins in reggae music and social milieu. Salter, Richard C.. Sources and Chronology in Rastafari Origins . Nova Religio: The Journal of Alternative and Emergent Religions 9.1 : 5–31. The ": null
    },
    {
        "Rastafari movement": "Rastafari Movement"
    },
    {
        " was a significant influence on reggae, with ": null
    },
    {
        "Rasta": "Rastafarian"
    },
    {
        " drummers like ": null
    },
    {
        "Count Ossie": "Count Ossie"
    },
    {
        " taking part in seminal recordings.  One of the predecessors of reggae drumming is the ": null
    },
    {
        "Nyabinghi rhythm": "Nyabinghi Rhythm"
    },
    {
        ", a style of ritual drumming performed as a communal meditative practice in the Rastafarian life.      In the latter half of the 20th century, ": null
    },
    {
        "phonograph records": "Phonograph"
    },
    {
        " became of central importance to the Jamaican music industry, playing a significant cultural and economic role in the development of reggae music.  In the early 1950s , Jamaican entrepreneurs began issuing 78s but this format would soon be superseded by the 7 single, first released in 1949.  In 1951 the first recordings of mento music were released as singles and showcased two styles of mento: an acoustic rural style, and a jazzy pop style. Garnice, Michael. Bob Marley and the Wailers Mento Roots. Beat 25.2 : p.50. Other 7 singles to appear in Jamaica around this time were covers of popular American R & B hits, made by Kingston ": null
    },
    {
        "sound system": "Sound System"
    },
    {
        " operators to be played at public dances. Meanwhile, Jamaican ": null
    },
    {
        "expatriates": "Expatriate"
    },
    {
        "started issuing 45s on small independent labels in the United Kingdom, many mastered directly from Jamaican 45s.     Ska arose in Jamaican studios in the late 1950s, developing from this mix of American R & B, ": null
    },
    {
        "mento": "Mento"
    },
    {
        " and ": null
    },
    {
        "calypso music": "Calypso Music"
    },
    {
        ".  Notable for its jazz-influenced horn riffs, ska is characterized by a quarter note ": null
    },
    {
        "walking bass": "Walking Bass"
    },
    {
        " line, guitar and piano ": null
    },
    {
        "offbeats": "On-Beat"
    },
    {
        ", and a drum pattern with cross-stick snare and bass drum on the backbeat and open hi-hat on the offbeats. When Jamaica gained independence in 1962, ska became the music of choice for young Jamaicans seeking music that was their own. Ska also became popular among ": null
    },
    {
        "mods": "Mod"
    },
    {
        " in Britain.     In the mid-1960s, ska gave rise to ": null
    },
    {
        "rocksteady": "Rocksteady"
    },
    {
        ", a genre slower than ska featuring more romantic lyrics and less prominent horns.   Theories abound as to why Jamaican musicians slowed the ska tempo to create rocksteady; one is that the singer Hopeton Lewis was unable to sing his hit song Take It Easy at a ska tempo. The name rocksteady was codified after the release of a single by ": null
    },
    {
        "Alton Ellis": "Alton Ellis"
    },
    {
        ". Many rocksteady rhythms later were used as the basis of reggae recordings, whose slower tempos allowed for the double skank guitar strokes on the offbeat.       Reggae developed from ": null
    },
    {
        "ska": "Ska"
    },
    {
        " and ": null
    },
    {
        "rocksteady": "Rocksteady"
    },
    {
        " in the late 1960s. Larry And Alvins Nanny Goat and the Beltones’ No More Heartaches were among the songs in the genre. The beat was distinctive from rocksteady in that it dropped any of the pretensions to the smooth, soulful sound that characterized slick American R & B, and instead was closer in kinship to US southern funk, being heavily dependent on the rhythm section to drive it along. Reggaes great advantage was its almost limitless flexibility: from the early, jerky sound of Lee Perry’s People Funny Boy , to the uptown sounds of Third World’s Now That We’ve Found Love , it was an enormous leap through the years and styles, yet both are instantly recognizable as reggae. Reggae. Encyclopedia of Popular Music, 4th ed. Ed. Colin Larkin. Oxford Music Online. Oxford University Press. Web. 16 Feb. 2016. The shift from rocksteady to reggae was illustrated by the organ ": null
    },
    {
        "shuffle": "Swung Note"
    },
    {
        " pioneered by Jamaican musicians like ": null
    },
    {
        "Jackie Mittoo": "Jackie Mittoo"
    },
    {
        " and Winston Wright and featured in transitional singles Say What Youre Saying by ": null
    },
    {
        "Eric Monty Morris": "Eric   Monty   Morris"
    },
    {
        " and People Funny Boy by ": null
    },
    {
        "Lee Scratch Perry": "Lee   Scratch   Perry"
    },
    {
        ".          Early 1968 was when the first bona fide reggae records were released: Nanny Goat by ": null
    },
    {
        "Larry Marshall": "Larry Marshall"
    },
    {
        " and No More Heartaches by The Beltones. That same year, the newest Jamaican sound began to spawn big-name imitators in other countries. American artist ": null
    },
    {
        "Johnny Nashs": "Johnny Nash"
    },
    {
        "1968 hit ": null
    },
    {
        "Hold Me Tight": "Hold Me Tight"
    },
    {
        " has been credited with first putting reggae in the American listener charts. Around the same time, reggae influences were starting to surface in ": null
    },
    {
        "rock": "Rock Music"
    },
    {
        " and ": null
    },
    {
        "pop music": "Pop Music"
    },
    {
        ", one example being 1968s ": null
    },
    {
        "Ob-La-Di, Ob-La-Da": "Ob-La-Di, Ob-La-Da"
    },
    {
        " by ": null
    },
    {
        "The Beatles": "The Beatles"
    },
    {
        ". Kevin OBrien Chang, 1998, Reggae Routes, p. 44.     ": null
    },
    {
        "The Wailers": "The Wailers"
    },
    {
        ", a band started by ": null
    },
    {
        "Bob Marley": "Bob Marley"
    },
    {
        ", ": null
    },
    {
        "Peter Tosh": "Peter Tosh"
    },
    {
        " and ": null
    },
    {
        "Bunny Wailer": "Bunny Wailer"
    },
    {
        " in 1963, is perhaps the most recognized band that made the transition through all three stages of early Jamaican popular music: ska, rocksteady and reggae. Over a dozen Wailers songs are based on or use a line from Jamaican mento songs. Other significant ska artists who made the leap to reggae include ": null
    },
    {
        "Prince Buster": "Prince Buster"
    },
    {
        ", ": null
    },
    {
        "Desmond Dekker": "Desmond Dekker"
    },
    {
        ", ": null
    },
    {
        "Ken Boothe": "Ken Boothe"
    },
    {
        ", and ": null
    },
    {
        "Millie Small": "Millie Small"
    },
    {
        ", best known for her 1964 blue-beat/ska ": null
    },
    {
        "cover version": "Cover Version"
    },
    {
        " of ": null
    },
    {
        "My Boy Lollipop": "My Boy Lollipop"
    },
    {
        " which was a smash hit internationally.      Notable Jamaican producers influential in the development of ska into rocksteady and reggae include: ": null
    },
    {
        "Coxsone Dodd": "Coxsone Dodd"
    },
    {
        ", ": null
    },
    {
        "Lee Scratch Perry": "Lee   Scratch   Perry"
    },
    {
        ", ": null
    },
    {
        "Leslie Kong": "Leslie Kong"
    },
    {
        ", ": null
    },
    {
        "Duke Reid": "Duke Reid"
    },
    {
        ", ": null
    },
    {
        "Joe Gibbs": "Joe Gibbs"
    },
    {
        " and ": null
    },
    {
        "King Tubby": "King Tubby"
    },
    {
        ". ": null
    },
    {
        "Chris Blackwell": "Chris Blackwell"
    },
    {
        ", who founded ": null
    },
    {
        "Island Records": "Island Records"
    },
    {
        " in Jamaica in 1960, Sexton, Paul. A Legend in His Own Time. Billboard – The International Newsweekly of Music, Video and Home Entertainment 113.39 : p. C-8. relocated to England in 1962, where he continued to promote Jamaican music. He formed a partnership with Lee Gopthals ": null
    },
    {
        "Trojan Records": "Trojan Records"
    },
    {
        " in 1968, which released reggae in the UK until bought by Saga records in 1974.          Reggaes influence bubbled to the top of the U.S. ": null
    },
    {
        "Billboard Hot 100": "Billboard Hot 100"
    },
    {
        " charts in late 1972. First ": null
    },
    {
        "Three Dog Night": "Three Dog Night"
    },
    {
        " hit No. 1 in September with a cover of ": null
    },
    {
        "the Maytones": "The Maytones"
    },
    {
        " version of ": null
    },
    {
        "Black and White": "Black And White"
    },
    {
        " . Then ": null
    },
    {
        "Johnny Nash": "Johnny Nash"
    },
    {
        " was at No. 1 for four weeks in November with ": null
    },
    {
        "I Can See Clearly Now": "I Can See Clearly Now"
    },
    {
        " . ": null
    },
    {
        "Paul Simons": "Paul Simon"
    },
    {
        "single ": null
    },
    {
        "Mother And Child Reunion": "Mother And Child Reunion"
    },
    {
        " – a track which he recorded in Kingston, Jamaica with ": null
    },
    {
        "Jimmy Cliffs": "Jimmy Cliff"
    },
    {
        "backing group – was ranked by Billboard as the No. 57 song of 1972.     In 1973, the film  The Harder They Come  starring ": null
    },
    {
        "Jimmy Cliff": "Jimmy Cliff"
    },
    {
        " was released and introduced Jamaican music to cinema audiences outside Jamaica. Steffens, Roger. ‘The Harder They Come: 30 Years After.” The Beat 22.1 : p. 36 Though the film achieved cult status its limited appeal meant that it had a smaller impact than ": null
    },
    {
        "Eric Claptons": "Eric Clapton"
    },
    {
        "1974 cover of Bob Marleys ": null
    },
    {
        "I Shot the Sheriff": "I Shot The Sheriff"
    },
    {
        " which made it onto the playlists of mainstream rock and pop radio stations worldwide. Claptons I Shot The Sheriff used modern rock production and recording techniques and faithfully retained most of the original reggae elements; it was a breakthrough pastiche devoid of any parody and played an important part in bringing the music of Bob Marley to a wider rock audience. By the mid-1970s, authentic reggae dub plates and specials were getting some exposure in the UK on ": null
    },
    {
        "John Peels": "John Peel"
    },
    {
        "radio show, who promoted the genre for the rest of his career. Gaar, Gillian G. The Beat goes on. Goldmine 38.14 : p. 26-29 Around the same time, British filmmaker ": null
    },
    {
        "Jeremy Marre": "Jeremy Marre"
    },
    {
        " documented the Jamaican music scene in Roots Rock Reggae, capturing the heyday of ": null
    },
    {
        "Roots reggae": "Roots Reggae"
    },
    {
        ". RHYTHM OF RESISTANCE ROOTS, ROCK, REGGAE SALSA KONKOMBE   The Beat8.3 : 59–62.     While the quality of Reggae records produced in Jamaica took a turn for the worse following the oil crisis of the 1970s, reggae produced elsewhere began to flourish.  In the late 1970s and early 1980s, the UK ": null
    },
    {
        "punk rock": "Punk Rock"
    },
    {
        " scene flourished, and reggae was a notable influence. The DJ ": null
    },
    {
        "Don Letts": "Don Letts"
    },
    {
        " would play reggae and punk tracks at clubs such as ": null
    },
    {
        "The Roxy": "The Roxy"
    },
    {
        ". Punk bands such as ": null
    },
    {
        "The Clash": "The Clash"
    },
    {
        ", ": null
    },
    {
        "The Ruts": "The Ruts"
    },
    {
        ", ": null
    },
    {
        "The Members": "The Members"
    },
    {
        " and ": null
    },
    {
        "The Slits": "The Slits"
    },
    {
        " played many reggae-influenced songs. Around the same time, reggae music took a new path in the UK; one that was created by the multiracial makeup of Englands inner cities and exemplified by groups like ": null
    },
    {
        "Steel Pulse": "Steel Pulse"
    },
    {
        ", ": null
    },
    {
        "Aswad": "Aswad"
    },
    {
        " and ": null
    },
    {
        "UB40": "Ub40"
    },
    {
        ", as well as artists such as ": null
    },
    {
        "Smiley Culture": "Smiley Culture"
    },
    {
        " and ": null
    },
    {
        "Carroll Thompson": "Carroll Thompson"
    },
    {
        ". The Jamaican ghetto themes in the lyrics were replaced with UK ": null
    },
    {
        "inner city": "Inner City"
    },
    {
        " themes, and Jamaican ": null
    },
    {
        "patois": "Patois"
    },
    {
        " became intermingled with ": null
    },
    {
        "Cockney": "Cockney"
    },
    {
        " slang. In South London around this time, a new subgenre of ": null
    },
    {
        "Lovers Rock": "Lovers Rock"
    },
    {
        ", was being created. Unlike the Jamaican music of the same name which was mainly dominated by male artists such as ": null
    },
    {
        "Gregory Isaacs": "Gregory Isaacs"
    },
    {
        ", the South London genre was led by female singers like Thompson and ": null
    },
    {
        "Janet Kay": "Janet Kay"
    },
    {
        ". The UK Lovers Rock had a softer and more commercial sound.Other reggae artists who enjoyed international appeal in the early 1980s include ": null
    },
    {
        "Third World": "Third World"
    },
    {
        ", ": null
    },
    {
        "Black Uhuru": "Black Uhuru"
    },
    {
        " and ": null
    },
    {
        "Sugar Minott": "Sugar Minott"
    },
    {
        ". The Grammy Awards introduced the ": null
    },
    {
        "Grammy Award for Best Reggae Album": "Grammy Award For Best Reggae Album"
    },
    {
        " category in 1985.     Women also play a role in the reggae music industry personnel such as Olivia Grange, president of Specs-Shang Musik; Trish Farrell, president of Island/Jamaica; Lisa Cortes, president of Loose Cannon; Jamaican-American Sharon Gordon, who has worked in the independent reggae music industry. Oumano, E. . Women increase number, scope of roles in reggae.Billboard – the International Newsweekly of Music, Video and Home Entertainment, 108, 1–1, 37.         Jamaican Prime Minister Bruce Golding made February 2008 the first annual Reggae Month in Jamaica. To celebrate, the Recording Industry Association of Jamaica held its first Reggae Academy Awards on February 24, 2008. In addition, Reggae Month included a six-day Global Reggae conference, a reggae film festival, two radio station award functions, and a concert tribute to the late Dennis Brown, who Bob Marley cited as his favorite singer. On the business side, RIAJam held events focused on reggaes employment opportunities and potential international revenue. . Meschino, P. . Music: Reggae – reclaiming reggae revenue. Billboard – the International Newsweekly of Music, Video and Home Entertainment, 120, 36. Reggae Month 2019 in Jamaica was welcomed with multiple events ranging from corporate reggae functions to major celebrations in honour of Bob Marleys Birthday on February 6 to a tribute concert in honour of Dennis Brown on February 24 along with a sold out concert by 2019 Reggae Grammy nominated artiste Protoje for his A Matter of Time Live held at Hope Gardens in Kingston on February 23.     In November 2018 reggae music of Jamaica was added to the ": null
    },
    {
        "UNESCOs": "Unesco"
    },
    {
        " Representative List of the Intangible Cultural Heritage of Humanity": "Unesco Intangible Cultural Heritage Lists"
    },
    {
        " the decision recognised reggaes contribution to international discourse on issues of injustice, resistance, love and humanity underscores the dynamics of the element as being at once cerebral, socio-political, sensual and spiritual.               Stylistically, reggae incorporates some of the musical elements of ": null
    },
    {
        "rhythm and blues": "Rhythm And Blues"
    },
    {
        " , ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        ", ": null
    },
    {
        "mento": "Mento"
    },
    {
        ", ": null
    },
    {
        "calypso": "Calypso Music"
    },
    {
        ", African, and Latin American music, as well as other genres. Reggae scenes consist of two guitars, one for rhythm and one for lead—drums, congas, and keyboards, with a couple vocalists. Lynn, V. M. . Sound. Chicago Tribune      Reggae is played in ": null
    },
    {
        " time": "Time Signature"
    },
    {
        " because the symmetrical rhythmic pattern does not lend itself to other time signatures such as . One of the most easily recognizable elements is offbeat rhythms; staccato chords played by a guitar or piano on the offbeats of the measure, often referred to as the ": null
    },
    {
        "skank": "Ska Stroke"
    },
    {
        ". Hombach, Jean-Pierre . Bob Marley the Father of Music, p.14. . Reggae is most easily recognized by...the skank.     This rhythmic pattern accents the second and fourth beats in each ": null
    },
    {
        "bar": "Bar"
    },
    {
        " and combines with the drums emphasis on beat three to create a unique sense of phrasing. The reggae offbeat can be counted so that it falls between each count as an and or counted as a half-time feel at twice the tempo so it falls on beats 2 and 4. This is in contrast to the way most other popular genres focus on beat one, the downbeat . Levitin, Daniel J. .  This Is Your Brain On Music , pp. 113–114 .     The tempo of reggae is usually slower than both ": null
    },
    {
        "ska": "Ska"
    },
    {
        " and ": null
    },
    {
        "rocksteady": "Rocksteady"
    },
    {
        ". It is this slower tempo, the guitar/piano offbeats, the emphasis on the third beat, and the use of ": null
    },
    {
        "syncopated": "Syncopation"
    },
    {
        ", melodic bass lines that differentiate reggae from other music, although other musical styles have incorporated some of these innovations.     Harmonically the music is essentially the same as any other modern popular genre with a tendency to make use of simple ": null
    },
    {
        "chord": "Chord"
    },
    {
        " progressions. Reggae sometimes uses the dominant chord in its minor form therefore never allowing a perfect cadence to be sounded; this lack of resolution between the tonic and the dominant imparts a sense of movement without rest and harmonic ambiguity. Extended chords like the ": null
    },
    {
        "major seventh chord": "Major Seventh Chord"
    },
    {
        "  and ": null
    },
    {
        "minor seventh chord": "Minor Seventh Chord"
    },
    {
        " are used though suspended chords or diminished chords are rare. Minor keys are commonly used especially with the minor chord forms of the subdominant and dominant chord . A simple progression borrowed from ": null
    },
    {
        "rhythm and blues": "Rhythm And Blues"
    },
    {
        " and ": null
    },
    {
        "soul music": "Soul Music"
    },
    {
        " is the tonic chord followed by the minor supertonic chord with the two chords repeated continuously to form a complete verse .     The concept of call and response can be found throughout reggae music, in the vocals but also in the way parts are composed and arranged for each instrument. The emphasis on the third beat of the bar also results in a different sense of musical phrasing, with bass lines and melody lines often emphasizing what might be considered pick up notes in other genres.       A standard drum kit is generally used in reggae, but the ": null
    },
    {
        "snare drum": "Snare Drum"
    },
    {
        " is often tuned very high to give it a ": null
    },
    {
        "timbales": "Timbales"
    },
    {
        "-type sound. Some reggae drummers use an additional timbale or high-tuned snare to get this sound. Cross-stick technique on the snare drum is commonly used, and ": null
    },
    {
        "tom-tom drums": "Tom-Tom Drums"
    },
    {
        " are often incorporated into the drumbeat itself.      Reggae ": null
    },
    {
        "drumbeats": "Drumbeats"
    },
    {
        " fall into three main categories:  One drop , Rockers, and Steppers. With the One drop, the emphasis is entirely on the backbeat . Beat one is empty except for a closed high hat commonly used, which is unusual in popular music. There is some controversy about whether reggae should be counted so that this beat falls on two and four, or whether it should be counted twice as fast, so it falls on three. An example played by Barrett can be heard in the ": null
    },
    {
        "Bob Marley and the Wailers": "Bob Marley And The Wailers"
    },
    {
        " song One Drop . Barrett often used an unusual ": null
    },
    {
        "triplet": "Irrational Rhythm"
    },
    {
        " cross-rhythm": "Polyrhythm"
    },
    {
        " on the ": null
    },
    {
        "hi-hat": "Hi-Hat"
    },
    {
        ", which can be heard on many recordings by Bob Marley and the Wailers, such as Running Away on the  Kaya  album.        An emphasis on the backbeat is found in all reggae drumbeats, but with the Rockers beat, the emphasis is on all four beats of the bar . This beat was pioneered by ": null
    },
    {
        "Sly and Robbie": "Sly And Robbie"
    },
    {
        ", who later helped create the Rub-a-Dub sound that greatly influenced dancehall. Sly has stated he was influenced to create this style by listening to American drummer Earl Young as well as other disco and R & B drummers in the early to mid-1970s, as stated in the book Wailing Blues . The prototypical example of the style is found in ": null
    },
    {
        "Sly Dunbars": "Sly Dunbar"
    },
    {
        "drumming on Right Time by the Mighty Diamonds. The Rockers beat is not always straightforward, and various ": null
    },
    {
        "syncopations": "Syncopation"
    },
    {
        "are often included. An example of this is the ": null
    },
    {
        "Black Uhuru": "Black Uhuru"
    },
    {
        " song Sponji Reggae .     In Steppers, the bass drum plays every quarter beat of the bar, giving the beat an insistent drive. An example is Exodus by Bob Marley and the Wailers. Another common name for the Steppers beat is the four on the floor . ": null
    },
    {
        "Burning Spears": "Burning Spear"
    },
    {
        "1975 song Red, Gold, and Green is one of the earliest examples. The Steppers beat was adopted by some ": null
    },
    {
        "2 Tone": "2 Tone"
    },
    {
        " ska": "Ska"
    },
    {
        " revival bands of the late 1970s and early 1980s.     An unusual characteristic of reggae drumming is that the drum fills often do not end with a climactic cymbal. A wide range of other percussion instrumentation are used in reggae. ": null
    },
    {
        "Bongos": "Bongo Drum"
    },
    {
        " are often used to play free, improvised patterns, with heavy use of African-style ": null
    },
    {
        "cross-rhythm": "Cross-Rhythm"
    },
    {
        "s. Cowbells, ": null
    },
    {
        "claves": "Claves"
    },
    {
        " and shakers tend to have more defined roles and a set pattern.     Reggae drummers often involved these three tips for other reggae performers: go for open, ringing tones when playing ska and rocksteady, use any available material to stuff the bass drum so that it tightens up the kick to a deep, punchy thud, and go without a ride cymbal, focusing on the hi-hat for timekeeping and thin crashes with fast decay for accents. Dawson, M. . Jamaican drum sounds. Modern Drummer, 36, 70.          The ": null
    },
    {
        "bass guitar": "Bass Guitar"
    },
    {
        " often plays the dominant role in reggae, and the drum and bass is often the most important part of what is called, in Jamaican music, a  riddim  , a piece of music thats used repeatedly by different artists to write and record songs with. Literally hundreds of reggae singers have released different songs recorded over the same rhythm. The central role of the bass can be particularly heard in ": null
    },
    {
        "dub music": "Dub Music"
    },
    {
        " – which gives an even bigger role to the drum and bass line, reducing the vocals and other instruments to peripheral roles.     The bass sound in reggae is thick and heavy, and ": null
    },
    {
        "equalized": "Equalization"
    },
    {
        " so the upper frequencies are removed and the lower frequencies emphasized. The bass line is often a repeated two or four bar ": null
    },
    {
        "riff": "Riff"
    },
    {
        " when simple chord progressions are used. The simplest example of this might be Robbie Shakespeares bass line for the Black Uhuru hit Shine Eye Gal . In the case of more complex harmonic structures, such as ": null
    },
    {
        "John Holts": "John Holt"
    },
    {
        "version of Stranger in Love , these simpler patterns are altered to follow the chord progression either by directly moving the pattern around or by changing some of the interior notes in the phrase to better support the chords.          The ": null
    },
    {
        "guitar": "Guitar"
    },
    {
        " in reggae usually plays on the off beat of the rhythm. So if one is counting in  time and counting 1 and 2 and 3 and 4 and ... , one would play a downstroke on the and part of the beat.  A musical figure known as ": null
    },
    {
        "skank": "Skank"
    },
    {
        " or the bang has a very dampened, short and scratchy ": null
    },
    {
        "chop": "Chop Chord"
    },
    {
        " sound, almost like a percussion instrument. Sometimes a double chop is used when the guitar still plays the off beats, but also plays the following eighth-note beats on the up-stroke. An example is the intro to ": null
    },
    {
        "Stir It Up": "Stir It Up"
    },
    {
        " by The Wailers. Artist and producer ": null
    },
    {
        "Derrick Harriott": "Derrick Harriott"
    },
    {
        " says, What happened was the musical thing was real widespread, but only among a certain sort of people. It was always a down-town thing, but more than just hearing the music. The equipment was so powerful and the vibe so strong that we feel it. Bradley, Lloyd. This Is Reggae Music:The Story Of Jamaicas Music. New York : Grove Press, 2001       From the earliest days of Ska recordings, a piano was used to double the rhythm guitars skank, playing the ": null
    },
    {
        "chords": "Chord"
    },
    {
        " in a  staccato  style to add body, and playing occasional extra beats, runs and riffs. The piano part was widely taken over by ": null
    },
    {
        "synthesizers": "Synthesizer"
    },
    {
        "during the 1980s, although synthesizers have been used in a peripheral role since the 1970s to play incidental melodies and ": null
    },
    {
        "countermelodies": "Countermelodies"
    },
    {
        ". Larger bands may include either an additional keyboardist, to cover or replace ": null
    },
    {
        "horn": "Brass Instrument"
    },
    {
        " and ": null
    },
    {
        "melody": "Melody"
    },
    {
        " lines, or the main keyboardist filling these roles on two or more keyboards.     The reggae organ-shuffle is unique to reggae. In the original version of reggae, the drummer played a reggae groove that was used in the four bar introduction, allowing the piano to serve as a percussion instrument. Simon, A. . Jazz piano stylings: A contemporary approach. Piano Today, 26, 38. Typically, a ": null
    },
    {
        "Hammond organ": "Hammond Organ"
    },
    {
        "-style sound is used to play chords with a choppy feel. This is known as the bubble. This may be the most difficult reggae keyboard rhythm. The organ bubble can be broken down into 2 basic patterns. In the first, the 8th beats are played with a space-left-right-left-space-left-right-left pattern, where the spaces represent downbeats not played—that and the left-right-left falls on the ee-and-a, or and-2-and if counted at double time. In the second basic pattern, the left hand plays a double chop as described in the guitar section while the right hand plays longer notes on beat 2 or a syncopated pattern between the double chops. Both these patterns can be expanded on and improvised embellishments are sometimes used.       Horn sections are frequently used in reggae, often playing introductions and counter-melodies. Instruments included in a typical reggae horn section include saxophone, trumpet or trombone. In more recent times, real horns are sometimes replaced in reggae by ": null
    },
    {
        "synthesizers": "Synthesizer"
    },
    {
        "or recorded samples. The horn section is often arranged around the first horn, playing a simple melody or counter melody. The first horn is usually accompanied by the second horn playing the same melodic phrase in unison, one octave higher. The third horn usually plays the melody an octave and a fifth higher than the first horn. The horns are generally played fairly softly, usually resulting in a soothing sound. However, sometimes punchier, louder phrases are played for a more up-tempo and aggressive sound.          The vocals in reggae are less of a defining characteristic of the genre than the instrumentation and rhythm, as almost any song can be performed in a reggae style. However, it is very common for reggae to be sung in ": null
    },
    {
        "Jamaican Patois": "Jamaican Patois"
    },
    {
        ", ": null
    },
    {
        "Jamaican English": "Jamaican English"
    },
    {
        ", and ": null
    },
    {
        "Iyaric": "Iyaric"
    },
    {
        " dialects. Vocal harmony parts are often used, either throughout the melody , or as a counterpoint to the main vocal line . More complex vocal arrangements can be found in the works of groups like ": null
    },
    {
        "The Abyssinians": "The Abyssinians"
    },
    {
        " and ": null
    },
    {
        "British": "United Kingdom"
    },
    {
        " reggae band ": null
    },
    {
        "Steel Pulse": "Steel Pulse"
    },
    {
        ".     An unusual aspect of reggae singing is that many singers use  tremolo  rather than  vibrato  . Notable exponents of this technique include ": null
    },
    {
        "Horace Andy": "Horace Andy"
    },
    {
        " and vocal group ": null
    },
    {
        "Israel Vibration": "Israel Vibration"
    },
    {
        ". The ": null
    },
    {
        "toasting": "Deejay"
    },
    {
        " vocal style is unique to reggae, originating when ": null
    },
    {
        "DJs": "Disc Jockey"
    },
    {
        " improvised spoken introductions to songs to the point where it became a distinct rhythmic vocal style, and is generally considered to be a precursor to ": null
    },
    {
        "rap": "Hip Hop Music"
    },
    {
        ". It differs from rap mainly in that it is generally melodic, while rap is generally more a spoken form without melodic content.       Reggae is noted for its tradition of social criticism in its lyrics, although many reggae songs discuss lighter, more personal subjects, such as love and socializing. Many early reggae bands covered ": null
    },
    {
        "Motown": "Motown"
    },
    {
        " or ": null
    },
    {
        "Atlantic": "Atlantic Records"
    },
    {
        " soul and ": null
    },
    {
        "funk": "Funk"
    },
    {
        " songs. Some reggae lyrics attempt to raise the political consciousness of the audience, such as by criticizing ": null
    },
    {
        "materialism": "Economic Materialism"
    },
    {
        ", or by informing the listener about controversial subjects such as ": null
    },
    {
        "Apartheid": "South Africa Under Apartheid"
    },
    {
        ". Many reggae songs promote the use of ": null
    },
    {
        "cannabis": "Cannabis"
    },
    {
        " , considered a sacrament in the ": null
    },
    {
        "Rastafari movement": "Rastafari Movementreggae"
    },
    {
        ". There are many artists who utilize religious themes in their music – whether it be discussing a specific religious topic, or simply giving praise to God . Other common socio-political topics in reggae songs include ": null
    },
    {
        "black nationalism": "Black Nationalism"
    },
    {
        ", ": null
    },
    {
        "anti-racism": "Anti-Racism"
    },
    {
        ", anti-": null
    },
    {
        "colonialism": "Colonialism"
    },
    {
        ",  ": null
    },
    {
        "anti-capitalism": "Anti-Capitalism"
    },
    {
        " and criticism of political systems and ": null
    },
    {
        " Babylon ": "Rastafarian Vocabularyother Words"
    },
    {
        ".     In recent years, Jamaican reggae musicians have used more positive themes in reggae music. The music is widely considered a treasured cultural export for Jamaica, so musicians who still desire progress for their island nation have begun focusing on themes of hopefulness, faith, and love. For elementary children, reggae songs such as Give a Little Love , One Love , or Three Little Birds , all written by Bob Marley, can be sung and enjoyed for their optimism and cheerful lyrics. Mills, Susan W. Reggae For Standards-Based Music Learning. General Music Today 17.1 : 11–17. Music Index. Web. 15 Feb. 2016.          The wide cultural exposure which has enhanced the recognizability of reggae has been achieved primarily through a corporate commercialization effected at the expense of both the lyrical and instrumental essence of the music. This process has involved coerced or voluntary assimilation of more commercially compatible characteristics, appropriation by white mainstream artists, and an overall dispersal of ideological and musical meaning and creative value.The mainstream Euro-American audience has continually demonstrated a propensity for adopting reggae-oriented material on the basis of its aesthetically pleasing surface qualities rather than for explicitly political or deeper musical content, causing authenticity problems for reggae fans. Alleyne, M. . White reggae: Cultural dilution in the record industry. Popular Music and Society, 24, 15–30.       Some dancehall and ragga artists have been criticised for ": null
    },
    {
        "homophobia": "Homophobia"
    },
    {
        ",  including threats of violence.  ": null
    },
    {
        "Buju Bantons": "Buju Banton"
    },
    {
        "song Boom Bye-Bye states that gays haffi dead . Other notable dancehall artists who have been accused of homophobia include ": null
    },
    {
        "Elephant Man": "Elephant Man"
    },
    {
        ", ": null
    },
    {
        "Bounty Killer": "Bounty Killer"
    },
    {
        " and ": null
    },
    {
        "Beenie Man": "Beenie Man"
    },
    {
        ". The controversy surrounding anti-gay lyrics has led to the cancellation of UK tours by Beenie Man and Sizzla. Toronto, Canada has also seen the cancellation of concerts due to artists such as Elephant Man and Sizzla refusing to conform to similar censorship pressures.        After lobbying from the ": null
    },
    {
        "Stop Murder Music": "Stop Murder Music"
    },
    {
        " coalition, the dancehall music industry agreed in 2005 to stop releasing songs that promote hatred and violence against gay people. Flick, Larry, , The Advocate, April 12, 2005  In June 2007, Beenie Man, ": null
    },
    {
        "Sizzla": "Sizzla"
    },
    {
        " and ": null
    },
    {
        "Capleton": "Capleton"
    },
    {
        " signed up to the Reggae Compassionate Act, in a deal brokered with top dancehall promoters and Stop Murder Music activists. They renounced homophobia and agreed to not make statements or perform songs that incite hatred or violence against anyone from any community . Five artists targeted by the anti-homophobia campaign did not sign up to the act, including Elephant Man, ": null
    },
    {
        "TOK": "T.O.K."
    },
    {
        ", Bounty Killa and ": null
    },
    {
        "Vybz Kartel": "Vybz Kartel"
    },
    {
        ".  Buju Banton and Beenie Man both gained positive press coverage around the world for publicly renouncing homophobia by signing the Reggae Compassion Act. However, both of these artists have since denied any involvement in anti-homophobia work and both deny having signed any such act.              Reggae has spread to many countries across the world, often incorporating local instruments and fusing with other genres.  In November 2018 ": null
    },
    {
        "UNESCO": "Unesco"
    },
    {
        " added the reggae music of Jamaica to the ": null
    },
    {
        "Representative List of the Intangible Cultural Heritage of Humanity": "Unesco Intangible Cultural Heritage Lists"
    },
    {
        ".            ": null
    },
    {
        "Reggae en Español": "Reggae En Español"
    },
    {
        " spread from mainland South American Caribbean from ": null
    },
    {
        "Venezuela": "Venezuela"
    },
    {
        " and ": null
    },
    {
        "Guyana": "Guyana"
    },
    {
        " to the rest of South America. It does not have any specific characteristics other than being sung in Spanish, usually by artists of Latin American origin. ": null
    },
    {
        "Samba reggae": "Samba Reggae"
    },
    {
        " originated in ": null
    },
    {
        "Brazil": "Brazil"
    },
    {
        " as a blend of ": null
    },
    {
        "samba": "Samba"
    },
    {
        " with Jamaican reggae. Reggae also has a presence in ": null
    },
    {
        "Veracruz": "Veracruz"
    },
    {
        ", ": null
    },
    {
        "Mexico": "Mexico"
    },
    {
        ". The most notable ": null
    },
    {
        "Jarocho": "Jarocho"
    },
    {
        " reggae group being Los Aguas Aguas from ": null
    },
    {
        "Xalapa": "Xalapa"
    },
    {
        ". Some of the most popular reggae groups across Latin America come from the Southern Cone, such as the Chilean band ": null
    },
    {
        "Gondwana": "Gondwana"
    },
    {
        ", and the Argentinian band Los Cafres. The Puerto Rican band ": null
    },
    {
        "Cultura Profética": "Cultura Profética"
    },
    {
        " is also widely recognized in the region. Hispanic reggae includes three elements: the incorporation of the Spanish language; the use of translations and versions based on known riddims and background music; and regional consciousness. It is a medium of rebellious contestation rising from the underground. Hispanic reggae is related to rap, sharing characteristics that can be found not only in the social conditions in which they developed in the region but also in the characteristics of social sectors and classes that welcome them. Davis, S. F. . Reggae in cuba and the hispanic caribbean: Fluctuations and representations of identities. Black Music Research Journal, 29, 25–49.     Brazilian samba-reggae utilized themes such as the ": null
    },
    {
        "civil rights movement": "Civil Rights Movement"
    },
    {
        " and the Black Soul movement, and especially the Jamaican independence movement since the 1960s and its messages in reggae and Rastafarianism. Thus, the sudden popularity of reggae music and musicians in Bahia, Brazil, was not the result of the effects of the transnational music industry, but of the need to establish cultural and political links with black communities across the Americas that had faced and were facing similar sociopolitical situations. Béhague, G. . Globalization/Modernization – rap, reggae, rock, or samba: The local and the global in brazilian popular music . Latin American Music Review/Revista De Música Latinoamericana, 27, 79–90.     Musically, it was the bloco afro ": null
    },
    {
        "Olodum": "Olodum"
    },
    {
        " and its lead percussionist, ": null
    },
    {
        "Neguinho do Samba": "Neguinho Do Samba"
    },
    {
        ", that began to combine the basic samba beat of the blocos with merengue, salsa, and reggae rhythms and debuted their experimentations in the carnival of 1986. The new toques were labeled samba-reggae and consisted basically of a pattern in which the surdo bass drums divided themselves into four or five interlocking parts.     In the state of ": null
    },
    {
        "Maranhão": "Maranhão"
    },
    {
        ", in northeastern ": null
    },
    {
        "Brazil": "Brazil"
    },
    {
        ", reggae is a very popular rhythm. ": null
    },
    {
        "São Luis": "São Luís, Maranhão"
    },
    {
        ", the state capital, is known as the Brazilian Jamaica. The city has more than 200 radiolas , name given to sound teams formed by DJs and sound systems with dozens of powerful amplifiers boxes stacked. Reggae in Maranhão has its own characteristics, such as melody and the way of dancing, as well as having its own radio and television programs. In 2018, the ": null
    },
    {
        "Reggae Museum of Maranhão": "Reggae Maranhão Museum"
    },
    {
        " was inaugurated, the second reggae museum in the world , with the objective of preserving the reggae culture history in the state.      In the United States, bands like ": null
    },
    {
        "Rebelution": "Rebelution"
    },
    {
        ", ": null
    },
    {
        "Slightly Stoopid": "Slightly Stoopid"
    },
    {
        ", ": null
    },
    {
        "Stick Figure": "Stick Figure"
    },
    {
        ", and ": null
    },
    {
        "SOJA": "Soja"
    },
    {
        " are considered progressive reggae bands sometimes referred to as ": null
    },
    {
        "Cali Reggae": "Cali Reggae"
    },
    {
        " or Pacific Dub. The American reggae scene is heavily centred in ": null
    },
    {
        "Southern California": "Southern California"
    },
    {
        ", with large scenes also in ": null
    },
    {
        "New York City": "New York City"
    },
    {
        ", ": null
    },
    {
        "Washington, D.C.": "Washington, D.C."
    },
    {
        ", ": null
    },
    {
        "Chicago": "Chicago"
    },
    {
        ", ": null
    },
    {
        "Miami": "Miami"
    },
    {
        ", and ": null
    },
    {
        "Honolulu": "Honolulu"
    },
    {
        ". For decades, Hawaiian reggae has had a big following on the Hawaiian islands and the West coast of the US.  On the east coast upstate NY has seen a rise in original roots reggae bands such as ": null
    },
    {
        "Giant Panda Guerilla Dub Squad": "Giant Panda Guerilla Dub Squad"
    },
    {
        " and ": null
    },
    {
        "John Browns Body": "John Browns Body"
    },
    {
        " who were inspired by Jamaican reggae bands that performed in the area back in the 80s and 90s.  ": null
    },
    {
        "Matisyahu": "Matisyahu"
    },
    {
        " gained prominence by blending traditional Jewish themes with reggae.  Compounding his use of the hazzan style, Matisyahus lyrics are mostly English with more than occasional use of ": null
    },
    {
        "Hebrew": "Hebrew Language"
    },
    {
        " and ": null
    },
    {
        "Yiddish": "Yiddish Language"
    },
    {
        ". There is a large Caribbean presence in ": null
    },
    {
        "Toronto": "Toronto"
    },
    {
        " and ": null
    },
    {
        "Montreal": "Montreal"
    },
    {
        ", ": null
    },
    {
        "Canada": "Canada"
    },
    {
        ", with English and French influences on the reggae genre. Canadian band ": null
    },
    {
        "Magic!s": "Magic!"
    },
    {
        "2013 single ": null
    },
    {
        "Rude": "Rude"
    },
    {
        " was an international hit.     In 2017, ": null
    },
    {
        "Toots and the Maytals": "Toots And The Maytals"
    },
    {
        " became the second reggae-based group to ever perform at the ": null
    },
    {
        "Coachella festival": "Coachella Valley Music And Arts Festival"
    },
    {
        ", after ": null
    },
    {
        "Chronixx": "Chronixx"
    },
    {
        " in 2016.          The UK was a primary destination for Caribbean people looking to emigrate as early as the 1950s. Because of this, ": null
    },
    {
        "Caribbean music in the United Kingdom": "Caribbean Music In The United Kingdom"
    },
    {
        ", including reggae, has been popular since the late 1960s, and has evolved into several subgenres and fusions. Most notable of these is ": null
    },
    {
        "lovers rock": "Lovers Rock"
    },
    {
        ", but this fusion of Jamaican music into English culture was seminal in the formation of other musical forms like ": null
    },
    {
        "drum and bass": "Drum And Bass"
    },
    {
        " and ": null
    },
    {
        "dubstep": "Dubstep"
    },
    {
        ". The UK became the base from which many Jamaican artists toured Europe and due to the large number of Jamaican musicians emigrating there, the UK is the root of the larger European scene that exists today. Many of the worlds most famous reggae artists began their careers in UK. Singer and Grammy Award-winning reggae artist ": null
    },
    {
        "Maxi Priest": "Maxi Priest"
    },
    {
        " began his career with seminal British sound system ": null
    },
    {
        "Saxon Studio International": "Saxon Studio International"
    },
    {
        ".     Three reggae-tinged singles from ": null
    },
    {
        "the Polices": "The Police"
    },
    {
        "1978 debut album,  Outlandos dAmour , laid down the template for the basic structure of a lot of rock/reggae songwriting: a reggae-infused verse containing upstrokes on guitar or keyboards and a more aggressive, on-the-beat punk/rock attack during the chorus. The end of the 1970s featured a ska revival in the UK. By the end of the 70s, a revival movement had begun in England, with such bands as the Specials, Madness, the Beat, and the Selecter. The Specials leader and keyboardist, ": null
    },
    {
        "Jerry Dammers": "Jerry Dammers"
    },
    {
        ", founded the 2 Tone record label, which released albums from the aforementioned racially integrated groups and was instrumental in creating a new social and cultural awareness. The 2 Tone movement referenced reggaes godfathers, popular styles , and previous modes of dress but updated the sound with a faster tempo, more guitar, and more attitude. Stemkovsky, I. . Reggae-core. Modern Drummer, 36, 60–62.      ": null
    },
    {
        "Birmingham": "Birmingham"
    },
    {
        " based reggae/": null
    },
    {
        "pop music": "Pop Music"
    },
    {
        " band ": null
    },
    {
        "UB40": "Ub40"
    },
    {
        " were main contributors to the British reggae scene throughout the 1980s and 1990s. The achieved international success with hits such as ": null
    },
    {
        "Red Red Wine": "Red Red Wine"
    },
    {
        " , ": null
    },
    {
        "Kingston Town": "Kingston Town"
    },
    {
        " and ": null
    },
    {
        " Falling in Love with You": "Cant Help Falling In Loveub40 Version"
    },
    {
        ".     Other UK based artists that had international impact include ": null
    },
    {
        "Aswad": "Aswad"
    },
    {
        ", ": null
    },
    {
        "Misty in Roots": "Misty In Roots"
    },
    {
        ", ": null
    },
    {
        "Steel Pulse": "Steel Pulse"
    },
    {
        ", ": null
    },
    {
        "Janet Kay": "Janet Kay"
    },
    {
        ", ": null
    },
    {
        "Tippa Irie": "Tippa Irie"
    },
    {
        ", ": null
    },
    {
        "Smiley Culture": "Smiley Culture"
    },
    {
        " and more recently ": null
    },
    {
        "Bitty McLean": "Bitty Mclean"
    },
    {
        ". There have been a number of European artists and bands drawing their inspiration directly from Jamaica and the Caribbean community in Europe, whose music and vocal styles are almost identical to contemporary Jamaican music. The best examples might be ": null
    },
    {
        "Alborosie": "Alborosie"
    },
    {
        " and ": null
    },
    {
        "Gentleman": "Gentleman"
    },
    {
        " . Both Gentleman and Alborosie have had a significant chart impact in Jamaica, unlike many European artists. They have both recorded and released music in Jamaica for Jamaican labels and producers and are popular artists, likely to appear on many ": null
    },
    {
        "riddim": "Riddim"
    },
    {
        "s. Alborosie has lived in Jamaica since the late 1990s and has recorded at Bob Marleys famous ": null
    },
    {
        "Tuff Gong": "Tuff Gong"
    },
    {
        " Studios. Since the early 1990s, several Italian reggae bands have emerged, including Africa Unite, ": null
    },
    {
        "Gaudi": "Gaudi"
    },
    {
        ", Reggae National Tickets, ": null
    },
    {
        "Sud Sound System": "Sud Sound System"
    },
    {
        ", ": null
    },
    {
        "Pitura Freska": "Pitura Freska"
    },
    {
        " and ": null
    },
    {
        "B.R. Stylers": "B.R. Stylers"
    },
    {
        ". Another Italian famous reggae singer was ": null
    },
    {
        "Rino Gaetano": "Rino Gaetano"
    },
    {
        ".     Reggae appeared on the ": null
    },
    {
        "Yugoslav popular music scene": "Popular Music In The Socialist Federal Republic Of Yugoslavia"
    },
    {
        " in the late 1970s, through sporadic songs by popular ": null
    },
    {
        "rock": "Rock Music"
    },
    {
        " acts.  Reggae saw an expansion with the emergence of ": null
    },
    {
        "Yugoslav new wave scene": "New Wave Music In Yugoslavia"
    },
    {
        ". The bands like ": null
    },
    {
        "Haustor": "Haustor"
    },
    {
        ", ": null
    },
    {
        "Šarlo Akrobata": "Šarlo Akrobata"
    },
    {
        ", ": null
    },
    {
        "Aerodrom": "Aerodrom"
    },
    {
        ", ": null
    },
    {
        "Laboratorija Zvuka": "Laboratorija Zvuka"
    },
    {
        ", ": null
    },
    {
        "Piloti": "Piloti"
    },
    {
        ", ": null
    },
    {
        "Du Du A": "Du Du A"
    },
    {
        " and others recorded reggae and reggae-influence songs. In the mid-1980s appeared ": null
    },
    {
        "Del Arno Band": "Del Arno Band"
    },
    {
        ", often considered the first real reggae band in Yugoslavia. Throughout the following decades they remained one of the most popular and influential reggae bands in the region. In the 1990s and early 2000s, after the ": null
    },
    {
        "breakup of Yugoslavia": "Breakup Of Yugoslavia"
    },
    {
        ", appeared a new generation of reggae bands, like ": null
    },
    {
        "Serbia": "Serbia"
    },
    {
        "n band ": null
    },
    {
        "Eyesburn": "Eyesburn"
    },
    {
        ", which gained popularity with their combination of reggae with ": null
    },
    {
        "hardcore punk": "Hardcore Punk"
    },
    {
        " and ": null
    },
    {
        "crossover thrash": "Crossover Thrash"
    },
    {
        ", and ": null
    },
    {
        "Croatia": "Croatia"
    },
    {
        "n band Radikal Dub Kolektiv, alongside bands which incorporated reggae into their sound, like ": null
    },
    {
        "Darkwood Dub": "Darkwood Dub"
    },
    {
        ", ": null
    },
    {
        "Kanda, Kodža i Nebojša": "Kanda, Kodža I Nebojša"
    },
    {
        " and ": null
    },
    {
        "Lira Vega": "Lira Vega"
    },
    {
        " in Serbia and ": null
    },
    {
        "Dubioza Kolektiv": "Dubioza Kolektiv"
    },
    {
        " in ": null
    },
    {
        "Bosnia and Herzegovina": "Bosnia And Herzegovina"
    },
    {
        ". Late 2000s and 2010s brought a new generation of reggae acts in the region.     The first homegrown ": null
    },
    {
        "Polish reggae": "Polish Reggae"
    },
    {
        " bands started in the 1980s with groups like ": null
    },
    {
        "Izrael": "Izrael"
    },
    {
        "ario. Singer and songwriter ": null
    },
    {
        "Alexander Barykin": "Alexander Barykin"
    },
    {
        " was considered as the father of Russian reggae.   In Sweden, ": null
    },
    {
        "Uppsala Reggae Festival": "Uppsala Reggae Festival"
    },
    {
        " attracts attendees from across Northern Europe, and features Swedish reggae bands such as ": null
    },
    {
        "Rootvälta": "Rootvälta"
    },
    {
        " and ": null
    },
    {
        "Svenska Akademien": "Svenska Akademien"
    },
    {
        " as well as many popular Jamaican artists. ": null
    },
    {
        "Summerjam": "Summerjam"
    },
    {
        ", Europes biggest reggae festival, takes place in ": null
    },
    {
        "Cologne": "Cologne"
    },
    {
        ", ": null
    },
    {
        "Germany": "Germany"
    },
    {
        " and sees crowds of 25,000 or more. ": null
    },
    {
        "Rototom Sunsplash": "Rototom Sunsplash"
    },
    {
        ", a week-long festival which used to take place in ": null
    },
    {
        "Osoppo": "Osoppo"
    },
    {
        ", ": null
    },
    {
        "Italy": "Italy"
    },
    {
        ", until 2009, is now held in ": null
    },
    {
        "Benicassim": "Benicassim"
    },
    {
        ", ": null
    },
    {
        "Spain": "Spain"
    },
    {
        " and gathers up to 150,000 visitors every year.     In Iceland reggae band ": null
    },
    {
        "Hjálmar": "Hjálmar"
    },
    {
        " is well established having released six CDs in Iceland. They were the first reggae band in Iceland, but few Icelandic artists had written songs in the reggae style before their showing up at the Icelandic music scene. The Icelandic reggae scene is expanding and growing at a fast rate. RVK Soundsystem is the first Icelandic ": null
    },
    {
        "sound system": "Sound System"
    },
    {
        ", counting 5 DJs. They hold reggae nights in Reykjavík every month at clubs Hemmi og Valdi and more recently in Faktorý as the crowd has grown so much.     In Germany, the three successful Reggae JSnrfti mer Jam open-air fastivals were crucial parts of the renaissance of Caribbean music in Germany but at that year war broke out between the two main German promoters who had cooperated so well during the previous seasons. With a lot of infighting and personal quarrels, each of them pursued his own preparations for a big summer festival. The result was that two open-air events look place on the same day.     The Reggae Sammer Jam 90 was staged as usual, but this year for only one day. The event took place at the Lorelei Rock amphit heater with artists like Mad Professors Ariwa Posse with Macka B and Kofi, Mutabaruka, the Mighty Diamonds, the Twinkle Brothers, Manu Dibango and Fela Kuti.     The other, ex-partner of the onceunited promoters succeeded in bringing the original Sunsplash package to Germany for the first time. Close to the Main River in the little village of Gemaunden deep down in rural southcentral Germany, they staged a two-day festival that drew the bigger crowd. About 10,000 people came from all over the country as well as from neighboring states like trance and, for the first time, East Germany to see the lineup of top reggae artists. Habekost, C. . ": null
    }
]