[
    {
        "        Spoken English": "english language"
    },
    {
        " shows great variation across regions where it is the predominant language. This article provides an overview of the numerous identifiable variations in ": null
    },
    {
        "pronunciation": "english pronunciation"
    },
    {
        "; such distinctions usually derive from the ": null
    },
    {
        "phonetic": "phonology"
    },
    {
        " inventory of local ": null
    },
    {
        "dialects": "dialects"
    },
    {
        ", as well as from broader differences in the ": null
    },
    {
        "Standard English": "standard english"
    },
    {
        " of different primary-speaking populations.     ": null
    },
    {
        "Accent": "accent"
    },
    {
        " is the part of dialect concerning local ": null
    },
    {
        "pronunciation": "pronunciation"
    },
    {
        ". ": null
    },
    {
        "Vocabulary": "vocabulary"
    },
    {
        " and ": null
    },
    {
        "grammar": "grammar"
    },
    {
        " are described elsewhere; see ": null
    },
    {
        "List of dialects of the English language": "list of dialects of the english language"
    },
    {
        ".     Secondary English speakers tend to carry over the ": null
    },
    {
        "intonation": "intonation"
    },
    {
        " and ": null
    },
    {
        "phonetics": "phoneme"
    },
    {
        " of their ": null
    },
    {
        "mother tongue": "mother tongue"
    },
    {
        " in English speech. For more details, see ": null
    },
    {
        "Non-native pronunciations of English": "non-native pronunciations of english"
    },
    {
        ".     Primary English-speakers show great variability in terms of regional accents. Some, such as ": null
    },
    {
        "Pennsylvania Dutch English": "pennsylvania dutch english"
    },
    {
        ", are easily identified by key characteristics; others are more obscure or easily confused. Broad regions can possess sub-forms as identified below; for instance, towns located less than  from the city of ": null
    },
    {
        "Manchester": "manchester"
    },
    {
        ", such as ": null
    },
    {
        "Bolton": "bolton"
    },
    {
        ", ": null
    },
    {
        "Rochdale": "rochdale"
    },
    {
        ", ": null
    },
    {
        "Oldham": "oldham"
    },
    {
        " and ": null
    },
    {
        "Salford": "city of salford"
    },
    {
        ", each have distinct accents, all of which together comprise the broader accent of ": null
    },
    {
        "Lancashire": "lancashire"
    },
    {
        " county; while these sub-dialects are very similar to each other, non-local listeners can identify firm differences. On the other side of the spectrum, ": null
    },
    {
        "Australia": "variation in australian english"
    },
    {
        " has a General accent that is virtually consistent over thousands of kilometers.     English accents can differ enough to create room for misunderstandings. For example, the pronunciation of pearl in some variants of Scottish English can sound like the entirely unrelated word petal to an American ear.     For a summary of the differences between accents, see ": null
    },
    {
        "International Phonetic Alphabet chart for English dialects": "international phonetic alphabet chart for english dialects"
    },
    {
        ".             English dialects differ greatly in their pronunciation of open vowels. In ": null
    },
    {
        "Received Pronunciation": "received pronunciation"
    },
    {
        ", there are four open back vowels, , but in General American there are only three, , and in most dialects of Canadian English only two, . In addition, which words have which vowel varies between dialects. Words like bath and cloth have the vowels  in Received Pronunciation, but  in General American. The table above shows some of these dialectal differences.            Accents and dialects vary widely across the Great Britain, Ireland and nearby smaller islands. As such, a single British accent does not exist. However, someone could be said to have an English, Scottish, Welsh or Irish accent, although these all have several different sub-types.          There are considerable variations within the accents of English across England, one of the most obvious being the ": null
    },
    {
        "trap-bath split": "pronunciation of english ⟨a⟩trap-bath split"
    },
    {
        " of the southern half of the country.     Two main sets of accents are spoken in the ": null
    },
    {
        "West Country": "west country"
    },
    {
        ", namely ": null
    },
    {
        "Cornish": "cornish dialect"
    },
    {
        " and ": null
    },
    {
        "West Country": "west country dialects"
    },
    {
        " spoken primarily in the counties of ": null
    },
    {
        "Devon": "devon"
    },
    {
        ", ": null
    },
    {
        "Somerset": "somerset"
    },
    {
        ", ": null
    },
    {
        "Gloucestershire": "gloucestershire"
    },
    {
        ", ": null
    },
    {
        "Bristol": "bristol"
    },
    {
        ", ": null
    },
    {
        "Dorset": "dorset"
    },
    {
        " , and ": null
    },
    {
        "Wiltshire": "wiltshire"
    },
    {
        " . However, a range of variations can be heard within different parts of the West Country: the ": null
    },
    {
        "Bristolian dialect": "bristolian dialect"
    },
    {
        " is distinctive from the accent heard in ": null
    },
    {
        "Gloucestershire": "gloucestershire"
    },
    {
        " , for example.   The ": null
    },
    {
        "Cornwall": "cornwall"
    },
    {
        " accent has an East-West variation with the East of the county having influences from West country English and the West of the county having direct influences from the ": null
    },
    {
        "Cornish language": "cornish language"
    },
    {
        ".     The accents of ": null
    },
    {
        "Northern England": "english in northern england"
    },
    {
        " are also distinctive, including a range of variations:     ": null
    },
    {
        "Northumbria": "northumbrian dialect"
    },
    {
        " with regional variants in Eastern Northumberland , Northern Northumberland  and ": null
    },
    {
        "Newcastle": "geordie"
    },
    {
        ". Further south in Tyne and Wear ": null
    },
    {
        "Sunderland": "mackem"
    },
    {
        " is a genuine rival to that of their counterparts.     ": null
    },
    {
        "Cumbria": "cumbrian dialect"
    },
    {
        " with regional variants in Western Cumbria , Southern Cumbria  and ": null
    },
    {
        "Carlisle": "carlisle"
    },
    {
        ".     ": null
    },
    {
        "Lancashire": "lancashire dialect and accent"
    },
    {
        ", with regional variants in ": null
    },
    {
        "Bolton": "bolton"
    },
    {
        ", ": null
    },
    {
        "Burnley": "burnley"
    },
    {
        ", ": null
    },
    {
        "Blackburn": "blackburn"
    },
    {
        ", ": null
    },
    {
        "Manchester": "manchester dialect"
    },
    {
        ", ": null
    },
    {
        "Preston": "preston, lancashire"
    },
    {
        ", ": null
    },
    {
        "Fylde": "blackpool"
    },
    {
        ", ": null
    },
    {
        "Liverpool": "scouse"
    },
    {
        " and ": null
    },
    {
        "Wigan": "wigan"
    },
    {
        ".     ": null
    },
    {
        "Yorkshire": "yorkshire dialect"
    },
    {
        " is also distinctive, having regional variants in ": null
    },
    {
        "Leeds": "leeds"
    },
    {
        ", ": null
    },
    {
        "Bradford": "bradford"
    },
    {
        ", ": null
    },
    {
        "Sheffield": "sheffield"
    },
    {
        ", ": null
    },
    {
        "York": "york"
    },
    {
        ", ": null
    },
    {
        "Hull": "kingston upon hull"
    },
    {
        ", ": null
    },
    {
        "Middlesbrough": "middlesbrough"
    },
    {
        "     Many of the Lancashire accents may sound similar to outsiders; an exception is the ": null
    },
    {
        "Scouse": "scouse"
    },
    {
        " accent, spoken in ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        " and to some extent the surrounding towns. Before the ": null
    },
    {
        "Irish Famine": "great famine"
    },
    {
        " of the 42s the Liverpool accent was not dissimilar to others in Lancashire, except that with Liverpool being close to Wales, there were some Northern Welsh inflections. However, Liverpools population of around 42 in the 42s was swelled by the passage of around 42 Irish refugees escaping the Famine, as Liverpool was Englands main ": null
    },
    {
        "Atlantic": "atlantic ocean"
    },
    {
        " port": "port"
    },
    {
        " and a popular departure point for people leaving for a new life in America. So, while many of the Irish refugees moved on to other parts of Britain and further afield, many remained in Liverpool and this permanently influenced the local accent. . Retrieved 42 August 42 Today, the Scouse accent is completely distinct from others in the North West of England and bears little resemblance to them. Many Liverpool families can trace their lineage back to refugees escaping the potato famine.     Similarly, although many Yorkshire accents sound similar, the Hull city accent is markedly different. The rhythm of the accent is more like that of northern Lincolnshire than that of the rural East Riding, perhaps due to migration from Lincolnshire to the city during its industrial growth. One feature that it does share with the surrounding rural area is that an /aɪ/ sound in the middle of a word often becomes an /ɑː/: for example, five may sound like fahve , time like tahme .     A range of accents are spoken in the ": null
    },
    {
        "West Midlands": "west midlands english"
    },
    {
        "                ": null
    }
]