[
    {
        "     Johannes Müller von Königsberg , better known as Regiomontanus , was a ": null
    },
    {
        "mathematician": "mathematician"
    },
    {
        " and ": null
    },
    {
        "astronomer": "astronomer"
    },
    {
        " of the ": null
    },
    {
        "German Renaissance": "german renaissance"
    },
    {
        ", active in ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ", ": null
    },
    {
        "Buda": "buda"
    },
    {
        " and ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        ". His contributions were instrumental in the development of ": null
    },
    {
        "Copernican heliocentrism": "copernican heliocentrism"
    },
    {
        " in the decades following his death.     Regiomontanus wrote under the Latinized name of Ioannes de Monteregio ; the adjectival Regiomontanus was first used by ": null
    },
    {
        "Philipp Melanchthon": "philipp melanchthon"
    },
    {
        " in 1534. He is named after ": null
    },
    {
        "Königsberg": "königsberg, bavaria"
    },
    {
        " in ": null
    },
    {
        "Lower Franconia": "lower franconia"
    },
    {
        ", not the larger ": null
    },
    {
        "Königsberg": "königsberg"
    },
    {
        "  in Prussia.             Although little is known of Regiomontanus early life, it is believed that at eleven years of age, he became a student at the ": null
    },
    {
        "University of Leipzig": "university of leipzig"
    },
    {
        ", ": null
    },
    {
        "Saxony": "electorate of saxony"
    },
    {
        ". In 1451 he continued his studies at ": null
    },
    {
        "Alma Mater Rudolfina": "university of vienna"
    },
    {
        ", the university in ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ", ": null
    },
    {
        "Austria": "duchy of austria"
    },
    {
        ". There he became a pupil and friend of ": null
    },
    {
        "Georg von Peuerbach": "georg von peuerbach"
    },
    {
        ". In 1452 he was awarded the bachelor degree , and he was awarded his magister artium  at the age of 21 in 1457.  It is known that he held lectures in ": null
    },
    {
        "optics": "optics"
    },
    {
        " and ancient literature.      In 1460 the papal legate ": null
    },
    {
        "Basilios Bessarion": "basilios bessarion"
    },
    {
        " came to Vienna on a diplomatic mission. Being a humanist scholar and great fan of the mathematical sciences, Bessarion sought out Peuerbachs company. ": null
    },
    {
        "George of Trebizond": "george of trebizond"
    },
    {
        " who was Bessarions philosophical rival had recently produced a new Latin translation of Ptolemys  Almagest  from the Greek, which Bessarion, correctly, regarded as inaccurate and badly translated, so he asked Peuerbach to produce a new one. Peuerbachs Greek was not good enough to do a translation but he knew the Almagest intimately so instead he started work on a modernised, improved abridgement of the work. Bessarion also invited Peuerbach to become part of his household and to accompany him back to Italy when his work in Vienna was finished. Peuerbach accepted the invitation on the condition that Regiomontanus could also accompany them. However Peuerbach fell ill in 1461 and died only having completed the first six books of his abridgement of the Almagest. On his death bed Peuerbach made Regiomontanus promise to finish the book and publish it.      In 1461 Regiomontanus left Vienna with Bessarion and spent the next four years travelling around Northern Italy as a member of Bessarions household, looking for and copying mathematical and astronomical manuscripts for Bessarion, who possessed the largest private library in Europe at the time. Regiomontanus also made the acquaintance of the leading Italian mathematicians of the age such as ": null
    },
    {
        "Giovanni Bianchini": "giovanni bianchini"
    },
    {
        " and ": null
    },
    {
        "Paolo dal Pozzo Toscanelli": "paolo dal pozzo toscanelli"
    },
    {
        " who had also been friends of Peuerbach during his prolonged stay in Italy more than twenty years earlier.     In 1467, he went to work for ": null
    },
    {
        "János Vitéz": "jános vitéz"
    },
    {
        ", archbishop of ": null
    },
    {
        "Esztergom": "esztergom"
    },
    {
        ". There he calculated extensive astronomical tables and built astronomical instruments. Next he went to ": null
    },
    {
        "Buda": "buda"
    },
    {
        ", and the court of ": null
    },
    {
        "Matthias Corvinus": "matthias corvinus"
    },
    {
        " of Hungary, for whom he built an astrolabe, and where he collated Greek manuscripts for a handsome salary.    The tables that he created while living in Hungary, his Tabulae directionum, were designed for astrology, including finding astrological houses.      In 1471 Regiomontanus moved to the Free City of ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        ", in ": null
    },
    {
        "Franconia": "franconia"
    },
    {
        ", then one of the Empires important seats of learning, publication, commerce and art, where he worked with the humanist and merchant ": null
    },
    {
        "Bernhard Walther": "bernhard walther"
    },
    {
        ". Here he founded the worlds first scientific printing press, and in 1472 he published the first printed astronomical textbook, the Theoricae novae Planetarum of his teacher Georg von Peurbach.     Regiomontanus and Bernhard Walther observed the ": null
    },
    {
        "comet of 1472": "comet of 1472"
    },
    {
        ". Regiomontanus tried to estimate its distance from Earth, using the angle of parallax. According to David A. Seargeant: David A. Seargeant. The Greatest Comets in History, 2009, p. 104      The 1472 comet was visible from Christmas Day 1471 to 1 March 1472 , a total of 59 days. Donald K. Yeomans, http://ssd.jpl.nasa.gov/?great_comets Jet Propulsion Laboratory: Great Comets in History, 2007.     In 1475, Regiomontanus was called to Rome by ": null
    },
    {
        "Pope Sixtus IV": "pope sixtus iv"
    },
    {
        " on to work on the planned ": null
    },
    {
        "calendar reform": "gregorian calendarbackground"
    },
    {
        ". Sixtus promised substantial rewards, including the title of ": null
    },
    {
        "bishop of Regensburg": "bishop of regensburg"
    },
    {
        ",  Rudolf Schmidt,  in: Deutsche Buchhändler. Deutsche Buchdrucker vol. 5 , 797f. it is unlikely that he was actually appointed to the role.     On his way to Rome, stopping in Venice, he commissioned the publication of his Calendarium with ": null
    },
    {
        "Erhard Ratdolt": "erhard ratdolt"
    },
    {
        " .  Regiomontanus reached Rome, but he died there after only a few months, in his 41st year, on 6 July 1476. According to a rumor repeated by ": null
    },
    {
        "Gassendi": "pierre gassendi"
    },
    {
        " in his Regiomontanus biography, he was poisoned by relatives of ": null
    },
    {
        "George of Trebizond": "george of trebizond"
    },
    {
        " whom he had criticized in his writing; it is however considered more likely that he died from the plague.             During his time in Italy he completed Peuerbachs Almagest abridgement, Epytoma in almagesti Ptolemei. In 1464, he completed De Triangulis omnimodis. De Triangulis was one of the first textbooks presenting the current state of ": null
    },
    {
        "trigonometry": "trigonometry"
    },
    {
        " and included lists of questions for review of individual chapters. In it he wrote:          His work on ": null
    },
    {
        "arithmetic": "arithmetic"
    },
    {
        " and ": null
    },
    {
        "algebra": "algebra"
    },
    {
        ", Algorithmus Demonstratus, was among the first containing ": null
    },
    {
        "symbolic algebra": "symbolic algebra"
    },
    {
        ".  In 1465, he built a portable ": null
    },
    {
        "sundial": "sundial"
    },
    {
        " for ": null
    },
    {
        "Pope Paul II": "pope paul ii"
    },
    {
        ".     In Epytoma in almagesti Ptolemei, he critiqued the translation of Almagest by ": null
    },
    {
        "George of Trebizond": "george of trebizond"
    },
    {
        ", pointing out inaccuracies. Later ": null
    },
    {
        "Nicolaus Copernicus": "nicolaus copernicus"
    },
    {
        " would refer to this book as an influence on his own work.     A prolific author, Regiomontanus was internationally famous in his lifetime. Despite having completed only a quarter of what he had intended to write, he left a substantial body of work. ": null
    },
    {
        "Nicolaus Copernicus": "nicolaus copernicus"
    },
    {
        " teacher, ": null
    },
    {
        "Domenico Maria Novara da Ferrara": "domenico maria novara da ferrara"
    },
    {
        ", referred to Regiomontanus as having been his own teacher. There is speculation that Regiomontanus had arrived at a theory of heliocentrism before he died; a manuscript shows particular attention to the ": null
    },
    {
        "heliocentric": "heliocentric"
    },
    {
        " theory of the ": null
    },
    {
        "Pythagorean": "pythagoreanism"
    },
    {
        " Aristarchus": "aristarchus of samos"
    },
    {
        ", mention was also given to the motion of the earth in a letter to a friend. ": null
    },
    {
        "Arthur Koestler": "arthur koestler"
    },
    {
        ", The Sleepwalkers, Penguin Books, 1959, p. 212.     Much of the material on ": null
    },
    {
        "spherical trigonometry": "spherical trigonometry"
    },
    {
        " in Regiomontanus On Triangles was taken directly from the twelfth-century work of ": null
    },
    {
        "Jabir ibn Aflah": "jabir ibn aflah"
    },
    {
        " otherwise known as Geber, as noted in the sixteenth century by ": null
    },
    {
        "Gerolamo Cardano": "gerolamo cardano"
    },
    {
        ". , p.4       ": null
    },
    {
        "Simon Stevin": "simon stevin"
    },
    {
        ", in his book describing ": null
    },
    {
        "decimal representation": "decimal representation"
    },
    {
        " of ": null
    },
    {
        "fractions": "fraction"
    },
    {
        " , cites the trigonometric tables of Regiomontanus as suggestive of ": null
    },
    {
        "positional notation": "positional notation"
    },
    {
        ". ": null
    },
    {
        "E. J. Dijksterhuis": "e. j. dijksterhuis"
    },
    {
        " Simon Stevin: Science in the Netherlands around 1600, pages 17–19, ": null
    },
    {
        "Martinus Nijhoff Publishers": "martinus nijhoff publishers"
    },
    {
        ", Dutch original 1943     Regiomontanus designed his own ": null
    },
    {
        "astrological house system": "astrological housesregiomontanus"
    },
    {
        ", which became one of the most popular systems in Europe.      In 1561, ": null
    },
    {
        "Daniel Santbech": "daniel santbech"
    },
    {
        " compiled a collected edition of the works of Regiomontanus, De triangulis planis et sphaericis libri quinque and Compositio tabularum sinum recto, as well as Santbechs own Problematum astronomicorum et geometricorum sectiones septem. It was published in ": null
    },
    {
        "Basel": "basel"
    },
    {
        " by ": null
    },
    {
        "Henrich Petri": "henrich petri"
    },
    {
        " and ": null
    },
    {
        "Petrus Perna": "petrus perna"
    },
    {
        ".     There is an image of him in Hartmann Schedels 1493  Nuremberg Chronicle . He is holding an astrolabe. Yet, although there are thirteen illustrations of comets in the Chronicle , they are stylized, rather than representing the actual objects.      The crater ": null
    },
    {
        "Regiomontanus": "regiomontanus"
    }
]