[
    {
        "   In ": null
    },
    {
        "geography": "geography"
    },
    {
        ", regions are areas that are broadly divided by physical characteristics , human impact characteristics , and the interaction of humanity and the environment . Geographic regions and sub-regions are mostly described by their imprecisely defined, and sometimes transitory boundaries, except in human geography, where ": null
    },
    {
        "jurisdiction": "jurisdiction"
    },
    {
        " areas such as national borders are defined in law.     Apart from the ": null
    },
    {
        "global": "earth"
    },
    {
        " continent": "continent"
    },
    {
        "al regions, there are also ": null
    },
    {
        "hydrospheric": "hydrosphere"
    },
    {
        " and ": null
    },
    {
        "atmospheric": "atmosphere"
    },
    {
        " regions that cover the ": null
    },
    {
        "ocean": "ocean"
    },
    {
        "s, and discrete ": null
    },
    {
        "climate": "climate"
    },
    {
        "s above the land and water masses of the planet. The land and water global regions are divided into subregions geographically bounded by large geological features that influence large-scale ecologies, such as ": null
    },
    {
        "plain": "plain"
    },
    {
        "s and features.     As a way of describing spatial areas, the concept of regions is important and widely used among the many branches of geography, each of which can describe areas in regional terms. For example, ecoregion is a term used in ": null
    },
    {
        "environmental geography": "environmental geography"
    },
    {
        ", cultural region in ": null
    },
    {
        "cultural geography": "cultural geography"
    },
    {
        ", bioregion in ": null
    },
    {
        "biogeography": "biogeography"
    },
    {
        ", and so on. The field of geography that studies regions themselves is called ": null
    },
    {
        "regional geography": "regional geography"
    },
    {
        ".     In the fields of ": null
    },
    {
        "physical geography": "physical geography"
    },
    {
        ", ": null
    },
    {
        "ecology": "ecology"
    },
    {
        ", ": null
    },
    {
        "biogeography": "biogeography"
    },
    {
        ", ": null
    },
    {
        "zoogeography": "zoogeography"
    },
    {
        ", and ": null
    },
    {
        "environmental geography": "environmental geography"
    },
    {
        ", regions tend to be based on natural features such as ": null
    },
    {
        "ecosystem": "ecosystem"
    },
    {
        "s or ": null
    },
    {
        "biotope": "biotope"
    },
    {
        "s, ": null
    },
    {
        "biome": "biome"
    },
    {
        "s, ": null
    },
    {
        "drainage basin": "drainage basin"
    },
    {
        "s, ": null
    },
    {
        "natural region": "natural region"
    },
    {
        "s, ": null
    },
    {
        "mountain range": "mountain range"
    },
    {
        "s, ": null
    },
    {
        "soil type": "soil type"
    },
    {
        "s. Where ": null
    },
    {
        "human geography": "human geography"
    },
    {
        " is concerned, the regions and subregions are described by the discipline of ": null
    },
    {
        "ethnography": "ethnography"
    },
    {
        ".     A region has its own nature that could not be moved. The first nature is its natural environment . The second nature is its physical elements complex that were built by people in the past. The third nature is its socio-cultural context that could not be replaced by new immigrants.          Global regions distinguishable from space, and are therefore clearly distinguished by the two basic terrestrial environments, land and ": null
    },
    {
        "water": "water"
    },
    {
        ". However, they have been generally recognised as such much earlier by terrestrial ": null
    },
    {
        "cartography": "cartography"
    },
    {
        " because of their impact on human geography. They are divided into largest of land regions, known as ": null
    },
    {
        "continent": "continent"
    },
    {
        "s, and the largest of water regions known as ": null
    },
    {
        "ocean": "ocean"
    },
    {
        "s. There are also significant regions that do not belong to either classification, such as ": null
    },
    {
        "archipelago": "archipelago"
    },
    {
        " regions that are ": null
    },
    {
        "littoral": "littoral"
    },
    {
        " regions, or ": null
    },
    {
        "earthquake": "earthquake"
    },
    {
        " regions that are defined in ": null
    },
    {
        "geology": "geology"
    },
    {
        ".       Continental regions are usually based on broad experiences in human history and attempts to reduce very large areas to more manageable ": null
    },
    {
        "regionalization": "regionalization"
    },
    {
        " for the purpose of study. As such they are conceptual constructs, usually lacking distinct boundaries. Oceanic division into maritime regions are used in conjunction with the relationship to the central area of the continent, using directions of the ": null
    },
    {
        "compass": "compass"
    },
    {
        ".     Some continental regions are defined by the major continental feature of their identity, such as the ": null
    },
    {
        "Amazon basin": "amazon basin"
    },
    {
        ", or the ": null
    },
    {
        "Sahara": "sahara"
    },
    {
        ", which both occupy a significant percentage of their respective continental land area.     To a large extent, major continental regions are mental constructs created by considering an efficient way to define large areas of the continents. For the most part, the images of the world are derived as much from academic studies, from all types of media, or from personal experience of global ": null
    },
    {
        "exploration": "exploration"
    },
    {
        ". They are a matter of collective human knowledge of its own planet and are attempts to better understand their environments.       ": null
    },
    {
        "Regional geography": "regional geography"
    },
    {
        " is a branch of geography that studies regions of all sizes across the ": null
    },
    {
        "Earth": "earth"
    },
    {
        ". It has a prevailing descriptive character. The main aim is to understand or define the uniqueness or character of a particular region, which consists of natural as well as human elements. Attention is paid also to regionalization, which covers the proper techniques of space ": null
    },
    {
        "delimitation": "delimitation"
    },
    {
        " into regions.     Regional geography is also considered as a certain approach to study in geographical sciences .       ": null
    },
    {
        "Human geography": "human geography"
    },
    {
        " is a branch of geography that focuses on the study of patterns and processes that shape human interaction with various discrete environments. It encompasses ": null
    },
    {
        "human": "human"
    },
    {
        ", ": null
    },
    {
        "political": "politics"
    },
    {
        ", ": null
    },
    {
        "cultural": "culture"
    },
    {
        ", ": null
    },
    {
        "social": "social issues"
    },
    {
        ", and ": null
    },
    {
        "economic": "economics"
    },
    {
        " aspects among others that are often clearly delineated. While the major focus of human geography is not the physical landscape of the Earth , it is hardly possible to discuss human geography without referring to the physical landscape on which human activities are being played out, and ": null
    },
    {
        "environmental geography": "environmental geography"
    },
    {
        " is emerging as a link between the two. Regions of human geography can be divided into many broad categories:   ": null
    },
    {
        "Cultural geography": "cultural geography"
    },
    {
        " Demography": "demography"
    },
    {
        " Development geography": "development geography"
    },
    {
        " Economic geography": "economic geography"
    },
    {
        " Ethnography": "ethnography"
    },
    {
        " Geopolitics": "geopolitics"
    },
    {
        " Health geography": "health geography"
    },
    {
        " Historical geography": "historical geography"
    },
    {
        " Language geography": "language geography"
    },
    {
        " Religion geography": "religion geography"
    },
    {
        " Social geography": "social geography"
    },
    {
        " Time geography": "time geography"
    },
    {
        " Tourism geography": "tourism geography"
    },
    {
        " Transportation geography": "transportation geography"
    },
    {
        " Urban geography": "urban geography"
    },
    {
        " Media Geography": "media geography"
    },
    {
        "           The field of ": null
    },
    {
        "historical geography": "historical geography"
    },
    {
        " involves the study of human history as it relates to places and ": null
    },
    {
        "regions": "historical region"
    },
    {
        " or the study of how places and regions have changed over time.     ": null
    },
    {
        "D. W. Meinig": "d. w. meinig"
    },
    {
        ", a historical geographer of America, describes many historical regions in his book The Shaping of America: A Geographical Perspective on 42 Years of History. For example, in identifying European source regions in early American colonization efforts, he defines and describes the Northwest European Atlantic Protestant Region, which includes sub-regions such as the Western Channel Community , which itself is made of sub-regions such as the English West Country  of ": null
    },
    {
        "Cornwall": "cornwall"
    },
    {
        ", ": null
    },
    {
        "Devon": "devon"
    },
    {
        ", ": null
    },
    {
        "Somerset": "somerset"
    },
    {
        ", and ": null
    },
    {
        "Dorset": "dorset"
    },
    {
        ".     In describing historic regions of America, Meinig writes of The Great Fishery off the coast of Newfoundland and New England, an oceanic region that includes the ": null
    },
    {
        "Grand Banks": "grand banks"
    },
    {
        ". He rejects regions traditionally used in describing American history, like ": null
    },
    {
        "New France": "new france"
    },
    {
        ", West Indies , the ": null
    },
    {
        "Middle Colonies": "middle colonies"
    },
    {
        ", and the individual colonies themselves . Instead he writes of discrete colonization areas, which may be named after colonies but rarely adhere strictly to political boundaries. Historic regions of this type Meinig writes about include Greater New England and its major sub-regions of Plymouth, New Haven shores , Rhode Island , the Piscataqua, Massachusetts Bay, Connecticut Valley, and to a lesser degree, regions in the sphere of influence of Greater New England, Acadia , Newfoundland and The Fishery/The Banks.     Other examples of historical regions include Iroquoia, ": null
    },
    {
        "Ohio Country": "ohio country"
    },
    {
        ", ": null
    },
    {
        "Illinois Country": "illinois country"
    },
    {
        ", and ": null
    },
    {
        "Ruperts Land": "ruperts land"
    },
    {
        ".          A tourism region is a geographical region that has been designated by a governmental organization or ": null
    },
    {
        "tourism bureau": "tourism bureau"
    },
    {
        " as having common cultural or environmental characteristics. These regions are often named after a geographical, former, or current administrative region or may have a name created for ": null
    },
    {
        "tourism": "tourism"
    },
    {
        " purposes. The names often evoke certain positive qualities of the area and suggest a coherent tourism experience to visitors. Countries, states, provinces, and other administrative regions are often carved up into tourism regions to facilitate attracting visitors.     Some of the more famous tourism regions based on historical or current administrative regions include ": null
    },
    {
        "Tuscany": "tuscany"
    },
    {
        " . Retrieved 424242 in Italy and ": null
    },
    {
        "Yucatán": "yucatán"
    },
    {
        "  , Retrieved 424242 in Mexico. Famous examples of regions created by a government or tourism bureau include the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        "s ": null
    },
    {
        "Lake District": "lake district"
    },
    {
        " , Retrieved 424242 and ": null
    },
    {
        "Californias Wine Country": "wine country"
    },
    {
        ". , Retrieved 424242   great plains region       ": null
    },
    {
        "Natural resource": "natural resource"
    },
    {
        "s often occur in distinct regions. Natural resource regions can be a topic of physical geography or environmental geography, but also have a strong element of human geography and economic geography. A coal region, for example, is a physical or geomorphological region, but its development and exploitation can make it into an economic and a cultural region. Some examples of natural resource regions include the ": null
    },
    {
        "Rumaila Field": "rumaila field"
    },
    {
        ", the oil field that lies along the border or Iraq and Kuwait and played a role in the ": null
    },
    {
        "Gulf War": "gulf war"
    },
    {
        "; the ": null
    },
    {
        "Coal Region": "coal region"
    },
    {
        " of Pennsylvania, which is a historical region as well as a cultural, physical, and natural resource region; the ": null
    },
    {
        "South Wales Coalfield": "south wales coalfield"
    },
    {
        ", which like Pennsylvanias coal region is a historical, cultural, and natural region; the ": null
    },
    {
        "Kuznetsk Basin": "kuznetsk basin"
    },
    {
        ", a similarly important coal mining region in Russia; ": null
    },
    {
        "Kryvbas": "kryvbas"
    },
    {
        ", the economic and iron ore mining region of Ukraine; and the ": null
    },
    {
        "James Bay Project": "james bay project"
    },
    {
        ", a large region of Quebec where one of the largest hydroelectric systems in the world has been developed.       Sometimes a region associated with a religion is given a name, like ": null
    },
    {
        "Christendom": "christendom"
    },
    {
        ", a term with medieval and renaissance connotations of Christianity as a sort of social and political ": null
    },
    {
        "polity": "body politic"
    },
    {
        ". The term ": null
    },
    {
        "Muslim world": "muslim world"
    },
    {
        " is sometimes used to refer to the region of the world where Islam is dominant. These broad terms are very vague when used to describe regions.     Within some religions there are clearly defined regions. The ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        ", the ": null
    },
    {
        "Church of England": "list of church of england dioceses"
    },
    {
        ", the ": null
    },
    {
        "Eastern Orthodox Church": "eastern orthodox church"
    },
    {
        ", and others, define ecclesiastical regions with names such as ": null
    },
    {
        "diocese": "diocese"
    },
    {
        ", ": null
    },
    {
        "eparchy": "eparchy"
    },
    {
        ", ": null
    },
    {
        "ecclesiastical provinces": "ecclesiastical province"
    },
    {
        ", and ": null
    },
    {
        "parish": "parish"
    },
    {
        ".     For example, the United States is divided into 42 Roman Catholic ": null
    },
    {
        "ecclesiastical provinces": "list of the roman catholic dioceses of the united states"
    },
    {
        ". The ": null
    },
    {
        "Lutheran Church–Missouri Synod": "lutheran church–missouri synod"
    },
    {
        " is organized into 42 geographic districts, which are subdivided into circuits . ": null
    },
    {
        "The Church of Jesus Christ of Latter-day Saints": "the church of jesus christ of latter-day saints"
    },
    {
        " uses regions similar to dioceses and parishes, but uses terms like ": null
    },
    {
        "ward": "ward"
    },
    {
        " and ": null
    },
    {
        "stake": "stake"
    },
    {
        ".                In the field of ": null
    },
    {
        "political geography": "political geography"
    },
    {
        ", regions tend to be based on political units such as ": null
    },
    {
        "sovereign state": "sovereign state"
    },
    {
        "s; subnational units such as administrative regions, ": null
    },
    {
        "province": "province"
    },
    {
        "s, ": null
    },
    {
        "states ": "u.s. state"
    },
    {
        ", ": null
    },
    {
        "counties": "county"
    },
    {
        ", ": null
    },
    {
        "township": "township"
    },
    {
        "s, ": null
    },
    {
        "territories": "territory"
    },
    {
        ", etc.; and multinational groupings, including formally defined units such as the ": null
    },
    {
        "European Union": "european union"
    },
    {
        ", the ": null
    },
    {
        "Association of Southeast Asian Nations": "association of southeast asian nations"
    },
    {
        ", and ": null
    },
    {
        "NATO": "nato"
    },
    {
        ", as well as informally defined regions such as the ": null
    },
    {
        "Third World": "third world"
    },
    {
        ", ": null
    },
    {
        "Western Europe": "western europe"
    },
    {
        ", and the Middle East.           The word region is taken from the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " regio , and a number of countries have borrowed the term as the formal name for a type of subnational entity . In English, the word is also used as the conventional translation for equivalent terms in other languages .     The following countries use the term region  as the name of a type of subnational administrative unit:   ": null
    },
    {
        "Belgium": "regions of belgium"
    },
    {
        "    Chad": "regions of chad"
    },
    {
        "    Chile": "regions of chile"
    },
    {
        "    Côte dIvoire": "regions of côte divoire"
    },
    {
        "    Denmark": "regions of denmark"
    },
    {
        "   England": "regions of england"
    },
    {
        "   Eritrea": "regions of eritrea"
    },
    {
        " France": "regions of france"
    },
    {
        "    Ghana": "regions of ghana"
    },
    {
        " Guinea": "regions of guinea"
    },
    {
        "    Guinea-Bissau": "regions of guinea-bissau"
    },
    {
        "    Guyana": "regions of guyana"
    },
    {
        " Hungary": "regions of hungary"
    },
    {
        "    Italy": "regions of italy"
    },
    {
        "    Madagascar": "regions of madagascar"
    },
    {
        "    Mali": "regions of mali"
    },
    {
        "    Malta": "regions of malta"
    },
    {
        "    Namibia": "regions of namibia"
    },
    {
        " New Zealand": "regions of new zealand"
    },
    {
        " Peru": "regions of peru"
    },
    {
        "    Portugal": "list of regions and sub-regions of portugal"
    },
    {
        "    Philippines": "regions of the philippines"
    },
    {
        "    Senegal": "regions of senegal"
    },
    {
        "    Tanzania": "regions of tanzania"
    },
    {
        " Togo": "regions of togo"
    },
    {
        "    Trinidad and Tobago": "regional corporations and municipalities of trinidad and tobago"
    },
    {
        "    The Canadian ": null
    },
    {
        "province": "provinces and territories of canada"
    },
    {
        " of ": null
    },
    {
        "Québec": "list of quebec regions"
    },
    {
        " also uses the administrative region .     Scotland had ": null
    },
    {
        "local government regions": "local government areas of scotland 1973 to 1996"
    },
    {
        " from 42 to 42     In Spain the official name of the ": null
    },
    {
        "autonomous community": "autonomous community"
    },
    {
        " of ": null
    },
    {
        "Murcia": "region of murcia"
    },
    {
        " is Región de Murcia. Also, some single-province autonomous communities such as ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        " use the term región interchangeably with comunidad autónoma.     Two ": null
    },
    {
        "län": "län of sweden"
    },
    {
        " in Sweden are officially called regions: ": null
    },
    {
        "Skåne": "skåne"
    },
    {
        " and ": null
    },
    {
        "Västra Götaland": "västra götaland"
    },
    {
        ", and there is currently a controversial proposal to divide the rest of Sweden into large ": null
    },
    {
        "regions": "regions of sweden"
    },
    {
        ", replacing the current counties.     The government of the ": null
    },
    {
        "Philippines": "regions of the philippines"
    },
    {
        " uses the term region  when its necessary to group provinces, the primary administrative subdivision of the country. This is also the case in ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ", which groups its primary administrative divisions  into grandes regiões  for statistical purposes, while Russia uses экономические районы  in a similar way, as does ": null
    },
    {
        "Romania": "development regions of romania"
    },
    {
        " and ": null
    },
    {
        "Venezuela": "administrative regions of venezuela"
    },
    {
        ".     The ": null
    },
    {
        "government of Singapore": "government of singapore"
    },
    {
        " makes use of the term ": null
    },
    {
        "region": "regions of singapore"
    },
    {
        " for its own administrative purposes.     The following countries use an administrative subdivision conventionally referred to as a region in English:   ": null
    },
    {
        "Bulgaria": "oblasts of bulgaria"
    },
    {
        ", which uses the област    ": null
    },
    {
        "Russia": "oblasts of russia"
    },
    {
        ", which uses the область , and for some regions the край    Ukraine , which uses the область    Slovakia      China has five 自治区  and two 特別行政區 , which are translated as autonomous region and special administrative region , respectively.       There are many relatively small regions based on local government agencies such as districts, agencies, or regions. In general, they are all regions in the general sense of being bounded spatial units. Examples include electoral districts such as Washingtons 42th congressional district and Tennessees 42st congressional district ; school districts such as Granite School District and Los Angeles Unified School District ; economic districts such as the Reedy Creek Improvement District ; metropolitan areas such as the Seattle metropolitan area , and metropolitan districts such as the Metropolitan Water Reclamation District of Greater Chicago , the Las Vegas-Clark County Library District , the Metropolitan Police Service of Greater London , as well as other local districts like the York Rural Sanitary District , the Delaware River Port Authority , the Nassau County Soil and Water Conservation District , and C-TRAN .       The traditional territorial divisions of some countries are also commonly rendered in English as regions . These informal divisions do not form the basis of the modern administrative divisions of these countries, but still define and delimit local regional identity and sense of belonging. Examples include:     Finland   Japan   Korea   Norway ": null
    }
]