[
    {
        "        The ": null
    },
    {
        "European Union": "european union"
    },
    {
        " created a ": null
    },
    {
        "Committee of the Regions": "committee of the regions"
    },
    {
        " to represent Regions of Europe as the layer of EU government administration directly below the ": null
    },
    {
        "nation-state": "nation-state"
    },
    {
        " level. The Committee has its headquarters in ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ".     Reasons given for this include:   the historic and cultural claims for autonomy in many regions all over the EU   strengthening the political and economic situation in those regions     The term region as used here includes ": null
    },
    {
        "England": "england"
    },
    {
        ", ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ", ": null
    },
    {
        "Wales": "wales"
    },
    {
        " and ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        " which are non-sovereign ": null
    },
    {
        "countries": "countries"
    },
    {
        ", referred to as separate countries, even though collectively they form the country known as the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        " they are ": null
    },
    {
        "recognised as countries": "countries of the united kingdom"
    },
    {
        " by the ": null
    },
    {
        "UK Government": "uk government"
    },
    {
        " and are not referred to as ": null
    },
    {
        "regions": "regions"
    },
    {
        ".     Some nation states which have historically had a strong centralized administration have transferred political power to the regions. Examples of this include the devolution of power in the UK  and the current negotiations in France concerning increased autonomy for ": null
    },
    {
        "Corsica": "corsica"
    },
    {
        ". Some other states have traditionally had strong regions, such as the ": null
    },
    {
        "Federal Republic of Germany": "germany"
    },
    {
        " or the ": null
    },
    {
        "autonomous communities": "autonomous communities"
    },
    {
        " of ": null
    },
    {
        "Spain": "spain"
    },
    {
        "; yet others have been structured on the basis of national and municipal government with little in between.       Regional and local authorities elect delegates to the ": null
    },
    {
        "Committee of the Regions": "committee of the regions"
    },
    {
        ". The Committee is a consultative body, and is asked for its opinion by the Council or the Commission on new policies and legislation in the following areas:   Education   Training   Culture   Public Health   Anti-drug support   Trans-European Networks   Social and Economic Cohesion   Structural Funds     On certain issues it works in partnership with the ": null
    },
    {
        "Economic and Social Committee": "economic and social committee"
    },
    {
        ".       The politics of regionalism has also had an impact at the pan-European level. The regions of Europe had lobbied for an increased say in EU affairs, especially the German Länder. This resulted in the creation by the ": null
    },
    {
        "Maastricht Treaty": "maastricht treaty"
    },
    {
        " of the ": null
    },
    {
        "Committee of the Regions": "committee of the regions"
    },
    {
        ", and provision for member states to be represented in the Council by ministers from their regional governments.     The ": null
    },
    {
        "Council of Europe": "council of europe"
    },
    {
        " also has a ": null
    },
    {
        "congress of local and regional authorities": "congress of the council of europe"
    },
    {
        ", similar to the EUs ": null
    },
    {
        "Committee of the Regions": "committee of the regions"
    },
    {
        ".     Strengthening economic competition between communities further supports the creation of authentic regions within the EU and almost all EU member states recently have or currently are re-organizing their administration to create competitive EU regions.   Often these regions better reflect culture and identity and a sense of common interests.     Of the major organisations representing the regions of Europe, the ": null
    },
    {
        "Assembly of European Regions": "assembly of european regions"
    },
    {
        " is the largest. Established in 42 the organisation now brings together over 42 regions from 42 countries, along with 42 interregional associations, across wider Europe.   Apart from playing a key role as the regions political voice on the European stage, AER is a forum for interregional cooperation in numerous areas of regional competence, including economic development, social policy, public health, culture, education and youth. The organisation is also a key defender of the ": null
    },
    {
        "subsidiarity": "subsidiarity"
    },
    {
        " principle in Europe, lobbying for its inclusion in the EU treaties and demanding recognition of the word in dictionaries via the worldwide Subsidiarity is a word movement.     Outside EU institutions, the ": null
    },
    {
        "Council of European Municipalities and Regions": "council of european municipalities and regions"
    },
    {
        " is the largest organisation of local and regional government in Europe; its members are national associations of towns, municipalities and regions from over 42 countries. Together these associations represent some 42 local and regional authorities.     CEMR works to promote a united Europe that is based on local and regional self-government and democracy. To achieve this goal it endeavours to shape the future of Europe by enhancing local and regional contribution, to influence European law and policy, to exchange experience at local and regional level and to cooperate with partners in other parts of the world.     ": null
    }
]