[
    {
        "        Religion in pre-Islamic Arabia included indigenous ": null
    },
    {
        "animistic": "Animism"
    },
    {
        "-": null
    },
    {
        "polytheistic": "Polytheism"
    },
    {
        " beliefs, as well as ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        ", ": null
    },
    {
        "Judaism": "Judaism"
    },
    {
        ", ": null
    },
    {
        "Mandaeism": "Mandaeism"
    },
    {
        ", and ": null
    },
    {
        "Iranian religions": "Iranian Religions"
    },
    {
        " of ": null
    },
    {
        "Zoroastrianism": "Zoroastrianism"
    },
    {
        ", ": null
    },
    {
        "Mithraism": "Mithraism"
    },
    {
        ", and ": null
    },
    {
        "Manichaeism": "Manichaeism"
    },
    {
        ". Arabian polytheism, the dominant form of religion in ": null
    },
    {
        "pre-Islamic Arabia": "Pre-Islamic Arabia"
    },
    {
        ", was based on veneration of ": null
    },
    {
        "deities": "Deity"
    },
    {
        " and spirits. Worship was directed to various gods and goddesses, including ": null
    },
    {
        "Hubal": "Hubal"
    },
    {
        " and the goddesses ": null
    },
    {
        "al-Lāt": "Al-Lat"
    },
    {
        ", ": null
    },
    {
        "al-‘Uzzā": "Al-‘Uzzá"
    },
    {
        ", and ": null
    },
    {
        "Manāt": "Manāt"
    },
    {
        ", at local shrines and temples such as the ": null
    },
    {
        "Kaaba": "Kaaba"
    },
    {
        " in ": null
    },
    {
        "Mecca": "Mecca"
    },
    {
        ". Deities were venerated and invoked through a variety of rituals, including pilgrimages and divination, as well as ritual sacrifice. Different theories ": null
    },
    {
        "have been proposed": "Religion In Pre-Islamic Arabiarole Of Allah"
    },
    {
        " regarding the role of ": null
    },
    {
        "Allah": "Allah"
    },
    {
        " in Meccan religion. Many of the physical descriptions of the pre-Islamic gods are traced to ": null
    },
    {
        "idols": "Cult Image"
    },
    {
        ", especially near the Kaaba, which is said to have contained up to 360 of them.     Other religions were represented to varying, lesser degrees. The influence of the adjacent ": null
    },
    {
        "Roman": "Roman Empire"
    },
    {
        ", ": null
    },
    {
        "Aksumite": "Kingdom Of Aksum"
    },
    {
        ", and ": null
    },
    {
        "Sasanian Empires": "Sasanian Empire"
    },
    {
        " resulted in Christian communities in the northwest, northeast, and south of Arabia. Christianity made a lesser impact, but secured some conversions, in the remainder of the peninsula. With the exception of ": null
    },
    {
        "Nestorianism": "Nestorianism"
    },
    {
        " in the northeast and the ": null
    },
    {
        "Persian Gulf": "Persian Gulf"
    },
    {
        ", the dominant form of Christianity was ": null
    },
    {
        "Miaphysitism": "Miaphysitism"
    },
    {
        ". The peninsula had been a destination for Jewish migration since Roman times, which had resulted in a ": null
    },
    {
        "diaspora": "Diaspora"
    },
    {
        " community supplemented by local converts. Additionally, the influence of the ": null
    },
    {
        "Sasanian Empire": "Sasanian Empire"
    },
    {
        " resulted in ": null
    },
    {
        "Iranian religions": "Iranian Religions"
    },
    {
        " being present in the peninsula. ": null
    },
    {
        "Zoroastrianism": "Zoroastrianism"
    },
    {
        " existed in the east and south, while there is evidence of ": null
    },
    {
        "Manichaeism": "Manichaeism"
    },
    {
        " or possibly ": null
    },
    {
        "Mazdakism": "Mazdak"
    },
    {
        " being practiced in Mecca.          Until about the fourth century, almost all inhabitants of Arabia practiced polytheistic religions. Although significant ": null
    },
    {
        "Jewish": "Judaism"
    },
    {
        " and Christian minorities developed, polytheism remained the dominant belief system in pre-Islamic Arabia.     The contemporary sources of information regarding the pre-Islamic Arabian religion and pantheon include a small number of inscriptions and carvings, pre-Islamic poetry, external sources such as Jewish and Greek accounts, as well as the Muslim tradition, such as the Quran and Islamic writings. Nevertheless, information is limited.     One early attestation of Arabian polytheism was in ": null
    },
    {
        "Esarhaddon": "Esarhaddon"
    },
    {
        "’s Annals, mentioning ": null
    },
    {
        "Atarsamain": "Atarsamain"
    },
    {
        ", ": null
    },
    {
        "Nukhay": "Nuha"
    },
    {
        ", ": null
    },
    {
        "Ruldaiu": "Ruldaiu"
    },
    {
        ", and Atarquruma. Herodotus, writing in his Histories, reported that the Arabs worshipped ": null
    },
    {
        "Orotalt": "Orotalt"
    },
    {
        "  and ": null
    },
    {
        "Alilat": "Al-Lat"
    },
    {
        " . ": null
    },
    {
        "Strabo": "Strabo"
    },
    {
        " stated the Arabs worshipped Dionysus and ": null
    },
    {
        "Zeus": "Zeus"
    },
    {
        ". ": null
    },
    {
        "Origen": "Origen"
    },
    {
        " stated they worshipped Dionysus and ": null
    },
    {
        "Urania": "Urania"
    },
    {
        ".     Muslim sources regarding Arabian polytheism include the eight-century  Book of Idols  by ": null
    },
    {
        "Hisham ibn al-Kalbi": "Hisham Ibn Al-Kalbi"
    },
    {
        ", which ": null
    },
    {
        "F.E. Peters": "Francis Edward Peters"
    },
    {
        " argued to be the most substantial treatment of the religious practices of pre-Islamic Arabia, as well as the writings of the Yemeni historian ": null
    },
    {
        "al-Hasan al-Hamdani": "Abu Muhammad Al-Hasan Al-Hamdani"
    },
    {
        " on south Arabian religious beliefs. Robin, Christian Julien, South Arabia, Religions in Pre-Islamic , in      According to the Book of Idols, descendants of the son of ": null
    },
    {
        "Abraham": "Abraham In Islam"
    },
    {
        "  who had settled in Mecca migrated to other lands. They carried holy stones from the ": null
    },
    {
        "Kaaba": "Kaaba"
    },
    {
        " with them, erected them, and ": null
    },
    {
        "circumambulated": "Circumambulation"
    },
    {
        " them like the Kaaba. This, according to al-Kalbi led to the rise of idol worship. Based on this, it may be probable that Arabs originally venerated stones, later adopting idol-worship under foreign influences. The relationship between a god and a stone as his representation can be seen from the third-century work called the Syriac  Homily of Pseudo-Meliton where he describes the pagan faiths of Syriac-speakers in northern Mesopotamia, who were mostly Arabs.                   The pre-Islamic Arabian religions were polytheistic, with many of the deities names known. Formal pantheons are more noticeable at the level of kingdoms, of variable sizes, ranging from simple city-states to collections of tribes. Robin, Christian Julien, South Arabia, Religions in Pre-Islamic , in  ": null
    },
    {
        "Tribes": "Tribes Of Arabia"
    },
    {
        ", towns, clans, lineages and families had their own cults too. Christian Julien Robin suggests that this structure of the divine world reflected the society of the time.     A large number of deities did not have proper names and were referred to by titles indicating a quality, a family relationship, or a locale preceded by he who or she who .     The religious beliefs and practices of the nomadic ": null
    },
    {
        "Bedouin": "Bedouin"
    },
    {
        " were distinct from those of the settled tribes of towns such as ": null
    },
    {
        "Mecca": "Mecca"
    },
    {
        ". Nomadic religious belief systems and practices are believed to have included ": null
    },
    {
        "fetishism": "Fetishism"
    },
    {
        ", ": null
    },
    {
        "totemism": "Totemism"
    },
    {
        " and ": null
    },
    {
        "veneration of the dead": "Veneration Of The Dead"
    },
    {
        " but were connected principally with immediate concerns and problems and did not consider larger philosophical questions such as the afterlife. Settled urban Arabs, on the other hand, are thought to have believed in a more complex ": null
    },
    {
        "pantheon": "Pantheon"
    },
    {
        " of deities. While the Meccans and the other settled inhabitants of the ": null
    },
    {
        "Hejaz": "Hejaz"
    },
    {
        " worshiped their gods at permanent shrines in towns and oases, the Bedouin practiced their religion on the move.       In south Arabia, mndh’t were anonymous guardian spirits of the community and the ": null
    },
    {
        "ancestor spirits": "Veneration Of The Dead"
    },
    {
        " of the family. They were known as ‘the sun  of their ancestors’.     In north Arabia, ginnaye were known from ": null
    },
    {
        "Palmyrene": "Palmyra"
    },
    {
        " inscriptions as “the good and rewarding gods” and were probably related to the  jinn  of west and central Arabia. Unlike jinn, ginnaye could not hurt nor possess humans and were much more similar to the Roman ": null
    },
    {
        "genius": "Genius"
    },
    {
        ". According to common Arabian belief, ": null
    },
    {
        "soothsayers": "Fortune-Telling"
    },
    {
        ", pre-Islamic philosophers, and poets were inspired by the jinn. However, jinn were also feared and thought to be responsible for causing various diseases and mental illnesses.       Aside from benevolent gods and spirits, there existed malevolent beings. These beings were not attested in the epigraphic record, but were alluded to in pre-Islamic Arabic poetry, and their legends were collected by later Muslim authors.     Commonly mentioned are ": null
    },
    {
        "ghouls": "Ghoul"
    },
    {
        ". Etymologically, the word “ghoul” was derived from the Arabic ghul, from ghala, “to seize”, related to the Sumerian  galla . They are said to have a hideous appearance, with feet like those of an ass. Arabs were said to utter the following couplet if they should encounter one: “Oh ass-footed one, just bray away, we won’t leave the desert plain nor ever go astray.”     Christian Julien Robin notes that all the known south Arabian divinities had a positive or protective role and that evil powers were only alluded to but were never personified. Robin, Christian Julien, South Arabia, Religions in Pre-Islamic , in                  Some scholars postulate that in pre-Islamic Arabia, including in Mecca, Allah was considered to be a deity, possibly a ": null
    },
    {
        "creator deity": "Creator Deity"
    },
    {
        " or a ": null
    },
    {
        "supreme deity": "Supreme Being"
    },
    {
        " in a polytheistic ": null
    },
    {
        "pantheon": "Pantheon"
    },
    {
        ". The word Allah  may have been used as a title rather than a name. The concept of Allah may have been vague in the Meccan religion. According to Islamic sources, Meccans and their neighbors believed that the goddesses ": null
    },
    {
        "Al-lāt": "Al-Lāt"
    },
    {
        ", ": null
    },
    {
        "Al-‘Uzzá": "Al-‘Uzzá"
    },
    {
        ", and ": null
    },
    {
        "Manāt": "Manāt"
    },
    {
        " were the daughters of Allah.     Regional variants of the word Allah occur in both pagan and Christian pre-Islamic inscriptions. ": null
    }
]