[
    {
        "Mythology is the ": null
    },
    {
        "main component": "myth and ritual"
    },
    {
        " of Religion. It refers to systems of concepts that are of high importance to a certain community, making statements concerning the ": null
    },
    {
        "supernatural": "supernatural"
    },
    {
        " or ": null
    },
    {
        "sacred": "sacred"
    },
    {
        ". Religion is the broader term, besides mythological system, it includes ": null
    },
    {
        "ritual": "ritual"
    },
    {
        ". A given ": null
    },
    {
        "mythology": "mythology"
    },
    {
        " is almost always associated with a certain religion such as ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        " with ": null
    },
    {
        "Ancient Greek religion": "ancient greek religion"
    },
    {
        ". Disconnected from its religious system, a myth may lose its immediate relevance to the community and evolve—away from sacred importance—into a ": null
    },
    {
        "legend": "legend"
    },
    {
        " or ": null
    },
    {
        "folktale": "folklore"
    },
    {
        ".     There is a complex relationship between ": null
    },
    {
        "recital of myths and enactment of rituals": "myth and ritual"
    },
    {
        ".          The relationship between religion and myth depends on what definition of myth one uses. By ": null
    },
    {
        "Robert Gravess": "robert graves"
    },
    {
        "definition, a religions ": null
    },
    {
        "traditional stories": "traditional story"
    },
    {
        " are myths if and only if one does not belong to the religion in question. By Segals definition, all religious stories are myths—but simply because nearly all ": null
    },
    {
        "stories": "narrative"
    },
    {
        " are myths. By the ": null
    },
    {
        "folklorists": "folklore studies"
    },
    {
        " definition, all myths are religious stories, but not all religious stories are myths: religious stories that involve the ": null
    },
    {
        "creation of the world": "creation myth"
    },
    {
        "  are myths; however, some religious stories that dont explain how things came to be in their present form  are not myths. Generally, mythology is the main component of religion alongside ritual. : The cosmology of the New Testament is essentially mythical in character.  For example, in the ": null
    },
    {
        "early modern period": "early modern europe"
    },
    {
        ", distinguished Christian theologians developed elaborated witch mythologies which contributed to the intensification of ": null
    },
    {
        "witch trials": "witch trials in the early modern period"
    },
    {
        ".  The Oxford Companion to World Mythology provides the following summary and examples: Religious stories are “holy scripture” to believers—narratives used to support, explain, or justify a particular system’s rituals, theology, and ethics—and are myths to people of other cultures or belief systems. It  is  difficult to believe that the ": null
    },
    {
        "Buddha": "gautama buddha"
    },
    {
        " was ": null
    },
    {
        "conceived in a dream by a white elephant": "maya"
    },
    {
        ", so we call that story a myth as well. But, of course, stories such as the ": null
    },
    {
        "parting of the Sea of Reeds": "crossing the red sea"
    },
    {
        " for the fleeing ": null
    },
    {
        "Hebrews": "israelites"
    },
    {
        ", ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        "’s ": null
    },
    {
        "Night Journey": "isra and miraj"
    },
    {
        ", and the dead ": null
    },
    {
        "Jesus rising from the tomb": "resurrection of jesus"
    },
    {
        " are just as clearly ": null
    },
    {
        "irrational": "irrationality"
    },
    {
        " narratives to which a ": null
    },
    {
        "Hindu": "hindu"
    },
    {
        " or a ": null
    },
    {
        "Buddhist": "buddhism"
    },
    {
        " might understandably apply the word “myth.” All of these stories are definable as myths because they contain events that contradict both our intellectual and physical experience of ": null
    },
    {
        "reality": "reality"
    },
    {
        ".     Most definitions of myth limit myths to stories. Segal 2004, p. 5. See Buxton, p. 18: There are three elements in definition The least problematic is the notion of story: a myth is a narrative, a set of events structured into a sequence . Thus, non-narrative elements of religion, such as ritual, are not myths.     The term ": null
    },
    {
        "theology": "theology"
    },
    {
        " for the first time appears in the writings of the ": null
    },
    {
        "Greek": "ancient greece"
    },
    {
        " philosophers ": null
    },
    {
        "Plato": "plato"
    },
    {
        " and ": null
    },
    {
        "Aristotle": "aristotle"
    },
    {
        ". Initially, theology and mythology were synonymous. With time, both terms gained distinctive qualities:      In the first place, theology is a spiritual or religious attempt of “believers” to explicate their faith. In this sense, it is not neutral and is not attempted from the perspective of removed observation—in contrast to a general history of religions. The implication derived from the religious approach is that it does not provide a formal and indifferent scheme devoid of presuppositions within which all religions could be subsumed. In the second place, theology is influenced by its origins in the Greek and Christian traditions, with the implication that the transmutation of this concept to other religions is endangered by the very circumstances of origination.     According to Hege, both primitive and modern theology is inescapably constrained by its mythical backbone:      ": null
    },
    {
        "Hermeneutically": "hermeneutics"
    },
    {
        ", theologians must recognize that mythical thought permeates the ": null
    },
    {
        "biblical texts": "bible"
    },
    {
        ". ": null
    },
    {
        "Dogmatically": "dogma"
    },
    {
        ", theologians must be aware of the mythological elements of theology and of how extensively theology relies on mythical forms and functions, especially in light of our awareness of the ubiquity of myth.          Religion  is a belief concerning the supernatural, sacred, or ": null
    },
    {
        "divine": "divinity"
    },
    {
        ", and the ": null
    },
    {
        "moral code": "moral code"
    },
    {
        "s, practices, values, and institutions associated with such belief, although some scholars, such as Durkheim, would argue that the supernatural and the divine are not aspects of all religions. Religion , Encyclopædia Britannica 2007. Religious beliefs and practices may include the following: a ": null
    },
    {
        "deity": "deity"
    },
    {
        " or higher being, ": null
    },
    {
        "eschatology": "eschatology"
    },
    {
        ", practices of ": null
    },
    {
        "worship": "worship"
    },
    {
        ", practices of ": null
    },
    {
        "ethics": "ethics"
    },
    {
        " and ": null
    },
    {
        "politics": "politics"
    },
    {
        ". Some religions do not include all these features.       The term  mythology  usually refers either to a system of myths or to the study of myths. Mythology , OED, 2007. However, the word myth itself has multiple definitions:   2007: According to the ": null
    },
    {
        "Merriam-Webster": "merriam-webster"
    },
    {
        " Dictionary, Myth: 1 a: a usually traditional story of ostensibly historical events that serves to unfold part of the ": null
    },
    {
        "world view": "world view"
    },
    {
        " of a people or explain a practice, belief, or natural phenomenon. b: ": null
    },
    {
        "Parable": "parable"
    },
    {
        ", ": null
    },
    {
        "Allegory": "allegory"
    },
    {
        ". 2 a: a popular belief or tradition that has grown up around something or someone; especially: one embodying the ideals and institutions of a society or segment of ": null
    },
    {
        "society": "society"
    },
    {
        ". 2b: an unfounded or false notion. 3: a person or thing having only an imaginary or unverifiable existence. 4: the whole body of myths. Myth , Merriam-Webster Online Dictionary, 2007.     In regards to the study of culture and religion, these are some of the definitions scholars have used:     1968: The ": null
    },
    {
        "classicist": "classicist"
    },
    {
        " Robert Graves": "robert graves"
    },
    {
        " defines myths as whatever religious or heroic legends are so foreign to a students experience that he cannot believe them to be true. Graves 1968, p. v.   1973: Another classicist, GS Kirk, rejects the notion that all myths are religious or sacred. In the category of myth , he includes many legendary accounts that are ": null
    },
    {
        "secular": "secularity"
    },
    {
        " for all practical purposes. Kirk 1973, p. 11.   1997: ": null
    },
    {
        "Folklorists": "folklorist"
    },
    {
        "define a myth as a sacred ": null
    },
    {
        "narrative": "narrative"
    },
    {
        " explaining how the world and humankind came to be in their present form . Dundes 1997, p. 45.   2004: In religious studies, the word myth is usually reserved for stories whose main characters are gods or ": null
    },
    {
        "demigod": "demigod"
    },
    {
        "s. Segal 2004, p. 5.   2004: The classicist Richard Buxton defines a myth as a socially powerful traditional story . Buxton, p. 18   2004: Robert A. Segal, professor of theories of religion at the ": null
    },
    {
        "Lancaster University": "lancaster university"
    },
    {
        ", defines myth broadly as any story whose main figures personalities -- divine, human, or even animal. Excluded would be impersonal forces such as Platos Good.         Given any of the above definitions of myth , the myths of many religions, both ancient and modern, share common elements. Widespread similarities between religious mythologies include the following:   an initial ": null
    },
    {
        "Paradise": "paradise"
    },
    {
        " preceding ordinary historical time Eliade, Myths, Dreams and Mysteries, 1967 p. 59.   the story of a god who undergoes death and resurrection .     The mythical geography of many religions involves an  axis mundi , or Cosmic Center. Eliade, Myths, Rites, Symbols: A Mircea Eliade Reader, 1976, pp. 372-75.   ": null
    },
    {
        "Creation myths": "creation myth"
    },
    {
        "  Supreme deity": "supreme deity"
    },
    {
        "   Heros journey": "heros journey"
    },
    {
        "     The similarities between cultures and time periods can be useful, but it is usually not easy to combine beliefs and histories from different groups. Simplification of cultures and time periods by eliminating detailed data remain vulnerable or flimsy in this area of research.         Though there are similarities among most religious mythologies, there are also contrasts. Many mythologies focus on explanations of the universe, natural phenomena, or other themes of human existence, often ascribing ": null
    },
    {
        "agency": "creation myth"
    },
    {
        " to one or more ": null
    },
    {
        "deities": "deities"
    },
    {
        " or other ": null
    },
    {
        "supernatural": "supernatural"
    },
    {
        " forces. However, some religions have very few of this kind of story of cosmic explanation. For instance, the ": null
    },
    {
        "Buddhist": "buddhism"
    },
    {
        " parable of the arrow": "parable of the arrow"
    },
    {
        " warns against such speculations as the world eternal or not eternal? the soul different from the body? the enlightened exist after death or not? , viewing them as irrelevant to the goal of escaping suffering. The Parable of the Arrow       In ": null
    },
    {
        "academia": "academia"
    },
    {
        ", the term myth often refers to stories whose culture regards them as true . Eliade, Myth and Reality, p. 1, 8-10; The Sacred and the Profane, p. 95 Thus, many scholars will call a body of stories mythology , leaving open the question of whether the stories are true or false. For example, in Tree of Souls: The Mythology of Judaism, English professor Howard Schwartz writes, the definition of mythology offered here does not attempt to determine if biblical or subsequent narratives are true or false, i.e., historically accurate or not . Schwartz, p. lxxviii     Since the beginning of modern philosophy and science in the 16th century, many Western intellectuals have seen myth as outdated. See Armstrong, pp. 122-27. For example, an 18th century intellectual movement called ": null
    },
    {
        "deism": "deism"
    },
    {
        " rejected myths about divine intervention, limiting Gods role to that of a first cause , and a 20th century movement led by the theologian ": null
    },
    {
        "Rudolf Bultmann": "rudolf bultmann"
    },
    {
        " sought to demythologize Christianity, reinterpreting its myths as psychological allegory . Some 19th and early 20th century secular scholars predicted that science would replace myth, even in religion. The anthropologist ": null
    },
    {
        "Edward Burnett Tylor": "edward burnett tylor"
    },
    {
        " argued that science was pushing traditional mythology out of religion, which would henceforth consist only of metaphysics and ethics . And the anthropologist ": null
    },
    {
        "Sir James George Frazer": "sir james george frazer"
    },
    {
        " even wrote, In the last analysis, magic, religion, and science are nothing but theories of thought; and as science has supplanted its predecessors, so it may hereafter be itself superseded by some more perfect hypothesis . In fact, some argued that the Christian religion would be better off without mythology, or even that Christianity would be better off without religion: Muthuraj   Robinson argued in favor of the detaching of the Christian doctrine of God from any necessary dependence on a supernaturalistic worldview . He understood this as a prophetic aspect of the Churchs ministry to the world. At this time atheism was regarded as the Christian Gospel that should be preached to the world. J. J. Altizer, for example, maintained boldly by stating, Throughout its history Christian theology has been thwarted from reaching its intrinsic goal by its bondage to a transcendent, a sovereign, and an impassive God . Bonhoffer called persistently for Religionless Christianity .   In the 20th century, many scholars have resisted this trend, defending myth from modern criticism. Segal, p. 3 ": null
    },
    {
        "Mircea Eliade": "mircea eliade"
    },
    {
        ", a professor of the history of religions, declared that myth did not hold religion back, that myth was an essential foundation of religion, and that eliminating myth would eliminate a piece of the human psyche. According to religious thought, said Eliade, myths establish models for human behavior, and the more religious man is, the more paradigmatic models does he possess as a guide to his attitudes and actions . Eliade believed that modern novels, ideologies, customs, and pastimes contain mythological elements , and that some mythological elements fall within the transconscious , which Eliade defined as a set of universal human images, symbols, and sentiments . Eliade approached myth sympathetically at a time when religious thinkers were trying to purge religion of its mythological elements:   Eliade wrote about sky and sky gods when Christian theology was shaken at its very foundations by the death of God theology. He spoke of God up there when theologians such as J. A. T. Robinson were busy with erasing the mythical language of three-storied universe that underlies the early Christian thought and experience.   Similarly, ": null
    },
    {
        "Joseph Campbell": "joseph campbell"
    },
    {
        " believed that people could not understand their individual lives without mythology to aid them. By recalling the significance of old myths, he encouraged awareness of them. For example, Campbell claimed that mythologys primary function is that of eliciting and supporting a sense of awe before the mystery of being , and that mythology also serves to initiate the individual into the order of realities of his own psyche . In responding to the interview question How would you define mythology? , Joseph Campbell answered: Campbell, Thou Are That, p. 111 James W. Menzies, True Myth, s. 25   My favorite definition of mythology: other peoples religion. My favorite definition of religion: misunderstanding of mythology.       Most religions contain a body of traditional sacred stories that are believed to express profound truth. Some religious organizations and practitioners believe that some or all of their traditional stories are not only sacred and true but also historically accurate and ": null
    },
    {
        "divinely revealed": "revelation"
    },
    {
        " and that calling such stories myths disrespects their special status. Other religious organizations and practitioners have no problem with categorizing their sacred stories as myths.         Some religious believers take offense when what they consider to be historical aspects of their faith are labeled as myth . Such believers distinguish between religious fables or myths, on one hand, and those sacred narratives which are described by their tradition as being history or revelation, on the other. For instance, ": null
    },
    {
        "Catholic priest": "priesthood"
    },
    {
        " Father ": null
    },
    {
        "John A. Hardon": "john hardon"
    },
    {
        " insists that Christianity is not mythology. What we believe in is not religious fantasies, no matter how pious. Hardon Evangelical Christian theologian ": null
    },
    {
        "Carl F. H. Henry": "carl f. h. henry"
    },
    {
        " insisted that Judeo-Christian revelation has nothing in common with the category of myth . Carl F. H. Henry, quoted by Mohler       Especially within Christianity, objection to the word myth rests on a historical basis. By the time of Christ, the Greco-Roman world had started to use the term myth  to mean fable, fiction, lie ; as a result, the early Christian theologians used myth in this sense. Eliade, Myth and Reality, 1968, p. 162. Thus, the derogatory meaning of the word myth is the traditional Christian meaning, and the expression Christian mythology , as used in academic discourse,  may offend Christians for this reason.     In addition, this early Christian use of the term myth passed into popular usage. Eliade, Myths, Dreams and Mysteries, 1967, p. 23. Thus, when essential ": null
    },
    {
        "sacred mysteries": "sacred mysteries"
    },
    {
        " and teachings are described as myth, in modern English, the word often still implies that it is idle fancy, fiction, or falsehood . This description could be taken as a direct attack on ": null
    },
    {
        "religious belief": "religious belief"
    },
    {
        ", quite contrary to the meaning ostensibly intended by the academic use of the term. Further, in academic writing, though myth usually means a fundamental worldview story, even there it is occasionally ambiguous or clearly denotes falsehood , as in the ": null
    },
    {
        "Christ myth theory": "christ myth theory"
    },
    {
        " . The original term ": null
    },
    {
        "mythos": "mythos"
    },
    {
        " may be a better word to distinguish the positive definition from the negative.       Modern day clergy and practitioners within some religious movements have no problem classifying the religions sacred stories as myths . They see the sacred texts as indeed containing religious truths, divinely inspired but delivered in the language of mankind. Some examples follow.       ": null
    },
    {
        "J.R.R. Tolkiens": "j.r.r. tolkien"
    },
    {
        "love of myths and devout ": null
    },
    {
        "Catholic": "catholic church"
    },
    {
        " faith came together in his assertion that ": null
    },
    {
        "mythology": "mythology"
    },
    {
        " is the divine echo of the Truth . Wood Tolkien wrote that myths held fundamental things . Menion, 2003/2004 citing essays by Tolkien using the words fundamental things . He expressed these beliefs in his poem  Mythopoeia  circa 1931, which describes myth-making as an act of sub-creation within Gods primary creation. Tolkien, Mythopoeia, circa 1931. The poem in part says creation is myth-woven and elf-patterned :          Tolkiens opinion was adopted by another ": null
    },
    {
        "Christian": "christianity"
    },
    {
        " writer, ": null
    },
    {
        "C. S. Lewis": "c. s. lewis"
    },
    {
        ", in their conversations: Tolkien explained to Lewis that the story of Christ was the true myth at the very heart of history and at the very root of reality. Pearce ": null
    },
    {
        "C. S. Lewis": "c. s. lewis"
    },
    {
        " freely called the Christ story a true myth , and he believed that even pagan myths express spiritual truths. In his opinion, the difference between the Christ story and pagan myths is that the Christ story is historically as well as spiritually true. Lewis writes, letter to Arthur Greeves, quoted by Brown   The story of Christ is simply a true myth: a myth working on us in the same way as the others, but with this tremendous difference that it really happened: and one must be content to accept it in the same way, remembering that it is Gods myth where the others are mens myths: i. e. the Pagan stories are God expressing Himself through the minds of poets, using such images as He found there, while Christianity is God expressing Himself through what we call real things.     Another Christian writer, the Catholic priest Father ": null
    },
    {
        "Andrew Greeley": "andrew greeley"
    },
    {
        ", freely applies the term myth to Christianity. In his book Myths of Religion, he defends this terminology: Greeley, Myths of Religion; quoted in Bierlein 1994, pp. 304-5.   Many Christians have objected to my use of this word even when I define it specifically. They are terrified by a word which may even have a slight suggestion of fantasy. However, my usage is the one that is common among historians of religion, literary critics, and social scientists. It is a valuable and helpful usage; there is no other word which conveys what these scholarly traditions mean when they refer to myth. The Christian would be well advised to get over his fear of the word and appreciate how important a tool it can be for understanding the content of his faith.     At a Consultation on the Relationship Between the Wesleyan Tradition   and the Natural Sciences in Kansas City, Missouri, on October 19, 1991, Dennis Bratcher presented a discussion of the adaptation of Near Eastern mythical thought by the Israelites. Bratcher Bratcher argued that the Old Testament absorbed Near Eastern pagan mythology . During this presentation, he gave the following disclaimer:   the term myth as used here does not mean false or fiction. Even in my old and yellowed Websters, fiction is the third meaning of the word. In its primary and more technical meaning myth refers to a story or group of stories that serve to explain how a particular society views their world.       Some ": null
    },
    {
        "Jewish": "judaism"
    },
    {
        " scholars, including ": null
    },
    {
        "Dov Noy": "dov noy"
    },
    {
        ", a professor of folklore at Hebrew University and founder of the Israel Folktale Archives, and ": null
    },
    {
        "Howard Schwartz": "howard schwartz"
    },
    {
        ", Jewish anthologist and English professor at the University of Missouri – St. Louis, have discussed traditional Jewish stories as mythology . Schram     Schwartz authored the book Tree of Souls: The Mythology of Judaism. It consists of myths and belief statements excerpted from—and, in some cases, synthesized from a number of excerpts from—both Biblical and non-Biblical Jewish texts. According to Schwartz, the Jewish people continue to elaborate on, and compose additions to, their traditional mythology. Schwartz, p. lxxv In the books introduction, Schwartz states that the word myth , as used in the book, is not offered to mean something that is not true, as in the current popular usage .       ": null
    },
    {
        "Neopagans": "neopaganism"
    },
    {
        " frequently refer to their sacred stories as myths . ": null
    },
    {
        "Asatru": "asatru"
    },
    {
        ", a modern-day revival of Germanic Paganism, holds that the ": null
    },
    {
        "Eddas": "eddas"
    },
    {
        ", Myths and ": null
    },
    {
        "Norse Sagas": "saga"
    },
    {
        " are the divinely inspired wisdom of religion . About Us ": null
    },
    {
        "Wicca": "wicca"
    },
    {
        ", another Neopagan movement, also applies the term mythology to its stories. The Wheel of the Year / the Sabbats ; What is Wicca? ; Workshops and Talks       The ": null
    },
    {
        "Dewey Decimal system": "dewey decimal classification"
    },
    {
        " covers religion in the 200 range, with books on Religious mythology & social theology , a subset listed under 201. http://www.oclc.org/dewey/resources/summaries/deweysummaries.pdf Dewey Decimal Classification system . Online Computer Library Center, 2005. ": null
    }
]