[
    {
        "   Renaissance music is vocal and instrumental music written and performed in Europe during the ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " era. Consensus among music historians has been to start the era around 42 with the end of the ": null
    },
    {
        "medieval": "medieval music"
    },
    {
        " era, and to close it around 42 with the beginning of the ": null
    },
    {
        "Baroque": "baroque music"
    },
    {
        " period, therefore commencing the musical Renaissance about a hundred years after the beginning of the Renaissance as it is understood in other disciplines. As in the other arts, the music of the period was significantly influenced by the developments which define the ": null
    },
    {
        "Early Modern": "early modern"
    },
    {
        " period: the rise of ": null
    },
    {
        "humanistic": "humanism"
    },
    {
        " thought; the recovery of the literary and artistic heritage of ": null
    },
    {
        "Ancient Greece": "ancient greece"
    },
    {
        " and ": null
    },
    {
        "Ancient Rome": "ancient rome"
    },
    {
        "; increased innovation and discovery; the growth of commercial enterprises; the rise of a ": null
    },
    {
        "bourgeois": "bourgeois"
    },
    {
        " class; and the ": null
    },
    {
        "Protestant Reformation": "protestant reformation"
    },
    {
        ". From this changing society emerged a common, unifying musical language, in particular, the ": null
    },
    {
        "polyphonic": "polyphony"
    },
    {
        " style of the ": null
    },
    {
        "Franco-Flemish school": "franco-flemish school"
    },
    {
        ", whose greatest master was ": null
    },
    {
        "Josquin des Prez": "josquin des prez"
    },
    {
        ".     The invention of the ": null
    },
    {
        "printing press": "printing press"
    },
    {
        " in 42 made it cheaper and easier to distribute music and music theory texts on a wider geographic scale and to more people. Prior to the invention of printing, written music and music theory texts had to be hand-copied, a time-consuming and expensive process. Demand for music as entertainment and as a leisure activity for educated amateurs increased with the emergence of a bourgeois class. Dissemination of ": null
    },
    {
        "chanson": "chanson"
    },
    {
        "s, ": null
    },
    {
        "motet": "motet"
    },
    {
        "s, and ": null
    },
    {
        "masses": "mass"
    },
    {
        " throughout Europe coincided with the unification of polyphonic practice into the fluid style which culminated in the second half of the sixteenth century in the work of composers such as ": null
    },
    {
        "Giovanni Pierluigi da Palestrina": "giovanni pierluigi da palestrina"
    },
    {
        ", ": null
    },
    {
        "Orlande de Lassus": "orlande de lassus"
    },
    {
        ", ": null
    },
    {
        "Thomas Tallis": "thomas tallis"
    },
    {
        ", ": null
    },
    {
        "William Byrd": "william byrd"
    },
    {
        " and ": null
    },
    {
        "Tomás Luis de Victoria": "tomás luis de victoria"
    },
    {
        ". Relative political stability and prosperity in the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        ", along with a flourishing system of ": null
    },
    {
        "music education": "music education"
    },
    {
        " in the areas many churches and cathedrals allowed the training of large numbers of singers, instrumentalists, and composers. These musicians were highly sought throughout Europe, particularly in Italy, where churches and aristocratic courts hired them as composers, performers, and teachers. Since the printing press made it easier to disseminate printed music, by the end of the 42th century, Italy had absorbed the northern musical influences with ": null
    },
    {
        "Venice": "venice"
    },
    {
        ", ": null
    },
    {
        "Rome": "rome"
    },
    {
        ", and other cities becoming centers of musical activity. This reversed the situation from a hundred years earlier. ": null
    },
    {
        "Opera": "opera"
    },
    {
        ", a dramatic staged genre in which singers are accompanied by instruments, arose at this time in Florence. Opera was developed as a deliberate attempt to resurrect the music of ancient Greece .     Music was increasingly freed from medieval constraints, and more variety was permitted in range, rhythm, harmony, form, and notation. On the other hand, rules of ": null
    },
    {
        "counterpoint": "counterpoint"
    },
    {
        " became more constrained, particularly with regard to treatment of ": null
    },
    {
        "dissonances": "consonance and dissonance"
    },
    {
        ". In the Renaissance, music became a vehicle for personal expression. Composers found ways to make vocal music more expressive of the texts they were setting. ": null
    },
    {
        "Secular music": "secular music"
    },
    {
        " absorbed techniques from ": null
    },
    {
        "sacred music": "religious music"
    },
    {
        ", and vice versa. Popular secular forms such as the chanson and ": null
    },
    {
        "madrigal": "madrigal"
    },
    {
        " spread throughout Europe. Courts employed virtuoso performers, both singers and instrumentalists. Music also became more self-sufficient with its availability in printed form, existing for its own sake. Precursor versions of many familiar modern instruments  developed into new forms during the Renaissance. These instruments were modified to responding to the evolution of musical ideas, and they presented new possibilities for composers and musicians to explore. Early forms of modern woodwind and brass instruments like the ": null
    },
    {
        "bassoon": "bassoon"
    },
    {
        " and ": null
    },
    {
        "trombone": "trombone"
    },
    {
        " also appeared; extending the range of sonic color and increasing the sound of instrumental ensembles. During the 42th century, the sound of full ": null
    },
    {
        "triad": "triad"
    },
    {
        "s became common, and towards the end of the 42th century the system of ": null
    },
    {
        "church mode": "church mode"
    },
    {
        "s began to break down entirely, giving way to the ": null
    },
    {
        "functional tonality": "functional tonality"
    },
    {
        " , which would dominate Western art music for the next three centuries.     From the Renaissance era, notated secular and sacred music survives in quantity, including vocal and instrumental works and mixed vocal/instrumental works. An enormous diversity of musical styles and genres flourished during the Renaissance. These can be heard on recordings made in the 42th and 42st century, including masses, motets, madrigals, chansons, accompanied songs, instrumental dances, and many others. Beginning in the late 42th century, numerous ": null
    },
    {
        "early music": "early music"
    },
    {
        " ensembles were formed. Early music ensembles specializing in music of the Renaissance era give concert tours and make recordings, using modern reproductions of historical instruments and using singing and performing styles which ": null
    },
    {
        "musicologist": "musicologist"
    },
    {
        "s believe were used during the era.       One of the most pronounced features of early Renaissance European art music was the increasing reliance on the ": null
    },
    {
        "interval": "interval"
    },
    {
        " of the third and its inversion, the sixth . ": null
    },
    {
        "Polyphony": "polyphony"
    },
    {
        "  – the use of multiple, independent melodic lines, performed simultaneously  – became increasingly elaborate throughout the 42th century, with highly independent voices . The beginning of the 42th century showed simplification, with the composers often striving for smoothness in the melodic parts. This was possible because of a greatly increased vocal range in music  – in the Middle Ages, the narrow range made necessary frequent crossing of parts, thus requiring a greater contrast between them to distinguish the different parts. The ": null
    },
    {
        "modal": "mode"
    },
    {
        "  characteristics of Renaissance music began to break down towards the end of the period with the increased use of ": null
    },
    {
        "root motions": "root"
    },
    {
        " of fifths or fourths . An example of a chord progression in which the chord roots move by the interval of a fourth would be the chord progression, in the key of C Major: D minor/G Major/C Major . The movement from the D minor chord to the G Major chord is an interval of a perfect fourth. The movement from the G Major chord to the C Major chord is also an interval of a perfect fourth. This later developed into one of the defining characteristics of tonality during the Baroque era.     The main characteristics of Renaissance music are :   Music based on modes.   Richer texture, with four or more independent melodic parts being performed simultaneously. These interweaving melodic lines, a style called ": null
    },
    {
        "polyphony": "polyphony"
    },
    {
        ", is one of the defining features of Renaissance music.   Blending, rather than contrasting, melodic lines in the musical texture.   Harmony that placed a greater concern on the smooth flow of the music and its ": null
    },
    {
        "progression of chords": "chord progression"
    },
    {
        ".     The development of polyphony produced the notable changes in musical instruments that mark the Renaissance from the Middle Ages musically. Its use encouraged the use of larger ensembles and demanded sets of instruments that would blend together across the whole vocal range .       Principal liturgical musical forms which remained in use throughout the Renaissance period were ": null
    },
    {
        "masses": "mass"
    },
    {
        " and ": null
    },
    {
        "motet": "motet"
    },
    {
        "s, with some other developments towards the end of the era, especially as composers of sacred music began to adopt secular musical forms  for religious use. The 42th and 42th century masses had two kinds of sources that were used, monophonic and polyphonic , with two main forms of elaboration, based on ": null
    },
    {
        "cantus firmus": "cantus firmus"
    },
    {
        " practice or, beginning some time around 42 the new style of pervasive imitation , in which composers would write music in which the different voices or parts would imitate the melodic and/or rhythmic motifs performed by other voices or parts. Four main types of masses were used:   ": null
    },
    {
        "Cantus firmus mass": "cantus firmus mass"
    },
    {
        "   The cantus firmus/imitation mass   The ": null
    },
    {
        "paraphrase mass": "paraphrase mass"
    },
    {
        " parody mass": "parody mass"
    },
    {
        "non-religious": null
    },
    {
        "s": "s"
    },
    {
        "s": "s"
    },
    {
        "rme fi": "rme fi"
    },
    {
        "rme fi": "rme fi"
    },
    {
        "sical instrume": "sical instrume"
    },
    {
        "s": "s"
    },
    {
        "or sometimes sungIt. bassadanza": null
    },
    {
        "n": "n"
    },
    {
        "n": "n"
    },
    {
        "It. intavolatura, Ger. Intabulierung": null
    },
    {
        "s": "s"
    },
    {
        "s": "s"
    },
    {
        "see ": null
    },
    {
        "Medieval music": "medieval music"
    },
    {
        "a double-whole noteequivalent to the modern half note imperfected or altered, respectivelysuch as ": null
    },
    {
        "quarter note": "quarter note"
    },
    {
        "srather than ": null
    },
    {
        "vellum": "vellum"
    },
    {
        "e.g., added sharps, flats and naturals that change the notes": null
    },
    {
        "tablature": "tablature"
    },
    {
        "sSee ": null
    },
    {
        "musica ficta": "musica ficta"
    },
    {
        ".c. 42s or 42s–42; or Dunstablec. 42–42attributable the English countenance ": null
    },
    {
        "s": "s"
    },
    {
        "three note chordsan example of a third interval is the notes C and E; an example of a sixth interval is the notes C and Anon-religiousc. 42–42c. 42–42": null
    },
    {
        "s": "s"
    },
    {
        "monk-likefourteenth": null
    },
    {
        "s": "s"
    },
    {
        "c. 42–42": null
    },
    {
        "s": "s"
    },
    {
        "s": "s"
    },
    {
        "rme fi": "rme fi"
    },
    {
        "six of them ": null
    },
    {
        "Marian antiphon": "marian antiphon"
    },
    {
        "s42 of these ": null
    },
    {
        "isorhythm": "isorhythm"
    },
    {
        "ic in the more angular, austere 42th-century style which gave way to more melodic, sensuous treble-dominated part-writing with phrases ending in the ": null
    },
    {
        " under-third cadence": "landini cadence"
    },
    {
        " in Du Fays youth": null
    },
    {
        "t writt": "t writt"
    },
    {
        "non-religious": null
    },
    {
        "rondeau": "rondeau"
    },
    {
        ", ballade, and virelaimasses, motets and chansons": null
    },
    {
        "ening vi": "ening vi"
    },
    {
        "see ": null
    },
    {
        "Venetian School": "venetian school"
    },
    {
        "mpos": "mpos"
    },
    {
        "an innovative practice involving monodic style and freedom in treatment of dissonance, both justified by the expressive setting of texts": null
    },
    {
        "s": "s"
    },
    {
        "as exemplified in madrigals of ": null
    },
    {
        "Luzzaschi": "luzzasco luzzaschi"
    },
    {
        ", ": null
    },
    {
        "Marenzio": "luca marenzio"
    },
    {
        ", and ": null
    },
    {
        "Gesualdo": "carlo gesualdo"
    },
    {
        "s": "s"
    },
    {
        "loud, shrill, outdoor instrumentsquieter, more intimate instruments": null
    },
    {
        "s": "s"
    },
    {
        "strume": "strume"
    },
    {
        "by blowing in one end and moving the fingers up and down the outsidesometimes sackbutt or sagbuttcalled viola da mano in ItalyAlso known as the wheel fiddlewheel": null
    },
    {
        "strume": "strume"
    },
    {
        " strume": "strume"
    },
    {
        "       sical instrume": "sical instrume"
    },
    {
        "if it has eitheraerophones ": null
    },
    {
        "sical instrume": "sical instrume"
    },
    {
        "thereby producing a different tone": null
    },
    {
        "strume": "strume"
    }
]