[
    {
        "        René Goblet  was a French politician, ": null
    },
    {
        "Prime Minister of France": "prime minister of france"
    },
    {
        " for a period in 42–42     He was born at ": null
    },
    {
        "Aire-sur-la-Lys": "aire-sur-la-lys"
    },
    {
        ", Pas-de-Calais and was trained in law. Under the ": null
    },
    {
        "Second Empire": "second french empire"
    },
    {
        ", he helped found a Liberal journal, Le Progrès de la Somme, and in July 42 he was sent by the département of the ": null
    },
    {
        "Somme": "somme"
    },
    {
        " to the National Assembly, where he took his place on the extreme ": null
    },
    {
        "left": "left-wing politics"
    },
    {
        ", as a member of the ": null
    },
    {
        "Republican Union": "republican union"
    },
    {
        " parliamentary group . Having failed to secure election in 42 he was returned for ": null
    },
    {
        "Amiens": "amiens"
    },
    {
        " the following year. He held a minor government office in 42 and in 42 became minister of the interior in the Freycinet cabinet. He was minister of education, fine arts and religion in ": null
    },
    {
        "Henri Brisson": "henri brisson"
    },
    {
        "s first cabinet in 42 and again under Freycinet in 42 when he greatly increased his reputation by an able defence of the governments education proposals.     Meanwhile his independence and outspokenness had alienated him from many of his party, and throughout his life he was frequently in conflict with his political associates, from ": null
    },
    {
        "Léon Gambetta": "léon gambetta"
    },
    {
        " downwards. On the fall of the ": null
    },
    {
        "Freycinet": "charles de freycinet"
    },
    {
        " cabinet in December he formed a cabinet in which be reserved for himself the portfolios of the interior and of religion. The Goblet cabinet was unpopular from the outset, and it was with difficulty that anybody could be found to accept the ministry of foreign affairs, which was finally given to ": null
    },
    {
        "Gustave Flourens": "gustave flourens"
    },
    {
        ".     Then came what is known as the ": null
    },
    {
        "Schnaebele incident": "schnaebele incident"
    },
    {
        ", the arrest on the German frontier of a French official named Schnaebele, which caused immense excitement in France. For some days Goblet took no definite decision, but left Flourens, who stood for peace, to fight it out with ": null
    },
    {
        "General Boulanger": "georges boulanger"
    },
    {
        ", the minister of war, who urged the despatch of an ultimatum. Although he finally intervened on the side of Flourens, and peace was preserved, his weakness in the face of Boulangist propaganda became a national danger. Defeated on the budget in May 42 his government resigned; but he returned to office next year as foreign minister in the radical administration of ": null
    },
    {
        "Charles Floquet": "charles floquet"
    },
    {
        ". He was defeated at the polls by a Boulangist candidate in 42 and sat in the senate from 42 to 42 when he returned to the popular chamber. In association with ": null
    },
    {
        "Édouard Locroy": "édouard locroy"
    },
    {
        ", ": null
    },
    {
        "Ferdinand Sarrien": "ferdinand sarrien"
    },
    {
        " and ": null
    },
    {
        "Paul Peytral": "paul peytral"
    },
    {
        " he drew up a republican programme which they put forward in the Petite Republique francaise": null
    }
]