[
    {
        "   Renée Vivien , was a ": null
    },
    {
        "British": "united kingdom of great britain and ireland"
    },
    {
        " poet who wrote in French, in the style of the ": null
    },
    {
        "Symbolistes": "symbolism"
    },
    {
        " and the ": null
    },
    {
        "Parnassiens": "parnassianism"
    },
    {
        ". A high-profile lesbian in the Paris of the ": null
    },
    {
        "Belle Époque": "belle époque"
    },
    {
        ", she was as notable for her lifestyle as for her work, which has received more attention following a recent revival of interest in ": null
    },
    {
        "Sapphic verse": "sappho"
    },
    {
        ". Many of her poems are autobiographical, reflecting a life of extreme hedonism, leading to early death. She was the subject of a pen-portrait by her friend ": null
    },
    {
        "Colette": "colette"
    },
    {
        ".         Renée Vivien was born Pauline Mary Tarn in London, England to a wealthy British father and an American mother from ": null
    },
    {
        "Jackson, Michigan": "jackson, michigan"
    },
    {
        ". She grew up in Paris and London. Upon inheriting her fathers fortune at 42 she emigrated permanently to France.     In Paris, Viviens dress and lifestyle were as notorious among the ": null
    },
    {
        "bohemian": "bohemian"
    },
    {
        " set as was her verse. She lived lavishly, as an open lesbian, and carried on a well-known affair with American heiress and writer ": null
    },
    {
        "Natalie Clifford Barney": "natalie clifford barney"
    },
    {
        ". She also harboured a lifelong obsession with her closest childhood friend and neighbour, Violet Shillito – a relationship that remained unconsummated. In 42 Vivien abandoned this chaste love, when the great romance with Natalie Barney ensued. The following year Shillito died of ": null
    },
    {
        "typhoid fever": "typhoid fever"
    },
    {
        ", a tragedy from which Vivien, guilt-ridden, never fully recovered.            By 42 the tempestuous and often jealous relationship with Natalie Barney had already collapsed. Vivien found Barneys infidelities too stressful. When Barney spent the second half of 42 in the United States, Vivien chose not to follow; upon Natalies return, she refused to see her. After their breakup, Barney never resigned herself to the separation. She made strenuous efforts to get Vivien back, efforts that did not end until the latters death. This included sending mutual friends to visit Vivien , as well as flowers and letters begging Vivien to reconsider.     In 42 Vivien became involved with the immensely wealthy ": null
    },
    {
        "Baron": "baron"
    },
    {
        "ess ": null
    },
    {
        "Hélène van Zuylen": "hélène van zuylen"
    },
    {
        ", one of the Paris ": null
    },
    {
        "Rothschilds": "rothschilds"
    },
    {
        ". Though a lesbian, Zuylen was married and the mother of two sons. Zuylen provided much-needed emotional support and stability. Zuylens social position did not allow for a public relationship, but she and Vivien often travelled together and continued a discreet affair for a number of years. In letters to her confidant, the French journalist and ": null
    },
    {
        "Classical scholar": "classical scholar"
    },
    {
        " Jean Charles-Brun, Vivien considered herself married to the Baroness. She may have published poetry and prose in collaboration with Zuylen under a pseudonym, Paule Riversdale. The true attribution of these works is uncertain, however; some scholars believe they were written solely by Vivien. Even certain books published under Zuylens name may be, in fact, Viviens work.     While still with Zuylen, Vivien received a letter from a mysterious admirer in ": null
    },
    {
        "Istanbul": "istanbul"
    },
    {
        ", Kérimé Turkhan Pasha, the wife of a ": null
    },
    {
        "Turkish": "ottoman empire"
    },
    {
        " diplomat. This launched an intensely passionate correspondence, followed by brief clandestine encounters. Kérimé, who was French-educated and cultivated, nevertheless lived according to ": null
    },
    {
        "Islamic": "islamic"
    },
    {
        " tradition. Isolated and veiled, she could neither travel freely nor leave her husband. Meanwhile, Vivien would not give up the Baroness de Zuylen. In 42 Zuylen abruptly left Vivien for another woman, which quickly fuelled gossip within the lesbian coterie of Paris. Deeply shocked and humiliated, Vivien fled to Japan and Hawaii with her mother, becoming seriously ill on the voyage. Another blow came in 42 when Kérimé, upon moving with her husband to ": null
    },
    {
        "Saint Petersburg": "saint petersburg"
    },
    {
        ", ended their affair.     Vivien was terribly affected by these losses and accelerated into a psychological downward spiral, already in motion. She turned increasingly to alcohol, ": null
    },
    {
        "drugs": "drugs"
    },
    {
        ", and ": null
    },
    {
        "sadomasochistic": "sadomasochistic"
    },
    {
        " fantasies. Always eccentric, she began to indulge her most bizarre ": null
    },
    {
        "fetishes": "fetishes"
    },
    {
        " and ": null
    },
    {
        "neuroses": "neuroses"
    },
    {
        ". Mysterious sexual escapades left her without rest for days. She entertained guests with champagne dinner parties, only to abandon them when summoned by a demanding lover. Plunged into a suicidal depression, she refused to take proper nourishment, a factor that eventually contributed to her death.     The great French writer ": null
    },
    {
        "Colette": "colette"
    },
    {
        ", who was Viviens neighbour from 42 to 42 immortalized this aberrant period in The Pure and the Impure, a collection of portraits showing the spectrum of sexual behaviour. Written in the 42s and originally published in 42 its factual accuracy is questionable; Natalie Barney reportedly did not concur with Colettes characterization of Vivien. Yet it remains a rare glimpse of the poets dissipated life, written by one of her contemporaries.         Vivien was cultivated and very well travelled, especially for a woman of the late ": null
    },
    {
        "Victorian": "victorian era"
    },
    {
        " and ": null
    },
    {
        "Edwardian": "edwardian"
    },
    {
        " periods. She wintered in ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", visited China, and explored much of the Middle East, as well as Europe and ": null
    },
    {
        "America": "united states"
    },
    {
        ". Contemporaries considered her beautiful and elegant, with blonde hair, brown eyes flecked with gold, and a soft-spoken ": null
    },
    {
        "androgynous": "androgynous"
    },
    {
        " presence. Before the manifestations of illness, she was well-proportioned and fashionably slender. She wore expensive clothes and particularly loved ": null
    },
    {
        "Lalique": "lalique"
    },
    {
        " jewellery.     Her Paris home was a luxurious ground-floor apartment at 42 avenue du ": null
    },
    {
        "Bois de Boulogne": "bois de boulogne"
    },
    {
        "  that opened onto a ": null
    },
    {
        "Japanese garden": "japanese garden"
    },
    {
        ". She purchased antique furnishings from London and exotic ": null
    },
    {
        "objets dart": "work of art"
    },
    {
        " from the Far East. Fresh flowers were abundant, as were offerings of Lady Apples to a collection of shrines, statuettes, icons, and ": null
    },
    {
        "Buddhas": "buddhas"
    },
    {
        ".     A public square is named in her honor in Paris : ": null
    },
    {
        "place Renée-Vivien": ":fr:place renée-vivien"
    },
    {
        ", in ": null
    },
    {
        "Le Marais": "le marais"
    },
    {
        ", central historic district of the French capital.         Above all, Vivien romanticized death. While visiting London in 42 deeply despondent and ruinously in debt, she tried to kill herself by drinking an excess of ": null
    },
    {
        "laudanum": "laudanum"
    },
    {
        ". She stretched out on her ": null
    },
    {
        "divan": "divan"
    },
    {
        " with a bouquet of ": null
    },
    {
        "violets": "violet"
    },
    {
        " held over her heart. The suicide failed, but while in England, she contracted ": null
    },
    {
        "pleurisy": "pleurisy"
    },
    {
        "; later, upon her return to Paris, she grew considerably weaker. According to biographer Jean-Paul Goujon, Vivien suffered from chronic ": null
    },
    {
        "gastritis": "gastritis"
    },
    {
        ", due to years of ": null
    },
    {
        "chloral hydrate": "chloral hydrate"
    },
    {
        " and alcohol abuse. She had also started to refuse to eat. By the time of her death, she weighed about 42  lbs. Multiple ": null
    },
    {
        "neuritis": "neuritis"
    },
    {
        " caused ": null
    },
    {
        "paralysis": "paralysis"
    },
    {
        " of her limbs. By the summer of 42 she walked with a cane.     Vivien died in Paris on the morning of 42 November 42 at the age of 42; the cause of death was reported at the time as lung congestion , but likely resulted from ": null
    },
    {
        "pneumonia": "pneumonia"
    },
    {
        " complicated by alcoholism, ": null
    },
    {
        "drug abuse": "drug abuse"
    },
    {
        ", and ": null
    },
    {
        "anorexia nervosa": "anorexia nervosa"
    },
    {
        ". She was interred at ": null
    },
    {
        "Passy Cemetery": "cimetière de passy"
    },
    {
        " in the same exclusive Parisian neighbourhood where she had lived.     During her brief life, Vivien was an extremely prolific poet who came to be known as the Muse of the Violets , derived from her love of the flower. Her obsession with ": null
    },
    {
        "violets": "violet"
    },
    {
        " was a reminder of her beloved childhood friend, Violet Shillito.     She took to heart all the mannerisms of ": null
    },
    {
        "Parnassianism": "parnassianism"
    },
    {
        " and of ": null
    },
    {
        "Symbolism": "symbolism"
    },
    {
        ", as one of the last poets to claim allegiance to the school. Her compositions include ": null
    },
    {
        "sonnets": "sonnets"
    },
    {
        ", ": null
    },
    {
        "hendecasyllabic verse": "hendecasyllabic verse"
    },
    {
        ", and ": null
    },
    {
        "prose poetry": "prose poetry"
    },
    {
        ".     Virtually all her verse is veiled autobiography written in the French language; most of it has never been translated into English. Her principal published books of verse are Cendres et Poussières , La Vénus des aveugles , A lheure des mains jointes , Flambeaux éteints , Sillages , Poèmes en Prose , Dans un coin de violettes , and Haillons .     Her poetry has achieved greater appeal and a wider audience, as have the works of ": null
    },
    {
        "Natalie Clifford Barney": "natalie clifford barney"
    },
    {
        ", due to the contemporary rediscovery of the works of the ": null
    },
    {
        "ancient Greek": "ancient greek"
    },
    {
        " poet ": null
    },
    {
        "Sappho": "sappho"
    }
]