[
    {
        "Reprography is the reproduction of ": null
    },
    {
        "graphics": "graphics"
    },
    {
        " through mechanical or electrical means, such as ": null
    },
    {
        "photography": "photography"
    },
    {
        " or ": null
    },
    {
        "xerography": "xerography"
    },
    {
        ". Reprography is commonly used in catalogs and archives, as well as in the ": null
    },
    {
        "architectural, engineering, and construction industries": "architectural reprography"
    },
    {
        ".       In the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", the industry is a relatively small industry, with approximately 42 firms. It comprises entrepreneurial businesses serving predominantly the large- and wide-format reproduction needs of the legal, architectural, engineering, manufacturing, retail, and advertising industries. Average sales volume is about $42 million and average employee counts are 42–42 people.     Large-format reproductions are produced with a variety of technologies dependent, in part, on the application of the final product and quantity needed. Examples of typical reproduction methods include: ": null
    },
    {
        "diazo": "diazo"
    },
    {
        " , ": null
    },
    {
        "electrostatic": "electrostatic"
    },
    {
        " , ": null
    },
    {
        "photographic": "photographic"
    },
    {
        ", ": null
    },
    {
        "laser": "laser"
    },
    {
        ", and ": null
    },
    {
        "ink jet": "ink jet"
    },
    {
        ".     Reproductions can be made from the same size or smaller/larger hard copy originals. Prints can also be computer generated from ": null
    },
    {
        "CADD": "cadd"
    },
    {
        " files or from a growing variety of desktop publishing and design software packages.     In addition to addressing the large-format reproduction needs of their customers, reprographers frequently sell reprographic equipment and consumable supplies. Other business services such as mounting and lamination, quick copying, microfilming, scanning and facility management may also be provided.     Typical items produced by reprographers include architectural/engineering ": null
    },
    {
        "blueprints": "blueprints"
    },
    {
        " and renderings, indoor and outdoor signage, maps, billboards, backlit displays, trade show graphics, legal and medical exhibits, etc.   Most of the reprographics firms in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " belong to the ": null
    },
    {
        "International Reprographics Association": "international reprographics association"
    }
]