[
    {
        "Requiem  is a ": null
    },
    {
        "short story": "short story"
    },
    {
        " by American writer ": null
    },
    {
        "Robert A. Heinlein": "robert a. heinlein"
    },
    {
        ", a sequel to his ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novella ": null
    },
    {
        "The Man Who Sold the Moon": "the man who sold the moon"
    },
    {
        " , although it was in fact published several years earlier than that story, in  Astounding , January 42 The story was also performed as a play on October 42 42 on the NBC Radio Network program  X Minus One .     It is also the first story in the retrospective  Requiem: New Collected Works by Robert A. Heinlein and Tributes to the Grand Master .       The story centers around ": null
    },
    {
        "Delos David Harriman": "d. d. harriman"
    },
    {
        ", the lead character of The Man Who Sold the Moon. Harriman, a tycoon and latter-day ": null
    },
    {
        "robber baron": "robber baron"
    },
    {
        ", had always dreamed of going to the ": null
    },
    {
        "Moon": "moon"
    },
    {
        ", and had spent much of his career and resources making space flight a practical commercial enterprise. Unfortunately, his business partners prevented him from taking the early flights because they could not risk the public face of their company. Now an old man, Harriman has still not been to the Moon, a fact that frustrates him, since he lives in a world where space travel is so commonplace that carnivals have their own barnstorming spacecraft. Although no longer bound by his contractual obligations, he is now too old to pass the medical examination needed for space travel.     Very wealthy, Harriman bribes two spacemen to help him get to the Moon after encountering them at a ": null
    },
    {
        "funfair": "funfair"
    },
    {
        " in ": null
    },
    {
        "Butler": "butler, missouri"
    },
    {
        ", a small town outside ": null
    },
    {
        "Kansas City, Missouri": "kansas city, missouri"
    },
    {
        " , where they sell rides on their old, somewhat run-down ship.     The three of them fight many obstacles, including Harrimans heirs, who want him declared ": null
    },
    {
        "mentally incompetent": "competence"
    },
    {
        " or ": null
    },
    {
        "senile": "dementia"
    },
    {
        " before he can spend their inheritance. In the end, Harriman finally makes it to the Moon, only to die on the surface soon after landing, content at finally having reached his goal. His body is left there, with his epitaph scrawled on the tag from an oxygen bottle. It is ": null
    },
    {
        "Robert Louis Stevenson": "robert louis stevenson"
    },
    {
        "s Requiem , which is inscribed on his own headstone in ": null
    },
    {
        "Samoa": "samoa"
    },
    {
        ".        on the ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        "                      ": null
    }
]