[
    {
        "        The Resolution class was a ": null
    },
    {
        "class": "ship class"
    },
    {
        " of four nuclear ": null
    },
    {
        "ballistic missile submarines": "ballistic missile submarine"
    },
    {
        "  built for the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " as part of the ": null
    },
    {
        "UK Polaris programme": "uk polaris programme"
    },
    {
        ". Each submarine was armed with up to 16 ": null
    },
    {
        "UGM-27 Polaris A-3": "ugm-27 polaris"
    },
    {
        " nuclear missiles": "submarine-launched ballistic missile"
    },
    {
        ".     The class comprised , ,  and . They were built by ": null
    },
    {
        "Vickers Armstrong": "vickers shipbuilding and engineering ltd"
    },
    {
        " in ": null
    },
    {
        "Barrow-in-Furness": "barrow-in-furness"
    },
    {
        " and ": null
    },
    {
        "Cammell Laird": "cammell laird"
    },
    {
        " in ": null
    },
    {
        "Birkenhead": "birkenhead"
    },
    {
        " between 1964 and 1968. All four boats were based at ": null
    },
    {
        "HM Naval Base Clyde ": "hmnb clyde"
    },
    {
        ",  west of ": null
    },
    {
        "Glasgow": "glasgow"
    },
    {
        ", Scotland.     The Resolution class was the launch platform for the ": null
    },
    {
        "United Kingdoms": "united kingdom"
    },
    {
        "strategic ": null
    },
    {
        "nuclear deterrent": "nuclear deterrent"
    },
    {
        " from the late 1960s until 1996, when it was replaced by the  carrying the ": null
    },
    {
        "Trident II": "trident"
    },
    {
        ".       During the 1950s and early 1960s, the ": null
    },
    {
        "United Kingdoms": "united kingdom"
    },
    {
        "nuclear deterrent was based on the RAFs ": null
    },
    {
        "V-bombers": "v-bombers"
    },
    {
        ". But in the early 1960s developments in ": null
    },
    {
        "radar": "radar"
    },
    {
        " and ": null
    },
    {
        "surface-to-air missiles": "surface-to-air missiles"
    },
    {
        " made it clear that ": null
    },
    {
        "bombers": "bombers"
    },
    {
        " were becoming vulnerable, and would be unlikely to penetrate Soviet airspace. Free-fall nuclear weapons would no longer be a credible deterrent.     To address this problem, in May 1960 the British Prime Minister, ": null
    },
    {
        "Harold Macmillan": "harold macmillan"
    },
    {
        " arranged a deal with US President ": null
    },
    {
        "Eisenhower": "dwight d. eisenhower"
    },
    {
        " to equip the V bombers with the US-designed ": null
    },
    {
        "AGM-48 Skybolt": "agm-48 skybolt"
    },
    {
        ". The Skybolt was a  range ballistic missile that allowed the launching bombers to remain well away from Soviet defences and launch attacks that would be basically invulnerable. With this range, the V bombers would have to fly only a few hundred miles from their bases before being in range for an attack on ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        ".     Under the agreement the UKs contribution to the programme was limited to developing suitable mounting points on the ": null
    },
    {
        "Avro Vulcan": "avro vulcan"
    },
    {
        " bomber, installing the required guidance systems that fed the missiles updated positioning information, and development of a British version of the US ": null
    },
    {
        "W47": "w47"
    },
    {
        " warhead to arm it, the RE.179 .       The incoming ": null
    },
    {
        "Kennedy": "john f. kennedy"
    },
    {
        " administration expressed serious doubts of both Skybolt and the US deterrent force in general. ": null
    },
    {
        "Robert McNamara": "robert mcnamara"
    },
    {
        " was highly critical of the US bomber fleet, which he saw as obsolete in an age of ": null
    },
    {
        "ICBM": "icbm"
    },
    {
        "s. Skybolt was seen simply as a means of continuing the existence of a system he no longer considered credible, and given the rapidly improving capabilities of ICBM ": null
    },
    {
        "inertial guidance": "inertial guidance"
    },
    {
        " systems, a precision strike capability with free-fall bombs would no longer be needed. McNamara was equally concerned about the UK also having its own nuclear force, and worried that the US could be drawn into a war by the UK. He wanted to bring the UK into a ": null
    },
    {
        "dual-key": "dual key"
    },
    {
        " arrangement.     McNamara first broached the idea of cancelling Skybolt with the British in November 1962. When this was reported in the House of Commons, a storm of protest broke out. A ": null
    },
    {
        "meeting": "nassau agreement"
    },
    {
        " was arranged to settle the issue, and Macmillan stated in no uncertain terms that the UK would be retaining their independent deterrent capability, no matter what the cost. With development of their Polaris-derived warheads well along, a suitable launch platform would be developed, if need be.     Faced with a clear failure in policy terms, Kennedy gave up on the idea of strong-arming Britain into accepting a dual-key arrangement. By the end of the ": null
    },
    {
        "series of meetings": "nassau agreement"
    },
    {
        ", the UK had ": null
    },
    {
        "gained the much more impressive Polaris system": "polaris sales agreement"
    },
    {
        ", and would start development of a new submarine to launch it. The ": null
    },
    {
        "SSBNs": "ssbns"
    },
    {
        " would then take over the nuclear deterrent role from the RAFs V bombers from 1968 onwards.       Two pairs of the boats were ordered in May 1963 from Vickers Shipbuilding Ltd, ": null
    },
    {
        "Barrow in Furness": "barrow in furness"
    },
    {
        " and from Cammell Laird and Co. Ltd, ": null
    },
    {
        "Birkenhead": "birkenhead"
    },
    {
        ". The option of buying a fifth unit, planned as , was cancelled in February 1965. Traditional ": null
    },
    {
        "battleship": "battleship"
    },
    {
        " names were used, signifying that they were the ": null
    },
    {
        "capital ships": "capital ship"
    },
    {
        "of their time.          ": null
    },
    {
        "Vickers Armstrong": "vickers shipbuilding and engineering ltd"
    },
    {
        " in ": null
    },
    {
        "Barrow-in-Furness": "barrow-in-furness"
    },
    {
        " constructed Resolution and Repulse and ": null
    },
    {
        "Cammell Laird": "cammell laird"
    },
    {
        " in ": null
    },
    {
        "Birkenhead": "birkenhead"
    },
    {
        " constructed Renown and Revenge. The construction was unusual in that the bow and stern were constructed separately before being assembled together with the American-designed missile compartment.     The design was a modification of the  fleet submarine, but greatly extended to incorporate the missile compartment between the fin and the nuclear reactor. The length was , breadth , height  and the displacement  submerged and  surfaced. A ": null
    },
    {
        "Rolls-Royce": "rolls-royce plc"
    },
    {
        " pressurised water reactor  and ": null
    },
    {
        "English Electric Company": "english electric company"
    },
    {
        " turbines gave them a speed of  and they could dive to depths of . Sixteen Polaris A3 missiles were carried, in two rows of eight. For emergencies there was a diesel generator and six  ": null
    },
    {
        "torpedo tubes": "torpedo tube"
    },
    {
        "located at the bow, firing the ": null
    },
    {
        "Tigerfish wire-guided homing torpedoes": "tigerfish torpedo"
    },
    {
        ". The submarines put to sea with a crew of 143.     According to former head of the ": null
    },
    {
        "Royal Corps of Naval Constructors": "royal corps of naval constructors"
    },
    {
        " R.J. Daniel, the Resolution-class SSBNs possessed five features that were envied by the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        ": the machinery loading hatch, automated hovering system, welded hull valves, standardised valves, and raft-mounted propulsion machinery.                 The first to be completed was Resolution, laid down in February 1964 and launched in September 1966. After commissioning in 1967 she underwent a long period of sea trials, culminating in the test firing of a Polaris missile from the USAF Eastern Test Range off ": null
    },
    {
        "Cape Kennedy": "cape kennedy"
    },
    {
        " at 11:15 on 15 February 1968. Resolution commenced her first operational patrol on 15 June 1968, beginning 28 years of Polaris patrols. The class were part of the ": null
    },
    {
        "10th Submarine Squadron": "10th submarine squadron"
    },
    {
        ", all based at ": null
    },
    {
        "Faslane Naval Base": "hmnb clyde"
    },
    {
        ", ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ".     All four of the class underwent conversion during the 1980s so that they could be fitted with the Polaris A3TK missile which was fitted with the British-developed ": null
    },
    {
        "Chevaline": "chevaline"
    },
    {
        " MRV system.     As the newer Vanguard-class submarines entered service, the Resolution class was eventually retired and all boats laid up at ": null
    },
    {
        "Rosyth dockyard": "rosyth dockyard"
    },
    {
        " with their used nuclear fuel removed. All four will eventually be disposed of via MODs Submarine Dismantling Project . This project will begin in 2016 with  as the first submarine to prove the technique. The selected method will first remove all Low-level radioactive waste from the vessel, followed by the more radioactive intermediate-level waste. All non-radioactive material in the remainder of the vessel will be recycled for re-use by conventional ship-breaking techniques.          New methods of project management were used in the refits of the Resolution class, including:   The appointment of a senior officer of two star rank and with the title of Assistant Controller , working under the joint superintendence of the Controller of the Navy and Chief of Fleet Support, whose responsibilities will include the oversight of the preparations for refits of Polaris boats, and their completion;   The delegation to a designated officer of the responsibility for drawing up the work package for each refit, which will include full design information and documentation;   The use of a fully integrated refit management team at Rosyth, and   The full use of available management techniques and aids, including computers.  Response by the Parliamentary Under Secretary of State for the Navy ": null
    }
]