[
    {
        "                A restaurant , or an eatery, is a ": null
    },
    {
        "business": "Business"
    },
    {
        " that prepares and serves ": null
    },
    {
        "food": "Food"
    },
    {
        " and ": null
    },
    {
        "drinks": "Drink"
    },
    {
        "to ": null
    },
    {
        "customer": "Customer"
    },
    {
        "s. Meals are generally served and eaten on the ": null
    },
    {
        "premises": "Premises"
    },
    {
        ", but many restaurants also offer ": null
    },
    {
        "take-out": "Take-Out"
    },
    {
        " and ": null
    },
    {
        "food delivery services": "Delivery"
    },
    {
        ". Restaurants vary greatly in appearance and offerings, including a wide variety of ": null
    },
    {
        "cuisines": "Cuisine"
    },
    {
        "and ": null
    },
    {
        "service": "Customer Service"
    },
    {
        " models ranging from inexpensive ": null
    },
    {
        "fast food restaurants": "Fast Food Restaurant"
    },
    {
        "and ": null
    },
    {
        "cafeteria": "Cafeteria"
    },
    {
        "s, to mid-priced ": null
    },
    {
        "family restaurant": "Family Restaurant"
    },
    {
        "s, to high-priced luxury establishments.     In Western countries, most mid- to high-range restaurants serve ": null
    },
    {
        "alcoholic beverages": "Alcoholic Beverage"
    },
    {
        "such as ": null
    },
    {
        "beer": "Beer"
    },
    {
        " and ": null
    },
    {
        "wine": "Wine"
    },
    {
        ". Some restaurants serve all the major meals, such as ": null
    },
    {
        "breakfast": "Breakfast"
    },
    {
        ", ": null
    },
    {
        "lunch": "Lunch"
    },
    {
        ", and ": null
    },
    {
        "dinner": "Dinner"
    },
    {
        " . Other restaurants may serve only a single meal  or they may serve two meals .       The word derives from the French verb restaurer  and, being the present participle of the verb  , it literally means that which restores .   The term restaurant was defined in 1507 as a restorative beverage , and in correspondence in 1521 to mean that which restores the strength, a fortifying food or remedy . ce qui répare les forces, aliment ou remède fortifiant          The first use of the word to refer to a public venue where one can order food is believed to be in the 18th century. In 1765, a French chef by the name of A. Boulanger established a business selling soups and other restaurants . Additionally, while not the first establishment where one could order food, or even soups, it is thought to be the first to offer a menu of available choices    The first real restaurant is considered to have been La Grande Taverne de Londres in ": null
    },
    {
        "Paris": "Paris"
    },
    {
        ", founded by Antoine Beauviliers in either 1782 or 1786.  According to ": null
    },
    {
        "Brillat-Savarin": "Jean Anthelme Brillat-Savarin"
    },
    {
        ", this was the first to combine the four essentials of an elegant room, smart waiters, a choice cellar, and superior cooking .      In 1802 the term was applied to an establishment where restorative foods, such as ": null
    },
    {
        "bouillon": "Bouillon"
    },
    {
        ", a meat broth, were served .           Restaurants are classified or distinguished in many different ways. The primary factors are usually the food itself ; the ": null
    },
    {
        "cuisine": "Cuisine"
    },
    {
        " or the style of offering . Beyond this, restaurants may differentiate themselves on factors including speed , formality, location, cost, service, or ": null
    },
    {
        "novelty themes": "Theme Restaurant"
    },
    {
        " .     Restaurants range from inexpensive and informal ": null
    },
    {
        "lunch": "Lunch"
    },
    {
        "ing or ": null
    },
    {
        "dining": "Dining"
    },
    {
        " places catering to people working nearby, with modest food served in simple settings at low prices, to expensive establishments serving refined food and ": null
    },
    {
        "fine wines": "Fine Wine"
    },
    {
        "in a formal setting. In the former case, customers usually wear casual clothing. In the latter case, depending on culture and local traditions, customers might wear ": null
    },
    {
        "semi-casual": "Semi-Casual"
    },
    {
        ", ": null
    },
    {
        "semi-formal": "Semi-Formal"
    },
    {
        " or ": null
    },
    {
        "formal wear": "Formal Wear"
    },
    {
        ". Typically, at mid- to high-priced restaurants, customers sit at tables, their orders are taken by a ": null
    },
    {
        "waiter": "Waiter"
    },
    {
        ", who brings the food when it is ready. After eating, the customers then pay the bill. In some restaurants, such as workplace ": null
    },
    {
        "cafeteria": "Cafeteria"
    },
    {
        "s, there are no waiters; the customers use trays, on which they place cold items that they select from a refrigerated container and hot items which they request from cooks, and then they pay a cashier before they sit down. Another restaurant approach which uses few waiters is the buffet restaurant. Customers serve food onto their own plates and then pay at the end of the meal. Buffet restaurants typically still have waiters to serve drinks and alcoholic beverages. Fast food restaurants are also considered a restaurant.     The travelling public has long been catered for with ships ": null
    },
    {
        "mess": "Mess"
    },
    {
        " Somali": "Somali People"
    },
    {
        " strip mall in ": null
    },
    {
        "Toronto": "Toronto"
    },
    {
        " kitchen": "Kitchen"
    },
    {
        " of ": null
    },
    {
        "Pétrus": "Pétrus"
    },
    {
        ", located in ": null
    },
    {
        "Knightsbridge": "Knightsbridge"
    },
    {
        ", ": null
    },
    {
        "Central London": "Central London"
    },
    {
        ", England         A restaurants proprietor is called a  restaurateur , this derives from the French verb restaurer, meaning to restore . Professional cooks are called ": null
    },
    {
        "chef": "Chef"
    },
    {
        "s, with there being various finer distinctions . Most restaurants  will have various ": null
    },
    {
        "waiting staff": "Waiting Staff"
    },
    {
        " to serve food, beverages and alcoholic drinks, including ": null
    },
    {
        "busboys": "Busboy"
    },
    {
        "who remove used dishes and cutlery. In finer restaurants, this may include a host or hostess, a ": null
    },
    {
        "maître dhôtel": "Maître Dhôtel"
    },
    {
        " to welcome customers and to seat them, and a ": null
    },
    {
        "sommelier": "Sommelier"
    },
    {
        " or wine waiter to help patrons select wines.   A new route to becoming a restauranter, rather than working ones way up through the stages, is to operate a food truck. Once a sufficient following has been obtained, a permanent restaurant site can be opened. This trend has become common in the UK and the US.             A chefs table is a table located in the ": null
    },
    {
        "kitchen": "Kitchen"
    },
    {
        " of a restaurant,   reserved for ": null
    },
    {
        "VIPs": "Very Important Person"
    },
    {
        " and special guests.  Patrons may be served a themed ": null
    },
    {
        "tasting menu": "Tasting Menu"
    },
    {
        " prepared and served by the head chef. Restaurants can require a minimum party  and charge a higher flat fee.  Because of the demand on the kitchens facilities, chefs tables are generally only available during off-peak times.            Armenian cuisine is one of the main elements of the national culture. Its something that Armenians really love to present to the world. There are lots of . And the majority is centralized in the capital city - Yerevan.     See also : https://armeniadiscovery.com/en/articles/best-restaurants-in-yerevan Best Restaurants in Yerevan     The Armenian restaurants offer a wide variety of dishes, delicious food, sweets, and bakings. The most famous Armenian dishes are barbeque, dolma, fish, khash, harissa, aveluk, and many more. National Armenian restaurants try to bring back the right Armenian breakfast and the tradition of having breakfast.     They say that once it was accepted to have a so-called Brduchayin Nakhachash that means A Sandwich Breakfast . This brduch is an Armenian sandwich made of Armenian lavash , meal, and nut.   Besides national Armenian restaurants, there are also some foreign restaurants in Armenia which once more proves the Armenians love towards the restaurant and food culture.                In ": null
    },
    {
        "China": "China"
    },
    {
        ", food ": null
    },
    {
        "catering": "Catering"
    },
    {
        " establishments that may be described as restaurants have been known since the 11th century in ": null
    },
    {
        "Kaifeng": "Kaifeng"
    },
    {
        ", Chinas capital during the first half of the ": null
    },
    {
        "Song dynasty": "Song Dynasty"
    },
    {
        " . Probably growing out of the ": null
    },
    {
        "tea houses": "Tea House"
    },
    {
        "and taverns that catered to travellers, Kaifengs restaurants blossomed into an industry catering to locals as well as people from other regions of China.  There is a direct correlation between the growth of the restaurant businesses and institutions of ": null
    },
    {
        "theatrical stage drama": "Culture Of The Song Dynastyperforming Arts"
    },
    {
        ", ": null
    },
    {
        "gambling": "Gambling"
    },
    {
        " and ": null
    },
    {
        "prostitution": "Prostitution"
    },
    {
        " which served the burgeoning ": null
    },
    {
        "merchant middle class": "Four Occupations"
    },
    {
        " during the Song dynasty.  Restaurants catered to different styles of cuisine, price brackets, and religious requirements. Even within a single restaurant choice were available, and people ordered the entree from written ": null
    },
    {
        "menu": "Menu"
    },
    {
        "s. An account from 1275 writes of ": null
    },
    {
        "Hangzhou": "Hangzhou"
    },
    {
        ", the capital city for the last half of the dynasty:        The restaurants in Hangzhou also catered to many northern Chinese who had fled south from Kaifeng during the ": null
    },
    {
        "Jurchen": "Jurchens"
    },
    {
        " invasion of the 1120s": "Jin Campaign Against The Song Dynasty"
    },
    {
        ", while it is also known that many restaurants were run by families formerly from Kaifeng.          In ": null
    },
    {
        "Ancient Greece": "Ancient Greece"
    },
    {
        " and ": null
    },
    {
        "Ancient Rome": "Ancient Rome"
    },
    {
        ", ": null
    },
    {
        "thermopolia": "Thermopolium"
    },
    {
        "  were small restaurant-bars that offered food and drinks to ": null
    },
    {
        "customer": "Customer"
    },
    {
        "s. A typical thermopolium had L-shaped counters in which large storage vessels were sunk, which would contain either hot or cold food. Their popularity was linked to the lack of kitchens in many dwellings and the ease with which people could purchase prepared foods. Furthermore, eating out was considered an important aspect of socializing.       In ": null
    },
    {
        "Pompeii": "Pompeii"
    },
    {
        ", 158 thermopolia with service counters have been identified throughout the town. They were concentrated along the main axis of the town and the public spaces where they were frequented by the locals. Ellis, Steven J. R. : The Distribution of Bars at Pompeii: Archaeological, Spatial and Viewshed Analyses , Journal of Roman Archaeology ": null
    },
    {
        "thermopolium": "Thermopolium"
    },
    {
        " in ": null
    },
    {
        "Pompeii": "Pompeii"
    },
    {
        "            France has had a rich history with the development of various forms of inns and eateries, eventually to form many of the now-ubiquitous elements of the modern restaurant.     As far back as the thirteenth century, inns served a variety of food — bread, cheese, bacon, roasts, usually eaten at a common table. Parisians could buy what was essentially take-out food from rôtisseurs, who prepared roasted meat dishes, and ": null
    },
    {
        "pastry-cooks": "Pastry Chef"
    },
    {
        ", who could prepare meat pies and often more elaborate dishes. Municipal statutes stated that the official prices per item were to be posted at the entrance; this was the first official mention of menus. Jim Chevallier, A History of the Food of Paris: From Roast Mammoth to Steak Frites, 2018, , pp. 67-80     Taverns also served food, as did ": null
    },
    {
        "cabarets": "Cabarets"
    },
    {
        ". A cabaret, however, unlike a tavern, served food at tables with tablecloths, provided drinks with the meal, and charged by the customers choice of dish, rather than by the pot. Cabarets were reputed to serve better food than taverns and a few, such as the Petit Maure, became well-known. A few cabarets had musicians or singing, but most, until the late 19th century, were simply convivial eating places.     The first ": null
    },
    {
        "café": "Café"
    },
    {
        " opened in Paris in 1672 at the Saint-Germain fair. By 1723 there were nearly four hundred cafés in Paris, but their menu was limited to simpler dishes or confectionaries, such as coffee, tea, chocolate, ice creams, pastries, and liqueurs.     At the end of the 16th century, the guild of cook-caterers was given its own legal status. The traiteurs dominated sophisticated food service, delivering or preparing meals for the wealthy at their residences. Taverns and cabarets were limited to serving little more than roast or grilled meats. Towards the end of the seventeenth century, both inns and then traiteurs began to offer hosts tables , where one paid a set price to sit at a large table with other guests and eat a fixed menu meal.     The earliest modern-format restaurants to use that name in Paris were the establishments which served ": null
    },
    {
        "bouillon": "Broth"
    },
    {
        ", a broth made of meat and egg which was said to restore health and vigor. The first restaurant of this kind opened in 1765 or 1766 by Mathurin Roze de Chantoiseau on rue des Poulies, now part of the Rue de Louvre. Rebecca L. Spang, The Invention of the Restaurant: Paris and Modern Gastronomic Culture ,  The name of the owner is sometimes given as Boulanger. Unlike earlier eating places, it was elegantly decorated, and besides meat broth offered a menu of several other restorative dishes, including macaroni. Chantoiseau and other chefs took the title traiteurs-restaurateurs .     In June 1786 the Provost of Paris issued a decree giving the new kind of eating establishment official status, authorizing restaurateurs to receive clients and to offer them meals until eleven in the evening in winter and midnight in summer. Ambitious cooks from noble households began to open more elaborate eating places. The first luxury restaurant in Paris, the Taverne Anglaise, was opened at the ": null
    },
    {
        "Palais-Royal": "Palais-Royal"
    },
    {
        " at the beginning of 1786, shortly before the French Revolution, by ": null
    },
    {
        "Antoine Beauvilliers": "Antoine Beauvilliers"
    },
    {
        ", the former chef of the Count of Provence, It had mahogany tables, linen tablecloths, chandeliers, well-dressed and trained waiters, a long wine list and an extensive menu of elaborately prepared and presented dishes.     The ": null
    },
    {
        "French Revolution": "French Revolution"
    },
    {
        " caused a mass emigration of nobles, and many of their cook chose to open restaurants. Metzner, Paul. Crescendo of the Virtuoso: Spectacle, Skill, and Self-Promotion in Paris during the Age of Revolution. Berkeley: University of California Press, c1998 1998.  One restaurant was started in 1791 by Méot, the former chef of the Duke of Orleans, which offered a wine list with twenty-two choices of red wine and twenty-seven of white wine. By the end of the century there were a collection of luxury restaurants at the Grand-Palais: Huré, the Couvert espagnol; Février; the Grotte flamande; Véry, Masse and the Café de Chartres      In the early 19th century traiteurs and restaurateurs, became known simply as restaurateurs . The use of the term restaurant for the establishment itself only became common in the nineteenth centuryfr": null
    },
    {
        "staurantmagazinemagazi": "Staurantmagazinemagazi"
    },
    {
        "type of food, ": null
    },
    {
        "handicap": "Disability"
    },
    {
        " accessibility, facilities, etc.": null
    },
    {
        "assificati": "Assificati"
    },
    {
        "staura": "Staura"
    },
    {
        "previously the Mobil travel guidesForbesAAAthus making restaurant ownership an option for immigrants with relatively few resourcesQSRs": null
    },
    {
        "ag": "Ag"
    },
    {
        "fast foodNot all changes in ownership are indicative of financial failure.January 8, 2014": null
    },
    {
        "tablishme": "Tablishme"
    },
    {
        " fully licensed ": null
    },
    {
        "BYO / BYOB": "Byob"
    }
]