[
    {
        "          Rex the Runt is a British ": null
    },
    {
        "live action": "live action"
    },
    {
        " stop motion": "stop motion"
    },
    {
        " animated": "animation"
    },
    {
        " claymation": "clay animation"
    },
    {
        " pixilation": "pixilation"
    },
    {
        " comedy": "comedy"
    },
    {
        " franchise, primarily consisting of a ": null
    },
    {
        "television": "television"
    },
    {
        " show and two short films produced by ": null
    },
    {
        "Aardman Animations": "aardman animations"
    },
    {
        " for ": null
    },
    {
        "BBC Bristol": "bbc bristol"
    },
    {
        " in association with ": null
    },
    {
        "EVA Entertainment": "eva entertainment"
    },
    {
        " and ": null
    },
    {
        "Egmont Imagination": "egmont imagination"
    },
    {
        ". Its main characters are four ": null
    },
    {
        "plasticine": "plasticine"
    },
    {
        " dogs": "list of fictional dogs"
    },
    {
        ": Rex, Wendy, Bad Bob and Vince.     Rex was first introduced as a minor character in Ident , a short film directed by ": null
    },
    {
        "Richard Goleszowski": "richard goleszowski"
    },
    {
        " for the  Lip Synch  series. During the seven years of development of the characters, Goleszowski produced three pilots, subtitled How Dinosaurs Became Extinct , Dreams and North by North Pole .     Thirteen ten-minute episodes of the series aired over two weeks on ": null
    },
    {
        "BBC42": "bbc two"
    },
    {
        " from December 42 A second thirteen episode series aired from September 42 on the same channel. As well as the core cast guest voices included ": null
    },
    {
        "Paul Merton": "paul merton"
    },
    {
        ", ": null
    },
    {
        "Morwenna Banks": "morwenna banks"
    },
    {
        ", ": null
    },
    {
        "Judith Chalmers": "judith chalmers"
    },
    {
        ", ": null
    },
    {
        "Antoine de Caunes": "antoine de caunes"
    },
    {
        ", ": null
    },
    {
        "Bob Holness": "bob holness"
    },
    {
        ", ": null
    },
    {
        "Simon Day": "simon day"
    },
    {
        ", ": null
    },
    {
        "Bob Monkhouse": "bob monkhouse"
    },
    {
        ", ": null
    },
    {
        "Jonathan Ross": "jonathan ross"
    },
    {
        ", ": null
    },
    {
        "Graham Norton": "graham norton"
    },
    {
        ", ": null
    },
    {
        "Arthur Smith": "arthur smith"
    },
    {
        ", ": null
    },
    {
        "June Whitfield": "june whitfield"
    },
    {
        ", ": null
    },
    {
        "Kathy Burke": "kathy burke"
    },
    {
        ", ": null
    },
    {
        "Pam Ayres": "pam ayres"
    },
    {
        " and ": null
    },
    {
        "Eddie Izzard": "eddie izzard"
    },
    {
        ".     The animation is unusual in that the models are almost two-dimensional and are animated to exaggerate this - they are flattened in appearance and animated on a sheet of glass with the backgrounds behind the sheet.             Rex, the protagonist & mdash; a timid, irritable runt. He is quick-witted and usually comes up with plans to get out of the scrapes the gang finds themselves in. However, he can also annoy the others by being a smart aleck. His favourite superhero is Rocket Raymond.   Bad Bob is a big, fat slob , interested in food and TV. His friends, and occasionally even he himself, describe him as a Big, fat, jelly-wobbly, fat bast- , usually getting cut off towards the end. He is distinguishable by his eye patch, which changes from eye to eye, and often carries around a ": null
    },
    {
        "revolver": "revolver"
    },
    {
        " almost the size of himself. However grumpy he might be, he is intelligent and loyal.   Wendy is the only female housemate, distinguishable by her eyelashes, pink colour, noticeably hemispheric breasts, and wears a pink bow on her head. She is cynical, sarcastic, and fiercely independent. Wendy provides solutions to problems albeit in a distant or non-caring way. She speaks in a Mancunian accent.   Vince is the pet of the household, although all four are dogs. He is distinguished by his prominent buckteeth and mismatched eyes. He speaks in single words or short disjointed phrases, his favourites being Spaghetti , Tuesday , Jam , and Trousers . Vince suffers from Random ": null
    },
    {
        "Pavarotti": "luciano pavarotti"
    },
    {
        " Disease , causing him to randomly blurt out snatches of opera. While he appears to be unintelligent, he occasionally shows great ingenuity, for example by building an elaborate ": null
    },
    {
        "Heath Robinson": "heath robinson"
    },
    {
        " machine designed to kill a mouse. The other members of the gang often respond to Vinces random outbursts by irritably telling him to shut it . Vince often has a habit of copying what others have said, sometimes even if they have just said it in their minds, which Bad Bob finds really annoying.         Many one-off and recurring characters in Rex The Runt are voiced by various well-known UK celebrities. These include:     Doctor Dogg is a medical ": null
    },
    {
        "doctor": "physician"
    },
    {
        ". Moustachioed, complacent and greedy, hes an opportunistic money-grabber, whose habitual charge for any treatment is ten ": null
    },
    {
        "quid": "pound sterling"
    },
    {
        " - regardless of whether the cure works or does more harm than good. He isnt above using the main characters in ": null
    },
    {
        "medical research": "medical research"
    },
    {
        ". Voiced by ": null
    },
    {
        "Paul Merton": "paul merton"
    },
    {
        ".   Arthur Dustcart, another semi-regular character, who first makes an appearance in the last episode of the first series, but appears quite frequently in the second. He is an ugly but experienced ": null
    },
    {
        "dustman": "dustman"
    },
    {
        ", sporting sleepy mismatched eyes, a ": null
    },
    {
        "neckerchief": "neckerchief"
    },
    {
        ", a pair of dirty ": null
    },
    {
        "underpants": "underpants"
    },
    {
        " and a large nose with prominent ": null
    },
    {
        "nasal hair": "nasal hair"
    },
    {
        ". Despite his grotesque appearance and smell, he and Wendy get on rather well, much to the annoyance of Rex. He becomes a friend of the household when he helps find Rex after he was turned into spaghetti.   Mrs. Bloomers, head of Kumfy Kennels. Treats dogs with care, until she put Vince in the kennel and he ate a chihuahua.   Judith Poodle, hostess of a holiday program. Usually ends her sentences with Ruff!   Mr. Formal, the Runts bank manager, until Bad Bob brought his gun and made him think they were bank robbers.   Melting Blob Slime, a three-year-old, but very smart slime creature who warned the Runts about the black hole.   Kylie Mandlebrotska, Rexs old math teacher, until she fell into the black hole.   Easter Island Aliens, three space aliens from the planet Thribb, where the people look like the ": null
    },
    {
        "Moai": "moai"
    },
    {
        " statues from Easter Island.   Mr Chittock, angry neighbour to Rex, after the gang went into his house and drank his beer. Voiced by veteran alternative comedian ": null
    },
    {
        "Stephen Frost": "stephen frost"
    },
    {
        ".   Johnny Saveloy, a teenage sausage who was really very old but was kept in a state of artificial youth due to the Church of Chemicology. Voiced by ": null
    },
    {
        "Bob Monkhouse": "bob monkhouse"
    },
    {
        ".   Stinky Basil, a smarmy French talent-spotter. Voiced by ": null
    },
    {
        "Antoine De Caunes": "antoine de caunes"
    },
    {
        ", known best in the UK for presenting the ": null
    },
    {
        "Channel 42": "channel 4"
    },
    {
        " late-night adult entertainment show  Eurotrash .   The Happy Rabbits": null
    }
]