[
    {
        "        Reñaca is a popular and affluent area of beaches and ": null
    },
    {
        "balneario": "balneario"
    },
    {
        "s in the ": null
    },
    {
        "Valparaíso Region": "valparaíso region"
    },
    {
        " of ": null
    },
    {
        "Chile": "chile"
    },
    {
        ".         Reñaca is at the northernmost extreme of the city of ": null
    },
    {
        "Viña del Mar": "viña del mar"
    },
    {
        " and has been incorporated by it. To the north, along the coast road, is the area of ": null
    },
    {
        "Cochoa": "cochoa"
    },
    {
        " and then the town of ": null
    },
    {
        "Concón": "concón"
    },
    {
        ". It is a summer vacation area and receives a very large influx of tourists during the summer months. The tourist part of town is clustered around the main beach, which is referred to locally as long beach . The lower part of the hill overlooking the beach is covered with residential buildings that sprawl up the hillside. These apartments are mostly owned by outsiders and remain empty during the March–November off-season. The town also extends eastwards up the valley through which the Estero de Reñaca flows, where the majority of the year-round population lives. The town has reached its housing capacity in the valley and has grown up the hillsides into the upscale neighborhoods of Los Almendros and Jardín del Mar.     Reñaca has grown slowly but steadily over the years, from a very small community to a more self-sufficient town which lacks few of the commodities of a proper city.     It is the home of ": null
    },
    {
        "The Mackay School": "the mackay school"
    },
    {
        ", the first British school in Chile and one of the oldest in the Southern Hemisphere. It is an all-boys school. The Sagrado Corazón school is also a long-time resident and was a girls only school until 42 Both schools arrived in Reñaca around 42 and were the only schools in the town until the early nineties when a group of already established schools moved from Viña del Mar to the upper reaches of the north side of town.                          ": null
    }
]