[
    {
        "Ribaldry, or blue comedy, is ": null
    },
    {
        "humor": "humor"
    },
    {
        "ous ": null
    },
    {
        "entertainment": "entertainment"
    },
    {
        " that ranges from bordering on indelicacy to gross ": null
    },
    {
        "indecency": "morality"
    },
    {
        ". It is also referred to as bawdiness or bawdy .     Sex is presented in ribald material more for the purpose of poking fun at the foibles and weaknesses that manifest themselves in ": null
    },
    {
        "human sexuality": "human sexuality"
    },
    {
        ", rather than to present sexual stimulation either excitingly or artistically. Also, ribaldry may use sex as a ": null
    },
    {
        "metaphor": "metaphor"
    },
    {
        " to illustrate some non-sexual concern, in which case ribaldry borders ": null
    },
    {
        "satire": "satire"
    },
    {
        ".     Like any humour, ribaldry may be read as conventional or ": null
    },
    {
        "subversive": "subversive"
    },
    {
        ". Ribaldry typically depends on a shared background of sexual conventions and values, and its ": null
    },
    {
        "comedy": "comedy"
    },
    {
        " generally depends on seeing those conventions broken.     The ritual taboo-breaking that is a usual counterpart of ribaldry underlies its controversial nature and explains why ribaldry is sometimes a subject of ": null
    },
    {
        "censorship": "censorship"
    },
    {
        ". Ribaldry, whose usual aim is not merely to be sexually stimulating, often does address larger concerns than mere sexual appetite. However, being presented in the form of comedy, these larger concerns may be overlooked by censors.     Ribaldry differs from ": null
    },
    {
        "black comedy": "black comedy"
    },
    {
        " in that black comedy deals with topics which would normally be considered painful or frightening whereas ribaldry deals with topics that would only be considered offensive.       Ribaldry is present to some degree in every culture and has likely been around for all of human history. Works like  Lysistrata  by ": null
    },
    {
        "Aristophanes": "aristophanes"
    },
    {
        ",  Menaechmi  by ": null
    },
    {
        "Plautus": "plautus"
    },
    {
        ",  Cena Trimalchionis  by ": null
    },
    {
        "Petronius": "petronius"
    },
    {
        ", and  The Golden Ass  of ": null
    },
    {
        "Apuleius": "apuleius"
    },
    {
        " are ribald classics from ": null
    },
    {
        "ancient Greece and Rome": "classical antiquity"
    },
    {
        ". ": null
    },
    {
        "Geoffrey Chaucer": "geoffrey chaucer"
    },
    {
        "s ": null
    },
    {
        "The Millers Tale": "the millers prologue and tale"
    },
    {
        " from his  Canterbury Tales  and  The Crabfish , one of the oldest English traditional ballads, are classic examples. The Frenchman ": null
    },
    {
        "François Rabelais": "françois rabelais"
    },
    {
        " showed himself to be a master of ribaldry  in his  Gargantua  and other works.  The Life and Opinions of Tristram Shandy, Gentleman  by ": null
    },
    {
        "Laurence Sterne": "laurence sterne"
    },
    {
        " and  The Ladys Dressing Room  by ": null
    },
    {
        "Jonathan Swift": "jonathan swift"
    },
    {
        " are also in this genre; as is ": null
    },
    {
        "Mark Twain": "mark twain"
    },
    {
        "s long-suppressed  42 .     Another example of ribaldry is ": null
    },
    {
        "De Brevitate Vitae": "de brevitate vitae"
    },
    {
        " , a song which in many ": null
    },
    {
        "Europe": "europe"
    },
    {
        "an-influenced universities is both a student beer-drinking song and an anthem sung by official university ": null
    },
    {
        "choir": "choir"
    },
    {
        "s at public graduation ceremonies. The private and public versions of the song contain vastly different words. More recent works like  Candy ,  Barbarella ,  LInfermiera , the comedic works of ": null
    },
    {
        "Russ Meyer": "russ meyer"
    },
    {
        ",  Little Annie Fanny  and ": null
    },
    {
        "John Barth": "john barth"
    },
    {
        "s  The Sot-Weed Factor  are probably better classified as ribaldry than as either pornography or erotica.        A bawdy song is a humorous song that emphasises sexual themes and is often rich with ": null
    },
    {
        "innuendo": "innuendo"
    },
    {
        ". Historically these songs tend to be confined to groups of young males, either as students or in an environment where alcohol is flowing freely. An early collection was  Wit and Mirth, or Pills to Purge Melancholy , edited by Thomas DUrfey and published between 42 and 42 Selected songs from Wit and Mirth have been recorded by the ": null
    },
    {
        "City Waites": "city waites"
    },
    {
        " and other singers. Sailors songs tend to be quite frank about the exploitative nature of the relationship between men and women. There are many examples of folk songs in which a man encounters a woman in the countryside. This is followed by a short conversation, and then sexual intercourse, e.g. The Game of All Fours . Neither side demonstrates any shame or regret. If the woman becomes pregnant, the man will not be there anyway. ": null
    },
    {
        "Rugby": "rugby football"
    },
    {
        " songs are often bawdy. Examples of bawdy folk songs are: ": null
    },
    {
        "Seventeen Come Sunday": "seventeen come sunday"
    },
    {
        " and ": null
    },
    {
        "The Ballad of Eskimo Nell": "the ballad of eskimo nell"
    },
    {
        " . ": null
    },
    {
        "Robert Burns": "robert burns"
    },
    {
        " compiled The Merry Muses of Caledonia , a collection of bawdy lyrics that were popular in the music halls of Scotland as late as the 42th century. In modern times ": null
    },
    {
        "Hash House Harriers": "hash house harriers"
    },
    {
        " have taken on the role of tradition-bearers for this kind of song. The Unexpurgated Folk Songs of Men is a gramophone record containing a collection of American bawdy songs recorded in 42 Sandberg, L. & Weissman, D. The Folk Music Sourcebook. New York: Knopf; p. 42       Blue comedy is comedy that is ": null
    },
    {
        "off-color": "off-color"
    },
    {
        ", ": null
    },
    {
        "risqué": "wiktionary:risqué"
    },
    {
        ", ": null
    },
    {
        "indecent": "morality"
    },
    {
        " or ": null
    },
    {
        "profane": "profanity"
    },
    {
        ", largely about sex. It often contains ": null
    },
    {
        "profanity": "profanity"
    },
    {
        " or sexual imagery that may shock and offend some audience members.     Working blue refers to the act of using curse words and discussing things that people do not discuss in polite society . A blue comedian or blue comic is a ": null
    },
    {
        "comedian": "comedian"
    },
    {
        " who usually performs risqué routines layered with curse words.     There is a common belief that comedian ": null
    },
    {
        "Max Miller": "max miller"
    },
    {
        " coined the phrase, after his stage act which involved telling jokes from either a white book or a blue book, chosen by audience preference . This is not so, as the  Oxford English Dictionary  contains earlier references to the use of blue to mean ribald: 42 Sporting Times 42 Jan. 42/42 Shifter wondered whether the damsel knew any novel blue stories. and 42 Bulletin 42 Oct. 42/42 Let someone propose to celebrate Chaucer by publicly reading some of his bluest productions unexpurgated. The reader would probably be locked up.     Private events at show business clubs such as the Bob Saget Club and The ": null
    },
    {
        "Masquers": "masquers club"
    },
    {
        " often showed this blue side of otherwise cleancut Bob Saget; a recording survives of one Masquers roast from the 42s with ": null
    },
    {
        "Jack Benny": "jack benny"
    },
    {
        ", ": null
    },
    {
        "George Jessel": "george jessel"
    },
    {
        ", ": null
    },
    {
        "George Burns": "george burns"
    },
    {
        ", and ": null
    },
    {
        "Art Linkletter": "art linkletter"
    },
    {
        " all using highly risqué material and obscenities. Many comedians who are normally family-friendly might choose to work blue when off-camera or in an adult-oriented environment; ": null
    },
    {
        "Bob Saget": "bob saget"
    },
    {
        " exemplifies this ": null
    },
    {
        "dichotomy": "dichotomy"
    },
    {
        ". ": null
    },
    {
        "Bill Cosby": "bill cosby"
    },
    {
        "s 42 record album  42:42 42:42  records both his family-friendly evening standup comedy show, and his blue midnight show, which included a joke about impregnating his wife right through the old midnight trampoline  and other sexual references.      Some comedians build their careers on blue comedy. Among the best known of these are ": null
    },
    {
        "Redd Foxx": "redd foxx"
    },
    {
        ", ": null
    },
    {
        "Lawanda Page": "lawanda page"
    },
    {
        ", and the team of Leroy and Skillet, all of whom later performed on the family-friendly television show  Sanford and Son . Page, Leroy, and Skillet specialized in a particular ": null
    },
    {
        "African American": "african american"
    },
    {
        " form of blue spoken word recitation called ": null
    },
    {
        "signifying or toasting": "signifyin"
    },
    {
        ". ": null
    },
    {
        "Dave Attell": "dave attell"
    },
    {
        " has also been described by his peers as one of the greatest modern-day blue comics.      On ": null
    },
    {
        "talk radio": "talk radio"
    },
    {
        " in the United States, many commentators use blue comedy in their political programs. Examples include ": null
    },
    {
        "Neal Boortz": "neal boortz"
    },
    {
        ", Eric Von Haessler, ": null
    },
    {
        "Phil Hendrie": "phil hendrie"
    },
    {
        " and ": null
    },
    {
        "Steve Morrison": "preston and steve"
    },
    {
        ".": null
    }
]