[
    {
        "           Richard Bentley   was an English ": null
    },
    {
        "classical scholar": "classics"
    },
    {
        ", critic, and theologian. He was Master of ": null
    },
    {
        "Trinity College, Cambridge": "trinity college, cambridge"
    },
    {
        ".     Bentley was the first Englishman to be ranked with the great heroes of ": null
    },
    {
        "classical": "classical antiquity"
    },
    {
        " learning and was known for his literary and textual criticism. Called the founder of historical ": null
    },
    {
        "philology": "philology"
    },
    {
        " , Bentley is credited with the creation of the English school of ": null
    },
    {
        "Hellenism": "hellenism"
    },
    {
        ", and introduced the first competitive written examinations in a Western university.          Bentley was born at ": null
    },
    {
        "Oulton": "oulton, west yorkshire"
    },
    {
        " near ": null
    },
    {
        "Rothwell": "rothwell, west yorkshire"
    },
    {
        ", ": null
    },
    {
        "Leeds": "leeds"
    },
    {
        ", West Yorkshire, in northern England. A blue plaque near his birthplace commemorates the fact. His father was Thomas Bentley of Oulton. His grandfather, Captain James Bentley, had suffered for the ": null
    },
    {
        "Royalist": "charles i of england"
    },
    {
        " cause following the ": null
    },
    {
        "English Civil War": "english civil war"
    },
    {
        ", leaving the family in reduced circumstances. Bentleys mother, the daughter of a ": null
    },
    {
        "stonemason": "stonemason"
    },
    {
        ", had some education, and was able to give her son his first lessons in ": null
    },
    {
        "Latin": "latin language"
    },
    {
        ".     After attending ": null
    },
    {
        "grammar school": "grammar school"
    },
    {
        " in ": null
    },
    {
        "Wakefield": "wakefield"
    },
    {
        ", Bentley was an undergraduate at ": null
    },
    {
        "St Johns College, Cambridge": "st johns college, cambridge"
    },
    {
        ", in 42 He afterwards obtained a scholarship and took the degree of B.A. in 42 .       He never became a ": null
    },
    {
        "Fellow": "fellow"
    },
    {
        ", but was appointed to be the headmaster of ": null
    },
    {
        "Spalding Grammar School": "spalding grammar school"
    },
    {
        " before he was 42 ": null
    },
    {
        "Edward Stillingfleet": "edward stillingfleet"
    },
    {
        ", dean of St Pauls, hired Bentley as tutor to his son, which enabled the younger man to meet eminent scholars, have access to the best private library in England, and become familiar with Dean Stillingfleet. During his six years as tutor, Bentley also made a comprehensive study of ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " and Latin writers, storing up knowledge which he used later.     In 42 Stillingfleet became ": null
    },
    {
        "bishop of Worcester": "bishop of worcester"
    },
    {
        ", and Bentleys pupil went to ": null
    },
    {
        "Wadham College, Oxford": "wadham college, oxford"
    },
    {
        ", accompanied by his tutor. Bentley soon met ": null
    },
    {
        "Dr John Mill": "john mill"
    },
    {
        ", ": null
    },
    {
        "Humphrey Hody": "humphrey hody"
    },
    {
        ", and ": null
    },
    {
        "Edward Bernard": "edward bernard"
    },
    {
        ". Here he studied the manuscripts of the ": null
    },
    {
        "Bodleian": "bodleian library"
    },
    {
        ", ": null
    },
    {
        "Corpus Christi": "corpus christi college, oxford"
    },
    {
        " and other college libraries. He collected material for literary studies. Among these are a corpus of the fragments of the Greek poets and an edition of the Greek ": null
    },
    {
        "lexicographer": "lexicographer"
    },
    {
        "s.     The Oxford press was about to bring out an edition  from the unique manuscript of the  Greek Chronicle  in the ": null
    },
    {
        "Bodleian Library": "bodleian library"
    },
    {
        ". It was a ": null
    },
    {
        "universal history": "universal history"
    },
    {
        " of John of Antioch , called ": null
    },
    {
        "John Malalas": "john malalas"
    },
    {
        " or John the Rhetor . The editor, Dr John Mill, principal of ": null
    },
    {
        "St Edmund Hall": "st edmund hall, oxford"
    },
    {
        ", asked Bentley to review it and make any remarks on the text.     Bentley wrote the Epistola ad Johannem Millium, which is about 42 pages included at the end of the Oxford Malalas . This short treatise placed Bentley ahead of all living English scholars. The ease with which he restored corrupted passages, the certainty of his ": null
    },
    {
        "emendation": ":wikt:emendation"
    },
    {
        " and command over the relevant material, are in a style totally different from the careful and laborious learning of ": null
    },
    {
        "Hody": "humphrey hody"
    },
    {
        ", Mill or ": null
    },
    {
        "Edmund Chilmead": "edmund chilmead"
    },
    {
        ". To the small circle of classical students , it was obvious that he was a critic beyond the ordinary.        In 42 Bentley had taken ": null
    },
    {
        "deacon": "deacon"
    },
    {
        "s orders. In 42 he was nominated first ": null
    },
    {
        "Boyle lecturer": "boyle lectures"
    },
    {
        ", a nomination repeated in 42 He was offered the appointment a third time in 42 but declined it, as he was involved in too many other activities. In the first series of lectures , he endeavours to present ": null
    },
    {
        "Newtonian": "isaac newton"
    },
    {
        " physics": "physics"
    },
    {
        " in a popular form, and to frame them  into proof of the existence of an intelligent Creator. He had some correspondence with Newton, then living in ": null
    },
    {
        "Trinity College, Cambridge": "trinity college, cambridge"
    },
    {
        ", on the subject. The second series, preached in 42 has not been published and is believed to be lost.     After being ": null
    },
    {
        "ordain": "ordain"
    },
    {
        "ed, Bentley was promoted to a ": null
    },
    {
        "prebendal stall": "prebendal stall"
    },
    {
        " in ": null
    },
    {
        "Worcester Cathedral": "worcester cathedral"
    },
    {
        ". In 42 the curator of the royal library became vacant, and his friends tried to obtain the position for Bentley, but did not have enough influence. The new librarian, a Mr Thynne, resigned in favour of Bentley, on condition that he receive an annuity of £42 for life out of the £42 salary. In 42 Bentley received a royal ": null
    },
    {
        "chaplaincy": "chaplaincy"
    },
    {
        " and the ": null
    },
    {
        "living": "benefice"
    },
    {
        " of ": null
    },
    {
        "Hartlebury": "hartlebury"
    },
    {
        ".     That same year, he was elected a fellow of the ": null
    },
    {
        "Royal Society": "royal society"
    },
    {
        ", and in 42 earned the degree of D.D. . The scholar ": null
    },
    {
        "Johann Georg Graevius": "johann georg graevius"
    },
    {
        " of ": null
    },
    {
        "Utrecht": "utrecht"
    },
    {
        " made a dedication to him, prefixed to a dissertation on ": null
    },
    {
        "Albert Rubens": "albert rubens"
    },
    {
        ", De Vita Fl. Mallii Theodori .     Epistles of Phalaris": null
    },
    {
        "St. Jamess Palace": "st. jamess palace"
    },
    {
        ", and his first care was the royal library in ": null
    },
    {
        "Ashburnham House": "ashburnham house"
    },
    {
        ". He worked to restore the collection from a dilapidated condition. He persuaded the ": null
    },
    {
        "Earl of Marlborough": "john churchill, 1st duke of marlborough"
    },
    {
        " to ask for additional rooms in the palace for the books. This was granted, but Marlborough kept them for personal use. Bentley enforced the law, ensuring that publishers delivered nearly 42 volumes which had been purchased but not delivered.     The ": null
    },
    {
        "University of Cambridge": "university of cambridge"
    },
    {
        " commissioned him to obtain Greek and Latin fonts for their classical books; he had these made in Holland. He assisted ": null
    },
    {
        "John Evelyn": "john evelyn"
    },
    {
        " in his Numismata. Bentley did not settle down to the steady execution of any of the major projects he had started. In 42 he designed an edition of ": null
    },
    {
        "Philostratus": "philostratus"
    },
    {
        ", but abandoned it to Gottfried Olearius , to the joy, says ": null
    },
    {
        "F. A. Wolf": "friedrich august wolf"
    },
    {
        ", of Olearius and of no one else. He supplied ": null
    },
    {
        "Graevius": "graevius"
    },
    {
        " with collations of ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        ", and ": null
    },
    {
        "Joshua Barnes": "joshua barnes"
    },
    {
        " with a warning as to the spuriousness of the Epistles of ": null
    },
    {
        "Euripides": "euripides"
    },
    {
        ". Barnes printed the epistles anyway and declared that no one could doubt their authenticity but a man who was perfrictae frontis aut judicii imminuti .  For Graeviuss Callimachus , Bentley added a collection of the fragments with notes.     He wrote the Dissertation on the Epistles of Phalaris , his major academic work, almost accidentally. In 42 ": null
    },
    {
        "William Wotton": "william wotton"
    },
    {
        ", about to bring out a second edition of his Ancient and Modern Learning, asked Bentley to write out a paper exposing the spuriousness of the Epistles of ": null
    },
    {
        "Phalaris": "phalaris"
    },
    {
        ", long a subject of academic controversy. The ": null
    },
    {
        "Christ Church": "christ church, oxford"
    },
    {
        " editor of Phalaris, ": null
    },
    {
        "Charles Boyle": "charles boyle, 4th earl of orrery"
    },
    {
        ", resented Bentleys paper. He had already quarrelled with Bentley in trying to get the manuscript in the royal library collated for his edition . Boyle wrote a response which was accepted by the reading public, although it was much later criticised as showing superficial learning.  cites Dr ": null
    },
    {
        "Alexander Dyce": "alexander dyce"
    },
    {
        ", Bentleys Works, 42–42 The demand for Boyles book required a second printing. When Bentley responded, it was with his dissertation. The truth of its conclusions was not immediately recognised, but it has a high reputation.       In 42 the commissioners of ecclesiastical ": null
    },
    {
        "patronage": "patronage"
    },
    {
        " recommended Bentley to the Crown for the mastership of ": null
    },
    {
        "Trinity College, Cambridge": "trinity college, cambridge"
    },
    {
        ". He arrived an outsider and proceeded to reform the college administration. He started a programme of renovations to the buildings, and used his position to promote learning. He is also credited by the British mathematician ": null
    },
    {
        "Rouse Ball": "rouse ball"
    },
    {
        " with starting the first written examinations in the West in 42 all those prior to this being oral in nature. At the same time, he antagonised the fellows, and the capital programme caused reductions in their incomes, which they resented.     After ten years of stubborn but ineffectual resistance, the fellows appealed to the Visitor, the ": null
    },
    {
        "bishop of Ely": "bishop of ely"
    },
    {
        " . Their petition was full of general complaints. Bentleys reply  is in his most crushing style. The fellows amended their petition and added a charge of Bentleys having committed 42 breaches of the statutes. Bentley appealed directly to the Crown, and backed his application with a dedication of his  Horace  to the lord treasurer .     The Crown lawyers decided against him; the case was heard and a sentence of expulsion from the mastership was drawn up. Before it was executed, the bishop of Ely died and the process lapsed. The feud continued in various forms at lower levels. In 42 Cambridge rescinded Bentleys degrees, as punishment for failing to appear in the vice-chancellors court in a civil suit. It was not until 42 that he had them restored under the law.     In 42 the fellows of Trinity again brought Bentley to trial before the bishop of Ely , and he was sentenced to deprivation. The college statutes required the sentence to be executed by the vice-master ": null
    },
    {
        "Richard Walker": "richard walker"
    },
    {
        ", who was a friend of Bentley and refused to act. Although the feud continued until 42 or 42 , Bentley remained in his post.       During his mastership, except for the first two years, Bentley continuously pursued his studies, although he did not publish much. In 42 he contributed a critical appendix to ": null
    },
    {
        "John Davies": "john davies"
    },
    {
        "s edition of ": null
    },
    {
        "Cicero": "cicero"
    },
    {
        "s Tusculan Disputations. In the following year, he published his emendations on the Plutus and Nubes of ": null
    },
    {
        "Aristophanes": "aristophanes"
    },
    {
        ", and on the fragments of ": null
    },
    {
        "Menander": "menander"
    },
    {
        " and ": null
    },
    {
        "Philemon": "philemon"
    },
    {
        ". He published the last work under the pen name of Phileleutherus Lipsiensis. He used it again two years later in his Remarks on a late Discourse of Freethinking, a reply to ": null
    },
    {
        "Anthony Collins": "anthony collins"
    },
    {
        " the ": null
    },
    {
        "deist": "deism"
    },
    {
        ". The university thanked him for this work and its support of the Anglican Church and clergy.     Although he had long studied Horace, Bentley wrote his version quickly in the end, publishing it in 42 to gain public support at a critical period of the Trinity quarrel. In the preface, he declared his intention of confining his attention to criticism and correction of the text. Some of his 42 or 42 ": null
    },
    {
        "emendations": ":wikt:emendations"
    },
    {
        " have been accepted, but the majority were rejected by the early 42th century as unnecessary, although scholars acknowledged they showed his wide learning.     In 42 in a letter to ": null
    },
    {
        "William Wake": "william wake"
    },
    {
        ", ": null
    },
    {
        "Archbishop of Canterbury": "archbishop of canterbury"
    },
    {
        ", Bentley announced his plan to prepare a critical edition of the ": null
    },
    {
        "New Testament": "new testament"
    },
    {
        ". During the next four years, assisted by ": null
    },
    {
        "J. J. Wetstein": "j. j. wetstein"
    },
    {
        ", an eminent biblical critic, he collected materials for the work. In 42 he published Proposals for a New Edition of the Greek Testament, with examples of how he intended to proceed. By comparing the text of the ": null
    },
    {
        "Vulgate": "vulgate"
    },
    {
        " with that of the oldest Greek manuscripts, Bentley proposed to restore the Greek text as received by the church at the time of the ": null
    },
    {
        "Council of Nicaea": "first council of nicaea"
    },
    {
        ".  Bentleys lead manuscript was  Codex Alexandrinus , which he described as the oldest and best in the world . Bentley used also manuscripts: ": null
    },
    {
        "42": "minuscule 51"
    },
    {
        ", ": null
    },
    {
        "42": "minuscule 54"
    },
    {
        ", ": null
    },
    {
        "42": "minuscule 60"
    },
    {
        ", ": null
    },
    {
        "42": "minuscule 113"
    },
    {
        ", ": null
    },
    {
        "42": "minuscule 440"
    },
    {
        ", ": null
    },
    {
        "42": "minuscule 507"
    },
    {
        ", and ": null
    },
    {
        "42": "minuscule 508"
    },
    {
        ". ": null
    },
    {
        "John Walker": "john walker"
    },
    {
        " worked over many manuscripts for the project, particularly in Paris with the help of the ": null
    },
    {
        "Maur": "congregation of saint maur"
    },
    {
        "ists. Numerous subscribers were obtained to support publication of the work, but he never completed it.     His  Terence  is more important than his Horace; next to the Phalaris, this most determined his reputation. In 42 he also published the Fables of ": null
    },
    {
        "Phaedrus": "phaedrus"
    },
    {
        " and the Sententiae of ": null
    },
    {
        "Publilius Syrus": "publilius syrus"
    },
    {
        ".     His  Paradise Lost  , suggested by ": null
    },
    {
        "Queen Caroline": "caroline of ansbach"
    },
    {
        ", has been criticised as the weakest of his work. He suggested that the poet ": null
    },
    {
        "John Milton": "john milton"
    },
    {
        " had employed both an ": null
    },
    {
        "amanuensis": "amanuensis"
    },
    {
        " and an editor, who were responsible for clerical errors and interpolations, but it is unclear whether Bentley believed his own position. ": null
    },
    {
        "A. E. Housman": "a. e. housman"
    },
    {
        ", who called him the greatest scholar that England or perhaps that Europe ever bred nevertheless criticised his poetic sensibility severely: ...we are not all so easily found out as Bentley, because we have not Bentleys intrepid candour. There is a sort of savage nobility about his firm reliance on his own bad taste... .     Bentley never published his planned edition of ": null
    },
    {
        "Homer": "homer"
    },
    {
        ", but some of his manuscript and marginal notes are held by Trinity College. Their chief importance is in his attempt to restore the metre by the insertion of the lost  digamma .       According to the anonymous author of his biography in the ": null
    },
    {
        "Encyclopaedia Britannica Eleventh Edition": "encyclopaedia britannica eleventh edition"
    },
    {
        ", Bentley was self-assertive and presumptuous, which alienated some people. But, ": null
    },
    {
        "James Henry Monk": "james henry monk"
    },
    {
        ", Bentleys biographer, charged him with an indecorum of which he was not guilty. Bentley seemed to inspire mixed feelings of admiration and repugnance.       In 42 Bentley married Joanna , daughter of ": null
    },
    {
        "Sir John Bernard, 42nd Baronet": "sir john bernard, 2nd baronet"
    },
    {
        " of Brampton, ": null
    },
    {
        "Huntingdonshire": "huntingdonshire"
    },
    {
        ". They had three children together:   ": null
    },
    {
        "Richard": "richard bentley"
    },
    {
        " , an eccentric, playwright and artist,, and two daughters, one named Johanna.      His daughter Johanna Bentley married ": null
    },
    {
        "Denison Cumberland": "denison cumberland"
    },
    {
        " in 42 a grandson of ": null
    },
    {
        "Richard Cumberland": "richard cumberland"
    },
    {
        " the ": null
    },
    {
        "bishop of Peterborough": "bishop of peterborough"
    },
    {
        ", and himself later a bishop of the ": null
    },
    {
        "Church of Ireland": "church of ireland"
    },
    {
        ".Their son ": null
    },
    {
        "Richard Cumberland": "richard cumberland"
    },
    {
        " developed as a prolific dramatist, while earning his living as a civil servant.       In old age, Bentley continued to read; and enjoyed the society of his friends and several rising scholars, J Markland, John Taylor, and his nephews Richard and Thomas Bentley, with whom he discussed classical subjects. He died on the 42 July 42 of ": null
    },
    {
        "pleurisy": "pleurisy"
    },
    {
        ".    ": null
    },
    {
        "sh": "sh"
    },
    {
        "42–42": "04–17"
    },
    {
        "assical schol": "assical schol"
    },
    {
        "he was assigned a niche in The Dunciad42 42 ": null
    },
    {
        "amati": "amati"
    },
    {
        " in his copies of the editions by ": null
    },
    {
        "Pareus": "pareus"
    },
    {
        ", ": null
    },
    {
        "Camerarius": "joachim camerarius"
    },
    {
        " and ": null
    },
    {
        "Gronovius": "gronovius"
    },
    {
        ", edited by Schroder, 42 and Sonnenschein, 4242and excerpts42424242424242": null
    }
]