[
    {
        "In ": null
    },
    {
        "logic": "logic"
    },
    {
        ", Richards paradox is a semantical ": null
    },
    {
        "antinomy": "antinomy"
    },
    {
        " of ": null
    },
    {
        "set theory": "set theory"
    },
    {
        " and natural language first described by the ": null
    },
    {
        "French": "france"
    },
    {
        " mathematician": "mathematician"
    },
    {
        " Jules Richard": "jules richard"
    },
    {
        " in 42 The paradox is ordinarily used to motivate the importance of distinguishing carefully between ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        " and ": null
    },
    {
        "metamathematics": "metamathematics"
    },
    {
        ". ": null
    },
    {
        "Kurt Gödel": "kurt gödel"
    },
    {
        " specifically cites Richards antinomy as a semantical analogue to his syntactical incompleteness result in the introductory section of ": null
    },
    {
        "On Formally Undecidable Propositions in Principia Mathematica and Related Systems I": "on formally undecidable propositions in principia mathematica and related systems i"
    },
    {
        " . The paradox was also a motivation of the development of ": null
    },
    {
        "predicative": "impredicativity"
    },
    {
        " mathematics.         The original statement of the paradox, due to Richard , is strongly related to ": null
    },
    {
        "Cantors diagonal argument": "cantors diagonal argument"
    },
    {
        " on the uncountability of the set of ": null
    },
    {
        "real number": "real number"
    },
    {
        "s.     The paradox begins with the observation that certain expressions of natural language define real numbers unambiguously, while other expressions of natural language do not. For example, The real number the integer part of which is 42 and the nth decimal place of which is 42 if n is even and 42 if n is odd defines the real number 42... 42/42 while the phrase the capital of England does not define a real number, also, the phrase the smallest positive integer not definable in under sixty letters does not define a real number .     Thus there is an infinite list of English phrases that define real numbers unambiguously. We first arrange this list of phrases by increasing length, then order all phrases of equal length ": null
    },
    {
        "lexicographically": "lexicographical order"
    },
    {
        " , so that the ordering is ": null
    },
    {
        "canonical": "canonical form"
    },
    {
        ". This yields an infinite list of the corresponding real numbers: r 42 , r 42 , ... . Now define a new real number r as follows. The integer part of r is 42 the nth decimal place of r is 42 if the nth decimal place of r n is not 42 and the nth decimal place of r is 42 if the nth decimal place of r n is 42     The preceding two paragraphs are an expression in English that unambiguously defines a real number r. Thus r must be one of the numbers r n . However, r was constructed so that it cannot equal any of the r n . This is the paradoxical contradiction.         Richards paradox results in an untenable contradiction, which must be analyzed to find an error.     The proposed definition of the new real number r clearly includes a finite sequence of characters, and hence it seems at first to be a definition of a real number. However, the definition refers to definability-in-English itself. If it were possible to determine which English expressions actually do define a real number, and which do not, then the paradox would go through. Thus the resolution of Richards paradox is that there is not any way to unambiguously determine exactly which English sentences are definitions of real numbers . That is, there is not any way to describe in a finite number of words how to tell whether an arbitrary English expression is a definition of a real number. This is not surprising, as the ability to make this determination would also imply the ability to solve the ": null
    },
    {
        "halting problem": "halting problem"
    },
    {
        " and perform any other non-algorithmic calculation that can be described in English.     A similar phenomenon occurs in formalized theories that are able to refer to their own syntax, such as ": null
    },
    {
        "Zermelo–Fraenkel set theory": "zermelo–fraenkel set theory"
    },
    {
        " . Say that a formula φ defines a real number if there is exactly one real number r such that φ holds. Then it is not possible to define, by ZFC, the set of all  formulas that define real numbers. For, if it were possible to define this set, it would be possible to diagonalize over it to produce a new definition of a real number, following the outline of Richards paradox above. Note that the set of formulas that define real numbers may exist, as a set F; the limitation of ZFC is that there is not any formula that defines F without reference to other sets. This is related to ": null
    },
    {
        "Tarskis indefinability theorem": "tarskis indefinability theorem"
    },
    {
        ".     The example of ZFC illustrates the importance of distinguishing the ": null
    },
    {
        "metamathematics": "metamathematics"
    },
    {
        " of a formal system from the statements of the formal system itself. The property D that a formula φ of ZFC defines a unique real number is not itself expressible by ZFC, but must be considered as part of the ": null
    },
    {
        "metatheory": "metatheory"
    },
    {
        " used to formalize ZFC. From this viewpoint, Richards paradox results from treating a construction of the metatheory as if that construction could be performed in the original system.         A variation of the paradox uses integers instead of real-numbers, while preserving the self-referential character of the original. Consider a language in which the ": null
    },
    {
        "arithmetical properties": "arithmetic"
    },
    {
        " of integers are defined. For example, the first natural number defines the property of being the first natural number, one; and divisible by exactly two natural numbers defines the property of being a ": null
    },
    {
        "prime number": "prime number"
    },
    {
        ".  While the list of all such possible definitions is itself infinite, it is easily seen that each individual definition is composed of a finite number of words, and therefore also a finite number of characters. Since this is true, we can order the definitions, first by length and then ": null
    },
    {
        "lexicographically": "lexicographical order"
    },
    {
        ".     Now, we may ": null
    },
    {
        "map": "map"
    },
    {
        " each definition to the set of ": null
    },
    {
        "natural number": "natural number"
    },
    {
        "s, such that the definition with the smallest number of characters and alphabetical order will correspond to the number 42 the next definition in the series will correspond to 42 and so on. Since each definition is associated with a unique integer, then it is possible that occasionally the integer assigned to a definition fits that definition. If, for example, the definition not divisible by any integer other than 42 and itself happened to be 42rd, then this would be true. Since 42 is itself not divisible by any integer other than 42 and itself, then the number of this definition has the property of the definition itself. However, this may not always be the case. If the definition: divisible by 42 were assigned to the number 42 then the number of the definition does not have the property of the definition itself. Since 42 is itself not divisible by 42 This latter example will be termed as having the property of being Richardian. Thus, if a number is Richardian, then the definition corresponding to that number is a property that the number itself does not have.  Thus in this example, 42 is Richardian, but 42 is not.     Now, since the property of being Richardian is itself a numerical property of integers, it belongs in the list of all definitions of properties. Therefore, the property of being Richardian is assigned some integer, n. For example, the definition being Richardian might be assigned to the number 42 Finally, the paradox becomes: Is 42 Richardian? Suppose 42 is Richardian. This is only possible if 42 does not have the property designated by the defining expression which it is correlated with. In other words, this means 42 is not Richardian, contradicting our assumption. However, if we suppose 42 is not Richardian, then it does have the defining property which it corresponds to. This, by definition, means that it is Richardian, again contrary to assumption. Thus, the statement 42 is Richardian cannot consistently be designated as either true or false.         Another opinion concerning Richards paradox relates to mathematical ": null
    },
    {
        "predicativism": "predicativism"
    },
    {
        ". By this view, the real numbers are defined in stages, with each stage only making reference to previous stages and other things that have already been defined. From a predicative viewpoint it is not valid to quantify over all real numbers in the process of generating a new real number, because this is believed to result in a circularity problem in the definitions. Set theories such as ZFC are not based on this sort of predicative framework, and allow impredicative definitions.     Richard presented a solution to the paradox from the viewpoint of predicativisim. Richard claimed that the flaw of the paradoxical construction was that the expression for the construction of the real number r does not actually define a real number unambiguously, because the statement refers to the construction of an infinite set of real numbers, of which r itself is a part. Thus, Richard says, the real number r will not be included as any r n , because the definition of r does not meet the criteria for being included in the sequence of definitions used to construct the sequence r n . Contemporary mathematicians agree that the definition of r is invalid, but for a different reason. They believe the definition of r is invalid because there is no well-defined notion of when an English phrase defines a real number, and so there is no unambiguous way to construct the sequence r n .     Although Richards solution to the paradox did not gain favor with mathematicians, predicativism is an important part of the study of the ": null
    },
    {
        "foundations of mathematics": "foundations of mathematics"
    },
    {
        ". Predicativism was first studied in detail by ": null
    },
    {
        "Hermann Weyl": "hermann weyl"
    },
    {
        " in Das Kontinuum, wherein he showed that much of elementary ": null
    },
    {
        "real analysis": "real analysis"
    },
    {
        " can be conducted in a predicative manner starting with only the ": null
    },
    {
        "natural number": "natural number"
    },
    {
        "s. More recently, predicativism has been studied by ": null
    },
    {
        "Solomon Feferman": "solomon feferman"
    },
    {
        ", who has used ": null
    },
    {
        "proof theory": "proof theory"
    },
    {
        " to explore the relationship between predicative and impredicative systems. Solomon Feferman, ": null
    }
]