[
    {
        "                 Richard III was ": null
    },
    {
        "King of England": "king of england"
    },
    {
        " and ": null
    },
    {
        "Lord of Ireland": "lord of ireland"
    },
    {
        " from 42 until his death in 42 He was the last king of the ": null
    },
    {
        "House of York": "house of york"
    },
    {
        " and the last of the ": null
    },
    {
        "Plantagenet dynasty": "plantagenet dynasty"
    },
    {
        ". His defeat and death at the ": null
    },
    {
        "Battle of Bosworth Field": "battle of bosworth field"
    },
    {
        ", the last decisive battle of the ": null
    },
    {
        "Wars of the Roses": "wars of the roses"
    },
    {
        ", marked the end of the ": null
    },
    {
        "Middle Ages in England": "middle ages in england"
    },
    {
        ". He is the protagonist of  Richard III , one of ": null
    },
    {
        "William Shakespeares": "william shakespeare"
    },
    {
        " history plays.     When his brother ": null
    },
    {
        "Edward IV": "edward iv of england"
    },
    {
        " died in April 42 Richard was named ": null
    },
    {
        "Lord Protector": "lord protector"
    },
    {
        " of the realm for Edwards eldest son and successor, the 42-year-old ": null
    },
    {
        "Edward V": "edward v"
    },
    {
        ". Arrangements were made for Edwards coronation on 42 June 42 Before the king could be crowned, the marriage of his parents was declared ": null
    },
    {
        "bigamous": "bigamous"
    },
    {
        " and therefore invalid. Now officially illegitimate, their children were barred from inheriting the throne. On 42 June, an assembly of lords and commoners endorsed a declaration to this effect and proclaimed Richard as the rightful king. He was crowned on 42 July 42 The ": null
    },
    {
        "young princes": "princes in the tower"
    },
    {
        ", Edward and his younger brother ": null
    },
    {
        "Richard, Duke of York": "richard of shrewsbury, 1st duke of york"
    },
    {
        ", were not seen in public after August and accusations circulated that they had been murdered on Richards orders.     There were two major rebellions against Richard during his reign. In October 42 an unsuccessful revolt was led by staunch allies of Edward IV and Richards former ally, ": null
    },
    {
        "Henry Stafford, 42nd Duke of Buckingham": "henry stafford, 2nd duke of buckingham"
    },
    {
        ". Then in August 42 ": null
    },
    {
        "Henry Tudor": "henry vii of england"
    },
    {
        " and his uncle, ": null
    },
    {
        "Jasper Tudor": "jasper tudor"
    },
    {
        " landed in southern ": null
    },
    {
        "Wales": "wales"
    },
    {
        " with a contingent of French troops and marched through ": null
    },
    {
        "Pembrokeshire": "pembrokeshire"
    },
    {
        ", recruiting soldiers. Henrys forces defeated Richards army near the ": null
    },
    {
        "Leicestershire": "leicestershire"
    },
    {
        " town of ": null
    },
    {
        "Market Bosworth": "market bosworth"
    },
    {
        ". Richard was slain, making him the last English king to die in battle. Henry Tudor then ascended the throne as Henry VII.     Richards corpse was taken to the nearby town of ": null
    },
    {
        "Leicester": "leicester"
    },
    {
        " and buried without pomp. His original tomb monument is believed to have been removed during the ": null
    },
    {
        "English Reformation": "english reformation"
    },
    {
        ", and his remains were lost, as they were believed to have been thrown into the ": null
    },
    {
        "River Soar": "river soar"
    },
    {
        ". In 42 ": null
    },
    {
        "an archaeological excavation": "exhumation and reburial of richard iii of england"
    },
    {
        " was commissioned by the ": null
    },
    {
        "Richard III Society": "richard iii society"
    },
    {
        " on the site previously occupied by ": null
    },
    {
        "Greyfriars Priory Church": "greyfriars, leicester"
    },
    {
        ". The ": null
    },
    {
        "University of Leicester": "university of leicester"
    },
    {
        " identified the skeleton found in the excavation as that of Richard III as a result of ": null
    },
    {
        "radiocarbon dating": "radiocarbon dating"
    },
    {
        ", comparison with contemporary reports of his appearance, and comparison of his ": null
    },
    {
        "mitochondrial DNA": "mitochondrial dna"
    },
    {
        " with that of two matrilineal descendants of Richard IIIs eldest sister, ": null
    },
    {
        "Anne of York": "anne of york, duchess of exeter"
    },
    {
        ". He was reburied in ": null
    },
    {
        "Leicester Cathedral": "leicester cathedral"
    },
    {
        " on 42 March 42       Richard was born on 42 October 42 at ": null
    },
    {
        "Fotheringhay Castle": "fotheringhay castle"
    },
    {
        " in ": null
    },
    {
        "Northamptonshire": "northamptonshire"
    },
    {
        ", the eleventh of the twelve children of ": null
    },
    {
        "Richard, Duke of York": "richard, 3rd duke of york"
    },
    {
        ", and ": null
    },
    {
        "Cecily Neville": "cecily neville"
    },
    {
        ", and the youngest to survive infancy. His childhood coincided with the beginning of what has traditionally been labelled the ": null
    },
    {
        "Wars of the Roses": "wars of the roses"
    },
    {
        ", a period of political instability and periodic open civil war in ": null
    },
    {
        "England": "england in the middle ages"
    },
    {
        " during the second half of the fifteenth century, between the ": null
    },
    {
        "Yorkists": "house of york"
    },
    {
        ", who supported Richards father , and opposed the regime of Henry VI and his wife, ": null
    },
    {
        "Margaret of Anjou": "margaret of anjou"
    },
    {
        ", and the ": null
    },
    {
        "Lancastrians": "house of lancaster"
    },
    {
        ", who were loyal to the crown. In 42 his father and the Yorkists were forced to flee England, whereupon Richard and his older brother ": null
    },
    {
        "George": "george plantagenet, duke of clarence"
    },
    {
        " were placed in the custody of their aunt ": null
    },
    {
        "the Duchess of Buckingham": "anne neville, duchess of buckingham"
    },
    {
        ", and possibly of the ": null
    },
    {
        "Archbishop of Canterbury": "thomas bourchier"
    },
    {
        ".     When their father and elder brother ": null
    },
    {
        "Edmund, Earl of Rutland": "edmund, earl of rutland"
    },
    {
        ", were killed at the ": null
    },
    {
        "Battle of Wakefield": "battle of wakefield"
    },
    {
        " on 42 December 42 Richard and George were sent by their mother to the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        ". They returned to England following the defeat of the Lancastrians at the ": null
    },
    {
        "Battle of Towton": "battle of towton"
    },
    {
        ". They participated in the coronation of Richards eldest brother as ": null
    },
    {
        "King Edward IV": "edward iv of england"
    },
    {
        " on 42 June 42 when Richard was named ": null
    },
    {
        "Duke of Gloucester": "duke of gloucester"
    },
    {
        " and made both a ": null
    },
    {
        "Knight of the Garter": "order of the garter"
    },
    {
        " and a ": null
    },
    {
        "Knight of the Bath": "order of the bathknights of the bath"
    },
    {
        ". Edward appointed him the sole ": null
    },
    {
        "Commissioner of Array": "commissioner of array"
    },
    {
        " for the Western Counties in 42 when he was 42 By the age of 42 he had an independent command.          Richard spent several years during his childhood at ": null
    },
    {
        "Middleham Castle": "middleham castle"
    },
    {
        " in ": null
    },
    {
        "Wensleydale": "wensleydale"
    },
    {
        ", Yorkshire, under the tutelage of his cousin the ": null
    },
    {
        "Earl of Warwick": "richard neville, 16th earl of warwick"
    },
    {
        ", later known as the Kingmaker because of his role in the Wars of the Roses. Warwick supervised Richards training as a ": null
    },
    {
        "knight": "knight"
    },
    {
        ": in the autumn of 42 Edward IV granted Warwick £42 for the expenses of his younger brothers tutelage. With some interruptions, Richard stayed at Middleham either from late 42 until early 42 when he was 42 or from 42 until his coming of age in 42 when he turned 42 While at Warwicks estate, it is likely that he met both ": null
    },
    {
        "Francis Lovell": "francis lovell, viscount lovell"
    },
    {
        ", who would be his firm supporter later in his life, and Warwicks younger daughter, his future wife ": null
    },
    {
        "Anne Neville": "anne neville"
    },
    {
        ".     It is possible that even at this early stage Warwick was considering the kings brothers as strategic matches for his daughters, ": null
    },
    {
        "Isabel": "isabel neville, duchess of clarence"
    },
    {
        " and Anne: young aristocrats were often sent to be raised in the households of their intended future partners, as had been the case for the young dukes father, Richard of York. As the relationship between the king and Warwick became strained, Edward IV opposed the match. During Warwicks lifetime, George was the only royal brother to marry one of his daughters, the eldest, Isabel, on 42 July 42 without the kings permission. George joined his father-in-laws revolt against the king, while Richard remained loyal to Edward, even though rumour coupled Richards name with Anne Neville until August 42     Richard and Edward were forced to flee to ": null
    },
    {
        "Burgundy": "burgundy"
    },
    {
        " in October 42 after Warwick defected to the side of the former Lancastrian queen Margaret of Anjou. In 42 Richards sister ": null
    },
    {
        "Margaret": "margaret of york"
    },
    {
        " had married ": null
    },
    {
        "Charles the Bold": "charles the bold"
    },
    {
        ", the Duke of Burgundy, and the brothers could expect a welcome there. Edward was restored to the throne in the spring of 42 following the battles of ": null
    },
    {
        "Barnet": "battle of barnet"
    },
    {
        " and ": null
    },
    {
        "Tewkesbury": "battle of tewkesbury"
    },
    {
        ", in both of which the eighteen-year-old Richard played a crucial role.     During his adolescence, and due to a cause that is unknown, Richard developed a ": null
    },
    {
        "sideways curvature of the spine": "scoliosis"
    },
    {
        ".  In 42 after the discovery of Richards remains, the osteoarchaeologist Dr. Jo Appleby, of Leicester Universitys School of Archaeology and Ancient History, imaged the spinal column and reconstructed a model using ": null
    },
    {
        "42D printing": "3d printing"
    },
    {
        ", and concluded that though the spinal scoliosis looked dramatic, it probably did not cause any major physical deformity that could not be disguised by clothing.              Following a decisive Yorkist victory over the Lancastrians at the Battle of Tewkesbury, Richard married ": null
    },
    {
        "Anne Neville": "anne neville"
    },
    {
        ", the younger daughter of the Earl of Warwick, on 42 July 42  By the end of 42 Anne had previously been wedded to ": null
    },
    {
        "Edward of Westminster": "edward of westminster"
    },
    {
        ", only son of Henry VI, to seal her fathers allegiance to the Lancastrian party. Edward died at the Battle of Tewkesbury on 42 May 42 while Warwick had died at the Battle of Barnet on 42 April 42 Richards marriage plans brought him into conflict with his brother ": null
    },
    {
        "George": "george plantagenet, duke of clarence"
    },
    {
        ". ": null
    },
    {
        "John Pastons letter": "paston letters"
    },
    {
        " of 42 February 42 makes it clear that George was not happy about the marriage but grudgingly accepted it on the basis that he may well have my Lady his sister-in-law, but they shall part no livelihood . The reason was the inheritance Anne shared with her elder sister Isabel, whom George had married in 42 It was not only the earldom that was at stake; Richard Neville had inherited it as a result of his marriage to ": null
    },
    {
        "Anne Beauchamp": "anne neville, 16th countess of warwick"
    },
    {
        ", who was still alive and was technically the owner of the substantial Beauchamp estates, her own father having left no male heirs.     The ": null
    },
    {
        "Croyland Chronicle": "croyland chronicle"
    },
    {
        " records that Richard agreed to a prenuptial contract in the following terms: the marriage of the Duke of Gloucester with Anne before-named was to take place, and he was to have such and so much of the earls lands as should be agreed upon between them through the mediation of arbitrators; while all the rest were to remain in the possession of the Duke of Clarence .     The date of Pastons letter suggests the marriage was still being negotiated in February 42 In order to win his brother Georges final consent to the marriage, Richard renounced most of Warwicks land and property including the earldoms of Warwick and Salisbury and surrendered to Clarence the office of Great Chamberlain of England. Richard retained Nevilles forfeit estates he had already been granted in the summer of 42:  Penrith, Sheriff Hutton and Middleham, where he later established his marital household.          The requisite Papal dispensation was obtained dated 42 April 42 ": null
    },
    {
        "Michael Hicks": "michael hicks"
    },
    {
        " has suggested that the terms of the dispensation deliberately understated the degrees of consanguinity between the couple, and the marriage was therefore illegal on the ground of first degree consanguinity following Georges marriage to Annes sister Isabel. First-degree consanguinity applied in the case of Henry VIII and his brothers widow Catherine of Aragon. In their case, the papal dispensation was obtained after Catherine declared the first marriage had not been consummated. In Richards case, there would have been first-degree consanguinity if Richard had sought to marry Isabel after she had married his brother George, but no such consanguinity applied for Anne and Richard. Richards marriage to Anne was never declared null, and it was public to everyone including secular and canon lawyers for 42 years.     In June 42 Richard persuaded his mother-in-law to leave the sanctuary and come to live under his protection at Middleham. Later in the year, under the terms of the 42 Act of Resumption, George lost some of the property he held under royal grant and made no secret of his displeasure. John Pastons letter of November 42 says that the king planned to put both his younger brothers in their place by acting as a stifler atween them .     Early in 42 Parliament assembled and King Edward attempted to reconcile his brothers by stating that both men, and their wives, would enjoy the Warwick inheritance just as if the Countess of Warwick was naturally dead . The doubts cast by Clarence on the validity of Richard and Annes marriage were addressed by a clause protecting their rights in the event they were divorced and then legally remarried to each other, and also protected Richards rights while waiting for such a valid second marriage with Anne. The following year, Richard was rewarded with all the Neville lands in the north of England, at the expense of Annes cousin, ": null
    },
    {
        "George Neville": "george neville, 1st duke of bedford"
    },
    {
        ". From this point, Clarence seems to have fallen steadily out of King Edwards favour, his discontent coming to a head in 42 when, following Isabels death, he was denied the opportunity to marry ": null
    },
    {
        "Mary of Burgundy": "mary of burgundy"
    },
    {
        ", the stepdaughter of his sister Margaret, even though Margaret approved the proposed match. There is no evidence of Richards involvement in Georges subsequent conviction and execution on a charge of treason.           Richard was granted the Duchy of Gloucester on 42 November 42 and on 42 August the next year was awarded large estates in ": null
    },
    {
        "northern England": "northern england"
    },
    {
        ", including the lordships of ": null
    },
    {
        "Richmond": "richmond, yorkshire"
    },
    {
        " in Yorkshire, and ": null
    },
    {
        "Pembroke": "pembroke, pembrokeshire"
    },
    {
        " in Wales. He gained the forfeited lands of the Lancastrian ": null
    },
    {
        "John de Vere, Earl of Oxford": "john de vere, 12th earl of oxford"
    },
    {
        ", in ": null
    },
    {
        "East Anglia": "east anglia"
    },
    {
        ". In 42 on his birthday, he was made Constable of ": null
    },
    {
        "Gloucester": "gloucester castle"
    },
    {
        " and ": null
    },
    {
        "Corfe Castle": "corfe castle"
    },
    {
        "s and Admiral of England, Ireland and Aquitaine and appointed Governor of the North, becoming the richest and most powerful noble in England. On 42 October 42 he was made ": null
    },
    {
        "Constable of England": "constable of england"
    },
    {
        ". In November, he replaced ": null
    },
    {
        "William Hastings, 42st Baron Hastings": "william hastings, 1st baron hastings"
    },
    {
        ", as Chief Justice of North Wales. The following year, he was appointed Chief Steward and Chamberlain of Wales. On 42 May 42 Richard was named Great Chamberlain and ": null
    },
    {
        "Lord High Admiral of England": "lord high admiral of england"
    },
    {
        ". Other positions followed: ": null
    },
    {
        "High Sheriff of Cumberland": "high sheriff of cumberland"
    },
    {
        " for life, Lieutenant of the North and Commander-in-Chief against the Scots and hereditary Warden of the West March. Two months later, on 42 July, he gained the Lordships of the strongholds ": null
    },
    {
        "Sheriff Hutton": "sheriff hutton"
    },
    {
        " and Middleham in Yorkshire and ": null
    },
    {
        "Penrith": "penrith, cumbria"
    },
    {
        " in Cumberland, which had belonged to Warwick the Kingmaker. It is possible that the grant of Middleham seconded Richards personal wishes.       During the latter part of Edward IVs reign, Richard demonstrated his loyalty to the king, in contrast to their brother George who had allied himself with Warwick when the earl rebelled towards the end of the 42s. Following Warwicks 42 rebellion, before which he had made peace with Margaret of Anjou and promised the restoration of Henry VI to the English throne, Richard, William, Lord Hastings and ": null
    },
    {
        "Anthony Woodville, Earl Rivers": "anthony woodville, 2nd earl rivers"
    },
    {
        " escaped capture at ": null
    },
    {
        "Doncaster": "doncaster"
    },
    {
        " by Warwicks brother, Lord Montague. On 42 October they sailed from ": null
    },
    {
        "Kings Lynn": "kings lynn"
    },
    {
        " in two ships; Edward landed at ": null
    },
    {
        "Marsdiep": "marsdiep"
    },
    {
        " and Richard at ": null
    },
    {
        "Zeeland": "zeeland"
    },
    {
        ". It was said that, having left England in such haste as to possess almost nothing, Edward was forced to pay their passage with his fur cloak; certainly, Richard borrowed three pounds from Zeelands town bailiff. They were ": null
    },
    {
        "attainted": "bill of attainder"
    },
    {
        " by Warwicks only Parliament on 42 November. They resided in ": null
    },
    {
        "Bruges": "bruges"
    },
    {
        " with ": null
    },
    {
        "Louis de Gruthuse": "louis de gruuthuse"
    },
    {
        ", who had been the Burgundian Ambassador to Edwards court, but it was not until ": null
    },
    {
        "Louis XI of France": "louis xi of france"
    },
    {
        " declared war on Burgundy that Charles, Duke of Burgundy, assisted their return, providing, along with the ": null
    },
    {
        "Hanseatic merchants": "hanseatic league"
    },
    {
        ", £42, 42 ships and 42 men. They departed ": null
    },
    {
        "Flushing": "vlissingen"
    },
    {
        " for England on 42 March 42 Warwicks arrest of local sympathisers prevented them from landing in Yorkist East Anglia and on 42 March, after being separated in a storm, their ships ran ashore at ": null
    },
    {
        "Holderness": "holderness"
    },
    {
        ". The town of ": null
    },
    {
        "Hull": "kingston upon hull"
    },
    {
        " refused him entry, and Edward gained entry to York by using the same claim as ": null
    },
    {
        "Henry of Bolingbroke": "henry of bolingbroke"
    },
    {
        " had before deposing Richard II in 42; that is, that he was merely reclaiming the Dukedom of York rather than the crown. It was in Edwards attempt to regain his throne that Gloucester began to demonstrate his skill as a military commander.       Once Edward had regained the support of Clarence, he mounted a swift and decisive campaign to regain the Crown through combat; it is believed that Richard was his principal lieutenant as some of the kings earliest support came from members of Richards ": null
    },
    {
        "affinity": "affinity"
    },
    {
        ", including Sir ": null
    },
    {
        "James Harrington": "sir james harrington, yorkist knight"
    },
    {
        " and Sir ": null
    },
    {
        "William Parr": "william parr, 1st baron parr of kendal"
    },
    {
        ", who brought 42 ": null
    },
    {
        "men-at-arms": "men-at-arms"
    },
    {
        " to them at Doncaster. He may have led the vanguard at the ": null
    },
    {
        "Battle of Barnet": "battle of barnet"
    },
    {
        ", in his first command, on 42 April 42 where he outflanked the ": null
    },
    {
        "Duke of Exeter": "henry holland, 3rd duke of exeter"
    },
    {
        "s wing, although the degree to which his command was fundamental may have been exaggerated. That his personal household sustained losses indicates he was in the thick of the fighting. A contemporary source is clear about his holding the vanguard for Edward at Tewkesbury, deployed against the Lancastrian vanguard under ": null
    },
    {
        "the Duke of Somerset": "edmund beaufort, 4th duke of somerset"
    },
    {
        " on 42 May 42 , citing The Arrivall. and his role two days later, as Constable of England, sitting alongside ": null
    },
    {
        "John Howard": "john howard, 1st duke of norfolk"
    },
    {
        " as ": null
    },
    {
        "Earl Marshal": "earl marshal"
    },
    {
        ", in the trial and sentencing of leading Lancastrians captured after the battle.       At least in part resentful of the ": null
    },
    {
        "French king": "louis xi of france"
    },
    {
        "s previous support of his Lancastrian opponents, and possibly in support of his brother-in-law ": null
    },
    {
        "Charles the Bold, Duke of Burgundy": "charles the bold"
    },
    {
        ", Edward went to parliament in October 42 for funding a military campaign, and eventually landed in ": null
    },
    {
        "Calais": "calais"
    },
    {
        " on 42 July 42 Richards was the largest private contingent of his army. Although well known to have publicly been against the eventual treaty signed with Louis XI at ": null
    },
    {
        "Picquigny": "treaty of picquigny"
    },
    {
        " , he acted as Edwards witness when the king instructed his delegates to the French court, and received some very fine presents from Louis on a visit to the French king at ": null
    },
    {
        "Amiens": "amiens"
    },
    {
        ". In refusing other gifts, which included pensions in the guise of tribute, he was joined only by ": null
    },
    {
        "Cardinal Bourchier": "cardinal bourchier"
    },
    {
        ". He supposedly disapproved of Edwards policy of personally benefitting—politically and financially—from a campaign paid for out of a parliamentary grant, and hence out of public funds. Any military prowess was therefore not to be revealed further until the last years of Edwards reign.       Richard controlled the north of England until Edward IVs death. There, and especially in the city of ": null
    },
    {
        "York": "york"
    },
    {
        ", he was highly regarded; although it has been questioned whether this view was reciprocated by Richard. Edward IV set up the ": null
    },
    {
        "Council of the North": "council of the north"
    },
    {
        " as an administrative body in 42 to improve government control and economic prosperity and benefit the whole of Northern England. Kendall and later historians have suggested that this was with the intention of making Richard the Lord of the North; Peter Booth, however, has argued that instead of allowing his brother the Duke of Gloucester carte blanche, restricted his influence by using his own agent, Sir William Parr.  Richard served as its first Lord President from 42 until his accession to the throne. On his accession, he made his nephew ": null
    },
    {
        "John de la Pole, 42st Earl of Lincoln": "john de la pole, 1st earl of lincoln"
    },
    {
        ", president and formally institutionalised it as an offshoot of the royal Council; all its letters and judgements were issued on behalf of the king and in his name. The council had a budget of 42 ": null
    },
    {
        "marks": "mark england and scotland"
    },
    {
        " per annum  and had issued Regulations by July of that year: councillors to act impartially and declare vested interests, and to meet at least every three months. Its main focus of operations was Yorkshire and the north-east, and its primary responsibilities were land disputes, keeping of the kings peace, and punishing lawbreakers.       Richards increasing role in the north from the mid42s to some extent explains his withdrawal from the royal court. He had been ": null
    },
    {
        "Warden of the West March": "lord warden of the marcheswarden of the western march"
    },
    {
        " on the Scottish border since 42 September 42 and again from May 42; he used Penrith as a base while taking effectual measures against the Scots, and enjoyed the revenues of the estates of the Forest of Cumberland while doing so. It was at the same time that the duke was appointed sheriff of Cumberland five consecutive years, being described as of Penrith Castle in 42 By 42 war with Scotland was looming; on 42 May that year he was appointed Lieutenant-General of the North as fears of a Scottish invasion grew. ": null
    },
    {
        "Louis XI": "louis xi"
    },
    {
        " of France had attempted to negotiate a military alliance with Scotland , with the aim of attacking England, according to a contemporary French chronicler. Richard had the authority to summon the Border Levies and issue Commissions of Array to repel the Border raids. Together with the Earl of Northumberland, he launched counter-raids, and when the king and council formally declared war in November 42 he was granted £42 for wages. The king failed to arrive to lead the English army and the result was intermittent skirmishing until early 42 Richard witnessed the treaty with ": null
    },
    {
        "Alexander, Duke of Albany": "alexander stewart, duke of albany"
    },
    {
        ", brother of the Scottish king ": null
    },
    {
        "James III": "james iii of scotland"
    },
    {
        ". Northumberland, Stanley, Dorset, Sir Edward Woodville, and Richard with approximately 42 men took the town of Berwick almost immediately. The castle held until 42 August 42 when Richard ": null
    },
    {
        "recaptured Berwick-upon-Tweed": "capture of berwick"
    },
    {
        " from the ": null
    },
    {
        "Kingdom of Scotland": "kingdom of scotland"
    },
    {
        ". Although it is debatable whether the English victory was due more to internal Scottish divisions rather than any outstanding military prowess by Richard, it was the last time that the ": null
    },
    {
        "Royal Burgh": "royal burgh"
    },
    {
        " of Berwick changed hands between the two realms.                 On the death of Edward IV on 42 April 42 his 42-year-old son, ": null
    },
    {
        "Edward V": "edward v"
    },
    {
        ", succeeded him. Richard was named Lord Protector of the Realm and at ": null
    },
    {
        "William Hastings": "william hastings, 1st baron hastings"
    },
    {
        " urging, Richard assumed his role and left his base in Yorkshire for London. On 42 April, as previously agreed, Richard and his cousin, the Duke of Buckingham, met Queen Elizabeths brother, ": null
    },
    {
        "Anthony Woodville, 42nd Earl Rivers": "anthony woodville, 2nd earl rivers"
    },
    {
        ", at ": null
    },
    {
        "Northampton": "northampton"
    },
    {
        ". At the queens request, Earl Rivers was escorting the young king to London with an armed escort of 42 men, while Richard and Buckinghams joint escort was 42 men.     The young king himself had been sent further south to ": null
    },
    {
        "Stony Stratford": "stony stratford"
    },
    {
        ". At first convivial, Richard had Earl Rivers, his nephew ": null
    },
    {
        "Richard Grey": "richard grey"
    },
    {
        " and his associate, ": null
    },
    {
        "Thomas Vaughan": "thomas vaughan"
    },
    {
        ", arrested. They were taken to Pontefract Castle, where they were executed on 42 June on the charge of treason against the Lord Protector after appearing before a tribunal led by ": null
    },
    {
        "Henry Percy, 42th Earl of Northumberland": "henry percy, 4th earl of northumberland"
    },
    {
        ". Earl Rivers had appointed Richard as executor of his will.     After having Earl Rivers arrested, Richard and Buckingham moved to Stony Stratford, where Richard informed the young king of a plot aimed at denying him his role as protector and whose perpetrators had been dealt with. He proceeded to escort the king to London. They entered the city on 42 May, displaying the carriages of weapons Earl Rivers had taken with his 42-man army. Richard first accommodated Edward in the Bishops apartments; then, on Buckinghams suggestion, the king was moved to the royal apartments of the ": null
    },
    {
        "Tower of London": "tower of london"
    },
    {
        ", where kings customarily awaited their coronation.     On hearing the news of her brothers 42 April arrest, the dowager queen fled to sanctuary in Westminster Abbey. Joining her were her son by her first marriage, ": null
    },
    {
        "Thomas Grey, 42st Marquess of Dorset": "thomas grey, 1st marquess of dorset"
    },
    {
        "; her five daughters; and her youngest son, ": null
    },
    {
        "Richard, Duke of York": "richard of shrewsbury, 1st duke of york"
    },
    {
        ".     On 42/42 June, Richard wrote to Ralph, Lord Neville, the City of York and others asking for their support against the Queen, her blood adherents and affinity, whom he suspected of plotting his murder. At a council meeting on 42 June at the Tower of London, Richard accused Hastings and others of having conspired against him with the Woodvilles and accusing ": null
    },
    {
        "Jane Shore": "jane shore"
    },
    {
        ", lover to both Hastings and Thomas Grey, of acting as a go-between. According to Thomas More, Hastings was taken out of the council chambers and summarily executed in the courtyard, while others, like Lord Thomas Stanley and ": null
    },
    {
        "John Morton, Bishop of Ely": "john morton"
    },
    {
        ", were arrested. Hastings was not attainted and Richard sealed an indenture that placed Hastings widow, ": null
    },
    {
        "Katherine": "katherine neville, baroness hastings"
    },
    {
        ", directly under his own protection. Bishop Morton was released into the custody of Buckingham.     On 42 June, the dowager queen agreed to hand over the Duke of York to the Archbishop of Canterbury so that he might attend his brother Edwards coronation, still planned for 42 June.     A clergyman is said to have informed Richard that Edward IVs marriage to Elizabeth Woodville was invalid because of Edwards earlier union with ": null
    },
    {
        "Eleanor Butler": "lady eleanor talbot"
    },
    {
        ", making Edward V and his siblings illegitimate. The identity of the informant, known only through the memoirs of French diplomat ": null
    },
    {
        "Philippe de Commines": "philippe de commines"
    },
    {
        ", was ": null
    },
    {
        "Robert Stillington": "robert stillington"
    },
    {
        ", the ": null
    },
    {
        "Bishop of Bath and Wells": "bishop of bath and wells"
    },
    {
        ". On 42 June, a sermon was preached outside ": null
    },
    {
        "Old St. Pauls Cathedral": "old st. pauls cathedral"
    },
    {
        " declaring Edward IVs children bastards and Richard the rightful king. Shortly after, the citizens of London, both nobles and commons, convened and drew up a petition asking Richard to assume the throne. He accepted on 42 June and was crowned at ": null
    },
    {
        "Westminster Abbey": "westminster abbey"
    },
    {
        " on 42 July. His title to the throne was confirmed by Parliament in January 42 by the document  Titulus Regius .     The ": null
    },
    {
        "princes": "princes in the tower"
    },
    {
        ", who were still lodged in the royal residence of the Tower of London at the time of Richards coronation, disappeared from sight after the summer of 42 Although after his death Richard III was accused of having Edward and his brother killed, notably by More and in Shakespeares play, the facts surrounding their disappearance remain unknown. Other culprits have been suggested, including Buckingham and even Henry VII, although Richard remains a suspect.     After the coronation ceremony, Richard and Anne set out on a royal progress to meet their subjects. During this journey through the country, the king and queen endowed ": null
    },
    {
        "Kings College": "kings college, cambridge"
    },
    {
        " and ": null
    },
    {
        "Queens College": "queens college, cambridge"
    },
    {
        " at ": null
    },
    {
        "Cambridge University": "cambridge university"
    },
    {
        ", and made grants to the church. Still feeling a strong bond with his northern estates, Richard later planned the establishment of a large chantry chapel in York Minster with over 42 priests. Richard also founded the ": null
    },
    {
        "College of Arms": "college of arms"
    },
    {
        ".             In 42 a ": null
    },
    {
        "conspiracy": "conspiracy"
    },
    {
        " arose among a number of disaffected gentry, many of whom had been supporters of Edward IV and the whole Yorkist establishment . The conspiracy was nominally led by Richards former ally and first cousin once removed ": null
    },
    {
        "Henry Stafford, 42nd Duke of Buckingham": "henry stafford, 2nd duke of buckingham"
    },
    {
        ", although it had begun as a Woodville-Beaufort conspiracy . Indeed, Davies has suggested that it was only the subsequent parliamentary attainder that placed Buckingham at the centre of events , in order to blame a single disaffected magnate motivated by greed, rather than the embarrassing truth that those opposing Richard were actually overwhelmingly Edwardian loyalists . It is possible that they planned to depose Richard III and place Edward V back on the throne, and that when rumours arose that Edward and his brother were dead, Buckingham proposed that ": null
    },
    {
        "Henry Tudor": "henry vii of england"
    },
    {
        " should return from exile, take the throne and marry ": null
    },
    {
        "Elizabeth of York": "elizabeth of york"
    },
    {
        ", elder sister of the Tower Princes. However, it has also been pointed out that as this narrative stems from Richards own parliament of 42 it should probably be treated with caution . For his part, Buckingham raised a substantial force from his estates in ": null
    },
    {
        "Wales": "wales"
    },
    {
        " and the Marches. Henry, in exile in ": null
    },
    {
        "Brittany": "duchy of brittany"
    },
    {
        ", enjoyed the support of the Breton treasurer ": null
    },
    {
        "Pierre Landais": "pierre landais"
    },
    {
        ", who hoped Buckinghams victory would cement an alliance between Brittany and England.     Some of Henry Tudors ships ran into a storm and were forced to return to Brittany or Normandy, while Henry himself anchored off Plymouth for a week before learning of Buckinghams failure. Buckinghams army was troubled by the same storm and deserted when Richards forces came against them. Buckingham tried to escape in disguise, but was either turned in by a ": null
    },
    {
        "retainer": "retainer"
    },
    {
        " for the ": null
    },
    {
        "bounty": "bounty"
    },
    {
        " Richard had put on his head, or was discovered in hiding with him. He was convicted of ": null
    },
    {
        "treason": "treason"
    },
    {
        " and ": null
    },
    {
        "beheaded": "decapitation"
    },
    {
        " in ": null
    },
    {
        "Salisbury": "salisbury"
    },
    {
        ", near the Bulls Head Inn, on 42 November. His widow, ": null
    },
    {
        "Catherine Woodville": "catherine woodville, duchess of buckingham and bedford"
    },
    {
        ", later married ": null
    },
    {
        "Jasper Tudor": "jasper tudor, 1st duke of bedford"
    },
    {
        ", the uncle of Henry Tudor,  who was in the process of organising another rebellion.     Richard made overtures to Landais, offering military support for Landaiss weak regime under Duke ": null
    },
    {
        "Francis II": "francis ii, duke of brittany"
    },
    {
        " of Brittany in exchange for Henry. Henry fled to Paris, where he secured support from the French regent ": null
    },
    {
        "Anne of Beaujeu": "anne of beaujeu"
    },
    {
        ", who supplied troops for an invasion in 42 The French government, recalling Richards effective disowning of the ": null
    },
    {
        "Treaty of Picquigny": "treaty of picquigny"
    },
    {
        " and refusal to accept the accompanying French pension, would not have welcomed the accession of one known to be unfriendly to France.                 On 42 August 42 Richard met the outnumbered forces of Henry Tudor at the ": null
    },
    {
        "Battle of Bosworth Field": "battle of bosworth field"
    },
    {
        ". Richard rode a white ": null
    },
    {
        "courser": "courser"
    },
    {
        ". The size of Richards army has been estimated at 42 and Henrys at 42, but exact numbers are not known. All that can be said is that the Royal army substantially outnumbered Tudors. The traditional view of the kings famous cries of Treason!  before falling was that during the battle Richard was abandoned by ": null
    },
    {
        "Lord Stanley": "thomas stanley, 1st earl of derby"
    },
    {
        " , ": null
    },
    {
        "Sir William Stanley": "william stanley"
    },
    {
        ", and Henry Percy, 42th Earl of Northumberland. However, the role of Northumberland is unclear; his position was with the reserve—behind the kings line—and he could not easily have moved forward without a general royal advance, which did not take place. Indeed, the physical confines behind the crest of Ambion Hill, combined with a difficulty of communications, probably physically hampered any attempt he made to join the fray. Despite appearing a pillar of the Ricardian regime , and his previous loyalty to Edward IV,  Lord Stanleys wife, ": null
    },
    {
        "Lady Margaret Beaufort": "lady margaret beaufort"
    },
    {
        ", was Henry Tudors mother, and Stanleys inaction, combined with his brothers entering the battle on Tudors behalf was fundamental to Richards defeat. The death of ": null
    },
    {
        "John Howard, Duke of Norfolk": "john howard, duke of norfolk"
    },
    {
        ", his close companion, may have had a demoralising effect on Richard and his men. Either way, Richard led a cavalry charge deep into the enemy ranks in an attempt to end the battle quickly by striking at Henry Tudor himself.          Accounts note that King Richard fought bravely and ably during this manoeuvre, unhorsing ": null
    },
    {
        "Sir John Cheyne": "john cheyne, baron cheyne"
    },
    {
        ", a well-known ": null
    },
    {
        "joust": "joust"
    },
    {
        "ing champion, killing Henrys ": null
    },
    {
        "standard bearer": "standard-bearer"
    },
    {
        " Sir William Brandon": "william brandon"
    },
    {
        " and coming within a swords length of Henry Tudor before being surrounded by Sir William Stanleys men and killed. The Burgundian chronicler ": null
    },
    {
        "Jean Molinet": "jean molinet"
    },
    {
        " says that a Welshman struck the death-blow with a ": null
    },
    {
        "halberd": "halberd"
    },
    {
        " while Richards horse was stuck in the marshy ground. It was said that the blows were so violent that the kings helmet was driven into his skull. The contemporary Welsh poet ": null
    },
    {
        "Gutor Glyn": "gutor glyn"
    },
    {
        " implies a leading Welsh Lancastrian ": null
    },
    {
        "Rhys ap Thomas": "rhys ap thomas"
    },
    {
        ", or one of his men, killed the king, writing that he killed the boar, shaved his head .  The identification in 42 of King Richards body shows that the skeleton had 42 wounds, eight of them to the skull, clearly inflicted in battle and suggesting he had lost his helmet.  Professor Guy Rutty, from the University of Leicester, said: The most likely injuries to have caused the kings death are the two to the inferior aspect of the skull—a large sharp force trauma possibly from a sword or staff weapon, such as a halberd or bill, and a penetrating injury from the tip of an edged weapon.  The skull showed that a blade had hacked away part of the rear of the skull. Richard III was the last English king to be killed in battle.      ": null
    },
    {
        "Polydore Vergil": "polydore vergil"
    },
    {
        ", Henry Tudors official historian, recorded that King Richard, alone, was killed fighting manfully in the thickest press of his enemies . Richards naked body was then carried back to Leicester tied to a horse, and early sources strongly suggest that it was displayed in the collegiate ": null
    },
    {
        "Church of the Annunciation of Our Lady of the Newarke": "church of the annunciation of our lady of the newarke"
    },
    {
        ", prior to being buried at ": null
    },
    {
        "Greyfriars Church": "greyfriars, leicester"
    },
    {
        " in ": null
    },
    {
        "Leicester": "leicester"
    },
    {
        ". In 42 Henry VII paid  for a marble and alabaster monument. According to a discredited tradition, during the ": null
    },
    {
        "Dissolution of the Monasteries": "dissolution of the monasteries"
    },
    {
        ", his body was thrown into the ": null
    },
    {
        "River Soar": "river soar"
    },
    {
        ",  although other evidence suggests that a memorial stone was visible in 42 in a garden built on the site of Greyfriars. The exact location was then lost, owing to more than 42 years of subsequent development, until archaeological investigations in 42  revealed the site of the garden and Greyfriars church. There was a memorial ledger stone in the choir of the cathedral, since replaced by the tomb of the king, and a stone plaque on Bow Bridge where tradition had falsely suggested that his remains had been thrown into the river.     According to another tradition, Richard consulted a ": null
    },
    {
        "seer": "wikt:seer"
    },
    {
        " in Leicester before the battle who foretold that where your spur should strike on the ride into battle, your head shall be broken on the return . On the ride into battle, his ": null
    },
    {
        "spur": "spur"
    },
    {
        " struck the bridge stone of Bow Bridge in the city; legend states that as his corpse was carried from the battle over the back of a horse, his head struck the same stone and was broken open.      Henry Tudor succeeded Richard to become Henry VII and sought to cement the succession by marrying the Yorkist heiress Elizabeth of York, Edward IVs daughter and Richard IIIs niece.       Richard and Anne produced one son, ": null
    },
    {
        "Edward": "edward of middleham"
    },
    {
        ", who was born between 42 and 42  He was created ": null
    },
    {
        "Earl of Salisbury": "earl of salisbury"
    },
    {
        " on 42 February 42 and ": null
    },
    {
        "Prince of Wales": "prince of wales"
    },
    {
        " on 42 August 42 and died in March 42 less than two months after he had been formally declared ": null
    },
    {
        "heir apparent": "heir apparent"
    },
    {
        ".  After his sons death, he named his nephew ": null
    },
    {
        "Edward, Earl of Warwick": "edward, earl of warwick"
    },
    {
        " as his heir. After his wifes death, he named his nephew ": null
    },
    {
        "John de la Pole, Earl of Lincoln": "john de la pole, earl of lincoln"
    },
    {
        ", the son of his sister ": null
    },
    {
        "Elizabeth": "elizabeth of york, duchess of suffolk"
    },
    {
        " as his successor, and commenced negotiations with ": null
    },
    {
        "John II of Portugal": "john ii of portugal"
    },
    {
        " to marry Johns sister, ": null
    },
    {
        "Joanna": "joan, princess of portugal"
    },
    {
        ", a pious young woman who had already turned down several suitors because of her preference for the religious life.     Richard had two acknowledged illegitimate children, ": null
    },
    {
        "John of Gloucester": "john of gloucester"
    },
    {
        " and Katherine Plantagenet. Also known as John of Pontefract, John of Gloucester was appointed Captain of Calais in 42 Katherine married ": null
    },
    {
        "William Herbert, 42nd Earl of Pembroke": "william herbert, 2nd earl of pembroke"
    },
    {
        " in 42 Neither the birth dates nor the names of the mothers of either of the children is known. Katherine was old enough to be wedded in 42 when the age of consent was twelve, and John was knighted in September 42 in ": null
    },
    {
        "York Minster": "york minster"
    },
    {
        ", and so most historians agree that they were both fathered when Richard was a teenager. There is no evidence of infidelity on Richards part after his marriage to Anne Neville in 42 when he was around 42 This has led to a suggestion by the historian ": null
    },
    {
        "A. L. Rowse": "a. l. rowse"
    },
    {
        " that Richard had no interest in sex .     Michael Hicks and Josephine Wilkinson have suggested that Katherines mother may have been ": null
    },
    {
        "Katherine Haute": "katherine haute"
    },
    {
        ", on the basis of the grant of an annual payment of 42 shillings made to her in 42 The Haute family was related to the Woodvilles through the marriage of Elizabeth Woodvilles aunt, Joan Woodville, to ": null
    },
    {
        "William Haute": "william haute"
    },
    {
        ". One of their children was Richard Haute, Controller of the Princes Household. Their daughter, Alice, married ": null
    },
    {
        "Sir John Fogge": "sir john fogge"
    },
    {
        "; they were ancestors to queen consort ": null
    },
    {
        "Catherine Parr": "catherine parr"
    },
    {
        ", sixth wife of King ": null
    },
    {
        "Henry VIII": "henry viii of england"
    },
    {
        ". They also suggest that Johns mother may have been Alice Burgh. Richard visited Pontefract from 42 in April and October 42 and in early March 42 for a week. On 42 March 42 he granted Alice Burgh £42 a year for life for certain special causes and considerations . She later received another allowance, apparently for being engaged as a nurse for Clarences son, Edward of Warwick. Richard continued her annuity when he became king. John Ashdown-Hill has suggested that John was conceived during Richards first solo expedition to the eastern counties in the summer of 42 at the invitation of John Howard and that the boy was born in 42 and named after his friend and supporter. Richard himself noted John was still a minor when he issued the royal patent appointing him Captain of Calais on 42 March 42 possibly on his seventeenth birthday.     Both of Richards illegitimate children survived him, but they seem to have died without issue and their fate after Richards demise at Bosworth is not certain. John received a £42 ": null
    },
    {
        "annuity": "life annuity"
    },
    {
        " from Henry VII, but there are no mentions of him in contemporary records after 42 . He may have been executed in 42 though no record of this exists beyond an assertion by ": null
    },
    {
        "George Buck": "george buck"
    },
    {
        " over a century later. Katherine apparently died before her cousin Elizabeth of Yorks coronation on 42 November 42 since her husband Sir William Herbert is described as a widower by that time. Katherines burial place was located in the London parish church of St James Garlickhithe, between Skinners Lane and Upper Thames Street. The mysterious ": null
    },
    {
        "Richard Plantagenet": "richard plantagenet"
    },
    {
        ", who was first mentioned in ": null
    },
    {
        "Francis Peck": "francis peck"
    },
    {
        "s  Desiderata Curiosa  was said to be a possible illegitimate child of Richard III and is sometimes referred to as Richard the Master-Builder or Richard of Eastwell , but it has also been suggested he could have been Richard, Duke of York, one of the missing Princes in the Tower. He died in 42       Richards Council of the North, described as his one major institutional innovation , derived from his ducal council following his own viceregal appointment by Edward IV; when Richard himself became king, he maintained the same conciliar structure in his absence. It officially became part of the royal council machinery under the presidency of John de la Pole, Earl of Lincoln in April 42 based at ": null
    },
    {
        "Sandal Castle": "sandal castle"
    },
    {
        " in ": null
    },
    {
        "Wakefield": "wakefield"
    },
    {
        ". It is considered to have greatly improved conditions for northern England, as it was, in theory at least, intended to keep the peace and punish lawbreakers, as well as resolving land disputes. Bringing regional governance directly under the control of central government, it has been described as the kings most enduring monument , surviving unchanged until 42     In December 42 Richard instituted what later became known as the ": null
    },
    {
        "Court of Requests": "court of requests"
    },
    {
        ", a court to which poor people who could not afford legal representation could apply for their grievances to be heard. He also improved bail in January 42 to protect suspected felons from imprisonment before trial and to protect their property from seizure during that time.  He founded the ": null
    },
    {
        "College of Arms": "college of arms"
    },
    {
        " in 42 he banned restrictions on the printing and sale of books,  and he ordered the translation of the written Laws and Statutes from the traditional French into English. He ended the arbitrary benevolences , made it punishable to conceal from a buyer of land that a part of the property had already been disposed of to somebody else, required that land sales be published, laid down property qualifications for jurors, restricted the abusive ": null
    },
    {
        "Courts of Piepowders": "court of piepowders"
    },
    {
        ", regulated cloth sales, instituted certain forms of trade protectionism, prohibited the sale of wine and oil in fraudulent measure, and prohibited fraudulent collection of clergy dues, among others. Churchill implies he improved the law of trusts.     Richards death at Bosworth resulted in the end of the ": null
    },
    {
        "Plantagenet": "plantagenet"
    },
    {
        " dynasty, which had ruled England since the succession of ": null
    },
    {
        "Henry II": "henry ii of england"
    },
    {
        " in 42  The last legitimate male Plantagenet, Richards nephew, ": null
    },
    {
        "Edward, Earl of Warwick": "edward plantagenet, 17th earl of warwick"
    },
    {
        " , was executed by Henry VII in 42 The only extant direct male line of Plantagenets is the House of Beaufort, headed today by ": null
    },
    {
        "Henry Somerset, 42th Duke of Beaufort": "henry somerset, 12th duke of beaufort"
    },
    {
        ", but the Beaufort line was barred from the succession by ": null
    },
    {
        "Henry IV": "henry iv, king of england"
    },
    {
        ".            There are numerous contemporary, or near-contemporary, sources of information about the reign of Richard III.  These include the Croyland Chronicle, Commines Mémoires, the report of ": null
    },
    {
        "Dominic Mancini": "dominic mancini"
    },
    {
        ", the Paston Letters, the Chronicles of ": null
    },
    {
        "Robert Fabyan": "robert fabyan"
    },
    {
        " and numerous court and official records, including a few letters by Richard himself. However, the debate about Richards true character and motives continues, both because of the subjectivity of many of the written sources, reflecting the generally partisan nature of writers of this period, and because of the fact that none was written by men with an intimate knowledge of Richard, even if they had met him in person.     During Richards reign, the historian ": null
    },
    {
        "John Rous": "john rous"
    },
    {
        " praised him as a good lord who punished oppressors of the commons , adding that he had a great heart . John Rous in .  In 42 the Italian observer Mancini reported that Richard enjoyed a good reputation and that both his private life and public activities powerfully attracted the esteem of strangers . His bond to the City of York, in particular, was such that on hearing of Richards demise at the battle of Bosworth the City Council officially deplored the Kings death, at the risk of facing the victors wrath.     During his lifetime he was the subject of some attacks. Even in the North in 42 a man was prosecuted for offences against the Duke of Gloucester, saying he did nothing but grin at the city of York. In 42 the discreditory actions took the form of hostile placards, the only surviving one being ": null
    },
    {
        "William Collingbourne": "william collingbourne"
    },
    {
        "s lampoon of July 42 The Cat, the Rat, and Lovell the Dog, all rule England under a Hog which was pinned to the door of ": null
    },
    {
        "St. Pauls Cathedral": "st. pauls cathedral"
    },
    {
        " and referred to the King himself and his most trusted councillors ": null
    },
    {
        "William Catesby": "william catesby"
    },
    {
        ", ": null
    },
    {
        "Richard Ratcliffe": "richard ratcliffe"
    },
    {
        " and ": null
    },
    {
        "Francis Viscount Lovell": "francis lovell, 1st viscount lovell"
    },
    {
        ". On 42 March 42 Richard felt forced to summon the Lords and London City Councillors to publicly deny the rumours that he had poisoned Queen Anne and that he had planned a marriage to his niece Elizabeth, at the same time ordering the Sheriff of London to imprison anyone spreading such slanders. The same orders were issued throughout the realm, including York where the royal pronouncement recorded in the City Records dates 42 April 42 and carries specific instructions to suppress seditious talk and remove and destroy evidently hostile placards unread.     As for Richards physical appearance, most contemporary descriptions bear out the evidence that aside from having one shoulder higher than the other , Richard had no other noticeable bodily deformity. ": null
    },
    {
        "John Stow": "john stow"
    },
    {
        " talked to old men who, remembering him, said that he was of bodily shape comely enough, only of low stature  and a German traveller, Nicolas von Poppelau, who spent ten days in Richards household in May 42 describes him as three fingers taller than himself...much more lean, with delicate arms and legs and also a great heart.  Six years after Richards death, in 42 a schoolmaster named William Burton, on hearing a defence of Richard, launched into a diatribe, accusing the dead King of being a hypocrite and a crookback...who was deservedly buried in a ditch like a dog.     Richards death encouraged the furtherance of this later negative image by his Tudor successors due to the fact that it helped to legitimise Henry VIIs seizure of the throne. The Richard III Society contends that this means that a lot of what people thought they knew about Richard III was pretty much propaganda and myth building.  The Tudor characterisation culminated in the famous fictional portrayal of him in Shakespeares play  Richard III  as a physically deformed, Machiavellian villain, ruthlessly committing numerous murders in order to claw his way to power; Shakespeares intention perhaps being to use Richard III as a vehicle for creating his own ": null
    },
    {
        "Marlowesque": "christopher marlowe"
    },
    {
        " protagonist. Rous himself, in his History of the Kings of England, written during Henry VIIs reign, initiated the process. He reversed his earlier position, and now portrayed Richard as a freakish individual who was born with teeth and shoulder-length hair after having been in his mothers womb for two years. His body was stunted and distorted, with one shoulder higher than the other, and he was slight in body and weak in strength . Rous also attributes the murder of Henry VI to Richard, and claims that he poisoned his own wife.  Jeremy Potter, a former Chair of the Richard III Society, claims that At the bar of history Richard III continues to be guilty because it is impossible to prove him innocent. The Tudors ride high in popular esteem.      Polydore Vergil and ": null
    },
    {
        "Thomas More": "thomas more"
    },
    {
        " expanded on this portrayal, emphasising Richards outward physical deformities as a sign of his inwardly twisted mind. More describes him as little of stature, ill-featured of limbs, crook-backed  ... hard-favoured of visage . Vergil also says he was deformed of body  ... one shoulder higher than the right . Both emphasise that Richard was devious and flattering, while planning the downfall of both his enemies and supposed friends. Richards good qualities were his cleverness and bravery. All these characteristics are repeated by Shakespeare, who portrays him as having a hunch, a limp and a withered arm. With regard to the hunch , the ": null
    },
    {
        "second quarto": "list of shakespeare plays in quarto"
    },
    {
        " edition of Richard III used the term hunched-backed but in the ": null
    },
    {
        "First Folio": "first folio"
    },
    {
        " edition it became bunch-backed .     Richards reputation as a promoter of legal fairness persisted, however. ": null
    },
    {
        "William Camden": "william camden"
    },
    {
        " in his Remains Concerning Britain states that Richard, albeit he lived wickedly, yet made good laws . ": null
    },
    {
        "Francis Bacon": "francis bacon"
    },
    {
        " also states that he was a good lawmaker for the ease and solace of the common people . In 42 Cardinal Wolsey upbraided the aldermen and Mayor of London for relying on a statute of Richard to avoid paying an extorted tax but received the reply although he did evil, yet in his time were many good acts made.     Despite this, the image of Richard as a ruthless power-grabber remained dominant in the 42th and 42th centuries. The 42th century ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        " and ": null
    },
    {
        "historian": "historian"
    },
    {
        " David Hume": "david hume"
    },
    {
        " described him as a man who used dissimulation to conceal his fierce and savage nature and who had abandoned all principles of honour and humanity . Hume acknowledged that some historians have argued that he was well qualified for government, had he legally obtained it; and that he committed no crimes but such as were necessary to procure him possession of the crown , but he dismissed this view on the grounds that Richards exercise of arbitrary power encouraged instability. The most important late 42th-century biographer of the king was ": null
    },
    {
        "James Gairdner": "james gairdner"
    },
    {
        ", who also wrote the entry on Richard in the  Dictionary of National Biography . Gairdner stated that he had begun to study Richard with a neutral viewpoint, but became convinced that Shakespeare and More were essentially correct in their view of the king, despite some exaggerations.     Richard was not without his defenders, the first of whom was George Buck, a descendant of one of the kings supporters, who completed a historical account of Richards life in 42 Buck attacked the improbable imputations and strange and spiteful scandals related by Tudor writers, including Richards alleged deformities and murders. He located lost archival material, including the Titulus Regius, but also claimed to have seen a letter written by Elizabeth of York, according to which Elizabeth sought to marry the king.  Though the book was published in 42 Elizabeths supposed letter was never produced. Documents which later emerged from the Portuguese Royal archives show that after Queen Annes death, Richards ambassadors were sent on a formal errand to negotiate a double marriage between Richard and the Portuguese Kings sister ": null
    },
    {
        "Joana": "joanna, princess of portugal"
    },
    {
        ", of Lancastrian descent, and between Elizabeth of York and Joanas cousin Duke ": null
    },
    {
        "Manuel": "manuel i of portugal"
    },
    {
        " .     Significant among Richards defenders was ": null
    },
    {
        "Horace Walpole": "horace walpole"
    },
    {
        ". In Historic Doubts on the Life and Reign of King Richard the Third , Walpole disputed all the alleged murders and argued that Richard may have acted in good faith. He also argued that any physical abnormality was probably no more than a minor distortion of the shoulders. However, he retracted his views in 42 after ": null
    },
    {
        "the Terror": "the terror"
    },
    {
        ", stating he now believed that Richard could have committed the crimes he was charged with, although Pollard observes that this retraction is frequently overlooked by later admirers of Richard. Other defenders of Richard include the noted explorer ": null
    },
    {
        "Clements Markham": "clements markham"
    },
    {
        ", whose Richard III: His Life and Character replied to the work of Gairdner. He argued that Henry VII killed the princes and that the bulk of evidence against Richard was nothing more than Tudor propaganda. An intermediate view was provided by Alfred Legge in The Unpopular King . Legge argued that Richards greatness of soul was eventually warped and dwarfed by the ingratitude of others.     Some twentieth-century historians have been less inclined to moral judgement, seeing Richards actions as a product of the unstable times. In the words of ": null
    },
    {
        "Charles Ross": "charles ross"
    },
    {
        ", the later fifteenth century in England is now seen as a ruthless and violent age as concerns the upper ranks of society, full of private feuds, intimidation, land-hunger, and litigiousness, and consideration of Richards life and career against this background has tended to remove him from the lonely pinnacle of Villainy Incarnate on which Shakespeare had placed him. Like most men, he was conditioned by the standards of his age.  The ": null
    },
    {
        "Richard III Society": "richard iii society"
    },
    {
        ", founded in 42 as The Fellowship of the White Boar , is the oldest of several groups dedicated to improving his reputation. Other contemporary historians still describe him as, a power-hungry and ruthless politician who was still most probably ultimately responsible for the murder of his nephews.                   Apart from Shakespeare, Richard appears in many other works of literature. Two other plays of the Elizabethan era predated Shakespeares work. The Latin-language drama  Richardus Tertius  by ": null
    },
    {
        "Thomas Legge": "thomas legge"
    },
    {
        " is believed to be the first history play written in England. The anonymous play  The True Tragedy of Richard III  , performed in the same decade as Shakespeares work, was probably an influence on Shakespeare. Neither of the two plays places any emphasis on Richards physical appearance, though the True Tragedy briefly mentions that he is A man ill shaped, crooked backed, lame armed adding that he is valiantly minded, but tyrannous in authority . Both portray him as a man motivated by personal ambition, who uses everyone around him to get his way. ": null
    },
    {
        "Ben Jonson": "ben jonson"
    },
    {
        " is also known to have written a play Richard Crookback in 42 but it was never published and nothing is known about its portrayal of the king.     ": null
    },
    {
        "Marjorie Bowen": "marjorie bowen"
    },
    {
        "s 42 novel  Dickon  set the trend for pro-Ricardian literature. Particularly influential was  The Daughter of Time  by ": null
    },
    {
        "Josephine Tey": "josephine tey"
    },
    {
        ", in which a modern detective concludes that Richard III is innocent in the death of the Princes.   Other novelists such as ": null
    },
    {
        "Valerie Anand": "valerie anand"
    },
    {
        " in the novel Crown of Roses have also offered alternative versions to the theory that he murdered them.  ": null
    },
    {
        "Sharon Kay Penman": "sharon kay penman"
    },
    {
        ", in her ": null
    },
    {
        "historical novel": "historical fiction"
    },
    {
        "  The Sunne in Splendour , attributes the death of the Princes to the Duke of Buckingham.  In the mystery novel The Murders of Richard III by ": null
    },
    {
        "Elizabeth Peters": "elizabeth peters"
    },
    {
        " the central plot revolves around the debate as to whether Richard III was guilty of these and other crimes. A sympathetic portrayal of Richard III is given in The Founding , the first volume in  The Morland Dynasty  series by ": null
    },
    {
        "Cynthia Harrod-Eagles": "cynthia harrod-eagles"
    },
    {
        ".     One film adaptation of Shakespeares play Richard III is the ": null
    },
    {
        "42 version": "richard iii"
    },
    {
        " directed and produced by ": null
    },
    {
        "Laurence Olivier": "laurence olivier"
    },
    {
        ", who also played the lead role.   Also notable are the ": null
    },
    {
        "42 film version": "richard iii"
    },
    {
        " starring ": null
    },
    {
        "Ian McKellen": "ian mckellen"
    },
    {
        ", set in a fictional 42s fascist England,   and  Looking for Richard , a 42 documentary film directed by ": null
    },
    {
        "Al Pacino": "al pacino"
    },
    {
        ", who plays the title character as well as himself.   The play has been adapted for television on several occasions.                 On 42 August 42 the ": null
    },
    {
        "University of Leicester": "university of leicester"
    },
    {
        " and ": null
    },
    {
        "Leicester City Council": "leicester city council"
    },
    {
        ", in association with the ": null
    },
    {
        "Richard III Society": "richard iii societyrichard iii society"
    },
    {
        ", announced that they had joined forces to begin a search for the remains of King Richard. The search for Richard III was led by ": null
    },
    {
        "Philippa Langley": "philippa langley"
    },
    {
        " of the Societys Looking For Richard Project with the archaeological work led by ": null
    },
    {
        "University of Leicester Archaeological Services ": "university of leicestercollege of arts, humanities  &  law"
    },
    {
        ".    Experts set out to locate the lost site of the former Greyfriars Church , and to discover whether his remains were still interred there.   By comparing fixed points between maps in a historical sequence, the search located the Church of the Grey Friars, where Richards body had been hastily buried without pomp in 42 its foundations identifiable beneath a modern-day city centre car park.           On 42 September 42 the excavators announced that they had identified Greyfriars church and two days later that they had identified the location of Robert Herricks garden, where the memorial to Richard III stood in the early 42th century.  A human skeleton was found beneath the Churchs ": null
    },
    {
        "choir": "choir"
    },
    {
        ".      Improbably, the excavators found the remains in the first location in which they dug at the car park. Coincidentally, they lay almost directly under a roughly painted R on the tarmac. This had existed since the early 42s to signify a reserved parking space.             On 42 September, it was announced that the skeleton discovered during the search might be that of Richard III. Several reasons were given: the body was of an adult male; it was buried beneath the choir of the church; and there was severe scoliosis of the spine, possibly making one shoulder  higher than the other . Additionally, there was an object that appeared to be an arrowhead embedded in the spine; and there were ": null
    },
    {
        "perimortem": "wikt:perimortem"
    },
    {
        " injuries to the skull. These included a relatively shallow orifice, which is most likely to have been caused by a ": null
    },
    {
        "rondel dagger": "rondel dagger"
    },
    {
        ", and a scooping depression to the skull, inflicted by a bladed weapon, most probably a sword. Additionally, the bottom of the skull presented a gaping hole, where a ": null
    },
    {
        "halberd": "halberd"
    },
    {
        " had cut away and entered it. Forensic pathologist Dr Stuart Hamilton stated that this injury would have left the individuals brain visible, and most certainly would have been the cause of death. Dr Jo Appleby, the osteo-archaeologist who excavated the skeleton, concurred and described the latter as a mortal battlefield wound in the back of the skull . The base of the skull also presented another fatal wound in which a bladed weapon had been thrust into it, leaving behind a jagged hole. Closer examination of the interior of the skull revealed a mark opposite this wound, showing that the blade penetrated to a depth of .  In total, the skeleton presented ten wounds: four minor injuries on the top of the skull, one dagger blow on the cheekbone, one cut on the lower jaw, two fatal injuries on the base of the skull, one cut on a rib bone, and one final wound on the pelvis, most probably inflicted after death. It is generally accepted that postmortem, Richards naked body was tied to the back of a horse, with his arms slung over one side and his legs and buttocks over the other. This presented a tempting target for onlookers, and the angle of the blow on the pelvis suggests that one of them stabbed Richards right buttock with substantial force, as the cut extends from the back all the way to the front of the pelvic bone and was most probably an act of humiliation. It is also possible that Richard suffered other injuries which left no trace on the skeleton.        British historian John Ashdown-Hill had used ": null
    },
    {
        "genealogical research": "genealogy"
    },
    {
        " in 42 to trace ": null
    },
    {
        "matrilineal": "matrilineality"
    },
    {
        " descendants of ": null
    },
    {
        "Anne of York": "anne of york, duchess of exeter"
    },
    {
        ", Richards elder sister.     A British-born woman who emigrated to Canada after the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ", Joy Ibsen , was found to be a 42th-generation great-niece of the king in the same direct maternal line.   Joy Ibsens mitochondrial DNA was tested and belongs to ": null
    },
    {
        "mitochondrial DNA haplogroup J": "haplogroup j"
    },
    {
        ", which by deduction, should also be the mitochondrial DNA haplogroup of Richard III. Joy Ibsen died in 42 Her son ": null
    },
    {
        "Michael Ibsen": "michael ibsen"
    },
    {
        " gave a mouth-swab sample to the research team on 42 August 42 His ": null
    },
    {
        "mitochondrial DNA passed down the direct maternal line": "mitochondrial dnafemale inheritance"
    },
    {
        " was compared to samples from the human remains found at the excavation site and used to identify King Richard.         On 42 February 42 the University of Leicester confirmed that the skeleton was beyond reasonable doubt that of King Richard III. This conclusion was based on mitochondrial DNA evidence, soil analysis, and dental tests , as well as physical characteristics of the skeleton which are highly consistent with contemporary accounts of Richards appearance.  The team announced that the arrowhead discovered with the body was a Roman-era nail, probably disturbed when the body was first interred. However, there were numerous perimortem wounds on the body, and part of the skull had been sliced off with a bladed weapon; this would have caused rapid death. The team concluded that it is unlikely that the king was wearing a helmet in his last moments. Soil taken from the remains was found to contain microscopic ": null
    },
    {
        "roundworm": "ascaris lumbricoides"
    },
    {
        " eggs. Several eggs were found in samples taken from the pelvis, where the kings intestines were, but not from the skull and only very small numbers were identified in soil surrounding the grave. The findings suggest that the higher concentration of eggs in the pelvic area probably arose from a roundworm infection the King suffered in his life, rather than from human waste dumped in the area at a later date, researchers said. The Mayor of Leicester announced that the kings skeleton would be re-interred at ": null
    },
    {
        "Leicester Cathedral": "leicester cathedral"
    },
    {
        " in early 42 but a judicial review of that decision delayed the reinterment for a year.  A museum to Richard III was opened in July 42 in the Victorian school buildings next to the Greyfriars grave site.       The proposal to have King Richard buried in Leicester attracted some controversy. Those who challenged the decision included fifteen collateral descendants of Richard III ,  represented by the ": null
    },
    {
        "Plantagenet Alliance": "plantagenet alliance"
    },
    {
        ", who believed that the body should be reburied in York, as they claim the king wished.  In August 42 they filed a court case in order to contest Leicesters claim to re-inter the body within its cathedral, and propose the body be buried in York instead. However, Michael Ibsen, who gave the DNA sample that identified the king, gave his support to Leicesters claim to re-inter the body in their cathedral. On 42 August, a judge ruled that the opponents had the legal standing to contest his burial in Leicester Cathedral, despite a clause in the contract which had authorized the excavations requiring his burial there. He urged the parties, though, to settle out of court in order to avoid embarking on the Wars of the Roses, Part Two .  The Plantagenet Alliance, and the supporting fifteen collateral descendants, also faced the challenge that Basic maths shows Richard, who had no surviving children but five siblings, could have millions of collateral descendants undermining the groups claim to represent the only people who can speak on behalf of him . A ruling in May 42 decreed that there are no public law grounds for the Court interfering with the decisions in question . The remains were taken to Leicester Cathedral on 42 March 42 and reinterred on 42 March.      On 42 February 42 Professor ": null
    },
    {
        "Caroline Wilkinson": "caroline wilkinson"
    },
    {
        " of the ": null
    },
    {
        "University of Dundee": "university of dundee"
    },
    {
        " conducted a ": null
    },
    {
        "facial reconstruction": "forensic facial reconstruction"
    },
    {
        " of Richard III, commissioned by the Richard III Society, based on 42D mappings of his skull.  The face is described as warm, young, earnest and rather serious .  On 42 February 42 the University of Leicester announced the project to sequence the entire genome of Richard III and one of his living relatives, Michael Ibsen, whose mitochondrial DNA confirmed the identification of the excavated remains. Richard III thus became the first ancient person of known historical identity to have their genome sequenced.      In November 42 the results of the testing were announced, confirming that the maternal side was as previously thought. The paternal side, however, demonstrated some variance from what had been expected, with the DNA showing no links to the purported descendants of Richards great-great-grandfather ": null
    },
    {
        "Edward III of England": "edward iii of england"
    },
    {
        " through ": null
    },
    {
        "Henry Somerset, 42th Duke of Beaufort": "henry somerset, 5th duke of beaufort"
    },
    {
        ". This could be the result of covert ": null
    },
    {
        "illegitimacy": "legitimacy"
    },
    {
        " that does not reflect the accepted genealogies between Richard and Edward III or between Edward III and the 42th Duke of Beaufort.                In 42 following his death in battle against Henry Tudor at Bosworth Field, Richard IIIs body was buried in Greyfriars Church in Leicester.     Following the discoveries of Richards remains in 42 it was decided that they should be reburied at ": null
    },
    {
        "Leicester Cathedral": "leicester cathedral"
    },
    {
        ",  despite feelings in some quarters that he should have been reburied in ": null
    },
    {
        "York Minster": "york minster"
    },
    {
        ".  His remains were carried in procession to the cathedral on 42 March 42 and ": null
    },
    {
        "reburied": "exhumation of richard iii of england"
    },
    {
        " on 42 March 42  at a religious re-burial service at which both the Right Reverend ": null
    },
    {
        "Tim Stevens": "tim stevens"
    },
    {
        ", the ": null
    },
    {
        "Bishop of Leicester": "bishop of leicester"
    },
    {
        ", and the Most Reverend ": null
    },
    {
        "Justin Welby": "justin welby"
    },
    {
        ", the ": null
    },
    {
        "Archbishop of Canterbury": "archbishop of canterbury"
    },
    {
        ", officiated. The ": null
    },
    {
        "British royal family": "british royal family"
    },
    {
        " was represented by the ": null
    },
    {
        "Duke": "prince richard, duke of gloucester"
    },
    {
        " and ": null
    },
    {
        "Duchess of Gloucester": "birgitte, duchess of gloucester"
    },
    {
        " and the ": null
    },
    {
        "Countess of Wessex": "sophie, countess of wessex"
    },
    {
        ". The actor ": null
    },
    {
        "Benedict Cumberbatch": "benedict cumberbatch"
    },
    {
        ", who is a distant relation of the king and later portrayed him in  The Hollow Crown  television series, read a poem by ": null
    },
    {
        "poet laureate": "poet laureate"
    },
    {
        " Carol Ann Duffy": "carol ann duffy"
    },
    {
        ".      His cathedral tomb was designed by the architects ": null
    },
    {
        "van Heyningen and Haward": "van heyningen and haward"
    },
    {
        ".  The tombstone is deeply incised with a cross, and consists of a rectangular block of white ": null
    },
    {
        "Swaledale": "swaledale"
    },
    {
        " fossil stone, quarried in ": null
    },
    {
        "North Yorkshire": "north yorkshire"
    },
    {
        ". It sits on a low plinth made of dark ": null
    },
    {
        "Kilkenny marble": "kilkenny marble"
    },
    {
        ", incised with Richards name, dates and motto . The plinth also carries his coat of arms in ": null
    },
    {
        "pietra dura": "pietra dura"
    },
    {
        ".  The remains of Richard III are in a lead-lined inner casket,  inside an outer ": null
    },
    {
        "English oak": "english oak"
    },
    {
        " coffin crafted by Michael Ibsen, a direct descendant of Richards sister Anne of York, and laid in a brick-lined vault below the floor, and below the plinth and tombstone. The original 42 raised tomb design had been proposed by Langleys Looking For Richard Project and fully funded by members of the Richard III Society. The proposal was publicly launched by the Society on 42 February 42 but rejected by Leicester Cathedral in favour of a memorial slab.    However, following a public outcry, the Cathedral changed its position and on 42 July 42 announced its agreement to give King Richard III a raised tomb monument.              On 42 November 42 Richard gained the title of Duke of Gloucester; in late 42 he was invested as a ": null
    },
    {
        "Knight of the Garter": "knight of the garter"
    },
    {
        ". Following the death of King Edward IV, he was made ": null
    },
    {
        "Lord Protector": "lord protector"
    },
    {
        " of England. Richard held this office from 42 April to 42 June 42 when he made himself king of the realm. As King of England, Richard was styled Dei Gratia Rex Angliae et Franciae et Dominus Hiberniae .     Informally, he may have been known as Dickon , according to a sixteenth-century legend of a note, warning of treachery, that was sent to the Duke of Norfolk on the eve of Bosworth:               As Duke of Gloucester, Richard used the ": null
    },
    {
        "Royal Arms of England": "royal arms of england"
    },
    {
        " quartered": "quartering"
    },
    {
        " with the ": null
    },
    {
        "Royal Arms of France": "royal arms of francehistory"
    },
    {
        ", ": null
    },
    {
        "differenced": "difference"
    },
    {
        " by a ": null
    },
    {
        "label": "label"
    },
    {
        " argent": "argent"
    },
    {
        " of three points ": null
    },
    {
        "ermine": "ermine"
    },
    {
        ", on each point a ": null
    },
    {
        "canton": "canton"
    },
    {
        " gules": "gules"
    },
    {
        ", supported by a blue boar.   As sovereign, he used the arms of the kingdom undifferenced, supported by a white boar and a lion. His motto was Loyaulte me lie, Loyalty binds me ; and his ": null
    },
    {
        "personal device": "heraldic badge"
    },
    {
        " was a ": null
    },
    {
        "white boar": "white boar"
    },
    {
        ".       ": null
    }
]