[
    {
        "        Riders of the Purple Wage is a ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novella": "novella"
    },
    {
        " by American writer ": null
    },
    {
        "Philip José Farmer": "philip josé farmer"
    },
    {
        ". It appeared in  Dangerous Visions , the ": null
    },
    {
        "New Wave science fiction": "new wave science fiction"
    },
    {
        " anthology": "anthology"
    },
    {
        " compiled by ": null
    },
    {
        "Harlan Ellison": "harlan ellison"
    },
    {
        ", in 42 and won the ": null
    },
    {
        "Hugo Award": "hugo award"
    },
    {
        " for best novella in 42 jointly with  Weyr Search  by ": null
    },
    {
        "Anne McCaffrey": "anne mccaffrey"
    },
    {
        ".     The title of the story is a take-off on  Riders of the Purple Sage , a Western by the American author ": null
    },
    {
        "Zane Grey": "zane grey"
    },
    {
        ".       Riders of the Purple Wage is an extrapolation of the mid-twentieth centurys tendency towards state supervision and consumer-oriented economic planning. In the story, all citizens receive a ": null
    },
    {
        "basic income": "basic income"
    },
    {
        "  from the government, to which everyone is entitled just by being born. The population is self-segregated into relatively small communities, with a controlled environment, and keeps in contact with the rest of the world through the Fido, a combination ": null
    },
    {
        "television": "television"
    },
    {
        " and ": null
    },
    {
        "videophone": "videophone"
    },
    {
        ". The typical dwelling is an egg-shaped house, outside of which is a realistic simulation of an open environment with sky, sun, and moon. In reality, each community is on one level of a multi-level ": null
    },
    {
        "arcology": "arcology"
    },
    {
        ". For those who dislike this lifestyle, there are ": null
    },
    {
        "wildlife reserve": "wildlife reserve"
    },
    {
        "s where they can join tribes of ": null
    },
    {
        "Native Americans": "native americans in the united states"
    },
    {
        " and like-minded Anglos living closer to nature for a while. Some choose this lifestyle permanently.     ": null
    },
    {
        "Art": "art"
    },
    {
        " are prominently displayed in this society. Artists receive press coverage comparable to that of todays movie stars. Hardly less glamorous are the art critics, each of whom has a pet theory about art. A critic also acts as an agent and manager, promoting the work of one or more artists, especially if their work seems to support his ideas. The story revolves around one of these pampered artists, who sometimes finds himself uninspired, due to the lack of major conflicts in society.     ": null
    },
    {
        "Sexual relation": "sexual relation"
    },
    {
        "s and ": null
    },
    {
        "sexual orientation": "sexual orientation"
    },
    {
        " are portrayed as absolutely free from prejudice. The main character is bisexual, and it is implied that most of his acquaintances have had at least experimental relations with members of both sexes. Several forms of ": null
    },
    {
        "birth control": "birth control"
    },
    {
        " are also commonplace, encouraged by the government, and freely discussed.     For people who do not want to bother with social interaction, there is the fornixator, a device that supplies ": null
    },
    {
        "sexual pleasure": "sexual pleasure"
    },
    {
        " on demand by direct stimulation of the ": null
    },
    {
        "brain": "brain"
    },
    {
        "s pleasure centers. The fornixator is technically illegal, but tolerated by the government because its users are happy, never demand anything else, and usually do not ": null
    },
    {
        "procreate": "procreation"
    },
    {
        ".     Two new sets of customs have arisen which profoundly influence the story. By tradition, everyone has a Naming Day when they are grown, at which point they select a name which reflects their outlook on life, their chosen profession, or the way they want others to see them. The second change derives from the so-called Panamorite religion, which features total sexual freedom including oral sex between parents and their children. One source of frustration for the main character is his mothers decision to cut him off from intimate physical contact, a situation made worse by her becoming morbidly obese, which is not unusual in this society.       The story revolves around the relationship between a young artist, who has taken the name ": null
    },
    {
        "Chibiabos": "the song of hiawatha"
    },
    {
        " Elgreco": "el greco"
    },
    {
        " Winnegan, and the man he calls Grandpa Winnegan , who hides inside the apartments that Chib shares with his mother in the community of ": null
    },
    {
        "Ellay": "los angeles"
    },
    {
        ". Grandpa is in hiding from the government, and most people think of him as having pulled off some huge swindle in the past. In fact, he was a successful businessman whose workers were highly paid and very content, much more so than the average recipient of the purple wage . The resentment which this caused motivated the gummint to close down his business, whereupon he managed to steal twenty billion dollars, which has never been found, and died. A Federal Agent calling himself ": null
    },
    {
        "Falco": "falcon"
    },
    {
        " Accipiter": "accipitridae"
    },
    {
        " has resolved to hunt down the money at all costs, and is harassing Chib.     Throughout the narrative we are treated to extracts from Grandpas unpublished manuscript, Private Ejaculations. In these writings, he describes society and muses on human foibles. He seems particularly fond of ": null
    },
    {
        "James Joyce": "james joyce"
    },
    {
        ", and this is a clue to the storys resolution.     Chib is preparing for a new art show. He needs to win a grant to continue painting, otherwise he will have to take forced migration and live in another society, a practice by governments to prevent populations from becoming insular. Chibs own community is host to forcibly migrated Arabs, who belong to the strict ": null
    },
    {
        "Wahhabi": "wahhabi"
    },
    {
        " sect of Islam. Chib wants to woo the daughter of one of these families, much to the disgust of her relatives.     Standing between Chib and the grant is the one-eyed critic Rex Luscus, who took his name from  Inter caecos regnat luscus , better known as In the country of the blind, the one-eyed man is King . The price of Rexs approval, which will make Chib famous, is sexual favors. Chibs art is controversial. He depicts religious scenes using a three-dimensional technique which presents different views, some of which are blasphemous comments on religion and humanity.     Like most young people, Chib and his friends enjoy rebellion for its own sake. They pretend to plot terrorist attacks when they know they are under surveillance. Such talk is so common that the listening authorities treat it with contempt. The police are laughable by 42th century standards. Dressed in fur-like characters from  The Wizard of Oz  they use electric tricycles no faster than golf carts, which nonetheless are equipped with sirens to warn the bad guys they are coming . They have shock-sticks and guns which fire choke-gas pellets .     Chibs exhibition dissolves into violence as his friend ": null
    },
    {
        "Omar": "omar khayyam"
    },
    {
        " Runic": "runes"
    },
    {
        " declaims an improvised poem in tribute to Chibs latest work. This is also common, particularly as the fido reporters are always keen to stir up trouble, and the artists hate the critics. One artist, a science fiction writer named ": null
    },
    {
        "Huga": "hugo award"
    },
    {
        " Wells": "h.g. wells"
    },
    {
        "-": null
    },
    {
        "Erb": "edgar rice burroughs"
    },
    {
        " Hein": "robert a. heinlein"
    },
    {
        "stur": "theodore sturgeon"
    },
    {
        "bury": "ray bradbury"
    },
    {
        ", starts the riot by attacking a reporter from ": null
    },
    {
        "Time magazine": "time magazine"
    },
    {
        ", now a government-run news agency which has kept the attitudes of the original corporation, including a deep hatred of science fiction. Chib smashes his painting, a blasphemous Nativity scene, into Rex Luscuss stomach. Suddenly he receives a message from Grandpa. Falco Accipiter has broken into the apartment and found his hiding place.     Grandpa is dead by the time Chib reaches home. He apparently died of shock. In his hand is the last of his Private Ejaculations . A devout Catholic himself, according to this last note he comforts himself in an atheist world with the thought that profound hatred of religion means that people still believe God exists, otherwise they would not hate him so.     Chib and his mother attend a reverse funeral, where the coffin which supposedly contained Grandpas body is dug up. As it is opened, there is an explosion, which scatters the stolen billions into the air and sends up a banner announcing ": null
    },
    {
        "Winnegans Fake!": "finnegans wake"
    },
    {
        " . Grandpa has cocked a final snook at the gummint from beyond the grave.     Chib is handed a note by a man acting for Grandpas estate. The note simply says that Chib must abandon Ellay, leave his mother, and break free so he can paint from love, not out of hatred.       Chibiabos Elgreco Winnegan, a young artist and confidant of Grandpa Winnegan. In the poem ": null
    },
    {
        "Hiawatha": "the song of hiawatha"
    },
    {
        ", the gentle Chibiabos is Hiawathas close friend.   Grandpa Winnegan, whose original name was Finnegan. He claimed to be a descendant of the Tim Finnegan whose death and resurrection are celebrated in the song ": null
    },
    {
        "Finnegans Wake": "finnegans wake"
    },
    {
        ". He is the last bastion of individual enterprise in the mechanized nanny-state. His adopted last name is a pun on Win again .   Mama Winnegan, Chibs mother who spends her life drinking, eating, and playing poker with disreputable friends. She may know that Grandpa is hiding in their apartments, but pretends not to.   Falco Accipter, a gummint agent who is determined to track down Grandpas stolen money, and perhaps Grandpa himself.   Rex Luscus, one-eyed art critic whose eye is mostly on Chibs body. He could have his other eye replaced, but he claims that no art he sees makes it worth his while to have binocular vision.   The Young Radishes , Chibs circle of friends who play at plotting revolution and defying authority through their art. Their name is a pun on ": null
    },
    {
        "radical": "political radicalism"
    },
    {
        " , meaning either a root  or a person who advocates drastic change in society.   ": null
    },
    {
        "Omar": "omar khayyam"
    },
    {
        " Bacch": "dionysus"
    },
    {
        "ylides Runic, a poet with a talent for extemporizing, and Chibs occasional lover. His improvised poems tend to inflame people to riot.   Benedictine ": null
    },
    {
        "Serinus": "serinus"
    },
    {
        " Melba": "nellie melba"
    },
    {
        ", a singer who claims to be pregnant by Chib. Thanks to an incident with a can of ": null
    },
    {
        "spermicide": "spermicide"
    },
    {
        ", Chib finds this hard to believe.   ": null
    },
    {
        "Rousseau": "jean-jacques rousseau"
    },
    {
        " Red Hawk, who affects the persona of a Red Indian even though he is a Jewish philosopher who feels intellectually deprived in the nature reserves.   Huga Wells-Erb Heinsturbury, a ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " writer whose unwieldy adopted name is derived from the names ": null
    },
    {
        "Hugo Gernsback": "hugo gernsback"
    },
    {
        ", ": null
    },
    {
        "H. G. Wells": "h. g. wells"
    },
    {
        ", ": null
    },
    {
        "Edgar Rice Burroughs": "edgar rice burroughs"
    },
    {
        " , ": null
    },
    {
        "Robert A. Heinlein": "robert a. heinlein"
    },
    {
        ", ": null
    },
    {
        "Theodore Sturgeon": "theodore sturgeon"
    },
    {
        " and ": null
    },
    {
        "Ray Bradbury": "ray bradbury"
    },
    {
        ".   Pinkerton ": null
    },
    {
        "Legrand": "the gold-bug"
    },
    {
        ", a gummint agent monitoring the Young Radishes.       In his afterword to the story, Farmer mentions the ": null
    },
    {
        "Triple Revolution": "triple revolution"
    },
    {
        " memo, a document sent to ": null
    },
    {
        "United States": "united states"
    },
    {
        " President ": null
    },
    {
        "Lyndon Johnson": "lyndon johnson"
    },
    {
        " in 42 with policy suggestions for the future of the nation in the face of three separate and mutually reinforcing revolutions. These were identified as The Cybernation Revolution, , The Weaponry Revolution , and The Human Rights Revolution .     The source of Rex Luscus name is described in the story as the quote, In the country of the blind, the one-eyed man is King . The original phrase is In regione caecorum, rex est luscus, from ": null
    },
    {
        "Desiderius Erasmus Roterodamus": "desiderius erasmus roterodamus"
    },
    {
        " Collecteana Adagiorum. This is likely to also be a reference to the early SF writer ": null
    },
    {
        "H. G. Wells": "h. g. wells"
    },
    {
        " story, ": null
    },
    {
        "The Country of the Blind": "the country of the blind"
    },
    {
        " in which a sighted man finds himself in a literal country of the blind, plots to use his advantage to rule them, but fails because his ability is not appreciated by the population.       ": null
    },
    {
        "Algis Budrys": "algis budrys"
    },
    {
        " said that Riders of the Purple Wage shows how to write more and more about less and less. Farmer can show you how to pile it higher and higher ... exercise in self-indulgence . ": null
    }
]