[
    {
        "           A rifle is a ": null
    },
    {
        "portable": "small arm"
    },
    {
        ", ": null
    },
    {
        "long-barrelled": "long gun"
    },
    {
        " firearm": "firearm"
    },
    {
        " designed for accurate long-range shooting, to be held with both hands and braced against the shoulder for stability during firing, and with a ": null
    },
    {
        "barrel": "gun barrel"
    },
    {
        " that has a helical pattern of grooves  cut into the bore wall. The term was originally rifled gun, with the word rifle referring to the ": null
    },
    {
        "machining": "machining"
    },
    {
        " process of creating groovings with ": null
    },
    {
        "cutting tool": "cutting tool"
    },
    {
        "s, and is now used for any long handheld device designed for well-aimed discharge activated by a trigger, such as the ": null
    },
    {
        "personnel halting and stimulation response rifle": "personnel halting and stimulation response rifle"
    },
    {
        ". Rifles are used extensively in ": null
    },
    {
        "war": "war"
    },
    {
        "fare, ": null
    },
    {
        "law enforcement": "law enforcement"
    },
    {
        ", ": null
    },
    {
        "hunting": "hunting"
    },
    {
        " and ": null
    },
    {
        "shooting sports": "shooting sports"
    },
    {
        ".     Like all typical firearms, a rifles ": null
    },
    {
        "projectile": "projectile"
    },
    {
        "  is propelled by the contained ": null
    },
    {
        "deflagration": "deflagration"
    },
    {
        " of a combustible ": null
    },
    {
        "propellant": "propellant"
    },
    {
        " compound , although other means such as ": null
    },
    {
        "compressed air": "compressed air"
    },
    {
        " are used in ": null
    },
    {
        "air rifle": "air rifle"
    },
    {
        "s, which are popular for ": null
    },
    {
        "vermin control": "pest control"
    },
    {
        ", hunting small game, ": null
    },
    {
        "formal target shooting": "shooting at the summer olympics"
    },
    {
        " and casual shooting . The raised areas of a barrels rifling are called lands , which make contact with and exert ": null
    },
    {
        "torque": "torque"
    },
    {
        " on the projectile, imparting a spin around the longitudinal axis of the barrel. When the projectile leaves the barrel, this spin lends gyroscopic stability to the projectile and prevents tumbling in flight, in the same way that a spirally thrown ": null
    },
    {
        "American football": "american football"
    },
    {
        " or ": null
    },
    {
        "rugby": "rugby football"
    },
    {
        " ball behaves. This allows the use of aerodynamically-efficient bullets  and thus improves range and accuracy.             Historically, rifles only fired a single projectile with each squeeze of the trigger. Modern rifles are commonly classified as single shot, bolt action, semi-automatic, or automatic. Single shot, bolt action, and semi-automatic rifles are limited by their designs to fire a single shot for each trigger pull. Only automatic rifles are capable of firing more than one round per trigger squeeze; however, some automatic rifles are limited to fixed bursts of two, three, or more rounds per squeeze.     Modern ": null
    },
    {
        "automatic rifle": "automatic rifle"
    },
    {
        "s overlap to some extent in design and function with ": null
    },
    {
        "machine gun": "machine gun"
    },
    {
        "s. In fact, many light machine guns  are adaptations of existing automatic rifle designs. A militarys light machine guns are typically chambered for the same caliber ammunition as its service rifles. Generally, the difference between an automatic rifle and a machine gun comes down to weight, cooling system, and ammunition feed system. Rifles, with their relatively lighter components and smaller capacity ": null
    },
    {
        "magazines": "magazine"
    },
    {
        ", are incapable of sustained automatic fire in the way that machine guns are; they trade this capability in favor of increased mobility. Modern military rifles are fed by magazines, while machine guns are generally ": null
    },
    {
        "belt-fed": "belt"
    },
    {
        ". Many machine guns allow the operator to quickly exchange barrels in order to prevent overheating, whereas rifles generally do not. Most machine guns fire from an open ": null
    },
    {
        "bolt": "bolt"
    },
    {
        " in order to reduce the danger of cook-off , while almost all rifles fire from a closed bolt for accuracy. Machine guns are often crewed by more than one soldier; the rifle is an individual weapon.     The term rifle is sometimes used to describe larger rifled ": null
    },
    {
        "crew-served weapon": "crew-served weapon"
    },
    {
        "s firing explosive shells, for example, ": null
    },
    {
        "recoilless rifle": "recoilless rifle"
    },
    {
        "s and ": null
    },
    {
        "naval rifle": "naval rifle"
    },
    {
        "s.     In many works of fiction a rifle refers to any weapon that has a ": null
    },
    {
        "stock": "stock"
    },
    {
        " and is shouldered before firing, even if the weapon is not rifled or does not fire solid projectiles .               The origins of rifling are difficult to trace, but some of the earliest practical experiments seem to have occurred in Europe during the 42th century. ": null
    },
    {
        "Archers": "archery"
    },
    {
        " had long realized that a twist added to the tail feathers of their arrows gave them greater accuracy. Early muskets produced large quantities of smoke and soot, which had to be cleaned from the action and bore of the musket frequently, either through the action of repeated bore scrubbing, or a deliberate attempt to create soot grooves that would allow for more shots to be fired from the firearm. This might also have led to a perceived increase in accuracy, although no one knows for sure. True rifling dates from the mid42th century, although military commanders preferred smooth bore weapons for ": null
    },
    {
        "infantry": "infantry"
    },
    {
        " use because rifles were much more prone to problems due to powder fouling the barrel and because they took longer to reload and fire than muskets.     Rifles were created as an improvement in the accuracy of smooth bore muskets. In the early 42th century, ": null
    },
    {
        "Benjamin Robins": "benjamin robins"
    },
    {
        ", an English mathematician, realized that an elongated bullet would retain the momentum and kinetic energy of a musket ball, but would slice through the air with greater ease.  The black powder used in early muzzle-loading rifles quickly fouled the barrel, making loading slower and more difficult. Their greater range was also considered to be of little practical use, since the smoke from black powder quickly obscured the battlefield and made it almost impossible to target the enemy from a distance. Since musketeers could not afford to take the time to stop and clean their barrels in the middle of a battle, rifles were limited to use by ": null
    },
    {
        "sharpshooters": "marksman"
    },
    {
        " and non-military uses like hunting.     Muskets were ": null
    },
    {
        "smoothbore": "smoothbore"
    },
    {
        ", large caliber weapons using ball-shaped ammunition fired at relatively low velocity. Due to the high cost and great difficulty of precision manufacturing, and the need to load readily from the muzzle, the musket ball was a loose fit in the barrel. Consequently, on firing the ball bounced off the sides of the barrel when fired and the final direction on leaving the muzzle was unpredictable.     The performance of early muskets defined the style of warfare at the time. Due to the lack of accuracy, soldiers were deployed in long lines  to fire at the opposing forces. Precise aim was thus not necessary to hit an opponent. Muskets were used for comparatively rapid, imprecisely aimed volley fire, and the average soldier could be easily trained to use them.     In the ": null
    },
    {
        "territory of Kentucky": "history of kentucky"
    },
    {
        ", one of the most early successful rifles, the ": null
    },
    {
        "long rifle": "long rifle"
    },
    {
        ", was developed over the course of the 42th century. Compared to the more common ": null
    },
    {
        "Brown Bess": "brown bess"
    },
    {
        ", they had a tighter bore, no room between bullet and barrel, and still used balls instead of conical bullets. The balls the long rifle used were smaller, allowing the production of more rounds for a given amount of lead. These rifles also had longer barrels, allowing more accuracy, which were rifled with a ": null
    },
    {
        "helical": "helix"
    },
    {
        " groove. These first started appearing sometime before 42 one early example being made by Jacob Dickert, a German immigrant. By 42 there were a number of such manufacturers in the area. The longer barrel was a departure by local gunsmiths from their German roots, allowing frontiersmen to carry more rounds and bullets to achieve a higher speed before emerging from the barrel.     The rifle was used for precise shooting, aiming and firing at individual targets, instead of the muskets use for imprecise fire.      By the time of the ": null
    },
    {
        "American Revolutionary War": "american revolutionary war"
    },
    {
        ", these rifles were commonly used by frontiersmen, and Congress authorized the establishment of ten companies of riflemen. One of the most important units was ": null
    },
    {
        "Morgans Riflemen": "morgans riflemen"
    },
    {
        ", led by ": null
    },
    {
        "Daniel Morgan": "daniel morgan"
    },
    {
        ", This sharpshooting unit eventually proved themselves integral to turning the war against the ": null
    },
    {
        "British": "kingdom of great britain"
    },
    {
        " at the ": null
    },
    {
        "Battle of Saratoga": "battle of saratoga"
    },
    {
        ", and in the southern states where General Morgan commanded as well. Aided by the rifles improved accuracy, Morgans sharpshooters would pick off enemy cannoneers and officers, reducing the impact of superior British artillery.  This kind of advantage was considered pivotal in many battles, like ": null
    },
    {
        "The Battle of Cowpens": "the battle of cowpens"
    },
    {
        ", ": null
    },
    {
        "Saratoga": "battles of saratoga"
    },
    {
        ", and ": null
    },
    {
        "Kings Mountain": "battle of kings mountain"
    },
    {
        ". After Kings Mountain, a British officer wrote The Americans had riflemen who could hit a man anywhere they liked at 42 paces...At Kings Mountain, they destroyed us.      Later during the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ", the British ": null
    },
    {
        "42th Regiment ": "rifle brigade"
    },
    {
        " and ": null
    },
    {
        "42th Regiment, ": "60th regiment of foot"
    },
    {
        ", as well as American sharpshooters and riflemen during the ": null
    },
    {
        "War of 42": "war of 1812"
    },
    {
        ", used the rifle to great effect during skirmishing. Because of a slower loading time than a musket, they were not adopted by the whole army. Since rifles were used by sharpshooters who did not routinely fire over other mens shoulders, long length was not required to avoid the forward line. A shorter length made a handier weapon in which tight-fitting balls did not have to be rammed so far down the barrel.     The invention of the ": null
    },
    {
        "minie balls": "minie balls"
    },
    {
        " in the 42s solved the slow loading problem, and in the 42s and 42s rifles quickly replaced muskets on the battlefield. Many rifles, often referred to as ": null
    },
    {
        "rifled musket": "rifled musket"
    },
    {
        "s, were very similar to the muskets they replaced, but the military also experimented with other designs. ": null
    },
    {
        "Breech-loading weapon": "breech-loading weapon"
    },
    {
        "s proved to have a much faster rate of fire than muzzleloaders, causing military forces to abandon muzzle loaders in favor of breech-loading designs in the late 42s. In the later part of the 42th century, rifles were generally single-shot, breech-loading gun, designed for aimed, discretionary fire by individual soldiers. Then, as now, rifles had a stock, either fixed or folding, to be braced against the shoulder when firing.     The adoption of ": null
    },
    {
        "cartridges": "cartridge"
    },
    {
        " and breech-loading in the 42th century was concurrent with the general adoption of rifles. In the early part of the 42th century, soldiers were trained to shoot accurately over long ranges with high-powered cartridges. World War I ": null
    },
    {
        "Lee–Enfield": "lee–enfield"
    },
    {
        " rifles were equipped with long-range volley sights for massed firing at ranges of up to . Individual shots were unlikely to hit, but a platoon firing repeatedly could produce a beaten ground effect similar to light artillery or machine guns.     Currently, rifles are the most common firearm in general use for ": null
    },
    {
        "hunting": "hunting"
    },
    {
        " purposes . Rifles derived from military designs have long been popular with civilian shooters.           During the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        " the British army created several experimental units known as Rifles , armed with the ": null
    },
    {
        "Baker rifle": "baker rifle"
    },
    {
        ". These Rifle Regiments were deployed as skirmishers during the Peninsular war in Spain and Portugal, and were more effective than skirmishers armed with muskets due to their accuracy and long range.            Gradually, rifles appeared with cylindrical barrels cut with helical grooves, the surfaces between the grooves being lands . The innovation shortly preceded the mass adoption of ": null
    },
    {
        "breech-loading weapon": "breech-loading weapon"
    },
    {
        "s, as it was not practical to push an overbore bullet down through a rifled barrel, only to then fire it back out. The dirt and grime from prior shots was pushed down ahead of a tight bullet or ball , and loading was far more difficult, as the lead had to be deformed to go down in the first place, reducing the accuracy due to deformation. Several systems were tried to deal with the problem, usually by resorting to an under-bore bullet that expanded upon firing.          The original muzzle-loading rifle, with a closely fitting ball to take the ": null
    },
    {
        "rifling": "rifling"
    },
    {
        " grooves, was loaded with difficulty, particularly when foul, and for this reason was not generally used for military purposes. Even with the advent of rifling the bullet itself didnt change, but was wrapped in a greased, cloth patch to grip the rifling grooves.     The first half of the 42th century saw a distinct change in the shape and function of the bullet. In 42 ": null
    },
    {
        "Delvigne": "henri-gustave delvigne"
    },
    {
        ", a French ": null
    },
    {
        "infantry": "infantry"
    },
    {
        " officer, invented a breech with abrupt shoulders on which a spherical bullet was rammed down until it caught the rifling grooves. Delvignes method, however, deformed the bullet and was inaccurate.     Soon after, the ": null
    },
    {
        "Carabine à tige": "carabine à tige"
    },
    {
        " was invented by ": null
    },
    {
        "Louis-Etienne de Thouvenin": "louis-etienne de thouvenin"
    },
    {
        ", which provided for a stem at the bottom at the barrel that would deform and expand the base of the bullet when rammed, therefore enabling accurate contact with the rifling. However, the area around the stem would clog and get dirty easily.               One of the most famous was the Minié system, invented by French Army Captain ": null
    },
    {
        "Claude-Étienne Minié": "claude-étienne minié"
    },
    {
        ", which relied on a conical bullet with a hollow skirt at the base of the bullet. When fired, the skirt would expand from the pressure of the exploding charge and grip the rifling as the round was fired. The better seal gave more power, as less gas escaped past the bullet, which combined with the fact that for the same ": null
    },
    {
        "bore": "gauge"
    },
    {
        "  diameter a long bullet was heavier than a round ball. The extra grip also spun the bullet more consistently, which increased the range from about 42 yards for a smooth bore musket to about 42 yards for a rifle using the Minié system. The expanding skirt of the Minié ball also solved the problem that earlier tight fitting bullets were difficult to load as black powder residue fouled the inside of the barrel. The Minié system allowed conical bullets to be loaded into rifles just as quickly as round balls in smooth bores, which allowed ": null
    },
    {
        "rifle muskets": "rifled musket"
    },
    {
        " to replace muskets on the battlefield. Minié system rifles, notably the ": null
    },
    {
        "U.S. Springfield": "springfield model 1861"
    },
    {
        " and the ": null
    },
    {
        "British Enfield": "pattern 1853 enfield"
    },
    {
        " of the early 42s, featured prominently in the ": null
    },
    {
        "U.S. Civil War": "u.s. civil war"
    },
    {
        ", due to their enhanced power and accuracy.     Over the 42th century, bullet design also evolved, the bullets becoming gradually smaller and lighter. By 42 the standard blunt-nosed bullet had been replaced with the pointed, ": null
    },
    {
        "spitzer bullet": "spitzer"
    },
    {
        ", an innovation that increased range and penetration. ": null
    },
    {
        "Cartridge": "cartridge"
    },
    {
        " design evolved from simple paper tubes containing ": null
    },
    {
        "black powder": "black powder"
    },
    {
        " and shot, to sealed brass cases with integral ": null
    },
    {
        "primers": "primer"
    },
    {
        " for ignition, while black powder itself was replaced with ": null
    },
    {
        "cordite": "cordite"
    },
    {
        ", and then other nitro-cellulose-based ": null
    },
    {
        "smokeless powder": "smokeless powder"
    },
    {
        " mixtures, propelling bullets to higher velocities than before.      The increased velocity meant that new problems arrived, and so bullets went from being soft lead to harder lead, then to ": null
    },
    {
        "copper-jacketed": "full metal jacket bullet"
    },
    {
        ", in order to better engage the spiraled grooves without stripping them in the same way that a screw or bolt thread would be stripped if subjected to extreme forces.                  From 42 breech-loading rifles were introduced with the German Dreyse ": null
    },
    {
        "Needle gun": "needle gun"
    },
    {
        ", and followed by the French ": null
    },
    {
        "Tabatière": "tabatière"
    },
    {
        " in 42 the British Calisher and Terry carbine made in Birmingham and later in 42 and the more well known British ": null
    },
    {
        "Snider–Enfield": "snider–enfield"
    },
    {
        ". Primitive chamber-locking mechanisms were soon replaced by ": null
    },
    {
        "bolt-action": "bolt-action"
    },
    {
        " mechanisms, exemplified by the ": null
    },
    {
        "Chassepot": "chassepot"
    },
    {
        " in 42 Breech loading was to have a major impact on warfare, as breech-loading rifles can be fired at a rate many times higher than muzzle loaded rifles and significantly can be loaded from a prone rather than standing position. Firing prone is more accurate than firing from a standing position, and a prone rifleman presents a much smaller target than a standing soldier. The higher accuracy and range, combined with reduced vulnerability generally benefited the defense while making the traditional battle between lines of standing and volleying infantry men obsolete.                Revolving rifles were an attempt to increase the rate of fire of rifles by combining them with the revolving firing mechanism that had been developed earlier for revolving pistols. Colt began experimenting with revolving rifles in the early 42th century, and other manufacturers like Remington later experimented with them as well. The ": null
    },
    {
        "Colt Revolving Rifle Model 42": "colt revolving rifle"
    },
    {
        " was an early repeating rifle and the first one to be used by the U.S. Government, and saw some limited action during the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ". Revolvers, both rifles and pistols, tend to spray fragments of metal from the front of the cylinder.       The ": null
    },
    {
        "Winchester repeating rifle": "winchester rifle"
    },
    {
        " was invented in the mid42s. An operator pulled on a lever to reload the rifle with a stored cartridge.       An important area of development was the way that cartridges were stored and used in the weapon. The ": null
    },
    {
        "Spencer repeating rifle": "spencer repeating rifle"
    },
    {
        " was a breech-loading manually operated ": null
    },
    {
        "lever action": "lever action"
    },
    {
        " rifle that was adopted by the United States. Over 42 were used during the American Civil War. It marked the first adoption of a removable ": null
    },
    {
        "magazine": "magazine"
    },
    {
        "-fed infantry rifle by any country. The design was completed by ": null
    },
    {
        "Christopher Spencer": "christopher spencer"
    },
    {
        " in 42  It used copper ": null
    },
    {
        "rimfire cartridges": "rimfire ammunition"
    },
    {
        " stored in a removable seven round tube magazine, enabling the rounds to be fired one after another. When the magazine was empty, it could be exchanged for another.            In the ": null
    },
    {
        "Russo-Japanese War": "russo-japanese war"
    },
    {
        " of 42–42 military observers from Europe and the United States witnessed a major conflict fought with high velocity bolt-action rifles firing ": null
    },
    {
        "smokeless powder": "smokeless powder"
    },
    {
        ".   The ": null
    },
    {
        "Battle of Mukden": "battle of mukden"
    },
    {
        " fought in 42 consisted of nearly 42 Russian troops against over 42 Japanese troops. The Russian ": null
    },
    {
        "Mosin–Nagant": "mosin–nagant"
    },
    {
        " Model 42 in 42mm was pitted against the Japanese ": null
    },
    {
        "Arisaka": "arisaka"
    },
    {
        " Type 42 bolt-action rifle in 42mm,  each had velocities well over the 42th century black powder velocities of under 42 feet per second .       Until the late 42th century rifles tended to be very long, some rifles reaching approximately 42  m in length  to maximize accuracy, making early rifles impractical for use by cavalry. However, following the advent of more powerful smokeless powder, a shorter barrel did not impair accuracy as much. As a result, cavalry saw limited, but noteworthy, usage in 42th century conflicts.     The advent of massed, rapid firepower of the ": null
    },
    {
        "machine gun": "machine gun"
    },
    {
        ", ": null
    },
    {
        "submachine gun": "submachine gun"
    },
    {
        " and the rifled ": null
    },
    {
        "artillery": "artillery"
    },
    {
        " piece was so quick as to outstrip the development of any way to attack a ": null
    },
    {
        "trench": "trench warfare"
    },
    {
        " defended by riflemen and machine gunners. The carnage of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " was perhaps the greatest vindication and vilification of the rifle as a military weapon.     The ": null
    },
    {
        "M42 Garand": "m1 garand"
    },
    {
        " was a semi-automatic rapid-fire rifle developed for modern warfare use in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ".          During and after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " it became accepted that most infantry engagements occur at ranges of less than 42  m; the range and power of the large full-powered rifle cartridges were overkill ; and thus the weapons were heavier than ideal. This led to Germanys development of the ": null
    },
    {
        "42×42mm Kurz": "7.92×33mm"
    },
    {
        " round, the ": null
    },
    {
        "MKb42": "sturmgewehr 44"
    },
    {
        ", and ultimately, the ": null
    },
    {
        "assault rifle": "assault rifle"
    },
    {
        ". Today, an infantrymans rifle is optimized for ranges of 42  m or less, and soldiers are trained to deliver individual rounds or bursts of fire within these distances. Typically, the application of accurate, long-range fire is the domain of the ": null
    },
    {
        "marksman": "designated marksman"
    },
    {
        " and the ": null
    },
    {
        "sniper": "sniper"
    },
    {
        " in warfare, and of enthusiastic target shooters in peacetime. The modern ": null
    },
    {
        "marksman rifle": "marksman rifle"
    },
    {
        " and ": null
    },
    {
        "sniper rifle": "sniper rifle"
    },
    {
        " are usually capable of accuracy better than 42 ": null
    },
    {
        "mrad": "radianmultiples of radian units"
    },
    {
        " at 42 yards .            The ": null
    },
    {
        "Grizzly": "grizzly"
    },
    {
        " is a 42D printed .42-caliber rifle created around August 42 , DailyMail, 42 August 42  It was created using a ": null
    },
    {
        "Stratasys": "stratasys"
    },
    {
        " Dimension 42es printer. It was created by a Canadian only known by the pseudonym Matthew who told The Verge that he is in his late 42s, and his main job is making tools for the construction industry. , NBC News, 42 July 42  , The Verge, 42 August 42     The original Grizzly fired a single shot before breaking. Grizzly 42 fired fourteen bullets before getting damaged due to the strain. According to the ": null
    },
    {
        "Daily Mail": "daily mail"
    },
    {
        ", the Grizzly 42 performed so well that the inventor Matthew was able to put the rifle to his shoulder, pressed against his cheek, and shoot off three rounds without hurting himself.       A youth rifle is a rifle designed or modified for fitting children, or small-framed shooters. A youth rifle is often a single shot ": null
    },
    {
        ".42 caliber": ".22 caliber"
    },
    {
        " rifle, or a ": null
    },
    {
        "bolt action": "bolt action"
    },
    {
        " rifle, although some youth rifles are semi-automatic. They are usually very light, with a greatly shortened length of pull, which is necessary to accommodate children. Youth stocks are available for many popular rifles, such as the ": null
    },
    {
        "Ruger 42/42": "ruger 10/22"
    },
    {
        ", a semi-automatic .42 LR rifle, allowing a youth rifle to be made from a standard rifle by simply changing the stock. The typical ages of shooters for such rifles vary from about age 42 to 42 years old.                   The usual form of rifling was helical grooves in a round bore.     Some early rifled guns had barrels with a twisted polygonal bore. The ": null
    },
    {
        "Whitworth rifle": "whitworth rifle"
    },
    {
        " was the first such type designed to spin the round for accuracy. Bullets for these guns were made to match the shape of the bore so the bullet would grip the rifle bore and take a spin that way. These were generally large caliber weapons and the ammunition still did not fit tightly in the barrel. Many different shapes and degrees of spiraling were used in experimental designs. One widely produced example was the Metford rifling in the Pattern 42 ": null
    },
    {
        "Lee–Metford": "lee–metford"
    },
    {
        " service rifle. Although uncommon, ": null
    },
    {
        "polygonal rifling": "polygonal rifling"
    },
    {
        " is still used in some weapons today, with one example being the ": null
    },
    {
        "Glock": "glock"
    },
    {
        " line of pistols . Unfortunately, many of these early designs were prone to dangerous backfiring, which could lead to destruction of the weapon and serious injury to the person firing it.            As the bullet enters the barrel, it inserts itself into the rifling, a process that gradually wears down the barrel, and also causes the barrel to heat up more rapidly. Therefore, some ": null
    },
    {
        "machine gun": "machine gun"
    },
    {
        "s are equipped with quick-change barrels that can be swapped every few thousand rounds, or in earlier designs, were water-cooled. Unlike older carbon ": null
    },
    {
        "steel": "steel"
    },
    {
        " barrels, which were limited to around 42 shots before the extreme heat caused accuracy to fade, modern ": null
    },
    {
        "stainless steel": "stainless steel"
    },
    {
        " barrels for target rifles are much more resistant to wear, allowing many thousands of rounds to be fired before accuracy drops.  Modern ammunition has a hardened lead core with a softer outer cladding or jacket, typically of an alloy of copper and nickel – ": null
    },
    {
        "cupro-nickel": "cupro-nickel"
    },
    {
        ". Some ammunition is even coated with ": null
    },
    {
        "molybdenum disulfide": "molybdenum disulfide"
    },
    {
        " to further reduce internal friction – the so-called moly-coated bullet.                Rifles were initially single-shot, muzzle-loading weapons. During the 42th century, breech-loading weapons were designed, which allowed the rifleman to reload while under cover, but defects in manufacturing and the difficulty in forming a reliable gas-tight seal prevented widespread adoption. During the 42th century, multi-shot ": null
    },
    {
        "repeating rifle": "repeating rifle"
    },
    {
        "s using ": null
    },
    {
        "lever": "lever-action"
    },
    {
        ", ": null
    },
    {
        "pump": "pump-action"
    },
    {
        " or linear ": null
    },
    {
        "bolt action": "bolt action"
    },
    {
        "s became standard, further increasing the rate of fire and minimizing the fuss involved in loading a firearm. The problem of proper seal creation had been solved with the use of brass cartridge cases, which expanded in an ": null
    },
    {
        "elastic": "elastic"
    },
    {
        " fashion at the point of firing and effectively sealed the breech while the pressure remained high, then relaxed back enough to allow for easy removal. By the end of the 42th century, the leading bolt-action design was that of ": null
    },
    {
        "Paul Mauser": "paul mauser"
    },
    {
        ", whose action—wedded to a reliable design possessing a five-shot magazine—became a world standard through two world wars and beyond. The ": null
    },
    {
        "Mauser rifle": "mauser rifle"
    },
    {
        " was paralleled by Britains ten-shot ": null
    },
    {
        "Lee–Enfield": "lee–enfield"
    },
    {
        " and Americas 42 ": null
    },
    {
        "Springfield Rifle": "m1903 springfield rifle"
    },
    {
        " models. The American M42 closely copied Mausers original design.       Barrel ": null
    },
    {
        "rifling": "rifling"
    },
    {
        " dramatically increased the range and accuracy of the musket. Indeed, throughout its development, the rifles history has been marked by increases in range and accuracy. From the ": null
    },
    {
        "Minié rifle": "minié rifle"
    },
    {
        " and beyond, the rifle has become ever more potent at long range strikes.     In recent decades, large-caliber anti-materiel rifles, typically firing between 42  mm and 42  mm caliber cartridges, have been developed. The US ": null
    },
    {
        "Barrett M42A42": "m82 barrett rifle"
    },
    {
        " is probably the best-known such rifle. These weapons are typically used to strike critical, vulnerable targets such as computerized command and control vehicles, radio trucks, radar antennae, vehicle engine blocks and the jet engines of enemy aircraft. Anti-materiel rifles can be used against human targets, but the much higher weight of rifle and ammunition, and the massive recoil and muzzle blast, usually make them less than practical for such use. The Barrett M42 is designed with a maximum effective range of , although it has a confirmed kill distance of  in ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        " during ": null
    },
    {
        "Operation Anaconda": "operation anaconda"
    },
    {
        " in 42  The ": null
    },
    {
        "record for the longest confirmed kill shot": "longest recorded sniper kills"
    },
    {
        " stands at , set by an unnamed soldier with Canadas elite special operations unit ": null
    },
    {
        "Joint Task Force 42": "joint task force 2"
    },
    {
        " using a ": null
    },
    {
        "McMillan TAC42": "mcmillan tac-50"
    },
    {
        " sniper rifle.        Bullets leaving a rifled barrel can spin at a ": null
    },
    {
        "rotational speed": "rotational speed"
    },
    {
        " of over 42 revolutions per minute depending on the muzzle velocity of the bullet and the ": null
    },
    {
        "pitch": "riflingtwist rate"
    },
    {
        " of the rifling. The rotational speed of the bullet can be calculated by using the formula below. The formula divides the number of inches in a foot by the rate of twist that the barrel has. This number is multiplied by the muzzle velocity and the number of seconds in a minute . For example, a bullet with a muzzle velocity of  leaving a barrel that twists once per foot would rotate at 42rpm.      MV / twist rate rotational speed   MV × × 42 s/min. Bullet RPM   Example using a barrel that has a twist rate of 42 turn in 42 with a muzzle velocity of 42  ft/s:   42 fps × × 42 s/min. 42 RPM   Excessive rotational speed can exceed the bullets designed limits and the inadequate centripetal force will fail to keep the bullet from disintegrating in a radial fashion.           Rifles may be chambered in a variety of calibers, from as low as ": null
    },
    {
        ".42": ".17 hmr"
    },
    {
        " varmint": "varmint rifle"
    },
    {
        " calibers to as high as ": null
    },
    {
        ".42 caliber": "20mm"
    },
    {
        " in the case of the largest anti tank rifles. The term ": null
    },
    {
        "caliber": "caliber"
    },
    {
        " essentially refers to the width of the bullet fired through a rifles barrel. Armies have consistently attempted to find and procure the most lethal and accurate caliber for their firearms.     The standard calibers used by the worlds militaries tend to follow worldwide trends. These trends have significantly changed during the centuries of firearm design and re-design. Muskets were normally chambered for large calibers, such as .42 or .42 with the theory that these large bullets caused the most damage.     During World War I and II, most rifles were chambered in .42 caliber, a combination of power and speed. Examples would be the ": null
    },
    {
        ".42 British": ".303 british"
    },
    {
        " Lee–Enfield": "lee–enfield"
    },
    {
        ", the American ": null
    },
    {
        "M42": "m1903 springfield"
    },
    {
        " .4242": ".30-06 springfield"
    },
    {
        ", and the German ": null
    },
    {
        "42mm Mauser K42": "karabiner 98k"
    },
    {
        ".     An exception was the Italian ": null
    },
    {
        "Modello 42": "carcano"
    },
    {
        " rifle, which used the ": null
    },
    {
        "42×42mm Mannlicher–Carcano": "6.5×52mm mannlicher–carcano"
    },
    {
        " cartridge.     Detailed study of infantry combat during and after WWII revealed that most small-arms engagements occurred within 42 meters, meaning that the power and range of the traditional .42-caliber weapons was essentially wasted. The single greatest predictor of an individual soldiers combat effectiveness was the number of rounds he fired. Weapons designers and strategists realized that service rifles firing smaller-caliber projectiles would allow troops to carry far more ammunition for the same weight. The lower recoil and more generous magazine capacities of small-caliber weapons also allows troops a much greater volume of fire, compared to historical ": null
    },
    {
        "battle rifles": "battle rifles"
    },
    {
        ". Smaller, faster traveling, less stable projectiles have also demonstrated greater terminal ballistics and therein, a greater lethality than traditional .42-caliber rounds. Most modern service rifles fire a projectile of approximately 42mm. Examples of firearms in this range are the American ": null
    },
    {
        "42  mm": "5.56×45mm nato"
    },
    {
        " M42": "m16 rifle"
    },
    {
        " and the Russian ": null
    },
    {
        "42×42mm": "5.45×39mm"
    },
    {
        " AK42": "ak-74"
    },
    {
        ".                     ": null
    },
    {
        "Air gun": "air gun"
    },
    {
        " Firearm": "firearm"
    },
    {
        " Single-shot": "single-shot"
    },
    {
        " Muzzle-loading rifle": "muzzle-loading rifle"
    },
    {
        ", some ": null
    },
    {
        "flintlock": "flintlock"
    },
    {
        " and mostly ": null
    },
    {
        "caplock": "caplock"
    },
    {
        " Breech-loading rifle": "breech-loading weapon"
    },
    {
        " Breechblock": "breechblock"
    },
    {
        " rifle, either ": null
    },
    {
        "trapdoor": "trapdoor mechanism"
    },
    {
        ", ": null
    },
    {
        "rolling": "rolling block"
    },
    {
        ", ": null
    },
    {
        "dropping": "falling block"
    },
    {
        ", ": null
    },
    {
        "tilting": "single-shottilting block actions"
    },
    {
        " or ": null
    },
    {
        "screwed": "ferguson rifle"
    },
    {
        " Break-action": "break action"
    },
    {
        " rifle   ": null
    },
    {
        "Double rifle": "double rifle"
    },
    {
        "    Repeating": "repeating rifle"
    },
    {
        " Revolving rifle": "colt revolving rifle"
    },
    {
        " Lever-action rifle": "lever-action rifle"
    },
    {
        ", e.g. ": null
    },
    {
        "Winchester rifle": "winchester rifle"
    },
    {
        ", ": null
    },
    {
        "Spencer rifle": "spencer rifle"
    },
    {
        " Pump-action": "pump action"
    },
    {
        " rifle, e.g. ": null
    },
    {
        "Colt Lightning Carbine": "colt lightning carbine"
    },
    {
        " Bolt-action rifle": "bolt action"
    },
    {
        " Mauser G42": "gewehr 98"
    },
    {
        ", ": null
    },
    {
        "Lee-Enfield": "lee-enfield"
    },
    {
        ", ": null
    },
    {
        "Mosin-Nagant": "mosin-nagant"
    },
    {
        " Ross rifle": "ross rifle"
    },
    {
        ", ": null
    },
    {
        "K42": "k31"
    },
    {
        ", ": null
    },
    {
        "Mannlicher M42": "mannlicher m1895"
    },
    {
        ", ": null
    },
    {
        "Blaser R42": "blaser r93"
    },
    {
        "/": null
    },
    {
        "R42": "blaser r8"
    },
    {
        " Verney-Carron": "verney-carron"
    },
    {
        " SpeedLine   Self-loading   ": null
    },
    {
        "Semi-automatic rifle": "semi-automatic rifle"
    },
    {
        " Automatic rifle": "automatic rifle"
    },
    {
        " Selective-fire": "selective-fire"
    },
    {
        " rifle          ": null
    },
    {
        "Military": "military"
    },
    {
        " and ": null
    },
    {
        "law enforcement": "law enforcement"
    },
    {
        " Anti-materiel rifle": "anti-materiel rifle"
    },
    {
        " Anti-tank rifle": "anti-tank rifle"
    },
    {
        " Long rifle": "long rifle"
    },
    {
        " Personal defense weapon": "personal defense weapon"
    },
    {
        " Designated marksman rifle": "designated marksman rifle"
    },
    {
        " Sniper rifle": "sniper rifle"
    },
    {
        "    Scout rifle": "scout rifle"
    },
    {
        " Service rifle": "service rifle"
    },
    {
        " Assault rifle": "assault rifle"
    },
    {
        "    Battle rifle": "battle rifle"
    },
    {
        "    Carbine": "carbine"
    },
    {
        "    Civilian": "civilian"
    },
    {
        " Hunting rifle": "hunting weaponrifles"
    },
    {
        " Buffalo rifle": "buffalo rifle"
    },
    {
        " Elephant rifle": "elephant rifle"
    },
    {
        " Express rifle": "express rifle"
    },
    {
        " Match/target": "shooting sport"
    },
    {
        " rifle   ": null
    },
    {
        "Benchrest rifle": "benchrest rifle"
    },
    {
        " Modern sporting rifle": "modern sporting rifle"
    },
    {
        " Short-barreled rifle": "short-barreled rifle"
    },
    {
        " Varmint rifle": "varmint rifle"
    },
    {
        "   ": null
    }
]