[
    {
        "Rift Valley fever  is a ": null
    },
    {
        "viral disease": "Viral Disease"
    },
    {
        " that can cause mild to severe symptoms. The mild symptoms may include: ": null
    },
    {
        "fever": "Fever"
    },
    {
        ", ": null
    },
    {
        "muscle pains": "Myalgia"
    },
    {
        ", and ": null
    },
    {
        "headaches": "Headache"
    },
    {
        "which often last for up to a week. The severe symptoms may include: loss of sight beginning three weeks after the infection, infections of the ": null
    },
    {
        "brain": "Brain"
    },
    {
        " causing severe headaches and ": null
    },
    {
        "confusion": "Confusion"
    },
    {
        ", and bleeding together with ": null
    },
    {
        "liver problems": "Liver Problems"
    },
    {
        " which may occur within the first few days. Those who have bleeding have a chance of death as high as 50%.       The disease is caused by the RVF ": null
    },
    {
        "virus": "Virus"
    },
    {
        ", which is of the  Phlebovirus  type. It is spread by either touching infected animal blood, breathing in the air around an infected animal being ": null
    },
    {
        "butchered": "Butchered"
    },
    {
        ", drinking ": null
    },
    {
        "raw milk": "Raw Milk"
    },
    {
        " from an infected animal, or the bite of infected ": null
    },
    {
        "mosquito": "Mosquito"
    },
    {
        "es. Animals such as cows, sheep, goats, and camels may be affected. In these animals it is spread mostly by mosquitoes. It does not appear that one person can infect another person. The disease is diagnosed by finding ": null
    },
    {
        "antibodies": "Antibodies"
    },
    {
        " against the virus or the virus itself in the blood.       Prevention of the disease in humans is accomplished by vaccinating animals against the disease. This must be done before an outbreak occurs because if it is done during an outbreak it may worsen the situation. Stopping the movement of animals during an outbreak may also be useful, as may decreasing mosquito numbers and avoiding their bites. There is a human ": null
    },
    {
        "vaccine": "Vaccine"
    },
    {
        "; however, as of 2010 it is not widely available. There is no specific treatment and medical efforts are supportive.       ": null
    },
    {
        "Outbreaks": "Epidemics"
    },
    {
        " of the disease have only occurred in Africa and ": null
    },
    {
        "Arabia": "Arabia"
    },
    {
        ". Outbreaks usually occur during periods of increased rain which increase the number of mosquitoes. The disease was first reported among livestock in ": null
    },
    {
        "Rift Valley": "Great Rift Valley, Kenya"
    },
    {
        " of ": null
    },
    {
        "Kenya": "Kenya"
    },
    {
        " in the early 1900s,  and the virus was first isolated in 1931.        In humans, the virus can cause several syndromes. Usually, sufferers have either no symptoms or only a mild illness with fever, ": null
    },
    {
        "headache": "Headache"
    },
    {
        ", ": null
    },
    {
        "muscle pains": "Myalgia"
    },
    {
        ", and ": null
    },
    {
        "liver": "Liver"
    },
    {
        " abnormalities. In a small percentage of cases ": null
    }
]