[
    {
        "                                               Rigel , designated β Orionis , is generally the ": null
    },
    {
        "seventh-brightest star": "list of brightest stars"
    },
    {
        " in the ": null
    },
    {
        "night sky": "night sky"
    },
    {
        " and the brightest star in the ": null
    },
    {
        "constellation": "constellation"
    },
    {
        " of ": null
    },
    {
        "Orion": "orion"
    },
    {
        ". Its brightness varies slightly, and it is ": null
    },
    {
        "occasionally outshone": "betelgeusenascent discoveries"
    },
    {
        " by ": null
    },
    {
        "Betelgeuse": "betelgeuse"
    },
    {
        ", itself a ": null
    },
    {
        "semi-regular variable star": "semi-regular variable star"
    },
    {
        ". Rigel looks blue-white to the ": null
    },
    {
        "naked eye": "naked eye"
    },
    {
        ", contrasting with orange-red Betelgeuse. Although appearing as a single star to the naked eye, Rigel is a multiple ": null
    },
    {
        "star system": "star system"
    },
    {
        " composed of at least four ": null
    },
    {
        "star": "star"
    },
    {
        "s.     The name Rigel strictly refers to only the primary star , although it is commonly applied to the whole system. The primary has a companion star  away with an ": null
    },
    {
        "apparent magnitude": "apparent magnitude"
    },
    {
        " of 6.7, 400 times fainter than the primary. The companion, often referred to as Rigel B or Rigel BC, is actually a triple star system. Two stars, components B and C, can be resolved by very large telescopes. The brighter of the two is a ": null
    },
    {
        "spectroscopic binary": "spectroscopic binary"
    },
    {
        ", the components designated Ba and Bb. A fainter star, separated from the others by nearly an ": null
    },
    {
        "arc minute": "arc minute"
    },
    {
        ", might also be part of the same star system.     Rigel is a ": null
    },
    {
        "massive": "massive star"
    },
    {
        " blue supergiant": "blue supergiant"
    },
    {
        " calculated to be anywhere from 61,500 to 363,000 times ": null
    },
    {
        "as luminous as the Sun": "solar luminosity"
    },
    {
        ", depending on the method used to calculate its properties and assumptions about its distance, estimated to be about . Rigels radius is over 70 times ": null
    },
    {
        "that of the Sun": "solar radius"
    },
    {
        ", and its ": null
    },
    {
        "surface temperature": "surface temperature"
    },
    {
        " is . Pulsations cause Rigels small intrinsic brightness variations, and it is classified as an ": null
    },
    {
        "Alpha Cygni variable": "alpha cygni variable"
    },
    {
        ".            The traditional name Rigel is derived from ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        ", meaning leg or foot;  the star represents the foot of Orion. In 2016, the ": null
    },
    {
        "International Astronomical Union": "international astronomical union"
    },
    {
        " included the name Rigel in the IAU Catalog of Star Names.     Rigel was designated β Orionis  by ": null
    },
    {
        "Johann Bayer": "johann bayer"
    },
    {
        " in 1603. The beta designation is commonly given to the second-brightest star in each constellation, but Rigel is almost always brighter than Alpha Orionis . Astronomer ": null
    },
    {
        "James B. Kaler": "james b. kaler"
    },
    {
        " has speculated that Rigel was designated by Bayer during a rare period when it was outshone by the variable star Betelgeuse, resulting in the latter star being designated alpha and Rigel designated beta . However, Bayer did not strictly order the stars by brightness; rather he grouped them by magnitude class and then ordered the stars within each class according to a different scheme.  Rigel and Betelgeuse were both considered to be of the first class, and in Orion the stars of each class are thought to have been ordered north to south.  Rigel is included in the ": null
    },
    {
        "General Catalogue of Variable Stars": "general catalogue of variable stars"
    },
    {
        ", but since it already has a ": null
    },
    {
        "Bayer designation": "bayer designation"
    },
    {
        ", β Orionis, it has no separate ": null
    },
    {
        "variable star designation": "variable star designation"
    },
    {
        ".     Rigel has several alternative ": null
    },
    {
        "stellar designations": "stellar designations and names"
    },
    {
        " taken from various catalogues, including the ": null
    },
    {
        "Flamsteed designation": "flamsteed designation"
    },
    {
        " 19  Orionis , the ": null
    },
    {
        "Bright Star Catalogue": "bright star catalogue"
    },
    {
        " entry HR  1713, and the ": null
    },
    {
        "Henry Draper Catalogue": "henry draper catalogue"
    },
    {
        " number HD  34085. These designations appear in the scientific literature, but rarely in popular writing.     The naked-eye star Rigel is actually a multiple star system. According to the IAU Catalog of Star Names, the proper name Rigel applies only to the supergiant primary component β Orionis A. In historical ": null
    },
    {
        "astronomical catalogs": "astronomical catalogs"
    },
    {
        ", the system is listed variously as ": null
    },
    {
        "H  II": "herschel catalogue of double stars"
    },
    {
        "  33, ": null
    },
    {
        "Σ": "struve double star catalog"
    },
    {
        "  668, ": null
    },
    {
        "β": "burnham double star catalogue"
    },
    {
        "  555, or ": null
    },
    {
        "ADS": "aitken double star catalogue"
    },
    {
        "  3823. For simplicity, Rigels companions can be referred to as Rigel B, C, and D; the IAU describes such names as useful nicknames that are unofficial . In modern comprehensive catalogues, the whole multiple star system is known as ": null
    },
    {
        "WDS": "washington double star catalog"
    },
    {
        " 05145-0812 or ": null
    },
    {
        "CCDM": "catalog of components of double and multiple stars"
    },
    {
        " 05145-0812.       Rigel is an ": null
    },
    {
        "intrinsic variable star": "variable starintrinsic variable stars"
    },
    {
        " with an ": null
    },
    {
        "apparent magnitude": "apparent magnitude"
    },
    {
        " ranging from 0.05 to 0.18. It is typically the seventh-brightest star in the ": null
    },
    {
        "celestial sphere": "celestial sphere"
    },
    {
        " excluding the Sun, although occasionally fainter than Betelgeuse. It is usually fainter than ": null
    },
    {
        "Capella": "capella"
    },
    {
        ", which also varies slightly in brightness. Rigel appears slightly blue-white and has a ": null
    },
    {
        "B-V color": "b-v color"
    },
    {
        " index of −0.06. It contrasts strongly with reddish Betelgeuse.     Culminating at ": null
    },
    {
        "midnight": "midnight"
    },
    {
        " on 12 December, and at 9 PM on 24 January, Rigel is visible in winter evenings in the ": null
    },
    {
        "northern hemisphere": "northern hemisphere"
    },
    {
        " and summer in the southern. In the ": null
    },
    {
        "southern hemisphere": "southern hemisphere"
    },
    {
        ", Rigel is the first bright star of Orion visible as the constellation rises. The star is a vertex of the ": null
    },
    {
        "Winter Hexagon": "winter hexagon"
    },
    {
        " , an ": null
    },
    {
        "asterism": "asterism"
    },
    {
        " that includes ": null
    },
    {
        "Aldebaran": "aldebaran"
    },
    {
        ", Capella, ": null
    },
    {
        "Pollux": "pollux"
    },
    {
        ", ": null
    },
    {
        "Procyon": "procyon"
    },
    {
        ", and ": null
    },
    {
        "Sirius": "sirius"
    },
    {
        ". Rigel is a prominent equatorial ": null
    },
    {
        "navigation star": "navigation star"
    },
    {
        ", being easily located and readily visible in all the worlds oceans .       Rigels ": null
    },
    {
        "spectral type": "stellar classificationmodern classification"
    },
    {
        " is a defining point of the classification sequence for supergiants. The overall spectrum is typical for a ": null
    },
    {
        "late": "late-type star"
    },
    {
        " B class star, with strong ": null
    },
    {
        "absorption lines": "absorption line"
    },
    {
        "of the hydrogen ": null
    },
    {
        "Balmer series": "balmer series"
    },
    {
        " together with neutral helium lines and some of heavier elements such as oxygen, calcium, and magnesium. The ": null
    },
    {
        "luminosity class": "luminosity class"
    },
    {
        " for B8 stars is estimated from the strength and narrowness of the hydrogen spectral lines, and Rigel is assigned to the ": null
    },
    {
        "bright supergiant": "bright supergiant"
    },
    {
        " class Ia.     As early as 1888, the ": null
    },
    {
        "radial velocity": "radial velocity"
    },
    {
        " of Rigel, as estimated from the ": null
    },
    {
        "Doppler shifts": "doppler shift"
    },
    {
        "of its spectral lines, was seen to vary. This was confirmed and interpreted at the time as being due to a spectroscopic companion with a period of about 22 days. The radial velocity has since been measured to vary by about  around a mean of .     In 1933, the ": null
    },
    {
        "Hα": "hα"
    },
    {
        " spectral line was seen to be unusually weak and shifted  towards shorter wavelengths, while there was a narrow ": null
    },
    {
        "emission spike": "emission line"
    },
    {
        " about  to the long wavelength side of the main absorption line. This is now known as a ": null
    },
    {
        "P Cygni profile": "p cygni profile"
    },
    {
        " after a star that shows this feature strongly in its spectrum. It is associated with mass loss where there is simultaneously emission from a dense wind close to the star and absorption from circumstellar material expanding away from the star.     The unusual Hα line profile is observed to vary unpredictably: around a third of the time it is a normal absorption line; about a quarter of the time it is a double-peaked line, that is an absorption line with an emission core or an emission line with an absorption core; about a quarter of the time it has a P Cygni profile; most of the rest of the time the line has an inverse P Cygni profile, where the emission component is on the short wavelength side of the line; rarely there is a pure emission Hα line. The line profile changes are interpreted as variations in the quantity and velocity of material being expelled from the star. Occasional very high-velocity outflows have been inferred, and, more rarely, infalling material. The overall picture is one of large ": null
    },
    {
        "looping structures": "coronal loop"
    },
    {
        " arising from the ": null
    },
    {
        "photosphere": "photosphere"
    },
    {
        " and driven by magnetic fields.     Variations in the spectrum have resulted in the assignment of different classes to Rigel, such as B8 Ia, B8 Iab, and B8 Iae.       Rigel has been known to vary in brightness since at least 1930. The small amplitude of Rigels brightness variation requires ": null
    },
    {
        "photoelectric": "photoelectric sensor"
    },
    {
        " or ": null
    },
    {
        "CCD photometry": "ccd photometry"
    },
    {
        " to be detected. These brightness changes have no obvious period. Observations over 18 nights in 1984 showed variations at red, blue, and yellow wavelengths of up to 0.13 magnitudes on timescales of a few hours to several days, but again no clear period. Rigels ": null
    },
    {
        "colour index": "colour index"
    },
    {
        " varies slightly but is not strongly correlated with its brightness variations.     From analysis of ": null
    },
    {
        "Hipparcos": "hipparcos"
    },
    {
        " satellite photometry, Rigel is identified as belonging to the ": null
    },
    {
        "Alpha Cygni": "alpha cygni variable"
    },
    {
        " class of variable stars, defined as non-radially pulsating supergiants of the Bep–AepIa spectral types . The e indicates that it displays ": null
    },
    {
        "emission lines": "emission line"
    },
    {
        "in its spectrum, while the p means it has an unspecified spectral peculiarity. Alpha Cygni type variables are generally considered to be irregular or have ": null
    },
    {
        "quasi-period": "quasi-period"
    },
    {
        "s. Rigel was added to the ": null
    },
    {
        "General Catalogue of Variable Stars": "general catalogue of variable stars"
    },
    {
        " in the 74th name-list of variable stars on the basis of the Hipparcos photometry, which showed variations with a photographic amplitude of 0.039 magnitudes and a possible period of 2.075 days. Rigel was observed with the Canadian ": null
    },
    {
        "MOST": "microvariability and oscillations of stars telescope"
    },
    {
        " satellite for nearly 28 days in 2009. Milli-magnitude variations were observed, and gradual changes in flux suggest the presence of long-period pulsation modes.       From observations of the variable Hα spectral line, Rigel is estimated to lose  solar masses per year , around 10 million times more than the mass loss rate from the ": null
    },
    {
        "Sun": "sun"
    },
    {
        ". More detailed optical and ": null
    },
    {
        "K band": "k band"
    },
    {
        " infrared spectroscopic observations, together with ": null
    },
    {
        "VLTI": "vlti"
    },
    {
        " interferometry, were taken from 2006 to 2010. Analysis of the Hα and ": null
    },
    {
        "Hγ": "hγ"
    },
    {
        " line profiles, and measurement of the regions producing the lines, show that Rigels ": null
    },
    {
        "stellar wind": "stellar wind"
    },
    {
        " varies greatly in structure and strength. Loop and arm structures were also detected within the wind. Calculations of mass loss from the Hγ line give  in 2006-7 and  in 2009–10. Calculations using the Hα line give lower results, around . The terminal wind velocity is . It is estimated that Rigel has lost around 3 ": null
    },
    {
        "solar mass": "solar mass"
    },
    {
        "es  since beginning life as a star of  7 to 9 million years ago.          Rigels distance from the Sun is somewhat uncertain, with different distance estimates obtained with different methods. The 2007 ": null
    },
    {
        "Hipparcos": "hipparcos"
    },
    {
        " reduction of Rigels parallax is , giving a distance of  with a ": null
    },
    {
        "margin of error": "margin of error"
    },
    {
        " of about 9%. A companion star to Rigel, usually considered to be physically associated and at the same distance, has a ": null
    },
    {
        "Gaia Data Release 2": "gaia data release 2"
    },
    {
        " parallax of , suggesting a distance around . However, the measurements for this object may be unreliable, possibly because it is a close double star.     Indirect distance estimation methods have also been employed. For example, Rigel is believed to be in a region of nebulosity, with its radiation illuminating several nearby clouds. Most notable of these is the 5°–long ": null
    },
    {
        "IC 2118": "ic 2118"
    },
    {
        " , located at an ": null
    },
    {
        "angular separation": "angular separation"
    },
    {
        " of 2.5° from the star, or a distance of  away. From measures of other nebula-embedded stars, IC  2118s distance is estimated to be .     Rigel is an outlying member of the ": null
    },
    {
        "Orion OB1 Association": "orion ob1 association"
    },
    {
        ", which is located at a distance of up to  from Earth. It is a member of the loosely-defined ": null
    },
    {
        "Taurus-Orion R1 Association": "taurus-orion r1 association"
    },
    {
        ", somewhat closer at . Rigel is thought to be considerably closer than most of the members of Orion OB1 and the ": null
    },
    {
        "Orion Nebula": "orion nebula"
    },
    {
        ". ": null
    },
    {
        "Betelgeuse": "betelgeuse"
    },
    {
        " and ": null
    },
    {
        "Saiph": "saiph"
    },
    {
        " lie at a similar distance to Rigel, although Betelgeuse is a ": null
    },
    {
        "runaway star": "runaway star"
    },
    {
        " with a complex history and might have originally formed in the main body of the association.                  ": null
    }
]