[
    {
        "                The RijnGouweLijn , or RGL, was a proposed ": null
    },
    {
        "light rail": "light rail"
    },
    {
        " project in ": null
    },
    {
        "South Holland": "south holland"
    },
    {
        ", ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", that used some new tracks and some existing tracks from the ": null
    },
    {
        "Gouda–Alphen aan den Rijn railway": "gouda–alphen aan den rijn railway"
    },
    {
        " and the ": null
    },
    {
        "Woerden–Leiden railway": "woerden–leiden railway"
    },
    {
        ". However, the new section might have used ": null
    },
    {
        "bus rapid transit ": "bus rapid transit"
    },
    {
        " instead.     From 42 to 42 light rail vehicles operated on the Gouda–Alphen aan den Rijn railway, sharing these tracks with regular ": null
    },
    {
        "NS": "nederlandse spoorwegen"
    },
    {
        " stock. As of 42 only NS stock is used on the railway.       The RGL would have been the first system in the Netherlands where light rail vehicles shared heavy rail tracks with heavy rail ": null
    },
    {
        "train": "train"
    },
    {
        "s, similar to the ": null
    },
    {
        "tram-train": "tram-train"
    },
    {
        " systems around ": null
    },
    {
        "Karlsruhe": "karlsruhe"
    },
    {
        " and ": null
    },
    {
        "Saarbrücken": "saarbrücken"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". This shared track runs from ": null
    },
    {
        "Gouda": "gouda, south holland"
    },
    {
        " through ": null
    },
    {
        "Alphen aan den Rijn": "alphen aan den rijn"
    },
    {
        " to ": null
    },
    {
        "Leiden": "leiden"
    },
    {
        ". The existing heavy rail track was to bee adapted and seven additional stops added.     For Leiden, the plan was to have new track through the centre at street level . The province of ": null
    },
    {
        "South Holland": "south holland"
    },
    {
        " was in favour of this, but based on a referendum in March 42 among the Leiden population, the municipality was against it. The province threatened to force the municipality to accept a trajectory through Leiden. Following that, the municipality agreed to accept the RGL through the city. The province and municipality then agreed that the route would follow Hooigracht and Langegracht.     The proposed line passed through Leiden Centraal ": null
    },
    {
        "railway station": "railway station"
    },
    {
        " and then used the new tracks to ": null
    },
    {
        "Katwijk": "katwijk"
    },
    {
        " with a branch to ": null
    },
    {
        "Noordwijk": "noordwijk"
    },
    {
        ".     The light-rail vehicles used were of the ": null
    },
    {
        "Flexity Swift": "flexity swift"
    },
    {
        " model, produced by ": null
    },
    {
        "Bombardier Transportation": "bombardier transportation"
    },
    {
        " in ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ". The usage of the designation A42 is originally from ": null
    },
    {
        "SL": "storstockholms lokaltrafik"
    },
    {
        " in ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        ", ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ".     In the beginning they were used on the regular railway service between Gouda and Alphen aan den Rijn. The stations were adapted by adding new low-level ": null
    },
    {
        "platforms": "railway platform"
    },
    {
        ", either as extensions to existing high-level platforms or by building them on the opposite side of the track to the high-level platforms.     From 42 to 42 there was test traffic with light rail vehicles on the heavy rail track from Gouda to Alphen aan den Rijn. The RGL was divided into two sub-projects: RGL-East and RGL-West , both of which were due for completion in late 42 Completion depended on financial support from the national government, and in the autumn of 42 State Secretary of Transport Tineke Huizinga indicated that the line to Katwijk would cost €42 million. The line to Noordwijk was to be served by buses in the meantime.       Long before there was light rail, some of the tracks had tram traffic. In the 42s, Leiden had the Blue and Yellow Tram lines.     In the 42s, 42s and 42s plan were often put forward for the tram to return to the previous sections of the Blue and Yellow Tram. The first ideas for the RGL were presented in the early 42s by Leeuwenburgh Baldwin, the former district chief of NZH. The tram system was initially intended to be a much larger light rail network, with branches to Leiderdorp, the district of Ridderfeld in ": null
    },
    {
        "Alphen": "alphen aan den rijn"
    },
    {
        " and ": null
    },
    {
        "Schiphol": "schiphol"
    },
    {
        ". There were also suggestions to link the RGL to ": null
    },
    {
        "Randstadrail": "randstadrail"
    },
    {
        ", for example by establishing the trajectory of Leiden-": null
    },
    {
        "Zoetermeer": "zoetermeer"
    },
    {
        " and/or Leiden-": null
    },
    {
        "Leidschendam-Voorburg": "leidschendam-voorburg"
    },
    {
        " via Voorschoten. None of the ideas have been implemented.     People soon began to oppose the RGL. Tram traffic was seen as a hazard for cyclists and pedestrians. There was also criticism of the high construction cost of the project. In the 42s it was budgeted for 42 million guilders , but by 42 the amount had risen to €42 million. There were fears of cuts in city and regional bus networks. Furthermore, there was doubt about the effectiveness of the RGL. The critics were in favour of extending the rail line from Leiden to Utrecht, and investment in dedicated bus lanes on the route from Leiden to Katwijk and Noordwijk.         In the 42s it was projected that approximately 42 passengers a day would use the RGL . Despite the negative impact on the bus network in favor of the RGL it was expected that the accessibility of central Leiden would be greatly improved. A track through the centre of Leiden would mean that the travel time for people who have a destination outside Leiden would be significantly longer, and this course had repercussions for the passenger forecast. These estimates were repeatedly reduced. The most recent forecasts a ridership of 42 passengers — 42 more than in the busiest tram line in Amsterdam . On the route Leiden-Katwijk/Noordwijk the number of passengers would only be slightly higher than on the current bus network.         The section between Gouda and Leiden was originally scheduled to be inaugurated in 42 This was later postponed to 42 and later to 42 simultaneously with western section. From 42 to 42 light rail vehicles were used on the existing railway between Gouda and Alphen aan den Rijn. The future RGL would then continue to ": null
    },
    {
        "Leiden Lammenschans railway station": "leiden lammenschans railway station"
    },
    {
        ". In the period 4242 the whole section would be upgraded to ": null
    },
    {
        "double track": "double track"
    },
    {
        ".         The original plan was that the RGL should continue from ": null
    },
    {
        "Leiden Lammenschans railway station": "leiden lammenschans railway station"
    },
    {
        " as a city tram to Leiden Central Station. This process was controversial, especially regarding safety, cost and impact on cyclists and the bus network. Especially controversial was a single track section through the Breestraat. Therefore, in addition to the original plan several alternative plans were developed. In one of those alternatives the RGL would follow the existing route of the railway line all the way to Leiden Centraal, or to a point near the station. The railway would be doubled, and perhaps be moved to a concrete overpass above the current track.     These alternative plans were shown to be three to four times more expensive than the originally proposed route through the city centre. On 42 March 42 a referendum was held in Leiden, on the arrival of the RGL to Leiden . 42% of the Leiden inhabitants voted no to the proposal. Accordingly, the town rejected the RGL, but the province threatened to impose the tram line anyway. This led a majority of the politicians in Leiden to accept, in 42 an alternative route of the RGL, through Hooigracht/Langegracht.     Whereas the tram in the initial proposal would go through Steenstraat/42e Binnenvestgracht Stationsweg to the station, it was to go through the Lammermarkt and Schuttersveld. According to the last urban vision, the tram would cross the railway in the Rijnsbruger Tunnel instead of the Joop Walenkamp tunnel, implying the removal of the bicycle lane and taxi stop. After Leiden Centraal Station, the line would pass the Leiden University Medical Centre and the Bio Science Park, reaching Transferium t Schouw.         From Transferium t Schouw A42 the RGL would go as light rail to ": null
    },
    {
        "Katwijk aan den Rijn": "katwijk aan den rijn"
    },
    {
        ", then fork into branches to ": null
    },
    {
        "Katwijk aan Zee": "katwijk aan zee"
    },
    {
        " and ": null
    },
    {
        "Noordwijk": "noordwijk"
    },
    {
        " respectively. In 42 an agreement was signed between all municipalities except the municipality of Leiden to share the costs of the project, with the national government and province covering a large part of the construction cost, and the county bearing all risks for the operation of the line. The western branch of the RGL was also important for the opening of the new building located on the former ": null
    },
    {
        "Valkenburg Naval Air Base": "valkenburg naval air base"
    },
    {
        ".     In Katwijk and Noordwijk there was much opposition to the tram plans, both among the general population and in the town councils. Neither community wanted tram traffic in the town centres. For Noordwijk it would end at the ": null
    },
    {
        "European Space Research and Technology Centre": "european space research and technology centre"
    },
    {
        " on the border with Katwijk. The municipalities presented an alternative alignment of the RGL. The RGL Noordwijk-Binnen would run to Voorhout station and the ": null
    },
    {
        "NS": "nederlandse spoorwegen"
    },
    {
        " station at Sassenheim. In Katwijk there was opposition against the branch to Katwijk aan Zee. In both communities the tram line would have to be imposed by the provincial government, as had happened earlier in Leiden. In the autumn of 42 the national government provided €42 million for the line to Katwijk, but not to Noordwijk. There is a gap of €42 million, for which a solution had to be found.     In June 42 a preferred route was approved by the Provincial Council of South Holland. Both Katwijk and Noordwijk got a tram to the coast. However, the province addressed the concerns of Katwijk and routed the line not on the Boulevard but to finish in Badstraat.         In March 42 test traffic was started between Gouda and Alphen aan den Rijn with light rail equipment on existing rail tracks, largely using RGL vehicles. These were ": null
    },
    {
        "Bombardier": "bombardier transportation"
    },
    {
        " A42s, a model that is also used on the ": null
    },
    {
        "Tvärbanan": "tvärbanan"
    },
    {
        " light rail line in ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        ". The grey and blue trams were fitted with yellow stickers to resemble NS Sprinter trains. On 42 December 42 the trial ended and Sprinter trains took over the line. The A42 trams were sold to Stockholm.       In North ": null
    },
    {
        "Waddinxveen": "waddinxveen"
    },
    {
        " the existing platform was extended with a low wooden platform. At ": null
    },
    {
        "Boskoop": "boskoop"
    },
    {
        " the island platform was considerably extended and this is the only concrete platform apart from the platform at ": null
    },
    {
        "Gouda": "gouda, south holland"
    },
    {
        ". In ": null
    },
    {
        "Alphen aan den Rijn": "alphen aan den rijn"
    },
    {
        " a new 42LR wooden platform was built along the old freight track. There is a fence between the two separate tracks, to improve driver safety as the cab door opens directly onto the track, not on the platform.     Because the trains are wider than the A42 trams, extra warning stripes were placed along the platforms to warn passengers of the height/width difference in alighting and boarding.     The operation suffered from frequent signal interference caused by malfunctioning axle counters and/or ATP-NG-train security. Soon the RGL got a bad reputation because of the cancellation of a large number of journeys. However the number of passengers per day, around 42, during the period 4242 was stable, despite a large increase in many other rail routes in the Randstad. The six light rail vehicles purchased for the test eventually proved inadequate, also because of the large number of problems they faced.         In August 42 it was announced that the proposed precursor of the RGL on the Gouda-Alphen route would disappear as of 42 December 42 because using only ": null
    },
    {
        "Sprinter": "sprinters"
    }
]