[
    {
        "      thumb": "image:kent town rivers.svg"
    },
    {
        "     The River Stour  is a river in ": null
    },
    {
        "Kent": "kent"
    },
    {
        ", England that flows into the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " at ": null
    },
    {
        "Pegwell Bay": "pegwell bay"
    },
    {
        ". Above ": null
    },
    {
        "Plucks Gutter": "plucks gutter"
    },
    {
        ", where the ": null
    },
    {
        "Little Stour": "little stour"
    },
    {
        " joins it, the river is normally known as the Great Stour. The upper section of the river, above its ": null
    },
    {
        "confluence": "confluence"
    },
    {
        " with the ": null
    },
    {
        "East Stour": "east stour, kent"
    },
    {
        " at ": null
    },
    {
        "Ashford": "ashford, kent"
    },
    {
        " is sometimes known as the Upper Great Stour or West Stour. In the tidal lower reaches, the artificial Stonar Cut short cuts a large loop in the natural river.     The Stour has Kents second largest catchment area . The lower part of the river is tidal; its original mouth was on the ": null
    },
    {
        "Wantsum Channel": "wantsum channel"
    },
    {
        ", an important sea route in medieval times. The river has three major tributaries, and many minor ones. For much of its length it flows in a generally south-west to north-east direction.     The historic city of ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        " is situated on the river, as are the former ": null
    },
    {
        "Cinque Port": "cinque ports"
    },
    {
        " of ": null
    },
    {
        "Sandwich": "sandwich, kent"
    },
    {
        " and the ": null
    },
    {
        "railway town": "railway town"
    },
    {
        " of ": null
    },
    {
        "Ashford": "ashford, kent"
    },
    {
        ". The route of the ": null
    },
    {
        "Stour Valley Walk": "stour valley walk"
    },
    {
        " follows the river.                                      The source, of what is known at that point as the Great Stour, is near the village of ": null
    },
    {
        "Lenham": "lenham"
    },
    {
        ", within a short distance of the ": null
    },
    {
        "River Len": "river len"
    },
    {
        ", a tributary of the ": null
    },
    {
        "Medway": "river medway"
    },
    {
        ". The source is at a high elevation close to the North Downs escarpment. At first the river flows south east in a narrow valley parallel to the escarpment and the Greensand ridge to the south, before breaking through the ridge near Hothfield into a broad valley. Three small streams enter from the north, having their headwaters on the close to Downs escarpment. Flood defences can turn this valley into a large lake and an embankment has had to be built to prevent overflow into the Medway catchment barely 42 metres away to the south. The river turns north east by the village of Great Chart in the direction of its outlet to the sea.     The confluence with the ": null
    },
    {
        "East Stour": "east stour, kent"
    },
    {
        ", flowing from its source near ": null
    },
    {
        "Hythe": "hythe, kent"
    },
    {
        ", is to be found at Pledges Mill at the bottom of East Hill in Ashford.       The town of ": null
    },
    {
        "Ashford": "ashford, kent"
    },
    {
        " marks the start of the middle section of the river, sited at a crossing point of the river and on ancient track ways. In Ashford the river helps form part of the ": null
    },
    {
        "Ashford Green Corridor": "ashford green corridor"
    },
    {
        ".     After Ashford, the Stour breaches the ": null
    },
    {
        "North Downs": "north downs"
    },
    {
        "; for most of this distance there are no tributaries. After the Brook stream enters from the right there are now  to Canterbury. In this stretch the river flows through the villages of ": null
    },
    {
        "Wye": "wye, kent"
    },
    {
        ", ": null
    },
    {
        "Chilham": "chilham"
    },
    {
        " and ": null
    },
    {
        "Chartham": "chartham"
    },
    {
        ", with Wye being a fordable crossing.     The historic city of ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        " lies at the junction of four branches of the ": null
    },
    {
        "Roman road": "roman road"
    },
    {
        " Watling Street": "watling street"
    },
    {
        " which connected Canterbury with ports around the Kent coast – Lympne, Dover, Richborough and Reculver. Within the city the river flows in two channels, one through the centre of the city, and the other to the north of the city walls. The two channels rejoin to the east of Canterbury, before the river reaches ": null
    },
    {
        "Fordwich": "fordwich"
    },
    {
        ", a former ": null
    },
    {
        "outport": "outport"
    },
    {
        " of Canterbury and the current tidal limit of the river.     Beyond Fordwich, the river passes between several former ": null
    },
    {
        "gravel pit": "gravel pit"
    },
    {
        "s and through the ": null
    },
    {
        "reed bed": "reed bed"
    },
    {
        "s of the ": null
    },
    {
        "Stodmarsh National Nature Reserve": "stodmarsh national nature reserve"
    },
    {
        ". Beyond the nature reserve lies the open farmland on the reclaimed marshes surrounding the river crossing at ": null
    },
    {
        "Grove Ferry Picnic Area": "grove ferry picnic area"
    },
    {
        ", near the hamlet of ": null
    },
    {
        "Upstreet": "upstreet"
    },
    {
        ".      At the hamlet of ": null
    },
    {
        "Plucks Gutter": "plucks gutter"
    },
    {
        ", the second of the large tributaries enters the main river: the  long ": null
    },
    {
        "Little Stour": "little stour"
    },
    {
        ", which begins life as the spring fed Nailbourne stream. From here on the river is normally known as the River Stour.       The twin villages in the parish of ": null
    },
    {
        "Stourmouth": "stourmouth"
    },
    {
        " mark the original point where the Stour entered the erstwhile ": null
    },
    {
        "Wantsum Channel": "wantsum channel"
    },
    {
        ", a ": null
    },
    {
        "strait": "strait"
    },
    {
        " used for hundreds of years until silting and land reclamation turned the sea channel into a large drainage ditch. At this point the third large tributary, the 42-mile ": null
    },
    {
        "Sarre Penn": "sarre penn"
    },
    {
        " enters with the Wantsum Channel.     Here the river turns southwards to the once-thriving port of ": null
    },
    {
        "Sandwich": "sandwich, kent"
    },
    {
        ", after which it loops back on itself to the north before entering the ": null
    },
    {
        "Strait of Dover": "strait of dover"
    },
    {
        " at ": null
    },
    {
        "Pegwell Bay": "pegwell bay"
    },
    {
        ". The Stonar Cut obviates the need for seagoing craft to take the longer route around the loop at Sandwich.      From the tidal limit at Fordwich to the sea the river is fringed with marshes. Most of them are located on what was the floor of the Wantsum Channel, whilst those to the south lie behind the sand dunes of the Sandwich Flats. These marshes are criss-crossed with drainage ditches. The principal marshes are those of Chislet, within the ancient estuary of the river; Wade, west of ": null
    },
    {
        "Birchington": "birchington"
    },
    {
        "; and Ash Level.       In the mid42th century it became necessary to alleviate the problem of flooding along the lower course of the Stour. The action of tidal drift of shingle along the coast had resulted in the huge loop at the estuary end of the river, and on 42 November 42 an ": null
    },
    {
        "Act of Parliament": "act of parliament"
    },
    {
        " was enacted to bypass the loop at it narrowest end, at ": null
    },
    {
        "Stonar": "stonar"
    },
    {
        ". The works, to become known as the Stonar Cut, made use of an existing sluice to cut across the neck of the loop, and were completed in 42     During ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " huge volumes of both troops and supplies were needed on the Continent and, in the utmost secrecy, a new port was built at ": null
    },
    {
        "Richborough": "richborough"
    },
    {
        ". Landing facilities along the Cut were built, and the ": null
    },
    {
        "East Kent Light Railway": "east kent light railway"
    },
    {
        " was extended to service the port. Nothing now remains of much of those works, and the Cut has been allowed to return to its natural state.             Notes   tributaries of the East Stour   or Spiders Castle Dyke Pen Lee    In Roman and medieval times the river was an important highway, connecting Canterbury with the Continent. Fordwich became important to shipping after the silting up of the southern entrance to the English Channel.     In 42 Joseph Priestley wrote his ’Historical Account of the Navigable Rivers, Canals and Railways’.  In it he described in one section the ’Canterbury Navigation, or River Stour’. He includes an account of its course and the improvements being carried out at that time to assist navigation, and details of new port facilities.              Man has used the River Stour and its tributaries for centuries as a source of power. Many different processes were performed by the use of water power:- Corn milling, fulling, paper making and electricity generation. Many of the mills survive today as house conversions, with two of them still working commercially.       Both roads and railways make use of the river. The Watling Street link to ": null
    },
    {
        "Richborough": "richborough"
    },
    {
        " and their link from Canterbury southwards made use of the North Downs gap. The rail links from Canterbury to the ": null
    },
    {
        "Isle of Thanet": "isle of thanet"
    },
    {
        " and also to ": null
    },
    {
        "Ashford": "ashford, kent"
    },
    {
        ", and the main ": null
    },
    {
        "A42 road": "a28 road"
    },
    {
        " follow identical routes.     The 42-mile ": null
    },
    {
        "Stour Valley Walk": "stour valley walk"
    },
    {
        " follows the river for much of its length.       The Great Stour ": null
    },
    {
        "estuary": "estuary"
    },
    {
        " at Plucks Gutter and Grove Ferry is renowned for its coarse fishing, particularly ": null
    },
    {
        "bream": "bream"
    },
    {
        " stocks.          The lower-lying parts of Canterbury have in the past been particularly prone to flooding . The River Stour Internal Drainage Board has the responsibility of reducing that risk in the river catchment area           In 42 male fish were found with signs of ": null
    },
    {
        " feminisation ": "endocrine system"
    },
    {
        " after having been exposed to treated ": null
    },
    {
        "sewage": "wastewater"
    },
    {
        " effluent": "effluent"
    },
    {
        " in the river near Ashford. It was found that ": null
    },
    {
        "oestrogen": "estrogen"
    },
    {
        " enters the river when the nearby Bybrook sewage works discharges its end product.      In 42 ": null
    },
    {
        "Southern Water": "southern water"
    },
    {
        " started work on a £42  million environmental improvement project at its Lenham treatment works to ensure wastewater is treated to higher standards. New reed beds, containing more than 42 reeds, will help clean up to 42  million litres of wastewater from more than 42 people each day.       In 42 ": null
    },
    {
        "The Marine Group": "the marine group"
    }
]