[
    {
        "     RNA splicing, in ": null
    },
    {
        "molecular biology": "Molecular Biology"
    },
    {
        ", is a form of RNA processing in which a newly made ": null
    },
    {
        "precursor messenger RNA": "Precursor Messenger Rna"
    },
    {
        "  transcript": "Transcription"
    },
    {
        " is transformed into a ": null
    },
    {
        "mature messenger RNA": "Mature Messenger Rna"
    },
    {
        " . During splicing, ": null
    },
    {
        "introns": "Intron"
    },
    {
        " are removed and ": null
    },
    {
        "exons": "Exon"
    },
    {
        " are joined together. For ": null
    },
    {
        "nuclear-encoded genes": "Nuclear Genes"
    },
    {
        ", splicing takes place within the ": null
    },
    {
        "nucleus": "Cell Nucleus"
    },
    {
        " either during or immediately after ": null
    },
    {
        "transcription": "Transcription"
    },
    {
        ". For those ": null
    },
    {
        "eukaryotic genes": "Eukaryotic Transcription"
    },
    {
        " that contain introns, splicing is usually required in order to create an mRNA molecule that can be ": null
    },
    {
        "translated into protein": "Translation"
    },
    {
        ". For many eukaryotic introns, splicing is carried out in a series of reactions which are catalyzed by the ": null
    },
    {
        "spliceosome": "Spliceosome"
    },
    {
        ", a complex of small nuclear ribonucleo proteins . ": null
    },
    {
        "Self-splicing intron": "Self-Splicing Intron"
    },
    {
        "s, or ": null
    },
    {
        "ribozymes": "Ribozyme"
    },
    {
        "capable of catalyzing their own excision from their parent RNA molecule, also exist.          Several methods of RNA splicing occur in nature; the type of splicing depends on the structure of the spliced intron and the ": null
    },
    {
        "catalysts": "Catalyst"
    },
    {
        "required for splicing to occur.           The word intron is derived from the terms intragenic region,  and intracistron,  that is, a segment of DNA that is located between two exons of a ": null
    },
    {
        "gene": "Gene"
    },
    {
        ". The term intron refers to both the DNA sequence within a gene and the corresponding sequence in the unprocessed RNA transcript. As part of the RNA processing pathway, introns are removed by RNA splicing either shortly after or concurrent with ": null
    },
    {
        "transcription": "Transcription"
    },
    {
        ".  Introns are found in the genes of most organisms and many viruses. They can be located in a wide range of genes, including those that generate ": null
    },
    {
        "proteins": "Proteins"
    },
    {
        ", ": null
    },
    {
        "ribosomal RNA": "Ribosomal Rna"
    },
    {
        " , and ": null
    },
    {
        "transfer RNA": "Transfer Rna"
    },
    {
        " .      Within introns, a donor site , a branch site and an acceptor site are required for splicing. The splice donor site includes an almost invariant sequence GU at the 5 end of the intron, within a larger, less highly conserved region. The splice acceptor site at the 3 end of the intron terminates the intron with an almost invariant AG sequence. Upstream from the AG there is a region high in ": null
    },
    {
        "pyrimidines": "Pyrimidine"
    },
    {
        ", or ": null
    },
    {
        "polypyrimidine tract": "Polypyrimidine Tract"
    },
    {
        ". Further upstream from the polypyrimidine tract is the branchpoint, which includes an adenine nucleotide involved in lariat formation.   The consensus sequence for an intron  is: G-G- G-U-R-A-G-U ... intron sequence ... Y-U-R-A-C ... Y-rich-N-C-A-G- G .  However, it is noted that the specific sequence of intronic splicing elements and the number of nucleotides between the branchpoint and the nearest 3’ acceptor site affect splice site selection.   Also, point mutations in the underlying DNA or errors during transcription can activate a cryptic splice site in part of the transcript that usually is not spliced. This results in a ": null
    },
    {
        "mature messenger RNA": "Mature Messenger Rna"
    },
    {
        " with a missing section of an exon. In this way, a ": null
    },
    {
        "point mutation": "Point Mutation"
    },
    {
        ", which might otherwise affect only a single amino acid, can manifest as a ": null
    },
    {
        "deletion": "Indel"
    },
    {
        " or truncation in the final protein.          Splicing is catalyzed by the ": null
    },
    {
        "spliceosome": "Spliceosome"
    },
    {
        ", a large RNA-protein complex composed of five small nuclear ribonucleoproteins . Assembly and activity of the spliceosome occurs during transcription of the pre-mRNA. The RNA components of snRNPs interact with the intron and are involved in catalysis. Two types of spliceosomes have been identified which contain different ": null
    },
    {
        "snRNP": "Snrnp"
    },
    {
        "s.     The major spliceosome splices introns containing GU at the 5 splice site and AG at the 3 splice site. It is composed of the ": null
    },
    {
        "U1": "U1 Spliceosomal Rna"
    },
    {
        ", ": null
    },
    {
        "U2": "U2 Spliceosomal Rna"
    },
    {
        ", ": null
    },
    {
        "U4": "U4 Spliceosomal Rna"
    },
    {
        ", ": null
    },
    {
        "U5": "U5 Spliceosomal Rna"
    },
    {
        ", and ": null
    },
    {
        "U6": "U6 Spliceosomal Rna"
    },
    {
        "snRNPs": "Snrnp"
    },
    {
        "and is active in the nucleus. In addition, a number of proteins including ": null
    },
    {
        "U2 small nuclear RNA auxiliary factor 1": "U2 Small Nuclear Rna Auxiliary Factor 1"
    },
    {
        " , ": null
    },
    {
        "U2AF2": "U2Af2"
    },
    {
        "  and ": null
    },
    {
        "SF1": "Sf1"
    },
    {
        " are required for the assembly of the spliceosome.  The spliceosome forms different complexes during the splicing process:      :Complex E   :The U1 snRNP binds to the GU sequence at the 5 splice site of an intron;   :": null
    },
    {
        "Splicing factor 1": "Sf1"
    },
    {
        " binds to the intron branch point sequence;   :U2AF1 binds at the 3 splice site of the intron;   :": null
    },
    {
        "U2AF2": "U2Af2"
    },
    {
        " binds to the polypyrimidine tract;      :Complex A   :The U2 snRNP displaces SF1 and binds to the branch point sequence and ATP is hydrolyzed;     :Complex B   :The U5/U4/U6 snRNP trimer binds, and the U5 snRNP binds exons at the 5 site, with U6 binding to U2;     :Complex B   :The U1 snRNP is released, U5 shifts from exon to intron, and the U6 binds at the 5 splice site;     :Complex C   :U4 is released, U6/U2 catalyzes transesterification, making the 5-end of the intron ligate to the A on intron and form a lariat, U5 binds exon at 3 splice site, and the 5 site is cleaved, resulting in the formation of the lariat;     :Complex C   :U2/U5/U6 remain bound to the lariat, and the 3 site is cleaved and exons are ligated using ATP hydrolysis. The spliced RNA is released, the lariat is released and degraded,  and the snRNPs are recycled.     :This type of splicing is termed canonical splicing or termed the lariat pathway, which accounts for more than 99% of splicing. By contrast, when the intronic flanking sequences do not follow the GU-AG rule, noncanonical splicing is said to occur .      The  minor spliceosome  is very similar to the major spliceosome, but instead it splices out rare introns with different splice site sequences. While the minor and major spliceosomes contain the same U5 ": null
    },
    {
        "snRNP": "Snrnp"
    },
    {
        ", the minor spliceosome has different but functionally analogous snRNPs for U1, U2, U4, and U6, which are respectively called ": null
    },
    {
        "U11": "U11 Spliceosomal Rna"
    },
    {
        ", ": null
    },
    {
        "U12": "U12 Minor Spliceosomal Rna"
    },
    {
        ", ": null
    },
    {
        "U4atac": "U4Atac Minor Spliceosomal Rna"
    },
    {
        ", and ": null
    },
    {
        "U6atac": "U6Atac Minor Spliceosomal Rna"
    },
    {
        ".        In most cases, splicing removes introns as single units from precursor ": null
    },
    {
        "mRNA": "Messenger Rna"
    },
    {
        " transcripts. However, in some cases, especially in mRNAs with very long introns, splicing happens in steps, with part of an intron removed and then the remaining intron is spliced out in a following step. This has been found first in the  Ultrabithorax   gene of the fruit fly,  Drosophila melanogaster , and a few other Drosophila genes, but cases in human have been reported as well.         ": null
    },
    {
        "Trans-splicing": "Trans-Splicing"
    },
    {
        " is a form of splicing that removes introns or ": null
    },
    {
        "outron": "Outron"
    },
    {
        "s, and joins two exons that are not within the same RNA transcript.         Self-splicing occurs for rare introns that form a ": null
    },
    {
        "ribozyme": "Ribozyme"
    },
    {
        ", performing the functions of the spliceosome by RNA alone. There are three kinds of self-splicing introns,  Group I ,  Group II  and  Group III . Group I and II introns perform splicing similar to the spliceosome without requiring any protein. This similarity suggests that Group I and II introns may be evolutionarily related to the spliceosome. Self-splicing may also be very ancient, and may have existed in an ": null
    },
    {
        "RNA world": "Rna World"
    },
    {
        " present before protein.     Two transesterifications characterize the mechanism in which group I introns are spliced:   3OH of a free guanine nucleoside or a nucleotide cofactor attacks phosphate at the 5 splice site.   3OH of the 5 exon becomes a nucleophile and the second transesterification results in the joining of the two exons.     The mechanism in which group II introns are spliced is as follows:   The 2OH of a specific adenosine in the intron attacks the 5 splice site, thereby forming the lariat   The 3OH of the 5 exon triggers the second transesterification at the 3 splice site, thereby joining the exons together.       ": null
    },
    {
        "tRNA": "Trna"
    },
    {
        " splicing is another rare form of splicing that usually occurs in tRNA. The splicing reaction involves a different biochemistry than the spliceosomal and self-splicing pathways.     In the ": null
    },
    {
        "yeast": "Yeast"
    },
    {
        "  Saccharomyces cerevisiae , a yeast tRNA splicing ": null
    },
    {
        "endonuclease": "Endonuclease"
    },
    {
        " heterotetramer, composed of ": null
    },
    {
        "TSEN54": "Tsen54"
    },
    {
        ", ": null
    },
    {
        "TSEN2": "Tsen2"
    },
    {
        ", ": null
    },
    {
        "TSEN34": "Tsen34"
    },
    {
        ", and ": null
    },
    {
        "TSEN15": "Tsen15"
    },
    {
        ", cleaves pre-tRNA at two sites in the acceptor loop to form a 5-half tRNA, terminating at a 2,3-cyclic phosphodiester group, and a 3-half tRNA, terminating at a 5-hydroxyl group, along with a discarded intron.  Yeast tRNA kinase then phosphorylates the 5-hydroxyl group using ": null
    },
    {
        "adenosine triphosphate": "Adenosine Triphosphate"
    },
    {
        ". Yeast tRNA cyclic phosphodiesterase cleaves the cyclic phosphodiester group to form a 2-phosphorylated 3 end. Yeast tRNA ligase adds an ": null
    },
    {
        "adenosine monophosphate": "Adenosine Monophosphate"
    },
    {
        " group to the 5 end of the 3-half and joins the two halves together.  NAD-dependent 2-phosphotransferase then removes the 2-phosphate group.         Splicing occurs in all the ": null
    },
    {
        "kingdoms": "Kingdom"
    },
    {
        "or ": null
    },
    {
        "domains": "Domain"
    },
    {
        "of life, however, the extent and types of splicing can be very different between the major divisions. ": null
    },
    {
        "Eukaryotes": "Eukaryote"
    },
    {
        "splice many protein-coding ": null
    },
    {
        "messenger RNAs": "Mrna"
    },
    {
        "and some ": null
    },
    {
        "non-coding RNA": "Non-Coding Rna"
    },
    {
        "s. ": null
    },
    {
        "Prokaryote": "Prokaryote"
    },
    {
        "s, on the other hand, splice rarely and mostly non-coding RNAs. Another important difference between these two groups of organisms is that prokaryotes completely lack the spliceosomal pathway.     Because spliceosomal introns are not conserved in all species, there is debate concerning when spliceosomal splicing evolved. Two models have been proposed: the intron late and intron early models .               Spliceosomal splicing and self-splicing involve a two-step biochemical process. Both steps involve ": null
    },
    {
        "transesterification": "Transesterification"
    },
    {
        " reactions that occur between RNA nucleotides. tRNA splicing, however, is an exception and does not occur by transesterification.      Spliceosomal and self-splicing transesterification reactions occur via two sequential transesterification reactions. First, the 2OH of a specific branchpoint nucleotide within the intron, defined during spliceosome assembly, performs a ": null
    },
    {
        "nucleophilic attack": "Nucleophilic Attack"
    },
    {
        " on the first nucleotide of the intron at the 5 splice site, forming the lariat intermediate. Second, the 3OH of the released 5 exon then performs a electrophilic attack at the first nucleotide following the last nucleotide of the intron at the 3 splice site, thus joining the exons and releasing the intron lariat.             In many cases, the splicing process can create a range of unique proteins by varying the exon composition of the same mRNA. This phenomenon is then called ": null
    },
    {
        "alternative splicing": "Alternative Splicing"
    },
    {
        ". Alternative splicing can occur in many ways. Exons can be extended or skipped, or introns can be retained. It is estimated that 95% of transcripts from multiexon genes undergo alternative splicing, some instances of which occur in a tissue-specific manner and/or under specific cellular conditions.  Development of high throughput mRNA sequencing technology can help quantify the expression levels of alternatively spliced isoforms. Differential expression levels across tissues and cell lineages allowed computational approaches to be developed to predict the functions of these isoforms.     Given this complexity, alternative splicing of pre-mRNA transcripts is regulated by a system of trans-acting proteins that bind to cis-acting sites or elements on the pre-mRNA transcript itself. These proteins and their respective binding elements promote or reduce the usage of a particular splice site. The binding specificity comes from the sequence and structure of the cis-elements, e.g. in HIV-1 there are many donor and acceptor splice sites. Among the various splice sites, ssA7, which is 3 acceptor site, folds into three stem loop structures, i.e. Intronic splicing silencer , Exonic splicing enhancer , and Exonic splicing silencer . Solution structure of Intronic splicing silencer and its interaction to host protein hnRNPA1 give insight into specific recognition.  However, adding to the complexity of alternative splicing, it is noted that the effects of regulatory factors are many times position-dependent. For example, a splicing factor that serves as a splicing activator when bound to an intronic enhancer element may serve as a repressor when bound to its splicing element in the context of an exon, and vice versa.  In addition to the position-dependent effects of enhancer and silencer elements, the location of the branchpoint also affects splicing. The secondary structure of the pre-mRNA transcript also plays a role in regulating splicing, such as by bringing together splicing elements or by masking a sequence that would otherwise serve as a binding element for a splicing factor.           ": null
    },
    {
        "DNA damage": "Dna Damage"
    },
    {
        " affects splicing factors by altering their ": null
    },
    {
        "post-translational modification": "Post-Translational Modification"
    },
    {
        ", localization, expression and activity.  Furthermore, DNA damage often disrupts splicing by interfering with its coupling to ": null
    },
    {
        "transcription": "Transcription"
    },
    {
        ". DNA damage also has an impact on the splicing and alternative splicing of genes intimately associated with ": null
    },
    {
        "DNA repair": "Dna Repair"
    },
    {
        ". For instance, DNA damages modulate the alternative splicing of the DNA repair genes  Brca1  and  Ercc1 .       Splicing events can be experimentally altered   by binding steric-blocking antisense ": null
    },
    {
        "oligos": "Oligonucleotide"
    },
    {
        "such as ": null
    },
    {
        "Morpholinos": "Morpholino"
    },
    {
        "or ": null
    },
    {
        "Peptide nucleic acids": "Peptide Nucleic Acid"
    },
    {
        "to snRNP binding sites, to the branchpoint nucleotide that closes the lariat,  ": null
    },
    {
        "Split gene theory": "Split Gene Theory"
    },
    {
        " or to splice-regulatory element binding sites.        It has been suggested that one third of all disease-causing mutations impact on ": null
    },
    {
        "splicing": "Split Gene Theory"
    },
    {
        ". Common errors include:   Mutation of a splice site resulting in loss of function of that site. Results in exposure of a premature ": null
    },
    {
        "stop codon": "Stop Codon"
    },
    {
        ", loss of an exon, or inclusion of an intron.   Mutation of a splice site reducing specificity. May result in variation in the splice location, causing insertion or deletion of amino acids, or most likely, a disruption of the ": null
    },
    {
        "reading frame": "Reading Frame"
    },
    {
        ".   Displacement of a splice site, leading to inclusion or exclusion of more RNA than expected, resulting in longer or shorter exons.   Although many splicing errors are safeguarded by a cellular quality control mechanism termed ": null
    },
    {
        "nonsense-mediated mRNA decay": "Nonsense-Mediated Mrna Decay"
    },
    {
        " ,  a number of splicing-related diseases also exist, as suggested above.      Allelic differences in mRNA splicing are likely to be a common and important source of phenotypic diversity at the molecular level, in addition to their contribution to genetic disease susceptibility. Indeed, genome-wide studies in humans have identified a range of genes that are subject to allele-specific splicing.          In addition to RNA, proteins can undergo splicing. Although the biomolecular mechanisms are different, the principle is the same: parts of the protein, called ": null
    },
    {
        "inteins": "Intein"
    },
    {
        "instead of introns, are removed. The remaining parts, called ": null
    },
    {
        "exteins": "Extein"
    },
    {
        "instead of exons, are fused together.   Protein splicing has been observed in a wide range of organisms, including bacteria, ": null
    },
    {
        "archaea": "Archaea"
    },
    {
        ", plants, yeast and humans. ": null
    }
]