[
    {
        "      Robert Lowth   was a Bishop of the ": null
    },
    {
        "Church of England": "church of england"
    },
    {
        ", ": null
    },
    {
        "Oxford Professor of Poetry": "oxford professor of poetry"
    },
    {
        " and the author of one of the most influential ": null
    },
    {
        "   textbooks of English grammar": "history of english grammars"
    },
    {
        ".       Lowth was born in ": null
    },
    {
        "Hampshire": "hampshire"
    },
    {
        ", Great Britain, the son of Dr ": null
    },
    {
        "William Lowth": "william lowth"
    },
    {
        ", a clergyman and Biblical commentator. He was educated at ": null
    },
    {
        "Winchester College": "winchester college"
    },
    {
        " and became a scholar of ": null
    },
    {
        "New College, Oxford": "new college, oxford"
    },
    {
        " in 1729. Lowth obtained his ": null
    },
    {
        "BA": "bachelor of arts"
    },
    {
        " in 1733 and his ": null
    },
    {
        "Master of Arts": "master of arts"
    },
    {
        " degree in 1737. In 1735, while still at Oxford, Lowth took orders in the ": null
    },
    {
        "Anglican Church": "anglicanism"
    },
    {
        " and was appointed vicar of ": null
    },
    {
        "Ovington, Hampshire": "ovington, hampshire"
    },
    {
        ", a position he retained until 1741, when he was appointed ": null
    },
    {
        "Oxford Professor of Poetry": "oxford professor of poetry"
    },
    {
        ".     Bishop Lowth made a translation of the book of Isaiah, first published in 1778. The ": null
    },
    {
        "Seventh-day Adventist": "seventh-day adventist"
    },
    {
        " theologian ": null
    },
    {
        "E. J. Waggoner": "ellet j. waggoner"
    },
    {
        " said in 1899 that Lowths translation of ": null
    },
    {
        "Isaiah": "book of isaiah"
    },
    {
        " was without doubt, as a whole, the best English translation of the prophecy of ": null
    },
    {
        "Isaiah": "isaiah"
    },
    {
        " .     In 1750 he was appointed ": null
    },
    {
        "Archdeacon of Winchester": "archdeacon of bournemouth"
    },
    {
        ". In 1752 he resigned the professorship at Oxford and married Mary Jackson. Shortly afterwards, in 1753, Lowth was appointed ": null
    },
    {
        "rector": "rector"
    },
    {
        " of ": null
    },
    {
        "East Woodhay": "east woodhay"
    },
    {
        ". In 1754 he was awarded a ": null
    },
    {
        "Doctorate in Divinity": "doctor of divinity"
    },
    {
        " by Oxford University, for his treatise on ": null
    },
    {
        "Hebrew poetry": "biblical poetry"
    },
    {
        " entitled Praelectiones Academicae de Sacra Poesi Hebraeorum . This derives from a series of lectures and was originally published in Latin. An English translation was published by ": null
    },
    {
        "George Gregory": "george gregory"
    },
    {
        " in 1787 as  Lectures on the Sacred Poetry of the Hebrews . This and subsequent editions include the life of Bishop Lowth as a preface. There was a further edition issued in 1815. This was republished in North America in 1829 with some additional notes. However, apart from those notes, the 1829 edition is less useful to a modern reader. This is because the editor of that edition chose to revert to citing many of the scriptural passages that Lowth uses as examples, and some of the annotations by Michaelis  and others, in Latin.     Lowth was appointed a fellow of the ": null
    },
    {
        "Royal Societies": "royal society"
    },
    {
        " of London and ": null
    },
    {
        "Göttingen": "göttingen"
    },
    {
        " in 1765. He was consecrated ": null
    },
    {
        "bishop of St Davids": "bishop of st davids"
    },
    {
        " in 1766; however, before the end of the year he was transferred to the ": null
    },
    {
        "see of Oxford": "bishop of oxford"
    },
    {
        ". He remained Bishop of Oxford until 1777 when he was appointed ": null
    },
    {
        "Bishop of London": "bishop of london"
    },
    {
        " as well as ": null
    },
    {
        "dean of the chapel royal": "dean of the chapel royal"
    },
    {
        " and ": null
    },
    {
        "privy councillor": "privy councillor"
    },
    {
        ". In 1783 he was offered the chance to become ": null
    },
    {
        "Archbishop of Canterbury": "archbishop of canterbury"
    },
    {
        ", but declined due to failing health.     Lowth was good friends with the ": null
    },
    {
        "Scottish Enlightenment": "scottish enlightenment"
    },
    {
        " figure ": null
    },
    {
        "David Hume": "david hume"
    },
    {
        ", as noted by the prominent Scottish bookseller ": null
    },
    {
        "Andrew Millar": "andrew millar"
    },
    {
        ". Millar commented that Hume and he are very great, tho one orthodox and ye other Heterodox .         Lowth wrote a Latin epitaph, Cara, Vale on the death of his daughter Maria. Much admired in the late 18th and early 19th centuries, it was set to music by the English composer ": null
    },
    {
        "John Wall Callcott": "john wall callcott"
    },
    {
        ". From New England Magazine, 1834 , accessed 20 February 2018          Lowth died in 1787, and was buried in the churchyard of ": null
    },
    {
        "All Saints Church, Fulham": "all saints church, fulham"
    },
    {
        ".       Lowth seems to have been the first modern Bible scholar to notice or draw attention to the poetic structure of the ": null
    },
    {
        "Psalms": "psalms"
    },
    {
        " and much of the prophetic literature of the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        ". In Lecture 19 he sets out the classic statement of ": null
    },
    {
        "parallelism": "parallelism"
    },
    {
        ", which remains the most fundamental category for understanding Hebrew poetry. He identifies three forms of parallelism, the synonymous, antithetic and synthetic . This idea has been influential in Old Testament Studies to the present day.       Lowth is also remembered for his publication in 1762 of A Short Introduction to English Grammar. Prompted by the absence of simple and ": null
    },
    {
        "pedagogical": "pedagogy"
    },
    {
        " grammar": "grammar"
    },
    {
        " textbooks in his day, Lowth set out to remedy the situation. Lowths grammar is the source of many of the prescriptive ": null
    },
    {
        "shibboleths": "shibboleth"
    },
    {
        "that are studied in schools, and established him as the first of a long line of usage commentators who judge the English language in addition to describing it. An example of both is one of his footnotes: Whose is by some authors made the ": null
    },
    {
        "possessive case": "possessive case"
    },
    {
        " of which, and applied to things as well as persons; I think, improperly.     His most famous contribution to the study of grammar may have been his tentative suggestion that sentences ending with a ": null
    },
    {
        "preposition": "preposition"
    },
    {
        "—such as what did you ask for? —are inappropriate in formal writing.  In what may have been intentional ": null
    },
    {
        "self-reference": "self-reference"
    },
    {
        ", Lowth used that very construction in discussing it. This is an Idiom which our language is strongly inclined to; it prevails in common conversation, and suits very well with the familiar style in writing; but the placing of the Preposition before the Relative is more graceful, as well as more perspicuous; and agrees much better with the solemn and elevated Style. ": null
    },
    {
        "2": "robert lowthnotes"
    },
    {
        " Others had previously expressed this opinion; the earliest known is ": null
    },
    {
        "John Dryden": "john dryden"
    },
    {
        " in 1672.     Lowths method included criticising false syntax ; his examples of false syntax were culled from Shakespeare, the ": null
    },
    {
        "King James Bible": "king james version of the bible"
    },
    {
        ", ": null
    },
    {
        "John Donne": "john donne"
    },
    {
        ", ": null
    },
    {
        "John Milton": "john milton"
    },
    {
        ", ": null
    },
    {
        "Jonathan Swift": "jonathan swift"
    },
    {
        ", ": null
    },
    {
        "Alexander Pope": "alexander pope"
    },
    {
        ", and other famous writers. His understanding of grammar, like that of all linguists of his period, was influenced by the study of ": null
    },
    {
        "Latin": "latin"
    },
    {
        ", though he was aware that this was problematic and condemned forcing the English under the rules of a foreign Language ": null
    },
    {
        "1": "robert lowthnotes"
    },
    {
        " . Thus Lowth condemns ": null
    },
    {
        "Addisons": "joseph addison"
    },
    {
        "sentence Who should I meet the other night, but my old friend? on the grounds that the thing acted upon should be in the Objective Case , rather than taking this example and others as evidence from noted writers that who can refer to direct objects.     Lowths dogmatic assertions appealed to those who wished for certainty and authority in their language. Lowths grammar was not written for children; however, within a decade after it appeared, versions of it adapted for the use of schools had appeared, and Lowths stylistic opinions acquired the force of law in the schoolroom. The textbook remained in standard usage throughout educational institutions until the early 20th century.          Lowth has been regarded as the first imagery critic of Shakespeares plays and highlighted the importance of the imagery in the interpretation of motives and actions of characters and dramatic movement of the plot and narrative structure. ": null
    },
    {
        "3": "robert lowthnotes"
    }
]