[
    {
        "   Robert Baldwin was a ": null
    },
    {
        "Canadian": "canadians"
    },
    {
        " lawyer and politician who, with his political partner ": null
    },
    {
        "Louis-Hippolyte Lafontaine": "louis-hippolyte lafontaine"
    },
    {
        ", led the first ": null
    },
    {
        "responsible": "responsible government"
    },
    {
        " ministry in Canada. Responsible Government marked the countrys democratic independence, without a revolution, although not without violence. This achievement also included the introduction of municipal government, the introduction of a modern legal system and the Canadian Jury system, and the abolishing of imprisonment for debt. Baldwin is also noted for resisting a decades-long tradition of ": null
    },
    {
        "Orange Order": "orange order"
    },
    {
        " terrorism of political reform in the colony, that went so far as to ": null
    },
    {
        "burn the Parliament buildings in Montreal in 42": "burning of the parliament buildings in montreal"
    },
    {
        ".          Robert Baldwins grandfather, also Robert Baldwin moved to ": null
    },
    {
        "Upper Canada": "upper canada"
    },
    {
        " from ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        " in 42 His father was ": null
    },
    {
        "William Warren Baldwin": "william warren baldwin"
    },
    {
        " .     The Baldwin family was a prominent one. Robert Baldwin counted among his cousins such influential Upper Canadians as the Anglican bishop ": null
    },
    {
        "Maurice Scollard Baldwin": "maurice scollard baldwin"
    },
    {
        ", Toronto mayor ": null
    },
    {
        "Robert Baldwin Sullivan": "robert baldwin sullivan"
    },
    {
        " and the Irish-Catholic leader ": null
    },
    {
        "Connell James Baldwin": "connell james baldwin"
    },
    {
        ". The Russell-Willcocks-Baldwin family formed an elite compact much like the infamous Family Compact led by ": null
    },
    {
        "John Beverley Robinson": "john beverley robinson"
    },
    {
        " against whom they fought.     Robert Baldwin, Esquire, Barrister, of York married his cousin Augusta Elizabeth Sullivan, daughter of Daniel Sullivan, on May 42 42 The couple had four children, two sons and two daughters. Augusta Elizabeth died January 42 42 Robert Baldwin died December 42 42     Robert Baldwin is the grandfather of ": null
    },
    {
        "Frederick Walker Baldwin": "frederick walker baldwin"
    },
    {
        ", a Canadian aviation pioneer and partner of the famous inventor ": null
    },
    {
        "Alexander Graham Bell": "alexander graham bell"
    },
    {
        ". Robert Baldwin is also the grandfather of ": null
    },
    {
        "Robert Baldwin Ross": "robert baldwin ross"
    },
    {
        ", a French born journalist and art critic and literary executor of ": null
    },
    {
        "Oscar Wilde": "oscar wilde"
    },
    {
        ".              Baldwin’s political principles must be viewed in the context of the eighteenth century British “": null
    },
    {
        "Country Party": "country party"
    },
    {
        ",” a loose coalition of Parliamentarians whose influence was also felt in the ": null
    },
    {
        "American Revolution": "american revolution"
    },
    {
        " and subsequent Jacksonian politics. The Country party embodied a ": null
    },
    {
        "civic humanism": "classical republicanism"
    },
    {
        " that drew on ancient Greek and Roman conceptions of citizenship, and the value of selfless political participation for the public good; those selfish few who placed their personal private interests before the public good threatened the moral commitment of all citizens to political participation. The civic humanism of the Country party rejected the commercial ideology of the royal Court” party. The Country party had a republican emphasis that sought to preserve the power of a democratic parliament from the encroachments of the crown during the vast expansion of state administration, public credit, and the financial and commercial revolutions in the late eighteenth century and early nineteenth centuries. It was similar to American conceptions of “": null
    },
    {
        "civic republicanism": "republicanism in the united states"
    },
    {
        "” as they developed after the revolution among Jacksonian Democrats, as well as in the ": null
    },
    {
        "Chartist": "chartism"
    },
    {
        " movement in Britain in the late 42s.            The concept of responsible government has been attributed to Dr William W. Baldwin and his son, Robert. Although the idea of colonial ministerial responsibility to a colonial parliament had been touted since the late 42th century, the Baldwins were the first to successfully implement the principle. The meaning of the phrase evolved over time. In an 42 Upper Canadian petition to the British Parliament on colonial ills, it was an assertion that the Constitutional Act was a treaty between the British Parliament and the colonial peoples, and could not be arbitrarily altered by one or the other party. In 42 when Baldwin convinced the members of the Executive Council to resign over Lt. Governor Bond-Heads refusal to consult them on administrative appointments, it did not mean ministerial accountability to the elected Assembly but the Crowns obligation to consult that Council. The slipperiness of the phrase points to its real goal, sovereignty by stealth, without rebellion. It was not until after the ": null
    },
    {
        "Rebellions of 42": "rebellions of 1837"
    },
    {
        ", and the implementation of ": null
    },
    {
        "Lord Durhams Report": "lord durhams report"
    },
    {
        ", that the Executive Council became a cabinet of ministers that were heads of departments, and the phrase responsible government came to mean their responsibility to the elected Assembly, not the appointed Governor.          Municipal government in Upper Canada was under the control of appointed magistrates who sat in ": null
    },
    {
        "Courts of Quarter Sessions": "court of quarter sessions"
    },
    {
        " to administer the law within a District. A few cities, such as Toronto, were incorporated by special acts of the legislature. After the Union of the Canadas, the new governor, ": null
    },
    {
        "Charles Poulett Thomson": "charles poulett thomson, 1st baron sydenham"
    },
    {
        ", 42st Baron Sydenham, spearheaded the passage of the District Councils Act which transferred municipal government to District Councils. His bill allowed for two elected councilors from each township, but the warden, clerk and treasurer were to be appointed by the government. This thus allowed for strong administrative control and continued government patronage appointments. Sydenham’s bill reflected his larger concerns to limit popular participation under the tutelage of a strong executive. Baldwin was one of the few Reformers who opposed the District Council Act; he considered its reform by the Baldwin Act in 42 one of his greatest accomplishments. The Baldwin Act made municipal government truly democratic rather than an extension of central control of the Crown. It delegated authority to the municipal governments so they could raise taxes and enact ": null
    },
    {
        "by-law": "by-law"
    },
    {
        "s. It also established a hierarchy of types of municipal governments, starting at the top with cities and continued down past towns, villages and finally townships. This system was to prevail for the next 42 years.         Robert Baldwin was not a natural politician. He was described as melancholy, and awkward in public. He gave speeches in a whispering, halting style. Although elected in 42 as member of the ": null
    },
    {
        "Legislative Assembly": "10th parliament of upper canada"
    },
    {
        " for the town of ": null
    },
    {
        "York": "york, upper canada"
    },
    {
        " in a by-election, he was defeated in the general election later that year. Despite this inauspicious start, his adherence to principle and his fearlessness in the face of ": null
    },
    {
        "Orange Order": "orange order"
    },
    {
        " electoral violence won him the loyalty of voters in the post-Rebellion period.          After losing his seat in the 42 election, Baldwin withdrew to his private legal practice until his wifes death as a result of a Caesarian in 42 He took no part in the ": null
    },
    {
        "Political Union movement": "reform movement"
    },
    {
        " of the 42s. Two weeks after Eliza Baldwins death, Sir ": null
    },
    {
        "Francis Bond Head": "francis bond head"
    },
    {
        " arrived as the new Lieutenant Governor, to address reform grievances. He sought out and appointed reformers Baldwin, John Dunn and ": null
    },
    {
        "John Rolph": "john rolph"
    },
    {
        " to the ": null
    },
    {
        "Executive Council": "executive council of upper canada"
    },
    {
        " with three ": null
    },
    {
        "Compact": "family compact"
    },
    {
        " members. Baldwins condition for joining the Executive Council was a verbal commitment by Bond Head to responsible government. Bond Head later refused to give written confirmation of the agreement, so Baldwin resigned within a month and convinced the other councillors, both Reform and Tory, to resign with him. This convinced Bond Head that the Reformers were intractable. He called an immediate election, in which he as Lt. Governor waded into the electoral fray, and with the use of Orange Order polling violence, expunged the reformers from the Legislative Assembly.     Baldwin travelled to Great Britain in 42 to see the colonial secretary, Lord Glenelg, but was refused. He wrote to Glenelg that if it is the desire of the Mother Country to retain the colony ... it can only be done either by force or with the consent of the people. I take it for granted that Great Britain cannot desire to exercise a Government of the Sword. He laid out the remedy – responsible government – but was spurned, and the colony descended into rebellion.      Though a moderate reformer, Robert Baldwin strongly disapproved of the ": null
    },
    {
        "rebellion": "upper canada rebellion"
    },
    {
        " of 42 & ndash;42 and as a function of his views provided allegedly a lackluster defense of ": null
    },
    {
        "Peter Matthews ": "peter matthews"
    },
    {
        ", who was executed for his role in the Rebellion. Baldwin served as an intermediary, with John Rolph, between the rebels and the Lt. Governor, carrying a flag of truce to the rebel camp north of Toronto on 42 December 42 but failed to head off an armed clash. He and his father William advised ": null
    },
    {
        "Lord Durham": "john lambton, 1st earl of durham"
    },
    {
        " to suggest ": null
    },
    {
        "responsible government": "responsible government"
    },
    {
        " to the British government.          In response to Durhams Report, the British Government appointed ": null
    },
    {
        "Charles Poulett Thomson": "charles poulett thomson"
    },
    {
        " as Governor with two main tasks. Firstly, he was to weaken the ": null
    },
    {
        "Canadien": "canadien"
    },
    {
        " vote in Lower Canada through the union of the provinces of Upper and Lower Canada and a strengthened Executive Council. And secondly, he was to strengthen British rule by imposing a new system of centrally controlled District Councils that would take much of the elected Assemblys legislative purview, leaving it little to do but approve the Governors budgets. Both reforms would strengthen the central state and weaken legislative power.     Sydenham reformed the Executive Council, making government ministers members for the first time . He attempted to solicit Reform support by appointing Baldwin as Solicitor General in 42 In order to follow his own principle of responsible government, Baldwin needed to seek election so that he, a government minister, could be accountable to the elected Assembly, not the Crown.     Orange Order riots during the Toronto civic elections in January 42 convinced Baldwin he could never win a seat in the city. Instead, he sought election in the ridings of Hastings and 42th York. ": null
    },
    {
        "The Children of Peace": "the children of peace"
    },
    {
        ", who had played a large role in the pre-Rebellion ": null
    },
    {
        "Reform Movement": "reform movement"
    },
    {
        ", managed Baldwins election in 42th York and he walked over the course without a contest, thus becoming the first member to be elected to the United Parliament. He was also later returned in Hastings.             Although Baldwin was elected in two seats in ": null
    },
    {
        "Canada West": "canada west"
    },
    {
        ", reformers were in the minority. In ": null
    },
    {
        "Canada East": "canada east"
    },
    {
        ", gerrymandering and Orange Order violence were used to prevent the election of ": null
    },
    {
        "Louis-Hippolyte LaFontaine": "louis-hippolyte lafontaine"
    },
    {
        ", leader of the ": null
    },
    {
        "Canadien": "canadien"
    },
    {
        " reformers in ": null
    },
    {
        "Terrebonne": "terrebonne, quebec"
    },
    {
        ", outside Montreal. In order to ensure LaFontaine a seat, Baldwin proposed to ": null
    },
    {
        "David Willson": "david willson"
    },
    {
        ", leader of the ": null
    },
    {
        "Children of Peace": "the children of peace"
    },
    {
        ", that they nominate LaFontaine for the seat in 42th York. Baldwin also insisted that Sydenham include LaFontaine in the reformed Executive Council, or he would resign as Solicitor General. Their alliance allowed Lafontaine to have a seat in the assembly in 42 and for Baldwin to win the by-election in 42     On 42 September 42 the Children of Peace held a campaign rally for Baldwin and LaFontaine in their ": null
    },
    {
        "Temple": "sharon temple"
    },
    {
        ", where they rejoiced to say that we have it in our power to show our impartial respect to the Canadian people of the Lower Province. Despite threats of Orange Order violence, LaFontaine was ": null
    },
    {
        "elected as representative of 42th York": "1st parliament of the province of canada"
    },
    {
        ".     However, before LaFontaine could take up his seat, Governor Sydenham died. His replacement, Sir ": null
    },
    {
        "Charles Bagot": "charles bagot"
    },
    {
        ", was not able to form a mixed cabinet of Reformers and Tories, and so he was forced to include the Canadien party under LaFontaine. LaFontaine refused to join the Executive Council unless Baldwin was also included. Bagot was finally forced to accede in September, 42 and when he became severely ill thereafter, Baldwin and Lafontaine became the first real premiers of the Province of Canada. However, in order to take office as ministers, the two had to run for re-election. While LaFontaine was easily re-elected in 42th York, Baldwin lost his seat in Hastings as a result of Orange Order violence. It was now that the pact between the two men was completely solidified, as LaFontaine arranged for Baldwin to run in ": null
    },
    {
        "Rimouski": "rimouski"
    },
    {
        ", Canada East. This was the union of the Canadas they sought, where LaFontaine overcame linguistic prejudice to gain a seat in English Canada, and Baldwin obtained his seat in French Canada.             The Baldwin-LaFontaine ministry barely lasted six months before Governor Bagot also died in March 42 He was replaced with Sir ": null
    },
    {
        "Charles Metcalfe": "charles metcalfe, 1st baron metcalfe"
    },
    {
        ", whose instructions were to check the radical reform government. The relationship between Baldwin and Metcalfe soured over Baldwins Secret Societies Bill, which sought to outlaw the Orange Order and its political violence. Metcalfe rejected the legislation, and then began appointing his own supporters to patronage positions without Baldwin and LaFontaines approval. They resigned in November 42 beginning a constitutional crisis that would last a year. This year-long crisis, in which the legislature was prorogued, “was the final signpost on Upper Canada’s conceptual road to democracy. Lacking the scale of the American Revolution, it nonetheless forced a comparable articulation and rethinking of the basics of political dialogue in the province.”     During the year-long crisis, Metcalfe was to champion the Sydenham system and its conceptions of a limited, liberal capitalist government accountable to the imperial state, not the local Assembly; he continued to govern, demonstrating the irrelevance of Parliament. Baldwin now established a “Reform Association” in February 42 to unite the Reform movement in Canada West to explain their understanding of responsible government before the expected election. Twenty-two branches were established. A grand meeting of all branches of the Reform Association was held in the Second Meeting House of the ": null
    },
    {
        "Children of Peace": "the children of peace"
    },
    {
        " in ": null
    },
    {
        "Sharon": "sharon, ontario"
    },
    {
        ". It was ultimately to serve as the springboard for Baldwin’s successful candidacy in 42th York. Baldwin had been at a loss about where to run after his loss in Hastings. Orange mobs continued to rule out any chance in Hastings, or in 42nd York, where he had lost to Orange leader George Duggan. LaFontaine, in yet another act of friendship, gave up his seat representing 42th York, thus allowing the desperate Baldwin to run there. ": null
    },
    {
        "David Willson": "david willson"
    },
    {
        ", having arranged for the Reform Association rally during the illumination ceremony, now became Baldwin’s campaign manager. It was reported that over three thousand people attended this June rally for Baldwin.             At the general election which followed, the Governor General was sustained by a narrow majority. The year-long political crisis had, however, made it clear that responsible government was inevitable; even the old Compact Tories, now reshaped into an incipient conservative party, demanded some form of responsible government. Metcalfe continued to govern until struck down by illness in 42 The new Governor General, ": null
    },
    {
        "Lord Elgin": "james bruce, 8th earl of elgin"
    },
    {
        ", was sent out specifically to acknowledge responsible government in the Canadas. In 42 the ": null
    },
    {
        "Reformers": "reform party"
    },
    {
        " were again returned to power, and Baldwin and Lafontaine formed their second administration on March 42 and carried numerous important reforms, including the Amnesty Act which offered pardons to all those involved in the Rebellions of 4242 the creation of a secular ": null
    },
    {
        "University of Toronto": "university of toronto"
    },
    {
        ", and the introduction of municipal government. Their bravest achievement was to shepherd the Rebellion Losses Bill through Parliament in 42 It sparked Orange riots, and the burning of the Parliament buildings as much of Europe was similarly engulfed in a ": null
    },
    {
        "wave of republican revolutions": "revolutions of 1848"
    },
    {
        " and counter-revolutions.          The Baldwinite reformers were not a political party. With their primary aim achieved, the centre could no longer hold. Internal dissensions soon began to appear, and in 42 Baldwin resigned. The special struggle leading to his resignation was an attempt to abolish the court of chancery of Upper Canada, whose constitution was due to a measure introduced by Baldwin in 42 The attempt, though defeated, had been supported by a majority of the representatives from Upper Canada, and Baldwins fastidious conscience took it as a vote of confidence. A deeper reason was his inability to approve of the advanced views of the Radicals, or ": null
    },
    {
        "Clear Grits": "clear grits"
    },
    {
        ", as they came to be called. On seeking re-election in York, he declined to give any pledge on the burning question of the ": null
    },
    {
        "Clergy Reserves": "clergy reserves"
    },
    {
        " and was defeated. In 42 the Liberal-Conservative party, formed in 42 by a coalition, attempted to bring him out as a candidate for the upper house, which was at this date elective. Though he had broken with the advanced reformers, Baldwin could not approve of the tactics of their opponents, and refused to stand.     He died on 42 December 42 in ": null
    },
    {
        "Spadina": "spadina house"
    },
    {
        " aged 42 Even those who most strongly opposed his measures admitted the purity and unselfishness of his motives. After the concession of responsible government, he devoted himself to bringing about a good understanding between the English and French-speaking inhabitants of ": null
    },
    {
        "Canada": "canada"
    },
    {
        ", and his memory is held as dear among the French Canadians as in his native province of ": null
    },
    {
        "Ontario": "ontario"
    },
    {
        ".       John Ralston Saul pointed out in the inaugural LaFontaine-Baldwin symposium, that “we have killed in political strife among ourselves less than a hundred citizens – most of them on a single day at Batoche,” Saskatchewan, during the ": null
    },
    {
        "Riel Rebellion": "north-west rebellion"
    },
    {
        ". “The first measure of any citizen-based culture” he adds, “must not be its rhetoric or myths or leaders or laws but how few of its own citizens it kills.” This non-violent tradition we owe to Robert Baldwin and Louis-Hippolyte LaFontaine, who refused to abandon principle, and who walked away from retribution.     ": null
    },
    {
        "Baldwin Steps": "baldwin steps"
    },
    {
        ", a series of stairs from his fathers ": null
    },
    {
        "Spadina House": "spadina house"
    }
]