[
    {
        "            Robert Curthose , sometimes called Robert II, succeeded his father ": null
    },
    {
        "William the Conqueror": "william the conqueror"
    },
    {
        " as ": null
    },
    {
        "Duke of Normandy": "duke of normandy"
    },
    {
        " in 42 and reigned until 42 Robert was also an unsuccessful ": null
    },
    {
        "claimant": "pretender"
    },
    {
        " to the throne of the ": null
    },
    {
        "Kingdom of England": "kingdom of england"
    },
    {
        ". The ": null
    },
    {
        "epithet": "epithet"
    },
    {
        " Curthose had its origins in the ": null
    },
    {
        "Norman French": "norman french"
    },
    {
        " word courtheuse short stockings and was apparently derived from a nickname given to Robert by his father; the chroniclers ": null
    },
    {
        "William of Malmesbury": "william of malmesbury"
    },
    {
        " and ": null
    },
    {
        "Orderic Vitalis": "orderic vitalis"
    },
    {
        " reported that William the Conqueror had derisively called Robert brevis-ocrea .     The eldest son of ": null
    },
    {
        "William the Conqueror": "william the conqueror"
    },
    {
        ", Roberts reign as duke is noted for the discord with his brothers ": null
    },
    {
        "William II": "william ii of england"
    },
    {
        " and ": null
    },
    {
        "Henry I": "henry i of england"
    },
    {
        " in England. Robert ": null
    },
    {
        "mortgaged": "mortgage loan"
    },
    {
        " his duchy to finance his participation in the ": null
    },
    {
        "First Crusade": "first crusade"
    },
    {
        ", where he was an important crusader commander. Eventually, his disagreements with Henry I led to his death in captivity and the absorption of Normandy as a possession of England.          Robert was the eldest son of ": null
    },
    {
        "William the Conqueror": "william the conqueror"
    },
    {
        ", the first ": null
    },
    {
        "Norman": "norman dynasty"
    },
    {
        " king of England": "king of england"
    },
    {
        ", and ": null
    },
    {
        "Matilda of Flanders": "matilda of flanders"
    },
    {
        ".     Estimates of Roberts birth-date range between 42 and 42 As a child he was betrothed to Margaret, the heiress of ": null
    },
    {
        "Maine": "maine"
    },
    {
        ", but she died before they could be wed, and Robert did not marry until his late forties. In his youth he was reported to be courageous and skilful in military exercises. He was, however, also prone to laziness and weakness of character that discontented nobles and the King of France exploited to stir discord with his father William. He was unsatisfied with the share of power allotted to him and quarrelled with his father and brothers fiercely. In 42 his father made him the ": null
    },
    {
        "Count of Maine": "count of maine"
    },
    {
        " in view of his engagement to Margaret, and Robert may have had independent rule in Maine. The county remained under Norman control until 42 when the county revolted and reverted to ": null
    },
    {
        "Hugh V of Maine": "hugh v of maine"
    },
    {
        ".     In 42 Robert instigated his first insurrection against his father as the result of a prank played by his younger brothers ": null
    },
    {
        "William Rufus": "william rufus"
    },
    {
        " and ": null
    },
    {
        "Henry": "henry i of england"
    },
    {
        ", who had dumped a full chamber-pot over his head. Robert was enraged and, urged on by his companions, started a brawl with his brothers that was only interrupted by the intercession of their father. Feeling that his dignity was wounded, Robert was further angered when King William failed to punish his brothers. The next day Robert and his followers attempted to seize the castle of ": null
    },
    {
        "Rouen": "rouen"
    },
    {
        ". The siege failed, but, when King William ordered their arrest, Robert and his companions took refuge with Hugh of Chateauneuf-en-Thymerais. They were forced to flee again when King William attacked their base at ": null
    },
    {
        "Rémalard": "rémalard"
    },
    {
        ".       Robert fled to Flanders to the court of his uncle ": null
    },
    {
        "Robert I, Count of Flanders": "robert i, count of flanders"
    },
    {
        ", before plundering the county of the ": null
    },
    {
        "Vexin": "vexin"
    },
    {
        " and causing such mayhem that his father King William allied himself with King ": null
    },
    {
        "Philip I of France": "philip i of france"
    },
    {
        " to stop his rebellious son. Relations were not helped when King William discovered that his wife, Roberts mother Queen ": null
    },
    {
        "Matilda": "matilda of flanders"
    },
    {
        ", was secretly sending her son Robert money. At a battle in January 42 Robert unhorsed King William in combat and succeeded in wounding him, stopping his attack only when he recognised his fathers voice. Humiliated, King William cursed his son. King William then raised the siege and returned to Rouen.     At Easter 42 father and son were reunited by the efforts of Queen Matilda, and a truce lasted until she died in 42 Robert seems to have left court soon after the death of his mother and spent several years travelling throughout France, Germany and Flanders. He visited Italy seeking the hand of the great heiress ": null
    },
    {
        "Matilda of Tuscany": "matilda of tuscany"
    },
    {
        " but was unsuccessful. During this period as a wandering knight Robert sired several illegitimate children. His bastard son Richard seems to have spent much of his life at the royal court of his uncle ": null
    },
    {
        "William Rufus": "william rufus"
    },
    {
        ". This Richard was killed in a hunting accident in the ": null
    },
    {
        "New Forest": "new forest"
    },
    {
        " in 42 as was his uncle, King William Rufus, the next year. An illegitimate daughter was later married to ": null
    },
    {
        "Helias of Saint-Saens": "helias of saint-saens"
    },
    {
        ".            In 42 the elder William died of wounds suffered from a riding accident during a siege of Mantes. At his death he reportedly wanted to disinherit his eldest son but was persuaded to divide the Norman dominions between his two eldest sons. To Robert he granted the ": null
    },
    {
        "Duchy of Normandy": "duchy of normandy"
    },
    {
        " and to William Rufus he granted the Kingdom of England. The youngest son Henry was given money to buy land. Of the two elder sons Robert was considered to be much the weaker and was generally preferred by the nobles who held lands on both sides of the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        " since they could more easily circumvent his authority.     At the time of their fathers death the two brothers made an agreement to be each others heir. However this peace lasted less than a year when barons joined with Robert to displace Rufus in the ": null
    },
    {
        "Rebellion of 42": "rebellion of 1088"
    },
    {
        ". It was not a success, in part because Robert never showed up to support the English rebels.     Robert took as his close adviser ": null
    },
    {
        "Ranulf Flambard": "ranulf flambard"
    },
    {
        ", who had been previously a close adviser to his father. Flambard later became an astute but much-disliked financial adviser to ": null
    },
    {
        "William Rufus": "william ii of england"
    },
    {
        " until the latters death in 42     In 42 ": null
    },
    {
        "Robert formed an army": "army of robert curthose of normandy"
    },
    {
        " and left for the ": null
    },
    {
        "Holy Land": "holy land"
    },
    {
        " on the ": null
    },
    {
        "First Crusade": "first crusade"
    },
    {
        ". At the time of his departure he was reportedly so poor that he often had to stay in bed for lack of clothes. To raise money for the crusade he mortgaged his duchy to his brother William for the sum of 42 ": null
    },
    {
        "marks": "mark"
    },
    {
        ".     When William II died on 42 August 42 Robert was on his return journey from the Crusade and was about to marry a wealthy young bride to raise funds to buy back his duchy. As a result of Roberts absence, his brother ": null
    },
    {
        "Henry": "henry i of england"
    },
    {
        " was able to seize the crown of England for himself.     Upon his return, Robert – urged by Flambard and several Anglo-Norman barons – claimed the English crown, on the basis of the short-lived agreement of 42 and in 42 led an invasion to oust his brother Henry. He landed at ": null
    },
    {
        "Portsmouth": "portsmouth"
    },
    {
        " with his army, but the lack of popular support among the English  as well as Roberts own mishandling of the invasion tactics enabled Henry to resist the invasion. Robert was forced by diplomacy to renounce his claim to the English throne in the ": null
    },
    {
        "Treaty of Alton": "treaty of alton"
    },
    {
        ". It is said that Robert was a brilliant field commander but a terrible strategist in the First Crusade.       In 42 however, Roberts continual stirring of discord with his brother in England as well as civil disorder in Normandy itself prompted Henry to invade Normandy. Orderic reports on an incident at Easter 42 when Robert was supposed to hear a sermon by the venerable ": null
    },
    {
        "Serlo": "serlo"
    },
    {
        ", ": null
    },
    {
        "Bishop of Sées": "roman catholic diocese of sées"
    },
    {
        ". Robert spent the night before sporting with harlots and jesters, and while he lay in bed sleeping off his drunkenness his unworthy friends stole his clothes. He awoke to find himself naked and had to remain in bed and missed the sermon.     In 42 Henry defeated Roberts army decisively at the ": null
    },
    {
        "Battle of Tinchebray": "battle of tinchebray"
    },
    {
        " and claimed Normandy as a possession of the English crown, a situation that endured for almost a century. Captured after the battle, Robert was imprisoned in ": null
    },
    {
        "Devizes Castle": "devizes castle"
    },
    {
        " for twenty years before being moved to ": null
    },
    {
        "Cardiff": "cardiff"
    },
    {
        ".     In 42 Robert died in ": null
    },
    {
        "Cardiff Castle": "cardiff castle"
    },
    {
        " in his early eighties. Robert Curthose, sometime Duke of Normandy, eldest son of the Conqueror, was buried in the abbey church of ": null
    },
    {
        "St. Peter": "st. peter"
    },
    {
        " in ": null
    },
    {
        "Gloucester": "gloucester"
    },
    {
        ". The exact place of his burial is difficult to establish – legend states that he requested to be buried before the High Altar. His effigy carved in ": null
    },
    {
        "bog oak": "bog oak"
    },
    {
        ", however, lies on a mortuary chest decorated with the attributed arms of the ": null
    },
    {
        "Nine Worthies": "nine worthies"
    },
    {
        " . The effigy dates from about 42 years after his death and the mortuary chest much later. The church subsequently has become ": null
    },
    {
        "Gloucester Cathedral": "gloucester cathedral"
    },
    {
        ".              Robert married Sybilla of Conversano, daughter of ": null
    },
    {
        "Geoffrey of Brindisi": "geoffrey of brindisi"
    },
    {
        ", Count of ": null
    },
    {
        "Conversano": "conversano"
    },
    {
        "  on the way back from Crusade; they had one child:     ": null
    },
    {
        "William Clito": "william clito"
    },
    {
        ", was born 42 October 42 and became heir to the ": null
    },
    {
        "Duchy of Normandy": "duchy of normandy"
    },
    {
        ". William Clito was unlucky all his life; his attempts to invade Normandy failed twice , his first marriage to a daughter of the ": null
    },
    {
        "Count of Anjou": "count of anjou"
    },
    {
        " was annulled by his uncles machinations, and even his late inheritance of the county of ": null
    },
    {
        "Flanders": "flanders"
    },
    {
        " was mishandled. William Clito died in 42 leaving no issue, thus leaving the field clear in the Norman succession .     Sybilla, who was admired and often praised by chroniclers of the time, died shortly after the birth of her son. ": null
    },
    {
        "William of Malmesbury": "william of malmesbury"
    },
    {
        " claims she died as a result of binding her breasts too tightly; both ": null
    },
    {
        "Robert of Torigny": "robert of torigny"
    },
    {
        " and ": null
    },
    {
        "Orderic Vitalis": "orderic vitalis"
    },
    {
        " suggest she was murdered by a cabal of noblewomen led by her husbands mistress, Agnes Giffard.     Robert also had at least three illegitimate children – Richard, who died hunting in the ": null
    },
    {
        "New Forest": "new forest"
    },
    {
        " in May 42 a son William, a full brother of Richard, and a daughter who married ": null
    },
    {
        "Helias of Saint-Saens": "helias of saint-saens"
    },
    {
        ". William went to Palestine after 42 and was named lord of Tortosa, but disappears from the historical record after 42              ": null
    }
]