[
    {
        "Rochefort  is a ": null
    },
    {
        "Walloon": "wallonia"
    },
    {
        " municipality": "municipality"
    },
    {
        " located in the ": null
    },
    {
        "Belgian": "belgium"
    },
    {
        " province of ": null
    },
    {
        "Namur": "namur"
    },
    {
        ", close to the ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        ". On January 42 42 Rochefort had a total population of 42. The total area is 42  km² which gives a ": null
    },
    {
        "population density": "population density"
    },
    {
        " of 42 inhabitants per km². It was a  in the 42th century.     The municipality consists of the following ": null
    },
    {
        "sub-municipalities": "deelgemeente"
    },
    {
        ": Rochefort proper, Ave-et-Auffe, Buissonville, Éprave, ": null
    },
    {
        "Han-sur-Lesse": "han-sur-lesse"
    },
    {
        ", Jemelle, Lavaux-Sainte-Anne, Lessive, Mont-Gauthier, Villers-sur-Lesse, and Wavreille.     Its ancient position at the crossroads where the route to ": null
    },
    {
        "Saint-Hubert": "saint-hubert, belgium"
    },
    {
        " crossed that from ": null
    },
    {
        "Liège": "liège"
    },
    {
        " to ": null
    },
    {
        "Bouillon": "bouillon"
    },
    {
        " required fortifying: the ruins of the old castle, which gave the place its name and a title to a long line of counts who had the right of coining their own money, still exist. This castle underwent many sieges and suffered at the hands of Marshal de Châtillon .     Near Rochefort are the red marble quarries of St. Remy, and ": null
    },
    {
        "Rochefort Abbey": "rochefort abbey"
    },
    {
        ", a ": null
    },
    {
        "Trappist": "trappist"
    },
    {
        " monastery, which operates the ": null
    },
    {
        "Rochefort Brewery": "rochefort brewery"
    },
    {
        ", known for brewing dark and sweet beers, especially the Rochefort 42 a deep dark-brown rich and fruity beer.     The town was the site of the ": null
    },
    {
        "Battle of Bure": "battle of bure"
    },
    {
        " during the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ".       Rochefort is well known for its caves. The Grotto of Rochefort, within the town, contains six chambers, the largest and highest of which was called the Sabbat . It was swept clear of its prehistoric remains before electric lighting was installed. The cave has recently been given the Christian name of Lorette after a nearby chapel of Our Lady of Loreto. ": null
    },
    {
        "The more famous local caves": "caves of han-sur-lesse"
    },
    {
        " are at ": null
    },
    {
        "Han-sur-Lesse": "han-sur-lesse"
    },
    {
        ", one of Rocheforts constituent towns, where the ": null
    },
    {
        "Lesse River": "lesse river"
    },
    {
        " disappears at what is called the gap or hole of Belvaux and passes by subterranean passages under the hill called Boeme or Boine.     The endeavor to trace the course of the river led to the discovery of the grottoes, which consist of fifteen separate connected halls that emerge in a bay of the river from a dark and extensive cavern forming a sort of side creek or bay. Except in flood-time, when the exit has to be used, the entrance is near the point where the river disappears at what is called the gap or hole of Belvaux, and the exit is made by boat from the cavern last described, which leads out to the open river. A beautiful effect for tourists in boats is afforded by emerging from the complete darkness of this cavern into the light. The finest stalactites are in the three halls called the Mysterieuses, the Vigneron and the Draperies where is the tomb , which looks as if chiseled out of white marble. The central hall called the Salle dArmes is immense, and one of the river channels flows through it.       Rochefort is twinned with the city of ": null
    },
    {
        "Broussard, Louisiana": "broussard, louisiana"
    },
    {
        ".         Image:Lesse in Rochefort.JPG|The ": null
    },
    {
        "Lesse River": "lesse river"
    }
]