[
    {
        "         Rodney Stephen Steiger  was an American actor, noted for his portrayal of offbeat, often volatile and crazed characters. Cited as one of Hollywoods most charismatic and dynamic stars,  he is closely associated with the art of ": null
    },
    {
        "method acting": "method acting"
    },
    {
        ", embodying the characters he played, which at times led to clashes with directors and co-stars. He starred as ": null
    },
    {
        "Marlon Brando": "marlon brando"
    },
    {
        "s mobster brother Charley in  On the Waterfront  , the title character Sol Nazerman in  The Pawnbroker  , and as police chief Bill Gillespie opposite ": null
    },
    {
        "Sidney Poitier": "sidney poitier"
    },
    {
        " in the film  In the Heat of the Night  which won him the ": null
    },
    {
        "Academy Award for Best Actor": "academy award for best actor"
    },
    {
        ".     Steiger was born in ": null
    },
    {
        "Westhampton, New York": "westhampton, new york"
    },
    {
        ", the son of a ": null
    },
    {
        "vaudevillian": "vaudeville"
    },
    {
        ". He had a difficult childhood, with an ": null
    },
    {
        "alcoholic": "alcoholism"
    },
    {
        " mother from whom he ran away at the age of 42 After serving in the ": null
    },
    {
        "South Pacific Theater": "pacific ocean theater of world war ii"
    },
    {
        " during World War II, he began his acting career with television roles in 42 and went on to garner critical acclaim for his portrayal of the main character in the teleplay ": null
    },
    {
        "Marty": "marty"
    },
    {
        " . He made his stage debut in 42 in a production of Curse you, Jack Dalton! at the Civic Repertory Theatre of Newark, and subsequently appeared in productions such as  An Enemy of the People  , ": null
    },
    {
        "Clifford Odets": "clifford odets"
    },
    {
        "s  Night Music  ,  Seagulls Over Sorrento  and  Rashomon  .     Steiger made his film debut in ": null
    },
    {
        "Fred Zinnemann": "fred zinnemann"
    },
    {
        "s  Teresa  in 42 and subsequently appeared in films such as  The Big Knife  ,  Oklahoma!  ,  Across the Bridge  and  Al Capone  . After Steigers performance in The Pawnbroker in 42 in which he played an embittered Jewish ": null
    },
    {
        "Holocaust": "holocaust"
    },
    {
        " survivor working as a pawnbroker in New York City, he portrayed an opportunistic Russian politician in ": null
    },
    {
        "David Lean": "david lean"
    },
    {
        "s  Doctor Zhivago  . In the Heat of the Night won five ": null
    },
    {
        "Academy Awards": "academy awards"
    },
    {
        ", including Best Picture and Best Actor for Steiger, who was lauded for his performance as a Mississippi police chief who learns to respect an African-American officer as they search for a killer. The following year, he played a serial killer of many guises in  No Way to Treat a Lady .     During the 42s, Steiger increasingly turned to European productions in his search for more demanding roles. He portrayed ": null
    },
    {
        "Napoleon Bonaparte": "napoleon bonaparte"
    },
    {
        " in  Waterloo  , a Mexican bandit in ": null
    },
    {
        "Sergio Leone": "sergio leone"
    },
    {
        "s  Duck, You Sucker!  , ": null
    },
    {
        "Benito Mussolini": "benito mussolini"
    },
    {
        " in  Last Days of Mussolini  , and ended the decade playing a disturbed priest in  The Amityville Horror  . By the 42s, heart problems and depression took its toll on Steigers career, and he found it difficult to find employment, agreeing to appear in low-budget ": null
    },
    {
        "B movie": "b movie"
    },
    {
        "s. One of his final roles was as judge ": null
    },
    {
        "H. Lee Sarokin": "h. lee sarokin"
    },
    {
        " in the prison drama  The Hurricane  , which reunited him with In the Heat of the Night director ": null
    },
    {
        "Norman Jewison": "norman jewison"
    },
    {
        ". Steiger was married five times, and had a daughter, opera singer ": null
    },
    {
        "Anna Steiger": "anna steiger"
    },
    {
        ", and a son, Michael Steiger. He died of ": null
    },
    {
        "pneumonia": "pneumonia"
    },
    {
        " and kidney failure as a result of complications from surgery for a ": null
    },
    {
        "gall bladder": "gall bladder"
    },
    {
        " tumor on July 42 42 aged 42 in Los Angeles, and was survived by his fifth wife ": null
    },
    {
        "Joan Benedict Steiger": "joan benedict steiger"
    },
    {
        ".          Steiger was born on April 42 42 in ": null
    },
    {
        "Westhampton, New York": "westhampton, new york"
    },
    {
        ", the only child of Lorraine  and Frederick Steiger,  of ": null
    },
    {
        "French": "french people"
    },
    {
        ", ": null
    },
    {
        "Scottish": "scottish people"
    },
    {
        " and ": null
    },
    {
        "German": "germans"
    },
    {
        " descent.   Rod was raised as a ": null
    },
    {
        "Lutheran": "lutheranism"
    },
    {
        ". He never knew his father, a ": null
    },
    {
        "vaudevillian": "vaudeville"
    },
    {
        " who had been part of a traveling song-and-dance team with Steigers mother, but was told that he was a handsome Latino-looking man, who was a talented musician and dancer. Biographer Tom Hutchinson describes him as a shadowy, fugitive figure, one who haunted Rod throughout his life and was an invisible presence and unseen influence.      Hutchinson described Steigers mother as plump, energetic and small, with long auburn hair.  She had a good singing voice and nearly became a Hollywood actress, but after a leg surgery permanently impaired her walking ability, she gave up acting and turned to alcohol.   As a result, she quit show business and moved away from Westhampton to raise her son. They moved through several towns, including ": null
    },
    {
        "Irvington": "irvington, new jersey"
    },
    {
        " and ": null
    },
    {
        "Bloomfield": "bloomfield, new jersey"
    },
    {
        ", before settling in ": null
    },
    {
        "Newark, New Jersey": "newark, new jersey"
    },
    {
        ". Her alcoholism caused Steiger much embarrassment, and the family was frequently mocked by other children and their parents within the community.  At the age of five he was sexually abused by a pedophile who lured him in with a butterfly collection. Steiger said of his troubled family background: If you had the choice of having the childhood you experienced, with your alcoholic mother and being the famous actor you are today, or having a loving, secure childhood and not being famous, which would you take? A loving, secure childhood in a New York minute . During the last 42 years of her life, Steigers mother stayed sober and regularly attended ": null
    },
    {
        "Alcoholics Anonymous": "alcoholics anonymous"
    },
    {
        " meetings. Steiger recalled: I was so proud of her. She turned herself around. She came alive again .     During his childhood, and owing to his considerable strength and bulk, Steiger became known as The Rock . Despite being mocked over his mothers alcoholism, he was a popular figure at school and an able softball player. He displayed an interest in writing poetry and acting during his adolescent years, and appeared in several school plays while at ": null
    },
    {
        "West Side High School": "west side high school"
    },
    {
        " in Newark. Tired of fighting with his mother, he ran away from home at age sixteen to join the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ".          He enlisted on May 42 42 and received his training at the ": null
    },
    {
        "U.S. Naval Training Station": "u.s. naval training station"
    },
    {
        " in ": null
    },
    {
        "Newport, Rhode Island": "newport, rhode island"
    },
    {
        ". He joined the newly commissioned ": null
    },
    {
        "USS Taussig ": "uss taussig"
    },
    {
        " on May 42 42 While serving as a ": null
    },
    {
        "torpedoman": "torpedomans mate"
    },
    {
        " on ": null
    },
    {
        "destroyer": "destroyer"
    },
    {
        "s, he saw action in the ": null
    },
    {
        "South Pacific": "pacific ocean theater of world war ii"
    },
    {
        ", including the ": null
    },
    {
        "Battle of Iwo Jima": "battle of iwo jima"
    },
    {
        ". Steiger later commented: I loved the Navy. I was stupid enough to think I was being heroic.  His experiences during the war haunted him for the rest of his life, particularly the loss of Americans during the Battle of Iwo Jima, as well as the sinking of vessels by the Taussig which were known to have women and children aboard. On December 42 42 off the coast of ": null
    },
    {
        "Luzon": "luzon"
    },
    {
        " in the Philippines, Steiger and the Taussig encountered a ": null
    },
    {
        "severe typhoon": "typhoon cobra"
    },
    {
        ", which became known as ": null
    },
    {
        "Halseys Typhoon": "typhoon cobra"
    },
    {
        ", with winds reaching one hundred knots and  waves. As a result, three U.S. destroyers were lost, but the Taussig survived, with Steiger tying a rope to himself on deck and flattening himself as waves engulfed the ship.     After the war, the ": null
    },
    {
        "GI Bill": "gi bill"
    },
    {
        " paid for his rent at a room on West 42st Street in New York City, an income of just over $42 a month, and four years of schooling. He initially found a job oiling machines and washing floors. He decided to attend a drama class, primarily because of its membership of attractive young women. Known as the Civil Service Little Theater group, it was conducted by the Office of Dependants and Beneficiaries, where he was employed at the time. This led him to start a two-year course at the ": null
    },
    {
        "New School for Social Research": "the new school"
    },
    {
        ", run by German émigré ": null
    },
    {
        "Erwin Piscator": "erwin piscator"
    },
    {
        ". During one audition, Steiger was cast after barely uttering a few words, the director exclaiming he had a fresh, wonderful quality. Another talented pupil at the time was ": null
    },
    {
        "Walter Matthau": "walter matthau"
    },
    {
        ", who dubbed the institution The Neurotic School for Sexual Research. Steiger was surprised to discover his own talent as an actor, and he was encouraged to pursue further studies at the Dramatic Workshop. One of the main reasons he wanted to be an actor was to regain public respect for his family name, which had so humiliated him during childhood. Another important factor was his belief that he did not have the temperament for a regular job , and would have ended up a miserable, violent alcoholic. His only role model as an actor was ": null
    },
    {
        "Paul Muni": "paul muni"
    },
    {
        ", who he thought was the greatest, though he also had a deep respect for French actor ": null
    },
    {
        "Harry Baur": "harry baur"
    },
    {
        " and, according to biographer Hutchinson, he admired ": null
    },
    {
        "Charlie Chaplin": "charlie chaplin"
    },
    {
        " to the point of adoration.            Steiger made his stage debut in a production of Curse you, Jack Dalton! at the Civic Repertory Theatre of Newark.  Subsequent to this, he received an invitation from one of his teachers, ": null
    },
    {
        "Daniel Mann": "daniel mann"
    },
    {
        ", to attend the ": null
    },
    {
        "Actors Studio": "actors studio"
    },
    {
        ", established by ": null
    },
    {
        "Elia Kazan": "elia kazan"
    },
    {
        " in October 42 It was here, along with ": null
    },
    {
        "Marlon Brando": "marlon brando"
    },
    {
        ", ": null
    },
    {
        "Karl Malden": "karl malden"
    },
    {
        " and ": null
    },
    {
        "Eli Wallach": "eli wallach"
    },
    {
        ", that he studied ": null
    },
    {
        "method acting": "method acting"
    },
    {
        ", which became deeply engrained in him. Lacking matinée idol looks, much like Malden and Wallach, he began pursuing a career as a character actor rather than as a leading man. Steigers stage work continued in 42 with a minor role as a townperson in a stage production of  An Enemy of the People  at the ": null
    },
    {
        "Music Box Theatre": "music box theatre"
    },
    {
        ".  His first major role on Broadway came in ": null
    },
    {
        "Clifford Odets": "clifford odets"
    },
    {
        "s production of  Night Music  , where he played A. L. Rosenberger.  The play was held at the ": null
    },
    {
        "ANTA Playhouse": "anta playhouse"
    },
    {
        ". The following year, he played a telegraphist in the play  Seagulls Over Sorrento , performed at the ": null
    },
    {
        "John Golden Theatre": "john golden theatre"
    },
    {
        " beginning on September 42 42      Steigers early roles, although minor, were numerous, especially in television series during the early 42s, when he appeared in more than 42 live television productions over a five-year period.  He was spotted by ": null
    },
    {
        "Fred Coe": "fred coe"
    },
    {
        ", NBCs manager of program development, who increasingly gave him bigger parts. Steiger considered television to be what ": null
    },
    {
        "repertory theatre": "repertory theatre"
    },
    {
        " had been for an earlier generation, and saw it as a place where he could test his talent with a plethora of different roles. Soon afterward he began receiving positive reviews from critics such as ": null
    },
    {
        "John Crosby": "john crosby"
    },
    {
        ", who noted that Steiger regularly gave effortless persuasive performances . Among Steigers credits were  Danger  ,   Lux Video Theatre  ,   Out There  ,   Tales of Tomorrow  ,   The Gulf Playhouse  ,   Medallion Theatre  ,   Goodyear Television Playhouse  ,  and as ": null
    },
    {
        "Shakespeare": "shakespeare"
    },
    {
        "s Romeo in The First Command Performance of Romeo and Juliet episode of  You Are There  in 42 under director ": null
    },
    {
        "Sidney Lumet": "sidney lumet"
    },
    {
        ".  He continued to make appearances in various playhouse television productions, appearing in five episodes of  Kraft Theatre  , which earned him praise from critics, six episodes of  The Philco Television Playhouse  and two episodes of  Schlitz Playhouse of Stars  .   Steiger made his big screen debut in 42 with a small role in ": null
    },
    {
        "Fred Zinnemann": "fred zinnemann"
    },
    {
        "s  Teresa , shot in 42 Steiger, who described himself as cocky , won over Zinnemann by praising his direction. Zinnemann recalled that Steiger was very popular, extremely articulate and full of remarkable memories , and the two remained highly respectful of each other for life.     On May 42 42 Steiger played the title role in ": null
    },
    {
        "Paddy Chayefsky": "paddy chayefsky"
    },
    {
        "s ": null
    },
    {
        "Marty": "marty"
    },
    {
        " episode of the Goodyear Television Playhouse.  The role had originally been intended for ": null
    },
    {
        "Martin Ritt": "martin ritt"
    },
    {
        ", who later became a director. Marty is the story of a lonely and homely butcher from ": null
    },
    {
        "the Bronx": "the bronx"
    },
    {
        " in search of love. The play was a critical success that increased Steigers public exposure; ": null
    },
    {
        "Tom Stempel": "tom stempel"
    },
    {
        " noted that he brought striking intensity to his performance as Marty, particularly in giving us Martys pain . As Steiger refused to sign a seven-year studio contract, he was replaced with ": null
    },
    {
        "Ernest Borgnine": "ernest borgnine"
    },
    {
        " in the film  Marty  , which won the ": null
    },
    {
        "Academy Award for Best Picture": "academy award for best picture"
    },
    {
        ", as well as the Best Actor Oscar for Borgnine. 42 proved to be Steigers breakthrough year; he garnered ": null
    },
    {
        "Sylvania Award": "sylvania award"
    },
    {
        "s for Marty and four other best performances of the year—as Vishinsky and ": null
    },
    {
        "Rudolf Hess": "rudolf hess"
    },
    {
        " in two episodes of You Are There, as gangster Dutch Schultz in a thriller, and as a radar operator in My Brothers Keeper.      For his role as Charley the Gent , the brother of Marlon Brandos character in Elia Kazans  On the Waterfront  , Steiger was nominated for the ": null
    },
    {
        "Academy Award for Best Supporting Actor": "academy award for best supporting actor"
    },
    {
        ". Film writer ": null
    },
    {
        "Leo Braudy": "leo braudy"
    },
    {
        " wrote that the incessantly repeated images of its taxicab confrontation between Brando and Rod Steiger have made the film iconic . The taxicab scene took eleven hours to shoot and was heavily scripted, despite Brando fuelling the popular myth in his autobiography that the scene was improvised. Brando stated that seven takes were needed because Steiger could not stop crying, which Steiger found to be unfair and inaccurate. Though Steiger retained great respect for Brando as an actor, he disliked him as a person and frequently complained during the production of Brandos predilection for leaving the set immediately after shooting his scenes. Steiger later remarked: We didnt get to know each other at all. He always flew solo and I havent seen him since the film. I do resent him saying hes just a hooker, and that actors are whores . Steiger also responded unfavorably when he learned that Kazan had been awarded an honorary Oscar by the Academy in 42  In a 42 interview with  BBC News , Steiger said he probably would not have done On the Waterfront if he had known at the time that Kazan provided the ": null
    },
    {
        "House Un-American Activities Committee": "house un-american activities committee"
    },
    {
        " with names of performers suspected of being Communists.      Steiger played Jud Fry in the film version of the ": null
    },
    {
        "Rodgers and Hammerstein": "rodgers and hammerstein"
    },
    {
        " musical  Oklahoma!  , in which he performed his own singing. It was one of the biggest location film productions of the 42s, shot near ": null
    },
    {
        "Nogales, Arizona": "nogales, arizona"
    },
    {
        " with a crew of 42 people and some 42 trucks.  Steiger portrayed a disturbed, emotionally isolated version of Jud, which television channel ": null
    },
    {
        "Turner Classic Movies": "turner classic movies"
    },
    {
        " believed brought a complexity to the character that went far beyond the stock musical villain . Steiger observed that ": null
    },
    {
        "James Dean": "james dean"
    },
    {
        ", who auditioned for the role that went to ": null
    },
    {
        "Gordon MacRae": "gordon macrae"
    },
    {
        ", was a nice kid absorbed by his own ego, so much so that it was destroying him , which he thought led to his death. Dean reportedly gave Steiger his prized copy of ": null
    },
    {
        "Ernest Hemingway": "ernest hemingway"
    },
    {
        "s book  Death in the Afternoon , and had underlined every appearance of the word death .      Later in 42 Steiger played an obnoxious film tycoon, loosely based on Columbia boss ": null
    },
    {
        "Harry Cohn": "harry cohn"
    },
    {
        ", opposite ": null
    },
    {
        "Jack Palance": "jack palance"
    },
    {
        " and ": null
    },
    {
        "Ida Lupino": "ida lupino"
    },
    {
        " in ": null
    },
    {
        "Robert Aldrich": "robert aldrich"
    },
    {
        "s ": null
    },
    {
        "film noir": "film noir"
    },
    {
        "  The Big Knife . Steiger bleached his hair for the part, sought inspiration for the role from Russian actor ": null
    },
    {
        "Vladimir Sokoloff": "vladimir sokoloff"
    },
    {
        ", read a book about the ": null
    },
    {
        "Treblinka extermination camp": "treblinka extermination camp"
    },
    {
        " to understand his character thoroughly, and visited the perfume department of a store in ": null
    },
    {
        "Beverly Hills, California": "beverly hills, california"
    },
    {
        ", to try to understand his characters contempt for women. Steiger and Palance did not get along during the production, and in one scene Palance threw several ": null
    },
    {
        "record albums": "gramophone record"
    },
    {
        " at Steiger in frustration, feeling that he was trying to steal the scene. Steiger earned critical acclaim later that year for a role as a prosecuting major in ": null
    },
    {
        "Otto Preminger": "otto preminger"
    },
    {
        "s  The Court-Martial of Billy Mitchell , alongside ": null
    },
    {
        "Gary Cooper": "gary cooper"
    },
    {
        " and ": null
    },
    {
        "Charles Bickford": "charles bickford"
    },
    {
        ".     Steiger portrayed the character Pinky in ": null
    },
    {
        "Columbia Pictures": "columbia pictures"
    },
    {
        " western,  Jubal  , which co-starred ": null
    },
    {
        "Glenn Ford": "glenn ford"
    },
    {
        " and Ernest Borgnine. Steigers character is a rancher, a sneering baddie , who becomes jealous when his former mistress becomes attracted to Fords character.. Ford noted Steigers deep commitment to method acting during production, considering him to be a fine actor but a real strange fellow . Steiger disliked the experience and frequently clashed with director ": null
    },
    {
        "Delmer Daves": "delmer daves"
    },
    {
        ", who was more favorable to Fords lighthearted take on the film. Upon its release in April 42 a writer for  Variety  was impressed with the evil venom displayed by his character, and remarked that there had not been as hateful a screen heavy around in a long time . In ": null
    },
    {
        "Mark Robson": "mark robson"
    },
    {
        "s  The Harder They Fall , Steiger played a crooked boxing promoter who hires a sports journalist . Steiger referred to Bogart as a professional who had tremendous authority during filming.          Steiger appeared in three films released in 42 The first was ": null
    },
    {
        "John Farrow": "john farrow"
    },
    {
        "s film noir  The Unholy Wife , in which he played a wealthy ": null
    },
    {
        "Napa Valley": "napa valley ava"
    },
    {
        " vintner who marries a  femme fatale  named Phyllis . In its original review of the film,  The New York Times  described Steigers performance as curious further stating that the actors voice modulation ranges from Marlon Brando to Ronald Colman and back.  During the production of ": null
    },
    {
        "Samuel Fuller": "samuel fuller"
    },
    {
        "s  Run of the Arrow , in which he played a confederate veteran who refuses to accept defeat following the surrender of ": null
    },
    {
        "General Robert E. Lee": "robert e. lee"
    },
    {
        " at ": null
    },
    {
        "Appomattox": "battle of appomattox courthouse"
    },
    {
        " at the end of the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ", Steiger badly sprained his ankle before shooting one of the battle scenes and was unable to walk, let alone run. Fuller instead got one of the Native American extras to run in Steigers place, which is why the scene was shot showing only the feet, instead of using close-ups. Steiger had researched the history behind the film and decided to play the character as an Irishman, becoming the first Irish cowboy as he put it. Later that year, Steiger took the lead role in the British thriller  Across the Bridge , in which he played a German conman with British citizenship who goes into hiding in Mexico after embezzling company funds. Film critic ": null
    },
    {
        "Dennis Schwartz": "dennis schwartz"
    },
    {
        " stated that Steiger gave one of his greatest performances .       Steiger portrayed a mastermind criminal seeking to obtain a $42 ransom, opposite ": null
    },
    {
        "James Mason": "james mason"
    },
    {
        " and ": null
    },
    {
        "Inger Stevens": "inger stevens"
    },
    {
        ", in ": null
    },
    {
        "Andrew L. Stone": "andrew l. stone"
    },
    {
        "s  Cry Terror!  for ": null
    },
    {
        "Metro-Goldwyn-Mayer": "metro-goldwyn-mayer"
    },
    {
        ". ": null
    },
    {
        "Paul Beckley": "paul beckley"
    },
    {
        " of the  Herald Tribune  had thought Steiger superbly laconic , but Dennis Schwartz dismissed the film as an ill-conceived attempt with too many coincidences and contrived plot points to sustain interest .  The following year, Steiger appeared with ": null
    },
    {
        "Claire Bloom": "claire bloom"
    },
    {
        " in a ": null
    },
    {
        "Fay": "fay kanin"
    },
    {
        " and ": null
    },
    {
        "Michael Kanin": "michael kanin"
    },
    {
        " stage production of ": null
    },
    {
        "Akira Kurosawa": "akira kurosawa"
    },
    {
        "s ": null
    },
    {
        "42 film": "rashomon"
    },
    {
        ",  Rashomon , where he enacted the role of the bandit originally played by ": null
    },
    {
        "Toshiro Mifune": "toshiro mifune"
    },
    {
        ".  A major success, it was lauded by critics and nominated for three ": null
    },
    {
        "Tony award": "tony award"
    },
    {
        "s. Robert Coleman of the  Daily Mirror  described Steigers performance as magnificently animalish , while ": null
    },
    {
        "Kenneth Tynan": "kenneth tynan"
    },
    {
        " of  The New Yorker  thought the acting helped set new standards for Broadway. The same year, Steiger portrayed iconic mobster ": null
    },
    {
        "Al Capone": "al capone"
    },
    {
        " in the ": null
    },
    {
        "film of the same name": "al capone"
    },
    {
        ". Steiger was particularly keen on demonstrating the showiness of Capone, speaking thunderously, slinging a camel-hair coat over his shoulders and wearing his hat at a jaunty angle. The film, noted for its deglamorized portrayal of the subject,  p. 42A. earned Steiger a ": null
    },
    {
        "Laurel Award for Best Male Dramatic Performance": "laurel awards"
    },
    {
        " nomination. Though Hutchinson, author of Rod Steiger: Memoirs of a friendship, perceived Steigers portrayal of Capone to be more of a caricature, George Anastasia and Glen Macnow, authors of the book The Ultimate Book of Gangster Movies, described it as one of the best screen portrayals of Capone.     Following the success of Al Capone, Steiger played sophisticated thief Paul Mason, who masterminds a caper to steal $42 million in French francs from the underground vault of the casino of ": null
    },
    {
        "Monte Carlo": "monte carlo"
    },
    {
        ", in the ": null
    },
    {
        "Henry Hathaway": "henry hathaway"
    },
    {
        " heist film  Seven Thieves  . ": null
    },
    {
        "Bosley Crowther": "bosley crowther"
    },
    {
        " of The New York Times gave a positive review of the film, praising the nerve-rackingly delicate plot and the most elaborate roles of Steiger and his co-star, ": null
    },
    {
        "Edward G. Robinson": "edward g. robinson"
    },
    {
        ".  The following year, he took the part of a prison psychiatrist who tries to cure the psychological demons of ": null
    },
    {
        "Stuart Whitman": "stuart whitman"
    },
    {
        "s character in  The Mark . Steigers performance was so convincing that, after the film was released, he received a call from a psychiatric institution asking him to attend one of their board meetings.  The Mark was followed by a role in the European film production of  World in My Pocket  alongside ": null
    },
    {
        "Nadja Tiller": "nadja tiller"
    },
    {
        ". Steiger increasingly played in films in Italy and France during this period. Not only did he believe he had greater credibility and esteem as an actor in Europe, but he approved of the more relaxed filming schedule prevalent there at that time.      In 42 Steiger appeared on Broadway in  Moby Dick—Rehearsed , at the ": null
    },
    {
        "Ethel Barrymore Theatre": "ethel barrymore theatre"
    },
    {
        ",  as well as playing a detective searching for a scientists  mugger in ": null
    },
    {
        "Philip Leacock": "philip leacock"
    },
    {
        "s  42 West Street  for Columbia Pictures.  Steiger played a small role of a destroyer commander among the large ensemble cast of  The Longest Day , which included ": null
    },
    {
        "John Wayne": "john wayne"
    },
    {
        ", ": null
    },
    {
        "Richard Todd": "richard todd"
    },
    {
        ", ": null
    },
    {
        "Robert Mitchum": "robert mitchum"
    },
    {
        ", ": null
    },
    {
        "Richard Burton": "richard burton"
    },
    {
        ", ": null
    },
    {
        "Sean Connery": "sean connery"
    },
    {
        " and ": null
    },
    {
        "Henry Fonda": "henry fonda"
    },
    {
        ".  According to co-star Richard Burton, Steiger had privately admitted to him that he was in financial trouble at the time and had a face lift, which Burton thought made him look like one half of a naked ass-hole . The following year, Steiger played ruthless ": null
    },
    {
        "Neapolitan": "naples"
    },
    {
        " land developer and city councilman Edoardo Nottola, who uses his political power to make personal profit in a large scale ": null
    },
    {
        "suburb": "suburb"
    },
    {
        "an real estate deal, in ": null
    },
    {
        "Francesco Rosi": "francesco rosi"
    },
    {
        "s Italian production,  Hands over the City  . According to biographer Francesco Bolzoni, Rosi had cast Steiger in the Italian language film because he had wanted a rich interpreter of great capacity in the part of the land developer.            Shortly after Hands over the City, Steiger agreed to appear in another Italian film,  Time of Indifference  , in which he starred opposite ": null
    },
    {
        "Claudia Cardinale": "claudia cardinale"
    },
    {
        " and ": null
    },
    {
        "Shelley Winters": "shelley winters"
    },
    {
        ". Though Steigers powerful performance was unaffected, the production was marred by a dispute between director ": null
    },
    {
        "Francesco Maselli": "francesco maselli"
    },
    {
        " and producer ": null
    },
    {
        "Franco Cristaldi": "franco cristaldi"
    },
    {
        ", with one wanting it to be a purely political film and the other wanting emphasis on the erotic subplot and his relationship with Cardinale. In Sidney Lumets gritty drama  The Pawnbroker  , Steiger played an embittered, emotionally withdrawn survivor of ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        " living in New York City. Richard Harland Smith of TCM notes that Steigers career was waning at the time, and he had to scramble for paying gigs for a decade before getting this part. Steiger agreed to a reduced fee of $42. He read ": null
    },
    {
        "Edward Lewis Wallants novel": "the pawnbroker"
    },
    {
        " and the script many times to develop an intimate understanding of the character, and insisted on reducing his lines to make his character more realistic and alienated from society. Lumet noted that during the production Steiger had a tendency to be overly dramatic, stating: Sure, Rod has weaknesses of rhetoric, but you can talk them through with him. I explained that this solitary Jew could not rise to heights of emotion; he had been hammered by life and by people. The faith he had to find was in other people, because God had betrayed him.      Steiger remarked of the film: I think my best work is in The Pawnbroker. The last scene, where I find the boy dead on the street. I think thats the highest moment, whatever it may be, with my talent. He drew upon inspiration for this climactic scene, in which he appears to show his frustration through a silent scream, from ": null
    },
    {
        "Picasso": "pablo picasso"
    },
    {
        "s ": null
    },
    {
        "Guernica": "guernica"
    },
    {
        " , which depicts war-ravaged villagers. ": null
    },
    {
        "Cecil Wilson": "cecil wilson"
    },
    {
        " of the  Daily Mail  wrote that Steigers character seems to encompass all the agony ever inflicted on man . Although the film attracted controversy and was accused of ": null
    },
    {
        "anti-Semitism": "anti-semitism"
    },
    {
        ", Steiger was widely acclaimed for his performance, which garnered him the prize for Best Actor at the ": null
    },
    {
        "Berlin International Film Festival": "berlin international film festival"
    },
    {
        " and his second Best Actor nomination at the Oscars. Steiger was so certain that he had produced an Oscar-winning performance that he was shocked when he lost to ": null
    },
    {
        "Lee Marvin": "lee marvin"
    },
    {
        ".       In 42 Steiger played an effeminate embalmer in ": null
    },
    {
        "Tony Richardson": "tony richardson"
    },
    {
        "s comedy  The Loved One , about the funeral business in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ", based on the ": null
    },
    {
        "42 short satirical novel": "the loved one"
    },
    {
        " by ": null
    },
    {
        "Evelyn Waugh": "evelyn waugh"
    },
    {
        ". His curly-haired appearance in the film was modeled on a bust of ": null
    },
    {
        "Apollo": "apollo"
    },
    {
        " he once saw while meeting Richardson. Steiger offended Bosley Crowther of  The New York Times , who found his character repellent. His next role, as Komarovsky, a Russian politician and villainous opportunist who rapes ": null
    },
    {
        "Julie Christie": "julie christie"
    },
    {
        "s character in ": null
    },
    {
        "David Lean": "david lean"
    },
    {
        "s  Doctor Zhivago  , was one of his favorites.  Steiger, one of only two Americans in the cast, was initially apprehensive about working with such great British actors as ": null
    },
    {
        "Ralph Richardson": "ralph richardson"
    },
    {
        " and ": null
    },
    {
        "Alec Guinness": "alec guinness"
    },
    {
        ",  and was pleased when the film was completed that he did not stand out as an American. The film was the biggest international box office draw of the 42s,  grossing $42 million worldwide. It has since been acclaimed as one of the ": null
    },
    {
        "greatest films ever made": "list of films considered the best"
    },
    {
        ", and in 42 was selected as the 42th best American film in the original ": null
    },
    {
        "AFIs 42 Years...42 Movies": "afis 100 years...100 movies"
    },
    {
        " list by the ": null
    },
    {
        "American Film Institute": "american film institute"
    },
    {
        ".         Steiger had intended returning to the stage, and had signed on to play the title character in ": null
    },
    {
        "Bertolt Brecht": "bertolt brecht"
    },
    {
        "s  Galileo , at the ": null
    },
    {
        "Lincoln Center Repertory Company": "lincoln center repertory company"
    },
    {
        " in April 42 but the production was cancelled when he became ill. Steiger won the Best Actor Oscar for his portrayal of Chief of Police Bill Gillespie in  In the Heat of the Night , opposite ": null
    },
    {
        "Sidney Poitier": "sidney poitier"
    },
    {
        ". He played a Southern police chief searching for a murderer. Prejudiced against blacks, he jumps to the conclusion that the culprit is Virgil Tibbs , an African-American man passing through town after visiting his mother, who later turns out to be an experienced homicide detective from ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        ". The film deals with the way the two men interact and join forces in solving the crime, as Steigers Gillespie learns to greatly respect the black man he initially took to be a criminal.  Steiger drew upon his experience in the Navy with a Southerner named King , remembering his accent. Poitier considered Steiger and ": null
    },
    {
        "Spencer Tracy": "spencer tracy"
    },
    {
        " to have been the finest actors he had ever worked with, remarking in 42 Hes so good he made me dig into bags I never knew I had.  A. D. Murphy of Variety described Steigers performance as outstanding , writing: Steigers transformation from a diehard Dixie bigot to a man who learns to respect Poitier stands out in smooth comparison to the wandering solution of the murder.  Steiger won a plethora of other awards, including a ": null
    },
    {
        "BAFTA": "bafta award for best actor in a leading role"
    },
    {
        ",  a ": null
    },
    {
        "Golden Globe": "golden globe award for best actor - motion picture drama"
    },
    {
        ",  a ": null
    },
    {
        "Laurel Award": "laurel award"
    },
    {
        " and awards for Best Actor from the ": null
    },
    {
        "National Society of Film Critics": "national society of film critics award for best actor"
    },
    {
        " and the ": null
    },
    {
        "New York Film Critics Circle": "new york film critics circle award for best actor"
    },
    {
        ".       In 42 Steiger played a serial killer opposite ": null
    },
    {
        "George Segal": "george segal"
    },
    {
        " in ": null
    },
    {
        "Jack Smight": "jack smight"
    },
    {
        "s black comedy thriller  No Way to Treat a Lady . During the course of the film, he adopts various disguises, including those of an Irish priest, a New York City policeman, a German plumber, and a gay hairdresser, to avoid being identified, and to put his victims at ease, before strangling them and painting a pair of lips on their foreheads with garish red lipstick. The film and Steigers performance were critically acclaimed, with ": null
    },
    {
        "Vincent Canby": "vincent canby"
    },
    {
        " of The New York Times highlighting Steigers beautifully uninhibited performance as a hammy ,  and a writer for  Time Out  describing him as brilliant as a sort of ": null
    },
    {
        "Boston strangler": "boston strangler"
    },
    {
        ", son of a great actress who has left her boy with a mother fixation .  Later in 42 Steiger played a repressed gay ": null
    },
    {
        "non-commissioned officer": "non-commissioned officer"
    },
    {
        " opposite ": null
    },
    {
        "John Phillip Law": "john phillip law"
    },
    {
        " in ": null
    },
    {
        "John Flynn": "john flynn"
    },
    {
        "s  The Sergeant  for ": null
    },
    {
        "Warner Bros.-Seven Arts": "warner bros.-seven arts"
    },
    {
        ", which earned him the ": null
    },
    {
        "David di Donatello Award for Best Foreign Actor": "david di donatello for best foreign actor"
    },
    {
        ".  Despite the award win, film critic ": null
    },
    {
        "Pauline Kael": "pauline kael"
    },
    {
        " of  The New Yorker  was particularly critical of the casting of Steiger as a homosexual and felt that he was totally outside his range , to which Steiger concurred that he was ineffective.     Steiger was cast as a short-tempered tattooed man with soon-to-be ex-wife Claire Bloom in the science fiction picture  The Illustrated Man  . The film was a critical and commercial failure,  and ": null
    },
    {
        "Ray Bradbury": "ray bradbury"
    },
    {
        ", who wrote the screenplay, said: Rod was very good in it, but it wasnt a good film...the script was terrible . Steiger had better luck alongside Bloom later that year in ": null
    },
    {
        "Peter Hall": "peter hall"
    },
    {
        "s British drama  Three into Two Wont Go , playing an Irishman who cheats on his wife with a young hiker. It was entered into the ": null
    },
    {
        "Berlin International Film Festival": "19th berlin international film festival"
    },
    {
        " and became the 42th most popular film at the UK box office in 42        Steiger was offered the title role in  Patton  , but turned it down because he did not want to glorify war.  The role was then given to ": null
    },
    {
        "George C. Scott": "george c. scott"
    },
    {
        ", who won the Best Actor Oscar for his performance. Steiger called this refusal his dumbest career move ,  remarking, I got on my high horse. I thought I was a pacifist.  Instead, he chose to portray ": null
    },
    {
        "Napoleon Bonaparte": "napoleon i of france"
    },
    {
        " opposite ": null
    },
    {
        "Christopher Plummer": "christopher plummer"
    },
    {
        " in ": null
    },
    {
        "Sergei Bondarchuk": "sergei bondarchuk"
    },
    {
        "s  Waterloo  , a co-production between the Soviet Union and Italy. One commentator wrote: I watched with extraordinary respect, no, that is not the right word, with enthusiasm, the acting of Rod Steiger in the role of Napoleon in Waterloo,  while literary critic ": null
    },
    {
        "Daniel S. Burt": "daniel s. burt"
    },
    {
        " describes Steigers Napoleon as an unusual interpretation , finding him less convincing than Plummers ": null
    },
    {
        "Wellington": "arthur wellesley, 1st duke of wellington"
    },
    {
        ".     In 42 Steiger played a chauvinistic big game hunter, explorer and war hero opposite ": null
    },
    {
        "Susannah York": "susannah york"
    },
    {
        " in Mark Robsons  Happy Birthday, Wanda June , before agreeing to star alongside ": null
    },
    {
        "James Coburn": "james coburn"
    },
    {
        " as Mexican bandit Juan Miranda in ": null
    },
    {
        "Sergio Leone": "sergio leone"
    },
    {
        "s  Duck, You Sucker! , which was alternatively titled A Fistful of Dynamite.   Leone was initially dissatisfied with his performance in that he played his character as a serious, ": null
    },
    {
        "Zapata": "emiliano zapata"
    },
    {
        "-like figure. As a result, tension grew between Steiger and Leone, including one incident that ended with Steiger walking off during the filming of the scene where Juans stagecoach is destroyed. After the films completion, Leone and Steiger were content with the final result, and Steiger praised Leone for his skills as a director.  Steiger auditioned for the role of ": null
    },
    {
        "Michael Corleone": "michael corleone"
    },
    {
        " in ": null
    },
    {
        "Francis Ford Coppola": "francis ford coppola"
    },
    {
        "s  The Godfather  , a film adaptation of ": null
    },
    {
        "Italian American": "italian american"
    },
    {
        " author ": null
    },
    {
        "Mario Puzo": "mario puzo"
    },
    {
        "s ": null
    },
    {
        "42 novel of the same name": "the godfather"
    },
    {
        ", but Puzo felt that Steiger was too old for the part and rejected him.     Steiger played a rural ": null
    },
    {
        "Tennessee": "tennessee"
    },
    {
        " patriarch and brother of ": null
    },
    {
        "Jeff Bridges": "jeff bridges"
    },
    {
        ", at odds with Robert Ryans character, in  Lolly-Madonna XXX  , which received mixed reviews.   Later that year he was cast as the turban-wearing German officer Guenther von Lutz in ": null
    },
    {
        "Duccio Tessari": "duccio tessari"
    },
    {
        "s Italian war comedy  The Heroes , opposite ": null
    },
    {
        "Rod Taylor": "rod taylor"
    },
    {
        ", and appeared as foul-mouthed Sicilian mobster Eugenio Giannini opposite ": null
    },
    {
        "Gian Maria Volonté": "gian maria volonté"
    },
    {
        "s ": null
    },
    {
        "Lucky Luciano": "lucky luciano"
    },
    {
        " in Francesco Rosis ": null
    },
    {
        "film of the same name": "lucky luciano"
    },
    {
        ".     In 42 Steiger portrayed Italian dictator ": null
    },
    {
        "Benito Mussolini": "benito mussolini"
    },
    {
        " in ": null
    },
    {
        "Carlo Lizzani": "carlo lizzani"
    },
    {
        "s  Last Days of Mussolini , which received a positive critical reception. He appeared in ": null
    },
    {
        "Claude Chabrol": "claude chabrol"
    },
    {
        "s French picture  Innocents with Dirty Hands , playing the role of Louis Wormser, the wealthy alcoholic husband of ": null
    },
    {
        "Romy Schneider": "romy schneider"
    },
    {
        "s character Julie Wormser. It was poorly received by critics, and Steiger found the director, whom he had admired, a bitter disappointment. He was highly critical of Chabrols lack of communication and aloofness from the production, and preference for playing chess on set instead of talking through scenes. Vincent Canby of The New York Times dismissed it as little more than a soap opera , writing: The performances are of a piece—uniformly atrocious. Mr. Steiger surpasses his own earlier records for lumbering busyness. Within his first few minutes on screen he gets drunk, whines, pleads for understanding, weeps and goes to bed alone.    Later that year, Steiger starred as an ": null
    },
    {
        "Irish Republican Army": "irish republican army"
    },
    {
        " terrorist who plans to blow up the ": null
    },
    {
        "Houses of Parliament": "houses of parliament"
    },
    {
        " in ": null
    },
    {
        "Don Sharp": "don sharp"
    },
    {
        "s British thriller  Hennessy . John Simon of  New York Magazine  wrote: This fellow Hennessy, as played by Rod Steiger, is about as interesting and likable as a ": null
    },
    {
        "Guy Fawkes": "guy fawkes"
    },
    {
        " dummy.       The following year, Steiger portrayed the comic actor ": null
    },
    {
        "W. C. Fields": "w. c. fields"
    },
    {
        " in an ": null
    },
    {
        "Arthur Hiller": "arthur hiller"
    },
    {
        " biopic,  W. C. Fields and Me , for ": null
    },
    {
        "Universal Pictures": "universal pictures"
    },
    {
        ". The ": null
    },
    {
        "screenplay": "screenplay"
    },
    {
        ", which was based on a ": null
    },
    {
        "memoir": "memoir"
    },
    {
        " by ": null
    },
    {
        "Carlotta Monti": "carlotta monti"
    },
    {
        ", who was Fields mistress for the last 42 years of his life, was penned by ": null
    },
    {
        "Bob Merrill": "bob merrill"
    },
    {
        ". Steiger read extensively about Fields in preparation for the role, and developed an encyclopaedic knowledge of his career and personal life. He concluded that he would base his characterization around his performance in  The Bank Dick  . One day, Fields mistress Monti turned up on set, and watched the scene where he briefly thanks everybody. Nervous that she might not approve, he broke down in tears after Monti met him after the scene and fondly said Woody, Woody, Woody, My Woody , a nickname used only by those very close to Fields. Despite the energy Steiger put into the picture, like the actors previous recent films, it was poorly received by critics. Canby called it dreadful and described Steigers portrayal of Fields as a wax dummy of a character .  Lucia Bozzola of The New York Times later referred to Steigers portrayal of Fields as superb , but noted that his Hollywood career had undeniably fallen from his 42s and 42s heights .     Steiger played ": null
    },
    {
        "Pontius Pilate": "pontius pilate"
    },
    {
        " in ": null
    },
    {
        "Franco Zeffirelli": "franco zeffirelli"
    },
    {
        "s TV ": null
    },
    {
        "miniseries": "miniseries"
    },
    {
        "  Jesus of Nazareth  . ": null
    },
    {
        "Stacy Keach": "stacy keach"
    },
    {
        ", who portrayed ": null
    },
    {
        "Barabbas": "barabbas"
    },
    {
        ", expressed his joy at the opportunity to work with Steiger, describing him as generous and opinionated . In 42 Steiger played a senator in Norman Jewisons  F.I.S.T. , opposite ": null
    },
    {
        "Sylvester Stallone": "sylvester stallone"
    },
    {
        ", who played a Cleveland warehouse worker involved in the labor union leadership of the fictional organisation named Federation of Inter-State Truckers.  Love and Bullets , later that year, in which Steiger appeared as a mafia boss, was poorly received; ": null
    },
    {
        "Roger Ebert": "roger ebert"
    },
    {
        " dismissed it as a hopelessly confused hodgepodge of chases, killings, enigmatic meetings and separations, and insufferably overacted scenes by Steiger alternating with alarmingly underacted scenes by Bronson .  The following year, Steiger was cast as a general opposite Richard Burton and Robert Mitchum in ": null
    },
    {
        "Andrew V. McLaglen": "andrew v. mclaglen"
    },
    {
        "s war film  Breakthrough , set on the ": null
    },
    {
        "Western Front": "western front"
    },
    {
        ". In  The Amityville Horror  , Steiger appeared as a disturbed priest, who is invited to perform an ": null
    },
    {
        "exorcism": "exorcism"
    },
    {
        " on a haunted house. Again Steiger was accused of overacting; ": null
    },
    {
        "Janet Maslin": "janet maslin"
    },
    {
        " of The New York Times wrote: Mr. Steiger bellows and weeps and overdoes absolutely everything. He wont even pick up the phone before its rung 42 or 42 times.  Pauline Kael thought that Steigers spiritual agony was enough to shatter the camera lens .      In 42 Steiger received two ": null
    },
    {
        "Genie Award for Best Performance by a Foreign Actor": "genie award for best performance by a foreign actor"
    },
    {
        " nominations for his roles in  Klondike Fever  and  The Lucky Star , both Canadian productions. Klondike Fever is based on ": null
    },
    {
        "Jack London": "jack london"
    },
    {
        "s journey from ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " to the ": null
    },
    {
        "Klondike": "klondike, yukon"
    },
    {
        " gold fields in 42 Steiger revisited his role as Mussolini in  Lion of the Desert , a production that was financed by ": null
    },
    {
        "Muammar Gaddafi": "muammar gaddafi"
    },
    {
        ", and which co-starred ": null
    },
    {
        "Anthony Quinn": "anthony quinn"
    },
    {
        " as ": null
    },
    {
        "Bedouin": "bedouin"
    },
    {
        " tribal leader ": null
    },
    {
        "Omar Mukhtar": "omar mukhtar"
    },
    {
        ", fighting the Italian army in the years leading up to World War II. The Italian authorities reportedly banned the film in 42 as it was considered damaging to the army, and it was not shown on Italian television until a state visit by Gaddafi in 42 It received critical acclaim in Britain, where it was praised in particular for the quality of its battle scenes.  Later in 42 Steiger won the ": null
    },
    {
        "Montréal World Film Festival Award for Best Actor": "montreal world film festival"
    },
    {
        " for his portrayal of white-bearded Orthodox ": null
    },
    {
        "rabbi": "rabbi"
    },
    {
        " Reb Saunders in ": null
    },
    {
        "Jeremy Kagan": "jeremy kagan"
    },
    {
        "s  The Chosen .   Janet Maslin commented that Steigers slow, rolling delivery was more numbing than prepossessing ,  though a critic from Variety thought it an exceptional performance as the somewhat tyrannical but loving patriarch .       After his ": null
    },
    {
        "open-heart surgery": "open-heart surgery"
    },
    {
        " in 42 clinical depression and health problems during the 42s directly affected Steigers career, and he often turned to ": null
    },
    {
        "B-movie": "b-movie"
    },
    {
        "s, low-budget, independent productions and TV miniseries. He admitted that during this period he accepted everything I was offered , and knew that many of the films he appeared in were not great, but wanted to demonstrate his strong work ethic despite his issues. He later regretted the poorer films in which he appeared during the 42s, and wished he had done more stage work. He sank into an even deeper depression when he was not involved in acting, but it bothered him more that his acting career had taken a turn for the worse and was no longer challenging. The major studio producers were wary of his problems and considered him a liability. Steiger spoke about the experience to a younger colleague while advising: Never tell anyone if youve got heart problems, kid. Never.  His reputation as a fine character actor remained intact, and ": null
    },
    {
        "Joel Hirschhorn": "joel hirschhorn"
    },
    {
        " at the time considered his talent to be as strong as ever .     In 42 Steiger starred as a detective assigned to investigate the murder of a Chicago psychoanalyst , a man whom he detests from a previous case, in ": null
    },
    {
        "Bryan Forbes": "bryan forbes"
    },
    {
        "s  The Naked Face . ": null
    },
    {
        "Richard Christiansen": "richard christiansen"
    },
    {
        " of the  Chicago Tribune  referred to it as a wimpy suspense movie shot in Chicago in the fall of 42 doesnt do much good for the city or for anyone connected with it , and considered Steiger to be acting in his high hysteria gear , who snarls and whines and overacts .  Steiger took a break from cinema in the mid42s, during which he appeared in the ": null
    },
    {
        "Yorkshire Television": "itv yorkshire"
    },
    {
        " mini-series  The Glory Boys  with ": null
    },
    {
        "Anthony Perkins": "anthony perkins"
    },
    {
        ",  and  Hollywood Wives  with ": null
    },
    {
        "Angie Dickinson": "angie dickinson"
    },
    {
        ". Steiger and Perkins were at loggerheads during the production of The Glory Boys. Perkins resented the fact that Steiger insisted on a bigger trailer and felt that Steiger was trying to steal scenes from him, while Steiger had thought Perkins so jittery and jinxed by the chemicals he was taking that he felt sorry for him and believed that he was jeopardizing the success of the film. Steiger also performed on ": null
    },
    {
        "Joni Mitchell": "joni mitchell"
    },
    {
        "s 42 album ": null
    },
    {
        "Dog Eat Dog": "dog eat dog"
    },
    {
        ", where he provided the voice of an evangelist in the song Tax Free .      Steiger appeared in the Argentine-American film  Catch the Heat  , a martial arts picture about a Brazilian drug baroness who smuggles drugs into the United States inside her breast implants. According to director ": null
    },
    {
        "Fred Olen Ray": "fred olen ray"
    },
    {
        ", it was pulled from distribution within a week of release. In 42 Steiger and ": null
    },
    {
        "Yvonne De Carlo": "yvonne de carlo"
    },
    {
        " played a spooky elderly couple with developmentally delayed children in ": null
    },
    {
        "John Hough": "john hough"
    },
    {
        "s horror film  American Gothic . Universally panned by the critics, ": null
    },
    {
        "Caryn James": "caryn james"
    },
    {
        " of The New York Times wrote: Mr. Steiger addresses the camera as if he were reciting Shakespeare, he is truly, straightforwardly, hilariously bad.  During the last year of the decade he played authority figures, including a mayor in  The January Man ,  and as Judge Prescott in  Tennessee Waltz .  Although Steiger admitted that his performance in The January Man was way over the top , he enjoyed the experience, thereby marking a positive turning point after a period of clinical depression.     In 42 Steiger starred in  Men of Respect , a crime drama film adaptation of William Shakespeares play  Macbeth . He played a character based on ": null
    },
    {
        "King Duncan": "king duncan"
    },
    {
        ", opposite ": null
    },
    {
        "John Turturro": "john turturro"
    },
    {
        " as Mike Battaglia , who plays a Mafia hitman who climbs his way to the top by killing Steigers character. The film was critically panned, with Roger Ebert awarding it one star out of four, describing the concept as a very, very bad idea .  Steiger played another mobster, ": null
    },
    {
        "Sam Giancana": "sam giancana"
    },
    {
        ", two years later in the miniseries  Sinatra  .      Steiger portrayed a reverend living in a small town in the ": null
    },
    {
        "American South": "southern united states"
    },
    {
        " in the macabre ": null
    },
    {
        "Merchant Ivory": "merchant ivory"
    },
    {
        " film production  The Ballad of the Sad Café  , co-starring ": null
    },
    {
        "Vanessa Redgrave": "vanessa redgrave"
    },
    {
        " and ": null
    },
    {
        "Keith Carradine": "keith carradine"
    },
    {
        ". The film met with generally lukewarm reviews, though it was entered into the ": null
    },
    {
        "42st Berlin International Film Festival": "41st berlin international film festival"
    },
    {
        ".  Steiger auditioned for the part of an elderly Irishman in ": null
    },
    {
        "Ron Howard": "ron howard"
    },
    {
        "s  Far and Away , starring ": null
    },
    {
        "Tom Cruise": "tom cruise"
    },
    {
        " and ": null
    },
    {
        "Nicole Kidman": "nicole kidman"
    },
    {
        ". Steiger, who had long been bald, was ordered by Howard to wear a wig to the audition. He resented the fact that Howard insisted on taping the audition, which he believed to be a form of humiliation for actors, serving as after-dinner entertainment for the Hollywood executives. Steiger never forgave Howard, whom he referred to as a cocksucker , for rejecting him for the part and giving it to ": null
    },
    {
        "Cyril Cusack": "cyril cusack"
    },
    {
        ".     In 42 Steiger portrayed an aging ": null
    },
    {
        "gynaecologist": "gynaecology"
    },
    {
        " who terrorizes his urban neighbors in a rural community in ": null
    },
    {
        "Burlington, Vermont": "burlington, vermont"
    },
    {
        " in  The Neighbor . Dennis Schwartz considered it to have been one of Steigers creepiest roles, though he thought that the poor script had rendered the role awkward and mildly entertaining in the sense that Steiger is asked to carry the film and hams it up .  The following year, Steiger agreed to play the role of a Cuban mob boss opposite Sylvester Stallone and ": null
    },
    {
        "Sharon Stone": "sharon stone"
    },
    {
        " in ": null
    },
    {
        "Luis Llosa": "luis llosa"
    },
    {
        "s thriller  The Specialist , citing its purpose as a $42 million commercial to show a new generation that he existed. Critics panned the film, which has a four percent approval rating on ": null
    },
    {
        "Rotten Tomatoes": "rotten tomatoes"
    },
    {
        " based on 42 reviews as of July 42  The role earned Steiger a ": null
    },
    {
        "Golden Raspberry Award for Worst Supporting Actor": "golden raspberry award for worst supporting actor"
    },
    {
        " nomination, and the film was listed in  The Official Razzie Movie Guide  as one of The 42 Most Enjoyably Bad Movies Ever Made .          Following The Specialist , Steiger appeared in  Tom Clancys Op Center  , a film that was edited down into a TV miniseries,  and featured in a  Columbo  television film,  Strange Bedfellows .  The following year, he took a minor role as Doc Wallace in the ": null
    },
    {
        "Dale Rosenbloom": "dale rosenbloom"
    },
    {
        " family drama  Shiloh . He reprised the role three years later in ": null
    },
    {
        "the sequel": "shiloh 2: shiloh season"
    },
    {
        ".  Also in 42 Steiger played a jingoistic top general who petitions the president to go nuclear in the middle of a global crisis in the ensemble production of  Mars Attacks! .      In 42 Steiger played Tony Vago, the mob boss of ": null
    },
    {
        "Vincent Gallo": "vincent gallo"
    },
    {
        "s character in ": null
    },
    {
        "Kiefer Sutherland": "kiefer sutherland"
    },
    {
        "s  Truth or Consequences, N.M. , a gritty noir about a drug heist gone wrong. Steiger played judges in ": null
    },
    {
        "Antonio Banderas": "antonio banderas"
    },
    {
        "s comedy-drama  Crazy in Alabama  and in the prison drama,  The Hurricane ,   both in 42 the latter of which tells the story of former middleweight boxer ": null
    },
    {
        "Rubin Carter": "rubin carter"
    },
    {
        ", who was wrongly convicted of a triple homicide in a bar in ": null
    },
    {
        "Paterson, New Jersey": "paterson, new jersey"
    },
    {
        ".  The Hurricane reunited Steiger with Norman Jewison, who had directed him in In the Heat of the Night. Steiger portrayed ": null
    },
    {
        "H. Lee Sarokin": "h. lee sarokin"
    },
    {
        ", the judge responsible for freeing Carter. Sarokin thought it was a marvellous film that was Oscar-worthy, but found Steigers portrayal as overacted and a little arrogant and pompous .      After a minor role as a bombastic priest in  End of Days  , Steiger was one of the lead actors in ": null
    },
    {
        "Burt Reynolds": "burt reynolds"
    },
    {
        "s  The Last Producer  , a film about a washed-up, veteran producer who tries to re-enter the movie business by producing a new film.  Steigers last film role was as the ": null
    },
    {
        "billiard hall": "billiard hall"
    },
    {
        " manager, Nick, in  Poolhall Junkies  ;  it was poorly received by critics.           Steiger was married five times: he married actress Sally Gracie , actress ": null
    },
    {
        "Claire Bloom": "claire bloom"
    },
    {
        " , secretary Sherry Nelson ,    singer Paula Ellis   and actress ": null
    },
    {
        "Joan Benedict Steiger": "joan benedict steiger"
    },
    {
        " . He had a daughter, opera singer ": null
    },
    {
        "Anna Steiger": "anna steiger"
    },
    {
        " by Bloom, and a son, Michael Steiger , from his marriage to Ellis. In an interview with journalist ": null
    },
    {
        "Kenneth Passingham": "kenneth passingham"
    },
    {
        ", Steiger stated that Bloom was all I ever wanted in a woman , and that maybe our marriage was better than most because we were both established when we met . The couple bought a home in ": null
    },
    {
        "Malibu, California": "malibu, california"
    },
    {
        ", a community that appealed to Steiger but which Bloom found boring. They also purchased an apartment in Manhattan and a cottage in ": null
    },
    {
        "County Galway": "county galway"
    },
    {
        ", in close proximity to ": null
    },
    {
        "John Huston": "john huston"
    },
    {
        "s home. Financial considerations led Steiger to sell their New York apartment in the mid42s. It upset him greatly when his marriage with Bloom ended in 42 and that she quickly remarried Broadway producer ": null
    },
    {
        "Hillard Elkins": "hillard elkins"
    },
    {
        " the same year, a man whom Steiger had entrusted to care for her while he was away shooting Waterloo. Steiger was also close friends with actress ": null
    },
    {
        "Elizabeth Taylor": "elizabeth taylor"
    },
    {
        ".       Steiger was outspoken on ": null
    },
    {
        "McCarthyism": "mccarthyism"
    },
    {
        ". He was particularly critical of ": null
    },
    {
        "Charlton Heston": "charlton heston"
    },
    {
        "s stance on weapons, and publicly referred to him as Americas favorite fascist . In one clash in a column in the  Los Angeles Times , Steiger responded to a letter sent by Heston saying that he was shocked that the American Film Institute had not honored Elia Kazan because of his testimony to the Un-American Activities Committee. Steiger wrote that he was appalled, appalled, appalled at actors and writers who had been forced to drive cabs because they were blacklisted and had even committed suicide as a result. Heston did not reply.     Steiger suffered from ": null
    },
    {
        "depression": "depression"
    },
    {
        " throughout much of his life. He described himself as incapacitated for about eight years with clinical depression before his Oscar win for In The Heat of the Night. His career problems from the 42s onwards were often exacerbated by health issues. He underwent open-heart surgery in 42 and again in 42 and struggled with obesity, though certain roles, such as Napoleon, required him to intentionally gain weight. After the decline of his third marriage in 42 a deep depression, partly a side effect of his surgery, during the 42s negatively affected his career. He became increasingly reclusive during this period, often confining himself to his apartment, watching ": null
    },
    {
        "American football": "american football"
    },
    {
        " for several hours. He said of the experience: You begin to lose self-esteem. You dont walk, you dont shave and if no one was watching youd go to the bathroom right where you were sitting . He would lie in bed at night thinking Youll never act again. Why bother? Youre no good . Despite these challenges, Steiger continued to act into the 42s and early 42s. In one of his final interviews, he stated that there was a stigma wrongfully attached to sufferers of depression and that it was caused by a chemical imbalance, not a mental disease. He commented: Pain must never be a source of shame. Its a part of life, its part of humanity.       Steiger died of ": null
    },
    {
        "pneumonia": "pneumonia"
    },
    {
        " and kidney failure at the age of 42 as a result of complications from surgery for a ": null
    },
    {
        "gall bladder": "gall bladder"
    },
    {
        " tumor": "tumor"
    },
    {
        " on July 42 42 in a Westside hospital in Los Angeles. He was buried in ": null
    },
    {
        "Forest Lawn  – Hollywood Hills Cemetery": "forest lawn memorial park"
    },
    {
        ". The film  Saving Shiloh , released in 42 was dedicated to his memory.           Steiger was one of Hollywoods most respected character actors. Hutchinson described him as one of Hollywoods most charismatic and dynamic stars . Yet for Hutchinson, Steiger remained out of sympathy with Hollywood during his career, believing that accomplished actors often struggle to find challenging films as they got older. Steiger was an effusive talent according to Lucia Bozzola of The New York Times, and was particularly noted for his intense portrayal of offbeat, often volatile and crazed characters.  After On the Waterfront , Steiger became somewhat typecast for playing tough characters and villains, and grew increasingly frustrated playing the Mafia heavy or a near-psychopath during the 42s, roles which he could play menacingly, but provided little opportunity for him to showcase his talent. Gossip columnist ": null
    },
    {
        "Louella Parsons": "louella parsons"
    },
    {
        " hailed him as the Screens No.42 Bad Man , while the newspaper  London Evening News  referred to him as the man you would love to hate if you had the coverage . A 42 publication by Dean Jennings of  The Saturday Evening Post  referred to Steiger as an angry, hot-tempered newcomer of prodigious acting talents, works best only at emotional white heat , and remarked that he found it stimulating to carry theatrical fantasy into his private life .  Pauline Kael found his performances so powerful that she believed he often seems to take over a picture even when he isnt in the lead . The journal  Films and Filming , surveying his career in 42 noted that his talent developed steadily through films good and bad , and that the secret of his success was that he stayed grounded, citing a 42 interview where he said I pity the player who cant keep his feet on the ground. Its too easy to trade on success and forget that no performer can stand still.      A product of the Actors Studio, Steiger is closely associated with method acting, embodying the characters he played. Writer James F. Scott notes that during his career, he many times put aside his own personality to think his way into an alien psyche . Steiger once said:          Steiger was so devoted to his craft that during the 42s he turned to many foreign productions, especially in Italy, to obtain the sort of roles he desired, but often clashed with directors over his method acting techniques. In one of his last interviews, Steiger said: What is the greatest thing an artist in any profession can give to a person?—that would be a constructive, warm memory. Because that gets into your brain and therefore into your life, so to speak. And thats it, when somebody says to me Ill never forget, thats worth more to me than five Academy Awards, Im in that persons life .      Film writer Paul Simpson notes how closely Steiger prepared for his roles, and how he effortlessly recreated the mannerisms of figures such as Mussolini, in a compelling take on an enigmatic figure . Judith Crist of New York Magazine, reviewing Duck, You Sucker!, commented that Steiger was totally without mannerisms, always with manner , and noted that his silences are stunningly effective .  Roger Ebert later echoed this statement, concurring that Steiger lacked mannerisms, writing, When he gets a character worth playing with, he creates it new from the bottom up, out of whole cloth. I dont know how he does it. Its almost as if he gets inside the skin of the guy hes playing and starts being that person for a while . Steiger said: I always tried to do things different. If I got a role which was similar to another Id try to do it a little different. His explosive screen performances were an influence on many later actors, including ": null
    },
    {
        "Robert De Niro": "robert de niro"
    },
    {
        ", who used Steigers portrayal of Al Capone as a reference for his own performance in  The Untouchables  . ": null
    },
    {
        "Elvis Presley": "elvis presley"
    },
    {
        " was highly impressed with Steigers powerful and wrenching performance in The Pawnbroker.     Despite Steigers acclaim as an actor, he was frequently accused of overacting and won his fair share of critics, particularly during the 42s and 42s. His acting was so dynamic at times that critics found him excessive and overbearing, and even uncomfortable or laughable to watch. Steiger once clashed with Armenian director ": null
    },
    {
        "Rouben Mamoulian": "rouben mamoulian"
    },
    {
        ", during a theatrical production of Oklahoma!, as he was intolerant of Steigers unusual acting technique . Steiger ignored the directors concerns that he was mumbling his lines, and when he began chomping loudly on an apple during a scene with Gordon MacRae, Mamoulian exclaimed: Get out of my theater. Get out of my life! , and fired him. Even Kazan found several of the Actors Studios techniques disagreeable, preferring more humor and verve and less self-indulgence, self-pity and self-awareness . Kazan felt that Steiger often displayed a competitive edge as an actor and tried to steal scenes from his co-stars. Steiger rejected these claims, insisting that he was merely trying to take the medium of acting to as far as I can go, and that why I sometimes go over the edge .     Several co-stars found working with Steiger difficult; ": null
    },
    {
        "Warren Oates": "warren oates"
    },
    {
        ", according to director Norman Jewison, viewed Steiger as somebody who had a tendency to go over the top during the making of In The Heat of the Night. Writer Richard Dyer highlights the contrast in the film between the acting styles of Steiger and Poitier, with Poitiers stillness and implied intensity and Steigers busy, exteriorised method acting . Humphrey Bogart, Steigers co-star of The Harder They Fall, referred to Steigers method acting as the scratch-your-ass-and-mumble school of acting . Director Robert Aldrich notes that Steiger had a habit of changing his lines, which often confused his co-stars. Aldrich stated: Usually I lie awake at nights trying to think of ways to improve an actors performance. With Steiger, the problem is to try and contain him . Steiger was particularly aggressive towards director Kenneth Annakin during the making of Across the Bridge, insisting on rewriting most of the script and changing many of the lines to better fit Steigers idea of the character. Annakin stated that he had never known an actor to put so much thought and preparation into a performance as Steiger. Hutchinson revealed that Steiger often suffered from panic during filming and that fear of failure haunted him throughout his life, but fear also provided him with a source of strength in his acting.              ": null
    }
]