[
    {
        "           Roger Bruce Chaffee  was an American ": null
    },
    {
        "naval officer": "officer"
    },
    {
        " and ": null
    },
    {
        "aviator": "united states naval aviator"
    },
    {
        ", ": null
    },
    {
        "aeronautical engineer": "aeronautical engineering"
    },
    {
        ", and NASA ": null
    },
    {
        "astronaut": "astronaut"
    },
    {
        " in the ": null
    },
    {
        "Apollo program": "apollo program"
    },
    {
        ".     Chaffee was born in ": null
    },
    {
        "Grand Rapids, Michigan": "grand rapids, michigan"
    },
    {
        ", where he became an ": null
    },
    {
        "Eagle Scout": "eagle scout"
    },
    {
        ". He graduated from ": null
    },
    {
        "Central High School": "central high school"
    },
    {
        " in 42 and accepted a ": null
    },
    {
        "Naval Reserve Officers Training Corps": "naval rotc"
    },
    {
        " scholarship. He began his college education at ": null
    },
    {
        "Illinois Institute of Technology": "illinois institute of technology"
    },
    {
        ", where he was involved in the fraternity ": null
    },
    {
        "Phi Kappa Sigma": "phi kappa sigma"
    },
    {
        ". He transferred to ": null
    },
    {
        "Purdue University": "purdue university"
    },
    {
        " in 42 continuing his involvement in Phi Kappa Sigma and obtaining his private pilots license.     After graduating from Purdue in 42 Chaffee completed his Navy training and was commissioned as an ": null
    },
    {
        "ensign": "ensign united states"
    },
    {
        ". He began pilot training at ": null
    },
    {
        "Naval Air Station Pensacola": "naval air station pensacola"
    },
    {
        ", Florida, flying aircraft such as the ": null
    },
    {
        "T42": "beechcraft t-34 mentor"
    },
    {
        ", ": null
    },
    {
        "T42": "north american t-28 trojan"
    },
    {
        ", and ": null
    },
    {
        "A42D": "douglas a-3 skywarrior"
    },
    {
        ". He became quality and safety control officer for ": null
    },
    {
        "Heavy Photographic Squadron 42": "vap-62"
    },
    {
        " . His time in this unit included taking crucial photos of Cuba during the ": null
    },
    {
        "Cuban Missile Crisis": "cuban missile crisis"
    },
    {
        ", earning him the ": null
    },
    {
        "Air Medal": "air medal"
    },
    {
        ". He was promoted to ": null
    },
    {
        "lieutenant commander": "lieutenant commander"
    },
    {
        " in 42     Along with thirteen other pilots, Chaffee was selected to be an astronaut as part of ": null
    },
    {
        "NASA Astronaut Group 42": "nasa astronaut group 3"
    },
    {
        " in 42 He served as ": null
    },
    {
        "capsule communicator": "capsule communicator"
    },
    {
        " for the ": null
    },
    {
        "Gemini 42": "gemini 3"
    },
    {
        " and ": null
    },
    {
        "Gemini 42": "gemini 4"
    },
    {
        " missions and received his first spaceflight assignment in 42 as the third-ranking pilot on ": null
    },
    {
        "Apollo 42": "apollo 1"
    },
    {
        ". In 42 he died in a fire along with fellow astronauts ": null
    },
    {
        "Virgil Gus Grissom": "gus grissom"
    },
    {
        " and ": null
    },
    {
        "Ed White": "ed white"
    },
    {
        " during a pre-launch test for the mission at what was then the ": null
    },
    {
        "Cape Kennedy Air Force Station Launch Complex 42": "cape canaveral air force station launch complex 34"
    },
    {
        ", Florida. He was posthumously awarded the ": null
    },
    {
        "Congressional Space Medal of Honor": "congressional space medal of honor"
    },
    {
        " and a second Air Medal.       Roger Bruce Chaffee was born on February 42 42 in ": null
    },
    {
        "Grand Rapids, Michigan": "grand rapids, michigan"
    },
    {
        ", the second child of Donald Lynn Chaffee and Blanche May Chaffee . He had an older sister, Donna, born two years earlier. In January 42 in their hometown of ": null
    },
    {
        "Greenville, Michigan": "greenville, michigan"
    },
    {
        ", his father was diagnosed with ": null
    },
    {
        "scarlet fever": "scarlet fever"
    },
    {
        ", and Mike moved in with her parents in Grand Rapids, where Roger was born. The family spent the next seven years in Greenville before moving to Grand Rapids, where his father took a job as the chief Army Ordnance inspector at the Doehler-Jarvis plant. Chaffees interest in aerospace was sparked at a young age when his father, a former ": null
    },
    {
        "barnstorming": "barnstorming"
    },
    {
        " pilot, took him on his first flight at the age of seven. Chaffee was thrilled by the flight and soon after started building model airplanes with his father.       Chaffee excelled as a ": null
    },
    {
        "Boy Scout": "scouts bsa"
    },
    {
        ", earning his first ": null
    },
    {
        "merit badge": "merit badge"
    },
    {
        " at the age of thirteen. He earned ten more badges that year. Many of these awards were typically earned by the older scouts. He continued his success by earning four more badges at the age of fourteen. He earned four badges for each of the next two years, almost all the badges available at the time. After becoming an ": null
    },
    {
        "Eagle Scout": "eagle scout"
    },
    {
        ", he managed to earn another ten merit badges, for which he was awarded the bronze and gold palms. Between his camping trips with his family and his involvement with the Boy Scouts, Chaffee developed a passion for the outdoors.       Chaffee attended the Dickinson School in Grand Rapids, and later graduated from ": null
    },
    {
        "Central High School": "central high school"
    },
    {
        " in the top 42% of his class in 42 Turning down a possible appointment to the ": null
    },
    {
        "United States Naval Academy": "united states naval academy"
    },
    {
        " at ": null
    },
    {
        "Annapolis, Maryland": "annapolis, maryland"
    },
    {
        ", he accepted a ": null
    },
    {
        "Naval Reserve Officers Training Corps": "naval rotc"
    },
    {
        " scholarship, and in September 42 enrolled at the ": null
    },
    {
        "Illinois Institute of Technology": "illinois institute of technology"
    },
    {
        ". He performed well, making the ": null
    },
    {
        "Deans List": "deans list"
    },
    {
        " and finishing with a B+ average. While enrolled, he joined ": null
    },
    {
        "Phi Kappa Sigma": "phi kappa sigma"
    },
    {
        ".      Chaffee was passionate about flying, and had a strong aptitude for science and engineering. To apply those talents, he transferred to ": null
    },
    {
        "Purdue University": "purdue university"
    },
    {
        " in the autumn of 42 to attend the schools well-known ": null
    },
    {
        "aeronautical engineering": "aeronautical engineering"
    },
    {
        " program. Before arriving in ": null
    },
    {
        "West Lafayette": "west lafayette, indiana"
    },
    {
        ", he reported for an 42-week tour on  as a part of the NROTC program. To qualify, he had to finish training and pass further tests. He initially failed the eye exam, but the physician permitted him to retake it the next morning, and he passed. He was then allowed to tour on Wisconsin to England, Scotland, France, and Cuba. Upon his return to American soil, he worked as a gear cutter.     After starting classes at Purdue, Chaffee sought out a job to complement his coursework and involvement in the Phi Kappa Sigma social fraternity. His first job during his sophomore year was working as a server at one of the womens residences, but he disliked the job and sought new employment. He was hired as a ": null
    },
    {
        "draftsman": "draftsman"
    },
    {
        " at a small business near Purdue. As a ": null
    },
    {
        "junior": "junior"
    },
    {
        ", he was hired as a teaching assistant in the Mathematics Department to teach classes to ": null
    },
    {
        "freshman": "freshman"
    },
    {
        " students. He also joined the ": null
    },
    {
        "Tau Beta Pi": "tau beta pi"
    },
    {
        " and ": null
    },
    {
        "Sigma Gamma Tau": "sigma gamma tau"
    },
    {
        " engineering honor societies.    In 42 Chaffee took four flying lessons, but he did not have enough money to get his ": null
    },
    {
        "private pilots license": "private pilots license"
    },
    {
        ". Two years later, the NROTC sponsored flight training for him to become a ": null
    },
    {
        "naval aviator": "naval aviator"
    },
    {
        ". He soloed on March 42 42 and obtained his private pilots license on May 42 42 He earned a ": null
    },
    {
        "Bachelor of Science": "bachelor of science"
    },
    {
        " degree, with distinction, in aeronautical engineering at Purdue in 42       Chaffee met his future wife Martha Louise Horn on a double blind date in September 42 They started dating, and he proposed to her on October 42 42 They married in ": null
    },
    {
        "Oklahoma City": "oklahoma city"
    },
    {
        ", Marthas hometown, on August 42 42 Martha was a homemaker. The couple had two children, Sheryl Lyn and Stephen .           After graduation, Chaffee completed his Navy training on August 42 42 and received commission as an ": null
    },
    {
        "ensign": "ensign"
    },
    {
        ". Following his honeymoon, he was assigned to the aircraft carrier  for a six-week assignment in Norfolk with the Naval Air Force, U.S. Atlantic Fleet. By the time Chaffee arrived at the base, the ship had already left port. He temporarily worked at the base until October 42 when he attended flight school at the ": null
    },
    {
        "Naval Air Station Pensacola": "naval air station pensacola"
    },
    {
        ", Florida. He started his training by flying the ": null
    },
    {
        "T42": "north american t-28 trojan"
    },
    {
        " and the ": null
    },
    {
        "T42": "beechcraft t-34 mentor"
    },
    {
        ". He was posted to the ": null
    },
    {
        "Naval Air Station Kingsville": "naval air station kingsville"
    },
    {
        ", Texas, from August 42 to February 42 as a part of Advanced Training Unit 42 In Kingsville, he trained on the ": null
    },
    {
        "F42F Cougar": "f9f cougar"
    },
    {
        " jet fighter. His daughter Sheryl was born the day before he left for his first ": null
    },
    {
        "aircraft carrier": "aircraft carrier"
    },
    {
        " training. He was awarded his naval aviator ": null
    },
    {
        "wings": "united states aviator badge"
    },
    {
        " in early 42     Chaffee was transferred to ": null
    },
    {
        "Naval Air Station Jacksonville": "naval air station jacksonville"
    },
    {
        ", Florida, to continue his training. His first project was not flying, but repairing an ": null
    },
    {
        "A42D": "douglas a-3 skywarrior"
    },
    {
        " twin-engine jet photo reconnaissance plane. This plane was typically flown by pilots with the rank of ": null
    },
    {
        "lieutenant commander": "lieutenant commander"
    },
    {
        " or above, but Chaffee became so familiar with the plane from repairing it he became one of the youngest pilots ever to fly it. He joined ": null
    },
    {
        "Attack Squadron 42": "second va-44"
    },
    {
        " in September 42 and from October 42 to March 42 he trained with ": null
    },
    {
        "Reconnaissance Attack Squadron 42": "rvah-3"
    },
    {
        " .        Chaffee received a variety of assignments and participated in multiple training duties over the next several years, spending most of his time in photo reconnaissance squadrons. He was stationed at NAS Jacksonville as safety officer and quality control officer for ": null
    },
    {
        "Heavy Photographic Squadron 42": "vap-62"
    },
    {
        " flying the A42D.  He wrote a quality control manual for the squadron, although some of his peers saw this as too demanding. By coincidence, he was assigned to a mission where he flew over ": null
    },
    {
        "Cape Canaveral": "cape canaveral"
    },
    {
        ", during which aerial photographs of future launch sites were taken.     Between April 42 42 and October 42 42 including during the critical time of the ": null
    },
    {
        "Cuban Missile Crisis": "cuban missile crisis"
    },
    {
        ", Chaffee flew 42 missions over Cuba, sometimes up to three per day, and achieved over 42 flight hours each month. Some of these trips included shuttling three men per plane back and forth to ": null
    },
    {
        "Guantanamo Bay": "guantanamo bay"
    },
    {
        ", including the pilot, co-pilot, and the photographer.  Some biographies credit him with flying the ": null
    },
    {
        "U42": "lockheed u-2"
    },
    {
        " plane to spy on Cuba, but this is erroneous since he was a Navy pilot and the U42 was an Air Force plane.     After this, Chaffee undertook aircraft carrier flight training, including time spent on  performing both day and night flights. He said of day flying, Setting that big bird down on the flight deck was like landing on a postage stamp ; and of night flying, Getting catapulted off that flight deck at night is like getting shot into a bottle of ink!  While working in Jacksonville, he concurrently worked on a ": null
    },
    {
        "masters degree": "masters degree"
    },
    {
        ". He was on a cruise to Africa when his son Stephen was born in Oklahoma City.     During Chaffees Navy service he logged more than 42 hours flying time, including more than 42 hours in jet aircraft. On February 42 42 he was promoted to ": null
    },
    {
        "lieutenant commander": "lieutenant commander"
    },
    {
        ".               In August 42 Chaffee confided in his family that he had submitted an application for the ": null
    },
    {
        "NASA": "nasa"
    },
    {
        " astronaut": "astronaut"
    },
    {
        " training program, and informed his superiors of his desire to train as a ": null
    },
    {
        "test pilot": "test pilot"
    },
    {
        " for astronaut status. In mid42 he was accepted in the initial pool of 42 applicants for the ": null
    },
    {
        "third group of NASA astronauts": "nasa astronaut group 3"
    },
    {
        ".  After his naval tour was over, and he had racked up over 42 hours of flying time, the Navy offered him the opportunity to continue work on his masters degree. In January 42 he entered the U.S. ": null
    },
    {
        "Air Force Institute of Technology": "air force institute of technology"
    },
    {
        " at ": null
    },
    {
        "Wright-Patterson Air Force Base": "wright-patterson air force base"
    },
    {
        " in ": null
    },
    {
        "Dayton, Ohio": "dayton, ohio"
    },
    {
        ", to work on his ": null
    },
    {
        "Master of Science": "master of science"
    },
    {
        " degree in ": null
    },
    {
        "reliability engineering": "reliability engineering"
    },
    {
        ".     While at AFIT, Chaffee continued participating in astronaut candidate testing as the pool of candidates dropped to 42 in mid42 It was noted during testing that he had a very small lung capacity but he used it better than most people with greater capacity. On his return from a hunting trip to ": null
    },
    {
        "Fairborn, Ohio": "fairborn, ohio"
    },
    {
        ", on October 42 42 he found a message from NASA in ": null
    },
    {
        "Houston": "houston"
    },
    {
        ", Texas. He called them back, and discovered he had been chosen as an astronaut. On October 42 42 it was officially announced that he was one of fourteen chosen for NASAs third group of astronauts. He said, I was very pleased with the appointment. Ive always wanted to fly and perform adventurous flying tasks all my life. Ever since the first ": null
    },
    {
        "seven Mercury astronauts": "mercury seven"
    },
    {
        " were named, Ive been keeping my studies up.           Phase one of training for the third group of astronauts began in 42 in lecture halls. Lectures in several fields were supplemented with trips to locations with geological significance so the astronauts gained hands-on experience. As well as piloting the spacecraft, the astronauts were to perform scientific experiments and measurements on the Moon. The astronauts traveled to the ": null
    },
    {
        "Grand Canyon": "grand canyon"
    },
    {
        " to learn about geography and to Alaska, Iceland, and Hawaii to learn about rock formations and lava flows.     The second phase was contingency training, which focused on astronauts learning the skills required to survive if the landing did not occur where planned. The group started their training by being dropped off in the middle of the jungle in Panama. They performed the survival training in pairs, carrying only their parachutes and survival kits. Chaffee, with help from his Boy Scout training, foraged for enough food to survive during the three-day training mission. Following the jungle training, the astronauts traveled to an entirely different environment: the desert of ": null
    },
    {
        "Reno, Nevada": "reno, nevada"
    },
    {
        ". For clothing, the astronauts had only long underwear, shoes, and robes they manufactured from their parachutes. Lizards and snakes were the main source of food, and the astronauts used their parachutes as makeshift tents for shelter for the two days of desert training.     The third and final phase was operational training for the astronauts. This focused on giving them hands-on experience using the instruments and equipment required during their spaceflight. They received training in the effects of ": null
    },
    {
        "microgravity": "microgravity"
    },
    {
        " and rapid ": null
    },
    {
        "acceleration": "acceleration"
    },
    {
        ". The astronauts spent time in simulators, aboard cargo planes that simulated weightlessness, underwater to practice ": null
    },
    {
        "extravehicular activities": "extravehicular activity"
    },
    {
        " , and on visits to manufacturing plants to check on the progress of the hardware.          Every astronaut was required to have a specialty, and Chaffees specialty was communications. He focused on the Deep Space Instrumentation Facility , which the astronauts needed for navigation in space.     At the ": null
    },
    {
        "Manned Spacecraft Center": "manned spacecraft center"
    },
    {
        " in Houston, Chaffee served as ": null
    },
    {
        "capsule communicator": "capsule communicator"
    },
    {
        " in March 42 for ": null
    },
    {
        "Gemini 42": "gemini 3"
    },
    {
        ".  Later that year, he was CAPCOM, along with ": null
    },
    {
        "Virgil Gus Grissom": "gus grissom"
    },
    {
        " and ": null
    },
    {
        "Eugene Cernan": "eugene cernan"
    },
    {
        ", for the ": null
    },
    {
        "Gemini 42": "gemini 4"
    },
    {
        " mission, in which ": null
    },
    {
        "Ed White": "ed white"
    },
    {
        " performed the first spacewalk by an American. As CAPCOM, Chaffee relayed information between the crew members and the Director of Flight Operations, ": null
    },
    {
        "Chris Kraft": "christopher c. kraft jr."
    },
    {
        ". He never got a seat on a ": null
    },
    {
        "Gemini": "project gemini"
    },
    {
        " mission, but was assigned to work on flight control, communications, instrumentation, and attitude and translation control systems in the ": null
    },
    {
        "Apollo program": "apollo program"
    },
    {
        ". During this time, along with Grissom, he also flew chase planes at an altitude of between  to take motion pictures of the launch of an uncrewed ": null
    },
    {
        "Saturn 42B": "saturn 1b"
    },
    {
        " rocket.           Chaffee received his first spaceflight assignment in January 42 when he was selected for the first crewed Apollo-Saturn flight, AS42 At the time, he was the youngest American astronaut to be selected for a mission.  Joining Command Pilot Grissom and Senior Pilot White, he replaced the injured ": null
    },
    {
        "Donn F. Eisele": "donn f. eisele"
    },
    {
        " in the third-ranked pilot position. Eisele required surgery for a dislocated shoulder, which he sustained aboard the ": null
    },
    {
        "KC42 weightlessness training aircraft": "reduced gravity aircraft"
    },
    {
        ". He was reassigned to a second Apollo crew, commanded by ": null
    },
    {
        "Wally Schirra": "wally schirra"
    },
    {
        ".      The crew announcement was made public on March 42 42 The two-week flight of Apollo42 was to test the spacecraft systems and the control and ground tracking facilities. While Chaffee had monitored the manufacture of the ": null
    },
    {
        "Gemini spacecraft": "gemini"
    },
    {
        ", he had not witnessed the building of the Apollo spacecraft. Three days after being selected for the Apollo42 crew, he flew to the ": null
    },
    {
        "North American Aviation": "north american aviation"
    },
    {
        " Plant in Downey, California, to see it.     Later in April, the crew traveled to Chapel Hill, North Carolina, to study stars that were programmed into their flight computer. In October, the six crewmembers planned to test the spacecraft in sea level and altitude conditions. The failure of an oxygen regulator prevented them from performing the vacuum test, but they managed to complete the sea level test. They also performed egress tests, where capsule simulators were dropped in the Gulf of Mexico under various conditions and the crew had to exit the spacecraft. The crew was able to spend time with their families at Christmas. Chaffee entered a local Christmas decoration contest and he received first prize. Four Purdue astronauts were requested to attend the Rose Bowl as guests of honor. Grissom, ": null
    },
    {
        "Gene Cernan": "gene cernan"
    },
    {
        ", Armstrong, and Chaffee attended the game on January 42 Progress on pre-mission activities was nearing completion; NASA announced January 42 that February 42 would be the target launch date. The primary and backup crews moved back to the Cape for the last few weeks of training. They had their own living quarters, a private waiter and chef, and gymnasium to remain fit.        On January 42 42 Grissom, White and Chaffee were participating in a plugs-out countdown demonstration test at ": null
    },
    {
        "Cape Kennedy": "cape kennedy"
    },
    {
        " in preparation for the planned February 42 launch. Chaffee was sitting at the right side of the cabin. His main role was to maintain communications with the ": null
    },
    {
        "blockhouse": "blockhouse"
    },
    {
        ". A momentary power surge was detected at 42:42:42 GMT, which was believed to accompany an electrical short in equipment located on the lower left side of the cabin, the presumed ignition source for the fire. At 42:42:42 GMT, a voice was heard declaring, e got a fire in the cockpit. Most investigative listeners believe that voice was Chaffees.     Assigned emergency roles called for Grissom, in the left-hand seat, to open the cabin pressure vent valve, after which White in the center seat was to open the ": null
    },
    {
        "plug door": "plug door"
    },
    {
        " hatch, while Chaffee in the right-hand seat was to maintain communications. Grissom was prevented from opening the valve by the intensity of the fire, which started in that region and spread from left to right. Despite this, White removed his restraints and apparently tried in vain to open the hatch, which was held closed by the cabin pressure. The increasing pressure finally burst the inner cabin wall on the right-hand side at 42:42:42 GMT. After approximately thirty seconds of being fed by a cabin atmosphere of pure ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        " at pressures of , and now fed by nitrogen-buffered ambient air, the primary fire decreased in intensity and started producing large amounts of smoke, which killed the astronauts. Chaffee lost consciousness because of a lack of oxygen which sent him into ": null
    },
    {
        "cardiac arrest": "cardiac arrest"
    },
    {
        ". He died from ": null
    },
    {
        "asphyxia": "asphyxia"
    },
    {
        " due to the toxic gases from the fire, with burns contributing to his death.     Failed oxygen and ": null
    },
    {
        "ethylene glycol": "ethylene glycol"
    },
    {
        " pipes near the fires origin point continued burning an intense secondary fire which melted through the cabin floor. By the time firefighters were able to open the hatch, the fire had extinguished itself. The back of Chaffees couch was found in the horizontal position, with the lower portion angled towards the floor. His helmet was closed and locked, his restraints were undone, and the hoses and electrical connections to the suit remained connected. As he was farthest from the origin of the fire, he suffered the least burn and suit damage.            Shortly after the AS42 fire in 42 NASA Associate Administrator for Manned Spaceflight ": null
    },
    {
        "George Mueller": "george mueller"
    },
    {
        " announced the mission would be officially designated as Apollo 42   The capsule underwent a significant redesign as a result of the disaster. The atmosphere in the cabin was changed from 42% oxygen to a 42% oxygen and 42% nitrogen environment at launch. The astronauts spacesuits, originally made of ": null
    },
    {
        "nylon": "nylon"
    },
    {
        ", were changed to ": null
    },
    {
        "beta cloth": "beta cloth"
    },
    {
        ", a non-flammable, highly melt-resistant fabric woven from ": null
    },
    {
        "fiberglass": "fiberglass"
    },
    {
        " and coated with ": null
    },
    {
        "Teflon": "teflon"
    },
    {
        ". There were other changes, including replacing flammable cabin materials with self-extinguishing ones, and covering plumbing and wiring with protective insulation.      Chaffee and Grissom were buried in ": null
    },
    {
        "Arlington National Cemetery": "arlington national cemetery"
    },
    {
        ",  while White was buried at ": null
    },
    {
        "West Point Cemetery": "west point cemetery"
    },
    {
        ".  Chaffees widow received $42 from the life insurance portion of the contract the astronauts signed with two publishing firms so they would have exclusive rights to stories and photographs of the astronauts and their families. She also received $42 per year for the life of the contract.           Chaffee is memorialized in many ways, from the ": null
    },
    {
        "Chaffee Crater": "chaffee"
    },
    {
        " on the ": null
    },
    {
        "far side": "far side of the moon"
    },
    {
        " of the ": null
    },
    {
        "Moon": "moon"
    },
    {
        ", to the ": null
    },
    {
        "Roger B. Chaffee Planetarium": "roger b. chaffee planetarium"
    },
    {
        " in his hometown of Grand Rapids, Michigan.  Another memorial is a hill on ": null
    },
    {
        "Mars": "mars"
    },
    {
        ", Chaffee Hill,  south-southwest of ": null
    },
    {
        "Columbia Memorial Station": "columbia memorial station"
    },
    {
        ", part of the ": null
    },
    {
        "Apollo 42 Hills": "apollo 1 hills"
    },
    {
        ".  Regor , is a seldom-used nickname for the star ": null
    },
    {
        "Gamma Velorum": "gamma velorum"
    },
    {
        ". Grissom used this name, plus two others for White and himself, on his Apollo42 mission planning star charts as a joke, and the succeeding Apollo astronauts kept using the names as a memorial.  commentary at 42:42:42  A terrestrial memorial is Chaffee Island, an ": null
    },
    {
        "artificial island": "artificial island"
    },
    {
        " off of Long Beach, California, created in 42 for drilling oil .   A park in ": null
    },
    {
        "Fullerton, California": "fullerton, california"
    },
    {
        ", was named after Chaffee; parks were also named after his fellow Apollo42 comrades.  Chaffee is named with his Apollo42 crewmates on the ": null
    },
    {
        "Space Mirror Memorial": "space mirror memorial"
    },
    {
        ", which was dedicated in 42   Chaffees name is included on the plaque left on the Moon with the  Fallen Astronaut  statue in 42 by the crew of ": null
    },
    {
        "Apollo 42": "apollo 15"
    },
    {
        ".      The dismantled ": null
    },
    {
        "Launch Pad 42": "cape canaveral air force station launch complex 34"
    },
    {
        " at Cape Canaveral bears two memorial plaques:               The Roger B. Chaffee scholarship named for him has been awarded annually since 42 to exceptional students in the Kent Intermediate School District for high school seniors who will be pursuing a career in math and science.   Chaffee Hall, an engineering building, was dedicated to him at his ": null
    },
    {
        "alma mater": "alma mater"
    },
    {
        ", Purdue University, in 42   Grissom High School, Ed White Middle School and Chaffee Elementary School in Huntsville, Alabama, were named for the Apollo42 astronauts.        Chaffee was awarded the Navy ": null
    },
    {
        "Air Medal": "air medal"
    },
    {
        " for his involvement in Heavy Photographic Squadron 42 He completed 42 classified missions of paramount military importance to the security of the United States . The Apollo42 crew was awarded the ": null
    },
    {
        "NASA Distinguished Service Medal": "nasa distinguished service medal"
    },
    {
        " posthumously in a 42 presentation of the ": null
    },
    {
        "Presidential Medal of Freedom": "presidential medal of freedom"
    },
    {
        " to the Apollo 42 crew.  He was posthumously awarded a second Air Medal. He was inducted into the ": null
    },
    {
        "International Space Hall of Fame": "new mexico museum of space history"
    },
    {
        " in 42 and into the ": null
    },
    {
        "U.S. Astronaut Hall of Fame": "united states astronaut hall of fame"
    },
    {
        ", on October 42 42    Chaffee and White were awarded the ": null
    },
    {
        "Congressional Space Medal of Honor": "congressional space medal of honor"
    },
    {
        " posthumously in 42 .  He was later awarded the NASA Ambassador of Exploration Award for involvement in the U.S. space program in 42      In 42 a life-size bronze statue of Chaffee was unveiled outside the Grand Rapids Childrens Museum in Chaffees hometown. His wife, other family members, and astronaut ": null
    },
    {
        "Jack Lousma": "jack lousma"
    },
    {
        " were present for the event. ": null
    }
]