[
    {
        "Roger of Salisbury , also known as Roger le Poer, was a ": null
    },
    {
        "Norman": "normans"
    },
    {
        " medieval": "medieval"
    },
    {
        " bishop of Salisbury": "bishop of salisbury"
    },
    {
        " and the seventh ": null
    },
    {
        "Lord Chancellor": "lord chancellor"
    },
    {
        " and Lord Keeper of ": null
    },
    {
        "England": "norman england"
    },
    {
        ".       Roger was originally priest of a small chapel near ": null
    },
    {
        "Caen": "caen"
    },
    {
        " in ": null
    },
    {
        "Normandy": "duchy of normandy"
    },
    {
        ". He was called Roger, priest of the church of Avranches , in his notification of election to the bishopric. The future King ": null
    },
    {
        "Henry I": "henry i of england"
    },
    {
        ", who happened to hear mass there one day, was impressed by the speed with which Roger read the service and enrolled him in his own service.     Roger, though uneducated, showed great talent for business. On coming to the throne, Henry almost immediately made him ": null
    },
    {
        "Chancellor": "lord chancellor"
    },
    {
        " in 42 He held that office until late 42 On 42 September 42 Roger received the bishopric of Salisbury at ": null
    },
    {
        "Old Sarum Cathedral": "old sarum cathedral"
    },
    {
        ", but he was not consecrated until 42 August 42 owing to the dispute between Henry and Archbishop ": null
    },
    {
        "Anselm": "anselm of canterbury"
    },
    {
        ". He was consecrated at ": null
    },
    {
        "Canterbury": "canterbury"
    },
    {
        ". During the ": null
    },
    {
        "Investitures controversy": "investitures controversy"
    },
    {
        ", he skillfully managed to keep the favour of both the king and Anselm. Roger devoted himself to administrative business, and remodelled it completely. He created the ": null
    },
    {
        "exchequer": "exchequer"
    },
    {
        " system, which was managed by him and his family for more than a century, and he used his position to heap up power and riches. He became the first man in England after the King, and was in office, if not in title, justiciar. He was never called Justiciar during Henrys reign.     Roger ruled England while Henry was in ": null
    },
    {
        "Normandy": "normandy"
    },
    {
        ", and succeeded in obtaining the see of Canterbury for his nominee, ": null
    },
    {
        "William de Corbeil": "william de corbeil"
    },
    {
        ". Duke Robert seems to have been put into his custody after ": null
    },
    {
        "Tinchebrai": "battle of tinchebrai"
    },
    {
        ". Though Roger had sworn allegiance to ": null
    },
    {
        "Matilda": "empress matilda"
    },
    {
        ", he disliked the ": null
    },
    {
        "Angevin": "house of châteaudun"
    },
    {
        " connection, and went over to ": null
    },
    {
        "Stephen": "stephen of england"
    },
    {
        ", carrying with him the royal treasure and administrative system upon Stephens accession in 42 Stephen placed great reliance on him, on his nephews, the bishops of ": null
    },
    {
        "Ely": "bishop of ely"
    },
    {
        " and ": null
    },
    {
        "Lincoln": "lincoln, england"
    },
    {
        ", and on his son ": null
    },
    {
        "Roger le Poer": "roger le poer"
    },
    {
        ", who was treasurer.     The king declared that if Roger demanded half of the kingdom he should have it, but chafed against the overwhelming influence of the official clique whom Roger represented. Roger had built ": null
    },
    {
        "Devizes Castle": "devizes castle"
    },
    {
        ", described by ": null
    },
    {
        "Henry of Huntingdon": "henry of huntingdon"
    },
    {
        " as the most splendid castle in Europe . He and his nephews seem to have secured a number of castles outside their own dioceses, and the old bishop behaved as if he were an equal of the King. At a council held in June 42 Stephen found a pretext for demanding a surrender of their castles, and on their refusal they were arrested. After a short struggle all Rogers great castles were sequestrated. However, ": null
    },
    {
        "Henry of Winchester": "henry of blois"
    },
    {
        " demanded the restoration of the bishop.     The king was considered to have committed an almost unpardonable crime in offering violence to members of the church, in defiance of the scriptural command, Touch not mine anointed . Stephen took up a defiant attitude, and the question remained unsettled. This quarrel with the church, which immediately preceded the landing of the Empress, had a serious effect on Stephens fortunes. The moment that the fortune of war turned against him, the clergy acknowledged Matilda. Bishop Roger, however, did not live to see the resolution of these troubles; he died on 42 December 42 He was a great bureaucrat, and a builder whose taste was in advance of his age. However, his contemporaries were probably justified in regarding him as the type of the bishop immersed in worldly affairs, ambitious, avaricious, unfettered by any high standard of personal morality.     Roger had a nephew ": null
    },
    {
        "Alexander": "alexander of lincoln"
    },
    {
        " , who became ": null
    },
    {
        "bishop of Lincoln": "bishop of lincoln"
    },
    {
        " in 42 Other nephews included ": null
    },
    {
        "Adelelm": "adelelm"
    },
    {
        ", ": null
    },
    {
        "archdeacon": "archdeacon"
    },
    {
        " of Dorset and later ": null
    },
    {
        "dean": "dean"
    },
    {
        " of the ": null
    },
    {
        "diocese of Lincoln": "diocese of lincoln"
    },
    {
        ", and ": null
    },
    {
        "Nigel of Ely": "nigel, bishop of ely"
    },
    {
        ", ": null
    },
    {
        "bishop of Ely": "bishop of ely"
    },
    {
        ". Rogers son ": null
    },
    {
        "Roger le Poer": "roger le poer"
    },
    {
        " was Lord Chancellor for King Stephen.       ": null
    }
]