[
    {
        "             Roll-your-own cigarettes  refer to ": null
    },
    {
        "cigarettes": "Cigarette"
    },
    {
        "made from loose ": null
    },
    {
        "tobacco": "Tobacco"
    },
    {
        " and ": null
    },
    {
        "rolling paper": "Rolling Paper"
    },
    {
        ". Roll-your-own products are sold in pouches or as tins of tobacco, sometimes including the rolling papers or ": null
    },
    {
        "cigarette tube": "Cigarette Tube"
    },
    {
        "s. Loose filters are available for purchase and can be added to the rolled cigarettes. Some people use a machine to assist them and some people use pre-rolled cones or ": null
    },
    {
        "cigarette tube": "Cigarette Tube"
    },
    {
        "s.     Hand-rolled cigarettes give smokers the ability to roll cigarettes of any diameter, thereby varying the strength of the cigarette. Technological aids—from hand injectors to large in-store machines—aid in the process.     In the United States, the Internal Revenue section of the tax code includes a personal exemption for people who make their own cigarettes and tobacco .     An amendment to the 2012 federal transportation bill caused roll-your-own cigarette shops to struggle and consider closing. In order for shops to continue using machines, owners must obtain a manufacturers permit, file a bond, pay the applicable federal cigarette tax rate, keep records, print required markings on packages used for manufactured cigarettes, affix the ": null
    },
    {
        "U.S. Surgeon Generals": "U.S. Surgeon General"
    },
    {
        "warning labels to packages and comply with the U.S. ": null
    },
    {
        "Food and Drug Administrations": "Food And Drug Administration"
    },
    {
        "minimum cigarette package size.     In Europe, EU regulations for ": null
    },
    {
        "tar": "Tar"
    },
    {
        " and ": null
    },
    {
        "nicotine": "Nicotine"
    },
    {
        " levels in cigarettes do not apply to rolling tobacco. Hand-rolling tobacco is taxed and priced at a lower level – about half that of packaged cigarettes. In countries where cigarettes are cheap or rolling tobacco is expensive, very few people use RYO cigarettes. By contrast, in the Netherlands about half of all tobacco smoked in the country is RYO because of price differences.          The minimum supplies to roll cigarettes are tobacco and rolling papers. Some prefer to use equipment to aid them in rolling. These can include mechanical ": null
    },
    {
        "rolling machines": "Rolling Machine"
    },
    {
        "and cigarette injectors . Filters can also be added when using a rolling machine, and filter tubes are used when making cigarettes with an injector.       Rolling tobacco, or cigarette tobacco, is the primary tobacco used for RYO cigarettes. It is generally packaged in pouches. After 2009, the United States federal tax rate on RYO tobacco was raised from $1.0969 per pound to $24.78 per pound.  This increase has caused many people to switch to using pipe tobacco to make cigarettes, since the pipe tobacco tax rate was also increased, but only to $2.83 per pound.            Backroll is a widely used method for hand-rolling a cigarette. The method involves inversion of the rolling paper, so that the gum strip faces the inside. Once rolled, the gum can then be licked through the paper and torn off, thus removing any excess paper. This technique was developed due to the alleged increased heat generated by smoking tobacco wrapped in multiple layers of paper.       RYO has become more popular in the United States in recent years, but relatively few smokers, only 6.7%, actually roll their own cigarettes. In contrast, this rate was 15% in Canada, 22% in Australia, and 30% in the UK. ": null
    }
]