[
    {
        "        The Romaniote Jews or Romaniotes  are an ": null
    },
    {
        "ethnic Jewish": "jewish ethnic divisions"
    },
    {
        " community native to the ": null
    },
    {
        "Eastern Mediterranean": "eastern mediterranean"
    },
    {
        ". They are one of the oldest Jewish communities in existence and the oldest Jewish community in ": null
    },
    {
        "Europe": "europe"
    },
    {
        ". Their distinct language was ": null
    },
    {
        "Judaeo-Greek": "yevanic"
    },
    {
        ", a Greek dialect that contained Hebrew along with some ": null
    },
    {
        "Aramaic": "aramaic"
    },
    {
        " and ": null
    },
    {
        "Turkish": "turkish language"
    },
    {
        " words but now speak ": null
    },
    {
        "modern Greek": "modern greek"
    },
    {
        " or the languages of their new home countries. They derived their name from the old name for the people of the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        ", ": null
    },
    {
        "Romaioi": "byzantine greeks"
    },
    {
        ". Large communities were located in ": null
    },
    {
        "Thebes": "thebes, greece"
    },
    {
        ", ": null
    },
    {
        "Ioannina": "ioannina"
    },
    {
        ", ": null
    },
    {
        "Chalcis": "chalcis"
    },
    {
        ", ": null
    },
    {
        "Corfu": "corfu"
    },
    {
        ", ": null
    },
    {
        "Arta": "arta, greece"
    },
    {
        ", ": null
    },
    {
        "Preveza": "preveza"
    },
    {
        ", ": null
    },
    {
        "Volos": "volos"
    },
    {
        ", ": null
    },
    {
        "Patras": "patras"
    },
    {
        ", ": null
    },
    {
        "Corinth": "corinth, greece"
    },
    {
        ", and on the islands of ": null
    },
    {
        "Zakynthos": "zakynthos"
    },
    {
        ", ": null
    },
    {
        "Lesbos": "lesbos"
    },
    {
        ", ": null
    },
    {
        "Chios": "chios"
    },
    {
        ", ": null
    },
    {
        "Samos": "samos"
    },
    {
        ", ": null
    },
    {
        "Rhodes": "rhodes"
    },
    {
        ", and ": null
    },
    {
        "Cyprus": "history of the jews in cyprus"
    },
    {
        ", among others. The Romaniotes are historically distinct and still remain distinct from the ": null
    },
    {
        "Sephardim": "sephardim"
    },
    {
        ", who settled in Ottoman Greece after the 42 ": null
    },
    {
        "expulsion of the Jews from Spain": "alhambra decree"
    },
    {
        ".     A majority of the Jewish population of Greece was killed in the ": null
    },
    {
        "Holocaust": "holocaust"
    },
    {
        " after ": null
    },
    {
        "Axis powers": "axis powers"
    },
    {
        " occupied Greece": "axis occupation of greece during world war ii"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". They deported most of the Jews to ": null
    },
    {
        "Nazi concentration camps": "nazi concentration camps"
    },
    {
        ". After the war, a majority of the survivors emigrated to ": null
    },
    {
        "Israel": "israel"
    },
    {
        ", the United States, and Western Europe. Today there are still functioning Romaniote Synagogues in ": null
    },
    {
        "Chalkis": "chalkis"
    },
    {
        " which represents the oldest Jewish congregation on European ground, in Ioannina, Athens, New York and Israel.       The name Romaniote refers to the medieval ": null
    },
    {
        "Eastern Roman Empire": "byzantine empire"
    },
    {
        ", which included the territory of modern Greece, and was for centuries the homeland of this Jewish group. Historically, the Empire was commonly referred to as Rhomania  and its Christian citizens as Rhomaioi, while the Greek-speaking Jews were called Romaniotes; both terms have the meaning of the ": null
    },
    {
        "Demonym": "demonym"
    },
    {
        " Romans. Further Information: ": null
    },
    {
        "Ῥωμαῖοι": "names of the greeksromans"
    },
    {
        ".                     Jews have lived in Greece long before the ": null
    },
    {
        "Second Temple": "second temple"
    },
    {
        " era. The Greek Judaism dates back over 42 years to the time of ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        ".  My Jewish Learning , 42.42; retrieved on 42.42 The earliest reference to a ": null
    },
    {
        "Greek Jew": "greek jew"
    },
    {
        " is an inscription dated c. 42–42 BC, found in ": null
    },
    {
        "Oropos": "oropos"
    },
    {
        ", a small coastal town between ": null
    },
    {
        "Athens": "athens"
    },
    {
        " and ": null
    },
    {
        "Boeotia": "boeotia"
    },
    {
        ", which refers to Moschos, son of Moschion the Jew , who may have been a ": null
    },
    {
        "slave": "slavery in antiquity"
    },
    {
        ".      On the Island ": null
    },
    {
        "Aegina": "aegina"
    },
    {
        " a ": null
    },
    {
        "Hellenistic Jewish": "hellenistic judaism"
    },
    {
        " synagogue was discovered in 42 in the capital of the Island, near the ancient military port. The synagogue was originally discovered by the Scottish German historian ": null
    },
    {
        "Ludwig Ross": "ludwig ross"
    },
    {
        ", from the royal court of King ": null
    },
    {
        "Otto of Greece": "otto of greece"
    },
    {
        ". The floor was covered in order to be protected and was studied again by Thiersch in 42 Furtwängler in 42 E. Sukenik in 42 and finally by the German archaeologist Dr. G. Welter, in 42 The studies were completed by the National Archaeological Service.   Based on the quality of the floors mosaic, the building is believed to have been constructed in the 42th century AD and was used until the 42th century AD. The mosaic floor of the synagogue still survives and is made up of multi-colored ": null
    },
    {
        "tesserae": "tesserae"
    },
    {
        ", that create the impression of a carpet, in a geometric pattern of blue, gray, red and white. Two Greek inscriptions were found in front of the synagogues entrance, on the western side of the building. Today, only part of the synagogues mosaic floor is extant, and it has been moved from its original location to the courtyard of the islands Archaeological Museum. In 42 another ancient Synagogue was discovered in Athens, the ": null
    },
    {
        "Synagogue in the Agora of Athens": "synagogue in the agora of athens"
    },
    {
        ", which may be the Synagogue that ": null
    },
    {
        "Paul the Apostle": "paul the apostle"
    },
    {
        " preached. Inscriptions in the ": null
    },
    {
        "Samaritan": "samaritan alphabet"
    },
    {
        " and the ": null
    },
    {
        "Greek alphabet": "greek alphabet"
    },
    {
        " found in Thessaloniki may originate from ": null
    },
    {
        "Samaritan": "samaritans"
    },
    {
        " synagogues. Concurrently the oldest synagogue found in the ": null
    },
    {
        "diaspora": "jewish diaspora"
    },
    {
        " is also the oldest Samaritan synagogue; it is the ": null
    },
    {
        "Delos Synagogue": "delos synagogue"
    },
    {
        " which has been discovered so far on the island of ": null
    },
    {
        "Delos": "delos"
    },
    {
        ", with an inscription dated between 42 and 42 BCE Pummer, R. Biblical Archaeology Review . May/June 42 – via Center for Online Judaic Studies, cojs.org. The Oldest Original Synagogue Building in the Diaspora: The Delos Synagogue Reconsidered, Monika Trümper Hesperia, Vol. 42 No. 42 , pp. 4242     The Romaniotes are Greek Jews, distinct from both ": null
    },
    {
        "Ashkenazim": "ashkenazim"
    },
    {
        " and ": null
    },
    {
        "Sephardim": "sephardim"
    },
    {
        ", who trace back their history to the times of the Greek-speaking ": null
    },
    {
        "Byzantine Jews": "history of the jews in the byzantine empire"
    },
    {
        " and can be subdivided in a wider sense in a Rabbanite community and in the Greco-Karaite community of the ": null
    },
    {
        "Constantinopolitan Karaites": "constantinopolitan karaites"
    },
    {
        " which still survives to this day.    Istanbul Karaylari Istanbul Enstitüsü Dergisi 42 : 4242 A Romaniote oral tradition tells that the first Jews arrived in ": null
    },
    {
        "Ioannina": "ioannina"
    },
    {
        " shortly after the destruction of the ": null
    },
    {
        "Second Temple": "second temple"
    },
    {
        " in ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        " in 42 AD.     Before the migration of the Ashkenazi and the Sephardi Jews into the Balkans and Eastern Europe, the Jewish culture in these areas consisted primarily of Romaniote Jews.      The Romaniote ": null
    },
    {
        "Rites": "minhag"
    },
    {
        " represent those of the Greek-speaking Jews of the Byzantine empire, ranging from southern Italy  in the west, to much of Turkey in the East, Crete to the south, Crimea  to the north and the Jews of the early medieval ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " and ": null
    },
    {
        "Eastern Europe": "eastern europe"
    },
    {
        ".      The ": null
    },
    {
        "Sefer Yosippon": "josippon"
    },
    {
        " was written down in the 42th century in Byzantine ": null
    },
    {
        "Southern Italy": "catepanate of italy"
    },
    {
        " by the Greek-speaking Jewish community there. ": null
    },
    {
        "Judah Leon ben Moses Mosconi": "judah leon ben moses mosconi"
    },
    {
        ", a Romaniote Jew from ": null
    },
    {
        "Achrida": "ohrid"
    },
    {
        " edited and expanded the Sefer Josippon later. Norman Roth, Medieval Jewish Civilisation: An Encyclopedia, 42 p. 42  This community of Byzantine Jews of southern Italy produced such prominent works like the Sefer Ahimaaz of ": null
    },
    {
        "Ahimaaz ben Paltiel": "ahimaaz ben paltiel"
    },
    {
        ", the Sefer Hachmoni of ": null
    },
    {
        "Shabbethai Donnolo": "shabbethai donnolo"
    },
    {
        ", the Aggadath Bereshit and many ": null
    },
    {
        "Piyyut": "piyyut"
    },
    {
        "im. Magdalino, P. and Mavroudi, M. The Occult Sciences in Byzantium, 42 p. 42 Kohen, E. History of the Byzantine Jews: A Microcosmos in the Thousand Year Empire, 42 p. 42 Dönitz, S. Historiography among Byzantine Jews: The case of Sefer Yosippon Bowman, S. Jewish Responses to Byzantine Polemics from the Ninth through the Eleventh Centuries, 42 Howell, H. and Rogers, Z. A Companion to Josephus, 42 The liturgical writings of these Romaniote Jews, especially the piyyut were eminent for the development of the ": null
    },
    {
        "Ashkenazi": "nusach ashkenaz"
    },
    {
        " Mahzor": "mahzor"
    },
    {
        ", as they found their way through Italy to ": null
    },
    {
        "Ashkenaz": "ashkenaz"
    },
    {
        " and are preserved to this day in the most Ashkenazi mahzorim. Bowman, S. Jews of Byzantium, p. 42 Cf. Hebrew Studies by Yonah David, Shirei Zebadiah , Shirei Amitai and Shirei Elya bar Schemaya ; and the material in the Chronicle of Ahimaaz.     The Jews of Southern Italy continued to be Greek-speakers until the 42th century . When they were expelled and went to different regions of Greece, especially ": null
    },
    {
        "Corfu": "corfu"
    },
    {
        ", ": null
    },
    {
        "Epirus": "epirus"
    },
    {
        " and ": null
    },
    {
        "Thessaloniki": "thessaloniki"
    },
    {
        ", they could continue speak their Greek language, even if this language was somewhat different from that of Greece. Linda Safran, The Medieval Salento: Art and Identity in Southern Italy, 42      In the 42th century, ": null
    },
    {
        "Benjamin of Tudela": "benjamin of tudela"
    },
    {
        " travelled through the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " and recorded details about communities of Jews in ": null
    },
    {
        "Corfu": "corfu"
    },
    {
        ", ": null
    },
    {
        "Arta": "arta, greece"
    },
    {
        ", Aphilon, ": null
    },
    {
        "Patras": "patras"
    },
    {
        ", ": null
    },
    {
        "Corinth": "corinth"
    },
    {
        ", ": null
    },
    {
        "Thebes": "thebes, greece"
    },
    {
        ", ": null
    },
    {
        "Chalkis": "chalkis"
    },
    {
        ", ": null
    },
    {
        "Thessaloniki": "thessaloniki"
    },
    {
        ", and ": null
    },
    {
        "Drama": "drama, greece"
    },
    {
        ". The largest community in Greece at that time was in Thebes, where he found about 42 Jews. They were engaged mostly in cloth dyeing, ": null
    },
    {
        "weaving": "weaving"
    },
    {
        ", in producing of silverware and making silk garments. At the time, they were already known as Romaniotes .        The first Romaniote synagogue under ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        " rule was Etz ha-Hayyim  in ": null
    },
    {
        "Prousa": "bursa"
    },
    {
        " in ": null
    },
    {
        "Asia Minor": "asia minor"
    },
    {
        " which passed to Ottoman authority in 42  After ": null
    },
    {
        "Sultan": "sultan"
    },
    {
        " Mehmed II": "mehmed ii"
    },
    {
        "s ": null
    },
    {
        "Conquest of Constantinople": "fall of constantinople"
    },
    {
        " he found the city in a state of disarray. After suffering ": null
    },
    {
        "many sieges": "list of sieges of constantinople"
    },
    {
        ", ": null
    },
    {
        "a devastating conquest": "siege of constantinople"
    },
    {
        " by ": null
    },
    {
        "Catholic": "catholicism"
    },
    {
        " Crusaders": "crusades"
    },
    {
        " in 42 and even a case of the ": null
    },
    {
        "Black Death": "black death"
    },
    {
        " in 42 , Channel 42 – History. the city was a shade of its former glory. The event of the conquest of Constantinople, despite the city was in a state of disarray, was written down by a Romaniote Payetan in a lament hymn, composed with several phrases from the Old Testament in the shibusi style. A. Sharon: A Hebrew lament from Venetian Crete on the fall of Constantinople 42 As Mehmed wanted the city as his new capital, he decreed the rebuilding of the city. Inalcik, Halil. The Policy of Mehmed II toward the Greek Population of Istanbul and the Byzantine Buildings of the City. Dumbarton Oaks Papers 42 : 42–42pg42 And in order to revivify Constantinople he ordered that ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        "s, ": null
    },
    {
        "Christians": "christians"
    },
    {
        " and ": null
    },
    {
        "Jew": "jew"
    },
    {
        "s from all over his empire be resettled in the new capital. Within months most of the Empires Romaniote Jews, from the ": null
    },
    {
        "Balkans": "balkans"
    },
    {
        " and ": null
    },
    {
        "Anatolia": "anatolia"
    },
    {
        ", were concentrated in Constantinople, where they made up 42% of the citys population. Avigdor Levy; The Jews of the Ottoman Empire, New Jersey, The forced resettlement, though not intended as an ": null
    },
    {
        "anti-Jewish measure": "antisemitism"
    },
    {
        ", was perceived as an expulsion by the Jews. J. Hacker, Ottoman policies towards the Jews and Jewish attitudes towards Ottomans during the Fifteenth Century in Christians and Jews in the Ottoman Empire , New York Nevertheless, the Romaniotes would remain the most influential Jewish community in the Empire for decades to come, determining the ": null
    },
    {
        "Chief Rabbi": "chief rabbi"
    },
    {
        "s of the towns and the ": null
    },
    {
        "Hakham Bashi": "hakham bashi"
    },
    {
        " of the Ottoman Empire until their leading position was lost to a wave of new Jewish arrivals. These events initiated the first great numerical decline of the Romaniote community.     The number of Jews was soon bolstered by small groups of ": null
    },
    {
        "Ashkenazi Jews": "ashkenazi jews"
    },
    {
        " that immigrated to the Ottoman Empire between 42 and 42 Waves of Sephardi Jews were expelled from ": null
    },
    {
        "Spain": "spain"
    },
    {
        " in 42; many settled in ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        "-ruled Greece. They spoke a separate language, ": null
    },
    {
        "Ladino": "ladino language"
    },
    {
        ". Thessaloniki had one of the largest Jewish communities in the world and a solid rabbinical tradition. On the island of ": null
    },
    {
        "Crete": "crete"
    },
    {
        ", the Jews historically played an important part in the transport trade. In the centuries following 42 most of the Romaniote communities were assimilated by the more numerous Sephardim.     The status of ": null
    },
    {
        "Jewry": "jewry"
    },
    {
        " in the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        " often hinged on the whims of the ": null
    },
    {
        "Sultan": "sultan"
    },
    {
        ". ": null
    },
    {
        "Murad III": "murad iii"
    },
    {
        " for example ordered that the attitude of all non-Muslims should be one of humility and abjection and should not live near Mosques or in tall buildings or own slaves. M. J. Akbar, The shade of swords: jihad and the conflict between Islam and Christianity , 42     After the liberation of Ioannina on February 42 42 the Rabbi and the Romaniote community of Ioannina welcomed at the New Synagogue of Ioannina the liberator of the city the Crown Prince Constantine, the future ": null
    },
    {
        "King of the Hellenes": "list of kings of greece"
    },
    {
        " Constantine I": "constantine i of greece"
    },
    {
        ". The Jewish Museum of Greece, The Jewish Community of Ioannina: The Memory of Artefacts, p. 42 . 42     At the beginning of the 42th century, the Romaniote community of Ioannina numbered about 42 people, mostly lower-class tradesmen and craftsmen. Their numbers dwindled after that due to economic out-migration; after the Holocaust and on the eve of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", there were approximately 42 Romaniotes left in Ioannina. Centered around the old fortified part of the city , where the community had been living for centuries, they maintained two synagogues, one of which, the Kehila Kedosha Yashan Synagogue still remains today.     A strong Romaniote community was present in Corfu until the late 42th century, when a ": null
    },
    {
        "pogrom": "greek citronthe blood libel and pogrom"
    },
    {
        " sparked by ": null
    },
    {
        "blood libel": "blood libel"
    },
    {
        " charges forced most of the Jewish community to leave the island.       The Romaniote ": null
    },
    {
        "Prayer Rite": "nusach"
    },
    {
        " as seen in the original Mahzor Romania and Romaniote ": null
    },
    {
        "commentaries": "minhag"
    },
    {
        " on ": null
    },
    {
        "Jewish Exegesis": "exegesis"
    },
    {
        " and ": null
    },
    {
        "Jewish Law": "halacha"
    },
    {
        ", vary from those of the ": null
    },
    {
        "Askenazi": "ashkenazi jews"
    },
    {
        ", the ": null
    },
    {
        "Sephardic": "sephardi jews"
    },
    {
        " and the ": null
    },
    {
        "Mizrachi": "mizrahi jews"
    },
    {
        " Jews, and are closer to those of the ": null
    },
    {
        "Italian Jews": "italian jewsitalian rite jews"
    },
    {
        ": some of these are thought to have been based on the ": null
    },
    {
        "Jerusalem Talmud": "jerusalem talmud"
    },
    {
        " instead of the ": null
    },
    {
        "Babylonian Talmud": "talmud"
    },
    {
        " . This Minhag was once widespread in Southern Italy, the Balkans, Greece, Anatolia and the Crimea. Zunz, Leopold Ritus. 42 Eine Beschreibung synagogaler Riten . The Romaniotes spoke recently ": null
    },
    {
        "Judaeo-Greek": "yevanic language"
    },
    {
        " and many of them still use the ": null
    },
    {
        "Greek language": "greek language"
    },
    {
        ". ": null
    },
    {
        "Tobiah ben Eliezer": "tobiah ben eliezer"
    },
    {
        " , a Greek-speaking Talmudist and poet of the 42th century, worked and lived in the city of ": null
    },
    {
        "Kastoria": "kastoria"
    },
    {
        ". He is the author of the Lekach Tov a midrashic commentary on the Pentateuch and the Five Megillot and also of some poems.     Romaniote scholars translated the ": null
    },
    {
        "Tanakh": "tanakh"
    },
    {
        " into Greek. A polyglot edition of the ": null
    },
    {
        "Bible": "bible"
    },
    {
        " published in ": null
    },
    {
        "Constantinople": "istanbul"
    },
    {
        " in 42 has the Hebrew text in the middle of the page, with a Ladino  translation on one side, a Yevanic translation on the other and the ": null
    },
    {
        "Judaeo-Aramaic": "judeo-aramaic languages"
    },
    {
        " Targum": "targum"
    },
    {
        " at the bottom of the page. Natalio Fernandez Marcos, The Septuagint in Context: Introduction to the Greek Versions of the Bible p 42 The Greek text is published in D. C. Hesseling, Les cinq livres de la Loi .     In the early Romaniote Rite the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " was subdivided in ": null
    },
    {
        "Sedarim": "seder"
    },
    {
        " while the whole Torah was read in the Palestinian way of the ": null
    },
    {
        "Triennial cycle": "triennial cycle"
    },
    {
        ". The order for reading the ": null
    },
    {
        "Haftarah": "haftarah"
    },
    {
        " followed an own custom. The prophetic readings of the Byzantine ritual differed fundamentally from those of the other Rabbanite Jews of the diaspora. They have been preserved in the editions of the haftarot published with the Commentary of David Kimchi in Constantinople, 42; and in the edition of the Pentateuch and haftarot, published in Constantinople, 42 . Louis Finkelstein, The Prophetic Readings According to the Palestinian, Byzantine, and Karaite Rites , Hebrew Union College Annual, vol. 42 page 42; Adolf Büchler, The Reading of the Law and Prophets in a Triennial Cycle Jewish Quarterly Review, vol. 42 nr. 42 pages 4242 discusses in some detail evidence of very early choices of haftarot, particularly of the Karaites. The Romaniote Torah scrolls are housed in tikim , where they never are taken completely out. Among the Romaniote Jews, tradition dictates, that the most holy Sefer Torah, the Law of Moses, be read with the scroll standing upright in its tik; it is considered improper to lay it flat.    The ": null
    },
    {
        "siddur": "siddur"
    },
    {
        " for the Romaniote rite was known as the Mahzor Romania. It was actually the first ": null
    },
    {
        "Mahzor": "mahzor"
    },
    {
        " and represented the Minhag of the ": null
    },
    {
        "Byzantine Jews": "history of the jews in the byzantine empire"
    },
    {
        " which is the oldest European Jewish Prayer rite. Later the first Mahzor was printed, the Mahzor Bene Roma. Luzzato, S. D. Introduction to the Mahzor Bene Roma, p. 42 42 Mahzor , Jewish Encyclopedia, 42 Mordecai Schreiber, The Shengold Jewish Encyclopedia, Mahzor . 42 The Romaniote Jews have their own form of wedding blessing. Upon the betrothal, seven blessings are bestowed on the bride and groom to be, while wedding ": null
    },
    {
        "wreath": "wreath"
    },
    {
        "s are covering the heads of the groom and the bride and are interchanged on their heads. At the end of a full year, the ": null
    },
    {
        "Ketubah": "ketubah"
    },
    {
        " was read at the wedding ceremony proper. This is different in that other Jews bless the bride and groom at the time of the actual wedding. In addition, there are ritual differences in the building of the Synagogue and in the building and the use of the mikve. It is a Romaniote tradition to write on the Ketubah the year ": null
    },
    {
        "since creation of the world": "anno mundi"
    },
    {
        " and the year since the ": null
    },
    {
        "destruction of the Temple": "siege of jerusalem"
    },
    {
        ".  The Romaniotes traditionally gave to a child a mystical document known as an Aleph . This hand-painted birth and circumcision certificate was created by a family member and then handed down. The aleph was written in mystical codes for the purpose of warding off the wiles of Lillith, Adams first wife. The Romaniotes are well known for their hymns in Judeo-Greek and Hebrew, for their special way of ": null
    },
    {
        "cantillation": "cantillation"
    },
    {
        ", based on the ": null
    },
    {
        "Byzantine melos": "byzantine music"
    },
    {
        " Ross, M. S., Europäisches Zentrum für Jüdische Musik, CD-Projekt: Synagogale Musik der romaniotischen Juden Griechenlands ongoing/42- and for their Jewish-Greek folksongs, based on regional melodies. J. Matsas: Yanniotika Evraika Tragoudia; Ekdoseis Epeirotikes, 42 The Jewish Museum of Greece, The Jewish Community of Ioannina: The Memory of Artefacts, Songs and Hymns . 42 Jewish immigrants from Sicily brought to Ioannina the celebration of the Sicilian ": null
    },
    {
        "Purim Katan": "purim katan"
    },
    {
        ". The Jews of Ioannina call this holiday Pourimopoulo . They read the special Megillah for the Purim Katan of Syracuse and sing corresponding songs and hymns for this festivity. The Mahzor of the Romaniote ": null
    },
    {
        "Kaffa Rite": "krymchaks"
    },
    {
        " from the year 42 gives the order to read the ": null
    },
    {
        "Megillat Antiochos": "megillat antiochus"
    },
    {
        " in the Mincha of Shabbat Hanukkah.  In the second half of the 42th century, the Romaniote community of Greece made an effort to preserve the Romaniote liturgical heritage of Ioannina and Arta, by printing various liturgical texts in the Hebrew printing presses of Salonika. The Jewish Museum of Greece, The Jewish Community of Ioannina: The Memory of Artefacts, p. 42 . 42 Today, the Romaniote Liturgy follows the mainstream Sephardic usage, while the Romaniotes and the Jews of Corfu have preserved their old and own Judaeo-Greek and Hebrew piyyutim, their own way of cantillation and their special customs. A custom is, which is still followed in the ": null
    },
    {
        "Etz Hayyim Synagogue": "etz hayyim synagogue"
    },
    {
        " of Crete to read on ": null
    },
    {
        "Yom Kippur": "yom kippur"
    },
    {
        " the ": null
    },
    {
        "Book of Jonah": "book of jonah"
    },
    {
        " in Judaeo-Greek.  Another custom was to chant the ": null
    },
    {
        "Song of Songs": "song of songs"
    },
    {
        " verse by verse by alternating from Hebrew to its paraphrasing ": null
    },
    {
        "Targum Jonathan": "targum jonathan"
    },
    {
        "-translation after the morning service on the last two days of Pessach. Romaniote Synagogues have their own layout: the ": null
    },
    {
        "Bimah": "bemajudaism"
    },
    {
        "  is on a raised ": null
    },
    {
        "dais": "dais"
    },
    {
        " on the western wall, the ": null
    },
    {
        "Aron haKodesh": "ark"
    },
    {
        "  is on the eastern wall and in the middle there is a wide interior ": null
    },
    {
        "aisle": "aisle"
    },
    {
        ". Votive offerings made of silver as stars or tablets called Shadayot were a thankful gift to the Synagogue of congregants who have received help, healing or salvation by God. The Romaniote Term for the Passover ceremony is חובה/Hova , which means obligation. The ": null
    },
    {
        "Jewish Museum of Greece": "jewish museum of greece"
    },
    {
        " published in 42 a Romaniote rite Pesach-Seder CD . In the years 42 and 42 the Romaniote rite Haggadah and the Romaniote rite Prayer book have been published in a series, containing also Romaniote poetry, the Haftarot according to the Romaniote custom and other texts. P. Gkoumas, F. Leubner, The Haggadah According to the Custom of the Romaniote Jews of Crete. Norderstedt, 42  P. Sennis, F. Leubner, Prayerbook According to The Rite of The Romaniote Jews. Norderstedt, 42  A Romaniote rite based reform Siddur in Greek and Hebrew has also been published in 42 Greenberg, Yonatan, Mekor Chayim: A Reform Liturgy for Erev Shabbat Based on the Romaniote Rite , Hebrew Union College-Jewish Institute of Religion, Cincinnati, 42            The intellectual pursuits of Romaniote Jews reflected in their history their geographical location within the Jewish and gentile world. Direct heir to Palestinian Jewish traditions on the one hand, they were also heir to the teachings of the ": null
    },
    {
        "Greco-Roman world": "classical antiquity"
    },
    {
        ". The Byzantine Jewish/Romaniote literature shows a rich blend of ": null
    },
    {
        "Hellenistic Jewish": "hellenistic judaism"
    },
    {
        " and ": null
    },
    {
        "Palestinian rabbinic": "talmudic academies in syria palaestina"
    },
    {
        " traditions. Romaniote Jewry, throughout its history, expended great effort on religious poetry, which reached its peak during the period 4242 The writing of piyyutim was clearly hold as the own genre. ": null
    },
    {
        "Hillel ben Eliakim": "hillel ben eliakim"
    },
    {
        " wrote down in the twelfth century his exegetical commentary Sifre ve Sifra. ": null
    },
    {
        "Shemarya HaIkriti": "shemariah of negropont"
    },
    {
        " who moved after 42 to Negroponte prepared his supercommentary to Ibn Ezra and, circa 4242 wrote his Sefer Amasyahu, a handbook of biblical apologetics. In tune with the intellectual currents among Romaniotes, Shemarya was trained in Philosophy and was able to translate directly from Greek to Hebrew. The  Sefer Yosippon  was written by the Byzantine Jews of Southern Italy. R. Elnatan ben Moses Kalkes  wrote a lengthy kabbalistic treatise entitled Eben Saphir. ": null
    },
    {
        "Mordecai Komatiano": "mordecai comtino"
    },
    {
        " has left a legacy of some fifteen works on astronomy, grammar , biblical commentaries and piyyutim; some of the later have even been included in the Karaite prayerbook. Several manuscripts containing mystical works have survived. The question of an independent Romaniote ": null
    },
    {
        "mystical": "jewish mysticism"
    },
    {
        " tradition, probably deriving directly from Palestinian antecedents, is proved. Cf. afterword in Benjamin Klar, ed., Megillat Ahimaaz 42nd edition, , and Weinberger, Anthology, pp. 4242 An abridgement of ": null
    },
    {
        "Aristotle": "aristotle"
    },
    {
        "s Logic by Yoseph HaYevani was made available to those Jews who were less proficient in Greek. The Byzantine Karaites, showed a knowledge of Greek philosophical terminology. Rabbinic authors spiced their comments with Greek phrases. The familiarity of Romaniote Jewry with the ": null
    },
    {
        "Greek language": "greek language"
    },
    {
        " is well documented. Biblical translations, Piyyutim, Folksongs, Ketubbot, Liturgical instructions, Glossaries, Mystical texts and the use of Greek words in Commentaries in Judaeo-Greek are known.        The ": null
    },
    {
        "Judaeo-Greek": "judaeo-greek"
    },
    {
        " of Ioannina underwent after WWII a process of  koinezation . The only phonetic differences to ": null
    },
    {
        "Standard Modern Greek": "standard modern greek"
    },
    {
        ", which could be noted shortly after the war have been ref /ref ref /ref ref name ReferenceA /ref  ref /ref ref name ReferenceA /  ref /ref ref /ref  ref  /ref ref /ref ref  /ref  ref /ref ref /ref ref /ref ref /ref ": null
    },
    {
        "ef nameKehila /ref ref nameRaptis /re": "ef namekehila  /ref  ref nameraptis  /re"
    },
    {
        " ref  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref ref  /ref  ref /ref  ref  /ref  ref  /ref  ref  /ref  ref name Daily News  /ref  ref name Daily News / ref  /ref ref name Daily News / ref  /ref ref  /ref ref  /ref ref  /ref                             ": null
    }
]