[
    {
        "           Romanos III Argyros, or Romanus III Argyrus , was ": null
    },
    {
        "Byzantine emperor": "byzantine emperor"
    },
    {
        " from 42 November 42 until his death. He was a Byzantine noble and senior official in ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        " when the dying ": null
    },
    {
        "Constantine VIII": "constantine viii"
    },
    {
        " forced him to divorce his wife and marry the emperors daughter ": null
    },
    {
        "Zoë": "zoë porphyrogenita"
    },
    {
        ". Upon Constantines death three days later, Romanos took the throne.     Romanos has been recorded as a well meaning but ineffective emperor. He disorganised the tax system and undermined the military, personally leading a disastrous military expedition against Aleppo. He fell out with his wife and foiled several attempts on his throne, including two which revolved around his sister-in-law ": null
    },
    {
        "Theodora": "theodora porphyrogenita"
    },
    {
        ". He spent large amounts on the construction and repair of churches and monasteries. He died after six years on the throne, allegedly murdered, and was succeeded by his wifes young lover, ": null
    },
    {
        "Michael IV": "michael iv the paphlagonian"
    },
    {
        ".           Romanos Argyros, born in 42 was the son of an unnamed member of the ": null
    },
    {
        "Argyros family": "argyros"
    },
    {
        ". This may have been either Pothos Argyros who defeated a ": null
    },
    {
        "Magyar": "hungarians"
    },
    {
        " raid in 42 , or Eustathios Argyros, known only for commissioning a poem in honour of ": null
    },
    {
        "Romanos II": "romanos ii"
    },
    {
        " in 42 Romanos grandfather was the son of another ": null
    },
    {
        "Romanos Argyros": "romanos argyros"
    },
    {
        ", who had married Agatha, a daughter of Emperor ": null
    },
    {
        "Romanos I Lekapenos": "romanos i lekapenos"
    },
    {
        " .     Romanos had several siblings: ": null
    },
    {
        "Basil Argyros": "basil argyros"
    },
    {
        ", who served as general and governor under ": null
    },
    {
        "Basil II": "basil ii"
    },
    {
        " ; Leo, who served under Basil and was killed in Italy in 42; Pulcheria Argyropoulina, who married the  magistros  ": null
    },
    {
        "Basil Skleros": "basil skleros"
    },
    {
        "; a sister who married ": null
    },
    {
        "Constantine Karantenos": "constantine karantenos"
    },
    {
        ", who served as  doux  of ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        " under Romanos; and ": null
    },
    {
        "Maria Argyropoulina": "maria argyropoulina"
    },
    {
        ", who married ": null
    },
    {
        "Giovanni Orseolo": "giovanni orseolo"
    },
    {
        ", son of ": null
    },
    {
        "Doge": "doge of venice"
    },
    {
        " Pietro II Orseolo": "pietro ii orseolo"
    },
    {
        ".        He served as krites in ": null
    },
    {
        "Opsikion": "opsikion"
    },
    {
        ", with the rank of  protospatharios  . In this capacity he persecuted heretics at Akmoneia. He was then promoted to the post of  quaestor  and became one of the judges of the ": null
    },
    {
        "Hippodrome": "covered hippodrome"
    },
    {
        ", the High Court of the Empire. In this role he is mentioned in the Peira, a compendium of legal decisions compiled by the noted jurist ": null
    },
    {
        "Eustathios Rhomaios": "eustathios rhomaios"
    },
    {
        ". He was promoted further to the rank of  patrikios  and the post of  oikonomos  of the ": null
    },
    {
        "Great Church": "hagia sophia"
    },
    {
        ", while continuing to preside over the High Court. Under Emperor ": null
    },
    {
        "Constantine VIII": "constantine viii"
    },
    {
        " he held the post of ": null
    },
    {
        "urban prefect": "urban prefect"
    },
    {
        " of ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ", which made him the formal head of the Senate and one of the emperors chief lieutenants.          Late in 42 Constantine VIII lay on his deathbed. Wishing to secure the Macedonian dynasty, but having no son, he summoned Constantine Dalassenos from Antioch to marry his oldest daughter, ": null
    },
    {
        "Zoë": "zoë porphyrogenita"
    },
    {
        ". Dalassenos, the doux of Antioch was an experienced military commander, influential patrician, and unswervingly loyal to the ruling house. The emperors advisors preferred not to have a strong military figure as the new emperor, and persuaded the Emperor to choose Romanos instead, as a potentially more pliable and certainly less travelled candidate. Constantine VIII forced Romanos to divorce his wife  and to marry Zoë, aged 42 at the time; Romanos was 42 The marriage took place on 42 November 42 and three days later Constantine VIII died, leaving Romanos III as emperor.     The new emperor was eager to make his mark as a ruler, but was mostly ineffectual in his enterprises. He idealised ": null
    },
    {
        "Marcus Aurelius": "marcus aurelius"
    },
    {
        ", aspiring to be a new ": null
    },
    {
        "philosopher king": "philosopher king"
    },
    {
        ", and similarly sought to imitate the military prowess of ": null
    },
    {
        "Trajan": "trajan"
    },
    {
        ". He spent large sums on new buildings and in endowing churches and monasteries. He endeavoured to relieve the pressure of taxation on the aristocracy, which undermined the finances of the state. Previous emperors had attempted to control the privileges of the nobles over the common people. Coming from the aristocracy himself, Romanos III abandoned this policy. This failure to stand up to the aristocrats allowed them to exploit the rural mass of landed peasantry, who increasingly fell into a condition of serfdom. This in turn undermined the traditional recruiting base of the Byzantine army. The combination of a reduced tax base and fewer native-born troops had long-term consequences. As revenue declined, the subsequent impoverishment of the state weakened the militarys recruitment power still further.        In 42 he resolved to lead an army in person against the ": null
    },
    {
        "Mirdasids": "mirdasids"
    },
    {
        " of ": null
    },
    {
        "Aleppo": "aleppo"
    },
    {
        ", despite their having accepted the Byzantines as overlords, with disastrous results. The army camped at a waterless site and its scouts were ambushed. An attack by the Byzantine cavalry was defeated. That night Romanos held an imperial council at which the demoralised Byzantines resolved to abandon the campaign and return to Byzantine territory. Romanos also ordered his siege engines to be burned. On 42August 42 the army departed its camp and made for Antioch. Discipline broke down in the Byzantine army, with Armenian mercenaries using the withdrawal as an opportunity to pillage the camps stores. The Emir of Aleppo launched an attack and the ": null
    },
    {
        "imperial army broke and fled": "battle of azaz"
    },
    {
        ". Only the imperial bodyguard, the  Hetaireia , held firm, but Romanos was nearly captured. Accounts vary on the battle losses: ": null
    },
    {
        "John Skylitzes": "john skylitzes"
    },
    {
        " wrote that the Byzantines suffered a terrible rout and that some troops were killed in a chaotic stampede by their fellow soldiers, ": null
    },
    {
        "Yahya of Antioch": "yahya of antioch"
    },
    {
        " wrote that the Byzantines suffered remarkably few casualties. The Oxford Dictionary of Byzantium , Oxford University Press, 42  According to Yahya, two high ranking Byzantine officers were among the fatalities, and another officer was captured by the Arabs. After this defeat the army became a laughing-stock .     Despite his victory, the Emir of Aleppo opened negotiations and signed a treaty that made Aleppo an Imperial tributary and allowed for a Greek governor to preside over the city. In 42 the capture and successful defence of ": null
    },
    {
        "Edessa": "edessa, mesopotamia"
    },
    {
        " by ": null
    },
    {
        "George Maniakes": "george maniaces"
    },
    {
        " and the sound defeat of a ": null
    },
    {
        "Saracen": "saracen"
    },
    {
        " fleet in the ": null
    },
    {
        "Adriatic": "adriatic sea"
    },
    {
        " did little to restore Romanos early popularity.          Romanos faced several conspiracies, mostly centred on his sister-in-law Theodora. In 42 she planned to marry the Bulgarian prince ": null
    },
    {
        "Presian": "presian"
    },
    {
        " and to usurp the throne. The plot was discovered, Presian was ": null
    },
    {
        "blinded": "political mutilation in byzantine culture"
    },
    {
        " and ": null
    },
    {
        "tonsure": "tonsure"
    },
    {
        "d as a monk but Theodora was not punished. In 42 she was implicated in another conspiracy, this time with Constantine Diogenes, the ": null
    },
    {
        "Archon": "archon"
    },
    {
        " of ": null
    },
    {
        "Sirmium": "sirmium"
    },
    {
        ", and was forcibly confined in the ": null
    },
    {
        "monastery": "monastery"
    },
    {
        " of Petrion.     In a vain attempt to reduce expenditure, Romanos limited his wifes expenses, which merely exacerbated the alienation between the two. Romanos took a mistress. Zoë in turn fell in love with ": null
    },
    {
        "Michael": "michael iv the paphlagonian"
    },
    {
        ", the brother of high-ranking court eunuch ": null
    },
    {
        "John the Orphanotrophos": "john the orphanotrophos"
    },
    {
        ". Romanos, unaware, allowed Michael to become one of his personal servants. Having survived the attempts on his throne by Theodora, his death on 42 April 42 was supposed to have been due to poison administered by his wife. There is also speculation that he was drowned in a bath on his wifes orders. He was buried in the ": null
    },
    {
        "Church of St. Mary Peribleptos": "church of st. george of samatya"
    },
    {
        ", which he built.     Zoë and Michael were married on the same day that Romanos III died. The next day the couple summoned the ": null
    },
    {
        "Patriarch": "ecumenical patriarch of constantinople"
    },
    {
        " Alexios I": "alexius i of constantinople"
    },
    {
        " to officiate in the coronation of the new emperor. Norwich, pg. 42 Although he initially refused to co-operate, the payment of 42 pounds of gold helped change his mind. Garland, Zoë Porphyrogenita": null
    }
]