[
    {
        "   The Roman Missal  is the ": null
    },
    {
        "liturgical book": "Liturgical Books Of The Roman Rite"
    },
    {
        " that contains the texts and ": null
    },
    {
        "rubrics": "Rubric"
    },
    {
        "for the celebration of the ": null
    },
    {
        "Mass": "Mass"
    },
    {
        " in the ": null
    },
    {
        "Roman Rite": "Roman Rite"
    },
    {
        " of the ": null
    },
    {
        "Catholic Church": "Roman Catholic Church"
    },
    {
        ".           Before the high ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ", several books were used at Mass: a ": null
    },
    {
        "Sacramentary": "Sacramentary"
    },
    {
        " with the ": null
    },
    {
        "prayer": "Prayer"
    },
    {
        "s, one or more books for the ": null
    },
    {
        "Scriptural": "Bible"
    },
    {
        " readings, and one or more books for the ": null
    },
    {
        "antiphons": "Antiphon"
    },
    {
        "and other chants. Gradually, manuscripts came into being that incorporated parts of more than one of these books, leading finally to versions that were complete in themselves. Such a book was referred to as a Missale Plenum .     In 1223 Saint ": null
    },
    {
        "Francis of Assisi": "Francis Of Assisi"
    },
    {
        " instructed his friars to adopt the form that was in use at the Papal Court . They adapted this missal further to the needs of their largely itinerant apostolate. ": null
    },
    {
        "Pope Gregory IX": "Pope Gregory Ix"
    },
    {
        " considered, but did not put into effect, the idea of extending this missal, as revised by the ": null
    },
    {
        "Franciscan": "Franciscan"
    },
    {
        "s, to the whole Western Church; and in 1277 ": null
    },
    {
        "Pope Nicholas III": "Pope Nicholas Iii"
    },
    {
        " ordered it to be accepted in all churches in the city of Rome. Its use spread throughout Europe, especially after the invention of the ": null
    },
    {
        "printing press": "Gutenberg Press"
    },
    {
        "; but the editors introduced variations of their own choosing, some of them substantial. Printing also favoured the spread of other liturgical texts of less certain orthodoxy. The ": null
    },
    {
        "Council of Trent": "Council Of Trent"
    },
    {
        " determined that an end must be put to the resulting disparities.     The first printed Missale Romanum , containing the Ordo Missalis secundum consuetudinem Curiae Romanae , was produced in ": null
    },
    {
        "Milan": "Milan"
    },
    {
        " in 1474.  Almost a whole century passed before the appearance of an edition officially published by order of the ": null
    },
    {
        "Holy See": "Holy See"
    },
    {
        ". During that interval, the 1474 Milanese edition was followed by at least 14 other editions: 10 printed in ": null
    },
    {
        "Venice": "Venice"
    },
    {
        ", 3 in ": null
    },
    {
        "Paris": "Paris"
    },
    {
        ", 1 in ": null
    },
    {
        "Lyon": "Lyon"
    },
    {
        ". Manlio Sodi and Achille Maria Triacca, Missale Romanum: Editio Princeps  , p. XV For lack of a controlling authority, these editions differ, sometimes considerably.     Annotations in the hand of ": null
    },
    {
        "Cardinal": "Cardinal"
    },
    {
        " Gugliemo Sirleto": "Gugliemo Sirleto"
    },
    {
        " in a copy of the 1494 Venetian edition Missale secundum morem Sanctae Romanae Ecclesiae show that it was used for drawing up the 1570 official edition of ": null
    },
    {
        "Pope Pius V": "Pope Pius V"
    },
    {
        ". In substance, this 1494 text is identical with that of the 1474 Milanese edition.           Implementing the decision of the Council of Trent, ": null
    },
    {
        "Pope Pius V": "Pope Pius V"
    },
    {
        " promulgated, in the Apostolic Constitution  Quo primum  of 14 July 1570, an edition of the Roman Missal that was to be in obligatory use throughout the ": null
    },
    {
        "Latin Church": "Latin Church"
    },
    {
        " except where there was another liturgical rite that could be proven to have been in use for at least two centuries.     Some corrections to Pope Pius Vs text proved necessary, and ": null
    },
    {
        "Pope Clement VIII": "Pope Clement Viii"
    },
    {
        " replaced it with a new typical edition of the Roman Missal on 7 July 1604. A further revised typical edition was promulgated by ": null
    },
    {
        "Pope Urban VIII": "Pope Urban Viii"
    },
    {
        " on 2 September 1634.     Beginning in the late seventeenth century, France and neighbouring areas saw a flurry of independent missals published by bishops influenced by ": null
    },
    {
        "Jansenism": "Jansenism"
    },
    {
        " and ": null
    },
    {
        "Gallicanism": "Gallicanism"
    },
    {
        ". This ended when Bishop ": null
    },
    {
        "Pierre-Louis Parisis": "Pierre-Louis Parisis"
    },
    {
        " of Langres and ": null
    },
    {
        "Abbot Guéranger": "Abbot Guéranger"
    },
    {
        " initiated in the nineteenth century a campaign to return to the Roman Missal. ": null
    },
    {
        "Pope Leo XIII": "Pope Leo Xiii"
    },
    {
        " then took the opportunity to issue in 1884 a new typical edition that took account of all the changes introduced since the time of Pope Urban VIII. ": null
    },
    {
        "Pope Pius X": "Pope Pius X"
    },
    {
        " also undertook a revision of the Roman Missal, which was published and declared typical by his successor ": null
    },
    {
        "Pope Benedict XV": "Pope Benedict Xv"
    },
    {
        " on 25 July 1920.        Though Pope Pius Xs revision made few corrections, omissions, and additions to the text of the prayers in the Roman Missal, there were major changes in the rubrics, changes which were not incorporated in the section entitled Rubricae generales , but were instead printed as an additional section under the heading Additiones et variationes in rubricis Missalis.     In contrast, the revision by ": null
    },
    {
        "Pope Pius XII": "Pope Pius Xii"
    },
    {
        ", though limited to the liturgy of only five days of the Churchs year, was much bolder, requiring changes even to ": null
    },
    {
        "canon law": "Canon Law"
    },
    {
        ", which until then had prescribed that, with the exception of Midnight Mass for Christmas, Mass should not begin more than one hour before dawn or later than one hour after midday. In the part of the Missal thus thoroughly revised, he anticipated some of the changes affecting all days of the year after the ": null
    },
    {
        "Second Vatican Council": "Second Vatican Council"
    },
    {
        ". These novelties included the first official introduction of the ": null
    },
    {
        "vernacular": "Vernacular"
    },
    {
        " language into the liturgy for renewal of baptismal promises within the ": null
    },
    {
        "Easter Vigil": "Easter Vigil"
    },
    {
        " celebration.       Pope Pius XII issued no new typical edition of the Roman Missal, but authorized printers to replace the earlier texts for ": null
    },
    {
        "Palm Sunday": "Palm Sunday"
    },
    {
        ", ": null
    },
    {
        "Holy Thursday": "Maundy Thursday"
    },
    {
        ", ": null
    },
    {
        "Good Friday": "Good Friday"
    },
    {
        ", and the ": null
    },
    {
        "Easter Vigil": "Easter Vigil"
    },
    {
        " with those that he began to introduce in 1951 and that he made universally obligatory in 1955. Decree   ": null
    }
]