[
    {
        "   Rotation of ammunition is a term used with reference to ": null
    },
    {
        "gun": "gun"
    },
    {
        "s.   ": null
    },
    {
        "Projectile": "projectile"
    },
    {
        "s intended for RML  guns were at first fitted with a number of ": null
    },
    {
        "gun-metal": "gunmetal"
    },
    {
        " studs arranged around them in a ": null
    },
    {
        "spiral": "spiral"
    },
    {
        " manner corresponding to the twist of ": null
    },
    {
        "rifling": "rifling"
    },
    {
        ". This was defective, as it allowed, as in the old smooth-bore guns, the powder gas to escape by the clearance between the projectile and the bore, with a consequent loss of efficiency; it also quickly eroded the bore of the larger guns.     Later the rotation was effected by a cupped copper disc called an ": null
    },
    {
        "automatic gas-check": "gas-checks in british rml heavy guns"
    },
    {
        " attached to the base end of the projectile. The powder gas pressure expanded the rim of the gas check into the rifling grooves and prevented the escape of gas; it also firmly fixed the gas check to the projectile, thus causing it to rotate. A more regular and efficient action of the powder gas was thus ensured, with a corresponding greater range and an improvement in accuracy.     With the earlier Armstrong  guns the projectiles were coated with lead , the lead being forced through the rifling grooves by the pressure of the exploded powder gas. The lead coating is, however, too soft with the higher velocities of modern B.L. guns.     ": null
    },
    {
        "Vavasseur": "josiah vavasseur"
    },
    {
        " devised the plan of fitting by ": null
    },
    {
        "hydraulic pressure": "hydraulic pressure"
    },
    {
        " a copper driving band into a groove cut around the body of the projectile. This is now universal. It not only fulfills the purpose of rotating the projectile, but renders possible the use of large ": null
    },
    {
        "charges": "explosive charge"
    },
    {
        " of slow-burning ": null
    },
    {
        "explosive": "explosive"
    },
    {
        ". The copper band, on being forced through the gun, gives rise to considerable ": null
    },
    {
        "resistance": "friction"
    },
    {
        ", which allows the propelling charge to burn properly and thus to exert its enormous force on the projectile.     The laws which govern projectile designs are not well-defined. Certain formulae are used which give the thickness of the shell walls for a known chamber ": null
    },
    {
        "pressure": "pressure"
    },
    {
        " in the gun, and for a particular ": null
    },
    {
        "stress": "stress"
    },
    {
        " on the shell material. The exact proportions of the shell depend, however, greatly on experimental knowledge.": null
    }
]