[
    {
        "            Round the Horne is a ": null
    },
    {
        "BBC Radio": "bbc radio"
    },
    {
        " comedy programme starring ": null
    },
    {
        "Kenneth Horne": "kenneth horne"
    },
    {
        ", first transmitted in four series of weekly episodes from 42 until 42 The show was created by ": null
    },
    {
        "Barry Took": "barry took"
    },
    {
        " and ": null
    },
    {
        "Marty Feldman": "marty feldman"
    },
    {
        ", who wrote the first three series. The fourth was written by Took, ": null
    },
    {
        "Johnnie Mortimer": "johnnie mortimer"
    },
    {
        ", ": null
    },
    {
        "Brian Cooke": "brian cooke"
    },
    {
        " and Donald Webster.     Hornes supporting cast comprised ": null
    },
    {
        "Kenneth Williams": "kenneth williams"
    },
    {
        ", ": null
    },
    {
        "Hugh Paddick": "hugh paddick"
    },
    {
        ", ": null
    },
    {
        "Betty Marsden": "betty marsden"
    },
    {
        " and, in the first three series, ": null
    },
    {
        "Bill Pertwee": "bill pertwee"
    },
    {
        ". The announcer was ": null
    },
    {
        "Douglas Smith": "douglas smith"
    },
    {
        ", who also took part in the sketches. All except the last series featured music by Edwin Braden, played by the band the Hornblowers , with a song in the middle of each show performed by the ": null
    },
    {
        "close-harmony": "close and open harmonyvocal music"
    },
    {
        " singing group the ": null
    },
    {
        "Fraser Hayes Four": "fraser hayes four"
    },
    {
        "; in the fourth series, the music was by ": null
    },
    {
        "Max Harris": "max harris"
    },
    {
        " with a smaller group of players than the earlier series.     The show was the successor to  Beyond Our Ken , which had run from 42 to 42 with largely the same cast. By the time the new series began, television had become the dominant broadcasting medium in Britain, and Round the Horne, which built up a regular audience of 42 million, was the last radio show to reach so many listeners. Horne was surrounded by larger-than-life characters including the ": null
    },
    {
        "camp": "camp"
    },
    {
        " pair ": null
    },
    {
        "Julian and Sandy": "julian and sandy"
    },
    {
        ", the disreputable eccentric J.Peasmold Gruntfuttock, and the singer of dubious folk songs, Rambling Syd Rumpo, who all became nationally familiar. The show encountered periodic scrutiny from the BBC management for its ": null
    },
    {
        "double entendre": "double entendre"
    },
    {
        "s, but consistently received the backing of the ": null
    },
    {
        "director-general of the BBC": "director-general of the bbc"
    },
    {
        ", ": null
    },
    {
        "Sir Hugh Greene": "hugh greene"
    },
    {
        ". Horne died suddenly in 42; the BBC decided that Round the Horne could not continue without its star and they cancelled plans for a fifth series that year.     Over the following decades Round the Horne has been re-broadcast continually, and all 42 shows have been published on CD. In 42 in a poll run by  Radio Times , Round the Horne was voted the BBCs third-best radio show of any genre, and the best radio comedy series of all.              In 42 the radio presenter and comedian ": null
    },
    {
        "Kenneth Horne": "kenneth horne"
    },
    {
        " was the compere on the popular Saturday evening comedy and music radio show  Variety Playhouse . The programmes writers were ": null
    },
    {
        "Eric Merriman": "eric merriman"
    },
    {
        " and ": null
    },
    {
        "Barry Took": "barry took"
    },
    {
        ", and when the series came to an end, they prepared a script for a pilot episode of a new show,  Beyond Our Ken . The show, in which Horne was joined by ": null
    },
    {
        "Kenneth Williams": "kenneth williams"
    },
    {
        ", ": null
    },
    {
        "Ron Moody": "ron moody"
    },
    {
        ", ": null
    },
    {
        "Hugh Paddick": "hugh paddick"
    },
    {
        " and ": null
    },
    {
        "Betty Marsden": "betty marsden"
    },
    {
        ", was broadcast in October 42 The series was due to begin in April 42 but in February Horne suffered a debilitating ": null
    },
    {
        "stroke": "stroke"
    },
    {
        "; he was temporarily paralysed down his left-hand side and lost the power of speech. The BBC postponed the series. After physiotherapy Horne was able to begin recording Beyond Our Ken in June, in preparation for the broadcast of the first series between July and November.     Beyond Our Ken was written around the imperturbable establishment figure of Horne, while the other performers played a spectrum of characters never before heard on the radio , including the exaggeratedly upper class Rodney and Charles , the genteel, dotty pensioners Ambrose and Felicity , the hoarse-voiced cook Fanny Haddock – a parody of the television cook ": null
    },
    {
        "Fanny Cradock": "fanny cradock"
    },
    {
        " , the earthy gardening guru Arthur Fallowfield , the semi-articulate rock and roll singer Ricky Livid and Hankie Flowered, a parody of the comedian ": null
    },
    {
        "Frankie Howerd": "frankie howerd"
    },
    {
        " . The first episode was not well received by a sample audience, but the BBC decided to back Horne and his team, and the initial six-week contract was extended to 42 weeks. Before the series came to an end, a second had been commissioned to run the following year. After the first series Moody was succeeded by Pertwee; Took left after the second series, leaving Merriman to write the remaining programmes on his own.        After the seventh series of Beyond Our Ken ended Horne was scheduled to appear in a number of other BBC programmes; Eric Merriman objected, contending that he had made Horne into a star, and that no other comedy series should be allowed to use him , according to Hornes biographer, Barry Johnston. When the BBC refused to withdraw Horne from the programme Down with Women, Merriman resigned from writing Beyond Our Ken and the show came to an end. After some pressure from Horne to keep the remainder of the team together, the BBC commissioned Round the Horne as a replacement on similar lines. They turned to Took, as one of the original writers of Beyond Our Ken, and his new writing partner, ": null
    },
    {
        "Marty Feldman": "marty feldman"
    },
    {
        ". The name of the programme came from a pun on Hornes name, combined with the naval term round the Horn , meaning to navigate the waters at the southern tip of South America, ": null
    },
    {
        "Cape Horn": "cape horn"
    },
    {
        ". The pair aimed to write what they described as down-market material in an upmarket way . The scripts they produced led to a faster-paced programme than Beyond Our Ken, which included more allusions to contemporary events, including politics and films.       Round the Horne was based on a ": null
    },
    {
        "revue": "revue"
    },
    {
        " format, and contained parody and satire. The programme would include an introduction from Horne, who would sometimes give answers to a supposed quiz from the previous week, and then lead into sketches that would include a set-piece based on a film or novel, such as The Man with the Golden Thunderball , and The Three Musketeers . Martin Dibbs, in his history of the BBC Variety Department, writes that the show was characterised by incessant innuendo and camp representation to an extent never before tolerated within the BBC.      As in Beyond Our Ken, there was a cast of recurring characters. Took and Feldman developed new characters for Williams, Paddick, Marsden and Pertwee, whose ability to change between personas produced a programme described by the radio historians Andy Foster and ": null
    },
    {
        "Steve Furst": "steve furst"
    },
    {
        " as a cast of thousands played by the same four accomplished actors . Hornes role was described in  The Daily Telegraph  as providing the perfect foil to the inspired lunacy happening all around him . The media analysts Frank Krutnik and Steve Neale consider that as such, Hornes role was similar to that of ": null
    },
    {
        "Jack Benny": "jack benny"
    },
    {
        ", ": null
    },
    {
        "Fred Allen": "fred allen"
    },
    {
        " and ": null
    },
    {
        "Tommy Handley": "tommy handley"
    },
    {
        ", as a stooge rather than a joke-wielder, frequently switching roles between announcer and in-sketch performer .              The first episode of Round the Horne was broadcast on the ": null
    },
    {
        "Light Programme": "light programme"
    },
    {
        " on 42 March 42 It was described in  Radio Times  as Five characters in search of the authors . The series consisted of 42 episodes and ran to 42 June 42 The programme was produced by John Simmonds and included music from the ": null
    },
    {
        "Fraser Hayes Four": "fraser hayes four"
    },
    {
        " and the studio orchestra, the Hornblowers , conducted by Paul Fenoulhet; from episode six, Fenoulhet was replaced by Edwin Braden. ": null
    },
    {
        "Douglas Smith": "douglas smith"
    },
    {
        ", an announcer and newsreader on the ": null
    },
    {
        "Home Service": "bbc home service"
    },
    {
        " and the ": null
    },
    {
        "Third Programme": "bbc third programme"
    },
    {
        ", was used as the programmes announcer, but was given a larger role as the series progressed; he ended up advertising spoof products and giving human sound effects in addition to his normal role.     One of the early episodes included a sketch by Horne, a ": null
    },
    {
        "monologue": "monologue"
    },
    {
        " based on the centenary of the birth of the crumpet , including a huge crumpet built for ": null
    },
    {
        "Queen Victoria": "queen victoria"
    },
    {
        ".     As an added novelty he hollowed out the centre and a Gaiety Girl was secreted inside. When the loyal toast was drunk, she leapt out, wearing pink combs and waving a Union Jack – either that or the other way round, I dont remember. In any event the whole affair was a great success and, as many people commented afterwards it was a smashing bit of crumpet.     The sketch angered the strongly-conservative ": null
    },
    {
        "Member of Parliament": "member of parliament"
    },
    {
        " Sir Cyril Black": "cyril black"
    },
    {
        ", who wrote to the BBC to complain. ": null
    },
    {
        "Frank Gillard": "frank gillard"
    },
    {
        ", the BBCs director of radio, wrote to Dennis Morris, the chief of the Light Programme, asking Round the Horne to watch its step, particularly over the next few weeks and keep itself within reasonable bounds . Instead, Took and Feldman wrote a riposte that Horne read at the end of the following programme, addressed to the minority of killjoys who complained:     Let me say to them that our scripts are whiter than white, as is the face of the producer when he reads them. You see, evil is in the eye of the beholder – and we believe you can make anything sound as if it has a double meaning – if you know how. So cheerio, see you next week.     Further complaints about the programme were received and ": null
    },
    {
        "Sir Hugh Greene": "hugh greene"
    },
    {
        ", the ": null
    },
    {
        "director-general of the BBC": "director-general of the bbc"
    },
    {
        ", asked to see the scripts before broadcasting. All were returned with the words I see nothing to object to in this written on them. The complaints continued from Black, and from ": null
    },
    {
        "Mary Whitehouse": "mary whitehouse"
    },
    {
        " – a campaigner against ": null
    },
    {
        "social liberalism": "social liberalism"
    },
    {
        " – about the cast putting emphasis on certain words. Took replied that When Laurence Olivier plays Hamlet he puts emphasis on certain words – its called acting .     A second series was commissioned, and ran for thirteen weeks, from Sunday 42 March to 42 June 42 The programme was recorded in front of a studio audience, and Williams would play up to them with physical humour, causing hilarity in the studio. Simmonds spoke to the cast, telling them that the radio audience were hearing unexplained laughter, and to try to keep the visual pranks to a minimum. At the end of the series ": null
    },
    {
        "Roy Rich": "roy rich"
    },
    {
        ", the head of BBC Light Entertainments for radio, spoke to Took, Feldman, Horne and Williams and discussed possible changes to the programme, including the removal of the Fraser Hayes Four, and the possible changing of Pertwee and Marsden. No changes were made before the next series was commissioned.     On 42 October 42 at the age of 42 Horne suffered a severe heart attack. He was much weakened, and was unfit to work for three months. As a result, he did not appear in the Round the Horne Christmas special, which was recorded on 42 November. He returned to work in January 42 to record the third series.       The third series ran for 42 episodes from 42 February to 42 June 42 After recording the first episode, Williams wrote in his diary that the script was singularly uninspired I think – no innovations or bright ideas for the beginning of a new series  ... For the first time I am beginning to feel that this show is rather dated and tired . The BBC hierarchy also thought the first show was slightly lacking and Williams was also downbeat after the second recording, writing that I think the show is quite dead artistically and the format has completely atrophied itself – it is moribund now. I think I will withdraw after this series . Trying to turn the show around, Took and Feldman wrote out the popular ": null
    },
    {
        "camp": "camp"
    },
    {
        " Julian and Sandy": "julian and sandy"
    },
    {
        " characters from the third episode, but the cast and Simmonds all insisted they were put back, so the writers duly obliged. After a few weeks the show had settled down and Williams recorded in his diary that the recording went v. well. Script was v. good indeed and the audience splendid – a great deal of affection there, one felt .     Feldman became increasingly successful on television, particularly with  At Last the 42 Show  ; he decided to concentrate on writing and performing on the screen and left the series. Took agreed to stay, and he was joined by ": null
    },
    {
        "Johnnie Mortimer": "johnnie mortimer"
    },
    {
        ", ": null
    },
    {
        "Brian Cooke": "brian cooke"
    },
    {
        " and – for the first six episodes of the next series – Donald Webster. In September 42 BBC radio was radically reorganised. The ": null
    },
    {
        "Home Service": "home service"
    },
    {
        ", ": null
    },
    {
        "Third Programme": "third programme"
    },
    {
        " and Light Programme were abolished and replaced by four new national channels – Radio ": null
    },
    {
        "42": "bbc radio 1"
    },
    {
        ", ": null
    },
    {
        "42": "bbc radio 2"
    },
    {
        ", ": null
    },
    {
        "42": "bbc radio 3"
    },
    {
        " and ": null
    },
    {
        "42": "bbc radio 4"
    },
    {
        "; Round the Horne moved from the Light Programme to Radio 42 The change came with reduced budgets. The Fraser Hayes Four and Eddie Braden and the Hornblowers were replaced with a small instrumental group led by Max Harris, and Pertwee was dropped from the programme. The cost fell from £42 a show in series 42 to £42 in series 42 That years Christmas special was broadcast with the new line-up and writers.     The fourth series began on 42 February 42 and ran for 42 episodes to 42 June. After the first episode Williams was unimpressed with the new material, and wrote in his diary Now there are 42 writers on it! It is unbelievable really. Four! For half an hour of old crap with not a memorable line anywhere  ... of course one goes on and flogs it gutless and the rubbish gets by . Without Feldman, Took was enjoying the show less than he had previously. He also felt the humour was becoming more obviously dirty and complained to Williams that We might as well write a series called Get Your Cock Out .     Horne died of a heart attack on 42 February 42 while hosting the annual ": null
    },
    {
        "Guild of Television Producers and Directors Awards": "british academy of film and television arts"
    },
    {
        " at ": null
    },
    {
        "the Dorchester": "the dorchester"
    },
    {
        " hotel in London. An award had gone to Took and Feldman for their television series  Marty , and Horne had just urged viewers to tune into the fifth series of Round the Horne – which was due to start on 42 March – when he fell from the podium. By 42 February 42 it had been decided that Round the Horne could not continue without its star. As a result, the scripts for series five – which Horne had jokingly suggested should be subtitled The First All-Nude Radio Show – were hastily adapted into a new series for Williams called Stop Messing About, which ran for two series before it was dropped from the schedule in 42              The persona adopted by the writers for Horne was not greatly different from his real-life one, and largely the same as that of his Beyond Our Ken character: the urbane, unflappable, tolerant but sometimes surprised central figure, around whom the other characters revolved.  The Times  called Horne the master of the scandalous double-meaning delivered with shining innocence , and in Round the Horne he combined the role of straight man to the flamboyant Julian and Sandy, Rambling Syd Rumpo and J.Peasmold Gruntfuttock with that of genial host of the show. Feldman called him the best straight man I had ever seen , who nonetheless had a lot of funny lines ; ": null
    },
    {
        "Jonathan Rigby": "jonathan rigby"
    },
    {
        ", who played Horne in a stage show, Round the Horne  ... Revisited, thought him a stand-up comedian with a posh accent  ... part of his genius was that he was able to be himself .     Horne introduced some programmes by reading out the answers to last weeks questions:   :The answer to question one: complete the first lines of the following songs – If I Were a Blackbird Id  ... The answer is Id Whistle and Sing, and I positively will not accept any other suggestion. The second song was Theres a Rainbow Round My  ... Now we got an amazing number of replies to this. We havent had so many since we asked you to complete Over My Shoulder Goes  ... Really, it makes it very difficult for us to keep up the high reputation for sophisticated comedy weve never had.   At other times he would give a short lecture on justly forgotten figures from history, such as Robert Capability Lackwind, allegedly the inventor of ": null
    },
    {
        "Toad in the Hole": "toad in the hole"
    },
    {
        ", or Nemesis Fothergill, known to ornithologists – and the police – as the Birdman of Potters Bar. In many episodes his opening slot was announcing the days forthcoming events, such as International free style gnome fingering at the five minute Hippo Wash Brompton Oratory, ": null
    },
    {
        "Swan Upping": "swan upping"
    },
    {
        " at Downham and Swan Downing at Upham, and the two-man Rabbi bob sled championship down the escalators at Leicester Square tube station. He would close the programmes by commenting on the final sketch, or announcing a competition to complete a limerick with two fecund opening lines or with a public service announcement such as this police message:   :If any passer-by in ": null
    },
    {
        "Lisle Street": "sohosex industry"
    },
    {
        " last Saturday night witnessed a middle-aged man stagger out of the Peeperama strip club and get knocked down by a passing cyclist, would you please keep quiet about it as my wife thinks I was in Folkestone. Goodbye. See you next week.       At the start of the first series of Round the Horne Douglas Smith took the traditional role of a BBC announcer on comedy shows, introducing the programme and its component parts and reading the credits at the end. As the show developed, the writers gave him more to do. In the second series Smith continually interrupts the programme to promote Dobbiroids Magic Rejuvenators and Dobbimist horse deodorant for UFO . In the third and fourth series he is included in the movie spoofs, playing a range of roles including a rumbling volcano:     :Horne: ... And see there – dominating the island, the sacred volcano of Gonga – played by Douglas Smith with a hole in his head and steam coming out of his ears.   :Paddick: What an awesome sight – snow mantling his mighty summit and lava oozing down his sides.   :Smith: Thats porridge, actually. I had a hurried breakfast this morning.   :Horne: Shut up, Smith, youre a volcano. You just loom over us and rumble ominously.   :Smith: Yes, I told you. I had a hurried breakfast.   :Horne: Shut up, Smith.   :Smith: Rumble rumble.   :Horne: Thats better.     His other roles include a telephone box, an inflatable rubber boat, a ": null
    },
    {
        "drophead": "drophead"
    },
    {
        " Bentley": "bentley"
    },
    {
        " and a cow:     :Smith: Moo Moo – Splosh!   :Horne: Splosh?   :Smith: I kicked over the milk pail.     By the fourth series Smith has risen to the heights of playing the World , and in one programme he gets a solo singing spot, barracked by Paddick and Williams performing Nobody Loves a Fairy When shes Forty .     née Clissold": null
    },
    {
        "Gaiety Girl": "gaiety girls"
    },
    {
        " known as Bea Clissold in her theatrical heyday, when she was the pure brass of the music hall , and subsequently an aristocratic widow. She has been much married and much divorced, and has retired to live in seclusion at Chattering Parva, waited on and complained about by her octogenarian butler, Spasm . Horne interviews her each week in the early programmes, when she reminisces about her life and husbands. In a commentary on the shows characters published in 42 Took wrote, Her anecdotes of past marriages combine the lurid with the turgid as the narrative flashes back on leaden wings to the turn of the century and the exploits of the young Bea Clissold . She appeared in the first programme of the series, and was a major feature of its early episodes. After she ceased to be one of the central characters she continually popped up with her catch phrase, Many times, many, many times , originally referring to the number of times she was married, and later an all-purpose innuendo.             The camp pair Julian and Sandy made their debuts in the fourth programme of the first series and rapidly established themselves as a permanent fixture throughout the run of Round the Horne. They are out of work actors whom Horne encounters each week in new temporary jobs. The writers original idea was that the characters should be elderly and dignified Shakespearean actors filling in as domestic cleaners while resting , but the producer, John Simmonds, thought they seemed rather sad, and at his suggestion Took and Feldman turned the characters into chorus boys. In a typical sketch Horne looks in at a new establishment, usually in ": null
    },
    {
        "Chelsea": "chelsea, london"
    },
    {
        ", with a title such as Bona Tours , Bona Books , Bona Antiques or Bona Caterers , and is greeted with, Oh hello, Im Julian and this is my friend Sandy . The latter adds, using the gay and theatrical slang, ": null
    },
    {
        "palare": "polari"
    },
    {
        ", How bona to vada your dolly old eek again , or What brings you trolling in here?  Having first appeared as house cleaners, they are later shown working in a variety of implausible jobs. Took summed them up: From working as part time domestics while resting they progressed to running almost every trendy activity going from fox-hunting in ": null
    },
    {
        "Carnaby Street": "carnaby street"
    },
    {
        " to the gents outfitting department of ": null
    },
    {
        "MI42": "mi5"
    },
    {
        " .     The use of palare enabled the writers to give Julian and Sandy some ": null
    },
    {
        "double entendre": "double entendre"
    },
    {
        "s that survived BBC censorship because the authorities either did not know or did not admit to knowing their gay meaning. In the fourth series, Sandy tells Horne that Julian is a brilliant pianist: a miracle of dexterity at the cottage upright , which to those familiar with gay slang could either refer to pianistic excellence or to – illegal – sexual activity in a public lavatory. At the time, gay male sex was a criminal offence in Britain. Julian and Sandy became nationally popular characters and are widely credited with contributing a little to the public acceptance of homosexuality that led to the gradual repeal of the anti-gay laws, beginning in 42            A week after the debut of Julian and Sandy came the first appearance of J. Peasmold Gruntfuttock, first broadcast on 42 April 42 Played by Williams, Gruntfuttock is described by the writers as the walking slum . In his first appearance he is a job applicant at the BBC, inspired by voices in his head, and keen to get on close terms with one of the female presenters. In later programmes he is first the king and then dictator of Peasmoldia, a small enclave in the ": null
    },
    {
        "East End": "east end of london"
    },
    {
        ", and subsequently Brother Gruntfuttock, member of an obscure religious community. He writes in regularly with incorrect and sometimes physically implausible answers to last weeks questions:   :Finally, we had I get a kick out of  ... . Well, Mr Gruntfuttock of Hoxton, I think we all know what you get a kick out of. And on looking at the list you sent me its my considered opinion that you are running a severe risk of doing yourself a permanent injury.   In the fourth series he is a persistent caller of the spoof ": null
    },
    {
        "phone-in": "phone-in"
    },
    {
        ", the Round the Horne Forum of the Air, airing his peculiar personal obsessions in between bouts of heavy breathing. He was Feldmans favourite Round the Horne character; the two authors wrote of Gruntfuttock, He married beneath him  – which gives you some idea what his wife Buttercup must be like. All in all not a couple one would wish to meet on a dark night or indeed at any time.             Charles and Fiona are supposedly characters played by an extremely theatrical actor and actress: ageing juvenile Binkie Huckaback and Dame Celia Molestrangler . The two, originally based on the theatre stars ": null
    },
    {
        "Alfred Lunt": "alfred lunt"
    },
    {
        " and ": null
    },
    {
        "Lynn Fontanne": "lynn fontanne"
    },
    {
        ", were introduced in the eighth programme of the first series, and quickly became a fixture. They appeared in parodies of ": null
    },
    {
        "stiff-upper-lip": "stiff upper lip"
    },
    {
        " dramas by ": null
    },
    {
        "Noël Coward": "noël coward"
    },
    {
        " and others; their fictitious plays had titles such as Present Encounter and Bitter Laughter. Their agonised love affairs are punctuated by brittle, staccato dialogue, in which they talk of their emotions in tortuous sentences:   :Fiona: All I could think of back here was you out there thinking of me back here thinking of you out there – back here. Needing you, wanting you, wanting to need you, needing to want you.   :Charles: I dont have the words for it.   :Fiona: I know.   :Charles: I know you know.   :Fiona: I know you know I know.   :Charles: Yes, I know.   Their sketches customarily end with an unexpected twist, such as the revelation that they are living in a telephone box, or are dining at the Ritz in the nude, or trysting in a refrigerator. Barry Took wrote that they were his own favourite Round the Horne characters. During the second series they were dropped in favour of a new feature, The Seamus Android Show  but were quickly brought back.       In the ninth show of the first series Chou En Ginsberg appeared for the first time. He is a parody of the stereotypical far-Eastern villain ": null
    },
    {
        "Fu Manchu": "fu manchu"
    },
    {
        ". The first part of his name was borrowed from ": null
    },
    {
        "Chou En-Lai": "zhou enlai"
    },
    {
        ", the then Chinese premier; for comic contrast the writers wanted an incongruous second name and experimented with Chou En Murphy and Chou En McWhirter before settling on Ginsberg . He always announces himself as Dr Chou En Ginsberg, MA . He appears regularly in the ": null
    },
    {
        "James Bond": "james bond"
    },
    {
        " parodies, Kenneth Horne, Master Spy , plotting a fiendish international crime, luring Horne into his clutches but then being outwitted.     Chou was joined in the next show by his concubine, Lotus Blossom who is, in the words of her master, common as muck. A drawing of the two by William Hewison in Took and Feldmans 42 book Round the Horne shows a diminutive Chou alongside a large, looming and graceless Lotus Blossom bulging out of her ": null
    },
    {
        "cheongsam": "cheongsam"
    },
    {
        ". Her attempts to entertain Special Agent Horne with her songs and dances cause him more distress than Chous threats of death.          First heard in the tenth show of the first series, and a fixture thereafter, Rambling Syd is an itinerant folk singer. The writers describe him as one of the last of the breed of wandering minstrels who are fast dying out – thank heavens . Often misappropriating the tunes of genuine folk songs, Rambling Syds lyrics consist of dubious-sounding nonsense words such as these, from the Runcorn Splod Cobblers Song :   :I sing as I cobble and hammer my splod   :Tho my trumice glows hot and my trade be odd   :I sit as I gorble and pillock my splee   :For a cobblers life is the life for me.   Or, to the tune of ": null
    },
    {
        " Foggy Dew ": "foggy dew"
    },
    {
        ":   :When I was a young man   :I nadgered my splod   :As I nurked at the wogglers trade.   :When suddenly I thought   :While trussing up my groats,   :Id whirdle with a fair young maid.   Took said of the character that his bogus ethnic patter and totally meaningless songs created the illusion of something terribly naughty going on – but that any naughtiness was in fact in the listeners mind.       The character was loosely based on the television cook Fanny Cradock. Described by Took and Feldman as fashion reporter, TV cook, agony aunt, pain in the neck , Daphne Whitethigh is a hoarse-voiced pundit, whose advice on the placing of the bosom or the way to prepare Hippo in its shell is an absolute must for all those trendy moderns who want to look and feel frightful . Among her helpful cooking tips are that although rhinoceros is not very appetising you do get marvellous crackling; her recipes for yak include yak à lorange, yak in its jacket, and coupe yak. She advises followers of female fashion that bosoms are still out, but may be on the way back and her other useful pointers include how to use cold cream to remove those baboon claw marks from ones hip, and how to avoid crows feet round the eyes: refrain from sleeping in trees.          Described by Took as an unskilled television labourer whose gift of the blarney and wistful Irish charm could empty any theatre in three minutes , Seamus Android is a parody of the broadcaster ": null
    },
    {
        "Eamonn Andrews": "eamonn andrews"
    },
    {
        ", whose weekly television chat show was broadcast live on Sunday evenings. Took and Feldman had appeared on Andrewss show and been astonished by the non sequiturs and other nonsense he came out with . Seamus Android was the only regular character played by Pertwee, who was otherwise cast as what Took called the odds and ends – the minor characters and straight parts. Androids interviewees include the much married actress Zsa-Zsa Poltergeist, the Hollywood producer Daryll F. Klaphanger, and the star of The Ipswich File, Michael Bane; promised appearances by such as Lord Ghenghiz Wilkinson, the dancing cloakroom attendant, Nemesis Poston, the juggling monk, and Anthony Wormwood-Nibblo, the Hoxton cat thief and heiress fail to materialise. As Pertwee was not in the cast for the last series, Android was dropped.       Played by Paddick, this is the only regular Round the Horne character who had in all essentials already appeared in Beyond Our Ken, where he was named Stanley Birkinshaw. In Round the Horne he has no regular name, and appears in various capacities. He is a man with ill-fitting ": null
    },
    {
        "false teeth": "dentures"
    },
    {
        "; his diction distorts all sibilants, and sprays saliva in all directions. Dentures often opens the show in the style of a toastmaster . In the second series he appears as The Great Omipaloni, the worlds fastest illusionist – and also the dampest . In the third series he is Buffalo Sidney Goosecreature, adversary of the Palone Ranger, and in the fourth he is Angus McSpray to Williamss Bonnie Prince Charlie.       The invention of Mortimer and Cooke, Julie Coolibah appears in the fourth season. She is an Australian visiting London, deeply suspicious of British men . Every time she talks to Horne she interprets his innocent remarks as sexual overtures:   :Horne: Good to have you back.   :Julie: What do you mean by that?   :Horne: Nothing, just extending the hand of friendship.   :Julie: Yeah? With what purpose in mind, might I ask?   When Julie manages to find work in London she has constant difficulties coping with the men. As a bus conductress she is outraged when a passenger gives her fourpence and asks How far can I go for that? She tells Horne, I cracked him with my cash-bag and put him off .       Round the Horne is described by Foster and Furst as one of the seminal comedies to come out of the BBC . The programme continued the comedy vein of  The Goon Show  and provided an influential link, through  Im Sorry, Ill Read That Again , to the work of the ": null
    },
    {
        "Monty Python": "monty python"
    },
    {
        " writers and performers; at one point Monty Python was given the working title Barry Tooks Flying Circus by the BBC. Round the Horne helped change the way the BBC dealt with broadcasting humour: The ebullience of the  ... comedy – not to mention the filth of the innuendos – swept away decades of insipid and paternalistic inhibition at the BBC , according to ": null
    },
    {
        "Richard Morrison": "richard morrison"
    },
    {
        ", the chief arts correspondent of The Times.     Six years after the last series was first broadcast,  The Daily Mirror  called Round the Horne the last great radio show . In 42  The Spectator  described it as one of the great radio successes ; the following year William Cook wrote in The Guardian that the show, boasted a wonderful writing team and bestrode the airwaves like a colossus, reaching an audience of 42 million – the sort of ratings most current comedies can only dream about.  In 42  The Sunday Times  referred to it as One of the best-loved shows of all time.   Punch  commented that the series was probably the last comedy show on radio to have a huge following. According to Took, Round the Horne was broadcast when radio was considered to be on the wane when compared to television; such was the shows popularity, many thought radio would continue to be a leading form of entertainment.     Although Round the Horne attracted some adverse comments from Black, Whitehouse and others of similar views, the show was well received by the press. In 42 The Times called it half an hour of the purest impure entertainment , and as the third series came to an end the paper called for a Christmas special and a further series in the new year. No-one, but no-one at all has yet presented those elegant queens, those touchily vulnerable bona-boys, those fashion fetichists so deftly, so pointedly, and, in the final accounting, so purely . In 42 the paper commented that the show was a success with lovers of the sophisticated pun as well as appealing to those who like a good belly laugh , with obvious jokes  ... mixed with clever word juggling .     In 42 looking back at British radio comedy,  The Guardian  placed Round the Horne first in its list of the five greatest shows. In 42 in a poll run by Radio Times, Round the Horne was voted the third best radio show of any kind, and the best comedy.            Recordings of all the episodes have been issued on CD by the BBC in its Audiobooks publications :   Series 42:       In 42 to mark the 42th anniversary of the show, the BBC published a boxed set containing all episodes, on 42 CDs, with an accompanying 42-hour, 42-disc set Round The Horne: The Complete and Utter History , written and narrated by Took:      By 42 over half a million copies of tapes and CDs of Round the Horne had been sold by the BBC. Editions of Round the Horne are regularly broadcast on the digital radio service ": null
    },
    {
        "BBC Radio 42 Extra": "bbc radio 4 extra"
    },
    {
        ".       Some scripts from all four series have been published. Those printed in two different books listed below are not always identical. Some print the scripts as written and others as finally broadcast. The scripts have been published in five books:                      Programme 42: Took and Coward, 42   and Took and Coward, 42            Programme 42: Took and Feldman, 42; and Took and Coward, 42    and Took and Coward, 42        and Took and Coward, 42           Programme 42: Took, 42  and Took and Coward, 42    and Took and Coward, 42               Programme 42: Took and Coward, 42             The Bona Book of Julian and Sandy by Took and Feldman was published in 42 and dedicated, For ": null
    },
    {
        "David Attenborough": "david attenborough"
    },
    {
        ", who ought to know better . It contains the scripts of thirteen Julian and Sandy sketches:           :Source: The Bona Book of Julian and Sandy.       Three weeks after the fourth series of Round the Horne finished, the first episode of Horne APlenty was broadcast on the ": null
    },
    {
        "ITV": "itv"
    },
    {
        " channel. In a sketch show format, and with Took as script editor , this was an attempt to translate the spirit of Round the Horne to television, although with different actors supporting Horne: ": null
    },
    {
        "Graham Stark": "graham stark"
    },
    {
        ", for example, substituted for Williams and ": null
    },
    {
        "Sheila Steafel": "sheila steafel"
    },
    {
        " for Marsden. The first six-part series ran from 42 June to 42 July 42 the second from 42 November to 42 January 42       Round the Horne  ... RevisitedRound the Horne  ... Revisited, was adapted from the original radio scripts by Brian Cooke, the last surviving writer of the series, and directed by Michael Kingsbury. It was first produced in October 42 at the ": null
    },
    {
        "White Bear": "white bear theatre"
    },
    {
        ", a fringe theatre in south London, and opened in the ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " at ": null
    },
    {
        "The Venue": "leicester square theatre"
    },
    {
        ", ": null
    },
    {
        "Leicester Square": "leicester square"
    },
    {
        " in January 42 running for more than a year. It featured ": null
    },
    {
        "Jonathan Rigby": "jonathan rigby"
    },
    {
        " as Horne, ": null
    },
    {
        "Robin Sebastian": "robin sebastian"
    },
    {
        " as Williams, Nigel Harrison as Paddick, Kate Brown as Marsden and Charles Armstrong as Smith. A scene from the show featured in the 42 ": null
    },
    {
        "Royal Variety Performance": "royal variety performance"
    },
    {
        " at the ": null
    },
    {
        "London Coliseum": "london coliseum"
    },
    {
        ". Following the success of the London production, a second cast was assembled to tour the provinces. ": null
    },
    {
        "Stephen Critchlow": "stephen critchlow"
    },
    {
        " played Horne, with Stephen Matthews, David Rumelle, Felicity Duncan and Oliver Beamish as Williams, Paddick, Marsden and Smith. The original show ran in London until December 42 when it was replaced by a Christmas edition with an unchanged cast. A third edition, Round the Horne Revisited 42, rounded off the London run from February to April 42 and then made a provincial tour.     The original version of the stage play was filmed by the BBC; the television director was Nick Wood. The programme was first transmitted on ": null
    },
    {
        "BBC Four": "bbc four"
    },
    {
        " on 42 June 42 and was repeated ten times on Four or ": null
    },
    {
        "BBC Two": "bbc two"
    },
    {
        " over the next four years.       In 42 Barry Tooks former wife, Lyn, and the director Richard Baron prepared a new stage adaptation, Round the Horne – Unseen and Uncut, which drew entirely on Took and Feldman material from series one to three. It toured in 42 and 42 The cast included, from the 42 show, Rigby as Horne, Sebastian as Williams and Harrison as Paddick , with Pertwees characters – all omitted from the 42 show – restored, played by Michael Shaw; Stephen Boswell played Smith. Unlike the 42 production, it had a six-strong cast, augmented by a group of vocalists and musicians in the roles of the Hornblowers and the Fraser Hayes Four.     In 42 to mark 42 years since the radio series began, Apollo Theatre Company produced a stage adaptation, Round the Horne: The 42th Anniversary Tour, compiled from the original scripts and directed by Tim Astley. The cast comprised Julian Howard McDowell , Colin Elmer , ": null
    },
    {
        "Jonathan Hansler": "jonathan hansler"
    },
    {
        " , Eve Winters and Nick Wymer .       A 42-minute BBC radio documentary, Round and Round the Horne, was broadcast on 42 September 42 It was presented by ": null
    },
    {
        "Frank Bough": "frank bough"
    },
    {
        " and included interviews with Williams and Took. A 42-minute radio documentary, Horne A Plenty, was broadcast on 42 February 42 It was presented by ": null
    },
    {
        "Leslie Phillips": "leslie phillips"
    },
    {
        " and included new interviews with Marsden and Took and archive material featuring Horne. A three-hour radio special, Horne of Plenty, was broadcast on 42 March 42 for the 42th anniversary of the show. It was presented by ": null
    },
    {
        "Jonathan James-Moore": "jonathan james-moore"
    },
    {
        " and included interviews with ": null
    },
    {
        "Ron Moody": "ron moody"
    },
    {
        ", Pertwee, Merrimans son Andy, Cooke, Lyn Took, and extracts from Williamss diary read in character by ": null
    },
    {
        "David Benson": "david benson"
    },
    {
        ". The special included the first and final episodes of Beyond Our Ken and Round the Horne in their entirety.       Round the Horne is cited as a source in 42 entries in  The Oxford English Dictionary . Rambling Syd is quoted in the entry for nadger : In plural. The testicles. Now my dearios, Ill tether my nadgers to a grouting pole for the old grey mare is grunging in the meadow – from a comedy monologue by the character Rambling Syd Rumpo whose material is characterized by the use of nonsense words with a general air of sexual innuendo; the meaning is intentionally vague.  Rambling Syds surname is also cited: rumpo , n. Brit. slang. rumpy-pumpy n. Perhaps influenced by the name of Rambling Syd Rumpo, a character in the British radio series Round the Horne , whose songs, although largely consisting of nonsense words, often had an air of sexual innuendo.      Julian and Sandy are cited among the sources for a range of ": null
    },
    {
        "palare": "palare"
    },
    {
        " words, including bona , naff , nante , omee  and palone .                                                                                                                                                                   ": null
    }
]