[
    {
        "      Roy Harris Jenkins, Baron Jenkins of Hillhead,  , was a British politician and the ": null
    },
    {
        "President of the European Commission": "president of the european commission"
    },
    {
        " from 1977 to 1981. He was at various times a member of the ": null
    },
    {
        "Labour Party": "labour party"
    },
    {
        ", ": null
    },
    {
        "Social Democratic Party": "social democratic party"
    },
    {
        " and the ": null
    },
    {
        "Liberal Democrats": "liberal democrats"
    },
    {
        ".     The son of a ": null
    },
    {
        "Welsh": "welsh people"
    },
    {
        " coal-miner and trade unionist, himself later a Labour MP, Jenkins was educated at the ": null
    },
    {
        "University of Oxford": "university of oxford"
    },
    {
        " and served as an intelligence officer during the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ". Elected to Parliament as a Labour MP in 1948, he went on to serve as both ": null
    },
    {
        "Chancellor of the Exchequer": "chancellor of the exchequer"
    },
    {
        " and ": null
    },
    {
        "Home Secretary": "home secretary"
    },
    {
        " under the Labour Governments of ": null
    },
    {
        "Harold Wilson": "harold wilson"
    },
    {
        " and ": null
    },
    {
        "James Callaghan": "james callaghan"
    },
    {
        ". In his first period as Home Secretary he sought to build what he described as a civilised society , with measures such as the effective abolition in Britain of both capital punishment and theatre censorship, the partial decriminalisation of ": null
    },
    {
        "homosexuality": "homosexuality"
    },
    {
        ", relaxing of divorce law, suspension of ": null
    },
    {
        "birching": "birching"
    },
    {
        " and the liberalisation of ": null
    },
    {
        "abortion law": "abortion act 1967"
    },
    {
        ". As Chancellor of the Exchequer he pursued a tight fiscal policy. He was elected ": null
    },
    {
        "Deputy Leader of the Labour Party": "deputy leader of the labour party"
    },
    {
        " in 1970, but resigned in 1972 because he supported entry to the ": null
    },
    {
        "European Communities": "european communities"
    },
    {
        ", which the party opposed.      He later chose to leave British politics in 1976, being appointed President of the European Commission the following year, serving until 1981. He was the first British holder of this office. He returned to British politics in 1981; dismayed with the Labour Partys left-ward movement under ": null
    },
    {
        "Michael Foot": "michael foot"
    },
    {
        ", he was one of the ": null
    },
    {
        "Gang of Four": "gang of four"
    },
    {
        " —centrist Labour figures who formed the ": null
    },
    {
        "Social Democratic Party": "social democratic party"
    },
    {
        " .  In 1982, Jenkins won ": null
    },
    {
        "a by-election": "1982 glasgow hillhead by-election"
    },
    {
        " to return to Parliament, taking the seat from the Conservatives in a famous result. He was formally made Leader of the SDP ahead of the ": null
    },
    {
        "1983 general election": "1983 united kingdom general election"
    },
    {
        ", during the ": null
    },
    {
        "SDP-Liberal Alliance": "sdp-liberal alliance"
    },
    {
        ". However, after disappointment with the performance of the SDP, he resigned as leader.        In 1987 he was elected to succeed ": null
    },
    {
        "Harold Macmillan": "harold macmillan"
    },
    {
        " as ": null
    },
    {
        "Chancellor of the University of Oxford": "chancellor of the university of oxford"
    },
    {
        " following the latters death; he held this position until his own death sixteen years later. A few months after becoming Chancellor he was defeated at the ": null
    },
    {
        "1987 general election": "uk general election, 1987"
    },
    {
        " by the Labour candidate, ": null
    },
    {
        "George Galloway": "george galloway"
    },
    {
        ". Jenkins accepted a ": null
    },
    {
        "life peer": "life peer"
    },
    {
        "age shortly afterwards, and sat in the ": null
    },
    {
        "House of Lords": "house of lords"
    },
    {
        " as a ": null
    },
    {
        "Liberal Democrat": "liberal democrats"
    },
    {
        ". In the late 1990s he was an adviser to Prime Minister ": null
    },
    {
        "Tony Blair": "tony blair"
    },
    {
        " and chaired the ": null
    },
    {
        "Jenkins Commission": "jenkins commission"
    },
    {
        " on electoral reform. Jenkins died in 2003, aged 82.     In addition to his political career he was also a noted historian, biographer and writer. His A Life at the Centre is regarded as one of the best autobiographies of the later 20th century, which will be read with pleasure long after most examples of the genre have been forgotten .        Born in ": null
    },
    {
        "Abersychan": "abersychan"
    },
    {
        ", ": null
    },
    {
        "Monmouthshire": "monmouthshire"
    },
    {
        ", in south-eastern ": null
    },
    {
        "Wales": "wales"
    },
    {
        ", as an only child, Roy Jenkins was the son of a ": null
    },
    {
        "National Union of Mineworkers": "national union of mineworkers"
    },
    {
        " official, ": null
    },
    {
        "Arthur Jenkins": "arthur jenkins"
    },
    {
        ". His father was imprisoned during the ": null
    },
    {
        "1926 General Strike": "uk general strike of 1926"
    },
    {
        " for his alleged involvement in disturbances. John Campbell, Roy Jenkins: A Well-Rounded Life , p. 9. Arthur Jenkins later became President of the ": null
    },
    {
        "South Wales Miners Federation": "south wales miners federation"
    },
    {
        " and Member of Parliament for ": null
    },
    {
        "Pontypool": "pontypool"
    },
    {
        ", ": null
    },
    {
        "Parliamentary Private Secretary": "parliamentary private secretary"
    },
    {
        " to ": null
    },
    {
        "Clement Attlee": "clement attlee"
    },
    {
        ", and briefly a minister in the ": null
    },
    {
        "1945 Labour government": "labour government 1945-1951"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, pp. 9–10. Roy Jenkins mother, Hattie Harris, was the daughter of a steelworks foreman. Campbell, Roy Jenkins: A Well-Rounded Life, p. 11.     Jenkins was educated at Pentwyn Primary School, ": null
    },
    {
        "Abersychan County Grammar School": "abersychan comprehensive school"
    },
    {
        ", ": null
    },
    {
        "University College, Cardiff": "cardiff university"
    },
    {
        ", and at ": null
    },
    {
        "Balliol College, Oxford": "balliol college, oxford"
    },
    {
        ", where he was twice defeated for the Presidency of the ": null
    },
    {
        "Oxford Union": "oxford union"
    },
    {
        " but took ": null
    },
    {
        "First-Class Honours": "first-class honours"
    },
    {
        " in ": null
    },
    {
        "Politics, Philosophy and Economics": "politics, philosophy and economics"
    },
    {
        " . Campbell, Roy Jenkins: A Well-Rounded Life, p. 17, p. 25, p. 60. His university colleagues included ": null
    },
    {
        "Tony Crosland": "anthony crosland"
    },
    {
        ", ": null
    },
    {
        "Denis Healey": "denis healey"
    },
    {
        " and ": null
    },
    {
        "Edward Heath": "edward heath"
    },
    {
        ", and he became friends with all three, although he was never particularly close to Healey. In ": null
    },
    {
        "John Campbells": "john campbell"
    },
    {
        "biography A Well-Rounded Life a romantic relationship between Jenkins and Crosland was detailed.  Campbell, Roy Jenkins: A Well-Rounded Life, p. 33.     During the ": null
    },
    {
        "Second World War": "world war ii"
    },
    {
        ", Jenkins received his officer training at ": null
    },
    {
        "Alton Towers": "alton towers"
    },
    {
        " and was posted to the 55th West Somerset Yeomanry at West Lavington. Campbell, Roy Jenkins: A Well-Rounded Life, p. 67, p. 71. Through the influence of his father, in April 1944 Jenkins was sent to ": null
    },
    {
        "Bletchley Park": "bletchley park"
    },
    {
        " to work as a codebreaker. Campbell, Roy Jenkins: A Well-Rounded Life, p. 78, p. 81. PBS Nova, Decoding Nazi Secrets , 27 November 2015 ; BBC Obituary: Roy Jenkins, Sunday, 5 January 2003       Having failed to win ": null
    },
    {
        "Solihull": "solihull"
    },
    {
        " in ": null
    },
    {
        "1945": "1945 united kingdom general election"
    },
    {
        ", he was elected to the ": null
    },
    {
        "House of Commons": "british house of commons"
    },
    {
        " in ": null
    },
    {
        "a 1948 by-election": "1948 southwark central by-election"
    },
    {
        " as the Member of Parliament for ": null
    },
    {
        "Southwark Central": "southwark central"
    },
    {
        ", becoming the ": null
    },
    {
        "Baby of the House": "baby of the house"
    },
    {
        " . His constituency was abolished in ": null
    },
    {
        "boundary changes": "boundary commissions"
    },
    {
        " for the ": null
    },
    {
        "1950 general election": "1950 united kingdom general election"
    },
    {
        ", when he stood instead in the new ": null
    },
    {
        "Birmingham Stechford": "birmingham stechford"
    },
    {
        " constituency. He won the seat, and represented the constituency until 1977.     In 1947 he edited a collection of ": null
    },
    {
        "Clement Attlees": "clement attlee"
    },
    {
        "speeches, published under the title Purpose and Policy. Campbell, Roy Jenkins: A Well-Rounded Life, p. 105. Attlee then granted Jenkins access to his private papers so that he could write his biography, which appeared in 1948 . Campbell, Roy Jenkins: A Well-Rounded Life, pp. 105–106. The reviews were generally favourable, including ": null
    },
    {
        "George Orwells": "george orwell"
    },
    {
        "in  Tribune . Campbell, Roy Jenkins: A Well-Rounded Life, p. 106.     In 1951 Tribune published his pamphlet Fair Shares for the Rich. Campbell, Roy Jenkins: A Well-Rounded Life, p. 126. Jenkins, A Life at the Centre, p. 85. Here, Jenkins advocated the abolition of large private incomes by taxing them, graduating from 50 per cent for incomes between £20,000 and £30,000 to 95 per cent for incomes over £100,000. He also proposed further nationalisations and said: Future nationalisations will be more concerned with equality than with planning, and this means that we can leave the monolithic public corporation behind us and look for more intimate forms of ownership and control . Roy Jenkins, Fair Shares for the Rich , p. 16. He later described this almost ": null
    },
    {
        "Robespierrean": "maximilien robespierre"
    },
    {
        " pamphlet as the apogee of my excursion to the left .     Jenkins contributed an essay on Equality to the 1952 collection New Fabian Essays. Campbell, Roy Jenkins: A Well-Rounded Life, p. 128. In 1953 appeared Pursuit of Progress, a work intended to counter ": null
    },
    {
        "Bevanism": "bevanism"
    },
    {
        ". Retreating from what he had demanded in Fair Shares for the Rich, Jenkins now argued that the redistribution of wealth would occur over a generation. Campbell, Roy Jenkins: A Well-Rounded Life, p. 137. However, he still proposed further nationalisations: It is quite impossible to advocate both the abolition of great inequalities of wealth and the acceptance of a one-quarter public sector and three-quarters private sector arrangement. A ": null
    },
    {
        "mixed economy": "mixed economy"
    },
    {
        " there will undoubtedly be, certainly for many decades and perhaps permanently, but it will need to be mixed in very different proportions from this . Roy Jenkins, Pursuit of Progress , p. 96. He also opposed the Bevanites neutralist foreign policy platform: Neutrality is essentially a conservative policy, a policy of defeat, of announcing to the world that we have nothing to say to which the world will listen. ... Neutrality could never be acceptable to anyone who believes that he has a universal faith to preach . Jenkins, Pursuit of Progress, pp. 44–45. Jenkins argued that the Labour leadership needed to take on and defeat the neutralists and pacifists in the party; it would be better to risk a split in the party than face the destruction, by schism, perhaps for a generation, of the whole progressive movement in the country . Jenkins, Pursuit of Progress, p. 37.     Between 1951 and 1956 he wrote a weekly column for the Indian newspaper The Current. Here he advocated progressive reforms such as equal pay, the decriminalisation of homosexuality, the liberalisation of the obscenity laws and the abolition of capital punishment. Campbell, Roy Jenkins: A Well-Rounded Life, p. 153, p. 182. Mr Balfours Poodle, a short account of the House of Lords crisis of 1911 that culminated in the ": null
    },
    {
        "Parliament Act 1911": "parliament act 1911"
    },
    {
        ", was published in 1954. Favourable reviewers included ": null
    },
    {
        "A. J. P. Taylor": "a. j. p. taylor"
    },
    {
        ", ": null
    },
    {
        "Harold Nicolson": "harold nicolson"
    },
    {
        ", ": null
    },
    {
        "Leonard Woolf": "leonard woolf"
    },
    {
        " and ": null
    },
    {
        "Violet Bonham Carter": "violet bonham carter"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 148. After a suggestion by ": null
    },
    {
        "Mark Bonham Carter": "mark bonham carter"
    },
    {
        ", Jenkins then wrote a biography of the Victorian radical, Sir ": null
    },
    {
        "Charles Dilke": "charles dilke"
    },
    {
        ", which was published in October 1958. Campbell, Roy Jenkins: A Well-Rounded Life, p. 149, p. 151.     During the 1956 ": null
    },
    {
        "Suez Crisis": "suez crisis"
    },
    {
        ", Jenkins denounced ": null
    },
    {
        "Anthony Edens": "anthony eden"
    },
    {
        " squalid imperialist adventure at a Labour rally in Birmingham Town Hall. Campbell, Roy Jenkins: A Well-Rounded Life, p. 187. Three years later he claimed that Suez was a totally unsuccessful attempt to achieve unreasonable and undesirable objectives by methods which were at once reckless and immoral; and the consequences, as was well deserved, were humiliating and disastrous . Roy Jenkins, The Labour Case , p. 14.     Jenkins praised ": null
    },
    {
        "Anthony Croslands": "anthony crosland"
    },
    {
        "1956 work  The Future of Socialism  as the most important book on socialist theory since ": null
    },
    {
        "Evan Durbins": "evan durbin"
    },
    {
        " The Politics of Democratic Socialism . Campbell, Roy Jenkins: A Well-Rounded Life, p. 181. With much of the economy now nationalised, Jenkins argued, socialists should concentrate on eliminating the remaining pockets of poverty and on the removal of class barriers, as well as promoting libertarian social reforms. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 181–182. Jenkins was principal sponsor, in 1959, of the bill which became the liberalising ": null
    },
    {
        "Obscene Publications Act": "obscene publications act"
    },
    {
        ", responsible for establishing the liable to deprave and corrupt criterion as a basis for a prosecution of suspect material and for specifying literary merit as a possible defence. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 182–186.     In July 1959 ": null
    },
    {
        "Penguin": "penguin books"
    },
    {
        " published Jenkins The Labour Case, timed to anticipate the ": null
    },
    {
        "upcoming election": "1959 united kingdom general election"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 197. Jenkins argued that Britains chief danger was that of living sullenly in the past, of believing that the world has a duty to keep us in the station to which we are accustomed, and showing bitter resentment if it does not do so . He added: Our neighbours in Europe are roughly our economic and military equals. We would do better to live gracefully with them than to waste our substance by trying unsuccessfully to keep up with the power giants of the modern world . Jenkins, The Labour Case, p. 11. Jenkins claimed that the Attlee government concentrated too much towards the austerity of fair shares, and too little towards the incentives of free consumers choice . Jenkins, The Labour Case, p. 74. Although he still believed in the elimination of poverty and more equality, Jenkins now argued that these aims could be achieved by economic growth. In the final chapter Jenkins set out a list of necessary progressive social reforms: the abolition of the death penalty, decriminalisation of homosexuality, abolition of the Lord Chamberlains powers of theatre censorship, liberalisation of the licensing and betting laws, liberalisation of the divorce laws, legalisation of abortion, decriminalisation of suicide and more liberal immigration laws. Jenkins concluded:     Let us be on the side of those who want people to be free to live their own lives, to make their own mistakes, and to decide, in an adult way and provided they do not infringe the rights of others, the code by which they wish to live; and on the side of experiment and brightness, of better buildings and better food, of better music  and better books, of fuller lives and greater freedom. In the long run these things will be more important than the most perfect of economic policies. Jenkins, The Labour Case, p. 146.     In the aftermath of Labours 1959 defeat, Jenkins appeared on Panorama and argued that Labour should abandon further nationalisation, question its connection with the trade unions and not dismiss a closer association with the ": null
    },
    {
        "Liberal Party": "liberal party"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 204. Jenkins, A Life at the Centre, p. 130. In November he delivered a ": null
    },
    {
        "Fabian Society": "fabian society"
    },
    {
        " lecture in which he blamed Labours defeat on the unpopularity of nationalisation and he repeated this in an article for The Spectator. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 205–206. His Spectator article also called for Britain to accept its diminished place in the world, to grant ": null
    },
    {
        "colonial freedom": "decolonisation"
    },
    {
        ", to spend more on public services and to promote the right of individuals to live their own lives free from the constraints of popular prejudices and state interference. Campbell, Roy Jenkins: A Well-Rounded Life, p. 206. Jenkins later called it a good radical programme, although...not a socialist one . Jenkins, A Life at the Centre, pp. 130–131.     In May 1960 Jenkins joined the ": null
    },
    {
        "Campaign for Democratic Socialism": "campaign for democratic socialism"
    },
    {
        ", a Gaitskellite pressure group designed to fight against left-wing domination of the Labour Party. Campbell, Roy Jenkins: A Well-Rounded Life, p. 212. In July 1960 Jenkins resigned from his frontbench role in order to be able to campaign freely for British membership of the Common Market. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 212–213. At the 1960 Labour Party conference in ": null
    },
    {
        "Scarborough": "scarborough, north yorkshire"
    },
    {
        ", Jenkins advocated rewriting ": null
    },
    {
        "Clause IV": "clause iv"
    },
    {
        " of the partys constitution but he was booed. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 210–211. In November he wrote in The Spectator that unless the Labour Party is determined to abdicate its role as a mass party and become nothing more than a narrow sectarian society, its paramount task is to represent the whole of the Leftward-thinking half of the country—and to offer the prospect of attracting enough marginal support to give that half some share of power . Roy Jenkins, And Fight Again, The Spectator , p. 8.     During 1960–62 his main campaign was British membership of the Common Market, where he became Labours leading advocate of entry. When ": null
    },
    {
        "Harold Macmillan": "harold macmillan"
    },
    {
        " initiated the first British application to join the Common Market in 1961, Jenkins became deputy chairman of the all-party Common Market Campaign and then chairman of the Labour Common Market Committee. Campbell, Roy Jenkins: A Well-Rounded Life, p. 214. At the 1961 Labour Party conference Jenkins spoke in favour of Britains entry. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 214–215.     Since 1959 Jenkins had been working on a biography of the Liberal Prime Minister, ": null
    },
    {
        "H. H. Asquith": "h. h. asquith"
    },
    {
        ". For Jenkins, Asquith ranked with Attlee as the embodiment of the moderate, liberal intelligence in politics that he most admired. Through Asquiths grandson, Mark Bonham Carter, Jenkins had access to Asquiths letters to his mistress, ": null
    },
    {
        "Venetia Stanley": "venetia stanley"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 236. ": null
    },
    {
        "Kenneth Rose": "kenneth rose"
    },
    {
        ", ": null
    },
    {
        "Michael Foot": "michael foot"
    },
    {
        ", ": null
    },
    {
        "Asa Briggs": "asa briggs"
    },
    {
        " and ": null
    },
    {
        "John Grigg": "john grigg"
    },
    {
        " all favourably reviewed the book when it was published in October 1964. Campbell, Roy Jenkins: A Well-Rounded Life, p. 239. However, Violet Bonham Carter wrote a defence of her father in The Times against the few criticisms of Asquith in the book, Violet Bonham Carter, Asquith Revealed By Events, The Times , p. 11. and ": null
    },
    {
        "Robert Rhodes James": "robert rhodes james"
    },
    {
        " wrote in The Spectator that Asquith was surely a tougher, stronger, more acute man...than Mr. Jenkins would have us believe. The fascinating enigma of his complete decline is never really analysed, nor even understood. ... We required a ": null
    },
    {
        "Sutherland": "graham sutherland"
    },
    {
        ": but we have got an ": null
    },
    {
        "Annigoni": "pietro annigoni"
    },
    {
        " . Robert Rhodes James, Last of the Romans?, The Spectator , p. 23. John Campbell claims that for half a century it has remained unchallenged as the best biography and is rightly regarded as a classic . Campbell, Roy Jenkins: A Well-Rounded Life, p. 239.     Like Healey and Crosland, he had been a close friend of ": null
    },
    {
        "Hugh Gaitskell": "hugh gaitskell"
    },
    {
        " and for them Gaitskells death and the elevation of ": null
    },
    {
        "Harold Wilson": "harold wilson"
    },
    {
        " as Labour Party leader was a setback. For Jenkins, Gaitskell would remain his political hero. Campbell, Roy Jenkins: A Well-Rounded Life, p. 230. After the ": null
    },
    {
        "1964 general election": "1964 united kingdom general election"
    },
    {
        " Jenkins was appointed ": null
    },
    {
        "Minister of Aviation": "minister of aviation"
    },
    {
        " and was sworn of the Privy Council. While at Aviation he oversaw the high-profile cancellations of the ": null
    },
    {
        "BAC TSR-2": "bac tsr-2"
    },
    {
        " and ": null
    },
    {
        "Concorde": "concorde"
    },
    {
        " projects . In January 1965 ": null
    },
    {
        "Patrick Gordon Walker": "patrick gordon walker"
    },
    {
        " resigned as Foreign Secretary and in the ensuing reshuffle Wilson offered Jenkins the ": null
    },
    {
        "Department for Education and Science": "department for education and skills"
    },
    {
        "; however, he declined it, preferring to stay at Aviation.  Campbell, Roy Jenkins: A Well-Rounded Life, p. 249.       In the summer of 1965 Jenkins eagerly accepted an offer to replace ": null
    },
    {
        "Frank Soskice": "frank soskice"
    },
    {
        " as Home Secretary. However Wilson, dismayed by a sudden bout of press speculation about the potential move, delayed Jenkins appointment until December. Once Jenkins took office – the youngest Home Secretary since ": null
    },
    {
        "Churchill": "winston churchill"
    },
    {
        " – he immediately set about reforming the operation and organisation of the ": null
    },
    {
        "Home Office": "home office"
    },
    {
        ". The Principal Private Secretary, Head of the Press and Publicity Department and Permanent Under-Secretary were all replaced. He also redesigned his office, famously replacing the board on which condemned prisoners were listed with a fridge. Campbell, Roy Jenkins: A Well-Rounded Life, p. 261.     After the ": null
    },
    {
        "1966 general election": "1966 united kingdom general election"
    },
    {
        ", in which Labour won a comfortable majority, Jenkins pushed through a series of police reforms which reduced the number of separate forces from 117 to 49. Campbell, Roy Jenkins: A Well-Rounded Life, p. 267. The Times called it the greatest upheaval in policing since the time of ": null
    },
    {
        "Peel": "robert peel"
    },
    {
        " . Overhaul For The Police, The Times , p. 15. His visit to ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        " in September convinced him of the need to introduce two-way radios to the police; whereas the Metropolitan Police possessed 25 radios in 1965, Jenkins increased this to 2,500, and provided similar numbers of radios to the rest of the countrys police forces. Jenkins also provided the police with more car radios, which made the police more mobile but reduced the amount of time they spent patrolling the streets. Campbell, Roy Jenkins: A Well-Rounded Life, p. 269. His ": null
    },
    {
        "Criminal Justice Act 1967": "criminal justice act 1967"
    },
    {
        " introduced more stringent controls on the purchase of shotguns, outlawed last-minute alibis and introduced majority verdicts in ": null
    },
    {
        "juries in England and Wales": "juries in england and wales"
    },
    {
        ". The Act was also designed to lower the prison population by the introduction of release under licence, easier bail, suspended sentences and earlier parole.     Immigration was a divisive and provocative issue during the late 1960s and on 23 May 1966 Jenkins delivered a speech on race relations, which is widely considered to be one of his best.  Addressing a London meeting of the National Committee for Commonwealth Immigrants he notably defined Integration:      Before going on to ask:      And concluding that:        By the end of 1966, Jenkins was the Cabinets rising star; the Guardian called him the best Home Secretary of the century and quite possibly the best since Peel , the Sunday Times called him Wilsons most likeliest successor and the New Statesman labelled him Labours Crown Prince . Campbell, Roy Jenkins: A Well-Rounded Life, p. 285.     In a speech to the London Labour Conference in May 1967, Jenkins said his vision was of a more civilised, more free and less hidebound society and he further claimed that to enlarge the area of individual choice, socially, politically and economically, not just for a few but for the whole community, is very much what democratic socialism is about . Campbell, Roy Jenkins: A Well-Rounded Life, p. 293. He gave strong personal support to ": null
    },
    {
        "David Steels": "david steel"
    },
    {
        " Private Members Bill": "private members bill"
    },
    {
        " for the legalisation of ": null
    },
    {
        "abortion": "abortion"
    },
    {
        ", which became the ": null
    },
    {
        "Abortion Act 1967": "abortion act 1967"
    },
    {
        ", telling the Commons that the existing law on abortion is uncertain and...harsh and archaic , adding that the law is consistently flouted by those who have the means to do so. It is, therefore, very much a question of one law for the rich and one law for the poor .  When the Bill looked likely to be dropped due to insufficient time, Jenkins helped ensure that it received enough parliamentary time to pass and he voted for it in every division. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 295–296.     Jenkins also supported ": null
    },
    {
        "Leo Abses": "leo abse"
    },
    {
        "bill for the decriminalisation of ": null
    },
    {
        "homosexuality": "homosexuality"
    },
    {
        ", which became the ": null
    },
    {
        "Sexual Offences Act 1967": "sexual offences act 1967"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 297. Jenkins told the Commons: It would be a mistake to think...that by what we are doing tonight we are giving a vote of confidence or congratulation to homosexuality. Those who suffer from this disability carry a great weight of loneliness, guilt and shame. The crucial question...is, should we add to those disadvantages the full rigour of the criminal law? By its overwhelming decisions, the House has given a fairly clear answer, and I hope that the Bill will now make rapid progress towards the Statute Book. It will be an important and civilising Measure .      Jenkins also abolished the use of flogging in prisons. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 260–261. In July 1967 Jenkins recommended to the Home Affairs Select Committee a bill to end the ": null
    },
    {
        "Lord Chamberlains": "lord chamberlain"
    },
    {
        "power to censor the theatre. This was passed as the ": null
    },
    {
        "Theatres Act 1968": "theatres act 1968"
    },
    {
        " under Jenkins successor as Home Secretary, James Callaghan. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 300–301. Jenkins also announced that he would introduce legislation banning racial discrimination in employment, which was embodied in the ": null
    },
    {
        "Race Relations Act 1968": "race relations act 1968"
    },
    {
        " passed under Callaghan. Campbell, Roy Jenkins: A Well-Rounded Life, p. 273. In October 1967 Jenkins planned to introduce legislation that would enable him to keep out the 20,000 Kenyan Asians who held British passports .     Jenkins is often seen as responsible for the most wide-ranging social reforms of the late 1960s, with popular historian ": null
    },
    {
        "Andrew Marr": "andrew marr"
    },
    {
        " claiming the greatest changes of the Labour years were thanks to Jenkins.  These reforms would not have happened when they did, earlier than in most other European countries, if Jenkins had not supported them. Campbell, Roy Jenkins: A Well-Rounded Life, p. 298. In a speech in Abingdon in July 1969, Jenkins said that the ": null
    },
    {
        "permissive society": "permissive society"
    },
    {
        " had been allowed to become a dirty phrase: A better phrase is the civilized society, based on the belief that different individuals will wish to make different decisions about their patterns of behaviour and that, provided these do not restrict the freedom of others, they should be allowed to do so within a framework of understanding and tolerance . Chancellor sees no cause for gloom, The Times , p. 3. Jenkins words were immediately reported in the press as The permissive society is the civilised society , which he later wrote was not all that far from my meaning . Campbell, Roy Jenkins: A Well-Rounded Life, p. 299.     For some conservatives, such as ": null
    },
    {
        "Peter Hitchens": "peter hitchens"
    },
    {
        ", Jenkins reforms remain objectionable. In his book  The Abolition of Britain , Hitchens accuses him of being a cultural revolutionary who takes a large part of the responsibility for the decline of traditional values in Britain. During the 1980s ": null
    },
    {
        "Margaret Thatcher": "margaret thatcher"
    },
    {
        " and ": null
    },
    {
        "Norman Tebbit": "norman tebbit"
    },
    {
        " would blame Jenkins for family breakdowns, the decline of respect for authority and the decline of social responsibility. Jenkins replied by pointing out that Thatcher, with her large parliamentary majorities, never attempted to reverse his reforms. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 299–300.       From 1967 to 1970 Jenkins served as ": null
    },
    {
        "Chancellor of the Exchequer": "chancellor of the exchequer"
    },
    {
        ", replacing ": null
    },
    {
        "James Callaghan": "james callaghan"
    },
    {
        " following the ": null
    },
    {
        "devaluation": "devaluation"
    },
    {
        " crisis of November 1967. Jenkins ultimate goal as Chancellor was economic growth, which depended on restoring stability to sterling at its new value after devaluation. This could only be achieved by ensuring a surplus in the ": null
    },
    {
        "balance of payments": "balance of payments"
    },
    {
        ", which had been in a deficit for the previous five years. Therefore, Jenkins pursued ": null
    },
    {
        "deflation": "deflation"
    },
    {
        ", including cuts in public expenditure and increases in taxation, in order to ensure that resources went into exports rather than domestic consumption. Campbell, Roy Jenkins: A Well-Rounded Life, p. 311. Jenkins warned the House of Commons in January 1968 that there was two years of hard slog ahead .      He quickly gained a reputation as a particularly tough Chancellor with his 1968 budget increasing taxes by £923  million, more than twice the increase of any previous budget to date. Edmund Dell, The Chancellors: A History of the Chancellors of the Exchequer, 1945–90 , p. 357. Jenkins had warned the Cabinet that a second devaluation would occur in three months if his budget did not restore confidence in sterling. Campbell, Roy Jenkins: A Well-Rounded Life, p. 318. He restored prescription charges and postponed the raising of the school leaving age to 16 to 1973 instead of 1971. Housing and road building plans were also heavily cut, and he also accelerated Britains withdrawal East of Suez. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 313–314. Dell, The Chancellors, p. 354. Jenkins ruled out increasing the income tax and so raised the taxes on: drinks and cigarettes , purchase tax, petrol duty, road tax, a 50 per cent rise in ": null
    },
    {
        "Selective Employment Tax": "selective employment tax"
    },
    {
        " and a one-off Special Charge on personal incomes. He also paid for an increase in family allowances by cutting child tax allowances. Campbell, Roy Jenkins: A Well-Rounded Life, p. 319.     Despite ": null
    },
    {
        "Edward Heath": "edward heath"
    },
    {
        " claiming it was a hard, cold budget, without any glimmer of warmth Jenkins first budget broadly received a warm reception, with ": null
    },
    {
        "Harold Wilson": "harold wilson"
    },
    {
        " remarking that it was widely acclaimed as a speech of surpassing quality and elegance and ": null
    },
    {
        "Barbara Castle": "barbara castle"
    },
    {
        " that it took everyones breath away . ": null
    },
    {
        "Richard Crossman": "richard crossman"
    },
    {
        " said it was genuinely based on socialist principles, fair in the fullest sense by really helping people at the bottom of the scale and by really taxing the wealthy . Richard Crossman, The Diaries of a Cabinet Minister, Volume II: Lord President of the Council and Leader of the House of Commons, 1966–69 , p. 723. In his budget broadcast on 19 March, Jenkins said that Britain had been living in a fools paradise for years and that it was importing too much, exporting too little and paying ourselves too much , with a lower standard of living than France or West Germany. Campbell, Roy Jenkins: A Well-Rounded Life, p. 323.     Jenkins supporters in the Parliamentary Labour Party became known as the Jenkinsites . These were usually younger, middle-class and university-educated ex-Gaitskellites such as ": null
    },
    {
        "Bill Rodgers": "bill rodgers"
    },
    {
        ", ": null
    },
    {
        "David Owen": "david owen"
    },
    {
        ", ": null
    },
    {
        "Roy Hattersley": "roy hattersley"
    },
    {
        ", ": null
    },
    {
        "Dick Taverne": "dick taverne"
    },
    {
        ", ": null
    },
    {
        "John Mackintosh": "john mackintosh"
    },
    {
        " and ": null
    },
    {
        "David Marquand": "david marquand"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, pp. 330–331. In May–July 1968 some of his supporters, led by ": null
    },
    {
        "Patrick Gordon Walker": "patrick gordon walker"
    },
    {
        " and ": null
    },
    {
        "Christopher Mayhew": "christopher mayhew"
    },
    {
        ", plotted to replace Wilson with Jenkins as Labour leader but he declined to challenge Wilson. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 332–335. A year later his supporters again attempted to persuade Jenkins to challenge Wilson for the party leadership but he again declined. Campbell, Roy Jenkins: A Well-Rounded Life, p. 334. He later wrote in his memoirs that the 1968 plot was for me...the equivalent of the same season of 1953 for ": null
    },
    {
        "Rab Butler": "rab butler"
    },
    {
        ". Having faltered for want of single-minded ruthlessness when there was no alternative to himself, he then settled down to a career punctuated by increasingly wide misses of the premiership. People who effectively seize the prime ministership – Lloyd George, Macmillan, Mrs Thatcher – do not let such moments slip . Jenkins, A Life at the Centre, p. 260.     In April 1968, with Britains reserves declining by approximately £500 millions every quarter, Jenkins went to Washington to obtain a $1,400 million loan from the ": null
    },
    {
        "International Monetary Fund": "international monetary fund"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 336. Following a further sterling crisis in November 1968 Jenkins was forced to raise taxes by a further £250  million. Campbell, Roy Jenkins: A Well-Rounded Life, p. 339. After this the currency markets slowly began to settle and his 1969 budget represented more of the same with a £340  million increase in taxation to further limit consumption. Campbell, Roy Jenkins: A Well-Rounded Life, p. 340. Dell, The Chancellors, p. 359.     By May 1969 Britains current account position was in surplus, thanks to a growth in exports, a drop in overall consumption and, in part, the ": null
    },
    {
        "Inland Revenue": "inland revenue"
    },
    {
        " correcting a previous underestimation in export figures. In July Jenkins was also able to announce that the size of Britains foreign currency reserves had been increased by almost $1  billion since the beginning of the year. It was at this time that he presided over Britains only excess of government revenue over expenditure in the period 1936-7 to 1987–8. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 341–342. Thanks in part to these successes there was a high expectation that the 1970 budget would be a more generous one. Jenkins, however, was cautious about the stability of Britains recovery and decided to present a more muted and fiscally neutral budget. It is often argued that this, combined with a series of bad trade figures, contributed to the Conservative victory at the ": null
    },
    {
        "1970 general election": "1970 united kingdom general election"
    },
    {
        ". Historians and economists have often praised Jenkins for presiding over the transformation in Britains fiscal and current account positions towards the end of the 1960s. ": null
    },
    {
        "Andrew Marr": "andrew marr"
    },
    {
        ", for example, described him as one of the 20th centurys most successful chancellors . ": null
    },
    {
        "Alec Cairncross": "alec cairncross"
    },
    {
        " considered Jenkins the ablest of the four Chancellors I served . Alec Cairncross, Living with the Century , p. 251.     Public expenditure as a proportion of GDP rose from 44 per cent in 1964 to around 50 per cent in 1970. Dell, The Chancellors, p. 357. Despite Jenkins warnings about inflation, wage settlements in 1969–70 increased on average by 13 per cent and contributed to the high inflation of the early 1970s and consequently negated most of Jenkins efforts to obtain a balance of payments surplus. Campbell, Roy Jenkins: A Well-Rounded Life, p. 346. Dell, The Chancellors, p. 367.       After Labour unexpectedly lost power in 1970 Jenkins was appointed ": null
    },
    {
        "Shadow Chancellor of the Exchequer": "shadow chancellor of the exchequer"
    },
    {
        " by ": null
    },
    {
        "Harold Wilson": "harold wilson"
    },
    {
        ". Jenkins was also subsequently ": null
    },
    {
        "elected to the deputy leadership": "1970 labour party deputy leadership election"
    },
    {
        " of the Labour Party in July 1970, defeating future Labour Leader ": null
    },
    {
        "Michael Foot": "michael foot"
    },
    {
        " and former Leader of the Commons ": null
    },
    {
        "Fred Peart": "fred peart"
    },
    {
        " at the first ballot. Campbell, Roy Jenkins: A Well-Rounded Life, p. 361. At this time he appeared the natural successor to ": null
    },
    {
        "Harold Wilson": "harold wilson"
    },
    {
        ", and it appeared to many only a matter of time before he inherited the leadership of the party, and the opportunity to become Prime Minister. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 361–362.     This changed completely, however, as Jenkins refused to accept the tide of anti-European feeling that became prevalent in the Labour Party in the early 1970s. After a special conference on the EEC was held by the Labour Party on 17 July 1971, but from which Jenkins was forbidden from addressing, he delivered one of the most powerful speeches of his career. Campbell, Roy Jenkins: A Well-Rounded Life, p. 375. Jenkins told a meeting of the Parliamentary Labour Party on 19 July: At conference the only alternative we heard was socialism in one country. That is always good for a cheer. Pull up the drawbridge and revolutionize the fortress. Thats not a policy either: its just a slogan, and it is one which becomes not merely unconvincing but hypocritical as well when it is dressed up as our best contribution to international socialism . Jenkins attack on Australia staggers party meeting, The Times , p. 4. This reopened the old Bevanite–Gaitskellite divide in the Party; Wilson told Tony Benn the day after Jenkins speech that he was determined to smash the Campaign for Democratic Socialism. Tony Benn, Office Without Power: Diaries, 1968–1972 , p. 358.     At the 1971 Labour Party conference in Brighton, the NECs motion to reject the Tory terms of entry into the EEC was carried by a large majority. Jenkins told a fringe meeting that this would have no effect on his continued support for Britains entry. Campbell, Roy Jenkins: A Well-Rounded Life, p. 377. Benn said Jenkins was the figure dominating this Conference; there is no question about it . Benn, Office Without Power, p. 377. On 28 October 1971, he led 69 Labour MPs through the ": null
    },
    {
        "division lobby": "division"
    },
    {
        " in support of the Heath governments motion to take Britain into the EEC. In so-doing they were defying a three-line whip and a five-to-one vote at the Labour Party annual conference. Jenkins later wrote: I was convinced that it was one of the decisive votes of the century, and had no intention of spending the rest of my life answering the question of what did I do in the great division by saying I abstained. I saw it in the context of the ": null
    },
    {
        "first Reform Bill": "reform act 1832"
    },
    {
        ", the repeal of the ": null
    },
    {
        "Corn Laws": "corn laws"
    },
    {
        ", Gladstones ": null
    },
    {
        "Home Rule": "irish home rule movement"
    },
    {
        " Bills, the Lloyd George ": null
    },
    {
        "Budget": "peoples budget"
    },
    {
        " and the ": null
    },
    {
        "Parliament Bill": "parliament act 1911"
    },
    {
        ", the ": null
    },
    {
        "Munich Agreement": "munich agreement"
    },
    {
        " and the ": null
    },
    {
        "May 1940 votes": "norway debate"
    },
    {
        " . Jenkins, A Life at the Centre, p. 329.     Jenkins action gave the European cause a legitimacy that would have otherwise been absent had the issue been considered solely as a party political matter. However, he was now regarded by the left as a traitor . ": null
    },
    {
        "James Margach": "james margach"
    },
    {
        " wrote in the Sunday Times: The unconcealed objective of the Left now is either to humiliate Roy Jenkins and his allies into submission – or drive them from the party . Campbell, Roy Jenkins: A Well-Rounded Life, p. 380. At this stage, however, Jenkins would not fully abandon his position as a political insider, and chose to ": null
    },
    {
        "stand again for deputy leader": "1971 labour party deputy leadership election"
    },
    {
        ", an act his colleague ": null
    },
    {
        "David Marquand": "david marquand"
    },
    {
        " claimed he later came to regret. Jenkins promised not to vote with the government again and he narrowly defeated Michael Foot on a second ballot. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 382–383.     In accordance with the party whip, Jenkins voted against ": null
    },
    {
        "European Communities Bill": "european communities bill"
    },
    {
        " 55 times. Campbell, Roy Jenkins: A Well-Rounded Life, p. 384. However, he resigned both the deputy leadership and his shadow cabinet position in April 1972, after the party committed itself to holding a referendum on Britains membership of the EEC. This led to some former admirers, including ": null
    },
    {
        "Roy Hattersley": "roy hattersley"
    },
    {
        ", choosing to distance themselves from Jenkins. Hattersley later claimed that Jenkins resignation was the moment when the old Labour coalition began to collapse and the eventual formation of a new centre party became inevitable . Roy Hattersley, Who Goes Home? Scenes From A Political Life , p. 109. In his resignation letter to Wilson, Jenkins said that if there were a referendum the Opposition would form a temporary coalition of those who, whatever their political views, were against the proposed action. By this means we would have forged a more powerful continuing weapon against progressive legislation than anything we have known in this country since the curbing of the absolute powers of the old House of Lords . Jenkins letter warns Mr Wilson of danger of referendum principle as weapon against progressive legislation, The Times , p. 11.     Jenkins lavish lifestyle  — Wilson once described him as more a socialite than a socialist  — had already alienated much of the Labour Party from him. Wilson accused him of having an affair with socialite ": null
    },
    {
        "Ann Fleming": "ann fleming"
    },
    {
        " - and it was true.      In May 1972 he collected the ": null
    },
    {
        "Charlemagne Prize": "charlemagne prize"
    },
    {
        ", which he had been awarded for promoting European unity. Campbell, Roy Jenkins: A Well-Rounded Life, p. 385. In September an ORC opinion poll found that there was considerable public support for an alliance between the moderate wing of the Labour Party and the Liberals; 35 per cent said they would vote for a Labour–Liberal alliance, 27 per cent for the Conservatives and 23.5 per cent for Socialist Labour. The Times claimed that there were twelve million Jenkinsites . Twelve Million Jenkinsites, The Times , p. 15. During the spring and summer of 1972, Jenkins delivered a series of speeches designed to set out his leadership credentials. These were published in September under the title What Matters Now, which sold well. Campbell, Roy Jenkins: A Well-Rounded Life, p. 399. In the books postscript, Jenkins said that Labour should not be a narrow socialist party advocating unpopular left-wing policies but must aim to represent the hopes and aspirations of the whole leftward thinking half of the country , adding that a broad-based, international, radical, generous-minded party could quickly seize the imagination of a disillusioned and uninspired British public . Roy Jenkins, What Matters Now , p. 122.     After ": null
    },
    {
        "Dick Tavernes": "dick taverne"
    },
    {
        "victory in the ": null
    },
    {
        "1973 Lincoln by-election": "1973 lincoln by-election"
    },
    {
        ", where he stood as ": null
    },
    {
        "Democratic Labour": "democratic labour party"
    },
    {
        " in opposition to the official Labour candidate, Jenkins gave a speech to the Oxford University Labour Club denouncing the idea of a new centre party. Campbell, Roy Jenkins: A Well-Rounded Life, p. 401. Mr Jenkins and Mr Taverne reject centre party proposal, The Times , p. 1. Jenkins was elected to the shadow cabinet in November 1973 as ": null
    },
    {
        "Shadow Home Secretary": "shadow home secretary"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 407. During the ": null
    },
    {
        "February 1974 election": "february 1974 united kingdom general election"
    },
    {
        ", Jenkins rallied to Labour and his campaign was described by ": null
    },
    {
        "David Butler": "david butler"
    },
    {
        " and ": null
    },
    {
        "Dennis Kavanagh": "dennis kavanagh"
    },
    {
        " as sounding a note of civilised idealism . David Butler and Dennis Kavanagh, The British General Election of February, 1974 , p. 162. Jenkins was disappointed that the Liberal candidate in his constituency won 6000 votes; he wrote in his memoirs that I already regarded myself as such a closet Liberal that I naïvely thought they ought nearly all to have come to me . Jenkins, A Life at the Centre, p. 367.     Jenkins wrote a series of biographical essays that appeared in The Times during 1971–74 and which were published as Nine Men of Power in 1974. Jenkins chose Gaitskell, ": null
    },
    {
        "Ernest Bevin": "ernest bevin"
    },
    {
        ", ": null
    },
    {
        "Stafford Cripps": "stafford cripps"
    },
    {
        ", ": null
    },
    {
        "Adlai Stevenson II": "adlai stevenson ii"
    },
    {
        ", ": null
    },
    {
        "Robert F. Kennedy": "robert f. kennedy"
    },
    {
        ", ": null
    },
    {
        "Joseph McCarthy": "joseph mccarthy"
    },
    {
        ", ": null
    },
    {
        "Lord Halifax": "edward wood, 1st earl of halifax"
    },
    {
        ", ": null
    },
    {
        "Léon Blum": "léon blum"
    },
    {
        " and ": null
    },
    {
        "John Maynard Keynes": "john maynard keynes"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, pp. 364–365. In 1971 Jenkins delivered three lectures on foreign policy at ": null
    },
    {
        "Yale University": "yale university"
    },
    {
        ", published a year later as Afternoon on the Potomac? Campbell, Roy Jenkins: A Well-Rounded Life, p. 368.       When Labour returned to power in early 1974, Jenkins was appointed Home Secretary for the second time. Earlier, he had been promised the treasury; however, Wilson later decided to appoint ": null
    },
    {
        "Denis Healey": "denis healey"
    },
    {
        " as Chancellor instead. Upon hearing from ": null
    },
    {
        "Bernard Donoughue": "bernard donoughue"
    },
    {
        " that Wilson had reneged on his promise, Jenkins reacted angrily. Despite being on a public staircase, he is reported to have shouted You tell ": null
    },
    {
        "Harold Wilson": "harold wilson"
    },
    {
        " he must bloody well come to see me  ...and if he doesnt watch out, I wont join his bloody government  ... This is typical of the bloody awful way Harold Wilson does things! Bernard Donoughue, Downing Street Diary: With Harold Wilson in No 10 , p. 53. , p. 644. The Jenkinsites were dismayed by Jenkins refusal to insist upon the Chancellorship and began to look elsewhere for leadership, thus ending the Jenkinsites as a united group. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 415–418.     Jenkins served from 1974 to 1976. Whereas during his first period as Home Secretary in the 1960s the atmosphere had been optimistic and confident, the climate of the 1970s was much more fractious and disillusioned. Campbell, Roy Jenkins: A Well-Rounded Life, p. 420. After two Northern Irish sisters, ": null
    },
    {
        "Marian Price": "marian price"
    },
    {
        " and ": null
    },
    {
        "Dolours Price": "dolours price"
    },
    {
        ", were imprisoned for 20 years for the ": null
    },
    {
        "1973 Old Bailey bombing": "1973 old bailey bombing"
    },
    {
        ", they went on hunger strike in order to be transferred to a prison in Northern Ireland. Campbell, Roy Jenkins: A Well-Rounded Life, p. 423. In a television broadcast in June 1974, Jenkins announced that he would refuse to give in to their demands, although in March 1975 he discreetly transferred them to a Northern Irish prison. Campbell, Roy Jenkins: A Well-Rounded Life, p. 423.     He undermined his previous liberal credentials to some extent by pushing through the controversial ": null
    },
    {
        "Prevention of Terrorism Act": "prevention of terrorism act"
    },
    {
        " in the aftermath of the ": null
    },
    {
        "Birmingham pub bombings": "birmingham pub bombings"
    },
    {
        " of November 1974, which, among other things, extended the length of time suspects could be held in custody and instituted exclusion orders. Campbell, Roy Jenkins: A Well-Rounded Life, p. 425. Jenkins also resisted calls for the death penalty to be restored for terrorist murderers. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 426–427. On 4 December he told the Cabinet committee on Northern Ireland that everything he heard made him more convinced that Northern Ireland had nothing to do with the rest of the UK . Donoughue, Downing Street Diary, p. 254. When reviewing ": null
    },
    {
        "Garret FitzGeralds": "garret fitzgerald"
    },
    {
        "memoirs in 1991, Jenkins proclaimed: My natural prejudices, such as they are, are much more green than orange. I am a poor unionist, believing intuitively that even ": null
    },
    {
        "Paisley": "ian paisley"
    },
    {
        " and ": null
    },
    {
        "Haughey": "charles haughey"
    },
    {
        " are better at dealing with each other than the English are with either . Roy Jenkins, Portraits and Miniatures: Selected Writings , pp. 310–311.     The ": null
    },
    {
        "Sex Discrimination Act 1975": "sex discrimination act 1975"
    },
    {
        "  and the ": null
    },
    {
        "Race Relations Act 1976": "race relations act 1976"
    },
    {
        "  were two notable achievements during his second time as Home Secretary. Campbell, Roy Jenkins: A Well-Rounded Life, p. 422, pp. 428–429.     Jenkins opposed Michael Foots attempts to grant pickets the right to stop lorries during strikes and he was dismayed by Anthony Croslands decision to grant an amnesty to the 11 Labour councillors at ": null
    },
    {
        "Clay Cross": "clay crosshousing finance act dispute"
    },
    {
        " who had been surcharged for refusing to increase council rents in accordance with the Conservatives Housing Finance Act 1972. Campbell, Roy Jenkins: A Well-Rounded Life, p. 432. After two trade unionists, ": null
    },
    {
        "Ricky Tomlinson": "ricky tomlinson"
    },
    {
        " and ": null
    },
    {
        "Des Warren": "des warren"
    },
    {
        " , were imprisoned for intimidation and affray for their part in a strike, Jenkins refused to accede to demands from the labour movement that they should be released. This demonstrated Jenkins increasing estrangement from much of the labour movement and for a time he was heckled in public by people chanting Free the Two . Campbell, Roy Jenkins: A Well-Rounded Life, p. 433. Jenkins also unsuccessfully tried to persuade the Cabinet to adopt electoral reform in the form of ": null
    },
    {
        "proportional representation": "proportional representation"
    },
    {
        " and to have the ": null
    },
    {
        "Official Secrets Act 1911": "official secrets act 1911"
    },
    {
        " liberalised to facilitate more ": null
    },
    {
        "open government": "open government"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, pp. 434–435, p. 467.     Although becoming increasingly disillusioned during this time by what he considered the partys drift to the left, he was the leading Labour figure in the ": null
    },
    {
        "EEC referendum": "1975 united kingdom european communities membership referendum"
    },
    {
        " of June 1975 . In September 1974 he had followed ": null
    },
    {
        "Shirley Williams": "shirley williams"
    },
    {
        " in stating that he could not stay in a Cabinet which had to carry out withdrawal from the EEC. David Wood, Mr Jenkins says he too would resign if Britain decided to leave EEC, The Times , p. 1. During the referendum campaign, Tony Benn claimed that 500,000 jobs had been lost due to Britains membership; Jenkins replied on 27 May that I find it increasingly difficult to take Mr Benn seriously as an economics minister . George Clark, Mr Wilson joins in criticism of Mr Benns figures, The Times , p. 1. He added that Britain outside the EEC would enter an old peoples home for fading nations. ... I do not even think it would be a comfortable or agreeable old peoples home. I do not much like the look of some of the prospective wardens . Roger Berthoud, Mr Jenkins sees cold world outside Nine, The Times , p. 3. The two men debated Britains membership together on Panorama, which was chaired by ": null
    },
    {
        "David Dimbleby": "david dimbleby"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 447. According to David Butler and ": null
    },
    {
        "Uwe Kitzinger": "uwe kitzinger"
    },
    {
        ", they achieved a decidedly more lucid and intricate level of discussion than is commonly seen on political television . David Butler and Uwe Kitzinger, The 1975 Referendum , p. 205. Jenkins found it congenial to work with the centrists of all parties in the campaign and the Yes campaign won by two to one. Campbell, Roy Jenkins: A Well-Rounded Life, p. 448.     After the referendum, Wilson demoted Benn to Energy Secretary and attempted to balance the downgrading of Benn with the dismissal of the right-wing minister ": null
    },
    {
        "Reg Prentice": "reg prentice"
    },
    {
        " from the Department of Education, despite already promising Jenkins that he had no intention of sacking Prentice. Jenkins threatened to resign if Prentice was sacked, telling Wilson that he was a squalid little man who was using squalid little arguments in order to explain why he was performing so much below the level of events . Campbell, Roy Jenkins: A Well-Rounded Life, p. 450. Wilson quickly backed down. Campbell, Roy Jenkins: A Well-Rounded Life, p. 451. In September Jenkins delivered a speech in Prentices constituency of ": null
    },
    {
        "Newham": "london borough of newham"
    },
    {
        " to demonstrate solidarity with him after he was threatened with deselection by left-wingers in the constituency party. Jenkins was heckled by both far-left and far-right demonstrators and he was hit in the chest by a flour bomb thrown by a member of the ": null
    },
    {
        "National Front": "national front"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 452. Jenkins warned that if Prentice was deselected it is not just the local party that is undermining its own foundations by ignoring the beliefs and feelings of ordinary people, the whole legitimate Labour Party, left as well as right, is crippled if extremists have their way . He added that if tolerance is shattered formidable consequences will follow. Labour MPs will either have to become creatures of cowardice, concealing their views, trimming their sails, accepting orders, stilling their consciences, or they will all have to be men far far to the left of those whose votes they seek. Either would make a mockery of parliamentary democracy . Michael Hatfield and David Leigh, Mr Jenkins attacked from right and left at Prentice rally, The Times , p. 1.     In January 1976 he further distanced himself from the left with a speech in ": null
    },
    {
        "Anglesey": "anglesey"
    },
    {
        ", where he repudiated ever-higher public spending: I do not think you can push public expenditure significantly above 60 per cent and maintain the values of a plural society with adequate freedom of choice. We are here close to one of the frontiers of social democracy . Michael Hatfield, Inflation fight goes on, Mr Jenkins tells left, The Times , p. 2. A former supporter, Roy Hattersley, distanced himself from Jenkins after this speech. Campbell, Roy Jenkins: A Well-Rounded Life, p. 454. Susan Crosland, Tony Crosland , p. 315.     In May 1976 he told the ": null
    },
    {
        "Police Federation": "police federation of england and wales"
    },
    {
        " conference to be prepared first to look at the evidence and to recognize how little the widespread use of prison reduces our crime or deals effectively with many of the individuals concerned . Peter Evans, Plain speaking from Mr Jenkins and the police on measures to reduce worsening crime, The Times , p. 5. He also responded to the Federations proposals on law and order: I respect your right to put them to me. You will no doubt respect my right to tell you that I do not think all the points in sum amount to a basis for a rational penal policy .     When Wilson suddenly resigned as Prime Minister in March 1976, Jenkins was one of six candidates for the ": null
    },
    {
        "leadership of the Labour Party": "1976 labour party leadership election"
    },
    {
        " but came third in the first ballot, behind Callaghan and Michael Foot. Realising that his vote was lower than expected, and sensing that the parliamentary party was in no mood to overlook his actions five years before, he immediately withdrew from the contest. On issues such as the EEC, trade union reform and economic policy he had proclaimed views opposite to those held by the majority of Labour Party activists, and his libertarian social views were at variance with the majority of Labour voters. Campbell, Roy Jenkins: A Well-Rounded Life, p. 458. A famous story alleged that when one of Jenkins supporters canvassed a group of miners MPs in the Commons tea-room, he was told: Nay, lad, were all Labour here . Stephen Haseler, The Tragedy of Labour , p. 119.     Jenkins had wanted to become Foreign Secretary,  but Foot warned Callaghan that the party would not accept the pro-European Jenkins as Foreign Secretary. Callaghan instead offered Jenkins the Treasury in six months time . Jenkins turned the offer down. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 462–463. Jenkins then accepted an appointment as ": null
    },
    {
        "President of the European Commission": "president of the european commission"
    },
    {
        "  after Callaghan appointed ": null
    },
    {
        "Anthony Crosland": "anthony crosland"
    },
    {
        " to the Foreign Office. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 462–466.       In an interview with The Times in January 1977, Jenkins said that: My wish is to build an effective united Europe. ... I want to move towards a more effectively organized Europe politically and economically and as far as I am concerned I want to go faster, not slower . Roy Jenkins: Scaling the peaks, The Times , p. 8. The main development overseen by the ": null
    },
    {
        "Jenkins Commission": "jenkins european commission"
    },
    {
        " was the development of the ": null
    },
    {
        "Economic and Monetary Union of the European Union": "economic and monetary union of the european union"
    },
    {
        " from 1977, which began in 1979 as the ": null
    },
    {
        "European Monetary System": "european monetary system"
    },
    {
        ", a forerunner of the Single Currency or ": null
    },
    {
        "Euro": "euro"
    },
    {
        ".  His biographer calls Jenkins the godfather of the euro and claims that among his successors only ": null
    },
    {
        "Jacques Delors": "jacques delors"
    },
    {
        " has made more impact. Campbell, Roy Jenkins: A Well-Rounded Life, p. 502, p. 538.     In speech in ": null
    },
    {
        "Florence": "florence"
    },
    {
        " in October 1977, Jenkins argued that monetary union would facilitate a more efficient and developed rationalisation of industry and commerce than is possible under a Customs Union alone . He added that a major new international currency would form a joint and alternative pillar of the world monetary system which would lead to greater international stability. Monetary union would also combat inflation by controlling the money supply. Jenkins conceded that this would involve the diminution of national sovereignty but he pointed out that governments which do not discipline themselves already find themselves accepting very sharp surveillance from the IMF. Monetary union would also promote employment and diminish regional differences. Jenkins ended the speech by quoting ": null
    },
    {
        "Jean Monnets": "jean monnet"
    },
    {
        "statement that politics was not only the art of the possible, but...the art of making possible tomorrow what may seem impossible today . Campbell, Roy Jenkins: A Well-Rounded Life, pp. 493–494.     President Jenkins was the first President to attend a ": null
    },
    {
        "G8": "g8"
    },
    {
        " summit on behalf of the Community.  He received an Honorary Degree from the ": null
    },
    {
        "University of Bath": "university of bath"
    },
    {
        " in 1978.      In October 1978 Tribune reported that Jenkins and his wife had not paid their Labour Party subscription for several years. After this was repeated in the national press, Jenkins drafted his wifes letter to The Times that refuted the allegation. Campbell, Roy Jenkins: A Well-Rounded Life, p. 505. Jennifer Jenkins, A Labour Party subscription, The Times , p. 17. Jenkins blamed the story on a malicious ": null
    },
    {
        "Trot": "trotskyism"
    },
    {
        " in the North Kensington Labour Party . Jenkins was disillusioned with the Labour Party and he was almost certain that he could not stand again as a Labour candidate; in January 1979 he told ": null
    },
    {
        "Shirley Williams": "shirley williams"
    },
    {
        " that the big mistake we had made was not to go and support Dick Taverne in 1973; everything had got worse since then . Roy Jenkins, European Diary, 1977–1981 , p. 387.     He did not vote in the ": null
    },
    {
        "1979 election": "1979 united kingdom general election"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 507. After the Conservatives won the election ": null
    },
    {
        "Margaret Thatcher": "margaret thatcher"
    },
    {
        " contemplated appointing Jenkins Chancellor of the Exchequer on the strength of his success at cutting public expenditure when he was Chancellor. However, his friend ": null
    },
    {
        "Woodrow Wyatt": "woodrow wyatt"
    },
    {
        " claimed that Jenkins had other and fresh fish to fry . Woodrow Wyatt, Confessions of an Optimist , p. 177. Sarah Curtis , The Journals of Woodrow Wyatt: Volume Two , p. 64. John Campbell, Margaret Thatcher, Volume Two: The Iron Lady , p. 10.     The Director-General of the BBC, ": null
    },
    {
        "Ian Trethowan": "ian trethowan"
    },
    {
        ", invited Jenkins to deliver the ": null
    },
    {
        "Richard Dimbleby Lecture": "richard dimbleby lecture"
    },
    {
        " for 1979, which he did on 22 November. Campbell, Roy Jenkins: A Well-Rounded Life, p. 508. The title Jenkins gave to his lecture, Home Thoughts from Abroad , derived from a ": null
    },
    {
        "Robert Browning": "robert browning"
    },
    {
        " poem. He delivered it in the ": null
    },
    {
        "Royal Society of Arts": "royal society of arts"
    },
    {
        " and it was broadcast live on television. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 510–511. Jenkins analysed the decline of the two-party system since 1951 and criticised the excessive partisanship of British politics, which he claimed alienated the bulk of voters, who were more centrist. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 511–512. He advocated proportional representation and the acceptance of the broad line of division between the public and private sectors , a middle way between ": null
    },
    {
        "Thatcherism": "thatcherism"
    },
    {
        " and ": null
    },
    {
        "Bennism": "bennism"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, pp. 512–513. Jenkins said that the private sector should be encouraged without too much interference to create as much wealth as possible but use the wealth so created both to give a return for enterprise and to spread the benefits throughout society in a way that avoids the disfigurements of poverty, gives a full priority to public education and health services, and encourages co-operation and not conflict in industry and throughout society . Campbell, Roy Jenkins: A Well-Rounded Life, pp. 513–514. He then reiterated his long-standing commitment to libertarianism:     You also make sure that the state knows its place...in relation to the citizen. You are in favour of the right of dissent and the liberty of private conduct. You are against unnecessary centralization and bureaucracy. You want to devolve decision-making wherever you sensibly can. ... You want the nation to be self-confident and outward-looking, rather than insular, xenophobic and suspicious. You want the class system to fade without being replaced either by an aggressive and intolerant proletarianism or by the dominance of the brash and selfish values of a get rich quick society. ... These are some of the objectives which I believe could be assisted by a strengthening of the radical centre. Mr Roy Jenkins sees a British political system ‘stranded by the receding tide’, The Times , p. 5.      The Listener  reprinted the text along with assessments by ": null
    },
    {
        "Enoch Powell": "enoch powell"
    },
    {
        ", ": null
    },
    {
        "Paul Johnson": "paul johnson"
    },
    {
        ", ": null
    },
    {
        "Jack Jones": "jack jones"
    },
    {
        ", ": null
    },
    {
        "J. A. G. Griffith": "j. a. g. griffith"
    },
    {
        ", ": null
    },
    {
        "Bernard Crick": "bernard crick"
    },
    {
        ", ": null
    },
    {
        "Neil Kinnock": "neil kinnock"
    },
    {
        " and ": null
    },
    {
        "Jo Grimond": "jo grimond"
    },
    {
        ". They were all critical; Kinnock thought him misguided as Britain had already suffered from centrist rule for thirty years and Grimond complained that Jenkins clarion call had come 20 years too late. Campbell, Roy Jenkins: A Well-Rounded Life, p. 515.     Jenkins last year as President of the Commission was dominated by ": null
    },
    {
        "Margaret Thatchers": "margaret thatcher"
    },
    {
        "fight for a ": null
    },
    {
        "rebate": "uk rebate"
    },
    {
        " on Britains contribution to the EEC budget. Campbell, Roy Jenkins: A Well-Rounded Life, p. 526. He believed that the quarrel was unnecessary and regretted that it soured Britains relationship with the Community for years. Campbell, Roy Jenkins: A Well-Rounded Life, p. 534. In November 1980 Jenkins delivered the Winston Churchill memorial lecture in Luxembourg, where he proposed a solution to the British budgetary question. The proportion of the Communitys budget spent on agriculture should be reduced by extending Community spending into new areas where Britain would receive more benefit, such as regional spending. The size of the Communitys budget would, in his scheme, be tripled by transferring from the nation states to the Community competence over social and industrial policy. Campbell, Roy Jenkins: A Well-Rounded Life, p. 535.       After his Dimbleby Lecture, Jenkins increasingly favoured the formation of a new social democratic party. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 541–546. He publicly aired these views in a speech to the Parliamentary Press Gallery in June 1980, where he repeated his criticisms of the two-party system and attacked Labours move to the left. At the previous months Wembley conference, Labour had adopted a programme which included non-cooperation with the EEC and a near neutralist and unilateralist defence policy that would, Jenkins argued, render meaningless Britains NATO membership. Mr Jenkins will complete his term in Europe, The Times , p. 2. Labours proposals for further nationalisation and anti-private enterprise policies, Jenkins claimed, were more extreme than in any other democratic country and it was not by any stretch of the imagination a social democratic programme . He added that a new party could reshape politics and lead to the rapid revival of liberal social democratic Britain .     The Labour Party conference at Blackpool in September 1980 adopted a unilateralist defence policy, withdrawal from the EEC and further nationalisation, along with Tony Benns demands for the mandatory reselection of MPs and an electoral college to elect the party leader. Campbell, Roy Jenkins: A Well-Rounded Life, p. 551. In November Labour MPs ": null
    },
    {
        "elected": "1980 labour party leadership election"
    },
    {
        " the left-winger Michael Foot over the right-wing Denis Healey Campbell, Roy Jenkins: A Well-Rounded Life, p. 552. and in January 1981 Labours Wembley conference decided that the electoral college that would elect the leader would give the trade unions 40 per cent of the vote, with MPs and constituency parties 30 per cent each. Campbell, Roy Jenkins: A Well-Rounded Life, p. 557. Jenkins then joined ": null
    },
    {
        "David Owen": "david owen"
    },
    {
        ", ": null
    },
    {
        "Bill Rodgers": "william rodgers, baron rodgers of quarry bank"
    },
    {
        " and ": null
    },
    {
        "Shirley Williams": "shirley williams"
    },
    {
        "  in issuing the ": null
    },
    {
        "Limehouse Declaration": "limehouse declaration"
    },
    {
        ". This called for the realignment of British politics . Campbell, Roy Jenkins: A Well-Rounded Life, p. 557. They then formed the ": null
    },
    {
        "Social Democratic Party": "social democratic party"
    },
    {
        " on 26 March. Campbell, Roy Jenkins: A Well-Rounded Life, p. 559.     Jenkins delivered a series of speeches setting out the SDPs alternative to Thatcherism and Bennism and argued that the solution to Britains economic troubles lay in the revenue from ": null
    },
    {
        "North Sea oil": "north sea oil"
    },
    {
        ", which should be invested in public services. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 564–565. He attempted to re-enter Parliament at the ": null
    },
    {
        "Warrington by-election": "1981 warrington by-election"
    },
    {
        " in July 1981 and campaigned on a six-point programme which he put forward as a Keynesian alternative to Thatcherism and Labours siege economy , but Labour retained the seat with a small majority. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 578–580. Despite it being a defeat, the by-election demonstrated that the SDP was a serious force. Jenkins said after the count that it was the first parliamentary election that he had lost but it was by far the greatest victory in which I have ever participated . Julian Haviland and Philip Webster, Roy Jenkins slashes Labour majority: Tory loses his deposit, The Times , p. 1.     At the SDPs first annual conference in October 1981, Jenkins called for an end to the futile frontier war between public and private sectors and proposed an inflation tax on excessive pay rises that would restrain spiralling wages and prices. After achieving this, an SDP government would be able to embark on economic expansion to reduce unemployment. Alan Wood, Bernard Withers, Geoffrey Browning and Richard Evans, Jenkins demands inflation tax to break wage-price spiral, The Times , p. 2.     In March 1982 he fought the ": null
    },
    {
        "Glasgow Hillhead by-election": "1982 glasgow hillhead by-election"
    },
    {
        ", which had previously been a Conservative-held seat. Polls at the beginning of the campaign put Jenkins in third place but after a series of ten well-attended public meetings which Jenkins addressed, the tide began to turn in Jenkins favour and he was elected with a majority of just over 2000 on a swing of 19 per cent. Campbell, Roy Jenkins: A Well-Rounded Life, p. 594. Jenkins first intervention in the House of Commons following his election, on 31 March, was seen as a disappointment. Campbell, Roy Jenkins: A Well-Rounded Life, p. 598. The Conservative MP ": null
    },
    {
        "Alan Clark": "alan clark"
    },
    {
        " wrote in his diary:     Jenkins, with excessive and almost unbearable gravitas, asked three very heavy statesman-like non-party-political questions of the PM. I suppose he is very formidable, but he was so portentous and long-winded that he started to lose the sympathy of the House about half way through and the barracking resumed. The Lady replied quite brightly and freshly, as if she did not particularly know who he was, or care. Alan Clark, Diaries: Into Politics, 1972–1982 , p. 310.     Whereas earlier in his career Jenkins had excelled in the traditional set-piece debates from the dispatch box, the focus of parliamentary reporting had now moved to the point-scoring of Prime Ministers Questions, which he struggled with. Seated in the traditional place for third parties in the Commons , Jenkins was situated near Labours awkward squad that included ": null
    },
    {
        "Dennis Skinner": "dennis skinner"
    },
    {
        " and ": null
    },
    {
        "Bob Cryer": "bob cryer"
    },
    {
        ", who regularly heckled abuse .     Seven days after Jenkins by-election victory Argentina invaded the Falklands and the subsequent ": null
    },
    {
        "Falklands War": "falklands war"
    },
    {
        " transformed British politics, increased substantially the publics support for the Conservatives and ended any chance that Jenkins election would reinvigorate the SDPs support. Campbell, Roy Jenkins: A Well-Rounded Life, p. 599, p. 609. In the SDP leadership election, Jenkins was elected with 56.44 of the vote, with David Owen coming second. Campbell, Roy Jenkins: A Well-Rounded Life, p. 608. During the ": null
    },
    {
        "1983 election": "1983 united kingdom general election"
    },
    {
        " campaign his position as the prime minister-designate for the SDP-Liberal Alliance was questioned by his close colleagues, as his campaign style was now regarded as ineffective; the ": null
    },
    {
        "Liberal": "liberal party"
    },
    {
        " leader ": null
    },
    {
        "David Steel": "david steel"
    },
    {
        " was considered to have a greater rapport with the electorate. Campbell, Roy Jenkins: A Well-Rounded Life, p. 618.     After the general election Owen succeeded him unopposed. Campbell, Roy Jenkins: A Well-Rounded Life, p. 626. Jenkins was disappointed with Owens move to the right, and his acceptance and backing of some of Thatchers policies. At heart, Jenkins remained an unrepentant ": null
    },
    {
        "Keynesian": "keynesian"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 638, n. In his July 1984 ": null
    },
    {
        "Tawney Lecture": "r. h. tawney"
    },
    {
        ", Jenkins said that the whole spirit and outlook of the SDP must be profoundly opposed to Thatcherism. It could not go along with the fatalism of the Governments acceptance of massive unemployment . Philip Webster, Jenkins and Owen ‘role reversal’, The Times , p. 2. He also delivered a series of speeches in the Commons attacking the Thatcherite policies of the Chancellor, ": null
    },
    {
        "Nigel Lawson": "nigel lawson"
    },
    {
        ". Jenkins called for more government intervention to support industry and for North Sea oil revenues to be channelled into a major programme of rebuilding Britains infrastructure and into educating a skilled workforce. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 638–640. He also attacked the Thatcher government for failing to join the ": null
    },
    {
        "European Exchange Rate Mechanism": "european exchange rate mechanism"
    },
    {
        ". Campbell, Roy Jenkins: A Well-Rounded Life, p. 640.     In 1985 he wrote to The Times to advocate the closing down of the political surveillance role of ": null
    },
    {
        "MI5": "mi5"
    },
    {
        ". Roy Jenkins, Stemming tide of State surveillance, The Times , p. 12. During the controversy surrounding ": null
    },
    {
        "Peter Wrights": "peter wright"
    },
    {
        "  Spycatcher , in which he alleged that Harold Wilson had been a Soviet spy, Jenkins rubbished the allegation and reiterated his call for the end of MI5s powers of political survelliance.      In 1986 he won The Spectators Parliamentarian of the Year award. Campbell, Roy Jenkins: A Well-Rounded Life, p. 638. He continued to serve as SDP Member of Parliament for Glasgow Hillhead until his defeat at the 1987 general election by the Labour candidate George Galloway , after boundary changes in 1983 had changed the character of the constituency. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 660–661.     In 1986 appeared his biography of Harry S. Truman and the following year his biography of Stanley Baldwin was published. Campbell, Roy Jenkins: A Well-Rounded Life, p. 630.       From 1987, Jenkins remained in politics as a member of the House of Lords as a life peer with the title Baron Jenkins of Hillhead, of Pontypool in the County of Gwent . Also in 1987, Jenkins was elected Chancellor of the University of Oxford . Campbell, Roy Jenkins: A Well-Rounded Life, p. 652. He was leader of the Liberal Democrats in the Lords from 1988 until 1997.     In 1988 he fought and won an amendment to the Education Reform Act 1988 , guaranteeing academic freedom of speech in further and higher education establishments. This affords and protects the right of students and academics to question and test received wisdom and has been incorporated into the statutes or articles and instruments of governance of all universities and colleges in Britain. Campbell, Roy Jenkins: A Well-Rounded Life, p. 657.     In 1991 his memoirs, A Life at the Centre, was published by Macmillan , who paid Jenkins an £130,000 advance. Campbell, Roy Jenkins: A Well-Rounded Life, p. 676. He was magnanimous to most of those colleagues with whom he had clashed in the past, except for David Owen, who he blamed for destroying the idealism and cohesion of the SDP. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 676–677. In the last chapter he reaffirmed his radicalism, placing himself somewhat to the left of James Callaghan, maybe Denis Healey and certainly of David Owen . Jenkins, A Life at the Centre, p. 617. He also proclaimed his political credo:     My broad position remains firmly libertarian, sceptical of official cover-ups and uncompromisingly internationalist, believing sovereignty to be an almost total illusion in the modern world, although both expecting and welcoming the continuance of strong differences in national traditions and behaviour. I distrust the deification of the enterprise culture. I think there are more limitations to the wisdom of the market than were dreamt of in Mrs Thatchers philosophy. I believe that levels of taxation on the prosperous, having been too high for many years , are now too low for the provision of decent public services. And I think the privatisation of near monopolies is about as irrelevant as were the Labour Partys proposals for further nationalisation in the 1970s and early 1980s.     A Life at the Centre was generally favourably reviewed: in the Times Literary Supplement John Grigg said it was a marvellous account of high politics by a participant writing with honesty, irony and sustained narrative verve . In The Spectator Anthony Quinton remarked that Jenkins was not afraid to praise himself and earns the right to do so by unfudged self-criticism . Campbell, Roy Jenkins: A Well-Rounded Life, p. 680. However, there were critical voices: John Smith in The Scotsman charged that Jenkins never had any loyalty to the Labour Party and was an ambitious careerist intent only on furthering his career. John Campbell claims that A Life at the Centre is now generally recognised as one of the best political memoirs. David Cannadine ranked it alongside Duff Cooper s ": null
    },
    {
        "Old Men Forget": "old men forget"
    },
    {
        ", R. A. Butlers The Art of the Possible and Denis Healeys The Time of My Life as one of the four best political memoirs of the post-war period. David Cannadine, Writer and Biographer, in Andrew Adonis and Keith Thomas , Roy Jenkins: A Retrospective , p. 295.     In 1993, he was appointed to the Order of Merit . Also that year, his Portraits and Miniatures was published. The main body of the book is a set of 6 biographical essays , along with lectures, articles and book reviews. Campbell, Roy Jenkins: A Well-Rounded Life, p. 690.   thu   A television documentary about Jenkins was made by Michael Cockerell , titled Roy Jenkins: A Very Social Democrat, and broadcast on 26 May 1996. Although an admiring portrait overall, Cockerell was frank about Jenkins affairs and both Jenkins and his wife believed that Cockerell had betrayed their hospitality. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 684–685.     Jenkins hailed Tony Blair s election as Labour Party leader in July 1994 as the most exciting Labour choice since the election of Hugh Gaitskell . He argued that Blair should stick to a constructive line on Europe, in favour of sensible constitutional innovation...and in favour of friendly relations with the Liberal Democrats . He added that he hoped Blair would not move Labour further to the right: Good work has been done in freeing it from nationalisation and other policies. But the market cannot solve everything and it would be a pity to embrace the stale dogmas of Thatcherism just when their limitations are becoming obvious . Roy Jenkins, Labours most exciting leader since Gaitskell, The Times , p. 14.     Jenkins and Blair had been in touch since the latters time as Shadow Home Secretary, when he admired Jenkins reforming tenure at the Home Office. Campbell, Roy Jenkins: A Well-Rounded Life, p. 700. Jenkins told Paddy Ashdown in October 1995: I think Tony treats me as a sort of father figure in politics. He comes to me a lot for advice, particularly about how to construct a Government . Paddy Ashdown, The Ashdown Diaries: Volume One, 1988–1997 , p. 346. Jenkins tried to persuade Blair that the division in the centre-left vote between the Labour and Liberal parties had enabled the Conservatives to dominate the 20th century, whereas if the two left-wing parties entered into an electoral pact and adopted proportional representation, they could dominate the 21st century. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 700–701. Jenkins was an influence on the thinking of New Labour and both Peter Mandelson and Roger Liddle in their 1996 work The Blair Revolution and Philip Gould in his Unfinished Revolution recognised Jenkins influence. Campbell, Roy Jenkins: A Well-Rounded Life, pp. 703.     Before the 1997 election , Blair had promised an enquiry into electoral reform. In December 1997, Jenkins was appointed chair of a Government-appointed Independent Commission on the Voting System, which became known as the Jenkins Commission , to consider alternative voting system s for the UK. Campbell, Roy Jenkins: A Well-Rounded Life, p. 710. The Jenkins Commission reported in favour of a new uniquely British mixed-member proportional system called Alternative vote top-up or limited AMS in October 1998, although no action was taken on this recommendation. Campbell, Roy Jenkins: A Well-Rounded Life, p. 712, p. 714. Blair told Ashdown that Jenkins recommendations would not pass the Cabinet. Campbell, Roy Jenkins: A Well-Rounded Life, p. 713.     British membership of the European single currency , Jenkins believed, was the supreme test of Blairs statesmanship. Campbell, Roy Jenkins: A Well-Rounded Life, p. 720, p. 725. However, he was disappointed with Blairs timidity in taking on the Eurosceptic tabloid press. He told Blair in October 1997: You have to choose between leading Europe or having Murdoch on your side. You can have one but not both . Paddy Ashdown, The Ashdown Diaries: Volume Two, 1997–1999 , p. 104. Jenkins was also critical of New Labours authoritarianism, such as the watering down of the Freedom of Information Act 2000 and their intention to ban fox hunting . Campbell, Roy Jenkins: A Well-Rounded Life, p. 719. By the end of his life Jenkins believed that Blair had wasted his enormous parliamentary majority and would not be recorded in history as a great Prime Minister; he ranked him between Harold Wilson and Stanley Baldwin. Campbell, Roy Jenkins: A Well-Rounded Life, p. 726.     After Gordon Brown attacked Oxford University for indulging in old school tie prejudices because it rejected a state-educated pupil, Laura Spence , Jenkins told the House of Lords in June 2000 that Browns diatribe was born of prejudice out of ignorance. Nearly every fact he adduced was false . Jenkins voted for the equalisation of the homosexual age of consent and for repealing Section 28 .     Jenkins wrote 19 books, including a biography of Gladstone , which won the 1995 Whitbread Award for Biography, and a much-acclaimed biography of Winston Churchill . His then-designated official biographer, Andrew Adonis , was to have finished the Churchill biography had Jenkins not survived the heart surgery he underwent towards the end of its writing. The popular historian Paul Johnson called it the best one-volume biography on its subject. Johnson, Paul . Churchill, Simon & Schuster, p. 167.     Jenkins underwent heart surgery in the form of an heart valve replacement on 12 October 2000 https://www.telegraph.co.uk/news/uknews/1370415/Lord-Jenkins-has-heart-surgery.html and postponed his 80th birthday celebrations whilst recovering, by having a celebratory party on 7 March 2001. He died on 5 January 2003, after suffering a heart attack at his home at East Hendred , in Oxfordshire. His last words, to his wife, were, Two eggs, please, lightly poached . Campbell, Roy Jenkins: A Well-Rounded Life, p. 745. At the time of his death Jenkins was starting work on a biography of US President Franklin D. Roosevelt . Campbell, Roy Jenkins: A Well-Rounded Life, p. 740.     After his death, Blair paid tribute to one of the most remarkable people ever to grace British politics , who had intellect, vision and an integrity that saw him hold firm to his beliefs of moderate social democracy, liberal reform and the cause of Europe throughout his life. He was a friend and support to me . Michael White and Lucy Ward, The Guardian . James Callaghan and Edward Heath also paid tribute and Tony Benn said that as a founder of the SDP he was probably the grandfather of New Labour . What they said, The Times , p. 4. However, he was strongly criticised by others including Denis Healey , who condemned the SDP split as a disaster for the Labour Party which prolonged their time in opposition and allowed the Tories to have an unbroken run of 18 years in government.     The Professor of Government at Oxford University, Vernon Bogdanor , provided an assessment in The Guardian:     Roy Jenkins was both radical and contemporary; and this made him the most influential exponent of the progressive creed in politics in postwar Britain. Moreover, the political creed for which he stood belongs as much to the future as to the past. For Jenkins was the prime mover in the creation of a form of social democracy which, being internationalist, is peculiarly suited to the age of globalisation and, being liberal, will prove to have more staying power than the statism of Lionel Jospin or the corporatist socialism of Gerhard Schröder . ... Roy Jenkins was the first leading politician to appreciate that a liberalised social democracy must be based on two tenets: what Peter Mandelson called an aspirational society ; and that a post-imperial country like Britain could only be influential in the world as part of a wider grouping . Vernon Bogdanor, The Guardian .     His alma mater, Cardiff University, honoured the memory of Roy Jenkins by naming one of its halls of residence Roy Jenkins Hall.       On 20 January 1945, Jenkins married Mary Jennifer Morris They were married for almost 58 years until his death, although he had several affairs , including one with Jackie Kennedys sister Lee Radziwill .     She was made a DBE for services to ancient and historical buildings. They had two sons, Charles and Edward, and a daughter, Cynthia.     Early in his life Jenkins had a relationship with Anthony Crosland .       1920–1948: Mr Roy H. Jenkins   1948–1964: Mr Roy H. Jenkins MP   1964–1977: The Right Honourable Roy H. Jenkins MP   1977–1982: The Right Honourable Roy H. Jenkins   1982–1987: The Right Honourable Roy H. Jenkins MP   1987: The Right Honourable Roy H. Jenkins   1987–1993: The Right Honourable The Lord Jenkins of Hillhead PC   1993–2003: The Right Honourable The Lord Jenkins of Hillhead ": null
    },
    {
        "OM": "order of merit"
    },
    {
        " PC                  , revised edition 1978    , revised edition 1965   ": null
    }
]