[
    {
        "     :For the former professional American football coach see LeRoy Andrews    Roy Chapman Andrews was an American explorer, adventurer and ": null
    },
    {
        "naturalist": "Natural History"
    },
    {
        " who became the director of the ": null
    },
    {
        "American Museum of Natural History": "American Museum Of Natural History"
    },
    {
        ". He is primarily known for leading a series of expeditions through the politically disturbed China of the early 20th century into the ": null
    },
    {
        "Gobi Desert": "Gobi Desert"
    },
    {
        " and ": null
    },
    {
        "Mongolia": "Mongolia"
    },
    {
        ". The expeditions made important discoveries and brought the first-known ": null
    },
    {
        "fossil": "Fossil"
    },
    {
        " dinosaur": "Dinosaur"
    },
    {
        " eggs": "Dinosaur Egg"
    },
    {
        " to the museum. His popular writings about his adventures made him famous.         Andrews was born on January 26, 1884, in ": null
    },
    {
        "Beloit, Wisconsin": "Beloit, Wisconsin"
    },
    {
        ". As a child, he explored forests, fields, and waters nearby, developing ": null
    },
    {
        "marksmanship": "Marksmanship"
    },
    {
        " skills. He taught himself ": null
    },
    {
        "taxidermy": "Taxidermy"
    },
    {
        " and used funds from this hobby to pay tuition to ": null
    },
    {
        "Beloit College": "Beloit College"
    },
    {
        ". After graduating, Andrews applied for work at the American Museum of Natural History in New York City. He so much wanted to work there that after being told that there were no openings at his level, Andrews accepted a job as a janitor in the taxidermy department and began collecting specimens for the museum. During the next few years, he worked and studied simultaneously, earning a ": null
    },
    {
        "Master of Arts": "Masters Degree"
    },
    {
        " degree": "Academic Degree"
    },
    {
        " in ": null
    },
    {
        "mammalogy": "Mammalogy"
    },
    {
        " from ": null
    },
    {
        "Columbia University": "Columbia University"
    },
    {
        ". Andrews joined ": null
    },
    {
        "The Explorers Club": "The Explorers Club"
    },
    {
        " in New York during 1908, four years after its founding.          From 1909 to 1910, Andrews sailed on the  to the ": null
    },
    {
        "East Indies": "East Indies"
    },
    {
        ", collecting snakes and lizards and observing ": null
    },
    {
        "marine mammal": "Marine Mammal"
    },
    {
        "s.   In 1913, he sailed aboard the schooner ": null
    },
    {
        "Adventuress": "Adventuress"
    },
    {
        " with owner John Borden to the Arctic. They were hoping to obtain a bowhead whale specimen for the American Museum of Natural History. On this expedition, he filmed some of the best footage of seals ever seen, though did not succeed in acquiring a whale specimen.     He married ": null
    },
    {
        "Yvette Borup": "Yvette Borup Andrews"
    },
    {
        " in 1914. From 1916 to 1917, Andrews and his wife led the Asiatic Zoological Expedition of the museum through much of western and southern ": null
    },
    {
        "Yunnan": "Yunnan"
    },
    {
        ", as well as other ": null
    },
    {
        "provinces of China": "Provinces Of China"
    },
    {
        ". The book  Camps and Trails in China  records their experiences.      In 1920, Andrews began planning for expeditions to ": null
    },
    {
        "Mongolia": "Mongolia"
    },
    {
        " and drove a fleet of ": null
    },
    {
        "Dodge": "Dodge"
    },
    {
        " cars westward from ": null
    },
    {
        "Peking": "Peking"
    },
    {
        ". In 1922, the party discovered a fossil of  Indricotherium  , a gigantic hornless ": null
    },
    {
        "rhinoceros": "Rhinoceros"
    },
    {
        ", which was sent back to the museum, arriving on December 19. The fossil species  Andrewsarchus  was named after him.     Andrews, along with ": null
    },
    {
        "Henry Fairfield Osborn": "Henry Fairfield Osborn"
    },
    {
        ", was a proponent of the ": null
    },
    {
        "Out of Asia theory": "Out Of Asia Theory"
    },
    {
        " of humanitys origins and led several expeditions to Asia from 1922 to 1928 known as the Central Asiatic Expeditions to search for the earliest human remains in Asia. The expeditions did not find human remains. However, Andrews and his team made many other finds, including dinosaur bones and fossil ": null
    },
    {
        "mammals": "Mammals"
    },
    {
        " and most notably the first nests full of dinosaur eggs ever discovered . Andrewss main account of these expeditions can be found in his book The New Conquest of Central Asia. Horns, tusks, and flippers: the evolution of hoofed mammals, Donald R. Prothero, Robert M. Schoch p. 119, also see Men and dinosaurs: the search in field and laboratory, Edwin Harris Colbert     In his preface to Andrewss 1926 book, On the Trail of the Ancient Man, ": null
    },
    {
        "Henry Fairfield Osborn": "Henry Fairfield Osborn"
    },
    {
        " predicted that the birthplace of modern humans would be found in Asia and stated that he had predicted this decades earlier, even before the Asiatic expeditions. Chris Beard, Hunt for the Dawn Monkey, p. 307      On July 13, 1923, the party was the first in the world to discover ": null
    },
    {
        "dinosaur": "Dinosaur"
    },
    {
        " eggs": "Egg"
    },
    {
        ". Initially thought to be eggs of a ": null
    },
    {
        "ceratopsian": "Ceratopsian"
    },
    {
        ", Protoceratops, they were determined in 1995 actually to belong to the ": null
    },
    {
        "theropod": "Theropod"
    },
    {
        " Oviraptor. . During that same expedition, ": null
    },
    {
        "Walter W. Granger": "Walter W. Granger"
    },
    {
        " discovered a skull from the ": null
    },
    {
        "Cretaceous": "Cretaceous"
    },
    {
        " period": "Period"
    },
    {
        ". In 1925, the museum sent a letter back informing the party that the skull was that of a mammal, and therefore even more rare and valuable; more were uncovered. Expeditions in the area stopped during 1926 and 1927. In 1928, the expeditions finds were seized by Chinese authorities but were eventually returned. The 1929 expedition was cancelled. In 1930, Andrews made one final trip and discovered some ": null
    },
    {
        "mastodon": "Mastodon"
    },
    {
        " fossils. A cinematographer, ": null
    },
    {
        "James B. Shackelford": "James B. Shackelford"
    },
    {
        ", made filmed records of many of Andrews expeditions. Later that year, Andrews returned to the United States and divorced his wife, with whom he had two sons. He married his second wife, Wilhelmina Christmas, in 1935.     In 1927, the ": null
    },
    {
        "Boy Scouts of America": "Boy Scouts Of America"
    },
    {
        " made Andrews an Honorary Scout, a new category of Scout created that same year. This distinction was given to American citizens whose achievements in outdoor activity, exploration and worthwhile adventure are of such an exceptional character as to capture the imagination of boys... .      Andrews was President of The Explorers Club from 1931 to 1934. In 1934, he became the director of the Natural History museum. In his 1935 book  The Business of Exploring , he wrote I was born to be an explorer...There was never any decision to make. I couldnt do anything else and be happy. In 1942, Andrews retired to ": null
    },
    {
        "Carmel Valley, California": "Carmel Valley, California"
    },
    {
        ", where he wrote about his life.     He died on March 11, 1960, of heart failure at ": null
    },
    {
        "Peninsula Community Hospital": "Peninsula Community Hospital"
    },
    {
        " in ": null
    },
    {
        "Carmel, California": "Carmel, California"
    },
    {
        ".  He is buried in Oakwood Cemetery in his hometown of Beloit.       ": null
    },
    {
        "Douglas Preston": "Douglas Preston"
    },
    {
        " of the ": null
    },
    {
        "American Museum of Natural History": "American Museum Of Natural History"
    },
    {
        " wrote: Andrews is allegedly the person that the movie character of ": null
    },
    {
        "Indiana Jones": "Indiana Jones"
    },
    {
        " was patterned after. However, neither ": null
    },
    {
        "George Lucas": "George Lucas"
    },
    {
        " nor the other creators of the films have confirmed this. Other candidates have been suggested, including ": null
    },
    {
        "Colonel Percy Fawcett": "Colonel Percy Fawcett"
    },
    {
        ". The 120-page transcript of the story conferences for the movie does not mention Andrews.      An analysis by the Smithsonian Channel concludes that the linkage was indirect, with Andrews serving as the model for heroes in adventure films of the 1940s and 1950s, who in turn inspired Lucas and his fellow writers.  ,        Books listed on Worldcat    Monographs of the Pacific Cetacea   Whale Hunting With Gun and Camera   Camps and Trails in China   Across Mongolian Plains   On The Trail of Ancient Man   Ends of the Earth   The New Conquest of Central Asia   This Business of Exploring   Exploring with Andrews   This Amazing Planet   Under a Lucky Star   Meet your Ancestors, A Biography of Primitive Man   An Explorer Comes Home   My Favorite Stories of the Great Outdoors Editor   Quest in the Desert   Heart of Asia: True Tales of the Far East   Natures Way: How Nature Takes Care of Her Own   All About Dinosaurs   All About Whales   Beyond Adventure: The Lives of Three Explorers   Quest of the Snow Leopard   All About Strange Beasts of the Past   In the Days of the Dinosaurs": null
    }
]