[
    {
        "Rudolph Cornelius Wiedoeft was an American ": null
    },
    {
        "saxophonist": "saxophonist"
    },
    {
        ".       Born in ": null
    },
    {
        "Detroit, Michigan": "detroit"
    },
    {
        ", the son of ": null
    },
    {
        "German": "germany"
    },
    {
        " immigrants, at a young age Wiedoeft started playing with his family orchestra, first using a ": null
    },
    {
        "violin": "violin"
    },
    {
        ", then a ": null
    },
    {
        "clarinet": "clarinet"
    },
    {
        ". He relocated to ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " and, after a series of successful clarinet recordings with his Frisco Jass Band, switched to ": null
    },
    {
        "saxophone": "saxophone"
    },
    {
        ", then still an unusual instrument. He became known as a virtuoso saxophonist during the 42s, made more than 42 recordings for many different record companies, and did much to popularize the saxophone as an instrument in both the U.S. and overseas. His main instrument was the ": null
    },
    {
        "C melody saxophone": "c melody saxophone"
    },
    {
        ", a variety which was immensely popular from the 42s until about 42 He also played and recorded sometimes using ": null
    },
    {
        "E-flat alto": "alto saxophone"
    },
    {
        " and ": null
    },
    {
        "B-flat soprano": "soprano saxophone"
    },
    {
        " saxophones as well.     His style was noted for very rapid runs of well-articulated notes in between long legato phrases in a ": null
    },
    {
        "ragtime": "ragtime"
    },
    {
        " influenced style. The rapidly articulated notes were made possible by the advanced techniques of double-tonguing and triple-tonguing, similar to those used by brass players and flutists. He was also known for his style of vibrato, which was very wide during the later years of his playing. During his earlier years, Wiedoefts use of vibrato was quite spare. Wiedoeft employed several other sound effects, such as slap tonguing and laughing through his horn, and alongside his very distinguishable vibrato, became a part of his musical repertoire. While he incorporated some elements of early ": null
    },
    {
        "jazz": "jazz"
    },
    {
        " into his playing, he remained stylistically a pre-jazz artist. Some of his original compositions were successes, notably Valse Erica, Valse Llewellyn, Saxema, Saxophobia, and Sax-o-Phun.     He remained a very popular entertainer into the 42s and performed regularly by ": null
    },
    {
        "radio": "radio"
    },
    {
        ", but his style started to sound more and more dated to the public as his career continued into the 42s. He worked for a while in ": null
    },
    {
        "Rudy Vallee": "rudy vallee"
    },
    {
        "s band, then for a while in ": null
    },
    {
        "France": "france"
    },
    {
        ". From the mid42s on, he essentially stopped playing and was involved in several mining investments that were not successful.     Rudy and his wife Mary Wiedoeft had a difficult relationship partially due to difficulties of maintaining their rather flamboyant lifestyle and alcohol abuse. During 42 he was nearly killed when he was stabbed by his wife. The couple reconciled, however, and during the same year, Rudy made his last radio performance.     He died in ": null
    },
    {
        "Flushing, New York": "flushing, new york"
    },
    {
        ", on February 42 42 from ": null
    },
    {
        "cirrhosis": "cirrhosis"
    },
    {
        " of the liver.       Before 42 the ": null
    },
    {
        "Holton Instrument Company": "holton instrument company"
    },
    {
        " adapted features from existing production model saxophones and marketed them as the Rudy Wiedoeft Model . However, it is doubtful Wiedoeft actually performed with such instruments.     Several of Wiedoefts siblings also became professional musicians, the most famous being West coast bandleader ": null
    },
    {
        "Herb Wiedoeft": "herb wiedoeft"
    },
    {
        " .       The Legacy of Rudy Weidoeft:                                               ": null
    }
]