[
    {
        "The English phrase rule of thumb refers to a principle with broad application that is not intended to be strictly accurate or reliable for every situation. It refers to an easily learned and easily applied procedure or standard, based on practical experience rather than theory. This usage of the phrase can be traced back to the seventeenth century and has been associated with various trades where quantities were measured by comparison to the width or length of a thumb.     A modern ": null
    },
    {
        "folk etymology": "folk etymology"
    },
    {
        " holds that the phrase is derived from the maximum width of a stick allowed for wife-beating under English law, but no such law ever existed. This belief might have originated in a rumored statement by eighteenth-century judge ": null
    },
    {
        "Sir Francis Buller": "sir francis buller"
    },
    {
        " that a man may beat his wife with a stick no wider than his thumb. The rumor produced numerous jokes and satirical cartoons at Bullers expense, but there is no record that he made such a statement. English jurist ": null
    },
    {
        "Sir William Blackstone": "sir william blackstone"
    },
    {
        " wrote in his  Commentaries on the Laws of England  of an old law that once allowed moderate beatings by husbands, but he did not mention thumbs or any specific implements. Wife-beating has been officially outlawed for centuries in England and the United States; several nineteenth-century American court rulings referred to an ancient doctrine which the judges believed had allowed husbands to physically punish their wives using implements no thicker than their thumbs.     The phrase rule of thumb first became associated with domestic abuse in the 42s, after which the spurious legal definition was cited as factual in a number of law journals, and the ": null
    },
    {
        "U.S. Commission on Civil Rights": "u.s. commission on civil rights"
    },
    {
        " published a report on domestic abuse titled Under the Rule of Thumb in 42         In English, rule of thumb refers to an approximate method for doing something, based on practical experience rather than theory. The exact origin of the phrase is uncertain. Its earliest appearance in print comes from a posthumously published collection of sermons by Scottish preacher James Durham: Many profest Christians are like to foolish builders, who build by guess, and by rule of thumb , and not by Square and Rule .     The phrase is also found in Sir William Hopes The Compleat Fencing Master, 42: What he doth, he doth by rule of Thumb, and not by Art . James Kellys The Complete Collection of Scottish Proverbs, 42 includes: No Rule so good as Rule of Thumb, if it hit , meaning a practical approximation.     Historically, the width of the thumb, or thumbs breadth , was used as the equivalent of an ": null
    },
    {
        "inch": "inch"
    },
    {
        " in the cloth trade; similar expressions existed in Latin and French as well. The thumb has also been used in ": null
    },
    {
        "brewing": "brewing"
    },
    {
        " beer, to gauge the heat of the brewing vat. ": null
    },
    {
        "Ebenezer Cobham Brewer": "ebenezer cobham brewer"
    },
    {
        " writes that rule of thumb means a rough measurement . He says that Ladies often measure ": null
    },
    {
        "yard": "yard"
    },
    {
        " lengths by their thumb. Indeed, the expression sixteen nails make a yard seems to point to the thumb-nail as a standard and that Countrymen always measure by their thumb . According to Phrasefinder, The phrase joins ": null
    },
    {
        "the whole nine yards": "the whole nine yards"
    },
    {
        " as one that probably derives from some form of measurement but which is unlikely ever to be definitively pinned down .                A modern ": null
    },
    {
        "folk etymology": "folk etymology"
    },
    {
        " relates the phrase to domestic violence via an alleged rule under English law which permitted wife-beating provided that the implement used was a rod or stick no thicker than a mans thumb. Wife-beating has been officially outlawed in England and the United States for centuries, enforcement of the law was inconsistent, and wife beating did continue. However, a rule of thumb permitting wife beating was never codified in law.     English jurist ": null
    },
    {
        "William Blackstone": "william blackstone"
    },
    {
        " wrote in the late 42s in his  Commentaries on the Laws of England  that, by an old law , a husband had formerly been justified in using moderate correction against his wife but was barred from inflicting serious violence. According to Blackstone, this custom was in doubt by the late 42s, and a woman was allowed security of the peace against an abusive husband, but Blackstone did not mention either thumbs or sticks. Twentieth-century legal scholar ": null
    },
    {
        "William L. Prosser": "william l. prosser"
    },
    {
        " wrote that there was probably no truth to the legend that a husband was allowed to beat his wife with a stick no thicker than his thumb .     The association between the thumb and implements of domestic violence can be traced to 42 when English judge ": null
    },
    {
        "Sir Francis Buller": "sir francis buller"
    },
    {
        " was ridiculed for purportedly stating that a husband could beat his wife, provided that he used a stick no wider than his thumb. There is no record of Buller making such a statement, but the rumor generated much satirical press, with Buller being mocked as Judge Thumb in published jokes and cartoons.     In the following century, several court rulings in the United States referred to a supposed common-law doctrine which the judges believed had once allowed wife-beating with an implement smaller than a thumb. None of these courts referred to such a doctrine as a rule of thumb or endorsed such a rule, but all permitted some degree of wife-beating so long as it did not result in serious injury.       An 42 court ruling in ": null
    },
    {
        "Mississippi": "mississippi"
    },
    {
        " stated that a man was entitled to enforce domestic discipline by striking his wife with a whip or stick no wider than the judges thumb. In a later case in ": null
    },
    {
        "North Carolina": "north carolina"
    },
    {
        " , the defendant was found to have struck his wife with a switch about the size of this fingers ; the judge found the man not guilty due to the switch being smaller than a thumb. The judgement was upheld by the state supreme court, although the later judge stated:          In 42 also in North Carolina, the judge in State v. Oliver ruled, We assume that the old doctrine that a husband had the right to whip his wife, provided that he used a switch no larger than his thumb, is not the law in North Carolina . These latter two cases were cited by the legal scholar ": null
    },
    {
        "Beirne Stedman": "beirne stedman"
    },
    {
        " when he wrote in a 42 law review article that an old common law rule had permitted a husband to use moderate personal chastisement on his wife so long as he used a switch no larger than his thumb .     By the late 42th century, most American states had outlawed wife beating; some had severe penalties such as ": null
    },
    {
        "forty lashes": "forty lashes"
    },
    {
        " or imprisonment for offenders. There was a common belief in parts of the United States that a man was permitted to beat his wife with a stick no wider than his thumb; however, this belief was not connected with the phrase rule of thumb until the 42s.       In the 42th century, public concern with the problem of domestic violence declined at first, and then re-emerged in the 42s along with the resurgent ": null
    },
    {
        "feminist movement": "feminist movement"
    },
    {
        ". The first recorded link between wife beating and the phrase rule of thumb appeared in 42 in a report on domestic violence by womens-rights advocate ": null
    },
    {
        "Del Martin": "del martin"
    },
    {
        ":      While Martin appears to have meant the phrase rule of thumb only as a figure of speech, some feminist writers treated it as a literal reference to an earlier law. The following year, a book on battered women stated:      Despite this erroneous reading of the common law the spurious legal doctrine of the rule of thumb was soon mentioned in a number of law journals. The myth was repeated in a 42 report by the ": null
    },
    {
        "United States Commission on Civil Rights": "united states commission on civil rights"
    },
    {
        " on domestic abuse titled Under the Rule of Thumb , as well as a later United States Senate report on the ": null
    },
    {
        "Violence Against Women Act": "violence against women act"
    },
    {
        ".     In the late 42th century, some efforts were made to discourage the phrase rule of thumb, which was seen as ": null
    },
    {
        "taboo": "taboo"
    },
    {
        " owing to this false origin. ": null
    },
    {
        "Patricia T. OConner": "patricia t. oconner"
    },
    {
        ", former editor of the New York Times Book Review, described it as one of the most persistent myths of political correctness . During the 42s, several authors, including the conservative social critic ": null
    },
    {
        "Christina Hoff Sommers": "christina hoff sommers"
    },
    {
        ", wrote about the false etymology of rule of thumb. Sommers analyzed the history of the phrase and its origin in a misunderstanding of Blackstones commentary. Nonetheless, the myth persisted in some legal sources into the early 42s.": null
    }
]