[
    {
        "     Rupert Giles is a ": null
    },
    {
        "fictional character": "fictional character"
    },
    {
        " created by ": null
    },
    {
        "Joss Whedon": "joss whedon"
    },
    {
        " for the ": null
    },
    {
        "television series": "television series"
    },
    {
        "  Buffy the Vampire Slayer . The character is portrayed by ": null
    },
    {
        "Anthony Stewart Head": "anthony head"
    },
    {
        ". He serves as ": null
    },
    {
        "Buffy Summers": "buffy summers"
    },
    {
        " mentor and surrogate ": null
    },
    {
        "father figure": "father figure"
    },
    {
        ". The character proved popular with viewers, and Heads performance in the role was well received. Following Buffys run, Whedon intended to launch a television spin-off focused on the character, but ": null
    },
    {
        "rights": "intellectual property"
    },
    {
        " issues prevented the project from developing. Outside of the television series, the character has appeared substantially in ": null
    },
    {
        "Expanded Universe": "expanded universe"
    },
    {
        " material such as novels, comic books, and short stories.     Giles primary role in the series is ": null
    },
    {
        "Watcher": "watcher"
    },
    {
        " to Buffy  in her capacity as ": null
    },
    {
        "vampire Slayer": "slayer"
    },
    {
        "; he is in the employ of the Watchers Council, a British organization that attempts to oversee the actions of the Slayer. From youth, Giles was expected to follow the family tradition and become a Watcher, though as a teenager and young adult he rebelled, dropping out of ": null
    },
    {
        "Oxford University": "university of oxford"
    },
    {
        " to experiment in ": null
    },
    {
        "dark magic": "black magic"
    },
    {
        " and the ": null
    },
    {
        "rock music": "rock music"
    },
    {
        " scene, until a bereavement brought him to his senses. In adulthood, his loyalty to Buffy and ": null
    },
    {
        "her group of friends": "scooby gang"
    },
    {
        " costs him his job for a time. As the series progresses, Giles increasingly becomes a father figure to Buffy and her friends ": null
    },
    {
        "Willow": "willow rosenberg"
    },
    {
        "  and ": null
    },
    {
        "Xander": "xander harris"
    },
    {
        " . His encyclopedic knowledge, affinity for magic, moderate fighting skills and willingness to kill make him an asset to Buffy in her fight against the supernatural evils that plague ": null
    },
    {
        "Sunnydale, California": "sunnydale"
    },
    {
        ".     Following Buffys conclusion in 42 Whedon intended to continue Giles story as a spin-off series, ": null
    },
    {
        "Ripper": "undeveloped buffy the vampire slayer spinoffs"
    },
    {
        ", which he intended to produce with the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        ". The series was to depict Giles in ": null
    },
    {
        "ghost stories": "ghost story"
    },
    {
        " set in present-day England, coping with loneliness as well as figurative ghosts from his own chequered past. Over several years Whedon restated his commitment to the project, though announced it would take the form of a one-off TV movie. Despite Heads availability and the BBCs willingness to fund the project, rights issues concerning the character ultimately led to it not developing further. ": null
    },
    {
        "Canonically": "canon"
    },
    {
        ", the characters story is continued in the comic book  Buffy the Vampire Slayer Season Eight  and subsequent stories. The Season Eight sequel  Angel & Faith  heavily features Giles and utilizes ideas and characters from the proposed Ripper spin-off.         Rupert Edmund Giles  was born circa 42 in England. His family has worked within the ": null
    },
    {
        "Council of Watchers": "watchers council"
    },
    {
        " for at least three generations; both his father and grandmother, Edna Giles , were also ": null
    },
    {
        "Watchers": "watcher"
    },
    {
        ". As a child, Giles dreamed of being either a fighter pilot or possibly a grocer , but he soon learned that being a Watcher is a ": null
    },
    {
        "calling": "wiktionary:vocation"
    },
    {
        ", much as being a ": null
    },
    {
        "Slayer": "slayer"
    },
    {
        " is, and Ruperts father explained his destiny to him when he was ten years old .     Although the ": null
    },
    {
        "Scooby Gang": "scooby gang"
    },
    {
        " later joked that he wore tweed diapers as a child, Giles was in fact a rebellious youth, rejecting his responsibility as a Watcher and dropping out of ": null
    },
    {
        "Oxford University": "oxford university"
    },
    {
        ", where he was studying history, when he was twenty-one. During this time, Giles claimed to be a founding member of ": null
    },
    {
        "Pink Floyd": "pink floyd"
    },
    {
        " in order to impress girls , and may have delved into criminal activity . He is a talented singer and guitar player which the gang discovered, to their astonishment, when they saw him singing ": null
    },
    {
        "Behind Blue Eyes": "behind blue eyes"
    },
    {
        " by The Who in ": null
    },
    {
        "Where the Wild Things Are": "where the wild things are"
    },
    {
        " . Spike also saw him singing ": null
    },
    {
        "Free Bird": "free bird"
    },
    {
        " by Lynyrd Skynyrd in ": null
    },
    {
        "The Yoko Factor": "the yoko factor"
    },
    {
        " .     He began to explore dark magic and befriended a group of young people who delved into the dark arts for fun or money: ": null
    },
    {
        "Ethan Rayne": "ethan rayne"
    },
    {
        ", Philip Henry, Dierdre Page, Thomas Sutcliff, and Randall. Giles gained the nickname Ripper during this time. Together, the group summoned a demon called Eyghon, who would possess and eventually destroy Randall.   Following Randalls death, Ethan and the others failed to exorcise Eyghon, and Giles accepted his destiny of becoming a Watcher. Before becoming a fully-fledged Watcher, he also worked as the curator of a British museum, maybe the ": null
    },
    {
        "British Museum": "british museum"
    },
    {
        " as Willow says , although, given the context, she may well have been repeating a rumor that was going around the school.       At the behest of the ": null
    },
    {
        "Watchers Council": "watchers council"
    },
    {
        ", Giles travels to ": null
    },
    {
        "Sunnydale": "sunnydale"
    },
    {
        ", ": null
    },
    {
        "California": "california"
    },
    {
        ", and works as the ": null
    },
    {
        "librarian": "librarian"
    },
    {
        " at the local high school. There he meets the current ": null
    },
    {
        "Slayer": "slayer"
    },
    {
        ", ": null
    },
    {
        "Buffy Summers": "buffy summers"
    },
    {
        ", whom he begins training. The library, a sort of command center for Buffys demon-hunting gang, sits right above the ": null
    },
    {
        "Hellmouth": "hellmouth"
    },
    {
        ".     As the ": null
    },
    {
        "Watcher": "watcher"
    },
    {
        ", librarian, and general authority figure, Giles often delivers exposition. He is a father figure to Buffy and her friends ": null
    },
    {
        "Xander Harris": "xander harris"
    },
    {
        " and ": null
    },
    {
        "Willow Rosenberg": "willow rosenberg"
    },
    {
        ", together forming the core four of the Scooby Gang. Giles is often portrayed as something of a straight man and his stuffy ": null
    },
    {
        "Oxford": "oxford university"
    },
    {
        " sensibility serves as counterpoint to the stereotypical Southern Californian characters and setting. He makes a weird cluck-cluck sound with his tongue when he is angry but is too English to say anything . He admits to being ": null
    },
    {
        "technophobic": "technophobic"
    },
    {
        ", a fact which often brings him into conflict with technopagan and computer science teacher, ": null
    },
    {
        "Jenny Calendar": "jenny calendar"
    },
    {
        ". However, after Jenny aids him in casting the demon Moloch out of the Internet, the pair reach an understanding and begin a romantic relationship. Despite his apparent fear with modern technology, Giles is quite adept with computers, which is required in his occupation as a librarian .     In Season Two, Giles dark side is revealed and his relationship with Jenny deepens. In ": null
    },
    {
        "The Dark Age": "the dark age"
    },
    {
        " , Ethan Rayne comes to Sunnydale to flee the demon Eyghon. Giles ashamedly admits to Buffy that he was responsible for summoning the demon in his youth, and is horrified when Jenny becomes possessed by Eyghon. Although Eyghon is defeated, Jenny takes time to cope with her ordeal, remaining distant from Giles in the meantime. When new Slayer ": null
    },
    {
        "Kendra Young": "kendra"
    },
    {
        " arrives in Sunnydale, Giles shares with her an appreciation for obscure texts, resulting in Buffy nicknaming her the She-Giles. Giles feels betrayed when Jenny reveals she is actually a member of the Kalderash gypsy clan, sent to keep an eye on Buffys relationship with the vampire ": null
    },
    {
        "Angel": "angel"
    },
    {
        ". When Angel loses his soul and murders Jenny, leaving her corpse for Giles to find in his apartment , Giles seeks revenge by burning down Angelus base. Angelus later kidnaps and tortures him, and ": null
    },
    {
        "Drusilla": "drusilla"
    },
    {
        " hypnotizes him into thinking she is Jenny so he will reveal how to awake ": null
    },
    {
        "Acathla": "acathla"
    },
    {
        ". Buffy is forced to kill Angel to save the world, despite Willows restoring his soul, and subsequently leaves Sunnydale.     In Season Three, Giless paternal feelings for Buffy strengthen significantly. He spends the summer desperately following up every clue as to Buffys whereabouts, and is overjoyed when she finally returns months later. Giles briefly serves as Watcher for Kendras replacement Slayer, ": null
    },
    {
        "Faith Lehane": "faith lehane"
    },
    {
        ". The Scoobies are given another disturbing glimpse in Giles past when, along with every other adult in Sunnydale, he reverts to being a teenager by enchanted band candy supplied by Ethan Rayne. He indulges in theft and vandalism, and makes out with and has sex with Buffys mother, ": null
    },
    {
        "Joyce Summers": "joyce summers"
    },
    {
        ". When Buffy keeps Angels return from hell a secret from the other Scoobies, Giles feels betrayed by her love for the man who tortured him and murdered Jenny, but later agrees to help Angel in ": null
    },
    {
        "Amends": "amends"
    },
    {
        " .     As Buffys Cruciamentum approaches , Giles struggles to cope with the guilt of betraying Buffys trust. Despite describing the test as an archaic exercise in cruelty , he secretly injects Buffy with muscle relaxants and adrenaline suppressors, which weaken her significantly, before finally coming clean when the vampire she is meant to fight escapes. Buffy is disgusted, but is later moved when Giles interferes to save her life and is subsequently dismissed for having a fathers love for her. Giles is fired, and replaced with ": null
    },
    {
        "Wesley Wyndam-Pryce": "wesley wyndam-pryce"
    },
    {
        ", but continues to act as Buffys unofficial Watcher, proving especially helpful when Wesley turns out to be an incompetent coward. When Buffy briefly finds herself endowed with telepathic powers, she hears her mother remembering that Giles was like a ": null
    },
    {
        "stevedore": "stevedore"
    },
    {
        " during sex. In a battle with the demonic ": null
    },
    {
        "Mayor": "mayor richard wilkins iii"
    },
    {
        " of Sunnydale, Giles presses the trigger which destroys the Mayor and ": null
    },
    {
        "Sunnydale High": "sunnydale high"
    },
    {
        ", putting himself out of a job.     In Season Four, Giles must cope with unemployment and a growing awareness that Buffy no longer needs him. He continues a sexual relationship with his old friend Olivia. Lacking a sense of purpose, he spends most of his time lounging around his apartment, watching  Passions  with ": null
    },
    {
        "Spike": "spike"
    },
    {
        ". He gets depressed, especially when the Scoobies fail to keep him in the loop regarding Buffys new boyfriend ": null
    },
    {
        "Riley Finn": "riley finn"
    },
    {
        " and his membership in the ": null
    },
    {
        "Initiative": "the initiative"
    },
    {
        ". In the episode ": null
    },
    {
        "Something Blue": "something blue"
    },
    {
        " , Giles becomes blind as a result of a faulty spell cast by ": null
    },
    {
        "Willow Rosenberg": "willow rosenberg"
    },
    {
        ". When Ethan Rayne casts a spell on Giles which turns him into a Fyarl demon , he must enlist ": null
    },
    {
        "Spikes": "spike"
    },
    {
        " help to escape the Initiative and Buffy, which believes him to be a demon who murdered Giles. Buffy, about to kill him, at the last moment recognizes his eyes and annoyed expression, and Ethan is taken into custody by the Initiative. In order to defeat the cyber-demonoid ": null
    },
    {
        "Adam": "adam"
    },
    {
        ", Buffy, Willow, Xander and Giles cast a spell to combine their strength. Giles provides the mind, and Buffy is able to defeat Adam.     At the beginning of Season Five, Giles no longer sees his place in Sunnydale and decides to go back to England, telling no one except Willow, whom he needs to organize the research documents for the Scoobies. He quickly abandons this decision when Buffy asks him to be her Watcher again, confessing that she needs him, both emotionally and in order to discover more about what being a Slayer means.     When the owner of ": null
    },
    {
        "The Magic Box": "the magic box"
    },
    {
        " is killed by vampires, Giles is convinced by the shops high profit margins to buy it, hiring Anya as his overly enthusiastic assistant. Buffy learns that her sister, ": null
    },
    {
        "Dawn Summers": "dawn summers"
    },
    {
        ", is actually the Key: mystical energy disguised in human form to conceal it from the hell-god ": null
    },
    {
        "Glory": "glorificus"
    },
    {
        ". Buffy initially confides only in Giles about Dawns true nature, and he decides to contact the ": null
    },
    {
        "Watchers Council": "watchers council"
    },
    {
        " for more information about Glory. In ": null
    },
    {
        "Checkpoint": "checkpoint"
    },
    {
        " , Quentin Travers tries to coerce Buffy to obey the Councils demands, by threatening to have Giles deported. Buffy stands up to the Council, pointing out that without her theres no need for a Council, and tells them to give her all information concerning Glory and to reinstate Giles as her official Watcher. Travers reluctantly agrees, and leaves.     As the Scoobies labor to find a way to defeat Glory, Giles brings up the difficult idea of killing Dawn to end Glorys plans to take over the world. Buffy vows to protect Dawn at all costs. Glory shares her body with an innocent human named ": null
    },
    {
        "Ben": "ben"
    },
    {
        ", and can be killed if Ben dies. In the final battle against Glory, Buffy abandons the fight when Glory turns back into a wounded Ben, so that she can save Dawn. Giles is less merciful. Explaining that Buffy is a hero and therefore different from the rest of humanity, he suffocates Ben with his bare hands .     Season Six sees Giles reluctantly stepping back to allow Buffy to gain independence. One hundred and forty-seven days after her death, Giles decides to return to England. On the very day he leaves, Willow, Xander, Anya and ": null
    },
    {
        "Tara": "tara maclay"
    },
    {
        " resurrect Buffy, and he comes back as soon as he hears of this. Despite being overjoyed to have Buffy back, he is furious at Willow for invoking such dark magic, and angrily dismisses her as a rank, arrogant amateur. While the other Scoobies believe Buffy was in Hell, Giles is not convinced, and his suspicions prove true when ": null
    },
    {
        "a demons musical spell": "once more, with feeling"
    },
    {
        " causes Buffy to reveal to them all that she was indeed in Heaven. As Buffy begins to rely excessively on Giles for financial and emotional support, he decides his presence is preventing her assuming responsibility for her life. He leaves again for his native England, moving to a place near ": null
    },
    {
        "Bath": "bath, somerset"
    },
    {
        ", where he works with a powerful local ": null
    },
    {
        "coven": "coven"
    },
    {
        ".     A few months later, Tara is killed by a stray bullet as ": null
    },
    {
        "Warren Mears": "warren mears"
    },
    {
        " attacks Buffy. Willow, still recovering from an addiction to magic, suffers a relapse, kills Warren and attempts to kill his former partners in crime, before resolving to end humanitys pain by destroying the world. Hearing of a dark power rising in Sunnydale, Giles teleports back there, wielding great magical power borrowed from the Devon Coven. As Dark Willow boasts of her indestructibility, Giles knocks her to the floor with a blast of magic energy, saying Id like to test that theory . After being filled in on everything that has happened to the Scoobies in his absence, Giles apologizes to Buffy, insisting that he never should have left them, but Buffy assures him that he did the right thing. Knowing that Willow is too strong to defeat, he tricks her into draining him of his white magics, which brings him near death. It also allows Xander to reason with Willow as the good magic brings out her natural love and compassion, eating away at the evil within her.      Giles returns to England with Willow for her rehabilitation. A few months later, he brings ": null
    },
    {
        "Potential Slayers": "potential and new slayers"
    },
    {
        " to ": null
    },
    {
        "Sunnydale": "sunnydale"
    },
    {
        " to protect them from the ": null
    },
    {
        "First Evil": "first evil"
    },
    {
        " and its ": null
    },
    {
        "Bringers": "bringers of the first evil"
    },
    {
        ". Giles had removed a few volumes from the headquarters of the ": null
    },
    {
        "Watchers Council": "watchers council"
    },
    {
        ", which is soon afterward destroyed by ": null
    },
    {
        "Caleb": "caleb"
    },
    {
        ", an agent of the First. An injured Watcher named Robson witnessed Giles about to be decapitated by a Bringer before blacking out. When the Scoobies hear about this, they worry that Giles may have been killed and the First is merely impersonating him. They are relieved when Anya, Dawn, Xander and Andrew tackle him to the ground, proving he is corporeal and therefore not the First. Giles later loses Buffys trust somewhat when he takes part in a scheme with ": null
    },
    {
        "Robin Wood": "robin wood"
    },
    {
        " to kill ": null
    },
    {
        "Spike": "spike"
    },
    {
        " . Buffy tells him, I think youve taught me everything I need to know. Giles believes that Buffy kept Spike around for personal reasons rather than tactical ones; this is confirmed when she talks to Spike the night before the final battle under the Hellmouth. In the series finale, Giles participates in the battle of the Hellmouth, and survives.     Shortly after Buffy ended its seven-year televised run, there was talk of a Giles-based spin-off series for the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " entitled  Ripper . At Comicon in 42 Joss Whedon confirmed that Ripper was still planned and in the pipeline.     In season five of Angel, Angel contacts Giles via phone twice. It is established that, after the events of ": null
    },
    {
        "Chosen": "chosen"
    },
    {
        " , Giles travels to ": null
    },
    {
        "Europe": "europe"
    },
    {
        " with Buffy to train new Slayers. He also takes ": null
    },
    {
        "Andrew Wells": "andrew wells"
    },
    {
        " under his wing, training him to be a Watcher. In ": null
    },
    {
        "Damage": "damage"
    },
    {
        " , Andrew claims to be ": null
    },
    {
        "faster, stronger": "the six million dollar man"
    },
    {
        " and 42% more manly as a result of Giles mentoring. Later in ": null
    },
    {
        "A Hole in the World": "a hole in the world"
    },
    {
        " , after ": null
    },
    {
        "Fred": "winifred burkle"
    },
    {
        " dies, Angel phones Giles, desperate to get in contact with Willow, who cannot be located. After Angel confirms that he still works for Wolfram & Hart, Giles coldly hangs up on him. Originally, Giles was to appear in ": null
    },
    {
        "A Hole in the World": "a hole in the world"
    },
    {
        " as the one whom Angel and Spike approached in an attempt to save Fred, because Whedon needed a character who would be instantly believed when he said there was no way to save Fred. As it was too expensive for Anthony Stewart Head to fly out to Los Angeles to guest-star, Whedon created Drogyn the Battlebrand, who was mystically compelled to tell the truth.       As a main character from the beginning of the series, Giles has appeared in most of the spin-off books published based on the series. He plays a particularly key role in The Lost Slayer quadrilogy, where a chain of events lead to Buffy being projected into the body of her twenty-four-year-old self in a timeline where Giles was turned into a vampire by the followers of an Aztec bat god, forcing Buffy to face a foe who knows her every technique before she manages to find a way to return to the past and prevent Giles being captured and turned.     In the canonical comic book continuation of the series,  Buffy the Vampire Slayer Season Eight , the Scooby Gang has expanded into a global organization, training approximately five hundred Slayers spread over ten squads. Giles is head of the Slayer operations in England, parallel with Andrews operations in ": null
    },
    {
        "Italy": "italy"
    },
    {
        " and Buffy and Xanders in ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ", and he keeps in close contact with Xander and Andrew, discussing issues. In the Season Eight arc, ": null
    },
    {
        "No Future For You": "no future for you"
    },
    {
        " , he comes to ": null
    },
    {
        "Faith": "faith lehane"
    },
    {
        " to request her assistance assassinating another Slayer, who will bring about the Apocalypse if left unchecked. After they are both forced to make the difficult decisions to kill the rogue Slayer Gigi and her mentor Roden, they decide to work together in the future as equal partners, keeping Slayers from turning down the dark path that both Faith and Gigi walked. As a result of their covert operation, Buffy and Giles are no longer on speaking terms.     In the story ": null
    },
    {
        "Safe": "predators and prey"
    },
    {
        ", Giles and Faith hear of a Slayer Sanctuary in a town called Hanselstadt from a young Slayer named Courtney. There, Giles encounters Duncan Fillworthe, a former Watcher, who claims vampires do not dare to enter the town because they know the town contains an army of Slayers. Later, as Giles argues that a stalemate is not a solution to the vampire problem, Duncan reveals that in fact the town is feeding the Slayers who come seeking sanctuary to an ancient demon. The fear of the demon is what really keeps the vampires from entering. Giles goes to warn Faith as Duncan states this is the fate that Slayers deserve for rejecting the Watchers Council, especially Buffy, reminding Giles that Buffys relationship with Angel resulted in Jenny Calendars death. Giles finds Faith already in combat with the demon, which feeds on beings who feel regret and fear. While trying to free Courtney from the demon, Duncan intercepts Giles. During their skirmish, the demon devours Duncan and Giles saves Courtney while Faith kills the demon. The stalemate ended, Giles and Faith rally the reluctant townspeople against the coming vampires, telling them if they want to live, theyll have to fight. Buffy the Vampire Slayer Season 42 - 42 Safe After ": null
    },
    {
        "Harmony Kendall": "harmony kendall"
    },
    {
        "s ": null
    },
    {
        "reality show": "reality show"
    },
    {
        " establishes a new pro-vampire, anti-Slayer world order, Faith and Giles are in hiding in the ": null
    },
    {
        "Führerbunker": "führerbunker"
    },
    {
        " in the ": null
    },
    {
        "Retreat": "retreat"
    },
    {
        " storyline. Once their underground hideout is compromised by demons, they retreat to Scotland to reunite with Buffy. Giles and Buffy are driven to reconcile by ": null
    },
    {
        "Twilight": "twilight"
    },
    {
        "s attacks. The entire group are later transported to Oz in Tibet to learn how to suppress magic to stop Twilight tracking them.     In the penultimate issue of Season Eight, Angel is possessed by a powerful mystical entity known as Twilight, and while under its influence, murders Giles, after Giles deliberately put himself in harms way to provoke Buffy to action. Angel does so by snapping Giles neck, homaging Angelus murder of Jenny Calendar.  confirms that the resemblance between the two deaths was intentional. While Angelus killed Jenny in vampiric face—a result of Joss not wanting the audience to truly hate Angels face—Giles is murdered while Angels face is in human form. Afterwards, it is revealed that Giles has left to Faith his entire estate in his will , and Faith assures Buffy this doesnt mean Giles cared about her less but rather felt Faith needed it more.     In a 42 interview, Whedon stated that his decision to ": null
    },
    {
        "kill off": "kill off"
    },
    {
        " Giles could not be discussed in detail because ripples from that event will also be a large part of both Buffy Season Nine and Angel and Faith. However, he was able to explain other motivations; he felt that from a writing perspective, Giles did not work in the comic book medium where he had flourished on the television show. His primary roles - provider of ": null
    },
    {
        "narrative exposition": "exposition"
    },
    {
        ", and paternal figure - didnt work well in the comic book format. Whedon killed off Giles where he did so that it might have a greater effect on the coming season, because wanted to make all this matter .      In the follow-up comic series ": null
    },
    {
        "Angel & Faith": "angel  &  faith"
    },
    {
        ", Angel makes it his personal mission to bring Giles back to life. Over the course of several arcs Giles life before Sunnydale is shown in flashbacks as Angel and Faith gather pieces of Giles soul from demons or magical objects that were significant in Giles life. These parts of his soul are absorbed into Angels body using the mystical Tooth of Ammuk. They are joined by Ruperts great-aunts Lavinia and Sophronia Fairweather, two depowered witches who used magic to remain young, and an old friend of Giles named Alasdair Coames who is a depowered magical archmage and collector of magical artifacts. In the Death and Consequences arc Angel and Faith discover Giles is not buried in his grave. It has been possessed by the demon Eyghon who had survived ": null
    },
    {
        "The Dark Age ": "the dark age"
    },
    {
        ". Because Giles had sold his soul to Eyghon in his youth, he did not move on even though he died a natural death, and the core of his soul went to Eyghon, while smaller parts broke off and attached themselves to the things Angel & Faith had found. Thus, it is possible for Giles to be resurrected from a natural death in a world with no current source of magic. Angel recruits Spike to help him kill Eyghon and a group of British Slayers reluctantly agree to work with them to save their friends who are still alive from Eyghons control. The presence of three beings inside Angels body prevent Eyghon from controlling Angel, and Giles speaks through him as Angel kills Eyghon and therefore has all of Giles soul. It is later transferred out of Angel to a mystical vessel. Using a mystical item to restore Giles corpse to full health and Coames collection of artifacts to provide magic for a resurrection spell, Angel, Faith, Coames and the Fairweathers try to bring him back to life. The group is shocked when Giles comes back to life with all his memories intact, but in the body of a 42-year-old boy due to his Aunts thinking of him as a child during the ritual. Giles is grateful to be free of Eyghon but furious at the age of his body and they have been trying to bring him back and not stopping a plot by villains ": null
    },
    {
        "Whistler ": "whistler"
    },
    {
        ", Pearl and Nash to mutate humans into a magical species at the cost of a few billion lives. Before confronting them, Giles says to Faith she has grown into a fine woman and they may have wanted him back, but none of the group needs him like they used to. The villains plan to unleash their plague by releasing an orb of pure magic into the upper atmosphere. Giles is able to use ambient magic to attack Nash with a fireball causing him to drop the orb but it also mutates a nearby crowd. Nash is killed causing Pearl to flee. Whistler sees the error of his ways and sacrifices his life to destroy the orb. In the aftermath of the battle, Giles wants Faith to keep his money. He decides to return to America because he was at his best with Buffy, not noticing he has hurt Faiths feelings. He parts on good terms with Angel who is staying in Londons new Magic Town suburb.     While resenting the challenges of his youthful body compared to his adult mind, Giles adapts to his new situation, particularly with the discovery that his command of magic is more potent in his youthful body; his aunts speculate that he is tapping into the full potential that he repressed to focus on his studies as a Watcher.       Giles has extensive knowledge of ": null
    },
    {
        "demonology": "demonology"
    },
    {
        " and ": null
    },
    {
        "Slayer": "slayer"
    },
    {
        " combat , mainly due to his training as a ": null
    },
    {
        "Watcher": "watcher"
    },
    {
        ". His youthful interest in ": null
    },
    {
        "witchcraft": "witchcraft"
    },
    {
        " and ": null
    },
    {
        "sorcery": "magic"
    },
    {
        " has endured into his adult life; though his natural aptitude for it is only moderate , he does have a high amount of magical knowledge. Giles is proficient in several languages, including ": null
    },
    {
        "Latin": "latin language"
    },
    {
        ", ancient ": null
    },
    {
        "Greek": "greek"
    },
    {
        ", ": null
    },
    {
        "Sumerian": "sumerian language"
    },
    {
        " , ": null
    },
    {
        "Japanese": "japanese language"
    },
    {
        " , and possibly ": null
    },
    {
        "Gaelic": "goidelic languages"
    },
    {
        " , but weak in German , ": null
    },
    {
        "Mandarin": "standard chinese"
    },
    {
        " and ": null
    },
    {
        "Cantonese": "cantonese"
    },
    {
        " . While he has no prominent ": null
    },
    {
        "supernatural": "supernatural"
    },
    {
        " powers of his own, his extensive experience with dealing with vampires, demons, and other creatures makes him capable of handling them effectively.     Giles has moderate skill in ": null
    },
    {
        "hand-to-hand combat": "hand to hand combat"
    },
    {
        ", as well as various melee weapons. While his demeanor is typically mild and polite, Giles is not above using raw violence to solve a problem, such as physically threatening ": null
    },
    {
        "Principal Snyder": "principal snyder"
    },
    {
        " into readmitting Buffy to school after her expulsion , pummeling ": null
    },
    {
        "Angelus": "angel"
    },
    {
        " senseless with a flaming ": null
    },
    {
        "baseball bat": "baseball bat"
    },
    {
        " and ": null
    },
    {
        "burning down": "arson"
    },
    {
        " his hideout upon discovering that he had killed ": null
    },
    {
        "Jenny Calendar": "jenny calendar"
    },
    {
        " , manhandling ": null
    },
    {
        "Spike": "spike"
    },
    {
        " while ordering him to get over his feelings for Buffy , forcing Glorys minion Slook to talk by inflicting a painful-sounding injury offscreen , severely beating up ": null
    },
    {
        "Ethan Rayne": "ethan rayne"
    },
    {
        " for information , and suffocating a critically injured Ben with his bare hands to keep ": null
    },
    {
        "Glory": "glorificus"
    },
    {
        " from awakening in his body. . Typically, however, Giles calm demeanor and professionalism offer him a detached state of authority even in the face of fearsome monsters, as demonstrated during his confrontation with a violent demon in ": null
    },
    {
        "The Long Way Home": "the long way home"
    },
    {
        " . He is also shown to be able to quickly hotwire a car in the episode ": null
    },
    {
        "Dead Mans Party": "dead mans party"
    },
    {
        " .     In the ": null
    },
    {
        "season six finale": "grave"
    },
    {
        ", Giles was temporarily endowed with powers of the Devon Coven in an attempt to stop Willow. During this time, he demonstrated powers such as teleportation, ": null
    },
    {
        "telekinesis": "psychokinesis"
    },
    {
        ", and energy projection. He lost all of these powers when Willow drained him and left him on the brink of death, but he recovered immediately after Xander calmed her down from her rampage. His moderate proficiency in magic combined with his natural acumen and intelligence still make him quite formidable; in Season Eights No Future for You , he kills the warlock Roden, who could fly and conjure easily, through using a spell inventively. After being resurrected in the form of an adolescent, Giles displays much more magical aptitude, which is briefly lost when Willow temporarily ages him back into an adult form. Sophronia and Lavinia theorised that if Giles had been tutored in magic by them rather than being trained as a Watcher at the wishes of his father and grandmother, he would have become an extremely powerful magician, and could achieve this potential in his new life.     Despite his vast intelligence, Giles is not what one would call technology-savvy and is, by his own admission, somewhat ": null
    },
    {
        "technophobic": "technophobia"
    },
    {
        ". However, being a librarian, his occupation requires the use of up-to-date technology and skills to further a library services goals to serve its patrons efficiently, and in one episode , shows that Giles is proficient with computers at least on a basic level.       Heads portrayal of Giles was largely well received by television critics. An article for ": null
    },
    {
        "The Wrap": "the wrap"
    },
    {
        " summarized, For more than five seasons, the British actor added depth and charm to Joss Whedons groundbreaking 4242 series as mild-mannered librarian Rupert Giles.  Head was nominated in for the 42 ": null
    },
    {
        "Saturn Award": "saturn award"
    },
    {
        " for Best Supporting Actor, but lost out to co-star ": null
    },
    {
        "James Marsters": "james marsters"
    },
    {
        ".    ": null
    }
]