[
    {
        "           Sagittarius is one of the ": null
    },
    {
        "constellations": "constellations"
    },
    {
        " of the ": null
    },
    {
        "zodiac": "zodiac"
    },
    {
        ". It is one of the 48 constellations listed by the 2nd-century ": null
    },
    {
        "astronomer": "astronomer"
    },
    {
        " Ptolemy": "ptolemy"
    },
    {
        " and remains one of the ": null
    },
    {
        "88 modern constellations": "88 modern constellations"
    },
    {
        ". Its name is ": null
    },
    {
        "Latin": "latin"
    },
    {
        " for the ": null
    },
    {
        "archer": "archery"
    },
    {
        ", and its symbol is  , a stylized arrow. Sagittarius is commonly represented as a ": null
    },
    {
        "centaur": "centaur"
    },
    {
        " pulling back a bow. It lies between ": null
    },
    {
        "Scorpius": "scorpius"
    },
    {
        " and ": null
    },
    {
        "Ophiuchus": "ophiuchus"
    },
    {
        " to the west and ": null
    },
    {
        "Capricornus": "capricornus"
    },
    {
        " and ": null
    },
    {
        "Microscopium": "microscopium"
    },
    {
        " to the east.     The center of the ": null
    },
    {
        "Milky Way": "milky way"
    },
    {
        " lies in the westernmost part of Sagittarius .             As seen from the northern hemisphere, the constellations brighter stars form an easily recognizable ": null
    },
    {
        "asterism": "asterism"
    },
    {
        " known as the ": null
    },
    {
        "Teapot": "teapot"
    },
    {
        " . The stars ": null
    },
    {
        "δ Sgr": "delta sagittarii"
    },
    {
        " , ": null
    },
    {
        "ε Sgr": "epsilon sagittarii"
    },
    {
        " , ": null
    },
    {
        "ζ Sgr": "zeta sagittarii"
    },
    {
        " , and ": null
    },
    {
        "φ Sgr": "phi sagittarii"
    },
    {
        " form the body of the pot; ": null
    },
    {
        "λ Sgr": "lambda sagittarii"
    },
    {
        " is the point of the lid; ": null
    },
    {
        "γ 2 Sgr": "gamma2 sagittarii"
    },
    {
        " is the tip of the spout; and ": null
    },
    {
        "σ Sgr": "sigma sagittarii"
    },
    {
        " and ": null
    },
    {
        "τ Sgr": "tau sagittarii"
    },
    {
        " the handle. These same stars originally formed the bow and arrow of Sagittarius.      Marking the bottom of the teapots handle , is the bright star ": null
    },
    {
        "Zeta Sagittarii": "zeta sagittarii"
    },
    {
        " , named ": null
    },
    {
        "Ascella": "ascella"
    },
    {
        ", and the fainter ": null
    },
    {
        "Tau Sagittarii": "tau sagittarii"
    },
    {
        " .     To complete the teapot metaphor, under good conditions, a particularly dense area of the ": null
    },
    {
        "Milky Way": "milky way"
    },
    {
        " can be seen rising in a north-westerly arc above the spout, like a puff of steam rising from a boiling kettle. P.K. Chen A Constellation Album: Stars and Mythology of the Night Sky .     The constellation as a whole is often depicted as having the rough appearance of a stick-figure archer drawing its bow, with the fainter stars providing the outline of the horses body. Sagittarius famously points its arrow at the heart of ": null
    },
    {
        "Scorpius": "scorpius"
    },
    {
        ", represented by the reddish star ": null
    },
    {
        "Antares": "antares"
    },
    {
        ", as the two constellations race around the sky. Following the direct line formed by ": null
    },
    {
        "Delta Sagittarii": "delta sagittarii"
    },
    {
        " and ": null
    },
    {
        "Gamma2 Sagittarii": "gamma2 sagittarii"
    },
    {
        " leads nearly directly to Antares. Fittingly, Gamma2 Sagittarii is ": null
    },
    {
        "Alnasl": "alnasl"
    },
    {
        ", the Arabic word for arrowhead , and Delta Sagittarii is called ": null
    },
    {
        "Kaus Media": "kaus media"
    },
    {
        ", the center of the bow, from which the arrow protrudes. Kaus Media bisects ": null
    },
    {
        "Lambda Sagittarii": "lambda sagittarii"
    },
    {
        " and ": null
    },
    {
        "Epsilon Sagittarii": "epsilon sagittarii"
    },
    {
        " , whose names Kaus Borealis and Kaus Australis refer to the northern and southern portions of the bow, respectively.      Sagittarius is one of the prominent features of the summer skies in the northern hemisphere although in Europe north of the ": null
    },
    {
        "Pyrenees": "pyrenees"
    },
    {
        " it drags very low along the horizon and can be difficult to see clearly. In ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        " and ": null
    },
    {
        "Scandinavia": "scandinavia"
    },
    {
        " it cannot be seen at all. In southern ": null
    },
    {
        "Brazil": "brazil"
    },
    {
        ", ": null
    },
    {
        "South Africa": "south africa"
    },
    {
        ", and central ": null
    },
    {
        "Australia": "australia"
    },
    {
        " , Sagittarius passes directly overhead. It is hidden behind the Suns glare from mid-November to mid-January and is the location of the Sun at the winter solstice . By March, Sagittarius is rising at midnight. In June, it achieves opposition and can be seen all night. The June full moon appears in Sagittarius.     In classical antiquity, Capricorn was the location of the Sun at the winter solstice, but due to the procession of the equinoxes, this had shifted to Sagittarius by the time of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        ". By approximately 2700 AD, the Sun will be in ": null
    },
    {
        "Scorpius": "scorpius"
    },
    {
        " at the winter solstice.                 ": null
    },
    {
        "α Sgr": "alpha sagittarii"
    },
    {
        "  despite having the alpha designation, is not the brightest star of the constellation, having a magnitude of only 3.96. It is towards the bottom center of the map as shown. Instead, the brightest star is ": null
    },
    {
        "Epsilon Sagittarii": "epsilon sagittarii"
    },
    {
        " , at magnitude 1.85. James B. Kaler, Prof. Emeritus of Astronomy, University of Illinois,      ": null
    },
    {
        "Sigma Sagittarii": "sigma sagittarii"
    },
    {
        " is the constellations second-brightest star at magnitude 2.08. Nunki is a B2V star approximately 260 light years away. Nunki is a ": null
    },
    {
        "Babylonian": "akkadian language"
    },
    {
        " name of uncertain origin, but thought to represent the sacred Babylonian city of ": null
    },
    {
        "Eridu": "eridu"
    },
    {
        " on the ": null
    },
    {
        "Euphrates": "euphrates"
    },
    {
        ", which would make Nunki the oldest star name currently in use.     ": null
    },
    {
        "Zeta Sagittarii": "zeta sagittarii"
    },
    {
        " , with apparent magnitude 2.61 of A2 spectra, is actually a double star whose two components have magnitudes 3.3 and 3.5.      ": null
    },
    {
        "Delta Sagittarii": "delta sagittarii"
    },
    {
        " , is a K2 spectra star with magnitude 2.71 about 350 light years from Earth.     ": null
    },
    {
        "Eta Sagittarii": "eta sagittarii"
    },
    {
        " is a double star with component magnitudes of 3.18 and 10, while ": null
    },
    {
        "Pi Sagittarii": "pi sagittarii"
    },
    {
        "  is actually a triple system whose components have magnitudes 3.7, 3.8, and 6.0.     The Bayer designation ": null
    },
    {
        "Beta Sagittarii": "beta sagittarii"
    },
    {
        " is shared by two star systems, β¹ Sagittarii, with apparent magnitude 3.96, and β² Sagittarii, magnitude 7.4. The two stars are separated by 0.36° in the sky and are 378 light years from earth. Beta Sagittarii, located at a position associated with the forelegs of the centaur, has the traditional name ": null
    },
    {
        "Arkab": "arkab"
    },
    {
        ", meaning achilles tendon.     ": null
    },
    {
        "Nova": "nova"
    },
    {
        " Sagittarii 2015 No. 2 was discovered on 15 March 2015, by  of Chatsworth Island, NSW, Australia. It lies near the center of the constellation. It reached a peak magnitude of 4.3 before steadily fading.          The ": null
    },
    {
        "Milky Way": "milky way"
    },
    {
        " is at its densest near Sagittarius, as this is where the ": null
    },
    {
        "galactic center": "galactic center"
    },
    {
        " lies. As a result, Sagittarius contains many ": null
    },
    {
        "star clusters": "star cluster"
    },
    {
        "and ": null
    },
    {
        "nebula": "nebula"
    },
    {
        "e.       Sagittarius contains several well-known nebulae, including the ": null
    },
    {
        "Lagoon Nebula": "lagoon nebula"
    },
    {
        " , near λ Sagittarii; the ": null
    },
    {
        "Omega Nebula": "omega nebula"
    },
    {
        " , near the border with ": null
    },
    {
        "Scutum": "scutum"
    },
    {
        "; and the ": null
    },
    {
        "Trifid Nebula": "trifid nebula"
    },
    {
        " , a large nebula containing some very young, hot stars.     The ": null
    },
    {
        "Lagoon Nebula": "lagoon nebula"
    },
    {
        " is an emission nebula that is located 5,000 light-years from Earth and measures 140 light-years by 60 light-years . Though it appears grey in telescopes to the unaided eye, long-exposure photographs reveal its pink hue, common to emission nebulae. It is fairly bright, with an integrated magnitude of 3.0. The Lagoon Nebula was discovered independently by ": null
    },
    {
        "John Flamsteed": "john flamsteed"
    },
    {
        " in 1680, ": null
    },
    {
        "Guillaume Le Gentil": "guillaume le gentil"
    },
    {
        " in 1747, and ": null
    },
    {
        "Charles Messier": "charles messier"
    },
    {
        " in 1764. The central area of the Lagoon Nebula is also known as the Hourglass Nebula, so named for its distinctive shape. The Hourglass Nebula has its shape because of matter propelled by ": null
    },
    {
        "Herschel 36": "herschel 36"
    },
    {
        ". The Lagoon Nebula also features three ": null
    },
    {
        "dark nebula": "dark nebula"
    },
    {
        "e catalogued in ": null
    },
    {
        "Barnards Catalog": "barnards catalog"
    },
    {
        ". The Lagoon Nebula was instrumental in the discovery of ": null
    },
    {
        "Bok globules": "bok globules"
    },
    {
        ", as ": null
    },
    {
        "Bart Bok": "bart bok"
    },
    {
        " studied prints of the nebula intensively in 1947. Approximately 17,000 Bok globules were discovered in the nebula nine years later as a part of the ": null
    },
    {
        "Palomar Sky Survey": "palomar sky survey"
    },
    {
        "; studies later showed that Boks hypothesis that the globules held ": null
    },
    {
        "protostars": "protostar"
    },
    {
        "was correct. ": null
    },
    {
        "Omega Nebula": "omega nebula"
    },
    {
        " is a fairly bright nebula, sometimes called the Horseshoe Nebula or Swan Nebula. It has an integrated magnitude of 6.0 and is 4890 light-years from Earth. It was discovered in 1746 by ": null
    },
    {
        "Philippe Loys de Chésaux": "jean-philippe de cheseaux"
    },
    {
        "; observers since him have differed greatly in how they view the nebula, hence its myriad of names. Most often viewed as a checkmark, it was seen as a swan by ": null
    },
    {
        "George F. Chambers": "george frederick chambers"
    },
    {
        " in 1889, a loon by ": null
    },
    {
        "Roy Bishop": "roy bishop"
    },
    {
        ", and as a curl of smoke by ": null
    },
    {
        "Camille Flammarion": "camille flammarion"
    },
    {
        ". ": null
    },
    {
        "Trifid Nebula": "trifid nebula"
    },
    {
        " is an emission nebula in Sagittarius that lies less than two degrees from the Lagoon Nebula. Discovered by French comet-hunter ": null
    },
    {
        "Charles Messier": "charles messier"
    },
    {
        ", it is located between 2,000 and 9,000 light-years from Earth and has a diameter of approximately 50 light-years. The outside of the Trifid Nebula is a bluish ": null
    },
    {
        "reflection nebula": "reflection nebula"
    },
    {
        "; the interior is pink with two dark bands that divide it into three areas, sometimes called lobes . Hydrogen in the nebula is ionized, creating its characteristic color, by a central triple star, which formed in the intersection of the two dark bands. M20 is associated with a cluster that has a magnitude of 6.3. ": null
    },
    {
        "Red Spider Nebula": "red spider nebula"
    },
    {
        " is a planetary nebula located at a distance of about 4000 light-years from Earth.   ": null
    },
    {
        "NGC 6559": "ngc 6559"
    },
    {
        " is a star-forming region located at a distance of about 5000 light-years from Earth, in the constellation of Sagittarius, showing both emission and reflection regions.     In addition, several other nebulae have been located within Sagittarius and are of interest to astronomy.     ": null
    },
    {
        "M24": "messier 24"
    },
    {
        ", also called the Small Sagittarius Star Cloud, is a star cluster with an approximate magnitude of 3. About 9400 light-years away, it has a diameter of approximately 330 light-years. Embedded in M24 is ": null
    },
    {
        "NGC 6603": "ngc 6603"
    },
    {
        ", a smaller star cluster that is very dense. ": null
    },
    {
        "NGC 6567": "ngc 6567"
    },
    {
        ", a dim ": null
    },
    {
        "planetary nebula": "planetary nebula"
    },
    {
        ", and ": null
    },
    {
        "Barnard 92": "barnard 92"
    },
    {
        ", a ": null
    },
    {
        "Bok globule": "bok globule"
    },
    {
        ", are also nearby. ": null
    },
    {
        "NGC 6445": "ngc 6445"
    },
    {
        " is a ": null
    },
    {
        "planetary nebula": "planetary nebula"
    },
    {
        " with an approximate magnitude of 11. A large nebula at over one ": null
    },
    {
        "arcminute": "arcminute"
    },
    {
        " in diameter, it appears very close to the ": null
    },
    {
        "globular cluster": "globular cluster"
    },
    {
        " NGC 6440": "ngc 6440"
    },
    {
        ". ": null
    },
    {
        "NGC 6638": "ngc 6638"
    },
    {
        " is a dimmer globular at magnitude 9.2, though it is more distant than M71 at a distance of 26,000 light-years. It is a Shapley class VI cluster; the classification means that it has an intermediate concentration at its core. It is approximately a degree away from the brighter globulars ": null
    },
    {
        "M22": "messier 22"
    },
    {
        " and ": null
    },
    {
        "M28": "messier 28"
    },
    {
        "; NGC 6638 is southeast and southwest of the clusters respectively.            In 1999 a violent outburst at ": null
    },
    {
        "V4641 Sgr": "v4641 sagittarii"
    },
    {
        " was thought to have revealed the location of the closest known black hole to Earth, but later investigation increased its estimated distance by a factor of 15. The complex radio source ": null
    },
    {
        "Sagittarius A": "sagittarius a"
    },
    {
        " is also in Sagittarius, near its western boundary with ": null
    },
    {
        "Ophiuchus": "ophiuchus"
    },
    {
        ". Astronomers believe that one of its components, known as ": null
    },
    {
        "Sagittarius A": "sagittarius a"
    },
    {
        ", is associated with a ": null
    },
    {
        "supermassive black hole": "supermassive black hole"
    },
    {
        " at the ": null
    },
    {
        "center of the galaxy": "galactic center"
    },
    {
        ", with a mass of 2.6 million ": null
    },
    {
        "solar mass": "solar mass"
    },
    {
        "es. The ": null
    },
    {
        "Sagittarius Dwarf Elliptical Galaxy": "sagittarius dwarf elliptical galaxy"
    },
    {
        " is located just outside the ": null
    },
    {
        "Milky Way": "milky way"
    },
    {
        ".     ": null
    },
    {
        "Baades Window": "baades window"
    },
    {
        " is an area with very little ": null
    },
    {
        "obscuring dust": "dust lane"
    },
    {
        " that shows objects closer to the Milky Ways center than would normally be visible. ": null
    },
    {
        "NGC 6522": "ngc 6522"
    },
    {
        ", magnitude 8.6, and ": null
    },
    {
        "NGC 6528": "ngc 6528"
    },
    {
        ", magnitude 9.5, are both globular clusters visible through Baades Window. 20,000 and 24,000 light-years from Earth, with Shapley classes of VI and V respectively, both are moderately concentrated at their cores. NGC 6528 is closer to the galactic core at an approximate distance of 2,000 light-years.     ": null
    },
    {
        "2MASS-GC02": "2mass-gc02"
    },
    {
        ", also known as Hurt 2, is a ": null
    },
    {
        "globular cluster": "globular cluster"
    },
    {
        " at a distance of about 16 thousand ": null
    },
    {
        "light-years": "light-year"
    },
    {
        "from ": null
    },
    {
        "Earth": "earth"
    },
    {
        ". It was discovered in 2000 by Joselino Vasquez, and confirmed by a team of astronomers under the leadership of R. J. Hurt at ": null
    },
    {
        "2MASS": "2mass"
    },
    {
        ".        The ": null
    },
    {
        "space probe": "space probe"
    },
    {
        " New Horizons": "new horizons"
    },
    {
        " is moving on a trajectory out of the Solar System as of 2016 that places the probe in front of Sagittarius as seen from the Earth.  New Horizons will exhaust its ": null
    },
    {
        "radioisotope thermoelectric generator": "radioisotope thermoelectric generator"
    },
    {
        " long before it reaches any other stars.     The ": null
    },
    {
        "Wow! signal": "wow! signal"
    },
    {
        " was a strong narrowband radio signal that appeared to have come from the direction of Sagittarius.          The Babylonians identified Sagittarius as the god ": null
    },
    {
        "Nergal": "nergal"
    },
    {
        ", a strange centaur-like creature firing an arrow from a bow. It is generally depicted with wings, with two heads, one panther head and one human head, as well as a scorpions stinger raised above its more conventional horses tail. The Sumerian name ": null
    },
    {
        "Pabilsag": "pabilsaĝ"
    },
    {
        " is composed of two elements  – Pabil, meaning elder paternal kinsman and Sag, meaning chief, head. The name may thus be translated as the Forefather or Chief Ancestor. The figure is reminiscent of modern depictions of Sagittarius.       In ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", Sagittarius is usually identified as a ": null
    },
    {
        "centaur": "centaur"
    },
    {
        ": half human, half horse. However, perhaps due to the Greeks adoption of the Sumerian constellation, some confusion surrounds the identity of the archer. Some identify Sagittarius as the centaur ": null
    },
    {
        "Chiron": "chiron"
    },
    {
        ", the son of ": null
    },
    {
        "Philyra": "philyra"
    },
    {
        " and ": null
    },
    {
        "Cronus": "cronus"
    },
    {
        ", who was said to have changed himself into a horse to escape his jealous wife, ": null
    },
    {
        "Rhea": "rhea"
    },
    {
        ", and tutor to ": null
    },
    {
        "Jason": "jason"
    },
    {
        ". As there are two centaurs in the sky, some identify Chiron with the other constellation, known as ": null
    },
    {
        "Centaurus": "centaurus"
    },
    {
        ". Or, as an alternative tradition holds, that Chiron devised the constellations Sagittarius and Centaurus to help guide the Argonauts in their quest for the Golden Fleece. Richard H. Allen , Star Names: Their Lore and Meaning, G. E. Stechert, p. 353      A competing mythological tradition, as espoused by ": null
    },
    {
        "Eratosthenes": "eratosthenes"
    },
    {
        ", identified the Archer not as a centaur but as the ": null
    },
    {
        "satyr": "satyr"
    },
    {
        " Crotus": "krotos"
    },
    {
        ", son of ": null
    },
    {
        "Pan": "pan"
    },
    {
        ", who Greeks credited with the invention of archery. Theony Condos, Ph.D. Star Myths of the Greeks and Romans: A Sourcebook, p. 186  According to myth, Crotus often went hunting on horseback and lived among the ": null
    },
    {
        "Muses": "muses"
    },
    {
        ", who requested that ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        " place him in the sky, where he is seen demonstrating archery.     The arrow of this constellation points towards the star ": null
    },
    {
        "Antares": "antares"
    },
    {
        ", the heart of the scorpion , and Sagittarius stands poised to attack should Scorpius ever attack the nearby ": null
    },
    {
        "Hercules": "hercules"
    },
    {
        ", or to avenge Scorpiuss slaying of ": null
    },
    {
        "Orion": "orion"
    },
    {
        ". Milton D. Heifetz A Walk Through the Heavens: A Guide to Stars and Constellations and Their Legends, p. 66 .     On the west side of the constellation, Ptelomy also described the asterism Terebellum consisting of four 4th magnitude stars.             , the Sun appears in the constellation Sagittarius from 18 December to 18 January. In ": null
    },
    {
        "tropical astrology": "tropical astrology"
    },
    {
        ", the Sun is considered to be in the sign Sagittarius from 22 November to 21 December, and in ": null
    },
    {
        "sidereal astrology": "sidereal astrology"
    },
    {
        ", from 16 December to 14 January.          ": null
    }
]