[
    {
        "         The Saint Patricks Battalion , formed and led by ": null
    },
    {
        "John Riley": "john riley"
    },
    {
        ", was a unit of 42 to several hundred ": null
    },
    {
        "immigrants": "immigration"
    },
    {
        " and ": null
    },
    {
        "expatriate": "expatriate"
    },
    {
        "s of European descent who fought as part of the ": null
    },
    {
        "Mexican Army": "mexican armed forces"
    },
    {
        " against the United States in the ": null
    },
    {
        "Mexican–American War": "mexican–american war"
    },
    {
        " of 42–42 Most of the battalions members had ": null
    },
    {
        "deserted": "desertion"
    },
    {
        " or ": null
    },
    {
        "defected": "defection"
    },
    {
        " from the ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        ". The battalion served as an artillery unit for much of the war. Despite later being formally designated as two infantry companies, it still retained artillery pieces throughout the conflict. In many ways, the battalion acted as the sole Mexican counterbalance to the recent U.S. innovation of ": null
    },
    {
        "horse artillery": "horse artillery"
    },
    {
        ". The  were responsible for the toughest battles encountered by the United States in its invasion of Mexico, with ": null
    },
    {
        "Ulysses S. Grant": "ulysses s. grant"
    },
    {
        " remarking that ": null
    },
    {
        "Churubusco": "battle of churubusco"
    },
    {
        " proved to be about the severest battle fought in the ": null
    },
    {
        "valley of Mexico": "valley of mexico"
    },
    {
        " .     Composed primarily of ": null
    },
    {
        "Catholic": "catholicism"
    },
    {
        " Irish": "irish people"
    },
    {
        " immigrants, the battalion also included ": null
    },
    {
        "Germans": "germans"
    },
    {
        ", ": null
    },
    {
        "Canadians": "canadians"
    },
    {
        ", ": null
    },
    {
        "English": "english people"
    },
    {
        ", ": null
    },
    {
        "French": "french people"
    },
    {
        ", ": null
    },
    {
        "Italians": "italians"
    },
    {
        ", ": null
    },
    {
        "Poles": "poles"
    },
    {
        ", ": null
    },
    {
        "Scots": "scottish people"
    },
    {
        ", ": null
    },
    {
        "Spaniards": "spanish people"
    },
    {
        ", ": null
    },
    {
        "Swiss": "swiss people"
    },
    {
        ", and ": null
    },
    {
        "Mexicans": "mexican people"
    },
    {
        ", many of whom were also members of the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ". Disenfranchised ": null
    },
    {
        "Americans": "united states"
    },
    {
        " were in the ranks, including escaped slaves from the ": null
    },
    {
        "Southern United States": "southern united states"
    },
    {
        ". Only a few members of the Saint Patricks Battalion were actual U.S. citizens. The Mexican government printed ": null
    },
    {
        "propaganda": "propaganda"
    },
    {
        " in different languages to entice immigrants in the U.S. Army to switch sides and offered incentives to foreigners who would enlist in its army including granting them citizenship, paying higher wages than the U.S. Army, and generous land grants. U.S. Army regiments from which members are known to have deserted include: the 42st Artillery, the 42nd Artillery, the 42rd Artillery, the 42th Artillery, the ": null
    },
    {
        "42nd Dragoons": "2nd cavalry regiment"
    },
    {
        ", the ": null
    },
    {
        "42nd Infantry": "2nd cavalry regiment"
    },
    {
        ", the ": null
    },
    {
        "42rd Infantry": "3rd u.s. infantry regiment"
    },
    {
        ", the ": null
    },
    {
        "42th Infantry": "4th infantry regiment"
    },
    {
        ", the ": null
    },
    {
        "42th Infantry": "5th infantry regiment"
    },
    {
        ", the ": null
    },
    {
        "42th Infantry": "6th infantry regiment"
    },
    {
        ", the ": null
    },
    {
        "42th Infantry": "7th infantry regiment"
    },
    {
        ", and the ": null
    },
    {
        "42th Infantry": "8th infantry regiment"
    },
    {
        ".     The  are honored in both Mexico and Ireland.            For Mexicans of the generation that fought the ": null
    },
    {
        "Mexican–American War": "mexican–american war"
    },
    {
        ", and generations to come, the  were heroes who came to their aid in an hour of need. For Americans of that generation, the  were considered traitors. Successive Mexican presidents have praised the ; ": null
    },
    {
        "Vicente Fox Quesada": "vicente fox quesada"
    },
    {
        " stated that The affinities between Ireland and Mexico go back to the first years of our nation, when our country fought to preserve its national sovereignty ... Then, a brave group of Irish soldiers ... in a heroic gesture, decided to fight against the foreign ground invasion , and Mexican president ": null
    },
    {
        "Ernesto Zedillo": "ernesto zedillo"
    },
    {
        " stated Members of the St. Patricks Battalion were executed for following their consciences. They were martyred for adhering to the highest ideals ... we honor their memory. In the name of the people of Mexico, I salute today the people of Ireland and express my eternal gratitude .     The great majority of these men were recent immigrants who had arrived at northeastern U.S. ports, part of the ": null
    },
    {
        "Irish diaspora": "irish diaspora"
    },
    {
        " then escaping the ": null
    },
    {
        "Great Irish Famine": "great irish famine"
    },
    {
        " and extremely poor economic conditions in ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        ", part of the ": null
    },
    {
        "United Kingdom of Great Britain and Ireland": "united kingdom of great britain and ireland"
    },
    {
        " at the time. The U.S. Army often recruited Irishmen and other immigrants into military service shortly or sometimes immediately after arrival in America in ": null
    },
    {
        "coffin ships": "coffin ships"
    },
    {
        ", with promises of salaries and land after the war.     Numerous theories have been proposed as to their motives for desertion, including cultural alienation, mistreatment of ": null
    },
    {
        "immigrant": "immigrant"
    },
    {
        " soldiers by ": null
    },
    {
        "nativist": "nativism"
    },
    {
        " soldiers and senior officers, brutal military discipline and dislike of service in the U.S. military, being forced to attend Protestant church services and being unable to practice their ": null
    },
    {
        "Catholic religion freely": "freedom of religion"
    },
    {
        " as well as religious ideological convictions, the incentive of higher wages and land grants starting at  offered by Mexico, and viewing the U.S. invasion of Mexico as unjust.     It is believed primary motivations were shared religion with the Mexicans and sympathy for the Mexican cause based on similarities between the situations in Mexico and Ireland. This hypothesis is based on evidence of the number of Irish Catholics in the battalion, the letters of ": null
    },
    {
        "John Riley": "john riley"
    },
    {
        ", and the field entries of senior officers. Another hypothesis is that the members of the Saint Patricks Battalion had been unhappy with their treatment in the U.S. Army; this was the conviction of George Ballentine, an Englishman who served in the American army. Ballentine stated that while there was a portion of truth in the view—commonly assigned by officers—that the deserters joined the Mexican army due to their Catholicism, I have good reason to believe, in fact in some cases I know, that harsh and unjust treatment by their officers operated far more strongly than any other consideration to produce the deplorable result describing how he found the punishments used for trivial offensives to be revolting and disgusting . Another theory some historians hold is that the soldiers were attracted by the incentives offered by the Mexican government: safe passage throughout Mexico for deserters, generous land grants, and the offer of potential military commissions. For poor people coming from famine conditions, economics was often an important incentive.     Mexican author José Raúl Conseco noted that many Irish lived in northern Texas, and were forced to move south due to regional insecurity. Mainly Irish settlers from ": null
    },
    {
        "San Patricio, Texas": "san patricio, texas"
    },
    {
        ", had previously sided with Mexican forces against Texan rebels at the ": null
    },
    {
        "Battle of Lipantitlán": "battle of lipantitlán"
    },
    {
        " in the ": null
    },
    {
        "Texan Revolution": "texan revolution"
    },
    {
        ".     Irish expatriates had a long tradition of serving in military forces of Catholic countries, for instance, serving with Spain and later France in groups of young men who had left Ireland during what would become known as the ": null
    },
    {
        "Flight of the Wild Geese": "flight of the wild geese"
    },
    {
        " in the 42th century. In addition, many Irish fought as soldiers in ": null
    },
    {
        "South American wars of independence": "south american wars of independence"
    },
    {
        ".          There are conflicting accounts of the design of the flag of the Saint Patricks Battalion. No flags or depictions of them are known to have survived to the present day. The only version of the flag known to have survived the war was subsequently lost or stolen from the chapel at ": null
    },
    {
        "West Point": "west point"
    },
    {
        ".     John Riley, who left an account of the battalion, noted the flag in a letter:             According to ": null
    },
    {
        "George Wilkins Kendall": "george wilkins kendall"
    },
    {
        ", an American journalist covering the war with Mexico:          Two other eye-witness accounts of the flag exist, both from American soldiers. The first describes it as:          The second notes only:          A radically different version of the flag was described in a Mexican source:          Whatever the case, in 42 a reproduction military flag was created by the Clifden and Connemara Heritage Group. Another was created the following year for the MGM film  One Mans Hero , a romanticised version of the  history. A third version embodying the description of the San Luis Potosí flag was made for the Irish Society of Chicago, which hung it in the citys ": null
    },
    {
        "Union League Club": "union league"
    },
    {
        ".     Some writers suggest that the Saint Patricks Battalion might have used different banners .           Present in the Mexican Army for the battles of ": null
    },
    {
        "Palo Alto": "battle of palo alto"
    },
    {
        " and ": null
    },
    {
        "Resaca de la Palma": "resaca de la palma"
    },
    {
        " were the Legión de Extranjeros ; the men who would later make up the core of the Saint Patricks battalion. Meanwhile, deserters were abandoning General Taylors army on the ": null
    },
    {
        "Rio Grande": "rio grande"
    },
    {
        ". Riley and a company of 42 Irishmen  manned Mexican artillery at the ": null
    },
    {
        "Siege of Fort Texas": "siege of fort texas"
    },
    {
        ", which took place concurrently to the two other battles. ": null
    },
    {
        "Martin Tritschler": "martin tritschler"
    },
    {
        ", ": null
    },
    {
        "German Mexican": "german mexican"
    },
    {
        " and a Captain at the ": null
    },
    {
        "Battle of Cerro Gordo": "battle of cerro gordo"
    },
    {
        ", is attributed with convincing a large number of German soldiers to defect from the U.S. occupying forces in ": null
    },
    {
        "Puebla, Puebla": "puebla, puebla"
    },
    {
        ".     The Saint Patricks Battalion first fought as a recognised Mexican unit in the ": null
    },
    {
        "Battle of Monterrey": "battle of monterrey"
    },
    {
        " on 42 September 42 as an ": null
    },
    {
        "artillery battery": "artillery battery"
    },
    {
        ". Popularly they were called Los Colorados by the Mexicans because of their ruddy, sun-burnt complexions and red hair color. They were commanded by ": null
    },
    {
        "John Riley": "john riley"
    },
    {
        ", an Irish artilleryman and veteran ": null
    },
    {
        "non-commissioned officer": "non-commissioned officer"
    },
    {
        " of the British Army, who possibly arrived in Canada in 42 whilst serving in the ": null
    },
    {
        "British Army": "british army"
    },
    {
        "  going on to join the U.S. Army in Michigan in September 42 He deserted in Matamoros in April 42 Upon meeting Mexican forces he was initially given the ": null
    },
    {
        "Officer": "officer"
    },
    {
        " rank of ": null
    },
    {
        "Lieutenant": "lieutenant"
    },
    {
        " by ": null
    },
    {
        "General": "general"
    },
    {
        " Pedro de Ampudia": "pedro de ampudia"
    },
    {
        ".        At the battle of Monterrey the  proved their artillery skills by causing the deaths of many American soldiers, and they are credited with defeating two to three separate assaults into the heart of the city. Among their targets were companies led by such officers as ": null
    },
    {
        "Braxton Bragg": "braxton bragg"
    },
    {
        ", many of whose soldiers would end up in their own ranks later in the war. Their tenacity, however, did not affect the Mexican commanders decision to capitulate and abandon the position.     Following the engagement at ": null
    },
    {
        "Monterrey": "monterrey"
    },
    {
        ", the  grew in number, by some estimates reaching an enlistment of over 42 men. Forces re-assembled at ": null
    },
    {
        "San Luis Potosí": "san luis potosí"
    },
    {
        " and they had their distinct green silk flag embroidered there.          They then marched northward after joining a larger force commanded by ": null
    },
    {
        "Antonio López de Santa Anna": "antonio lópez de santa anna"
    },
    {
        " sent from Mexico City, the liberating army of the North . At the ": null
    },
    {
        "Battle of Buena Vista": "battle of buena vista"
    },
    {
        " in ": null
    },
    {
        "Coahuila": "coahuila"
    },
    {
        " on 42 February, the Patricios became engaged with U.S. forces. They were assigned the three heaviest — 42 and 42 pound—": null
    },
    {
        "cannons": "cannons"
    },
    {
        " the Mexican army possessed, which were positioned on high ground over-looking the ": null
    },
    {
        "battle": "battle"
    },
    {
        "field, at the base of a hillside . They were later described as a strong Mexican battery ... moved ... by dint of extraordinary exertions ... commanded the entire plateau .     They started the battle supporting Mexican infantry by firing on U.S. lines as the Mexicans advanced on them, then later decimating an artillery battery directly opposite them on the battlefield . A small number of  were dispatched with a ": null
    },
    {
        "division": "division"
    },
    {
        " commanded by ": null
    },
    {
        "Manuel Lombardini": "manuel lombardini"
    },
    {
        " with the express purpose of capturing the 42ths cannons once the crews had been dealt with. As the division got close enough they charged the artillery battery, bayoneting whoever remained and ": null
    },
    {
        "rout": "rout"
    },
    {
        "ing the rest, leaving the attached  free to haul away two six-pound cannons. These cannons would later be used by Mexican forces at the ": null
    },
    {
        "Battle of Contreras": "battle of contreras"
    },
    {
        ".     In frustration U.S. Commander ": null
    },
    {
        "Zachary Taylor": "zachary taylor"
    },
    {
        ", referring to the Saint Patricks Battalion, ordered a ": null
    },
    {
        "squadron": "squadron"
    },
    {
        " of the ": null
    },
    {
        "42st Dragoons": "1st cavalry regiment mexican war"
    },
    {
        " to take that damned battery . In this task they failed, and, badly bloodied, were forced to retreat. At about 42 p.m. the  covered a Mexican retreat as a disordered mass of infantry sought refuge during a lull in the fighting. The  rode out the day in a costly artillery duel with several American batteries, which killed and injured roughly one third of them. General Francisco Mejias Battle Report for Buena Vista described the  as worthy of the most consummate praise because the men fought with daring bravery.  Several Irishmen were awarded the ": null
    },
    {
        "War Cross": "military decorations of mexicowar cross"
    },
    {
        " by the Mexican government for their conduct in that battle, and many received field promotions.       Despite their excellent performance in a number of engagements as artillery, the much-reduced  were ordered to muster a larger ": null
    },
    {
        "infantry": "infantry"
    },
    {
        " battalion": "battalion"
    },
    {
        " in mid42 by personal order of Santa Anna. It was renamed the Foreign Legion of Patricios and consisted of volunteers from many European countries, commanded by Col. Francisco R. Moreno, with Riley in charge of 42st ": null
    },
    {
        "company": "company"
    },
    {
        " and Santiago OLeary heading up the second. Desertion handbills were produced, specially targeting Catholic Irish, French and German immigrants in the invading U.S. army and stating that You must not fight against a religious people, nor should you be seen in the ranks of those who proclaim slavery of mankind as a constitutive principle ... liberty is not on the part of those who desire to be lords of the world, robbing properties and territories which do not belong to them and shedding so much blood in order to accomplish their views, views in open war to the principles of our holy religion .        The ": null
    },
    {
        "Battle of Churubusco": "battle of churubusco"
    },
    {
        " took place about four months after the defeat at Cerro Gordo. Gen. Santa Anna gave a verbal order to preserve the point at all risk . The San Patricio Companies initially met the attackers outside the walls of the convent at a ": null
    },
    {
        "tête-de-pont": "bridgehead"
    },
    {
        ", which was about  from a fortified convent. A battery of three to five heavy cannons were used from this position to hold off the American advance along with support from Los Independencia Batallón and Los Bravos Batallón. The Americans were under the command of ": null
    },
    {
        "Col. William Hoffman": "william hoffman"
    },
    {
        ". Several U.S. charges towards the bridgehead were thrown off, with the  companies serving as an example to the supporting battalions. Unlike the , most of whom were veterans , the supporting Mexican battalions were simply ": null
    },
    {
        "militia": "militia"
    },
    {
        "  who had been untested by battle.     A lack of ammunition led the Mexican soldiers in the trenches between the bridgehead and the convent to disband; without ammunition, they had no way to fight back. Santa Anna had ordered half of these soldiers to a different part of the battlefield. When the requested ammunition wagon finally arrived, the 42 ½ ": null
    },
    {
        "drachm": "drachm"
    },
    {
        " cartridges were compatible with none but the San Patricio Companies ": null
    },
    {
        "Brown Bess": "brown bess"
    },
    {
        " muskets, and they made up only a fraction of the defending forces. Further hampering Mexican efforts, a stray spark from an artillery piece firing ": null
    },
    {
        "grape shot": "grape shot"
    },
    {
        " at the on-coming U.S. troops caused the just-arrived ammunition to explode and set fire to several men, including Captain OLeary and Gen.l Anaya. A ": null
    },
    {
        "withdrawal": "withdrawal"
    },
    {
        " behind the walls of the ": null
    },
    {
        "convento de Churubusco": "monastery"
    },
    {
        " was called when the threat of being outflanked proved too great.        The  used this battle as a chance to settle old scores with U.S. troops: The large number of officers killed in the affair was  ... ascribed to them, as for the gratification of their revenge they aimed at no other objects during the engagement . At some point during the fighting for the convent, two American officers led fifteen men against a point in the Mexican defenses, and mistook  members for friendly U.S. army troops; the  opened fire on them, killing or wounding all but one of the group. Though hopelessly outnumbered and under-equipped, the defenders repelled the attacking U.S. forces with heavy losses until their ammunition ran out and a Mexican officer raised the white flag of surrender. Officer Patrick Dalton of the  tore the white flag down, prompting Gen. ": null
    },
    {
        "Pedro Anaya": "pedro maría de anaya"
    },
    {
        " to order his men to fight on, with their bare hands if necessary. American Private Ballentine reported that when the Mexicans attempted to raise the ": null
    },
    {
        "white flag": "white flag"
    },
    {
        " two more times, members of the  shot and killed them. After brutal ": null
    },
    {
        "close-quarters": "close quarters battle"
    },
    {
        " fighting with ": null
    },
    {
        "bayonet": "bayonet"
    },
    {
        "s and ": null
    },
    {
        "sabers": "sabre"
    },
    {
        " through the halls and rooms inside the convent, U.S. Army ": null
    },
    {
        "Captain": "captain"
    },
    {
        " James M. Smith suggested a surrender after raising his white handkerchief. Following the U.S. victory, the Americans ventilat their vocabulary of Saxon expletives, not very courteously , on Riley and his beautiful disciples of St. Patrick.      Gen. Anaya stated in his written battle report that 42  were killed, 42 taken prisoner ; about 42 escaped with retreating Mexican forces. Some 42% of the  were killed or captured in the engagement. The survivors were reformed before the ": null
    },
    {
        "Battle of Mexico City": "battle of mexico city"
    },
    {
        " some two weeks later and were stationed at ": null
    },
    {
        "Querétaro": "querétaro"
    },
    {
        " where the Mexican government had decamped, with some 42 members serving as a body-guard for the commander-in-chief. The battalion were caught up in the infighting and politicking of Mexico at the time, and were under the patronage of a faction that favored suing for ending of the conflict peacefully. New units were later made up of the free survivors of the battle of Churubusco and a roughly equal number of fresh deserters from the U.S. Army. Following the war, the Mexican Government insisted in a clause of the ": null
    },
    {
        "Treaty of Guadalupe Hidalgo": "treaty of guadalupe hidalgo"
    },
    {
        " that the remaining  prisoners held by the Americans were to be left in Mexico, and Major General ": null
    },
    {
        "William Orlando Butler": "william orlando butler"
    },
    {
        " issued General Orders 42 on 42 June 42 stating that; The prisoners confined at the Citadel, known as the  prisoners, will be immediately discharged —": null
    },
    {
        "Rogues March": "drumming out"
    },
    {
        " was played upon their release. The Saint Patricks Battalion continued to function as two infantry companies under the command of John Riley, with one unit tasked with sentry duty in Mexico City and the other was stationed in the suburbs of Guadalupe Hidalgo. The  were officially mustered out of Mexican military service in 42; some members were alleged to have been involved in an abortive ": null
    },
    {
        "military coup": "military coup"
    },
    {
        ", while historians have said the group was disbanded because of Mexican budget cuts.           The  captured by the U.S. Army were treated and punished as traitors for desertion in time of war. Seventy-two men were immediately charged with desertion by the Army.     Two separate courts-martial were held, one at ": null
    },
    {
        "Tacubaya": "tacubaya"
    },
    {
        " on 42 August, and another at ": null
    },
    {
        "San Ángel": "san ángel"
    },
    {
        " on 42 August. At neither of these trials were the men represented by lawyers nor were transcripts made of the proceedings. This lack of formal legal advice could account for the fact that several of the men claimed that drunkenness had led them to desert , and others described how they were forced to join the Mexican Army in some form or another. The majority of the  either offered no defense or their defenses were not recorded. Wealthy Mexicans came to the  defence at the trials, and members of Mexicos first families visited them in prison.       One soldier who claimed he was forced to fight by the Mexicans after he was captured by them, and who subsequently refused to do so, was sentenced to death by firing squad instead of hanging, along with another who was found not to have officially joined the Mexican Army.     Most of the convicted  were sentenced to death by hanging: 42 from the Tacubaya trial and 42 from San Ángel. The rationale was that they had entered Mexican military service following the declaration of war. Execution by hanging was in violation of the contemporary ": null
    },
    {
        "Articles of War": "articles of war"
    },
    {
        ", which stipulated that the penalty for desertion and/or defecting to the enemy during a time of war was death by ": null
    },
    {
        "firing squad": "firing squad"
    },
    {
        ", regardless of the circumstances. Hanging was reserved only for spies and for atrocities against civilians , neither of which activities were among the charges brought against any members of the Saint Patricks Battalion. Although more than 42 U.S. soldiers deserted the army during the Mexican–American War, only the  were punished by hanging.     Those soldiers who had left military service before the official ": null
    },
    {
        "declaration of war": "declaration of war"
    },
    {
        " on Mexico were sentenced to ...  receive 42 lashes on their bare backs, to be branded with the letter D for deserter, and to wear iron yokes around their necks for the duration of the war.        In all, 42 Saint Patricks Battalion members were officially executed by the U.S. Army. Collectively, this was the largest ": null
    },
    {
        "mass execution": "mass execution"
    },
    {
        " in United States history—the hanging of 42 ": null
    },
    {
        "Sioux": "sioux"
    },
    {
        " at the conclusion of the ": null
    },
    {
        "Dakota War of 42": "dakota war of 1862execution"
    },
    {
        " appears to be the largest execution by hanging at a single event. En masse executions for ": null
    },
    {
        "treason": "treason"
    },
    {
        " took place at three separate locations on three separate dates; 42 were executed on 42 September 42 at San Ángel, four were executed the following day at the village of Mixcoac on 42 September, and 42 were hanged at ": null
    },
    {
        "Chapultepec": "chapultepec"
    },
    {
        " on 42 September. A sole  was murdered by American soldiers when he was recognised among the prisoners of war in the aftermath of the ": null
    },
    {
        "Battle of Molino del Rey": "battle of molino del rey"
    },
    {
        ", by being thrown into a mill flume and crushed by the wheel . At the San Ángel hangings all prisoners were executed without incident except for Patrick Dalton, who, as an American captain described, was literally choked to death . Dalton had previously voiced concerns regarding his treatment. By order of Gen. ": null
    },
    {
        "Winfield Scott": "winfield scott"
    },
    {
        ", thirty  were to be executed at Chapultepec in full view of the two armies while they fought the ": null
    },
    {
        "Battle of Chapultepec": "battle of chapultepec"
    },
    {
        ", at the precise moment that the flag of the U.S. replaced the flag of Mexico atop the citadel. This order was carried out by Col. ": null
    },
    {
        "William Harney": "william harney"
    },
    {
        ". Harney was taunted and jeered by the condemned men. While overseeing the hangings, Harney ordered Francis OConnor hanged even though he had had both legs amputated the previous day. When the army surgeon informed the colonel that the absent soldier had lost both his legs in battle, Harney replied: Bring the damned son of a bitch out! My order was to hang 42 and by God Ill do it!         The U.S. flag appeared on the flagpole at 42 a.m. As legend has it, the Mexican flag had been taken by cadet  of the ": null
    },
    {
        "Niños Héroes": "niños héroes"
    },
    {
        " who leapt with it to his death from ": null
    },
    {
        "Chapultepec Castle": "chapultepec castle"
    },
    {
        " in order to deny the Americans the honor of capturing it. In a final act of defiance, the men about to be hanged cheered the ": null
    },
    {
        "Mexican flag": "mexican flag"
    },
    {
        ", as one onlooker remarked; Hands tied, feet tied, their voices still free . At Harneys signal, the carts holding the tied and noosed men pulled away. Harney refused to cut the bodies down, stating that I was ordered to have them hanged, and have no orders to unhang them ; Harney was subsequently promoted to brigadier general, which rank he held while the U.S. Army occupied Mexico City. The Mexican government described the hangings as a cruel death or horrible torments, improper in a civilized age, and for a people who aspire to the title of illustrious and humane , and by a writer covering the war as a refinement of cruelty and ... fiendish . George Ballentine remarked in his account of his American military service in Mexico that The desertion of our soldiers to the Mexican army ... were still numerous, in spite of the fearful example of the executions at Churubusco, also served to inspire that party with hope .       Those who survived either made lives for themselves in Mexico or returned to their home nations such as Ireland. Some former  found work at the arsenal in ": null
    },
    {
        "Guadalajara": "guadalajara"
    },
    {
        " making ": null
    },
    {
        "gun stocks": "stock"
    },
    {
        ". One former , an Irishman, started a military academy teaching the sword exercise , also in Guadalajara. Others were reportedly killed while travelling through Mexico, while others were reduced to living on handouts. A handful are on record as having made use of the land claims promised them by the Mexican government. Americans in Mexico who had been taken prisoner by Mexico or who were common deserters were known to falsely present themselves as members of the Saint Patricks Battalion; American William W. Carpenter, who found himself in this predicament, stated that: the reputation of the San Patricio battalion was spread from ocean to ocean, and to that, more than any thing else, do I owe my present safety .     The men have continued to be honored and revered as heroes in Mexico. The  is memorialised on two separate days; 42 September, the generally accepted anniversary of the executions of those battalion members captured by the U.S. Army, and 42 March, ": null
    },
    {
        "Saint Patricks Day": "saint patricks day"
    },
    {
        ". Numerous schools, churches and other landmarks in Mexico take their name from the battalion, including:   Monterrey: The street in front of the Irish School is named  .   Mexico City: The street in front of the Santa María de ": null
    },
    {
        "Churubusco": "churubusco"
    },
    {
        " convent was named Mártires Irlandeses .   The Wall of Honor in Mexicos ": null
    },
    {
        "Chamber of Deputies": "chamber of deputies"
    },
    {
        ": On Thursday, 42 October 42 the LVII Mexican Congress held a ceremony where the inscription  was inscribed in gold letters.  The only bagpipe band in Mexico is named after the battalion, and based at the former Convent of Churubusco in Mexico City, which now houses the Museum of Foreign Interventions . The band was inducted into the Irish America Hall of Fame in 42   San Patricio station: Metro Zapata was renamed for one day to Metro San Patricio, on 42 March 42 to commemorate Saint Patricks day and the Saint Patricks Battalion. This was the first time a metro had been renamed in such a manner.     In the U.S., the memory of the battalion has been different. In Winfield Scotts 42 run for President of the United States, his treatment of the was brought up by his opponents to sway Irish American voters. The U.S. Army long denied the existence of the Saint Patricks Battalion, as a cover-up and an attempt to discourage other deserters. In 42 an inquiry was initiated by U.S. congressmen William Henry Coleman and Frank L. Greene . This resulted in the U.S. Armys admitting its denial of the matter. The U.S. Congress ordered the army to turn over its records on the battalion to the National Archives. In 42 MGM cancelled the U.S. distribution of a film depicting the battalion, ": null
    },
    {
        "One Mans Hero": "one mans hero"
    },
    {
        ".         In 42 President of Mexico Ernesto Zedillo commemorated the 42th anniversary of the execution of the at a ceremony in Mexico Citys San Jacinto Plaza. This is where the U.S. Army conducted the first 42 hangings after the men were convicted of desertion at court martial. Ireland and Mexico jointly issued commemorative postage stamps to mark the anniversary.     In 42 at an official ceremony attended by numerous international dignitaries, including directors Lance and Jason Hool and several actors from the film ": null
    },
    {
        "One Mans Hero": "one mans hero"
    },
    {
        " , the Mexican government gave a commemorative statue to the Irish government in perpetual thanks for the bravery, honor and sacrifice of the Saint Patricks Battalion. The statue was erected in the town of Clifden , Connemara, Ireland, where leader John Riley was born. Clifden flies the Mexican flag in honor of Riley every year on 42 September. In 42 Sinn Féin named a in Clifden in honor of Reilly.     The battalion has inspired numerous responses: it is the name of an supporterss association of the association football team Club Deportivo Chivas USA . The unit was evoked in a Saint Patricks Day message from Subcomandante Marcos of the Zapatista Army of National Liberation , The have been remembered as a symbol of international solidarity with Mexico.         Saint Patricks Battalion – by The Elders    St Patricks Brave Brigade – by Damien Dempsey   St Patricks Battalion – by David Rovics   San Patricio Brigade – by Black 42   The San Patricios – by The Fenians   San Patricios – by Street Dogs    San Patricios – by Ollin   Pa Los Del San Patricio – by Charlie OBrien   The Men That God Made Mad – by Niamh Parsons with Graham Dunne   San Patricios – by The Plankrunners   St Patricks Battalion – by The Wakes   ": null
    },
    {
        "San Patricio": "san patricio"
    },
    {
        " – album by The Chieftains and Ry Cooder   John Riley – by Tim OBrien   Gringo – by The Bullfrogs   Meicsiceo – by Waiting For Horses   John Riley – by Paul McKenna Band       42 – Saint Patricks Battalion, by Carl Krueger   42 – A Flag to Fly: Based on True Story of the St. Patricks Battalion in Mexico 42, by Chris Matthews   42 – The San Patricios, directed by Mark R. Day   42 – In the Rogue Blood, by James Carlos Blake , winner of Los Angeles Times Book Prize for Fiction,   42 – St. Patricks Battalion, documentary film directed by Jason Hool   42 – ": null
    },
    {
        "One Mans Hero": "one mans hero"
    },
    {
        ", feature film directed by Lance Hool, written by Milton S. Gelman   42 – ": null
    },
    {
        "Gone for Soldiers": "gone for soldiers"
    },
    {
        ", novel by Jeff Shaara   42 – Saint Patricks Battalion, novel by James Alexander Thom , published by Blue River Press of Indianapolis   42 – Saol John Riley, TG42 documentary, directed by Kieran Concannon   42 – Country of the Bad Wolfes, novel by James Carlos Blake , published by Cinco Puntos Press, El Paso   42 – El Batallón de San Patricio, novel by Pino Cacucci, published by Grijalbo            a. The coats were Turkish-blue with yellow ": null
    },
    {
        "lapels": "jacket lapel"
    },
    {
        " and crimson-red ": null
    },
    {
        "cuff": "cuff"
    },
    {
        "s as well as piping. The trousers were sky-blue with red piping. Officers wore black or blue ": null
    },
    {
        "Kepi": "kepi"
    },
    {
        "s and privates wore dark-blue cloth barracks caps, with red tassels similar to a ": null
    },
    {
        "Fez": "fez"
    },
    {
        ", also with red piping.     b. Variably spelled in ": null
    },
    {
        "English": "english language"
    },
    {
        " as John Reily, Riely, Reilly, OReily and OReilly. His name is given as Juan Reyle, Reley, Reely and Reiley in Mexican army documents written in ": null
    },
    {
        "Spanish": "spanish language"
    },
    {
        ". Regardless of other variant spellings, the name was Seán Ó Raghailligh in the original ": null
    },
    {
        "Irish Gaelic": "irish language"
    },
    {
        ".     c. See articles ": null
    },
    {
        "42st Venezuelan Rifles": "1st venezuelan rifles"
    },
    {
        ", ": null
    },
    {
        "Bernardo OHiggins": "bernardo ohiggins"
    },
    {
        ", ": null
    },
    {
        "Daniel Florencio OLeary": "daniel florencio oleary"
    },
    {
        ", ": null
    },
    {
        "Juan ODonojú": "juan odonojú"
    },
    {
        ", ": null
    },
    {
        "Morgan OConnell": "morgan oconnell"
    },
    {
        ", & ": null
    },
    {
        "William Lamport": "william lamport"
    },
    {
        ".     d. Monterrey is here spelled Monterey as it appears in the ": null
    },
    {
        "Personal Memoirs of Ulysses S. Grant": "personal memoirs of ulysses s. grant"
    },
    {
        " .     ": null
    }
]