[
    {
        "              The Saint Lawrence Seaway  is a system of ": null
    },
    {
        "locks": "lock"
    },
    {
        ", ": null
    },
    {
        "canal": "canal"
    },
    {
        "s, and channels in ": null
    },
    {
        "Canada": "canada"
    },
    {
        " and the ": null
    },
    {
        "United States": "united states"
    },
    {
        " that permits oceangoing vessels to travel from the ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        " to the ": null
    },
    {
        "Great Lakes": "great lakes"
    },
    {
        " of North America, as far inland as ": null
    },
    {
        "Duluth, Minnesota": "duluth, minnesota"
    },
    {
        " at the western end of ": null
    },
    {
        "Lake Superior": "lake superior"
    },
    {
        ". The seaway is named for the ": null
    },
    {
        "Saint Lawrence River": "saint lawrence river"
    },
    {
        ", which flows from ": null
    },
    {
        "Lake Ontario": "lake ontario"
    },
    {
        " to the Atlantic Ocean. Legally, the seaway extends from ": null
    },
    {
        "Montreal": "montreal"
    },
    {
        ", ": null
    },
    {
        "Quebec": "quebec"
    },
    {
        ", to ": null
    },
    {
        "Lake Erie": "lake erie"
    },
    {
        " and includes the ": null
    },
    {
        "Welland Canal": "welland canal"
    },
    {
        ".     The Saint Lawrence River portion of the seaway is not a continuous canal; rather, it consists of several stretches of ": null
    },
    {
        "navigable": "navigable"
    },
    {
        " channels within the river, a number of ": null
    },
    {
        "lock": "lock"
    },
    {
        "s, and canals along the banks of the Saint Lawrence River to bypass several ": null
    },
    {
        "rapids": "rapid"
    },
    {
        "and ": null
    },
    {
        "dam": "dam"
    },
    {
        "s. A number of the locks are managed by the ": null
    },
    {
        "St. Lawrence Seaway Management Corporation": "st. lawrence seaway management corporation"
    },
    {
        " in Canada, and others in the United States by the ": null
    },
    {
        "Saint Lawrence Seaway Development Corporation": "saint lawrence seaway development corporation"
    },
    {
        "; the two bodies together advertise the seaway as part of  Highway H 2 O .  The section of the river from Montreal to the Atlantic is under Canadian jurisdiction, regulated by the offices of ": null
    },
    {
        "Transport Canada": "transport canada"
    },
    {
        " in the ": null
    },
    {
        "Port of Quebec": "port of quebec"
    },
    {
        ".          The Saint Lawrence Seaway was preceded by several other canals. In 1871, locks on the Saint Lawrence allowed transit of vessels  long,  wide, and  deep. The ": null
    },
    {
        "First Welland Canal": "first welland canal"
    },
    {
        ", constructed between 1824 and 1829, had a minimum lock size of  long,  wide, and  deep, but it was generally too small to allow passage of larger oceangoing ships. The ": null
    },
    {
        "Welland Canals": "welland canal"
    },
    {
        "minimum lock size was increased to  long,  wide, and  deep for the Second Welland Canal; to  long,  wide, and  deep with the Third Welland Canal; and to  long,  wide, and  deep for the current Welland Canal.      The first proposals for a binational comprehensive deep waterway along the Saint Lawrence were made in the 1890s. In the following decades, developers proposed a hydropower project as inseparable from the seaway; the various governments and seaway supporters believed the deeper water to be created by the hydro project was necessary to make the seaway channels feasible for oceangoing ships. U.S. proposals for development up to and including the First World War met with little interest from the Canadian federal government. But the two national governments submitted Saint Lawrence plans to a group for study. By the early 1920s, both  The Wooten-Bowden Report  and the ": null
    },
    {
        "International Joint Commission": "international joint commission"
    },
    {
        " recommended the project.     Although the Liberal Prime Minister ": null
    },
    {
        "William Lyon Mackenzie King": "william lyon mackenzie king"
    },
    {
        " was reluctant to proceed, in part because of opposition to the project in Quebec, in 1932 he and the U.S. representative signed a treaty of intent. This treaty was submitted to the U.S. Senate in November 1932 and hearings continued until a vote was taken on March 14, 1934. The majority voted in favor of the treaty, but it failed to gain the necessary two-thirds vote for ratification. Later attempts between the governments in the 1930s to forge an agreement came to naught due to opposition by the Ontario government of ": null
    },
    {
        "Mitchell Hepburn": "mitchell hepburn"
    },
    {
        " and the government of Quebec. In 1936, ": null
    },
    {
        "John C. Beukema": "john c. beukema"
    },
    {
        ", head of the Great Lakes Harbors Association and a member of the Great Lakes Tidewater Commission, was among a delegation of eight from the Great Lakes states to meet at the White House with US President ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        " to obtain his support for the seaway concept.     Beukema and Saint Lawrence Seaway proponents were convinced a nautical link would lead to development of the communities and economies of the Great Lakes region by permitting the passage of oceangoing ships. In this period, exports of grain, along with other commodities, to Europe were an important part of the national economy. Negotiations on the treaty resumed in 1938, and by January 1940 substantial agreement was reached between Canada and the United States. By 1941, President Roosevelt and Prime Minister Mackenzie King made an executive agreement to build the joint hydro and navigation works, but this failed to receive the assent of the U.S. Congress. Proposals for the seaway were met with resistance; the primary opposition came from interests representing harbors on the Atlantic and Gulf coasts and internal waterways and from the railroad associations. The railroads carried freight and goods between the coastal ports and the Great Lakes cities.     After 1945, proposals to introduce tolls to the seaway were not sufficient to gain support for the project by the U.S. Congress. Growing impatient, and with Ontario desperate for the power to be generated by hydroelectricity, Canada began to consider developing the project alone. This seized the imagination of Canadians, engendering a groundswell of nationalism around the Saint Lawrence. Canadian Prime Minister ": null
    },
    {
        "Louis St. Laurent": "louis st. laurent"
    },
    {
        " advised U.S. President ": null
    },
    {
        "Harry S. Truman": "harry s. truman"
    },
    {
        " on September 28, 1951, that Canada was unwilling to wait for the United States and would build a seaway alone; the ": null
    },
    {
        "Canadian Parliament": "parliament of canada"
    },
    {
        " authorized the founding of the Saint Lawrence Seaway Authority on December 21 of that year. Fueled by this support, Saint Laurents administration decided during 1951 and 1952 to construct the waterway alone, combined with the ": null
    },
    {
        "Moses-Saunders Power Dam": "moses-saunders power dam"
    },
    {
        ".     The ": null
    },
    {
        "International Joint Commission": "international joint commission"
    },
    {
        " issued an order of approval for joint construction of the dam in October 1952. U.S. Senate debate on the bill began on January 12, 1953, and the bill emerged from the House of Representatives Committee of Public Works on February 22, 1954. It received approval by the Senate and the House by May 1954. The first positive action to enlarge the seaway was taken on May 13, 1954, when U.S. President ": null
    },
    {
        "Dwight D. Eisenhower": "dwight d. eisenhower"
    },
    {
        " signed the Wiley-Dondero Seaway Act  to authorize joint construction and establish the ": null
    },
    {
        "Saint Lawrence Seaway Development Corporation": "saint lawrence seaway development corporation"
    },
    {
        " as the U.S. authority. The need for cheap haulage of Quebec-Labrador iron ore was one of the arguments that finally swung the balance in favor of the seaway. Groundbreaking ceremonies took place in Massena, New York, on August 10, 1954. That year ": null
    },
    {
        "John C. Beukema": "john c. beukema"
    },
    {
        " was appointed by Eisenhower to the five-member ": null
    },
    {
        "St. Lawrence Seaway Advisory Board": "st. lawrence seaway advisory board"
    },
    {
        ".     In May 1957, the Connecting Channels Project was begun by the ": null
    },
    {
        "United States Army Corps of Engineers": "united states army corps of engineers"
    },
    {
        ". By 1959, Beukema was on board the U.S. Coast Guard cutter Maple for the first trip through the U.S. locks, which opened up the Great Lakes to oceangoing ships. On April 25, 1959,  large, deep-draft ocean vessels began streaming to the heart of the North American continent through the seaway, a project supported by every administration from ": null
    },
    {
        "Woodrow Wilson": "woodrow wilson"
    },
    {
        " through Eisenhower.     In the United States, Dr. ": null
    },
    {
        "N.R. Danelian": "n.r. danelian"
    },
    {
        " , worked with the ": null
    },
    {
        "U.S. Secretary of State": "u.s. secretary of state"
    },
    {
        " on Canadian-U.S. issues regarding the seaway, persevering through 15 years to gain passage by Congress of the ": null
    },
    {
        "Seaway Act": "seaway act"
    },
    {
        ". He later became president of the ": null
    },
    {
        "Great Lakes St. Lawrence Association": "great lakes st. lawrence association"
    },
    {
        " to promote seaway development to benefit the American heartland. The seaway was heavily promoted by the Eisenhower administration, who were concerned with the locus of control.     The seaway opened in 1959 and cost ": null
    },
    {
        "C$": "canadian dollar"
    },
    {
        "470 million, $336.2 million of which was paid by the Canadian government.  Queen ": null
    },
    {
        "Elizabeth II": "elizabeth ii"
    },
    {
        " and American President ": null
    },
    {
        "Dwight D. Eisenhower": "dwight d. eisenhower"
    },
    {
        " formally opened the seaway with a short cruise aboard the ": null
    },
    {
        "royal yacht": "royal yacht"
    },
    {
        "  after addressing crowds in ": null
    },
    {
        "Saint-Lambert, Quebec": "saint-lambert, quebec"
    },
    {
        ". 22,000 workers were employed at one time or another on the project, a 2,300-mile-long superhighway for ocean freighters. ": null
    },
    {
        "Port of Milwaukee": "port of milwaukee"
    },
    {
        " director Harry C. Brockel forecast just before the Seaway opened in 1959 that The St. Lawrence Seaway will be the greatest single development of this century in its effects on Milwaukees future growth and prosperity. Lester Olsen, president of the Milwaukee Association of Commerce, said, The magnitude and potential of the St. Lawrence Seaway and the power project stir the imagination of the world.     The seaways opening is often credited with making the ": null
    },
    {
        "Erie Canal": "erie canal"
    },
    {
        " obsolete and causing the severe economic decline of several cities along the canal in ": null
    },
    {
        "Upstate New York": "upstate new york"
    },
    {
        ". By the turn of the 20th century, the Erie Canal had been largely supplanted by the railroads, which had been constructed across New York and could carry freight more quickly and cheaply. Upstate New Yorks economic decline was precipitated by numerous factors, only some of which had to do with the Saint Lawrence Seaway.     Under the ": null
    },
    {
        "Canada Marine Act": "canada marine act"
    },
    {
        " , the Canadian portions of the seaway were set up with a ": null
    },
    {
        "non-profit corporate": "non-profit corporation"
    },
    {
        " structure; this legislation also introduced changes to federal ports.          Great Lakes and seaway shipping generates $3.4 billion in business revenue annually in the United States. In 2002, ships moved 222 million tons of cargo through the seaway. Overseas shipments, mostly of inbound steel and outbound grain, accounted for 15.4 million tons, or 6.9%, of the total cargo moved.  In 2004, seaway grain exports accounted for about 3.6% of U.S. overseas grain shipments, according to the U.S. Grains Council. In a typical year, seaway steel imports account for around 6% of the U.S. annual total. The toll revenue obtained from ocean vessels is about 25–30% of cargo revenue. The Port of ": null
    },
    {
        "Duluth": "duluth"
    },
    {
        " shipped just over 2.5 million metric tons of grain, which is less than the port typically moved in the decade before the seaway opened ": null
    },
    {
        "Lake Superior": "lake superior"
    },
    {
        " to deep-draft oceangoing vessels in 1959.     International changes have affected shipping through the seaway. Europe is no longer a major grain importer ; large U.S. export shipments are now going to South America, Asia, and Africa. These destinations make Gulf and West Coast ports more critical to 21st-century grain exports. Referring to the seaway project, a retired Iowa State University economics professor who specialized in transportation issues said, It probably did make sense, at about the time it was constructed and conceived, but since then everything has changed.     Certain seaway users have been concerned about the low water levels of the Great Lakes that have been recorded since 2010.                The ": null
    },
    {
        "Panama Canal": "panama canal"
    },
    {
        " was completed in 1914 and also serves oceangoing traffic. In the 1950s, seaway designers chose not to build the locks to match the size of ships permitted by the 1914 locks at the Panama Canal . Instead, the seaway locks were built to match the smaller locks of ": null
    },
    {
        "Welland Canal": "welland canal"
    },
    {
        ", which opened in 1932. The seaway locks permit passage of a ship  long by  feet wide .     The U.S. Army Corps of Engineers conducted a study to expand the Saint Lawrence Seaway, but the plan was scrapped in 2011 because of tight budgets. , California State University             There are seven ": null
    },
    {
        "locks": "lock"
    },
    {
        " in the Saint Lawrence River portion of the seaway. From downstream to upstream they are:      St. Lambert Lock—": null
    },
    {
        "Saint Lambert": "saint lambert, quebec"
    },
    {
        ", ": null
    },
    {
        "QC": "quebec"
    },
    {
        "   Côte Ste. Catherine Lock—": null
    },
    {
        "Sainte-Catherine": "sainte-catherine, quebec"
    },
    {
        ", QC   Beauharnois Locks —": null
    },
    {
        "Melocheville": "melocheville, quebec"
    },
    {
        ", QC, at  and    Snell Lock—": null
    },
    {
        "Massena": "massena , new york"
    },
    {
        ", ": null
    },
    {
        "NY": "new york"
    },
    {
        "   Eisenhower Lock": "eisenhower lock"
    },
    {
        "—": null
    },
    {
        "Massena": "massena , new york"
    },
    {
        ", NY   Iroquois Lock—": null
    },
    {
        "Iroquois": "south dundas, ontario"
    },
    {
        ", ": null
    },
    {
        "ON": "ontario"
    },
    {
        ", at      Water Level Elevations:   Lake Ontario is  above sea level.   The drop through Iroquois Lock is .   Lake St. Lawrence is  above sea level.   The drop through Eisenhower Lock is .   The Wiley-Dondero Canal is  above sea level.   The drop through Snell Lock is .   Lake St. Francis is  above sea level .   The drop through Upper Beauharnois Lock is .   The Beauharnois Canal is  above sea level.   The drop through Lower Beauharnois Lock is .   Lake St. Louis is  above sea level.   The drop through Côte Ste. Catherine Lock is .   Laprairie Basin is  above sea level.   The drop through St. Lambert Lock is .   The drop through the Lachine Rapids is a few feet.   Montreal Harbour is approximately  above sea level.       There are eight locks on the ": null
    },
    {
        "Welland Canal": "welland canal"
    },
    {
        ". From the north to the south, there is lock 1 at Port Weller, followed by Lock 2 and then Lock 3, a site with a visitors information centre and museum in ": null
    },
    {
        "St. Catharines, Ontario": "st. catharines, ontario"
    },
    {
        ". There are four locks in ": null
    },
    {
        "Thorold, Ontario": "thorold, ontario"
    },
    {
        ", including twin-flight locks 4, 5 and 6, with Lock 7 leading up to the main channel. The Lake Erie level control lock sits in ": null
    },
    {
        "Port Colborne, Ontario": "port colborne, ontario"
    },
    {
        ".        The size of vessels that can traverse the seaway is limited by the size of ": null
    },
    {
        "locks": "lock"
    },
    {
        ". Locks on the St. Lawrence and on the Welland Canal are  long,  wide, and  deep. The maximum allowed vessel size is slightly smaller:  long,  wide, and  deep. Many vessels designed for use on the Great Lakes following the opening of the seaway were built to the maximum size permissible by the locks, known informally as ": null
    },
    {
        "Seawaymax": "seawaymax"
    },
    {
        " or Seaway-Max. Large vessels of the ": null
    },
    {
        "lake freighter": "lake freighter"
    },
    {
        " fleet are built on the lakes and cannot travel downstream beyond the Welland Canal. On the remaining Great Lakes, these ships are constrained only by the largest lock on the ": null
    },
    {
        "Great Lakes Waterway": "great lakes waterway"
    },
    {
        ", the Poe Lock at the ": null
    },
    {
        "Soo Locks": "soo locks"
    },
    {
        " , which is  long,  wide and  deep.     A vessels ": null
    },
    {
        "draft": "draft"
    },
    {
        " is another obstacle to passage on the seaway, particularly in connecting waterways such as the Saint Lawrence River. The depth in the seaways channels is   downstream of ": null
    },
    {
        "Quebec City": "quebec city"
    },
    {
        ",  between Quebec City and ": null
    },
    {
        "Deschaillons": "deschaillons-sur-saint-laurent, quebec"
    },
    {
        ",  to Montreal, and  upstream of Montreal. Channel depths and limited lock sizes meant only 10% of current oceangoing ships, which have been built much larger than in the 1950s, can traverse the entire seaway. Proposals to expand the seaway, dating from as early as the 1960s, have been rejected since the late 20th century as too costly. In addition, researchers, policy makers, and the public are much more aware of the environmental issues that have accompanied seaway development and are reluctant to open the Great Lakes to more invasions of damaging species, as well as associated issues along the canals and river. Questions have been raised as to whether such infrastructure costs could ever be recovered. Lower water levels in the Great Lakes have also posed problems for some vessels in recent years, and pose greater issues to communities, industries, and agriculture in the region.     While the seaway is mostly used for shipping ": null
    },
    {
        "bulk cargo": "bulk cargo"
    },
    {
        ", the possibility of its use for large-scale ": null
    },
    {
        "container shipping": "containerization"
    },
    {
        " is under consideration as well. If the expansion project goes ahead, ": null
    },
    {
        "feeder ships": "feeder ship"
    },
    {
        "would take containers from the port of ": null
    },
    {
        "Oswego": "oswego, new york"
    },
    {
        " on Lake Ontario in upstate ": null
    },
    {
        "New York": "new york"
    },
    {
        " to ": null
    },
    {
        "Melford International Terminal": "melford international terminal"
    },
    {
        " in ": null
    },
    {
        "Nova Scotia": "nova scotia"
    },
    {
        " for transfer to larger oceangoing ships.  , Syracuse Post-Standard, October 22, 2008.     A website hosts measurements of wind, water, levels and water temperatures.  A real-time interactive map of seaway locks, vessels, and ports is available at.  The ": null
    },
    {
        "NOAA": "noaa"
    },
    {
        "-funded ": null
    },
    {
        "Great Lakes Water Level Dashboard": "great lakes water level dashboard"
    },
    {
        " compiles statistics on water depth at various points along the seaway. , accessed July 2014.       To create a navigable channel through the ": null
    },
    {
        "Long Sault": "long sault"
    },
    {
        " rapids and to allow ": null
    },
    {
        "hydroelectric": "hydroelectric"
    },
    {
        " stations to be established immediately upriver from ": null
    },
    {
        "Cornwall, Ontario": "cornwall, ontario"
    },
    {
        ", and ": null
    },
    {
        "Massena, New York": "massena , new york"
    },
    {
        ", Lake St. Lawrence was created behind a dam. This required the condemnation and acquisition by the government of all the properties of six villages and three hamlets in Ontario; these are now collectively known as ": null
    },
    {
        "The Lost Villages": "the lost villages"
    },
    {
        ".  The area was flooded on July 1, 1958, creating the lake. There was also inundation on the New York side of the border, and the village of Louisville Landing was submerged.     A notable adverse environmental effect of the operation of the seaway has been the introduction of numerous ": null
    },
    {
        "invasive species": "invasive species"
    },
    {
        " of aquatic animals into the ": null
    },
    {
        "Great Lakes Basin": "great lakes basin"
    },
    {
        ". The ": null
    },
    {
        "zebra mussel": "zebra mussel"
    },
    {
        " has been most damaging in the Great Lakes and through its invasion of related rivers, waterways, and city water facilities.     The seaway, along with the Saint Lawrence River it passes through, also provides opportunities for outdoor recreation, such as ": null
    },
    {
        "boating": "boating"
    },
    {
        ", ": null
    },
    {
        "camping": "camping"
    },
    {
        ", ": null
    },
    {
        "fishing": "fishing"
    },
    {
        ", and ": null
    },
    {
        "scuba diving": "scuba diving"
    },
    {
        ". Invasive species and artificial water level controls imposed by the seaway have had a negative impact on recreational fishing.  Of note, the Old Power House near Lock 23 became an attractive site for scuba divers. The submerged stone building has become covered with barnacles and is home to an abundance of underwater life.      The seaway passes through the Saint Lawrence River, which provides a number of divable ": null
    },
    {
        "shipwrecks": "shipwreck"
    },
    {
        "within recreational scuba limits . The region also offers technical diving, with some wrecks lying at . The water temperature can be as warm as  during the mid- to late summer months. The first  of Lake Ontario is warmed and enters the Saint Lawrence River, as the fast-moving water body has no ": null
    },
    {
        "thermocline": "thermocline"
    },
    {
        " circulation.     On July 12, 2010, Richelieu  ran aground after losing power near the Côte-Sainte-Catherine lock. The grounding punctured a fuel tank, spilling an estimated 200  tonnes of ": null
    },
    {
        "diesel fuel": "diesel fuel"
    },
    {
        ", covering approximately 500  m 2 . The seaway and lock were shut down to help contain the spill.        The seaway is important for American and Canadian international trade. It handles 40–50 million annual tons of cargo. About 50% of this cargo carried travels to and from international ports in ": null
    },
    {
        "Europe": "europe"
    },
    {
        ", the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        ", and ": null
    },
    {
        "Africa": "africa"
    },
    {
        ". The rest comprises coastal trade, or ": null
    },
    {
        "short sea shipping": "short sea shipping"
    },
    {
        ", between various American and Canadian ports.  Among international shippers are found:   ": null
    },
    {
        "Polsteam": "polsteam"
    },
    {
        ", which maintains a fleet of dry-bulk only vessels that transit every two weeks from the Dutch town of ": null
    },
    {
        "IJmuiden": "ijmuiden"
    },
    {
        " to ": null
    },
    {
        "Duluth, Minnesota": "duluth, minnesota"
    },
    {
        " Fednav Group": "fednav group"
    },
    {
        ", a private  international dry-bulk only ocean transportation group, with routes between the ": null
    },
    {
        "Port of Antwerp": "port of antwerp"
    },
    {
        " and ": null
    },
    {
        "Sorel, Quebec": "sorel, quebec"
    },
    {
        ", even in wintertime    ": null
    },
    {
        "World Shipping": "world shipping"
    },
    {
        " Inc., a privately owned  global logistics operation    ": null
    },
    {
        "Canfornav": "canfornav"
    },
    {
        ", a subsidiary of ": null
    },
    {
        "Canfor": "canfor"
    },
    {
        ",  which does dry bulk only and registers most of its vessels in ": null
    },
    {
        "Cyprus": "cyprus"
    },
    {
        " American Steamship Company": "american steamship company"
    },
    {
        ", a subsidiary of the ": null
    },
    {
        "General American Transportation Corporation": "general american transportation corporation"
    },
    {
        "    Rand Logistics": "rand logistics"
    },
    {
        ", which was formed from the acquisition of Lower Lakes Towing Ltd,  and does not ship containers   ": null
    },
    {
        "McKeil Marine": "mckeil marine"
    },
    {
        ", headquartered in Hamilton, which provides service to Arctic ports    ": null
    },
    {
        "Groupe Desgagnés": "groupe desgagnés"
    },
    {
        ",    The ": null
    },
    {
        "Port of Montreal": "port of montreal"
    },
    {
        " is the site of operations of   ": null
    },
    {
        "Maersk Line": "maersk line"
    },
    {
        ", a unit of the ": null
    },
    {
        "A.P. Moller-Maersk Group": "a.p. moller-maersk group"
    },
    {
        " Mediterranean Shipping Company": "mediterranean shipping company"
    },
    {
        " Compagnie Maritime dAffrètement / Compagnie Generale Maritime": "cma cgm"
    },
    {
        ", a French transshipper   ": null
    },
    {
        "Hapag-Lloyd": "hapag-lloyd"
    },
    {
        " acquired the Port of Montreal docks of, along with the rest of, ": null
    },
    {
        "CP Ships": "cp ships"
    },
    {
        " in 2005   ": null
    },
    {
        "Orient Overseas Container Line": "orient overseas container line"
    },
    {
        ", a Hong Kong–based multinational   ": null
    },
    {
        "Arrimage Quebec": "arrimage quebec"
    },
    {
        ", which has ": null
    },
    {
        "stevedoring": "stevedoring"
    },
    {
        " operations in ": null
    },
    {
        "Baie-Comeau": "baie-comeau"
    },
    {
        ", ": null
    },
    {
        "Becancour": "bécancour, quebec"
    },
    {
        ", ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        ", ": null
    },
    {
        "Cote-Sainte-Catherine": "montreal"
    },
    {
        ", ": null
    },
    {
        "Gaspe": "gaspé, quebec"
    },
    {
        ", ": null
    },
    {
        "Gros-Cacouna": "cacouna, quebec"
    },
    {
        ", ": null
    },
    {
        "Hamilton": "hamilton, ontario"
    },
    {
        ", ": null
    },
    {
        "Matane": "matane"
    },
    {
        ", ": null
    },
    {
        "Oshawa": "oshawa"
    },
    {
        ", ": null
    },
    {
        "Pointe-au-Pic": "pointe-au-pic"
    },
    {
        ", ": null
    },
    {
        "Port Colborne": "port colborne"
    },
    {
        ", ": null
    },
    {
        "Portneuf": "portneuf, quebec"
    },
    {
        ", ": null
    },
    {
        "Quebec": "quebec"
    },
    {
        ", ": null
    },
    {
        "Rimouski": "rimouski"
    },
    {
        ", ": null
    },
    {
        "Saguenay": "saguenay, quebec"
    },
    {
        ", ": null
    },
    {
        "Sept-Iles": "sept-îles, quebec"
    },
    {
        ", ": null
    },
    {
        "Sorel-Tracy": "sorel-tracy"
    },
    {
        ", ": null
    },
    {
        "St. Catharines": "st. catharines"
    },
    {
        ", and other ports in the Maritime provinces of Canada.      The Saint Lawrence Seaway is the main route for Ontario grain exports to overseas markets.  Its fees are publicly known, and were limited in 2013 to an increase of 3%.  A trained pilot is required for any foreign trade vessel.  A set of rules and regulations are available to help transit.      Commercial vessel transit information is hosted on the U.S. ": null
    },
    {
        "Saint Lawrence Seaway Development Corporation": "saint lawrence seaway development corporation"
    },
    {
        " website.     Since 1997, international cruise liners have been known to transit the seaway. The ": null
    },
    {
        "Hapag-Lloyd": "hapag-lloyd"
    },
    {
        " Christopher Columbus carried 400 passengers to ": null
    },
    {
        "Duluth, Minnesota": "duluth, minnesota"
    },
    {
        ", that year. Since then, the number of annual seaway cruising passengers has increased to 14,000. , p. 1, Seaway, US Dept. of Transportation     Every year, more than 2,000 recreational boats, of more than 20  ft and one ton, transit the seaway.  The tolls have been fixed for 2017 at $30 per lock. There is a $5 per lock discount for payment in advance.  Lockages are scheduled 12 hours a day between the hours of 07:00 and 19:00 from June 15 to September 15.      A list of organisations that serve the seaway in some fashion, such as chambers of commerce and municipal or port authorities, is available at the SLSDC website. A 56-page electronic Great Lakes St. Lawrence Seaway System Directory is published by Harbor House Publishers.        Map of the North American Great Lakes and the Saint Lawrence Seaway from 1959, depicting the entire length beginning at the Gulf of Saint Lawrence in the east to the western-most terminus at Lake Superior.      ": null
    }
]