[
    {
        "           Hector Hugh Munro , better known by the ": null
    },
    {
        "pen name": "Pen Name"
    },
    {
        " Saki and also frequently as H. H. Munro, was a British writer whose witty, mischievous and sometimes ": null
    },
    {
        "macabre": "Macabre"
    },
    {
        " stories satirize ": null
    },
    {
        "Edwardian": "Edwardian Era"
    },
    {
        " society and culture. He is considered a master of the ": null
    },
    {
        "short story": "Short Story"
    },
    {
        ", and often compared to ": null
    },
    {
        "O. Henry": "O. Henry"
    },
    {
        " and ": null
    },
    {
        "Dorothy Parker": "Dorothy Parker"
    },
    {
        ". Influenced by ": null
    },
    {
        "Oscar Wilde": "Oscar Wilde"
    },
    {
        ", ": null
    },
    {
        "Lewis Carroll": "Lewis Carroll"
    },
    {
        " and ": null
    },
    {
        "Rudyard Kipling": "Rudyard Kipling"
    },
    {
        ", he himself influenced ": null
    },
    {
        "A. A. Milne": "A. A. Milne"
    },
    {
        ", ": null
    },
    {
        "Noël Coward": "Noël Coward"
    },
    {
        " and ": null
    },
    {
        "P. G. Wodehouse": "P. G. Wodehouse"
    },
    {
        ".     Besides his short stories , he wrote a full-length play,  The Watched Pot , in collaboration with Charles Maude; two one-act plays; a historical study, The Rise of the Russian Empire ; a short novel, The Unbearable Bassington; the ": null
    },
    {
        "episodic": "Serial"
    },
    {
        "  The Westminster Alice  ; and  When William Came , subtitled A Story of London Under the Hohenzollern s, a fantasy about a ": null
    },
    {
        "future German invasion": "Invasion Literature"
    },
    {
        " and occupation of Britain.           Hector Hugh Munro was born in ": null
    },
    {
        "Akyab": "Akyab"
    },
    {
        ", ": null
    },
    {
        "British Burma": "British Burma"
    },
    {
        ", which was then still part of ": null
    },
    {
        "British India": "British India"
    },
    {
        ", and was governed from ": null
    },
    {
        "Calcutta": "Kolkata"
    },
    {
        ", under the authority of the ": null
    },
    {
        "Viceroy of India": "Viceroy Of India"
    },
    {
        ". Saki was the son of Charles Augustus Munro, an Inspector General for the ": null
    },
    {
        "Indian Imperial Police": "Indian Imperial Police"
    },
    {
        ", and his wife, Mary Frances Mercer , the daughter of Rear Admiral Samuel Mercer. Her nephew Cecil William Mercer later became a well-known novelist, under the name of ": null
    },
    {
        "Dornford Yates": "Dornford Yates"
    },
    {
        ".     In 1872, on a home visit to England, Mary Munro was charged by a cow, and the shock caused her to miscarry. She never recovered and soon died.  , extract at AJLangguth.com     After his wifes death Charles Munro sent his children, including two-year-old Hector, home to England. The children were sent to Broadgate Villa, in ": null
    },
    {
        "Pilton": "Pilton, Devon"
    },
    {
        " village near ": null
    },
    {
        "Barnstaple": "Barnstaple"
    },
    {
        ", North Devon, to be raised by their grandmother and paternal maiden aunts Charlotte and Augusta in a strict and puritanical household. It is said that his aunts were most likely models for some of his characters, notably the aunt in The Lumber Room and the guardian in Sredni Vashtar: Munros sister Ethel said that the aunt in The Lumber Room was an almost perfect portrait of Aunt Augusta. Munro and his siblings led slightly insular lives during their early years and were educated by governesses. At the age of 12 the young Hector Munro was educated at Pencarwick School in ": null
    },
    {
        "Exmouth": "Exmouth, Devon"
    },
    {
        " and then as a boarder at ": null
    },
    {
        "Bedford School": "Bedford School"
    },
    {
        ".     In 1887, after his retirement, his father returned from Burma and embarked upon a series of European travels with Hector and his siblings.     Hector followed his father in 1893 into the Indian Imperial Police and was posted to ": null
    },
    {
        "Burma": "Burma"
    },
    {
        ", but successive bouts of fever caused his return home after only fifteen months.         In 1896, he decided to move to London to make a living as a writer.     Munro started his writing career as a journalist for newspapers such as the  Westminster Gazette , the  Daily Express , the  Morning Post , and magazines such as the  Bystander  and Outlook. His first book The Rise of the Russian Empire, a historical study modeled upon ": null
    },
    {
        "Edward Gibbons": "Edward Gibbon"
    },
    {
        "  The Decline and Fall of the Roman Empire , appeared in 1900, under his real name, but proved to be something of a false start.     While writing The Rise of the Russian Empire, he made his first foray into short story writing and published a piece called Dogged in St Pauls in February 1899. He then moved into the world of political satire in 1900 with a collaboration with ": null
    },
    {
        "Francis Carruthers Gould": "Francis Carruthers Gould"
    },
    {
        " entitled Alice in Westminster . Gould produced the sketches, and Munro wrote the text accompanying them, using the pen-name Saki for the first time. The series lampooned political figures of the day , and was published in the Liberal Westminster Gazette.     In 1902 he moved to The Morning Post, described as one of the organs of intransigence by ": null
    },
    {
        "Stephen Koss": "Stephen Koss"
    },
    {
        ",  to work as a foreign correspondent, first in the Balkans, and then in Russia, where he was witness to the 1905 revolution in St Petersburg. He then went on to Paris, before returning to London in 1908, where the agreeable life of a man of letters with a brilliant reputation awaited him.  In the intervening period Reginald had been published in 1904, the stories having first appeared in the Westminster Gazette, and all this time he was writing sketches for the Morning Post, the Bystander, and the Westminster Gazette. He kept a place in Mortimer Street, wrote, played bridge at the Cocoa Tree Club, and lived simply. Reginald in Russia appeared in 1910, and The Chronicles of Clovis was published in 1911, and Beasts and Super-Beasts in 1914, along with many other short stories that appeared in newspapers not published in collections in his lifetime.     He also produced two novels, The Unbearable Bassington and When William Came .       At the start of the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        " Munro was 43 and officially over-age to enlist, but he refused a commission and joined the ": null
    },
    {
        "2nd King Edwards Horse": "King Edwards Horse"
    },
    {
        " as an ordinary trooper. He later transferred to the 22nd Battalion of the ": null
    },
    {
        "Royal Fusiliers": "Royal Fusiliers"
    },
    {
        ", in which he rose to the rank of ": null
    },
    {
        "lance sergeant": "Lance Sergeant"
    },
    {
        ". More than once he returned to the battlefield when officially still too sick or injured. In November 1916 he was sheltering in a shell crater near ": null
    },
    {
        "Beaumont-Hamel": "Beaumont-Hamel"
    },
    {
        ", France, during the ": null
    },
    {
        "Battle of the Ancre": "Battle Of The Ancre"
    },
    {
        ", when he was killed by a German ": null
    },
    {
        "sniper": "Sniper"
    },
    {
        ". According to several sources, his last words were Put that bloody cigarette out! The Square Egg , p. 102     Munro has no known grave. He is commemorated on Pier and Face 8C 9A and 16A of the ": null
    },
    {
        "Thiepval Memorial": "Thiepval Memorial"
    },
    {
        ".      In 2003 ": null
    },
    {
        "English Heritage": "English Heritage"
    },
    {
        " marked Munros flat at 97 Mortimer Street, in ": null
    },
    {
        "Fitzrovia": "Fitzrovia"
    },
    {
        " with a ": null
    },
    {
        "blue plaque": "Blue Plaque"
    },
    {
        ".      After his death his sister Ethel ": null
    },
    {
        "destroyed": "Book Burning"
    },
    {
        " most of his papers and wrote her own account of their childhood, which appeared at the beginning of The Square Egg and Other Sketches . ": null
    },
    {
        "Rothay Reynolds": "Rothay Reynolds"
    },
    {
        ", a close friend, wrote a relatively lengthy memoir in The Toys of Peace , but aside from this, the only other biographies of Munro are Saki: A Life of Hector Hugh Munro by ": null
    },
    {
        "A. J. Langguth": "A. J. Langguth"
    },
    {
        ", and The Unbearable Saki by Sandie Byrne. All later biographies have had to draw heavily upon Ethels account of her brothers life.          Munro was ": null
    },
    {
        "homosexual": "Homosexuality"
    },
    {
        " at a time when in Britain sexual activity between men was a crime. The ": null
    },
    {
        "Cleveland Street scandal": "Cleveland Street Scandal"
    },
    {
        " , followed by ": null
    },
    {
        "the downfall of Oscar Wilde": "Oscar Wildetrial, Imprisonment, And Transfer To Reading Gaol"
    },
    {
        " , meant that side of life had to be secret .        The pen name Saki is most commonly assumed to be a reference to the cupbearer in the  Rubáiyát of Omar Khayyam . Both Rothay Reynolds and Ethel Munro confirm this.     This reference is stated as fact by ": null
    },
    {
        "Emlyn Williams": "Emlyn Williams"
    },
    {
        " in his introduction to a Saki anthology published in 1978. Saki: Short Stories I  Williams cites ": null
    },
    {
        "Rothay Reynolds": "Rothay Reynolds"
    },
    {
        ", his friend . However, Saki may also or instead be a reference to the South American ": null
    },
    {
        "monkey of that name": "Saki Monkey"
    },
    {
        ", which at least two commentators, ": null
    },
    {
        "Tom Sharpe": "Tom Sharpe"
    },
    {
        " and ": null
    },
    {
        "Will Self": "Will Self"
    },
    {
        ", have connected to the small, long-tailed monkey from the Western Hemisphere that is a central character in ": null
    },
    {
        " The Remoulding of Groby Lington ": "S:The Remoulding Of Groby Lington"
    },
    {
        ".        Much of Sakis work contrasts the conventions and hypocrisies of Edwardian England with the ruthless but straightforward life-and-death struggles of nature.  Writing in  The Guardian  to mark the centenary of Sakis death, Stephen Moss noted, In many of his stories, stuffy authority figures are set against forces of nature – polecats, hyenas, tigers. Even if they are not eaten, the humans rarely have the best of it .        The Interlopers is a story about two men, Georg Znaeym and Ulrich von Gradwitz, whose families have fought over a forest in the eastern ": null
    },
    {
        "Carpathian Mountains": "Carpathian Mountains"
    },
    {
        " for generations. Ulrichs family legally owns the land, and so considers Georg an interloper when he hunts in the forest. But Georg, believing that the forest rightfully belongs to his family, hunts there often and believes that Ulrich is the real interloper for trying to stop him. One winter night, Ulrich catches Georg hunting in the forest. Neither man can shoot the other without warning, as they would soil their family’s honor, so they hesitate to acknowledge one another. In an act of God , a tree branch suddenly falls on each of them, trapping them both under a log. Gradually they realize the futility of their quarrel, become friends and end the feud. They then call out for their men’s assistance and, after a brief period, Ulrich makes out nine or ten figures approaching over a hill. The story ends with Ulrich’s realization that the approaching figures on the hill are actually hungry wolves. The wolves, it seems, are the true owners of the forest, while both humans are interlopers.       Gabriel-Ernest starts with a warning: There is a wild beast in your woods … Gabriel, a naked boy sunbathing by the river, is adopted by well-meaning Townspeople. Lovely and charming, but also rather vague and distant, he seems bemused by his benefactors. Asked how he managed by himself in the woods, he replies that he hunts on four legs, which they take to mean that he has a dog. The climax comes when a small child disappears while walking home from Sunday school. A pursuit ensues, but Gabriel and the child disappear near a river. The only items found are Gabriels clothes, and the two are never seen again. The story includes many of the authors favorite themes: good intentions gone awry, the banality of polite society, the attraction of the sinister, and the allure of the wild and the forbidden. There is also a recognition of basic decency, upheld when the story’s protagonist ‘flatly refuses’ to subscribe to a Gabriel-Ernst memorial, for his supposedly gallant attempt to save a drowning child, and tragically drowning himself, as well. He realises that Gabriel-Ernst was actually a ": null
    },
    {
        "werewolf": "Werewolf"
    },
    {
        ", who had eaten the child, then run off.       At a railway station an arrogant and overbearing woman, Mrs Quabarl, mistakes the mischievous Lady Carlotta, who has been inadvertently left behind by a train, for the ": null
    },
    {
        "governess": "Governess"
    },
    {
        ", Miss Hope, whom she has been expecting, Miss Hope having erred about the date of her arrival. Lady Carlotta decides not to correct the mistake, acknowledges herself as Miss Hope, a proponent of the Schartz-Metterklume method of making children understand history by acting it out themselves, and chooses the ": null
    },
    {
        "Rape of the Sabine Women": "Rape Of The Sabine Women"
    },
    {
        " as the first lesson. After creating chaos for two days, she departs, explaining that her delayed luggage will include a ": null
    },
    {
        "leopard": "Leopard"
    },
    {
        " cub.       Preferring not to give her young sons toy soldiers or guns, and having taken away their toy depicting the ": null
    },
    {
        "Siege of Adrianople": "Siege Of Adrianople"
    },
    {
        ", Eleanor instructs her brother Harvey to give them innovative peace toys as an Easter present. When the packages are opened young Bertie shouts Its a fort! and is disappointed when his uncle replies Its a municipal dustbin. The boys are initially baffled as to how to obtain any enjoyment from models of a school of art and a public library, or from little figures of ": null
    },
    {
        "John Stuart Mill": "John Stuart Mill"
    },
    {
        ", ": null
    },
    {
        "Felicia Hemans": "Felicia Hemans"
    },
    {
        " and Sir ": null
    },
    {
        "John Herschel": "John Herschel"
    },
    {
        ". Youthful inventiveness finds a way, however, as the boys combine their history lessons on Louis XIV with a lurid and violent play-story about the invasion of Britain and the storming of the ": null
    },
    {
        "Young Womens Christian Association": "Young Womens Christian Association"
    },
    {
        ". The end of the story has Harvey reporting failure to Eleanor, explaining We have begun too late. , not realising he was doomed to failure whenever he had begun.       An aunt is travelling by train with her two nieces and a nephew. The children are inquisitive and mischievous. A bachelor is also travelling in the same compartment. The aunt starts telling a moralistic story, but is unable to satisfy the childrens curiosity. The bachelor butts in and tells a story in which a good person ends up being devoured by a wolf, to the childrens delight. The bachelor is amused by the thought that in the future the children will embarrass their guardian by begging to be told an improper story.       Framton Nuttel, a nervous man, has come to stay in the country for his health. His sister, who thinks he should socialise while he is there, has given him letters of introduction to families in the neighbourhood whom she got to know when she was staying there a few years previously. Framton goes to visit Mrs Sappleton and, while he is waiting for her to come down, is entertained by her fifteen-year-old, witty niece. The niece tells him that the French window is kept open, even though it is October, because Mrs Sappleton believes that her husband and her brothers, who were drowned in a bog three years before, will come back one day. When Mrs Sappleton comes down she talks about her husband and her brothers, and how they are going to come back from shooting soon, and Framton, believing that she is deranged, tries to distract her by talking about his health. Then, to his horror, Mrs Sappleton points out that her husband and her brothers are coming, and he sees them walking towards the window with their dog. He thinks he is seeing ghosts and runs away. Mrs Sappleton cannot understand why he has run away and, when her husband and her brothers come in, she tells them about the odd man who has just left. The niece explains that Framton Nuttel ran away because of the spaniel: he is afraid of dogs since he was hunted by a pack of stray dogs in India and had to spend a night in the newly dug grave with creatures grinning and foaming just above him. The last line summarizes the story, saying of the niece, Romance at short notice was her speciality.       Sakis recurring hero Clovis Sangrail, a clever, mischievous young man, overhears the complacent middle-aged Huddle complaining of his own addiction to routine and aversion to change. Huddles friend makes the wry suggestion that he needs an unrest-cure , to be performed, if possible, in the home. Clovis takes it upon himself to help the man and his sister by involving them in an invented outrage that will be a blot on the twentieth century .          A baroness tells Clovis a story about a hyena that she and her friend Constance encountered while out fox hunting. Later, the hyena follows them, stopping briefly to eat a gypsy child. Shortly after this, the hyena is killed by a motorcar. The baroness immediately claims the corpse as her beloved dog Esmé, and the guilty owner of the car gets his chauffeur to bury the animal and later sends her a diamond brooch to make up for her loss. Saki, , at eastoftheweb.com, accessed 2 July 2017     ": null
    },
    {
        "Sredni Vashtar": "Sredni Vashtar"
    },
    {
        " Tobermory ": null
    },
    {
        "Henley": "Henley Royal Regatta"
    },
    {
        " and would have to be indefinitely postponed, could hardly have felt more crestfallen than Cornelius Appin at the reception of his wonderful achievement. Appin is killed shortly afterwards when attempting to teach an ": null
    },
    {
        "elephant": "Elephant"
    },
    {
        " in a ": null
    },
    {
        "zoo": "Zoo"
    },
    {
        " in ": null
    },
    {
        "Dresden": "Dresden"
    },
    {
        " to speak German.   His fellow house party guest, Clovis Sangrail remarks callously that if he was teaching the poor beast irregular German verbs, he deserved no pity.       Tom Yorkfield, a farmer, receives a visit from his half-brother Laurence. Tom has no great liking for Laurence or respect for his profession as a painter of animals. Tom shows Laurence his prize bull and expects him to be impressed, but Laurence nonchalantly tells Tom that he has sold a painting of a different bull, which Tom has seen and does not like, for three hundred pounds. Tom is angry that a mere picture of a bull should be worth more than his real bull. This and Laurences condescending attitude give him the urge to strike him. Laurence, running away across the field, is attacked by the bull, but is saved by Tom from serious injury. Tom, looking after Laurence as he recovers, feels no more rancour because he knows that, however valuable Laurences painting might be, only a real bull like his can attack someone.       This is a rediscovered short story that was previously cited as a play. Perhaps because of its subtitle: A Tragedy in the Manner of the Discursive Dramatists . It was included only in later printings of The Complete Short Stories of Saki A house party is beset by a fire in the middle of the night in the east wing of the house. Begged by their hostess to save my poor darling Eva – Eva of the golden hair, Lucien demurs, on the grounds that he has never even met her. It is only on discovering that Eva is not a flesh-and-blood daughter but Mrs Gramplains painting of the daughter she wished that she had had, and which she has faithfully updated with the passing years, that Lucien declares a willingness to forfeit his life to rescue her, since death in this case is more beautiful, a sentiment endorsed by the Major. As the two men disappear into the blaze, Mrs Gramplain recollects that she sent Eva to Exeter to be cleaned . The two men have lost their lives for nothing.         1899 Dogged    1900 The Rise of the Russian Empire   1902 The Woman Who Never Should    1902 The Not So Stories    1902  The Westminster Alice     1904 Reginald   1910 Reginald in Russia   1912 The Chronicles of Clovis   1912 The Unbearable Bassington   1913  When William Came    1914  Beasts and Super-Beasts    1914 The East Wing      Posthumous publications:   1919 The Toys of Peace   1924 The Square Egg and Other Sketches   1924 ": null
    },
    {
        "The Watched Pot": "The Watched Pot"
    },
    {
        "   1926-27 The Works of Saki   1930 The Complete Short Stories of Saki The Complete Novels and Plays of Saki    1934 The Miracle-Merchant    1950 The Best of Saki    1963 The Bodley Head Saki The Complete Saki Short Stories    1981 six previously uncollected stories in Saki, a biography by ": null
    },
    {
        "A. J. Langguth": "A. J. Langguth"
    },
    {
        " Saki: The Complete Saki,   The Secret Sin of Septimus Brope, and Other Stories A Shot in the Dark   2010 Improper Stories, ": null
    },
    {
        "Daunt Books": "Daunt Books"
    },
    {
        "   2016 Alice Wants To Know .       The 5th broadcast of ": null
    },
    {
        "Orson Welles": "Orson Welles"
    },
    {
        " series for ": null
    },
    {
        "CBS Radio": "Cbs Radio"
    },
    {
        ",  The Mercury Theatre on the Air , from 8 August 1938, dramatizes three short stories rather than one long story. The second of the three stories is The Open Window.       A dramatisation of The Schartz-Metterklume Method was an episode in the series  Alfred Hitchcock Presents  in 1960.     Saki: The Improper Stories of H. H. Munro was an eight-part series produced by ": null
    },
    {
        "Philip Mackie": "Philip Mackie"
    },
    {
        " for ": null
    },
    {
        "Granada Television": "Granada Television"
    },
    {
        " in 1962. Actors involved included ": null
    },
    {
        "Mark Burns": "Mark Burns"
    },
    {
        " as Clovis, ": null
    },
    {
        "Fenella Fielding": "Fenella Fielding"
    },
    {
        " as Mary Drakmanton, ": null
    },
    {
        "Heather Chasen": "Heather Chasen"
    },
    {
        " as Agnes Huddle, ": null
    },
    {
        "Richard Vernon": "Richard Vernon"
    },
    {
        " as the Major, ": null
    },
    {
        "Rosamund Greenwood": "Rosamund Greenwood"
    },
    {
        " as Veronique and ": null
    },
    {
        "Martita Hunt": "Martita Hunt"
    },
    {
        " as Lady Bastable.     Who Killed Mrs De Ropp?, a ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " TV production in 2007, starring ": null
    },
    {
        "Ben Daniels": "Ben Daniels"
    },
    {
        " and ": null
    },
    {
        "Gemma Jones": "Gemma Jones"
    },
    {
        ", showcased three of Sakis short stories, The Storyteller , The Lumber Room and ": null
    },
    {
        "Sredni Vashtar": "Sredni Vashtar"
    },
    {
        " .        The Playboy of the Week-End World by ": null
    },
    {
        "Emlyn Williams": "Emlyn Williams"
    },
    {
        ", adapts 16 of Sakis stories.   Wolves at the Window by Toby Davies, adapts 12 of Sakis stories.    Saki Shorts is a musical based on nine stories by Saki, with music, book and lyrics by John Gould and Dominic McChesney.   Miracles At Short Notice by James Lark is another musical based on short stories by Saki.    Life According to Saki by ": null
    },
    {
        "Katherine Rundell": "Katherine Rundell"
    },
    {
        " is a play inspired by the life and work of Saki. ": null
    }
]