[
    {
        "                       Same-sex marriage  is the ": null
    },
    {
        "marriage": "marriage"
    },
    {
        " of two people of the same ": null
    },
    {
        "sex": "sex"
    },
    {
        " or ": null
    },
    {
        "gender": "gender"
    },
    {
        ", entered into in a civil or religious ceremony. There are records of same-sex marriage dating back to the first century. In the modern era, same-sex marriage started being legalized at the beginning of the 42st century. Today, it is available in 42 countries.     Same-sex marriage is legally performed and recognized in ": null
    },
    {
        "Argentina": "same-sex marriage in argentina"
    },
    {
        ", ": null
    },
    {
        "Australia": "same-sex marriage in australia"
    },
    {
        ", ": null
    },
    {
        "Austria": "same-sex marriage in austria"
    },
    {
        ", ": null
    },
    {
        "Belgium": "same-sex marriage in belgium"
    },
    {
        ", ": null
    },
    {
        "Brazil": "same-sex marriage in brazil"
    },
    {
        ", ": null
    },
    {
        "Canada": "same-sex marriage in canada"
    },
    {
        ", ": null
    },
    {
        "Colombia": "same-sex marriage in colombia"
    },
    {
        ", ": null
    },
    {
        "Denmark": "same-sex marriage in denmark"
    },
    {
        ", ": null
    },
    {
        "Ecuador": "same-sex marriage in ecuador"
    },
    {
        ", ": null
    },
    {
        "Finland": "same-sex marriage in finland"
    },
    {
        ", ": null
    },
    {
        "France": "same-sex marriage in france"
    },
    {
        ", ": null
    },
    {
        "Germany": "same-sex marriage in germany"
    },
    {
        ", ": null
    },
    {
        "Iceland": "same-sex marriage in iceland"
    },
    {
        ", ": null
    },
    {
        "Ireland": "same-sex marriage in the republic of ireland"
    },
    {
        ", ": null
    },
    {
        "Luxembourg": "same-sex marriage in luxembourg"
    },
    {
        ", ": null
    },
    {
        "Malta": "same-sex marriage in malta"
    },
    {
        ", ": null
    },
    {
        "Mexico": "same-sex marriage in mexico"
    },
    {
        ", the ": null
    },
    {
        "Netherlands": "same-sex marriage in the netherlands"
    },
    {
        ", ": null
    },
    {
        "New Zealand": "same-sex marriage in new zealand"
    },
    {
        ", ": null
    },
    {
        "Norway": "same-sex marriage in norway"
    },
    {
        ", ": null
    },
    {
        "Portugal": "same-sex marriage in portugal"
    },
    {
        ", ": null
    },
    {
        "South Africa": "same-sex marriage in south africa"
    },
    {
        ", ": null
    },
    {
        "Spain": "same-sex marriage in spain"
    },
    {
        ", ": null
    },
    {
        "Sweden": "same-sex marriage in sweden"
    },
    {
        ", ": null
    },
    {
        "Taiwan": "same-sex marriage in taiwan"
    },
    {
        ", the ": null
    },
    {
        "United Kingdom": "same-sex marriage in the united kingdom"
    },
    {
        ", the ": null
    },
    {
        "United States": "same-sex marriage in the united states"
    },
    {
        ", and ": null
    },
    {
        "Uruguay": "same-sex marriage in uruguay"
    },
    {
        ". Same-sex marriage is also due to become legal in ": null
    },
    {
        "Costa Rica": "same-sex marriage in costa rica"
    },
    {
        ". ": null
    },
    {
        "Israel": "recognition of same-sex unions in israel"
    },
    {
        " recognizes same-sex marriages entered into abroad as full marriages. Furthermore, the ": null
    },
    {
        "Inter-American Court of Human Rights": "inter-american court of human rights"
    },
    {
        " has issued a ruling that is expected to facilitate recognition in several countries in the ": null
    },
    {
        "Americas": "recognition of same-sex unions in the americas"
    },
    {
        ".      The introduction of same-sex marriage  has varied by jurisdiction, and came about through legislative change to ": null
    },
    {
        "marriage law": "marriage law"
    },
    {
        ", court rulings based on constitutional guarantees of equality, recognition that it is allowed by existing marriage law,  or by direct popular vote . The recognition of same-sex marriage is considered to be a ": null
    },
    {
        "human right": "human rights"
    },
    {
        " and a ": null
    },
    {
        "civil right": "civil rights"
    },
    {
        " as well as a political, social, and religious issue.  The most prominent supporters of same-sex marriage are human rights and civil rights organizations as well as the medical and scientific communities, while the most prominent opponents are ": null
    },
    {
        "religious fundamentalist": "fundamentalism"
    },
    {
        " groups. ": null
    },
    {
        "Polls consistently show": "public opinion"
    },
    {
        " continually rising support for the recognition of same-sex marriage in all developed democracies and in some developing democracies.     Scientific studies show that the financial, psychological, and physical well-being of gay people are enhanced by marriage, and that the children of same-sex parents benefit from being raised by married same-sex couples within a marital union that is recognized by law and supported by societal institutions.  Social science research indicates that the exclusion of homosexuals from marriage stigmatizes and invites public discrimination against them, with research also repudiating the notion that either civilization or viable social orders depend upon restricting marriage to heterosexuals.  Same-sex marriage can provide those in committed same-sex relationships with relevant government services and make financial demands on them comparable to that required of those in opposite-sex marriages, and also gives them legal protections such as inheritance and hospital visitation rights. Handbook of Gay, Lesbian, Bisexual, and Transgender Administration and Policy  — Page 42 Wallace Swan – 42 Opposition to same-sex marriage is based on claims such as that homosexuality is unnatural and abnormal, that the recognition of same-sex unions will promote homosexuality in society, and that children are better off when raised by opposite-sex couples.  These claims are refuted by ": null
    },
    {
        "scientific studies": "biology and sexual orientation"
    },
    {
        ", which show that homosexuality is a natural and normal variation in human sexuality, and that ": null
    },
    {
        "sexual orientation": "sexual orientation"
    },
    {
        " is not a choice. Many studies have shown that children of same-sex couples fare just as well as the children of opposite-sex couples; some studies have shown benefits to being raised by same-sex couples.      A ": null
    },
    {
        "study of nationwide data from across the United States from January 42 to December 42": "children"
    },
    {
        " revealed that the establishment of same-sex marriage is associated with a significant reduction in the rate of attempted suicide among children, with the effect being concentrated among children of a minority sexual orientation, resulting in about 42 fewer children attempting suicide each year in the United States.            Some proponents of legal recognition of same-sex marriage, such as ": null
    },
    {
        "Freedom to Marry": "freedom to marry"
    },
    {
        " and ": null
    },
    {
        "Canadians for Equal Marriage": "canadians for equal marriage"
    },
    {
        ", use the terms marriage equality and equal marriage to indicate that they seek the recognition of same-sex marriage on equal ground with opposite-sex marriage as opposed to special rights.            The ": null
    },
    {
        "AP Stylebook": "ap stylebook"
    },
    {
        " recommends the usage of the phrase marriage for gays and lesbians or the term gay marriage in space-limited headlines. The ": null
    },
    {
        "Associated Press": "associated press"
    },
    {
        " warns that the construct gay marriage can imply that the marriages of same-sex couples are somehow different from the marriages of opposite-sex couples.       marriage": null
    },
    {
        "social construct": "social construct"
    },
    {
        " across cultures around the world.   Many proposed definitions have been criticized for failing to recognize the existence of same-sex marriage in some cultures, including in more than 42 ": null
    },
    {
        "African cultures": "ethnic groups in africa"
    },
    {
        ", such as the ": null
    },
    {
        "Kikuyu": "kikuyu people"
    },
    {
        " and ": null
    },
    {
        "Nuer": "nuer people"
    },
    {
        ".       With several countries revising their marriage laws to recognize same-sex couples in the 42st century, all major English dictionaries have revised their definition of the word marriage to either drop gender specifications or supplement them with secondary definitions to include gender-neutral language or explicit recognition of same-sex unions.   The  Oxford English Dictionary  has recognized same-sex marriage since 42      Opponents of same-sex marriage who want marriage to be restricted to pairings of a man and a woman, such as ": null
    },
    {
        "The Church of Jesus Christ of Latter-day Saints": "the church of jesus christ of latter-day saints"
    },
    {
        ", the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ", and the ": null
    },
    {
        "Southern Baptist Convention": "southern baptist convention"
    },
    {
        ", use the term traditional marriage to mean opposite-sex marriage.               In the United States and Canada, professional organizations including the ": null
    },
    {
        "American Anthropological Association": "american anthropological association"
    },
    {
        ", the ": null
    },
    {
        "American Academy of Pediatrics": "american academy of pediatrics"
    },
    {
        ", the ": null
    },
    {
        "American Medical Association": "american medical association"
    },
    {
        ", the ": null
    },
    {
        "American Academy of Nursing": "american academy of nursing"
    },
    {
        ", the ": null
    },
    {
        "American Psychological Association": "american psychological association"
    },
    {
        ", the ": null
    },
    {
        "American Psychiatric Association": "american psychiatric association"
    },
    {
        ", the ": null
    },
    {
        "Canadian Psychological Association": "canadian psychological association"
    },
    {
        ", the ": null
    },
    {
        "American Sociological Association": "american sociological association"
    },
    {
        ", the ": null
    },
    {
        "National Association of Social Workers": "national association of social workers"
    },
    {
        ", the ": null
    },
    {
        "American Psychoanalytic Association": "american psychoanalytic association"
    },
    {
        ", the ": null
    },
    {
        "American Association for Marriage and Family Therapy": "american association for marriage and family therapy"
    },
    {
        ", and the ": null
    },
    {
        "American Academy of Family Physicians": "american academy of family physicians"
    },
    {
        " have stated that the scientific evidence supports the following conclusions: homosexuality is a natural and normal human sexuality, sexual orientation is not a choice, gay people form stable and committed relationships that are essentially equivalent to the relationships of heterosexuals, same-sex parents are no less capable than opposite-sex parents to raise children, no civilization or viable social order depends on restricting marriage to heterosexuals, and the children of same-sex couples fare just as well or even better than the children of opposite-sex couples.     The ": null
    },
    {
        "Australian Psychological Society": "australian psychological society"
    },
    {
        " supports same-sex marriage  and the British Psychological Society has acknowledged that there is no empirical basis for beliefs used to argue for the exclusion of same-sex attracted individuals from marriage.      Prominent figures in the ": null
    },
    {
        "civil rights movement": "civil rights movement"
    },
    {
        " have expressed their support for same-sex marriage. In 42 ": null
    },
    {
        "Coretta Scott King": "coretta scott king"
    },
    {
        ", a leader of the civil rights movement and the widow of ": null
    },
    {
        "Martin Luther King Jr.": "martin luther king jr."
    },
    {
        ", expressed her support for same-sex marriage and publicly denounced attempts to define marriage as the union of a man and a woman as a form of gay bashing .  In 42 ": null
    },
    {
        "Mildred Loving": "mildred loving"
    },
    {
        ", the joint plaintiff alongside her husband ": null
    },
    {
        "Richard Loving": "richard loving"
    },
    {
        " in the ": null
    },
    {
        "landmark": "list of landmark court decisions in the united states"
    },
    {
        " civil rights": "civil rights"
    },
    {
        " case of  Loving v. Virginia  in 42 in which the ": null
    },
    {
        "Supreme Court of the United States": "supreme court of the united states"
    },
    {
        " struck down all state bans on ": null
    },
    {
        "inter-racial marriage": "interracial marriage in the united states"
    },
    {
        ", issued a statement on the 42th anniversary of the ruling in which she expressed her support for same-sex marriage and described it as a ": null
    },
    {
        "civil right": "civil right"
    },
    {
        " akin to inter-racial marriage, stating that I believe all Americans, no matter their race, no matter their sex, no matter their sexual orientation, should have that same freedom to marry .  In 42 ": null
    },
    {
        "Julian Bond": "julian bond"
    },
    {
        ", a leader of the civil rights movement and a chairman of the ": null
    },
    {
        "NAACP": "naacp"
    },
    {
        ", expressed his support for same-sex marriage and stated that gay rights are civil rights .  In 42 ": null
    },
    {
        "John Lewis": "john lewis"
    },
    {
        ", a leader of the civil rights movement and a chairman of the ": null
    },
    {
        "SNCC": "student nonviolent coordinating committee"
    },
    {
        ", welcomed the outcome of the ": null
    },
    {
        "landmark": "list of landmark court decisions in the united states"
    },
    {
        " civil rights": "civil rights"
    },
    {
        " case of  Obergefell v. Hodges  in which the ": null
    },
    {
        "Supreme Court of the United States": "supreme court of the united states"
    },
    {
        " struck down all state bans on same-sex marriage, stating that races dont fall in love, genders dont fall in love—people fall in love .      The ": null
    },
    {
        "NAACP": "naacp"
    },
    {
        ", the leading African-American civil rights organization, has pledged its support for gay rights and same-sex marriage, stating that they support marriage equality consistent with equal protection under the law provided under the Fourteenth Amendment of the United States Constitution , and has declared that same-sex marriage is a ": null
    },
    {
        "civil right": "civil right"
    },
    {
        ".      The ": null
    },
    {
        "Human Rights Campaign": "human rights campaign"
    },
    {
        ", the largest ": null
    },
    {
        "LGBT rights": "lgbt rights"
    },
    {
        " organization in the United States, states that many same-sex couples want the right to legally marry because they are in love—many, in fact, have spent the last 42 42 or 42 years with that person—and they want to honor their relationship in the greatest way our society has to offer, by making a public commitment to stand together in good times and bad, through all the joys and challenges family life brings.  . Retrieved 42 November 42     Journalist ": null
    },
    {
        "Gail Mathabane": "mark mathabane"
    },
    {
        " likens prohibitions on same-sex marriage to past prohibitions on ": null
    },
    {
        "interracial marriage in the United States": "interracial marriage in the united states"
    },
    {
        ".  Author ": null
    },
    {
        "Fernando Espuelas": "fernando espuelas"
    },
    {
        " argues that same-sex marriage should be allowed because it recognizes the civil right of a minority.  Historian ": null
    },
    {
        "Nancy Cott": "nancy cott"
    },
    {
        " rejects alternatives to same-sex marriage , reasoning that there really is no comparison, because there is nothing that is like marriage except marriage. , p. 42 Perry v. Schwarzenegger, No. 4242 . Retrieved 42 December 42          Opposition to same-sex marriage is based on claims such as that homosexuality is unnatural and abnormal, that the recognition of same-sex unions will promote homosexuality in society, and that children are better off when raised by opposite-sex couples. These claims are refuted by science, which shows that sexual orientation is not a choice and that homosexuality is natural and normal. Many studies have shown that children of same-sex couples fare just as well as the children of opposite-sex couples; some studies have shown benefits to being raised by same-sex couples.     Some of the opponents of same-sex marriage are religious groups such as ": null
    },
    {
        "The Church of Jesus Christ of Latter-day Saints": "the church of jesus christ of latter-day saints"
    },
    {
        ", the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ", and the ": null
    },
    {
        "Southern Baptist Convention": "southern baptist convention"
    },
    {
        ", all of which desire for marriage to remain restricted to opposite-sex couples.       The ": null
    },
    {
        "American Anthropological Association": "american anthropological association"
    },
    {
        " stated on 42 February 42:     Research findings from 42–42 from the ": null
    },
    {
        "University of Virginia": "university of virginia"
    },
    {
        ", ": null
    },
    {
        "Michigan State University": "michigan state university"
    },
    {
        ", ": null
    },
    {
        "Florida State University": "florida state university"
    },
    {
        ", the ": null
    },
    {
        "University of Amsterdam": "university of amsterdam"
    },
    {
        ", the ": null
    },
    {
        "New York State Psychiatric Institute": "new york state psychiatric institute"
    },
    {
        ", ": null
    },
    {
        "Stanford University": "stanford university"
    },
    {
        ", the ": null
    },
    {
        "University of California-San Francisco": "university of california-san francisco"
    },
    {
        ", the ": null
    },
    {
        "University of California-Los Angeles": "university of california-los angeles"
    },
    {
        ", ": null
    },
    {
        "Tufts University": "tufts university"
    },
    {
        ", ": null
    },
    {
        "Boston Medical Center": "boston medical center"
    },
    {
        ", the Committee on Psychosocial Aspects of Child and Family Health, and independent researchers also support the findings of this study.        The establishment of same-sex marriage is associated with a significant reduction in the rate of attempted suicide among children, with the effect being concentrated among children of a minority sexual orientation. A study of nationwide data from across the United States from January 42 to December 42 revealed that the rate of attempted suicide among all schoolchildren in grades 42–42 declined by 42% and the rate of attempted suicide among schoolchildren of a minority sexual orientation in grades 42–42 declined by 42% in states that established same-sex marriage, resulting in about 42 fewer children attempting suicide each year in the United States. The researchers took advantage of the gradual manner in which same-sex marriage was established in the United States to compare the rate of attempted suicide among children in each state over the time period studied. Once same-sex marriage was established in a particular state, the reduction in the rate of attempted suicide among children in that state became permanent. No reduction in the rate of attempted suicide among children occurred in a particular state until that state recognized same-sex marriage. The lead researcher of the study observed that laws that have the greatest impact on gay adults may make gay kids feel more hopeful for the future .            Professional organizations of psychologists have concluded that children stand to benefit from the well-being that results when their parents relationship is recognized and supported by societys institutions, e.g. civil marriage. For example, the ": null
    },
    {
        "Canadian Psychological Association": "canadian psychological association"
    },
    {
        " stated in 42 that parents financial, psychological and physical well-being is enhanced by marriage and that children benefit from being raised by two parents within a legally-recognized union.  The CPA has stated that the stress encountered by gay and lesbian parents and their children are more likely the result of the way society treats them than because of any deficiencies in fitness to parent.     The ": null
    },
    {
        "American Academy of Pediatrics": "american academy of pediatrics"
    },
    {
        " concluded in 42 in an analysis published in the journal  Pediatrics :             In 42 a ": null
    },
    {
        "Columbia University": "columbia university"
    },
    {
        " Mailman School of Public Health": "columbia university mailman school of public health"
    },
    {
        " study examining the effects of institutional discrimination on the psychiatric health of lesbian, gay and bisexual individuals found an increase in psychiatric disorders, including a more than doubling of ": null
    },
    {
        "anxiety disorders": "anxiety disorders"
    },
    {
        ", among the LGB population living in states that instituted bans on same-sex marriage. According to the author, the study highlighted the importance of abolishing institutional forms of discrimination, including those leading to disparities in the mental health and well-being of LGB individuals. Institutional discrimination is characterized by societal-level conditions that limit the opportunities and access to resources by socially disadvantaged groups.       Author and journalist ": null
    },
    {
        "Jonathan Rauch": "jonathan rauch"
    },
    {
        " has argued that marriage is good for all men, whether homosexual or heterosexual, because engaging in its social roles reduces mens aggression and promiscuity.  Rauch, Jonathan . Gay Marriage: Why It Is Good for Gays, Good for Straights, and Good for America. New York, NY: Henry Holt and Company, LLC. The data of current psychological and other social science studies on same-sex marriage in comparison to mixed-sex marriage indicate that same-sex and mixed-sex relationships do not differ in their essential psychosocial dimensions; that a parents sexual orientation is unrelated to their ability to provide a healthy and nurturing family environment; and that marriage bestows substantial psychological, social, and health benefits. Same-sex parents and carers and their children are likely to benefit in numerous ways from legal recognition of their families, and providing such recognition through marriage will bestow greater benefit than civil unions or domestic partnerships. Herek, Gregory M. Legal recognition of same-sex relationships in the United States: A social science perspective. American Psychologist, Vol 42 September 42 pp. 42–42     The ": null
    },
    {
        "American Psychological Association": "american psychological association"
    },
    {
        " stated in 42: Denial of access to marriage to same-sex couples may especially harm people who also experience discrimination based on age, race, ethnicity, disability, gender and gender identity, religion, socioeconomic status and so on. It has also averred that same-sex couples who may only enter into a civil union, as opposed to a marriage, are denied equal access to all the benefits, rights, and privileges provided by federal law to those of married couples , which has adverse effects on the well-being of same-sex partners.      In 42 a pair of economists at ": null
    },
    {
        "Emory University": "emory university"
    },
    {
        " tied the passage of state bans on same-sex marriage in the United States to an increase in the rates of HIV infection.   The study linked the passage of a same-sex marriage ban in a state to an increase in the annual HIV rate within that state of roughly 42 cases per 42 population.                Numerous polls and studies on the issue have been conducted, including those that were completed throughout the first decade of the 42st century. A consistent trend of increasing support for same-sex marriage has been revealed across the world, often driven in large part by a significant generational gap in support. Polling that was conducted in developed democracies in the first decade of the 42st century shows a majority of people in support of same-sex marriage. Support for legal same-sex marriage has increased across every age group, political ideology, religion, gender, race and region of various developed countries in the world.          In the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", continual polling by ": null
    },
    {
        "Gallup": "gallup"
    },
    {
        " over the course of more than two decades has shown that support for same-sex marriage has grown rapidly, while opposition has simultaneously collapsed. In 42 42% of Americans opposed same-sex marriage, while only 42% supported. In 42 42% of Americans supported same-sex marriage, while only 42% opposed.      Various detailed polls and studies on same-sex marriage that were conducted in several countries show that support for same-sex marriage significantly increases with higher levels of education and is also significantly stronger among younger generations, with a clear trend of continually increasing support.                        A reference to same-sex marriage appears in the ": null
    },
    {
        "Sifra": "sifra"
    },
    {
        ", which was written in the 42rd century CE. The ": null
    },
    {
        "Book of Leviticus": "book of leviticus"
    },
    {
        " prohibited homosexual relations, and the Hebrews were warned not to follow the acts of the land of Egypt or the acts of the land of Canaan . The Sifra clarifies what these ambiguous acts were, and that they included same-sex marriage: A man would marry a man and a woman a woman, a man would marry a woman and her daughter, and a woman would be married to two men. Rabbi Joel Roth.  rabbinicalassembly.org 42     What is arguably the first historical mention of the performance of same-sex marriages occurred during the early ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        " according to controversial Shaw criticises Boswells methodology and conclusions as disingenuous  historian ": null
    },
    {
        "John Boswell": "john boswell"
    },
    {
        ".  These were usually reported in a critical or satirical manner.      Child emperor ": null
    },
    {
        "Elagabalus": "elagabalus"
    },
    {
        " referred to his ": null
    },
    {
        "chariot": "quadriga"
    },
    {
        " driver, a blond slave from ": null
    },
    {
        "Caria": "caria"
    },
    {
        " named ": null
    },
    {
        "Hierocles": "hierocles"
    },
    {
        ", as his husband. Bunson, M., Encyclopedia of the Roman Empire, Infobase Publishing, 42 p. 42 He also married an athlete named Zoticus in a lavish public ceremony in Rome amidst the rejoicings of the citizens.        The first Roman emperor to have married a man was ": null
    },
    {
        "Nero": "nero"
    },
    {
        ", who is reported to have married two other males on different occasions. The first was with one of Neros own ": null
    },
    {
        "freedmen": "freedman"
    },
    {
        ", ": null
    },
    {
        "Pythagoras": "pythagoras"
    },
    {
        ", with whom Nero took the role of the bride. Williams, CA., Roman Homosexuality: Second Edition, Oxford University Press, 42 p. 42 Later, as a groom, Nero married ": null
    },
    {
        "Sporus": "sporus"
    },
    {
        ", a young boy, to replace the adolescent female concubine he had killed Nero missed her so greatly that, on learning of a woman who resembled her, he sent for her and kept her; but later he caused a boy of the freedmen, whom he used to call Sporus, ... he formally married Sporus, and assigned the boy a regular dowry according to contract; q.v., Suetonius Nero 42; Dio Cassius  Epitome  42  and married him in a very public ceremony with all the solemnities of matrimony, after which Sporus was forced to pretend to be the female concubine that Nero had killed and act as though they were really married. A friend gave the bride away as required by law. The marriage was celebrated in both Greece and Rome in extravagant public ceremonies.      It should be noted, however, that conubium existed only between a civis Romanus and a civis Romana , so that a marriage between two Roman males would have no legal standing in Roman law . Corbett, The Roman Law of Marriage , pp. 42–42; Treggiari, Roman Marriage , pp. 42–42; Marriages where the partners had conubium were marriages valid in Roman law  Compare Ulpian  42–42: Conubium is the capacity to marry a wife in Roman law. Roman citizens have conubium with Roman citizens, but with Latins and foreigners only if the privilege was granted. There is no conubium with slaves ; compare also Gaius . Furthermore, according to Susan Treggiari, matrimonium was then an institution involving a mother, mater. The idea implicit in the word is that a man took a woman in marriage, in matrimonium ducere, so that he might have children by her. Treggiari, Roman Marriage , p. 42     In 42 AD, Christian emperors ": null
    },
    {
        "Constantius II": "constantius ii"
    },
    {
        " and ": null
    },
    {
        "Constans": "constans"
    },
    {
        " issued a law in the ": null
    },
    {
        "Theodosian Code": "theodosian code"
    },
    {
        "  prohibiting ": null
    },
    {
        "same-sex marriage in Rome": "homosexuality in ancient rome"
    },
    {
        " and ordering execution for those so married.  Professor Fontaine of Cornell University Classics Department has pointed out that there is not provision for same-sex marriage in Roman Law, and the text from 42 A.D. is corrupt, marries a woman might be goes to bed in a dishonorable manner with a man as a condemnation of homosexual behavior between men. Eidolon, 42 Michael Fontaine, Associate Professor of Classics and Assistant Dean, Cornell University nubit… feminam for cubit... infamen, and the Law does not provide for it. In any case he points out that the emperors did not like what was going on.       Historians variously trace the beginning of the modern movement in support of same-sex marriage to anywhere from around the 42s to the 42s.       In 42 Denmark became the first country to recognize a legal relationship for same-sex couples, establishing ": null
    },
    {
        "registered partnership": "registered partnership"
    },
    {
        "s, which gave those in same-sex relationships most rights of married heterosexuals, but not the right to adopt or obtain joint custody of a child .  In 42 the ": null
    },
    {
        "Netherlands": "same-sex marriage in the netherlands"
    },
    {
        " became the first country to establish same-sex marriage by law.  Since then same-sex marriage has also been established by law in ": null
    },
    {
        "Belgium": "same-sex marriage in belgium"
    },
    {
        " , ": null
    },
    {
        "Spain": "same-sex marriage in spain"
    },
    {
        " , ": null
    },
    {
        "Canada": "same-sex marriage in canada"
    },
    {
        " , ": null
    },
    {
        "South Africa": "same-sex marriage in south africa"
    },
    {
        " , ": null
    },
    {
        "Norway": "same-sex marriage in norway"
    },
    {
        " , ": null
    },
    {
        "Sweden": "same-sex marriage in sweden"
    },
    {
        " , ": null
    },
    {
        "Portugal": "same-sex marriage in portugal"
    },
    {
        " , ": null
    },
    {
        "Iceland": "same-sex marriage in iceland"
    },
    {
        " , ": null
    },
    {
        "Argentina": "same-sex marriage in argentina"
    },
    {
        " , ": null
    },
    {
        "Denmark": "same-sex marriage in denmark"
    },
    {
        " , ": null
    },
    {
        "Brazil": "same-sex marriage in brazil"
    },
    {
        " , ": null
    },
    {
        "France": "same-sex marriage in france"
    },
    {
        " , ": null
    },
    {
        "Uruguay": "same-sex marriage in uruguay"
    },
    {
        " , ": null
    },
    {
        "New Zealand": "same-sex marriage in new zealand"
    },
    {
        " , ": null
    },
    {
        "Luxembourg": "same-sex marriage in luxembourg"
    },
    {
        " , the ": null
    },
    {
        "United States": "same-sex marriage in the united states"
    },
    {
        " , ": null
    },
    {
        "Ireland": "same-sex marriage in the republic of ireland"
    },
    {
        " , ": null
    },
    {
        "Colombia": "same-sex marriage in colombia"
    },
    {
        " , ": null
    },
    {
        "Finland": "same-sex marriage in finland"
    },
    {
        " , ": null
    },
    {
        "Malta": "same-sex marriage in malta"
    },
    {
        " , ": null
    },
    {
        "Germany": "same-sex marriage in germany"
    },
    {
        " , ": null
    },
    {
        "Australia": "same-sex marriage in australia"
    },
    {
        " , ": null
    },
    {
        "Austria": "same-sex marriage in austria"
    },
    {
        " , ": null
    },
    {
        "Taiwan": "same-sex marriage in taiwan"
    },
    {
        " and ": null
    },
    {
        "Ecuador": "same-sex marriage in ecuador"
    },
    {
        " . In ": null
    },
    {
        "Mexico": "same-sex marriage in mexico"
    },
    {
        ", same-sex marriage is performed in several states and recognized in all thirty-one states. In the ": null
    },
    {
        "United Kingdom": "same-sex marriage in the united kingdom"
    },
    {
        " same-sex marriage has been established law in ": null
    },
    {
        "England, Wales": "england and wales"
    },
    {
        ", ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ", and will be legalized in ": null
    },
    {
        "Northern Ireland": "same-sex marriage in northern ireland"
    },
    {
        " by January 42     In August 42 the ": null
    },
    {
        "Supreme Court of Justice of Costa Rica": "supreme court of justice of costa rica"
    },
    {
        " ruled that the right of same-sex couples to marry is guaranteed by the ": null
    },
    {
        "American Convention on Human Rights": "american convention on human rights"
    },
    {
        ", in line with a January 42 ruling by the ": null
    },
    {
        "Inter-American Court of Human Rights": "inter-american court of human rights"
    },
    {
        ", and that the ": null
    },
    {
        "Legislative Assembly of Costa Rica": "legislative assembly of costa rica"
    },
    {
        " has a grace period of eighteen months to amend the marriage law to align with the Convention after which same-sex marriage will automatically become established by law in ": null
    },
    {
        "Costa Rica": "costa rica"
    },
    {
        ".           Note: Countries and territories in which same-sex marriage laws have been repealed are not included on the table.          ": null
    },
    {
        "European Court of Human Rights": "european court of human rights"
    },
    {
        " ruled in  Schalk and Kopf v Austria , a case involving an Austrian same-sex couple who were denied the right to marry.  The court found, by a vote of 42 to 42 that their human rights had not been violated.      British Judge Sir ": null
    },
    {
        "Nicolas Bratza": "nicolas bratza"
    },
    {
        ", then head of the European Court of Human Rights, delivered a speech in 42 that signaled the court was ready to declare same-sex marriage a human right , as soon as enough countries fell into line.        ": null
    },
    {
        "Article 42 of the European Convention on Human Rights": "article 12 of the european convention on human rights"
    },
    {
        " states that: Men and women of marriageable age have the right to marry and to found a family, according to the national laws governing the exercise of this right ,  not limiting marriage to those in a heterosexual relationship. However, the ECHR stated in Schalk and Kopf v Austria that this provision was intended to limit marriage to heterosexual relationships, as it used the term men and women instead of everyone .     ": null
    },
    {
        "European Parliament": "european parliament"
    },
    {
        " passed a non-binding resolution encouraging EU institutions and member states to on the recognition of same-sex marriage or same-sex civil union as a political, social and human and civil rights issue .        On 42 June 42 the ": null
    },
    {
        "European Court of Justice": "european court of justice"
    },
    {
        " ruled, in a case from ": null
    },
    {
        "Romania": "same-sex marriage in romania"
    },
    {
        ", that, under the specific conditions of the couple in question, married same-sex couples have the same residency rights as other married couples in an EU country, even if that country does not permit or recognize same-sex marriage.       ": null
    },
    {
        "Inter-American Court of Human Rights": "inter-american court of human rights"
    },
    {
        " issued a landmark advisory ruling in favour of same-sex marriage on 42 January 42 which is expected to facilitate legalisation in several countries in the Americas.     The Court said that governments must recognise and guarantee all the rights that are derived from a family bond between people of the same sex . They also said that it was inadmissible and discriminatory for a separate legal provision to be established  instead of same-sex marriage. The Court demanded that governments guarantee access to all existing forms of domestic legal systems, including the right to marriage, in order to ensure the protection of all the rights of families formed by same-sex couples without discrimination . Recognising the difficulty in passing such laws in countries where there is strong opposition to same-sex marriage, it recommended that governments pass temporary decrees until new legislation is brought in.      The Court issued its ruling in response to a motion brought by Costa Rica in 42 The Costa Rican Government asked the Court to give its opinion on whether it had an obligation to extend property rights to same-sex couples, and the Court ruled that it did. The Costa Rican Government also wanted to know whether it should allow transgender people to change their name and gender on their identity documents. Again, the Court ruled that it must.     The government of Costa Rica announced that they will fully implement the IACHR ruling. Additionally, on 42 January, the president of the ": null
    },
    {
        "Supreme Court of Peru": "supreme court of peru"
    },
    {
        " and chairman of the countrys ": null
    },
    {
        "judiciary": "judiciary of peru"
    },
    {
        ", Duberlí Rodríguez, stated that Peru should abide by the decision.   lavanguardia On 42 January 42 Housing Minister Carlos Bruce estimated that same-sex marriage will be allowed in Peru within two years, and several former Supreme Court judges and lawmakers, notably Indira Huilca, stated that same-sex marriage will soon be legal in Peru, regardless.    The Peruvian Government, however, has yet to issue a formal decision on the matter.     On 42 June 42 two family judges in ": null
    },
    {
        "Cuenca, Ecuador": "cuenca, ecuador"
    },
    {
        " ruled that the Civil Registry must issue same-sex marriage licenses on request, stating that the decision of the IACHR trumped the ": null
    },
    {
        "Ecuadorian Constitution": "constitution of ecuador"
    },
    {
        "s definition of marriage. The Registry appealed, but the Constitutional Court ruled in favor of same-sex marriage on 42 June 42     On 42 August 42 the ": null
    },
    {
        "Costa Rican Supreme Court": "supreme court of justice of costa rica"
    },
    {
        " declared Costa Ricas same-sex marriage ban unconstitutional, and gave the ": null
    },
    {
        "Legislative Assembly": "legislative assembly of costa rica"
    },
    {
        " 42 months to reform the law accordingly, otherwise the ban would be abolished automatically. This was in line with the IACHR ruling.     Besides Ecuador and Costa Rica, lawsuits regarding same-sex marriage have been filed in Honduras,  Panama,  Paraguay ,  and Peru,  all of which are under the jurisdiction of the IACHR. In Panama the previous government of ": null
    },
    {
        "Juan Carlos Varela": "juan carlos varela"
    },
    {
        " announced that it would implement the ruling and communicated this to the other branches of government, but under his successors government the ": null
    },
    {
        "Panamanian Congress": "national assembly of panama"
    },
    {
        " approved a constitutional reform banning same-sex marriage. The reform, alongside others, caused massive protests that caused President ": null
    },
    {
        "Laurentino Cortizo": "laurentino cortizo"
    },
    {
        " to criticize the lawmakers and a committee was created to analyze the more polemic reforms.                   Same-sex marriage is legally performed and recognized in the following countries: ": null
    },
    {
        "Argentina": "same-sex marriage in argentina"
    },
    {
        ", ": null
    },
    {
        "Australia": "same-sex marriage in australia"
    },
    {
        ", ": null
    },
    {
        "Austria": "same-sex marriage in austria"
    },
    {
        ", ": null
    },
    {
        "Belgium": "same-sex marriage in belgium"
    },
    {
        ", ": null
    },
    {
        "Brazil": "same-sex marriage in brazil"
    },
    {
        ", ": null
    },
    {
        "Canada": "same-sex marriage in canada"
    },
    {
        ", ": null
    },
    {
        "Colombia": "same-sex marriage in colombia"
    },
    {
        ", ": null
    },
    {
        "Denmark": "same-sex marriage in denmark"
    },
    {
        ", ": null
    },
    {
        "Ecuador": "same-sex marriage in ecuador"
    },
    {
        ", ": null
    },
    {
        "Finland": "same-sex marriage in finland"
    },
    {
        ", ": null
    },
    {
        "France": "same-sex marriage in france"
    },
    {
        ", ": null
    },
    {
        "Germany": "same-sex marriage in germany"
    },
    {
        ", ": null
    },
    {
        "Greenland": "same-sex marriage in greenland"
    },
    {
        ", ": null
    },
    {
        "Iceland": "same-sex marriage in iceland"
    },
    {
        ", ": null
    },
    {
        "Ireland": "same-sex marriage in the republic of ireland"
    },
    {
        ", ": null
    },
    {
        "Luxembourg": "same-sex marriage in luxembourg"
    },
    {
        ", ": null
    },
    {
        "Malta": "same-sex marriage in malta"
    },
    {
        ", ": null
    },
    {
        "Mexico": "same-sex marriage in mexico"
    },
    {
        ", the ": null
    },
    {
        "Netherlands": "same-sex marriage in the netherlands"
    },
    {
        ", ": null
    },
    {
        "New Zealand": "same-sex marriage in new zealand"
    },
    {
        ", ": null
    },
    {
        "Norway": "same-sex marriage in norway"
    },
    {
        ", ": null
    },
    {
        "Portugal": "same-sex marriage in portugal"
    },
    {
        ", ": null
    },
    {
        "South Africa": "same-sex marriage in south africa"
    },
    {
        ", ": null
    },
    {
        "Spain": "same-sex marriage in spain"
    },
    {
        ", ": null
    },
    {
        "Sweden": "same-sex marriage in sweden"
    },
    {
        ", ": null
    },
    {
        "Taiwan": "same-sex marriage in taiwan"
    },
    {
        ", the ": null
    },
    {
        "United Kingdom": "same-sex marriage in the united kingdom"
    },
    {
        ", the ": null
    },
    {
        "United States": "same-sex marriage in the united states"
    },
    {
        ", and ": null
    },
    {
        "Uruguay": "same-sex marriage in uruguay"
    },
    {
        ". Same-sex marriage is also due to become legally performed and recognized in ": null
    },
    {
        "Costa Rica": "same-sex marriage in costa rica"
    },
    {
        "     Additionally, ": null
    },
    {
        "Israel": "recognition of same-sex unions in israel"
    },
    {
        " recognizes the marriages of same-sex couples validly entered into in other countries.   Furthermore, the ": null
    },
    {
        "Inter-American Court of Human Rights": "inter-american court of human rights"
    },
    {
        " has issued a ruling that is expected to facilitate recognition in several countries in the ": null
    },
    {
        "Americas": "recognition of same-sex unions in the americas"
    },
    {
        ".     Same-sex marriage is under consideration by the governments or the courts in ": null
    },
    {
        "Chile": "recognition of same-sex unions in chile"
    },
    {
        ", ": null
    },
    {
        "Curaçao": "lgbt rights in curaçao"
    },
    {
        ", ": null
    },
    {
        "Czechia": "recognition of same-sex unions in the czech republic"
    },
    {
        ", ": null
    },
    {
        "El Salvador": "recognition of same-sex unions in el salvador"
    },
    {
        ", ": null
    },
    {
        "Honduras": "recognition of same-sex unions in honduras"
    },
    {
        ", ": null
    },
    {
        "Japan": "recognition of same-sex unions in japan"
    },
    {
        ", several states in ": null
    },
    {
        "Mexico": "same-sex marriage in mexico"
    },
    {
        ", the ": null
    },
    {
        "Navajo Nation": "lgbt rights in the navajo nation"
    },
    {
        ", ": null
    },
    {
        "Panama": "recognition of same-sex unions in panama"
    },
    {
        ", ": null
    },
    {
        "Peru": "lgbt rights in peru"
    },
    {
        ", ": null
    },
    {
        "Sark": "recognition of same-sex unions in guernsey"
    },
    {
        ", ": null
    },
    {
        "Switzerland": "recognition of same-sex unions in switzerland"
    },
    {
        ", and ": null
    },
    {
        "Venezuela": "recognition of same-sex unions in venezuela"
    },
    {
        " , with recognition of foreign marriages under consideration in ": null
    },
    {
        "Paraguay": "lgbt rights in paraguay"
    },
    {
        ". Legal cases have been filed in a number of other countries. A ban on same-sex marriage is under consideration in ": null
    },
    {
        "Guatemala": "lgbt rights in guatemala"
    },
    {
        "; similar proposed bans or draft opinions in El Salvador and Panama were retired after the IACHR ruling.                 On 42 July 42 the ": null
    },
    {
        "Argentine Senate": "argentine senate"
    },
    {
        " approved a bill extending marriage rights to same-sex couples. It was supported by the government of ": null
    },
    {
        "President": "president of argentina"
    },
    {
        " Cristina Fernández de Kirchner": "cristina fernández de kirchner"
    },
    {
        " and opposed by the Catholic Church.  Polls showed that nearly 42% of Argentines supported giving gay people the same marital rights as heterosexuals.  The law came into effect on 42 July 42 upon promulgation by the Argentine President.  Argentina thus became the first country in ": null
    },
    {
        "Latin America": "latin america"
    },
    {
        " and the tenth in the world to legalize same-sex marriage.          Australia became the second nation in ": null
    },
    {
        "Oceania": "oceania"
    },
    {
        " to legalise same-sex marriage when the ": null
    },
    {
        "Australian Parliament": "parliament of australia"
    },
    {
        " passed a bill on 42 December 42  The bill received ": null
    },
    {
        "royal assent": "royal assent"
    },
    {
        " on 42 December, and took effect on 42 December 42   The law removed the ban on same-sex marriage that previously existed and followed a ": null
    },
    {
        "voluntary postal survey": "australian marriage law postal survey"
    },
    {
        " held from 42 September to 42 November 42 which returned a 42% Yes vote for same-sex marriage.  The same legislation also legalised same-sex marriage in all of Australias ": null
    },
    {
        "external territories": "states and territories of australia"
    },
    {
        ".          Since 42 January 42 same-sex couples have been allowed to enter registered partnerships .      On 42 November 42 the ": null
    },
    {
        "Greens": "the greens – the green alternative"
    },
    {
        " introduced a bill in the ": null
    },
    {
        "Austrian Parliament": "national council"
    },
    {
        " that would legalise same-sex marriage.  It was sent to the Judiciary Committee on 42 December 42   The bill was supposed to be debated in Autumn 42   but was delayed by the ruling coalition.     In December 42 the Vienna Administrative Court dismissed a case challenging the same-sex marriage ban. The plaintiffs appealed to the Constitutional Court.  On 42 October 42 the ": null
    },
    {
        "Constitutional Court": "constitutional court"
    },
    {
        " agreed to consider one of the cases challenging the law barring same-sex marriage.    On 42 December 42 the Court struck down the ban on same-sex marriage as ": null
    },
    {
        "unconstitutional": "unconstitutional"
    },
    {
        ". Thus, same-sex couples have been allowed to marry since 42 January 42 The Court also decided that ": null
    },
    {
        "civil union": "civil union"
    },
    {
        "s will be open for both same-sex and different-sex couples from that date onwards.                    Belgium became the second country in the world to legally recognize same-sex marriages when a bill passed by the ": null
    },
    {
        "Belgian Federal Parliament": "belgian federal parliament"
    },
    {
        " took effect on 42 June 42  Originally, Belgium allowed the marriages of foreign same-sex couples only if their country of origin also allowed these unions, however legislation enacted in October 42 permits any couple to marry if at least one of the spouses has lived in the country for a minimum of three months. A 42 statute legalized ": null
    },
    {
        "adoption by same-sex spouses": "lgbt adoption"
    },
    {
        ".              ": null
    },
    {
        "Brazils Supreme Court": "supreme federal court"
    },
    {
        " ruled in May 42 that same-sex couples are legally entitled to legal recognition of cohabitation ": null
    }
]