[
    {
        "         Samizdat  was a form of ": null
    },
    {
        "dissident": "soviet dissidents"
    },
    {
        " activity across the ": null
    },
    {
        "Eastern Bloc": "eastern bloc"
    },
    {
        " in which individuals reproduced censored and underground publications by hand and passed the documents from reader to reader. This ": null
    },
    {
        "grassroots": "grassroots"
    },
    {
        " practice to evade ": null
    },
    {
        "official Soviet censorship": "censorship in the soviet union"
    },
    {
        " was fraught with danger, as harsh punishments were meted out to people caught possessing or copying censored materials. ": null
    },
    {
        "Vladimir Bukovsky": "vladimir bukovsky"
    },
    {
        " summarized it as follows: Samizdat: I write it myself, edit it myself, censor it myself, publish it myself, distribute it myself, and spend time in prison for it myself.        ": null
    },
    {
        "Etymologically": "etymology"
    },
    {
        ", the word samizdat derives from sam  and izdat , and thus means self-published . The ": null
    },
    {
        "Ukrainian language": "ukrainian language"
    },
    {
        " has a similar term: samvydav , from sam, self , and vydavnytstvo, publishing house .     The Russian poet ": null
    },
    {
        "Nikolai Glazkov": "nikolai glazkov"
    },
    {
        " coined a version of the term as a ": null
    },
    {
        "pun": "pun"
    },
    {
        " in the 42s when he typed copies of his poems and included the note Samsebyaizdat on the ": null
    },
    {
        "front page": "wikt:front page"
    },
    {
        ".     Tamizdat refers to literature published abroad , often from smuggled manuscripts.       Samizdat copies of texts, such as ": null
    },
    {
        "Mikhail Bulgakov": "mikhail bulgakov"
    },
    {
        "s novel  The Master and Margarita  or ": null
    },
    {
        "Václav Havel": "václav havel"
    },
    {
        "s essay  The Power of the Powerless  were passed around among trusted friends. The techniques used to reproduce these forbidden texts varied. Several copies might be made using ": null
    },
    {
        "carbon paper": "carbon paper"
    },
    {
        ", either by hand or on a ": null
    },
    {
        "typewriter": "typewriter"
    },
    {
        "; at the other end of the scale, ": null
    },
    {
        "mainframe computer": "mainframe computer"
    },
    {
        " printers were used during night shifts to make multiple copies, and books were at times printed on semiprofessional ": null
    },
    {
        "printing press": "printing press"
    },
    {
        "es in much larger quantities. Before ": null
    },
    {
        "glasnost": "glasnost"
    },
    {
        ", most of these methods were dangerous, because copy machines, printing presses, and even typewriters in offices were under control of the organisations ": null
    },
    {
        "First Department": "first department"
    },
    {
        ", i.e., the KGB: reference printouts from all of these machines were stored for subsequent identification purposes, should samizdat output be found.          Samizdat distinguishes itself not only by the ideas and debates that it helped spread to a wider audience but also by its physical form. The hand-typed, often blurry and wrinkled pages with numerous typographical errors and nondescript covers helped to separate and elevate Russian samizdat from Western literature. The physical form of samizdat arose from a simple lack of resources and the necessity to be inconspicuous. In time, dissidents in the USSR began to admire these qualities for their own sake, the ragged appearance of samizdat contrasting sharply with the smooth, well-produced appearance of texts passed by the censors office for publication by the State. The form samizdat took gained precedence over the ideas it expressed, and became a potent symbol of the resourcefulness and rebellious spirit of the inhabitants of the Soviet Union. In effect, the physical form of samizdat itself elevated the reading of samizdat to a prized clandestine act.          Samizdat originated from the dissident movement of the Russian ": null
    },
    {
        "intelligentsia": "intelligentsia"
    },
    {
        ", and most samizdat directed itself to a readership of Russian elites. While circulation of samizdat was relatively low, at around 42 readers on average, many of these readers possessed positions of cultural power and authority. Furthermore, because of the presence of ": null
    },
    {
        "dual consciousness": "doublespeak"
    },
    {
        " in the Soviet Union, the simultaneous censorship of information and necessity of absorbing information to know how to censor it, many government officials became readers of samizdat. Although the general public at times came into contact with samizdat, most of the public lacked access to the few expensive samizdat texts in circulation, and expressed discontent with the highly censored reading material made available by the state.     The purpose and methods of samizdat may contrast with the purpose of the concept of ": null
    },
    {
        "copyright": "copyright"
    },
    {
        ". : Another legal aspect of samizdat literature is the copyright problem. It grew into an important issue when the Soviet government, in an apparent attempt to impede the publication of samizdat materials abroad, joined the Geneva Convention in 42 Well-known Soviet authors, such as Solzhenitsyn, whose works regularly appear in samizdat in the Soviet Union have never claimed that their copyright was infringed by the samizdat procedure.       ": null
    },
    {
        "Self-published": "self-publishing"
    },
    {
        " and self-distributed literature has a long history in Russia. Samizdat is unique to the post-": null
    },
    {
        "Stalin": "joseph stalin"
    },
    {
        " USSR and other countries with similar systems. Faced with the ": null
    },
    {
        "police state": "police state"
    },
    {
        "s powers of censorship, society turned to underground literature for self-analysis and self-expression.         The first full-length book to be distributed as samizdat was ": null
    },
    {
        "Boris Pasternak": "boris pasternak"
    },
    {
        "s 42 novel  Doctor Zhivago . Although the literary magazine  Novy Mir  had published ten poems from the book in 42 a year later the full text was judged unsuitable for publication and entered samizdat circulation.     Certain works, though published legally by the State-controlled media, were practically impossible to find in bookshops and libraries, and found their way into samizdat: for example ": null
    },
    {
        "Aleksandr Solzhenitsyn": "aleksandr solzhenitsyn"
    },
    {
        "s novel  One Day in the Life of Ivan Denisovich  was widely distributed via samizdat. November 42 issue of the  Novy Mir  literary magazine     At the outset of the ": null
    },
    {
        "Khrushchev Thaw": "khrushchev thaw"
    },
    {
        " in the mid42s USSR ": null
    },
    {
        "poetry": "poetry"
    },
    {
        " became very popular. Writings of a wide variety of poets circulated among Soviet ": null
    },
    {
        "intelligentsia": "intelligentsia"
    },
    {
        ": known, prohibited, repressed writers as well as those young and unknown . A number of samizdat publications carried unofficial poetry, among them the Moscow magazine  Sintaksis  by writer ": null
    },
    {
        "Alexander Ginzburg": "alexander ginzburg"
    },
    {
        ", ": null
    },
    {
        "Vladimir Osipov": "vladimir osipov"
    },
    {
        "s Boomerang , and  Phoenix  , produced by ": null
    },
    {
        "Yuri Galanskov": "yuri galanskov"
    },
    {
        " and ": null
    },
    {
        "Alexander Ginzburg": "alexander ginzburg"
    },
    {
        ". The editors of these magazines were regulars at ": null
    },
    {
        "impromptu public poetry readings": "mayakovsky square poetry readings"
    },
    {
        " between 42 and 42 on Mayakovsky Square in Moscow. The gatherings did not last long, for soon the authorities began clamping down on them. In the summer of 42 several meeting regulars were arrested and charged with ": null
    },
    {
        "anti-Soviet agitation and propaganda": "anti-soviet agitation"
    },
    {
        " , putting an end to most of the magazines.     Not everything published in samizdat had political overtones. In 42 ": null
    },
    {
        "Joseph Brodsky": "joseph brodsky"
    },
    {
        " was charged with ": null
    },
    {
        "social parasitism": "parasitism"
    },
    {
        " and convicted for being nothing but a poet. His poems circulated in samizdat, with only four judged as suitable for official Soviet anthologies. In the mid42s an unofficial literary group known as ": null
    },
    {
        "SMOG": "smog"
    },
    {
        "  issued an ": null
    },
    {
        "almanac": "almanac"
    },
    {
        " titled The Sphinxes  and collections of prose and poetry. Some of their writings were close to the ": null
    },
    {
        "Russian avant-garde": "russian avant-garde"
    },
    {
        " of the 42s and 42s.     The 42 ": null
    },
    {
        "show trial": "sinyavsky–daniel trial"
    },
    {
        " of writers ": null
    },
    {
        "Yuli Daniel": "yuli daniel"
    },
    {
        " and ": null
    },
    {
        "Andrei Sinyavsky": "andrei sinyavsky"
    },
    {
        ", charged with anti-Soviet agitation and propaganda, and the subsequent increased repression, marked the demise of the Thaw and the beginning of harsher times for samizdat authors. The trial was carefully documented in a samizdat collection called The White Book , compiled by ": null
    },
    {
        "Yuri Galanskov": "yuri galanskov"
    },
    {
        " and ": null
    },
    {
        "Alexander Ginzburg": "alexander ginzburg"
    },
    {
        ". Both writers were among those later arrested and sentenced to prison in what was known as ": null
    },
    {
        "The Trial of the Four": "the trial of the four"
    },
    {
        ". In the following years some samizdat content became more politicized, and played an important role in the ": null
    },
    {
        "dissident movement in the Soviet Union": "dissident movement in the soviet union"
    },
    {
        ".            The earliest samizdat periodicals were short-lived and mainly literary in focus:  Sintaksis  , Boomerang , and  Phoenix  . From 42 to 42 communist historian ": null
    },
    {
        "Roy Medvedev": "roy medvedev"
    },
    {
        " regularly published The Political Journal , which contained analytical materials that later appeared in the West.     The longest-running and best-known samizdat periodical was A Chronicle of Current Events  .  Archive at memo.ru. It was dedicated to defending ": null
    },
    {
        "human rights": "human rights"
    },
    {
        " by providing accurate information about events in the USSR. Over 42 years, from April 42 to December 42 42 issues were published, all but two appearing in English translation.  All 42 and 42 issues may be found in  The anonymous editors encouraged the readers to utilize the same distribution channels in order to send feedback and local information to be published in subsequent issues.     The Chronicle was distinguished by its dry, concise style and punctilious correction of even the smallest error. Its regular rubrics were Arrests, Searches, Interrogations , ": null
    },
    {
        "Extra-judicial Persecution": "extrajudicial punishment"
    },
    {
        " , In Prisons and ": null
    },
    {
        "Camps": "gulag"
    },
    {
        " , Samizdat update , News in brief , and Persecution of Religion . Over time, sections were added on the Persecution of the ": null
    },
    {
        "Crimean Tatars": "crimean tatars"
    },
    {
        " , Persecution and Harassment in ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        " , ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        "n Events , and so on.     The Chronicle editors maintained that, according to the 42 ": null
    },
    {
        "Soviet Constitution": "soviet constitution"
    },
    {
        ", then in force, their publication was not illegal. The authorities did not accept the argument. Many people were harassed, arrested, imprisoned, or forced to leave the country for their involvement in the Chronicles production and distribution. The periodicals typist and first editor ": null
    },
    {
        "Natalya Gorbanevskaya": "natalya gorbanevskaya"
    },
    {
        " was arrested and put in a psychiatric hospital for taking part in the August ": null
    },
    {
        "42 Red Square protest": "1968 red square demonstration"
    },
    {
        " against the invasion of Czechoslovakia. In 42 two of the periodicals close associates  were persuaded to denounce their fellow editors and the Chronicle on Soviet television. This put an end to the periodicals activities, until ": null
    },
    {
        "Sergei Kovalev": "sergei kovalev"
    },
    {
        ", Tatyana Khodorovich and ": null
    },
    {
        "Tatyana Velikanova": "tatyana velikanova"
    },
    {
        " openly announced their readiness to resume publication. After being arrested and imprisoned, they were replaced, in turn, by others.     Another notable and long-running publication was the  refusenik  political and literary magazine Евреи в СССР , founded and edited by Alexander Voronel and, after his imprisonment, by Mark Azbel and Alexander Luntz.     The late 42s, which were marked by an increase in informal organizations, saw a renewed wave of samizdat periodicals in the Soviet Union. Publications that were active during that time included Glasnost , Ekspress-khronika , Svobodnoye slovo , Levyi povorot , Otkrytaya zona of Club Perestroika, Merkurii and Khronograph .     Not all samizdat trends were liberal or clearly opposed to the Soviet regime and the literary establishment. The Russian Party... was a very strange element of the political landscape of ": null
    },
    {
        "Leonid Brezhnev": "leonid brezhnev"
    },
    {
        "s era—feeling themselves practically dissidents, members of the Russian Party with rare exceptions took quite prestigious official positions in the world of writers or journalists, wrote ": null
    },
    {
        "Oleg Kashin": "oleg kashin"
    },
    {
        " in 42       Samizdat covered a large range of topics, mainly including literature and works focused on religion, nationality, and politics. The state censored a variety of materials such as detective novels, adventure stories, and science fiction in addition to dissident texts, resulting in the underground publication of samizdat covering a wide range of topics. Though most samizdat authors directed their works towards the intelligentsia, samizdat included lowbrow genres in addition to scholarly works.     Hyung-Min Joo carried out a detailed analysis of an archive of samizdat     ": null
    }
]