[
    {
        "Samuel Shellabarger was an American educator and author of both scholarly works and best-selling ": null
    },
    {
        "historical novel": "historical novel"
    },
    {
        "s.     Born 42 May 42 in Washington, D.C., Shellabarger was orphaned in infancy and was resultantly raised in the household of his paternal grandfather also named ": null
    },
    {
        "Samuel Shellabarger": "samuel shellabarger"
    },
    {
        ", a noted lawyer who had served in Congress during the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " and as Minister to Portugal. The younger Samuel Shellabargers travels with his grandfather would prove invaluable in the provision of background material for the formers historical novels.     Shellabarger attended private schools and in 42 graduated from ": null
    },
    {
        "Princeton University": "princeton university"
    },
    {
        ", where he would later teach. After studying for a year at ": null
    },
    {
        "Munich University": "ludwig maximilian university of munich"
    },
    {
        " in Germany, he resumed his studies at ": null
    },
    {
        "Harvard University": "harvard university"
    },
    {
        " and ": null
    },
    {
        "Yale University": "yale university"
    },
    {
        ". Despite taking a year off to serve in ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", he received his doctorate in 42 In 42 he married Vivan Georgia Lovegrove Borg whom he had met the year before during a vacation in Sweden. They had four children, but the two boys died: one as an infant and the other serving in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". Shellabarger himself died of a heart attack at his ": null
    },
    {
        "Princeton, New Jersey": "princeton, new jersey"
    },
    {
        " home on 42 March 42     Having already published some scholarly works and not wanting to undermine their credibility by publishing fiction, Shellabarger used pen names for his first mysteries and romances: John Estevan and then Peter Loring. He continued to write scholarly works and to teach, but his historical novels proved so popular that he soon started using his own name on them. Some of them were best-sellers and were made into movies.       The Door of Death   The Chevalier Bayard   The Black Gale   Voodoo. A Murder Mystery   By Night at Dinsmore   Lord Chesterfield and His World   While Murder Waits   Graveyard Watch   Blind Mans Night   Assurance Double Sure   Grief Before Night   Miss Rolling Stone Who Travels Alone   ": null
    },
    {
        "Captain from Castile": "captain from castile"
    },
    {
        "     Prince of Foxes     The Kings Cavalier   Lord Vanity   The Token   Tolbecken                                             ": null
    }
]