[
    {
        "Freiherr": "freiherr"
    },
    {
        " Samuel von Pufendorf was a German jurist, political philosopher, economist and historian. He was born Samuel Pufendorf and ": null
    },
    {
        "ennobled": "nobility"
    },
    {
        " in 42; he was made a ": null
    },
    {
        "baron": "baron"
    },
    {
        " by ": null
    },
    {
        "Charles XI of Sweden": "charles xi of sweden"
    },
    {
        " a few months before his death at age 42 Among his achievements are his commentaries and revisions of the ": null
    },
    {
        "natural law": "natural law"
    },
    {
        " theories of ": null
    },
    {
        "Thomas Hobbes": "thomas hobbes"
    },
    {
        " and ": null
    },
    {
        "Hugo Grotius": "hugo grotius"
    },
    {
        ".     Pufendorf was familiar to American political writers such as ": null
    },
    {
        "Alexander Hamilton": "alexander hamilton"
    },
    {
        ", ": null
    },
    {
        "James Madison": "james madison"
    },
    {
        ", and ": null
    },
    {
        "Thomas Jefferson": "thomas jefferson"
    },
    {
        ". His political concepts are part of the cultural background of the American Revolution. Pufendorf is seen as an important precursor of Enlightenment in Germany. He was involved in constant quarrels with clerical circles and frequently had to defend himself against accusations of heresy, despite holding largely traditional Christian views on matters of dogma and doctrine.           He was born at ": null
    },
    {
        "Dorfchemnitz": "zwönitz"
    },
    {
        " in the ": null
    },
    {
        "Electorate of Saxony": "electorate of saxony"
    },
    {
        ". His father Esaias Elias Pufendorf from ": null
    },
    {
        "Glauchau": "glauchau"
    },
    {
        " was a ": null
    },
    {
        "Lutheran": "lutheranism"
    },
    {
        " pastor, and Samuel Pufendorf himself was destined for the ministry.     Educated at the ducal school at ": null
    },
    {
        "Grimma": "grimma"
    },
    {
        ", he was sent to study ": null
    },
    {
        "theology": "theology"
    },
    {
        " at the ": null
    },
    {
        "University of Leipzig": "university of leipzig"
    },
    {
        ". The narrow and ": null
    },
    {
        "dogma": "dogma"
    },
    {
        "tic teaching was repugnant to Pufendorf, and he soon abandoned it for the study of public ": null
    },
    {
        "law": "law"
    },
    {
        ".     Leaving Leipzig altogether, Pufendorf relocated to ": null
    },
    {
        "University of Jena": "university of jena"
    },
    {
        ", where he formed an intimate friendship with ": null
    },
    {
        "Erhard Weigel": "erhard weigel"
    },
    {
        ", the ": null
    },
    {
        "mathematician": "mathematician"
    },
    {
        ", whose influence helped to develop his remarkable independence of character. Under the influence of Weigel, he started to read ": null
    },
    {
        "Hugo Grotius": "hugo grotius"
    },
    {
        ", ": null
    },
    {
        "Thomas Hobbes": "thomas hobbes"
    },
    {
        " and ": null
    },
    {
        "René Descartes": "rené descartes"
    },
    {
        ".     Pufendorf left Jena in 42 as Magister and became a tutor in the family of ": null
    },
    {
        "Peter Julius Coyet": "peter julius coyet"
    },
    {
        ", one of the resident ministers of King ": null
    },
    {
        "Charles X Gustav of Sweden": "charles x gustav of sweden"
    },
    {
        ", at ": null
    },
    {
        "Copenhagen": "copenhagen"
    },
    {
        " with the help of his brother , a diplomat in the Swedish service.     At this time, Charles was endeavoring to impose an unwanted alliance on Denmark. In the middle of the negotiations he opened hostilities and the Danes turned with anger against his envoys. Coyet succeeded in escaping, but the second minister, ": null
    },
    {
        "Steno Bielke": "steno bielke"
    },
    {
        ", and the rest of the staff were arrested and thrown into prison. Pufendorf shared this misfortune, and was held in captivity for eight months. He occupied himself in meditating upon what he had read in the works of ": null
    },
    {
        "Hugo Grotius": "hugo grotius"
    },
    {
        " and ": null
    },
    {
        "Thomas Hobbes": "thomas hobbes"
    },
    {
        ", and mentally constructed a system of universal law. At the end of his captivity, he accompanied his pupils, the sons of Coyet, to the ": null
    },
    {
        "University of Leiden": "university of leiden"
    },
    {
        ".          At Leiden, he was permitted to publish, in 42 the fruits of his reflections under the title of Elementa jurisprudentiae universalis libri duo. The work was dedicated to ": null
    },
    {
        "Charles Louis, elector palatine": "charles i louis, elector palatine"
    },
    {
        ", who created for Pufendorf a new chair at the ": null
    },
    {
        "University of Heidelberg": "university of heidelberg"
    },
    {
        ", that of the law of nature and nations. This professorship was first of its kind in the world. Pufendorf married Katharina Elisabeth von Palthen, the widow of a colleague, in 42     In 42 he wrote, with the assent of the elector palatine, a tract De statu imperii germanici liber unus . Published under the cover of a pseudonym at ": null
    },
    {
        "Geneva": "geneva"
    },
    {
        " in 42 it was supposed to be addressed by a gentleman of ": null
    },
    {
        "Verona": "verona"
    },
    {
        ", Severinus de Monzambano, to his brother Laelius. The pamphlet caused a sensation. Its author directly challenged the organization of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", denounced in the strongest terms the faults of the house of Austria, and attacked with vigour the politics of the ecclesiastical princes. Before Pufendorf, , publicist and soldier, had written, under the pseudonym of Hippolytus a Lapide , De ratione status in imperio nostro romano-germanico. Inimical, like Pufendorf, to the Austrian ": null
    },
    {
        "House of Habsburg": "house of habsburg"
    },
    {
        ", Chemnitz had gone so far as to make an appeal to ": null
    },
    {
        "France": "france"
    },
    {
        " and ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ". Pufendorf, on the contrary, rejected all idea of foreign intervention, and advocated that of national initiative.     When Pufendorf went on to criticise a new tax on official documents, he did not get the chair of law and had to leave Heidelberg in 42 Chances for advancement were few in a Germany that still suffered from the ravages of the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        " , so Pufendorf went to Sweden where that year he was called to the ": null
    },
    {
        "University of Lund": "university of lund"
    },
    {
        ". His sojourn there was fruitful.     In 42 appeared De jure naturae et gentium libri octo, and in 42 a résumé of it under the title De officio hominis et civis , which, among other topics, gave his analysis of ": null
    },
    {
        "just war": "just war"
    },
    {
        " theory.   In De jure naturae et gentium Pufendorf took up in great measure the theories of Grotius and sought to complete them by means of the doctrines of ": null
    },
    {
        "Hobbes": "thomas hobbes"
    },
    {
        " and of his own ideas on ": null
    },
    {
        "jus gentium": "jus gentium"
    },
    {
        ". His first important point was that natural law does not extend beyond the limits of this life and that it confines itself to regulating external acts. He disputed Hobbess conception of the state of nature and concluded that the state of nature is not one of war but of peace. But this peace is feeble and insecure, and if something else does not come to its aid it can do very little for the preservation of mankind.     As regards public law Pufendorf, while recognizing in the state  a moral person , teaches that the will of the state is but the sum of the individual wills that constitute it, and that this association explains the state. In this  a priori  conception, in which he scarcely gives proof of historical insight, he shows himself as one of the precursors of ": null
    },
    {
        "Rousseau": "jean-jacques rousseau"
    },
    {
        " and of the Contrat social. Pufendorf powerfully defends the idea that international law is not restricted to Christendom, but constitutes a common bond between all nations because all nations form part of humanity.     In 42 Pufendorf was called to ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        " as ": null
    },
    {
        "Historiographer Royal": "historiographer royal"
    },
    {
        ". To this new period belong Einleitung zur Historie der vornehmsten Reiche und Staaten as well as Commentarium de rebus suecicis libri XXVI., ab expeditione Gustavi Adolphi regis in Germaniam ad abdicationem usque Christinae and De rebus a Carolo Gustavo gestis. In his historical works, Pufendorf wrote in a very dry style, but he professed a great respect for truth and generally drew from archival sources. In De habitu religionis christianae ad vitam civilem he traces the limits between ecclesiastical and civil power. This work propounded for the first time the so-called collegial theory of church government , which, developed later by the learned Lutheran theologian , formed the basis of the relations of church and state in Germany and more especially in ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ".     This theory makes a fundamental distinction between the supreme jurisdiction in ecclesiastical matters , which it conceives as inherent in the power of the state in respect of every religious communion, and the ecclesiastical power  inherent in the church, but in some cases vested in the state by tacit or expressed consent of the ecclesiastical body. The theory was of importance because, by distinguishing church from state while preserving the essential supremacy of the latter, it prepared the way for the principle of toleration. It was put into practice to a certain extent in ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        " in the 42th century; but it was not till the political changes of the 42th century led to a great mixture of confessions under the various state governments that it found universal acceptance in Germany. The theory, of course, has found no acceptance in the Roman Catholic Church, but it nonetheless made it possible for the ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " governments to make a working compromise with ": null
    },
    {
        "Rome": "rome"
    },
    {
        " in respect of the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        " established in their states.     In 42 Pufendorf was called into the service of ": null
    },
    {
        "Frederick William, Elector of Brandenburg": "frederick william, elector of brandenburg"
    },
    {
        ". He accepted the call, but he had no sooner arrived than the elector died. His son ": null
    },
    {
        "Frederick III": "frederick i of prussia"
    },
    {
        " fulfilled the promises of his father; and Pufendorf, historiographer and privy councillor, was instructed to write a history of the Elector Frederick William .     The King of Sweden continued to testify his goodwill towards Pufendorf, and in 42 created him a baron. In the same year while still in Sweden, Pufendorf suffered a stroke, and shortly thereafter died at ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ". He was buried in the church of St Nicholas, where an inscription to his memory is still to be seen. He was succeeded as historiographer in Berlin by ": null
    },
    {
        "Charles Ancillon": "charles ancillon"
    },
    {
        ".     De iure naturae et gentiumDe iure naturae et gentium. This work took largely the theories of Grotius and many ideas from Hobbes, adding to them Pufendorfs own ideas to develop the law of nations. Pufendorf argues that natural law does not extend beyond the limits of this life and merely regulates only external acts. He also challenges the Hobbesian thesis of a state of nature which is a state of war or conflict. For Pufendorf too there is a state of nature, but it is a state of peace. This natural peace, however, is weak and uncertain. In terms of public law, which recognizes the state  as a moral person , Pufendorf argues that the will of the state is nevertheless nothing more than the sum of the individual wills that are associated within it; hence the state needs to submit to a discipline essential for human safety. This submission, in the sense of obedience and mutual respect, is for Pufendorf the fundamental law of reason, which is the basis of natural law. He adds that international law should not be limited or restricted only to the Christian nations, but must create a common link between all peoples, since all nations are part of humanity .          ": null
    },
    {
        "John Locke": "john locke"
    },
    {
        ", ": null
    },
    {
        "Jean-Jacques Rousseau": "jean-jacques rousseau"
    },
    {
        ", and ": null
    },
    {
        "Denis Diderot": "denis diderot"
    },
    {
        " all recommended Pufendorfs inclusion in law curricula, and he greatly influenced ": null
    },
    {
        "Blackstone": "william blackstone"
    },
    {
        " and ": null
    },
    {
        "Montesquieu": "montesquieu"
    },
    {
        ".     Pufendorfs feuds with ": null
    },
    {
        "Leibniz": "gottfried leibniz"
    },
    {
        " diminished his reputation. Pufendorf and Leibniz shared many theological views, but differed in their philosophical foundation, with Pufendorf leaning toward Biblical fundamentalism. It was on the subject of the pamphlet of Severinus de Monzambano that their quarrel began. Leibniz once dismissed him as Vir parum jurisconsultus, minime philosophus .         The Political Writings of Samuel Pufendorf   Elementorum iurisprudentiae universalis   Elementorum iurisprudentiae universalis libri duo   De obligatione Patriam   De rebus gestis Philippi Augustae   De statu imperii germanici liber unus   De statu imperii Germanici   De jure naturae et gentium   De officio hominis et civis juxta legem naturalem libri duo or On The Duty of Man and Citizen According to the Natural Law  De officio hominis et civis juxta legem naturalem libri duo. NY: Oxford University Press, 42   Einleitung zu der Historie der vornehmsten Reiche und Staaten, so itziger Zeit in Europa sich befinden   Commentarium de rebus suecicis libri XXVI., ab expeditione Gustavi Adolphi regis in Germaniam ad abdicationem usque Christinae De rebus a Carolo Gustavo Sueciae rege gestis commentariorum   De rebus gestis Friderici Wilhelmi Magni        ": null
    }
]