[
    {
        "         Sandhi  is a cover term for a wide variety of ": null
    },
    {
        "sound": "phonology"
    },
    {
        " changes that occur at ": null
    },
    {
        "morpheme": "morpheme"
    },
    {
        " or word boundaries. Examples include fusion of sounds across word boundaries and the alteration of one sound depending on nearby sounds or the grammatical function of the adjacent words. Sandhi belongs to ": null
    },
    {
        "morphophonology": "morphophonology"
    },
    {
        ".     Sandhi occurs in many languages, particularly in the phonology of ": null
    },
    {
        "Indian languages": "languages of india"
    },
    {
        " , as well as in some ": null
    },
    {
        "North Germanic languages": "north germanic languages"
    },
    {
        ".           Sandhi can be either   internal, at ": null
    },
    {
        "morpheme": "morpheme"
    },
    {
        " boundaries within words, such as syn- + pathy: sympathy, or   external, at word boundaries, such as the pronunciation tem books for ten books in some dialects of ": null
    },
    {
        "English": "english language"
    },
    {
        ". The ": null
    },
    {
        "linking ": "linking and intrusive r"
    },
    {
        " process of some dialects of English  is a kind of external sandhi, as are ": null
    },
    {
        "French": "french language"
    },
    {
        "  liaison  and ": null
    },
    {
        "Italian": "italian language"
    },
    {
        "  raddoppiamento fonosintattico  .   It may be extremely common in speech, but sandhi is typically ignored in spelling, as is the case in English, except for the distinction between a and an. Sandhi is, however, reflected in the orthography of ": null
    },
    {
        "Sanskrit": "sanskrit"
    },
    {
        ", ": null
    },
    {
        "Telugu": "telugu language"
    },
    {
        ", ": null
    },
    {
        "Marathi": "marathi language"
    },
    {
        ", ": null
    },
    {
        "Pali": "pali"
    },
    {
        " and some other Indian languages, as with Italian in the case of compound words with ": null
    },
    {
        "lexicalised": "lexicalization"
    },
    {
        " syntactic gemination": "syntactic gemination"
    },
    {
        ".     External sandhi effects can sometimes become morphologised  like in ": null
    },
    {
        "Tamil": "tamil language"
    },
    {
        "   and, over time, turn into ": null
    },
    {
        "consonant mutation": "consonant mutation"
    },
    {
        "s.       Most ": null
    },
    {
        "tonal language": "tone"
    },
    {
        "s have  tone sandhi  in which the tones of words alter according to certain rules. An example is the behavior of ": null
    },
    {
        "Mandarin Chinese": "mandarin chinese"
    },
    {
        ". When in isolation, tone 42 is often pronounced as a falling-rising tone. When a tone 42 occurs before another tone 42 however, it changes into tone 42 , and when it occurs before any of the other tones, it is pronounced as a low falling tone, with no rise at the end. A simple example occurs in the common greeting  nǐ hǎo , normally pronounced ní hǎo.         In ": null
    },
    {
        "Japanese phonology": "japanese phonology"
    },
    {
        ", sandhi is primarily exhibited in ": null
    },
    {
        "rendaku": "rendaku"
    },
    {
        "  and conversion of  or   to a ": null
    },
    {
        "geminate consonant": "geminate consonant"
    },
    {
        " , both of which are reflected in spelling – indeed, the  symbol for gemination is morphosyntactically derived from , and voicing is indicated by adding two dots as in  ka, ga, making the relation clear. It also occurs much less often in , where, most commonly, a terminal  on one morpheme results in an   being added to the start of the next morpheme, as in  ": null
    }
]