[
    {
        "      Santos Benigno Laciar , known familiarly as Santos Laciar and nicknamed Falucho, is an Argentine who was boxings world ": null
    },
    {
        "flyweight": "flyweight"
    },
    {
        " and ": null
    },
    {
        "super flyweight": "super flyweight"
    },
    {
        " champion.       Laciar was born in ": null
    },
    {
        "Huinca Renancó": "huinca renancó"
    },
    {
        ", in the ": null
    },
    {
        "province of Córdoba, Argentina": "province of córdoba, argentina"
    },
    {
        ".     Laciar began his career in his hometown, on December 42 of 42 knocking out ": null
    },
    {
        "Carlos Maliene": "carlos maliene"
    },
    {
        " in four rounds. After three more wins, all by ": null
    },
    {
        "knockout": "knockout"
    },
    {
        ", he was faced with ": null
    },
    {
        "Alejandro Holguin": "alejandro holguin"
    },
    {
        ", who held him to a ten-round draw, becoming the first boxer to face Laciar and not come out on the losing end. After three more wins, he drew once again, this time against ": null
    },
    {
        "Jose Ibiris": "jose ibiris"
    },
    {
        ", but in his next fight, he was able to take the Córdoba State Flyweight title away from ": null
    },
    {
        "Carlos Reyes Sosa": "carlos reyes sosa"
    },
    {
        " in ": null
    },
    {
        "Villa María": "villa maría"
    },
    {
        " with a 42-round decision. He finished 42 with four more wins, including a knockout in six in a rematch with Reyes Sosa.     In 42 he had 42 fights, for an average of slightly more than one fight per month. Among his fights that year: a rematch with Ibiris, which ended in a ten-round decision win for Laciar, two fights versus contender ": null
    },
    {
        "Ramon Soria": "ramon soria"
    },
    {
        ", which ended in a draw and in Laciars first defeat, a 42-round decision loss, a fight with ": null
    },
    {
        "Luis Gerez": "luis gerez"
    },
    {
        ", who drew with Laciar, and Laciars ": null
    },
    {
        "Buenos Aires": "buenos aires"
    },
    {
        " debut, a 42-round decision win over ": null
    },
    {
        "Angel Luis Fernandez": "angel luis fernandez"
    },
    {
        ".     42 was another busy year for Laciar, boxing 42 times again during that year. He won 42 of those bouts. Among his fights in 42 a loss to future world ": null
    },
    {
        "Junior bantamweight": "junior bantamweight"
    },
    {
        " champion ": null
    },
    {
        "Gustavo Ballas": "gustavo ballas"
    },
    {
        ", who beat him in 42 on points, a rubber match with Ibris, resulting in another Laciar 42-round decision win, two decision losses to ": null
    },
    {
        "Raúl Pérez": "raúl pérez"
    },
    {
        ", and a 42-round decision win against top contender ": null
    },
    {
        "Federico Condori": "federico condori"
    },
    {
        ".     But early in 42 Laciar started what would turn out to be a great decade for him. He was matched with ": null
    },
    {
        "Miguel Lanzarte": "miguel lanzarte"
    },
    {
        " on February 42 of that year for the vacant Argentinian flyweight title and won the bout by a decision in 42 After a draw in ten against Condoris brother Ruben, he won four straight bouts, and on August 42 he challenged for the South American flyweight title. In what was his first fight outside Argentina, he and South American champion ": null
    },
    {
        "Jaime Miranda": "jaime miranda"
    },
    {
        " battled to an 42-round no contest in ": null
    },
    {
        "Santiago, Chile": "santiago, chile"
    },
    {
        ". After one more win over Federico Condori, Miranda returned the favor by travelling to Laciars country and this time, Laciar won the South American title with a 42-round decision win. Laciar finished the year by travelling to England, where he lost a 42-round decision to future world champion ": null
    },
    {
        "Charlie Magri": "charlie magri"
    },
    {
        ".     In 42 one day before his birthday, he beat ": null
    },
    {
        "Jose de la Cruz": "josé de la cruz"
    },
    {
        " in ": null
    },
    {
        "Mar del Plata": "mar del plata"
    },
    {
        ". He was already ranked number one by the ": null
    },
    {
        "WBA": "world boxing association"
    },
    {
        ", and in March he flew to South Africa, where he beat ": null
    },
    {
        "Peter Mathebula": "peter mathebula"
    },
    {
        " on the 42th day of that month, by a knockout in seven rounds to become the worlds flyweight champion. After the retirement of ": null
    },
    {
        "Carlos Monzón": "carlos monzón"
    },
    {
        " in 42 and ": null
    },
    {
        "Victor Galindez": "victor galindez"
    },
    {
        " in 42 , Argentina was in need of a world champion boxer, and Laciar became a national hero instantly.     A rematch with Lanzarte, resulting in a 42-round non title decision win, followed, and then he fought at the Luna Park, where he lost his title to ": null
    },
    {
        "Luis Ibarra": "luis ibarra"
    },
    {
        ".     Ibarra lost his title in his first defense to ": null
    },
    {
        "Juan Herrera": "juan herrera"
    },
    {
        ", and after 42 more bouts, Laciar challenged Herrera in the champions hometown of ": null
    },
    {
        "Tampico": "tampico, tamaulipas"
    },
    {
        ", Mexico. Laciar recovered the crown by a knockout in 42 rounds, and this time, he wouldnt lose it again. He defended it for three years, after which he left it vacant. He defeated former world champion ": null
    },
    {
        "Betulio González": "betulio gonzález"
    },
    {
        " in ": null
    },
    {
        "Maracaibo": "maracaibo"
    },
    {
        ", ": null
    },
    {
        "Venezuela": "venezuela"
    },
    {
        " by a decision in 42 ": null
    },
    {
        "Steve Muchoki": "steve muchoki"
    },
    {
        " in ": null
    },
    {
        "Copenhagen": "copenhagen"
    },
    {
        ", Denmark by a knockout in 42 ": null
    },
    {
        "Ramon Neri": "ramon neri"
    },
    {
        " by a knockout in 42 at Córdoba, ": null
    },
    {
        "Shuichi Hozumi": "shuichi hozumi"
    },
    {
        " by a knockout in 42 in Japan, ": null
    },
    {
        "Hee Sup Chin": "hee sup chin"
    },
    {
        ", by a knockout in one in ": null
    },
    {
        "South Korea": "south korea"
    },
    {
        ", Juan Herrera, in a rematch at ": null
    },
    {
        "Marsala": "marsala"
    },
    {
        ", Italy, by a decision in 42 former world champion ": null
    },
    {
        "Prudencio Cardona": "prudencio cardona"
    },
    {
        " by a knockout in 42 in Córdoba, former two-time world Junior Flyweight champion ": null
    },
    {
        "Hilario Zapata": "hilario zapata"
    },
    {
        " by a decision in 42 at Buenos Aires, and ": null
    },
    {
        "Antoine Monteiro": "antoine monteiro"
    },
    {
        ", beaten by a knockout in 42 at Paris, France. After his fight with Monteiro, he decided to leave the world Flyweight championship vacant. His fame also surpassed the Argentinian borders and he became famous all over Latin America,  The Ring  s Spanish edition featuring him on the cover many times, as well as on posters and articles. He was also on the cover of  Guantes  magazine multiple times during his second period as champion.     On June 42 42 he and Jaime Miranda had a rubber match, Laciar winning a ten-round decision, and two months later, the Mexican world Junior Bantamweight champion, the late ": null
    },
    {
        "Gilberto Roman": "gilberto roman"
    },
    {
        ", travelled to Argentina to defend his ": null
    },
    {
        "WBC": "world boxing council"
    },
    {
        " and ": null
    },
    {
        "Lineal": "lineal championship"
    },
    {
        " crown versus Laciar, the fight ending in a 42-round draw.  Six more wins followed, including one against ": null
    },
    {
        "Hector Patri": "hector patri"
    },
    {
        ", and then on May 42 of 42 he and Roman met again. This time the WBC chose a neutral place for the fight, but Laciar won the fight by a knockout in 42 at ": null
    },
    {
        "Reims": "reims"
    },
    {
        ", France,   becoming a world champion for the third time. However, in his first title defense, Laciar was on the losing end of a decision against ": null
    },
    {
        "Colombia": "colombia"
    },
    {
        "n ": null
    },
    {
        "Sugar Baby Rojas": "sugar baby rojas"
    },
    {
        " in ": null
    },
    {
        "Miami": "miami, florida"
    },
    {
        ".     Laciar kept on boxing and reeled off eight more straight wins, but on October 42 42 he was outpointed by ": null
    },
    {
        "Juan Carazo": "juan carazo"
    },
    {
        " in ": null
    },
    {
        "Caguas": "caguas"
    },
    {
        ", ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        ", by a decision in 42 rounds. Two more wins and another no contest followed, and, after Carazo lost in his title try against Roman by decision, it was Laciars turn to face the Mexican again. This time, they boxed in the Los Angeles suburb of ": null
    },
    {
        "Inglewood, California": "inglewood, california"
    },
    {
        ", and Roman came out victorious by a 42-round decision.     Roman would die in a car crash the next year, and all chances of a fourth bout between the two, which was a possibility that was being talked about, were dashed with Romans death.     Laciar fought three more bouts, all in 42 after which he decided to retire.     His final record was 42 wins, 42 losses, 42 draws and 42 fight ended in a no-contest, with 42 wins coming by knockout.            ": null
    }
]