[
    {
        "   Santiago de Compostela  is the capital of the ": null
    },
    {
        "autonomous community": "Autonomous Communities Of Spain"
    },
    {
        " of ": null
    },
    {
        "Galicia": "Galicia"
    },
    {
        ", in northwestern ": null
    },
    {
        "Spain": "Spain"
    },
    {
        ".     The city has its origin in the shrine of ": null
    },
    {
        "Saint James the Great": "Saint James The Great"
    },
    {
        ", now the ": null
    },
    {
        "Cathedral of Santiago de Compostela": "Cathedral Of Santiago De Compostela"
    },
    {
        ", as the destination of the ": null
    },
    {
        "Way of St. James": "Way Of St. James"
    },
    {
        ", a leading Catholic ": null
    },
    {
        "pilgrimage": "Pilgrimage"
    },
    {
        " route since the 9th century.  In 1985, the citys Old Town was designated a ": null
    },
    {
        "UNESCO World Heritage Site": "Unesco World Heritage Site"
    },
    {
        ".       Santiago is the local Galician evolution of ": null
    },
    {
        "Vulgar Latin": "Vulgar Latin"
    },
    {
        " Sanctus Iacobus ": null
    },
    {
        "Saint James": "Saint James"
    },
    {
        " . According to legend, Compostela derives from the ": null
    },
    {
        "Latin": "Latin Language"
    },
    {
        " Campus Stellae ; it seems unlikely, however, that this phrase could have yielded the modern Compostela under normal evolution from Latin to ": null
    },
    {
        "Medieval Galician": "Medieval Galician"
    },
    {
        ".     Other etymologies derive the name from Latin compositum, local Vulgar Latin Composita Tella, meaning burial ground , or simply from Latin compositella, meaning the well-composed one . Other sites in Galicia share this ": null
    },
    {
        "toponym": "Toponym"
    },
    {
        ", akin to Compostilla in the province of ": null
    },
    {
        "León": "León"
    },
    {
        ".         The ": null
    },
    {
        "cathedral": "Cathedral Of Santiago De Compostela"
    },
    {
        " borders the main plaza of the old and well-preserved city. According to medieval legend, the remains of the apostle ": null
    },
    {
        "James": "James, Son Of Zebedee"
    },
    {
        " were brought to Galicia for burial; in 813, the light of a bright star guided a shepherd who was watching his flock at night to the burial site in Santiago de Compostela. Marilyn Stokstad,Santiago de Compostela in the Age of the Great Pilgrimages., 7. This site was originally called Mount Libredon and its physical topography leads prevalent sea borne winds to clear the cloud deck immediately overhead.   The shepherd quickly reported his discovery to the bishop of Iria, Bishop Teodomiro. Stokstad, Santiago de Compostela, 8. The bishop declared that the remains were those of the apostle James and immediately notified King Alfonso II in ": null
    },
    {
        "Oviedo": "Oviedo"
    },
    {
        ". To honour St. James, the cathedral was built on the spot where his remains were said to have been found. The ": null
    },
    {
        "legend": "Legend"
    },
    {
        ", which included numerous miraculous events, enabled the Catholic faithful to bolster support for their stronghold in northern Spain during the Christian crusades against the Moors, but also led to the growth and development of the city. Stokstad, Santiago de Compostela, 6.     Along the western side of the Praza do Obradoiro is the elegant 18th-century Pazo de Raxoi, now the city hall. Across the square is the Pazo de Raxoi , the town hall, and on the right from the cathedral steps is the ": null
    },
    {
        "Hostal dos Reis Católicos": "Hostal Dos Reis Católicos"
    },
    {
        ", founded in 1492 by the ": null
    },
    {
        "Catholic Monarchs": "Catholic Monarchs"
    },
    {
        ", ": null
    },
    {
        "Isabella of Castille": "Isabella Of Castille"
    },
    {
        " and ": null
    },
    {
        "Ferdinand II of Aragon": "Ferdinand Ii Of Aragon"
    },
    {
        ", as a pilgrims hospice . The Obradoiro façade of the cathedral, the best known, is depicted on the ": null
    },
    {
        "Spanish euro coins": "Spanish Euro Coins"
    },
    {
        " of 1 cent, 2 cents, and 5 cents .     Santiago is the site of the ": null
    },
    {
        "University of Santiago de Compostela": "University Of Santiago De Compostela"
    },
    {
        ", established in the early 16th century. The main campus can be seen best from an alcove in the large municipal park in the centre of the city.     Within the old town there are many narrow winding streets full of historic buildings. The new town all around it has less character though some of the older parts of the new town have some big flats in them.     Santiago de Compostela has a substantial nightlife. Both in the new town  and the old town , a mix of middle-aged residents and younger students maintain a lively presence until the early hours of the morning. Radiating from the centre of the city, the historic cathedral is surrounded by paved granite streets, tucked away in the old town, and separated from the newer part of the city by the largest of many parks throughout the city, Parque da Alameda.     Santiago gives its name to one of the four military orders of Spain: ": null
    },
    {
        "Santiago": "Order Of Santiago"
    },
    {
        ", ": null
    },
    {
        "Calatrava": "Order Of Calatrava"
    },
    {
        ", ": null
    },
    {
        "Alcántara": "Order Of Alcantara"
    },
    {
        " and ": null
    },
    {
        "Montesa": "Order Of Montesa"
    },
    {
        ".     One of the most important economic centres in Galicia, Santiago is the seat for organisations like ": null
    },
    {
        "Association for Equal and Fair Trade Pangaea": "Association For Equal And Fair Trade Pangaea"
    },
    {
        ".       Under the ": null
    },
    {
        "Köppen climate classification": "Köppen Climate Classification"
    },
    {
        ", Santiago de Compostela has a temperate ": null
    },
    {
        "oceanic": "Oceanic Climate"
    },
    {
        "  climate, with mild to warm and somewhat dry summers and mild, wet winters. The prevailing winds from the ": null
    },
    {
        "Atlantic": "Atlantic Ocean"
    },
    {
        " and the surrounding mountains combine to give Santiago some of Spains highest rainfall: about  annually. The climate is mild: frosts are common only in December, January and February, with an average of just 8 days per year, In the five years 2006–2010, cf.  . while snow is rare; temperatures over  are exceptional.                      The city is governed by a ": null
    },
    {
        "mayor-council form of government": "Mayor-Council Government"
    },
    {
        ". Following the ": null
    },
    {
        "May 24, 2015 municipal elections": "Spanish Municipal Elections, 2015"
    },
    {
        " the ": null
    },
    {
        "mayor": "Alcalde"
    },
    {
        " of Santiago is ": null
    },
    {
        "Martiño Noriega Sánchez": "Martiño Noriega Sánchez"
    },
    {
        " of ": null
    },
    {
        "Compostela Aberta": "Compostela Aberta"
    },
    {
        " . . El Correo Gallego, 13 June 2015. No party has a majority in the city council .                 The population of the city in 2012 was 95,671 inhabitants, while the metropolitan area reaches 178,695.     In 2010 there were 4,111 foreigners living in the city, representing 4.3% of the total population. The main nationalities are ": null
    },
    {
        "Brazilians": "Brazilians"
    },
    {
        " , ": null
    },
    {
        "Portuguese": "Portuguese People"
    },
    {
        " and ": null
    },
    {
        "Colombians": "Colombian Diaspora"
    },
    {
        " .     By language, according to 2008 data, 21.17% of the population always speak in ": null
    },
    {
        "Galician": "Galician Language"
    },
    {
        ", 15% always speak in Spanish, 31% mostly in ": null
    },
    {
        "Galician": "Galician Language"
    },
    {
        " and the 32.17% mostly in Spanish.  According to a ": null
    },
    {
        "Xunta de Galicia": "Xunta De Galicia"
    },
    {
        " 2010 study the 38.5% of the city primary and secondary education students had ": null
    },
    {
        "Galician": "Galician Language"
    },
    {
        " as their ": null
    },
    {
        "mother tongue": "Mother Tongue"
    },
    {
        ".                            The area of Santiago de Compostela was a Roman cemetery by the 4th century  and was occupied by the ": null
    },
    {
        "Suebi": "Suebi"
    },
    {
        " in the early 5th century, when they settled in Galicia and Portugal during the initial ": null
    },
    {
        "collapse of the Roman Empire": "Migration Period"
    },
    {
        ". The area was later attributed to the ": null
    },
    {
        "bishopric": "Bishopric"
    },
    {
        " of ": null
    },
    {
        "Iria Flavia": "Iria Flavia"
    },
    {
        " in the 6th century, in the partition usually known as Parochiale Suevorum, ordered by King ": null
    },
    {
        "Theodemar": "Theodemar"
    },
    {
        ". In 585, the settlement was annexed along with the rest of ": null
    },
    {
        "Suebi Kingdom": "Suebi Kingdom"
    },
    {
        " by ": null
    },
    {
        "Leovigild": "Liuvigild"
    },
    {
        " as the sixth province of the ": null
    },
    {
        "Visigothic Kingdom": "Visigothic Kingdom"
    },
    {
        ".     Possibly raided from 711 to 739 by the ": null
    },
    {
        "Arabs": "Arabs"
    },
    {
        "   , the bishopric of Iria was incorporated into the ": null
    },
    {
        "Kingdom of Asturias": "Kingdom Of Asturias"
    },
    {
        " c. 750    . At some point between 818 and 842,  during the reign of ": null
    },
    {
        "Alfonso II of Asturias": "Alfonso Ii Of Asturias"
    },
    {
        "   , bishop ": null
    },
    {
        "Theodemar of Iria": "Theodemar Of Iria"
    },
    {
        " claimed to have found some remains which were attributed to ": null
    },
    {
        "Saint James the Greater": "Saint James The Greater"
    },
    {
        ". This discovery was accepted in part because the ": null
    },
    {
        "Leo III": "Pope Leo Iii"
    },
    {
        "  and ": null
    },
    {
        "Charlemagne": "Charlemagne"
    },
    {
        "—who had died in 814—had acknowledged Asturias as a kingdom and Alfonso II as king, and had also crafted close political and ecclesiastic ties.  Around the place of the discovery a new settlement and centre of pilgrimage emerged, which was known to the author ": null
    },
    {
        "Usuard": "Usuard"
    },
    {
        " in 865  and which was called Compostella by the 10th century.     The cult of Saint James of Compostela was just one of many arising throughout northern Iberia during the 10th and 11th centuries, as rulers encouraged their own region-specific cults, such as ": null
    },
    {
        "Saint Eulalia": "Eulalia Of Mérida"
    },
    {
        " in Oviedo and ": null
    },
    {
        "Saint Aemilian": "Emilian Of Cogolla"
    },
    {
        " in Castile.  After the centre of Asturian political power moved from Oviedo to León in 910, Compostela became more politically relevant, and several ": null
    },
    {
        "kings of Galicia": "List Of Monarchs Of Galicia"
    },
    {
        " and ": null
    },
    {
        "of León": "List Of Leonese Monarchs"
    },
    {
        " were acclaimed by the Galician noblemen and crowned and anointed by the local bishop at the cathedral, among them ": null
    },
    {
        "Ordoño IV": "Ordoño Iv Of León"
    },
    {
        " in 958,  ": null
    },
    {
        "Bermudo II": "Bermudo Ii Of León"
    },
    {
        " in 982, and ": null
    },
    {
        "Alfonso VII": "Alfonso Vii Of León"
    },
    {
        " in 1111, by which time Compostela had become capital of the ": null
    },
    {
        "Kingdom of Galicia": "Kingdom Of Galicia"
    },
    {
        ". Later, 12th-century kings were also sepulchered in the cathedral, namely ": null
    },
    {
        "Fernando II": "Fernando Ii Of León"
    },
    {
        " and ": null
    },
    {
        "Alfonso IX": "Alfonso Ix"
    },
    {
        ", last of the Kings of León and Galicia before both kingdoms were united with the ": null
    },
    {
        "Kingdom of Castile": "Kingdom Of Castile"
    },
    {
        ".     During this same 10th century and in the first years of the 11th century ": null
    },
    {
        "Viking": "Viking"
    },
    {
        " raiders tried to assault the town  —Galicia is known in the Nordic sagas as Jackobsland or Gallizaland—and bishop Sisenand II, who was killed in battle against them in 968,  ordered the construction of a walled fortress to protect the sacred place. In 997 Compostela was assaulted and partially destroyed by ": null
    },
    {
        "Ibn Abi Aamir": "Almanzor"
    },
    {
        " , Andalusian leader accompanied in his raid by Christian lords, who all received a share of the booty.  However, the Andalusian commander showed no interest in the alleged relics of St James. In response to these challenges bishop ": null
    },
    {
        "Cresconio": "Cresconio"
    },
    {
        ", in the mid-11th century, fortified the entire town, building walls and defensive towers.     According to some authors, by the middle years of the 11th century the site had already become a pan-European ": null
    },
    {
        "place of peregrination": "Way Of Saint James"
    },
    {
        ",  while others maintain that the cult to Saint James was before 11-12th centuries an essentially Galician affair, supported by Asturian and Leonese kings to win over faltering Galician loyalties. Santiago would become in the course of the following century a main Catholic shrine second only to Rome and ": null
    },
    {
        "Jerusalem": "Jerusalem"
    },
    {
        ". In the 12th century, under the impulse of bishop ": null
    },
    {
        "Diego Gelmírez": "Diego Gelmírez"
    },
    {
        ", Compostela became an archbishopric, attracting a large and multinational population. Under the rule of this ": null
    },
    {
        "prelate": "Prelate"
    },
    {
        ", the townspeople rebelled, headed by the local council, beginning a secular tradition of confrontation by the people of the city—who fought for self-government—against the local bishop, the secular and jurisdictional lord of the city and of its fief, the semi-independent Terra de Santiago . The culminating moment in this confrontation was reached in the 14th century, when the new prelate, the Frenchman ": null
    },
    {
        "Bérenger de Landore": "Bérenger De Landore"
    },
    {
        ", treacherously executed the counselors of the city in his castle of A Rocha Forte , after inviting them for talks.     Santiago de Compostela was captured and sacked by the French during the ": null
    },
    {
        "Napoleonic Wars": "Napoleonic Wars"
    },
    {
        "; as a result, the remains attributed to the apostle were lost for near a century, hidden inside a ": null
    },
    {
        "cist": "Cist"
    },
    {
        " in the ": null
    },
    {
        "crypts": "Crypt"
    },
    {
        "of the cathedral of the city.     The excavations conducted in the cathedral during the 19th and 20th centuries uncovered a Roman cella memoriae or ": null
    },
    {
        "martyrium": "Martyrium"
    },
    {
        ", around which grew a small cemetery in Roman and ": null
    },
    {
        "Suevi": "Suebi"
    },
    {
        " times which was later abandoned. This martyrium, which proves the existence of an old Christian ": null
    },
    {
        "holy place": "Holy Placeschristianity"
    },
    {
        ", has been sometimes attributed to ": null
    },
    {
        "Priscillian": "Priscillian"
    },
    {
        ", although without further proof.        Santiagos economy, although still heavily dependent on public administration , cultural tourism, industry, and higher education through its ": null
    },
    {
        "university": "University Of Santiago De Compostela"
    },
    {
        ", is becoming increasingly diversified. New industries such as timber transformation , the automotive industry , and telecommunications and electronics have been established. Banco Gallego, a banking institution owned by ": null
    },
    {
        "Novacaixagalicia": "Novacaixagalicia"
    },
    {
        ", has its headquarters in downtown rúa do Hórreo.     Tourism is very important thanks to the ": null
    },
    {
        "Way of St. James": "Way Of St. James"
    },
    {
        ", particularly in Holy Compostelan Years . Following the Xuntas considerable investment and hugely successful advertising campaign for the Holy Year of 1993, the number of pilgrims completing the route has been steadily rising. More than 272,000 pilgrims made the trip during the course of the Holy Year of 2010. Following 2010, the next Holy Year will not be for another 11 years when St James feast day again falls on a Sunday. Outside of Holy Years, the city still receives a remarkable number of pilgrims. In 2013, 215,880 people completed the pilgrimage. In 2014, there were 237,983 persons. In 2015, there were 262,513 persons and in 2016, there were 277,854 persons.      Editorial Compostela owns daily newspaper El Correo Gallego, a local TV, and a radio station. Galician language online news portal Galicia Hoxe is also based in the city. ": null
    },
    {
        "Televisión de Galicia": "Televisión De Galicia"
    },
    {
        ", the ": null
    },
    {
        "public broadcaster": "Public Broadcaster"
    },
    {
        " corporation of Galicia, has its headquarters in Santiago.                   The legend that St James found his way to the ": null
    },
    {
        "Iberian Peninsula": "Iberian Peninsula"
    },
    {
        " and had preached there is one of a number of early traditions concerning the missionary activities and final resting places of the apostles of Jesus. Although the 1884 ": null
    },
    {
        "Bull": "Papal Bull"
    },
    {
        " of ": null
    },
    {
        "Pope Leo XIII": "Pope Leo Xiii"
    },
    {
        " Omnipotens Deus accepted the authenticity of the relics at Compostela, the ": null
    },
    {
        "Vatican": "Holy See"
    },
    {
        " remains uncommitted as to whether the relics are those of ": null
    },
    {
        "Saint James the Greater": "Saint James The Greater"
    },
    {
        ", while continuing to promote the more general benefits of pilgrimage to the site. Pope Benedict XVI undertook a ceremonial pilgrimage to the site on his visit to Spain in 2010.        According to a tradition that can be traced back at least to the 12th century, when it was recorded in the  Codex Calixtinus , Saint James decided to return to the ": null
    },
    {
        "Holy Land": "Holy Land"
    },
    {
        " after preaching in Galicia. There he was beheaded, but his disciples got his body to ": null
    },
    {
        "Jaffa": "Jaffa"
    },
    {
        ", where they found a marvelous ": null
    },
    {
        "stone ship": "Stone Ship"
    },
    {
        " which miraculously conducted them and the apostles body to ": null
    },
    {
        "Iria Flavia": "Iria Flavia"
    },
    {
        ", back in Galicia. There, the disciples asked the local pagan queen Loba for permission to bury the body; she, annoyed, decided to deceive them, sending them to pick a pair of oxen she allegedly had by the Pico Sacro, a local sacred mountain where a ": null
    },
    {
        "dragon": "Dragon"
    },
    {
        " dwelt, hoping that the dragon would kill the Christians, but as soon as the beast attacked the disciples, at the sight of the cross, the dragon exploded. Then the disciples marched to collect the oxen, which were actually wild bulls which the queen used to punish her enemies; but again, at the sight of the Christians cross, the bulls calmed down, and after being subjected to a yoke they carried the apostles body to the place where now Compostela is. The legend was again referred with minor changes by the ": null
    },
    {
        "Czech": "Czech People"
    },
    {
        " traveller ": null
    },
    {
        "Jaroslav Lev of Rožmitál": "Jaroslav Lev Of Rožmitál"
    },
    {
        ", in the 15th century.      The relics were said to have been later rediscovered in the 9th century by a hermit named Pelagius, who after observing strange lights in a local forest went for help after the local bishop, ": null
    },
    {
        "Theodemar of Iria": "Theodemar Of Iria"
    },
    {
        ", in the west of Galicia. The legend affirms that Theodemar was then guided to the spot by a star, drawing upon a familiar myth-element, hence Compostela was given an ": null
    },
    {
        "etymology": "Etymology"
    },
    {
        " as a corruption of Campus Stellae, Field of Stars.     In the 15th century, the red banner which guided the Galician armies to battle, was still preserved in the Cathedral of Santiago de Compostela, in the centre Saint James riding a white horse and wearing a white cloak, sword in hand:  The legend of the miraculous armed intervention of Saint James, disguised as a white knight to help the Christians when battling the Muslims, was a recurrent myth during the High Middle Ages.          The 1,000-year-old pilgrimage to the shrine of ": null
    },
    {
        "St. James": "Saint James The Great"
    },
    {
        " in the Cathedral of Santiago de Compostela is known in English as the ": null
    },
    {
        "Way of St. James": "Way Of St. James"
    },
    {
        " and in Spanish as the Camino de Santiago. Over 200,000 pilgrims travel to the city each year from points all over Europe and other parts of the world. The pilgrimage has been the subject of many books, television programmes, and films, notably ": null
    },
    {
        "Brian Sewells": "Brian Sewell"
    },
    {
        "  The Naked Pilgrim  produced for the British television channel ": null
    },
    {
        "Channel 5": "Channel 5"
    },
    {
        " and the ": null
    },
    {
        "Martin Sheen": "Martin Sheen"
    },
    {
        "/": null
    },
    {
        "Emilio Estevez": "Emilio Estevez"
    },
    {
        " collaboration  The Way .       As the lowest-lying land on that stretch of coast, the citys site took on added significance. Legends supposed of ": null
    },
    {
        "Celtic": "Celtic Mythology"
    },
    {
        " origin made it the place where the ": null
    },
    {
        "souls": "Soul"
    },
    {
        "of the dead gathered to follow the sun across the sea. Those unworthy of going to the Land of the Dead haunted Galicia as the  Santa Compaña  or Estadea.          Santiago de Compostela is featured prominently in the 1988 historical fiction novel  Sharpes Rifles , by ": null
    },
    {
        "Bernard Cornwell": "Bernard Cornwell"
    },
    {
        ", which takes place during the French Invasion of Galicia, January 1809, during the Napoleonic Wars.     The music video for  Una Cerveza , by ": null
    },
    {
        "Ráfaga": "Ráfaga"
    },
    {
        ", is set in the historic part of Santiago de Compostela.     A pilgrimage to Santiago de Compostela provides the narrative framework of the ": null
    },
    {
        "Luis Buñuel": "Luis Buñuel"
    },
    {
        " film ": null
    },
    {
        "La Voie lactée ": "The Milky Way"
    },
    {
        ".     A mystic pilgrimage was portrayed in the autobiography and romance ": null
    },
    {
        "The Pilgrimage": "The Pilgrimage"
    },
    {
        " of Brazilian writer ": null
    },
    {
        "Paulo Coelho": "Paulo Coelho"
    },
    {
        ", published in 1987.       ": null
    },
    {
        "Cathedral of Santiago de Compostela": "Cathedral Of Santiago De Compostela"
    },
    {
        " Pazo de Raxoi": "Pazo De Raxoi"
    },
    {
        " – city hall and office of the ": null
    },
    {
        "President of the Xunta of Galicia": "President Of The Xunta Of Galicia"
    },
    {
        " Colexiata de Santa María do Sar": "Church Of Santa María A Real Do Sar"
    },
    {
        " Baroque": "Baroque Architecture"
    },
    {
        " Abbey of San Martín Pinario": "Monasterio De San Martín Pinario"
    },
    {
        " University of Santiago de Compostela": "University Of Santiago De Compostela"
    },
    {
        " Alvaro Siza Vieira": "Alvaro Siza Vieira"
    },
    {
        " Eduardo Chillida": "Eduardo Chillida"
    },
    {
        " and ": null
    },
    {
        "Alvaro Siza Vieira": "Alvaro Siza Vieira"
    },
    {
        " City of Culture of Galicia": "City Of Culture Of Galicia"
    },
    {
        ", designed by ": null
    },
    {
        "Peter Eisenman": "Peter Eisenman"
    },
    {
        "    Santiago de Compostela is served by ": null
    },
    {
        "Santiago de Compostela Airport": "Santiago De Compostela Airport"
    },
    {
        " and a ": null
    },
    {
        "rail service": "Renfe"
    },
    {
        ".       ": null
    },
    {
        "Santiago de Compostela Airport": "Santiago De Compostela Airport"
    },
    {
        " is the ": null
    },
    {
        "2nd busiest airport": "List Of The Busiest Airports In Spain"
    },
    {
        " in ": null
    },
    {
        "northern Spain": "Green Spain"
    },
    {
        " after ": null
    },
    {
        "Bilbao Airport": "Bilbao Airport"
    },
    {
        ". The airport is located in the parish of Lavacolla, 12  km from the city center and handled 2,644,925 passengers in 2017.       ": null
    },
    {
        "Santiago de Compostela railway station": "Santiago De Compostela Railway Station"
    },
    {
        " is linked to the ": null
    },
    {
        "Spanish High Speed Railway Network": "Ave"
    },
    {
        ". ": null
    },
    {
        "Madrid": "Madrid"
    },
    {
        " is reached in about 5 hours and 10 minutes.     ": null
    },
    {
        "Porto": "Porto"
    },
    {
        " can also be reached in less than 5 hours changing to the ": null
    },
    {
        "Celta train": "Celta Train"
    },
    {
        " in ": null
    },
    {
        "Vigo": "Vigo"
    },
    {
        ".      On 24 July 2013 there was a ": null
    },
    {
        "serious rail accident": "Santiago De Compostela Derailment"
    },
    {
        " near the city in which 79 people died and at least 130 were injured when a train derailed on a bend as it approached Compostela station. , BBC News, 26 July 2013. Retrieved 26 July 2013.       ": null
    },
    {
        "Obradoiro CAB": "Obradoiro Cab"
    },
    {
        "  -  ": null
    },
    {
        "SD Compostela": "Sd Compostela"
    },
    {
        "  -  ": null
    },
    {
        "Santiago Futsal": "Santiago Futsal"
    },
    {
        "  -  ": null
    },
    {
        "Black Ravens": "Santiago Black Ravens"
    },
    {
        "  -  ": null
    },
    {
        "Escudería Compostela": "Escudería Compostela"
    },
    {
        "  -  ": null
    },
    {
        "Santiago Rugby Club": "Santiago Rugby Club"
    },
    {
        "                  Bernal de Bonaval": "Bernal De Bonaval"
    },
    {
        " a 13th-century ": null
    },
    {
        "troubadour": "Troubadour"
    },
    {
        " in the ": null
    },
    {
        "Kingdom of Galicia": "Kingdom Of Galicia"
    },
    {
        " who wrote in the ": null
    },
    {
        "Galician-Portuguese": "Galician-Portuguese"
    },
    {
        " language.   ": null
    },
    {
        "Sancho de Andrade de Figueroa": "Sancho De Andrade De Figueroa"
    },
    {
        " a Roman Catholic prelate, ": null
    },
    {
        "Bishop of Quito": "Bishop Of Quito"
    },
    {
        " and ": null
    },
    {
        "Bishop of Ayacucho o Huamanga": "Bishop Of Ayacucho O Huamanga"
    },
    {
        "   Juan Antonio García de Bouzas": "Juan Antonio García De Bouzas"
    },
    {
        " a Spanish Baroque painter, his principal works are in the churches at Santiago   ": null
    },
    {
        "Eugenio Montero Ríos": "Eugenio Montero Ríos"
    },
    {
        " politician, served briefly as ": null
    },
    {
        "Prime Minister of Spain": "Prime Minister Of Spain"
    },
    {
        " in ": null
    },
    {
        "1905": "List Of Prime Ministers Of Spain"
    },
    {
        " Rosalía de Castro": "Rosalía De Castro"
    },
    {
        " a Spanish romanticist writer and poet   Antonio Machado Álvarez known by his pseudonym ": null
    },
    {
        "Demófilo": "Demófilo"
    },
    {
        " a writer, anthropologist and Spanish folklorist.   ": null
    },
    {
        "Modesto Brocos": "Modesto Brocos"
    },
    {
        " a Brazilian painter, designer and engraver of Galician origin.   ": null
    },
    {
        "Carmen Babiano Méndez-Núñez": "Carmen Babiano Méndez-Núñez"
    },
    {
        " a Spanish painter and a pioneer in feminine art   ": null
    },
    {
        "Manuel Maria Puga y Parga": "Manuel Maria Puga Y Parga"
    },
    {
        " aka Picadillo a culinary writer and gastronome, popularized traditional Galician cooking   ": null
    },
    {
        "José Robles": "José Robles"
    },
    {
        " a Spanish academic, left-wing activist, born to an aristocratic family, went into exile in the USA   ": null
    },
    {
        "Juan Sáenz-Díez García": "Juan Sáenz-Díez García"
    },
    {
        " a Spanish entrepreneur and ": null
    },
    {
        "Carlist": "Carlist"
    },
    {
        " politician   ": null
    },
    {
        "Xerardo Fernández Albor": "Xerardo Fernández Albor"
    },
    {
        " a Galician physician and politician, ": null
    },
    {
        "president of Galicia": "President Of The Xunta Of Galicia"
    },
    {
        " from 1981 to 1987   ": null
    },
    {
        "Isaac Díaz Pardo": "Isaac Díaz Pardo"
    },
    {
        " a Galician intellectual and painter, ceramist, designer, editor and businessman.   ": null
    },
    {
        "Xohana Torres": "Xohana Torres"
    },
    {
        " a Spanish writer, poet, playwright, and member of the ": null
    },
    {
        "Royal Galician Academy": "Royal Galician Academy"
    },
    {
        " Adela Akers": "Adela Akers"
    },
    {
        " a Spanish-born textile and fiber artist, raised in Peru and Cuba, now lives in ": null
    },
    {
        "Guerneville, California": "Guerneville, California"
    },
    {
        " Xosé Manuel Beiras": "Xosé Manuel Beiras"
    },
    {
        " a Galician politician, economist, writer and intellectual   ": null
    },
    {
        "Roberto Vidal Bolaño": "Roberto Vidal Bolaño"
    },
    {
        " a Galician playwright and actor, celebrated by ": null
    },
    {
        "Galician Literature Day": "Galician Literature Day"
    },
    {
        " in 2013   ": null
    },
    {
        "Ana Romero Masiá": "Ana Romero Masiá"
    },
    {
        " a Galician historian, archaeologist and academic   ": null
    },
    {
        "Mariano Rajoy": "Mariano Rajoy"
    },
    {
        " a Spanish politician, ": null
    },
    {
        "Prime Minister of Spain": "Prime Minister Of Spain"
    },
    {
        " from 2011 to 2018   ": null
    },
    {
        "Suso de Toro": "Suso De Toro"
    },
    {
        " a Spanish writer of more than twenty novels and plays in Galician   ": null
    },
    {
        "Carlos Ferrás Sexto": "Carlos Ferrás Sexto"
    },
    {
        " a Galician geographer and academic   ": null
    },
    {
        "Octavio Vázquez": "Octavio Vázquez"
    },
    {
        " a Galician-American, New York-based composer of classical music   ": null
    },
    {
        "Yolanda Castaño": "Yolanda Castaño"
    },
    {
        " a Galician painter, literary critic and poet       Andrés Domínguez Candal aka ": null
    },
    {
        "Pierita": "Pierita"
    },
    {
        " a Spanish footballer who played as a forward   ": null
    },
    {
        "José Luis Veloso": "José Luis Veloso"
    },
    {
        " a retired Spanish footballer, 278 pro appearances   ": null
    },
    {
        "Tomás Reñones": "Tomás Reñones"
    },
    {
        " known as Tomás, a retired Spanish footballer, nearly 500 pro appearances   ": null
    },
    {
        "Moncho Fernández": "Moncho Fernández"
    },
    {
        " a Spanish basketball manager and coach   ": null
    },
    {
        "Emilio José Viqueira": "Emilio José Viqueira"
    },
    {
        " a retired Spanish footballer who made 454 pro appearances   ": null
    },
    {
        "Manuel Castiñeiras": "Manuel Castiñeiras"
    },
    {
        " a Spanish retired footballer, over 300 pro appearances   ": null
    },
    {
        "Rubén González Rocha": "Rubén González Rocha"
    },
    {
        " known as Rubén, is a Spanish professional footballer who plays as a central defender   ": null
    },
    {
        "Borja Golan": "Borja Golan"
    },
    {
        " a professional squash player who represents Spain   ": null
    },
    {
        "Iván Carril": "Iván Carril"
    },
    {
        " a Spanish professional footballer   ": null
    },
    {
        "Verónica Boquete": "Verónica Boquete"
    },
    {
        " a Galician-born Spanish footballer   ": null
    },
    {
        "José Ángel Antelo": "José Ángel Antelo"
    },
    {
        " a Spanish professional basketball player   ": null
    },
    {
        "Alberto Manuel Domínguez Rivas": "Alberto Manuel Domínguez Rivas"
    },
    {
        " known as Alberto, is a Spanish footballer who plays as a goalkeeper                 Santiago de Compostela is ": null
    },
    {
        "twinned": "Twin Towns And Sister Cities"
    },
    {
        " with:   ": null
    }
]