[
    {
        "           Sappho  was an ": null
    },
    {
        "Archaic Greek": "Archaic Greek"
    },
    {
        " poet from the island of ": null
    },
    {
        "Lesbos": "Lesbos"
    },
    {
        ". Sappho is known for her ": null
    },
    {
        "lyric poetry": "Greek Lyric"
    },
    {
        ", written to be sung while accompanied by a ": null
    },
    {
        "lyre": "Lyre"
    },
    {
        ". In ancient times, Sappho was widely regarded as one of the greatest lyric poets and was given names such as the Tenth Muse and The Poetess . Most of ": null
    },
    {
        "Sapphos poetry": "Poetry Of Sappho"
    },
    {
        " is now lost, and what is extant has survived only in fragmentary form, except for one complete poem: the ": null
    },
    {
        "Ode to Aphrodite": "Ode To Aphrodite"
    },
    {
        " . As well as lyric poetry, ancient commentators claimed that Sappho wrote elegiac and iambic poetry. Three epigrams attributed to Sappho are extant, but these are actually ": null
    },
    {
        "Hellenistic": "Hellenistic"
    },
    {
        " imitations of Sapphos style.     Little is known of Sapphos life. She was from a wealthy family from Lesbos, though her parents names are uncertain. Ancient sources say that she had three brothers; the names of two of them, Charaxos and Larichos, are mentioned in the ": null
    },
    {
        "Brothers Poem": "Brothers Poem"
    },
    {
        " discovered in 2014. She was exiled to Sicily around 600 BC, and may have continued to work until around 570. Later legends surrounding Sapphos love for the ferryman ": null
    },
    {
        "Phaon": "Phaon"
    },
    {
        " and her death are unreliable.     Sappho was a prolific poet, probably composing around 10,000 lines. Her poetry was well-known and greatly admired through much of ": null
    },
    {
        "antiquity": "Classical Antiquity"
    },
    {
        ", and she was among the canon of ": null
    },
    {
        "nine lyric poets": "Nine Lyric Poets"
    },
    {
        " most highly esteemed by scholars of ": null
    },
    {
        "Hellenistic": "Hellenistic Period"
    },
    {
        " Alexandria. Sapphos poetry is still considered extraordinary and her works continue to influence other writers. Beyond her poetry, she is well known as a symbol of ": null
    },
    {
        "love and desire between women": "Lesbianism"
    },
    {
        ", with the English words  sapphic  and  lesbian  being derived from her own name and the name of her home island respectively.            There are three sources of information about Sapphos life: her testimonia, the history of her times, and what can be gleaned from her own poetry — although scholars are cautious when reading poetry as a biographical source.     Testimonia is a term of art in ancient studies that refers to collections of classical biographical and literary references to classical authors. The testimonia regarding Sappho do not contain references contemporary to Sappho. The representations of Sapphos life that occur in the testimonia always need to be assessed for accuracy, because many of them are certainly not correct. The testimonia are also a source of knowledge regarding how Sapphos poetry was received in antiquity. Some details mentioned in the testimonia are derived from Sapphos own poetry, which is of great interest, especially considering the testimonia originate from a time when more of Sapphos poetry was extant than is the case for modern readers.       Little is known about Sapphos life for certain. She was from ": null
    },
    {
        "Mytilene": "Mytilene"
    },
    {
        " on the island of Lesbos and was probably born around 630 BC.   Tradition names her mother as Cleïs, though ancient scholars may simply have guessed this name, assuming that Sapphos daughter Cleïs was named after her. Sapphos fathers name is less certain. Ten names are known for Sapphos father from the ancient testimonia; this proliferation of possible names suggests that he was not explicitly named in any of Sapphos poetry. The earliest and most commonly attested name for Sapphos father is Scamandronymus. In Ovids  Heroides , Sapphos father died when she was seven. Sapphos father is not mentioned in any of her surviving works, but Campbell suggests that this detail may have been based on a now-lost poem. Sapphos own name is found in numerous variant spellings, even in her own Aeolian dialect; the form that appears in her own extant poetry is Psappho. Sappho, frr. 1.20, 65.5, 94.5, 133b      No reliable portrait of Sapphos physical appearance has survived; all extant representations, ancient and modern, are artists conceptions. In the ": null
    },
    {
        "Tithonus poem": "Tithonus Poem"
    },
    {
        " she describes her hair as now white but formerly melaina, i.e. black. A literary papyrus of the second century A.D. describes her as pantelos mikra, quite tiny. ": null
    },
    {
        "Alcaeus": "Alcaeus Of Mytilene"
    },
    {
        " possibly describes Sappho as violet-haired , Alcaeus fr. Loeb/L.P. 384. See n. 1 ad loc for an expression of the editors uncertainty. which was a common Greek poetic way of describing dark hair.  Some scholars dismiss this tradition as unreliable.          Sappho was said to have three brothers: Erigyius, Larichus, and Charaxus. According to Athenaeus, Sappho often praised Larichus for pouring wine in the town hall of Mytilene, an office held by boys of the best families. This indication that Sappho was born into an aristocratic family is consistent with the sometimes rarefied environments that her verses record. One ancient tradition tells of a relation between Charaxus and the Egyptian courtesan ": null
    },
    {
        "Rhodopis": "Rhodopis"
    },
    {
        ". Herodotus, the oldest source of the story, reports that Charaxus ransomed Rhodopis for a large sum and that Sappho wrote a poem rebuking him for this. Herodotus, Histories, 2.135     Sappho may have had a daughter named Cleïs, who is referred to in two fragments. Not all scholars accept that Cleïs was Sapphos daughter. Fragment 132 describes Cleïs as παῖς , which, as well as meaning child , can also refer to the youthful beloved in a male homosexual liaison . It has been suggested that Cleïs was one of Sapphos younger lovers, rather than her daughter, though ": null
    },
    {
        "Judith Hallett": "Judith Hallett"
    },
    {
        " argues that the language used in fragment 132 suggests that Sappho was referring to Cleïs as her daughter.     According to the ": null
    },
    {
        "Suda": "Suda"
    },
    {
        ", Sappho was married to Kerkylas of ": null
    },
    {
        "Andros": "Andros"
    },
    {
        ". However, the name appears to have been invented by a comic poet: the name Kerkylas comes from the word κέρκος , a possible meaning of which is penis , and is not otherwise attested as a name, while Andros , as well as being the name of a Greek island, is a form of the Greek word ἀνήρ , which means man. Thus, the name may be a joke name, and as such could be rendered as Dick Allcock from the Isle of Man .     Sappho and her family were exiled from Lesbos to Syracuse, Sicily, around 600 BC. The ": null
    },
    {
        "Parian Chronicle": "Parian Chronicle"
    },
    {
        " records Sappho going into exile some time between 604 and 591. This may have been as a result of her familys involvement with the conflicts between political elites on Lesbos in this period, the same reason for Sapphos contemporary Alcaeus exile from Mytilene around the same time. Later the exiles were allowed to return.     A tradition going back at least to ": null
    },
    {
        "Menander": "Menander"
    },
    {
        " suggested that Sappho killed herself by jumping off the ": null
    },
    {
        "Leucadian cliffs": "Lefkada"
    },
    {
        " for love of ": null
    },
    {
        "Phaon": "Phaon"
    },
    {
        ", a ferryman. This is regarded as unhistorical by modern scholars, perhaps invented by the comic poets or originating from a misreading of a first-person reference in a non-biographical poem. The legend may have resulted in part from a desire to assert Sappho as ": null
    },
    {
        "heterosexual": "Heterosexual"
    },
    {
        ".       Sappho probably wrote around 10,000 lines of poetry; today, only about 650 survive. She is best known for her ": null
    },
    {
        "lyric poetry": "Lyric Poetry"
    },
    {
        ", written to be accompanied by music. The Suda also attributes to Sappho ": null
    },
    {
        "epigrams": "Epigrams"
    },
    {
        ", ": null
    },
    {
        "elegiacs": "Elegiacs"
    },
    {
        ", and ": null
    },
    {
        "iambics": "Iambus"
    },
    {
        "; three of these epigrams are extant, but are in fact later Hellenistic poems inspired by Sappho, as are the iambic and elegiac poems attributed to her in the Suda. Ancient authors claim that Sappho primarily wrote love poetry, and the indirect transmission of Sapphos work supports this notion. However, the papyrus tradition suggests that this may not have been the case: a series of papyri published in 2014 contains fragments of ten consecutive poems from Book I of the Alexandrian edition of Sappho, of which only two are certainly love poems, while at least three and possibly four are primarily concerned with family.       Sapphos poetry was probably first written down on Lesbos, either in her lifetime or shortly afterwards, initially probably in the form of a score for performers of Sapphos work. In the fifth century, Athenian book publishers probably began to produce copies of Lesbian lyric poetry, some including explanatory material and glosses as well as the poems themselves. Some time in the second or third century, ": null
    },
    {
        "Alexandrian scholars": "Alexandrian School"
    },
    {
        " produced a critical edition of Sapphos poetry. There may have been more than one Alexandrian edition – John J. Winkler argues for two, one edited by ": null
    },
    {
        "Aristophanes of Byzantium": "Aristophanes Of Byzantium"
    },
    {
        " and another by his pupil ": null
    },
    {
        "Aristarchus of Samothrace": "Aristarchus Of Samothrace"
    },
    {
        ". This is not certain – ancient sources tell us that Aristarchus edition of Alcaeus replaced the edition by Aristophanes, but are silent on whether Sapphos work, too, went through multiple editions.     The Alexandrian edition of Sapphos poetry was based on the existing Athenian collections, and was divided into at least eight books, though the exact number is uncertain. Many modern scholars have followed Denys Page, who conjectured a ninth book in the standard edition; Yatromanolakis doubts this, noting that though testimonia refer to an eighth book of Sapphos poetry, none mention a ninth. Whatever its make-up, the Alexandrian edition of Sappho probably grouped her poems by their metre: ancient sources tell us that each of the first three books contained poems in a single specific metre. Ancient editions of Sappho, possibly starting with the Alexandrian edition, seem to have ordered the poems in at least the first book of Sapphos poetry – which contained works composed in ": null
    },
    {
        "Sapphic stanzas": "Sapphic Stanza"
    },
    {
        "– alphabetically.     Even after the publication of the standard Alexandrian edition, Sapphos poetry continued to circulate in other poetry collections. For instance, the Cologne Papyrus on which the ": null
    },
    {
        "Tithonus poem": "Tithonus Poem"
    },
    {
        " is preserved was part of a Hellenistic anthology of poetry, which contained poetry arranged by theme, rather than by metre and incipit, as it was in the Alexandrian edition.          The earliest surviving manuscripts of Sappho, including the potsherd on which fragment 2 is preserved, date to the third century BC, and thus predate the Alexandrian edition. The latest surviving copies of Sappho’s poems transmitted directly from ancient times are written on parchment codex pages from the sixth and seventh centuries AD, and were surely reproduced from ancient papyri now lost. Manuscript copies of Sapphos works may have survived a few centuries longer, but around the 9th century her poetry appears to have disappeared, and by the twelfth century, ": null
    },
    {
        "John Tzetzes": "John Tzetzes"
    },
    {
        " could write that the passage of time has destroyed Sappho and her works .     According to legend, Sapphos poetry was lost because the church disapproved of her morals. These legends appear to have originated in the ": null
    },
    {
        "renaissance": "Renaissance"
    },
    {
        " – around 1550, ": null
    },
    {
        "Jerome Cardan": "Jerome Cardan"
    },
    {
        " wrote that ": null
    },
    {
        "Gregory Nazianzen": "Gregory Nazianzen"
    },
    {
        " had Sapphos work publicly destroyed, and at the end of the sixteenth century ": null
    },
    {
        "Joseph Justus Scaliger": "Joseph Justus Scaliger"
    },
    {
        " claimed that Sapphos works were burned in Rome and Constantinople in 1073 on the orders of ": null
    },
    {
        "Pope Gregory VII": "Pope Gregory Vii"
    },
    {
        ". In reality, Sapphos work was probably lost as the demand for it was insufficiently great for it to be copied onto parchment when ": null
    },
    {
        "codices": "Codex"
    },
    {
        " superseded papyrus scrolls as the predominant form of book. Another contributing factor to the loss of Sapphos poems may have been the perceived obscurity of her ": null
    },
    {
        "Aeolic dialect": "Aeolic Dialect"
    },
    {
        ", which contains many archaisms and innovations absent from other ": null
    },
    {
        "ancient Greek dialects": "Ancient Greek Dialects"
    },
    {
        ". During the Roman period, by which time the ": null
    },
    {
        "Attic dialect": "Attic Dialect"
    },
    {
        " had become the standard for literary compositions, many readers found Sapphos dialect difficult to understand and, in the second century AD, the Roman author ": null
    },
    {
        "Apuleius": "Apuleius"
    },
    {
        " specifically remarks on its strangeness .     Only approximately 650 lines of Sapphos poetry still survive, of which just one poem – the Ode to Aphrodite – is complete, and more than half of the original lines survive in around ten more fragments. Many of the surviving fragments of Sappho contain only a single word – for example, fragment 169A is simply a word meaning wedding gifts , and survives as part of a dictionary of rare words. The two major sources of surviving fragments of Sappho are quotations in other ancient works, from a whole poem to as little as a single word, and fragments of papyrus, many of which were discovered at ": null
    },
    {
        "Oxyrhynchus": "Oxyrhynchus"
    },
    {
        " in Egypt. Other fragments survive on other materials, including parchment and potsherds. The oldest surviving fragment of Sappho currently known is the Cologne papyrus which contains the Tithonus poem, dating to the third century BC.     Until the last quarter of the nineteenth century, only the ancient quotations of Sappho survived. In 1879, the first new discovery of a fragment of Sappho was made at ": null
    },
    {
        "Fayum": "Fayum"
    },
    {
        ". By the end of the nineteenth century, ": null
    },
    {
        "Grenfell": "Bernard Pyne Grenfell"
    },
    {
        " and ": null
    },
    {
        "Hunt": "Arthur Surridge Hunt"
    },
    {
        " had begun to excavate an ancient rubbish dump at Oxyrhynchus, leading to the discoveries of many previously unknown fragments of Sappho. Fragments of Sappho continue to be rediscovered. Most recently, major discoveries in 2004  and 2014  have been reported in the media around the world.            Sappho clearly worked within a well-developed tradition of Lesbian poetry, which had evolved its own poetic diction, meters, and conventions. Among her famous poetic forebears were ": null
    },
    {
        "Arion": "Arion"
    },
    {
        " and ": null
    },
    {
        "Terpander": "Terpander"
    },
    {
        ". Nonetheless, her work is innovative; it is some of the earliest Greek poetry to adopt the lyric I – to write poetry adopting the viewpoint of a specific person, in contrast to the earlier epic poets ": null
    },
    {
        "Homer": "Homer"
    },
    {
        " and ": null
    },
    {
        "Hesiod": "Hesiod"
    },
    {
        ", who present themselves more as conduits of divine inspiration . Her poetry explores individual identity and personal emotions – desire, jealousy, and love; it also adopts and reinterprets the existing imagery epic poetry in exploring these themes.     Sapphos poetry is known for its clear language and simple thoughts, sharply-drawn images, and use of direct quotation which brings a sense of immediacy. Unexpected word-play is a characteristic feature of her style. An example is from fragment 96: now she stands out among Lydian women as after sunset the rose-fingered moon exceeds all stars , a variation of the ": null
    },
    {
        "Homeric epithet": "Homeric Epithet"
    },
    {
        " rosy-fingered Dawn . Sapphos poetry often uses ": null
    },
    {
        "hyperbole": "Hyperbole"
    },
    {
        ", according to ancient critics because of its charm . An example is found in fragment 111, where Sappho writes that The groom approaches like Ares Much bigger than a big man .     Leslie Kurke groups Sappho with those archaic Greek poets from what has been called the élite ideological tradition, which valued luxury  and high birth. These elite poets tended to identify themselves with the worlds of Greek myths, gods, and heroes, as well as the wealthy East, especially ": null
    },
    {
        "Lydia": "Lydia"
    },
    {
        ". Thus in fragment 2 Sappho describes Aphrodite pour into golden cups nectar lavishly mingled with joys , while in the Tithonus poem she explicitly states that I love the finer things habrosyne . According to Page DuBois, the language, as well as the content, of Sapphos poetry evokes an aristocratic sphere. She contrasts Sapphos flowery, adorned style with the austere, decorous, restrained style embodied in the works of later classical authors such as ": null
    },
    {
        "Sophocles": "Sophocles"
    },
    {
        ", ": null
    },
    {
        "Demosthenes": "Demosthenes"
    },
    {
        ", and ": null
    },
    {
        "Pindar": "Pindar"
    },
    {
        ".     Traditional modern literary critics of Sapphos poetry have tended to see her poetry as a vivid and skilled but spontaneous and naive expression of emotion: typical of this view are the remarks of H. J. Rose that Sappho wrote as she spoke, owing practically nothing to any literary influence, and that her verse displays the charm of absolute naturalness.  Against this essentially romantic view, one school of more recent critics argues that, on the contrary, Sapphos poetry displays and depends for its effect on a sophisticated deployment of the strategies of traditional Greek rhetorical genres.          Today Sappho, for many, is a symbol of female homosexuality; the common term  lesbian  is an allusion to Sappho, originating from the name of the island of ": null
    },
    {
        "Lesbos": "Lesbos"
    },
    {
        ", where she was born. However, she has not always been so considered. In classical Athenian comedy , Sappho was caricatured as a promiscuous heterosexual woman, and it is not until the Hellenistic period that the first testimonia which explicitly discuss Sapphos homoeroticism are preserved. The earliest of these is a fragmentary biography written on papyrus in the late third or early second century BC, P. Oxy. xv, 1800, fr. 1 which states that Sappho was accused by some of being irregular in her ways and a woman-lover . Denys Page comments that the phrase by some implies that even the full corpus of Sapphos poetry did not provide conclusive evidence of whether she described herself as having sex with women. These ancient authors do not appear to have believed that Sappho did, in fact, have sexual relationships with other women, and as late as the tenth century the Suda records that Sappho was slanderously accused of having sexual relationships with her female pupils .     Among modern scholars, Sapphos sexuality is still debated – André Lardinois has described it as the Great Sappho Question . Early translators of Sappho sometimes heterosexualised her poetry. ": null
    },
    {
        "Ambrose Philips": "Ambrose Philips"
    },
    {
        " 1711 translation of the ": null
    },
    {
        "Ode to Aphrodite": "Ode To Aphrodite"
    },
    {
        " portrayed the object of Sapphos desire as male, a reading that was followed by virtually every other translator of the poem until the twentieth century, while in 1781 Alessandro Verri interpreted ": null
    },
    {
        "fragment 31": "Sappho 31"
    },
    {
        " as being about Sapphos love for Phaon. ": null
    },
    {
        "Friedrich Gottlieb Welcker": "Friedrich Gottlieb Welcker"
    },
    {
        " argued that Sapphos feelings for other women were entirely idealistic and non-sensual , while ": null
    },
    {
        "Karl Otfried Müller": "Karl Otfried Müller"
    },
    {
        " wrote that fragment 31 described nothing but a friendly affection : ": null
    },
    {
        "Glenn Most": "Glenn Most"
    },
    {
        " comments that one wonders what language Sappho would have used to describe her feelings if they had been ones of sexual excitement if this theory were correct. By 1970, it would be argued that the same poem contained proof positive of lesbianism .     Today, it is generally accepted that Sapphos poetry portrays homoerotic feelings: as Sandra Boehringer puts it, her works clearly celebrate eros between women . Toward the end of the twentieth century, though, some scholars began to reject the question of whether or not Sappho was a lesbian – Glenn Most wrote that Sappho herself would have had no idea what people mean when they call her nowadays a homosexual , André Lardinois stated that it is nonsensical to ask whether Sappho was a lesbian, and Page duBois calls the question a particularly obfuscating debate .     One of the major focuses of scholars studying Sappho has been to attempt to determine the cultural context in which Sapphos poems were composed and performed. Various cultural contexts and social roles played by Sappho have been suggested, including teacher, cult-leader, and poet performing for a circle of female friends. However, the performance contexts of many of Sapphos fragments are not easy to determine, and for many more than one possible context is conceivable.     One longstanding suggestion of a social role for Sappho is that of Sappho as schoolmistress . At the beginning of the twentieth century, the German classicist ": null
    },
    {
        "Ulrich von Wilamowitz-Moellendorff": "Ulrich Von Wilamowitz-Moellendorff"
    },
    {
        " posited that Sappho was a sort of schoolteacher, in order to explain away Sapphos passion for her girls and defend her from accusations of homosexuality. The view continues to be influential, both among scholars and the general public, though more recently the idea has been criticised by historians as anachronistic and has been rejected by several prominent classicists as unjustified by the evidence. In 1959, Denys Page, for example, stated that Sapphos extant fragments portray the loves and jealousies, the pleasures and pains, of Sappho and her companions ; and he adds, We have found, and shall find, no trace of any formal or official or professional relationship between them, ... no trace of Sappho the principal of an academy.  David A. Campbell in 1967 judged that Sappho may have presided over a literary coterie , but that evidence for a formal appointment as priestess or teacher is hard to find . None of Sapphos own poetry mentions her teaching, and the earliest testimonium to support the idea of Sappho as a teacher comes from Ovid, six centuries after Sapphos lifetime. Despite these problems, many newer interpretations of Sapphos social role are still based on this idea. In these interpretations, Sappho was involved in the ritual education of girls, for instance as a trainer of choruses of girls.     Even if Sappho did compose songs for training choruses of young girls, not all of her poems can be interpreted in this light, and despite scholars best attempts to find one, Yatromanolakis argues that there is no single performance context to which all of Sapphos poems can be attributed. Parker argues that Sappho should be considered as part of a group of female friends for whom she would have performed, just as her contemporary ": null
    },
    {
        "Alcaeus": "Alcaeus Of Mytilene"
    },
    {
        " is. Some of her poetry appears to have been composed for identifiable formal occasions, but many of her songs are about – and possibly were to be performed at – banquets.              In antiquity Sapphos poetry was highly admired, and several ancient sources refer to her as the tenth Muse . The earliest surviving poem to do so is a third-century BC epigram by Dioscorides, AP 7.407 T 58  but poems are preserved in the Greek Anthology by Antipater of Sidon AP 7.14 T 27  and attributed to Plato AP 9.506 T 60  on the same theme. She was sometimes referred to as The Poetess , just as Homer was The Poet . The scholars of Alexandria included Sappho in the canon of nine lyric poets. According to ": null
    },
    {
        "Aelian": "Claudius Aelianus"
    },
    {
        ", the Athenian lawmaker and poet ": null
    },
    {
        "Solon": "Solon"
    },
    {
        " asked to be taught a song by Sappho so that I may learn it and then die . Aelian, quoted by Stobaeus, Anthology 3.29.58 T 10 This story may well be apocryphal, especially as Ammianus Marcellinus tells a similar story about Socrates and a song of ": null
    },
    {
        "Stesichorus": "Stesichorus"
    },
    {
        ", but it is indicative of how highly Sapphos poetry was considered in the ancient world.     Sapphos poetry also influenced other ancient authors. In Greek, the Hellenistic poet ": null
    },
    {
        "Nossis": "Nossis"
    },
    {
        " was described by Marilyn B. Skinner as an imitator of Sappho, and Kathryn Gutzwiller argues that Nossis explicitly positioned herself as an inheritor of Sapphos position as a woman poet. Beyond poetry, Plato cites Sappho in his  Phaedrus , and ": null
    },
    {
        "Socrates": "Socrates"
    },
    {
        " second speech on love in that dialogue appears to echo Sapphos descriptions of the physical effects of desire in fragment 31. In the first century BC, ": null
    },
    {
        "Catullus": "Catullus"
    },
    {
        " established the themes and metres of Sapphos poetry as a part of Latin literature, adopting the Sapphic stanza, believed in antiquity to have been invented by Sappho, giving his lover in his poetry the name Lesbia in reference to Sappho, and adapting and translating Sapphos 31st fragment in his ": null
    },
    {
        "poem 51": "Catullus 51"
    },
    {
        ".     Other ancient poets wrote about Sapphos life. She was a popular character in ": null
    },
    {
        "ancient Athenian comedy": "Ancient Greek Comedy"
    },
    {
        ", and at least six separate comedies called Sappho are known. The earliest known ancient comedy to take Sappho as its main subject was the early-fifth or late-fourth century BC Sappho by ": null
    },
    {
        "Ameipsias": "Ameipsias"
    },
    {
        ", though nothing is known of it apart from its name. Sappho was also a favourite subject in the visual arts, the most commonly depicted poet on sixth and fifth-century Attic red-figure vase paintings, and the subject of a sculpture by ": null
    },
    {
        "Silanion": "Silanion"
    },
    {
        ".     From the fourth century BC, ancient works portray Sappho as a tragic heroine, driven to suicide by her unrequited love for Phaon. For instance, a fragment of a play by Menander says that Sappho threw herself off of the cliff at Leucas out of her love for Phaon. Ovids Heroides 15 is written as a letter from Sappho to her supposed love Phaon, and when it was first rediscovered in the 15th century was thought to be a translation of an authentic letter of Sapphos. Sapphos suicide was also depicted in classical art, for instance on a first-century BC basilica in Rome near the ": null
    },
    {
        "Porta Maggiore": "Porta Maggiore"
    },
    {
        ".     While Sapphos poetry was admired in the ancient world, her character was not always so well considered. In the Roman period, critics found her lustful and perhaps even homosexual. ": null
    },
    {
        "Horace": "Horace"
    },
    {
        " called her mascula Sappho in his Epistles, which the later ": null
    },
    {
        "Porphyrio": "Pomponius Porphyrion"
    },
    {
        " commented was either because she is famous for her poetry, in which men more often excel, or because she is maligned for having been a tribad . By the third century AD, the difference between Sapphos literary reputation as a poet and her moral reputation as a woman had become so significant that the suggestion that there were in fact two Sapphos began to develop. In his Historical Miscellanies, Aelian wrote that there was another Sappho, a courtesan, not a poetess . Aelian, Historical Miscellanies 12.19 T 4          By the medieval period, Sapphos works had been lost, though she was still known through later ancient authors such as Ovid. Her works began to become accessible again in the sixteenth century, first in early printed editions of authors who had quoted her. In 1508 ": null
    },
    {
        "Aldus Manutius": "Aldus Manutius"
    },
    {
        " printed an edition of Dionysius of Hallicarnassus, which contained Sappho 1, the Ode to Aphrodite , and the first printed edition of Longinus On the Sublime, complete with his quotation of Sappho 31, appeared in 1554. In 1566, the French printer Robert Estienne produced an edition of the Greek lyric poets which contained around 40 fragments attributed to Sappho. In 1652, the first English translation of a poem by Sappho was published, in ": null
    },
    {
        "John Halls": "John Hall"
    },
    {
        "translation of On the Sublime. In 1681 Anne Le Fèvres French edition of Sappho made her work even more widely known. ": null
    },
    {
        "Theodor Bergks": "Theodor Bergk"
    },
    {
        "1854 edition became the standard edition of Sappho in the second half of the 19th century; in the first part of the 20th, the papyrus discoveries of new poems by Sappho led to editions and translations by ": null
    },
    {
        "Edwin Marion Cox": "Edwin Marion Cox"
    },
    {
        " and ": null
    },
    {
        "John Maxwell Edmonds": "John Maxwell Edmonds"
    },
    {
        ", and culminated in the 1955 publication of ": null
    },
    {
        "Edgar Lobels": "Edgar Lobel"
    },
    {
        "and ": null
    },
    {
        "Denys Pages": "Denys Page"
    },
    {
        " Poetarum Lesbiorum Fragmenta.     Like the ancients, modern critics have tended to consider Sapphos poetry extraordinary . As early as the 9th century, Sappho was referred to as a talented woman poet, and in works such as ": null
    },
    {
        "Boccaccios": "Boccaccio"
    },
    {
        "  De Claris Mulieribus  and ": null
    },
    {
        "Christine de Pisans": "Christine De Pisan"
    },
    {
        "  Book of the City of Ladies  she gained a reputation as a learned lady. Even after Sapphos works had been lost, the Sapphic stanza continued to be used in medieval lyric poetry, and with the rediscovery of her work in the Renaissance, she began to increasingly influence European poetry. In the 16th century, members of ": null
    },
    {
        "La Pléiade": "La Pléiade"
    },
    {
        ", a circle of French poets, were influenced by her to experiment with Sapphic stanzas and with writing love-poetry with a first-person female voice. From the ": null
    },
    {
        "Romantic era": "Romantic Era"
    },
    {
        ", Sapphos work – especially her Ode to Aphrodite – has been a key influence of conceptions of what lyric poetry should be. Such influential poets as ": null
    },
    {
        "Alfred Lord Tennyson": "Alfred Lord Tennyson"
    },
    {
        " in the nineteenth century, and ": null
    },
    {
        "A. E. Housman": "A. E. Housman"
    },
    {
        " in the twentieth, have been influenced by her poetry. Tennyson based poems including Eleanore and Fatima on Sapphos fragment 31, while three of Housmans works are adaptations of the ": null
    },
    {
        "Midnight poem": "Midnight Poem"
    },
    {
        ", long thought to be by Sappho though the authorship is now disputed. At the beginning of the twentieth century, the ": null
    },
    {
        "Imagists": "Imagists"
    },
    {
        " – especially ": null
    },
    {
        "Ezra Pound": "Ezra Pound"
    },
    {
        ", ": null
    },
    {
        "H. D.": "H. D."
    },
    {
        ", and ": null
    },
    {
        "Richard Aldington": "Richard Aldington"
    },
    {
        " – were influenced by Sapphos fragments; a number of Pounds poems in his early collection Lustra were adaptations of Sapphic poems, while H. D.s poetry was frequently Sapphic in style, theme or content , and in some cases, such as Fragment 40 more specifically invoke Sapphos writing.          It was not long after the rediscovery of Sappho that her sexuality once again became the focus of critical attention. In the early seventeenth century, ": null
    },
    {
        "John Donne": "John Donne"
    },
    {
        " wrote Sapho to Philaenis , returning to the idea of Sappho as a hypersexual lover of women. The modern debate on Sapphos sexuality began in the 19th century, with Welcker publishing, in 1816, an article defending Sappho from charges of prostitution and lesbianism, arguing that she was chaste – a position which would later be taken up by Wilamowitz at the end of the 19th and ": null
    },
    {
        "Henry Thornton Wharton": "Henry Thornton Wharton"
    },
    {
        " at the beginning of the 20th centuries. Despite attempts to defend her good name, in the nineteenth century Sappho was co-opted by the ": null
    },
    {
        "Decadent Movement": "Decadent Movement"
    },
    {
        " as a lesbian daughter of de Sade , by ": null
    },
    {
        "Charles Baudelaire": "Charles Baudelaire"
    },
    {
        " in France and later ": null
    },
    {
        "Algernon Charles Swinburne": "Algernon Charles Swinburne"
    },
    {
        " in England. By the late 19th century, lesbian writers such as ": null
    },
    {
        "Michael Field": "Michael Field"
    },
    {
        " and ": null
    },
    {
        "Amy Levy": "Amy Levy"
    },
    {
        " became interested in Sappho for her sexuality, and by the turn of the twentieth century she was a sort of patron saint of lesbians .     From the beginning of the 19th century, women poets such as ": null
    },
    {
        "Felicia Hemans": "Felicia Hemans"
    },
    {
        "  and ": null
    },
    {
        "Letitia Elizabeth Landon": "Letitia Elizabeth Landon"
    },
    {
        "  took Sappho as one of their progenitors. Sappho also began to be regarded as a role model for campaigners for womens rights, beginning with works such as ": null
    },
    {
        "Caroline Nortons": "Caroline Norton"
    },
    {
        " The Picture of Sappho. Later in that century, she would become a model for the so-called ": null
    },
    {
        "New Woman": "New Woman"
    },
    {
        " – independent and educated women who desired social and sexual autonomy – and by the 1960s, the feminist Sappho was – along with the hypersexual, often but not exclusively lesbian Sappho – one of the two most important cultural perceptions of Sappho.        The discoveries of new poems by Sappho in 2004 and 2014 excited both scholarly and media attention. The announcement of the Tithonus poem was the subject of international news coverage, and was described by Marylin Skinner as the trouvaille of a lifetime .": null
    }
]