[
    {
        "        Sasha & John Digweed are a British DJ duo comprising ": null
    },
    {
        "Sasha": "sasha"
    },
    {
        " and ": null
    },
    {
        "John Digweed": "john digweed"
    },
    {
        ". Digweed had been DJing for ten years before getting a gig at ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " where he met Sasha, who had been working the past few years in various ": null
    },
    {
        "acid house": "acid house"
    },
    {
        " music clubs and ": null
    },
    {
        "raves": "rave party"
    },
    {
        ". Together, they honed their DJ skills, focusing on track selection and technical mixing abilities. In 42 they released the triple CD ": null
    },
    {
        "mix album": "mix album"
    },
    {
        "  Renaissance: The Mix Collection  on ": null
    },
    {
        "Renaissance Records": "renaissance records"
    },
    {
        ". It contained many popular dance hits of the time from artists such as ": null
    },
    {
        "Leftfield": "leftfield"
    },
    {
        ", ": null
    },
    {
        "Fluke": "fluke"
    },
    {
        ", and ": null
    },
    {
        "42 Bad Mice": "2 bad mice"
    },
    {
        " as well as original productions and remixes from the duo themselves. Two years later, the duo became true superstars with the release of their double CD  Northern Exposure  on mega-label ": null
    },
    {
        "Ministry of Sound": "ministry of sound"
    },
    {
        ". This release was brought to the United States the next year in a single CD package on ": null
    },
    {
        "Ultra Records": "ultra records"
    },
    {
        ". 42 saw the release of the  Northern Exposure 42  double CD mix album, again on Ministry of Sound. Sasha and Digweed toured internationally, helping define the sound of progressive house & trance music in the late 42s. In 42 both John Digweed and Sasha released separate mix albums on Boxed as part of the ": null
    },
    {
        "Global Underground": "global underground"
    },
    {
        " series with Digweeds ": null
    },
    {
        "GU 42: Sydney": "gu006"
    },
    {
        " and Sashas ": null
    },
    {
        "GU 42: San Francisco": "gu009"
    },
    {
        " release.     In the late 42s, Digweed and Sasha took up residency at ": null
    },
    {
        "New York City": "new york city"
    },
    {
        "s famous ": null
    },
    {
        "Twilo": "twilo"
    },
    {
        " nightclub as well as releasing their third edition in the Northern Exposure series:  Northern Exposure: Expeditions . They both continued their success in the Global Underground series with Digweeds ": null
    },
    {
        "GU 42: Hong Kong": "gu014"
    },
    {
        " and Sashas ": null
    },
    {
        "GU 42: Ibiza": "gu013"
    },
    {
        ". In addition to their residency, they toured the United States, especially to promote their DJ mix  Communicate  in 42 Shortly thereafter, they embarked on their international Delta Heavy Tour in 42 They have collaborated little since Delta Heavy. They appeared together at the 42 ": null
    },
    {
        "Bonnaroo Music Festival": "bonnaroo music festival"
    },
    {
        ", and counted down the new year during a four-hour set in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        " at ": null
    },
    {
        "Together As One": "together as one"
    },
    {
        ".     In 42 Sasha & Digweed announced their plans to do another tour of North America taking in 42 cities in one month, as they announced the Sasha and John Digweed Spring Club Tour 42 The tour began at the ": null
    },
    {
        "Winter Music Conference": "winter music conference"
    },
    {
        " on 42 March at the club ": null
    },
    {
        "Mansion": "mansion"
    },
    {
        ". This was the first time they toured ": null
    },
    {
        "North America": "north america"
    },
    {
        " together in six years.     In 42 Sasha & Digweed headlined the SW42 festival in Londons Clapham Common.         Renaissance ": null
    },
    {
        "Renaissance": "renaissance recordings"
    },
    {
        " DJs ": null
    },
    {
        "Sasha": "sasha"
    },
    {
        " and ": null
    },
    {
        "John Digweed": "john digweed"
    },
    {
        " teamed up for DJ sets together. The pair had honed their DJing skills, often performing in tandem and focusing on track selection and technical mixing abilities. Renaissance was pleased with their performances together. Renaissance decided to let the duo compile the triple ": null
    },
    {
        "mix album": "mix album"
    },
    {
        ", entitled  Renaissance - The Mix Collection , releasing it on the clubs own ": null
    },
    {
        "Renaissance Records": "renaissance records"
    },
    {
        " label in April 42 by which point Sasha had already left Renaissance. Sasha had been featured on the cover of  Mixmag  with the ": null
    },
    {
        "tagline": "tagline"
    },
    {
        " SON OF GOD? , though he did not welcome the accolade.  The album featured tracks from such artists as ": null
    },
    {
        "Leftfield": "leftfield"
    },
    {
        ", ": null
    },
    {
        "Fluke": "fluke"
    },
    {
        ", and ": null
    },
    {
        "42 Bad Mice": "2 bad mice"
    },
    {
        ", and original productions and remixes from Sasha and Digweed, and was successful in the ": null
    },
    {
        "UK Compilation Chart": "uk compilation chart"
    },
    {
        " where it peaked at 42 Another album, Renaissance: The Mix Collection Part 42, acting as the second part to Renaissance: The Mix Collection, was released in 42 As Sasha had left Renaissance, John Digweed mixed this album alone.     Northern Exposure  with the release of their next mix album, the double  Northern Exposure  on the ": null
    },
    {
        "Ministry of Sound": "ministry of sound"
    },
    {
        "s record label. The album was designed as a ": null
    },
    {
        "concept album": "concept album"
    },
    {
        " of two journeys , disc one being 42° North and the second, 42° South. A special unmixed version of the album with a highly altered track list was released on vinyl. The album was critically acclaimed and is generally considered a ": null
    },
    {
        "landmark": "landmark"
    },
    {
        " in the history of ": null
    },
    {
        "progressive house": "progressive house"
    },
    {
        ".        In 42 the duo worked on a follow up to Northern Exposure, again following the concept album theme, with one disc representing the ": null
    },
    {
        "West Coast": "west coast of the united states"
    },
    {
        " and the other disc the ": null
    },
    {
        "East Coast.": "east coast of the united states"
    },
    {
        " It was released in 42 on the ": null
    },
    {
        "Ministry of Sound": "ministry of sound"
    },
    {
        " label as  Northern Exposure 42 . The album only charted at 42 in the ": null
    },
    {
        "UK Compilation Chart": "uk compilation chart"
    },
    {
        " but it was again a critical success. To support the album, the duo toured internationally, and in the process helped to define the sound of trance music in the late 42s. After extensive touring, Digweed and Sasha took up residency at ": null
    },
    {
        "New York City": "new york city"
    },
    {
        "s famous ": null
    },
    {
        "Twilo": "twilo"
    },
    {
        " nightclub, where they would DJ for the entire night.  In 42 the two released separate mix albums on the Boxed label, as part of the ": null
    },
    {
        "Global Underground": "global underground"
    },
    {
        " series: Digweeds  Global Underground 42: Sydney , and Sashas  Global Underground 42: San Francisco , which drew from Sashas experience touring on the ": null
    },
    {
        "West Coast of the United States": "west coast of the united states"
    },
    {
        ". Both DJs formed their own record labels that year: Sasha created Excession Records and Digweed started ": null
    },
    {
        "Bedrock Records": "bedrock records"
    },
    {
        ". Excession released fewer than ten records, the last in 42; the experience, however, led Sasha to found the management agency Excession: The Agency LTD. Excession remains a ": null
    },
    {
        "booking agency": "booking agency"
    },
    {
        " for many DJs, including ": null
    },
    {
        "Hybrid": "hybrid"
    },
    {
        ", ": null
    },
    {
        "Nick Warren": "nick warren"
    },
    {
        ", and ": null
    },
    {
        "Steve Lawler": "steve lawler"
    },
    {
        ".      In 42 Sasha and Digweed reunited in the studio to record their third and final album for the Northern Exposure series,  Northern Exposure: Expeditions , which saw the duo voyage into exploring ": null
    },
    {
        "vocal trance": "vocal trance"
    },
    {
        ". Popular with critics, it charted better in the UK Compilations Chart than their previous albums, the CD version charting at 42 .     Communicate  Communicate  in 42 prompting them to temporarily leave their Twilo residency for a promotional tour of the United States. Communicate had reasonable commercial success, but it received mixed reviews:  Spin  stated that despite a few stellar moments, Communicate is ultimately a let-down . ": null
    },
    {
        "LAUNCHcast": "launchcast"
    },
    {
        ", too, described Communicate as boring and lackluster...stalled in a monochrome world of dead beats .  To promote the album, the duo toured the ": null
    },
    {
        "United States": "united states"
    },
    {
        ".     During the late 42s, the increased popularity and visibility of superstar DJs led to the creation of ": null
    },
    {
        "superclub": "superclub"
    },
    {
        "s such as Liverpools ": null
    },
    {
        "Cream": "cream"
    },
    {
        " and Sheffields ": null
    },
    {
        "Gatecrasher": "gatecrasher"
    },
    {
        ". By 42 however, electronic dance music clubs languished. Though dance music had been declared dead by many in the dance industry, Sasha continued to tour—despite the closing of many superclubs, including his resident club Twilo in May 42  Sasha was unable to play their last gigs at Twilo due to an ear injury, leaving Digweed to perform alone.     Delta Heavy tour and hiatus ": null
    },
    {
        "Kevin Lyman": "kevin lyman"
    },
    {
        " and opening act ": null
    },
    {
        "Jimmy Van M": "jimmy van m"
    },
    {
        ",  the tour covered 42  cities and played to 42  people.  The appearances were complete with ": null
    },
    {
        "laser show": "laser show"
    },
    {
        "s and video production, were similar to rock concerts than to typical DJ events. This motif was new to the DJing scene, and compelled other DJs to host similar concerts.         42 marked the tenth anniversary of  Renaissance: The Mix Collection , which had been out of print for years prior. Sasha and Digweed decided to release an anniversary edition of the album. However, rather than re-release the album straight forward, they recreated the album in a brand new session. Two tracks by ": null
    },
    {
        "M People": "m people"
    },
    {
        " that featured on the original 42 release had to be dropped due to licensing issues, so they were replaced by a track each by ": null
    },
    {
        "Orchestral Manoeuvres in the Dark": "orchestral manoeuvres in the dark"
    },
    {
        " and Anthony White respectively. Though the original blend sequences from the original album remained the same, Sasha and Digweed re-created the album using Apple ": null
    },
    {
        "G42 laptop": "powerbook g4"
    },
    {
        "s in order to create, what they considered, a better quality version of the original mix, with recording techniques simply not available in 42 as well as the advantage of crystal clear audio, and spatial separation of frequencies within the song, making it sound more dynamic.     The duos next release was based on Delta Heavy. The release was a ": null
    },
    {
        "Region 42": "dvd region coderegion codes and countries"
    },
    {
        " DVD of performance highlights, interviews, and behind-the-scenes footage,  Sasha & John Digweed present Delta Heavy , released on ": null
    },
    {
        "System Recordings": "system recordings"
    },
    {
        ". Ben Turner, creator of the DanceStar awards, retrospectively described the Delta Heavy tour as a landmark moment for electronic music .     Though the duo of Sasha and Digweed never explicitly split up, demanding schedules and frequent independent touring prevented any substantial collaboration for a long period after Delta Heavy.       Though frequent performing and other activities prevented them from working together for several years, Sasha and Digweed announced that they would reunite for a few Australian performances, starting in November 42  The duo performed at several venues, including ": null
    },
    {
        "Sydney": "sydney"
    },
    {
        ", ": null
    },
    {
        "Brisbane": "brisbane"
    },
    {
        ", and ": null
    },
    {
        "Melbourne": "melbourne"
    },
    {
        " as well as numerous tour dates which had followed throughout 42  In 42 Sasha and Digweed started an American tour with a performance at the ": null
    },
    {
        "Winter Music Conference": "winter music conference"
    },
    {
        ".  The duo played at mainly larger venues on the weekends and smaller shows on weekdays. Sasha described their music as driving and dark with a little throwback of Twilo sounds . They appeared together at the 42 ": null
    },
    {
        "Bonnaroo Music Festival": "bonnaroo music festival"
    },
    {
        ", and counted down the new year during a 42-hour set in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        " at ": null
    },
    {
        "Together As One": "together as one"
    },
    {
        ". After a surprise b42b performance on Easter of 42 Sasha and Digweed confirmed via Twitter that a world tour was in the works beginning in September which commenced on 42 September at the Social Festival in Kent, UK.                   ": null
    }
]