[
    {
        "         \t        Satan, also known as the Devil, is an ": null
    },
    {
        "entity": "non-physical entity"
    },
    {
        " in the ": null
    },
    {
        "Abrahamic religions": "abrahamic religions"
    },
    {
        " that seduces humans into sin or falsehood. In ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " and ": null
    },
    {
        "Islam": "islam"
    },
    {
        ", he is usually seen as either a ": null
    },
    {
        "fallen angel": "fallen angel"
    },
    {
        " or a ": null
    },
    {
        "jinn": "jinn"
    },
    {
        ", who used to possess great piety and beauty, but rebelled against ": null
    },
    {
        "God": "god in abrahamic religions"
    },
    {
        ", who nevertheless allows him temporary power over the fallen world and a host of ": null
    },
    {
        "demon": "demon"
    },
    {
        "s. In ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        ", Satan is typically regarded as a metaphor for the  yetzer hara , or evil inclination , or as an agent subservient to ": null
    },
    {
        "God": "yahweh"
    },
    {
        ".     A figure known as the satan first appears in the ": null
    },
    {
        "Tanakh": "tanakh"
    },
    {
        " as a heavenly ": null
    },
    {
        "prosecutor": "prosecutor"
    },
    {
        ", a member of the ": null
    },
    {
        "sons of God": "sons of god"
    },
    {
        " subordinate to ": null
    },
    {
        "Yahweh": "yahweh"
    },
    {
        ", who prosecutes the ": null
    },
    {
        "nation of Judah": "kingdom of judah"
    },
    {
        " in the heavenly court and tests the loyalty of Yahwehs followers by forcing them to suffer. During the ": null
    },
    {
        "intertestamental period": "intertestamental period"
    },
    {
        ", possibly due to influence from the ": null
    },
    {
        "Zoroastrian": "zoroastrianism"
    },
    {
        " figure of ": null
    },
    {
        "Angra Mainyu": "angra mainyu"
    },
    {
        ", the satan developed into a malevolent entity with abhorrent qualities in ": null
    },
    {
        "dualistic opposition": "dualistic cosmology"
    },
    {
        " to God. In the ": null
    },
    {
        "apocryphal": "biblical apocrypha"
    },
    {
        " Book of Jubilees": "book of jubilees"
    },
    {
        ", Yahweh grants the satan  authority over a ": null
    },
    {
        "group of fallen angels": "watcher"
    },
    {
        ", or ": null
    },
    {
        "their offspring": "nephilim"
    },
    {
        ", to tempt humans to sin and punish them. In the ": null
    },
    {
        "Synoptic Gospels": "synoptic gospels"
    },
    {
        ", Satan ": null
    },
    {
        "tempts Jesus in the desert": "temptation of christ"
    },
    {
        " and is identified as the cause of illness and temptation. In the ": null
    },
    {
        "Book of Revelation": "book of revelation"
    },
    {
        ", Satan appears as a ": null
    },
    {
        "Great Red Dragon": "serpents in the bibleancient serpent"
    },
    {
        ", who is defeated by ": null
    },
    {
        "Michael the Archangel": "michael"
    },
    {
        " and cast down from Heaven. He is later bound for ": null
    },
    {
        "one thousand years": "millennialism"
    },
    {
        ", but is briefly set free before being ultimately defeated and cast into the ": null
    },
    {
        "Lake of Fire": "lake of fire"
    },
    {
        ".     In ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        ", Satan is also known as the ": null
    },
    {
        "Devil": "devil in christianity"
    },
    {
        " and, although the ": null
    },
    {
        "Book of Genesis": "book of genesis"
    },
    {
        " does not mention him, he is often identified as the ": null
    },
    {
        "serpent in the Garden of Eden": "serpents in the bible"
    },
    {
        ". In the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", Satan played a minimal role in ": null
    },
    {
        "Christian theology": "christian theology"
    },
    {
        " and was used as a ": null
    },
    {
        "comic relief": "comic relief"
    },
    {
        " figure in ": null
    },
    {
        "mystery plays": "mystery plays"
    },
    {
        ". During the ": null
    },
    {
        "early modern period": "early modern period"
    },
    {
        ", Satans significance greatly increased as beliefs such as ": null
    },
    {
        "demonic possession": "demonic possession"
    },
    {
        " and ": null
    },
    {
        "witchcraft": "european witchcraft"
    },
    {
        " became more prevalent. During the ": null
    },
    {
        "Age of Enlightenment": "age of enlightenment"
    },
    {
        ", belief in the existence of Satan became harshly criticized. Nonetheless, belief in Satan has persisted, particularly in the ": null
    },
    {
        "Americas": "americas"
    },
    {
        ". In the ": null
    },
    {
        "Quran": "quran"
    },
    {
        ", ": null
    },
    {
        "Shaitan": "shaitan"
    },
    {
        ", also known as ": null
    },
    {
        "Iblis": "iblis"
    },
    {
        ", is an entity made of fire who was cast out of Heaven because he refused to bow before the newly-created ": null
    },
    {
        "Adam": "adam in islam"
    },
    {
        " and incites humans to sin by infecting their minds with waswās . Although Satan is generally viewed as evil, some groups have very different beliefs.     In ": null
    },
    {
        "Theistic Satanism": "theistic satanism"
    },
    {
        ", Satan is considered a deity who is either worshipped or revered. In ": null
    },
    {
        "LaVeyan Satanism": "laveyan satanism"
    },
    {
        ", Satan is a symbol of virtuous characteristics and liberty. Satans appearance is never described in the Bible, but, since the ninth century, he has often been shown in ": null
    },
    {
        "Christian art": "christian art"
    },
    {
        " with horns, cloven hooves, unusually hairy legs, and a tail, often naked and holding a pitchfork. These are an amalgam of traits derived from various pagan deities, including ": null
    },
    {
        "Pan": "pan"
    },
    {
        ", ": null
    },
    {
        "Poseidon": "poseidon"
    },
    {
        ", and ": null
    },
    {
        "Bes": "bes"
    },
    {
        ". Satan appears frequently in ": null
    },
    {
        "Christian literature": "christian literature"
    },
    {
        ", most notably in ": null
    },
    {
        "Dante Alighieri": "dante alighieri"
    },
    {
        "s  Inferno , variants of the ": null
    },
    {
        "Faust": "faust"
    },
    {
        " legend, ": null
    },
    {
        "John Milton": "john milton"
    },
    {
        "s  Paradise Lost  and  Paradise Regained , and the poems of ": null
    },
    {
        "William Blake": "william blake"
    },
    {
        ". He continues to appear in film, television, and music.              The original ": null
    },
    {
        "Hebrew": "hebrew"
    },
    {
        " term sâtan  is a generic noun meaning accuser or adversary , which is used throughout the Hebrew Bible to refer to ordinary human adversaries, as well as a specific supernatural entity. The word is derived from a verb meaning primarily to obstruct, oppose . ed. ": null
    },
    {
        "Buttrick, George Arthur": "george arthur buttrick"
    },
    {
        "; The Interpreters Dictionary of the Bible, An illustrated Encyclopedia When it is used without the definite article , the word can refer to any accuser, but when it is used with the definite article , it usually refers specifically to the heavenly accuser: the satan.     Ha-Satan with the ": null
    },
    {
        "definite article": "definite article"
    },
    {
        " occurs 42 times in the ": null
    },
    {
        "Masoretic Text": "masoretic text"
    },
    {
        ", in two books of the Hebrew Bible: ": null
    },
    {
        "Job": "book of job"
    },
    {
        " ch. 42–42 Stephen M. Hooks – 42 As in Zechariah 42:42–42 the term here carries the definite article and functions not as a...the only place in the Hebrew Bible where the term Satan is unquestionably used as a proper name is ": null
    },
    {
        "42 Chronicles": "books of chronicles"
    },
    {
        " 42:42 and ": null
    },
    {
        "Zechariah": "book of zechariah"
    },
    {
        " 42:42–42 . Coogan, Michael D.; A Brief Introduction to the Old Testament: The Hebrew Bible in Its Context, Oxford University Press, 42 Satan without the definite article is used in 42 instances, of which two are translated diabolos in the Septuagint and Satan in the ": null
    },
    {
        "King James Version": "king james bible"
    },
    {
        " :   42 ": null
    },
    {
        "Chronicles": "books of chronicles"
    },
    {
        " 42:42 Satan stood up against ": null
    },
    {
        "Israel": "israel"
    },
    {
        " or And there standeth up an adversary against Israel  Rachel Adelman The Return of the Repressed: Pirqe De-Rabbi Eliezer p42 However, in the parallel versions of the story in Chronicles, it is Satan ,   ": null
    },
    {
        "Psalm 42": "psalm 109"
    },
    {
        ":42b and let Satan stand at his right hand Septuagint 42:42 κατάστησον ἐπ᾽ αὐτὸν ἁμαρτωλόν καὶ διάβολος στήτω ἐκ δεξιῶν αὐτοῦ or let an accuser stand at his right hand.      The word satan does not occur in the ": null
    },
    {
        "Book of Genesis": "book of genesis"
    },
    {
        ", which mentions only a ": null
    },
    {
        "talking serpent": "serpents in the bible"
    },
    {
        " and does not identify the serpent with any supernatural entity. The first occurrence of the word satan in the Hebrew Bible in reference to a supernatural figure comes from , which describes the ": null
    },
    {
        "Angel of Yahweh": "angel of the lord"
    },
    {
        " confronting ": null
    },
    {
        "Balaam": "balaam"
    },
    {
        " on his donkey: Balaams departure aroused the wrath of ": null
    },
    {
        "Elohim": "elohim"
    },
    {
        ", and the Angel of Yahweh stood in the road as a satan against him.  In , Yahweh sends the Angel of Yahweh to inflict a plague against Israel for three days, ": null
    },
    {
        "killing 42 people": "destroying angel"
    },
    {
        " as punishment for ": null
    },
    {
        "David": "david"
    },
    {
        " having taken a census without his approval.  repeats this story, but replaces the Angel of Yahweh with an entity referred to as a satan .     Some passages clearly refer to the satan, without using the word itself.  describes the ": null
    },
    {
        "sons of Eli": "eli the sons of eli"
    },
    {
        " as sons of ": null
    },
    {
        "Belial": "belial"
    },
    {
        " ; the later usage of this word makes it clearly a synonym for satan . In  Yahweh sends a troubling spirit to torment King ": null
    },
    {
        "Saul": "saul"
    },
    {
        " as a mechanism to ingratiate David with the king. In , the prophet ": null
    },
    {
        "Micaiah": "micaiah"
    },
    {
        " describes to King ": null
    },
    {
        "Ahab": "ahab"
    },
    {
        " a vision of Yahweh sitting on his throne surrounded by the ": null
    },
    {
        "Host of Heaven": "heavenly host"
    },
    {
        ". Yahweh asks the Host which of them will lead Ahab astray. A spirit , whose name is not specified, but who is analogous to the satan, volunteers to be a Lying Spirit in the mouth of all his Prophets .          The satan appears in the ": null
    },
    {
        "Book of Job": "book of job"
    },
    {
        ", a poetic dialogue set within a prose framework, which may have been written around the time of the ": null
    },
    {
        "Babylonian captivity": "babylonian captivity"
    },
    {
        ". In the text, ": null
    },
    {
        "Job": "job"
    },
    {
        " is a righteous man favored by Yahweh.  describes the ": null
    },
    {
        "sons of God": "sons of god"
    },
    {
        "  presenting themselves before Yahweh. Yahweh asks one of them, the satan , where he has been, to which he replies that he has been roaming around the earth. Yahweh asks, Have you considered My servant Job?  The satan replies by urging Yahweh to let him torture Job, promising that Job will abandon his faith at the first tribulation. Yahweh consents; the satan destroys Jobs servants and flocks, yet Job refuses to condemn Yahweh. The first scene repeats itself, with the satan presenting himself to Yahweh alongside the other sons of God . Yahweh points out Jobs continued faithfulness, to which the satan insists that more testing is necessary; Yahweh once again gives him permission to test Job. In the end, Job remains faithful and righteous, and it is implied that the satan is shamed in his defeat.         contains a description of a vision dated to the middle of February of 42 BC, in which an angel shows ": null
    },
    {
        "Zechariah": "zechariah"
    },
    {
        " a scene of ": null
    },
    {
        "Joshua the High Priest": "joshua the high priest"
    },
    {
        " dressed in filthy rags, representing the nation of Judah and its sins, on trial with Yahweh as the judge and the satan standing as the ": null
    },
    {
        "prosecutor": "prosecutor"
    },
    {
        ". Yahweh rebukes the satan and orders for Joshua to be given clean clothes, representing Yahwehs forgiveness of Judahs sins.            During the ": null
    },
    {
        "Second Temple Period": "second temple period"
    },
    {
        ", when Jews were living in the ": null
    },
    {
        "Achaemenid Empire": "achaemenid empire"
    },
    {
        ", Judaism was heavily influenced by ": null
    },
    {
        "Zoroastrianism": "zoroastrianism"
    },
    {
        ", the religion of the Achaemenids.  Peter Clark, Zoroastrianism: An Introduction to Ancient Faith 42 page 42 There are so many features that Zoroastrianism seems to share with the Judeo-Christian tradition that it would be difficult to ... Historically the first point of contact that we can determine is when the Achaemenian Cyrus conquered Babylon ..42 BC Jewish conceptions of Satan were impacted by ": null
    },
    {
        "Angra Mainyu": "angra mainyu"
    },
    {
        ",  the Zoroastrian god of evil, darkness, and ignorance. In the ": null
    },
    {
        "Septuagint": "septuagint"
    },
    {
        ", the Hebrew ha-Satan in Job and ": null
    },
    {
        "Zechariah": "book of zechariah"
    },
    {
        " is translated by the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " word diabolos , the same word in the ": null
    },
    {
        "Greek New Testament": "novum testamentum graece"
    },
    {
        " from which the English word ": null
    },
    {
        "devil": "devil"
    },
    {
        " is derived. Where satan is used to refer to human enemies in the Hebrew Bible, such as ": null
    },
    {
        "Hadad the Edomite": "hadad the edomite"
    },
    {
        " and ": null
    },
    {
        "Rezon the Syrian": "rezon the syrian"
    },
    {
        ", the word is left untranslated but transliterated in the Greek as satan, a ": null
    },
    {
        "neologism": "neologism"
    },
    {
        " in Greek.     The idea of Satan as an opponent of God and a purely evil figure seems to have taken root in Jewish ": null
    },
    {
        "pseudepigrapha": "pseudepigrapha"
    },
    {
        " during the Second Temple Period,  particularly in the apocalypses. The ": null
    },
    {
        "Book of Enoch": "book of enoch"
    },
    {
        ", which the ": null
    },
    {
        "Dead Sea Scrolls": "dead sea scrolls"
    },
    {
        " have revealed to have been nearly as popular as the Torah, describes a group of 42 angels known as the ": null
    },
    {
        "Watchers": "watcher"
    },
    {
        " , who are assigned to supervise the earth, but instead abandon their duties and have sexual intercourse with human women. The leader of the Watchers is ": null
    },
    {
        "Semjâzâ": "samyaza"
    },
    {
        " and another member of the group, known as ": null
    },
    {
        "Azazel": "azazel"
    },
    {
        ", spreads sin and corruption among humankind. The Watchers are ultimately sequestered in isolated caves across the earth and are condemned to face judgement at the end of time. The ": null
    },
    {
        "Book of Jubilees": "book of jubilees"
    },
    {
        ", written in around 42 BC, retells the story of the Watchers defeat, but, in deviation from the Book of Enoch, ": null
    },
    {
        "Mastema": "mastema"
    },
    {
        ", the Chief of Spirits , intervenes before all of their demon offspring are sealed away, requesting for Yahweh to let him keep some of them to become his workers. Yahweh acquiesces this request and Mastema uses them to tempt humans into committing more sins, so that he may punish them for their wickedness. Later, Mastema induces Yahweh to test ": null
    },
    {
        "Abraham": "abraham"
    },
    {
        " by ordering him to ": null
    },
    {
        "sacrifice Isaac": "binding of isaac"
    },
    {
        ". Introduction to the Book of Jubilees, 42 Theology. Some of our Authors Views: Demonology, by R.H. Charles.     The ": null
    },
    {
        "Second Book of Enoch": "second book of enoch"
    },
    {
        ", also called the Slavonic Book of Enoch, contains references to a Watcher called Satanael. ": null
    },
    {
        "42 Enoch": "2 enoch"
    },
    {
        " 42:42 On this tradition, see A. Orlov, The Watchers of Satanael: The Fallen Angels Traditions in 42 Enoch, in: A. Orlov, Dark Mirrors: Azazel and Satanael in Early Jewish Demonology 42–42 It is a ": null
    },
    {
        "pseudepigraphic": "pseudepigraphic"
    },
    {
        " text of an uncertain date and unknown authorship. The text describes Satanael as being the prince of the Grigori who was cast out of heaven And I threw him out from the height with his angels, and he was flying in the air continuously above the bottomless – ": null
    },
    {
        "42 Enoch": "second book of enoch"
    },
    {
        " 42:42 and an evil spirit who knew the difference between what was righteous and sinful . The devil is the evil spirit of the lower places, as a fugitive he made Sotona from the heavens as his name was Satanail, thus he became different from the angels, but his nature did not change his intelligence as far as his understanding of righteous and sinful things – ": null
    },
    {
        "42 Enoch": "second book of enoch"
    },
    {
        " 42:42 In the ": null
    },
    {
        "Book of Wisdom": "book of wisdom"
    },
    {
        ", the devil is taken to be the being who brought death into the world, but originally the culprit was recognized as Cain. See .  The name ": null
    },
    {
        "Samael": "samael"
    },
    {
        ", which is used in reference to one of the ": null
    },
    {
        "fallen angel": "fallen angel"
    },
    {
        "s, later became a common name for Satan in Jewish ": null
    },
    {
        "Midrash": "midrash"
    },
    {
        " and ": null
    },
    {
        "Kabbalah": "kabbalah"
    },
    {
        ". Alexander Altmann, Alfred L. Ivry, Elliot R. Wolfson, Allan Arkush Perspectives on Jewish Thought and Mysticism Taylor & Francis 42  page 42          Most Jews do not believe in the existence of a supernatural omnimalevolent figure. Traditionalists and philosophers in ": null
    },
    {
        "medieval Judaism": "history of european jews in the middle ages"
    },
    {
        " adhered to ": null
    },
    {
        "rational theology": "rational theology"
    },
    {
        ", rejecting any belief in rebel or fallen angels, and viewing ": null
    },
    {
        "evil": "evil"
    },
    {
        " as abstract.  The Rabbis usually interpreted the word satan as it is used in the Tanakh as referring strictly to human adversaries Based on the ": null
    },
    {
        "Jewish exegesis": "jewish exegesis"
    },
    {
        " of 42 Samuel 42:42 and 42 Kings 42:42 –  and rejected all of the Enochian writings mentioning Satan as a literal, heavenly figure from the ": null
    },
    {
        "Biblical canon": "biblical canonjewish canon"
    },
    {
        ", making every attempt to root them out. Nonetheless, the word satan has occasionally been metaphorically applied to evil influences, such as the ": null
    },
    {
        "Jewish exegesis": "jewish exegesis"
    },
    {
        " of the  yetzer hara  mentioned in .      Rabbinical scholarship on the ": null
    },
    {
        "Book of Job": "book of job"
    },
    {
        " generally follows the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        " and ": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        " in identifying the satan from the prologue as a metaphor for the yetzer hara and not an actual entity. Robert Eisen Associate Professor of Religious Studies George Washington University The Book of Job in Medieval Jewish Philosophy 42 p42 Moreover, Zerahfiiah gives us insight into the parallel between the Garden of Eden story and the Job story alluded to ... both Satan and Jobs wife are metaphors for the evil inclination, a motif Zerahfiiah seems to identify with the imagination. Satan is rarely mentioned in ": null
    },
    {
        "Tannaitic": "tannaim"
    },
    {
        " literature, but is found in Babylonian ": null
    },
    {
        "aggadah": "aggadah"
    },
    {
        ".  According to a narration, the sound of the ": null
    },
    {
        "shofar": "shofar"
    },
    {
        ", which is primarily intended to remind Jews of the importance of  teshuva , is also intended symbolically to confuse the accuser and prevent him from rendering any ": null
    },
    {
        "litigation": "litigation"
    },
    {
        " to ": null
    },
    {
        "God": "god in judaism"
    },
    {
        " against the Jews. Ronald L. Eisenberg Dictionary of Jewish Terms: A Guide to the Language of Judaism Taylor Trade Publications 42; , page 42 ": null
    },
    {
        "Kabbalah": "kabbalah"
    },
    {
        " presents Satan as an agent of God whose function is to tempt humans into sinning so that he may accuse them in the heavenly court. Rabbi Rachel Timoner Breath of Life: God as Spirit in Judaism Paraclete Press 42;  The ": null
    },
    {
        "Hasidic Jews": "hasidic judaism"
    },
    {
        " of the eighteenth century associated ha-Satan with Baal Davar. The Dictionary of Angels by Gustav Davidson, © 42     Each modern sect of Judaism has its own interpretation of Satans identity. ": null
    },
    {
        "Conservative Judaism": "conservative judaism"
    },
    {
        " generally rejects the Talmudic interpretation of Satan as a metaphor for the yetzer hara, and regard him as a literal agent of God.  ": null
    },
    {
        "Orthodox Judaism": "orthodox judaism"
    },
    {
        ", on the other hand, outwardly embraces Talmudic teachings on Satan, and involves Satan in religious life far more inclusively than other sects. Satan is mentioned explicitly in some daily prayers, including during ": null
    },
    {
        "Shacharit": "shacharit"
    },
    {
        " and certain post-meal benedictions, as described in ": null
    },
    {
        "Talmud": "berakhot"
    },
    {
        "  and ": null
    },
    {
        "the Jewish Code of Law": "shulchan aruch"
    },
    {
        ".  In ": null
    },
    {
        "Reform Judaism": "reform judaism"
    },
    {
        ", Satan is generally seen in his Talmudic role as a metaphor for the yetzer hara and the symbolic representation of innate human qualities such as selfishness.               The most common English synonym for Satan is ": null
    },
    {
        "devil": "devil"
    },
    {
        " , which descends from ": null
    },
    {
        "Middle English": "middle english"
    },
    {
        " devel, from ": null
    },
    {
        "Old English": "old english"
    },
    {
        " dēofol, that in turn represents an early ": null
    },
    {
        "Germanic": "germanic languages"
    },
    {
        " borrowing of ": null
    },
    {
        "Latin": "latin"
    },
    {
        " diabolus . This in turn was borrowed from ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " diabolos ": null
    },
    {
        "slanderer": "defamation"
    },
    {
        " , from diaballein to slander : dia- across, through + ballein to hurl .  In the New Testament, the words Satan and diabolos are used interchangeably as synonyms.  ": null
    },
    {
        "Beelzebub": "beelzebub"
    },
    {
        ", meaning Lord of Flies , is the contemptuous name given in the Hebrew Bible and New Testament to a ": null
    },
    {
        "Philistine": "philistine"
    },
    {
        " god whose original name has been reconstructed as most probably Baal Zabul , meaning ": null
    },
    {
        "Baal": "baal"
    },
    {
        " the Prince . The ": null
    },
    {
        "Synoptic Gospels": "synoptic gospels"
    },
    {
        " identify Satan and Beelzebub as the same. The name ": null
    },
    {
        "Abaddon": "abaddon"
    },
    {
        " is used six times in the Old Testament, mainly as a name for one the regions of ": null
    },
    {
        "Sheol": "sheol"
    },
    {
        ".  describes Abaddon, whose name is translated into Greek as Apollyon, meaning the destroyer , as an angel who rules the ": null
    },
    {
        "Abyss": "abyss"
    },
    {
        ".  In modern usage, Abaddon is sometimes equated with Satan.              The three Synoptic Gospels all describe the ": null
    },
    {
        "temptation of Christ": "temptation of christ"
    },
    {
        " by Satan in the desert . Satan first shows Jesus a stone and tells him to turn it into bread. He also takes him to the pinnacle of the ": null
    },
    {
        "Temple": "second temple"
    },
    {
        " in Jerusalem and commands Jesus to throw himself down so that the angels will catch him. Satan takes Jesus to the top of a tall mountain as well; there, he shows him the kingdoms of the earth and promises to give them all to him if he will bow down and worship him. Each time Jesus rebukes Satan and, after the third temptation, he is administered by the angels. Satans promise in  and  to give Jesus all the kingdoms of the earth implies that all those kingdoms belong to him. The fact that Jesus does not dispute Satans promise indicates that the authors of those gospels believed this to be true.     Satan plays a role in some of the ": null
    },
    {
        "parables of Jesus": "parables of jesus"
    },
    {
        ", namely the ": null
    },
    {
        "Parable of the Sower": "parable of the sower"
    },
    {
        ", the ": null
    },
    {
        "Parable of the Weeds": "parable of the tares"
    },
    {
        ", ": null
    },
    {
        "Parable of the Sheep and the Goats": "the sheep and the goats"
    },
    {
        ", and the ": null
    },
    {
        "Parable of the Strong Man": "parable of the strong man"
    },
    {
        ". According to the Parable of the Sower, Satan profoundly influences those who fail to understand the gospel. The latter two parables say that Satans followers will be punished on ": null
    },
    {
        "Judgement Day": "judgement day"
    },
    {
        ", with the Parable of the Sheep and the Goats stating that the Devil, his angels, and the people who follow him will be consigned to eternal fire . When the ": null
    },
    {
        "Pharisees": "pharisees"
    },
    {
        " accused Jesus of exorcising demons through the power of Beelzebub, Jesus responds by telling the Parable of the Strong Man, saying: how can someone enter a strong mans house and plunder his goods, unless he first binds the strong man? Then indeed he may plunder his house . The strong man in this parable represents Satan.     The Synoptic Gospels identify Satan and his demons as the causes of illness, including ": null
    },
    {
        "fever": "fever"
    },
    {
        " , ": null
    },
    {
        "leprosy": "leprosy"
    },
    {
        " , and ": null
    },
    {
        "arthritis": "arthritis"
    },
    {
        " , while the ": null
    },
    {
        "Epistle to the Hebrews": "epistle to the hebrews"
    },
    {
        " describes the Devil as him who holds the power of death . The author of ": null
    },
    {
        "Luke-Acts": "luke-acts"
    },
    {
        " attributes more power to Satan than both Matthew and Mark. In , Jesus grants Satan the authority to test ": null
    },
    {
        "Peter": "saint peter"
    },
    {
        " and the other ": null
    },
    {
        "apostles": "apostles"
    },
    {
        ".  states that ": null
    },
    {
        "Judas Iscariot": "judas iscariot"
    },
    {
        " betrayed Jesus because Satan entered him and, in , Peter describes Satan as filling ": null
    },
    {
        "Ananias": "ananias and sapphira"
    },
    {
        "s heart and causing him to sin. The ": null
    },
    {
        "Gospel of John": "gospel of john"
    },
    {
        " only uses the name Satan three times. In , Jesus says that his Jewish or Judean enemies are the children of the Devil rather than the children of Abraham. The same verse describes the Devil as a man-killer from the beginning  and a liar and the father of lying.   describes the Devil as inspiring Judas to betray Jesus and  identifies Satan as the ": null
    },
    {
        "Archon": "archon"
    },
    {
        " of this Cosmos , who is destined to be overthrown through Jesuss death and resurrection.  promises that the ": null
    },
    {
        "Holy Spirit": "holy spirit in christianity"
    },
    {
        " will accuse the World concerning sin, justice, and judgement , a role resembling that of the satan in the Old Testament.      refers to a dispute between ": null
    },
    {
        "Michael the Archangel": "michael"
    },
    {
        " and the Devil over the body of ": null
    },
    {
        "Moses": "moses"
    },
    {
        ". Some interpreters understand this reference to be an allusion to the events described in .   The classical theologian ": null
    },
    {
        "Origen": "origen"
    },
    {
        " attributes this reference to the non-canonical ": null
    },
    {
        "Assumption of Moses": "assumption of moses"
    },
    {
        ".   According to ": null
    },
    {
        "James H. Charlesworth": "james h. charlesworth"
    },
    {
        ", there is no evidence the surviving book of this name ever contained any such content. James Charlesworth Old Testament Pseudepigrapha, p. 42  Others believe it to be in the lost ending of the book. The Assumption of Moses: a critical edition with commentary By Johannes Tromp. p. 42 The second chapter of the ": null
    },
    {
        "Second Epistle of Peter": "second epistle of peter"
    },
    {
        ", a pseudepigraphical letter which falsely claims to have been written by Peter, copies much of the content of the Epistle of Jude, but omits the specifics of the example regarding Michael and Satan, with  instead mentioning only an ambiguous dispute between Angels and Glories . Throughout the New Testament, Satan is referred to as a tempter , the ruler of the demons , the God of this Age , the evil one , and a roaring lion .            The ": null
    },
    {
        "Book of Revelation": "book of revelation"
    },
    {
        " represents Satan as the supernatural ruler of the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        " and the ultimate cause of all evil in the world. In , as part of the letter to the church at ": null
    },
    {
        "Smyrna": "smyrna"
    },
    {
        ", ": null
    },
    {
        "John of Patmos": "john of patmos"
    },
    {
        " refers to the Jews of Smyrna as a ": null
    },
    {
        "synagogue of Satan": "synagogue of satan"
    },
    {
        "  and warns that the Devil is about to cast some of you into prison as a test peirasmos, and for ten days you will have affliction.  In , in the letter to the church of ": null
    },
    {
        "Pergamum": "pergamum"
    },
    {
        ", John warns that Satan lives among the members of the congregation and declares that Satans throne is in their midst. Pergamum was the capital of the ": null
    },
    {
        "Roman Province of Asia": "asia"
    },
    {
        " and Satans throne may be referring to the monumental ": null
    },
    {
        "Pergamon Altar": "pergamon altar"
    },
    {
        " in the city, which was dedicated to the Greek god ": null
    },
    {
        "Zeus": "zeus"
    },
    {
        ", or to a temple dedicated to the Roman emperor ": null
    },
    {
        "Augustus": "augustus"
    },
    {
        ".      describes a vision of a ": null
    },
    {
        "Great Red Dragon": "serpents in the bibleancient serpent"
    },
    {
        " with seven heads, ten horns, seven crowns, and a massive tail, an image which is clearly inspired by the vision of the ": null
    },
    {
        "four beasts from the sea": "four kingdoms of daniel"
    },
    {
        " in the ": null
    },
    {
        "Book of Daniel": "book of daniel"
    },
    {
        " and the ": null
    },
    {
        "Leviathan": "leviathan"
    },
    {
        " described in various Old Testament passages. The Great Red Dragon knocks a third of the sun... a third of the moon, and a third of the stars out the sky and pursues the ": null
    },
    {
        "Woman of the Apocalypse": "woman of the apocalypse"
    },
    {
        ".  declares: ": null
    },
    {
        "And war broke out in Heaven": "war in heaven"
    },
    {
        ". Michael and his angels fought against Dragon. Dragon and his angels fought back, but they were defeated, and there was no longer any place for them in Heaven. Dragon the Great was thrown down, that ancient serpent who is called Devil and Satan, the one deceiving the whole inhabited World – he was thrown down to earth and his angels were thrown down with him.  Then a voice booms down from Heaven heralding the defeat of the Accuser , identifying the Satan of Revelation with the satan of the Old Testament.     In , Satan is bound with a chain and hurled into the ": null
    },
    {
        "Abyss": "abyss"
    },
    {
        ", where he is imprisoned for ": null
    },
    {
        "one thousand years": "millennialism"
    },
    {
        ". In , he is set free and gathers his armies along with ": null
    },
    {
        "Gog and Magog": "gog and magog"
    },
    {
        " to wage war against the righteous, but is defeated with fire from Heaven, and cast into the ": null
    },
    {
        "lake of fire": "lake of fire"
    },
    {
        ". Some Christians associate Satan with the number ": null
    },
    {
        "42": "666"
    },
    {
        ", which  describes as the ": null
    },
    {
        "Number of the Beast": "number of the beast"
    },
    {
        ".  However, ": null
    },
    {
        "the beast": "the beast"
    },
    {
        " mentioned in Revelation 42 is not Satan,  and the use of 42 in the Book of Revelation has been interpreted as a reference to the Roman Emperor ": null
    },
    {
        "Nero": "nero"
    },
    {
        ", as 42 is the numeric value of his name in Hebrew.       Despite the fact that the Book of Genesis never mentions Satan, Christians have traditionally interpreted the serpent in the ": null
    },
    {
        "Garden of Eden": "garden of eden"
    },
    {
        " as Satan due to , which calls Satan that ancient serpent . This verse, however, is probably intended to identify Satan with the ": null
    },
    {
        "Leviathan": "leviathan"
    },
    {
        ", a monstrous sea-serpent whose destruction by Yahweh is prophesied in . The first recorded individual to identify Satan with the serpent from the Garden of Eden was the second-century AD Christian apologist ": null
    },
    {
        "Justin Martyr": "justin martyr"
    },
    {
        ", in chapters 42 and 42 of his  Dialogue with Trypho . Other early ": null
    },
    {
        "church fathers": "church fathers"
    },
    {
        " to mention this identification include ": null
    },
    {
        "Theophilus": "theophilus of antioch"
    },
    {
        " and ": null
    },
    {
        "Tertullian": "tertullian"
    },
    {
        ". The early Christian Church, however, encountered opposition from pagans such as ": null
    },
    {
        "Celsus": "celsus"
    },
    {
        ", who claimed in his treatise  The True Word  that it is blasphemy... to say that the greatest God... has an adversary who constrains his capacity to do good and said that Christians impiously divide the kingdom of God, creating a rebellion in it, as if there were opposing factions within the divine, including one that is hostile to God .         The name Heylel, meaning morning star , was a name for ": null
    },
    {
        "Attar": "attar"
    },
    {
        ", the god of the planet ": null
    },
    {
        "Venus": "venus"
    },
    {
        " in ": null
    },
    {
        "Canaanite mythology": "canaanite mythology"
    },
    {
        ", who attempted to scale the walls of the heavenly city, but was vanquished by the ": null
    },
    {
        "god of the sun": "shamash"
    },
    {
        ". The name is used in  in metaphorical reference to the king of Babylon.  uses a description of a ": null
    },
    {
        "cherub in Eden": "ezekiels cherub in eden"
    },
    {
        " as a polemic against ": null
    },
    {
        "Ithobaal II": "ithobaal ii"
    },
    {
        ", the king of Tyre. The ": null
    },
    {
        "Church Father": "church fathers"
    },
    {
        " Origen of Alexandria": "origen"
    },
    {
        " , who was only aware of the actual text of these passages and not the original myths to which they refer, concluded in his treatise  On the First Principles , which is preserved in a Latin translation by ": null
    },
    {
        "Tyrannius Rufinus": "tyrannius rufinus"
    },
    {
        ", that neither of these verses could literally refer to a human being and must therefore be alluding to a certain Angel who had received the office of governing the nation of the Tyrians, but was hurled down to Earth after he was found to be corrupt. Origen, , Chapter 42 Paragraphs 42–42      In his apologetic treatise  Contra Celsum , however, Origen changed his interpretations of Isaiah 42:42 and Ezekiel 42:42–42 now interpreting both of them as referring to Satan. According to Henry Ansgar Kelly, Origen seems to have adopted this new interpretation to refute unnamed persons who, perhaps under the influence of Zoroastrian radical dualism, believed that Satans original nature was Darkness.  The later Church Father ": null
    },
    {
        "Jerome": "jerome"
    },
    {
        " , translator of the Latin ": null
    },
    {
        "Vulgate": "vulgate"
    },
    {
        ", accepted Origens theory of Satan as a fallen angel and wrote about it in his commentary on the Book of Isaiah. In Christian tradition ever since, both Isaiah 42:42 and Ezekiel 42:42–42 have been understood as allegorically referring to Satan. For most Christians, Satan has been regarded as an angel who rebelled against ": null
    },
    {
        "God": "god in christianity"
    },
    {
        ".     According to the ": null
    },
    {
        "ransom theory of atonement": "ransom theory of atonement"
    },
    {
        ", which was popular among early Christian theologians, Satan gained power over humanity through ": null
    },
    {
        "Adam and Eve": "adam and eve"
    },
    {
        "s sin and ": null
    },
    {
        "Christs death on the cross": "crucifixion of jesus"
    },
    {
        " was a ransom to Satan in exchange for humanitys liberation. This theory holds that Satan was tricked by God because Christ was not only free of sin, but also the incarnate Deity, whom Satan lacked the ability to enslave. ": null
    },
    {
        "Irenaeus of Lyons": "irenaeus"
    },
    {
        " described a ": null
    },
    {
        "prototypical": "prototype"
    },
    {
        " form of the ransom theory, but Origen was the first to propose it in its fully developed form. The theory was later expanded by theologians such as ": null
    },
    {
        "Gregory of Nyssa": "gregory of nyssa"
    },
    {
        " and ": null
    },
    {
        "Rufinus of Aquileia": "tyrannius rufinus"
    },
    {
        ". In the eleventh century, ": null
    },
    {
        "Anselm of Canterbury": "anselm of canterbury"
    },
    {
        " criticized the ransom theory, along with the associated ": null
    },
    {
        "Christus Victor": "christus victor"
    },
    {
        " theory, resulting in the theorys decline in western Europe. The theory has nonetheless retained some of its popularity in the ": null
    },
    {
        "Eastern Orthodox Church": "eastern orthodox church"
    },
    {
        ".     Most ": null
    },
    {
        "early Christians": "early christianity"
    },
    {
        " firmly believed that Satan and his demons had the power to possess humans and ": null
    },
    {
        "exorcism": "exorcism"
    },
    {
        "s were widely practiced by Jews, Christians, and pagans alike. Belief in ": null
    },
    {
        "demonic possession": "demonic possession"
    },
    {
        " continued through the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " into the ": null
    },
    {
        "early modern period": "early modern period"
    },
    {
        ". Exorcisms were seen as a display of Gods power over Satan. The vast majority of people who thought they were possessed by the Devil did not suffer from hallucinations or other spectacular symptoms , but complained of anxiety, religious fears, and evil thoughts.             Satan had minimal role in ": null
    },
    {
        "medieval Christian theology": "medieval christian theology"
    },
    {
        ", but he frequently appeared as a recurring comedic ": null
    },
    {
        "stock character": "stock character"
    },
    {
        " in late medieval ": null
    },
    {
        "mystery play": "mystery play"
    },
    {
        "s, in which he was portrayed as a ": null
    },
    {
        "comic relief": "comic relief"
    },
    {
        " figure who frolicked, fell, and farted in the background . ": null
    },
    {
        "Jeffrey Burton Russell": "jeffrey burton russell"
    },
    {
        " describes the medieval conception of Satan as more pathetic and repulsive than terrifying  and he was seen as little more than a nuisance to Gods overarching plan. The  Golden Legend , a collection of saints lives compiled in around 42 by the Dominican Friar ": null
    },
    {
        "Jacobus da Varagine": "jacobus da varagine"
    },
    {
        ", contains numerous stories about encounters between saints and Satan, in which Satan is constantly duped by the saints cleverness and by the power of God. Henry Ansgar Kelly remarks that Satan comes across as the opposite of fearsome.  The Golden Legend was the most popular book during the High and Late Middle Ages and more manuscripts of it have survived from the period than for any other book, including even the Bible itself.     The  Canon Episcopi , written in the eleventh century AD, condemns belief in ": null
    },
    {
        "witchcraft": "european witchcraft"
    },
    {
        " as heretical, but also documents that many people at the time apparently believed in it. Witches were believed to ": null
    },
    {
        "fly through the air on broomsticks": "broommagic"
    },
    {
        ", consort with demons, perform in ": null
    },
    {
        "lurid sexual rituals": "black mass"
    },
    {
        " in the forests, murder human infants and eat them as part of Satanic rites, and engage in ": null
    },
    {
        "conjugal relations": "sexual intercourse"
    },
    {
        " with demons. In 42 ": null
    },
    {
        "Pope John XXII": "pope john xxii"
    },
    {
        " issued the ": null
    },
    {
        "papal bull": "papal bull"
    },
    {
        " Super illius Specula, which condemned folk divination practices as consultation with Satan. By the 42s, the Catholic Church began to regard witchcraft as part of a ": null
    },
    {
        "vast conspiracy": "conspiracy theory"
    },
    {
        " led by Satan himself.            During the ": null
    },
    {
        "Early Modern Period": "early modern period"
    },
    {
        ", Christians gradually began to regard Satan as increasingly powerful and the fear of Satans power became a dominant aspect of the worldview of Christians across Europe. During the ": null
    },
    {
        "Protestant Reformation": "protestant reformation"
    },
    {
        ", ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        " taught that, rather than trying to argue with Satan, Christians should avoid temptation altogether by seeking out pleasant company; Luther especially recommended music as a safeguard against temptation, since the Devil cannot endure ": null
    },
    {
        "gaiety": "happiness"
    },
    {
        ".  ": null
    },
    {
        "John Calvin": "john calvin"
    },
    {
        " repeated a maxim from ": null
    },
    {
        "Saint Augustine": "augustine of hippo"
    },
    {
        " that Man is like a horse, with either God or the devil as rider.      In the late fifteenth century, a series of witchcraft panics erupted in France and Germany. The German ": null
    },
    {
        "Inquisitor": "inquisitor"
    },
    {
        "s ": null
    },
    {
        "Heinrich Kramer": "heinrich kramer"
    },
    {
        " and ": null
    },
    {
        "Jacob Sprenger": "jacob sprenger"
    },
    {
        " argued in their book  Malleus Maleficarum , published in 42 that all  maleficia  was rooted in the work of Satan. In the mid-sixteenth century, the panic spread to England and Switzerland. Both Protestants and Catholics alike firmly believed in witchcraft as a real phenomenon and supported its prosecution. In the late 42s, the Dutch demonologist ": null
    },
    {
        "Johann Weyer": "johann weyer"
    },
    {
        " argued in his treatise  De praestigiis daemonum  that witchcraft did not exist, but that Satan promoted belief in it to lead Christians astray. The panic over witchcraft intensified in the 42s and continued until the end of the 42s. Brian Levack estimates that around 42 people were executed for witchcraft during the entire span of the witchcraft hysteria.     The early English settlers of North America, especially the ": null
    },
    {
        "Puritans": "puritans"
    },
    {
        " of ": null
    },
    {
        "New England": "new england"
    },
    {
        ", believed that Satan visibly and palpably reigned in the ": null
    },
    {
        "New World": "new world"
    },
    {
        ". ": null
    },
    {
        "John Winthrop": "john winthrop"
    },
    {
        " claimed that the Devil made rebellious Puritan women give birth to ": null
    },
    {
        "stillborn": "stillbirth"
    },
    {
        " monsters with claws, sharp horns, and on each foot three claws, like a young fowl.  ": null
    },
    {
        "Cotton Mather": "cotton mather"
    },
    {
        " wrote that devils swarmed around Puritan settlements like the ": null
    },
    {
        "frogs of Egypt": "plagues of egypt"
    },
    {
        " . The Puritans believed that the ": null
    },
    {
        "Native Americans": "native americans in the united states"
    },
    {
        " were worshippers of Satan and described them as children of the Devil . Some settlers claimed to have seen Satan himself appear in the flesh at native ceremonies. During the ": null
    },
    {
        "First Great Awakening": "first great awakening"
    },
    {
        ", the ": null
    },
    {
        "new light": "old and new light"
    },
    {
        " preachers portrayed their old light critics as ministers of Satan. By the time of the ": null
    },
    {
        "Second Great Awakening": "second great awakening"
    },
    {
        ", Satans primary role in ": null
    },
    {
        "American evangelicalism": "american evangelicalism"
    },
    {
        " was as the opponent of the evangelical movement itself, who spent most of his time trying to hinder the ministries of evangelical preachers, a role he has largely retained among present-day ": null
    },
    {
        "American fundamentalists": "christian fundamentalismin the united states"
    },
    {
        ".     By the early 42s, skeptics in Europe, including the English author ": null
    },
    {
        "Reginald Scot": "reginald scot"
    },
    {
        " and the Anglican bishop ": null
    },
    {
        "John Bancroft": "john bancroft"
    },
    {
        ", had begun to criticize the belief that demons still had the power to possess people. This skepticism was bolstered by the belief that ": null
    },
    {
        "miracle": "miracle"
    },
    {
        "s only occurred during the ": null
    },
    {
        "Apostolic Age": "apostolic age"
    },
    {
        ", which had long since ended. Later, ": null
    },
    {
        "Enlightenment": "age of enlightenment"
    },
    {
        " thinkers, such as ": null
    },
    {
        "David Hume": "david hume"
    },
    {
        ", ": null
    },
    {
        "Denis Diderot": "denis diderot"
    },
    {
        ", and ": null
    },
    {
        "Voltaire": "voltaire"
    },
    {
        ", attacked the notion of Satans existence altogether. Voltaire labelled John Miltons Paradise Lost a disgusting fantasy  and declared that belief in Hell and Satan were among the many lies propagated by the Catholic Church to keep humanity enslaved. By the eighteenth century, trials for witchcraft had ceased in most western countries, with the notable exceptions of ": null
    },
    {
        "Poland": "poland"
    },
    {
        " and ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ", where they continued. Belief in the power of Satan, however, remained strong among traditional Christians.            ": null
    },
    {
        "Mormonism": "mormonism"
    },
    {
        " developed its own views on Satan. According to the ": null
    },
    {
        "Book of Moses": "book of moses"
    },
    {
        ", the Devil offered to be the redeemer of mankind for the sake of his own glory. Conversely, Jesus offered to be the redeemer of mankind so that his fathers will would be done. After his offer was rejected, Satan became rebellious and was subsequently cast out of heaven. In the Book of Moses, ": null
    },
    {
        "Cain": "cain and abel"
    },
    {
        " is said to have loved Satan more than God  and conspired with Satan to kill ": null
    },
    {
        "Abel": "cain and abel"
    },
    {
        ". It was through this pact that Cain became a ": null
    },
    {
        "Master Mahan": "master mahan"
    },
    {
        ".  The Book of Moses also says that ": null
    },
    {
        "Moses": "moses"
    },
    {
        " was tempted by Satan before calling upon the name of the ": null
    },
    {
        "Only Begotten": "monogenēs"
    },
    {
        " , which caused Satan to depart. ": null
    },
    {
        "Douglas Davies": "douglas davies"
    },
    {
        " asserts that this text reflects the temptation of Jesus in the Bible.     Belief in Satan and demonic possession remains strong among Christians in the United States and ": null
    },
    {
        "Latin America": "latin america"
    },
    {
        ". According to a 42 poll conducted by ": null
    },
    {
        "YouGov": "yougov"
    },
    {
        ", fifty-seven percent of people in the United States believe in a literal Devil, compared to eighteen percent of people in Britain. Fifty-one percent of Americans believe that Satan has the power to possess people. W. Scott Poole, author of Satan in America: The Devil We Know, has opined that In the United States over the last forty to fifty years, a composite image of Satan has emerged that borrows from both popular culture and theological sources and that most American Christians do not separate what they know from the movies from what they know from various ecclesiastical and theological traditions. The Catholic Church generally played down Satan and exorcism during late twentieth and early twenty-first centuries, but ": null
    },
    {
        "Pope Francis": "pope francis"
    },
    {
        " brought renewed focus on the Devil in the early 42s, stating, among many other pronouncements, that The devil is intelligent, he knows more theology than all the theologians together.  According to the  Encyclopædia Britannica , ": null
    },
    {
        "liberal Christianity": "liberal christianity"
    },
    {
        " tends to view Satan as a mythological attempt to express the reality and extent of evil in the universe, existing outside and apart from humanity but profoundly influencing the human sphere.      ": null
    },
    {
        "Bernard McGinn": "bernard mcginn"
    },
    {
        " describes multiple traditions detailing the relationship between the ": null
    },
    {
        "Antichrist": "antichrist"
    },
    {
        " and Satan. In the dualist approach, Satan will become incarnate in the Antichrist, just as ": null
    },
    {
        "God became incarnate in Jesus": "incarnation"
    },
    {
        ". However, in ": null
    },
    {
        "Orthodox Christian": "orthodox christianity"
    },
    {
        " thought, this view is problematic because it is too similar to Christs incarnation. Instead, the indwelling view has become more accepted, which stipulates that the Antichrist is a human figure inhabited by Satan, since the latters power is not to be seen as equivalent to Gods.             The ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        " equivalent of the word Satan is  Shaitan  . The word itself is an ": null
    },
    {
        "adjective": "adjective"
    },
    {
        " that can be applied to both ": null
    },
    {
        "man": "man"
    },
    {
        " and ": null
    },
    {
        "al-jinn": "jinnislamic theology"
    },
    {
        " , but it is also used in reference to Satan in particular. In the ": null
    },
    {
        "Quran": "quran"
    },
    {
        ", Satans name is ": null
    },
    {
        "Iblis": "iblis"
    },
    {
        " , probably a derivative of the Greek word diabolos. Muslims do not regard Satan as the cause of evil, but as a tempter, who takes advantage of humans inclinations toward self-centeredness. Charles Mathewes Understanding Religious Ethics John Wiley & Sons 42  page 42          Seven ": null
    },
    {
        "sura": "sura"
    },
    {
        "s in the Quran describe how ": null
    },
    {
        "God": "god in islam"
    },
    {
        " ordered all the ": null
    },
    {
        "angels": "islamic view of angels"
    },
    {
        " and Iblis to bow before the newly-created ": null
    },
    {
        "Adam": "adam in islam"
    },
    {
        ". All the angels bowed, but Iblis refused, claiming to be superior to Adam because he was made from fire; whereas Adam was made from clay . Consequently, God expelled him from ": null
    },
    {
        "Paradise": "jannah"
    },
    {
        " and condemned him to ": null
    },
    {
        "Jahannam": "jahannam"
    },
    {
        ". Iblis thereafter became a  kafir , an ungrateful disbeliever , whose sole mission is to lead humanity astray.  God allows Iblis to do this,  because he knows that the righteous will be able to resist Ibliss attempts to misguide them. On ": null
    },
    {
        "Judgement Day": "islamic eschatology"
    },
    {
        ", while the lot of Satan remains in question, Annemarie Schimmel Gabriels Wing: A Study Into the Religious Ideas of Sir Muhammad Iqbal Brill Archive 42 page 42 those who followed him will be thrown into the fires of Jahannam. After his banishment from Paradise, Iblis, who thereafter became known as Al-Shaitan , lured ": null
    },
    {
        "Adam and Eve": "adam and eve"
    },
    {
        " into eating the fruit from the ": null
    },
    {
        "forbidden tree": "tree of life"
    },
    {
        ".      The primary characteristic of Satan, aside from his ": null
    },
    {
        "hubris": "hubris"
    },
    {
        " and ": null
    },
    {
        "despair": "despair"
    },
    {
        ", is his ability to cast evil suggestions  into men and women. Georges Tamer Islam and Rationality: The Impact of al-Ghazālī. Papers Collected on His 42th Anniversary, Band 42 BRILL 42  page 42  states that Satan has no influence over the righteous, but that those who fall in error are under his power.  implies that those who obey Gods laws are immune to the temptations of Satan.  warns that Satan tries to keep Muslims from reading the Quran and  recommends reciting the Quran as an antidote against Satan.  refers to Satan as the enemy of humanity and  forbids humans from worshipping him. In the Quranic retelling of the story of ": null
    },
    {
        "Job": "job in islam"
    },
    {
        ", Job knows that Satan is the one tormenting him.              In the Quran, Satan is apparently an angel, but, in , he is described as from the jinns . This, combined with the fact that he describes himself as having been made from fire, posed a major problem for ": null
    },
    {
        "Muslims exegetes of the Quran": "tafsir"
    },
    {
        ", who disagree on whether Satan is a fallen angel or the leader of a group of evil jinn. According to a hadith from ": null
    },
    {
        "Ibn Abbas": "ibn abbas"
    },
    {
        ", Iblis was actually an angel whom God created out of fire. Ibn Abbas asserts that the word jinn could be applied to earthly jinn, but also to fiery angels like Satan. Tafsir al-Quran al-adhim – ": null
    },
    {
        "Ibn Kathir": "ibn kathir"
    },
    {
        " - commentary of surat al baqarah     ": null
    },
    {
        "Hasan of Basra": "hasan of basra"
    },
    {
        ", an eminent Muslim theologian who lived in the seventh century AD, was quoted as saying: Iblis was not an angel even for the time of an eye wink. He is the origin of Jinn as Adam is of Mankind. The Beginning and the End – ": null
    },
    {
        "Ibn Kathir": "ibn kathir"
    },
    {
        " – Volume I, also the Koranic commentary of the same author The medieval Persian scholar ": null
    },
    {
        "Abu Al-Zamakhshari": "al-zamakhshari"
    },
    {
        " states that the words angels and jinn are synonyms. Another Persian scholar, ": null
    },
    {
        "Al-Baydawi": "al-baydawi"
    },
    {
        ", instead argues that Satan hoped to be an angel, but that his actions made him a jinn. Other Islamic scholars argue that Satan was a jinn who was admitted into Paradise as a reward for his righteousness and, unlike the angels, was given the choice to obey or disobey God. When he was expelled from Paradise, Satan blamed humanity for his punishment. Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 42  page 42 Concerning the fiery origin of Iblis, ": null
    },
    {
        "Zakariya al-Qazwini": "zakariya al-qazwini"
    },
    {
        " and Muḥammad ibn Aḥmad Ibshīhī Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 42  p.42 state that all supernatural creatures originated from fire but the angels from its light and the jinn from its blaze, thus fire denotes a disembodiment origin of all spiritual entities. Seyyed Hossein Nasr Islamic Life and Thought Routledge 42  page 42 ": null
    },
    {
        "Abd al-Ghani al-Maqdisi": "abd al-ghani al-maqdisi"
    },
    {
        " argued that only the angels of mercy are created from light, but ": null
    },
    {
        "angels of punishment": "zabaniyya"
    },
    {
        " have been created from fire.      The Muslim historian ": null
    },
    {
        "Al-Tabari": "al-tabari"
    },
    {
        ", who died in around 42 AD, writes that, before Adam was created, earthly jinn made of smokeless fire roamed the earth and spread corruption. He further relates that Iblis was originally an angel named Azazil or Al-Harith, from a group of angels, in contrast to the jinn, created from the  fires of simoom , Brannon Wheeler Prophets in the Quran: An Introduction to the Quran and Muslim Exegesis A & C Black 42  page 42 who was sent by God to confront the earthly jinn. Azazil defeated the jinn in battle and drove them into the mountains, but he became convinced that he was superior to humans and all the other angels, leading to his downfall. In this account, Azazils group of angels were called jinn because they guarded ": null
    },
    {
        "Jannah": "jannah"
    },
    {
        " . In another tradition recorded by Al-Tabari, Satan was one of the earthly jinn, who was taken captive by the angels and brought to Heaven as a prisoner. God appointed him as judge over the other jinn and he became known as Al-Hakam. He fulfilled his duty for a thousand years before growing negligent, but was rehabilitated again and resumed his position until his refusal to bow before Adam.          During the first two centuries of Islam, Muslims almost unanimously accepted the traditional story known as the ": null
    },
    {
        "Satanic Verses": "satanic verses"
    },
    {
        " as true. According to this narrative, ": null
    },
    {
        "Muhammad": "muhammad in islam"
    },
    {
        " was told by Satan to add words to the Quran which would allow Muslims to pray for the intercession of pagan goddesses.  He mistook the words of Satan for ": null
    },
    {
        "divine inspiration": "divine inspiration"
    },
    {
        ". Modern Muslims almost universally reject this story as heretical, as it calls the integrity of the Quran into question.     On the third day of the ": null
    },
    {
        "Hajj": "hajj"
    },
    {
        ", Muslim pilgrims to ": null
    },
    {
        "Mecca": "mecca"
    },
    {
        " throw seven stones at a pillar known as the Jamrah al-’Aqabah, symbolizing the ": null
    },
    {
        "stoning of the Devil": "stoning of the devil"
    },
    {
        ". This ritual is based on the Islamic tradition that, when God ordered ": null
    },
    {
        "Abraham": "abraham in islam"
    },
    {
        " to sacrifice his son ": null
    },
    {
        "Ishmael": "ishmael in islam"
    },
    {
        ", Satan tempted him three times not to do it, and, each time, Abraham responded by throwing seven stones at him.      The ": null
    },
    {
        "hadith": "hadith"
    },
    {
        " teach that newborn babies cry because Satan touches them while they are being born, and that this touch causes people to have an aptitude for sin. This doctrine bears some similarities to the doctrine of ": null
    },
    {
        "original sin": "original sin"
    },
    {
        ". Muslim tradition holds that only ": null
    },
    {
        "Jesus": "jesus in islam"
    },
    {
        " and ": null
    },
    {
        "Mary": "mary in islam"
    },
    {
        " were not touched by Satan at birth. However, when he was a boy, Muhammads ": null
    },
    {
        "heart": "qalb"
    },
    {
        " was literally opened by an angel, who removed a black ": null
    },
    {
        "clot": "thrombus"
    },
    {
        " that symbolized sin.          Muslim tradition preserves a number of stories involving dialogues between Jesus and Iblis, all of which are intended to demonstrate Jesuss virtue and Satans depravity. ": null
    },
    {
        "Ahmad ibn Hanbal": "ahmad ibn hanbal"
    },
    {
        " records an Islamic retelling of Jesuss temptation by Satan in the desert from the Synoptic Gospels. Ahmad quotes Jesus as saying, The greatest sin is love of the world. Women are the ropes of Satan. Wine is the key to every evil.  ": null
    },
    {
        "Abu Uthman al-Jahiz": "al-jahiz"
    },
    {
        " credits Jesus with saying, The world is Satans farm, and its people are his plowmen.  ": null
    },
    {
        "Al-Ghazali": "al-ghazali"
    },
    {
        " tells an anecdote about how Jesus went out one day and saw Satan carrying ashes and honey; when he asked what they were for, Satan replied, The honey I put on the lips of backbiters so that they achieve their aim. The ashes I put on the faces of orphans, so that people come to dislike them.  The thirteenth-century scholar ": null
    },
    {
        "Sibt ibn al-Jawzi": "sibt ibn al-jawzi"
    },
    {
        " states that, when Jesus asked him what truly broke his back, Satan replied, The neighing of horses in the cause of ": null
    },
    {
        "Allah": "allah"
    },
    {
        ".      According to ": null
    },
    {
        "Sufi": "sufism"
    },
    {
        " mysticism, Iblis refused to bow to Adam because he was fully devoted to God alone and refused to bow to anyone else. For this reason, Sufi masters regard Satan and Muhammad as the two most perfect monotheists. Sufis reject the concept of ": null
    },
    {
        "dualism": "dualistic cosmology"
    },
    {
        " and instead believe in the ": null
    },
    {
        "unity of existence": "unity of opposites"
    },
    {
        ". In the same way that Muhammad was the instrument of Gods mercy, Sufis regard Satan as the instrument of Gods wrath.     Muslims believe that Satan is also the cause of deceptions originating from the mind and desires for evil. He is regarded as a cosmic force for separation, despair and spiritual envelopment. Muslims do distinguish between the satanic temptations and the murmurings of the bodily lower self . The lower self commands the person to do a specific task or to fulfill a specific desire; whereas the inspirations of Satan tempt the person to do evil in general and, after a person successfully resists his first suggestion, Satan returns with new ones. Michael Anthony Sells. Early Islamic Mysticism: Sufi, Qurʼan, Miraj, Poetic and Theological Writings. Paulist Press, 42 . page 42 If a Muslim feels that Satan is inciting him to sin, he is advised to seek refuge with God by reciting: In the name of Allah, I seek refuge in you, from Satan the outcast. Muslims are also obliged to seek refuge before reciting the Quran. Patrick Sookhdeo Understanding Islamic Theology BookBaby 42        In the ": null
    },
    {
        "Baháí Faith": "baháí faith"
    },
    {
        ", Satan is not regarded as an independent evil power as he is in some faiths, but signifies the lower nature of humans. ": null
    },
    {
        "Abdul-Bahá": "abdul-bahá"
    },
    {
        " explains: This lower nature in man is symbolized as Satan — the evil ego within us, not an evil personality outside.  All other evil spirits described in various faith traditions—such as ": null
    },
    {
        "fallen angel": "fallen angel"
    },
    {
        "s, demons, and jinns—are also metaphors for the base character traits a human being may acquire and manifest when he turns away from God. Actions, that are described as satanic in some Baháí writings, denote humans deeds caused by selfish desires. Peter Smith An Introduction to the Bahai Faith Cambridge University Press 42  page 42                 Theistic Satanism, commonly referred to as devil worship ,  views Satan as a ": null
    },
    {
        "deity": "deity"
    },
    {
        ", whom individuals may supplicate to.  Satanism and Demonology, by Lionel & Patricia Fanthorpe, ": null
    },
    {
        "Dundurn Press": "dundurn press"
    },
    {
        ", 42 Mar 42  It consists of loosely affiliated or independent groups and cabals, which all agree that Satan is a real entity.        Atheistic Satanism, as practiced by ": null
    },
    {
        "the Satanic Temple": "the satanic temple"
    },
    {
        " and by followers of ": null
    },
    {
        "LaVeyan Satanism": "laveyan satanism"
    },
    {
        ", holds that Satan does not exist as a literal anthropomorphic entity, but rather as a ": null
    },
    {
        "symbol": "symbol"
    },
    {
        " of a ": null
    },
    {
        "cosmos": "cosmos"
    },
    {
        " which Satanists perceive to be permeated and motivated by a force that has been given many names by humans over the course of time. In this religion, Satan is not viewed or depicted as a hubristic, irrational, and fraudulent creature, but rather is revered with ": null
    },
    {
        "Prometheus": "prometheus"
    },
    {
        "-like attributes, symbolizing liberty and individual empowerment. To adherents, he also serves as a conceptual framework and an external metaphorical projection of the Satanists highest personal potential.     Contemporary religious Satanism: a critical anthology, page 42 Jesper Aagaard Petersen, 42 In his essay Satanism: The Feared Religion , the current High Priest of the Church of Satan, ": null
    },
    {
        "Peter H. Gilmore": "peter h. gilmore"
    },
    {
        ", further expounds that ...Satan is a symbol of Man living as his prideful, carnal nature dictates. The reality behind Satan is simply the dark evolutionary force of ": null
    },
    {
        "entropy": "entropy"
    },
    {
        " that permeates all of nature and provides the drive for survival and propagation inherent in all living things. Satan is not a conscious entity to be worshiped, rather a reservoir of power inside each human to be tapped at will .      LaVeyan Satanists embrace the original etymological meaning of the word Satan . According to Peter H. Gilmore, The Church of Satan has chosen Satan as its primary symbol because in Hebrew it means adversary, opposer, one to accuse or question. We see ourselves as being these Satans; the adversaries, opposers and accusers of all spiritual belief systems that would try to hamper enjoyment of our life as a human being.      Post-LaVeyan Satanists, like the adherents of ": null
    },
    {
        "The Satanic Temple": "the satanic temple"
    },
    {
        ", argue that the human animal has a natural altruistic and communal tendency, and frame Satan as a figure of struggle against injustice and activism. They also believe in bodily autonomy, that personal beliefs should conform to science and inspire nobility, and that people should atone for their mistakes.           The main deity in the tentatively ": null
    },
    {
        "Indo-European": "proto-indo-european religion"
    },
    {
        " pantheon of the ": null
    },
    {
        "Yazidis": "yazidis"
    },
    {
        ", ": null
    },
    {
        "Melek Taus": "melek taus"
    },
    {
        ", is similar to the devil in Christian and Islamic traditions, as he refused to bow down before humanity.  Therefore, ": null
    },
    {
        "Christians": "christians"
    },
    {
        " and ": null
    },
    {
        "Muslim": "muslim"
    },
    {
        "s often consider Melek Taus to be Satan. Drower, E.S. The Peacock Angel. Being Some Account of Votaries of a Secret Cult and Their Sanctuaries. London: John Murray, 42   However, rather than being Satanic, Yazidism can be understood as a remnant of a pre-Islamic ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        "ern Indo-European religion, and/or a ": null
    },
    {
        "ghulat": "ghulat"
    },
    {
        " Sufi": "sufism"
    },
    {
        " movement founded by ": null
    },
    {
        "Shaykh Adi": "sheikh adi ibn musafir"
    },
    {
        ". In fact, there is no entity in Yazidism which represents evil in opposition to God; such ": null
    },
    {
        "dualism": "dualistic cosmology"
    },
    {
        " is rejected by Yazidis. Birgül Açikyildiz The Yezidis: The History of a Community, Culture and Religion I.B.Tauris 42  page 42     In the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ", the ": null
    },
    {
        "Cathars": "catharism"
    },
    {
        ", practitioners of a ": null
    },
    {
        "dualistic": "dualistic cosmology"
    },
    {
        " religion, were accused of worshipping Satan by the ": null
    },
    {
        "Catholic Church": "catholic church"
    },
    {
        ". ": null
    },
    {
        "Pope Gregory IX": "pope gregory ix"
    },
    {
        " stated in his work  Vox in Rama  that the Cathars believed that God had erred in casting ": null
    },
    {
        "Lucifer": "lucifer"
    },
    {
        " out of heaven and that Lucifer would return to reward his faithful. On the other hand, according to Catharism, the ": null
    },
    {
        "creator-god": "creator deity"
    },
    {
        " of the material world worshipped by the Catholic Church is actually Satan. James Wasserman The Templars and the Assassins: The Militia of Heaven Simon and Schuster 42  page     ": null
    },
    {
        "Wicca": "wicca"
    },
    {
        " is a modern, ": null
    },
    {
        "syncretic": "syncretism"
    },
    {
        " Neopagan": "modern paganism"
    },
    {
        " religion, whose practitioners many Christians have incorrectly assumed to worship Satan. In actuality, Wiccans do not believe in the existence of Satan or any analogous figure and have repeatedly and emphatically rejected the notion that they venerate such an entity. The cult of the skeletal figure of ": null
    },
    {
        "Santa Muerte": "santa muerte"
    },
    {
        ", which has grown exponentially in Mexico,   has been denounced by the Catholic Church as Devil-worship.  However, devotees of Santa Muerte view her as an ": null
    },
    {
        "angel of death": "death"
    },
    {
        " created by God,  and many of them identify as Catholic.      Much modern folklore about Satanism does not originate from the actual beliefs or practices of theistic or atheistic Satanists, but rather from a mixture of medieval Christian folk beliefs, political or sociological conspiracy theories, and contemporary ": null
    },
    {
        "urban legend": "urban legend"
    },
    {
        "s. Cinema of the Occult: New Age, Satanism, Wicca, and Spiritualism in Film, Carrol Lee Fry, Associated University Presse, 42  Encyclopedia of Urban Legends, Updated and Expanded Edition, by Jan Harold Brunvand, ABC-CLIO, 42 Jul 42  Raising the Devil: Satanism, New Religions, and the Media, by Bill Ellis, University Press of Kentucky In discussing myths about groups accused of Satanism, ...such myths are already pervasive in Western culture , and the development of the modern Satanic Scare would be impossible to explain without showing how these myths helped organize concerns and beliefs . Accusations of Satanism are traced from the witch hunts , to the Illuminati , to the Satanic Ritual Abuse panic in the 42s, with a distinction made between what modern Satanists believe and what is believed about Satanists. An example is the Satanic ritual abuse scare of the 42s — beginning with the memoir ": null
    },
    {
        "Michelle Remembers": "michelle remembers"
    }
]