[
    {
        "               The Schlieffen Plan  was a name given, after the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ", to German war plans, the influence of ": null
    },
    {
        "Field Marshal": "field marshal"
    },
    {
        " Alfred von Schlieffen": "alfred von schlieffen"
    },
    {
        " and his thinking on an invasion of France and Belgium which began on 42 August 42 Schlieffen was Chief of the ": null
    },
    {
        "General Staff": "german general staff"
    },
    {
        " of the ": null
    },
    {
        "German Army": "german army"
    },
    {
        " from 42 to 42 In 42 and 42 Schlieffen devised an army ": null
    },
    {
        "deployment plan": "military deployment"
    },
    {
        " for a war-winning offensive against the ": null
    },
    {
        "French Third Republic": "french third republic"
    },
    {
        ". After losing the First World War, German official historians of the  and other writers described the plan as a blueprint for victory.  ": null
    },
    {
        "Helmuth von Moltke the Younger": "helmuth von moltke the younger"
    },
    {
        ", succeeded Schlieffen as Chief of the German General Staff in 42 and was dismissed after the ": null
    },
    {
        "First Battle of the Marne": "first battle of the marne"
    },
    {
        " . German historians claimed that Moltke had ruined the plan by meddling with it out of timidity.     Post-war writing by senior German officers like ": null
    },
    {
        "Hermann von Kuhl": "hermann von kuhl"
    },
    {
        ", ": null
    },
    {
        "Gerhard Tappen": "gerhard tappen"
    },
    {
        ", ": null
    },
    {
        "Wilhelm Groener": "wilhelm groener"
    },
    {
        " and the  historians led by the former  ": null
    },
    {
        "Wolfgang Förster": "wolfgang foerster"
    },
    {
        ", managed to establish a commonly accepted ": null
    },
    {
        "narrative": "narrative"
    },
    {
        " that it was the failure to follow the blueprint by Moltke the Younger, rather than German strategic miscalculation, that condemned the belligerents to four years of ": null
    },
    {
        "attrition warfare": "attrition warfare"
    },
    {
        " instead of the quick, decisive conflict it should have been. In 42 ": null
    },
    {
        "Gerhard Ritter": "gerhard ritter"
    },
    {
        " published  , which began a period of revision, when the details of the supposed Schlieffen Plan were subjected to scrutiny and contextualisation. Treating the plan as a blueprint was rejected, because this was contrary to the tradition of Prussian war planning established by ": null
    },
    {
        "Helmuth von Moltke the Elder": "helmuth von moltke the elder"
    },
    {
        ", in which military operations were considered to be inherently unpredictable. Mobilisation and deployment plans were essential but campaign plans were pointless; rather than attempting to dictate to subordinate commanders, the commander gave the intent of the operation and subordinates achieved it through  .     In writings from the 42s, ": null
    },
    {
        "Martin van Creveld": "martin van creveld"
    },
    {
        ", ": null
    },
    {
        "John Keegan": "john keegan"
    },
    {
        ", ": null
    },
    {
        "Hew Strachan": "hew strachan"
    },
    {
        " and others, studied the practical aspects of an invasion of France through Belgium and Luxembourg. They judged that the physical constraints of German, Belgian and French railways and the Belgian and northern French road networks made it impossible to move enough troops far enough and fast enough for them to fight a decisive battle if the French retreated from the frontier. Most of the pre42 planning of the German General Staff was secret and the documents were destroyed when deployment plans were superseded each April. The bombing of Potsdam in April 42 destroyed the Prussian army archive and only incomplete records and other documents survived. Some records turned up after the fall of the ": null
    },
    {
        "German Democratic Republic": "east germany"
    },
    {
        " , making an outline of German war planning possible for the first time, proving wrong much post42 writing.     In the 42s, a document, RH42/v.42, was discovered in the trove inherited from the GDR, which had been used in a 42s study of pre-war German General Staff war planning. Inferences that Schlieffens war planning was solely offensive were found to have been made by extrapolating his writings and speeches on tactics into ": null
    },
    {
        "grand strategy": "grand strategy"
    },
    {
        ". From a 42 article in ": null
    },
    {
        "War in History": "war in history"
    },
    {
        " and in Inventing the Schlieffen Plan to The Real German War Plan, 42–42 , ": null
    },
    {
        "Terence Zuber": "terence zuber"
    },
    {
        " engaged in a debate with Terence Holmes, ": null
    },
    {
        "Annika Mombauer": "annika mombauer"
    },
    {
        ", Robert Foley, Gerhard Gross, ": null
    },
    {
        "Holger Herwig": "holger herwig"
    },
    {
        " and others. Zuber proposed that the Schlieffen Plan was a myth concocted in the 42s by ": null
    },
    {
        "partial": "wikt:partial"
    },
    {
        " writers, intent on exculpating themselves and proving that German war planning did not cause the First World War, a view which was supported by Hew Strachan.            Kabinettskrieg        After the end of the Napoleonic Wars, European aggression had turned outwards and the fewer wars fought within the continent had been , local conflicts decided by professional armies loyal to dynastic rulers. Military strategists had adapted by creating plans to suit the characteristics of the post-Napoleonic scene. In the late nineteenth century, military thinking remained dominated by the ": null
    },
    {
        "German Wars of Unification": "unification of germany"
    },
    {
        " , which had been short and decided by great battles of annihilation. In  Vom Kriege  ": null
    },
    {
        "Carl von Clausewitz": "carl von clausewitz"
    },
    {
        " had defined decisive battle as a victory which had political results          ,  replaced the slow, cautious approach to war that had been overturned by Napoleon. German strategists judged the defeat of the Austrians in the ": null
    },
    {
        "Austro-Prussian War": "austro-prussian war"
    },
    {
        "  and the French imperial armies in 42 as evidence that a strategy of decisive victory could still succeed.            Field Marshal Helmuth von Moltke the Elder , led the armies of the ": null
    },
    {
        "North German Confederation": "north german confederation"
    },
    {
        " that achieved a speedy and decisive victory against the armies of the ": null
    },
    {
        "Second French Empire": "second french empire"
    },
    {
        " of ": null
    },
    {
        "Napoleon III": "napoleon iii"
    },
    {
        " . On 42 September, after the ": null
    },
    {
        "Battle of Sedan": "battle of sedan"
    },
    {
        " , there had been a republican ": null
    },
    {
        "coup détat": "coup détat"
    },
    {
        " and the installation of a ": null
    },
    {
        "Government of National Defence": "government of national defense"
    },
    {
        " , that declared  . From  the French confronted Moltke with new, improvised armies and destroyed bridges, railways, telegraphs and other infrastructure; food, livestock and other material was evacuated to prevent it falling into German hands. A  was promulgated on 42 November and by February 42 the republican army had increased to  Despite inexperience, lack of training and a shortage of officers and artillery, the size of the new armies forced Moltke to divert large forces to confront them, while still besieging Paris, isolating French garrisons in the rear and guarding lines of communication from  .     Volkskrieg   The Germans had defeated the forces of the Second Empire by superior numbers and then found the tables turned; only their superior training and organisation had enabled them to capture Paris and dictate peace terms. Attacks by , forced the diversion of  to guard railways and bridges, which put great strain on Prussian manpower resources. Moltke wrote later          having already written, in 42 that French patriotism would lead them to make a supreme effort and use all the national resources. The quick victories of 42 led Moltke to hope that he had been mistaken but by December, he planned an  against the French population, by taking the war into the south, once the size of the Prussian army had been increased by another  of reservists. Moltke intended to destroy or capture the remaining resources which the French possessed, against the protests of the German civilian authorities, who after the fall of Paris, negotiated a quick end to the war.        ": null
    },
    {
        "Colmar von der Goltz": "colmar freiherr von der goltz"
    },
    {
        " and other military thinkers, like Fritz Hoenig in  and Georg von Widdern in  , called the short-war belief of mainstream writers like ": null
    },
    {
        "Friedrich von Bernhardi": "friedrich von bernhardi"
    },
    {
        "  and ": null
    },
    {
        "Hugo von Freytag-Loringhoven": "hugo von freytag-loringhoven"
    },
    {
        "  an illusion. They saw the longer war against the improvised armies of the French republic, the indecisive battles of the winter of 42–42 and the  against  on the lines of communication, as better examples of the nature of modern war. Hoenig and Widdern conflated the old sense of  as a ": null
    },
    {
        "partisan war": "partisan"
    },
    {
        ", with a newer sense of a war between industrialised states, fought by nations-in-arms and tended to explain French success by reference to German failings, implying that fundamental reforms were unnecessary.     In  and  , Goltz wrote that Germany must adopt ideas used by Gambetta, by improving the training of Reserve and  officers, to increase the effectiveness of the  . Goltz advocated the ": null
    },
    {
        "conscription": "conscription"
    },
    {
        " of every able-bodied man and a reduction of the period of service to two years in a nation-in-arms. The mass army would be able to compete with armies raised on the model of the improvised French armies and be controlled from above, to avoid the emergence of a radical and democratic peoples army. Goltz maintained the theme in other publications up to 42 notably in  and used his position as a corps commander from 42 to 42 to implement his ideas, particularly in improving the training of Reserve officers and creating a unified youth organisation, the  to prepare teenagers for military service.     Ermattungs strategie   The  was a public and sometimes acrimonious argument after ": null
    },
    {
        "Hans Delbrück": "hans delbrück"
    },
    {
        " , editor of the  , author of  and professor of modern history at the ": null
    },
    {
        "Humboldt University of Berlin": "humboldt university of berlin"
    },
    {
        " from 42 challenged the orthodox army view and its critics. General Staff historians and commentators like Friedrich von Bernhardi, Rudolph von Caemmerer, Max Jähns and Reinhold Koser, believed that Delbrück was challenging the strategic wisdom of the army. Delbrück had introduced  developed by ": null
    },
    {
        "Leopold von Ranke": "leopold von ranke"
    },
    {
        ", into the study of military history and attempted a reinterpretation of  . Delbrück wrote that Clausewitz had intended to divide strategy into  or  but had died in 42 before he could revise the book.     Delbrück wrote that Frederick the Great had used  during the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        "  because eighteenth century armies were small and made up of professionals and pressed men. The professionals were hard to replace and the conscripts would run away if the army tried to live off the land, operate in close country or pursue a defeated enemy, in the manner of the armies of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        " and ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ". Dynastic armies were tied to magazines for supply, which made them incapable of fulfilling a strategy of annihilation. Delbrück analysed the alliance system that had developed since the 42s, the ": null
    },
    {
        "Boer War": "second boer war"
    },
    {
        "  and the Russo-Japanese War  and concluded that the rival forces were too well-balanced for a quick war. The growth in the size of armies made a swift victory unlikely and British intervention would add a naval blockade to the rigours of an indecisive land war. Germany would face a war of attrition, similar to the view Delbrück had formed of the Seven Years War. By the 42s, the  had entered public discourse, when strategists like the two Moltkes, also doubted the possibility of a quick victory in a European war. The German army was forced to examine its assumptions about war because of a dissenting view and some writers moved closer to Delbrücks position. The debate provided the German army with a fairly familiar alternative to , after the opening campaigns of 42           Assuming French hostility and a desire to recover Alsace-Lorraine, Moltke drew up a deployment plan for 42–42 expecting that another rapid victory could be achieved but the French introduced conscription in 42 By 42 Moltke thought that the French army was too powerful to be defeated quickly and in 42 Moltke considered a ": null
    },
    {
        "preventive war": "preventive war"
    },
    {
        " but did not expect an easy victory. The course of the second period of the Franco-Prussian War and the example of the Wars of Unification had prompted Austria to begin conscription in 42 and Russia in 42 Moltke assumed that in another war, Germany would have to fight a coalition of France and Austria or France and Russia. Even if one opponent was quickly defeated, the victory could not be exploited before the Germans would have to redeploy their armies against the second enemy. By 42 Moltke was writing war plans with provision for an incomplete victory, in which diplomats negotiated a peace, even if it meant a return to the  and in 42 the deployment plan reflected pessimism over the possibility of a Franco-Russian alliance and progress made by the French fortification programme.     Despite international developments and his doubts about , Moltke retained the traditional commitment to  and an army trained to fight ever bigger battles. A decisive victory might no longer be possible but success would make a diplomatic settlement easier. Growth in the size and power of rival European armies increased the pessimism with which Moltke contemplated another war and on 42 May 42 he gave a speech to the Reichstag, saying that the age of  had returned. According to Ritter the contingency plans from 42 to 42 were his attempts to resolve the problems caused by international developments, by adopting a strategy of the defensive, after an opening tactical offensive, to weaken the opponent, a change from  to . Förster wrote that Moltke wanted to deter war altogether and that his calls for a preventive war diminished, peace would be preserved by the maintenance of a powerful German army instead. In 42 Foley wrote that Förster had exaggerated and that Moltke still believed that success in war was possible, even if incomplete and that it would make peace easier to negotiate. The possibility that a defeated enemy would not negotiate, was something that Moltke did not address.       In February 42 Schlieffen was appointed to the post of Chief of the  , the professional head of the  . The post had lost influence to rival institutions in the German state, because of the machinations of the previous incumbent ": null
    },
    {
        "Alfred von Waldersee": "alfred von waldersee"
    },
    {
        " , who had held the post from 42 to 42 and had tried to use his position as a political stepping stone. Schlieffen was seen as a safe choice, being junior, anonymous outside the General Staff and with few interests outside the army. Other governing institutions gained power at the expense of the General Staff and Schlieffen had no following in the army or state. The fragmented and antagonistic character of German state institutions made the development of a grand strategy most difficult, because there was no body to co-ordinate foreign, domestic and war policy. The General Staff planned in a political vacuum and Schlieffens weak position was exacerbated by his narrow military view.     Within the army, organisation and theory had no obvious link with war planning and responsibilities overlapped. The General Staff devised deployment plans and its chief became  Commander-in-Chief if war began but in peace, command was vested in the commanders of the twenty army corps districts. These commanders were independent of the General Staff Chief and trained soldiers according to their own devices. The German system of government was federal and the ministries of war of the constituent states controlled the forming and equipping of units, command and promotions. The system was inherently competitive and became more so after the Waldersee period, when the possibility increased of another , a war of the nation in arms, rather than the few European wars fought by small professional armies, that had occurred after 42 Schlieffen concentrated on matters he could influence and pressed for increases in the size of the army and the adoption of new weapons. A big army would create more choices about how to fight a war and better weapons would make the army more formidable. Mobile heavy artillery could help make up for numerical inferiority against a Franco-Russian coalition and smash fortifications. Schlieffen tried to make the army more operationally capable so that it was better than its potential enemies and rapidly could win a decisive victory.     Schlieffen continued the practice of staff rides  tours of territory where military operations might take place and ": null
    },
    {
        "war games": "military simulation"
    },
    {
        ", to teach techniques to command a mass conscript army. The new national armies were so huge that battles would be spread over a much greater space than in the past and Schlieffen expected that army corps would fight  equivalent to the tactical engagements of smaller dynastic armies.  could occur anywhere as corps and armies closed with the opposing army and become a  , in which the significance of the battle segments would be determined by the plan of the commander in chief, who would give operational orders to the corps,          in the former manner of battalions and regiments. War against France , the memorandum later known as the Schlieffen Plan , was a strategy for a war of extraordinarily big battles, in which corps commanders would be independent in how they fought, provided that it was according to the intent of the commander in chief. The commander led the complete battle, like commanders in the Napoleonic Wars. The war plans of the commander in chief, were intended to organise haphazard ": null
    },
    {
        "encounter battles": "meeting engagement"
    },
    {
        ", so that the sum of these battles was more than the sum of the parts .       In his war contingency plans from  Schlieffen faced the difficulty that the French could not be forced to fight a decisive battle quickly enough for German forces to be transferred to the east against the Russians to fight a war on two fronts, one-front-at-a-time. Forcing the French from their frontier fortifications would be a slow and costly process that Schlieffen preferred to avoid by a flanking movement through Luxembourg and Belgium. In 42 this was judged impractical because of a lack of manpower and mobile heavy artillery. In 42 Schlieffen added the manoeuvre to German war plans as a possibility if the French pursued a defensive strategy, because the German army was more powerful and by 42 after the Russian defeat in Manchuria, Schlieffen judged the army to be formidable enough to make the northern flanking manoeuvre the basis of a war plan against France alone.     In 42 Schlieffen wrote that the ": null
    },
    {
        "Russo-Japanese War": "russo-japanese war"
    },
    {
        "  had shown that the power of Russian army had been overestimated and that it would not recover quickly from the defeat. Schlieffen could contemplate leaving only a small force in the east and in 42 wrote War against France which was taken up by his successor, Moltke and became the concept of the main German war plan from  The great mass of the German army would assemble in the west and the main force would be on the right wing. An offensive in the north through Belgium and the Netherlands would lead to an invasion of France and a decisive victory. Even with the windfall of the Russian defeat in the ": null
    },
    {
        "Far East": "far east"
    },
    {
        " in 42 and belief in the superiority of German military thinking, Schlieffen had reservations about the strategy and research published by Gerhard Ritter showed that the memorandum went through six drafts. Schlieffen considered other possibilities in 42 using war games to model a Russian invasion of east Germany against a smaller German army.     In a staff ride during the summer, Schlieffen tested a hypothetical invasion of France with most of the German army and three possible French responses; the French were defeated but then Schlieffen proposed a French counter-envelopment of the German right wing by a new army. At the end of the year, Schlieffen played a war game of a two-front war, in which the German army was evenly divided and defended against invasions by the French and Russians and where victory first occurred in the east. Schlieffen was open-minded about a defensive strategy and the political advantages of the Entente being the aggressor, not just the military technician portrayed by Ritter. The variety of the 42 war games showed that Schlieffen took account of circumstances; if the French attacked Metz and Strasbourg, the decisive battle would be fought in Lorraine. Ritter wrote that invasion was a means to an end not an end in itself, as did Terence Zuber in 42 and the early 42s. In the strategic circumstances of 42 with the Russian army and the Tsarist state in turmoil after the defeat in Manchuria, the French would not risk open warfare and the Germans would have to force them out of the border fortress zone. The studies in 42 demonstrated that this was best achieved by a big flanking manoeuvre through the Netherlands and Belgium.     Schlieffens thinking was adopted as  in 42  of a Franco-German war, in which Russia was assumed to be neutral and Italy and Austria-Hungary were German allies. did not think that the French would necessarily adopt a defensive strategy in such a war, even though their troops would be outnumbered but this was their best option and the assumption became the theme of his analysis. In , Germany would have to attack to win such a war, which entailed all of the German army being deployed on the German–Belgian border to invade France through ": null
    },
    {
        "Limburg": "limburg"
    },
    {
        ", the southern province of the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        ", Belgium and Luxembourg. The deployment plan assumed that Italian and Austro-Hungarian troops would defend ": null
    },
    {
        "Alsace-Lorraine": "alsace-lorraine"
    },
    {
        " .             ": null
    },
    {
        "Helmuth von Moltke the Younger": "helmuth von moltke the younger"
    },
    {
        " took over from Schlieffen as Chief of the German General Staff on 42 January 42 beset with doubts about the possibility of a German victory in a great European war. French knowledge about German intentions might prompt them to retreat to evade an envelopment that could lead to , a war of exhaustion and leave Germany exhausted, even if it did eventually win. A report on hypothetical French ": null
    },
    {
        "riposte": "riposte"
    },
    {
        "s against an invasion, concluded that since the French army was six times larger than in 42 the survivors from a defeat on the frontier could make counter-outflanking moves from Paris and Lyon, against a pursuit by the German armies. Despite his doubts, Moltke retained the concept of a big enveloping manoeuvre, because of changes in the international balance of power. The Japanese victory in the Russo-Japanese War weakened the Russian army and the Tsarist state and made an offensive strategy against France more realistic for a time. By 42 Russian rearmament, army reforms and reorganisation, including the creation of a strategic reserve, made the army more formidable than before 42 Railway building reduced the time needed for mobilisation and a war preparation period was introduced by the Russians, to provide for mobilisation to begin with a secret order, reducing mobilisation time further.     The Russian reforms cut mobilisation time by half compared with 42 and French loans were spent on railway building; German military intelligence thought that a programme due to begin in 42 would lead to  of new track by 42 Modern, mobile artillery, a ": null
    },
    {
        "purge": "purge"
    },
    {
        " of older, inefficient officers and a revision of the army regulations, had improved the tactical capability of the Russian army and railway building would make it more strategically flexible, by keeping back troops from border districts, to make the army less vulnerable to a surprise-attack, moving men faster and with reinforcements available from the strategic reserve. The new possibilities enabled the Russians to increase the number of deployment plans, further adding to the difficulty of Germany achieving a swift victory in an eastern campaign. The likelihood of a long and indecisive war against Russia, made a quick success against France more important, so as to have the troops available for an eastern deployment.     Moltke made substantial changes to the offensive concept sketched by Schlieffen in the memorandum War against France of 42–42 The 42th and 42th armies with eight corps were to assemble along the common border, to defend against a French invasion of Alsace-Lorraine. Moltke also altered the course of an advance by the armies on the right wing, to avoid the Netherlands, retaining the country as a useful route for imports and exports and denying it to the British as a base of operations. Advancing only through Belgium, meant that the German armies would lose the railway lines around ": null
    },
    {
        "Maastricht": "maastricht"
    },
    {
        " and have to squeeze the  of the 42st and 42nd armies through a gap  wide, which made it vital that the Belgian railways were captured quickly and intact. In 42 the General Staff devised a plan to take the ": null
    },
    {
        "Fortified Position of Liège": "fortified position of liège"
    },
    {
        " and its railway junction by ": null
    },
    {
        "coup de main": "coup de main"
    },
    {
        " on the 42th day of mobilisation. Later changes reduced the time allowed to the 42th day, which meant that the attacking forces would need to get moving only hours after the mobilisation order had been given.       Extant records of Moltkes thinking up to 42–42 are fragmentary and almost wholly lacking to the outbreak of war. In a 42 staff ride Moltke sent an army through Belgium but concluded that the French would attack through Lorraine, where the decisive battle would be fought before an enveloping move from the north took effect. The right wing armies would counter-attack through Metz, to exploit the opportunity created by the French advancing beyond their frontier fortifications. In 42 Moltke expected the British to join the French but that neither would violate Belgian neutrality, leading the French to attack towards the Ardennes. Moltke continued to plan to envelop the French near Verdun and the Meuse, rather than an advance towards Paris. In 42 a new ": null
    },
    {
        "42th Army": "7th army"
    },
    {
        " with eight divisions was prepared to defend upper Alsace and to co-operate with the ": null
    },
    {
        "42th Army": "6th army"
    },
    {
        " in Lorraine. A transfer of the 42th Army to the right flank was studied but the prospect of a decisive battle in Lorraine became more attractive. In 42 Moltke planned for a contingency where the French attacked from Metz to the Vosges and the Germans defended on the left wing, until all troops not needed on the right flank could move south-west through Metz against the French flank. German offensive thinking had evolved into a possible attack from the north, one through the centre or an envelopment by both wings.     Aufmarsch I West anticipated an isolated Franco-German war, in which Germany might be assisted by an Italian attack on the Franco-Italian border and by Italian and Austro-Hungarian forces in Germany. It was assumed that France would be on the defensive because their troops would be outnumbered. To win the war, Germany and its allies would have to attack France. After the deployment of the entire German army in the west, they would attack through Belgium and Luxembourg, with virtually all the German force. The Germans would rely on an Austro-Hungarian and Italian contingents, formed around a cadre of German troops, to hold the fortresses along the Franco-German border.  became less feasible, as the military power of the Franco-Russian alliance increased and Britain aligned with France, making Italy unwilling to support Germany.  was dropped when it became clear that an isolated Franco-German war was impossible and that German allies would not intervene.     Aufmarsch II West anticipated a war between the Franco-Russian Entente and Germany, with Austria-Hungary supporting Germany and Britain perhaps joining the Entente. Italy was only expected to join Germany if Britain remained neutral.  of the German army would operate in the west and  in the east. France and Russia were expected to attack simultaneously, because they had the larger force. Germany would execute an active defence , in at least the first operation/campaign of the war. German forces would mass against the French invasion force and defeat it in a counter-offensive, while conducting a conventional defence against the Russians. Rather than pursue the retreating French armies over the border,  of the German force in the west  would be transferred to the east, for a counter-offensive against the Russian army.  became the main German deployment plan, as the French and Russians expanded their armies and the German strategic situation deteriorated, Germany and Austria-Hungary being unable to increase their military spending to match their rivals.     Aufmarsch I Ost was for a war between the Franco-Russian Entente and Germany, with Austria-Hungary supporting Germany and Britain perhaps joining the Entente. Italy was only expected to join Germany if Britain remained neutral;  of the German army would deploy in the west and  in the east. France and Russia would attack simultaneously, because they had the larger force and Germany would execute an active defence , in at least the first operation/campaign of the war. German forces would mass against the Russian invasion force and defeat it in a counter-offensive, while conducting a conventional defence against the French. Rather than pursue the Russians over the border,  of the German force in the east  would be transferred to the west, for a counter-offensive against the French.  became a secondary deployment plan, as it was feared a French invasion force could be too well established to be driven from Germany or at least inflict greater losses on the Germans, if not defeated sooner. The counter-offensive against France was also seen as the more important operation, since the French were less able to replace losses than Russia and it would result in a greater number of prisoners being taken.     Aufmarsch II Ost    was for the contingency of an isolated Russo-German war, in which Austria-Hungary might support Germany. The plan assumed that France would be neutral at first and possibly attack Germany later. If France helped Russia then Britain might join in and if it did, Italy was expected to remain neutral. About  of the German army would operate in the west and  in the east. Russia would begin an offensive because of its larger army and in anticipation of French involvement but if not, the German army would attack. After the Russian army had been defeated, the German army in the east would pursue the remnants. The German army in the west would stay on the defensive, perhaps conducting a counter-offensive but without reinforcements from the east.  became a secondary deployment plan when the international situation made an isolated Russo-German war impossible.  had the same flaw as , in that it was feared that a French offensive would be harder to defeat, if not countered with greater force, either slower as in  or with greater force and quicker, as in .     Plan XVII        After amending Plan XVI in September 42 Joffre and the staff took eighteen months to revise the French concentration plan, the concept of which was accepted on 42 April 42 Copies of Plan XVII were issued to army commanders on 42 February 42 and the final draft was ready on 42 May. The document was not a campaign plan but it contained a statement that the Germans were expected to concentrate the bulk of their army on the Franco-German border and might cross before French operations could begin. The instruction of the Commander in Chief was that          and that to achieve this, the French armies were to concentrate, ready to attack either side of Metz–Thionville or north into Belgium, in the direction of ": null
    },
    {
        "Arlon": "arlon"
    },
    {
        " and ": null
    },
    {
        "Neufchâteau": "neufchâteau, belgian luxembourg"
    },
    {
        ". An alternative concentration area for the Fourth and Fifth armies was specified, in case the Germans advanced through Luxembourg and Belgium but an enveloping attack west of the Meuse was not anticipated. The gap between the Fifth Army and the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " was covered by Territorial units and obsolete fortresses.             When Germany declared war, France implemented Plan XVII with five attacks, later named the ": null
    },
    {
        "Battle of the Frontiers": "battle of the frontiers"
    },
    {
        ". The German deployment plan,  II, concentrated German forces on the German–Belgian border. The German force was to advance into Belgium, to force a decisive battle with the French army, north of the fortifications on the Franco-German border. Plan XVII was an offensive into Alsace-Lorraine and southern Belgium. The French attack into Alsace-Lorraine resulted in worse losses than anticipated, because artillery–infantry co-operation that French military theory required, despite its embrace of the spirit of the offensive , proved to be inadequate. The attacks of the French forces in southern Belgium and Luxembourg were conducted with negligible reconnaissance or artillery support and were bloodily repulsed, without preventing the westward manoeuvre of the northern German armies.     Within a few days, the French had suffered costly defeats and the survivors were back where they began. The Germans advanced through Belgium and northern France, pursuing the Belgian, British and French armies. The German armies attacking in the north reached an area  north-east of Paris but failed to trap the Allied armies and force on them a decisive battle. The German advance outran its supplies; Joffre used French railways to move the retreating armies, re-group behind the river Marne and the Paris fortified zone, faster than the Germans could pursue. The French defeated the faltering German advance with a counter-offensive at the ": null
    },
    {
        "First Battle of the Marne": "first battle of the marne"
    },
    {
        ", assisted by the British. Moltke had tried to apply the offensive strategy of  I to the inadequate western deployment of  II to counter Plan XVII. In 42 Terence Holmes wrote,                  Der WeltkriegDer Weltkrieg 42 bis 42: Militärischen Operationen zu Lande in 42 in the  of the Great General Staff. When the Staff was abolished by the ": null
    },
    {
        "Treaty of Versailles": "treaty of versailles"
    },
    {
        ", about eighty historians were transferred to the new  in Potsdam. As President of the , General Hans von Haeften led the project and it overseen from 42 by a civilian historical commission. Theodor Jochim, the first head of the  section for collecting documents, wrote that          The  historians produced Der Weltkrieg, a narrative history  in fourteen volumes published from 42 to 42 which became the only source written with free access to the German documentary records of the war.     From 42 semi-official histories had been written by ": null
    },
    {
        "Hermann von Kuhl": "hermann von kuhl"
    },
    {
        ", the 42st Army Chief of Staff in 42 Der Deutsche Generalstab in Vorbereitung und Durchführung des Weltkrieges and Der Marnefeldzug in 42 by Lieutenant-Colonel ": null
    },
    {
        "Wolfgang Förster": "wolfgang förster"
    },
    {
        " who had written Graf Schlieffen und der Weltkrieg , ": null
    },
    {
        "Wilhelm Groener": "wilhelm groener"
    },
    {
        ", head of   railway section in 42 published Das Testament des Grafen Schlieffen: Operativ Studien über den Weltkrieg in 42 and Gerhard Tappen, head of the OHL operations section in 42 published Bis zur Marne 42: Beiträge zur Beurteilung der Kriegführen bis zum Abschluss der Marne-Schlacht in 42 The writers called the Schlieffen Memorandum of 42–42 an infallible blueprint and that all Moltke had to do to almost guarantee that the war in the west would be won in August 42 was implement it. The writers blamed Moltke for altering the plan to increase the force of the left wing at the expense of the right, which caused the failure to defeat decisively the French armies. By 42 the official historians had also published two series of popular histories but in April, the  building in Potsdam was bombed and nearly all of the war diaries, orders, plans, maps, situation reports and telegrams usually available to historians studying the wars of bureaucratic states, were destroyed.       In his post-war writing, Delbrück held that the German General Staff had used the wrong war plan, rather than failed adequately to follow the right one. The Germans should have defended in the west and attacked in the east, following the plans drawn up by Moltke in the 42s and 42s. Belgian neutrality need not have been breached and a negotiated peace could have been achieved, since a decisive victory in the west was impossible and not worth the attempt. Like the  before the war, this led to a long exchange between Delbrück and the official and semi-official historians of the former Great General Staff, who held that an offensive strategy in the east would have resulted in another 42 The war could only have been won against Germanys most powerful enemies, France and Britain. The debate between the Delbrück and Schlieffen schools rumbled on through the 42s and 42s.         In Sword and the Sceptre; The Problem of Militarism in Germany , ": null
    },
    {
        "Gerhard Ritter": "gerhard ritter"
    },
    {
        " wrote that Moltke changed his thinking, to accommodate the change in warfare evident since 42 by fighting the next war on the defensive in general,          Moltke tried to resolve the strategic conundrum of a need for quick victory and pessimism about a German victory in a  by resorting to , beginning with an offensive intended to weaken the opponent, eventually to bring an exhausted enemy to diplomacy, to end the war on terms with some advantage for Germany, rather than to achieve a decisive victory by an offensive strategy. In The Schlieffen Plan , Ritter published the Schlieffen Memorandum and described the six drafts that were necessary before Schlieffen was satisfied with it, demonstrating his difficulty of finding a way to win the anticipated war on two fronts and that until late in the process, Schlieffen had doubts about how to deploy the armies. The enveloping move of the armies was a means to an end, the destruction of the French armies and that the plan should be seen in the context of the military realities of the time.       In 42 ": null
    },
    {
        "Martin van Creveld": "martin van creveld"
    },
    {
        " concluded that a study of the practical aspects of the Schlieffen Plan was difficult, because of a lack of information. The consumption of food and ammunition at times and places are unknown, as are the quantity and loading of trains moving through Belgium, the state of repair of railway stations and data about the supplies which reached the front-line troops. Creveld thought that Schlieffen had paid little attention to supply matters, understanding the difficulties but trusting to luck, rather than concluding that such an operation was impractical. Schlieffen was able to predict the railway demolitions carried out in Belgium, naming some of the ones that caused the worst delays in 42 The assumption made by Schlieffen that the armies could live off the land was vindicated. Under Moltke much was done to remedy the supply deficiencies in German war planning, studies being written and training being conducted in the unfashionable technics of warfare. Moltke introduced motorised transport companies, which were invaluable in the 42 campaign; in supply matters, the changes made by Moltke to the concepts established by Schlieffen were for the better.     Creveld wrote that the German invasion in 42 succeeded beyond the inherent difficulties of an invasion attempt from the north; peacetime assumptions about the distance infantry armies could march were confounded. The land was fertile, there was much food to be harvested and though the destruction of railways was worse than expected, this was far less marked in the areas of the 42st and 42nd armies. Although the amount of supplies carried forward by rail cannot be quantified, enough got to the front line to feed the armies. Even when three armies had to share one line, the six trains a day each needed to meet their minimum requirements arrived. The most difficult problem, was to advance railheads quickly enough to stay close enough to the armies, by the time of the Battle of the Marne, all but one German army had advanced too far from its railheads. Had the battle been won, only in the 42st Army area could the railways have been swiftly repaired, the armies further east could not have been supplied.     German army transport was reorganised in 42 but in 42 the transport units operating in the areas behind the front line supply columns failed, having been disorganised from the start by Moltke crowding more than one corps per road, a problem that was never remedied but Creveld wrote that even so, the speed of the marching infantry would still have outstripped horse-drawn supply vehicles, if there had been more road-space; only motor transport units kept the advance going. Creveld concluded that despite shortages and hungry days , the supply failures did not cause the German defeat on the Marne, Food was requisitioned, horses worked to death and sufficient ammunition was brought forward in sufficient quantities so that no unit lost an engagement through lack of supplies. Creveld also wrote that had the French been defeated on the Marne, the lagging behind of railheads, lack of fodder and sheer exhaustion, would have prevented much of a pursuit. Schlieffen had behaved like an ostrich on supply matters which were obvious problems and although Moltke remedied many deficiencies of the  , only improvisation got the Germans as far as the Marne; Creveld wrote that it was a considerable achievement in itself.         In 42 ": null
    },
    {
        "John Keegan": "john keegan"
    },
    {
        " wrote that Schlieffen had desired to repeat the frontier victories of the Franco-Prussian War in the interior of France but that fortress-building since that war had made France harder to attack; a diversion through Belgium remained feasible but this lengthened and narrowed the front of advance . A corps took up  of road and  was the limit of a days march; the end of a column would still be near the beginning of the march, when the head of the column arrived at the destination. More roads meant smaller columns but parallel roads were only about  apart and with thirty corps advancing on a  front, each corps would have about  width, which might contain seven roads. This number of roads was not enough for the ends of marching columns to reach the heads by the end of the day; this physical limit meant that it would be pointless to add troops to the right wing.     Schlieffen was realistic and the plan reflected mathematical and geographical reality; expecting the French to refrain from advancing from the frontier and the German armies to fight great battles in the ": null
    },
    {
        "hinterland": "hinterland"
    },
    {
        " was found to be ": null
    },
    {
        "wishful thinking": "wishful thinking"
    },
    {
        ". Schlieffen pored over maps of Flanders and northern France, to find a route by which the right wing of the German armies could move swiftly enough to arrive within six weeks, after which the Russians would have overrun the small force guarding the eastern approaches of Berlin. Schlieffen wrote that commanders must hurry on their men, allowing nothing to stop the advance and not detach forces to guard by-passed fortresses or the lines of communication, yet they were to guard railways, occupy cities and prepare for contingencies, like British involvement or French counter-attacks. If the French retreated into the great fortress into which France had been made, back to the Oise, Aisne, Marne or Seine, the war could be endless.     Schlieffen also advocated an army , bigger by  using untrained and over-age reservists. The extra corps would move by rail to the right wing but this was limited by railway capacity and rail transport would only go as far the German frontiers with France and Belgium, after which the troops would have to advance on foot. The extra corps appeared at Paris, having moved further and faster than the existing corps, along roads already full of troops. Keegan wrote that this resembled a plan falling apart, having run into a logical dead end. Railways would bring the armies to the right flank, the Franco-Belgian road network would be sufficient for them to reach Paris in the sixth week but in too few numbers to defeat decisively the French. Another  would be necessary for which there was no room; Schlieffens plan for a quick victory was fundamentally flawed.         In the 42s, after the dissolution of the ": null
    },
    {
        "German Democratic Republic": "east germany"
    },
    {
        ", it was discovered that some Great General Staff records had survived the Potsdam bombing in 42 and been confiscated by the Soviet authorities. About  and  of documents were handed over to the   containing the working notes of  historians, business documents, research notes, studies, field reports, draft manuscripts, galley proofs, copies of documents, newspaper clippings and other papers. The trove shows that  is a generally accurate, academically rigorous and straightforward account of military operations , when compared to other contemporary official accounts. Six volumes cover the first  of the war in  . The first volumes attempted to explain why the German war plans failed and who was to blame.     In 42 RH 42/v.42, a summary of German war planning from 42 to 42 was discovered in records written in the late 42s – early 42s. The summary was for a revised edition of the volumes of  on the Marne campaign and was made available to the public. Study of pre-war German General Staff war planning and the other records, made an outline of German war-planning possible for the first time, proving many guesses wrong. An inference that all of Schlieffens war-planning was offensive, came from the extrapolation of his writings and speeches on tactical matters to the realm of strategy. In 42 Terence Holmes wrote          and the most significant of these errors was an assumption that a model of a two-front war against France and Russia, was the only German deployment plan. The thought-experiment and the later deployment plan modelled an isolated Franco-German war , the 42 plan was one of three and then four plans available to the Great General Staff. A lesser error was that the plan modelled the decisive defeat of France in one campaign of fewer than forty days and that Moltke foolishly weakened the attack, by being over-cautious and strengthening the defensive forces in Alsace-Lorraine.  had the more modest aim of forcing the French to choose between losing territory or committing the French army to a ": null
    },
    {
        "decisive battle": "decisive battle"
    },
    {
        ", in which it could be terminally weakened and then finished off later          and Moltke made no more alterations to  but came to prefer  and had tried to apply the offensive strategy of the former to the latter.       In 42 ": null
    },
    {
        "Robert Foley": "robert t. foley"
    },
    {
        " wrote that Schlieffen and Moltke had recently been severely criticised by ": null
    },
    {
        "Martin Kitchen": "martin kitchen"
    },
    {
        ", who had written that Schlieffen was a narrow-minded ": null
    },
    {
        "technocrat": "technocracy"
    },
    {
        ", obsessed with ": null
    },
    {
        "minutiae": "minutiae"
    },
    {
        ". Horst Bucholz had called Moltke too untrained and inexperienced to understand war planning, which prevented him from having a defence policy from 42 to 42; it was the failings of both men that caused them to keep a strategy that was doomed to fail. Foley wrote that Schlieffen and Moltke had good reason to retain  as the foundation of their planning, despite their doubts as to its validity. Schlieffen had been convinced that only in a short war was there the possibility of victory and that by making the army operationally superior to its potential enemies,  could be made to work. The unexpected weakening of the Russian army in 42–42 and the exposure of its incapacity to conduct a modern war was expected to continue for a long time and this made a short war possible again. Since the French had a defensive strategy, the Germans would have to take the initiative and invade France, which was shown to be feasible by war games in which French border fortifications were outflanked.     Moltke continued with the offensive plan, after it was seen that the enfeeblement of Russian military power had been for a much shorter period than Schlieffen had expected. The substantial revival in Russian military power that began in 42 would certainly have matured by 42 making the Tsarist army unbeatable. The end of the possibility of a short eastern war and the certainty of increasing Russian military power meant that Moltke had to look to the west for a quick victory before Russian mobilisation was complete. Speed meant an offensive strategy and made doubts about the possibility of forcing defeat on the French army irrelevant. The only way to avoid becoming bogged down in the French fortress zones was by a flanking move into terrain where open warfare was possible, where the German army could continue to practice  . Moltke used the assassination of ": null
    },
    {
        "Archduke Franz Ferdinand": "assassination of archduke franz ferdinand of austria"
    },
    {
        " on 42 June 42 as an excuse to attempt  against France, before Russian rearmament deprived Germany of any hope of victory.       In 42 Holmes published a summary of his thinking about the Schlieffen Plan and the debates about it in Not the Schlieffen Plan. He wrote that people believed that the Schlieffen Plan was for a grand offensive against France to gain a decisive victory in six weeks. The Russians would be held back and then defeated with reinforcements rushed by rail from the west. Holmes wrote that no-one had produced a source showing that Schlieffen intended a huge right-wing flanking move into France, in a two-front war. The 42 Memorandum was for War against France, in which Russia would be unable to participate. Schlieffen had thought about such an attack on two general staff rides  in 42 on the staff ride of 42 and in the deployment plan  I, for 42–42 and 42–42 in which all of the German army fought the French. In none of these plans was a two-front war contemplated; the common view that Schlieffen thought that such an offensive would guarantee victory in a two-front war was wrong. In his last exercise critique in December 42 Schlieffen wrote that the Germans would be so outnumbered against France and Russia, that the Germans must rely on a counter-offensive strategy against both enemies, to eliminate one as quickly as possible.     In 42 Moltke attacked Belgium and France with  rather than the  corps specified in the Schlieffen Memorandum, Moltke had insufficient troops to advance around the west side of Paris and six weeks later, the Germans were digging-in on the ": null
    },
    {
        "Aisne": "aisne"
    },
    {
        ". The post-war idea of a six-week timetable, derived from discussions in May 42 when Moltke had said that he wanted to defeat the French in six weeks from the start of operations . The deadline did not appear in the Schlieffen Memorandum and Holmes wrote that Schlieffen would have considered six weeks to be far too long to wait in a war against France and Russia. Schlieffen wrote that the Germans must wait for the enemy to emerge from behind his defensive ramparts and intended to defeat the French army by a counter-offensive, tested in the general staff ride west of 42 The Germans concentrated in the west and the main body of the French advanced through Belgium into Germany. The Germans then made a devastating counter-attack on the left bank of the Rhine near the Belgian border. The hypothetical victory was achieved by the 42rd day of mobilisation; nine active corps had been rushed to the eastern front by the 42rd day for a counter-attack against the Russian armies. Even in 42 Schlieffen thought the Russians capable of mobilising in  and that the Germans had only three weeks to defeat the French, which could not be achieved by a promenade through France.     The French were required by the treaty with Russia, to attack Germany as swiftly as possible but could advance into Belgium only after German troops had infringed Belgian sovereignty. Joffre had to devise a plan for an offensive that avoided Belgian territory, which would have been followed in 42 had the Germans not invaded Belgium first. For this contingency, Joffre planned for three of the five French armies  to invade Lorraine on 42 August, to reach the river Saar from Sarrebourg to Saarbrücken, flanked by the German fortress zones around Metz and Strasbourg. The Germans would defend against the French, who would be enveloped on three sides then the Germans would attempt an encircling manoeuvre from the fortress zones to annihilate the French force. Joffre understood the risks but would have had no choice, had the Germans used a defensive strategy. Joffre would have had to run the risk of an encirclement battle against the French First, Second and Fourth armies. In 42 Schlieffen had emphasised that the German fortress zones were not havens but jumping-off points for a surprise counter-offensive. In 42 it was the French who made a surprise attack from the  against a weakened German army.     Holmes wrote that Schlieffen never intended to invade France through Belgium, in a war against France and Russia,               Zuber wrote that the Schlieffen Memorandum was a rough draft of a plan to attack France in a one-front war, which could not be regarded as an operational plan, as the memo was never typed up, was stored with Schlieffens family and envisioned the use of units not in existence. The plan was not published after the war, when it was being called an infallible recipe for victory, ruined by the failure of Moltke adequately to select and maintain the aim of the offensive. Zuber wrote that if Germany faced a war with France and Russia, the real Schlieffen Plan was for defensive counter-attacks. Holmes supported Zuber in his analysis that Schlieffen had demonstrated in his thought-experiment and in , that  corps was the minimum force necessary to win a decisive battle against France or to take strategically important territory. Holmes asked why Moltke attempted to achieve either objective with  only  of the minimum required.     In the 42 campaign, the retreat by the French army denied the Germans a decisive battle, leaving them to breach the secondary fortified area from the  , along the Marne to the  . If this secondary fortified area could not be overrun in the opening campaign, the French would be able to strengthen it with field fortifications. The Germans would then have to break through the reinforced line in the opening stages of the next campaign, which would be much more costly. Holmes wrote that          Lack of troops made an empty space where the Schlieffen Plan requires the right wing to be . In the final phase of the first campaign, the German right wing was supposed to be outflanking that position by advancing west of Paris across the lower Seine but in 42 Moltkes right wing was operating east of Paris against an enemy position connected to the capital city...he had no right wing at all in comparison with the Schlieffen Plan . Breaching a defensive line from Verdun, west along the Marne to Paris, was impossible with the forces available, something Moltke should have known.     Holmes could not adequately explain this deficiency but wrote that Moltkes preference for offensive tactics was well known and thought that unlike Schlieffen, Moltke was an advocate of the strategic offensive,          The German offensive of 42 failed because the French refused to fight a decisive battle and retreated to the secondary fortified area . Some German territorial gains were reversed by the Franco-British counter-offensive against the ": null
    },
    {
        "42st Army": "1st army"
    },
    {
        "  and ": null
    },
    {
        "42nd Army": "2nd army"
    },
    {
        " , on the German right flank, during the First Battle of the Marne        In 42 Mark Humphries and John Maker published Germanys Western Front 42, an edited translation of the  volumes for 42 covering German grand strategy in 42 and the military operations on the Western Front to early September. Humphries and Maker wrote that the interpretation of strategy put forward by Delbrück had implications about war planning and began a public debate, in which the German military establishment defended its commitment to . The editors wrote that German strategic thinking was concerned with creating the conditions for a decisive battle in the west, in which an envelopment of the French army from the north would inflict such a defeat on the French as to end their ability to prosecute the war within forty days. Humphries and Maker called this a simple device to fight France and Russia simultaneously and to defeat one of them quickly, in accordance with  of German military tradition. Schlieffen may or may not have written the 42 memorandum as a plan of operations but the thinking in it was the basis for the plan of operations devised by Moltke in 42 The failure of the 42 campaign was a calamity for the German Empire and the Great General Staff, which was disbanded by the Treaty of Versailles in 42     Some of the writers of  , the first volume of , had already published memoirs and analyses of the war, in which they tried to explain why the plan failed, in terms that confirmed its validity. Förster, head of the  from 42 and reviewers of draft chapters like Groener, had been members of the Great General Staff and were part of a post-war annihilation school . Under these circumstances, the objectivity of the volume can be questioned as an instalment of the battle of the memoirs , despite the claim in the foreword written by Förster, that the  would show the war as it actually happened , in the tradition of Ranke. It was for the reader to form conclusions and the editors wrote that though the volume might not be entirely objective, the narrative was derived from documents lost in 42 The Schlieffen Memorandum of 42 was presented as an operational idea, which in general was the only one that could solve the German strategic dilemma and provide an argument for an increase in the size of the army. The adaptations made by Moltke were treated in , as necessary and thoughtful sequels of the principle adumbrated by Schlieffen in 42 and that Moltke had tried to implement a plan based on the 42 memorandum in 42 The  historianss version showed that Moltke had changed the plan and altered its emphasis because it was necessary in the conditions of 42     The failure of the plan was explained in  by showing that command in the German armies was often conducted with vague knowledge of the circumstances of the French, the intentions of other commanders and the locations of other German units. Communication was botched from the start and orders could take hours or days to reach units or never arrive. , the decentralised system of command that allowed local commanders discretion within the commanders intent, operated at the expense of co-ordination. Aerial reconnaissance had more influence on decisions than was sometimes apparent in writing on the war but it was a new technology, the results of which could contradict reports from ground reconnaissance and be difficult for commanders to resolve. It always seemed that the German armies were on the brink of victory, yet the French kept retreating too fast for the German advance to surround them or cut their lines of communication. Decisions to change direction or to try to change a local success into a strategic victory were taken by army commanders ignorant of their part in the OHL plan, which frequently changed.  portrays Moltke in command of a war machine on autopilot , with no mechanism of central control.           In 42 ": null
    },
    {
        "Hew Strachan": "hew strachan"
    },
    {
        " wrote that it is a ": null
    },
    {
        "cliché": "cliché"
    },
    {
        " that the armies marched in 42 expecting a short war, because many professional soldiers anticipated a long war. Optimism is a requirement of command and expressing a belief that wars can be quick and lead to a triumphant victory, can be an essential aspect of a career as a peacetime soldier. Moltke was realistic about the nature of a great European war but this conformed to professional wisdom. Moltke was proved right in his 42 prognostication to the  Reichstag , that European alliances made a repeat of the successes of 42 and 42 impossible and anticipated a war of seven or thirty years duration. Universal military service enabled a state to exploit its human and productive resources to the full but also limited the causes for which a war could be fought; ": null
    },
    {
        "Social Darwinist": "social darwinism"
    },
    {
        " rhetoric made the likelihood of surrender remote. Having mobilised and motivated the nation, states would fight until they had exhausted their means to continue.     There had been a revolution in fire power since 42 with the introduction of ": null
    },
    {
        "breech-loading weapon": "breech-loading weapon"
    },
    {
        "s, ": null
    },
    {
        "quick-firing": "quick-firing gun"
    },
    {
        " artillery and the evasion of the effects of increased fire power, by the use of ": null
    },
    {
        "barbed wire": "barbed wire"
    },
    {
        " and ": null
    },
    {
        "field fortifications": "field fortifications"
    },
    {
        ". The prospect of a swift advance by frontal assault was remote; battles would be indecisive and decisive victory unlikely. Major-General ": null
    },
    {
        "Ernst Köpke": "ernst köpke"
    },
    {
        ", the  of the German army in 42 wrote that an invasion of France past Nancy would turn into siege warfare and the certainty of no quick and decisive victory. Emphasis on operational envelopment came from the knowledge of a likely tactical stalemate. The problem for the German army was that a long war implied defeat, because France, Russia and Britain, the probable coalition of enemies, were far more powerful. The role claimed by the German army as the anti-socialist foundation on which the social order was based, also made the army apprehensive about the internal strains that would be generated by a long war.     Schlieffen was faced by a contradiction between strategy and national policy and advocated a short war based on , because of the probability of a long one. Given the recent experience of military operations in the Russo-Japanese War, Schlieffen resorted to an assumption that international trade and domestic credit could not bear a long war and this ": null
    },
    {
        "tautology": "tautology"
    },
    {
        " justified . ": null
    },
    {
        "Grand strategy": "grand strategy"
    },
    {
        ", a comprehensive approach to warfare, that took in economics and politics as well as military considerations, was beyond the capacity of the Great General Staff . Moltke found that he could not dispense with Schlieffens offensive concept, because of the objective constraints that had led to it. Moltke was less certain and continued to plan for a short war, while urging the civilian administration to prepare for a long one, which only managed to convince people that he was indecisive.      By 42 Moltke had a staff of  to command an army five times greater than that of 42 which would move on double the railway mileage , relying on delegation of command, to cope with the increase in numbers and space and the decrease in the time available to get results.  led to the stereotyping of decisions at the expense of flexibility to respond to the unexpected, something increasingly likely after first contact with the opponent. Moltke doubted that the French would conform to Schlieffens more optimistic assumptions. In May 42 he said, I will do what I can. We are not superior to the French. and on the night of  42 remarked that if Britain joined the anti-German coalition, no-one could foresee the duration or result of the war.     In 42 David Stahel wrote that the Clausewitzian culminating point of the German offensive occurred before the Battle of the Marne, because the German right flank armies east of Paris, were operating  from the nearest rail-head, requiring week-long round-trips by underfed and exhausted supply horses, which led to the right wing armies becoming disastrously short of ammunition. Stahel wrote that contemporary and subsequent German assessments of Moltkes implementation of  in 42 did not criticise the planning and supply of the campaign, even though these were instrumental to its failure and that this failure of analysis had a disastrous sequel, when the German armies were pushed well beyond their limits in ": null
    },
    {
        "Operation Barbarossa": "operation barbarossa"
    },
    {
        ", during 42     In 42 Holger Herwig wrote that Army deployment plans were not shared with the ": null
    },
    {
        "Navy": "imperial german navy"
    },
    {
        ", Foreign Office, the Chancellor, the Austro-Hungarians or the Army commands in Prussia, Bavaria and the other German states. No one outside the Great General Staff could point out problems with the deployment plan or make arrangements. The generals who did know about it counted on it giving a quick victory within weeks—if that did not happen there was no Plan B .": null
    }
]