[
    {
        "                     The Schutzstaffel  was a major ": null
    },
    {
        "paramilitary": "paramilitary"
    },
    {
        " organization under ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " and the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " in ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ", and later throughout ": null
    },
    {
        "German-occupied Europe": "german-occupied europe"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". It began with a small guard unit known as the Saal-Schutz made up of NSDAP volunteers to provide security for party meetings in Munich. In 1925, ": null
    },
    {
        "Heinrich Himmler": "heinrich himmler"
    },
    {
        " joined the unit, which had by then been reformed and given its final name. Under his direction it grew from a small paramilitary formation during the ": null
    },
    {
        "Weimar Republic": "weimar republic"
    },
    {
        " to one of the most powerful organizations in Nazi Germany. From 1929 until the regimes collapse in 1945, the SS was the foremost agency of security, surveillance, and terror within Germany and German-occupied Europe.     The two main constituent groups were the  Allgemeine SS  and ": null
    },
    {
        "Waffen-SS": "waffen-ss"
    },
    {
        " . The Allgemeine SS was responsible for enforcing the ": null
    },
    {
        "racial policy of Nazi Germany": "racial policy of nazi germany"
    },
    {
        " and general policing, whereas the Waffen-SS consisted of combat units within Nazi Germanys military. A third component of the SS, the  SS-Totenkopfverbände  , ran the ": null
    },
    {
        "concentration camps": "nazi concentration camps"
    },
    {
        " and ": null
    },
    {
        "extermination camp": "extermination camp"
    },
    {
        "s. Additional subdivisions of the SS included the ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        " and the  Sicherheitsdienst  organizations. They were tasked with the detection of actual or potential enemies of the Nazi state, the neutralization of any opposition, policing the German people for their commitment to ": null
    },
    {
        "Nazi ideology": "nazi ideology"
    },
    {
        ", and providing domestic and foreign intelligence.     The SS was the organization most responsible for the genocidal killing of ": null
    },
    {
        "an estimated 5.5 to 6 million Jews and millions of other victims": "holocaust victims"
    },
    {
        " during ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        ". Members of all of its branches committed ": null
    },
    {
        "war crimes": "war crime"
    },
    {
        "and ": null
    },
    {
        "crimes against humanity": "crimes against humanity"
    },
    {
        " during World War II . The SS was also involved in commercial enterprises and exploited concentration camp inmates as slave labor. After Nazi Germanys defeat, the SS and the NSDAP were judged by the ": null
    },
    {
        "International Military Tribunal": "international military tribunal"
    },
    {
        " at Nuremberg to be criminal organizations. ": null
    },
    {
        "Ernst Kaltenbrunner": "ernst kaltenbrunner"
    },
    {
        ", the highest-ranking surviving SS main department chief, was found guilty of crimes against humanity at the Nuremberg trials and hanged in 1946.                     By 1923, the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " led by ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " had created a small volunteer guard unit known as the Saal-Schutz to provide security at their meetings in ": null
    },
    {
        "Munich": "munich"
    },
    {
        ". The same year, Hitler ordered the formation of a small bodyguard unit dedicated to his personal service. He wished it to be separate from the suspect mass of the party, including the paramilitary  Sturmabteilung  , which he did not trust. The new formation was designated the Stabswache . Originally the unit was composed of eight men, commanded by ": null
    },
    {
        "Julius Schreck": "julius schreck"
    },
    {
        " and ": null
    },
    {
        "Joseph Berchtold": "joseph berchtold"
    },
    {
        ", and was modeled after the ": null
    },
    {
        "Erhardt Naval Brigade": "erhardt naval brigade"
    },
    {
        ", a  Freikorps  of the time. The unit was renamed ": null
    },
    {
        "Stoßtrupp": "stoßtrupp-hitler"
    },
    {
        " in May 1923.     The Stoßtrupp was abolished after the failed 1923 ": null
    },
    {
        "Beer Hall Putsch": "beer hall putsch"
    },
    {
        ", an attempt by the NSDAP to seize power in Munich. In 1925, Hitler ordered Schreck to organize a new bodyguard unit, the Schutzkommando . It was tasked with providing personal protection for Hitler at NSDAP functions and events. That same year, the Schutzkommando was expanded to a national organization and renamed successively the Sturmstaffel , and finally the Schutzstaffel . Officially, the SS marked its foundation on 9 November 1925 . The new SS was to provide protection for NSDAP leaders throughout Germany. Hitlers personal SS protection unit was later enlarged to include combat units.       Schreck, a founding member of the SA and a close confidant of Hitler, became the first SS chief in March 1925. On 15 April 1926, ": null
    },
    {
        "Joseph Berchtold": "joseph berchtold"
    },
    {
        " succeeded him as chief of the SS. Berchtold changed the title of the office to Reichsführer-SS . Berchtold was considered more dynamic than his predecessor, but became increasingly frustrated by the authority the SA had over the SS. This led to him transferring leadership of the SS to his deputy, ": null
    },
    {
        "Erhard Heiden": "erhard heiden"
    },
    {
        ", on 1 March 1927. Under Heidens leadership, a stricter code of discipline was enforced than would have been tolerated in the SA.     Between 1925 and 1929, the SS was considered to be a small Gruppe of the SA. Except in the Munich area, the SS was unable to maintain any momentum in its membership numbers, which declined from 1,000 to 280 as the SA continued its rapid growth. As Heiden attempted to keep the SS from dissolving, ": null
    },
    {
        "Heinrich Himmler": "heinrich himmler"
    },
    {
        " became his deputy in September 1927. Himmler displayed good organizational abilities compared to Heiden. The SS established ": null
    },
    {
        "a number": "list of gauleiters"
    },
    {
        " of ": null
    },
    {
        "Gaus": "gau"
    },
    {
        ". The SS-Gaus consisted of SS-Gau Berlin, SS-Gau Berlin Brandenburg, SS-Gau Franken, SS-Gau Niederbayern, SS-Gau Rheinland-Süd, and SS-Gau Sachsen.          With Hitlers approval, Himmler assumed the position of Reichsführer-SS in January 1929. There are differing accounts of the reason for Heidens dismissal from his position as head of the SS. The party announced that it was for family reasons.  Under Himmler, the SS expanded and gained a larger foothold. He considered the SS an elite, ideologically driven National Socialist organization, a conflation of ": null
    },
    {
        "Teutonic knights": "teutonic knights"
    },
    {
        ", the ": null
    },
    {
        "Jesuits": "jesuits"
    },
    {
        ", and ": null
    },
    {
        "Japanese Samurai": "japanese samurai"
    },
    {
        " . His ultimate aim was to turn the SS into the most powerful organization in Germany and most influential branch of the party. He expanded the SS to 3,000 members in his first year as its leader.     In 1929, the  SS-Hauptamt  was expanded and reorganized into five main offices dealing with general administration, personnel, finance, security, and race matters. At the same time, the SS-Gaus were expanded into three SS-Oberführerbereiche areas, namely the SS-Oberführerbereich Ost, SS-Oberführerbereich West, and SS-Oberführerbereich Süd. The lower levels of the SS remained largely unchanged. Although officially still considered a sub-organization of the SA and answerable to the  Stabschef  , it was also during this time that Himmler began to establish the independence of the SS from the SA. The SS grew in size and power due to its exclusive loyalty to Hitler, as opposed to the SA, which was seen as semi-independent and a threat to Hitlers hegemony over the party, mainly because they demanded a second revolution beyond the one that brought the NSDAP to power. By the end of 1933, the membership of the SS reached 209,000. Under Himmlers leadership the SS continued to gather greater power as more and more state and party functions were assigned to its jurisdiction. Over time the SS became answerable only to Hitler, a development typical of the organizational structure of the entire Nazi regime, where legal norms were replaced by actions undertaken under the  Führerprinzip  , where Hitlers will was considered to be above the law.     In the latter half of 1934, Himmler oversaw the creation of  SS-Junkerschule , institutions where SS officer candidates received leadership training, political and ideological indoctrination, and military instruction. The training stressed ruthlessness and toughness as part of the SS value system, which helped foster a sense of superiority among the men and taught them self-confidence. The first schools were established at ": null
    },
    {
        "Bad Tölz": "bad tölz"
    },
    {
        " and ": null
    },
    {
        "Braunschweig": "braunschweig"
    },
    {
        ", with additional schools opening at ": null
    },
    {
        "Klagenfurt": "klagenfurt"
    },
    {
        " and ": null
    },
    {
        "Prague": "prague"
    },
    {
        " during the war.          The SS was regarded as the NSDAPs elite unit. In keeping with the ": null
    },
    {
        "racial policy of Nazi Germany": "racial policy of nazi germany"
    },
    {
        ", in the early days all SS officer candidates had to provide proof of ": null
    },
    {
        "Aryan ancestry": "aryan racenazism"
    },
    {
        " back to 1750 and for other ranks to 1800. Once the war started and it became more difficult to confirm ancestry, the regulation was amended to just proving the candidates grandparents were Aryan, as spelled out in the ": null
    },
    {
        "Nuremberg Laws": "nuremberg laws"
    },
    {
        ". Other requirements were complete obedience to the Führer and a commitment to the German people and nation. Himmler also tried to institute physical criteria based on appearance and height, but these requirements were only loosely enforced, and over half the SS men did not meet the criteria. Inducements such as higher salaries and larger homes were provided to members of the SS, since they were expected to produce more children than the average German family as part of their commitment to NSDAP doctrine.          Commitment to SS ideology was emphasized throughout the recruitment, membership process, and training. Members of the SS were indoctrinated in the racial policy of Nazi Germany, and were taught that it was necessary to remove from Germany people deemed by that policy as inferior. ": null
    },
    {
        "Esoteric": "esoteric"
    },
    {
        " rituals and the awarding of regalia and insignia for milestones in the SS mans career suffused SS members even further with Nazi ideology. Members were expected to renounce their Christian faith, and Christmas was replaced with a ": null
    },
    {
        "solstice celebration": "christmas in nazi germany"
    },
    {
        ". Church weddings were replaced with SS Ehewein, a pagan ceremony invented by Himmler. These pseudo-religious rites and ceremonies often took place near SS-dedicated monuments or in special SS-designated places. In 1933, Himmler bought ": null
    },
    {
        "Wewelsburg": "wewelsburg"
    },
    {
        ", a castle in ": null
    },
    {
        "Westphalia": "westphalia"
    },
    {
        ". He initially intended it to be used as an SS training centre, but its role came to include hosting SS dinners and neo-pagan rituals.     The SS ideology included the application of brutality and terror as a solution to military and political problems. The SS stressed total loyalty and obedience to orders unto death. Hitler used this as a powerful tool to further his aims and those of the NSDAP. The SS was entrusted with the commission of atrocities, illegal activities, and war crimes. Himmler once wrote that an SS man hesitates not for a single instant, but executes unquestioningly  ... any Führer-Befehl . Their official motto was  Meine Ehre heißt Treue  .     As part of its race-centric functions during World War II, the SS oversaw the isolation and displacement of ": null
    },
    {
        "Jews": "jews"
    },
    {
        " from the populations of the conquered territories, seizing their assets and deporting them to ": null
    },
    {
        "concentration camps": "nazi concentration camps"
    },
    {
        " and ": null
    },
    {
        "ghettos": "ghettosjewish ghettos"
    },
    {
        ", where they were used as ": null
    },
    {
        "slave labor": "slave labor"
    },
    {
        " or immediately killed. Chosen to implement the ": null
    },
    {
        "Final Solution": "final solution"
    },
    {
        " ordered by Hitler, the SS were the main group responsible for the institutional killing and ": null
    },
    {
        "democide": "democide"
    },
    {
        " of more than 20 million people during ": null
    },
    {
        "the Holocaust": "the holocaust"
    },
    {
        ", including approximately 5.2 million to 6 million Jews and 10.5 million ": null
    },
    {
        "Slavs": "slavs"
    },
    {
        ". A significant number of victims were members of other racial or ethnic groups such as the 258,000 ": null
    },
    {
        "Romani": "romani people"
    },
    {
        ". The SS was involved in killing people viewed as threats to ": null
    },
    {
        "race hygiene": "nazi eugenics"
    },
    {
        " or Nazi ideology, including the mentally or physically handicapped, homosexuals, and political dissidents. Members of trade unions and those perceived to be affiliated with groups that opposed the regime , or those whose views were contradictory to the goals of the NSDAP government, were rounded up in large numbers; these included clergy of all faiths, ": null
    },
    {
        "Jehovahs Witnesses": "jehovahs witnesses"
    },
    {
        ", ": null
    },
    {
        "Freemasons": "freemasonry"
    },
    {
        ", ": null
    },
    {
        "Communists": "communism"
    },
    {
        ", and ": null
    },
    {
        "Rotary Club": "rotary international"
    },
    {
        " members. According to the judgments rendered at the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        " as well as many ": null
    },
    {
        "war crimes": "war crime"
    },
    {
        "investigations and trials conducted since then, the SS was responsible for the majority of Nazi war crimes. In particular, it was the primary organization which carried out the Holocaust.       After Hitler and the NSDAP came to power on 30 January 1933, the SS were considered a state organization and a branch of the government. Law enforcement gradually became the purview of the SS, and many SS organizations became ": null
    },
    {
        "de facto": "de facto"
    },
    {
        " government agencies.          The SS established a ": null
    },
    {
        "police state": "police state"
    },
    {
        " within Nazi Germany, using the secret state police and security forces under Himmlers control to suppress resistance to Hitler. In his role as ": null
    },
    {
        "Minister President of Prussia": "minister president of prussia"
    },
    {
        ", ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        " had in 1933 created a Prussian ": null
    },
    {
        "secret police": "secret police"
    },
    {
        " force, the Geheime Staatspolizei or ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        ", and appointed ": null
    },
    {
        "Rudolf Diels": "rudolf diels"
    },
    {
        " as its head. Concerned that Diels was not ruthless enough to use the Gestapo effectively to counteract the power of the SA, Göring handed over its control to Himmler on 20 April 1934. Also on that date, in a departure from long-standing German practice that law enforcement was a state and local matter, Hitler appointed Himmler chief of all German police outside Prussia. Himmler named his deputy and protégé ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        " chief of the Gestapo on 22 April 1934. Heydrich also continued as head of the  Sicherheitsdienst  .     The Gestapos transfer to Himmler was a prelude to the ": null
    },
    {
        "Night of the Long Knives": "night of the long knives"
    },
    {
        ", in which most of the SA leadership were arrested and subsequently executed. The SS and Gestapo carried out most of the killings. On 20 July 1934, Hitler detached the SS from the SA, which was no longer an influential force after the purge. The SS became an elite corps of the NSDAP, answerable only to Hitler. Himmlers title of Reichsführer-SS now became his actual rank  – and the highest rank in the SS, equivalent to the rank of ": null
    },
    {
        "field marshal": "generalfeldmarschall"
    },
    {
        " in the army . As Himmlers position and authority grew, so in effect did his rank.     On 17 June 1936, all police forces throughout Germany were united under the purview of Himmler and the SS. Himmler and Heydrich thus became two of the most powerful men in the countrys administration. Police and intelligence forces brought under their administrative control included the SD, Gestapo,  Kriminalpolizei  , and  Ordnungspolizei  . In his capacity as police chief, Himmler was nominally subordinate to Interior Minister ": null
    },
    {
        "Wilhelm Frick": "wilhelm frick"
    },
    {
        ". In practice, since the SS answered only to Hitler, the de facto merger of the SS and the police made the police independent of Fricks control. In September 1939, the security and police agencies, including the  Sicherheitspolizei  and SD , were consolidated into the ": null
    },
    {
        "Reich Main Security Office": "reich main security office"
    },
    {
        " , headed by Heydrich. This further increased the collective authority of the SS.     In September 1939, the authority of the SS expanded further when the senior SS officer in each military district also became its chief of police. Most of these ": null
    },
    {
        "SS and police leaders": "ss and police leader"
    },
    {
        "held the rank of SS- Gruppenführer  or above, and answered directly to Himmler in all SS matters within their district. Their role was to police the population and oversee the activities of the SS men within their district. By declaring an emergency, they could bypass the district administrative offices for the SS, SD, SiPo,  SS-Totenkopfverbände  , and Orpo, thereby gaining direct operational control of these groups.     During  Kristallnacht  , SS security services clandestinely coordinated violence against Jews as the SS, Gestapo, SD, Kripo, SiPo and regular police did what they could to ensure that while Jewish synagogues and community centers were destroyed, Jewish-owned businesses and housing remained intact so that they could later be seized. In the end, thousands of Jewish businesses, homes, and graveyards were vandalized and looted, particularly by members of the SA. Some 500 to 1,000 synagogues were destroyed, mostly by arson. On 11 November, Heydrich reported a death toll of 36 people, but later assessments put the number of deaths at up to two thousand. On Hitlers orders, around 30,000 Jewish men were arrested and sent to concentration camps by 16 November. It is likely that as many as 2,500 of these people died in the following months. It was at this point that the SS state began in earnest its campaign of terror against political and religious opponents, who they imprisoned without trial or judicial oversight for the sake of security, re-education, or prevention .               As the SS grew in size and importance, so too did Hitlers personal protection units. Three main SS groups were assigned to protect Hitler. In 1933, his larger personal bodyguard unit  was called to Berlin to replace the Army Chancellery Guard, assigned to protect the ": null
    },
    {
        "Chancellor of Germany": "chancellor of germany"
    },
    {
        ". ": null
    },
    {
        "Sepp Dietrich": "sepp dietrich"
    },
    {
        " commanded the new unit, previously known as SS-Stabswache Berlin; the name was changed to SS-Sonderkommando Berlin. In November 1933, the name was changed to Leibstandarte Adolf Hitler. In April 1934, Himmler modified the name to  Leibstandarte SS Adolf Hitler  . The LSSAH guarded Hitlers private residences and offices, providing an outer ring of protection for the Führer and his visitors. LSSAH men manned sentry posts at the entrances to the old ": null
    },
    {
        "Reich Chancellery": "reich chancellery"
    },
    {
        " and the new Reich Chancellery. The number of LSSAH guards was increased during special events. At the ": null
    },
    {
        "Berghof": "berghof"
    },
    {
        ", Hitlers residence in the ": null
    },
    {
        "Obersalzberg": "obersalzberg"
    },
    {
        ", a large contingent of the LSSAH patrolled an extensive cordoned security zone.     From 1941, forward, the Leibstandarte became four distinct entities, the Waffen-SS division , the Berlin Chancellory Guard, the SS security regiment assigned to the Obersalzberg, and a Munich-based bodyguard unit which protected Hitler when he visited his personal apartment and the ": null
    },
    {
        "Brown House": "brown house, munich"
    },
    {
        " NSDAP headquarters in Munich. Although the unit was nominally under Himmler, Dietrich was the real commander and handled day-to-day administration.     Two other SS units composed the inner ring of Hitlers personal protection. The  SS-Begleitkommando des Führers  , formed in February 1932, served as Hitlers protection escort while he was travelling. This unit consisted of eight men who served around the clock protecting Hitler in shifts. Later the SS-Begleitkommando was expanded and became known as the Führerbegleitkommando . It continued under separate command and remained responsible for Hitlers personal protection. The  Führer Schutzkommando  was a protection unit founded by Himmler in March 1933. Originally it was charged with protecting Hitler only while he was inside the borders of ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ". In early 1934, they replaced the SS-Begleitkommando for Hitlers protection throughout Germany. The FSK was renamed the Reichssicherheitsdienst in August 1935. ": null
    },
    {
        "Johann Rattenhuber": "johann rattenhuber"
    },
    {
        ", chief of the RSD, for the most part took his orders directly from Hitler. The current FBK chief acted as his deputy. Wherever Hitler was in residence, members of the RSD and FBK would be present. RSD men patrolled the grounds and FBK men provided close security protection inside. The RSD and FBK worked together for security and personal protection during Hitlers trips and public events, but they operated as two groups and used separate vehicles. By March 1938, both units wore the standard field grey uniform of the SS. The RSD uniform had the SD diamond on the lower left sleeve.          The SS was closely associated with Nazi Germanys concentration camp system. On 26 June 1933, Himmler appointed SS- Oberführer  ": null
    },
    {
        "Theodor Eicke": "theodor eicke"
    },
    {
        " as ": null
    },
    {
        "commandant": "commandant"
    },
    {
        " of ": null
    },
    {
        "Dachau concentration camp": "dachau concentration camp"
    },
    {
        ", one of the first ": null
    },
    {
        "Nazi concentration camps": "nazi concentration camps"
    },
    {
        ". It was created to consolidate the many small camps that had been set up by various police agencies and the NSDAP to house political prisoners. The organizational structure Eicke instituted at Dachau stood as the model for all later concentration camps. After 1934, Eicke was named commander of the SS-Totenkopfverbände , the SS formation responsible for running the concentration camps under the authority of the SS and Himmler. Known as the Deaths Head Units , the SS-TV was first organized as several battalions, each based at one of Germanys major concentration camps. Leadership at the camps was divided into five departments: commander and adjutant, political affairs division, protective custody, administration, and medical personnel. By 1935, Himmler secured Hitlers approval and the finances necessary to establish and operate additional camps. Six concentration camps housing 21,400 inmates existed at the start of the war in September 1939. By the end of the war, hundreds of camps of varying size and function had been created, holding nearly 715,000 people, most of whom were targeted by the regime because of their race. The concentration camp population rose in tandem with the defeats suffered by the Nazi regime; the worse the catastrophe seemed, the greater the fear of subversion, prompting the SS to intensify their repression and terror.       By the outbreak of World War  II, the SS had consolidated into its final form, which comprised three main organizations: the Allgemeine SS, SS-Totenkopfverbände, and the ": null
    },
    {
        "Waffen-SS": "waffen-ss"
    },
    {
        ", which was founded in 1934 as the  SS-Verfügungstruppe  and renamed in 1940. The Waffen-SS evolved into a second German army alongside the ": null
    },
    {
        "Wehrmacht": "wehrmacht"
    },
    {
        " and operated in tandem with them, especially with the  Heer  . However, it never obtained total independence of command , nor was it ever a serious rival to the German Army. Members were never able to join the ranks of the German High Command and it was dependent on the army for heavy weaponry and equipment. Although SS ranks generally had equivalents in the other services, the SS rank system did not copy the terms and ranks used by the Wehrmachts branches. Instead it used the ranks established by the post-World War I Freikorps and the SA. This was primarily done to emphasize the SS as being independent from the Wehrmacht.            In the September 1939 ": null
    },
    {
        "invasion of Poland": "invasion of poland"
    },
    {
        ", the LSSAH and SS-VT fought as separate mobile infantry regiments. The LSSAH became notorious for torching villages without military justification. Members of the LSSAH committed atrocities in numerous towns, including the murder of 50 Polish Jews in ": null
    },
    {
        "Błonie": "błonie"
    },
    {
        " and the massacre of 200 civilians, including children, who were machine gunned in ": null
    },
    {
        "Złoczew": "złoczew"
    },
    {
        ". Shootings also took place in ": null
    },
    {
        "Bolesławiec": "bolesławiec"
    },
    {
        ", ": null
    },
    {
        "Torzeniec": "torzeniec"
    },
    {
        ", ": null
    },
    {
        "Goworowo": "goworowo"
    },
    {
        ", ": null
    },
    {
        "Mława": "mława"
    },
    {
        ", and ": null
    },
    {
        "Włocławek": "włocławek"
    },
    {
        ". Some senior members of the Wehrmacht were not convinced the units were fully prepared for combat. Its units took unnecessary risks and had a higher casualty rate than the army.  Generaloberst  ": null
    },
    {
        "Fedor von Bock": "fedor von bock"
    },
    {
        " was quite critical; following an April 1940 visit of the SS-Totenkopf division, he found their battle training was insufficient . Hitler thought the criticism was typical of the armys outmoded conception of chivalry.  In its defence, the SS insisted that its armed formations had been hampered by having to fight piecemeal and were improperly equipped by the army.     After the invasion, Hitler entrusted the SS with extermination actions codenamed ": null
    },
    {
        "Operation Tannenberg": "operation tannenberg"
    },
    {
        " and ": null
    },
    {
        "AB-Aktion": "german ab-aktion in poland"
    },
    {
        " to remove potential leaders who could form a resistance to German occupation. The killings were committed by  Einsatzgruppen  , assisted by local paramilitary groups. Men for the Einsatzgruppen units were drawn from the SS, the SD, and the police. Some 65,000 Polish civilians, including ": null
    },
    {
        "activist": "activist"
    },
    {
        "s, ": null
    },
    {
        "intelligentsia": "intelligentsia"
    },
    {
        ", scholars, teachers, actors, former officers, and others, were killed by the end of 1939. When the army leadership registered complaints about the brutality being meted out by the Einsatzgruppen, Heydrich informed them that he was acting in accordance with the special order of the Führer.  The first systematic mass shooting of Jews by the Einsatzgruppen took place on 6 September 1939 during the attack on ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        ".        Satisfied with their performance in Poland, Hitler allowed further expansion of the armed SS formations, but insisted new units remain under the operational control of the army. While the SS-Leibstandarte remained an independent regiment functioning as Hitlers personal bodyguards, the other regiments—SS-Deutschland, SS-Germania, and SS-Der Führer—were combined to form the  SS-Verfügungs-Division . A second SS division, the SS-Totenkopf, was formed from SS-TV concentration camp guards, and a third, the ": null
    },
    {
        "SS-Polizei": "4th ss polizei panzergrenadier division"
    },
    {
        ", was created from police volunteers. The SS gained control over its own recruitment, logistics, and supply systems for its armed formations at this time. The SS, Gestapo, and SD were in charge of the provisional military administration in Poland until the appointment of ": null
    },
    {
        "Hans Frank": "hans frank"
    },
    {
        " as Governor-General on 26 October 1939.       On 10 May 1940, Hitler launched the ": null
    },
    {
        "Battle of France": "battle of france"
    },
    {
        ", a major offensive against France and the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        ". The SS supplied two of the 89 divisions employed. The LSSAH and elements of the SS-VT participated in the ground invasion of the ": null
    },
    {
        "Battle of the Netherlands": "battle of the netherlands"
    },
    {
        ". Simultaneously, airborne troops were dropped to capture key Dutch airfields, bridges, and railways. In the five-day campaign, the LSSAH linked up with army units and airborne troops after a number of clashes with Dutch defenders.          SS troops did not take part in the thrust through the ": null
    },
    {
        "Ardennes": "ardennes"
    },
    {
        " and the river ": null
    },
    {
        "Meuse": "meuse"
    },
    {
        ". Instead, the SS-Totenkopf was summoned from the army reserve to fight in support of  Generalmajor  ": null
    },
    {
        "Erwin Rommels": "erwin rommel"
    },
    {
        " 7th Panzer Division": "7th panzer division"
    },
    {
        " as they advanced toward the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        ". On 21 May, the British launched an armored counterattack against the flanks of 7th Panzer Division and SS-Totenkopf. The Germans then trapped the British and French troops in a huge pocket at ": null
    },
    {
        "Dunkirk": "dunkirk"
    },
    {
        ". On 27 May, 4 Company, SS-Totenkopf perpetrated the ": null
    },
    {
        "Le Paradis massacre": "le paradis massacre"
    },
    {
        ", where 97 men of the 2nd Battalion, ": null
    },
    {
        "Royal Norfolk Regiment": "royal norfolk regiment"
    },
    {
        " were machine gunned after surrendering, with survivors finished off with ": null
    },
    {
        "bayonet": "bayonet"
    },
    {
        "s. Two men survived. By 28 May the SS-Leibstandarte had taken ": null
    },
    {
        "Wormhout": "wormhout"
    },
    {
        ",  from Dunkirk. There, soldiers of the 2nd Battalion were responsible for the ": null
    },
    {
        "Wormhoudt massacre": "wormhoudt massacre"
    },
    {
        ", where 80 British and French soldiers were murdered after they surrendered. According to historian Charles Sydnor, the fanatical recklessness in the assault, suicidal defense against enemy attacks, and savage atrocities committed in the face of frustrated objectives exhibited by the SS-Totenkopf division during the invasion were typical of the SS troops as a whole.     At the close of the campaign, Hitler expressed his pleasure with the performance of the SS-Leibstandarte, telling them: Henceforth it will be an honour for you, who bear my name, to lead every German attack.  The SS-VT was renamed the Waffen-SS in a speech made by Hitler in July 1940. Hitler then authorized the enlistment of people perceived to be of related stock , as Himmler put it, to expand the ranks. A number of Danes, Dutch, Norwegians, Swedes, and Finns volunteered to fight in the Waffen-SS under the command of German officers. They were brought together to form the new division  SS-Wiking . In January 1941, the SS-Verfügungs Division was renamed SS-Reich Division , and was renamed as the  2nd SS Panzer Division Das Reich  when it was reorganized as a  Panzergrenadier  division in 1942.       In April 1941, the German Army ": null
    },
    {
        "invaded Yugoslavia": "invasion of yugoslavia"
    },
    {
        " and ": null
    },
    {
        "Greece": "battle of greece"
    },
    {
        ". The LSSAH and Das Reich were attached to separate army ": null
    },
    {
        "Panzer corps": "panzer corps"
    },
    {
        ". ": null
    },
    {
        "Fritz Klingenberg": "fritz klingenberg"
    },
    {
        ", a company commander in the Das Reich, led his men across Yugoslavia to the capital, ": null
    },
    {
        "Belgrade": "belgrade"
    },
    {
        ", where a small group in the vanguard accepted the surrender of the city on 13 April. A few days later Yugoslavia surrendered. SS police units immediately began taking hostages and carrying out reprisals, a practice that became common. In some cases, they were joined by the Wehrmacht. Similar to Poland, the war policies of the Nazis in the Balkans resulted in brutal occupation and racist mass murder. Serbia became the second country  declared  Judenfrei  .     In Greece, the Wehrmacht and Waffen-SS encountered resistance from the ": null
    },
    {
        "British Expeditionary Force": "british expeditionary force"
    },
    {
        " and ": null
    },
    {
        "Greek Army": "hellenic army"
    },
    {
        ". The fighting was intensified by the mountainous terrain, with its heavily defended narrow passes. The LSSAH was at the forefront of the German push. The BEF evacuated by sea to ": null
    },
    {
        "Crete": "crete"
    },
    {
        ", but had to flee again in late May when the Germans arrived. Like Yugoslavia, the conquest of Greece brought its Jews into danger, as the Nazis immediately took a variety of measures against them. Initially confined in ghettos, most were transported to ": null
    },
    {
        "Auschwitz concentration camp": "auschwitz concentration camp"
    },
    {
        " in March 1943, where they were killed in the ": null
    },
    {
        "gas chambers": "gas chamber"
    },
    {
        "on arrival. Of Greeces 80,000 Jews, only 20 percent survived the war.       On 22 June 1941, Hitler launched ": null
    },
    {
        "Operation Barbarossa": "operation barbarossa"
    },
    {
        ", the invasion of the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ". The expanding war and the need to control occupied territories provided the conditions for Himmler to further consolidate the police and military organs of the SS. Rapid acquisition of vast territories in the East placed considerable strain on the SS police organizations as they struggled to adjust to the changing security challenges.     The 1st and 2nd SS Infantry Brigades, which had been formed from surplus concentration camp guards of the SS-TV, and the ": null
    },
    {
        "SS Cavalry Brigade": "ss cavalry brigade"
    },
    {
        " moved into the Soviet Union behind the advancing armies. At first they fought ": null
    },
    {
        "Soviet partisans": "soviet partisans"
    },
    {
        ", but by the autumn of 1941, they left the anti-partisan role to other units and actively took part in the Holocaust. While assisting the Einsatzgruppen, they formed firing parties that participated in the liquidation of the Jewish population of the Soviet Union.     On 31 July 1941, Göring gave Heydrich written authorization to ensure the cooperation of administrative leaders of various government departments to undertake ": null
    },
    {
        "genocide": "genocide"
    },
    {
        " of the Jews in territories under German control. Heydrich was instrumental in carrying out these exterminations, as the Gestapo was ready to organize deportations in the West and his Einsatzgruppen were already conducting extensive killing operations in the East. On 20 January 1942, Heydrich chaired a meeting, called the ": null
    },
    {
        "Wannsee Conference": "wannsee conference"
    },
    {
        ", to discuss the implementation of the plan.     During battles in the Soviet Union during 1941 and 1942, the Waffen-SS suffered enormous casualties. The LSSAH and Das Reich lost over half their troops to illness and combat casualties. In need of recruits, Himmler began to accept soldiers that did not fit the original SS racial profile. In early 1942, SS-Leibstandarte, SS-Totenkopf, and SS-Das Reich were withdrawn to the West to refit and were converted to Panzergrenadier divisions. The SS-Panzer Corps returned to the Soviet Union in 1943 and participated in the ": null
    },
    {
        "Third Battle of Kharkov": "third battle of kharkov"
    },
    {
        " in February and March.            The SS was built on a culture of violence, which was exhibited in its most extreme form by the mass murder of civilians and prisoners of war on the ": null
    },
    {
        "Eastern Front": "eastern front"
    },
    {
        ". Augmented by personnel from the Kripo, ": null
    },
    {
        "Orpo": "ordnungspolizei"
    },
    {
        " , and Waffen-SS, the Einsatzgruppen reached a total strength of 3,000 men. Einsatzgruppen A, B, and C were attached to ": null
    },
    {
        "Army Groups North": "army group north"
    },
    {
        ", ": null
    },
    {
        "Centre": "army group centre"
    },
    {
        ", and ": null
    },
    {
        "South": "army group south"
    },
    {
        "; Einsatzgruppe D was assigned to the ": null
    },
    {
        "11th Army": "11th army"
    },
    {
        ". The Einsatzgruppe for Special Purposes operated in eastern Poland starting in July 1941. The historian ": null
    },
    {
        "Richard Rhodes": "richard rhodes"
    },
    {
        " describes them as being outside the bounds of morality ; they were judge, jury and executioner all in one , with the authority to kill anyone at their discretion. Following Operation Barbarossa, these Einsatzgruppen units, together with the Waffen-SS and Order Police as well as with assistance from the Wehrmacht, engaged in the mass killing of the Jewish population in occupied eastern Poland and the Soviet Union. The greatest extent of Einsatzgruppen action occurred in 1941 and 1942 in Ukraine and Russia. Before the invasion there were five million registered Jews throughout the Soviet Union, with three million of those residing in the territories occupied by the Germans; by the time the war ended, over two million of these had been murdered.     The extermination activities of the Einsatzgruppen generally followed a standard procedure, with the Einsatzgruppen chief contacting the nearest Wehrmacht unit commander to inform him of the impending action; this was done so they could coordinate and control access to the execution grounds. Initially the victims were shot, but this method proved impracticable for an operation of this scale. Also, after Himmler observed the shooting of 100 Jews at ": null
    },
    {
        "Minsk": "minsk"
    },
    {
        " in August 1941, he grew concerned about the impact such actions were having on the mental health of his SS men. He decided that alternate methods of killing should be found, which led to introduction of ": null
    },
    {
        "gas van": "nazi gas van"
    },
    {
        "s. However, these were not popular with the men, because removing the dead bodies from the van and burying them was a horrible ordeal. Prisoners or auxiliaries were often assigned to do this task so as to spare the SS men the trauma.          In response to the armys difficulties in dealing with Soviet partisans, Hitler decided in July 1942 to transfer anti-partisan operations to the police. This placed the matter under Himmlers purview. As Hitler had ordered on 8 July 1941 that all Jews were to be regarded as partisans, the term anti-partisan operations was used as a euphemism for the murder of Jews as well as actual combat against resistance elements. In July 1942 Himmler ordered that the term partisan should no longer be used; instead resisters to Nazi rule would be described as bandits .     Himmler set the SS and SD to work on developing additional anti-partisan tactics and launched a propaganda campaign. Sometime in June 1943, Himmler issued the  Bandenbekämpfung  order, simultaneously announcing the existence of the Bandenkampfverbände , with SS-Obergruppenführer ": null
    },
    {
        "Erich von dem Bach-Zelewski": "erich von dem bach-zelewski"
    },
    {
        " as its chief. Employing troops primarily from the SS police and Waffen-SS, the Bandenkampfverbände had four principal operational components: propaganda, centralized control and coordination of security operations, training of troops, and battle operations. Once the Wehrmacht had secured territorial objectives, the Bandenkampfverbände first secured communications facilities, roads, railways, and waterways. Thereafter, they secured rural communities and economic installations such as factories and administrative buildings. An additional priority was securing agricultural and forestry resources. The SS oversaw the collection of the harvest, which was deemed critical to strategic operations. Any Jews in the area were rounded up and killed. Communists and people of Asiatic descent were killed presumptively under the assumption that they were Soviet agents.          After the start of the war, Himmler intensified the activity of the SS within Germany and in Nazi occupied Europe. An increasing numbers of Jews and German citizens deemed politically suspect or social outsiders were arrested. As the Nazi regime became more oppressive, the concentration camp system grew in size and lethal operation, and grew in scope as the economic ambitions of the SS intensified.     Intensification of the killing operations took place in late 1941 when the SS began construction of stationary gassing facilities to replace the use of Einsatzgruppen for mass killings. Victims at these new ": null
    },
    {
        "extermination camps": "extermination camp"
    },
    {
        "were killed with the use of carbon monoxide gas from automobile engines. During ": null
    },
    {
        "Operation Reinhard": "operation reinhard"
    },
    {
        ", run by officers from the Totenkopfverbände, who were sworn to secrecy, three death camps were built in occupied Poland: ": null
    },
    {
        "Bełżec": "bełżec extermination camp"
    },
    {
        " , ": null
    },
    {
        "Sobibór": "sobibór extermination camp"
    },
    {
        " , and ": null
    },
    {
        "Treblinka": "treblinka"
    },
    {
        " , with squads of ": null
    },
    {
        "Trawniki men": "trawniki men"
    },
    {
        " overseeing hundreds of  Sonderkommando  prisoners, who were forced to work in the gas chambers and crematoria before being murdered themselves. On Himmlers orders, by early 1942 the concentration camp at Auschwitz was greatly expanded to include the addition of gas chambers, where victims were killed using the pesticide ": null
    },
    {
        "Zyklon B": "zyklon b"
    },
    {
        ".     For administrative reasons, all concentration camp guards and administrative staff became full members of the Waffen-SS in 1942. The concentration camps were placed under the command of the SS-Wirtschafts-Verwaltungshauptamt  under ": null
    },
    {
        "Oswald Pohl": "oswald pohl"
    },
    {
        ". ": null
    },
    {
        "Richard Glücks": "richard glücks"
    },
    {
        " served as the ": null
    },
    {
        "Inspector of Concentration Camps": "inspector of concentration camps"
    },
    {
        ", which in 1942 became office D under the WVHA. Exploitation and extermination became a balancing act as the military situation deteriorated. The labor needs of the war economy, especially for skilled workers, meant that some Jews escaped the genocide. On 30 October 1942, due to severe labor shortages, Himmler ordered that large numbers of able-bodied people in the Soviet occupied territories should be taken prisoner and sent to Germany as ": null
    },
    {
        "forced labor": "forced labor"
    },
    {
        ".     By 1944, the SS-TV had been organized into three divisions: staff of the concentration camps in Germany and Austria, in the occupied territories, and of the extermination camps in Poland. By 1944, it became standard practice to rotate SS members in and out of the camps, partly based on manpower needs, but also to provide easier assignments to wounded Waffen-SS members. This rotation of personnel meant that nearly the entire SS knew what was going on inside the concentration camps, making the entire organization liable for war crimes and ": null
    },
    {
        "crimes against humanity": "crimes against humanity"
    },
    {
        ".       In 1934, Himmler founded the first SS business venture, Nordland-Verlag, a publishing house that released propaganda material and SS training manuals. Thereafter, he purchased ": null
    },
    {
        "Allach Porcelain": "allach"
    },
    {
        ", which then began to produce SS memorabilia. Because of the labor shortage and a desire for financial gain, the SS started exploiting concentration camp inmates as slave labor. Most of the SS businesses lost money until Himmler placed them under the administration of Pohls Verwaltung und Wirtschaftshauptamt Hauptamt in 1939. Even then, most of the enterprises were poorly run and did not fare well, as SS men were not selected for their business experience, and the workers were starving. In July 1940 Pohl established the  Deutsche Wirtschaftsbetriebe GmbH  , an umbrella corporation under which he took over administration of all SS business concerns. Eventually the SS founded nearly 200 holding companies for their businesses.          In May 1941 the VuWHA founded the Deutsche Ausrüstungswerke GmbH , which was created to integrate the SS business enterprises with the burgeoning concentration camp system. Himmler subsequently established four major new concentration camps in 1941: ": null
    },
    {
        "Auschwitz": "auschwitz concentration camp"
    },
    {
        ", ": null
    },
    {
        "Gross-Rosen": "gross-rosen concentration camp"
    },
    {
        ", ": null
    },
    {
        "Natzweiler-Struthof": "natzweiler-struthof"
    },
    {
        ", and ": null
    },
    {
        "Neuengamme": "neuengamme concentration camp"
    },
    {
        ". Each had at least one factory or quarry nearby where the inmates were forced to work. Himmler took a particular interest in providing laborers for ": null
    },
    {
        "IG Farben": "ig farben"
    },
    {
        ", which was constructing a synthetic rubber factory at ": null
    },
    {
        "Auschwitz III–Monowitz": "monowitz concentration camp"
    },
    {
        ". The plant was almost ready to commence production when it was overrun by Soviet troops in 1945. Life expectancy of inmates at Monowitz averaged about three months. This was typical of the camps, as inmates were underfed and lived under disastrously bad living conditions. Their workload was intentionally made impossibly high, under the policy of ": null
    },
    {
        "extermination through labor": "extermination through labor"
    },
    {
        ".     In 1942, Himmler consolidated all of the offices for which Pohl was responsible into one, creating the SS Main Economic and Administrative Office . The entire concentration camp system was placed under the authority of the WVHA. The SS owned Sudetenquell GbmH, a mineral water producer in ": null
    },
    {
        "Sudetenland": "sudetenland"
    },
    {
        ". By 1944, the SS had purchased 75 percent of the mineral water producers in Germany and were intending to acquire a monopoly. Several concentration camps produced building materials such as stone, bricks, and cement for the SS-owned  Deutsche Erd- und Steinwerke  . In the occupied Eastern territories, the SS acquired a monopoly in brick production by seizing all 300 extant brickworks. The DWB also founded the Ost-Deutsche Baustoffwerke and Deutsche Edelmöbel GmbH . These operated in factories the SS had confiscated from Jews and Poles.     The SS owned experimental farms, bakeries, meat packing plants, leather works, clothing and uniform factories, and small arms factories. Under the direction of the WVHA, the SS sold camp labor to various factories at a rate of three to six  Reichsmark s per prisoner per day. The SS confiscated and sold the property of concentration camp inmates, confiscated their investment portfolios and their cash, and profited from their dead bodies by ": null
    },
    {
        "selling their hair to make felt": "august frank memorandum"
    },
    {
        " and melting down their dental work to obtain gold from the fillings. The total value of assets looted from the victims of ": null
    },
    {
        "Operation Reinhard": "operation reinhard"
    },
    {
        " alone was listed by ": null
    },
    {
        "Odilo Globocnik": "odilo globocnik"
    },
    {
        " as 178,745,960.59 ": null
    },
    {
        "Reichsmark": "reichsmark"
    },
    {
        "s. Items seized included 2,909.68 kilograms of gold worth 843,802.75 RM, as well as 18,733.69  kg of silver, 1,514  kg of platinum, 249,771.50 American dollars, 130 diamond solitaires, 2,511.87 carats of brilliants, 13,458.62 carats of diamonds, and 114  kg of pearls. According to Nazi legislation, Jewish property belonged to the state, but many SS camp commandants and guards stole items such as diamonds or currency for personal gain, or took seized foodstuffs and liquor to sell on the black market.       On 5 July 1943, the Germans launched the ": null
    },
    {
        "Battle of Kursk": "battle of kursk"
    },
    {
        ", an offensive designed to eliminate the ": null
    },
    {
        "Kursk": "kursk"
    },
    {
        " salient. The Waffen-SS by this time had been expanded to 12 divisions, and most took part in the battle. Due to stiff Soviet resistance, Hitler halted the attack by the evening of 12 July. On 17 July he called off the operation and ordered a withdrawal. Thereafter, the Germans were forced onto the defensive as the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " began the liberation of Western Russia. The losses incurred by the Waffen-SS and the Wehrmacht during the Battle of Kursk occurred nearly simultaneously with the ": null
    },
    {
        "Allied assault into Italy": "italian campaign"
    },
    {
        ", opening a two-front war for Germany.            Alarmed by the raids on ": null
    },
    {
        "St Nazaire": "st nazaire raid"
    },
    {
        " and ": null
    },
    {
        "Dieppe": "dieppe raid"
    },
    {
        " in 1942, Hitler had ordered the construction of fortifications he called the ": null
    },
    {
        "Atlantic Wall": "atlantic wall"
    },
    {
        " all along the Atlantic coast, from Spain to Norway, to protect against an expected Allied invasion. Concrete gun emplacements were constructed at strategic points along the coast, and wooden stakes, metal tripods, mines, and large anti-tank obstacles were placed on the beaches to delay the approach of landing craft and impede the movement of tanks. In addition to several static infantry divisions, eleven panzer and Panzergrenadier divisions were deployed nearby. Four of these formations were Waffen-SS divisions. In addition, the SS-Das Reich was located in ": null
    },
    {
        "Southern France": "southern france"
    },
    {
        ", the LSSAH was in Belgium refitting after fighting in the Soviet Union, and the newly formed panzer division  SS-Hitlerjugend , consisting of 17- and 18-year-old ": null
    },
    {
        "Hitler Youth": "hitler youth"
    },
    {
        " members supported by combat veterans and experienced ": null
    },
    {
        "NCO": "non-commissioned officer"
    },
    {
        "s, was stationed west of Paris. The creation of the SS-Hitlerjugend was a sign of Hitlers desperation for more troops, especially ones with unquestioning obedience.     The ": null
    },
    {
        "Normandy landings": "normandy landings"
    },
    {
        " took place beginning 6 June 1944. ": null
    },
    {
        "21st Panzer Division": "21st panzer division"
    },
    {
        " under Generalmajor ": null
    },
    {
        "Edgar Feuchtinger": "edgar feuchtinger"
    },
    {
        ", positioned south of ": null
    },
    {
        "Caen": "caen"
    },
    {
        ", was the only panzer division close to the beaches. The division included 146 tanks and 50 ": null
    },
    {
        "assault gun": "assault gun"
    },
    {
        "s, plus supporting infantry and artillery. At 02:00, Generalleutnant Wilhelm Richter, commander of the ": null
    },
    {
        "716th Static Infantry Division": "716th static infantry division"
    },
    {
        ", ordered 21st Panzer Division into position to counter-attack. However, as the division was part of the armoured reserve, Feuchtinger was obliged to seek clearance from ": null
    },
    {
        "OKW": "okw"
    },
    {
        " before he could commit his formation. Feuchtinger did not receive orders until nearly 09:00, but in the meantime on his own initiative he put together a battle group to fight the British forces east of the ": null
    },
    {
        "Orne": "orne"
    },
    {
        ". SS-Hitlerjugend began to deploy in the afternoon of 6 June, with its units undertaking defensive actions the following day. They also took part in the ": null
    },
    {
        "Battle for Caen": "battle for caen"
    },
    {
        " . On 7–8 and 17 June, members of the SS-Hitlerjugend shot and killed twenty Canadian prisoners of war in the ": null
    },
    {
        "Ardenne Abbey massacre": "ardenne abbey massacre"
    },
    {
        ".     The Allies continued to make progress in the liberation of France, and on 4 August Hitler ordered a counter-offensive  from ": null
    },
    {
        "Vire": "vire"
    },
    {
        " towards ": null
    },
    {
        "Avranches": "avranches"
    },
    {
        ". The operation included LSSAH, Das Reich, ": null
    },
    {
        "2nd": "2nd panzer division"
    },
    {
        ", and ": null
    },
    {
        "116th Panzer Divisions": "116th panzer division"
    },
    {
        ", with support from infantry and elements of the ": null
    },
    {
        "17th SS Panzergrenadier Division Götz von Berlichingen": "17th ss panzergrenadier division götz von berlichingen"
    },
    {
        " under ": null
    },
    {
        "SS-Oberstgruppenführer": "ss-oberst-gruppenführer"
    },
    {
        " Paul Hausser": "paul hausser"
    },
    {
        ". These forces were to mount an offensive near ": null
    },
    {
        "Mortain": "mortain"
    },
    {
        " and drive west through Avranches to the coast. The Allied forces were prepared for this offensive, and an air assault on the combined German units proved devastating. On 21 August, 50,000 German troops, including most of the LSSAH, were encircled by the Allies in the ": null
    },
    {
        "Falaise Pocket": "falaise pocket"
    },
    {
        ". Remnants of the LSSAH which escaped were withdrawn to Germany for refitting. ": null
    },
    {
        "Paris was liberated": "liberation of paris"
    },
    {
        " on 25 August, and the last of the German forces withdrew over the ": null
    },
    {
        "Seine": "seine"
    },
    {
        " by the end of August, ending the Normandy campaign.       Waffen-SS units which had survived the summer campaigns were withdrawn from the front line to refit. Two of them, the ": null
    },
    {
        "9th SS": "9th ss panzer division hohenstaufen"
    },
    {
        " and ": null
    },
    {
        "10th SS Panzer Divisions": "10th ss panzer division frundsberg"
    },
    {
        ", did so in the ": null
    },
    {
        "Arnhem": "arnhem"
    },
    {
        " region of Holland in early September 1944. Coincidentally, on 17 September, the Allies launched in the same area ": null
    },
    {
        "Operation Market Garden": "operation market garden"
    },
    {
        ", a combined airborne and land operation designed to seize control of the lower ": null
    },
    {
        "Rhine": "rhine"
    },
    {
        ". The 9th and 10th Panzers were among the units that repulsed the attack.        In December 1944, Hitler launched the Ardennes Offensive, also known as the ": null
    },
    {
        "Battle of the Bulge": "battle of the bulge"
    },
    {
        ", a significant counterattack against the western Allies through the Ardennes with the aim of reaching ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        " while encircling the Allied armies in the area. The offensive began with an artillery barrage shortly before dawn on 16 December. Spearheading the attack were two panzer armies composed largely of Waffen-SS divisions. The battle groups found advancing through the forests and wooded hills of the Ardennes difficult in the winter weather, but they initially made good progress in the northern sector. They soon encountered strong resistance from the US ": null
    },
    {
        "2nd": "2nd infantry division"
    },
    {
        " and ": null
    },
    {
        "99th Infantry Divisions": "99th infantry division"
    },
    {
        ". By 23 December, the weather improved enough for Allied air forces to attack the German forces and their supply columns, causing fuel shortages. In increasingly difficult conditions, the German advance slowed and was stopped. Hitlers failed offensive cost 700 tanks and most of their remaining mobile forces in the west, as well as most of their irreplaceable reserves of manpower and materiel.     During the battle, SS-Obersturmbannführer ": null
    },
    {
        "Joachim Peiper": "joachim peiper"
    },
    {
        " left a path of destruction, which included Waffen-SS soldiers under his command murdering American ": null
    },
    {
        "POWs": "pow"
    },
    {
        "and unarmed Belgian civilians in the ": null
    },
    {
        "Malmedy massacre": "malmedy massacre"
    },
    {
        ". Captured SS soldiers who were part of Kampfgruppe Peiper were tried during the ": null
    },
    {
        "Malmedy massacre trial": "malmedy massacre trial"
    },
    {
        " following the war for this massacre and several others in the area. Many of the perpetrators were sentenced to hang, but the sentences were commuted. Peiper was imprisoned for eleven years for his role in the killings.          In the east, the Red Army resumed their offensive on 12 January 1945. German forces were outnumbered twenty to one in aircraft, eleven to one in infantry, and seven to one in tanks on the Eastern Front. By the end of the month, the Red Army had made bridgeheads across the ": null
    },
    {
        "Oder": "oder"
    },
    {
        ", the last geographic obstacle before Berlin. The western Allies continued to advance as well, but not as rapidly as the Red Army. The Panzer Corps conducted a successful defensive operation on 17–24 February at the ": null
    },
    {
        "Hron": "hron"
    },
    {
        " River, stalling the Allied advance towards Vienna. The ": null
    },
    {
        "1st": "i ss panzer corps"
    },
    {
        " and ": null
    },
    {
        "2nd SS Panzer Corps": "ii ss panzer corps"
    },
    {
        " made their way towards Austria, but were slowed by damaged railways.     Budapest fell on 13 February. Hitler ordered Dietrichs ": null
    },
    {
        "6th Panzer Army": "6th panzer army"
    },
    {
        " to move into Hungary to protect the ": null
    },
    {
        "Nagykanizsa": "nagykanizsa"
    },
    {
        " oilfields and refineries, which he deemed the most strategically valuable fuel reserves on the Eastern Front. Frühlingserwachsen , the final German offensive in the east, took place in early March. German forces attacked near Lake Balaton, with 6th Panzer Army advancing north towards Budapest and 2nd Panzer Army moving east and south. Dietrichs forces at first made good progress, but as they drew near the Danube, the combination of muddy terrain and strong Soviet resistance brought them to a halt. By 16 March the battle was lost. Enraged by the defeat, Hitler ordered the Waffen-SS units involved to remove their ": null
    },
    {
        "cuff titles": "cuff title"
    },
    {
        "as a mark of disgrace. Dietrich refused to carry out the order.     By this time, on both the Eastern and Western Front, the activities of the SS were becoming clear to the Allies, as the concentration and extermination camps were being overrun. Allied troops were filled with disbelief and repugnance at the evidence of Nazi brutality in the camps.     On 9 April 1945 ": null
    },
    {
        "Königsberg": "königsberg"
    },
    {
        " fell to the Red Army, and on 13 April Dietrichs SS unit was forced out of Vienna. The ": null
    },
    {
        "Battle of Berlin": "battle of berlin"
    },
    {
        " began at 03:30 on 16 April with a massive artillery barrage. Within the week, fighting was taking place inside the city. Among the many elements defending Berlin were French, Latvian, and Scandinavian Waffen-SS troops. Hitler, now living in the  Führerbunker  under the Reich Chancellery, still hoped that his remaining SS soldiers could rescue the capital. In spite of the hopelessness of the situation, members of the SS patrolling the city continued to shoot or hang soldiers and civilians for what they considered to be acts of cowardice or defeatism. The Berlin garrison surrendered on 2 May, two days after ": null
    },
    {
        "Hitler committed suicide": "death of adolf hitler"
    },
    {
        ". As members of SS expected little mercy from the Red Army, they attempted to move westward to surrender to the western Allies instead.           Heydrich held the title of Chef der Sicherheitspolizei und des SD until 27 September 1939, when he became chief of the newly established ": null
    },
    {
        "Reich Main Security Office": "reich main security office"
    },
    {
        " . From that point forward, the RSHA was in charge of SS security services. It had under its command the SD, Kripo, and Gestapo, as well as several offices to handle finance, administration, and supply. ": null
    },
    {
        "Heinrich Müller": "heinrich müller"
    },
    {
        ", who had been chief of operations for the Gestapo, was appointed Gestapo chief at this time. ": null
    },
    {
        "Arthur Nebe": "arthur nebe"
    },
    {
        " was chief of the Kripo, and the two branches of SD were commanded by a series of SS officers, including ": null
    },
    {
        "Otto Ohlendorf": "otto ohlendorf"
    },
    {
        " and ": null
    },
    {
        "Walter Schellenberg": "walter schellenberg"
    },
    {
        ". The SD was considered an elite branch of the SS, and its members were better educated and typically more ambitious than those within the ranks of the Allgemeine SS. Members of the SD were specially trained in criminology, intelligence, and counter-intelligence. They also gained a reputation for ruthlessness and unwavering commitment to Nazi ideology.     Heydrich was attacked in Prague on 27 May 1942 by a British-trained team of Czech and Slovak soldiers who had been sent by the ": null
    },
    {
        "Czechoslovak government-in-exile": "czechoslovak government-in-exile"
    },
    {
        " to kill him in ": null
    },
    {
        "Operation Anthropoid": "operation anthropoid"
    },
    {
        ". He died from his injuries a week later. Himmler ran the RSHA personally until 30 January 1943, when Heydrichs positions were taken over by ": null
    },
    {
        "Ernst Kaltenbrunner": "ernst kaltenbrunner"
    },
    {
        ".     SS-SonderkommandosSS-Sonderkommandos, to carry out special tasks, including large-scale murder operations. The use of SS-Sonderkommandos was widespread. According to former SS Sturmbannführer  ": null
    },
    {
        "Wilhelm Höttl": "wilhelm höttl"
    },
    {
        ", not even the SS leadership knew how many SS-Sonderkommandos were constantly being formed, disbanded, and reformed for various tasks, especially on the Eastern Front.     An SS-Sonderkommando unit led by SS-Sturmbannführer ": null
    },
    {
        "Herbert Lange": "herbert lange"
    },
    {
        " murdered 1,201 psychiatric patients at the ": null
    },
    {
        "Tiegenhof": "tiegenhof"
    },
    {
        " psychiatric hospital in the ": null
    },
    {
        "Free City of Danzig": "free city of danzig"
    },
    {
        ", 1,100 patients in ": null
    },
    {
        "Owińska": "owińska"
    },
    {
        ", 2,750 patients at ": null
    },
    {
        "Kościan": "kościan"
    },
    {
        ", and 1,558 patients at ": null
    },
    {
        "Działdowo": "działdowo"
    },
    {
        ", as well as hundreds of Poles at ": null
    },
    {
        "Fort VII": "fort vii"
    },
    {
        ", where the mobile gas van and gassing bunker were developed. In 1941–42, SS-Sonderkommando Lange set up and managed the first extermination camp, at ": null
    },
    {
        "Chełmno": "chełmno extermination camp"
    },
    {
        ", where 152,000 Jews were killed using gas vans.     After the ": null
    },
    {
        "battle of Stalingrad": "battle of stalingrad"
    },
    {
        " in February 1943, Himmler realised that Germany would likely lose the war, and ordered the formation of ": null
    },
    {
        "Sonderkommando 1005": "sonderaktion 1005"
    },
    {
        ", a special task force under SS- Standartenführer  ": null
    },
    {
        "Paul Blobel": "paul blobel"
    },
    {
        ". The units assignment was to visit mass graves on the Eastern Front to exhume bodies and burn them in an attempt to cover up the genocide. The task remained unfinished at the end of the war, and many mass graves remain unmarked and unexcavated.     The Eichmann Sonderkommando was a task force headed by ": null
    },
    {
        "Adolf Eichmann": "adolf eichmann"
    },
    {
        " that arrived in Budapest on 19 March 1944, the same day that ": null
    },
    {
        "Axis forces invaded Hungary": "operation margarethe"
    },
    {
        ". Their task was to take a direct role in the deportation of Hungarian Jews to Auschwitz. The SS-Sonderkommandos enlisted the aid of ": null
    },
    {
        "antisemitic": "antisemitic"
    },
    {
        " elements from the Hungarian gendarmerie and pro-German administrators from within the Hungarian Interior Ministry. Round-ups began on 16 April, and from 14 May, four trains of 3,000 Jews per day left Hungary and travelled to the camp at Auschwitz II-Birkenau, arriving along a newly built spur line that terminated a few hundred metres from the gas chambers. Between 10 and 25 percent of the people on each train were chosen as forced laborers; the rest were killed within hours of arrival. Under international pressure, the Hungarian government halted deportations on 6 July 1944, by which time over 437,000 of Hungarys 725,000 Jews had died.     Einsatzgruppen     The  Einsatzgruppen  had its origins in the ad hoc Einsatzkommando formed by Heydrich following the  Anschluss  in Austria in March 1938. Two units of Einsatzgruppen were stationed in the ": null
    },
    {
        "Sudetenland": "sudetenland"
    },
    {
        " in October 1938. When military action turned out not to be necessary because of the ": null
    },
    {
        "Munich Agreement": "munich agreement"
    },
    {
        ", the Einsatzgruppen were assigned to confiscate government papers and police documents. They secured government buildings, questioned senior civil servants, and arrested as many as 10,000 Czech communists and German citizens. The Einsatzgruppen also followed Wehrmacht troops and killed potential partisans. Similar groups were used in 1939 for the ": null
    },
    {
        "occupation of Czechoslovakia": "german occupation of czechoslovakia"
    },
    {
        ".     Hitler felt that the planned extermination of the Jews was too difficult and important to be entrusted to the military. In 1941 the Einsatzgruppen were sent into the Soviet Union to begin large-scale genocide of Jews, ": null
    },
    {
        "Romani people": "romani people"
    },
    {
        ", and communists. Historian ": null
    },
    {
        "Raul Hilberg": "raul hilberg"
    },
    {
        " estimates that between 1941 and 1945 the Einsatzgruppen and related agencies killed more than two million people, including 1.3 million Jews. The largest mass shooting perpetrated by the Einsatzgruppen was at ": null
    },
    {
        "Babi Yar": "babi yar"
    },
    {
        " outside ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        ", where 33,771 Jews were killed in a single operation on 29–30 September 1941. In the ": null
    },
    {
        "Rumbula massacre": "rumbula massacre"
    },
    {
        " , 25,000 victims from the ": null
    },
    {
        "Riga ghetto": "riga ghetto"
    },
    {
        " were killed. Another mass shooting early in 1942 claimed the lives of over 10,000 Jews in ": null
    },
    {
        "Kharkov": "kharkov"
    },
    {
        ".     The last Einsatzgruppen were disbanded in mid-1944 due to the German retreat on both fronts and the consequent inability to continue extermination activities. Former Einsatzgruppen members were either assigned duties in the Waffen-SS or concentration camps. Twenty-four Einsatzgruppen commanders were tried for war crimes following the war.       The ": null
    },
    {
        "SS Court Main Office": "ss court main office"
    },
    {
        "  was an internal legal system for conducting investigations, trials, and punishment of the SS and police. It had more than 600 lawyers on staff in the main offices in Berlin and Munich. Proceedings were conducted at 38 regional SS courts throughout Germany. It was the only authority authorized to try SS personnel, except for SS members who were on active duty in the Wehrmacht . Its creation placed the SS beyond the reach of civilian legal authority. Himmler personally intervened as he saw fit regarding convictions and punishment. The historian ": null
    },
    {
        "Karl Dietrich Bracher": "karl dietrich bracher"
    },
    {
        " describes this court system as one factor in the creation of the Nazi totalitarian police state, as it removed objective legal procedures, rendering citizens defenseless against the summary justice of the SS terror.        Shortly after Hitler seized power in 1933, most horse riding associations were taken over by the SA and SS. Members received combat training to serve in the Reiter-SS . The first SS cavalry regiment, designated SS-Totenkopf Reitstandarte 1, was formed in September 1939. Commanded by then SS-Standartenführer ": null
    },
    {
        "Hermann Fegelein": "hermann fegelein"
    },
    {
        ", the unit was assigned to Poland, where they took part in the extermination of Polish intelligentsia. Additional squadrons were added in May 1940, for a total of fourteen.     The unit was split into two regiments in December 1939, with Fegelein in charge of both. By March 1941 their strength was 3,500 men. In July 1941, they were assigned to the ": null
    },
    {
        "Pripyat swamps punitive operation": "pripyat swamps"
    },
    {
        ", tasked with rounding up and exterminating Jews and partisans. The two regiments were amalgamated into the ": null
    },
    {
        "SS Cavalry Brigade": "ss cavalry brigade"
    },
    {
        " on 31 July, twelve days after the operation started. Fegeleins final report, dated 18 September 1941, states that they killed 14,178 Jews, 1,001 partisans, and 699 Red Army soldiers, with 830 prisoners taken. The historian Henning Pieper estimates the actual number of Jews killed was closer to 23,700. The SS Cavalry Brigade took serious losses in November 1941 in the ": null
    },
    {
        "Battle of Moscow": "battle of moscow"
    },
    {
        ", with casualties of up to 60 per cent in some squadrons. Fegelein was appointed as commander of the ": null
    },
    {
        "8th SS Cavalry Division Florian Geyer": "8th ss cavalry division florian geyer"
    },
    {
        " on 20 April 1943. This unit saw service in the Soviet Union in attacks on partisans and civilians. In addition, SS Cavalry regiments served in Croatia and Hungary.             The SS Medical Corps were initially known as the Sanitätsstaffel . After 1931, the SS formed the headquarters office Amt  V as the central office for SS medical units. An SS medical academy was established in Berlin in 1938 to train Waffen-SS physicians. SS medical personnel did not often provide actual medical care; their primary responsibility was medicalized genocide. At Auschwitz, about three-quarters of new arrivals, including almost all children, women with small children, all the elderly, and all those who appeared on brief and superficial inspection by an SS doctor not to be completely fit were killed within hours of arrival. In their role as Desinfektoren , SS doctors also made selections among existing prisoners as to their fitness to work, and supervised the killing of those deemed unfit. Inmates in deteriorating health were examined by SS doctors, who decided whether or not they would be able to recover in less than two weeks. Those too ill or injured to recover in that time frame were killed.     At Auschwitz, the actual delivery of gas to the victims was always handled by the SS, on the order of the supervising SS doctor. Many of the SS doctors also conducted inhumane medical experiments on camp prisoners. The most infamous SS doctor, ": null
    },
    {
        "Josef Mengele": "josef mengele"
    },
    {
        ", served as a medical officer at Auschwitz under the command of ": null
    },
    {
        "Eduard Wirths": "eduard wirths"
    },
    {
        " of the camps medical corps. Mengele undertook selections even when he was not assigned to do so in the hope of finding subjects for his experiments. He was particularly interested in locating sets of twins. In contrast to most of the doctors, who viewed undertaking selections as one of their most stressful and horrible duties, Mengele undertook the task with a flamboyant air, often smiling or whistling a tune. After the war, many SS doctors were charged with war crimes for their inhumane medical experiments and for their role in gas chamber selections.       Ahnenerbe Ahnenerbe  was founded in 1935 by Himmler, and became part of the SS in 1939. It was an umbrella agency for more than fifty organizations tasked with studying the German racial identity and ancient Germanic traditions and language. The agency sponsored archaeological expeditions in Germany, Scandinavia, the Middle East, Tibet, and elsewhere to search for evidence of Aryan roots, influence, and superiority. Further planned expeditions were postponed indefinitely at the start of the war.     SS-FrauenkorpsSS-Frauenkorps was an auxiliary reporting and clerical unit, which included the SS-Helferinnenkorps , made up of female volunteers. Members were assigned as administrative staff and supply personnel, and served in command positions and as guards at womens concentration camps. While female concentration and extermination camp guards were civilian employees of the SS, the SS-Helferinnen who completed training at the Reichsschule für SS-Helferinnen in Oberehnheim were members of the Waffen-SS. Like their male equivalents in the SS, females participated in atrocities against Jews, Poles, and others.     In 1942, Himmler set up the Reichsschule für SS Helferinnen in ": null
    },
    {
        "Oberehnheim": "oberehnheim"
    },
    {
        " to train women in communications so that they could free up men for combat roles. Himmler also intended to replace all female civilian employees in his service with SS-Helferinnen members, as they were selected and trained according to Nazi ideology. The school was closed on 22 November 1944 due to the Allied advance.     SS-MannschaftenSS-Mannschaften were not considered regular SS members, but were conscripted from other branches of the German military, the NSDAP, SA, and the  Volkssturm  for service in concentration camps and extermination camps.          Beginning in 1940, Himmler opened up Waffen-SS recruiting to ethnic Germans that were not German citizens. In March 1941, the SS Main Office established the Germanische Leitstelle to establish Waffen-SS recruiting offices in Nazi-occupied Europe. The majority of the resulting foreign Waffen-SS units wore a distinctive national collar patch and preceded their SS rank titles with the prefix Waffen instead of SS. Volunteers from Scandinavian countries filled the ranks of two divisions, the SS-Wiking and  SS-Nordland . Swiss German speakers joined in substantial numbers. Belgian Flemings joined Dutchmen to form the  SS-Nederland  legion, and their Walloon compatriots joined the  SS-Wallonien . By the end of 1943 about a quarter of the SS were ethnic Germans from across Europe, and by June 1944, half the Waffen-SS were foreign nationals.        Additional Waffen-SS units were added from the ": null
    },
    {
        "Ukrainians": "ukrainian collaborationism with the axis powers"
    },
    {
        ", ": null
    },
    {
        "Albanians": "21st waffen mountain division of the ss skanderbeg"
    },
    {
        " from ": null
    },
    {
        "Kosovo": "kosovo"
    },
    {
        ", Serbians, Croatians, ": null
    },
    {
        "Turkic, Caucasians, Cossack": "turkic, caucasian, cossack, and crimean collaborationism with the axis powers"
    },
    {
        ", and Tatars. The Ukrainians and Tatars, who had suffered persecution under ": null
    },
    {
        "Stalin": "stalin"
    },
    {
        ", were likely motivated primarily by opposition to the Soviet government rather than ideological agreement with the SS. The exiled Grand Mufti of Jerusalem ": null
    },
    {
        "Amin al-Husseini": "amin al-husseini"
    },
    {
        " was made an SS-Gruppenführer by Himmler in May 1943. He subsequently used antisemitism and anti-Serb racism to recruit a Waffen-SS division of ": null
    },
    {
        "Bosnian Muslims": "bosnian muslims"
    },
    {
        ", the  SS-Handschar . The year-long Soviet ": null
    },
    {
        "occupation of the Baltic states": "occupation of the baltic states"
    },
    {
        " at the beginning of World War II resulted in volunteers for ": null
    },
    {
        "Latvia": "latvia"
    },
    {
        "n and ": null
    },
    {
        "Estonia": "estonia"
    },
    {
        "n Waffen-SS units. The ": null
    },
    {
        "Estonian Legion": "estonian legion"
    },
    {
        " had 1,280 volunteers under training by the end of 1942. Approximately 25,000 men served in the Estonian SS division, with thousands more conscripted into Police Front battalions and border guard units. Most of the Estonians were fighting primarily to regain their independence and as many as 15,000 of them died fighting alongside the Germans. In early 1944, Himmler even contacted Pohl to suggest releasing Muslim prisoners from concentration camps to supplement his SS troops.     The ": null
    },
    {
        "Indian Legion": "indian legion"
    },
    {
        " was a Wehrmacht unit formed in August 1942 chiefly from disaffected Indian soldiers of the ": null
    },
    {
        "British Indian Army": "british indian army"
    },
    {
        " captured in the ": null
    },
    {
        "North African Campaign": "north african campaign"
    },
    {
        ". In August 1944 it was transferred to the auspices of the Waffen-SS as the Indische Freiwilligen-Legion der Waffen-SS. There was also a French volunteer division,  SS-Charlemagne , which was formed in 1944 mainly from the remnants of the ": null
    },
    {
        "Legion of French Volunteers Against Bolshevism": "legion of french volunteers against bolshevism"
    },
    {
        " and French Sturmbrigade.             The SS established its own symbolism, rituals, customs, ranks and uniforms to set itself apart from other organizations. Before 1929, the SS wore the same brown uniform as the SA, with the addition of a black tie and a black cap with a  Totenkopf  skull and bones symbol, moving to an all-black uniform in 1932. In 1935, the SS combat formations adopted a service uniform in field grey for everyday wear. The SS also developed its own field uniforms, which included reversible smocks and helmet covers printed with ": null
    },
    {
        "camouflage": "camouflage"
    },
    {
        " patterns. Uniforms were manufactured in hundreds of licensed factories, with some workers being prisoners of war performing forced labor. Many were produced in concentration camps.     Hitler and the NSDAP understood the power of emblems and insignia to influence public opinion. The stylized lightning bolt logo of the SS was chosen in 1932. The logo is a pair of runes from a set of 18 ": null
    },
    {
        "Armanen runes": "armanen runes"
    },
    {
        " created by ": null
    },
    {
        "Guido von List": "guido von list"
    },
    {
        " in 1906. It is similar to the ancient ": null
    },
    {
        "Sowilō": "sowilō"
    },
    {
        " rune, which symbolizes the sun, but was renamed as Sig in Lists iconography. The Totenkopf symbolized the wearers willingness to fight unto the death, and also served to frighten the enemy.       After 1933 a career in the SS became increasingly attractive to Germanys social elite, who began joining the movement in great numbers, usually motivated by political opportunism. By 1938 about one-third of the SS leadership were members of the ": null
    },
    {
        "upper middle class": "upper middle class"
    },
    {
        ". The trend reversed after the first Soviet counter-offensive of 1942.   :       By 1942 all activities of the SS were managed through twelve main offices. ": null
    },
    {
        "Personal Staff Reichsführer-SS": "personal staff reichsführer-ss"
    },
    {
        " SS Main Office": "ss main office"
    },
    {
        "    SS-Führungshauptamt    ": null
    },
    {
        "Reich Main Security Office": "reich main security office"
    },
    {
        "   SS Main Economic and Administrative Office": "ss main economic and administrative office"
    },
    {
        "    Ordnungspolizei Hauptamt    ": null
    },
    {
        "SS Court Main Office": "ss court main office"
    },
    {
        " SS Race and Settlement Main Office": "ss race and settlement main office"
    },
    {
        "   SS Personnel Main Office": "ss personnel main office"
    },
    {
        "  Hauptamt Volksdeutsche Mittelstelle    ": null
    },
    {
        "SS Education Office": "ss education office"
    },
    {
        " Reich Commissioner for the Consolidation of German Nationhood": "reich commissioner for the consolidation of german nationhood"
    },
    {
        "             The term Austrian SS is often used to describe that portion of the SS membership from Austria, but it was never a recognized branch of the SS. In contrast to SS members from other countries, who were grouped into either the Germanic-SS or the Foreign Legions of the Waffen-SS, Austrian SS members were regular SS personnel. It was technically under the command of the SS in Germany, but often acted independently concerning Austrian affairs. The Austrian SS was founded in 1930 and by 1934 was acting as a covert force to bring about the  Anschluss  with Germany, which occurred in March 1938. Early Austrian SS leaders were Kaltenbrunner and ": null
    },
    {
        "Arthur Seyss-Inquart": "arthur seyss-inquart"
    },
    {
        ". Austrian SS members served in every branch of the SS. Political scientist David Art of ": null
    },
    {
        "Tufts University": "tufts university"
    },
    {
        " notes that Austrians constituted 8 percent of the Third Reichs population and 13 percent of the SS; he states that 40 percent of the staff and 75 percent of commanders at death camps were Austrian.     After the Anschluss, the Austrian SS was folded into  SS-Oberabschnitt Donau . The third regiment of the SS-Verfügungstruppe  and the fourth Totenkopf regiment  were recruited in Austria shortly thereafter. On Heydrichs orders, mass arrests of potential enemies of the Reich began immediately after the Anschluss. ": null
    },
    {
        "Mauthausen": "mauthausen-gusen concentration camp"
    },
    {
        " was the first concentration camp opened in Austria following the Anschluss. Before the invasion of the Soviet Union, Mauthausen was the harshest of the camps in the Greater German Reich.     The ": null
    },
    {
        "Hotel Metropole": "hotel metropole, vienna"
    },
    {
        " was transformed into Gestapo headquarters in Vienna in April 1938. With a staff of 900 , it was the largest Gestapo office outside Berlin. An estimated 50,000 people were interrogated or tortured there. The Gestapo in Vienna was headed by ": null
    },
    {
        "Franz Josef Huber": "franz josef huber"
    },
    {
        ", who also served as chief of the ": null
    },
    {
        "Central Agency for Jewish Emigration in Vienna": "central agency for jewish emigration in vienna"
    },
    {
        ". Although its de facto leaders were ": null
    },
    {
        "Adolf Eichmann": "adolf eichmann"
    },
    {
        " and later ": null
    },
    {
        "Alois Brunner": "alois brunner"
    },
    {
        ", Huber was nevertheless responsible for the mass deportation of Austrian Jews.          Following Nazi Germanys collapse, the SS ceased to exist. Numerous members of the SS, many of them still committed Nazis, remained at large in Germany and across Europe. On 21 May 1945, the British captured Himmler, who was in disguise and using a false passport. At an internment camp near ": null
    },
    {
        "Lüneburg": "lüneburg"
    },
    {
        ", he committed suicide by biting down on a cyanide capsule. Several other leading members of the SS fled, but some were quickly captured. Kaltenbrunner, chief of the RSHA and the highest-ranking surviving SS main department chief upon Himmlers suicide, was captured and arrested in the ": null
    },
    {
        "Bavarian Alps": "bavarian alps"
    },
    {
        ". He was among the 24 defendants put on trial at the ": null
    },
    {
        "International Military Tribunal": "international military tribunal"
    },
    {
        " in 1945–46.     Some SS members were subject to summary execution, torture, and beatings at the hands of freed prisoners, displaced persons, or Allied soldiers. American soldiers of the 157th Regiment, who entered the concentration camp at Dachau in April 1945 and saw the human deprivation and cruelty committed by the SS, ": null
    },
    {
        "shot some of the remaining SS camp guards": "dachau liberation reprisals"
    },
    {
        ". On 15 April 1945, British troops entered Bergen-Belsen. They placed the SS guards on starvation rations, made them work without breaks, forced them to deal with the remaining corpses, and stabbed them with bayonets or struck them with their rifle butts if they slowed their pace. Some members of the ": null
    },
    {
        "US Army Counter Intelligence Corps": "us army counter intelligence corps"
    },
    {
        " delivered captured SS camp guards to displaced persons camps, where they knew they would be subject to summary execution.             The Allies commenced legal proceedings against captured Nazis, establishing the International Military Tribunal at Nuremberg in 1945. The first ": null
    },
    {
        "war crimes": "war crimes"
    },
    {
        " trial of 24 prominent figures such as ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        ", ": null
    },
    {
        "Albert Speer": "albert speer"
    },
    {
        ", ": null
    },
    {
        "Joachim von Ribbentrop": "joachim von ribbentrop"
    },
    {
        ", ": null
    },
    {
        "Alfred Rosenberg": "alfred rosenberg"
    },
    {
        ", ": null
    },
    {
        "Hans Frank": "hans frank"
    },
    {
        ", and Kaltenbrunner took place beginning in November 1945. They were accused of four counts: conspiracy, waging a war of aggression, war crimes, and crimes against humanity in violation of international law. Twelve received the death penalty, including Kaltenbrunner, who was convicted of crimes against humanity and executed on 16 October 1946. The former commandant at Auschwitz, ": null
    },
    {
        "Rudolf Höss": "rudolf höss"
    },
    {
        ", who testified on behalf of Kaltenbrunner and others, was tried and executed in 1947.     Additional SS trials and convictions followed. Many defendants attempted to exculpate themselves using the excuse that they were merely following ": null
    },
    {
        "superior orders": "superior orders"
    },
    {
        ", which they had to obey unconditionally as part of their sworn oath and duty. The courts did not find this to be a legitimate defense. A trial of 40 SS officers and guards from Auschwitz took place in Kraków in November 1947. Most were found guilty, and 23 received the death penalty. In addition to those tried by the Western allies, an estimated 37,000 members of the SS were tried and convicted in Soviet courts. Sentences included hangings and long terms of hard labor. ": null
    },
    {
        "Piotr Cywiński": "piotr cywiński"
    },
    {
        ", the director of the Auschwitz-Birkenau Museum, estimates that of the 70,000 members of the SS involved in crimes in concentration camps, only about 1,650 to 1,700 were tried after the war. The International Military Tribunal declared the SS a criminal organization in 1946.               After the war, many former Nazis fled to South America, especially to Argentina, where they were welcomed by ": null
    },
    {
        "Juan Peróns": "juan perón"
    },
    {
        "regime. In the 1950s, former Dachau inmate Lothar Hermann discovered that ": null
    },
    {
        "Buenos Aires": "buenos aires"
    },
    {
        " resident Ricardo Klement was in fact Adolf Eichmann, who had in 1948 obtained false identification and a landing permit for Argentina through an organization directed by Bishop ": null
    },
    {
        "Alois Hudal": "alois hudal"
    },
    {
        ", an Austrian cleric with Nazi sympathies, then residing in Italy. Eichmann was captured in Buenos Aires on 11 May 1960 by ": null
    },
    {
        "Mossad": "mossad"
    },
    {
        ", the ": null
    },
    {
        "Israel": "israel"
    },
    {
        "i intelligence agency. At his trial in Jerusalem in 1961, he was found guilty and sentenced to death by hanging. Eichmann was quoted as having stated, I will jump into my grave laughing, because the fact that I have the death of five million Jews on my conscience gives me extraordinary satisfaction.  ": null
    },
    {
        "Franz Stangl": "franz stangl"
    },
    {
        ", the commandant of Treblinka, also escaped to South America with the assistance of Hudals network. He was deported to Germany in 1967 and was sentenced to life in prison in 1970. He died in 1971.     Mengele, worried that his capture would mean a death sentence, fled Germany on 17 April 1949. Assisted by a network of former SS members, he traveled to ": null
    },
    {
        "Genoa": "genoa"
    },
    {
        ", where he obtained a passport under the alias Helmut Gregor from the ": null
    },
    {
        "International Committee of the Red Cross": "international committee of the red cross"
    },
    {
        ". He sailed to Argentina in July. Aware that he was still a wanted man, he moved to Paraguay in 1958 and Brazil in 1960. In both instances he was assisted by former ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        " pilot ": null
    },
    {
        "Hans-Ulrich Rudel": "hans-ulrich rudel"
    },
    {
        ". Mengele suffered a stroke while swimming and drowned in 1979.     Thousands of Nazis, including former SS members such as Trawniki guard ": null
    },
    {
        "Jakob Reimer": "jakob reimer"
    },
    {
        " and Circassian collaborator ": null
    },
    {
        "Tscherim Soobzokov": "tscherim soobzokov"
    },
    {
        ", fled to the United States under the guise of refugees, sometimes using forged documents. Other SS men, such as Soobzokov, SD officer ": null
    },
    {
        "Wilhelm Höttl": "wilhelm höttl"
    },
    {
        ", Eichmann aide ": null
    },
    {
        "Otto von Bolschwing": "otto von bolschwing"
    },
    {
        ", and accused war criminal Theodor Saevecke, were employed by American intelligence agencies against the Soviets. As CIA officer Harry Rositzke noted, It was a visceral business of using any bastard so long as he was anti-Communist  ... The eagerness or desire to enlist collaborators means that sure, you didnt look at their credentials too closely.  Similarly, the Soviets used SS personnel after the war; Operation Theo, for instance, disseminated subversive rumours in Allied-occupied Germany.     ": null
    },
    {
        "Simon Wiesenthal": "simon wiesenthal"
    },
    {
        " and others have speculated about the existence of a Nazi fugitive network code-named ": null
    },
    {
        "ODESSA": "odessa"
    },
    {
        "  that allegedly helped war criminals find refuge in ": null
    },
    {
        "Latin America": "latin america"
    },
    {
        ". British writer ": null
    },
    {
        "Gitta Sereny": "gitta sereny"
    },
    {
        ", who conducted interviews with SS men, considers the story untrue and attributes the escapes to postwar chaos and Hudals Vatican-based network. While the existence of ODESSA remains unproven, Sereny notes that there certainly were various kinds of Nazi aid organizations after the war — it would have been astonishing if there hadnt been. ": null
    }
]