[
    {
        "      Scientific citation  is providing detailed reference in a scientific publication, typically a ": null
    },
    {
        "paper": "academic publishingscholarly paper"
    },
    {
        " or book, to previous published communications which have a bearing on the subject of the new publication. The purpose of citations in original work is to allow readers of the paper to refer to cited work to assist them in judging the new work, source background information vital for future development, and acknowledge the contributions of earlier workers. Citations in, say, a review paper bring together many sources, often recent, in one place.     To a considerable extent the quality of work, in the absence of other criteria, is judged on the number of citations received, adjusting for the volume of work in the relevant topic. While this is not necessarily a reliable measure, counting citations is trivially easy; judging the merit of complex work can be very difficult.     Previous work may be cited regarding experimental ": null
    },
    {
        "procedures": "procedure"
    },
    {
        ", apparatus, ": null
    },
    {
        "goal": "goal"
    },
    {
        "s, previous theoretical results upon which the new work builds, ": null
    },
    {
        "theses": "theses"
    },
    {
        ", and so on. Typically such citations establish the general ": null
    },
    {
        "framework": "wikt:framework"
    },
    {
        " of ": null
    },
    {
        "influences": "wikt:influence"
    },
    {
        " and the ": null
    },
    {
        "mindset": "mindset"
    },
    {
        " of ": null
    },
    {
        "research": "research"
    },
    {
        ", and especially as part of what science it is, and to help determine who conducts the ": null
    },
    {
        "peer review": "peer review"
    },
    {
        ".     Disciplined citation of prior works in mathematics and science is known at least as far back as ": null
    },
    {
        "Euclid": "euclid"
    },
    {
        ". Late in the first millennium, ": null
    },
    {
        "Islamic scholar": "islamic scholar"
    },
    {
        "s developed their practice of ": null
    },
    {
        "isnad": "isnad"
    },
    {
        ", or backing , which established the ": null
    },
    {
        "validity": "validity"
    },
    {
        " of sayings of ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        " in the ": null
    },
    {
        "hadith": "hadith"
    },
    {
        ". The ": null
    },
    {
        "Asharite": "asharite"
    },
    {
        " school of ": null
    },
    {
        "early Muslim philosophy": "early muslim philosophy"
    },
    {
        " extended this into ": null
    },
    {
        "fiqh": "fiqh"
    },
    {
        " or ": null
    },
    {
        "jurisprudence": "jurisprudence"
    },
    {
        ", while the ": null
    },
    {
        "Mutazilite": "mutazilite"
    },
    {
        " school used the traditional methods and applied them to ": null
    },
    {
        "science": "islamic science"
    },
    {
        ".     In some form, then, achieving authority for new work by citing accepted authorities is a near-universal idea among the peoples of the ": null
    },
    {
        "Mediterranean": "mediterranean"
    },
    {
        ", whose educated people were exposed to one or other of these practices well before the European ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " and the emergence of the formal ": null
    },
    {
        "scientific method": "scientific method"
    },
    {
        ".       In ": null
    },
    {
        "patent law": "patent law"
    },
    {
        " the citation of previous works, or ": null
    },
    {
        "prior art": "prior art"
    },
    {
        ", helps establish the ": null
    },
    {
        "uniqueness": "uniqueness"
    },
    {
        " of the ": null
    },
    {
        "invention": "invention"
    },
    {
        " being described. The focus in this practice is to claim ": null
    },
    {
        "originality": "originality"
    },
    {
        " for ": null
    },
    {
        "commercial": "commerce"
    },
    {
        " purposes, and so the author is motivated to avoid citing works that cast doubt on its originality. Thus this does not appear to be scientific citation. Inventors and lawyers have a legal obligation to cite all relevant art; not to do so risks invalidating the patent. The patent examiner is obliged to list all further prior art found in searches.       Modern scientists are sometimes judged by the number of times their work is cited by others—this is actually a key indicator of the relative ": null
    },
    {
        "importance": "impact factor"
    },
    {
        " of a work in science. Accordingly, individual scientists are motivated to have their own work cited early and often and as widely as possible, but all other scientists are motivated to eliminate unnecessary citations so as not to devalue this means of ": null
    },
    {
        "judgment": "judgment"
    },
    {
        ". A formal ": null
    },
    {
        "citation index": "citation index"
    },
    {
        " tracks which referred and reviewed papers have referred which other such papers. ": null
    },
    {
        "Baruch Lev": "baruch lev"
    },
    {
        " and other advocates of ": null
    },
    {
        "accounting reform": "accounting reform"
    },
    {
        " consider the number of times a ": null
    },
    {
        "patent": "patent"
    },
    {
        " is cited to be a significant metric of its quality, and thus of ": null
    },
    {
        "innovation": "innovation"
    },
    {
        ".": null
    }
]