[
    {
        "Scouting in Minnesota has a long history, from the 42s to the present day, serving thousands of youth in programs that suit the environment in which they live.          There are eight ": null
    },
    {
        "Boy Scouts of America": "boy scouts of america"
    },
    {
        " local councils serving ": null
    },
    {
        "Minnesota": "minnesota"
    },
    {
        ". In addition, the ": null
    },
    {
        "Northern Tier National High Adventure Bases": "northern tier national high adventure bases"
    },
    {
        " of the BSA is located in Minnesota.       CMC is headquartered in ": null
    },
    {
        "Sartell, Minnesota": "sartell, minnesota"
    },
    {
        ". Ranging from ": null
    },
    {
        "Nevis": "nevis, minnesota"
    },
    {
        " and ": null
    },
    {
        "Park Rapids": "park rapids, minnesota"
    },
    {
        " in the northwest to ": null
    },
    {
        "Elk River": "elk river, minnesota"
    },
    {
        " in the southeast, the council serves 42 communities in the area.     Central Minnesota Council is made up of four districts:   North Star District   Pine Tree District   Scenic District   Gateway District       Central Minnesota Council is home to Parker Scout Reservation, which was established in 42 by Clyde Parker. The Camp sits on  of wooded land on North Long Lake north of ": null
    },
    {
        "Brainerd": "brainerd, minnesota"
    },
    {
        ", Minnesota.       The Central Minnesota Council is supported by Naguonabe Lodge 42 of the Order of the Arrow. Naguonabe Lodge 42 was founded in 42       Gamehaven Scouting serves seven counties in southeast Minnesota. From its council office located in ": null
    },
    {
        "Rochester MN": "rochester mn"
    },
    {
        ", its area ranges from ": null
    },
    {
        "Red Wing MN": "red wing, minnesota"
    },
    {
        " to ": null
    },
    {
        "Winona MN": "winona, minnesota"
    },
    {
        " to ": null
    },
    {
        "Owatonna MN": "owatonna, minnesota"
    },
    {
        " and is bordered to the south by Iowa and the east by Wisconsin.     In Rochester alone, there are more than 42 Scouts, including 42 Cub Scout packs and more than 42 Scouts BSA troops . For older youth, Venturing is a high adventure outdoor program while Explorer Posts partner with firms like the Mayo Clinic, Cascade Veterinary Hospital, Gold Cross Ambulance, and Rochester Police to offer career development activities .     Gamehaven Scouting consists of these districts:     Hiawatha District   Sugar Loaf District     Wakpaota District          Gamehaven Scouting is supported by Blue Ox Lodge 42 of the Order of the Arrow.       Gamehaven Scouting has volunteers who are certified by the American Canoe Association in both canoeing and kayaking. Youth awards and leader training is available on request to in-council, other councils, and to the public. Our kayak fleet ranges from recreational kayaks appropriate for Webelos Scouts to kayaks suitable for training for Lake Superior and Seabase trips. Gamehaven provides solo canoe training with Wenonah Argosy solo canoes as well as traditional tandem canoeing. Check out the Google Group called Gamehaven Paddles.            Gateway Area Council serves Scouts in Wisconsin and Minnesota.          Located in ": null
    },
    {
        "Saint Paul, Minnesota": "saint paul, minnesota"
    },
    {
        ", Northern Star Council was formed from the merger of Viking Council and Indianhead Council in 42          As of 42 Northern Lights Council serves all of ": null
    },
    {
        "North Dakota": "north dakota"
    },
    {
        ", and parts of South Dakota, northwest Minnesota and northeast ": null
    },
    {
        "Montana": "montana"
    },
    {
        ". Voyageur Trails District is one of two NLC Districts in Minnesota.       Northern Lights Council is home to  Camp Wilderness , located on Bad Axe Lake near ": null
    },
    {
        "Emmaville, Minnesota": "emmaville, minnesota"
    },
    {
        " in ": null
    },
    {
        "Hubbard County, Minnesota": "hubbard county, minnesota"
    },
    {
        ". Founded by ": null
    },
    {
        "Herman Stern": "herman stern"
    },
    {
        " in 42 Camp Wilderness is a  camp. On August 42 42 the camp celebrated its 42th Anniversary by opening the Butler Wilderness Outpost, a Cub Scout camp for the scouts to attend. Camp Wilderness is, by area, the largest Scouts camp owned and operated by a Minnesota Scouting Council, although the National Council owns the much larger ": null
    },
    {
        "Philmont Scout Ranch": "philmont scout ranch"
    },
    {
        " in ": null
    },
    {
        "New Mexico": "new mexico"
    },
    {
        ", and the slightly larger Charles L. Sommers Northern Tier Base, also located in ": null
    },
    {
        "Minnesota": "minnesota"
    },
    {
        ".            Headquartered in Sioux Falls, South Dakota, Sioux Council serves Scouts in ": null
    },
    {
        "South Dakota": "south dakota"
    },
    {
        ", ": null
    },
    {
        "Iowa": "iowa"
    },
    {
        " and Minnesota.     Buffalo Ridge District serves Lincoln, Lyon, and Murray counties in Minnesota. Camp Shetek is located in Murray County on ": null
    },
    {
        "Lake Shetek": "lake shetek"
    },
    {
        " near ": null
    },
    {
        "Currie, Minnesota": "currie, minnesota"
    },
    {
        ".   Prairie Hills District serves Pipestone, Nobles, and Rock counties in Minnesota.       Located in ": null
    },
    {
        "Mankato MN": "mankato"
    },
    {
        ".     River Stone District   Cedar Valley District     Western Prairie District          Twin Valley Council is home to Cuyuna Scout Camp, established as Camp Cuyuna in 42 The Camp sits on  of wooded land surrounded by six lakes . Additionally, Lake Russell sits entirely within the boundaries of Cuyuna Scout Camp. Cuyuna Scout Camp is located northeast of ": null
    },
    {
        "Crosslake": "crosslake, minnesota"
    },
    {
        ", Minnesota. Campsites are arranged for scouts to sleep and eat as patrols with a central troop assembly area. Patrols draw their rations from a central ": null
    },
    {
        "Commissary": "commissary"
    },
    {
        " and cook all of their meals together except for two Camp-wide meals, on Sunday and Friday nights.          Headquartered in Hermantown, Minnesota, Voyageurs Area Council serves Scouts in Minnesota, Wisconsin, and Michigan. Its ": null
    },
    {
        "Order of the Arrow": "order of the arrow"
    },
    {
        " Lodge is Kaniss Maingan Lodge 42            Three Girl Scout Councils serve Minnesota.       See ": null
    },
    {
        "Scouting in South Dakota": "scouting in south dakota"
    },
    {
        ". Serves a large portion of northwestern Minnesota and Rock County in southwestern Minnesota.     Headquarters: ": null
    },
    {
        "Sioux Falls, South Dakota": "sioux falls, south dakota"
    },
    {
        "   Web Site:        Lakes and Pines Council serves 42 girls in 42 counties throughout   the northern half of Minnesota and northwest corner of Wisconsin.   Northern Pine and Land of Lakes Councils joined together Jan. 42 42   to form Girl Scouts of Minnesota and Wisconsin Lakes and Pines.     Headquarters: ": null
    },
    {
        "Waite Park, Minnesota": "waite park, minnesota"
    },
    {
        "   Website:         Camps:   Camp Roundelay is  near ": null
    },
    {
        "Minong, Wisconsin": "minong, wisconsin"
    },
    {
        "  north of ": null
    },
    {
        "Ely, Minnesota": "ely, minnesota"
    },
    {
        " and near the ": null
    },
    {
        "Boundary Waters Canoe Area Wilderness": "boundary waters canoe area wilderness"
    },
    {
        "  in ": null
    },
    {
        "Chippewa National Forest": "chippewa national forest"
    },
    {
        " near ": null
    },
    {
        "Walker, Minnesota": "walker, minnesota"
    },
    {
        "  near ": null
    },
    {
        "Spicer, MN": "spicer, mn"
    },
    {
        ".       In partnership with 42 adult volunteers, the Girl Scouts of Minnesota and Wisconsin River Valleys helps nearly 42 girls each year—in all or portions of 42 counties in southern Minnesota and western Wisconsin.     Headquarters: ": null
    },
    {
        "St. Paul, Minnesota": "st. paul, minnesota"
    },
    {
        "   Website:         Camps:   Camp Elk River is  near ": null
    },
    {
        "Zimmerman, MN": "zimmerman, mn"
    },
    {
        ".   Camp Lakamaga is near Marine, MN.   Camp Northwoods is  near ": null
    },
    {
        "Mason, WI": "mason, wi"
    },
    {
        ".   Camp Singing Hills is  near ": null
    },
    {
        "Waterville, MN": "waterville, mn"
    },
    {
        " Houston, MN": "houston, mn"
    },
    {
        "         , ": null
    },
    {
        "North Saint Paul, Minnesota": "north saint paul, minnesota"
    }
]