[
    {
        "     Scouting in Indiana has a long history, from the 42s to the present day, serving thousands of youth in programs that suit the environment in which they live.       Indianapolis is home to Troop 42 founded by Chief ": null
    },
    {
        "Francis Oliver Belzer": "francis oliver belzer"
    },
    {
        " in 42 one of the first Scout troops in America.     Belzer founded ": null
    },
    {
        "Firecrafter": "firecrafter"
    },
    {
        " at Camp Chank-Tun-Un-Gi in the summer of 42 Belzer also served as the first Scout Executive for the Indianapolis Council, later known as the Central Indiana Council.     The first ": null
    },
    {
        "National Order of the Arrow Conference": "list of order of the arrow national events"
    },
    {
        " was held at ": null
    },
    {
        "Indiana University": "indiana university bloomington"
    },
    {
        " in 42       In 42 42 42 42 42 42 42 42 and 42 the ": null
    },
    {
        "National Order of the Arrow Conference ": "order of the arrow"
    },
    {
        " was held at Indiana University in Bloomington, the most frequent venue for the event. In 42 NOAC was held at Purdue University in West Lafayette, Indiana.         There are nine ": null
    },
    {
        "Boy Scouts of America": "boy scouts of america"
    },
    {
        " local councils in ": null
    },
    {
        "Indiana": "indiana"
    },
    {
        ". All of Indiana lies within Central Region, except for Clark, Scott, Floyd, Harrison, Crawford, and Washington counties, as part of Southern Region.       Based in Fort Wayne, Indiana and covering 42 counties in Northeast Indiana  — Adams, Wells, Jay, Huntington, Allen, DeKalb, LaGrange, Noble, Steuben, Whitley, Kosciusko. Anthony Wayne Scout Reservation is a ": null
    },
    {
        "Scouts BSA": "scouts bsa"
    },
    {
        " camp located near ": null
    },
    {
        "Ashley, Indiana": "ashley, indiana"
    },
    {
        ", ": null
    },
    {
        "United States": "united states"
    },
    {
        ".     The reservation has three key areas: Camp Chief Little Turtle , Camp Foellinger, and Camp Wilderness.   Camp Chief Little Turtle is the main camp. It has many activity centers, such as a waterfront, handicraft, outdoor skills, Project C.O.P.E., and other typical features of a Scouts BSA camp.   Camp Foellinger is used mainly for special events, such as ": null
    },
    {
        "Cub Scout": "cub scouting"
    },
    {
        " camp, National Youth Leadership Training, and Order of the Arrow events.   Camp Wilderness contains the Jack Zeiger Ropes Course  — used for C.O.P.E. and rock climbing  — and Orion, an area used for camping and wilderness survival training.       The Buffalo Trace Council is based in Evansville, Indiana that serves southwestern ": null
    },
    {
        "Indiana": "indiana"
    },
    {
        " and southeastern Illinois. Its affiliated ": null
    },
    {
        "Order of the Arrow": "order of the arrow"
    },
    {
        " lodge is Kiondaga Lodge.       The Buffalo Trace Council has operated four camps throughout its existence, three of which are still in existence. ": null
    },
    {
        "Camp Arthur": "camp arthur"
    },
    {
        ", located near ": null
    },
    {
        "Vincennes": "vincennes, indiana"
    },
    {
        ", opened in 42 and was removed from the list of BSA-approved camping facilities for a time in the mid42s. ": null
    },
    {
        "Camp Carnes": "camp carnes"
    },
    {
        ", located between ": null
    },
    {
        "Jasper": "jasper, indiana"
    },
    {
        " and ": null
    },
    {
        "Dubois": "dubois, indiana"
    },
    {
        ", has since changed ownership to the City of ": null
    },
    {
        "Jasper": "jasper, indiana"
    },
    {
        " and is run as a park. ": null
    },
    {
        "Old Ben Scout Reservation": "old ben scout reservation"
    },
    {
        " , located in ": null
    },
    {
        "Pike County, Indiana": "pike county, indiana"
    },
    {
        " opened in 42 on the site of an abandoned ": null
    },
    {
        "strip mine": "strip mine"
    },
    {
        " operated by the ": null
    },
    {
        "Old Ben Coal Company": "old ben coal company"
    },
    {
        " and was the councils current primary summer camp location, until a lack of funding forced the council to cease having summer camps there. ": null
    },
    {
        "Camp Pohoka": "camp pohoka"
    },
    {
        " was the previous summer camp location, but was shut down when OBSR was opened.         ": null
    },
    {
        "Edwards County": "edwards county, illinois"
    },
    {
        " Gibson County": "gibson county, indiana"
    },
    {
        " Knox County": "knox county, indiana"
    },
    {
        " Lawrence County": "lawrence county, illinois"
    },
    {
        " Richland County": "richland county, illinois"
    },
    {
        " Wabash County": "wabash county, illinois"
    },
    {
        "     Dubois County": "dubois county, indiana"
    },
    {
        " Perry County": "perry county, indiana"
    },
    {
        " Pike County": "pike county, indiana"
    },
    {
        " Spencer County": "spencer county, indiana"
    },
    {
        " Warrick County": "warrick county, indiana"
    },
    {
        "     Gallatin County": "gallatin county, illinois"
    },
    {
        " Newburgh": "newburgh, indiana"
    },
    {
        " Posey County": "posey county, indiana"
    },
    {
        " Vanderburgh County": "vanderburgh county, indiana"
    },
    {
        " White County": "white county, illinois"
    },
    {
        "       Calumet Council is headquartered in ": null
    },
    {
        "Munster, Indiana": "munster, indiana"
    },
    {
        " and serves Scouts in Indiana and Illinois.     Serving the youth of the 42 communities comprising the south suburbs of Chicago and Northwest Indiana since 42 the Calumet Council is the local entity of the Boy Scouts of America and Learning for Life Programs.     Calumet Council was formed in 42 and was the result of a merger of the Pokagon Trails Council in ": null
    },
    {
        "Hammond, Indiana": "hammond, indiana"
    },
    {
        " and the Sauk Trails Council in ": null
    },
    {
        "Gary, Indiana": "gary, indiana"
    },
    {
        ". In 42 the Twin City Council in East Chicago, Indiana joined to make up the current structure. Camp Frank S. Betz, located in Berrien Springs, MI is operated by the Calumet Council. Betz has served Scouts in the South Suburbs of Chicago and Northwest Indiana since 42     In 42 over 42 young men and women were active members of the Scouting program in the Calumet Council. Over 42 adult volunteers, supported by a small staff, provide a top quality values based program, with an emphasis on outdoor programs and life skills.     Due to the unique demographics of the Calumet Council, a special program designed to serve the hardest to reach at risk youth, called ": null
    },
    {
        "Scoutreach": "scoutreach"
    },
    {
        ", is used in lower income communities. In 42 sixty six Scoutreach Cub Scout packs, Boy Scout troops and Venture Crews were active in nine different communities with over 42 members.     The Eagle Scout Award, the highest award a boy can earn in Scouting, was presented to 42 young men in 42 These newest Eagles totaled over 42 combined service hours in the 42 different community service projects which they carried out as part of the Eagle Scout requirement.     The Council operates four districts: Crossroads, Nishnabec, Prairie Dunes, and Thunderbird. These service areas were formed in 42 as a result of a restructuring to utilize volunteer resources better.     The Order of the Arrow is Scouting’s National Honor Society. The councils chapter is Michigamea Order of the Arrow Lodge number 42 It is youth-run and advised by adult volunteers. Michigamea lodge has over 42 active members. In 42 the Lodge received The National Service Award for their work on the new Frank S. Betz firebowl. This annual award is only presented to eight lodges nationally.     The Council Executive board is made up of 42 local business and community leaders who guide to the year-round operation of the Council. The Council Key III is made up of President T. Edward Page, Council Commissioner Todd Dykton and Acting Scout Executive Matthew Thornton.     This council was merged into the Pathway to Adventure council.       Headquartered in Indianapolis, Indiana, the Crossroads of America Council serves Scouts and Scouters in Central Indiana. It was initially formed when Central Indiana Council, Delaware County Council, Kikthawenund Council, and Whitewater Valley Council merged in 42 Recently, in the past decade, Wabash Valley and Crossroads of America were merged to form the new Crossroads of America Council, serving 42 counties in Indiana, extending from the Illinois state line to the Ohio state line. As of the end of 42 the council served more than 42 youth thanks to more than 42 volunteer leaders.     The Crossroads of America Council is served by Jaccos Towne Lodge 42 ": null
    },
    {
        "Order of the Arrow": "order of the arrow"
    },
    {
        ". It is also home to ": null
    },
    {
        "Firecrafter": "firecrafter"
    },
    {
        ", a local Scouting service fraternity. Central Indiana Council was not home to a lodge of the Order of the Arrow until the merger of the councils in 42 Joe Wiltrout is the current Scout Executive. The council maintains Scout offices in Indianapolis, Muncie, and Terre Haute.     The Crossroads of America Council has also served as home of the Crossroads of America Scout Band. Founded in 42 by Chief F.O. Belzer as a camp band, this band has grown into a concert band that has traveled throughout the United States, Canada and England representing the Boy Scouts of America and the Crossroads of America Council for 42 years. The Bands annual summer tour takes it to as many scout camps as it can for the enjoyment of those scouts at camp.        , serving Fayette, Franklin, Rush, Shelby, Union, Wayne and southern Randolph counties   , serving Hamilton and Tipton counties   , serving Blackford, Delaware, eastern Henry, and northern Randolph Counties   , serving southwestern Marion county and Hendricks county   , serving northeast Marion county and northwestern Hancock county   , serving northwestern Marion county, and southeastern Boone county   , serving southern Marion county and Johnson county   , serving east central Marion County and southeastern Hancock county   , serving Madison county, and western Henry county   , serving Boone, northern Hendricks, Montgomery, and Clinton counties   , serving Clay, Vigo, Sullivan, southern Vermillion, Parke, and Putnam Counties       The ": null
    },
    {
        "Crossroads of America Council": "crossroads of america council"
    },
    {
        " currently operates :    - ": null
    },
    {
        "Bloomington": "bloomington, indiana"
    },
    {
        "  - Indianapolis   Camp Kikthawenund - ": null
    },
    {
        "Frankton": "frankton, indiana"
    },
    {
        " Connersville": "connersville, indiana"
    },
    {
        " Muncie": "muncie, indiana"
    },
    {
        " Center Point": "center point, indiana"
    },
    {
        " Terre Haute": "terre haute, indiana"
    },
    {
        "              Hoosier Hills District serving ": null
    },
    {
        "Dearborn": "dearborn county, indiana"
    },
    {
        ", ": null
    },
    {
        "Jefferson": "jefferson county, indiana"
    },
    {
        ", ": null
    },
    {
        "Ohio": "ohio county, indiana"
    },
    {
        ", ": null
    },
    {
        "Ripley": "ripley county, indiana"
    },
    {
        ", & ": null
    },
    {
        "Switzerland": "switzerland county, indiana"
    },
    {
        " Counties   Lenni Lenape District serving ": null
    },
    {
        "Bartholomew": "bartholomew county, indiana"
    },
    {
        ", ": null
    },
    {
        "Jackson": "jackson county, indiana"
    },
    {
        ", ": null
    },
    {
        "Decatur": "decatur county, indiana"
    },
    {
        ", & ": null
    },
    {
        "Jennings": "jennings county, indiana"
    },
    {
        " Counties   Wapehani District serving ": null
    },
    {
        "Brown": "brown county, indiana"
    },
    {
        ", ": null
    },
    {
        "Monroe": "monroe county, indiana"
    },
    {
        ", ": null
    },
    {
        "Morgan": "morgan county, indiana"
    },
    {
        " & ": null
    },
    {
        "Owen": "owen county, indiana"
    },
    {
        " Counties   White River Trails District serving ": null
    },
    {
        "Lawrence": "lawrence county, indiana"
    },
    {
        ", ": null
    },
    {
        "Orange": "orange county, indiana"
    },
    {
        ", ": null
    },
    {
        "Martin": "martin county, indiana"
    },
    {
        ", ": null
    },
    {
        "Daviess": "daviess county, indiana"
    },
    {
        ", & ": null
    },
    {
        "Greene": "greene county, indiana"
    },
    {
        " Counties       Hoosier Trails has two camps. Resident summer camp is hosted deep within the ": null
    },
    {
        "Hoosier National Forest": "hoosier national forest"
    },
    {
        " at Maumee Scout Reservation in ": null
    },
    {
        "Norman": "norman, indiana"
    },
    {
        ". Primitive camping is available at Camp Louis Ernst in ": null
    },
    {
        "Dupont": "dupont, indiana"
    },
    {
        ".     Nischa Chuppecat is Hoosier Trails Order of the Arrow Lodge. It was founded in 42 as the merger of Wazi Yata and So Aka Gha Gwa lodges. Nischa Chuppecat and So Aka Gha Gwa has hosted the National Order of the Arrow Conference at Indiana University ten times as of the summer of 42 the most of any lodge in the nation.       La Salle Council serves Scouts in Indiana and ": null
    },
    {
        "Michigan": "michigan"
    },
    {
        ".   :Website:        Algonquian District   Dunes Moraine District   Pioneer Trails District   Potawatomi District        Camp Tamarack is approximately 42 acres and is the summer camp facility located on the north side of Big and Little Wood Lake. Tamarack has 42 campsites, 42 winter lodges, 42 staff cabins, shower house, health lodge, directors lodge, dining hall, cooks cabin, quartermaster building, trading post, administration building, conservation pavilion, rifle range, archery range, waterfront, athletic field, and parade field.   Camp Will Welber is approximately 42 acres and is used as a training area. This camp is located on the south side of Big Wood Lake. Facilities consist of a storage building, central shower, and two staff cabins.   Camp Dan Beard and Jim Bridger are located on the south side of Big Wood Lake and are approximately 42 Acres each. These are both leave no trace camping areas. They offer no amenities except for the abundant natural beauty.                The George Rogers Clark Council was formed by Scouts of ": null
    },
    {
        "Clark": "clark county, indiana"
    },
    {
        ", ": null
    },
    {
        "Floyd": "floyd county, indiana"
    },
    {
        ", ": null
    },
    {
        "Harrison": "harrison county, indiana"
    },
    {
        ", ": null
    },
    {
        "Crawford": "crawford county, indiana"
    },
    {
        ", ": null
    },
    {
        "Scott": "scott county, indiana"
    },
    {
        ", and ": null
    },
    {
        "Washington": "washington county, indiana"
    },
    {
        " counties in 42 and merged with Old Kentucky Home Council in 42 to form the Lincoln Heritage Council, which serves Scouts in ": null
    },
    {
        "Kentucky": "kentucky"
    },
    {
        " and ": null
    },
    {
        "Indiana": "indiana"
    },
    {
        ". The Council absorbed the Shawnee Trails Council of western Kentucky in April 42 to serve scouts in Indiana, Kentucky, Illinois, and Tennessee.            Tunnel Mill Scout Reservation is a ": null
    },
    {
        "Scouts BSA": "scouts bsa"
    },
    {
        " camp just outside ": null
    },
    {
        "Charlestown, Indiana": "charlestown, indiana"
    },
    {
        ", owned by the ": null
    },
    {
        "Lincoln Heritage Council": "scouting in kentuckylincoln heritage council"
    },
    {
        ". In 42 local Troop 42 decided to use the property as a summer camp, as it would for three summers. The George Rogers Clark Council shortly after 42 bought Tunnel Mill from the Murphy family, who had bought the property the previous year but lost interest after a mill fire. In 42 the three-sided wooden Pioneer Village cabins were built. In 42 the ": null
    },
    {
        "Scoutmaster": "scoutmaster"
    },
    {
        "s Cabin and Evergreen cabins were completed. In 42 the McDonald Bridge was completed across ": null
    },
    {
        "Fourteen Mile Creek": "fourteen mile creek"
    },
    {
        ". The camp saw its greatest use in the 42s and 42s, with 42 Scouts, the highest attendance ever, in 42 In 42 the swimming pool was built, to replace the creek, now-unsafe for swimming. By the 42s the lessening attendance made the future of the camp uncertain. When the George Rogers Clark Council, which owned the property, merged with Old Kentucky Home Council, one of the conditions was that Tunnel Mill would not be closed. Since 42 the camp has been used primarily by ": null
    },
    {
        "Cub Scouts": "cub scouts"
    },
    {
        " and for winter camping. Tunnel Mill: the story of an historical grist mill and an historic Boy Scout camp by Gary D. Purlee The property includes a cabin village, a swimming pool, and a dining hall built in 42 The new dining hall replaced the one from the 42s that once served as a steakhouse in ": null
    },
    {
        "Jeffersonville": "jeffersonville, indiana"
    },
    {
        ".     On November 42 42 Andy Campbell, a ranger serving as Tunnel Mills caretaker, was shot to death by Roger Caldwell, a diagnosed, paranoid schizophrenic who trespassed onto the property while drunk.  This was the first such incident in the history of Scouting. Purlee 42 Campbell was able to drag himself  to call 42 After police arrived on the scene to get information about the drunk from Campbell, they found Caldwell wandering on Indiana Highway 42 Caldwell was sentenced to 42 years in prison, with parole possible after 42 years.              Prairielands Council, previously the short-lived Illiana Council, has its headquarters in ": null
    },
    {
        "Champaign, Illinois": "champaign, illinois"
    },
    {
        ", and also serves Scouts in ": null
    },
    {
        "Indiana": "indiana"
    },
    {
        ".       The  was founded in 42 by a merger of the Three Rivers Council , Mesingomesia Council  and the Harrison Trails Council . The council offices were eventually consolidated to a single office in Kokomo, Indiana. The council maintains two camps: Camp Cary, used as a Cub Scout day camp and Camp Buffalo,  used as a Scouts BSA summer camp. The camp properties of Green Hills and Crossland were sold. Camp Green Hills was south and west of Lafayette, IN. Mesingomesia Councils Crossland Scout Reservation near ": null
    },
    {
        "Columbia City, Indiana": "columbia city, indiana"
    },
    {
        " was sold to the ": null
    },
    {
        "Indiana Department of Natural Resources": "indiana department of natural resources"
    },
    {
        " in 42 and is now called the Deniston Resource Area . The camp was located on Robinson Lake, one of the last natural lakes in Indiana with almost no development. This was due in large part to the camp which encompassed almost three-fourths of the shoreline.      A few things make Sagamore Council unique:     42 ": null
    },
    {
        "Purdue University": "purdue university"
    },
    {
        ", in West Lafaytte, IN, hosted the 42 National Order of the Arrow Conference.     42 ": null
    },
    {
        "Weaver Popcorn": "weaver popcorn company"
    },
    {
        "  is produced in Van Buren, Indiana.     42   is produced in Ramsey, Indiana.     42 George O. Crossland was a Scout Executive who served the prior Mesingomesia Council. He was known for more notable Scouting functions including creating an honorary that rivaled the Order of the Arrow -- TI-PI-SA, the Order of the Red Lodge. Crossland Scout Reservation was named after him.       , serving Cass, Fulton, Jasper, Newton, Pulaski & White counties   , serving Blackford, Grant, Howard, Miami and Wabash counties   , serving Benton, Carroll, Tippecanoe, Warren & Northern Fountain counties       The Sagamore Council currently operates two camps:             There are 42 Girl Scout councils that serve Indiana.     On Aug. 42 42 Girl Scouts of the USA’s national board of directors voted to endorse a plan to realign 42 councils into 42 high-capacity, community-based councils. The new structure will make the most effective use of resources to better serve the local community and create more opportunities in Girl Scouting for even more girls. Girl Scouts of Central Indiana was the first Girl Scout council in the nation to complete the merger process.         Formed by the merger of Girl Scouts of Hoosier Capital Council, Covered Bridge Girl Scout Council, Girl Scouts of Treaty Line Council, Girl Scouts of Sycamore Council, and Girl Scouts of Wapephani Council, and the addition of Howard and Carroll Counties from Girl Scouts of Tribal Trails Council.     Girl Scouts of Central Indiana serves over 42 girls in 42 counties in Central Indiana.   Council headquarters is   Indianapolis, Indiana but service centers remain in cities that were the headquarters of former councils     Web Site:        Camp Sycamore Valley near ": null
    },
    {
        "Lafayette": "lafayette, indiana"
    },
    {
        " is  on Wildcat creek.   Camp Na Wa Ka in ": null
    },
    {
        "Poland, Indiana": "poland, indiana"
    },
    {
        " is  ": null
    },
    {
        "Morgantown": "morgantown, indiana"
    },
    {
        " Indianapolis": "indianapolis, indiana"
    },
    {
        " Spiceland": "spiceland, indiana"
    },
    {
        "         See ": null
    },
    {
        "Scouting in Illinois": "scouting in illinois"
    },
    {
        " for more information. The former Scouts of The Calumet Council and Drifting Dunes Girl Scout Council became part of this council.         See ": null
    },
    {
        "Scouting in Kentucky": "scouting in kentucky"
    },
    {
        " for more information. Serves many counties in southern Indiana         This is a new council includes more than 42 Girl Scouts in northern Indiana  and two counties, ": null
    },
    {
        "Berien": "berrien county, michigan"
    },
    {
        " and ": null
    },
    {
        "Cass": "cass county, michigan"
    },
    {
        ", in southwest Michigan.     Formed by the merger of Indiana Lakeland Girl Scout Council, Girl Scouts of Limberlost Council, Girl Scouts of Singing Sands Council , and Girl Scouts of Tribal Trails Council .     Website:        Camp Logan -  near ": null
    },
    {
        "Syracuse, Indiana": "syracuse, indiana"
    },
    {
        " Lawton, Michigan": "lawton, michigan"
    },
    {
        "  near ": null
    },
    {
        "Middlebury, Indiana": "middlebury, indiana"
    },
    {
        "  near ": null
    },
    {
        "Three Oaks, Michigan": "three oaks, michigan"
    },
    {
        "  in northeast Indiana   Wildwood Program Center -  in ": null
    },
    {
        "Logansport, Indiana": "logansport, indiana"
    },
    {
        "         Headquarters is Glen Carbon, Illinois     website:        Headquarters is Cincinnati, Ohio     website:      See ": null
    },
    {
        "Scouting in Ohio": "scouting in ohio"
    },
    {
        " for more information       Headquarters is ": null
    },
    {
        "Evansville, Indiana": "evansville, indiana"
    },
    {
        ". It serves Vanderburgh, Warrick, Spencer, Perry, Posey, Gibson, Martin, Pike, Daviess, and Dubois Counties in Indiana and White County in Illinois.     website is      Located in south-west Indiana and also a small part of Illinois. It was formed after a previous realignment in September 42       Camp Koch in ": null
    },
    {
        "Cannelton, Indiana": "cannelton, indiana"
    },
    {
        " Carmi, Indiana": "carmi, indiana"
    },
    {
        " sycamore": "sycamore"
    },
    {
        " that is a ": null
    },
    {
        "moon tree": "moon tree"
    },
    {
        " ; as a seed it was on the ": null
    },
    {
        "Apollo 42": "apollo 14"
    },
    {
        " mission to the ": null
    },
    {
        "moon": "moon"
    },
    {
        ".": null
    }
]