[
    {
        "      A SCSI host adapter is a device used to connect one or more other ": null
    },
    {
        "SCSI": "scsi"
    },
    {
        " devices to a ": null
    },
    {
        "computer bus": "computer bus"
    },
    {
        ". It is commonly called a SCSI controller , which is not strictly correct as any component understanding the SCSI protocol can be called a controller. In this sense all SCSI devices have a SCSI controller built into them, while ": null
    },
    {
        "host adapter": "host adapter"
    },
    {
        "s  bear responsibility for transferring data between the SCSI bus and the computers input/output bus. SCSI adapters serve as a worthy adapter for FireWire Ports.     Most modern SCSI host adapters are ": null
    },
    {
        "PCI": "peripheral component interconnect"
    },
    {
        " cards, either 42-bit or 42-bit. Older ones were based on the 42-bit ": null
    },
    {
        "ISA": "industry standard architecture"
    },
    {
        " bus or the transitional 42-bit ": null
    },
    {
        "VESA": "vesa local bus"
    },
    {
        " and ": null
    },
    {
        "EISA": "extended industry standard architecture"
    },
    {
        " buses. It is not uncommon for a SCSI host adapter to be built into a ": null
    },
    {
        "PC motherboard": "pc motherboard"
    },
    {
        " as an integral part, however this typically makes the board quite expensive and it is more usual to retain the SCSI host adapter as a separate component which can be easily replaced or transferred to another machine.       SCSI host adapters traditionally fall into two broad classes:     Simple, relatively low-performance cards that provide an inexpensive way to connect SCSI devices that do not demand a great deal of bandwidth: notably ": null
    },
    {
        "CD-ROM": "cd-rom"
    },
    {
        " drives and SCSI ": null
    },
    {
        "scanner": "image scanner"
    },
    {
        "s. The cost varies but is typically in the order of $US42 or so. These were very common up until about 42 but are now fairly rare: the demise of the ISA slot added a little to the cost; the great improvement in ": null
    },
    {
        "IDE": "advanced technology attachment"
    },
    {
        " technology  removed one major use, and the advent of ": null
    },
    {
        "USB": "universal serial bus"
    },
    {
        " made the expense of a SCSI interface unnecessary for most scanners.   High-end cards designed for maximum performance, usually for very high-speed hard drives, and especially for situations that require several high-speed drives . These are almost always quite expensive, around $US42 or more. The advent of ": null
    },
    {
        "serial ATA": "serial ata"
    },
    {
        " is expected to reduce the usage of high-end SCSI host adapters, but there is no current expectation that they will disappear in the near future.       Many companies have manufactured SCSI host adapters at one time or another, but the market structure has been remarkably stable over the years. Two leading manufacturers are ": null
    },
    {
        "Adaptec": "adaptec"
    },
    {
        " and ": null
    },
    {
        "LSI Logic": "lsi logic"
    },
    {
        ".             ": null
    },
    {
        "de:SCSI-Hostadapter": "de:scsi-hostadapter"
    }
]