[
    {
        "           A scuba set is any breathing apparatus that is carried entirely by an underwater diver and provides the diver with ": null
    },
    {
        "breathing gas": "breathing gas"
    },
    {
        " at the ambient pressure. Scuba is an ": null
    },
    {
        "anacronym": "anacronym"
    },
    {
        " for self-contained underwater breathing apparatus. Although strictly speaking the scuba set is only the diving equipment which is required for providing breathing gas to the diver, general usage includes the harness by which it is carried, and those accessories which are integral parts of the harness and breathing apparatus assembly, such as a jacket or wing style buoyancy compensator and instruments mounted in a combined housing with the pressure gauge, and in the looser sense it has been used to refer to any ": null
    },
    {
        "diving equipment": "diving equipment"
    },
    {
        " used by the scuba diver, though this would more commonly and accurately be termed scuba equipment or scuba gear. Scuba is overwhelmingly the most common underwater breathing system used by recreational divers and is also used in ": null
    },
    {
        "professional diving": "professional diving"
    },
    {
        " when it provides advantages, usually of mobility and range, over ": null
    },
    {
        "surface supplied diving": "surface supplied diving"
    },
    {
        " systems, and is allowed by the relevant code of practice.     Two basic functional systems of scuba are in general use: open-circuit-demand, and rebreather. In open-circuit demand scuba, the diver expels exhaled air to the environment, and requires each breath be delivered on demand by a diving regulator, which reduces the pressure from the storage cylinder. The breathing air is supplied through a demand valve when the diver reduces the pressure in the demand valve during inhalation.     In ": null
    },
    {
        "rebreather": "rebreather"
    },
    {
        " scuba, the system recycles the exhaled gas, removes carbon dioxide, and compensates for the used ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        " before the diver is supplied with gas from the breathing circuit. The amount of gas lost from the circuit during each breathing cycle depends on the design of the rebreather and depth change during the breathing cycle. Gas in the breathing circuit is at ambient pressure, and stored gas is provided through ": null
    },
    {
        "regulators": "rebreatherclosed circuit rebreather"
    },
    {
        " or ": null
    },
    {
        "injectors": "rebreathersemi-closed circuit rebreathers"
    },
    {
        ", depending on design.     Within these systems, various mounting configurations may be used to carry the scuba set, depending on application and preference. These include back mount, which is generally used for recreational scuba and for bailout sets for surface supplied diving, side-mount, which is popular for tight cave penetrations, sling mount, used for stage-drop sets, decompression gas and bailout sets where the main gas supply is back mounted, and various non-standard carry systems for special circumstances.     The most immediate risk associated with scuba diving is drowning due to a failure of the breathing gas supply. This may be managed by diligent monitoring of remaining gas, adequate planning and provision of an emergency gas supply carried by the diver in a ": null
    },
    {
        "bailout cylinder": "bailout cylinder"
    },
    {
        " or supplied by the ": null
    },
    {
        "divers buddy": "buddy diving"
    },
    {
        ".       The word SCUBA was coined in 42 by ": null
    },
    {
        "Major": "major"
    },
    {
        " Christian Lambertsen": "christian j. lambertsen"
    },
    {
        " who served in the ": null
    },
    {
        "U.S. Army Medical Corps": "u.s. army medical corps"
    },
    {
        " from 42 to 42 as a physician. Lambertsen first called the closed circuit ": null
    },
    {
        "rebreather": "rebreather"
    },
    {
        " apparatus he had invented Laru , an  but, in 42 rejected the term Laru for SCUBA . Lambertsens invention, for which he held several patents registered from 42 to 42 was a ": null
    },
    {
        "rebreather": "rebreather"
    },
    {
        " and is different from the open-circuit ": null
    },
    {
        "diving regulator": "diving regulator"
    },
    {
        " and ": null
    },
    {
        "diving cylinder": "diving cylinder"
    },
    {
        " assemblies also commonly referred to as scuba.     Open-circuit-demand scuba is a 42 invention by the ": null
    },
    {
        "Frenchmen": "france"
    },
    {
        " Émile Gagnan": "émile gagnan"
    },
    {
        " and ": null
    },
    {
        "Jacques-Yves Cousteau": "jacques-yves cousteau"
    },
    {
        ", but in the ": null
    },
    {
        "English language": "english language"
    },
    {
        " Lambertsens acronym has become common usage and the name  Aqua-Lung  , coined by Cousteau for use in ": null
    },
    {
        "English-speaking countries": "english-speaking world"
    },
    {
        ", has fallen into secondary use. As with ": null
    },
    {
        "radar": "radar"
    },
    {
        ", the acronym scuba has become so familiar that it is generally not capitalized and is treated as an ordinary noun. For example, it has been translated into the ": null
    },
    {
        "Welsh language": "welsh language"
    },
    {
        " as sgwba.     SCUBA was originally an acronym, but the term scuba is currently used to refer to the apparatus or the practice of diving using the apparatus, either alone as a common noun, or as an adjective in scuba set and scuba diving respectively. It is also used as an adjective referring to equipment or activity relating to diving using self-contained breathing apparatus.            A diver uses a self-contained underwater breathing apparatus to breathe ": null
    },
    {
        "underwater": "underwater"
    },
    {
        ". Scuba provides the diver with the advantages of mobility and horizontal range far beyond the reach of an umbilical hose attached to surface-supplied diving equipment .     Unlike other modes of diving, which rely either on ": null
    },
    {
        "breath-hold": "free-diving"
    },
    {
        " or on ": null
    },
    {
        "breathing supplied under pressure from the surface": "surface-supplied diving"
    },
    {
        ", scuba divers carry their own source of ": null
    },
    {
        "breathing gas": "breathing gas"
    },
    {
        ", usually ": null
    },
    {
        "filtered": "air filter"
    },
    {
        " compressed air": "compressed air"
    },
    {
        ", allowing them greater freedom of movement than with an ": null
    },
    {
        "air line": "air line"
    },
    {
        " or ": null
    },
    {
        "divers umbilical": "umbilical cablediver"
    },
    {
        " and longer underwater endurance than breath-hold. Scuba diving may be done ": null
    },
    {
        "recreationally": "recreational diving"
    },
    {
        " or ": null
    },
    {
        "professionally": "professional diving"
    },
    {
        " in a number of applications, including scientific, military and public safety roles, but most commercial diving uses surface supplied diving equipment for main gas supply when this is practicable. Surface supplied divers may be required to carry scuba as an emergency breathing gas supply to get them to safety in the event of a failure of surface gas supply.     There are divers who work, full or part-time, in the recreational diving community as instructors, assistant instructors, divemasters and dive guides. In some jurisdictions the professional nature, with particular reference to responsibility for health and safety of the clients, of recreational diver instruction, dive leadership for reward and dive guiding is recognised and regulated by national legislation.     Other specialist areas of scuba diving include ": null
    },
    {
        "military diving": "military diving"
    },
    {
        ", with a long history of military ": null
    },
    {
        "frogmen": "frogmen"
    },
    {
        " in various roles. Their roles include direct combat, infiltration behind enemy lines, placing mines or using a ": null
    },
    {
        "manned torpedo": "manned torpedo"
    },
    {
        ", ": null
    },
    {
        "bomb disposal": "bomb disposal"
    },
    {
        " or engineering operations. In civilian operations, many police forces operate ": null
    },
    {
        "police diving": "police diving"
    },
    {
        " teams to perform search and recovery or search and rescue operations and to assist with the detection of crime which may involve bodies of water. In some cases ": null
    },
    {
        "diver rescue": "diver rescue"
    },
    {
        " teams may also be part of a ": null
    },
    {
        "fire department": "fire department"
    },
    {
        ", paramedical service or ": null
    },
    {
        "lifeguard": "lifeguard"
    },
    {
        " unit, and may be classed as public service diving.     There are also professional divers involved with underwater environment, such as ": null
    },
    {
        "underwater photographers": "underwater photography"
    },
    {
        " or underwater videographers, who document the underwater world, or ": null
    },
    {
        "scientific diving": "scientific diving"
    },
    {
        ", including ": null
    },
    {
        "marine biology": "marine biology"
    },
    {
        ", geology, ": null
    },
    {
        "hydrology": "hydrology"
    },
    {
        ", ": null
    },
    {
        "oceanography": "oceanography"
    },
    {
        " and ": null
    },
    {
        "underwater archaeology": "underwater archaeology"
    },
    {
        ".     The choice between scuba and surface supplied diving equipment is based on both legal and logistical constraints. Where the diver requires mobility and a large range of movement, scuba is usually the choice if safety and legal constraints allow. Higher risk work, particularly in commercial diving, may be restricted to surface supplied equipment by legislation and codes of practice.       There are alternative methods that a person can use to survive and function while underwater, currently including:   ": null
    },
    {
        "free-diving": "free-diving"
    },
    {
        " – swimming underwater on a single breath of air.   ": null
    },
    {
        "snorkeling": "snorkeling"
    },
    {
        " – a form of free-diving where the divers mouth and nose can remain underwater when breathing, because the diver is able to breathe at the surface through a short tube known as a ": null
    },
    {
        "snorkel": "snorkel"
    },
    {
        ".   ": null
    },
    {
        "surface-supplied diving": "surface-supplied diving"
    },
    {
        " – originally, and still used in ": null
    },
    {
        "professional diving": "professional diving"
    },
    {
        " for long or deep dives, where an umbilical cable provides ": null
    },
    {
        "breathing gas": "breathing gas"
    },
    {
        ", voice communication and sometimes warm water to heat the ": null
    },
    {
        "diving suit": "diving suit"
    },
    {
        " from the surface. Some tourist resorts offer a surface-supplied air line diving system, trademarked as ": null
    },
    {
        "Snuba": "snuba"
    },
    {
        ", as an introduction to diving for the inexperienced. Using the same type of demand valve as scuba diving, the diver breathes from a compressed air cylinder carried on a free-floating raft at the surface, through a simple hose limiting the diver to a depth of 42–42 feet .   ": null
    },
    {
        "atmospheric diving suit": "atmospheric diving suit"
    },
    {
        " – an armored suit which protects the diver from the surrounding water pressure.             Breathing from scuba is mostly a straightforward matter. Under most circumstances it differs very little from normal surface breathing. In the case of a full-face mask, the diver may usually breathe through the nose or mouth as preferred, and in the case of a mouth held demand valve, the diver will have to hold the mouthpiece between the teeth and maintain a seal around it with the lips. Over a long dive this can induce jaw fatigue, and for some people, a gag reflex. Various styles of mouthpiece are available off the shelf or as customised items, and one of them may work better if either of these problems occur.     The frequently quoted warning against holding ones breath on scuba is a gross oversimplification of the actual hazard. The purpose of the admonition is to ensure that inexperienced divers do not accidentally hold their breath while surfacing, as the expansion of gas in the lungs could over-expand the lung air spaces and rupture the alveoli and their capillaries, allowing lung gases to get into the pulmonary return circulation, the pleura, or the interstitial areas near the injury, where it could cause dangerous medical conditions. Holding the breath at constant depth for short periods with a normal lung volume is generally harmless, providing there is sufficient ventilation on average to prevent carbon dioxide buildup, and is done as a standard practice by underwater photographers to avoid startling their subjects. Holding the breath during descent can eventually cause lung squeeze, and may allow the diver to miss warning signs of a gas supply malfunction until it is too late to remedy.     Skilled open circuit divers can and will make small adjustments to buoyancy by adjusting their average lung volume during the breathing cycle. This adjustment is generally in the order of a kilgram , and can be maintained for a moderate period, but it is more comfortable to adjust the volume of the buoyancy compensator over the longer term.     The practice of shallow breathing or skip breathing in an attempt to conserve breathing gas should be avoided as it tends to cause a carbon dioxide buildup, which can result in headaches and a reduced capacity to recover from a breathing gas supply emergency. The breathing apparatus will generally increase ": null
    },
    {
        "dead space": "dead space"
    },
    {
        " by a small but significant amount, and cracking pressure and flow resistance in the demand valve will cause a net work of breathing increase, which will reduce the divers capacity for other work. Work of breathing and the effect of dead space can be minimised by breathing relatively deeply and slowly. These effects increase with depth, as density and friction increase in proportion to the increase in pressure, with the limiting case where all the divers available energy may be expended on simply breathing, with none left for other purposes. This would be followed by a buildup in carbon dioxide, causing an urgent feeling of a need to breathe, and if this cycle is not broken, panic and drowning are likely to follow. The use of a low density inert gas, typically helium, in the breathing mixture can reduce this problem, as well as diluting the narcotic effects of the other gases.     Breathing from a rebreather is much the same, except that the work of breathing is affected mainly by flow resistance in the breathing loop. This is partly due to the carbon dioxide absorbent in the scrubber, and is related to the distance the gas passes through the absorbent material, and the size of the gaps between the grains, as well as the gas composition and ambient pressure. Water in the loop can greatly increase the resistance to gas flow through the scrubber. There is even less point in shallow or skip breathing on a rebreather as this does not even conserve gas, and the affect on buoyancy is negligible when the sum of loop volume and lung volume remains constant.                   By the turn of the twentieth century, two basic architectures for underwater breathing apparatus had been pioneered; open-circuit surface supplied equipment where the divers exhaled gas is vented directly into the water, and closed-circuit breathing apparatus where the divers carbon dioxide is filtered from unused oxygen, which is then recirculated. Closed circuit equipment was more easily adapted to scuba in the absence of reliable, portable, and economical high pressure gas storage vessels. By the mid twentieth century, high pressure cylinders were available and two systems for scuba had emerged: ": null
    },
    {
        "open-circuit scuba": "open-circuit scuba"
    },
    {
        " where the divers exhaled breath is vented directly into the water, and ": null
    },
    {
        "closed-circuit scuba": "rebreather"
    },
    {
        " where the ": null
    },
    {
        "carbon dioxide": "carbon dioxide"
    },
    {
        " is removed from the divers exhaled breath which has oxygen added and is recirculated. Oxygen rebreathers are severely depth limited due to oxygen toxicity risk, which increases with depth, and the available systems for mixed gas rebreathers were fairly bulky and designed for use with diving helmets. The first commercially practical scuba rebreather was designed and built by the diving engineer ": null
    },
    {
        "Henry Fleuss": "henry fleuss"
    },
    {
        " in 42 while working for ": null
    },
    {
        "Siebe Gorman": "siebe gorman"
    },
    {
        " in London. His ": null
    },
    {
        "self contained breathing apparatus": "self contained breathing apparatus"
    },
    {
        " consisted of a rubber mask connected to a breathing bag, with an estimated 42–42% oxygen supplied from a copper tank and carbon dioxide scrubbed by passing it through a bundle of rope yarn soaked in a solution of caustic potash, the system giving a dive duration of up to about three hours. This apparatus had no way of measuring the gas composition during use. During the 42s and all through ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the British, Italians and Germans developed and extensively used oxygen rebreathers to equip the first ": null
    },
    {
        "frogmen": "frogman"
    },
    {
        ". The British adapted the Davis Submerged Escape Apparatus and the Germans adapted the ": null
    },
    {
        "Dräger": "drägerwerk"
    },
    {
        " submarine escape rebreathers, for their frogmen during the war. In the U.S. ": null
    },
    {
        "Major": "major"
    },
    {
        " Christian J. Lambertsen": "christian j. lambertsen"
    },
    {
        " invented an underwater free-swimming ": null
    },
    {
        "oxygen rebreather": "oxygen rebreather"
    },
    {
        " in 42 which was accepted by the ": null
    },
    {
        "Office of Strategic Services": "office of strategic services"
    },
    {
        ". In 42 he patented a modification of his apparatus, this time named SCUBA,, which became the generic English word for autonomous breathing equipment for diving, and later for the activity using the equipment. After World War II, military frogmen continued to use rebreathers since they do not make bubbles which would give away the presence of the divers. The high percentage of oxygen used by these early rebreather systems limited the depth at which they could be used due to the risk of convulsions caused by acute ": null
    },
    {
        "oxygen toxicity": "oxygen toxicity"
    },
    {
        ".     Although a working demand regulator system had been invented in 42 by ": null
    },
    {
        "Auguste Denayrouze": "auguste denayrouze"
    },
    {
        " and ": null
    },
    {
        "Benoît Rouquayrol": "benoît rouquayrol"
    },
    {
        ", the first open-circuit scuba system developed in 42 by ": null
    },
    {
        "Yves Le Prieur": "yves le prieur"
    },
    {
        " in France was a manually adjusted free-flow system with a low endurance, which limited the practical usefulness of the system. In 42 during the German occupation of France, ": null
    },
    {
        "Jacques-Yves Cousteau": "jacques-yves cousteau"
    },
    {
        " and ": null
    },
    {
        "Émile Gagnan": "émile gagnan"
    },
    {
        " designed the first successful and safe open-circuit scuba, known as the ": null
    },
    {
        "Aqua-Lung": "aqua-lung"
    },
    {
        ". Their system combined an improved demand regulator with high-pressure air tanks. This was patented in 42 To sell his regulator in English-speaking countries Cousteau registered the ": null
    },
    {
        "Aqua-Lung": "aqua-lung"
    },
    {
        " trademark, which was first licensed to the ": null
    },
    {
        "U.S. Divers": "u.s. divers"
    },
    {
        " company, and in 42 to Siebe Gorman of England, Siebe Gorman was allowed to sell in Commonwealth countries, but had difficulty in meeting the demand and the U.S. patent prevented others from making the product. The patent was circumvented by Ted Eldred of ": null
    },
    {
        "Melbourne": "melbourne"
    },
    {
        ", Australia, who developed the single-hose open-circuit scuba system, which separates the first stage and demand valve of the pressure regulator by a low-pressure hose, puts the demand valve at the divers mouth, and releases exhaled gas through the demand valve casing. Eldred sold the first ": null
    },
    {
        "Porpoise": "porpoise"
    },
    {
        " Model CA single hose scuba early in 42     Early scuba sets were usually provided with a plain harness of shoulder straps and waist belt. The waist belt buckles were usually quick-release, and shoulder straps sometimes had adjustable or quick release buckles. Many harnesses did not have a backplate, and the cylinders rested directly against the divers back. Early scuba divers dived without a buoyancy aid. In an emergency they had to jettison their weights. In the 42s ": null
    },
    {
        "adjustable buoyancy life jacket": "adjustable buoyancy life jacket"
    },
    {
        "s became available, which can be used to compensate for loss of buoyancy at depth due to compression of the ": null
    },
    {
        "neoprene": "neoprene"
    },
    {
        " wetsuit": "wetsuit"
    },
    {
        " and as a ": null
    },
    {
        "lifejacket": "lifejacket"
    },
    {
        " that will hold an unconscious diver face-upwards at the surface, and that can be quickly inflated. The first versions were inflated from a small disposable carbon dioxide cylinder, later with a small direct coupled air cylinder. A low-pressure feed from the regulator first-stage to an inflation/deflation valve unit an oral inflation valve and a dump valve lets the volume of the ABLJ be controlled as a buoyancy aid. In 42 the ": null
    },
    {
        "stabilizer jacket": "stabilizer jacket"
    },
    {
        " was introduced by ": null
    },
    {
        "ScubaPro": "scubapro"
    },
    {
        ". This class of buoyancy aid is known as a buoyancy control device or buoyancy compensator.        A backplate and wing is an alternative configuration of scuba harness with a buoyancy compensation bladder known as a wing mounted behind the diver, sandwiched between the backplate and the cylinder or cylinders. Unlike stabilizer jackets, the backplate and wing is a modular system, in that it consists of separable components. This arrangement became popular with cave divers making long or deep dives, who needed to carry several extra cylinders, as it clears the front and sides of the diver for other equipment to be attached in the region where it is easily accessible. This additional equipment is usually suspended from the harness or carried in pockets on the exposure suit. Sidemount is a scuba diving equipment configuration which has basic ": null
    },
    {
        "scuba sets": "scuba sets"
    },
    {
        ", each comprising a single cylinder with a dedicated regulator and pressure gauge, mounted alongside the diver, clipped to the harness below the shoulders and along the hips, instead of on the back of the diver. It originated as a configuration for advanced ": null
    },
    {
        "cave diving": "cave diving"
    },
    {
        ", as it facilitates penetration of tight sections of cave as, sets can be easily removed and remounted when necessary. The configuration allows easy access to cylinder valves, and provides easy and reliable gas redundancy. These benefits for operating in confined spaces were also recognized by divers who made ": null
    },
    {
        "wreck diving": "wreck diving"
    },
    {
        " penetrations. Sidemount diving has grown in popularity within the ": null
    },
    {
        "technical diving": "technical diving"
    },
    {
        " community for general ": null
    },
    {
        "decompression diving": "decompression diving"
    },
    {
        ", and has become a popular specialty for recreational diving.        Technical diving is recreational scuba diving that exceeds the generally accepted recreational limits, and may expose the diver to hazards beyond those normally associated with recreational diving, and to greater risks of serious injury or death. These risks may be reduced by appropriate skills, knowledge and experience, and by using suitable equipment and procedures. The concept and term are both relatively recent advents, although divers had already been engaging in what is now commonly referred to as technical diving for decades. One reasonably widely held definition is that any dive in which at some point of the planned profile it is not physically possible or physiologically acceptable to make a direct and uninterrupted vertical ascent to surface air is a technical dive. The equipment often involves breathing gases other than air or standard ": null
    },
    {
        "nitrox": "nitrox"
    },
    {
        " mixtures, multiple gas sources, and different equipment configurations. Over time, some equipment and techniques developed for technical diving have become more widely accepted for recreational diving.     The challenges of deeper dives and longer penetrations and the large amounts of breathing gas necessary for these dive profiles and ready availability of oxygen sensing cells beginning in the late 42s led to a resurgence of interest in rebreather diving. By accurately measuring the partial pressure of oxygen, it became possible to maintain and accurately monitor a breathable gas mixture in the loop at any depth. In the mid 42s semi-closed circuit rebreathers became available for the recreational scuba market, followed by closed circuit rebreathers around the turn of the millennium. Rebreathers are currently manufactured for the military, technical and recreational scuba markets.       Scuba sets are of two types:   In open-circuit scuba the diver inhales from the equipment and all the exhaled gas is exhausted to the surrounding water. This type of equipment is relatively simple, economical and reliable.   In closed-circuit or semi-closed circuit, also referred to as a  rebreather , the diver inhales from the set, and exhales back into the set, where the exhaled gas is processed to make it fit to breathe again. This equipment is efficient and quiet.     Both types of scuba set include a means of supplying ": null
    },
    {
        "air": "earths atmosphere"
    },
    {
        " or other ": null
    },
    {
        "breathing gas": "breathing gas"
    },
    {
        ", nearly always from a high ": null
    },
    {
        "pressure": "pressure"
    },
    {
        " diving cylinder": "diving cylinder"
    },
    {
        ", and a harness to attach it to the diver. Most open-circuit scuba sets have a ": null
    },
    {
        "demand regulator": "diving regulator"
    },
    {
        " to control the supply of breathing gas, and most rebreathers have a ": null
    },
    {
        "constant-flow injector": "diving regulatorconstant flow"
    },
    {
        ", or an electronically controlled injector to supply fresh gas, but also usually have an automatic diluent valve , which functions in the same way as a demand valve, to maintain the loop volume during descent.          Open-circuit-demand scuba exhausts exhaled air to the environment, and requires each breath to be delivered to the diver on demand by a diving regulator, which reduces the pressure from the storage cylinder and supplies it through the demand valve when the diver reduces the pressure in the demand valve slightly during inhalation.     The essential subsystems of an open-circuit scuba set are; ": null
    },
    {
        "diving cylinder": "diving cylinder"
    },
    {
        "s, with cylinder valves, which may be interconnected by a manifold,   a ": null
    },
    {
        "regulator": "diving regulator"
    },
    {
        " mechanism to control gas pressure,   a demand valve with mouthpiece, ": null
    },
    {
        "full-face mask": "full-face mask"
    },
    {
        " or ": null
    },
    {
        "helmet": "diving helmet"
    },
    {
        ", with supply hose, to control flow and deliver gas to the diver.   an exhaust valve system to dispose of used gas,   A harness or other method to attach the set to the diver.   Additional components which when present are considered part of the scuba set are;   external reserve valves and their control rods or levers,   submersible pressure gauges, and   secondary demand valves .   The ": null
    },
    {
        "buoyancy compensator": "buoyancy compensator"
    },
    {
        " is generally assembled as an integrated part of the set, but is not technically part of the breathing apparatus.     The cylinder is usually worn on the back. Twin sets with two low capacity back-mounted cylinders connected by a high pressure manifold were more common in the 42s than now for recreational diving, although larger capacity twin cylinders are commonly used by technical divers for increased dive duration and redundancy. At one time a firm called ": null
    },
    {
        "Submarine Products": "submarine products"
    },
    {
        " sold a sport air scuba set with three manifolded back-mounted cylinders. Cave and wreck penetration divers sometimes carry cylinders ": null
    },
    {
        "attached at their sides": "side mount diving"
    },
    {
        " instead, allowing them to swim through more confined spaces.     ": null
    },
    {
        "Newspapers": "newspapers"
    },
    {
        " and ": null
    },
    {
        "television": "television"
    },
    {
        " news": "news"
    },
    {
        " often wrongly describe open-circuit air scuba as oxygen equipment.          ": null
    },
    {
        "Constant flow scuba sets": "diving regulatorconstant flow"
    },
    {
        " do not have a demand regulator; the breathing gas flows at a constant rate, unless the diver switches it on and off by hand. They use more air than demand regulated scuba. There were attempts at designing and using these for diving and for industrial use before the Cousteau-type aqualung became commonly available circa 42 Examples were ": null
    },
    {
        "Charles Condert": "charles condert"
    },
    {
        " dress in the US , Ohgushis Peerless Respirator in Japan , and ": null
    },
    {
        "Commandant le Prieur": "yves le prieur"
    },
    {
        "s hand-controlled regulator in France ; see ": null
    },
    {
        "Timeline of diving technology": "timeline of diving technology"
    },
    {
        ".          This system consists of one or more ": null
    },
    {
        "diving cylinder": "diving cylinder"
    },
    {
        "s containing ": null
    },
    {
        "breathing gas": "breathing gas"
    },
    {
        " at high pressure, typically , connected to a ": null
    },
    {
        "diving regulator": "diving regulator"
    },
    {
        ". The demand regulator supplies the diver with as much gas as needed at the ambient pressure.     This type of breathing set is sometimes called an aqualung. The word  Aqua-Lung , which first appeared in the ": null
    },
    {
        "Cousteau": "jacques-yves cousteau"
    },
    {
        "-": null
    },
    {
        "Gagnan": "gagnan"
    },
    {
        " patent": "patent"
    },
    {
        ", is a ": null
    },
    {
        "trademark": "trademark"
    },
    {
        ", currently owned by ": null
    },
    {
        "Aqua Lung/La Spirotechnique": "aqua lung/la spirotechnique"
    },
    {
        ".           This is the first type of diving demand valve to come into general use, and the one that can be seen in classic 42s television scuba adventures, such as ": null
    },
    {
        "Sea Hunt": "sea hunt"
    },
    {
        ". They were often use with manifolded twin cylinders.     All the stages of this type of regulator are in a large valve assembly mounted directly to the cylinder valve or manifold, behind the divers neck. Two large bore corrugated rubber ": null
    },
    {
        "breathing hoses": "breathing tube"
    },
    {
        " connect the regulator with the mouthpiece, one for supply and one for exhaust. The exhaust hose is used to return the exhaled air to the regulator, to avoid pressure differences due to depth variation between the exhaust valve and final stage ": null
    },
    {
        "diaphragm": "diaphragm"
    },
    {
        ", which would cause a free-flow of gas, or extra resistance to breathing, depending on the divers orientation in the water. In modern single-hose sets this problem is avoided by moving the second-stage regulator to the divers ": null
    },
    {
        "mouthpiece": "mouthpiece"
    },
    {
        ". The twin-hose regulators came with a mouthpiece as standard, but a ": null
    },
    {
        "full-face diving mask": "full-face diving mask"
    },
    {
        " was an option.           Most modern open-circuit scuba sets have a ": null
    },
    {
        "diving regulator": "diving regulator"
    },
    {
        " consisting of a first-stage pressure-reducing valve connected to the ": null
    },
    {
        "diving cylinder": "diving cylinder"
    },
    {
        "s output valve or manifold. This regulator reduces the pressure from the cylinder, which may be up to , to a lower pressure, generally between about 42 and 42  bar above the ambient pressure. A low-pressure hose links this with the second-stage regulator, or demand valve , which is mounted on the mouthpiece. Exhalation occurs through a rubber one-way mushroom valve in the chamber of the demand valve, directly into the water quite close to the divers mouth. Some early single hose scuba sets used full-face masks instead of a mouthpiece, such as those made by Desco and Scott Aviation .     Modern regulators typically feature high-pressure ports for pressure sensors of dive-computers and submersible pressure gauges, and additional low-pressure ports for hoses for inflation of dry suits and BC devices.             Most recreational scuba sets have a backup second-stage demand valve on a separate hose, a configuration called a secondary , or octopus demand valve, alternate air source , safe secondary or safe-second . The idea was conceived by cave-diving pioneer ": null
    },
    {
        "Sheck Exley": "sheck exley"
    },
    {
        " as a way for cave divers to share air while swimming single-file in a narrow tunnel, but has now become the standard in recreational diving. By providing a secondary demand valve the need to alternately breathe off the same mouthpiece when sharing air is eliminated. This reduces the stress on divers who are already in a stressful situation, and this in turn reduces air consumption during the rescue and frees the donors hand.     Some diver training agencies recommend that a diver routinely offer their primary demand valve to a diver requesting to share air, and then switch to their own secondary demand valve. The idea behind this technique is that the primary demand valve is known to be working, and the diver donating the gas is less likely to be stressed or have a high carbon dioxide level, so has more time to sort out their own equipment after temporarily suspending the ability to breathe. In many instances, panicked divers have grabbed the primary regulators out of the mouths of other divers, so changing to the backup as a routine reduces stress when it is necessary in an emergency.     In ": null
    },
    {
        "technical diving": "technical diving"
    },
    {
        " donation of the primary demand valve is commonly the standard procedure, and the primary is connected to the first stage by a long hose, typically around 42  m, to allow gas sharing while swimming in single file in a narrow space as might be required in a cave or wreck. In this configuration the secondary is generally held under the chin by a loose bungee loop around the neck, supplied by a shorter hose, and is intended for backup use by the diver donating gas. The backup regulator is usually carried in the divers chest area where it can be easily seen and accessed for emergency use. It may be worn secured by a breakaway clip on the ": null
    },
    {
        "buoyancy compensator": "buoyancy compensator"
    },
    {
        ", plugged into a soft friction socket attached to the harness, secured by sliding a loop of the hose into the shoulder strap cover of a jacket style BC, or suspended under the chin on a break-away bungee loop known as a necklace. These methods also keep the secondary from dangling below the diver and being contaminated by debris or snagging on the surroundings. Some divers store it in a BC pocket, but this reduces availability in an emergency.     Occasionally, the secondary second-stage is combined with the inflation and exhaust valve assembly of the buoyancy compensator device. This combination eliminates the need for a separate low pressure hose for the BC, though the low pressure hose connector for combined use must have a larger bore than for standard BC inflation hoses, because it will need to deliver a higher flow rate if it is used for breathing. This combination unit is carried in the position where the inflator unit would normally hang on the left side of the chest. With integrated DV/BC inflator designs, the secondary demand valve is at the end of the shorter BC inflation hose, and the donor must retain access to it for buoyancy control, so donation of the primary regulator to help another diver is essential with this configuration.     The secondary demand valve is often partially yellow in color, and may use a yellow hose, for high visibility, and as an indication that it is an emergency or backup device.     When a side-mount configuration is used, the usefulness of a secondary demand valve is greatly reduced, as each cylinder will have a regulator and the one not in use is available as a backup. This configuration also allows the entire cylinder to be handed off to the receiver, so a long hose is also less likely to be needed.     Some diving instructors continue to teach buddy-breathing from a single demand valve as an obsolescent but still occasionally useful technique, learned in addition to the use of the backup DV, since availability of two second stages per diver is now assumed as standard in recreational scuba.       There have been designs for a cryogenic open-circuit scuba which has liquid-air tanks instead of cylinders. Underwater cinematographer Jordan Klein, Sr. of ": null
    },
    {
        "Florida": "florida"
    },
    {
        " co-designed such a scuba in 42 called Mako , and made at least a ": null
    },
    {
        "prototype": "prototype"
    },
    {
        ".     The Russian Kriolang  was copied from Jordan Kleins Mako cryogenic open-circuit scuba. and were made until at least 42 It would have to be filled a short time before use.       This type is mentioned here because it is very familiar in ": null
    },
    {
        "comic": "comic"
    },
    {
        "s and other drawings, as a wrongly-drawn twin-hose two-cylinder aqualung, with one wide hose coming out of each cylinder top to the mouthpiece with no apparent regulator valve, much more often than a correctly-drawn twin-hose regulator : see ": null
    },
    {
        "Underwater diving in popular cultureErrors about frogmen found in public media": "underwater diving in popular cultureerrors about frogmen found in public media"
    },
    {
        ". It would not work in the real world. Examples, and variations, at , ,                A ": null
    },
    {
        "rebreather": "rebreather"
    },
    {
        " recirculates the breathing gas already used by the diver after replacing oxygen used by the diver and removing the carbon dioxide metabolic product. Rebreather diving is used by recreational, military and scientific divers where it can have advantages over open-circuit scuba. Since 42% or more of the oxygen remains in normal exhaled gas, and is thus wasted, rebreathers use gas very economically, making longer dives possible and special mixes cheaper to use at the cost of more complicated technology and more possible failure points. More stringent and specific training and greater experience is required to compensate for the higher risk involved. The rebreathers economic use of gas, typically  of oxygen per minute, allows dives of much longer duration for an equivalent gas supply than is possible with open-circuit equipment where gas consumption may be ten times higher.     There are two main variants of rebreather  – semi-closed circuit rebreathers, and fully closed circuit rebreathers, which include the subvariant of oxygen rebreathers. Oxygen rebreathers have a ": null
    },
    {
        "maximum safe operating depth": "maximum operating depth"
    },
    {
        " of around , but several types of fully closed circuit rebreathers, when using a ": null
    },
    {
        "helium": "helium"
    },
    {
        "-based diluent, can be used deeper than . The main limiting factors on rebreathers are the duration of the carbon dioxide scrubber, which is generally at least 42 hours, increased work of breathing at depth, reliability of gas mixture control, and the requirement to be able to safely bail out at any point of the dive.     Rebreathers are generally used for scuba applications, but are also occasionally used for bailout systems for surface supplied diving.     The possible endurance of a rebreather dive is longer than an open-circuit dive, for similar weight and bulk of the set, if the set is bigger than the practical lower limit for rebreather size, and a rebreather can be more economical when used with expensive gas mixes such as ": null
    },
    {
        "heliox": "heliox"
    },
    {
        " and ": null
    },
    {
        "trimix": "trimix"
    },
    {
        ", but this may require a lot of diving before the break-even point is reached, due to the high initial and running costs of most rebreathers, and this point will be reached sooner for deep dives where the gas saving is more pronounced.          Until ": null
    },
    {
        "Nitrox": "nitrox"
    },
    {
        ", which contains more oxygen than air, was widely accepted in the late 42s, almost all recreational scuba used simple compressed and filtered air. Other gas mixtures, typically used for deeper dives by ": null
    },
    {
        "technical": "technical diving"
    },
    {
        " divers, may substitute helium for some or all of the nitrogen , or use lower proportions of oxygen than air. In these situations divers often carry additional scuba sets, called stages, with gas mixtures with higher levels of oxygen that are primarily used to reduce decompression time in staged ": null
    },
    {
        "decompression diving": "decompression"
    },
    {
        ". These gas mixes allow longer dives, better management of the risks of ": null
    },
    {
        "decompression sickness": "decompression sickness"
    },
    {
        ", ": null
    },
    {
        "oxygen toxicity": "oxygen toxicity"
    },
    {
        " or lack of oxygen , and the severity of ": null
    },
    {
        "nitrogen narcosis": "nitrogen narcosis"
    },
    {
        ". Closed circuit scuba sets  provide a gas mix that is controlled to optimise the mix for the actual depth at the time.            ": null
    },
    {
        "Gas cylinder": "gas cylinder"
    },
    {
        "s used for scuba diving come in various sizes and materials and are typically designated by material  – usually ": null
    },
    {
        "aluminium": "aluminium"
    },
    {
        " or ": null
    },
    {
        "steel": "steel"
    },
    {
        ", and size. In the U.S. the size is designated by their ": null
    },
    {
        "nominal capacity": "diving cylindernominal volume of gas stored"
    },
    {
        ", the volume of the gas they contain when expanded to normal atmospheric pressure. Common sizes include 42 42 42 cubic feet, etc., with the most common being the Aluminum 42 . In most of the rest of the world the size is given as the actual internal volume of the cylinder, sometimes referred to as water capacity, as that is how it is measured and marked on the cylinder .      Cylinder working pressure will vary according to the standard of manufacture, generally ranging from  up to .     An aluminium cylinder is thicker and bulkier than a steel cylinder of the same capacity and working pressure, as suitable aluminium alloys have lower tensile strength than steel, and is more buoyant although actually heavier out of the water, which means the diver would need to carry more ballast weight. Steel is also more often used for high pressure cylinders, which carry more air for the same internal volume.     The common ": null
    },
    {
        "method of blending nitrox by partial pressure": "gas blendingblending nitrox"
    },
    {
        " requires that the cylinder is in oxygen service , which means that the cylinder and cylinder valve have had any non-oxygen-compatible components replaced and any contamination by combustible materials removed by cleaning.   Diving cylinders are sometimes colloquially called tanks , bottles or flasks although the proper technical term for them is cylinder .               The scuba set can be carried by the diver in several ways. The two most common basic mounting configurations are back-mount and side-mount, and back-mount may be expanded to include auxiliary side-mounting, including bungee-constrained low profile side-mount, and the less compact sling-mount or stage-mount arrangement.     Most common for recreational diving is the stabilizer jacket harness, in which a single cylinder, or occasionally twins, is strapped to the jacket style buoyancy compensator which is used as the harness. Some jacket style harnesses allow a bailout or decompression cylinder to be sling mounted from D-rings on the harness. A ": null
    },
    {
        "bailout cylinder": "bailout cylinder"
    },
    {
        " can also be strapped to the side of the main back-mounted cylinder.             Another popular configuration is the ": null
    },
    {
        "backplate and wing": "backplate and wing"
    },
    {
        " arrangement, which uses a back inflation buoyancy compensator bladder sandwiched between a rigid backplate and the main gas cylinder or cylinders. This arrangement is particularly popular with twin or double cylinder sets, and can be used to carry larger sets of three or four cylinders and most rebreathers. Additional cylinders for ": null
    },
    {
        "decompression": "decompression"
    },
    {
        " can be sling mounted at the divers sides.     It is also possible to use a plain backpack harness to support the set, either with a horse-collar buoyancy compensator, or without any buoyancy compensator. This was the standard arrangement before the introduction of the buoyancy compensator, and is still used by some recreational and professional divers when it suits the diving operation.     Surface-supplied divers are generally required to carry an emergency gas supply, also known as a ": null
    },
    {
        "bailout set": "bailout set"
    },
    {
        ", which is usually back-mounted open circuit scuba connected into the breathing gas supply system by connecting an interstage hose to the gas switching block, , mounted on the side of the helmet or full-face mask, or on the divers harness where it can easily be reached, but is unlikely to be accidentally opened. Other mounting arrangements may be used for special circumstances.             ": null
    },
    {
        "Side-mount": "sidemount diving"
    },
    {
        " harnesses support the cylinders by clipping them to D-rings at chest and hip on either or both sides, and the cylinders hang roughly parallel to the divers torso when underwater. The harness usually includes a buoyancy compensator bladder. It is possible for a skilled diver to carry up to 42 cylinders on each side with this system.     An unusual configuration which does not appear to have become popular is the integrated harness and storage container. These units comprise a bag which contains the buoyancy bladder and the cylinder, with a harness and regulator components which are stored in the bag and unfolded to the working position when the bag is unzipped. Some military rebreathers such as the ": null
    },
    {
        "Interspiro DCSC": "interspiro dcsc"
    },
    {
        " also store the breathing hoses inside the housing when not in use.     ": null
    },
    {
        "Technical divers": "technical diving"
    },
    {
        " may need to carry several different gas mixtures. These are intended to be used at different stages of the planned dive profile, and for safety reasons it is necessary for the diver to be able to check which gas is in use at any given depth and time, and to open and close the supply valves when required, so the gases are generally carried in fully self-contained independent scuba sets, which are suspended from the harness at the divers sides. This arrangement is known as stage mounting. Stage sets may be cached along a penetration guideline to be retrieved during exit for convenience. These are also sometimes called drop tanks.       Every scuba harness requires a system for supporting the cylinders on the harness, and a system for attaching the harness to the diver.       The most basic arrangement for a back-mounted set consists of a metal or webbing strap around the cylinder just below the shoulder, and another lower down the cylinder, to which webbing shoulder and waist straps are attached. Shoulder straps can be of fixed length to suit a particular diver, but are more often adjustable. Sometimes a quick release buckle is added to one or both of the shoulder straps. The waist belt has a buckle for closing and release. and the waist belt is usually adjustable for security and comfort. Various attachments have been used to attach the harness straps to the cylinder bands. A crotch strap is optional, and usually runs from the lower cylinder band to the front of the waistband. This strap prevents the set from riding upwards on the diver when in use. This arrangement is still occasionally seen in use.          The characteristic difference between this and the basic harness, is that a rigid or flexible backplate is added between the cylinder and the harness straps. The cylinder is attached to the backplate by metal or webbing straps, and the harness straps are attached to the backplate. In other respects the system is similar to the basic harness. Methods of fixing the cylinder include metal clamping bands, secured by bolts or lever operated clamps, or webbing straps, usually secured by cam buckles.     This style of harness was originally used in this simple form, but is currently more usually used with a back inflation wing type buoyancy compensator sandwiched between the cylinder and the backplate.              The combination of webbing strap and cam action buckle that is used to secure the cylinder to a ": null
    },
    {
        "buoyancy compensator": "buoyancy compensator"
    },
    {
        " or backplate is known as a cam band or cam strap. They are a type of tank band, which includes the stainless steel straps used to hold twin cylinder sets together. They generally rely on an over-centre lever action to provide tensioning and locking, which may be modified by length adjustment slots and secondary security fastening such as ": null
    },
    {
        "velcro": "velcro"
    },
    {
        " to hold the free end in place. Most cam buckles for scuba are injection moulded plastic, but some are stainless steel. Many recreational scuba harnesses rely on a single cam band to hold the cylinder to the backplate. Other models provide two cam bands for security. A cam band can also be used on a sling or sidemount scuba set to attach the lower clip to the cylinder.        Stainless steel tank bands are the standard method for supporting manifolded twin cylinders, as they provide good support for the cylinders, minimise loads on the manifolds and provide simple and reliable attachment points for connection to a backplate          The most basic sidemount harness is little more than cylinders fitted with belt loops and slid onto the standard cavers belay or battery belt along with any extra weights needed to achieve neutral buoyancy, and a cavers belt mounted battery pack. This simple configuration is particularly low profile and suited to small cylinders.     A more complex but still minimalist system is a webbing harness with shoulder straps, waist belt and crotch strap, supporting a variety of sliders and D-rings for attachment of cylinders and accessories, with or without integrated weighting or separate weight belts, and with or without a back mounted buoyancy compensator, which may be attached to the harness, or directly to the diver. Cylinders are usually attached to a shoulder or chest D-ring and waist belt D-ring on each side.       In most scuba sets, a ": null
    },
    {
        "buoyancy compensator": "buoyancy compensator"
    },
    {
        " or buoyancy control device , such as a back-mounted wing or stabilizer jacket , is built into the harness. Although strictly speaking this is not a part of the breathing apparatus, it is usually connected to the divers air supply, to provide easy inflation of the device. This can usually also be done manually via a mouthpiece, in order to save air while on the surface, or in case of a malfunction of the pressurized inflation system. The BCD inflates with air from the low pressure inflator hose to increase the volume of the scuba equipment and cause the diver gain buoyancy. Another button opens a valve to deflate the BCD and decrease the volume of the equipment and causes the diver to lose buoyancy. Some BCDs allow for integrated weight, meaning that the BCD has special pockets for the weights that can be dumped easily in case of an emergency. The function of the BCD, while underwater, is to keep the diver neutrally buoyant, i.e., neither floating up or sinking. The BCD is used to compensate for the compression of a wet suit, and to compensate for the decrease of the divers mass as the air from the cylinder is breathed away.     ": null
    },
    {
        "Diving weighting system": "diving weighting system"
    },
    {
        "s increase the average density of the scuba diver and equipment to compensate for the buoyancy of diving equipment, particularly the diving suit, allowing the diver to fully submerge with ease by obtaining neutral or slightly negative buoyancy. Weighting systems originally consisted of solid lead blocks attached to a belt around the divers waist, but some diving weighting systems are incorporated into the BCD or harness. These systems may use small nylon bags of lead shot or small weights which are distributed around the BCD, allowing a diver to gain a better overall weight distribution leading to a more horizontal ": null
    },
    {
        "trim": "diver trim"
    },
    {
        " in the water. Tank weights can be attached to the cylinder or threaded on the cambands holding the cylinder into the BCD.     Many closed circuit rebreathers use advanced ": null
    },
    {
        "electronics": "electronics"
    },
    {
        " to monitor and regulate the composition of the breathing gas.     Rebreather divers and some open-circuit scuba divers carry extra ": null
    },
    {
        "diving cylinder": "diving cylinder"
    },
    {
        "s for bailout in case the main breathing gas supply is used up or malfunctions. If the bailout cylinder is small, they may be called ": null
    },
    {
        "pony cylinders": "pony cylinders"
    },
    {
        " . They have their own ": null
    },
    {
        "demand regulators": "diving regulator"
    },
    {
        " and mouthpieces, and are technically distinct extra scuba sets. In ": null
    },
    {
        "technical diving": "technical diving"
    },
    {
        ", the diver may carry different equipment for different phases of the dive. Some ": null
    },
    {
        "breathing gas": "breathing gas"
    },
    {
        " mixes, such as trimix, may only be used at depth, and others, such as pure ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        ", may only be used during ": null
    },
    {
        "decompression stop": "decompression stop"
    },
    {
        "s in shallow water. The heaviest cylinders are generally carried on the back supported by a ": null
    },
    {
        "backplate": "backplate and wing"
    },
    {
        " while others are side slung from strong points on the harness.     When the diver carries many diving cylinders, especially those made of ": null
    },
    {
        "steel": "steel"
    },
    {
        ", lack of ": null
    },
    {
        "buoyancy": "buoyancy"
    },
    {
        " can be a problem. High-capacity BCs may be needed to allow the diver to effectively control buoyancy.     An excess of tubes and connections passing through the water tend to decrease swimming performance by causing ": null
    },
    {
        "hydrodynamic": "hydrodynamic"
    },
    {
        " drag": "drag"
    },
    {
        ".     A diffuser is a component fitted over the exhaust outlet to break up the exhaled gas into bubbles small enough not to be seen above the surface the water, and make less noise . They are used in combat diving, to avoid detection by surface observers or by underwater ": null
    },
    {
        "hydrophone": "hydrophone"
    },
    {
        "s, ": null
    },
    {
        "Underwater mine": "naval mine"
    },
    {
        " disposal operations conducted by ": null
    },
    {
        "clearance diver": "clearance diver"
    },
    {
        "s, to make less noise, to reduce the risk of detonating ": null
    },
    {
        "acoustic mine": "acoustic mine"
    },
    {
        "s, and in ": null
    },
    {
        "marine biology": "marine biology"
    },
    {
        ", to avoid disruption of fish behavior.     Designing an adequate diffuser for a ": null
    },
    {
        "rebreather": "rebreather"
    },
    {
        " is much easier than for ": null
    },
    {
        "open-circuit scuba": "open-circuit scuba"
    },
    {
        ", as the gas flow rate is generally much lower. An open-circuit diffuser system called the scuba ": null
    },
    {
        "muffler": "muffler"
    },
    {
        " was prototyped by ": null
    },
    {
        "Eddie Paul": "eddie paul"
    },
    {
        " in the early 42s for underwater photographers ": null
    },
    {
        "John McKenney": "john mckenney"
    },
    {
        " and ": null
    },
    {
        "Marty Snyderman": "marty snyderman"
    },
    {
        "; the prototype had two large filter stones mounted on the back of the cylinder with a hose connected to the exhaust ports of the ": null
    },
    {
        "second-stage regulator": "diving regulatordemand valve"
    },
    {
        ". The filter stones were mounted on a hinged arm to float  above the diver, to set up a depth-pressure-differential suction effect to counteract the extra exhalation pressure needed to breathe out through the diffuser. The scuba muffler was claimed to cut the exhalation noise by 42%. ": null
    },
    {
        "Closed circuit rebreather": "closed circuit rebreather"
    },
    {
        "s proved more useful in letting divers get near sharks.               Gas endurance of a scuba set is the time that the gas supply will last during a dive. This is influenced by the type of scuba set and the circumstances in which it is used.       The gas endurance of open-circuit-demand scuba depends on factors such as the capacity in the ": null
    },
    {
        "diving cylinder": "diving cylinder"
    },
    {
        ", the depth of the dive and the breathing rate of the diver, which is dependent on exertion, fitness, physical size of the diver, state of mind, and experience, among other factors. New divers frequently consume all the air in a standard aluminum 42 cylinder in 42 minutes or less on a typical dive, while experienced divers frequently dive for 42 to 42 minutes at the same average depth, using the same capacity cylinder, as they have learned more efficient diving techniques.     An open-circuit diver whose breathing rate at the surface is 42 litres per minute will consume 42 x 42 42 litres of gas per minute at 42 metres. × 42 L/min 42 L/min42% × 42 × 42/42around 42 hours42 litres × 42 bar × 42 litres per minute 42 minutessee ": null
    },
    {
        "Decompression ": "decompression"
    }
]