[
    {
        "            Sean John Combs , also known by the ": null
    },
    {
        "stage name": "stage name"
    },
    {
        "s Puff Daddy, P. Diddy, Puffy, or Diddy, is an American rapper, singer, record producer, entrepreneur, record executive, and actor. Combs was born in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " but was raised in ": null
    },
    {
        "Mount Vernon, New York": "mount vernon, new york"
    },
    {
        ". He worked as a talent director at ": null
    },
    {
        "Uptown Records": "uptown records"
    },
    {
        " before founding his own record label, ": null
    },
    {
        "Bad Boy Entertainment": "bad boy entertainment"
    },
    {
        ", in 42     Combs debut album,  No Way Out  , has been certified ": null
    },
    {
        "seven times platinum": "riaa certification"
    },
    {
        ". No Way Out was followed by successful albums such as  Forever  ,  The Saga Continues...  , and  Press Play  . In 42 Combs formed the musical group ": null
    },
    {
        "Dirty Money": "dirty money"
    },
    {
        " and released the critically and commercially successful album  Last Train to Paris  .     Combs has won three ": null
    },
    {
        "Grammy Award": "grammy award"
    },
    {
        "s and two ": null
    },
    {
        "MTV Video Music Award": "mtv video music award"
    },
    {
        "s, and is the producer of ": null
    },
    {
        "MTV": "mtv"
    },
    {
        "s  Making the Band . In 42  Forbes  estimated his ": null
    },
    {
        "net worth": "net worth"
    },
    {
        " at $42 million, making him the second-richest hip-hop recording artist, after ": null
    },
    {
        "Jay-Z": "jay-z"
    },
    {
        ".       Sean John Combs was born on November 42 42 in Manhattans ": null
    },
    {
        "Harlem": "harlem"
    },
    {
        " in New York City and was raised in Mount Vernon, New York. His mother, Janice , was a model and teachers assistant and his father, Melvin Earl Combs, served in the ": null
    },
    {
        "U.S. Air Force": "u.s. air force"
    },
    {
        " and was an associate of convicted New York drug dealer ": null
    },
    {
        "Frank Lucas": "frank lucas"
    },
    {
        ". At age 42 Melvin was shot to death while sitting in his car on ": null
    },
    {
        "Central Park West": "central park west"
    },
    {
        ", when Combs was 42 years old.     Combs graduated from the Roman Catholic ": null
    },
    {
        "Mount Saint Michael Academy": "mount saint michael academy"
    },
    {
        " in 42 He played ": null
    },
    {
        "football": "gridiron football"
    },
    {
        " for the academy and his team won a division title in 42 Combs said he was given the nickname Puff as a child, because he would huff and puff when he was angry.     Combs was a business major at ": null
    },
    {
        "Howard University": "howard university"
    },
    {
        " but left after his sophomore year. In 42 he returned to Howard University to receive an Honorary Doctorate in Humanities and deliver the Universitys 42th Commencement Address.                Combs became an ": null
    },
    {
        "intern": "intern"
    },
    {
        " at New Yorks ": null
    },
    {
        "Uptown Records": "uptown records"
    },
    {
        ". While working as a talent director at Uptown, he helped develop ": null
    },
    {
        "Jodeci": "jodeci"
    },
    {
        " and ": null
    },
    {
        "Mary J. Blige": "mary j. blige"
    },
    {
        ". In his college days Combs had a reputation for throwing parties, some of which attracted up to a thousand participants. In 42 Combs promoted an AIDS fundraiser with ": null
    },
    {
        "Heavy D": "heavy d"
    },
    {
        " held at the ": null
    },
    {
        "City College of New York": "city college of new york"
    },
    {
        " gymnasium, following a charity basketball game. The event was oversold, and a stampede occurred in which nine people died.     In 42 after being fired from Uptown, Combs established his new label ": null
    },
    {
        "Bad Boy Entertainment": "bad boy entertainment"
    },
    {
        " as a joint venture with ": null
    },
    {
        "Arista Records": "arista records"
    },
    {
        ", taking then-newcomer ": null
    },
    {
        "The Notorious B.I.G.": "the notorious b.i.g."
    },
    {
        " with him. Both The Notorious B.I.G. and ": null
    },
    {
        "Craig Mack": "craig mack"
    },
    {
        " quickly released hit singles, followed by successful LPs, particularly Notorious B.I.G.s  Ready to Die . Combs signed more acts to Bad Boy, including ": null
    },
    {
        "Carl Thomas": "carl thomas"
    },
    {
        ", ": null
    },
    {
        "Faith Evans": "faith evans"
    },
    {
        ", ": null
    },
    {
        "42": "112"
    },
    {
        ", ": null
    },
    {
        "Total": "total"
    },
    {
        ", and ": null
    },
    {
        "Father MC": "father mc"
    },
    {
        ". The Hitmen, his in-house production team, worked with ": null
    },
    {
        "Jodeci": "jodeci"
    },
    {
        ", Mary J. Blige, ": null
    },
    {
        "Usher": "usher"
    },
    {
        ", ": null
    },
    {
        "Lil Kim": "lil kim"
    },
    {
        ", ": null
    },
    {
        "TLC": "tlc"
    },
    {
        ", ": null
    },
    {
        "Mariah Carey": "mariah carey"
    },
    {
        ", ": null
    },
    {
        "Boyz II Men": "boyz ii men"
    },
    {
        ", ": null
    },
    {
        "SWV": "swv"
    },
    {
        ", ": null
    },
    {
        "Aretha Franklin": "aretha franklin"
    },
    {
        ", and others. ": null
    },
    {
        "Mase": "mase"
    },
    {
        " and ": null
    },
    {
        "the Lox": "the lox"
    },
    {
        " joined Bad Boy just as a widely publicized rivalry with the West Coasts ": null
    },
    {
        "Death Row Records": "death row records"
    },
    {
        " was beginning. Combs and Notorious B.I.G. were criticized and parodied by ": null
    },
    {
        "Tupac Shakur": "tupac shakur"
    },
    {
        " and ": null
    },
    {
        "Suge Knight": "suge knight"
    },
    {
        " in songs and interviews during the mid42s. During 42–42 Combs produced several songs for TLCs  CrazySexyCool , which finished the decade as number 42 on Billboards list of top pop albums of the decade.      No Way Out": null
    },
    {
        "Cant Nobody Hold Me Down": "cant nobody hold me down"
    },
    {
        " , spent 42 weeks on the ": null
    },
    {
        "Billboard Hot 42": "billboard hot 100"
    },
    {
        " chart, peaking at number one. His debut album,  No Way Out , was released on July 42 42 through Bad Boy Records. Originally titled Hell up in Harlem, the album underwent several changes after ": null
    },
    {
        "The Notorious B.I.G. was killed": "murder of christopher wallace"
    },
    {
        " on March 42 42 Several of the labels artists made guest appearances on the album. No Way Out was a significant success, particularly in the United States, where it reached number one on the ": null
    },
    {
        "Billboard 42": "billboard 200"
    },
    {
        " in its first week of release, selling 42 copies. The album produced five singles: ": null
    },
    {
        "Ill Be Missing You": "ill be missing you"
    },
    {
        " , a tribute to The Notorious B.I.G., was the first rap song to debut at number one on the Billboard Hot 42; it remained at the top of the chart for eleven consecutive weeks and topped several other charts worldwide. Four other singles; Cant Nobody Hold Me Down , ": null
    },
    {
        "Its All About the Benjamins": "its all about the benjamins"
    },
    {
        " , ": null
    },
    {
        "Been Around the World": "been around the world"
    },
    {
        " , and ": null
    },
    {
        "Victory": "victory"
    },
    {
        " , were also released. Combs collaborated with ": null
    },
    {
        "Jimmy Page": "jimmy page"
    },
    {
        " on the song ": null
    },
    {
        "Come with Me": "come with me"
    },
    {
        " for the 42 film  Godzilla .     The album earned Combs five nominations at the ": null
    },
    {
        "42th Grammy Awards": "40th grammy awards"
    },
    {
        " in 42 winning the ": null
    },
    {
        "Grammy Award for Best Rap Album": "grammy award for best rap album"
    },
    {
        ".  On September 42 42 the album was certified septuple platinum by the ": null
    },
    {
        "Recording Industry Association of America": "recording industry association of america"
    },
    {
        " for sales of over 42 million copies. In 42 Combs was sued for landlord neglect by Inge Bongo. Combs denied the charges. By the late 42s, he was being criticized for watering down and overly commercializing hip hop, and for using too many guest appearances, ": null
    },
    {
        "samples": "sampling"
    },
    {
        ", and ": null
    },
    {
        "interpolations": "interpolation"
    },
    {
        " of past hits in his new songs.     Forever and Club New York": null
    },
    {
        "Steve Stoute": "steve stoute"
    },
    {
        " of ": null
    },
    {
        "Interscope Records": "interscope records"
    },
    {
        ". Stoute was the manager for ": null
    },
    {
        "Nas": "nas"
    },
    {
        ", with whom Combs had filmed a video earlier that year for the song ": null
    },
    {
        "Hate Me Now": "hate me now"
    },
    {
        " . Combs was concerned that the video, which featured a shot of Nas and Combs being crucified, was blasphemous. He asked for his scenes on the cross to be pulled, but after it aired unedited on MTV on April 42 Combs visited Stoutes offices and injured Stoute. Combs was charged with second-degree assault and criminal mischief, and was sentenced to attend a one-day anger management class.      Forever , Combs second solo studio album, was released by Bad Boy Records on August 42 42 in North America, and in the UK on the following day. It reached number two on the Billboard 42 and number one on the ": null
    },
    {
        "Top R & B/Hip-Hop Albums": "top r & b/hip-hop albums"
    },
    {
        " chart, where it remained for one week before being knocked off by Mary J. Bliges fourth album,  Mary . The album received positive to mixed reviews from music critics and spawned three singles that have charted on the ": null
    },
    {
        "Billboard": "billboard"
    },
    {
        " charts. It peaked at number four on the ": null
    },
    {
        "Canadian Albums Chart": "canadian albums chart"
    },
    {
        ", Combs highest-charting album in that country.     On December 42 42 Combs and his then-girlfriend ": null
    },
    {
        "Jennifer Lopez": "jennifer lopez"
    },
    {
        " were at Club New York in Manhattan when gunfire broke out. After a police investigation, Combs and fellow rapper ": null
    },
    {
        "Shyne": "shyne"
    },
    {
        " were arrested for weapons violations and other charges. Combs was charged with four weapons-related charges and bribing his driver, Wardel Fenderson, to claim ownership of his gun.     With a ": null
    },
    {
        "gag order": "gag order"
    },
    {
        " in place, the highly publicized trial began. Combs attorneys were ": null
    },
    {
        "Johnnie L. Cochran Jr.": "johnnie cochran"
    },
    {
        " and ": null
    },
    {
        "Benjamin Brafman": "benjamin brafman"
    },
    {
        ". Combs was found not guilty on all charges; Shyne was convicted on five of his eight charges and sentenced to ten years in prison. Combs and Lopez broke up shortly after. A lawsuit filed by Fenderson, who said he suffered emotional damage after the shooting, was settled in February 42 Lawyers for both sides, having agreed to keep the settlement terms secret, said the matter had been resolved to the satisfaction of all parties .     The Saga Continues": null
    },
    {
        "gospel": "gospel music"
    },
    {
        " album, Thank You, which had been completed just before the beginning of the weapons trial, was due to be released in March that year, but remains unreleased . He appeared as a drug dealer in the film  Made  and starred with ": null
    },
    {
        "Halle Berry": "halle berry"
    },
    {
        " and ": null
    },
    {
        "Billy Bob Thornton": "billy bob thornton"
    },
    {
        " in  Monsters Ball  . He was arrested for driving on a suspended license in Florida. Combs began working with a series of unusual artists. For a short period of time, he was the manager of ": null
    },
    {
        "Kelis": "kelis"
    },
    {
        "; they have a collaboration titled Lets Get Ill . He was an opening act for ": null
    },
    {
        "N Sync": "n sync"
    },
    {
        " on their Spring 42 Celebrity Tour, and he signed California-based pop ": null
    },
    {
        "girl group": "girl group"
    },
    {
        " Dream": "dream"
    },
    {
        " to his record label. Combs was a producer of the soundtrack album for the film  Training Day  .     In June 42 Combs ended Bad Boy Entertainments joint venture with Arista Records, gaining full control of Bad Boy, its catalogue, and its roster of artists.  The Saga Continues... , released on July 42 in North America, was the last studio album released by the joint venture. The album reached number 42 on the Billboard 42 and the Top R & B/Hip-Hop Albums charts, and was eventually certified Platinum. It is the only studio album under the P. Diddy name, and the first album by Sean Combs not to feature any guest appearances by Jay-Z or Lil Kim. Combs was executive producer of the reality TV show  Making the Band , which appeared on MTV from 42 to 42 The show involves interviewing candidates and creating musical acts that would then enter the music business. Acts who got their start this way include ": null
    },
    {
        "Da Band": "da band"
    },
    {
        ", ": null
    },
    {
        "Danity Kane": "danity kane"
    },
    {
        ", ": null
    },
    {
        "Day42": "day26"
    },
    {
        ", and ": null
    },
    {
        "Donnie Klang": "donnie klang"
    },
    {
        ".     In 42 Combs ran in the ": null
    },
    {
        "New York City Marathon": "new york city marathon"
    },
    {
        ", raising $42million for the educational system of the city of New York. On March 42 42 he appeared on  The Oprah Winfrey Show  to discuss the marathon, which he finished in four hours and eighteen minutes. In 42 Combs headed the campaign ": null
    },
    {
        "Vote or Die": "vote or die"
    },
    {
        " for the 42 presidential election. On February 42 42 Combs performed at the ": null
    },
    {
        "Super Bowl XXXVIII": "super bowl xxxviii"
    },
    {
        " halftime show.     Press Play   On August 42 42 Combs announced on  Today  that he was altering his stage name yet again; he would be calling himself Diddy . Combs said fans didnt know how to address him, which led to confusion. In November 42 London-based musical artist and DJ ": null
    },
    {
        "Richard Dearlove": "diddy"
    },
    {
        ", who had been performing under the name Diddy since 42 nine years before Combs started using even P. Diddy  sought an injunction in the ": null
    },
    {
        "High Court of Justice": "high court of justice"
    },
    {
        " in London. He accepted an out-of-court settlement of £42 in damages and more than £42 in ": null
    },
    {
        "costs": "costs"
    },
    {
        ". Combs can no longer use the name Diddy in the UK, where he is still known as P. Diddy. An assault charge against Combs filed by Michigan television host ": null
    },
    {
        "Rogelio Mills": "rogelio mills"
    },
    {
        " was resolved in Combs favor in 42     Combs starred in the 42 film  Carlitos Way: Rise to Power . He played Walter Lee Younger in the 42 Broadway revival of  A Raisin in the Sun  and the ": null
    },
    {
        "television adaptation": "a raisin in the sun"
    },
    {
        " that aired in February 42 In 42 Combs sold half of his record company to the ": null
    },
    {
        "Warner Music Group": "warner music group"
    },
    {
        ". He hosted the 42 ": null
    },
    {
        "MTV Video Music Award": "mtv video music award"
    },
    {
        "s and was named one of the 42 Most Influential People of 42 by  Time  magazine. He was mentioned in the country song ": null
    },
    {
        "Play Something Country": "play something country"
    },
    {
        " by ": null
    },
    {
        "Brooks & Dunn": "brooks  &  dunn"
    },
    {
        ": the lyricist says he didnt come to hear P. Diddy , which is rhymed with something thumpin from the city.     In 42 when Combs refused to release musician ": null
    },
    {
        "Mase": "mase"
    },
    {
        " from his contractual obligations to allow him to join the group ": null
    },
    {
        "G-Unit": "g-unit"
    },
    {
        ", ": null
    },
    {
        "42 Cent": "50 cent"
    },
    {
        " recorded a ": null
    },
    {
        "diss": "diss"
    },
    {
        " song, Hip-Hop . The lyrics imply that Combs knew the identity of ": null
    },
    {
        "The Notorious B.I.G.": "the notorious b.i.g."
    },
    {
        "s murderer. The two later resolved the feud.     Combs released his first album in four years,  Press Play , on October 42 42 on the Bad Boy Records label. The album, featuring guest appearances by many popular artists, debuted at number one on the U.S. Billboard 42 chart with sales of over 42. Its singles ": null
    },
    {
        "Come to Me": "come to me"
    },
    {
        " and ": null
    },
    {
        "Last Night": "last night"
    },
    {
        " both reached the top ten of the ": null
    },
    {
        "Billboard Hot 42": "billboard hot 100"
    },
    {
        ". The album became available to preview on MTVs The Leak on October 42 42 a week before being sold in stores. Press Play received mixed to positive reviews from critics, and was certified Gold on the RIAA ratings. On September 42 42 Combs teamed up with ": null
    },
    {
        "42 Cent": "50 cent"
    },
    {
        " and ": null
    },
    {
        "Jay-Z": "jay-z"
    },
    {
        " for the ": null
    },
    {
        "Forbes": "forbes"
    },
    {
        " I Get Money Billion Dollar Remix .     In March 42 the  Los Angeles Times  claimed that The Notorious B.I.G. and Combs orchestrated the ": null
    },
    {
        "42 robbery and shooting of Tupac": "tupac shakur"
    },
    {
        ", substantiating the claim with supposed FBI documents; the newspaper later retracted the story, acknowledging that the documents had been fabricated. Dexter Isaac, an associate of record management executive ": null
    },
    {
        "Jimmy Henchman": "jimmy henchman"
    },
    {
        ", confessed in 42 that he had shot Tupac on Henchmans orders.     In June 42 Combs representative denied rumors of another name change. Combs ventured into reality television in August 42 with the premiere of his ": null
    },
    {
        "VH42": "vh1"
    },
    {
        " series  I Want to Work for Diddy . After the season finale of  Making The Band 42 , Combs said he would be heading back into the studio to record his next album. In an interview with The Daily Mail, he said, I had Christina Aguilera on my last album, but its all about ": null
    },
    {
        "Leona Lewis": "leona lewis"
    },
    {
        " on my next. He appeared—credited under his real name—in two episodes of Season 42 of  CSI: Miami : Presumed Guilty and Sink or Swim , in the role of lawyer Derek Powell.       Combs created a rap supergroup in 42 known as the Dream Team. The group consists of Combs, ": null
    },
    {
        "Rick Ross": "rick ross"
    },
    {
        ", ": null
    },
    {
        "DJ Khaled": "dj khaled"
    },
    {
        ", ": null
    },
    {
        "Fat Joe": "fat joe"
    },
    {
        ", ": null
    },
    {
        "Busta Rhymes": "busta rhymes"
    },
    {
        ", ": null
    },
    {
        "Red Café": "red café"
    },
    {
        ", and ": null
    },
    {
        "Fabolous": "fabolous"
    },
    {
        ". Combs made an appearance at comedian ": null
    },
    {
        "Chris Gethard": "chris gethard"
    },
    {
        "s live show in January 42 at the ": null
    },
    {
        "Upright Citizens Brigade Theatre": "upright citizens brigade theatre"
    },
    {
        " in New York City. In June 42 Combs played a role in the comedy film  Get Him to the Greek , as Sergio Roma, a record company executive. An  Entourage  series representative announced that Combs would guest star on an episode during the 42 season.      Last Train to Paris  was released by Combs group  on December 42 42 The release was preceded by four singles ": null
    },
    {
        "Angels": "angels"
    },
    {
        " , ": null
    },
    {
        "Hello Good Morning": "hello good morning"
    },
    {
        " , ": null
    },
    {
        "Loving You No More": "loving you no more"
    },
    {
        " , and ": null
    },
    {
        "Coming Home": "coming home"
    },
    {
        " , which experienced mixed success on the ": null
    },
    {
        "Billboard Hot 42": "billboard hot 100"
    },
    {
        ". Coming Home was the most successful of the songs, peaking at number twelve on the U.S. Hot 42 number four in the UK, and number seven in Canada. On March 42 42 Diddy – Dirty Money performed Coming Home live on American Idol.     On April 42 42 Combs appeared in ": null
    },
    {
        "season one": "hawaii five-0"
    },
    {
        " of  Hawaii Five42 , guest starring as an undercover ": null
    },
    {
        "NYPD": "new york police department"
    },
    {
        " detective. In November 42 Combs appeared in an episode of the ": null
    },
    {
        "eighth season": "its always sunny in philadelphia"
    },
    {
        " of the American sitcom  Its Always Sunny in Philadelphia .     MMM , No Way Out 42, and Love ": null
    },
    {
        "French Montana": "french montana"
    },
    {
        ", as the first single from his mixtape  MMM , which was originally scheduled to be released that year. The song was released for digital download on March 42 and two days later the trailer for the music video was released. The full version of the music video was released on March 42 Combs used his former stage name Puff Daddy for the album. MMM was released as a free mixtape album of 42 tracks on November 42 42 In 42 Combs and ": null
    },
    {
        "Guy Gerber": "guy gerber"
    },
    {
        " announced that their joint album 42 42 would be available for free download. A new single called ": null
    },
    {
        "Finna Get Loose": "finna get loose"
    },
    {
        " featuring Combs and ": null
    },
    {
        "Pharrell Williams": "pharrell williams"
    },
    {
        " was released on June 42 42     In July 42 Bad Boy Entertainment artist Gizzle told the press that she is collaborating with Combs on what she describes as his last album, titled No Way Out 42, a sequel to his 42 debut. She describes the music as unique: The mindset is to just be classic and to be epic. And to really live up to that... we know its a tall order, but we welcome the challenge. In April 42 Combs announced that after this last album and tour, he plans to retire from the music industry to focus on acting.     On May 42 and 42 42 Combs launched a tour of ": null
    },
    {
        "Bad Boy Records": "bad boy records"
    },
    {
        " biggest names to celebrate the 42th anniversary of the label. The documentary Cant Stop, Wont Stop: A Bad Boy Story, covering the two shows at the ": null
    },
    {
        "Barclays Center": "barclays center"
    },
    {
        " in Brooklyn as well as behind-the-scenes events, was released on June 42 42 The show toured to an additional twenty venues across the United States and Canada.     On November 42 42 Combs announced that he would be going by the name Love, stating My new name is Love, aka Brother Love . Two days later, he told the press he had been joking, but on January 42 42 he announced on  Jimmy Kimmel Live!  that he had changed his mind again, and will be using the new name after all.     In 42 Combs announced on Twitter that Making the Band will return to MTV in 42       Fortune magazine listed Combs at number twelve on their ": null
    },
    {
        "top 42 of entrepreneurs under 42": "40 under 40"
    },
    {
        " in 42  Forbes  Magazine estimates that for the year ending May 42 Combs earned $42 million, ranking him number one among entertainers. In 42 his estimated net worth was $42 million.          In 42 Combs started a clothing line,  Sean John . It was nominated for the ": null
    },
    {
        "Council of Fashion Designers of America": "council of fashion designers of america"
    },
    {
        " award for Menswear Designer of the Year in 42 and won in 42 California billionaire ": null
    },
    {
        "Ronald Burkle": "ronald burkle"
    },
    {
        " invested $42 million into the company in 42     Also in 42 the ": null
    },
    {
        "National Labor Committee": "national labor committee"
    },
    {
        " revealed that factories producing the clothing in Honduras were violating Honduran labor laws. Among the accusations were that workers were subjected to body searches and involuntary pregnancy tests. Bathrooms were locked and access tightly controlled. Employees were forced to work overtime and were paid sweatshop wages. ": null
    },
    {
        "Charles Kernaghan": "charles kernaghan"
    },
    {
        " of the National Labor Committee told The New York Times that Sean Puff Daddy obviously has a lot of clout, he can literally do a lot overnight to help these workers.     Combs responded with an extensive investigation, telling reporters Im as pro-worker as they get . On February 42 42 Kernaghan announced that improvements had been implemented at the factory, including adding air conditioning and water purification systems, firing the most abusive supervisors, and allowing the formation of a labor union. In late 42 the department store ": null
    },
    {
        "Macys": "macys"
    },
    {
        " removed Sean John jackets from their shelves when they discovered that the clothing was made using ": null
    },
    {
        "raccoon dog": "raccoon dog"
    },
    {
        " fur. Combs had not known the jackets were made with dog fur, but as soon as he was alerted, he had production stopped.     In November 42 Combs added a mens perfume called I Am King to the Sean John brand. The fragrance, dedicated to ": null
    },
    {
        "Barack Obama": "barack obama"
    },
    {
        ", ": null
    },
    {
        "Muhammad Ali": "muhammad ali"
    },
    {
        ", and ": null
    },
    {
        "Martin Luther King": "martin luther king"
    },
    {
        ", featured model ": null
    },
    {
        "Bar Refaeli": "bar refaeli"
    },
    {
        " in its advertisements. In early 42 Sean John introduced the brands GIRLS collection.       Combs is the head of Combs Enterprises, an umbrella company for his portfolio of businesses. In addition to his clothing line, Combs owned two restaurants called Justins, named after his son. The original New York location closed in September 42; the Atlanta location closed in June 42 He is the designer of the ": null
    },
    {
        "Dallas Mavericks": "dallas mavericks"
    },
    {
        " alternate jersey. In October 42 Combs agreed to help develop the ": null
    },
    {
        "Cîroc": "cîroc"
    },
    {
        " vodka brand for a 42 percent share of the profits. Combs acquired the ": null
    },
    {
        "Enyce": "enyce"
    },
    {
        " clothing line from ": null
    },
    {
        "Liz Claiborne": "liz claiborne"
    },
    {
        " for $42 million on October 42 42 Combs has a major equity stake in Revolt TV, a television network that also has a film production branch. It began broadcasting in 42 In February 42 Combs teamed up with actor ": null
    },
    {
        "Mark Wahlberg": "mark wahlberg"
    },
    {
        " and businessman ": null
    },
    {
        "Ronald Burkle": "ronald burkle"
    },
    {
        " of ": null
    },
    {
        "Yucaipa Companies": "yucaipa companies"
    },
    {
        " to purchase a majority holding in Aquahydrate, a calorie-free beverage for athletes. John Cochran, former president of ": null
    },
    {
        "Fiji Water": "fiji water"
    },
    {
        ", is CEO of the company.                Combs is the father of six children. His first biological child, Justin, was born in 42 to designer Misa Hylton-Brim. Justin attended ": null
    },
    {
        "UCLA": "ucla"
    },
    {
        " on a football scholarship.     Combs had an on-again, off-again relationship with Kimberly Porter, which lasted from 42 to 42  He raised and adopted ": null
    },
    {
        "Quincy": "quincy"
    },
    {
        " , Porters son from a previous relationship with singer/producer ": null
    },
    {
        "Al B. Sure!": "al b. sure!"
    },
    {
        " Together they had a son, Christian , and twin daughters, DLila Star and Jessie James . Porter died of pneumonia on November 42 42     Five months before the birth of his twins, Combs daughter Chance was born to Sarah Chapman. He took legal responsibility for Chance in October 42     Combs sons Quincy and Justin both appeared on MTVs  My Super Sweet 42 . Combs threw Quincy a celebrity-studded party and gave him two cars as his 42th birthday present. For Justins 42th birthday, Combs presented him with a $42 ": null
    },
    {
        "Maybach": "maybach"
    },
    {
        " car.     Combs owns a home in ": null
    },
    {
        "Alpine, New Jersey": "alpine, new jersey"
    },
    {
        ", which he purchased for $42million.          Combs founded Daddys House Social Programs, an organization to help inner city youth, in 42 Programs include tutoring, life skills classes, and an annual summer camp. Along with Jay-Z, he pledged $42 million to help support victims of ": null
    },
    {
        "Hurricane Katrina": "hurricane katrina"
    },
    {
        " in 42 and donated clothing from his Sean John line to victims. He has donated computers and books to New York schools.     Chicago Mayor ": null
    },
    {
        "Richard M. Daley": "richard m. daley"
    },
    {
        " named October 42 42 as Diddy Day in honor of Combs charity work. In 42 Combs was honored with a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        ".     In 42 Combs received an ": null
    },
    {
        "honorary doctorate": "honorary doctorate"
    },
    {
        " from ": null
    },
    {
        "Howard University": "howard university"
    },
    {
        ", where he gave the ": null
    },
    {
        "commencement speech": "commencement speech"
    },
    {
        " for its 42th commencement ceremony. In his speech, Combs acknowledged that his experiences as a Howard student positively influenced his life. In 42 Combs donated $42 million to Howard University to establish the Sean Combs Scholarship Fund to help students who are unable to pay their tuition.       Combs describes his wardrobe style as swagger, timeless, diverse . On September 42 42 Combs held his ninth annual White Party , at which guests are limited to an all-white dress code. The White Party, which has also been held in ": null
    },
    {
        "St. Tropez": "st. tropez"
    },
    {
        ", was held in his home in ": null
    },
    {
        "East Hampton": "east hampton , new york"
    },
    {
        ", ": null
    },
    {
        "Long Island": "long island"
    },
    {
        ". Combs stated, This party is up there with the top three that Ive thrown. Its a party that has legendary status. Its hard to throw a party that lives up to its legend.       Combs was raised Roman Catholic, and was an altar server as a boy. In 42 he told  The Daily Telegraph  that he does not adhere to any specific religious denomination. He said, I just follow right from wrong, so I could pray in a synagogue or a mosque or a church. I believe that there is only one God.            ;Studio albums    No Way Out     Forever     The Saga Continues...     Press Play          ": null
    },
    {
        "NAACP Image Awards": "naacp image awards"
    },
    {
        "  A Raisin in the Sun  ": null
    },
    {
        "Outstanding Actor in a Television Movie, Mini-Series or Dramatic Special": "naacp image award for outstanding actor in a television movie, mini-series or dramatic special"
    },
    {
        "  Outstanding Duo or Group": "naacp image award for outstanding duo or group"
    },
    {
        "  ddy so": "ddy so"
    },
    {
        " ": null
    }
]