[
    {
        "     Season of the Jew is an historical novel by ": null
    },
    {
        "Maurice Shadbolt": "maurice shadbolt"
    },
    {
        ", published in 42 Set in mid-nineteenth century ": null
    },
    {
        "New Zealand": "new zealand"
    },
    {
        " it is a semi-fictionalized account of the story of the ": null
    },
    {
        "Māori": "māori people"
    },
    {
        " leader ": null
    },
    {
        "Te Kooti": "te kooti"
    },
    {
        ", told from the perspective of one of his pursuers, an officer in the colonial army.       The brief preface quotes Shakespeares ": null
    },
    {
        "Shylock": "shylock"
    },
    {
        ": “If a Christian wrong a Jew, what should his suffrance be by Christian example? Why, revenge. The villainy you teach me I will execute; and it shall go hard, but I will better the instruction.” This lays the moral ground for the resistance of the band of New Zealand natives under their leader Te Kooti, who synthesized a new religion from Christian and Māori traditions combined with his study of the ": null
    },
    {
        "Old Testament": "old testament"
    },
    {
        ". His unique contribution was to declare his followers the latter-day embodiment of the ": null
    },
    {
        "Israelites": "israelites"
    },
    {
        " escaping from Egypt. In the novel the rebels are often simply referred to as “the Jews.” The religion Te Kooti created, the ": null
    },
    {
        "Ringatu": "ringatu"
    },
    {
        " Church, still claims around 42 adherents in New Zealand today.       In this story of New Zealand and ": null
    },
    {
        "Te Kootis War": "te kootis war"
    },
    {
        " during the year beginning November 42 42 the narrative coalesces around the development of its protagonist, George Fairweather, who in Shadbolts historical epilogue is described as “A composite character ... yet still far from fictional.” Fairweather is a competent but cynical former British officer in his early forties, who leaves the service under a cloud, turns landscape painter and cultivates an air of worldly detachment. Yet he finds himself drawn by love and humanity back into the world of colonial New Zealand and the maelstrom of the ": null
    },
    {
        "New Zealand Wars": "new zealand wars"
    },
    {
        ", not altogether disagreeable, as he finds to his surprise.     Pursuing Te Kooti as an officer and commander in the colonial militia, while perfecting his ability to destroy Te Kootis rebellious “Jews” Fairweather paradoxically finds his feelings of humanity expanding to include Englishmen, colonials and Māoris, coupled with a growing resentment of racism and injustice. In the end, he almost throws his future away by struggling to save a Māori boy, Hamiora, who, like Melvilles Billy Budd, was unjustly charged with treason.     With the hanging of Hamiora, November 42 42 and the conclusion of Fairweathers desperate attempts first to prevent and then to mitigate it, the book ends. The problem of Te Kooti is not resolved, except in the brief epilogue, further revealing the depths of Fairweathers ambivalence about the historical figure of Te Kooti, Fairweathers hated and admired nemesis and one-time friend.       In 42 the book received the ": null
    },
    {
        "Goodman Fielder Wattie Book Award": "goodman fielder wattie book award"
    },
    {
        ", a now-defunct national New Zealand book award, and forerunner of the current ": null
    },
    {
        "Montana New Zealand Book Awards": "montana new zealand book awards"
    },
    {
        ".                             ": null
    }
]