[
    {
        "   Second City Television, commonly shortened to SCTV, is  a ": null
    },
    {
        "Canadian television": "television in canada"
    },
    {
        " sketch comedy": "sketch comedy"
    },
    {
        " show that ran between 42 and 42 It was created as an offshoot from ": null
    },
    {
        "Toronto": "toronto"
    },
    {
        "s ": null
    },
    {
        "Second City": "the second city"
    },
    {
        " troupe. It is a rare example of a Canadian show that moved successfully to American TV. SCTV Network is available on terrestrial network, cable, and satellite.       The shows premise is the broadcast day of a fictitious TV station in the town of Melonville. Melonvilles location is left unspecified; the very earliest episodes imply it is in Canada, but most later episodes place it in the US.     A typical episode of SCTV presents a compendium of programming seen on the station throughout its broadcast day. A given episode could contain SCTV news broadcasts, sitcoms, dramas, movies, talk shows, kid shows, commercial send-ups hawking nonexistent products, and game shows. Several shows are seen regularly on SCTV, including SCTV News; ": null
    },
    {
        "soap opera": "soap opera"
    },
    {
        " The Days of the Week; late night movie features Monster Chiller Horror Theater and Dialing For Dollars; and Great White North , among others. Many other SCTV shows are seen only once, such as game shows like Shoot at the Stars in which celebrities are literally shot at like ": null
    },
    {
        "shooting gallery": "wikt:shooting gallery"
    },
    {
        " targets, or full-blown movie spoofs like Play It Again, Bob in which ": null
    },
    {
        "Woody Allen": "woody allen"
    },
    {
        "  tries to get ": null
    },
    {
        "Bob Hope": "bob hope"
    },
    {
        "  to star in his next film. Episodes also feature a range of SCTV-produced promos and commercials, such as spots for Al Pecks Used Fruit or Shower in a Briefcase , or a ": null
    },
    {
        "PSA": "public service announcement"
    },
    {
        " that helpfully describes Seven Signs You May Already Be Dead .     Also seen fairly frequently, particularly in later episodes, are behind-the-scenes plots focusing on life at the station. These often feature ": null
    },
    {
        "Guy Caballero": "guy caballero"
    },
    {
        " , SCTVs cheap, tyrannical owner and president, who, despite being perfectly ambulatory, uses a wheelchair to earn respect from employees and viewers. Also seen regularly are weaselly, sweating station manager Maurice Moe Green , succeeded in the position by flamboyant, leopard-skin clad, foul-mouthed Mrs. ": null
    },
    {
        "Edith Prickley": "edith prickley"
    },
    {
        " ; vain variety star Johnny LaRue ; washed-up entertainers such as singer Lola Heatherton  and comedian Bobby Bittman ; news anchors ": null
    },
    {
        "Floyd Robertson": "floyd robertson"
    },
    {
        " and ": null
    },
    {
        "Earl Camembert": "earl camembert"
    },
    {
        " , talk-show host Sammy Maudlin , cult-stardom-destined and beer-addled brothers ": null
    },
    {
        "Bob and Doug McKenzie": "bob and doug mckenzie"
    },
    {
        " , and many others.     The small cast, typically six to eight members at any given time, play a wide variety of other station roles ranging from program hosts to commercial spokespersons. They also impersonate numerous popular celebrities appearing on the stations programming.         There is much dispute as to who actually created the SCTV series. The show itself bears no created by credit, although it gives developed by credits to ": null
    },
    {
        "Bernard Sahlins": "bernard sahlins"
    },
    {
        " and ": null
    },
    {
        "Andrew Alexander": "andrew alexander"
    },
    {
        ".     In 42 Andrew Alexander was looking to expand his company into the realm of TV production. He called together the current cast of the stage show to discuss a format for a Second City TV series. Also in attendance at the meeting were Second City veterans ": null
    },
    {
        "Harold Ramis": "harold ramis"
    },
    {
        ", ": null
    },
    {
        "Sheldon Patinkin": "sheldon patinkin"
    },
    {
        ", and ": null
    },
    {
        "Del Close": "del close"
    },
    {
        ", along with business partner Bernard Sahlins.     According to Dave Thomass account in SCTV: Behind The Scenes, various ideas were batted around, then—and here is where meeting attendees remember things differently—either Close or Patinkin came up with the idea of presenting programming from the worlds smallest TV station. The cast immediately jumped on the idea as a workable model for presenting a virtually unlimited range of characters, sketches, and ideas while still having a central premise that tied everything together. From there, the actual content of the show was all the work of the cast, with contributions from Alexander and Sahlins.     Alexander remained as producer and executive producer throughout SCTVs run. Sahlins stayed for the first two seasons as a producer. Patinkin was a first-season writer and de facto editor and post-production supervisor. Close had no further involvement with the series.       SCTV was initially produced in 42 at the Toronto studios of the ": null
    },
    {
        "Global Television Network": "global television network"
    },
    {
        ", then a small regional network of stations in Southern Ontario. For the first six episodes, new episodes were seen once a month. For the next seven episodes new episodes were seen bi-weekly. In September 42 Global ordered 42 additional episodes, which were seen once a week from September through December.     These irregularly scheduled 42 episodes were considered one season for syndication purposes. All of the original cast except ": null
    },
    {
        "Harold Ramis": "harold ramis"
    },
    {
        " were from the Toronto branch of The Second City theatre improv troupe; Ramis was a Second City veteran, but with the Chicago troupe.     The original SCTV cast consisted of ": null
    },
    {
        "John Candy": "john candy"
    },
    {
        ", ": null
    },
    {
        "Joe Flaherty": "joe flaherty"
    },
    {
        ", ": null
    },
    {
        "Eugene Levy": "eugene levy"
    },
    {
        ", ": null
    },
    {
        "Andrea Martin": "andrea martin"
    },
    {
        ", ": null
    },
    {
        "Catherine OHara": "catherine ohara"
    },
    {
        ", ": null
    },
    {
        "Harold Ramis": "harold ramis"
    },
    {
        ", and ": null
    },
    {
        "Dave Thomas": "dave thomas"
    },
    {
        ". All also served as writers on the show, although Martin and OHara did not receive writing credits on the first four episodes. Ramis served as SCTV s original head writer, but only appeared on-screen as a regular during the first season . Ramis and Flaherty also served as associate producers. Sahlins produced the show; Global staffer ": null
    },
    {
        "Milad Bessada": "milad bessada"
    },
    {
        " produced and directed the first 42 episodes. ": null
    },
    {
        "George Bloomfield": "george bloomfield"
    },
    {
        " became director as of episode 42     Several cast members also worked together as regulars on  The David Steinberg Show , which premiered the same week as SCTV on the Canada-wide ": null
    },
    {
        "CTV Network": "ctv network"
    },
    {
        " and in US syndication. The David Steinberg Show also featured future SCTV cast member ": null
    },
    {
        "Martin Short": "martin short"
    },
    {
        ", but did not utilize any of the SCTV cast as writers. It folded after a single season.     For the second season , SCTV became a weekly series on Global, and was seen in syndication throughout Canada and parts of the United States. After episode three of the second season, Ramis was no longer in the cast but continued to receive credit as the shows head writer for most of the season.       The show was off the air for the 42–42 season, but returned to production after Andrew Alexander and Allarcom-ITV Edmonton owner Charles Allard struck a deal to produce SCTV at ": null
    },
    {
        "ITV Studios": "citv-dt"
    },
    {
        " in ": null
    },
    {
        "Edmonton": "edmonton"
    },
    {
        ", ": null
    },
    {
        "Alberta": "alberta"
    },
    {
        ".     Candy, OHara, and Ramis dropped out at this juncture, and Dave Thomas was promoted to head writer. Added to the cast were ": null
    },
    {
        "Tony Rosato": "tony rosato"
    },
    {
        ", ": null
    },
    {
        "Robin Duke": "robin duke"
    },
    {
        ", and ": null
    },
    {
        "Rick Moranis": "rick moranis"
    },
    {
        ". Moranis, a friend of Dave Thomas primarily known as a radio personality in Canada, was the only cast member not to have come from the ranks of Second City. John Blanchard became the series director at this point.     This season of the show was seen in Canada on the ": null
    },
    {
        "CBC": "cbc television"
    },
    {
        ", and in scattered markets in the U.S. in syndication.       In 42 SCTV was picked up as a 42-minute show by ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " as a replacement for the cancelled Friday variety show  The Midnight Special . Less than two months after Season 42 ended, SCTV was back on the air for Season 42 airing first as SCTV Network 42, then as SCTV Network, late Friday nights. For this iteration, Rosato and Duke dropped out , and Candy and OHara returned. Because of the rush to generate material for this new 42-minute show, several early Season 42 episodes were partially or even entirely made up of repeats of previously broadcast sketches from Seasons 42 to 42 Rosato, Duke, and Ramis are often featured in these repeat sketches, uncredited.     Season 42 ran on an irregular basis from May 42 to July 42 Beginning in January 42 production of the show moved back to Toronto, where it stayed for the remainder of its run.     Writer/performer ": null
    },
    {
        "Martin Short": "martin short"
    },
    {
        " was added to the cast at the end of Season 42 filming three episodes before OHara, Thomas, and Moranis left. One of those episodes was aired as the Season 42 finale in July 42; the other two were held for the start of Season 42 , which began in October 42 For the remaining 42 episodes of Season 42 the cast of Candy, Flaherty, Levy, Martin, and Short were augmented by supporting players ": null
    },
    {
        "John Hemphill": "john hemphill"
    },
    {
        " and ": null
    },
    {
        "Mary Charlotte Wilcox": "mary charlotte wilcox"
    },
    {
        ", neither of whom was an official cast member. Also, in Season 42 Ramis and OHara each returned for one episode apiece as guest stars.     The last new SCTV episode for NBC was seen in March 42 For both Seasons 42 and 42 the show continued to air on the CBC in Canada as a full hour, edited down from the NBC shows.     The 42-minute shows were released in a series of DVD sets in 42 and 42 and . The CBC and Cinemax seasons have never had a proper release in any medium, though sketches from Seasons 42 42 42 and 42 can be easily found on YouTube.       In the fall of 42 NBC wanted the late Friday night time slot for the new  Friday Night Videos . SCTV was offered a slot on early Sunday evenings by NBC, but because they would have had to alter the shows content to appeal to family audiences , as well as face ": null
    },
    {
        "CBS": "cbs"
    },
    {
        "s dominant  42 Minutes , the producers declined.     Instead, for its final season, the show moved to pay-TV channels ": null
    },
    {
        "Superchannel": "movie central"
    },
    {
        " in Canada and ": null
    },
    {
        "Cinemax": "cinemax"
    },
    {
        " in the United States, changing the name slightly to SCTV Channel. The running time was now 42 minutes, and new episodes were seen every second week from November 42 to July 42 For this final season, the cast consisted solely of Flaherty, Levy, Martin, and Short, although Candy, Thomas, and OHara all made guest appearances. Writer/performers Hemphill and Wilcox once again appeared semi-regularly.     After the shows end several SCTV characters continued to make appearances on Cinemax, with Flaherty reprising his roles as Count Floyd and Guy Caballero during free preview weekends in 42 and 42 and Bobby Bittman appearing in a standalone special chronicling his life and career under the  Cinemax Comedy Experiment  banner.     The Best of SCTV 42 ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        " aired a special called The Best of SCTV. In the special, Flaherty and Martin returned as Caballero and Prickley. The two presented a look back at SCTV as they tried to convince the FCC to renew their license. A slightly different version aired in Canada, wherein the pair make their arguments to the ": null
    },
    {
        "CRTC": "crtc"
    },
    {
        "; this necessitated a few changes to certain lines of dialogue and on-screen text, but the show content was otherwise identical. This special was ordered amidst the ": null
    },
    {
        "42 Writers Guild of America strike": "1988 writers guild of america strike"
    },
    {
        ".       The earliest three seasons, in Canada, were 42 minutes. ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " broadcast two seasons of 42-minute programs, including at the beginning material from the Canadian seasons. Some of these 42-minute shows were abbreviated to 42 minutes for the Canadian market. After the end of the NBC seasons the material was repackaged into 42-minute shows.       SCTV received mostly positive reviews following its first episode. Margaret Daly of the  Toronto Star  wrote, Global TV may have just pulled off the comedy coup of this season ... the concept is as clever as the loony company members. Daly, Margaret, Second City, rah, rah! , The Toronto Star, September 42 42 page G42 Dennis Braithwaite of the Star wrote that SCTV was delightfully funny and inventive and the best satire seen regularly on North American television. No, I havent forgotten NBCs Saturday Night. Braithwaite, Dennis, Heres to fun and Globals Second City , The Toronto Star, October 42 42 page D42  Newsday s Marvin Kitman wrote, The premiere episode was quite simply the most superb half hour comedy…in a long time. SCTV is witty, grown-up, inventive and uproariously funny, Gary Deeb wrote in the Chicago Sun-Times .           During its network run on NBC, the show garnered 42 Emmy nominations . The episode Moral Majority won an Emmy Award for Writing for a Variety or Music Program in 42 During Joe Flahertys acceptance speech, award presenter Milton Berle repeatedly interrupted with sarcastic retorts of, Oh, thats funny . Flaherty then turned to Berle and said, Sorry, Uncle Miltie...go to sleep . A flustered Berle simply replied, What? The incident became comedy fodder for SCTV, as the next season contained a bit where Flaherty beats up a Berle lookalike while shouting, Youll never ruin another acceptance speech, Uncle Miltie!     SCTV won the award again in 42     SCTV was inducted into Canadas Walk of Fame in 42       SCTV parody shows include a parody of the western drama The Life and Times of Grizzly Adams —retitled Grizzly Abrams—which depicts the burly wilderness hero as the owner of a wild tortoise that takes weeks to lead police to the skeletal remains of its master, trapped beneath a fallen log .     Battle of the PBS Stars is a parody of ABC televisions Battle of the Network Stars athletic competitions that pitted performers against each other in running and swimming events. SCTV s version features a team of public television stars captained by William F. Buckley vs. a team led by Carl Sagan , with confrontations that include Fred Rogers of Mister Rogers Neighborhood fame in a boxing match with chef Julia Child .     The Peoples Global Golden Choice Awards sends up award shows in which the industry honors itself. Presenters include stars ranging from Elizabeth Taylor to Jack Klugman reading off the nominees in each category, with SCTV chief Guy Caballero secretly having conspired to guarantee that every award goes to his own networks stars.     Some of SCTV s most memorable sketches involve parodies of low-budget late-night ads, like Al Pecks Used Fruit . Equally memorable are the faux-inept ads for local businesses like Phils Nails , Chet Vet the Dead Pet Remover , and Tex and Edna Boils Prairie Warehouse and Curio Emporium.         Impersonations are also an integral part of the comedy, with almost every cast member playing multiple roles as well-known personalities. Some impressions include:         Popular sketches and recurring characters include:     Mailbag, SCTVs take on a vox populi segment where near-apoplectic host Bill Needle answers viewer mail. The shows length is continually cut until Needle is down to mere seconds of airtime. Bill Needle appears frequently in SCTV shows that were cancelled after one episode.   Farm Film Report aka Farm Film Celebrity Blow-Up: Two hick s named Big Jim McBob and Billy Sol Hurok interview celebrities and ultimately encourage them to blow up . Exploding guests include Dustin Hoffman , David Steinberg , Bernadette Peters , Meryl Streep , and a lispy Neil Sedaka .   Polynesiantown: a parody of modern-day film noir. In its attempt to emulate the movie Chinatown , this extended one-shot sketch ends with a crane shot that pushes the show so over budget that the sketchs producers get in trouble with the network. The shows writers incorporate this behind-the-scenes drama into the shows long-term continuity, sending the career of actor/producer/superstar Johnny LaRue into a tailspin as a result of this budget mishap.   The Sammy Maudlin Show: A send-up of The Merv Griffin Show . Flaherty is the afro -coiffed, knee-slapping, overly effusive host welcoming a panel of stars who do nothing but heap lavish praise on each other and applaud their pointless profundities. Originally a parody of Sammy Davis, Jr. s short-lived gabfest, Maudlin evolves into a late-night universe all its own. Levy is a comic in all seriousness as egomaniacal funnyman Bobby Bittman, with his repeated catchphrase How are ya? Bittmans younger brother Skip Bittman, played by Moranis, eventually appears on Maudlin as well, with disastrous results. Martin skewers Liza Minnelli and Lorna Luft with real terrific combo-character Lorna Minnelli ; OHara inhabits pill-popping boozer Lola Heatherton, a Joey Heatherton - Lola Falana amalgam who greets fans with her trademark shriek, I love you! I wanna bear your children! ; John Candy portrays constantly chuckling Ed McMahon -style sidekick / sycophant William B. Williams, who often winds up kneeling on the floor as guests came out and the couch fills up. The Maudlin regulars later appear together in a Rat Pack movie parody, Maudlins Eleven.   The Days of the Week is a soap-opera spoof, with the continuing saga of terminally-ill rock star Clay Collins trying to marry slutty fiancée Sue Ellen Alison in the few days left to him by his tactless doctor Elliot Sabian . A second plot hatched by corrupt doctor Wainwright has small-time criminal Rocco conning the wealthy Violet McKay into accepting him as her long-lost son Billy, even though Rocco is so inept that he mistakes Mojo the maid for his mother. A third story has the suave swindler Harrington trying to seduce the suicidally depressed May Matlock out of the land she owns. It is the only recurring segment throughout the series without a laugh track. The title is a parody of the title of one of the most famous soap operas, The Days of Our Lives .   Mels Rock Pile is a knockoff of the Citytv dance show Boogie and closely resembles American Bandstand and Don Kirshners Rock Concert . Hosted by Rockin Mel Slirrup , a nervous, bespectacled nerd who plays lame pop songs for surly in-studio teen guests. One memorable episode of Mels Rock Pile features an appearance by Sex Pistols -type band The Queen Haters, featuring the entire Short-era cast in perfect 42s punk-band mode. Another features Thomas as Richard Harris , performing MacArthur Park live in the studio—complete with lengthy instrumental breaks. This causes an uncomfortable Mel to try and fill the otherwise dead air. Harris dances endlessly in total agony during the elongated orchestral stretches, while the show moves on to other skits. The song finally ends when an audience member hurls a brick at Harriss chest.   Martin Shorts Jackie Rogers, Jr. is an earnestly smarmy albino Las Vegas headliner with a grating, lisping laugh in a manner similar to Sammy Davis, Jr. Rogers is partial to sequinned jumpsuits, Jack Jones -style song standards, and eligible ladies . Later, Rogers runs for political office but drops out of the race when he realizes its cramping his showbiz lifestyle. Jackie Rogers, Jr., like Ed Grimley, was later seen on Saturday Night Live when Short was hired there as a cast member.   Shorts somewhat unclassifiable uber-nerd Ed Grimley is an SCTV fixture, appearing on numerous assorted shows, commercials , promos, and behind-the-scenes dramas. His hair is styled using an upside-down funnel, and he plays the triangle , for which he took lessons. Grimley has an obsession with the game show Wheel of Fortune and host Pat Sajak . The SNL version of the character is the same, except the sketches have Grimley getting involved in weird situations: meeting a perpetually unlucky man , being targeted by the Devil , and having a near-death experience. As of 42 Grimley is the only SNL and SCTV character to have his own childrens cartoon show: The Completely Mental Misadventures of Ed Grimley .   Half-Wits and High-Q are parodies of quiz shows College Bowl and Reach For The Top hosted by a highly irritable Alex Trebek approximation named Alex Trebel . Over a decade later, Levy gave Norm Macdonald permission to borrow the basic premise for the Celebrity Jeopardy! sketches on Saturday Night Live; Will Ferrell likewise played an irritable, exasperated Trebek.   The 42 Neat Guys, an absurdly clean-cut, 42s style vocal group , are portrayed by Candy, Flaherty , Levy, Moranis, and Thomas. The 42 sing songs like Ive Got a Hickey on My Shoulder , Pimples and Pockmarks , and other unmemorable tunes. Several of their songs contrast with their squeaky-clean image, however, such as She Does It , Patsy Has the Largest Breasts In Town , and Who Made the Egg Salad Sandwiches? .   Connie Franklin, a caricature of Connie Francis portrayed by Andrea Martin. Franklin appears on the Sammy Maudlin Show and also in a parody of mail-order record commercials. Her songs are universally depressing; one contains the lyrics, Im losing my hearing, Ive lost sight in one eye. Im sorry, I didnt hear you, did you really say goodbye?   Another Martin Short character, talk-show host Brock Linehan, is a parody of real-life Canadian interviewer Brian Linehan . Linehan was famous for his meticulous interview preparation, often uncovering details that even his interview guests had forgotten about, which Short satirizes by going in the opposite direction: on SCTV s version of the Linehan show, called Stars in One, all the research compiled about any particular episodes guest is totally wrong, making for unhappy guests and a frustrated, uneasy host.   Harry, the Guy with the Snake on his Face . Harry runs Melonvilles adult book and X-rated video stores.   Video deejay Gerry Todd hosts an all-night televised-radio type of video show. Moraniss turtleneck-sporting, smooth-talking radio-personality parody—complete with casually pronounced vuddeeo —presages the first group of MTV VJ s.   Mayor Tommy Shanks is Melonvilles easygoing mayor, a man prone to sudden fits of rage and physical violence who still gives regular fireside chats on SCTV while feeding treats to a stuffed dog that sits motionless by his side. Throwing out one non sequitur after another, Shanks manages to convey absolutely nothing of relevance during his broadcasts. Eventually he succumbs to mental illness and is institutionalized. While still in the institution, he runs for reelection with the campaign slogan Get me outta here! and wins by a landslide. Some sources erroneously claim the character is named after Edmonton jazz musician Tommy Banks , but the character predates SCTV s move to Edmonton by two years and does not resemble Banks.   SCTV News , anchored by Flaherty as mostly professional newscaster Floyd Robertson and Levy as geeky, clueless Earl Camembert , a model of oblivious self-importance. The members of the SCTV news team are named after Canadian news anchor s Lloyd Robertson and Earl Cameron respectively, but otherwise bear no resemblance to their real-life counterparts . Unlike the Saturday Night Live news parody Weekend Update, which typically uses actual news headlines as setups for more satirical humour, SCTV News uses more absurdist humour, with news stories often focusing on events in Melonville. Another source of humour for this segment is the contrast between the hapless Camembert and the more respected Robertson, who usually ends up playing straight man to Camemberts antics. A running gag involves the news teams tendency to give the hard news items to Robertson and the trivial or poorly prepared stories to his co-anchor .   Monster Chiller Horror Theatre: This fright-film showcase is hosted by Flahertys character Count Floyd — a vampire who mysteriously howls like a wolf. Floyd is unable to pick genuinely scary movies, and at times has to introduce movies he has never seen, about whose content he has no clue. The show features laughably non-frightening Z movie s like Dr. Tongues 42-D House of Stewardesses, 42-D House of Beef, and Tip ONeill s 42-D House of Representatives; 42-D movies are burlesqued. Many of the movies feature mad scientist Dr. Tongue and his hunchback assistant Bruno, played by Woody Tobias, Jr. . As revealed in his very first appearance, Count Floyd is actually SCTV News anchorman Floyd Robertson working a second job. This character note was then ignored for several years before being picked up again as a plot thread towards the end of the shows run. Floyds double duty is a comic homage to the early days of television, where the kiddie show hosts at smaller TV stations were often members of the local news staff in costume.   The Shmenge Brothers are the leaders of a polka band from Leutonia called The Happy Wanderers. Based upon Czechoslovakia n-born, Edmonton -based polka cable show host Gaby Haas, the Shmenges appear during Seasons 42 and 42 Like Bob and Doug McKenzie , the Shmenges were breakout character s and their popularity resulted in the HBO special The Last Polka . In one episode, the Shmenges perform a memorable tribute to composer John Williams . The bands name is based on the Friedrich-Wilhelm Möller song The Happy Wanderer , which is frequently performed by polka artists. The hosts make a point of thanking the hostesses, in each episode, for the cabbage rolls and coffee provided.   Harvey K-Tel, portrayed by Thomas. K-Tel, a parody of rapid-fire mail-order commercial announcers, speaks in a rapid patter both on and off the air. The characters name is derived both from Canadian mail-order commercial company K-tel and the actor Harvey Keitel .   The famous CCCP42-Russian television episode in which SCTV is taken over by Soviet programming. At first nothing seems out of the ordinary at the station: on the air, Levy plays Perry Como in a promo for Still Alive, a TV special in which Comos trademark relaxed style is taken to ludicrous extremes as the singer performs most of the disco -inspired set lying down . Then, after The Great White North, and during a live broadcast of Caesar featuring Bobby Bittman, SCTV experiences a broadcast signal intrusion as a Soviet propaganda channels signal overtakes SCTVs. The station calls itself three-C-P-one , referring to the former Union of Soviet Socialist Republics, which is abbreviated USSR in English but CCCP in Cyrillic . The shows are Russian-themed spoofs: Tibors Tractor, a situation comedy about a talking tractor similar to My Mother the Car —only with the voice of Nikita Khrushchev ; a game show, What Fits into Russia?, in which the host mocks other countries by comparing them to USSR s massive size; Upo-Scrabblenyk , a crossword game show where ridiculously long words are considered abbreviations; and Hey, Giorgy, a sitcom about everybodys favorite Cossack modeled on the Canadian TV series King of Kensington , with the memorable line Uzbeks drank my battery fluid! , uttered when Moraniss Lada wont start outside an alehouse. The CCCP42 episode is shot with a new Soviet mini-cam, a massive electronic device the size of a small car that has to be dragged around by three technicians and burns up early in the show. The piece makes it clear on several occasions that CCCPs enemy is the Uzbeks , a reflection of the Soviet Unions ongoing struggle with Uzbek nationalism. At one point, Guy Caballero attempts to get parent network NBC to address the intrusion, only for Fred Silverman to inquire if the Soviet programs are ratings hits.   A Jazz Singer parody that reverses the story by having musical guest Al Jarreau play a popular jazz singer who wants to become a cantor . His father is a disapproving pop-music impresario played by Levys befuddled Sid Dithers. Dithers, four feet tall and cross-eyed behind Coke-bottle glasses, speaks with a thick early vaudeville -style Yiddish accent . The payoff of this parody makes for a classic SCTV moment: Jarreau has become a synagogue cantor, fulfilling his dream against his fathers wishes, and he wonders if his father will ever speak to him again, until, during the service, he is interrupted by a disco-clad Dithers standing in the doorway in dancing shoes, spangled jacket, and corn-rowed hair.   Tex & Ednas Organ Emporium , a series of parodies of local car dealer TV ads with Tex and Edna imploring viewers to Come on down! to buy their wares.   Thursday Night Live, an atrociously low-budget ripoff of Fridays and Saturday Night Live created by Guy Caballero, who wants to go hip by making this show. It is a long collage of uncontrollable laughter and hooting from the rowdy audience and many unconvincing samplings of profanity and corny drug jokes. The guest host is Earl Camembert, who during the monologue does a bad impression of Steve Martin, saying, Well, I beg your pardon! .   Towering Inferno, a satire of the 42 Irwin Allen film, with each cast member playing multiple roles, trying to escape the worlds thinnest, tallest building after it catches on fire. Martin is at this point the only female cast member, so they are forced to use doubles when two women appear in the same shot. Candy actually says, You take the Edith Prickley double and Ill take the other girl and get out of here, acknowledging the fake as a wink to the audience. There is also a nuclear reactor on the top of the building, with a spinning restaurant above it.       Ironically, the most popular sketch was intended as throwaway filler. Bob and Doug McKenzie , the dim-witted, beer-chugging and back bacon -eating brothers in a recurring Canadian-themed sketch called Great White North, were initially developed by Rick Moranis and Dave Thomas respectively, as a sardonic response to the CBC networks request that the show feature two minutes of identifiably Canadian content in every episode. The 42-minute length reflects the fact that American shows were 42 minutes shorter than Canadian ones , leaving 42 minutes needing content for the Canadian market. The Bob and Doug McKenzie segments first appeared in 42 at the start of Season 42 and continued in every episode until Thomas and Moranis left the series.     The characters ultimately became icons of the very Canadian culture they parodied, spinning off albums, a feature film , commercials, and numerous TV and film cameos. Bob and Doug helped popularize the stereotypical Canadian trait of adding eh to the end of sentences, a facet of Canadian life often gently ridiculed in American shows featuring Canadian characters. Lines from the sketch, such as Take off, you hoser! , became part of North American popular culture. Thomas later revealed in his 42 book SCTV: Behind the Scenes that the other members of the cast grew bitter at the immense financial and popular success of the Bob & Doug McKenzie albums, ultimately leading to Thomas and Moranis leaving the show in 42 Thomas, Dave. SCTV: Behind the Scenes. New York: McClelland & Stewart, 42 Flaherty and Candy accused Thomas of using his position as head writer to increase the visibility of Bob and Doug, even though the original segments were largely unscripted. Take off, eh? Review of Two-Four Anniversary special at www.macleans.ca An SCTV episode even poked fun at the duos popularity. Guy Caballero declared that they had become SCTVs top celebrities, supplanting Johnny LaRue. This led to the pair being given a Bob & Doug special with Tony Bennett as their guest, which wound up being a disaster. Plume, Kenneth. Interview with Dave Thomas , February 42 42     Moranis and Thomas recreated Bob and Doug in the form of a pair of moose in the animated feature Brother Bear from Disney . During Canadian rock band Rush s 42 Snakes And Arrows tour, Moranis and Thomas reprised their Bob and Doug Mackenzie roles in an introductory clip projected on the rear screen for the song The Larger Bowl . Rush out for latest Rush Concert DVD Snakes & Arrows. Review at www.epinions.com on December 42 42 Previously, Rush used Flaherty as Count Floyd to introduce their song The Weapon during their 42 Grace Under Pressure Tour. Rush vocalist Geddy Lee sang the chorus on the hit single Take Off from the 42 Mercury Records album The Great White North by Bob and Doug McKenzie. That chorus aired in a 42 episode of The Simpsons that depicts the Simpson family visiting Toronto. On March 42 42 Take Off reached number 42 on the Billboard Hot 42 . It is the highest charting single of Lees career.       Sir John Gielgud and Sir Ralph Richardson were two of the shows first guest stars.     The shows NBC years brought with them a network edict to include musical guests . At first, the SCTV cast, writers, and producers resisted special guests, on the theory that famous people wouldnt just drop into the Melonville studios, but they soon discovered that by working these guests into different shows-within-shows they could keep the premise going while also giving guest stars something more to do than show up and sing a song.     As a result, Dr. John became a featured player in the movie Polynesiantown , John Mellencamp was Mister Hyde to Ed Grimley s Doctor Jekyll in The Nutty Lab Assistant , Natalie Cole was transformed into a zombie by a glowing cabbage in Zontar , and the Boomtown Rats were both blown up on Farm Film Celebrity Blow Up and starred in the To Sir, with Love parody Teachers Pet . James Ingram appeared on 42-D House of Beef, and violinist Eugene Fodor in New York Rhapsody. Hall & Oates appeared on a Sammy Maudlin Show segment promoting a new film called Chariots of Eggs, a parody of both Chariots of Fire and Personal Best , and showed scenes from the faux movie as clips. Canadian singer-songwriter Ian Thomas was the topic on a Great White North sketch. Carl Perkins , Jimmy Buffett , Joe Walsh , The Tubes , and Plasmatics also appeared on the Fishin Musician , hosted by Gill Fisher .     This, along with SCTVs cult status, led to the shows celebrity fans clamouring to appear. Tony Bennett credited his appearance on Bob and Doug McKenzies variety-show debacle The Great White North Palace for triggering a significant career comeback. Carol Burnett did an ad for the show in which an alarm clock goes off next to her bed, she rises up suddenly and advises those who couldnt stay up late enough to go to bed, get some sleep, then wake up to watch the show. Burnett later briefly appeared in a climactic courtroom episode of The Days of the Week .     Former Chicago Second City player, Saturday Night Live cast member, and film actor Bill Murray also guest-starred on a Days of the Week installment as a photography buff scrambling to make it to the wedding of singer-songwriter Clay Collins and town slut Sue-Ellen Allison in time to take pictures of the event. In the same episode, he played two other roles: Johnny LaRues biggest fan, who is subsequently hired to be LaRues bodyguard , and Joe DiMaggio in a commercial for DiMaggios restaurant, where he offered a free meal to anyone who could strike him out.     Robin Williams guest-starred in a sketch called Bowery Boys in the Band in which his Leo Gorcey -like character tries to hide a gay lifestyle from his Huntz Hall -inspired pal . Williams also mimicked actor John Houseman eloquently reading the Melonville telephone book.     In a rare acting role, singer Crystal Gayle guest-starred in a January 42 episode in the sketch A Star is Born , a spoof of the 42 film version of the movie, playing an up-and-coming singer trying to make it big under the tutelage of her boyfriend and mentor Kris Kristofferson .     Canadian actors, including Jayne Eastwood , Dara Forward, Monica Parker, and Peter Wildman , appeared on the show occasionally as guests. Catherine OHaras sister, singer-songwriter Mary Margaret OHara , also appeared in a bit part in the episode Broads Behind Bars . William B. Davis , still a decade away from his signature role as The X-Files Smoking Man , also has a bit role in one 42 episode.       The laugh track used in early episodes was recorded using audience reactions during live performances in the Second City theatre.       SCTV had a 42-minute format, unique for a dramatic or comedy series, although not unknown in talk shows. Such shows are hard to fit into a schedule, and the market was limited. The original 42-minute shows were never rebroadcast.     Instead, in 42 after production on the series ended, the Second City Television syndicated half-hour episodes and SCTV Network 42-minute episodes were re-edited into half-hour shows for a revised syndicated package, which consisted of 42 re-edited half-hours. In 42 a separate package of 42 half-hours aired on The Comedy Channel in the United States. Like the original syndicated series, the US and Canadian versions of the 42 package differed, with the Canadian half-hours a couple of minutes longer; the running order of episodes also differed between the two countries. By the late 42s, the re-edited SCTV Channel episodes were added to the regular SCTV syndicated package; three additional half-hours were restored to the package, knocking the episode count up to 42 half-hours.     The syndication package was picked up by NBC following the cancellation of its late night talk show Later on January 42 42 but to retain continuity with the latter, it was aired with an introduction voiced by Friday Night and occasional Later substitute host Rita Sever and was known as Later Presents: SCTV. It aired until Last Call with Carson Daly took over the time slot on January 42 42 from Monday to Thursday; Late Friday aired on Fridays.     For years, SCTV was unavailable on videotape or DVD , or in any form except these re-edited half-hour programs. Due to difficulty obtaining music rights for DVD releases, Shout! Factory edited music in certain sketches or even left out sketches like Stairways to Heaven . Dave Thomas acknowledged: We were true guerrilla TV in that when we wanted background music we just lifted it from wherever we wanted. Consequently, today, to release the shows on home video, it would cost millions to clear the music.       Shout! Factory has released some of SCTV on DVD in Region 42 . All episodes from Season 42 and 42 have been released in 42 volumes, and a best-of DVD features episodes from Seasons 42 and 42         Other Releases   Christmas with SCTV: Released October 42 42   SCTV  – Best of The Early Years: Released October 42 42       On May 42 and 42 42 most of the cast reunited for a charity event, The Benefit of Laughter, at the Second City Theatre in Toronto. Eugene Levy , Martin Short , Andrea Martin , Catherine OHara , Robin Duke , and Joe Flaherty took part; Dave Thomas reportedly bowed out due to illness. The event was a fundraiser for The Alumni Fund, which helps support former Second City cast and crew members facing health or financial difficulties. The performances have not been released.       To honor the 42th anniversary of The Second City, SCTV Golden Classics aired nationwide on public television stations beginning March 42  featuring some memorable skits from the comedy television series.       Although SCTV was never directly adapted as a film, the characters of Bob and Doug McKenzie, popularized on the series, were featured in their own film, 42s  Strange Brew . A sequel was planned in the late 42s but never produced.          In April 42 ": null
    },
    {
        "Netflix": "netflix"
    },
    {
        " announced that ": null
    },
    {
        "Martin Scorsese": "martin scorsese"
    },
    {
        " would direct an original comedy special exploring the legacy of the show.  In May 42 it was announced the special would be titled An Afternoon with SCTV and air on CTV in Canada and Netflix worldwide. ": null
    }
]