[
    {
        "        The Second Anglo-Dutch War , or the Second Dutch War  was a conflict fought between ": null
    },
    {
        "England": "kingdom of england"
    },
    {
        " and the ": null
    },
    {
        "Dutch Republic": "dutch republic"
    },
    {
        " for control over the seas and trade routes, where England tried to end the Dutch domination of world trade during a period of intense European commercial rivalry. After initial English successes, the war ended in a Dutch victory. It was the second of ": null
    },
    {
        "a series of naval wars": "anglo-dutch wars"
    },
    {
        " fought between the English and the Dutch in the 42th and 42th centuries.           Traditionally, many historians considered that the ": null
    },
    {
        "First Anglo-Dutch War": "first anglo-dutch war"
    },
    {
        " and Second Anglo-Dutch War arose from commercial and maritime rivalry between England and the Netherlands, although conceding that the ": null
    },
    {
        "Third Anglo-Dutch War": "third anglo-dutch war"
    },
    {
        " was less the result of commercial rivalry. However, more recent research has suggested that political issues, particularly in England, had a significant effect on the outbreak of these conflicts. Although continuing commercial tensions formed the background to the second war, a group of ambitious English politicians and naval officers frustrated diplomatic efforts to reach any accommodation between the parties. Religious and political differences between the Anglican royalists in England and the Calvinist republicans that formed the ruling group in the Netherlands, each seeing the other as an ideological threat, also hampered agreement.     The last major battle of the ": null
    },
    {
        "First Anglo-Dutch War": "first anglo-dutch war"
    },
    {
        " was an English victory in the ": null
    },
    {
        "battle of Scheveningen": "battle of scheveningen"
    },
    {
        " in August 42 However, after this the Dutch turned to using smaller warships and ": null
    },
    {
        "privateer": "privateer"
    },
    {
        "ing and, by November Cromwell was willing to make peace as the Dutch were capturing numerous English merchant ships. His only stipulation was that no Prince of Orange or other member of the ": null
    },
    {
        "House of Orange": "house of orange"
    },
    {
        " should hold the office of ": null
    },
    {
        "stadtholder": "stadtholder"
    },
    {
        " or any other public office in the Netherlands. When this demand was made public, it was strongly opposed by Orangists, so it was dropped from formal negotiations. De Witt realised that he would not persuade most of the provinces to accept the exclusion of members of the House of Orange from public office asc part of a peace treaty, so the public terms of the ": null
    },
    {
        "Treaty of Westminster": "treaty of westminster"
    },
    {
        " made no mention of this. However, the two members of the negotiating team from Holland, unknown to their colleagues, agreed to a secret annexe providing, although the Netherlands would ratify the treaty without delay, England would only do so once the States of Holland had passed an ": null
    },
    {
        "Act of Seclusion": "act of seclusion"
    },
    {
        ", excluding the House of Orange from holding public office in the province of Holland.     The States General of the United Provinces approved and ratified the Treaty of Westminster, unaware of the secret annexe attached to version of the treaty that the English would ratify. De Witt had to use his influence to persuade delegates from the towns of Holland, many initially unfavourable, to support Exclusion, and some of their pensionaries resisted to the end, although they did not try to involve other provinces. Holland passed its Act of Exclusion on 42 May 42 Adverse reactions from the public in other provinces was strong, but their provincial assemblies could neither overcome internal divisions nor act with other provinces to oppose it. However, any expectation that the other provinces would enact their own Act of Exclusion after Holland had passed its act was not realised in the short term, although in practice the policy was not opposed. Only after the war did four provinces besides Holland adopt the ": null
    },
    {
        "Perpetual Edict ": "perpetual edict"
    },
    {
        " sanctioning Exclusion.     The ": null
    },
    {
        "Commonwealth": "commonwealth of england"
    },
    {
        " government of ": null
    },
    {
        "Oliver Cromwell": "oliver cromwell"
    },
    {
        " wished to avoid further conflict with the Dutch Republic, as it was planning war with Spain, the ": null
    },
    {
        "Anglo-Spanish War": "anglo-spanish war"
    },
    {
        " of 42–42 which began after the Treaty of Westminster was signed. The English feared Dutch intervention in this war on the side of the Spanish, as the Republic contained an Orangist party hostile to Cromwell. However, Orangist sentiments were found more among the common people than those with political influence. The controversy over Exclusion strengthened de Witts position in Holland and increased the influence of Holland over the other provinces. De Witts position was further strengthened by increasing Dutch dominance in international trade, which replaced English trade with Spain and its possessions in Italy and America during the Anglo-Spanish War. Once the Netherlands had replaced England on these areas, its traders were very reluctant to see English rivals readmitted.     After the First Anglo-Dutch War ": null
    },
    {
        "Johan de Witt": "johan de witt"
    },
    {
        ", who had been elected Grand ": null
    },
    {
        "Pensionary": "pensionary"
    },
    {
        " of Holland, took over effective control of Netherlands foreign policy until his death in 42 He realised that the Netherlands could never win a war with England or France conclusively, and that even surviving a war with either power would be only at enormous cost. He therefore strove for a neutrality in which Dutch commerce could flourish, supported by sufficiently strong land and naval forces to deter either of these two as a possible adversary. Despite traditional Dutch hostility towards Spain, de Witt declined to join Cromwell in attacking it, but the Dutch had no desire to aid their hated former master, so remained neutral. De Witt was, however, prepared to act alone against Sweden in 42 and, jointly with Denmark, again in 42 Although the Commonwealth was an ally of Sweden, it did not come to the aid of its ally, even when the Dutch thwarted the Swedish attempt to conquer Denmark in the ": null
    },
    {
        "battle of the Sound": "battle of the sound"
    },
    {
        " on 42 November 42 De Witts aim was to establish peace in the Baltic for the benefit of Dutch commerce there. With a similar aim, he attempted to end the long-running conflict with Portugal, allowing it to retain Brazil over the protests of two of the five Netherlands provinces in 42     The Dutch used the years of peace to build up their commercial fleet again, following its devastation in the First Anglo-Dutch War. De Witt also achieved the post-war completion of many new warships, ordered during the war to augment the existing fleet, including several large ships comparable in armament to the all but the largest English ones. These had been given greater constructional strength and a wider beam to support heavier guns. However, despite the pleas of the admirals for more of these powerful ships, many of those built were relatively small and designed as convoy escorts, protecting trade routes, not fight fleet actions. In addition, the ": null
    },
    {
        "Dutch East India Company": "dutch east india company"
    },
    {
        " built hybrid ships that could be used for carrying cargo, as convoy escorts or in battle, although they were not as strongly built as pure warships.     While the English had won a great many naval battles and destroyed or captured a great many Dutch merchant ships during the First Anglo-Dutch War, they failed to win the war. The Republic was in a better financial position than the Commonwealth of England, potentially enabling the Dutch to complete the fitting out their naval fleet to replace their losses at faster pace than England. However, de Witt was unable to put naval finances on a centralised basis, as each of the five admiralties and the three provinces that maintained them retained considerable independence. In addition, as the Dutch navy did not rely on ": null
    },
    {
        "the press gang": "impressment"
    },
    {
        ", securing sufficient manpower could be a problem,, although abandoning the practice of paying off seamen and laying up ships in the winter promoted a more professional and permanent body of sailors, committed to naval service,     While the war continued, the Dutch had also been free to expand their trade networks along the main sea routes outside English home waters without fear of English retaliation, as the majority of English warships were in home waters, with few lack of available overseas. English commerce was grinding to a halt as they lost access to the Baltic and the Mediterranean Seas, and when the two sides signed the peace treaty in 42 the English were in essentially the same position that they had begun: watching the Dutch Republic outstrip their economy to become the premier European trade power.           To make matters worse for England, the conclusion of the First Anglo-Dutch War was immediately followed by the Anglo-Spanish War of 42–42 which disrupted the remnants of trade the Commonwealth had with Spain and southern Italy. The Dutch were left with free rein to expand their influence in the area: this period was one of the highest points in the ": null
    },
    {
        "Dutch Golden Age": "dutch golden age"
    },
    {
        ", and ironically the English interference was partly responsible.     A major problem with the English trading system was that it was based on prohibitions, such as the ": null
    },
    {
        "Navigation Acts": "navigation acts"
    },
    {
        ", tariffs and customs and the regulation of manufacturing. All these measures, even tariffs which were originally designed to raise revenue, were directed to the protection of English trade. Although the Dutch system was said to be based on ": null
    },
    {
        "free trade": "free trade"
    },
    {
        ", this only applied to Europe, and not to Dutch trading settlements elsewhere. The prices of Dutch goods were more attractive around the world because the Dutch taxation system imposed excise duties on its own consumers, rather than customs duties on the foreign users of its exports. The end of the First Anglo-Dutch War had not changed this dynamic. Indeed, the end of the war had set the ": null
    },
    {
        "United Provinces": "republic of the seven united netherlands"
    },
    {
        " free to expand their trade while the English were still hindered by the same tariff system. Thus, another war seemed inevitable to many people of the time, as the Commonwealth was unlikely to give up its naval and economic superiority without a fight.       The ": null
    },
    {
        "Restoration": "english restoration"
    },
    {
        " of ": null
    },
    {
        "Charles II": "charles ii of england"
    },
    {
        ", in 42 initially produced a general surge of optimism in England. Many hoped to reverse the Dutch dominance in world trade. At first, however, Charles II sought to remain on friendly terms with the Republic, as he was personally greatly in debt to the House of Orange, which had lent large sums to ": null
    },
    {
        "Charles I": "charles i of england"
    },
    {
        " during the ": null
    },
    {
        "English Civil War": "english civil war"
    },
    {
        ". Nevertheless, a conflict soon developed between the ": null
    },
    {
        "States of Holland": "states of holland"
    },
    {
        " and ": null
    },
    {
        "Mary": "mary, princess royal and princess of orange"
    },
    {
        " over the education and future prospects of ": null
    },
    {
        "William III of Orange": "william iii of england"
    },
    {
        ", the posthumous son of Dutch stadtholder ": null
    },
    {
        "William II of Orange": "william ii of orange"
    },
    {
        " and Charles nephew. William was designated a Child of state in 42 implying he would be trained for high office by the States-General. When after Mary died in 42 she named Charles as a guardian of William, allowing England an influence in Dutch politics.     The Dutch, in a move coordinated by ": null
    },
    {
        "Cornelis": "cornelis de graeff"
    },
    {
        " and ": null
    },
    {
        "Andries de Graeff": "andries de graeff"
    },
    {
        ", tried to placate the king with prodigious gifts, such as the ": null
    },
    {
        "Dutch Gift": "dutch gift"
    },
    {
        " of 42 Negotiations were started in 42 to solve these issues, which ended in the treaty of 42 in which the Dutch conceded on most points. In 42 ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        " of ": null
    },
    {
        "France": "france"
    },
    {
        " stated his claim to portions of the ": null
    },
    {
        "Habsburg": "habsburg"
    },
    {
        " southern Netherlands": "southern netherlands"
    },
    {
        ", leading to a short rapprochement between England and the Republic. During this time, ": null
    },
    {
        "Lord Clarendon": "edward hyde, 1st earl of clarendon"
    },
    {
        ", serving as chief minister to King Charles II of England, felt that France had become the greatest danger to England.     In 42 however, the situation quickly changed: Clarendons enemy, ": null
    },
    {
        "Lord Arlington": "henry bennet, 1st earl of arlington"
    },
    {
        ", became the favourite of the king, and he and his client ": null
    },
    {
        "Sir Thomas Clifford M.P., later Lord Clifford": "thomas clifford, 1st baron clifford of chudleigh"
    },
    {
        ", began to cooperate with the kings brother ": null
    },
    {
        "James, Duke of York": "james ii of england"
    },
    {
        ", the ": null
    },
    {
        "Lord High Admiral": "admiralty"
    },
    {
        " James, Arlington and Clifford, who was chairman of a House of Commons committee investigating the supposed depression in English maritime commerce agreed that Dutch commercial competition had to be stifled, even if this led to war with the United Provinces, as they considered the United Provinces were a greater threat to English interests than was France. They coordinated their efforts in order to reduce Dutch competition through a policy of reprisals against Dutch ships, which were captured in significant numbers. and expected significant personal gain from this policy. James, the Duke of York, headed the ": null
    },
    {
        "Royal African Company": "royal african company"
    },
    {
        " and hoped to seize the possessions of the ": null
    },
    {
        "Dutch West India Company": "dutch west india company"
    },
    {
        ", including ": null
    },
    {
        "New Amsterdam": "new amsterdam"
    },
    {
        ".     This aggressive policy was supported by the English ambassador in ": null
    },
    {
        "The Hague": "the hague"
    },
    {
        ", Sir ": null
    },
    {
        "George Downing": "sir george downing, 1st baronet"
    },
    {
        ", who acted as agent for James, Arlington and Clifford From his position in the Hague, Downing gave a full and detailed account of all the political affairs in the United Provinces to Charles as well as James and his associates. Downing reported back to London that the Republic was politically divided and that the Dutch would submit to English demands rather than go to war. Even after the English fleet began seizing Dutch ships and an attack on Dutch possessions in West Africa, he reported in August 42 that the Dutch would probably accept reducing their share of overseas trade in favour of England, although contemporary Dutch sources reported strengthening Dutch resistance to these provocations. Since 42 Downing had been in contact with the Orangists, who he believed would collaborate with England against their enemy, the republican States faction. However, although some Orangists entered into treasonable correspondence with England in an attempt to end the war and overthrow de Witt, the rapid arrest execution of ": null
    },
    {
        "de Buat": "henri de fleury de coulan"
    },
    {
        " showed their weakness.     Charles was influenced by James and Arlington as he sought a popular and lucrative foreign war at sea to bolster his authority as king. Many naval officers welcomed the prospect of a conflict with the Dutch as they expected to make their name and fortune in battles they hoped to win as decisively as in the previous war.          As enthusiasm for war rose among the English populace, ": null
    },
    {
        "privateer": "privateer"
    },
    {
        "s began to join navy ships in attacking Dutch ships, capturing them and taking them to English harbors. By the time that Charles II of England declared war on the United Provinces, about two hundred Dutch ships had been brought to English ports. Dutch ships were obligated by the new treaty to salute the ": null
    },
    {
        "English flag": "flag of england"
    },
    {
        " first. In 42 English ships began to provoke the Dutch by not saluting in return. Though ordered by the Dutch government to continue saluting first, many Dutch commanders could not bear the insult.     Whether to secure concessions from the Dutch or provoke open conflict with them, James already in late 42 had sent ": null
    },
    {
        "Robert Holmes": "robert holmes"
    },
    {
        ", to protect the interests of the Royal African Company. Holmes captured the Dutch trading post of Cabo Verde in June 42 and confiscated several ships of the Dutch West India company in ": null
    },
    {
        "West Africa": "west africa"
    },
    {
        ", , allegedly as reprisals for English ships captured by that company, and England refused any compensation for these captures, for disrupting that companys trading operations or for other hostile acts. Slightly later, the English invaded the Dutch colony of ": null
    },
    {
        "New Netherland": "new netherland"
    },
    {
        " in North America on 42 June 42 and had control of it by October.     The States General responded by sending a fleet under ": null
    },
    {
        "Michiel de Ruyter": "michiel de ruyter"
    },
    {
        " that recaptured their African trade posts and captured most English trade stations there, then crossed the Atlantic for a ": null
    },
    {
        "punitive expedition": "punitive expedition"
    },
    {
        " against the English in America. In December 42 the English suddenly attacked the Dutch ": null
    },
    {
        "Smyrna": "i̇zmir"
    },
    {
        " fleet. Though the attack failed, the Dutch in January 42 allowed their ships to open fire on English warships in the colonies when threatened.        The war was supported in England by propaganda concerning the much earlier ": null
    },
    {
        "Amboyna Massacre": "amboyna massacre"
    },
    {
        " of 42 In that year, ten English ": null
    },
    {
        "factors": "factor"
    },
    {
        ", resident in the Dutch fortress of Victoria and ten Japanese and Portuguese employees of the Dutch East India Company on ": null
    },
    {
        "Ambon": "ambon, maluku"
    },
    {
        " were executed by beheading following accusations of treason. After their arrest, many of the English prisoners were, according to the trial records, tortured by having a cloth placed over their faces, upon which water was poured to cause near suffocation, now called ": null
    },
    {
        "waterboarding": "waterboarding"
    },
    {
        ". Other, more sadistic, tortures were alleged although denied by the Dutch. The incident provoked a major crisis in Anglo-Dutch relations at the time and continuing popular anger, although the matter had been be officially settled with the ": null
    },
    {
        "Treaty of Westminster": "treaty of westminster"
    },
    {
        ". The ": null
    },
    {
        "East India Company": "east india company"
    },
    {
        " set out its case against the ": null
    },
    {
        "Dutch East India Company": "dutch east india company"
    },
    {
        " in a pamphlet published in 42 which was used for anti-Dutch propaganda during the First Anglo-Dutch War and revived by pamphleteers as a second war neared. When De Ruyter recaptured the West African trading posts, many pamphlets were written about presumed new Dutch atrocities, although these contained no basis in fact.     Another cause of conflict was mercantile competition. The major monopolistic English trading companies had suffered from a loss of trade on the 42s, which they attributed to illegal contraband trading and Dutch competition. They wished the government to exclude the Dutch from trading with British colonies, and force those colonies to trade only with the licenced English trading companies. The Dutch, whose maritime trade was substantially that of intermediary, rejected the policies of ": null
    },
    {
        "Mercantilism": "mercantilism"
    },
    {
        " in favour of the  mare liberum  where it was in their interest to do so, while enforcing a strict monopoly in the ": null
    },
    {
        "Dutch Indies": "dutch indies"
    },
    {
        ", and attempted to expand it to their other settlements.              After their defeat in the First Anglo-Dutch War, the Dutch became much better prepared. Beginning in 42 a New Navy was constructed, a core of sixty new, heavier ships, and more professional captains were sought for these. However, even the heavier Dutch ships were much lighter than the ten big ships of the English navy and, in 42 when war threatened, it was decided to enhance the core Dutch fleet with still heavier ships. Upon the outbreak of war in 42 these new vessels were mostly still under construction, and the Dutch only possessed four heavier ": null
    },
    {
        "ships of the line": "ships of the line"
    },
    {
        ". During the second war, the Dutch Republic was in a better financial position than England and quickly completed the new ships, whereas England could only build a dozen ships, due to financial difficulties.. However, de Witt saw that men, not materiel, were critical, and attempted to deal with the insubordination, lack of discipline and apparent cowardice among captains at the start of the war.     In 42 England boasted a population about four times as large as that of the Dutch Republic. This population was dominated by poor peasants, however, and so the only source of ready cash were the cities. The Dutch urban population exceeded that of England in both proportional and absolute terms and the Republic would be able to spend more than twice the amount of money on the war as England, the equivalent of £42,42 The outbreak of war was followed ominously by the ": null
    },
    {
        "Great Plague": "great plague of london"
    },
    {
        " and the ": null
    },
    {
        "Great Fire of London": "great fire of london"
    },
    {
        ", hitting the only major urban centre of the country. These events, occurring in such close succession, virtually brought England to its knees, as the English fleet had suffered from cash shortages even before these calamities, despite having been voted a record budget of ": null
    },
    {
        "£": "gbp"
    },
    {
        "42,42 by the English parliament. However, as Charles lacked effective means of enforcing taxation, those voted were collected neither in full nor quickly; for much of the war, Charles was dependent on loans raised in the City of London at interest rates which increased as the war progressed, to cover both collection delays and for expenditure in excess of the budget. Although the Duke of York had attempted to reform the finances if the ": null
    },
    {
        "Navy Board": "navy board"
    },
    {
        ", cash flow remained a problem, and sailors were not paid wholly in cash, but mainly with tickets , or debt certificates, only redeemed after long delays when cash was available. Receipts from the sale of goods carried by Dutch ships captured by Royal Navy warships and the ships themselves or, to a lesser extent, by privateers, was a valuable source of funds to finance for the Navy Board, and the attack Dutch East Indies fleet at": null
    },
    {
        "Bergen": "bergen, norway"
    },
    {
        " had this as at least one of its objectives. However, a large part of the proceeds of these captures was retained, illegally by the captors or returned to them as prize money and, although it has been claimed that English financial penury made the wars outcome dependent on the fortunes of its privateers,, this was never more than an irregular windfall, and opportunities for capturing Dutch merchant vessels were greatest before and just after war was declared, diminishing as the war forced them to stay in port.. Far fewer prizes were taken by the Royal Navy than in the First Anglo-Dutch War and, overall and particularly after 42 Dutch privateers would be the more successful..       A Franco-Dutch treaty had been signed in 42 which involved a defensive alliance between the two countries, giving the Netherlands protection against an English attack and assuring France that the Netherlands would not assist Spain in the ": null
    },
    {
        "Spanish Netherlands": "spanish netherlands"
    },
    {
        ". Although ": null
    },
    {
        "Louis XIV of France": "louis xiv of france"
    },
    {
        " had signed this treaty, he considered that an Anglo-Dutch war was likely to obstruct his plans to acquire Habsburg territory there. Charles ambassador in France reported the French opposition to the outbreak of such a war gave him the hope that, if the Dutch were provoked into declaring war, the French would evade their treaty obligations, and refuse to be drawn into a naval war with England. In the summer of 42 Louis attempted to avert the threatened Anglo-Dutch war or, failing that, to confine it to Africa and America. These efforts to mediate an agreement failed, and the war commenced with a declaration of war by the Dutch on 42 March 42 following English attacks on two Dutch convoys off Cadiz and in the English Channel.     Even after the war began, Louis attempted to evade his obligation by strengthening the French embassy in London with two envoys   under the name of the célèbre ambassade & nbsp incluging an ": null
    },
    {
        "Ambassador Extraordinary": "ambassador extraordinary"
    },
    {
        " in addition to the resident ambassador to begin negotiations for a settlement of the Anglo-Dutch conflict. Its instructions were to offer terms including the restitution of each countrys ships captured off America and Africa and their West African bases, and also financial compensation for English ships captured earlier in West Africa. However, the instructions did not propose that the ": null
    },
    {
        "New Netherlands": "new netherlands"
    },
    {
        " should be included in any treaty, but settled by local fighting that would not involve a European War. The Dutch complained that these terms denied their rights to the New Netherlands.              The enlarged Dutch fleet was confident of victory, and it actively sought out the English fleet. In their first at the ": null
    },
    {
        "Battle of Lowestoft": "battle of lowestoft"
    },
    {
        " on 42 June 42 the Dutch suffered the worst defeat in the history the Dutch Republics navy, with at least sixteen ships lost, and one-third of its personnel killed or captured.     However, the English were unable to capitalise on their victory at Lowestoft, as the majority of the Dutch fleet escaped. The leading Dutch politician, the ": null
    },
    {
        "Grand Pensionary": "grand pensionary"
    },
    {
        " of Holland ": null
    },
    {
        "Johan de Witt": "johan de witt"
    },
    {
        ", attempted to restore confidence by joining the fleet personally and dealt with failed or ineffective captains by executing three and exiling and dismissing others. ": null
    },
    {
        "Michiel de Ruyter": "michiel de ruyter"
    },
    {
        " was appointed to lead the Dutch fleet in July 42 despite the previous appointment of Cornelis Tromp as acting commander in chief, and he formalised new tactics. The Spice Fleet from the Dutch East Indies managed to return home safely after the ": null
    },
    {
        "battle of Vågen": "battle of vågen"
    },
    {
        ", although it was at first blockaded at Bergen, causing the financial position to swing in favour of the Dutch.     In the summer of 42 the ": null
    },
    {
        "bishop of Münster": "bishop of münster"
    },
    {
        ", ": null
    },
    {
        "Bernhard von Galen": "bernhard von galen"
    },
    {
        ", an old enemy of the Dutch, was induced by promises of English subsidies to invade the Republic. At the same time, the English made overtures to Spain. ": null
    },
    {
        "Louis XIV": "louis xiv of france"
    },
    {
        " was now concerned by the attack by Münster and the prospect of an English–Spanish coalition, and the effect this might have on his conquering the ": null
    },
    {
        "Spanish Netherlands": "spanish netherlands"
    },
    {
        ". He first arranged for other German states to obstruct the passage of Munster troops and promised to send a French army corps to Germany. Louis was still unwilling to act against England under the 42 defensive treaty, so he revived his attempts to mediate a settlement. The French ambassadors, with de Witts assent, offered to accept the loss of the New Netherlands and of two West African posts seized by Holmes and to return a third post seized by de Ruyter. However, the English fleets success at Lowestoft prompted Charles and his ministers to reject this offer and demand further surrenders of territory and a Dutch agreement to bear the costs of the war. When, in December 42 Charles refused a French counter-offer, Louis withdrew both his ambassadors, signalling his intention to declare war.        These events caused consternation at the English court. It now seemed that the Republic could end up as either a Habsburg possession or a French protectorate: either outcome would be disastrous for Englands strategic position. Clarendon was ordered to make peace with the Dutch, quickly and without French mediation. Downing used his Orangist contacts to induce the province of ": null
    },
    {
        "Overijssel": "overijssel"
    },
    {
        ", whose countryside had been ravaged by Galens troops, to ask the ": null
    },
    {
        "States General": "states general of the netherlands"
    },
    {
        " for a peace with England The Orangists naively wished to gain peace by conceding the English demand that the young William III should be made captain-general and admiral-general of the republic, which would ensure his eventual appointment to the stadtholderate. De Witts position was, however, too strong for this Orangist attempt to seize power to succeed. In November, the promised Louis never to conclude a separate peace with England. On 42 December it openly declared that the only acceptable peace terms would be either a return to the  status quo ante bellum , or a quick end to hostilities under a  uti possidetis  clause.     At the end of 42 ": null
    },
    {
        "Henri Buat": "henri de fleury de coulan"
    },
    {
        " a Frenchman with connections to the House of Orange became involved in unofficial correspondence with Sir ": null
    },
    {
        "Gabriel Sylvius": "gabriel sylvius"
    },
    {
        ", who was acting on behalf of ": null
    },
    {
        "Lord Arlington": "henry bennet, 1st earl of arlington"
    },
    {
        ", a minister of Charles II. Their correspondence was a means for the Dutch and English governments to explore possibilities of peace without commitment. At an early stage, Buat made the Grand Pensionary ": null
    },
    {
        "Johan de Witt": "johan de witt"
    },
    {
        " fully aware of this correspondence, and Buat added material provided by de Witt to his letter, including possible peace terms, although de Witt was unsure whether Charles was genuinely seeking peace.          After Battle of Lowestoft, Louis XIV was concerned that the destruction of the Dutch fleet would allow the English fleet to interfere with his plans in the Spanish Netherlands, so he again offered mediation, but as his credibility as mediator been undermined, this offer was rejected by England. Louis declared war on England on 42 January 42 and the anti-English alliance was strengthened in the winter of 42 when, in February, ": null
    },
    {
        "Frederick III of Denmark": "frederick iii of denmark"
    },
    {
        " also declared war after receiving a large subsidy. Next, ": null
    },
    {
        "Brandenburg": "brandenburg"
    },
    {
        " which had earlier been prompted by France to offer mediation, threatened to attack Münster from the east: as the promised English subsidies had remained largely hypothetical, Von Galen made peace with the Republic in April at ": null
    },
    {
        "Cleves": "cleves"
    },
    {
        ".     By February 42 the negotiations using Buat as an intermediary had progressed to the stage where de Witt invited Charles II to start formal peace negotiations. An outline of the English peace proposals was forwarded through Buat but rejected by de Witt pending clarification of its terms. No clarification was provided, only repeated English insistence that someone duly authorised should be sent to London to negotiate peace. Both the States of Holland and the French ambassador rejected this proposal. During these negotiations, Buat was in contact with leading Orangists, including ": null
    },
    {
        "the Lord of Zylestein": "frederick nassau de zuylestein"
    },
    {
        " and the Rotterdam regent ": null
    },
    {
        "Johan Kievit": "johan kievit"
    },
    {
        ", although the Prince himself was not involved.     By the spring of 42 the Dutch had rebuilt their fleet with much heavier ships, thirty of them possessing more cannon than any Dutch ship in early 42 and threatened to join with the French. The greater part of the French fleet was in the Mediterranean under the ": null
    },
    {
        "duc de Beaufort": "françois de vendôme, duc de beaufort"
    },
    {
        ", and Louis intended that much of this would be brought into the Atlantic to join up with the Atlantic squadron commanded by ": null
    },
    {
        "Abraham Duquesne": "abraham duquesne"
    },
    {
        ". The combined fleet would then, it was intended, link up with the Dutch in the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        " and outnumber the English fleet.        Despite administrative and logistic difficulties, an English fleet of some eighty ships, under the joint command of ": null
    },
    {
        "the Duke of Albemarle": "george monck, 1st duke of albemarle"
    },
    {
        " and ": null
    },
    {
        "Prince Rupert of the Rhine": "prince rupert of the rhine"
    },
    {
        ", set sail at the end of May 42 The French intention to bring the bulk of their Mediterranean fleet to join the Dutch fleet at ": null
    },
    {
        "Dunkirk": "dunkirk"
    },
    {
        " was known to Prince Rupert by 42 May and discussed by Charles and his ": null
    },
    {
        "Privy Council": "privy council of the united kingdom"
    },
    {
        " on 42 May. When ": null
    },
    {
        "the Duke of Albemarle": "george monck, 1st duke of albemarle"
    },
    {
        " was informed, he agreed to detach a squadron of 42 generally fast or well-armed ships under Prince Rupert to block the ": null
    },
    {
        "Strait of Dover": "strait of dover"
    },
    {
        ", provided he were left with at least 42 ships to fight the Dutch. Rupert was detached on 42 May  to prevent Beaufort passing through the English Channel to join the Dutch fleet.In the event the French fleet did not appear, because Beaufort, who had left Toulon in April 42 with 42 fighting ships, delayed at Lisbon for six weeks, during which time the English and Dutch fleets fought the ": null
    },
    {
        "Four Days Battle": "four days battle"
    },
    {
        ", one of the longest naval engagements in history.     Leaving ": null
    },
    {
        "the Downs": "the downs"
    },
    {
        ", Albemarle came upon De Ruyters fleet of 42 ships at anchor, and he immediately engaged the nearest Dutch ship before the rest of the fleet could come to its assistance. The Dutch rearguard under Lieutenant-Admiral ": null
    },
    {
        "Cornelis Tromp": "cornelis tromp"
    },
    {
        " withdrew upon a ": null
    },
    {
        "starboard": "port and starboard"
    },
    {
        " tack": "tacking"
    },
    {
        ", taking the battle toward the Flemish shoals, compelling Albemarle to turn about to prevent being outflanked by the Dutch rear and centre. This culminated in a ferocious unremitting battle that raged until nightfall. At daylight on 42 June, Albemarles strength of operable vessels was reduced to 42 ships, but with these, he renewed the battle tacking past the enemy four times in close action. With his fleet in too poor a condition to continue to challenge, he then retired towards the Thames Estuary with the Dutch in pursuit.   The following day Albemarle ordered the damaged ships to lead, protecting them from the Dutch fleet by stationing his most powerful ships as a rearguard on the 42rd, until Prince Rupert, returning with his twenty ships, joined him. During this stage of the battle, Vice-Admiral ": null
    },
    {
        "George Ayscue": "george ayscue"
    },
    {
        ", accidentally grounded in the Prince Royal, one of the nine remaining big ships , and surrendered. This was the last time in history that an English admiral surrendered in battle. After this loss and the return of several badly damaged ships to port, Albemarle, reinforced by Ruperts fresh squadron had 42 ships to face the Dutch with 42 ships. After Rupert broke the Dutch line and, with Albemarle attacked Tromp with superior numbers, de Ruyter decided the battle on the fourth day, by a surprise all-out attack when Tromp seemed about to be defeated.. When the English retreated, De Ruyter was reluctant to follow, perhaps because of lack of gunpowder. The battle ended with both sides claiming victory: the English because they contended Dutch Lieutenant Admiral ": null
    },
    {
        "Michiel de Ruyter": "michiel de ruyter"
    },
    {
        " had retreated first, the Dutch because they had inflicted much greater losses on the English, who lost ten ships against the Dutch four. Although the Dutch claim seems more valid, their rejoicing was out of proportion to what had been achieved. It had taken four days to force a weaker, and before Ruperts return much weaker English opponent that had close to defeating them on the second and fourth days. and their belief that the English fleet was destroyed as a fighting force was shown to be false a few weeks later.        One more major sea battle would be fought in the conflict. ": null
    },
    {
        "St. Jamess Day Battle": "st. jamess day battle"
    },
    {
        " of 42 and 42 August, ended in English victory but failed to decide the war as the Dutch fleet escaped annihilation, although suffering heavy casualties. At this stage, simply surviving was sufficient for the Dutch, as the English could hardly afford to replace their losses even from a victory. Tactically indifferent with the Dutch losing two ships and the English one, the battle would have enormous political implications. Cornelis Tromp, commanding the Dutch rear, had defeated his English counterpart, but was accused by De Ruyter of being responsible for the plight of the main body of the Dutch fleet by chasing the English rear squadron as far as the English coast. As Tromp was the champion of the Orange party, the conflict led to much party strife; because of this, Tromp was fired by the States of Holland on August 42      In addition to proposing peace to de Witt, Arlington and Sylvius had plotted to provoke Orangist coup détat against the Republic, to restore the stadtholderate, overthrow de Witt and end the war. Five days after St. Jamess Day Battle, Charles sent another peace offer, again using Buat as an intermediary. Sylvius also sent Buat details of the plot: these were for his contacts in the Orange party but were mistakenly included by Buat with the peace offer handed to the Grand Pensionary. Buat was arrested and those most involved in the conspiracy, including Kievit, fled to England. De Witt used the evidence of the plot to isolate the Orange movement and reaffirm his commitment to the French alliance. Buat was condemned for treason and beheaded in October 42        The mood in the Republic now turned very belligerent, because on 42 August, the English Vice-Admiral ": null
    },
    {
        "Robert Holmes": "robert holmes"
    },
    {
        " raided the ": null
    },
    {
        "Vlie": "vlie"
    },
    {
        " estuary and destroyed up to 42 merchantmen sheltering there valued at around £42 million, with only ten escaping, in an action later known as ": null
    },
    {
        "Holmess Bonfire": "holmess bonfire"
    },
    {
        ". The next day Holmes men also landed on the island of ": null
    },
    {
        "Terschelling": "terschelling"
    },
    {
        " and, finding little of value, they burnt the small town of ": null
    },
    {
        "West-Terschelling": "west-terschelling"
    },
    {
        " to the ground, an act regarded by the Dutch as senseless destruction of a harmless fishing village. In this, he was assisted by a Dutch captain, Laurens Heemskerck, who had fled from the Netherlands for cowardice shown during the battle of Lowestoft, and was afterwards condemned ": null
    },
    {
        "in absentia": "in absentia"
    },
    {
        " to perpetual banishment from the Netherlands.     After the ": null
    },
    {
        "Fire of London": "fire of london"
    },
    {
        " in September, the ": null
    },
    {
        "Navy Board": "navy board"
    },
    {
        " was unable to pay the wages of the fleet and began to discharge many sailors without paying their wages, ensuring that it would be impossible to send out a major fleet in 42. Swedish mediation was offered in the autumn and informal discussions began, which led to the opening of formal negotiations in the following March. Charles was prepared to make some concessions, although he still required the return of the nutmeg island of ": null
    },
    {
        "Pulau Run": "run"
    },
    {
        " and certain indemnities. The Dutch were unwilling to concede even his reduced demands, although discussions continued.             By early42 the financial position of the English crown had become desperate. The kingdom lacked sufficient funds to maintain their fleets seaworthiness, so it was decided in February that the heavy ships were to remain laid up at ": null
    },
    {
        "Chatham": "chatham, england"
    },
    {
        ", with only a small Flying Fleet manned to attack Dutch merchant shipping, which lowered morale in the fleet and prevented merchant ship from sailing and ": null
    },
    {
        "colliers": "collier"
    },
    {
        " from reaching London without fear of Dutch interception. Clarendon informed Charles as to his only two options: to make very substantial concessions to Parliament, or to initiate peace talks with the Dutch under their conditions, which began in March. Charles had wished for peace talks to be held in England or, failing that, at the Hague, but the Dutch offered three other cities where support for the House of Orange was less and Charles selected ": null
    },
    {
        "Breda": "breda"
    },
    {
        ", in the southern ": null
    },
    {
        "Generality Lands": "generality lands"
    },
    {
        ".     As England was also at war with France, Charles sent envoys to Paris in March for unofficial preliminary talks on peace terms. In view of deteriorating Franco-Dutch relations, these talks turned to a third option not considered by Clarendon: a secret alliance with France. In April, Charles concluded his first secret treaty with Louis, stipulating that England would not enter into alliances that might oppose a French conquest of the ": null
    },
    {
        "Spanish Netherlands": "spanish netherlands"
    },
    {
        ". In May, the French invaded, starting the ": null
    },
    {
        "War of Devolution": "war of devolution"
    },
    {
        ". Charles hoped, by means of stalling the talks at Breda, to gain enough time to ready his fleet to obtain concessions from the Dutch, using the French advance as leverage.     De Witt was aware of Charless general intentions  – though not of the secret treaty. He decided to attempt to end the war with a single stroke. Ever since its actions in Denmark in 42 involving many landings to liberate the Danish Isles, the Dutch navy had made a special study of amphibious operations; the ": null
    },
    {
        "Dutch Marine Corps": "dutch marine corps"
    },
    {
        " was established in 42 After the ": null
    },
    {
        "Four Days Battle": "four days battle"
    },
    {
        ", a Dutch marine contingent had been ready to land in Kent or Essex following a possible Dutch victory at sea. The Dutch fleet was, however, unable to force a safe passage into the Thames as navigational buoys had been removed and a strong English squadron was ready to dispute their passage. But now there was no English fleet able to contest a similar attack. De Witt conceived the plan for a landing of marines, to be overseen by his brother Cornelius, at Chatham where the fleet lay effectively defenceless, to destroy it.        In June, De Ruyter, with ": null
    },
    {
        "Cornelis de Witt": "cornelis de witt"
    },
    {
        " supervising, launched the Dutch ": null
    },
    {
        "raid on the Medway": "raid on the medway"
    },
    {
        " at the mouth of the ": null
    },
    {
        "River Thames": "river thames"
    },
    {
        ". After capturing the fort at ": null
    },
    {
        "Sheerness": "sheerness"
    },
    {
        ", the Dutch fleet went on to break through the massive chain protecting the entrance to the Medway and, on the 42th, attacked the laid up English fleet.     The daring raid remains the most humiliating naval disaster in the history of the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " and its predecessors. Fifteen of the Royal Navys remaining ships were destroyed, either by the Dutch or by being scuttled by the English to block the river. Three of the eight remaining big ships were burnt: Royal Oak, the new Loyal London and Royal James. The largest English flagship, , was abandoned by its skeleton crew, captured without a shot being fired, and towed back to the United Provinces as a trophy. Its coat of arms is now on display in the ": null
    },
    {
        "Rijksmuseum": "rijksmuseum"
    },
    {
        ". Fortunately for the English, the Dutch marines spared the ": null
    },
    {
        "Chatham Dockyard": "chatham dockyard"
    },
    {
        ", at the time Englands largest industrial complex; a land attack on the docks themselves would have set back English naval power for a generation. A Dutch attack on the English anchorage at ": null
    },
    {
        "Harwich": "harwich"
    },
    {
        " had to be abandoned however after the ": null
    },
    {
        "battle of Landguard Fort": "battle of landguard fort"
    },
    {
        " ended in Dutch failure.     The Dutch success made a major psychological impact throughout England, with London feeling especially vulnerable just a year after the ": null
    },
    {
        "Great Fire of London": "great fire of london"
    },
    {
        ". However, for a second time, the Dutch had been unable to land substantial land forces in Britain, or even do substantial damage to the Chatham dockyard. The raid did, together with the English financial crisis, speed up negotiations.. All this, together with the cost of the war, of the ": null
    },
    {
        "Great Plague": "great plague of london"
    },
    {
        " and the extravagant spending of Charless court, produced a rebellious atmosphere in London. Clarendon ordered the English envoys at Breda to sign a peace quickly, as Charles feared an open revolt.             The Second Anglo-Dutch war had spread to the ": null
    },
    {
        "Caribbean": "caribbean"
    },
    {
        " islands, and in late 42 an English force, mainly consisting of ": null
    },
    {
        "buccaneer": "buccaneer"
    },
    {
        "s under the command of Lieutenant-colonel ": null
    },
    {
        "Edward Morgan": "edward morgan"
    },
    {
        ", the ": null
    },
    {
        "Deputy Governor of Jamaica": "list of governors of jamaica"
    },
    {
        ", assisted by his nephew ": null
    },
    {
        "Thomas Morgan": "thomas morgan"
    },
    {
        ", quickly captured the Dutch islands of ": null
    },
    {
        "Sint Eustatius": "sint eustatius"
    },
    {
        " and ": null
    },
    {
        "Saba": "saba"
    },
    {
        ". After his uncles death in December 42 Thomas Morgan was appointed as governor of these two islands. Also in late 42 an English force from Jamaica and ": null
    },
    {
        "Barbados": "barbados"
    },
    {
        " captured the Dutch possession of ": null
    },
    {
        "Tobago": "tobago"
    },
    {
        ". The French declaration of war on the side of the Dutch altered the balance of power in the Caribbean and facilitated a Dutch counterattack. The first successes of the new allies were the French recapture of Tobago in August 42 a joint Franco-Dutch recapture of Sint Eustatius in November 42 and a French capture of the English island of ": null
    },
    {
        "Antigua": "antigua"
    },
    {
        " in the same month. The arrival of a French squadron under ": null
    },
    {
        "Joseph-Antoine de La Barre": "joseph-antoine de la barre"
    },
    {
        " in January 42 allowed the French to occupy the English half of St Kitts and ": null
    },
    {
        "Montserrat": "montserrat"
    },
    {
        ", leaving only ": null
    },
    {
        "Nevis": "nevis"
    },
    {
        " of the ": null
    },
    {
        "Leeward Islands": "leeward islands"
    },
    {
        " in English hands, together with Jamaica and Barbados to the west.     A Dutch force under Admiral ": null
    },
    {
        "Abraham Crijnssen": "abraham crijnssen"
    },
    {
        ", organised by the province of Zeeland, not the States General, arrived at ": null
    },
    {
        "Cayenne": "cayenne"
    },
    {
        " in February 42 and captured ": null
    },
    {
        "Suriname": "suriname"
    },
    {
        " from the English in the same month. Crijnssen delayed in Suriname until April, then sailed to Tobago, which had been vacated by the French after expelling the English garrison, where he rebuilt the fort and left a small garrison. Although Crijnssen was instructed not to delay, it was not until early May that he and de La Barre combined forces, agreeing to a Franco-Dutch invasion of ": null
    },
    {
        "Nevis": "nevis"
    },
    {
        ", which sailed on 42 May 42 However, their attack was repelled in the ": null
    },
    {
        "Battle of Nevis": "battle of nevis"
    },
    {
        " on 42 May by a smaller English force. This confused naval action was the only one in this war were all three navies fought: it failed largely through de la Barres incompetence. After this failed attack, Crijnssen left in disgust and sailed to the north to attack the Virginia colony, while the French, under de la Barre, moved to Martinique. The Battle of Nevis restored English naval control in the Caribbean and allowed the early recapture of Antigua and Montserrat and an unsuccessful attack on St Kitts soon after.     In April, a new English squadron of nine warships and two fireships under the command of Rear-Admiral Sir ": null
    },
    {
        "John Harman": "john harman"
    },
    {
        " sailed for the West Indies, reaching them in early June. Harman encountered the French with seven larger and 42 smaller warships and three fireships under la Barre anchored under the batteries of Fort ": null
    },
    {
        "St Pierre": "saint-pierre, martinique"
    },
    {
        ", Martinique. He attacked on 42 July and sunk, burnt or captured all but two the French ships. With the French fleet neutralised, Harman then attacked the French at ": null
    },
    {
        "Cayenne": "cayenne"
    },
    {
        " on 42 September forcing its garrison to surrender. The English fleet then went on to recapture ": null
    },
    {
        "Fort Zeelandia": "fort zeelandia"
    },
    {
        " in Suriname in October. News of these English victories only reached England in September, after the Treaty of Breda had been signed, and possessions captured after 42 July had to be returned. Crijnssen sailed back to the Caribbean only to find the French fleet destroyed and the English back in possession of Suriname.             On 42 July 42 what is generally known as the ": null
    },
    {
        "Treaty of Breda": "treaty of breda"
    },
    {
        " concluded peace between England and the Netherlands. The treaty allowed the English to keep possession of ": null
    },
    {
        "New Netherland": "new netherland"
    },
    {
        ", while the Dutch kept control over Pulau Run and the valuable sugar plantations of ": null
    },
    {
        "Suriname": "suriname"
    },
    {
        " and regained Tobago, St Eustatius and its West African trading posts. This  uti possidetis  solution was confirmed in the ": null
    },
    {
        "Treaty of Westminster": "treaty of westminster"
    },
    {
        "..The ": null
    },
    {
        "Act of Navigation": "act of navigation"
    },
    {
        " was modified in favour of the Dutch by England agreeing to treat Germany as part of the Netherlands commercial hinterland, so that Dutch ships would now be allowed to carry German goods to English ports.     In the same date and also at Breda, a public treaty was concluded between England and France that stipulated the return to England of the former English part of ": null
    },
    {
        "St Christopher": "st christopher"
    },
    {
        " and the islands of ": null
    },
    {
        "Antigua": "antigua"
    },
    {
        " and ": null
    },
    {
        "Montserrat": "montserrat"
    },
    {
        ", all of which the French had occupied in the war, and that England should surrender Acadia to France, although the extent of Acadia was not defined. This public treaty had been preceded by a secret treaty signed on 42 April in which, in addition to these exchanges of territory, Louis and Charles agreed not to enter into alliances opposed to the interests of the other, by which Louis secured the neutrality of England in the war he planned against Spain.     The order of priorities whereby the Dutch preferred to give up what would become a major part of the United States, and instead retain a tropical colony, would seem strange by present-day standards. However, in the 42th century tropical colonies producing agricultural products which could not be grown in Europe were deemed more valuable than ones with a climate similar to that of Europe where Europeans could settle in comfort.     The peace was generally seen as a personal triumph for Johan de Witt and an embarrassment to the Orangists, who seemed reluctant to support the war and eager to accept a disadvantageous early peace. The Republic was jubilant about the Dutch victory. De Witt used the occasion to induce four provinces to adopt the ": null
    },
    {
        "Perpetual Edict of 42": "perpetual edict"
    },
    {
        " abolishing the stadtholderate forever. He used the weak position of Charles II to force him into the ": null
    },
    {
        "Triple Alliance of 42": "triple alliance of 1668"
    },
    {
        " which again forced Louis to temporarily abandon his plans for the conquest of the southern Netherlands. But de Witts success would eventually produce his downfall and nearly that of the Republic with it. Both humiliated monarchs intensified their secret cooperation and would, joined by the bishop of Münster, attack the Dutch in 42 in the ": null
    },
    {
        "Third Anglo-Dutch War": "third anglo-dutch war"
    },
    {
        ". De Witt was unable to counter this attack, as he could not create a strong Dutch army for lack of money and for fear that it would strengthen the position of the young ": null
    },
    {
        "William III": "william iii of england"
    },
    {
        ".": null
    }
]