[
    {
        "     The secondary sector of the economy including ": null
    },
    {
        "industries": "industry"
    },
    {
        " that produce a finished, usable ": null
    },
    {
        "product": "production"
    },
    {
        " or are involved in ": null
    },
    {
        "construction": "construction"
    },
    {
        ".     This sector generally takes the output of the ": null
    },
    {
        "primary sector": "primary sector of the economy"
    },
    {
        " and manufactures finished ": null
    },
    {
        "goods": "good"
    },
    {
        "or where they are suitable for use by other businesses, for ": null
    },
    {
        "export": "export"
    },
    {
        ", or ": null
    },
    {
        "sale": "sales"
    },
    {
        " to domestic consumers. This sector is often divided into ": null
    },
    {
        "light industry": "light industry"
    },
    {
        " and ": null
    },
    {
        "heavy industry": "heavy industry"
    },
    {
        ". Many of these industries consume large quantities of energy and require factories and machinery to convert raw materials into goods and products. They also produce ": null
    },
    {
        "waste": "waste"
    },
    {
        " materials and ": null
    },
    {
        "waste heat": "waste heat"
    },
    {
        " that may cause environmental problems or cause ": null
    },
    {
        "pollution": "pollution"
    },
    {
        ". The secondary sector supports both the primary and ": null
    },
    {
        "tertiary sector": "tertiary sector of the economy"
    },
    {
        ".     Some economists contrast wealth-producing sectors in an economy such as manufacturing with the service sector which tends to be wealth-consuming. Examples of service may include retail, insurance, and government. These economists contend that an economy begins to decline as its wealth-producing sector shrinks. Manufacturing is an important activity to promote economic growth and development. Nations that export manufactured products tend to generate higher marginal GDP growth which supports higher incomes and marginal tax revenue needed to fund the quality of life initiatives such as health care and infrastructure in the economy. The field is an important source for engineering job opportunities. Among developed countries, it is an important source of well-paying jobs for the middle class to facilitate greater social mobility for successive generations on the economy.     ": null
    }
]