[
    {
        "Secotioid fungi are an intermediate growth form between mushroom-like ": null
    },
    {
        "hymenomycete": "hymenomycete"
    },
    {
        "s and closed bag-shaped ": null
    },
    {
        "gasteromycetes": "gasteroid fungi"
    },
    {
        ", where an evolutionary process of gasteromycetation has started but not run to completion. Secotioid fungi may or may not have opening caps, but in any case they often lack the vertical ": null
    },
    {
        "geotropic": "geotropism"
    },
    {
        " orientation of the ": null
    },
    {
        "hymenophore": "hymenophore"
    },
    {
        " needed to allow the spores to be dispersed by wind, and the ": null
    },
    {
        "basidiospores": "basidiospores"
    },
    {
        " are not forcibly discharged or otherwise prevented from being dispersed —note—some mycologists do not consider a species to be secotioid unless it has lost ": null
    },
    {
        "ballistospory": "ballistospory"
    },
    {
        ".         Historically ": null
    },
    {
        "agarics": "agarics"
    },
    {
        " and ": null
    },
    {
        "boletes": "boletes"
    },
    {
        "  were classified quite separately from the ": null
    },
    {
        "gasteroid fungi": "gasteroid fungi"
    },
    {
        ", such as ": null
    },
    {
        "puff-balls": "puff-balls"
    },
    {
        " and ": null
    },
    {
        "truffles": "truffles"
    },
    {
        ", of which the spores are formed in a large mass enclosed in an outer skin. However, in spite of this apparently very great difference in form, recent mycological research, both at microscopic and molecular level has shown that sometimes species of open mushrooms are much more closely related to particular species of gasteroid fungi than they are to each other. Fungi which do not open up to let their spores be dispersed in the air, but which show a clear ": null
    },
    {
        "morphological": "morphology"
    },
    {
        " relation to agarics or boletes, constitute an intermediate form and are called secotioid.     The word is derived from the name of the genus  Secotium , which contains such species.     On a microscopic scale, secotioid fungi do not expel their spores forcibly from the basidium; their spores are statismospores . Like gasteroid fungi, secotioid species rely on animals such as rodents or insects to distribute their spores.     It can at times be disadvantageous for a mushroom to open up and free its spores in the usual way. If this development is aborted, a secotioid form arises, perhaps to be followed eventually by an evolutionary progression to a fully gasteroid form. This type of progression is called gasteromycetation and seems to have happened several times independently starting from various genera of normal mushrooms. This means that the secotioid and also the gasteroid fungi are ": null
    },
    {
        "polyphyletic": "polyphyletic"
    },
    {
        ". According to the paper by Thiers, in certain climates and certain seasons, it may be an advantage to remain closed, because moisture can be conserved in that way.     There is a spectrum of secotioid species ranging from the open form to the closed form in the following respects:   there may be an evident stipe, or there may be only a remnant consisting of a column of non-fertile tissue,   if there is a stipe the edge of the cap may separate from it , or may not,   there may be recognizable gills , or the fertile interior may be uniform like the ": null
    },
    {
        "gleba": "gleba"
    },
    {
        " of gasteroid fungi, and   the spore-bearing tissue may be above ground , or underground , or partly buried.     The adjective sequestrate is sometimes used as a general term to mean either secotioid or gasteroid .            For example, the secotioid genus  Hymenogaster  has been shown to be closely related to agaric genera such as  Hebeloma , which were formerly placed in family ": null
    },
    {
        "Cortinariaceae": "cortinariaceae"
    },
    {
        " or ": null
    },
    {
        "Strophariaceae": "strophariaceae"
    },
    {
        ". This is found by DNA analysis and also indicated on a microscopic scale by the resemblance of the spores and basidia. According to a current classification system, Hebeloma now belongs to family ": null
    },
    {
        "Hymenogastraceae": "hymenogastraceae"
    },
    {
        ", and is considered more narrowly related to the closed  Hymenogaster  fungi than, for instance, to the ordinary mushrooms in genus  Cortinarius .     A similar case is the well-known Deceiver mushroom  Laccaria laccata  which is now classified in the  Hydnangiaceae , Hydnangium being a gastroid genus.      Cortinarius  is a very widespread genus of agarics, but also contains some secotioid species, such as C. leucocephalus, C. coneae and C. cartilagineus.     Secotioid genus Nivatogastrium corresponds to agaric genus  Pholiota  and provides a vivid example of the phenomenon.     It has been found that a change in a single locus of a gene of the gilled mushroom  Lentinus tigrinus  causes it to have a closed fruiting body. This suggests that the emergence of a secotioid species may not require many mutations.      Gastroboletus  is a secotioid ": null
    },
    {
        "bolete": "bolete"
    },
    {
        " genus where the fruiting bodies may or may not open, but in any case the tubes are not aligned vertically as in a true bolete.      Agaricus deserticola  is a secotioid species of  Agaricus  which at one time was placed in the genus Secotium. Similarly,  Agaricus inapertus  was formerly known as Endoptychum depressum until ": null
    },
    {
        "molecular": "molecular phylogenetics"
    },
    {
        " analysis revealed it to be closely aligned with Agaricus. ": null
    }
]