[
    {
        "           The second  is the ": null
    },
    {
        "base unit": "si base unit"
    },
    {
        " of ": null
    },
    {
        "time": "time"
    },
    {
        " in the ": null
    },
    {
        "International System of Units": "international system of units"
    },
    {
        " , commonly understood and historically defined as  of a ": null
    },
    {
        "day": "day"
    },
    {
        " – this factor derived from the division of the day first into 24 ": null
    },
    {
        "hour": "hour"
    },
    {
        "s, then to 60 ": null
    },
    {
        "minutes": "minute"
    },
    {
        "and finally to 60 seconds each. ": null
    },
    {
        "Analog clocks": "analog clock"
    },
    {
        "and ": null
    },
    {
        "watch": "watch"
    },
    {
        "es often have sixty tick marks on their faces, representing seconds , and a second hand to mark the passage of time in seconds. Digital clocks and watches often have a two-digit seconds counter. The second is also part of several other units of measurement like meters per second for ": null
    },
    {
        "velocity": "velocity"
    },
    {
        ", meters per second per second for ": null
    },
    {
        "acceleration": "acceleration"
    },
    {
        ", and per second for ": null
    },
    {
        "frequency": "frequency"
    },
    {
        ".     Although the historical definition of the unit was based on this division of the Earths rotation cycle, the formal definition in the International System of Units  is a much steadier timekeeper: it is defined by taking the fixed numerical value of the caesium frequency ∆ν Cs , the unperturbed ": null
    },
    {
        "ground-state": "ground state"
    },
    {
        " hyperfine transition frequency": "hyperfine structure"
    },
    {
        " of the ": null
    },
    {
        "caesium-133": "caesium-133"
    },
    {
        " atom, to be  when expressed in the unit ": null
    },
    {
        "Hz": "hz"
    },
    {
        ", which is equal to s −1 .     Because the Earths rotation varies and is also slowing ever so slightly, a ": null
    },
    {
        "leap second": "leap second"
    },
    {
        " is periodically added to ": null
    },
    {
        "clock time": "civil time"
    },
    {
        " to keep clocks in sync with Earths rotation.     Multiples of seconds are usually counted in hours and minutes. Fractions of a second are usually counted in tenths or hundredths. In scientific work, small fractions of a second are counted in milliseconds , microseconds , nanoseconds , and sometimes smaller units of a second. An everyday experience with small fractions of a second is a 1-gigahertz microprocessor which has a cycle time of 1 nanosecond. Camera ": null
    },
    {
        "shutter speeds": "shutter speed"
    },
    {
        "are often expressed in fractions of a second, such as  second or  second.     ": null
    },
    {
        "Sexagesimal": "sexagesimal"
    },
    {
        " divisions of the day from a calendar based on astronomical observation have existed since the third millennium BC, though they were not seconds as we know them today. Small divisions of time could not be measured back then, so such divisions were mathematically derived. The first timekeepers that could count seconds accurately were pendulum clocks invented in the 17th century. Starting in the 1950s, ": null
    },
    {
        "atomic clocks": "atomic clock"
    },
    {
        "became better timekeepers than earths rotation, and they continue to set the standard today.       A mechanical clock, one which does not depend on measuring the relative rotational position of the earth, keeps uniform time called mean time, within whatever accuracy is intrinsic to it. That means that every second, minute and every other division of time counted by the clock will be the same duration as any other identical division of time. But a ": null
    },
    {
        "sundial": "sundial"
    },
    {
        " which measures the relative position of the sun in the sky called apparent time, does not keep uniform time. The time kept by a sundial varies by time of year, meaning that seconds, minutes and every other division of time is a different duration at different times of the year. The time of day measured with mean time versus apparent time may differ by as much as 15 minutes, but a single day will differ from the next by only a small amount; 15 minutes is a cumulative difference over a part of the year. The effect is due chiefly to the obliqueness of earths axis with respect to its orbit around the sun.     The difference between apparent solar time and mean time was recognized by astronomers since antiquity, but prior to the invention of accurate mechanical clocks in the mid-17th century, sundials were the only reliable timepieces, and apparent solar time was the generally accepted standard.       Fractions of a second are usually denoted in decimal notation, for example 2.01 seconds, or two and one hundredth seconds. Multiples of seconds are usually expressed as minutes and seconds, or hours, minutes and seconds of clock time, separated by colons, such as 11:23:24, or 45:23 . It rarely makes sense to express longer periods of time like hours or days in seconds, because they are awkwardly large numbers. For the metric unit of second, there are ": null
    },
    {
        "decimal prefixes": "metric prefix"
    },
    {
        " representing 10 to 10 seconds.     Some common units of time in seconds are: a minute is 60 seconds; an hour is 3,600 seconds; a day is 86,400 seconds; a week is 604,800 seconds; a year  is 31,536,000 seconds; and a  century averages 3,155,695,200 seconds; with all of the above excluding any possible ": null
    },
    {
        "leap second": "leap second"
    },
    {
        "s.     Some common events in seconds are: a stone falls about 4.9 meters from rest in one second; a pendulum of length about one meter has a swing of one second, so pendulum clocks have pendulums about a meter long; the fastest human sprinters run 10 meters in a second; an ocean wave in deep water travels about 23 meters in one second; sound travels about 343 meters in one second in air; light takes 1.3 seconds to reach Earth from the surface of the Moon, a distance of 384,400 kilometers.       A second is part of other units, such as frequency measured in hertz , speed and acceleration . The metric system unit becquerel, a measure of radioactive decay, is measured in inverse seconds. The meter is defined in terms of the speed of light and the second; definitions of the metric base units kilogram, ampere, kelvin, and candela also depend on the second. The only base unit whose definition does not depend on the second is the mole. Of the 22 named derived units of the SI, only two , do not depend on the second. Many derivative units for everyday things are reported in terms of larger units of time, not seconds, such as clock time in hours and minutes, velocity of a car in kilometers per hour or miles per hour, kilowatt hours of electricity usage, and speed of a turntable in rotations per minute.       A set of atomic clocks throughout the world keeps time by consensus: the clocks vote on the correct time, and all voting clocks are steered to agree with the consensus, which is called International Atomic Time . TAI ticks ": null
    },
    {
        "atomic seconds": "atomic   second"
    },
    {
        ".      Civil time is defined to agree with the rotation of the earth. The international standard for timekeeping is ": null
    },
    {
        "Coordinated Universal Time": "coordinated universal time"
    },
    {
        " . This time scale ticks the same atomic seconds as TAI, but inserts or omits ": null
    },
    {
        "leap seconds": "leap second"
    },
    {
        "as necessary to correct for variations in the rate of rotation of the earth.      A time scale in which the seconds are not exactly equal to atomic seconds is UT1, a form of ": null
    },
    {
        "universal time": "universal time"
    },
    {
        ". UT1 is defined by the rotation of the earth with respect to the sun, and does not contain any leap seconds.  UT1 always differs from UTC by less than a second.       While they are not yet part of any timekeeping standard, optical lattice clocks with frequencies in the visible light spectrum now exist and are the most accurate timekeepers of all. A ": null
    },
    {
        "strontium": "strontium"
    },
    {
        " clock with frequency 430  ": null
    },
    {
        "THz": "terahertz"
    },
    {
        ", in the red range of visible light, now holds the accuracy record: it will gain or lose less than a second in 15 billion years, which is longer than the estimated age of the universe. Such a clock can measure a change in its elevation of as little as 2  cm by the change in its rate due to ": null
    },
    {
        "gravitational time dilation": "gravitational time dilation"
    },
    {
        ".           There have only ever been three definitions of the second: as a fraction of the day, as a fraction of an extrapolated year, and as the microwave frequency of a ": null
    },
    {
        "caesium": "caesium"
    },
    {
        " atomic clock, and they have realized a sexagesimal division of the day from ancient astronomical calendars.       Civilizations in the classic period and earlier created divisions of the calendar as well as arcs using a sexagesimal system of counting, so at that time the second was a sexagesimal subdivision of the day , not of the hour like the modern second . Sundials and water clocks were among the earliest timekeeping devices, and units of time were measured in degrees of arc. Conceptual units of time smaller than realizable on sundials were also used.     There are references to second as part of a lunar month in the writings of natural philosophers of the Middle Ages, which were mathematical subdivisions that could not be measured mechanically.       The earliest mechanical clocks which appeared starting in the 14th century had displays that divided the hour into halves, thirds, quarters and sometimes even 12 parts, but never by 60. In fact, the hour was not commonly understood to be the duration of 60 minutes. It was not practical for timekeepers to consider minutes until the first mechanical clocks that displayed minutes appeared near the end of the 16th century. By that time, sexagesimal divisions of time were well established in Europe.     The earliest clocks to display seconds appeared during the last half of the 16th century. The second became accurately measurable with the development of mechanical clocks keeping mean time, as opposed to the apparent time displayed by ": null
    },
    {
        "sundial": "sundial"
    },
    {
        "s. The earliest spring-driven timepiece with a second hand which marked seconds is an unsigned clock depicting ": null
    },
    {
        "Orpheus": "orpheus"
    },
    {
        " in the Fremersdorf collection, dated between 1560 and  During the 3rd quarter of the 16th century, ": null
    },
    {
        "Taqi al-Din": "taqi al-din muhammad ibn maruf"
    },
    {
        " built a clock with marks every 1/5 minute.    In 1579, ": null
    },
    {
        "Jost Bürgi": "jost bürgi"
    },
    {
        " built a clock for ": null
    },
    {
        "William of Hesse": "william iv, landgrave of hesse-kassel"
    },
    {
        " that marked seconds.  In 1581, ": null
    },
    {
        "Tycho Brahe": "tycho brahe"
    },
    {
        " redesigned clocks that had displayed only minutes at his observatory so they also displayed seconds, even though those seconds were not accurate. In 1587, Tycho complained that his four clocks disagreed by plus or minus four seconds.      In 1656, Dutch scientist Christiaan Huygens invented the first pendulum clock. It had a pendulum length of just under a meter which gave it a swing of one second, and an escapement that ticked every second. It was the first clock that could accurately keep time in seconds. By the 1730s, 80 years later, John Harrisons maritime chronometers could keep time accurate to within one second in 100 days.     In 1832, ": null
    },
    {
        "Gauss": "carl friedrich gauss"
    },
    {
        " proposed using the second as the base unit of time in his millimeter-milligram-second ": null
    },
    {
        "system of units": "system of units"
    },
    {
        ". The ": null
    },
    {
        "British Association for the Advancement of Science": "british association for the advancement of science"
    },
    {
        " in 1862 stated that All men of science are agreed to use the second of mean solar time as the unit of time.  BAAS formally proposed the ": null
    },
    {
        "CGS system": "cgs"
    },
    {
        " in 1874, although this system was gradually replaced over the next 70 years by ": null
    },
    {
        "MKS": "mks system of units"
    },
    {
        " units. Both the CGS and MKS systems used the same second as their base unit of time. MKS was adopted internationally during the 1940s, defining the second as  of a mean solar day.          Some time in the late 1940s, quartz crystal oscillator clocks with an operating frequency of ~100  kHz advanced to keep time with accuracy better than 1 part in 10 8 over an operating period of a day. It became apparent that a consensus of such clocks kept better time than the rotation of the Earth. Metrologists also knew that Earths orbit around the Sun was much more stable than earths rotation. This led to proposals as early as 1950 to define the second as a fraction of a year.     The Earths motion was described in ": null
    },
    {
        "Newcombs Tables of the Sun": "newcombs tables of the sun"
    },
    {
        " , which provided a formula for estimating the motion of the Sun relative to the epoch 1900 based on astronomical observations made between 1750 and 1892.  This resulted in adoption of an ": null
    },
    {
        "ephemeris time": "ephemeris time"
    },
    {
        " scale expressed in units of the ": null
    },
    {
        "sidereal year": "sidereal year"
    },
    {
        " at that epoch by the ": null
    },
    {
        "IAU": "international astronomical union"
    },
    {
        " in 1952.      This extrapolated timescale brings the observed positions of the celestial bodies into accord with Newtonian dynamical theories of their motion. In 1955, the ": null
    },
    {
        "tropical year": "tropical year"
    },
    {
        ", considered more fundamental than the sidereal year, was chosen by the IAU as the unit of time. The tropical year in the definition was not measured but calculated from a formula describing a mean tropical year that decreased linearly over time.     In 1956, the second was redefined in terms of a year relative to that ": null
    },
    {
        "epoch": "epoch"
    },
    {
        ". The second was thus defined as the fraction  of the tropical year for 1900 ": null
    },
    {
        "January 0": "january 0"
    },
    {
        " at 12 hours ephemeris time . This definition was adopted as part of the ": null
    },
    {
        "International System of Units": "international system of units"
    },
    {
        " in 1960.        But even the best mechanical, electric motorized and quartz crystal-based clocks develop discrepancies, and virtually none are good enough to realize an ephemeris second. Far better for timekeeping is the natural and exact vibration in an energized atom. The frequency of vibration is very specific depending on the type of atom and how it is excited. Since 1967, the second has been defined as exactly the duration of 9,192,631,770 ": null
    },
    {
        "periods": "frequency"
    },
    {
        " of the radiation corresponding to the transition between the two ": null
    },
    {
        "hyperfine levels": "hyperfine structure"
    },
    {
        " of the ground state of the ": null
    },
    {
        "caesium-133": "caesium-133"
    },
    {
        " atom . This length of a second was selected to correspond exactly to the length of the ephemeris second previously defined. Atomic clocks use such a frequency to measure seconds by counting cycles per second at that frequency. Radiation of this kind is one of the most stable and reproducible phenomena of nature. The current generation of atomic clocks is accurate to within one second in a few hundred million years.     Atomic clocks now set the length of a second and the time standard for the world.           ": null
    },
    {
        "SI prefix": "si prefix"
    },
    {
        "es are commonly used for times shorter than one second, but rarely for multiples of a second. Instead, certain ": null
    },
    {
        "non-SI units are permitted for use in SI": "non-si units mentioned in the si"
    },
    {
        ": ": null
    },
    {
        "minute": "minute"
    },
    {
        "s, ": null
    },
    {
        "hour": "hour"
    },
    {
        "s, ": null
    },
    {
        "day": "day"
    },
    {
        "s, and in astronomy ": null
    },
    {
        "Julian year": "julian year"
    },
    {
        "s.  Reprinted from the IAU Style Manual by G.A. Wilkinson, Comm. 5, in IAU Transactions XXB .   ": null
    }
]