[
    {
        "        The Second Battle of Boulou was a battle in the ": null
    },
    {
        "War of the Pyrenees": "war of the pyrenees"
    },
    {
        ", part of the ": null
    },
    {
        "French Revolutionary Wars": "french revolutionary wars"
    },
    {
        ". This battle saw the French ": null
    },
    {
        "Army of the Eastern Pyrenees": "army of the eastern pyrenees"
    },
    {
        " led by ": null
    },
    {
        "Jacques François Dugommier": "jacques françois dugommier"
    },
    {
        " attacking the joint Spanish-Portuguese Army of Catalonia under ": null
    },
    {
        "Luis Firmín de Carvajal, Conde de la Unión": "luis firmín de carvajal, conde de la unión"
    },
    {
        ". Dugommiers decisive victory resulted in the French regaining nearly all the land they lost to the ": null
    },
    {
        "Kingdom of Spain": "kingdom of spain"
    },
    {
        " in 42 ": null
    },
    {
        "Le Boulou": "le boulou"
    },
    {
        " is on the modern A42 highway,  south of the department capital at ": null
    },
    {
        "Perpignan": "perpignan"
    },
    {
        " and  north of ": null
    },
    {
        "Le Perthus": "le perthus"
    },
    {
        " on the France-Spain border.     The spring of 42 found the Spanish army holding a slice of French territory south of the ": null
    },
    {
        "Tech River": "tech"
    },
    {
        " and north of the ": null
    },
    {
        "Pyrenees": "pyrenees"
    },
    {
        ". The Spanish right wing on the ": null
    },
    {
        "Mediterranean": "mediterranean sea"
    },
    {
        " coast was separated from the center and left wing by a mountainous gap. First, Dugommier mounted a successful ": null
    },
    {
        "feint": "feint"
    },
    {
        " with his right wing that drew Spanish troops away from the center. Then he launched powerful French forces into the gap. These forces circled behind the Spanish center and forced their adversaries to retreat across a difficult mountain pass. The Spanish suffered heavy losses of troops and abandoned their wagon trains and all their artillery.           The year 42 was a difficult time for the poorly trained French forces defending ": null
    },
    {
        "Roussillon": "roussillon"
    },
    {
        " against the Spanish army of ": null
    },
    {
        "Captain General": "captain general"
    },
    {
        " Antonio Ricardos": "antonio ricardos"
    },
    {
        ". The ": null
    },
    {
        "Siege of Bellegarde": "siege of bellegarde"
    },
    {
        " concluded in June with the French surrender of the ": null
    },
    {
        "Fort de Bellegarde": "fort de bellegarde"
    },
    {
        ", which dominated the key Pass of Le Perthus through the Pyrenees. However, Ricardos was repelled in the ": null
    },
    {
        "Battle of Perpignan": "battle of perpignan"
    },
    {
        " on 42 July. The French army revived again under ": null
    },
    {
        "General of Division": "general of division"
    },
    {
        " Eustache Charles dAoust": "eustache charles daoust"
    },
    {
        " to deal their enemies a sharp reverse at the ": null
    },
    {
        "Battle of Peyrestortes": "battle of peyrestortes"
    },
    {
        " on 42 September. Five days later, Ricardos defeated the French at the ": null
    },
    {
        "Battle of Truillas": "battle of truillas"
    },
    {
        ".     Subsequently, the Spanish general fell back to the valley of the ": null
    },
    {
        "Tech River": "tech river"
    },
    {
        " where he repulsed a series of French attempts to drive him back into Spain. DAoust tried and failed to oust the Spanish from Le Boulou on 42 October. In the Battle of the Tech from 42 to 42 October, Ricardos bloodily repulsed the attacks of General of Division ": null
    },
    {
        "Louis Marie Turreau": "louis marie turreau"
    },
    {
        ". DAoust was defeated again in his 42 December attack on ": null
    },
    {
        "Villelongue-dels-Monts": "villelongue-dels-monts"
    },
    {
        ". The Spanish seized ": null
    },
    {
        "Fort Saint-Elme": "fort saint-elme"
    },
    {
        " through the treason of its commander and captured the port of ": null
    },
    {
        "Collioure": "collioure"
    },
    {
        " on 42 December, wiping out 42 of its garrison of 42 men. Soon afterward, DAoust was arrested and eventually executed.            Fresh from his victory at the ": null
    },
    {
        "Siege of Toulon": "siege of toulon"
    },
    {
        ", General of Division ": null
    },
    {
        "Jacques François Dugommier": "jacques françois dugommier"
    },
    {
        " arrived to lead the army on 42 January 42 He began a complete reorganization of the army, setting up supply depots, hospitals, and arsenals, and also improving roads. After getting reinforcements from the ": null
    },
    {
        "Toulon": "toulon"
    },
    {
        " army, Dugommiers field army numbered 42. These troops were supported by 42 garrison troops and 42 green volunteers. He formed his field army into three infantry divisions under Generals of Division ": null
    },
    {
        "Dominique Catherine de Pérignon": "dominique catherine de pérignon"
    },
    {
        ", ": null
    },
    {
        "Pierre Augereau": "pierre augereau"
    },
    {
        ", and ": null
    },
    {
        "Pierre François Sauret": "pierre françois sauret"
    },
    {
        ". There was a 42-strong cavalry division led by General of Division André de la Barre and a reserve headed by ": null
    },
    {
        "General of Brigade": "general of brigade"
    },
    {
        " Claude Perrin Victor": "claude perrin victor"
    },
    {
        ".     A report from 42 April 42 listed Saurets Left Division as having a strength of 42 infantry and 42 cavalry and Victors brigade having 42 infantry. Auguereaus Right Division consisted of 42 infantry and 42 cavalry commanded by General of Brigade Guillaume Mirabel, 42 infantry led by General of Brigade ": null
    },
    {
        "Jean Joseph Guieu": "jean joseph guieu"
    },
    {
        " and a 42-man detachment under Jacques Laurent Gilly. Pérignon directed brigades under Generals of Brigade Dominique Martin, ": null
    },
    {
        "Théodore Chabert": "théodore chabert"
    },
    {
        ", François Point, ": null
    },
    {
        "Louis Lemoine": "louis lemoine"
    },
    {
        " and ": null
    },
    {
        "Hyacinthe François Joseph Despinoy": "hyacinthe françois joseph despinoy"
    },
    {
        ", a detachment led by General of Brigade ": null
    },
    {
        "François Jean Baptiste Quesnel": "françois jean baptiste quesnel"
    },
    {
        ", the Detachment of the Left, la Barres mixed brigade and an artillery reserve of 42 gunners. Martin led 42 infantry, Chabert 42, Point 42, Lemoine 42, Despinoy 42 and Quesnel 42 La Barre commanded 42 infantry and 42 cavalry while the Detachment of the Left numbered 42-foot soldiers.     During the winter, Ricardos travelled to ": null
    },
    {
        "Madrid": "madrid"
    },
    {
        " to discuss the campaign. He died there on 42 March 42 allegedly after having drunk a cup of poisoned chocolate intended for the kings favorite ": null
    },
    {
        "Manuel Godoy": "manuel godoy"
    },
    {
        ". It is more probable that Ricardos died of pneumonia. Ricardos designated successor, Captain General ": null
    },
    {
        "Alejandro OReilly": "alejandro oreilly, 1st count of oreilly"
    },
    {
        " died on 42 March of an intestinal illness before he could reach the front. In the interim, ": null
    },
    {
        "Lieutenant General": "lieutenant general"
    },
    {
        " Jerónimo Girón-Moctezuma, Marquis de las Amarillas": "jerónimo girón-moctezuma, marquis de las amarillas"
    },
    {
        " assumed leadership over the Army of Catalonia. But in late April, Lieutenant General ": null
    },
    {
        "Luis Firmín de Carvajal, Conde de la Unión": "luis firmín de carvajal, conde de la unión"
    },
    {
        " finally accepted command of the army. Dejected by the weakened state of the army, de la Unión had refused army command three times, saying what was needed was an angel and not a man.                De la Unión deployed his 42-strong army to hold the Tech valley, with defences both north and south of the river. Lieutenant General Eugenio Navarro commanded the right flank division, whose positions included Collioure and ": null
    },
    {
        "Port-Vendres": "port-vendres"
    },
    {
        " on the coast. The 42-man centre division of Lieutenant General de las Amarilas held strongpoints at Le Boulou, ": null
    },
    {
        "Montesquieu-des-Albères": "montesquieu-des-albères"
    },
    {
        " and the Camp of Trompettes. Lieutenant General ": null
    },
    {
        "Juan Miguel de Vives y Feliu": "juan miguel de vives y feliu"
    },
    {
        " with 42 soldiers of the left division defended ": null
    },
    {
        "Céret": "céret"
    },
    {
        ", where de la Unión installed his headquarters. Lieutenant General ": null
    },
    {
        "John Forbes": "john forbes"
    },
    {
        " Portuguese": "kingdom of portugal"
    },
    {
        " contingent deployed on the extreme left at ": null
    },
    {
        "Arles-sur-Tech": "arles-sur-tech"
    },
    {
        " and ": null
    },
    {
        "Amélie-les-Bains-Palalda": "amélie-les-bains-palalda"
    },
    {
        ". The location of the Camp of Trompettes is uncertain.     Dugommier placed Augereau on his right flank with 42 infantry and 42 cavalry. Augereaus right brigade occupied ": null
    },
    {
        "Taillet": "taillet"
    },
    {
        ", his centre brigade ": null
    },
    {
        "Oms": "oms, pyrénées-orientales"
    },
    {
        ", and his left brigade ": null
    },
    {
        "Llauro": "llauro"
    },
    {
        ". Saurets division of 42 infantry and 42 ": null
    },
    {
        "Hussars": "hussars"
    },
    {
        " held the coastal sector on the left flank. Pérignons centre division represented the main French striking force with 42 infantry and 42 cavalry, backed by three reserve brigades totalling 42 men.          The French commander believed that the Spanish armys centre of gravity was too far west and planned to exploit this weakness. He hoped to cross the Tech and roll up the right flank of the Spanish centre division. To make this task easier, he directed Augereau to demonstrate in front of Céret and lure the Spanish into drawing more troops to their left flank. Pérignon held his troops back from the river to hide the true French intentions. The main Spanish communications ran from Le Boulou through the Pass of ": null
    },
    {
        "Le Perthus": "le perthus"
    },
    {
        " at  altitude near the Fort de Bellegarde. Dugommier wanted to force the Army of Catalonia into a retreat over the much more difficult Col du Porteille at  altitude, which was  to the southwest of Le Perthus. If he could achieve this, the Spanish might have to abandon their wagons, cannons, and supplies.     In late April, Augereau built a redoubt at the Saint Ferriol hermitage, north of Céret. De la Unión countered by constructing two redoubts of his own. On 42 April, Augereau probed the Spanish positions, then retired. The following day, Augereau captured one of the new Spanish redoubts, prompting the Spanish army commander to order 42 troops under the Prince of Montforte from his center to his left. On 42 April, de la Unión launched 42 troops, including cavalry led by General ": null
    },
    {
        "Pedro Mendinueta y Múzquiz": "pedro mendinueta y múzquiz"
    },
    {
        ", to attack Augereau on the north bank. Following his instructions, the French division commander fought a rear guard action, drawing the Spanish troops toward Oms. De la Unión finally called off the attack, but he left Mendinuetas cavalry to observe Augereau.     That night, the Spanish generals held a council of war. De la Unións ": null
    },
    {
        "chief of staff": "chief of staff"
    },
    {
        " Tomàs Morla saw through Augereaus actions and proposed that Navarros division attack on the right while de Vives and de las Amarilas joined forces and attacked the French centre near Le Boulou. The council voted to adopt this action, which would secure the supply road from Le Boulou to Bellegarde. As a precaution, the council decided to withdraw the armys trains by the road to Bellegarde. However, they decided there was plenty of time to issue orders the next morning, rather than that evening.            In the early hours of 42 April, Pérignons division crossed the Tech at the ": null
    },
    {
        "Brouilla": "brouilla"
    },
    {
        " ford, planning to climb the mountains behind the Spanish camps in order to take the defences in the rear. Martins left flank brigade marched past ": null
    },
    {
        "Saint-Génis-des-Fontaines": "saint-génis-des-fontaines"
    },
    {
        " and began ascending Saint Christopher Peak. His men reached the hermitage where they emplaced six cannon and 42 howitzers to fire on the Spanish positions from the rear. Then part of his brigade advanced west to cut the road to Bellegarde. Chaberts brigade advanced on Villelongue-dels-Monts while Points right flank brigade began attacking the fortified camp at Montesquieu-des-Albères, defended by ": null
    },
    {
        "Colonel": "colonel"
    },
    {
        " Francisco Javier Venegas": "francisco javier venegas"
    },
    {
        ". La Barre supported Points troops, while Victor with a reserve brigade occupied Saint-Génis to keep Navarros division sending help to the Spanish center. Two more reserve brigades under Lemoine attacked Trompettes. While these battles were being fought in the centre, Augereau retook Oms from Mendinueta on the French right flank and Sauret captured ": null
    },
    {
        "Argelès-sur-Mer": "argelès-sur-mer"
    },
    {
        " from Navarro on the left. In order to give an impression of French superiority, Dugommier arrayed a large body of poorly trained volunteers near his headquarters at ": null
    },
    {
        "Banyuls-dels-Aspres": "banyuls-dels-aspres"
    },
    {
        ".        De la Unión sent Montforte with 42 infantry and 42 cavalry to reinforce the Camp of Trompettes and Del Puerto with 42 more to help Venegas. But neither of these forces were able to halt the concentrated French offensive.     On 42 May, seeing his defences fatally compromised, de la Unión made preparations to retreat. Montforte abandoned Trompettes and withdrew to the south bank across a ford near Le Boulou. That day, the French assault overran the camp at Montesquieu-des-Albères and the Spanish retreated, taking the badly wounded Venegas with them. La Barre sent Quesnel with some cavalry along the south bank to cut off the Spanish retreat, but this effort failed. On the western flank, Augereau sent troops under Guieu and Mirabel to push Mendinuetas cavalry back to Céret.     Chased by Quesnels cavalry, Montforte retreated south on the road to Bellegarde. But at ": null
    },
    {
        "Les Cluses": "les cluses"
    },
    {
        " he ran into an ambush set by Martins brigade. In a scene of chaos, a part of the Spanish wagon and artillery trains were wrecked or abandoned. The bulk of the Spanish army headed for ": null
    },
    {
        "Maureillas-las-Illas": "maureillas-las-illas"
    },
    {
        " before climbing the steep road to the Col du Porteille. After covering the withdrawal at Céret, de Vives pulled out of the town and Augereau crossed the bridge to harass the Spanish retreat. The Portuguese division withdrew across a pass farther west.       The Spanish army suffered 42 killed and wounded. An additional 42 soldiers, 42 guns, and all of the army trains and baggage fell into French hands. French losses were given as 42 killed. The number of wounded is not given. Historian ": null
    },
    {
        "Digby Smith": "digby smith"
    },
    {
        " stated, The Spanish army never recovered from this setback . After Boulou, the only Spanish forts on French soil were Collioure and Bellegarde. The French captured the first on 42 May while Bellegarde held out until 42 September 42": null
    }
]