[
    {
        "Secondary education covers two phases on the ": null
    },
    {
        "International Standard Classification of Education": "international standard classification of education"
    },
    {
        " scale. Level 2 or lower secondary education  is considered the second and final phase of ": null
    },
    {
        "basic education": "basic education"
    },
    {
        ", and level 3  secondary education is the stage before ": null
    },
    {
        "tertiary education": "tertiary education"
    },
    {
        ". Every country aims to provide basic education, but the systems and terminology remain unique to them. Secondary education typically takes place after six years of ": null
    },
    {
        "primary education": "primary education"
    },
    {
        " and is followed by ": null
    },
    {
        "higher education": "higher education"
    },
    {
        ", ": null
    },
    {
        "vocational education": "vocational education"
    },
    {
        " or employment. Like primary education, in most countries secondary education is ": null
    },
    {
        "compulsory": "compulsory education"
    },
    {
        ", at least until the age of 16. Children typically enter the lower secondary phase around age 11. Compulsory education sometimes extends to age 19.     Since 1989, education has been seen as a basic human right for a child; Article 28, of the ": null
    },
    {
        "Convention on the Rights of the Child": "convention on the rights of the child"
    },
    {
        " states that primary education should be free and compulsory while different forms of secondary education, including general and vocational education, should be available and accessible to every child. The terminology has proved difficult, and there was no universal definition before ISCED divided the period between primary education and university into junior secondary education and upper secondary education.     In classical and medieval times secondary education was provided by the church for the sons of nobility and to boys preparing for universities and the priesthood. As trade required navigational and scientific skills the church reluctantly expanded the curriculum and widened the intake. With the ": null
    },
    {
        "Reformation": "reformation"
    },
    {
        " the state wrestled the control of learning from the church, and with ": null
    },
    {
        "Comenius": "comenius"
    },
    {
        " and ": null
    },
    {
        "John Locke": "john locke"
    },
    {
        " education changed from being repetition of Latin text to building up knowledge in the child. Education was for the few. Up to the middle of the 19th century, secondary schools were organised to satisfy the needs of different social classes with the labouring classes getting 4 years, the merchant class 5 years and the elite getting 7 years. The rights to a secondary education were codified after 1945, and countries are still working to achieve the goal of mandatory and free secondary education for all youth under 19.            The 1997 ": null
    },
    {
        "International Standard Classification of Education": "international standard classification of education"
    },
    {
        " describes seven levels that can be used to compare education internationally. Within a country these can be implemented in different ways, with different age levels and local denominations. The seven levels are: ": null
    },
    {
        "Primary education": "primary education"
    },
    {
        " or first stage of basic education   Level 2 – Lower secondary or second stage of basic education   Level 3 – secondary education   Level 4 – Post-secondary non-tertiary education   Level 5 – First stage of tertiary education   Level 6 – Second stage of tertiary education     Within this system, Levels 1 and 2 – that is, primary education and lower secondary – together form  basic education . Beyond that, national governments may attach the label of secondary education to Levels 2 through 4 together, Levels 2 and 3 together, or Level 2 alone. These level definitions were put together for statistical purposes, and to allow the gathering of comparative data nationally and internationally. They were approved by the UNESCO General Conference at its 29th session in November 1997. Though they may be dated, they do provide a universal set of definitions and remain unchanged in the 2011 update.     The start of lower secondary education is characterised by the transition from the single-class-teacher, who delivers all content to a cohort of pupils, to one where content is delivered by a series of subject specialists. Its educational aim is to complete provision of basic education and to lay the foundations for lifelong learning.     Lower secondary education is likely to show these criteria:   entry after some 6 years of primary education   the requirement for more highly qualified teachers teaching only within their specialism   exit to Level 3 courses, or vocational education, or employment after 9 or more total years of education.     The end of lower secondary education often coincides with the end of compulsory education in countries where that exists.      secondary education starts on the completion of basic education, which also is defined as completion of lower secondary education. The educational focus is varied according to the students interests and future direction. Education at this level is usually voluntary.     secondary education is likely to show these criteria:   entry after some 9 years of basic education   typical age at entry is between 14 and 16 years   all teachers have level 5 qualifications in the subject they are teaching   exit to Level 4 or 5 courses or to direct employment.     More subjects may be dropped, and increased specialism occurs. Completion of secondary education provides the entry requirements to Level 5 tertiary education, the entry requirements to technical or vocational education , or direct entry into the workplace.     In 2012 the ": null
    },
    {
        "ISCED": "international standard classification of education"
    },
    {
        " published a further work on education levels where it codified particular paths and redefined the tertiary levels. Lower secondary education and secondary education could last between 2 and 5 years, and the transition between two often would be when students were allowed some subject choice.     Terminology for secondary schools varies by country, and the exact meaning of any of these varies. Secondary schools may also be called  academies ,  college s,  gymnasiums ,  high school s,  lyceum s,  middle schools ,  preparatory school s,  sixth-form college s,  upper school s, or  vocational school s, among other names. For further information about nomenclature, see the ": null
    },
    {
        "section below by country": "by country"
    },
    {
        ".          A form of education for adolescents became necessary in all ": null
    },
    {
        "societies that had an alphabet": "history of writing"
    },
    {
        " and engaged in commerce. In Western Europe, formal secondary education can be traced back to the ": null
    },
    {
        "Athenian educational reforms": "education in ancient greece"
    },
    {
        " of 320BC. Though their civilisation was eclipsed and they were enslaved, Hellenistic Athenian teachers were valued in the ": null
    },
    {
        "Roman system": "education in ancient greece"
    },
    {
        ". The Roman and Hellenistic schools of rhetoric taught the seven liberal arts and sciences – grammar, rhetoric, logic, arithmetic, geometry, music and astronomy – which were regarded as a preparation for the study at a tertiary level of theology, law and medicine. Boys would have been prepared to enter these schools by private tutors at home. Girls would have only received tuition at home.   When the Romans retreated, all traces of civilisation were erased.     England provides a good case study. When Augustine of Canterbury brought ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " there in 597, no schools existed. He needed trained priests to conduct church services and boys to sing in the choir. He had to create both the grammar schools that taught Latin, to enable the English to study for the priesthood, and song schools that trained the sons of gentlefolk to sing in cathedral choirs. In the case of ": null
    },
    {
        "Canterbury": "kings school, canterbury"
    },
    {
        " and ": null
    },
    {
        "Rochester": "kings school, rochester"
    },
    {
        " , both still exist. Bede in his ": null
    },
    {
        "Ecclesiastical history": "ecclesiastical history of the english people"
    },
    {
        " tells that the Canterbury school taught more than the intended reading and understanding of Latin, but the rules of metric, astronomy and the ": null
    },
    {
        "computus": "computus"
    },
    {
        " as well as the works of the saints Even at this stage,there was tension, as the church was worried that knowledge of Latin would give the student access to non-Christian texts that it would not wish them to read.     Over the centuries leading to the ": null
    },
    {
        "renaissance": "renaissance"
    },
    {
        " and ": null
    },
    {
        "reformation": "reformation"
    },
    {
        " the church was the main provider of secondary education. Various invasions and schisms within the controlling church challenged the focus of the schools, and the curriculum and language of instruction waxed and waned. From 1100, With the growth of the towns, grammar schools free of the church were founded, and some church grammar schools were handed over to the laïty. Universities were founded that didnt just train students for the priesthood.       Whereas in mainland Europe the ": null
    },
    {
        "renaissance": "renaissance"
    },
    {
        " preceded the ": null
    },
    {
        "reformation": "reformation"
    },
    {
        ", local conditions in England caused the reformation to come first. The reformation was about allowing the laïty to interpret the Bible in their own way without the intervention of priests, and preferably in the vernacular. This stimulated the foundation of free Grammar schools- who searched for a less constrained curriculum. ": null
    },
    {
        "Colonialisation": "colonialisation"
    },
    {
        " required navigation, mensuration, languages and administrative skills. The laïty wanted these taught to their sons. After ": null
    },
    {
        "Gutenberg": "gutenberg bible"
    },
    {
        "1455  had mastered moveable metal type printing and ": null
    },
    {
        "Tyndale": "tyndale bible"
    },
    {
        " had translated the Bible into English , . Latin became a skill reserved for the catholic church and sons conservative nobility. Schools started to be set up for the sons of merchants in Europe and the colonies too- for example ": null
    },
    {
        "Boston Latin Grammar School": "boston latin school"
    },
    {
        " .     ": null
    },
    {
        "Comenius": "comenius"
    },
    {
        " , Daniel Murphy, Comenius: A Critical Reassessment of his Life and Works , p. 8 and p. 43. a ": null
    },
    {
        "Moravian": "moravians"
    },
    {
        " protestant": "protestant"
    },
    {
        " proposed a new model of education- where ideas were developed from the familiar to the theoretical rather than through repetition, where languages were taught in the vernacular and supported universal education. In his Didactica Magna ,  he outlined a system of schools that is the exact counterpart of many western school systems: kindergarten, elementary school, secondary school, six-form college, university.    ": null
    },
    {
        "Lockes": "john locke"
    },
    {
        " Some Thoughts Concerning Education": "some thoughts concerning education"
    },
    {
        " stressed the importance of a broader intellectual training, moral development and physical hardening. .     The grammar schools of the period can be categorised in three groups: the nine leading schools, seven of them boarding institutions which maintained the traditional curriculum of the classics, and mostly served the aristocracy and the squirearchy ; most of the old endowed grammar schools serving a broad social base in their immediate localities which also stuck to the old curriculum; the grammar schools situated in the larger cities, serving the families of merchants and tradesmen who embraced change.       During the 18th century their social base widened and their curriculum developed, particularly in mathematics and the natural sciences. But this was not universal education and was self-selecting by wealth  The industrial revolution changed that. Industry required an educated workforce where all workers needed to have completed a basic education. In France, ": null
    },
    {
        "Louis XIV": "louis xiv"
    },
    {
        ", wrestled the control of education from the Jesuits, ": null
    },
    {
        "Condorcet": "marquis de condorcet"
    },
    {
        " set up ": null
    },
    {
        "Collèges": "collège"
    },
    {
        "for universal lower secondary education throughout the country, then Napoleon set up a regulated system of ": null
    },
    {
        "Lycee": "lycee"
    },
    {
        ".  In England, ": null
    },
    {
        "Robert Peels": "robert peel"
    },
    {
        " Factory Act of 1802": "factory act of 1802"
    },
    {
        " required an employer to provide instruction in reading, writing and arithmetic during at least the first four years of the seven years of apprenticeship. The state had accepted responsibility for the ": null
    },
    {
        "basic education": "basic education"
    },
    {
        " of the poor.   The provision of school places remained inadequate, so an Order in Council dated 10 April 1839 created the ": null
    },
    {
        "Committee of the Privy Council on Education": "privy council"
    },
    {
        ".       There was considerable opposition to the idea that children of all classes should receive basic education, all the initiatives such as ": null
    },
    {
        "industrial schools": "industrial school"
    },
    {
        "and ": null
    },
    {
        "Sunday schools": "sunday school"
    },
    {
        "were initially a private or church initiative. With the ": null
    },
    {
        "Great Exhibition of 1851": "great exhibition of 1851"
    },
    {
        ", it became clear just how far behind the English education system had fallen.      Three reports were commissioned to examine the education of upper, middle and labouring class children. The ": null
    },
    {
        "Clarendon Commission": "clarendon commission"
    },
    {
        " sought to improve the nine Great Public Schools. The ": null
    },
    {
        "Taunton Commission": "taunton commission"
    },
    {
        " looked at the 782 endowed grammar schools . They found varying quality and a patchy geographical coverage, with two thirds of all towns not having any secondary school. There was no clear conception of the purpose of secondary education. There were only thirteen girls schools and their tuition was superficial, unorganised and unscientific. They recommended a system of first-grade schools targeted at a leaving age of 18 as preparation for upper and upper-middle class boys entering university, second-grade targeted at a leaving age of 16 for boys preparing for the army or the newer professions, and third-grade targeted at a leaving age of 14 for boys of small tenant farmers, small tradesmen, and superior artisans. This resulted in the ": null
    },
    {
        "1869 Endowed Schools Act": "endowed schools act 1869"
    },
    {
        " which advocated that girls should enjoy the same education as boys.     The ": null
    },
    {
        "Newcastle Commission": "newcastle commission"
    },
    {
        " inquired into the state of public education in England and to consider and report what measures, if any, are required for the extension of sound and cheap elementary instruction to all classes of the people . It produced ": null
    },
    {
        "1861 Newcastle Report": "newcastle commission"
    },
    {
        " and this led to the ": null
    },
    {
        "1870 Elementary Education Act": "1870 elementary education act"
    },
    {
        " .     The school boards set up by the ": null
    },
    {
        "1870 Elementary Education Act": "1870 elementary education act"
    },
    {
        " and were stopped from providing secondary education by the ": null
    },
    {
        "Cockerton Judgement": "cockerton judgement"
    },
    {
        " of 1899. The school leaving age at this time was 10. The Judgement prompted the ": null
    },
    {
        "1902 Education Act": "1902 education act"
    },
    {
        " . Compulsory education was extended to 12. The new ": null
    },
    {
        "Local Education Authoritiess": "local education authority"
    },
    {
        "that were formed from the school boards; started to open ": null
    },
    {
        "Higher Grade Elementary Schools": "higher elementary school"
    },
    {
        " or county schools to supplement the endowed grammar schools. These LEAs were allowed to build second-grade secondary schools that in the main became the future ": null
    },
    {
        "secondary modern school": "secondary modern school"
    },
    {
        "s.      In the 1904 Regulations for Secondary Schools , the ": null
    },
    {
        "Board of Education": "board of education"
    },
    {
        " determined that secondary schools should offer a:   a four year subject-based course leading to a certificate in English language and literature, geography, history, a foreign language, mathematics, science, drawing, manual work, physical training, and, for girls, housewifery.      The ": null
    },
    {
        "Education Act 1918": "education act 1918"
    },
    {
        " extended ": null
    },
    {
        "compulsory full-time education to 14": "raising of school leaving age in england and walesthe fisher act of 1918"
    },
    {
        ", and recommended compulsory part-time education from 14–18.   The ": null
    },
    {
        "Hadlow report, Education the Adolescent ": "william henry hadow"
    },
    {
        " proposed that there should be a break point at eleven, establishing primary schools and secondary schools.     The ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        ", founded in 1947, was committed to education for all but the definition was difficult to formulate.   ": null
    },
    {
        "The Universal Declaration of Human Rights": "the universal declaration of human rights"
    },
    {
        " declared that elementary and fundamental education, which it didnt define, was a right to be enjoyed by all. The ": null
    },
    {
        "Education Act 1944": "education act 1944"
    },
    {
        " made sweeping changes to the funding of state education using the tripartite system, but wasnt allowed to tackle private schools. It introduced the GCE Olevel at 16, and the A at 18, but only raised the school leaving age until 15, making the exam inaccessible to the majority. But one year of ISCED Level 3 secondary education was mandatory and free.      In 1972 the school leaving was raised to 16. The ": null
    },
    {
        "Education and Skills Act 2008": "education and skills act 2008"
    },
    {
        ", when it came into force in the 2013 academic year, initially required participation in some form of education or training until the school year in which the child turned 17, followed by the age being raised to the young persons 18th birthday in 2015.  HMSO, 24 August 2012 This was referred to as raising the participation age  HMSO, 29 July 2013 to distinguish it from the school leaving age which remains at 16.  HMSO, 19 November 2014 Thus the UK is following the ISCED Level 3 secondary education guideline.            The ": null
    },
    {
        "United Nations": "united nations"
    },
    {
        " was strong in its commitment to education for all but fell into linguistic difficulty defining that right.     “Article I: Purposes and functions   1. The purpose of the Organization is to contribute to peace and security by promoting collaboration among the nations through education, science and culture in order to further universal respect for justice, for the rule of law and for the human rights and fundamental freedoms which are affirmed for the peoples of the world, without distinction of race, sex, language or religion, by the ": null
    },
    {
        "Charter of the United Nations": "charter of the united nations"
    },
    {
        ".”     ": null
    },
    {
        "The Universal Declaration of Human Rights": "the universal declaration of human rights"
    },
    {
        " declared that elementary and fundamental education was a right to be enjoyed by all, but again could not define either elementary and fundamental education.   Article 26 : Everyone has the right to education. Education shall be free, at least in the elementary and fundamental stages. Elementary education shall be compulsory. Technical and professional education shall be made generally available and higher education shall be equally accessible to all on the basis of merit.   It was assumed that elementary education was ": null
    },
    {
        "basic education": "basic education"
    },
    {
        ", the entitlement for children- and fundamental education was a right for the working man, but for a lawyer the definition is neither qualitative or quantitative saying when it starts and when it is completed. The term secondary is not defined or mentioned. Together this has enabled countries to terminate free, compulsory, basic education at 11 or only continue education past eleven to boys.     Article 28, of the ": null
    },
    {
        "Convention on the Rights of the Child": "convention on the rights of the child"
    },
    {
        " stated that primary education should be free and compulsory while different forms of secondary education, including general and vocational education, should be available and accessible to every   child. Free education should be provided and financial assistance offered in case of need.    In 1990, at Jomtien again tried to define the content basic education and how it should be delivered. ‘Basic education’ is defined as ‘action designed to meet ‘basic learning needs’. ‘primary schooling’ is considered as ‘the main delivery system of basic education’.    Which is explained in Principals for Action that:   addressing the basic learning needs of all means: early childhood care and development opportunities; relevant, quality primary schooling or equivalent out-of-school education for children; and literacy, basic knowledge and life skills training for youth and adults.’      The assumption being made that basic knowledge and life skills training for youth was the function of secondary education. This was codified by the ": null
    },
    {
        "ISCED": "isced"
    },
    {
        " documents.  ": null
    },
    {
        "The Dakar Framework for Action": "dakar framework for action"
    },
    {
        " 2010 goal 2 states: Ensuring that by 2015 all children, particularly girls, children in difficult circumstances and those belonging to ethnic minorities, have access to and complete free and compulsory education of good quality. The Dakar Framework for Action 2010 goal 5 states: Eliminating gender disparities in primary and secondary education by 2005, and achieving gender equality in education by 2015, with a focus on ensuring girls’ full and equal access to and achievement in basic education of good quality.      ": null
    },
    {
        "Malala Yousafzai": "malala yousafzai"
    },
    {
        ", ": null
    },
    {
        "Nobel Peace Prize": "nobel peace prize"
    },
    {
        " winner in a said in a 2017 interview that:   “My goal is to make sure every child, girl and boy, they get the opportunity to go to school. “It is their basic human right, so I will be working on that and I will never stop until I see the last child going to school.”          UNESCO believes that in order to prepare young people for life and work in a rapidly changing world, secondary-level education systems need to be re-oriented to impart a broad repertoire of life-skills. These skills should include the key generic competencies, non occupation-specific practical capabilities, ICT, the ability to learn independently, to work in teams, entrepreneurship and civic responsibility.     They may be best instilled through a shared foundational learning period and by deferring the directing of students into academic and vocational streams for as long as possible, and then there should be flexibility to ensure the free movement of students between the streams depending on their aptitudes and inclinations. Accreditation in one stream should have equal recognition in the other as well as for access to higher education. This will equip young people with multiple skills so that they are prepared to enter and re-enter the workforce several times in their working lives, as wage employees or self-employed entrepreneurs, and to re-train themselves when their skills become obsolete.     It recognizes that there is no single model that will suit all countries, or even all communities in a given country. Secondary-level education policy should be under continuous review to keep in step with scientific and technological, economic and societal change.            Each country has developed the form of education most appropriate for them. There is an attempt to compare the effectiveness by using the results from the ": null
    },
    {
        "PISA": "programme for international student assessment"
    },
    {
        " that, each third year, assesses the scholastic performance on mathematics, science, and reading of a representative sample of 5000 fifteen year olds from each country.      ": null
    }
]