[
    {
        "         The    is a ": null
    },
    {
        "32-bit": "32-bit"
    },
    {
        " fifth-generation": "history of video game consoles"
    },
    {
        " home video game console": "home video game console"
    },
    {
        " developed by ": null
    },
    {
        "Sega": "sega"
    },
    {
        " and released on November 22, 1994 in ": null
    },
    {
        "Japan": "japan"
    },
    {
        ", May 11, 1995 in ": null
    },
    {
        "North America": "north america"
    },
    {
        ", and July 8, 1995 in ": null
    },
    {
        "Europe": "europe"
    },
    {
        ". The successor to the successful ": null
    },
    {
        "Sega Genesis": "sega genesis"
    },
    {
        ", the Saturn has a dual-": null
    },
    {
        "CPU": "central processing unit"
    },
    {
        " architecture and eight processors. Its games are in ": null
    },
    {
        "CD-ROM": "cd-rom"
    },
    {
        " format, and its game library contains several ": null
    },
    {
        "arcade": "arcade game"
    },
    {
        " ports": "porting"
    },
    {
        " as well as original games.     Development of the Saturn began in 1992, the same year Segas groundbreaking ": null
    },
    {
        "3D": "3d computer graphics"
    },
    {
        " Model 1": "sega model 1"
    },
    {
        " arcade hardware": "arcade system board"
    },
    {
        " debuted. The system was designed around a new CPU from Japanese electronics company ": null
    },
    {
        "Hitachi": "hitachi"
    },
    {
        ". Sega added another video display processor in early 1994 to better compete with ": null
    },
    {
        "Sonys": "sony"
    },
    {
        "forthcoming ": null
    },
    {
        "PlayStation": "playstation"
    },
    {
        ".     The Saturn was initially successful in Japan, but failed to sell in large numbers in the United States after its surprise May 1995 launch, four months before its scheduled release date. After the debut of the ": null
    },
    {
        "Nintendo 64": "nintendo 64"
    },
    {
        " in late 1996, the Saturn rapidly lost market share in the U.S., where it was discontinued in 1998. Having sold 9.26 million units worldwide, the Saturn is considered a ": null
    },
    {
        "commercial failure": "list of commercial failures in video gaming"
    },
    {
        ". The failure of Segas development teams to release a game in the  Sonic the Hedgehog  series, known in development as  Sonic X-treme , has been considered a factor in the consoles poor performance.     Although the Saturn is remembered for several well-regarded games, including  Nights into Dreams , the  Panzer Dragoon  series, and the  Virtua Fighter  series, its reputation is mixed due to its complex hardware design and limited ": null
    },
    {
        "third-party": "third-party developer"
    },
    {
        " support. Segas management has been criticized for its decisions during the systems development and discontinuation.           Released in 1988, the ": null
    },
    {
        "Genesis": "sega genesis"
    },
    {
        " was Segas entry into the ": null
    },
    {
        "fourth generation": "history of video game consoles"
    },
    {
        " of video game consoles.  In mid-1990, Sega CEO ": null
    },
    {
        "Hayao Nakayama": "hayao nakayama"
    },
    {
        " hired ": null
    },
    {
        "Tom Kalinske": "tom kalinske"
    },
    {
        " as president and CEO of Sega of America. Kalinske developed a four-point plan for sales of the Genesis: lower the price of the console, create a U.S.-based team to develop games targeted at the American market, continue aggressive advertising campaigns, and sell  Sonic the Hedgehog  with the console. The Japanese board of directors initially disapproved of the plan, but all four points were approved by Nakayama, who told Kalinske, I hired you to make the decisions for Europe and the Americas, so go ahead and do it. Magazines praised Sonic as one of the greatest games ever made, and Segas console finally took off as customers who had been waiting for the ": null
    },
    {
        "Super Nintendo Entertainment System": "super nintendo entertainment system"
    },
    {
        " decided to purchase a Genesis instead. However, the release of a CD-based ": null
    },
    {
        "add-on": "video game accessory"
    },
    {
        " for the Genesis, the ": null
    },
    {
        "Sega CD": "sega cd"
    },
    {
        " , was commercially disappointing.       Sega also experienced success with ": null
    },
    {
        "arcade game": "arcade game"
    },
    {
        "s. In 1992 and 1993, the new ": null
    },
    {
        "Sega Model 1": "sega model 1sega model 1"
    },
    {
        " arcade system board showcased ": null
    },
    {
        "Sega AM2s": "sega am2"
    },
    {
        "  Virtua Racing  and  Virtua Fighter  , which played a crucial role in popularizing 3D polygonal graphics.  cf.  cf.    In particular, Virtua Fighter garnered praise for its simple three-button control scheme, with strategy coming from the intuitively observed differences between characters that felt and acted differently rather than the more ornate ": null
    },
    {
        "combos": "combo"
    },
    {
        " of ": null
    },
    {
        "two-dimensional": "2d computer graphics"
    },
    {
        " competitors. Despite its crude visuals—with characters composed of fewer than 1,200 polygons—Virtua Fighter s fluid animation and relatively realistic depiction of distinct fighting styles gave its combatants a lifelike presence considered impossible to replicate with ": null
    },
    {
        "sprites": "sprite"
    },
    {
        ". The Model 1 was an expensive system board, and bringing home releases of its games to the Genesis required more than its hardware could handle. Several alternatives helped to bring Segas newest arcade games to the console, such as the ": null
    },
    {
        "Sega Virtua Processor": "sega genesissega virtua processor"
    },
    {
        " chip used for Virtua Racing, and eventually the ": null
    },
    {
        "Sega 32X": "sega 32x"
    },
    {
        " add-on.       Development of the Saturn was supervised by Hideki Sato, Segas director and deputy general manager of ": null
    },
    {
        "research and development": "research and development"
    },
    {
        ". According to Sega project manager Hideki Okamura, the Saturn project started over two years before the system was showcased at the Tokyo Toy Show in June 1994. The name Saturn was the systems codename during development in Japan, but was chosen as the official product name.   Computer Gaming World  in March 1994 reported a rumor that the Sega Saturn ... will release in Japan before the end of the year for $250–300.          In 1993, Sega and Japanese electronics company ": null
    },
    {
        "Hitachi": "hitachi"
    },
    {
        " formed a joint venture to develop a new CPU for the Saturn, which resulted in the creation of the SuperH ": null
    },
    {
        "RISC": "reduced instruction set computing"
    },
    {
        " Engine  later that year.  cf.  The Saturn was designed around a dual-SH2 configuration. According to Kazuhiro Hamada, Segas section chief for Saturn development during the systems conception, the SH-2 was chosen for reasons of cost and efficiency. The chip has a calculation system similar to a ": null
    },
    {
        "DSP": "digital signal processor"
    },
    {
        " but we realized that a single CPU would not be enough to calculate a 3D world.  Although the Saturns design was largely finished before the end of 1993, reports in early 1994 of the technical capabilities of ": null
    },
    {
        "Sonys": "sony"
    },
    {
        "upcoming ": null
    },
    {
        "PlayStation": "playstation"
    },
    {
        " console prompted Sega to include another video display processor to improve the systems 2D performance and texture-mapping.  CD-ROM-based and cartridge-only versions of the Saturn hardware were considered for simultaneous release during the systems development, but this idea was discarded due to concerns over the lower quality and higher price of cartridge-based games.     According to Kalinske, Sega of America fought against the architecture of Saturn for quite some time . Seeking an alternative graphics chip for the Saturn, Kalinske attempted to broker a deal with ": null
    },
    {
        "Silicon Graphics": "silicon graphics"
    },
    {
        ", but Sega of Japan rejected the proposal.    Silicon Graphics subsequently collaborated with Nintendo on the ": null
    },
    {
        "Nintendo 64": "nintendo 64"
    },
    {
        ".  Kalinske, Sony Electronic Publishings ": null
    },
    {
        "Olaf Olafsson": "ólafur jóhann ólafsson"
    },
    {
        ", and Sony Americas Micky Schulhof had discussed development of a joint Sega/Sony hardware system , which never came to fruition due to Segas desire to create hardware that could accommodate both 2D and 3D visuals and Sonys competing notion of focusing on 3D technology.   Publicly, Kalinske defended the Saturns design: Our people feel that they need the multiprocessing to be able to bring to the home what were doing next year in the arcades.      In 1993, Sega restructured its internal studios in preparation for the Saturns launch. To ensure high-quality 3D games would be available early in the Saturns life, and to create a more energetic working environment, developers from Segas arcade division were asked to create console games. New teams, such as  Panzer Dragoon  developer ": null
    },
    {
        "Team Andromeda": "team andromeda"
    },
    {
        ", were formed during this time.      In January 1994, Sega began to develop an add-on for the Genesis, the Sega 32X, which would serve as a less expensive entry into the ": null
    },
    {
        "32-bit era": "history of video game consoles"
    },
    {
        ". The decision to create the add-on was made by Nakayama and widely supported by Sega of America employees. According to former Sega of America producer Scot Bayless, Nakayama was worried that the Saturn would not be available until after 1994 and that the recently released ": null
    },
    {
        "Atari Jaguar": "atari jaguar"
    },
    {
        " would reduce Segas hardware sales. As a result, Nakayama ordered his engineers to have the system ready for launch by the end of the year. The 32X would not be compatible with the Saturn, but Sega executive Richard Brudvik-Lindner pointed out that the 32X would play Genesis games, and had the same system architecture as the Saturn. This was justified by Segas statement that both platforms would run at the same time, and that the 32X would be aimed at players who could not afford the more expensive Saturn.  According to Sega of America research and development head Joe Miller, the 32X served a role in assisting development teams to familiarize themselves with the dual SH-2 architecture also used in the Saturn.  Because both machines shared many of the same parts and were preparing to launch around the same time, tensions emerged between Sega of America and Sega of Japan when the Saturn was given priority.          Sega released the Saturn in Japan on November 22, 1994, at a price of ": null
    },
    {
        "¥": "japanese yen"
    },
    {
        "44,800.  Virtua Fighter, a faithful port of the popular arcade game, sold at a nearly one-to-one ratio with the Saturn console at launch and was crucial to the systems early success in Japan.  Though Sega had wanted to launch with  Clockwork Knight  and Panzer Dragoon,  the only other first-party game available at launch was Wan Chai Connection.  Fueled by the popularity of Virtua Fighter, Segas initial shipment of 200,000 Saturn units sold out on the first day.   Sega waited until the December 3 launch of the PlayStation to ship more units; when both were sold side-by-side, the Saturn proved more popular.      Meanwhile, Sega released the 32X on November 21, 1994 in North America, December 3, 1994 in Japan, and January 1995 in PAL territories, and was sold at less than half of the Saturns launch price.   After the holiday season, however, interest in the 32X rapidly declined. 500,000 Saturn units were sold in Japan by the end of 1994 ,  and sales exceeded 1 million within the following six months.  There were conflicting reports that the PlayStation enjoyed a higher ": null
    },
    {
        "sell-through": "sell-through"
    },
    {
        " rate, and the system gradually began to overtake the Saturn in sales during 1995.  Sony attracted many third-party developers to the PlayStation with a liberal $10 licensing fee, excellent development tools, and the introduction of a 7- to 10-day order system that allowed publishers to meet ": null
    },
    {
        "demand": "demand"
    },
    {
        " more efficiently than the 10- to 12-week ": null
    },
    {
        "lead times": "lead time"
    },
    {
        "for cartridges that had previously been standard in the Japanese video game industry.      In March 1995, Sega of America CEO Tom Kalinske announced that the Saturn would be released in the U.S. on Saturnday September 2, 1995.  However, Sega of Japan mandated an early launch to give the Saturn an advantage over the PlayStation. At the first ": null
    },
    {
        "Electronic Entertainment Expo": "electronic entertainment expo"
    },
    {
        " in Los Angeles on May 11, 1995, Kalinske gave a keynote presentation in which he revealed the release price of ": null
    },
    {
        "US$": "united states dollar"
    },
    {
        "399 , and described the features of the console. Kalinske also revealed that, due to high consumer demand ,  Sega had already shipped 30,000 Saturns to ": null
    },
    {
        "Toys R Us": "toys   r   us"
    },
    {
        ", ": null
    },
    {
        "Babbages": "babbages"
    },
    {
        ", ": null
    },
    {
        "Electronics Boutique": "electronics boutique"
    },
    {
        ", and ": null
    },
    {
        "Software Etc.": "software etc."
    },
    {
        " for immediate release. The announcement upset retailers who were not informed of the surprise release, including ": null
    },
    {
        "Best Buy": "best buy"
    },
    {
        " and ": null
    },
    {
        "Walmart": "walmart"
    },
    {
        "; cf.  ": null
    },
    {
        "KB Toys": "kb toys"
    },
    {
        " responded by dropping Sega from its lineup. Sony subsequently unveiled the retail price for the PlayStation: Olaf Olafsson, the head of the Sony Computer Entertainment America , summoned Steve Race to the stage, who said $299 , and then walked away to applause.    The Saturns release in Europe also came before the previously announced North American date, on July 8, 1995, at a price of ": null
    },
    {
        "£": "pound sterling"
    },
    {
        "399.99. European retailers and press did not have time to promote the system or its games, harming sales.  The PlayStation launched in Europe on September 29, 1995; by November, it had already outsold the Saturn by a factor of three in the United Kingdom, where Sony had allocated £20 million of marketing during the holiday season compared to Segas £4 million.       The Saturns U.S. launch was accompanied by a reported $50 million advertising campaign that included coverage in publications such as  Wired  and  Playboy .  Early advertising for the system was targeted at a more mature, adult audience than the Sega Genesis ads.   Because of the early launch, the Saturn had only six games available to start as most third-party games were slated to be released around the original launch date.    Virtua Fighter s relative lack of popularity in the West, combined with a release schedule of only two games between the surprise launch and September 1995, prevented Sega from capitalizing on the Saturns early timing.  Within two days of its September 9, 1995 launch in North America, the PlayStation  sold more units than the Saturn had in the five months following its surprise launch, with almost all of the initial shipment of 100,000 units being sold in advance, and the rest selling out across the U.S.      A high-quality port of the ": null
    },
    {
        "Namco": "namco"
    },
    {
        " arcade game  Ridge Racer  contributed to the PlayStations early success,  and garnered favorable media in comparison to the Saturn version of Segas  Daytona USA , which was considered inferior to its arcade counterpart.  cf.  cf.   Namco, a longtime arcade competitor with Sega,  also unveiled the ": null
    },
    {
        "Namco System 11": "namco system 11"
    },
    {
        " arcade board, based on raw PlayStation hardware.  Although the System 11 was technically inferior to Segas ": null
    },
    {
        "Model 2": "sega model 2"
    },
    {
        " arcade board, its lower price made it attractive to smaller arcades. Following a 1994 acquisition of Sega developers, Namco released  Tekken  for the System 11 and PlayStation. Directed by former Virtua Fighter designer ": null
    },
    {
        "Seiichi Ishii": "seiichi ishii"
    },
    {
        ", Tekken was intended to be fundamentally similar, with the addition of detailed textures and twice the ": null
    },
    {
        "frame rate": "frame rate"
    },
    {
        ".    Tekken surpassed Virtua Fighter in popularity due to its superior graphics and nearly arcade-perfect console port, becoming the first million-selling PlayStation game.  cf.      On October 2, 1995 Sega announced a Saturn price reduction to $299.  High-quality Saturn ports of the Sega Model 2 arcade hits  Sega Rally Championship , cf.  cf.   Virtua Cop , cf.  cf.  and  Virtua Fighter 2   cf.  cf.  were available by the end of the year, and were generally regarded as superior to competitors on the PlayStation.  Notwithstanding a subsequent increase in Saturn sales during the 1995 holiday season, the games were not enough to reverse the PlayStations decisive lead. By 1996, the PlayStation had a considerably larger library than the Saturn, although Sega hoped to generate interest with upcoming exclusives such as  Nights into Dreams . An informal survey of retailers showed that the Saturn and PlayStation sold in roughly equal numbers during the first quarter of 1996.  Within its first year, the PlayStation secured over 20% of the entire U.S. video game market. On the first day of the May 1996 E3 show, Sony announced a PlayStation price reduction to $199, a reaction to the release of the Model 2 Saturn in Japan at a price roughly equivalent to $199.  On the second day, Sega announced it would match this price, though Saturn hardware was more expensive to manufacture.             Despite the launch of the PlayStation and Saturn, sales of 16-bit games and consoles continued to account for 64% of the video game market in 1995.  Sega underestimated the continued popularity of the Genesis, and did not have the inventory to meet demand.  Sega was able to capture 43% of the dollar share of the U.S. video game market and sell more than 2 million Genesis units in 1995, but Kalinske estimated that we could have sold another 300,000 Genesis systems in the November/December timeframe.  Nakayamas decision to focus on the Saturn over the Genesis, based on the systems relative performance in Japan, has been cited as the major contributing factor in this miscalculation.     Due to long-standing disagreements with Sega of Japan, Kalinske lost most of his interest in his work as CEO of Sega of America. By the spring of 1996, rumors were circulating that Kalinske planned to leave Sega, and a July 13 article in the press reported speculation that Sega of Japan was planning significant changes to Sega of Americas management team.  On July 16, 1996, Sega announced that ": null
    },
    {
        "Shoichiro Irimajiri": "shoichiro irimajiri"
    },
    {
        " had been appointed chairman and CEO of Sega of America, while Kalinske would be leaving Sega after September 30 of that year.  A former ": null
    },
    {
        "Honda": "honda"
    },
    {
        " executive,   Irimajiri had been actively involved with Sega of America since joining Sega in 1993.  Sega also announced that ": null
    },
    {
        "David Rosen": "david rosen"
    },
    {
        " and Nakayama had resigned from their positions as chairman and co-chairman of Sega of America, though both men remained with the company.  ": null
    },
    {
        "Bernie Stolar": "bernie stolar"
    },
    {
        ", a former executive at Sony Computer Entertainment of America,  was named Sega of Americas executive vice president in charge of product development and third-party relations.    Stolar, who had arranged a six-month PlayStation exclusivity deal for  Mortal Kombat 3  and helped build close relations with ": null
    },
    {
        "Electronic Arts": "electronic arts"
    },
    {
        " while at Sony, was perceived as a major asset by Sega officials. Finally, Sega of America made plans to expand its PC software business.      Stolar was not supportive of the Saturn due to his belief that the hardware was poorly designed, and publicly announced at E3 1997 that The Saturn is not our future. While Stolar had no interest in lying to people about the Saturns prospects, he continued to emphasize quality games for the system, and subsequently reflected that we tried to wind it down as cleanly as we could for the consumer.  At Sony, Stolar opposed the localization of certain Japanese PlayStation games that he felt would not represent the system well in North America, and advocated a similar policy for the Saturn during his time at Sega, although he later sought to distance himself from this perception.   These changes were accompanied by a softer image that Sega was beginning to portray in its advertising, including removing the Sega! scream and holding press events for the education industry. Marketing for the Saturn in Japan also changed with the introduction of ": null
    },
    {
        "Segata Sanshiro": "segata sanshiro"
    },
    {
        "  as a character in a series of TV advertisements starting in 1997; the character would eventually star in a Saturn video game.       Temporarily abandoning arcade development, Sega AM2 head ": null
    },
    {
        "Yu Suzuki": "yu suzuki"
    },
    {
        " began developing several Saturn-exclusive games, including a ": null
    },
    {
        "role-playing game": "role-playing game"
    },
    {
        " in the Virtua Fighter series.  Initially conceived as an obscure prototype The Old Man and the Peach Tree and intended to address the flaws of contemporary Japanese RPGs , Virtua Fighter RPG evolved into a planned 11-part, 45-hour revenge epic in the tradition of ": null
    },
    {
        "Chinese cinema": "cinema of china"
    },
    {
        " , which Suzuki hoped would become the Saturns ": null
    },
    {
        "killer app": "killer app"
    },
    {
        ".   The game was eventually released as  Shenmue  for the Saturns successor, the ": null
    },
    {
        "Dreamcast": "dreamcast"
    },
    {
        ".       Sonic X-treme      As ": null
    },
    {
        "Sonic Team": "sonic team"
    },
    {
        " was working on Nights into Dreams, Sega tasked the U.S.-based ": null
    },
    {
        "Sega Technical Institute": "sega technical institute"
    },
    {
        " with developing what would have been the first fully 3D entry in its popular  Sonic the Hedgehog  series. The game,  Sonic X-treme , was moved to the Saturn after several prototypes for other hardware were discarded.    It featured a ": null
    },
    {
        "fisheye lens": "fisheye lens"
    },
    {
        " camera system that rotated levels with ": null
    },
    {
        "Sonics": "sonic the hedgehog"
    },
    {
        "movement. After Nakayama ordered the game be reworked around the ": null
    },
    {
        "engine": "game engine"
    },
    {
        " created for its boss battles, the developers were forced to work between 16 and 20 hours a day to meet their December 1996 deadline. Weeks of development time proved fruitless after Stolar rescinded STIs access to Sonic Teams Nights into Dreams engine following an ultimatum by Nights programmer ": null
    },
    {
        "Yuji Naka": "yuji naka"
    },
    {
        ".  After programmer Ofer Alon quit and designers ": null
    },
    {
        "Chris Senn": "chris senn"
    },
    {
        " and Chris Coffin became ill, the project was cancelled in early 1997. Sonic Team started work on an original 3D Sonic game for the Saturn, but development was shifted to the Dreamcast and the game became  Sonic Adventure .   STI was disbanded in 1996 as a result of changes in management at Sega of America.     Journalists and fans have speculated about the impact a completed X-treme might have had on the market. David Houghton of ": null
    },
    {
        "GamesRadar": "gamesradar"
    },
    {
        " described the prospect of a good 3D Sonic game on the Saturn as a What if... situation on a par with the dinosaurs not becoming extinct. ": null
    },
    {
        "IGNs": "ign"
    },
    {
        "Tavis Fahs called X-treme the turning point not only for Segas mascot and their 32-bit console, but for the entire company , but noted that the game served as an empty vessel for Segas ambitions and the hopes of their fans . Dave Zdyrko, who operated a prominent Saturn fan website during the systems lifespan, said: I dont know if X-treme couldve saved the Saturn, but  ... Sonic helped make the Genesis and it made absolutely no sense why there wasnt a great new Sonic title ready at or near the launch of the . In a 2007 retrospective, producer Mike Wallis maintained that X-treme definitely would have been competitive with Nintendos  Super Mario 64 . By contrast,  Next Generation  reported in late 1996 that X-treme did not compare well to contemporary competition, and would have harmed Segas reputation had it been completed.  Naka said he had been relieved by the cancellation, feeling that the game was not promising.       From 1993 to early 1996, although Segas revenue declined as part of an industry-wide slowdown,   the company retained control of 38% of the U.S. video game market . 800,000 PlayStation units were sold in the U.S. by the end of 1995, compared to 400,000 Saturn units.  In part due to an aggressive ": null
    },
    {
        "price war": "price war"
    },
    {
        ", the PlayStation outsold the Saturn by two-to-one in 1996, while Segas 16-bit sales declined markedly. By the end of 1996, the PlayStation had sold 2.9 million units in the U.S., more than twice the 1.2 million Saturn units sold.  The Christmas 1996 Three Free pack, which bundled the Saturn with Daytona USA, Virtua Fighter 2, and Virtua Cop, drove sales dramatically and ensured the Saturn remained a competitor into 1997.      However, the Saturn failed to take the lead. After the launch of the Nintendo 64 in 1996, sales of the Saturn and its games were sharply reduced, while the PlayStation outsold the Saturn by three-to-one in the U.S. in 1997. The 1997 release of  Final Fantasy VII  significantly increased the PlayStations popularity in Japan.   As of August 1997, Sony controlled 47% of the console market, Nintendo 40%, and Sega only 12%. Neither price cuts nor high-profile game releases proved helpful. Reflecting decreased demand for the system, worldwide Saturn shipments during March to September 1997 declined from 2.35 million to 600,000 versus the same period in 1996; shipments in North America declined from 800,000 to 50,000.  Due to the Saturns poor performance in North America, 60 of Sega of Americas 200 employees were laid off in the fall of 1997.          As a result of Segas deteriorating financial situation, Nakayama resigned as president in January 1998 in favor of Irimajiri. Stolar subsequently acceded to president of Sega of America.  Following five years of generally declining profits, in the fiscal year ending March 31, 1998 Sega suffered its first parent and consolidated financial losses since its 1988 listing on the ": null
    },
    {
        "Tokyo Stock Exchange": "tokyo stock exchange"
    },
    {
        ".  Due to a 54.8% decline in consumer product sales , the company reported a net loss of ¥43.3 billion and a consolidated net loss of ¥35.6 billion .      Shortly before announcing its financial losses, Sega announced that it was discontinuing the Saturn in North America to prepare for the launch of its successor.  Only 12 Saturn games were released in North America in 1998 , compared to 119 in 1996.  The Saturn would last longer in Japan and Europe. Rumors about the upcoming Dreamcast—spread mainly by Sega itself—were leaked to the public before the last Saturn games were released. The Dreamcast was released on November 27, 1998 in Japan and on September 9, 1999 in North America. The decision to abandon the Saturn effectively left the Western market without Sega games for over one year.  Sega suffered an additional ¥42.881 billion consolidated net loss in the fiscal year ending March 1999, and announced plans to eliminate 1,000 jobs, nearly a quarter of its workforce.       Worldwide Saturn sales include at least the following amounts in each territory: 5.75 million in Japan , 1.8 million in the United States, 1 million in Europe, and 530,000 elsewhere.  With lifetime sales of 9.26 million units,  the Saturn is considered a ": null
    },
    {
        "commercial failure": "list of commercial failures in video gaming"
    },
    {
        ",  although its install base in Japan surpassed the Nintendo 64s 5.54 million.  Lack of distribution has been cited as a significant factor contributing to the Saturns failure, as the systems surprise launch damaged Segas reputation with key retailers. Conversely, Nintendos long delay in releasing a 3D console and damage caused to Segas reputation by poorly supported add-ons for the Genesis are considered major factors allowing Sony to gain a foothold in the market.           Featuring a total of eight processors  the Saturns main ": null
    },
    {
        "central processing units": "central processing unit"
    },
    {
        "are two Hitachi SH-2 ": null
    },
    {
        "microprocessors": "microprocessor"
    },
    {
        " clocked": "clock rate"
    },
    {
        " at 28.6  ": null
    },
    {
        "MHz": "hertz"
    },
    {
        " and capable of 56 ": null
    },
    {
        "MIPS": "instructions per second"
    },
    {
        ". It contains a ": null
    },
    {
        "Motorola 68EC000": "motorola 68000"
    },
    {
        " running at 11.3  MHz as a sound controller; a custom ": null
    },
    {
        "sound processor": "sound chip"
    },
    {
        " with an integrated Yamaha FH1  DSP running at 22.6  MHz  capable of up to 32 sound channels with both ": null
    },
    {
        "FM synthesis": "frequency modulation synthesis"
    },
    {
        " and ": null
    },
    {
        "16-bit": "audio bit depth"
    },
    {
        " PCM": "pulse-code modulation"
    },
    {
        " sampling": "sampling"
    },
    {
        " at a maximum ": null
    },
    {
        "rate": "sampling rate"
    },
    {
        " of ": null
    },
    {
        "44.1  kHz": "44,100 hz"
    },
    {
        "; and two ": null
    },
    {
        "video display processors": "graphics processing unit"
    },
    {
        ",  the VDP1  and the VDP2 . Its double-speed ": null
    },
    {
        "CD-ROM drive": "optical disc drive"
    },
    {
        " is controlled by a dedicated ": null
    },
    {
        "Hitachi SH-1": "superh"
    },
    {
        " processor to reduce load times.  The System Control Unit , which controls all ": null
    },
    {
        "buses": "bus"
    },
    {
        " and functions as a co-processor of the main SH-2 CPU, has an internal DSP running at 14.3  MHz. The Saturn contains a cartridge slot for memory expansion, 16 ": null
    },
    {
        "Mbit": "megabit"
    },
    {
        " of work ": null
    },
    {
        "random-access memory": "random-access memory"
    },
    {
        " , 12 Mbit of ": null
    },
    {
        "video RAM": "vram"
    },
    {
        ", 4 Mbit of RAM for sound functions, 4 Mbit of CD ": null
    },
    {
        "buffer": "data buffer"
    },
    {
        " RAM and 256 ": null
    },
    {
        "Kbit": "kilobit"
    },
    {
        " of ": null
    },
    {
        "battery backup": "saved game"
    },
    {
        " RAM.  Its video output, provided by a ": null
    },
    {
        "stereo AV cable": "rca connector"
    },
    {
        ", displays at ": null
    },
    {
        "resolutions": "display resolution"
    },
    {
        " from 320×224 to 704×224 ": null
    },
    {
        "pixel": "pixel"
    },
    {
        "s,  and can display up to ": null
    },
    {
        "16.77 million": "color depthtrue color"
    },
    {
        " colors": "list of color palettes"
    },
    {
        " simultaneously. The Saturn measures . It was sold packaged with an instruction manual, one control pad, a stereo AV cable, and its 100 V AC power supply, with a power consumption of approximately 15W.          The Saturn had technically impressive hardware at the time of its release, but its complexity made harnessing this power difficult for developers accustomed to conventional programming. The greatest disadvantage was that both CPUs shared the same bus and were unable to access system memory at the same time. Making full use of the 4  kB of ": null
    },
    {
        "cache memory": "cpu cache"
    },
    {
        " in each CPU was critical to maintaining performance. For example, Virtua Fighter used one CPU for each character, while Nights used one CPU for 3D environments and the other for 2D objects. The Visual Display Processor 2 , which can generate and manipulate backgrounds,  has also been cited as one of the systems most important features.      The Saturns design elicited mixed commentary among game developers and journalists. Developers quoted by Next Generation in December 1995 described the Saturn as a real coders machine for those who love to get their teeth into assembly and really hack the hardware , with more flexibility and more calculating power than the PlayStation . The sound board was also widely praised. By contrast, ": null
    },
    {
        "Lobotomy Software": "lobotomy software"
    },
    {
        " programmer Ezra Dreisbach described the Saturn as significantly slower than the PlayStation,  whereas ": null
    },
    {
        "Kenji Eno": "kenji eno"
    },
    {
        " of ": null
    },
    {
        "WARP": "superwarp"
    },
    {
        " observed little difference.  In particular, Dreisbach criticized the Saturns use of ": null
    },
    {
        "quadrilaterals": "quadrilateral"
    },
    {
        "as its basic ": null
    },
    {
        "geometric primitive": "geometric primitive"
    },
    {
        ", in contrast to the triangles rendered by the PlayStation and the Nintendo 64. Ken Humphries of ": null
    },
    {
        "Time Warner Interactive": "time warner interactive"
    },
    {
        " remarked that compared to the PlayStation, the Saturn was worse at generating polygons but better at sprites.  Third-party development was initially hindered by the lack of useful ": null
    },
    {
        "software libraries": "library"
    },
    {
        " and ": null
    },
    {
        "development tools": "programming tool"
    },
    {
        ", requiring developers to write in ": null
    },
    {
        "assembly language": "assembly language"
    },
    {
        ". During early Saturn development, programming in assembly could offer a two-to-fivefold speed increase over higher-level languages such as ": null
    },
    {
        "C": "c"
    },
    {
        ".      The Saturn hardware is extremely difficult to ": null
    },
    {
        "emulate": "video game console emulator"
    },
    {
        ".  Sega responded to complaints about the difficulty of programming for the Saturn by writing new graphics libraries which were claimed to make development easier. Sega of America also purchased a United Kingdom-based development firm, Cross Products, to produce the Saturns development system.  Despite these challenges, ": null
    },
    {
        "Treasure": "treasure"
    },
    {
        " CEO Masato Maegawa stated that the Nintendo 64 was more difficult to develop for than the Saturn.  ": null
    },
    {
        "Travellers Tales": "travellers tales"
    },
    {
        " Jon Burton": "jon burton"
    },
    {
        " felt that while the PlayStation was easier to get started on  ... you quickly reach limits , whereas the Saturns complicated hardware had the ability to improve the speed and look of a game when all used together correctly .  A major criticism was the Saturns use of 2D sprites to generate polygons and simulate 3D space. The PlayStation functioned similarly, but also featured a dedicated Geometry Transfer Engine that rendered additional polygons. As a result, several analysts described the Saturn as an essentially 2D system.           Several Saturn models were produced in Japan. An updated model in a recolored light gray was released at ¥20,000 to reduce the systems cost  and raise its appeal among women and younger children.  Two models were released by third parties: Hitachi released the Hi-Saturn ,  while ": null
    },
    {
        "JVC": "jvc"
    },
    {
        " released the V-Saturn. Saturn controllers came in various color schemes to match different models of the console.  The system also supports several accessories. A wireless controller powered by AA batteries uses infrared signal to connect.  Designed to work with Nights, the Saturn ": null
    },
    {
        "3D Pad": "nights into dreams...release"
    },
    {
        " includes both a control pad and an analog stick for directional input.  Sega also released several versions of arcade sticks as peripherals, including the Virtua Stick,   the Virtua Stick Pro,  the Mission Analog Stick,   and the Twin Stick.  Sega also created a ": null
    },
    {
        "light gun": "light gun"
    },
    {
        " peripheral, the Virtua Gun, for shooting games such as Virtua Cop and The Guardian,  and the Arcade Racer, a wheel for racing games.   The Play Cable allows two Saturn consoles to be connected for multiplayer gaming across two screens,   while a multitap allows up to six players to play on the same console.   The Saturn was designed to support up to 12 players on a single console, by using two multitaps.  RAM cartridges expand the memory.  Other accessories include a keyboard,  mouse,   floppy disk drive,  and movie card.       Like the Genesis, the Saturn had an internet-based gaming service. The ": null
    },
    {
        "Sega NetLink": "sega netlink"
    },
    {
        " was a 28.8k ": null
    },
    {
        "modem": "modem"
    },
    {
        " that fit into the cartridge slot in the Saturn for direct dial multiplayer. In Japan, a pay-to-play service was used.  It could also be used for ": null
    },
    {
        "web browsing": "web browsing"
    },
    {
        ", sending ": null
    },
    {
        "email": "email"
    },
    {
        ", and ": null
    },
    {
        "online chat": "online chat"
    },
    {
        ".  Because the NetLink was released before the Saturn keyboard, Sega produced a series of CDs containing hundreds of website addresses so that Saturn owners could browse with the joypad.  The NetLink functioned with Daytona USA,  Duke Nukem 3D ,  Saturn Bomberman , Sega Rally, and  Virtual On: Cyber Troopers .  In 1995, Sega announced a variant of the Saturn featuring a built-in NetLink modem  under the code name Sega Pluto , but it was never released.      Sega developed an arcade board based on the Saturns hardware, the ": null
    },
    {
        "Sega ST-V": "sega st-v"
    },
    {
        " , intended as an affordable alternative to Segas Model 2 arcade board and as a testing ground for upcoming Saturn software. The Titan was criticized for its comparatively weak performance by Sega AM2s Yu Suzuki and was overproduced by Segas arcade division. Because Sega already had the  Die Hard  license, members of ": null
    },
    {
        "Sega AM1": "sega am1"
    },
    {
        " working at the Sega Technical Institute developed  Die Hard Arcade  for the Titan to clear excess inventory. Die Hard became the most successful Sega arcade game produced in the United States at that point. Other games released for the Titan include  Golden Axe: The Duel  and  Virtua Fighter Kids .           Much of the Saturns library comes from Segas arcade ports, including Daytona USA,  The House of the Dead ,   Last Bronx , Sega Rally Championship, the Virtua Cop series, the Virtua Fighter series, and Virtual-On. Saturn ports of 2D ": null
    },
    {
        "Capcom": "capcom"
    },
    {
        " fighting games including  Darkstalkers 3 ,  Marvel Super Heroes vs. Street Fighter , and  Street Fighter Alpha 3  were noted for their faithfulness to their arcade counterparts.  Fighters Megamix , developed by Sega AM2 for the Saturn rather than arcades, combined characters from  Fighting Vipers  and Virtua Fighter to positive reviews.  cf.  cf.  cf.  Highly rated Saturn exclusives include  Panzer Dragoon Saga ,  cf. cf.  cf.   Dragon Force ,   Guardian Heroes ,   Nights,    Panzer Dragoon II Zwei ,  and  Shining Force III .  Shining creators Hiroyuki Takahashi and Shugo Takahashi have named  Shining the Holy Ark  and Shining Force 3 their favorite games in the series. See   PlayStation games such as  Castlevania: Symphony of the Night ,  Resident Evil , and  Wipeout 2097  received Saturn ports with mixed results. Lobotomy Softwares  PowerSlave  featured some of the most impressive 3D graphics on the system, leading Sega to contract them to produce Saturn ports of  Duke Nukem 3D  and  Quake . While Electronic Arts limited support for the Saturn and Segas failure to develop a football game for the 1996 fall season gave Sony the lead in the sports genre,  Sega Sports published Saturn sports games including the well-regarded  World Series Baseball  and  Sega Worldwide Soccer  series. cf.  cf.  With about 600 official releases, the Saturns library is nearly twice as large as the Nintendo 64s.           Due to the cancellation of Sonic X-treme, the Saturn lacks an exclusive Sonic the Hedgehog platformer; instead it received a graphically enhanced port of the Genesis game  Sonic 3D Blast , the compilation  Sonic Jam , and a racing game,  Sonic R .  The platformer  Bug!  received attention for its eponymous main character being a potential mascot for the Saturn, but it failed to catch on as the Sonic series had.  cf.  cf.    Considered one of the most important Saturn releases, Sonic Team developed Nights into Dreams, a ": null
    },
    {
        "score attack": "score"
    },
    {
        " game that attempted to simulate both the joy of flying and the fleeting sensation of dreams. The gameplay of Nights involves steering the ": null
    },
    {
        "imp": "imp"
    },
    {
        "-like ": null
    },
    {
        "androgynous": "androgyny"
    },
    {
        " protagonist, Nights, as it flies on a mostly 2D plane across surreal stages broken into four segments each. The levels repeat for as long as an in-game time limit allows, while flying over or looping around various objects in rapid succession earns additional points. Although it lacked the fully 3D environments of Nintendos Super Mario 64, Nights emphasis on unfettered movement and graceful acrobatic techniques showcased the intuitive potential of analog control.  cf.  cf.    Sonic Teams  Burning Rangers , a fully 3D ": null
    },
    {
        "action-adventure game": "action-adventure game"
    },
    {
        " involving a team of outer-space ": null
    },
    {
        "firefighter": "firefighter"
    },
    {
        "s, garnered praise for its ": null
    },
    {
        "transparency": "transparency"
    },
    {
        " effects and distinctive art direction, but was released in limited quantities late in the Saturns lifespan and criticized for its short length.        Some of the games that made the Saturn popular in Japan, such as  Grandia  and the  Sakura Wars  series, never saw a Western release due to Sega of Americas policy of not localizing RPGs and other Japanese games that might have damaged the systems reputation in North America. cf.  Despite appearing first on the Saturn, games such as  Dead or Alive , cf.  Grandia, and  Lunar: Silver Star Story Complete  only saw a Western release on the PlayStation. ": null
    },
    {
        "Working Designs": "working designs"
    },
    {
        " localized several Japanese Saturn games before a public feud between Sega of Americas Bernie Stolar and Working Designs president Victor Ireland resulted in the company switching their support to the PlayStation. Panzer Dragoon Saga was praised as perhaps the finest RPG for the system due to its cinematic presentation, evocative plot, and unique battle system—with a tactical emphasis on circling around opponents to identify weak points and the ability to morph the physical attributes of the protagonists dragon companion during combat—but Sega released fewer than 20,000 retail copies of the game in North America in what IGNs Levi Buchanan characterized as one example of the Saturns ignominious send-off in the region.  Similarly, only the first of three installments of Shining Force III was released outside Japan. The Saturns library also garnered criticism for its lack of sequels to high-profile Genesis-era Sega franchises, with Sega of Japans cancellation of a planned third installment in Sega of Americas popular  Eternal Champions  series cited as a significant source of controversy. ;      Later ports of Saturn games including Guardian Heroes,  cf.  Nights, and  Shin Megami Tensei: Devil Summoner: Soul Hackers   continued to garner positive reviews. Partly due to rarity, Saturn games such as Panzer Dragoon Saga    and  Radiant Silvergun    have been noted for their ": null
    },
    {
        "cult following": "cult following"
    },
    {
        ". Due to the systems commercial failure and hardware limitations, planned Saturn releases such as  Resident Evil 2 ,  Shenmue, Sonic Adventure, and  Virtua Fighter 3    were cancelled and moved to the Dreamcast.       At the time of the Saturns release,  Famicom Tsūshin  awarded it 24 out of 40, higher than the PlayStations 19 out of 40.  In June 1995, Dennis Lynch of the  Chicago Tribune  and Albert Kim of  Entertainment Weekly  praised the Saturn as the most advanced console available; Lynch praised the double-speed CD-ROM drive and intense surround-sound capabilities and Kim cited Panzer Dragoon as a lyrical and exhilarating epic demonstrating the ability of new technology to transform the industry.   In December 1995, Next Generation gave the Saturn three and a half stars out of five, highlighting Segas marketing and arcade background as strengths but the systems complexity as a weakness. Four critics in  Electronic Gaming Monthly  s December 1996 Buyers Guide rated the Saturn 8, 6, 7, and 8 out of 10 and the PlayStation 9, 10, 9, and 9.  By December 1998, EGM s reviews were more mixed, with reviewers citing the lack of games as a major problem. According to EGM reviewer Crispin Boyer, the Saturn is the only system that can thrill me one month and totally disappoint me the next .      Retrospective feedback of the Saturn is mixed, but generally praises its game library.  According to Greg Sewart of ": null
    },
    {
        "1UP.com": "1up.com"
    },
    {
        ", the Saturn will go down in history as one of the most troubled, and greatest, systems of all time . In 2009, IGN named the Saturn the 18th best console of all time, praising its unique game library. According to the reviewers, While the Saturn ended up losing the popularity contest to both Sony and Nintendo  ... Nights into Dreams, the Virtua Fighter and Panzer Dragoon series are all examples of exclusive titles that made the console a fan favorite.   Edge  noted hardened loyalists continue to reminisce about the console that brought forth games like Burning Rangers, Guardian Heroes, Dragon Force and Panzer Dragoon Saga.  In 2015,  The Guardian  s Keith Stuart wrote that the Saturn has perhaps the strongest line up of 2D shooters and fighting games in console history .       Retro Gamer  s Damien McFerran wrote: Even today, despite the widespread availability of sequels and re-releases on other formats, the Sega Saturn is still a worthwhile investment for those who appreciate the unique gameplay styles of the companies that supported it. IGNs Adam Redsell wrote devil-may-care attitude towards game development in the Saturn and Dreamcast eras is something that we simply do not see outside of the ": null
    },
    {
        "indie scene": "indie game"
    },
    {
        " today. Necrosoft Games director ": null
    },
    {
        "Brandon Sheffield": "brandon sheffield"
    },
    {
        " felt that the Saturn was a landing point for games that were too adult in content for other systems, as it was the only one that allowed an 18+ rating for content in Japan  ... some games, like  Enemy Zero  used it to take body horror to new levels, an important step toward the expansion of games and who they served. Sewart praised the Saturns first-party games as Segas shining moment as a game developer , with Sonic Team demonstrating its creative range and AM2 producing numerous technically impressive arcade ports. He also commented on the many Japan-exclusive Saturn releases, which he connected with a subsequent boom in the game import market.  IGNs Travis Fahs was critical of the Saturn librarys lack of fresh ideas and precious few high-profile franchises , in contrast to what he described as Segas more creative Dreamcast output.     Sega has been criticized for its management of the Saturn. McFerran felt its management staff had fallen out of touch with both the demands of the market and the industry . Stolar has also been criticized; according to Fahs, Stolars decision to abandon the Saturn made him a villain to many Sega fans, but  ... it was better to regroup than to enter the next fight battered and bruised. Dreamcast would be Stolars redemption. Stolar defended his decision, saying, I felt Saturn was hurting the company more than helping it. That was a battle that we werent going to win.  Sheffield said that the Saturns quadrilaterals undermined third-party support, but because ": null
    },
    {
        "nVidia": "nvidia"
    },
    {
        " invested in quads at the same time, there had been a remote possibility they could have become the standard instead of triangles ... if somehow, magically, the Saturn were the most popular console of that era. Speaking more positively, former Working Designs president Victor Ireland described the Saturn as the start of the future of console gaming because it got the better developers thinking and designing with parallel-processing architecture in mind for the first time . In ": null
    },
    {
        "GamesRadar": "gamesradar"
    },
    {
        ", Justin Towell wrote that the Saturns 3D Pad set the template for every successful controller that followed, with analog ": null
    },
    {
        "shoulder triggers": "shoulder triggers"
    },
    {
        " and left thumbstick  ... I dont see any three-pronged controllers around the office these days.      Douglass C. Perry of ": null
    },
    {
        "Gamasutra": "gamasutra"
    },
    {
        " noted that, from its surprise launch to its ultimate failure, the Saturn soured many gamers on Sega products .  Sewart and IGNs Levi Buchanan cited the failure of the Saturn as the major reason for Segas downfall as a hardware manufacturer, but USgamers Jeremy Parish described it as more a symptom  ... than a cause of the decline, which began with add-ons for the Genesis that fragmented the market and continued with Sega of Americas and Sega of Japans competing designs for the Dreamcast.  Sheffield portrayed Segas mistakes with the Saturn as emblematic of the broader decline of the Japanese gaming industry: They thought they were invincible, and that structure and hierarchy were necessary for their survival, but more flexibility, and a greater participation with the West could have saved them. According to Stuart, Sega didnt see  ... the roots of a prevailing trend, away from arcade conversions and traditional role-playing adventures and toward a much wider console development community with fresh ideas about gameplay and structure.  Pulp365 reviews editor Matt Paprocki concluded that the Saturn is a relic, but an important one, which represents the harshness of progress and what it can leave in its wake .            ": null
    }
]