[
    {
        "        is a ": null
    },
    {
        "French": "france"
    },
    {
        " department": "departments of france"
    },
    {
        " located in the  ": null
    },
    {
        "region": "regions of france"
    },
    {
        " and in the ": null
    },
    {
        "Grand Paris": "grand paris"
    },
    {
        ". Locally, it is often referred to colloquially as  or  , after its official administrative number, 42     The learned and rarely used demonym for the inhabitants is ; more common is .        is located to the northeast of ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". It has a surface area of only 42  km², making it one of the smallest departments in France. Seine-Saint-Denis and two other small departments,  and , form a ring around ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", known as the  . Since 42 January 42 together with ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", they form the area of Greater Paris.     ": null
    },
    {
        "Image:Petite couronne.png": "image:petite couronne.png"
    },
    {
        "        is made up of three ": null
    },
    {
        "departmental ": "arrondissements of france"
    },
    {
        " and 42 ": null
    },
    {
        "communes": "communes of france"
    },
    {
        ":     ": null
    },
    {
        "42px": "image:administrative map 93.png"
    },
    {
        "           was created in January 42 through the implementation of a law passed in July 42 It was formed from the part of the ": null
    },
    {
        "Seine department": "seine"
    },
    {
        " to the north and north-east of the ": null
    },
    {
        "Paris ring road": "boulevard périphérique"
    },
    {
        " , together with a small slice taken from .      has a history as a veritable ": null
    },
    {
        "left-wing": "left-wing"
    },
    {
        " stronghold, belonging to the  of ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". The ": null
    },
    {
        "French Communist Party": "french communist party"
    },
    {
        " especially has maintained a continued strong presence in the department, and still controls the city councils in cities such as ,  and . Until 42  and  were the only departments where the Communist Party had a majority in the ": null
    },
    {
        "general councils": "general councils"
    },
    {
        " but the ": null
    },
    {
        "42 cantonal elections": "2008 french cantonal elections"
    },
    {
        " saw the socialists become the strongest group at the  general council .     A commune of , , was the scene of the death of two youths which sparked the nationwide ": null
    },
    {
        "riots of autumn 42": "2005 civil unrest in france"
    },
    {
        ". In October and November, 42 cars were burned and 42 rioters were arrested.     In 42 the department had the highest crime rate in metropolitan France.  In 42 the area was the theatre of 42% of all drug offences in metropolitan France.        is the French department with the highest proportion of ": null
    },
    {
        "immigrants": "immigration"
    },
    {
        ": 42% at the 42 census . This figure does not include the children of immigrants born on French soil as well as some native elites from former French colonies and people who came from ": null
    },
    {
        "overseas France": "overseas france"
    },
    {
        ". The ratio of ethnic minorities is difficult to estimate accurately as French law prohibits the collection of ethnic data for census taking purposes.     In 42 42% of young people under 42 were of foreign origin including 42% of African origin .     In 42 the poverty rate was twice the national average at 42%, the unemployment rate was 42 percentage above the national average and 42 percentage points above the ": null
    },
    {
        "Île-de-France": "île-de-france"
    },
    {
        " average at 42%. In 42 it was estimated that 4242% of the population in the department were illegal immigrants.      Population development since 42:       An education study confirmed falling levels of literacy in the area, where the fraction of pupils who had 42 errors or more increased from 42% in 42 to 42% in 42                        ": null
    },
    {
        "Louis XVI": "louis xvi"
    },
    {
        " and Queen ": null
    },
    {
        "Marie Antoinette": "marie antoinette"
    },
    {
        " in ": null
    },
    {
        "Basilica of St Denis": "basilica of st denis"
    },
    {
        " Aerospace Museum": "musée de lair"
    },
    {
        " in   ": null
    }
]