[
    {
        "        Seleucus VI Epiphanes Nicator  was a ": null
    },
    {
        "Hellenistic": "hellenistic period"
    },
    {
        " Seleucid": "seleucid empire"
    },
    {
        " monarch who ": null
    },
    {
        "ruled Syria": "list of syrian monarchs"
    },
    {
        " between 42 and 42 BC. He was the son of ": null
    },
    {
        "Antiochus VIII": "antiochus viii grypus"
    },
    {
        " and his Egyptian wife ": null
    },
    {
        "Tryphaena": "tryphaena"
    },
    {
        ". Seleucus VI lived in a period of civil war between his father and his uncle ": null
    },
    {
        "Antiochus IX": "antiochus ix cyzicenus"
    },
    {
        ", which ended in 42 BC when Antiochus VIII was assassinated. Antiochus IX then occupied the capital ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        " while Seleucus VI established his power-base in western ": null
    },
    {
        "Cilicia": "cilicia"
    },
    {
        " and himself prepared for war. In 42 BC, Antiochus IX marched against his nephew, but lost the battle and was killed. Seleucus VI became the master of the capital but had to share Syria with his brother ": null
    },
    {
        "Demetrius III": "demetrius iii eucaerus"
    },
    {
        ", based in ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        ", and his cousin, Antiochus IXs son ": null
    },
    {
        "Antiochus X": "antiochus x eusebes"
    },
    {
        ".     According to the ancient historian ": null
    },
    {
        "Appian": "appian"
    },
    {
        ", Seleucus VI was a violent ruler. He taxed his dominions extensively to support his wars, and resisted allowing the cities a measure of autonomy, as had been the practice of former kings. His reign did not last long; in 42 BC, he was expelled from Antioch by Antiochus X, who followed him to the Cilician city of ": null
    },
    {
        "Mopsuestia": "mopsuestia"
    },
    {
        ". Seleucus took shelter in the city where his attempts to raise money led to riots that eventually claimed his life in 42 BC. Ancient traditions have different versions of his death, but he was most probably burned alive by the rioters. Following his demise, his brothers ": null
    },
    {
        "Antiochus XI": "antiochus xi epiphanes"
    },
    {
        " and ": null
    },
    {
        "Philip I": "philip i philadelphus"
    },
    {
        " destroyed Mopsuestia as an act of revenge and their armies fought those of Antiochus X.          Seleucus was a dynastic name in the ": null
    },
    {
        "Seleucid dynasty": "list of seleucid rulers"
    },
    {
        ", and it is the ": null
    },
    {
        "Macedonian": "ancient macedonian language"
    },
    {
        " variant of the Greek Ζάλευκος , meaning the shining white. ": null
    },
    {
        "Antiochus VIII": "antiochus viii grypus"
    },
    {
        " married the ": null
    },
    {
        "Ptolemaic": "ptolemaic dynasty"
    },
    {
        " Egyptian princess ": null
    },
    {
        "Tryphaena": "tryphaena"
    },
    {
        " in  42BC, shortly after his ascension to the throne; Seleucus VI was the couples eldest son. From 42BC, Antiochus VIII had to contend with his half-brother ": null
    },
    {
        "Antiochus IX": "antiochus ix cyzicenus"
    },
    {
        " for the throne. The civil war continued for more than a decade; it claimed the life of Tryphaena in 42 BC, and ended when Antiochus VIII was assassinated in 42BC. In the aftermath of his brothers murder, Antiochus IX advanced on the capital ": null
    },
    {
        "Antioch": "antioch"
    },
    {
        " and took it; he also married the second wife and widow of Antiochus VIII, ": null
    },
    {
        "Cleopatra Selene": "cleopatra selene of syria"
    },
    {
        ". According to an inscription, the city of ": null
    },
    {
        "Priene": "priene"
    },
    {
        " sent honors to Seleucus son of King Antiochus son of King ": null
    },
    {
        "Demetrius": "demetrius ii nicator"
    },
    {
        " ; the embassy probably took place before Seleucus VI ascended the throne as the inscription does not mention him as a king. The embassy of Priene probably met Seleucus VI in ": null
    },
    {
        "Cilicia": "cilicia"
    },
    {
        "; Antiochus VIII might have sent his son to that region as a ": null
    },
    {
        "strategos": "strategos"
    },
    {
        ".                Following his fathers death, Seleucus VI declared himself king and took the city of ": null
    },
    {
        "Seleucia on the Calycadnus": "silifke"
    },
    {
        " in western Cilicia as his base, while his brother ": null
    },
    {
        "Demetrius III": "demetrius iii eucaerus"
    },
    {
        " took ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        ". The volume of coins minted by the new king in Seleucia on the Calycadnus surpassed any other mint known from the late Seleucid period, and most of the coins were produced during his preparations for war against Antiochus IX, a conflict that would end in the year 42/42 BC . This led the numismatist Arthur Houghton to suggest an earlier death for Antiochus VIII and a longer reign for Seleucus VI beginning in 42 or 42BC instead of 42BC. The numismatist ": null
    },
    {
        "Oliver D. Hoover": "oliver d. hoover"
    },
    {
        " contested Houghtons hypothesis as it was not rare for a king to double his production in a single year at times of need, and the academic consensus prefers the year 42BC for the death of Antiochus VIII.       Ancient ": null
    },
    {
        "Hellenistic": "hellenistic period"
    },
    {
        " kings did not use ": null
    },
    {
        "regnal number": "regnal number"
    },
    {
        "s. Instead, they employed epithets to distinguish themselves from other kings with similar names; the numbering of kings is a modern practice. Seleucus VI appeared on his coins with the epithets Epiphanes and Nicator . As being the son of Antiochus VIII was the source of his legitimacy as king, Seleucus VI sought to emphasize his descent by depicting himself on the coinage with an exaggerated hawk-nose in the likeness of his father.     Another iconographic element of Seleucus VIs coinage is the short vertical stubby horns above the ": null
    },
    {
        "temple": "temple"
    },
    {
        " area; the meaning of this motif has been debated among scholars. It is likely an allusion to Seleucus VIs descent from his grandfather ": null
    },
    {
        "Demetrius II": "demetrius ii nicator"
    },
    {
        ", who utilized the same motif. The specific meaning of the horns is not clear, but it could have been an indication that the king was a manifestation of a god; the stubby horns sported by Seleucus VI probably carried the same meaning as those of his grandfather. In the Seleucid dynasty, currency struck during campaigns against a rival showed the king with a beard. Seleucus VI was depicted with a beard, which was later removed from coins, indicating the fulfilment of a vengeance vow to avenge his father.       In Seleucia on the Calycadnus, Seleucus VI prepared for war against his uncle, whose forces probably occupied central Cilicia and confined his nephew to the western parts of the region. The king needed a harbor for Seleucia on the Calycadnus and probably founded the city of ": null
    },
    {
        "Elaiussa": "elaiussa sebaste"
    },
    {
        " to serve that purpose. Seleucus VI gathered funds for his coming war from the cities of Cilicia, including ": null
    },
    {
        "Mopsuestia": "mopsuestia"
    },
    {
        ", which seems to have been taxed on several occasions. During his reign, it is estimated that Seleucus VI produced 42 ": null
    },
    {
        "talents": "talent"
    },
    {
        " of coins to support his war effort, enough to pay ten thousand soldiers for two years. On the reverse of bronze coins produced in a mint whose location is not known, coded uncertain mint 42 a motif depicting a ": null
    },
    {
        "chelys": "chelys"
    },
    {
        " formed in the shape of a Macedonian shield appeared on the reverse. This motif was probably meant to rally the support of military Macedonian colonists in the region. Those coins were probably produced in Syria, in a city half the way between ": null
    },
    {
        "Tarsus": "tarsus, mersin"
    },
    {
        " in Cilicia and Antioch; therefore, they were probably minted in the course of Seleucus VIs campaign against Antiochus IX.      Antiochus IX took note of Seleucus VIs preparations; after the latter started his march on Antioch in 42BC, Antiochus IX left the capital and moved against his nephew. Seleucus VI emerged victorious while his uncle lost his life, either by committing suicide according to the third century historian ": null
    },
    {
        "Eusebius": "eusebius"
    },
    {
        ", or by being executed according to the first century historian ": null
    },
    {
        "Josephus": "josephus"
    },
    {
        ". Soon afterwards, Seleucus VI entered the capital; Cleopatra Selene probably fled before his arrival.       In 42 SE , King ": null
    },
    {
        "Antiochus IV": "antiochus iv epiphanes"
    },
    {
        " allowed nineteen cities to mint municipal bronze coinage in their own names, indicating his awareness of the mutual dependency of cities and the monarchy on each other. This movement towards greater autonomy continued as the cities sought to emancipate themselves from the central power, adding the phrase sacred and autonomous to their coinage. Seleucus VI did not follow the policy of his forebears. In Cilicia, as long as he reigned, autonomy was not granted; a change in the political status of Cilician cities was apparently not acceptable for Seleucus VI.     Seleucus VI controlled Cilicia and Syria Seleucis . Antiochus IX had a son, ": null
    },
    {
        "Antiochus X": "antiochus x eusebes"
    },
    {
        "; according to Josephus, he fled to the city of ": null
    },
    {
        "Aradus": "arwad"
    },
    {
        " where he declared himself king. Seleucus VI attempted to kill his cousin and rival but the plot failed, and Antiochus X married Cleopatra Selene to enhance his position. The archaeologist ": null
    },
    {
        "Alfred Bellinger": "alfred bellinger"
    },
    {
        " believed that Seleucus VI prepared for his coming war against Antiochus X in Elaiussa. In 42BC, Antiochus X advanced on the capital Antioch and drove Seleucus VI out of northern Syria into Cilicia. According to Eusebius, the final battle took place near Mopsuestia, and ended with the defeat of Seleucus VI.             Described by the second century historian ": null
    },
    {
        "Appian": "appian"
    },
    {
        " as violent and extremely tyrannical , Seleucus VI took shelter in Mopsuestia, and attempted to tax the residents again, which led to his death during riots. The year of his demise is not clear; Eusebius placed it in 42 SE which is impossible considering that a market weight of Seleucus VI from Antioch dated to 42 SE has been discovered. The fourth century historian ": null
    },
    {
        "Jerome": "jerome"
    },
    {
        " has 42 SE as the year of Seleucus VIs demise, which is more plausible. The year 42BC is the academically accepted date for the death of Seleucus VI. No spouse or children were recorded for Seleucus VI. According to the first century biographer ": null
    },
    {
        "Plutarch": "plutarch"
    },
    {
        ", the first century BC ": null
    },
    {
        "Roman": "roman republic"
    },
    {
        " general ": null
    },
    {
        "Lucullus": "lucullus"
    },
    {
        " said that the ": null
    },
    {
        "Armenian": "kingdom of armenia"
    },
    {
        " king, ": null
    },
    {
        "Tigranes II": "tigranes the great"
    },
    {
        ", who conquered Syria in 42BC, put to death the successors of ": null
    },
    {
        "Seleucus": "seleucus i nicator"
    },
    {
        ", and off their wives and daughters into captivity . Given the fragmentary nature of ancient sources regarding the late-Seleucid period, the statement of Lucullus leaves open the existence of a wife or daughter of Seleucus VI.     Ancient traditions preserve three accounts regarding Seleucus VIs death: the oldest, by Josephus, has a mob burning the king and his courtiers in the royal palace. Appian shares the burning account but has the citys gymnasium as the scene. According to Eusebius, Seleucus VI discovered the intention of the residents to burn him, and took his own life. Bellinger considered the account of Josephus to be the most probable; he noted that Eusebius presented suicide accounts for other Seleucid kings who were recorded as having been killed by other historians, such as ": null
    },
    {
        "Alexander I": "alexander balas"
    },
    {
        " and Antiochus IX. Bellinger believed that the third century historian ": null
    },
    {
        "Porphyry": "porphyry"
    },
    {
        ", the source of Eusebius stories about the Seleucids, was attempting to tone down somewhat the horrors of the Seleucid house .     The city of ": null
    },
    {
        "Athens": "athens"
    },
    {
        " shared a close relation with the Seleucid kings, and statues of Syrian monarchs set up by Athenian citizens on the island of ": null
    },
    {
        "Delos": "delos"
    },
    {
        " testify to that; a citizen named Dionysius dedicated a statue for Seleucus VI between 42 and 42BC. In deference to his late brother, King ": null
    },
    {
        "Antiochus XI": "antiochus xi epiphanes"
    },
    {
        " adopted the epithet Philadelphus . Along with his twin ": null
    },
    {
        "Philip I": "philip i philadelphus"
    },
    {
        ", Antiochus XI proceeded to avenge Seleucus VI; the brothers sacked and destroyed Mopsuestia. Antiochus XI then headed to Antioch in 42BC and expelled Antiochus X.                                         Citations:     ": null
    }
]