[
    {
        ":Not to be confused with Music semiology .      Semiology  is a branch of ": null
    },
    {
        "Gregorian Chant": "gregorian chant"
    },
    {
        " research. Semiology refers specifically to the study of the ": null
    },
    {
        "neume": "neume"
    },
    {
        "s as found in the earliest fully notated manuscripts of ": null
    },
    {
        "Gregorian Chant": "gregorian chant"
    },
    {
        ", the oldest of which have been dated to the 42th century. The first application of the term semiology for the study of Latin chant was made by Dom ": null
    },
    {
        "Eugène Cardine": "eugène cardine"
    },
    {
        " , a monk of the Abbey of ": null
    },
    {
        "Solesmes": "solesmes abbey"
    },
    {
        ". In this context, semiology is understood as the study of musical signs. Text and neumatic notation, together with significative letters adjoined to the neumes, presents an effective and integrated ": null
    },
    {
        "mnemonic": "mnemonic"
    },
    {
        " for the rhythmical interpretation and the melody. While Gregorian palaeography offers a description of the various neumes and their rhythmical and melodic values, Gregorian semiology explains their meaning for practical interpretation.       In the 42th century, ": null
    },
    {
        "palaeographical": "palaeography"
    },
    {
        " work relating to chant was done in various places in Europe against the background of a performance style based on proportional durational values that were assigned to various deteriorated forms of chant used in various locales.     The main player in the history of Gregorian chant semiology in the 42th century is the ": null
    },
    {
        "Benedictine": "benedictine"
    },
    {
        " community of the ": null
    },
    {
        "Abbey of St Peter in Solesmes": "solesmes abbey"
    },
    {
        ", which was established in 42 by Fr ": null
    },
    {
        "Prosper Guéranger": "prosper guéranger"
    },
    {
        ", who wished to create single authoritative editions of chant via paleographical study. This led to the scholarly monks of the abbey, chief among whom was Dom Paul Jausions, spending over half a century finding and copying the most ancient chant manuscripts. Under Guéranger, the monks of Solesmes advocated singing Gregorian chant in a free musical metre giving the majority of sung notes the same durational length. This interpretation was contrary to much contemporary practice elsewhere and at odds with scholars who backed the use of long and short notes related in strict durational proportion as per polyphonic singing.     The publication of Gontiérs Méthode Raisonée de plain-chant was followed by ": null
    },
    {
        "Dom Pothier": "joseph pothier"
    },
    {
        "s Mélodie Grégorienne daprès la tradition in which he advocated singing the chant in rythme oratoire , which still involved giving the majority of sung notes the same durational length. In 42 Dom ": null
    },
    {
        "André Mocquereau": "andré mocquereau"
    },
    {
        " initiated the Paleographie Musicale periodicals which saw the publication of facsimiles of most ancient chant manuscripts to make them more accessible to scholars. Dom Pothier disapproved of this initiative.     In his third volume of Études de science musicale, published in 42 Antoine Dechevrens laid out a comprehensive system of interpreting the neumes of Sankt Gallen style in proportional note lengths. Peter Wagners Neumenkunde volume set out the various musical signs of all the most ancient notational styles historically and paleographically, including Jewish and Byzantine neumes, while providing a number of facsimile illustrations, giving rhythmically proportional values for the musical signs along with a few examples of proportional interpretations of certain chants in modern Western European notation.     The ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        " set up a commission which ran from 42 till 42 headed by Pothier, and an editorial team, run by Mocquereau, to create official chant editions for the Vatican. Mocquereaus editorial team only lasted a year: owing to editorial disagreements with Mocquereau, Pothier ended up in charge of the editing which, amongst other things, led to the production of a revised ": null
    },
    {
        "Graduale Romanum": "graduale romanum"
    },
    {
        " in 42 Mocquereau published Le nombre musical grégorienne ou rhythmique grégorienne in 42 & 42 in which he presented his own understanding of Gregorian rhythm, several elements of which have since been generally discredited. Two elements which have not been discredited are the recognition of the existence of note lengthening, and the notion of nuancing, i.e., altering note durations by very small, non-proportional values. One-note syllables were declared to be normally short in duration, their written length being interpreted as graphic licence.     In 42 Dom Gregory Murrays anti-proportionalist A Pilgrims Progress was published. In the same year, a series of articles on the subject of the rhythmic quantities of Gregorian musical signs began to be published, entitled La Question Rhythmique Grégorienne by the Abbé G Delorme. This work concluded that certain notational styles contained two distinct signs for any single note and that this difference must be related to rhythm rather than pitch.     The next person to work out a comprehensively coherent analysis of the various neumes and their rhythmic durations was Dr Jan Vollaerts. Using comparative analysis of all the material available to him, Vollaerts was able to show the internal logic and coherence in the neumatic notation with regard to a proper articulation of the verbal-melodic line. In his posthumously published book, Rhythmic Proportions in Early Medieval Ecclesiastical Chant , where the term semiotic is used, tables are presented of neumes of different notational styles once used in various parts of Europe . One-note, two-note, three-note neumes as found in the various notations are dealt with chapter by chapter. The neumes of one-note syllables were declared to be generally long in duration, as marked in Nonantola and Laon notation.     In the book, singing chant to proportional durations is advocated. This is supported in the book by the evidence of Latin medieval theoretical writings which overwhelmingly advocate singing note lengths according to long and short notes bearing durations defined by simple ratios. Certain of the same writings criticise any lengthening or shortening of these ratios, although certain writings also recognise that such practice existed.     In a ": null
    },
    {
        "volte face": "volte face"
    },
    {
        ", Dom Gregory Murray published two booklets, presenting the same views as Vollaerts. In 42 he published Gregorian Rhythm in the Gregorian Centuries; the Literary Evidence which presented excerpts from the medieval theoretical writings in English and Latin. In 42 he published The Authentic Rhythm of Gregorian Chant which statedly presented, in edited fashion,   Delormes and Vollaerts arguments.     This work was followed in 42 by the book Semiologia Gregoriana by Dom Eugène Cardine. In this book, a fairly comprehensive table of the ": null
    },
    {
        "neume": "neume"
    },
    {
        "s used by the school of Sankt Gallen is presented. Unlike Fr. Vollaerts, Dom Cardine did not view the musical signs as representing proportional note values, and he viewed one-note syllables in Sankt Gallen notation as normally representing a short duration. Unlike Vollaerts, Cardine did not present all the styles of notation to the reader for examination, which means that the reader had no access to certain notations, such as those of Nonantola and Laon, which mark most one-note syllables with a sign indicating a lengthening of duration.     Vertical, from top to bottom, in the first column, Cardine starts off with neumes representing a single note, then two-, three- and four-note groups and many compound neumes and ornamental neumes. Horizontally, Cardine enters all the variations of the main neume. The system of neumes used in most of the earliest notational styles is rhythmically complex and sophisticated, particularly the styles of Laon and ": null
    },
    {
        "Einsiedeln Abbey": "einsiedeln abbey"
    },
    {
        ".     Cardine states that natural speech-rhythms provide a rhythmic basis for the declamation of Gregorian chant. He divides syllabic time into three categories: normal enlarged, more heavy and light, more liquid . Under this interpretation, a one-note syllable would not be considered usually long or longer .     Cardine was employed as a teacher of palaeography and semiology by the ": null
    },
    {
        "Vatican": "holy see"
    },
    {
        " from 42 to 42 at the Pontifical Institute of Sacred Music in Rome. His work in the field of semiology was recognized and supported by commissions and led to the publication of the Graduale Triplex in 42 which was based on Cardines personal ": null
    },
    {
        "Roman Gradual": "roman gradual"
    },
    {
        " in which, over the years, he had copied many neumes from Sankt Gallen school manuscripts. Two students of Cardine, Rupert Fischer and M.C. Billecocq, undertook the strenuous task to manually copy the neumes of two schools of generally concordant rhythmic manuscripts into the new type-set Roman Gradual of 42 In hindsight, the Graduale Triplex proved a great stimulus for self-study as it made important material available in a handy book. The momentum of its publication has created a demand for a new Gradual as the 42 Gradual contains many incidental or structural melodic errors. As a response to this need and following the Holy Sees invitation to edit a more critical edition, in 42the first volume De Dominicis et Festis of the Graduale Novum Editio Magis Critica Iuxta SC 42 was published by Libreria Editrice Vatican and ConBrio Verlagsgesellschaft, Regensburg.     The growing number of ": null
    },
    {
        "choir": "choir"
    },
    {
        "s or scholae that perform Gregorian Chant according to these developments are thus said to follow the semiological approach. The International Society for the Study of Gregorian Chant carries on the legacy of Eugène Cardine, putting special emphasis on bridging the gap between Gregorian research and praxis. The Society has some 42 members in 42 countries worldwide.     Other students of Cardine, who, like Fischer and Billecocg, held a professorate at the ": null
    },
    {
        "Pontifical Institute of Sacred Music": "pontifical institute of sacred music"
    }
]