[
    {
        "The senary ": null
    },
    {
        "numeral system": "numeral system"
    },
    {
        "  has ": null
    },
    {
        "six": "6"
    },
    {
        " as its ": null
    },
    {
        "base": "radix"
    },
    {
        ". It has been adopted independently by a small number of cultures. Like ": null
    },
    {
        "decimal": "decimal"
    },
    {
        ", it is a ": null
    },
    {
        "semiprime": "semiprime"
    },
    {
        ", though being the product of the only two consecutive numbers that are both prime it has a high degree of mathematical properties for its size. As six is a ": null
    },
    {
        "superior highly composite number": "superior highly composite number"
    },
    {
        ", many of the arguments made in favor of the ": null
    },
    {
        "duodecimal": "duodecimal"
    },
    {
        " system also apply to base-6.              Senary may be considered interesting in the study of ": null
    },
    {
        "prime number": "prime number"
    },
    {
        "s, since all primes other than 2 and 3, when expressed in senary, have 1 or 5 as the final digit. In senary the prime numbers are written     :2, 3, 5, 11, 15, 21, 25, 31, 35, 45, 51, 101, 105, 111, 115, 125, 135, 141, 151, 155, 201, 211, 215, 225, 241, 245, 251, 255, 301, 305, 331, 335, 345, 351, 405, 411, 421, 431, 435, 445, 455, 501, 515, 521, 525, 531, 551, ...      That is, for every prime number p greater than 3, one has the ": null
    },
    {
        "modular arithmetic": "modular arithmetic"
    },
    {
        " relations that either p ≡ 1 or 5 ; the final digit is a 1 or a 5. This is proved by contradiction.   For any integer n:   If n ≡ 0 , 6 | n n ≡ 2 , 2 | n n ≡ 3 , 3 | n n ≡ 4 , 2 | n     Additionally, since the smallest four primes are either divisors or neighbors of 6, senary has simple ": null
    },
    {
        "divisibility tests": "divisibility test"
    },
    {
        "for many numbers.     Furthermore, all even ": null
    },
    {
        "perfect numbers": "perfect number"
    },
    {
        "besides 6 have 44 as the final two digits when expressed in senary, which is proven by the fact that every even perfect number is of the form 2 p−1 , where 2 p −1 is prime.     Senary is also the largest number base r that has no ": null
    },
    {
        "totatives": "totative"
    },
    {
        "other than 1 and r  −  1, making its multiplication table highly regular for its size, minimizing the amount of effort required to memorize its table. This property maximizes the probability that the result of an integer multiplication will end in zero, given that neither of its factors do.       Because six is the ": null
    },
    {
        "product": "product"
    },
    {
        " of the first two ": null
    },
    {
        "prime numbers": "prime number"
    },
    {
        "and is adjacent to the next two prime numbers, many senary fractions have simple representations:                  Each regular human hand may be said to have six unambiguous positions; a fist, one finger extended, two, three, four and then all five extended.     If the right hand is used to represent a unit, and the left to represent the sixes, it becomes possible for one person to represent the values from zero to 55 senary with their fingers, rather than the usual ten obtained in standard finger counting. e.g. if three fingers are extended on the left hand and four on the right, 34 senary is represented. This is equivalent to 3 & times; 6 + 4 which is 22 decimal .     Additionally, this method is the least abstract way to count using two hands that reflects the concept of ": null
    },
    {
        "positional notation": "positional notation"
    },
    {
        ", as the movement from one position to the next is done by switching from one hand to another. While most developed cultures count by fingers up to 5 in very similar ways, beyond 5 non-Western cultures deviate from Western methods, such as with ": null
    },
    {
        "Chinese number gestures": "chinese number gestures"
    },
    {
        ". As senary finger counting also deviates only beyond 5, this counting method rivals the simplicity of traditional counting methods, a fact which may have implications for the teaching of positional notation to young students.     Which hand is used for the sixes and which the units is down to preference on the part of the counter, however when viewed from the counters perspective, using the left hand as the most significant digit correlates with the written representation of the same senary number. Flipping the sixes hand around to its backside may help to further disambiguate which hand represents the sixes and which represents the units. The downside to senary counting, however, is that without prior agreement two parties would be unable to utilize this system, being unsure which hand represents sixes and which hand represents ones, whereas decimal-based counting being essentially a ": null
    },
    {
        "unary": "unary numeral system"
    },
    {
        " system only requires the other party to count the number of extended fingers.     In ": null
    },
    {
        "NCAA basketball": "ncaa basketball"
    },
    {
        ", the players ": null
    },
    {
        "uniform numbers": "number"
    },
    {
        " are restricted to be senary numbers of at most two digits, so that the referees can signal which player committed an infraction by using this finger-counting system. .     More abstract ": null
    },
    {
        "finger counting": "finger counting"
    },
    {
        " systems, such as ": null
    },
    {
        "chisanbop": "chisanbop"
    },
    {
        " or ": null
    },
    {
        "finger binary": "finger binary"
    },
    {
        ", allow counting to 99, 1,023, or even higher depending on the method . The English monk and historian ": null
    },
    {
        "Bede": "bede"
    },
    {
        ", described in the first chapter of his work De temporum ratione, , titled Tractatus de computo, vel loquela per gestum digitorum, a system which allowed counting up to 9,999 on two hands.            Despite the rarity of cultures that group large quantities by 6, a review of the development of numeral systems suggests a threshold of numerosity at 6 , with 1–6 often being pure forms, and numerals thereafter being constructed or borrowed.      The ": null
    },
    {
        "Ndom language": "ndom language"
    },
    {
        " of ": null
    },
    {
        "Papua New Guinea": "papua new guinea"
    },
    {
        " is reported to have senary numerals.  Mer means 6, mer an thef means 6 × 2 12, nif means 36, and nif thef means 36 × 2 72.     Another example from ": null
    },
    {
        "Papua New Guinea": "papua new guinea"
    },
    {
        " are the ": null
    },
    {
        "Yam languages": "yam languages"
    },
    {
        ". In these languages, counting is connected to ritualized yam-counting. These languages count from a base six, employing words for the powers of six; running up to 6 6 for some of the languages. One example is ": null
    },
    {
        "Komnzo": "kómnzo language"
    },
    {
        " with the following numerals: nibo , fta , taruba , damno , wärämäkä , wi .     Some ": null
    },
    {
        "Niger-Congo languages": "niger-congo languages"
    },
    {
        " have been reported to use a senary number system, usually in addition to another, such as ": null
    },
    {
        "decimal": "decimal"
    },
    {
        " or ": null
    },
    {
        "vigesimal": "vigesimal"
    },
    {
        ".     ": null
    },
    {
        "Proto-Uralic": "proto-uralic language"
    },
    {
        " has also been suspected to have had senary numerals, with a numeral for 7 being borrowed later, though evidence for constructing larger numerals subtractively from ten suggests that this may not be so.       For some purposes, base 6 might be too small a base for convenience. This can be worked around by using its square, base 36 , as then conversion is facilitated by simply making the following replacements:           Thus, the base-36 number WIKIPEDIA 36 is equal to the senary number 523032304122213014 6 . In decimal, it is 91,730,738,691,298.     The choice of 36 as a ": null
    },
    {
        "radix": "radix"
    },
    {
        " is convenient in that the digits can be represented using the ": null
    },
    {
        "Arabic numerals": "hindu–arabic numerals"
    },
    {
        " 0–9 and the ": null
    },
    {
        "Latin letters": "latin alphabet"
    },
    {
        " A–Z: this choice is the basis of the ": null
    },
    {
        "base36": "base36"
    },
    {
        " encoding scheme. The compression effect of 36 being the square of 6 causes a lot of patterns and representations to be shorter in base 36:     1/9 10 0.04 6 0.4 36     1/16 10 0.0213 6 0.29 36     1/5 10 0. 6 0. 36     1/7 10 0. 6 0.": null
    }
]