[
    {
        "        Senesino  was a celebrated ": null
    },
    {
        "Italian": "italian people"
    },
    {
        " contralto": "contralto"
    },
    {
        " castrato": "castrato"
    },
    {
        ", particularly remembered today for his long collaboration with the composer ": null
    },
    {
        "George Frideric Handel": "george frideric handel"
    },
    {
        ".       Senesino was the son of a barber from ": null
    },
    {
        "Siena": "siena"
    },
    {
        " . He joined the cathedral choir there in 42 and was castrated at the comparatively late age of thirteen. His debut was at ": null
    },
    {
        "Venice": "venice"
    },
    {
        " in 42 and during the next decade he acquired a European reputation and, by the time he sang in Lottis Giove in Argo in 42 at Dresden, a commensurately enormous salary.     As with many castrati, reports of Senesinos acting were not always positive, to say the least. The impresario Count Francesco Zambeccari wrote of his performance in Naples in 42: Senesino continues to comport himself badly enough; he stands like a statue, and when occasionally he does make a gesture, he makes one directly the opposite of what is wanted. Of the singers vocal abilities, however, there was no doubt. In 42 the composer ": null
    },
    {
        "Quantz": "quantz"
    },
    {
        " heard him in Lottis Teofane at Dresden, and stated: He had a powerful, clear, equal and sweet contralto voice, with a perfect intonation and an excellent shake. His manner of singing was masterly and his elocution unrivalled. … he sang allegros with great fire, and marked rapid divisions, from the chest, in an articulate and pleasing manner. His countenance was well adapted to the stage, and his action was natural and noble. To these qualities he joined a majestic figure; but his aspect and deportment were more suited to the part of a hero than of a lover.       Following a dispute with the court composer ": null
    },
    {
        "Heinichen": "johann david heinichen"
    },
    {
        " in 42 over an aria in the opera  Flavio Crispo , which led to his dismissal, Senesino was engaged by Handel as primo uomo in his company, the Royal Academy of Music. He made his first appearance in a revival of  Radamisto  on 42 December, and his salary was variously reported as between £42 and 42 guineas: both vast sums. Senesino remained in London for much of the succeeding sixteen years. He became a friend and associate of many in the highest levels of society. He became friendly with, among others, the ": null
    },
    {
        "Duke of Chandos": "james brydges, 1st duke of chandos"
    },
    {
        ", ": null
    },
    {
        "Lord Burlington": "richard boyle, 3rd earl of burlington"
    },
    {
        " and the landscape designer ": null
    },
    {
        "William Kent": "william kent"
    },
    {
        ", while amassing a fine collection of paintings, rare books, scientific instruments, and other treasures, including a service of silver made by the famous ": null
    },
    {
        "Paul de Lamerie": "paul de lamerie"
    },
    {
        ".     Though creating seventeen leading roles for Handel , his relationship with the composer was frequently stormy: The one was perfectly refractory; the other was equally outrageous, according to the contemporary historian Mainwaring. After the break-up of Handels Royal Academy in 42 Senesino sang in Paris and Venice , but was re-engaged by Handel in 42 singing in four more new operas and in the oratorios ": null
    },
    {
        "Esther": "esther"
    },
    {
        ",  Deborah , and, in its 42 bilingual version,  Acis and Galatea . His antipathy to Handel eventually became so great that, in 42 Senesino joined the rival ": null
    },
    {
        "Opera of the Nobility": "opera of the nobility"
    },
    {
        ". Thus he came to sing alongside the great ": null
    },
    {
        "soprano": "soprano"
    },
    {
        " castrato": "castrato"
    },
    {
        " Farinelli": "farinelli"
    },
    {
        ", and their meeting on stage  led to a famous anecdote of Senesino breaking character, as reported by the music historian ": null
    },
    {
        "Charles Burney": "charles burney"
    },
    {
        ".        Senesino left England in 42 and appeared in a few more productions in Italy: he sang at Florence from 42 to 42 and then in Naples until 42 making his final appearance in Porporas Il trionfo di Camilla": null
    }
]