[
    {
        "     Sennacherib was the king of ": null
    },
    {
        "Assyria": "assyria"
    },
    {
        " from 705  BC to 681  BC. He is principally remembered for his military campaigns against ": null
    },
    {
        "Babylon": "babylon"
    },
    {
        " and ": null
    },
    {
        "Judah": "kingdom of judah"
    },
    {
        ", and for his building programs – most notably at the ": null
    },
    {
        "Assyria": "assyria"
    },
    {
        "n capital of ": null
    },
    {
        "Nineveh": "nineveh"
    },
    {
        ". He was assassinated in obscure circumstances in 681  BC, apparently by his eldest son .     The primary preoccupation of his reign was the so-called Babylonian problem , the refusal of the people of Babylonia to continue to accept Assyrian rule, culminating in his destruction of the city in 689  BC. Further successful campaigns were carried out in the Levant, in the mountains east of Assyria, against the kingdoms of ": null
    },
    {
        "Urartu": "urartu"
    },
    {
        ", ": null
    },
    {
        "Cilicia": "cilicia"
    },
    {
        " and the ": null
    },
    {
        "Neo-Hittites": "neo-hittites"
    },
    {
        " of Anatolia, and against the Arabs in the northern Arabian deserts. His campaigns in Syria are recorded in the ": null
    },
    {
        "Second Book of Kings": "second book of kings"
    },
    {
        " in the ": null
    },
    {
        "Hebrew Bible": "hebrew bible"
    },
    {
        ". His death was welcomed in Babylon as ": null
    },
    {
        "divine punishment": "divine punishment"
    },
    {
        " for the destruction of that city.     He was also a notable builder: it was under him that Assyrian art reached its peak. His building projects included the beautification of ": null
    },
    {
        "Nineveh": "nineveh"
    },
    {
        ", a canal 50  km long to bring water to the city, and the Palace Without Rival , which included what may have been the prototype of the legendary ": null
    },
    {
        "Hanging Gardens of Babylon": "hanging gardens of babylon"
    },
    {
        ", or even the actual Hanging Gardens.             Assyria began as a ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " city-state or small kingdom on the middle-": null
    },
    {
        "Tigris": "tigris"
    },
    {
        ". The kingdom collapsed at the end of the Bronze Age, but was reconstituted at the beginning of the ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        ", and under ": null
    },
    {
        "Tiglath-Pileser III": "tiglath-pileser iii"
    },
    {
        " and his sons ": null
    },
    {
        "Shalmaneser V": "shalmaneser v"
    },
    {
        " and ": null
    },
    {
        "Sargon II": "sargon ii"
    },
    {
        " , Assyria extended its rule over Mesopotamia, Anatolia and Syria-Palestine, making its capital ": null
    },
    {
        "Nineveh": "nineveh"
    },
    {
        ", one of the richest cities of the ancient world. The empires rise aroused the fear and hatred of its neighbours, notably ": null
    },
    {
        "Babylon": "babylon"
    },
    {
        ", ": null
    },
    {
        "Elam": "elam"
    },
    {
        " and ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", and the many smaller kingdoms of the region such as ": null
    },
    {
        "Judah": "kingdom of judah"
    },
    {
        ". Any perceived weakness on the part of Assyria led inevitably to rebellion, particularly by the Babylonians. Solving the so-called Babylonian problem was Sennacheribs primary preoccupation.          Sennacheribs grandfather ": null
    },
    {
        "Tiglath-pileser III": "tiglath-pileser iii"
    },
    {
        ", unlike his predecessors who installed puppet rulers, had made himself king of Babylon, creating a dual monarchy in which the Babylonians retained a nominal independence. This arrangement was never accepted by powerful local leaders, particularly an important tribal chief named ": null
    },
    {
        "Marduk-apla-iddina": "marduk-apla-iddina ii"
    },
    {
        " . Marduk-apla-iddina paid tribute to Tiglath-pileser, but when Tiglath-pilesers successor ": null
    },
    {
        "Shalmaneser V": "shalmaneser v"
    },
    {
        " was overthrown by ": null
    },
    {
        "Sargon II": "sargon ii"
    },
    {
        " he seized the opportunity to crown himself king of Babylon whilst Sargon was preoccupied driving the ": null
    },
    {
        "Cimmerians": "cimmerians"
    },
    {
        " from his colonies in ": null
    },
    {
        "Persia": "persia"
    },
    {
        " and ": null
    },
    {
        "Media": "medes"
    },
    {
        ". The next thirty years saw a repeating pattern of Assyrian reconquest and renewed rebellion.     Sargon dealt with the Babylonian problem by cultivating the Babylonians; Sennacherib took a radically different approach, and there is little sign that he cared about Babylonian popular opinion or took part in the ceremonial duties expected of a Babylonian king, notably the New Year ritual. His relations, instead, were predominantly military, and culminated in his complete destruction of Babylon in 689  BC. He destroyed the temples and the images of the gods, except for that of ": null
    },
    {
        "Marduk": "marduk"
    },
    {
        ", the creator-god and divine patron of Babylon, which he took to Assyria. This caused consternation in Assyria itself, where Babylon and its gods were held in high esteem. Sennacherib attempted to justify his actions to his own countrymen through a campaign of religious propaganda. Among the elements of this campaign he commissioned a myth in which Marduk was put on trial before ": null
    },
    {
        "Ashur": "ashur"
    },
    {
        ", the god of Assyria–the text is fragmentary but it seems Marduk is found guilty of some grave offense; he described his defeat of the Babylonian rebels in language of the ": null
    },
    {
        "Babylonian creation myth": "enûma eliš"
    },
    {
        ", identifying Babylon with the evil demon-goddess ": null
    },
    {
        "Tiamat": "tiamat"
    },
    {
        " and himself with Marduk; Ashur replaced Marduk in the ": null
    },
    {
        "New Year Festival": "akitu"
    },
    {
        "; and in the temple of the festival he placed a symbolic pile of rubble from Babylon. In Babylon itself, Sennacheribs policy spawned a deep seated hatred amongst much of the populace.           Sennacherib was probably not the first-born son of ": null
    },
    {
        "Sargon II": "sargon ii"
    },
    {
        " , but he was groomed for royal succession and entrusted with administrative duties from an early age. Sargon died in battle, and ancient sources give three different years for Sennacheribs first reign-year—705  BC, 704  BC, and 703  BC—suggesting that the succession was not smooth. The transition sparked uprisings in Syria-Palestine, where the Egyptians incited rebellion, and more seriously in ": null
    },
    {
        "Babylonia": "babylonia"
    },
    {
        ", where ": null
    },
    {
        "Marduk-apla-iddina II": "marduk-apla-iddina ii"
    },
    {
        " assumed the throne and assembled a large army of rebellious ": null
    },
    {
        "Chaldea": "chaldea"
    },
    {
        "ns, ": null
    },
    {
        "Aramaean": "aramaean"
    },
    {
        "s, ": null
    },
    {
        "Arabs": "arab"
    },
    {
        "and ": null
    },
    {
        "Elam": "elam"
    },
    {
        "ites.          Sennacheribs first campaign began late in 703  BC against Marduk-apla-iddina , who had once more taken the throne of Babylon. The rebellion was defeated, Marduk-apla-iddina fled to his Elamite protectors, and ": null
    },
    {
        "Babylon": "babylon"
    },
    {
        " was taken and the palace plundered, although the citizens were not harmed. An Assyrian puppet king named ": null
    },
    {
        "Bel-ibni": "bel-ibni"
    },
    {
        " was placed on the throne and for the next two years Babylon was left in peace.     In 701  BC, Sennacherib turned from Babylonia to the western part of the empire, where ": null
    },
    {
        "Hezekiah": "hezekiah"
    },
    {
        " of ": null
    },
    {
        "Judah": "kingdom of judah"
    },
    {
        ", incited by the new ": null
    },
    {
        "Nubian": "nubian people"
    },
    {
        " rulers of ": null
    },
    {
        "Egypt": "ancient egypt"
    },
    {
        " and Marduk-apla-iddina, had renounced Assyrian allegiance. The rebellion involved various small ": null
    },
    {
        "Canaan": "canaan"
    },
    {
        "ite and ": null
    },
    {
        "Phoenicia": "phoenicia"
    },
    {
        "n states in the area: ": null
    },
    {
        "Sidon": "sidon"
    },
    {
        " and ": null
    },
    {
        "Ashkelon": "ashkelon"
    },
    {
        " were taken by force and a string of other cities and states, including ": null
    },
    {
        "Byblos": "byblos"
    },
    {
        ", ": null
    },
    {
        "Ashdod": "ashdod"
    },
    {
        ", ": null
    },
    {
        "Ammon": "ammon"
    },
    {
        ", ": null
    },
    {
        "Moab": "moab"
    },
    {
        " and ": null
    },
    {
        "Edom": "edom"
    },
    {
        " then paid tribute without resistance. ": null
    },
    {
        "Ekron": "ekron"
    },
    {
        " called on Egypt for help but the Egyptians were defeated by Assyria. Sennacherib then turned on ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        ", Hezekiahs capital. He ": null
    },
    {
        "besieged the city": "assyrian siege of jerusalem"
    },
    {
        " and gave its surrounding towns to Assyrian vassal rulers in Ekron, Gaza and Ashdod. However, Sennacherib did not breach the city, and Hezekiah remained on his throne as a vassal ruler.     In 699  BC, ": null
    },
    {
        "Bel-ibni": "bel-ibni"
    },
    {
        ", who had proved untrustworthy or incompetent as king of Babylon, was replaced by Sennacheribs eldest son, ": null
    },
    {
        "Ashur-nadin-shumi": "ashur-nadin-shumi"
    },
    {
        ". Marduk-apla-iddina continued his rebellion with the help of Elam, and in 694 BC Sennacherib took a fleet of Phoenician ships down the Tigris River to destroy the Elamite base on the shore of the ": null
    },
    {
        "Persian Gulf": "persian gulf"
    },
    {
        ", but while he was doing this the Elamites captured Ashur-nadin-shumi and put ": null
    },
    {
        "Nergal-ushezib": "nergal-ushezib"
    },
    {
        ", the son of Marduk-apla-iddina, on the throne of Babylon. Nergal-ushezib was captured in 693  BC and taken to Nineveh, and Sennacherib attacked Elam again. The Elamite king fled to the mountains and Sennacherib plundered his kingdom, but when he withdrew the Elamites returned to Babylon and put another rebel leader, ": null
    },
    {
        "Mushezib-Marduk": "mushezib-marduk"
    },
    {
        ", on the Babylonian throne. Babylon eventually fell to the Assyrians in 689  BC after a lengthy siege, and Sennacherib put an end to the Babylonian problem by utterly destroying the city and even the mound on which it stood by diverting the water of the surrounding canals over the site.       Sennacherib conducted minor campaigns on his borders, but without significantly adding to the already vast empire. In 702  BC and from 699  BC until 697  BC, he made several campaigns in the mountains east of Assyria, on one of which he received tribute from the ": null
    },
    {
        "Medes": "medes"
    },
    {
        ". D.D. Luckenbill , The Annals of Sennacherib , p. 24 In 696  BC and 695  BC, he sent expeditions into Anatolia, where several vassals had rebelled following the death of Sargon. Around 690  BC, he campaigned in the northern Arabian deserts, conquering ": null
    },
    {
        "Dumat al-Jandal": "dumat al-jandal"
    },
    {
        ", where ": null
    },
    {
        "the queen of the Arabs": "teel-hunu"
    },
    {
        " had taken refuge.          The Assyrian empire was divided into provinces, each provincial governor being responsible for matters such as the maintenance of roads and public buildings, and for the implementation of administrative policy. One major element of that policy was the massive deportation and redistribution of populations, which aimed to punish, prevent rebellion, and repopulate depopulated areas in order to maintain food production in the empire. As many as 4.5  million people may have been moved between 745  BC and 612  BC, and Sennacherib alone could have been responsible for displacing 470,000 people.     Sennacherib made Nineveh a truly magnificent city using this forced labour .  He laid out new streets and squares and built within it the famous palace without a rival , the plan of which has been mostly recovered and has overall dimensions of about . It comprised at least 80 rooms, many of which were lined with sculpture. A large number of cuneiform tablets were found in the palace. The solid foundation was made out of limestone blocks and mud bricks; it was  tall. In total, the foundation is made of roughly  of brick . The walls on top, made out of mud brick, were an additional  tall. Some of the principal doorways were flanked by colossal stone door figures weighing up to 30,000 kilograms ; they included many winged lions or bulls with a mans head. These were transported  from quarries at Balatai and they had to be lifted up  once they arrived at the site, presumably by a ramp. There are also  of stone panels carved in bas-relief, that include pictorial records documenting every construction step including carving the statues and transporting them on a barge. One picture shows 44 men towing a colossal statue. The carving shows three men directing the operation while standing on the Colossus. Once the statues arrived at their destination, the final carving was done. Most of the statues weigh between . 10      The stone carvings in the walls include many battle scenes, impalings and scenes showing Sennacheribs men parading the spoils of war before him. He also bragged about his conquests: he wrote of Babylon: Its inhabitants, young and old, I did not spare, and with their corpses I filled the streets of the city. He later wrote about a battle in Lachish: And Hezekiah of Judah who had not submitted to my yoke...him I shut up in Jerusalem his royal city like a caged bird. Earthworks I threw up against him, and anyone coming out of his city gate I made pay for his crime. His cities which I had plundered I had cut off from his land.     At this time, the total area of Nineveh comprised about , and fifteen great gates penetrated its walls. An elaborate system of eighteen canals brought water from the hills to Nineveh, and several sections of a magnificently constructed aqueduct erected by Sennacherib were discovered at Jerwan, about  distant. The enclosed area had more than 100,000 inhabitants , about twice as many as Babylon at the time, placing it among the largest settlements worldwide.     It is possible that the garden which Sennacherib built next to his palace, with its associated irrigation works, was the original ": null
    },
    {
        "Hanging Gardens of Babylon": "hanging gardens of babylon"
    },
    {
        ". ": null
    },
    {
        "Stephanie Dalley": "stephanie dalley"
    },
    {
        " The Mystery of the Hanging Garden of Babylon: an elusive world Wonder traced OUP           Sennacherib was assassinated in obscure circumstances in 681  BC. An inscription by Sennacheribs successor, Esarhaddon, describes how Esarhaddon heard that his brothers were fighting in the streets of Nineveh, hurried back from the Western provinces with an army, defeated them all, and took the throne. The inscription does not mention that the brothers were fighting because one of them had just murdered Sennacherib, but this is indicated in the Babylonian chronicles, the Bible , and in later Assyrian records. Esarhaddons silence on the subject of the name of his fathers murderer may have been to avoid perpetuating any perceptions of instability. To one Babylonian historian, it was ": null
    },
    {
        "divine punishment": "divine punishment"
    },
    {
        " for what the king had done to Babylon.     Professor Simo Parpola, basing his findings on a fragmented letter surviving from that period, Assyrian and Babylonian Letters XI, No.1091. Originally translated by R. Harper. Chicago 1911. holds that Arda-Mulišši, known as ": null
    },
    {
        "Adrammelech": "adrammelech"
    },
    {
        " in the Bible , was the son who killed the King, and that a series of events beginning in 694  BC set the stage for the assassination. In 694 BC, Sennacheribs oldest son and heir-designate ": null
    },
    {
        "Assur-nãdin-sumi": "assur-nãdin-sumi"
    },
    {
        " was captured by Elamites and Babylonians and was removed to Elam, whereafter he disappears from the historical record. ": null
    },
    {
        "Arda-Mulišši": "arda-mulišši"
    },
    {
        ", the next eldest son, was expected to be the next heir-designate. However, ": null
    },
    {
        "Naqia Zakitu": "naqia"
    },
    {
        ", the kings second wife, used her influence to have the King proclaim her own son ": null
    },
    {
        "Esarhaddon": "esarhaddon"
    },
    {
        " the heir-designate. Sennacherib made all of Assyria and its subject peoples swear allegiance to the new crown prince.     Despite this, Arda-Mulišši continued to be a popular figure among the powerful at court. Over the following years, dislike of Esarhaddon grew in court, and simultaneously the popularity of Arda-Mulišši and his other brothers expanded. Worried over this turn of events, Sennacherib sent Crown Prince Esarhaddon to the safety of the western provinces. Arda-Mulišši, feeling that a decisive act would grant him the kingship, made a treaty of rebellion with co-conspirators and moved to kill his father. Sennacherib was then murdered, either by being stabbed directly by his son, or by being crushed as he prayed to ": null
    },
    {
        "Nisroch": "nisroch"
    },
    {
        " underneath a statue of a winged bull colossus that guarded the temple. ": null
    }
]