[
    {
        "The Senufo or Senufic languages  has around 42 languages spoken by the ": null
    },
    {
        "Senufo": "senufo people"
    },
    {
        " in the north of ": null
    },
    {
        "Ivory Coast": "ivory coast"
    },
    {
        ", the south of ": null
    },
    {
        "Mali": "mali"
    },
    {
        " and the southwest of ": null
    },
    {
        "Burkina Faso": "burkina faso"
    },
    {
        ". An isolated language, ": null
    },
    {
        "Nafaanra": "nafaanra language"
    },
    {
        ", is also spoken in the west of ": null
    },
    {
        "Ghana": "ghana"
    },
    {
        ". The Senufo languages constitute their own branch of the ": null
    },
    {
        "Atlantic–Congo": "atlantic–congo"
    },
    {
        " sub-family of the ": null
    },
    {
        "Niger–Congo languages": "niger–congo languages"
    },
    {
        ". Garber estimates the total number of ": null
    },
    {
        "Senufos": "senufo people"
    },
    {
        " at some 42 million; the ": null
    },
    {
        "Ethnologue": "ethnologue"
    },
    {
        ", based on various population estimates, counts 42 million.   The Senufo languages are bounded to the west by ": null
    },
    {
        "Mande languages": "mande languages"
    },
    {
        ", to the south by ": null
    },
    {
        "Kwa languages": "kwa languages"
    },
    {
        ", and to the north and east by Central ": null
    },
    {
        "Gur languages": "gur languages"
    },
    {
        ".     The Senufo languages are like the Gur languages in that they have a suffixal ": null
    },
    {
        "noun class": "noun class"
    },
    {
        " system and that verbs are marked for aspect. Most Gur languages to the north of Senufo have a two tone ": null
    },
    {
        "downstep": "downstep"
    },
    {
        " system, but the tonal system of the Senufo languages is mostly analysed as a three level tone system .     The Senufo languages have been influenced by the neighbouring Mande languages in numerous ways. Many words have been borrowed from the Mande languages ": null
    },
    {
        "Bambara": "bambara language"
    },
    {
        " and ": null
    },
    {
        "Jula": "jula language"
    },
    {
        ". Carlson notes that ‘it is probable that several grammatical constructions are calques on the corresponding Bambara constructions’. Like Mande languages, the Senufo languages have a ": null
    },
    {
        "subject–object–verb": "subject–object–verb"
    },
    {
        " constituent order": "constituent order"
    },
    {
        ", rather than the ": null
    },
    {
        "subject–verb–object": "subject–verb–object"
    },
    {
        " order which is more common in Gur and in ": null
    },
    {
        "Niger–Congo": "niger–congo languages"
    },
    {
        " as a whole.       Delafosse was the first linguist to write on the Senufo languages. He noted that the Senufo were often confused with the Mande, partly because use of Mande languages by the Senufo was widespread:   : langue mandé sest répandue parmi eux, des alliances nombreuses ont eu lieu... Cest là lorigine de la confusion que lon a faite souvent entre Mandé et Sénoufo ... alors que, au triple point de vue ethnographique, antropologique et linguistique, la différence est profonde entre ces deux familles.     In the influential classifications of Westermann and Bendor-Samuel , the Senufo languages were classified as Gur languages. Starting with Manessy however, this classification was called into doubt. In 42 John Naden, in his overview of the Gur family, stated that ‘ e remaining languages, especially Senufo, may well be no more closely related to Central Gur than to Guang or Togo Remnant, or than these to Central Gur or Volta-Comoe’ .       Early Senufo classifications were mainly geographically motivated, dividing the Senufo languages into Northern, Central, and Southern Senufo. In subsequent years, this terminology was adopted by several linguists working on Senufo languages . Mensah and Mills avoided this geographical terms but used mainly the same grouping, according to Garber 42 ": null
    },
    {
        "SIL International": "sil international"
    },
    {
        " in its Ethnologue subdivides the Senufo languages in six groups. Combining the two classifications results in the grouping below.     Northern Senufo ": null
    },
    {
        "Suppire–Mamara languages": "suppire–mamara languages"
    },
    {
        " Mamara": "mamara language"
    },
    {
        "   Nanerige": "nanerige language"
    },
    {
        "   Sucite": "sucite language"
    },
    {
        "   Supyire": "supyire language"
    },
    {
        "    Central Senufo ": null
    },
    {
        "Karaboro languages": "karaboro languages"
    },
    {
        " Eastern Karaboro": "kar language"
    },
    {
        "   Western Karaboro": "syer-tenyer language"
    },
    {
        "   Senari languages": "senari languages"
    },
    {
        " Cebaara": "cebaara language"
    },
    {
        "   Senara": "senara language"
    },
    {
        "    Nyarafolo": "nyarafolo language"
    },
    {
        " Kpalaga": "palaka language"
    },
    {
        "    Southern Senufo ": null
    },
    {
        "Tagwana–Djimini languages": "tagwana–djimini languages"
    },
    {
        " Djimini": "djimini language"
    },
    {
        "    Tagwana": "tagwana language"
    },
    {
        "   Nafaanra": "nafaanra language"
    }
]