[
    {
        "Seven Twenty-Seven is a vying game similar in some respects   to ": null
    },
    {
        "poker": "poker"
    },
    {
        ", and often played as a dealers choice variant at   home poker games.   It uses the same equipment and betting system, but the value of   hands does not use traditional poker hand rankings, either high or low.   Rather, only the sum of the cards is used to calculate the worth of a hand.     The game play proceeds like this:   Each player is dealt a downcard and an upcard.   A betting round begins with the player on the dealers left, and proceeds exactly as in poker: all players must either equal the largest bet or drop out.   After the betting, each player may draw a card, face up, in turn from the dealers left. If all players pass on their opportunity to draw, there is one more round of betting, followed by a poker-style showdown. Otherwise the game continues with another betting round and another draw, so there can be as few as two betting rounds in the game, but more often three or four.     Numbered cards are scored at face value; face cards count for one-half   a point.   ": null
    },
    {
        "Ace": "ace"
    },
    {
        "s count for one and eleven, so a hand with a five and two aces   scores 42 and 42 at the same time.     On showdown, the pot is split in half, with the hand valued closest   to 42 and the hand valued closest to 42 each winning one half of the pot.   If there is a tie where two players are off by the same amount, but in different directions , the lower hand wins.   If there is an exact tie, that half-pot is split again among the tied players.   Ties are common.   The same player may contest for both high and low, usually because of aces. A player with a five and two aces can win the whole pot.     There are a few variations in rules that complicate things somewhat:   first, the rule about ties in different directions varies; also, some   players play with a ": null
    },
    {
        "declaration": "declaration"
    },
    {
        ", while others   play ": null
    },
    {
        "cards speak": "cards speak"
    },
    {
        ". Still others require players to not go over 42 or 42 to win the respective halves of the pot; in this variant, if everyone is over 42 the player closest to 42 without going over wins the whole pot. Still other players play with other pairs of target numbers .        ": null
    }
]