[
    {
        "                 Sgt. Peppers Lonely Hearts Club Band is the eighth ": null
    },
    {
        "studio album": "studio album"
    },
    {
        " by the English ": null
    },
    {
        "rock": "rock music"
    },
    {
        " band ": null
    },
    {
        "the Beatles": "the beatles"
    },
    {
        ". Released on 42 May 42 in the United Kingdom and 42 June 42 in the United States, it spent 42 weeks at number one on the ": null
    },
    {
        "UK Albums Chart": "uk albums chart"
    },
    {
        " and 42 weeks at number one on the ": null
    },
    {
        "Billboard Top LPs": "billboard 200"
    },
    {
        " chart in the US. It was lauded by critics for its innovations in production, songwriting and graphic design, for bridging a cultural divide between ": null
    },
    {
        "popular music": "popular music"
    },
    {
        " and ": null
    },
    {
        "high art": "high art"
    },
    {
        ", and for providing a musical representation of ": null
    },
    {
        "its generation": "baby boomers"
    },
    {
        " and the ": null
    },
    {
        "contemporary counterculture": "counterculture of the 1960s"
    },
    {
        ". It won four ": null
    },
    {
        "Grammy Award": "grammy award"
    },
    {
        "s in 42 including ": null
    },
    {
        "Album of the Year": "grammy award for album of the year"
    },
    {
        ", the first rock ": null
    },
    {
        "LP": "lp record"
    },
    {
        " to receive this honour.     In August 42 the Beatles permanently retired from touring and began a three-month holiday. During a return flight to ": null
    },
    {
        "London": "london"
    },
    {
        " in November, ": null
    },
    {
        "Paul McCartney": "paul mccartney"
    },
    {
        " had an idea for a song involving an ": null
    },
    {
        "Edwardian": "edwardian era"
    },
    {
        " military band that formed the impetus of the Sgt. Pepper concept. Sessions began on 42 November at ": null
    },
    {
        "EMI": "emi"
    },
    {
        "s ": null
    },
    {
        "Abbey Road Studios": "abbey road studios"
    },
    {
        " with two compositions inspired by the Beatles youth, ": null
    },
    {
        "Strawberry Fields Forever": "strawberry fields forever"
    },
    {
        " and ": null
    },
    {
        "Penny Lane": "penny lane"
    },
    {
        " , but after pressure from EMI, the songs were released as a ": null
    },
    {
        "double A-side": "double a-side"
    },
    {
        " single and not included on the album.     In February 42 after recording the title track ": null
    },
    {
        "Sgt. Peppers Lonely Hearts Club Band": "sgt. peppers lonely hearts club band"
    },
    {
        " , McCartney suggested that the Beatles should release an entire album representing a performance by the fictional Sgt. Pepper band. This ": null
    },
    {
        "alter ego": "alter ego"
    },
    {
        " group would give them the freedom to experiment musically. During the recording sessions, the band furthered the technological progression they had made with their 42 album  Revolver . Knowing they would not have to perform the tracks live, they adopted an experimental approach to composition and recording on songs such as ": null
    },
    {
        "A Day in the Life": "a day in the life"
    },
    {
        " , ": null
    },
    {
        "Being for the Benefit of Mr. Kite!": "being for the benefit of mr. kite!"
    },
    {
        " and ": null
    },
    {
        "Within You Without You": "within you without you"
    },
    {
        " . Producer ": null
    },
    {
        "George Martin": "george martin"
    },
    {
        " and engineer ": null
    },
    {
        "Geoff Emerick": "geoff emerick"
    },
    {
        " helped realise the groups ideas by approaching the ": null
    },
    {
        "studio as an instrument": "recording studio as an instrument"
    },
    {
        ", applying ": null
    },
    {
        "orchestra": "orchestra"
    },
    {
        "l ": null
    },
    {
        "overdub": "overdub"
    },
    {
        "s, sound effects and other methods of tape manipulation. Recording was completed on 42 April 42 The cover, depicting the Beatles posing in front of a tableau of celebrities and historical figures, was designed by the British pop artists ": null
    },
    {
        "Peter Blake": "peter blake"
    },
    {
        " and ": null
    },
    {
        "Jann Haworth": "jann haworth"
    },
    {
        ".     Sgt. Pepper is regarded by musicologists as an early ": null
    },
    {
        "concept album": "concept album"
    },
    {
        " that advanced the use of ": null
    },
    {
        "extended form": "cyclic form"
    },
    {
        " in popular music while continuing the artistic maturation seen on the Beatles preceding releases. An important work of British ": null
    },
    {
        "psychedelia": "psychedelic music"
    },
    {
        ", the album incorporates a range of stylistic influences, including ": null
    },
    {
        "vaudeville": "vaudeville"
    },
    {
        ", ": null
    },
    {
        "circus": "circus music"
    },
    {
        ", ": null
    },
    {
        "music hall": "music hall"
    },
    {
        ", ": null
    },
    {
        "avant-garde": "avant-garde music"
    },
    {
        ", and ": null
    },
    {
        "Western": "classical music"
    },
    {
        " and ": null
    },
    {
        "Indian classical music": "indian classical music"
    },
    {
        ". It is described as one of the first ": null
    },
    {
        "art rock": "art rock"
    },
    {
        " LPs, aiding the development of ": null
    },
    {
        "progressive rock": "progressive rock"
    },
    {
        ", and is credited with marking the beginning of the ": null
    },
    {
        "album era": "album era"
    },
    {
        ". In 42 the ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        " placed Sgt. Pepper in the ": null
    },
    {
        "National Recording Registry": "national recording registry"
    },
    {
        " as culturally, historically, or aesthetically significant . In 42 and in a revised list published in 42  Rolling Stone  ranked the album number one in its list of the ": null
    },
    {
        "42 Greatest Albums of All Time": "rolling stones 500 greatest albums of all time"
    },
    {
        " . As of 42 it has sold more than 42 million copies worldwide, making it one of the ": null
    },
    {
        "best-selling albums": "list of best-selling albums"
    },
    {
        " of all time, and it remains the UKs best-selling studio album. Professor Kevin Dettmar, writing in The Oxford Encyclopedia of British Literature, described it as the most important and influential rock-and-roll album ever recorded .                By 42 the Beatles had grown weary of live performance. In ": null
    },
    {
        "John Lennon": "john lennon"
    },
    {
        "s opinion, they could send out four waxworks  ... and that would satisfy the crowds. Beatles concerts are nothing to do with music anymore. Theyre just bloody tribal rites.  In June that year, two days after finishing the album  Revolver , the group set off for a ": null
    },
    {
        "tour that started in West Germany": "the beatles 1966 tour of germany, japan and the philippines"
    },
    {
        ". While in ": null
    },
    {
        "Hamburg": "hamburg"
    },
    {
        " they received an anonymous telegram stating: Do not go to Tokyo. Your life is in danger.  The threat was taken seriously in light of the controversy surrounding the tour among Japans religious and conservative groups, with particular opposition to the Beatles planned performances at the sacred ": null
    },
    {
        "Nippon Budokan": "nippon budokan"
    },
    {
        " arena. As an added precaution, 42 police were mobilised and tasked with protecting the group, who were transported from hotels to concert venues in armoured vehicles. ; . The Beatles then performed in the ": null
    },
    {
        "Philippines": "philippines"
    },
    {
        ", where they were threatened and manhandled by its citizens for not visiting First Lady ": null
    },
    {
        "Imelda Marcos": "imelda marcos"
    },
    {
        ". The group were angry with their manager, ": null
    },
    {
        "Brian Epstein": "brian epstein"
    },
    {
        ", for insisting on what they regarded as an exhausting and demoralising itinerary.          The publication in the US of Lennons remarks about the Beatles being ": null
    },
    {
        "more popular than Jesus": "more popular than jesus"
    },
    {
        " then embroiled the band in controversy and protest in Americas ": null
    },
    {
        "Bible Belt": "bible belt"
    },
    {
        ". A public apology eased tensions, but a ": null
    },
    {
        "US tour in August": "the beatles 1966 us tour"
    },
    {
        " that was marked by reduced ticket sales, relative to the groups record attendances in 42 and subpar performances proved to be their last. ; : reduced ticket sales, record attendances in 42; : subpar performances. The author ": null
    },
    {
        "Nicholas Schaffner": "nicholas schaffner"
    },
    {
        " writes:          On the Beatles return to England, rumours began to circulate that they had decided to break up. ": null
    },
    {
        "George Harrison": "george harrison"
    },
    {
        " informed Epstein that he was leaving the band, but was persuaded to stay on the assurance that there would be no more tours. The group took a three-month break, during which they focused on individual interests. Harrison travelled to India for six weeks to study the ": null
    },
    {
        "sitar": "sitar"
    },
    {
        " under the instruction of ": null
    },
    {
        "Ravi Shankar": "ravi shankar"
    },
    {
        " and develop his interest in ": null
    },
    {
        "Hindu": "hinduism"
    },
    {
        " philosophy. Having been the last of the Beatles to concede that their live performances had become futile, ": null
    },
    {
        "Paul McCartney": "paul mccartney"
    },
    {
        " collaborated with Beatles producer ": null
    },
    {
        "George Martin": "george martin"
    },
    {
        " on ": null
    },
    {
        "the soundtrack": "the family way"
    },
    {
        " for the film  The Family Way  and holidayed in ": null
    },
    {
        "Kenya": "kenya"
    },
    {
        " with ": null
    },
    {
        "Mal Evans": "mal evans"
    },
    {
        ", one of the Beatles ": null
    },
    {
        "tour manager": "tour manager"
    },
    {
        "s. Lennon acted in the film  How I Won the War  and attended art showings, such as one at the ": null
    },
    {
        "Indica Gallery": "indica gallery"
    },
    {
        " where he met his future wife ": null
    },
    {
        "Yoko Ono": "yoko ono"
    },
    {
        ". ": null
    },
    {
        "Ringo Starr": "ringo starr"
    },
    {
        " used the break to spend time with his wife ": null
    },
    {
        "Maureen": "maureen starkey tigrett"
    },
    {
        " and son ": null
    },
    {
        "Zak": "zak starkey"
    },
    {
        ". ; .       While in London without his bandmates, McCartney took the hallucinogenic drug ": null
    },
    {
        "LSD": "lysergic acid diethylamide"
    },
    {
        " for the first time, having long resisted Lennon and Harrisons insistence that he join them and Starr in experiencing its perception-heightening effects. According to author Jonathan Gould, this initiation into LSD afforded McCartney the expansive new sense of possibility that defined the groups next project, Sgt. Peppers Lonely Hearts Club Band. Gould adds that McCartneys succumbing to peer pressure allowed Lennon to play the role of psychedelic guide to his songwriting partner, thereby facilitating a closer collaboration between the two than had been evident since early in the Beatles career. For his part, Lennon had turned deeply introspective during the filming of How I Won the War in southern Spain in September 42 His anxiety over his and the Beatles future was reflected in ": null
    },
    {
        "Strawberry Fields Forever": "strawberry fields forever"
    },
    {
        " , a song that would provide the initial theme, regarding a Liverpool childhood, of the new album. On his return to London, Lennon embraced the citys arts culture, of which McCartney was a part, and shared his bandmates interest in ": null
    },
    {
        "avant-garde": "avant-garde music"
    },
    {
        " and ": null
    },
    {
        "electronic-music": "electronic music"
    },
    {
        " composers such as ": null
    },
    {
        "Karlheinz Stockhausen": "karlheinz stockhausen"
    },
    {
        ", ": null
    },
    {
        "John Cage": "john cage"
    },
    {
        " and ": null
    },
    {
        "Luciano Berio": "luciano berio"
    },
    {
        ".     In November, during his and Evans return flight from Kenya, McCartney had an idea for a song that eventually formed the impetus of the Sgt. Pepper concept. His idea involved an ": null
    },
    {
        "Edwardian-era": "edwardian era"
    },
    {
        " military band, for which Evans invented a name in the style of contemporary San Francisco-based groups such as ": null
    },
    {
        "Big Brother and the Holding Company": "big brother and the holding company"
    },
    {
        " and ": null
    },
    {
        "Quicksilver Messenger Service": "quicksilver messenger service"
    },
    {
        ". In February 42 McCartney suggested that the Beatles should record an entire album that would represent a performance by the fictional band. This alter ego group would give them the freedom to experiment musically by releasing them from their image as Beatles. Martin remembered:          ": null
    },
    {
        "Ian MacDonald": "ian macdonald"
    },
    {
        " writes that when reviewing their rivals recent work in late 42 the Beatles identified the most significant LP as ": null
    },
    {
        "the Beach Boys": "the beach boys"
    },
    {
        "  Pet Sounds , which ": null
    },
    {
        "Brian Wilson": "brian wilson"
    },
    {
        ", the bands leader, had created in response to the Beatles  Rubber Soul  album. McCartney said he was highly impressed with the songs harmonic structures and the choice of instruments used in Wilsons musical arrangements, and that these elements encouraged him to think the Beatles could get further out than the Beach Boys had. He added: we were inspired by it and nicked a few ideas.  According to author ": null
    },
    {
        "Kenneth Womack": "kenneth womack"
    },
    {
        ", the Beach Boys subsequent release, the ": null
    },
    {
        "Good Vibrations": "good vibrations"
    },
    {
        " single, was viewed by the Beatles and Martin as a direct challenge to their supremacy. McCartney identified Pet Sounds as his main musical inspiration for Sgt. Pepper although he said it lacked the avant-garde quality he was seeking.     McCartney envisioned the Beatles alter egos being able to do a bit of ": null
    },
    {
        "B.B. King": "b.b. king"
    },
    {
        ", a bit of Stockhausen, a bit of ": null
    },
    {
        "Albert Ayler": "albert ayler"
    },
    {
        ", a bit of Ravi Shankar, a bit of Pet Sounds, a bit of ": null
    },
    {
        "the Doors": "the doors"
    },
    {
        " . In a 42 interview, Harrison said that the Beatles ongoing success had encouraged them to continue developing musically and that, given their standing, We can do things that please us without conforming to the standard pop idea. We are not only involved in pop music, but all music.   Freak Out!  by ": null
    },
    {
        "the Mothers of Invention": "the mothers of invention"
    },
    {
        " has also been cited as having influenced Sgt. Pepper. According to the author ": null
    },
    {
        "Philip Norman": "philip norman"
    },
    {
        ", during the Sgt. Pepper recording sessions McCartney repeatedly stated: This is our Freak Out!  The music journalist Chet Flippo states that McCartney was inspired to record a ": null
    },
    {
        "concept album": "concept album"
    },
    {
        " after hearing Freak Out!              Martin recalled that Sgt. Pepper grew naturally out of Revolver , marking an era of almost continuous technological experimentation . : continuous technological experimentation ; : Sgt. Pepper grew naturally out of Revolver . According to ": null
    },
    {
        "Geoff Emerick": "geoff emerick"
    },
    {
        ", the Beatles recording engineer, the major difference between the two albums was that, with Sgt. Pepper, there was no absolute deadline for completion. Sessions began on 42 November 42 in Studio Two at EMI Studios , marking the first time that the Beatles had come together since September. Afforded the luxury of a nearly limitless recording budget, the band booked open-ended sessions that started at 42 pm and allowed them to work as late as they wanted. They began with Strawberry Fields Forever , followed by two other songs that were thematically linked to their childhoods: ": null
    },
    {
        "When Im Sixty-Four": "when im sixty-four"
    },
    {
        " , the first session for which took place on 42 December, and ": null
    },
    {
        "Penny Lane": "penny lane"
    },
    {
        " . ; . Strawberry Fields Forever made prominent use of ": null
    },
    {
        "Mellotron": "mellotron"
    },
    {
        ", a keyboard instrument on which the keys triggered tape-recordings of a variety of instruments, enabling its user to play keyboard parts using those voices.     Strawberry Fields Forever and Penny Lane were subsequently released as a ": null
    },
    {
        "double A-side": "double a-side"
    },
    {
        " in February 42 after EMI and Epstein pressured Martin for a single. When it failed to reach number one in the UK, British press agencies speculated that the groups run of success might have ended, with headlines such as Beatles Fail to Reach the Top , First Time in Four Years and Has the Bubble Burst?  In keeping with the bands approach to their previously issued singles, the songs were then excluded from Sgt. Pepper. Martin later described the decision to drop these two songs as the biggest mistake of my professional life . In his judgment, Strawberry Fields Forever , which he and the band spent an unprecedented 42 hours of studio time recording, set the agenda for the whole album . : 42 hours of studio time; : set the agenda for the whole album . He explained: It was going to be a record  ... couldnt be performed live: they were designed to be studio productions and that was the difference.  McCartney declared: Now our performance is that record. : McCartneys goal; : Now our performance is that record.        According to the musicologist ": null
    },
    {
        "Walter Everett": "walter everett"
    },
    {
        ", Sgt. Pepper marks the beginning of McCartneys ascendancy as the Beatles dominant creative force. He wrote more than half of the albums material while asserting increasing control over the recording of his compositions. In an effort to get the right sound, the Beatles attempted numerous re-takes of McCartneys song ": null
    },
    {
        "Getting Better": "getting better"
    },
    {
        " . When the decision was made to re-record the basic track, Starr was summoned to the studio, but called off soon afterwards as the focus switched from rhythm to vocal tracking. Preferring to overdub his bass part last, McCartney tended to play other instruments when recording a songs backing track. This approach afforded him the time to devise bass lines that were melodically adventurous – one of the qualities he especially admired in Wilsons work on Pet Sounds – and complemented the songs final arrangement. ; : one of the qualities he especially admired on Pet Sounds . McCartney played a ": null
    },
    {
        "grand piano": "grand piano"
    },
    {
        " on ": null
    },
    {
        "A Day in the Life": "a day in the life"
    },
    {
        " and a ": null
    },
    {
        "Lowrey organ": "lowrey organ"
    },
    {
        " on ": null
    },
    {
        "Lucy in the Sky with Diamonds": "lucy in the sky with diamonds"
    },
    {
        " , while Martin played a ": null
    },
    {
        "Hohner Pianet": "hohner pianet"
    },
    {
        " on Getting Better , a ": null
    },
    {
        "harpsichord": "harpsichord"
    },
    {
        " on ": null
    },
    {
        "Fixing a Hole": "fixing a hole"
    },
    {
        " and a ": null
    },
    {
        "harmonium": "pump organ"
    },
    {
        " on ": null
    },
    {
        "Being for the Benefit of Mr. Kite!": "being for the benefit of mr. kite!"
    },
    {
        " : Lowrey organ on Lucy in the Sky with Diamonds ; : Hohner Pianet on Getting Better , : harpsichord on Fixing a Hole ; : harmonium on Being for the Benefit of Mr. Kite! ; : grand piano on A Day in the Life .     Although Harrisons role as lead guitarist was limited during the sessions, Everett considers that his contribution to the album is strong in several ways.  In addition to providing sitar and ": null
    },
    {
        "tambura": "tanpura"
    },
    {
        " on his composition ": null
    },
    {
        "Within You Without You": "within you without you"
    },
    {
        " , and ": null
    },
    {
        "swarmandal": "swarmandal"
    },
    {
        " on Strawberry Fields Forever , Harrison played tambura on Lucy in the Sky with Diamonds and Getting Better . As on Revolver, the Beatles also increasingly used session musicians, particularly for classical-inspired arrangements. Norman comments that Lennons prominent vocal on some of McCartneys songs hugely enhanced their atmosphere , particularly ": null
    },
    {
        "Lovely Rita": "lovely rita"
    },
    {
        " .     Within an hour of completing the last overdubs on the albums songs, on 42 April 42 the group returned to Harrisons ": null
    },
    {
        "Only a Northern Song": "only a northern song"
    },
    {
        " , the basic track of which they had taped in February. The Beatles overdubbed random sounds and instrumentation before submitting it as the first of four new songs they were contracted to supply to ": null
    },
    {
        "United Artists": "united artists"
    },
    {
        " for inclusion in the animated film  Yellow Submarine . In author ": null
    },
    {
        "Mark Lewisohn": "mark lewisohn"
    },
    {
        "s description, it was a curious session, but one that demonstrated the Beatles tremendous appetite for recording . During the Sgt. Pepper sessions, the band also recorded ": null
    },
    {
        "Carnival of Light": "carnival of light"
    },
    {
        " , a McCartney-led experimental piece created for the Million Volt Light and Sound Rave, held at the ": null
    },
    {
        "Roundhouse Theatre": "the roundhouse"
    },
    {
        " on 42 January and 42 February.            Sgt. Pepper was recorded using ": null
    },
    {
        "four-track": "multitrack recording"
    },
    {
        " equipment. Although eight-track tape recorders were available in the US, the first units were not operational in commercial studios in London until late 42 As with previous Beatles albums, the Sgt. Pepper recordings made extensive use of ": null
    },
    {
        "reduction mixing": "ping-pong recording"
    },
    {
        ", a technique in which one to four tracks from one recorder are mixed and ": null
    },
    {
        "dubbed": "dubbing"
    },
    {
        " down onto a master four-track machine, enabling the engineers to give the group a virtual multitrack studio.  EMIs ": null
    },
    {
        "Studer": "studer"
    },
    {
        " J42 four-track machines were well suited to reduction mixing, as the high quality of the recordings that they produced minimised the increased noise associated with the process. When recording the orchestra for A Day in the Life , Martin synchronised a four-track recorder playing the Beatles backing track to another one taping the orchestral overdub. The engineer ": null
    },
    {
        "Ken Townsend": "ken townsend"
    },
    {
        " devised a method for accomplishing this by using a 42  Hz control signal between the two machines.          The production on Strawberry Fields Forever was especially complex, involving the innovative splicing of two takes that were recorded in different ": null
    },
    {
        "tempo": "tempo"
    },
    {
        "s and ": null
    },
    {
        "pitches": "pitch"
    },
    {
        ". Emerick remembers that during the recording of Revolver, we had got used to being asked to do the impossible, and we knew that the word no didnt exist in the Beatles vocabulary.  A key feature of Sgt. Pepper is Martin and Emericks liberal use of ": null
    },
    {
        "signal processing": "signal processing"
    },
    {
        " to shape the sound of the recording, which included the application of ": null
    },
    {
        "dynamic range compression": "dynamic range compression"
    },
    {
        ", ": null
    },
    {
        "reverberation": "reverberation"
    },
    {
        " and ": null
    },
    {
        "signal limiting": "limiter"
    },
    {
        ". Relatively new modular effects units were used, such as running voices and instruments through a ": null
    },
    {
        "Leslie speaker": "leslie speaker"
    },
    {
        ". Several innovative production techniques feature prominently on the recordings, including ": null
    },
    {
        "direct injection": "di unit"
    },
    {
        ", ": null
    },
    {
        "pitch control": "pitch control"
    },
    {
        " and ": null
    },
    {
        "ambiophonics": "ambiophonics"
    },
    {
        ". The bass part on ": null
    },
    {
        "Sgt. Peppers Lonely Hearts Club Band": "sgt. peppers lonely hearts club band"
    },
    {
        " was the first example of the Beatles recording via direct injection , which Townsend devised as a method for plugging electric guitars directly into the recording console. In Womacks opinion, the use of DI on the albums title track afforded McCartneys bass with richer textures and tonal clarity .     Some of the mixing employed ": null
    },
    {
        "automatic double tracking": "automatic double tracking"
    },
    {
        " , a system that uses tape recorders to create a simultaneous doubling of a sound. ADT was invented by Townsend during the Revolver sessions in 42 especially for the Beatles, who had regularly expressed a desire for a technical alternative to having to record doubled lead vocals. Another important effect was ": null
    },
    {
        "varispeeding": "pitch shift"
    },
    {
        ", a technique that the Beatles had also used extensively on Revolver. Martin cites Lucy in the Sky with Diamonds as having the most variations of tape speed on Sgt. Pepper. During the recording of Lennons vocals, the tape speed was reduced from 42 cycles per second to 42 which produced a higher and thinner-sounding track when played back at the normal speed. For the albums title track, the recording of Starrs drum kit was enhanced by the use of ": null
    },
    {
        "damping": "damping"
    },
    {
        " and ": null
    },
    {
        "close-miking": "microphone practicebasic techniques"
    },
    {
        ". MacDonald credits the new recording technique with creating a three-dimensional sound that, along with other Beatles innovations, engineers in the US would soon adopt as standard practice.     Sgt. Pepper was the first pop album to be mastered without the momentary gaps that are typically placed between tracks as a point of demarcation. It made use of two ": null
    },
    {
        "crossfades": "fade crossfading"
    },
    {
        " that blended songs together, giving the impression of a continuous live performance. ; .  Although both ": null
    },
    {
        "stereo": "stereophonic sound"
    },
    {
        " and ": null
    },
    {
        "monaural": "monaural"
    },
    {
        " mixes of the album were prepared, the Beatles were minimally involved in what they regarded as the less important stereo mix sessions, leaving the task to Martin and Emerick. Emerick recalls: We spent three weeks on the mono mixes and maybe three days on the stereo.  He estimates that they spent 42 hours on the LP, more than 42 times that of the first Beatles album,  Please Please Me , which cost £42 to produce. : the recording of Please Please Me cost £42 ; : they spent 42 hours recording Sgt. Pepper. The final cost of Sgt. Pepper was approximately £42 . The album was completed on 42 April 42 with the recording of random noises and voices that were included on the ": null
    },
    {
        "run-out groove": "phonograph recordstructure"
    },
    {
        ", preceded by a high-pitched tone, inaudible to most human ears, that could be heard by dogs.       Author Robert Rodriguez writes that while Lennon, Harrison and Starr embraced the creative freedom afforded by McCartneys band-within-a-band idea, they went along with the concept with varying degrees of enthusiasm . According to ": null
    },
    {
        "Barry Miles": "barry miles"
    },
    {
        ", Lennon resented McCartneys direction of the band as well as how, aside from Strawberry Fields Forever , he himself was now supplying songs to order rather than writing from the heart as he had on Revolver. Everett describes Starr as having been largely bored during the sessions, with the drummer later lamenting: The biggest memory I have of Sgt. Pepper  ... is I learned to play chess . Speaking in 42 Harrison said he had little interest in McCartneys concept of a fictitious group and that, after his experiences in India, my heart was still out there … I was losing interest in being fab at that point.  Harrison added that, having enjoyed recording Rubber Soul and Revolver, he disliked how the groups approach on Sgt. Pepper became an assembly process whereby, A lot of the time it ended up with just Paul playing the piano and Ringo keeping the tempo, and we werent allowed to play as a band as much.      After finishing Sgt. Pepper, the Beatles took an ": null
    },
    {
        "acetate disc": "acetate disc"
    },
    {
        " of the album to the American singer ": null
    },
    {
        "Cass Elliot": "cass elliot"
    },
    {
        "s flat off ": null
    },
    {
        "Kings Road": "kings road"
    },
    {
        " in ": null
    },
    {
        "Chelsea": "chelsea, london"
    },
    {
        ", where at six in the morning they played it at full volume with speakers set in open window frames. The groups friend and former press agent, ": null
    },
    {
        "Derek Taylor": "derek taylor"
    },
    {
        ", remembered that residents of the neighbourhood opened their windows and listened without complaint to what they understood to be unreleased Beatles music.         Sgt. Pepper, according to American musicologist Allan F. Moore, is composed mainly of ": null
    },
    {
        "rock": "rock music"
    },
    {
        " and ": null
    },
    {
        "pop music": "pop music"
    },
    {
        ", while Michael Hannan and Naphtali Wagner both believed it is an album of various genres; Hannan said it features a broad variety of musical and theatrical genres . : The album is made up of a broad variety of musical and theatrical genres ; : ": null
    },
    {
        "rock": "rock music"
    },
    {
        " and ": null
    },
    {
        "pop": "pop music"
    },
    {
        "; : the multigenre nature of Sgt. Pepper . According to Hannan and Wagner, the music incorporates the stylistic influences of ": null
    },
    {
        "rock and roll": "rock and roll"
    },
    {
        ", ": null
    },
    {
        "vaudeville": "vaudeville"
    },
    {
        ", ": null
    },
    {
        "big band": "big band"
    },
    {
        ", ": null
    },
    {
        "piano jazz": "jazz piano"
    },
    {
        ", ": null
    },
    {
        "blues": "blues"
    },
    {
        ", ": null
    },
    {
        "chamber": "chamber music"
    },
    {
        ", ": null
    },
    {
        "circus": "circus music"
    },
    {
        ", ": null
    },
    {
        "music hall": "music hall"
    },
    {
        ", avant-garde, and ": null
    },
    {
        "Western": "classical music"
    },
    {
        " and ": null
    },
    {
        "Indian classical music": "indian classical music"
    },
    {
        ". : ": null
    },
    {
        "music hall": "music hall"
    },
    {
        " and ": null
    },
    {
        "blues": "blues"
    },
    {
        "; ; ": null
    },
    {
        "rock and roll": "rock and roll"
    },
    {
        ", ": null
    },
    {
        "vaudeville": "vaudeville"
    },
    {
        ", ": null
    },
    {
        "big band": "big band"
    },
    {
        ", ": null
    },
    {
        "piano jazz": "jazz piano"
    },
    {
        ", ": null
    },
    {
        "chamber": "chamber music"
    },
    {
        ", ": null
    },
    {
        "circus": "circus music"
    },
    {
        ", ": null
    },
    {
        "avant-garde": "avant-garde music"
    },
    {
        ", ": null
    },
    {
        "Western": "classical music"
    },
    {
        " and ": null
    },
    {
        "Indian classical music": "indian classical music"
    },
    {
        ". Wagner felt the albums music reconciles the diametrically opposed aesthetic ideals of classical and ": null
    },
    {
        "psychedelia": "psychedelia"
    },
    {
        ", achieving a psycheclassical synthesis of the two forms. Musicologist John Covach describes Sgt. Pepper as ": null
    },
    {
        "proto-prog": "proto-prog"
    },
    {
        "ressive .          Concerns that some of the lyrics in Sgt. Pepper refer to ": null
    },
    {
        "recreational drug use": "recreational drug use"
    },
    {
        " led to the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " banning several songs from British radio, such as A Day in the Life because of the phrase Id love to turn you on , with the BBC claiming that it could encourage a permissive attitude towards drug-taking.  Although Lennon and McCartney denied any drug-related interpretation of the song at the time, McCartney later suggested that the line referred to either drugs or sex. : Lennon and McCartneys contemporary denial of an intentional reference to illicit drugs in the lyrics to A Day in the Life ; : McCartneys immediate denial in  Melody Maker ; : McCartney later suggested that the line was deliberately written to ambiguously refer to either illicit drugs or sexual activity. The meaning of Lucy in the Sky with Diamonds became the subject of speculation, as many believed that the title was code for LSD. The song was banned by the BBC, as was Being for the Benefit of Mr. Kite! , for its reference to Henry the Horse , a phrase that contains two common slang terms for ": null
    },
    {
        "heroin": "heroin"
    },
    {
        ". Fans speculated that Henry the Horse was a drug dealer and Fixing a Hole was a reference to heroin use. Others noted lyrics such as I get high from ": null
    },
    {
        "With a Little Help from My Friends": "with a little help from my friends"
    },
    {
        " , take some tea – slang for ": null
    },
    {
        "cannabis": "cannabis"
    },
    {
        " use – from ": null
    },
    {
        "Lovely Rita": "lovely rita"
    },
    {
        " and digging the weeds from When Im Sixty-Four .     The author Sheila Whiteley attributes Sgt. Pepper underlying philosophy not only to the ": null
    },
    {
        "drug culture": "drug culture"
    },
    {
        ", but also to ": null
    },
    {
        "metaphysics": "metaphysics"
    },
    {
        " and the non-violent approach of the ": null
    },
    {
        "flower power": "flower power"
    },
    {
        " movement. The musicologist Oliver Julien views the album as an embodiment of the social, the musical, and more generally, the cultural changes of the 42s . The albums primary value, according to Moore, is its ability to capture, more vividly than almost anything contemporaneous, its own time and place . Whiteley agrees, crediting the album with provid a historical snapshot of England during the run-up to the Summer of Love . Several scholars have applied a ": null
    },
    {
        "hermeneutic": "hermeneutics"
    },
    {
        " strategy to their analysis of Sgt. Pepper lyrics, identifying loss of innocence and the dangers of overindulgence in fantasies or illusions as the most prominent themes.              Sgt. Pepper opens with the title track, starting with 42 seconds of the combined sounds of a ": null
    },
    {
        "pit orchestra": "pit orchestra"
    },
    {
        " warming up and an audience waiting for a concert, creating the illusion of the album as a live performance. : pit orchestra and audience; : the illusion of a live performance; : 42 seconds of introductory ambiance.  Womack describes the lyric as a revolutionary moment in the creative life of the Beatles that bridges the gap – sometimes referred to as the ": null
    },
    {
        "fourth wall": "fourth wall"
    },
    {
        " – between the audience and the artist. He argues that, paradoxically, the lyrics exemplify the mindless rhetoric of rock concert banter while mock the very notion of a pop albums capacity for engendering authentic interconnection between artist and audience . In his view, the mixed message ironically serves to distance the group from their fans while simultaneously gesturing toward them as alter egos, an authorial quality that he considers to be the songs most salient feature .     Womack credits the recordings use of a ": null
    },
    {
        "brass ensemble": "brass band"
    },
    {
        " with ": null
    },
    {
        "distorted": "distortion"
    },
    {
        " electric guitars as an early example of rock fusion. MacDonald agrees, describing the track as an ": null
    },
    {
        "overture": "overture"
    },
    {
        " rather than a song, and a shrewd fusion of Edwardian variety orchestra and contemporary ": null
    },
    {
        "hard rock": "hard rock"
    },
    {
        ". The musicologist Michael Hannan describes the tracks unorthodox stereo mix as typical of the album , with the lead vocal in the right speaker during the verses, but in the left during the chorus and ": null
    },
    {
        "middle eight": "thirty-two-bar formmiddle eight"
    },
    {
        ". The songs arrangement utilises a rock and roll oriented ": null
    },
    {
        "Lydian mode": "lydian mode"
    },
    {
        " chord progression": "chord progression"
    },
    {
        " during the introduction and verses that is built on ": null
    },
    {
        "parallel": "parallel keyparallel chord"
    },
    {
        " sevenths": "seventh chord"
    },
    {
        ", which Everett describes as the songs strength . The five-": null
    },
    {
        "bar": "bar"
    },
    {
        " bridge": "bridge"
    },
    {
        " is filled by an Edwardian ": null
    },
    {
        "horn": "french horn"
    },
    {
        " quartet": "quartet"
    },
    {
        " that Martin arranged from a McCartney vocal melody. The track turns to the ": null
    },
    {
        "pentatonic scale": "pentatonic scale"
    },
    {
        " for the chorus, where its ": null
    },
    {
        "blues rock": "blues rock"
    },
    {
        " progression is augmented by the use of electric guitar ": null
    },
    {
        "power chord": "power chord"
    },
    {
        "s played in ": null
    },
    {
        "consecutive fifths": "consecutive fifths"
    },
    {
        ".       McCartney acts as the ": null
    },
    {
        "master of ceremonies": "master of ceremonies"
    },
    {
        " near the end of the Sgt. Peppers Lonely Hearts Club Band track, introducing Starr as an alter ego named Billy Shears. The song then segues into With a Little Help from My Friends amid a moment of crowd cheer that Martin had recorded during a Beatles concert at the ": null
    },
    {
        "Hollywood Bowl": "hollywood bowl"
    },
    {
        ". Womack credits Starrs ": null
    },
    {
        "baritone": "baritone"
    },
    {
        " lead vocals with imparting an element of earnestness in sharp contrast with the ironic distance of the title track . Lennon and McCartneys ": null
    },
    {
        "call-and-response": "call and response"
    },
    {
        " backing vocals": "backing vocalist"
    },
    {
        " ask Starr questions about the meaning of friendship and true love. In the final verse, the question and answer relationship is reversed, as the backing singers ask leading questions and Starr provides unequivocal answers. In MacDonalds opinion, the lyric is at once communal and personal  ... meant as a gesture of inclusivity; everyone could join in.  Womack agrees, identifying necessity of community as the songs central ethical tenet , a theme that he ascribes to the album as a whole. Everett notes the tracks use of a ": null
    },
    {
        "major": "major and minor"
    },
    {
        " key ": null
    },
    {
        "double-plagal cadence": "cadence"
    },
    {
        " that would become commonplace in pop music following the release of Sgt. Pepper. The song ends on a vocal high note that McCartney, Harrison and Lennon encouraged Starr to achieve despite his lack of confidence as a singer.            Despite widespread suspicion that the title of Lucy in the Sky with Diamonds contained a hidden reference to LSD, Lennon insisted that it was derived from a ": null
    },
    {
        "pastel": "pastel"
    },
    {
        " drawing by his four-year-old son ": null
    },
    {
        "Julian": "julian lennon"
    },
    {
        ". A hallucinatory chapter from ": null
    },
    {
        "Lewis Carroll": "lewis carroll"
    },
    {
        " 42 novel  Through the Looking-Glass , a favourite of Lennons, inspired the songs atmosphere. ;  McCartney later commented that although the titles apparent drug reference was unintentional, the lyrics were purposely written for a psychedelic song.     The first verse begins with what Womack characterises as an invitation in the form of an imperative through the line: Picture yourself in a boat on a river , and continues with imaginative imagery, including tangerine trees , rocking horse people and newspaper taxis . In Womacks view, with the merging of Lennons lyrics and McCartneys ": null
    },
    {
        "Lowrey organ": "lowrey organ"
    },
    {
        " introduction the Beatles achieve their most vivid instance of musical timbre . In addition to the tambura drone, Harrison contributed a lead guitar part that doubles Lennons vocal over the verses in the style of a ": null
    },
    {
        "sarangi": "sarangi"
    },
    {
        " player accompanying an Indian ": null
    },
    {
        "khyal": "khyal"
    },
    {
        " singer. The musicologist ": null
    },
    {
        "Tim Riley": "tim riley"
    },
    {
        " identifies the track as a moment in the album, the material world is completely clouded in the mythical by both text and musical atmosphere . According to MacDonald, the lyric explicitly recreates the psychedelic experience .       MacDonald considers Getting Better to contain the most ebullient performance on Sgt. Pepper. Womack credits the tracks driving rock sound with distinguishing it from the albums overtly psychedelic material; its lyrics inspire the listener to usurp the past by living well and flourishing in the present . He cites it as a strong example of Lennon and McCartneys collaborative songwriting, particularly Lennons addition of the line couldnt get no worse , which serves as a sarcastic rejoinder to McCartneys chorus: Its getting better all the time . Lennons contribution to the lyric also includes a confessional regarding his having been violent with female companions: I used to be cruel to my woman . He explained: I was a hitter. I couldnt express myself and I hit . In Womacks opinion, the song encourages the listener to follow the speakers example and alter their own angst-ridden ways : Man I was mean, but Im changing my scene and Im doing the best that I can.      MacDonald characterises the intro as blithely unorthodox , with two ": null
    },
    {
        "staccato": "staccato"
    },
    {
        " guitars – one panned left and one right – playing the ": null
    },
    {
        "dominant": "dominant"
    },
    {
        " against the ": null
    },
    {
        "subdominant": "subdominant"
    },
    {
        " of an ": null
    },
    {
        "F major": "f major"
    },
    {
        " ninth": "ninth"
    },
    {
        " chord, with the ": null
    },
    {
        "tonic": "tonic"
    },
    {
        " C": "c"
    },
    {
        " resolving as the verse begins. The dominant, which acts as a ": null
    },
    {
        "drone": "drone"
    },
    {
        ", is reinforced through the use of ": null
    },
    {
        "octave": "octave"
    },
    {
        "s played on a bass guitar and plucked on piano strings.       Womack interprets the lyric to Fixing a Hole as the speakers search for identity among the crowd , in particular the quests for consciousness and connection that differentiate individuals from society as a whole. MacDonald characterises it as a distracted and introverted track , during which McCartney forgoes his usual smooth design in favour of something more preoccupied . He cites Harrisons electric guitar solo as serving the track well, capturing its mood by conveying detachment. Womack notes McCartneys adaptation of the lyric a hole in the roof where the rain leaks in from ": null
    },
    {
        "Elvis Presley": "elvis presley"
    },
    {
        "s ": null
    },
    {
        "Were Gonna Move": "were gonna move"
    },
    {
        " . The song deals with McCartneys desire to let his mind wander freely and to express his creativity without the burden of self-conscious insecurities.       In Everetts view, the lyrics to ": null
    },
    {
        "Shes Leaving Home": "shes leaving home"
    },
    {
        " address the problem of alienation between disagreeing peoples , particularly those distanced from each other by the ": null
    },
    {
        "generation gap": "generation gap"
    },
    {
        ". McCartneys descriptive narration , which details the plight of a lonely girl who escapes the control of her selfish yet well-meaning parents , was inspired by a piece about teenage runaways published by the  Daily Mail . It is the first track on Sgt. Pepper that eschews the use of guitars and drums, featuring a string ": null
    },
    {
        "nonet": "nonet"
    },
    {
        " with a harp and drawing comparison with ": null
    },
    {
        "Yesterday": "yesterday"
    },
    {
        " and ": null
    },
    {
        "Eleanor Rigby": "eleanor rigby"
    },
    {
        " , which use a ": null
    },
    {
        "string quartet": "string quartet"
    },
    {
        " and ": null
    },
    {
        "octet": "string octet"
    },
    {
        " respectively.            Lennon adapted the lyric for Being for the Benefit of Mr. Kite! from an 42 poster for ": null
    },
    {
        "Pablo Fanque": "pablo fanque"
    },
    {
        "s circus that he purchased at an antique shop in ": null
    },
    {
        "Kent": "kent"
    },
    {
        " on the day of filming the ": null
    },
    {
        "promotional film": "music video"
    },
    {
        " for Strawberry Fields Forever . Womack views the track as an effective blending of a print source and music: The interpretive power of the mixed-media application accrues its meaning through the musical production with which the group imbues the Ur-text of the poster.  MacDonald notes Lennons request for a fairground production wherein one could smell the sawdust , an atmosphere that Martin and Emerick attempted to create with a ": null
    },
    {
        "sound collage": "sound collage"
    },
    {
        " that comprised randomly assembled recordings of harmoniums, harmonicas and ": null
    },
    {
        "calliopes": "calliope"
    },
    {
        ". ; .  MacDonald describes the song as a spontaneous expression of its authors playful hedonism . Everett thinks that the tracks use of Edwardian imagery thematically links it with the albums opening number.              Harrison wrote the ": null
    },
    {
        "Hindustani classical music": "hindustani classical music"
    },
    {
        "-inspired Within You Without You after the decision was made to discard Only a Northern Song . ; . The lyrics reflect Harrisons immersion in the teachings of the Hindu ": null
    },
    {
        "Vedas": "vedas"
    },
    {
        " while its musical form and Indian instrumentation, such as sitar, ": null
    },
    {
        "tabla": "tabla"
    },
    {
        ", ": null
    },
    {
        "dilruba": "dilruba"
    },
    {
        "s and tamburas, recall the Hindu devotional tradition known as ": null
    },
    {
        "bhajan": "bhajan"
    },
    {
        ". Harrison recorded the song with ": null
    },
    {
        "London-based Indian": "british indian"
    },
    {
        " musicians from the ": null
    },
    {
        "Asian Music Circle": "asian music circle"
    },
    {
        "; none of the other Beatles participated in the recording. : London-based Indian musicians and non-participation of the other Beatles; : Harrison singing and playing sitar and tambura on Within You Without You , and contributors from the Asian Music Circle.     The track features a ": null
    },
    {
        "tempo rubato": "tempo rubato"
    },
    {
        " that is without precedent in the Beatles catalogue. The pitch is derived from the eastern ": null
    },
    {
        "Khamaj": "khamaj"
    },
    {
        " scale, which is akin to the ": null
    },
    {
        "Mixolydian mode": "mixolydian mode"
    },
    {
        " in the West. MacDonald regards the song as the most distant departure from the staple Beatles sound in their discography , and a work that represents the conscience of the LP through the lyrics rejection of Western materialism. Womack calls it quite arguably, the albums ethical soul as a concise reflection of the Beatles and the countercultures perspective during the ": null
    },
    {
        "Summer of Love": "summer of love"
    },
    {
        " era. The track ends with a burst of laughter that some listeners interpret as a mockery of the song, but Harrison explained: Its a release after five minutes of sad music  ... You were supposed to hear the audience anyway, as they listen to Sergeant Peppers Show. That was the style of the album.  Martin used the moment of levity as a segue for what he describes as the albums jokey track – When Im Sixty-Four .            MacDonald characterises McCartneys When Im Sixty-Four as a song aimed chiefly at parents , borrowing heavily from the English music hall style of ": null
    },
    {
        "George Formby": "george formby, sr."
    },
    {
        ", while invoking images of the illustrator ": null
    },
    {
        "Donald McGill": "donald mcgill"
    },
    {
        "s seaside postcards . Its sparse arrangement includes chimes, clarinet and piano. Everett singles it out as a case of McCartneys penchant for the audience-charming vaudeville  ... that Lennon detested . Moore characterises the song as a synthesis of ": null
    },
    {
        "ragtime": "ragtime"
    },
    {
        " and pop, adding that its position following Within You Without You – a blend of Indian classical music and pop – demonstrates the diversity of the albums material. Moore credits Martins clarinet arrangement and Starrs use of ": null
    },
    {
        "brushes": "percussion malletbrushes"
    },
    {
        " with establishing the music hall atmosphere, which is reinforced by McCartneys vocal delivery and the recordings use of ": null
    },
    {
        "chromaticism": "chromaticism"
    },
    {
        ", a harmonic pattern that can be traced to ": null
    },
    {
        "Scott Joplin": "scott joplin"
    },
    {
        "s ": null
    },
    {
        "The Ragtime Dance": "the ragtime dance"
    },
    {
        " and  The Blue Danube  by ": null
    },
    {
        "Johann Strauss": "johann strauss ii"
    },
    {
        ". Varispeeding was used on the track, raising its pitch by a ": null
    },
    {
        "semitone": "semitone"
    },
    {
        " in an attempt to make McCartney sound younger. Everett comments that the lyrics protagonist is sometimes associated with the Lonely Hearts Club Band, but in his opinion the song is thematically unconnected to the others on the album.       Womack characterises Lovely Rita as a work of full-tilt psychedelia that contrasts sharply with the preceding track. He identifies the song as an example of McCartneys talent for creating imagistic musical portraiture , yet he also considers it to be a work that foreshadows the less effectual compositions that the Beatles would record post-Sgt. Pepper. MacDonald describes the song as a satire on authority that is imbued with an exuberant interest in life that lifts the spirits, dispersing self-absorption .       ": null
    },
    {
        "Good Morning Good Morning": "good morning good morning"
    },
    {
        " was inspired by a television commercial for ": null
    },
    {
        "Kelloggs": "kelloggs"
    },
    {
        " Corn Flakes, from which Lennon adapted a jingle as the songs ": null
    },
    {
        "refrain": "refrain"
    },
    {
        ". The track uses the bluesy mixolydian mode in A, which Everett credits with perfectly express Lennons grievance against complacency . : grievance against complacency ; : the bluesy ": null
    },
    {
        "mixolydian mode": "mixolydian mode"
    },
    {
        " in A. Lennon later dismissed the song as a throwaway piece of garbage , while McCartney viewed it as Lennons reaction to the frustrations of domestic life. Womack highlights the songs varied ": null
    },
    {
        "time signature": "time signature"
    },
    {
        "s, including 42/42 42/42 and 42/42 calling it a masterpiece of electrical energy . MacDonald notes Starrs fine performance and McCartneys coruscating pseudo-Indian guitar solo , which he credits with delivering the tracks climax. A series of animal noises are heard during the ": null
    },
    {
        "fade-out": "fade"
    },
    {
        " that are sequenced – at Lennons request – so that each successive animal is large enough to devour the preceding one. Martin said he spliced the sound of a chicken clucking at the end of the track to overlap with a guitar being tuned in the next one, making a seamless transition between the two songs.       Sgt. Peppers Lonely Hearts Club Band returns as a segue to the albums finale. The hard-rocking song was written after the Beatles assistant, Neil Aspinall, suggested that since Sgt. Pepper opened the album, the fictional band should make an appearance near the end. The ": null
    },
    {
        "reprise": "reprise"
    },
    {
        " omits the brass section from the title track and features a faster tempo. MacDonald notes the Beatles apparent excitement, which is tangibly translated during the recording.            As the last chord of the Sgt. Pepper reprise plays, an acoustic guitar strumming offbeat ": null
    },
    {
        "quavers": "eighth note"
    },
    {
        " begins, introducing what Moore describes as one of the most harrowing songs ever written . A Day in the Life consists of four verses by Lennon, a bridge, two ": null
    },
    {
        "aleatoric": "aleatoricism"
    },
    {
        " orchestral ": null
    },
    {
        "crescendo": "crescendo"
    },
    {
        "s and an interpolated middle part written and sung by McCartney. The first crescendo serves as a segue between the third verse and the middle part, leading to a bridge known as the dream sequence .     The idea to use an orchestra was McCartneys; he drew inspiration from Cage and Stockhausen. The 42-bar crescendos feature forty musicians selected from the ": null
    },
    {
        "London": "london philharmonic orchestra"
    },
    {
        " and ": null
    },
    {
        "Royal Philharmonic Orchestra": "royal philharmonic orchestra"
    },
    {
        "s and tasked with filling the space with what Womack describes as the sound of pure apocalypse . Martin said that Lennon requested a tremendous build-up, from nothing up to something absolutely like the end of the world . Lennon recalled drawing inspiration for the lyrics from a newspaper: I was writing the song with the Daily Mail propped up in front of me at the piano  ... there was a paragraph about 42 oles in ": null
    },
    {
        "Blackburn": "blackburn"
    },
    {
        ", Lancashire . For A Day in the Life , he wanted his voice to sound like Elvis Presley on ": null
    },
    {
        "Heartbreak Hotel": "heartbreak hotel"
    },
    {
        " . Martin and Emerick obliged by adding 42 milliseconds of ": null
    },
    {
        "tape echo": "tape echo"
    },
    {
        ". Womack describes Starrs performance as one of his most inventive drum parts on record , a part that McCartney encouraged him to attempt despite his protests against flashy drumming .     The thunderous piano chord that concludes the track and the album was produced by recording Lennon, Starr, McCartney and Evans simultaneously sounding an E major chord on three separate pianos; Martin then augmented the sound with a harmonium. The final piano chord was recorded 42 days later. Riley characterises the song as a postlude to the Pepper fantasy  ... that sets all the other songs in perspective , while shattering the illusion of Pepperland by introducing the parallel universe of everyday life . MacDonald describes the track as a song not of disillusionment with life itself, but of disenchantment with the limits of mundane perception .     As A Day in the Life ends, a 42-": null
    },
    {
        "kilohertz": "kilohertz"
    },
    {
        " high-frequency tone is heard; it was added at Lennons suggestion with the intention that it would annoy dogs. This is followed by the sounds of backwards laughter and random gibberish that were pressed into the records concentric run-out groove, which loops back into itself endlessly on any record player not equipped with an automatic needle return. Lennon can be heard saying, Been so high , followed by McCartneys response: Never could be any other way.      Pepper conceptSgt. Pepper opening song the Beatles manufacture an artificial textual space in which to stage their art.  The reprise of the title song appears on side two, just prior to the climactic A Day in the Life , creating a ": null
    },
    {
        "framing device": "framing device"
    },
    {
        ". In Starrs opinion, only the first two songs and the reprise are conceptually connected. Lennon agreed and in 42 he commented: Sgt. Pepper is called the first concept album, but it doesnt go anywhere  ... it works because we said it worked.  He was especially adamant that his contributions to the LP had nothing to do with the Sgt. Pepper concept. Further, he suggested that most of the other songs were equally unconnected, stating: Except for Sgt. Pepper introducing Billy Shears and the so-called reprise, every other song could have been on any other album .     In MacFarlanes view, the Beatles chose to employ an overarching thematic concept in an apparent effort to unify individual tracks . Everett contends that the albums musical unity results  ... from motivic relationships between key areas, particularly involving C, E, and G . Moore argues that the recordings use of common harmonic patterns and falling melodies contributes to its overall cohesiveness, which he describes as narrative unity, but not necessarily conceptual unity. MacFarlane agrees, suggesting that with the exception of the reprise, the album lacks the melodic and harmonic continuity that is consistent with cyclic form.     In a 42 interview, McCartney said that the Liverpool childhood theme behind the first three songs recorded during the Sgt. Pepper sessions was never formalised as an album-wide concept, but acknowledged that it served as a device or underlying theme throughout the project. MacDonald identifies allusions to the Beatles upbringing throughout Sgt. Pepper that are too persuasive to ignore . These include evocations of the postwar Northern music-hall tradition, references to Northern industrial towns and Liverpool schooldays, Lewis Carroll-inspired imagery , the use of brass instrumentation in the style of park bandstand performances ,  and the album covers flower arrangement akin to a ": null
    },
    {
        "floral clock": "floral clock"
    },
    {
        ". Norman partly agrees, saying that In many ways, the album carried on the childhood and Liverpool theme with its circus and fairground effects, its pervading atmosphere of the traditional northern music hall that was in both its main creators blood.             Pop artists ": null
    },
    {
        "Peter Blake": "peter blake"
    },
    {
        " and ": null
    },
    {
        "Jann Haworth": "jann haworth"
    },
    {
        " designed the album cover for Sgt. Pepper. : involvement of Peter Blake and Jann Haworth. Blake recalled of the concept: I offered the idea that if they had just played a concert in the park, the cover could be a photograph of the group just after the concert with the crowd who had just watched the concert, watching them. He added, If we did this by using cardboard cut-outs, it could be a magical crowd of whomever they wanted. According to McCartney, he himself provided the ink drawing on which Blake and Haworth based the design. : McCartneys design for the Sgt. Pepper cover ,  . The cover was ": null
    },
    {
        "art-directed": "art director"
    },
    {
        " by ": null
    },
    {
        "Robert Fraser": "robert fraser"
    },
    {
        " and photographed by ": null
    },
    {
        "Michael Cooper": "michael cooper"
    },
    {
        ". The front of the LP includes a colourful collage featuring the Beatles in costume as Sgt. Peppers Lonely Hearts Club Band, standing with a group of life-sized cardboard cut-outs of famous people. : the Sgt. Pepper cover featured the Beatles as the imaginary band alluded to in the albums title track, standing with a host of celebrities ; : standing with a host of celebrities . Each of the Beatles sports a heavy moustache, after Harrison had first grown one as a disguise during his visit to India. The moustaches reflected the growing influence of ": null
    },
    {
        "hippie": "hippie"
    },
    {
        " style trends, while the groups clothing, in Goulds description, spoofed the vogue in Britain for military fashions . : the growing influence of hippie style on the Beatles; : spoofed the vogue in Britain for military fashions . The centre of the cover depicts the Beatles standing behind a ": null
    },
    {
        "bass drum": "bass drum"
    },
    {
        " on which fairground artist Joe Ephgrave painted the words of the albums title. In front of the drum is an arrangement of flowers that spell out Beatles . The group are dressed in satin ": null
    },
    {
        "day-glo": "day-glo"
    },
    {
        "-coloured military-style uniforms that were manufactured by the London theatrical costumer M. Berman Ltd. Right next to the Beatles are ": null
    },
    {
        "wax sculpture": "wax sculpture"
    },
    {
        "s of the bandmembers in their suits and moptop haircuts from the ": null
    },
    {
        "Beatlemania": "beatlemania"
    },
    {
        " era, borrowed from ": null
    },
    {
        "Madame Tussauds": "madame tussauds"
    },
    {
        ". ; . The albums lyrics were printed in full on the back cover, the first time this had been done on a rock LP. : the first time lyrics were printed in full on a rock album; : the lyrics were printed on the back cover.          The 42 March 42 photo session with Cooper also produced the back cover and the inside gatefold, which musicologist Ian Inglis describes as conveying an obvious and immediate warmth  ... which distances it from the sterility and artifice typical of such images . McCartney explained: One of the things we were very much into in those days was eye messages  ... So with Michael Coopers inside photo, we all said, Now look into this camera and really say I love you! Really try and feel love; really give love through this! ... if you look at it youll see the big effort from the eyes.  The albums inner sleeve featured artwork by the Dutch design team ": null
    },
    {
        "the Fool": "the fool"
    },
    {
        " that eschewed for the first time the standard white paper in favour of an abstract pattern of waves of maroon, red, pink and white. Included as a bonus gift was a sheet of cardboard cut-outs designed by Blake and Haworth. These consisted of a postcard-sized portrait of Sgt. Pepper, based on a statue from Lennons house that was used on the front cover, a fake moustache, two sets of sergeant stripes, two lapel badges, and a stand-up cut-out of the Beatles in their satin uniforms. Moore writes that the inclusion of these items helped fans pretend to be in the band .     The cover collage includes 42 photographs and nine ": null
    },
    {
        "waxworks": "wax museum"
    },
    {
        " that depict a diversity of famous people, including actors, sportsmen, scientists and – at Harrisons request – the ": null
    },
    {
        "Self-Realization Fellowship": "self-realization fellowship"
    },
    {
        " gurus ": null
    },
    {
        "Mahavatar Babaji": "mahavatar babaji"
    },
    {
        ", ": null
    },
    {
        "Lahiri Mahasaya": "lahiri mahasaya"
    },
    {
        ", ": null
    },
    {
        "Sri Yukteswar": "sri yukteswar"
    },
    {
        " and ": null
    },
    {
        "Paramahansa Yogananda": "paramahansa yogananda"
    },
    {
        ". : 42 photographs and nine waxworks; : the ": null
    },
    {
        "Self-Realization Fellowship": "self-realization fellowship"
    },
    {
        " guru": "guru"
    },
    {
        "s. Inglis views the tableau as a guidebook to the cultural topography of the decade , demonstrating the increasing democratisation of society whereby traditional barriers between high and low culture were being eroded . The ": null
    },
    {
        "final grouping": "list of images on the cover of sgt. peppers lonely hearts club band"
    },
    {
        " included Stockhausen and Carroll, along with singers such as ": null
    },
    {
        "Bob Dylan": "bob dylan"
    },
    {
        " and ": null
    },
    {
        "Bobby Breen": "bobby breen"
    },
    {
        "; film stars ": null
    },
    {
        "Marlon Brando": "marlon brando"
    },
    {
        ", ": null
    },
    {
        "Tyrone Power": "tyrone power"
    },
    {
        ", ": null
    },
    {
        "Tony Curtis": "tony curtis"
    },
    {
        ", ": null
    },
    {
        "Marlene Dietrich": "marlene dietrich"
    },
    {
        ", ": null
    },
    {
        "Mae West": "mae west"
    },
    {
        ", and ": null
    },
    {
        "Marilyn Monroe": "marilyn monroe"
    },
    {
        "; artist ": null
    },
    {
        "Aubrey Beardsley": "aubrey beardsley"
    },
    {
        "; boxer ": null
    },
    {
        "Sonny Liston": "sonny liston"
    },
    {
        " and footballer ": null
    },
    {
        "Albert Stubbins": "albert stubbins"
    },
    {
        ". Also included were comedians ": null
    },
    {
        "Stan Laurel": "stan laurel"
    },
    {
        " and ": null
    },
    {
        "Oliver Hardy": "oliver hardy"
    },
    {
        " and writers ": null
    },
    {
        "H.G. Wells": "h. g. wells"
    },
    {
        ", ": null
    },
    {
        "Oscar Wilde": "oscar wilde"
    },
    {
        " and ": null
    },
    {
        "Dylan Thomas": "dylan thomas"
    },
    {
        ".     ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        ", ": null
    },
    {
        "Mahatma Gandhi": "mahatma gandhi"
    },
    {
        "  and ": null
    },
    {
        "Jesus Christ": "jesus"
    },
    {
        " were requested by Lennon to appear on the cover, but rejected. As a legal precaution, permission was sought from all those still living. Mae West initially refused, rhetorically asking what she would be doing in a lonely hearts club , until a personal letter from the Beatles changed her mind.  Actor ": null
    },
    {
        "Leo Gorcey": "leo gorcey"
    },
    {
        "s image was painted out after he requested a fee. When McCartney was asked why the Beatles did not include Elvis Presley among the musical artists, he replied: Elvis was too important and too far above the rest even to mention  ... he was more than merely a  ... pop singer, he was Elvis the King.  The final cost for the cover art was nearly £42 , an extravagant sum for a time when album covers would typically cost around £42 .       Sgt. Pepper was previewed on the pirate radio station ": null
    },
    {
        "Radio London": "wonderful radio london"
    },
    {
        " on 42 May and officially on the ": null
    },
    {
        "BBC Light Programme": "bbc light programme"
    },
    {
        "s show Where Its At, by ": null
    },
    {
        "Kenny Everett": "kenny everett"
    },
    {
        ", on 42 May. Everett played the entire album apart from A Day in the Life . On 42 May, Sgt. Pepper was given a rush-release in the UK, where it had originally been scheduled for 42 June. The US release followed on 42 June. It was the first Beatles album where the track listings were exactly the same for the UK and US versions. The bands eighth LP, it topped the  Record Retailer  albums chart  for 42 consecutive weeks, with a further four weeks at number one in the period through to February 42  /ref  ref  /ref  ref name Frith/HoR  /ref  ref name Mawer/42 / ref name Mawer/42  /ref  ref name Hamilton/Slate  /ref  ref name Hamilton/Slate /  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref name Christgau42 /  ref name Harris/Mojo /  blockquote  ref name Harris/Mojo  /ref /blockquote  ref name McCormick/Tele /  ref name Kemp /  ref  /ref  ref name Erlewine/AM /  ref  /ref  ref name Plagenhoef/Pitchfork / ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref name Lewis  /ref ref  /ref ref  /ref ref  /ref  ref  /ref  ref name Frith/HoR /  ref name qMurray  /ref  ref namegrammys  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref ref name huffpost  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref name LoC42  /ref  ref name42-greatest  /ref  ref  /ref  ref name Harris/Mojo /  ref  /ref  ref name Guardian424242  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref name huffpost /  ref  /ref        ref  /ref  ref  /ref ": null
    }
]