[
    {
        "Shakespearean tragedy is the designation given to most ": null
    },
    {
        "tragedies": "tragedy"
    },
    {
        " written by playwright ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        ". Many of ": null
    },
    {
        "his history plays": "shakespeares history plays"
    },
    {
        " share the qualifiers of a Shakespearean tragedy, but because they are based on real figures throughout the ": null
    },
    {
        "History of England": "history of england"
    },
    {
        ", they were classified as histories in the ": null
    },
    {
        "First Folio": "first folio"
    },
    {
        ". The Roman tragedies— Julius Caesar ,  Antony and Cleopatra  and  Coriolanus —are also based on ": null
    },
    {
        "historical figure": "historical figure"
    },
    {
        "s, but because their source stories were foreign and ancient they are almost always classified as tragedies rather than histories. ": null
    },
    {
        "Shakespeares romances": "shakespeares late romances"
    },
    {
        "  were written late in his career and published originally as either ": null
    },
    {
        "tragedy": "tragedy"
    },
    {
        " or ": null
    },
    {
        "comedy": "comedy"
    },
    {
        ". They share some elements of ": null
    },
    {
        "tragedy": "tragedy"
    },
    {
        " featuring a high status central character but end happily like ": null
    },
    {
        "Shakespearean comedies": "shakespearean comedies"
    },
    {
        ". Several hundred years after Shakespeares death, scholar ": null
    },
    {
        "F.S. Boas": "f. s. boas"
    },
    {
        " also coined a fifth category, the ": null
    },
    {
        "problem play": "shakespearean problem play"
    },
    {
        ", for plays that do not fit neatly into a single classification because of their subject matter, setting, or ending. The classifications of certain Shakespeare plays are still debated among scholars.          Below is the list of Shakespeares plays listed as ": null
    },
    {
        "tragedies": "tragedies"
    },
    {
        " in the ": null
    },
    {
        "First Folio": "first folio"
    },
    {
        ", along with the date range in which each play is believed to have been written.          The ": null
    },
    {
        "English Renaissance": "english renaissance"
    },
    {
        ", when Shakespeare was writing, was fueled by a renewed interest in Roman and Greek classics and neighboring ": null
    },
    {
        "renaissance": "renaissance"
    },
    {
        " literature written years earlier in Italy, France, and Spain. Shakespeare wrote the majority of his tragedies under the rule of ": null
    },
    {
        "James I": "james i"
    },
    {
        ", and their darker contents may reflect the general mood of the country following the death of ": null
    },
    {
        "Elizabeth I": "elizabeth i"
    },
    {
        ", as well as James theatrical preferences. Shakespeare, as was customary for other playwrights in his day, used history, other plays, and non-dramatic literature as sources for his plays. In ": null
    },
    {
        "Elizabethan England": "elizabethan england"
    },
    {
        " there were no ": null
    },
    {
        "copyright": "copyright"
    },
    {
        " or protections against ": null
    },
    {
        "plagiarism": "plagiarism"
    },
    {
        ", so characters, plots, and even whole phrases of poetry were considered common property. The majority of Shakespeares tragedies are based on historical figures, with the exception of  Measure for Measure  and  Othello , which are based on narrative fictions by ": null
    },
    {
        "Giraldi Cintio": "giraldi cintio"
    },
    {
        ". The historical basis for Shakespeares Roman plays comes from The Lives of Noble Grecians and Romans by ": null
    },
    {
        "Plutarch": "plutarch"
    },
    {
        ", whereas the source of Shakespeares Britain based plays and  Hamlet   derive from  Holinsheds Chronicles . Furthermore, the French author ": null
    },
    {
        "Belleforest": "françois de belleforest"
    },
    {
        " published The Hystorie of Hamblet, Prince of Denmarke in 42 which includes specifics from how the prince counterfeited to be mad, to how the prince stabbed and killed the Kings counsellor who was eavesdropping on Hamlet and his mother behind the arras in the Queens chamber. The story of Lear appears in ": null
    },
    {
        "Geoffrey of Monmouths": "geoffrey of monmouth"
    },
    {
        " Historia regium Britanniae , and then in John Higgins poem  The Mirror for Magistrates  in 42 as well as appearing in Holinsheds Chronicles in 42 Some events that happen in Shakespeares  King Lear  were inspired by various episodes of ": null
    },
    {
        "Philip Sidney": "philip sidney"
    },
    {
        "s  Arcadia  from 42 while the nonsensical musings of Edgars poor Tom heavily reference ": null
    },
    {
        "Samuel Harsnetts": "samuel harsnett"
    },
    {
        " 42 book, A Declaration of Egregious Popish Impostures.       Tragedies from these eras traced their philosophical essence back to ": null
    },
    {
        "Senecan tragedy": "senecan tragedy"
    },
    {
        ", grounded in nobles who have a tragic flaw or commit a grave error  which leads to their reversal of fortune .  ": null
    },
    {
        "Revenge tragedy": "revenge tragedy"
    },
    {
        " was also of increasing popularity in this age, Shakespeares  Hamlet  is one example of this. Plays of this age were also decidedly secular, in contrast to the religious ": null
    },
    {
        "morality plays": "morality plays"
    },
    {
        " which by this time were outlawed by ": null
    },
    {
        "Elizabeth I": "elizabeth i"
    },
    {
        ". One marked difference between English renaissance tragedies and the classics that inspired them, was the use and popularity of violence and murder on stage.     Select exemplary Elizabethan and Jacobean tragedies:  The Spanish Tragedy  by ": null
    },
    {
        "Thomas Kyd": "thomas kyd"
    },
    {
        "  The Jew of Malta  by ": null
    },
    {
        "Christopher Marlowe": "christopher marlowe"
    },
    {
        "  Tamburlaine  by ": null
    },
    {
        "Christopher Marlowe": "christopher marlowe"
    },
    {
        "  Antonios Revenge  by ": null
    },
    {
        "John Marston": "john marston"
    },
    {
        "  The Revengers Tragedy  by ": null
    },
    {
        "Thomas Middleton": "thomas middleton"
    },
    {
        "  Tis Pity Shes a Whore  by ": null
    },
    {
        "John Ford": "john ford"
    }
]