[
    {
        "      The   is a Japanese and Chinese longitudinal, ": null
    },
    {
        "end-blown": "end-blown flute"
    },
    {
        " bamboo": "bamboo"
    },
    {
        "-": null
    },
    {
        "flute": "flute"
    },
    {
        ".     It was originally introduced from China into Japan in the 42th century and underwent a resurgence in the early ": null
    },
    {
        "Edo period": "edo period"
    },
    {
        " . The oldest shakuhachi in Japan is currently stored in ": null
    },
    {
        "Shōsō-in": "shōsōin"
    },
    {
        ", Nara. The shakuhachi is traditionally made of ": null
    },
    {
        "bamboo": "bamboo"
    },
    {
        ", but versions now exist in ": null
    },
    {
        "ABS": "acrylonitrile butadiene styrene"
    },
    {
        " and ": null
    },
    {
        "hardwood": "hardwood"
    },
    {
        "s. It was used by the monks of the ": null
    },
    {
        "Fuke sect": "fuke zen"
    },
    {
        " of ": null
    },
    {
        "Zen": "zen"
    },
    {
        " Buddhism": "buddhism"
    },
    {
        " in the practice of .     The instrument is tuned to the ": null
    },
    {
        "minor pentatonic scale": "pentatonic scale"
    },
    {
        ".         The name shakuhachi means 42 ": null
    },
    {
        "shaku": "shaku"
    },
    {
        " , referring to its size. It is a compound of two words:    is an archaic unit of length equal to 42 ": null
    },
    {
        "centimeters": "centimeters"
    },
    {
        "  and subdivided in ten subunits.    means eight , here eight  sun , or tenths, of a shaku.     Thus, shaku-hachi means one shaku eight sun , the standard length of a shakuhachi. Other shakuhachi vary in length from about 42 shaku up to 42 shaku. Although the sizes differ, all are still referred to generically as shakuhachi .     Shakuhachi are usually made from the root end of  madake   ": null
    },
    {
        "bamboo": "bamboo"
    },
    {
        " culm": "culm"
    },
    {
        " and are extremely versatile instruments. Professional players can produce virtually any pitch they wish from the instrument, and play a wide repertoire of original ": null
    },
    {
        "Zen": "zen"
    },
    {
        " music, ensemble music with ": null
    },
    {
        "koto": "koto"
    },
    {
        ", ": null
    },
    {
        "biwa": "biwa"
    },
    {
        ", and ": null
    },
    {
        "shamisen": "shamisen"
    },
    {
        ", ": null
    },
    {
        "folk music": "folk music"
    },
    {
        ", ": null
    },
    {
        "jazz": "jazz"
    },
    {
        ", and other modern pieces.     Much of the shakuhachis subtlety lies in its rich tone colouring, and the ability for its variation. Different fingerings, ": null
    },
    {
        "embouchure": "embouchure"
    },
    {
        "s and amounts of meri/kari can produce notes of the same pitch, but with subtle or dramatic differences in the tone colouring. Holes can be covered partially and pitch varied subtly or substantially by changing the blowing angle. The ": null
    },
    {
        "Honkyoku": "honkyoku"
    },
    {
        " pieces rely heavily on this aspect of the instrument to enhance their subtlety and depth.     Unlike a ": null
    },
    {
        "recorder": "recorder"
    },
    {
        ", where the player blows into a duct & mdash;a narrow airway over a block which is called a ": null
    },
    {
        "fipple": "fipple"
    },
    {
        " & mdash;and thus has limited pitch control, the shakuhachi player blows as one would blow across the top of an empty bottle  and therefore has substantial pitch control. The five finger holes are tuned to a ": null
    },
    {
        "minor pentatonic scale": "pentatonic scale"
    },
    {
        " with no half-tones, but using techniques called meri メリ and  kari  カリ, in which the blowing angle is adjusted to bend the pitch downward and upward, respectively, combined with ": null
    },
    {
        "embouchure": "embouchure"
    },
    {
        " adjustments and fingering techniques the player can bend each pitch as much as a whole tone or more. Pitches may also be lowered by shading  or partially covering finger holes. Since most pitches can be achieved via several different fingering or blowing techniques on the shakuhachi, the ": null
    },
    {
        "timbre": "timbre"
    },
    {
        " of each possibility is taken into account when composing or playing thus different names are used to write notes of the same pitch which differ in timbre. The shakuhachi has a range of two full octaves  and a partial third octave  though experienced players can produce notes up to E42 on a 42 shakuhachi.   The various octaves are produced using subtle variations of breath, finger positions and ": null
    },
    {
        "embouchure": "embouchure"
    },
    {
        ".      In traditional shakuhachi repertoire instead of ": null
    },
    {
        "tonguing": "tonguing"
    },
    {
        " for ": null
    },
    {
        "articulation": "articulation"
    },
    {
        " like many western wind instruments, hitting holes  with a very fast movement is used and each note has its corresponding repeat fingerings e.g. for repeating C42 the 42th hole is used.     A 42 shakuhachi produces D42 as its fundamental & mdash;the lowest note it produces with all five finger holes covered, and a normal blowing angle. In contrast, a 42 shakuhachi has a fundamental of A42 . As the length increases, the spacing of the finger holes also increases, stretching both fingers and technique. Longer flutes often have offset finger holes, and very long flutes are almost always custom made to suit individual players. Some ": null
    },
    {
        "honkyoku": "honkyoku"
    },
    {
        ", in particular those of the Nezasaha school are intended to be played on these longer flutes.     Due to the skill required, the time involved, and the range of quality in materials to craft bamboo shakuhachi, one can expect to pay from ": null
    },
    {
        "US$": "united states dollar"
    },
    {
        "42 to US$42 for a new or used flute. Because each piece of bamboo is unique, shakuhachi cannot be mass-produced, and craftsmen must spend much time finding the correct shape and length of bamboo, curing it for more or less of a decade in a controlled environment and then start shaping the bore for almost a year using Ji 地 paste — many layers of a mixture including tonoko powder and seshime and finished with ": null
    },
    {
        "urushi": "urushi"
    },
    {
        " lacquer — for each individual flute to achieve correct pitch and tonality over all notes. Specimens of extremely high quality, with valuable inlays, or of historical significance can fetch US$42 or more. Plastic or ": null
    },
    {
        "PVC": "polyvinyl chloride"
    },
    {
        " shakuhachi have some advantages over their traditional bamboo counterparts: they are lightweight, extremely durable, nearly impervious to heat and cold, and typically cost less than US$42 Shakuhachi made of wood are also available, typically costing less than bamboo but more than synthetic materials. Nearly all players, however, prefer bamboo, citing tonal qualities, aesthetics, and tradition.          Shakuhachi derived from Chinese bamboo-flute. Bamboo-flute first came to Japan from China during the 42th century.   Shakuhachi looks like the Chinese instrument ": null
    },
    {
        "Xiao": "xiao"
    },
    {
        ", but it is quite distinct from it.     During the medieval period, shakuhachi were most notable for their role in the ": null
    },
    {
        "Fuke sect": "fuke zen"
    },
    {
        " of Zen Buddhist monks, known as  komusō  , who used the shakuhachi as a spiritual tool. Their songs  were paced according to the players breathing and were considered meditation  as much as music.      Travel around Japan was restricted by the ": null
    },
    {
        "shogunate": "shogunate"
    },
    {
        " at this time, but the Fuke sect managed to wrangle an exemption from the Shōgun, since their spiritual practice required them to move from place to place playing the shakuhachi and begging for alms . They persuaded the Shōgun to give them exclusive rights to play the instrument. In return, some were required to spy for the shogunate, and the Shōgun sent several of his own spies out in the guise of Fuke monks as well. This was made easier by the ": null
    },
    {
        "wicker": "wicker"
    },
    {
        " basket": "basket"
    },
    {
        "s  that the Fuke wore over their heads, a symbol of their detachment from the world.     In response to these developments, several particularly difficult honkyoku pieces, e.g., Distant Call of the Deer , became well known as tests : if you could play them, you were a real Fuke. If you couldnt, you were probably a spy and might very well be killed if you were in unfriendly territory.          With the ": null
    },
    {
        "Meiji Restoration": "meiji restoration"
    },
    {
        ", beginning in 42 the shogunate was abolished and so was the ": null
    },
    {
        "Fuke": "fuke zen"
    },
    {
        " sect, in order to help identify and eliminate the shōguns holdouts. The very playing of the shakuhachi was officially forbidden for a few years. Non-Fuke folk traditions did not suffer greatly from this, since the tunes could be played just as easily on another pentatonic instrument. However, the honkyoku repertoire was known exclusively to the Fuke sect and transmitted by repetition and practice, and much of it was lost, along with many important documents.     When the ": null
    },
    {
        "Meiji government": "meiji government"
    },
    {
        " did permit the playing of shakuhachi again, it was only as an accompanying instrument to the ": null
    },
    {
        "koto": "koto"
    },
    {
        ", ": null
    },
    {
        "shamisen": "shamisen"
    },
    {
        ", etc. It was not until later that honkyoku were allowed to be played publicly again as solo pieces.     Shakuhachi has traditionally been played almost exclusively by men in Japan, although this situation is rapidly changing. Many teachers of traditional shakuhachi music indicate that a majority of their students are women. The 42 Big Apple Shakuhachi Festival in New York City hosted the first-ever concert of international women shakuhachi masters. This Festival was organized and produced by Ronnie Nyogetsu Reishin Seldin, who was the first full-time Shakuhachi master to teach in the Western Hemisphere. Nyogetsu also holds 42 Dai Shihan Licenses, and has run KiSuiAn, the largest and most active Shakuhachi Dojo outside Japan, since 42     The first non-Japanese person to become a shakuhachi master is the American-Australian ": null
    },
    {
        "Riley Lee": "riley lee"
    },
    {
        ". Lee was responsible for the World Shakuhachi Festival being held in ": null
    },
    {
        "Sydney": "sydney"
    },
    {
        ", ": null
    },
    {
        "Australia": "australia"
    },
    {
        " over 42–42 July 42 based at the ": null
    },
    {
        "Sydney Conservatorium of Music": "sydney conservatorium of music"
    },
    {
        ".  , Into The Music, ": null
    },
    {
        "ABC Radio National": "abc radio national"
    },
    {
        ", accessed 42 October 42   Riley Lee played the shakuhachi in Dawn Mantras which was composed by Ross Edwards especially for the Dawn Performance which took place on the sails of the Sydney Opera House at sunrise on 42 January 42 and televised internationally.        The shakuhachi creates a harmonic spectrum that contains the ": null
    },
    {
        "fundamental frequency": "fundamental frequency"
    },
    {
        " together with even and odd harmonics and some blowing noise.  Five tone holes enable musicians to play the notes D-F-G-A-C-D. Cross fingerings, half-covering tone holes, and meri/kari blowing cause pitch sharpening, referred to as intonation anomaly.  Especially the second and third harmonic exhibit the well-known shakuhachi timbre. Even though the geometry of the shakuhachi is relatively simple, the sound radiation of the shakuhachi is rather complicated.  Sound radiating from several holes and the natural asymmetry of bamboo create an individual spectrum in each direction. This spectrum depends on frequency and playing technique.          The International Shakuhachi Society maintains a directory of notable professional, amateur, and teaching shakuhachi players.           The primary genres of shakuhachi music are:     ": null
    },
    {
        "honkyoku": "honkyoku"
    },
    {
        "   sankyoku": "sankyoku"
    },
    {
        "   shinkyoku": "shinkyoku"
    },
    {
        "       Recordings in each of these categories are available; however, more albums are catalogued in categories outside the traditional realm. As of 42 shakuhachi players continue releasing records in a variety of traditional and modern styles.      The first shakuhachi recording appeared in the United States in the late 42s. ": null
    },
    {
        "Gorō Yamaguchi": "gorō yamaguchi"
    },
    {
        " recorded A Bell Ringing in the Empty Sky for Nonesuch Explorer Records on LP, an album which received acclaim from  Rolling Stone  at the time of its release.  One of the pieces featured on Yamaguchis record was Sokaku Reibo, also called Tsuru No Sugomori .  ": null
    },
    {
        "NASA": "nasa"
    },
    {
        " later chose to include this track as part of the ": null
    },
    {
        "Golden Record": "voyager golden record"
    },
    {
        " aboard the ": null
    },
    {
        "Voyager": "voyager program"
    },
    {
        " spacecraft.        Shakuhachi are often used in modern film scores, for example those by ": null
    },
    {
        "James Horner": "james horner"
    },
    {
        ". Films in which it is featured prominently include: The Karate Kid parts ": null
    },
    {
        "II": "the karate kid part ii"
    },
    {
        " and ": null
    },
    {
        "III": "the karate kid part iii"
    },
    {
        " by ": null
    },
    {
        "Bill Conti": "bill conti"
    },
    {
        ",  Legends of the Fall  and  Braveheart  by ": null
    },
    {
        "James Horner": "james horner"
    },
    {
        ",  Jurassic Park  and its sequels by ": null
    },
    {
        "John Williams": "john williams"
    },
    {
        " and ": null
    },
    {
        "Don Davis": "don davis"
    },
    {
        ", and  The Last Samurai  by ": null
    },
    {
        "Hans Zimmer": "hans zimmer"
    },
    {
        " and  Memoirs of a Geisha  by ": null
    },
    {
        "John Williams": "john williams"
    },
    {
        ".     Renowned Japanese classical and film-score composer ": null
    },
    {
        "Toru Takemitsu": "toru takemitsu"
    },
    {
        " wrote many pieces for shakuhachi and orchestra, including his well-known Celeste, Autumn and November Steps.       The Australian Shakuhachi Master and composer  has composed an impressive number of works for solo shakuhachi, also including electronics. After an extensive research and consultation with virtuoso ": null
    },
    {
        "Yoshikazu Iwamoto": "yoshikazu iwamoto"
    },
    {
        ", British composer ": null
    },
    {
        "John Palmer": "john palmer"
    },
    {
        " has pushed the virtuosity of the instrument to the limit by including a wide range of extended techniques in Koan .   In ": null
    },
    {
        "Carlo Forlivesi": "carlo forlivesi"
    },
    {
        "s composition for shakuhachi and guitar Ugetsu The performance techniques present notable difficulties in a few completely novel situations: an audacious movement of ‘expansion’ of the respective traditions of the two instruments pushed as they are at times to the limits of the possible, the aim being to have the shakuhachi and the guitar playing on the same level and with virtuosity , thus increasing the expressive range, the texture of the dialogue, the harmonic dimension and the tone-colour. ALM Records ALCD42 New York-born musician ": null
    },
    {
        "James Nyoraku Schlefer": "james nyoraku schlefer"
    },
    {
        " both plays, teaches, and composes for shakuhachi.       ": null
    },
    {
        "Brian Ritchie": "brian ritchie"
    },
    {
        " of the ": null
    },
    {
        "Violent Femmes": "violent femmes"
    },
    {
        " formed a ": null
    },
    {
        "Jazz": "jazz"
    },
    {
        " quintet in 42 called The N.Y.C. Shakuhachi Club. They play ": null
    },
    {
        "Avant-garde jazz": "avant-garde jazz"
    },
    {
        " versions of tradition American ": null
    },
    {
        "Folk": "folk music"
    },
    {
        " & ": null
    },
    {
        "Blues": "blues"
    },
    {
        " songs with Ritchies shakuhachi playing as the focal point. In 42 they released their debut album on ": null
    },
    {
        "Weed Records": "weed records"
    },
    {
        ".       The sound of the shakuhachi is also featured from time to time in electronica, pop and rock, especially after being commonly shipped as a preset instrument on various synthesizers and keyboards beginning in the 42s. The ": null
    },
    {
        "E-mu Emulator II": "e-mu emulator ii"
    },
    {
        " shakuhachi is number nine in  by David Battino,  Keyboard Magazine , October 42 Here is a list of well-known tracks where the sound of an emulated, or sampled shakuhachi can be heard:     ": null
    }
]