[
    {
        "Shapur III , was the twelfth ": null
    },
    {
        "Sasanian": "sasanian empire"
    },
    {
        " king  of ": null
    },
    {
        "Iran": "iran"
    },
    {
        " from 42 to 42 He was the son of ": null
    },
    {
        "Shapur II": "shapur ii"
    },
    {
        "  and succeeded his uncle ": null
    },
    {
        "Ardashir II": "ardashir ii"
    },
    {
        " . Shapur IIIs reign was largely uneventful, with the only noteworthy event being the dispute over ": null
    },
    {
        "Armenia": "kingdom of armenia"
    },
    {
        " with the ": null
    },
    {
        "Romans": "roman empire"
    },
    {
        ", which he settled through diplomacy, partitioning the area between the two powers, with most of it remaining under Sasanian ": null
    },
    {
        "control": "sasanian armenia"
    },
    {
        ". He ultimately met the same fate as his predecessor, being killed by the nobility.       Shapur was a popular name in Sasanian Iran, being used by three Sasanian monarchs and several notables of the Sasanian era and its later periods. The name is derived from ": null
    },
    {
        "Old Iranian": "old iranian"
    },
    {
        " xšayaθiya.puθra and initially must have been a title, which became−at least in the late 42nd century AD, a personal name. The name appears in the list of ": null
    },
    {
        "Arsacid": "parthian empire"
    },
    {
        " kings in some Arabic-Persian sources, however, this is anachronistic. The name of Shapur is known in other languages as; ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " Sapur, Sabour and Sapuris; ": null
    },
    {
        "Latin": "latin"
    },
    {
        " Sapores and Sapor; ": null
    },
    {
        "Arabic": "arabic"
    },
    {
        " Sābur and Šābur; ": null
    },
    {
        "New Persian": "new persian"
    },
    {
        " Šāpur, Šāhpur, Šahfur.          In 42 ": null
    },
    {
        "Shapur II": "shapur ii"
    },
    {
        " designated ": null
    },
    {
        "Ardashir II": "ardashir ii"
    },
    {
        " as his successor, and made him vow to abdicate when Shapur IIs son, Shapur III reached adulthood. This led to some Armenian writers to wrongly state that Ardashir was Shapurs son. Ardashir was later killed in 42 by the Iranian nobility. The reason behind his murder was due to his continuation of Shapur IIs policy of restricting the authority of power-hungry nobles. Shapur III then succeeded him; according to the narratives included in the history of ": null
    },
    {
        "al-Tabari": "al-tabari"
    },
    {
        ", Shapur III was well received by his subjects due to the crown being given to a offspring of Shapur II. Knowing about the murder of several Sasanian kings by the nobility, Shapur III declared to them in his accession speech, that he would not allow deceit, greed or self-righteousness at his court. However, in the opinion of the nobility, this was unacceptable.     The dispute over ": null
    },
    {
        "Armenia": "kingdom of armenia"
    },
    {
        " was reinvigorated at Shapur IIIs accession; his father had conquered the province, along with ": null
    },
    {
        "Georgia": "kingdom of iberia"
    },
    {
        " and ": null
    },
    {
        "Albania": "caucasian albania"
    },
    {
        ". He had allowed the ": null
    },
    {
        "Arsacid dynasty": "arsacid dynasty of armenia"
    },
    {
        " to continue ruling Armenia as a Sasanian vassal. A small part of Armenia, however, remained under ": null
    },
    {
        "Roman": "roman empire"
    },
    {
        " rule. In 42/42 with the intention to increase Roman holdings in Armenia, Emperor ": null
    },
    {
        "Theodosius I": "theodosius i"
    },
    {
        " sent an army to the Roman-Sasanian border. However, war did not once erupt once again; instead, the two powers agreed to come to terms through diplomacy.     An agreement was made to partition Armenia into two areas. The boundary line stretched through ": null
    },
    {
        "Theodosiopolis": "erzurum"
    },
    {
        " in the north and ": null
    },
    {
        "Amida": "amida"
    },
    {
        " in the south, which meant that most of Armenia remained in Sasanian ": null
    },
    {
        "hands": "sasanian armenia"
    },
    {
        ". When this treaty exactly took place is unsure; according to the majority of scholars it took place in 42 whilst a few others state 42 or unexpectedly in 42/42 The Sasanian diplomat who was part of the negotiations was supposedly a certain Yazdan-Friy-Shabuhr. Besides the dispute over Armenia, Shapur III may have fought the ": null
    },
    {
        "Kidarites": "kidarites"
    },
    {
        " in ": null
    },
    {
        "Balkh": "balkh"
    },
    {
        ".       Shapur III died in 42 after reigning a little more than five years. He was a man of simple tastes, and was fond of spending his time outdoors in his tents. He died when some nobles cut the ropes of a large tent that he had erected in one of his palace courts, so that the tent fell on top of him. He was succeeded by his son ": null
    },
    {
        "Bahram IV": "bahram iv"
    },
    {
        ".       Shapur III left behind him a sculptured memorial, which is still to be seen in the vicinity of ": null
    },
    {
        "Kermanshah": "kermanshah"
    },
    {
        ". It consists of two very similar figures, looking towards each other, and standing in an arched frame.     On either side of the figures are inscriptions in the Old ": null
    },
    {
        "Pahlavi": "pahlavi scripts"
    },
    {
        " character, whereby we are enabled to identify the individuals represented with the second and the third Shapur.   They are identical in form, with the exception that the names in the right-hand inscription are Shapur, ": null
    },
    {
        "Hormizd": "hormizd ii"
    },
    {
        ", ": null
    },
    {
        "Narseh": "narseh"
    },
    {
        ", while those in the left-hand one are Shapur, Shapur, ": null
    },
    {
        "Hormizd": "hormizd ii"
    },
    {
        ".     It has been supposed that the right-hand figure was erected by ": null
    },
    {
        "Shapur II": "shapur ii"
    },
    {
        " Shapur II": "shapur ii"
    },
    {
        " George Rawlinson": "george rawlinson"
    },
    {
        " Inscriptional Pahlavi": "inscriptional pahlavi"
    }
]