[
    {
        "        Sharon Vonne Stone  is an American actress, producer, and former fashion model. She is the recipient of a ": null
    },
    {
        "Golden Globe Award": "golden globe awards"
    },
    {
        " and has received nominations for an ": null
    },
    {
        "Academy Award": "academy awards"
    },
    {
        ", a ": null
    },
    {
        "Primetime Emmy Award": "primetime emmy award"
    },
    {
        ", and two ": null
    },
    {
        "Screen Actors Guild Award": "screen actors guild award"
    },
    {
        "s.     After modelling in television commercials and print advertisements, she made her film debut as an ": null
    },
    {
        "extra": "extra"
    },
    {
        " in ": null
    },
    {
        "Woody Allen": "woody allen"
    },
    {
        "s ": null
    },
    {
        "comedy-drama": "comedy-drama"
    },
    {
        "  Stardust Memories  . Her first speaking part was in ": null
    },
    {
        "Wes Craven": "wes craven"
    },
    {
        "s horror film  Deadly Blessing  , and throughout the 42s, Stone went on to appear in films such as  Irreconcilable Differences  ,  King Solomons Mines  ,  Cold Steel  ,  Action Jackson  , and  Above the Law  . She found mainstream prominence with her part in ": null
    },
    {
        "Paul Verhoeven": "paul verhoeven"
    },
    {
        "s science fiction action film  Total Recall  .     Stone became a ": null
    },
    {
        "sex symbol": "sex symbol"
    },
    {
        " and rose to international recognition when she starred as ": null
    },
    {
        "Catherine Tramell": "catherine tramell"
    },
    {
        " in another Verhoeven film, the erotic thriller  Basic Instinct  , for which she earned her first ": null
    },
    {
        "Golden Globe Award": "golden globe awards"
    },
    {
        " nomination for ": null
    },
    {
        "Best Actress in a Motion Picture – Drama": "golden globe award for best actress in a motion picture – drama"
    },
    {
        ". She received further critical acclaim with her performance in ": null
    },
    {
        "Martin Scorsese": "martin scorsese"
    },
    {
        "s epic crime drama  Casino  , garnering the Golden Globe Award and an ": null
    },
    {
        "Academy Award": "academy awards"
    },
    {
        " nomination for ": null
    },
    {
        "Best Actress": "academy award for best actress"
    },
    {
        ".     Stone received two more Golden Globe Award nominations for her roles in  The Mighty  and  The Muse  . Her other notable film roles include  Sliver  ,  The Specialist  ,  The Quick and the Dead  ,  Last Dance  ,  Sphere  ,  Catwoman  ,  Broken Flowers  ,  Alpha Dog  ,  Basic Instinct 42  ,  Bobby  ,  Lovelace  ,  Fading Gigolo  , and  The Disaster Artist  . In 42 she received a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        ", and in 42 she was named ": null
    },
    {
        "Officer of the Order of Arts and Letters": "ordre des arts et des lettres"
    },
    {
        " in ": null
    },
    {
        "France": "france"
    },
    {
        ".     On television, Stone has had notable performances in the mini-series  War and Remembrance  and the ": null
    },
    {
        "HBO": "hbo"
    },
    {
        " television film  If These Walls Could Talk 42  . She made guest-appearances in  The Practice  , winning the ": null
    },
    {
        "Primetime Emmy Award for Outstanding Guest Actress in a Drama Series": "primetime emmy award for outstanding guest actress in a drama series"
    },
    {
        ", and in  Law & Order: Special Victims Unit  . She has also starred in the series  Agent X  ,  Mosaic  and  The New Pope  .       Sharon Vonne Stone was born in ": null
    },
    {
        "Meadville, Pennsylvania": "meadville, pennsylvania"
    },
    {
        ",   to Dorothy Marie , an accountant, and Joseph William Stone II ,  a ": null
    },
    {
        "tool and die": "tool and die maker"
    },
    {
        " manufacturer and factory worker. She has an older brother, Michael , a younger sister, Kelly , and a younger brother, Patrick .  Stated on  Inside the Actors Studio , 42 She is of part ": null
    },
    {
        "Irish": "irish americans"
    },
    {
        " ancestry.  In 42 in an interview with ": null
    },
    {
        "Conan O’Brien": "conan o’brien"
    },
    {
        " Stone stated that her Irish ancestors arrived in the United States during the ": null
    },
    {
        "potato famine": "potato famine"
    },
    {
        ".    Stone was considered academically gifted as a child and entered the second grade when she was 42 years old.       She graduated from Saegertown High School in ": null
    },
    {
        "Saegertown, Pennsylvania": "saegertown, pennsylvania"
    },
    {
        ", in 42 While attending ": null
    },
    {
        "Edinboro University of Pennsylvania": "edinboro university of pennsylvania"
    },
    {
        ", Stone won the title of Miss ": null
    },
    {
        "Crawford County, Pennsylvania": "crawford county, pennsylvania"
    },
    {
        " and was a candidate for ": null
    },
    {
        "Miss Pennsylvania": "miss pennsylvania"
    },
    {
        ". One of the pageant judges told her to quit school and move to ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " to become a ": null
    },
    {
        "fashion model": "model fashion modelling"
    },
    {
        ". In 42 Stone left Meadville and moved in with an aunt in ": null
    },
    {
        "New Jersey": "new jersey"
    },
    {
        ". She was signed by ": null
    },
    {
        "Ford Modeling Agency": "ford models"
    },
    {
        " in New York City.  Stone, inspired by ": null
    },
    {
        "Hillary Clinton": "hillary clinton"
    },
    {
        ", went back to Edinboro University to complete her degree in 42            Stone later moved to ": null
    },
    {
        "Europe": "europe"
    },
    {
        ", living for a year in Milan and then in Paris. While living there, she decided to quit modeling and pursue acting. So I packed my bags, moved back to ": null
    },
    {
        "New York": "new york"
    },
    {
        ", and stood in line to be an ": null
    },
    {
        "extra": "extra"
    },
    {
        " in a ": null
    },
    {
        "Woody Allen": "woody allen"
    },
    {
        " movie, she later recalled.  Stone was cast for a brief role in Allens  Stardust Memories  and then had a speaking part a year later in the horror film  Deadly Blessing  . French director ": null
    },
    {
        "Claude Lelouch": "claude lelouch"
    },
    {
        " cast her in  Les Uns et les Autres  , starring ": null
    },
    {
        "James Caan": "james caan"
    },
    {
        ".  She was on screen for two minutes and did not appear in the credits. On December 42 42 she played a ditsy bimbo meter maid in the first season of the television series  Silver Spoons . In 42 she appeared in the short-lived sports-themed television series  Bay City Blues , playing Cathy St. Marie, the wife of baseball player Terry St. Marie played by actor ": null
    },
    {
        "Patrick Cassidy": "patrick cassidy"
    },
    {
        ". That year she also appeared in the  Remington Steele  episode Steele Crazy After All These Years , first aired on February 42 42 In 42 she appeared in an episode of  T. J. Hooker  opposite ": null
    },
    {
        "William Shatner": "william shatner"
    },
    {
        ".     Her next film role was in  Irreconcilable Differences  , starring ": null
    },
    {
        "Ryan ONeal": "ryan oneal"
    },
    {
        ", ": null
    },
    {
        "Shelley Long": "shelley long"
    },
    {
        ", and a young ": null
    },
    {
        "Drew Barrymore": "drew barrymore"
    },
    {
        ". Stone played a starlet who breaks up the marriage of a successful director and his screenwriter wife. In 42 she appeared in Echoes of the Mind , a two-part episode of  Magnum, P.I. , playing identical twins, one a love interest of ": null
    },
    {
        "Tom Selleck": "tom selleck"
    },
    {
        "s character. Through the remainder of the 42s, she had roles in such films as  King Solomons Mines  and  Allan Quatermain and the Lost City of Gold  , and played ": null
    },
    {
        "Steven Seagal": "steven seagal"
    },
    {
        "s wife in  Above the Law  . In 42 she played Janice Henry for the filming of the miniseries  War and Remembrance .         In Dutch film director ": null
    },
    {
        "Paul Verhoeven": "paul verhoeven"
    },
    {
        "s science fiction action film  Total Recall  , with ": null
    },
    {
        "Arnold Schwarzenegger": "arnold schwarzenegger"
    },
    {
        ", she played the role of Lori Quaid, the seemingly loving wife of Schwarzeneggers character, later revealed to be an agent sent by a corrupt and ruthless governor to monitor him. The film received favorable reviews and made $42  million worldwide, giving Stones career a major boost. She appeared in five feature films the following year, though those were smaller-scale productions than that of Total Recall; she appeared alongside ": null
    },
    {
        "Kevin Bacon": "kevin bacon"
    },
    {
        ", ": null
    },
    {
        "Elizabeth Perkins": "elizabeth perkins"
    },
    {
        ", and ": null
    },
    {
        "Nathan Lane": "nathan lane"
    },
    {
        " in the romantic comedy  He Said, She Said , and starred in the psychological thriller  Scissors , as a sexually repressed woman who becomes trapped in a mysterious apartment. She starred opposite ": null
    },
    {
        "Forest Whitaker": "forest whitaker"
    },
    {
        " in the dramatic thriller  Diary of a Hitman , screened at the ": null
    },
    {
        "Deauville American Film Festival": "deauville american film festival"
    },
    {
        " in September.  She next played a sexually provocative young photojournalist in the little-seen  Year of the Gun  . She also obtained the role of a literary agent and former lover of a mystery writer in the thriller  Where Sleeping Dogs Lie .     In another Verhoeven film, the erotic thriller  Basic Instinct  , she took on the role that made her a star, playing ": null
    },
    {
        "Catherine Tramell": "catherine tramell"
    },
    {
        ", a brilliant ": null
    },
    {
        "bisexual": "bisexuality"
    },
    {
        " and alleged ": null
    },
    {
        "serial killer": "serial killer"
    },
    {
        ". Several actresses at the time turned down the role, mostly because of the ": null
    },
    {
        "nudity": "nudity in film"
    },
    {
        " required.    Critical response towards Basic Instinct was mixed, but Stone received critical acclaim for her star-making performance ;  ": null
    },
    {
        "Peter Travers": "peter travers"
    },
    {
        " of  Rolling Stone  remarked that cinematic wet dream delivers the goods, especially when Sharon Stone struts on with enough come-on carnality to singe the screen, and observed of the actress portrayal: Stone, a former model, is a knockout; she even got a rise out of Ah-nold in Verhoevens Total Recall. But being the bright spot in too many dull movies  stalled her career. Though Basic Instinct establishes Stone as a bombshell for the it also shows she can nail a laugh or shade an emotion with equal aplomb.  Australian critic Shannon J. Harvey of  The Sunday Times  called the film one of the 42s finest productions, doing more for female empowerment than any feminist rally. Stone – in her star-making performance – is as hot and sexy as she is ice-pick cold.  For the part, Stone earned a ": null
    },
    {
        "Golden Globe Award": "golden globe awards"
    },
    {
        " nomination for ": null
    },
    {
        "Best Actress in a Motion Picture – Drama": "golden globe award for best actress in a motion picture – drama"
    },
    {
        ", four ": null
    },
    {
        "MTV Movie Awards": "mtv movie  &  tv awards"
    },
    {
        " nominations, and a ": null
    },
    {
        "Golden Raspberry Award": "golden raspberry awards"
    },
    {
        " nomination for ": null
    },
    {
        "Worst New Star": "golden raspberry award for worst new star"
    },
    {
        " for her tribute to ": null
    },
    {
        "Theodore Cleaver": "beaver cleaver"
    },
    {
        " . The film also became one of the most financially successful productions of the 42s, grossing US$42  million worldwide.           She headlined the 42 erotic thriller  Sliver , based on ": null
    },
    {
        "Ira Levin": "ira levin"
    },
    {
        "s ": null
    },
    {
        "eponymous novel": "sliver"
    },
    {
        " about the mysterious occurrences in a privately owned New York City high-rise apartment building. The film was heavily panned by critics and earned Stone a ": null
    },
    {
        "Golden Raspberry Award": "golden raspberry awards"
    },
    {
        " nomination for ": null
    },
    {
        "Worst Actress": "golden raspberry award for worst actress"
    },
    {
        " but became a commercial success, grossing US$42  million at the international box office.  She made a cameo appearance in the action film  Last Action Hero  , starring Arnold Schwarzenegger. In 42 she starred opposite ": null
    },
    {
        "Richard Gere": "richard gere"
    },
    {
        " and ": null
    },
    {
        "Lolita Davidovich": "lolita davidovich"
    },
    {
        " in the drama  Intersection , directed by ": null
    },
    {
        "Mark Rydell": "mark rydell"
    },
    {
        ". The film, a remake of the French film  Les choses de la vie  by ": null
    },
    {
        "Claude Sautet": "claude sautet"
    },
    {
        ", concerns an architect who as his car hurtles into a collision at an intersection, flashes through key moments in his life, including his marriage to a beautiful but chilly heiress and his subsequent affair with a travel writer . Intersection received negative reviews and flopped at the box office.      She starred alongside ": null
    },
    {
        "Sylvester Stallone": "sylvester stallone"
    },
    {
        " in the action thriller  The Specialist  , portraying May Munro, a woman who entices a bomb expert she is involved with into destroying the criminal gang that killed her family. Despite negative reviews, the film made US$42  million worldwide.  For her work in both Intersection and The Specialist, Stone won a ": null
    },
    {
        "Golden Raspberry Award": "golden raspberry awards"
    },
    {
        " and a ": null
    },
    {
        "Stinkers Bad Movie Award": "stinkers bad movie awards"
    },
    {
        " for Worst Actress, but was nominated for the ": null
    },
    {
        "MTV Movie Award for Most Desirable Female": "mtv movie award for most desirable female"
    },
    {
        " for The Specialist. In the western  The Quick and the Dead  , she obtained the role of a gunfighter who returns to a frontier town in an effort to avenge her fathers death. The film premiered at the ": null
    },
    {
        "42 Cannes Film Festival": "1995 cannes film festival"
    },
    {
        "  and performed modestly at the box office upon its North American and European premiere. Stone received a ": null
    },
    {
        "Saturn Award": "saturn awards"
    },
    {
        " nomination for ": null
    },
    {
        "Best Actress": "saturn award for best actress"
    },
    {
        ".      Stone starred opposite ": null
    },
    {
        "Robert De Niro": "robert de niro"
    },
    {
        " in ": null
    },
    {
        "Martin Scorsese": "martin scorsese"
    },
    {
        "s epic crime drama  Casino  , where she took on the role of Ginger McKenna, the scheming, self-absorbed wife of a top gambling handicapper . The film, based on the non-fiction book  Casino: Love and Honor in Las Vegas  by ": null
    },
    {
        "Nicholas Pileggi": "nicholas pileggi"
    },
    {
        ", received widespread critical acclaim and made US$42  million globally.  Like the film, Stones performance was unanimously praised, earning her the ": null
    },
    {
        "Golden Globe Award for Best Actress in a Motion Picture – Drama": "golden globe award for best actress in a motion picture – drama"
    },
    {
        " and a nomination for the ": null
    },
    {
        "Academy Award for Best Actress": "academy award for best actress"
    },
    {
        ". During an interview with  The Observer , released January 42 42 Stone said of the response: Thank God. I mean just finally, wow I am not getting any younger. It couldnt have happened at a better time .  Also in 42 she received a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        ", located at 42 Hollywood Blvd, and was awarded the ": null
    },
    {
        "Women in Film": "women in film crystal + lucy awards"
    },
    {
        " Crystal Award": "women in film crystal + lucy awardscrystal award"
    },
    {
        ".      In 42 Stone starred in the psychological thriller  Diabolique , as the mistress of a cruel school master collaborating with his wife in an attempt to murder him. Subsequently, in the same year, she appeared as a woman waiting on death row for a brutal double murder she committed in her teens, in the little-seen drama  Last Dance . Both films received lukewarm reviews,   and earned Stone a ": null
    },
    {
        "Golden Raspberry Award": "golden raspberry awards"
    },
    {
        " nomination for ": null
    },
    {
        "Worst New Star": "golden raspberry award for worst new star"
    },
    {
        " .     In 42 Stone starred with ": null
    },
    {
        "Dustin Hoffman": "dustin hoffman"
    },
    {
        " and ": null
    },
    {
        "Samuel L. Jackson": "samuel l. jackson"
    },
    {
        " in the science fiction psychological thriller  Sphere , directed and produced by ": null
    },
    {
        "Barry Levinson": "barry levinson"
    },
    {
        ". The film was released in the United States on February 42 42 and made a lackluster US$42  million in its international theatrical run.  She next voiced the role of Princess Bala, daughter of the Queen of a community of ants, in the animated adventure comedy  Antz , co-starring ": null
    },
    {
        "Woody Allen": "woody allen"
    },
    {
        ", ": null
    },
    {
        "Jennifer Lopez": "jennifer lopez"
    },
    {
        ", ": null
    },
    {
        "Sylvester Stallone": "sylvester stallone"
    },
    {
        ", and ": null
    },
    {
        "Gene Hackman": "gene hackman"
    },
    {
        ". The film topped the box office in its opening weekend and went on to gross US$42  million around the globe.  Her last film release in the year was the drama  The Mighty , where she played the mother of a 42-year-old boy suffering from ": null
    },
    {
        "Morquio syndrome": "morquio syndrome"
    },
    {
        ". The film garnered a positive critical response upon its premiere in selected theaters,   and Stone was nominated for the ": null
    },
    {
        "Golden Globe Award for Best Supporting Actress": "golden globe award for best supporting actress – motion picture"
    },
    {
        " for her performance.     Stone obtained the titular role of a street-wise, middle-aged moll in  Gloria  , a remake of the 42 ": null
    },
    {
        "film of the same name": "gloria"
    },
    {
        " written and directed by ": null
    },
    {
        "John Cassavetes": "john cassavetes"
    },
    {
        ". The updated version received negative reviews, and Stone earned a ": null
    },
    {
        "Golden Raspberry Award": "golden raspberry awards"
    },
    {
        " nomination for Worst Actress.    Gloria also flopped at the box office, grossing US$42  million at the North American box office despite its US$42  million budget.      Another titular role followed in the year with the comedy  The Muse , co-starring ": null
    },
    {
        "Albert Brooks": "albert brooks"
    },
    {
        " and ": null
    },
    {
        "Andie MacDowell": "andie macdowell"
    },
    {
        ". The film was met with a mixed critical reception, and Helmut Voss, then president of the ": null
    },
    {
        "Hollywood Foreign Press Association": "hollywood foreign press association"
    },
    {
        ", who give the annual ": null
    },
    {
        "Golden Globe Awards": "golden globe awards"
    },
    {
        ", ordered all 42 of its members to return gift luxury watches sent by either Stone or ": null
    },
    {
        "October Films": "october films"
    },
    {
        "  as this was considered promotions for a nomination for Stones performance in the film.  She ultimately received the nomination for ": null
    },
    {
        "Best Actress in a Motion Picture – Comedy or Musical": "golden globe award for best actress – motion picture comedy or musical"
    },
    {
        ".       In 42 Stone starred opposite ": null
    },
    {
        "Ellen DeGeneres": "ellen degeneres"
    },
    {
        " in the ": null
    },
    {
        "HBO": "hbo"
    },
    {
        " television film  If These Walls Could Talk 42 , portraying a lesbian trying to start a family. For her role, she was again recognized by ": null
    },
    {
        "Women in Film": "women in film crystal + lucy awards"
    },
    {
        ", this time with the ": null
    },
    {
        "Lucy Award": "women in film crystal + lucy awardslucy award"
    },
    {
        ". She next played an exotic dancer alongside ": null
    },
    {
        "Billy Connolly": "billy connolly"
    },
    {
        " in the little-seen comedy  Beautiful Jo  .     Following her hospitalization on September 42 42 for a ": null
    },
    {
        "subarachnoid hemorrhage": "subarachnoid hemorrhage"
    },
    {
        ", she took a hiatus from screen acting, returning to the screen in 42; in that year, she portrayed Sheila Carlisle, an attorney who believes she can communicate with God, in three episodes from season eight of  The Practice . For her performance, she received the ": null
    },
    {
        "Primetime Emmy Award for Outstanding Guest Actress in a Drama Series": "primetime emmy award for outstanding guest actress in a drama series"
    },
    {
        ".  Also in 42 she appeared in a ": null
    },
    {
        "James Woods": "james woods"
    },
    {
        "-directed ": null
    },
    {
        "American Stroke Association": "american heart association"
    },
    {
        " television commercial to raise awareness of the ": null
    },
    {
        "symptoms of stroke": "strokesigns and symptoms"
    },
    {
        ". This commercial was also shown in Canada courtesy of the ": null
    },
    {
        "Heart and Stroke Foundation of Canada": "heart and stroke foundation of canada"
    },
    {
        ".           In the early 42s, Stone attempted a return to the mainstream with roles in the films  Cold Creek Manor  , with ": null
    },
    {
        "Dennis Quaid": "dennis quaid"
    },
    {
        ", and  Catwoman  , with ": null
    },
    {
        "Halle Berry": "halle berry"
    },
    {
        ". In the mystery psychological thriller Cold Creek Manor, she and Quaid played a family terrorized by the former owner of the rural estate they bought in ": null
    },
    {
        "foreclosure": "foreclosure"
    },
    {
        ".  Variety  magazine remarked in its review for the film that both actors fish in vain to find any angles to play in their dimension-free characters .  The superhero film Catwoman saw her play the age-obsessed CEO of a cosmetic company and the storys antagonist. While both films were box office flops, Catwoman is considered by many critics to be ": null
    },
    {
        "one of the worst movies of all time": "list of films considered the worstcatwoman"
    },
    {
        ".       Her next film release was the dramedy  Broken Flowers  , directed by ": null
    },
    {
        "Jim Jarmusch": "jim jarmusch"
    },
    {
        " and co-starring ": null
    },
    {
        "Bill Murray": "bill murray"
    },
    {
        ", ": null
    },
    {
        "Jeffrey Wright": "jeffrey wright"
    },
    {
        ", ": null
    },
    {
        "Jessica Lange": "jessica lange"
    },
    {
        ", and ": null
    },
    {
        "Frances Conroy": "frances conroy"
    },
    {
        ". In the film about an aging ": null
    },
    {
        "Don Juan": "don juan"
    },
    {
        " tracking down his former lovers after finding out he has a son, Stone took on the role of Laura, a grasping and overly eager closet organizer who re-connects with him. The film premiered at the ": null
    },
    {
        "42 Cannes Film Festival": "2005 cannes film festival"
    },
    {
        " and received a ": null
    },
    {
        "theatrical run": "wide release"
    },
    {
        " in arthouse cinemas, garnering a widely positive reception.    New York Magazine  remarked: Sharon Stone, playing a widow whos half-hippie, half-working-class-tough, demonstrates that, given the right part, she’s still not merely sexy but knockabout funny and sly .  In 42 she was named ": null
    },
    {
        "Officer of the Order of Arts and Letters": "ordre des arts et des lettres"
    },
    {
        " in ": null
    },
    {
        "France": "france"
    },
    {
        ".      After years of litigation,  Basic Instinct 42  was released on March 42 42 A reason for a long delay in releasing the film was reportedly Stones dispute with the filmmakers over the nudity in the film; she wanted more while they wanted less. A ": null
    },
    {
        "group sex": "group sex"
    },
    {
        " scene was cut in order to achieve an R rating from the ": null
    },
    {
        "Motion Picture Association of America": "motion picture association of america"
    },
    {
        " for the North American release; the controversial scene remained in the UK version of the London-based film. Stone told an interviewer, We are in a time of odd repression and if a popcorn movie allows us to create a platform for discussion, wouldnt that be great? .  Despite an estimated budget of US$42 million, it placed only 42th in gross on its opening weekend with a meager US$42 million and was subsequently declared a flop. It ultimately ran in theaters for only 42 days and finished with a total domestic gross of under US$42  million.     Stone appeared in ": null
    },
    {
        "Nick Cassavetes": "nick cassavetes"
    },
    {
        "s crime drama  Alpha Dog  , opposite ": null
    },
    {
        "Bruce Willis": "bruce willis"
    },
    {
        ", playing Olivia Mazursky, the mother of a real-life murder victim; she wore a ": null
    },
    {
        "fatsuit": "fatsuit"
    },
    {
        " for the role.  The film premiered at the ": null
    },
    {
        "42 Sundance Film Festival": "2006 sundance film festival"
    },
    {
        " and was an arthouse success.  She made part of an ensemble cast in ": null
    },
    {
        "Emilio Estevez": "emilio estevez"
    },
    {
        "s drama  Bobby  , about the hours leading up to the ": null
    },
    {
        "assassination of Robert F. Kennedy": "assassination of robert f. kennedy"
    },
    {
        ". Stone received favorable comments for her performance, particularly a scene alongside ": null
    },
    {
        "Lindsay Lohan": "lindsay lohan"
    },
    {
        ".   As a member of the cast, she was nominated for the ": null
    },
    {
        "Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture": "screen actors guild award for outstanding performance by a cast in a motion picture"
    },
    {
        ", but won the ": null
    },
    {
        "Hollywood Film Festival Award": "hollywood film festival"
    },
    {
        " for Best Ensemble Cast.      In December 42 Stone co-hosted the ": null
    },
    {
        "Nobel Peace Prize Concert": "nobel peace prize concert"
    },
    {
        " in Oslo, Norway together with ": null
    },
    {
        "Anjelica Huston": "anjelica huston"
    },
    {
        ". The concert was in honor of the Nobel Peace Prize winner ": null
    },
    {
        "Muhammad Yunus": "muhammad yunus"
    },
    {
        " for his social contribution in Bangladesh through ": null
    },
    {
        "Grameen Bank": "grameen bank"
    },
    {
        ".  Also in 42 she appeared in the last episode of the Turkish TV series  Kurtlar Vadisi   along with ": null
    },
    {
        "Andy García": "andy garcía"
    },
    {
        ".      Stone took on the role of a ": null
    },
    {
        "clinically depressed": "major depressive disorder"
    },
    {
        " woman in the independent drama  When a Man Falls in the Forest  , premiered in competition at the ": null
    },
    {
        "42 Berlin Film Festival": "57th berlin international film festival"
    },
    {
        " where it was nominated for the ": null
    },
    {
        "Golden Bear": "golden bear"
    },
    {
        ".  She found her part challenging to play, remarking: It was a watershed experience. I think that we live in a Prozac society where were always told were supposed to have this kind of equilibrium of emotion. We have all these assignments about how were supposed to feel about something.  Her next film roles have been in independent productions, including the late 42s films  If I Had Known I Was a Genius  ,  The Year of Getting to Know Us  ,  Five Dollars a Day  and  Streets of Blood  , all of which were ": null
    },
    {
        "direct-to-DVD": "direct-to-video"
    },
    {
        " releases in North America.       In April 42 Stone made guest-appearances in four episodes of  Law & Order: Special Victims Unit ,  portraying ": null
    },
    {
        "Jo Marlowe": "list of law  &  order: special victims unit charactersjo marlowe"
    },
    {
        ", a former cop turned prosecutor.  Entertainment Weekly  included in a review on the 42th of that April such descriptions of her performance as a great presence , and having had to revive her best tone to sell hokey lines in a series it described as mawkish and overwrought.  She took on the leading female role in the French action sequel  Largo Winch II  as a United Nations investigator named Diane Francken. Her first ": null
    },
    {
        "theatrical-released": "wide release"
    },
    {
        " production since 42 the film premiered on February 42 42 in ": null
    },
    {
        "France": "france"
    },
    {
        ", where it opened in second place at the box office.  She next starred in the thriller  Border Run  , portraying Sofie Talbert, a hard-hitting journalist against ": null
    },
    {
        "illegal immigration to the United States": "illegal immigration to the united states"
    },
    {
        ". The film received a ": null
    },
    {
        "direct-to-DVD": "direct-to-video"
    },
    {
        " release.          In the ": null
    },
    {
        "biographical": "biographical film"
    },
    {
        " drama  Lovelace  , Stone obtained the role of the mother of porn actress ": null
    },
    {
        "Linda Lovelace": "linda lovelace"
    },
    {
        " . The film, covering Lovelaces life from age 42 to 42 had its world premiere at the ": null
    },
    {
        "42 Sundance Film Festival": "2013 sundance film festival"
    },
    {
        " and opened in North American selected theaters.  She played a dermatologist seeking a  ménage à trois  in the ": null
    },
    {
        "Woody Allen": "woody allen"
    },
    {
        "–": null
    },
    {
        "John Turturro": "john turturro"
    },
    {
        " comedy  Fading Gigolo , which received a ": null
    },
    {
        "limited theatrical release": "limited theatrical release"
    },
    {
        " in April 42 following its premiere at the ": null
    },
    {
        "42 Toronto International Film Festival": "2013 toronto international film festival"
    },
    {
        ".  The film was an arthouse success and garnered positive reviews from critics; ": null
    },
    {
        "Glenn Kenny": "glenn kenny"
    },
    {
        " found Stone to be splendidly understated in what he described as a New York story through and through often funny, sometimes moving, occasionally goofy as hell .      Stone starred as an actress-turned-publisher opposite ": null
    },
    {
        "Riccardo Scamarcio": "riccardo scamarcio"
    },
    {
        " in the Italian dramedy  A Golden Boy  , directed by ": null
    },
    {
        "Pupi Avati": "pupi avati"
    },
    {
        ". The film screened at the ": null
    },
    {
        "Montreal World Film Festival": "montreal world film festival"
    },
    {
        " and was released in Italian cinemas on September 42 42   The Hollywood Reporter  expressed in its review for the production that a bright, shining Stone doesnt have to reach far to play an intellectual femme fatale, and her sunny blonde exudes as much seductive cool as any dark lady , while pointing out her part strikes an odd note in s dark Oedipal drama about a mentally ill ad writer .  Also in 42 Stone headlined the action drama series  Agent X , which aired only for one season on the ": null
    },
    {
        "TNT": "tnt"
    },
    {
        " channel. Her role was Natalie Maccabee, Americas first female Vice President who takes the office after the death of her Senator husband.      She starred as an adoptive mother in the independent drama  Mothers and Daughters , as part of an ensemble cast, consisting of ": null
    },
    {
        "Susan Sarandon": "susan sarandon"
    },
    {
        ", ": null
    },
    {
        "Selma Blair": "selma blair"
    },
    {
        ", ": null
    },
    {
        "Mira Sorvino": "mira sorvino"
    },
    {
        " and ": null
    },
    {
        "Courteney Cox": "courteney cox"
    },
    {
        ".  The film was released on May 42 42 for digital markets and received largely mixed reviews.   The Hollywood Reporter found the talented actresses involved to be hamstrung by the films unsubtle script that piles on far too many melodramatic plot contrivances for a 42-minute .  Also in 42 she played a lineman widow and the alcoholic mom of a crew member of high-wire workers hit by a deadly storm in the action film  Life on the Line ,  co-starring ": null
    },
    {
        "John Travolta": "john travolta"
    },
    {
        ", ": null
    },
    {
        "Kate Bosworth": "kate bosworth"
    },
    {
        ", ": null
    },
    {
        "Devon Sawa": "devon sawa"
    },
    {
        " and ": null
    },
    {
        "Gil Bellows": "gil bellows"
    },
    {
        ". The film was released for VOD and selected theaters.      Stone next appeared in the independent drama  Running Wild  , portraying a billionaire using power to turn the town against a widow who is trying to protect horses.  Like Mothers and Daughters and Life on the Line, the film received a VOD release, and is available at ": null
    },
    {
        "Walmart": "walmart"
    },
    {
        ", ": null
    },
    {
        "Amazon": "amazon"
    },
    {
        " and ": null
    },
    {
        "Netflix": "netflix"
    },
    {
        ".  She was part of the ensemble cast of the biographical comedy  The Disaster Artist  , directed, produced by, and starring ": null
    },
    {
        "James Franco": "james franco"
    },
    {
        ". The film, chronicling the making of the cult film  The Room  , cast Stone as ": null
    },
    {
        "Iris Burton": "iris burton"
    },
    {
        ", the agent of line producer and actor ": null
    },
    {
        "Greg Sestero": "greg sestero"
    },
    {
        ". It had its premiere at ": null
    },
    {
        "South by Southwest": "south by southwest"
    },
    {
        ", to what ": null
    },
    {
        "review aggregator": "review aggregator"
    },
    {
        " Metacritic": "metacritic"
    },
    {
        " indicated was universal acclaim .      Stone returned to television the following year in ": null
    },
    {
        "Steven Soderbergh": "steven soderbergh"
    },
    {
        "s ": null
    },
    {
        "HBO": "hbo"
    },
    {
        " murder mystery  Mosaic , receiving critical acclaim for her performance and earned the ": null
    },
    {
        "Satellite Award for Best Supporting Actress in a Series, Miniseries, or Television Film": "satellite award for best supporting actress – series, miniseries or television film"
    },
    {
        ".  ": null
    },
    {
        "Maureen Ryan": "maureen ryan"
    },
    {
        " of  Variety  felt that the actress displays terrific range and depth and holds the screen with effortless charisma ,  and Nick Schager of  The Daily Beast  wrote that Stones turn is something close to masterful.  While calling Stones performance phenomenal stating that she layered the character with vulnerability, anger, and sadness , Adam Chitwood of ": null
    },
    {
        "Collider": "collider"
    },
    {
        " felt that the series should hopefully begin a welcome career resurgence.  Alex Maidy of ": null
    },
    {
        "JoBlo.com": "joblo.com"
    },
    {
        " remarked that Sharon Stone is absolutely stunning in the lead role and proves that she is still as talented as ever.      In January 42 it was announced that Stone will star in the upcoming ": null
    },
    {
        "Netflix": "netflix"
    },
    {
        " drama series  Ratched .               For her leading roles in erotic and adult-themed feature films such as  Basic Instinct ,  Sliver , and  The Specialist , she created a tough-talking, no-underwear, voyeuristic, cool-as-ice, ": null
    },
    {
        "sex symbol": "sex symbol"
    },
    {
        " status during most of the 42s.  Stone has appeared in the covers and photo session of over 42 celebrity and fashion magazines throughout her four-decade acting career;  in 42 she graced the June–July cover of French  Vogue , and to coincide with the release of Total Recall, she posed nude for the July 42 issue of  Playboy , showing off the muscles she developed in preparation for the film. Following Basic Instinct, photographer ": null
    },
    {
        "George Hurrell": "george hurrell"
    },
    {
        " took a series of photographs of Stone, ": null
    },
    {
        "Sherilyn Fenn": "sherilyn fenn"
    },
    {
        ", ": null
    },
    {
        "Julian Sands": "julian sands"
    },
    {
        ", ": null
    },
    {
        "Raquel Welch": "raquel welch"
    },
    {
        ", ": null
    },
    {
        "Eric Roberts": "eric roberts"
    },
    {
        ", and ": null
    },
    {
        "Sean Penn": "sean penn"
    },
    {
        ". Stone, who was Hurrells reportedly last sitting before his death in 42  is also a collector of the photographers original prints and wrote the foreword to the book Hurrells Hollywood.     In 42 she was listed by  People  as one of the 42 most beautiful people in the world .  In 42  Empire  chose her as one of the 42 sexiest stars in film history , and in October 42 she was ranked among the top 42 film stars of all time by the magazine.  In 42 she was rated among the 42 sexiest stars of the century by Playboy.  She has been the subject of four television documentary specials, and several biographies have been written about her.    On her sex symbol image, Stone told ": null
    },
    {
        "Oprah Winfrey": "oprah winfrey"
    },
    {
        " on  Oprah Prime  in 42: Its a pleasure for me now. I mean, Im gonna be 42 years old. If people want to think Im a sex symbol, its, like, yeah. Think it up. You know. I mean, like, good for me .  In 42 Stone posed naked for the September issue of  Harpers Bazaar  magazine, in which she stated: At a certain point you start asking yourself, What really is sexy? It’s not just the elevation of your boobs. It’s being present and having fun and liking yourself enough to like the person thats with you .            On January 42 42 Stone helped solicit pledges for $42  million in five minutes for mosquito nets in ": null
    },
    {
        "Tanzania": "tanzania"
    },
    {
        ", Sharon Stone raises $42 mil. for Tanzania in 42 minutes , Yomiuri Shimbun, January 42 42 turning a panel on ": null
    },
    {
        "African poverty": "poverty in africa"
    },
    {
        " into an impromptu fund-raiser at the ": null
    },
    {
        "World Economic Forum": "world economic forum"
    },
    {
        " in ": null
    },
    {
        "Davos": "davos"
    },
    {
        ", Switzerland. Many observers, including ": null
    },
    {
        "UNICEF": "unicef"
    },
    {
        ", criticized her actions by claiming that Stone had reacted instinctively to the words of Tanzanian President ": null
    },
    {
        "Benjamin Mkapa": "benjamin mkapa"
    },
    {
        ", because she had not done her research on the causes, consequences, and methods of preventing ": null
    },
    {
        "malaria": "malaria"
    },
    {
        ".      Of the $42  million pledged, only $42 was actually raised. In order to fulfill the promise to send $42  million worth of bed nets to Tanzania, UNICEF contributed $42.  A review of  This diverted funds from other UNICEF projects. According to prominent economist ": null
    },
    {
        "Xavier Sala-i-Martin": "xavier sala-i-martin"
    },
    {
        ", officials are largely unaware of what happened with the bed nets. Some were delivered to the local airport. These reportedly were stolen and later resurfaced as wedding dresses on the local ": null
    },
    {
        "black market": "black market"
    },
    {
        ".       Stone was criticized over her comments in an exchange on the red carpet with Hong Kongs  Cable Entertainment News  during the ": null
    },
    {
        "42 Cannes Film Festival": "2008 cannes film festival"
    },
    {
        " on May 42 42 When asked about the ": null
    },
    {
        "42 Sichuan earthquake": "2008 sichuan earthquake"
    },
    {
        " she remarked:          One of Chinas biggest cinema chains reacted to Stones comments by declaring it would not show her films in its theaters.  The founder of the UME Cineplex chain and the chairman of the Federation of Hong Kong Filmmakers, ": null
    },
    {
        "Ng See-yuen": "ng see-yuen"
    },
    {
        ", called Stones comments inappropriate , and said the UME Cineplex chain would no longer present her films. ": null
    },
    {
        "Christian Dior": "christian dior"
    },
    {
        " advertisements featuring Stones image were dropped from all ads in China amid the public uproar.  Stone was removed from the ": null
    },
    {
        "42 Shanghai International Film Festival": "2008 shanghai international film festival"
    },
    {
        " guest list, and the events organizers considered banning the actress permanently.      ": null
    },
    {
        "Dior China": "christian dior"
    },
    {
        " had originally posted an apology in Stones name, but Stone later denied making the apology during an interview with  The New York Times , saying Im not going to apologize. Im certainly not going to apologize for something that isnt real and true  – not for face creams, although she did admit that she had sounded like an idiot.  However, after the interview, Stone released a statement entitled In my own words by Sharon Stone in which she said I could not be more regretful of that mistake. It was unintentional. I apologize. Those words were never meant to be hurtful to anyone.  While Stone cited the Dalai Lama as her good friend when she made the remark at the Cannes film festival, the Dalai Lama has reportedly distanced himself by saying of her only, yes, Ive met that lady .                 She met television producer Michael Greenburg in 42 on the set of  The Vegas Strip War , a television film he produced and she starred in. They were married in 42 In 42 Greenburg was her ": null
    },
    {
        "line producer": "line producer"
    },
    {
        " on  Allan Quatermain and the Lost City of Gold . The couple separated three years later, and their divorce was finalized in 42  In 42 Stone met ": null
    },
    {
        "William J. MacDonald": "william j. macdonald"
    },
    {
        " on the set of the film  Sliver , which he co-produced. MacDonald left his wife Naomi Baca for Stone and became engaged to her. They separated one year later in 42  After they separated, Stone returned the engagement ring via ": null
    },
    {
        "FedEx": "fedex"
    },
    {
        ".  While working on the film  The Quick and the Dead  in 42 Stone met Bob Wagner and they became engaged.     On February 42 42 Stone married ": null
    },
    {
        "Phil Bronstein": "phil bronstein"
    },
    {
        ", executive editor of  The San Francisco Examiner  and later  San Francisco Chronicle .  They ": null
    },
    {
        "adopted": "adoption"
    },
    {
        " a baby son, Roan Joseph Bronstein, in 42  Bronstein filed for divorce in 42 citing irreconcilable differences.  The divorce became final in 42  with a judge ruling that Roan should remain primarily with Bronstein, with Stone receiving visitation rights.      Stone adopted her second son, Laird Vonne, in 42  and her third son, Quinn Kelly Stone, in 42  As of 42 Stone resides with her three sons in ": null
    },
    {
        "West Hollywood, California": "west hollywood, california"
    },
    {
        ", in a home once owned by the actor ": null
    },
    {
        "Montgomery Clift": "montgomery clift"
    },
    {
        ".        Stone was hospitalized on September 42 42 for a ": null
    },
    {
        "subarachnoid hemorrhage": "subarachnoid hemorrhage"
    },
    {
        ", which was diagnosed as a ": null
    },
    {
        "vertebral artery dissection": "vertebral artery dissection"
    },
    {
        " rather than the more common ruptured ": null
    },
    {
        "aneurysm": "aneurysm"
    },
    {
        ", and treated with an ": null
    },
    {
        "endovascular coil embolization": "embolization"
    },
    {
        ".        In March 42 Stone traveled to ": null
    },
    {
        "Israel": "israel"
    },
    {
        " to promote peace in the ": null
    },
    {
        "Middle East": "middle east"
    },
    {
        " through a press conference with ": null
    },
    {
        "Nobel Peace Prize": "nobel peace prize"
    },
    {
        " winner ": null
    },
    {
        "Shimon Peres": "shimon peres"
    },
    {
        ".  In 42 she referred to Peres as her mentor . Dvir, Noam . , Ynetnews, June 42 42 Retrieved June 42 42 On October 42 42 Stone received the ": null
    },
    {
        "Peace Summit Award": "world summit of nobel peace laureatespeace summit award"
    },
    {
        " for her work with ": null
    },
    {
        "HIV/AIDS": "hiv/aids"
    },
    {
        " sufferers.      In 42 Stone was guest of honor at the Pilosio Building Peace Award in ": null
    },
    {
        "Milan": "milan"
    },
    {
        ".  She began an impromptu auction on stage in front of a crowd of CEOs from the construction industry and other dignitaries. She gained enough pledges to build 42 schools in ": null
    },
    {
        "Africa": "africa"
    },
    {
        ".                  In a career spanning over three decades, Stone has had over one hundred acting credits in film and on television. She has won 42 awards from 42 nominations, including one ": null
    },
    {
        "Golden Globe Award": "golden globe awards"
    },
    {
        " , one ": null
    },
    {
        "Primetime Emmy Award": "primetime emmy award"
    },
    {
        " , and two ": null
    },
    {
        "MTV Movie Awards": "mtv movie  &  tv awards"
    },
    {
        " . Her top-billing roles and most notable films  include:       ": null
    }
]