[
    {
        "           A ship of the line was a type of naval ": null
    },
    {
        "warship": "warship"
    },
    {
        " constructed from the 42th through to the mid42th century. The ship of the line was designed for the ": null
    },
    {
        "naval tactic": "naval tactics in the age of sail"
    },
    {
        " known as the ": null
    },
    {
        "line of battle": "line of battle"
    },
    {
        ", which depended on the two columns of opposing warships maneuvering to fire with the cannons along their ": null
    },
    {
        "broadsides": "broadside"
    },
    {
        ". In conflicts where opposing ships were both able to fire from their broadsides, the side with more cannons—and therefore more ": null
    },
    {
        "firepower": "firepower"
    },
    {
        "—typically had an advantage. Since these engagements were almost invariably won by the heaviest ships carrying the most powerful guns, the natural progression was to build sailing vessels that were the largest and most powerful of their time.        From the end of the 42s, the introduction of ": null
    },
    {
        "steam power": "steam engine"
    },
    {
        " brought less dependence on the wind in battle and led to the construction of ": null
    },
    {
        "screw-driven": "propellermarine"
    },
    {
        ", wooden-hulled, ships of the line; a number of pure ": null
    },
    {
        "sail-driven": "sail"
    },
    {
        " ships were converted to this propulsion mechanism. However, the introduction of the ": null
    },
    {
        "ironclad frigate": "ironclad warship"
    },
    {
        " in about 42 led swiftly to the decline of the steam-assisted ships of the line. The ironclad warship became the ancestor of the 42th-century ": null
    },
    {
        "battleship": "battleship"
    },
    {
        ", whose very designation is itself a contraction of the phrase ship of the line of battle or, more colloquially, line-of-battle ship .     The term ship of the line has fallen into disuse except in historical contexts, after warships and naval tactics evolved and changed from the mid42th century.                   The heavily armed ": null
    },
    {
        "carrack": "carrack"
    },
    {
        ", first developed in Portugal for either trade or war in the ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        ", was the precursor of the ship of the line. Other maritime ": null
    },
    {
        "Europe": "europe"
    },
    {
        "an states quickly adopted it in the late 42th and early 42th centuries. These vessels were developed by fusing aspects of the ": null
    },
    {
        "cog": "cog"
    },
    {
        " of the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " and ": null
    },
    {
        "galley": "galley"
    },
    {
        " of the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        ". The cogs, which traded in the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        ", in the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        " and along the Atlantic coasts, had an advantage over ": null
    },
    {
        "galley": "galley"
    },
    {
        "s in battle because they had raised platforms called castles at bow and stern that archers could occupy to fire down on enemy ships or even to drop heavy weights from. Over time these castles became higher and larger, and eventually were built into the structure of the ship, increasing overall strength. This aspect of the cog remained in the newer-style ": null
    },
    {
        "carrack": "carrack"
    },
    {
        " designs and proved its worth in battles like that at ": null
    },
    {
        "Diu in 42": "battle of diu"
    },
    {
        ".     The  Mary Rose  was an early 42th-century ": null
    },
    {
        "English": "england"
    },
    {
        " carrack or ": null
    },
    {
        "great ship": "great ship"
    },
    {
        " . She was heavily armed with 42 ": null
    },
    {
        "guns": "cannon"
    },
    {
        " and 42 after an upgrade in the 42s. Built in ": null
    },
    {
        "Portsmouth": "portsmouth"
    },
    {
        " in 42–42 she was one of the earliest purpose-built ": null
    },
    {
        "men-of-war": "warship"
    },
    {
        " in the English navy. She was over 42 tons ": null
    },
    {
        "burthen": "builders old measurement"
    },
    {
        ", had a ": null
    },
    {
        "keel": "keel"
    },
    {
        " of over 42  m and a crew of over 42 sailors, 42 soldiers and 42 gunners. Although the pride of the English fleet, she accidentally sank during the ": null
    },
    {
        "Battle of the Solent": "battle of the solent"
    },
    {
        ", 42 July 42      Henri Grâce à Dieu  , nicknamed ": null
    },
    {
        "Great Harry": "great harry"
    },
    {
        " , was another early English carrack. Contemporary with Mary Rose, Henri Grâce à Dieu was 42 feet long, weighing 42–42 ": null
    },
    {
        "ton": "long ton"
    },
    {
        "s and having a complement of 42–42. It is said that she was ordered by ": null
    },
    {
        "Henry VIII": "henry viii of england"
    },
    {
        " in response to the ": null
    },
    {
        "Scottish": "scotland"
    },
    {
        " ship ": null
    },
    {
        "Michael": "great michael"
    },
    {
        ", launched in 42 She was originally built at ": null
    },
    {
        "Woolwich Dockyard": "woolwich dockyard"
    },
    {
        " from 42 to 42 and was one of the first vessels to feature ": null
    },
    {
        "gunport": "gunport"
    },
    {
        "s and had twenty of the new heavy bronze ": null
    },
    {
        "cannon": "cannon"
    },
    {
        ", allowing for a ": null
    },
    {
        "broadside": "broadside"
    },
    {
        ". In all, she mounted 42 heavy guns and 42 light guns. She was the first English ": null
    },
    {
        "two-decker": "two-decker"
    },
    {
        ", and when launched she was the largest and most powerful warship in Europe, but she saw little action. She was present at the ": null
    },
    {
        "Battle of the Solent": "battle of the solent"
    },
    {
        " against ": null
    },
    {
        "Francis I of France": "francis i of france"
    },
    {
        " in 42  but appears to have been more of a diplomatic vessel, sailing on occasion with sails of gold cloth. Indeed, the great ships were almost as well known for their ornamental design  as they were for the power they possessed.     Carracks fitted for war carried large-": null
    },
    {
        "calibre": "caliber"
    },
    {
        " guns aboard. Because of their higher ": null
    },
    {
        "freeboard": "freeboard"
    },
    {
        " and greater load-bearing ability, this type of vessel was better suited than the galley to gunpowder weapons. Because of their development for conditions in the ": null
    },
    {
        "Atlantic": "atlantic"
    },
    {
        ", these ships were more weatherly than galleys and better suited to open waters. The lack of oars meant that large crews were unnecessary, making long journeys more feasible. Their disadvantage was that they were entirely reliant on the wind for mobility. Galleys could still overwhelm great ships, especially when there was little wind and they had a numerical advantage, but as great ships increased in size, galleys became less and less useful.     Another detriment was the high ": null
    },
    {
        "forecastle": "forecastle"
    },
    {
        ", which interfered with the sailing qualities of the ship; the bow would be forced low into the water while sailing before the wind. But as guns were introduced and gunfire replaced boarding as the primary means of naval combat during the 42th century, the medieval forecastle was no longer needed, and later ships such as the ": null
    },
    {
        "galleon": "galleon"
    },
    {
        " had only a low, one-deck-high forecastle. By the time of the 42 launching of Englands ": null
    },
    {
        "Sovereign of the Seas": "hms sovereign of the seas"
    },
    {
        ", the forecastle had disappeared altogether.     During the 42th century the ": null
    },
    {
        "galleon": "galleon"
    },
    {
        " evolved from the carrack. It was a longer and more manoeuvrable type of ship with all the advantages of the carrack. The main ships of the English and Spanish fleets in the ": null
    },
    {
        "Battle of Gravelines": "spanish armada"
    },
    {
        " of 42 were galleons; all of the English and most of the Spanish galleons survived the battle and the following storm even though the Spanish galleons suffered the heaviest attacks from the English while regrouping their scattered fleet. By the 42th century every major European naval power was building ships like these.     With the growing importance of colonies and exploration and the need to maintain trade routes across stormy oceans, galleys and ": null
    },
    {
        "galleass": "galleass"
    },
    {
        "es were used less and less, and only in ever more restricted purposes and areas, so that by about 42 with a few notable exceptions, they were of little use in naval battles.            ": null
    },
    {
        "King Erik XIV": "king erik xiv"
    },
    {
        " of ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        " initiated construction of the ship  Mars  in 42; this might have been the first attempt of this battle tactic, roughly 42 years ahead of widespread adoption of the line of battle strategy. Mars was likely the largest ship in the world at the time of her build, equipped with 42 guns at a full length of 42 meters. Ironically it became the first ship to be sunk by gunfire from other ships in a naval battle .     In the early to mid42th century, several navies, particularly those of the ": null
    },
    {
        "Netherlands": "netherlands"
    },
    {
        " and England, began to use new fighting techniques. Previously battles had usually been fought by great fleets of ships closing with each other and fighting in whatever arrangement they found themselves in, often boarding enemy vessels as opportunities presented themselves. As the use of ": null
    },
    {
        "broadside": "broadside"
    },
    {
        "s  became increasingly dominant in battle, tactics changed. The evolving  line-of-battle  tactic, first used in an ad-hoc way, required ships to form single-file lines and close with the enemy fleet on the same tack, battering the enemy fleet until one side had had enough and retreated. Any manoeuvres would be carried out with the ships remaining in line for mutual protection.     In order that this order of battle, this long thin line of guns, may not be injured or broken at some point weaker than the rest, there is at the same time felt the necessity of putting in it only ships which, if not of equal force, have at least equally strong sides. Logically it follows, at the same moment in which the line ahead became definitively the order for battle, there was established the distinction between the ships of the line, alone destined for a place therein, and the lighter ships meant for other uses. Mahan, A. T., The Influence of Sea Power Upon History 42–42, p. 42 quoting Chabaud-Arnault     The lighter ships were used for various functions, including acting as scouts, and relaying signals between the ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " and the rest of the fleet. This was necessary because from the flagship, only a small part of the line would be in clear sight.     The adoption of line-of-battle tactics had consequences for ship design. The height advantage given by the castles fore and aft was reduced, now that hand-to-hand combat was less essential. The need to manoeuvre in battle made the top weight of the castles more of a disadvantage. So they shrank, making the ship of the line lighter and more manoeuvrable than its forebears for the same combat power. As an added consequence, the hull itself grew larger, allowing the size and number of guns to increase as well.       In the 42th century ": null
    },
    {
        "fleets": "naval fleet"
    },
    {
        " could consist of almost a hundred ships of various sizes, but by the middle of the 42th century, ship-of-the-line design had settled on a few standard types: older ": null
    },
    {
        "two-decker": "two-decker"
    },
    {
        "s of 42 guns , two-deckers of between 42 and 42 guns that formed the main part of the fleet, and larger ": null
    },
    {
        "three": "three-decker"
    },
    {
        "- or even four-deckers with 42 to 42 guns that served as admirals command ships. Fleets consisting of perhaps 42 to 42 of these ships, with their attendant ": null
    },
    {
        "supply ships": "auxiliary ship"
    },
    {
        " and scouting and messenger ": null
    },
    {
        "frigate": "frigate"
    },
    {
        "s, kept control of the sea lanes for major European naval powers whilst restricting the sea-borne trade of enemies.     The most common size of sail ship of the line was the ": null
    },
    {
        " 42 ": "seventy-four"
    },
    {
        " , originally developed by France in the 42s, and later adopted by all battleship navies. Until this time the British had 42 sizes of ship of the line, and they found that their smaller 42- and 42-gun ships were becoming too small for the battle line, while their 42s and over were three-deckers and therefore unwieldy and unstable in heavy seas. Their best were 42-gun three-deckers of about 42 metres long on the gundeck, while the new French 42s were around 42 metres . In 42 the British captured a few of these French ships during the ": null
    },
    {
        "War of Austrian Succession": "war of austrian succession"
    },
    {
        ". In the next decade ": null
    },
    {
        "Thomas Slade": "thomas slade"
    },
    {
        " broke away from the past and designed several new classes of 42- to 42-metre 42s to compete with these French designs, starting with the ": null
    },
    {
        "Dublin": "dublin class ship of the line"
    },
    {
        " and ": null
    },
    {
        "Bellona": "bellona class ship of the line"
    },
    {
        " classes. Their successors gradually improved handling and size through the 42s.  as seen on books.google.com  Other navies ended up building 42s also as they had the right balance between offensive power, cost, and manoeuvrability. Eventually around half of Britains ships of the line were 42s. Larger vessels were still built, as command ships, but they were more useful only if they could definitely get close to an enemy, rather than in a battle involving chasing or manoeuvring. The 42 remained the favoured ship until 42 when ": null
    },
    {
        "Seppingss": "robert seppings"
    },
    {
        " method of construction enabled bigger ships to be built with more stability.     In a few ships the design was altered long after the ship was launched and in service. In the Royal Navy, smaller two-deck 42- or 42-gun ships of the line that could not be used safely in fleet actions had their upper decks removed , resulting in a very stout, single-gun-deck warship called a  razee . The resulting razeed ship could be classed as a frigate and was still much stronger. The most successful razeed ship in the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " was ": null
    },
    {
        "HMS Indefatigable": "hms indefatigable"
    },
    {
        ", commanded by Sir ": null
    },
    {
        "Edward Pellew": "edward pellew, 1st viscount exmouth"
    },
    {
        ".     ": null
    },
    {
        "Mahmudiye": "mahmudiye"
    },
    {
        " , ordered by the ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        " Sultan ": null
    },
    {
        "Mahmud II": "mahmud ii"
    },
    {
        " and built by the ": null
    },
    {
        "Imperial Naval Arsenal": "imperial arsenal"
    },
    {
        " on the ": null
    },
    {
        "Golden Horn": "golden horn"
    },
    {
        " in ": null
    },
    {
        "Istanbul": "istanbul"
    },
    {
        ", was for many years the largest warship in the world. The  The vessel was 42 ": null
    },
    {
        "kadem": "traditional turkish units of measurementlist of units"
    },
    {
        " in length and 42 kadem in beam. One kadem measures . Kadem is often misinterpreted as equivalent in length to ": null
    },
    {
        "one imperial foot": "foot"
    },
    {
        ", hence the wrongly converted dimensions of 42×42 ft, or 42×42 m in some sources. ship of the line was armed with 42 cannons on three decks and was manned by 42 sailors. She participated in the ": null
    },
    {
        "Siege of Sevastopol ": "siege of sevastopol"
    },
    {
        " during the ": null
    },
    {
        "Crimean War ": "crimean war"
    },
    {
        ". She was decommissioned in 42     The second largest sailing three-decker ship of the line ever built in the West and the biggest French ship of the line was the ": null
    },
    {
        "Valmy": "french ship valmy"
    },
    {
        ", launched in 42 She had right sides, which increased significantly the space available for upper batteries, but reduced the stability of the ship; wooden stabilisers were added under the waterline to address the issue. Valmy was thought to be the largest sort of sailing ship possible, as larger dimensions made the manoeuvre of riggings impractical with mere manpower. She participated in the Crimean War, and after her return to France later housed the ": null
    },
    {
        "French Naval Academy": "french naval academy"
    },
    {
        " under the name Borda ": null
    },
    {
        "HMS Victory": "hms victory"
    },
    {
        "  Mahmudiye  ": null
    },
    {
        "Valmy": "french ship valmy"
    },
    {
        " paddle steamer": "paddle steamer"
    },
    {
        " warships. Their use spread in the 42s, with paddle-steamer warships participating in conflicts like the ": null
    },
    {
        "First Opium War": "first opium war"
    },
    {
        " alongside ships of the line and frigates. Sondhaus, L. Naval Warfare, 42–42     Paddle steamers, however, had major disadvantages. The paddle wheel above the waterline was exposed to enemy fire, while itself preventing the ship from firing broadsides effectively. During the 42s, the ": null
    },
    {
        "screw propeller": "propellermarine"
    },
    {
        " emerged as the most likely method of steam propulsion, with both Britain and the USA launching screw-propelled warships in 42 Through the 42s, the British and French navies launched ever larger and more powerful screw ships, alongside sail-powered ships of the line. In 42 ": null
    },
    {
        "Viscount Palmerston": "henry temple, 3rd viscount palmerston"
    },
    {
        " gave an indication of the role of the new steamships in tense Anglo-French relations, describing the ": null
    },
    {
        "English Channel": "english channel"
    },
    {
        " as a steam bridge , rather than a barrier to French invasion. It was partly because of the fear of war with France that the Royal Navy converted several old 42-gun ships of the line into 42-gun steam-powered blockships , starting in 42 The blockships were originally conceived as steam batteries solely for harbour defence, but in September 42 they were given a reduced rig rather than none at all, to make them sea-going ships.… The blockships were to be a cost-effective experiment of great value. p. 42 ": null
    },
    {
        "Lambert, Andrew": "andrew lambert"
    },
    {
        ". Battleships in Transition, the Creation of the Steam Battlefleet 42–42, Conway Maritime Press, 42 . They subsequently gave good service in the ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        ".          The ": null
    },
    {
        "French Navy": "french navy"
    },
    {
        ", however, developed the first purpose-built steam battleship with the 42-gun ": null
    },
    {
        "Le Napoléon": "le napoléon"
    },
    {
        " in 42 Napoleon , the first purpose-designed screw line of battleships , Steam, Steel and Shellfire, Conways History of the Ship, p. 42 She is also considered the first true steam battleship, and the first screw battleship ever. Hastened to completion Le Napoleon was launched on 42 May 42 to become the worlds first true steam battleship , Steam, Steel and Shellfire, Conways History of the Ship, p. 42 Napoleon was armed as a conventional ship of the line, but her steam engines could give her a speed of 42 knots , regardless of the wind conditions—a potentially decisive advantage in a naval engagement.     Eight sister ships to Le Napoléon were built in France over a period of ten years, but the United Kingdom soon took the lead in production, in number of both purpose-built and converted units. Altogether, France built 42 new wooden steam battleships and converted 42 from older battleship units, while the United Kingdom built 42 and converted 42 Steam, Steel and Shellfire, Conways History of the Ship, p. 42     In the end, France and Britain were the only two countries to develop fleets of wooden steam screw battleships, although several other navies made some use of a mixture of screw battleships and paddle-steamer frigates. These included Russia, ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        ", ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ", ": null
    },
    {
        "Naples": "kingdom of the two sicilies"
    },
    {
        ", ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ", ": null
    },
    {
        "Denmark": "denmark"
    },
    {
        ", and ": null
    },
    {
        "Austria": "austria"
    },
    {
        ".            In the ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        ", six line-of-battle ships and two frigates of the Russian ": null
    },
    {
        "Black Sea Fleet": "black sea fleet"
    },
    {
        " destroyed seven Turkish frigates and three corvettes with explosive shells at the ": null
    },
    {
        "Battle of Sinop": "battle of sinop"
    },
    {
        " in 42 Lambert, Andrew D, The Crimean War, British Grand Strategy Against Russia, 42–42, pub Manchester University Press, 42 , pages 42–42     In the 42s unarmoured steam line-of-battle ships were replaced by ": null
    },
    {
        "ironclad warship": "ironclad warship"
    },
    {
        "s. In the ": null
    },
    {
        "US civil war": "us civil war"
    },
    {
        ", on March 42 42 during the first day of the ": null
    },
    {
        "Battle of Hampton Roads": "battle of hampton roads"
    },
    {
        ", two unarmoured wooden frigates were sunk and destroyed by the Confederate ironclad ": null
    },
    {
        "CSS Virginia": "css virginia"
    },
    {
        ".     However, the power implied by the ship of the line would find its way into the ironclad, which would develop during the next few decades into the concept of the ": null
    },
    {
        "battleship": "battleship"
    },
    {
        ".     Several navies still use terms equivalent to the ship of the line for battleships, such as German Navy  and Russian Navy .            In the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        " and ": null
    },
    {
        "Atlantic Ocean": "atlantic ocean"
    },
    {
        ", the fleets of England and later Britain, the Netherlands, France, Spain and Portugal fought numerous battles. In the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        ", Sweden, Denmark, the Netherlands, and Russia did likewise, while in the ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        ", the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ", ": null
    },
    {
        "Venice": "venice"
    },
    {
        ", Spain, France, Britain and Russia battled.     During the ": null
    },
    {
        "Napoleonic Wars": "napoleonic wars"
    },
    {
        ", Britains Royal Navy established itself as the supreme world naval power by defeating a Spanish fleet near ": null
    },
    {
        "Cape St Vincent": "battle of cape st vincent"
    },
    {
        " in 42 a French fleet at the Bay of Aboukir off the Egyptian coast at the ": null
    },
    {
        "Battle of the Nile": "battle of the nile"
    },
    {
        " in 42 a combined Franco-Spanish fleet near Cape Trafalgar in Spain at the ": null
    },
    {
        "Battle of Trafalgar": "battle of trafalgar"
    },
    {
        " in 42 and the Danish fleet in the bombardment of Copenhagen in the second ": null
    },
    {
        "Battle of Copenhagen ": "battle of copenhagen"
    },
    {
        ". Britain emerged from the Napoleonic Wars in 42 with the largest and most professional navy in the world, composed of hundreds of wooden, sail-powered ships of all sizes and classes. The ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " demonstrated this naval supremacy again during the ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        " in the 42s.     Nonetheless, the Napoleonic Wars, as well as the ": null
    },
    {
        "American War of 42": "war of 1812"
    },
    {
        ", had illustrated the shortcomings of ships of the line when an enemy resorted to tactics including the large-scale use of ": null
    },
    {
        "privateer": "privateer"
    },
    {
        "s. Both the French and the Americans had demonstrated what a menace small, lightly armed, but fast, nimble, and, most especially, numerous vessels like ": null
    },
    {
        "sloop": "sloop"
    },
    {
        "s and ": null
    },
    {
        "schooners": "schooners"
    },
    {
        " could be when they spread across the wide oceans, operating singly or in small groups. They targeted the merchant shipping that was Britains economic lifeblood, and ships of the line were too few, too slow, and too clumsy to be employed against them.     Overwhelming firepower was of no use if it could not be brought to bear: the Royal Navys initial response to Napoleons privateers, which operated from French ": null
    },
    {
        "New World": "new world"
    },
    {
        " territories, was to buy ": null
    },
    {
        "Bermuda sloop": "bermuda sloop"
    },
    {
        "s. Similarly, the ": null
    },
    {
        "East India Company": "british east india company"
    },
    {
        "s merchant vessels became lightly armed and quite competent in combat during this period, operating a convoy system under an armed merchantman, instead of depending on small numbers of more heavily armed ships.          The only original ship of the line remaining today is ": null
    },
    {
        "HMS Victory": "hms victory"
    },
    {
        ", preserved as a museum in ": null
    },
    {
        "Portsmouth": "portsmouth"
    },
    {
        " to appear as she was while under Admiral ": null
    },
    {
        "Horatio Nelson": "horatio nelson"
    },
    {
        " at the Battle of Trafalgar in 42 Although Victory is in drydock, she is still a fully commissioned warship in the Royal Navy and is the oldest commissioned warship in any navy worldwide.       Regalskeppet Vasa  sank in the Baltic in 42 and was lost until 42 She was then raised intact, in remarkably good condition, in 42 and is presently on display at the ": null
    },
    {
        "Vasa Museum": "vasa museum"
    },
    {
        " in ": null
    },
    {
        "Stockholm, Sweden": "stockholm, sweden"
    },
    {
        ". At the time she was the largest Swedish warship ever built. Today the Vasa Museum is the most visited museum in Sweden.": null
    }
]