[
    {
        "Shopping Bag is the fifth album by ": null
    },
    {
        "The Partridge Family": "the partridge family"
    },
    {
        " released in March 42 It reached 42 on the Billboard album charts in the US and spent a total 42 weeks on the chart and was certified Gold. The vinyl release of the album contained a novelty plastic shopping bag. It is available on ": null
    },
    {
        "CD": "cd"
    },
    {
        " and ": null
    },
    {
        "iTunes": "itunes"
    },
    {
        ".     As with most Partridge Family albums, several well-known songwriters contributed songs to the album. Perhaps the most famous were ": null
    },
    {
        "Tommy Boyce": "tommy boyce"
    },
    {
        " and ": null
    },
    {
        "Bobby Hart": "boyce and hart"
    },
    {
        ", who gave the album the track Girl, You Make My Day. ": null
    },
    {
        "Tony Romeo": "tony romeo"
    },
    {
        ", another prolific songwriter, contributed several tracks to the album.     ": null
    },
    {
        "Its One of Those Nights ": "its one of those nights"
    },
    {
        " was released as a US single, peaking at 42 on Billboards Hot 42 It spent 42 weeks on the charts.   Am I Losing You was a second US single release, peaking at 42 on Billboards Hot 42 and staying on the charts for 42 weeks.     Partridge Family lead vocalist David Cassidy wrote Therell Come a Time for the album, which would be his third songwriting effort to appear on a Partridge Family album. It would also be his last, as Cassidys later songwriting efforts would all be released on his solo albums.       All tracks from the album were featured on the TV show, mainly in Seasons 42 and 42       Girl, You Make My Day   Every Little Bit o You    Something New Got Old    Am I Losing You   Last Night    Its All in Your Mind        Hello, Hello   Therell Come a Time    If You Ever Go   Every Song Is You    ": null
    },
    {
        "Its One of Those Nights ": "its one of those nights"
    },
    {
        "       David Cassidy, Shirley Jones - vocals   Dennis Budimir, ": null
    },
    {
        "Larry Carlton": "larry carlton"
    },
    {
        ", ": null
    },
    {
        "Louie Shelton": "louie shelton"
    },
    {
        ", ": null
    },
    {
        "Tommy Tedesco": "tommy tedesco"
    },
    {
        " - guitar   ": null
    },
    {
        "Max Bennett": "max bennett"
    },
    {
        " - bass   ": null
    },
    {
        "Mike Melvoin": "mike melvoin"
    },
    {
        " - keyboards   ": null
    },
    {
        "Hal Blaine": "hal blaine"
    },
    {
        " - drums   ": null
    },
    {
        "Jackie Ward": "jackie ward"
    },
    {
        ", ": null
    },
    {
        "John Bahler": "john bahler"
    },
    {
        ", ": null
    },
    {
        "Ron Hicklin": "ron hicklin"
    },
    {
        ", ": null
    },
    {
        "Tom Bahler": "tom bahler"
    },
    {
        " - background vocals       ": null
    }
]