[
    {
        "              Shōgun is a 42 novel by ": null
    },
    {
        "James Clavell": "james clavell"
    },
    {
        ". It is the first novel of the authors ": null
    },
    {
        "Asian Saga": "asian saga"
    },
    {
        ". A major best-seller, by 42 the book had sold 42 million copies worldwide. Beginning in feudal Japan some months before the critical ": null
    },
    {
        "Battle of Sekigahara": "battle of sekigahara"
    },
    {
        " in 42 Shōgun gives an account of the rise of the  daimyō  Toranaga . Toranagas rise to the shogunate is seen through the eyes of the English sailor ": null
    },
    {
        "John Blackthorne": "john blackthorne"
    },
    {
        ", called Anjin by the Japanese, whose fictional heroics are loosely based on the historical exploits of ": null
    },
    {
        "William Adams": "william adams"
    },
    {
        ".       Feudal Japan in 42 is in a precarious peace. The heir to the Taiko is too young to rule, and the most powerful five overlords of the land hold power as a Council of Regents. Portugal, with its vast sea power, and the Catholic Church mainly through the Order of the ": null
    },
    {
        "Jesuit": "jesuit"
    },
    {
        "s, have gained a foothold in Japan and seek to extend their power. But Japanese society is insular and xenophobic. Guns and Europes modern military capabilities are still a novelty and despised as a threat to Japans traditional ": null
    },
    {
        "Samurai": "samurai"
    },
    {
        " warrior culture.     John Blackthorne, an English pilot, serving on the Dutch warship Erasmus, is the first English pilot to reach Japan. England seek to disrupt Portuguese relations with Japan and establish ties of their own through trade and military alliances.     Erasmus is blown ashore on the Japanese coast at the village of Anjiro during a storm. Blackthorne and the few survivors of his crew are taken captive by local samurai, Kasigi Omi, until his  daimyō  and uncle, Kasigi Yabu, arrives. Yabu puts Blackthorne and his crew on trial as pirates, using a Jesuit priest to interpret for Blackthorne. Losing the trial, Blackthorne attacks the Jesuit, rips off his crucifix, and stamps it into the dust to show the daimyō that the priest is his enemy. The Japanese, who know only the Catholic version of Christianity, are shocked by the gesture. Yabu sentences Blackthorne and his crew to death. However, Omi, who is quickly proving himself as a clever adviser, convinces Yabu to spare them to learn more about European ways.     Omi throws the Erasmus crew into a pit to tame them, and tells them Lord Yabu has ordered that they pick one amongst them to die, so that the others may live. Blackthorne leads his crew in a futile resistance, but they are easily cowed by Omi. One of them is taken and is boiled alive, to satisfy Lord Yabu, who cruelly enjoys such spectacles.     To save his crew, Blackthorne agrees to submit to Japanese authority. He is placed in a household, with his crew held in the pit as hostages to ensure his submission. On Omis advice, Yabu also plans to confiscate the guns and money recovered from Erasmus, but word reaches Lord Toranaga, the powerful president of the Council of Regents. Toranaga sends his commander in chief, General Toda Iron Fist Hiro-matsu, to take Erasmus and the crew to gain an advantage against Toranagas main rival on the council, Ishido.     Blackthorne is given the name Anjin because the Japanese cant pronounce his name. Blackthorne insists on being addressed respectfully, as Omi is, and is therefore known as Anjin-san . Hiro-matsu confiscates Erasmus and takes Blackthorne and Yabu back to Osaka, where the meeting of the Council is taking place at Osaka castle, which is Ishidos stronghold. They travel by one of Toranagas galleys, piloted by the Portuguese pilot Rodrigues. Blackthorne and Rodrigues find themselves in a grudging friendship, despite being required to stay at arms length due to their national and religious enmity. Rodrigues tries to kill Blackthorne during a storm by sending him forward just as a wave breaks over the deck, but is himself swept overboard by the next wave. Blackthorne not only saves Rodrigues but safely navigates the ship to Osaka with all aboard.     At Osaka, Blackthorne is interviewed by Toranaga through the translation of the Jesuit priest Martin Alvito, who is more sophisticated and higher up in the Jesuit hierarchy, and therefore realizes the dangerous threat that Blackthorne presents. Blackthorne demands that Alvito tell Toranaga that the priest is his enemy. As an English Protestant, Blackthorne tries to turn Toranaga against the Jesuits. He reveals to a surprised Toranaga that the Christian faith is divided and that other European countries intend to sail the Asian waters now that the Spanish Armada has been defeated. The stunned Alvito is honor-bound to translate as Blackthorne, the sworn enemy of his country and religion tells Toranaga his full story.     The interview ends abruptly when Ishido enters, curious about the barbarian Blackthorne. Toranaga has Blackthorne thrown into prison as a ruse to keep him from Ishido. Blackthorne is then befriended by a Franciscan friar in the prison, who reveals further details about the Jesuit conquests and the Portuguese ": null
    },
    {
        "Black Ship": "black ships"
    },
    {
        ", which each year takes the vast profits from the ": null
    },
    {
        "silk trade": "silk trade"
    },
    {
        " between China and Japan back to Europe. He is taught some basic Japanese and a little about their culture. Blackthorne is then taken from prison by Ishidos men, but Toranaga intervenes, capturing Blackthorne from his rival and making Ishido ": null
    },
    {
        "lose face": "lose face"
    },
    {
        ".     In their next interview, Toranaga has the Lady Toda Mariko translate. She is a convert to Christianity, torn between her new faith and her loyalty, as a samurai, to Toranaga. During this second interview with Blackthorne, Toranaga is incredulous when Blackthorne reveals that Portugal has been granted the right to claim Japan as territory by the Pope, and how the Spanish and Portuguese are exploiting the New World in both South America and Asia in the name of spreading Catholicism.     During his stay with Toranaga at Osaka Castle, Blackthorne is attacked by an assassin who is revealed to be a member of the secretive ": null
    },
    {
        "Amida Tong": "amida tong"
    },
    {
        ", a group of operatives who train all their lives to be the perfect weapon for one kill. After the assassin is dispatched, Toranaga summons Yabu the next day for questioning, since Hiro-matsu says Yabu would be one who would know how to hire them. Yabu is truthful in his answers, adding more fuel to Toranagas distrust of him. It is also hinted that the Jesuits may have hired the assassin to kill Blackthorne, to prevent him from revealing any more of what he knows.     The Council of Regents negotiations goes badly and Toranaga is threatened with forced ": null
    },
    {
        "seppuku": "seppuku"
    },
    {
        " by the Council. To escape the verdict, and to paralyze the Council , Toranaga resigns from the Council. He departs the castle in the guise of his consort in a ": null
    },
    {
        "litter": "sedan chair"
    },
    {
        ", leaving with a train of travelers. Blackthorne inadvertently spots the exchange and, when Ishido shows up at the gate of the castle and nearly discovers Toranaga, Blackthorne saves Toranaga by creating a diversion. In this way, he gradually gains the trust of Toranaga and enters into his service. Toranagas party reaches the coast but their ship is ": null
    },
    {
        "blockaded": "blockaded"
    },
    {
        " by Ishidos boats. At Blackthornes suggestion, a nearby Portuguese ship is asked to lend cannon to blast the boats clear but, in return, the Jesuits will only offer aid to Toranaga in exchange for physical custody of Blackthorne. Toranaga agrees and the ship clears the coast. The Portuguese pilot, Rodrigues, repays his debt to Blackthorne by having him thrown overboard to swim back to Toranagas ship. Toranagas ship escapes by staying alongside the Portuguese ship as both pass through the gap left between the opposing boats. Toranaga and his party return to his ship, which then goes back to Anjiro.     Blackthorne slowly builds up his Japanese-language skills and gains an understanding of the Japanese people and their culture, eventually learning to respect it deeply. The Japanese, in turn, are torn over Blackthornes presence , but also a formidable sailor and navigator with extensive knowledge of the world outside Japan. As such, he is both beneath their contempt and incalculably valuable. A turning point is Blackthornes attempt at ": null
    },
    {
        "seppuku": "seppuku"
    },
    {
        " upon finding out that Yabu has threatened the peasants with death if Blackthorne does not learn Japanese within six months. In so doing, he shows his willingness to give up his life in payment for theirs, despite the Christian injunction against suicide. The Japanese prevent this attempt , but they also come to respect this barbarian for his knowledge and attempts to assimilate to their culture. When he also rescues Toranaga in an earthquake, he is granted the status of ": null
    },
    {
        "samurai": "samurai"
    },
    {
        " and  hatamoto  – a high-status vassal similar to a retainer, with the right of direct audience. As they spend more time together, Blackthorne comes to deeply admire both Toranaga and Mariko, and they secretly become lovers.     There are many internal conflicts between the Eastern and Western cultures – especially to do with diet, obligations, hierarchies, loyalties, and – more particularly – the essence of self. Blackthorne is also torn between his growing affection for Mariko , his increasing loyalty to Toranaga, and his desire to return to the open seas aboard his ship Erasmus to capture the Black Ship – the main conduit of silk from China to Japan.     Eventually, he visits the survivors of his original crew in ": null
    },
    {
        "Yedo": "yedo"
    },
    {
        ", and is astonished at how far he has ventured from the standard European way of life , and he is actually disgusted by them. Blackthornes plans to attack the Black Ship are also complicated by his respect and friendship for his Portuguese colleague, Rodrigues, who is now to pilot the vessel. He returns to Osaka by sea with his crew and with many samurai .     In parallel with this plot, the novel also details the intense power struggle between the various war-lords, Toranaga and Ishido, and also  – as a subtext  – the political manoeuvring of the Protestant and Catholic powers in the Far East. There is also an internal conflict between Christian daimyōs and the daimyōs who oppose the Christians, as followers of foreign beliefs and representatives of the barbarian cultural and fiscal influence on their society.     In the novel, Ishido is holding many family members of the other daimyōs as ": null
    },
    {
        "hostages": "sankin kōtai"
    },
    {
        " in Osaka, referring to them as guests . As long as he has these hostages, the other daimyōs, including Toranaga, do not dare to attack him. Unforeseen by Toranaga, a replacement regent has also been chosen. Ishido hopes to lure or force Toranaga into the castle and, when all the regents are present, obtain from them an order for Toranaga to commit seppuku. To extricate Toranaga from this situation, Mariko goes to what will be her likely death at Osaka Castle  – to face down Ishido and to obtain the hostages release.     At the castle, Mariko defies Ishido and forces him to either dishonor himself or to back down and let them leave. When Mariko tries to fulfill Toranagas orders and to leave the castle, a battle ensues between Ishidos samurai and her escort, until she is forced to return. However, she states that since she cannot disobey an order from her liege lord, Toranaga, she is disgraced and will commit suicide. As she is about to do so, Ishido gives her the papers to leave the castle on the next day. But that night, a group of ": null
    },
    {
        "ninja": "ninja"
    },
    {
        " that Ishido has hired, aided by Yabu, who had previously been Toranagas vassal, slips into Toranagas section of the castle to kidnap Mariko. However, she and Blackthorne and the other ladies of Toranagas court , escape into a locked room. As the ninja prepare to blow the door open with explosives, Mariko stands against the door and declares that this is her act of honourable suicide, and implicates Ishido in this shameful act .     Mariko is killed by the explosion and Blackthorne is injured , but Ishido is forced to let Blackthorne and all the other hostages leave the castle, seriously reducing his influence and power over them. Blackthorne then discovers that his ship has been burned, ruining his chances of attacking the Black Ship and gaining riches and also sailing home to England. However, Mariko has left him some money and Toranaga provides him with men to start building a new ship. Toranaga orders Yabu – who he learns had helped the attack in Osaka with the aim of being on the winning side – to commit ": null
    },
    {
        "seppuku": "seppuku"
    },
    {
        " for his treachery. Yabu complies, giving his own prized  katana  , which had been previously given to him by Toranaga, to Blackthorne, saying that no one else deserves the blade.     A recurring motif in the book is Toranaga engaging in ": null
    },
    {
        "falconry": "falconry"
    },
    {
        ". He compares his various birds to his vassals and mulls over his handling of them, flinging them at targets, giving them morsels, and bringing them back to his fist, and then re-hooding them. There are other recurring themes of Eastern values, as opposed to Western values; masculine values as opposed to human values, etc.     The last chapter involves Toranaga letting his prize peregrine falcon fly free, as he reveals his inner monologue: that he himself had ordered Blackthornes ship to be burned, as a way to placate the Christian daimyōs, and to save Blackthornes life from them, as well as to bring them to his side against Ishido. He then encourages Blackthorne to build another ship, although he will eventually have that one burned as well, as Japan  – in that era  – can only survive properly without Western influences. It is Blackthornes ": null
    },
    {
        "karma": "karma"
    },
    {
        " to never leave Japan; and Marikos ": null
    },
    {
        "karma": "karma"
    },
    {
        " to die gloriously for her lord, and for Toranagas own karma to become eventually Shogun  – Supreme Military Dictator, with absolute power.     In a brief epilogue after the final Battle of Sekigahara, Ishido is captured alive . In reference to an old prophecy that Ishido would die an old man with his feet firmly planted in the earth, the most famous man in the land , Toranaga has him buried up to his neck by the  eta  villagers, with passers-by being offered the opportunity to saw at the most famous neck in the realm with a bamboo saw. The novel states that Ishido lingered three days and died very old .     Shogun was based on an actual series of events involving a real sailor  who reached Japan in 42 and became involved with the future shogun ": null
    },
    {
        "Tokugawa Ieyasu": "tokugawa ieyasu"
    },
    {
        ". He achieved high status, though much of the interaction between the various characters in the novel was invented.       Many of the characters in the novel are based on their real-life counterparts:   Yoshi Toranaga – ": null
    },
    {
        "Tokugawa Ieyasu": "tokugawa ieyasu"
    },
    {
        "   Yoshi Sudara – ": null
    },
    {
        "Tokugawa Hidetada": "tokugawa hidetada"
    },
    {
        "   Yoshi Naga – ": null
    },
    {
        "Takeda Nobuyoshi": "takeda nobuyoshi"
    },
    {
        "   Ishido – ": null
    },
    {
        "Ishida Mitsunari": "ishida mitsunari"
    },
    {
        "   Ochiba – ": null
    },
    {
        "Yodo-dono": "yodo-dono"
    },
    {
        "   Yaemon – ": null
    },
    {
        "Toyotomi Hideyori": "toyotomi hideyori"
    },
    {
        "   Onoshi - ": null
    },
    {
        "Otani Yoshitsugu": "otani yoshitsugu"
    },
    {
        "   Harima - ": null
    },
    {
        "Arima Harunobu": "arima harunobu"
    },
    {
        "   Kiyama - ": null
    },
    {
        "Konishi Yukinaga": "konishi yukinaga"
    },
    {
        "   Sugiyama - ": null
    },
    {
        "Maeda Toshiie": "maeda toshiie"
    },
    {
        "   Zataki - ": null
    },
    {
        "Satake Yoshinobu": "satake yoshinobu"
    },
    {
        "   John Blackthorne – Miura Anjin/": null
    },
    {
        "William Adams": "william adams"
    },
    {
        "   Vinck – ": null
    },
    {
        "Jan Joosten van Lodensteijn": "jan joosten van lodensteijn"
    },
    {
        "   Toda Mariko – ": null
    },
    {
        "Hosokawa Gracia": "hosokawa gracia"
    },
    {
        "   Toda Hiro-matsu Iron Fist – ": null
    },
    {
        "Hosokawa Fujitaka": "hosokawa fujitaka"
    },
    {
        "   Toda Buntaro – ": null
    },
    {
        "Hosokawa Tadaoki": "hosokawa tadaoki"
    },
    {
        "   Toda Saruji – ": null
    },
    {
        "Hosokawa Tadatoshi": "hosokawa tadatoshi"
    },
    {
        "   Goroda – ": null
    },
    {
        "Oda Nobunaga": "oda nobunaga"
    },
    {
        "   Nakamura – ": null
    },
    {
        "Toyotomi Hideyoshi": "toyotomi hideyoshi"
    },
    {
        "   Akechi Jinsai – ": null
    },
    {
        "Akechi Mitsuhide": "akechi mitsuhide"
    },
    {
        "   Martin Alvito – ": null
    },
    {
        "João Rodrigues ": "joão rodrigues"
    },
    {
        " Black Ship": "black ship"
    },
    {
        " in 42       Clavell stated that reading a sentence in his daughters textbook that stated that in 42 an Englishman went to Japan and became a samurai inspired the novel.      The first draft was 42 pages and Clavell got it down to 42 with the help of his editor, German Gollob. Book Business: Paperback Magruder Sawed-Off Shogun Engulfed   By JOYCE ILLIG. The Washington Post 42 February 42: 42       I cant remember when a novel has seized my mind like this one.  The New York Times s Webster Schott wrote. He added, Its almost impossible not to continue to read Shōgun once having opened it .      In addition to becoming a best-seller, with more than six million copies of the novel in 42 hardcover and 42 paperback printings by 42 Shōgun had great impact on westerners knowledge of, and interest in, Japanese history and culture. The editor of Learning from Shōgun: Japanese History and Western Fantasy estimated that 42 to 42% of all students in American college-level courses about Japan had read the novel. He described the book as a virtual encyclopedia of Japanese history and culture; somewhere among those half-million words, one can find a brief description of virtually everything one wanted to know about Japan , and stated that sheer quantity, Shōgun has probably conveyed more information about Japan to more people than all the combined writings of scholars, journalists, and novelists since the ": null
    },
    {
        "Pacific War": "pacific war"
    },
    {
        " .  The author of James Clavell: A Critical Companion calls the novel one of the most effective depictions of cross-cultural encounters ever written , and Clavells finest effort .      Clavell said that Shōgun is B.C. and A.D. It made me. I became a brand name, like ": null
    },
    {
        "Heinz Baked Beans": "heinz baked beans"
    },
    {
        " . Clavell bullies the bullies now that hes No. 42   Allemang, John. The Globe and Mail 42 November 42: E.42 He reported that the ruler of a Middle Eastern ": null
    },
    {
        "petrostate": "petrostate"
    },
    {
        " offered him a full ": null
    },
    {
        "oil tanker": "oil tanker"
    },
    {
        " for a novel that would do for his country what Shōgun did for Japan.        In 42 Clavell hired ": null
    },
    {
        "Robert Bolt": "robert bolt"
    },
    {
        " to write a screenplay. Mazursky: Next Stop New York   Kilday, Gregg. Los Angeles Times 42 September 42: d42       The novel was adapted as a nine-hour ": null
    },
    {
        "television miniseries": "shōgun"
    },
    {
        " in 42 a ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " musical, and several computer games. The television series starred ": null
    },
    {
        "Richard Chamberlain": "richard chamberlain"
    },
    {
        ", ": null
    },
    {
        "Toshiro Mifune": "toshiro mifune"
    },
    {
        ", ": null
    },
    {
        "Yoko Shimada": "yoko shimada"
    },
    {
        ", and ": null
    },
    {
        "John Rhys-Davies": "john rhys-davies"
    },
    {
        ". It was also edited into a two-hour theatrical release, a 42-disc DVD release in 42 and a 42-disc Blu-ray release in 42     There have been three computer games based on the Shōgun novel. Two ": null
    },
    {
        "text-based adventure": "text adventure"
    },
    {
        " games with sparse graphics were produced for the ": null
    },
    {
        "Amiga": "amiga"
    },
    {
        " and PC, and marketed as  James Clavells Shōgun , by ": null
    },
    {
        "Infocom": "infocom"
    },
    {
        ", and Shōgun by ": null
    },
    {
        "Mastertronic": "mastertronic"
    },
    {
        ". A unique graphical adventure game, Shōgun, was also produced for systems including the ": null
    },
    {
        "Commodore 42": "commodore 64"
    },
    {
        ", ": null
    },
    {
        "Amstrad CPC": "amstrad cpc"
    },
    {
        " and ": null
    },
    {
        "IBM PC": "ibm pc"
    },
    {
        " by Lee & Mathias and released by ": null
    },
    {
        "Virgin Entertainment": "virgin entertainment"
    },
    {
        " in 42     On August 42 42 it was announced that ": null
    },
    {
        "FX": "fx"
    },
    {
        " would be adapting the novel into a miniseries.           Clavell was not the first author to novelise the story of Will Adams; several earlier and less successful attempts exist. The first, by ": null
    },
    {
        "William Dalton": "william dalton"
    },
    {
        ", was called Will Adams, The First Englishman in Japan: A Romantic Biography . Dalton had never been to Japan and his book reflects romanticised Victorian British notions of the exotic Asian. Richard Blakers The Needlewatcher is the least romantic of the novels; Blaker consciously attempted to de-mythologize Adams and write a careful historical work of fiction. ": null
    },
    {
        "James Scherer": "james scherer"
    },
    {
        "s Pilot and Shōgun is less a novel than a series of incidents in Adams life. American ": null
    },
    {
        "Robert Lund": "robert lund"
    },
    {
        " wrote Daishi-san . Finally ": null
    },
    {
        "Christopher Nicole": "christopher nicole"
    },
    {
        "s Lord of the Golden Fan was published just two years before Shōgun, in 42 Adams is portrayed as sexually frustrated by the morals of his time and seeks freedom in the East, where he has numerous encounters. The work is considered light pornography.": null
    }
]