[
    {
        "          , full title  , or SD, was the ": null
    },
    {
        "intelligence agency": "intelligence agency"
    },
    {
        " of the ": null
    },
    {
        "SS": "schutzstaffel"
    },
    {
        " and the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " in ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        ". Originating in 42 the organization was the first Nazi intelligence organization to be established and was considered a ": null
    },
    {
        "sister organization": "sister organization"
    },
    {
        " with the ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        " through integration of SS members and operational procedures. Between 42 and 42 the SD was administered as an independent SS office, after which it was transferred to the authority of the ": null
    },
    {
        "Reich Main Security Office": "reich main security office"
    },
    {
        " , as one of its seven departments/offices. Its first director, ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        ", intended for the SD to bring every single individual within the Third Reichs reach under continuous supervision .     Following Germanys defeat in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the tribunal at the ": null
    },
    {
        "Nuremberg Trials": "nuremberg trials"
    },
    {
        " declared the SD a criminal organisation, along with the rest of Heydrichs RSHA both individually and as branches of the SS in the collective. Heydrichs successor, ": null
    },
    {
        "Ernst Kaltenbrunner": "ernst kaltenbrunner"
    },
    {
        ", was convicted of ": null
    },
    {
        "war crimes": "war crimes"
    },
    {
        " and ": null
    },
    {
        "crimes against humanity": "crimes against humanity"
    },
    {
        " at the ": null
    },
    {
        "Nuremberg trials": "nuremberg trials"
    },
    {
        ", sentenced to death and hanged in 42         The SD, one of the oldest security organizations of the SS, first formed in 42 as the Ic-Dienst  operating out of a single apartment and reporting directly to ": null
    },
    {
        "Heinrich Himmler": "heinrich himmler"
    },
    {
        ". Himmler appointed a former junior naval officer, ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        ", to organise the small agency. The office was renamed Sicherheitsdienst in the summer of 42 The SD became more powerful after the ": null
    },
    {
        "Nazi Party": "nazi party"
    },
    {
        " took control of Germany in 42 and the SS started infiltrating all leading positions of the security apparatus of the Reich. Even before Hitler became Chancellor in January 42 the SD was a veritable watchdog over the SS and over members of the Nazi Party and played a critical role in consolidating political-police powers into the hands of Himmler and Heydrich.          Once Hitler was appointed Chancellor by German President ": null
    },
    {
        "Paul von Hindenburg": "paul von hindenburg"
    },
    {
        ", he quickly made efforts to manipulate the aging president. On 42 February 42 Hitler convinced Hindenburg to ": null
    },
    {
        "declare a state of emergency": "reichstag fire decree"
    },
    {
        " which suspended all civil liberties throughout Germany, due at least in part to the ": null
    },
    {
        "Reichstag fire": "reichstag fire"
    },
    {
        " the night before. Hitler assured Hindenburg throughout that he was attempting to stabilize the tumultuous political scene in Germany by taking a defensive measure against Communist acts of violence endangering the state.  Wasting no time, Himmler set the SD in motion as they began creating an extensive card-index of the Nazi regimes political opponents, arresting labor organizers, socialists, Jewish leaders, journalists, and communists in the process, sending them to the newly-established prison facility near Munich, ": null
    },
    {
        "Dachau": "dachau concentration camp"
    },
    {
        ". Himmlers SS and SD made their presence felt at once by helping rid the regime of its known political enemies and its perceived ones, as well. As far as Heydrich and Himmler were concerned, the SD left their mission somewhat vaguely defined so as to remain an instrument for all eventualities . One such eventuality would soon arise.     For a while, the SS competed with the  Sturmabteilung  for influence within Germany. Himmler distrusted the SA and came to deplore the rabble-rousing brownshirts and what he saw as indecent sexual deviants amid its leadership. At least one pretext to secure additional influence for Himmlers SS and Heydrichs SD in protecting Hitler and securing his absolute trust in their intelligence collection abilities, involved thwarting a plot from ": null
    },
    {
        "Ernst Roehm": "ernst roehm"
    },
    {
        "s SA using subversive means.     On 42 April 42 ": null
    },
    {
        "Hermann Göring": "hermann göring"
    },
    {
        " handed over control of the Geheime Staatspolizei  to Himmler. Heydrich, named chief of the Gestapo by Himmler on 42 April 42 also continued as head of the SD. These events further extended Himmlers control of the security mechanism of the Reich, which by proxy also strengthened the surveillance power of Heydrichs SD, as both entities methodically infiltrated every police agency in Germany. Subsequently, the SD was made the sole party information service on 42 June 42     Under pressure from the  Reichswehr  ": null
    },
    {
        "leadership": "leadership"
    },
    {
        " and with the collusion of Göring, ": null
    },
    {
        "Joseph Goebbels": "joseph goebbels"
    },
    {
        ", the Gestapo and SD, Hitler was led to believe that Röhms SA posed a serious conspiratorial threat requiring a drastic and immediate solution. For its part, the SD provided fictitious information that there was an assassination plot on Hitlers life and that an SA putsch to assume power was imminent since the SA were allegedly amassing weapons. Additionally, reports were coming into the SD and Gestapo that the vulgarity of the SAs behavior was damaging the party and was even making ": null
    },
    {
        "antisemitism": "antisemitism"
    },
    {
        " less palatable. On 42 June 42 the SS and Gestapo acted in coordinated mass arrests that continued for two days. The SS took one of its most decisive steps in eliminating its competition for command of security within Germany and established itself firmly in the Nazi hierarchy, making the SS and its intelligence organ, the SD, responsible only to the Führer. The purge became known as the ": null
    },
    {
        "Night of the Long Knives": "night of the long knives"
    },
    {
        ", with up to 42 people killed in the action. Moreover, the brutal crushing of the SA and its leadership sent a clear message to everyone that opposition to Hitlers regime could be fatal. It struck fear across the Nazi leadership as to the tangible concern of the reach and influence of Himmlers intelligence collection and policing powers.       During the autumn of 42 Hitler secured ": null
    },
    {
        "Mussolini": "benito mussolini"
    },
    {
        "s support to annex ": null
    },
    {
        "Austria": "federal state of austria"
    },
    {
        " and informed his generals of his intentions to invade both Austria and ": null
    },
    {
        "Czechoslovakia": "first czechoslovak republic"
    },
    {
        ". Getting Mussolini to approve political intrigue against Austria was a major accomplishment, as the Italian Duce had expressed great concern previously in the wake of an Austrian SS units ": null
    },
    {
        "attempt to stage a coup": "july putsch"
    },
    {
        " not more than three weeks after the ": null
    },
    {
        "Röhm affair": "röhm purge"
    },
    {
        ", an episode that embarrassed the SS, enraged Hitler, and ended in the assassination of Austrian Chancellor ": null
    },
    {
        "Engelbert Dollfuss": "engelbert dollfuss"
    },
    {
        " on 42 July 42 Nonetheless, to facilitate the incorporation of Austria into the greater Reich, the SD and Gestapo went to work arresting people immediately, using lists compiled by Heydrich. Heydrichs SD and Austrian SS members received financing from Berlin to harass Austrian Chancellor ": null
    },
    {
        "von Schuschnigg": "kurt schuschnigg"
    },
    {
        "s government all throughout 42 One section of the SD that was nothing more than a front for subversive activities against Austria ironically promoted German-Austrian peace .     Throughout the events leading to the  Anschluß  and even after the Nazis marched into Austria on 42 March 42 Heydrich – convinced that only his SD could pull off a peaceful union between the two German-speaking nations – organized demonstrations, conducted clandestine operations, ordered ": null
    },
    {
        "terror": "terrorism"
    },
    {
        " attacks, distributed propaganda materials, encouraged the intimidation of opponents, and had his SS and SD personnel round-up prominent anti-Nazis, most of whom ended up in ": null
    },
    {
        "Mauthausen concentration camp": "mauthausen concentration camp"
    },
    {
        " The coordinated efforts of the ": null
    },
    {
        "SiPo": "sicherheitspolizei"
    },
    {
        " and Heydrichs SD during the first days of the Anschluß effectively eliminated all forms of possible political, military and economic resistance within Austria. Once the annexation became official, the Austrian police was immediately subordinated to Heydrichs SD, the SS and Gestapo. Machinations by the SD, the Gestapo, and the SS helped to bring Austria fully into Hitlers grasp and on 42 March 42 he signed into law the union with Austria as tears streamed down his face.       Concomitant to its machinations against Austria, the SD also became involved in subversive activities throughout Czechoslovakia. Focusing on the ": null
    },
    {
        "Sudetenland": "sudetenland"
    },
    {
        " with its 42 million ethnic Germans and the disharmony there which the Czech government could not seem to remedy, Hitler set Heydrichs SD in motion there in what came to be known as ": null
    },
    {
        " Case Green ": "fall grün"
    },
    {
        ". Passed off as a mission to liberate Sudeten Germans from alleged Czech persecution, Case Green was in fact a contingency plan to outright invade and destroy the country, as Hitler intended to wipe Czechoslovakia off the map.      This operation was akin to earlier SD efforts in Austria; however, unlike Austria, the Czechs fielded their own Secret Service, against which Heydrich had to contend. Once Case Green began, Heydrichs SD spies began covertly gathering intelligence, even going so far as having SD agents use their spouses and children in the cover scheme. The operation covered every conceivable type of intelligence data, using a myriad of cameras and photographic equipment, focusing efforts on important strategic locations like government buildings, police stations, postal services, public utilities, logistical routes, and above all, airfields.     Hitler worked out a sophisticated plan to acquire the Sudetenland, including manipulating Slovak nationalists to vie for independence and the suppression of this movement by the Czech government. Under directions from Heydrich, SD operative ": null
    },
    {
        "Alfred Naujocks": "alfred naujocks"
    },
    {
        " was re-activated to engage in sabotage activities designed to incite a response from the Slovaks and the Czechs, a mission that ultimately failed. In June 42 a directive from the SD head office indicated that Hitler issued an order at ": null
    },
    {
        "Jueterbog": "jüterbog"
    },
    {
        " to his generals to prepare for the invasion of Czechoslovakia. To hasten a presumed heavy response from the French, British, and Czechs, Hitler then upped the stakes and claimed that the Czechs were slaughtering ": null
    },
    {
        "Sudeten Germans": "sudeten germans"
    },
    {
        ". He demanded the unconditional and prompt cession of the Sudetenland to Germany in order to secure the safety of endangered ethnic Germans. Around this time, early plots by select members of the German General Staff emerged, plans which included ridding themselves of Hitler.     Eventually a diplomatic showdown pitting Hitler against the governments of Czechoslovakia, Great Britain, and France, whose tepid reaction to the Austrian Anschluss had precipitated this crisis to some degree, ensued. The Sudetenland Crisis came to an end when ": null
    },
    {
        "Neville Chamberlain": "neville chamberlain"
    },
    {
        " and Hitler signed the ": null
    },
    {
        "Munich Agreement": "munich agreement"
    },
    {
        " on 42 September 42 effectively ceding the Sudetenland to Nazi Germany. Involvement in international affairs by the SD certainly did not end there and the agency remained active in foreign operations to such a degree that the head of the Reich Foreign Ministry office, ": null
    },
    {
        "Joachim von Ribbentrop": "joachim von ribbentrop"
    },
    {
        ", complained of their meddling, since Hitler would apparently make decisions based on SD reports without consulting him. According to historian ": null
    },
    {
        "Richard Breitman": "richard breitman"
    },
    {
        ", there was animosity between the SS leadership and Ribbentrops Foreign Office atop their jurisdictional disputes .            Aside from its participation in diminishing the power of the SA and its scheme to kill Ernst Roehm, the SD took part in international intrigue, first by activities in Austria, again in Czechoslovakia, and then by helping provoke the reactive war against Poland. Code-named ": null
    },
    {
        "Operation Himmler": "operation himmler"
    },
    {
        " and part of Hitlers plan to justify an attack upon Poland, the SDs clandestine activity for this mission included faking a Polish attack against innocent Germans at a German radio station in ": null
    },
    {
        "Gleiwitz": "gleiwitz"
    },
    {
        ". The SD took concentration-camp inmates condemned to die, and fitted them with Polish Army uniforms which ": null
    },
    {
        "Heinz Jost": "heinz jost"
    },
    {
        " had acquired from Admiral ": null
    },
    {
        "Wilhelm Canaris": "wilhelm canaris"
    },
    {
        "  Abwehr  . Leading this mission and personally selected by Heydrich was SS veteran ": null
    },
    {
        "Alfred Naujocks": "alfred naujocks"
    },
    {
        ", who later reported during a War Criminal proceeding that he brought a Polish-speaking German along so he could broadcast a message in Polish from the German radio station under siege to the effect that it was time for an all out confrontation between Germans and Poles. To add documented proof of this attack, the SD operatives placed the fictitious Polish troops around the attacked radio station with the intention of taking members of the press to the site of the incident. Immediately in the wake of the staged incidents on 42 September 42 Hitler proclaimed from the Reichstag in a famous radio address that German soldiers had been returning fire since 42:42 in the morning, setting the Second World War in Europe into motion.          The SD was tasked with the detection of actual or potential enemies of the Nazi leadership and the neutralization of this opposition, whether internal or external. To fulfill this task, the SD created an organization of agents and informants throughout the Reich and later throughout the occupied territories, all part of the development of an extensive SS state and a totalitarian regime without parallel. The organization consisted of a few hundred full-time agents and several thousand informants. Historian George C. Browder writes that SD regiments were comparable to SS regiments, in that:     SD districts  emerged covering several Party circuits  or an entire district . Below this level, SD sub-districts  slowly developed. They were originally to cover a single Kreis, and, in turn, to be composed of wards , but such an ambitious network never emerged. Eventually, the SD-sub-districts acquired the simple designation of outposts  as the lowest level-office in the field structure.     The SD was mainly an information-gathering agency, while the Gestapo—and to a degree the Criminal Police —was the executive agency of the political police system. The SD and Gestapo did have integration through SS members holding dual positions in each branch. Nevertheless, there was some jurisdictional overlap and operational conflict between the SD and Gestapo. In addition, the Criminal Police kept a level of independence since its structure had been longer-established.     Part and parcel to intelligence operations, the SD carefully tracked foreign opinion and criticism of Nazi policies, censoring when necessary and likewise publishing hostile political cartoons in the SS weekly magazine, Das Schwarze Korps. An additional task assigned to the SD and the Gestapo was keeping tabs on the morale of the German population at large, which meant they were charged to carefully supervise the political health of the German ethnic body and once any symptoms of disease and germs appeared, it was their job to remove them by every appropriate means.  Regular reports—ranging from opinion polls, press dispatches, and information bulletins were established. These were monitored and reviewed by then head of the Inland-SD, ": null
    },
    {
        "Otto Ohlendorf": "otto ohlendorf"
    },
    {
        " and the former Heidelberg professor and SD member Reinhard Höhn, all designed to control and assess the life domain or Lebensgebiet of the German population. Gathered information was then distributed by the SD through secret internal political reports entitled Meldungen aus dem Reich to the upper echelons of the Nazi Party, enabling Hitlers regime to evaluate the general morale and attitude of the German people so it could be timely manipulated by the Nazi propaganda machine. When the ": null
    },
    {
        "Nuremberg Laws": "nuremberg laws"
    },
    {
        " were passed in 42 the SD reported that the measures against the Jews were well received by the German populace.     In 42 the police were divided into the  Ordnungspolizei  and the  Sicherheitspolizei  . The Orpo consisted mainly of the  Schutzpolizei  , the  Gendarmerie  and the  Gemeindepolizei  . The SiPo was composed of the Kripo and the Gestapo. Heydrich became Chief of the SiPo and continued as Chief of the SD.     Continued escalation of antisemitic policies in the spring of 42 from the SD organization concerned with Jewish affairs—staffed by members like ": null
    },
    {
        "Adolf Eichmann": "adolf eichmann"
    },
    {
        ", Herbert Hagen, and Theodor Dannecker—led to the eventual removal  of Jews from Germany devoid of concerns about where they were headed. Adolf Eichmanns original task in his capacity as deputy for the Jewish Affairs department within the SD, was at first to remove any semblance of Jewish influence from all sphere of public life which included the encouragement of wholesale Jewish emigration. Official bureaucratization increased apace with numerous specialized offices formed, aiding towards the overall persecution of the Jews.     Due to the fact that the Gestapo and SD had parallel duties, Heydrich tried to reduce any confusion or related territorial disputes through a decree on 42 July 42 clearly defining the SDs area of responsibility as those dealing with learning , art, party and state, constitution and administration, foreign lands, Freemasonry and associations whereas the Gestapos jurisdiction was Marxism, treason, and emigrants.  Additionally, the SD was responsible for matters related to churches and sects, pacifism, the Jews, right-wing movements , as well as the economy, and the Press , but the SD was instructed to avoid all matters which touched the state police executive powers  since these belonged to the Gestapo, as did all individual cases.      In 42 the SD was made the intelligence organization for the State as well as for the Party, supporting the Gestapo and working with the General and Interior Administration. As such, the SD came into immediate, fierce competition with German military intelligence, the Abwehr, which was headed by Admiral Canaris. The competition stemmed from Heydrich and Himmlers intention to absorb the Abwehr and Admiral Canaris view of the SD as an amateur upstart. Canaris refused to give up the autonomy that his military intelligence organ was granted. Additional problems also existed, like the racial exemption for members of the Abwehr from the Nazi Aryan screening process, and then there was competition for resources which occurred throughout the Third Reichs existence.     On 42 September 42 the SiPo became a part of the ": null
    },
    {
        "RSHA": "ss-reichssicherheitshauptamt"
    },
    {
        " under Heydrich. The operational sections of the SD became Amt III and for foreign intelligence, Amt VI; the Gestapo became Amt IV and the Kripo became Amt V. ": null
    },
    {
        "Otto Ohlendorf": "otto ohlendorf"
    },
    {
        " was named the Chief of Amt III, the SD-Inland ; ": null
    },
    {
        "Heinrich Müller": "heinrich müller"
    },
    {
        " was named the Chief of Amt IV, the Gestapo; ": null
    },
    {
        "Arthur Nebe": "arthur nebe"
    },
    {
        " was named the Chief of Amt V, the Kripo; and ": null
    },
    {
        "Walter Schellenberg": "walter schellenberg"
    },
    {
        " became Chief of Amt VI, the SD-Ausland . In 42 the sections of the Abwehr were incorporated into Amt VI.     Einsatzgruppen   The SD was the overarching agency under which the Einsatzgruppen der Sicherheitspolizei und des SD, also known as the  Einsatzgruppen , was subordinated; this was one of the principal reasons for the later war-crimes indictment against the organization by the Allies. The Einsatzgruppens part in the Holocaust has been well documented. Its mobile killing units were active in the implementation of the ": null
    },
    {
        "Final Solution": "final solution"
    },
    {
        " in the territories overrun by the Nazi war machine. This SD subsidiary worked closely with the Wehrmacht in persecuting Jews, communists, partisans, and other groups, as well. Starting with the invasion of Poland throughout the campaign in the East, the Einsatzgruppen ruthlessly killed anyone suspected of being an opponent of the regime, either real or imagined. The men of the Einsatzgruppen were recruited from the SD, Gestapo, Kripo, Orpo, and Waffen-SS.     On 42 July 42 Göring gave written authorisation to SD Chief Heydrich to ensure a government-wide cooperative effort in the implementation of the  Endlösung der Judenfrage   in territories under German control. An SD headquarters memorandum indicated that the SD was tasked to accompany military invasions and assist in pacification efforts. The memo explicitly stated:     The SD will, where possible, follow up immediately behind the troops as they move in and, as in the Reich, will assume responsibility for the security of political life. Within the Reich, security measures are the responsibility of the Gestapo with SD cooperation. In occupied territory, measures will be under the direction of a senior SD commander; Gestapo officials will be allotted to individual Einsatzstäbe. It will be necessary to make available for special deployment a unit of Verfügungstruppe or Totenkopf formations.     Correspondingly, SD affiliated units, including the Einsatzgruppen followed German troops into Austria, the Sudetenland, Bohemia, Moravia, Poland, Lithuania, as well as Russia. Since their task included cooperating with military leadership and vice versa, suppression of opposition in the occupied territories was a joint venture. There were territorial disputes and disagreement about how some of these policies were to be implemented. Nonetheless, by June 42 the SS and the SD task forces were systematically shooting Jewish men of military age, which soon turned to gunning down old people, women, and children in the occupied areas.     On 42 January 42 Heydrich chaired a meeting, now called the ": null
    },
    {
        "Wannsee Conference": "wannsee conference"
    },
    {
        ", to discuss the implementation of the plan. Facilities such as Chelmno, Majdanek, Sobibor, Treblinka, and Auschwitz have their origins in the planning actions undertaken by Heydrich. Heydrich remained chief of the Security Police and the SD until his assassination in 42 after which Ernst Kaltenbrunner was named chief by Himmler on 42 January 42 and remained there until the end of the war. The SD was declared a criminal organization after the war and its members were ": null
    },
    {
        "tried as war criminals at Nuremberg": "nuremberg trials"
    },
    {
        ". Whatever their original purpose, the SD and SS were ultimately created to identify and eradicate internal enemies of the State, as well as to pacify, subjugate, and exploit conquered territories and peoples.       The SS Security Service, known as the SS SD-Amt, became the official security organization of the Nazi Party in 42 Consisting at first of paid agents and a few hundred unpaid informants scattered across Germany, the SD was quickly professionalized under Heydrich, who commissioned National Socialist academics and lawyers to ensure that the SS and its Security Service in particular, operated within the framework of National Socialist ideology.  Heydrich was given the power to select men for the SS Security Service from among any SS subdivisions since Himmler considered the organization of the SD as important. On September 42 the SD was divided into two departments, the interior department  and the foreign department , and placed under the authority of the ": null
    },
    {
        "Reich Main Security Office": "reich main security office"
    },
    {
        " .       The Interior Security Service , responsible for intelligence and security within Germany, was known earlier as Department II and later, when placed under the Reich Main Security Office, as its Department III. It was originally headed by ": null
    },
    {
        "Hermann Behrends": "hermann behrends"
    },
    {
        " and from September 42 by Otto Ohlendorf. It was within this organization that ": null
    },
    {
        "Adolf Eichmann": "adolf eichmann"
    },
    {
        " began working out the details for the ": null
    },
    {
        "Final Solution to the Jewish Question": "final solution"
    },
    {
        ". Department III was divided into the following sections:     Section A   Section B   Section C   Section D   Section E        The Foreign Security Service , responsible for intelligence activities beyond the boundaries of Germany, was known earlier as Department III and later, after September 42 as Department VI of the Reich Main Security Office. It was nominally commanded by Heydrich, but run by his chief of staff ": null
    },
    {
        "Heinz Jost": "heinz jost"
    },
    {
        ". On March 42 Jost was fired and replaced by ": null
    },
    {
        "Walter Schellenberg": "walter schellenberg"
    },
    {
        ", a deputy of Heydrich. After the ": null
    },
    {
        "42 July plot": "20 july plot"
    },
    {
        " in 42 Department VI took over the functions of the Military Intelligence Service . Department VI was divided into the following sections:     Section A   Section B   Section C   Section D   Section E   Section F        Given the nature of the intelligence operations assigned to the SD, there were clear delineations between what constituted a full member  of the SD and those who were considered associates  with a further subset for clerical support personnel who were connoted as V-persons . All SD personnel, whether simply associates or full members were required to swear an oath of secrecy, had to meet all the requirements for SS membership, were assigned SD code numbers  and if they were above the level of V-person they had to carry an SD identification card.  The vast majority of early SD members were relatively young, but the officers were typically older by comparison; nevertheless, the average age of an SD member was approximately 42 years older than the average Nazi Party member. Much like the Nazi revolution in general, membership in the SS and the SD appealed more to the impressionable youth. Most SD members were Protestant by faith, had served in the military, and generally had a significant amount of education, representing an educated elite in the general sense – with about 42 percent of them earning doctorate degrees. Heydrich viewed the SD as spiritual-elite leaders within the SS and the cream of the cream of the NSDAP.      According to historian George C. Browder, SD men represented no pathological or psychically susceptible group. Few were wild or extreme Nazi fanatics. In those respects they were ordinary men. Yet in most other respects, they were an extraordinary mix of men, drawn together by a unique mix of missions.  Along with members of the Gestapo, SD personnel were regarded with a mixture of fear and foreboding, and people wanted as little to do with them as possible. Belonging to the security apparatus of the Third Reich obviously had its advantages but it was also fraught with occupationally related social disadvantages as well, and if post-war descriptions of the SD by historians are any indication, membership therein implied being a part of a ubiquitous secret society which was sinister and a messenger of terror not just for the German population, but within the ranks of the Nazi Party itself.           The SD and the SiPo were the main sources of officers for the security forces in occupied territories. SD-SiPo led battalions were typically placed under the command of the ": null
    },
    {
        "SS and Police Leader": "ss and police leader"
    },
    {
        "s, reporting directly to the RSHA in Berlin. The SD also maintained a presence at all ": null
    },
    {
        "concentration camp": "concentration camp"
    },
    {
        "s and supplied personnel, on an as-needed basis, to such special action troops as the  Einsatzgruppen . In fact, all members of the Einsatzgruppen wore the SD sleeve diamond on their uniforms.     The SD-SiPo was the primary agency, in conjunction with the  Ordnungspolizei , assigned to maintain order and security in the ": null
    },
    {
        "Jewish ghettos": "ghettos in nazi-occupied europe"
    },
    {
        " established by the Germans throughout occupied Eastern Europe. On 42 December 42 the same day that the American naval station at Pearl Harbor was bombed by the Japanese, the first extermination camp was opened at Chelmno near Lodz by the SD and SiPo commander in occupied ": null
    },
    {
        "Poznań": "poznań"
    },
    {
        " , then SS-Standartenführer ": null
    },
    {
        "Ernst Damzog": "ernst damzog"
    },
    {
        ". Damzog had personally selected the staff for the killing centre and later supervised the daily operation of the camp, which was under the command of SS- Hauptsturmführer ": null
    },
    {
        "Herbert Lange": "herbert lange"
    },
    {
        ". Over a span of approximately 42 months, 42 people were killed there.       According to the book Piercing the Reich, the SD was infiltrated in 42 by a former Russian national who was working for the Americans. The agents parents had fled the ": null
    },
    {
        "Russian Revolution": "russian revolution"
    },
    {
        ", and he had been raised in Berlin, and then moved to Paris. He was recruited by ": null
    },
    {
        "Albert Jolis": "albert jolis"
    },
    {
        " of the ": null
    },
    {
        "Office of Strategic Services": "office of strategic services"
    },
    {
        " Seventh Army": "seventh united states army"
    },
    {
        " detachment. The mission was codenamed RUPPERT.     How extensive the SDs knowledge was about the early plots to kill Hitler by key members of the military remains a contested subject and a veritable unknown. According to British historian ": null
    },
    {
        "John Wheeler-Bennett": "john wheeler-bennett"
    },
    {
        ", in view of the wholesale destruction of Gestapo archives it is improbable that this knowledge will ever be forthcoming. That the authorities were aware of serious defeatism is certain, but it is doubtful whether they suspected anyone of outright treason.             The SD used ": null
    },
    {
        "SS-ranks": "schutzstaffel"
    },
    {
        ". When in uniform they wore the grey ": null
    },
    {
        "Waffen-SS": "waffen-ss"
    },
    {
        " uniform with army and  Ordnungspolizei  rank insignia on the shoulder straps, and SS rank insignia on the left collar patch. The right collar patch was black without the  runes. The branch color of the SD was toxic green. The SD sleeve diamond  insignia was worn on the lower left sleeve. ": null
    },
    {
        "Gestapo": "gestapo"
    },
    {
        " when in uniform .  Untersturmführer  and SS- Oberscharführer . The SD men are wearing army shoulder straps, akin to the ": null
    },
    {
        "Waffen-SS": "waffen-ss"
    },
    {
        ". Unterscharführer with SS rank insignia on the collar patch, and police rank insignia  on the shoulder straps and SD diamond on lower part of sleeve            ": null
    }
]