[
    {
        "   A siddur  is a ": null
    },
    {
        "Jewish": "judaism"
    },
    {
        " prayer book": "prayer book"
    },
    {
        ", containing a set order of ": null
    },
    {
        "daily prayers": "list of jewish prayers and blessings"
    },
    {
        ". The word siddur comes from the Hebrew root  meaning order .       The earliest parts of Jewish prayer book are the  Shema Yisrael  , and the ": null
    },
    {
        "Priestly Blessing": "priestly blessing"
    },
    {
        " , which are in the ": null
    },
    {
        "Torah": "torah"
    },
    {
        ". A set of eighteen blessings called the Shemoneh Esreh or the  Amidah  , is traditionally ascribed to the ": null
    },
    {
        "Great Assembly": "great assembly"
    },
    {
        " in the time of ": null
    },
    {
        "Ezra": "ezra"
    },
    {
        ", at the end of the Biblical period.     The name Shemoneh Esreh, literally eighteen , is a historical anachronism, since it now contains nineteen blessings. It was only near the end of the ": null
    },
    {
        "Second Temple": "second temple"
    },
    {
        " period that the eighteen prayers of the weekday Amidah became standardized. Even at that time their precise wording and order was not yet fixed, and varied from locale to locale. Many modern scholars believe that parts of the Amidah came from the ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " apocrypha": "apocrypha"
    },
    {
        "l work ": null
    },
    {
        "Ben Sira": "ben sira"
    },
    {
        ".     According to the ": null
    },
    {
        "Talmud": "talmud"
    },
    {
        ", soon after the destruction of the ": null
    },
    {
        "Temple in Jerusalem": "temple in jerusalem"
    },
    {
        " a formal version of the Amidah was adopted at a rabbinical council in ": null
    },
    {
        "Yavne": "yavne"
    },
    {
        ", under the leadership of Rabban ": null
    },
    {
        "Gamaliel II": "gamaliel ii"
    },
    {
        " and his colleagues. However, the precise wording was still left open. The order, general ideas, opening and closing lines were fixed. Most of the wording was left to the individual reader. It was not until several centuries later that the prayers began to be formally fixed. By the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " the texts of the prayers were nearly fixed, and in the form in which they are still used today.     The siddur was printed by ": null
    },
    {
        "Soncino": "soncino family"
    },
    {
        " in Italy as early as 1486, though a siddur was first mass-distributed only in 1865.  The siddur began appearing in the ": null
    },
    {
        "vernacular": "vernacular"
    },
    {
        " as early as 1538. The first English ": null
    },
    {
        "translation": "translation"
    },
    {
        " was published in London in 1738 by an author writing under the ": null
    },
    {
        "pseudonym": "pseudonym"
    },
    {
        " Gamaliel ben Pedahzur; a different translation was released in the United States in 1837.       Readings from the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " and the ": null
    },
    {
        "Neviim": "neviim"
    },
    {
        " form part of the prayer services. To this framework various Jewish sages added, from time to time, various prayers, and, for festivals especially, numerous hymns.     The earliest existing codification of the prayerbook was drawn up by Rav ": null
    },
    {
        "Amram Gaon": "amram gaon"
    },
    {
        " of Sura, Babylon, about 850 CE. Half a century later Rav ": null
    },
    {
        "Saadia Gaon": "saadia gaon"
    },
    {
        ", also of Sura, composed a siddur, in which the rubrical matter is in ": null
    },
    {
        "Arabic": "arabic language"
    },
    {
        ". These were the basis of Simcha ben Samuels ": null
    },
    {
        "Machzor Vitry": "machzor vitry"
    },
    {
        " , which was based on the ideas of his teacher, ": null
    },
    {
        "Rashi": "rashi"
    },
    {
        ". Another formulation of the prayers was that appended by ": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        " to the laws of prayer in his ": null
    },
    {
        "Mishneh Torah": "mishneh torah"
    },
    {
        ": this forms the basis of the Yemenite liturgy, and has had some influence on other rites. From this point forward all Jewish prayerbooks had the same basic order and contents.     Two authoritative versions of the Ashkenazi siddur were those of Shabbetai Sofer in the 16th century and Seligman Baer in the 19th century; siddurim have also been published reflecting the views of ": null
    },
    {
        "Jacob Emden": "jacob emden"
    },
    {
        " and the ": null
    },
    {
        "Vilna Gaon": "vilna gaon"
    },
    {
        ".             There are differences among, amongst others, the ": null
    },
    {
        "Sephardic": "sephardic law and customsliturgy"
    },
    {
        " , ": null
    },
    {
        "Teimani": "yemenite jews"
    },
    {
        " ,   ": null
    },
    {
        "Chasidic": "hasidic judaism"
    },
    {
        ", ": null
    },
    {
        "Ashkenazic": "ashkenazi jews"
    },
    {
        " , ": null
    },
    {
        "Bené Roma or Italkim": "italian jewsitalian rite jews"
    },
    {
        ", ": null
    },
    {
        "Romaniote": "romaniotes"
    },
    {
        " and also Persian-, Kurdish-, Bukharian-, Georgian-, Mountain Jewish-, Ethiopian- and Cochin-Jewish liturgies. Most of these are slight differences in the wording of the prayers; for instance, Oriental Sephardic and some Hasidic prayer books state חננו מאתך חכמה בינה ודעת , Graciously bestow upon us from You wisdom , understanding  and knowledge  , in allusion to the ": null
    },
    {
        "Kabbalistic": "kabbalah"
    },
    {
        " sefirot": "sefirot"
    },
    {
        " of those names, while the Nusach Ashkenaz, as well as ": null
    },
    {
        "Western Sephardic": "spanish and portuguese jews"
    },
    {
        " and other Hasidic versions retain the older wording חננו מאתך דעה בינה והשכל , Graciously bestow upon us from You knowledge, understanding, and reason . In some cases, however, the order of the preparation for the Amidah is drastically different, reflecting the different halakhic and kabbalistic formulae that the various scholars relied on in assembling their siddurim, as well as the minhagim, or customs, or their locales.     Some forms of the Sephardi rite are considered to be very overtly ": null
    },
    {
        "kabbalistic": "kabbalah"
    },
    {
        ", depending on how far they reflect the ritual of ": null
    },
    {
        "Isaac Luria": "isaac luria"
    },
    {
        ". This is partly because the ": null
    },
    {
        "Tetragrammaton": "tetragrammaton"
    },
    {
        " frequently appears with varying vowel points beneath the letters and different Names of God appear in small print within the final hei of the Tetragrammaton. In some editions, there is a Psalm in the preparations for the ": null
    },
    {
        "Amidah": "amidah"
    },
    {
        " that is printed in the outline of a ": null
    },
    {
        "menorah": "menorah"
    },
    {
        ", and the worshipper meditates on this shape as he recites the psalm.     The Ashkenazi rite is more common than the Sephardi rite in America. While Nusach Ashkenaz does contain some kabbalistic elements, such as acrostics and allusions to the sefirot , these are not easily seen unless the reader is already initiated. It is notable that although many other traditions avoid using the poem ": null
    },
    {
        "Anim Zemirot": "anim zemirot"
    },
    {
        "h on the Sabbath, for fear that its holiness would be less appreciated due to the frequency of the Sabbath, the poem is usually sung by Ashkenazi congregations before concluding the Sabbath ": null
    },
    {
        "Musaf": "musaf"
    },
    {
        " service with the daily psalm. The ark is opened for the duration of the song.     Hasidim, though usually ethnically Ashkenazi, usually use liturgies with varying degrees of Sephardic influence, such as ": null
    },
    {
        "Nusach Sefard": "nusach sefard"
    },
    {
        " and ": null
    },
    {
        "Nusach Ari": "nusach ari"
    },
    {
        ", in order to follow the order of the prayers set by ": null
    },
    {
        "Rabbi Isaac Luria": "rabbi isaac luria"
    },
    {
        ", often called Ari HaKadosh , or The Holy Lion . Although the Ari himself was born Ashkenazi, he borrowed many elements from Sephardi and other traditions, since he felt that they followed Kabbalah and ": null
    },
    {
        "Halacha": "halacha"
    },
    {
        " more faithfully. The Ari did not publish any siddur, but orally transmitted his particular usages to his students with interpretations and certain meditations. Nusach HaAri Siddur, published by Merkos LInyonei Chinuch. Many siddurim containing some form of the Sephardic rite together with the usages of the Ari were published, both by actual Sephardic communities and for the use of Hasidim and other Ashkenazim interested in Kabbalah. In 1803, Rabbi ": null
    },
    {
        "Schneur Zalman of Liadi": "schneur zalman of liadi"
    },
    {
        " compiled an authoritative siddur from the sixty siddurim that he checked for compliance with Hebrew grammar, Jewish law, and Kabbalah: this is what is known today as the Nusach Ari , and is used by Lubavitch Hasidim. Those that use Nusach HaAri claim that it is an all-encompassing nusach that is valid for any Jew, no matter what his ancestral tribe or identity, a view attributed to the ": null
    },
    {
        "Maggid of Mezeritch": "maggid of mezeritch"
    },
    {
        ".     The ": null
    },
    {
        "Mahzor": "mahzor"
    },
    {
        " of each rite is distinguished by hymns  composed by authors . The most important writers are ": null
    },
    {
        "Yose ben Yoseh": "yose ben yoseh"
    },
    {
        ", probably in the 6th century, chiefly known for his compositions for ": null
    },
    {
        "Yom Kippur": "yom kippur"
    },
    {
        "; ": null
    },
    {
        "Eleazar Kalir": "eleazar kalir"
    },
    {
        ", the founder of the payyetanic style, perhaps in the 7th century; ": null
    },
    {
        "Saadia Gaon": "saadia gaon"
    },
    {
        "; and the Spanish school, consisting of ": null
    },
    {
        "Joseph ibn Abitur": "joseph ibn abitur"
    },
    {
        " , ": null
    },
    {
        "ibn Gabirol": "ibn gabirol"
    },
    {
        ", ": null
    },
    {
        "Isaac Gayyath": "isaac gayyath"
    },
    {
        ", ": null
    },
    {
        "Moses ibn Ezra": "moses ibn ezra"
    },
    {
        ", ": null
    },
    {
        "Abraham ibn Ezra": "abraham ibn ezra"
    },
    {
        " and ": null
    },
    {
        "Judah ha-Levi": "judah ha-levi"
    },
    {
        ", Moses ben Nahman  and ": null
    },
    {
        "Isaac Luria": "isaac luria"
    },
    {
        ". In the case of Nusach HaAri, however, many of these High Holiday piyyutim are absent: the older piyyutim were not present in the Sephardic rite, on which Nusach HaAri was based, and the followers of the Ari removed the piyyutim composed by the Spanish school.         Some siddurim have only prayers for weekdays; others have prayers for weekdays and ": null
    },
    {
        "Shabbat": "shabbat"
    },
    {
        ". Many have prayers for weekdays, Shabbat, and the three Biblical festivals, ": null
    },
    {
        "Sukkot": "sukkot"
    },
    {
        " , ": null
    },
    {
        "Shavuot": "shavuot"
    },
    {
        " and ": null
    },
    {
        "Pesach": "pesach"
    },
    {
        " . The latter are referred to as a Siddur Shalem .       There are many additional liturgical variations and additions to the siddur for the Yamim Noraim . As such, a special siddur has developed for just this period, known as a  mahzor  . The mahzor contains not only the basic liturgy, but also many piyutim, Hebrew liturgical poems. Sometimes the term mahzor is also used for the prayer books for the three pilgrim festivals, Pesach, Shavuot and Sukkot.   On  Tisha bAv , a special siddur is used that includes the text of the ": null
    },
    {
        "Book of Lamentations": "book of lamentations"
    },
    {
        ", the ": null
    },
    {
        "Torah": "torah"
    },
    {
        " and ": null
    },
    {
        "Haftarah": "haftarah"
    },
    {
        " readings for that day, and Kinot or special mournful piyyutim for that day. This siddur is usually called Kinot as well. Traditionally, every year many Jews hope that the ": null
    },
    {
        "Messiah": "messiah"
    },
    {
        " will come and the ": null
    },
    {
        "Third Temple": "third temple"
    },
    {
        " will be rebuilt, so Tisha bAv will not happen again. So after the fast ends, many traditions place their Kinot siddurim in a  geniza , or a burial place for sacred texts.       Below are listed many popular siddurim used by religious Jews. This list mostly excludes prayer books specifically for the High Holidays; see ": null
    },
    {
        "Machzor ": "machzorpopular versions"
    },
    {
        ".           https://www.korenpub.com/koren_en_usd/koren/tefilla/siddur-prayer-book/siddur-avodat-halev.html Siddur Avodat HaLev, ed. Rabbi Basil Herring    The Authorised Daily Prayer Book  , ed. ": null
    },
    {
        "Joseph Hertz": "joseph hertz"
    },
    {
        ". NY, Block Publg Co., rev. ed. 1948.    Siddur Ha-Shalem  Ed. ": null
    },
    {
        "Philip Birnbaum": "philip birnbaum"
    },
    {
        ". The Hebrew Publishing Company.    The Metsudah Siddur: A New Linear Prayer Book Ziontalis.   The Authorised Daily Prayer Book of the British Commonwealth, translation by Chief Rabbi Sir ": null
    },
    {
        "Jonathan Sacks": "jonathan sacks"
    },
    {
        "    The Artscroll Siddur, Mesorah Publications The great innovation of the Artscroll was that it was the first siddur made it possible for even a neophyte ba’al teshuvah to function gracefully in the act of prayer, bowing at the correct junctures, standing, sitting and stepping back at the correct place in the service.    Siddur Rinat Yisrael , Hotsaat Moreshet, ": null
    },
    {
        "Bnei Brak": "bnei brak"
    },
    {
        ", Israel.   Siddur Siach Yitzchak , Nederlands-Israelitisch Kerkgenootschap, Amsterdam 1975  Siddur Tefilas Kol Peh   Siddur Tefilas Shai, Feldheim Publishers : Israel/NewYork   Siddur HaGra    Siddur Aliyos Eliyahu   Siddur Kol Bo    Koren Sacks Siddur  , ": null
    },
    {
        "Koren Publishers Jerusalem": "koren publishers jerusalem"
    },
    {
        ": based on latest Singers prayer book, above    Siddur , the complete Shabbat siddur in the projected siddur Nehalel series , in which photographs juxtaposed with the texts portray their meanings. The purpose of this innovation is to direct the users attention to the meanings of the traditional prayers, thus contributing to the achieving of kavanah, a central requirement of authentic prayer. ": null
    },
    {
        "Kavanah": "kavanah"
    },
    {
        "   A rendering of both the siddur and the entire high holy day prayer book into English rhymed verse has been made by Rabbi Dr. Jeffrey M Cohen. The Siddur in Poetry and The Machzor in Poetry .     ": null
    },
    {
        "Hasidic": "hasidic judaism"
    },
    {
        " Siddurim": null
    },
    {
        "Levi Yitzchok of Berditchev": "levi yitzchok of berditchev"
    },
    {
        ", the ": null
    },
    {
        "Maggid of Kozhnitz": "maggid of kozhnitz"
    },
    {
        ", the ": null
    },
    {
        "Seer of Lublin": "seer of lublin"
    },
    {
        ", and the non-Hasidic Chief Rabbi of Lublin.Jerusalem 2011Kiryas Joel 2015": null
    },
    {
        "sidic dynas": "sidic dynas"
    },
    {
        "1900–1956828 pages in lengthand contains the original text the version currently used by ": null
    },
    {
        "Chabad-Lubavitch": "chabad-lubavitch"
    },
    {
        "original edition of the siddur redacted by ": null
    },
    {
        "Rabbi Shneur Zalman of Liadi": "rabbi shneur zalman of liadi"
    },
    {
        ", known as the Alter Rebbe of ChabadHebrew-English siddur released in 2014 with commentary based on the teachings of ": null
    },
    {
        "Breslov": "nachman of breslov"
    },
    {
        "among otherswho follow the nusach of the Berditchever Siddur with a few minor variations 3 vols. Hebrew, big clear modern Hebrew fonts1920–2013     rabbi ovadia yosef, etc. although you can follow the prayer service.  Characterised by relative absence of Kabbalistic elements: Oxford Univ. Press, ": null
    },
    {
        "Vivian Ridler": "vivian ridler"
    },
    {
        "Usually characterised by presence of Kabbalistic elements: Hebrew-GreekHebrew-GreekDaily and ShabbatUsually characterised by presence of Kabbalistic elements: Hebrew only, Livorno text, Libyan tradition5 vols.Hebrew only, Livorno text, Libyan traditionHebrew only, Meknes traditionHebrew only, Djerba traditionHebrew with Arabic translation, EgyptHebrew only, Livorno text, Moroccan, Algerian and Tunisian traditions Hebrew and French, Moroccan, Algerian and Tunisian traditions Based on the original Zechor le-Abraham: Livorno 1926, Hebrew only, Moroccan, Algerian and Tunisian traditions, days of awe onlyMoroccanUsually characterised by presence of Kabbalistic elements:Hebrew only  Edot Hamizrach editionHebrewHebrew only, based on Baghdadi textHebrew onlyminhah and arbit onlyHebrew and English, Shabbat onlyHebrew and English: Baghdadi text, Syrian variants shown in square bracketsfrom Arabic balad, country": null
    },
    {
        "Maimonides": "maimonides"
    },
    {
        "Maharitswho followed ": null
    },
    {
        "Rambams": "rambam"
    },
    {
        "rulings and the siddur as it developed in Yemen5th edition, Jerusalem 2003 Maharitsfrom Arabic ash-Sham, the north, referring to Palestine or ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        "Machon Shilo, Shilo Institute Hebrew, ": null
    },
    {
        "Minhag": "minhag"
    },
    {
        "ei ": null
    },
    {
        "Eretz Yisrael": "eretz yisrael"
    },
    {
        "  MARAMServices for Weekdays, Sabbaths, Etc.Services for The Day of Memorial and The Day of AtonementServices for Passover, Pentecost, and Tabernacles Sabbath, Festivals, and WeekdaysHigh Holidays  With All Your Heart2008 2009  Vol. 1, Prayers for Rosh Hashanah; Vol. 2, Prayers for Yom KippurRenew our daysCong. Dorshei EmetAugust 1, 1998September 1, 1998May 1, 2000October 10, 2001 Reform Judaism, Winter 199119952008Abraham, Isaac, and JacobSarah, Rebecca, Rachel, and Leah. ": null
    }
]