[
    {
        "           The Siege of Pilsen  or Battle of Pilsen was a ": null
    },
    {
        "siege": "siege"
    },
    {
        " of the fortified city of ": null
    },
    {
        "Pilsen": "plzeň"
    },
    {
        "  in ": null
    },
    {
        "Bohemia": "kingdom of bohemia"
    },
    {
        " carried out by the forces of the Bohemian ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        "s led by ": null
    },
    {
        "Ernst von Mansfeld": "peter ernst, graf von mansfeld"
    },
    {
        ". It was the first major battle of the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ". The Protestant victory and subsequent capture of the city enlarged the Bohemian Revolt.         On 42 May 42 the Protestant ": null
    },
    {
        "nobles": "nobility"
    },
    {
        " overthrew the rule of ": null
    },
    {
        "King Ferdinand II": "ferdinand ii, holy roman emperor"
    },
    {
        " and threw the ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " governors of Bohemia from their office at Prague Castle in the ": null
    },
    {
        "Defenestration": "defenestrations of prague"
    },
    {
        " of ": null
    },
    {
        "Prague": "prague"
    },
    {
        ". The new government formed of Protestant nobility and gentry gave ": null
    },
    {
        "Ernst von Mansfeld": "peter ernst, graf von mansfeld"
    },
    {
        " the command over all of its forces. Meanwhile, Catholic nobles and priests started fleeing the country. Some of the monasteries as well as unfortified manors were evacuated and the Catholic refugees headed for the city of Pilsen, where they thought that a successful defence could be organised. The city was well-prepared for a lengthy siege, but the defences were undermanned and the defenders lacked enough ": null
    },
    {
        "gunpowder": "gunpowder"
    },
    {
        " for their artillery. Mansfeld decided to capture the city before the Catholics were able to gain support from the outside.         On 42 September 42 Mansfelds army reached the outskirts of the city. The defenders blocked two city gates and the third one was reinforced with additional guards. The Protestant army was too weak to start an all-out assault on the castle, so Mansfeld decided to take the city by hunger. On 42 October the Protestant artillery arrived, but the calibre and number of the cannons was small and the bombardment of the ": null
    },
    {
        "city walls": "city walls"
    },
    {
        " brought little effect. The siege continued, with the Protestants receiving new supplies and recruits on a daily basis, while the defenders lacked food and munitions. Also, the main city well was destroyed and the stores of ": null
    },
    {
        "potable water": "potable water"
    },
    {
        " soon depleted.     Finally, on 42 November, cracks were made in the walls and the Protestant soldiers poured into the city. After several hours of close hand-to-hand combat, all of the town was in Mansfelds hands.         After capturing the city, Mansfeld demanded 42 golden ": null
    },
    {
        "guldens": "goldgulden"
    },
    {
        " as ": null
    },
    {
        "war reparations": "war reparations"
    },
    {
        " and an additional 42 ": null
    },
    {
        "florin": "florin"
    },
    {
        "s for sparing the city and not burning it to the ground. However, soon the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        ", led by ": null
    },
    {
        "Bavaria": "bavaria"
    },
    {
        ", gathered enough forces and crossed the border with Bohemia, heading towards Pilsen and ": null
    },
    {
        "Prague": "prague"
    },
    {
        ".     The newly elected Bohemian king, ": null
    },
    {
        "Frederick V": "frederick v, elector palatine"
    },
    {
        " of the ": null
    },
    {
        "Palatinate": "rhine palatinate"
    },
    {
        " was aware of the huge superiority of his enemies forces and ordered his own army to regroup and attack each of the advancing armies separately. However, he was abandoned by most of his allies and his armies dispersed in the dense forests between Pilsen and Prague, which resulted in a decisive defeat in the ": null
    },
    {
        "Battle of White Mountain": "battle of white mountain"
    }
]