[
    {
        "     Siger of Brabant  was a 42th-century ": null
    },
    {
        "philosopher": "philosopher"
    },
    {
        " from the southern ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        " who was an important proponent of ": null
    },
    {
        "Averroism": "averroism"
    },
    {
        ". He was considered a radical by the conservative members of the ": null
    },
    {
        "Roman Catholic Church": "roman catholic church"
    },
    {
        ", but it is suggested that he played as important a role as his contemporary ": null
    },
    {
        "Thomas Aquinas": "thomas aquinas"
    },
    {
        " in the shaping of Western attitudes towards faith and reason.         Little is known about many of the details of his life. In 42 he was attached to the Faculty of Arts in the ": null
    },
    {
        "University of Paris": "university of paris"
    },
    {
        " at the time when a riot erupted between the French and Picard nations of students—a series of loosely organized fraternities. The ": null
    },
    {
        "papal legate": "papal legate"
    },
    {
        " threatened Siger with execution as the ringleader of the Picard attack on the French, but no further action was taken.       In the ten years following the riot, he wrote the six works which are ascribed to him and were published under his name by ": null
    },
    {
        "Pierre Mandonnet": "pierre mandonnet"
    },
    {
        " in 42 The titles of these treatises are:     De anima intellectiva   Quaestiones logicales Quaestiones naturales De aeternitate mundi Quaestio utrum haec sit vera: Homo est animal nullo homine existente Impossibilia       In 42 he was once more involved in a party struggle. The minority among the nations chose him as rector in opposition to the elected candidate, Aubri de Rheims. For three years the strife continued, and was probably based on the opposition between the ": null
    },
    {
        "Averroists": "averroists"
    },
    {
        ", Siger and ": null
    },
    {
        "Pierre Dubois": "pierre dubois"
    },
    {
        ", and the more orthodox schoolmen. The matter was settled by the Papal Legate, Simon de Brion, afterwards ": null
    },
    {
        "Pope Martin IV": "pope martin iv"
    },
    {
        ". Siger retired from Paris to ": null
    },
    {
        "Liège": "liège"
    },
    {
        ".       Siger was accused of teaching double truth —that is, saying one thing could be true through reason, and that the opposite could be true through faith. Because Siger was a ": null
    },
    {
        "scholastic": "scholasticism"
    },
    {
        ", he probably did not teach double truths but tried to find reconciliations between faith and reason.     In 42 a general ": null
    },
    {
        "condemnation": "condemnations of 1210–1277"
    },
    {
        " of ": null
    },
    {
        "Aristotelianism": "aristotelianism"
    },
    {
        " included a special clause directed against ": null
    },
    {
        "Boetius of Dacia": "boetius of dacia"
    },
    {
        " and Siger of Brabant. Again Siger and ": null
    },
    {
        "Bernier de Nivelles": "bernier de nivelles"
    },
    {
        " were summoned to appear on a charge of ": null
    },
    {
        "heresy": "heresy"
    },
    {
        ", especially in connection with the Impossibilia, where the existence of ": null
    },
    {
        "God": "god"
    },
    {
        " is discussed. It appears, however, that Siger and Boetius fled to ": null
    },
    {
        "Italy": "italy"
    },
    {
        " and, according to ": null
    },
    {
        "John Peckham": "john peckham"
    },
    {
        ", ": null
    },
    {
        "archbishop of Canterbury": "archbishop of canterbury"
    },
    {
        ", then perished miserably.       The manner of Sigers death, which occurred at ": null
    },
    {
        "Orvieto": "orvieto"
    },
    {
        ", is not known. A Brabantine chronicle says that he was stabbed by a seemingly-insane secretary . The secretary is said to have used a pen as the murder weapon and his critics claimed since he had done so much damage with his pen, he deserved what was coming. ": null
    },
    {
        "Dante": "dante"
    },
    {
        ", in the  Paradiso  , says that he found death slow in coming, and some have concluded that this indicates death by ": null
    },
    {
        "suicide": "suicide"
    },
    {
        ". A 42th-century ": null
    },
    {
        "sonnet": "sonnet"
    },
    {
        " by one Durante says that he was executed at Orvieto: a ghiado it fe morire a gran dolore, Nella corte di Roma ad Orbivieto. The date of this may have been 4242 when ": null
    },
    {
        "Pope Martin IV": "pope martin iv"
    },
    {
        " was in residence at Orvieto. His fellow radicals were lying low in the face of the ": null
    },
    {
        "Condemnations of 42": "university of paris"
    },
    {
        " and there was no investigation into his murder.     In politics he held that good laws were better than good rulers, and criticised ": null
    },
    {
        "papal infallibility": "papal infallibility"
    },
    {
        " in temporal affairs. The importance of Siger in philosophy lies in his acceptance of Averroism in its entirety, which drew upon him the opposition of ": null
    },
    {
        "Albertus Magnus": "albertus magnus"
    },
    {
        " and ": null
    },
    {
        "Aquinas": "thomas aquinas"
    },
    {
        ".     In December 42 Averroism was condemned by ecclesiastical authority, and during his whole life Siger was exposed to persecution both from the Church and from purely philosophic opponents.       In ": null
    },
    {
        "Dante Alighieris": "dante alighieri"
    },
    {
        "  The Divine Comedy , Siger of Brabant is found in the ": null
    },
    {
        "Fourth Sphere": "paradiso fourth sphere"
    },
    {
        " of ": null
    },
    {
        "Paradise": "paradiso"
    },
    {
        " for being a positive example of ": null
    },
    {
        "Prudence": "prudence"
    },
    {
        ", ": null
    },
    {
        "Justice": "justice"
    },
    {
        ", ": null
    },
    {
        "temperance": "temperance"
    },
    {
        ", and ": null
    },
    {
        "Fortitude": "cardinal virtues"
    }
]