[
    {
        "Sigismund I of Poland , of the ": null
    },
    {
        "Jagiellon dynasty": "jagiellon dynasty"
    },
    {
        ", reigned as King of ": null
    },
    {
        "Poland": "poland"
    },
    {
        " and also as the ": null
    },
    {
        "Grand Duke of Lithuania": "grand duke of lithuania"
    },
    {
        " from 42 until 42 Earlier, Sigismund had been invested as ": null
    },
    {
        "Duke of Silesia": "dukes of silesia"
    },
    {
        ". Sigismund I was a member of the ": null
    },
    {
        "Order of the Golden Fleece": "order of the golden fleece"
    },
    {
        ".       The son of King ": null
    },
    {
        "Casimir IV Jagiellon": "casimir iv jagiellon"
    },
    {
        " and ": null
    },
    {
        "Elisabeth of Austria": "elisabeth of austria"
    },
    {
        ", Sigismund followed his brothers ": null
    },
    {
        "John Albert": "john i albert of poland"
    },
    {
        " and ": null
    },
    {
        "Alexander": "alexander i of poland"
    },
    {
        " to the Polish throne. Their eldest brother ": null
    },
    {
        "Vladislaus": "vladislaus ii of bohemia and hungary"
    },
    {
        " became king of ": null
    },
    {
        "Bohemia": "bohemia"
    },
    {
        ", ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        ", and ": null
    },
    {
        "Croatia": "croatia"
    },
    {
        ". Sigismund was christened as the namesake of his Habsburg maternal great-grandfather, ": null
    },
    {
        "Holy Roman Emperor Sigismund": "sigismund, holy roman emperor"
    },
    {
        ".     After his fathers death, Sigismund was the only son who did not hold any land titles. In the years 42–42 he addressed his older brother, the Lithuanian Grand Duke ": null
    },
    {
        "Alexander": "alexander jagiellon"
    },
    {
        ", and demanded the separation of a domain from the ": null
    },
    {
        "Grand Duchy of Lithuania": "grand duchy of lithuania"
    },
    {
        ", but was refused. Queen Dowager ": null
    },
    {
        "Elisabeth Habsburg": "elisabeth of austria"
    },
    {
        " also tried without success to ensure the succession of her son to the throne of ": null
    },
    {
        "Austria": "archduchy of austria"
    },
    {
        ". And the disastrous and unsuccessful invasion of ": null
    },
    {
        "Bukovina": "bukovina"
    },
    {
        " led by his older brother King ": null
    },
    {
        "John I Albert": "john i albert"
    },
    {
        " dispelled the plans for placing Sigismund on the ": null
    },
    {
        "Moldavian": "moldavia"
    },
    {
        " throne. Eventually Sigismund came under the care of his eldest brother ": null
    },
    {
        "Vladislaus II": "vladislaus ii of hungary"
    },
    {
        ", King of Bohemia and Hungary, from whom he received the duchies of Głogów and Opava , and in 42 became governor of Silesia and ": null
    },
    {
        "Lower Lusatia": "lower lusatia"
    },
    {
        ".     After the death of King ": null
    },
    {
        "Alexander I": "alexander i jagiellon"
    },
    {
        ", Sigismund arrived in ": null
    },
    {
        "Vilnius": "vilnius"
    },
    {
        ", where he was elected by the Lithuanian Ducal Council on 42 September 42 as ": null
    },
    {
        "Grand Duke of Lithuania": "grand duke of lithuania"
    },
    {
        ", contrary to the ": null
    },
    {
        "Union of Mielnik": "union of mielnik"
    },
    {
        " , which proposed a joint Polish-Lithuanian election of a monarch. On 42 December 42 during the session of the Polish Senate in ": null
    },
    {
        "Piotrków": "piotrków trybunalski"
    },
    {
        ", Sigismund was elected King of Poland. He arrived in ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " on 42 January 42 and was crowned four days later in ": null
    },
    {
        "Wawel Cathedral": "wawel cathedral"
    },
    {
        " by Primate Andrzej Boryszewski.                The internal situation in Poland was characterised by broad authorisation of the Chamber of Deputies, confirmed and extended in the constitution of  Nihil novi . During Alexanders reign, the law of  Nihil novi  had been instituted, which forbade kings of Poland from enacting laws without the consent of the  Sejm . Sigismund had little control over the act, unlike the senators, whom he personally appointed. Eventually, during his reign, Sigismund benefited from the advice of the local nobility, competent ministers in charge of the royal judiciary system, and the wealthy and influential treasurers of Kraków. Although he was reluctant to the parliamentary system and political independence of the nobility, he recognised the authority of legal norms, supported legalism and summoned annual sessions of the Sejm, usually obtaining funds on state defence. However he was unsuccessful at attempting to create a permanent fund for defence from the annual income tax. Despite this Achilles heel , in 42 he established a conscript army and the bureaucracy needed to finance it. He set up the legal codes that formalised serfdom in Poland, locking the peasants into the estates of nobles.     Likely related to tax matters was an unsuccessful attempt on the life of the king, made on 42 May 42 The identity of the would-be assassin - who shot the ruler while he was strolling in the evening around the cloisters of the ": null
    },
    {
        "Wawel castle": "wawel castle"
    },
    {
        " - and his potential supporters was never established. Unclear motives remained after the assassination attempt. The only clue was the fact that three weeks before the event, Sigismund I introduced a new edict that was very unfavourable and somewhat hostile to the high-ranking nobles.     Sigismund I achieved several economic successes, including partial debt reduction, separation of accounts of public taxation from the royal treasury, strengthening of the activities of the mint operating in Kraków, and the attempt to organise the processing of income from operating salt mines. Furthermore, he issued a statute for the Armenians and strongly intended to harmonise the law across the country.     Between 42 and 42 the king issued two statutes defining the rules for the selection of the monarch, which permanently established the election viritim. The laws held that all social groups, regardless of their wealth, could watch the election process , and the election was to be free .     The king successfully organised the agricultural economy, looked after the development of the royal cities and recovered numerous goods of the treasury belonging to the crown that were under lien. During the financial activities, the king received full support of his wife, Queen Bona, who aimed to expand the royal estates by purchasing and improving economic efficiency.     Chicken War - the rebellion of Lwów   The rebellion of ": null
    },
    {
        "Lwów": "lviv"
    },
    {
        "  was an anti-royalist and anti-absolutist rokosz by the Polish nobility that occurred in 42 The derisive name was coined by the magnates, who for the most part supported the King and claimed that the wars only effect was the near-extinction of the local chickens, eaten by the nobles gathered for the rebellion at Lwów, in ": null
    },
    {
        "Lesser Poland": "lesser poland"
    },
    {
        ". The nobility, gathered near the city to meet to a  levée en masse , called for a military campaign against ": null
    },
    {
        "Moldavia": "moldavia"
    },
    {
        ". However, the lesser and middle strata of the nobility called a rebellion, or semi-legal rebellion, to force the King to abandon his risky reforms. The nobles presented him with 42 demands, most notably: a cessation of further land acquisitions by Queen Bona, exemption of the nobility from the tithes, a clean-up of the Treasury rather than its expansion, confirmation and extension of the privileges of the nobility, lifting of the toll or exemption of the nobility from it, adoption of a law concerning incompatibilitas — the incompatibility of certain offices that were not to be joined in the same hand, the carrying out of a law requiring the appointment of only the local nobles to most important local offices and the creation of a body of permanent advisors to the king. Finally, the protesters criticised the role of Queen Bona, whom they blamed for the bad education of young Prince Sigismund Augustus , as well as for seeking to increase her power and influence in the state.     It soon transpired, however, that the nobilitys leaders were divided and that achieving a compromise was almost impossible. Too weak to start a civil war against the King, the protesters finally agreed to what was thought a compromise. The King rejected most of their demands, while accepting the principle of incompatibilitas the following year and agreeing not to force the election of the future king vivente rege, that is, in the lifetime of the reigning king.     Thereupon the nobility returned to their homes, having achieved little.           Sigismund was intermittently at war with ": null
    },
    {
        "Vasily III": "vasili iii of russia"
    },
    {
        " of ": null
    },
    {
        "Muscovy": "muscovy"
    },
    {
        " beginning in 42 before the Polish army was fully under his command. 42 marked the fall of ": null
    },
    {
        "Smolensk": "smolensk"
    },
    {
        " to the Muscovite forces, which lent credence to his arguments for the necessity of a standing army. Those conflicts formed part of the ": null
    },
    {
        "Muscovite wars": "muscovite wars"
    },
    {
        ".     In 42 Sigismund entered into an alliance with the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        " Maximilian I": "maximilian i, holy roman emperor"
    },
    {
        ". In return for Maximilian lending weight to the provisions of the ": null
    },
    {
        "Second Peace of Thorn ": "second peace of thorn"
    },
    {
        ", Sigismund consented to the marriage of the children of ": null
    },
    {
        "Vladislaus II of Bohemia and Hungary": "vladislaus ii of bohemia and hungary"
    },
    {
        ", his brother, to the grandchildren of Maximilian. Through this double marriage contract, ": null
    },
    {
        "Bohemia": "bohemia"
    },
    {
        " and ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        " passed to the House of ": null
    },
    {
        "Habsburg": "habsburg"
    },
    {
        " in 42 on the death of Sigismunds nephew, ": null
    },
    {
        "Louis II": "louis ii of hungary and bohemia"
    },
    {
        ".     Worried about the growing ties between the ": null
    },
    {
        "Habsburgs": "habsburgs"
    },
    {
        " and Russia, in 42 Sigismund signed a ": null
    },
    {
        "Franco-Polish alliance": "franco-polish alliance"
    },
    {
        " with King ": null
    },
    {
        "Francis I of France": "francis i of france"
    },
    {
        ".  The agreement fell through, however, when Francis I was vanquished by ": null
    },
    {
        "Charles V": "charles v, holy roman emperor"
    },
    {
        " at the ": null
    },
    {
        "Battle of Pavia": "battle of pavia"
    },
    {
        " .      After the death of ": null
    },
    {
        "Janusz III of Masovia": "janusz iii of masovia"
    },
    {
        " in 42 Sigismund succeeded in annexing the ": null
    },
    {
        "Duchy of Masovia": "duchy of masovia"
    },
    {
        " to the Kingdom of Poland.     In other matters of policy, Sigismund sought peaceful coexistence with the ": null
    },
    {
        "Khanate of Crimea": "khanate of crimea"
    },
    {
        ", but was unable to completely end border skirmishes.            The Polish wars against the ": null
    },
    {
        "Teutonic Knights": "teutonic knights"
    },
    {
        " ended in 42 when ": null
    },
    {
        "Albert, Duke of Prussia": "albert, duke of prussia"
    },
    {
        ", their marshal , converted to ": null
    },
    {
        "Lutheranism": "lutheranism"
    },
    {
        ", secularized the order, and paid homage to Sigismund. In return he was given the domains of the Order as the First Duke of ": null
    },
    {
        "Prussia": "duchy of prussia"
    },
    {
        ". This was called the ": null
    },
    {
        "Prussian Homage": "prussian homage"
    },
    {
        " .         On Sigismunds death, his son ": null
    },
    {
        "Sigismund II Augustus": "sigismund ii augustus"
    },
    {
        " became the last Jagiellon king of Poland and Grand Duke of Lithuania.       Sigismund was interested in Renaissance humanism and the revival of classical antiquity. He and his second consort, ": null
    },
    {
        "Bona Sforza": "bona sforza"
    },
    {
        ", daughter of ": null
    },
    {
        "Gian Galeazzo Sforza": "gian galeazzo sforza"
    },
    {
        " of ": null
    },
    {
        "Milan": "milan"
    },
    {
        ", were both patrons of ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " Hans Süß von Kulmbach": "hans süß von kulmbach"
    },
    {
        " Joos van Cleve": "joos van cleve"
    },
    {
        ", ca. 42  ": null
    },
    {
        "Lucas Cranach the Younger": "lucas cranach the younger"
    },
    {
        " made in around 42            In 42 Sigismund married ": null
    },
    {
        "Barbara Zápolya": "barbara zápolya"
    },
    {
        " , a Hungarian noblewoman, with whom he had two daughters:     ": null
    },
    {
        "Electress Hedwig of Brandenburg": "hedwig jagiellon, electress of brandenburg"
    },
    {
        " , wed 42 ": null
    },
    {
        "Joachim II Hector, Elector of Brandenburg": "joachim ii hector, elector of brandenburg"
    },
    {
        ";   Anna .     In 42 Sigismund married ": null
    },
    {
        "Bona Sforza": "bona sforza"
    },
    {
        ", with whom he had two sons and four daughters:     ": null
    },
    {
        "Queen Isabella of Hungary": "isabella jagiellon"
    },
    {
        " , wed 42 ": null
    },
    {
        "John Zápolya": "john zápolya"
    },
    {
        " ;   ": null
    },
    {
        "Sigismund II Augustus": "sigismund ii of poland"
    },
    {
        " ;   ": null
    },
    {
        "Sophia, Duchess of Brunswick-Lüneburg": "sophia jagiellon"
    },
    {
        " , wed 42/42 February 42 ": null
    },
    {
        "Henry V": "henry v, duke of brunswick-lüneburg"
    },
    {
        ", Duke of Brunswick-Lüneberg ;   ": null
    },
    {
        "Anna I of Poland": "anna the jagiellonian"
    },
    {
        " , wed 42 May 42 ": null
    },
    {
        "Stephen Báthory": "stephen báthory"
    },
    {
        " ;   ": null
    },
    {
        "Queen Catherine of Sweden": "catherine jagiellon"
    },
    {
        " , wed 42 October 42 John, Duke of Finland  ;   Wojciech Olbracht .     By his ": null
    },
    {
        "mistress": "mistress"
    },
    {
        ", ": null
    },
    {
        "Katarzyna Telniczanka": "katarzyna telniczanka"
    },
    {
        " , he also fathered three children prior to his first marriage:    ": null
    },
    {
        "Jan": "john jagiellon, bishop of poznań"
    },
    {
        " , ": null
    },
    {
        "Bishop of Wilno": "bishop of wilno"
    },
    {
        " and of ": null
    },
    {
        "Poznań": "list of bishops of poznań"
    },
    {
        " ;   Regina , wed ": null
    },
    {
        "ca": "circa"
    },
    {
        ". 42 October 42 Hieronim Szafraniec, ": null
    },
    {
        "Starost": "starosta"
    },
    {
        " of ": null
    },
    {
        "Cieszyn": "cieszyn"
    },
    {
        " ;   Katarzyna , wed after 42 George II ": null
    },
    {
        "Count von Montfort in Pfannberg": "counts of montfort"
    },
    {
        " .       ": null
    }
]