[
    {
        "        Sigismund Báthory  was ": null
    },
    {
        "Prince of Transylvania": "prince of transylvania"
    },
    {
        " several times between 1586 and 1602, and ": null
    },
    {
        "Duke of Racibórz": "duchy of racibórz"
    },
    {
        " and ": null
    },
    {
        "Opole": "duchy of opole"
    },
    {
        " in ": null
    },
    {
        "Silesia": "silesia"
    },
    {
        " in 1598. His father, ": null
    },
    {
        "Christopher Báthory": "christopher báthory"
    },
    {
        ", ruled Transylvania as ": null
    },
    {
        "voivode": "voivode of transylvania"
    },
    {
        " of the absent prince, ": null
    },
    {
        "Stephen Báthory": "stephen báthory"
    },
    {
        ". Sigismund was still a child when the ": null
    },
    {
        "Diet of Transylvania": "transylvanian diet"
    },
    {
        " elected him voivode at his dying fathers request in 1581. Initially, regency councils administered Transylvania on his behalf, but Stephen Báthory made ": null
    },
    {
        "János Ghyczy": "jános ghyczy"
    },
    {
        " the sole regent in 1585. Sigismund adopted the title of prince after Stephen Báthory died.     The Diet proclaimed Sigismund to be of age in 1588, but only after he agreed to expel the ": null
    },
    {
        "Jesuits": "jesuits"
    },
    {
        ". ": null
    },
    {
        "Pope Sixtus V": "pope sixtus v"
    },
    {
        " excommunicated": "excommunication"
    },
    {
        " him, but the ban was lifted in 1590, and the Jesuits returned a year later. His blatant favoritism towards the Catholics made him unpopular among his Protestant subjects. He decided to join the ": null
    },
    {
        "Holy League": "holy league of pope clement viii"
    },
    {
        " against the ": null
    },
    {
        "Ottoman Empire": "ottoman empire"
    },
    {
        ". Since he could not convince the Diet to support his plan, he renounced the throne in July 1594, but the commanders of the army convinced him to revoke his abdication. At their proposal, he purged the noblemen who opposed the war against the Ottomans. He officially joined the Holy League and married ": null
    },
    {
        "Maria Christina of Habsburg": "maria christina of habsburg"
    },
    {
        ", a niece of the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ", ": null
    },
    {
        "Rudolph II": "rudolph ii, holy roman emperor"
    },
    {
        ". The marriage was never ": null
    },
    {
        "consummated": "consummation"
    },
    {
        ".     ": null
    },
    {
        "Michael the Brave": "michael the brave"
    },
    {
        ", ": null
    },
    {
        "Voivode of Wallachia": "voivode of wallachia"
    },
    {
        ", and ": null
    },
    {
        "Ștefan Răzvan": "ștefan răzvan"
    },
    {
        ", ": null
    },
    {
        "Voivode of Moldavia": "voivode of moldavia"
    },
    {
        ", acknowledged his suzerainty. Their united forces defeated an Ottoman army in the ": null
    },
    {
        "Battle of Giurgiu": "battle of giurgiu"
    },
    {
        ". The triumph was followed by a series of Ottoman victories, and Sigismund abdicated in favor of Rudolph II in early 1598, receiving the duchies of Racibórz and Opole as a compensation. His maternal uncle, ": null
    },
    {
        "Stephen Bocskai": "stephen bocskai"
    },
    {
        ", persuaded him to return in late summer, but he could not make peace with the Ottoman Empire. He renounced Transylvania in favor of Andrew Báthory and settled in Poland in 1599. During the following years, Transylvania was regularly pillaged by unpaid mercenaries and Ottoman marauders. Sigismund returned at the head of a Polish army in 1601, but he could not strengthen his position. He again abdicated in favor of Rudolph and settled in ": null
    },
    {
        "Bohemia": "kingdom of bohemia"
    },
    {
        " in July 1602. After he was accused of a conspiracy against the emperor, he spent fourteen months in jail in Prague in 1610 and 1611. He died at his Bohemian estate.         Sigismund was the son of ": null
    },
    {
        "Christopher Báthory": "christopher báthory"
    },
    {
        " and his second wife, Elisabeth Bocskai. He was born in Várad  in 1573, according to the Transylvanian historian, ": null
    },
    {
        "István Szamosközy": "istván szamosközy"
    },
    {
        ". At the time of Sigismunds birth, his uncle, ": null
    },
    {
        "Stephen Báthory": "stephen báthory"
    },
    {
        ", was the ": null
    },
    {
        "voivode of Transylvania": "voivode of transylvania"
    },
    {
        ". After being elected ": null
    },
    {
        "King of Poland": "king of poland"
    },
    {
        " in late 1575, Stephen Báthory adopted the title of ": null
    },
    {
        "Prince of Transylvania": "prince of transylvania"
    },
    {
        " and made Sigismunds father voivode. Stephen Báthory set up a separate chancellery in ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " to supervise the administration of the principality.     Sigismunds father and uncle were ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        ", but his mother was Calvinist. According to the ": null
    },
    {
        "Jesuit": "jesuit"
    },
    {
        " Antonio Possevino": "antonio possevino"
    },
    {
        ", Sigismund demonstrated his devotion to Catholicism already at the age of seven. His mother mocked him for his piety, saying that he only wanted to secure his uncles goodwill. Sigismund was especially hostile towards the ": null
    },
    {
        "Anti-Trinitarians": "nontrinitarianism"
    },
    {
        " in his youth. His mother died in early 1581.             Christopher Báthory fell seriously ill after his wifes death. At his request, the ": null
    },
    {
        "Diet of Transylvania": "diet of transylvania"
    },
    {
        " elected Sigismund voivode in Kolozsvár  around 15May 1581. Since Sigismund was still a minor, his dying father tasked a council of twelve noblemen with the government. Christopher Báthorys cousin, Dénes Csáky, and his brother-in-law, ": null
    },
    {
        "Stephen Bocskai": "stephen bocskai"
    },
    {
        ", headed the council. Christopher Báthory died on 27May.          The ": null
    },
    {
        "Ottoman Sultan": "ottoman sultan"
    },
    {
        ", ": null
    },
    {
        "Murad III": "murad iii"
    },
    {
        ", confirmed Sigismunds election on 3July 1581, reminding him of his obligation to pay a yearly tribute of 15,000 florins. However, ": null
    },
    {
        "Pál Márkházy": "pál márkházy"
    },
    {
        ", a young nobleman who lived in ": null
    },
    {
        "Istanbul": "istanbul"
    },
    {
        ", offered to double the tribute and to pay an additional tax of 100,000 florins if he was made the ruler of Transylvania. The ": null
    },
    {
        "Grand Vizier": "list of ottoman grand viziers"
    },
    {
        ", ": null
    },
    {
        "Koca Sinan Pasha": "koca sinan pasha"
    },
    {
        ", supported Márkházys claim. Taking advantage of the situation, Murad demanded the same payments from Sigismund, but Stephen Báthory and the ": null
    },
    {
        "Three Nations of Transylvania": "three nations of transylvania"
    },
    {
        " resisted. After receiving the customary tribute from Transylvania, the sultan again confirmed Sigismunds rule in November 1581.     Stephen Báthory who took charge of Sigismunds education confirmed the position of his Jesuit tutors, János Leleszi and Gergely Vásárhelyi. According to Szamosközy, Stephen Báthory also ordered Sigismunds companions to talk of foreign lands, wars, and hunting with him during their dinners together. He reorganized the government on 3May 1583, charging ": null
    },
    {
        "Sándor Kendi": "sándor kendi"
    },
    {
        ", ": null
    },
    {
        "Farkas Kovacsóczy": "farkas kovacsóczy"
    },
    {
        ", and ": null
    },
    {
        "László Sombori": "lászló sombori"
    },
    {
        " with the administration of Transylvania during Sigismunds minority. The Diet suggested to Stephen Báthory that he dismiss them, but he only dissolved the council on 1May 1585. He replaced the three councillors with the devout Calvinist ": null
    },
    {
        "János Ghyczy": "jános ghyczy"
    },
    {
        ", making him regent for Sigismund.         Sigismund adopted the title of Prince of Transylvania after Stephen Báthory died on 13 December 1586. He was still a minor, and Ghyczy continued to rule as regent. Sigismund was one of the candidates to the throne of the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        ". His advisors knew that he had little chance to win, but they wanted to demonstrate that the Báthorys had a valid claim to rule the Commonwealth. Kovacsóczy officially announced Sigismunds application at the  Sejm  on 14August 1587. Five days later, the assembly elected ": null
    },
    {
        "Sigismund III Vasa": "sigismund iii vasa"
    },
    {
        " king. During the ensuing ": null
    },
    {
        "war of succession": "war of the polish succession"
    },
    {
        ", Transylvanian troops supported SigismundIII against ": null
    },
    {
        "Maximilian of Habsburg": "maximilian iii, archduke of austria"
    },
    {
        ", who had also laid claim to Poland and Lithuania.     Sigismunds cousins, ": null
    },
    {
        "Balthasar": "balthasar báthory"
    },
    {
        " and ": null
    },
    {
        "Stephen Báthory": "stephen báthory"
    },
    {
        ", returned from Poland to Transylvania. Balthasar wanted to take charge of the government, making his court at Fogaras  the center of those who opposed Ghyczys rule. Kovacsóczy, the ": null
    },
    {
        "chancellor of Transylvania": "chancellor of transylvania"
    },
    {
        ", remained neutral in the conflict.     In October 1588 the Diet proposed to declare the sixteen-year-old Sigismund of age if he banished the Jesuits from Transylvania. He did not accept the offer, mainly because he did not want to expel his confessor, Alfonso Carillo. The Diet was dissolved, but Sigismunds cousins convinced him not to resist the Diet, which was dominated by Protestant delegates. The Diet was again summoned in late 1588; on 8December it ordered the expulsion of the Jesuits and declared Sigismund to be of age.         Sigismund took the customary oath of the Transylvanian monarchs on 23December 1588. ": null
    },
    {
        "Pope Sixtus V": "pope sixtus v"
    },
    {
        " excommunicated": "excommunication"
    },
    {
        " him for the expulsion of the Jesuits. Sigismunds cousin, Cardinal ": null
    },
    {
        "Andrew Báthory": "andrew báthory"
    },
    {
        ", urged the pope to lift the ban, saying that the princes Protestant advisors had forced him to throw out the priests. The pope authorized Sigismund to employ a confessor in May 1589, and the excommunication was revoked on Easter 1590.     Sigismund made several attempts to strengthen the position of the Roman Catholic Church, especially by appointing Catholics to the highest positions of state administration. Carillo and other Jesuit priests returned to Sigismunds court in disguise in early 1591. Sigismund met Andrew and Balthasar Báthory in August to seek their support for the legalization of the Jesuits presence, but they refused to stand by the priests at the Diet.          Sigismund dispatched his favorite, ": null
    },
    {
        "István Jósika": "istván jósika"
    },
    {
        ", to Tuscany to start negotiations regarding his marriage to Eleonora Orsini , although his cousins had sharply opposed Jósikas appointment. He also invited Italian artists and artisans to his court, making them his advisors or butlers. Szamosközy described them as the trashiest representatives of the noblest nation . The delegates of the Three Nations criticized Sigismund for his prodigal way of life at the Diet in Gyulafehérvár in November. To reduce his authority, the Diet prescribed that Sigismund should only make decisions in the royal council. Sigismund deprived his cousins of the allowances that the royal treasury had paid to them.     Gossip about conspiracies spread during the following months. Sándor Kendi accused Sigismunds former tutor, János Gálffy, of deliberately stirring up debates between the prince and his cousins. Other courtiers claimed that Balthasar Báthory was planning to dethrone Sigismund. A Jesuit priest was informed at ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        " that Gálffy and his allies wanted to murder the prince and his cousins. In late 1591 Sigismund stated that he was willing to renounce in favor of Balthasar if the members of the royal council favored his cousin. His offer was refused, but during the debate Kendi referred to Sigismund and Balthasar as the two monsters and greatest disasters of the Transylvanian realm . ": null
    },
    {
        "Pope Clement VIIIs": "pope clement viii"
    },
    {
        "legate, Attilio Amalteo, mediated a reconciliation between Sigismund and his cousins in the summer of 1592. The pope also urged Sigismund to marry a Catholic princess from the ": null
    },
    {
        "House of Lorraine": "house of lorraine"
    },
    {
        ".     At the demand of the sultan, Transylvania troops assisted ": null
    },
    {
        "Aaron the Tyrant": "aaron the tyrant"
    },
    {
        ", ": null
    },
    {
        "Voivode of Moldavia": "voivode of moldavia"
    },
    {
        ". The sultan also ordered Sigismund to pay double the amount of the yearly tribute. Balthasar Báthory murdered Sigismunds secretary, ": null
    },
    {
        "Pál Gyulai": "pál gyulai"
    },
    {
        ", on 10December 1592. He also persuaded Sigismund to order the execution of Gálffy on 8March 1593. That summer, Sigismund went to ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " in disguise to start negotiations regarding his marriage with ": null
    },
    {
        "Anna": "anna vasa of sweden"
    },
    {
        ", the sister of SigismundIII of Poland. The Holy See had proposed the marriage, which could have enabled Sigismund to rule Poland during the absence of the king, who was also ": null
    },
    {
        "King of Sweden": "king of sweden"
    },
    {
        ", but the plan came to nothing.     Murad III declared war against the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        ", ": null
    },
    {
        "Rudolph": "rudolph ii, holy roman emperor"
    },
    {
        " in August. The sultan ordered Sigismund to send reinforcements to support the Ottoman army in ": null
    },
    {
        "Royal Hungary": "royal hungary"
    },
    {
        ". According to diplomatic sources, the ": null
    },
    {
        "grand vizier": "grand vizier of the ottoman empire"
    },
    {
        " was planning to occupy Transylvania. At the proposal of ": null
    },
    {
        "Jan Zamoyski": "jan zamoyski"
    },
    {
        ", ": null
    },
    {
        "Chancellor of Poland": "chancellor"
    },
    {
        ", Sigismund sent envoys to ": null
    },
    {
        "Elizabeth I of England": "elizabeth i of england"
    },
    {
        ", asking her to intervene on his behalf at the ": null
    },
    {
        "Sublime Porte": "sublime porte"
    },
    {
        ". She ordered her ambassador at ": null
    },
    {
        "Istanbul": "istanbul"
    },
    {
        ", ": null
    },
    {
        "Edward Barton": "edward barton"
    },
    {
        ", to support Sigismund.     ": null
    },
    {
        "Pope Clement VIII": "pope clement viii"
    },
    {
        " wanted to persuade Sigismund to join the ": null
    },
    {
        "Holy League": "holy league of pope clement viii"
    },
    {
        " that the pope had organized against the Ottoman Empire. After Rudolphs troops defeated the Ottomans in a series of battles in the autumn of 1593, Sigismund decided to join the Holy League, provided that Rudolph acknowledged the independence of Transylvania from the ": null
    },
    {
        "Hungarian Crown": "lands of the hungarian crown"
    },
    {
        ". However, the delegates of the Three Nations refused to declare war against the Ottoman Empire at three consecutive Diets between May and July. Sigismund abdicated, tasking Balthasar Báthory with the government in late July. Balthasar wanted to seize the throne, but Kovacsóczy, Kendi, and the other leading officials decided to set up an aristocratic council to administer Transylvania.     The commanders of the army , and Friar Carillo jointly convinced Sigismund to return on 8August. They also persuaded him to order the arrest of Kovacsóczy, Kendi, Balthasar Báthory, and twelve other noblemen who had opposed the war against the Ottomans on 28August, accusing them of plotting. Sándor and Gábor Kendi were beheaded along with two other members of the royal council; Balthasar Báthory, Kovacsóczy, and Ferenc Kendi were strangled in prison. All but one murdered noblemen were Protestants, mostly ": null
    },
    {
        "Unitarians": "unitarian church of transylvania"
    },
    {
        ". Many of their relatives converted to Catholicism to prevent the confiscation of their estates.                 Sigismund decided to join the Holy League together with Aaron the Tyrant, ": null
    },
    {
        "voivode of Moldavia": "voivode of moldavia"
    },
    {
        ", and ": null
    },
    {
        "Michael the Brave": "michael the brave"
    },
    {
        ", ": null
    },
    {
        "voivode of Wallachia": "voivode of wallachia"
    },
    {
        ", on 5October 1594. The two voivodes had started direct negotiations with the Holy See, but Sigismund, who claimed suzerainty over them, prevented them from conducting further direct negotiations. Sigismunds envoy, Stephen Bocskai, signed the document that confirmed the membership of Transylvania in the Holy League in Prague on 28January 1595. According to the treaty, RudolphII recognized Sigismunds hereditary right to rule Transylvania and ": null
    },
    {
        "Partium": "partium"
    },
    {
        " and to use the title of prince, but he also stipulated that the principality was to be re-united with the Hungarian Crown if Sigismunds family died out. The Diet of Transylvania confirmed the treaty on 16April. The Diet also prohibited religious innovations, which gave rise to the persecution of ": null
    },
    {
        "Szekler Sabbatarians": "szekler sabbatarians"
    },
    {
        " in ": null
    },
    {
        "Udvarhelyszék": "udvarhelyszék"
    },
    {
        ".     The ": null
    },
    {
        "Wallachian boyars": "wallachian boyars"
    },
    {
        " and prelates recognized Sigismunds suzerainty over Wallachia on behalf of Michael the Brave in Gyulafehérvár on 20May 1595. According to the treaty, Michael was forbidden to enter into an alliance with foreign powers without Sigismunds approval. The voivodes right to sentence his boyars to death was also limited. The Diet of Transylvanian was authorized to impose taxes in Wallachia with a council of twelve boyars. After Aaron the Tyrant refused to sign a similar treaty, Sigismund invaded Moldavia and captured him in ": null
    },
    {
        "Iași": "iași"
    },
    {
        ". He made ": null
    },
    {
        "Ștefan Răzvan": "ștefan răzvan"
    },
    {
        " the new voivode on 3June, forcing him to swear fealty to him. Thereafter, Sigismund styled himself ": null
    },
    {
        "By the Grace of God": "by the grace of god"
    },
    {
        ", Prince of Transylvania, Wallachia and Moldavia, ": null
    },
    {
        "Prince of the Holy Roman Empire": "princes of the holy roman empire"
    },
    {
        ", ": null
    },
    {
        "Count of the Székelys": "count of the székelys"
    },
    {
        " and Lord of ": null
    },
    {
        "Parts of the Kingdom of Hungary": "partium"
    },
    {
        " .     Sigismund married ": null
    },
    {
        "Maria Christierna of Habsburg": "maria christierna of habsburg"
    },
    {
        ", a niece of RudolphII, on 6August. However, the marriage was never ": null
    },
    {
        "consummated": "consummation"
    },
    {
        ". Sigismund accused ": null
    },
    {
        "Margaret Majláth": "margaret majláth"
    },
    {
        " of witchcraft, causing his ": null
    },
    {
        "impotence": "erectile dysfunction"
    },
    {
        ". Historian László Nagy notes that Sigismunds contemporaries made no reference to his relationship with women, showing that Sigismund was homosexual.     György Borbély, ": null
    },
    {
        "Ban of Karánsebes": "banate of lugos and karánsebes"
    },
    {
        ", captured Lippa  and other Ottoman fortresses along the ": null
    },
    {
        "Maros River": "maros river"
    },
    {
        " before the end of August. ": null
    },
    {
        "Koca Sinan Pasha": "koca sinan pasha"
    },
    {
        " broke into Wallachia, forcing Michael the Brave to retreat towards Transylvania. Michael routed the invaders in the ": null
    },
    {
        "Battle of Călugăreni": "battle of călugăreni"
    },
    {
        ", but he could not prevent them from seizing ": null
    },
    {
        "Târgoviște": "târgoviște"
    },
    {
        " and ": null
    },
    {
        "Bucharest": "bucharest"
    },
    {
        ". He withdrew to ": null
    },
    {
        "Stoenești": "stoenești, argeș"
    },
    {
        " to await the arrival of the Transylvanian and Moldavian troops.     Since the Ottoman army outnumbered the forces at Sigismunds disposal, he proposed the ": null
    },
    {
        "Székely": "székelys"
    },
    {
        " commoners to restore their freedom if they joined his campaign against the Ottomans. The Székelys accepted his offer, enabling Sigismund to launch a counter-invasion in Wallachia in early October. The united forces of Transylvania, Wallachia, and Moldavia defeated the retreating Ottoman army in the ": null
    },
    {
        "Battle of Giurgiu": "battle of giurgiu"
    },
    {
        " on 25October. Although the victory was not decisive, the battle enabled the two voivodes to maintain their alliance with the Holy League.     Ignoring the Székely warriors preeminent role during the war, the Diet of Transylvania refused to restore their freedom on 15December. Sigismund left for Prague to start negotiations with RudolphII in early January 1596, tasking his wife and Stephen Bocskai with the government. The Székelys tried to secure their freedom, but Bocskai repressed their movement with extraordinary cruelty during the ": null
    },
    {
        "Bloody Carnival": "bloody carnival"
    },
    {
        " in early 1596.     Rudolph II promised Sigismund to send reinforcements and money to continue the war against the Ottomans. Sigismund returned to Transylvania on 4March. He laid siege to Temesvár , but he lifted the siege when an Ottoman army of 20,000 strong approached the fortress. The Ottoman Sultan ": null
    },
    {
        "Mehmed III": "mehmed iii"
    },
    {
        " invaded Royal Hungary in summer. Sigismund joined his forces with the royal army, which was under the command of Maximilian of Habsburg. However, the Ottomans routed their united army in the ": null
    },
    {
        "Battle of Mezőkeresztes": "battle of mezőkeresztes"
    },
    {
        " between 23 and 26 October.     Sigismund again went to Prague to meet RudolphII and offered to abdicate in January 1597. After he returned to Transylvania, he restored the ": null
    },
    {
        "Roman Catholic bishopric in Gyulafehérvár": "roman catholic archdiocese of alba iulia"
    },
    {
        ". He sent envoys to Italy to demand the supreme command of a new Christian army, but his delegates at Istanbul started negotiations regarding a reconciliation with the sultan.                    The failure of his marriage and the defeats of the Holy League diminished Sigismunds self-confidence. He sent his envoys to RudolphII and again offered to abdicate in September 1597. An agreement regarding his abdication was signed on 23December 1597. RudolphII granted Sigismund the Silesian duchies of ": null
    },
    {
        "Racibórz": "duchy of racibórz"
    },
    {
        " and ": null
    },
    {
        "Opole": "duchy of opole"
    },
    {
        " and a yearly subsidy of 50,000 ": null
    },
    {
        "thalers": "thalers"
    },
    {
        ". The agreement was kept secret for months.     The Diet of Transylvania acknowledged Sigismunds abdication on 23March 1598. Maria Christierna took charge of the government until the arrival of Maximilian of Habsburg, whom RudolphII had appointed to administer Transylvania. Sigismund went to Silesia, but he did not like his new duchies. Bocskai, who had been dismissed after Sigismunds abdication, urged him to return.     Sigismund came to Kolozsvár on 21 August. On the following day, Bocskai convoked the Diet to his military camp at Szászsebes , and the delegates proclaimed Sigismund prince. Most Transylvanians accepted the decision, but György Király, the deputy captain of Várad, remained loyal to RudolphII. In September an Ottoman army invaded the principality, capturing the fortresses along the Maros. Sigismund sent his envoys to the commander of the army, Mehmed, convincing him to attack Várad instead of breaking into Transylvania proper.     All of Sigismunds attempts to make peace with the sultan failed. He sent his envoys to Prague to negotiate with RudolphII, while his confessor, Carillo, started negotiations with Jan Zamoyski in Poland. At Sigismunds invitation, his cousin, Andrew Báthory, returned from Poland. Sigismund abdicated at the Diet in Medgyes  on 21March 1599. Eight days later, the Diet proclaimed Andrew Báthory prince, hoping that Andrew could make peace with the Ottomans with the assistance of Poland. Sigismund left Transylvania for Poland in June. His marriage with Maria Christierna was declared invalid in Rome in August.     Andrew Báthory lost his throne and his life fighting against Michael the Brave and his Székely allies in autumn. Michael the Brave administered Transylvania as RudolphIIs governor, but his rule was unpopular among the noblemen, especially because of the pillaging raids made by his unpaid soldiers. As early as 9February 1600 Sigismund announced that he was ready to return to Transylvania. ": null
    },
    {
        "Moses Székely": "moses székely"
    },
    {
        ", a commander-in-chief during Michael the Braves campaign against Moldavia in May, deserted Michael and came to Poland to meet Sigismund.          The elected leader of the Transylvanian noblemen, István Csáky, sought assistance from RudolphIIs military commander, ": null
    },
    {
        "Giorgio Basta": "giorgio basta"
    },
    {
        ", against Michael. Basta invaded Transylvania and expelled Michael the Brave in September. Bastas unpaid soldiers regularly pillaged the principality, while Ottoman and ": null
    },
    {
        "Tatar": "crimean tatars"
    },
    {
        " marauders made frequent incursions across the frontiers. Sigismund returned to Transylvania across Moldavia at the head of a Polish army on 24March 1601. The Diet proclaimed him prince in Kolozsvár on 3April. Basta and Michael the Brave invaded Transylvania in summer. They routed Sigismunds army in the ": null
    },
    {
        "Battle of Goroszló": "battle of goroszló"
    },
    {
        " on 3August 1601. After the battle, Sigismund fled to Moldavia, but he returned on 6September.     The sultans envoy confirmed Sigismunds position as Prince of Transylvania in Brassó  on 2October. At the head of an army which also included Ottoman and Tatar soldiers, Sigismund expanded his rule over most regions of the principality, but he could not capture Kolozsvár in late November. He started new negotiations with Basta over his abdication in March 1602, because he did not trust his own supporters. He referred to them as intoxicated and brutish sons of a bitch and asked István Csáky to help him to leave their camp on 2July. He left Transylvania for the last time on 26July 1602.         Bastas soldiers accompanied Sigismund to ": null
    },
    {
        "Tokaj": "tokaj"
    },
    {
        ". Before long, he went to Prague to beg for RudolphIIs mercy. He received the  incolatus  in 1604. After the Diet of Transylvania proclaimed Stephen Bocskai prince in February 1605, Rudolph tried to persuade Sigismund to return to Transylvania, but he did not accept the offer. The ambassadors of Venice and Spain and the emperor again tried to convince him to lay claim to Transylvania in July 1606, but Sigismund refused, saying that he had no information about the affairs of his former principality. In December he again met Rudolph in Prague, but still resisted the emperors offer.     Sigismund received the domain of ": null
    },
    {
        "Libochovice": "libochovice"
    },
    {
        " in Bohemia. After one of his employees accused him of plotting against the emperor, Sigismund was imprisoned for fourteen months in the jails of Prague Castle in 1610. Sigismund died of a ": null
    },
    {
        "stroke": "stroke"
    },
    {
        " in Libochovice on 27March 1613. He was buried in a crypt in the ": null
    },
    {
        "St. Vitus Cathedral": "st. vitus cathedral"
    },
    {
        " in Prague.": null
    }
]