[
    {
        "      Sigismund II Augustus  was the ": null
    },
    {
        "King of Poland": "king of poland"
    },
    {
        " and ": null
    },
    {
        "Grand Duke of Lithuania": "grand duke of lithuania"
    },
    {
        ", the only son of ": null
    },
    {
        "Sigismund I the Old": "sigismund i the old"
    },
    {
        ", whom Sigismund II succeeded in 42     Sigismund was the only legitimate son of Italian-born ": null
    },
    {
        "Bona Sforza": "bona sforza"
    },
    {
        " and Sigismund the Old. From the beginning he was groomed and extensively educated as a successor. In 42 he was crowned  vivente rege  while his father was still alive. Sigismund Augustus continued a tolerance policy towards minorities and maintained peaceful relations with neighbouring countries, with the exception of the ": null
    },
    {
        "Northern Seven Years War": "northern seven years war"
    },
    {
        " which aimed to secure ": null
    },
    {
        "Baltic": "baltic sea"
    },
    {
        " trade. Under his patronage the culture flourished in Poland; he was a collector of tapestries from the ": null
    },
    {
        "Low Countries": "low countries"
    },
    {
        " and collected military memorabilia as well as swords and armours. Sigismund Augustus rule is widely considered as the apex of the ": null
    },
    {
        "Polish Golden Age": "polish golden age"
    },
    {
        ". In 42 he oversaw the signing of the ": null
    },
    {
        "Union of Lublin": "union of lublin"
    },
    {
        " between Poland and the ": null
    },
    {
        "Grand Duchy of Lithuania": "grand duchy of lithuania"
    },
    {
        ", which formed the ": null
    },
    {
        "Polish-Lithuanian Commonwealth": "polish-lithuanian commonwealth"
    },
    {
        " and introduced an elective monarchy.     Sigismund Augustus married three times; his first wife, ": null
    },
    {
        "Elizabeth of Austria": "elizabeth of austria"
    },
    {
        ", died in 42 at just eighteen. He was then involved in several relationships with mistresses, the most famous being ": null
    },
    {
        "Barbara Radziwiłł": "barbara radziwiłł"
    },
    {
        ", who became Sigismunds second wife and Queen of Poland in spite of his mothers disapproval. The marriage was deemed scandalous and was fiercely opposed by the royal court and the ": null
    },
    {
        "nobility": "szlachta"
    },
    {
        ". Barbara died five months after her coronation, presumably due to ill health, however, rumours circulated that she was poisoned. Sigismund finally wedded ": null
    },
    {
        "Catherine of Austria": "catherine of austria, queen of poland"
    },
    {
        ", but remained childless throughout his life.     Sigismund Augustus was last male member of the ": null
    },
    {
        "Jagiellons": "jagiellons"
    },
    {
        ". Following the death of his sister ": null
    },
    {
        "Anna": "anna jagiellon"
    },
    {
        " in 42 the Jagiellonian Dynasty came to an end.       Royal titles, in ": null
    },
    {
        "Latin": "latin"
    },
    {
        ": Sigismundus Augustus, Dei gratia rex Poloniae, magnus dux Lithuaniae, nec non terrarum Cracoviae, Sandomiriae, Siradiae, Lanciciae, Cuiaviae, Kiioviae, dominus hereditarius Russiae, Woliniae, Prussiae, Masoviae, Podlachiae, Culmensis, Elbingensis, Pomeraniae, Samogitiae, Livoniae etc. dominus et heres.   English translation: Sigismund Augustus, by the Grace of God, King of ": null
    },
    {
        "Poland": "poland"
    },
    {
        ", Grand Duke of ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        ", Lord and heir of the Lands of ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        ", ": null
    },
    {
        "Sandomierz": "sandomierz"
    },
    {
        ", ": null
    },
    {
        "Sieradz": "sieradz"
    },
    {
        ", ": null
    },
    {
        "Łęczyca": "łęczyca"
    },
    {
        ", ": null
    },
    {
        "Kuyavia": "kuyavia"
    },
    {
        ", ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        ", Hereditary Lord of ": null
    },
    {
        "Ruthenia": "ruthenia"
    },
    {
        ", ": null
    },
    {
        "Volhynia": "volhynia"
    },
    {
        ", ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        ", ": null
    },
    {
        "Masovia": "masovia"
    },
    {
        ", ": null
    },
    {
        "Podlaskie": "podlaskie"
    },
    {
        ", ": null
    },
    {
        "Culmer Land": "culmer land"
    },
    {
        ", ": null
    },
    {
        "Elbing": "elbing"
    },
    {
        ", ": null
    },
    {
        "Pomerania": "pomerania"
    },
    {
        ", ": null
    },
    {
        "Samogitia": "samogitia"
    },
    {
        ", ": null
    },
    {
        "Livonia": "duchy of livonia"
    },
    {
        " etc. Lord and heir            From the outset of his reign, Sigismund came into collision with the countrys ": null
    },
    {
        "nobility": "szlachta"
    },
    {
        ", who had already begun curtailing the power of the great families. The ostensible cause of the nobilitys animosity to the King was his second marriage, secretly contracted before his accession to the throne, with the ": null
    },
    {
        "Lithuanian": "lithuanians"
    },
    {
        " Calvinist": "calvinist"
    },
    {
        ", ": null
    },
    {
        "Barbara Radziwiłł": "barbara radziwiłł"
    },
    {
        ", daughter of ": null
    },
    {
        "Hetman": "hetman"
    },
    {
        " Jerzy Radziwiłł": "jerzy radziwiłł"
    },
    {
        ".     So violent was the agitation at Sigismunds first  sejm  that the deputies threatened to renounce their allegiance unless the King repudiated his wife Barbara. He refused and won the day.     By 42 when Sigismund summoned his second sejm, a reaction had begun in his favor, and the nobility was rebuked by ": null
    },
    {
        "Piotr Kmita": "piotr kmita"
    },
    {
        ", Marshal of the sejm, who accused them of attempting to unduly diminish the legislative prerogatives of the crown.          The death of Queen Barbara, five months after her coronation , under distressing circumstances, compelled Sigismund to contract a third, purely political union with his first cousin, the Austrian archduchess ": null
    },
    {
        "Catherine": "catherine of austria, queen of poland"
    },
    {
        ", also the sister of his first wife, ": null
    },
    {
        "Elisabeth": "elizabeth of austria"
    },
    {
        ", who had died within a year of her marriage to him, before his accession.     Sigismund soon lost all hope of children by his third bride; he was the last male Jagiellon in the direct line so the dynasty was threatened with extinction. He sought to remedy this by adultery with two of the most beautiful of his countrywomen, ": null
    },
    {
        "Barbara Giżanka": "barbara giżanka"
    },
    {
        " and ": null
    },
    {
        "Anna Zajączkowska": "anna zajączkowska"
    },
    {
        " but was unable to impregnate either of them. The sejm was willing to legitimize, and acknowledge as Sigismunds successor, any male heir who might be born to him; however, the King was to die childless.     The Kings marriage was a matter of great political import to ": null
    },
    {
        "Protestants": "protestants"
    },
    {
        " and Catholics alike. The Polish Protestants hoped that he would divorce and remarry and thus bring about a breach with Rome at the very crisis of the religious struggle in Poland. He was not free to remarry until Queen Catherines death on 42 February 42 but he followed her to the grave less than six months later.          Sigismunds reign was a period of internal turmoil and external expansion. He saw the introduction of the ": null
    },
    {
        "Protestant Reformation": "protestant reformation"
    },
    {
        " into Poland and Lithuania, and the peero-cratic upheaval that placed most political power in the hands of the ": null
    },
    {
        "szlachta ": "szlachta"
    },
    {
        "; he saw the collapse of the ": null
    },
    {
        "Knights of the Sword": "knights of the sword"
    },
    {
        " in the north, which led to the Commonwealths acquisition of ": null
    },
    {
        "Livonia": "livonia"
    },
    {
        " as a Lutheran duchy and the consolidation of ": null
    },
    {
        "Turkey": "turkey"
    },
    {
        "s power in the south. A less imposing figure than his father, the elegant and refined Sigismund II Augustus was nevertheless an even more effective statesman than the stern and majestic ": null
    },
    {
        "Sigismund I the Old": "sigismund i the old"
    },
    {
        ".     Sigismund II possessed to a high degree the tenacity and patience that seem to have characterized all the ": null
    },
    {
        "Jagiellons": "jagiellon dynasty"
    },
    {
        ", and he added to these qualities a dexterity and diplomatic finesse. No other Polish king seems to have so thoroughly understood the nature of the Polish sejm. Both the Austrian ambassadors and the papal legates testify to the care with which he controlled his nation. Everything went as he wished, they said, because he seemed to know everything in advance. He managed to get more money out of the sejm than his father ever could, and at one of his sejms he won the hearts of the assembly by unexpectedly appearing before them in the simple grey coat of a ": null
    },
    {
        "Masovia": "masovia"
    },
    {
        "n lord. Like his father, a pro-Austrian by conviction, he contrived even in this respect to carry with him the nation, often distrustful of the ": null
    },
    {
        "Germans": "germany"
    },
    {
        ". He avoided serious complications with the powerful Turks.          Sigismund II mediated for twenty years between the Catholic Church and the Protestants. His most striking memorial may have been the ": null
    },
    {
        "Union of Lublin": "union of lublin"
    },
    {
        ", which united Poland and Lithuania into the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        "—the Republic of the Two Nations . Also, German-speaking ": null
    },
    {
        "Royal Prussia": "royal prussia"
    },
    {
        " and Prussian cities were included. This achievement might well have been impossible without Sigismund.      Sigismund died at his beloved ": null
    },
    {
        "Knyszyn": "knyszyn"
    },
    {
        " on 42 July 42 aged 42 In 42 ": null
    },
    {
        "Henry III of Valois": "henry iii of france"
    },
    {
        " was ": null
    },
    {
        "elected": "royal elections in poland"
    },
    {
        " King of the Polish–Lithuanian Commonwealth for a few months, but then returned to France where he was crowned King Henry III of France. Shortly thereafter, Sigismunds sister ": null
    },
    {
        "Anna of Poland": "anna of poland"
    },
    {
        " married ": null
    },
    {
        "Stefan Batory": "stefan batory"
    },
    {
        ", and they ruled as King and Queen of Poland.     In addition to his family connections, Sigismund II was allied to the Imperial ": null
    },
    {
        "Habsburg": "habsburg"
    },
    {
        "s by his pledge as member of the ": null
    },
    {
        "Order of the Golden Fleece": "order of the golden fleece"
    },
    {
        ".     Young Sigismund is one of the figures on the  Prussian Homage  painting by ": null
    },
    {
        "Jan Matejko": "jan matejko"
    },
    {
        ".            Sigismund Augustus carried on with the development of several royal residencies including ": null
    },
    {
        "Wawel Castle": "wawel castle"
    },
    {
        ", ": null
    },
    {
        "Vilnius Castle": "royal palace of lithuania"
    },
    {
        ", ": null
    },
    {
        "Niepołomice Castle": "niepołomice castle"
    },
    {
        " and the ": null
    },
    {
        "Royal Castle": "royal castle, warsaw"
    },
    {
        " in ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        ". In the 42s he acquired the ": null
    },
    {
        "Tykocin Castle": "tykocin castle"
    },
    {
        " and rebuilt it in Renaissance style.  During the reign of Sigismund Augustus the structure served as a royal residence with an impressive treasury and library as well as the main arsenal of the crown.      Sigismund Augustus was a passionate collector of jewels. According to ": null
    },
    {
        "nuncio": "nuncio"
    },
    {
        " Bernardo Bongiovannis relation, his collection was cached in 42 chests.  Among the precious items in his possession was ": null
    },
    {
        "Charles V": "charles v, holy roman emperor"
    },
    {
        "s ruby of 42 ": null
    },
    {
        "scudo": "italian scudo"
    },
    {
        "s worth, as well as the Emperors diamond medal with ": null
    },
    {
        "Habsburgs": "habsburgs"
    },
    {
        " Eagle on one side and two columns with a sign  Plus Ultra  on the other side. In 42 after the death of his nephew ": null
    },
    {
        "John Sigismund Zápolya": "john sigismund zápolya"
    },
    {
        ", he inherited an  Hungarian Crown  and a  Swedish Crown  was made for him.   The Polish king treated those crowns as a family keepsake, and kept them in a private vault in the Tykocin Castle. He had also a ": null
    },
    {
        "sultan": "sultan"
    },
    {
        "s sword of 42 ": null
    },
    {
        "ducat": "ducat"
    },
    {
        "s worth, 42 precious horse trappings and 42 different private-use ": null
    },
    {
        "armour": "armour"
    },
    {
        "s.  The kings possession included a rich ": null
    },
    {
        "collection of tapestries": "jagiellonian tapestries"
    },
    {
        " , commissioned by him in ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        " in the years 42–42                     He married three times:   On 42 May 42 Sigismund married his first wife ": null
    },
    {
        "Elisabeth of Austria": "elisabeth of austria"
    },
    {
        " , eldest daughter of ": null
    },
    {
        "Ferdinand I, Holy Roman Emperor": "ferdinand i, holy roman emperor"
    },
    {
        " and ": null
    },
    {
        "Anna of Bohemia and Hungary": "anna of bohemia and hungary"
    },
    {
        ". In 42 he was pursuing marriage with ": null
    },
    {
        "Mary Tudor": "mary i of england"
    },
    {
        ", daughter of ": null
    },
    {
        "Henry VIII of England": "henry viii of england"
    },
    {
        " and then the noblewoman ": null
    },
    {
        "Katherine Willoughby, Duchess of Suffolk": "katherine willoughby, duchess of suffolk"
    },
    {
        ".   Between 42 July and 42 August 42 Sigismund married his second wife ": null
    },
    {
        "Barbara Radziwiłł": "barbara radziwiłł"
    },
    {
        " .   In the summer of 42 Sigismund married ": null
    },
    {
        "Catherine of Austria": "catherine of austria, queen of poland"
    },
    {
        " ": null
    }
]