[
    {
        "Signal reflection occurs when a signal is transmitted along a transmission medium, such as a ": null
    },
    {
        "copper cable": "reflections of signals on conducting lines"
    },
    {
        " or an ": null
    },
    {
        "optical fiber": "optical fiber"
    },
    {
        ". Some of the signal power may be reflected back to its origin rather than being carried all the way along the cable to the far end. This happens because imperfections in the cable cause ": null
    },
    {
        "impedance": "electrical impedance"
    },
    {
        " mismatches and non-linear changes in the cable characteristics. These abrupt changes in characteristics cause some of the transmitted signal to be reflected. In ": null
    },
    {
        "radio frequency": "radio frequency"
    },
    {
        " practice this is often measured in a dimensionless ratio known as ": null
    },
    {
        "voltage standing wave ratio": "voltage standing wave ratio"
    },
    {
        " with a VSWR bridge. The ratio of energy bounced back depends on the ": null
    },
    {
        "impedance mismatch": "impedance matching"
    },
    {
        ". Mathematically, it is defined using the ": null
    },
    {
        "reflection coefficient": "reflection coefficient"
    },
    {
        ".     Because the principles are the same, this concept is perhaps easiest to understand when considering an optical fiber. Imperfections in the glass create mirrors that reflect the light back along the fiber.     Impedance discontinuities cause ": null
    },
    {
        "attenuation": "attenuation"
    },
    {
        ", ": null
    },
    {
        "attenuation distortion": "attenuation distortion"
    },
    {
        ", ": null
    },
    {
        "standing waves": "standing waves"
    },
    {
        ", ": null
    },
    {
        "ringing": "ringing"
    },
    {
        " and other effects because a portion of a transmitted signal will be reflected back to the ": null
    },
    {
        "transmitting": "transmitter"
    },
    {
        " device rather than continuing to the ": null
    },
    {
        "receiver": "receiver"
    },
    {
        ", much like an ": null
    },
    {
        "echo": "echo"
    },
    {
        ". This effect is compounded if multiple discontinuities cause additional portions of the remaining signal to be reflected back to the transmitter. This is a fundamental problem with the ": null
    },
    {
        "daisy chain": "daisy chain"
    },
    {
        " method of connecting electronic components.     When a returning reflection strikes another discontinuity, some of the signal rebounds in the original signal direction, creating multiple echo effects. These ": null
    },
    {
        "forward echo": "forward echo"
    },
    {
        "es strike the receiver at different intervals making it difficult for the receiver to accurately detect data values on the signal. The effects can resemble those of ": null
    },
    {
        "jitter": "jitter"
    },
    {
        ".        Because damage to the cable can cause reflections, an instrument called an electrical ": null
    },
    {
        "time-domain reflectometer": "time-domain reflectometer"
    },
    {
        " or an ": null
    },
    {
        "optical time-domain reflectometer": "optical time-domain reflectometer"
    },
    {
        " can be used to locate the damaged part of a cable. These instruments work by sending a short pulsed signal into the cable and measuring how long the reflection takes to return. If only reflection magnitudes are desired, however, and exact fault locations are not required, VSWR bridges perform a similar but lesser function for ": null
    },
    {
        "RF cables": "radio frequency"
    },
    {
        ".     The combination of the effects of signal attenuation and impedance discontinuities on a ": null
    },
    {
        "communications link": "communications link"
    },
    {
        " is called ": null
    },
    {
        "insertion loss": "insertion loss"
    },
    {
        ". Proper network operation depends on constant ": null
    },
    {
        "characteristic impedance": "characteristic impedance"
    },
    {
        " in all cables and connectors, with no impedance discontinuities in the entire cable system. When a sufficient degree of ": null
    },
    {
        "impedance matching": "impedance matching"
    },
    {
        " is not practical, ": null
    },
    {
        "echo suppressor": "echo suppressor"
    },
    {
        "s or ": null
    },
    {
        "echo canceller": "echo canceller"
    },
    {
        "s, or both, can sometimes reduce the problems.     The ": null
    },
    {
        "Bergeron Diagram": "bergeron diagram"
    }
]