[
    {
        "              Signals Intelligence  is ": null
    },
    {
        "intelligence-gathering": "list of intelligence gathering disciplines"
    },
    {
        " by interception of signals, whether ": null
    },
    {
        "communications": "communication"
    },
    {
        " between people  or from electronic signals not directly used in communication . Signals intelligence is a ": null
    },
    {
        "subset": "subset"
    },
    {
        " of ": null
    },
    {
        "intelligence collection management": "intelligence collection management"
    },
    {
        ".   As ": null
    },
    {
        "sensitive information": "sensitive information"
    },
    {
        " is often ": null
    },
    {
        "encrypted": "encryption"
    },
    {
        ", signals intelligence in turn involves the use of ": null
    },
    {
        "cryptanalysis": "cryptanalysis"
    },
    {
        " to decipher the messages. ": null
    },
    {
        "Traffic analysis": "traffic analysis"
    },
    {
        "—the study of who is signaling whom and in what quantity—is also used to integrate information again.              Electronic interceptions appeared as early as 1900, during the ": null
    },
    {
        "Boer War": "boer war"
    },
    {
        " of 1899-1902. The British ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " had installed wireless sets produced by ": null
    },
    {
        "Marconi": "marconi"
    },
    {
        " on board their ships in the late 1890s and the ": null
    },
    {
        "British Army": "british army"
    },
    {
        " used some limited wireless signalling. The ": null
    },
    {
        "Boers": "boers"
    },
    {
        " captured some wireless sets and used them to make vital transmissions. Since the British were the only people transmitting at the time, no special interpretation of the signals that were intercepted by the British was necessary.   Compare:        The birth of signals intelligence in a modern sense dates from the ": null
    },
    {
        "Russo-Japanese War": "russo-japanese war"
    },
    {
        " of 1904-1905. As the Russian fleet prepared for conflict with Japan in 1904, the British ship ": null
    },
    {
        "HMS Diana": "hms diana"
    },
    {
        " stationed in the ": null
    },
    {
        "Suez Canal": "suez canal"
    },
    {
        " intercepted Russian naval wireless signals being sent out for the mobilization of the fleet, for the first time in history.   Report from HMS Diana on Russian Signals intercepted at Suez, 28 January 1904, Naval library, Ministry of Defence, London.            Over the course of the ": null
    },
    {
        "First World War": "first world war"
    },
    {
        ", the new method of signals intelligence reached maturity.  Failure to properly protect its communications fatally compromised the ": null
    },
    {
        "Russian Army": "russian army"
    },
    {
        " in its ": null
    },
    {
        "advance early in World War I": "russian invasion of east prussia"
    },
    {
        " and led to their disastrous defeat by the Germans under ": null
    },
    {
        "Ludendorff": "erich ludendorff"
    },
    {
        " and ": null
    },
    {
        "Hindenburg": "paul von hindenburg"
    },
    {
        " at the ": null
    },
    {
        "Battle of Tannenberg": "battle of tannenberg"
    },
    {
        ". In 1918, French intercept personnel captured a message written in the new ": null
    },
    {
        "ADFGVX cipher": "adfgvx cipher"
    },
    {
        ", which was cryptanalyzed by ": null
    },
    {
        "Georges Painvin": "georges painvin"
    },
    {
        ". This gave the Allies advance warning of the German 1918 ": null
    },
    {
        "Spring offensive": "spring offensive"
    },
    {
        ".     The British in particular built up great expertise in the newly emerging field of signals intelligence and codebreaking. On the declaration of war, Britain cut all German undersea cables.  This forced the Germans to use either a telegraph line that connected through the British network and could be tapped, or through radio which the British could then intercept.  Rear-Admiral ": null
    },
    {
        "Henry Oliver": "henry oliver"
    },
    {
        " appointed ": null
    },
    {
        "Sir Alfred Ewing": "james alfred ewing"
    },
    {
        " to establish an interception and decryption service at the ": null
    },
    {
        "Admiralty": "admiralty"
    },
    {
        "; ": null
    },
    {
        "Room 40": "room 40"
    },
    {
        ". An interception service known as ": null
    },
    {
        "Y service": "y-stations"
    },
    {
        ", together with the ": null
    },
    {
        "post office": "general post office"
    },
    {
        " and ": null
    },
    {
        "Marconi": "marconi"
    },
    {
        " stations grew rapidly to the point where the British could intercept almost all official German messages.     The German fleet was in the habit each day of wirelessing the exact position of each ship and giving regular position reports when at sea. It was possible to build up a precise picture of the normal operation of the ": null
    },
    {
        "High Seas Fleet": "high seas fleet"
    },
    {
        ", to infer from the routes they chose where defensive minefields had been placed and where it was safe for ships to operate. Whenever a change to the normal pattern was seen, it immediately signalled that some operation was about to take place and a warning could be given. Detailed information about submarine movements was also available.     The use of radio receiving equipment to pinpoint the location of the transmitter was also developed during the war.   Captain ": null
    },
    {
        "H.J. Round": "h.j. round"
    },
    {
        " working for ": null
    },
    {
        "Marconi": "marconi"
    },
    {
        ", began carrying out experiments with direction finding radio equipment for ": null
    },
    {
        "the army in France": "british expeditionary force"
    },
    {
        " in 1915. By May 1915, the Admiralty was able to track German submarines crossing the North Sea. Some of these stations also acted as Y stations to collect German messages, but a new section was created within Room 40 to plot the positions of ships from the directional reports.     Room 40 played an important role in several naval engagements during the war, notably in detecting major German sorties into the ": null
    },
    {
        "North Sea": "north sea"
    },
    {
        ". The battle of ": null
    },
    {
        "Dogger Bank": "battle of dogger bank"
    },
    {
        " was won in no small part due to the intercepts that allowed the Navy to position its ships in the right place. Livesey, Anthony, Historical Atlas of World War One, Holt; New York, 1994 p. 64 It played a vital role in subsequent naval clashes, including at the ": null
    },
    {
        "Battle of Jutland": "battle of jutland"
    },
    {
        " as the British fleet was sent out to intercept them. The direction-finding capability allowed for the tracking and location of German ships, submarines and ": null
    },
    {
        "Zeppelin": "zeppelin"
    },
    {
        "s. The system was so successful, that by the end of the war over 80 million words, comprising the totality of German wireless transmission over the course of the war had been intercepted by the operators of the ": null
    },
    {
        "Y-stations": "y-stations"
    },
    {
        " and decrypted.  However its most astonishing success was in ": null
    },
    {
        "decrypting": "cryptanalysis"
    },
    {
        " the ": null
    },
    {
        "Zimmermann Telegram": "zimmermann telegram"
    },
    {
        ", a ": null
    },
    {
        "telegram": "telegram"
    },
    {
        " from the German Foreign Office sent via Washington to its ": null
    },
    {
        "ambassador": "ambassador"
    },
    {
        " Heinrich von Eckardt": "heinrich von eckardt"
    },
    {
        " in ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        ".       With the importance of interception and decryption firmly established by the wartime experience, countries established permanent agencies dedicated to this task in the interwar period. In 1919, the British Cabinets Secret Service Committee, chaired by ": null
    },
    {
        "Lord Curzon": "lord curzon"
    },
    {
        ", recommended that a peace-time codebreaking agency should be created.  The ": null
    },
    {
        "Government Code and Cypher School": "government communications headquartersgovernment code and cypher school"
    },
    {
        " was the first peace-time codebreaking agency, with a public function to advise as to the security of codes and cyphers used by all Government departments and to assist in their provision , but also with a secret directive to study the methods of cypher communications used by foreign powers .  GC & CS officially formed on 1 November 1919, and produced its first decrypt on 19 October.  By 1940, GC & CS was working on the diplomatic codes and ciphers of 26 countries, tackling over 150 diplomatic cryptosystems. David Alvarez, GC & CS and American Diplomatic Cryptanalysis     The ": null
    },
    {
        "US Cipher Bureau": "black chamber"
    },
    {
        " was established in 1919 and achieved some success at the ": null
    },
    {
        "Washington Naval Conference": "washington naval conference"
    },
    {
        " in 1921, through cryptanalysis by ": null
    },
    {
        "Herbert Yardley": "herbert yardley"
    },
    {
        ". Secretary of War ": null
    },
    {
        "Henry L. Stimson": "henry l. stimson"
    },
    {
        " closed the US Cipher Bureau in 1929 with the words Gentlemen do not read each others mail.          The use of SIGINT had even greater implications during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". The combined effort of intercepts and cryptanalysis for the whole of the British forces in World War II came under the code name ": null
    },
    {
        "Ultra": "ultra"
    },
    {
        " managed from ": null
    },
    {
        "Government Code and Cypher School": "government code and cypher school"
    },
    {
        " at ": null
    },
    {
        "Bletchley Park": "bletchley park"
    },
    {
        ". Properly used, the German ": null
    },
    {
        "Enigma": "enigma machine"
    },
    {
        " and ": null
    },
    {
        "Lorenz ciphers": "lorenz cipher"
    },
    {
        "should have been virtually unbreakable, but flaws in German cryptographic procedures, and poor discipline among the personnel carrying them out, created vulnerabilities which made Bletchleys attacks feasible.     Bletchleys work was essential to defeating the ": null
    },
    {
        "U-boats": "u-boat"
    },
    {
        "in the ": null
    },
    {
        "Battle of the Atlantic": "battle of the atlantic"
    },
    {
        ", and to the British naval victories in the ": null
    },
    {
        "Battle of Cape Matapan": "battle of cape matapan"
    },
    {
        " and the ": null
    },
    {
        "Battle of North Cape": "battle of north cape"
    },
    {
        ". In 1941, Ultra exerted a powerful effect on the ": null
    },
    {
        "North African desert campaign": "north african campaign"
    },
    {
        " against German forces under General ": null
    },
    {
        "Erwin Rommel": "erwin rommel"
    },
    {
        ". General Sir ": null
    },
    {
        "Claude Auchinleck": "claude auchinleck"
    },
    {
        " wrote that were it not for Ultra, Rommel would have certainly got through to Cairo . ": null
    },
    {
        "Ultra": "ultra"
    },
    {
        " decrypts featured prominently in the story of ": null
    },
    {
        "Operation SALAM": "operation salaam"
    },
    {
        ", ": null
    },
    {
        "László Almásys": "lászló almásy"
    },
    {
        "mission across ": null
    },
    {
        "the desert": "western desert"
    },
    {
        " behind Allied lines in 1942. Gross, Kuno, Michael Rolke and András Zboray,  – László Almásy’s most daring Mission in the Desert War, Belleville, München, 2013 Prior to the ": null
    },
    {
        "Normandy landings": "normandy landings"
    },
    {
        " on D-Day in June 1944, the Allies knew the locations of all but two of Germanys fifty-eight Western-front divisions.     ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        " was reported to have told ": null
    },
    {
        "King George VI": "king george vi"
    },
    {
        ": It is thanks to the secret weapon of General Menzies, put into use on all the fronts, that we won the war! Supreme Allied Commander, ": null
    },
    {
        "Dwight D. Eisenhower": "dwight d. eisenhower"
    },
    {
        ", at the end of the war, described Ultra as having been decisive to Allied victory.  Official historian of British Intelligence in World War II ": null
    },
    {
        "Sir Harry Hinsley": "harry hinsley"
    },
    {
        ", argued that Ultra shortened the war by not less than two years and probably by four years ; and that, in the absence of Ultra, it is uncertain how the war would have ended.                      The ": null
    },
    {
        "United States Department of Defense": "united states department of defense"
    },
    {
        " has defined the term signals intelligence as:   A category of intelligence comprising either individually or in combination all communications intelligence , electronic intelligence , and ": null
    },
    {
        "foreign instrumentation signals intelligence": "foreign instrumentation signals intelligence"
    },
    {
        " , however transmitted.   Intelligence derived from communications, electronic, and foreign instrumentation signals.      Being a broad field, SIGINT has many sub-disciplines. The two main ones are communications intelligence and electronic intelligence .           A collection system has to know to look for a particular signal. System , in this context, has several nuances. Targeting is an output of the process of developing collection requirements:   : 1. An intelligence need considered in the allocation of intelligence resources. Within the Department of Defense, these collection requirements fulfill the ": null
    },
    {
        "essential elements of information": "essential elements of information"
    },
    {
        " and other intelligence needs of a commander, or an agency.   : 2. An established intelligence need, validated against the appropriate allocation of intelligence resources to fulfill the essential elements of information and other intelligence needs of an intelligence consumer.       First, atmospheric conditions, ": null
    },
    {
        "sunspot": "sunspot"
    },
    {
        "s, the targets transmission schedule and antenna characteristics, and other factors create uncertainty that a given signal intercept sensor will be able to hear the signal of interest, even with a geographically fixed target and an opponent making no attempt to evade interception. Basic countermeasures against interception include frequent changing of ": null
    },
    {
        "radio frequency": "radio frequency"
    },
    {
        ", ": null
    },
    {
        "polarization": "polarization"
    },
    {
        ", and other transmission characteristics. An intercept aircraft could not get off the ground if it had to carry antennas and receivers for every possible frequency and signal type to deal with such countermeasures.     Second, locating the transmitters position is usually part of SIGINT. ": null
    },
    {
        "Triangulation": "triangulation"
    },
    {
        " and more sophisticated ": null
    },
    {
        "radio location": "radiolocation"
    },
    {
        " techniques, such as ": null
    },
    {
        "time of arrival": "time of arrival"
    },
    {
        " methods, require multiple receiving points at different locations. These receivers send location-relevant information to a central point, or perhaps to a distributed system in which all participate, such that the information can be correlated and a location computed.       Modern SIGINT systems, therefore, have substantial communications among intercept platforms. Even if some platforms are clandestine, there is still a broadcast of information telling them where and how to look for signals.  A United States targeting system under development in the late 1990s, PSTS, constantly sends out information that helps the interceptors properly aim their antennas and tune their receivers. Larger intercept aircraft, such as the ": null
    },
    {
        "EP-3": "lockheed ep-3"
    },
    {
        " or ": null
    },
    {
        "RC-135": "rc-135"
    },
    {
        ", have the on-board capability to do some target analysis and planning, but others, such as the ": null
    },
    {
        "RC-12 GUARDRAIL": "c-12 huron"
    },
    {
        ", are completely under ground direction. GUARDRAIL aircraft are fairly small, and usually work in units of three to cover a tactical SIGINT requirement, where the larger aircraft tend to be assigned strategic/national missions.     Before the detailed process of targeting begins, someone has to decide there is a value in collecting information about something. While it would be possible to direct signals intelligence collection at a major sports event, the systems would capture a great deal of noise, news signals, and perhaps announcements in the stadium. If, however, an anti-terrorist organization believed that a small group would be trying to coordinate their efforts, using short-range unlicensed radios, at the event, SIGINT targeting of radios of that type would be reasonable. Targeting would not know where in the stadium the radios might be located, or the exact frequency they are using; those are the functions of subsequent steps such as signal detection and direction finding.     Once the decision to target is made, the various interception points need to cooperate, since resources are limited.   Knowing what interception equipment to use becomes easier when a target country buys its radars and radios from known manufacturers, or is given them as ": null
    },
    {
        "military aid": "military aid"
    },
    {
        ". National intelligence services keep libraries of devices manufactured by their own country and others, and then use a variety of techniques to learn what equipment is acquired by a given country.     Knowledge of ": null
    },
    {
        "physics": "physics"
    },
    {
        " and ": null
    },
    {
        "electronic engineering": "electronic engineering"
    },
    {
        " further narrows the problem of what types of equipment might be in use. An intelligence aircraft flying well outside the borders of another country will listen for long-range search radars, not short-range fire control radars that would be used by a mobile air defense. Soldiers scouting the front lines of another army know that the other side will be using radios that must be portable and not have huge antennas.       Even if a signal is human communications , the intelligence collection specialists have to know it exists. If the targeting function described above learns that a country has a radar that operates in a certain frequency range, the first step is to use a sensitive receiver, with one or more antennas that listen in every direction, to find an area where such a radar is operating. Once the radar is known to be in the area, the next step is to find its location.      If operators know the probable frequencies of transmissions of interest, they may use a set of receivers, preset to the frequencies of interest. These are the frequency versus power produced at the transmitter, before any filtering of signals that do not add to the information being transmitted. Received energy on a particular frequency may start a recorder, and alert a human to listen to the signals if they are intelligible . If the frequency is not known, the operators may look for power on primary or ": null
    },
    {
        "sideband": "sideband"
    },
    {
        " frequencies using a ": null
    },
    {
        "spectrum analyzer": "spectrum analyzer"
    },
    {
        ". Information from the spectrum analyzer is then used to tune receivers to signals of interest. For example, in this simplified spectrum, the actual information is at 800  kHz and 1.2  MHz.      Real-world transmitters and receivers usually are directional. In the figure to the left, assume that each display is connected to a spectrum analyzer connected to a directional antenna aimed in the indicated direction.       Spread-spectrum communications is an ": null
    },
    {
        "electronic counter-countermeasures ": "electronic counter-countermeasure"
    },
    {
        " technique to defeat looking for particular frequencies. Spectrum analysis can be used in a different ECCM way to identify frequencies not being jammed or not in use.          The earliest, and still common, means of direction finding is to use directional antennas as ": null
    },
    {
        "goniometer": "goniometer"
    },
    {
        "s, so that a line can be drawn from the receiver through the position of the signal of interest.  Knowing the compass bearing, from a single point, to the transmitter does not locate it. Where the bearings from multiple points, using goniometry, are plotted on a map, the transmitter will be located at the point where the bearings intersect. This is the simplest case; a target may try to confuse listeners by having multiple transmitters, giving the same signal from different locations, switching on and off in a pattern known to their user but apparently random to the listener.     Individual directional antennas have to be manually or automatically turned to find the signal direction, which may be too slow when the signal is of short duration. One alternative is the ": null
    },
    {
        "Wullenweber": "wullenweber"
    },
    {
        " array technique. In this method, several concentric rings of antenna elements simultaneously receive the signal, so that the best bearing will ideally be clearly on a single antenna or a small set. Wullenweber arrays for high-frequency signals are enormous, referred to as elephant cages by their users.     An alternative to tunable directional antennas, or large omnidirectional arrays such as the Wullenweber, is to measure the ": null
    },
    {
        "time of arrival": "time of arrival"
    },
    {
        " of the signal at multiple points, using ": null
    },
    {
        "GPS": "gps"
    },
    {
        " or a similar method to have precise time synchronization. Receivers can be on ground stations, ships, aircraft, or satellites, giving great flexibility.     Modern ": null
    },
    {
        "anti-radiation missiles": "anti-radiation missile"
    },
    {
        "can home in on and attack transmitters; military antennas are rarely a safe distance from the user of the transmitter.          When locations are known, usage patterns may emerge, from which inferences may be drawn. Traffic analysis is the discipline of drawing patterns from information flow among a set of senders and receivers, whether those senders and receivers are designated by location determined through ": null
    },
    {
        "direction finding": "direction finding"
    },
    {
        ", by addressee and sender identifications in the message, or even ": null
    },
    {
        "MASINT": "masint"
    },
    {
        " techniques for fingerprinting transmitters or operators. Message content, other than the sender and receiver, is not necessary to do traffic analysis, although more information can be helpful.     For example, if a certain type of radio is known to be used only by tank units, even if the position is not precisely determined by direction finding, it may be assumed that a tank unit is in the general area of the signal. The owner of the transmitter can assume someone is listening, so might set up tank radios in an area where he wants the other side to believe he has actual tanks. As part of ": null
    },
    {
        "Operation Quicksilver": "operation quicksilver"
    },
    {
        ", part of the ": null
    },
    {
        "deception": "deception"
    },
    {
        " plan for the invasion of Europe at the ": null
    },
    {
        "Battle of Normandy": "invasion of normandy"
    },
    {
        ", radio transmissions simulated the headquarters and subordinate units of the fictitious ": null
    },
    {
        "First United States Army Group": "first united states army group"
    },
    {
        " , commanded by ": null
    },
    {
        "George S. Patton": "george s. patton"
    },
    {
        ", to make the German defense think that the main invasion was to come at another location. In like manner, fake radio transmissions from Japanese aircraft carriers, before the ": null
    },
    {
        "Battle of Pearl Harbor": "battle of pearl harbor"
    },
    {
        ", were made from Japanese local waters, while the attacking ships moved under strict radio silence.     Traffic analysis need not focus on human communications. For example, if the sequence of a radar signal, followed by an exchange of targeting data and a confirmation, followed by observation of artillery fire, this may identify an automated counterbattery system. A radio signal that triggers navigational beacons could be a landing aid system for an airstrip or helicopter pad that is intended to be low-profile.     Patterns do emerge. Knowing a radio signal, with certain characteristics, originating from a fixed headquarters may be strongly suggestive that a particular unit will soon move out of its regular base. The contents of the message need not be known to infer the movement.     There is an art as well as science of traffic analysis. Expert analysts develop a sense for what is real and what is deceptive. ": null
    },
    {
        "Harry Kidder": "harry kidder"
    },
    {
        ", for example, was one of the star cryptanalysts of World War II, a star hidden behind the secret curtain of SIGINT.        Generating an electronic order of battle requires identifying SIGINT emitters in an area of interest, determining their geographic location or range of mobility, characterizing their signals, and, where possible, determining their role in the broader organizational ": null
    },
    {
        "order of battle": "order of battle"
    },
    {
        ". EOB covers both COMINT and ELINT.  The ": null
    },
    {
        "Defense Intelligence Agency": "defense intelligence agency"
    },
    {
        " maintains an EOB by location. The Joint Spectrum Center of the ": null
    },
    {
        "Defense Information Systems Agency": "defense information systems agency"
    },
    {
        " supplements this location database with five more technical databases:   : FRRS: Frequency Resource Record System   : BEI: Background Environment Information   : SCS: Spectrum Certification System   : EC/S: Equipment Characteristics/Space   : TACDB: platform lists, sorted by nomenclature, which contain links to the C-E equipment complement of each platform, with links to the parametric data for each piece of equipment, military unit lists and their subordinate units with equipment used by each unit.        For example, several voice transmitters might be identified as the command net in a tank battalion or tank-heavy task force. Another set of transmitters might identify the logistic net for that same unit. An inventory of ELINT sources might identify the ": null
    },
    {
        "medium": "radar masintan/tpq-36"
    },
    {
        "- and ": null
    },
    {
        "long-range": "radar masintan/tpq-37"
    },
    {
        " counter-artillery radars in a given area.     Signals intelligence units will identify changes in the EOB, which might indicate enemy unit movement, changes in command relationships, and increases or decreases in capability.     Using the COMINT gathering method enables the intelligence officer to produce an electronic order of battle by traffic analysis and content analysis among several enemy units. For example, if the following messages were intercepted:   : U1 to U2, requesting permission to proceed to checkpoint X.   : U2 to U1, approved. please report at arrival.   : U1 to U2, all vehicles have arrived to checkpoint X.     This sequence shows that there are two units in the battlefield, unit 1 is mobile, while unit 2 is in a higher hierarchical level, perhaps a command post. One can also understand that unit 1 moved from one point to another which are distant from each 20 minutes with a vehicle. If these are regular reports over a period of time, they might reveal a patrol pattern. Direction-finding and ": null
    },
    {
        "radio frequency MASINT": "radiofrequency masint"
    },
    {
        " could help confirm that the traffic is not deception.     The EOB buildup process is divided as following:   : Signal separation   : Measurements optimization   : Data Fusion   : Networks build-up     Separation of the intercepted spectrum and the signals intercepted from each sensor must take place in an extremely small period of time, in order to separate the different signals to different transmitters in the battlefield. The complexity of the separation process depends on the complexity of the transmission methods .     By gathering and clustering data from each sensor, the measurements of the direction of signals can be optimized and get much more accurate than the basic measurements of a standard ": null
    },
    {
        "direction finding": "direction finding"
    },
    {
        " sensor.  By calculating larger samples of the sensors output data in near real-time, together with historical information of signals, better results are achieved.     Data fusion correlates data samples from different frequencies from the same sensor, same being confirmed by ": null
    },
    {
        "direction finding": "direction finding"
    },
    {
        " or ": null
    },
    {
        "radiofrequency MASINT": "radiofrequency masint"
    },
    {
        ". If an emitter is mobile, direction finding, other than discovering a repetitive pattern of movement, is of limited value in determining if a sensor is unique. MASINT then becomes more informative, as individual transmitters and antennas may have unique side lobes, unintentional radiation, pulse timing, etc.     Network build-up, or analysis of emitters in a target region over a sufficient period of time, enables creation of the communications flows of a battlefield.           COMINT is a sub-category of signals intelligence that engages in dealing with messages or voice information derived from the interception of foreign communications. COMINT is commonly referred to as SIGINT, which can cause confusion when talking about the broader intelligence disciplines. The US ": null
    },
    {
        "Joint Chiefs of Staff": "joint chiefs of staff"
    },
    {
        " defines it as Technical information and intelligence derived from foreign communications by other than the intended recipients .     COMINT, which is defined to be communications among people, will reveal some or all of the following:   Who is transmitting   Where they are located, and, if the transmitter is moving, the report may give a plot of the signal against location   If known, the organizational function of the transmitter   The time and duration of transmission, and the schedule if it is a periodic transmission   The frequencies and other technical characteristics of their transmission   If the transmission is encrypted or not, and if it can be decrypted. If it is possible to intercept either an originally transmitted cleartext or obtain it through cryptanalysis, the language of the communication and a translation .   The addresses, if the signal is not a general broadcast and if addresses are retrievable from the message. These stations may also be COMINT , ELINT or both. Rather than, or in addition to, an address or other identifier, there may be information on the location and signal characteristics of the responder.       A basic COMINT technique is to listen for voice communications, usually over radio but possibly leaking from telephones or from wiretaps. If the voice communications are encrypted, traffic analysis may still give information.     In the Second World War, for security the United States used Native American volunteer communicators known as ": null
    },
    {
        "code talker": "code talker"
    },
    {
        "s, who used languages such as ": null
    },
    {
        "Navajo": "navajo language"
    },
    {
        ", ": null
    },
    {
        "Comanche": "comanche"
    },
    {
        " and ": null
    },
    {
        "Choctaw": "choctaw"
    },
    {
        ", which would be understood by few people, even in the U.S. Even within these uncommon languages, the code talkers used specialized codes, so a butterfly might be a specific Japanese aircraft. British forces made limited use of ": null
    },
    {
        "Welsh": "welsh language"
    },
    {
        " speakers for the same reason.     While modern electronic encryption does away with the need for armies to use obscure languages, it is likely that some groups might use rare dialects that few outside their ethnic group would understand.       Morse code interception was once very important, but ": null
    },
    {
        "Morse code": "morse code"
    },
    {
        " telegraphy is now obsolete in the western world, although possibly used by special operations forces. Such forces, however, now have portable cryptographic equipment. Morse code is still used by military forces of former Soviet Union countries.     Specialists scan radio frequencies for character sequences and fax.       A given digital communications link can carry thousands or millions of voice communications, especially in developed countries. Without addressing the legality of such actions, the problem of identifying which channel contains which conversation becomes much simpler when the first thing intercepted is the signaling channel that carries information to set up telephone calls. In civilian and many military use, this channel will carry messages in ": null
    },
    {
        "Signaling System 7": "signaling system 7"
    },
    {
        " protocols.     Retrospective analysis of telephone calls can be made from ": null
    },
    {
        "Call detail record": "call detail record"
    },
    {
        " used for billing the calls.       More a part of ": null
    },
    {
        "communications security": "communications security"
    },
    {
        " than true intelligence collection, SIGINT units still may have the responsibility of monitoring ones own communications or other electronic emissions, to avoid providing intelligence to the enemy. For example, a security monitor may hear an individual transmitting inappropriate information over an unencrypted radio network, or simply one that is not authorized for the type of information being given. If immediately calling attention to the violation would not create an even greater security risk, the monitor will call out one of the BEADWINDOW codes  used by Australia, Canada, New Zealand, the United Kingdom, the United States, and other nations working under their procedures. Standard BEADWINDOW codes include:   Position: ": null
    }
]