[
    {
        "     A signature block  is a personalized block of text automatically appended at the bottom of an ": null
    },
    {
        "email": "email"
    },
    {
        " message, ": null
    },
    {
        "Usenet": "usenet"
    },
    {
        " article, or ": null
    },
    {
        "forum": "internet forum"
    },
    {
        " post.       An email signature is a block of text appended to the end of an email message often containing the senders name, address, phone number, disclaimer or other contact information.     Traditional internet cultural .sig practices assume the use of monospaced ": null
    },
    {
        "ASCII": "ascii"
    },
    {
        " text because they pre-date ": null
    },
    {
        "MIME": "mime"
    },
    {
        " and the use of ": null
    },
    {
        "HTML": "html"
    },
    {
        " in email. In this tradition, it is common practice for a signature block to consist of one or more lines containing some brief information on the author of the message such as phone number and email address, ": null
    },
    {
        "URLs": "uniform resource locator"
    },
    {
        "for sites owned or favoured by the author—but also often a quotation , or an ": null
    },
    {
        "ASCII art": "ascii art"
    },
    {
        " picture.   Among some groups of people it has been common to include ": null
    },
    {
        "self-classification codes": ":category:internet self-classification codes"
    },
    {
        ".     |\\_/|   / @ @ \\ Purrrfectly pleasant   Poppy Prinz _   & gt; & gt;x & lt; & lt;´   / O \\     Most email clients, including ": null
    },
    {
        "Mozilla Thunderbird": "mozilla thunderbird"
    },
    {
        ", the built-in mail tool of the web browser ": null
    },
    {
        "Opera": "opera"
    },
    {
        ", ": null
    },
    {
        "Microsoft Outlook": "microsoft outlook"
    },
    {
        " and ": null
    },
    {
        "Outlook Express": "microsoft outlook express"
    },
    {
        ", and ": null
    },
    {
        "Eudora": "eudora"
    },
    {
        ", can be configured to automatically append an email signature with each new message. A shortened form of a signature block , only including ones name, often with some distinguishing prefix, can be used to simply indicate the end of a ": null
    },
    {
        "post": "posting style"
    },
    {
        " or response. Most email servers can be configured to append email signatures to all outgoing mail as well.       Signature blocks are also used in the ": null
    },
    {
        "Usenet": "usenet"
    },
    {
        " discussion system.          The Usenet standard RFC 3676 specifies that a signature block should be displayed as ": null
    },
    {
        "plain text": "plain text"
    },
    {
        " in a fixed-width font , and should be delimited from the body of the message by a single line consisting of exactly two hyphens, followed by a space, followed by the end of line . See , 2005, and also , section 4.3, 2004, and , section 4.3.2, 2010 . This latter prescription, which goes by many names, including sig dashes , signature cut line , sig-marker , sig separator and signature delimiter , allows software to automatically mark or remove the sig block as the receiver desires.          Businesses often automatically append signature blocks to messages—or have policies mandating a certain style. Generally they resemble standard ": null
    },
    {
        "business cards": "business card"
    },
    {
        "in their content—and often in their presentation—with company logos and sometimes even the exact appearance of a business card. In some cases, a ": null
    },
    {
        "vCard": "vcard"
    },
    {
        " is automatically attached.     In addition to these standard items, ": null
    },
    {
        "email disclaimers": "email disclaimer"
    },
    {
        "of various sorts are often automatically appended. These are typically couched in legal jargon, but it is unclear what weight they have in law, and they are routinely lampooned.       Business emails may also use some signature block elements mandated by local laws:   Germany requires companies to disclose their company name, registration number, place of registration etc. in email signatures, in any business-related emails.    Irelands ": null
    },
    {
        "Director of Corporate Enforcement": "director of corporate enforcement"
    },
    {
        " requires all limited companies operating websites to disclose such information in their emails.     The UKs ECommerce Regulations require this information in all emails from limited companies.      While criticized by some as overly bureaucratic, these regulations only extend existing laws for paper business correspondence to email.       On ": null
    },
    {
        "web forums": "internet forums"
    },
    {
        ", the rules are often less strict on how a signature block is formatted, as ": null
    },
    {
        "Web browsers": "web browser"
    },
    {
        "typically are not operated within the same constraints as text interface applications. Users will typically define their signature as part of their profile. Depending on the boards capabilities, signatures may range from a simple line or two of text to an elaborately constructed HTML piece. ": null
    },
    {
        "Images": "image"
    },
    {
        "are often allowed as well, including dynamically updated images usually hosted remotely and modified by a server-side script. In some cases ": null
    },
    {
        "avatars": "avatar internet forums"
    },
    {
        " or hackergotchis take over some of the role of signatures.       With ": null
    },
    {
        "FidoNet": "fidonet"
    },
    {
        ", echomail and netmail software would often add an origin line at the end of a message. This would indicate the FidoNet address and name of the originating system . The user posting the message would generally not have any control over the origin line. However, single-line ": null
    },
    {
        "tagline": "tagline"
    },
    {
        "s, added under user control, would often contain a humorous or witty saying. Multi-line user signature blocks were rare.     However, a tearline standard for FidoNet was included in FTS-0004  and clarified in FSC-0068 ": null
    }
]