[
    {
        "           Silicon Valley is a region in the southern part of the ": null
    },
    {
        "San Francisco Bay Area": "san francisco bay area"
    },
    {
        " in ": null
    },
    {
        "Northern California": "northern california"
    },
    {
        " that serves as a global center for ": null
    },
    {
        "high technology": "high technology"
    },
    {
        ", ": null
    },
    {
        "innovation": "innovation"
    },
    {
        ", and ": null
    },
    {
        "social media": "social media"
    },
    {
        ". It corresponds roughly to the geographical ": null
    },
    {
        "Santa Clara Valley": "santa clara valley"
    },
    {
        ", although its boundaries have increased in recent decades. ": null
    },
    {
        "San Jose": "san jose, california"
    },
    {
        " is the Valleys largest city, the third-largest in ": null
    },
    {
        "California": "california"
    },
    {
        ", and the tenth-largest in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ". Other major Silicon Valley cities include ": null
    },
    {
        "Palo Alto": "palo alto"
    },
    {
        ", ": null
    },
    {
        "Menlo Park": "menlo park, california"
    },
    {
        ", ": null
    },
    {
        "Redwood City": "redwood city, california"
    },
    {
        ", ": null
    },
    {
        "Cupertino": "cupertino"
    },
    {
        ", ": null
    },
    {
        "Santa Clara": "santa clara, california"
    },
    {
        ", ": null
    },
    {
        "Mountain View": "mountain view, california"
    },
    {
        ", and ": null
    },
    {
        "Sunnyvale": "sunnyvale, california"
    },
    {
        ".  The San Jose Metropolitan Area has the third-highest GDP per capita in the world , according to the ": null
    },
    {
        "Brookings Institution": "brookings institution"
    },
    {
        ".      The word silicon in the name originally referred to the large number of innovators and manufacturers in the region specialising in ": null
    },
    {
        "silicon": "silicon"
    },
    {
        "-based ": null
    },
    {
        "MOS transistors": "mos transistor"
    },
    {
        "and ": null
    },
    {
        "integrated circuit": "integrated circuit"
    },
    {
        " chips. The area is now home to many of the worlds largest ": null
    },
    {
        "high-tech corporations": "technology company"
    },
    {
        ", including the headquarters of more than 30 businesses in the ": null
    },
    {
        "Fortune 1000": "fortune 1000"
    },
    {
        ", and thousands of ": null
    },
    {
        "startup companies": "startup company"
    },
    {
        ". Silicon Valley also accounts for one-third of all of the ": null
    },
    {
        "venture capital": "venture capital"
    },
    {
        " investment in the United States, which has helped it to become a leading hub and ": null
    },
    {
        "startup ecosystem": "startup ecosystem"
    },
    {
        " for high-tech innovation and scientific development. It was in Silicon Valley that the silicon-based ": null
    },
    {
        "integrated circuit": "integrated circuit"
    },
    {
        ", the ": null
    },
    {
        "microprocessor": "microprocessor"
    },
    {
        ", and the ": null
    },
    {
        "microcomputer": "microcomputer"
    },
    {
        ", among other technologies, were developed. As of 2013, the region employed about a quarter of a million ": null
    },
    {
        "information technology": "information technology"
    },
    {
        " workers.      As more high-tech companies were established across San Jose and the Santa Clara Valley, and then north towards the Bay Areas two other major cities, ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " and ": null
    },
    {
        "Oakland": "oakland, california"
    },
    {
        ", the term Silicon Valley has come to have two definitions: a geographic one, referring to ": null
    },
    {
        "Santa Clara County": "santa clara county"
    },
    {
        ", and a ": null
    },
    {
        "metonym": "metonym"
    },
    {
        "ical one, referring to all high-tech businesses in the Bay Area. The term is often used as a ": null
    },
    {
        "synecdoche": "synecdoche"
    },
    {
        " for the American high-technology ": null
    },
    {
        "economic sector": "economic sector"
    },
    {
        ". The name also became a global synonym for leading high-tech research and enterprises, and thus inspired ": null
    },
    {
        "similar named locations": "list of places with   silicon   names"
    },
    {
        ", as well as ": null
    },
    {
        "research parks": "list of research parks"
    },
    {
        " and ": null
    },
    {
        "technology centers": "list of technology centers"
    },
    {
        " with a comparable structure all around the world.     Due to the personal connection between people and technology, many headquarters of companies in Silicon Valley are a hotspot for ": null
    },
    {
        "tourism": "tourism"
    },
    {
        ".          The popularization of the name is credited to ": null
    },
    {
        "Don Hoefler": "don hoefler"
    },
    {
        ", who first used it in the article Silicon Valley USA , appearing in the January 11, 1971 issue of the weekly trade newspaper  Electronic News .  The term gained widespread use in the early 1980s, at the time of the introduction of the ": null
    },
    {
        "IBM PC": "ibm pc"
    },
    {
        " and numerous related hardware and software products to the consumer market.               Silicon Valley was born through several contributing factors intersecting, including a skilled ": null
    },
    {
        "STEM": "stem fields"
    },
    {
        " research base housed in area universities, plentiful ": null
    },
    {
        "venture capital": "venture capital"
    },
    {
        ", and steady ": null
    },
    {
        "U.S. Department of Defense": "united states department of defense"
    },
    {
        " spending. ": null
    },
    {
        "Stanford University": "stanford university"
    },
    {
        " leadership was especially important in the valleys early development. Together these elements formed the basis of its growth and success.           On August 23, 1899, the first ": null
    },
    {
        "ship-to-shore": "ship-to-shore"
    },
    {
        " wireless telegraph message to be received in the US was from the San Francisco lightship outside the ": null
    },
    {
        "Golden Gate": "golden gate"
    },
    {
        ", signaling the return of the American fleet from the Philippines after their victory in the ": null
    },
    {
        "Spanish–American War": "spanish–american war"
    },
    {
        ".  The ship had been outfitted with a wireless telegraph transmitter by a local newspaper, so that they could prepare a celebration on the return of the American sailors.  Local historian ": null
    },
    {
        "Clyde Arbuckle": "clyde arbuckle"
    },
    {
        " states in Clyde Arbuckles History of San Jose  that California first heard the click of a telegraph key on September 11, 1853. It marked completion of an enterprise begun by a couple of San Francisco Merchants Exchange members named George Sweeney and Theodore E. Baugh… He says, In 1849, the gentleman established a wigwag telegraph station a top a high hill overlooking Portsmouth Squares for signaling arriving ships… The operator at the first station caught these signals by telescope and relayed them to the Merchants Exchange for the waiting business community. Arbuckle points to the historic significance the ": null
    },
    {
        "Merchants Exchange Building ": "merchants exchange building"
    },
    {
        " and ": null
    },
    {
        "Telegraph Hill, San Francisco": "telegraph hill, san francisco"
    },
    {
        " when he goes on to say The first station gave the name Telegraph to the hill on which it was located. It was known as the Inner Station; the second, as the Outer Station. Both used their primitive mode of communication until Messrs. Sweeney and Baugh connected the Outer Station directly with the Merchantss Exchange by electric telegraph Wire.     According to Arbuckle Sweeney and Baughs line was strictly an intra-city, San Francisco-based service; that is until California State Telegraph Company enfranchised on May 3, 1852; whereas, O.E. Allen and C. Burnham led the way to build a line from San Francisco to Marysville via San Jose, Stockton, and Sacramento . Delays to construction occurred until September 1853; but, …San Jose became the first station on the line when the wire arrived here on October 15. The line was completed when Gambles northbound crew met a similar crew working southward from Marysville on October 24.     The Bay Area had long been a major site of ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " research and technology. In 1909, ": null
    },
    {
        "Charles Herrold": "charles herrold"
    },
    {
        " started the first ": null
    },
    {
        "radio": "radio"
    },
    {
        " station in the United States with regularly scheduled programming in ": null
    },
    {
        "San Jose": "san jose, california"
    },
    {
        ". Later that year, Stanford University graduate ": null
    },
    {
        "Cyril Elwell": "cyril frank elwell"
    },
    {
        " purchased the U.S. patents for ": null
    },
    {
        "Poulsen arc": "arc converter"
    },
    {
        " radio transmission technology and founded the Federal Telegraph Corporation in ": null
    },
    {
        "Palo Alto": "palo alto"
    },
    {
        ". Over the next decade, the FTC created the worlds first global radio communication system, and signed a contract with the Navy in 1912.      In 1933, ": null
    },
    {
        "Air Base Sunnyvale": "moffett federal airfield"
    },
    {
        ", California, was commissioned by the United States Government for use as a Naval Air Station to house the airship ": null
    },
    {
        "USS Macon": "uss macon"
    },
    {
        " in ": null
    },
    {
        "Hangar One": "hangar one"
    },
    {
        ". The station was renamed NAS Moffett Field, and between 1933 and 1947, U.S. Navy blimps were based there.  A number of technology firms had set up shop in the area around Moffett Field to serve the Navy. When the Navy gave up its airship ambitions and moved most of its west coast operations to ": null
    },
    {
        "San Diego": "san diego, california"
    },
    {
        ", the ": null
    },
    {
        "National Advisory Committee for Aeronautics": "national advisory committee for aeronautics"
    },
    {
        "  took over portions of Moffett Field for ": null
    },
    {
        "aeronautics": "aeronautics"
    },
    {
        " research. Many of the original companies stayed, while new ones moved in. The immediate area was soon filled with ": null
    },
    {
        "aerospace": "aerospace"
    },
    {
        " firms, such as ": null
    },
    {
        "Lockheed": "lockheed corporation"
    },
    {
        ".     ;Ham radio   The Bay Area was an early center of ": null
    },
    {
        "ham radio": "ham radio"
    },
    {
        " with about 10% of the operators in the United States. William Eitel, Jack McCullough, and ": null
    },
    {
        "Charles Litton": "charles litton, sr."
    },
    {
        ", who together pioneered vacuum tube manufacturing in the Bay Area, were hobbyists with training in technology gained locally who participated in the development of ": null
    },
    {
        "shortwave radio": "shortwave radio"
    },
    {
        " by the ham radio hobby. ": null
    },
    {
        "High frequency": "high frequency"
    },
    {
        ", and especially, ": null
    },
    {
        "Very high frequency": "very high frequency"
    },
    {
        ", VHF, transmission in the 10-meter band, required higher quality power tubes than were manufactured by the consortium of RCA, Western Electric, General Electric, Westinghouse which controlled vacuum tube manufacture. Litton, founder of ": null
    },
    {
        "Litton Industries": "litton industries"
    },
    {
        ", pioneered manufacturing techniques which resulted in the award of wartime contracts to manufacture transmitting tubes for ": null
    },
    {
        "radar": "radar"
    },
    {
        " to ": null
    },
    {
        "Eitel-McCullough": "eimac"
    },
    {
        ", a San Bruno firm, which manufactured power-grid tubes for radio amateurs and aircraft radio equipment.      ;Welfare capitalism   A union organizing drive in 1939–40 at Eitel-McCullough by the strong Bay Area labor movement was fought off by adoption of a strategy of ": null
    },
    {
        "welfare capitalism": "welfare capitalism"
    },
    {
        " which included pensions and other generous benefits, profit sharing, and such extras as a medical clinic and a cafeteria. An atmosphere of cooperation and collaboration was established.  Successes have been few and far between  for union organizing drives by ": null
    },
    {
        "UE": "united electrical, radio and machine workers of america"
    },
    {
        " and others in subsequent years.      ;U.S. response to Sputnik   On October 4, 1957 the Soviet Union launched the first space satellite, ": null
    },
    {
        "Sputnik": "sputnik"
    },
    {
        ", which sparked fear that the Soviet Union was pulling ahead technologically. After President Eisenhower signed the National Aeronautics and Space Act , he turned to ": null
    },
    {
        "Fairchild Semiconductor": "fairchild semiconductor"
    },
    {
        ", then the only company in the world that was able to make transistors. The president funded Fairchilds project, which was highly successful.        ": null
    },
    {
        "Stanford University": "stanford university"
    },
    {
        ", its affiliates, and graduates have played a major role in the development of this area.  Some examples include the work of ": null
    },
    {
        "Lee De Forest": "lee de forest"
    },
    {
        " with his invention of a pioneering vacuum tube called the ": null
    },
    {
        "Audion": "audion"
    },
    {
        " and the oscilloscopes of ": null
    },
    {
        "Hewlett-Packard": "hewlett-packard"
    },
    {
        ".     A very powerful sense of regional solidarity accompanied the rise of Silicon Valley. From the 1890s, Stanford Universitys leaders saw its mission as service to the West and shaped the school accordingly. At the same time, the perceived exploitation of the West at the hands of eastern interests fueled booster-like attempts to build self-sufficient local industry. Thus, regionalism helped align Stanfords interests with those of the areas high-tech firms for the first fifty years of Silicon Valleys development. Stephen B. Adams, Regionalism in Stanfords Contribution to the Rise of Silicon Valley , Enterprise & Society 2003 4: 521–543     During the 1940s and 1950s, ": null
    },
    {
        "Frederick Terman": "frederick terman"
    },
    {
        ", as Stanfords dean of engineering and provost, encouraged faculty and graduates to start their own companies. He is credited with nurturing ": null
    },
    {
        "Hewlett-Packard": "hewlett-packard"
    },
    {
        ", ": null
    },
    {
        "Varian Associates": "varian associates"
    },
    {
        ", and other high-tech firms, until what would become Silicon Valley grew up around the Stanford campus. Terman is often called the father of Silicon Valley .      In 1956, ": null
    },
    {
        "William Shockley": "william shockley"
    },
    {
        ", the co-inventor of the first working ": null
    },
    {
        "transistor": "transistor"
    },
    {
        " , moved from ": null
    },
    {
        "New Jersey": "new jersey"
    },
    {
        " to ": null
    },
    {
        "Mountain View, California": "mountain view, california"
    },
    {
        ", to start ": null
    },
    {
        "Shockley Semiconductor Laboratory": "shockley semiconductor laboratory"
    },
    {
        " to live closer to his ailing mother in ": null
    },
    {
        "Palo Alto": "palo alto"
    },
    {
        ". Shockleys work served as the basis for many electronic developments for decades.       During 1955–85, solid state technology research and development at Stanford University followed three waves of industrial innovation made possible by support from private corporations, mainly ": null
    },
    {
        "Bell Telephone Laboratories": "bell labs"
    },
    {
        ", ": null
    },
    {
        "Shockley Semiconductor": "shockley semiconductor laboratory"
    },
    {
        ", ": null
    },
    {
        "Fairchild Semiconductor": "fairchild semiconductor"
    },
    {
        ", and ": null
    },
    {
        "Xerox PARC": "parc"
    },
    {
        ". In 1969, the ": null
    },
    {
        "Stanford Research Institute": "sri international"
    },
    {
        " , operated one of the four original nodes that comprised ": null
    },
    {
        "ARPANET": "arpanet"
    },
    {
        ", predecessor to the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ". Christophe Lécuyer, What Do Universities Really Owe Industry? The Case of Solid State Electronics at Stanford, Minerva: a Review of Science, Learning & Policy 2005 43: 51–71     ;Stanford Industrial Park   After World War II, universities were experiencing enormous demand due to returning students. To address the financial demands of Stanfords growth requirements, and to provide local employment opportunities for graduating students, ": null
    },
    {
        "Frederick Terman": "frederick terman"
    },
    {
        " proposed the leasing of Stanfords lands for use as an office park, named the ": null
    },
    {
        "Stanford Industrial Park": "stanford industrial park"
    },
    {
        "  in the year 1951. Leases were limited to high technology companies. Its first tenant was ": null
    },
    {
        "Varian Associates": "varian associates"
    },
    {
        ", founded by Stanford alumni in the 1930s to build military radar components. However, Terman also found ": null
    },
    {
        "venture capital": "venture capital"
    },
    {
        " for civilian technology start-ups. One of the major success stories was ": null
    },
    {
        "Hewlett-Packard": "hewlett-packard"
    },
    {
        ". Founded in ": null
    },
    {
        "Packards garage": "packards garage"
    },
    {
        " by Stanford graduates ": null
    },
    {
        "William Hewlett": "william reddington hewlett"
    },
    {
        " and ": null
    },
    {
        "David Packard": "david packard"
    },
    {
        ", Hewlett-Packard moved its offices into the Stanford Research Park shortly after 1953. In 1954, Stanford created the Honors Cooperative Program to allow full-time employees of the companies to pursue graduate degrees from the University on a part-time basis. The initial companies signed five-year agreements in which they would pay double the tuition for each student in order to cover the costs. Hewlett-Packard has become the largest personal computer manufacturer in the world, and transformed the home printing market when it released the first thermal drop-on-demand ": null
    },
    {
        "ink jet printer": "ink jet printer"
    },
    {
        " in 1984.  Other early tenants included ": null
    },
    {
        "Eastman Kodak": "eastman kodak"
    },
    {
        ", ": null
    },
    {
        "General Electric": "general electric"
    },
    {
        ", and ": null
    },
    {
        "Lockheed": "lockheed corporation"
    },
    {
        ".             Up until the late 1950s, ": null
    },
    {
        "germanium": "germanium"
    },
    {
        " was the dominant ": null
    },
    {
        "semiconductor": "semiconductor"
    },
    {
        " material for ": null
    },
    {
        "transistors": "transistors"
    },
    {
        " and other ": null
    },
    {
        "semiconductor devices": "semiconductor devices"
    },
    {
        ". Germanium was initially considered the more effective semiconductor material, as it was able to demonstrate better performance due to higher ": null
    },
    {
        "carrier mobility": "carrier mobility"
    },
    {
        ".   The relative lack of performance in early ": null
    },
    {
        "silicon": "silicon"
    },
    {
        " semiconductors was due to ": null
    },
    {
        "electrical conductivity": "electrical conductivity"
    },
    {
        " being limited by unstable ": null
    },
    {
        "quantum": "quantum mechanics"
    },
    {
        " surface states": "surface states"
    },
    {
        ",  preventing ": null
    },
    {
        "electricity": "electricity"
    },
    {
        " from reliably penetrating the surface to reach the semiconducting silicon layer.       In 1953, ": null
    },
    {
        "William Shockley": "william shockley"
    },
    {
        " left ": null
    },
    {
        "Bell Labs": "bell labs"
    },
    {
        " in a disagreement over the handling of the invention of the ": null
    },
    {
        "bipolar transistor": "bipolar transistor"
    },
    {
        ". After returning to ": null
    },
    {
        "California Institute of Technology": "california institute of technology"
    },
    {
        " for a short while, Shockley moved to ": null
    },
    {
        "Mountain View, California": "mountain view, santa clara county, california"
    },
    {
        ", in 1956, and founded ": null
    },
    {
        "Shockley Semiconductor Laboratory": "shockley semiconductor laboratory"
    },
    {
        ". Unlike many other researchers who used germanium as the semiconductor material, Shockley believed that silicon was the better material for making transistors. Shockley intended to replace the current transistor with a new three-element design , but the design was considerably more difficult to build than the simple transistor. In 1957, Shockley decided to end research on the silicon transistor. As a result of Shockleys abusive management style, eight engineers left the company to form ": null
    },
    {
        "Fairchild Semiconductor": "fairchild semiconductor"
    },
    {
        "; Shockley referred to them as the ": null
    },
    {
        "traitorous eight": "traitorous eight"
    },
    {
        " . Two of the original employees of Fairchild Semiconductor, ": null
    },
    {
        "Robert Noyce": "robert noyce"
    },
    {
        " and ": null
    },
    {
        "Gordon Moore": "gordon moore"
    },
    {
        ", would go on to found ": null
    },
    {
        "Intel": "intel corporation"
    },
    {
        ".       In 1957, ": null
    },
    {
        "Mohamed Atalla": "mohamed atalla"
    },
    {
        " at Bell Labs developed the process of silicon ": null
    },
    {
        "surface passivation": "surface passivation"
    },
    {
        " by ": null
    },
    {
        "thermal oxidation": "thermal oxidation"
    },
    {
        ",   which electrically stabilized silicon surfaces  and reduced the concentration of ": null
    },
    {
        "electronic states": "electronic state"
    },
    {
        "at the surface. This enabled silicon to surpass the conductivity and performance of germanium, leading to silicon replacing germanium as the dominant semiconductor material, and paving the way for the mass-production of silicon semiconductor devices.  This led to Atalla inventing the ": null
    },
    {
        "MOSFET": "mosfet"
    },
    {
        " , also known as the MOS transistor, with his colleague ": null
    },
    {
        "Dawon Kahng": "dawon kahng"
    },
    {
        " in 1959. It was the first truly compact transistor that could be ": null
    },
    {
        "miniaturised": "mosfet scaling"
    },
    {
        " and ": null
    },
    {
        "mass-produced": "moores law"
    },
    {
        " for a wide range of uses,  and is credited with starting the ": null
    },
    {
        "silicon revolution": "silicon revolution"
    },
    {
        ".     The MOSFET was initially overlooked and ignored by Bell Labs in favour of bipolar transistors, which led to Atalla resigning from Bell Labs and joining ": null
    },
    {
        "Hewlett-Packard": "hewlett-packard"
    },
    {
        " in 1961.  However, the MOSFET generated significant interest at ": null
    },
    {
        "RCA": "rca"
    },
    {
        " and ": null
    },
    {
        "Fairchild Semiconductor": "fairchild semiconductor"
    },
    {
        ". In late 1960, Karl Zaininger and Charles Meuller fabricated a MOSFET at RCA, and ": null
    },
    {
        "Chih-Tang Sah": "chih-tang sah"
    },
    {
        " built an MOS-controlled ": null
    },
    {
        "tetrode": "tetrode"
    },
    {
        " at Fairchild. MOS devices were later commercialized by ": null
    },
    {
        "General Microelectronics": "general microelectronics"
    },
    {
        " and Fairchild in 1964. The development of MOS technology became the focus of startup companies in California, such as Fairchild and Intel, fuelling the technological and economic growth of what would later be called Silicon Valley.        On April 23, 1963, ": null
    },
    {
        "J.C.R. Licklider": "j.c.r. licklider"
    },
    {
        ", the first director of the ": null
    },
    {
        "Information Processing Techniques Office": "information processing techniques office"
    },
    {
        " at ": null
    },
    {
        "The Pentagons": "the pentagon"
    },
    {
        " ARPA": "darpa"
    },
    {
        " issued an office memorandum addressed to ": null
    },
    {
        "Members and Affiliates of the Intergalactic Computer Network": "intergalactic computer network"
    },
    {
        ". It rescheduled a meeting in Palo Alto regarding his vision of a computer network which he imagined as an electronic commons open to all the main and essential medium of informational interaction for governments, institutions, corporations, and individuals.     As head of IPTO from 1962 to 1964, Licklider initiated three of the most important developments in information technology: the creation of computer science departments at several major universities, time-sharing, and networking. By the late 1960s, his promotion of the concept had inspired a primitive version of his vision called ": null
    },
    {
        "ARPANET": "arpanet"
    },
    {
        ", which expanded into a network of networks in the 1970s that became the ": null
    },
    {
        "Internet": "internet"
    },
    {
        ".       The ": null
    },
    {
        "Immigration and Nationality Act of 1965": "immigration and nationality act of 1965"
    },
    {
        " and other factors such as the mass exodus by ": null
    },
    {
        "Vietnamese boat people": "vietnamese boat people"
    },
    {
        " resulted in significant immigration, particularly by Asians, Latinos, and Portuguese, to Silicon Valley where they contributed to both the high-tech and production workforce.  The Asian-American population in Santa Clara County rose from 43,000 in 1970 to 430,000 in 2000. During the same period the Latino population grew to 24% in the county and 30% in San Jose. The African-American population in the county remained steady but grew slightly to about 5%.  Expansion of the ": null
    },
    {
        "H-1B visa": "h-1b visa"
    },
    {
        " in 1990 also played a role.                 Following the 1959 inventions of the monolithic ": null
    },
    {
        "integrated circuit": "integrated circuit"
    },
    {
        " chip by ": null
    },
    {
        "Robert Noyce": "robert noyce"
    },
    {
        " at Fairchild, and the ": null
    },
    {
        "MOSFET": "mosfet"
    },
    {
        " by ": null
    },
    {
        "Mohamed Atalla": "mohamed atalla"
    },
    {
        " and ": null
    },
    {
        "Dawon Kahng": "dawon kahng"
    },
    {
        " at Bell Labs,  Atalla first proposed the concept of the ": null
    },
    {
        "MOS integrated circuit": "mos integrated circuit"
    },
    {
        " chip in 1960,  and then the first commercial MOS IC was introduced by ": null
    },
    {
        "General Microelectronics": "general microelectronics"
    },
    {
        " in 1964.  The development of the MOS IC led to the invention of the ": null
    },
    {
        "microprocessor": "microprocessor"
    },
    {
        ",  incorporating the functions of a ": null
    },
    {
        "computers": "computer"
    },
    {
        " central processing unit": "central processing unit"
    },
    {
        " on a single integrated circuit.  The first single-chip microprocessor was the ": null
    },
    {
        "Intel 4004": "intel 4004"
    },
    {
        ",  designed and realized by ": null
    },
    {
        "Federico Faggin": "federico faggin"
    },
    {
        " along with ": null
    },
    {
        "Ted Hoff": "marcian hoff"
    },
    {
        ", ": null
    },
    {
        "Masatoshi Shima": "masatoshi shima"
    },
    {
        " and ": null
    },
    {
        "Stanley Mazor": "stanley mazor"
    },
    {
        " at Intel in 1971. ": null
    },
    {
        "Federico Faggin": "federico faggin"
    },
    {
        ", , IEEE Solid-State Circuits Magazine, Winter 2009, ": null
    },
    {
        "IEEE Xplore": "ieee xplore"
    },
    {
        " In April 1974, ": null
    },
    {
        "Intel": "intel"
    },
    {
        " released the ": null
    },
    {
        "Intel 8080": "intel 8080"
    },
    {
        ",  Electronic News was a weekly trade newspaper. The same advertisement appeared in the ": null
    },
    {
        "May 2, 1974 issue of Electronics magazine": ":file:intel 8080 advertisement may 1974.jpg"
    },
    {
        ". a computer on a chip , the first truly usable microprocessor .             The ": null
    },
    {
        "Homebrew Computer Club": "homebrew computer club"
    },
    {
        " was an informal group of electronic enthusiasts and technically minded hobbyists who gathered to trade parts, ": null
    },
    {
        "circuits": "electronic circuit"
    },
    {
        ", and information pertaining to ": null
    },
    {
        "DIY": "diy"
    },
    {
        " construction of computing devices.  It was started by ": null
    },
    {
        "Gordon French": "gordon french"
    },
    {
        " and ": null
    },
    {
        "Fred Moore": "fred moore"
    },
    {
        " who met at the Community Computer Center in ": null
    },
    {
        "Menlo Park": "menlo park, california"
    },
    {
        ". They both were interested in maintaining a regular, open forum for people to get together to work on making computers more accessible to everyone.      The first meeting was held as of March 1975 at Frenchs garage in ": null
    },
    {
        "Menlo Park": "menlo park, california"
    },
    {
        ", ": null
    },
    {
        "San Mateo County, California": "san mateo county, california"
    },
    {
        "; which was on occasion of the arrival of the ": null
    },
    {
        "MITS": "micro instrumentation and telemetry systems"
    },
    {
        " Altair": "altair 8800"
    },
    {
        " microcomputer, the first unit sent to the area for review by ": null
    },
    {
        "Peoples Computer Company": "peoples computer company"
    },
    {
        ". ": null
    },
    {
        "Steve Wozniak": "steve wozniak"
    },
    {
        " and ": null
    },
    {
        "Steve Jobs": "steve jobs"
    },
    {
        " credit that first meeting with inspiring them to design the original ": null
    },
    {
        "Apple I": "apple i"
    },
    {
        " and ": null
    },
    {
        "Apple II": "apple ii"
    },
    {
        " computers. As a result, the first preview of the ": null
    },
    {
        "Apple I": "apple i"
    },
    {
        " was given at the Homebrew Computer Club.  Subsequent meetings were held at an auditorium at the ": null
    },
    {
        "Stanford Linear Accelerator Center": "stanford linear accelerator center"
    },
    {
        ".          By the early 1970s, there were many ": null
    },
    {
        "semiconductor": "semiconductor"
    },
    {
        " companies in the area, ": null
    },
    {
        "computer": "computer"
    },
    {
        " firms using their devices, and programming and service companies serving both. Industrial space was plentiful and housing was still inexpensive. Growth during this era was fueled by the emergence of ": null
    },
    {
        "venture capital": "venture capital"
    },
    {
        " on ": null
    },
    {
        "Sand Hill Road": "sand hill road"
    },
    {
        ", beginning with ": null
    },
    {
        "Kleiner Perkins": "kleiner perkins"
    },
    {
        " and ": null
    },
    {
        "Sequoia Capital": "sequoia capital"
    },
    {
        " in 1972; the availability of venture capital exploded after the successful $1.3  billion ": null
    },
    {
        "IPO": "initial public offering"
    },
    {
        " of ": null
    },
    {
        "Apple Computer": "apple inc."
    },
    {
        " in December 1980. Since the 1980s, Silicon Valley has been home to the largest concentration of venture capital firms in the world.     In 1971 ": null
    },
    {
        "Don Hoefler": "don hoefler"
    },
    {
        " traced the origins of Silicon Valley firms, including via investments from ": null
    },
    {
        "Fairchilds": "fairchild semiconductor"
    },
    {
        "eight co-founders.  by Gregory Gromov The key investors in ": null
    },
    {
        "Kleiner Perkins": "kleiner perkins"
    },
    {
        " and ": null
    },
    {
        "Sequoia Capital": "sequoia capital"
    },
    {
        " were from the same group, directly leading to  Tech Crunch  2014 estimate of 92 public firms of 130 related listed firms then worth over US$2.1 Trillion with over 2,000 firms traced back to them.           Prior to 1970, most Northern California lawyers were based in San Francisco, especially the experienced ": null
    },
    {
        "patent attorneys": "patent attorney"
    },
    {
        "whom the high-tech industry needed to protect its intellectual property. During the 1970s, lawyers began to follow venture capitalists down the ": null
    },
    {
        "Peninsula": "san francisco peninsula"
    },
    {
        " to serve the booming high-tech industry in Silicon Valley. One sign of the rapid expansion of Silicon Valley legal services was that Palo Alto law firm ": null
    },
    {
        "Wilson Sonsini Goodrich & Rosati": "wilson sonsini goodrich  &  rosati"
    },
    {
        " expanded from a dozen attorneys in 1975 to more than 700 by 2000 .  During this era, law firms evolved from their conventional role as protectors of intellectual property into business advisers, intermediaries, and dealmakers, and thereby acquired unusual prominence in Silicon Valley.        Although semiconductors are still a major component of the areas economy, Silicon Valley has been most famous in recent years for innovations in software and ": null
    },
    {
        "Internet": "internet"
    },
    {
        " services. Silicon Valley has significantly influenced computer operating systems, ": null
    },
    {
        "software": "software"
    },
    {
        ", and user interfaces.     Using money from ": null
    },
    {
        "NASA": "nasa"
    },
    {
        ", the ": null
    },
    {
        "US Air Force": "united states air force"
    },
    {
        ", and ": null
    },
    {
        "ARPA": "darpa"
    },
    {
        ", ": null
    },
    {
        "Doug Engelbart": "doug engelbart"
    },
    {
        " invented the ": null
    },
    {
        "mouse": "computer mouse"
    },
    {
        " and hypertext-based collaboration tools in the mid-1960s and 1970s while at ": null
    },
    {
        "Stanford Research Institute": "stanford research institute"
    },
    {
        " , first publicly demonstrated in 1968 in what is now known as ": null
    },
    {
        "The Mother of All Demos": "the mother of all demos"
    },
    {
        ". Engelbarts ": null
    },
    {
        "Augmentation Research Center": "augmentation research center"
    },
    {
        " at SRI was also involved in launching the ": null
    },
    {
        "ARPANET": "arpanet"
    },
    {
        "  and starting the ": null
    },
    {
        "Network Information Center": "internic"
    },
    {
        " . ": null
    },
    {
        "Xerox": "xerox"
    },
    {
        " hired some of Engelbarts best researchers beginning in the early 1970s. In turn, in the 1970s and 1980s, Xeroxs ": null
    },
    {
        "Palo Alto Research Center": "palo alto research center"
    },
    {
        " played a pivotal role in ": null
    },
    {
        "object-oriented": "object-oriented"
    },
    {
        " programming, ": null
    },
    {
        "graphical user interfaces": "graphical user interfaces"
    },
    {
        " , ": null
    },
    {
        "Ethernet": "ethernet"
    },
    {
        ", ": null
    },
    {
        "PostScript": "postscript"
    },
    {
        ", and ": null
    },
    {
        "laser printers": "laser printers"
    },
    {
        ".     While Xerox marketed equipment using its technologies, for the most part its technologies flourished elsewhere. The diaspora of Xerox inventions led directly to ": null
    },
    {
        "3Com": "3com"
    },
    {
        " and ": null
    },
    {
        "Adobe Systems": "adobe systems"
    },
    {
        ", and indirectly to ": null
    },
    {
        "Cisco": "cisco"
    },
    {
        ", ": null
    },
    {
        "Apple Computer": "apple computer"
    },
    {
        ", and ": null
    },
    {
        "Microsoft": "microsoft"
    },
    {
        ". Apples ": null
    },
    {
        "Macintosh": "apple macintosh"
    },
    {
        " GUI was largely a result of ": null
    },
    {
        "Steve Jobs": "steve jobs"
    },
    {
        " visit to PARC and the subsequent hiring of key personnel.  from apple-history.com Ciscos impetus stemmed from the need to route a variety of protocols over ": null
    },
    {
        "Stanford Universitys": "stanford university"
    },
    {
        " Ethernet": "ethernet"
    },
    {
        " campus network": "campus network"
    },
    {
        ".           Commercial use of the Internet became practical and grew slowly throughout the early 1990s.     In 1995, commercial use of the ": null
    },
    {
        "Internet": "internet"
    },
    {
        " grew substantially and the initial wave of internet startups, ": null
    },
    {
        "Amazon.com": "amazon.com"
    },
    {
        ", ": null
    },
    {
        "eBay": "ebay"
    },
    {
        ", and the predecessor to ": null
    },
    {
        "Craigslist": "craigslist"
    },
    {
        " began operations.           Silicon Valley is generally considered to have been the center of the ": null
    },
    {
        "dot-com bubble": "dot-com bubble"
    },
    {
        ", which started in the mid-1990s and collapsed after the ": null
    },
    {
        "NASDAQ": "nasdaq"
    },
    {
        " stock market": "stock market"
    },
    {
        " began to decline dramatically in April 2000. During the bubble era, real estate prices reached unprecedented levels. For a brief time, ": null
    },
    {
        "Sand Hill Road": "sand hill road"
    },
    {
        " was home to the most expensive commercial real estate in the world, and the booming economy resulted in severe ": null
    },
    {
        "traffic congestion": "traffic congestion"
    },
    {
        ".       After the dot-com crash, Silicon Valley continues to maintain its status as one of the top research and development centers in the world. A 2006  The Wall Street Journal  story found that 12 of the 20 most inventive towns in America were in California, and 10 of those were in Silicon Valley.   Wall Street Journal, July 22–23, 2006, P1. San Jose led the list with 3,867 utility patents filed in 2005, and number two was Sunnyvale, at 1,881 utility patents. Ibid. Silicon Valley is also home to a significant number of ": null
    },
    {
        "Unicorn": "unicorn"
    },
    {
        " ventures, referring to ": null
    },
    {
        "startup companies": "startup company"
    },
    {
        " whose ": null
    },
    {
        "valuation": "valuation"
    },
    {
        " has exceeded $1  billion ": null
    },
    {
        "dollars": "united states dollar"
    },
    {
        ".  However, taxes and the cost of living in Silicon Valley have prompted some corporations to gradually transfer their operations to the Midwest or Sun Belt states.                      The ": null
    },
    {
        "San Francisco Bay Area": "san francisco bay area"
    },
    {
        " has the largest concentration of ": null
    },
    {
        "high-tech": "high-tech"
    },
    {
        " companies in the ": null
    },
    {
        "United States": "united states"
    },
    {
        ", at 387,000 high-tech jobs, of which Silicon Valley accounts for 225,300 high-tech jobs. Silicon Valley has the highest concentration of high-tech workers of any metropolitan area, with 285.9 out of every 1,000 private-sector workers. Silicon Valley has the highest average high-tech salary in the ": null
    },
    {
        "United States": "united states"
    },
    {
        " at $144,800.  Largely a result of the high technology sector, the San Jose-Sunnyvale-Santa Clara, CA Metropolitan Statistical Area has the most millionaires and the most billionaires in the United States per capita.      The region is the biggest high-tech manufacturing centre in the United States.   The unemployment rate of the region was 9.4% in January 2009 and has decreased to a record low of 2.7% as of August 2019.  Silicon Valley received 41% of all U.S. venture investment in 2011, and 46% in 2012.  More traditional industries also recognize the potential of high-tech development, and several car manufacturers have opened offices in Silicon Valley to capitalize on its entrepreneurial ecosystem.             Manufacture of ": null
    },
    {
        "transistors": "transistor"
    },
    {
        "is, or was, the core industry in Silicon Valley. The production workforce  was for the most part composed of Asian and Latino immigrants who were paid low wages and worked in hazardous conditions due to the chemicals used in the manufacture of ": null
    },
    {
        "integrated circuit": "integrated circuit"
    },
    {
        "s. Technical, engineering, design, and administrative staffs were in large part  well compensated.      Silicon Valley has a ": null
    },
    {
        "severe housing shortage": "california housing shortage"
    },
    {
        ", caused by the market imbalance between jobs created and housing units built: from 2010 to 2015, many more jobs have been created than housing units built.  This shortage has driven home prices extremely high, far out of the range of production workers.  As of 2016 a two-bedroom apartment rented for about $2,500 while the median home price was about $1  million. The ": null
    },
    {
        "Financial Post": "financial post"
    },
    {
        " called Silicon Valley the most expensive U.S. housing region.  ": null
    },
    {
        "Homelessness": "homelessness"
    },
    {
        " is a problem with housing beyond the reach of middle-income residents; there is little ": null
    },
    {
        "shelter space": "homeless shelter"
    },
    {
        " other than in San Jose which, as of 2015, was making an effort to develop shelters by renovating old hotels.       The Economist  also attributes the high cost of living to the success of the industries in this region. Although, this rift between high and low salaries is driving many residents out who can no longer afford to live there. In the ": null
    },
    {
        "Bay Area": "san francisco bay area"
    },
    {
        ", the number of residents planning to leave within the next several years has had an increase of 12% since 2016, from 34% to 46%.                             Thousands of ": null
    },
    {
        "high technology": "high-tech"
    },
    {
        " companies are headquartered in Silicon Valley. Among those, the following are in the ": null
    },
    {
        "Fortune 1000": "fortune 1000"
    },
    {
        ":          Additional notable companies headquartered in Silicon Valley include :        Silicon Valley is also home to the high-tech ": null
    },
    {
        "superstore": "superstore"
    },
    {
        " retail chain ": null
    },
    {
        "Frys Electronics": "frys electronics"
    },
    {
        ".       ": null
    },
    {
        "Moffett Federal Airfield": "moffett federal airfield"
    },
    {
        " NASA Ames Research Center": "nasa ames research center"
    },
    {
        "   Onizuka Air Force Station": "onizuka air force station"
    },
    {
        "   SLAC National Accelerator Laboratory": "slac national accelerator laboratory"
    },
    {
        " VA Palo Alto Hospital": "va palo alto hospital"
    },
    {
        "          Depending on what geographic regions are included in the meaning of the term, the population of Silicon Valley is between 3.5 and 4 million. A 1999 study by ": null
    },
    {
        "AnnaLee Saxenian": "annalee saxenian"
    },
    {
        " for the ": null
    },
    {
        "Public Policy Institute of California": "public policy institute of california"
    },
    {
        " reported that a third of Silicon Valley scientists and engineers were immigrants and that nearly a quarter of Silicon Valleys high-technology firms since 1980 were run by ": null
    },
    {
        "Chinese": "chinese american"
    },
    {
        " or ": null
    },
    {
        "Indian": "indian american"
    },
    {
        " CEOs .  There is a stratum of well-compensated technical employees and managers, including 10s of thousands of single-digit millionaires . This income and range of assets will support a middle-class lifestyle in Silicon Valley.              In November 2006, the ": null
    },
    {
        "University of California, Davis": "university of california, davis"
    },
    {
        " released a report analyzing business leadership by women within the state.  The report showed that although 103 of the 400 largest public companies headquartered in California were located in Santa Clara County , only 8.8% of Silicon Valley companies had women CEOs.   This was the lowest percentage in the state.      Silicon Valley tech leadership positions are occupied almost exclusively by men.  This is also represented in the number of new companies founded by women as well as the number of women-lead startups that receive venture capital funding. Wadhwa said he believes that a contributing factor is a lack of parental encouragement to study science and engineering.  He also cited a lack of women role models and noted that most famous tech leaders—like ": null
    },
    {
        "Bill Gates": "bill gates"
    },
    {
        ", ": null
    },
    {
        "Steve Jobs": "steve jobs"
    },
    {
        ", and ": null
    },
    {
        "Mark Zuckerberg": "mark zuckerberg"
    },
    {
        "—are men.     In 2014, tech companies Google, Yahoo!, Facebook, Apple, and others, released corporate transparency reports that offered detailed employee breakdowns. In May, ": null
    },
    {
        "Google": "google"
    },
    {
        " said 17% of its tech employees worldwide were women, and, in the U.S., 1% of its tech workers were ": null
    },
    {
        "black": "african american"
    },
    {
        " and 2% were ": null
    },
    {
        "Hispanic": "hispanic"
    },
    {
        ".  June 2014 brought reports from Yahoo! and Facebook. ": null
    },
    {
        "Yahoo!": "yahoo!"
    },
    {
        " said that 15% of its tech jobs were held by women, 2% of its tech employees were black and 4% Hispanic.  ": null
    },
    {
        "Facebook": "facebook"
    },
    {
        " reported that 15% of its tech workforce was female, and 3% was Hispanic and 1% was black.  In August, ": null
    },
    {
        "Apple": "apple inc."
    },
    {
        " reported that 80% of its global tech staff was male and that, in the U.S., 54% of its tech jobs were staffed by Caucasians and 23% by Asians.  Soon after,  USA Today  published an article about Silicon Valleys lack of tech-industry diversity, pointing out that it is largely white or Asian, and male. Blacks and Hispanics are largely absent, it reported, and women are underrepresented in Silicon Valley—from giant companies to start-ups to venture capital firms.  Civil rights activist ": null
    },
    {
        "Jesse Jackson": "jesse jackson"
    },
    {
        " said of improving diversity in the tech industry, This is the next step in the civil rights movement  while ": null
    },
    {
        "T.J. Rodgers": "t.j. rodgers"
    },
    {
        " has argued against Jacksons assertions.     As of October 2014, some high-profile Silicon Valley firms were working actively to prepare and recruit women.  Bloomberg  reported that Apple, Facebook, Google, and Microsoft attended the 20th annual ": null
    },
    {
        "Grace Hopper Celebration of Women in Computing": "grace hopper celebration of women in computing"
    },
    {
        " conference to actively recruit and potentially hire female engineers and technology experts.  The same month, the second annual Platform Summit was held to discuss increasing racial and gender diversity in tech.  As of April 2015 experienced women were engaged in creation of venture capital firms which leveraged womens perspectives in funding of startups.      After UC Davis published its Study of California Women Business Leaders in November 2006, some  San Jose Mercury News  readers dismissed the possibility that sexism contributed in making Silicon Valleys leadership gender gap the highest in the state. A January 2015 issue of  Newsweek  magazine featured an article detailing reports of sexism and misogyny in Silicon Valley.  The articles author, ": null
    },
    {
        "Nina Burleigh": "nina burleigh"
    },
    {
        ", asked, Where were all these offended people when women like ": null
    },
    {
        "Heidi Roizen": "heidi roizen"
    },
    {
        " published accounts of having a venture capitalist stick her hand in his pants under a table while a deal was being discussed?      Silicon Valley firms board of directors are composed of 15.7% women compared with 20.9% in the S & P 100.      The 2012 lawsuit ": null
    },
    {
        "Pao v. Kleiner Perkins": "pao v. kleiner perkins"
    },
    {
        " was filed in ": null
    },
    {
        "San Francisco County Superior Court": "san francisco county superior court"
    },
    {
        " by executive ": null
    },
    {
        "Ellen Pao": "ellen pao"
    },
    {
        " for ": null
    },
    {
        "gender discrimination": "gender discrimination"
    },
    {
        " against her employer, ": null
    },
    {
        "Kleiner Perkins": "kleiner perkins"
    },
    {
        ".  The case went to trial in February 2015. On March 27, 2015 the jury found in favor of Kleiner Perkins on all counts.  Nevertheless, the case, which had wide press coverage, resulted in major advances in consciousness of gender discrimination on the part of venture capital and technology firms and their women employees.   Two other cases have been filed against Facebook and Twitter.        Funding for public schools in upscale Silicon Valley communities such as ": null
    },
    {
        "Woodside": "woodside, california"
    },
    {
        " is often supplemented by grants from private foundations set up for that purpose and funded by local residents. Schools in less affluent areas such as ": null
    },
    {
        "East Palo Alto": "east palo alto, california"
    },
    {
        " must depend on state funding.             The following ": null
    },
    {
        "Santa Clara County": "santa clara county"
    },
    {
        " cities are traditionally considered to be in Silicon Valley :          The geographical boundaries of Silicon Valley have changed over the years, traditionally Silicon Valley is known as Santa Clara County, southern San Mateo County and southern Alameda county.  However, over the years this geographical area has been expanded to include San Francisco County, Contra Costa County, and the northern parts of Alameda County and San Mateo County, this shift has occurred due to the expansion in the local economy and the development of new technologies.      The ": null
    },
    {
        "United States Department of Labors": "united states department of labor"
    },
    {
        " Quarterly Census of Employment and Wages ": "quarterly census of employment and wages"
    },
    {
        " program defined Silicon Valley as the counties of Alameda, Contra Costa, San Francisco, San Mateo, Santa Clara, and Santa Cruz.      In 2015, MIT researchers developed a novel method for measuring which towns are home to startups with higher growth potential and this defines Silicon Valley to center on the municipalities of Menlo Park, Mountain View, Palo Alto, and Sunnyvale. Stern, Scott, Guzman, Jorge.  .                                    Silicon Valleys art gallery, ": null
    },
    {
        "Pace Art and Technology Gallery": "pace gallery"
    },
    {
        " in Menlo Park, opened on February 6, 2016.      In 1928, the ": null
    },
    {
        "Allied Arts Guild": "allied arts guild"
    },
    {
        " was formed in Menlo Park and is a complex of artist studios, shops, restaurant, and gardens.         ": null
    },
    {
        "Burlingame Museum of Pez Memorabilia": "burlingame museum of pez memorabilia"
    },
    {
        ",   ": null
    },
    {
        "Computer History Museum": "computer history museum"
    },
    {
        ",   ": null
    },
    {
        "Childrens Discovery Museum of San Jose": "childrens discovery museum of san jose"
    },
    {
        ",   ": null
    },
    {
        "CuriOdyssey": "curiodyssey"
    },
    {
        ",   ": null
    },
    {
        "De Saisset Museum": "de saisset museum"
    },
    {
        " at Santa Clara University,   ": null
    },
    {
        "Filoli": "filoli"
    },
    {
        " Estate,   ": null
    },
    {
        "Forbes Mill": "forbes mill"
    },
    {
        ",   ": null
    },
    {
        "Hiller Aviation Museum": "hiller aviation museum"
    },
    {
        ",   the ": null
    },
    {
        "HP Garage": "hp garage"
    },
    {
        ",    the ": null
    },
    {
        "Intel Museum": "intel museum"
    },
    {
        ",   ": null
    },
    {
        "Iris & B. Gerald Cantor Center for Visual Arts": "iris  &  b. gerald cantor center for visual arts"
    },
    {
        " at Stanford University,   ": null
    },
    {
        "Japanese American Museum of San Jose": "japanese american museum of san jose"
    },
    {
        ",   ": null
    },
    {
        "Los Altos History Museum": "los altos history museum"
    },
    {
        ",   ": null
    },
    {
        "Moffett Field": "moffett federal airfield"
    },
    {
        " Historical Society Museum,   ": null
    },
    {
        "Museum of American Heritage": "museum of american heritage"
    },
    {
        ",   ": null
    },
    {
        "Palo Alto Art Center": "palo alto art center"
    },
    {
        ",   ": null
    },
    {
        "Palo Alto Junior Museum and Zoo": "palo alto junior museum and zoo"
    },
    {
        ",   ": null
    },
    {
        "Portuguese Historical Museum": "portuguese historical museum"
    },
    {
        ",   ": null
    },
    {
        "Rosicrucian Egyptian Museum": "rosicrucian egyptian museum"
    },
    {
        ",   ": null
    },
    {
        "San Mateo County History Museum": "san mateo county history museum"
    },
    {
        ",   ": null
    },
    {
        "San Jose Museum of Art": "san jose museum of art"
    },
    {
        ",   ": null
    },
    {
        "San Jose Museum of Quilts & Textiles": "san jose museum of quilts  &  textiles"
    },
    {
        " Sunnyvale Heritage Park Museum": "sunnyvale heritage park museum"
    },
    {
        ",   ": null
    },
    {
        "The Tech Museum of Innovation": "the tech museum of innovation"
    },
    {
        ",   ": null
    },
    {
        "Viet Museum": "viet museum"
    },
    {
        ",   ": null
    },
    {
        "Winchester Mystery House": "winchester mystery house"
    },
    {
        ",       ": null
    },
    {
        "Opera San José": "opera san josé"
    },
    {
        " Ballet San Jose": "ballet san jose"
    },
    {
        " California Youth Symphony": "california youth symphony"
    },
    {
        " Symphony Silicon Valley": "symphony silicon valley"
    },
    {
        " San Jose Center for the Performing Arts": "san jose center for the performing arts"
    },
    {
        " Broadway San Jose": "nederlander organizationother us venues"
    },
    {
        " San Jose Repertory Theatre": "san jose repertory theatre"
    },
    {
        " San Jose Youth Symphony": "san jose youth symphony"
    },
    {
        " San Jose Improv": "san jose improv"
    },
    {
        " SjDANCEco": "sjdanceco"
    },
    {
        " Broadway by the Bay": "broadway by the bay"
    },
    {
        ", Redwood City   ": null
    },
    {
        "TheatreWorks Theatre Company": "theatreworks"
    },
    {
        ", Palo Alto and Mountain View       ": null
    },
    {
        "Apple Worldwide Developers Conference": "apple worldwide developers conference"
    },
    {
        " Facebook F8": "facebook f8"
    },
    {
        " BayCon": "baycon"
    },
    {
        ", Santa Clara   ": null
    },
    {
        "Christmas in the Park": "christmas in the park"
    },
    {
        ", downtown San Jose   ": null
    },
    {
        "Cinequest Film Festival": "cinequest film festival"
    },
    {
        ", multiple venues   ": null
    },
    {
        "FanimeCon": "fanimecon"
    },
    {
        ", downtown San Jose   ": null
    },
    {
        "LiveStrong Challenge": "livestrong challenge"
    },
    {
        " bike race, San Jose   Los Altos Art and Wine Festival, Los Altos    Mountain View Art and Wine Festival, Mountain View    Palo Alto Festival of the Arts, Palo Alto    ": null
    },
    {
        "San Francisco International Asian American Film Festival": "san francisco international asian american film festival"
    },
    {
        ", downtown San Jose   ": null
    },
    {
        "San Jose Jazz Festival": "san jose jazz festival"
    },
    {
        ", downtown San Jose   ": null
    },
    {
        "Silicon Valley Comic Con": "silicon valley comic con"
    },
    {
        ", downtown San Jose   ": null
    },
    {
        "Stanford Jazz Festival": "stanford jazz workshop"
    },
    {
        ", Stanford University       In 1980, Intelligent Machines Journal -a hobbyist journal- changed its name to  InfoWorld , and, with offices in ": null
    },
    {
        "Palo Alto": "palo alto, california"
    },
    {
        ", began covering the emergence of the microcomputer industry in the valley.      Local and national media cover Silicon Valley and its companies. CNN,  The Wall Street Journal , and Bloomberg News operate Silicon Valley bureaus out of ": null
    },
    {
        "Palo Alto": "palo alto"
    },
    {
        ". Public broadcaster ": null
    },
    {
        "KQED ": "kqed"
    },
    {
        " and ": null
    },
    {
        "KQED-FM": "kqed-fm"
    },
    {
        ", as well as the Bay Areas local ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        " station ": null
    },
    {
        "KGO-TV": "kgo-tv"
    },
    {
        ", operate bureaus in San Jose. ": null
    },
    {
        "KNTV": "kntv"
    },
    {
        ", ": null
    },
    {
        "NBCs": "nbc"
    },
    {
        "local Bay Area affiliate NBC Bay Area , is located in San Jose. Produced from this location is the nationally distributed TV Show Tech Now as well as the CNBC Silicon Valley bureau. San Jose-based media serving Silicon Valley include the  San Jose Mercury News  daily and the  Metro Silicon Valley  weekly.     Specialty media include  El Observador  and the San Jose / Silicon Valley Business Journal. Most of the Bay Areas other major TV stations, newspapers, and media operate in ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        " or ": null
    },
    {
        "Oakland": "oakland, california"
    },
    {
        ". ": null
    },
    {
        "Patch.com": "patch.com"
    },
    {
        " operates various web portals, providing local news, discussion and events for residents of Silicon Valley. Mountain View has a public nonprofit station, KMVT-15. KMVT-15s shows include Silicon Valley Education News -Edward Tico Producer.       Some appearances in media, in order by release date:    A View to a Kill —1985 film from the ": null
    },
    {
        "James Bond series": "production of the james bond films"
    },
    {
        ". ": null
    },
    {
        "Bond": "james bond"
    },
    {
        " thwarts an elaborate ploy by the films antagonist, Max Zorin, to destroy Silicon Valley.     Triumph of the Nerds: The Rise of Accidental Empires   – 1996 documentary    PlayStation Underground: Volume 2, Issue 2   Pirates of Silicon Valley —1999 movie    The Social Network —2010 movie    Startups Silicon Valley —reality TV series, debuted 2012 on ": null
    },
    {
        "Bravo": "bravo"
    },
    {
        "     Betas —TV series, debuted 2013 on ": null
    },
    {
        "Amazon Video": "amazon video"
    },
    {
        "     Jobs —2013 movie    The Internship —2013 film about working at ": null
    },
    {
        "Google": "google"
    },
    {
        "  Silicon Valley —2014 American ": null
    },
    {
        "sitcom": "sitcom"
    },
    {
        " from ": null
    },
    {
        "HBO": "hbo"
    },
    {
        "  Watch Dogs 2 —2016 video game developed by ": null
    },
    {
        "Ubisoft": "ubisoft"
    }
]