[
    {
        "Simba Wanyika was a ": null
    },
    {
        "Kenya": "kenya"
    },
    {
        "n based band created in 42 by ": null
    },
    {
        "Tanzanian": "tanzanian"
    },
    {
        " brothers ": null
    },
    {
        "Wilson Kinyonga": "wilson kinyonga"
    },
    {
        " and ": null
    },
    {
        "George Kinyonga": "george kinyonga"
    },
    {
        ", and disbanded in 42 Simba Wanyika and its two offshoots, ": null
    },
    {
        "Les Wanyika": "les wanyika"
    },
    {
        " and ": null
    },
    {
        "Super Wanyika Stars": "super wanyika stars"
    },
    {
        ", became some of the most popular bands in Kenya. Their guitar-driven sound, inspired by the ": null
    },
    {
        "Soukous": "soukous"
    },
    {
        " guitarist ": null
    },
    {
        "Dr. Nico": "dr. nico"
    },
    {
        ", combined highly melodic ": null
    },
    {
        "rumba": "african rumba"
    },
    {
        " with lyrics sung in ": null
    },
    {
        "Swahili": "swahili language"
    },
    {
        ". Simba wa nyika means Lions of the Savannah in Swahili.     Wilson Kinyonga and George Kinyonga began as musicians in their hometown ": null
    },
    {
        "Tanga": "tanga, tanzania"
    },
    {
        " in Tanzania when they joined ": null
    },
    {
        "Jamhuri Jazz Band": "jamhuri jazz band"
    },
    {
        " in 42 They moved to ": null
    },
    {
        "Arusha": "arusha"
    },
    {
        " in 42 and formed ": null
    },
    {
        "Arusha Jazz": "arusha jazz"
    },
    {
        " with their other brother, William Kinyonga. During this period, musicians could travel freely between Kenya and Tanzania, and Kenyan popular music became heavily influenced by Tanzanian rumba musicians. In 42 the Kinyonga brothers moved to Kenya and created Simba Wanyika. The band played at nightclubs and bars in the Nairobi area, and developed an enthusiastic following, and by the mid 42s, they were well known throughout Kenya, thanks to hits like Mwongele and Wana Wanyika . They had a harder sound than most rumba bands and were almost unchallenged in that area in Kenya due to the closing of the Tanzanian border in 42     The restrictions enforced on the Kenya-Tanzania border consequently led to the divergence of Kenyan popular music towards the emerging ": null
    },
    {
        "benga music": "benga music"
    },
    {
        ". Simba Wanyika continued playing rumba, and was still quite popular when the band split in the late 42s when rhythm guitarist Omar Shabani took many of the bands musicians and forming ": null
    },
    {
        "Les Wanyika": "les wanyika"
    },
    {
        ". In 42 George Kinyonga also quit Simba Wanyika, taking more musicians with him to form ": null
    },
    {
        "Orchestra Jobiso": "orchestra jobiso"
    },
    {
        ". He eventually rejoined Simba Wanyika while still working with Jobiso on side projects. Simba Wanyika later changed their name to Simba Wanyika Original to prevent confusion with Les Wanyika and its splinter group, ": null
    },
    {
        "Super Wanyika Stars": "super wanyika stars"
    },
    {
        ".     Simba Wanyika regained its popularity in the mid 42s, releasing many hits and touring Europe in 42 They disbanded in 42 but several offshoots of the band still continue to play.       ;Contributing artist    The Rough Guide to the Music of Kenya and Tanzania       ;Compilations    Kenya Special : Volume Two Selected East African recordings from the 42s & 42s  ": null
    }
]