[
    {
        "       Simon & Garfunkel were an American ": null
    },
    {
        "folk-rock": "Folk Rock"
    },
    {
        " duo consisting of singer-songwriter ": null
    },
    {
        "Paul Simon": "Paul Simon"
    },
    {
        " and singer ": null
    },
    {
        "Art Garfunkel": "Art Garfunkel"
    },
    {
        ". One of the best-selling music groups of the 1960s, their biggest hits—including ": null
    },
    {
        "The Sound of Silence": "The Sound Of Silence"
    },
    {
        " , ": null
    },
    {
        "Mrs. Robinson": "Mrs. Robinson"
    },
    {
        " , ": null
    },
    {
        "The Boxer": "The Boxer"
    },
    {
        " , and ": null
    },
    {
        "Bridge over Troubled Water": "Bridge Over Troubled Water"
    },
    {
        " —reached number one on singles charts worldwide.     Simon and Garfunkel met in elementary school in ": null
    },
    {
        "Queens": "Queens"
    },
    {
        ", ": null
    },
    {
        "New York": "New York City"
    },
    {
        " in 1953, where they learned to harmonize together and began writing material. By 1957, under the name Tom & Jerry, the teenagers had their first minor success with Hey Schoolgirl , a song imitating their idols the ": null
    },
    {
        "Everly Brothers": "The Everly Brothers"
    },
    {
        ". In 1963, aware of a growing public interest in folk music, they regrouped and were signed to ": null
    },
    {
        "Columbia Records": "Columbia Records"
    },
    {
        " as Simon & Garfunkel. Their debut,  Wednesday Morning, 3 A.M. , sold poorly, and they once again disbanded; Simon returned to a solo career, this time in England. In June 1965, a new version of The Sound of Silence ": null
    },
    {
        "overdubbed": "Overdubbing"
    },
    {
        " with electric guitar and drums became a major ": null
    },
    {
        "U.S. AM radio": "Am Broadcasting"
    },
    {
        " hit, reaching number one on the ": null
    },
    {
        "Billboard Hot 100": "Billboard Hot 100"
    },
    {
        ". The duo reunited to release a second studio album,  Sounds of Silence , and tour colleges nationwide. On their third release,  Parsley, Sage, Rosemary and Thyme  , the duo assumed more creative control. Their music was featured in the 1967 film  The Graduate , giving them further exposure. Their next album  Bookends  topped the ": null
    },
    {
        "Billboard 200": "Billboard 200"
    },
    {
        " chart  and included the number-one single Mrs. Robinson from the film.     The duos often rocky relationship led to artistic disagreements and their breakup in 1970. Their final studio album,  Bridge over Troubled Water , was released that year and became their most successful, becoming ": null
    },
    {
        "one of the worlds best-selling albums": "List Of Best-Selling Albums"
    },
    {
        ". After their breakup, Simon released a number of acclaimed albums, including 1986s ": null
    },
    {
        "Graceland": "Graceland"
    },
    {
        ".  Garfunkel released solo hits such as ": null
    },
    {
        "All I Know": "All I Know"
    },
    {
        " and briefly pursued an acting career, with leading roles in two ": null
    },
    {
        "Mike Nichols": "Mike Nichols"
    },
    {
        " films,  Catch-22  and  Carnal Knowledge , and in ": null
    },
    {
        "Nicolas Roegs": "Nicolas Roeg"
    },
    {
        "1980  Bad Timing . The duo have reunited several times, most famously in 1981 for ": null
    },
    {
        "The Concert in Central Park": "The Concert In Central Park"
    },
    {
        " , which attracted more than 500,000 people, one of the ": null
    },
    {
        "largest concert attendances in history": "List Of Highest-Attended Concerts"
    },
    {
        ".      Simon & Garfunkel won 10 ": null
    },
    {
        "Grammy Awards": "Grammy Award"
    },
    {
        "and were inducted into the ": null
    },
    {
        "Rock and Roll Hall of Fame": "Rock And Roll Hall Of Fame"
    },
    {
        " in 1990.  Bridge over Troubled Water is ranked at number 51 on ": null
    },
    {
        "Rolling Stones 500 Greatest Albums of All Time": "Rolling Stones 500 Greatest Albums Of All Time"
    },
    {
        ".  ": null
    },
    {
        "Richie Unterberger": "Richie Unterberger"
    },
    {
        " described them as the most successful folk-rock duo of the 1960s and one of the most popular artists from the decade. They are among the ": null
    },
    {
        "best-selling music artists": "List Of Best-Selling Music Artists"
    },
    {
        ", having sold more than 100 million records.            ": null
    },
    {
        "Paul Simon": "Paul Simon"
    },
    {
        " and ": null
    },
    {
        "Art Garfunkel": "Art Garfunkel"
    },
    {
        " grew up in the 1940s and 1950s in their predominantly ": null
    },
    {
        "Jewish": "Jewish"
    },
    {
        " neighborhood of ": null
    },
    {
        "Forest Hills": "Forest Hills, Queens"
    },
    {
        " in ": null
    },
    {
        "Queens, New York": "Queens"
    },
    {
        ", three blocks away from one another. They attended the same schools: Public School 164 in Flushing, Parsons Junior High School, and ": null
    },
    {
        "Forest Hills High School": "Forest Hills High School"
    },
    {
        ".   They were both fascinated by music; both listened to the radio and were taken with ": null
    },
    {
        "rock and roll": "Rock And Roll"
    },
    {
        " as it emerged, particularly the ": null
    },
    {
        "Everly Brothers": "The Everly Brothers"
    },
    {
        ".  Simon first noticed Garfunkel when Garfunkel was singing in a fourth grade talent show, which Simon thought was a good way to attract girls; he hoped for a friendship, which started in 1953, when they appeared in a sixth grade adaptation of  Alice in Wonderland .  They formed a streetcorner ": null
    },
    {
        "doo-wop": "Doo-Wop"
    },
    {
        " group called the Peptones with three friends and learned to ": null
    },
    {
        "harmonize": "Vocal Harmony"
    },
    {
        ".  Serpick, Evan . The Rolling Stone Encyclopedia of Rock & Roll. New York: ": null
    },
    {
        "Simon & Schuster": "Simon  &  Schuster"
    },
    {
        ", 1136 pp. First edition, 2001. They began performing as a duo at school dances.     Simon and Garfunkel moved to Forest Hills High School,  where in 1956 they wrote their first song, The Girl for Me ; Simons father sent a handwritten copy to the ": null
    },
    {
        "Library of Congress": "Library Of Congress"
    },
    {
        " to register a copyright.  While trying to remember the lyrics to the Everly Brothers song Hey Doll Baby , they wrote Hey Schoolgirl , which they recorded for $25 at Sanders Recording Studio in Manhattan.  While recording they were overheard by promoter ": null
    },
    {
        "Sid Prosen": "Sid Prosen"
    },
    {
        ", who signed them to his independent label Big Records after speaking to their parents. They were 15.         Under Big Records, Simon and Garfunkel assumed the name Tom & Jerry; Garfunkel named himself Tom Graph, a reference to his interest in mathematics, and Simon Jerry Landis, after the surname of a girl he had dated. Their first single, Hey Schoolgirl , was released with the B-side Dancin Wild in 1957.  Prosen, using the ": null
    },
    {
        "payola": "Payola"
    },
    {
        " system, bribed DJ ": null
    },
    {
        "Alan Freed": "Alan Freed"
    },
    {
        " $200 to play the single on his radio show, where it became a nightly staple.  Hey Schoolgirl attracted regular rotation on nationwide ": null
    },
    {
        "AM": "Am Broadcasting"
    },
    {
        " pop stations, leading it to sell over 100,000 copies and to land on  Billboard  charts at number 49. Prosen promoted the group heavily, getting them a headlining spot on ": null
    },
    {
        "Dick Clarks": "Dick Clark"
    },
    {
        "  American Bandstand  alongside ": null
    },
    {
        "Jerry Lee Lewis": "Jerry Lee Lewis"
    },
    {
        ".  Simon and Garfunkel shared approximately $4,000 from the song – earning two percent each from royalties, the rest staying with Prosen.  They released three more singles on Big Records: Our Song , Thats My Story , and Dont Say Goodbye , none of them successful.       After graduating from Forest Hills High School in 1958,  the pair continued their education should a music career not unfold. Simon studied English at ": null
    },
    {
        "Queens College, City University of New York": "Queens College, City University Of New York"
    },
    {
        ", and Garfunkel studied architecture before switching to art history at ": null
    },
    {
        "Columbia College, Columbia University": "Columbia College, Columbia University"
    },
    {
        ".   While still with Big Records as a duo, Simon released a solo single, True or False , under the name True Taylor . This upset Garfunkel, who regarded it as a betrayal; the emotional tension from the incident occasionally surfaced throughout their relationship.  Their last recording with Big Records was a cover of a ": null
    },
    {
        "Jan and Dean": "Jan And Dean"
    },
    {
        " single, Baby Talk , but the company went bankrupt soon after release; the track was reissued on ": null
    },
    {
        "Bell Records": "Bell Records"
    },
    {
        ", but failed to sell, so Tom & Jerry was dissolved.     Simon and Garfunkel continued recording as solo artists: Garfunkel composed and recorded Private World for Octavia Records, and—under the name Artie Garr— Beat Love for Warwick; Simon recorded with ": null
    },
    {
        "the Mystics": "The Mystics"
    },
    {
        " and Tico & The Triumphs, and wrote and recorded under the names Jerry Landis and Paul Kane.  Simon also wrote and performed demos for other artists, working for a while with ": null
    },
    {
        "Carole King": "Carole King"
    },
    {
        " and ": null
    },
    {
        "Gerry Goffin": "Gerry Goffin"
    },
    {
        ".      After graduating in 1963, Simon joined Garfunkel, who was still at Columbia, to perform again as a duo, this time with a shared interest in ": null
    },
    {
        "folk music": "Folk Music"
    },
    {
        ".  Simon enrolled part-time in ": null
    },
    {
        "Brooklyn Law School": "Brooklyn Law School"
    },
    {
        ".  By late 1963, billing themselves as Kane & Garr, they performed at ": null
    },
    {
        "Gerdes Folk City": "Gerdes Folk City"
    },
    {
        ", a Greenwich club that hosted Monday night ": null
    },
    {
        "open mic": "Open Mic"
    },
    {
        " performances.  They performed three new songs — Sparrow , He Was My Brother , and ": null
    },
    {
        "The Sound of Silence": "The Sound Of Silence"
    },
    {
        " — and attracted the attention of Columbia producer ": null
    },
    {
        "Tom Wilson": "Tom Wilson"
    },
    {
        ", an African-American jazz musician who would also become the key architect of ": null
    },
    {
        "Bob Dylans": "Bob Dylan"
    },
    {
        "transition from folk to rock.   As a star producer for the label, he wanted to record He Was My Brother with a new British act, the Pilgrims.  Simon convinced Wilson to let him and Garfunkel audition in the studio, where they performed The Sound of Silence . At Wilsons urging, Columbia signed them.     Simon & Garfunkels debut studio album,  Wednesday Morning, 3 A.M. , was recorded over three sessions in March 1964 and released in October.  It contains five compositions by Simon, three traditional folk songs, and four folk-influenced singer-songwriter songs. Simon was adamant that they would no longer use stage names.  Columbia set up a promotional showcase at Folk City on March 31, 1964, the duos first public concert as Simon & Garfunkel. The showcase, as well as other scheduled performances, did not go well.       Wednesday Morning, 3 A.M. sold only 3,000 copies on release. Its poor sales caused Simon to move to England, where he had previously visited and played some gigs.   He toured small folk clubs, befriending British folk artists such as ": null
    },
    {
        "Bert Jansch": "Bert Jansch"
    },
    {
        ", ": null
    },
    {
        "Martin Carthy": "Martin Carthy"
    },
    {
        ", ": null
    },
    {
        "Al Stewart": "Al Stewart"
    },
    {
        ", and ": null
    },
    {
        "Sandy Denny": "Sandy Denny"
    },
    {
        ".    He met Kathy Chitty, who became the object of his affection and is the Kathy in Kathys Song and ": null
    },
    {
        "America": "America"
    },
    {
        " .      A small music publishing company, Lorna Music, licensed Carlos Dominguez , a single Simon had recorded two years prior as Paul Kane, for a cover by ": null
    },
    {
        "Val Doonican": "Val Doonican"
    },
    {
        " that sold well.  Simon visited Lorna to thank them, and the meeting resulted in a publishing and recording contract. He signed to the ": null
    },
    {
        "Oriole": "Oriole Records"
    },
    {
        " label and released He Was My Brother as a single. Simon invited Garfunkel to stay for the summer of 1964.     Near the end of the season, Garfunkel returned to Columbia for class, and Simon surprised his friends by saying that he would return to the States as well.  He resumed his studies at Brooklyn Law School for one semester, partially at his parents insistence. He returned to England in January 1965, now certain that music was his calling.  In the meantime, his landlady, Judith Piepe, had compiled a tape from his work at Lorna and sent it to the ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " in hopes they would play it. The demos aired on the Five to Ten morning show, and were instantly successful. Oriole had folded into ": null
    },
    {
        "CBS": "Sony Music Entertainment"
    },
    {
        " by that point, and hoped to record a new Simon album.  Simon recorded his first solo album,  The Paul Simon Songbook , in June 1965 and featured future Simon & Garfunkel staples including ": null
    },
    {
        "I Am a Rock": "I Am A Rock"
    },
    {
        " and ": null
    },
    {
        "April Come She Will": "April Come She Will"
    },
    {
        " . CBS flew Wilson over to produce the record, and he stayed at Simons flat. The album was released in August; although sales were poor, Simon felt content with his future in England.  Garfunkel graduated in 1965, returning to Columbia University to do a ": null
    },
    {
        "masters degree": "Masters Degree"
    },
    {
        " in mathematics.             Meanwhile, in the United States, a late-night DJ at ": null
    },
    {
        "WBZ-FM": "Wbz-Fm"
    },
    {
        " in ": null
    },
    {
        "Boston": "Boston"
    },
    {
        " played The Sound of Silence , where it was popular with a college audience.  It was picked up the next day along the ": null
    },
    {
        "East Coast of the United States": "East Coast Of The United States"
    },
    {
        ", down to ": null
    },
    {
        "Cocoa Beach, Florida": "Cocoa Beach, Florida"
    },
    {
        ". When Wilson heard about this new wave of interest, he took inspiration from the success of the folk-rock hybrid that he and Dylan had created with ": null
    },
    {
        "Like a Rolling Stone": "Like A Rolling Stone"
    },
    {
        " , and crafted a rock remix of the song using studio musicians.  The remix was issued in September 1965, where it reached the ": null
    },
    {
        "Billboard Hot 100": "Billboard Hot 100"
    },
    {
        ".  Wilson did not inform the duo of his plan, and Simon was horrified when he first heard it.     By January 1966, The Sound of Silence had topped the Hot 100, selling over one million copies.  Simon reunited with Garfunkel in New York, leaving Chitty and his friends in England behind. CBS demanded a new album, to be called  Sounds of Silence , to ride the wave of the hit.  Recorded in three weeks, and consisting of rerecorded songs from The Paul Simon Songbook plus four new tracks, Sounds of Silence was rush-released in mid-January 1966, peaking at number 21 ": null
    },
    {
        "Billboard Top LPs": "Billboard 200"
    },
    {
        " chart.  A week later, ": null
    },
    {
        "Homeward Bound": "Homeward Bound"
    },
    {
        " was released as a single, entering the USA top ten, followed by I Am a Rock peaking at number three. The duo supported the recordings with a nationwide tour of America, while CBS continued their promotion by re-releasing Wednesday Morning, 3 A.M., which charted at number 30.  Despite the success, the duo received critical derision, as many considered them a manufactured imitation of folk music.     As they considered The Sounds of Silence a rush job to capitalize on their sudden success, Simon & Garfunkel spent more time crafting the follow-up. It was the first time Simon insisted on total control in aspects of recording. Dimery, Robert .  1001 Albums You Must Hear Before You Die . ": null
    },
    {
        "Milan": "Milan"
    },
    {
        ": ": null
    },
    {
        "Universe Publishing": "Universe Publishing"
    },
    {
        ", p. 94. First edition, 2005. Work began in 1966 and took nine months.  Garfunkel considered the recording of ": null
    },
    {
        "Scarborough Fair": "Scarborough Fair"
    },
    {
        " to be the point at which they stepped into the role of producer, as they were constantly beside ": null
    },
    {
        "engineer": "Recording Engineer"
    },
    {
        " Roy Halee": "Roy Halee"
    },
    {
        " mixing.  Parsley, Sage, Rosemary and Thyme  was issued in October 1966, following the release of several singles and sold-out college campus shows.  The duo resumed their college circuit tour eleven days later, crafting an image that was described as alienated , weird , and poetic .  Manager Mort Lewis also was responsible for this public perception, as he withheld them from television appearances unless they were allowed to play an uninterrupted set or choose the setlist. Simon, then 26, felt he had made it into an upper echelon of rock and roll while retaining artistic integrity; according to his biographer Marc Eliot, this made him spiritually closer to ": null
    },
    {
        "Bob Dylan": "Bob Dylan"
    },
    {
        " than to, say, ": null
    },
    {
        "Bobby Darin": "Bobby Darin"
    },
    {
        " .  The duo chose ": null
    },
    {
        "William Morris": "William Morris Agency"
    },
    {
        " as their ": null
    },
    {
        "booking agency": "Talent Agent"
    },
    {
        " after a recommendation from ": null
    },
    {
        "Wally Amos": "Wally Amos"
    },
    {
        ", a mutual friend of Wilson.     During the sessions for Parsley, Simon and Garfunkel recorded ": null
    },
    {
        "A Hazy Shade of Winter": "A Hazy Shade Of Winter"
    },
    {
        " ; it was released as a single, peaking at number 13 on the national charts. Similarly, they recorded ": null
    },
    {
        "At the Zoo": "At The Zoo"
    },
    {
        " for single release in early 1967; it charted at number 16.  Simon began work for their next album around this time, telling  High Fidelity  that Im not interested in singles anymore .  He developed ": null
    },
    {
        "writers block": "Writers Block"
    },
    {
        ", which led to no new album on the horizon for 1967.  Artists at the time were expected to release two or three albums each year, and the lack of productivity worried Columbia executives. Amid concerns for Simons idleness, Columbia Records chairman ": null
    },
    {
        "Clive Davis": "Clive Davis"
    },
    {
        " arranged for up-and-coming producer ": null
    },
    {
        "John Simon": "John Simon"
    },
    {
        " to kick-start the recording.  Simon was distrustful of label executives; on one occasion, he and Garfunkel recorded a meeting with Davis, who was giving a fatherly talk on speeding up production, to laugh at it later.  The rare television appearances at this time saw the duo performing on network broadcasts as  The Ed Sullivan Show ,  The Mike Douglas Show , and  The Andy Williams Show  in 1966, and twice on  The Smothers Brothers Comedy Hour  in 1967.     Meanwhile, director ": null
    },
    {
        "Mike Nichols": "Mike Nichols"
    },
    {
        ", then filming  The Graduate , had become fascinated with Simon & Garfunkels records, listening to them extensively before and after filming.  He met Davis to ask for permission to license Simon & Garfunkel music for his film. Davis viewed it as a perfect fit and envisioned a bestselling soundtrack album. Simon was not as receptive and was cautious of ": null
    },
    {
        "selling out": "Selling Out"
    },
    {
        " . However, after meeting Nichols and being impressed by his wit and the script, he agreed to write new songs for the film. ": null
    },
    {
        "Leonard Hirshan": "Leonard Hirshan"
    },
    {
        ", a powerful agent at William Morris, negotiated a deal that paid Simon $25,000 to submit three songs to Nichols and producer ": null
    },
    {
        "Lawrence Turman": "Lawrence Turman"
    },
    {
        ".  When Nichols was not impressed by Simons songs ": null
    },
    {
        "Punkys Dilemma": "Punkys Dilemma"
    },
    {
        " and ": null
    },
    {
        "Overs": "Overs"
    },
    {
        " , Simon and Garfunkel offered another, incomplete song, which became ": null
    },
    {
        "Mrs. Robinson": "Mrs. Robinson"
    },
    {
        " ; Nichols loved it.       Simon & Garfunkels fourth studio album,  Bookends , was recorded in fits and starts from late 1966 to early 1968. Although the album had long been planned, work did not begin in earnest until late 1967.  The duo were signed under an older contract that specified the label pay for sessions, and Simon & Garfunkel took advantage of this, hiring ": null
    },
    {
        "viola": "Viola"
    },
    {
        " and ": null
    },
    {
        "brass": "Brass Instrument"
    },
    {
        " players and ": null
    },
    {
        "percussionists": "Percussionists"
    },
    {
        ".  The records brevity reflects its concise and perfectionist production; the team spent over 50 hours recording Punkys Dilemma , for example, and rerecorded vocal parts, sometimes note by note, until they were satisfied.  Garfunkels songs and voice took a lead role on some of the songs, and the harmonies for which the duo was known gradually disappeared. For Simon, Bookends represented the end of the collaboration and became an early indicator of his intentions to go solo.      Prior to release, the band helped put together and performed at the ": null
    },
    {
        "Monterey Pop Festival": "Monterey Pop Festival"
    },
    {
        ", which signaled the beginning of the ": null
    },
    {
        "Summer of Love": "Summer Of Love"
    },
    {
        " on the ": null
    },
    {
        "West Coast": "West Coast Of The United States"
    },
    {
        ".  ": null
    },
    {
        "Fakin It": "Fakin It"
    },
    {
        " was issued as a single that summer and found only modest success on AM radio; the duo were much more focused on the rising ": null
    },
    {
        "FM": "Fm Radio"
    },
    {
        " format, which played album tracks and treated their music with respect.  In January 1968, the duo appeared on a ": null
    },
    {
        "Kraft Music Hall": "Kraft Music Hall"
    },
    {
        " special, Three for Tonight, performing ten songs, largely taken from their previous album.  Bookends was released by Columbia Records in April 1968, 24 hours before the ": null
    },
    {
        "assassination": "Assassination Of Martin Luther King Jr."
    },
    {
        " of ": null
    },
    {
        "civil rights movement": "Civil Rights Movement"
    },
    {
        " activist ": null
    },
    {
        "Martin Luther King Jr.": "Martin Luther King Jr."
    },
    {
        ", which spurred nationwide outrage and riots.  The album debuted on the Billboard Top LPs in the issue dated April 27, 1968, ": null
    },
    {
        "climbing to number one": "List Of Billboard 200 Number-One Albums Of 1968"
    },
    {
        " and staying at that position for seven non-consecutive weeks; it remained on the chart as a whole for 66 weeks. Bookends received such heavy orders weeks in advance of its release that Columbia was able to apply for award certification before copies left the warehouse, a fact it touted in magazine ads. The album became the duos bestselling to date, helped by the attention for the Graduate soundtrack ten weeks earlier, creating an initial combined sales figure of over five million units.      Davis had predicted this, and suggested raising the list price of Bookends by one dollar to $5.79, above the then standard retail price, to compensate for a large poster included in vinyl copies.  Simon scoffed and viewed it as charging a premium on what was sure to be that years best-selling Columbia album . According to biographer Marc Eliot, Davis was offended by what he perceived as their lack of gratitude for what he believed was his role in turning them into superstars . Rather than implement Davis plan, Simon & Garfunkel signed a contract extension with Columbia that guaranteed them a higher ": null
    },
    {
        "royalty": "Royalties"
    },
    {
        " rate. At the ": null
    },
    {
        "1969 Grammy Awards": "1969 Grammy Awards"
    },
    {
        ", the lead single ": null
    },
    {
        "Mrs. Robinson": "Mrs. Robinson"
    },
    {
        " became the first rock and roll song to receive ": null
    },
    {
        "Record of the Year": "Grammy Award For Record Of The Year"
    },
    {
        ", and also won ": null
    },
    {
        "Best Contemporary Pop Performance by a Duo or Group": "Grammy Award For Best Pop Performance By A Duo Or Group With Vocals"
    },
    {
        ".        Bookends, alongside the Graduate soundtrack, made Simon & Garfunkel the biggest rock duo in the world. Simon was approached by producers to write music for films or license songs; he turned down ": null
    },
    {
        "Franco Zeffirelli": "Franco Zeffirelli"
    },
    {
        ", who was preparing to film  Brother Sun, Sister Moon , and ": null
    },
    {
        "John Schlesinger": "John Schlesinger"
    },
    {
        ", who was preparing to film  Midnight Cowboy . In addition to ": null
    },
    {
        "Hollywood": "Cinema In The United States"
    },
    {
        " proposals, Simon declined a request by producers from the ": null
    },
    {
        "Broadway": "Broadway Theatre"
    },
    {
        " show  Jimmy Shine  .  He collaborated briefly with ": null
    },
    {
        "Leonard Bernstein": "Leonard Bernstein"
    },
    {
        " on a sacred mass before withdrawing from the project due to finding it perhaps too far afield from his comfort zone .     Garfunkel began acting, and played Captain ": null
    },
    {
        "Nately": "Nately"
    },
    {
        " in the Nichols film  Catch-22  based on the ": null
    },
    {
        "novel of the same name": "Catch-22"
    },
    {
        ". Simon was to play the character of Dunbar, but screenwriter ": null
    },
    {
        "Buck Henry": "Buck Henry"
    },
    {
        " felt the film was already crowded with characters and wrote Simons part out.   Filming began in January 1969 and lasted about eight months, longer than expected.   The production endangered the duos relationship; Simon had completed no new songs, and the duo planned to collaborate after filming ended. Following the end of filming in October, the first performance of what was planned to be their last tour took place in ": null
    },
    {
        "Ames, Iowa": "Ames, Iowa"
    },
    {
        ".  The US leg of the tour ended in the sold-out ": null
    },
    {
        "Carnegie Hall": "Carnegie Hall"
    },
    {
        " on November 27.   Meanwhile, the duo, working with director ": null
    },
    {
        "Charles Grodin": "Charles Grodin"
    },
    {
        ", produced an hourlong ": null
    },
    {
        "CBS": "Cbs"
    },
    {
        " special, Songs of America, a mixture of scenes featuring notable political events and leaders concerning the US, such as the ": null
    },
    {
        "Vietnam War": "Vietnam War"
    },
    {
        ", ": null
    },
    {
        "Martin Luther King": "Martin Luther King, Jr."
    },
    {
        ", ": null
    },
    {
        "John F. Kennedys": "John F. Kennedy"
    },
    {
        "funeral procession, ": null
    },
    {
        "Cesar Chavez": "Cesar Chavez"
    },
    {
        " and the ": null
    },
    {
        "Poor Peoples March": "Poor Peoples March"
    },
    {
        ". It was broadcast only once, due to tension at the network regarding its content.        Bridge over Troubled Water , Simon & Garfunkels final studio album, was released in January 1970 and charted in over 11 countries, topping the charts in 10, including the Billboard Top LPs chart in the US and the ": null
    },
    {
        "UK Albums Chart": "Uk Albums Chart"
    },
    {
        ".   It was the best-selling album in 1970, 1971 and 1972 and was at that time ": null
    },
    {
        "the best-selling album of all time": "List Of Best-Selling Albums"
    },
    {
        ".  It was also ": null
    },
    {
        "CBS Records": "Cbs Records International"
    },
    {
        " best-selling album before the release of ": null
    },
    {
        "Michael Jacksons": "Michael Jackson"
    },
    {
        "  Thriller  in 1982. R. Serge Denisoff: Inside Mtv, Transaction Publishers, 1988, p.117 The album topped the Billboard charts for 10 weeks and stayed in the charts for 85 weeks. In the United Kingdom, the album topped the charts for 35 weeks, and spent 285 weeks in the top 100, from 1970 to 1975. It has since sold over 25 million copies worldwide.   ": null
    },
    {
        "Bridge over Troubled Water": "Bridge Over Troubled Water"
    },
    {
        " , the lead single, reached number one in five countries and became the duos biggest seller. The song has been covered by over 50 artists, including ": null
    },
    {
        "Elvis Presley": "Elvis Presley"
    },
    {
        ", ": null
    },
    {
        "Johnny Cash": "Johnny Cash"
    },
    {
        ", ": null
    },
    {
        "Aretha Franklin": "Aretha Franklin"
    },
    {
        ", ": null
    },
    {
        "Willie Nelson": "Willie Nelson"
    },
    {
        ", ": null
    },
    {
        "Roy Orbison": "Roy Orbison"
    },
    {
        ", and ": null
    },
    {
        "Josh Groban": "Josh Groban"
    },
    {
        ".  ": null
    },
    {
        "Cecilia": "Cecilia"
    },
    {
        " , the follow-up, reached number four in the US, and ": null
    },
    {
        "El Condor Pasa": "El Cóndor Pasa"
    },
    {
        " hit number 18. A brief British tour followed the album release, and the duos last concert as Simon & Garfunkel took place at ": null
    },
    {
        "Forest Hills Stadium": "West Side Tennis Club"
    },
    {
        ".  In 1971, the album won six awards at the ": null
    },
    {
        "13th Annual Grammy Awards": "13Th Annual Grammy Awards"
    },
    {
        ", including ": null
    },
    {
        "Album of the Year": "Grammy Award For Album Of The Year"
    },
    {
        ".       The recording of Bridge over Troubled Water was difficult and Simon and Garfunkels relationship had deteriorated. At that point, I just wanted out, Simon later said.  Garfunkel hoped for a two-year break and did not intend to pursue a film career; likewise, Simon did not intend to begin a solo career.   At the urging of Simons wife, Peggy Harper, he called Davis to confirm the duos breakup.  For the next several years, the duo would only speak two or three times a year.     In the 1970s, the duo reunited several times. Their first reunion was a benefit concert for presidential candidate ": null
    },
    {
        "George McGovern": "George Mcgovern"
    },
    {
        " at New Yorks ": null
    },
    {
        "Madison Square Garden": "Madison Square Garden"
    },
    {
        " in June 1972. In 1975, they reconciled when they visited a recording session with ": null
    },
    {
        "John Lennon": "John Lennon"
    },
    {
        " and ": null
    },
    {
        "Harry Nilsson": "Harry Nilsson"
    },
    {
        ".  For the rest of the year, they attempted to make the reunion work, but their collaboration only yielded one song, ": null
    },
    {
        "My Little Town": "My Little Town"
    },
    {
        " , that was featured on Simons  Still Crazy After All These Years  and Garfunkels  Breakaway . It peaked at number nine on the Hot 100. In 1975, Garfunkel joined Simon for a medley of three songs on  Saturday Night Live , guest-hosted by Simon.  In 1977, Garfunkel joined Simon for a brief performance of their old songs on The Paul Simon Special, and later that year they recorded a cover of ": null
    },
    {
        "Sam Cookes": "Sam Cooke"
    },
    {
        "  Wonderful World": "Wonderful World"
    },
    {
        " with ": null
    },
    {
        "James Taylor": "James Taylor"
    },
    {
        ". Old tensions appeared to dissipate upon Garfunkels return to New York in 1978, when the duo began interacting more often. On May 1, 1978, Simon joined Garfunkel for a concert held at ": null
    },
    {
        "Carnegie Hall": "Carnegie Hall"
    },
    {
        " to benefit the hearing disabled.         By 1980, the duos respective solo careers were not doing well. To help alleviate New Yorks economic decline, concert promoter Ron Delsener suggested a free concert in ": null
    },
    {
        "Central Park": "Central Park"
    },
    {
        ".  Delsener contacted Simon with the idea of a Simon & Garfunkel reunion, and once Garfunkel had agreed, plans were made.  The concert, held on September 19, 1981 attracted more than 500,000 people, at that time the largest ever concert attendance. ": null
    },
    {
        "Warner Bros. Records": "Warner Bros. Records"
    },
    {
        " released a live album of the show,  The Concert in Central Park , which went double platinum in the US. A 90-minute recording of the concert was sold to ": null
    },
    {
        "Home Box Office": "Home Box Office"
    },
    {
        " for over $1 million.  The concert created a renewed interest in Simon & Garfunkels work.  They had several heart-to-heart talks , attempting to put their disagreements behind them.  The duo planned a world tour to begin in May 1982, but their relationship grew contentious: for the majority of the tour, they did not speak to one another.      Warner Bros. pushed for the duo to extend the tour and release an all new Simon & Garfunkel studio album. After recording several vocal tracks for a possible new studio album, Simon decided to make it his own solo album. Garfunkel refused to learn the songs in the studio and would not give up his longstanding ": null
    },
    {
        "cannabis": "Cannabis"
    },
    {
        " and ": null
    },
    {
        "cigarette": "Cigarette"
    },
    {
        " habits despite Simons requests.  A spokesperson said: Paul simply felt the material he wrote is so close to his own life that it had to be his own record. Art was hoping to be on the album, but Im sure there will be other projects that they will work on together. They are still friends. The material was released on Simons 1983 album  Hearts and Bones . Another rift opened between the duo when the lengthy recording of Simons 1986 album  Graceland  prevented Garfunkel from working with Graceland engineer ": null
    },
    {
        "Roy Halee": "Roy Halee"
    },
    {
        " on a ": null
    },
    {
        "Christmas album": "The Animals Christmas"
    },
    {
        ".        In 1990, Simon and Garfunkel were inducted into the ": null
    },
    {
        "Rock and Roll Hall of Fame": "Rock And Roll Hall Of Fame"
    },
    {
        ". Garfunkel thanked his partner, calling him the person who most enriched my life by putting those songs through me, to which Simon responded, Arthur and I agree about almost nothing. But its true, I have enriched his life quite a bit. After performing three songs, the duo left without speaking. In August 1991, Simon staged his own concert in Central Park, released as a live album,  Paul Simons Concert in the Park , a few months later. He declined an offer from Garfunkel to perform with him at the park.          By 1993, their relationship had thawed, and Simon invited Garfunkel on an international tour.  Following a 21-date sold-out run at the ": null
    },
    {
        "Paramount Theater": "Paramount Theatre"
    },
    {
        " in New York and an appearance at that years ": null
    },
    {
        "Bridge School Benefit": "Bridge School Benefit"
    },
    {
        " in California, they toured the ": null
    },
    {
        "Far East": "Far East"
    },
    {
        ". They became acrimonious again for the rest of the decade. Simon thanked Garfunkel at his 2001 induction into the Rock and Roll Hall of Fame as a solo artist: I regret the ending of our friendship. I hope that some day before we die we will make peace with each other, adding after a pause, No rush.     In 2003, Simon and Garfunkel received a ": null
    },
    {
        "Lifetime Achievement Award": "Grammy Lifetime Achievement Award"
    },
    {
        " at the ": null
    },
    {
        "45th Annual Grammy Awards": "45Th Annual Grammy Awards"
    },
    {
        ", for which the promoters convinced them to open with a performance of The Sound of Silence . The performance was satisfying for both, and they planned a full-scale reunion tour. The Old Friends tour began in October 2003 and played to sold-out audiences across the United States for 40 dates until mid-December, earning an estimated $123 million.  A second U.S. leg commenced in June, 2004, consisting of twenty cities. Following a twelve-city run in Europe in 2004, they ended their nine-month tour with a free concert along ": null
    },
    {
        "Via dei Fori Imperiali": "Via Dei Fori Imperiali"
    },
    {
        ", in front of the ": null
    },
    {
        "Colosseum": "Colosseum"
    },
    {
        " in ": null
    },
    {
        "Rome": "Rome"
    },
    {
        ", on 31 July 2004. It attracted 600,000 fans, more than their Concert in Central Park. In 2005, Simon and Garfunkel performed three songs for a ": null
    },
    {
        "Hurricane Katrina": "Hurricane Katrina"
    },
    {
        " benefit concert in ": null
    },
    {
        "Madison Square Garden": "Madison Square Garden"
    },
    {
        ", including a performance with singer ": null
    },
    {
        "Aaron Neville": "Aaron Neville"
    },
    {
        ".         In February 2009, Simon and Garfunkel reunited for three songs during Simons two-night engagement at New Yorks ": null
    },
    {
        "Beacon Theatre": "Beacon Theatre"
    },
    {
        ". This led to a reunion tour of ": null
    },
    {
        "Asia": "Asia"
    },
    {
        " and Australia in June and July, 2009. On October 29, 2009, they performed five songs at the 25th Anniversary Rock and Roll Hall of Fame Concert at Madison Square Garden. Their headlining set at the 2010 ": null
    },
    {
        "New Orleans Jazz and Heritage Festival": "New Orleans Jazz And Heritage Festival"
    },
    {
        " was difficult for Garfunkel, who had vocal problems. I was terrible, and crazy nervous. I leaned on Paul Simon and the affection of the crowd, he told  Rolling Stone  several years later. Garfunkel was diagnosed with ": null
    },
    {
        "vocal cord paresis": "Vocal Cord Paresis"
    },
    {
        ", and the remaining tour dates were postponed indefinitely. His manager, John Scher, informed Simons camp that Garfunkel would be ready within a year, which did not happen, damaging relations between the two. Simon continued to publicly wish Garfunkel better health and praised his angelic voice. Garfunkel regained his vocal strength over the course of the next four years, performing shows in a ": null
    },
    {
        "Harlem": "Harlem"
    },
    {
        " theater and to underground audiences.     In 2014, Garfunkel told Rolling Stone that he believed he and Simon would tour again in future, but said: I know that audiences all over the world like Simon and Garfunkel. Im with them. But I dont think Paul Simons with them.  Asked about a reunion in 2016, Simon stated: Quite honestly, we dont get along. So its not like its fun. If it was fun, Id say, OK, sometimes well go out and sing old songs in harmony. Thats cool. But when its not fun, you know, and youre going to be in a tense situation, well, then I have a lot of musical areas that I like to play in. So thatll never happen again. Thats that.  In February 2018, Simon announced his retirement from touring.             Over the course of their career, Simon & Garfunkels music gradually moved from a basic folk rock sound to incorporate more experimental elements for the time, including ": null
    },
    {
        "Latin": "Latin Music"
    },
    {
        " and ": null
    },
    {
        "gospel music": "Gospel Music"
    },
    {
        ".  Their music, according to  Rolling Stone , struck a chord among lonely, alienated young adults near the end of the decade.      Simon & Garfunkel received criticism at the height of their success. In 1968,  Rolling Stone  critic Arthur Schmidt described their music as questionable  ... it exudes a sense of process, and it is slick, and nothing too much happens.  New York Times critic Robert Shelton said that the duo had a kind of Mickey Mouse, timid, contrived approach.  According to Richie Unterberger of ": null
    },
    {
        "AllMusic": "Allmusic"
    },
    {
        ", their clean sound and muted lyricism cost them some hipness points during the ": null
    },
    {
        "psychedelic": "Psychedelic Music"
    },
    {
        " era ... the pair inhabited the more polished end of the folk-rock spectrum and was sometimes criticized for a certain collegiate sterility. He noted that some critics regard Simons later solo work as superior to Simon & Garfunkel.     According to Pitchfork, though Simon & Garfunkel were highly regarded folk act distinguished by their intuitive harmonies and Paul Simons articulate songwriting , they were more conservative than the ": null
    },
    {
        "folk music revivalists": "American Folk-Music Revival"
    },
    {
        " of ": null
    },
    {
        "Greenwich Village": "Greenwich Village"
    },
    {
        ". By the late 1960s, they had become the folk establishment ... primarily unthreatening and accessible, which forty years later makes them an ideal gateway act to the weirder, harsher, more complex folkies of the ": null
    },
    {
        "60s counterculture": "1960S Counterculture"
    },
    {
        " .  However, their later albums explored more ambitious production techniques and incorporated elements of gospel, rock, R & B, and classical, revealing a voracious musical vocabulary .        ;Grammy Awards   The ": null
    },
    {
        "Grammy Awards": "Grammy Awards"
    },
    {
        " are held annually by the ": null
    },
    {
        "National Academy of Recording Arts and Sciences": "National Academy Of Recording Arts And Sciences"
    },
    {
        ". Simon & Garfunkel have won 9 total competitive awards, 4 Hall of Fame awards, and a Lifetime Achievement Award.     ": null
    },
    {
        "1969": "11Th Annual Grammy Awards"
    },
    {
        "  Bookends  ": null
    },
    {
        "Album of the Year": "Grammy Award For Album Of The Year"
    },
    {
        "  Mrs. Robinson": "Mrs. Robinson"
    },
    {
        " Record of the Year": "Grammy Award For Record Of The Year"
    },
    {
        "  Best Contemporary Pop Performance – Vocal Duo or Group": "Grammy Award For Best Pop Performance By A Duo Or Group With Vocals"
    },
    {
        "   The Graduate  ": null
    },
    {
        "Best Original Score Written for a Motion Picture or a Television Special": "Grammy Award For Best Score Soundtrack For Visual Media"
    },
    {
        "  1971": "13Th Annual Grammy Awards"
    },
    {
        "  Bridge over Troubled Water  ": null
    },
    {
        "Album of the Year": "Grammy Award For Album Of The Year"
    },
    {
        "  Bridge over Troubled Water": "Bridge Over Troubled Water"
    },
    {
        "  Song of the Year": "Grammy Award For Song Of The Year"
    },
    {
        "  Best Contemporary Song": "Grammy Award For Best Contemporary Song"
    },
    {
        "  Best Instrumental Arrangement Accompanying Vocalist": "Grammy Award For Best Arrangement, Instrumental And Vocals"
    },
    {
        "  Best Engineered Recording": "Grammy Award For Best Engineered Album, Non-Classical"
    },
    {
        "  Best Pop Performance by a Duo or Group with Vocals": "Grammy Award For Best Pop Performance By A Duo Or Group With Vocals"
    },
    {
        "  1976": "18Th Annual Grammy Awards"
    },
    {
        " My Little Town": "My Little Town"
    },
    {
        " Best Pop Performance by a Duo or Group with Vocals": "Grammy Award For Best Pop Performance By A Duo Or Group With Vocals"
    },
    {
        "  1998": "40Th Grammy Awards"
    },
    {
        " Grammy Hall of Fame Award": "Grammy Hall Of Fame"
    },
    {
        "  1999": "41St Grammy Awards"
    },
    {
        " Mrs. Robinson": "Mrs. Robinson"
    },
    {
        " Grammy Hall of Fame Award": "Grammy Hall Of Fame"
    },
    {
        "   Parsley, Sage, Rosemary and Thyme  ": null
    },
    {
        "Grammy Hall of Fame Award": "Grammy Hall Of Fame"
    },
    {
        "  2003": "45Th Grammy Awards"
    },
    {
        " Grammy Lifetime Achievement Award": "Grammy Lifetime Achievement Award"
    },
    {
        "  2004": "46Th Grammy Awards"
    },
    {
        " The Sound of Silence": "The Sound Of Silence"
    },
    {
        " Grammy Hall of Fame Award": "Grammy Hall Of Fame"
    },
    {
        "       ;Other recognition   ": null
    },
    {
        "Brit Awards": "Brit Awards"
    },
    {
        " – ": null
    },
    {
        "International Album": "Brit Award For International Album"
    },
    {
        "    Rock and Roll Hall of Fame": "Rock And Roll Hall Of Fame"
    },
    {
        "  – Inductee         Wednesday Morning, 3 A.M.     Sounds of Silence     Parsley, Sage, Rosemary and Thyme     Bookends     Bridge over Troubled Water         The Concert in Central Park     Live from New York City, 1967     Old Friends: Live on Stage     Live 1969         The Graduate          Simon and Garfunkels Greatest Hits ": null
    }
]