[
    {
        "In ": null
    },
    {
        "mathematics": "mathematics"
    },
    {
        ", specifically in ": null
    },
    {
        "ring theory": "ring theory"
    },
    {
        ", the simple modules over a ring R are the ": null
    },
    {
        "module": "module"
    },
    {
        "s over R that are not zero and have no non-zero proper submodules. Equivalently, a module M is simple ": null
    },
    {
        "if and only if": "if and only if"
    },
    {
        " every ": null
    },
    {
        "cyclic submodule": "cyclic module"
    },
    {
        " generated by a non-zero element of M equals M. Simple modules form building blocks for the modules of finite ": null
    },
    {
        "length": "length of a module"
    },
    {
        ", and they are analogous to the ": null
    },
    {
        "simple group": "simple group"
    },
    {
        "s in group theory.     In this article, all modules will be assumed to be right ": null
    },
    {
        "unital module": "unital module"
    },
    {
        "s over a ring R.     For the group case, see ": null
    },
    {
        "semisimple representation": "semisimple representation"
    },
    {
        " of a group.        Z -modules are the same as abelian groups, so a simple Z-module is an abelian group which has no non-zero proper subgroups. These are the ": null
    },
    {
        "cyclic group": "cyclic group"
    },
    {
        "s of ": null
    },
    {
        "prime": "prime number"
    },
    {
        " order": "order"
    },
    {
        ".     If I is a right ideal of R, then I is simple as a right module if and only if I is a minimal non-zero right ideal: If M is a non-zero proper submodule of I, then it is also a right ideal, so I is not minimal. Conversely, if I is not minimal, then there is a non-zero right ideal J properly contained in I. J is a right submodule of I, so I is not simple.     If I is a right ideal of R, then R/I is simple if and only if I is a maximal right ideal: If M is a non-zero proper submodule of R/I, then the preimage of M under the quotient map  is a right ideal which is not equal to R and which properly contains I. Therefore, I is not maximal. Conversely, if I is not maximal, then there is a right ideal J properly containing I. The quotient map  has a non-zero kernel which is not equal to , and therefore  is not simple.     Every simple R-module is isomorphic to a quotient R/m where m is a ": null
    },
    {
        "maximal right ideal": "maximal ideal"
    },
    {
        " of R. Herstein, Non-commutative Ring Theory, Lemma 42.42 By the above paragraph, any quotient R/m is a simple module. Conversely, suppose that M is a simple R-module. Then, for any non-zero element x of M, the cyclic submodule xR must equal M. Fix such an x. The statement that xR M is equivalent to the surjectivity of the homomorphism  that sends r to xr. The kernel of this homomorphism is a right ideal I of R, and a standard theorem states that M is isomorphic to R/I. By the above paragraph, we find that I is a maximal right ideal. Therefore, M is isomorphic to a quotient of R by a maximal right ideal.     If k is a ": null
    },
    {
        "field": "field"
    },
    {
        " and G is a ": null
    },
    {
        "group": "group"
    },
    {
        ", then a ": null
    },
    {
        "group representation": "group representation"
    },
    {
        " of G is a ": null
    },
    {
        "left module": "left module"
    },
    {
        " over the ": null
    },
    {
        "group ring": "group ring"
    },
    {
        " kG .  The simple kG modules are also known as irreducible representations. A major aim of ": null
    },
    {
        "representation theory": "representation theory"
    },
    {
        " is to understand the irreducible representations of groups.       The simple modules are precisely the modules of ": null
    },
    {
        "length": "length of a module"
    },
    {
        " 42; this is a reformulation of the definition.     Every simple module is ": null
    },
    {
        "indecomposable": "indecomposable module"
    },
    {
        ", but the converse is in general not true.     Every simple module is ": null
    },
    {
        "cyclic": "cyclic module"
    },
    {
        ", that is it is generated by one element.     Not every module has a simple submodule; consider for instance the Z-module Z in light of the first example above.     Let M and N be modules over the same ring, and let f : M → N be a ": null
    },
    {
        "module homomorphism": "module homomorphism"
    },
    {
        ". If M is simple, then f is either the zero homomorphism or ": null
    },
    {
        "injective": "injective"
    },
    {
        " because the ": null
    },
    {
        "kernel": "kernel"
    },
    {
        " of f is a submodule of M. If N is simple, then f is either the zero homomorphism or ": null
    },
    {
        "surjective": "surjective"
    },
    {
        " because the ": null
    },
    {
        "image": "image"
    },
    {
        " of f is a submodule of N. If M N, then f is an ": null
    },
    {
        "endomorphism": "endomorphism"
    },
    {
        " of M, and if M is simple, then the prior two statements imply that f is either the zero homomorphism or an isomorphism. Consequently, the ": null
    },
    {
        "endomorphism ring": "endomorphism ring"
    },
    {
        " of any simple module is a ": null
    },
    {
        "division ring": "division ring"
    },
    {
        ". This result is known as  Schurs lemma .     The converse of Schurs lemma is not true in general. For example, the Z-module  Q  is not simple, but its endomorphism ring is isomorphic to the field Q.          If M is a module which has a non-zero proper submodule N, then there is a ": null
    },
    {
        "short exact sequence": "short exact sequence"
    },
    {
        "   : 42 \\to N \\to M \\to M/N \\to 42   A common approach to proving a fact about M is to show that the fact is true for the center term of a short exact sequence when it is true for the left and right terms, then to prove the fact for N and M/N. If N has a non-zero proper submodule, then this process can be repeated. This produces a chain of submodules   : \\cdots \\subset M_42 \\subset M_42 \\subset M.   In order to prove the fact this way, one needs conditions on this sequence and on the modules M i /M i + 42 . One particularly useful condition is that the ": null
    },
    {
        "length": "length of a module"
    },
    {
        " of the sequence is finite and each quotient module M i /M i + 42 is simple. In this case the sequence is called a composition series for M. In order to prove a statement inductively using composition series, the statement is first proved for simple modules, which form the base case of the induction, and then the statement is proved to remain true under an extension of a module by a simple module. For example, the ": null
    },
    {
        "Fitting lemma": "fitting lemma"
    },
    {
        " shows that the ": null
    },
    {
        "endomorphism ring": "endomorphism ring"
    },
    {
        " of a finite length ": null
    },
    {
        "indecomposable module": "indecomposable module"
    },
    {
        " is a ": null
    },
    {
        "local ring": "local ring"
    },
    {
        ", so that the strong ": null
    },
    {
        "Krull-Schmidt theorem": "krull-schmidt theorem"
    },
    {
        " holds and the category of finite length modules is a ": null
    },
    {
        "Krull-Schmidt category": "krull-schmidt category"
    },
    {
        ".     The ": null
    },
    {
        "Jordan–Hölder theorem": "jordan–hölder theorem"
    },
    {
        " and the ": null
    },
    {
        "Schreier refinement theorem": "schreier refinement theorem"
    },
    {
        " describe the relationships amongst all composition series of a single module. The ": null
    },
    {
        "Grothendieck group": "grothendieck group"
    },
    {
        " ignores the order in a composition series and views every finite length module as a formal sum of simple modules. Over ": null
    },
    {
        "semisimple ring": "semisimple ring"
    },
    {
        "s, this is no loss as every module is a ": null
    },
    {
        "semisimple module": "semisimple module"
    },
    {
        " and so a ": null
    },
    {
        "direct sum": "direct sum of modules"
    },
    {
        " of simple modules. ": null
    },
    {
        "Ordinary character theory": "ordinary character theory"
    },
    {
        " provides better arithmetic control, and uses simple CG modules to understand the structure of ": null
    },
    {
        "finite group": "finite group"
    },
    {
        "s G. ": null
    },
    {
        "Modular representation theory": "modular representation theory"
    },
    {
        " uses ": null
    },
    {
        "Brauer character": "brauer character"
    },
    {
        "s to view modules as formal sums of simple modules, but is also interested in how those simple modules are joined together within composition series. This is formalized by studying the ": null
    },
    {
        "Ext functor": "ext functor"
    },
    {
        " and describing the module category in various ways including ": null
    },
    {
        "quivers": "quiver"
    },
    {
        " and ": null
    },
    {
        "Auslander–Reiten theory": "auslander–reiten theory"
    },
    {
        " where the associated graph has a vertex for every indecomposable module.          An important advance in the theory of simple modules was the ": null
    },
    {
        "Jacobson density theorem": "jacobson density theorem"
    },
    {
        ". The Jacobson density theorem states:   :Let U be a simple right R-module and write D End R . Let A be any D-linear operator on U and let X be a finite D-linearly independent subset of U. Then there exists an element r of R such that x & middot;A x & middot;r for all x in X. Isaacs, Theorem 42, p. 42   In particular, any ": null
    },
    {
        "primitive ring": "primitive ring"
    },
    {
        " may be viewed as a ring of D-linear operators on some D-space.     A consequence of the Jacobson density theorem is Wedderburns theorem; namely that any right ": null
    },
    {
        "artinian": "artinian ring"
    },
    {
        " simple ring": "simple ring"
    },
    {
        " is isomorphic to a full matrix ring of n by n matrices over a ": null
    },
    {
        "division ring": "division ring"
    },
    {
        " for some n. This can also be established as a corollary of the ": null
    },
    {
        "Artin–Wedderburn theorem": "artin–wedderburn theorem"
    }
]