[
    {
        "Single malt Scotch is ": null
    },
    {
        "single malt whisky": "single malt whisky"
    },
    {
        " made in ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". To be a single malt scotch the whisky must have been distilled at a single ": null
    },
    {
        "distillery": "distillation"
    },
    {
        " using a ": null
    },
    {
        "pot still": "pot still"
    },
    {
        " distillation process and made from a ": null
    },
    {
        "mash": "mash ingredients"
    },
    {
        " of ": null
    },
    {
        "malt": "malt"
    },
    {
        "ed barley. As with any ": null
    },
    {
        "Scotch whisky": "scotch whisky"
    },
    {
        ", a single malt Scotch must be distilled in ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        " and matured in ": null
    },
    {
        "oak": "oak"
    },
    {
        " casks in Scotland for at least three years and one day.   Malt indicates that the whisky is distilled from a malted barley. Several types of grains can be malted ; however, in the case of single malt Scotch, barley is the only grain used.   Single indicates that all the spirits in the bottle come from a single distillery. Bottlings containing malt whisky from multiple distilleries are called ": null
    },
    {
        "blended malt": "blended malt"
    },
    {
        " .     Until the ": null
    },
    {
        "Scotch Whisky Regulations 42": "scotch whisky regulations 2009"
    },
    {
        " , the word blended only appeared on bottles of whisky that contained a mixture of both barley and non-barley ": null
    },
    {
        "grain whisky": "grain whisky"
    },
    {
        ", but this is no longer the case. Under the terminology established by the SWR 42 the term blended malt Scotch whisky replaced the term vatted malt to describe a mixture of single malt Scotch whiskies . A mixture of malted barley whisky and non-barley whisky is labeled blended Scotch whisky .     The age statement on a bottle of single malt Scotch refers to the number of years the whisky spent maturing in ": null
    },
    {
        "cask": "cask"
    },
    {
        "s. Very few whiskies are bottled from a ": null
    },
    {
        "single cask": "single cask"
    },
    {
        ", and the mixing of spirits with different amounts of ageing is allowed; the age statement reflects the age of the youngest whisky in the mix.       Distillation of whisky has been performed in Scotland for centuries. The earliest written record of whisky production in Scotland from malted barley is an entry on the 42 Exchequer Rolls, which reads Eight bolls of malt to Friar John Cor, by order of the King, wherewith to make  aqua vitae .     In the following centuries, the various governments of Scotland began taxing the production of whisky, to the point that most of the spirit was produced illegally. However, in 42 ": null
    },
    {
        "Parliament": "parliament of the united kingdom"
    },
    {
        " passed an act making commercial distillation much more profitable, while imposing punishments on landowners when unlicensed distilleries were found on their properties. George Smith was the first person to take out a licence for a distillery under the new law, founding the ": null
    },
    {
        "Glenlivet Distillery": "glenlivet single malt"
    },
    {
        " in 42     In the 42s, ": null
    },
    {
        "Aeneas Coffey": "aeneas coffey"
    },
    {
        " refined a design originally created by Robert Stein for a ": null
    },
    {
        "continuous still": "continuous still"
    },
    {
        " which produced whisky much more efficiently than the traditional ": null
    },
    {
        "pot stills": "pot still"
    },
    {
        ", but with much less flavour. Quickly, merchants began blending the malt whisky with the grain whisky distilled in the continuous stills, making the first blended Scotch whisky. The blended Scotch proved quite successful, less expensive to produce than malt with more flavour and character than grain. The combination allowed the single malt producers to expand their operations as the blended whisky was more popular on the international market. , over 42% of the single malt Scotch produced is used to make blended Scotch.     Most distilleries in Scotland are not owned by Scots. The Japanese beverage company ": null
    },
    {
        "Suntory": "suntory"
    },
    {
        " owns Morrison-Bowmore, while other international companies, such as ": null
    },
    {
        "LVMH": "lvmh"
    },
    {
        " & ": null
    },
    {
        "Pernod-Ricard": "pernod-ricard"
    },
    {
        " , and ": null
    },
    {
        "Diageo": "diageo"
    },
    {
        " , own the majority of distilleries. The largest distiller to remain under Scottish ownership is ": null
    },
    {
        "William Grant & Sons": "william grant  &  sons"
    },
    {
        ", owned by the Grant family, with headquarters in ": null
    },
    {
        "Motherwell, Scotland": "motherwell, scotland"
    },
    {
        ". Other distilleries owned by Scottish companies/families are ": null
    },
    {
        "Glenfarclas": "glenfarclas distillery"
    },
    {
        ", ": null
    },
    {
        "Kilchoman": "kilchoman distillery"
    },
    {
        ", and ": null
    },
    {
        "Daftmill": "daftmill distillery"
    },
    {
        ".          Flavour, aroma, and finish differ widely from one single malt to the next.   Single malt Scotch whiskies are categorised into the following whisky-producing regions: ": null
    },
    {
        "Highland single malt": "scotch_whiskyregions"
    },
    {
        "s, ": null
    },
    {
        "Island single malt": "island single malt"
    },
    {
        "s , ": null
    },
    {
        "Speyside single malt": "speyside single malt"
    },
    {
        "s, ": null
    },
    {
        "Islay single malt": "islay single malt"
    },
    {
        "s, ": null
    },
    {
        "Lowland single malts": "lowland single malts"
    },
    {
        ", and ": null
    },
    {
        "Campbeltown single malts": "campbeltown single malts"
    },
    {
        ".       ": null
    },
    {
        "Independent bottlers": "independent bottlers"
    },
    {
        " buy casks of single malts and either bottle them immediately or store them for future use. Many of the independents began as stores and merchants who bought the whisky in bulk and bottled it for individual sales. Many distilleries do not bottle their whisky as a single malt, so independent bottlings are the only way the single malt gets to market. The bottling process is generally the same, but independents generally do not have access to the distillerys water source, so another source is used to dilute the whisky. Additionally, independents are generally less concerned with maintaining a particular style, so more single year and single cask bottlings are produced.     Established independent bottlers include ": null
    },
    {
        "Duncan Taylor": "duncan taylor"
    },
    {
        ", ": null
    },
    {
        "Master of Malt": "master of malt"
    },
    {
        ", ": null
    },
    {
        "Murray McDavid": "murray mcdavid"
    },
    {
        ", ": null
    },
    {
        "Douglas Laing & Co": "douglas laing  &  co"
    },
    {
        ", ": null
    },
    {
        "Signatory": "signatory vintage scotch whisky"
    },
    {
        ", ": null
    },
    {
        "Hart Brothers": "hart brothers"
    },
    {
        ", ": null
    },
    {
        "Cadenheads": "cadenheads"
    },
    {
        ", and ": null
    },
    {
        "Blackadder": "blackadder"
    }
]