[
    {
        "        Sino-Tibetan, in a few sources also known as Trans-Himalayan, is a ": null
    },
    {
        "family": "language family"
    },
    {
        " of more than 400 languages, second only to ": null
    },
    {
        "Indo-European": "indo-european languages"
    },
    {
        " in number of native speakers. The Sino-Tibetan languages with the most native speakers are the ": null
    },
    {
        "varieties of Chinese": "varieties of chinese"
    },
    {
        " , ": null
    },
    {
        "Burmese": "burmese language"
    },
    {
        " and the ": null
    },
    {
        "Tibetic languages": "tibetic languages"
    },
    {
        " . Other languages of the family are spoken in the ": null
    },
    {
        "Himalayas": "himalayas"
    },
    {
        ", the ": null
    },
    {
        "Southeast Asian Massif": "southeast asian massif"
    },
    {
        " and the eastern edge of the ": null
    },
    {
        "Tibetan Plateau": "tibetan plateau"
    },
    {
        ". Most have small speech communities in remote mountain areas and as such are poorly documented. Unlike Western linguists, Chinese linguists generally include ": null
    },
    {
        "Kra–Dai": "kra–dai languages"
    },
    {
        " and ": null
    },
    {
        "Hmong–Mien languages": "hmong–mien languages"
    },
    {
        " within Sino-Tibetan.     Several low-level subgroups have been securely ": null
    },
    {
        "reconstructed": "linguistic reconstruction"
    },
    {
        ", but reconstruction of a ": null
    },
    {
        "proto-language": "proto-language"
    },
    {
        " for the family as a whole is still at an early stage, so the higher-level structure of Sino-Tibetan remains unclear. Although the family is traditionally presented as divided into Sinitic and ": null
    },
    {
        "Tibeto-Burman": "tibeto-burman languages"
    },
    {
        " branches, a common origin of the non-Sinitic languages has never been demonstrated.   Several ": null
    },
    {
        "links to other language families": "classification schemes for southeast asian languages"
    },
    {
        " have been proposed, but none has broad acceptance.       A ": null
    },
    {
        "genetic relationship": "genetic relationship"
    },
    {
        " between Chinese, Tibetan, Burmese and other languages was first proposed in the early 19th century and is now broadly accepted. The initial focus on languages of civilizations with long literary traditions has been broadened to include less widely spoken languages, some of which have only recently, or never, been written. However, the reconstruction of the family is much less developed than for families such as ": null
    },
    {
        "Indo-European": "indo-european languages"
    },
    {
        " or ": null
    },
    {
        "Austroasiatic": "austroasiatic languages"
    },
    {
        ". Difficulties have included the great diversity of the languages, the lack of inflection in many of them, and the effects of language contact. In addition, many of the smaller languages are spoken in mountainous areas that are difficult to access, and are often also sensitive border zones.       During the 18th century, several scholars had noticed parallels between Tibetan and Burmese, both languages with extensive literary traditions.   Early in the following century, ": null
    },
    {
        "Brian Houghton Hodgson": "brian houghton hodgson"
    },
    {
        " and others noted that many non-literary languages of the highlands of northeast India and Southeast Asia were also related to these.   The name Tibeto-Burman was first applied to this group in 1856 by ": null
    },
    {
        "James Richardson Logan": "james richardson logan"
    },
    {
        ", who added ": null
    },
    {
        "Karen": "karen languages"
    },
    {
        " in 1858.   The third volume of the  Linguistic Survey of India , edited by ": null
    },
    {
        "Sten Konow": "sten konow"
    },
    {
        ", was devoted to the Tibeto-Burman languages of ": null
    },
    {
        "British India": "british india"
    },
    {
        ".     Studies of the Indo-Chinese languages of Southeast Asia from the mid-19th century by Logan and others revealed that they comprised four families: Tibeto-Burman, ": null
    },
    {
        "Tai": "tai languages"
    },
    {
        ", ": null
    },
    {
        "Mon–Khmer": "mon–khmer languages"
    },
    {
        " and ": null
    },
    {
        "Malayo-Polynesian": "malayo-polynesian languages"
    },
    {
        ".   ": null
    },
    {
        "Julius Klaproth": "julius klaproth"
    },
    {
        " had noted in 1823 that Burmese, Tibetan and Chinese all shared common basic ": null
    },
    {
        "vocabulary": "vocabulary"
    },
    {
        " but that ": null
    },
    {
        "Thai": "thai language"
    },
    {
        ", ": null
    },
    {
        "Mon": "mon language"
    },
    {
        ", and ": null
    },
    {
        "Vietnamese": "vietnamese language"
    },
    {
        " were quite different.   ": null
    },
    {
        "Ernst Kuhn": "ernst kuhn"
    },
    {
        " envisaged a group with two branches, Chinese-Siamese and Tibeto-Burman.   ": null
    },
    {
        "August Conrady": "august conrady"
    },
    {
        " called this group Indo-Chinese in his influential 1896 classification, though he had doubts about Karen. Conradys terminology was widely used, but there was uncertainty regarding his exclusion of Vietnamese. ": null
    },
    {
        "Franz Nikolaus Finck": "franz nikolaus finck"
    },
    {
        " in 1909 placed Karen as a third branch of Chinese-Siamese.     ": null
    },
    {
        "Jean Przyluski": "jean przyluski"
    },
    {
        " introduced the French term sino-tibétain as the title of his chapter on the group in ": null
    },
    {
        "Meillet": "antoine meillet"
    },
    {
        " and ": null
    },
    {
        "Cohens": "marcel cohen"
    },
    {
        " Les langues du monde in 1924. He divided them into three groups: Tibeto-Burman, Chinese and Tai, and was uncertain about the affinity of Karen and ": null
    },
    {
        "Hmong–Mien": "hmong–mien"
    },
    {
        ". The English translation Sino-Tibetan first appeared in a short note by Przyluski and ": null
    },
    {
        "Luce": "gordon luce"
    },
    {
        " in 1931.       In 1935, the anthropologist ": null
    },
    {
        "Alfred Kroeber": "alfred kroeber"
    },
    {
        " started the Sino-Tibetan Philology Project, funded by the ": null
    },
    {
        "Works Project Administration": "works project administration"
    },
    {
        " and based at the ": null
    },
    {
        "University of California, Berkeley": "university of california, berkeley"
    },
    {
        ".   The project was supervised by Robert Shafer until late 1938, and then by ": null
    },
    {
        "Paul K. Benedict": "paul k. benedict"
    },
    {
        ".   Under their direction, the staff of 30 non-linguists collated all the available documentation of Sino-Tibetan languages.   The result was eight copies of a 15-volume typescript entitled Sino-Tibetan Linguistics.   This work was never published, but furnished the data for a series of papers by Shafer, as well as Shafers five-volume Introduction to Sino-Tibetan and Benedicts Sino-Tibetan, a Conspectus.     Benedict completed the manuscript of his work in 1941, but it was not published until 1972. Instead of building the entire family tree, he set out to reconstruct a ": null
    },
    {
        "Proto-Tibeto-Burman language": "proto-tibeto-burman language"
    },
    {
        " by comparing five major languages, with occasional comparisons with other languages. He reconstructed a two-way distinction on initial consonants based on voicing, with aspiration conditioned by pre-initial consonants that had been retained in Tibetic but lost in many other languages. Thus, Benedict reconstructed the following initials:      Although the initial consonants of cognates tend to have the same ": null
    },
    {
        "place": "place of articulation"
    },
    {
        " and ": null
    },
    {
        "manner of articulation": "manner of articulation"
    },
    {
        ", voicing and aspiration is often unpredictable.   This irregularity was attacked by ": null
    },
    {
        "Roy Andrew Miller": "roy andrew miller"
    },
    {
        ", though Benedicts supporters attribute it to the effects of prefixes that have been lost and are often unrecoverable.   The issue remains unsolved today.   It was cited together with the lack of reconstructable shared morphology, and evidence that much shared lexical material has been borrowed from ": null
    },
    {
        "Chinese": "chinese language"
    },
    {
        " into ": null
    },
    {
        "Tibeto-Burman": "tibeto-burman"
    },
    {
        ", by ": null
    },
    {
        "Christopher Beckwith": "christopher beckwith"
    },
    {
        ", one of the few scholars still arguing that Chinese is not related to Tibeto-Burman.     Benedict also reconstructed, at least for Tibeto-Burman, prefixes such as the causative s-, the intransitive m-, and r-, b- g- and d- of uncertain function, as well as suffixes -s, -t and -n.          ": null
    },
    {
        "Old Chinese": "old chinese"
    },
    {
        " is by far the oldest recorded Sino-Tibetan language, with inscriptions dating from 1200 BC and a huge body of literature from the first millennium BC, but the Chinese script is not alphabetic. Scholars have sought to reconstruct the ": null
    },
    {
        "phonology of Old Chinese": "phonology of old chinese"
    },
    {
        " by comparing the obscure descriptions of the sounds of ": null
    },
    {
        "Middle Chinese": "middle chinese"
    },
    {
        " in medieval dictionaries with phonetic elements in ": null
    },
    {
        "Chinese characters": "chinese characters"
    },
    {
        " and the rhyming patterns of early poetry. The first complete reconstruction, the  Grammata Serica Recensa  of ": null
    },
    {
        "Bernard Karlgren": "bernard karlgren"
    },
    {
        ", was used by Benedict and Shafer.     Karlgrens reconstruction was somewhat unwieldy, with many sounds having a highly non-uniform distribution. Later scholars have revised it by drawing on a range of other sources. Some proposals were based on cognates in other Sino-Tibetan languages, though workers have also found solely Chinese evidence for them. For example, recent ": null
    },
    {
        "reconstructions of Old Chinese": "reconstructions of old chinese"
    },
    {
        " have reduced Karlgrens 15 vowels to a six-vowel system originally suggested by ": null
    },
    {
        "Nicholas Bodman": "nicholas bodman"
    },
    {
        ". Similarly, Karlgrens l has been recast as r, with a different initial interpreted as l, matching Tibeto-Burman cognates, but also supported by Chinese transcriptions of foreign names. A growing number of scholars believe that Old Chinese did not use tones, and that the tones of Middle Chinese developed from final consonants. One of these, -s, is believed to be a suffix, with cognates in other Sino-Tibetan languages.        ": null
    },
    {
        "Tibetic": "tibetic languages"
    },
    {
        " has extensive written records from the adoption of writing by the ": null
    },
    {
        "Tibetan Empire": "tibetan empire"
    },
    {
        " in the mid-7th century. The earliest records of ": null
    },
    {
        "Burmese": "burmese language"
    },
    {
        "  are more limited, but later an extensive literature developed. Both languages are recorded in alphabetic scripts ultimately derived from the ": null
    },
    {
        "Brahmi script": "brahmi script"
    },
    {
        " of Ancient India. Most comparative work has used the conservative written forms of these languages, following the dictionaries of ": null
    },
    {
        "Jäschke": "heinrich august jäschke"
    },
    {
        " and ": null
    },
    {
        "Judson": "adoniram judson"
    },
    {
        " , though both contain entries from a wide range of periods.     There are also extensive records in ": null
    },
    {
        "Tangut": "tangut language"
    },
    {
        ", the language of the ": null
    },
    {
        "Western Xia": "western xia"
    },
    {
        " . Tangut is recorded in a Chinese-inspired logographic script, whose interpretation presents many difficulties, even though multilingual dictionaries have been found.     ": null
    },
    {
        "Gong Hwang-cherng": "gong hwang-cherng"
    },
    {
        " has compared Old Chinese, Tibetic, Burmese and Tangut in an effort to establish sound correspondences between those languages. He found that Tibetic and Burmese  correspond to two Old Chinese vowels, a and ə. While this has been considered evidence for a separate Tibeto-Burman subgroup, Hill finds that Burmese has distinct correspondences for Old Chinese rhymes -ay : -aj and -i : -əj, and hence argues that the development ə  ref  /ref  ref name Zhang2019  /ref  ref  /ref  ref name Matisoff2015  /ref ref name STEDT2015  /ref                                                                          ref name Zhang2019 /  ref  /ref ref  /ref ref  /ref  ref  /ref ": null
    }
]