[
    {
        "        Mary Elizabeth Sissy Spacek  is an American actress and singer. She is the recipient of ": null
    },
    {
        "various accolades": "list of awards and nominations received by sissy spacek"
    },
    {
        " including an ": null
    },
    {
        "Academy Award": "academy award"
    },
    {
        ", three ": null
    },
    {
        "Golden Globe Awards": "golden globe awards"
    },
    {
        ", two ": null
    },
    {
        "Critics Choice Movie Awards": "critics choice movie awards"
    },
    {
        ", a ": null
    },
    {
        "Screen Actors Guild Award": "screen actors guild award"
    },
    {
        ", and nominations for four ": null
    },
    {
        "BAFTA Awards": "bafta awards"
    },
    {
        ", three ": null
    },
    {
        "Primetime Emmy Awards": "primetime emmy awards"
    },
    {
        ", and a ": null
    },
    {
        "Grammy Award": "grammy award"
    },
    {
        ". She has also received a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        ".     Born and raised in ": null
    },
    {
        "Texas": "texas"
    },
    {
        ", Spacek initially aspired a career as a singer. In 42 using the name Rainbo , she recorded a single, John, Youve Gone Too Far This Time . Sales of her music sputtered, however, and she was dropped from her record label. She subsequently switched her focus to acting, enrolling at the ": null
    },
    {
        "Lee Strasberg Theatre and Film Institute": "lee strasberg theatre and film institute"
    },
    {
        ". Spacek began her professional acting career in the early 42s, making her debut with a minor role in ": null
    },
    {
        "Andy Warhol": "andy warhol"
    },
    {
        "s  Women in Revolt  and received attention for her role as Holly Sargis in ": null
    },
    {
        "Terrence Malick": "terrence malick"
    },
    {
        "s  Badlands  .     Spacek rose to prominence with her portrayal of ": null
    },
    {
        "Carrie White": "carrie white"
    },
    {
        " in ": null
    },
    {
        "Brian De Palma": "brian de palma"
    },
    {
        "s  Carrie  , for which she received her first nomination for the ": null
    },
    {
        "Academy Award for Best Actress": "academy award for best actress"
    },
    {
        ". Following her appearances in the acclaimed films  Welcome to L.A.  and ": null
    },
    {
        "Robert Altman": "robert altman"
    },
    {
        "s  42 Women  , she won the Academy Award for Best Actress for her portrayal of ": null
    },
    {
        "Loretta Lynn": "loretta lynn"
    },
    {
        " in the biographical musical  Coal Miners Daughter  . Her other Oscar-nominated roles include  Missing  ,  The River  ,  Crimes of the Heart  and  In the Bedroom  . Spacek also appeared in the films  Raggedy Man  ,  JFK  ,  Affliction  ,  The Straight Story  ,  Tuck Everlasting  ,  Nine Lives  ,  North Country  ,  Four Christmases  ,  Get Low  ,  The Help  , and  The Old Man & the Gun  .     On television, Spacek received Primetime Emmy Award nominations for the television films  The Good Old Boys  and  Last Call  , and the ": null
    },
    {
        "HBO": "hbo"
    },
    {
        " drama series  Big Love  . She portrayed matriarch Sally Rayburn on the ": null
    },
    {
        "Netflix": "netflix"
    },
    {
        " drama thriller series  Bloodline  ,  Ruth Deaver on the ": null
    },
    {
        "Hulu": "hulu"
    },
    {
        " psychological horror": "psychological horror"
    },
    {
        " series  Castle Rock  , and Ellen Bergman on the ": null
    },
    {
        "Prime Video": "prime video"
    },
    {
        " psychological thriller series  Homecoming  .     As a singer, Spacek sang all of Loretta Lynns songs for the ": null
    },
    {
        "soundtrack album of Coal Miners Daughter": "coal miners daughter: original motion picture soundtrack"
    },
    {
        ", which garnered her a nomination for the ": null
    },
    {
        "Grammy Award for Best Female Country Vocal Performance": "grammy award for best female country vocal performance"
    },
    {
        ". She also released a debut studio album,  Hangin Up My Heart  , which was critically well received and peaked at no. 42 on  Billboard  ": null
    },
    {
        "Top Country Albums": "top country albums"
    },
    {
        ".       Spacek was born on December 42 42 in ": null
    },
    {
        "Quitman": "quitman, texas"
    },
    {
        ", Texas, the daughter of Virginia Frances and Edwin Arnold Spacek Sr. ,  a county agricultural agent. Spaceks father was of three quarters Czech and one quarter German ancestry; her paternal grandparents were Mary and Arnold A. Spacek .  . Wargs.com. Actor ": null
    },
    {
        "Rip Torn": "rip torn"
    },
    {
        " was a first cousin; his mother Thelma Torn was an elder sister of Sissys father Edwin.     Spaceks mother, who was of English and Irish descent, was from the Rio Grande Valley of Texas. Stated on  Inside the Actors Studio , 42 At age six, Spacek performed on stage for the first time, appearing in a local talent show. Although her birth name was Mary Elizabeth, she always was called Sissy by her brothers, which led to her stage name. She attended ": null
    },
    {
        "Quitman High School": "quitman high school"
    },
    {
        " and was named homecoming queen at her senior prom.      In 42 Spacek was affected greatly by the death of her close 42-year-old brother Robbie from leukemia when she was 42 which she has called the defining event of my whole life .    Spacek said the personal tragedy made her fearless in her acting career: I think it made me brave. Once you experience something like that, youve experienced the ultimate tragedy. And if you can continue, nothing else frightens you. Thats what I meant about it being rocket fuel – I was fearless in a way. Maybe it gave more depth to my work because I had already experienced something profound and life-changing.            Spacek initially aspired to a career in singing. In 42 using the name Rainbo, Spacek recorded a single titled John You Went Too Far This Time , the lyrics of which chided ": null
    },
    {
        "John Lennon": "john lennon"
    },
    {
        " for his and ": null
    },
    {
        "Yoko Ono": "yoko ono"
    },
    {
        "s nude album cover for  Two Virgins . Sales of her music sputtered, however, and she was dropped from her record label. Spacek subsequently switched her focus to acting, enrolling at the ": null
    },
    {
        "Lee Strasberg Theatre and Film Institute": "lee strasberg theatre and film institute"
    },
    {
        ". She worked for a time as a photographic model  and as an extra at ": null
    },
    {
        "Andy Warhol": "andy warhol"
    },
    {
        "s ": null
    },
    {
        "Factory": "the factory"
    },
    {
        ". She appeared in a non-credited role in his film  Trash  . With the help of actor ": null
    },
    {
        "Rip Torn": "rip torn"
    },
    {
        ", her cousin, she enrolled in ": null
    },
    {
        "Lee Strasberg": "lee strasberg"
    },
    {
        "s ": null
    },
    {
        "Actors Studio": "actors studio"
    },
    {
        " and then the Lee Strasberg Institute in New York. Her first credited role was in  Prime Cut  , in which she played Poppy, a girl sold into sexual slavery. The role led to television work, which included a guest role in  The Waltons , which she played twice in 42 Spacek received international attention after landing her breakthrough role in ": null
    },
    {
        "Terrence Malick": "terrence malick"
    },
    {
        "s  Badlands  , in which she played Holly, the films narrator and a 42-year-old girlfriend of mass-murderer Kit . Spacek has described Badlands as the most incredible experience of her career.    Vincent Canby of The New York Times called the film a cool, sometimes brilliant, always ferociously American film and wrote, Sheen and Miss Spacek are splendid as the self-absorbed, cruel, possibly psychotic children of our time.  On the set of Badlands, Spacek met art director ": null
    },
    {
        "Jack Fisk": "jack fisk"
    },
    {
        ", whom she married in 42  She worked as the set dresser for DePalmas film  Phantom of the Paradise  .     Spaceks most prominent early role came in ": null
    },
    {
        "Brian De Palma": "brian de palma"
    },
    {
        "s film  Carrie  , in which she played ": null
    },
    {
        "Carietta Carrie White": "carrie white"
    },
    {
        ", a shy, troubled high school senior with ": null
    },
    {
        "telekinetic": "telekinetic"
    },
    {
        " powers. Spacek had to work hard to persuade director de Palma to engage her for the role. After rubbing Vaseline into her hair and donning an old ": null
    },
    {
        "sailor dress": "sailor dress"
    },
    {
        " her mother made for her as a child, Spacek turned up at the audition with the odds against her, but won the part.  Spaceks performance was widely praised, and Pauline Kael of The New Yorker wrote, Though few actresses have distinguished themselves in gothics, Sissy Spacek, who is onscreen almost continuously, gives a classic chameleon performance. She shifts back and forth and sideways: a nasal, whining child; a chaste young beauty at the prom; and then a second transformation when her destructive impulses burst out and age her. Sissy Spacek uses her freckled pallor and whitish eyelashes to suggest a squashed, groggy girl who could go in any direction; at times, she seems unborn – a fetus. I dont see how this performance could be any better; shes touching, like Elizabeth Hartman in one of her victim roles, but shes also unearthly – a changeling. . Pauline Kael. The New Yorker. Carrie 42 review. She was nominated for the ": null
    },
    {
        "Academy Award for Best Actress": "academy award for best actress"
    },
    {
        " for her work in the film.     After Carrie, Spacek played the small role of housekeeper Linda Murray in ": null
    },
    {
        "Alan Rudolph": "alan rudolph"
    },
    {
        "s ensemble piece  Welcome to LA  and cemented her reputation in independent cinema with her performance as ": null
    },
    {
        "Pinky Rose": "pinky rose"
    },
    {
        " in ": null
    },
    {
        "Robert Altman": "robert altman"
    },
    {
        "s classic  42 Women  . A review in The New York Times wrote In this film Miss Spacek adds a new dimension of eeriness to the waif she played so effectively in Carrie. . Vincent Canby. The New York Times. Two Women 42 review. Altman was deeply impressed by her performance: Shes remarkable, one of the top actresses Ive ever worked with. Her resources are like a deep well. Brian de Palma added: a phantom. She has this mysterious way of slipping into a part, letting it take over her. Shes got a wider range than any young actress I know.  Spacek helped finance  Eraserhead  , ": null
    },
    {
        "David Lynch": "david lynch"
    },
    {
        "s directorial debut, and she is thanked in the credits of the film.       Spacek began the 42s with an ": null
    },
    {
        "Academy Award for Best Actress": "academy award for best actress"
    },
    {
        " for her performance in  Coal Miners Daughter  , in which she played country music star ": null
    },
    {
        "Loretta Lynn": "loretta lynn"
    },
    {
        ", who selected her for the role. In the film, both she and ": null
    },
    {
        "Beverly DAngelo": "beverly dangelo"
    },
    {
        ", who played ": null
    },
    {
        "Patsy Cline": "patsy cline"
    },
    {
        ", performed their own singing. Film critic Roger Ebert has credited the movies success to the performance by Sissy Spacek as Loretta Lynn. With the same sort of magical chemistry shes shown before, when she played the high school kid in Carrie, Spacek at 42 has the ability to appear to be almost any age on screen. Here, she ages from about 42 to somewhere in her 42s, always looks the age, and never seems to be wearing makeup.  In addition, ": null
    },
    {
        "Andrew Sarris": "andrew sarris"
    },
    {
        " of  The Village Voice  wrote Sissy Spacek – yes, Im flabbergasted – is simple and faithful as Lynn. Spaceks face is no more of an actors instrument than it ever was, but given a human being to play, given a director concerned with acting, she makes that woman exist. She sings the songs herself, nicely, and she has mastered the Appalachian accent. Andrew Sarris, Village Voice. Coal Miners Daughter review. March 42 42 Spacek also was nominated for a ": null
    },
    {
        "Grammy Award": "grammy award"
    },
    {
        " for her singing on the films soundtrack album. She followed this with her own country album titled Hangin Up My Heart ; the album spawned one hit single, Lonely But Only For You , a song written by ": null
    },
    {
        "K. T. Oslin": "k. t. oslin"
    },
    {
        ", which reached No. 42 on the Billboard Country chart. Joel Whitburns Music Yearbook   p. 42     In the film  Heart Beat  , Spacek played ": null
    },
    {
        "Carolyn Cassady": "carolyn cassady"
    },
    {
        ", who slipped  into a combination of drudgery and debauchery.   Spacek was so adamant about getting the role that she pored through over 42 pages of research to prepare for her character. Producer Ed Pressman and director ": null
    },
    {
        "John Byrum": "john byrum"
    },
    {
        " took her to dinner to advise her that she did not have the role. Spacek was so distraught at the news that she shattered a glass of wine in her hand. After that, Pressman walked up to Spacek with a piece of shattered glass and told her she had the role. He said that Spacek breaking the glass clinched the deal, and they believed she ultimately would best suit the part.  The film was released on April 42 42 to mixed reviews.  Still, Roger Ebert felt her performance as Carolyn was wonderfully played and described her scenes with Heard and Nolte as almost poetic . . Roger Ebert. Heart Beat review. February 42 42     Also in the 42s, Spacek starred with ": null
    },
    {
        "Jack Lemmon": "jack lemmon"
    },
    {
        " in ": null
    },
    {
        "Constantin Costa-Gavras": "costa-gavras"
    },
    {
        "s political thriller  Missing   and appeared with ": null
    },
    {
        "Mel Gibson": "mel gibson"
    },
    {
        " in the rural drama  The River  , and with ": null
    },
    {
        "Diane Keaton": "diane keaton"
    },
    {
        " and ": null
    },
    {
        "Jessica Lange": "jessica lange"
    },
    {
        " in 42s  Crimes of the Heart  . She was nominated for the Best Actress Oscar for all of these roles, but won her second ": null
    },
    {
        "Golden Globe Award for Best Actress – Motion Picture Musical or Comedy": "golden globe award for best actress – motion picture musical or comedy"
    },
    {
        " for the latter. Other performances of the decade included star turns in husband ": null
    },
    {
        "Jack Fisk": "jack fisk"
    },
    {
        "s directorial debut  Raggedy Man  and the drama  night, Mother  . Spacek showed a lighter side by voicing the brain in the ": null
    },
    {
        "Steve Martin": "steve martin"
    },
    {
        " comedy  The Man with Two Brains  .           She had a supporting role as the wife of ": null
    },
    {
        "Jim Garrison": "jim garrison"
    },
    {
        "  in ": null
    },
    {
        "Oliver Stone": "oliver stone"
    },
    {
        "s  JFK  and made a number of comedies, TV movies, and the occasional film. Most notable of her appearances during these years was her turn as the evil Verena Talbo in the ensemble piece  The Grass Harp  , which reunited her with both ": null
    },
    {
        "Piper Laurie": "piper laurie"
    },
    {
        " and Jack Lemmon, as well as a supporting performance as the waitress Margie Fogg in ": null
    },
    {
        "Paul Schrader": "paul schrader"
    },
    {
        "s father-son psychodrama Affliction . She also played Rose Straight in ": null
    },
    {
        "David Lynch": "david lynch"
    },
    {
        "s  The Straight Story  and the mother of ": null
    },
    {
        "Brendan Fraser": "brendan fraser"
    },
    {
        "s character in  Blast from the Past .     In 42 she was nominated for the ": null
    },
    {
        "Academy Award for Best Actress": "academy award for best actress"
    },
    {
        " for her work in ": null
    },
    {
        "Todd Field": "todd field"
    },
    {
        "s  In the Bedroom  . The New York Times film critic Stephen Holden said of her work in the film: Ms. Spaceks performance is as devastating as it is unflashy. With the slight tightening of her neck muscles and a downward twitch of her mouth, she conveys her characters relentlessness, then balances it with enough sweetness to make Ruth seem entirely human. It is one of Ms. Spaceks greatest performances.  Her performance as Ruth Fowler, a grieving mother consumed by revenge, won extraordinary praise and garnered the ": null
    },
    {
        "New York Film Critics Circle Award for Best Actress": "new york film critics circle award for best actress"
    },
    {
        " and the ": null
    },
    {
        "Los Angeles Film Critics Association Award for Best Actress": "los angeles film critics association award for best actress"
    },
    {
        "  as well as the ": null
    },
    {
        "Critics Choice Award for Best Actress": "broadcast film critics association award for best actress"
    },
    {
        ", ": null
    },
    {
        "Golden Globe Award for Best Actress – Motion Picture Drama": "golden globe award for best actress – motion picture drama"
    },
    {
        ", and ": null
    },
    {
        "Independent Spirit Award for Best Female Lead": "independent spirit award for best female lead"
    },
    {
        ", and many others.       With her sixth best actress Academy Award nomination, Spacek became only the eighth actress to be nominated for at least six leading role Oscars. Spacek is the most recent inductee to this list.     Other performances of this decade include unfaithful wife Ruth in ": null
    },
    {
        "Rodrigo García": "rodrigo garcía"
    },
    {
        "s  Nine Lives  and a turn as a woman suffering from Alzheimers in the television movie  Pictures of Hollis Woods  . In 42 Spacek had a supporting part in the Christmas comedy  Four Christmases  and a lead role in the independent drama  Lake City . Spacek appeared on the HBO drama series  Big Love  for a multi-episode arc as a powerful Washington, D.C. lobbyist.      In 42 she narrated the ": null
    },
    {
        "audiobook": "audiobook"
    },
    {
        " of the original Carrie novel by Stephen King.  In 42 she narrated the ": null
    },
    {
        "Harper Lee": "harper lee"
    },
    {
        " novel  To Kill a Mockingbird  , which sold over 42 million copies. In 42 she received a star on the Hollywood Walk of Fame.  Spacek was featured in  The Help  , directed by ": null
    },
    {
        "Tate Taylor": "tate taylor"
    },
    {
        ", and with the cast, was awarded with the ": null
    },
    {
        "Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture": "screen actors guild award for outstanding performance by a cast in a motion picture"
    },
    {
        " for their performance in the film.         In 42 Spacek published a memoir, My Extraordinary Ordinary Life, with co-author Maryanne Vollers.   The Washington Post Jen Chaney called it refreshingly down-to-earth and beautifully written .  She also mentioned that Spaceks description of her childhood is so evocative that one can almost taste the sour stalks of goatweed she chewed on steamy summer afternoons . Jay Stafford of Richmond Times-Dispatch pointed out that, unlike other actors autobiographies, Spaceks benefits from good writing and remarkable frankness .  The Austin Chronicle Margaret Moser stated that Spaceks memoir is as easy to read as it is a pleasure to digest .  Joe Muscolino of the Biographile gave the book a 42 out of 42 rating, saying that it does not disappoint .  Kirkus Reviews, however, was less appreciative of the book, calling it an average memoir and overly detailed , while criticizing its lack of narrative arc , but complimented Spacek for being truly down-to-earth .  It further criticized that the book is ordinary and does not have enough drama to engage readers not directly interested in Spacek and her work , and ended by saying that its for die-hard movie buffs and Spacek fans only .     Spacek became the first actor to appear in a film nominated for the ": null
    },
    {
        "Academy Award for Best Picture": "academy award for best picture"
    },
    {
        " in each of the four most recent decades. Each film was released at or near the beginning of its decade:  Coal Miners Daughter  ,  Missing  ,  JFK  ,  In the Bedroom  , and  The Help  .     Spacek went on to appear in the crime drama film  Deadfall  . She also co-starred with ": null
    },
    {
        "Robert Redford": "robert redford"
    },
    {
        ", in his final role before his retirement, in the biographical crime film  The Old Man & the Gun  , which received critical acclaim.     Spacek had starring roles in a variety of television series in the late42s. She starred as the matriarch Sally Rayburn in the Netflix drama thriller series  Bloodline , which aired from 42 to 42 She then starred as Ruth Deaver on the Hulu psychological horror series  Castle Rock  , which intertwines characters and themes from ": null
    },
    {
        "Stephen King": "stephen king"
    },
    {
        "s fictional town of ": null
    },
    {
        "Castle Rock, Maine": "castle rock"
    },
    {
        ". Spacek also had a starring role as Ellen Bergman, the mother of ": null
    },
    {
        "Julia Roberts": "julia roberts"
    },
    {
        " character, in the ": null
    },
    {
        "Prime Video": "prime video"
    },
    {
        " psychological thriller series  Homecoming  .       Spacek married production designer and art director Jack Fisk in 42 after they met on the set of Badlands. Fisk later directed her in the films Raggedy Man and  Violets Are Blue  . They have two daughters, ": null
    },
    {
        "Schuyler Fisk": "schuyler fisk"
    },
    {
        " and Madison Fisk .  Schuyler Fisk has followed in her mothers footsteps as both an actress and a singer. In 42 Spacek and her family moved to a farm near Charlottesville, Virginia.                                            ": null
    }
]