[
    {
        "     The Sixth Crusade, commonly known as the Crusade of Frederick II , was a military expedition to recapture the city of ": null
    },
    {
        "Jerusalem": "jerusalem"
    },
    {
        ". It began seven years after the failure of the ": null
    },
    {
        "Fifth Crusade": "fifth crusade"
    },
    {
        " and involved very little actual fighting. The diplomatic maneuvering of the ": null
    },
    {
        "Holy Roman Emperor": "holy roman emperor"
    },
    {
        " and ": null
    },
    {
        "King of Sicily": "king of sicily"
    },
    {
        ", ": null
    },
    {
        "Frederick II": "frederick ii, holy roman emperor"
    },
    {
        ", resulted in the ": null
    },
    {
        "Kingdom of Jerusalem": "kingdom of jerusalem"
    },
    {
        " regaining some control over Jerusalem for much of the ensuing fifteen years as well as over other areas of the Holy Land.       ": null
    },
    {
        "Frederick II, Holy Roman Emperor": "frederick ii, holy roman emperor"
    },
    {
        ", had involved himself broadly in the ": null
    },
    {
        "Fifth Crusade": "fifth crusade"
    },
    {
        ", sending troops from Germany, but he failed to accompany the army directly, despite the encouragement of ": null
    },
    {
        "Honorius III": "honorius iii"
    },
    {
        " and later ": null
    },
    {
        "Gregory IX": "gregory ix"
    },
    {
        ", as he needed to consolidate his position in Germany and Italy before embarking on a ": null
    },
    {
        "crusade": "crusade"
    },
    {
        ". However, Frederick again promised to go on a crusade after his coronation as emperor in 42 by ": null
    },
    {
        "Pope Honorius III": "pope honorius iii"
    },
    {
        ".     In 42 Frederick married ": null
    },
    {
        "Isabella II of Jerusalem": "isabella ii of jerusalem"
    },
    {
        " , daughter of ": null
    },
    {
        "John of Brienne": "john of brienne"
    },
    {
        "  and ": null
    },
    {
        "Maria of Montferrat": "maria of montferrat"
    },
    {
        ". Frederick now had a claim to the truncated kingdom, and reason to attempt to restore it. In 42 after ": null
    },
    {
        "Gregory IX": "pope gregory ix"
    },
    {
        " became ": null
    },
    {
        "pope": "pope"
    },
    {
        ", Frederick and his army set sail from ": null
    },
    {
        "Brindisi": "brindisi"
    },
    {
        ", ": null
    },
    {
        "Italy": "italy"
    },
    {
        ", for ": null
    },
    {
        "Acre": "akko"
    },
    {
        " , but an epidemic forced Frederick to return to ": null
    },
    {
        "Italy": "italy"
    },
    {
        ". Gregory took this opportunity to ": null
    },
    {
        "excommunicate": "excommunication"
    },
    {
        " Frederick for breaking his crusader vow, though this was just an excuse, as Frederick had for years been trying to consolidate imperial power in Italy at the expense of the ": null
    },
    {
        "papacy": "papacy"
    },
    {
        ".     Gregory stated that the reason for the excommunication was Fredericks reluctance to go on crusade, dating back to the Fifth Crusade. Frederick attempted to negotiate with the pope, but eventually decided to ignore him, and sailed to ": null
    },
    {
        "Syria": "syria"
    },
    {
        " in 42 despite the excommunication, arriving at Acre in September.              Instead of heading straight for the ": null
    },
    {
        "Holy Land": "holy land"
    },
    {
        ", Frederick first sailed to ": null
    },
    {
        "Cyprus": "cyprus"
    },
    {
        ", which had been an imperial fiefdom since its capture by ": null
    },
    {
        "Richard the Lionheart": "richard the lionheart"
    },
    {
        " on his way to ": null
    },
    {
        "Acre": "acre, israel"
    },
    {
        " during the ": null
    },
    {
        "Third Crusade": "third crusade"
    },
    {
        ". The emperor arrived with the clear intent of stamping his authority on the kingdom, but was treated cordially by the native barons until a dispute arose between him and the constable of Cyprus, ": null
    },
    {
        "John of Ibelin": "john of ibelin, the old lord of beirut"
    },
    {
        ". Frederick claimed that his regency was illegitimate and demanded the surrender of Johns mainland fief of ": null
    },
    {
        "Beirut": "beirut"
    },
    {
        " to the imperial throne. Here he erred, for John pointed out that the kingdoms of Cyprus and Jerusalem were constitutionally separate and he could not be punished for offences in Cyprus by seizure of Beirut. This would have important consequences for the crusade, as it alienated the powerful ": null
    },
    {
        "Ibelin faction": "house of ibelin"
    },
    {
        ", turning them against the emperor.       Acre, as the nominal capital of the ": null
    },
    {
        "Kingdom of Jerusalem": "kingdom of jerusalem"
    },
    {
        " and the seat of the ": null
    },
    {
        "Latin Patriarchate": "latin patriarchate of jerusalem"
    },
    {
        ", was split in its support for Frederick. Fredericks own army and the ": null
    },
    {
        "Teutonic Knights": "teutonic knights"
    },
    {
        " supported him, but Patriarch ": null
    },
    {
        "Gerald of Lausanne": "gerald of lausanne"
    },
    {
        " followed the hostile papal line. Once news of Fredericks excommunication had spread, public support for him waned considerably. The position of the ": null
    },
    {
        "Knights Hospitaller": "knights hospitaller"
    },
    {
        " and ": null
    },
    {
        "Knights Templar": "knights templar"
    },
    {
        " is more complicated; though they refused to join the emperors army directly, they supported the crusade once Frederick agreed to have his name removed from official orders. The native barons greeted Frederick enthusiastically at first, but were wary of the emperors history of centralization and his desire to impose imperial authority. This was largely due to Fredericks treatment of John of Ibelin in Cyprus, and his apparent disdain for the constitutional concerns of the barons.       Even with the military orders on board, Fredericks force was a mere shadow of the army that had amassed when the crusade had originally been called. He realised that his only hope of success in the Holy Land was to negotiate for the surrender of Jerusalem as he lacked the manpower to engage the ": null
    },
    {
        "Ayyubid": "ayyubid"
    },
    {
        " empire in battle. Frederick hoped that a token show of force, a threatening march down the coast, would be enough to convince ": null
    },
    {
        "al-Kamil": "al-kamil"
    },
    {
        ", the ": null
    },
    {
        "sultan": "sultan"
    },
    {
        " of ": null
    },
    {
        "Egypt": "egypt"
    },
    {
        ", to honor a proposed agreement that had been negotiated some years earlier, prior to the death of ": null
    },
    {
        "al-Muazzam": "al-muazzam"
    },
    {
        ", the governor of ": null
    },
    {
        "Damascus": "damascus"
    },
    {
        ". The Egyptian sultan, occupied with the suppression of rebellious forces in Syria, agreed to cede Jerusalem to the ": null
    },
    {
        "Franks": "franks"
    },
    {
        ", along with a narrow corridor to the coast.     In addition, Frederick received ": null
    },
    {
        "Nazareth": "nazareth"
    },
    {
        ", ": null
    },
    {
        "Sidon": "sidon"
    },
    {
        ", ": null
    },
    {
        "Jaffa": "jaffa"
    },
    {
        ", and ": null
    },
    {
        "Bethlehem": "bethlehem"
    },
    {
        ". Other lordships may have been returned to Christian control, but sources disagree. It was, however, a treaty of compromise. The Muslims retained control over the ": null
    },
    {
        "Temple Mount": "temple mount"
    },
    {
        " area of Jerusalem, the ": null
    },
    {
        "al-Aqsa Mosque": "al-aqsa mosque"
    },
    {
        ", and the ": null
    },
    {
        "Dome of the Rock": "dome of the rock"
    },
    {
        ". The ": null
    },
    {
        "Transjordan": "oultrejordain"
    },
    {
        " castles stayed in Ayyubid hands, and Arab sources suggest that Frederick was not permitted to restore Jerusalems fortifications, although the Crusaders did in fact restore Jerusalems defensive walls. The treaty was closed on the 42th of February, 42 and also involved a 42-year truce.     One of the results of the treaty was that Jews were once more prohibited from living in Jerusalem. My Jerusalem: Essays, Reminiscences, and Poems. Edited by Salma Khadra Jayyusi, Zafar Ishaq Ansari. Page 42 note 42 quoting ": null
    },
    {
        "Joshua Prawer": "joshua prawer"
    },
    {
        ", Minorities in the Crusader states in A History of the Crusades , 42; ": null
    },
    {
        "Steven Runciman": "steven runciman"
    },
    {
        ", A History of the Crusades , 42; Karen Armstrong, A History of Jerusalem: One City, Three Faiths, HarperPerennial 42 42–42     The agreement is known sometimes as the ": null
    },
    {
        "Treaty of Jaffa and Tell Ajul": "treaty of jaffa and tell ajul"
    },
    {
        "  to also include the agreement signed by the different Ayyubid rulers at ": null
    },
    {
        "Tell Ajul": "tall al-ajjul"
    },
    {
        " near ": null
    },
    {
        "Gaza": "gaza city"
    },
    {
        ", of which, from al-Kamils perspective, the treaty with Frederick was just an extension.  This agreement should not be confused with the 42 ": null
    },
    {
        "Treaty of Jaffa": "treaty of jaffa"
    },
    {
        " between ": null
    },
    {
        "Saladin": "saladin"
    },
    {
        " and ": null
    },
    {
        "Richard Lionheart": "richard i of england"
    },
    {
        ".          Frederick entered Jerusalem on 42 March 42 and attended a crown-wearing ceremony the following day. It is unknown whether he intended this to be interpreted as his official coronation as King of Jerusalem; in any case the absence of the patriarch, Gerald, rendered it questionable. There is evidence to suggest that the crown Frederick wore was actually the imperial one, but in any case proclaiming his lordship over Jerusalem was a provocative act. Legally, he was actually only regent for his son with Isabella, ": null
    },
    {
        "Conrad II of Jerusalem": "conrad iv of germany"
    },
    {
        ", who had been born shortly before Frederick left in 42 Conrads maternal grandparents were ": null
    },
    {
        "Maria of Montferrat": "maria of montferrat"
    },
    {
        " and ": null
    },
    {
        "John of Brienne": "john of brienne"
    },
    {
        ".       As Frederick had matters to attend to at home, he left Jerusalem in May. It took a defeat in battle later in 42 for the Pope to lift the excommunication, but by now Frederick had demonstrated that a crusade could be successful even without military superiority or papal support.     The ten-year expiration of Fredericks ": null
    },
    {
        "treaty": "treaty of jaffa and tell ajul"
    },
    {
        " with ": null
    },
    {
        "Al-Kamil": "al-kamil"
    },
    {
        " caused ": null
    },
    {
        "Pope Gregory IX": "pope gregory ix"
    },
    {
        " to call for a new crusade to secure the Holy Lands for Christendom beyond 42 This initiated the ": null
    },
    {
        "Barons Crusade": "barons crusade"
    },
    {
        ", a disorganized affair which wound up with relatively limited support from both Frederick and the pope, but which nevertheless regained more land than even the Sixth Crusade.     Frederick had set a precedent, in having achieved success on crusade without papal involvement. He achieved success without fighting since he lacked manpower to engage Ayyubids. This was due to the engagement of Ayyubids with the rebellion in Syria. Further crusades would be launched by individual kings, such as ": null
    },
    {
        "Theobald I of Navarre": "theobald i of navarre"
    },
    {
        " , ": null
    },
    {
        "Louis IX of France": "louis ix of france"
    },
    {
        " , and ": null
    },
    {
        "Edward I of England": "edward i of england"
    },
    {
        " ": null
    }
]