[
    {
        "Sjöbo Municipality  is a ": null
    },
    {
        "municipality": "municipalities of sweden"
    },
    {
        " in ": null
    },
    {
        "Skåne County": "skåne county"
    },
    {
        " in southern ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ". Its seat is located in the town ": null
    },
    {
        "Sjöbo": "sjöbo"
    },
    {
        ".     The present municipality was created in 42 when the former market town  Sjöbo was amalgamated with the surrounding rural municipalities. There are fifteen original entities within todays municipality.       There are 42 ": null
    },
    {
        "urban area": "urban areas in sweden"
    },
    {
        "s in Sjöbo Municipality.     In the table they are listed according to the size of the population as of December 42 42 The municipal seat is in bold characters.                       The town of ": null
    },
    {
        "Sjöbo": "sjöbo"
    },
    {
        " has flat terrain, with many small houses and three long straight streets stretching through it, leading to larger roads.     The northwestern part of the municipality includes the main part of ": null
    },
    {
        "Vombsjön": "vombsjön"
    },
    {
        ", the largest lake of southern ": null
    },
    {
        "Scania": "scania"
    },
    {
        " and notable for being the water source of ": null
    },
    {
        "Malmö": "malmö"
    },
    {
        ". Some parts of the lake belong to ": null
    },
    {
        "Lund Municipality": "lund municipality"
    },
    {
        ". It offers fishing for ": null
    },
    {
        "European perch": "european perch"
    },
    {
        ", ": null
    },
    {
        "pike": "esox"
    },
    {
        ", ": null
    },
    {
        "pikeperch": "pikeperch"
    },
    {
        " and ": null
    },
    {
        "eel": "eel"
    },
    {
        ".       There are at least five authentic medieval churches from the 42th century in the municipality . They are notable for not having undergone the severe restorations that many other churches in Scania suffered once the population began growing in the second half of the 42th century and ": null
    },
    {
        "Helgo Zetterwall": "helgo zetterwall"
    },
    {
        " was hired to expand on them.     Frescos which adorned the apse of Södra Åsum church and the ceilings of the churches in Everlöv and Illstrop centuries ago have been slowly uncovered in recent years. Many similar churches had their ornamentation stripped and their paintings plastered over as part of the iconoclasm of Swedens adoption of ": null
    },
    {
        "Lutheranism": "lutheranism"
    },
    {
        ".     Apart from religious activities, there is the annual festival Sjöbo marknad, which translates to English as Sjöbo fair. It was first held in 42 and is now held in late July, attracting some 42 visitors, making it one of the largest country fairs in ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        ". It has ": null
    },
    {
        "carousel": "carousel"
    },
    {
        "s and is otherwise noted for its ": null
    },
    {
        "pottery": "pottery"
    },
    {
        " vendors and trade.          Sjöbo Municipality reached the public eye in ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        " in 42 when, under the leadership of the Municipal Commissioner ": null
    },
    {
        "Sven-Olle Olsson": "sven-olle olsson"
    },
    {
        ", it voted by a majority of 42% in a ": null
    },
    {
        "referendum": "referendum"
    },
    {
        " that it would not accept foreign ": null
    },
    {
        "asylum seeker": "refugee"
    },
    {
        "s. Most other municipalities in Sweden accepted refugees that came from troubled countries such as former ": null
    },
    {
        "Yugoslavia": "yugoslavia"
    },
    {
        " and ": null
    },
    {
        "Iraq": "iraq"
    },
    {
        ".       These are the results of elections held since the 42 municipal reform. In 42 Sjöbo Municipality became the first municipality in Sweden where the ": null
    },
    {
        "Sweden Democrats": "sweden democrats"
    },
    {
        " held the largest share of the votes. The high number of missing votes from the list from 42 belonged to the ": null
    },
    {
        "Sjöbo Party": "sjöbo party"
    },
    {
        ". The Sweden Democrats numbers in 4242 were not listed at a municipal level by the ": null
    },
    {
        "SCB": "statistiska centralbyrån"
    },
    {
        " due to the partys small size domestically.     ": null
    },
    {
        "Riksdag": "riksdag"
    }
]