[
    {
        "     A skip zone, also called a silent zone or zone of silence, is a region where a radio transmission can not be received. The zone is located between regions both closer and farther from the transmitter where reception is possible.       When using medium to high frequency radio ": null
    },
    {
        "telecommunication": "telecommunication"
    },
    {
        ", there are ": null
    },
    {
        "radio waves": "radio wave"
    },
    {
        " which travel both parallel to the ground, and towards the ": null
    },
    {
        "ionosphere": "ionosphere"
    },
    {
        ", referred to as a ": null
    },
    {
        "ground wave": "ground wave"
    },
    {
        " and ": null
    },
    {
        "sky wave": "sky wave"
    },
    {
        ", respectively. A skip zone is an annular region between the farthest points at which the ground wave can be received and the nearest point at which the refracted sky waves can be received. Within this region, no signal can be received because, due to the conditions of the local ionosphere, the relevant sky waves are not reflected but penetrate the ionosphere.     The skip zone is a ": null
    },
    {
        "natural phenomenon": "natural phenomenon"
    },
    {
        " that cannot be influenced by technical means. Its width depends on the height and shape of the ionosphere and, particularly, on the local ionospheric maximum electron density characterized by critical frequency f o F 42 . It varies mainly with this parameter, being larger for low f o F 42 . With a fixed working frequency it is large by night and may even disappear by day. Transmitting at night is most effective for long distance communication but the skip zone becomes significantly larger.   ": null
    },
    {
        "very high frequency": "very high frequency"
    },
    {
        " waves and higher normally travel through the ionosphere wherefore communication via skywave is exceptional. A highly ionized Es-Layer that occasionally may appear in summer may produce such an example.          A method of decreasing the skip zone is by decreasing the frequency of the radio waves. Decreasing the frequency is akin to increasing the ionospheric width. A point is eventually reached when decreasing the frequency results in a zero distance skip zone. In other words, a frequency exists for which vertically incident radio waves will always be refracted back to the Earth. This frequency is equivalent to the ionospheric plasma frequency and is also known as the ionospheric critical frequency, or f o F 42 .       Skip zone is the subject of a film SKIPZONE made in 42 by UK artist, Peter Lee-Jones. It refers to areas in Scottish Highlands where it is difficult to obtain radio and TV reception.": null
    }
]