[
    {
        "      The skull crucible process was developed at the ": null
    },
    {
        "Lebedev Physical Institute": "lebedev physical institute"
    },
    {
        " in ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        " to manufacture ": null
    },
    {
        "cubic zirconia": "cubic zirconia"
    },
    {
        ". It was invented to solve the problem of cubic zirconias melting-point being too high for even platinum ": null
    },
    {
        "crucible": "crucible"
    },
    {
        "s.     In essence, by heating only the center of a volume of cubic zirconia, the material forms its own crucible from its cooler outer layers. The term skull refers to these outer layers forming a shell enclosing the molten volume. ": null
    },
    {
        "Zirconium oxide": "zirconium oxide"
    },
    {
        " powder is heated then gradually allowed to cool. Heating is accomplished by ": null
    },
    {
        "radio frequency induction": "radio frequency induction"
    },
    {
        " using a coil wrapped around the apparatus. The outside of the device is ": null
    },
    {
        "water-cooled": "water jacket"
    },
    {
        " in order to keep the radio frequency coil from melting and also to cool the outside of the zirconium oxide and thus maintain the shape of the zirconium powder.     Since zirconium oxide in its solid state ": null
    },
    {
        "does not conduct": "insulator"
    },
    {
        " electricity, a piece of ": null
    },
    {
        "zirconium": "zirconium"
    },
    {
        " metal is placed inside the gob of zirconium oxide. As the zirconium melts it oxidizes and blends with the now molten zirconium oxide, a ": null
    },
    {
        "conductor": "electrical conductor"
    },
    {
        ", and is heated by radio frequency induction.     When the zirconium oxide is melted on the inside the amplitude of the RF induction coil is gradually reduced and ": null
    },
    {
        "crystal": "crystal"
    },
    {
        "s form as the material cools. Normally this would form a ": null
    },
    {
        "monoclinic crystal system": "monoclinic crystal system"
    },
    {
        " of zirconium oxide.     In order to maintain a ": null
    },
    {
        "cubic crystal system": "cubic crystal system"
    },
    {
        " a stabilizer is added, ": null
    },
    {
        "magnesium oxide": "magnesium oxide"
    },
    {
        ", ": null
    },
    {
        "calcium oxide": "calcium oxide"
    },
    {
        " or ": null
    },
    {
        "yttrium oxide": "yttrium oxide"
    },
    {
        " as well as any material to color the crystal. After the mixture cools the outer shell is broken off and the interior of the gob is then used to manufacture ": null
    },
    {
        "gemstone": "gemstone"
    },
    {
        "s.       ": null
    }
]