[
    {
        "Slavery and States Rights was a speech given by former ": null
    },
    {
        "Confederate States Army": "confederate states army"
    },
    {
        " general ": null
    },
    {
        "Joseph Wheeler": "joseph wheeler"
    },
    {
        " on July 42 42 The speech deals with the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        " and is considered to be a ": null
    },
    {
        "Lost Cause": "lost cause of the confederacy"
    },
    {
        " view at the wars causation. It is generally understood to argue that the ": null
    },
    {
        "Union": "union"
    },
    {
        " was to blame for the war, and ": null
    },
    {
        "downplays slavery": "historical_negationismconfederate_revisionism"
    },
    {
        " as a cause.       The ": null
    },
    {
        "Richmond, Virginia": "richmond, virginia"
    },
    {
        "  Dispatch  stated, The ": null
    },
    {
        "House of Representatives": "united states house of representatives"
    },
    {
        " being in Committee of the Whole, on ": null
    },
    {
        "appropriations and expenditures": "appropriations and expenditures"
    },
    {
        ", and having under consideration the ": null
    },
    {
        "bill": "bill"
    },
    {
        " to remove the charge of ": null
    },
    {
        "desertion": "desertion"
    },
    {
        " standing against ": null
    },
    {
        "Patrick Kelleher": "patrick kelleher"
    },
    {
        ", late ": null
    },
    {
        "private": "private"
    },
    {
        ", ": null
    },
    {
        "Company C": "38th illinois volunteers"
    },
    {
        ", ": null
    },
    {
        "Thirty-eighth Illinois Volunteers": "38th illinois volunteers"
    },
    {
        ", Mr. Wheeler, of ": null
    },
    {
        "Alabama": "alabama"
    },
    {
        ", as a member of the ": null
    },
    {
        "Committee on Military Affairs": "united states house committee on military affairs"
    },
    {
        ", made a speech.     In his speech, Wheeler argued that the North, prior to the Civil War, had failed to comply with the terms of the ": null
    },
    {
        "Constitution": "united states constitution"
    },
    {
        ". In particular, he argued that ": null
    },
    {
        "slaves": "slaves"
    },
    {
        " were ": null
    },
    {
        "property": "property"
    },
    {
        " and that Northern states had infringed on the constitutional property rights of the ": null
    },
    {
        "slaveholder": "slaveholder"
    },
    {
        "s. He also argued that not only had the North encouraged ": null
    },
    {
        "secession": "secession"
    },
    {
        ", but that in the past it had, itself, sought secession, and thus that secession was a right of the ": null
    },
    {
        "South": "confederate states of america"
    },
    {
        ". In an aside, Wheeler insinuated that the North was to blame for slavery.       Wheeler explains , I refute allegations that the responsibility of the war rested altogether upon the southern people. Many States of the North enacted laws making it a ": null
    },
    {
        "criminal": "crime"
    },
    {
        " offence for any official to comply with his oath of office. Wheeler was arguing that the failure of northern states to comply with the ": null
    },
    {
        "fugitive slave laws": "fugitive slave law of 1850"
    },
    {
        " was in violation of the Constitution.      Wheeler quoted ": null
    },
    {
        "Daniel Webster": "daniel webster"
    },
    {
        " in his speech, How absurd it is to suppose that when different parties enter into a compact for certain purposes either can disregard any one provision, and expect, nevertheless, the other to observe the rest!     He also noted from the Constitution, No person held to service or labor in one State under the laws thereof, escaping into another, shall, in consequence of any law or regulation therein, be discharged from such service or labor, but shall be delivered up on claim of the party to whom such service or labor may be due.     He goes on to quote Webster further, If the Northern States refuse, willfully and deliberately, to carry into effect that part of the Constitution which respects the restoration of fugitive slaves, and Congress provides no remedy, the South would no longer be bound to observe the compact.     Wheeler continues, Then followed the election of ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        "...The South was of necessity alarmed. They were seized with the fear that the extreme leaders of the ": null
    },
    {
        "Republican party": "republican party"
    },
    {
        " would not stop at any excess and would deprive them of their property.     Wheeler quotes from Webster, Look at the proceedings of the anti-slavery conventions in ": null
    },
    {
        "Ohio": "ohio"
    },
    {
        ", ": null
    },
    {
        "Massachusetts": "massachusetts"
    },
    {
        ", and at ": null
    },
    {
        "Syracuse": "syracuse, new york"
    },
    {
        ", in the State of ": null
    },
    {
        "New York": "new york"
    },
    {
        ". They pledge their lives, their fortunes, and their sacred honor to violate the Constitution; they pledge their sacred honor to commit ": null
    },
    {
        "treason": "treason"
    },
    {
        "!       Wheeler also argued that northerners were to blame for slavery. He says, When the people of the South settled on the shores of ": null
    },
    {
        "Maryland": "maryland"
    },
    {
        ", ": null
    },
    {
        "Virginia": "virginia"
    },
    {
        ", ": null
    },
    {
        "the Carolinas": "the carolinas"
    },
    {
        ", and ": null
    },
    {
        "Georgia": "georgia"
    },
    {
        ", they had no intention of encouraging or even tolerating the institution of slavery. The thrifty ": null
    },
    {
        "New England": "new england"
    },
    {
        " seamen": "sailor"
    },
    {
        ", solely with the view of ": null
    },
    {
        "profit": "profit"
    },
    {
        ", urged slavery upon all the ": null
    },
    {
        "Colonies": "colony"
    },
    {
        " .     Wheeler continues, ": null
    },
    {
        "Oglethorpe": "james oglethorpe"
    },
    {
        " and his colonists were possibly the most determined in resisting the ": null
    },
    {
        "import": "import"
    },
    {
        "ation, sale and use of African slaves; and for twenty years they were successful in the enforcement of the law which prohibited the landing of slaves in Georgia.     Wheeler adds, The evil of this traffic soon became apparent to the people of the South, and when the Constitution was framed in 42 the South demanded that the fundamental ": null
    },
    {
        "law": "law"
    },
    {
        " of our land should inhibit this traffic of importing human beings from Africa. The South was resisted by the New England ": null
    },
    {
        "slave-trader": "slave-trader"
    },
    {
        "s.     One might construe that Wheeler was arguing that northern ": null
    },
    {
        "capitalists": "capitalism"
    },
    {
        " first tricked southerners into buying slaves, and then, once the south had heavily invested in this property, the north began to wage what Wheeler referred to as, a war upon the institution of slavery.       Wheeler argued that the right of the South to ": null
    },
    {
        "secede": "secession"
    },
    {
        " from the ": null
    },
    {
        "Union": "united states"
    },
    {
        " was clearly a historically proven right.     Wheeler quotes ": null
    },
    {
        "Horace Greeley": "horace greeley"
    },
    {
        ", If the ": null
    },
    {
        "Declaration of Independence": "united states declaration of independence"
    },
    {
        " justifies the secession from the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        " of three million colonists in 42 we do not see why it would not justify the secession of five millions of southerns from the ": null
    },
    {
        "Federal Union": "federal union"
    },
    {
        " in 42     He also mentions the ": null
    },
    {
        "Shay Rebellion": "shay rebellion"
    },
    {
        " in ": null
    },
    {
        "Massachusetts": "massachusetts"
    },
    {
        ", the ": null
    },
    {
        "Whiskey Rebellion": "whiskey rebellion"
    },
    {
        " in ": null
    },
    {
        "Pennsylvania": "pennsylvania"
    },
    {
        ", the ": null
    },
    {
        "Dorr Rebellion": "dorr rebellion"
    },
    {
        " in ": null
    },
    {
        "Rhode Island": "rhode island"
    },
    {
        ", and the ": null
    },
    {
        "Hartford Convention": "hartford convention"
    },
    {
        " in ": null
    },
    {
        "Connecticut": "connecticut"
    },
    {
        ".     Wheeler adds, For more than half a century the South had been taught by their northern brethren that when the people of a State found that it was not to their advantage to remain in the Union it was not only their privilege but their duty to peacefully withdraw from it.     Wheeler then quoted from ": null
    },
    {
        "John Quincy Adams": "john quincy adams"
    },
    {
        ", If the day should ever come when the affections of the people of these States shall be alienated from each other...far better will it be for the people of the disunited States to part in friendship from each other than to be held together by constraint.     Wheeler notes, Mr. Adams and the people of New England generally regarded these views as the correct interpretation of the original compact which bound the people together.     Wheeler adds , Three years later, on January 42 42 Mr. Adams presented the petition of sundry citizens of ": null
    },
    {
        "Haverhill": "haverhill, massachusetts"
    },
    {
        ", in the State of Massachusetts, praying that Congress will immediately adopt measures favorably to dissolve the union of these States.     Wheeler continues, On page 42 Adams spoke, I hold that it is no perjury, that it is no high-treason, but the exercise of a sacred right to offer such a petition.     Wheeler goes on, ": null
    },
    {
        "Mr. Gilmer": "john adams gilmer"
    },
    {
        ", page 42 introduced the following resolution: Resolved, That in presenting to the consideration of this House a petition for the dissolution of the Union, the member from Massachusetts has justly incurred the censure of this House.     Wheeler went on to argue that the failure of the House to pass Gilmers resolution was a clear demonstration that the house agreed with Adamss statements.     Wheeler also read from the ": null
    },
    {
        "Acts and resolutions passed by the Legislature of Massachusetts in the year 42": "acts and resolutions passed by the legislature of massachusetts in the year 1844"
    },
    {
        " , page 42 42 Resolved, That the project of the annexation of ": null
    },
    {
        "Texas": "texas"
    },
    {
        ", unless arrested on the threshold, may drive these States into a dissolution of the Union.       The final part of Wheelers speech treated of the sentiments of the Northern press. He argued that the North had clearly indicated that the South was free to secede.     From the  New York Tribune , of November 42 42 If the ": null
    },
    {
        "cotton": "cotton"
    },
    {
        " States shall become satisfied that they can do better out of the Union than in it, we insist on letting them go in peace. We hope never to live in a republic whereof one section is pinned to the residue by ": null
    },
    {
        "bayonet": "bayonet"
    },
    {
        "s.     From the Tribune, of November 42 If the fifteen slave States, or even the eight cotton States alone, shall quietly, decisively say to the rest: We prefer to be henceforth separated from you, we shall insist that they be permitted to go in peace. Whenever the people of the cotton States shall have definitely and decisively made up their minds to separate from the rest of us, we shall urge that the proper steps be taken to give full effect to their decision.     And from the Tribune of November 42 Whenever the slave States or the cotton States only shall unitedly and coolly say to the rest, We want to get out of the Union , we shall urge that their request be acceded to.     From the  New York Herald  of November 42 Coercion, in any event, is out of the question. A union held together by the bayonet would be nothing better than a military despotism.     From the Herald of November 42 We have no desire to prevent secession by coercion.     From the  New York Daily Tribune  of November 42 We insist that they cannot be prevented, and that the attempt must not be made. If you choose to leave the Union, leave it. If you are better by yourselves, go.     From the  New York Times  of December 42 Wheeler quoted ": null
    },
    {
        "Horace Greeley": "horace greeley"
    },
    {
        ": If seven or eight contiguous States shall present themselves authentically at Washington, saying: We hate the Federal Union; we have withdrawn from it; we will give you the choice between acquiescing in our secession and arranging amicably all incidental questions on the one hand, and attempting to subdue us on the other, we could not stand up for coercion, for subjugation, for we do not think it would be just.     Greeley was an ": null
    },
    {
        "abolition": "abolitionism in the united states"
    },
    {
        "ist, and Wheeler continued, We hold the right of self-government even when invoked in behalf of those who deny it to others. Any attempt to compel them by force would be contrary to the fundamental ideas on which human liberty is based. If the slave States, the cotton States, or the gulf States choose to form an independent nation, they have a clear, moral right to do so.     Wheeler then read from the Commercial, , We are not in favor of retaking the property of the United States now in possession of the seceders.     Wheeler quoted from ": null
    },
    {
        "General": "general"
    },
    {
        " Winfield Scott": "winfield scott"
    },
    {
        ", Wayward sisters, part in peace.     Wheeler stated, In obedience to all this advice, the Southern States did secede, and almost immediately the vast Federal armies were raised.     Wheeler ended his speech by describing the magnitude of ": null
    },
    {
        "casualties": "casualty"
    },
    {
        " killed in the ": null
    },
    {
        "war": "american civil war"
    },
    {
        ". ": null
    }
]