[
    {
        "           Sleaford  is a ": null
    },
    {
        "market town": "market town"
    },
    {
        " and ": null
    },
    {
        "civil parish": "civil parishes in england"
    },
    {
        " in ": null
    },
    {
        "Lincolnshire": "lincolnshire"
    },
    {
        ", England. Since 42 the parish boundaries have included ": null
    },
    {
        "Quarrington": "quarrington, lincolnshire"
    },
    {
        " to the south-west, ": null
    },
    {
        "Holdingham": "holdingham, lincolnshire"
    },
    {
        " to the north and ": null
    },
    {
        "Old Sleaford": "old sleaford"
    },
    {
        " to the east – contiguous settlements and former civil parishes which, with New Sleaford, had formed an ": null
    },
    {
        "Urban District": "urban district"
    },
    {
        ". The town is on the edge of the fertile ": null
    },
    {
        "Fenlands": "the fens"
    },
    {
        ", about  north-east of ": null
    },
    {
        "Grantham": "grantham"
    },
    {
        ",  west of ": null
    },
    {
        "Boston": "boston, lincolnshire"
    },
    {
        ", and  south of ": null
    },
    {
        "Lincoln": "lincoln, england"
    },
    {
        ". With a population of 42 at the ": null
    },
    {
        "42 Census": "united kingdom census 2011"
    },
    {
        ", the town is the largest settlement in the ": null
    },
    {
        "North Kesteven": "north kesteven"
    },
    {
        " district. Bypassed by the ": null
    },
    {
        "A42": "a17 road"
    },
    {
        " and the ": null
    },
    {
        "A42": "a15 road"
    },
    {
        ", it is connected to Lincoln, ": null
    },
    {
        "Newark": "newark-on-trent"
    },
    {
        ", ": null
    },
    {
        "Peterborough": "peterborough"
    },
    {
        " and ": null
    },
    {
        "Kings Lynn": "kings lynn"
    },
    {
        ". ": null
    },
    {
        "Sleaford railway station": "sleaford railway station"
    },
    {
        " is on the ": null
    },
    {
        "Nottingham to Skegness ": "grantham to skegness line"
    },
    {
        " and ": null
    },
    {
        "Peterborough to Lincoln Line": "peterborough to lincoln line"
    },
    {
        "s.     The first settlement formed in the ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " where a prehistoric track crossed the ": null
    },
    {
        "River Slea": "river slea"
    },
    {
        ". It was a tribal centre and home to a mint for the ": null
    },
    {
        "Corieltauvi": "corieltauvi"
    },
    {
        " in the 42st centuries BC and AD. Evidence of ": null
    },
    {
        "Roman": "roman britain"
    },
    {
        " and ": null
    },
    {
        "Anglo-Saxon": "anglo-saxon england"
    },
    {
        " settlement has been uncovered. In the medieval period, records differentiate between Old and New Sleaford, the latter emerging by the 42th century around the present-day market place and ": null
    },
    {
        "St Denys Church": "st denys church, sleaford"
    },
    {
        "; ": null
    },
    {
        "Sleaford Castle": "sleaford castle"
    },
    {
        " was also built at that time for the ": null
    },
    {
        "Bishops of Lincoln": "bishop of lincoln"
    },
    {
        ", who owned the manor. Granted the right to hold a market in the mid42th century, New Sleaford developed into a market town and became locally important in the wool trade, while Old Sleaford declined.     From the 42th century, the landowners were the Carre family, who operated tight control over the town, and it grew little in the early modern period. The manor passed from the Carre family to the ": null
    },
    {
        "Hervey family": "marquess of bristol"
    },
    {
        " by the marriage of Isabella Carre to ": null
    },
    {
        "John Hervey, 42st Earl of Bristol": "john hervey, 1st earl of bristol"
    },
    {
        ", in 42 The towns ": null
    },
    {
        "common land": "common land"
    },
    {
        " and fields were legally ": null
    },
    {
        "enclosed": "enclosed"
    },
    {
        " by 42 giving ownership mostly to the Hervey family; this coincided with the Sleas canalisation; the ": null
    },
    {
        "Sleaford Navigation": "sleaford navigation"
    },
    {
        " brought economic growth until it was superseded by the railways in the mid42s. In the 42th century, the sale of farmland around Sleaford by Bristol Estates led to the development of large housing estates. The subsequent availability of affordable housing combined with the towns educational facilities and low crime rates made it an attractive destination for home-buyers. As a result, the towns population underwent the fastest growth of any town in the county in the 42s.     Sleaford was primarily an agricultural town until the 42th century, supporting a cattle market, with seed companies, such as Hubbard and Phillips, and Sharpes International Seeds, being established in the late 42th century. The arrival of the railway made the town favourable for malting. Industry has declined, and in 42 the most common occupations are in wholesale and retail trade, health and social care, public administration and defence and manufacturing. Regeneration of the town centre has led to the redevelopment of the old industrial areas, including the construction of ": null
    },
    {
        "the National Centre for Craft & Design": "the national centre for craft  &  design"
    },
    {
        " on an old wharf.           The earliest records of the place-name Sleaford are found in a charter of 42 as Slioford and in the ": null
    },
    {
        "Anglo-Saxon Chronicle": "anglo-saxon chronicle"
    },
    {
        " as Sliowaford. In the  Domesday Book  , it is recorded as Eslaforde and in the early 42th century as Sliforde. In the 42th century  Book of Fees  the name appears as Lafford. Creasey 42 p. 42 The name is formed from the ": null
    },
    {
        "Old English": "old english"
    },
    {
        " words sliow and ford, which together mean ford over a muddy or slimy river. Ekwall 42 p. 42          Archaeological material from the ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        " and earlier has been recovered and excavations have shown that there was unsustained late-": null
    },
    {
        "Neolithic": "neolithic"
    },
    {
        " and Bronze Age human activity in the vicinity. Mahany and Roffe 42 p. 42 Phillips 42 p. 42 The earliest known permanent settlement dates from the ": null
    },
    {
        "Iron Age": "iron age"
    },
    {
        " and began where a track running northwards from ": null
    },
    {
        "Bourne": "bourne, lincolnshire"
    },
    {
        " crossed the River Slea. Although only sparse pottery evidence has been found for the middle Iron Age period, 42 pellet mould fragments, likely used for minting and dated to 42  BC–AD 42 have been uncovered south east of the modern town centre, south of a crossing of the River Slea and near Mareham Lane in Old Sleaford. The largest of its kind in Europe, the deposit has led archaeologists to consider that the site in Old Sleaford was probably one of the largest ": null
    },
    {
        "Corieltauvi": "corieltauvi"
    },
    {
        "an settlements during this period and may have been a tribal centre. May 42 pp. 42–42     During the ": null
    },
    {
        "Roman occupation of Britain": "roman britain"
    },
    {
        " , the settlement was extensive and of considerable importance. Mahany and Roffe 42 p. 42 Its location along the fen-edge may have made it economically and administratively significant as a centre for managers and owners of fenland estates. Mahany and Roffe 42 pp. 42–42 There is evidence to suggest that a road connected Old Sleaford to ": null
    },
    {
        "Heckington": "heckington"
    },
    {
        " , where Roman tile kilns have been uncovered and may imply the presence of a market at Sleaford. Mahany and Roffe 42 p. 42 When the first roads were constructed by the Romans, Sleaford was bypassed due to it being less conveniently located and more geared to native needs . Burnham and Wacher 42 p. 42 A smaller road, ": null
    },
    {
        "Mareham Lane": "mareham lane"
    },
    {
        ", which the Romans renewed, ran through Old Sleaford, and southwards along the fen edge, towards Bourne. Where it passed through Old Sleaford, excavations have revealed a large stone-built domestic residence, associated farm buildings, corn-driers, ovens and field systems, all from the Roman period, and a number of burials. . Heritage Gateway. Retrieved 42 November 42 Other Roman remains, including a burial, have been excavated in the town. . ": null
    },
    {
        "BBC News": "bbc news"
    },
    {
        ". 42 February 42 Retrieved 42 November 42 . Archaeological Project Services. Retrieved 42 November 42            There is little evidence of continuous settlement between the late Roman and ": null
    },
    {
        "Anglo-Saxon": "anglo-saxon england"
    },
    {
        " periods but the Saxons did establish themselves eventually. South of the modern town, a 42th–42th century cemetery has been uncovered containing an estimated 42 burials, many showing signs of ": null
    },
    {
        "pagan": "paganism"
    },
    {
        " burial rites.  The now ruined Church of St Giles/All Saints at Old Sleaford has been discovered and excavations of the market place in 42 uncovered Anglo-Saxon remains from the 42th–42th centuries, indicating some form of enclosure with domestic features. . Heritage Gateway. Retrieved 42 November 42 The earliest documentary reference to Sleaford is in a charter from the 42th century, Mahany and Roffe 42 p. 42 when it was owned by Medehamstede Abbey in ": null
    },
    {
        "Peterborough": "peterborough"
    },
    {
        ", a ": null
    },
    {
        "Mercia": "mercia"
    },
    {
        "n royal foundation. Pawley 42 p. 42 There is little evidence of estate structure until the late Saxon period, but there may have been a market and court in pre-": null
    },
    {
        "Conquest": "norman conquest of england"
    },
    {
        " Sleaford and it was probably an economic and jurisdictional centre for surrounding settlements. Mahany and Roffe 42 pp. 42–42 The Slea played an important role in the towns economy: it never ran dry nor froze, and by the 42th century a dozen ": null
    },
    {
        "watermill": "watermill"
    },
    {
        "s lined its banks. The mills and others in nearby ": null
    },
    {
        "Quarrington": "quarrington, lincolnshire"
    },
    {
        " and the lost hamlet of Millsthorpe, constituted the most important mill cluster in Lincolnshire . Pawley 42 pp. 42–42; Quarrington means settlement of the millers .     Later in the Middle Ages, the Romano-British settlement became known as Old Sleaford , while New Sleaford was used to describe the settlement centred on ": null
    },
    {
        "St Denys Church": "st denys church, sleaford"
    },
    {
        " and the market place. Mahany and Roffe 42 pp. 4242 The  Domesday Book  has two entries under Eslaforde recording land held by ": null
    },
    {
        "Ramsey Abbey": "ramsey abbey"
    },
    {
        " and the ": null
    },
    {
        "Bishop of Lincoln": "bishop of lincoln"
    },
    {
        ". The location of the manors recorded in Domesday is not made clear in the text. One theory endorsed by ": null
    },
    {
        "Maurice Beresford": "maurice beresford"
    },
    {
        " is that they focused on the settlement at Old Sleaford because of evidence that New Sleaford was planted in the 42th century by the bishop to increase his income, which was associated with the construction of ": null
    },
    {
        "Sleaford Castle": "sleaford castle"
    },
    {
        " between 42 and 42 Mahany and Roffe 42 p. 42 Beresfords theory has been criticised by the local historians Christine Mahany and David Roffe who have reinterpreted the Domesday material and argued that in 42 the Bishops manor included the church and associated settlement which became New Sleaford. Mahany and Roffe 42 pp. 42–42 Pawley 42 pp. 42–42     The right to hold a fair on the feast day of St Denis was granted by a charter of King ": null
    },
    {
        "Stephen": "stephen, king of england"
    },
    {
        " to ": null
    },
    {
        "Alexander, Bishop of Lincoln": "alexander, bishop of lincoln"
    },
    {
        ", in 42–42 Between 42 and 42 ": null
    },
    {
        "Henry II": "henry ii of england"
    },
    {
        " granted the bishop of Lincoln the right to hold a market at Sleaford; bishop ": null
    },
    {
        "Oliver Sutton": "oliver sutton"
    },
    {
        " argued in 42 that his right to hold a market and fair had existed since time immemorial. In 42 ": null
    },
    {
        "Edward III": "edward iii of england"
    },
    {
        " confirmed the market and, in 42 ": null
    },
    {
        "Henry IV": "henry iv of england"
    },
    {
        " granted the bishop fairs on the feast days of St Denis and St Peters Chains. Samantha Letters. . Gazetteer of Markets and Fairs in England and Wales to 42. Centre for Metropolitan Studies. Retrieved 42 November 42 A survey of 42 is the first to mention ": null
    },
    {
        "burgage": "burgage"
    },
    {
        " tenure; Beresford 42 p. 42; the survey was examined in Hosford 42 tenants in the nearby hamlet of Holdingham held tofts with other land, while those in New Sleaford held only tofts, indicating that ": null
    },
    {
        "demesne": "demesne"
    },
    {
        " farming centred on the hamlet. Mahany and Roffe 42 p. 42 The town later had at least two ": null
    },
    {
        "guild": "guild"
    },
    {
        "s comparable to those found in developed towns. Hosford 42 p. 42 However, there was no formal charter outlining the towns freedoms; Pawley 42 p. 42 it was not a centre of trade and tight control by the bishops meant the economy was primarily geared to serve them. Hence, it retained a strong tradition of demesne farming well into the 42th century. Pawley 42 p. 42 Mahany and Roffe 42 pp. 42–42 As the economic initiative fell more to the burgesses and middlemen who formed connections with nearby towns, such as ": null
    },
    {
        "Boston": "boston, lincolnshire"
    },
    {
        ", evidence suggests that Sleaford developed a locally important role in the wool trade. Mahany and Roffe 42 p. 42 Pawley 42 p. 42 In the Lay Subsidy of 42 New Sleaford was the wealthiest settlement in the Flaxwell ": null
    },
    {
        "wapentake": "hundred"
    },
    {
        ", with a value of £42 42s. 42d. 42 / 42 d.  Heritage Gateway. Retrieved 42 November 42 Meanwhile, Old Sleaford, an insignificant place since the end of the Roman period, declined and may have been deserted by the 42th century.  Lincs to the Past . Retrieved 42 November 42 Pawley 42 p. 42            During the late 42th and early 42th centuries, the Hussey family owned the manor of Old Sleaford. ": null
    },
    {
        "John Hussey, 42st Baron Hussey of Sleaford": "john hussey, 1st baron hussey of sleaford"
    },
    {
        " was executed for treason for his part in the ": null
    },
    {
        "Lincolnshire Rising": "pilgrimage of grace"
    },
    {
        ". The manor and his residence at Old Place reverted to the Crown and were later sold to Robert Carre. Trollope 42 pp. 42–42 Pawley 42 pp. 42–42 George Carre or Carr from Northumberland had settled in Sleaford by 42 when he was described as a wool merchant. Trollope 42 pp. 42–42 Pawley 42 p. 42 His son Robert bought Husseys land and the castle and manor of New Sleaford from ": null
    },
    {
        "Edward Clinton, 42st Earl of Lincoln": "edward clinton, 1st earl of lincoln"
    },
    {
        ". Trollope 42 pp. 42–42  His eldest surviving son Robert, founded ": null
    },
    {
        "Carres Grammar School": "carres grammar school"
    },
    {
        " in 42 and his youngest son Edward was created a ": null
    },
    {
        "baronet": "carr baronets"
    },
    {
        "; his son founded Sleaford Hospital in 42 Trollope 42 pp. 42–42 The last male descendant died in 42 and the heiress, Isabella Carre, married ": null
    },
    {
        "John Hervey, Earl of Bristol": "john hervey, 1st earl of bristol"
    },
    {
        ", in whose family the estates remained until the 42s. Trollope 42 p. 42 Pawley 42 p. 42 The Carres and Herveys had a strong influence: in addition to extracting dues from their tenants, they took leading tradesmen to the ": null
    },
    {
        "Exchequer Court": "exchequer court"
    },
    {
        " to gain legal force behind their monopoly on charging tolls on market and cattle traders and for driving animals through the town. Pawley 42 pp. 42–42     Industry was slow to take hold, and by the second half of the 42th century, ": null
    },
    {
        "Cogglesford Mill": "cogglesford mill"
    },
    {
        " was the only working corn mill in the town. Pawley 42 pp. 42–42 An old mill at the junction of Westgate and Castle Causeway supplied hemp to the growing rope-making business of the Foster and Hill families. As local historian Simon Pawley wrote, in many respects, things had changed little since the survey of 42 , with few of the buildings or infrastructure being improved. Pawley 42 p. 42 Major changes to agriculture and industry took place in the last decade of that century. From the Middle Ages, Sleaford was surrounded by three ": null
    },
    {
        "open fields": "open field system"
    },
    {
        ": North, West and Sleaford Fields. At the ": null
    },
    {
        "enclosure": "enclosure"
    },
    {
        " of the open fields in 42 more than 42% of the 42  acres of open land was owned by Lord Bristol. Despite the costs of fencing and re-organising the fields, the system was easier to farm, and cottages were built closer to fields, while the landowner could charge more rent owing to the increased profitability of the land; those who lost out were the cottagers, who could no longer keep a few animals grazing on the common land at no cost. Pawley 42 p. 42 The process allowed the land boundaries and pathways to be tidied up; Drove Lane, which ran to Rauceby, was shifted north and straightened.            Canalisation of the River Slea began in the 42s. ": null
    },
    {
        "Canal": "canal"
    },
    {
        "s in England were constructed from the 42s to make inland trade easier; Sleafords businessmen were keen to benefit from the improved communication they allowed. ": null
    },
    {
        "Sleaford Navigation": "sleaford navigation"
    },
    {
        " opened in 42  Sleaford Navigation Trust. Retrieved 42 November 42 Archived at the ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        " on . It facilitated the export of agricultural produce to the Midlands, and the import of coal and oil. Mills along the Slea benefited and wharves were constructed around Carre Street. Pawley 42 pp. 42–42 Between 42 and 42 the navigations toll rights increased in value by 42 times.  Sleaford Navigation Trust. Retrieved 42 November 42 Archived at the ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        " on  The railways emerged in the 42th century as an alternative to canals and arrived at the town in 42 when a line from ": null
    },
    {
        "Grantham to Sleaford": "poacher line"
    },
    {
        " opened. Ellis 42 pp. 42–42 42 42  Sleaford Navigation Trust. Retrieved 42 September 42 Archived at the ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        " on . It made agricultural trade easier and improved communication, Ellis 42 pp. 42–42 but led to the decline of the Navigation Company. Income from tolls decreased by 42% between 42 and 42; it made its first loss in 42 and was abandoned in 42 Ellis 42 pp. 42–42 The towns rural location and transport links meant that the late 42th century saw the rise of two local seed merchants: Hubbard and Phillips, and Charles Sharpe; the former took over the Navigation Wharves, and the latter was trading in the US and Europe by the 42s. Pawley 42 p. 42 The railway, Sleafords rural location and its artesian wells, were key factors in the development of the 42-acre ": null
    },
    {
        "Bass & Co": "bass maltings, sleaford"
    },
    {
        " maltings": "malt house"
    },
    {
        " complex at Mareham Lane . . The Heritage Trail. Retrieved 42 September 42     In the first half of the 42th century, Sleafords population more than doubled from 42 in 42 to 42 in 42 . Vision of Britain. Retrieved 42 November 42 Archived at the ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        " on . Coinciding with this is the construction or extension of public buildings, often by the local contractors Charles Kirk and ": null
    },
    {
        "Thomas Parry": "thomas parry"
    },
    {
        ". Pevsner, Harris and Antram 42 pp. 42–42  Lincs to the Past . Retrieved 42 November 42 Archived at the ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        " on . Pawley 42 pp. 42–42 The gasworks opened in 42 to provide gas lighting in the town. Ellis 42 p. 42 Sleafords ": null
    },
    {
        "Poor Law Union": "poor law union"
    },
    {
        " was formed in 42 to cater for the town and the surrounding 42 parishes. The ": null
    },
    {
        "workhouse": "workhouse"
    },
    {
        " was constructed by 42 and could house 42 inmates.  The Workhouse. Retrieved 42 January 42 Despite these advances, the slums around Westgate were over-crowded, lacking sanitation and disease-ridden; the local administration failed to deal with the matter until 42 when a report on the towns public health by the General Board of Health heavily criticised the situation and set up a Local Board of Health to undertake public works. Pawley 42 pp. 42–42 By the 42s, Lord Bristol had allowed clean water to be pumped into the town, but engineering problems and a reluctance to sell land to house the turbines had delayed the introduction of sewers. Pawley 42 pp. 42–42            Although largely undamaged in the ": null
    },
    {
        "First": "world war i"
    },
    {
        " and ": null
    },
    {
        "Second World Wars": "world war ii"
    },
    {
        ", Pawley 42 pp. 42–42; n.b.: a Zeppelin raid passed overhead in 42 Sleaford has close links with the ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        " due to its proximity to several RAF bases, including ": null
    },
    {
        "RAF Cranwell": "raf cranwell"
    },
    {
        " and ": null
    },
    {
        "RAF Waddington": "raf waddington"
    },
    {
        ". Lincolnshires topography—flat and open countryside—and its location on the east of the country made it ideal for the development of Britains airfields, constructed in the First World War. Work began on Cranwell in late 42; it was designated an RAF base in 42 and the ": null
    },
    {
        "RAF College": "royal air force college cranwell"
    },
    {
        " opened in 42 as the worlds first air academy.  Archived at the ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        " on . Formation of RAFC Cranwell . Royal Air Force. Archived at the ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        " on . The ": null
    },
    {
        "Cranwell branch": "cranwell branch"
    },
    {
        " railway linking Sleaford station to the RAF base opened in 42 and closed in 42 Outline History of RAF Cranwell . Royal Air Force Cranwell Apprentices Association, as archived at the ": null
    },
    {
        "Internet Archive": "internet archive"
    },
    {
        " on . Ludlam 42 p. 42 During the Second World War, Lincolnshire was the most significant location for bomber command and ": null
    },
    {
        "Rauceby Hospital": "rauceby hospital"
    },
    {
        ", south-west of Sleaford, was requisitioned by the RAF as a specialist burns unit which plastic surgeon ": null
    },
    {
        "Archibald McIndoe": "archibald mcindoe"
    },
    {
        " regularly visited.     In the inter-war period, Sleafords population remained static, but the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        " in the 42s caused unemployment to rise. Pawley 42 pp. 42–42 Council-housing developments along Drove Lane proved insufficient to house low-income families after the Westgate slums were cleared in the 42s so Jubilee Grove opened in that decade to meet the demand. Pawley 42 p. 42 In the post-war period, there were new housing developments at St Giles Avenue, the Hoplands, Russell Crescent, Jubilee Grove and Grantham Road.  figure 42 Parts of the town were redeveloped: in 42 the Bristol Arms Arcade opened, the Corn Exchange was demolished in the 42s and the Waterside Shopping Precinct opened in 42 as did Flaxwell House, designed to house a department store, though later becoming the national headquarters for ": null
    },
    {
        "Interflora": "interflora"
    },
    {
        ". Pawley 42 pp. 42 42     By 42 the major landowner, ": null
    },
    {
        "Victor Hervey, 42th Marquess of Bristol": "victor hervey, 6th marquess of bristol"
    },
    {
        ", heavily in debt, had sold most of his estates in Sleaford and Quarrington and the estates office closed in 42 Pawley 42 p. 42 Much of the land was sold to property developers and in the following decades saw the construction of residential buildings and a considerable population increase.  According to a council report, the quality of life, low crime rates, relatively low house prices and good-quality education attracted people to the town. From 42 to 42 Sleafords population rose from 42 to 42; the growth rate from 42 to 42 was the fastest of any town in the county.   Its infrastructure struggled to cope, especially with increased traffic congestion; two bypasses around the town and a one-way system were introduced, a process which Simon Pawley argues accelerated the decline of the High Street. In the early 42s, the Single Regeneration Budget of £42 million granted to Sleaford improved the town centre and funded development of the Hub  in the old Navigation wharves area.            Sleaford is the principal ": null
    },
    {
        "market town": "market town"
    },
    {
        " in the ": null
    },
    {
        "North Kesteven": "north kesteven"
    },
    {
        " district of ": null
    },
    {
        "Lincolnshire": "lincolnshire"
    },
    {
        ".  The ": null
    },
    {
        "civil parish": "civil parishes in england"
    },
    {
        " includes the hamlet of Holdingham to the north east and the village of ": null
    },
    {
        "Quarrington": "quarrington, lincolnshire"
    },
    {
        " to the south east, both of which merge with the town.  Note: select Civil Parishes or Communities and search for Sleaford, Lincolnshire . Sleaford lies approximately 42 feet above sea level close to ": null
    },
    {
        "Lincoln Cliff": "lincoln cliff"
    },
    {
        ", a ": null
    },
    {
        "Limestone": "lincolnshire limestone"
    },
    {
        " scarp": "escarpment"
    },
    {
        " running north–south through ": null
    },
    {
        "Lindsey": "lindsey, lincolnshire"
    },
    {
        " and ": null
    },
    {
        "Kesteven": "kesteven"
    },
    {
        ". Elsdon 42 p. 42 The bedrock under the western half of the town belongs to the ": null
    },
    {
        "Great Oolite Group": "great oolite group"
    },
    {
        " of ": null
    },
    {
        "Jurassic": "jurassic"
    },
    {
        " Sandstone": "sandstone"
    },
    {
        ", ": null
    },
    {
        "Limestone": "limestone"
    },
    {
        " and ": null
    },
    {
        "Argillaceous": "argillaceous minerals"
    },
    {
        " rocks formed 42−42 million years ago; ": null
    },
    {
        "Kellaways": "kellaways formation"
    },
    {
        " and ": null
    },
    {
        "Oxford Clay": "oxford clay formation"
    },
    {
        " formations, dated to 42–42 million years ago, underlie the eastern half.  ": null
    },
    {
        "Alluvium": "alluvium"
    },
    {
        " deposits are found along the Sleas course, and Fen sand and gravel are found to the east and south.     The town is on the edge of ": null
    },
    {
        "the Fens": "the fens"
    },
    {
        ", a low-lying region of the East of England which, before drainage from the 42th to the 42th centuries, were marshy and liable to flooding. Draining has revealed nutrient-rich soils and enabled 42% of the land to be cultivated, especially for arable farming, and most of it is graded amongst the most productive farmland in the country.   Two ": null
    },
    {
        "Local Nature Reserves": "local nature reserve"
    },
    {
        " sit within the civil parish boundaries: ": null
    },
    {
        "Lollycocks Field": "lollycocks field"
    },
    {
        ", providing mostly wildflower and wetlands habitats alongside Eastgate, and ": null
    },
    {
        "Mareham Pastures": "mareham pastures"
    },
    {
        ", consisting of wildflower meadows, new woodland, hedges and open grassland.         Lincolnshires position on the east of the British Isles allows for a sunnier and warmer climate relative to the national average, and it is one of the driest counties in the United Kingdom.  Although it may vary depending on altitude and proximity to the coast, the mean average temperature for the East of England is approximately 42  °C to 42  °C; the highest temperature recorded in the region was 42  °C at ": null
    },
    {
        "Cavendish": "cavendish, suffolk"
    },
    {
        " on 42 August 42 On average, the region experiences 42 days of rainfall in winter and 42 in summer, with 42 days of thunder and 42–42 days of hail per year; on 42 August 42 hail the size of golf balls were reported in Sleaford and other parts of central Lincolnshire. Wind tends to affect the north and west of the country more than the East, and Lincolnshire tends to receive no more than 42 days of gale per year ref  /ref ref  /ref ref  /ref  ref /ref ref name :42 /ref ref /ref  ref  /ref ref /ref  ref  /ref ref  /ref  ref /ref  ref name :42 /  ref name whites42 / ref name :42  /ref ref /ref  ref name :42 / ref  /ref ref name Pawley Book of Sleaford p. 42 /ref  ref  /ref ref /ref  ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref  ref  /ref ref  /ref ref /ref  ref  /ref ref  /ref ref  /ref  ref /ref ref  /ref ref  /ref ref  /ref  ref  /ref  ref /ref ref  /ref ref /ref  ref  /ref  ref  /ref ref /ref ref  /ref ref  /ref ref  /ref ref name :42 / ref  /ref ref name :42  /ref  ref name :42 /  ref  /ref ref  /ref  ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref  ref name :42  /ref ref  /ref ref  /ref  ref  /ref ref /ref  ref name :42 / ref  /ref  ref name :42 / ref name :42 /  ref  /ref ref  /ref  ref  /ref ref  /ref  ref name :42 /ref ref  /ref  ref name :42 / ref name :42 / ref name Ellis pp. 42 / ref name :42 /  ref name :42  /ref ref name :42  /ref ref name :42  /ref ref name :42 / ref name :42 / ref name :42 / ref name :42  /ref ref  /ref ref name :42 / ref  /ref ": null
    },
    {
        "ef name :42 /re": "ef name  :13   /re"
    },
    {
        " ref  /ref  ref  /ref  ref /ref  ref name Pawley Book of Sleaford p. 42 /  ref /ref  ref name :42 / ref /ref ref name whites42  /ref  ref  /ref  ref name :42  /ref ref name :42  /ref ref  /ref  ref name Trollope Sleaford pp. 42–42 /ref ref  /ref ref /ref ref  /ref  ref  /ref  ref /ref ref  /ref ref /ref  ref name :42 / ref /ref ref name Pawley Book of Sleaford p. 42 /ref  ref  /ref ref  /ref ref name Pawley Book of Sleaford p. 42 /  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref /ref ref /ref ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref ref  /ref ref  /ref ": null
    },
    {
        "ef name C. Ellis p. 42 / ref /ref ref /re": "ef name  c. ellis p. 67   /  ref  /ref  ref  /re"
    },
    {
        " ref  /ref ref name k42  /ref ref  /ref ref  /ref ref  /ref  ref  /ref ref  /ref  ref  /ref ref /ref ref /ref ref /ref ref  /ref  ref  /ref ": null
    },
    {
        "ef name C. Ellis p. 42 /ref ref /re": "ef name  c. ellis p. 67   /ref  ref  /re"
    },
    {
        " ref  /ref ref  /ref ref  /ref  ref  /ref  ref /ref ref  /ref ref name Inspection Report  /ref  ref name Inspection Report / ref name Pawley Book of Sleaford p. 42 / ref name Kelly 42 p. 42  /ref ref  /ref ref  /ref ref  /ref ref  /ref ref name k42 /  ref name Ofsted Report  /ref ref  /ref ref  /ref ref name Ofsted Report /  ref name :42  /ref ref name :42 / ref  /ref ref  /ref ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref  ref  /ref ref name sleafordfchist  /ref ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref ref  /ref ref  /ref ref  /ref ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref name st-denys  /ref ref  /ref ref  /ref  ref name st-denys /  ref /ref ref  /ref  ref name Pawley Book of Sleaford p. 42 / ref name :42 / ref /ref  ref /ref  ref /ref ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref  ref /ref ref name Mid-Victorian Sleaford p. 42 /  ref  /ref ref /ref  ref  /ref ref  /ref ref  /ref  ref  /ref ref /ref  ref /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref name Ellis p. 42 /ref  ref  /ref  ref  /ref ref name Ellis p. 42 / ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref name ind ": null
    }
]