[
    {
        "        Slide guitar is a particular technique for playing the ": null
    },
    {
        "guitar": "Guitar"
    },
    {
        " that is often used in ": null
    },
    {
        "blues": "Blues"
    },
    {
        "-style music. The technique involves placing an object against the strings while playing to create ": null
    },
    {
        "glissando": "Glissando"
    },
    {
        " effects and deep ": null
    },
    {
        "vibrato": "Vibrato"
    },
    {
        "s. It typically involves playing the guitar in the traditional position with the use of a tubular slide fitted on one of the guitarists fingers. The slide may be a metal or glass tube, such as the neck of a bottle. The term bottleneck was historically used to describe this type of playing. The strings are typically plucked while the slide is moved over the strings to change the pitch. The guitar may also be placed on the players lap and played with a hand-held bar and is then referred to as lap slide guitar or ": null
    },
    {
        "lap steel guitar": "Lap Steel Guitar"
    },
    {
        " .     Creating music with a slide of some type has been traced back to primitive stringed instruments in African culture and also to the origin of the ": null
    },
    {
        "steel guitar": "Steel Guitar"
    },
    {
        " in Hawaii. Near the beginning of the twentieth century, blues musicians in the ": null
    },
    {
        "Mississippi Delta": "Mississippi Delta"
    },
    {
        " popularized the bottleneck slide guitar style, and the first recording of slide guitar was by ": null
    },
    {
        "Sylvester Weaver": "Sylvester Weaver"
    },
    {
        " in 1923. Since the 1930s, performers including ": null
    },
    {
        "Robert Nighthawk": "Robert Nighthawk"
    },
    {
        ", ": null
    },
    {
        "Earl Hooker": "Earl Hooker"
    },
    {
        ", ": null
    },
    {
        "Elmore James": "Elmore James"
    },
    {
        " and ": null
    },
    {
        "Muddy Waters": "Muddy Waters"
    },
    {
        " popularized slide guitar in the electric blues genre and influenced later slide guitarists in the rock genre including the ": null
    },
    {
        "Rolling Stones": "Rolling Stones"
    },
    {
        ", ": null
    },
    {
        "Duane Allman": "Duane Allman"
    },
    {
        " and ": null
    },
    {
        "Ry Cooder": "Ry Cooder"
    },
    {
        ". Lap slide guitar pioneers include ": null
    },
    {
        "Oscar Buddy Woods": "Oscar   Buddy   Woods"
    },
    {
        ", ": null
    },
    {
        " Black Ace Turner": "Black Ace"
    },
    {
        " and ": null
    },
    {
        "Freddie Roulette": "Freddie Roulette"
    },
    {
        ".          The technique of using a hard object against a plucked string goes back to the ": null
    },
    {
        "diddley bow": "Diddley Bow"
    },
    {
        " derived from a one-stringed African instrument. The diddley bow is believed to be one of the ancestors of the bottleneck style. When sailors from Europe introduced the ": null
    },
    {
        "Spanish guitar": "Classical Guitar"
    },
    {
        " to Hawaii in the latter nineteenth century, the Hawaiians slackened some of the strings from the standard tuning to make a chordthis became known as ": null
    },
    {
        "slack-key": "Slack-Key"
    },
    {
        " guitar, today referred to as an ": null
    },
    {
        "open tuning": "Open Tuning"
    },
    {
        ".  With the slack-key the Hawaiians found it easy to play a three-chord song by moving a piece of metal along the fretboard and began to play the instrument across the lap. Near the end of the nineteenth century, a Hawaiian named ": null
    },
    {
        "Joseph Kekuku": "Joseph Kekuku"
    },
    {
        " became proficient in playing this way using a steel bar against the guitar strings. The bar was called the steel and was the source of the name steel guitar . Kekuku popularized the method and some sources claim he originated the technique.  He moved to the United States mainland and became a ": null
    },
    {
        "vaudeville": "Vaudeville"
    },
    {
        " performer, later performing in Europe for several years.  In the first half of the twentieth century, this so-called Hawaiian guitar style of playing spread to the US. ": null
    },
    {
        "Sol Hoopii": "Sol Hoopii"
    },
    {
        " was an influential Hawaiian guitarist who in 1919, at age 17, came to the US mainland from Hawaii as a stow-away on a ship heading for San Francisco. Hoopiis playing became popular in the late 1920s and he recorded songs like Hula Blues and Farewell Blues . According to author Pete Madsen, would influence a legion of players from rural Mississippi.      Most players of blues slide guitar were from the southern US particularly the ": null
    },
    {
        "Mississippi Delta": "Mississippi Delta"
    },
    {
        ", and their music was likely from an African origin handed down to African-American sharecroppers who sang as they toiled in the fields.  The earliest ": null
    },
    {
        "Delta blues": "Delta Blues"
    },
    {
        " musicians were largely solo singer-guitarists.  ": null
    },
    {
        "W. C. Handy": "W. C. Handy"
    },
    {
        " commented on the first time he heard slide guitar in 1903, when a blues player performed in a local train station: As he played, he pressed a knife on the strings of the guitar in a manner popularised by Hawaiian guitarists who used steel bars. The effect was unforgettable.    Blues historian Gérard Herzhaft notes that ": null
    },
    {
        "Tampa Red": "Tampa Red"
    },
    {
        " was one of the first black musicians inspired by the Hawaiian guitarists of the beginning of the century, and he managed to adapt their sound to the blues. Tampa Red, as well as ": null
    },
    {
        "Kokomo Arnold": "Kokomo Arnold"
    },
    {
        ", ": null
    },
    {
        "Casey Bill Weldon": "Casey Bill Weldon"
    },
    {
        " and Oscar Woods, adopted the Hawaiian mode of playing longer melodies with the slide instead of playing short riffs as they had done previously.     In the early twentieth century, steel guitar playing divided into two streams: bottleneck-style, performed on a traditional Spanish guitar held flat against the body; and lap-style, performed on an instrument specifically designed or modified for the purpose of being played on the performers lap. The bottleneck-style was typically associated with blues music and was popularized by African-American blues artists. The Mississippi Delta was the home of ": null
    },
    {
        "Robert Johnson": "Robert Johnson"
    },
    {
        ", ": null
    },
    {
        "Son House": "Son House"
    },
    {
        ", ": null
    },
    {
        "Charlie Patton": "Charlie Patton"
    },
    {
        ", and other blues pioneers, who prominently used the slide. The first known recording of the bottleneck style was in 1923 by ": null
    },
    {
        "Sylvester Weaver": "Sylvester Weaver"
    },
    {
        ", who recorded two instrumentals, Guitar Blues and Guitar Rag . Guitarist and author ": null
    },
    {
        "Woody Mann": "Woody Mann"
    },
    {
        " identifies Tampa Red and ": null
    },
    {
        "Blind Willie Johnson": "Blind Willie Johnson"
    },
    {
        " as developing the most distinctive styles in the recorded idom of the time. He adds:          When the guitar was ": null
    },
    {
        "electrified": "Electric Guitar"
    },
    {
        " in the 1930s, it allowed solos on the instrument to be more audible, and thus more prominently featured. In the 1940s, players like Robert Nighthawk and ": null
    },
    {
        "Earl Hooker": "Earl Hooker"
    },
    {
        " popularized electric slide guitar; but, unlike their predecessors, they used standard tuning. This allowed them switch between slide and fretted guitar playing readily, which was an advantage in rhythm accompaniment.       Robert Nighthawk recorded extensively in the 1930s as Robert Lee McCoy with bluesmen, such as John Lee Sonny Boy Williamson . He performed on acoustic guitar in a style influenced by Tampa Red. Sometime around World War II, after changing his last name to Nighthawk , he became an early proponent of electric slide guitar and adopted a metal slide. Nighthawks sound was extremely clean and smooth, with a very light touch of the slide against the strings. He helped popularize Tampa Reds ": null
    },
    {
        "Black Angel Blues": "Black Angel Blues"
    },
    {
        " , Crying Wont Help You , and Anna Lou Blues in his electric slide style-songs which later became part of the repertoire of Earl Hooker, ": null
    },
    {
        "B.B. King": "B.B. King"
    },
    {
        ", and others. His style influenced both Muddy Waters and Hooker. Nighthawk is credited as one who helped bring music from Mississippi into the Chicago blues style of electric blues .        As a teenager, Earl Hooker  sought out Nighthawk as his teacher and in the late 1940s, the two toured the ": null
    },
    {
        "South": "Southern United States"
    },
    {
        " extensively. Nighthawk had a lasting impact on Hookers playing; however, by the time of his 1953 recording of Sweet Angel , Hooker had developed an advanced style of his own. His solos had a resemblance to the human singing voice and music writer Andy Grigg commented: He had the uncanny ability to make his guitar weep, moan and talk just like a person... his slide playing was peerless, even exceeding his mentor, Robert Nighthawk.  The vocal approach is heard in Hookers instrumental, Blue Guitar , which was later overdubbed with a unison vocal by ": null
    },
    {
        "Muddy Waters": "Muddy Waters"
    },
    {
        " and became ": null
    },
    {
        "You Shook Me": "You Shook Me"
    },
    {
        " . Unusual for a blues player, Hooker explored using a ": null
    },
    {
        "wah-wah pedal": "Wah-Wah Pedal"
    },
    {
        " in the 1960s to further emulate the human voice.          Possibly the most influential ": null
    },
    {
        "electric blues": "Electric Blues"
    },
    {
        " slide guitarist of his era was Elmore James, who gained prominence with his 1951 song ": null
    },
    {
        "Dust My Broom": "Dust My Broomelmore James Renditions"
    },
    {
        " , a remake of Robert Johnsons 1936 song, I Believe Ill Dust My Broom . It features James playing a series of triplets throughout the song which ": null
    },
    {
        "Rolling Stone": "Rolling Stone Magazine"
    },
    {
        " magazine called one immortal lick and is heard in many blues songs to this day.  Although Johnson had used the figure on several songs, James overdriven electric sound made it more insistent, firing out a machine-gun triplet beat that would become a defining sound of the early rockers , writes historian ": null
    },
    {
        "Ted Gioia": "Ted Gioia"
    },
    {
        ". Unlike Nighthawk and Hooker, James used a full-chord glissando effect with an ": null
    },
    {
        "open E tuning": "Open E Tuning"
    },
    {
        " and a bottleneck. Other popular songs by James, such as ": null
    },
    {
        "It Hurts Me Too": "It Hurts Me Too"
    },
    {
        " , ": null
    },
    {
        "The Sky Is Crying": "The Sky Is Crying"
    },
    {
        " , ": null
    },
    {
        "Shake Your Moneymaker": "Shake Your Moneymaker"
    },
    {
        " , feature his slide playing.       Although Muddy Waters made his earliest recordings using an acoustic slide guitar, as a guitarist, he was best known for his electric slide playing.  Born McKinley Morganfield, Muddy Waters helped bring the Delta blues to Chicago and was instrumental in defining the citys electric blues style.  He was also one of the pioneers of electric slide guitar.  Beginning with I Cant Be Satisfied , many of his hit songs featured slide, including ": null
    },
    {
        "Rollin and Tumblin": "Rollin And Tumblin"
    },
    {
        " , ": null
    },
    {
        "Rollin Stone": "Rollin Stone"
    },
    {
        " , Louisiana Blues , and Still a Fool .  Waters used an ": null
    },
    {
        "open G tuning": "Open G Tuning"
    },
    {
        " for several of his earlier songs, but later switched to a standard tuning and often used a ": null
    },
    {
        "capo": "Capo"
    },
    {
        " to change keys. He usually played single notes with a small metal slide on his little finger and dampened the strings combined with varying the volume to control the amount of distortion. According to writer Ted Drozdowski, One last factor to consider is slide vibrato that is achieved by shaking a slide back and forth. Muddy’s slide vibrato was insane, both manic and controlled. That added to the excitement of his playing.       Rock musicians began exploring electric slide guitar in the early 1960s. In the UK, groups like the ": null
    },
    {
        "Rolling Stones": "Rolling Stones"
    },
    {
        ", who were fans of Chicago blues and ": null
    },
    {
        "Chess Records": "Chess Records"
    },
    {
        " artists in particular, began recording songs by Muddy Waters, ": null
    },
    {
        "Howlin Wolf": "Howlin Wolf"
    },
    {
        ", and others. The Stones second single, ": null
    },
    {
        "I Wanna Be Your Man": "I Wanna Be Your Man"
    },
    {
        " , featured a slide guitar break by ": null
    },
    {
        "Brian Jones": "Brian Jones"
    },
    {
        ", which may be the first appearance of a slide on a rock record. Critic ": null
    },
    {
        "Richie Unterberger": "Richie Unterberger"
    },
    {
        " commented, Particularly outstanding was Brian Joness slide guitar, whose wailing howl gave the tune a raunchy bluesiness missing in the Beatles more straightforward rock n roll arrangement.  Jones also played slide on their 1964 single ": null
    },
    {
        "Little Red Rooster": "Little Red Roosterrolling Stones Version"
    },
    {
        " , which reached number one on the British charts.   One of his last contributions to a Stones recording was his acoustic guitar slide playing on ": null
    },
    {
        "No Expectations": "No Expectations"
    },
    {
        " , which biographer ": null
    },
    {
        "Paul Trynka": "Paul Trynka"
    },
    {
        " describes as subtle, totally without bombast or overemphasis... the perfect embodiment of the journey hed embarked on in 1961.      In Chicago, ": null
    },
    {
        "Mike Bloomfield": "Mike Bloomfield"
    },
    {
        " frequented blues clubs as early as the late 1950sby the early 1960s Muddy Waters and harmonica virtuoso ": null
    },
    {
        "Little Walter": "Little Walter"
    },
    {
        " encouraged him and occasionally allowed him to sit in on jam sessions. Waters recalled: Mike was a great guitar player. He learned a lot of slide from me. Plus I guess he picked up a little lick or two from me, but he learned how to play a lot of slide and pick a lot of guitar.  Bloomfields slide playing attracted ": null
    },
    {
        "Paul Butterfield": "Paul Butterfield"
    },
    {
        " and together with guitarist ": null
    },
    {
        "Elvin Bishop": "Elvin Bishop"
    },
    {
        ", they formed the classic lineup of the Paul Butterfield Blues Band.   Their first album,  The Paul Butterfield Blues Band  , features Bloomfields guitar work and his slide playing on the bands adaptation of Elmore James ": null
    },
    {
        "Shake Your Moneymaker": "Shake Your Moneymaker"
    },
    {
        " and shows his well-developed slide style. Around the same time, he recorded with ": null
    },
    {
        "Bob Dylan": "Bob Dylan"
    },
    {
        " for the  Highway 61 Revisited  album and contributed the distinctive slide guitar to the ": null
    },
    {
        "title track": "Highway 61 Revisited"
    },
    {
        ". On the second Butterfield album,  East-West  , songs such as ": null
    },
    {
        "Walkin Blues": "Walkin Blues"
    },
    {
        " and ": null
    },
    {
        "Two Trains Running": "Rollin Stonestill A Fool"
    },
    {
        " include slide playing that brought him to the audiences attention.        ": null
    },
    {
        "Ry Cooder": "Ry Cooder"
    },
    {
        " was a child music prodigy and at age 15, began working on bottleneck guitar techniques and learned Robert Johnson songs.   In 1964, Cooder, along with ": null
    },
    {
        "Taj Mahal": "Taj Mahal"
    },
    {
        ", formed the ": null
    },
    {
        "Rising Sons": "Rising Sons"
    },
    {
        ", one of the earliest ": null
    },
    {
        "blues rock": "Blues Rock"
    },
    {
        " bands. His early guitar work appears on ": null
    },
    {
        "Captain Beefhearts": "Captain Beefheart"
    },
    {
        "debut  Safe as Milk  album and several songs on Taj Mahals ": null
    },
    {
        "self-titled 1968 debut album": "Taj Mahal"
    },
    {
        ". Cooders slide playing is featured on songs such as ": null
    },
    {
        "44 Blues": "44 Blues"
    },
    {
        " , Sure Nuff n Yes I Do , The Celebrated Walkin Blues , and ": null
    },
    {
        "Statesboro Blues": "Statesboro Blues"
    },
    {
        " . Also in 1968, he collaborated with the Rolling Stones on recording sessions, which resulted in Cooder playing slide on ": null
    },
    {
        "Memo from Turner": "Memo From Turner"
    },
    {
        " . The ": null
    },
    {
        "Jagger/Richards": "Jagger/Richards"
    },
    {
        " song was later included on the ": null
    },
    {
        "soundtrack": "Performance"
    },
    {
        " to the 1970 film  Performance ;  Rolling Stone  magazine ranked it at number 92 on its list of the 100 Greatest Guitar Songs of All Times .  In 1970, he recorded his own ": null
    },
    {
        "self titled debut album": "Ry Cooder"
    },
    {
        ", which included the Blind Willie Johnson classic slide instrumental ": null
    },
    {
        "Dark Was the Night, Cold Was the Ground": "Dark Was The Night, Cold Was The Ground"
    },
    {
        " . Recognized as a master of slide guitar by 1967,  Rolling Stone  magazine ranked him at number eight on their list of the 100 Greatist Guitarists of All Time in 2003.     ": null
    },
    {
        "Duane Allman": "Duane Allman"
    },
    {
        "’s slide playing with the ": null
    },
    {
        "Allman Brothers Band": "Allman Brothers Band"
    },
    {
        " was one of the formative influences in the creation of ": null
    },
    {
        "Southern rock": "Southern Rock"
    },
    {
        ". He also added memorable slide guitar to ": null
    },
    {
        "Derek and the Dominos": "Derek And The Dominos"
    },
    {
        "’  Layla and Other Assorted Love Songs  album, notably its title track, which was ranked at number 13 on Rolling Stones 100 Greatest Guitar Songs .  Allman, who died in a motorcycle accident at age 24, was hailed by ": null
    },
    {
        "NPRs": "Npr"
    },
    {
        "Nick Morrison as the most inventive slide guitarist of his era . He extended the role of the slide guitar by mimicking the ": null
    },
    {
        "harmonica": "Harmonica"
    },
    {
        " effects of ": null
    },
    {
        "Sonny Boy Williamson II": "Sonny Boy Williamson Ii"
    },
    {
        ", most clearly in the Allman Brothers rendition of Williamsons ": null
    },
    {
        " One Way Out ": "One Way Out"
    },
    {
        ", recorded live at the ": null
    },
    {
        "Fillmore East": "Fillmore East"
    },
    {
        " and heard on their album  Eat a Peach .       The slide guitar, according to music educator Keith Wyatt, can be thought of as a one-finger fretless guitar . The placement of a slide on a string the determines the ": null
    },
    {
        "pitch": "Pitch"
    },
    {
        ", functioning in the manner of a finger pressed against the fretboard. The slide is pressed lightly against the strings to avoid hitting against the frets, and is kept parallel with them. The frets are used only as a visual reference, and playing in tune without them requires additional skill. In this playing technique the players remaining fingers and thumb still have access to the frets, and may be used for playing rhythmic accompaniment or reaching additional notes.  The guitar itself may be tuned in the traditional tuning or an open tuning. Most early blues players used open tunings, but most modern slide players use both. The major limitation of open tuning is that usually only one ": null
    },
    {
        "chord shape": "Guitar Chord"
    },
    {
        " is easily available and is dictated by how the guitar is originally tuned. Two-note intervals can be played by slanting the slide on certain notes.      In the sixteenth century, the notes of A–D–G–B–E were adopted as a tuning for guitar-like instruments, and the low E was added later to make E–A–D–G–B–E as the ": null
    },
    {
        "standard guitar tuning": "Standard Guitar Tuning"
    },
    {
        ".  In open tuning, the strings are tuned to sound a ": null
    },
    {
        "chord": "Chord"
    },
    {
        " when not fretted, and is most often major.  Open tunings commonly used with slide guitar include ": null
    },
    {
        "open D": "Open D Tuning"
    },
    {
        " or Vestapol tuning: D–A–D–F–A–D; and ": null
    },
    {
        "open G": "Open G"
    },
    {
        " or Spanish tuning: D–G–D–G–B–D. ": null
    },
    {
        "Open E": "Open E Tuning"
    },
    {
        " and ": null
    },
    {
        "open A": "Open A Tuning"
    },
    {
        ", formed by raising each of those tunings a whole tone, are also common. Other tunings are also used, in particular the ": null
    },
    {
        "drop D": "Drop D"
    },
    {
        " tuning is used by many slide players. This tuning allows for ": null
    },
    {
        "power chords": "Power Chords"
    },
    {
        ", which contain root, fifth and eighth notes in the bass strings and conventional tuning for the rest of the strings.  Robert Johnson, whose playing has been cited by ": null
    },
    {
        "Clapton": "Eric Clapton"
    },
    {
        ", ": null
    },
    {
        "Richards": "Keith Richards"
    },
    {
        ", ": null
    },
    {
        "Hendrix": "Jimi Hendrix"
    },
    {
        ", and ": null
    },
    {
        "Winter": "Johnny Winter"
    },
    {
        " as being a powerful influence on them, used tunings of standard, open G, open D, and drop D.        The ": null
    },
    {
        "National String Instrument Corporation": "National String Instrument Corporation"
    },
    {
        " produced the first metal-body ": null
    },
    {
        "resonator guitars": "Resonator Guitar"
    },
    {
        "in the late 1920s . Popular with early slide players, these featured a large aluminum cone, resembling an inverted loudspeaker, attached under the instrument’s bridge to increase its volume.  It was patented in the late 1920s by the Dopyera brothers and became widely used on many types of guitars, and was adapted to the mandolin and ukulele.     Tampa Red played a gold-plated National Tricone style 4, and was of the first black musicians to record with it. Delta blues pioneer, Son House, played this type of guitar on many songs including the classic, ": null
    },
    {
        "Death Letter": "Death Letter"
    },
    {
        " . A resonator guitar with a metal body was played by ": null
    },
    {
        "Bukka White": "Bukka White"
    },
    {
        " .            Lap slide guitar does not refer a specific instrument, rather a style of playing guitar with the instrument resting on the performers lap or otherwise supported, and the term usually indicates blues or rock music. The horizontal position is also known as Hawaiian style . There are various instruments specifically made to play in the table-top position, including:   a traditional guitar, which has been adapted for lap slide playing by raising the ": null
    },
    {
        "bridge": "Bridge"
    },
    {
        " and/or the ": null
    },
    {
        "nut": "Nut"
    },
    {
        " to make the strings higher off the fretboard;   ": null
    },
    {
        "Steel guitar": "Steel Guitar"
    },
    {
        "s, including ": null
    },
    {
        "lap steel": "Lap Steel"
    },
    {
        ", ": null
    },
    {
        "console steel": "Console Steel Guitar"
    },
    {
        " and ": null
    },
    {
        "pedal steel": "Pedal Steel"
    },
    {
        ", in which a solid metal bar, typically referred to as a steel , is pressed against the strings and is the source of the name steel guitar ;   a National or ": null
    },
    {
        "Dobro": "Dobro"
    },
    {
        "-type guitar, which resembles a traditional guitar, but with a thicker, sometimes square, reinforced neck.   Proper terminology for the hand-held bar used is steel or ": null
    },
    {
        "tone bar": "Tone Bar"
    },
    {
        " rather than slide . The term lap slide coexists with lap steel to describe the same lap-played instrument, but lap slide usually connotes blues or rock music, while lap steel could encompass any musical genre. That said, not even the manufacturers and players of the many variants of these instruments agree on basic terminology. These types of instruments may differ markedly in external appearancesome resemble a traditional guitar, while others are made in a solid rectangular block.         ": null
    },
    {
        "Buddy Woods": "Oscar   Buddy   Woods"
    },
    {
        " was a Louisiana street performer who recorded in the 1930s. He was called The Lone Wolf after the title of his most successful song, Lone Wolf Blues . Between 1936 and 1938, he recorded ten songs which are today considered classics, including Dont Sell It, Dont Give It Away . Woods recorded five songs for the US ": null
    },
    {
        "Library of Congress": "Library Of Congress"
    },
    {
        " in 1940 in Shreveport, Louisiana, including Boll Weevil Blues and Sometimes I Get a Thinkin .       ": null
    },
    {
        " Black Ace Turner": "Black Ace"
    },
    {
        " , a blues artist from Texas, was befriended and mentored by Buddy Woods. Historian Gérard Herzhaft stated, Black Ace is one of the few blues guitarists to have played in the purest Hawaiian style, that is, with the guitar flat on the knees.  Turner played a square-neck National style 2 Tri-cone metal body guitar and used a glass medicine bottle as a slide. Turner was also a good storyteller, which enabled him to host a radio program in Fort Worth called The Black Ace.  His career effectively ended when he entered military service in 1943. His album, I Am the Boss Card in Your Hand, contained Turners original 1930s recordings as well as new songs recorded in 1960. Turner was featured in a 1962 documentary film entitled The Blues.     ": null
    },
    {
        "Freddie Roulette": "Freddie Roulette"
    },
    {
        " is a San Francisco-based lap steel blues artist who became interested in the lap steel guitar at an early age and became proficient enough to play in Chicago blues clubs with prominent players. He earned a spot in Earl Hookers band and recorded with Hooker in the 1960s. Roulette had played lap steel in other genres before focusing on blueshe said this helped him add more complex chords to the basic blues played by Hooker, and said, it worked .  Roulette was recruited to San Francisco in the mid 1970s by blues hall-of-famer ": null
    },
    {
        "Charlie Musselwhite": "Charlie Musselwhite"
    },
    {
        ".  In 1997, he recorded a solo album, Back in Chicago: Jammin with Willie Kent and the Gents, which won Best Blues Album of 1997 by Living Blues Magazine.  Roulettes contribution to the lap slide guitar was to prove that a lap-played instrument was capable of holding its own in Chicago blues style.          A slide used around a players finger can be made with any type of smooth hard material that allows tones to resonate. Different materials cause subtle differences in ": null
    },
    {
        "sustain": "Sustain"
    },
    {
        ", ": null
    },
    {
        "timbre": "Timbre"
    },
    {
        ", and ": null
    },
    {
        "loudness": "Loudness"
    },
    {
        "; glass or metal are the most common choices. Longer slides are used to bridge across all six guitar strings at once, but take away the fretting ability of that finger entirely. A shorter slide allows the fingertip to protrude from the slide and allow that finger to be used to fret.     Improvised slides are common, including pipes, rings, knives, spoons, and glass bottle necks. Early blues players sometimes used a knife, such as Blind Willie Johnson  and ": null
    },
    {
        "CeDell Davis": "Cedell Davis"
    },
    {
        " .  Duane Allman used a glass ": null
    },
    {
        "Coricidin": "Coricidin"
    },
    {
        " medicine bottle. ": null
    },
    {
        "Pink Floyd": "Pink Floyd"
    },
    {
        " founder ": null
    },
    {
        "Syd Barrett": "Syd Barrett"
    },
    {
        " was fond of using a ": null
    },
    {
        "Zippo": "Zippo"
    },
    {
        " lighter as a slide, but this was largely for special effects.  ": null
    },
    {
        "Jimi Hendrix": "Jimi Hendrix"
    },
    {
        " also used a cigarette lighter for part of his solo on ": null
    },
    {
        "All Along the Watchtower": "All Along The Watchtowerthe Jimi Hendrix Experience"
    },
    {
        " . It is one of the few recordings with Hendrix on slide, and biographer ": null
    },
    {
        "Harry Shapiro": "Harry Shapiro"
    },
    {
        " notes he performed it with the guitar on his lap.     For guitars designed to be played on the lap, the performer uses a solid piece of steel rather than a hollow tube. The choice of shape and size is a matter of personal preference. The most common steel is a solid metal cylinder with one end rounded into a dome shape. Some lap slide guitar players choose a steel with a deep indentation or groove on each side so it can be held firmly, and may have squared-off ends. The better grip may facilitate playing the rapid vibratos in blues music. This design facilitates ": null
    },
    {
        "hammer-on": "Hammer-On"
    },
    {
        " and ": null
    },
    {
        "pull-off": "Pull-Off"
    }
]