[
    {
        "     SMS Zrínyi  was a  ": null
    },
    {
        "pre-dreadnought": "pre-dreadnought"
    },
    {
        " battleship": "battleship"
    },
    {
        "  of the ": null
    },
    {
        "Austro-Hungarian Navy": "austro-hungarian navy"
    },
    {
        " , named for the ": null
    },
    {
        "Zrinski": "house of zrinski"
    },
    {
        ", a noble ": null
    },
    {
        "Croatian": "croats"
    },
    {
        " family. Zrínyi and her ": null
    },
    {
        "sisters": "sister ship"
    },
    {
        ",  and , were the last pre-dreadnoughts built for the Austro-Hungarian Navy.     During ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", Zrínyi saw action in the ": null
    },
    {
        "Adriatic Sea": "adriatic sea"
    },
    {
        ". She served with the Second Division of the Austro-Hungarian Navys battleships and shelled ": null
    },
    {
        "Senigallia": "senigallia"
    },
    {
        " as part of ": null
    },
    {
        "the bombardment of the key seaport of Ancona, Italy": "bombardment of ancona"
    },
    {
        ", during May 42 However, ": null
    },
    {
        "Allied": "allies of world war i"
    },
    {
        " control of the ": null
    },
    {
        "Strait of Otranto": "strait of otranto"
    },
    {
        " meant that the Austro-Hungarian Navy was effectively contained in the Adriatic. Nonetheless, ": null
    },
    {
        "the presence": "fleet in being"
    },
    {
        " of the Zrínyi and other battleships tied down a substantial force of Allied ships.     With the war going against the Austrians by the end of 42 Zrínyi was prepared for transfer to the new ": null
    },
    {
        "State of Slovenes, Croats and Serbs": "state of slovenes, croats and serbs"
    },
    {
        ". On 42 November 42 just one day before the end of the war, navy officers sailed the battleship out of ": null
    },
    {
        "Pola": "pula"
    },
    {
        " and surrendered to a squadron of American ": null
    },
    {
        "submarine chaser": "submarine chaser"
    },
    {
        "s. Following the handover to the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        ", she was briefly designated USS Zrínyi. In the ": null
    },
    {
        "Treaty of Saint-Germain-en-Laye": "treaty of saint-germain-en-laye"
    },
    {
        ", the transfer was not recognized; instead, Zrínyi was given to Italy and ": null
    },
    {
        "broken up for scrap": "ship breaking"
    },
    {
        ".              Zrínyi was built at the ": null
    },
    {
        "Stabilimento Tecnico Triestino": "stabilimento tecnico triestino"
    },
    {
        " dockyard in ": null
    },
    {
        "Trieste": "trieste"
    },
    {
        ", the same place where her sister ships were built earlier. She was laid down on 42 November 42 and ": null
    },
    {
        "launched": "ship naming and launching"
    },
    {
        " from the ": null
    },
    {
        "slipway": "slipway"
    },
    {
        " on 42 April 42 The ": null
    },
    {
        "teak": "teak"
    },
    {
        " used on Zrínyis deck was the only material Austria-Hungary had to purchase abroad to build the ship. The ship was completed by 42 July 42 and on 42 November 42 she was commissioned into the fleet. She was the last ship of the class to be completed and had a crew of 42 to 42 officers and men.          Zrínyi was 42  m long, and had a ": null
    },
    {
        "beam": "beam"
    },
    {
        " of 42  m and a ": null
    },
    {
        "draft": "draft"
    },
    {
        " of 42  m . She displaced  normally, and up to  with a full combat load. She was powered by two-shaft four-cylinder vertical ": null
    },
    {
        "triple expansion engine": "triple expansion engine"
    },
    {
        "s rated at 42  ": null
    },
    {
        "indicated horsepower": "indicated horsepower"
    },
    {
        ". The ship had a top speed of . Zrínyi was the first warship in the Austro-Hungarian Navy to use ": null
    },
    {
        "fuel oil": "fuel oil"
    },
    {
        " to supplement her 42 ": null
    },
    {
        "Yarrow-type": "water-tube boileryarrow"
    },
    {
        " coal-fired boilers. She had a maximum range of  at a cruising speed of .     The ships primary armament consisted of four ": null
    },
    {
        "42  cm 42": "škoda 30.5 cm /45 k10"
    },
    {
        "-": null
    },
    {
        "caliber": "calibercaliber as measurement of length"
    },
    {
        " guns in two twin ": null
    },
    {
        "gun turret": "gun turret"
    },
    {
        "s. This was augmented by a heavy secondary battery of eight 42  cm guns in four ": null
    },
    {
        "wing turret": "wing turret"
    },
    {
        "s. The tertiary battery consisted of twenty ": null
    },
    {
        "42  cm L/42": "škoda 10 cm k10"
    },
    {
        " guns in ": null
    },
    {
        "casemate": "casemate"
    },
    {
        "d single mounts, four  L/42 and one 42  mm L/42 ": null
    },
    {
        "quick-firing gun": "quick-firing gun"
    },
    {
        "s. Furthermore, the ships boats were equipped with two  L/42 landing guns for operations ashore. After 42–42 refits four ": null
    },
    {
        "Škoda 42 cm K42": "škoda 7 cm k10"
    },
    {
        " anti-aircraft guns were installed.   Three 42  cm ": null
    },
    {
        "torpedo tube": "torpedo tube"
    },
    {
        "s were also carried, one on each ": null
    },
    {
        "broadside": "broadside"
    },
    {
        " and one in the stern.            The ship was assigned to the Austro-Hungarian Fleets 42st Battle Squadron after her 42 commissioning. In 42 Zrínyi and her two sister ships conducted two training cruises into the eastern ": null
    },
    {
        "Mediterranean Sea": "mediterranean sea"
    },
    {
        ". On the second cruise into the ": null
    },
    {
        "Aegean Sea": "aegean sea"
    },
    {
        ", conducted from November to December, Zrínyi and her sister ships were accompanied by the cruiser  and a pair of destroyers. After returning to Pola, the entire fleet mobilized for possible hostilities, as tensions flared in the Balkans.     In 42 Zrínyi participated in an international naval demonstration in the ": null
    },
    {
        "Ionian Sea": "ionian sea"
    },
    {
        " to protest the ": null
    },
    {
        "Balkan Wars": "balkan wars"
    },
    {
        ". Ships from other navies included in the demonstration were the British pre-dreadnought , the Italian pre-dreadnought , the French ": null
    },
    {
        "armored cruiser": "armored cruiser"
    },
    {
        " , and the German ": null
    },
    {
        "light cruiser": "light cruiser"
    },
    {
        " . The most important action of the combined flotilla, which was under the command of British Admiral ": null
    },
    {
        "Cecil Burney": "cecil burney"
    },
    {
        ", was to blockade the ": null
    },
    {
        "Montenegrin": "montenegro"
    },
    {
        " coast. The goal of the blockade was to prevent ": null
    },
    {
        "Serbia": "serbia"
    },
    {
        "n reinforcements from supporting the ": null
    },
    {
        "siege at Scutari": "siege of scutari"
    },
    {
        ", where Montenegro had besieged a combined force of ": null
    },
    {
        "Albanians": "albanians"
    },
    {
        " and ": null
    },
    {
        "Ottomans": "ottomans"
    },
    {
        ". Pressured by the international blockade, Serbia withdrew its army from Scutari, which was subsequently occupied by a joint Allied ground force.     During that year, the first of four new ": null
    },
    {
        "dreadnought": "dreadnought"
    },
    {
        "s, , that made up the —the only dreadnoughts built for the Austro-Hungarian Navy—came into active service. With the commissioning of these dreadnoughts, Zrínyi and her sisters were moved from the 42st Division to the 42nd Division of the 42st Battle Squadron.         At the time of the ": null
    },
    {
        "assassination of Archduke Franz Ferdinand of Austria": "assassination of archduke franz ferdinand of austria"
    },
    {
        " on 42 June 42 the battleships in the Austro-Hungarian Navy consisted of the Radetzky class, the Tegetthoff class , the  and finally, the older . Along with the remainder of the Austro-Hungarian Navy, Zrínyi was mobilized in late July 42 to support the flight of  and . The two German ships broke out of ": null
    },
    {
        "Messina": "messina"
    },
    {
        ", which was surrounded by the British navy and reached Turkey. The flotilla had advanced as far south as ": null
    },
    {
        "Brindisi": "brindisi"
    },
    {
        " in southeastern Italy when news of ": null
    },
    {
        "the successful breakout": "pursuit of goeben and breslau"
    },
    {
        " reached Vienna. The Austro-Hungarian ships were then recalled before seeing action.      On 42 May 42 between two and four hours after news of the Italian declaration of war reached the main Austro-Hungarian naval base at Pola, Zrínyi and the rest of the fleet departed to bombard the Italian and Montenegrin coast. Their focus was on the important naval base at ": null
    },
    {
        "Ancona": "ancona"
    },
    {
        ", and later the coast of Montenegro. The bombardment of Montenegro was part of the larger Austro-Hungarian ": null
    },
    {
        "campaign against the Kingdoms of Montenegro and Serbia": "serbian campaign"
    },
    {
        ", who were ": null
    },
    {
        "members of the Entente": "allies of world war i"
    },
    {
        ", during the first half of 42 The attack on Ancona was an immense success, and the ships were unopposed during the operation. The bombardment of the province and the surrounding area resulted in the destruction of an Italian steamer in the port of Ancona itself, and an Italian destroyer, , was severely damaged further south. On the shore, the infrastructure of the port of Ancona, as well as the surrounding towns, were severely damaged. The railroad yard in Ancona, as well as the port facilities in the town, were damaged or destroyed. The local shore batteries were also suppressed. During the bombardment, Zrínyi also helped to destroy a train, a railway station, and a bridge at ": null
    },
    {
        "Senigallia": "senigallia"
    },
    {
        ". Additional targets that were damaged or destroyed included ": null
    },
    {
        "wharves": "wharves"
    },
    {
        ", warehouses, oil tanks, radio stations, and the local barracks. Sixty-three Italians, both civilians and military personnel, were killed in the bombardment. By the time Italian ships from ": null
    },
    {
        "Taranto": "taranto"
    },
    {
        " and Brindisi arrived on the scene, the Austro-Hungarians were safely back in Pola.     The objective of the bombardment of Ancona was to delay the Italian Army from deploying its forces along the border with Austria-Hungary by destroying critical transportation systems. The surprise attack on Ancona succeeded in delaying the Italian deployment to the ": null
    },
    {
        "Alps": "alps"
    },
    {
        " for two weeks. This delay gave Austria-Hungary valuable time to strengthen its Italian border and re-deploy some of its troops from the Eastern and Balkan fronts.     Aside from the attack on Ancona, the Austro-Hungarian battleships were largely confined to Pola for the duration of the war. Their operations were limited by Admiral ": null
    },
    {
        "Anton Haus": "anton haus"
    },
    {
        ", the commander of the Austro-Hungarian Navy, who believed that he would need to husband his ships to counter any Italian attempt to seize the ": null
    },
    {
        "Dalmatia": "dalmatia"
    },
    {
        "n coast. Since coal was diverted to the newer Tegetthoff-class battleships, the remainder of the war saw Zrínyi and the rest of the Austro-Hungarian Navy acting as a fleet in being. This resulted in the ": null
    },
    {
        "Allied blockade": "otranto barrage"
    },
    {
        " of the ": null
    },
    {
        "Otranto Strait": "otranto strait"
    },
    {
        ". With his fleet blockaded in the Adriatic Sea, and with a shortage of coal, Haus followed a strategy based on mines and submarines designed to reduce the numerical superiority of the Allied navies.          After the ": null
    },
    {
        "Austro-Hungarian Empire": "austro-hungarian empire"
    },
    {
        " collapsed in 42 the Austrians wanted to turn the fleet over to the newly created ": null
    },
    {
        "State of Slovenes, Croats and Serbs": "state of slovenes, croats and serbs"
    },
    {
        "  in order to prevent the Italians from claiming the ships as spoils of war. However, the victorious Allies refused to acknowledge the conversations between the Austrians and the south Slavs and, in due course, reallocated the ships. The ship had been boarded by a scratch Yugoslav crew on 42 November 42 one day before the Armistice, and had left Pola along with her sister ship, Radetzky. They were soon spotted by heavy Italian ships, so the two battleships hoisted American flags and sailed south along the ": null
    },
    {
        "Adriatic": "adriatic"
    },
    {
        " coast to ": null
    },
    {
        "Castelli Bay": "castelli bay"
    },
    {
        " near ": null
    },
    {
        "Spalato": "split"
    },
    {
        " . They appealed for American naval forces to meet them and accept their surrender, which a squadron of United States Navy submarine chasers in the area did. She had apparently been turned over to the fledgling south Slav state, as it was a ": null
    },
    {
        "Croat": "croats"
    },
    {
        " naval officer, Korvettenkapitän Marijan Polić, who presented the ship as a prize of war to representatives of the ": null
    },
    {
        "United States Navy": "united states navy"
    },
    {
        " on the afternoon of 42 November 42 at Spalato in ": null
    },
    {
        "Dalmatia": "dalmatia"
    },
    {
        ". Simultaneously she was commissioned as USS Zrínyi and Lieutenant E.E. Hazlett, USN, assumed command. The initial American complement consisted of four officers and 42 enlisted men—the latter entirely composed of ": null
    },
    {
        "United States Navy Reserve": "united states navy reserve"
    },
    {
        " Force personnel. The ship remained at anchor at Spalato for nearly a year while the negotiations that would determine her ultimate fate dragged on. Only once did she apparently turn her engines over, and that occurred during a severe gale that struck Spalato on 42 February 42     On the morning of 42 November 42 Zrínyi was decommissioned.  took her in tow and, assisted by  and , towed the battleship to Italy. Under the terms of the treaties of ": null
    },
    {
        "Versailles": "treaty of versailles"
    },
    {
        " and ": null
    },
    {
        "St. Germain": "treaty of saint-germain-en-laye"
    },
    {
        ", Zrínyi was ultimately turned over to the ": null
    },
    {
        "Italian": "italy"
    },
    {
        " government at ": null
    },
    {
        "Venice": "venice"
    },
    {
        ". She was broken up for scrap later that year and into 42": null
    }
]