[
    {
        "           Sneaker Pimps are a ": null
    },
    {
        "British": "United Kingdom"
    },
    {
        " electronic music": "Electronic Music"
    },
    {
        " band formed in ": null
    },
    {
        "Hartlepool": "Hartlepool"
    },
    {
        ", ": null
    },
    {
        "England": "England"
    },
    {
        ", in 1994. They are best known for their first album,  Becoming X  , and the singles ": null
    },
    {
        "6 Underground": "6 Underground"
    },
    {
        " and ": null
    },
    {
        "Spin Spin Sugar": "Spin Spin Sugar"
    },
    {
        " . They took their name from an article the ": null
    },
    {
        "Beastie Boys": "Beastie Boys"
    },
    {
        " published in their  Grand Royal  magazine about a man they hired to track down classic ": null
    },
    {
        "sneakers": "Athletic Shoe"
    },
    {
        ".     The band was founded by ": null
    },
    {
        "Liam Howe": "Liam Howe"
    },
    {
        " and ": null
    },
    {
        "Chris Corner": "Chris Corner"
    },
    {
        ", who later recruited ": null
    },
    {
        "Kelli Ali": "Kelli Ali"
    },
    {
        " as lead singer, and long-time friend Ian Pickering to co-write the lyrics.  After the first album, the band felt that demos for the second album better suited his voice, especially in regard to the more raw, personal quality of the lyrics. Following the promotional tour for Becoming X, Dayton was dismissed from the group, and Corner became the singer.      In May 2015, founding member Liam Howe hinted via Twitter that Sneaker Pimps would return.  In April 2016, Chris Corner seemingly confirmed their plans to release a fourth album in an image posted to Twitter.        Chris Corner and Liam Howe met as teenagers in the eighties, both taking an interest in recording and studio experimentation. They banded together under the name F.R.I.S.K. and produced the Soul of Indiscretion ": null
    },
    {
        "EP": "Extended Play"
    },
    {
        ", an early example of what became known as trip-hop. The mix of beats and acoustic folk sounds was further explored on two more instrumental EPs: F.R.I.S.K. and World as a Cone . They were signed to ": null
    },
    {
        "Clean Up Records": "Clean Up Records"
    },
    {
        ".   The duos early DJ and production efforts took the alias Line of Flight.      As their music evolved, Howe and Corner began to tire of the non-vocal format, and wanted to explore making music with more pop leanings. They drafted school friend Ian Pickering to assist in writing lyrics for what would eventually become the album  Becoming X . Chris Corner recorded vocals for several demo tracks, but the band decided the kind of music they were writing better suited a female vocal.  At their managers suggestion, they saw ": null
    },
    {
        "Kelli Dayton": "Kelli Ali"
    },
    {
        " performing in a pub and recruited her to join on vocals. Finally the band came together with friends ": null
    },
    {
        "Joe Wilson": "Joe Wilson"
    },
    {
        " on bass and ": null
    },
    {
        "Dave Westlake": "Dave Westlake"
    },
    {
        " on drums and percussion, and began recording under the Sneaker Pimps name.     The 1996 debut album Becoming X was a runaway success, released during the peak popularity of the trip-hop genre. The album got them signed to Virgin America, and sold over a million copies. They toured the album for two years, including gigs alongside ": null
    },
    {
        "Aphex Twin": "Aphex Twin"
    },
    {
        ".  A 1998 remix album, ": null
    },
    {
        "Becoming Remixed": "Becoming Remixed"
    },
    {
        ", followed. After the tour, the band wrote their follow-up album, Splinter. Chris Corner again laid down the initial vocal demos, at which point he felt that his vocal style fit better with the direction their music was turning. At this time, Dayton was asked to leave the band, also in part due to the stress of the preceding tour.  The bands lineup change led them to be dropped from Virgin, and the second album  Splinter  was instead released in the UK on Clean Up Records in 1999.  Splinter featured more traditional instrumentation, acoustic guitars, and downbeat tempos. With the bands change in direction, Splinter did not match the commercial success of Becoming X, but solidified a cult fanbase.     Their third album  Bloodsport  was released on ": null
    },
    {
        "Tommy Boy Records": "Tommy Boy Records"
    },
    {
        " in 2002. Songs from the album were premiered during a 2001 European tour opening for ": null
    },
    {
        "Placebo": "Placebo"
    },
    {
        ". A more dance-oriented album than its predecessor, Bloodsport contains influences of new wave, pop, funk, and alternative combined with a residue of trip-hop. Cynical takes on fame and celebrity are a recurring lyrical theme throughout the album.     In 2003, the bands website stated they had decided to undergo a mutation and announced the launch of Chris Corners new project, ": null
    },
    {
        "IAMX": "Iamx"
    },
    {
        ".  A fourth Sneaker Pimps album was demoed but shelved, and is referred to in fan circles as SP4. Many of the songs would be finalized and recorded by Corner on the first two IAMX albums. Although the bands website hinted through 2005 that new Sneaker Pimps material and 5.1 Surround Sound re-releases of the first two albums were on the way, these plans never materialized and band members focused instead on varying side projects.      In May 2015, founding member Liam Howe hinted that Sneaker Pimps would return. He later reinforced this on a new Sneaker Pimps Twitter account. Corner has commented that he would like to be involved in future Sneaker Pimps projects if other band members are equally interested.      In December 2016, Dayton  announced details of her forthcoming project called Ghostdriver - a new solo album & Soundtrack to her independent feature-length film debut , which would be produced concurrently via a crowdfunding campaign on the ": null
    },
    {
        "PledgeMusic": "Pledgemusic"
    },
    {
        " platform. On 26 January 2019, a digital edition of the full 15 track Ghostdriver album was pre-released exclusively to fans who had donated to the campaign, with an announcement that her former Sneaker Pimps band-mate, ": null
    },
    {
        "Liam Howe": "Liam Howe"
    },
    {
        ", contributed extensively to the mix and additional production of the album, notably marking the first collaboration between two original Sneaker Pimps band members since their disbandment. In addition, the announcement confirmed that the full commercial release of the album will follow later in 2019 in conjunction with the release of the final film.      In May 2019, Chris Corner announced via an IAMX Patreon update that he was deep into a fourth Sneaker Pimps album with fellow friend and band-mate Liam Howe in Los Angeles. A further update released via a live Patreon video stream with both Liam and Chris during the end of August 2019 confirmed that a promise was made regarding material being released in 2019 and that a possible tour was in talks and more music outside of the proposed 2019 album.       ": null
    },
    {
        "Chris Corner": "Chris Corner"
    },
    {
        " began working on the side project ": null
    },
    {
        "IAMX": "Iamx"
    },
    {
        " in 2003 and has since released nine solo albums.  He has also provided guest vocals for TNT Jackson, Moonbootica and The Strike Boys, as well as produced material for ": null
    },
    {
        "Robots in Disguise": "Robots In Disguise"
    },
    {
        ". Corner also collaborated with ": null
    },
    {
        "Sue Denim": "Sue Denim"
    },
    {
        " from Robots in Disguise, under the name Siblings.     ": null
    },
    {
        "Liam Howe": "Liam Howe"
    },
    {
        " has become a successful writer/producer and has written and produced the likes of ": null
    },
    {
        "Marina and the Diamonds": "Marina And The Diamonds"
    },
    {
        ", ": null
    },
    {
        "Lana Del Rey": "Lana Del Rey"
    },
    {
        " and ": null
    },
    {
        "Ellie Goulding": "Ellie Goulding"
    },
    {
        ". He is signed to Columbia records for his solo project which includes collaborations with ": null
    },
    {
        "Alan Vega": "Alan Vega"
    },
    {
        ", ": null
    },
    {
        "Neneh Cherry": "Neneh Cherry"
    },
    {
        " and ": null
    },
    {
        "Princess Superstar": "Princess Superstar"
    },
    {
        ".     David Westlake currently plays drums in ": null
    },
    {
        "Trash Money": "Trash Money"
    },
    {
        ", has done session work for ": null
    },
    {
        "Natalie Imbruglia": "Natalie Imbruglia"
    },
    {
        ", ": null
    },
    {
        "Mediaeval Baebes": "Mediaeval Baebes"
    },
    {
        ", and Zero-G, and played drums with ": null
    },
    {
        "Ultrafox": "Ultrafox"
    },
    {
        " on tour.     ": null
    },
    {
        "Kelli Ali": "Kelli Ali"
    },
    {
        " has released three solo albums through ": null
    },
    {
        "One Little Indian Records": "One Little Indian Records"
    },
    {
        ": Tigermouth, Psychic Cat, and Rocking Horse, followed by the independently released album Band of Angels in 2013. As of 2016, Ali has been working on her new joint solo project called Ghostdriver; a new solo album & film soundtrack to her feature-length film debut of the same name , due for release in 2019.     Past member ": null
    },
    {
        "Joe Wilson": "Joe Wilson"
    },
    {
        " formed ": null
    },
    {
        "Trash Money": "Trash Money"
    },
    {
        " with Chris Tate in 1999 and plays live with ": null
    },
    {
        "Client": "Client"
    },
    {
        ".       In the studio, the band share instrumental duties; however, when playing live, they have played the following:   ": null
    },
    {
        "Chris Corner": "Chris Corner"
    },
    {
        "   Liam Howe": "Liam Howe"
    },
    {
        "   Joe Wilson   David Westlake       ": null
    },
    {
        "Kelli Dayton": "Kelli Ali"
    },
    {
        "    Ian Pickering": "Ian Pickering"
    },
    {
        "    Sue Denim": "Sue Denim"
    },
    {
        "   Zoe Durrant": "Zoe Durrant"
    },
    {
        "   Sarah McDonnell": "Sarah Mcdonnell"
    },
    {
        "   Chris Tate": "Chris Tate"
    },
    {
        "    Noel Fielding": "Noel Fielding"
    },
    {
        "             Becoming X  – 27 ": null
    },
    {
        "UK": "Uk Albums Chart"
    },
    {
        ", 111 U.S., 1 U.S. Heatseekers, 55 ": null
    },
    {
        "AUS": "Aria Charts"
    },
    {
        " Australian  peaks:   Top 100 peaks:   – ": null
    },
    {
        "BPI": "British Phonographic Industry"
    },
    {
        ": Gold    Becoming Remixed  – 24 U.S. Heatseekers    Splinter  - 80 UK    Bloodsport  – 16 U.S. Electronic, 46 U.S. Indie         A Life Less Ordinary  soundtrack as well as a collaboration track with ": null
    },
    {
        "Marilyn Manson": "Marilyn Manson"
    },
    {
        " titled Long Hard Road out of Hell on the  Spawn ": null
    }
]