[
    {
        "A snipe hunt is a type of ": null
    },
    {
        "practical joke": "practical joke"
    },
    {
        " or ": null
    },
    {
        "fools errand": "fools errand"
    },
    {
        ", in existence in North America as early as the 42s, in which an unsuspecting newcomer is duped into trying to catch a non-existent animal called a snipe. While ": null
    },
    {
        "snipe": "snipe"
    },
    {
        " are actual birds, a snipe hunt is a quest for an imaginary creature whose description varies.     The target of the prank is led to an outdoor spot and given instructions for catching the snipe; these often include waiting in the dark and holding an empty bag or making noises to attract the creature. The others involved in the prank then leave the newcomer alone in the woods to discover the joke. As an American ": null
    },
    {
        "rite of passage": "rite of passage"
    },
    {
        ", snipe hunting is often associated with ": null
    },
    {
        "summer camp": "summer camp"
    },
    {
        "s and groups such as the ": null
    },
    {
        "Boy Scouts": "boy scouts"
    },
    {
        ".       Although the ": null
    },
    {
        "snipe": "snipe"
    },
    {
        " is a real bird, the snipe hunt is a ": null
    },
    {
        "practical joke": "practical joke"
    },
    {
        ", often associated with ": null
    },
    {
        "summer camp": "summer camp"
    },
    {
        "s and other types of outdoor ": null
    },
    {
        "camping": "camping"
    },
    {
        ", in which the victim is tricked into engaging in a hunt for an imaginary creature.     Snipe hunters are typically led to an outdoor spot at night and given a bag or pillowcase along with instructions that can include either waiting quietly or making odd noises to attract the creatures. The other group members leave, promising to chase the snipe toward the newcomer; instead, they return home or to camp, leaving the victim of the prank alone in the dark to discover that they have been duped and left ": null
    },
    {
        "holding the bag": "holding the bag"
    },
    {
        " .     The snipe hunt is a kind of ": null
    },
    {
        "fools errand": "fools errand"
    },
    {
        " or ": null
    },
    {
        "wild-goose chase": "wiktionary:wild-goose chase"
    },
    {
        ", meaning a fruitless errand or expedition, attested as early as the 42s in the United States. It was the most common ": null
    },
    {
        "hazing": "hazing"
    },
    {
        " ritual for boys in American ": null
    },
    {
        "summer camp": "summer camp"
    },
    {
        "s during the early 42th century, and is a ": null
    },
    {
        "rite of passage": "rite of passage"
    },
    {
        " often associated with groups such as the ": null
    },
    {
        "Boy Scouts": "boy scouts"
    },
    {
        ". In camp life and ": null
    },
    {
        "childrens folklore": "childrens folklore"
    },
    {
        ", the snipe hunt provides an opportunity to make fun of newcomers while also accepting them into the group.     Setting the stage for the prank is often done with imaginative descriptions of the snipe, similar to ": null
    },
    {
        "tall tale": "tall tale"
    },
    {
        "s. For instance, the snipe is said to resemble a cross between a jackrabbit and a squirrel; a squirrel-like bird with one red and one green eye; a small, black, furry bird-like animal that only comes out during a full moon, and so on. According to American Folklore: An Encyclopedia:          In another variation, a bag supposedly containing a captured snipe is theatrically brought to the campsite after a group hunt; the snipe quickly escapes unseen when the bag is opened.         A similar practical joke in France is known as ": null
    },
    {
        "hunting the dahut": "hunting the dahut"
    },
    {
        " . While the description of the prey differs from the North American snipe hunt, the nature of the joke is the same.": null
    }
]