[
    {
        "           Snooker  is a ": null
    },
    {
        "cue sport": "cue sports"
    },
    {
        " that originated among ": null
    },
    {
        "British Army": "british army"
    },
    {
        " officers stationed in ": null
    },
    {
        "India": "india"
    },
    {
        " in the second half of the 19th century. It is played on a ": null
    },
    {
        "rectangular table": "billiard tablesnooker tables"
    },
    {
        " covered with a green cloth , with ": null
    },
    {
        "pockets": "billiard tablepockets 2"
    },
    {
        " at each of the four corners and in the middle of each long side. Using a ": null
    },
    {
        "cue stick": "cue stick"
    },
    {
        " and 21 ": null
    },
    {
        "coloured balls": "billiard ballsnooker"
    },
    {
        ", players must strike the white ball to  or  the remaining balls in the correct sequence, accumulating points for each pot. An individual game , is won by the player scoring the most points. A match is won when a player wins a predetermined number of frames.     Snooker gained its identity in 1884 when army officer ": null
    },
    {
        "Sir Neville Chamberlain": "neville francis fitzgerald chamberlain"
    },
    {
        ", stationed in ": null
    },
    {
        "Ooty": "ooty"
    },
    {
        ", ": null
    },
    {
        "Tamil Nadu": "tamil nadu"
    },
    {
        ", devised a set of rules that combined ": null
    },
    {
        "pyramid": "pyramid pool"
    },
    {
        " and ": null
    },
    {
        "black pool": "black pool"
    },
    {
        ". The word snooker was a long-used military term for inexperienced or first-year personnel. The game grew in popularity in the United Kingdom, and the ": null
    },
    {
        "Billiards Association and Control Club": "billiards association and control club"
    },
    {
        " was formed in 1919. It is now governed by the ": null
    },
    {
        "World Professional Billiards and Snooker Association": "world professional billiards and snooker association"
    },
    {
        " .     The ": null
    },
    {
        "World Snooker Championship": "world snooker championship"
    },
    {
        " has taken place since ": null
    },
    {
        "1927": "1927 world snooker championship"
    },
    {
        ". ": null
    },
    {
        "Joe Davis": "joe davis"
    },
    {
        ", a key figure in the early growth of the sport, won the championship 15 straight times between 1927 and 1946. The modern era began in 1969 after the broadcaster ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " commissioned the snooker television show  Pot Black  and later began to air the World Championship in ": null
    },
    {
        "1978": "1978 world snooker championship"
    },
    {
        ". Key figures in the game were ": null
    },
    {
        "Ray Reardon": "ray reardon"
    },
    {
        " in the 1970s, ": null
    },
    {
        "Steve Davis": "steve davis"
    },
    {
        " in the 1980s, and ": null
    },
    {
        "Stephen Hendry": "stephen hendry"
    },
    {
        " in the 1990s, each winning six or more World championships. Since 2000, ": null
    },
    {
        "Ronnie OSullivan": "ronnie osullivan"
    },
    {
        " has won the most world titles, with five. Top professional players now compete regularly around the world and earn millions of pounds on the ": null
    },
    {
        "World Snooker Tour": "world snooker tour"
    },
    {
        ", which features players from across the world.             The origin of snooker dates back to the latter half of the 19th century. In the 1870s, ": null
    },
    {
        "billiards": "english billiards"
    },
    {
        " was a popular activity among ": null
    },
    {
        "British Army": "british army"
    },
    {
        " officers stationed in ": null
    },
    {
        "India": "india"
    },
    {
        ", and several variations of the game were devised during this time. One variation that originated at the officers ": null
    },
    {
        "mess": "mess"
    },
    {
        " of the 11th ": null
    },
    {
        "Devonshire Regiment": "devonshire regiment"
    },
    {
        " in 1875 combined the rules of two ": null
    },
    {
        "pocket billiards": "pocket billiards"
    },
    {
        " games: ": null
    },
    {
        "pyramid": "pyramid pool"
    },
    {
        " and ": null
    },
    {
        "black pool": "black pool"
    },
    {
        ". The former was played with fifteen red coloured balls positioned in a triangle, while the latter involved the potting of designated balls. The game was developed in 1884 when its first set of rules was finalised by ": null
    },
    {
        "Sir Neville Chamberlain": "neville francis fitzgerald chamberlain"
    },
    {
        ", an English army officer who helped develop and popularise the game at ": null
    },
    {
        "Stone House": "stone house, ooty"
    },
    {
        " in ": null
    },
    {
        "Ooty": "ooty"
    },
    {
        " on a table built by Burroughes & Watts that was brought over by boat.     The word snooker was a slang term for first-year cadets and inexperienced military personnel, but Chamberlain would often use it for the performance of one of his fellow officers at the table. In 1887, snooker was given its first definite reference in England in a copy of  Sporting Life  which caused a growth in popularity. Chamberlain came out as the games inventor in a letter to  The Field  published on 19 March 1938, 63 years after the fact.     Snooker grew in popularity across the Indian colonies and the United Kingdom, but it remained a game mainly for the ": null
    },
    {
        "gentry": "gentry"
    },
    {
        ", and many ": null
    },
    {
        "gentlemens clubs": "gentlemens club"
    },
    {
        "that had a billiards table would not allow non-members inside to play. To accommodate the growing interest, smaller and more open snooker-specific clubs were formed. In 1919, the Billiards Association and the Billiards Control Board merged to form the ": null
    },
    {
        "Billiards Association and Control Club": "billiards association and control club"
    },
    {
        " and a new, standard set of rules for snooker first became official.     In ": null
    },
    {
        "1927": "1927 world snooker championship"
    },
    {
        " the first ": null
    },
    {
        "World Snooker Championship": "world snooker championship"
    },
    {
        " was organised by ": null
    },
    {
        "Joe Davis": "joe davis"
    },
    {
        ".  Davis, as a professional ": null
    },
    {
        "English billiards": "english billiards"
    },
    {
        " and snooker player, moved the game from a ": null
    },
    {
        "pastime": "hobby"
    },
    {
        " activity to a professional activity. Davis won every world championship until 1946, when he retired from the championships. The game went into a decline through the 1950s and 1960s with little interest generated outside of those who played. In 1959, Davis introduced a variation of the game known as ": null
    },
    {
        "Snooker Plus": "snooker plus"
    },
    {
        " to try to improve the games popularity by adding two extra colours, but this failed to gain interest.     In 1969, ": null
    },
    {
        "David Attenborough": "david attenborough"
    },
    {
        " commissioned the snooker television series  Pot Black  to demonstrate the potential of ": null
    },
    {
        "colour television": "color televisioneurope"
    },
    {
        ", with the green table and multi-coloured balls being ideal for showing off the advantages of colour broadcasting. The series became a ratings success and was for a time the second-most popular show on ": null
    },
    {
        "BBC Two": "bbc two"
    },
    {
        ". Interest in the game increased and the ": null
    },
    {
        "1978 World Snooker Championship": "1978 world snooker championship"
    },
    {
        " was the first to be fully televised. The game quickly became a mainstream game in the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", ": null
    },
    {
        "Ireland": "ireland"
    },
    {
        " and much of the ": null
    },
    {
        "Commonwealth": "commonwealth of nations"
    },
    {
        ", and has enjoyed much success since the late 1970s, with most of the ranking tournaments being televised. By the ": null
    },
    {
        "1985 World Snooker Championship": "1985 world snooker championship"
    },
    {
        " a total of 18.5 million viewers watched the ": null
    },
    {
        "concluding frame of the final": "1985 world snooker championship final"
    },
    {
        " between ": null
    },
    {
        "Dennis Taylor": "dennis taylor"
    },
    {
        " and ": null
    },
    {
        "Steve Davis": "steve davis"
    },
    {
        ", a record viewership for the United Kingdom for any broadcast after midnight. In the early 2000s, a ban on ": null
    },
    {
        "tobacco advertising": "tobacco advertising"
    },
    {
        " led to a decrease in the number of professional tournaments, with professional tournaments being cut to only 15 events in 2003, from 22 in 1999. However, the popularity of the game in Asia, with emerging talents such as ": null
    },
    {
        "Liang Wenbo": "liang wenbo"
    },
    {
        " and more established players such as ": null
    },
    {
        "Ding Junhui": "ding junhui"
    },
    {
        " and ": null
    },
    {
        "Marco Fu": "marco fu"
    },
    {
        ", boosted the sport in the Far East. By 2007, the BBC dedicated 400 hours to snooker coverage, compared to just 14 minutes 40 years earlier.     In 2010, promoter ": null
    },
    {
        "Barry Hearn": "barry hearn"
    },
    {
        " gained a controlling interest in World Snooker Ltd. and the ": null
    },
    {
        "World Snooker Tour": "world snooker tour"
    },
    {
        ", pledging to revitalise the moribund professional game. Since this time, the number of professional tournaments has increased, with 44 events in the 2019/20 season. Events have also been made to be more suitable for television broadcasts, such as the ": null
    },
    {
        "Snooker Shoot-Out": "snooker shoot-out"
    },
    {
        ", a timed, one- tournament. Prize money for professional events has also increased, with top players making several million pounds during their careers. The winner of the ": null
    },
    {
        "2020 World Snooker Championship": "2020 world snooker championship"
    },
    {
        " will receive £500,000 out of a total fund of £2,395,000.                    The objective of the game is to score more  than ones opponent by potting  in the correct order. At the start of a frame, the balls are positioned as shown in Figure A, and the players then take turns hitting shots by striking the cue ball with the  of the ": null
    },
    {
        "cue": "cue stick"
    },
    {
        ", their aim being to pot one of the red balls into a pocket and thereby score a point. Failure to make contact with the red ball constitutes a foul shot. If the striker pots a red ball, he or she must then pot one of the six colours . If the player successfully pots a colour, the value of that ball is added to the players score, and the ball is returned to its starting position on the table. After that, the player must pot another red ball, then another colour, in sequence. This process continues until the striker fails to pot the desired ball, at which point the opponent comes to the table to play the next shot. The act of scoring sequentially in this manner is to make a  .          The game continues in this manner until all the reds are potted and only the six colours are left on the table. At this point the colours must be potted in the order from least to most valuable ball, as per the table to the right. The shots are: yellow first , then green , brown , blue , pink and black , the balls not being returned to play. When the final ball is potted, the player with more points wins. If the scores are equal when all the balls have been potted, the black is placed back on its spot as a ": null
    },
    {
        "tiebreaker": "tiebreaker"
    },
    {
        ". In this situation, called , the black ball is placed on its designated spot and the cue ball is played as . The referee then tosses a coin and the winner decides which player goes first. The frame continues until one of the players pots the black ball or commits a foul. A player may also concede a frame while on strike if he or she thinks there are not enough points available on the table to beat the opponents score. In professional snooker this is a common occurrence.   Professional and competitive amateur matches are officiated by a referee. The referee also replaces the colours on the table when necessary and calls out how many points the player has scored during a break. Professional players usually play the game in a sporting manner, declaring fouls which they have committed but the referee has missed, acknowledging good shots from their opponent, and holding up a hand to apologise for fortunate shots, known as flukes .     Points in snooker are gained from potting the correct balls in sequence. The total number of consecutive points that a player amasses during one  to the table is known as a break. A player attaining a break of 15, for example, could have reached it by potting a red then a black, then a red then a pink, before failing to pot the next red. A ": null
    },
    {
        "maximum break": "maximum break"
    },
    {
        " in snooker is achieved by potting all reds with blacks then all colours, yielding 147 points; this is often known as a 147 or just as a maximum .          Points may also be scored in a game when a players opponent . A foul can occur for various reasons, most commonly for failing to hit the correct ball , or for sending the cue ball into a pocket. The former may occur when the player fails to escape from a   – a situation in which the previous player leaves the cue ball positioned such that no legal ball can be struck directly without obstruction by an illegal ball. Points gained from a foul vary from a minimum of four to a maximum of seven if the black ball is involved.     A foul shot that leaves no valid shot for the opponent can leave them a . A free ball allows a player to use any other coloured ball in place of the shot they were supposed to play. Doing so with all 15 red balls in play can result in a break exceeding a maximum, with the highest possible being a ": null
    },
    {
        "155 break": "maximum breakbreaks exceeding 147"
    },
    {
        ", achieved via the opponent leaving a , with the black being potted as the additional colour, and then potting 15 reds and blacks with the colours. ": null
    },
    {
        "Jamie Cope": "jamie cope"
    },
    {
        " has the distinction of being the first player in snooker history to post a verified 155 break, achieved in a practice frame in 2005, with other players such as ": null
    },
    {
        "Alex Higgins": "alex higgins"
    },
    {
        " also claiming to have made a similar break.     One , from the balls in their starting position until the last ball is potted, is called a  . A  generally consists of a predetermined number of frames and the player who wins the most frames wins the match. Most professional matches require a player to win five frames, and are called best of nine in reference to the maximum possible number of frames. Tournament finals are usually best of 17 or best of 19, while the world championship uses longer matches  – ranging from best of 19 in the qualifiers and the first round up to best of 35 for the final , and is played over four sessions of play held over two days.          The ": null
    },
    {
        "World Professional Billiards and Snooker Association": "world professional billiards and snooker association"
    },
    {
        " , founded in 1968 as the Professional Billiard Players Association, is the governing body for the professional competition. The amateur game is governed by the ": null
    },
    {
        "International Billiards and Snooker Federation": "international billiards and snooker federation"
    },
    {
        " . Events held specifically for women and events for seniors are handled by World Snooker under ": null
    },
    {
        "World Womens Snooker": "world womens snooker"
    },
    {
        " and the ": null
    },
    {
        "World Seniors Tour": "world seniors tour"
    },
    {
        ", respectively.         Professional snooker players play on the World Snooker Tour. Events on the Tour are only open to players on the Tour and selected amateur players, but most events require qualification. Players can qualify for the Tour either by being high enough on the world rankings from prior seasons, winning continental championships, or through the ": null
    },
    {
        "Challenge Tour": "challenge tour"
    },
    {
        " or ": null
    },
    {
        "Q School": "q school"
    },
    {
        " events. Players on the Tour generally gain two-year participation for the events.     The Tour also has an official world rankings scheme, with only players on the Tour receiving a ranking. ": null
    },
    {
        "Ranking points": "snooker world rankings"
    },
    {
        ", earned by players through their performances over the previous two seasons, determine the current world rankings. A players ranking determines what level of qualification he or she requires for specific tournaments. The elite of professional snooker are generally regarded as the top-16 ranking players. They are not required to pre-qualify for some of the tournaments, such as the ": null
    },
    {
        "Shanghai Masters": "shanghai masters"
    },
    {
        ", the ": null
    },
    {
        "Masters": "masters"
    },
    {
        " and the World Snooker Championship. Certain other events, such as those in the ": null
    },
    {
        "Coral Cup series": "coral cup"
    },
    {
        ", use the one-year ranking list to qualify; these use the results of the current season to denote participants. Currently, the Tour contains 125 players, with players in the top 64 being guaranteed a Tour place for the following season.        The oldest professional snooker tournament is the World Championship, held annually since 1927 . The tournament has been held at the ": null
    },
    {
        "Crucible Theatre": "crucible theatre"
    },
    {
        " in ": null
    },
    {
        "Sheffield": "sheffield"
    },
    {
        ", England, since 1977, and was sponsored by ": null
    },
    {
        "Embassy": "imperial tobacco"
    },
    {
        " from 1976 to 2005. Since the ban on advertising tobacco products, the championships have been sponsored by betting companies.     The World Championship is the most highly valued prize in professional snooker in terms of financial reward , ranking points and prestige. It is televised extensively in the UK by the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " and gains significant coverage in Europe on ": null
    },
    {
        "Eurosport": "eurosport"
    },
    {
        " and in East Asia on ": null
    },
    {
        "CCTV-5": "cctv-5"
    },
    {
        ". The World Championships is part of the ": null
    },
    {
        "Triple Crown": "triple crown"
    },
    {
        " along with the ": null
    },
    {
        "UK Championship": "uk championship"
    },
    {
        " and the non-ranking Masters. These events are valued by some players as the most prestigious, and are also some of the oldest competitions. Winning all three events is a difficult task, and has only been done by 11 players.     With some events having been criticised for matches taking too long, an alternative series of timed tournaments has been organised by ": null
    },
    {
        "Matchroom Sport": "matchroom sport"
    },
    {
        " chairman ": null
    },
    {
        "Barry Hearn": "barry hearn"
    },
    {
        ". The shot-timed ": null
    },
    {
        "Premier League Snooker": "premier league snooker"
    },
    {
        " was established, with seven players invited to compete at regular United Kingdom venues, televised on ": null
    },
    {
        "Sky Sports": "sky sports"
    },
    {
        ". Players had twenty-five seconds to take each shot, with five time-outs per player per match. While some success was achieved with this format, it generally did not receive the same amount of press attention or status as the regular ranking tournaments. This event has been taken out of the tour since 2013, when the ": null
    },
    {
        "Champion of Champions": "champion of champions"
    },
    {
        " was established. The Champion of Champions saw players qualify by virtue of winning other events in the season, with 16 champions competing.      In 2015, the World Professional Billiards and Snooker Association submitted an unsuccessful bid for snooker to be played at the ": null
    },
    {
        "2020 Summer Olympics": "2020 summer olympics"
    },
    {
        " in ": null
    },
    {
        "Tokyo": "tokyo"
    },
    {
        ". Another bid has been put forward for ": null
    },
    {
        "2024 Summer Olympics": "2024 summer olympics"
    },
    {
        " through the newly formed ": null
    },
    {
        "World Snooker Federation": "world snooker federation"
    },
    {
        ". A trial for the format for cue sports to be played at the 2024 games was put forward at the ": null
    },
    {
        "2019 World Team Trophy": "2019 world team trophy"
    },
    {
        ", also featuring ": null
    },
    {
        "nine-ball": "nine-ball"
    },
    {
        " and ": null
    },
    {
        "carom billiards": "carom billiards"
    },
    {
        ". Snooker has been contested at the ": null
    },
    {
        "World Games": "world games"
    },
    {
        " since ": null
    },
    {
        "2001": "cue sports at the 2001 world games"
    },
    {
        ".       Several players, such as Ronnie OSullivan, ": null
    },
    {
        "Mark Allen": "mark allen"
    },
    {
        " and Steve Davis, have warned that there are too many tournaments during the season, and that players risk burning out. In 2012, OSullivan played fewer tournaments in order to spend more time with his children, and ended the 2012–13 season ranked 19th in the world. Furthermore, he did not play any tournament in 2013 except the World Championship, which he won. OSullivan has suggested that a breakaway tour with fewer events would be beneficial to the sport, but as of 2019 no such tour has been organised.     Some leagues have allowed clubs to refuse to accept women players in tournaments. League committee leadership defended the practice, saying, If we lose two of these clubs we would lose four teams and we cant afford to lose four teams otherwise we would have no league. A ": null
    },
    {
        "World Womens Snooker": "world womens snooker championship"
    },
    {
        " spokesperson said, It is disappointing and unacceptable that in 2019 that players such as Rebecca Kenna have been the victim of antiquated discriminatory practices. The ": null
    },
    {
        "All-Party Parliamentary Group": "all-party parliamentary group"
    },
    {
        " said, The group believes that being prevented from playing in a club because of gender is archaic.               ": null
    },
    {
        "Accessories": "equipment"
    },
    {
        " used for snooker include  for the tip of the cue,  of various sorts used for playing shots that cannot be played by hand, a ": null
    },
    {
        "triangle": "rack"
    },
    {
        " to  the reds, and a scoreboard. One drawback of snooker on a full-size  table is the size of the room , which is the minimum required for comfortable cueing room on all sides. This limits the number of locations in which the game can easily be played. While ": null
    },
    {
        "pool tables": "billiard tablepool  tables"
    },
    {
        " are common to many ": null
    },
    {
        "pubs": "public house"
    },
    {
        ", snooker tends to be played either in private surroundings or in public ": null
    },
    {
        "snooker halls": "billiard hall"
    },
    {
        ". The game can also be played on smaller tables using fewer red balls. Variant table sizes include , , ,  and . Smaller tables can come in a variety of styles, such as fold-away or dining-table convertible.     A traditional snooker scoreboard resembles an ": null
    },
    {
        "abacus": "abacus"
    },
    {
        " and records the score for each frame in units and twenties and the frame scores. They are typically attached to a wall by the snooker table. A simple scoring bead is also sometimes used, called a scoring string , or scoring wire . Each bead represents a single point. Snooker players typically move one or several beads with their cue.   ; Table     : The playing surface, 356.9  cm by 177.8  cm for a standard full-size ": null
    },
    {
        "table": "billiard tablesnooker and english billiards tables"
    },
    {
        ", with six pocket holes, one at each corner and one at the centre of each of the longer side cushions.    ; Cloth   : The fully wool cloth is usually green, with a ": null
    },
    {
        "directional nap": "billiard tablecloth"
    },
    {
        " running from the baulk end of the table towards the end with the black ball spot. The cloth is often called baize ; although true baize is a lower quality cloth sometimes used on pool tables. The nap will affect the direction of the cue ball depending on which direction the cue ball is shot and also on whether left or right side is placed on the ball. Even if the cue ball is hit in exactly the same way, the nap will cause a different effect depending on whether the ball is hit down table or up table . The cloth on a snooker table is not vacuumed, as this can destroy the nap. The cloth is brushed in a straight line from the baulk end to the far end with multiple brush strokes that are straight in direction . Some table men will also then drag a dampened cloth wrapped around a short piece of board , or straight back of a brush to collect any remaining fine dust and help lay the nap down. The table is then ironed. Strachan cloth, used in official snooker tournaments, is 100% wool. Some other cloths include a small percentage of nylon.   ; Balls   :22 ": null
    },
    {
        "balls": "billiard ballsnooker"
    },
    {
        " , 52.5  mm or 2  inches in diameter.   ; ": null
    },
    {
        "Cue": "cue stick"
    },
    {
        "   : A stick, made of wood or fibreglass, tapering to a tip, usually ending in leather, which is used to strike the cue ball.   ; ": null
    },
    {
        "Cue-tip chalk": "cue sportschalk"
    },
    {
        "   : The tip of the cue is chalked to ensure good contact between the cue and the cue ball. This chalk is generally a silica-based compound rather than actual chalk of the type used on blackboards.   ; Extension   : A shorter baton that fits over, or screws into, the back end of the cue, effectively lengthening it, used for shots where the cue ball is a long distance from the player.      ; Rest   : A stick with an X-shaped head that is used to support the cue when the cue ball is out of reach at normal extension.   ; Rest head adaptor   : An attachment that slips onto a conventional rest head to make a spider or to give a slightly different bridge.   ; Hook rest   : Identical to a normal rest except for a hooked metal end. It is used to set the rest around another ball. The hook rest is the most recent invention in snooker.   ; Spider   : Similar to the rest but with an arch-shaped head; it is used to elevate and support the tip of the cue above the height of the cue ball.   ; Swan   : This equipment, consisting of a rest with a single extended neck and a fork-like prong at the end, is used to give extra cueing distance over a group of balls. If not available, a regular X rest can be placed on a spider so it in turn hangs the required distance beyond to provide similar support.   ; Triangle/rack   : This piece of equipment is used for gathering the red balls into the formation required for the break to start a frame.   ; Extended rest   : Similar to the regular rest, but with a mechanism at the butt end which makes it possible to extend the rest by up to three  feet.   ; Extended spider   : A hybrid of the swan and the spider. Its purpose is to bridge over large packs of reds. It is less common these days in professional snooker but can be used in situations where the position of one or more balls prevents the spider being placed where the striker desires.   ; Half butt   : Usually housed underneath the side of the table, the half butt is a combination of a table length rest and cue. It is rarely used unless the cue ball needs to be struck in such a way that the entire length of the table is the actual obstacle.   ; Ball marker   : A multi-purpose instrument with a D shaped notch which a referee can place next to a ball to mark its position. The referee can then remove the ball to clean it. It is also used to judge if a ball is preventing a colour from being placed on its spot and to judge if the cue ball can hit the extreme edge of a ball on when awarding a free ball .             In the professional era that began with ": null
    },
    {
        "Joe Davis": "joe davis"
    },
    {
        " in the 1930s and continues until the present day, a relatively small number of players have succeeded at the top level. Joe Davis was world champion for twenty years, retiring unbeaten after claiming his fifteenth world title in 1946 when the tournament was reinstated after the Second World War.  Davis was unbeaten in World Championship play, and was only ever beaten four times in his entire life, with all four defeats coming after his World Championship retirement and inflicted by his own brother ": null
    },
    {
        "Fred Davis": "fred davis"
    },
    {
        ". He did lose matches in handicapped tournaments, but on level terms these four defeats were the only losses of his entire career. He was also world billiards champion. It is regarded as highly unlikely that anyone will ever dominate the game to this level again.     After Davis retired from World Championship play, the next dominant force was his younger brother Fred Davis, who had lost the ": null
    },
    {
        "1940": "1940 world snooker championship"
    },
    {
        " final to Joe. By 1947, Fred Davis was deemed ready by his brother to take over the mantle, but lost the world final to the Scotsman ": null
    },
    {
        "Walter Donaldson": "walter donaldson"
    },
    {
        ".  Davis and Donaldson would contest the next four finals. After the abandonment of the World Championship in 1953, with the 1952 final boycotted by British professionals, the ": null
    },
    {
        "World Professional Match-play Championship": "world professional match-play championship"
    },
    {
        " became the unofficial world championship. Fred Davis won the event every year until its penultimate one, in 1957, which he did not enter.      ": null
    },
    {
        "John Pulman": "john pulman"
    },
    {
        " was the most successful player of the 1960s, when the ": null
    },
    {
        "world championship": "1964–68 world snooker championships"
    },
    {
        " was contested on a challenge basis.  However, when the tournament reverted to a knockout formula in 1969, he did not prosper. ": null
    },
    {
        "Ray Reardon": "ray reardon"
    },
    {
        " became the dominant force in the 1970s, winning six titles , with ": null
    },
    {
        "John Spencer": "john spencer"
    },
    {
        " winning three.       ": null
    },
    {
        "Steve Davis": "steve davis"
    },
    {
        " first world title in 1981 made him only the 11th world champion since 1927, including the winner of the boycotted 1952 title, Horace Lindrum.   Davis would win six World Championships , and competed in the most watched snooker match ever, the ": null
    },
    {
        "1985 World Snooker Championship": "1985 world snooker championship"
    },
    {
        " final with ": null
    },
    {
        "Dennis Taylor": "dennis taylor"
    },
    {
        ".  ": null
    },
    {
        "Stephen Hendry": "stephen hendry"
    },
    {
        " became the 14th in 1990 and dominated through the 1990s, winning seven titles .   ": null
    },
    {
        "Ronnie OSullivan": "ronnie osullivan"
    },
    {
        " is the closest to dominance in the modern era, having won the title on five occasions in the 21st century . ": null
    },
    {
        "Mark Williams": "mark williams"
    },
    {
        " has won three times and ": null
    },
    {
        "John Higgins": "john higgins"
    },
    {
        " four times , but since the beginning of the century, there has not been a dominant force like in previous decades, and the modern era has seen many players playing to a similar standard, instead of one player raising the bar. Davis, for example, won more ranking tournaments than the rest of the top 64 players put together by 1985. By retaining his title in 2013, OSullivan became the first player to successfully defend the World Championship since Hendry in 1996 .           ": null
    },
    {
        "American snooker": "american snooker"
    },
    {
        ", a variant dating to 1925, usually played on a  table with  balls, with a simpler rule set influenced by ": null
    },
    {
        "pool": "pool"
    },
    {
        ".     ": null
    },
    {
        "Power Snooker": "power snooker"
    },
    {
        ", a variant with only nine reds in a diamond-shaped pack, instead of 15 in a triangle, and matches limited to 30 minutes.     Sinuca brasileira , a Brazilian version with only one red ball, and divergent rules.    ": null
    },
    {
        "Six-red snooker": "six-red snooker"
    },
    {
        ", a variant played with only six reds in a triangular pack.   ": null
    },
    {
        "Snookerpool": "snookerpool"
    },
    {
        ", a variant played on an American pool table with ten reds in a triangular pack.   ": null
    },
    {
        "Snookerpool Rapide": "snookerpool rapide"
    },
    {
        ", a variant of Snookerpool, but with a 15-second shot clock.   ": null
    },
    {
        "Snooker plus": "snooker plus"
    },
    {
        ", a variant with two additional  , allowing a ": null
    },
    {
        "maximum break": "maximum break"
    },
    {
        " of 210. The variation was created by Joe Davis in 1959 and used at the ": null
    },
    {
        "1959 News of the World Snooker Plus Tournament": "1959 news of the world snooker plus tournament"
    },
    {
        ". It failed to gain popularity.   ": null
    },
    {
        "Tenball": "tenball"
    },
    {
        ", a snooker variant specifically for the television show of the same name. A yellow and black ball placed between the blue and pink worth ten points is added. The game had slightly revised rules, and lasted for one series presented by ": null
    },
    {
        "Philip Schofield": "philip schofield"
    },
    {
        ".   ": null
    }
]