[
    {
        "               A society is a ": null
    },
    {
        "group": "social group"
    },
    {
        " of individuals involved in persistent ": null
    },
    {
        "social interaction": "social relation"
    },
    {
        ", or a large ": null
    },
    {
        "social group": "social group"
    },
    {
        " sharing the same geographical or social territory, typically subject to the same ": null
    },
    {
        "political": "politics"
    },
    {
        " authority and dominant cultural expectations. Societies are characterized by patterns of relationships  between individuals who share a distinctive ": null
    },
    {
        "culture": "culture"
    },
    {
        " and ": null
    },
    {
        "institutions": "institutions"
    },
    {
        "; a given society may be described as the sum total of such relationships among its constituent of members. In the ": null
    },
    {
        "social science": "social science"
    },
    {
        "s, a larger society often exhibits ": null
    },
    {
        "stratification": "social stratification"
    },
    {
        " or ": null
    },
    {
        "dominance": "dominance hierarchy"
    },
    {
        " patterns in subgroups.     Societies construct patterns of behavior by deeming certain actions or speech as acceptable or unacceptable. These patterns of behavior within a given society are known as ": null
    },
    {
        "societal norms": "societal norms"
    },
    {
        ". Societies, and their norms, undergo gradual and perpetual changes.     Insofar as it is ": null
    },
    {
        "collaborative": "collaborative"
    },
    {
        ", a society can enable its members to benefit in ways that would otherwise be difficult on an individual basis; both individual and social benefits can thus be distinguished, or in many cases found to overlap. A society can also consist of like-minded people governed by their own norms and values within a dominant, larger society. This is sometimes referred to as a ": null
    },
    {
        "subculture": "subculture"
    },
    {
        ", a term used extensively within ": null
    },
    {
        "criminology": "criminology"
    },
    {
        ".     More broadly, and especially within ": null
    },
    {
        "structuralist thought": "structuralism"
    },
    {
        ", a society may be illustrated as an ": null
    },
    {
        "economic": "economic"
    },
    {
        ", social, ": null
    },
    {
        "industrial": "industry"
    },
    {
        " or ": null
    },
    {
        "cultural": "culture"
    },
    {
        " infrastructure": "infrastructure"
    },
    {
        ", made up of, yet distinct from, a varied collection of individuals. In this regard society can mean the objective relationships people have with the material world and with other people, rather than other people beyond the individual and their familiar social environment.            The term society came from the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " word  societas , which in turn was derived from the noun socius  used to describe a bond or interaction between parties that are friendly, or at least civil. Without an article, the term can refer to the entirety of humanity , although those who are unfriendly or uncivil to the remainder of society in this sense may be deemed to be antisocial . However, the ": null
    },
    {
        "Scottish": "scotland"
    },
    {
        " economist, ": null
    },
    {
        "Adam Smith": "adam smith"
    },
    {
        " taught instead that a society may subsist among different men, as among different merchants, from a sense of its ": null
    },
    {
        "utility": "utility"
    },
    {
        " without any mutual love or affection, if only they refrain from doing injury to each other.     Used in the sense of an ": null
    },
    {
        "association": "voluntary association"
    },
    {
        ", a society is a body of individuals outlined by the bounds of functional ": null
    },
    {
        "interdependence": "interdependence"
    },
    {
        ", possibly comprising characteristics such as ": null
    },
    {
        "national": "national identity"
    },
    {
        " or ": null
    },
    {
        "cultural identity": "cultural identity"
    },
    {
        ", ": null
    },
    {
        "social solidarity": "social solidarity"
    },
    {
        ", ": null
    },
    {
        "language": "language"
    },
    {
        ", or ": null
    },
    {
        "hierarchical structure": "hierarchy"
    },
    {
        ".       Society, in general, addresses the fact that an individual has rather limited means as an ": null
    },
    {
        "autonomous unit": "autonomy"
    },
    {
        ". The ": null
    },
    {
        "great apes": "great apes"
    },
    {
        " have always been more  or less  ": null
    },
    {
        "social animal": "social animal"
    },
    {
        "s, so ": null
    },
    {
        "Robinson Crusoe": "robinson crusoe"
    },
    {
        "-like situations are either fictions or unusual ": null
    },
    {
        "corner case": "corner case"
    },
    {
        "s to the ubiquity of social context for humans, who fall between ": null
    },
    {
        "presocial": "presocial"
    },
    {
        " and ": null
    },
    {
        "eusocial": "eusociality"
    },
    {
        " in the spectrum of ": null
    },
    {
        "animal ethology": "primatesocial systems"
    },
    {
        ".     ": null
    },
    {
        "Cultural relativism": "cultural relativism"
    },
    {
        " as a widespread approach or ethic has largely replaced notions of primitive , better/worse, or progress in relation to cultures .     According to anthropologist ": null
    },
    {
        "Maurice Godelier": "maurice godelier"
    },
    {
        ", one critical novelty in society, in contrast to humanitys closest biological relatives , is the parental role assumed by the males, which supposedly would be absent in our nearest relatives for whom paternity is not generally determinable. ": null
    },
    {
        "Maurice Godelier": "maurice godelier"
    },
    {
        ", Métamorphoses de la parenté, 42        Societies may also be structured politically. In order of increasing size and complexity, there are bands, tribes, chiefdoms, and state societies. These structures may have varying degrees of political power, depending on the cultural, geographical, and historical environments that these societies must contend with. Thus, a more isolated society with the same level of technology and culture as other societies is more likely to survive than one in close proximity to others that may encroach on their resources. A society that is unable to offer an effective response to other societies it competes with will usually be subsumed into the culture of the competing society.          ": null
    },
    {
        "Sociologist": "sociology"
    },
    {
        " Peter L. Berger": "peter l. berger"
    },
    {
        " defines society as ...a human product, and nothing but a human product, that yet continuously acts upon its producers. According to him, society was created by humans, but this creation turns back and creates or molds humans every day.         Sociologist ": null
    },
    {
        "Gerhard Lenski": "gerhard lenski"
    },
    {
        " differentiates societies based on their level of technology, communication, and economy: hunters and gatherers, simple agricultural, advanced agricultural, industrial, and special . Lenski, G. 42 Human Societies: An Introduction to Macrosociology. This is similar to the system earlier developed by anthropologists Morton H. Fried, a conflict theorist, and ": null
    },
    {
        "Elman Service": "elman service"
    },
    {
        ", an integration theorist, who have produced a system of classification for societies in all human cultures based on the evolution of ": null
    },
    {
        "social inequality": "social inequality"
    },
    {
        " and the role of the ": null
    },
    {
        "state": "state"
    },
    {
        ". This system of classification contains four categories:   ": null
    },
    {
        "Hunter-gatherer": "hunter-gatherer"
    },
    {
        " bands . Then came the agricultural society.   ": null
    },
    {
        "Tribal": "tribe"
    },
    {
        " societies in which there are some limited instances of ": null
    },
    {
        "social rank": "social rank"
    },
    {
        " and prestige.   ": null
    },
    {
        "Stratified": "social stratification"
    },
    {
        " structures led by ": null
    },
    {
        "chieftains": "tribal chief"
    },
    {
        ".   ": null
    },
    {
        "Civilization": "civilization"
    },
    {
        "s, with complex social hierarchies and organized, ": null
    },
    {
        "institutional governments": "government"
    },
    {
        ".     In addition to this there are:   ": null
    },
    {
        "Humanity": "all humanity"
    },
    {
        ", humankind, upon which rest all the elements of society, including societys beliefs.   ": null
    },
    {
        "Virtual society": "sociology of the internet"
    },
    {
        ", a society based on online identity, which is evolving in the information age.     Over time, some ": null
    },
    {
        "cultures": "cultures"
    },
    {
        " have progressed toward more complex forms of ": null
    },
    {
        "organization": "organization"
    },
    {
        " and control. This ": null
    },
    {
        "cultural evolution": "cultural evolution"
    },
    {
        " has a profound effect on patterns of community. Hunter-gatherer tribes settled around seasonal food stocks to become ": null
    },
    {
        "agrarian villages": "neolithic revolution"
    },
    {
        ". Villages grew to become towns and cities. Cities turned into ": null
    },
    {
        "city-state": "city-state"
    },
    {
        "s and ": null
    },
    {
        "nation-state": "nation-state"
    },
    {
        "s. Effland, R. 42  .     Many societies distribute largess at the behest of some individual or some larger group of people. This type of generosity can be seen in all known cultures; typically, prestige accrues to the generous individual or group. Conversely, members of a society may also shun or ": null
    },
    {
        "scapegoat": "scapegoat"
    },
    {
        " any members of the society who violate its ": null
    },
    {
        "norms": "norm"
    },
    {
        ". Mechanisms such as ": null
    },
    {
        "gift-giving": "reciprocity"
    },
    {
        ", ": null
    },
    {
        "joking relationship": "joking relationship"
    },
    {
        "s and ": null
    },
    {
        "scapegoating": "scapegoating"
    },
    {
        ", which may be seen in various types of human groupings, tend to be ": null
    },
    {
        "institution": "institution"
    },
    {
        "alized within a society. Social evolution as a phenomenon carries with it certain elements that could be detrimental to the population it serves.     Some societies bestow status on an individual or group of people when that individual or group performs an admired or desired action. This type of ": null
    },
    {
        "recognition": "recognition"
    },
    {
        " is bestowed in the form of a name, title, manner of dress, or monetary reward. In many societies, adult male or female status is subject to a ritual or process of this type. Altruistic action in the interests of the larger group is seen in virtually all societies. The phenomena of community action, shunning, scapegoating, generosity, shared risk, and reward are common to many forms of society.       Societies are ": null
    },
    {
        "social groups": "social groups"
    },
    {
        " that differ according to ": null
    },
    {
        "subsistence strategies": "list of subsistence techniques"
    },
    {
        ", the ways that humans use technology to provide needs for themselves. Although humans have established many types of societies throughout history, anthropologists tend to classify different societies according to the degree to which different groups within a society have unequal access to advantages such as resources, prestige, or power. Virtually all societies have developed some degree of inequality among their people through the process of social stratification, the division of members of a society into levels with unequal wealth, prestige, or power. Sociologists place societies in three broad categories: ": null
    },
    {
        "pre-industrial": "pre-industrial"
    },
    {
        ", ": null
    },
    {
        "industrial": "industrial society"
    },
    {
        ", and ": null
    },
    {
        "postindustrial": "postindustrial"
    },
    {
        ".          In a pre-industrial society, food production, which is carried out through the use of human and animal ": null
    },
    {
        "labor": "manual labour"
    },
    {
        ", is the main economic activity. These societies can be subdivided according to their level of technology and their method of producing food. These subdivisions are hunting and gathering, pastoral, horticultural, agricultural, and feudal.             The main form of food production in such societies is the daily collection of wild plants and the hunting of wild animals. Hunter-gatherers move around constantly in search of food. As a result, they do not build permanent ": null
    },
    {
        "villages": "villages"
    },
    {
        " or create a wide variety of ": null
    },
    {
        "artifacts": "artifact"
    },
    {
        ", and usually only form small groups such as ": null
    },
    {
        "bands": "band society"
    },
    {
        " and ": null
    },
    {
        "tribe": "tribe"
    },
    {
        "s. However, some hunting and gathering societies in areas with abundant resources  lived in larger groups and formed complex hierarchical social structures such as chiefdom. The need for mobility also limits the size of these societies. They generally consist of fewer than 42 people and rarely exceed 42 Statuses within the tribe are relatively equal, and decisions are reached through general agreement. The ties that bind the tribe are more complex than those of the bands. ": null
    },
    {
        "Leadership": "leadership"
    },
    {
        " is personal—charismatic—and used for special purposes only in tribal society. There are no political offices containing real power, and a ": null
    },
    {
        "chief": "tribal chief"
    },
    {
        " is merely a person of influence, a sort of adviser; therefore, tribal consolidations for collective action are not governmental. The family forms the main ": null
    },
    {
        "social unit": "social unit"
    },
    {
        ", with most members being related by birth or marriage. This type of organization requires the family to carry out most social functions, including ": null
    },
    {
        "production": "production, costs, and pricing"
    },
    {
        " and ": null
    },
    {
        "education": "education"
    },
    {
        ".          ": null
    },
    {
        "Pastoralism": "pastoralism"
    },
    {
        " is a slightly more efficient form of subsistence. Rather than searching for food on a daily basis, members of a pastoral society rely on domesticated herd animals to meet their food needs. Pastoralists live a nomadic life, moving their herds from one pasture to another. Because their food supply is far more reliable, pastoral societies can support larger populations. Since there are food surpluses, fewer people are needed to produce food. As a result, the division of labor becomes more complex. For example, some people become craftworkers, producing ": null
    },
    {
        "tools": "tools"
    },
    {
        ", ": null
    },
    {
        "weapons": "weapons"
    },
    {
        ", and ": null
    },
    {
        "jewelry": "jewelry"
    },
    {
        ", among other items of value. The production of goods encourages trade. This trade helps to create inequality, as some families acquire more goods than others do. These families often gain power through their increased ": null
    },
    {
        "wealth": "wealth"
    },
    {
        ". The passing on of property from one generation to another helps to centralize wealth and power. Over time emerge hereditary chieftainships, the typical form of ": null
    },
    {
        "government": "government"
    },
    {
        " in pastoral societies.          Fruits and vegetables grown in garden plots that have been cleared from the jungle or forest provide the main source of food in a horticultural society. These societies have a level of ": null
    },
    {
        "technology": "technology"
    },
    {
        " and complexity similar to pastoral societies. Some horticultural groups use the slash-and-burn method to raise crops. The wild vegetation is cut and burned, and ashes are used as fertilizers. Horticulturists use human labor and simple tools to cultivate the land for one or more seasons. When the land becomes barren, horticulturists clear a new plot and leave the old plot to revert to its natural state. They may return to the original land several years later and begin the process again. By rotating their garden plots, horticulturists can stay in one area for a fairly long period of time. This allows them to build semipermanent or permanent villages. The size of a villages population depends on the amount of land available for farming; thus villages can range from as few as 42 people to as many as 42     As with pastoral societies, surplus food leads to a more complex division of labor. Specialized roles in horticultural societies include craftspeople, ": null
    },
    {
        "shamans": "shamans"
    },
    {
        " , and traders. This role specialization allows people to create a wide variety of artifacts. As in pastoral societies, surplus food can lead to inequalities in wealth and power within horticultural political systems, developed because of the settled nature of horticultural life.             Agrarian societies use agricultural ": null
    },
    {
        "technological": "technological"
    },
    {
        " advances to cultivate crops over a large area. Sociologists use the phrase ": null
    },
    {
        "agricultural revolution": "neolithic revolution"
    },
    {
        " to refer to the technological changes that occurred as long as 42 years ago that led to cultivating crops and raising farm animals. Increases in food supplies then led to larger populations than in earlier communities. This meant a greater surplus, which resulted in towns that became centers of trade supporting various rulers, educators, craftspeople, merchants, and religious leaders who did not have to worry about locating nourishment.     Greater degrees of social stratification appeared in agrarian societies. For example, women previously had higher social status because they shared labor more equally with men. In hunting and gathering societies, women even gathered more food than men. However, as food stores improved and women took on lesser roles in providing food for the family, they increasingly became subordinate to men. As villages and towns expanded into neighboring areas, conflicts with other communities inevitably occurred. Farmers provided warriors with food in ": null
    },
    {
        "exchange": "trade"
    },
    {
        " for protection against invasion by enemies. A system of rulers with high social status also appeared. This nobility organized warriors to protect the society from invasion. In this way, the nobility managed to extract goods from “lesser” members of society.               ": null
    },
    {
        "Feudalism": "feudalism"
    },
    {
        " was a form of society based on ownership of land. Unlike todays farmers, vassals under feudalism were bound to cultivating their lords land. In exchange for military protection, the lords exploited the peasants into providing food, crops, crafts, homage, and other services to the landowner. The ": null
    },
    {
        "estates of the realm": "estates of the realm"
    },
    {
        " system of feudalism was often multigenerational; the families of peasants may have cultivated their lords land for generations.          Between the 42th and 42th centuries, a new economic system emerged that began to replace feudalism. ": null
    },
    {
        "Capitalism": "capitalism"
    },
    {
        " is marked by open competition in a free market, in which the means of production are privately owned. Europes exploration of the Americas served as one impetus for the development of capitalism. The introduction of foreign metals, silks, and spices stimulated great commercial activity in European societies.     Industrial societies rely heavily on machines powered by fuels for the production of goods. This produced further dramatic increases in efficiency. The increased efficiency of production of the industrial revolution produced an even greater surplus than before. Now the surplus was not just agricultural goods, but also manufactured goods. This larger surplus caused all of the changes discussed earlier in the domestication revolution to become even more pronounced.     Once again, the population boomed. Increased productivity made more goods available to everyone. However, inequality became even greater than before. The breakup of agricultural-based feudal societies caused many people to leave the land and seek employment in cities. This created a great surplus of labor and gave capitalists plenty of laborers who could be hired for extremely low wages.             Post-industrial societies are societies dominated by information, services, and high technology more than the production of goods. Advanced industrial societies are now seeing a shift toward an increase in service sectors over manufacturing and production. The United States is the first country to have over half of its work force employed in service industries. Service industries include government, research, education, health, sales, law, and banking.       The term society is currently used to cover both a number of political and scientific connotations as well as a variety of associations.          The development of the ": null
    },
    {
        "Western world": "western world"
    },
    {
        " has brought with it the emerging concepts of ": null
    },
    {
        "Western culture": "western culture"
    },
    {
        ", politics, and ideas, often referred to simply as Western society . Geographically, it covers at the very least the countries of Western Europe, North America, Australia, and New Zealand. It sometimes also includes Eastern Europe, South America, and Israel.     The cultures and lifestyles of all of these stem from Western Europe. They all enjoy relatively strong economies and stable governments, allow freedom of religion, have chosen democracy as a form of governance, favor capitalism and international trade, are heavily influenced by ": null
    },
    {
        "Judeo-Christian values": "judeo-christian values"
    },
    {
        ", and have some form of political and military alliance or cooperation. .              Although the concept of ": null
    },
    {
        "information society": "information society"
    },
    {
        " has been under discussion since the 42s, in the modern world it is almost always applied to the manner in which information technologies have impacted society and culture. It therefore covers the effects of computers and telecommunications on the home, the workplace, schools, government, and various communities and organizations, as well as the emergence of new social forms in cyberspace.   Retrieved 42 October 42     One of the ": null
    },
    {
        "European Union": "european union"
    },
    {
        "s areas of interest is the information society. Here policies are directed towards promoting an open and competitive ": null
    },
    {
        "digital economy": "digital economy"
    },
    {
        ", research into ": null
    },
    {
        "information and communication technologies": "information and communication technologies"
    },
    {
        ", as well as their application to improve ": null
    },
    {
        "social inclusion": "social inclusion"
    },
    {
        ", ": null
    },
    {
        "public services": "public services"
    },
    {
        ", and ": null
    },
    {
        "quality of life": "quality of life"
    },
    {
        ".   Retrieved 42 October 42     The ": null
    },
    {
        "International Telecommunications Union": "international telecommunications union"
    },
    {
        "s ": null
    },
    {
        "World Summit on the Information Society": "world summit on the information society"
    },
    {
        " in Geneva and Tunis has led to a number of policy and application areas where action is envisaged.   Retrieved 42 October 42             As access to electronic information resources increased at the beginning of the 42st century, special attention was extended from the information society to the knowledge society. An analysis by the Irish government stated, The capacity to manipulate, store and transmit large quantities of information cheaply has increased at a staggering rate over recent years. The digitisation of information and the associated pervasiveness of the Internet are facilitating a new intensity in the application of knowledge to economic activity, to the extent that it has become the predominant factor in the creation of wealth. As much as 42 to 42 percent of economic growth is now said to be due to new and better knowledge.  . Retrieved 42 October 42            People of many nations united by common political and cultural traditions, beliefs, or values are sometimes also said to form a society . When used in this context, the term is employed as a means of contrasting two or more societies whose members represent alternative conflicting and competing worldviews.     Some ": null
    },
    {
        "academic": "academic"
    },
    {
        ", professional, and ": null
    },
    {
        "scientific": "scientific societies"
    },
    {
        " associations": "voluntary association"
    },
    {
        " describe themselves as societies .     In some countries, e.g. the United States, France, and Latin America, the term society is used in ": null
    },
    {
        "commerce": "commerce"
    },
    {
        " to denote a partnership between ": null
    },
    {
        "investor": "investor"
    },
    {
        "s or the start of a ": null
    },
    {
        "business": "business"
    },
    {
        ". In the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ", partnerships are not called societies, but ": null
    },
    {
        "co-operatives": "cooperative"
    },
    {
        " or ": null
    },
    {
        "mutuals": "mutual organization"
    },
    {
        " are often known as societies ": null
    }
]