[
    {
        "               Social science is a category of ": null
    },
    {
        "academic disciplines": "discipline"
    },
    {
        " concerned with ": null
    },
    {
        "society": "society"
    },
    {
        " and the ": null
    },
    {
        "relationships": "social relation"
    },
    {
        " among ": null
    },
    {
        "individuals": "individuals"
    },
    {
        " within a society. The disciplines include, but are not limited to: ": null
    },
    {
        "anthropology": "anthropology"
    },
    {
        ", ": null
    },
    {
        "archaeology": "archaeology"
    },
    {
        ", ": null
    },
    {
        "communication studies": "communication studies"
    },
    {
        ", ": null
    },
    {
        "economics": "economics"
    },
    {
        ", ": null
    },
    {
        "folkloristics": "folkloristics"
    },
    {
        ", ": null
    },
    {
        "history": "history"
    },
    {
        ", ": null
    },
    {
        "musicology": "musicology"
    },
    {
        ", ": null
    },
    {
        "human geography": "human geography"
    },
    {
        ", ": null
    },
    {
        "jurisprudence": "jurisprudence"
    },
    {
        ", ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        ", ": null
    },
    {
        "political science": "political science"
    },
    {
        ", ": null
    },
    {
        "psychology": "psychology"
    },
    {
        ", ": null
    },
    {
        "public health": "public health"
    },
    {
        ", and ": null
    },
    {
        "sociology": "sociology"
    },
    {
        ". The term is also sometimes used to refer specifically to the field of sociology, the original science of society , established in the 19th century. For a more detailed list of sub-disciplines within the social sciences see: ": null
    },
    {
        "Outline of social science": "outline of social science"
    },
    {
        ".     ": null
    },
    {
        "Positivist": "positivism"
    },
    {
        " social scientists use methods resembling those of the ": null
    },
    {
        "natural sciences": "natural science"
    },
    {
        "as tools for understanding society, and so define science in its stricter ": null
    },
    {
        "modern sense": "modern science"
    },
    {
        ". ": null
    },
    {
        "Interpretivist": "antipositivism"
    },
    {
        " social scientists, by contrast, may use social critique or symbolic interpretation rather than constructing empirically ": null
    },
    {
        "falsifiable": "falsifiable"
    },
    {
        " theories, and thus treat science in its broader sense. In modern academic practice, researchers are often ": null
    },
    {
        "eclectic": "eclecticism"
    },
    {
        ", using multiple ": null
    },
    {
        "methodologies": "methodology"
    },
    {
        " . The term ": null
    },
    {
        "social research": "social research"
    },
    {
        " has also acquired a degree of autonomy as practitioners from various disciplines share in its aims and methods.             The history of the social sciences begins in the ": null
    },
    {
        "Age of Enlightenment": "age of enlightenment"
    },
    {
        " after 1650,  which saw a revolution within ": null
    },
    {
        "natural philosophy": "natural philosophy"
    },
    {
        ", changing the basic framework by which individuals understood what was scientific . Social sciences came forth from the ": null
    },
    {
        "moral philosophy": "moral philosophy"
    },
    {
        " of the time and were influenced by the ": null
    },
    {
        "Age of Revolution": "age of revolution"
    },
    {
        "s, such as the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " and the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". The social sciences developed from the ": null
    },
    {
        "sciences": "science"
    },
    {
        " , or the systematic knowledge-bases or prescriptive practices, relating to the ": null
    },
    {
        "social improvement": "social improvement"
    },
    {
        " of a ": null
    },
    {
        "group of interacting entities": "community"
    },
    {
        ".     The beginnings of the social sciences in the 18th century are reflected in the ": null
    },
    {
        "grand encyclopedia of Diderot": "encyclopédie"
    },
    {
        ", with articles from ": null
    },
    {
        "Jean-Jacques Rousseau": "jean-jacques rousseau"
    },
    {
        " and other pioneers. The growth of the social sciences is also reflected in other specialized encyclopedias. The modern period saw social science first used as a distinct conceptual field.  Social science was influenced by ": null
    },
    {
        "positivism": "positivism"
    },
    {
        ", focusing on knowledge based on actual positive sense experience and avoiding the negative; ": null
    },
    {
        "metaphysical": "metaphysics"
    },
    {
        " speculation was avoided. ": null
    },
    {
        "Auguste Comte": "auguste comte"
    },
    {
        " used the term science sociale to describe the field, taken from the ideas of ": null
    },
    {
        "Charles Fourier": "charles fourier"
    },
    {
        "; Comte also referred to the field as social physics. According to Comte, the social physics field was similar to that of ": null
    },
    {
        "natural sciences": "natural sciences"
    },
    {
        ".     Following this period, five paths of development sprang forth in the social sciences, influenced by Comte in other fields. One route that was taken was the rise of ": null
    },
    {
        "social research": "social research"
    },
    {
        ". Large ": null
    },
    {
        "statistical surveys": "statistical survey"
    },
    {
        "were undertaken in various parts of the United States and Europe. Another route undertaken was initiated by ": null
    },
    {
        "Émile Durkheim": "émile durkheim"
    },
    {
        ", studying social facts , and ": null
    },
    {
        "Vilfredo Pareto": "vilfredo pareto"
    },
    {
        ", opening metatheoretical ideas and individual theories. A third means developed, arising from the methodological dichotomy present, in which ": null
    },
    {
        "social phenomena": "social phenomena"
    },
    {
        " were identified with and understood; this was championed by figures such as ": null
    },
    {
        "Max Weber": "max weber"
    },
    {
        ". The fourth route taken, based in economics, was developed and furthered economic knowledge as a ": null
    },
    {
        "hard science": "hard science"
    },
    {
        ". The last path was the ": null
    },
    {
        "correlation": "correlation"
    },
    {
        " of knowledge and ": null
    },
    {
        "social values": "value"
    },
    {
        "; the ": null
    },
    {
        "antipositivism": "antipositivism"
    },
    {
        " and ": null
    },
    {
        "verstehen": "verstehen"
    },
    {
        " sociology of ": null
    },
    {
        "Max Weber": "max weber"
    },
    {
        " firmly demanded this distinction. In this route, theory and prescription were non-overlapping formal discussions of a subject.     Around the start of the 20th century, ": null
    },
    {
        "Enlightenment philosophy": "enlightenment philosophy"
    },
    {
        " was challenged in various quarters. After the use of classical theories since the end of the scientific revolution, various fields substituted mathematics studies for experimental studies and examining equations to build a theoretical structure. The development of social science subfields became very quantitative in ": null
    },
    {
        "methodology": "methodology"
    },
    {
        ". The ": null
    },
    {
        "interdisciplinary": "interdisciplinary"
    },
    {
        " and cross-disciplinary nature of scientific inquiry into human behaviour, social and environmental factors affecting it, made many of the natural sciences interested in some aspects of social science methodology.  Examples of boundary blurring include emerging disciplines like social research of ": null
    },
    {
        "medicine": "medicine"
    },
    {
        ", ": null
    },
    {
        "sociobiology": "sociobiology"
    },
    {
        ", ": null
    },
    {
        "neuropsychology": "neuropsychology"
    },
    {
        ", ": null
    },
    {
        "bioeconomics": "bioeconomics"
    },
    {
        " and the ": null
    },
    {
        "history": "history of science"
    },
    {
        " and ": null
    },
    {
        "sociology of science": "sociology of science"
    },
    {
        ". Increasingly, ": null
    },
    {
        "quantitative research": "quantitative research"
    },
    {
        " and ": null
    },
    {
        "qualitative methods": "qualitative methods"
    },
    {
        " are being integrated in the study of human action and its implications and consequences. In the first half of the 20th century, statistics became a free-standing discipline of applied mathematics. Statistical methods were used confidently.     In the contemporary period, ": null
    },
    {
        "Karl Popper": "karl popper"
    },
    {
        " and ": null
    },
    {
        "Talcott Parsons": "talcott parsons"
    },
    {
        " influenced the furtherance of the social sciences. Researchers continue to search for a unified consensus on what methodology might have the power and refinement to connect a proposed grand theory with the various midrange theories that, with considerable success, continue to provide usable frameworks for massive, growing data banks; for more, see ": null
    },
    {
        "consilience": "consilience"
    },
    {
        ". The social sciences will for the foreseeable future be composed of different zones in the research of, and sometime distinct in approach toward, the field.     The term social science may refer either to the specific sciences of society established by thinkers such as Comte, Durkheim, Marx, and Weber, or more generally to all disciplines outside of noble science and ": null
    },
    {
        "arts": "arts"
    },
    {
        ". By the late 19th century, the academic social sciences were constituted of five fields: ": null
    },
    {
        "jurisprudence": "jurisprudence"
    },
    {
        " and amendment of the ": null
    },
    {
        "law": "law"
    },
    {
        ", ": null
    },
    {
        "education": "education"
    },
    {
        ", ": null
    },
    {
        "health": "health"
    },
    {
        ", ": null
    },
    {
        "economy": "economy"
    },
    {
        " and ": null
    },
    {
        "trade": "trade"
    },
    {
        ", and ": null
    },
    {
        "art": "art"
    },
    {
        ".     Around the start of the 21st century, the expanding domain of ": null
    },
    {
        "economics": "economics"
    },
    {
        " in the social sciences has been described as ": null
    },
    {
        "economic imperialism": "economic imperialism"
    },
    {
        ".               The social science disciplines are branches of knowledge taught and researched at the college or university level. Social science disciplines are defined and recognized by the ": null
    },
    {
        "academic journals": "academic journal"
    },
    {
        "in which research is published, and the learned social science societies and academic departments or faculties to which their practitioners belong. Social science fields of study usually have several sub-disciplines or branches, and the distinguishing lines between these are often both arbitrary and ambiguous.            ": null
    },
    {
        "Anthropology": "anthropology"
    },
    {
        " is the holistic science of man , a science of the totality of human existence. The discipline deals with the integration of different aspects of the social sciences, ": null
    },
    {
        "humanities": "humanities"
    },
    {
        ", and ": null
    },
    {
        "human biology": "human biology"
    },
    {
        ". In the twentieth century, academic disciplines have often been institutionally divided into three broad domains. The natural sciences seek to derive general laws through reproducible and verifiable experiments. The humanities generally study local traditions, through their history, literature, music, and arts, with an emphasis on understanding particular individuals, events, or eras. The social sciences have generally attempted to develop scientific methods to understand social phenomena in a generalizable way, though usually with methods distinct from those of the natural sciences.     The anthropological social sciences often develop nuanced descriptions rather than the general laws derived in physics or chemistry, or they may explain individual cases through more general principles, as in many fields of ": null
    },
    {
        "psychology": "psychology"
    },
    {
        ". Anthropology does not easily fit into one of these categories, and different branches of anthropology draw on one or more of these domains.  Within the United States, anthropology is divided into four sub-fields: ": null
    },
    {
        "archaeology": "archaeology"
    },
    {
        ", ": null
    },
    {
        "physical": "physical anthropology"
    },
    {
        " or ": null
    },
    {
        "biological anthropology": "physical anthropology"
    },
    {
        ", ": null
    },
    {
        "anthropological linguistics": "anthropological linguistics"
    },
    {
        ", and ": null
    },
    {
        "cultural anthropology": "cultural anthropology"
    },
    {
        ". It is an area that is offered at most undergraduate institutions. The word anthropos in ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        " means human being or person . ": null
    },
    {
        "Eric Wolf": "eric wolf"
    },
    {
        " described sociocultural anthropology as the most scientific of the humanities, and the most humanistic of the sciences .     The goal of anthropology is to provide a ": null
    },
    {
        "holistic": "holism"
    },
    {
        " account of humans and human nature. This means that, though anthropologists generally specialize in only one sub-field, they always keep in mind the biological, linguistic, historic and cultural aspects of any problem. Since anthropology arose as a science in Western societies that were complex and industrial, a major trend within anthropology has been a methodological drive to study peoples in societies with more simple social organization, sometimes called primitive in anthropological literature, but without any connotation of inferior . ;  Originally published 1871. Today, anthropologists use terms such as less complex societies or refer to specific modes of ": null
    },
    {
        "subsistence": "subsistence"
    },
    {
        " or ": null
    },
    {
        "production": "modes of production"
    },
    {
        ", such as pastoralist or forager or horticulturalist to refer to humans living in non-industrial, non-Western cultures, such people or folk  remaining of great interest within anthropology.     The quest for holism leads most anthropologists to study a people in detail, using biogenetic, archaeological, and linguistic data alongside direct observation of contemporary customs. ": null
    },
    {
        "Nanda, Serena": "serena nanda"
    },
    {
        " and Richard Warms. Culture Counts. Wadsworth. 2008. Chapter One In the 1990s and 2000s, calls for clarification of what constitutes a culture, of how an observer knows where his or her own culture ends and another begins, and other crucial topics in writing anthropology were heard. It is possible to view all human cultures as part of one large, evolving global culture. These dynamic relationships, between what can be observed on the ground, as opposed to what can be observed by compiling many local observations remain fundamental in any kind of ": null
    },
    {
        "anthropology": "anthropology"
    },
    {
        ", whether cultural, biological, linguistic or archaeological. Rosaldo, Renato. Culture and Truth: The remaking of social analysis. Beacon Press. 1993; Inda, John Xavier and Renato Rosaldo. The Anthropology of Globalization. Wiley-Blackwell. 2007          Communication studies deals with processes of human ": null
    },
    {
        "communication": "communication"
    },
    {
        ", commonly defined as the sharing of ": null
    },
    {
        "symbols": "symbols"
    },
    {
        " to create ": null
    },
    {
        "meaning": "meaning"
    },
    {
        ". The discipline encompasses a range of topics, from face-to-face ": null
    },
    {
        "conversation": "conversation"
    },
    {
        " to mass media outlets such as ": null
    },
    {
        "television broadcasting": "television broadcasting"
    },
    {
        ". Communication studies also examines how messages are interpreted through the political, cultural, economic, and social dimensions of their contexts. Communication is institutionalized under many different names at different universities, including communication , communication studies , speech communication , rhetorical studies , communication science , ": null
    },
    {
        "media studies": "media studies"
    },
    {
        " , communication arts , ": null
    },
    {
        "mass communication": "mass communication"
    },
    {
        " , ": null
    },
    {
        "media ecology": "media ecology"
    },
    {
        " , and communication and media science .     Communication studies integrates aspects of both social sciences and the humanities. As a social science, the discipline often overlaps with sociology, psychology, anthropology, biology, political science, economics, and public policy, among others. From a humanities perspective, communication is concerned with rhetoric and persuasion . The field applies to outside disciplines as well, including engineering, architecture, mathematics, and information science.          ": null
    },
    {
        "Economics": "economics"
    },
    {
        " is a social science that seeks to analyze and describe the production, distribution, and consumption of wealth.  The word economics is from the ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        "  oikos, family, household, estate , and νόμος nomos, custom, law , and hence means household management or management of the state . An ": null
    },
    {
        "economist": "economist"
    },
    {
        " is a person using economic concepts and data in the course of employment, or someone who has earned a ": null
    },
    {
        "degree": "academic degree"
    },
    {
        " in the subject. The classic brief definition of economics, set out by ": null
    },
    {
        "Lionel Robbins": "lionel robbins"
    },
    {
        " in 1932, is the science which studies human behavior as a relation between scarce means having alternative uses . Without scarcity and alternative uses, there is no ": null
    },
    {
        "economic problem": "economic problem"
    },
    {
        ". Briefer yet is the study of how people seek to satisfy needs and wants and the study of the financial aspects of human behavior .      Economics has two broad branches: ": null
    },
    {
        "microeconomics": "microeconomics"
    },
    {
        ", where the unit of analysis is the individual agent, such as a household or firm, and ": null
    },
    {
        "macroeconomics": "macroeconomics"
    },
    {
        ", where the unit of analysis is an economy as a whole. Another division of the subject distinguishes ": null
    },
    {
        "positive": "positive"
    },
    {
        " economics, which seeks to predict and explain economic phenomena, from ": null
    },
    {
        "normative economics": "normative economics"
    },
    {
        ", which orders choices and actions by some criterion; such orderings necessarily involve ": null
    },
    {
        "subjective": "subjectivity"
    },
    {
        " value judgments. Since the early part of the 20th century, ": null
    },
    {
        "economics": "economics"
    },
    {
        " has focused largely on measurable quantities, employing both theoretical models and empirical analysis. Quantitative models, however, can be traced as far back as the ": null
    },
    {
        "physiocratic school": "physiocrats"
    },
    {
        ". Economic reasoning has been increasingly applied in recent decades to other social situations such as ": null
    },
    {
        "politics": "public choice theory"
    },
    {
        ", ": null
    },
    {
        "law": "law"
    },
    {
        ", ": null
    },
    {
        "psychology": "experimental economics"
    },
    {
        ", ": null
    },
    {
        "history": "economic history"
    },
    {
        ", ": null
    },
    {
        "religion": "religion"
    },
    {
        ", marriage and family life, and other social interactions.   This paradigm crucially assumes that resources are scarce because they are not sufficient to satisfy all wants, and that economic value is willingness to pay as revealed for instance by market transactions. Rival ": null
    },
    {
        "heterodox": "heterodox economics"
    },
    {
        " schools of thought, such as ": null
    },
    {
        "institutional economics": "institutional economics"
    },
    {
        ", ": null
    },
    {
        "green economics": "green economics"
    },
    {
        ", ": null
    },
    {
        "Marxist economics": "marxist economics"
    },
    {
        ", and ": null
    },
    {
        "economic sociology": "economic sociology"
    },
    {
        ", make other grounding assumptions. For example, Marxist economics assumes that economics primarily deals with the investigation of ": null
    },
    {
        "exchange value": "exchange value"
    },
    {
        ", of which human labour is the source.     The expanding domain of economics in the social sciences has been described as ": null
    },
    {
        "economic imperialism": "economic imperialism"
    },
    {
        ". ": null
    },
    {
        "Becker, Gary S.": "gary becker"
    },
    {
        " . The Economic Approach to Human Behavior.  to arrow-page viewable chapter. University of Chicago Press.             Education ": null
    },
    {
        "encompasses": "list of education topics"
    },
    {
        " teaching and learning specific skills, and also something less tangible but more profound: the imparting of knowledge, positive judgement and well-developed wisdom. Education has as one of its fundamental aspects the imparting of culture from generation to generation . To educate means to draw out, from the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " educare, or to facilitate the realization of an individuals potential and talents. It is an application of ": null
    },
    {
        "pedagogy": "pedagogy"
    },
    {
        ", a body of theoretical and applied research relating to teaching and learning and draws on many disciplines such as ": null
    },
    {
        "psychology": "psychology"
    },
    {
        ", ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        ", ": null
    },
    {
        "computer science": "computer science"
    },
    {
        ", ": null
    },
    {
        "linguistics": "linguistics"
    },
    {
        ", ": null
    },
    {
        "neuroscience": "neuroscience"
    },
    {
        ", ": null
    },
    {
        "sociology": "sociology"
    },
    {
        " and ": null
    },
    {
        "anthropology": "anthropology"
    },
    {
        ".      The education of an individual human begins at birth and continues throughout life. For some, the struggles and triumphs of daily ": null
    },
    {
        "life": "personal life"
    },
    {
        " provide far more instruction than does formal schooling .             Geography as a discipline can be split broadly into two main sub fields: ": null
    },
    {
        "human geography": "human geography"
    },
    {
        " and ": null
    },
    {
        "physical geography": "physical geography"
    },
    {
        ". The former focuses largely on the built environment and how space is created, viewed and managed by humans as well as the influence humans have on the space they occupy. This may involve ": null
    },
    {
        "cultural geography": "cultural geography"
    },
    {
        ", ": null
    },
    {
        "transportation": "transportation geography"
    },
    {
        ", ": null
    },
    {
        "health": "health geography"
    },
    {
        ", ": null
    },
    {
        "military operations": "military geography"
    },
    {
        ", and ": null
    },
    {
        "cities": "urban geography"
    },
    {
        ". The latter examines the natural environment and how the climate, vegetation and life, soil, ": null
    },
    {
        "oceans": "oceanography"
    },
    {
        ", water and ": null
    },
    {
        "landforms": "landforms"
    },
    {
        " are produced and interact. ": null
    },
    {
        "Physical geography": "physical geography"
    },
    {
        " examines phenomena related to the ": null
    },
    {
        "measurement of earth": "geodesy"
    },
    {
        ". As a result of the two subfields using different approaches a third field has emerged, which is ": null
    },
    {
        "environmental geography": "environmental geography"
    },
    {
        ". Environmental geography combines physical and human geography and looks at the interactions between the environment and humans. Other ": null
    },
    {
        "branches of geography": "geographybranches"
    },
    {
        " include ": null
    },
    {
        "social geography": "social geography"
    },
    {
        ", ": null
    },
    {
        "regional geography": "regional geography"
    },
    {
        ", and ": null
    },
    {
        "geomatics": "geomatics"
    },
    {
        ".     Geographers attempt to understand the Earth in terms of physical and spatial relationships. The first geographers focused on the science of ": null
    },
    {
        "mapmaking": "mapmaking"
    },
    {
        " and finding ways to precisely ": null
    },
    {
        "project": "map projection"
    },
    {
        " the surface of the earth. In this sense, geography bridges some gaps between the natural sciences and social sciences. ": null
    },
    {
        "Historical geography": "historical geography"
    },
    {
        " is often taught in a college in a unified Department of Geography.     Modern geography is an all-encompassing discipline, closely related to ": null
    },
    {
        "GISc": "geographic information science"
    },
    {
        ", that seeks to understand humanity and its natural environment. The fields of ": null
    },
    {
        "urban planning": "urban planning"
    },
    {
        ", ": null
    },
    {
        "regional science": "regional science"
    },
    {
        ", and ": null
    },
    {
        "planetology": "planetology"
    },
    {
        " are closely related to geography. Practitioners of geography use many technologies and methods to collect data such as ": null
    },
    {
        "GIS": "geographic information systems"
    },
    {
        ", ": null
    },
    {
        "remote sensing": "remote sensing"
    },
    {
        ", ": null
    },
    {
        "aerial photography": "aerial photography"
    },
    {
        ", ": null
    },
    {
        "statistics": "statistics"
    },
    {
        ", and ": null
    },
    {
        "global positioning systems": "global positioning systems"
    },
    {
        " .            History is the continuous, systematic narrative and research into past human events as interpreted through historiographical paradigms or theories.     History has a base in both the social sciences and the humanities. In the United States the ": null
    },
    {
        "National Endowment for the Humanities": "national endowment for the humanities"
    },
    {
        " includes history in its definition of ": null
    },
    {
        "humanities": "humanities"
    },
    {
        " .  However, the ": null
    },
    {
        "National Research Council": "united states national research council"
    },
    {
        " classifies history as a social science.  The ": null
    },
    {
        "historical method": "historical method"
    },
    {
        " comprises the techniques and guidelines by which historians use ": null
    },
    {
        "primary sources": "primary source"
    },
    {
        "and other evidence to research and then to ": null
    },
    {
        "write history": "historiography"
    },
    {
        ". The ": null
    },
    {
        "Social Science History Association": "social science history association"
    },
    {
        ", formed in 1976, brings together scholars from numerous disciplines interested in ": null
    },
    {
        "social history": "social history"
    },
    {
        ". See              The social science of law, ": null
    },
    {
        "jurisprudence": "jurisprudence"
    },
    {
        ", in common parlance, means a rule that  is capable of enforcement through institutions. However, many laws are based on ": null
    },
    {
        "norms": "norm"
    },
    {
        " accepted by a community and thus have an ethical foundation. The study of law crosses the boundaries between the social sciences and humanities, depending on ones view of research into its objectives and effects. Law is not always enforceable, especially in the international relations context. It has been defined as a system of rules , as an interpretive concept to achieve justice, as an authority to mediate peoples interests, and even as the command of a sovereign, backed by the threat of a sanction . However one likes to think of law, it is a completely central social institution. Legal policy incorporates the practical manifestation of thinking from almost every social science and the humanities. Laws are politics, because politicians create them. Law is philosophy, because moral and ethical persuasions shape their ideas. Law tells many of historys stories, because statutes, case law and codifications build up over time. And law is economics, because any rule about ": null
    },
    {
        "contract": "contract"
    },
    {
        ", ": null
    },
    {
        "tort": "tort"
    },
    {
        ", ": null
    },
    {
        "property law": "property law"
    },
    {
        ", ": null
    },
    {
        "labour law": "labour law"
    },
    {
        ", ": null
    },
    {
        "company law": "company law"
    },
    {
        " and many more can have long-lasting effects on the distribution of wealth. The noun law derives from the late ": null
    },
    {
        "Old English": "old english language"
    },
    {
        " lagu, meaning something laid down or fixed see  and the adjective legal comes from the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " word lex. see              Linguistics investigates the cognitive and social aspects of human language. The field is divided into areas that focus on aspects of the linguistic signal, such as ": null
    },
    {
        "syntax": "syntax"
    },
    {
        " , ": null
    },
    {
        "semantics": "semantics"
    },
    {
        " , ": null
    },
    {
        "morphology": "morphology"
    },
    {
        " , ": null
    },
    {
        "phonetics": "phonetics"
    },
    {
        " and ": null
    },
    {
        "phonology": "phonology"
    },
    {
        " ; however, work in areas like ": null
    },
    {
        "evolutionary linguistics": "evolutionary linguistics"
    },
    {
        " and ": null
    },
    {
        "psycholinguistics": "psycholinguistics"
    },
    {
        " cut across these divisions.     The overwhelming majority of modern research in linguistics takes a predominantly ": null
    },
    {
        "synchronic": "wikt:synchronic"
    },
    {
        " perspective , and a great deal of it—partly owing to the influence of ": null
    },
    {
        "Noam Chomsky": "noam chomsky"
    },
    {
        "—aims at formulating theories of the cognitive processing of language. However, language does not exist in a vacuum, or only in the brain, and approaches like contact linguistics, ": null
    },
    {
        "creole": "creole language"
    },
    {
        " studies, ": null
    },
    {
        "discourse analysis": "discourse analysis"
    },
    {
        ", social interactional linguistics, and ": null
    },
    {
        "sociolinguistics": "sociolinguistics"
    },
    {
        " explore language in its social context. Sociolinguistics often makes use of traditional quantitative analysis and ": null
    },
    {
        "statistics": "statistics"
    },
    {
        " in investigating the frequency of features, while some disciplines, like contact linguistics, focus on qualitative analysis. While certain areas of linguistics can thus be understood as clearly falling within the social sciences, other areas, like ": null
    },
    {
        "acoustic phonetics": "acoustic phonetics"
    },
    {
        " and ": null
    },
    {
        "neurolinguistics": "neurolinguistics"
    },
    {
        ", draw on the natural sciences. Linguistics draws only secondarily on the humanities, which played a rather greater role in linguistic inquiry in the 19th and early 20th centuries. ": null
    },
    {
        "Ferdinand Saussure": "ferdinand saussure"
    },
    {
        " is considered the father of modern linguistics.             ": null
    },
    {
        "Political science": "political science"
    },
    {
        " is an academic and research discipline that deals with the theory and practice of politics and the description and analysis of ": null
    },
    {
        "political systems": "political system"
    },
    {
        "and political behaviour. Fields and subfields of political science include ": null
    },
    {
        "political economy": "political economy"
    },
    {
        ", ": null
    },
    {
        "political theory and philosophy": "political philosophy"
    },
    {
        ", ": null
    },
    {
        "civics": "civics"
    },
    {
        " and ": null
    },
    {
        "comparative politics": "comparative politics"
    },
    {
        ", theory of ": null
    },
    {
        "direct democracy": "direct democracy"
    },
    {
        ", apolitical governance, participatory direct democracy, national systems, cross-national political analysis, political development, ": null
    },
    {
        "international relations": "international relations"
    },
    {
        ", ": null
    },
    {
        "foreign policy": "foreign policy"
    },
    {
        ", ": null
    },
    {
        "international law": "international law"
    },
    {
        ", politics, ": null
    },
    {
        "public administration": "public administration"
    },
    {
        ", administrative behaviour, public law, judicial behaviour, and ": null
    },
    {
        "public policy": "policy"
    },
    {
        ". Political science also studies ": null
    },
    {
        "power in international relations": "power in international relations"
    },
    {
        " and the theory of ": null
    },
    {
        "great powers": "great powers"
    },
    {
        " and ": null
    },
    {
        "superpower": "superpower"
    },
    {
        "s.     Political science is methodologically diverse, although recent years have witnessed an upsurge in the use of the scientific method,   that is, the proliferation of formal-deductive model building and quantitative hypothesis testing. Approaches to the discipline include ": null
    },
    {
        "rational choice": "rational choice"
    },
    {
        ", classical political philosophy, ": null
    },
    {
        "interpretivism": "interpretivism"
    },
    {
        ", ": null
    },
    {
        "structuralism": "structuralism"
    },
    {
        ", and ": null
    },
    {
        "behaviouralism": "behavioralism"
    },
    {
        ", ": null
    },
    {
        "realism": "philosophical realism"
    },
    {
        ", pluralism, and ": null
    },
    {
        "institutionalism": "institutionalism in political parties"
    },
    {
        ". Political science, as one of the social sciences, uses methods and techniques that relate to the kinds of inquiries sought: primary sources such as historical documents, interviews, and official records, as well as secondary sources such as ": null
    },
    {
        "scholarly articles": "scholarly article"
    },
    {
        "are used in building and testing theories. Empirical methods include ": null
    },
    {
        "survey": "sample survey"
    },
    {
        " research, ": null
    },
    {
        "statistical analysis": "statistical analysis"
    },
    {
        " or econometrics": "econometrics"
    },
    {
        ", ": null
    },
    {
        "case studies": "case studies"
    },
    {
        ", experiments, and model building. ": null
    },
    {
        "Herbert Baxter Adams": "herbert baxter adams"
    },
    {
        " is credited with coining the phrase political science while teaching history at ": null
    },
    {
        "Johns Hopkins University": "johns hopkins university"
    },
    {
        ".             ": null
    },
    {
        "Psychology": "psychology"
    },
    {
        " is an academic and applied field involving the study of behaviour and mental processes. Psychology also refers to the application of such knowledge to various spheres of human activity, including problems of individuals ": null
    },
    {
        "daily lives": "everyday life"
    },
    {
        " and the treatment of ": null
    },
    {
        "mental illness": "mental illness"
    },
    {
        ". The word psychology comes from the ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        " ψυχή  psyche  and  logy  .     Psychology differs from ": null
    },
    {
        "anthropology": "anthropology"
    },
    {
        ", ": null
    },
    {
        "economics": "economics"
    },
    {
        ", ": null
    },
    {
        "political science": "political science"
    },
    {
        ", and ": null
    },
    {
        "sociology": "sociology"
    },
    {
        " in seeking to capture explanatory generalizations about the ": null
    },
    {
        "mental function": "mental function"
    },
    {
        " and overt behaviour of individuals, while the other disciplines focus on creating descriptive generalizations about the functioning of social groups or situation-specific human behaviour. In practice, however, there is quite a lot of cross-fertilization that takes place among the various fields. Psychology differs from ": null
    },
    {
        "biology": "biology"
    },
    {
        " and ": null
    },
    {
        "neuroscience": "neuroscience"
    },
    {
        " in that it is primarily concerned with the interaction of mental processes and behaviour, and of the overall processes of a system, and not simply the biological or neural processes themselves, though the subfield of ": null
    },
    {
        "neuropsychology": "neuropsychology"
    },
    {
        " combines the study of the actual neural processes with the study of the mental effects they have subjectively produced.   Many people associate psychology with clinical psychology, which focuses on assessment and treatment of problems in living and psychopathology. In reality, psychology has myriad specialties including social psychology, developmental psychology, cognitive psychology, ": null
    },
    {
        "educational psychology": "educational psychology"
    },
    {
        ", industrial-organizational psychology, ": null
    },
    {
        "mathematical psychology": "mathematical psychology"
    },
    {
        ", neuropsychology, and quantitative analysis of behaviour.     Psychology is a very broad science that is rarely tackled as a whole, major block. Although some subfields encompass a natural science base and a social science application, others can be clearly distinguished as having little to do with the social sciences or having a lot to do with the social sciences. For example, biological psychology is considered a natural science with a social scientific application , social and occupational psychology are, generally speaking, purely social sciences, whereas neuropsychology is a natural science that lacks application out of the scientific tradition entirely. In British universities, emphasis on what tenet of psychology a student has studied and/or concentrated is communicated through the degree conferred: B.Psy. indicates a balance between natural and social sciences, B.Sc. indicates a strong scientific concentration, whereas a B.A. underlines a majority of social science credits. This is not always necessarily the case however, and in many UK institutions students studying the B.Psy, B.Sc, and B.A. follow the same curriculum as outlined by The British Psychological Society and have the same options of specialism open to them regardless of whether they choose a balance, a heavy science basis, or heavy social science basis to their degree. If they applied to read the B.A. for example, but specialized in heavily science-based modules, then they will still generally be awarded the B.A.             ": null
    },
    {
        "Sociology": "sociology"
    },
    {
        " is the systematic study of society, individuals relationship to their societies, the consequences of difference, and other aspects of human ": null
    },
    {
        "social action": "social action"
    },
    {
        ".  The meaning of the word comes from the suffix -logy , which means study of , derived from ": null
    },
    {
        "Ancient Greek": "ancient greek"
    },
    {
        ", and the stem soci- , which is from the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " word socius, meaning companion , or society in general.     ": null
    },
    {
        "Auguste Comte": "auguste comte"
    },
    {
        " coined the term, Sociology, as a way to apply natural science principles and techniques to the social world in 1838. A Dictionary of Sociology, Article: Comte, Auguste  Comte endeavoured to unify history, psychology and economics through the descriptive understanding of the social realm. He proposed that social ills could be remedied through sociological ": null
    },
    {
        "positivism": "positivism"
    },
    {
        ", an epistemological approach outlined in The Course in Positive Philosophy and  A General View of Positivism  . Though Comte is generally regarded as the Father of Sociology , the discipline was formally established by another French thinker, ": null
    },
    {
        "Émile Durkheim": "émile durkheim"
    },
    {
        " , who developed positivism as a foundation to practical ": null
    },
    {
        "social research": "social research"
    },
    {
        ". Durkheim set up the first European department of sociology at the ": null
    },
    {
        "University of Bordeaux": "university of bordeaux"
    },
    {
        " in 1895, publishing his  Rules of the Sociological Method . In 1896, he established the journal  LAnnée Sociologique . Durkheims seminal monograph,  Suicide  , a case study of suicide rates among ": null
    },
    {
        "Catholic": "catholic church"
    },
    {
        " and ": null
    },
    {
        "Protestant": "protestant"
    },
    {
        " populations, distinguished sociological analysis from ": null
    },
    {
        "psychology": "psychology"
    },
    {
        " or ": null
    },
    {
        "philosophy": "philosophy"
    },
    {
        ". Gianfranco Poggi . Durkheim. Oxford: Oxford University Press. Chapter 1.     ": null
    },
    {
        "Karl Marx": "karl marx"
    },
    {
        " rejected Comtes positivism but nevertheless aimed to establish a science of society based on ": null
    },
    {
        "historical materialism": "historical materialism"
    },
    {
        ", becoming recognized as a founding figure of sociology posthumously as the term gained broader meaning. Around the start of the 20th century, the first wave of German sociologists, including ": null
    },
    {
        "Max Weber": "max weber"
    },
    {
        " and ": null
    },
    {
        "Georg Simmel": "georg simmel"
    },
    {
        ", developed sociological ": null
    },
    {
        "antipositivism": "antipositivism"
    },
    {
        ". The field may be broadly recognized as an amalgam of three modes of social thought in particular: Durkheimian ": null
    },
    {
        "positivism": "positivism"
    },
    {
        " and ": null
    },
    {
        "structural functionalism": "structural functionalism"
    },
    {
        "; Marxist ": null
    },
    {
        "historical materialism": "historical materialism"
    },
    {
        " and ": null
    },
    {
        "conflict theory": "conflict theory"
    },
    {
        "; and Weberian ": null
    },
    {
        "antipositivism": "antipositivism"
    },
    {
        " and ": null
    },
    {
        "verstehen": "verstehen"
    },
    {
        " analysis. American sociology broadly arose on a separate trajectory, with little Marxist influence, an emphasis on rigorous experimental methodology, and a closer association with ": null
    },
    {
        "pragmatism": "pragmatism"
    },
    {
        " and ": null
    },
    {
        "social psychology": "social psychology"
    },
    {
        ". In the 1920s, the ": null
    },
    {
        "Chicago school": "chicago school"
    },
    {
        " developed ": null
    },
    {
        "symbolic interactionism": "symbolic interactionism"
    },
    {
        ". Meanwhile, in the 1930s, the ": null
    },
    {
        "Frankfurt School": "frankfurt school"
    },
    {
        " pioneered the idea of ": null
    },
    {
        "critical theory": "critical theory"
    },
    {
        ", an interdisciplinary form of ": null
    },
    {
        "Marxist sociology": "marxist sociology"
    },
    {
        " drawing upon thinkers as diverse as ": null
    },
    {
        "Sigmund Freud": "sigmund freud"
    },
    {
        " and ": null
    },
    {
        "Friedrich Nietzsche": "friedrich nietzsche"
    },
    {
        ". Critical theory would take on something of a life of its own after World War II, influencing ": null
    },
    {
        "literary criticism": "literary criticism"
    },
    {
        " and the ": null
    },
    {
        "Birmingham School": "centre for contemporary cultural studies"
    },
    {
        " establishment of ": null
    },
    {
        "cultural studies": "cultural studies"
    },
    {
        ".     Sociology evolved as an academic response to the challenges of ": null
    },
    {
        "modernity": "modernity"
    },
    {
        ", such as ": null
    },
    {
        "industrialization": "industrialization"
    },
    {
        ", ": null
    },
    {
        "urbanization": "urbanization"
    },
    {
        ", ": null
    },
    {
        "secularization": "secularization"
    },
    {
        ", and a perceived process of enveloping ": null
    },
    {
        "rationalization": "rationalization"
    },
    {
        ". Habermas, Jürgen,  The Philosophical Discourse of Modernity : Modernitys Consciousness of Time, Polity Press , paperback, , p. 2. The field generally concerns the ": null
    },
    {
        "social rules": "social rule"
    },
    {
        "and processes that bind and separate people not only as ": null
    },
    {
        "individual": "individual"
    },
    {
        "s, but as members of ": null
    },
    {
        "associations": "voluntary association"
    },
    {
        ", ": null
    },
    {
        "groups": "group"
    },
    {
        ", ": null
    },
    {
        "communities": "community"
    },
    {
        " and ": null
    },
    {
        "institutions": "social institution"
    },
    {
        ", and includes the examination of the organization and development of human social life. The sociological field of interest ranges from the analysis of short ": null
    },
    {
        "contacts": "social relation"
    },
    {
        " between anonymous individuals on the street to the study of ": null
    },
    {
        "global social processes": "globalization"
    },
    {
        ". In the terms of ": null
    },
    {
        "sociologists": "sociology"
    },
    {
        " Peter L. Berger": "peter l. berger"
    },
    {
        " and ": null
    },
    {
        "Thomas Luckmann": "thomas luckmann"
    },
    {
        ", social scientists seek an understanding of the  Social Construction of Reality . Most sociologists work in one or more ": null
    },
    {
        "subfields": "subfields of sociology"
    },
    {
        ". One useful way to describe the discipline is as a cluster of sub-fields that examine different dimensions of society. For example, ": null
    },
    {
        "social stratification": "social stratification"
    },
    {
        " studies inequality and class structure; ": null
    },
    {
        "demography": "demography"
    },
    {
        " studies changes in a population size or type; ": null
    },
    {
        "criminology": "criminology"
    },
    {
        " examines criminal behaviour and deviance; and ": null
    },
    {
        "political sociology": "political sociology"
    },
    {
        " studies the interaction between society and state.     Since its inception, sociological epistemologies, methods, and frames of enquiry, have significantly expanded and diverged. Sociologists use a diversity of research methods, collect both quantitative and qualitative data, draw upon empirical techniques, and engage ": null
    },
    {
        "critical theory": "critical theory"
    },
    {
        ". Common modern methods include ": null
    },
    {
        "case studies": "case studies"
    },
    {
        ", ": null
    },
    {
        "historical research": "historiography"
    },
    {
        ", ": null
    },
    {
        "interviewing": "interviewing"
    },
    {
        ", ": null
    },
    {
        "participant observation": "participant observation"
    },
    {
        ", ": null
    },
    {
        "social network analysis": "social network analysis"
    },
    {
        ", ": null
    },
    {
        "survey": "statistical survey"
    },
    {
        " research, ": null
    },
    {
        "statistical analysis": "statistical analysis"
    },
    {
        ", and model building, among other approaches. Since the late 1970s, many sociologists have tried to make the discipline useful for purposes beyond the academy. The results of sociological research aid educators, lawmakers, administrators, developers, and others interested in resolving social problems and formulating public policy, through subdisciplinary areas such as ": null
    },
    {
        "evaluation research": "evaluation research"
    },
    {
        ", methodological assessment, and ": null
    },
    {
        "public sociology": "public sociology"
    },
    {
        ".     In the early 1970s, women sociologists began to question sociological paradigms and the invisibility of women in sociological studies, analysis, and courses.  In 1969, feminist sociologists challenged the disciplines ": null
    },
    {
        "androcentrism": "androcentrism"
    },
    {
        " at the American Sociological Associations annual conference.  This led to the founding of the organization Sociologists for Women in Society, and, eventually, a new sociology journal, ": null
    },
    {
        "Gender & Society": "gender  &  society"
    },
    {
        ". Today, the ": null
    },
    {
        "sociology of gender": "sociology of gender"
    },
    {
        " is considered to be one of the most prominent sub-fields in the discipline.     New sociological sub-fields continue to appear  — such as ": null
    },
    {
        "community studies": "community studies"
    },
    {
        ", ": null
    },
    {
        "computational sociology": "computational sociology"
    },
    {
        ", ": null
    },
    {
        "environmental sociology": "environmental sociology"
    },
    {
        ", ": null
    },
    {
        "network analysis": "social network analysis"
    },
    {
        ", ": null
    },
    {
        "actor-network theory": "actor-network theory"
    },
    {
        ", gender studies, and a growing list, many of which are ": null
    },
    {
        "cross-disciplinary": "list of academic disciplines"
    },
    {
        " in nature.           Additional applied or interdisciplinary fields related to the social sciences include:   ": null
    },
    {
        "Archaeology": "archaeology"
    },
    {
        " is the science that studies human cultures through the recovery, documentation, analysis, and interpretation of material remains and environmental data, including architecture, artifacts, features, biofacts, and landscapes.   ": null
    },
    {
        "Area studies": "area studies"
    },
    {
        " are ": null
    },
    {
        "interdisciplinary": "interdisciplinary"
    },
    {
        " fields of research and scholarship pertaining to particular geographical, national/federal, or cultural regions.   ": null
    },
    {
        "Behavioural science": "behavioural science"
    },
    {
        " is a term that encompasses all the disciplines that explore the activities of and interactions among organisms in the natural world.   ": null
    },
    {
        "Computational social science": "computational social science"
    },
    {
        " is an umbrella field encompassing computational approaches within the social sciences.   ": null
    },
    {
        "Demography": "demography"
    },
    {
        " is the statistical study of all human populations.   ": null
    },
    {
        "Development studies": "development studies"
    },
    {
        " a ": null
    },
    {
        "multidisciplinary": "multidisciplinary"
    },
    {
        " branch of social science that addresses issues of concern to developing countries.   ": null
    },
    {
        "Environmental social science": "environmental social science"
    },
    {
        " is the broad, ": null
    },
    {
        "transdisciplinary": "transdisciplinary"
    },
    {
        " study of interrelations between humans and the natural environment.   ": null
    },
    {
        "Environmental studies": "environmental studies"
    },
    {
        " integrate social, humanistic, and natural science perspectives on the relation between humans and the natural environment.   ": null
    },
    {
        "Gender studies": "gender studies"
    },
    {
        " integrates several social and natural sciences to study gender identity, masculinity, femininity, transgender issues, and sexuality.   ": null
    },
    {
        "Information science": "information science"
    },
    {
        " is an interdisciplinary science primarily concerned with the collection, classification, manipulation, storage, retrieval and dissemination of information.   ": null
    },
    {
        "International studies": "international studies"
    },
    {
        " covers both ": null
    },
    {
        "International relations": "international relations"
    },
    {
        "  and ": null
    },
    {
        "International education": "international education"
    },
    {
        " .   ": null
    },
    {
        "Legal management": "legal management"
    },
    {
        " is a social sciences discipline that is designed for students interested in the study of state and legal elements.   ": null
    },
    {
        "Library science": "library science"
    },
    {
        " is an interdisciplinary field that applies the practices, perspectives, and tools of management, information technology, education, and other areas to libraries; the collection, organization, preservation and dissemination of information resources; and the political economy of information.   ": null
    },
    {
        "Management": "management"
    },
    {
        " consists of various levels of leadership and administration of an organization in all business and human organizations. It is the effective execution of getting people together to accomplish desired goals and objectives through adequate planning, executing and controlling activities.   ": null
    },
    {
        "Marketing": "marketing"
    },
    {
        " the identification of human needs and wants, defines and measures their magnitude for demand and understanding the process of consumer buying behaviour to formulate products and services, pricing, promotion and distribution to satisfy these needs and wants through exchange processes and building long term relationships.   ": null
    },
    {
        "Political economy": "political economy"
    },
    {
        " is the study of production, buying and selling, and their relations with law, custom, and government.   ": null
    },
    {
        "Public administration": "public administration"
    },
    {
        " is one of the main branches of political science, and can be broadly described as the development, implementation and study of branches of government ": null
    },
    {
        "policy": "policy"
    },
    {
        ". The pursuit of the public good by enhancing ": null
    },
    {
        "civil society": "civil society"
    },
    {
        " and ": null
    },
    {
        "social justice": "social justice"
    },
    {
        " is the ultimate goal of the field. Though public administration has been historically referred to as government management,  it increasingly encompasses ": null
    },
    {
        "non-governmental organizations": "non-governmental organization"
    },
    {
        " that also operate with a similar, primary dedication to the betterment of humanity.   ": null
    },
    {
        "Religious studies": "religious studies"
    },
    {
        " and ": null
    },
    {
        "Western esoteric studies": "academic study of western esotericism"
    },
    {
        " incorporate and inform social-scientific research on phenomena broadly deemed religious. Religious studies, Western esoteric studies, and the social sciences developed in dialogue with one another.               The origin of the ": null
    },
    {
        "survey": "statistical survey"
    },
    {
        " can be traced back at least early as the ": null
    },
    {
        "Domesday Book": "domesday book"
    },
    {
        " in 1086, A.H. Halsey , A history of sociology in Britain: science, literature, and society, p. 34 Geoffrey Duncan Mitchell , A new dictionary of sociology, p. 201 while some scholars pinpoint the origin of ": null
    },
    {
        "demography": "demography"
    },
    {
        " to 1663 with the publication of ": null
    },
    {
        "John Graunts": "john graunt"
    },
    {
        " Natural and Political Observations upon the Bills of Mortality. Willcox, Walter  Social research began most intentionally, however, with the ": null
    },
    {
        "positivist": "positivist"
    },
    {
        " philosophy of science": "philosophy of science"
    },
    {
        " in the 19th century.     In contemporary usage, social research is a relatively autonomous term, encompassing the work of practitioners from various disciplines that share in its aims and methods. Social scientists employ a range of methods in order to analyse a vast breadth of social phenomena; from ": null
    },
    {
        "census": "census"
    },
    {
        " survey data derived from millions of individuals, to the in-depth analysis of a single agents social experiences; from monitoring what is happening on contemporary streets, to the investigation of ancient historical documents. The methods originally rooted in classical sociology and statistical mathematics have formed the basis for research in other disciplines, such as ": null
    },
    {
        "political science": "political science"
    },
    {
        ", ": null
    },
    {
        "media studies": "media studies"
    },
    {
        ", and ": null
    },
    {
        "marketing": "marketing"
    },
    {
        " and ": null
    },
    {
        "market research": "market research"
    },
    {
        ".     Social research methods may be divided into two broad schools:   ": null
    },
    {
        "Quantitative designs": "quantitative method"
    },
    {
        " approach social phenomena through quantifiable evidence, and often rely on statistical analysis of many cases to create valid and reliable general claims.   ": null
    },
    {
        "Qualitative designs": "qualitative research"
    },
    {
        " emphasize understanding of social phenomena through direct observation, communication with participants, or analysis of texts, and may stress contextual and subjective accuracy over generality.     Social scientists will commonly combine quantitative and qualitative approaches as part of a multi-strategy design. Questionnaires, field-based data collection, archival database information and laboratory-based data collections are some of the measurement techniques used. It is noted the importance of measurement and analysis, focusing on the goal of objective research or ": null
    },
    {
        "statistical hypothesis testing": "statistical hypothesis testing"
    },
    {
        ". A ": null
    },
    {
        "mathematical model": "mathematical model"
    },
    {
        " uses mathematical language to describe a system. The process of developing a mathematical model is termed mathematical modelling . Eykhoff defined a mathematical model as a representation of the essential aspects of an existing ": null
    },
    {
        "system": "system"
    },
    {
        " that presents knowledge of that system in usable form. Eykhoff, Pieter System Identification: Parameter and State Estimation, Wiley & Sons, .  Mathematical models can take many forms, including but not limited to ": null
    },
    {
        "dynamical systems": "dynamical systems"
    },
    {
        ", ": null
    },
    {
        "statistical model": "statistical model"
    },
    {
        "s, ": null
    },
    {
        "differential equations": "differential equations"
    },
    {
        ", or ": null
    },
    {
        "game theoretic models": "game theory"
    },
    {
        ".     These and other types of models can overlap, with a given model involving a variety of abstract structures. The ": null
    },
    {
        "system": "system"
    },
    {
        " is a set of interacting or interdependent entities, real or abstract, forming an integrated whole. The concept of an integrated whole can also be stated in terms of a system embodying a set of relationships that are differentiated from relationships of the set to other elements, and from relationships between an element of the set and elements not a part of the relational regime. A ": null
    },
    {
        "dynamical system": "dynamical system"
    },
    {
        " modeled as a ": null
    },
    {
        "mathematical": "mathematics"
    },
    {
        " formalization": "formal system"
    },
    {
        " has a fixed rule that describes the time dependence of a points position in its ": null
    },
    {
        "ambient space": "ambient space"
    },
    {
        ". Small changes in the state of the system correspond to small changes in the numbers. The evolution rule of the dynamical system is a ": null
    },
    {
        "fixed rule": "function"
    },
    {
        " that describes what future states follow from the current state. The rule is ": null
    },
    {
        "deterministic": "deterministic system"
    },
    {
        ": for a given time interval only one future state follows from the current state.     Social scientists often conduct ": null
    },
    {
        "Program Evaluation": "program evaluation"
    },
    {
        ", which is a systematic method for collecting, analyzing, and using information to answer questions about projects, policies and programs, Administration for Children and Families  Chapter 2: What is program evaluation?. particularly about their effectiveness and efficiency. In both the public and private sectors, stakeholders often want to know whether the programs they are funding, implementing, voting for, receiving or objecting to are producing the intended effect. While program evaluation first focuses around this definition, important considerations often include how much the program costs per participant, how the program could be improved, whether the program is worthwhile, whether there are better alternatives, if there are unintended outcomes, and whether the program goals are appropriate and useful.      Social sciences are criticized for neglecting the moral element of human behavior. Economists tend to focus on self-interest. Clinical psychologists—on the effects of early socialization. Anthropologists tend to assume moral relativism. Sociologists often blame the System for immoral behavior. Socio-biologists tend to assume limited choice behavior. All this, critics hold, contrasts with the fact that life is a constant wrestle between peoples moral commitments and urges that pull them to violate these commitments. Amitai Etzioni. 2017. The Moral Wrestler: Ignored by Maslow. Society, Volume 54, Issue 6, pp. 512–19             Other social scientists emphasize the subjective nature of research. These writers share social theory perspectives that include various types of the following:   ": null
    },
    {
        "Critical theory": "critical theory"
    },
    {
        " is the examination and critique of society and culture, drawing from knowledge across social sciences and humanities disciplines.   ": null
    },
    {
        "Dialectical materialism": "dialectical materialism"
    },
    {
        " is the philosophy of Karl Marx, which he formulated by taking the dialectic of Hegel and joining it to the materialism of Feuerbach.   ": null
    },
    {
        "Feminist theory": "feminist theory"
    },
    {
        " is the extension of feminism into theoretical, or philosophical discourse; it aims to understand the nature of gender inequality.   ": null
    },
    {
        "Marxist theories": "marxist philosophy"
    },
    {
        ", such as ": null
    },
    {
        "revolutionary theory": "proletarian revolution"
    },
    {
        " and ": null
    },
    {
        "class theory": "class conflict"
    },
    {
        ", cover work in philosophy that is strongly influenced by Karl Marxs materialist approach to theory or is written by Marxists.   ": null
    },
    {
        "Phronetic social science": "phronetic social science"
    },
    {
        " is a theory and methodology for doing social science focusing on ethics and political power, based on a contemporary interpretation of Aristotelian phronesis.   ": null
    },
    {
        "Post-colonial theory": "post-colonialism"
    },
    {
        " is a reaction to the cultural legacy of colonialism.   ": null
    },
    {
        "Postmodernism": "postmodernism"
    },
    {
        " refers to a point of departure for works of literature, drama, architecture, cinema, and design, as well as in marketing and business and in the interpretation of history, law, culture and religion in the late 20th century.   ": null
    },
    {
        "Rational choice theory": "rational choice theory"
    },
    {
        " is a framework for understanding and often formally modeling social and economic behaviour.   ": null
    },
    {
        "Social constructionism": "social constructionism"
    },
    {
        " considers how social phenomena develop in social contexts.   ": null
    },
    {
        "Structuralism": "structuralism"
    },
    {
        " is an approach to the human sciences that attempts to analyze a specific field as a complex system of interrelated parts.   ": null
    },
    {
        "Structural functionalism": "structural functionalism"
    },
    {
        " is a sociological paradigm that addresses what social functions various elements of the social system perform in regard to the entire system.     Other fringe social scientists delve in alternative nature of research. These writers share social theory perspectives that include various types of the following:   ": null
    },
    {
        "Intellectual critical-ism": "anti-intellectualism"
    },
    {
        " describes a sentiment of critique towards, or evaluation of, intellectuals and intellectual pursuits.   ": null
    },
    {
        "Scientific criticalism": "antiscience"
    },
    {
        " is a position critical of science and the scientific method.       Most universities offer degrees in social science fields. Petersons . . Petersons graduate programs in the humanities, arts, & social sciences, 2007. Lawrenceville, New Jersey: Petersons. The ": null
    },
    {
        "Bachelor of Social Science": "bachelor of social science"
    },
    {
        " is a degree targeted at the social sciences in particular. It is often more flexible and in-depth than other degrees that include social science subjects.     In the United States, a university may offer a student who studies a social sciences field a ": null
    },
    {
        "Bachelor of Arts": "bachelor of arts"
    },
    {
        " degree, particularly if the field is within one of the traditional ": null
    },
    {
        "liberal arts": "liberal arts"
    },
    {
        " such as history, or a BSc: Bachelor of Science degree such as those given by the London School of Economics, as the social sciences constitute one of the two main branches of ": null
    },
    {
        "science": "science"
    },
    {
        " . In addition, some institutions have degrees for a particular social science, such as the ": null
    },
    {
        "Bachelor of Economics": "bachelor of economics"
    },
    {
        " degree, though such specialized degrees are relatively rare in the United States.     Graduate students may get a ": null
    },
    {
        "Masters degree": "masters degree"
    },
    {
        "  or ": null
    },
    {
        "Ph.D": "ph.d"
    }
]