[
    {
        "              A soft drink  is a ": null
    },
    {
        "drink": "Drink"
    },
    {
        " that usually contains ": null
    },
    {
        "carbonated water": "Carbonated Water"
    },
    {
        " , a ": null
    },
    {
        "sweetener": "Sweetness"
    },
    {
        ", and a natural or ": null
    },
    {
        "artificial flavoring": "Artificial Flavoring"
    },
    {
        ". The ": null
    },
    {
        "sweetener": "Sweetener"
    },
    {
        " may be a ": null
    },
    {
        "sugar": "Sugar"
    },
    {
        ", ": null
    },
    {
        "high-fructose corn syrup": "High-Fructose Corn Syrup"
    },
    {
        ", ": null
    },
    {
        "fruit juice": "Fruit Juice"
    },
    {
        ", a ": null
    },
    {
        "sugar substitute": "Sugar Substitute"
    },
    {
        " , or some combination of these. Soft drinks may also contain ": null
    },
    {
        "caffeine": "Caffeine"
    },
    {
        ", ": null
    },
    {
        "colorings": "Food Coloring"
    },
    {
        ", ": null
    },
    {
        "preservative": "Preservative"
    },
    {
        "s, and/or other ingredients.     Soft drinks are called soft in contrast with ": null
    },
    {
        "hard": "Hard Drink"
    },
    {
        " alcoholic drink": "Alcoholic Drink"
    },
    {
        "s. Small amounts of ": null
    },
    {
        "alcohol": "Alcohol"
    },
    {
        " may be present in a soft drink, but the ": null
    },
    {
        "alcohol content": "Alcohol By Volume"
    },
    {
        " must be less than 0.5% of the total volume of the drink in many countries and localities  See §7.71, paragraphs and .  if the drink is to be considered ": null
    },
    {
        "non-alcoholic": "Non-Alcoholic Drink"
    },
    {
        ". Bangor Daily News, April 8, 2010.  ": null
    },
    {
        "Fruit punch": "Fruit Punch"
    },
    {
        ", ": null
    },
    {
        "tea": "Tea"
    },
    {
        " , and other such non-alcoholic drinks are technically soft drinks by this definition, but are not generally referred to as such. Unsweetened ": null
    },
    {
        "sparkling water": "Sparkling Water"
    },
    {
        " may be consumed as an alternative to soft drinks.     Soft drinks may be served chilled, over ": null
    },
    {
        "ice": "Ice"
    },
    {
        " cubes, or at room temperature, especially soda. They are available in many container formats, including ": null
    },
    {
        "cans": "Soda Can"
    },
    {
        ", ": null
    },
    {
        "glass bottles": "Glass Bottles"
    },
    {
        ", and ": null
    },
    {
        "plastic bottles": "Plastic Bottles"
    },
    {
        ". Containers come in a variety of sizes, ranging from small bottles to large multi-liter containers. Soft drinks are widely available at ": null
    },
    {
        "fast food restaurant": "Fast Food Restaurant"
    },
    {
        "s, ": null
    },
    {
        "movie theater": "Movie Theater"
    },
    {
        "s, ": null
    },
    {
        "convenience store": "Convenience Store"
    },
    {
        "s, ": null
    },
    {
        "casual-dining restaurants": "Casual-Dining Restaurants"
    },
    {
        ", dedicated ": null
    },
    {
        "soda store": "Soda Store"
    },
    {
        "s, and ": null
    },
    {
        "bars": "Bar"
    },
    {
        "from ": null
    },
    {
        "soda fountain": "Soda Fountain"
    },
    {
        " machines. Soft drinks are usually served in ": null
    },
    {
        "paper": "Paper"
    },
    {
        " or ": null
    },
    {
        "plastic": "Plastic"
    },
    {
        "disposable cups": "Disposable Cup"
    },
    {
        "in the first three venues. In casual dining restaurants and bars, soft drinks are often served in ": null
    },
    {
        "glasses": "List Of Glassware"
    },
    {
        " made from glass or plastic. Soft drinks may be drunk with straws or sipped directly from the cups.     Soft drinks are mixed with other ingredients in several contexts. In Western countries, in bars and other places where alcohol is served , many ": null
    },
    {
        "mixed drinks": "Mixed Drink"
    },
    {
        "are made by blending a soft drink with hard liquor and serving the drink over ice. One well-known example is the ": null
    },
    {
        "rum and coke": "Rum And Coke"
    },
    {
        ", which may also contain ": null
    },
    {
        "lime juice": "Lime Juice"
    },
    {
        ". Some homemade ": null
    },
    {
        "fruit punch": "Fruit Punch"
    },
    {
        " recipes, which may or may not contain alcohol, contain a mixture of various ": null
    },
    {
        "fruit juices": "Fruit Juice"
    },
    {
        "and a soft drink . At ": null
    },
    {
        "ice cream parlors": "Ice Cream Parlor"
    },
    {
        "and 1950s-themed ": null
    },
    {
        "diner": "Diner"
    },
    {
        "s, ": null
    },
    {
        "ice cream float": "Ice Cream Float"
    },
    {
        "s, and specifically ": null
    },
    {
        "root beer floats": "Root Beer Floats"
    },
    {
        ", are often sold. Examples of brands include ": null
    },
    {
        "Coca-Cola": "Coca-Cola"
    },
    {
        ", ": null
    },
    {
        "Pepsi": "Pepsi"
    },
    {
        ", ": null
    },
    {
        "Sprite": "Sprite"
    },
    {
        ", ": null
    },
    {
        "Sierra Mist": "Sierra Mist"
    },
    {
        ", ": null
    },
    {
        "Fanta": "Fanta"
    },
    {
        ", ": null
    },
    {
        "Sunkist": "Sunkist"
    },
    {
        ", ": null
    },
    {
        "Mountain Dew": "Mountain Dew"
    },
    {
        ", ": null
    },
    {
        "Dr. Pepper": "Dr. Pepper"
    },
    {
        ", and ": null
    },
    {
        "7 UP": "7 Up"
    },
    {
        ".          While the term soft drink is commonly used in product labeling and on restaurant menus, in many countries these drinks are more commonly referred to by regional names, including carbonated drink, cool drink, cold drink, fizzy drink, fizzy juice, lolly water, pop, seltzer, soda, coke, soda pop, tonic, and mineral.   Due to the high sugar content in typical soft drinks, they may also be called sugary drinks.     In the United States, the 2003 ": null
    },
    {
        "Harvard": "Harvard University"
    },
    {
        " Dialect Survey tracked the usage of the nine most common names. Over half of the survey respondents preferred the term soda , which was dominant in the Northeastern United States, California, and the areas surrounding Milwaukee and St. Louis. The term pop , which was preferred by 25% of the respondents, was most popular in the Midwest and Pacific Northwest, while the ": null
    },
    {
        "genericized trademark": "Genericized Trademark"
    },
    {
        " coke , used by 12% of the respondents, was most popular in the Southern United States. The term tonic is distinctive to eastern ": null
    },
    {
        "Massachusetts": "Massachusetts"
    },
    {
        ", although usage is declining.      In the English-speaking parts of Canada, the term pop is prevalent, but soft drink is the most common English term used in Montreal.      In the United Kingdom and Ireland, the terms fizzy drink is common. Pop and fizzy pop are used in Northern England, South Wales, and the Midlands, while  mineral or lemonade are used in Ireland. In Scotland, fizzy juice or even simply juice is colloquially encountered. In ": null
    },
    {
        "Australia": "Australia"
    },
    {
        " and ": null
    },
    {
        "New Zealand": "New Zealand"
    },
    {
        ", fizzy drink or soft drink is typically used. For example, in  – The Sydney Morning Herald, September 11, 2015. Retrieved September 12, 2015. In ": null
    },
    {
        "South African English": "South African English"
    },
    {
        ", cool drink and cold drink are used,  but in South African ": null
    },
    {
        "Indian English": "Indian English"
    },
    {
        ", cool drink is most prevalent. Older people often use the term mineral .       The origins of soft drinks lie in the development of fruit-flavored drinks. In the ": null
    },
    {
        "medieval Middle East": "Islamic Golden Age"
    },
    {
        ", a variety of fruit-flavored soft drinks were widely drunk, such as ": null
    },
    {
        "sharbat": "Sharbat"
    },
    {
        ", and were often sweetened with ingredients such as ": null
    },
    {
        "sugar": "Sugar"
    },
    {
        ", ": null
    },
    {
        "syrup": "Syrup"
    },
    {
        " and ": null
    },
    {
        "honey": "Honey"
    },
    {
        ". Other common ingredients included ": null
    },
    {
        "lemon": "Lemon"
    },
    {
        ", ": null
    },
    {
        "apple": "Apple"
    },
    {
        ", ": null
    },
    {
        "pomegranate": "Pomegranate"
    },
    {
        ", ": null
    },
    {
        "tamarind": "Tamarind"
    },
    {
        ", ": null
    },
    {
        "jujube": "Jujube"
    },
    {
        ", ": null
    },
    {
        "sumac": "Sumac"
    },
    {
        ", ": null
    },
    {
        "musk": "Musk"
    },
    {
        ", ": null
    },
    {
        "mint": "Mentha"
    },
    {
        " and ": null
    },
    {
        "ice": "Ice"
    },
    {
        ". Middle Eastern drinks later became ": null
    },
    {
        "popular in medieval Europe": "Islamic Contributions To Medieval Europe"
    },
    {
        ", where the word syrup was derived from ": null
    },
    {
        "Arabic": "Arabic Language"
    },
    {
        ".  In ": null
    },
    {
        "Tudor England": "Tudor England"
    },
    {
        ", water imperial was widely drunk; it was a sweetened drink with lemon flavor and containing ": null
    },
    {
        "cream of tartar": "Cream Of Tartar"
    },
    {
        ". Manays Cryste was a   sweetened cordial flavored with rosewater, violets or cinnamon.      Another early type of soft drink was lemonade, made of water and lemon juice sweetened with honey, but without carbonated water. The Compagnie des Limonadiers of Paris was granted a monopoly for the sale of lemonade soft drinks in 1676. Vendors carried tanks of lemonade on their backs and dispensed cups of the soft drink to Parisians.                 In the late 18th century, scientists made important progress in replicating naturally carbonated ": null
    },
    {
        "mineral water": "Mineral Water"
    },
    {
        "s. In 1767, Englishman ": null
    },
    {
        "Joseph Priestley": "Joseph Priestley"
    },
    {
        " first discovered a method of infusing water with ": null
    },
    {
        "carbon dioxide": "Carbon Dioxide"
    },
    {
        " to make ": null
    },
    {
        "carbonated water": "Carbonated Water"
    },
    {
        "  when he suspended a bowl of distilled water above a beer vat at a local brewery in ": null
    },
    {
        "Leeds": "Leeds"
    },
    {
        ", England. His invention of carbonated water is the major and defining component of most soft drinks.      Priestley found that water treated in this manner had a pleasant taste, and he offered it to his friends as a refreshing drink. In 1772, Priestley published a paper entitled Impregnating Water with Fixed Air in which he describes dripping oil of vitriol  onto ": null
    },
    {
        "chalk": "Chalk"
    },
    {
        " to produce carbon dioxide gas, and encouraging the gas to dissolve into an agitated bowl of water.     Another Englishman, ": null
    },
    {
        "John Mervin Nooth": "John Mervin Nooth"
    },
    {
        ", improved Priestleys design and sold his apparatus for commercial use in pharmacies. Swedish chemist ": null
    },
    {
        "Torbern Bergman": "Torbern Bergman"
    },
    {
        " invented a generating apparatus that made carbonated water from chalk by the use of sulfuric acid. Bergmans apparatus allowed imitation mineral water to be produced in large amounts. Swedish chemist ": null
    },
    {
        "Jöns Jacob Berzelius": "Jöns Jacob Berzelius"
    },
    {
        " started to add flavors to carbonated water in the late eighteenth century.     ": null
    },
    {
        "Thomas Henry": "Thomas Henry"
    },
    {
        ", an ": null
    },
    {
        "apothecary": "Apothecary"
    },
    {
        " from Manchester, was the first to sell artificial mineral water to the general public for medicinal purposes, beginning in the 1770s. His recipe for Bewleys Mephitic Julep consisted of 3 ": null
    },
    {
        "drachms": "Dram"
    },
    {
        "of fossil alkali to a ": null
    },
    {
        "quart": "Quart"
    },
    {
        " of water, and the manufacture had to throw in streams of fixed air until all the alkaline taste is destroyed.     ": null
    },
    {
        "Johann Jacob Schweppe": "Johann Jacob Schweppe"
    },
    {
        " developed a similar process to manufacture ": null
    },
    {
        "carbonated": "Carbonated"
    },
    {
        " mineral water": "Mineral Water"
    },
    {
        " at the same time. He founded the Schweppes Company in ": null
    },
    {
        "Geneva": "Geneva"
    },
    {
        " in 1783 to sell carbonated water,  and relocated his business to London in 1792. His drink soon gained in popularity; among his new found patrons was ": null
    },
    {
        "Erasmus Darwin": "Erasmus Darwin"
    },
    {
        ". In 1843, Schweppes commercialized ": null
    },
    {
        "Malvern Water": "Malvern Water"
    },
    {
        " at the Holywell Spring in the Malvern Hills, and received a royal warrant from King William IV.      It was not long before flavoring was combined with carbonated water. The earliest reference to carbonated ": null
    },
    {
        "ginger beer": "Ginger Beer"
    },
    {
        " is in a Practical Treatise on Brewing. published in 1809. The drinking of either natural or artificial mineral ": null
    },
    {
        "water": "Water"
    },
    {
        " was considered at the time to be a healthy practice, and was promoted by advocates of ": null
    },
    {
        "temperance": "Temperance Movement"
    },
    {
        ". Pharmacists selling mineral waters began to add herbs and chemicals to unflavored mineral water. They used birch bark , ": null
    },
    {
        "dandelion": "Dandelion"
    },
    {
        ", ": null
    },
    {
        "sarsaparilla": "Smilax Regelii"
    },
    {
        ", fruit extracts, and other substances. Flavorings were also added to improve the taste.            Soft drinks soon outgrew their origins in the medical world and became a widely consumed product, available cheaply for the masses. By the 1840s there were more than fifty soft drink manufacturers – an increase from just ten in the previous decade. Carbonated ": null
    },
    {
        "lemonade": "Lemonade"
    },
    {
        " was widely available in British refreshment stalls in 1833,  and in 1845 ": null
    },
    {
        "R. Whites Lemonade": "R. Whites Lemonade"
    },
    {
        " went on sale in the UK.  For the ": null
    },
    {
        "Great Exhibition": "Great Exhibition"
    },
    {
        " of 1851 in London, Schweppes was designated the official drink supplier and sold over a million bottles of lemonade, ginger beer, ": null
    },
    {
        "Seltzer water": "Seltzer Water"
    },
    {
        " and soda-water. There was a Schweppes soda water fountain, situated directly at the entrance to the exhibition.     Mixer drinks became popular in the second half of the century. ": null
    },
    {
        "Tonic water": "Tonic Water"
    },
    {
        " was originally ": null
    },
    {
        "quinine": "Quinine"
    },
    {
        " added to water as a ": null
    },
    {
        "prophylactic": "Prophylaxis"
    },
    {
        " against ": null
    },
    {
        "malaria": "Malaria"
    },
    {
        " and was consumed by British officials stationed in the tropical areas of ": null
    },
    {
        "South Asia": "South Asia"
    },
    {
        " and ": null
    },
    {
        "Africa": "Africa"
    },
    {
        ". As the quinine powder was so bitter people began mixing the powder with soda and sugar, and a basic tonic water was created. The first commercial tonic water was produced in 1858.  The ": null
    },
    {
        "mixed drink": "Mixed Drink"
    },
    {
        " gin and tonic": "Gin And Tonic"
    },
    {
        " also originated in ": null
    },
    {
        "British colonial India": "British India"
    },
    {
        ", when the British population would mix their medicinal quinine tonic with ": null
    },
    {
        "gin": "Gin"
    },
    {
        ".        A persistent problem in the soft drinks industry was the lack of an effective sealing of the bottles. Carbonated drink ": null
    },
    {
        "bottles": "Bottle"
    },
    {
        "are under great pressure from the gas, so inventors tried to find the best way to prevent the carbon dioxide or bubbles from escaping. The bottles could also explode if the pressure was too great. ": null
    },
    {
        "Hiram Codd": "Hiram Codd"
    },
    {
        " devised a patented ": null
    },
    {
        "bottling": "Bottling"
    },
    {
        " machine while working at a small mineral water works in the ": null
    },
    {
        "Caledonian Road": "Caledonian Road"
    },
    {
        ", ": null
    },
    {
        "Islington": "Islington"
    },
    {
        ", in London in 1870. His ": null
    },
    {
        "Codd-neck bottle": "Codd-Neck Bottle"
    },
    {
        " was designed to enclose a ": null
    },
    {
        "marble": "Marble"
    },
    {
        " and a ": null
    },
    {
        "rubber": "Rubber"
    },
    {
        " washer": "Washer"
    },
    {
        " in the neck. The bottles were filled upside down, and pressure of the gas in the bottle forced the marble against the washer, sealing in the carbonation. The bottle was pinched into a special shape to provide a chamber into which the marble was pushed to open the bottle. This prevented the marble from blocking the neck as the drink was poured.     By mid-1873 he had granted 20 licenses and received a further 50 applications. This was boosted further by a ": null
    },
    {
        "Trade Show": "Trade Fair"
    },
    {
        " held in London in the same year. By 1874 the license was free to bottle manufacturers as long as they purchased the marbles, sealing rings and used his groove tool, and the mineral water firms they traded with had already bought a license to use his bottle.     In 1892, the ": null
    },
    {
        "Crown Cork Bottle Seal": "Crown Cork"
    },
    {
        " was patented by ": null
    },
    {
        "William Painter": "William Painter"
    },
    {
        ", a Baltimore, Maryland machine shop operator. It was the first bottle top to successfully keep the bubbles in the bottle. In 1899, the first patent was issued for a ": null
    },
    {
        "glass-blowing": "Glass-Blowing"
    },
    {
        " machine for the automatic production of glass bottles. Earlier glass bottles had all been hand-blown. Four years later, the new bottle-blowing machine was in operation. It was first operated by the inventor, ": null
    },
    {
        "Michael Owens": "Michael Joseph Owens"
    },
    {
        ", an employee of Libby Glass Company. Within a few years, glass bottle production increased from 1,400 bottles a day to about 58,000 bottles a day.     In America, ": null
    },
    {
        "soda fountains": "Soda Fountain"
    },
    {
        "were initially more popular, and many Americans would frequent the soda fountain daily. Beginning in 1806, ": null
    },
    {
        "Yale University": "Yale University"
    },
    {
        " chemistry professor ": null
    },
    {
        "Benjamin Silliman": "Benjamin Silliman"
    },
    {
        " sold soda waters in ": null
    },
    {
        "New Haven, Connecticut": "New Haven, Connecticut"
    },
    {
        ". He used a Nooth apparatus to produce his waters. Businessmen in Philadelphia and New York City also began selling soda water in the early 19th century. In the 1830s, ": null
    },
    {
        "John Matthews": "John Matthews"
    },
    {
        " of New York City and John Lippincott of Philadelphia began manufacturing soda fountains. Both men were successful and built large factories for fabricating fountains. Due to problems in the U.S. glass industry, bottled drinks remained a small portion of the market throughout much of the 19th century.      In the early 20th century, sales of bottled soda increased exponentially, and in the second half of the 20th century, canned soft drinks became an important share of the market.     During the 1920s, Home-Paks were invented. Home-Paks are the familiar ": null
    },
    {
        "six-pack cartons": "Carton"
    },
    {
        " made from cardboard. ": null
    },
    {
        "Vending machines": "Vending Machine"
    },
    {
        "also began to appear in the 1920s. Since then, soft drink vending machines have become increasingly popular. Both hot and cold drinks are sold in these self-service machines throughout the world.       Per capita consumption of soda varies considerably around the world. As of 2014, the top consuming countries per capita were Argentina, the United States, Chile, and Mexico. Developed countries in Europe and elsewhere in the Americas had considerably lower consumption. Annual average consumption in the United States, at 153.5 liters, was about twice that in the United Kingdom or Canada . From 2009 to 2014 consumption dropped over 4% per year in Greece, Romania, Portugal, and Croatia . Over the same period, consumption grew over 20% per year in three countries, resulting in per-capita consumption of 19.1 liters in Cameroon, 43.9 liters in Georgia, and 10.0 liters in Vietnam.           Soft drinks are made by mixing dry or fresh ingredients with water. Production of soft drinks can be done at factories or at home. Soft drinks can be made at home by mixing a ": null
    },
    {
        "syrup": "Syrup"
    },
    {
        " or dry ingredients with carbonated water, or by lacto-fermentation. Syrups are commercially sold by companies such as ": null
    },
    {
        "Soda-Club": "Soda-Club"
    },
    {
        "; dry ingredients are often sold in pouches, in a style of the popular U.S. drink mix ": null
    },
    {
        "Kool-Aid": "Kool-Aid"
    },
    {
        ". Carbonated water is made using a ": null
    },
    {
        "soda siphon": "Soda Siphon"
    },
    {
        " or a ": null
    },
    {
        "home carbonation system": "Home Carbonation System"
    },
    {
        " or by dropping dry ice into water. Food-grade carbon dioxide, used for carbonating drinks, often comes from ": null
    },
    {
        "ammonia": "Ammonia"
    },
    {
        " plants.      Drinks like ": null
    },
    {
        "ginger ale": "Ginger Ale"
    },
    {
        " and ": null
    },
    {
        "root beer": "Root Beer"
    },
    {
        " are often brewed using ": null
    },
    {
        "yeast": "Yeast"
    },
    {
        " to cause ": null
    },
    {
        "carbonation": "Carbonation"
    },
    {
        ".     Of most importance is that the ingredient meets the agreed specification on all major parameters. This is not only the functional parameter , but the level of impurities, the microbiological status, and physical parameters such as color, particle size, etc.      Some soft drinks contain measurable amounts of alcohol. In some older preparations, this resulted from natural fermentation used to build the carbonation. In the United States, soft drinks  are allowed by law to contain up to 0.5% ": null
    },
    {
        "alcohol by volume": "Alcohol By Volume"
    },
    {
        ". Modern drinks introduce carbon dioxide for carbonation, but there is some speculation that alcohol might result from fermentation of sugars in a non-sterile environment. A small amount of alcohol is introduced in some soft drinks where alcohol is used in the preparation of the flavoring extracts such as ": null
    },
    {
        "vanilla extract": "Vanilla Extract"
    },
    {
        ".           In every area of the world there are major soft drink producers. However, a few major North American companies are present in most of the countries of the world, such as ": null
    },
    {
        "Pepsi": "Pepsico"
    },
    {
        " and ": null
    },
    {
        "Coca-Cola": "The Coca-Cola Company"
    },
    {
        ". Major North American producers other than the two previously-named companies include ": null
    },
    {
        "Cott": "Cott"
    },
    {
        ", ": null
    },
    {
        "7 Up": "7 Up"
    },
    {
        ", ": null
    },
    {
        "Dr Pepper Snapple Group": "Dr Pepper Snapple Group"
    },
    {
        ", and ": null
    },
    {
        "Jones Soda": "Jones Soda"
    },
    {
        ".          The over-consumption of sugar-sweetened soft drinks is associated with ": null
    },
    {
        "obesity": "Obesity"
    },
    {
        ",     ": null
    },
    {
        "hypertension": "Hypertension"
    },
    {
        ",  ": null
    },
    {
        "type 2 diabetes": "Diabetes Mellitus Type 2"
    },
    {
        ",  ": null
    },
    {
        "dental caries": "Dental Caries"
    },
    {
        ", and ": null
    },
    {
        "low nutrient levels": "Malnutrition"
    },
    {
        ". Experimental studies tend to support a causal role for sugar-sweetened soft drinks in these ailments, though this is challenged by other researchers.    Sugar-sweetened includes drinks that use ": null
    },
    {
        "high-fructose corn syrup": "High-Fructose Corn Syrup"
    },
    {
        ", as well as those using sucrose.     Many soft drinks contain ingredients that are themselves sources of concern: ": null
    },
    {
        "caffeine": "Caffeine"
    },
    {
        " is linked to anxiety and sleep disruption when consumed in excess. BBC  January 8, 2003 ": null
    },
    {
        "Sodium benzoate": "Sodium Benzoate"
    },
    {
        " has been investigated by researchers at ": null
    },
    {
        "University of Sheffield": "University Of Sheffield"
    },
    {
        " Martin Hickman  The Independent on Sunday May 27, 2007 as a possible cause of ": null
    },
    {
        "DNA damage": "Dna Damage"
    },
    {
        " and ": null
    },
    {
        "hyperactivity": "Hyperactivity"
    },
    {
        ". Other substances have negative health effects, but are present in such small quantities that they are unlikely to pose any substantial health risk provided that the drinks are consumed only in moderation.     In 1998, the ": null
    },
    {
        "Center for Science in the Public Interest": "Center For Science In The Public Interest"
    },
    {
        " published a report titled  Liquid Candy: How Soft Drinks are Harming Americans Health . The report examined statistics relating to the increase in soft drink consumption and claimed that consumption is likely contributing to health problems . It also criticized marketing efforts by soft drink companies. Michael F Jacobson PhD, http://www.cspinet.org/new/pdf/liquid_candy_final_w_new_supplement.pdf Liquid Candy: How Soft Drinks are Harming Americans Health, . In 2005, the CSPI called for warning labels on soft drinks, similar to those on ": null
    },
    {
        "cigarettes": "Cigarettes"
    },
    {
        " and ": null
    },
    {
        "alcohol": "Alcohol"
    },
    {
        ".        From 1977 to 2002, Americans doubled their consumption of ": null
    },
    {
        "sweetened beverages": "Sweetened Beverage"
    },
    {
        "  —a trend that was paralleled by doubling the prevalence of obesity.  The consumption of sugar-sweetened beverages is associated with weight and obesity, and changes in consumption can help predict changes in weight.     It remains possible that the correlation is due to a third factor: people who lead unhealthy lifestyles might consume more soft drinks. If so, then the association between soft drink consumption and weight gain could reflect the consequences of an unhealthy lifestyle rather than the consequences of consuming soft drinks. Experimental evidence is needed to definitively establish the causal role of soft drink consumption. Reviews of the experimental evidence suggest that soft drink consumption does cause weight gain, but the effect is often small except for overweight individuals.     Many of these experiments examined the influence of sugar-sweetened soft drinks on weight gain in children and adolescents. In one experiment, adolescents replaced sugar-sweetened soft drinks in their diet with artificially sweetened soft drinks that were sent to their homes over 25 weeks.  Compared with children in a control group, children who received the artificially sweetened drinks saw a smaller increase in their BMI , but this effect was only statistically significant among the heaviest children . In another study, an educational program encouraged schoolchildren to consume fewer soft drinks.  During the school year, the prevalence of obesity decreased among children in the program by 0.2%, compared to a 7.5% increase among children in the control group. Another study, published in ": null
    },
    {
        "Pediatrics": "Pediatrics"
    },
    {
        " in 2013, concluded that for children from the age of 2 to 5, their risk of obesity increased by 43% if they were regular soft drink consumers as opposed to those who rarely or never consumed them.      Sugar-sweetened drinks have also been speculated  to cause weight gain in adults. In one study, overweight individuals consumed a daily supplement of sucrose-sweetened or artificially sweetened drinks or foods for a 10-week period.  Most of the supplement was in the form of soft drinks. Individuals in the sucrose group gained 1.6  kg, and individuals in the artificial-sweetener group lost 1.0  kg. A two-week study had participants supplement their diet with sugar-sweetened soft drinks, artificially sweetened soft drinks, or neither.  Although the participants gained the most weight when consuming the sugar-sweetened drinks, some of the differences were unreliable: the differences between men who consumed sugar-sweetened drinks or no drinks was not statistically significant.     Other research suggests that soft drinks could play a special role in weight gain. One four-week experiment compared a 450 calorie/day supplement of sugar-sweetened soft drinks to a 450 calorie/day supplement of ": null
    },
    {
        "jelly beans": "Jelly Beans"
    },
    {
        ".  The jelly bean supplement did not lead to weight gain, but the soft drink supplement did. The likely reason for the difference in weight gain is that people who consumed the jelly beans lowered their caloric intake at subsequent meals, while people who consumed soft drinks did not. Thus, the low levels of satiety provided by sugar-sweetened soft drinks may explain their association with obesity. That is, people who consume calories in sugar-sweetened drinks may fail to adequately reduce their intake of calories from other sources. Indeed, people consume more total calories in meals and on days when they are given sugar-sweetened drinks than when they are given artificially sweetened drinks   or water. However, these results are contradicted by a study by Adam Drewnowski published in 2004, in which 32 subjects consumed a 300-calorie snack of fat-free raspberry cookies or regular cola on two occasions each – either two hours or 20 minutes before lunch. It found that ...the calories eaten at lunch were not affected by whether the snack was cookies or cola.      The consumption of sugar-sweetened soft drinks can also be associated with many weight-related diseases, including diabetes, metabolic syndrome and cardiovascular risk factors,  and elevated blood pressure.     According to research presented at the ": null
    },
    {
        "American Heart Associations": "American Heart Association"
    },
    {
        "Epidemiology and Prevention/Nutrition, Physical Activity and Metabolism 2013 Scientific Sessions by researchers at the ": null
    },
    {
        "Harvard School of Public Health": "Harvard School Of Public Health"
    },
    {
        ", sugar-sweetened beverages may be responsible for 180,000 deaths every year worldwide.           Most soft drinks contain high concentrations of simple ": null
    },
    {
        "carbohydrate": "Carbohydrate"
    },
    {
        "s: ": null
    },
    {
        "glucose": "Glucose"
    },
    {
        ", ": null
    },
    {
        "fructose": "Fructose"
    },
    {
        ", ": null
    },
    {
        "sucrose": "Sucrose"
    },
    {
        " and other simple sugars. If oral bacteria ferment ": null
    },
    {
        "carbohydrates": "Carbohydrate"
    },
    {
        "and produce acids that may dissolve tooth enamel and induce dental decay, then sweetened drinks may increase the risk of ": null
    },
    {
        "dental caries": "Dental Caries"
    },
    {
        ". The risk would be greater if the frequency of consumption is high.      A large number of soda pops are ": null
    },
    {
        "acid": "Acid"
    },
    {
        "ic as are many fruits, sauces and other foods. Drinking acidic drinks over a long period and continuous sipping may ": null
    },
    {
        "erode the tooth enamel": "Dental Erosion"
    },
    {
        ". A 2007 study determined that some flavored sparkling waters are as erosive or more so than orange juice.      Using a ": null
    },
    {
        "drinking straw": "Drinking Straw"
    },
    {
        " is often advised by ": null
    },
    {
        "dentists": "Dentistry"
    },
    {
        " as the drink does not come into as much contact with the teeth. It has also been suggested that ": null
    },
    {
        "brushing teeth": "Oral Hygiene"
    },
    {
        " right after drinking soft drinks should be avoided as this can result in additional erosion to the teeth due to the presence of acid.        There have been a handful of published reports describing individuals with severe ": null
    },
    {
        "hypokalemia": "Hypokalemia"
    },
    {
        " related to extreme consumption of colas.        In a meta-analysis of 88 studies, drinking soda correlates with a decrease in ": null
    },
    {
        "milk": "Milk"
    },
    {
        " consumption along with the ": null
    },
    {
        "vitamin D": "Vitamin D"
    },
    {
        ", ": null
    },
    {
        "vitamin B6": "Vitamin B6"
    },
    {
        ", ": null
    },
    {
        "vitamin B12": "Vitamin B12"
    },
    {
        ", ": null
    },
    {
        "calcium": "Calcium"
    },
    {
        ", protein and other ": null
    },
    {
        "micronutrient": "Micronutrient"
    },
    {
        "s.  ": null
    },
    {
        "Phosphorus": "Phosphorus"
    },
    {
        ", a micronutrient, can be found in cola-type drinks, but there may be a risk in consuming too much. Phosphorus and calcium are used in the body to create calcium-phosphate, which is the main component of bone. However, the combination of too much phosphorus with too little calcium in the body can lead to a degeneration of ": null
    },
    {
        "bone mass": "Bone Mass"
    },
    {
        ".   Research suggests a statistically significant inverse relationship between consumption of carbonated drinks and bone mineral density in young girls, which places them at increased risk of fractures.      One hypothesis to explain this relationship is that the ": null
    },
    {
        "phosphoric acid": "Phosphoric Acidprocessed Food Use"
    },
    {
        " contained in some soft drinks displaces calcium from the bones, lowering bone density of the skeleton and leading to weakened bones, or ": null
    },
    {
        "osteoporosis": "Osteoporosis"
    },
    {
        ". However, 2001 calcium metabolism studies by Dr. Robert Heaney suggested that the net effect of carbonated soft drinks, on calcium excretion in urine was negligible. Heaney concluded that carbonated soft drinks, which do not contain the nutrients needed for bone health, may displace other foods which do, and that the real issue is that people who drink a lot of soft drinks also tend to have an overall diet that is low in calcium.      A 2006 study of several thousand men and women, found that women who regularly drank cola-based sodas had significantly lower bone mineral density of ≈4 % in the hip than those who didnt, even though researchers controlled for important factors like calcium and vitamin D intake. The study also found that women who drank non-cola soft drinks didnt appear to have lower BMD and that BMD of women drinking decaffeinated cola wasnt as low as women drinking caffeinated cola sodas. The study found that the effect of regular consumption of cola sodas was not significant on mens BMD.      In the 1950s and 1960s there were attempts in France and Japan to ban the sale of Coca-Cola as dangerous since phosphates can block calcium absorption. However, these were unsuccessful as the amounts of phosphate were shown to be too small to have a significant effect. Phosphates, in Smith, Andrew. The Oxford companion to American food and drink. Oxford University Press US, 2007, , p.451            The ": null
    },
    {
        "USDAs": "United States Department Of Agriculture"
    },
    {
        "recommended daily intake  of added sugars is less than 10 teaspoons per day for a 2,000-": null
    },
    {
        "calorie": "Calorie"
    },
    {
        " diet. Kasper, Dr. Joe, Tasty Tuesdays 13, Stay Far, Far Away, 2012 High caloric intake contributes to ": null
    },
    {
        "obesity": "Obesity"
    },
    {
        " if not balanced with exercise, with a large amount of exercise being required to offset even small but calorie-rich food and drinks.     Until 1985, most of the calories in soft drinks came from ": null
    },
    {
        "sugar": "Sugar"
    },
    {
        " or ": null
    },
    {
        "corn syrup": "Corn Syrup"
    },
    {
        ". As of 2010, in the United States ": null
    },
    {
        "high-fructose corn syrup": "High-Fructose Corn Syrup"
    },
    {
        " is used nearly exclusively as a sweetener because of its lower cost,  while in Europe, ": null
    },
    {
        "sucrose": "Sucrose"
    },
    {
        " dominates, because ": null
    },
    {
        "EU": "European Union"
    },
    {
        " agricultural policies favor production of ": null
    },
    {
        "sugar beets": "Sugar Beet"
    },
    {
        "in Europe proper and ": null
    },
    {
        "sugarcane": "Sugarcane"
    },
    {
        " in the former colonies over the production of corn. HFCS has been criticized  as having a number of detrimental effects on human health, such as promoting diabetes, hyperactivity, hypertension, and a host of other problems.  Although ": null
    },
    {
        "anecdotal evidence": "Anecdotal Evidence"
    },
    {
        " has been presented to support such claims, it is well known that the human body breaks sucrose down into ": null
    },
    {
        "glucose": "Glucose"
    },
    {
        " and ": null
    },
    {
        "fructose": "Fructose"
    },
    {
        " before it is absorbed by the intestines. Simple sugars such as fructose are converted into the same intermediates as in ": null
    },
    {
        "glucose metabolism": "Glucose Metabolism"
    },
    {
        ".  However, metabolism of fructose is extremely rapid and is initiated by ": null
    },
    {
        "fructokinase": "Fructokinase"
    },
    {
        ". Fructokinase activity is not regulated by metabolism or hormones and proceeds rapidly after intake of fructose. While the intermediates of fructose metabolism are similar to those of glucose, the rates of formation are excessive. This fact promotes ": null
    },
    {
        "fatty acid": "Fatty Acid"
    },
    {
        " and ": null
    },
    {
        "triglyceride": "Triglyceride"
    },
    {
        " synthesis in the liver, leading to accumulation of fat throughout the body and possibly ": null
    },
    {
        "non-alcoholic fatty liver disease": "Non-Alcoholic Fatty Liver Disease"
    },
    {
        ". Increased ": null
    },
    {
        "blood lipid": "Blood Lipid"
    },
    {
        " levels also seem to follow fructose ingestion over time. A sugar drink or high-sugar drink may refer to any ": null
    },
    {
        "drink": "Drink"
    },
    {
        " consisting primarily of ": null
    },
    {
        "water": "Drinking Water"
    },
    {
        " and sugar , including some soft drinks, ": null
    },
    {
        "some fruit juice": "Fruit Juice"
    },
    {
        "s, and ": null
    },
    {
        "energy drink": "Energy Drink"
    },
    {
        "s.          In 2006, the United Kingdom ": null
    },
    {
        "Food Standards Agency": "Food Standards Agency"
    },
    {
        " published the results of its survey of ": null
    },
    {
        "benzene": "Benzene"
    },
    {
        " levels in soft drinks,  which tested 150 products and found that four contained benzene levels above the ": null
    },
    {
        "World Health Organization": "World Health Organization"
    },
    {
        " guidelines for drinking water.     The United States ": null
    },
    {
        "Food and Drug Administration": "Food And Drug Administration"
    },
    {
        " released its own test results of several soft drinks containing ": null
    },
    {
        "benzoates": "Benzoates"
    },
    {
        " and ": null
    },
    {
        "ascorbic": "Ascorbic Acid"
    },
    {
        " or ": null
    },
    {
        "erythorbic acid": "Erythorbic Acid"
    },
    {
        ". Five tested drinks contained benzene levels above the ": null
    },
    {
        "Environmental Protection Agencys": "United States Environmental Protection Agency"
    },
    {
        " recommended standard of 5 ": null
    },
    {
        "ppb": "Parts Per Billion"
    },
    {
        ". As of 2006, the FDA stated its belief that the levels of benzene found in soft drinks and other beverages to date do not pose a safety concern for consumers .        In 2003, the Delhi non-profit ": null
    },
    {
        "Centre for Science and Environment": "Centre For Science And Environment"
    },
    {
        " published   a disputed report finding ": null
    },
    {
        "pesticide": "Pesticide"
    },
    {
        " levels in Coke and Pepsi soft drinks sold in India at levels 30 times that considered safe by the ": null
    },
    {
        "European Economic Community": "European Economic Community"
    },
    {
        ".   This was found in primarily 12 cold drink brands sold in and around ": null
    },
    {
        "New Delhi": "New Delhi"
    },
    {
        ".  The Indian Health Minister said the CSE tests were inaccurate, and said that the governments tests found pesticide levels within Indias standards but above EU standards.       A similar CSE report in August 2006 prompted many state governments to have issued a ban of the sale of soft drinks in schools. ": null
    },
    {
        "Kerala": "Kerala"
    },
    {
        " issued a complete ban on the sale or manufacture of soft drinks altogether. In return, the soft drink companies like Coca-Cola and Pepsi have issued ads in the media regarding the safety of consumption of the drinks. BBC  August 9, 2006     The UK-based Central Science Laboratory, commissioned by Coke, found its products met EU standards in 2006.  Coke and the ": null
    },
    {
        "University of Michigan": "University Of Michigan"
    },
    {
        " commissioned an independent study of its bottling plants by The Energy and Resources Institute , which reported in 2008 no unsafe chemicals in the water supply used.        A study published in the Clinical Journal of the American Society of Nephrology  in 2013 concluded that consumption of soft drinks was associated with a 23% higher risk of developing ": null
    },
    {
        "kidney stones": "Kidney Stones"
    },
    {
        ".          Since at least 2006, debate on whether high-calorie soft drink ": null
    },
    {
        "vending machines": "Vending Machine"
    },
    {
        "should be allowed in schools has been on the rise. Opponents of the soft drink vending machines believe that soft drinks are a significant contributor to ": null
    },
    {
        "childhood obesity": "Childhood Obesity"
    },
    {
        " and ": null
    },
    {
        "tooth decay": "Tooth Decay"
    },
    {
        ", and that allowing soft drink sales in schools encourages children to believe they are safe to consume in moderate to large quantities.  Opponents argue that schools have a responsibility to look after the health of the children in their care, and that allowing children easy access to soft drinks violates that responsibility.  Vending machine proponents believe that obesity is a complex issue and soft drinks are not the only cause.  A 2011 bill to tax soft drinks in California failed, with some opposing lawmakers arguing that parents—not the government—should be responsible for childrens drink choices.      On May 3, 2006, the Alliance for a Healthier Generation,  ": null
    },
    {
        "Cadbury Schweppes": "Cadbury Schweppes"
    },
    {
        ", ": null
    },
    {
        "The Coca-Cola Company": "The Coca-Cola Company"
    },
    {
        ", ": null
    },
    {
        "PepsiCo": "Pepsico"
    },
    {
        ", and the ": null
    },
    {
        "American Beverage Association": "American Beverage Association"
    },
    {
        " announced new guidelines  that will voluntarily remove high-calorie soft drinks from all U.S. schools.     On May 19, 2006, the British ": null
    },
    {
        "education secretary": "Secretary Of State For Education And Skills"
    },
    {
        ", ": null
    },
    {
        "Alan Johnson": "Alan Johnson"
    },
    {
        ", announced new minimum nutrition standards for school food. Among a wide range of measures, from September 2006, school lunches will be free from carbonated drinks. Schools will also end the sale of junk food in vending machines and ": null
    },
    {
        "tuck shop": "Tuck Shop"
    },
    {
        "s.     In 2008, Samantha K Graff published an article in the Annals of the American Academy of Political and Social Science regarding the First Amendment Implications of Restricting Food and Beverages Marketing in Schools . The article examines a school districts policy regarding limiting the sale and marketing of soda in public schools, and how certain policies can invoke a violation of the ": null
    },
    {
        "First Amendment": "First Amendment"
    },
    {
        ". Due to district budget cuts and loss in state funding, many school districts allow commercial businesses to market and advertise their product to public school students for additional revenue. Junk food and soda companies have acquired exclusive rights to vending machines throughout many public school campuses. Opponents of corporate marketing and advertising on school grounds urge school officials to restrict or limit a corporations power to promote, market, and sell their product to school students. In the 1970s, the Supreme Court ruled that ": null
    },
    {
        "advertising": "Advertising"
    },
    {
        " was not a form of ": null
    },
    {
        "free expression": "Free Expression"
    },
    {
        ", but a form of ": null
    },
    {
        "business practices": "Business Practices"
    },
    {
        " which should be regulated by the government. In the 1976 case of Virginia State Board of Pharmacy v. Virginia Citizens Consumer Council,  the Supreme Court ruled that advertising, or ": null
    },
    {
        "commercial speech": "Commercial Speech"
    },
    {
        " , to some degree is protected under the First Amendment. To avoid a First Amendment challenge by corporations, public schools could create contracts that restrict the sale of certain product and advertising. Public schools can also ban the selling of all food and drink products on campus, while not infringing on a corporations right to free speech.      On December 13, 2010, President Obama signed the Healthy Hunger Free Kids Act of 2010  that mandates schools that receive federal funding must offer healthy snacks and drinks to students. The act bans the selling of soft drinks to students and requires schools to provide healthier options such as water, unflavored low-fat milk, 100% fruit and vegetable drinks or sugar-free carbonated drinks. The portion sizes available to students will be based on age: eight ounces for elementary schools, twelve ounces for middle and high schools. Proponents of the act predict the new mandate it will make it easier for students to make healthy drink choices while at school.      In 2015, Terry-McElarth and colleagues published a study in the American Journal of Preventative Medicine on regular soda policies and their effect on school drink availability and student consumption. The purpose of the study was to determine the effectiveness of a program beginning in the 2014–2015 school year that requires schools participating in federally reimbursable meal programs to remove all competitive venues , on the availability of unhealthy drinks at schools and student consumption. The study analyzed state- and school district-level policies mandating soda bans and found that state bans were associated with significantly lower school soda availability but district bans showed no significant associations. In addition, no significant correlation was observed between state policies and student consumption. Among student populations, state policy was directly associated with significantly lower school soda availability and indirectly associated with lower student consumption. The same was not observed for other student populations.             In the United States, legislators, health experts and consumer advocates are considering levying higher ": null
    },
    {
        "tax": "Tax"
    },
    {
        "es on the sale of soft drinks and other sweetened products to help curb the epidemic of ": null
    },
    {
        "obesity": "Obesity"
    },
    {
        " among Americans, and its harmful impact on overall health. Some speculate that higher taxes could help reduce soda consumption.  Others say that taxes should help fund education to increase consumer awareness of the unhealthy effects of excessive soft drink consumption, and also help cover costs of caring for conditions resulting from overconsumption.  The ": null
    },
    {
        "food": "Food Industry"
    },
    {
        " and ": null
    },
    {
        "drink industry": "Drink Industry"
    },
    {
        " holds considerable clout in Washington, DC, as it has contributed more than $50 million to legislators since 2000.      In January 2013, a British ": null
    },
    {
        "lobby group": "Lobby Group"
    },
    {
        " called for the price of sugary fizzy drinks to be increased, with the money raised to be put towards a Childrens Future Fund , overseen by an independent body, which would encourage children to eat healthily in school.      In 2017, the Kingdom of Saudi Arabia, the United Arab Emirates and the Kingdom of Bahrain imposed a 50% tax on soft drinks and a 100% tax on energy drinks to curb excess consumption of the commodity and for additional revenue.        In March 2013, ": null
    },
    {
        "New York Citys": "New York City"
    },
    {
        "mayor ": null
    },
    {
        "Michael Bloomberg": "Michael Bloomberg"
    },
    {
        " proposed to ban the sale of non-diet soft drinks larger than 16 ounces, except in convenience stores and supermarkets. A lawsuit against the ban was upheld by a state judge, who voiced concerns that the ban was fraught with arbitrary and capricious consequences . Bloomberg announced that he would be appealing the verdict.  ": null
    }
]