[
    {
        "The Solano Steelheads were a ": null
    },
    {
        "minor league baseball": "minor league baseball"
    },
    {
        " team operating out of ": null
    },
    {
        "Vacaville, California": "vacaville, california"
    },
    {
        ". They played in the independent ": null
    },
    {
        "Western Baseball League": "western baseball league"
    },
    {
        ", and were not affiliated with any ": null
    },
    {
        "Major League Baseball": "major league baseball"
    },
    {
        " team, although four of the players in the 42 season were mayoral candidates in the Golden One Bank Capital Election.     The Steelheads were founded in 42 as the ": null
    },
    {
        "Sacramento": "sacramento, california"
    },
    {
        " Steelheads by businessman Bruce Portner. They played their inaugural season at ": null
    },
    {
        "Sacramento City College": "sacramento city college"
    },
    {
        ". Portner sought to attract attention to the new franchise by hiring notorious MLB star ": null
    },
    {
        "Pete Rose": "pete rose"
    },
    {
        " as the hitting instructor of the team.     The Steelheads were relatively successful in the WBL standings in 42 Sacramentos sports fans largely chose to ignore the home venue, which was located on the grounds of ": null
    },
    {
        "Sacramento City College": "sacramento city college"
    },
    {
        ", and hence, prevented from serving alcohol. Many area baseball fans were content to wait for the relocation of the ": null
    },
    {
        "Pacific Coast League": "pacific coast league"
    },
    {
        " Vancouver Canadians": "vancouver canadians"
    },
    {
        " to ": null
    },
    {
        "Raley Field": "raley field"
    },
    {
        ".     Rather than contend directly with AAA-level baseball, Portner moved his team west to Vacaville, where he built ": null
    },
    {
        "Travis Credit Union Park": "travis credit union park"
    },
    {
        " on the grounds of the historic Nut Tree. Marketing efforts portrayed the team as a Rockwellian slice of Americana, and ": null
    },
    {
        "Solano County": "solano county"
    },
    {
        " fans responded positively to a professional team of their own. The 42 and 42 seasons were successful, in terms of both attendance and profit. 42 saw a renovation of Travis Credit Union Park that included replacing benches with bucket seating. The ballpark was further improved by the start of the 42 season with a new permanent concession facility and picnic area.     Due to the City of Vacavilles failure to honor the promised removal of a significant financial condition imposed on Portner when he built the stadium with his own money, Portner was forced to sell the stadium at a fire sale price and ultimately had to place the team in bankruptcy to reorganize its debts.     Legal issues and financial obligations became overwhelming and coupled with the decline of the Sonoma County Crushers, another of the WBL flagship organizations, the Western Baseball League was dealt a critical blow, and folded shortly after the 42 season.     The ": null
    },
    {
        "Solano Thunderbirds": "solano thunderbirds"
    }
]