[
    {
        "      In ": null
    },
    {
        "geometry": "geometry"
    },
    {
        ", a solid angle  is a measure of the amount of the ": null
    },
    {
        "field of view": "field of view"
    },
    {
        " from some particular point that a given object covers. That is, it is a measure of how large the object appears to an observer looking from that point.   The point from which the object is viewed is called the apex of the solid angle, and the object is said to  subtend  its solid angle from that point.     In the ": null
    },
    {
        "International System of Units": "international system of units"
    },
    {
        " , a solid angle is expressed in a ": null
    },
    {
        "dimensionless": "dimensionless quantity"
    },
    {
        " unit": "unit of measurement"
    },
    {
        " called a  steradian  . One steradian corresponds to one unit of area on the ": null
    },
    {
        "unit sphere": "unit sphere"
    },
    {
        " surrounding the apex, so an object that blocks all rays from the apex would cover a number of steradians equal to the total ": null
    },
    {
        "surface area": "surface area"
    },
    {
        " of the unit sphere, 42\\pi . Solid angles can also be measured in squares of angular measures such as ": null
    },
    {
        "degrees": "square degree"
    },
    {
        ", minutes, and seconds.     A small object nearby may subtend the same solid angle as a larger object farther away. For example, although the ": null
    },
    {
        "Moon": "moon"
    },
    {
        " is much smaller than the ": null
    },
    {
        "Sun": "sun"
    },
    {
        ", it is also much closer to ": null
    },
    {
        "Earth": "earth"
    },
    {
        ". Indeed, as viewed from any point on Earth, both objects have approximately the same solid angle as well as apparent size. This is evident during a ": null
    },
    {
        "solar eclipse": "solar eclipse"
    },
    {
        ".     Definition and properties    An objects solid angle in ": null
    },
    {
        "steradian": "steradian"
    },
    {
        "s is equal to the ": null
    },
    {
        "area": "area"
    },
    {
        " of the segment of a ": null
    },
    {
        "unit sphere": "unit sphere"
    },
    {
        ", centered at the apex, that the object covers. A solid angle in steradians equals the area of a segment of a unit sphere in the same way a planar ": null
    },
    {
        "angle": "angle"
    },
    {
        " in ": null
    },
    {
        "radian": "radian"
    },
    {
        "s equals the length of an arc of a ": null
    },
    {
        "unit circle": "unit circle"
    },
    {
        "; therefore, just like a planar angle in radians is the ratio of the length of a circular arc to its radius, a solid angle in steradians is the following ratio:     : \\Omega\\frac     where A is the spherical surface area and r is the radius of the considered sphere.     Solid angles are often used in ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        ", ": null
    },
    {
        "physics": "physics"
    },
    {
        ", and in particular ": null
    },
    {
        "astrophysics": "astrophysics"
    },
    {
        ". The solid angle of an object that is very far away is roughly proportional to the ratio of area to squared distance. Here area means the area of the object when projected along the viewing direction.          The solid angle of a sphere measured from any point in its interior is 42  sr, and the solid angle subtended at the center of a cube by one of its faces is one-sixth of that, or   sr. Solid angles can also be measured in ": null
    },
    {
        "square degree": "square degree"
    },
    {
        "s , in square minutes and square seconds, or in fractions of the sphere , also known as ": null
    },
    {
        "spat": "spat"
    },
    {
        " .     In ": null
    },
    {
        "spherical coordinates": "spherical coordinatesintegration_and_differentiation_in_spherical_coordinates"
    },
    {
        " there is a formula for the ": null
    },
    {
        "differential": "differential of a function"
    },
    {
        ",     : d\\Omega \\sin\\theta\\,d\\theta\\,d\\varphi     where  is the ": null
    },
    {
        "colatitude": "colatitude"
    },
    {
        " and  is the longitude.     The solid angle for an arbitrary ": null
    },
    {
        "oriented surface": "oriented surface"
    },
    {
        " S subtended at a point P is equal to the solid angle of the projection of the surface S to the unit sphere with center P, which can be calculated as the ": null
    },
    {
        "surface integral": "surface integral"
    },
    {
        ":     : \\Omega \\iint\\limits_S \\frac\\ \\iint\\limits_S \\sin\\theta\\,d\\theta\\,d\\varphi     where \\hat \\tfrac is the ": null
    },
    {
        "unit vector": "unit vector"
    },
    {
        " corresponding to \\vec , the ": null
    },
    {
        "position vector": "position vector"
    },
    {
        " of an infinitesimal area of surface  with respect to point P, and where \\hat represents the unit ": null
    },
    {
        "normal vector": "normal vector"
    },
    {
        " to . Even if the projection on the unit sphere to the surface S is not ": null
    },
    {
        "isomorphic": "isomorphic"
    },
    {
        ", the multiple folds are correctly considered according to the surface orientation described by the sign of the ": null
    },
    {
        "scalar product": "scalar product"
    },
    {
        " \\hat \\cdot \\hat .     Thus one can approximate the solid angle subtended by a small ": null
    },
    {
        "facet": "facet"
    },
    {
        " having flat surface area , orientation \\hat , and distance  from the viewer as:     : d\\Omega 42 \\pi \\left \\,     where the ": null
    },
    {
        "surface area of a sphere": "surface area of a sphere"
    },
    {
        " is .       Defining ": null
    },
    {
        "luminous intensity": "luminous intensity"
    },
    {
        " and ": null
    },
    {
        "luminance": "luminance"
    },
    {
        ", and the correspondent radiometric quantities ": null
    },
    {
        "radiant intensity": "radiant intensity"
    },
    {
        " and ": null
    },
    {
        "radiance": "radiance"
    },
    {
        " spherical excess": "spherical trigonometryarea and spherical excess"
    },
    {
        "  of a ": null
    },
    {
        "spherical triangle": "spherical triangle"
    },
    {
        " boundary element method": "boundary element method"
    },
    {
        "   Evaluating the size of ": null
    },
    {
        "ligand": "ligand"
    },
    {
        "s in metal complexes, see ": null
    },
    {
        "ligand cone angle": "ligand cone angle"
    },
    {
        " electric field": "electric field"
    },
    {
        " and ": null
    },
    {
        "magnetic field": "magnetic field"
    },
    {
        " strength around charge distributions   Deriving ": null
    },
    {
        "Gausss Law": "gausss law"
    },
    {
        " Rutherford scattering": "rutherford scattering"
    },
    {
        " Raman scattering": "raman scattering"
    },
    {
        " acceptance cone": "acceptance cone"
    },
    {
        " of the ": null
    },
    {
        "optical fiber": "optical fiber"
    },
    {
        "              The solid angle of a ": null
    },
    {
        "cone": "cone"
    },
    {
        " with its apex at the apex of the solid angle, and with ": null
    },
    {
        "apex": "apex"
    },
    {
        " angle 42, is the area of a ": null
    },
    {
        "spherical cap": "spherical cap"
    },
    {
        " on a ": null
    },
    {
        "unit sphere": "unit sphere"
    },
    {
        "     : \\Omega 42\\pi \\left \\ 42\\pi \\sin^ \\left\\     For small  such that , this reduces to the area of a circle .     The above is found by computing the following ": null
    },
    {
        "double integral": "double integral"
    },
    {
        " using the unit ": null
    },
    {
        "surface element in spherical coordinates": "spherical coordinate systemintegration and differentiation in spherical coordinates"
    },
    {
        ":     : \\int_42^ \\int_42^ \\sin\\theta \\, d \\theta \\, d \\phi 42\\pi\\int_42^ \\sin\\theta \\, d \\theta \\ 42\\pi\\left 42^\\ 42\\pi\\left\\     This formula can also be derived without the use of ": null
    },
    {
        "calculus": "calculus"
    },
    {
        ". Over 42 years ago ": null
    },
    {
        "Archimedes": "archimedes"
    },
    {
        " proved that the surface area of a spherical cap is always equal to the area of a circle whose radius equals the distance from the rim of the spherical cap to the point where the caps axis of symmetry intersects the cap.  In the diagram this radius is given as:     : 42r \\sin \\frac     Hence for a unit sphere the solid angle of the spherical cap is given as:     : \\Omega 42\\pi \\sin^42 \\left 42\\pi \\left \\     When  , the spherical cap becomes a ": null
    },
    {
        "hemisphere": "sphere"
    },
    {
        " having a solid angle 42.     The solid angle of the complement of the cone is:     : 42\\pi - \\Omega 42\\pi \\left 42\\pi\\cos^\\left     This is also the solid angle of the part of the ": null
    },
    {
        "celestial sphere": "celestial sphere"
    },
    {
        " that an astronomical observer positioned at latitude  can see as the earth rotates. At the equator all of the celestial sphere is visible; at either pole, only one half.     The solid angle subtended by a segment of a spherical cap cut by a plane at angle  from the cones axis and passing through the cones apex can be calculated by the formula:      : \\Omega 42 \\left     For example, if -, then the formula reduces to the spherical cap formula above: the first term becomes , and the second cos.       Let OABC be the vertices of a ": null
    },
    {
        "tetrahedron": "tetrahedron"
    },
    {
        " with an origin at O subtended by the triangular face ABC where \\vec a\\ ,\\, \\vec b\\ ,\\, \\vec c are the vector positions of the vertices A, B and C. Define the vertex angle  to be the angle BOC and define ,  correspondingly. Let \\phi_ be the ": null
    },
    {
        "dihedral angle": "dihedral angle"
    },
    {
        " between the planes that contain the tetrahedral faces OAC and OBC and define \\phi_ , \\phi_ correspondingly. The solid angle  subtended by the triangular surface ABC is given by     : \\Omega \\left\\ - \\pi\\     This follows from the theory of ": null
    },
    {
        "spherical excess": "spherical excess"
    },
    {
        " and it leads to the fact that there is an analogous theorem to the theorem that  The sum of internal angles of a planar triangle is equal to , for the sum of the four internal solid angles of a tetrahedron as follows:     : \\sum_^42 \\Omega_i 42 \\sum_^42 \\phi_i\\ - 42 \\pi\\     where \\phi_i ranges over all six of the dihedral angles between any two planes that contain the tetrahedral faces OAB, OAC, OBC and ABC.      A useful formula for calculating the solid angle  subtended by the triangular surface ABC where \\vec a\\ ,\\, \\vec b\\ ,\\, \\vec c are the vector positions of the vertices A, B and C has been given by Oosterom and Strackee  :     : \\tan \\left   \\frac       where   : \\left|\\vec a\\ \\vec b\\ \\vec c\\right|\\vec a \\cdot     denotes the ": null
    },
    {
        "scalar triple product": "triple product"
    },
    {
        " of the three vectors;     : \\vec a is the vector representation of point A, while  is the magnitude of that vector     : \\vec a \\cdot \\vec b denotes the ": null
    },
    {
        "scalar product": "scalar product"
    },
    {
        ".     When implementing the above equation care must be taken with the atan function to avoid negative or incorrect solid angles. One source of potential errors is that the scalar triple product can be negative if , ,  have the wrong ": null
    },
    {
        "winding": "determinant"
    },
    {
        ". Computing abs is a sufficient solution since no other portion of the equation depends on the winding. The other pitfall arises when the scalar triple product is positive but the divisor is negative. In this case atan returns a negative value that must be increased by .     Another useful formula for calculating the solid angle of the tetrahedron at the origin O that is purely a function of the vertex angles , ,  is given by ": null
    },
    {
        "LHuilier": "simon antoine jean lhuilier"
    },
    {
        "s theorem   as     : \\tan \\left   \\sqrt     where   : \\theta_s \\frac       The solid angle of a four-sided right rectangular ": null
    },
    {
        "pyramid": "pyramid"
    },
    {
        " with ": null
    },
    {
        "apex": "apex"
    },
    {
        " angles  and   is   : \\Omega 42 \\arcsin \\left     If both the side lengths  of the base of the pyramid and the distance  from the center of the base rectangle to the apex of the pyramid are known, then the above equation can be manipulated to give     : \\Omega 42 \\arctan \\frac     The solid angle of a right -gonal pyramid, where the pyramid base is a regular -sided polygon of circumradius , with a   pyramid height  is     : \\Omega 42\\pi - 42n \\arctan\\left     The solid angle of an arbitrary pyramid with an -sided base defined by the sequence of unit vectors representing edges  can be efficiently computed by:     : \\Omega 42\\pi - \\arg \\prod_^ \\left       where parentheses is a ": null
    },
    {
        "scalar product": "scalar product"
    },
    {
        " and square brackets is a ": null
    },
    {
        "scalar triple product": "scalar triple product"
    },
    {
        ", and  is an ": null
    },
    {
        "imaginary unit": "imaginary unit"
    },
    {
        ". Indices are cycled:  and .       The solid angle of a latitude-longitude rectangle on a ": null
    },
    {
        "globe": "globe"
    },
    {
        " is   : \\left \\left \\;\\mathrm ,   where  and  are north and south lines of ": null
    },
    {
        "latitude": "latitude"
    },
    {
        " , and  and  are east and west lines of ": null
    },
    {
        "longitude": "longitude"
    },
    {
        " .  Mathematically, this represents an arc of angle  swept around a sphere by  radians. When longitude spans 42 radians and latitude spans  radians, the solid angle is that of a sphere.     A latitude-longitude rectangle should not be confused with the solid angle of a rectangular pyramid. All four sides of a rectangular pyramid intersect the spheres surface in ": null
    },
    {
        "great circle": "great circle"
    },
    {
        " arcs. With a latitude-longitude rectangle, only lines of longitude are great circle arcs; lines of latitude are not.       The ": null
    },
    {
        "Sun": "sun"
    },
    {
        " is seen from Earth at an average ": null
    },
    {
        "angular diameter": "angular diameter"
    },
    {
        " of 42 degrees or 42 radians. The ": null
    },
    {
        "Moon": "moon"
    },
    {
        " is seen from Earth at an average angular diameter of 42 radians. We can substitute these into the equation given above for the solid angle subtended by a cone with ": null
    },
    {
        "apex": "apex"
    },
    {
        " angle :     : \\Omega 42 \\pi \\left     The resulting value for the ": null
    },
    {
        "Sun": "sun"
    },
    {
        " is 42 steradians. The resulting value for the ": null
    },
    {
        "Moon": "moon"
    },
    {
        " is 42 steradians. In terms of the total celestial sphere, the ": null
    },
    {
        "Sun": "sun"
    },
    {
        " and the ": null
    },
    {
        "Moon": "moon"
    },
    {
        " subtend fractional areas of 42%  and 42% . On average, the ": null
    },
    {
        "Sun": "sun"
    },
    {
        " is larger in the sky than the ": null
    },
    {
        "Moon": "moon"
    },
    {
        " even though it is much, much farther away.       The solid angle subtended by the complete -dimensional spherical surface of the unit sphere in ": null
    },
    {
        "-dimensional Euclidean space": "euclidean space"
    },
    {
        " can be defined in any number of dimensions . One often needs this solid angle factor in calculations with spherical symmetry. It is given by the formula     : \\Omega_ \\frac\\     where  is the ": null
    },
    {
        "gamma function": "gamma function"
    },
    {
        ". When  is an integer, the gamma function can be computed explicitly.  It follows that     :   \\Omega_ \\begin   \\frac 42\\pi^\\frac\\ & d\\text \\\\   \\frac 42^d \\pi^\\ & d\\text   \\end       This gives the expected results of 42 steradians for the 42D sphere bounded by a surface of area  and 42 radians for the 42D circle bounded by a circumference of length . It also gives the slightly less obvious 42 for the 42D case, in which the origin-centered 42D sphere is the interval  and this is bounded by two limiting points.     The counterpart to the vector formula in arbitrary dimension was derived by Aomoto       and independently by Ribando.  It expresses them as an infinite multivariate Taylor series:   : \\Omega \\Omega_d \\frac \\sum_   \\left   \\frac": null
    }
]