[
    {
        "              Sonja Henie was a ": null
    },
    {
        "Norwegian": "norway"
    },
    {
        " figure skater": "figure skating"
    },
    {
        " and film star. She was a three-time ": null
    },
    {
        "Olympic Champion": "list of olympic medalists in figure skating"
    },
    {
        "  in Ladies Singles, a ten-time ": null
    },
    {
        "World Champion": "world figure skating championships"
    },
    {
        " and a six-time ": null
    },
    {
        "European Champion": "european figure skating championships"
    },
    {
        " . Henie won more Olympic and World titles than any other ladies figure skater. At the height of her acting career, she was one of the highest-paid stars in ": null
    },
    {
        "Hollywood": "cinema in the united states"
    },
    {
        " and starred in a series of box-office hits, including  Thin Ice  ,  My Lucky Star  ,  Second Fiddle  and  Sun Valley Serenade  .  . Snl.no . Retrieved on 19 August 2015.           Henie was born in 1912 in Kristiania  Norway; she was the only daughter of ": null
    },
    {
        "Wilhelm Henie": "wilhelm henie"
    },
    {
        " , a prosperous Norwegian ": null
    },
    {
        "furrier": "fur clothing"
    },
    {
        ", and his wife, Selma Lochmann-Nielsen . In addition to the income from the fur business, both of Henies parents had inherited wealth. Wilhelm Henie had been a one-time ": null
    },
    {
        "World Cycling Champion": "uci track cycling world championships"
    },
    {
        " and the Henie children were encouraged to take up a variety of sports at a young age. Henie initially showed talent at ": null
    },
    {
        "skiing": "skiing"
    },
    {
        ", then followed her older brother, Leif, to take up ": null
    },
    {
        "figure skating": "figure skating"
    },
    {
        ". As a girl Henie also was a nationally ranked ": null
    },
    {
        "tennis": "tennis"
    },
    {
        " player, and a skilled ": null
    },
    {
        "swimmer": "swimming"
    },
    {
        " and ": null
    },
    {
        "equestrienne": "equestrianism"
    },
    {
        ". Once Henie began serious training as a figure skater, her formal schooling ended. She was educated by tutors, and her father hired the best experts in the world, including the famous Russian ballerina, ": null
    },
    {
        "Tamara Karsavina": "tamara karsavina"
    },
    {
        ", to transform his daughter into a sporting celebrity.  . Snl.no. Retrieved on 19 August 2015.       Henie won her first major competition, the senior Norwegian championships, at the age of 10. She then placed eighth in a field of eight at the ": null
    },
    {
        "1924 Winter Olympics": "1924 winter olympics"
    },
    {
        ", at the age of eleven.  . sports-reference.com During the 1924 program, she skated over to the side of the rink several times to ask her coach for directions, but by the next Olympiad, she needed no such assistance.     Henie won the first of an unprecedented ten consecutive World Figure Skating Championships in 1927 at the age of fourteen. The results of 1927 World Championships, where Henie won in 3–2 decision over the defending Olympic and World Champion ": null
    },
    {
        "Herma Szabo": "herma szabo"
    },
    {
        " of ": null
    },
    {
        "Austria": "austria"
    },
    {
        ", was controversial, as three of the five judges that gave Henie first-place ordinals were Norwegian while Szabo received first-place ordinals from an Austrian and a German Judge . Henie went on to win first of her three ": null
    },
    {
        "Olympic": "olympic games"
    },
    {
        " gold medals the following year, became one of the ": null
    },
    {
        "youngest": "list of olympic medalists in figure skating by ageyoungest champions"
    },
    {
        " figure skating Olympic champions. She defended her Olympic titles in 1932 and in 1936, and her world titles annually until 1936. She also won six consecutive European championships from 1931 to 1936. Henies unprecedented three Olympic gold medals havent been matched by any ladies single skater since; neither are her achievements as ten-time consecutive World Champion. While ": null
    },
    {
        "Irina Slutskaya": "irina slutskaya"
    },
    {
        " of Russia won her seventh European Championship in 2006 to become the most successful ladies skater in European Championships, Henie retains record of most consecutive titles, sharing it with ": null
    },
    {
        "Katarina Witt": "katarina witt"
    },
    {
        " of ": null
    },
    {
        "Eastern Germany": "eastern germany"
    },
    {
        "/": null
    },
    {
        "Germany": "germany"
    },
    {
        " .     Towards the end of her career, she began to be strongly challenged by younger skaters including ": null
    },
    {
        "Cecilia Colledge": "cecilia colledge"
    },
    {
        ", ": null
    },
    {
        "Megan Taylor": "megan taylor"
    },
    {
        ", and ": null
    },
    {
        "Hedy Stenuf": "hedy stenuf"
    },
    {
        ". However, she held off these competitors and went on to win her third Olympic title at the ": null
    },
    {
        "1936 Winter Olympics": "1936 winter olympics"
    },
    {
        ", albeit in very controversial circumstances with Cecilia Colledge finishing a very close second. Indeed, after the school figures section at the 1936 Olympic competition, Colledge and Henie were virtually neck and neck with Colledge trailing by just a few points. As Sandra Stevenson recounted in her article in  The Independent  of 21 April 2008, the closeness infuriated Henie, who, when the result for that section was posted on a wall in the competitors lounge, swiped the piece of paper and tore it into little pieces. The draw for the free skating came under suspicion after Henie landed the plum position of skating last, while Colledge had to perform second of the 26 competitors. The early start was seen as a disadvantage, with the audience not yet whipped into a clapping frenzy and the judges known to become freer with their higher marks as the event proceeded. Years later, a fairer, staggered draw was adopted to counteract this situation .     During her competitive career, Henie traveled widely and worked with a variety of foreign coaches. At home in Oslo, she trained at ": null
    },
    {
        "Frogner Stadium": "frogner"
    },
    {
        ", where her coaches included Hjørdis Olsen and Oscar Holte. During the latter part of her competitive career she was coached primarily by the American Howard Nicholson in ": null
    },
    {
        "London": "london"
    },
    {
        ". In addition to traveling to train and compete, she was much in demand as a performer at figure skating exhibitions in both Europe and North America. Henie became so popular with the public that police had to be called out for crowd control on her appearances in various disparate cities such as ": null
    },
    {
        "Prague": "prague"
    },
    {
        " and ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ". It was an open secret that, in spite of the strict ": null
    },
    {
        "amateurism": "amateur sports"
    },
    {
        " requirements of the time, Wilhelm Henie demanded expense money for his daughters skating appearances. Both of Henies parents had given up their own pursuits in Norway—leaving Leif to run the fur business—in order to accompany Sonja on her travels and act as her managers.     Henie is credited with being the first figure skater to adopt the short skirt costume in figure skating, wear white boots,  and make use of dance ": null
    },
    {
        "choreography": "choreography"
    },
    {
        ". Her innovative skating techniques and glamorous demeanor transformed the sport permanently and confirmed its acceptance as a legitimate sport in the Winter Olympics.               After the 1936 ": null
    },
    {
        "World Figure Skating Championships": "world figure skating championships"
    },
    {
        ", Henie gave up her amateur status and took up a career as a professional performer in acting and live shows. While still a girl, Henie had decided that she wanted to move to ": null
    },
    {
        "California": "california"
    },
    {
        " and become a movie star when her competitive days were over, without considering that her thick accent might hinder her acting ambitions.     In 1936, following a successful ice show in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        " orchestrated by her father to launch her film career, Hollywood studio chief ": null
    },
    {
        "Darryl Zanuck": "darryl zanuck"
    },
    {
        " signed her to a long term contract at ": null
    },
    {
        "Twentieth Century Fox": "twentieth century fox"
    },
    {
        ", which made her one of the highest-paid actresses of the time. After the success of her first film,  One in a Million  , Henies position was assured and she became increasingly demanding in her business dealings with Zanuck. Henie also insisted on having total control of the skating numbers in her films such as  Second Fiddle  .     Henie tried to break the musical comedy mould with the anti-Nazi film  Everything Happens at Night  and  Its a Pleasure  , a skating variation of the often-told  A Star Is Born  tale about alcoholic-star-in-decline-helps-newcomer-up. It was her only film shot in ": null
    },
    {
        "Technicolor": "technicolor"
    },
    {
        ", but it was not as huge at the box office as her other films and also proved her limitations as a dramatic actress in her one only dramatic film.     When Zanuck realized her limits in the pseudo-dramatic vein, he cast her in more musical comedies;  Sun Valley Serenade  with ": null
    },
    {
        "Glenn Miller": "glenn miller"
    },
    {
        ", ": null
    },
    {
        "John Payne": "john payne"
    },
    {
        ", ": null
    },
    {
        "The Nicholas Brothers": "the nicholas brothers"
    },
    {
        ", and hit songs such as ": null
    },
    {
        "In the Mood": "in the mood"
    },
    {
        " , ": null
    },
    {
        "Chattanooga Choo Choo": "chattanooga choo choo"
    },
    {
        " , ": null
    },
    {
        "It Happened in Sun Valley": "it happened in sun valley"
    },
    {
        " , and ": null
    },
    {
        "I Know Why ": "i know why"
    },
    {
        " , followed by  Iceland  with ": null
    },
    {
        "Jack Oakie": "jack oakie"
    },
    {
        ", Payne, and the hit song ": null
    },
    {
        "There Will Never Be Another You": "there will never be another you"
    },
    {
        " , and finally  Wintertime  with ": null
    },
    {
        "Cesar Romero": "cesar romero"
    },
    {
        ", ": null
    },
    {
        "Carole Landis": "carole landis"
    },
    {
        ", ": null
    },
    {
        "Cornel Wilde": "cornel wilde"
    },
    {
        ", and Oakie. Sonja had by now developed a comedy flair and these films were all among the top box-office hits for ": null
    },
    {
        "20th Century-Fox": "20th century-fox"
    },
    {
        " the respective years.     In addition to her film career at Fox from 1936 to 1943, Henie formed a business arrangement with ": null
    },
    {
        "Arthur Wirtz": "arthur wirtz"
    },
    {
        ", who produced her touring ice shows under the name of Hollywood Ice Revue . Wirtz also acted as Henies financial advisor. At the time, figure skating and ice shows were not yet an established form of entertainment in the United States. Henies popularity as a film actress attracted many new fans and instituted skating shows as a popular new entertainment. Throughout the 1940s, Henie and Wirtz produced lavish musical ice skating extravaganzas at ": null
    },
    {
        "Rockefeller Centers": "rockefeller center"
    },
    {
        " Center Theatre": "center theatre"
    },
    {
        " attracting millions of ticket buyers.     At the height of her fame, Henie brought as much as $2 million per year from her shows and touring activities. She also had numerous lucrative endorsement contracts, and deals to market skates, clothing, jewelry, dolls, and other merchandise branded with her name. These activities made her one of the wealthiest women in the world in her time.      Henie broke off her arrangement with Wirtz in 1950 and for the next three seasons produced her own tours under the name Sonja Henie Ice Revue . It was an ill-advised decision to set herself up in competition with Wirtz, whose shows now featured the new Olympic champion ": null
    },
    {
        "Barbara Ann Scott": "barbara ann scott"
    },
    {
        ". Since Wirtz controlled the best arenas and dates, Henie was left playing smaller venues and markets already saturated by other touring ice shows such as ": null
    },
    {
        "Ice Capades": "ice capades"
    },
    {
        ". The collapse of a section of bleachers during a show in ": null
    },
    {
        "Baltimore, Maryland": "baltimore, maryland"
    },
    {
        ", in 1952 compounded the tours legal and financial woes.     In 1953, Henie formed a new partnership with ": null
    },
    {
        "Morris Chalfen": "morris chalfen"
    },
    {
        " to appear in his European  Holiday On Ice  tour, which proved to be a great success. She produced her own show at New Yorks ": null
    },
    {
        "Roxy Theatre": "roxy theatre"
    },
    {
        " in January 1956. Bosley Crowther, . The New York Times, 12 January 1956. However, a subsequent South American tour in 1956 was a disaster. Henie was drinking heavily at that time and could no longer keep up with the demands of touring, and this marked her retirement from skating. She did try to make a film series at her own expense; a series that would serve as a travelogue to several cities. Paris and London were mentioned, but only  Hello London  was made with her own backing, co-starring ": null
    },
    {
        "Michael Wilding": "michael wilding"
    },
    {
        " and special guest star ": null
    },
    {
        "Stanley Holloway": "stanley holloway"
    },
    {
        ". While her ice show numbers were still worth watching, the film received few distributors and poor reviews, ending her film career.     Her autobiography Mitt livs eventyr, was published in 1938 which was translated and released as Wings on My Feet in 1940, and which was republished in a revised edition in 1954. At the time of her death, Henie was planning a comeback for a television special that would have aired in January 1970. She was to have danced to ": null
    },
    {
        "Laras Theme": "laras theme"
    },
    {
        " from  Doctor Zhivago .          Henies connections with ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " and other high-ranking ": null
    },
    {
        "Nazi": "nazi"
    },
    {
        " officials made her the subject of controversy before, during, and after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". During her amateur skating career, she performed often in ": null
    },
    {
        "Germany": "germany"
    },
    {
        " and was a favorite of German audiences and of Hitler personally. As a wealthy celebrity, she moved in the same social circles as royalty and heads of state and made Hitlers acquaintance as a matter of course. During the shooting of  Second Fiddle  , she greeted the then Crown-Prince couple of Norway ": null
    },
    {
        "Olav": "olav v of norway"
    },
    {
        " and ": null
    },
    {
        "Märtha": "princess märtha of sweden"
    },
    {
        " during their US tour. Through the years, her shows and later art exhibitions drew the attention of such people as ": null
    },
    {
        "Princess Margaret, Countess of Snowdon": "princess margaret, countess of snowdon"
    },
    {
        " and ": null
    },
    {
        "Gustaf VI Adolf of Sweden": "gustaf vi adolf of sweden"
    },
    {
        " and she met with them.      Controversy appeared first when Henie greeted Hitler with a ": null
    },
    {
        "Nazi salute": "nazi salute"
    },
    {
        " at the 1936 Winter Olympics in ": null
    },
    {
        "Garmisch-Partenkirchen": "garmisch-partenkirchen"
    },
    {
        " and after the Games she accepted an invitation to lunch with Hitler at his resort home in nearby ": null
    },
    {
        "Berchtesgaden": "berchtesgaden"
    },
    {
        ", where Hitler presented Henie with an autographed photo with a lengthy inscription. She was strongly denounced in the Norwegian press for this. In her revised 1954 biography, Page 39 she states that no Norwegian judge was in the panel for the 1936 Olympics – as she was entitled to as a Norwegian. She therefore made the most of it and she won her third Olympic medal. When she – as a gold medal winner – passed Hitlers tribune with silver medalist ": null
    },
    {
        "Cecilia Colledge": "cecilia colledge"
    },
    {
        " and bronze medalist ": null
    },
    {
        "Vivi-Anne Hultén": "vivi-anne hultén"
    },
    {
        ", neither she or the others honored Hitler with the Nazi salute. The ": null
    },
    {
        "1936 European Figure Skating Championships": "1936 european figure skating championships"
    },
    {
        " also took place in Berlin and neither Sonja, Colledge, nor ": null
    },
    {
        "Megan Taylor": "megan taylor"
    },
    {
        " paid obeisance to Hitler.     In her film  Everything Happens at Night  , ": null
    },
    {
        "Ray Milland": "ray milland"
    },
    {
        " and ": null
    },
    {
        "Robert Cummings": "robert cummings"
    },
    {
        " star as rival reporters hot on the trail of Dr. Hugo Norden . Norden, a Nobel Prize winner, was supposedly murdered by the Gestapo, but is rumored to be in hiding and writing anonymous dispatches advocating world peace. When Geoffrey and Ken track Dr. Norden to a small village in the Swiss Alps, they soon find themselves competing over the affections of beautiful Louise , who has a deeper connection to the missing Nobel laureate than the reporters realize. When Geoffrey and Ken get so distracted by romance that they begin to neglect their assignments, it almost leads to disaster as the Gestapo sets out to silence Dr. Norden once and for all. Released on 22 December 1939, it was banned in Nazi Germany.     Through her 1940 marriage to ": null
    },
    {
        "Dan Topping": "dan topping"
    },
    {
        " she had become an American citizen. As such, she was not eligible to speak Norways cause and with producer ": null
    },
    {
        "Alexander Korda": "alexander korda"
    },
    {
        ", who was set to produce the propaganda film ": null
    },
    {
        "That Hamilton Woman": "that hamilton woman"
    },
    {
        ", could have faced deportation. The Senate Subcommittee dealt with such matters. After the ": null
    },
    {
        "bombing of Pearl Harbor": "attack on pearl harbor"
    },
    {
        ", when America was no longer neutral, Henie pulled in uniform and visited and gave money to ": null
    },
    {
        "Little Norway": "little norway"
    },
    {
        ". All Norwegians got free tickets to her shows during the war and she paid and held parties for them.     During the ": null
    },
    {
        "occupation of Norway by Nazi Germany": "occupation of norway by nazi germany"
    },
    {
        ", German troops saw Hitlers autographed photo prominently displayed at the piano in the Henie family home in ": null
    },
    {
        "Landøya": "landøya"
    },
    {
        ", ": null
    },
    {
        "Asker": "asker"
    },
    {
        ".  As a result, none of Henies properties in Norway were confiscated or damaged by the Germans. Henie became a ": null
    },
    {
        "naturalized citizen": "naturalized citizen"
    },
    {
        " of the ": null
    },
    {
        "United States": "united states"
    },
    {
        " in 1940. Like many Hollywood stars, she supported the U.S. war effort through ": null
    },
    {
        "USO": "uso"
    },
    {
        " and similar activities. After the Japanese attack, she invited the boys from ": null
    },
    {
        "Little Norway": "little norway"
    },
    {
        " to her iceshows, gave the mechanics a plane as well a substantial sum of money to their educational fund. But her first rejection before the US entered the war was never to be forgotten. For this, she was condemned by many Norwegians and Norwegian-Americans. After the war, Henie was mindful that many of her countrymen considered her to be a ": null
    },
    {
        "quisling": "quisling"
    },
    {
        ". However, she made a triumphant return to Norway with the ": null
    },
    {
        "Holiday on Ice": "holiday on ice"
    },
    {
        " tour in 1953 and 1955. The ": null
    },
    {
        "Norwegian Royal Family": "norwegian royal family"
    },
    {
        " attended both events and indeed attended her funeral in 1969. The Royal Family were very mindful of whom they supported after the war and Norwegians looked to them as role models in that respect. Her complex reputation and legacy continues to stimulate debate amongst Norwegians, writers and historians.            Henie was married three times, to ": null
    },
    {
        "Dan Topping": "dan topping"
    },
    {
        " , Winthrop Gardiner Jr. ,   The New York Times. 18 October 1980. and the Norwegian shipping magnate and art patron ": null
    },
    {
        "Niels Onstad": "niels onstad"
    },
    {
        " . After her retirement in 1956, Henie and Onstad settled in Oslo and accumulated a large collection of modern art that formed the basis for the ": null
    },
    {
        "Henie Onstad Kunstsenter": "henie-onstad art centre"
    },
    {
        " at ": null
    },
    {
        "Høvikodden": "høvikodden"
    },
    {
        " in ": null
    },
    {
        "Bærum": "bærum"
    },
    {
        " near ": null
    },
    {
        "Oslo": "oslo"
    },
    {
        ".       Henie was diagnosed with ": null
    },
    {
        "chronic lymphocytic leukemia": "chronic lymphocytic leukemia"
    },
    {
        " in the mid-1960s.  & pgPA197 & lpgPA197 & dqchronic+lymphocytic+leukemia+sonja+henie & sourcebl & ots2myHkteSYW & sigACfU3U0I3l2XCFWi2m4CqflJgKeoWFa8hA & hlen & saX & ved2ahUKEwjFyvuOjJHlAhUl01kKHUXnBmMQ6AEwFXoECAwQAQvonepage & qchronic%20lymphocytic%20leukemia%20sonja%20henie & ffalse She died of the disease at age 57 in 1969 during a flight from ": null
    },
    {
        "Paris": "paris"
    },
    {
        " to ": null
    },
    {
        "Oslo": "oslo"
    },
    {
        ".   The New York Times. 13 October 1969. Generally regarded as one of the greatest figure skaters in history, she is buried with Onstad in Oslo on the hilltop overlooking the ": null
    },
    {
        "Henie Onstad Art Centre": "henie onstad kunstsenter"
    },
    {
        ".                        ": null
    },
    {
        "World Figure Skating Hall of Fame": "world figure skating hall of fame"
    },
    {
        " .  . worldskatingmuseum.org   Inducted into the International Womens Sports Hall of Fame .  . womenssportsfoundation.org   She has a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        ".   In 1938, at age 25, she became the youngest person made a knight first class of ": null
    },
    {
        "The Royal Norwegian Order of St. Olav": "the royal norwegian order of st. olav"
    },
    {
        "         Boeing 737-300": "boeing 737-300"
    },
    {
        " of the airline ": null
    },
    {
        "Norwegian Air Shuttle": "norwegian air shuttle"
    },
    {
        ". As the Boeing 737–300 was being phased out, her picture was placed on the tail of a ": null
    },
    {
        "Boeing 737-800": "boeing 737-800"
    },
    {
        " of the same airline . airliners.net and in 2013 to the tail of Norwegian Air Shuttles first ": null
    },
    {
        "Boeing 787 Dreamliner": "boeing 787 dreamliner"
    },
    {
        ".  . Planepictures.net. Retrieved on 19 August 2015. One of the airlines trademarks is having portraits of famous deceased ": null
    },
    {
        "Norwegians": "norwegians"
    },
    {
        " on the tails of its aircraft.    In 2012, the ": null
    },
    {
        "Posten Norge": "posten norge"
    },
    {
        " issued two stamps featuring Sonja Henie.  . posten.no. Retrieved on 19 August 2015.       In the ‘’": null
    },
    {
        "Donald Duck": "donald duck"
    },
    {
        "’’ cartoon “The Hockey Champ”, he briefly makes himself look like Sonja Henie while skating on the ice saying “Who is this Sonja Henie?”.   In the  MASH  episode Baby, Its Cold Outside , the weekly movie features Sonja. Col. Potter admits to Hawkeye that he loved Sonja from the first time he saw her, and that he really fell for her , then smacks his own butt three times as he adds AGAIN and AGAIN and AGAIN! .   In  Caddyshack , when asked to pick a substitute for ": null
    },
    {
        "Rodney Dangerfields": "rodney dangerfield"
    },
    {
        "character, ": null
    },
    {
        "Chevy Chase": "chevy chase"
    },
    {
        " as Ty Webb exclaims, Sonja Henies out.       ": null
    }
]