[
    {
        "   The Sonoma County Crushers were a ": null
    },
    {
        "minor league baseball": "minor league baseball"
    },
    {
        " team located in ": null
    },
    {
        "Rohnert Park, California": "rohnert park, california"
    },
    {
        ". They were a member of the independent ": null
    },
    {
        "Western Baseball League": "western baseball league"
    },
    {
        ", and were not affiliated with any ": null
    },
    {
        "Major League Baseball": "major league baseball"
    },
    {
        " team.     The team mascot was Crusher with his large purple feet for ": null
    },
    {
        "stomping grapes": "stomping grapes"
    },
    {
        ". The team played in the wine country to which the region is famous. Crusher was a large furry animal and referred to as the Abominable Sonoman. The Ballard family participated in team activities, and Joel, now in the USMC, was a marvelous Crusher. Chris Kirby Anderson substituted as Crusher on occasion. Now, he works with top secret stuff at Lawrence Livermore. Local fans loved the games not only for the baseball, but because there were lively contests during the inning breaks making the games a fun family experience.     The team was one of the founding members of the league, beginning play in 42 They won their first and only league championship in 42 The team folded with the league after the 42 season. The Crushers were the only team in the WBL that remained in constant operation through the leagues eight years. At one point, former ": null
    },
    {
        "San Francisco Giants": "san francisco giants"
    },
    {
        " outfielder": "outfielder"
    },
    {
        " Kevin Mitchell": "kevin mitchell"
    },
    {
        " managed the Crushers.     The team played in ": null
    },
    {
        "Rohnert Park Stadium": "rohnert park stadium"
    },
    {
        ", which was built in 42 for the ": null
    },
    {
        "California League": "california league"
    },
    {
        "s now-defunct ": null
    },
    {
        "Redwood Pioneers": "redwood pioneers"
    },
    {
        ". The teams mascot was Crusher, the Abominable Sonoman.     The team produced one notable professional baseball player in ": null
    },
    {
        "Chad Zerbe": "chad zerbe"
    },
    {
        " who pitched for the San Francisco Giants from 4242 including Three appearances in the ": null
    },
    {
        "42 World Series": "2002 world series"
    },
    {
        " against the Anaheim Angels. He was credited with a win in Game 42                     ": null
    }
]