[
    {
        "         The Sontarans  ; are a ": null
    },
    {
        "fiction": "Fiction"
    },
    {
        "al race of ": null
    },
    {
        "extraterrestrial": "Extraterrestrial Life"
    },
    {
        " humanoids created by ": null
    },
    {
        "Robert Holmes": "Robert Holmes"
    },
    {
        " for the British ": null
    },
    {
        "science fiction television": "Science Fiction Television"
    },
    {
        " series  Doctor Who , also seen in ": null
    },
    {
        "spin-off": "Spin-Off"
    },
    {
        " series  The Sarah Jane Adventures . They are a warrior race characterised by their ruthlessness and fearlessness of death.              During rehearsals for their first appearance, ": null
    },
    {
        "Kevin Lindsay": "Kevin Lindsay"
    },
    {
        ", who portrayed the original Sontaran, Linx, pronounced the races name as son-TAR-an. Alan Bromly, the director, tried to correct him by saying it should be pronounced with the stress on the first syllable. Lindsay declared Well, I think its  son-TAR-an , and since Im from the place, I should know. His preferred pronunciation was retained.     The Sontarans made their first appearance in 1973 in the serial  The Time Warrior  by Robert Holmes, where Linx is stranded in the Middle Ages. Linx uses a projector to bring back human scientists from the future to fix his spacecraft.     Another Sontaran named Styre appears in  The Sontaran Experiment  , experimenting on captured astronauts on a far future Earth. Their third appearance is in  The Invasion of Time , where they successfully invade ": null
    },
    {
        "Gallifrey": "Gallifrey"
    },
    {
        ", but are driven out again after less than a day. They appeared for the final time in the original series in  The Two Doctors . The Sontarans also appeared in a skit for the BBC childrens programme  Jimll Fix It  titled ": null
    },
    {
        "A Fix with Sontarans": "A Fix With Sontarans"
    },
    {
        " , along with ": null
    },
    {
        "Colin Baker": "Colin Baker"
    },
    {
        " as the ": null
    },
    {
        "Sixth Doctor": "Sixth Doctor"
    },
    {
        " and ": null
    },
    {
        "Janet Fielding": "Janet Fielding"
    },
    {
        " as ": null
    },
    {
        "Tegan Jovanka": "Tegan Jovanka"
    }
]