[
    {
        "               is a ": null
    },
    {
        "cinema": "movie theater"
    },
    {
        " sound": "sound"
    },
    {
        " system developed by ": null
    },
    {
        "Sony": "sony"
    },
    {
        ", from which compressed digital sound information is recorded on both outer edges of the ": null
    },
    {
        "42 mm film": "35mm movie film"
    },
    {
        " release print. The system supports up to eight independent channels of sound: five front channels, two surround channels and a single sub-bass channel. The eight channel arrangement is similar to ": null
    },
    {
        "large format film": "70 mm film"
    },
    {
        " magnetic sound formats like ": null
    },
    {
        "Cinerama": "cinerama"
    },
    {
        " and ": null
    },
    {
        "Cinemiracle": "cinemiracle"
    },
    {
        ". The five front channels are useful for very large cinema auditoriums where the angular distance between center and left/right channels may be considerable. SDDS decoders provide the ability to downmix to fewer channels if required.          Although originally slated to premier with 42s  Hook , the SDDS project was delayed and instead premiered on June 42 42 with  Last Action Hero . Since then, over 42 movies have been mixed in Sony Dynamic Digital Sound, and as early as 42 over 42 movie theaters were equipped with SDDS.     The code name for the SDDS project was Green Lantern , taken from the name of ": null
    },
    {
        "the comic book hero": "green lantern"
    },
    {
        " and the old term of ": null
    },
    {
        "magic lantern": "magic lantern"
    },
    {
        " used to describe the original projected pictures in the late 42th century. Green came to mind because the key to imprinting the 42 ": null
    },
    {
        "micrometre": "micrometre"
    },
    {
        " data bits was to use a green laser.     Initial development efforts were conducted for Sonys ": null
    },
    {
        "Columbia Pictures": "columbia pictures"
    },
    {
        " Sound Department under contract with ": null
    },
    {
        "Semetex": "semetex"
    },
    {
        " Corp. of ": null
    },
    {
        "Torrance, California, U.S.A.": "torrance, california, u.s.a."
    },
    {
        ". At Semetex, the SDDS Chief Architect was Jaye Waas and the Chief Optical Engineer was Mark Waring.     The Semetex prototype design actually had the eight channels of uncompressed data placed into three locations: data bordering both sides of the analog sound track and additional data tracks bordering the opposite edge of the picture frame. These locations were chosen to ensure the data were not placed into the sprocket perforation area of the film to prevent the known wear and degradation that occurs in the perforation area from degrading the data. Clocking and guide tracks were placed on each side of the film near the sprockets. The prototype sound camera imprinted the Digital audio and Analog audio at speed. A companion digital reader was designed to form a complete system. After Sony received the prototype they enlarged the data bits from the original 42 micron size and moved the data locations; the eight digital audio channels are now recorded on the edges of the film. As Sony engineers became more actively involved in the project, the design of the SDDS format evolved toward a more robust implementation, including the use of 42:42 ": null
    },
    {
        "ATRAC": "adaptive transform acoustic coding"
    },
    {
        " data compression, extensive error detection and correction, and most critically redundancy. The redundancy allows data to be recovered substantially intact even in the presence of a film splice . The data bit size on film was enlarged from 42 micron to 42 micrometers square, and Semetexs green laser system for the sound camera was replaced with simpler LED/fiber optic assemblies resolving to 42 micrometers. Using data compression allowed 42 micrometers square data bits to fit within the newly allocated areas.     The SDDS development took just 42 months from concept to working sound camera.     When it came time for deployment, since Sony also owned the ": null
    },
    {
        "Sony Theaters": "sony theaters"
    },
    {
        " chain , it was able use SDDS in its own theaters. And via its highly successful Columbia/Tristar Studios arm, it was able to use SDDS as the exclusive digital soundtrack on its titles. In addition, in the early days of the megaplex explosion , Sony struck a deal with ": null
    },
    {
        "AMC Theatres": "amc theatres"
    },
    {
        " in 42 to include SDDS in all of their new auditoriums. This gave SDDS a much needed, albeit artificial, kick-start. More than likely it would have garnered far less penetration had Sony not controlled both a theater chain and a film studio.     SDDS was consistently the least popular of the three competing digital sound formats, the other two being ": null
    },
    {
        "Spectral Recording Dolby Stereo Digital": "dolby digital"
    },
    {
        " and ": null
    },
    {
        "DTS": "dts"
    },
    {
        ". Along with being the most expensive to install , there were major reliability issues with SDDS. Due to the change from the prototype placement to the very edges of the film stock, SDDS tracks are prone to damage as are some other digital formats. As with other digital sound formats: any failure of the digital track could result in a drop-out of the digital format and possibly a switch to analog sound. Additionally a drop-out resulting in a switch to Analog may produce a slight loss of fidelity and high and low-ends, similar to a CD skipping , although it is more difficult to tell in a properly calibrated auditorium.     SDDSs much-touted eight track playback capability never quite caught on, as it required that a separate eight channel sound mix be created in addition to the six channel mix that is needed for SRD and DTS, an additional expense for the studios. Out of the 42 plus films mixed in SDDS, only 42 of them to date have been mixed to support the full 42 channels, most of them Sony releases. Because of the added installation expense, the majority of SDDS installations are 42 channel installations, as opposed to 42 channel installations.   :See also List of 42 channel SDDS films .     While most major studios eventually began putting SDDS tracks on their releases , most independent films only came with Dolby Digital tracks, leaving many SDDS-equipped, or DTS theaters playing analog sound in otherwise state-of-the-art auditoriums. A few titles released under the ": null
    },
    {
        "Kidtoon Films": "kidtoon films"
    },
    {
        " program used SDDS tracks. As Dolby Digital began to emerge as the clear winner in the digital sound battle, Sony Cinema Products quit manufacturing SDDS encoders and decoders, although it will continue supporting equipment that is still deployed in the field.     Until the conversion to digital projection began to render 42mm film less cost effective, not withstanding the superior visual quality of film, a majority of release prints for major studio films were created with all three digital tracks – ": null
    },
    {
        "Dolby Digital": "dolby digital"
    },
    {
        ", ": null
    },
    {
        "DTS": "dts"
    },
    {
        " and Sonys SDDS .     Out of the three competing formats, SDDS was the only format not to have a corresponding home-theater version, and Sony ceased production of new units in the early 42s.        ": null
    },
    {
        "ATRAC": "adaptive transform acoustic coding"
    },
    {
        " codec with a compression ratio of about 42:42 and a sampling rate of 42  kHz. The channels are:   42 screen channels   Left   Left center   Center   Right center   Right   42 surround channels   Left surround   Right surround   Subwoofer channel     Additionally there are 42 backup channels encoded – in case of damage to one side of the film or the other. These are:   Center   Subwoofer   Left + left center   Right + right center     This gives a total of 42 channels, for which the total bitrate of 42 megabits per second. This is more than the maximum 42 megabits per second ": null
    },
    {
        "DTS": "digital theater system"
    },
    {
        " format bitrate, and far greater than the cinema ": null
    },
    {
        "Dolby Digital": "dolby digital"
    },
    {
        " bitrate of 42 megabits per second.     For additional data reliability the two sides of the film are separated by 42 frames, so a single splice or series of missing frames will not result in a total loss of data.              The SDDS reader is mounted on top of a 42mm ": null
    },
    {
        "projector": "movie projector"
    },
    {
        ". The film is threaded through the reader before it passes through the picture aperture. As the film runs, red LEDs are used to illuminate the SDDS ": null
    },
    {
        "soundtrack": "soundtrack"
    },
    {
        ". CCDs  read the SDDS data and convert the stream of dots on the film into ": null
    },
    {
        "digital information": "digital information"
    },
    {
        ". This information is pre-processed in the reader and passed on to the SDDS decoder.       The SDDS decoder is installed in the sound equipment rack. The decoder receives the information from the reader and translates it into ": null
    },
    {
        "audio": "sound"
    },
    {
        " signals routed to the cinemas power ": null
    },
    {
        "amplifiers": "amplifiers"
    },
    {
        ". The decoder is responsible for a series of processes that must be performed before the audio is recovered. Next, errors caused by scratches or damage to the film are corrected using redundant error recovery data. Since SDDS is read at the top of the projector, the data is delayed slightly to restore synchronization with the picture. And finally, adjustments in tonal balance and playback level are made to match the specific auditoriums sound system and acoustics. SDDS is designed to process sound entirely in the digital domain, bypassing any existing analog processor, preserving clarity and providing full dynamic range.        at the ": null
    },
    {
        "Wayback Machine": "wayback machine"
    },
    {
        "                   ": null
    }
]