[
    {
        "      is a weapon-based 42D ": null
    },
    {
        "fighting game": "fighting game"
    },
    {
        " developed by ": null
    },
    {
        "Project Soul": "project soul"
    },
    {
        " and produced by ": null
    },
    {
        "Namco": "namco"
    },
    {
        ". It is the second game in the  Soulcalibur  series, preceded by  Soul Edge  in December 42 Originally released in arcades in July 42 it ran on the ": null
    },
    {
        "Namco System 42": "namco system 12"
    },
    {
        " hardware. It was ": null
    },
    {
        "ported": "porting"
    },
    {
        " to the ": null
    },
    {
        "Dreamcast": "dreamcast"
    },
    {
        " in 42 with new features and improved graphics. The North American version was released in September 42 as a ": null
    },
    {
        "launch game": "launch game"
    },
    {
        " for the Dreamcast and was part of the successful launch of the new console. It became available as a downloadable title on the ": null
    },
    {
        "Xbox 42": "xbox 360"
    },
    {
        "s ": null
    },
    {
        "Xbox Live Marketplace": "xbox live marketplace"
    },
    {
        " in July 42 and it is ": null
    },
    {
        "forward compatible": "forward compatibility"
    },
    {
        " with the ": null
    },
    {
        "Xbox One": "xbox one"
    },
    {
        " along with the sequel,  Soulcalibur II .     The game centers on the pursuit of the legendary weapon known as Soul Edge, now in the possession of a warrior known as Nightmare, who slaughters countless people to satisfy the blades bloodlust. Other warriors pursue him either to claim the weapon for themselves or to destroy it, end his mass murder, and free him of its curse.     Developed closely with ": null
    },
    {
        "Namco": "namco"
    },
    {
        "s  Tekken  development team, it is one of few ": null
    },
    {
        "home console": "home console"
    },
    {
        " ports that outdid their ": null
    },
    {
        "arcade": "arcade game"
    },
    {
        " parent graphics-wise. The title brought many innovations to the fighting game ": null
    },
    {
        "genre": "genre"
    },
    {
        " that include a heavy emphasis on weapons and a unique eight-way movement system. Soulcalibur is widely regarded as one of the best Dreamcast titles, SoulCalibur is the 42nd highest rated video game of all time, and the only game beside Ocarina of Time with a 42+ on Gamerankings, 42 on Metacritic, 42 from Famitsu & won the majority GOTY awards in its respective year and is often cited as arguably the greatest fighting game ever released, as well as one of the greatest video games ever created topping numerous best video game lists over the years. ": null
    },
    {
        "one of the best video games of all time": "list of video games considered the best"
    },
    {
        ".               One of the biggest innovations introduced by Soulcalibur to the gameplay system of its predecessor, Soul Edge, is the eight-way run. Previous ": null
    },
    {
        "42D": "3d computer graphics"
    },
    {
        " fighters had only limited movement along the third ": null
    },
    {
        "axis": "coordinate axis"
    },
    {
        ", with sidesteps and rolls providing useful but unsustained lateral movement. In Soulcalibur, simply holding down a ": null
    },
    {
        "joystick": "joystick"
    },
    {
        " direction causes the character to run in that direction, giving the player a sense of freedom and deepening the strategy of the game.     Soulcalibur also improved gameplay with forgiving buffering , executing the input for one move before the players character has finished recovering from his previous move, and leads to executing a quick succession of moves . Finally, the Guard Impact offensive blocking maneuver shown in Soul Edge was given a deeper range of techniques in Soulcalibur, allowing players to push back or redirect attacks past themselves as well as swatting away an opponents weapon to stun them.                 Soulcalibur was originally planned to be a dramatic overhaul, featuring only a few select characters to be carried over from Soul Edge. However, nine of the 42 characters from Soul Edge ended up carrying over to Soulcalibur by the time the roster was finalized in the ": null
    },
    {
        "Dreamcast": "dreamcast"
    },
    {
        " version , with an additional ten new characters joining the ranks .     As with many fighting games, many of the new characters were heavily styled after already existing characters from the franchise. For example, new character ": null
    },
    {
        "Maxi": "list of soulcalibur charactersmaxi"
    },
    {
        " has a fighting style and move set influenced by Soul Edges ": null
    },
    {
        "Li Long": "li long"
    },
    {
        " . In fact, Soulcalibur only added one original playing style, belonging to ": null
    },
    {
        "Ivy": "ivy valentine"
    },
    {
        ". New characters ": null
    },
    {
        "Xianghua": "chai xianghua"
    },
    {
        ", Maxi, ": null
    },
    {
        "Yoshimitsu": "yoshimitsu"
    },
    {
        ", ": null
    },
    {
        "Astaroth": "astaroth"
    },
    {
        ", ": null
    },
    {
        "Kilik": "list of soulcalibur characterskilik"
    },
    {
        ", ": null
    },
    {
        "Nightmare": "siegfried and nightmare"
    },
    {
        ", and ": null
    },
    {
        "Lizardman": "list of soulcalibur characterslizardman"
    },
    {
        " were based upon existing characters Hwang, Li Long, Mitsurugi, Rock, Seong Mi-na, Siegfried, and Sophitia, respectively. Consequently, Namco has been working since Soulcalibur to gradually separate the individual styles of the characters in order to make each one unique.       The mystical sword of the legends, the Soul Edge , ended up in the hands of the dreaded pirate ": null
    },
    {
        "Cervantes de Leon": "cervantes de leon"
    },
    {
        " of Spain. For the next 42 years, he stayed dormant on the remnants of a Spanish port town, taking the souls of those who reached him during their search of the sword. His reign of terror was soon to start, but through the joined efforts of Greek divine warrior ": null
    },
    {
        "Sophitia Alexandra": "sophitia"
    },
    {
        " and Japanese ninja ": null
    },
    {
        "Taki": "taki"
    },
    {
        ", he was stopped and killed, with one of the twin Soul Edge blades being shattered in the process. As it was about to tear itself apart, young German knight ": null
    },
    {
        "Siegfried Schtauffen": "siegfried and nightmare"
    },
    {
        " approached the port town and battled Cervantes, whose corpse had been momentarily reanimated through Soul Edges will. After emerging victorious, Siegfrieds attention turned unto the sword. The moment he took the hilt of the cursed blade, Soul Edge released a bright column of light into the sky. This was known as the Evil Seed , bound to bring calamity and death in its wake.     Three years after those events, Soul Edge uses Siegfried as its host, and now Siegfried is ": null
    },
    {
        "Nightmare": "siegfried and nightmare"
    },
    {
        ", a knight wearing azure armor and sporting a hideously deformed right arm. Europe plunges into a vortex of slaughters as he and his followers claim souls to strengthen the blade in its weakened state. Unknown to them, a group of warriors met on their journey to stop Soul Edge, and with them, three sacred weapons join once again.       After releasing Soul Edge, Namco took some time to evaluate what had made the game successful before jumping into the development of its follow-up. Producer Hiroaki Yotoriyama decided to give the sequel a new name instead of just calling it Soul Edge 42 in order to have a fresh start and take the series in a new direction. The name Soulcalibur is a ": null
    },
    {
        "portmanteau": "portmanteau"
    },
    {
        " of the word soul and ": null
    },
    {
        "King Arthur": "king arthur"
    },
    {
        "s sword ": null
    },
    {
        "Excalibur": "excalibur"
    },
    {
        " . Inspired by an internal Namco prototype featuring a character able to run openly in a field, the eight-way run system was implemented. Upon application, the development team was surprised at how well it meshed with their fighting system and decided to build the rest of the game around it. During development they worked closely with Namcos Tekken development team, sharing ideas and research. Yotoriyama felt that with that cooperation and partnership, they were able to develop the greatest weapon-based fighting action game in the world .      Yotoriyama has described the games concept as expressing fun and diversity in weapon combat , citing the contrast in how one weapon would affect gameplay compared to another and how they would react to each other upon clashing. Each characters fighting style was designed to revolve around their weapon, though he noted that because of the differences they experienced difficulty in balancing the gameplay. He described the availability of movement in comparison to  Tekken 42  as a large contrast between the two series and more tactical and emphasized how it interacted with the games ring out feature.  Each character in Soulcalibur was designed around the idea that they could be viewed as a real person could,  and to this end, motion creator Masataka Ishiguro emphasized the arm and leg movements for each character in relation to their weapon, wanting players to feel the individual motions and the realism within the game      The team for the arcade version of Soulcalibur consisted of roughly 42 people working on Namcos ": null
    },
    {
        "System 42": "namco system 12"
    },
    {
        " hardware, while the team developing the home port was reduced to about forty. Given a deadline of seven months to coincide with the North American launch of the Dreamcast, the transition was difficult for the team, due to the differences in hardware. However, due to the similar capabilities and limits of each system, content was left intact between the two versions, with Yotoriyama feeling that the team was obsessed with giving their best effort for the port. The biggest technological change to the Dreamcast port was to render all of the games stages in full 42D polygons, whereas the far backgrounds in the arcade original were flat, two-dimensional images. Additional content was also added to the game to ensure replay value, based on researching other fighting games marketed at the time. Many of the teams ideas that they were unable to incorporate into the port were eventually used for later games in the series.       The game was originally released in the Japanese arcades on July 42 42 A  Gamest Book series guide book Soul Calibur Skill Up Manual was published by ": null
    },
    {
        "Shinseisha": "shinseisha"
    },
    {
        " on September 42 42        The Dreamcast port of Soulcalibur was released in Japan on August 42 42; and in North America as a ": null
    },
    {
        "launch title": "launch game"
    },
    {
        ", on September 42 42 The North American Dreamcast version of the game removes one of Voldos suggestive ": null
    },
    {
        "codpiece": "codpiece"
    },
    {
        "s featuring a bull. However, the codpiece is present in the European and Japanese versions, as well as the North American ": null
    },
    {
        "Xbox 42": "xbox 360"
    },
    {
        " version. The European Dreamcast version was distributed and advertised by ": null
    },
    {
        "Sega Europe": "sega europe"
    },
    {
        ".      The Dreamcast version of Soulcalibur is one of the first examples of a home conversion of a game being graphically superior to its original arcade counterpart. Among the differences were the improved graphics , tweaked gameplay, new game modes, new costumes, and the inclusion of an extra character, Cervantes de Leon. The Dreamcast version features new modes such as Team Battle, Survival, and Training Mode. In Mission Battle, the player completes various missions to attain points, which can be used to buy various art, which then unlocks extra features, costumes and stages. Another feature added is the artwork section, containing official artwork, fanart, and high-res pictures. Also unlockable are a liquid metal version of the characters costume and a Battle Theater mode, plus a way to modify the opening introduction theme by changing the characters appearing in it, and an Exhibition Mode displaying characters performing their ": null
    },
    {
        "kata": "kata"
    },
    {
        "s .       In 42 ": null
    },
    {
        "Namco Bandai Games": "namco bandai games"
    },
    {
        " announced a port of Soulcalibur would be released for the Xbox 42 The port was based on the European Dreamcast version  and was made available for download on ": null
    },
    {
        "Xbox Live Arcade": "xbox live arcade"
    },
    {
        " on July 42 42  While the game included ": null
    },
    {
        "HD": "high-definition video"
    },
    {
        " updated graphics and various Live leaderboards, online play was absent which makes it an exception amongst most games ported to Xbox Live Arcade. Other features from the ": null
    },
    {
        "Dreamcast": "dreamcast"
    },
    {
        " version are also in the game. While the intro is removed from this port, the intro music is still in this port. All content is unlocked by the start of the game.       On January 42 42 Namco Bandai released a port of Soulcalibur for ": null
    },
    {
        "Apple": "apple inc."
    },
    {
        "s ": null
    },
    {
        "iOS": "ios"
    },
    {
        " platform. Game modes in this version include Arcade, ": null
    },
    {
        "Time Attack": "time attack"
    },
    {
        ", ": null
    },
    {
        "Survival": "survival mode"
    },
    {
        ", Extra Survival, Practice, and Museum mode. The game was released as a Universal App to run at native resolutions on ": null
    },
    {
        "iPad": "ipad"
    },
    {
        ", ": null
    },
    {
        "iPhone": "iphone"
    },
    {
        ", and ": null
    },
    {
        "iPod": "ipod"
    },
    {
        " touch. The game is no longer available in the iOS store.        On November 42 42 Namco Bandai released a port of Soulcalibur for the ": null
    },
    {
        "Android": "android"
    },
    {
        " platform. The app makes use of Google Play Games for synchronization between devices and runs at native resolution and screen aspect ratio.            Soulcalibur sold in excess of one million copies by December 42  It is the ": null
    },
    {
        "second biggest selling game on the system": "list of best-selling video games"
    },
    {
        ".  It won the 42 ": null
    },
    {
        "E42": "electronic entertainment expo"
    },
    {
        " Game Critics Award": "game critics awards"
    },
    {
        " for Best Fighting Game and the 42 ": null
    },
    {
        "Interactive Achievement Award": "interactive achievement award"
    },
    {
        " for Console Game of the Year .     Blake Fischer reviewed the Dreamcast version of the game for  Next Generation , rating it five stars out of five, and stated that Beautiful, deep, and far more compelling than any 42D fighter in recent memory, Soul Calibur is reason enough to own a Dreamcast.      The game received universal critical acclaim, garnering perfect 42/42 scores from ": null
    },
    {
        "GameSpot": "gamespot"
    },
    {
        "  and ": null
    },
    {
        "IGN": "ign"
    },
    {
        ",  and was for nearly a decade the last game to receive a perfect rating from IGN, until the release of ": null
    },
    {
        "Grand Theft Auto IV": "grand theft auto iv"
    },
    {
        " in 42 It is the second game ever to get a perfect 42/42 from Japanese gaming magazine  Famitsu  .  As of 42 game review aggregator website ": null
    },
    {
        "GameRankings": "gamerankings"
    },
    {
        " has the Dreamcast version ranked as the seventh best-reviewed game of all time, as well as being the highest scoring title in the fighting game genre.      The Dreamcast version of Soulcalibur also holds a score of 42 making it one of the highest rated video games of all time across all consoles and platforms, on ": null
    },
    {
        "Metacritic": "metacritic"
    },
    {
        ".         Soulcalibur was named as the number one best Dreamcast game by  Game Informer . Game Informer, Issue 42 February 42 Page 42 In 42 IGN ranked Soulcalibur as the fifth best Dreamcast game,  while ": null
    },
    {
        "ScrewAttack": "screwattack"
    },
    {
        " ranked it sixth.  ": null
    },
    {
        "GamesRadar": "gamesradar"
    },
    {
        " named Soulcalibur the best Dreamcast game of all time on their list.  In 42 GameSpot ranked Soulcalibur as the sixth best launch title yet, calling it not only one of the greatest launch games or one of the greatest fighters, but one of the greatest games ever. Period.      In addition, it is often considered to be one of the greatest games on all platforms, including:    Game Informer  : The Top 42 Games of All Time .    ": null
    },
    {
        "IGN": "ign"
    },
    {
        " : Top 42 Games .     Retro Gamer  : Top 42 Games . Retro Gamer 42 page 42   IGN : Top 42 Games .    IGN : Readers Choice The Top 42 Games Ever .     Electronic Gaming Monthly  : The Greatest 42 Videogames of Their Time .    ": null
    },
    {
        "ScrewAttack": "screwattack"
    },
    {
        " : Top Ten Fighting Games .    Cinema Blend : Top 42 Best Fighting Games of All Time .    ": null
    },
    {
        "UGO.com": "ugo.com"
    },
    {
        " : Top 42 Fighting Games of All Time .     Complex  : The 42 Best Fighting Games of All Time . Peter Rubin, , Complex.com, March 42 42   Game Informer 42rd best fighting game of all time             ": null
    }
]