[
    {
        "     Space Channel 42 is a ": null
    },
    {
        "music video game": "music video game"
    },
    {
        " developed by ": null
    },
    {
        "United Game Artists": "united game artists"
    },
    {
        " and published by parent company ": null
    },
    {
        "Sega": "sega"
    },
    {
        ". Originally released for the ": null
    },
    {
        "Dreamcast": "dreamcast"
    },
    {
        " , it was later ported to the ": null
    },
    {
        "PlayStation 42": "playstation 2"
    },
    {
        " . A version for the ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    },
    {
        " was published in 42 as a Western exclusive. Following space-faring reporter Ulala as she investigates an alien invasion, players engage in rhythm-based combat where Ulala mimics the actions of rivals in time to musical tracks.     The game was conceived by ": null
    },
    {
        "Tetsuya Mizuguchi": "tetsuya mizuguchi"
    },
    {
        ", who was told to create something aimed at a female audience. Production lasted two years, with a staff of around 42 that included company veterans and newcomers to game development. The music, composed by Naofumi Hataya and Kenichi Tokoi, drew inspiration from 42s big band music. The jazz number Mexican Flyer by ": null
    },
    {
        "Ken Woodman": "ken woodman"
    },
    {
        " informed the musical style and acted as the theme song. The overall style was influenced by culture from the 42s and 42s, and the later music videos of ": null
    },
    {
        "Peter Gabriel": "peter gabriel"
    },
    {
        " and ": null
    },
    {
        "Michael Jackson": "michael jackson"
    },
    {
        "; Jackson had a cameo appearance in the game.     While the game released to low sales, journalists gave the Dreamcast original generally positive reviews; praise focused on its music-central gameplay and artstyle, but faulted its short length and syncing issues with the graphics. The PS42 version met with similar praise, with many recommending it due to the low selling price. The GBA version saw lower scores due to technical shortcomings. A sequel,  Space Channel 42: Part 42 , released in 42 in Japan and 42 worldwide. A new game for ": null
    },
    {
        "HTC Vive": "htc vive"
    },
    {
        ", ": null
    },
    {
        "Oculus Quest": "oculus quest"
    },
    {
        " and ": null
    },
    {
        "PlayStation VR": "playstation vr"
    },
    {
        " is currently in production by original staff at Grounding Inc. Ulala went on to make cameo appearances in other franchises.          In the ": null
    },
    {
        "music video game": "music video game"
    },
    {
        " Space Channel 42, players take on the role of Ulala, a reporter working for the titular news channel in a 42s-styled science fiction future filled with competing news channels. When an alien race called the Morolians begin attacking, Ulala simultaneously reports on the events, fights off the threat, and clashes with rival reporters. The invasion is revealed to have been staged by Space Channel 42 boss Chief Blank to drive up ratings for the channel. With help from fellow reporters and support from her fans, Ulala defeats Blank.     Players control Ulala through four stages; real-time polygonal character models and visual effects move in synch to MPEG movies which form the level backgrounds. All gameplay has Ulala mimicking the movements and vocalisations of her opponents . Actions are performed in time to music tracks playing in each section of a stage. There are six buttons that match actions on-screen; the ": null
    },
    {
        "directional pad": "d-pad"
    },
    {
        " buttons, and two action buttons  which are presented with the vocalization chu .     Levels are split between dance areas, and shooting areas. During dance sections, Ulala mimics actions and shouts of chu from enemies, with successful actions boosting a Ratings meter in the lower right corner of the screen. In combat, Ulala must shoot at and defeat enemies, and also rescue hostages with the other action button. After either a dance or combat section, Ulala is joined in her progress by the people she rescued. During boss battles, Ulala has a health meter represented on-screen as hearts; a heart is lost for each mistake. If Ulala makes too many mistakes and loses all hearts during boss battles, or fails to meet the minimum rating requirements or causes ratings to drop to zero by missing or failing actions, the player reaches a game over and must restart. The game features a ": null
    },
    {
        "new game plus": "new game plus"
    },
    {
        " option, where players can begin a new game using a completed save file. Depending on current rating, alternate routes are unlocked and new enemy patterns appear.          The concept for Space Channel 42 originated when ": null
    },
    {
        "Tetsuya Mizuguchi": "tetsuya mizuguchi"
    },
    {
        "—then known for his work on racing games—was contacted by ": null
    },
    {
        "Sega": "sega"
    },
    {
        " to develop a game for the Dreamcast aimed at a female casual gaming demographic. Mizuguchi had no knowledge of such a demographic, so he personally interviewed several young girls to find their tastes in gaming. He discovered that, while male gamers trended towards games that allowed for ranking and high scores, women preferred straight puzzle games. Mizuguchi decided to create a game which would bring together both video game and music fans, using his personal experience with nightclub disco and music events such as ": null
    },
    {
        "Street Parade": "street parade"
    },
    {
        ". He also drew inspiration from the art of ": null
    },
    {
        "Wassily Kandinsky": "wassily kandinsky"
    },
    {
        ", wanting to encourage a form of ": null
    },
    {
        "synesthesia": "synesthesia"
    },
    {
        " within players. Other sources of inspiration were the music of the 42s and 42s, and the music videos of ": null
    },
    {
        "Peter Gabriel": "peter gabriel"
    },
    {
        " and ": null
    },
    {
        "Michael Jackson": "michael jackson"
    },
    {
        " that were showing on ": null
    },
    {
        "MTV": "mtv"
    },
    {
        " during the 42s.     Production was handled by ": null
    },
    {
        "United Game Artists": "united game artists"
    },
    {
        ", known as Sega Production Department 42 until its rebranding in 42; it was the newly-formed divisions first project. The team included many staff from ": null
    },
    {
        "Team Andromeda": "sega sports r & d"
    },
    {
        "  and the  Sonic the Hedgehog  series, and more who were complete newcomers to game development. Development for the game lasted almost two years. Beginning with a small team of ten, it eventually expanded to 42 members as development progressed. Mizuguchi acted as the games producer, with Takashi Yuda both directing and providing the voice for supporting character Fuze. The game was Mizuguchis first time working on a game aimed exclusively at the home console market, as his earlier work had first been developed for ": null
    },
    {
        "arcade": "arcade game"
    },
    {
        ". Speaking about the Dreamcast, Mizuguchi said that it allowed higher-quality music compared to graphics-focused racing games. He wanted to use the new technology to incorporate interactivity into the score.       The earliest versions of the game were described by Mizuguchi as very cool, but not so fun , as players simply pressed buttons in time to the music while a non-interactive video changed. To make the game more interesting, Mizuguchi drew inspiration from the rhythm trope ": null
    },
    {
        "Stomp": "stomp"
    },
    {
        "; a particular piece which inspired him was a segment where a performer would have the audience copy their clapping, with the rhythm becoming more complex over time. Mizuguchi wanted to incorporate this into the game, combining it with a narrative and distinctive music. The rest of the team found it difficult to understand Mizuguchis vision as they were confused by his wish for comedy to be a part of the games style, so he hired a pantomime artist to school the team in physical comedy. The production team also went to a comedy workshop to practise miming and physical comedy routines to further inform their understanding of the game. The name of the games aliens Morolians was a derivation of the surname of artist Mayumi Moro; it came about as the team often used her last name round the office. Moro found its use in the game funny.     A key aspect of the game was that while the gameplay involved shooting, Ulala never actually killed anyone, allowing the game to be approachable for a wider range of players. When pitching the gameplay in his design document, Mizuguchi distilled the basic cycle of effort and reward, then came up with a means of realising them in the game. To ensure the team fully understood the gameplay concept of matching button presses to music and character actions, all extraneous effects were stripped away, leaving a basic version the team could focus on. While some animations were created using motion capture, the rest were animated by hand. Ulalas motion capture actions were performed by Japanese dancer Nazu Nahoko. The Morolians movements were scripted by the mime artist Mizuguchi hired to help the team during early production. The idea of streaming polygonal models over CGI movies was suggested by Yuta. They made use of ": null
    },
    {
        "ADX": "adx"
    },
    {
        " technology to synch the movement of models over the movies. The game content filled just over 42% of the Dreamcast ": null
    },
    {
        "GD-ROM": "gd-rom"
    },
    {
        " disc. The space usage was attributed by Mizuguchi to the large amount of video and audio streaming used in the game. In hindsight, Mizuguchi cited the use of pre-rendered movies as a challenge to the team. Due to the amount of space used, some planned comedy segments had to be cut.     An early tech demo was put together for the game; in this prototype version, the player character was a man, and only the most basic elements of its gameplay and theme were in place. A later version featured a prototype design for Ulala. The games visual aesthetic of a retro future was present in that demo, and stayed throughout production. Influences on the characters and art design came from across the production team, with tastes ranging from  Star Wars  to  Doraemon  to ": null
    },
    {
        "Monty Python": "monty python"
    },
    {
        ". Mizuguchi was inspired by the contrasting styles of orchestral music and science fiction setting used in Star Wars. The character of Ulala was a collaborative creation, though much of her design was attributed to the games art director Yumiko Miyabe. Ulalas early actions were deemed too cool and stylish , and her overall movement too stiff. Her design was also adjusted several times so she would appeal to male gamers and female gamers . Another notable artist on the project was Jake Kazdal, who worked as a concept and model artist. Kazdal said that one of Ulalas key design inspirations was the titular lead of the 42s science fiction film  Barbarella . The art style continued to evolve from there, with the staff often laughing at the sheer ridiculousness of some later characters. Her costumes orange colour was a reference to the Dreamcast logo, and signified Segas new direction.       The music for Space Channel 42 was composed by Naofumi Hataya and Kenichi Tokoi of Segas music label WaveMaster. Hayata also acted as sound director. The musical style, inspired by big band jazz of the 42s and 42s, was one of the earliest elements to be decided upon. Hataya attributed the games musical direction to Mizuguchis guidance throughout production. The musical style changed with each stage, with later sections incorporating techno and trance. The in-game soundtrack mixed CD-quality music with midi sound samples. According to Hayata, one of the hardest aspects of music development was the variety of genres and fitting all the score onto the game disc. Music production ran simultaniously with the games production, with the sound team at first using concept art and in-production gameplay. Late in development, the story caused a lot of additional work for the team. The final total of in-game music was estimated at 42 minutes.     The games main theme was Mexican Flyer , a big band jazz number composed by ": null
    },
    {
        "Ken Woodman": "ken woodman"
    },
    {
        " in 42 Mizuguchi approached Woodman about using the theme. Woodman was surprised that someone wanted to use the theme for a video game. The use of Mexican Flyer in the games early presentation video informed the direction of the music. Getting the rights to the track proved difficult, as the track was extremely obscure and had not been used in any media since its release. A soundtrack album for the game was published by ": null
    },
    {
        "Marvelous Entertainment": "marvelous entertainment"
    },
    {
        " and distributed by ": null
    },
    {
        "VAP": "vap"
    },
    {
        " on February 42 42 The album featured 42 tracks, including a remix of Mexican Flyer .     Sega chose not to promote the games voice cast. Most of the voice roles were taken by members of the games staff. This was due to the team wanting full control of how characters were portrayed, and the need to do quick re-recording sessions. Ulalas voice actress was similarly pulled from Sega staff. Journalist James Mielke attributed Ulalas voice to Mineko Okamura. According to Mizuguchi, the recording process was so strenuous and his demands so exacting that the actress was brought to tears. The character was voiced in English by ": null
    },
    {
        "Apollo Smile": "apollo smile"
    },
    {
        ", then a notable television personality.     A notable cameo was Michael Jackson himself, featuring in the game as the character Space Michael . A long-term collaborator with and fan of Sega, Jackson was shown a near-finished version of the game by Sega staff member Shuji Utsumi. Jackson loved the game and wanted to be featured in it. Mizuguchi initially wanted to refuse the request as the game was only a month away from completion, but the team wanted to include Jackson so they substituted a Morolian-controlled NPC character for a model based on Jackson and added moves based on the singers famous dance moves. Initially thinking Jackson would dislike it, Mizuguchi was surprised when Jackson approved, realising the pressures the team were under, and provided voice lines for the character.       Space Channel 42 was first announced in the September 42 Tokyo Game Show. Nahoko portrayed the character at live promotional events, including its TGS showings. The game was released in Japan on December 42 42 Sega pushed the games release with heavy public promotions and an extensive launch event in ": null
    },
    {
        "Tokyo": "tokyo"
    },
    {
        ". The game was supported by several pieces of merchandise.     The games localization was handled by Sega, who approached it with care and time . One of the key elements for the team was finding the right English voice for Ulala. When the dialogue was localized, there was little difference between regions beyond language-specific nuances. The music itself received little to no changes. The game released internationally in 42; it was published in North America on June 42 and in Europe on October 42     Following their exit from the console market, Sega began moving their franchises onto other systems including PS42; one of those franchises was Space Channel 42. The PS42 version released in Europe on March 42 42; and in Japan on December 42 of that year. In North America, the PS42 port was bundled with its sequel and published in the region by ": null
    },
    {
        "Agetec": "agetec"
    },
    {
        ". This version released in North America on November 42 In Japan, the PS42 version has since become a rarity, fetching high resale prices.     A remake for the GBA titled Space Channel 42: Ulalas Cosmic Attack was also produced. This formed part of Segas partnership with ": null
    },
    {
        "THQ": "thq"
    },
    {
        " to co-develop and co-publish several of their franchises to the platform. The port was co-developed by ": null
    },
    {
        "Art Co., Ltd": "art co., ltd"
    },
    {
        " and THQ. The game was re-created within the GBA hardware, with its music rendered using a midi score. The music was handled by Tsutomu Fuzawa. The game released as a Western exclusive in 42; it was published on June 42 in North America, and September 42 in Europe.            Upon its debut in Japan, the game met with low sales. During its first week, it sold through just over 42% of its stock with over 42 units. It eventually sold over 42 units in Japan, being among the regions top 42 best-selling Dreamcast titles. At a 42 conference, the game was declared a success by its staff, finding a wide audience among both hardcore and casual gamers. In contrast during a 42 interview, Mizuguchi said that the game was not a commercial success.     According to video game ": null
    },
    {
        "review aggregator": "review aggregator"
    },
    {
        " GameRankings": "gamerankings"
    },
    {
        ", the Dreamcast version earned a score of 42% based on 42 reviews. Japanese gaming magazine  Famitsu  gave the game a score of 42 points out of 42 Pat Garratt of  Computer and Video Games  gave the game a perfect score, calling it a unique game and absolute must for every DC owner . The three reviewers for  Electronic Gaming Monthly  lauded the soundtrack and art design, but noted issues with its short length and occasional syncing issues.  GamePro  positively compared the gameplay and style to  PaRappa the Rapper  and  Dragons Lair , recommending it as a short and enjoyable experience while noting a lack of extras.  GameSpot s Jeff Gerstmann said Space Channel 42 was worth playing for its unconventional artstyle and music, with his main complaints being repetitive gameplay and lack of unlockables.      GameSpy  called the game a work of art in every sense of the word , praising the world and music and calling the game a testament to Segas production skills; their one major problem was the simplistic gameplay style and lack of features beyond the campaign.  IGN  gave both the Japanese original , and the Western release near-perfect scores, praising the experience while sharing criticisms with Electronic Gaming Monthly.  USA Today  said the game was all about fun, and Space Channel 42 delivers with a song.  Entertainment Weekly  said that gamers of all ages undoubtedly will want to help Ulala get her groove back — if not get their hands on a pair of those boots.     The game was nominated for awards in four categories at the 42 ": null
    },
    {
        "Japan Game Awards": "japan game awards"
    },
    {
        ". It was also nominated in the Animaion category at the ": null
    },
    {
        "Academy of Interactive Arts & Sciences": "academy of interactive arts  &  sciences"
    },
    {
        " ceremony in 42 In anniversary retrospectives and lists of favorite Dreamcast titles from multiple websites including  Gamasutra  and IGN, Space Channel 42 has been remembered as one of the most unique titles on the system for its gameplay design and art direction.  42UP.com , in an article about Mizuguchis work with United Game Artists, highlight on the Dreamcast and described as unlike anything before it.       The PS42 port met with a similar positive response, GameRankings gave the North American release a score of 42% based on 42 reviews; and ": null
    },
    {
        "Metacritic": "metacritic"
    },
    {
        " gave it a score of 42 out of a possible 42 from 42 reviews, indicating a generally favorable reception. Electronic Gaming Monthly said that the mixture of music and unique style gave the game an infectious, addictive quality . GamePro called the Special Edition package easily the best bargain for the PS42 this side of  Virtua Fighter 42: Evolution  .  Game Informer  called this version a great package crammed with more value and personality than most rhythm games . Brad Shoemaker of GameSpot felt it was a great release due to its low price and having both the original and its sequel.     GameSpys Christian Nutt lauded the music and its lead character, in addition to the low price for the double game pack, but faulted its length and issues with the localization. GameZone recommended the package for fans of  Dance Dance Revolution , and said gamers outside its target audience should try it due to its quality and enjoyability. Douglass Perry of IGN, comparing the game to its sequel that formed part of the package, felt that the first was the inferior game due to lacking the later additions and polishing. Paul Fitzpatrick of  Official U.S. PlayStation Magazine  felt that the original games flaws were only exacerbated when contrasted with its sequel. Paul Fitzpatrick of  PlayStation Official Magazine – UK  enjoyed the soundtrack and lauded its sense of style, but criticized its length.       By contrast, the GBA port received a Metacritic score of 42 out of 42 showing mixed or average reviews. GamePro was surprised that the game worked on the portable console, praising the efforts of the team while being unable to recommend it to buyers. For Frank Provo of GameSpot, the biggest problem was the unresponsive controls, as otherwise the game was a laudable conversion of the game for the GBA. GameSpys Steve Steinberg was very critical, calling the game a barely playable disappointment despite liking the soundtrack. GameZone said that the difficulties with controlling Ulala and presentation made the game suitable only for hardcore series fans. Craig Harris, writing for IGN, said that while the gameplay was intact the other elements were undermined by the technical constraints of the console.  The Village Voice  gave the port a good score, saying that the games core remained intact and enjoyable despite low graphical quality and control issues. Game Informer was also positive, saying that there could be no better version of Space Channel 42 on the platform.  Nintendo Power  gave praise to the control responses, but called the graphics colorful but sparse .               A sequel to Space Channel 42 was planned from an early stage, but production was put on hold until Western sales figures came in. The sequel,  Space Channel 42: Part 42 , was announced in October 42 It received a simultaneous release on Dreamcast and PS42 in January 42 in Japan. The PS42 version released in mainland Europe the following year. In North America, the game was released as part of Space Channel 42: Special Edition by Agetec. It was the last game produced by United Game Artists prior to Segas internal restructuring in 42 Part 42 was later given a high-definition port to ": null
    },
    {
        "Microsoft Windows": "microsoft windows"
    },
    {
        ", ": null
    },
    {
        "Xbox 42": "xbox 360"
    },
    {
        " and ": null
    },
    {
        "PlayStation 42": "playstation 3"
    },
    {
        ". It released first as part of the  Dreamcast Collection  in February 42 then as a standalone digital release in October the same year.     Segas ": null
    },
    {
        "Sonic Team": "sonic team"
    },
    {
        " studio also created a mobile game called Ulalas Channel J for Japanese ": null
    },
    {
        "Vodafone": "vodafone"
    },
    {
        " devices in July 42 The game was made up of up several minigames, most themed after the series and specifically Space Channel 42: Part 42. Some featured 42D graphics that required higher-specification devices to play. The game shut down in September 42     While concepts existed for a third game in the series and pitches were made for the ": null
    },
    {
        "Wii": "wii"
    },
    {
        " and ": null
    },
    {
        "Kinect": "kinect"
    },
    {
        ", the team felt they had exhausted their ideas, and Sega showed little interest in a new entry. At one time, Mizuguchi and Q Entertainment were in discussions with Sega about reviving the series for HD consoles. A new ": null
    },
    {
        "virtual reality": "virtual reality"
    },
    {
        " project was eventually greenlit by Sega. The project was developed by Grounding Inc., a game company founded by former Sega developers including Okamura, who pitched the concept to Sega. Beginning in 42 as an experimental collaboration with Sega and ": null
    },
    {
        "KDDI": "kddi"
    },
    {
        " titled Space Channel 42 VR: Ukiuki Viewing Show, the project saw a strong fan response for a full game. Titled Space Channel 42 VR: Kinda Funky News Flash, the player takes the role of novice reporters assisting Ulala during a new invasion report. The title is scheduled for release on ": null
    },
    {
        "HTC Vive": "htc vive"
    },
    {
        " and ": null
    },
    {
        "Oculus Quest": "oculus quest"
    },
    {
        " by December 42       Ulala was used in a collaboration between MTV and Sega to present the Best Video award at ": null
    },
    {
        "MTV Video Music Award": "mtv video music award"
    },
    {
        " ceremony. Ulalas appearance at the event was also used to promote ": null
    },
    {
        "SegaNet": "seganet"
    },
    {
        " during its Dreamcast debut. A CGI television adaptation of Space Channel 42 was originally planned from SuperMega Media. In addition, Ulala was to have featured in an MTV program slot as an announcer. These MTV collaborations were cancelled mid-production. Japanese action figure company ": null
    },
    {
        "Figma": "figma"
    },
    {
        " produced two Ulala figures based on her main looks from Space Channel 42 and its sequel.     Ulala was featured as a secret character in racing game  Sonic Riders , a playable character in multiple entries in the  Sega All-Stars  series, part of a themed stage in the Wii re-release of the rhythm game  Samba de Amigo , and a playable unit in the crossover strategy game  Project X Zone  and ": null
    },
    {
        "its sequel": "project x zone 2"
    },
    {
        ".       In 42 Space Channel 42 and its protagonist Ulala was the subject of a lawsuit against Sega from ": null
    },
    {
        "Lady Miss Kier": "lady miss kier"
    }
]