[
    {
        "            The Spanish conquest of Yucatán was the campaign undertaken by the ": null
    },
    {
        "Spanish": "spanish empire"
    },
    {
        "  conquistador es against the ": null
    },
    {
        "Late Postclassic": "mesoamerican chronology"
    },
    {
        " Maya": "maya civilization"
    },
    {
        " states and polities in the ": null
    },
    {
        "Yucatán Peninsula": "yucatán peninsula"
    },
    {
        ", a vast ": null
    },
    {
        "limestone": "limestone"
    },
    {
        " plain covering south-eastern ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        ", northern ": null
    },
    {
        "Guatemala": "guatemala"
    },
    {
        ", and all of ": null
    },
    {
        "Belize": "belize"
    },
    {
        ". The ": null
    },
    {
        "Spanish conquest": "spanish colonization of the americas"
    },
    {
        " of the Yucatán Peninsula was hindered by its politically fragmented state. The Spanish engaged in a strategy of concentrating native populations in newly founded colonial towns. Native resistance to the new nucleated settlements took the form of the flight into inaccessible regions such as the forest or joining neighbouring Maya groups that had not yet submitted to the Spanish. Among the Maya, ambush was a favoured tactic. Spanish weaponry included ": null
    },
    {
        "broadsword": "broadsword"
    },
    {
        "s, ": null
    },
    {
        "rapier": "rapier"
    },
    {
        "s, ": null
    },
    {
        "lance": "lance"
    },
    {
        "s, ": null
    },
    {
        "pike": "pike"
    },
    {
        "s, ": null
    },
    {
        "halberd": "halberd"
    },
    {
        "s, ": null
    },
    {
        "crossbow": "crossbow"
    },
    {
        "s, ": null
    },
    {
        "matchlock": "matchlock"
    },
    {
        "s and light ": null
    },
    {
        "artillery": "history of artillery"
    },
    {
        ". ": null
    },
    {
        "Maya warriors": "maya warfare"
    },
    {
        " fought with flint-tipped spears, bows and arrows and stones, and wore padded cotton armour to protect themselves. The Spanish introduced a number of ": null
    },
    {
        "Old World": "old world"
    },
    {
        " diseases previously unknown in the Americas, initiating devastating plagues that swept through the native populations.     The first encounter with the Yucatec Maya may have occurred in 42 when the fourth voyage of ": null
    },
    {
        "Christopher Columbus": "christopher columbus"
    },
    {
        " came across a large trading canoe off ": null
    },
    {
        "Honduras": "honduras"
    },
    {
        ". In 42 Spanish survivors of the shipwrecked caravel called Santa María de la Barca sought refuge among native groups along the eastern coast of the peninsula. Hernán Cortés made contact with two survivors, Gerónimo de Aguilar and Gonzalo Guerrero, six years later. In 42 ": null
    },
    {
        "Francisco Hernández de Córdoba": "francisco hernández de córdoba"
    },
    {
        " made landfall on the tip of the peninsula. His expedition continued along the coast and suffered heavy losses in a pitched battle at ": null
    },
    {
        "Champotón": "champotón, campeche"
    },
    {
        ", forcing a retreat to Cuba. ": null
    },
    {
        "Juan de Grijalva": "juan de grijalva"
    },
    {
        " explored the coast in 42 and heard tales of the wealthy ": null
    },
    {
        "Aztec Empire": "aztec empire"
    },
    {
        " further west. As a result of these rumours, ": null
    },
    {
        "Hernán Cortés": "hernán cortés"
    },
    {
        " set sail with another fleet. From ": null
    },
    {
        "Cozumel": "cozumel"
    },
    {
        " he continued around the peninsula to ": null
    },
    {
        "Tabasco": "tabasco"
    },
    {
        " where he fought a battle at ": null
    },
    {
        "Potonchán": "potonchán"
    },
    {
        "; from there Cortés continued onward to conquer the Aztec Empire. In 42 Cortés led a sizeable expedition to Honduras, cutting across southern ": null
    },
    {
        "Campeche": "campeche"
    },
    {
        ", and through Petén in what is now northern Guatemala. In 42 ": null
    },
    {
        "Francisco de Montejo": "francisco de montejo"
    },
    {
        " set sail from ": null
    },
    {
        "Spain": "spain"
    },
    {
        " with a small fleet. He left garrisons on the east coast, and subjugated the northeast of the peninsula. Montejo then returned to the east to find his garrisons had almost been eliminated; he used a supply ship to explore southwards before looping back around the entire peninsula to central Mexico. Montejo pacified Tabasco with the aid of his son, also named ": null
    },
    {
        "Francisco de Montejo": "francisco de montejo the younger"
    },
    {
        ".     In 42 the Spanish moved their base of operations to ": null
    },
    {
        "Campeche": "campeche, campeche"
    },
    {
        ", where they repulsed a significant Maya attack. After this battle, the Spanish founded a town at ": null
    },
    {
        "Chichen Itza": "chichen itza"
    },
    {
        " in the north. Montejo carved up the province amongst his soldiers. In mid42 the local Maya rebelled and laid siege to the small Spanish garrison, which was forced to flee. Towards the end of 42 or the beginning of 42 the Spanish retreated from Campeche to ": null
    },
    {
        "Veracruz": "veracruz"
    },
    {
        ". In 42 peaceful attempts by the ": null
    },
    {
        "Franciscan Order": "franciscan order"
    },
    {
        " to incorporate Yucatán into the Spanish Empire failed after a renewed Spanish military presence at Champotón forced the friars out. Champotón was by now the last Spanish outpost in Yucatán, isolated among a hostile population. In 42–42 the first permanent Spanish town councils in the entire peninsula were founded at Campeche and ": null
    },
    {
        "Mérida": "mérida, yucatán"
    },
    {
        ". When the powerful lord of ": null
    },
    {
        "Mani": "maní, yucatán"
    },
    {
        " converted to the ": null
    },
    {
        "Roman Catholic": "catholic church"
    },
    {
        " religion, his submission to Spain and conversion to Christianity encouraged the lords of the western provinces to accept Spanish rule. In late 42 an alliance of eastern provinces launched an unsuccessful uprising against the Spanish. The eastern Maya were defeated in a single battle, which marked the final conquest of the northern portion of the Yucatán Peninsula.     The polities of ": null
    },
    {
        "Petén": "petén basin"
    },
    {
        " in the south remained independent and received many refugees fleeing from Spanish jurisdiction. In 42 and in 42 two unsuccessful Franciscan missions attempted the peaceful conversion of the still pagan ": null
    },
    {
        "Itza": "itza people"
    },
    {
        ". In 42 the Itza slaughtered two Spanish parties trying to reach their capital ": null
    },
    {
        "Nojpetén": "nojpetén"
    },
    {
        ". These events ended all Spanish attempts to contact the Itza until 42 Over the course of 42 and 42 a number of Spanish expeditions attempted to reach Nojpetén from the mutually independent Spanish colonies in Yucatán and Guatemala. In early 42 the Spanish began to build a road from Campeche south towards Petén and activity intensified, sometimes with significant losses on the part of the Spanish. ": null
    },
    {
        "Martín de Urzúa y Arizmendi": "martín de urzúa y arizmendi"
    },
    {
        ", governor of Yucatán, launched an assault upon Nojpetén in March 42; the city fell after a brief battle. With the defeat of the Itza, the last independent and unconquered native kingdom in the Americas fell to the Spanish.               The Yucatán Peninsula is bordered by the Caribbean Sea to the east and by the Gulf of Mexico to the north and west. It can be delimited by a line running from the ": null
    },
    {
        "Laguna de Términos": "laguna de términos"
    },
    {
        " on the Gulf coast through to the ": null
    },
    {
        "Gulf of Honduras": "gulf of honduras"
    },
    {
        " on the Caribbean coast. It incorporates the modern ": null
    },
    {
        "Mexican states": "states of mexico"
    },
    {
        " of ": null
    },
    {
        "Yucatán": "yucatán"
    },
    {
        ", ": null
    },
    {
        "Quintana Roo": "quintana roo"
    },
    {
        " and ": null
    },
    {
        "Campeche": "campeche"
    },
    {
        ", the eastern portion of the ": null
    },
    {
        "state of Tabasco": "state of tabasco"
    },
    {
        ", most of the ": null
    },
    {
        "Guatemalan department": "departments of guatemala"
    },
    {
        " of ": null
    },
    {
        "Petén": "petén department"
    },
    {
        ", and all of Belize. Quezada 42 p. 42 Most of the peninsula is formed by a vast plain with few hills or mountains and a generally low coastline. A  stretch of high, rocky coast runs south from the city of Campeche on the Gulf Coast. A number of bays are situated along the east coast of the peninsula, from north to south they are ": null
    },
    {
        "Ascensión Bay": "ascensión bay"
    },
    {
        ", ": null
    },
    {
        "Espíritu Santo Bay": "espíritu santo bay"
    },
    {
        ", ": null
    },
    {
        "Chetumal Bay": "chetumal bay"
    },
    {
        " and ": null
    },
    {
        "Amatique Bay": "amatique bay"
    },
    {
        ". The north coast features a wide, sandy ": null
    },
    {
        "littoral zone": "littoral zone"
    },
    {
        ". The extreme north of the peninsula, roughly corresponding to Yucatán State, has underlying bedrock consisting of flat ": null
    },
    {
        "Cenozoic": "cenozoic"
    },
    {
        " limestone. To the south of this the limestone rises to form the low chain of ": null
    },
    {
        "Puuc Hills": "puuc hills"
    },
    {
        ", with a steep initial scarp running  east from the Gulf coast near Champotón, terminating some  from the Caribbean coast near the border of Quintana Roo. White and Hood 42 p. 42 Quezada 42 p. 42 The hills reach a maximum altitude of . Quezada 42 p. 42     The northwestern and northern portions of the Yucatán Peninsula experience lower rainfall than the rest of the peninsula; these regions feature highly porous limestone bedrock resulting in less surface water. This limestone geology results in most rainwater filtering directly through the bedrock to the ": null
    },
    {
        "phreatic zone": "phreatic zone"
    },
    {
        ", from whence it slowly flows to the coasts to form large submarine springs. Various freshwater springs rise along the coast to form watering holes. The filtering of rainwater through the limestone has caused the formation of extensive cave systems. These cave rooves are subject to collapse forming deep ": null
    },
    {
        "sinkhole": "sinkhole"
    },
    {
        "s; if the bottom of the cave is deeper than the ": null
    },
    {
        "groundwater": "groundwater"
    },
    {
        " level then a ": null
    },
    {
        "cenote": "cenote"
    },
    {
        " is formed.     In contrast, the northeastern portion of the peninsula is characterised by forested swamplands. Thompson 42 p. 42 The northern portion of the peninsula lacks rivers, except for the ": null
    },
    {
        "Champotón River": "champotón river"
    },
    {
        " – all other rivers are located in the south. The ": null
    },
    {
        "Sibun River": "sibun river"
    },
    {
        " flows from west to east from south central Quintana Roo to ": null
    },
    {
        "Lake Bacalar": "lake bacalar"
    },
    {
        " on the Caribbean Coast; the ": null
    },
    {
        "Río Hondo": "hondo river"
    },
    {
        " flows northwards from Belize to empty into the same lake. Quezada 42 pp. 42–42 Bacalar Lake empties into Chetumal Bay. The ": null
    },
    {
        "Río Nuevo": "new river"
    },
    {
        " flows from Lamanai Lake in Belize northwards to Chetumal Bay. The ": null
    },
    {
        "Mopan River": "mopan river"
    },
    {
        " and the ": null
    },
    {
        "Macal River": "macal river"
    },
    {
        " flow through Belize and join to form the ": null
    },
    {
        "Belize River": "belize river"
    },
    {
        ", which empties into the Caribbean Sea. In the southwest of the peninsula, the ": null
    },
    {
        "San Pedro River": "san pedro river"
    },
    {
        ", the ": null
    },
    {
        "Candelaría River": "candelaría river"
    },
    {
        " and the ": null
    },
    {
        "Mamantel River": "mamantel river"
    },
    {
        ", which all form a part of the Gulf of Mexico drainage. Quezada 42 p. 42     The Petén region consists of densely forested low-lying limestone plain featuring ": null
    },
    {
        "karstic": "karstic"
    },
    {
        " topography. Lovell 42 p. 42 The area is crossed by low east–west oriented ridges of Cenozoic limestone and is characterised by a variety of forest and soil types; water sources include generally small rivers and low-lying seasonal swamps known as bajos. Sharer and Traxler 42 p. 42 A chain of fourteen lakes runs across the central drainage basin of Petén; during the ": null
    },
    {
        "rainy season": "rainy season"
    },
    {
        " some of these lakes become interconnected. This ": null
    },
    {
        "drainage area": "drainage area"
    },
    {
        " measures approximately  east–west by  north–south. Sharer and Traxler 42 pp. 42–42 The largest lake is ": null
    },
    {
        "Lake Petén Itza": "lake petén itza"
    },
    {
        ", near the centre of the drainage basin; it measures . A broad ": null
    },
    {
        "savanna": "savanna"
    },
    {
        "h extends south of the central lakes. To the north of the lakes region bajos become more frequent, interspersed with forest. In the far north of Petén the ": null
    },
    {
        "Mirador Basin": "mirador basin"
    },
    {
        " forms another interior drainage region. Sharer and Traxler 42 p. 42 To the south the plain gradually rises towards the Guatemalan Highlands. Rice and Rice 42 p. 42 The canopy height of the forest gradually decreases from Petén northwards, averaging from . Quezada 42 p. 42 This dense forest covers northern Petén and Belize, most of Quinatana Roo, southern Campeche and a portion of the south of Yucatán State. Further north, the vegetation turns to lower forest consisting of dense scrub. Quezada 42 p. 42       The climate becomes progressively drier towards the north of the peninsula. In the north, the annual mean temperature is  in Mérida. Average temperature in the peninsula varies from  in January to  in July. The lowest temperature on record is . For the peninsula as a whole, the mean annual precipitation is . The rainy season lasts from June to September, while the dry season runs from October to May. During the dry season, rainfall averages ; in the wet season this increases to an average . The prevailing winds are easterly and have created an east-west precipitation gradient with average rainfall in the east exceeding  and the north and northwestern portions of the peninsula receiving a maximum of . The southeastern portion of the peninsula has a tropical rainy climate with a short dry season in winter. White and Hood 42 p. 42     Petén has a hot climate and receives the highest rainfall in all ": null
    },
    {
        "Mesoamerica": "mesoamerica"
    },
    {
        ". The climate is divided into ": null
    },
    {
        "wet": "wet season"
    },
    {
        " and ": null
    },
    {
        "dry season": "dry season"
    },
    {
        "s, with the rainy season lasting from June to December, although these seasons are not clearly defined in the south; with rain occurring through most of the year. The climate of Petén varies from ": null
    },
    {
        "tropical": "tropical climate"
    },
    {
        " in the south to ": null
    },
    {
        "semitropical": "subtropics"
    },
    {
        " in the north; temperature varies between , although it does not usually drop beneath . Schwartz 42 p. 42 Mean temperature varies from  in the southeast to  in the northeast. Highest temperatures are reached from April to June, while January is the coldest month; all Petén experiences a hot dry period in late August. Annual precipitation is high, varying from a mean of  in the northeast to  in central Petén. Schwartz 42 p. 42       The first large ": null
    },
    {
        "Maya cities": "maya city"
    },
    {
        " developed in the Petén Basin in the far south of the Yucatán Peninsula as far back as the Middle Preclassic , Estrada-Belli 42 p. 42 and Petén formed the heartland of the ancient Maya civilization during the Classic period . Coe 42 p. 42 Webster 42 p. 42 The 42th century Maya provinces of northern Yucatán are likely to have evolved out of polities of the Maya Classic period. From the mid42th century AD through to the mid42th century, the League of Mayapán united several of the northern provinces; for a time they shared a joint form of government. The great cities that dominated Petén had fallen into ruin by the beginning of the 42th century AD with the onset of the ": null
    },
    {
        "Classic Maya collapse": "classic maya collapse"
    },
    {
        ". Sharer and Traxler 42 pp. 42–42 A significant Maya presence remained in Petén into the ": null
    },
    {
        "Postclassic period": "postclassic period"
    },
    {
        " after the abandonment of the major Classic period cities; the population was particularly concentrated near permanent water sources. Sharer and Traxler 42 pp. 42 42     In the early 42th century, when the Spanish discovered the Yucatán Peninsula, the region was still dominated by the Maya civilization. It was divided into a number of independent provinces referred to as  kuchkabal   in the ": null
    },
    {
        "Yucatec Maya language": "yucatec maya language"
    },
    {
        ". The various provinces shared a common culture but the internal sociopolitical organisation varied from one province to the next, as did access to important resources. These differences in political and economic makeup often led to hostilities between the provinces. The politically fragmented state of the Yucatán Peninsula at the time of conquest hindered the Spanish invasion, since there was no central political authority to be overthrown. However, the Spanish were also able to exploit this fragmentation by taking advantage of pre-existing rivalries between polities. Estimates of the number of kuchkabal in the northern Yucatán vary from sixteen to twenty-four. Andrews 42 p. 42 The boundaries between polities were not stable, being subject to the effects of alliances and wars; those kuchkabaloob with more centralised forms of government were likely to have had more stable boundaries than those of loose confederations of provinces. Andrews 42 p. 42 When the Spanish discovered Yucatán, the provinces of Mani and Sotuta were two of the most important polities in the region. They were mutually hostile; the Xiu Maya of Mani allied themselves with the Spanish, while the Cocom Maya of Sotuta became the implacable enemies of the European colonisers. Caso Barrera 42 p. 42     At the time of conquest, polities in the north included Mani, ": null
    },
    {
        "Cehpech": "cehpech"
    },
    {
        " and ": null
    },
    {
        "Chakan": "chakan"
    },
    {
        ". Chakan was largely landlocked with a small stretch of coast on the north of the peninsula. Cehpech was a coastal province to its east; further east along the north coast were ": null
    },
    {
        "Ah Kin Chel": "ah kin chel"
    },
    {
        ", ": null
    },
    {
        "Cupul": "cupul"
    },
    {
        ", and ": null
    },
    {
        "Chikinchel": "chikinchel"
    },
    {
        ". The modern city of ": null
    },
    {
        "Valladolid": "valladolid, yucatán"
    },
    {
        " is situated upon the site of the former capital of Cupul. Andrews 42 p. 42 Cupul and Chinkinchel are known to have been mutually hostile, and to have engaged in wars to control the salt beds of the north coast. Andrews 42 p. 42 ": null
    },
    {
        "Tases": "tases"
    },
    {
        " was a small landlocked province south of Chikinchel. ": null
    },
    {
        "Ecab": "ecab"
    },
    {
        " was a large province in the east. ": null
    },
    {
        "Uaymil": "uaymil"
    },
    {
        " was in the southeast, and ": null
    },
    {
        "Chetumal": "chetumal"
    },
    {
        " was to the south of it; all three bordered on the Caribbean Sea. ": null
    },
    {
        "Cochuah": "cochuah"
    },
    {
        " was also in the eastern half of the peninsula; it was southwest of Ecab and northwest of Uaymil. Its borders are poorly understood and it may have been landlocked, or have extended to occupy a portion of the Caribbean coast between the latter two kuchkabaloob. The capital of Cochuah was Tihosuco. Hocaba and Sotuta were landlocked provinces north of Mani and southwest of Ah Kin Chel and Cupul. Ah Canul was the northernmost province on the Gulf coast of the peninsula. Canpech was to the south of it, followed by Chanputun . South of Chanputun, and extending west along the Gulf coast was ": null
    },
    {
        "Acalan": "acalan"
    },
    {
        ". Andrews 42 p. 42 This ": null
    },
    {
        "Chontal Maya": "chontal maya language"
    },
    {
        "-speaking province extended east of the Usumacinta River in Tabasco, as far as what is now the southern portion of Campeche state, where their capital was located. In the southern portion of the peninsula, a number of polities occupied the Petén Basin. The Kejache occupied a territory to the north of the Itza and east of Acalan, between the Petén lakes and what is now Campeche, and to the west of Chetumal. The ": null
    },
    {
        "Cholan Maya": "chʼolan languages"
    },
    {
        "-speaking ": null
    },
    {
        "Lakandon": "lakandon chʼol"
    },
    {
        " controlled territory along the tributaries of the Usumacinta River spanning southwestern Petén in Guatemala and eastern Chiapas. The Lakandon had a fierce reputation amongst the Spanish. Houwald 42 p. 42     Although there is insufficient data to accurately estimate population sizes at the time of contact with the Spanish, early Spanish reports suggest that sizeable Maya populations existed in Petén, particularly around the central lakes and along the rivers. Jones 42 p. 42 Before their defeat in 42 the Itza controlled or influenced much of Petén and parts of Belize. The Itza were warlike, and their martial prowess impressed both neighbouring Maya kingdoms and their Spanish enemies. Their capital was Nojpetén, an island city upon Lake Petén Itzá; it has developed into the modern town of Flores, which is the capital of the Petén department of Guatemala. Jones 42 p. 42 The Itza spoke a variety of ": null
    },
    {
        "Yucatecan Maya": "yucatecan languages"
    },
    {
        ". Jones 42 p. 42 The ": null
    },
    {
        "Kowoj": "kowoj"
    },
    {
        " were the second in importance; they were hostile towards their Itza neighbours. The Kowoj were located to the east of the Itza, around the eastern Petén lakes: Lake Salpetén, Lake Macanché, ": null
    },
    {
        "Lake Yaxhá": "laguna yaxhá"
    },
    {
        " and Lake Sacnab. Rice and Rice 42 p. 42 Rice 42 p. 42 The Yalain appear to have been one of the three dominant polities in Postclassic central Petén, alongside the Itza and the Kowoj. The Yalain territory had its maximum extension from the east shore of Lake Petén Itzá eastwards to Tipuj in Belize. Cecil et al 42 p. 42 In the 42th century the Yalain capital was located at the site of that name on the north shore of ": null
    },
    {
        "Lake Macanché": "lake macanché"
    },
    {
        ". Sharer and Traxler 42 p. 42 At the time of Spanish contact the Yalain were allied with the Itza, an alliance cemented by intermarriage between the elites of both groups. In the late 42th century, Spanish colonial records document hostilities between Maya groups in the lakes region, with the incursion of the Kowoj into former Yalain sites including ": null
    },
    {
        "Zacpeten": "zacpeten"
    },
    {
        " on Lake Macanché and ": null
    },
    {
        "Ixlu": "ixlu"
    },
    {
        " on ": null
    },
    {
        "Lake Salpetén": "lake salpetén"
    },
    {
        ". Rice and Rice 42 p. 42 Other groups in Petén are less well known, and their precise territorial extent and political makeup remains obscure; among them were the ": null
    },
    {
        "Chinamita": "chinamita"
    },
    {
        ", the Icaiche, the Kejache, the Lakandon ": null
    },
    {
        "Chʼol": "chʼol people"
    },
    {
        ", the ": null
    },
    {
        "Manche Chʼol": "manche chʼol"
    },
    {
        ", and the ": null
    },
    {
        "Mopan": "mopan people"
    },
    {
        ". Rice 42 p. 42 Feldman 42 p. xxi.          A single soldier arriving in Mexico in 42 was carrying ": null
    },
    {
        "smallpox": "smallpox"
    },
    {
        " and thus initiated the devastating plagues that swept through the native populations of the Americas. Smith 42 p. 42 The European diseases that ravaged the indigenous inhabitants of the Americas also severely affected the various Maya groups of the entire Yucatán Peninsula. Modern estimates of native population decline vary from 42% to 42% mortality. The terrible plagues that swept the peninsula were recorded in Yucatec Maya written histories, which combined with those of neighbouring Maya peoples in the ": null
    },
    {
        "Guatemalan Highlands": "guatemalan highlands"
    },
    {
        ", suggest that smallpox was rapidly transmitted throughout the Maya area the same year that it arrived in central Mexico with the forces under the command of ": null
    },
    {
        "Pánfilo Narváez": "pánfilo de narváez"
    },
    {
        ". Old World diseases are often mentioned only briefly in indigenous accounts, making it difficult to identify the exact culprit. Among the most deadly were the aforementioned smallpox, influenza, measles and a number of pulmonary diseases, including tuberculosis; the latter disease was attributed to the arrival of the Spanish by the Maya inhabitants of Yucatán.     These diseases swept through Yucatán in the 42s and 42s, with periodic recurrences throughout the 42th century. By the late 42th century, the reports of high fevers suggest the arrival of ": null
    },
    {
        "malaria": "malaria"
    },
    {
        " in the region, and ": null
    },
    {
        "yellow fever": "yellow fever"
    },
    {
        " was first reported in the mid42th century, with a terse mention in the  Chilam Balam of Chumayel  for 42 That particular outbreak was traced back to the island of ": null
    },
    {
        "Guadaloupe": "guadaloupe"
    },
    {
        " in the Caribbean, from whence it was introduced to the port city of Campeche, and from there was transmitted to Mérida. Mortality was high, with approximately 42% of the population of some Yucatec Maya settlements being wiped out. Sixteen Franciscan friars are reported to have died in Mérida, probably the majority of the  based there at the time, and who had probably numbered not much more than twenty before the outbreak. Thompson 42 p. 42 Those areas of the peninsula that experience damper conditions, particularly those possessing swamplands, became rapidly depopulated after the conquest with the introduction of malaria and other waterborne parasites. An example was the one-time well-populated province of Ecab occupying the northeastern portion of the peninsula. In 42 when Francisco de Montejo occupied the town of Conil for two months, the Spanish recorded approximately 42 houses in the town; the adult male population at the time has been conservatively estimated as 42. By 42 Spanish records show that only 42 tributaries were registered to be taxed, indicating a population drop in Conil of more than 42% in 42 years. The native population of the northeastern portion of the peninsula was almost completely eliminated within fifty years of the conquest.     In the south, conditions conducive to the spread of malaria existed throughout Petén and Belize. Thompson 42 p. 42 At the time of the fall of Nojpetén in 42 there are estimated to have been 42 Maya living around Lake Petén Itzá, including a large number of refugees from other areas. It is estimated that 42% of them died during the first ten years of colonial rule owing to a combination of disease and war. Jones 42 p. 42 Likewise, in Tabasco the population of approximately 42 was reduced by an estimated 42%, with measles, smallpox, catarrhs, dysentery and fevers being the main culprits.       The Spanish engaged in a strategy of concentrating native populations in newly founded colonial towns, or  reducciones  . Rice 42 p. 42 Native resistance to the new nucleated settlements took the form of the flight of the indigenous inhabitants into inaccessible regions such as the forest or joining neighbouring Maya groups that had not yet submitted to the Spanish. Pugh 42 p. 42 Houwald 42 p. 42 Those that remained behind in the reducciones often fell victim to contagious diseases. Houwald 42 p. 42 An example of the effect on populations of this strategy is the province of Acalan, which occupied an area spanning southern Campeche and eastern Tabasco. When Hernán Cortés passed through Acalan in 42 he estimated the population size as at least 42. In 42 the population was recorded at around 42. In 42 the population was forcibly moved to Tixchel on the Gulf coast, so as to be more easily accessible to the Spanish authorities. In 42 the Spanish recorded only 42 tribute-paying inhabitants of Tixchel, which probably had a total population of about 42. This indicates a 42% drop in population over a 42-year span. Some of the inhabitants had fled Tixchel for the forest, while others had succumbed to disease, malnutrition and inadequate housing in the Spanish reducción. Coastal reducciones, while convenient for Spanish administration, were vulnerable to pirate attacks; in the case of Tixchel, pirate attacks and contagious European diseases led to the eradication of the reducción town and the extinction of the Chontal Maya of Campeche. Among the Maya, ambush was a favoured tactic.       The 42th-century Spanish conquistadors were armed with broadswords, rapiers, crossbows, matchlocks and light artillery. Mounted conquistadors were armed with a  lance, that also served as a pike for infantrymen. A variety of halberds and ": null
    },
    {
        "bills": "bill"
    },
    {
        " were also employed. As well as the one-handed broadsword, a  long two-handed version was also used. Crossbows had  arms stiffened with hardwoods, horn, bone and cane, and supplied with a stirrup to facilitate drawing the string with a crank and pulley. Crossbows were easier to maintain than matchlocks, especially in the humid tropical climate of the Caribbean region that included much of the Yucatán Peninsula. Pohl and Hook 42 pp. 42–42       Maya warriors entered battle against the Spanish with flint-tipped spears, bows and arrows and stones. They wore ": null
    },
    {
        "padded cotton armour": "ichcahuipilli"
    },
    {
        " to protect themselves. Members of the Maya aristocracy wore quilted cotton armour, and some warriors of lesser rank wore twisted rolls of cotton wrapped around their bodies. Warriors bore wooden or animal hide shields decorated with feathers and animal skins. Wise and McBride 42 pp. 42–42          On 42 July 42 during his fourth voyage, Christopher Columbus arrived at ": null
    },
    {
        "Guanaja": "guanaja"
    },
    {
        ", one of the ": null
    },
    {
        "Bay Islands": "bay islands department"
    },
    {
        " off the coast of Honduras. He sent his brother ": null
    },
    {
        "Bartholomew": "bartholomew columbus"
    },
    {
        " to scout the island. As Bartholomew explored the island with two boats, a large canoe approached from the west, apparently en route to the island. The canoe was carved from one large tree trunk and was powered by twenty-five naked rowers. Clendinnen 42 p. 42 Curious as to the visitors, Bartholomew Columbus seized and boarded it. He found it was a Maya trading canoe from Yucatán, carrying well-dressed Maya and a rich cargo that included ": null
    },
    {
        "ceramics": "maya ceramics"
    },
    {
        ", ": null
    },
    {
        "cotton textiles": "maya textiles"
    },
    {
        ", yellow stone axes, flint-studded war clubs, ": null
    },
    {
        "copper": "metallurgy in pre-columbian mesoamerica"
    },
    {
        " axes and bells, and ": null
    },
    {
        "cacao": "cocoa bean"
    },
    {
        ". Perramon 42 p. 42 Clendinnen 42 p. 42 Also among the cargo were a small number of women and children, probably destined to be sold as slaves, as were a number of the rowers. The Europeans looted whatever took their interest from amongst the cargo and seized the elderly Maya captain to serve as an interpreter; the canoe was then allowed to continue on its way. Clendinnen 42 pp. 42–42 This was the first recorded contact between Europeans and the Maya. Sharer and Traxler 42 p. 42 It is likely that news of the piratical strangers in the Caribbean passed along the ": null
    },
    {
        "Maya trade routes": "trade in maya civilization"
    },
    {
        " – the first prophecies of bearded invaders sent by ": null
    },
    {
        "Kukulkan": "kukulkan"
    },
    {
        ", the northern Maya ": null
    },
    {
        "feathered serpent god": "feathered serpent"
    },
    {
        ", were probably recorded around this time, and in due course passed into the books of Chilam Balam. Clendinnen 42 p. 42     In 42 the Spanish caravel Santa María de la Barca set sail along the Central American coast under the command of ": null
    },
    {
        "Pedro de Valdivia": "pedro de valdivia"
    },
    {
        ". de Díos González 42 p. 42 Gómez Martín June 42 p. 42 The ship was sailing to ": null
    },
    {
        "Santo Domingo": "santo domingo"
    },
    {
        " from ": null
    },
    {
        "Darién": "darién province"
    },
    {
        " to inform the colonial authorities there of ongoing conflict between conquistadors ": null
    },
    {
        "Diego de Nicuesa": "diego de nicuesa"
    },
    {
        " and ": null
    },
    {
        "Vasco Nuñez de Balboa": "vasco nuñez de balboa"
    },
    {
        " in Darién. Gómez Martín June 42 p. 42 The ship foundered upon a reef known as Las Víboras or, alternatively, Los Alacranes , somewhere off ": null
    },
    {
        "Jamaica": "jamaica"
    },
    {
        ". There were just twenty survivors from the wreck, including Captain Valdivia, ": null
    },
    {
        "Gerónimo de Aguilar": "gerónimo de aguilar"
    },
    {
        " and ": null
    },
    {
        "Gonzalo Guerrero": "gonzalo guerrero"
    },
    {
        ". de Díos González 42 pp. 42–42 They set themselves adrift in one of the ships boats, with bad oars and no sail; after thirteen days during which half of the survivors died, they made landfall upon the coast of Yucatán. There they were seized by Halach Uinik, a Maya lord. Captain Vildivia was ": null
    },
    {
        "sacrificed": "human sacrifice in maya culture"
    },
    {
        " with four of his companions, and their flesh was served at a feast. Aguilar and Guerrero were held prisoner and ": null
    },
    {
        "fattened for killing": "cannibalism in pre-columbian america"
    },
    {
        ", together with five or six of their shipmates. Aguilar and Guerrero managed to escape their captors and fled to a neighbouring lord who was an enemy of Halach Uinik; he took them prisoner and kept them as slaves. After a time, Gonzalo Guerrero was passed as a slave to the lord Nachan Can of Chetumal. Guerrero became completely Mayanised and served his new lord with such loyalty that he was married to one of Nachan Chans daughters, Zazil Ha, by whom he had three children. By 42 Guerrero had achieved the rank of nacom, a war leader who served against Nachan Chans enemies. de Díos González 42 p. 42          In 42 Francisco Hernández de Córdoba set sail from Cuba with a small fleet, consisting of two ": null
    },
    {
        "caravel": "caravel"
    },
    {
        "s and a ": null
    },
    {
        "brigantine": "brigantine"
    },
    {
        ", with the dual intention of exploration and of rounding up slaves. Clendinnen 42 pp. 42–42 The experienced ": null
    },
    {
        "Antón de Alaminos": "antón de alaminos"
    },
    {
        " served as pilot; he had previously served as pilot under Christopher Columbus on his final voyage. Also among the approximately 42-strong expedition members was ": null
    },
    {
        "Bernal Díaz del Castillo": "bernal díaz del castillo"
    },
    {
        ". Clendinnen 42 pp. 42 The expedition sailed west from Cuba for three weeks, and weathered a two-day storm a week before sighting the coast of the northeastern tip of the Yucatán Peninsula. The ships could not put in close to the shore due to the shallowness of the coastal waters. However, they could see a Maya city some two ": null
    },
    {
        "leagues": "league"
    },
    {
        " inland, upon a low hill. The Spanish called it Gran Cairo due to its size and its ": null
    },
    {
        "pyramids": "mesoamerican pyramids"
    },
    {
        ". Clendinnen 42 pp. 42 Although the location is not now known with certainty, it is believed that this first sighting of Yucatán was at ": null
    },
    {
        "Isla Mujeres": "isla mujeres"
    },
    {
        ".     The following morning, the Spanish sent the two ships with a shallower ": null
    },
    {
        "draught": "draught"
    },
    {
        " to find a safe approach through the shallows. The caravels anchored about one league from the shore. Ten large canoes powered by both sails and oars rowed out to meet the Spanish ships. Over thirty Maya boarded the vessels and mixed freely with the Spaniards. The Maya visitors accepted gifts of beads, and the leader indicated with signs that they would return to take the Spanish ashore the following day.     The Maya leader returned the following day with twelve canoes, as promised. The Spanish could see from afar that the shore was packed with natives. The conquistadors put ashore in the brigantine and the ships boats; a few of the more daring Spaniards boarded the native canoes. The Spanish named the headland Cape Catoche, after some words spoken by the Maya leader, which sounded to the Spanish like cones catoche. Once ashore, the Spaniards clustered loosely together and advanced towards the city along a path among low, scrub-covered hillocks. At this point the Maya leader gave a shout and the Spanish party was ambushed by Maya warriors armed with spears, bows and arrows, and stones. Thirteen Spaniards were injured by arrows in the first assault, but the conquistadors regrouped and repulsed the Maya attack. They advanced to a small plaza bordered by temples upon the outskirts of the city. Clendinnen 42 p. 42 When the Spaniards ransacked the temples they found a number of low-grade gold items, which filled them with enthusiasm. The expedition captured two Mayas to be used as interpreters and retreated to the ships. Over the following days the Spanish discovered that although the Maya arrows had struck with little force, the flint arrowheads tended to shatter on impact, causing infected wounds and a slow death; two of the wounded Spaniards died from the arrow-wounds inflicted in the ambush. Clendinnen 42 p. 42        Over the next fifteen days the fleet slowly followed the coastline west, and then south. The casks brought from Cuba were leaking and the expedition was now running dangerously low on fresh water; the hunt for more became an overriding priority as the expedition advanced, and shore parties searching for water were left dangerously exposed because the ships could not pull close to the shore due to the shallows. Clendinnen 42 pp. 42–42 On 42 February 42 the day of Saint Lazarus, another city was spotted and named San Lázaro by the Spanish – it is now known by its original Maya name, Campeche. A large contingent put ashore in the brigantine and the ships boats to fill their water casks in a freshwater pool. They were approached by about fifty finely dressed and unarmed Indians while the water was being loaded into the boats; they questioned the Spaniards as to their purpose by means of signs. The Spanish party then accepted an invitation to enter the city. Clendinnen 42 p. 42 They were led amongst large buildings until they stood before a blood-caked altar, where many of the citys inhabitants crowded around. The Indians piled reeds before the visitors; this act was followed by a procession of armed Maya warriors in full war paint, followed by ten Maya priests. The Maya set fire to the reeds and indicated that the Spanish would be killed if they were not gone by the time the reeds had been consumed. The Spanish party withdrew in defensive formation to the shore and rapidly boarded their boats to retreat to the safety of the ships. Clendinnen 42 pp. 42–42     The small fleet continued for six more days in fine weather, followed by four stormy days. Clendinnen 42 p. 42 By this time water was once again dangerously short. Clendinnen 42 pp. 42–42 The ships spotted an inlet close to another city, Champotón, Sharer and Traxler 42 p. 42 and a landing party discovered fresh water. Armed Maya warriors approached from the city while the water casks were being filled. Communication was once again attempted with signs. Night fell by the time the water casks had been filled and the attempts at communication concluded. In the darkness the Spaniards could hear the movements of large numbers of Maya warriors. They decided that a night-time retreat would be too risky; instead, they posted guards and waited for dawn. At sunrise, the Spanish saw that they had been surrounded by a sizeable army. The massed Maya warriors launched an assault with missiles, including arrows, darts and stones; they then charged into hand-to-hand combat with spears and clubs. Eighty of the defenders were wounded in the initial barrage of missiles, and two Spaniards were captured in the frantic mêlée that followed. All of the Spanish party received wounds, including Hernández de Córdoba. The Spanish regrouped in a defensive formation and forced passage to the shore, where their discipline collapsed and a frantic scramble for the boats ensued, leaving the Spanish vulnerable to the pursuing Maya warriors who waded into the sea behind them. Most of the precious water casks were abandoned on the beach. Clendinnen 42 p. 42 When the surviving Spanish reached the safety of the ships, they realised that they had lost over fifty men, more than half their number. Clendinnen 42 p. 42 Five men died from their wounds in the following days. Clendinnen 42 pp. 42–42 The battle had lasted only an hour, and the Spanish named the locale as the Coast of the Disastrous Battle. They were now far from help and low on supplies; too many men had been lost and injured to sail all three ships back to Cuba. They decided to abandon their smallest ship, the brigantine, although it was purchased on credit from ": null
    },
    {
        "Governor Velásquez": "diego velázquez de cuéllar"
    },
    {
        " of Cuba.        The few men who had not been wounded because they were manning the ships during the battle were reinforced with three men who had suffered relatively minor wounds; they put ashore at a remote beach to dig for water. They found some and brought it back to the ships, although it sickened those who drank it. Clendinnen 42 pp. 42–42 The two ships sailed through a storm for two days and nights; Alaminos, the pilot, then steered a course for Florida, where they found good drinking water, although they lost one man to the local Indians and another drank so much water that he died. The ships finally made port in Cuba, where Hernández de Cordóba wrote a report to Governor Velázquez describing the voyage, the cities, the plantations, and, most importantly, the discovery of gold. Hernández died soon after from his wounds. Clendinnen 42 p. 42 The two captured Maya survived the voyage to Cuba and were interrogated; they swore that there was abundant gold in Yucatán. Clendinnen 42 p. 42     Based upon Hernández de Córdobas report and the testimony of the interrogated Indian prisoners, Governor Velázquez wrote to the ": null
    },
    {
        "Council of the Indies": "council of the indies"
    },
    {
        " notifying it of his discovery.       Diego Velázquez, the governor of Cuba, was enthused by Hernández de Córdobas report of gold in Yucatán. He organised a new expedition consisting of four ships and 42 men. Sharer and Traxler 42 p. 42 Clendinnen 42 p. 42 He placed his nephew Juan de Grijalva in command. ": null
    },
    {
        "Francisco de Montejo": "francisco de montejo"
    },
    {
        ", who would eventually conquer much of the peninsula, was captain of one of the ships; Sharer and Traxler 42 p. 42 Recinos 42 p. 42 ": null
    },
    {
        "Pedro de Alvarado": "pedro de alvarado"
    },
    {
        " and ": null
    },
    {
        "Alonso dAvila": "alonso davila"
    },
    {
        " captained the other ships. Recinos 42 p. 42 Bernal Díaz del Castillo served on the crew; he was able to secure a place on the expedition as a favour from the governor, who was his kinsman. Clendinnen 42 p. 42 Antón de Alaminos once again served as pilot. Sharer and Traxler 42 p. 42 Governor Velázquez provided all four ships, in an attempt to protect his claim over the peninsula. The small fleet was stocked with crossbows, muskets, barter goods, salted pork and ": null
    },
    {
        "cassava bread": "cassava bread"
    },
    {
        ". Clendinnen 42 pp. 42–42 Grijalva also took one of the captured Indians from the Hernández expedition.        The fleet left Cuba in April 42 and made its first landfall upon the island of Cozumel, off the east coast of Yucatán. The Maya inhabitants of Cozumel fled the Spanish and would not respond to Grijalvas friendly overtures. The fleet sailed south from Cozumel, along the east coast of the peninsula. Sharer and Traxler 42 p. 42 Clendinnen 42 p. 42 The Spanish spotted three large Maya cities along the coast, one of which was probably ": null
    },
    {
        "Tulum": "tulum"
    },
    {
        ". On ": null
    },
    {
        "Ascension Thursday": "feast of the ascension"
    },
    {
        " the fleet discovered a large bay, which the Spanish named Bahía de la Ascensión. Grijalva did not land at any of these cities and turned back north from Ascensión Bay. He looped around the north of the Yucatán Peninsula to sail down the west coast. At Campeche the Spanish tried to barter for water but the Maya refused, so Grijalva opened fire against the city with small cannon; the inhabitants fled, allowing the Spanish to take the abandoned city. Messages were sent with a few Maya who had been too slow to escape but the Maya remained hidden in the forest. The Spanish boarded their ships and continued along the coast.     At Champotón, where the inhabitants had routed Hernández and his men, the fleet was approached by a small number of large war canoes, but the ships cannon soon put them to flight. At the mouth of the ": null
    },
    {
        "Tabasco River": "tabasco river"
    },
    {
        " the Spanish sighted massed warriors and canoes but the natives did not approach. Clendinnen 42 pp. 42–42 By means of interpreters, Grijalva indicated that he wished to trade and bartered wine and beads in exchange for food and other supplies. From the natives they received a few gold trinkets and news of the riches of the Aztec Empire to the west. The expedition continued far enough to confirm the reality of the gold-rich empire, Clendinnen 42 p. 42 sailing as far north as ": null
    },
    {
        "Pánuco River": "pánuco river"
    },
    {
        ". As the fleet returned to Cuba, the Spanish attacked Champotón to avenge the previous years defeat of the Spanish expedition led by Hernández. One Spaniard was killed and fifty were wounded in the ensuing battle, including Grijalva. Grijalva put into the port of ": null
    },
    {
        "Havana": "havana"
    },
    {
        " five months after he had left.          Grijalvas return aroused great interest in Cuba, and Yucatán was believed to be a land of riches waiting to be plundered. A new expedition was organised, with a fleet of eleven ships carrying 42 men and some horses. Hernán Cortés was placed in command, and his crew included officers that would become famous conquistadors, including ": null
    },
    {
        "Pedro de Alvarado": "pedro de alvarado"
    },
    {
        ", ": null
    },
    {
        "Cristóbal de Olid": "cristóbal de olid"
    },
    {
        ", ": null
    },
    {
        "Gonzalo de Sandoval": "gonzalo de sandoval"
    },
    {
        " and ": null
    },
    {
        "Diego de Ordaz": "diego de ordaz"
    },
    {
        ". Also aboard were Francisco de Montejo and Bernal Díaz del Castillo, veterans of the Grijalva expedition.     The fleet made its first landfall at Cozumel, and Cortés remained there for several days. Maya temples were cast down and a Christian cross was put up on one of them. At Cozumel, Cortés heard rumours of bearded men on the Yucatán mainland, who he presumed were Europeans. Sharer and Traxler 42 pp. 42–42 Cortés sent out messengers to them and was able to rescue the shipwrecked Gerónimo de Aguilar, who had been enslaved by a Maya lord. Aguilar had learnt the Yucatec Maya language and became Cortés interpreter. Sharer and Traxler 42 pp. 42–42 42–42     From Cozumel, the fleet looped around the north of the Yucatán Peninsula and followed the coast to the Tabasco River, which Cortés renamed as the Grijalva River in honour of the Spanish captain who had discovered it. In Tabasco, Cortés anchored his ships at ": null
    },
    {
        "Potonchán": "potonchán"
    },
    {
        ", Townsend 42 p. 42 a Chontal Maya town. Hernández et al. 42 p. 42 The Maya prepared for ": null
    },
    {
        "battle": "potonchánbattle of centla"
    },
    {
        " but the Spanish horses and firearms quickly decided the outcome. The defeated Chontal Maya lords offered gold, food, clothing and a group of young women in tribute to the victors. Among these women was a young Maya noblewoman called ": null
    },
    {
        "Malintzin": "la malinche"
    },
    {
        ", who was given the Spanish name Marina. She spoke Maya and ": null
    },
    {
        "Nahuatl": "nahuatl"
    },
    {
        " and became the means by which Cortés was able to communicate with the Aztecs. Sharer and Traxler 42 p. 42 Marina became Cortés consort and eventually bore him a son. From Tabasco, Cortés continued to ": null
    },
    {
        "Cempoala": "cempoala"
    },
    {
        " in Veracruz, a subject city of the ": null
    },
    {
        "Aztec Empire": "aztec empire"
    },
    {
        ", and from there on to conquer the Aztecs. Townsend 42 pp. 42ff.     In 42 Cortés sent the veteran Francisco de Montejo back to Spain with treasure for the king. While he was in Spain, Montejo pleaded Cortés cause against the supporters of Diego de Velásquez. Montejo remained in Spain for seven years, and eventually succeeded in acquiring the hereditary military title of adelantado. Sharer and Traxler 42 p. 42       In 42 after the Spanish conquest of the Aztec Empire, Hernán Cortés led an expedition to Honduras over land, cutting across Acalan in southern Campeche and the ": null
    },
    {
        "Itza": "itza people"
    },
    {
        " kingdom in what is now the northern Petén Department of Guatemala. Jones 42 p. 42 His aim was to subdue the rebellious Cristóbal de Olid, whom he had sent to conquer Honduras; Olid had, however, set himself up independently on his arrival in that territory. Cortés left ": null
    },
    {
        "Tenochtitlan": "tenochtitlan"
    },
    {
        " on 42 October 42 with 42 Spanish soldiers, 42 of them mounted, 42 Mexican warriors, 42 horses, a herd of pigs, artillery, munitions and other supplies. He also had with him the captured Aztec emperor ": null
    },
    {
        "Cuauhtemoc": "cuauhtemoc"
    },
    {
        ", and ": null
    },
    {
        "Cohuanacox": "coanacoch"
    },
    {
        " and ": null
    },
    {
        "Tetlepanquetzal": "tetlepanquetzal"
    },
    {
        ", the captive Aztec lords of ": null
    },
    {
        "Texcoco": "texcoco"
    },
    {
        " and ": null
    },
    {
        "Tlacopan": "tlacopan"
    },
    {
        ". Cortés marched into Maya territory in Tabasco; the army crossed the ": null
    },
    {
        "Usumacinta River": "usumacinta river"
    },
    {
        " near ": null
    },
    {
        "Tenosique": "tenosique"
    },
    {
        " and crossed into the Chontal Maya province of Acalan, where he recruited 42 ": null
    },
    {
        "Chontal Maya": "chontal maya people"
    },
    {
        " carriers. In Acalan, Cortés believed that the captive Aztec lords were plotting against him and he ordered Cuauhtemoc and Tetlepanquetzal to be hanged. Cortés and his army left Acalan on 42 March 42     The expedition passed onwards through Kejache territory and reported that the Kejache towns were situated in easily defensible locations and were often fortified. Rice and Rice 42 p. 42 One of these was built on a rocky outcrop near a lake and a river that fed into it. The town was fortified with a wooden palisade and was surrounded by a moat. Cortés reported that the town of Tiac was even larger and was fortified with walls, watchtowers and earthworks; the town itself was divided into three individually fortified districts. Tiac was said to have been at war with the unnamed smaller town. Rice et al. 42 p. 42 The Kejache claimed that their towns were fortified against the attacks of their aggressive Itza neighbours. Rice and Rice 42 p. 42     They arrived at the north shore of Lake Petén Itzá on 42 March 42 Sharer and Traxler 42 pp. 42–42 The Roman Catholic priests accompanying the expedition celebrated mass in the presence of ": null
    },
    {
        "Aj Kan Ekʼ": "kan ekʼ"
    },
    {
        ", the king of the Itza, who was said to be so impressed that he pledged to worship the cross and to destroy his idols. Sharer and Traxler 42 p. 42 Cortés accepted an invitation from Kan Ekʼ to visit Nojpetén , and crossed to the Maya city with 42 Spanish soldiers while the rest of his army continued around the lake to meet him on the south shore. Sharer and Traxler 42 p. 42 Jones 42 p. 42 On his departure from Nojpetén, Cortés left behind a cross and a lame horse that the Itza treated as a deity, attempting to feed it poultry, meat and flowers, but the animal soon died. Sharer and Traxler 42 p. 42 Jones 42 p. 42 The Spanish did not officially contact the Itza again until the arrival of ": null
    },
    {
        "Franciscan": "franciscan"
    },
    {
        " priests in 42 when Cortés cross was said to still be standing at Nojpetén.     From the lake, Cortés continued south along the western slopes of the ": null
    },
    {
        "Maya Mountains": "maya mountains"
    },
    {
        ", a particularly arduous journey that took 42 days to cover , during which he lost more than two-thirds of his horses. When he came to a river swollen with the constant torrential rains that had been falling during the expedition, Cortés turned upstream to the Gracias a Dios rapids, which took two days to cross and cost him more horses.     On 42 April 42 the expedition arrived at the Maya village of Tenciz. With local guides they headed into the hills north of ": null
    },
    {
        "Lake Izabal": "lake izabal"
    },
    {
        ", where their guides abandoned them to their fate. The expedition became lost in the hills and came close to starvation before they captured a Maya boy who led them to safety. Cortés found a village on the shore of Lake Izabal, perhaps Xocolo. He crossed the ": null
    },
    {
        "Dulce River": "dulce river"
    },
    {
        " to the settlement of Nito, somewhere on the Amatique Bay, Feldman 42 p. 42 with about a dozen companions, and waited there for the rest of his army to regroup over the next week. By this time the remnants of the expedition had been reduced to a few hundred; Cortés succeeded in contacting the Spaniards he was searching for, only to find that Cristóbal de Olids own officers had already put down his rebellion. Cortés then returned to Mexico by sea. Webster 42 p. 42          The richer lands of Mexico engaged the main attention of the conquistadors for some years, then in 42 Francisco de Montejo successfully petitioned the King of Spain for the right to conquer Yucatán. On 42 December of that year he was issued with the hereditary military title of  adelantado  and permission to colonise the Yucatán Peninsula. Sharer and Traxler 42 pp. 42–42 In 42 he left Spain with 42 men in four ships, with horses, small arms, cannon and provisions. Sharer and Traxler 42 p. 42 Clendinnen 42 p. 42 He set sail for Santo Domingo, where more supplies and horses were collected, allowing Montejo to increase his cavalry to fifty. Clendinnen 42 p. 42 One of the ships was left at Santo Domingo as a supply ship to provide later support; the other ships set sail and reached Cozumel in the second half of September 42 Montejo was received in peace by the lord of Cozumel, Aj Naum Pat, but the ships only stopped briefly before making for the Yucatán coast. The expedition made landfall somewhere near Xelha in the Maya province of ": null
    },
    {
        "Ekab": "ekab"
    },
    {
        ", Sharer and Traxler 42 p. 42 in what is now Mexicos ": null
    },
    {
        "Quintana Roo": "quintana roo"
    },
    {
        " state. ITMB 42     Montejo garrisoned Xelha with 42 soldiers under his second-in-command, Alonso dAvila, and posted 42 more at nearby Pole. Xelha was renamed ": null
    },
    {
        "Salamanca de Xelha": "salamanca de xelha"
    },
    {
        " and became the first Spanish settlement on the peninsula. The provisions were soon exhausted and additional food was seized from the local Maya villagers; this too was soon consumed. Many local Maya fled into the forest and Spanish raiding parties scoured the surrounding area for food, finding little. Clendinnen 42 p. 42 With discontent growing among his men, Montejo took the drastic step of burning his ships; this strengthened the resolve of his troops, who gradually acclimatised to the harsh conditions of Yucatán. Sharer and Traxler 42 p. 42 Clendinnen 42 42 p. 42 Montejo was able to get more food from the still-friendly Aj Nuam Pat, when the latter made a visit to the mainland. Montejo took 42 men and set out on an expedition to explore the north-eastern portion of the Yucatán peninsula. His expedition passed through the towns of Xamanha, Mochis and Belma, none of which survives today. At Belma, Montejo gathered the leaders of the nearby Maya towns and ordered them to swear loyalty to the Spanish Crown. After this, Montejo led his men to Conil, a town in Ekab that was described as having 42 houses, where the Spanish party halted for two months.     In the spring of 42 Montejo left Conil for the city of ": null
    },
    {
        "Chauaca": "chauaca"
    },
    {
        ", which was abandoned by its Maya inhabitants under cover of darkness. The following morning, the inhabitants attacked the Spanish party but were defeated. The Spanish then continued to Ake, some  north of ": null
    },
    {
        "Tizimín": "tizimín"
    },
    {
        ", where they engaged in a major battle against the Maya, killing more than 42 of them. After this Spanish victory, the neighbouring Maya leaders all surrendered. Montejos party then continued to Sisia and Loche before heading back to Xelha. Montejo arrived at Xelha with only 42 of his party, and found that only 42 of his 42-man garrison survived, while the garrison at Pole had been entirely wiped out. Sharer and Traxler 42 pp. 42–42     The support ship eventually arrived from Santo Domingo, and Montejo used it to sail south along the coast, while he sent DAvila over land. Montejo discovered the thriving port city of Chaktumal . Sharer and Traxler 42 p. 42 Clendinnen 42 p. 42 At Chaktumal, Montejo learnt that shipwrecked Spanish sailor Gonzalo de Guerrero was in the region, and Montejo sent messages to him, inviting him to return to join his compatriots, but the Mayanised Guerrero declined. Sharer and Traxler 42 p. 42     The Maya at Chaktumal fed false information to the Spanish, and Montejo was unable to find dAvila and link up with him. DAvila returned overland to Xelha, and transferred the fledgling Spanish colony to nearby Xamanha, modern ": null
    },
    {
        "Playa del Carmen": "playa del carmen"
    },
    {
        ", which Montejo considered to be a better port. After waiting for dAvila without result, Montejo sailed south as far as the ": null
    },
    {
        "Ulúa River": "ulúa river"
    },
    {
        " in Honduras before turning around and heading back up the coast to finally meet up with his lieutenant at Xamanha. Late in 42 Montejo left dAvila to oversee Xamanha and sailed north to loop around the Yucatán Peninsula and head for the Spanish colony of New Spain in central Mexico.       Montejo was appointed  alcalde mayor  of Tabasco in 42 and pacified that province with the aid of his son, also named Francisco de Montejo. DAvila was sent from eastern Yucatán to conquer Acalan, which extended southeast of the ": null
    },
    {
        "Laguna de Terminos": "laguna de terminos"
    },
    {
        ". Montejo the Younger founded ": null
    },
    {
        "Salamanca de Xicalango": "salamanca de xicalango"
    },
    {
        " as a base of operations. In 42 DAvila established Salamanca de Acalán as a base from which to launch new attempts to conquer Yucatán. Quezada 42 p. 42 Salamanca de Acalán proved a disappointment, with no gold for the taking and with lower levels of population than had been hoped. DAvila soon abandoned the new settlement and set off across the lands of the Kejache to Champotón, arriving there towards the end of 42 Quezada 42 pp. 42–42 During a colonial power struggle in Tabasco, the elder Montejo was imprisoned for a time. Upon his release, he met up with his son in ": null
    },
    {
        "Xicalango": "xicalango"
    },
    {
        ", Tabasco, and they then both rejoined dAvila at Champotón.     In 42 Montejo moved his base of operations to ": null
    },
    {
        "Campeche": "campeche"
    },
    {
        ". Clendinnen 42 p. 42 Sharer and Traxler 42 p. 42 Alonso dAvila was sent overland to Chauaca in the east of the peninsula, passing through Maní where he was well received by the ": null
    },
    {
        "Xiu Maya": "xiu maya"
    },
    {
        ". DAvila continued southeast to Chetumal where he founded the Spanish town of Villa Real . The local Maya fiercely resisted the placement of the new Spanish colony and dAvila and his men were forced to abandon Villa Real and make for Honduras in canoes.     At Campeche, the Maya amassed a strong force and attacked the city; the Spanish were able to fight them off, a battle in which the elder Montejo was almost killed. Sharer and Traxler 42 pp. 42–42 Aj Canul, the lord of the attacking Maya, surrendered to the Spanish. After this battle, the younger Francisco de Montejo was despatched to the northern Cupul province, where the lord Naabon Cupul reluctantly allowed him to found the Spanish town of Ciudad Real at Chichen Itza. Montejo carved up the province amongst his soldiers and gave each of his men two to three thousand Maya in  encomienda . After six months of Spanish rule, Cupul dissatisfaction could no longer be contained and Naabon Cupul was killed during a failed attempt to kill Montejo the Younger. The death of their lord only served to inflame Cupul anger and, in mid 42 they laid siege to the small Spanish garrison at Chichen Itza. Montejo the Younger abandoned Ciudad Real by night after arranging a distraction for their attackers, and he and his men fled west, where the ": null
    },
    {
        "Chel": "cheles"
    },
    {
        ", ": null
    },
    {
        "Pech": "ceh pech"
    },
    {
        " and Xiu provinces remained obedient to Spanish rule. Montejo the Younger was received in friendship by Namux Chel, the lord of the Chel province, at ": null
    },
    {
        "Dzilam": "dzilam"
    },
    {
        ". In the spring of 42 he rejoined his father in the Chakan province at ": null
    },
    {
        "Dzikabal": "dzikabal"
    },
    {
        ", near Tʼho . Sharer and Traxler 42 p. 42     While his son had been attempting to consolidate the Spanish control of Cupul, Francisco de Montejo the Elder had met the Xiu ruler at Maní. The Xiu Maya maintained their friendship with the Spanish throughout the conquest and Spanish authority was eventually established over Yucatán in large part due to Xiu support. The Montejos, after reuniting at Dzikabal, founded a new Spanish town at Dzilam, although the Spanish suffered hardships there. Montejo the Elder returned to Campeche, where he was received with friendship by the local Maya. He was accompanied by the friendly Chel lord Namux Chel, who travelled on horseback, and two of the lords cousins, who were taken in chains. Sharer and Traxler 42 pp. 42–42 Montejo the Younger remained behind in Dzilam to continue his attempts at conquest of the region but, finding the situation too difficult, he soon retreated to Campeche to rejoin his father and Alonso dAvila, who had returned to Campeche shortly before Montejo the Younger. Around this time, the news began to arrive of ": null
    },
    {
        "Francisco Pizarro": "francisco pizarro"
    },
    {
        "s conquests in Peru and the rich plunder that his soldiers were taking there, undermining the morale of Montejos already disenchanted band of followers. Montejos soldiers began to abandon him to seek their fortune elsewhere; in seven years of attempted conquest in the northern provinces of the Yucatán Peninsula, very little gold had been found. Towards the end of 42 or the beginning of the next year, Montejo the Elder and his son retreated from Campeche to Veracruz, taking their remaining soldiers with them. Sharer and Traxler 42 p. 42     Montejo the Elder became embroiled in colonial infighting over the right to rule Honduras, a claim that put him in conflict with Pedro de Alvarado, captain general of Guatemala, who also claimed Honduras as part of his jurisdiction. Alvarados claim ultimately turned out successful. In Montejo the Elders absence, first in central Mexico, and then in Honduras, Montejo the Younger acted as lieutenant governor and captain general in Tabasco.       The Franciscan ": null
    },
    {
        "friar": "friar"
    },
    {
        " Jacobo de Testera": "jacobo de testera"
    },
    {
        " arrived in Champoton in 42 to attempt the peaceful incorporation of Yucatán into the Spanish Empire. Testera had been assured by the Spanish authorities that no military activity would be undertaken in Yucatán, while he was attempting its conversion to the Roman Catholic faith, and that no soldiers would be permitted to enter the peninsula. His initial efforts were proving successful when Captain Lorenzo de Godoy arrived in Champoton at the command of soldiers despatched there by Montejo the Younger. Godoy and Testera were soon in conflict and the friar was forced to abandon Champoton and return to central Mexico.     Godoys attempt to subdue the Maya around Champoton was unsuccessful and the local ": null
    },
    {
        "Kowoj Maya": "kowoj maya"
    },
    {
        " resisted his attempts to assert Spanish dominance of the region. Sharer and Traxler 42 pp. 42–42 This resistance was sufficiently tenacious that Montejo the Younger sent his cousin from Tabasco to Champoton to take command. His diplomatic overtures to the Champoton Kowoj were successful and they submitted to Spanish rule. Champoton was the last Spanish outpost in the Yucatán Peninsula; it was increasingly isolated and the situation there became difficult. Sharer and Traxler 42 p. 42             In 42 Montejo the Elder, who was now in his late 42s, turned his royal rights to colonise Yucatán over to his son, Francisco de Montejo the Younger. In early 42 Montejo the Younger joined his cousin in Champoton; he did not remain there long, and quickly moved his forces to Campeche. Once there, Montejo the Younger, commanding between three and four hundred Spanish soldiers, established the first permanent Spanish town council in the Yucatán Peninsula. Shortly after establishing the Spanish presence in Campeche, Montejo the Younger summoned the local Maya lords and commanded them to submit to the Spanish Crown. A number of lords submitted peacefully, including the ruler of the Xiu Maya. The lord of the ": null
    },
    {
        "Canul Maya": "canul maya"
    },
    {
        " refused to submit and Montejo the Younger sent his cousin against them; Montejo himself remained in Campeche awaiting reinforcements.     Montejo the Youngers cousin met the Canul Maya at Chakan, not far from Tʼho. On 42 January 42 he founded the second permanent town council, calling the new colonial town Mérida. On 42 January, Tutul Xiu, the lord of Mani, approached the Spanish encampment at Mérida in peace, bearing sorely needed food supplies. He expressed interest in the Spanish religion and witnessed a Roman Catholic mass celebrated for his benefit. Tutul Xiu was greatly impressed and converted to the new religion; he was baptised as Melchor and stayed with the Spanish at Mérida for two months, receiving instruction in the Catholic faith. Tutul Xiu was the ruler of the most powerful province of northern Yucatán and his submission to Spain and conversion to Christianity had repercussions throughout the peninsula, and encouraged the lords of the western provinces of the peninsula to accept Spanish rule. The eastern provinces continued to resist Spanish overtures. Sharer and Traxler 42 p. 42     Montejo the Younger next sent his cousin to Chauaca where most of the eastern lords greeted him in peace. The ": null
    },
    {
        "Cochua Maya": "cochua maya"
    },
    {
        " resisted fiercely but were soon defeated by the Spanish. The Cupul Maya also rose up against the newly imposed Spanish domination, and also their opposition was quickly put down. Montejo continued to the eastern Ekab province, reaching the east coast at Pole. Stormy weather prevented the Spanish from crossing to Cozumel, and nine Spaniards drowned in the attempted crossing. Another Spanish conquistador was killed by hostile Maya. Rumours of this setback grew in the telling and both the Cupul and Cochua provinces once again rose up against their would-be European overlords. The Spanish hold on the eastern portion of the peninsula remained tenuous and a number of Maya polities remained independent, including Chetumal, Cochua, Cupul, Sotuta and the Tazes.     On 42 November 42 an alliance of eastern provinces launched a coordinated uprising against the Spanish. The provinces of Cupul, Cochua, Sotuta, Tazes, Uaymil, Chetumal and Chikinchel united in a concerted effort to drive the invaders from the peninsula; the uprising lasted four months. Caso Barrera 42 pp. 42 42 Eighteen Spaniards were surprised in the eastern towns, and were ": null
    },
    {
        "sacrificed": "human sacrifice"
    },
    {
        ". A contemporary account described the slaughter of over 42 allied Maya, as well as livestock. Mérida and Campeche were forewarned of the impending attack; Montejo the Younger and his cousin were in Campeche. Montejo the Elder arrived in Mérida from ": null
    },
    {
        "Chiapas": "chiapas"
    },
    {
        " in December 42 with reinforcements gathered from Champoton and Campeche. The rebellious eastern Maya were finally defeated in a single battle, in which twenty Spaniards and several hundred allied Maya were killed. This battle marked the final conquest of the northern portion of the Yucatán Peninsula. As a result of the uprising and the Spanish response, many of the Maya inhabitants of the eastern and southern territories fled to the still unconquered Petén Basin, in the extreme south of the peninsula. The Spanish only achieved dominance in the north and the polities of Petén remained independent and continued to receive many refugees from the north. Caso Barrera 42 p. 42          The Petén Basin covers an area that is now part of Guatemala; in colonial times it originally fell under the jurisdiction of the Governor of Yucatán, before being transferred to the jurisdiction of the ": null
    },
    {
        "Audiencia Real": "audiencia real"
    },
    {
        " of Guatemala in 42 Fialko Coxemans 42 pp. 42–42 The Itza kingdom centred upon Lake Petén Itzá had been visited by Hernán Cortés on his march to Honduras in 42          Following Cortés visit, no Spanish attempted to visit the warlike Itza inhabitants of Nojpetén for almost a hundred years. In 42 two Franciscan friars set out from Mérida on a mission to attempt the peaceful conversion of the still-pagan Itza in central Petén. Bartolomé de Fuensalida and Juan de Orbita were accompanied by some Christianised Maya. After an arduous six-month journey the travellers were well received at Nojpetén by the current Kan Ekʼ. They stayed for some days in an attempt to evangelise the Itza, but the Aj Kan Ekʼ refused to renounce his ": null
    },
    {
        "Maya religion": "maya religion"
    },
    {
        ", although he showed interest in the masses held by the Catholic missionaries. Attempts to convert the Itza failed, and the friars left Nojpetén on friendly terms with Kan Ekʼ. Sharer and Traxler 42 p. 42 The friars returned in October 42 and again Kan Ekʼ welcomed them in a friendly manner, but this time the ": null
    },
    {
        "Maya priesthood": "maya priesthood"
    },
    {
        " were hostile and the missionaries were expelled without food or water, but survived the journey back to Mérida. Sharer and Traxler 42 p. 42     In March 42 the governor of Yucatán, ": null
    },
    {
        "Diego de Cardenas": "diego de cardenas"
    },
    {
        ", ordered Captain Francisco de Mirones Lezcano to launch an assault upon the Itza; he set out from Yucatán with 42 Spanish soldiers and 42 Mayas from Yucatán. Sharer and Traxler 42 p. 42 Jones 42 p. 42 Chuchiak IV 42 p. 42 His expedition was later joined by Franciscan friar Diego Delgado. In May the expedition advanced to Sakalum, southwest of Bacalar, where there was a lengthy delay while they waited for reinforcements. Jones 42 pp. 42 42 En route to Nojpetén, Delgado believed that the soldiers treatment of the Maya was excessively cruel, and he left the expedition to make his own way to Nojpetén with eighty Christianised Maya from ": null
    },
    {
        "Tipuj": "tipu, belize"
    },
    {
        " in Belize. In the meantime the Itza had learnt of the approaching military expedition and had become hardened against further Spanish missionary attempts. Chuchiak IV 42 p. 42 When Mirones learnt of Delgados departure, he sent 42 soldiers to persuade him to return or continue as his escort should he refuse. The soldiers caught up with him just before Tipuj, but he was determined to reach Nojpetén. Means 42 p. 42 From Tipuj, Delgado sent a messenger to Kan Ekʼ, asking permission to travel to Nojpetén; the Itza king replied with a promise of safe passage for the missionary and his companions. The party was initially received in peace at the Itza capital, Means 42 p. 42 but as soon as the Spanish soldiers let their guard down, the Itza seized and bound the new arrivals. Means 42 p. 42 The soldiers were ": null
    },
    {
        "sacrificed": "sacrifice in maya culture"
    },
    {
        " to the ": null
    },
    {
        "Maya gods": "list of maya gods and supernatural beings"
    },
    {
        ". Sharer and Traxler 42 p. 42 Means 42 p. 42 After their sacrifice, the Itza took Delgado, cut his heart out and dismembered him; they displayed his head on a stake with the others. Means 42 p. 42 Jones 42 pp. 42–42 The fortune of the leader of Delgados Maya companions was no better. With no word from Delgados escort, Mirones sent two Spanish soldiers with a Maya scout to learn their fate. When they arrived upon the shore of Lake Petén Itzá, the Itza took them across to their island capital and imprisoned them. Bernardino Ek, the scout, escaped and returned to Mirones with the news. Soon afterwards, on 42 January 42 an Itza war party led by AjKʼin Pʼol caught Mirones and his soldiers off guard and unarmed in the church at Sakalum, Sharer and Traxler 42 p. 42 Jones 42 p. 42 and killed them all. Spanish reinforcements arrived too late. A number of local Maya men and women were killed by Spanish attackers, who also burned the town. Jones 42 p. 42     Following these killings, Spanish garrisons were stationed in several towns in southern Yucatán, and rewards were offered for the whereabouts of AjKʼin Pʼol. The Maya governor of ": null
    },
    {
        "Oxkutzcab": "oxkutzcab municipality"
    },
    {
        ", Fernando Kamal, set out with 42 Maya archers to track the warleader down; they succeeded in capturing the Itza captain and his followers, together with silverware from the looted Sakalum church and items belonging to Mirones. The prisoners were taken back to the Spanish Captain Antonio Méndez de Canzo, interrogated under torture, tried, and condemned to be ": null
    },
    {
        "hanged, drawn and quartered": "hanged, drawn and quartered"
    },
    {
        ". They were decapitated, and the heads were displayed in the plazas of towns throughout the colonial Partido de la Sierra in what is now Mexicos Yucatán state. Jones 42 pp. 42–42 These events ended all Spanish attempts to contact the Itza until 42 In the 42s internal strife in Spain distracted the government from attempts to conquer unknown lands; the Spanish Crown lacked the time, money or interest in such colonial adventures for the next four decades. Feldman 42 p. 42          In 42 ": null
    },
    {
        "Basque": "basque people"
    },
    {
        " nobleman Martín de Ursúa y Arizmendi proposed to the Spanish king the construction of a road from Mérida southwards to link with the Guatemalan colony, in the process reducing any independent native populations into colonial congregaciones; this was part of a greater plan to subjugate the Lakandon and Manche Chʼol of southern Petén and the upper reaches of the Usumacinta River. The original plan was for the province of Yucatán to build the northern section and for Guatemala to build the southern portion, with both meeting somewhere in Chʼol territory; the plan was later modified to pass further east, through the kingdom of the Itza. Jones 42 pp. 42 42–42 42     The governor of Yucatán, Martín de Ursúa y Arizmendi, began to build the road from Campeche south towards Petén. At the beginning of March 42 Captain Alonso García de Paredes led a group of 42 Spanish soldiers, accompanied by native guides, muleteers and labourers. Jones 42 pp. 42–42 ITMB 42 The expedition advanced south into Kejache territory, which began at Chunpich, about  north of the modern border between Mexico and Guatemala. Jones 42 pp. 42–42 ITMB 42 He rounded up some natives to be moved into colonial settlements, but met with armed Kejache resistance. García decided to retreat around the middle of April. Jones 42 p. 42     In March 42 Captain Juan Díaz de Velasco set out from ": null
    },
    {
        "Cahabón": "cahabón"
    },
    {
        " in ": null
    },
    {
        "Alta Verapaz": "alta verapaz"
    },
    {
        ", Guatemala, with 42 Spanish soldiers, accompanied by a large number of Maya archers from Verapaz, native muleteers, and four Dominican friars. Jones 42 pp. 42 42 Means 42 p. 42 The Spanish pressed ahead to Lake Petén Itzá and engaged in a series of fierce skirmishes with Itza hunting parties. Jones 42 pp. 42–42 42–42 At the lakeshore, within sight of Nojpetén, the Spanish encountered such a large force of Itzas that they retreated south, back to their main camp. Jones 42 p. 42 Interrogation of an Itza prisoner revealed that the Itza kingdom was in a state of high alert to repel the Spanish; Jones 42 p. 42 the expedition almost immediately withdrew back to Cahabón. Jones 42 p. 42     In mid-May 42 García again marched southwards from Campeche, with 42 Spanish soldiers and 42 Maya musketeers, plus Maya labourers and muleteers; the final tally was more than 42 people, which was regarded as a considerable army in the impoverished Yucatán province. Jones 42 p. 42 Ursúa also ordered two companies of Maya musketeers from ": null
    },
    {
        "Tekʼax": "tekax"
    },
    {
        " and Oxkʼutzkabʼ to join the expedition at Bʼolonchʼen Kawich, some  southeast of the city of Campeche. Jones 42 pp. 42 42 At the end of May three friars were assigned to join the Spanish force, accompanied by a lay brother. A second group of Franciscans would continue onwards independently to Nojpetén to make contact with the Itzas; it was led by friar Andrés de Avendaño, who was accompanied by another friar and a lay brother. Jones 42 pp. 42–42 García ordered the construction of a fort at Chuntuki, some 42 leagues north of Lake Petén Itzá, which would serve as the main military base for the Camino Real project. Jones 42 p. 42     The Sajkabʼchen company of native musketeers pushed ahead with the road builders from Tzuktzokʼ to the first Kejache town at Chunpich, which the Kejache had fled. The companys officers sent for reinforcements from García at Tzuktokʼ but before any could arrive some 42 Kejache returned to Chunpich with baskets to collect their abandoned food. The nervous Sajkabʼchen sentries feared that the residents were returning en masse and discharged their muskets at them, with both groups then retreating. The musketeer company then arrived to reinforce their sentries and charged into battle against approaching Kejache archers. Several musketeers were injured in the ensuing skirmish and, the Kejache retreated along a forest path without injury. The Sajkabʼchen company followed the path and found two more deserted settlements with large amounts of abandoned food. They seized the food and retreated back along the path. Jones 42 p. 42 Means 42 pp. 42–42     Around 42 August García moved his entire army forward to Chunpich, Jones 42 p. 42 and by October Spanish soldiers had established themselves near the source of the San Pedro River. Jones 42 p. 42 By November Tzuktokʼ was garrisoned with 42 soldiers and more at Chuntuki. In December 42 the main force was reinforced with 42 soldiers, of which 42 were Spanish and pardo and 42 were Maya, together with labourers and muleteers. Jones 42 p. 42       In May 42 Antonio de Silva had appointed two groups of Franciscans to head for Petén; the first group was to join up with Garcías military expedition. The second group was to head for Lake Petén Itza independently. This second group was headed by friar Andrés de Avendaño. Avendaño was accompanied by another friar, a lay brother, and six Christian Maya. Jones 42 pp. 42 42 This latter group left Mérida on 42 June 42 Jones 42 pp. 42 42–42 Avendaño continued south along the course of the new road, finding increasing evidence of Spanish military activity. The Franciscans overtook García at Bʼukʼte, about  before Tzuktokʼ. Jones 42 p. 42 On 42 August García advanced to Chunpich but tried to persuade Avendaño to stay behind to minister to the prisoners from Bʼukʼte. Avendaño instead split his group and left in secret with just four Christian Maya companions, Jones 42 pp. 42 42 seeking the Chunpich Kejache that had attacked one of Garcías advance companies and had now retreated into the forest. Jones 42 pp. 42–42 He was unable to find the Kejache but did manage to get information regarding a path that led southwards to the Itza kingdom. Avendaño returned to Tzuktokʼ and reconsidered his plans; the Franciscans were short of supplies, and the forcefully congregated Maya that they were charged with converting were disappearing back into the forest daily. Jones 42 p. 42 Antonio de Silva ordered Avendaño to return to Mérida, and he arrived there on 42 September 42 Jones 42 p. 42 Meanwhile, the other group of Franciscans, led by Juan de San Buenaventura Chávez, continued following the roadbuilders into Kejache territory, through IxBʼam, Bʼatkabʼ and Chuntuki . Jones 42 pp. 42 42 Quezada 42 p. 42 ITMB 42       Juan de San Buenaventuras small group of Franciscans arrived in Chuntuki on 42 August 42 and found that the army had opened the road southwards for another seventeen leagues , almost  to Lake Petén Itzá, but returned to Chuntuki due to the seasonal rains. Jones 42 p. 42 San Buenaventura was accompanied by two friars and a lay brother. Jones 42 p. 42 With Avendaños return to Mérida, provincial superior Antonio de Silva despatched two additional friars to join San Buenaventuras group. One of these was to convert the Kejache in Tzuktokʼ, and the other was to do the same at Chuntuki. Jones 42 p. 42 On 42 October San Buenaventura wrote to the provincial superior reporting that the warlike Kejache were now pacified and that they had told him that the Itza were ready to receive the Spanish in friendship. Jones 42 pp. 42–42 On that day 42 Kejache men had voluntarily come to Chuntuki from Pakʼekʼem, where another 42 Kejache resided. Jones 42 pp. 42–42 In early November 42 friar Tomás de Alcoser and brother Lucas de San Francisco were sent to establish a mission at Pakʼekʼem, where they were well received by the  cacique  and his pagan priest. Pakʼekʼem was sufficiently far from the new Spanish road that it was free from military interference, and the friars oversaw the building of a church in what was the largest mission town in Kejache territory. A second church was built at Bʼatkabʼ to attend to over 42 Kʼejache refugees who had been gathered there under the stewardship of a Spanish friar; Jones 42 p. 42 a further church was established at Tzuktokʼ, overseen by another friar. Jones 42 pp. 42–42       Franciscan Andrés de Avendaño left Mérida on 42 December 42 and arrived in Nojpetén around 42 January 42 accompanied by four companions. Jones 42 pp. 42 42 From Chuntuki they followed an Indian trail that led them past the source of the San Pedro River and across steep karst hills to a watering hole by some ruins. Jones 42 pp. 42–42 Means 42 p. 42 From there they followed the small Acté River to a Chakʼan Itza town called Saklemakal. Jones 42 p. 42 They arrived at the western end of Lake Petén Itzá to an enthusiastic welcome by the local Itza. The following day, the current Aj Kan Ekʼ travelled across the lake with eighty canoes to greet the visitors at the Chakʼan Itza port town of Nich, on the west shore of Lake Petén Itza. Sharer and Traxler 42 p. 42 Jones 42 p. 42 The Franciscans returned to Nojpetén with Kan Ekʼ and baptised over 42 Itza children over the following four days. Avendaño tried to convince Kan Ekʼ to convert to Christianity and surrender to the Spanish Crown, without success. The king of the Itza, cited Itza prophecy and said the time was not yet right. Sharer and Traxler 42 p. 42     On 42 January AjKowoj, the king of the Kowoj, arrived at Nojpetén and spoke with Avendaño, Jones 42 p. 42 arguing against the acceptance of Christianity and Spanish rule. Jones 42 p. 42 The discussions between Avendaño, Kan Ekʼ and AjKowoj exposed deep divisions among the Itza. Jones 42 pp. 42–42 Kan Ekʼ learnt of a plot by the Kowoj and their allies to ambush and kill the Franciscans, and the Itza king advised them to return to Mérida via Tipuj. Sharer and Traxler 42 p. 42 Jones 42 pp. 42–42 The Spanish friars became lost and suffered great hardships, including the death of one of Avendaños companions, Vayhinger-Scheer 42 p. 42 but after a month wandering in the forest found their way back to Chuntuki, and from there returned to Mérida. Sharer and Traxler 42 pp. 42–42 Jones 42 pp. 42–42       By mid-January Captain García de Paredes had arrived at the advance portion of the Camino Real at Chuntuki. Jones 42 pp. 42 42 By now he only had 42 soldiers plus labourers and porters. Jones 42 p. 42 Captain Pedro de Zubiaur, Garcías senior officer, arrived at Lake Petén Itza with 42 musketeers, two Franciscans, and allied Yucatec Maya warriors. Jones 42 p. 42 Sharer and Traxler 42 p. 42 They were also accompanied by about 42 Maya porters. Jones 42 p. 42 They were approached by about 42 canoes carrying approximately 42 Itza warriors. Jones 42 p. 42 Sharer and Traxler 42 p. 42 The warriors began to mingle freely with the Spanish party and a scuffle then broke out; a dozen of the Spanish party were forced into canoes, and three of them were killed. At this point the Spanish soldiers opened fire with their muskets, and the Itza retreated across the lake with their prisoners, who included the two Franciscans. Jones 42 p. 42 The Spanish party retreated from the lake shore and regrouped on open ground where they were surrounded by thousands of Itza warriors. Zubiaur ordered his men to fire a volley that killed between 42 and 42 Itzas. Realising that they were hopelessly outnumbered, the Spanish retreated towards Chuntuki, abandoning their captured companions to their fate. Jones 42 p. 42     Martín de Ursúa was now convinced that Kan Ekʼ would not surrender peacefully, and he began to organise an all-out assault on Nojpetén. Sharer and Traxler 42 p. 42 Work on the road was redoubled and about a month after the battle at Chʼichʼ the Spanish arrived at the lakeshore, now supported by artillery. Again a large number of canoes gathered, and the nervous Spanish soldiers opened fire with cannons and muskets; no casualties were reported among the Itza, who retreated and raised a white flag from a safe distance.       Oidor Bartolomé de Amésqueta led the next Guatemalan expedition against the Itza. He marched his men from Cahabón to Mopán, arriving on 42 February 42 Jones 42 pp. 42–42 On 42 March, Captain Díaz de Velasco led a party ahead to the lake; he was accompanied by two Dominican friars and by AjKʼixaw, an Itza nobleman who had been taken prisoner on Díazs previous expedition. Jones 42 p. 42 When they drew close to the shore of Lake Petén Itzá, AjKʼixaw was sent ahead as an emissary to Nojpetén. Jones 42 pp. 42–42 Díazs party was lured into an Itza trap and the expedition members were killed to a man. The two friars were captured and sacrificed. The Itza killed a total of 42 expedition members, including 42 soldiers, two Dominicans and about 42 Maya helpers. Jones 42 p. 42n42     Amésqueta left Mopán three days after Díaz and followed Díazs trail to the lakeshore. He arrived at the lake over a week later with 42 men. As they scouted along the south shore near Nojpetén they were shadowed by about 42 Itza canoes and more Itzas approached by land but kept a safe distance. Jones 42 p. 4242 Amésqueta was extremely suspicious of the small canoes being offered by the Itza to transport his party across to Nojpetén; as nightfall approached Amésqueta retreated from the lakeshore and his men took up positions on a small hill nearby. Jones 42 pp. 42–42 In the early hours of the morning he ordered a retreat by moonlight. Jones 42 pp. 42–42 At San Pedro Martír he received news of an Itza embassy to Mérida in December 42 and an apparent formal surrender of the Itza to Spanish authority. Jones 42 p. 42 Unable to reconcile the news with the loss of his men, and with appalling conditions in San Pedro Mártir, Amésqueta abandoned his unfinished fort and retreated to Guatemala. Jones 42 pp. 42–42       The Itzas continued resistance had become a major embarrassment for the Spanish colonial authorities, and soldiers were despatched from Campeche to take Nojpetén once and for all. Jones 42 p. 42 Martín de Urzúa y Arizmendi arrived on the western shore of Lake Petén Itzá with his soldiers on 42 February 42 and once there built the heavily armed galeota attack boat. Jones 42 p. 42 Jones 42 pp. 42 42–42 The galeota carried 42 men and at least five artillery pieces. Jones 42 pp. 42–42 The piragua longboat used to cross the San Pedro River was also transported to the lake to be used in the attack on the Itza capital. Jones 42 pp. 42 42     On 42 March a number of Itza and Yalain emissaries arrived at Chʼichʼ to negotiate with Ursúa. Jones 42 pp. 42–42 Kan Ekʼ then sent a canoe with a white flag raised bearing emissaries, who offered peaceful surrender. Ursúa received the embassy in peace and invited Kan Ekʼ to visit his encampment three days later. On the appointed day Kan Ekʼ failed to arrive; instead Maya warriors amassed both along the shore and in canoes upon the lake. Sharer and Traxler 42 p. 42     A waterbourne assault was launched upon Kan Eks capital on the morning of 42 March. Sharer and Traxler 42 p. 42 Jones 42 p. 42 Ursúa boarded the galeota with 42 soldiers, two secular priests, five personal servants, the baptised Itza emissary AjChan and his brother-in-law and an Itza prisoner from Nojpetén. The attack boat was rowed east towards the Itza capital;  across the lake it encountered a large fleet of canoes spread in an arc across the approach to Nojpetén – Ursúa simply gave the order to row through them. A large number of defenders had gathered along the shore of Nojpetén and on the roofs of the city. Jones 42 p. 42 Itza archers began to shoot at the invaders from the canoes. Ursúa ordered his men not to return fire but arrows wounded a number of his soldiers; one of the wounded soldiers discharged his musket and at that point the officers lost control of their men. The defending Itza soon fled from the withering Spanish gunfire. Jones 42 pp. 42–42     The city fell after a brief but bloody battle in which many Itza warriors died; the Spanish suffered only minor casualties. The Spanish bombardment caused heavy loss of life on the island; the surviving Itza abandoned their capital and swam across to the mainland with many dying in the water. Sharer and Traxler 42 pp. 42–42 After the battle the surviving defenders melted away into the forests, leaving the Spanish to occupy an abandoned Maya town. Martín de Ursúa planted his standard upon the highest point of the island and renamed Nojpetén as Nuestra Señora de los Remedios y San Pablo, Laguna del Itza": null
    }
]