[
    {
        "        The meaning of spirituality has developed and expanded over time, and various connotations can be found alongside each other.     Traditionally, spirituality referred to a ": null
    },
    {
        "religious": "religion"
    },
    {
        " process of re-formation which aims to recover the original shape of man , oriented at the ": null
    },
    {
        "image of God": "image of god"
    },
    {
        "  as exemplified by the founders and sacred texts of the religions of the world. The term was used within early ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " to refer to a life oriented toward the ": null
    },
    {
        "Holy Spirit": "holy spirit"
    },
    {
        " and broadened during the ": null
    },
    {
        "Late Middle Ages": "late middle ages"
    },
    {
        " to include mental aspects of life.     In modern times, the term both spread to other religious traditions and broadened to refer to a wider range of experience, including a range of esoteric traditions and religious traditions. Modern usages tend to refer to a subjective experience of a sacred dimension and the deepest values and meanings by which people live , often in a context separate from organized religious institutions, such as a belief in a ": null
    },
    {
        "supernatural": "supernatural"
    },
    {
        " realm, ": null
    },
    {
        "personal growth": "personal growth"
    },
    {
        ", a quest for an ultimate or sacred ": null
    },
    {
        "meaning": "meaning of life"
    },
    {
        ", ": null
    },
    {
        "religious experience": "religious experience"
    },
    {
        ", or an encounter with ones own inner dimension .             The term ": null
    },
    {
        "spirit": "spirit"
    },
    {
        " means animating or vital principle in man and animals . It is derived from the Old French espirit, which comes from the Latin word spiritus  and is related to spirare . In the ": null
    },
    {
        "Vulgate": "vulgate"
    },
    {
        " the Latin word spiritus is used to translate the Greek  pneuma  and Hebrew  ruach .      The term spiritual , matters concerning the spirit , is derived from Old French spirituel , which is derived from Latin spiritualis, which comes from spiritus or spirit .      The term spirituality is derived from Middle French spiritualité, from Late Latin spiritualitatem , which is also derived from Latin spiritualis.        There is no single, widely agreed upon definition of spirituality. Surveys of the definition of the term, as used in scholarly research, show a broad range of definitions with limited overlap. A survey of reviews by McCarroll each dealing with the topic of spirituality gave twenty-seven explicit definitions, among which there was little agreement.  This impedes the systematic study of spirituality and the capacity to communicate findings meaningfully. Furthermore, many of spiritualitys core features are not unique to spirituality; for example self-": null
    },
    {
        "transcendence": "transcendence"
    },
    {
        ", asceticism and the recognition of ones connection to all were regarded by the atheist ": null
    },
    {
        "Arthur Schopenhauer": "arthur schopenhauer"
    },
    {
        " as key to ethical life. The Academy of Ideas,       According to Kees Waaijman, the traditional meaning of spirituality is a process of re-formation which aims to recover the original shape of man, the image of God. To accomplish this, the re-formation is oriented at a mold, which represents the original shape: in ": null
    },
    {
        "Judaism": "judaism"
    },
    {
        " the ": null
    },
    {
        "Torah": "torah"
    },
    {
        ", in ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " there is ": null
    },
    {
        "Christ": "christ"
    },
    {
        ", for ": null
    },
    {
        "Buddhism": "buddhism"
    },
    {
        ", ": null
    },
    {
        "Buddha": "buddha"
    },
    {
        ", and in ": null
    },
    {
        "Islam": "islam"
    },
    {
        ", ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        ".  Houtman and Aupers suggest that modern spirituality is a blend of humanistic psychology, mystical and esoteric traditions and Eastern religions.     In modern times the emphasis is on subjective experience and the deepest values and meanings by which people live,  incorporating ": null
    },
    {
        "personal growth or transformation": "personal growth"
    },
    {
        ", usually in a context separate from organized religious institutions.           Bergomi detects an enlightened form of non-religious spirituality in ": null
    },
    {
        "Late Antiquity": "late antiquity"
    },
    {
        ".          Words translatable as spirituality first began to arise in the 5th century and only entered common use toward the end of the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        ". Jones, L.G., A thirst for god or consumer spirituality? Cultivating disciplined practices of being engaged by god, in L. Gregory Jones and James J. Buckley eds., Spirituality and Social Embodiment, Oxford: Blackwell, 1997, 3–28  In a Biblical context the term means being animated by God. The New Testament offers the concept of being driven by the ": null
    },
    {
        "Holy Spirit": "holy spirit"
    },
    {
        ", as opposed to living a ": null
    },
    {
        "life": "personal life"
    },
    {
        " in which one rejects this influence.     In the 11th century this meaning changed. Spirituality began to denote the mental aspect of life, as opposed to the material and sensual aspects of life, the ecclesiastical sphere of light against the dark world of matter . In the 13th century spirituality acquired a social and psychological meaning. Socially it denoted the territory of the clergy: The ecclesiastical against the temporary possessions, the ecclesiastical against the secular authority, the clerical class against the secular class  Psychologically, it denoted the realm of the inner life: The purity of motives, affections, intentions, inner dispositions, the psychology of the spiritual life, the analysis of the feelings .     In the 17th and 18th centuries a distinction was made between higher and lower forms of spirituality: A spiritual man is one who is Christian more abundantly and deeper than others.  The word was also associated with ": null
    },
    {
        "mysticism": "mysticism"
    },
    {
        " and ": null
    },
    {
        "quietism": "quietism"
    },
    {
        ", and acquired a negative meaning.            Modern notions of spirituality developed throughout the 19th and 20th century, mixing Christian ideas with ": null
    },
    {
        "Western esoteric": "western esotericism"
    },
    {
        " traditions and elements of Asian, especially Indian, religions. Spirituality became increasingly disconnected from traditional religious organisations and institutions. It is sometimes associated today with philosophical, social, or political movements such as ": null
    },
    {
        "liberalism": "liberalism"
    },
    {
        ", ": null
    },
    {
        "feminist theology": "feminist theology"
    },
    {
        ", and ": null
    },
    {
        "green politics": "green politics"
    },
    {
        ".       ": null
    },
    {
        "Ralph Waldo Emerson": "ralph waldo emerson"
    },
    {
        " was a pioneer of the idea of spirituality as a distinct field. Schmidt, Leigh Eric. Restless Souls : The Making of American Spirituality. San Francisco: Harper, 2005.  He was one of the major figures in ": null
    },
    {
        "Transcendentalism": "transcendentalism"
    },
    {
        ", an early 19th-century ": null
    },
    {
        "liberal Protestant": "liberal christianity"
    },
    {
        " movement, which was rooted in English and German ": null
    },
    {
        "Romanticism": "romanticism"
    },
    {
        ", the Biblical criticism of ": null
    },
    {
        "Johann Gottfried Herder": "johann gottfried herder"
    },
    {
        " and ": null
    },
    {
        "Friedrich Schleiermacher": "friedrich schleiermacher"
    },
    {
        ", the ": null
    },
    {
        "skepticism": "skepticism"
    },
    {
        " of ": null
    },
    {
        "Hume": "david hume"
    },
    {
        ",  and ": null
    },
    {
        "Neo-Platonism": "neo-platonism"
    },
    {
        ".   The Transcendentalists emphasised an intuitive, experiential approach of religion. ": null
    }
]