[
    {
        "In ": null
    },
    {
        "abstract algebra": "abstract algebra"
    },
    {
        ", a splitting field of a ": null
    },
    {
        "polynomial": "polynomial"
    },
    {
        " with coefficients in a ": null
    },
    {
        "field": "field"
    },
    {
        " is the smallest ": null
    },
    {
        "field extension": "field extension"
    },
    {
        " of that field over which the polynomial splits or decomposes into ": null
    },
    {
        "linear factors": "linear factors"
    },
    {
        ".       A splitting field of a polynomial p over a field K is a field extension L of K over which p factors into linear factors     : p c\\prod_^     where c\\in K and for each i we have \\in L with a i  not necessarily distinct and such that the roots a i  generate L over K. The extension L is then an extension of minimal ": null
    },
    {
        "degree": "degree of a field extension"
    },
    {
        " over K in which p splits. It can be shown that such splitting fields exist and are unique ": null
    },
    {
        "up to": "up to"
    },
    {
        " isomorphism. The amount of freedom in that isomorphism is known as the ": null
    },
    {
        "Galois group": "galois group"
    },
    {
        " of p .       An extension L which is a ": null
    },
    {
        "splitting field for a set of polynomials": "algebraic closureexistence of an algebraic closure and splitting fields"
    },
    {
        " p over K is called a ": null
    },
    {
        "normal extension": "field extensionnormal, separable and galois extensions"
    },
    {
        " of K.     Given an ": null
    },
    {
        "algebraically closed field": "algebraically closed field"
    },
    {
        " A containing K, there is a unique splitting field L of p between K and A, generated by the ": null
    },
    {
        "roots": "root of a function"
    },
    {
        " of p. If K is a subfield of the ": null
    },
    {
        "complex number": "complex number"
    },
    {
        "s, the existence is immediate. On the other hand, the existence of algebraic closures in general is often proved by passing to the limit from the splitting field result, which therefore requires an independent proof to avoid ": null
    },
    {
        "circular reasoning": "circular definition"
    },
    {
        ".     Given a ": null
    },
    {
        "separable extension": "separable extension"
    },
    {
        " K′ of K, a Galois closure L of K′ is a type of splitting field, and also a ": null
    },
    {
        "Galois extension": "galois extension"
    },
    {
        " of K containing K′ that is minimal, in an obvious sense. Such a Galois closure should contain a splitting field for all the polynomials p over K that are ": null
    },
    {
        "minimal polynomials": "minimal polynomial"
    },
    {
        " over K of elements a of K′.         Finding ": null
    },
    {
        "roots": "root of a function"
    },
    {
        " of polynomials has been an important problem since the time of the ancient Greeks. Some polynomials, however, such as  over , the real numbers, have no roots. By constructing the splitting field for such a polynomial one can find the roots of the polynomial in the new field.       Let F be a field and p be a polynomial in the ": null
    },
    {
        "polynomial ring": "polynomial ring"
    },
    {
        " FX of degree n. The general process for constructing K, the splitting field of p over F, is to construct a sequence of fields FK_42 K_42 \\ldots K_, K_rK such that K i  is an extension of K i−42 containing a new root of p. Since p has at most n roots the construction will require at most n extensions. The steps for constructing K i  are given as follows:   Factorize p over K i  into ": null
    },
    {
        "irreducible": "irreducible polynomial"
    },
    {
        " factors f_42f_42 \\cdots f_k .   Choose any nonlinear irreducible factor f f i .   Construct the ": null
    },
    {
        "field extension": "field extension"
    },
    {
        " K i42 of K i  as the ": null
    },
    {
        "quotient ring": "quotient ring"
    },
    {
        " K i42 K i X/ where  denotes the ": null
    },
    {
        "ideal": "ideal"
    },
    {
        " in K i X generated by f   Repeat the process for K i42 until p completely factors.     The irreducible factor f i  used in the quotient construction may be chosen arbitrarily. Although different choices of factors may lead to different subfield sequences, the resulting splitting fields will be isomorphic.     Since f is irreducible,  is a ": null
    },
    {
        "maximal ideal": "maximal ideal"
    },
    {
        " and hence K i X/ is, in fact, a field. Moreover, if we let \\pi : K_i \\to K_i be the natural projection of the ring onto its quotient then   : f \\pi f\\ \\bmod\\ f 42   so π is a root of f and of p.     The degree of a single extension is equal to the degree of the irreducible factor f. The degree of the extension K : F is given by \\cdots and is at most n!.     K i X/ K i42 K i X/ is a field when f is irreducible. Its elements are of the form     : c_\\alpha^ + c_\\alpha^ + \\cdots + c_42\\alpha + c_42     where the c j  are in K i  and α π.      The elements of K i42 can be considered as polynomials in α of degree less than n. Addition in K i42 is given by the rules for polynomial addition and multiplication is given by polynomial multiplication modulo f. That is, for g and h in K i42 the product gh r where r is the remainder of gh divided by f in K i X.     The remainder r can be computed through long division of polynomials, however there is also a straightforward reduction rule that can be used to compute r gh directly. First let     : f X^n + b_ X^ + \\cdots + b_42 X + b_42     The polynomial is over a field so one can take f to be ": null
    },
    {
        "monic": "monic polynomial"
    },
    {
        " without loss of generality. Now α is a root of f, so     : \\alpha^n -.     If the product gh has a term α m with  it can be reduced as follows:     : \\alpha^n\\alpha^ -\\left \\alpha^ -\\left .     As an example of the reduction rule, take K i  QX, the ring of polynomials with rational coefficients, and take f X 42 − 42 Let g \\alpha^42 + \\alpha^42 and h α 42 42 be two elements of QX/. The reduction rule given by f is α 42 42 so     : g h \\left \\left \\alpha^42 + 42 \\alpha^42 + \\alpha^42 \\left \\alpha + 42\\alpha^42 + \\alpha^42 42 \\alpha^42 + \\alpha^42 + 42\\alpha.         Consider the ": null
    },
    {
        "polynomial ring": "polynomial ring"
    },
    {
        " Rx, and the ": null
    },
    {
        "irreducible polynomial": "irreducible polynomial"
    },
    {
        "  The ": null
    },
    {
        "quotient ring": "quotient ring"
    },
    {
        "  is given by the ": null
    },
    {
        "congruence": "congruence relation"
    },
    {
        "  As a result, the elements  of  are of the form  where a and b belong to R. To see this, note that since  it follows that , , , etc.; and so, for example      The addition and multiplication operations are given by firstly using ordinary polynomial addition and multiplication, but then reducing modulo , i.e. using the fact that , , , , etc. Thus:   : + + x,   : a_42a_42 + x + x^42 \\equiv + x \\, .   If we identify  with  then we see that addition and multiplication are given by   : + ,   : \\cdot .     We claim that, as a field, the quotient  is ": null
    },
    {
        "isomorphic": "isomorphic"
    },
    {
        " to the ": null
    },
    {
        "complex number": "complex number"
    },
    {
        "s, C. A general complex number is of the form , where a and b are real numbers and  Addition and multiplication are given by     : + + i,   : \\cdot + i.     If we identify  with  then we see that addition and multiplication are given by     : + ,   : \\cdot .     The previous calculations show that addition and multiplication behave the same way in  and C. In fact, we see that the map between  and C given by  is a ": null
    },
    {
        "homomorphism": "homomorphism"
    },
    {
        " with respect to addition and multiplication. It is also obvious that the map  is both ": null
    },
    {
        "injective": "injective"
    },
    {
        " and ": null
    },
    {
        "surjective": "surjective"
    },
    {
        "; meaning that  is a ": null
    },
    {
        "bijective": "bijective"
    },
    {
        " homomorphism, i.e. an isomorphism. It follows that, as claimed:      In 42 ": null
    },
    {
        "Cauchy": "augustin-louis cauchy"
    },
    {
        " used this approach to define the complex numbers.        Let  be the ": null
    },
    {
        "rational number field": "rational number field"
    },
    {
        "  and . Each root of  equals  times a ": null
    },
    {
        "cube root of unity": "cube root of unity"
    },
    {
        ". Therefore, if we denote the cube roots of unity by     : \\omega_42 42 \\,   : \\omega_42 - \\frac + \\frac i,   : \\omega_42 - \\frac - \\frac i.     any field containing two distinct roots of  will contain the quotient between two distinct cube roots of unity. Such a quotient is a primitive cube root of unity—either ω 42 or \\omega_42/\\omega_42 . It follows that a splitting field  of  will contain ω 42 , as well as the real ": null
    },
    {
        "cube root": "cube root"
    },
    {
        " of 42; conversely, any extension of  containing these elements contains all the roots of . Thus     : L\\mathbf \\left \\left \\     Note that applying the construction process outlined in the previous section to this example, one begins with K_42 \\mathbf and constructs the field K_42 \\mathbf / . This field is not the splitting field, but contains one root. However, the polynomial Y^42 - 42 is not irreducible over K_42 and in fact:     : Y^42 42 .     Note that X is not an indeterminate, and is in fact an element of K_42 . Now, continuing the process, we obtain K_42 K_42 / which is indeed the splitting field and is spanned by the \\mathbf -basis \\ . Notice that if we compare this with L from above we can identify X \\sqrt and Y \\omega_42 .       The splitting field of x q  - x over F p is the unique finite field F q for q p n .  Sometimes this field is denoted by GF.     The splitting field of x 42 + 42 over F 42 is F 42 ; the polynomial has no roots in F 42 , i.e., −42 is not a square there, because 42 is not equivalent to 42 . Instead of applying this characterization of odd prime moduli for which −42 is a square, one could just check that the set of squares in F 42 is the set of classes of 42 42 42 and 42 which does not include the class of  −42≡42     The splitting field of x 42 − 42 over F 42 is F 42 since x 42 − 42  already factors into linear factors.     We calculate the splitting field of f x 42 + x + 42 over F 42 . It is easy to verify that f has no roots in F 42 , hence f is irreducible in F 42 x. Put r x +  in F 42 x/ so F 42  is a field and x 42 + x + 42  in F 42 x. Note that we can write + for − since the characteristic is two. Comparison of coefficients shows that a r and b 42 + r 42 . The elements of F 42  can be listed as c + dr + er 42 , where c, d, e are in F 42 . There are eight elements: 42 42 r, 42 + r, r 42 , 42 + r 42 , r + r 42 and 42 + r + r 42 . Substituting these in x 42 + rx + 42 + r 42 we reach  42 + r + 42 + r 42 r 42 + r 42 + 42 + r 42 42 therefore x 42 + x + 42  for r in F 42 x/; E F 42  is a splitting field of x 42 + x + 42 over F": null
    }
]