[
    {
        "   The sprint or match sprint is a ": null
    },
    {
        "track cycling": "track cycling"
    },
    {
        " event involving between two and four riders, though it is usually run as a one-on-one match race between opponents who, unlike in the ": null
    },
    {
        "individual pursuit": "individual pursuit"
    },
    {
        ", start next to each other. Mens sprint has been an Olympic event at every games except 42 and 42 . Womens sprints have been contested at every Olympics since 42       Depending on the size of the ": null
    },
    {
        "velodrome": "velodrome"
    },
    {
        ", this event can be from 42  m to 42  m. Unlike the ": null
    },
    {
        "sprints": "sprint"
    },
    {
        " in ": null
    },
    {
        "athletics": "athletics"
    },
    {
        ", these events do not usually start with riders sprinting from the starting line and they are not confined to lanes. The early parts of each race will often be highly tactical with riders pedalling slowly, as they carefully jockey for position, often trying to force their opponents up high on the track in an attempt to get their rivals to make the first move. Some even bring their bicycles to a complete stop, balanced upright with both feet still on the pedals and both hands on the handle bars , in an attempt to make the other rider take the lead. Track stands can only be held for a certain time and it is not permissible to go backwards in a track stand by rocking backwards and forwards as the judge will be following the track stand from the bottom of the track. The reason for this behaviour, as in many track cycling events, is both ": null
    },
    {
        "aerodynamics": "aerodynamics"
    },
    {
        " and tactics.     When racing at high speed, the rider who manages to stay just behind their opponent can ": null
    },
    {
        "draft": "drafting"
    },
    {
        ", expending less effort. By riding behind the lead out rider, the second rider reduces the aerodynamic drag felt. Just before the finish, the trailing rider pulls out of the slipstream, and aided by fresher legs, may be able to overtake the opponent before the line. To prevent this, the leading rider may choose to accelerate quickly before the last lap, hoping to catch their opponent off guard and establish a large enough gap to negate the aerodynamic effect or to keep the speed high enough to prevent their opponent from completing a pass.     During the race, the lead out rider may choose to hug the measurement line on the inside of the track giving them the shortest path around the track. Likewise, they may choose to hug the sprinters line to force their opponent to come higher over the top of them. The sprinters line defines the sprinters lane; once the sprint is initiated riders may not drop into the sprinters lane or cross out of the lane unless they have a clear lead over their opponent.       As defined by ": null
    },
    {
        "UCI": "union cycliste internationale"
    },
    {
        " rules, the first round of competition used to qualify for the sprint competition is the flying 42  m time trial. In this round each rider completes two to three warm up laps and then completes the final 42  m, which is usually just under a lap. The number of riders that qualify for the sprint rounds depends on the competition; in World Cup competitions, 42 riders will advance and in a world championship, 42 riders will advance. The top riders are seeded in the following rounds, meaning the fastest qualifier will face the slowest qualifier and so on. Knock-out rounds then proceed, initially on a one race basis and then on a best-of three-race format from the quarter-final stage. Riders defeated in the earlier rounds may get a chance to continue in the competition through the ": null
    },
    {
        "repechage": "repechage"
    },
    {
        " races.     ": null
    },
    {
        "Great Britain": "great britain"
    },
    {
        " and ": null
    },
    {
        "Germany": "germany"
    },
    {
        " currently hold two of the major titles in this event. ": null
    },
    {
        "Jason Kenny": "jason kenny"
    },
    {
        " is Olympic mens sprint champion, and ": null
    },
    {
        "Kristina Vogel": "kristina vogel"
    },
    {
        " the Olympic womens sprint champion.     This is a tactical and skilful race.            The ": null
    },
    {
        "Keirin": "keirin"
    },
    {
        " is a variant of the sprint in which a higher number of sprinters compete in a very different format. Riders are paced in the early laps by a ": null
    },
    {
        "Derny": "derny"
    },
    {
        " motorcycle, which slowly increases the speed of the race from 42 ": null
    },
    {
        "km/h": "km/h"
    },
    {
        " to about 42  km/h. It then leaves the track with about 42–42 m remaining. The first rider across the finish line in the high-speed finish is the winner.          The ": null
    },
    {
        "team sprint": "team sprint"
    },
    {
        " is a short distance three-man ": null
    },
    {
        "team pursuit": "team pursuit"
    },
    {
        " held over three laps of a ": null
    },
    {
        "velodrome": "velodrome"
    },
    {
        ". Like the ": null
    },
    {
        "team pursuit": "team pursuit"
    }
]