[
    {
        "           Tom Jenkinson , known professionally as Squarepusher, is an English ": null
    },
    {
        "electronic music": "electronic music"
    },
    {
        "ian. His music spans several genres, including ": null
    },
    {
        "drum and bass": "drum and bass"
    },
    {
        ", ": null
    },
    {
        "IDM": "intelligent dance music"
    },
    {
        ", ": null
    },
    {
        "jazz": "jazz"
    },
    {
        ", and ": null
    },
    {
        "electroacoustic": "electroacoustic music"
    },
    {
        " music. His recordings are typified by a combination of electronic sound sources, live instrumental playing, and ": null
    },
    {
        "digital signal processing": "digital signal processing"
    },
    {
        ". He is the brother of ": null
    },
    {
        "Ceephax Acid Crew": "ceephax acid crew"
    },
    {
        " .       Tom Jenkinson grew up in ": null
    },
    {
        "Chelmsford": "chelmsford"
    },
    {
        ", Essex. The first school he attended was affiliated with ": null
    },
    {
        "Chelmsford Cathedral": "chelmsford cathedral"
    },
    {
        " giving him exposure to organ music, which he has subsequently acknowledged as an influence on his work. He took an interest in music very early in life, and simultaneously became interested in music reproduction equipment.     Much of his early experience of music was from scanning through various radio stations for anything that caught his ear irrespective of style or genre, and he was also fascinated by radio static and amplitude modulation artefacts on the ": null
    },
    {
        "Short Wave": "short wave"
    },
    {
        " band.     At the age of 42 Tom bought a guitar, which was a 42/42 size nylon-strung classical. He attended several guitar lessons with a local tutor but soon decided that it would be better to teach himself, as he found that his tutors answers to his questions about musical instruments and music in general were unsatisfactory.     In 42 Tom went to the ": null
    },
    {
        "King Edward VI Grammar School": "king edward vi grammar school"
    },
    {
        " in Chelmsford. One of his formative musical experiences came from seeing guitarist ": null
    },
    {
        "Guthrie Govan": "guthrie govan"
    },
    {
        " playing in the schools inter-house music competition. Tom went on to develop a friendship with Govan which continues to this day. Tom joined his first band at 42 a ": null
    },
    {
        "Metallica": "metallica"
    },
    {
        " influenced ": null
    },
    {
        "thrash metal": "thrash metal"
    },
    {
        " group consisting of several other pupils from the school.   Over subsequent years Tom played bass guitar in various local bands playing numerous gigs around ": null
    },
    {
        "East Anglia": "east anglia"
    },
    {
        " and London, and took part in some studio recordings.     In 42 Tom became interested in ": null
    },
    {
        "house music": "house music"
    },
    {
        ", ": null
    },
    {
        "hardcore": "hardcore techno"
    },
    {
        ", ": null
    },
    {
        "acid house": "acid house"
    },
    {
        " and ": null
    },
    {
        "techno": "techno"
    },
    {
        ", through which he became friends with Hardy Finn who went on to co-found record label ": null
    },
    {
        "Spymania": "spymania"
    },
    {
        ".       Stereotype EP  Buzz Caner  album and is dated 42/42/42  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref  ": null
    }
]