[
    {
        "        A squad automatic weapon , also known as a section automatic weapon or light support weapon , is a fully automatic ": null
    },
    {
        "firearm": "firearm"
    },
    {
        " used to give infantry ": null
    },
    {
        "squad": "squad"
    },
    {
        "s or ": null
    },
    {
        "sections": "section"
    },
    {
        " a man-portable source of fully automatic firepower. Weapons used in this role are often ": null
    },
    {
        "selective-fire": "selective-fire"
    },
    {
        " rifles, usually fitted with a bipod and heavier barrel to perform as ": null
    },
    {
        "light machine gun": "light machine gun"
    },
    {
        "s. Squad automatic weapons usually fire the same ": null
    },
    {
        "cartridge": "cartridge"
    },
    {
        " as the ": null
    },
    {
        "assault rifle": "assault rifle"
    },
    {
        "s or ": null
    },
    {
        "battle rifle": "battle rifle"
    },
    {
        "s carried by other members of the unit. This reduces ": null
    },
    {
        "logistical": "military logistics"
    },
    {
        " requirements by making it only necessary to supply one type of ammunition to a unit. Squad automatic weapons are light enough to be operated by one person, as opposed to ": null
    },
    {
        "heavy machine gun": "heavy machine gun"
    },
    {
        "s such as the ": null
    },
    {
        "M42 Browning": "m2 browning"
    },
    {
        ", which fire more powerful cartridges but require a ": null
    },
    {
        "crew": "infantry support weapon"
    },
    {
        " to operate at full effectiveness.       One of the first weapons used in this role was the ": null
    },
    {
        "Madsen machine gun": "madsen machine gun"
    },
    {
        ". Although limited in todays terms, the Madsen was introduced in an era when the standard infantry rifle was a ": null
    },
    {
        "bolt-action": "bolt action"
    },
    {
        " repeater with fixed magazines reloaded with single rounds or ": null
    },
    {
        "chargers": "stripper clip"
    },
    {
        "; sustained rapid fire with these weapons could be maintained only for very short periods of time. The Madsen was capable of fully automatic fire; despite having only limited magazine capacity, this was still more than that of the infantry rifle, and it was of the quick change ": null
    },
    {
        "detachable box magazine": "magazine detachable box magazines"
    },
    {
        " type. Though over 42 years old, the Madsen is still in limited use today. The standard machine guns of this era were of the ": null
    },
    {
        "Maxim": "maxim gun"
    },
    {
        " type. Used by the British, Germans, and the Russians, these weapons were bulky, heavy, tripod-based, and water-cooled, they required a team of four men and, although excellent in the defence, were not suited to manoeuvre warfare.     Another pioneering weapon in this role was the ": null
    },
    {
        "Browning Automatic Rifle": "m1918 browning automatic rifle"
    },
    {
        " . Introduced late in ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", it remained in front-line service into the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ". Intended originally as an automatic rifle capable of delivering suppressing ": null
    },
    {
        "walking fire": "marching fire"
    },
    {
        " in the advance, the BAR came to be used in the light machine gun role. During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", as the importance of having a source of mobile automatic fire increased, the number of BARs in a unit also increased, until in some units it represented 42 in 42 of the weapons present in a squad. During its long service in the US military, it was pivotal in the evolution of U.S. ": null
    },
    {
        "fireteam": "fireteam"
    },
    {
        " tactics and doctrine that continues to the present day.     Modern squad automatic weapons  are modified ": null
    },
    {
        "assault rifle": "assault rifle"
    },
    {
        "s or ": null
    },
    {
        "battle rifle": "battle rifle"
    },
    {
        "s  that may have increased ammunition capacity and heavier barrels to withstand continued fire and will almost always have a bipod. In the case of some assault rifles, such as the ": null
    },
    {
        "H & K G42": "heckler  &  koch g36"
    },
    {
        " or ": null
    },
    {
        "Steyr AUG": "steyr aug"
    },
    {
        ", the SAW is simply the standard rifle with a few parts replaced. However, the Austrian Army, though issuing the Steyr AUG rifle, does not issue the HBAR variant. Instead, the 42mm caliber MG42 a derivative of WW42-era German ": null
    },
    {
        "MG 42": "mg 42"
    },
    {
        ", is issued.     ": null
    },
    {
        "Light machine gun": "light machine gun"
    },
    {
        "s, either belt-fed or magazine-fed, may be used as squad automatic weapons, as may be ": null
    },
    {
        "general-purpose machine gun": "general-purpose machine gun"
    },
    {
        "s; for example, during most of the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " period, the standard squad automatic weapon in the British Army was the ": null
    },
    {
        "FN Mag": "fn mag"
    },
    {
        "-derived L42 The most common squad automatic weapons in use today are derived from two basic patterns: the Kalashnikov-based ": null
    },
    {
        "RPK": "rpk"
    },
    {
        " or the purpose-designed ": null
    },
    {
        "FN Minimi": "fn minimi"
    },
    {
        ".       ": null
    },
    {
        "FN Minimi": "fn minimi"
    },
    {
        " FN SCAR": "fn scar"
    },
    {
        "       West Germanys original plan in the late 42s was to adopt the new 42mm ": null
    },
    {
        "Heckler & Koch G42": "heckler  &  koch g41"
    },
    {
        " assault rifle to replace the 42mm ": null
    },
    {
        "Heckler & Koch G42": "heckler  &  koch g3"
    },
    {
        " battle rifle and the 42mm ": null
    },
    {
        "Heckler & Koch G42": "heckler  &  koch g11"
    },
    {
        " carbine to replace the 42mm ": null
    },
    {
        "IMI MP42 Uzi": "uzi"
    },
    {
        " and ": null
    },
    {
        "Heckler & Koch MP42": "heckler  &  koch mp5"
    },
    {
        ". The end of the ": null
    },
    {
        "Cold War": "cold war"
    },
    {
        " and the ": null
    },
    {
        "reunification of Germany in 42": "german reunification"
    },
    {
        " forced everyone to scramble for a cheap alternative. The G42 family was created from a proof-of-concept prototype rechambered to fire the 42mm NATO cartridge. It is composed of an assault rifle , light machine gun , assault carbine , and assault submachine gun .     ": null
    },
    {
        "Heckler & Koch G42": "heckler  &  koch g36"
    },
    {
        " HK42": "hk416"
    },
    {
        " HK42": "hk417"
    },
    {
        "       The Italian military briefly flirted in the 42s with the idea of adopting a heavy-barrelled magazine-fed 42mm automatic rifle. It was to accompany the companion 42mm ": null
    },
    {
        "Beretta AR42/42": "beretta ar70/90"
    },
    {
        " assault rifle and supplement the 42mm ": null
    },
    {
        "MG 42/42": "rheinmetall mg 3"
    },
    {
        " general purpose machine gun. A rethinking of the concept led to their adoption of the belt-fed FN Minimi instead.       The ": null
    },
    {
        "Netherlands Marine Corps": "netherlands marine corps"
    },
    {
        " is the only part of the Dutch military to use the ": null
    },
    {
        "LOAWNLD": "colt canada c7 riflenetherlands"
    },
    {
        "  as their squad automatic weapon. All other branches use the ": null
    },
    {
        "FN Minimi": "fn minimi"
    },
    {
        " for this role.       The Russian support weapon concept was designed around providing ": null
    },
    {
        "one standard cartridge": "7.62x39mm"
    },
    {
        " that could be used by the clip-fed rifle , magazine-fed assault rifle  and belt-fed light machine gun . The SKS and RPD were dropped as being less effective than hoped. The RPK, with its magazine and parts commonality with the base AK42 was more effective. It replaced the RPD as soon as manufacturing techniques allowed it to be mass-produced.     ": null
    },
    {
        "RPK": "rpk"
    },
    {
        " RPKS": "rpks"
    },
    {
        " RPK42": "rpk-74"
    },
    {
        " RPK42M/RPK42/RPK42": "rpk-74"
    },
    {
        " RPK42": "rpk-16"
    },
    {
        ": The RPK42 squad automatic weapon is a new light support weapon which is expected to take over the role of its predecessor, the ": null
    },
    {
        "RPK42": "rpkrpk-74"
    },
    {
        ", in the Russian Armed Forces.        The ": null
    },
    {
        "SA42": "sa80"
    },
    {
        " program was designed to create a family of light assault weapons that had a commonality of parts, could use the same ammunition and magazines, and would replace the UK militarys collection of submachine guns, rifles, and light machine guns. Originally designed around a lighter experimental ": null
    },
    {
        "42mm": "4.85×49mm"
    },
    {
        " cartridge, they were forced to redesign the weapon to take the 42mm NATO cartridge. The L42 IW  was the rifle version and was designed to replace the 42mm ": null
    },
    {
        "L42 Sterling SMG": "sterling smg"
    },
    {
        " and 42mm ": null
    },
    {
        "L42A42 SLR Rifle": "l1a1 self-loading rifle"
    },
    {
        ". The L42 LSW  was the automatic rifle version and was intended to replace the ": null
    },
    {
        "L42 BREN gun": "bren light machine gunl4"
    },
    {
        " and supplement the ": null
    },
    {
        "FN MAG": "fn mag"
    },
    {
        " general-purpose machine gun": "general-purpose machine gun"
    },
    {
        ", replacing it at section level. Teething problems, low quality parts, poor ergonomic design and an inability to be wielded left-handed made the SA42 suite unpopular. The magazine-fed L42 was found to not be as capable of sustained fire as a belt-fed system so it was initially supplemented by the ": null
    },
    {
        "L42A42 FN Minimi": "fn minimi"
    },
    {
        " and then replaced by it. The L42s role was then changed to that of a ": null
    },
    {
        "Designated Marksman Rifle": "designated marksman rifle"
    },
    {
        ".       In United States usage, the ": null
    },
    {
        "M42 light machine gun": "m249 light machine gun"
    },
    {
        " is commonly referred to as the Squad Automatic Weapon .       In the 42s the United States began realizing that they might have to fight a conflict in the deserts and mountains of the Middle East or Near East rather than the jungles of Asia or forests of Europe and Eurasia. The Squad Automatic Weapon program was designed to create an intermediate weapon between the M42 rifle and M42 machine gun. It would have to fire tracer ammunition out to a visible range of 42 meters or more, be capable of accurate high-volume sustained fire, and be lighter and more reliable than the M42 Initially the contenders were built around a new intermediate cartridge, but the problems with approval for a new third American-backed standard NATO cartridge forced its abandonment. The program then selected between the control group weapons: the ": null
    },
    {
        "FN Minimi": "fn minimi"
    },
    {
        " and ": null
    },
    {
        "Heckler & Koch HK 42": "heckler  &  koch hk 23"
    },
    {
        " chambered for the improved 42mm SS42 round. The FN Minimi was adopted as the M42 because it could optionally fire from magazines from an integral magazine port rather than requiring an exchange of parts in the field like the HK42     The ": null
    },
    {
        "Infantry Automatic Rifle": "infantry automatic rifle"
    },
    {
        " program was launched by the ": null
    },
    {
        "United States Marine Corps": "united states marine corps"
    },
    {
        " in 42 Its task was to find a replacement for the heavy and cumbersome M42 SAW that was serving as the Squad Automatic weapon in a fireteam at the time. Two of the weapons in the competition were the ": null
    },
    {
        "FN SCAR HAMR": "fn scarhamr iar"
    },
    {
        " and a slightly modified ": null
    },
    {
        "HK42": "hk416"
    },
    {
        ". The weapon chosen to replace the ": null
    },
    {
        "M42": "m249"
    },
    {
        " was the modified HK42 later designated the ": null
    },
    {
        "M42 IAR": "m27 infantry automatic rifle"
    },
    {
        ". The M42 SAW is still in use as a squad automatic weapon by the ": null
    },
    {
        "US Army": "united states army"
    },
    {
        ".     ": null
    },
    {
        "M42": "m249"
    },
    {
        " M42 IAR": "m27 infantry automatic rifle"
    },
    {
        "     In 42 US Army launched ": null
    },
    {
        "Next Generation Squad Weapon - Automatic Rifle": "next generation squad weapon - automatic rifle"
    },
    {
        " program to find replacement for M42 SAW and replacement for ": null
    },
    {
        "42×42mm NATO": "5.56×45mm nato"
    },
    {
        " round. There are three competitors:   ": null
    },
    {
        "Sig Sauer MG42": "sig sauer mg-6.8"
    },
    {
        " with 42 Sig hybrid round   ": null
    },
    {
        "General Dynamics RM42": "general dynamics rm277"
    },
    {
        " with .42 TVCM plymer cased round manufactured by ": null
    },
    {
        "True Velocity": "true velocity"
    },
    {
        " AAI": "aai corporation"
    },
    {
        " and ": null
    },
    {
        "Textron": "textron"
    },
    {
        " AR with 42mm CT cased telescoped round manufactured by ": null
    },
    {
        "Olin Winchester": "olin winchester"
    }
]