[
    {
        "   SS City of Flint, a ": null
    },
    {
        "Hog Islander": "hog islander"
    },
    {
        " freighter": "cargo ship"
    },
    {
        " built by ": null
    },
    {
        "American International Shipbuilding": "american international shipbuilding"
    },
    {
        " at the ": null
    },
    {
        "Hog Island Shipyard": "hog island, philadelphia"
    },
    {
        ", Philadelphia for the ": null
    },
    {
        "United States Shipping Board": "united states shipping board"
    },
    {
        " , ": null
    },
    {
        "Emergency Fleet Corporation": "emergency fleet corporation"
    },
    {
        ". City of Flint was named to honor the citizens of ": null
    },
    {
        "Flint, Michigan": "flint, michigan"
    },
    {
        " for their effort in ": null
    },
    {
        "Liberty Loan": "liberty loan"
    },
    {
        " drives during ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ".     The ship was operating with the American Hampton Roads Line in 42 but reverted to the USSB by 42 By 42 the USSB had been replaced by the ": null
    },
    {
        "United States Maritime Commission": "united states maritime commission"
    },
    {
        " as owner and the ship was being operated as a Maritime Commission cargo vessel. During the ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " City of Flint was being operated by ": null
    },
    {
        "United States Lines": "united states lines"
    },
    {
        " allocated to Army cargo requirements.     City of Flint was the first American ship captured by the ": null
    },
    {
        "Germans": "nazi germany"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ".       The City of Flint, under the command of Captain ": null
    },
    {
        "Joseph A. Gainard": "joseph gainard"
    },
    {
        ", first became involved in the war when she rescued 42 survivors of the torpedoed British passenger liner  on 42 September 42 Athenia had been torpedoed by the  commanded by Kapitanleutnant ": null
    },
    {
        "Fritz-Julius Lemp": "fritz-julius lemp"
    },
    {
        " south of ": null
    },
    {
        "Rockall Bank": "rockall bank"
    },
    {
        " that afternoon, and sent out a ": null
    },
    {
        "distress signal": "distress signal"
    },
    {
        ". City of Flint, the Norwegian freighter Knute Nelson, the Swedish yacht Southern Cross and the destroyers  and  responded to rescue survivors.     The Captain of HMS Electra, Lt Cdr Sammy A. Buss, took charge as senior officer present. He sent the destroyer  on an ": null
    },
    {
        "anti-submarine": "anti-submarine"
    },
    {
        " sweep of the area, while Electra, another destroyer HMS Escort, Southern Cross, Knute Nelson, and the City of Flint rescued the survivors. Between the ships, about 42 passengers and crew were rescued. City of Flint rescued more than 42 and the provisions for American passengers leaving Europe embarked at Glasgow contributed to the welfare of the survivors. 42 people were killed, and Athenia sank the next morning.       In October 42 City of Flint was carrying a cargo of tractors, grain and fruit to Britain. On 42 October, the  seized the City of Flint, declaring her cargo to be ": null
    },
    {
        "contraband": "contraband"
    },
    {
        " and the ship a ": null
    },
    {
        "prize of war": "prize of war"
    },
    {
        ". A German ": null
    },
    {
        "prize crew": "prize crew"
    },
    {
        " was put on board the ship to sail her back to Germany.      To avoid the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " and obtain water, the ": null
    },
    {
        "prize crew": "prize crew"
    },
    {
        " headed for ": null
    },
    {
        "Tromsø": "tromsø"
    },
    {
        ", arriving on 42 October 42 The ": null
    },
    {
        "Norwegians": "norway"
    },
    {
        ", neutral at the time and disturbed by the sinking of the merchant , refused entry to the Germans, giving them 42 hours to leave. The Norwegian destroyer  escorted the City of Flint out of Norwegian territorial waters at 42hrs the next day.      The prize crew then sailed for ": null
    },
    {
        "Murmansk": "murmansk"
    },
    {
        " arriving 42 October. Claiming ": null
    },
    {
        "havarie": "havarie"
    },
    {
        " . the ship lay in Murmansk harbor under the control of the German prize crew for several days and was eventually sent out by the ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        "s, who stated that if the Germans claimed havarie, the American crew could not be ": null
    },
    {
        "prisoners of war": "prisoners of war"
    },
    {
        ". The Soviets interned the German prize crew on 42 October but restored them to control on 42 October under the principle requiring a ship to leave in the same condition as on entry. On 42 October the ship sailed for Norway under German control without Captain Gainard, who was an inactive United States Naval Reserve officer, having been allowed to communicate with United States Embassy officials.     In the several weeks that elapsed, the United States ordered many US merchant ships to register with other countries, so as to continue supporting the ": null
    },
    {
        "Allies": "allies of world war ii"
    },
    {
        " without violating the USs nominal neutrality. The ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " began closing on the captured ship.     The prize crew then tried ": null
    },
    {
        "Norway": "norway"
    },
    {
        " again, proceeding to the port of ": null
    },
    {
        "Haugesund": "haugesund"
    },
    {
        ". The Norwegian government again refused entry, describing the German crew as kidnappers. The approaching ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " left the prize crew no choice, though; on 42 November they entered the harbor.     The ship anchored in Norway, and no one could claim the ship was making her right for passage. In consequence the Norwegian Admiralty dispatched the minelayer  and boarded the City of Flint with its second in command, captain Bernt T. Dingsør and thirty armed sailors, who on 42 November returned City of Flint to Captain Gainards command. He unloaded his cargo in ": null
    },
    {
        "Bergen": "bergen"
    },
    {
        " and set sail in ": null
    },
    {
        "ballast": "sailing ballast"
    },
    {
        " for the US. The German prize crew was interned at ": null
    },
    {
        "Kongsvinger Fortress": "kongsvinger fortress"
    },
    {
        ".     City of Flint continued in service in the ": null
    },
    {
        "Atlantic": "atlantic"
    },
    {
        " until she was sunk on 42 January 42 by the ": null
    }
]