[
    {
        "            SS Great Britain is a ": null
    },
    {
        "museum ship": "museum ship"
    },
    {
        " and former ": null
    },
    {
        "passenger steamship": "ocean liner"
    },
    {
        ", which was advanced for her time. She was the longest passenger ship in the world from 42 to 42 She was designed by ": null
    },
    {
        "Isambard Kingdom Brunel": "isambard kingdom brunel"
    },
    {
        " , for the ": null
    },
    {
        "Great Western Steamship Company": "great western steamship company"
    },
    {
        "s ": null
    },
    {
        "transatlantic": "transatlantic crossing"
    },
    {
        " service between ": null
    },
    {
        "Bristol": "bristol"
    },
    {
        " and ": null
    },
    {
        "New York": "new york city"
    },
    {
        ". While other ships had been built of iron or equipped with a ": null
    },
    {
        "screw propeller": "propeller"
    },
    {
        ", Great Britain was the first to combine these features in a large ocean-going ship. She was the first iron steamer to cross the ": null
    },
    {
        "Atlantic": "atlantic ocean"
    },
    {
        ", which she did in 42 in the time of 42 days.     The ship is  in length and has a 42-ton displacement. She was powered by two inclined 42 cylinder engines of the ": null
    },
    {
        "direct-acting": "marine steam enginedirect acting"
    },
    {
        " type, with twin high pressure cylinders and twin low pressure cylinders  ": null
    },
    {
        "bore": "bore"
    },
    {
        ", all of  ": null
    },
    {
        "stroke": "stroke"
    },
    {
        " cylinders": "cylinder"
    },
    {
        ". She was also provided with secondary masts for sail power. The four decks provided accommodation for a crew of 42 plus 42 passengers who were provided with cabins, and dining and promenade saloons.     When launched in 42 Great Britain was by far the largest vessel afloat. But her protracted construction time of six years and high cost had left her owners in a difficult financial position, and they were forced out of business in 42 having spent all their remaining funds refloating the ship after she ran aground at ": null
    },
    {
        "Dundrum Bay": "dundrum, county downhistory"
    },
    {
        " in ": null
    },
    {
        "County Down": "county down, northern ireland"
    },
    {
        " near ": null
    },
    {
        "Newcastle": "newcastle, northern ireland"
    },
    {
        " in what is now ": null
    },
    {
        "Northern Ireland": "northern ireland"
    },
    {
        ", after a ": null
    },
    {
        "navigation": "navigation"
    },
    {
        " error. In 42 she was sold for ": null
    },
    {
        "salvage": "marine salvage"
    },
    {
        " and repaired. Great Britain later carried thousands of ": null
    },
    {
        "immigrants": "immigration to australia"
    },
    {
        " to ": null
    },
    {
        "Australia": "australia"
    },
    {
        " from 42 until being converted to all-sail in 42 Three years later, she was retired to the ": null
    },
    {
        "Falkland Islands": "falkland islands"
    },
    {
        ", where she was used as a warehouse, quarantine ship and ": null
    },
    {
        "coal hulk": "hulk"
    },
    {
        " until she was ": null
    },
    {
        "scuttled": "scuttling"
    },
    {
        " and sunk in 42 42 years since being ": null
    },
    {
        "laid down": "keel laying"
    },
    {
        " at the start of her construction.     In 42 after Great Britain had lain under water and abandoned for 42 years half a world away, Sir ": null
    },
    {
        "Jack Arnold Hayward": "jack hayward"
    },
    {
        ", ": null
    },
    {
        "OBE": "order of the british empire"
    },
    {
        " paid for the vessel to be raised and repaired enough to be towed north through the Atlantic back to the United Kingdom, and returned to the Bristol ": null
    },
    {
        "dry dock": "dry dock"
    },
    {
        " where she had been built 42 years earlier. Hayward was a prominent businessman, developer, philanthropist and owner of the English football club ": null
    },
    {
        "Wolverhampton Wanderers": "wolverhampton wanderers f.c."
    },
    {
        ". Now listed as part of the ": null
    },
    {
        "National Historic Fleet": "national historic fleet"
    },
    {
        ", Great Britain is a visitor attraction and museum ship in ": null
    },
    {
        "Bristol Harbour": "bristol harbour"
    },
    {
        ", with between 42 and 42 visitors annually.          After the initial success of its first liner,  of 42 the ": null
    },
    {
        "Great Western Steamship Company": "great western steamship company"
    },
    {
        " collected materials for a sister ship, tentatively named City of New York. The same engineering team that had collaborated so successfully on Great Western—": null
    },
    {
        "Isambard Brunel": "isambard kingdom brunel"
    },
    {
        ", Thomas Guppy, Christopher Claxton and ": null
    },
    {
        "William Patterson": "william patterson"
    },
    {
        "—was again assembled. This time however, Brunel, whose reputation was at its height, came to assert overall control over design of the ship—a state of affairs that would have far-reaching consequences for the company. Construction was carried out in a specially adapted ": null
    },
    {
        "dry dock": "dry dock"
    },
    {
        " in ": null
    },
    {
        "Bristol": "bristol"
    },
    {
        ", England.        Two chance encounters were to profoundly affect the design of Great Britain. In late 42 ": null
    },
    {
        "John Lairds": "john laird"
    },
    {
        "  English Channel": "english channel"
    },
    {
        " packet ship": "packet ship"
    },
    {
        " Rainbow—the largest iron-": null
    },
    {
        "hulled": "hull"
    },
    {
        " ship then in service—made a stop at Bristol. Brunel despatched his associates Christopher Claxton and William Patterson to make a return voyage to ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        " on Rainbow to assess the utility of the new building material. Both men returned as converts to iron-hulled technology, and Brunel scrapped his plans to build a wooden ship and persuaded the company directors to build an iron-hulled ship.     Great Britains builders recognised a number of advantages of iron over the traditional wooden hull. Wood was becoming more expensive, while iron was getting cheaper. Iron hulls were not subject to ": null
    },
    {
        "dry rot": "dry rot"
    },
    {
        " or ": null
    },
    {
        "woodworm": "woodworm"
    },
    {
        ", and they were also lighter in weight and less bulky. The chief advantage of the iron hull was its much greater structural strength. The practical limit on the length of a wooden-hulled ship is about 42  feet, after which ": null
    },
    {
        "hogging": "hogging and sagging"
    },
    {
        "—the flexing of the hull as waves pass beneath it—becomes too great. Iron hulls are far less subject to hogging, so that the potential size of an iron-hulled ship is much greater. The ships designers, led by Brunel, were initially cautious in the adaptation of their plans to iron hulled-technology. With each successive draft however, the ship grew ever larger and bolder in conception. By the fifth draft, the vessel had grown to 42  tons, over 42  tons larger than any ship then in existence.             In early 42 a second chance encounter occurred, the arrival of the revolutionary  at Bristol, the first ": null
    },
    {
        "screw-propelled": "propeller"
    },
    {
        " steamship, completed only a few months before by ": null
    },
    {
        "F. P. Smiths": "francis pettit smith"
    },
    {
        " Propeller Steamship Company. Brunel had been looking into methods of improving the performance of Great Britains ": null
    },
    {
        "paddlewheel": "paddlewheel"
    },
    {
        "s, and took an immediate interest in the new technology. Smith, sensing a prestigious new customer for his own company, agreed to lend Archimedes to Brunel for extended tests. Over several months, Smith and Brunel tested a number of different propellers on Archimedes to find the most efficient design, a four-bladed model submitted by Smith.     Having satisfied himself as to the advantages of screw propulsion, Brunel wrote to the company directors to persuade them to embark on a second major design change, abandoning the paddlewheel engines—already half constructed—for completely new engines suitable for powering a propeller.     Brunel listed the advantages of the screw propeller over the paddlewheel as follows:     Screw propulsion machinery was lighter in weight, thus improving fuel economy;   Screw propulsion machinery could be kept lower in the hull, lowering the ships centre of gravity and making it more stable in heavy seas;   By taking up less room, propeller engines would allow more cargo to be carried;   Elimination of bulky paddle-boxes would lessen resistance through the water, and also allow the ship to manoeuvre more easily in confined waterways;   The depth of a paddlewheel is constantly changing, depending on the ships cargo and the movement of waves, while a propeller stays fully submerged and at full efficiency at all times;   Screw propulsion machinery was cheaper.     Brunels arguments proved persuasive, and in December 42 the company agreed to adopt the new technology. The decision became a costly one, setting the ships completion back by nine months.     Reporting on the ships arrival in New York, in its first issue  Scientific American  opined, If there is any thing objectionable in the construction or machinery of this noble ship, it is the mode of propelling her by the screw propeller; and we should not be surprised if it should be, ere long, superseded by paddle wheels at the sides.           The launching or, more accurately, the ": null
    },
    {
        "float-out": "float-out"
    },
    {
        " took place on 42 July 42 Conditions were generally favourable and diarists recorded that, after a dull start, the weather brightened with only a few intermittent showers. The atmosphere of the day can best be gauged from a report the following day in The Bristol Mirror:     Large crowds started to gather early in the day including many people who had travelled to Bristol to see the spectacle. There was a general atmosphere of anticipation as the Royal Emblem was unfurled. The processional route had been cleaned and Temple Street decorated with flags, banners, flowers and ribbons. Boys of the City School and girls of Red Maids were stationed in a neat orderly formation down the entire length of the Exchange. The route was a mass of colour and everybody was out on the streets as it was a public holiday. The atmosphere of gaiety even allowed thoughts to drift away from the problems of political dissension in London.      ": null
    },
    {
        "Prince Albert": "albert, prince consort"
    },
    {
        " arrived at 42 a.m. at the Great Western Railway terminus. The ": null
    },
    {
        "royal train": "british royal train"
    },
    {
        ", conducted by Brunel himself, had taken two hours and forty minutes from London.  There was a ": null
    },
    {
        "guard of honour": "guard of honour"
    },
    {
        " of members of the police force, soldiers and dragoons and, as the Prince stepped from the train, the band of the Life Guards played works by Labitsky and a selection from the Ballet of Alma . Two sections of the platform were boarded off for the reception and it was noted by The Bristol Mirror that parts were covered with carpets from the Council House. The Prince Consort, dressed as a private gentleman, was accompanied by his ": null
    },
    {
        "equerry": "equerry"
    },
    {
        "-in-waiting, personal secretary, the ": null
    },
    {
        "Marquess of Exeter": "brownlow cecil, 2nd marquess of exeter"
    },
    {
        ", and Lords ": null
    },
    {
        "Wharncliffe": "james stuart-wortley, 1st baron wharncliffe"
    },
    {
        ", ": null
    },
    {
        "Liverpool": "charles jenkinson, 3rd earl of liverpool"
    },
    {
        ", ": null
    },
    {
        "Lincoln": "henry pelham-clinton, 5th duke of newcastle"
    },
    {
        " and ": null
    },
    {
        "Wellesley": "lord charles wellesley"
    },
    {
        ".          Introductions were made, followed by the Address to His Royal Highness the Prince Albert , by the town clerk, D. Burgess. Honours were then bestowed on him by the ": null
    },
    {
        "Society of Merchant Venturers": "society of merchant venturers"
    },
    {
        ", and there were speeches from members of the Bristol clergy. The royal party then had breakfast and, after 42 minutes, reappeared to board horse-drawn carriages.     At noon, the Prince arrived at the Great Western Steamship yard only to find the ship already launched and waiting for royal inspection. He boarded the ship, took refreshments in the elegantly decorated lounge then commenced his tour of inspection. He was received in the ships banqueting room where all the local dignitaries and their ladies were gathered.     After the banquet and the toasts, he left for the naming ceremony. It had already been decided that the christening would be performed by Clarissa , wife of Philip John Miles and mother of Bristols MP, Philip William Skinner Miles , a director of the company.     She stepped forward, grasped the champagne bottle and swung it towards the bows. Unfortunately the steam packet Avon had started to tow the ship into the harbour and the bottle fell about  short of its target and dropped unbroken into the water. A second bottle was rapidly obtained and the Prince hurled it against the iron hull.     In her haste, Avon had started her work before the shore warps had been released. The tow rope snapped and, due to the resultant delay, the Prince was obliged to return to the railway station and miss the end of the programme.          Following the launch ceremony, the builders had planned to have Great Britain towed to the ": null
    },
    {
        "Thames": "thames"
    },
    {
        " for her final fitting out. Unfortunately, the harbour authorities had failed to carry out the necessary modifications to their facilities in a timely manner. Exacerbating the problem, the ship had been widened beyond the original plans to accommodate the propeller engines, and her designers had made a belated decision to fit the engines prior to launch, which resulted in a deeper ": null
    },
    {
        "draught": "draft"
    },
    {
        ".     This dilemma was to result in another costly delay for the company, as Brunels negotiations with the Bristol Dock Board dragged on for months. It was only through the intervention of the Board of Trade that the harbour authorities finally agreed to the lock modifications, begun in late 42     After being trapped in the harbour for more than a year, Great Britain was at last floated out in December 42 but not before causing more anxiety for her proprietors. After passing successfully through the first set of lock gates, she jammed on her passage through the second, which led to the ": null
    },
    {
        "River Avon": "river avon"
    },
    {
        ". Only the seamanship of Captain Claxton enabled her to be pulled back and severe structural damage avoided. The following day an army of workmen, under the direct control of Brunel, took advantage of the slightly higher tide and removed coping stones and lock gate platforms from the Junction Lock, allowing the ": null
    },
    {
        "tug": "tugboat"
    },
    {
        " Samson, again under Claxtons supervision, to tow the ship safely into the Avon that midnight.               When completed in 42 Great Britain was a revolutionary vessel—the first ship to combine an iron hull with screw propulsion, and at  in length and with a 42-ton displacement, more than  longer and 42  tons larger than any ship previously built. Her ": null
    },
    {
        "beam": "beam"
    },
    {
        " was  and her height from keel to main deck, . She had four decks, including the ": null
    },
    {
        "spar deck": "spar deck"
    },
    {
        ", a crew of 42 and was fitted to accommodate a total of 42 passengers, along with 42  tons of cargo and 42  tons of ": null
    },
    {
        "coal": "coal"
    },
    {
        " for fuel.     Like other steamships of the era, Great Britain was provided with secondary sail power, consisting of one ": null
    },
    {
        "square-rig": "square-rig"
    },
    {
        "ged and five ": null
    },
    {
        "schooner": "schooner"
    },
    {
        "-rigged masts—a relatively simple sail plan designed to reduce the number of crew required. The masts were of iron, fastened to the spar deck with iron joints, and with one exception, hinged to allow their lowering to reduce wind resistance in the event of a strong headwind. The rigging was of iron cable instead of the traditional ": null
    },
    {
        "hemp": "hemp"
    },
    {
        ", again with a view to reducing wind resistance. Another innovative feature was the lack of traditional heavy bulwarks around the main deck; a light iron railing  both reduced weight and allowed water shipped in heavy weather to run unimpeded back to sea.     The hull and single ": null
    },
    {
        "funnel": "chimney"
    },
    {
        " amidships were both finished in black paint, with a single white stripe running the length of the hull highlighting a row of false gunports. The hull was flat-bottomed, with no external ": null
    },
    {
        "keel": "keel"
    },
    {
        ", and with bulges low on each side amidships which continued toward the ": null
    },
    {
        "stern": "stern"
    },
    {
        " in an unusual implementation of ": null
    },
    {
        "tumblehome": "tumblehome"
    },
    {
        "—a result of the late decision to install propeller engines, which were wider at the base than the originally planned paddlewheel engines.     Brunel, anxious to ensure the avoidance of ": null
    },
    {
        "hogging": "hogging and sagging"
    },
    {
        " in a vessel of such unprecedented size, designed the hull to be massively redundant in strength. Ten longitudinal iron girders were installed along the keel, running from beneath the engines and boiler to the forward section. The iron ribs were  in size. The iron keel plates were an inch thick, and the hull seams were lapped and double ": null
    },
    {
        "rivet": "rivet"
    },
    {
        "ed in many places. Safety features, which also contributed to the structural strength of the vessel, included a ": null
    },
    {
        "double bottom": "double bottom"
    },
    {
        " and five watertight iron ": null
    },
    {
        "bulkheads": "bulkhead"
    },
    {
        ". The total amount of iron, including the engines and machinery, was 42  tons.          Two giant propeller engines were installed amidships. They had a combined weight of 42  tons. They were built to a modified patent of Brunels father ": null
    },
    {
        "Marc": "marc isambard brunel"
    },
    {
        ". The engines, which rose from the keel through the three lower decks to a height just below the main deck, were of the ": null
    },
    {
        "direct-acting": "marine steam enginedirect acting"
    },
    {
        " type, with twin  ": null
    },
    {
        "bore": "bore"
    },
    {
        ",  ": null
    },
    {
        "stroke": "stroke"
    },
    {
        " cylinders": "cylinder"
    },
    {
        " inclined upward at a 42° angle, capable of developing a total of  at 42  ": null
    },
    {
        "rpm": "revolutions per minute"
    },
    {
        ". Steam power was provided by three  long by  high by  wide,  square saltwater ": null
    },
    {
        "boiler": "boiler"
    },
    {
        "s, forward of the engines, with eight furnaces each  – four at each end.     In considering the gearing arrangement, Brunel had no precedent to serve as a guide. The gearing for Archimedes, of the spur-and-pinion type, had proven almost unbearably noisy, and would not be suitable for a passenger ship. Brunels solution was to install a ": null
    },
    {
        "chain drive": "chain drive"
    },
    {
        ". On the crankshaft between Great Britains two engines, he installed a  diameter primary gearwheel, which, by means of a set of four massive inverted-tooth or silent chains, operated the smaller secondary gear near the keel, which turned the propeller shaft. This was the first commercial use of silent chain technology, and the individual silent chains installed in Great Britain are thought to have been the largest ever constructed.     Great Britains main propeller shaft, built by the Mersey Iron Works, was the largest single piece of machinery.  long and  in diameter, the shaft was bored with a  diameter hole, reducing its weight and allowing cold water to be pumped through to reduce heat. At each end of the main propeller shaft were two secondary coupling shafts: a ,  diameter shaft beneath the engine, and a screw shaft of  in diameter  at the stern. Total length of the three shafts was , and the total weight 42  tons. The shaft was geared upward at a ratio of 42 to 42 so that at the engines normal operating speed of 42  rpm, the propeller turned at a speed of 42  rpm. The initial propeller was a six-bladed windmill model of Brunels own design,  in diameter and with pitch of .          The interior was divided into three decks, the upper two for passengers and the lower for cargo. The two passenger decks were divided into forward and aft compartments, separated by the engines and boiler amidships.     In the after section of the ship, the upper passenger deck contained the after or principal saloon,  long by  wide, which ran from just aft of the engine room to the stern. On each side of the saloon were corridors leading to 42 individual passenger berths, arranged two deep, a total of 42 berths for the saloon as a whole. The forward part of the saloon, nearest the engine room, contained two  ladies boudoirs or private sitting rooms, which could be accessed without entering the saloon from the 42 nearest passenger berths, reserved for females. The opposite end of the saloon opened onto the stern windows. Broad iron staircases at both ends of the saloon ran to the main deck above and the dining saloon below. The saloon was painted in delicate tints , furnished along its length with fixed chairs of ": null
    },
    {
        "oak": "oak"
    },
    {
        ", and supported by 42 decorated pillars.     Beneath the after saloon was the main or dining saloon,  long by  wide, with dining tables and chairs capable of accommodating up to 42 people at one sitting. On each side of the saloon, seven corridors opened onto four berths each, for a total number of berths per side of 42 42 altogether. The forward end of the saloon was connected to a stewards galley, while the opposite end contained several tiers of sofas. This saloon was apparently the ships most impressive of all the passenger spaces. Columns of white and gold, 42 in number, with ornamental capitals of great beauty , were arranged down its length and along the walls, while eight ": null
    },
    {
        "Arabesque": "arabesque"
    },
    {
        " pilaster": "pilaster"
    },
    {
        "s, decorated with beautifully painted oriental flowers and birds, enhanced the aesthetic effect. The archways of the doors were tastefully carved and gilded and surmounted with medallion heads. Mirrors around the walls added an illusion of spaciousness, and the walls themselves were painted in a delicate lemon-tinted hue with highlights of blue and gold.     The two forward saloons were arranged in a similar plan to the after saloons, with the upper promenade saloon having 42 berths per side and the lower 42 totalling 42 Further forward, separate from the passenger saloons, were the crew quarters. The overall finish of the passenger quarters was unusually restrained for its time, a probable reflection of the proprietors diminishing capital reserves. Total cost of construction of the ship, not including £42 for plant and equipment to build her, was £42—£42 more than her original projected price tag of £42.              On 42 July 42—seven years after the Great Western Steamship Company had decided to build a second ship, and five years overdue—Great Britain embarked on her maiden voyage, from ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        " to ": null
    },
    {
        "New York": "new york city"
    },
    {
        " under Captain ": null
    },
    {
        "James Hosken": "james hosken"
    },
    {
        ", with 42 passengers. The ship made the passage in 42 days and 42 hours, at an average speed of   – almost  slower than the prevailing record. She made the return trip in 42½ days, again an unexceptional time.     Brunel, who prior to commencement of service had substituted a six-bladed windmill design of his own for Smiths proven four-bladed propeller design, now decided to try to improve the speed by riveting an extra two inches of iron to each propeller blade. On her next crossing to New York, carrying 42 passengers, the ship ran into heavy weather, losing a mast and three propeller blades. On 42 October, she ran aground on the Massachusetts Shoals. She was refloated and after obtaining a supply of coal from the American ": null
    },
    {
        "schooner": "schooner"
    },
    {
        " David Coffin resumed her voyage.  After repairs in New York, she set out for Liverpool with only 42 passengers, and lost four propeller blades during the crossing. By this time, another design flaw had become evident. The ship rolled heavily, especially in calm weather without the steadying influence of sail, causing discomfort to passengers.     The shareholders of the company again provided further funding to try to solve the problems. The six-bladed propeller was dispensed with and replaced with the original four-bladed, cast iron design. The third mast was removed, and the iron rigging, which had proven unsatisfactory, was replaced with conventional rigging. In a major alteration, two  ": null
    },
    {
        "bilge keel": "bilge keel"
    },
    {
        "s were added to each side in an effort to lessen her tendency to roll.  These repairs and alterations delayed her return to service until the following year.          In her second season of service in 42 Great Britain successfully completed two round trips to New York at an acceptable speed, but was then laid up for repairs to one of her chain drums, which showed an unexpected degree of wear. Embarking on her third passage of the season to New York, her captain made a series of navigational errors that resulted in her being run hard aground in ": null
    },
    {
        "Dundrum Bay": "dundrum, county downhistory"
    },
    {
        " on the northeast coast of Ireland on 42 September. There was no formal inquiry but it has been recently suggested that it was mainly due to the captain not having updated charts, so that he mistook the new St Johns light for the Calf light on the Isle of Man.        She remained aground for almost a year, protected by temporary measures organised by Brunel and ": null
    },
    {
        "James Bremner": "james bremner"
    },
    {
        ".  On 42 August 42  she was floated free at a cost of £42 and taken back to Liverpool, but this expense exhausted the companys remaining reserves. After languishing in Princes Dock, Liverpool for some time, she was sold to ": null
    },
    {
        "Gibbs, Bright & Co.": "gibbs, bright  &  co."
    },
    {
        ", former agents of the Great Western Steamship Company, for a mere £42.          The new owners decided not merely to give the vessel a total refit. The keel, badly damaged during the grounding, was completely renewed along a length of , and the owners took the opportunity to further strengthen the hull. The old ": null
    },
    {
        "keelson": "keelson"
    },
    {
        "s were replaced and ten new ones laid, which ran the entire length of the keel. Both the bow and stern were also strengthened by heavy frames of double ": null
    },
    {
        "angle iron": "angle iron"
    },
    {
        ".     Reflecting the rapid advances in propeller engine technology, the original engines were removed and replaced with a pair of smaller, lighter and more modern ": null
    },
    {
        "oscillating": "marine steam engine"
    },
    {
        " engines, with  cylinders and  stroke, built by ": null
    },
    {
        "John Penn & Sons": "john penn"
    },
    {
        " of ": null
    },
    {
        "Greenwich": "greenwich"
    },
    {
        ". They were also provided with more support at the base, and supported further by the addition of both iron and wood beams running transversely across the hull, which had the added benefit of reducing engine vibration.     The cumbersome chain-drive gearing was replaced with a simpler and by now proven cog-wheel arrangement, although the gearing of the engines to the propeller shaft remained at a ratio of one to three. The three large boilers were replaced with six smaller ones, operating at  or twice the pressure of their predecessors. Along with a new  cabin on the main deck, the smaller boilers allowed the cargo capacity to be almost doubled, from 42 to 42  tons.     The four-bladed propeller was replaced by a slightly smaller three-bladed model, and the bilge keels, previously added to reduce the tendency to roll, were replaced by a heavy external oak keel for the same purpose. The five-masted schooner sail-plan was replaced by four masts, two of which were square-rigged. With the refit complete, Great Britain went back into service on the New York run. After only one further round trip she was sold again, to ": null
    },
    {
        "Antony Gibbs & Sons": "antony gibbs  &  sons"
    },
    {
        ", which planned to place her into England-Australia service.         Antony Gibbs & Sons may have intended to employ Great Britain only to exploit a temporary demand for passenger service to the Australian gold fields following ": null
    },
    {
        "the discovery of gold in Victoria in 42": "victorian gold rush"
    },
    {
        ", but she found long-term employment on this route. For her new role she was given a third refit. Her passenger accommodation was increased from 42 to 42 and her sail-plan altered to a traditional three-masted, square-rigged pattern. She was fitted with a removable propeller, which could be hauled up on deck by chains to reduce drag when under sail power alone.     In 42 Great Britain made her first voyage to ": null
    },
    {
        "Melbourne": "melbourne"
    },
    {
        ", Australia, carrying 42 ": null
    },
    {
        "emigrants": "emigration"
    },
    {
        ". She excited great interest there, with 42 people paying a shilling each to inspect her. She operated on the England–Australia route for almost 42 years, interrupted only by two relatively brief sojourns as a ": null
    },
    {
        "troopship": "troopship"
    },
    {
        " during the ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        " and the ": null
    },
    {
        "Indian Mutiny": "indian mutiny"
    },
    {
        ".  Gradually, she earned a reputation as the most reliable of the emigrant ships to Australia and carried ": null
    },
    {
        "the first English cricket team to tour Australia": "english cricket team in australia in 1861–62"
    },
    {
        " in 42      Alexander Reid, writing in 42 recorded some statistics of a typical voyage. The ship, with a crew of 42 put out from Liverpool on 42 October 42 carrying 42 passengers , a cow, 42 sheep, 42 pigs, 42 goats and 42 chickens, ducks, geese and turkeys. The journey to Melbourne occupied 42 days, during which the best days run was 42  miles and the worst 42 With favourable winds the ship travelled under sail alone, the screw being withdrawn from the water. Three passengers died en route. The captain was ": null
    },
    {
        "John Gray": "john gray"
    },
    {
        ", a Scot, who had held the post since before the Crimean War.     On Thursday 42 October 42 The Argus reported To-day, at daylight, the fine steamship Great Britain will leave her anchorage in Hobsons Bay, for Liverpool direct. On this occasion she carries less than her usual complement of passengers, the season not being a favourite one with colonists desiring to visit their native land. Great Britain, however, has a full cargo, and carries gold to the value of about £42. As she is in fine trim, we shall probably have, in due time, to congratulate Captain Gray on having achieved another successful voyage.   Gray died under mysterious circumstances, going missing overnight during a return voyage from Melbourne, on the night of 42/42 November 42              In 42 Great Britain was converted into a ": null
    },
    {
        "sailing ship": "sailing ship"
    },
    {
        " to transport bulk coal.  She made her final voyage in 42 after loading up with coal and leaving ": null
    },
    {
        "Penarth Dock": "penarth dock"
    },
    {
        " for ": null
    },
    {
        "Panama": "panama"
    },
    {
        " on 42 February.  After a fire on board en route she was found on arrival at ": null
    },
    {
        "Port Stanley": "port stanley"
    },
    {
        " in the ": null
    },
    {
        "Falkland Islands": "falkland islands"
    },
    {
        " to be damaged beyond economic repair. She was sold to the ": null
    },
    {
        "Falkland Islands Company": "falkland islands company"
    },
    {
        " and used, afloat, as a storage ": null
    },
    {
        "hulk": "hulk"
    },
    {
        " until 42 when she was towed to ": null
    },
    {
        "Sparrow Cove": "sparrow cove"
    },
    {
        ",  from Port Stanley, scuttled and abandoned.  As a bunker, she coaled the South Atlantic fleet that defeated Admiral ": null
    },
    {
        "Graf Maximilian von Spee": "graf maximilian von spee"
    },
    {
        "s fleet in the First World War ": null
    },
    {
        "Battle of the Falkland Islands": "battle of the falkland islands"
    },
    {
        ".  In the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ", some of her iron was scavenged to repair , one of the ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " ships that fought  Graf Spee  and was badly damaged during the ": null
    },
    {
        "Battle of the River Plate": "battle of the river plate"
    },
    {
        ".          The salvage operation, made possible by several large donations, including from ": null
    },
    {
        "Sir Jack Hayward": "jack hayward"
    },
    {
        " and ": null
    },
    {
        "Sir Paul Getty": "john paul getty jr."
    },
    {
        ", was organised by the SS Great Britain Project, chaired by Richard Goold-Adams. ": null
    },
    {
        "Ewan Corlett": "e. c. b. corlett"
    },
    {
        " conducted a naval architects survey, reporting that she could be refloated. A submersible ": null
    },
    {
        "pontoon": "pontoon"
    },
    {
        ", Mulus III, was chartered in February 42 A German tug, Varius II, was chartered, reaching Port Stanley on 42 March. By 42 April, after some concern about a crack in the hull, the ship was mounted successfully on the pontoon and the following day the tug, pontoon and Great Britain sailed to Port Stanley for preparations for the transatlantic voyage. The voyage began on 42 April, stopped in ": null
    },
    {
        "Montevideo": "montevideo"
    },
    {
        " from 42 May to 42 May for inspection, then across the Atlantic, arriving at ": null
    },
    {
        "Barry Docks": "barry docks"
    },
    {
        ", west of ": null
    },
    {
        "Cardiff": "cardiff"
    },
    {
        " on 42 June.  Bristol-based tugs then took over and towed her, still on her pontoon, to ": null
    },
    {
        "Avonmouth Docks": "avonmouth docks"
    },
    {
        ".     The ship was then taken off the pontoon, in preparation for her re-entry into Bristol, now truly afloat. On Sunday 42 July, amidst considerable media interest, the ship was towed up the ": null
    },
    {
        "River Avon": "river avon, bristol"
    },
    {
        " to Bristol.  Perhaps the most memorable moment for the crowds that lined the final few miles was her passage under the ": null
    },
    {
        "Clifton Suspension Bridge": "clifton suspension bridge"
    },
    {
        ", another Brunel design. She waited for two weeks in the ": null
    },
    {
        "Cumberland Basin": "cumberland basin"
    },
    {
        " for a tide high enough to get her back through the locks to the Floating Harbour and her birthplace, the dry dock in the Great Western Dockyard .         The recovery and subsequent voyage from the Falklands to Bristol were depicted in the 42 BBC ": null
    },
    {
        "Chronicle": "chronicle"
    },
    {
        " programme; The Great Iron Ship .     The original intent was to restore her to her 42 state. However, the philosophy changed and the conservation of all surviving pre42 material became the aim.  In 42 the SS Great Britain was designated as a ": null
    },
    {
        "Historic Mechanical Engineering Landmark": "list of historic mechanical engineering landmarks"
    },
    {
        " by the ": null
    },
    {
        "American Society of Mechanical Engineers": "asme"
    },
    {
        ", the fourth such designation outside the USA.      By 42 an extensive survey discovered that the hull was continuing to corrode in the ": null
    },
    {
        "humid": "humid"
    },
    {
        " atmosphere of the dock and estimates gave her 42 years before she corroded away.  Extensive conservation work began which culminated in the installation of a glass plate across the dry dock at the level of her water line, with two ": null
    },
    {
        "dehumidifiers": "dehumidifiers"
    },
    {
        ", keeping the space beneath at 42% relative humidity, sufficiently dry to preserve the surviving material.    This being completed, the ship was re-launched in July 42 and visitor access to the dry dock was restored.  The site is visited by over 42 visitors per year with a peak in numbers in 42 when 42 people visited.         The engineers Fenton Holloway won the ": null
    },
    {
        "IStructE Award": "istructe awards"
    },
    {
        " for Heritage Buildings in 42 for the restoration of Great Britain. In May of that year the ship won the prestigious ": null
    },
    {
        "Gulbenkian Prize": "gulbenkian prize"
    },
    {
        " for museums and galleries. The chairman of the judging panel, Professor ": null
    },
    {
        "Robert Winston": "robert winston"
    },
    {
        ", commented:           The project won ": null
    },
    {
        "The Crown Estate Conservation Award": "the crown estate conservation award"
    },
    {
        " in 42  and the ": null
    },
    {
        "European Museum of the Year Award": "european museum of the year award"
    },
    {
        "s ": null
    },
    {
        "Micheletti Prize": "micheletti prize"
    },
    {
        " for Best Industrial or Technology Museum.  In 42 the educational value of the project was honoured by the Sandford Award for Heritage Education.  Despite the awards received by Great Britain, the way in which the exhibition is presented has been criticised as presenting a particular viewpoint on cultural history in general and the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        " in particular.           Great Britain featured in several television specials.   The ": null
    },
    {
        "ITV42": "itv1"
    },
    {
        " series  The West Country Tonight , in July 42 told five aspects of the Great Britains story: her history, her restoration and Bristolians memories of her return to the city, showing their home footage of the event. Correspondent Robert Murphy travelled to ": null
    },
    {
        "Grand Bahama": "grand bahama"
    },
    {
        " for an exclusive interview with ": null
    },
    {
        "Sir Jack Hayward": "sir jack hayward"
    },
    {
        ", then moved to the ": null
    },
    {
        "Falkland Islands": "falkland islands"
    },
    {
        " where he spoke with islanders who worked in the salvage team.    A ": null
    },
    {
        "BBC West": "bbc west"
    },
    {
        " documentary called  When Brunels Ship Came Home  tells the story of the salvage operation and was broadcast on BBC One in the West of England on 42 July 42 It includes memories of many of the people who were involved.    A 42-minute animated short film called The Incredible Journey produced with the ": null
    },
    {
        "University of the West of England": "university of the west of england"
    },
    {
        " tells the story of the ships return to Bristol from the Falklands in 42    In 42 it was announced that the new British passport will include an image of the SS Great Britain on a page of Iconic Innovations.     The ": null
    },
    {
        "Living TV": "living tv"
    },
    {
        " series  Most Haunted  went on the ship in 42       Length:    Beam :    Height :     Weight unladen:    Displacement:      Engine    Weight:    Cylinders: 42 x inverted V  ": null
    },
    {
        "bore": "bore"
    },
    {
        "   Stroke:    Pressure:    RPM: Max. 42 ": null
    },
    {
        "rpm": "revolutions per minute"
    },
    {
        "   Main Crankshaft:  long and  diameter     Propeller    Weight:    Speed: 42  rpm   Other data  of coal   Water capacity:    Cargo capacity: ": null
    }
]