[
    {
        "     Stalag 42 is a 42 ": null
    },
    {
        "comedy-drama": "comedy-drama"
    },
    {
        " war film": "war film"
    },
    {
        " which tells the story of a group of ": null
    },
    {
        "American airmen": "united states army air forces"
    },
    {
        " held in a ": null
    },
    {
        "German": "nazi germany"
    },
    {
        " World War II": "world war ii"
    },
    {
        " prisoner of war": "prisoner of war"
    },
    {
        " camp, who come to suspect that one of their number is an informant. The film was adapted by ": null
    },
    {
        "Billy Wilder": "billy wilder"
    },
    {
        " and ": null
    },
    {
        "Edwin Blum": "edwin blum"
    },
    {
        " from the ": null
    },
    {
        "Broadway": "broadway"
    },
    {
        " play of the same name by ": null
    },
    {
        "Donald Bevan": "donald bevan"
    },
    {
        " and ": null
    },
    {
        "Edmund Trzcinski": "edmund trzcinski"
    },
    {
        ", which was based on their experiences as prisoners in ": null
    },
    {
        "Stalag": "stalag"
    },
    {
        " 42B in ": null
    },
    {
        "Austria": "austria"
    },
    {
        ".     Produced and directed by Wilder, it starred ": null
    },
    {
        "William Holden": "william holden"
    },
    {
        " in his ": null
    },
    {
        "Oscar": "academy awards"
    },
    {
        "-winning role, ": null
    },
    {
        "Don Taylor": "don taylor"
    },
    {
        ", ": null
    },
    {
        "Robert Strauss": "robert strauss"
    },
    {
        ", ": null
    },
    {
        "Neville Brand": "neville brand"
    },
    {
        ", ": null
    },
    {
        "Harvey Lembeck": "harvey lembeck"
    },
    {
        ", ": null
    },
    {
        "Peter Graves": "peter graves"
    },
    {
        ", ": null
    },
    {
        "Sig Ruman": "sig ruman"
    },
    {
        " and ": null
    },
    {
        "Otto Preminger": "otto preminger"
    },
    {
        ". Strauss and Lembeck both appeared in the original Broadway production.       Stalag 42 begins on the longest night of the year in 42 in a ": null
    },
    {
        "Luftwaffe prisoner-of-war camp": "stalag"
    },
    {
        " somewhere along the ": null
    },
    {
        "Danube River": "danube"
    },
    {
        ". The story is narrated by Clarence Harvey Cookie Cook. The camp holds Poles, Czechs, Russian women and, in the American compound, 42 sergeants from bomber crews, gunners, radiomen, and flight engineers.     Manfredi and Johnson try to escape through a ": null
    },
    {
        "tunnel": "escape tunnel"
    },
    {
        ", but are shot by waiting guards when they emerge outside the barbed wire fence. The other prisoners conclude that one of their own must have told the Germans. Suspicion falls on Sefton, an enterprising cynic who barters openly with the German guards for eggs, silk stockings, blankets and other luxuries. He also organizes rat races and various other profitable ventures. Sefton tells the men it is foolish to try to escape.     The lives of the prisoners are depicted: they receive mail, eat terrible food, wash in the latrine sinks, and collectively do their best to keep sane and defy the camps commandant, ": null
    },
    {
        "Oberst": "oberst"
    },
    {
        " von Scherbach. They use a clandestine radio, smuggled from barracks to barracks, to pick up the BBC and the war news. One German guard, ": null
    },
    {
        "Feldwebel": "feldwebel"
    },
    {
        " Schulz, confiscates the radio in another success for the stoolie.     Animal Kuzawa is infatuated with movie star ": null
    },
    {
        "Betty Grable": "betty grable"
    },
    {
        ", and becomes depressed when he learns she has married bandleader ": null
    },
    {
        "Harry James": "harry james"
    },
    {
        ". Harry Sugar Lips Shapiro gets seven letters at mail call and makes Animal think they are from women. When Kuzawa sees a finance company letterhead, Harry admits they repossessed his ": null
    },
    {
        "Plymouth": "plymouth"
    },
    {
        ".     Sefton bribes the guards to let him spend the day in the Russian womens barracks. The other prisoners conclude that this is his reward for having informed the Germans about the radio. When he returns, he is accused of being a spy.     Then von Scherbach takes Lieutenant James Schuyler Dunbar, a temporary inmate, away. Dunbar admitted to the other prisoners that he had blown up a passing German ammunition train while he was being transported to the camp. Sefton resents Dunbar for coming from a wealthy Boston family. The men are convinced that Sefton betrayed Dunbar, so they beat him up and ostracize him. Sefton then focuses more effort on uncovering the identity of the real spy. During a fake air raid, he remains unnoticed in the evacuated barracks and overhears the barracks security chief, Price, talking with Schulz in German and divulging the means by which Dunbar destroyed the train . Sefton considers what to do. If he exposes Price, the Germans will simply remove him and plant him in another camp. Killing him could expose the entire barracks to retaliatory execution.     On Christmas Day, the men find out that ": null
    },
    {
        "SS": "schutzstaffel"
    },
    {
        " men are coming to take Dunbar to Berlin for his sabotage. They create a diversion, free Dunbar, and hide him in the Water Tower. Nobody but Hoffy, the compound chief, knows where he is. The Germans, despite extensive efforts, are unable to find Dunbar. After von Scherbach threatens to raze the camp if necessary, the men decide one of them must get Dunbar out. Price volunteers, but then Sefton accuses him of being a spy. Sefton asks him, When was ": null
    },
    {
        "Pearl Harbor": "attack on pearl harbor"
    },
    {
        "? Price knows the date, but Sefton quickly asks what time he heard the news. Without thinking, Price answers 42 oclock and that he was eating dinner — the correct time in Berlin, but not in Cleveland, Ohio, his claimed hometown. Sefton then reaches into Prices jacket pocket and extracts the mailbox used to exchange messages with the Germans, a hollowed-out black chess queen.     Sefton decides to take Dunbar out himself because he likes the odds this time and the expected reward from Dunbars family. The men give Sefton enough time to get Dunbar out of the water tower above one of the latrines, then throw Price out into the yard with tin cans tied to his legs. The ruse works: Price is killed in a hail of bullets, creating a diversion that allows Sefton and Dunbar to cut through the barbed wire and escape. A pleased Cookie whistles ": null
    },
    {
        "When Johnny Comes Marching Home": "when johnny comes marching home"
    },
    {
        " as things can be seen returning to normal in the barracks.       ": null
    },
    {
        "William Holden": "william holden"
    },
    {
        " as J.J. Sefton   ": null
    },
    {
        "Don Taylor": "don taylor"
    },
    {
        " as Lieutenant James Dunbar   ": null
    },
    {
        "Otto Preminger": "otto preminger"
    },
    {
        " as Colonel von Scherbach   ": null
    },
    {
        "Robert Strauss": "robert strauss"
    },
    {
        " as Stanislas Animal Kuzawa   ": null
    },
    {
        "Harvey Lembeck": "harvey lembeck"
    },
    {
        " as Harry Shapiro   ": null
    },
    {
        "Peter Graves": "peter graves"
    },
    {
        " as Price   ": null
    },
    {
        "Sig Ruman": "sig ruman"
    },
    {
        " as Sergeant Johann Sebastian Schulz   ": null
    },
    {
        "Neville Brand": "neville brand"
    },
    {
        " as Duke   ": null
    },
    {
        "Richard Erdman": "richard erdman"
    },
    {
        " as Hoffy Hoffman   Michael Moore as Manfredi   ": null
    },
    {
        "Peter Baldwin": "peter baldwin"
    },
    {
        " as Johnson   Robinson Stone as Joey   Robert Shawley as Blondie Peterson   ": null
    },
    {
        "William Pierson": "william pierson"
    },
    {
        " as Marko the Mailman   ": null
    },
    {
        "Gil Stratton": "gil stratton"
    },
    {
        " as Clarence Harvey Cookie Cook   ": null
    },
    {
        "Jay Lawrence": "jay lawrence"
    },
    {
        " as Bagradian   ": null
    },
    {
        "Erwin Kalser": "erwin kalser"
    },
    {
        " as Geneva Man   ": null
    },
    {
        "Edmund Trzcinski": "edmund trzcinski"
    },
    {
        " as himself/ Triz   ": null
    },
    {
        "Paul Salata": "paul salata"
    },
    {
        " as Prisoner with Beard         The film was adapted by Wilder and ": null
    },
    {
        "Edwin Blum": "edwin blum"
    },
    {
        " from the Broadway play by ": null
    },
    {
        "Donald Bevan": "donald bevan"
    },
    {
        " and ": null
    },
    {
        "Edmund Trzcinski": "edmund trzcinski"
    },
    {
        " which was based on their experiences as prisoners in ": null
    },
    {
        "Stalag": "stalag"
    },
    {
        " 42B in ": null
    },
    {
        "Austria": "austria"
    },
    {
        ". Trzcinski appears in the film as a prisoner.     The play was directed by ": null
    },
    {
        "José Ferrer": "josé ferrer"
    },
    {
        " and was the Broadway debut of ": null
    },
    {
        "John Ericson": "john ericson"
    },
    {
        " as Sefton. First presented at the Edwin Burke Memorial Theater of ": null
    },
    {
        "The Lambs": "the lambs"
    },
    {
        ", a theatrical club, on March 42 42 . It began its Broadway run in May 42 and continued for 42 performances. The character Sefton was loosely based on Joe Palazzo, a flier in Trzcinskis prisoner-of-war barracks. The script was rewritten extensively by Wilder and Blum.       Both ": null
    },
    {
        "Charlton Heston": "charlton heston"
    },
    {
        " and ": null
    },
    {
        "Kirk Douglas": "kirk douglas"
    },
    {
        " were considered for the role of Sefton.        The prison camp set was built on the John Show Ranch in ": null
    },
    {
        "Woodland Hills": "woodland hills, california"
    },
    {
        ", on the southwestern edge of the ": null
    },
    {
        "San Fernando Valley": "san fernando valley"
    },
    {
        ".  The shoot began in February 42 during the rainy season in California, providing plenty of mud for the camp compound.  It is now the location of a ": null
    },
    {
        "meetinghouse": "meetinghouse"
    },
    {
        " of ": null
    },
    {
        "the Church of Jesus Christ of Latter-day Saints": "the church of jesus christ of latter-day saints"
    },
    {
        ".       The film was shot in chronological order, an unusual practice as that method is usually much more expensive and time-consuming. In a ": null
    },
    {
        "featurette": "featurette"
    },
    {
        " released later, members of the cast said that they themselves did not know the identity of the informant until the last three days of shooting.     Peter Graves recalled the film was held from release for over a year due to Paramount Pictures not believing anyone would be interested in seeing a film about prisoners of war. The 42 release of American POWs from the ": null
    },
    {
        "Korean War": "korean war"
    },
    {
        " led Paramount to release it on an ": null
    },
    {
        "exploitation": "exploitation film"
    },
    {
        " angle. p.42 Weaver, Tom Peter Graves Interview in Earth Vs. the Sci-fi Filmmakers: 42 Interviews McFarland, 42 Jan 42       Stalag 42 was a commercial success. Produced on a budget of $42,42 it earned $42 million in US ": null
    },
    {
        "theatrical rentals": "gross rental"
    },
    {
        " The Top Box Office Hits of 42  Variety , January 42 42 and $42 million in worldwide markets. The film was well received and is considered, along with  The Great Escape  and  The Bridge on the River Kwai  , among the best ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " Prisoner of War": "prisoner of war"
    },
    {
        " films. ": null
    },
    {
        "Bosley Crowther": "bosley crowther"
    },
    {
        " praised the film, calling it cracker jack movie entertainment .  More recently, film critic ": null
    },
    {
        "James Berardinelli": "james berardinelli"
    },
    {
        " stated that among the 42th century directors, few were more versatile than Billy Wilder .  The film currently has a 42% Fresh rating on ": null
    },
    {
        "Rotten Tomatoes": "rotten tomatoes"
    },
    {
        ", based on 42 reviews, and the sites consensus stating: Stalag 42 survives the jump from stage to screen with flying colors, thanks to Billy Wilders typically sterling direction and a darkly funny script.        Holden won the Academy Award for ": null
    },
    {
        "Best Actor in a Leading Role": "academy award for best actor"
    },
    {
        ". His acceptance speech is one of the shortest on record ; the TV broadcast had a strict cutoff time which forced Holdens quick remarks. The frustrated Holden personally paid for advertisements in the Hollywood trade publications to thank everyone he wanted to on Oscar night. He also remarked that he felt that either ": null
    },
    {
        "Burt Lancaster": "burt lancaster"
    },
    {
        " or ": null
    },
    {
        "Montgomery Clift": "montgomery clift"
    },
    {
        " should have won the Best Actor Oscar for  From Here to Eternity  instead of him. It is said that he felt he was given the award as consolation for not having previously won it for  Sunset Boulevard .     In addition, Wilder was nominated for the ": null
    },
    {
        "Best Director Oscar": "academy award for best director"
    },
    {
        ", and Strauss for ": null
    },
    {
        "Best Supporting Actor": "academy award for best supporting actor"
    },
    {
        ".        The television series ": null
    },
    {
        "Hogans Heroes": "hogans heroes"
    },
    {
        " is based on a similar ": null
    },
    {
        "Stalag": "stalag"
    },
    {
        ".   ": null
    },
    {
        "Stalag 42": "stalag riddim"
    },
    {
        " is a 42 ": null
    },
    {
        "reggae": "reggae"
    },
    {
        " riddim": "riddim"
    },
    {
        ", composed by ": null
    },
    {
        "Ansell Collins": "ansell collins"
    },
    {
        " and named after the film.   The episode ": null
    },
    {
        " Did You See The Sunrise? ": "list of magnum, p.i. episodesep41"
    },
    {
        " , of the television series  Magnum, P.I. , opens with Stalag 42": null
    }
]