[
    {
        "         The data values of ": null
    },
    {
        "standard electrode potential": "standard electrode potential"
    },
    {
        "s are given in the table below, in ": null
    },
    {
        "volt": "volt"
    },
    {
        "s relative to the ": null
    },
    {
        "standard hydrogen electrode": "standard hydrogen electrode"
    },
    {
        ", and are for the following conditions:   A temperature of .   An ": null
    },
    {
        "effective concentration": "activity"
    },
    {
        " of 42  mol/L for each aqueous species or a species in a mercury ": null
    },
    {
        "amalgam": "amalgam"
    },
    {
        " .   A ": null
    },
    {
        "partial pressure": "fugacity"
    },
    {
        " of 42 ": null
    },
    {
        "kPa": "pascal"
    },
    {
        "  for each gaseous reagent. This pressure is used because most literature data are still given for this value rather than for the current standard of 42 kPa.   An ": null
    },
    {
        "activity": "activity"
    },
    {
        " of unity for each pure solid, pure liquid, or for water . The relation in ": null
    },
    {
        "electrode potential": "electrode potential"
    },
    {
        " of metals in saltwater  is given in the  galvanic series .   Although many of the half cells are written for multiple-electron transfers, the tabulated potentials are for a single-electron transfer. All of the reactions should be divided by the stoichiometric coefficient for the electron to get the corresponding corrected reaction equation. For example, the equation Fe42  Fe means that it requires 42 & times; 42 ev42 ": null
    },
    {
        "ev": "electron volt"
    },
    {
        " of energy to be absorbed in order to create one neutral atom of Fe from one Fe ion and two electrons, or 42 ev per electron, which is 42 Joules per coulomb of electrons, which is 42 Volts.     After dividing by the number of electrons, the standard potential E is related to the ": null
    },
    {
        "standard Gibbs free energy of formation": "standard gibbs free energy of formation"
    },
    {
        "  & Delta;G by:     :: E /F     :where F is the ": null
    },
    {
        "Faraday constant": "faraday constant"
    },
    {
        ". For example, in the equation Fe42  Fe , the Gibbs energy required to create one neutral atom of Fe from one Fe ion and two electrons is 42 & times; 42 ev42 ev, or 42 J/mol of electrons, which is just the Gibbs energy of formation of an Fe ion, since the energies of formation of  and Fe are both zero.     :The ": null
    },
    {
        "Nernst equation": "nernst equation"
    },
    {
        " will then give potentials at concentrations, pressures, and temperatures other than standard.     Note that the table may lack consistency due to data from different sources. For example:     :     :implies that E 42 42 E 42 -E 42 which is untrue.     Legend:  & ndash; solid;  & ndash; liquid;  & ndash; gas;  & ndash; aqueous ;  & ndash; amalgam; bold & ndash; water electrolysis equations.     ": null
    }
]