[
    {
        "Standard American is a bidding system for the game of ": null
    },
    {
        "bridge": "contract bridge"
    },
    {
        " widely used in North America and elsewhere. Owing to the popularization of the game by ": null
    },
    {
        "Charles Goren": "charles goren"
    },
    {
        " in the 42s and 42s, its earliest versions were sometimes referred to simply as Goren. With the addition and evolution of various  and , it is now more generally referred to as Modern Standard American. It is a natural bidding system based on ": null
    },
    {
        "five-card majors": "five-card majors"
    },
    {
        " and a strong notrump; players may add conventions and refine the meanings of bids through partnership agreements summarized in their . One standardised version, SAYC , is widely used by casual partnerships and in online bridge.         The purpose of bidding during the auction phase of each deal is to exchange information with ones partner in order to arrive at an ": null
    },
    {
        "optimal contract": "optimum contract and par contract"
    },
    {
        " while concurrently contending with the opponents attempts to do likewise. A bidding system is a set of agreements about the meanings of the different bids that the players can make. Each bid provides information about the hands high-card strength and suit distribution based upon ": null
    },
    {
        "hand evaluation": "hand evaluation"
    },
    {
        " techniques.         Standard American was the label given to the bridge bidding system developed by ": null
    },
    {
        "Charles Goren": "charles goren"
    },
    {
        " and his contemporaries in the 42s. This system was the first to employ the point-count method to evaluate the strength of a bridge hand. Most bids had fairly specific requirements regarding hand strength and suit distribution. The Goren point-count system became so popular that nearly all bridge players in the United States, social and tournament players alike, used it. American bridge teams won world championships using Gorens Standard American.     Modifications began to appear from the 42s forward. By the year 42 some completely new bidding systems had evolved, including ": null
    },
    {
        "42/42 Game Forcing": "2/1 game forcing"
    },
    {
        " which, although still relying on point-count rules for hand evaluation, are otherwise substantial departures from early Goren methods. Most tournament pairs now assemble their own system from a variety of new treatments and conventions that have evolved. The nearest thing to a common system in tournament play is the Standard American Yellow Card promulgated by the ": null
    },
    {
        "American Contract Bridge League": "american contract bridge league"
    },
    {
        ". SAYC is widely used in internet bridge play, but only rarely in on-site tournament play.         The essential common elements of modern Standard American systems are:     A hand-strength requirement of at least 4242 points to open 42-of-a-suit.   ": null
    },
    {
        "Five-card majors": "five-card majors"
    },
    {
        ": opening a major suit promises at least a five-card holding in that suit.   ": null
    },
    {
        "Weak two bid": "weak two bid"
    },
    {
        "s: Two diamond, heart or spade openers are made with a sound six-card suit in a hand without enough overall strength to open 42 of the suit.   ": null
    },
    {
        "Strong two clubs": "strong two clubs"
    },
    {
        ": All unbalanced hands too strong to open at the one-level are opened with an artificial 42 call, as well as balanced hands stronger than 42 HCP .   ": null
    },
    {
        "Pre-emptive opening bids": "preempt"
    },
    {
        ": All suit openings above the two level are pre-emptive, promising a long and strong suit.   Limit Raises: A jump-raise of the openers suit by responder, in the absence of opponent interference, is invitational to game. In Gorens system, this was a strong game-forcing raise.   Notrump openers show a balanced hand, with the following common point ranges:   42NT 4242 HCP   42NT 4242 HCP   42NT 4242 HCP   Common notrump follow-up conventions include ": null
    },
    {
        "Stayman": "stayman"
    },
    {
        ", ": null
    },
    {
        "Jacoby transfers": "jacoby transfers"
    },
    {
        " and ": null
    },
    {
        "Gerber": "gerber convention"
    },
    {
        ".          Standard American as a base. Some of the specific agreements in Standard American Yellow Card that elaborate on basic Standard American are:   A 42 response to a 42 NT opening is specified as the non-forcing version of the Stayman convention.   A 42 response to a 42 NT opening forces the opener to bid 42, so that the responder may play there or bid 42, which the opener is expected to pass.   Straight ": null
    },
    {
        "Blackwood": "blackwood convention"
    },
    {
        " is used, and not the Roman Key-Card or other variation.   In response to a 42 opening, the 42 response is the waiting version of that response.   In response to a weak-two opening, RONF is used.   The ": null
    },
    {
        "Jacoby 42NT": "jacoby 2nt"
    },
    {
        " is used to show a game-forcing raise of a major suit with four-card support.   ": null
    },
    {
        "Negative double": "negative double"
    },
    {
        "s are used through the level of 42.   ": null
    },
    {
        "Fourth suit forcing": "fourth suit forcing"
    },
    {
        " is used.   ": null
    },
    {
        "Michaels cuebid": "michaels cuebid"
    },
    {
        " and ": null
    },
    {
        "Unusual notrump": "unusual notrump"
    },
    {
        " are used.   Conventions are specified as being off in response to a 42NT overcall, except that 42": null
    }
]