[
    {
        "   A stand-in for ": null
    },
    {
        "film": "film"
    },
    {
        " and ": null
    },
    {
        "television": "television"
    },
    {
        " is a person who substitutes for the actor before filming, for technical purposes such as lighting and camera setup.   Stand-ins are helpful in the initial processes of film and television production.     Stand-ins allow the ": null
    },
    {
        "director of photography": "director of photography"
    },
    {
        " to light the set and the camera department to light and focus scenes while the actors are absent. The director will often ask stand-ins to deliver the scene dialogue and walk through the scenes to be filmed.     Stand-ins are distinguished from ": null
    },
    {
        "body double": "body double"
    },
    {
        "s, who replace actors on camera from behind, in makeup, or during dangerous stunts. Stand-ins do not appear on camera. However, on some productions the jobs of stand-in and double may be done by the same person. In rare cases, a stand-in will appear on screen, sometimes as an in-joke. For instance, the actress who pretends to be Ann Darrow in the stage show during the final act of  King Kong  is played by ": null
    },
    {
        "Naomi Watts": "naomi watts"
    },
    {
        " stand-in, Julia Walshaw.     Stand-ins do not necessarily look like the actor, but they must have the same skin tone, hair color, height and build as the actor so that the lighting in a scene will be set up correctly. For example, if the lighting is set up with a stand-in shorter than an actor, the actor might end up having his or her head in relative darkness.     Stand-ins are also used for animated characters in a live-action film, sometimes with life-size character models, so that the animators know where to place their animation and how to make them move realistically, and for actors to know where to look. In these cases, skin tone and hair color are not so important. Height and build, however, are still important for any interactions between live-action and animated characters.     Some celebrities mandate that they will always have the same stand-in. Famous cases include Pluma Noisom , Harry Cornbleth  and Adam Bryant . When ": null
    },
    {
        "Bette Davis": "bette davis"
    }
]