[
    {
        "A standard data model or industry standard data model is a ": null
    },
    {
        "data model": "data model"
    },
    {
        " that is widely applied in some industry, and shared amongst competitors to some degree. They are often defined by ": null
    },
    {
        "standards bodies": "standards bodies"
    },
    {
        ", ": null
    },
    {
        "database vendor": "database vendor"
    },
    {
        "s or ": null
    },
    {
        "operating system vendor": "operating system vendor"
    },
    {
        "s.     When in use, they enable easier and faster information sharing because heterogeneous organizations have a standard vocabulary and pre-negotiated semantics, format, and quality standards for exchanged data. The standardization affects ": null
    },
    {
        "software architecture": "software architecture"
    },
    {
        " as solutions that vary from the standard may cause ": null
    },
    {
        "data sharing": "data sharing"
    },
    {
        " issues and problems if data is out of compliance with the standard.     The more effective standard models have developed in the banking, insurance, ": null
    },
    {
        "pharmaceutical": "pharmaceutical"
    },
    {
        " and automotive industries, to reflect the stringent standards applied to customer information gathering, ": null
    },
    {
        "customer privacy": "customer privacy"
    },
    {
        ", ": null
    },
    {
        "consumer safety": "consumer safety"
    },
    {
        ", or ": null
    },
    {
        "just in time manufacturing": "just in time"
    },
    {
        ".     Typically these use the popular ": null
    },
    {
        "relational model": "relational model"
    },
    {
        " of database management, but some use the ": null
    },
    {
        "hierarchical model": "hierarchical model"
    },
    {
        ", especially those used in manufacturing or mandated by governments, e.g., the ": null
    },
    {
        "DIN": "din"
    },
    {
        " codes specified by ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". While the format of the standard may have implementation trade-offs, the underlying goal of these standards is to make sharing of data easier.     The most complex data models known are in military use, and consortia such as ": null
    },
    {
        "NATO": "nato"
    },
    {
        " tend to require strict standards of their members equipment and supply databases. However, they typically do not share these with non-NATO competitors, and so calling these standard in the same sense as ": null
    },
    {
        "commercial software": "commercial software"
    },
    {
        " is probably not very appropriate.         ": null
    },
    {
        "ISO 42": "iso 10303"
    },
    {
        " CAE Data Exchange Standard - includes its own data modelling language, EXPRESS   ": null
    },
    {
        "ISO 42": "iso 15926"
    },
    {
        " Process Plants including Oil and Gas facilities Life-Cycle data   ": null
    },
    {
        "IDEAS Group": "ideas group"
    },
    {
        " Foundation Ontology agreed by defence departments of Australia, Canada, France, Sweden, UK and USA   ": null
    },
    {
        " EN42": "transmodel"
    },
    {
        " CEN Reference Data Model For Public Transport. covering public transport scheduling, fare management, operations and passenger information   ": null
    },
    {
        "Common Education Data Standards ": "common education data standards"
    },
    {
        " is a data dictionary sponsored by the US government that is used widely in the United States education vertical   ": null
    },
    {
        "SIF": "schools interoperability framework"
    }
]