[
    {
        "In ": null
    },
    {
        "NATO": "nato"
    },
    {
        ", a Standardization Agreement  defines processes, procedures, terms, and conditions for common ": null
    },
    {
        "military": "military"
    },
    {
        " or technical procedures or equipment between the member countries of the alliance. Each NATO state ratifies a STANAG and implements it within their own military. The purpose is to provide common operational and administrative procedures and ": null
    },
    {
        "logistics": "logistics"
    },
    {
        ", so one member nations military may use the stores and support of another members military.   STANAGs also form the basis for technical interoperability between a wide variety of communication and information systems essential for NATO and Allied operations. The Allied Data Publication 42 ": null
    },
    {
        "NATO Interoperability Standards and Profiles": "nato interoperability standards and profiles"
    },
    {
        " which is covered by STANAG 42 maintains a catalogue of relevant ": null
    },
    {
        "information and communication technology": "information and communications technology"
    },
    {
        " standards.     STANAGs are published in ": null
    },
    {
        "English": "english language"
    },
    {
        " and ": null
    },
    {
        "French": "french language"
    },
    {
        ", the two official ": null
    },
    {
        "language": "language"
    },
    {
        "s of NATO, by the ": null
    },
    {
        "NATO Standardization Office": "nato standardization office"
    },
    {
        " in ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ".     Among the hundreds of standardization agreements  are those for ": null
    },
    {
        "calibre": "caliber"
    },
    {
        "s of small arms ": null
    },
    {
        "ammunition": "ammunition"
    },
    {
        ", map markings, communications procedures, and classification of bridges.          STANAG 42 : Characteristics of Shipboard Electrical Power Systems in Warships of the North Atlantic Treaty Navies   STANAG 42 : Combat Charts, Amphibious Charts and Combat/Landing Charts   STANAG 42 : Allied Naval Gunfire Support   STANAG 42 : Naval Cooperation and Guidance for Shipping   STANAG 42 : Anti-Submarine Evasive Steering   STANAG 42 : Allied Submarine and Anti-Submarine Exercise Manual    STANAG 42  : ": null
    },
    {
        "National Distinguishing Letters for Use by NATO Armed Forces": "list of nato country codes"
    },
    {
        " STANAG 42 : Allied Naval Communications Exercises    STANAG 42  : Glide Slope Indicators for Helicopter Operations from NATO Ships    STANAG 42  : NVD Compatible Flight Deck Status Displays on Single Ships   STANAG 42 : Patrol Reports   STANAG 42 : Operations Plans, Warning Orders, and Administrative/Logistics Orders   STANAG 42 : NATO Joint Military Symbology & ndash; ": null
    },
    {
        "NATO Military Symbols for Land Based Systems": "nato military symbols for land based systems"
    },
    {
        "   STANAG 42 Military Load Classification of Bridges, Rafts and Vehicles   STANAG 42 Intelligence Reports   STANAG 42 Interrogation of Prisoners of War   STANAG 42 : Operations Orders, Tables and Graphics for Road Movement   STANAG 42 : Procedures for Dealing with Prisoners of War   STANAG 42 Radiological Hazards   STANAG 42 : Handling and Reporting of Captured Enemy Equipment and Documents   STANAG 42 Medical Employment of Air Transport in the Forward Area   STANAG 42 : Nomenclature and Classification of Equipment   STANAG 42 - this STANAG covers, among other subjects, NATO official rank grade comparisons covering ": null
    },
    {
        "Ranks and insignia of NATO": "ranks and insignia of nato"
    },
    {
        " STANAG 42 : Troop trial Principles and Procedures - Combat Clothing and Personal Equipment   STANAG 42 : Explosive Ordnance Reconnaissance/Explosive Ordnance Disposal   STANAG 42 : Intelligence Request   STANAG 42 Regulations for Military Motor Vehicle Movement by Road   STANAG 42 : Classification and Designation of Flat Wagons Suitable for Transporting Military Equipment   STANAG 42 ": null
    },
    {
        "42×42mm NATO": "7.62×51mm nato"
    },
    {
        " adopted in the 42s as the standard infantry rifle cartridge up until the 42s   , US Army RDECOM, 42 May 42    STANAG 42  The adoption of the US ": null
    },
    {
        "MIL-STD42": "mil-std-1913"
    },
    {
        " Picatinny rail": "picatinny rail"
    },
    {
        " as the NATO standard optical and electronic sight mount and standard accessory rail. See also ": null
    },
    {
        "42": "nato accessory rail"
    },
    {
        ".   STANAG 42 : Evaluation and control of personnel exposure to radio frequency fields - 42  kHz to 42  GHz   STANAG 42 : Minimum Standards of Proficiency for Trained Explosive Ordnance Disposal Personnel   STANAG 42 : Joint Anti-Armor Operations   STANAG 42: Allied Joint Doctrine for Communications and Information Systems   STANAG 42 : Braking Systems Between Tractors, Draw Bar Trailer And Semi-trailer Equipment Combinations For Military Use   STANAG 42 Fording and Flotation Requirements for Combat and Support Ground Vehicles   STANAG 42 : Restrictions for the Transport of Military Equipment by Rail on European Railways   STANAG 42 : The Operation of the Explosive Ordnance Disposal Technical Information Center   STANAG 42 Medical Effects of Ionizing Radiation on Personnel   STANAG 42 : Land Force Tactical Doctrine   STANAG 42 Medical Support Operations in an NBC Environment   STANAG 42 : Marking of Hazardous Areas and Routes Through Them   STANAG 42 Extreme Climatic Conditions and Derived Conditions for Use in Defining Design/Test Criteria for NATO Forces Materiel   STANAG 42 The adoption of standards for ballistic protection levels and testing   STANAG 42 Distinctive Markings and Camouflage of Medical Facilities and Evacuation Platforms US Army Field Manual 4242. Division and Brigade Surgeons Handbook. Appendix A, Guide for ": null
    },
    {
        "Geneva Conventions": "geneva conventions"
    },
    {
        " Compliance.   STANAG 42 Survival, Emergency, and Individual Combat Rations – nutritional values and packaging    STANAG 42  Classes of Supply of NATO Land Forces   STANAG 42 GRADUATED LEVELS OF CHEMICAL, BIOLOGICAL, RADIOLOGICAL AND NUCLEAR THREATS AND ASSOCIATED PROTECTIVE MEASURES   STANAG 42 : Use of Helicopters in Land Operations    STANAG 42 : Joint Range Extension Applications Protocol , a ": null
    },
    {
        "Tactical Data Link": "tactical data link"
    },
    {
        " protocol   STANAG 42 Aircraft Marshalling Signals    STANAG 42  Uniform System of Supply Classification    STANAG 42  Uniform System of Item of Supply Identification   STANAG 42 : Air Reconnaissance Request/Task Form    STANAG 42 : Analogue Video Standard for Aircraft System Applications   STANAG 42: Air Reconnaissance Intelligence Report Forms   STANAG 42 : Aeromedical Training of Aircrew in Aircrew NBC Equipment and Procedures   STANAG 42 : ": null
    },
    {
        "42mm": "20 mm caliber"
    },
    {
        " ammunition and link for ": null
    },
    {
        "aircraft gun": "aircraft gun"
    },
    {
        "s   STANAG 42 Air Reconnaissance Requesting and Target Reporting Guide   STANAG 42 AAP42 NATO Glossary of Terms and Definitions   STANAG 42 : NATO Tactical Air Doctrine   STANAG 42 : Offensive Air Support Operations   STANAG 42 MINIMUM QUALIFICATIONS FOR FORWARD AIR CONTROLLERS & LASER OPERATORS IN SUPPORT Of FORWARD AIR CONTROLLERS    STANAG 42 : Doctrine and Procedures for Airspace Control in Time of Crisis and War   STANAG 42 : ": null
    },
    {
        "42×42mm": "27×145mm"
    },
    {
        "  aircraft gun ammunition and link    STANAG 42 : ": null
    },
    {
        "MIL-STD42": "mil-std-1553"
    },
    {
        ", mechanical, electrical and functional characteristics of a serial data bus   STANAG 42 : Counter Air Operations    STANAG 42  High Speed Data Transmission Under STANAG 42 or Fibre Optic Equivalent Control - 42Mbit/sec ": null
    },
    {
        "MIL-STD42B": "mil-std-1553b"
    },
    {
        " data bus augmented by a 42 Mbit/s, Optical or Electrical, High Speed channel. Revised by ": null
    },
    {
        "prEN": "european committee for standardization"
    },
    {
        " 42 which remains provisional. AECMA Working Group C42-GT42 High Speed Data Transmission Under STANAG 42 or Fibre Optic Equivalent Control, prEN4242 Ed P42 ASD-STAN, 42/42/42 Optical version implemented on the ": null
    },
    {
        "Eurofighter Typhoon": "eurofighter typhoon"
    },
    {
        " as EN 42Edition 42 42 May 42Edition 42 42 May 42METCM42mmEdition 42 42 Feb 42Edition 42 August 42Edition 42 42 May 42METTAEdition 42 42 February 42  ": null
    }
]