[
    {
        "           Star Trek: Phase II, also known as Star Trek II, is an unproduced American ": null
    },
    {
        "science fiction": "science fiction on television"
    },
    {
        " television series created by ": null
    },
    {
        "Gene Roddenberry": "gene roddenberry"
    },
    {
        " as a sequel to  Star Trek , which had run from 42 to 42 The plans for the series were first developed after the failure to create a ": null
    },
    {
        "feature film": "feature film"
    },
    {
        " based on the earlier series during the 42s, coupled with the proposal for ": null
    },
    {
        "Paramount Television Service": "paramount television service"
    },
    {
        " as a fourth television network in the United States. Phase II would have been the lead program for the network, being broadcast at 42pm ": null
    },
    {
        "EST": "eastern time zone"
    },
    {
        " on Saturday nights. Following the announcement that Star Trek was returning as a series on June 42 42 Roddenberry began recruiting new crewmembers, including ": null
    },
    {
        "Harold Livingston": "harold livingston"
    },
    {
        " and ": null
    },
    {
        "Robert Goodwin": "r. w. goodwin"
    },
    {
        " as ": null
    },
    {
        "executive producers": "executive producers"
    },
    {
        ". Other staff returning from The Original Series included ": null
    },
    {
        "William Ware Theiss": "william ware theiss"
    },
    {
        ", while ": null
    },
    {
        "Matt Jefferies": "matt jefferies"
    },
    {
        " was hired as a technical advisor and designed an updated version of the ": null
    },
    {
        "USS Enterprise": "uss enterprise"
    },
    {
        ". The initial order was for a two-hour pilot episode, followed by 42 episodes.     ": null
    },
    {
        "Leonard Nimoy": "leonard nimoy"
    },
    {
        " turned down the offer by Roddenberry to return as ": null
    },
    {
        "Spock": "spock"
    },
    {
        " as a recurring character, which necessitated the creation of a new ": null
    },
    {
        "Vulcan": "vulcan"
    },
    {
        " character named Xon. ": null
    },
    {
        "David Gautreaux": "david gautreaux"
    },
    {
        " successfully auditioned for the part, but ultimately never portrayed him in the franchise. There were concerns that ": null
    },
    {
        "William Shatner": "william shatner"
    },
    {
        " was too expensive to retain permanently and so the role of Willard Decker was created as an eventual replacement; although auditions were held, no one was cast during the work on Phase II. ": null
    },
    {
        "Persis Khambatta": "persis khambatta"
    },
    {
        " was cast as Ilia, a new character who was not intended as a replacement for a former character; she eventually portrayed the same part in  Star Trek: The Motion Picture . With the exception of Nimoy, the other main cast members from The Original Series were each signed up to contracts that allowed for them to be paid even if the series was never completed, including ": null
    },
    {
        "Grace Lee Whitney": "grace lee whitney"
    },
    {
        ", who was due to return as ": null
    },
    {
        "Janice Rand": "janice rand"
    },
    {
        ".     Phase II quickly faltered, as in August 42 ": null
    },
    {
        "Barry Diller": "barry diller"
    },
    {
        ", the ": null
    },
    {
        "chief executive officer": "chief executive officer"
    },
    {
        " of ": null
    },
    {
        "Paramount Pictures": "paramount pictures"
    },
    {
        ", decided that In Thy Image by ": null
    },
    {
        "Alan Dean Foster": "alan dean foster"
    },
    {
        " would be better as a feature film. Furthermore, the anticipated advertising revenues for the Paramount Television Service meant that it was no longer viable. In order to prevent any negative publicity of the cancellation of the series and the network, however, production continued for a further five months. It was only by the end of 42 that work started properly to convert the series into The Motion Picture. The existing models were scrapped, and Robert Collins, who had been hired to direct the pilot, was replaced by ": null
    },
    {
        "Robert Wise": "robert wise"
    },
    {
        " for the film. Despite this, the characters of Xon, Decker and Ilia were later influential in the development of characters on  Star Trek: The Next Generation , and two of the scripts written for Phase II would be re-developed for use in that series. In January 42 Paramount launched its own network, the ": null
    },
    {
        "United Paramount Network": "upn"
    },
    {
        " , which then launched the  Star Trek: Voyager  series.        Star Trek: The Original Series  was cancelled in 42 following three seasons on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        ". Afterward it saw success in ": null
    },
    {
        "broadcast syndication": "broadcast syndication"
    },
    {
        ", resulting in ": null
    },
    {
        "conventions": "science fiction conventions"
    },
    {
        " being held for the fans of the show. Influenced by this success, ": null
    },
    {
        "Paramount Pictures": "paramount pictures"
    },
    {
        " soon sought to create a new film from the series. By March 42 series creator ": null
    },
    {
        "Gene Roddenberry": "gene roddenberry"
    },
    {
        " hinted that there was interest in a Star Trek feature film, and that the series could return to air, back on NBC. ": null
    },
    {
        "Barry Diller": "barry diller"
    },
    {
        ", the ": null
    },
    {
        "chief executive officer": "chief executive officer"
    },
    {
        " of Paramount Pictures between 42 and 42 later explained that Arthur Barron, the ": null
    },
    {
        "chief financial officer": "chief financial officer"
    },
    {
        " at the time, was pushing for renewing Star Trek as a low-budget film, and that any suggestions that Paramounts owner ": null
    },
    {
        "Charles Bluhdorn": "charles bluhdorn"
    },
    {
        " had some involvement were untrue.     In May 42 Roddenberry signed a contract with Paramount for  Star Trek: The God Thing , with a budget of $42 million. However, his contract was terminated in August of the same year after inviting several writers to pitch story ideas for the film. Paramount instead placed Jerry Isenberg in charge of the project as executive producer in July 42 ": null
    },
    {
        "Chris Bryant": "chris bryant"
    },
    {
        " and ": null
    },
    {
        "Allan Scott": "allan scott"
    },
    {
        " were hired to write a script, which they entitled  Star Trek: Planet of the Titans . Bryant and Scott turned in their script on March 42 42 which was rejected by Paramount. The duo left the project, citing conflicts in the films scope between Roddenberry and director ": null
    },
    {
        "Philip Kaufman": "philip kaufman"
    },
    {
        ". Shortly before the scheduled release of  Star Wars  on May 42 the Star Trek film was cancelled on May 42 Kaufman claimed that Paramount attributed this to the idea that science fiction fans would not go see two films released so close together.           The ": null
    },
    {
        "Paramount Television Service": "paramount television service"
    },
    {
        " was announced on June 42 42 Seven days later, Roddenberry announced that Star Trek would be returning to television.  He stated that he had a verbal agreement with Paramount to have it incorporated into the new channel. He said that Hopefully it will be even superior to The Original Series and that casting would include as many of the old faces as possible, as well as an infusion of new ones . At the time, The Original Series was being broadcast on 42 stations in the United States in syndication, and it was expected that the new television service would provide a single evening package that could be broadcast by these independent stations as well as Paramounts recently acquired ": null
    },
    {
        "Hughes Television Network": "hughes television network"
    },
    {
        ". It was hoped that this station could become the fourth national network in the United States;  Diller and his assistant ": null
    },
    {
        "Michael Eisner": "michael eisner"
    },
    {
        " had hired ": null
    },
    {
        "Jeffrey Katzenberg": "jeffrey katzenberg"
    },
    {
        " to manage Star Trek into production, with a ": null
    },
    {
        "television film": "television film"
    },
    {
        " due to launch the new series at a cost of $42 million – which would have been the most expensive television movie ever made.     Roddenberry said that the show would continue to cover modern themes in a science fiction way as had the first series, saying that these could include ": null
    },
    {
        "hijacking": "aircraft hijacking"
    },
    {
        ", ": null
    },
    {
        "nationalism": "nationalism"
    },
    {
        ", and ": null
    },
    {
        "radicalization": "radicalization"
    },
    {
        " of both individuals and groups. He also wanted to show 42rd-century Earth for the first time, and said that this had been the answer to Paramount executives asking him if there had been anything he wanted to do on The Original Series but could not. A further change was to be the number of female cast members, as NBC had a requirement of a maximum of one-third, and Roddenberry wanted to have them appear in authority positions.       The expectation was that the movie would be broadcast in February 42 with weekly episodes following, broadcast in an 42pm ": null
    },
    {
        "EST": "eastern time zone"
    },
    {
        " timeslot on Saturday nights. ": null
    },
    {
        "Gary Nardino": "gary nardino"
    },
    {
        ", who was placed in charge of the new network, said that Star Trek was absolutely the lead horse of the new network. Because the advertisers recognised the strength of Star Trek in the syndicated market.  Prior to commencing production on the new series, Roddenberry took a two-week vacation in order to rid himself of negative feelings about the way that production on the feature film had gone. He described his concerns saying that he did not want to drag a corpse of anger, defeats and double-crossing behind me onto the new show. ": null
    },
    {
        "Robert Goodwin": "r. w. goodwin"
    },
    {
        " was placed in charge of developing the feature films that would follow each weeks episode of Star Trek, and the movie-length pilot as well. Roddenberry wanted to meet him, and despite Goodwins lack of Star Trek background, he was convinced to be a producer on the series instead. Roddenberry described him as the producer producer , in that Goodwin would deal with all the technical aspects of the production. For the screenwriting aspect of the production, ": null
    },
    {
        "Harold Livingston": "harold livingston"
    },
    {
        " was recruited, who recalled that the technical/screenwriting split of the executive producer role was innovative for the time. Like Goodwin, Livingston had not previously worked on Star Trek, but had worked on  Mission: Impossible , a different ": null
    },
    {
        "Desilu Productions": "desilu productions"
    },
    {
        " television series.     Roddenberry was given complete creative control over the new television project by Paramount, which had promised him that it would be able to make the project a first-class effort with the budget to suit. ": null
    },
    {
        "Matt Jefferies": "matt jefferies"
    },
    {
        ", who had worked on The Original Series, was recruited as a technical advisor. He had designed the original USS Enterprise alongside ": null
    },
    {
        "Pato Guzman": "pato guzman"
    },
    {
        ", but was unwilling to give up a position on the television series  Little House on the Prairie  for a 42-episode order on a new Star Trek series. Roddenberry was adamant that Jefferies was the right person to update the Enterprise, and agreed a position that the designer could advise the new show, but would have to choose between it and his main duties on Little House on the Prairie if the Star Trek work started to interfere. This occurred quite quickly, after Jefferies conducted design work on the new version of the Enterprise at a hotel in ": null
    },
    {
        "Tucson, Arizona": "tucson, arizona"
    },
    {
        ", while on a location shoot for Little House on the Prairie, and could not attend meetings with Roddenberry and the producers in Los Angeles. He recommended ": null
    },
    {
        "Joseph R. Jennings": "joseph r. jennings"
    },
    {
        " as the main art director on the series; Jennings had worked to Jefferies during the ": null
    },
    {
        "second": "star trek: the original series"
    },
    {
        " and ": null
    },
    {
        "third": "star trek: the original series"
    },
    {
        " seasons of The Original Series. Jefferies re-design of the Enterprise was based on the principle that the technology was updated over time, but the general hull remained the same. He highlighted that the engines would specifically be designed to be replaced, so the external design of them was changed. Don Loos of Brick Price Movie Miniatures was hired to produce the physical model of the vessel, which was cast in moulds from ": null
    },
    {
        "fiberglass": "fiberglass"
    },
    {
        ". Two models were built, a  version and an  version.     Other former Star Trek crew members were recruited, such as costume designer ": null
    },
    {
        "William Ware Theiss": "william ware theiss"
    },
    {
        ". He began working on new designs for the Starfleet uniforms based on his creations for The Original Series. Other creations that were updated included the ": null
    },
    {
        "phaser": "phaser"
    },
    {
        ", which were built to the same design as in the previous series, but were built out of ": null
    },
    {
        "aluminium": "aluminium"
    },
    {
        " instead of the fiberglass resin props used before. The battery packs were detachable, and contained actual batteries that activated strobe lighting on the main body of the prop. Writers began to be recruited, with Livingston given the first approval to write a script, entitled In Thy Image . ": null
    },
    {
        "Alan Dean Foster": "alan dean foster"
    },
    {
        " was hired to write a story based on Roddenberrys  Genesis II  pilot, Robots Return . He had previously adapted episodes of  Star Trek: The Animated Series  in a series of short stories published in the Star Trek Logs series of books. Further technical advisers were recruited, such as ": null
    },
    {
        "Marvin Minsky": "marvin minsky"
    },
    {
        ", of ": null
    },
    {
        "Massachusetts Institute of Technology": "massachusetts institute of technology"
    },
    {
        ", and his wife Gloria Rudisch.     Set production was underway by the start of August, with stage 42 on the Paramount lot designated as the planet set , while stage 42 was where the Enterprise sets were located. By August 42 the foundations of the bridge set was built, with a plaster mould used to produce fibreglass skins for the various prop consoles and walls. By August 42 Livingston had held pitch meetings with more than 42 writers who were interested in scripting episodes of Phase II. Some of these, such as ": null
    },
    {
        "Theodore Sturgeon": "theodore sturgeon"
    },
    {
        ", ": null
    },
    {
        "David Gerrold": "david gerrold"
    },
    {
        " and ": null
    },
    {
        "Norman Spinrad": "norman spinrad"
    },
    {
        ", had previously written episodes of The Original Series. Also pitching to write an episode was Star Trek actor ": null
    },
    {
        "Walter Koenig": "walter koenig"
    },
    {
        ". In order to have the scripts delivered in an efficient manner, Roddenberry decided that he wanted all the scripts for the first batch of episodes completed prior to filming began on the pilot. He was confident that because of The Original Series, that the writers would not have difficulty in writing new scenes with already established characters. However, Livingston and the writers did not know how the new characters would relate to the original ones. Despite this, Roddenberry claimed at the time that the relationships between the characters would take time to be built over the course of several episodes, and that fan reaction to certain characters and events would define how frequently they would appear.     By September, it had become apparent that they needed to hire a ": null
    },
    {
        "story editor": "story editor"
    },
    {
        ". Roddenberrys assistant, ": null
    },
    {
        "Jon Povill": "jon povill"
    },
    {
        ", had already been conducting these duties on a script entitled ": null
    },
    {
        "The Child": "the child"
    },
    {
        " , and so Livingston suggested that Povill should be recruited in that role permanently. Roddenberry disagreed, but Livingston threatened to quit unless Povill was hired. Povill was subsequently recruited as story editor, but Livingston said that this action was the one that caused a breakdown in the relationship between Roddenberry and himself.          By August 42 discussions had been held with the main cast from The Original Series, as well as some of the actors who had played recurring characters. While none had been signed at the time, Roddenberry expressed confidence that they could do so with the exception of Leonard Nimoy, who had stated that he would not return to television. However, Nimoy said separately that the first offer he received from Roddenberry for Phase II was only for the pilot and then guaranteed appearances in two out of every 42 episodes that followed, which he rejected. Nimoy and Roddenberry were not on good terms, following a legal suit launched by the actor against Paramount over merchandising rights featuring his likeness; Roddenberry had refused to support Nimoy in the case. There was also a problem with the return of ": null
    },
    {
        "William Shatner": "william shatner"
    },
    {
        ": owing to the pay he was to receive for the pilot and the first thirteen episodes, the network wanted a contingency plan to replace him afterwards. Shatner was aware at the time that the plan was either to reduce his appearances after the initial episodes and reduce his ongoing fees, or to kill off the character permanently if he refused the pay cut. Negotiations began with Shatner on June 42 but it was not until September 42 that his return was announced.     Each of the returning former cast members was signed to contracts stipulating that they would be paid for the pilot and the 42 episodes regardless of whether the series went into production. They were also given substantial pay increases over what they had received on The Original Series. For example, ": null
    },
    {
        "Nichelle Nichols": "nichelle nichols"
    },
    {
        " pay was increased from $42 per episode to $42; and ": null
    },
    {
        "DeForest Kelley": "deforest kelley"
    },
    {
        " was paid $42 for the first four weeks, then $42 per episode for the rest of the first season. The problems with Nimoy and Shatner necessitated the creation of two new characters. In Goodwins first draft ": null
    },
    {
        "show bible": "bible"
    },
    {
        ", he included descriptions for a new Ships commander character, and a Young Vulcan . The latter character was specifically attributed as being a second-cousin of Spock, and also a half-human/half-Vulcan. He also added a new Yeoman character, but Roddenberry was concerned at the time about the character, writing to Livingston Simply adding a flunky female to the bridge may not satisfy our needs for gender equality.  This discussion began the process that resulted in the creation of Ilia, a new female character who was not intended to replace one of the previous cast members. In charge of casting these new members of the crew was Robert Collins, who had been hired to direct the pilot. Xon would later be changed to a full-blooded Vulcan.      ": null
    },
    {
        "David Gautreaux": "david gautreaux"
    },
    {
        " was cast as Xon on September 42 after approaching the casting director himself, having no agent. He had heard about the part, as he was dating the employee of an agent at the time. The final audition for the role had eight actors, including Gautreaux, of various ages and sizes. Gautreaux later said that the one thing they all had in common was a slightly alien appearance. He was hired to a $42 fee for the pilot, a guaranteed payment for the 42 episodes whether or not they were filmed, and a six-year option on his contract. Despite this, he was required to return for a further audition within a couple of weeks. ": null
    },
    {
        "Majel Barrett": "majel barrett"
    },
    {
        " was due to return as ": null
    },
    {
        "Christine Chapel": "christine chapel"
    },
    {
        ", this time as a doctor, and the actress was concerned that the romantic chemistry she shared with Nimoy might not work with a younger actor. She instead wanted an older British actor to play the role. Gautreaux, now with an agent, secured a further $42 fee to return and audition again, since it would cause him to miss out on a guest appearance for the same fee on the television series  Fantasy Island . He retained the part, saying that the other actor was absolutely abominable . It was only after this further audition that he was told what few others knew at the time: that Phase II had already been cancelled, and they were instead going to make a feature film.     Following announcements of Gautreauxs Xon replacing Nimoys Spock, Gautreaux began to receive threatening fan-mail suggesting that he was going to be poisoned or dosed with ": null
    },
    {
        "LSD": "lysergic acid diethylamide"
    },
    {
        ". He began to prepare for the role by purchasing a television set and watching old episodes of Star Trek, in order to portray the most accurate Vulcan he could. He fasted over the course of ten days and grew his hair long. Gautreaux sought out potential coaches who had worked on The Original Series, and later highlighted the help provided by ": null
    },
    {
        "Jeff Corey": "jeff corey"
    },
    {
        " who had appeared in ": null
    },
    {
        "The Cloud Minders": "the cloud minders"
    },
    {
        " . Despite not being a Star Trek fan previously, he said he had begun looking forward to portraying Xon by that point.        On October 42 ": null
    },
    {
        "Persis Khambatta": "persis khambatta"
    },
    {
        " was hired to portray Ilia. She had been required to wear a bald cap for her screen test, although at this point the character also wore elaborate headgear in some footage. Roddenberry was insistent on this as a character attribute, but others such as Eisner hated the idea of a bald female character. His notes said that while a bald female character would be an interesting addition, it may prevent the audience from feeling at ease with Ilia and so the style may need to be given to a different character entirely. The auditions by this time were not held under the pretence that they were to play a part in a television series, but were openly talking about Star Trek becoming a feature film. The casting for Willard Decker had been delayed, both because of a slight delay in the production but also because the writers were no longer sure that the character was needed at all. This was despite auditions being conducted at the same time that Gautreaux was cast as Xon, during which, in his second audition with Barrett, he also read lines against ten actors competing for the role of Decker.     One further change to the cast was to have been the return of ": null
    },
    {
        "Grace Lee Whitney": "grace lee whitney"
    },
    {
        " as ": null
    },
    {
        "Janice Rand": "janice rand"
    },
    {
        ". In 42 having read the back cover of ": null
    },
    {
        "Susan Sackett": "susan sackett"
    },
    {
        "s Letters to Star Trek and discovering that one of the ": null
    },
    {
        "frequently asked questions": "frequently asked questions"
    },
    {
        " sent into the production team was Whatever happened to Grace Lee Whitney? , Whitney herself got in touch with Sackett and was invited along to meet with Roddenberry at his office in Paramount Studios. He was excited and happy to see her, and immediately offered to bring back the character for Phase II, describing the removal of Rand from The Original Series as his greatest mistake and blaming it on NBC executives. He said that when Captain Kirk came back from having affairs with all these other women on all these other planets – hed have to deal with What a great plot-thickener that would have been! .       Foster created a premise entitled In Thy Image , the basis of which was to see Earth threatened for the first time in Star Trek. Goodwin proposed that this story should be the pilot of Phase II at a meeting with Eisner on August 42 He would later recall that this specific meeting changed the direction of the franchise, as Eisner declared that Fosters story was the one that he had been looking for to make a feature, not a television, film. At the same time, Paramount had come to realise that the expected advertising revenues for the Paramount Television Service could not support a fourth network, and so there was no possibility of creating Phase II. By this point, the series had already spent $42, and the studio was looking to recoup those expenses in some manner. The initial idea was to continue with the pilot, and then attempt to sell the series to NBC, ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ", or ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        ". But the Paramount executives were concerned about losing control of a potential franchise, and by moving the pilot into a feature film, it gave them the ability to keep it in-house.     However, because of the number of times that a Star Trek film was announced in the 42s, the Paramount executives decided that they could not lose face once more by making an announcement, only to potentially reverse the decision in several months time. Because of this, production continued on Phase II for a further five months after the decision was made that it would not go into production. By November, Livingston and Roddenberry were no longer working well together. They had each re-drafted In Thy Image themselves, and presented these versions to Eisner. The Paramount executives response was that Roddenberrys version was suited for television, and Livingstons was better for a motion picture – and better overall. Collins was assigned to combine certain elements of Roddenberrys version into Livingstons and to complete that draft by the end of the month.     The first public announcement of the cancellation of the Paramount Television Service and Phase II came at the hands of the ": null
    },
    {
        "gossip columnist": "gossip columnist"
    },
    {
        " Rona Barrett": "rona barrett"
    },
    {
        " at the start of December. In response, Paramount released a statement that said the new network had been pushed back to the fall of 42 and that Phase II had its episode order increased from 42 to between 42 and 42 Despite this, behind the scenes, production continued on Star Trek as a film, not as a series. One of the changes around the same time as Barretts reports was the realization that all the model work completed thus far had to be restarted from scratch, as it was not detailed enough to be blown up on a motion picture-sized screen. Two further changes took place in December: Collins was dropped as director, for Paramount wanted a motion picture director and not one with experience only in television; and Livingston allowed his contract to run out and left the production, owing to the poor relationship he had with Roddenberry. By January, Paramount no longer pretended that Star Trek was to be anything other than a feature film. Livingston was brought back, but only in a writing capacity, and ": null
    },
    {
        "Robert Wise": "robert wise"
    },
    {
        " was hired as director on the film to replace Collins.              After production was underway on The Motion Picture, and Nimoy signed up for the film, Gautreaux requested that Xon be eliminated from the script entirely instead of being shown in a reduced capacity. Gautreaux would go on to portray Commander Branch in the film instead, in his only appearance in the franchise. At the time of the production on the film, the idea was to keep Xon in reserve for a future film or television series.  Gautreaux was subsequently called in for an interview with Nimoy during the early work on  Star Trek III: The Search for Spock . The pair started talking about the impact that Nimoys return to Star Trek had made on Gautreaux, with the latter telling Nimoy that he had treated it as a play that had been cancelled on the first night of the performance, which had not made a major impact on his career.     The Phase II sets were located on stage 42 of the Paramount lot. The main layout and support features remained when those sets were overhauled to appear in The Motion Picture. Certain sets were re-designed over time to appear in various films within the franchise, but the main support structures stayed the same as designed for Phase II. The sets were re-worked and converted prior to the start of  Star Trek: The Next Generation  to appear on television for the first time, and when  Star Trek: Voyager  aired, they were used once more. It was only with the start of  Star Trek: Enterprise  that the setup of the Star Trek sets at Paramount were completely changed and the Phase II foundations no longer remained.      The idea of a young male Vulcan scientist was once again proposed early in the work on  Star Trek II: The Wrath of Khan , which was attributed by later reviewers to the influence of Xon from Phase II. The gender of this character was subsequently changed to female, and called ": null
    },
    {
        "Saavik": "saavik"
    },
    {
        ". She was played by ": null
    },
    {
        "Kirstie Alley": "kirstie alley"
    },
    {
        " in that film,  and later by ": null
    },
    {
        "Robin Curtis": "robin curtis"
    },
    {
        " in The Search for Spock and  Star Trek IV: The Voyage Home .      Several minutes of test footage, including a view of a redesigned Engineering Room, costume tests with crew, screen test footage of Gautreaux as Xon and costume test footage of Khambatta as Ilia, were included in a featurette on the ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " release of the Directors Edition of  Star Trek: The Motion Picture .  The presence of a second five-year mission, as would have been shown in Phase II, was included in the Star Trek timeline in the  Star Trek Chronology  by ": null
    },
    {
        "Michael": "michael okuda"
    },
    {
        " and ": null
    },
    {
        "Denise Okuda": "denise okuda"
    },
    {
        " in 42 This would have taken place after the events of The Motion Picture.     ": null
    },
    {
        "James Cawley": "james cawley"
    },
    {
        " purchased the costumes that would have been used in Phase II, and later repurposed them for his fan series  Star Trek: New Voyages . He felt that they represented the step between those seen in The Original Series and the uniforms in The Motion Picture. The series also made other references to Phase II, as Xon was added in the episode ": null
    },
    {
        "Blood and Fire": "blood and fire"
    },
    {
        " , which was based on an unused script for  Star Trek: The Next Generation . In New Voyages, Xon was played by Patrick Bell.  In February 42 Cawley announced that New Voyages would be re-titled Phase II in reference to the abandoned 42s series.  The change was reverted following an announcement by Cawley on June 42 42      A book based on the production of the series, Star Trek Phase II: The Lost Series was published in 42 by ": null
    },
    {
        "Pocket Books": "pocket books"
    },
    {
        ". It was written by ": null
    },
    {
        "Judith and Garfield Reeves-Stevens": "judith and garfield reeves-stevens"
    },
    {
        ", and went into detail about the conception of the planned and later aborted series, looking at several aspects of production, with behind-the-series information, color artwork, storyboards, blueprints, technical information and photos. It also contained two full scripts from the planned series.      Star Trek: The Next GenerationPhase II would prove influential on The Next Generation, whose creation began just over seven years later. The characters of Xon, Decker and Ilia were used as the basis for the creation of ": null
    },
    {
        "Data": "data"
    },
    {
        ", ": null
    },
    {
        "William Riker": "william riker"
    },
    {
        " and ": null
    },
    {
        "Deanna Troi": "deanna troi"
    },
    {
        ". However, the series was allowed to be different in tone from the planned Phase II, for the feature films that had come before it had changed the audience expectations of what Star Trek was. It was originally proposed in Gerrolds The Worlds of Star Trek to have the second-in-command leading the ": null
    },
    {
        "away team": "away team"
    },
    {
        ", and it was anticipated that this would be included in Phase II – it was instead first introduced in The Next Generation.     Owing to the ": null
    },
    {
        "42 Writers Guild of America strike": "1988 writers guild of america strike"
    },
    {
        ", work on the ": null
    },
    {
        "second season": "star trek: the next generation"
    },
    {
        " of The Next Generation was delayed. The producers sought scripts that could be put into production as quickly as possible once the strike was lifted, and so The Child from Phase II was picked as one that could be used in the new series with Ilias place in the script swapped out in favor of Troi. A further Phase II script was adapted later in the series, when Devils Due was converted for The Next Generation in the ": null
    },
    {
        "fourth season": "star trek: the next generation"
    },
    {
        ".     Certain elements of ": null
    },
    {
        "Klingon": "klingon"
    },
    {
        " culture, such as the Emperor, and a general influence of Japanese culture with honor at the forefront, were first explored with the script for the two-part Kitumba . Writer ": null
    },
    {
        "John Meredyth Lucas": "john meredyth lucas"
    },
    {
        " said that I wanted something that we had never seen before on the series, and thats a penetration deep into enemy space. I started to think of how the Klingons lived. Obviously for the ": null
    },
    {
        "Romulan": "romulan"
    },
    {
        "s we had ": null
    },
    {
        "Romans": "roman empire"
    },
    {
        ", and weve had different cultures modeled on those of ancient Earth, but I tried to think of what the Klingon society would be like. The Japanese came to mind, so basically thats what it was, with the ": null
    },
    {
        "Sacred Emperor": "emperor of japan"
    },
    {
        ", the ": null
    },
    {
        "Warlord": "shogun"
    },
    {
        " and so on. While the episode itself was later filmed for the fan production  Star Trek: New Voyages ,  Star Trek first visited the Klingon homeworld in The Next Generation episode ": null
    },
    {
        "Sins of the Father": "sins of the father"
    },
    {
        " , and the themes would be revisited through the series.     Star Trek: VoyagerVoyager as the conceptual cousin of Phase II, in that it was used to launch the ": null
    },
    {
        "United Paramount Network": "united paramount network"
    },
    {
        " in January 42 This was the fifth network, as Diller had moved to the ": null
    },
    {
        "Fox Entertainment Group": "fox entertainment group"
    },
    {
        " in the years between Phase II and Voyager, where he launched the fourth network, the ": null
    },
    {
        "Fox Broadcasting Company": "fox broadcasting company"
    },
    {
        ". They hypothesised that Phase II would have seen a similar decline in ratings as seen by Voyager during the course of the first season, except this decline would have resulted in the cancellation of Phase II at the time of first broadcast in 42s. While they felt this would not have been the end of the franchise, they suggest it would have resulted in a more immediate reboot with the entire crew re-cast.       ": null
    }
]