[
    {
        "                  Star Wars is an American ": null
    },
    {
        "epic": "Epic Film"
    },
    {
        " space-opera": "Space-Opera"
    },
    {
        " media franchise": "Media Franchise"
    },
    {
        " created by ": null
    },
    {
        "George Lucas": "George Lucas"
    },
    {
        ". The franchise began with the ": null
    },
    {
        "eponymous 1977 film": "Star Wars"
    },
    {
        " and quickly became a worldwide ": null
    },
    {
        "pop-culture": "Popular Culture"
    },
    {
        " phenomenon": "Cultural Impact Of Star Wars"
    },
    {
        ".   The original film, later subtitled Episode IV – A New Hope, was followed by the sequels  Episode V – The Empire Strikes Back  and  Episode VI – Return of the Jedi  , forming what is collectively referred to as the ": null
    },
    {
        "original trilogy": "Star Wars Trilogy"
    },
    {
        ". A ": null
    },
    {
        "prequel trilogy": "Star Wars Prequel Trilogy"
    },
    {
        " was later released, consisting of  Episode I – The Phantom Menace  ,  Episode II – Attack of the Clones  and  Episode III – Revenge of the Sith  . Ten years later, a ": null
    },
    {
        "sequel trilogy": "Star Wars Sequel Trilogy"
    },
    {
        " began with  Episode VII – The Force Awakens  , continued with  Episode VIII – The Last Jedi  , and will conclude with  Episode IX – The Rise of Skywalker  . Together, the three trilogies form what has been collectively referred to as the ": null
    },
    {
        "Skywalker saga": "List Of Star Wars Filmsskywalker Saga"
    },
    {
        ".  The first eight films ": null
    },
    {
        "were nominated": "List Of Star Wars Filmsacademy Awards"
    },
    {
        " for ": null
    },
    {
        "Academy Awards": "Academy Awards"
    },
    {
        " and were commercially successful. Together with the theatrical ": null
    },
    {
        "anthology films": "Anthology Films"
    },
    {
        "  Rogue One  and  Solo: A Star Wars Story  , the combined box office revenue of the films equates to over   billion,  and is currently the ": null
    },
    {
        "second-highest-grossing film franchise": "List Of Highest-Grossing Filmshighest-Grossing Franchises And Film Series"
    },
    {
        ".      The film series was ": null
    },
    {
        "expanded into other media": "Star Wars Expanded To Other Media"
    },
    {
        ", including ": null
    },
    {
        "television series": "List Of Star Wars Television Series"
    },
    {
        ", ": null
    },
    {
        "video games": "Star Wars Video Games"
    },
    {
        ", ": null
    },
    {
        "novels": "List Of Star Wars Books"
    },
    {
        ", ": null
    },
    {
        "comic books": "List Of Star Wars Comic Books"
    },
    {
        ", ": null
    },
    {
        "theme park attractions": "List Of Star Wars Theme Parks Attractions"
    },
    {
        " and ": null
    },
    {
        "themed areas": "Star Wars: Galaxys Edge"
    },
    {
        ", resulting in an all-encompassing ": null
    },
    {
        "fictional universe": "Fictional Universe"
    },
    {
        ". In 2012, Lucas sold ": null
    },
    {
        "his company": "Lucasfilm"
    },
    {
        " to ": null
    },
    {
        "Disney": "Disney"
    },
    {
        ", and in 2014, most existing spin-off media was made non-canon and rebranded as  Star Wars Legends  . The episodic ": null
    },
    {
        "Skywalker saga": "Skywalker Saga"
    },
    {
        " and the TV series  The Clone Wars  define the canon, along with most other works released after April 2014, though a few Legends-universe media are still released, and some Legends characters are sometimes re-introduced into the canon, for example ": null
    },
    {
        "the titular character": "Grand Admiral Thrawn"
    },
    {
        " from ": null
    },
    {
        "Timothy Zahns": "Timothy Zahn"
    },
    {
        " Thrawn trilogy": "Thrawn Trilogy"
    },
    {
        " of novels. The franchise holds a  Guinness World Records  title for the Most successful film merchandising franchise.  In 2018, the total value of the Star Wars franchise was estimated at billion, and it is currently the ": null
    },
    {
        "fifth-highest-grossing media franchise": "List Of Highest-Grossing Media Franchises"
    },
    {
        " of all-time.               The Star Wars franchise depicts the adventures of characters A long time ago in a galaxy far, far away ,  in which ": null
    },
    {
        "humans": "Human"
    },
    {
        "and many species of ": null
    },
    {
        "aliens": "List Of Star Wars Creatures"
    },
    {
        "  co-exist with ": null
    },
    {
        "robot": "Robot"
    },
    {
        "s, or ": null
    },
    {
        "droids": "Droid"
    },
    {
        ", who may assist them in their daily routines; ": null
    },
    {
        "space travel": "Spaceflight"
    },
    {
        " between planets is common due to ": null
    },
    {
        "hyperspace": "Hyperspacestar Wars"
    },
    {
        " technology.        A mystical power known as ": null
    },
    {
        "the Force": "The Force"
    },
    {
        " is described in the original film as an energy field created by all living things ... binds the galaxy together.  Through training and meditation, those whom the Force is strong with are able to perform various ": null
    },
    {
        "superpowers": "Superpower"
    },
    {
        " .  The Force is wielded by two major ": null
    },
    {
        "knighthood orders": "Military Order"
    },
    {
        " at conflict with each other: the ": null
    },
    {
        "Jedi": "Jedi"
    },
    {
        ", peacekeepers of the Old Republic ruthlessly hunted by Imperial authorities, who act on the light side of the Force through ": null
    },
    {
        "non-attachment": "Detachment"
    },
    {
        " and ": null
    },
    {
        "arbitration": "Arbitration"
    },
    {
        ", and the ": null
    },
    {
        "Sith": "Sith"
    },
    {
        ", ancient enemies of the galactic democracy, who use the dark side by manipulating fear and aggression. While Jedi Knights can be numerous, the Dark Lords of the Sith are intended to be limited to two: a master and their apprentice.      Force-wielders are very limited in numbers in comparison to the rest of the average population. The Jedi and Sith prefer the use of a weapon called ": null
    },
    {
        "lightsaber": "Lightsaber"
    },
    {
        ", which is the cylinder-like ": null
    },
    {
        "hilt": "Hilt"
    },
    {
        " of a sword , but when turned on ignites a ": null
    },
    {
        "laser": "Laser"
    },
    {
        " blade that can cut through virtually any surface. Fights between the two factions result in duels, which are a mix between sword skills and the use of the Force. The rest of the average population, as well as renegades and soldiers, use laser-powered ": null
    },
    {
        "blaster": "Blaster"
    },
    {
        " firearm": "Firearm"
    },
    {
        "s, which Force-users can deflect using lightsabers.       The rises and falls of different regimes are chronicled throughout the saga, which is split into three eras:    The Age of Republic: The era of the ": null
    },
    {
        "prequel trilogy": "Prequel Trilogy"
    },
    {
        ", in which the democratic ": null
    },
    {
        "Galactic Republic": "Galactic Republic"
    },
    {
        " is corrupted by its ": null
    },
    {
        "Supreme Chancellor": "Supreme Chancellor"
    },
    {
        ", ": null
    },
    {
        "Palpatine": "Palpatine"
    },
    {
        " —secretly the Sith lord Darth Sidious. After orchestrating the ": null
    },
    {
        "Clone Wars": "Clone Wars"
    },
    {
        " between the government and a Separatist ": null
    },
    {
        "confederation": "Confederation"
    },
    {
        ", Palpatine ": null
    },
    {
        "overthrows": "Coup Détat"
    },
    {
        " the Republic, and establishes the ": null
    },
    {
        "Galactic Empire": "Galactic Empire"
    },
    {
        ", declaring himself Emperor.    The prequels feature a relatively sleek and new design aesthetic in comparison to the original trilogy.    The Age of Rebellion: The era of the ": null
    },
    {
        "original trilogy": "Original Trilogy"
    },
    {
        ", in which the Empire is fought by the ": null
    },
    {
        "Rebel Alliance": "Rebel Alliance"
    },
    {
        " in a ": null
    },
    {
        "Galactic Civil War": "Galactic Civil War"
    },
    {
        " that spans several years, climaxing with the apparent death of the Emperor. The surviving Rebellion gives rise to the ": null
    },
    {
        "New Republic": "New Republic"
    },
    {
        ".  The original trilogy depicts the galaxy as dirty and grimy in ": null
    },
    {
        "George Lucass": "George Lucas"
    },
    {
        "depiction of a used universe .    The Age of Resistance: The era of the ": null
    },
    {
        "sequel trilogy": "Sequel Trilogy"
    },
    {
        ", in which the remnants of the Empire reform as the ": null
    },
    {
        "First Order": "First Order"
    },
    {
        ".  Heroes of the former rebellion lead the ": null
    },
    {
        "Resistance": "Resistance"
    },
    {
        " against the oppressive dictatorship. Rather than depend on an overabundant use of ": null
    },
    {
        "computer-generated imagery": "Computer-Generated Imagery"
    },
    {
        ",  The Force Awakens  director ": null
    },
    {
        "J.  J. Abrams": "J. & Nbsp;J. Abrams"
    },
    {
        " determined not to lose the wonderful preposterousness of puppetry and practical effects that were used to create the classic trilogy.                  The Star Wars film series centers around three sets of trilogies, which is collectively referred to as the Skywalker saga . They were produced non-chronologically, with Episodes IV–VI being released between 1977 and 1983, Episodes I–III being released between 1999 and 2005, and Episodes VII–IX , being released between 2015 and 2019. Each trilogy focuses on a generation of the Force-sensitive ": null
    },
    {
        "Skywalker family": "Skywalker Family"
    },
    {
        ". The original trilogy depict the heroic development of ": null
    },
    {
        "Luke Skywalker": "Luke Skywalker"
    },
    {
        ", the prequels tell of the downfall of his father ": null
    },
    {
        "Anakin": "Anakin Skywalker"
    },
    {
        ", while the sequels feature Lukes nephew, ": null
    },
    {
        "Kylo Ren": "Kylo Ren"
    },
    {
        ".     An anthology series set between the main episodes entered development in parallel to the production of the sequel trilogy,  described by Disney ": null
    },
    {
        "CFO": "Chief Financial Officer"
    },
    {
        " Jay Rasulo": "Jay Rasulo"
    },
    {
        " as ": null
    },
    {
        "origin stories": "Origin Story"
    },
    {
        ".  The first entry,  Rogue One  , tells the story of the rebels who steal the Death Star plans directly before Episode IV.    Solo: A Star Wars Story  focuses on ": null
    },
    {
        "Han Solos": "Han Solo"
    },
    {
        "backstory, also featuring ": null
    },
    {
        "Chewbacca": "Chewbacca"
    },
    {
        " and ": null
    },
    {
        "Lando Calrissian": "Lando Calrissian"
    },
    {
        ".     Lucasfilm has a number of Star Wars movies in development, including a trilogy of films produced and written by  Game of Thrones  creators/": null
    },
    {
        "showrunners": "Showrunner"
    },
    {
        " David Benioff": "David Benioff"
    },
    {
        " and ": null
    },
    {
        "D. B. Weiss": "D. B. Weiss"
    },
    {
        ".  The installments were scheduled to be released in December 2022, 2024, and 2026.   This changed in October 2019, when it was announced that the duo stepped away from their Star Wars films, stating that their contract with ": null
    },
    {
        "Netflix": "Netflix"
    },
    {
        " making it so that they could not effectively work on the films. ": null
    },
    {
        "Kathleen Kennedy": "Kathleen Kennedy"
    },
    {
        " acknowledged that the studio would be open to the pair returning to work on their trilogy when their schedule allows.      Another trilogy will be written by  The Last Jedi  writer/director ": null
    },
    {
        "Rian Johnson": "Rian Johnson"
    },
    {
        ".  It will be independent from the Skywalker saga.  In September 2019, it was announced that Kennedy and ": null
    },
    {
        "Kevin Feige": "Kevin Feige"
    },
    {
        " will collaborate to develop an additional Star Wars film.                In 1971, George Lucas wanted to film an adaptation of the ": null
    },
    {
        "Flash Gordon serial": "Flash Gordon"
    },
    {
        ", but could not obtain the rights, so he began developing his own ": null
    },
    {
        "space opera": "Space Opera"
    },
    {
        ".   After directing  American Graffiti  , he wrote a two-page synopsis, which ": null
    },
    {
        "20th Century Fox": "20Th Century Fox"
    },
    {
        " decided to invest in.    By 1974, he had expanded the story into the first draft of a screenplay.  ": null
    },
    {
        "The subsequent movies": "Star Wars"
    },
    {
        " success led Lucas to make it the basis of an elaborate ": null
    },
    {
        "film serial": "Film Serial"
    },
    {
        ".   With the backstory he created for the sequel, Lucas decided that the series would be a trilogy of trilogies. Steranko, George Lucas , Prevue 42, September–October 1980. Most of the main cast would return for the two additional installments of the original trilogy, which were self-financed by ": null
    },
    {
        "Lucasfilm": "Lucasfilm"
    },
    {
        ".     Star Wars was released on May 25, 1977 and first subtitled Episode IV – A New Hope in the 1979 book  The Art of Star Wars .  Episode V – The Empire Strikes Back was released on May 21, 1980, also achieving wide financial and critical success. The final film in the trilogy, Episode VI – Return of the Jedi was released on May 25, 1983. The story of the original trilogy focuses on ": null
    },
    {
        "Luke Skywalkers": "Luke Skywalker"
    },
    {
        "quest to become a Jedi, his struggle with the evil Imperial agent ": null
    },
    {
        "Darth Vader": "Darth Vader"
    },
    {
        ", and the struggle of the Rebel Alliance to free the galaxy from the clutches of the Empire.             According to producer Gary Kurtz, loose plans for a prequel trilogy were developed during the outlining of the original two films.  In 1980, Lucas confirmed that he had the nine-film series plotted,  but due to the stress of producing the original trilogy, he had decided to cancel further sequels by 1981. In 1983, Lucas explained that There was never a script completed that had the entire story as it exists now ... As the stories unfolded, I would take certain ideas and save them ... I kept taking out all the good parts, and I just kept telling myself I would make other movies someday. Worrell, Denise. Icons: Intimate Portraits. p. 185.     Technical advances in the late 1980s and early 1990s, including the ability to create computer-generated imagery , inspired Lucas to consider that it might be possible to revisit his saga. In 1989, Lucas stated that the prequels would be unbelievably expensive.  In 1992, he acknowledged that he had plans to create the prequel trilogy. A theatrical ": null
    },
    {
        "rerelease": "Changes In Star Wars Re-Releases"
    },
    {
        " of the original trilogy in 1997 updated the 20-year-old films with the style of CGI envisioned for the new trilogy.     Episode I – The Phantom Menace was released on May 19, 1999, and Episode II – Attack of the Clones on May 16, 2002. Episode III – Revenge of the Sith, the first  film in the franchise, was released on May 19, 2005.  The first two movies were met with mixed reviews, with the third being received somewhat more positively. The trilogy begins 32 years before Episode IV and follows the ": null
    },
    {
        "Jedi": "Jedi"
    },
    {
        " training of ": null
    },
    {
        "Anakin Skywalker": "Anakin Skywalker"
    },
    {
        ", Lukes father, and creation of the Sith lord Darth Vader, as well as the corruption of the ": null
    },
    {
        "Galactic Republic": "Galactic Republic"
    },
    {
        " and rise of the ": null
    },
    {
        "Empire": "Galactic Empire"
    },
    {
        " of ": null
    },
    {
        "Darth Sidious": "Palpatine"
    },
    {
        ". Together with the original trilogy, Lucas has collectively referred to the first six episodic films of the franchise as the tragedy of Darth Vader .      In 2004, for their ": null
    },
    {
        "DVD": "Dvd"
    },
    {
        " release, the original trilogy films were furtherly altered in order to bring continuity with the prequels, for example replacing Palpatines depiction in The Empire Strikes Back and Anakins in Return of the Jedi to match their prequel selves, using their prequel portrayers.               Prior to releasing the original film, and made possible by its success, Lucas planned three trilogies of nine films.  He announced this to  Time  in 1978,  and confirmed that he had outlined them in 1981. ": null
    },
    {
        "Kerry OQuinn": "Kerry Oquinn"
    },
    {
        ". The George Lucas Saga Chapter 3: The Revenge of the Box Office. Starlog 50, September 1981. At various stages of development, the sequel trilogy was to focus on the rebuilding of the Republic, Gerald Clarke. . Time, May 19, 1980. Retrieved September 26, 2012. the return of Luke in a role similar to that of Obi-Wan in the original trilogy, Lukes sister , Han, Leia,   and . ": null
    },
    {
        "Kerry OQuinn": "Kerry Oquinn"
    },
    {
        ". The George Lucas Saga Chapter 1: A New View, Starlog 48, July 1981. However, after beginning work on the prequel trilogy, Lucas insisted that Star Wars was meant to be a six-part series and that there would be no sequel trilogy.       Lucas decided to leave the franchise in the hands of other filmmakers, announcing in January 2012 that he would make no more Star Wars films.  In October of that year, ": null
    },
    {
        "The Walt Disney Company": "The Walt Disney Company"
    },
    {
        " agreed to buy Lucasfilm and announced that Episode VII would be released in 2015.  The co-chairman of Lucasfilm, ": null
    },
    {
        "Kathleen Kennedy": "Kathleen Kennedy"
    },
    {
        ", became president of the company and served as executive producer of new Star Wars feature films.  Lucas provided Kennedy his story treatments for the sequels during the 2012 sale,  but in 2015 it was revealed Lucass sequel outline had been discarded.   The sequel trilogy also meant the end of the existing ": null
    },
    {
        "Star Wars expanded universe": "Star Wars Expanded Universe"
    },
    {
        ", which was discarded to give maximum creative freedom to the filmmakers and also preserve an element of surprise and discovery for the audience.     Episode VII – The Force Awakens was released on December 18, 2015, Episode VIII – The Last Jedi on December 15, 2017, and Episode IX – The Rise of Skywalker is due to be released on December 20, 2019. Episode VII was met with both critical and box office success, and Episode VIII, while also meeting critical and financial success, had a mixed reception from audiences. The sequel trilogy starts 30 years after Episode VI and focuses on the journey of the Force-sensitive orphan ": null
    },
    {
        "Rey": "Rey"
    },
    {
        ", guided by Luke Skywalker. Along with ex-stormtrooper ": null
    },
    {
        "Finn": "Finn"
    },
    {
        " and ace X-Wing pilot ": null
    },
    {
        "Poe Dameron": "Poe Dameron"
    },
    {
        ", Rey helps the ": null
    },
    {
        "Resistance": "Resistance"
    },
    {
        " led by Leia fight the ": null
    },
    {
        "First Order": "First Order"
    },
    {
        " commanded by Han and Leias son , ": null
    },
    {
        "Kylo Ren": "Kylo Ren"
    },
    {
        ".          Before selling Lucasfilm to Disney in 2012, and parallel to his development of a sequel trilogy, George Lucas and original trilogy co-screenwriter ": null
    },
    {
        "Lawrence Kasdan": "Lawrence Kasdan"
    },
    {
        " started development on a ": null
    },
    {
        "standalone film": "Standalone Film"
    },
    {
        " about a young Han Solo. On February 5, 2013, Disney CEO ": null
    },
    {
        "Bob Iger": "Bob Iger"
    },
    {
        " made public the development of the Kasdan film.  Disney ": null
    },
    {
        "CFO": "Chief Financial Officer"
    },
    {
        " Jay Rasulo": "Jay Rasulo"
    },
    {
        " has described the standalone films as ": null
    },
    {
        "origin stories": "Origin Story"
    },
    {
        ".     Lucasfilm and Kennedy have stated that the standalone films would be referred to as the Star Wars anthology series . Focused on how the Rebels obtained the ": null
    },
    {
        "Death Star": "Death Star"
    },
    {
        " plans introduced in the 1977 film, the first anthology film,  Rogue One , was released on December 16, 2016 to favorable reviews and box office success. The second,  Solo: A Star Wars Story , centered on a young Han Solo with Chewbacca and Lando as supporting characters, was released on May 25, 2018 to mixed reviews and underperformance at the box office. Despite this, more anthology films are expected to be released,  following a hiatus after 2019s The Rise of Skywalker.        The Star Wars franchise has been spun off to various television productions, including two animated series released in the mid-1980s. Further animated series began to be released in the 2000s, the first two of which focused on the ": null
    },
    {
        "Clone Wars": "Clone Wars"
    },
    {
        ". After Disneys acquisition of Lucasfilm, only ": null
    },
    {
        "the later one": "Star Wars: The Clone Wars"
    },
    {
        " remained ": null
    },
    {
        "canon": "Canon"
    },
    {
        ". Three live-action Star Wars series will be released on ": null
    },
    {
        "Disney+": "Disney+"
    },
    {
        ". The first,  The Mandalorian , premiered on November 12.                           From 1976 to 2014, the term Expanded Universe was an umbrella term for all officially licensed Star Wars storytelling material set outside the events depicted within the theatrical films, including novels, comics, and video games.  Lucasfilm maintained internal continuity between the films and television content and the EU material until April 25, 2014, when the company announced all of the EU works would cease production. Existing works would no longer be considered canon to the franchise and subsequent reprints would be rebranded under the Star Wars Legends label, with downloadable content for the ": null
    },
    {
        "massively multiplayer online game": "Massively Multiplayer Online Game"
    },
    {
        "  The Old Republic  the only Legends material to still be produced. The Star Wars canon was subsequently restructured to only include the existing six feature films, the animated film  The Clone Wars  , and its companion animated series. All future projects and creative developments across all types of media would be overseen and coordinated by the story group, announced as a division of Lucasfilm created to maintain continuity and a cohesive vision on the storytelling of the franchise.  Multiple comics series from ": null
    },
    {
        "Marvel": "Marvel Comics"
    },
    {
        " and novels published by ": null
    },
    {
        "Del Rey": "Del Rey Books"
    },
    {
        " were produced after the announcement.       Star Wars in print predates the release of the first film, with the December 1976 ": null
    },
    {
        "novelization": "Novelization"
    },
    {
        " of Star Wars, initially subtitled  From the Adventures of Luke Skywalker  . Credited to Lucas, it was ": null
    },
    {
        "ghostwritten": "Ghostwriter"
    },
    {
        " by ": null
    },
    {
        "Alan Dean Foster": "Alan Dean Foster"
    },
    {
        ".  The first Expanded Universe story appeared in ": null
    },
    {
        "Marvel Comics": "Marvel Comics"
    },
    {
        " Star Wars 7 in January 1978 , followed by Fosters sequel novel  Splinter of the Minds Eye  the following month.               After penning the novelization of the original film, Foster followed it with the sequel  Splinter of the Minds Eye  . The novelizations of The Empire Strikes Back by ": null
    },
    {
        "Donald F. Glut": "Donald F. Glut"
    },
    {
        " and Return of the Jedi by ": null
    },
    {
        "James Kahn": "James Kahn"
    },
    {
        " followed, as well as  The Han Solo Adventures  trilogy by ": null
    },
    {
        "Brian Daley": "Brian Daley"
    },
    {
        ",  and  The Adventures of Lando Calrissian  trilogy by ": null
    },
    {
        "L. Neil Smith": "L. Neil Smith"
    },
    {
        ".       ": null
    },
    {
        "Timothy Zahns": "Timothy Zahn"
    },
    {
        "bestselling  Thrawn  trilogy reignited interest in the franchise and introduced the popular characters ": null
    },
    {
        "Grand Admiral Thrawn": "Grand Admiral Thrawn"
    },
    {
        ", ": null
    },
    {
        "Mara Jade": "Mara Jade"
    },
    {
        ", ": null
    },
    {
        "Talon Karrde": "Talon Karrde"
    },
    {
        ", and ": null
    },
    {
        "Gilad Pellaeon": "Gilad Pellaeon"
    },
    {
        ".     The first novel,  Heir to the Empire , reached 1 on the ": null
    },
    {
        "New York Times Best Seller list": "The New York Times Best Seller List"
    },
    {
        ",  and the series finds Luke, Leia, and Han facing off against tactical genius Thrawn, who is plotting to retake the galaxy for the Empire.  In  The Courtship of Princess Leia  by ": null
    },
    {
        "Dave Wolverton": "Dave Wolverton"
    },
    {
        ", set immediately before the Thrawn trilogy, Leia considers an advantageous political marriage to ": null
    },
    {
        "Prince Isolder": "Prince Isolder"
    },
    {
        " of the planet Hapes, but she and Han ultimately marry.   ": null
    },
    {
        "Steve Perrys": "Steve Perry"
    },
    {
        "  Shadows of the Empire  , set between The Empire Strikes Back and Return of the Jedi, was part of a multimedia campaign that included a comic book series and video game.   The novel introduced the crime lord ": null
    },
    {
        "Prince Xizor": "Prince Xizor"
    },
    {
        ", another popular character who would appear in multiple other works.  Other notable series from ": null
    },
    {
        "Bantam": "Bantam Books"
    },
    {
        " include the ": null
    },
    {
        "Jedi Academy trilogy": "Jedi Academy Trilogy"
    },
    {
        " by ": null
    },
    {
        "Kevin J. Anderson": "Kevin J. Anderson"
    },
    {
        ",   the 14-book  Young Jedi Knights  series by Anderson and ": null
    },
    {
        "Rebecca Moesta": "Rebecca Moesta"
    },
    {
        ",  and the  X-wing  series by ": null
    },
    {
        "Michael A. Stackpole": "Michael Stackpole"
    },
    {
        " and ": null
    },
    {
        "Aaron Allston": "Aaron Allston"
    },
    {
        ".        Del Rey took over Star Wars book publishing in 1999, releasing what would become a 19-installment novel series called  The New Jedi Order  . Written by multiple authors, the series was set 25 to 30 years after the original films and introduced the Yuuzhan Vong, a powerful alien race attempting to invade and conquer the entire galaxy.   The bestselling multi-author series  Legacy of the Force  chronicles the crossover of Han and Leias son ": null
    },
    {
        "Jacen Solo": "Jacen Solo"
    },
    {
        " to the dark side of the Force; among his evil deeds, he kills Lukes wife Mara Jade as a sacrifice to join the ": null
    },
    {
        "Sith": "Sith"
    },
    {
        ". Although no longer canon, the story is paralleled in The Force Awakens with Han and Leias son ": null
    },
    {
        "Ben Solo": "Kylo Ren"
    },
    {
        ", who has become the dark Kylo Ren.         Three series set in the prequel era were introduced for younger audiences: the 18-book  Jedi Apprentice  chronicles the adventures of ": null
    },
    {
        "Obi-Wan Kenobi": "Obi-Wan Kenobi"
    },
    {
        " and his master ": null
    },
    {
        "Qui-Gon Jinn": "Qui-Gon Jinn"
    },
    {
        " in the years before The Phantom Menace; the 11-book  Jedi Quest  follows Obi-Wan and his own apprentice, ": null
    },
    {
        "Anakin Skywalker": "Darth Vader"
    },
    {
        " in between The Phantom Menace and Attack of the Clones; and the 10-book  The Last of the Jedi  , set almost immediately after Revenge of the Sith, features Obi-Wan and the last few surviving Jedi.     Although Thrawn had been designated a Legends character in 2014, he was reintroduced into the canon in the 2016 third season of Rebels, with Zahn returning to write more novels based in the character, and set in the new canon.            ": null
    },
    {
        "Marvel Comics": "Marvel Comics"
    },
    {
        " published a ": null
    },
    {
        "Star Wars comic book series": "Star Wars"
    },
    {
        " from 1977 to 1986.     Original Star Wars comics were serialized in the Marvel magazine  Pizzazz  between 1977 and 1979. The 1977 installments were the first original Star Wars stories not directly adapted from the films to appear in print form, as they preceded those of the Star Wars comic series.  From 1985–1987, the animated childrens series  Ewoks  and  Droids  inspired comic series from Marvels ": null
    },
    {
        "Star Comics": "Star Comics"
    },
    {
        " line.        In the late 1980s, Marvel dropped a new Star Wars comic it had in development, which was picked up by ": null
    },
    {
        "Dark Horse Comics": "Dark Horse Comics"
    },
    {
        " and published as the popular Dark Empire series .  Dark Horse subsequently launched dozens of series set after the original film trilogy, including  Tales of the Jedi  ,  X-wing Rogue Squadron  ,  Star Wars: Republic  ,  Star Wars Tales  ,  Star Wars: Empire  , and  Knights of the Old Republic  .       After Disneys acquisition of Lucasfilm, it was announced in January 2014 that in 2015 the Star Wars comics license would return to Marvel Comics,  whose parent company, ": null
    },
    {
        "Marvel Entertainment": "Marvel Entertainment"
    },
    {
        ", Disney had purchased in 2009.  Launched in 2015, the first three publications were titled  Star Wars ,  Darth Vader , and the limited series  Princess Leia .               ": null
    },
    {
        "John Williams": "John Williams"
    },
    {
        " composed the soundtracks for the nine episodic films; he has stated that he will retire from the franchise following The Rise of Skywalker.  He also composed the theme The Adventures of Han for Solo: A Star Wars Story, which ": null
    },
    {
        "John Powell": "John Powell"
    },
    {
        " composed the rest of the score of.  ": null
    },
    {
        "Michael Giacchino": "Michael Giacchino"
    },
    {
        " composed the score of Rogue One.                 Radio adaptations of the films were also produced. Lucas, a fan of the NPR-affiliated ": null
    },
    {
        "campus radio": "Campus Radio"
    },
    {
        " station of his alma mater the ": null
    },
    {
        "University of Southern California": "University Of Southern California"
    },
    {
        ", licensed the Star Wars radio rights to ": null
    },
    {
        "KUSC-FM": "Kusc-Fm"
    },
    {
        " for US$1. The production used John Williams original film score, along with ": null
    },
    {
        "Ben Burtts": "Ben Burtt"
    },
    {
        "sound effects.     The first was written by science-fiction author ": null
    },
    {
        "Brian Daley": "Brian Daley"
    },
    {
        " and directed by ": null
    },
    {
        "John Madden": "John Madden"
    },
    {
        ". It was broadcast on ": null
    },
    {
        "National Public Radio": "Npr"
    },
    {
        " in 1981, adapting ": null
    },
    {
        "the original 1977 film": "Star Wars"
    },
    {
        " into 13-episodes.    ": null
    },
    {
        "Mark Hamill": "Mark Hamill"
    },
    {
        " and ": null
    },
    {
        "Anthony Daniels": "Anthony Daniels"
    },
    {
        " reprised their film roles.     The overwhelming success, led to a 10-episode adaptation of The Empire Strikes Back debuted in 1983.  ": null
    },
    {
        "Billy Dee Williams": "Billy Dee Williams"
    },
    {
        " joined the other two stars, reprising his role as Lando Calrissian.      In 1983, ": null
    },
    {
        "Buena Vista Records": "Buena Vista Records"
    },
    {
        " released an original, 30-minute Star Wars ": null
    },
    {
        "audio drama": "Audio Drama"
    },
    {
        " titled Rebel Mission to Ord Mantell, written by Daley. In the 1990s, ": null
    },
    {
        "Time Warner Audio Publishing": "Time Warner"
    },
    {
        " adapted several Star Wars series from ": null
    },
    {
        "Dark Horse Comics": "Dark Horse Comics"
    },
    {
        " into audio dramas: the three-part  Dark Empire  saga,  Tales of the Jedi ,  Dark Lords of the Sith , the  Dark Forces  trilogy, and  Crimson Empire  . Return of the Jedi was adapted into 6-episodes in 1996, featuring Daniels.           The Star Wars franchise has spawned over one hundred  computer, video, and board games, dating back to some of the earliest ": null
    },
    {
        "home consoles": "Video Game Console"
    },
    {
        ". Some are based directly on the movie material, while others rely heavily on the non-canonical ": null
    },
    {
        "Expanded Universe": "Star Wars Expanded Universe"
    },
    {
        " . Star Wars games have gone through three significant development eras, marked by a change in leadership among the developers: the early licensed games, those developed after the creation of LucasArts, and those created after the closure of the Lucasfilm division by Disney and the transfer of the license to ": null
    },
    {
        "Electronic Arts": "Electronic Arts"
    },
    {
        ".       The first era began with the first officially licensed electronic Star Wars game: ": null
    },
    {
        "Kenners": "Kenner Products"
    },
    {
        "1979 table-top Star Wars Electronic Battle Command.   In 1982, ": null
    },
    {
        "Parker Brothers": "Parker Brothers"
    },
    {
        " published the first Star Wars video game for the ": null
    },
    {
        "Atari 2600": "Atari 2600"
    },
    {
        ",  Star Wars: The Empire Strikes Back .  It was followed in 1983 by ": null
    },
    {
        "Ataris": "Atari"
    },
    {
        " rail shooter": "Rail Shooter"
    },
    {
        " arcade game": "Arcade Game"
    },
    {
        "  Star Wars , which used ": null
    },
    {
        "vector graphics": "Vector Graphics"
    },
    {
        " to replicate the Death Star trench run scene from the 1977 film.  The next game,  Star Wars: Return of the Jedi  , used more traditional ": null
    },
    {
        "raster graphics": "Raster Graphics"
    },
    {
        ",  while the following  Star Wars: The Empire Strikes Back  returned to vector graphics.   Star Wars  was released for the ": null
    },
    {
        "Nintendo Entertainment System": "Nintendo Entertainment System"
    },
    {
        " in 1991, followed by a ": null
    },
    {
        "sequel": "Star Wars: The Empire Strikes Back"
    },
    {
        " the following year.  Super Star Wars  was also released in 1992, followed by two sequels over the next two years.          The beginning of the second era is marked by the prominence of LucasArts and modern self-published games. LucasArts was founded after Star Wars creator George Lucas took interest in the increasing success of the video game market. Wanting to have more creative control over the games and their narratives, Lucas founded his own video-game development company, LucasArts. During this era, improved video game graphics allowed games to tell complex narratives, which allowed for the retelling of the films, and eventually original narratives set in the same continuity as the films, with voice overs and CGI ": null
    },
    {
        "cutscene": "Cutscene"
    },
    {
        "s. Lucasfilm had founded its own video game company in 1982, becoming best known for adventure games and ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " flight combat games. In 1993, ": null
    },
    {
        "LucasArts": "Lucasarts"
    },
    {
        " released  Star Wars: X-Wing , the first self-published Star Wars video game and the first ": null
    },
    {
        "space flight simulator": "Space Simulator"
    },
    {
        " based on the franchise.  It was one of the best-selling video games of 1993 and established its own ": null
    },
    {
        "series of games": "Star Wars: X-Wing"
    },
    {
        ". The ": null
    },
    {
        "Rogue Squadron series": "Star Wars: Rogue Squadron"
    },
    {
        " was released between 1998 and 2003, also focusing on space battles set during the films.      Dark Forces  , a hybrid ": null
    },
    {
        "adventure game": "Adventure Game"
    },
    {
        " incorporating puzzles and strategy,  was the first Star Wars ": null
    },
    {
        "first-person shooter": "First-Person Shooter"
    },
    {
        ".  It featured gameplay and graphical features not then common in other games, made possible by LucasArts custom-designed ": null
    },
    {
        "game engine": "Game Engine"
    },
    {
        ", the ": null
    },
    {
        "Jedi": "Jedi"
    },
    {
        ".   The game was well received,    and it was followed by ": null
    },
    {
        "four sequels": "Star Wars: Jedi Knight"
    },
    {
        ".   The series introduced ": null
    },
    {
        "Kyle Katarn": "Kyle Katarn"
    },
    {
        ", who would appear in multiple games, novels, and comics.  Katarn is a former ": null
    },
    {
        "stormtrooper": "Stormtrooper"
    },
    {
        " who joins the rebellion and becomes a Jedi,   a plot arc similar to that of ": null
    },
    {
        "Finn": "Finn"
    },
    {
        " in The Force Awakens. A ": null
    },
    {
        "massively multiplayer online role-playing game": "Massively Multiplayer Online Role-Playing Game"
    },
    {
        ",  Star Wars Galaxies , was in operation from 2003 until 2011. After ": null
    },
    {
        "Disney": "The Walt Disney Company"
    },
    {
        " bought Lucasfilm in 2012, the games developed during the first two eras were discarded from the canon in 2014 and reassigned to the non-canonical Star Wars Legends label. LucasArts ceased its role as a developer in 2013, although it still operates as a ": null
    },
    {
        "licensor": "Brand Licensing"
    },
    {
        ".      EA Star Wars ": null
    },
    {
        "Electronic Arts": "Electronic Arts"
    },
    {
        ", marking the start of the third era. Games made during this era are considered canonical, and feature more influence from the Star Wars filmmakers. Disney partnered with ": null
    },
    {
        "Lenovo": "Lenovo"
    },
    {
        " to create the ": null
    },
    {
        "augmented reality": "Augmented Reality"
    },
    {
        " video game Jedi Challenges, released in November 2017.   In August 2018, it was announced that ": null
    },
    {
        "Zynga": "Zynga"
    },
    {
        " would publish ": null
    },
    {
        "free-to-play": "Free-To-Play"
    },
    {
        " Star Wars mobile games.  The Battlefront games received a canonical reboot in 2017.  Jedi: Fallen Order  will be release in late 2019.            In addition to the ": null
    },
    {
        "Disneyland": "Disneyland"
    },
    {
        " ride ": null
    },
    {
        "Star Tours": "Star Tours"
    },
    {
        " and its renovation as ": null
    },
    {
        "Star Tours – The Adventures Continue": "Star Tours – The Adventures Continue"
    },
    {
        " , many live attractions have been held at Disney parks, including the travelling exhibition ": null
    },
    {
        "Where Science Meets Imagination": "Star Wars: Where Science Meets Imagination"
    },
    {
        ", the ": null
    },
    {
        "Space Mountain": "Space Mountain"
    },
    {
        " spin-off ": null
    },
    {
        "Hyperspace Mountain": "Star Wars Hyperspace Mountain"
    },
    {
        ", a walkthrough ": null
    },
    {
        "Launch Bay": "Star Wars Launch Bay"
    },
    {
        ", and the night-time  A Galactic Spectacular . An immersive themed area called ": null
    },
    {
        "Galaxys Edge": "Star Wars: Galaxys Edge"
    },
    {
        " opened at ": null
    },
    {
        "Disneyland": "Disneyland"
    },
    {
        " and opened at ": null
    },
    {
        "Walt Disney World": "Walt Disney World"
    },
    {
        " in mid-2019.  A themed hotel, ": null
    },
    {
        "Star Wars: Galactic Starcruiser": "Star Wars: Galactic Starcruiser"
    },
    {
        ", is currently under construction at Walt Disney World.           A multimedia project involves works released across multiple types of media.  Shadows of the Empire  was a multimedia project set between The Empire Strikes Back and Return of the Jedi that included a novel by ": null
    },
    {
        "Steve Perry": "Steve Perry"
    },
    {
        ", a comic book series, a ": null
    },
    {
        "video game": "Star Wars: Shadows Of The Empire"
    },
    {
        ", and action figures.  The Force Unleashed  was a similar project set between Revenge of the Sith and A New Hope that included a novel, a ": null
    },
    {
        "2008 video game": "Star Wars: The Force Unleashed"
    },
    {
        " and its ": null
    },
    {
        "2010 sequel": "Star Wars: The Force Unleashed Ii"
    },
    {
        ", a ": null
    },
    {
        "graphic novel": "Graphic Novel"
    },
    {
        ", a ": null
    },
    {
        "role-playing game": "Star Wars Roleplaying Game Saga Edition"
    },
    {
        " supplement, and toys.                 The success of the Star Wars films led the franchise to become one of the most merchandised franchises in the world. While filming the original 1977 film, George Lucas decided to take a $500,000 pay cut to his salary as director in exchange for full ownership of the franchises merchandising rights. The first six films produced approximately billion in merchandising revenue.      ": null
    },
    {
        "Kenner": "Kenner"
    },
    {
        " made the first Star Wars ": null
    },
    {
        "action figures": "Action Figure"
    },
    {
        "to coincide with the release of the film, and today the original figures are highly valuable. Since the 1990s, Hasbro holds the rights to create action figures based on the saga. ": null
    },
    {
        "Pez dispensers": "Star Wars Pez"
    },
    {
        " began to be produced in 1997. Nina Chertoff and Susan Kahn, , Celebrating Pez , 87. Star Wars was the first ": null
    },
    {
        "intellectual property": "Intellectual Property"
    },
    {
        " to be licensed in ": null
    },
    {
        "Lego": "Lego"
    },
    {
        " history.  Lego has produced animated parody short films and mini-series to promote their ": null
    },
    {
        "Star Wars sets": "Lego Star Wars"
    },
    {
        ".  The ": null
    },
    {
        "Lego Star Wars video games": "Lego Star Wars"
    },
    {
        " are critically acclaimed bestsellers.       In 1977, the board game Star Wars: Escape from the Death Star was released,  not to be confused with the board game with the same name published in 1990.  A  Star Wars Monopoly  and themed versions of  Trivial Pursuit  and ": null
    },
    {
        "Battleship": "Battleship"
    },
    {
        " were released in 1997, with updated versions released in subsequent years. The board game  Risk  has been adapted in two editions by ": null
    },
    {
        "Hasbro": "Hasbro"
    },
    {
        ":  The Clone Wars Edition   and the  Original Trilogy Edition  .  Three Star Wars tabletop ": null
    },
    {
        "role-playing games": "Role-Playing Game"
    },
    {
        "have been developed: ": null
    },
    {
        "a version by West End Games": "Star Wars: The Roleplaying Game"
    },
    {
        " in the 1980s and 1990s, ": null
    },
    {
        "one by Wizards of the Coast": "Star Wars Roleplaying Game"
    },
    {
        " in the 2000s, and ": null
    },
    {
        "one by Fantasy Flight Games": "Star Wars Roleplaying Game"
    },
    {
        " in the 2010s.     Star Wars ": null
    },
    {
        "trading cards": "Star Wars Trading Cards"
    },
    {
        " have been published since the first blue series, by ": null
    },
    {
        "Topps": "Topps"
    },
    {
        ", in 1977.  Dozens of series have been produced, with Topps being the licensed creator in the United States. Some of the card series are of film stills, while others are original art. Many of the cards have become highly collectible with some very rare promos , such as the 1993 Galaxy Series II floating Yoda P3 card often commanding US$1,000 or more. While most base or common card sets are plentiful, many insert or ": null
    },
    {
        "chase cards": "Trading Card"
    },
    {
        " are very rare.  From 1995 until 2001, ": null
    },
    {
        "Decipher, Inc.": "Decipher, Inc."
    },
    {
        " had the license for, created and produced ": null
    },
    {
        "a collectible card game": "Star Wars Customizable Card Game"
    },
    {
        " based on the franchise.          Star Wars features elements such as ": null
    },
    {
        "knighthood": "Knighthood"
    },
    {
        ", ": null
    },
    {
        "chivalry": "Chivalry"
    },
    {
        ", and ": null
    },
    {
        "Jungian archetypes": "Jungian Archetypes"
    },
    {
        " such as ": null
    },
    {
        "the shadow": "Shadow"
    },
    {
        ".    There are also many references to ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        ", such as in the appearance of ": null
    },
    {
        "Darth Maul": "Darth Maul"
    },
    {
        ", whose design draws heavily from traditional depictions of the ": null
    },
    {
        "devil": "Devil In Christianity"
    },
    {
        ".  Anakin was conceived of a ": null
    },
    {
        "virgin birth": "Miraculous Birth"
    },
    {
        ", and is assumed to be the ": null
    },
    {
        "Chosen One": "Chosen One"
    },
    {
        " , a ": null
    },
    {
        "messianic": "Messiah"
    },
    {
        " individual. However, unlike ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        ", Anakin falls from grace, remaining evil as Darth Vader until Return of the Jedi. According to ": null
    },
    {
        "Adam Driver": "Adam Driver"
    },
    {
        ", sequel trilogy villain Kylo Ren, who idolizes Vader, believes he is doing what he thinks is right .  George Lucas has said that the theme of the saga is redemption.      The saga draws heavily from the ": null
    },
    {
        "heros journey": "Heros Journey"
    },
    {
        ", an archetypical template developed by ": null
    },
    {
        "comparative mythologist": "Comparative Mythologist"
    },
    {
        " Joseph Campbell": "Joseph Campbell"
    },
    {
        ". Each character—primarily Anakin, Luke, and Rey—follows the steps of the cycle or undergoes its reversal, becoming the villain.  A defining step of the journey is Atonement with the Father .  Obi-Wans loss of a ": null
    },
    {
        "father figure": "Father Figure"
    },
    {
        " could have impacted his relationship with Anakin,  whom both Obi-Wan and Palpatine are fatherlike mentors to.  Lukes discovery that Vader is his father has strong repurcussions on the saga and is regarded as one of the most influential ": null
    },
    {
        "plot twists": "Plot Twist"
    },
    {
        "in cinema.  ": null
    },
    {
        "Supreme Leader Snoke": "Supreme Leader Snoke"
    },
    {
        " encourages Kylo Ren to kill his father, Han Solo. Kylo uses the fact that Rey is an orphan to tempt her into joining the dark side.  According to  Inverse , the final scene in The Last Jedi, which depicts servant children playing with a toy of Luke and one boy using the Force, symbolizes that the Force can be found in people with humble beginnings.        ": null
    },
    {
        "Political science": "Political Science"
    },
    {
        " has been an important element of Star Wars since the franchise launched in 1977, focusing on a struggle between ": null
    },
    {
        "democracy": "Democracy"
    },
    {
        " and ": null
    },
    {
        "dictatorship": "Dictatorship"
    },
    {
        ". Darth Vaders design, initially inspired by ": null
    },
    {
        "Samurai armor": "Japanese Armour"
    },
    {
        ", also incorporated a ": null
    },
    {
        "German military helmet": "Stahlhelm"
    },
    {
        ".   Originally, Lucas conceived of the Sith as a group that served the Emperor in the same way that the  Schutzstaffel  served ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        "; this was condensed into one character in the form of Darth Vader. ": null
    },
    {
        "Stormtroopers": "Stormtrooper"
    },
    {
        " borrow the name of ": null
    },
    {
        "Nazi": "Nazi"
    },
    {
        "  shock troopers": "Stormtrooper"
    },
    {
        ". Imperial officers wear uniforms resembling ": null
    },
    {
        "those of German forces during World War II": "Uniforms Of The Heer"
    },
    {
        ",  and political and security officers resemble the black-clad SS down to the stylized silver ": null
    },
    {
        "deaths head": "Totenkopf"
    },
    {
        " on their caps. ": null
    },
    {
        "World War  II": "World War & Nbsp;Ii"
    },
    {
        " terms were used for names in the films; e.g. the planets ": null
    },
    {
        "Kessel": "Kessel"
    },
    {
        "  and ": null
    },
    {
        "Hoth": "Hoth"
    },
    {
        " .  Shots of the commanders looking through ": null
    },
    {
        "AT-AT": "At-At"
    },
    {
        " walker viewscreens in The Empire Strikes Back resemble tank interiors,  and space battles in the original film were based on ": null
    },
    {
        "World War  I": "World War & Nbsp;I"
    },
    {
        " and World War  II ": null
    },
    {
        "dogfight": "Dogfight"
    },
    {
        "s.      Palpatine being a ": null
    },
    {
        "chancellor": "Chancellor"
    },
    {
        " before becoming the ": null
    },
    {
        "Emperor": "Emperor"
    },
    {
        " in the prequel trilogy alludes to Hitlers role before appointing himself  Führer . Lucas has also drawn parallels to historical dictators such as ": null
    },
    {
        "Julius Caesar": "Julius Caesar"
    },
    {
        ", ": null
    },
    {
        "Napoleon Bonaparte": "Napoleon Bonaparte"
    },
    {
        ", and politicians like ": null
    },
    {
        "Richard Nixon": "Richard Nixon"
    },
    {
        ".    The ": null
    },
    {
        "Great Jedi Purge": "Great Jedi Purge"
    },
    {
        " mirrors the events of the ": null
    },
    {
        "Night of the Long Knives": "Night Of The Long Knives"
    },
    {
        ".  The corruption of the Galactic Republic is modeled after the fall of the democratic ": null
    },
    {
        "Roman Republic": "Roman Republic"
    },
    {
        " and the formation of ": null
    },
    {
        "an empire": "Roman Empire"
    },
    {
        ".       On the inspiration for the ": null
    },
    {
        "First Order": "First Order"
    },
    {
        " formed from the ashes of the Empire , The Force Awakens director J.  J. Abrams spoke of conversations the writers had about how the Nazis could have ": null
    },
    {
        "escaped to Argentina": "Ratlines"
    },
    {
        " after WWII and started working together again.               The Star Wars saga has had a significant impact on ": null
    },
    {
        "popular culture": "Popular Culture"
    },
    {
        ",  with references to its fictional universe deeply embedded in everyday life.  Phrases like evil empire and ": null
    },
    {
        "May the Force be with you": "May The Force Be With You"
    },
    {
        " have become part of the popular lexicon.  The first Star Wars film in 1977 was a cultural unifier,  enjoyed by a wide spectrum of people.  The film can be said to have helped launch the science-fiction boom of the late 1970s and early 1980s, making ": null
    },
    {
        "science-fiction films": "Science-Fiction Film"
    },
    {
        "a mainstream genre.  The widespread impact made it a prime target for parody works and homages, with popular examples including  Hardware Wars ,  Spaceballs ,  The Family Guy Trilogy  and  Robot Chicken: Star Wars .     In 1989, the ": null
    },
    {
        "Library of Congress": "Library Of Congress"
    },
    {
        " selected the original Star Wars film for preservation in the U.S. ": null
    },
    {
        "National Film Registry": "National Film Registry"
    },
    {
        ", as being culturally, historically, or aesthetically significant.  The Empire Strikes Back, was selected in 2010.   35mm reels of the 1997 Special Editions were the versions initially presented for preservation because of the difficulty of transferring from the original prints,   but it was later revealed that the Library possesses a copyright deposit print of the original theatrical releases.        The original Star Wars film was a huge success for ": null
    },
    {
        "20th Century Fox": "20Th Century Fox"
    },
    {
        ", and was credited for reinvigorating the company. Within three weeks of the films release, the studios stock price doubled to a record high. Prior to 1977, 20th Century Foxs greatest annual profits were $37 million, while in 1977, the company broke that record by posting a profit of $79 million. The franchise helped Fox to change from an almost bankrupt ": null
    },
    {
        "production company": "Production Company"
    },
    {
        " to a thriving media conglomerate.      Star Wars fundamentally changed the aesthetics and narratives of ": null
    },
    {
        "Hollywood": "Cinema Of The United States"
    },
    {
        " films, switching the focus of Hollywood-made films from deep, meaningful stories based on dramatic conflict, themes and ": null
    },
    {
        "irony": "Irony"
    },
    {
        " to sprawling special-effects-laden ": null
    },
    {
        "blockbusters": "Blockbuster"
    },
    {
        ", as well as changing the Hollywood film industry in fundamental ways. Before Star Wars, special effects in films had not appreciably advanced since the 1950s.  The commercial success of Star Wars created a boom in state-of-the-art special effects in the late 1970s. Along with  Jaws , Star Wars started the tradition of the summer ": null
    },
    {
        "blockbuster": "Blockbuster"
    },
    {
        " film in the entertainment industry, where films open on many screens at the same time and profitable ": null
    },
    {
        "franchises": "Media Franchise"
    },
    {
        " are important.  It created the model for the major film trilogy and showed that merchandising rights on a film could generate more money than the film itself did.     The original Star Wars trilogy is widely considered one of the best film trilogies in history. For a sampling of the reviews, read the following:       Numerous filmmakers have been influenced by Star Wars, including ": null
    },
    {
        "Damon Lindelof": "Damon Lindelof"
    },
    {
        ", ": null
    },
    {
        "Dean Devlin": "Dean Devlin"
    },
    {
        ", ": null
    },
    {
        "Roland Emmerich": "Roland Emmerich"
    },
    {
        ", ": null
    },
    {
        "John Lasseter": "John Lasseter"
    },
    {
        ",  ": null
    },
    {
        "David Fincher": "David Fincher"
    },
    {
        ", ": null
    },
    {
        "Joss Whedon": "Joss Whedon"
    },
    {
        ", ": null
    },
    {
        "John Singleton": "John Singleton"
    },
    {
        ", ": null
    },
    {
        "Kevin Smith": "Kevin Smith"
    },
    {
        ",  and later Star Wars directors ": null
    },
    {
        "J.  J. Abrams": "J. & Nbsp;J. Abrams"
    },
    {
        " and ": null
    },
    {
        "Gareth Edwards": "Gareth Edwards"
    },
    {
        ".  ": null
    },
    {
        "Christopher Nolan": "Christopher Nolan"
    },
    {
        " cited Star Wars as an influence when making the 2010 blockbuster film  Inception .  Lucass concept of a used universe particularly influenced ": null
    },
    {
        "Ridley Scotts": "Ridley Scott"
    },
    {
        "  Blade Runner  and  Alien  , ": null
    },
    {
        "James Camerons": "James Cameron"
    },
    {
        "  Aliens  as well as  The Terminator  , ": null
    },
    {
        "George Millers": "George Miller"
    },
    {
        "  Mad Max 2 , and ": null
    },
    {
        "Peter Jacksons": "Peter Jackson"
    },
    {
        " The Lord of the Rings trilogy": "The Lord Of The Rings"
    },
    {
        ".     Regarding the return and expansion of the franchise, ": null
    },
    {
        "Lawrence Kasdan": "Lawrence Kasdan"
    },
    {
        " noted that the spin-offs were expanding the franchise into more of a ": null
    },
    {
        "shared universe": "Shared Universe"
    },
    {
        " beyond the previously linear saga, adding that one of the strengths of the franchise was how it all fell under the same continuity in comparison to other franchises. Kasdan also contrasted Star Wars to the ": null
    },
    {
        "Marvel Cinematic Universe": "Marvel Cinematic Universe"
    },
    {
        ", noting that Star Wars features less ": null
    },
    {
        "comedy": "Comedy"
    },
    {
        " than the latter, and adding that he felt a more comedic approach would not be Star Wars to him.       Film critic ": null
    },
    {
        "Roger Ebert": "Roger Ebert"
    },
    {
        " wrote in his book  The Great Movies , Like  The Birth of a Nation  and  Citizen Kane , Star Wars was a technical watershed that influenced many of the movies that came after. It began a new generation of special effects and high-energy motion pictures. The film was one of the first films to link genres together to invent a new, ": null
    },
    {
        "high-concept": "High-Concept"
    },
    {
        " genre for filmmakers to build upon. Finally, along with ": null
    },
    {
        "Steven Spielbergs": "Steven Spielberg"
    },
    {
        "  Jaws , it shifted the film industrys focus away from personal filmmaking of the 1970s and towards fast-paced, big-budget ": null
    },
    {
        "blockbusters": "Blockbuster"
    },
    {
        " for younger audiences.  ": null
    },
    {
        "Shone, Tom": "Tom Shone"
    },
    {
        " .  Blockbuster: How Hollywood Learned to Stop Worrying and Love the Summer . London: Simon & Schuster. p. 64. .     Some critics have blamed Star Wars and Jaws for ruining Hollywood by shifting its focus from sophisticated films such as  The Godfather ,  Taxi Driver , and  Annie Hall  to films about spectacle and juvenile fantasy, and for the industry shift from stand-alone, one and done films, towards blockbuster franchises with multiple sequels and prequels.  One such critic, ": null
    },
    {
        "Peter Biskind": "Peter Biskind"
    },
    {
        ", complained, When all was said and done, Lucas and Spielberg returned the 1970s audience, grown sophisticated on a diet of European and ": null
    },
    {
        "New Hollywood": "New Hollywood"
    },
    {
        " films, to the simplicities of the pre-1960s ": null
    },
    {
        "Golden Age of movies": "Classical Hollywood Cinema"
    },
    {
        "... They marched backward through the looking-glass. ": null
    },
    {
        "Biskind, Peter": "Peter Biskind"
    },
    {
        " . Star Bucks . Easy Riders, Raging Bulls: How the Sex-Drugs-and-Rock N Roll Generation Saved Hollywood. New York: ": null
    },
    {
        "Simon & Schuster": "Simon  &  Schuster"
    },
    {
        ". pp. 336–337, 343. . In an opposing view, ": null
    },
    {
        "Tom Shone": "Tom Shone"
    },
    {
        " wrote that through Star Wars and Jaws, Lucas and Spielberg didnt betray cinema at all: they plugged it back into the grid, returning the medium to its roots as a carnival sideshow, a magic act, one big special effect , which was a kind of rebirth .          The Star Wars saga has inspired many fans to create their own non-canon material set in the Star Wars galaxy. In recent years, this has ranged from writing ": null
    },
    {
        "fan fiction": "Fan Fiction"
    },
    {
        " to creating ": null
    },
    {
        "fan film": "Fan Film"
    },
    {
        "s. In 2002, Lucasfilm sponsored the first annual ": null
    },
    {
        "Official Star Wars Fan Film Awards": "The Official Star Wars Fan Film Awards"
    },
    {
        ", officially recognizing filmmakers and the genre. Because of concerns over potential ": null
    },
    {
        "copyright": "Copyright"
    },
    {
        " and trademark issues, however, the contest was initially open only to ": null
    },
    {
        "parodies": "Parody"
    },
    {
        ", ": null
    },
    {
        "mockumentaries": "Mockumentary"
    },
    {
        ", and documentaries. Fan fiction films set in the Star Wars universe were originally ineligible, but in 2007, Lucasfilm changed the submission standards to allow in-universe fiction entries.  Lucasfilm has allowed but not endorsed the creation of fan fiction, as long as it does not attempt to make a profit.        As the characters and the storyline of the original trilogy are so well known, educators have used the films in the classroom as a learning resource. For example, a project in Western Australia honed elementary school students storytelling skills by role-playing action scenes from the movies and later creating props and audio/visual scenery to enhance their performance.  Others have used the films to encourage second-level students to integrate technology in the science classroom by making prototype lightsabers.  Similarly, psychiatrists in New Zealand and the US have advocated their use in the university classroom to explain different types of ": null
    },
    {
        "psychopathology": "Psychopathology"
    },
    {
        ".  ": null
    }
]