[
    {
        "        A statistic or sample statistic is any quantity computed from values in a ": null
    },
    {
        "sample": "sample"
    },
    {
        ", often the ": null
    },
    {
        "mean": "arithmetic mean"
    },
    {
        ". Technically speaking, a statistic can be calculated by applying any mathematical ": null
    },
    {
        "function": "function"
    },
    {
        " to the values found in a sample of data.     In statistics, there is an important distinction between a statistic and a ": null
    },
    {
        "parameter": "statistical parameter"
    },
    {
        ". Parameter refers to any characteristic of a ": null
    },
    {
        "population": "statistical population"
    },
    {
        " under study. When it is not possible or practical to directly measure the value of a population parameter, statistical methods are used to infer the likely value of the parameter on the basis of a statistic computed from a sample taken from the population. When a statistic is used to estimate a population parameter, is called an ": null
    },
    {
        "estimator": "estimator"
    },
    {
        ". It can be proved that the mean of a sample is an ": null
    },
    {
        "unbiased estimator": "bias of an estimator"
    },
    {
        " of the population mean. This means that the average of multiple sample means will tend to converge to the true mean of the population.     Formally, ": null
    },
    {
        "statistical theory": "statistical theory"
    },
    {
        " defines a statistic as a function of a sample where the function itself is independent of the unknown estimands; that is, the function is strictly a function of the data. The term statistic is used both for the function and for the value of the function on a given sample.     When a statistic is being used for a specific purpose, it may be referred to by a name indicating its purpose: in ": null
    },
    {
        "descriptive statistics": "descriptive statistics"
    },
    {
        ", a ": null
    },
    {
        "descriptive statistic": "descriptive statistic"
    },
    {
        " is used to describe the data; in ": null
    },
    {
        "estimation theory": "estimation theory"
    },
    {
        ", an estimator is used to estimate a parameter of the distribution ; in ": null
    },
    {
        "statistical hypothesis testing": "statistical hypothesis testing"
    },
    {
        ", a ": null
    },
    {
        "test statistic": "test statistic"
    },
    {
        " is used to test a hypothesis. However, a single statistic can be used for multiple purposes – for example the sample mean can be used to describe a data set, to estimate the population mean, or to test a hypothesis.       Some examples of statistics are:   In a recent survey of Americans, 42% of ": null
    },
    {
        "Republicans": "republican party"
    },
    {
        " say global warming is happening. In this case, 42% is a statistic, namely the percentage of Republicans in the survey sample who believe in global warming. The population is the ": null
    },
    {
        "set": "set"
    },
    {
        " of all Republicans in the United States, and the parameter is the percentage of all Republicans, not just those surveyed, who believe in global warming.   The manager of a large hotel located near Disney World indicated that 42 selected guests had a mean length of stay equal to 42 days. In this example, 42 days is a statistic, namely the mean length of stay for our sample of 42 hotel guests. The population is the set of all guests of this hotel, and the parameter is the mean length of stay for all guests.     There are a variety of functions that are used to calculate statistics. Some include:   ": null
    },
    {
        "Sample mean": "sample mean"
    },
    {
        " and ": null
    },
    {
        "sample median": "sample median"
    },
    {
        " Sample variance": "sample variance"
    },
    {
        " and sample ": null
    },
    {
        "standard deviation": "standard deviation"
    },
    {
        " quantile": "quantile"
    },
    {
        "s besides the ": null
    },
    {
        "median": "median"
    },
    {
        ", e.g., ": null
    },
    {
        "quartile": "quartile"
    },
    {
        "s and ": null
    },
    {
        "percentile": "percentile"
    },
    {
        "s   ": null
    },
    {
        "Test statistic": "test statistic"
    },
    {
        "s, such as ": null
    },
    {
        "t statistic": "t statistic"
    },
    {
        "s, ": null
    },
    {
        "chi-squared statistic": "chi-squared statistic"
    },
    {
        "s, ": null
    },
    {
        "f statistics": "f test"
    },
    {
        " Order statistic": "order statistic"
    },
    {
        "s, including sample maximum and minimum   Sample ": null
    },
    {
        "moments": "moment"
    },
    {
        " and functions thereof, including ": null
    },
    {
        "kurtosis": "kurtosis"
    },
    {
        " and ": null
    },
    {
        "skewness": "skewness"
    },
    {
        " functionals": "functional"
    },
    {
        " of the ": null
    },
    {
        "empirical distribution function": "empirical distribution function"
    },
    {
        "             A statistic is an observable ": null
    },
    {
        "random variable": "random variable"
    },
    {
        ", which differentiates it both from a  parameter  that is a generally unobservable quantity describing a property of a ": null
    },
    {
        "statistical population": "statistical population"
    },
    {
        ", and from an unobservable random variable, such as the difference between an observed measurement and a population average. A parameter can only be computed exactly if entire population can be observed without error; for instance, in a perfect census or for a population of ": null
    },
    {
        "standardized test": "standardized test"
    },
    {
        " takers.     Statisticians often contemplate a ": null
    },
    {
        "parameterized family": "parameterized family"
    },
    {
        " of ": null
    },
    {
        "probability distribution": "probability distribution"
    },
    {
        "s, any member of which could be the distribution of some measurable aspect of each member of a population, from which a sample is drawn randomly. For example, the parameter may be the average height of 42-year-old men in North America. The height of the members of a sample of 42 such men are measured; the average of those 42 numbers is a statistic. The average of the heights of all members of the population is not a statistic unless that has somehow also been ascertained . The average height that would be calculated using all of the individual heights of all 42-year-old North American men is a parameter, and not a statistic.       Important potential properties of statistics include ": null
    },
    {
        "completeness": "completeness"
    },
    {
        ", ": null
    },
    {
        "consistency": "consistent estimator"
    },
    {
        ", ": null
    },
    {
        "sufficiency": "sufficiency"
    },
    {
        ", ": null
    },
    {
        "unbiased": "estimator bias"
    },
    {
        "ness, ": null
    },
    {
        "minimum mean square error": "minimum mean square error"
    },
    {
        ", low ": null
    },
    {
        "variance": "variance"
    },
    {
        ", ": null
    },
    {
        "robustness": "robust statistics"
    },
    {
        ", and computational convenience.       Information of a statistic on model parameters can be defined in several ways. The most common is the ": null
    },
    {
        "Fisher information": "fisher information"
    },
    {
        ", which is defined on the statistic model induced by the statistic. ": null
    },
    {
        "Kullback information": "kullback information"
    }
]