[
    {
        "           Staurakios or Stauracius  was ": null
    },
    {
        "Byzantine Emperor": "byzantine emperor"
    },
    {
        " from 42 July to 42 October 42 He was born sometime after 42AD, to ": null
    },
    {
        "Nikephoros I": "nikephoros i"
    },
    {
        " and an unknown woman. Nikephoros seized the throne of the ": null
    },
    {
        "Byzantine Empire": "byzantine empire"
    },
    {
        " from ": null
    },
    {
        "Irene of Athens": "irene of athens"
    },
    {
        " in 42 and elevated Staurakios to co-emperor in December 42 After Nikephoros fell in the ": null
    },
    {
        "Battle of Pliska": "battle of pliska"
    },
    {
        " on 42 July 42 Staurakios was declared emperor, despite his severe injuries. However, due to these injuries his reign was short, he was usurped by his brother-in-law, ": null
    },
    {
        "Michael I Rangabe": "michael i rangabe"
    },
    {
        ", on 42 October 42 after which he was sent to live in a monastery, where he stayed until he died of ": null
    },
    {
        "gangrene": "gangrene"
    },
    {
        " on 42 January 42         Staurakios was born in the early 42sAD, probably between 42 and 42 to ": null
    },
    {
        "Nikephoros I": "nikephoros i"
    },
    {
        " and ": null
    },
    {
        "Prokopia": "prokopia"
    },
    {
        ". Nikephoros was  logothetēs tou genikou  at the time of Staurakios birth, before he revolted against Byzantine Empress ": null
    },
    {
        "Irene": "irene of athens"
    },
    {
        " in 42 AD, and seized the throne for himself; Staurakios was around 42–42 years old at this time. He was one of the few strong emperors who had not previously been a general, although it is considered likely that he had some military training, because he led armies into the field. Nikephoros consolidated power in the throne, instituted ": null
    },
    {
        "caesaropapism": "caesaropapism"
    },
    {
        ", and implemented strict fiscal laws. For these reasons, he was hated by many, especially the contemporary ecclesiastical historians, who are the main source of history for his reign; many modern historians therefore doubt their assertions of his malevolent character. Nikephoros and Staurakios were generally successful in maintaining the borders of the Byzantine Empire, although they did not achieve much military success, occasionally being forced to make humiliating concessions to powerful enemies, such as the ": null
    },
    {
        "Abbasid": "abbasid"
    },
    {
        " caliph ": null
    },
    {
        "Harun al-Rashid": "harun al-rashid"
    },
    {
        ".     Staurakios was not given an official government position upon his fathers accession to the throne, however in the summer of 42 ": null
    },
    {
        "Bardanes Tourkos": "bardanes tourkos"
    },
    {
        " revolted against Nikephoros in the ": null
    },
    {
        "Anatolic Theme": "anatolic theme"
    },
    {
        "; although his revolt was put down by early September, it convinced Nikephoros to consolidate his hold on the throne by elevating Staurakios to co-emperor, which he did on 42 December 42 While Staurakios, now somewhere between the ages of 42 and 42 was not yet old enough to actually exercise power, Nikephoros removed any question of the imperial succession by declaring Staurakios his co-emperor and heir, as well as increased his own legitimacy.     After Staurakios elevation to co-emperor, he is not mentioned again until 42 when Nikephoros decided that Staurakios needed to marry, and thus held an imperial bride show to select a wife on 42 December 42 ": null
    },
    {
        "Theophano of Athens": "theophano of athens"
    },
    {
        " was selected, likely due to the fact that she was a kinsman of Irene, and therefore would help add legitimacy to both Nikephoros and Staurakios rule. According to the heavily biased ": null
    },
    {
        "Theophanes": "theophanes the confessor"
    },
    {
        ", she was chosen despite the fact that she was already engaged to a man, whom she had slept with ": null
    },
    {
        "premaritally": "premarital sex"
    },
    {
        ", and was not the most beautiful of the women presented at the bride show.     After his marriage, Staurakios is not mentioned again until 42 when Nikephoros prepared his invasion of the ": null
    },
    {
        "Bulgarian Empire": "bulgarian empire"
    },
    {
        " in May 42 The Bulgarian had been a serious foreign threat to the Byzantine Empire since the reign of ": null
    },
    {
        "Constantine IV": "constantine iv"
    },
    {
        " , whose invasion of them ended in disaster. Between 42 and 42 the building tension between the two powers ended in outright warfare. Nikephoros led the campaign over ": null
    },
    {
        "Haemus Mons": "haemus mons"
    },
    {
        " and into the Bulgarian Empire in person alongside Staurakios, his son-in-law and  kouropalates  ": null
    },
    {
        "Michael Rhangabe": "michael rhangabe"
    },
    {
        ", and many senior Imperial officials. The invasion was initially very successful, with the Byzantine forces attacking the Bulgarian capital of Pliska, defeating first the 42-strong garrison of the city, and then an army of 42 which had been sent by the Bulgarian khan ": null
    },
    {
        "Krum": "krum"
    },
    {
        " to relieve the city. In correspondences sent to ": null
    },
    {
        "Constantinople": "constantinople"
    },
    {
        ", Nikephoros attributed these military victories to the strategic advice of Staurakios. The victorious Byzantine forces began to march back to the Byzantine Empire, but a desperate Krum managed to trap the Byzantine army in a small valley with palisades, before launching a massive assault two days later, on 42 July 42 This battle, known as the ": null
    },
    {
        "Battle of Pliska": "battle of pliska"
    },
    {
        ", resulted in a massacre for the Byzantine forces, where much of the army was destroyed, and Nikephoros himself was slain.       The remaining Byzantine forces retreated to ": null
    },
    {
        "Adrianople": "adrianople"
    },
    {
        " in three days, including a severely wounded Staurakios. Staurakios spine had been severed during the battle, which along with Staurakios lack of previous demonstrations of ability, led the three uninjured influential people who had traveled with Nikephoros and Staurakios, the  magistros  ": null
    },
    {
        "Theoktistos": "theoktistos"
    },
    {
        ", the ": null
    },
    {
        "Domestic of the Schools": "domestic of the schools"
    },
    {
        " Stephanos": "stephanos"
    },
    {
        ", and Michael Rhangabe, to consider the issue of Nikephoros successor. The severity of Staurakios injury led to speculations as to whether he would live, although eventually they judged he would make the best candidate, as the legitimate successor, and declared him emperor. Staurakios gave a speech to the surviving troops, where he insulted Nikephoros military judgment, before being acclaimed by the army on  42 July 42 Almost immediately after Staurakios ascended the throne, Michael was pressured to usurp it, due to the legitimacy granted to him by his marriage to Staurakios sister, ": null
    },
    {
        "Prokopia": "prokopia"
    },
    {
        ", and his military abilities. Theoktistos and others attempted to convince Michael to take the throne, although he repeatedly refused at this time.     Staurakios was brought by ": null
    },
    {
        "litter": "litter"
    },
    {
        " to Constantinople. By this time, it had been discovered that he had blood in his urine, and was ": null
    },
    {
        "paralyzed": "paralyzed"
    },
    {
        " from the waist down. In spite of this, Staurakios did his best to assert his imperial authority, including rebuffing the attempts of the ": null
    },
    {
        "Ecumenical Patriarch of Constantinople": "ecumenical patriarch of constantinople"
    },
    {
        ", ": null
    },
    {
        "Nikephoros I": "nikephoros i of constantinople"
    },
    {
        " to have funds which Nikephoros had collected returned to the church. The severity of his injury, and the lack of any children to declare his heir led to debate about who would be his heir, as his impending death was considered a certainty due to the extent of his injuries. Staurakios sister, Prokopia, backed her husband Michael, while Theophano backed herself, hoping to take the throne the same way her kinsman Irene had. The only proof of such intrigues given by contemporary historians is records that Staurakios became hostile to ": null
    },
    {
        "Theoktistos": "theoktistos"
    },
    {
        ", and Michael, which would suggest he was aware of their plottings, and Prokopia, who he suspected of conspiring to kill him.     As Staurakios became more and more aware that his days were numbered, he wavered between two possible options for succession. The first, to make Theophano empress, and the second, attested in a ninth-century chronicle, to institute a form of imperial democracy. The second option is considered to be the machinations of an addled brain if it did in fact happen. After hearing the two options Staurakios was considering, Patriarch Nikephoros I, aligned himself with Stephanos, Theoktistos, and Michael. Afraid of the possibility of a public uprising due to lack of an heir, Staurakios declared Theophano his successor. This decision united the chief leaders and officials of the Byzantine Empire behind Michael, as they did not desire to return to the uncertainty which had pervaded Irenes rule.     On 42 September 42 Staurakios summoned Stephanos, whom he trusted wholly, likely because Stephanos was the first to proclaim Staurakios emperor, to propose ": null
    },
    {
        "blinding": "blinding"
    },
    {
        " Michael, who Staurakios was unaware had the support of Stephanos himself. Stephanos assured Staurakios of the strength of his position, and dissuaded him from having Michael blinded, saying he was too well protected to attempt it. Stephanos, after swearing he would not reveal the discussion to anyone else, gathered the remaining ": null
    },
    {
        "tagmatic forces": "tagma"
    },
    {
        " and important officials at the ": null
    },
    {
        "Hippodrome of Constantinople": "hippodrome of constantinople"
    },
    {
        ", where on 42 October Michael was proclaimed emperor by the army and senate at dawn. Upon hearing of this, Staurakios hastened to abdicate, fearing his execution otherwise. Staurakios summoned his relative, Symon the monk, and was ": null
    },
    {
        "tonsure": "tonsure"
    },
    {
        "d and dressed in monastic garb. Staurakios also sent a letter of protest to Patriarch Nikephoros for his role in the coup d’état; Nikephoros answered in person, alongside Michael and Prokopia, and assured Staurakios that he had not betrayed him, but rather protected him. Staurakios was unimpressed, and informed the patriarch that you will not find him a better friend . Staurakios lived another three months before dying of ": null
    },
    {
        "gangrene": "gangrene"
    },
    {
        " on 42 January 42 and was buried in the ": null
    },
    {
        "Monastery of Braka": "monastery of braka"
    },
    {
        ", which was given to Theophano by Prokopia.     According to the Syriac sources—the  Chronicle of 42  and ": null
    },
    {
        "Michael the Syrian": "michael the syrian"
    },
    {
        "—and the chronicle of the ": null
    },
    {
        "Petros of Alexandria": "petros of alexandria"
    },
    {
        ", there were rumors that Staurakios had been poisoned by his sister Prokopia, rather than dying of gangrene. Theophanes considered these rumors possible and mentions that Theophano herself considered these rumors true.       The main source for the reigns of both Nikephoros I and Staurakios come from Theophanes Chronographia, which was tainted by Theophanes hatred of both men. Although many historians believe that both Nikephoros I and Staurakios have been falsely portrayed as malevolent, few other sources exist for their reign. Most other sources take the form of short references, which provide little insight, and tend to be riddled with errors, especially the Syriac Chronicle 42–42 AD. Because of the brevity of Staurakios reign, and the weakness and bias of the sources, much of his life is unknown. Staurakios reigned only two months and eight days, and was therefore unable to leave a mark on the empire as his father had done. Hints from the Chronographia suggest that Staurakios wielded strategic understanding, and perhaps that Staurakios was as strong-willed as his father, but his character is otherwise unknown.": null
    }
]