[
    {
        "In ": null
    },
    {
        "poker": "poker"
    },
    {
        ", a steal is a type of a ": null
    },
    {
        "bluff": "bluff"
    },
    {
        ", a ": null
    },
    {
        "raise": "raise"
    },
    {
        " during the first betting round made with an inferior hand and meant to make other players fold superior hands because of shown strength. A steal is normally either an ante steal or blind steal .     Steals are done with hands less valuable than what might normally be considered a raising hand, normally a below average one, with the hope that the few players remaining will not have a hand worth calling the raise, thereby winning the antes or blinds without further action. This play is used either in late ": null
    },
    {
        "position": "position"
    },
    {
        " after several people have folded, or when the game is short-handed. Steals happen more often in tournament situations due to the escalating ante/blind structure making the starting ": null
    },
    {
        "pot": "pot"
    },
    {
        " quite valuable.     While steals dont win much money per hand, they can accumulate to considerable profit if the players to the left of the stealer are tight enough not to contest enough steals. Of course, skilled players will recognize repeated steal plays and frequently reraise for ": null
    },
    {
        "defense": "defense"
    },
    {
        ".     Steals being made in late position when everyone folds to the stealer, or when the game is short-handed, are the most common steals, but a raise under other conditions can also act as a steal. An aggressive player, especially one with a large stack of chips, might reraise, also known as re-steal, someone he knows might be trying to steal. The objective here is twofold: the re-raiser hopes to pick up both the blinds and antes and the original raisers chips when the raiser folds, and he also hopes to keep that player from constantly raising before she or he can act because that cuts down on the reraisers own stealing opportunities.     If one or more players have called a raise pre-flop, a player can re-raise as a bluff in what is called a squeeze play": null
    }
]