[
    {
        "            Steel is an ": null
    },
    {
        "alloy": "alloy"
    },
    {
        " of ": null
    },
    {
        "iron": "iron"
    },
    {
        " and ": null
    },
    {
        "carbon": "carbon"
    },
    {
        ", and sometimes other elements. Because of its high ": null
    },
    {
        "tensile strength": "tensile strength"
    },
    {
        " and low cost, it is a major component used in ": null
    },
    {
        "building": "building"
    },
    {
        "s, ": null
    },
    {
        "infrastructure": "infrastructure"
    },
    {
        ", ": null
    },
    {
        "tool": "tool"
    },
    {
        "s, ": null
    },
    {
        "ship": "ship"
    },
    {
        "s, ": null
    },
    {
        "train": "train"
    },
    {
        "s, ": null
    },
    {
        "automobile": "automobile"
    },
    {
        "s, ": null
    },
    {
        "machine": "machine"
    },
    {
        "s, ": null
    },
    {
        "appliances": "home appliance"
    },
    {
        ", and ": null
    },
    {
        "weapon": "weapon"
    },
    {
        "s.     Iron is the ": null
    },
    {
        "base metal": "base metal"
    },
    {
        " of steel. Iron is able to take on two crystalline forms , ": null
    },
    {
        "body centered cubic and face centered cubic": "cubic crystal system"
    },
    {
        ", depending on its temperature. In the body-centered cubic arrangement, there is an iron atom in the center and eight atoms at the vertices of each cubic unit cell; in the face-centered cubic, there is one atom at the center of each of the six faces of the cubic unit cell and eight atoms at its vertices. It is the interaction of the ": null
    },
    {
        "allotropes of iron": "allotropes of iron"
    },
    {
        " with the alloying elements, primarily carbon, that gives steel and ": null
    },
    {
        "cast iron": "cast iron"
    },
    {
        " their range of unique properties.     In pure iron, the ": null
    },
    {
        "crystal structure": "crystal lattice"
    },
    {
        " has relatively little resistance to the iron atoms slipping past one another, and so pure iron is quite ": null
    },
    {
        "ductile": "ductility"
    },
    {
        ", or soft and easily formed. In steel, small amounts of carbon, other elements, and inclusions within the iron act as hardening agents that prevent the movement of ": null
    },
    {
        "dislocation": "dislocation"
    },
    {
        "s.     The carbon in typical steel alloys may contribute up to 2.14% of its weight. Varying the amount of carbon and many other alloying elements, as well as controlling their chemical and physical makeup in the final steel , slows the movement of those dislocations that make pure iron ductile, and thus controls and enhances its qualities. These qualities include the ": null
    },
    {
        "hardness": "hardness"
    },
    {
        ", ": null
    },
    {
        "quenching behavior": "quenching"
    },
    {
        ", need for ": null
    },
    {
        "annealing": "annealing"
    },
    {
        ", ": null
    },
    {
        "tempering behavior": "tempering"
    },
    {
        ", ": null
    },
    {
        "yield strength": "yield"
    },
    {
        ", and ": null
    },
    {
        "tensile strength": "ultimate tensile strength"
    },
    {
        " of the resulting steel. The increase in steels strength compared to pure iron is possible only by reducing irons ductility.     Steel was produced in ": null
    },
    {
        "bloomery": "bloomery"
    },
    {
        " furnaces for thousands of years, but its large-scale, industrial use began only after more efficient production methods were devised in the 17th century, with the introduction of the ": null
    },
    {
        "blast furnace": "blast furnace"
    },
    {
        " and production of ": null
    },
    {
        "crucible steel": "crucible steel"
    },
    {
        ". This was followed by the ": null
    },
    {
        "open-hearth furnace": "open-hearth furnace"
    },
    {
        " and then the ": null
    },
    {
        "Bessemer process": "bessemer process"
    },
    {
        " in ": null
    },
    {
        "England": "england"
    },
    {
        " in the mid-19th   century. With the invention of the Bessemer process, a new era of ": null
    },
    {
        "mass-produced": "mass production"
    },
    {
        " steel began. Mild steel replaced ": null
    },
    {
        "wrought iron": "wrought iron"
    },
    {
        ".     Further refinements in the process, such as ": null
    },
    {
        "basic oxygen steelmaking": "basic oxygen steelmaking"
    },
    {
        " , largely replaced earlier methods by further lowering the cost of production and increasing the quality of the final product. Today, steel is one of the most common manmade materials in the world, with more than 1.6 billion tons produced annually. Modern steel is generally identified by various grades defined by assorted ": null
    },
    {
        "standards organizations": "standards organizations"
    },
    {
        ".       The noun steel originates from the ": null
    },
    {
        "Proto-Germanic": "proto-germanic language"
    },
    {
        " adjective stahliją or stakhlijan , which is related to stahlaz or stahliją .      The carbon content of steel is between 0.002% and 2.14% by weight for plain ": null
    },
    {
        "iron": "iron"
    },
    {
        "–": null
    },
    {
        "carbon": "carbon"
    },
    {
        " alloy": "alloy"
    },
    {
        "s.  These values vary depending on ": null
    },
    {
        "alloying elements": "alloying elements"
    },
    {
        " such as ": null
    },
    {
        "manganese": "manganese"
    },
    {
        ", ": null
    },
    {
        "chromium": "chromium"
    },
    {
        ", ": null
    },
    {
        "nickel": "nickel"
    },
    {
        ", ": null
    },
    {
        "tungsten": "tungsten"
    },
    {
        ", and so on. In contrast, ": null
    },
    {
        "cast iron": "cast iron"
    },
    {
        " does undergo eutectic reaction. Too little carbon content leaves iron quite soft, ductile, and weak. Carbon contents higher than those of steel make a brittle alloy commonly called ": null
    },
    {
        "pig iron": "pig iron"
    },
    {
        ". While iron alloyed with carbon is called carbon steel, ": null
    },
    {
        "alloy steel": "alloy steel"
    },
    {
        " is steel to which other alloying elements have been intentionally added to modify the characteristics of steel. Common alloying elements include: manganese, nickel, chromium, ": null
    },
    {
        "molybdenum": "molybdenum"
    },
    {
        ", ": null
    },
    {
        "boron": "boron"
    },
    {
        ", ": null
    },
    {
        "titanium": "titanium"
    },
    {
        ", ": null
    },
    {
        "vanadium": "vanadium"
    },
    {
        ", tungsten, ": null
    },
    {
        "cobalt": "cobalt"
    },
    {
        ", and ": null
    },
    {
        "niobium": "niobium"
    },
    {
        ".  Additional elements, most frequently considered undesirable, are also important in steel: ": null
    },
    {
        "phosphorus": "phosphorus"
    },
    {
        ", ": null
    },
    {
        "sulfur": "sulfur"
    },
    {
        ", ": null
    },
    {
        "silicon": "silicon"
    },
    {
        ", and traces of ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        ", ": null
    },
    {
        "nitrogen": "nitrogen"
    },
    {
        ", and ": null
    },
    {
        "copper": "copper"
    },
    {
        ".     Plain carbon-iron alloys with a higher than 2.1% carbon content are known as ": null
    },
    {
        "cast iron": "cast iron"
    },
    {
        ". With modern ": null
    },
    {
        "steelmaking": "steelmaking"
    },
    {
        " techniques such as powder metal forming, it is possible to make very high-carbon steels, but such are not common. Cast iron is not malleable even when hot, but it can be formed by ": null
    },
    {
        "casting": "casting"
    },
    {
        " as it has a lower ": null
    },
    {
        "melting point": "melting point"
    },
    {
        " than steel and good ": null
    },
    {
        "castability": "castability"
    },
    {
        " properties. Certain compositions of cast iron, while retaining the economies of melting and casting, can be heat treated after casting to make ": null
    },
    {
        "malleable iron": "malleable iron"
    },
    {
        " or ": null
    },
    {
        "ductile iron": "ductile iron"
    },
    {
        " objects. Steel is distinguishable from ": null
    },
    {
        "wrought iron": "wrought iron"
    },
    {
        " , which may contain a small amount of carbon but large amounts of ": null
    },
    {
        "slag": "slag"
    },
    {
        ".            Iron is commonly found in the Earths ": null
    },
    {
        "crust": "crust"
    },
    {
        " in the form of an ": null
    },
    {
        "ore": "ore"
    },
    {
        ", usually an iron oxide, such as ": null
    },
    {
        "magnetite": "magnetite"
    },
    {
        " or ": null
    },
    {
        "hematite": "hematite"
    },
    {
        ". Iron is extracted from ": null
    },
    {
        "iron ore": "iron ore"
    },
    {
        " by removing the oxygen through its combination with a preferred chemical partner such as carbon which is then lost to the atmosphere as carbon dioxide. This process, known as ": null
    },
    {
        "smelting": "smelting"
    },
    {
        ", was first applied to metals with lower ": null
    },
    {
        "melting": "melting"
    },
    {
        " points, such as ": null
    },
    {
        "tin": "tin"
    },
    {
        ", which melts at about , and ": null
    },
    {
        "copper": "copper"
    },
    {
        ", which melts at about , and the combination, bronze, which has a melting point lower than . In comparison, cast iron melts at about .  Small quantities of iron were smelted in ancient times, in the solid state, by heating the ore in a ": null
    },
    {
        "charcoal": "charcoal"
    },
    {
        " fire and then welding the clumps together with a hammer and in the process squeezing out the impurities. With care, the carbon content could be controlled by moving it around in the fire. Unlike copper and tin, liquid or solid iron dissolves carbon quite readily.     All of these temperatures could be reached with ancient methods used since the ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        ". Since the oxidation rate of iron increases rapidly beyond , it is important that smelting take place in a low-oxygen environment. Smelting, using carbon to reduce iron oxides, results in an alloy  that retains too much carbon to be called steel. The excess carbon and other impurities are removed in a subsequent step.     Other materials are often added to the iron/carbon mixture to produce steel with desired properties. ": null
    },
    {
        "Nickel": "nickel"
    },
    {
        " and ": null
    },
    {
        "manganese": "manganese"
    },
    {
        " in steel add to its tensile strength and make the ": null
    },
    {
        "austenite": "austenite"
    },
    {
        " form of the iron-carbon solution more stable, ": null
    },
    {
        "chromium": "chromium"
    },
    {
        " increases hardness and melting temperature, and ": null
    },
    {
        "vanadium": "vanadium"
    },
    {
        " also increases hardness while making it less prone to ": null
    },
    {
        "metal fatigue": "metal fatigue"
    },
    {
        ".      To inhibit corrosion, at least 11% chromium is added to steel so that a hard ": null
    },
    {
        "oxide": "passivation"
    },
    {
        " forms on the metal surface; this is known as ": null
    },
    {
        "stainless steel": "stainless steel"
    },
    {
        ". Tungsten slows the formation of ": null
    },
    {
        "cementite": "cementite"
    },
    {
        ", keeping carbon in the iron matrix and allowing ": null
    },
    {
        "martensite": "martensite"
    },
    {
        " to preferentially form at slower quench rates, resulting in ": null
    },
    {
        "high speed steel": "high speed steel"
    },
    {
        ". On the other hand, sulfur, ": null
    },
    {
        "nitrogen": "nitrogen"
    },
    {
        ", and ": null
    },
    {
        "phosphorus": "phosphorus"
    },
    {
        " are considered contaminants that make steel more brittle and are removed from the steel melt during processing.     The ": null
    },
    {
        "density": "density"
    },
    {
        " of steel varies based on the alloying constituents but usually ranges between , or .      Even in a narrow range of concentrations of mixtures of carbon and iron that make a steel, a number of different metallurgical structures, with very different properties can form. Understanding such properties is essential to making quality steel. At ": null
    },
    {
        "room temperature": "room temperature"
    },
    {
        ", the most stable form of pure iron is the ": null
    },
    {
        "body-centered cubic": "body-centered cubic"
    },
    {
        " structure called alpha iron or α-iron. It is a fairly soft metal that can dissolve only a small concentration of carbon, no more than 0.005% at  and 0.021 wt% at . The inclusion of carbon in alpha iron is called ": null
    },
    {
        "ferrite": "allotropes of iron"
    },
    {
        ". At 910  °C, pure iron transforms into a ": null
    },
    {
        "face-centered cubic": "face-centered cubic"
    },
    {
        " structure, called gamma iron or γ-iron. The inclusion of carbon in gamma iron is called austenite. The more open FCC structure of austenite can dissolve considerably more carbon, as much as 2.1% Sources differ on this value so it has been rounded to 2.1%, however the exact value is rather academic because plain-carbon steel is very rarely made with this level of carbon. See:   —2.08%.   —2.11%.   —2.14%. carbon at , which reflects the upper carbon content of steel, beyond which is cast iron. . When carbon moves out of solution with iron, it forms a very hard, but brittle material called cementite .     When steels with exactly 0.8% carbon , are cooled, the ": null
    },
    {
        "austenitic": "austenitic"
    },
    {
        " phase of the mixture attempts to revert to the ferrite phase . The carbon no longer fits within the FCC austenite structure, resulting in an excess of carbon. One way for carbon to leave the austenite is for it to ": null
    },
    {
        "precipitate": "precipitate"
    },
    {
        " out of solution as ": null
    },
    {
        "cementite": "cementite"
    },
    {
        ", leaving behind a surrounding phase of BCC iron called ferrite with a small percentage of carbon in solution. The two, ferrite and cementite, precipitate simultaneously producing a layered structure called ": null
    },
    {
        "pearlite": "pearlite"
    },
    {
        ", named for its resemblance to ": null
    },
    {
        "mother of pearl": "mother of pearl"
    },
    {
        ". In a hypereutectoid composition , the carbon will first precipitate out as large inclusions of cementite at the austenite ": null
    },
    {
        "grain boundaries": "grain boundaries"
    },
    {
        " until the percentage of carbon in the ": null
    },
    {
        "grains": "grain"
    },
    {
        " has decreased to the eutectoid composition , at which point the pearlite structure forms. For steels that have less than 0.8% carbon , ferrite will first form within the grains until the remaining composition rises to 0.8% of carbon, at which point the pearlite structure will form. No large inclusions of cementite will form at the boundaries in hypoeuctoid steel. . The above assumes that the cooling process is very slow, allowing enough time for the carbon to migrate.     As the rate of cooling is increased the carbon will have less time to migrate to form carbide at the grain boundaries but will have increasingly large amounts of pearlite of a finer and finer structure within the grains; hence the carbide is more widely dispersed and acts to prevent slip of defects within those grains, resulting in hardening of the steel. At the very high cooling rates produced by quenching, the carbon has no time to migrate but is locked within the face-centered austenite and forms ": null
    },
    {
        "martensite": "martensite"
    },
    {
        ". Martensite is a highly strained and stressed, supersaturated form of carbon and iron and is exceedingly hard but brittle. Depending on the carbon content, the martensitic phase takes different forms. Below 0.2% carbon, it takes on a ferrite BCC crystal form, but at higher carbon content it takes a ": null
    },
    {
        "body-centered tetragonal": "body-centered tetragonal"
    },
    {
        " structure. There is no thermal ": null
    },
    {
        "activation energy": "activation energy"
    },
    {
        " for the transformation from austenite to martensite. Moreover, there is no compositional change so the atoms generally retain their same neighbors. .     Martensite has a lower density than does austenite, so that the transformation between them results in a change of volume. In this case, expansion occurs. Internal stresses from this expansion generally take the form of ": null
    },
    {
        "compression": "physical compression"
    },
    {
        " on the crystals of martensite and ": null
    },
    {
        "tension": "tension"
    },
    {
        " on the remaining ferrite, with a fair amount of ": null
    },
    {
        "shear": "shear stress"
    },
    {
        " on both constituents. If quenching is done improperly, the internal stresses can cause a part to shatter as it cools. At the very least, they cause internal ": null
    },
    {
        "work hardening": "work hardening"
    },
    {
        " and other microscopic imperfections. It is common for quench cracks to form when steel is water quenched, although they may not always be visible.             There are many types of ": null
    },
    {
        "heat treating": "heat treatment"
    },
    {
        " processes available to steel. The most common are ": null
    },
    {
        "annealing": "annealing"
    },
    {
        ", ": null
    },
    {
        "quenching": "quenching"
    },
    {
        ", and ": null
    },
    {
        "tempering": "tempering"
    },
    {
        ". Heat treatment is effective on compositions above the eutectoid composition of 0.8% carbon. Hypoeutectoid steel does not benefit from heat treatment.     Annealing is the process of heating the steel to a sufficiently high temperature to relieve local internal stresses. It does not create a general softening of the product but only locally relieves strains and stresses locked up within the material. Annealing goes through three phases: ": null
    },
    {
        "recovery": "recovery"
    },
    {
        ", ": null
    },
    {
        "recrystallization": "recrystallization"
    },
    {
        ", and ": null
    },
    {
        "grain growth": "grain growth"
    },
    {
        ". The temperature required to anneal a particular steel depends on the type of annealing to be achieved and the alloying constituents. .     Quenching involves heating the steel to create the austenite phase then quenching it in water or ": null
    },
    {
        "oil": "oil"
    },
    {
        ". This rapid cooling results in a hard but brittle martensitic structure. The steel is then tempered, which is just a specialized type of annealing, to reduce brittleness. In this application the annealing process transforms some of the martensite into cementite, or ": null
    },
    {
        "spheroidite": "spheroidite"
    },
    {
        " and hence it reduces the internal stresses and defects. The result is a more ductile and fracture-resistant steel. .                  When iron is smelted from its ore, it contains more carbon than is desirable. To become steel, it must be reprocessed to reduce the carbon to the correct amount, at which point other elements can be added. In the past, steel facilities would cast the raw steel product into ingots which would be stored until use in further refinement processes that resulted in the finished product. In modern facilities, the initial product is close to the final composition and is ": null
    },
    {
        "continuously cast": "continuous casting"
    },
    {
        " into long slabs, cut and shaped into bars and extrusions and heat treated to produce a final product. Today only a small fraction is ": null
    },
    {
        "cast": "casting"
    },
    {
        " into ": null
    },
    {
        "ingot": "ingot"
    },
    {
        "s. Approximately 96% of steel is continuously cast, while only 4% is produced as ingots.      The ingots are then heated in a soaking pit and ": null
    },
    {
        "hot rolled": "hot rolling"
    },
    {
        " into slabs, ": null
    },
    {
        "billets": "billet billet"
    },
    {
        ", or ": null
    },
    {
        "blooms": "billet bloom"
    },
    {
        ". Slabs are hot or ": null
    },
    {
        "cold rolled": "cold rolling"
    },
    {
        " into ": null
    },
    {
        "sheet metal": "sheet metal"
    },
    {
        " or plates. Billets are hot or cold rolled into bars, rods, and wire. Blooms are hot or cold rolled into ": null
    },
    {
        "structural steel": "structural steel"
    },
    {
        ", such as ": null
    },
    {
        "I-beams": "i-beam"
    },
    {
        "and ": null
    },
    {
        "rails": "rail tracks"
    },
    {
        ". In modern steel mills these processes often occur in one ": null
    },
    {
        "assembly line": "assembly line"
    },
    {
        ", with ore coming in and finished steel products coming out. . Sometimes after a steels final rolling, it is heat treated for strength; however, this is relatively rare.                    Steel was known in antiquity and was produced in ": null
    },
    {
        "bloomeries": "bloomery"
    },
    {
        " and crucibles. Davidson, Hilda Ellis . The Sword in Anglo-Saxon England: Its Archaeology and Literature. Boydell & Brewer Ltd. p. 20. .      The earliest known production of steel is seen in pieces of ironware excavated from an ": null
    },
    {
        "archaeological site": "archaeological site"
    },
    {
        " in ": null
    },
    {
        "Anatolia": "anatolia"
    },
    {
        "  and are nearly 4,000 years old, dating from 1800 BC.   ": null
    },
    {
        "Horace": "horace"
    },
    {
        " identifies steel weapons such as the  falcata  in the ": null
    },
    {
        "Iberian Peninsula": "iberian peninsula"
    },
    {
        ", while ": null
    },
    {
        "Noric steel": "noric steel"
    },
    {
        " was used by the ": null
    },
    {
        "Roman military": "military of ancient rome"
    },
    {
        ". Noricus ensis , ": null
    },
    {
        "Horace": "horace"
    },
    {
        ", Odes, i. 16.9     The reputation of Seric iron of South India grew considerably in the rest of the world. Metal production sites in ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        " employed wind furnaces driven by the monsoon winds, capable of producing high-carbon steel. Large-scale ": null
    },
    {
        "Wootz steel": "wootz steel"
    },
    {
        " production in ": null
    },
    {
        "Tamilakam": "tamilakam"
    },
    {
        " using crucibles and carbon sources such as the plant ": null
    },
    {
        "Avāram": "senna auriculata"
    },
    {
        " occurred by the sixth century BC, the pioneering precursor to modern steel production and metallurgy.     The ": null
    },
    {
        "Chinese": "history of chinaancient china"
    },
    {
        " of the ": null
    },
    {
        "Warring States period": "warring states period"
    },
    {
        " had ": null
    },
    {
        "quench-hardened": "quench"
    },
    {
        " steel,  while Chinese of the ": null
    },
    {
        "Han dynasty": "han dynasty"
    },
    {
        " created steel by melting together wrought iron with cast iron, gaining an ultimate product of a carbon-intermediate steel by the 1st century AD.  Gernet, Jacques . A History of Chinese Civilization. Cambridge: Cambridge University Press. p. 69. .     There is evidence that ": null
    },
    {
        "carbon steel": "carbon steel"
    },
    {
        " was made in Western Tanzania by the ancestors of the ": null
    },
    {
        "Haya people": "haya people"
    },
    {
        " as early as 2,000 years ago by a complex process of pre-heating allowing temperatures inside a furnace to reach 1300 to 1400° C.                  Evidence of the earliest production of high carbon steel in ": null
    },
    {
        "India": "india"
    },
    {
        " are found in ": null
    },
    {
        "Kodumanal": "kodumanal"
    },
    {
        " in ": null
    },
    {
        "Tamil Nadu": "tamil nadu"
    },
    {
        ", the ": null
    },
    {
        "Golconda": "golconda"
    },
    {
        " area in ": null
    },
    {
        "Andhra Pradesh": "andhra pradesh"
    },
    {
        " and ": null
    },
    {
        "Karnataka": "karnataka"
    },
    {
        ", and in the ": null
    },
    {
        "Samanalawewa": "samanalawewa"
    },
    {
        " areas of ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        ".  This came to be known as ": null
    },
    {
        "Wootz steel": "wootz steel"
    },
    {
        ", produced in South India by about sixth century BC and exported globally.   The steel technology existed prior to 326 BC in the region as they are mentioned in literature of ": null
    },
    {
        "Sangam Tamil": "sangam literature"
    },
    {
        ", Arabic and Latin as the finest steel in the world exported to the Romans, Egyptian, Chinese and Arab worlds at that time – what they called Seric Iron.  A ": null
    },
    {
        "200 BC Tamil trade guild in Tissamaharama": "tissamaharama tamil brahmi inscription"
    },
    {
        ", in the South East of Sri Lanka, brought with them some of the oldest iron and steel artifacts and production processes to the island from the ": null
    },
    {
        "classical period": "classical antiquity"
    },
    {
        ". Hobbies – Volume 68, Issue 5 – p. 45. Lightner Publishing Company   The Chinese and locals in ": null
    },
    {
        "Anuradhapura": "anuradhapura"
    },
    {
        ", Sri Lanka had also adopted the production methods of creating Wootz steel from the ": null
    },
    {
        "Chera Dynasty": "chera dynasty"
    },
    {
        " Tamils of South India by the 5th century AD.   In Sri Lanka, this early steel-making method employed a unique wind furnace, driven by the monsoon winds, capable of producing high-carbon steel.  Coghlan, Herbert Henery. . Notes on prehistoric and early iron in the Old World. Oxprint. pp. 99–100 Since the technology was acquired from the ": null
    },
    {
        "Tamilians": "tamilians"
    },
    {
        " from South India, the origin of steel technology in India can be conservatively estimated at 400–500 BC.     The manufacture of what came to be called Wootz, or ": null
    },
    {
        "Damascus steel": "damascus steel"
    },
    {
        ", famous for its durability and ability to hold an edge, may have been taken by the Arabs from Persia, who took it from India. It was originally created from a number of different materials including various ": null
    },
    {
        "trace element": "trace element"
    },
    {
        "s, apparently ultimately from the writings of ": null
    },
    {
        "Zosimos of Panopolis": "zosimos of panopolis"
    },
    {
        ". In 327 BC, ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        " was rewarded by the defeated King ": null
    },
    {
        "Porus": "porus"
    },
    {
        ", not with gold or silver but with 30 pounds of steel.  Recent studies have suggested that ": null
    },
    {
        "carbon nanotubes": "carbon nanotubes"
    },
    {
        " were included in its structure, which might explain some of its legendary qualities, though given the technology of that time, such qualities were produced by chance rather than by design.  Natural wind was used where the soil containing iron was heated by the use of wood. The ": null
    },
    {
        "ancient Sinhalese": "ancient sinhalese"
    },
    {
        " managed to extract a ton of steel for every 2 tons of soil, a remarkable feat at the time. One such furnace was found in Samanalawewa and archaeologists were able to produce steel as the ancients did.      ": null
    },
    {
        "Crucible steel": "crucible steel"
    },
    {
        ", formed by slowly heating and cooling pure iron and carbon in a crucible, was produced in ": null
    },
    {
        "Merv": "merv"
    },
    {
        " by the 9th to 10th century AD. In the 11th century, there is evidence of the production of steel in ": null
    },
    {
        "Song China": "song dynasty"
    },
    {
        " using two techniques: a berganesque method that produced inferior, inhomogeneous steel, and a precursor to the modern ": null
    },
    {
        "Bessemer process": "bessemer process"
    },
    {
        " that used partial decarbonization via repeated forging under a ": null
    },
    {
        "cold blast": "cold blast"
    },
    {
        ".           Since the 17th century, the first step in European steel production has been the smelting of iron ore into ": null
    },
    {
        "pig iron": "pig iron"
    },
    {
        " in a ": null
    },
    {
        "blast furnace": "blast furnace"
    },
    {
        ". Tylecote, R.F. A history of metallurgy 2nd ed., Institute of Materials, London. pp. 95–99 and 102–105. . Originally employing charcoal, modern methods use ": null
    },
    {
        "coke": "coke"
    },
    {
        ", which has proven more economical. Raistrick, A. A Dynasty of Ironfounders. Hyde, C.K. Technological Change and the British iron industry. Princeton Trinder, B. The Industrial Revolution in Shropshire. Chichester.            In these processes pig iron was refined in a ": null
    },
    {
        "finery forge": "finery forge"
    },
    {
        " to produce ": null
    },
    {
        "bar iron": "bar iron"
    },
    {
        ", which was then used in steel-making.     The production of steel by the ": null
    },
    {
        "cementation process": "cementation process"
    },
    {
        " was described in a treatise published in Prague in 1574 and was in use in ": null
    },
    {
        "Nuremberg": "nuremberg"
    },
    {
        " from 1601. A similar process for ": null
    },
    {
        "case hardening": "case hardening"
    },
    {
        " armor and files was described in a book published in ": null
    },
    {
        "Naples": "naples"
    },
    {
        " in 1589. The process was introduced to England in about 1614 and used to produce such steel by Sir ": null
    },
    {
        "Basil Brooke": "basil brooke"
    },
    {
        " at ": null
    },
    {
        "Coalbrookdale": "coalbrookdale"
    },
    {
        " during the 1610s. Barraclough, K.C. Steel before Bessemer: I Blister Steel: the birth of an industry. The Metals Society, London. pp. 48–52.     The raw material for this process were bars of iron. During the 17th century it was realized that the best steel came from ": null
    },
    {
        "oregrounds iron": "oregrounds iron"
    },
    {
        " of a region north of ": null
    },
    {
        "Stockholm": "stockholm"
    },
    {
        ", Sweden. This was still the usual raw material source in the 19th century, almost as long as the process was used.       Crucible steel is steel that has been melted in a ": null
    },
    {
        "crucible": "crucible"
    },
    {
        " rather than having been ": null
    },
    {
        "forged": "forging"
    },
    {
        ", with the result that it is more homogeneous. Most previous furnaces could not reach high enough temperatures to melt the steel. The early modern crucible steel industry resulted from the invention of ": null
    },
    {
        "Benjamin Huntsman": "benjamin huntsman"
    },
    {
        " in the 1740s. Blister steel was melted in a crucible or in a furnace, and cast into ingots. Barraclough, K.C. Steel before Bessemer: II Crucible Steel: the growth of technology. The Metals Society, London.               The modern era in ": null
    },
    {
        "steelmaking": "steelmaking"
    },
    {
        " began with the introduction of ": null
    },
    {
        "Henry Bessemers": "henry bessemer"
    },
    {
        " Bessemer process": "bessemer process"
    },
    {
        " in 1855, the raw material for which was pig iron.  His method let him produce steel in large quantities cheaply, thus ": null
    },
    {
        "mild steel": "mild steel"
    },
    {
        " came to be used for most purposes for which wrought iron was formerly used.  The Gilchrist-Thomas process  was an improvement to the Bessemer process, made by lining the converter with a ": null
    },
    {
        "basic": "basic"
    },
    {
        " material to remove phosphorus.     Another 19th-century steelmaking process was the ": null
    },
    {
        "Siemens-Martin process": "siemens-martin process"
    },
    {
        ", which complemented the Bessemer process. It consisted of co-melting bar iron with pig iron.     These methods of steel production were rendered obsolete by the Linz-Donawitz process of ": null
    },
    {
        "basic oxygen steelmaking": "basic oxygen steelmaking"
    },
    {
        " , developed in 1952,  and other oxygen steel making methods. Basic oxygen steelmaking is superior to previous steelmaking methods because the oxygen pumped into the furnace limited impurities, primarily nitrogen, that previously had entered from the air used,  and because, with respect to the open hearth process, the same quantity of steel from a BOS process is manufactured in one-twelfth the time. Today, ": null
    },
    {
        "electric arc furnaces": "electric arc furnace"
    },
    {
        " are a common method of reprocessing ": null
    },
    {
        "scrap metal": "scrap"
    },
    {
        " to create new steel. They can also be used for converting pig iron to steel, but they use a lot of electrical energy , and are thus generally only economical when there is a plentiful supply of cheap electricity. Jones, J.A.T. ; Bowman, B. and Lefrank, P.A. Electric Furnace Steelmaking , in The Making, Shaping and Treating of Steel, pp. 525–660. R.J. Fruehan . The AISE Steel Foundation: Pittsburgh. .             The steel industry is often considered an indicator of economic progress, because of the critical role played by steel in infrastructural and overall ": null
    },
    {
        "economic development": "economic development"
    },
    {
        ".  In 1980, there were more than 500,000 U.S. steelworkers. By 2000, the number of steelworkers fell to 224,000. https://books.google.com/books?idiOgfSDKecCcC & pgPA4557 & dq & hlenvonepage & q & ffalse Congressional Record V. 148, Pt. 4, April 11, 2002 to April 24, 2002 . ": null
    },
    {
        "United States Government Printing Office": "united states government printing office"
    },
    {
        ".     The ": null
    },
    {
        "economic boom": "boom and bust"
    },
    {
        " in China and India caused a massive increase in the demand for steel. Between 2000 and 2005, world steel demand increased by 6%. Since 2000, several Indian  and Chinese steel firms have risen to prominence, such as ": null
    },
    {
        "Tata Steel": "tata steel"
    },
    {
        " , ": null
    },
    {
        "Baosteel Group": "baosteel group"
    },
    {
        " and ": null
    },
    {
        "Shagang Group": "shagang group"
    },
    {
        ". As of 2017, though, ": null
    },
    {
        "ArcelorMittal": "arcelormittal"
    },
    {
        " is the worlds ": null
    },
    {
        "largest steel producer": "list of steel producers"
    },
    {
        ".  In 2005, the ": null
    },
    {
        "British Geological Survey": "british geological survey"
    },
    {
        " stated China was the top steel producer with about one-third of the world share; Japan, Russia, and the US followed respectively.      In 2008, steel began ": null
    },
    {
        "trading as a commodity": "commodity market"
    },
    {
        " on the ": null
    },
    {
        "London Metal Exchange": "london metal exchange"
    },
    {
        ". At the end of 2008, the steel industry faced a sharp downturn that led to many cut-backs.           Steel is one of the worlds most-recycled materials, with a recycling rate of over 60% globally;  in the United States alone, over  were recycled in the year 2008, for an overall recycling rate of 83%.      As more steel is produced than is scrapped, the amount of recycled raw materials is about 40% of the total of steel produced - in 2016,  of crude steel was produced globally, with  recycled.                  Modern steels are made with varying combinations of alloy metals to fulfill many purposes. ": null
    },
    {
        "Carbon steel": "carbon steel"
    },
    {
        ", composed simply of iron and carbon, accounts for 90% of steel production. ": null
    },
    {
        "Low alloy steel": "low alloy steel"
    },
    {
        " is alloyed with other elements, usually ": null
    },
    {
        "molybdenum": "molybdenum"
    },
    {
        ", manganese, chromium, or nickel, in amounts of up to 10% by weight to improve the hardenability of thick sections. ": null
    },
    {
        "High strength low alloy steel": "hsla steel"
    },
    {
        " has small additions         ": null
    }
]