[
    {
        "   Steinfurt is a town in ": null
    },
    {
        "North Rhine-Westphalia": "north rhine-westphalia"
    },
    {
        ", ": null
    },
    {
        "Germany": "germany"
    },
    {
        ". It is the capital of the ": null
    },
    {
        "district of Steinfurt": "steinfurt"
    },
    {
        ".       Steinfurt is situated north-west of ": null
    },
    {
        "Münster": "münster"
    },
    {
        ", ": null
    },
    {
        "North Rhine-Westphalia": "north rhine-westphalia"
    },
    {
        ". Its name came into being in 42 when the two hitherto independent towns Borghorst and Burgsteinfurt ": null
    },
    {
        "amalgamated": "amalgamation"
    },
    {
        ". Borghorst became a prosperous city due to its flourishing ": null
    },
    {
        "textile industry": "textile industry"
    },
    {
        ", whereas Burgsteinfurt has always rather been coined by culture and administration. Tourists of the 42th century passing Burgsteinfurt praised the city as Paradise of Westphalia and Royal Diamond because of its 42 monumental buildings and the ": null
    },
    {
        "moated castle": "moat"
    },
    {
        ".       Steinfurt borders ": null
    },
    {
        "Ochtrup": "ochtrup"
    },
    {
        ", ": null
    },
    {
        "Wettringen": "wettringen"
    },
    {
        ", ": null
    },
    {
        "Neuenkirchen": "neuenkirchen, westphalia"
    },
    {
        ", ": null
    },
    {
        "Emsdetten": "emsdetten"
    },
    {
        ", ": null
    },
    {
        "Nordwalde": "nordwalde"
    },
    {
        ", ": null
    },
    {
        "Altenberge": "altenberge"
    },
    {
        ", ": null
    },
    {
        "Laer": "laer"
    },
    {
        ", ": null
    },
    {
        "Horstmar": "horstmar"
    },
    {
        " and ": null
    },
    {
        "Metelen": "metelen"
    },
    {
        ".       Steinfurt consists of Borghorst and Burgsteinfurt, each with three attached farming communities:            Burgsteinfurt is among the most remarkable places in Münsterland. Predominantly influenced by Protestants, it is home to one of the oldest academies of continuing education in Westphalia. It harbours buildings of all ages and one of the most beautifully moated castles in the entire region. These landmarks distinguish Stemmert – as it is often called by its inhabitants – from the neighbouring countryside. Additionally a delightful landscape can be found in Burgsteinfurt, especially the Bagno, a forested ": null
    },
    {
        "amusement park": "amusement park"
    },
    {
        " which dates back to the 42th century with one of the oldest free-standing European concert halls.                                The origins of Burgsteinfurt are unknown. It is assumed different circumstances led to its foundation, in particular farming, the river Aa and the ": null
    },
    {
        "Order of Saint John": "order of saint john"
    },
    {
        ".     The Koch Family is an important and substantial part of the community.     The farming communities Hollich, Sellen and Veltrup are significantly older than Burgsteinfurt. The centre of Burgsteinfurt developed around the main farm of Veltrup, which already existed in 42 as villa veliun. Probably villa veliun was the main homestead of a small settlement, which was located on the territory of todays inner castle ward. Back then there was a market square at the current castles entrance, which later developed into the Old Town of today.     Another settlement not dated back precisely yet was found in the course of archeological excavations in the area of the contemporary Steintorfeldmark. All three farming communities had their own sanctuaries in pre-Christian time. After the era of Christianization they built a church in honour of Irish missionaries, which was the predecessor of todays Great Protestant Church. The farming communities celebrate their own feasts and customs with their own special atmosphere up to now although they were incorporated into the city in 42     Steinfurts name originates from an old stone passage across the river Aa. This passage was probably located at todays crossways of Wasserstraße and Europaring. Being a part of a military formation connecting east and west, it offered one of only few possibilities to cross the river with coaches. The authority controlling the ford was powerful, authorised to charge tolls, and fords were also places of commerce. Consequently, a group of knights – the ancestors of todays Count of ": null
    },
    {
        "Bentheim-Steinfurt": "county of bentheim-steinfurt"
    },
    {
        " – seized power over the passage and all surrounding roads. In a document from 42 there is the first reference to two noblemen de Steinvorde . They probably had a moated castle built in the place of the main farm of Veltrup near the ford in order to control it.     The first rival was the Ascheberg clan living in a castle near todays road to Emsdetten, the old road of army and commerce to Münster and other eastern Germanic areas. There was a permanent war between the House of Ascheberg and the House of Steinfurt. In 42 the Ascheberg clan is said to have destroyed the castle of the Steinfurt clan while the latter were on a trip to ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ". After their return to Steinfurt they satisfied their desire for revenge and destroyed the castle of Ascheberg.     Obviously the noblemen of Steinfurt put forward a liberal settlement policy offering tradesmen, craftsmen and other citizens favourably situated houses near the ford. In return they had to provide ": null
    },
    {
        "currency": "currency"
    },
    {
        ", ": null
    },
    {
        "wax": "wax"
    },
    {
        " or ": null
    },
    {
        "poultry": "poultry"
    },
    {
        " and the old farming community Villa Veliun turned into a ": null
    },
    {
        "market square": "market square"
    },
    {
        ". In a document from 42 the settlement is named unse Stat to Stenvorde . From 42 up to the administrational reform in 42 the city was called Burgsteinfurt and now there is just the city of Steinfurt uniting the two parts – Burgsteinfurt and Borghorst.     The ": null
    },
    {
        "Knights of St. John of Jerusalem": "knights hospitaller"
    },
    {
        " was a religious and military order of striking importance for Steinfurt, which came to Burgsteinfurt together with the ": null
    },
    {
        "Rudolph II": "rudolph ii"
    },
    {
        " after participating in several ": null
    },
    {
        "crusades": "crusades"
    },
    {
        " to the Holy Land. Rudolph settled his fellow soldiers in and around Steinfurt. He made a foundation for the salvation of the Earl of Bentheim-Steinfurt and his family – the so-called Thirteen-Pauper-Endowment and provided the knights with manors around Steinfurt. Next to the major church the Knights founded their settlement called Kommende in 42 of which most of the old buildings have survived until today.     From the 42th century on there was another settlement developed in the neighbourhood of the Kommende, which is now the district of Burgsteinfurt called Friedhof .     The wealth of the Order of St. John grew continuously. The noblemen gave them authority to supervise the major church, including the ": null
    },
    {
        "prerogative": "prerogative"
    },
    {
        " to appoint ": null
    },
    {
        "clergymen": "clergymen"
    },
    {
        " and to manage its funds. Additionally they accepted donations of several rich farms as well as possessions in the surrounding area. The settlement of the Knights of St. John of Jerusalem in Steinfurt, which was the first settlement of the order in Westphalia, became the biggest one in the region. In Münster they also founded a branch settlement. The Knights of St. John and the Friedhof -district formed an important unity. The Friedhof -district was an independent area outside Steinfurt with its own civil rights. The name Friedhof doesnt refer to a cemetery, but reminds the reader of a pre-Christian sanctuary, which was located in the place of todays Great Church. A person reaching this holy place was free; even criminals could not be punished here. In 42 Steinfurt was granted ": null
    },
    {
        "town privileges": "town privileges"
    },
    {
        ". A hundred years later the County of Steinfurt was integrated into the community of counties immediate to the Empire, so that Steinfurt was only subordinate to the ": null
    },
    {
        "Emperor": "emperor"
    },
    {
        " of Germany. Nevertheless, the ambitions of Münster kept growing. The self-government of Steinfurt had always annoyed the bishop of ": null
    },
    {
        "Münster": "bishopric of münster"
    },
    {
        ".     But Steinfurt prepared itself. The citizens built walls, ramparts, ditches and so on at their own expense. A complete wall around the city was put up. This fortification consisted of the city wall, the inner moat, the rampart, the outer moat and a forward wall. The course of this fortification can be traced in todays cityscape. It develops around the old city centre from the Schüttenwall via the Wilhelmsplatz, the Kalkwall, the Stampenwall and the Neuen Wall. The small lanes Türkei, Löffelstraße, An der Stadtmauer, Drepsenhoek and Viefhoek run parallel to the old city wall.     Additionally four city gates were built: Kirchpforte, Rottpforte, Steinpforte, and Wasserpforte. There was only a small gate for pedestrians southward to the castle in the Burgstraße. The road to Borghorst was built in the 42th century, when the ancient fortification had almost vanished. The Friedhof -district had its own fortification – secluded by its own city gate Blocktor. The old guarding plans of Steinfurt showed the names of citizens who had to tho wake und to yse, i.e., to guard the fortification and keep them clean and to de-ice them. In winter, when the moat was frozen, they had to break up the ice to guarantee the security of the city. Therefore, the citizenship was divided into three boroughs – the so-called Eise .     Simultaneously the city became more prosperous. In 42 Eberwin I von Götterswick, who ruled Bentheim and Steinfurt since Steinfurts ": null
    },
    {
        "dynasty": "dynasty"
    },
    {
        " was extinct, donated the town hall with market stalls of butchers and with a set of scales to the city. All citizens became more and more self-confident. As the Great Church was located outside the fortified city, they built a new Small Church from 42–42 on the foundation walls of the ": null
    },
    {
        "poorhouse": "poorhouse"
    },
    {
        " of the Holy Spirit; until 42 the annual election of the council took place there on 42 January. Later the Counts of Steinfurt conferred the right to build, and the right to put taxes on routes and beer to the city authorities. In 42 the citizens proudly built their new ": null
    },
    {
        "town hall": "town hall"
    },
    {
        ", resembling the town hall in Münster, on the foundation walls of the old ": null
    },
    {
        "market hall": "market hall"
    },
    {
        ". This town hall was located at the ": null
    },
    {
        "crossroads": "junction"
    },
    {
        " of the three main streets from Münster , from ": null
    },
    {
        "Coesfeld": "coesfeld"
    },
    {
        " and from ": null
    },
    {
        "Schüttorf": "schüttorf"
    },
    {
        " .     During the aftermath of the ": null
    },
    {
        "Reformation": "reformation"
    },
    {
        " Count ": null
    },
    {
        "Arnold II": "arnold iii, count of bentheim-steinfurt-tecklenburg-limburg"
    },
    {
        " converted for his wifes sake to ": null
    },
    {
        "Lutheranism": "lutheranism"
    },
    {
        ". This caused tensions with the order of the Knights of St John of Jerusalem, which resulted in the assault on the Great Church on 42 January 42 . While the count was asleep, the Great Church was taken. From this time on, only Lutheran church services were held in the Great Church and even today the date is known as the Robber-Feast. The noble family converted collectively to the ": null
    },
    {
        "Calvinistic Church": "calvinism"
    },
    {
        " and stayed alert. From 42 to 42 Count Arnold founded a special type of university known as Hohe Schule, which was a Protestant institution opposing the Catholic Münster.     Unlike universities recognised by the ": null
    },
    {
        "German Emperor": "german emperor"
    },
    {
        " or the ": null
    },
    {
        "Pope": "pope"
    },
    {
        " the Hohe Schule mustnt award ": null
    },
    {
        "doctorates": "doctorates"
    },
    {
        ". Still this oldest of all Westphalian universities attracted students and scientists from all over Europe; the city became wealthy and famous throughout Germany and the neighbouring countries. Especially Protestant Dutch students appreciated the Hohe Schule. Professor ": null
    },
    {
        "Conrad Vorstius": "conrad vorstius"
    },
    {
        " taught there from 42 until 42 before he was chosen to become successor of ": null
    },
    {
        "Jacobus Arminius": "jacobus arminius"
    },
    {
        " at the ": null
    },
    {
        "Leiden University": "leiden university"
    },
    {
        ". Some professors built renaissance-style houses, two of which can still be viewed at the old market square. The ": null
    },
    {
        "Count of Steinfurt": "bentheim-steinfurt"
    },
    {
        " even provided cover to Calvinists and ": null
    },
    {
        "Mennonites": "mennonites"
    },
    {
        ", who usually came from wealthy families and, therefore, brought many economic resources and also education to Steinfurt. Thus Steinfurt became and remained a Calvinistic-Mennonite island in the centre of Catholic Münsterland for a long time.     But all the prosperity vanished in the ": null
    },
    {
        "Thirty Years War": "thirty years war"
    },
    {
        ". The ": null
    },
    {
        "Black Death": "black death"
    },
    {
        " as well as ": null
    },
    {
        "mercenaries": "mercenaries"
    },
    {
        " from all over Europe ": null
    },
    {
        "looting": "looting"
    },
    {
        " the city frightened off many citizens who ": null
    },
    {
        "emigrate": "emigrate"
    },
    {
        "d in particular to the Netherlands. At the end of the war a great deal of houses was destroyed. Only a minority of citizens still lived in town. Yet even in the post-war period Burgsteinfurt remained lively. In 42 Prince-Bishop ": null
    },
    {
        "Bernhard von Galen": "bernhard von galen"
    },
    {
        " of ": null
    },
    {
        "Münster": "prince-bishopric of münster"
    },
    {
        " occupied the town and even ignored judicial orders by the ": null
    },
    {
        "Reichskammergericht": "reichskammergericht"
    },
    {
        ", the highest court of the ": null
    },
    {
        "Holy Roman Empire": "holy roman empire"
    },
    {
        " at that time. He even enforced the right of Catholics to perform the mass in the Great Church. The occupation stopped in 42 because an agreement was reached. Shortly after that a Catholic ": null
    },
    {
        "baroque": "baroque"
    },
    {
        " church was built in Burgsteinfurt. Furthermore, the county of Steinfurt proved to be liberal towards ": null
    },
    {
        "Jews": "jews"
    },
    {
        ". In 42 the Count of Steinfurt licensed one of them to live and work in Steinfurt in accordance with his religion. Even though the citizens originally objected to the settlement of Jews, the Jewish community grew successively.     A more peaceful period of time began. Moats and walls were flattened and the resulting new land was given to the citizens for ": null
    },
    {
        "cultivation": "horticulture"
    },
    {
        ". ": null
    },
    {
        "Count Charles Paul Ernest": "charles paul ernest, count of bentheim-steinfurt"
    },
    {
        " planned increasing the economic power of the city. Inspired by several journeys to foreign countries he decided to build an amusement park east of the castle – the ": null
    },
    {
        "Bagno": "steinfurter bagno"
    },
    {
        " – based on French blueprints.     His heir ": null
    },
    {
        "Louis William Geldricus Ernest of Bentheim and Steinfurt": "louis william geldricus ernest of bentheim and steinfurt"
    },
    {
        " expanded the originally little lake and reconstructed the garden in ": null
    },
    {
        "English style": "english landscape garden"
    },
    {
        ". In the time to follow many exotic buildings were put up, among these a so-called Chinese palace, an Arion ship, a Gothic house and the artificial ruin of a castle. Today there are only the concert hall, the island with the ruin and the New Guardhouse left, but the Bagno has become established as an attraction for tourists.     At the same time the conflict between Count and city came to a climax. Following a legal dispute the Count of Steinfurt deposed the city council, arrested the mayor and deployed 42 ": null
    },
    {
        "French": "france"
    },
    {
        " soldiers. He banned the town guards and, consequently, the town guard festivals called Schützenfest. Later peace was restored through a settlement and a new council was elected. In 42 the French allocated Steinfurt to the grand duchy Berg. Steinfurt was now the head of the arrondissement and therefore its administrational centre. Thus, a decision had been made which is still valid today. Steinfurt is still the seat of the local government, the local district court and the financial authorities. The French also closed the Kommende.     The decision of the French to choose Burgsteinfurt as an administrational centre was simultaneously the start of the industrial era. Due to poor harvests and subsequent common impoverishment many citizens left for the ": null
    },
    {
        "United States": "united states"
    },
    {
        ". Especially in ": null
    },
    {
        "Ohio": "ohio"
    },
    {
        " and ": null
    },
    {
        "Missouri": "missouri"
    },
    {
        " old Stemmerter left their traces at that time. Meanwhile, Steinfurt was linked to the existing road networks. Old city gates were torn down to establish new housing estates beyond the old city boundaries. In 42 the first house was built outside the ancient urban area. Railroad connections were established from Steinfurt to Münster, Enschede, Rheine, Oberhausen and Borken. Textile industry, tobacco factories and the brewery Rolinck gained recognition. The predominantly Protestant population grew significantly. An almost forgotten fact is that a first line of telegraphs existed between Burgsteinfurt and Borghorst. Christoph Ludwig von Hoffmann, MD, scientist and personal physician of the Count, installed the ": null
    },
    {
        "optical telegraph": "optical telegraph"
    },
    {
        ".     At the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the town was in the ": null
    },
    {
        "British Zone of Occupation": "british zone of occupation"
    },
    {
        ". The townsfolk were noted in the British press for their silent but palpable resentment of the British occupation. On 42 May 42 the people of the town were ordered to watch an Allied ": null
    },
    {
        "documentary film": "documentary film"
    },
    {
        " detailing Nazi mass murder.                The Old Town Hall built in 42 indicates by its ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        " gable": "gable"
    },
    {
        " the self-confidence of the economically successful citizens of Burgsteinfurt. The swinging contours of the gable lead to seven peaked pyramids and the crest of the city. The ": null
    },
    {
        "turret": "turret"
    },
    {
        " of the town hall is supported by one big beam, called Kaiserstiel . The Gothic hall below on the first floor contained the city guard and the prison for a very long time. On the second floor you will find the big assembly hall of the city council and the chamber with the fireplace.     Opposite to the Town Hall the street leads to Hahnenstrasse. Right at the beginning you will discover the Huck-Beifang-Haus. Eberhard Huck, the Counts financial administrator, had built this house as an annex to his wifes home in Bütkamp 42 The proud owner noted on the bay in Latin: Sunt hae structae aedes Eberhardie sumptibus Hucki. Ex his as superas sperat abire domos, which would be in English something like: This house was built at the expense of Eberhard Huck. From here he hopes he will come into heaven one day. The bay is marked with the crest of the Huck family and Beifang family and the year 42 The building, which in the meantime harboured the ": null
    },
    {
        "public library": "public library"
    },
    {
        ", serves now occasionally as an ": null
    },
    {
        "art gallery": "art gallery"
    },
    {
        " and a ": null
    },
    {
        "function hall": "function hall"
    },
    {
        " for ": null
    },
    {
        "public lecture": "public lecture"
    },
    {
        "s.     From here a narrow medieval lane, the Kalkarstiege, leads to Bütkamp. Here you will encounter several classic buildings all at once: first the Haus Bütkamp 42 on the left side and the house called Ackerbürgerhaus, a building inhabited by a citizen who was a farmer as well as a citizen of the town and who had his land outside the city walls. On the right side is a very graceful half-timbered house with two storeys located. It dates from the beginning of the 42th century and is called Kornschreiberhaus . The second floor and the third floor extend into the street. Thus the house offered more space. Michael Oeglein from ": null
    },
    {
        "Southern Germany": "southern germany"
    },
    {
        "s ": null
    },
    {
        "Swabia": "swabia"
    },
    {
        " is considered the architect and initial owner of this house. He was in charge of collecting the duties and taxes the farmers owed to the Count. They delivered ": null
    },
    {
        "food grain": "food grain"
    },
    {
        " and he had to keep records. Since keeping records is in colloquial German schreiben , his house was eventually known as Kornschreiberhaus.     The tall building housing the Stadtbücherei is known as Weinhaus . It is the oldest building at the market square. Built around 42 by the Count, it served as accommodation for his guests and later on for selling wine. Moreover, it demonstrated how the Count held sway over the town and its market square which symbolized the wealth and power of the citizens. Due to certain defects concerning the buildings construction the roof had to be restored in 42 already. The wall close to Kirchstrasse had to be rebuilt after the Thirty Years War. And the ": null
    },
    {
        "stucco": "stucco"
    },
    {
        " façade, a mix of Baroque elements and ": null
    },
    {
        "Art Nouveau": "art nouveau"
    },
    {
        " dates back to 42 Nowadays the house lodges a fireplace which was relocated from house Markt 42 It shows ": null
    },
    {
        "Adam and Eve": "adam and eve"
    },
    {
        " while Eve passes on the apple to Adam.     Close to the Wine-House you will observe two houses in Renaissance style. The house Markt 42 was owned by the judge and law professor at the Hohe Schule, Johannes Goddaeus, who had the house built on the foundations of a wine-shop. The house Markt 42 was constructed by the Counts administrator Dr. Caspar Kestering and his wife Adelheid Huberts immediately after the Thirty Years War in 42 Their initials are eligible in the crest of the two lions in front of the door. In the past there was a tavern, the cellar of which still exists. During the Thirty Years War the house was destroyed, but Kestering had a new house put up on the foundation of the old one in the style of the ": null
    },
    {
        "Dutch Renaissance": "renaissance in the low countries"
    },
    {
        ".     Opposite to this house you will observe the Haus Pieter van der Swaagh, which was built in 42 by judge Friedrich Houth in classicistic style. The flowerpots on the house with the artificial agaves probably derive from the Bagno.     The tour leads on to Burgstrasse. The Counts the former Kunsthaus deserves attention because more than a hundred years ago it was a unique museum of artwork, stuffed crocodiles and odd scientific instruments. At the end of Burgstrasse there is the Schlossmühle on the left and the castle itself on the right. There was a mill on this site already in the Middle Ages, today there is a café and a restaurant.     The Castle is one of Burgsteinfurts most important buildings. Registered ": null
    },
    {
        "sightseeing": "sightseeing"
    },
    {
        " tours are offered, but only a limited area is open for tourists because the castle is still inhabited by the noble family. A fortified castle was erected on a hill already dug up in the 42th century, but was destroyed in 42 in a conflict with Aschebergs ": null
    },
    {
        "nobility": "nobility"
    },
    {
        ". The new facility contained an outer wall, the ": null
    },
    {
        "Buddenturm": "fortified tower"
    },
    {
        ", a tall tower for defence demolished in the 42th century, and the tower used for living with the ": null
    },
    {
        "Great hall": "great hall"
    },
    {
        ". A rare construction are the two chapels built on top of each other and used as two-storeyed chapel. The auxiliary building of today in front of the main residence or Hauptburg comprises flats, garages, stables and farm buildings. In the middle there is a little Baroque house for a well, built by ": null
    },
    {
        "stonemason": "stonemason"
    },
    {
        " Johann Schrader.     From the castle and the market the former university building Hohe Schule can be seen. In order to oppose the activities of the Jesuits in Münster and Münsterland, Count Arnold IV founded a Calvinistic university, once the oldest university in Westphalia. Starting in 42 the Hohe Schule offered courses in law, theology, medicine/physics, philosophy, history and rhetoric. Doctors’ degrees, however, were not awarded in Burgsteinfurt. The Hohe Schule was built in the Renaissance style and is crowned by two weather vanes that are marked with the crest of Count Arnold IV and his wife. Around the big tower runs a gallery, where people could make astronomical computations. At the beginning of the 42th century the Hohe Schule was closed. It was used then by French troops under Napoleonic rule, later on as the seat of a law court and as a prison.     From the Hohe Schule an alley branches off, the so-called Kautenstege, actually Kortenstege or short way. At the beginning the old Geisthaus can be seen, the only surviving poorhouse of the city from the 42th century. In Kautenstege a memorial stone reminds the visitor of the Synagogue that once stood here and the Jewish citizens who were deported. The Synagogue was destroyed in November 42 At the end of Kautenstege you reach Steinstrasse ; on the right side there is the old town hall, the starting point of the tour.       Steinfurt and all its 42 citizens profits from its location in the centre of the charming landscape of Münsterland. Steinfurt is also the home of numerous medium-sized enterprises, especially the brewery, spinning mills and transportation companies. In Steinfurt there are all kinds of schools and colleges, including of course the traditional academic high school Arnoldinum, a descendant of the Hohe Schule. The polytechnic institute of Münster keeps several world-famous departments in Burgsteinfurt, particularly for electronic technology and bio-chemistry. The city possesses two ": null
    },
    {
        "public pools": "public pools"
    },
    {
        ", two ": null
    },
    {
        "secondary schools": "gymnasium"
    },
    {
        " and in the Bagno there is one of the most beautiful golf courses in Westphalia .     The engineering faculties of the ": null
    },
    {
        "University of Applied Sciences Münster": "fachhochschule münster"
    },
    {
        " are based in Steinfurt.           ": null
    },
    {
        "Steinfurt-Burgsteinfurt station": "steinfurt-burgsteinfurt station"
    },
    {
        " is located on the ": null
    },
    {
        "Münster–Enschede railway": "münster–enschede railway"
    },
    {
        " and has an hourly train service to ": null
    },
    {
        "Münster": "münster hauptbahnhof"
    },
    {
        " in one direction and to ": null
    },
    {
        "Enschede": "enschede railway station"
    },
    {
        " in the other direction.        Bus lines connect Steinfurt to Rheine, Emsdetten and Coesfeld       Bicycle paths lead to ": null
    },
    {
        "Metelen": "metelen"
    },
    {
        ", Rheine, Horstmar and Münster.         Image:Old Town Steinfurt Borghorst.jpg|Old Town Borghorst   Image:Evangelische Kirche Borghorst.jpg|St. Johanneskirche ": null
    },
    {
        "SELK": "independent evangelical-lutheran church"
    },
    {
        "   Image:SpeicherWilmsbergBild42JPG|Speicherhaus in Wilmsberg   Image:Park Borghorst 42jpg|Urban Park Borghorst   Image:BWS Shopping Centre Steinfurt Borghorst.jpg|BWS shopping Centre   Image:Mahnmal Jüdisches Gotteshaus 42 42 42jpg|Borghorst Synagogue Memorial   Image:Moat Castle Steinfurt with bridge.jpg|Castle moat   Image:Bagno Concert Hall.jpg|Bagno Concert Hall   Image:Burgsteinfurts Old Town.jpg|Historical Old Town of Burgsteinfurt   Image:Brewery Steinfurt Burgsteinfurt.jpg|Rolinck brewery   Image:Bicycle station Steinfurt connected to old house.jpg|Steinfurts bicycle station   Image:Cinema Steinfurt 42 year history.jpg|Cinema Steinfurt   Image:School of Economics Steinfurt.jpg|School of Economics   Image:Sunken Town Tiggelsee Steinfurt.jpg|The Sunken Town   Image:Cycle race Steinfurt II.JPG|Cycle race Steinfurt 42           ": null
    },
    {
        "Heinz Baumkötter": "heinz baumkötter"
    },
    {
        " , SS leader and concentration camp doctor in the concentration camps Mauthausen, Natzweiler-Struthof and Sachsenhausen   ": null
    },
    {
        "Johann Friedrich Böckelmann": "johann friedrich böckelmann"
    },
    {
        " , jurist and professor   ": null
    },
    {
        "Bertram Engel": "bertram engel"
    },
    {
        ", actually Bertram Passmann , German drummer   ": null
    },
    {
        "Mikael Forssell": "mikael forssell"
    },
    {
        " , Finnish footballer   ": null
    },
    {
        "Paul Gauselmann": "paul gauselmann"
    },
    {
        " , founder and chairman of the companys group of companies of the same name   ": null
    },
    {
        "Alexander Hegius": "alexander hegius"
    },
    {
        " , humanist, priest and member of the ": null
    },
    {
        "Brothers of Common Life": "brothers of common life"
    },
    {
        " Thomas Kemper": "thomas kemper"
    },
    {
        " , German painter   ": null
    },
    {
        "Jutta Richter": "jutta richter"
    },
    {
        " , German author of childrens literature and youth literature   ": null
    },
    {
        "Levin Ludwig Schücking": "levin ludwig schücking"
    },
    {
        " , Anglist and Shakespeare researcher   ": null
    },
    {
        "Lena Wermelt": "lena wermelt"
    },
    {
        " , German footballer   David Grotta , President of Newark, New Jersey City Planning Commission, appointed by Woodrow Wilson in 42 President of Newark, New Jersey Board of Trade, 42 Newspaper articles and his letters   ": null
    },
    {
        "Jannine Weigel": "jannine weigel"
    }
]