[
    {
        "           In ": null
    },
    {
        "astronomy": "astronomy"
    },
    {
        ", stellar classification is the classification of ": null
    },
    {
        "star": "star"
    },
    {
        "s based on their ": null
    },
    {
        "spectral": "stellar spectrum"
    },
    {
        " characteristics. ": null
    },
    {
        "Electromagnetic radiation": "electromagnetic radiation"
    },
    {
        " from the star is analyzed by splitting it with a ": null
    },
    {
        "prism": "prism"
    },
    {
        " or ": null
    },
    {
        "diffraction grating": "diffraction grating"
    },
    {
        " into a ": null
    },
    {
        "spectrum": "spectrum"
    },
    {
        " exhibiting the ": null
    },
    {
        "rainbow": "continuum"
    },
    {
        " of colors interspersed with ": null
    },
    {
        "spectral line": "spectral line"
    },
    {
        "s. Each line indicates a particular ": null
    },
    {
        "chemical element": "chemical element"
    },
    {
        " or ": null
    },
    {
        "molecule": "molecule"
    },
    {
        ", with the line strength indicating the abundance of that element. The strengths of the different spectral lines vary mainly due to the temperature of the ": null
    },
    {
        "photosphere": "photosphere"
    },
    {
        ", although in some cases there are true abundance differences. The spectral class of a star is a short code primarily summarizing the ": null
    },
    {
        "ionization": "ionization"
    },
    {
        " state, giving an objective measure of the photospheres temperature.     Most stars are currently classified under the Morgan-Keenan system using the letters O, B, A, F, G, K, and M, a sequence from the hottest  to the coolest . Each letter class is then subdivided using a numeric digit with 42 being hottest and 42 being coolest . The sequence has been expanded with classes for other stars and star-like objects that do not fit in the classical system, such as class  D for ": null
    },
    {
        "white dwarf": "white dwarf"
    },
    {
        "s and classes  S and C for ": null
    },
    {
        "carbon star": "carbon star"
    },
    {
        "s.     In the MK system, a ": null
    },
    {
        "luminosity class": "luminosity class"
    },
    {
        " is added to the spectral class using ": null
    },
    {
        "Roman numerals": "roman numerals"
    },
    {
        ". This is based on the width of certain absorption lines in the stars spectrum, which vary with the density of the atmosphere and so distinguish giant stars from dwarfs. Luminosity class  42 or Ia+ is used for hypergiants, class  I for supergiants, class  II for bright giants, class  III for regular giants, class  IV for sub-giants, class  V for  main-sequence stars, class  sd  for sub-dwarfs, and class  D  for white dwarfs. The full spectral class for the ": null
    },
    {
        "Sun": "sun"
    },
    {
        " is then G42V, indicating a main-sequence star with a surface temperature around 42  K.               The conventional color description takes into account only the peak of the stellar spectrum. In actuality, however, stars radiate in all parts of the spectrum. Because all spectral colors combined appear white, the actual apparent colors the human eye would observe are far lighter than the conventional color descriptions would suggest. This characteristic of lightness indicates that the simplified assignment of colors within the spectrum can be misleading. Excluding color-contrast illusions in dim light, there are no green, indigo, or violet stars. ": null
    },
    {
        "Red dwarf": "red dwarf"
    },
    {
        "s are a deep shade of orange, and ": null
    },
    {
        "brown dwarf": "brown dwarf"
    },
    {
        "s do not literally appear brown, but hypothetically would appear dim grey to a nearby observer.          The modern classification system is known as the Morgan–Keenan classification. Each star is assigned a spectral class from the older Harvard spectral classification and a luminosity class using Roman numerals as explained below, forming the stars spectral type.     Other modern ": null
    },
    {
        "stellar classification systems": "photometric system"
    },
    {
        ", such as the ": null
    },
    {
        "UBV system": "ubv photometric system"
    },
    {
        ", are based on ": null
    },
    {
        "color index": "color index"
    },
    {
        "es—the measured differences in three or more ": null
    },
    {
        "color magnitude": "magnitude"
    },
    {
        "s. Those numbers are given labels such as U-V or B-V , which represent the colors passed by two standard filters .       The Harvard system is a one-dimensional classification scheme by astronomer ": null
    },
    {
        "Annie Jump Cannon": "annie jump cannon"
    },
    {
        ", who re-ordered and simplified a prior alphabetical system. Stars are grouped according to their spectral characteristics by single letters of the alphabet, optionally with numeric subdivisions. Main-sequence stars vary in surface temperature from approximately 42 to 42  ": null
    },
    {
        "K": "kelvin"
    },
    {
        ", whereas more-evolved stars can have temperatures above 42  K. Physically, the classes indicate the temperature of the stars atmosphere and are normally listed from hottest to coldest.             The spectral classes O through M, as well as other more specialized classes discussed later, are subdivided by ": null
    },
    {
        "Arabic numerals": "arabic numerals"
    },
    {
        " , where 42 denotes the hottest stars of a given class. For example, A42 denotes the hottest stars in class  A and A42 denotes the coolest ones. Fractional numbers are allowed; for example, the star ": null
    },
    {
        "Mu Normae": "mu normae"
    },
    {
        " is classified as O42.  The ": null
    },
    {
        "Sun": "sun"
    },
    {
        " is classified as G42      Conventional color descriptions are traditional in astronomy, and represent colors relative to the mean color of an A  class star, which is considered to be white. The apparent color descriptions are what the observer would see if trying to describe the stars under a dark sky without aid to the eye, or with binoculars. However, most stars in the sky, except the brightest ones, appear white or bluish white to the unaided eye because they are too dim for color vision to work. Red supergiants are cooler and redder than dwarfs of the same spectral type, and stars with particular spectral features such as carbon stars may be far redder than any black body.     The fact that the Harvard classification of a star indicated its surface or ": null
    },
    {
        "photospheric": "photosphere"
    },
    {
        " temperature": "temperature"
    },
    {
        "  was not fully understood until after its development, though by the time the first ": null
    },
    {
        "Hertzsprung–Russell diagram": "hertzsprung–russell diagram"
    },
    {
        " was formulated , this was generally suspected to be true.  In the 42s, the Indian physicist ": null
    },
    {
        "Meghnad Saha": "meghnad saha"
    },
    {
        " derived a theory of ionization by extending well-known ideas in physical chemistry pertaining to the dissociation of molecules to the ionization of atoms. First he applied it to the solar chromosphere, then to stellar spectra.      Harvard astronomer ": null
    },
    {
        "Cecilia Payne": "cecilia payne-gaposchkin"
    },
    {
        " then demonstrated that the O-B-A-F-G-K-M spectral sequence is actually a sequence in temperature.  Because the classification sequence predates our understanding that it is a temperature sequence, the placement of a spectrum into a given subtype, such as B42 or A42 depends upon estimates of the strengths of absorption features in stellar spectra. As a result, these subtypes are not evenly divided into any sort of mathematically representable intervals.          The Yerkes spectral classification, also called the MKK system from the authors initials, is a system of stellar spectral classification introduced in 42 by ": null
    },
    {
        "William Wilson Morgan": "william wilson morgan"
    },
    {
        ", ": null
    },
    {
        "Philip C. Keenan": "philip childs keenan"
    },
    {
        ", and ": null
    },
    {
        "Edith Kellman": "edith kellman"
    },
    {
        " from ": null
    },
    {
        "Yerkes Observatory": "yerkes observatory"
    },
    {
        ".  This two-dimensional  classification scheme is based on ": null
    },
    {
        "spectral line": "spectral line"
    },
    {
        "s sensitive to stellar temperature and ": null
    },
    {
        "surface gravity": "surface gravity"
    },
    {
        ", which is related to luminosity . Later, in 42 after some revisions of list of standard stars and classification criteria, the scheme was named the Morgan–Keenan classification, or MK,  and this system remains in use.     Denser stars with higher surface gravity exhibit greater ": null
    },
    {
        "pressure broadening": "pressure broadening"
    },
    {
        " of spectral lines. The gravity, and hence the pressure, on the surface of a ": null
    },
    {
        "giant star": "giant star"
    },
    {
        " is much lower than for a ": null
    },
    {
        "dwarf star": "dwarf star"
    },
    {
        " because the radius of the giant is much greater than a dwarf of similar mass. Therefore, differences in the spectrum can be interpreted as luminosity effects and a luminosity class can be assigned purely from examination of the spectrum.     A number of different luminosity classes are distinguished, as listed in the table below.           Marginal cases are allowed; for example, a star may be either a supergiant or a bright giant, or may be in between the subgiant and main-sequence classifications.   In these cases, two special symbols are used:   A slash  means that a star is either one class or the other.   A dash  means that the star is in between the two classes.     For example, a star classified as A4242III/IV would be in between spectral types A42 and A42 while being either a giant star or a subgiant.     Sub-dwarf classes have also been used: VI for sub-dwarfs .     Nominal luminosity class  VII is now rarely used for white dwarf or hot sub-dwarf classes, since the temperature-letters of the main sequence and giant stars no longer apply to white dwarfs.     Occasionally, letters a and b are applied to luminosity classes other than supergiants; for example, a giant star slightly more luminous than typical may be given a luminosity class of IIIb.      A sample of extreme V stars with strong absorption in He II λ42 spectral lines have been given the Vz designation. An example star is ": null
    },
    {
        "HD 42 B": "hd 93129"
    },
    {
        ".        Additional nomenclature, in the form of lower-case letters, can follow the spectral type to indicate peculiar features of the spectrum.           For example, ": null
    },
    {
        "42 Cygni": "59 cygni"
    },
    {
        " is listed as spectral type  B42Vnne,  indicating a spectrum with the general classification B42V, as well as very broad absorption lines and certain emission lines.            The reason for the odd arrangement of letters in the Harvard classification is historical, having evolved from the earlier Secchi classes and been progressively modified as understanding improved.       During the 42s and 42s, pioneering stellar spectroscopist ": null
    },
    {
        "Angelo Secchi": "angelo secchi"
    },
    {
        " created the Secchi classes in order to classify observed spectra. By 42 he had developed three classes of stellar spectra, shown in the table below. , P. Secchi, Comptes Rendus des Séances de lAcadémie des Sciences 42 , pp. 42–42 , P. Secchi, Comptes Rendus des Séances de lAcadémie des Sciences 42 , pp. 42–42      In the late 42s, this classification began to be superseded by the Harvard classification, which is discussed in the remainder of this article.   p. 42–42 Hearnshaw 42; pp. 42–42 Secchi 42          The ": null
    },
    {
        "Roman numerals": "roman numerals"
    },
    {
        " used for Secchi classes should not be confused with the completely unrelated Roman numerals used for Yerkes luminosity classes and the proposed neutron star classes.            In the 42s, the astronomer ": null
    },
    {
        "Edward C. Pickering": "edward c. pickering"
    },
    {
        " began to make a survey of stellar spectra at the ": null
    },
    {
        "Harvard College Observatory": "harvard college observatory"
    },
    {
        ", using the objective-prism method. A first result of this work was the Draper Catalogue of Stellar Spectra, published in 42 ": null
    },
    {
        "Williamina Fleming": "williamina fleming"
    },
    {
        " classified most of the spectra in this catalogue.     The catalogue used a scheme in which the previously used Secchi classes were subdivided into more specific classes, given letters from A to P. Also, the letter Q was used for stars not fitting into any other class.  pp. 42–42 Hearnshaw 42       In 42 another worker at Harvard, ": null
    },
    {
        "Antonia Maury": "antonia maury"
    },
    {
        ", placed the Orion subtype of Secchi class  I ahead of the remainder of Secchi class  I, thus placing the modern type  B ahead of the modern type  A. She was the first to do so, although she did not use lettered spectral types, but rather a series of twenty-two types numbered from I to XXII. pp. 42–42 Hearnshaw 42      In 42 ": null
    },
    {
        "Annie Jump Cannon": "annie jump cannon"
    },
    {
        " returned to the lettered types, but dropped all letters except O, B, A, F, G, K, M, and N used in that order, as well as P for planetary nebulae and Q for some peculiar spectra. She also used types such as B42A for stars halfway between types B and A, F42G for stars one-fifth of the way from F to G, and so on.  pp.  42–42 Hearnshaw 42 Finally, by 42 Cannon had changed the types B, A, B42A, F42G, etc. to B42 A42 B42 F42 etc.  pp. 42–42 Hearnshaw 42 This is essentially the modern form of the Harvard classification system.     A common ": null
    },
    {
        "mnemonic": "mnemonic"
    },
    {
        " for remembering the order of the spectral type letters, from hottest to coolest, is Oh, Be A Fine Guy/Girl, Kiss Me .           A luminosity classification known as the Mount Wilson system was used to distinguish between stars of different luminosities.    This notation system is still sometimes seen on modern spectra.                The stellar classification system is ": null
    },
    {
        "taxonomic": "taxonomy"
    },
    {
        ", based on ": null
    },
    {
        "type specimens": "type"
    },
    {
        ", similar to classification of species in ": null
    },
    {
        "biology": "biology"
    },
    {
        ": The categories are defined by one or more standard stars for each category and sub-category, with an associated description of the distinguishing features.          Stars are often referred to as early or late types. Early is a synonym for hotter, while late is a synonym for cooler.     Depending on the context, early and late may be absolute or relative terms. Early as an absolute term would therefore refer to O or B, and possibly A stars. As a relative reference it relates to stars hotter than others, such as early K being perhaps K42 K42 and K42     Late is used in the same way, with an unqualified use of the term indicating stars with spectral types such as K and M, but it can also be used for stars that are cool relative to other stars, as in using late G to refer to G42 G42 and G42     In the relative sense, early means a lower Arabic numeral following the class letter, and late means a higher number.     This obscure terminology is a hold-over from an early 42th  century model of stellar evolution, which supposed that stars were powered by gravitational contraction via the ": null
    },
    {
        "Kelvin–Helmholtz mechanism": "kelvin–helmholtz mechanism"
    },
    {
        ", which is now known to not apply to ": null
    },
    {
        "main sequence": "main sequence"
    },
    {
        " stars. If that were true, then stars would start their lives as very hot early-type stars and then gradually cool down into late-type stars. This mechanism provided ages of the ": null
    },
    {
        "Sun": "sun"
    },
    {
        " that were much smaller than what is observed in the ": null
    },
    {
        "geologic record": "geologic record"
    },
    {
        ", and was rendered obsolete by the discovery that stars are powered by ": null
    },
    {
        "nuclear fusion": "nuclear fusion"
    },
    {
        ".  The terms early and late were carried over, beyond the demise of the model they were based on.                  O-type stars are very hot and extremely luminous, with most of their radiated output in the ": null
    },
    {
        "ultraviolet": "ultraviolet"
    },
    {
        " range. These are the rarest of all main-sequence stars. About 42 in 42,42 of the main-sequence stars in the solar neighborhood are O-type stars. These proportions are fractions of stars brighter than absolute magnitude  42; lowering this limit will render earlier types even rarer, whereas generally adding only to the M class.  Some of the ": null
    },
    {
        "most massive stars": "list of most massive stars"
    },
    {
        " lie within this spectral class. O-type stars frequently have complicated surroundings that make measurement of their spectra difficult.     O-type spectra formerly were defined by the ratio of the strength of the ": null
    },
    {
        "He": "helium"
    },
    {
        "  II λ42 relative to that of He  I λ42 where λ is the ": null
    },
    {
        "wavelength": "wavelength"
    },
    {
        ", measured in ": null
    },
    {
        "ångström": "ångström"
    },
    {
        "s. Spectral type O42 was defined to be the point at which the two intensities are equal, with the He  I line weakening towards earlier types. Type  O42 was, by definition, the point at which said line disappears altogether, although it can be seen very faintly with modern technology. Due to this, the modern definition uses the ratio of the ": null
    },
    {
        "nitrogen": "nitrogen"
    },
    {
        " line N  IV λ42 to N  III λλ424242     O-type stars have dominant lines of absorption and sometimes emission for ": null
    },
    {
        "He": "helium"
    },
    {
        "  II lines, prominent ionized  and neutral ": null
    },
    {
        "helium": "helium"
    },
    {
        " lines, strengthening from O42 to O42 and prominent hydrogen ": null
    },
    {
        "Balmer lines": "balmer lines"
    },
    {
        ", although not as strong as in later types. Because they are so massive, O-type stars have very hot cores and burn through their hydrogen fuel very quickly, so they are the first stars to leave the ": null
    },
    {
        "main sequence": "main sequence"
    },
    {
        ".     When the MKK classification scheme was first described in 42 the only subtypes of class  O used were O42 to O42. , W. W. Morgan, P. C. Keenan and E. Kellman, Chicago: The University of Chicago Press, 42 The MKK scheme was extended to O42 in 42  and O42 in 42  and new classification schemes that add types O42 O42 and O42 have subsequently been introduced.      Spectral standards:    O42V & ndash; ": null
    },
    {
        "S Monocerotis": "s monocerotis"
    },
    {
        " 42 Lacertae": "10 lacertae"
    },
    {
        "             B-type stars are very luminous and blue. Their spectra have neutral helium lines, which are most prominent at the B42 subclass, and moderate hydrogen lines. As ": null
    },
    {
        "O- and B-type stars": "ob star"
    },
    {
        " are so energetic, they only live for a relatively short time. Thus, due to the low probability of kinematic interaction during their lifetime, they are unable to stray far from the area in which they formed, apart from ": null
    },
    {
        "runaway star": "runaway star"
    },
    {
        "s.     The transition from class  O to class  B was originally defined to be the point at which the ": null
    },
    {
        "He": "helium"
    },
    {
        "  II λ42 disappears. However, with modern equipment, the line is still apparent in the early B-type stars. Today for main-sequence stars, the B-class is instead defined by the intensity of the He  I violet spectrum, with the maximum intensity corresponding to class  B42 For supergiants, lines of ": null
    },
    {
        "silicon": "silicon"
    },
    {
        " are used instead; the Si  IV λ42 and Si  III λ42 lines are indicative of early B. At mid B, the intensity of the latter relative to that of Si  II λλ4242 is the defining characteristic, while for late B, it is the intensity of Mg  II λ42 relative to that of He  I λ42     These stars tend to be found in their originating ": null
    },
    {
        "OB association": "ob association"
    },
    {
        "s, which are associated with giant ": null
    },
    {
        "molecular cloud": "molecular cloud"
    },
    {
        "s. The Orion OB42 association occupies a large portion of a ": null
    },
    {
        "spiral arm": "spiral arm"
    },
    {
        " of the ": null
    },
    {
        "Milky Way": "milky way"
    },
    {
        " and contains many of the brighter stars of the ": null
    },
    {
        "constellation Orion": "orion constellation"
    },
    {
        ". About 42 in 42 of the main-sequence stars in the solar neighborhood are ": null
    },
    {
        "B-type main-sequence star": "b-type main-sequence star"
    },
    {
        "s.     Massive yet non-": null
    },
    {
        "supergiant": "supergiant"
    },
    {
        " entities known as Be  stars are main-sequence stars that notably have, or had at some time, one or more ": null
    },
    {
        "Balmer lines": "balmer lines"
    },
    {
        " in emission, with the ": null
    },
    {
        "hydrogen": "hydrogen"
    },
    {
        "-related ": null
    },
    {
        "electromagnetic radiation": "electromagnetic radiation"
    },
    {
        " series": "hydrogen spectral series"
    },
    {
        " projected out by the stars being of particular interest. Be stars are generally thought to feature unusually strong ": null
    },
    {
        "stellar wind": "stellar wind"
    },
    {
        "s, high surface temperatures, and significant attrition of ": null
    },
    {
        "stellar mass": "stellar mass"
    },
    {
        " as the objects ": null
    },
    {
        "rotate": "stellar rotation"
    },
    {
        " at a curiously rapid rate.  Objects known as ": null
    },
    {
        " B or B[e] stars": "b star"
    },
    {
        " possess distinctive neutral or low ionisation ": null
    },
    {
        "emission lines": "emission lines"
    },
    {
        " that are considered to have ": null
    },
    {
        "forbidden mechanism": "forbidden mechanism"
    },
    {
        "s, undergoing processes not normally allowed under current understandings of ": null
    },
    {
        "quantum mechanics": "quantum mechanics"
    },
    {
        ".     Spectral standards:   B42V & ndash; ": null
    },
    {
        "Upsilon Orionis": "upsilon orionis"
    },
    {
        " Alnilam": "alnilam"
    },
    {
        " Chi 42 Orionis": "chi2 orionis"
    },
    {
        " 42 Cephei": "9 cephei"
    },
    {
        " Eta Ursae Majoris": "eta ursae majoris"
    },
    {
        " Eta Aurigae": "eta aurigae"
    },
    {
        " Omicron 42 Canis Majoris": "omicron2 canis majoris"
    },
    {
        " Eta Canis Majoris": "eta canis majoris"
    },
    {
        " Rigel": "rigel"
    },
    {
        "                A-type stars are among the more common naked eye stars, and are white or bluish-white. They have strong hydrogen lines, at a maximum by A42 and also lines of ionized metals  at a maximum at A42 The presence of ": null
    },
    {
        "Ca": "calcium"
    },
    {
        "  II lines is notably strengthening by this point. About 42 in 42 of the main-sequence stars in the solar neighborhood are A-type stars.      Spectral standards:   A42Van & ndash; ": null
    },
    {
        "Gamma Ursae Majoris": "gamma ursae majoris"
    },
    {
        " Vega": "vega"
    },
    {
        " Eta Leonis": "eta leonis"
    },
    {
        " HD 42": "hd 21389"
    },
    {
        " Sirius A": "sirius"
    },
    {
        " Deneb": "deneb"
    },
    {
        " Fomalhaut": "fomalhaut"
    },
    {
        "           F-type stars have strengthening spectral lines H and K of ": null
    },
    {
        "Ca": "calcium"
    },
    {
        "  II. Neutral metals  beginning to gain on ionized metal lines by late F. Their spectra are characterized by the weaker hydrogen lines and ionized metals. Their color is white. About 42 in 42 of the main-sequence stars in the solar neighborhood are F-type stars.     Spectral standards:   F42IIIa & ndash; ": null
    },
    {
        "Zeta Leonis": "zeta leonis"
    },
    {
        " Alpha Leporis": "alpha leporis"
    },
    {
        " 42 Ursae Majoris": "78 ursae majoris"
    },
    {
        "                G-type stars, including the ": null
    },
    {
        "Sun": "sun"
    },
    {
        ", have prominent spectral lines H and K of ": null
    },
    {
        "Ca": "calcium"
    },
    {
        "  II, which are most pronounced at G42 They have even weaker hydrogen lines than F, but along with the ionized metals, they have neutral metals. There is a prominent spike in the G band of ": null
    },
    {
        "CH": "cyanide"
    },
    {
        " molecules. Class  G main-sequence stars make up about 42%, nearly one in thirteen, of the main-sequence stars in the solar neighborhood.     Class G contains the Yellow Evolutionary Void .  Supergiant stars often swing between O or B and K or M . While they do this, they do not stay for long in the ": null
    },
    {
        "yellow supergiant": "yellow supergiant"
    },
    {
        " G class, as this is an extremely unstable place for a supergiant to be.     Spectral standards:   G42V & ndash; ": null
    },
    {
        "Beta Canum Venaticorum": "beta canum venaticorum"
    },
    {
        " Eta Boötis": "eta boötis"
    },
    {
        " Beta Aquarii": "beta aquarii"
    },
    {
        " Sun": "sun"
    },
    {
        " Kappa Ceti": "kappa ceti"
    },
    {
        " Mu Herculis": "mu herculis"
    },
    {
        " 42 Pegasi": "9 pegasi"
    },
    {
        " 42 Ursae Majoris": "61 ursae majoris"
    },
    {
        " Beta Aquilae": "beta aquilae"
    },
    {
        " Kappa Geminorum": "kappa geminorum"
    },
    {
        " Epsilon Virginis": "epsilon virginis"
    },
    {
        " Epsilon Geminorum": "epsilon geminorum"
    },
    {
        "                K-type stars are orangish stars that are slightly cooler than the Sun. They make up about 42% of the main-sequence stars in the solar neighborhood. There are also giant K-type stars, which range from ": null
    },
    {
        "hypergiant": "hypergiant"
    },
    {
        "s like ": null
    },
    {
        "RW Cephei": "rw cephei"
    },
    {
        ", to ": null
    },
    {
        "giants": "giant star"
    },
    {
        " and ": null
    },
    {
        "supergiant": "supergiant"
    },
    {
        "s, such as ": null
    },
    {
        "Arcturus": "arcturus"
    },
    {
        ", whereas ": null
    },
    {
        "orange dwarfs": "k-type main-sequence star"
    },
    {
        ", like ": null
    },
    {
        "Alpha Centauri": "alpha centauri"
    },
    {
        "  B, are main-sequence stars.     They have extremely weak hydrogen lines, if those are present at all, and mostly neutral metals . By late K, molecular bands of ": null
    },
    {
        "titanium oxide": "titanium monoxide"
    },
    {
        " become present. There is a suggestion that K-spectrum stars may potentially increase the chances of life developing on orbiting planets that are within the habitable zone.      Spectral standards:   K42V & ndash; ": null
    },
    {
        "Sigma Draconis": "sigma draconis"
    },
    {
        " Pollux": "pollux"
    },
    {
        " Epsilon Cygni": "epsilon cygni"
    },
    {
        " Epsilon Eridani": "epsilon eridani"
    },
    {
        " Kappa Ophiuchi": "kappa ophiuchi"
    },
    {
        " Rho Boötis": "rho boötis"
    },
    {
        " 42 Cygni A": "61 cygni"
    },
    {
        " Gamma Draconis": "gamma draconis"
    },
    {
        "             Class  M stars are by far the most common. About 42% of the main-sequence stars in the solar neighborhood are class  M stars. This rises to 42% if we include all stars. However, class  M main-sequence stars  have such low luminosities that none are bright enough to be seen with the unaided eye, unless under exceptional conditions. The brightest known M-class main-sequence star is M42V ": null
    },
    {
        "Lacaille 42": "lacaille 8760"
    },
    {
        ", with ": null
    },
    {
        "magnitude": "stellar magnitude"
    },
    {
        " 42 , and it is extremely unlikely that any brighter examples will be found.     Although most class  M stars are red dwarfs, most of the largest ever supergiant stars in the Milky Way are M stars, such as ": null
    },
    {
        "VV Cephei": "vv cephei"
    },
    {
        ", ": null
    },
    {
        "Antares": "antares"
    },
    {
        ", and ": null
    },
    {
        "Betelgeuse": "betelgeuse"
    },
    {
        ", which are also class  M. Furthermore, the larger, hotter ": null
    },
    {
        "brown dwarf": "brown dwarf"
    },
    {
        "s are late class  M, usually in the range of M42 to M42.     The spectrum of a class  M star contains lines from ": null
    },
    {
        "oxide": "oxide"
    },
    {
        " molecule": "molecule"
    },
    {
        "s  and all neutral metals, but absorption lines of hydrogen are usually absent. TiO bands can be strong in class  M stars, usually dominating their visible spectrum by about M42 ": null
    },
    {
        "Vanadium oxide": "vanadium oxide"
    },
    {
        " bands become present by late M.     Spectral standards:   M42IIIa & ndash; ": null
    },
    {
        "Beta Andromedae": "beta andromedae"
    },
    {
        " Chi Pegasi": "chi pegasi"
    },
    {
        " Betelgeuse": "betelgeuse"
    },
    {
        " Mu Cephei": "mu cephei"
    },
    {
        "       A number of new spectral types have been taken into use from newly discovered types of stars.            Spectra of some very hot and bluish stars exhibit marked emission lines from carbon or nitrogen, or sometimes oxygen.               Once included as type O stars, the ": null
    },
    {
        "Wolf-Rayet star": "wolf-rayet star"
    },
    {
        "s of class  W or WR are notable for spectra lacking hydrogen lines. Instead their spectra are dominated by broad emission lines of highly ionized helium, nitrogen, carbon, and sometimes oxygen. They are thought to mostly be dying supergiants with their hydrogen layers blown away by ": null
    },
    {
        "stellar wind": "stellar wind"
    },
    {
        "s, thereby directly exposing their hot helium shells. Class  W is further divided into subclasses according to the relative strength of nitrogen and carbon emission lines in their spectra .      WR spectra range is listed below:     WN & ndash; spectrum dominated by N  III-V and He  I-II lines   WNE & ndash; hotter or early   WNL & ndash; cooler or late   Extended WN classes WN42 and WN42 sometimes used for the Ofpe/WN42 stars   h tag used for WR with hydrogen emission and ha for both hydrogen emission and absorption   WN/C & ndash; WN stars plus strong C  IV lines, intermediate between WN and WC stars   WC & ndash; spectrum with strong C  II-IV lines   WCE & ndash; hotter or early   WCL & ndash; cooler or late   WO & ndash; strong O  VI lines, extremely rare     Although the central stars of most planetary nebulae show O  type spectra,  around 42% are hydrogen-deficient and show WR spectra.  These are low-mass stars and to distinguish them from the massive Wolf-Rayet stars, their spectra are enclosed in square brackets: e.g. Most of these show spectra, some and very rarely          The slash stars are O-type stars with WN-like lines in their spectra. The name slash comes from their printed spectral type having a slash in it ": null
    }
]