[
    {
        "           Stem cells are ": null
    },
    {
        "cells": "Cell"
    },
    {
        " that can ": null
    },
    {
        "differentiate": "Cellular Differentiation"
    },
    {
        " into other types of cells, and can also ": null
    },
    {
        "divide": "Cell Division"
    },
    {
        " in self-renewal to produce more of the same type of stem cells.     ": null
    },
    {
        "Telomerase": "Telomerase"
    },
    {
        " is active in normal stem cells.     In ": null
    },
    {
        "mammal": "Mammal"
    },
    {
        "s, there are two broad types of stem cells: ": null
    },
    {
        "embryonic stem cell": "Embryonic Stem Cell"
    },
    {
        "s, which are isolated from the ": null
    },
    {
        "inner cell mass": "Inner Cell Mass"
    },
    {
        " of ": null
    },
    {
        "blastocysts": "Blastocyst"
    },
    {
        "in early embryonic development, and ": null
    },
    {
        "adult stem cell": "Adult Stem Cell"
    },
    {
        "s, which are found in various ": null
    },
    {
        "tissues": "Tissue"
    },
    {
        " of fully developed mammals. In ": null
    },
    {
        "adult": "Adult"
    },
    {
        " organisms, stem cells and ": null
    },
    {
        "progenitor cells": "Progenitor Cell"
    },
    {
        "act as a repair system for the body, replenishing adult tissues. In a developing ": null
    },
    {
        "embryo": "Embryo"
    },
    {
        ", stem cells can differentiate into all the specialized cells—ectoderm, endoderm and mesoderm —but also maintain the normal turnover of regenerative organs, such as blood, skin, or intestinal tissues.     There are three known accessible sources of ": null
    },
    {
        "autologous": "Autologous"
    },
    {
        " adult stem cells in humans:   ": null
    },
    {
        "bone marrow": "Bone Marrow"
    },
    {
        ", ": null
    },
    {
        "adipose tissue": "Adipose Tissue"
    },
    {
        ", and ": null
    },
    {
        "blood": "Blood"
    },
    {
        ". Stem cells can also be taken from ": null
    },
    {
        "umbilical cord blood": "Umbilical Cord Blood"
    },
    {
        " just after birth. Of all stem cell therapy types, autologous harvesting involves the least risk.     Adult stem cells are frequently used in various medical therapies . Stem cells can now be ": null
    },
    {
        "artificially grown": "Cell Culture"
    },
    {
        " and transformed into specialized cell types with characteristics consistent with cells of various tissues such as muscles or nerves. Embryonic ": null
    },
    {
        "cell lines": "Cell Line"
    },
    {
        "and ": null
    },
    {
        "autologous": "Autologous"
    },
    {
        " embryonic stem cells generated through ": null
    },
    {
        "somatic cell nuclear transfer": "Somatic Cell Nuclear Transfer"
    },
    {
        " or ": null
    },
    {
        "dedifferentiation": "Cellular Differentiationdedifferentiation"
    },
    {
        " have also been proposed as promising candidates for future therapies.  Research into stem cells grew out of findings by ": null
    },
    {
        "Ernest A. McCulloch": "Ernest Mcculloch"
    },
    {
        " and ": null
    },
    {
        "James E. Till": "James Till"
    },
    {
        " at the ": null
    },
    {
        "University of Toronto": "University Of Toronto"
    },
    {
        " in the 1960s.         The classical definition of a stem cell requires that it possesses two properties:   self-renewal: the ability to go through numerous ": null
    },
    {
        "cycles": "Cell Cycle"
    },
    {
        " of ": null
    },
    {
        "cell division": "Cell Division"
    },
    {
        " while maintaining the undifferentiated state.   Potency: the capacity to ": null
    },
    {
        "differentiate": "Cellular Differentiation"
    },
    {
        " into specialized cell types. In the strictest sense, this requires stem cells to be either ": null
    },
    {
        "totipotent": "Totipotency"
    },
    {
        " or ": null
    },
    {
        "pluripotent": "Pluripotency"
    },
    {
        "—to be able to give rise to any mature cell type, although ": null
    },
    {
        "multipotent": "Multipotent"
    },
    {
        " or ": null
    },
    {
        "unipotent": "Unipotent Cell"
    },
    {
        "progenitor cells": "Progenitor Cell"
    },
    {
        "are sometimes referred to as stem cells. Apart from this, it is said that stem cell function is regulated in a feedback mechanism.       Two mechanisms ensure that a stem cell population is maintained:     1. ": null
    },
    {
        "Obligatory asymmetric replication": "Asymmetric Cell Division"
    },
    {
        ": a stem cell divides into one mother cell that is identical to the original stem cell, and another daughter cell that is differentiated.     When a stem cell self-renews it divides and does not disrupt the undifferentiated state. This self-renewal demands control of cell cycle as well as upkeep of multipotency or pluripotency, which all depends on the stem cell. Shenghui, H. E., Nakada, D., & Morrison, S. J. . Mechanisms of stem cell self-renewal. Annual Review of Cell and Developmental, 25, 377–406.     2. Stochastic differentiation: when one stem cell develops into two differentiated daughter cells, another stem cell undergoes ": null
    },
    {
        "mitosis": "Mitosis"
    },
    {
        " and produces two stem cells identical to the original.                  Potency specifies the differentiation potential of the stem cell.    ": null
    },
    {
        "Totipotent": "Totipotency"
    },
    {
        " stem cells can differentiate into embryonic and extraembryonic cell types. Such cells can construct a complete, viable organism. These cells are produced from the ": null
    },
    {
        "fusion": "Cell Fusion"
    },
    {
        " of an egg and sperm cell. Cells produced by the first few divisions of the fertilized egg are also totipotent.    ": null
    },
    {
        "Pluripotent": "Pluripotency"
    },
    {
        " stem cells are the descendants of totipotent cells and can differentiate into nearly all cells, i.e. cells derived from any of the three ": null
    },
    {
        "germ layer": "Germ Layer"
    },
    {
        "s.    ": null
    },
    {
        "Multipotent": "Multipotency"
    },
    {
        " stem cells can differentiate into a number of cell types, but only those of a closely related family of cells.   ": null
    },
    {
        "Oligopotent": "Oligopotency"
    },
    {
        " stem cells can differentiate into only a few cell types, such as lymphoid or myeloid stem cells.   ": null
    },
    {
        "Unipotent": "Unipotency"
    },
    {
        " cells can produce only one cell type, their own, but have the property of self-renewal, which distinguishes them from non-stem cells .       In practice, stem cells are identified by whether they can regenerate tissue. For example, the defining test for bone marrow or ": null
    },
    {
        "hematopoietic stem cells": "Hematopoietic Stem Cell"
    },
    {
        " is the ability to transplant the cells and save an individual without HSCs. This demonstrates that the cells can produce new blood cells over a long term. It should also be possible to isolate stem cells from the transplanted individual, which can themselves be transplanted into another individual without HSCs, demonstrating that the stem cell was able to self-renew.     Properties of stem cells can be illustrated  in vitro , using methods such as ": null
    },
    {
        "clonogenic assay": "Clonogenic Assay"
    },
    {
        "s, in which single cells are assessed for their ability to differentiate and self-renew.     Stem cells can also be isolated by their possession of a distinctive set of cell surface markers. However, in vitro culture conditions can alter the behavior of cells, making it unclear whether the cells shall behave in a similar manner  in vivo . There is considerable debate as to whether some proposed adult cell populations are truly stem cells.             ": null
    },
    {
        "Embryonic stem cells": "Embryonic Stem Cell"
    },
    {
        " are the cells of the ": null
    },
    {
        "inner cell mass": "Inner Cell Mass"
    },
    {
        " of a ": null
    },
    {
        "blastocyst": "Blastocyst"
    },
    {
        ", formed prior to ": null
    },
    {
        "implantation": "Implantation"
    },
    {
        " in the uterus.  In ": null
    },
    {
        "human embryonic development": "Human Embryonic Development"
    },
    {
        " the ": null
    },
    {
        "blastocyst": "Blastocyst"
    },
    {
        " stage is reached 4–5 days after ": null
    },
    {
        "fertilization": "Human Fertilization"
    },
    {
        ", at which time it consists of 50–150 cells. ESCs are ": null
    },
    {
        "pluripotent": "Pluripotent"
    },
    {
        " and give rise during development to all derivatives of the three ": null
    },
    {
        "germ layer": "Germ Layer"
    },
    {
        "s: ": null
    },
    {
        "ectoderm": "Ectoderm"
    },
    {
        ", ": null
    },
    {
        "endoderm": "Endoderm"
    },
    {
        " and ": null
    },
    {
        "mesoderm": "Mesoderm"
    },
    {
        ". In other words, they can develop into each of the more than 200 cell types of the adult ": null
    },
    {
        "body": "Human Body"
    },
    {
        " when given sufficient and necessary stimulation for a specific cell type. They do not contribute to the ": null
    },
    {
        "extraembryonic membranes": "Extraembryonic Membrane"
    },
    {
        "or to the ": null
    },
    {
        "placenta": "Placenta"
    },
    {
        ".     During embryonic development the cells of the inner cell mass continuously divide and become more specialized. For example, a portion of the ectoderm in the dorsal part of the embryo specializes as ": null
    },
    {
        "neurectoderm": "Neurectoderm"
    },
    {
        ", which will become the future ": null
    },
    {
        "central nervous system": "Central Nervous System"
    },
    {
        ".   Later in development, ": null
    },
    {
        "neurulation": "Neurulation"
    },
    {
        " causes the neurectoderm to form the ": null
    },
    {
        "neural tube": "Neural Tube"
    },
    {
        ". At the neural tube stage, the anterior portion undergoes ": null
    },
    {
        "encephalization": "Encephalization"
    },
    {
        " to generate or pattern the basic form of the brain. At this stage of development, the principal cell type of the CNS is considered a ": null
    },
    {
        "neural stem cell": "Neural Stem Cell"
    },
    {
        ".     The neural stem cells self-renew and at some point transition into ": null
    },
    {
        "radial glial progenitor cells": "Radial Glial Cell"
    },
    {
        " . Early-formed RGPs self-renew by symmetrical division to form a reservoir group of ": null
    },
    {
        "progenitor cell": "Progenitor Cell"
    },
    {
        "s. These cells transition to a ": null
    },
    {
        "neurogenic": "Neurogenesis"
    },
    {
        " state and start to divide ": null
    },
    {
        "asymmetrically": "Asymmetric Cell Division"
    },
    {
        " to produce a large diversity of many different neuron types, each with unique gene expression, morphological, and functional characteristics. The process of generating neurons from radial glial cells is called ": null
    },
    {
        "neurogenesis": "Neurogenesis"
    },
    {
        ". The radial glial cell, has a distinctive bipolar morphology with highly elongated processes spanning the thickness of the neural tube wall. It shares some ": null
    },
    {
        "glial": "Glial"
    },
    {
        " characteristics, most notably the expression of ": null
    },
    {
        "glial fibrillary acidic protein": "Glial Fibrillary Acidic Protein"
    },
    {
        " .   The radial glial cell is the primary neural stem cell of the developing ": null
    },
    {
        "vertebrate": "Vertebrate"
    },
    {
        " CNS, and its cell body resides in the ": null
    },
    {
        "ventricular zone": "Ventricular Zone"
    },
    {
        ", adjacent to the developing ": null
    },
    {
        "ventricular system": "Ventricular System"
    },
    {
        ". Neural stem cells are committed to the neuronal lineages , and thus their potency is restricted.     Nearly all research to date has made use of mouse embryonic stem cells or human embryonic stem cells derived from the early inner cell mass. Both have the essential stem cell characteristics, yet they require very different environments in order to maintain an undifferentiated state. Mouse ES cells are grown on a layer of ": null
    },
    {
        "gelatin": "Gelatin"
    },
    {
        " as an ": null
    },
    {
        "extracellular matrix": "Extracellular Matrix"
    },
    {
        " and require the presence of ": null
    },
    {
        "leukemia inhibitory factor": "Leukemia Inhibitory Factor"
    },
    {
        " in serum media. A drug cocktail containing inhibitors to ": null
    },
    {
        "GSK3B": "Gsk3B"
    },
    {
        " and the ": null
    },
    {
        "MAPK/ERK pathway": "Mapk/Erk Pathway"
    },
    {
        ", called 2i, has also been shown to maintain pluripotency in stem cell culture.  Human ESCs are grown on a feeder layer of mouse embryonic ": null
    },
    {
        "fibroblasts": "Fibroblasts"
    },
    {
        " and require the presence of basic fibroblast growth factor .    Without optimal culture conditions or genetic manipulation,    embryonic stem cells will rapidly differentiate.     A human embryonic stem cell is also defined by the expression of several transcription factors and cell surface proteins. The transcription factors ": null
    },
    {
        "Oct-4": "Oct-4"
    },
    {
        ", ": null
    },
    {
        "Nanog": "Homeobox Protein Nanog"
    },
    {
        ", and ": null
    },
    {
        "Sox2": "Sox2"
    },
    {
        " form the core regulatory network that ensures the suppression of genes that lead to differentiation and the maintenance of pluripotency.    The cell surface antigens most commonly used to identify hES cells are the glycolipids ": null
    },
    {
        "stage specific embryonic antigen 3": "Stage Specific Embryonic Antigen 3"
    },
    {
        " and 4, and the keratan sulfate antigens Tra-1-60 and Tra-1-81. The molecular definition of a stem cell includes many more proteins and continues to be a topic of research.        By using human embryonic stem cells to produce specialized cells like nerve cells or heart cells in the lab, scientists can gain access to adult human cells without taking tissue from patients. They can then study these specialized adult cells in detail to try to discern complications of diseases, or to study cell reactions to proposed new drugs.     Because of their combined abilities of unlimited expansion and pluripotency, embryonic stem cells remain a theoretically potential source for ": null
    },
    {
        "regenerative medicine": "Regenerative Medicine"
    },
    {
        " and tissue replacement after injury or disease.  , however, there are currently no approved treatments using ES cells. The first human trial was approved by the US Food and Drug Administration in January 2009.  However, the human trial was not initiated until October 13, 2010 in Atlanta for ": null
    },
    {
        "spinal cord injury research": "Spinal Cord Injury Research"
    },
    {
        ". On November 14, 2011 the company conducting the trial  announced that it will discontinue further development of its stem cell programs.    Differentiating ES cells into usable cells while avoiding transplant rejection are just a few of the hurdles that embryonic stem cell researchers still face.  Embryonic stem cells, being pluripotent, require specific signals for correct differentiation — if injected directly into another body, ES cells will differentiate into many different types of cells, causing a ": null
    },
    {
        "teratoma": "Teratoma"
    },
    {
        ".   Ethical considerations regarding the use of unborn human tissue are another reason for the lack of approved treatments using embryonic stem cells. Many nations currently have ": null
    },
    {
        "moratoria": "Moratorium"
    },
    {
        " or limitations on either human ES cell research or the production of new human ES cell lines.     Image:Mouse embryonic stem cells.jpg | ": null
    },
    {
        "Mouse": "Mus Musculus"
    },
    {
        " embryonic": "Mammalian Embryogenesis"
    },
    {
        " stem cells with fluorescent marker   Image:Human embryonic stem cell colony phase.jpg | Human embryonic stem cell colony on mouse embryonic fibroblast feeder layer         The primitive stem cells located in the organs of ": null
    },
    {
        "fetuses": "Fetuses"
    },
    {
        " are referred to as fetal stem cells.      There are two types of fetal stem cells:     Fetal proper stem cells come from the tissue of the fetus proper, and are generally obtained after an ": null
    },
    {
        "abortion": "Abortion"
    },
    {
        ". These stem cells are not immortal but have a high level of division and are multipotent.   Extraembryonic fetal stem cells come from ": null
    },
    {
        "extraembryonic membrane": "Extraembryonic Membrane"
    },
    {
        "s, and are generally not distinguished from adult stem cells. These stem cells are acquired after birth, they are not immortal but have a high level of cell division, and are pluripotent. Moore, K.L., T.V.N. Persaud, and A.G. Torchia. Before We Are Born: Essentials of Embryology and Birth Defects. Philadelphia, PA: Saunders, Elsevier. 2013. Print                 Adult stem cells, also called ": null
    },
    {
        "somatic": "Somatic"
    },
    {
        " stem cells, are stem cells which maintain and repair the tissue in which they are found. Stem Cells Mayo Clinic. Mayo foundation for medical education and research n.d Web. March 23, 2013 They can be found in children, as well as adults.      There are three known accessible sources of ": null
    },
    {
        "autologous": "Autologous"
    },
    {
        " adult stem cells in humans:   ": null
    },
    {
        "Bone marrow": "Bone Marrow"
    },
    {
        ", which requires extraction by harvesting, that is, drilling into bone .   Adipose tissue , which requires extraction by liposuction.    Blood, which requires extraction through ": null
    },
    {
        "apheresis": "Apheresis"
    },
    {
        ", wherein blood is drawn from the donor , and passed through a machine that extracts the stem cells and returns other portions of the blood to the donor.   Stem cells can also be taken from ": null
    },
    {
        "umbilical cord blood": "Umbilical Cord Blood"
    },
    {
        " just after birth. Of all stem cell types, autologous harvesting involves the least risk. By definition, autologous cells are obtained from ones own body, just as one may bank his or her own blood for elective surgical procedures.     Pluripotent adult stem cells are rare and generally small in number, but they can be found in umbilical cord blood and other tissues.  Bone marrow is a rich source of adult stem cells,  which have been used in treating several conditions including liver cirrhosis,  chronic limb ischemia  and endstage heart failure.  The quantity of bone marrow stem cells declines with age and is greater in males than females during reproductive years.  Much adult stem cell research to date has aimed to characterize their potency and self-renewal capabilities.  DNA damage accumulates with age in both stem cells and the cells that comprise the stem cell environment. This accumulation is considered to be responsible, at least in part, for increasing stem cell dysfunction with aging .      Most adult stem cells are lineage-restricted  and are generally referred to by their tissue origin .   ": null
    },
    {
        "Muse cells": "Muse Cell"
    },
    {
        " are a recently discovered pluripotent stem cell type found in multiple adult tissues, including adipose, dermal fibroblasts, and bone marrow. While rare, muse cells are identifiable by their expression of ": null
    },
    {
        "SSEA-3": "Ssea-3"
    },
    {
        ", a marker for undifferentiated stem cells, and general mesenchymal stem cells markers such as ": null
    },
    {
        "CD105": "Cd105"
    },
    {
        ". When subjected to single cell suspension culture, the cells will generate clusters that are similar to embryoid bodies in morphology as well as gene expression, including canonical pluripotency markers ": null
    },
    {
        "Oct4": "Oct4"
    },
    {
        ", ": null
    },
    {
        "Sox2": "Sox2"
    },
    {
        ", and ": null
    },
    {
        "Nanog": "Homeobox Protein Nanog"
    },
    {
        ".      Adult stem cell treatments have been successfully used for many years to treat leukemia and related bone/blood cancers through bone marrow transplants.  Adult stem cells are also used in veterinary medicine to treat tendon and ligament injuries in horses.      The use of adult stem cells in research and therapy is not as ": null
    },
    {
        "controversial": "Stem Cell Controversy"
    },
    {
        " as the use of ": null
    },
    {
        "embryonic stem cell": "Embryonic Stem Cell"
    },
    {
        "s, because the production of adult stem cells does not require the destruction of an ": null
    },
    {
        "embryo": "Embryo"
    },
    {
        ". Additionally, in instances where adult stem cells are obtained from the intended recipient , the risk of rejection is essentially non-existent. Consequently, more US government funding is being provided for adult stem cell research.      With the increasing demand of human adult stem cells for both research and clinical purposes it becomes of utmost importance to bridge the gap between the need to expand the cells in vitro and the capability of harnessing the factors underlying replicative senescence. Adult stem cells are known to have a limited lifespan in vitro and to enter replicative senescence almost undetectably upon starting in vitro culturing.        Multipotent stem cells are also found in ": null
    },
    {
        "amniotic fluid": "Amniotic Fluid"
    },
    {
        ". These stem cells are very active, expand extensively without feeders and are not tumorigenic. ": null
    },
    {
        "Amniotic stem cells": "Amniotic Stem Cells"
    },
    {
        " are multipotent and can differentiate in cells of adipogenic, osteogenic, myogenic, endothelial, hepatic and also neuronal lines.      Amniotic stem cells are a topic of active research.     Use of stem cells from ": null
    },
    {
        "amniotic fluid": "Amniotic Fluid"
    },
    {
        " overcomes the ethical objections to using human embryos as a source of cells. ": null
    },
    {
        "Roman Catholic": "Roman Catholic"
    },
    {
        " teaching forbids the use of embryonic stem cells in experimentation; accordingly, the ": null
    },
    {
        "Vatican": "Holy See"
    },
    {
        " newspaper ": null
    },
    {
        "Osservatore Romano": "Osservatore Romano"
    },
    {
        " called amniotic stem cells the future of medicine .      It is possible to collect amniotic stem cells for donors or for autologous use: the first US amniotic stem cells bank   was opened in 2009 in Medford, MA, by ": null
    },
    {
        "Biocell Center": "Biocell Center"
    },
    {
        " Corporation    and collaborates with various hospitals and universities all over the world.             Adult stem cells have limitations with their potency; unlike ": null
    },
    {
        "embryonic stem cells": "Embryonic Stem Cell"
    },
    {
        ", they are not able to differentiate into cells from all three ": null
    },
    {
        "germ layers": "Germ Layers"
    },
    {
        ". As such, they are deemed ": null
    },
    {
        "multipotent": "Cell Potency"
    },
    {
        ".     However, ": null
    },
    {
        "reprogramming": "Reprogramming"
    },
    {
        " allows for the creation of pluripotent cells, ": null
    },
    {
        "induced pluripotent stem cells": "Induced Pluripotent Stem Cell"
    },
    {
        ", from adult cells. These are not adult stem cells, but adult cells reprogrammed to give rise to cells with pluripotent capabilities. Using genetic reprogramming with protein ": null
    },
    {
        "transcription factors": "Transcription Factors"
    },
    {
        ", pluripotent stem cells with ESC-like capabilities have been derived.    The first demonstration of induced pluripotent stem cells was conducted by ": null
    },
    {
        "Shinya Yamanaka": "Shinya Yamanaka"
    },
    {
        " and his colleagues at ": null
    },
    {
        "Kyoto University": "Kyoto University"
    },
    {
        ".  They used the transcription factors ": null
    },
    {
        "Oct3/4": "Oct-4"
    },
    {
        ", ": null
    },
    {
        "Sox2": "Sox2"
    },
    {
        ", ": null
    },
    {
        "c-Myc": "C-Myc"
    },
    {
        ", and ": null
    },
    {
        "Klf4": "Klf4"
    },
    {
        " to reprogram mouse fibroblast cells into pluripotent cells.  Subsequent work used these factors to induce pluripotency in human fibroblast cells.  ": null
    },
    {
        "Junying Yu": "Junying Yu"
    },
    {
        ", ": null
    },
    {
        "James Thomson": "James Thomson"
    },
    {
        ", and their colleagues at the ": null
    },
    {
        "University of Wisconsin–Madison": "University Of Wisconsin–Madison"
    },
    {
        " used a different set of factors, Oct4, Sox2, Nanog and Lin28, and carried out their experiments using cells from human ": null
    },
    {
        "foreskin": "Foreskin"
    },
    {
        ".  However, they were able to replicate ": null
    },
    {
        "Yamanakas": "Yamanaka"
    },
    {
        "finding that inducing pluripotency in human cells was possible.     Induced pluripotent stem cells differ from embryonic stem cells. They share many similar properties, such as ": null
    },
    {
        "pluripotency": "Pluripotency"
    },
    {
        " and differentiation potential, the expression of ": null
    },
    {
        "pluripotency": "Pluripotency"
    },
    {
        " genes, ": null
    },
    {
        "epigenetic": "Epigenetic"
    },
    {
        " patterns, ": null
    },
    {
        "embryoid body": "Embryoid Body"
    },
    {
        " and ": null
    },
    {
        "teratoma": "Teratoma"
    },
    {
        " formation, and viable ": null
    },
    {
        "chimera": "Chimera"
    },
    {
        " formation, but there are many differences within these properties. The chromatin of iPSCs appears to be more closed or methylated than that of ESCs. Similarly, the gene expression pattern between ESCs and iPSCs, or even iPSCs sourced from different origins. There are thus questions about the completeness of ": null
    },
    {
        "reprogramming": "Reprogramming"
    },
    {
        " and the somatic memory of induced pluripotent stem cells. Despite this, inducing ": null
    },
    {
        "adult cells": "Adult Cell"
    },
    {
        "to be pluripotent appears to be viable.     As a result of the success of these experiments, ": null
    },
    {
        "Ian Wilmut": "Ian Wilmut"
    },
    {
        ", who helped create the first cloned animal ": null
    },
    {
        "Dolly the Sheep": "Dolly The Sheep"
    },
    {
        ", has announced that he will abandon ": null
    },
    {
        "somatic cell nuclear transfer": "Somatic Cell Nuclear Transfer"
    },
    {
        " as an avenue of research. His inspiration comes from the research by Prof ": null
    },
    {
        "Shinya Yamanaka": "Shinya Yamanaka"
    },
    {
        " at ": null
    },
    {
        "Kyoto University": "Kyoto University"
    },
    {
        ", which suggests a way to create human embryo stem cells without the need for human eggs, which are in extremely short supply, and without the need to create and destroy human cloned embryos, which is bitterly opposed by the pro life movement.      Furthermore, induced pluripotent stem cells provide several therapeutic advantages. Like ESCs, they are ": null
    },
    {
        "pluripotent": "Pluripotent"
    },
    {
        ". They thus have great differentiation potential; theoretically, they could produce any cell within the human body . Moreover, unlike ESCs, they potentially could allow doctors to create a pluripotent stem cell line for each individual patient.  Frozen blood samples can be used as a valuable source of induced pluripotent stem cells. . newsdaily.com Patient specific stem cells allow for the screening for side effects before drug treatment, as well as the reduced risk of transplantation rejection. Despite their current limited use therapeutically, iPSCs hold create potential for future use in medical treatment and research.          To ensure self-renewal, stem cells undergo two types of cell division . Symmetric division gives rise to two identical daughter cells both endowed with stem cell properties. Asymmetric division, on the other hand, produces only one stem cell and a ": null
    },
    {
        "progenitor cell": "Progenitor Cell"
    },
    {
        " with limited self-renewal potential. Progenitors can go through several rounds of cell division before terminally ": null
    },
    {
        "differentiating": "Cell Differentiation"
    },
    {
        " into a mature cell. It is possible that the molecular distinction between symmetric and asymmetric divisions lies in differential segregation of cell membrane proteins  between the daughter cells.        An alternative theory is that stem cells remain undifferentiated due to environmental cues in their particular niche. Stem cells differentiate when they leave that niche or no longer receive those signals. Studies in Drosophila germarium have identified the signals ": null
    },
    {
        "decapentaplegic": "Decapentaplegic"
    },
    {
        " and adherens junctions that prevent germarium stem cells from differentiating.                  Stem cell therapy is the use of stem cells to treat or prevent a disease or condition. ": null
    },
    {
        "Bone marrow transplant": "Bone Marrow Transplant"
    },
    {
        " is a form of stem cell therapy that has been used for many years without controversy. Ian Murnaghan for Explore Stem Cells. Updated: 16 December 2013   In National Cancer Institute Fact Sheet web site. Bethesda, MD: National Institutes of Health, U.S. Department of Health and Human Services, 2010. Cited August 24, 2010       Stem cell treatments may lower symptoms of the disease or condition that is being treated. The lowering of symptoms may allow patients to reduce the drug intake of the disease or condition. Stem cell treatment may also provide knowledge for society to further stem cell understanding and future treatments.        Stem cell treatments may require ": null
    },
    {
        "immunosuppression": "Immunosuppression"
    },
    {
        " because of a requirement for radiation before the transplant to remove the persons previous cells, or because the patients immune system may target the stem cells. One approach to avoid the second possibility is to use stem cells from the same patient who is being treated.     Pluripotency in certain stem cells could also make it difficult to obtain a specific cell type. It is also difficult to obtain the exact cell type needed, because not all cells in a population differentiate uniformly. Undifferentiated cells can create tissues other than desired types.      Some stem cells form tumors after transplantation; Bernadine Healy, M.D..  US News and world report. Retrieved on Aug 17, 2015. pluripotency is linked to tumor formation especially in embryonic stem cells, fetal proper stem cells, induced pluripotent stem cells. Fetal proper stem cells form tumors despite multipotency.             Some of the fundamental ": null
    },
    {
        "patents": "Patent"
    },
    {
        "covering human embryonic stem cells are owned by the ": null
    },
    {
        "Wisconsin Alumni Research Foundation": "Wisconsin Alumni Research Foundation"
    },
    {
        " – they are patents 5,843,780, 6,200,806, and 7,029,913 invented by ": null
    },
    {
        "James A. Thomson": "James Thomson"
    },
    {
        ". WARF does not enforce these patents against academic scientists, but does enforce them against companies. Regalado, Antonio, David P. Hamilton .  The Wall Street Journal. Retrieved on July 24, 2006.     In 2006, a request for the ": null
    },
    {
        "US Patent and Trademark Office": "Us Patent And Trademark Office"
    },
    {
        " to re-examine the three patents was filed by the ": null
    },
    {
        "Public Patent Foundation": "Public Patent Foundation"
    },
    {
        " on behalf of its client, the non-profit patent-watchdog group ": null
    },
    {
        "Consumer Watchdog": "Consumer Watchdog"
    },
    {
        " . In the re-examination process, which involves several rounds of discussion between the USPTO and the parties, the USPTO initially agreed with Consumer Watchdog and rejected all the claims in all three patents, Stephen Jenei for Patent Baristas, April 3, 2007  however in response, WARF amended the claims of all three patents to make them more narrow, and in 2008 the USPTO found the amended claims in all three patents to be patentable. The decision on one of the patents was appealable, while the decisions on the other two were not. Stephen Jenei for Patent Baristas, March 3, 2008  ": null
    },
    {
        "Constance Holden": "Constance Holden"
    },
    {
        " for Science Now. March 12, 2008  Consumer Watchdog appealed the granting of the 913 patent to the USPTOs Board of Patent Appeals and Interferences which granted the appeal, and in 2010 the BPAI decided that the amended claims of the 913 patent were not patentable. Stephen G. Kunin for Patents Post Grant. May 10, 2010  However, WARF was able to re-open prosecution of the case and did so, amending the claims of the 913 patent again to make them more narrow, and in January 2013 the amended claims were allowed. United States Patent And Trademark Office. Board Of Patent Appeals and Interferences. The Foundation For Taxpayer & Consumer Rights, Requester And Appellant V. Patent Of Wisconsin Alumni Research Foundation, Patent Owner And Respondent. Appeal 2012-011693, Reexamination Control 95/000,154. Patent 7,029,913       In July 2013, Consumer Watchdog announced that it would appeal the decision to allow the claims of the 913 patent to the US ": null
    },
    {
        "Court of Appeals for the Federal Circuit": "Court Of Appeals For The Federal Circuit"
    },
    {
        " , the federal appeals court that hears patent cases. GenomeWeb staff, July 03, 2013  At a hearing in December 2013, the CAFC raised the question of whether Consumer Watchdog had ": null
    },
    {
        "legal standing": "Legal Standing"
    },
    {
        " to appeal; the case could not proceed until that issue was resolved. Antoinette Konski for Personalized Medicine Bulletin. February 3, 2014           Diseases and conditions where stem cell treatment is being investigated include:   ": null
    },
    {
        "Diabetes": "Diabetes"
    },
    {
        "   Rheumatoid arthritis": "Rheumatoid Arthritis"
    },
    {
        "   Parkinsons disease": "Parkinsons Disease"
    },
    {
        "   Alzheimers disease": "Alzheimers Disease"
    },
    {
        "   Osteoarthritis": "Osteoarthritis"
    },
    {
        " . In Stem Cell Information World Wide Web site. Bethesda, MD: National Institutes of Health, U.S. Department of Health and Human Services, 2009. cited Sunday, April 26, 2009   ": null
    },
    {
        "Stroke": "Stroke"
    },
    {
        " and ": null
    },
    {
        "traumatic brain injury": "Traumatic Brain Injury"
    },
    {
        " repair Steinberg, Douglas  thescientist.com   ": null
    },
    {
        "Learning disability": "Learning Disability"
    },
    {
        " due to ": null
    },
    {
        "congenital disorder": "Congenital Disorder"
    },
    {
        "  December 25, 2008.   ": null
    },
    {
        "Spinal cord injury": "Spinal Cord Injury"
    },
    {
        " repair    ": null
    },
    {
        "Heart infarction": "Heart Infarction"
    },
    {
        "    Anti-": null
    },
    {
        "cancer": "Cancer"
    },
    {
        " treatments  thescientist.com, Nov 2000. By Douglas Steinberg   ": null
    },
    {
        "Baldness": "Baldness"
    },
    {
        " reversal  ": null
    },
    {
        "WebMD": "Webmd"
    },
    {
        " November 2004   Replace missing ": null
    },
    {
        "teeth": "Teeth"
    },
    {
        "    Repair ": null
    },
    {
        "hearing": "Hearing"
    },
    {
        "    Restore ": null
    },
    {
        "vision": "Visual System"
    },
    {
        "  and repair damage to the ": null
    },
    {
        "cornea": "Cornea"
    },
    {
        "    Amyotrophic lateral sclerosis": "Amyotrophic Lateral Sclerosis"
    },
    {
        "    Crohns disease": "Crohns Disease"
    },
    {
        "    Wound healing": "Wound Healing"
    },
    {
        "  Bone marrow transplantation is, as of 2009, the only established use of stem cells.   ": null
    },
    {
        "Male infertility": "Male Infertility"
    },
    {
        " due to absence of spermatogonial stem cells.  Bone marrow transplantation is, as of 2009, the only established use of stem cells. In recent studies, scientist have found a way to solve this problem by reprogramming a cell and turning it into a spermatozoon. Other studies have proven the restoration of spermatogenesis by introducing human iPSC cells in mice testicles. This could mean the end of azoospermia.    ": null
    },
    {
        "Female infertility": "Female Infertility"
    },
    {
        ": oocytes made from embryonic stem cells. Scientists have found the ovarian stem cells, a rare type of cells found in the ovary. They could be used as a treatment not only for infertility, but also for premature ovarian insufficiency.      Research is underway to develop various sources for stem cells, and to apply stem cell treatments for ": null
    },
    {
        "neurodegenerative diseases": "Neurodegenerative Diseases"
    },
    {
        " and conditions, ": null
    },
    {
        "diabetes": "Diabetes"
    },
    {
        ", ": null
    },
    {
        "heart disease": "Heart Disease"
    },
    {
        ", and other conditions.  Research is also underway in generating ": null
    },
    {
        "organoids": "Organoid"
    },
    {
        "using stem cells, which would allow for further understanding of human development, ": null
    },
    {
        "organogenesis": "Organogenesis"
    },
    {
        ", and modeling of human diseases. Ader, M., & Tanaka, E. M. . Modeling human development in 3D culture. Current Opinion in Cell Biology, 31, 23–28.      In more recent years, with the ability of scientists to isolate and culture ": null
    },
    {
        "embryonic stem cells": "Embryonic Stem Cells"
    },
    {
        ", and with scientists growing ability to create stem cells using ": null
    },
    {
        "somatic cell nuclear transfer": "Somatic Cell Nuclear Transfer"
    },
    {
        " and techniques to create ": null
    },
    {
        "induced pluripotent stem cells": "Induced Pluripotent Stem Cells"
    },
    {
        ", controversy has crept in, both related to ": null
    },
    {
        "abortion politics": "Abortion Debate"
    },
    {
        " and to ": null
    },
    {
        "human cloning": "Human Cloning"
    },
    {
        ".     ": null
    },
    {
        "Hepatotoxicity": "Hepatotoxicity"
    },
    {
        " and drug-induced liver injury account for a substantial number of failures of new drugs in development and market withdrawal, highlighting the need for screening assays such as stem cell-derived hepatocyte-like cells, that are capable of detecting toxicity early in the ": null
    },
    {
        "drug development": "Drug Development"
    },
    {
        " process. ": null
    }
]