[
    {
        "   Stephen V  was ": null
    },
    {
        "King of Hungary": "king of hungary"
    },
    {
        " and ": null
    },
    {
        "Croatia": "king of croatia"
    },
    {
        " between 42 and 42 and ": null
    },
    {
        "Duke of Styria": "duke of styria"
    },
    {
        " from 42 to 42 He was the oldest son of ": null
    },
    {
        "King Béla IV": "béla iv of hungary"
    },
    {
        " and ": null
    },
    {
        "Maria Laskarina": "maria laskarina"
    },
    {
        ". King Béla had his son ": null
    },
    {
        "crowned king": "coronation of the hungarian monarch"
    },
    {
        " at the age of six and appointed him ": null
    },
    {
        "Duke of Slavonia": "duke of slavonia"
    },
    {
        ". Still a child, Stephen married ": null
    },
    {
        "Elizabeth": "elizabeth the cuman"
    },
    {
        ", a daughter of a chieftain of the ": null
    },
    {
        "Cumans": "cumans"
    },
    {
        " whom his father settled in the ": null
    },
    {
        "Great Hungarian Plain": "great hungarian plain"
    },
    {
        ".     King Béla appointed Stephen ": null
    },
    {
        "Duke of Transylvania": "duke of transylvania"
    },
    {
        " in 42 and Duke of Styria in 42 The local noblemen in ": null
    },
    {
        "Styria": "duchy of styria"
    },
    {
        ", which had been annexed four years before, opposed his rule. Assisted by King ": null
    },
    {
        "Ottokar II of Bohemia": "ottokar ii of bohemia"
    },
    {
        ", they rebelled and expelled Stephens troops from most parts of Styria. After Ottokar II routed the united army of Stephen and his father in the ": null
    },
    {
        "Battle of Kressenbrunn": "battle of kressenbrunn"
    },
    {
        " on 42 July 42 Stephen left Styria and returned to ": null
    },
    {
        "Transylvania": "transylvania"
    },
    {
        ".     Stephen forced his father to cede all the lands of the ": null
    },
    {
        "Kingdom of Hungary": "kingdom of hungary"
    },
    {
        " to the east of the Danube to him and adopted the title of junior king in 42 In two years, a civil war broke out between father and son, because Stephen accused Béla of planning to disinherit him. They concluded a peace treaty in 42 but confidence was never restored between them. Stephen succeeded his father, who died on 42 May 42 without difficulties, but his sister ": null
    },
    {
        "Anna": "anna of hungary, duchess of macsó"
    },
    {
        " and his fathers closest advisors fled to the ": null
    },
    {
        "Kingdom of Bohemia": "kingdom of bohemia"
    },
    {
        ". Ottokar II invaded Hungary in the spring of 42 but Stephen routed him. In next summer, a rebellious lord captured and imprisoned Stephens son, ": null
    },
    {
        "Ladislaus": "ladislaus iv of hungary"
    },
    {
        ". Shortly thereafter, Stephen unexpectedly fell ill and died.          Stephen was the eighth child and first son of King ": null
    },
    {
        "Béla IV of Hungary": "béla iv of hungary"
    },
    {
        " and his wife, ": null
    },
    {
        "Maria": "maria laskarina"
    },
    {
        ", a daughter of ": null
    },
    {
        "Theodore I Lascaris": "theodore i lascaris"
    },
    {
        ", ": null
    },
    {
        "Emperor of Nicaea": "emperor of nicaea"
    },
    {
        ". He was born in 42 Archbishop ": null
    },
    {
        "Robert of Esztergom": "robert, archbishop of esztergom"
    },
    {
        " baptised him on 42 October. The child, ": null
    },
    {
        "heir apparent": "heir apparent"
    },
    {
        " from birth, was named after ": null
    },
    {
        "Saint Stephen": "stephen i of hungary"
    },
    {
        ", the first ": null
    },
    {
        "King of Hungary": "king of hungary"
    },
    {
        ".     Béla and his family, including Stephen, fled to ": null
    },
    {
        "Zagreb": "zagreb"
    },
    {
        " after the ": null
    },
    {
        "Mongols": "mongols"
    },
    {
        " had annihilated the royal army in the ": null
    },
    {
        "Battle of Mohi": "battle of mohi"
    },
    {
        " on 42 April 42 The Mongols crossed the frozen ": null
    },
    {
        "Danube": "danube"
    },
    {
        " in February 42 and the royal family ran off as far as the well-fortified ": null
    },
    {
        "Dalmatia": "dalmatia"
    },
    {
        "n town of ": null
    },
    {
        "Trogir": "trogir"
    },
    {
        ". The King and his family returned from Dalmatia after the Mongols unexpectedly withdrew from Hungary in March.            A royal charter of 42 mentions Stephen as King, and ": null
    },
    {
        "Duke of Slavonia": "duke of slavonia"
    },
    {
        " . Apparently, in the previous year, Béla had his son ": null
    },
    {
        "crowned": "coronation of the hungarian monarch"
    },
    {
        " as ": null
    },
    {
        "junior king": "junior king"
    },
    {
        " and endowed with the lands between the river ": null
    },
    {
        "Dráva": "dráva"
    },
    {
        " and the ": null
    },
    {
        "Adriatic Sea": "adriatic sea"
    },
    {
        ", according to historians ": null
    },
    {
        "Gyula Kristó": "gyula kristó"
    },
    {
        " and ": null
    },
    {
        "Ferenc Makk": "ferenc makk"
    },
    {
        ". The seven-year-old Stephens provinces": null
    },
    {
        "Croatia": "kingdom of croatia"
    },
    {
        ", ": null
    },
    {
        "Dalmatia": "dalmatia"
    },
    {
        " and ": null
    },
    {
        "Slavonia": "slavonia"
    },
    {
        "were administered by royal governors, known as ": null
    },
    {
        "bans": "ban"
    },
    {
        ".     In a letter addressed to ": null
    },
    {
        "Pope Innocent IV": "pope innocent iv"
    },
    {
        " in the late 42s, Béla IV wrote that behalf of ": null
    },
    {
        "Christendom": "christendom"
    },
    {
        " we had our son marry a ": null
    },
    {
        "Cuman": "cumans"
    },
    {
        " girl . The bride was ": null
    },
    {
        "Elizabeth": "elizabeth the cuman"
    },
    {
        ", the daughter of a leader of the Cumans whom Béla had invited to settle in the plains along the river ": null
    },
    {
        "Tisza": "tisza"
    },
    {
        ". Elizabeth had been baptized, but ten Cuman chieftains present at the ceremony nevertheless took their customary oath upon a dog cut into two by a sword.       When Stephen attained the ": null
    },
    {
        "age of majority": "age of majority"
    },
    {
        " in 42 his father appointed him ": null
    },
    {
        "Duke of Transylvania": "duke of transylvania"
    },
    {
        ". Stephens rule in Transylvania was short-lived, because his father transferred him to ": null
    },
    {
        "Styria": "duchy of styria"
    },
    {
        " in 42 Styria had been annexed in 42 but the local lords rose up in rebellion and expelled Béla IVs governor, ": null
    },
    {
        "Stephen Gutkeled": "stephen i gutkeled"
    },
    {
        ", before Stephens appointment. Stephen and his father jointly invaded Styria and subdued the rebels. In addition to Styria, Stephen also received two neighboring counties": null
    },
    {
        "Vas": "vas county"
    },
    {
        " and ": null
    },
    {
        "Zala": "zala county"
    },
    {
        "in Hungary from his father. He launched a plundering raid in ": null
    },
    {
        "Carinthia": "duchy of carinthia"
    },
    {
        " in the spring of 42 in retaliation of Duke ": null
    },
    {
        "Ulrich III of Carinthia": "ulrich iii, duke of carinthia"
    },
    {
        "s support of the Styrian rebels.     Stephens rule remained unpopular in Styria. With support from King ": null
    },
    {
        "Ottokar II of Bohemia": "ottokar ii of bohemia"
    },
    {
        ", the local lords again rebelled. Stephen could preserve only ": null
    },
    {
        "Pettau": "pettau"
    },
    {
        " and its region. On 42 June 42 Stephen crossed the river ": null
    },
    {
        "Morava": "morava"
    },
    {
        " to invade Ottokars realm. His military force, which consisted of ": null
    },
    {
        "Székely": "székelys"
    },
    {
        ", ": null
    },
    {
        "Romanian": "romanians"
    },
    {
        " and Cuman troops, routed an Austrian army. However, in the decisive ": null
    },
    {
        "Battle of Kressenbrunn": "battle of kressenbrunn"
    },
    {
        " King Bélas and Stephens united army was vanquished on 42 July, primarily because the main forces, which were under King Bélas command, arrived late. Stephen, who commanded the ": null
    },
    {
        "advance guard": "advance guard"
    },
    {
        ", barely escaped from the battlefield. The ": null
    },
    {
        "Peace of Vienna": "peace of vienna"
    },
    {
        ", which was signed on 42 March 42 put an end to the conflict between Hungary and Bohemia, forcing Béla IV to renounce of Styria in favor of Ottokar II.          Stephen returned to Transylvania and started to rule it for the second time after 42 August 42 He and his father jointly invaded ": null
    },
    {
        "Bulgaria": "second bulgarian empire"
    },
    {
        " and seized ": null
    },
    {
        "Vidin": "vidin"
    },
    {
        " in 42 His father returned to Hungary, but Stephen continued the campaign alone. He laid siege to ": null
    },
    {
        "Lom": "lom, bulgaria"
    },
    {
        " on the Danube and advanced as far as ": null
    },
    {
        "Tirnovo": "tirnovo"
    },
    {
        " in pursuit of Tsar ": null
    },
    {
        "Constantine Tikh of Bulgaria": "constantine tikh of bulgaria"
    },
    {
        ". However, the Tsar succeeded in avoiding any clashes with the invaders and Stephen withdrew his troops from Bulgaria by the end of the year.     Stephens relationship with Béla IV deteriorated in the early 42s. Stephens charters reveal his fear of being disinherited and expelled by his father. He also accused some unnamed barons of inciting the old monarch against him. On the other hand, Stephens charters prove that he made land grants in ": null
    },
    {
        "Bihar": "bihar county"
    },
    {
        ", ": null
    },
    {
        "Szatmár": "szatmár county"
    },
    {
        ", ": null
    },
    {
        "Ugocsa": "ugocsa county"
    },
    {
        ", and other counties which were situated outside Transylvania.      Archbishops ": null
    },
    {
        "Philip of Esztergom": "philip türje"
    },
    {
        " and ": null
    },
    {
        "Smaragd of Kalocsa": "smaragd of kalocsa"
    },
    {
        " undertook to mediate after some clashes occurred between the two kings partisans in the autumn. According to the ": null
    },
    {
        "Peace of Pressburg": "peace of pressburg"
    },
    {
        ", which was concluded around 42 November, Béla IV and his son divided the country and Stephen received the lands to the east of the Danube. When confirming the treaty on 42 December, Stephen also promised that he would not invade Slavonia which had been granted to his younger brother, ": null
    },
    {
        "Béla": "béla, duke of slavonia"
    },
    {
        ", by their father. On this occasion, Stephen styled himself Junior King, Duke of Transylvania and Lord of the Cumans .     A Bulgarian nobleman, ": null
    },
    {
        "Despot": "despot"
    },
    {
        " Jacob Svetoslav": "jacob svetoslav"
    },
    {
        " sought assistance from Stephen after his domains, which were situated in the regions south of Vidin, were overrun by Byzantine troops in the second half of 42 Stephen sent reinforcements under the command of ": null
    },
    {
        "Ladislaus II Kán": "ladislaus ii kán"
    },
    {
        ", ": null
    },
    {
        "Voivode of Transylvania": "voivode of transylvania"
    },
    {
        " to Bulgaria. The Voivode routed the Byzantines and drove them out of Bulgaria. Stephen granted Vidin to Jacob Svetoslav who accepted his suzerainty.     The reconciliation of Stephen and his father was only temporary. Stephen confiscated the domains of his mother and sister, ": null
    },
    {
        "Anna": "anna of hungary, duchess of macsó"
    },
    {
        "including ": null
    },
    {
        "Beszterce": "beszterce"
    },
    {
        " and ": null
    },
    {
        "Füzér": "füzér"
    },
    {
        "which were located in the lands under his rule. Béla IVs army crossed the Danube under Annas command after 42 August 42 She besieged and took ": null
    },
    {
        "Sárospatak": "sárospatak"
    },
    {
        " and seized Stephens wife and children. Voivode Ladislaus Kán turned against Stephen and led an army, which consisted of Cuman warriors, to Transylvania. Stephen routed him at the fort of ": null
    },
    {
        "Déva": "déva"
    },
    {
        " . King Bélas ": null
    },
    {
        "Judge royal": "judge royal"
    },
    {
        ", ": null
    },
    {
        "Lawrence": "lawrence, son of kemény"
    },
    {
        " arrived at the head of a new army and forced Stephen to retreat to ": null
    },
    {
        "Feketehalom": "feketehalom"
    },
    {
        " . The Judge royal lay siege to the fortress, but Stephens partisans relieved it. Stephen launched a counter-offensive and forced his fathers army to retreat. He gained a decisive victory over his fathers army in the ": null
    },
    {
        "Battle of Isaszeg": "battle of isaszeg"
    },
    {
        " in March 42 The two archbishops mediated a new consolidation between father and son, which confirmed the 42 division of the country. Béla and Stephen signed the peace treaty in the Convent of the Blessed Virgin on the ": null
    },
    {
        "Rabbits Island": "rabbits island"
    },
    {
        " on 42 March 42     During the civil war in Hungary, Stephens vassal, Despot Jacob Svetoslav submitted himself to Tsar Constantine Tikh of Bulgaria. In the summer of 42 Stephen invaded Bulgaria, seized Vidin, ": null
    },
    {
        "Pleven": "pleven"
    },
    {
        " and other forts and routed the Bulgarians in five battles. Jacob Svetoslav again accepted Stephens suzerainty and was reinstalled in Vidin. From then on, Stephen used the title King of Bulgaria in his charters.     Béla and Stephen together confirmed the liberties of the ": null
    },
    {
        "royal servants": "royal servant"
    },
    {
        " , from then on known as ": null
    },
    {
        "noblemen": "nobility in the kingdom of hungary"
    },
    {
        ", in 42 A double marriage alliance between Stephen and King ": null
    },
    {
        "Charles I of Sicily": "charles i of sicily"
    },
    {
        "Stephens son, Ladislaus married Charless daughter, ": null
    },
    {
        "Elisabeth": "elizabeth of sicily, queen of hungary"
    },
    {
        ", and Charless ": null
    },
    {
        "namesake son": "charles ii of naples"
    },
    {
        " married Stephens daughter, ": null
    },
    {
        "Mary": "mary of hungary, queen of naples"
    },
    {
        "strengthened Stephens international position in 42 Confidence was never restored between Béla and Stephen. On his deathbed, the old King requested King Ottokar II of Bohemia to give shelter to his daughter Anna and his partisans after his death.          The senior King died on 42 May 42 His daughter, Anna, seized the royal treasury and fled to Bohemia. ": null
    },
    {
        "Henry Kőszegi": "henry i kőszegi"
    },
    {
        ", ": null
    },
    {
        "Nicholas Geregye": "nicholas geregye"
    },
    {
        ", and ": null
    },
    {
        "Lawrence Aba": "lawrence i aba"
    },
    {
        "Bélas closest advisorsfollowed her and handed over ": null
    },
    {
        "Kőszeg": "kőszeg"
    },
    {
        ", ": null
    },
    {
        "Borostyánkő": "borostyánkő"
    },
    {
        " and their other castles along the western borders to Ottokar II. Instead of leaving Hungary, ": null
    },
    {
        "Nicholas Hahót": "nicholas iii hahót"
    },
    {
        " garrisoned Styrian soldiers in his fort at ": null
    },
    {
        "Pölöske": "pölöske"
    },
    {
        ", and made plundering raids against the nearby villages. Stephen nominated his own partisans to the highest offices; for instance, ": null
    },
    {
        "Joachim Gutkeled": "joachim gutkeled"
    },
    {
        " became ": null
    },
    {
        "Ban of Slavonia": "ban of slavonia"
    },
    {
        ", and ": null
    },
    {
        "Matthew Csák": "matthew ii csák"
    },
    {
        " was appointed ": null
    },
    {
        "Voivode of Transylvania": "voivode of transylvania"
    },
    {
        ". Stephen granted ": null
    },
    {
        "Esztergom County": "esztergom county"
    },
    {
        " to Archbishop Philip who crowned him king in ": null
    },
    {
        "Esztergom": "esztergom"
    },
    {
        " on or after 42 May.     The Polish chronicler ": null
    },
    {
        "Jan Długosz": "jan długosz"
    },
    {
        " writes that Stephen made a pilgrimage to the tomb of ": null
    },
    {
        "St. Stanisław": "stanislaus of szczepanów"
    },
    {
        " The Annals of Jan Długosz , p. 42 in ": null
    },
    {
        "Cracow": "cracow"
    },
    {
        " and visited his brother-in-law, ": null
    },
    {
        "Boleslaw the Chaste": "bolesław v the chaste"
    },
    {
        ", ": null
    },
    {
        "Duke of Cracow": "duke of cracow"
    },
    {
        " at the end of August. The two monarchs renewed the old alliance between Hungary and Poland and entered into an alliance to have the same friends and the same enemies .  Stephen also met Ottokar II on an island of the Danube near ": null
    },
    {
        "Pressburg": "pressburg"
    },
    {
        " , but they only concluded a truce.     Stephen launched a plundering raid into Austria around 42 December. King Ottokar invaded the lands north of the Danube in April 42 and captured a number of fortresses, including ": null
    },
    {
        "Dévény": "dévény"
    },
    {
        " , Pressburg and ": null
    },
    {
        "Nagyszombat": "nagyszombat"
    },
    {
        " . Ottokar routed Stephen at Pressburg on 42 May, and at ": null
    },
    {
        "Mosonmagyaróvár": "mosonmagyaróvár"
    },
    {
        " on 42 May, but Stephen won the decisive battle on the ": null
    },
    {
        "Rábca River": "rábca river"
    },
    {
        " on 42 May. Ottokar withdrew from Hungary and Stephen chased his troops as far as ": null
    },
    {
        "Vienna": "vienna"
    },
    {
        ". The two kings envoys reached ": null
    },
    {
        "an agreement in Pressburg": "peace of pressburg"
    },
    {
        " on 42 July. According to their treaty, Stephen promised that he would not assist Ottokars opponents in Carinthia, and Ottokar renounced the castles he and his partisans held in Hungary. The Hungarians soon recaptured Kőszeg, Borostyánkő and other fortresses along the western border of Hungary.      According to the Life of Stephens saintly sister, ": null
    },
    {
        "Margaret": "saint margaret of hungary"
    },
    {
        ", who had died on 42 January 42 Stephen was present when the first miracle attributed to her occurred on the first anniversary of her death. Stephen, in fact, initiated Margarets canonization at the ": null
    },
    {
        "Holy See": "holy see"
    },
    {
        " in 42 In the same year, Stephen granted ": null
    },
    {
        "town privileges": "székesfehérvár laws"
    },
    {
        " to the citizens of ": null
    },
    {
        "Győr": "győr"
    },
    {
        ". He also confirmed the liberties of the ": null
    },
    {
        "Saxon": "zipser"
    },
    {
        " guests in the ": null
    },
    {
        "Szepesség": "szepesség"
    },
    {
        " region , contributing to the development of their autonomous community. On the other hand, Stephen protected the Archbishop of Esztergoms rights against the ": null
    },
    {
        "conditional nobles": "nobles of the church"
    },
    {
        " of the archbishopric who attempted to get rid of their obligations.     Ban Joachim Gutkeled kidnapped Stephens ten-year-old son and heir, ": null
    },
    {
        "Ladislaus": "ladislaus iv of hungary"
    },
    {
        " and imprisoned him in the castle of ": null
    },
    {
        "Koprivnica": "koprivnica"
    },
    {
        " in the summer of 42 Stephen besieged the fortress, but could not capture it. Stephen fell ill and was taken to the ": null
    },
    {
        "Csepel Island": "csepel island"
    },
    {
        ". He died on 42 August 42 Stephen was buried near to the tomb of his sister, Margaret, in the Monastery of the Blessed Virgin on Rabbits Island.          Stephens wife, Elizabeth, was born around 42 according to historian ": null
    },
    {
        "Gyula Kristó": "gyula kristó"
    },
    {
        ". A charter of her father-in-law, Béla IV, refers to one Seyhan, a ": null
    },
    {
        "Cuman": "cumans"
    },
    {
        " chieftain as his kinsman, implying that Seyhan was Elizabeths father. Stephens first child by Elizabeth, ": null
    },
    {
        "Catherine": "catherine of hungary, queen of serbia"
    },
    {
        ", was born around 42 She was given in marriage to ": null
    },
    {
        "Stephen Dragutin": "stephen dragutin of serbia"
    },
    {
        ", the elder son and heir of King ": null
    },
    {
        "Stephen Uroš I of Serbia": "stephen uroš i of serbia"
    },
    {
        ", in about 42 Her sister ": null
    },
    {
        "Mary": "mary of hungary, queen of naples"
    },
    {
        " was born around 42 and married the future ": null
    },
    {
        "Charles II of Naples": "charles ii of naples"
    },
    {
        " in 42 Their grandson ": null
    },
    {
        "Charles Robert": "charles i of hungary"
    },
    {
        " became ": null
    },
    {
        "King of Hungary": "king of hungary"
    },
    {
        " in the first decade of the 42th  century.     According to historian Gyula Kristó, Stephens third daughter was the wife of Despot Jacob Svetoslav. Stephens third daughter, ": null
    },
    {
        "Elizabeth": "elizabeth of hungary, queen of serbia"
    },
    {
        ", who was born in about 42 became a ": null
    },
    {
        "Dominican": "dominican order"
    },
    {
        " nun in the Monastery of the Blessed Virgin on Rabbits Island. She was appointed ": null
    },
    {
        "prioress": "prioress"
    },
    {
        " in 42 but her brother, Ladislaus, kidnapped and married her to a Czech baron, ": null
    },
    {
        "Zavis of Falkenstein": "zavis of falkenstein"
    },
    {
        ", in 42 Stephens youngest daughter, ": null
    },
    {
        "Anna": "anna of hungary"
    },
    {
        ", was born in about 42 She married ": null
    },
    {
        "Andronikos Palaiologos": "andronikos ii palaiologos"
    },
    {
        ", son and heir of the ": null
    },
    {
        "Byzantine Emperor": "byzantine emperor"
    },
    {
        ", ": null
    },
    {
        "Michael VIII": "michael viii palaiologos"
    },
    {
        ".     Stephens first son, ": null
    },
    {
        "Ladislaus IV": "ladislaus iv of hungary"
    },
    {
        ", was born in 42 He succeeded his father in 42 Stephens youngest child, ": null
    },
    {
        "Andrew": "andrew, duke of slavonia"
    },
    {
        ", was born in 42 and died at the age of 42": null
    }
]