[
    {
        "           Strangers and Brothers is a ": null
    },
    {
        "series of novel": "novel sequence"
    },
    {
        "s by ": null
    },
    {
        "C. P. Snow": "c. p. snow"
    },
    {
        ", published between 42 and 42 They deal with – among other things – questions of political and personal ": null
    },
    {
        "integrity": "integrity"
    },
    {
        ", and the mechanics of exercising power.       All eleven novels in the series are narrated by the character Lewis Eliot. The series follows his life and career from humble beginnings in an English provincial town, to reasonably successful London lawyer, to Cambridge don, to wartime service in Whitehall, to senior civil servant and finally retirement.     The New Men deals with the scientific communitys involvement in the development and deployment of nuclear weapons during the Second World War.  The Conscience of the Rich  concerns a wealthy, Anglo-Jewish merchant-banking family.  Time of Hope  and  George Passant  depict the price paid by clever, poor young men to escape their provincial origins.     Snow analyses the professional world, scrutinising microscopic shifts of power within the enclosed settings of a Cambridge college, a Whitehall ministry, a law firm. For example, in the novels set in the Cambridge college , a small, disparate group of men is typically required to reach a collective decision on an important subject. In The Masters, the dozen or so college members elect a new head by majority vote. In The Affair, a small group of dons sets out to correct a possible injustice: they must convince the rest of the college to re-open an investigation into scientific fraud. In both novels, the characters strongly resist letting in the external world, whether it be the press, public opinion, the college Visitor , or outside experts.       The narrative order of the books differs from their publication order.              The books were adapted by the ": null
    },
    {
        "BBC": "bbc"
    },
    {
        " into a 42-episode television series, which began airing in January 42 The series starred ": null
    },
    {
        "Shaughan Seymour": "shaughan seymour"
    },
    {
        " as Lewis, ": null
    },
    {
        "Sheila Ruskin": "sheila ruskin"
    },
    {
        " as his mentally troubled first wife Sheila and ": null
    },
    {
        "Cherie Lunghi": "cherie lunghi"
    },
    {
        " as his second wife Margaret. Other actors of note who took part in the series include ": null
    },
    {
        "Anthony Hopkins": "anthony hopkins"
    },
    {
        ", ": null
    },
    {
        "Nigel Havers": "nigel havers"
    },
    {
        ", ": null
    },
    {
        "Peter Sallis": "peter sallis"
    },
    {
        " and ": null
    },
    {
        "Tom Wilkinson": "tom wilkinson"
    },
    {
        ". The series has been released on ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " in the Region 42 format.     The BBC later adapted the books as a 42-episode Radio 42 Classic Serial, first broadcast in 42 which starred ": null
    },
    {
        "Adam Godley": "adam godley"
    },
    {
        " then ": null
    },
    {
        "David Haig": "david haig"
    },
    {
        " as Lewis, ": null
    },
    {
        "Anastasia Hille": "anastasia hille"
    },
    {
        " as Sheila and ": null
    },
    {
        "Juliet Aubrey": "juliet aubrey"
    },
    {
        " as Margaret.                             ": null
    }
]