[
    {
        "Stranger Than Paradise is a 42 American ": null
    },
    {
        "black-and-white": "black-and-white"
    },
    {
        " absurdist": "absurdism"
    },
    {
        "/": null
    },
    {
        "deadpan": "deadpan"
    },
    {
        " comedy film, written, directed, and co-edited by ": null
    },
    {
        "Jim Jarmusch": "jim jarmusch"
    },
    {
        " and starring jazz musician ": null
    },
    {
        "John Lurie": "john lurie"
    },
    {
        ", former ": null
    },
    {
        "Sonic Youth": "sonic youth"
    },
    {
        " drummer-turned-actor ": null
    },
    {
        "Richard Edson": "richard edson"
    },
    {
        ", and Hungarian-born actress ": null
    },
    {
        "Eszter Balint": "eszter balint"
    },
    {
        ". The film features a minimalist plot in which the main character, Willie, has a cousin from ": null
    },
    {
        "Hungary": "hungary"
    },
    {
        " named Eva. Eva stays with him for ten days before going to ": null
    },
    {
        "Cleveland": "cleveland"
    },
    {
        ". Willie and his friend Eddie eventually go to Cleveland to visit Eva. This film is shot entirely in single long takes with no standard ": null
    },
    {
        "coverage": "camera coverage"
    },
    {
        ".       The film is a three-act story about Willie , who lives in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ", and his interactions with the two other main characters, Eva  and Eddie .     In the first act, Willies cousin Eva comes from ": null
    },
    {
        "Hungary": "peoples republic of hungary"
    },
    {
        " to stay with him for ten days because Aunt Lotte, whom she will be staying with, will be in the hospital. Willie at first makes it clear that he does not want her there. He even orders Eva to speak English for the ten-day period, not Hungarian. However, Willie soon begins to enjoy her company. This becomes especially true when Eva steals food items and a carton of cigarettes from a grocery store, along with a TV dinner for Willie, who smiles and shakes her hand, telling her Youre alright. He ends up buying her a dress, which she dislikes. After ten days, Eva leaves, and Willie is clearly upset to see her go. Eddie, who had met Eva previously, sees her discard the dress right before she goes, but does not tell Willie this.     The second act starts a year later and opens with a long take showing Willie and Eddie winning a large amount of money by cheating at a game of poker. Willie decides, because of all the money they now have, to go to Cleveland to see Eva. However, when they get there they are just as bored as they were in New York. They end up tagging along with Eva and a friend, Billy, to the movies. They play cards with Willie and Evas aunt. They eventually decide to go back to New York.     The final act begins with Willie and Eddie, on their way back to New York, deciding instead to go to ": null
    },
    {
        "Florida": "florida"
    },
    {
        ". They turn around and rescue Eva. The three of them get to Florida and get a room at a motel. The two men leave Eva in the motel room and end up losing all of their money on dog races. Eva wanders outside in the windy bleak rainy afternoon to the beach, which appears not much more appealing than the windy bleak snowy Lake Erie scene in Cleveland from which they fled. When they come back Eva is annoyed. At this point, Willy and Eddie decide to go back and bet on horse races. Willie refuses to let Eva come along, so she goes out on the beach for a walk. Given her flamboyant wide-brimmed straw hat, she is mistaken by a drug carrier to be a dealer waiting to be paid, and is given a large sum of money. She goes back to the motel, leaves some of the money for Willie and Eddie, and writes them a note explaining that she is going to the airport. Willie and Eddie, having won all of their money back at the horse races, return to the motel and find Eva is gone. Willie reads her note and they go to the airport to stop her from leaving. We see Eva conversing with the airline employee about various options for flying to Europe, ending with a mention that there is a plane leaving in 42 minutes for her home city of ": null
    },
    {
        "Budapest": "budapest"
    },
    {
        ". She appears indecisive. When Willie and Eddie get to the airport, Willie conceives a plan: buy a ticket to Budapest, get on the plane, and convince Eva to stay in the United States. The second to last shot shows Eddie outside watching the plane flying overhead, lamenting that Willie was apparently not able to get off the plane and that now both Willie and Eva are headed to Budapest. The final shot, however, shows Eva back at the motel, returning to an empty room, toying with the striped straw hat.       ": null
    },
    {
        "John Lurie": "john lurie"
    },
    {
        " as Willie   ": null
    },
    {
        "Eszter Balint": "eszter balint"
    },
    {
        " as Eva   ": null
    },
    {
        "Richard Edson": "richard edson"
    },
    {
        " as Eddie   Cecillia Stark as Aunt Lotte   Danny Rosen as Billy   ": null
    },
    {
        "Rammellzee": "rammellzee"
    },
    {
        " as Man With Money   ": null
    },
    {
        "Tom DiCillo": "tom dicillo"
    },
    {
        " as Airline Agent   Richard Boes as Factory Worker   ": null
    },
    {
        "Rockets Redglare": "rockets redglare"
    },
    {
        ", Harvey Perr and Brian J. Burchill as Poker Players   ": null
    },
    {
        "Sara Driver": "sara driver"
    },
    {
        " as Girl With Hat   Paul Sloane as Motel Owner       Writer and director ": null
    },
    {
        "Jim Jarmusch": "jim jarmusch"
    },
    {
        " shot his first feature,  Permanent Vacation  as his final thesis while at ": null
    },
    {
        "New York University": "new york university"
    },
    {
        "s film school, and spent the following four years making Stranger than Paradise. At NYU, he had studied under director ": null
    },
    {
        "Nicholas Ray": "nicholas ray"
    },
    {
        ", who had brought him along as his personal assistant for the production of  Lightning over Water , a portrait of Ray that was being filmed by ": null
    },
    {
        "Wim Wenders": "wim wenders"
    },
    {
        ". It was Wenders who granted Jarmusch the leftover film stock from his subsequent film  Der Stand der Dinge  that would enable the young director to shoot the 42-minute short subject film that would become Stranger Than Paradise. This short was released as a standalone film in 42 and shown as Stranger Than Paradise at the 42 ": null
    },
    {
        "International Film Festival Rotterdam": "international film festival rotterdam"
    },
    {
        ". When it was later expanded into a ": null
    },
    {
        "three-act feature": "three-act structure"
    },
    {
        ", that name was appropriated for the feature itself, and the initial segment was renamed The New World .       The film was shown at the ": null
    },
    {
        "Cannes Film Festival": "cannes film festival"
    },
    {
        ", where it won the ": null
    },
    {
        "Caméra dOr": "caméra dor"
    },
    {
        " award for debut films . It also won the ": null
    },
    {
        "Golden Leopard": "golden leopard"
    },
    {
        " and the ": null
    },
    {
        "Prize of the Ecumenical Jury": "prize of the ecumenical jury"
    },
    {
        " – Special Mention at the 42 ": null
    },
    {
        "Locarno International Film Festival": "locarno international film festival"
    },
    {
        ", the ": null
    },
    {
        "Grand Prix": "grand prix"
    },
    {
        " of the ": null
    },
    {
        "Belgian Film Critics Association": "belgian film critics association"
    },
    {
        ", the Special Jury Prize at the ": null
    },
    {
        "Sundance Film Festival": "sundance film festival"
    },
    {
        " in 42 and ": null
    },
    {
        "National Society of Film Critics Award for Best Picture": "national society of film critics award for best picture"
    },
    {
        " of 42 the film went on to win the Kniema Junpo Award for best foreign language film in 42 the award for National Film Registry at the National Film Preservation Board, USA in 42     The film made $42,42 significantly more than its budget of around $42.         The film currently holds a 42% fresh rating on review aggregator Rotten Tomatoes, with an average rating of 42/42 based on 42 critics.     Film critic ": null
    },
    {
        "Pauline Kael": "pauline kael"
    },
    {
        " gave the film a generally positive review.        The film was voted the Best Picture of 42 by the ": null
    },
    {
        "National Society of Film Critics": "national society of film critics"
    },
    {
        ".       Stranger Than Paradise has been released on ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " by ": null
    },
    {
        "The Criterion Collection": "the criterion collection"
    },
    {
        " as its 42th title. The DVD contains a second disc which includes Jarmuschs first film,  Permanent Vacation  . Both films were restored for the DVD release using high-definition digital transfers overseen and sanctioned by the director. Supplementary footage on the second disc includes Kino ’42: Jim Jarmusch, a series of interviews with the cast and crew from both films by a German television program, as well as Some Days in January , a behind-the-scenes ": null
    },
    {
        "Super42": "super-8"
    },
    {
        " film by the directors brother. An accompanying booklet features Jarmuschs 42 essay Some Notes on Stranger Than Paradise as well as critical commentary by Geoff Andrew and ": null
    },
    {
        "J. Hoberman": "j. hoberman"
    },
    {
        " on Stranger Than Paradise and by ": null
    },
    {
        "Luc Sante": "luc sante"
    },
    {
        " on Permanent Vacation.       Stranger Than Paradise broke many conventions of traditional ": null
    },
    {
        "Hollywood": "hollywood"
    },
    {
        " filmmaking, and became a landmark work in modern independent film. According to ": null
    },
    {
        "allmovie": "allmovie"
    },
    {
        ", it is one of the most influential movies of the 42s , and cast a wide shadow over the new generation of independent American filmmakers to come. It is cited for giving an early example of the low-budget independent wave that would dominate the cinematic marketplace a decade later . The success of the film accorded Jarmusch a certain iconic status within ": null
    },
    {
        "arthouse cinema": "arthouse cinema"
    },
    {
        ", as an idiosyncratic and uncompromising  auteur  exuding the aura of urban cool embodied by ": null
    },
    {
        "downtown Manhattan": "downtown manhattan"
    },
    {
        ". In a 42 profile of the director for  The New York Times , critic Lynn Hirschberg declared the film to have permanently upended the idea of independent film as an intrinsically inaccessible avant-garde form .     In 42 Stranger Than Paradise was selected for preservation in the United States ": null
    },
    {
        "National Film Registry": "national film registry"
    },
    {
        " by the ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        " as being culturally, historically, or aesthetically significant . The film was included in ": null
    },
    {
        "Jonathan Rosenbaum": "jonathan rosenbaum"
    },
    {
        "s Alternate 42 which was a response to the ": null
    },
    {
        "American Film Institute": "american film institute"
    },
    {
        "s ": null
    },
    {
        "42 Years...42 Movies": "afis 100 years…100 movies"
    },
    {
        " list. In 42  Entertainment Weekly  ranked the film 42 on their list of The Top 42 Cult Films .  Empire Magazine  put the film at 42 on its list of the 42 greatest independent films of all time.              The film features an original ": null
    },
    {
        "soundtrack": "soundtrack"
    },
    {
        " written by John Lurie, who also stars in the film. The music is performed by The Paradise Quartet, consisting of Jill B. Jaffe , Mary L. Rowell , Kay Stern , and Eugene Moye . The recording engineer for the sessions was Ollie Cotton. The original song ": null
    },
    {
        "I Put a Spell on You": "i put a spell on you"
    },
    {
        " by ": null
    },
    {
        "Screamin Jay Hawkins": "screamin jay hawkins"
    },
    {
        " features prominently in the soundtrack.       ": null
    }
]