[
    {
        "         A straightedge or straight edge is a tool used for drawing straight lines, or checking their straightness. If it has equally spaced markings along its length, it is usually called a ": null
    },
    {
        "ruler": "ruler"
    },
    {
        ".     Straightedges are used in the automotive service and machining industry to check the flatness of machined mating surfaces.     True straightness can in some cases be checked by using a ": null
    },
    {
        "laser line level": "laser line level"
    },
    {
        " as an optical straightedge: it can illuminate an accurately straight line on a flat surface such as the edge of a plank or shelf.     A pair of straightedges called ": null
    },
    {
        "winding stick": "winding stick"
    },
    {
        "s are used in woodworking to amplify twist in pieces of wood.          An idealized straightedge is used in ": null
    },
    {
        "compass-and-straightedge construction": "compass-and-straightedge construction"
    },
    {
        "s in ": null
    },
    {
        "plane geometry": "euclidean geometry"
    },
    {
        ".   It may be used:   Given two points, to draw the line connecting them.   Given a point and a circle, to draw either tangent.   Given two circles, to draw any of their common tangents.   It may not be marked or used together with the ": null
    },
    {
        "compass": "compass"
    },
    {
        " so as to transfer the length of one segment to another.     It is possible to ": null
    },
    {
        "do all compass and straightedge constructions without the straightedge": "mohr-mascheroni theorem"
    },
    {
        ". That is, it is possible, using only a compass, to find the intersection of two lines given two points on each, and to find the tangent points to circles. It is not, however, possible to do all constructions using only a straightedge. It is possible to ": null
    },
    {
        "do them with straightedge alone given one circle and its center": "poncelet–steiner theorem"
    }
]