[
    {
        "      Stuart Alan Kauffman is an American medical doctor, ": null
    },
    {
        "theoretical biologist": "theoretical biology"
    },
    {
        ", and ": null
    },
    {
        "complex system": "complex system"
    },
    {
        "s researcher who studies the ": null
    },
    {
        "origin of life": "origin of life"
    },
    {
        " on Earth. He was a professor at the ": null
    },
    {
        "University of Chicago": "university of chicago"
    },
    {
        ", ": null
    },
    {
        "University of Pennsylvania": "university of pennsylvania"
    },
    {
        ", and ": null
    },
    {
        "University of Calgary": "university of calgary"
    },
    {
        ". He is currently ": null
    },
    {
        "emeritus": "emeritus"
    },
    {
        " professor of biochemistry at the University of Pennsylvania and affiliate faculty at the ": null
    },
    {
        "Institute for Systems Biology": "institute for systems biology"
    },
    {
        ". He has a number of awards including a ": null
    },
    {
        "MacArthur Fellowship": "macarthur fellowship"
    },
    {
        " and a ": null
    },
    {
        "Wiener Medal": "american society for cyberneticswiener and mcculloch awards"
    },
    {
        ".     He is best known for arguing that the complexity of biological systems and organisms might result as much from ": null
    },
    {
        "self-organization": "self-organization"
    },
    {
        " and far-from-equilibrium dynamics as from Darwinian ": null
    },
    {
        "natural selection": "natural selection"
    },
    {
        " as discussed in his book Origins of Order . In 42 and 42 he used random ": null
    },
    {
        "boolean network": "boolean network"
    },
    {
        "s to investigate generic self-organizing properties of gene regulatory networks, proposing that cell types are dynamical attractors in gene regulatory networks and that cell differentiation can be understood as transitions between attractors. Recent evidence suggests that cell types in humans and other organisms are attractors. In 42 he suggested that a zygote may not be able to access all the cell type attractors in its gene regulatory network during development and that some of the developmentally inaccessible cell types might be cancer cell types. This suggested the possibility of cancer differentiation therapy . He also proposed the self-organized emergence of collectively ": null
    },
    {
        "autocatalytic set": "autocatalytic set"
    },
    {
        "s of ": null
    },
    {
        "polymers": "polymers"
    },
    {
        ", specifically ": null
    },
    {
        "peptides": "peptides"
    },
    {
        ", for the origin of molecular reproduction, which have found experimental support.       Kauffman graduated from ": null
    },
    {
        "Dartmouth": "dartmouth college"
    },
    {
        " in 42 was awarded the BA by ": null
    },
    {
        "Oxford University": "oxford university"
    },
    {
        "  in 42 and completed a medical degree at the ": null
    },
    {
        "University of California, San Francisco": "university of california, san francisco"
    },
    {
        " in 42 After completing his internship, he moved into ": null
    },
    {
        "developmental genetics": "developmental genetics"
    },
    {
        " of the fruitfly, holding appointments first at the ": null
    },
    {
        "University of Chicago": "university of chicago"
    },
    {
        " from 42 to 42 the National Cancer Institute from 42 to 42 and then at the ": null
    },
    {
        "University of Pennsylvania": "university of pennsylvania"
    },
    {
        " from 42 to 42 where he rose to Professor of ": null
    },
    {
        "Biochemistry": "biochemistry"
    },
    {
        " and ": null
    },
    {
        "Biophysics": "biophysics"
    },
    {
        ".       Kauffman became known through his association with the ": null
    },
    {
        "Santa Fe Institute": "santa fe institute"
    },
    {
        " , where he was faculty in residence from 42 to 42 and through his work on ": null
    },
    {
        "models": "model"
    },
    {
        " in various areas of ": null
    },
    {
        "biology": "biology"
    },
    {
        ". These included ": null
    },
    {
        "autocatalytic set": "autocatalytic set"
    },
    {
        "s in ": null
    },
    {
        "origin of life": "origin of life"
    },
    {
        " research, ": null
    },
    {
        "gene regulatory network": "gene regulatory network"
    },
    {
        "s in ": null
    },
    {
        "developmental biology": "developmental biology"
    },
    {
        ", and ": null
    },
    {
        "fitness landscape": "fitness landscape"
    },
    {
        "s in ": null
    },
    {
        "evolutionary biology": "evolutionary biology"
    },
    {
        ". With Marc Ballivet, Kauffman holds the founding broad biotechnology patents in ": null
    },
    {
        "combinatorial chemistry": "combinatorial chemistry"
    },
    {
        " and applied ": null
    },
    {
        "molecular evolution": "molecular evolution"
    },
    {
        ", first issued in France in 42 , in England in 42 and later in the US.       In 42 with Ernst and Young, Kauffman started ": null
    },
    {
        "BiosGroup": "biosgroup"
    },
    {
        ", a ": null
    },
    {
        "Santa Fe": "santa fe, new mexico"
    },
    {
        ", ": null
    },
    {
        "New Mexico": "new mexico"
    },
    {
        "-based for-profit company that applied ": null
    },
    {
        "complex systems": "complex systems"
    },
    {
        " methodology to business problems. BiosGroup was acquired by ": null
    },
    {
        "NuTech Solutions": "nutech solutions"
    },
    {
        " in early 42 NuTech was bought by ": null
    },
    {
        "Netezza": "netezza"
    },
    {
        " in 42 and later by IBM.        From 42 to 42 Kauffman held a joint appointment at the ": null
    },
    {
        "University of Calgary": "university of calgary"
    },
    {
        " in Biological Sciences and Physics and Astronomy. He was also an Adjunct Professor in the Department of Philosophy at the ": null
    },
    {
        "University of Calgary": "university of calgary"
    },
    {
        ". He was an iCORE chair and the director of the Institute for Biocomplexity and Informatics. Kauffman was also invited to help launch the Science and Religion initiative at ": null
    },
    {
        "Harvard Divinity School": "harvard divinity school"
    },
    {
        "; serving as Visiting Professor in 42     In January 42 Kauffman became a Finland Distinguished Professor at ": null
    },
    {
        "Tampere University of Technology": "tampere university of technology"
    },
    {
        ", Department of Signal Processing. The appointment ended in December, 42 The subject of the FiDiPro research project is the development of delayed ": null
    },
    {
        "stochastic models": "stochastic calculus"
    },
    {
        " of ": null
    },
    {
        "genetic regulatory network": "genetic regulatory network"
    },
    {
        "s based on ": null
    },
    {
        "gene expression": "gene expression"
    },
    {
        " data at the ": null
    },
    {
        "single molecule": "single-molecule experiment"
    },
    {
        " level.     In January 42 Kauffman joined the ": null
    },
    {
        "University of Vermont": "university of vermont"
    },
    {
        " faculty where he continued his work for two years with UVMs Complex Systems Center.  From early 42 to April 42 Kauffman was a regular contributor to the NPR Blog 42, Cosmos and Culture,  with topics ranging from the life sciences, systems biology, and medicine, to spirituality, economics, and the law . Kauffman is also a regular contributor to Edge.org.       In May 42 Kauffman joined the Institute for Systems Biology, in Seattle Washington. Following the death of his wife, with others, Kauffman cofounded Transforming Medicine: The Elizabeth Kauffman Institute.       In 42 Kauffman with Samuli Niiranen and Gabor Vattay was issued a founding patent  on the poised realm , an apparently new state of matter hovering reversibly between quantum and classical realms.     In 42 Kauffman was invited to help initiate a general a discussion on rethinking economic growth for the United Nations.  He is also currently doing research with ": null
    },
    {
        "University of Oxford": "university of oxford"
    },
    {
        " Professor ": null
    },
    {
        "Teppo Felin": "teppo felin"
    },
    {
        ".      In 42 Kauffman wrote a childrens story: Patrick, Rupert, Sly & Gus Protocells : , a narrative about unprestatable niche creation in the biosphere :.     Fulfilling an early desire to become a playwright, Kauffman also wrote two theatrical plays: The Enlightenment of Reverend Joseph Smith and a play, with ": null
    },
    {
        "Alex Cantarelli": ":it:alex cantarelli"
    },
    {
        " as a co-author, dedicated to the rescue of the Danish Jews in 42 titled The stones would weep .     In 42 exploring the concept that reality consists of both ontologically real Possibles and ontologically real Actuals , Kauffman co-authored, with Ruth Kastner and Michael Epperson: Taking Heisenbergs Potentia Seriously .               Kauffmans NK model defines a ": null
    },
    {
        "combinatorial": "combinatorial"
    },
    {
        " phase space": "phase space"
    },
    {
        ", consisting of every string of length N . For each string in this search space, a ": null
    },
    {
        "scalar": "scalar"
    },
    {
        " value  is defined. If a distance ": null
    },
    {
        "metric": "metric"
    },
    {
        " is defined between strings, the resulting structure is a landscape.     Fitness values are defined according to the specific incarnation of the model, but the key feature of the NK model is that the fitness of a given string S is the sum of contributions from each locus S_i in the string:     : F \\sum_i f,     and the contribution from each locus in general depends on the value of K other loci:     : f f, \\,     where S^i_j are the other loci upon which the fitness of S_i depends.     Hence, the fitness function f is a ": null
    },
    {
        "mapping": "map"
    },
    {
        " between strings of length K  +  42 and scalars, which Weinbergers later work calls fitness contributions . Such fitness contributions are often chosen randomly from some specified probability distribution.     In 42 Weinberger published a detailed analysis  of the case in which 42                          ": null
    }
]