[
    {
        "        Sudovian  is an ": null
    },
    {
        "extinct": "extinct language"
    },
    {
        " Western Baltic language": "western baltic languages"
    },
    {
        " of ": null
    },
    {
        "Northeastern Europe": "northeastern europe"
    },
    {
        ". Closely related to the ": null
    },
    {
        "Old Prussian language": "old prussian language"
    },
    {
        ", it was formerly spoken southwest of the Nemunas river in what is now ": null
    },
    {
        "Lithuania": "lithuania"
    },
    {
        ", east of ": null
    },
    {
        "Galindia": "galindia"
    },
    {
        " and north of ": null
    },
    {
        "Yotvingia": "yotvingians"
    },
    {
        ", and by exiles in ": null
    },
    {
        "East Prussia": "prussia"
    },
    {
        ".               Sudovia and neighboring Galindia were two Baltic tribes or nations mentioned by the Greek geographer ": null
    },
    {
        "Ptolemy": "ptolemy"
    },
    {
        " in the 42nd century AD as Galindai and Soudinoi, . Yotvingian and Sudovian are identical in nature, however the Sudovian tribe is commonly grouped with other East Prussian tribes. In reality, the Yotvingian tribe had close linguistic ties to the East Prussian tribes, though were an independent and rather isolated people nonetheless.     ": null
    },
    {
        "Peter of Dusburg": "peter of dusburg"
    },
    {
        ", in his 42th-century  Chronicon terrae Prussiae , refers to Sudovia and to its inhabitants as Sudovites.     After the district was conquered by the ": null
    },
    {
        "Teutonic Knights": "teutonic knights"
    },
    {
        ", the language died out and its speakers were gradually absorbed by German, Lithuanian and Slavic populations.     The language has six grammatical cases: nominative, vocative, accusative, genitive, dative and locative, and a complex morphology with a variety of ": null
    },
    {
        "moods": "grammatical mood"
    },
    {
        ". It was a frontier dialect of Old Baltic, which preserved many archaic features which had been lost in the Middle Baltic group.     Sudovian was very similar to and mutually intelligible with the archaic ": null
    },
    {
        "Old Prussian language": "old prussian language"
    },
    {
        ", as stated in the introduction to the 42st Old Prussian Catechism :     Die Sudawen aber wiewol ihre rede etwas nyderiger wissen sich doch inn diese preüßnische sprach : wie sie alhie im Catechismo gedruckt ist auch wol zuschicken und vernemen alle wort – But the Sudovians, although their speech is somewhat lower, understand this Prussian language, as it is printed in the Catechism, and they express themselves well and understand every word .     There are also some Sudovian language phrases in Warhafftige Beschreibung der Sudawen auff Samland sambt ihren Bock heyligen und Ceremonien – True Description of the Sudovians in ": null
    },
    {
        "Samland": "sambia peninsula"
    },
    {
        " together with their goat sanctifications and ceremonies – written in the mid42th century by Hieronymus Meletius.     Beigeite beygeyte peckolle.   Kails naussen gnigethe.   Kails poskails ains par antres.   Kellewesze perioth, Kellewesze perioth.   Ocho Moy myle schwante Panike.     ": null
    },
    {
        "John Poliander": "john poliander"
    },
    {
        " wrote in 42 about the Sudovians living near Königsberg, Prussia, that 42 villages used Sudini speech in a 4242 mile stretch of land of the Samland Corner that bears the name of Sudavia. They spoke a language similar to the Old Prussian language, but they used the term gentaras for amber, not the Samlandish term. From him we learn that the Sudovians lived secluded from the Samlandish, that they married within their own tribe, and did not allow intermarriage with the neighbouring Prussian population even if begged . They stubbornly held to their own traditions, and wore finger and ear rings with bronze bells and silver belts. Nothing was imported from abroad, but everything was produced by local craftsmen. ": null
    },
    {
        "Christoph Hartknoch": "christoph hartknoch"
    },
    {
        " reported in 42 that there were still Sudovians there.     The Constit. Synod. Evangel. of 42 contains the following list of deities who were still worshipped by the Sudavians in Samland: Occopirmus, Sualxtix, Ausschauts, Autrympus, Potrympus , Bardoayts, Piluuytis, Parcunas , Pecols ,...     Toponyms from N.E. Poland, N.W. Belarus, and Lithuania also preserve words.   Sudovian was influenced by the ": null
    },
    {
        "Gothic language": "gothic language"
    },
    {
        ", as was Old Prussian. As did other West Baltic dialects, it preserved the nominative singular neuter case ending - absent from Latvian and Lithuanian. In the declension of nouns, five cases are the same as in Old Prussian: nominative, genitive, dative, accusative, vocative. The vocative example Kails naussen gnigethe. is listed above. The noun declension was very conservative and preserved many archaic features.     The Yotvingian territories of Sudovia and Galindia were later overrun and populated by ": null
    },
    {
        "Slavs": "slavs"
    },
    {
        " around present-day ": null
    },
    {
        "Białystok": "białystok"
    },
    {
        " and ": null
    },
    {
        "Suwałki": "suwałki"
    },
    {
        " in north-eastern ": null
    },
    {
        "Poland": "poland"
    },
    {
        " and nearby ": null
    },
    {
        "Hrodna": "hrodna"
    },
    {
        " in ": null
    },
    {
        "Belarus": "belarus"
    },
    {
        ". Some elements of Baltic speech are still retained in the Belarus and ": null
    },
    {
        "Ukraine": "ukraine"
    },
    {
        " territory, owing to the sparse indigenous populations and resettlements of refugees from Lithuania. The dialect of ": null
    },
    {
        "Zietela": "zietela"
    },
    {
        " was of particular interest. Kazlauskas  suggested that the word mėnas  encountered in dialects  and in the writings of ": null
    },
    {
        "Bretkūnas": "jonas bretkūnas"
    },
    {
        " is a remnant of nouns with the stem suffix -s.       Until the 42s, Yotvingian was chiefly known from toponyms and medieval Russian sources.  But in 42 a monument with Yotvingian writing was discovered by accident. In ": null
    },
    {
        "Belarus": "belarus"
    },
    {
        ", a young man named Vyacheslav Zinov,  an amateur collector, bought a book of Catholic prayers from an old man from  village in the depths of ": null
    },
    {
        "Białowieża Forest": "białowieża forest"
    },
    {
        ", which held a small manuscript titled Pogańskie gwary z Narewu . It was written partly in ": null
    },
    {
        "Polish": "polish language"
    },
    {
        ", and partly in an unknown, pagan language. Unfortunately, Zinovs parents threw away the book. However, before the manuscript was destroyed, Zinov had made notes of it which he sent to ": null
    },
    {
        "Vilnius University": "vilnius university"
    },
    {
        " in 42 Even though Zinovs notes were riddled with errors, it has been proven beyond doubt that the notes are indeed a copy of an authentic Yotvingian text.  Зинкявичюс З. Польско-ятвяжский словарик? , Балто-славянские исследования, 42 — Moscow, Наука, 42 pp. 42—42 ; English-language version, expanded: Zinkevičius, Zigmas, A Polish-Yatvingian vocabulary? In: Linguistic and Oriental studies from Poznań. 42 pp. 4242 According to the first person who analyzed the manuscript, ": null
    },
    {
        "Zigmas Zinkevičius": "zigmas zinkevičius"
    },
    {
        ", this short Yotvingian–Polish dictionary ": null
    }
]