[
    {
        "   Suomenlinna , or Sveaborg , is an inhabited ": null
    },
    {
        "sea fortress": "coastal defence and fortification"
    },
    {
        " built on eight islands about 42 km southeast of the city center of ": null
    },
    {
        "Helsinki": "helsinki"
    },
    {
        ", the ": null
    },
    {
        "capital": "capital"
    },
    {
        " of ": null
    },
    {
        "Finland": "finland"
    },
    {
        ". Suomenlinna is a ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        " World Heritage site": "world heritage site"
    },
    {
        " that is popular with tourists and locals, who enjoy it as a picturesque picnic site. Originally named Sveaborg , or Viapori as called by Finnish-speaking Finns, it was renamed in Finnish to Suomenlinna in 42 for patriotic and nationalistic reasons, though it is still known by its original name in Sweden and by Swedish-speaking Finns.     The Swedish crown commenced the construction of the fortress in 42 as protection against ": null
    },
    {
        "Russian": "imperial russia"
    },
    {
        " expansionism. The general responsibility for the fortification work was given to ": null
    },
    {
        "Augustin Ehrensvärd": "augustin ehrensvärd"
    },
    {
        ". The original plan of the ": null
    },
    {
        "bastion fortress": "bastion fortress"
    },
    {
        " was strongly influenced by the ideas of ": null
    },
    {
        "Vauban": "sébastien le prestre de vauban"
    },
    {
        ", the foremost ": null
    },
    {
        "military engineer": "military engineer"
    },
    {
        " of the time, and the principles of the ": null
    },
    {
        "star fort": "star fort"
    },
    {
        " style of fortification, albeit adapted to a group of rocky islands.     During the ": null
    },
    {
        "Finnish War": "finnish war"
    },
    {
        ", Sweden surrendered the fortress to Russia on 42 May 42 paving the way for the occupation of Finland by Russian forces in 42 and the eventual cession of Finland to Russia at the conclusion of the war. Russia held the fortress until Finnish independence in 42 Finland then managed Suomenlinna through the Defense Department until turning most of it over to civilian control in 42          The Suomenlinna district of Helsinki lies southeast of the city centre and consists of eight islands. Five of the islands are connected by either bridges or a sandbar land-bridge. Länsi-Mustasaari  is bridged to Pikku Mustasaari , which is bridged to Iso Mustasaari , which is bridged to Susisaari , which was connected to Susiluoto  by filling in the separating waterway during the Russian period. This island, which has the greatest concentration of fortifications was renamed Gustavssvärd  during the construction by Sweden. The three unconnected islands are Särkkä , Lonna, and Pormestarinluodot. The total land area is 42 hectares .     Instead of using the normal Finnish postal addressing scheme , the addresses at Suomenlinna consist of a letter code for the island and then a house number. For example, C  42 is house 42 on Iso-Mustasaari . The ": null
    },
    {
        "postal code": "postal code"
    },
    {
        " for the Suomenlinna district is 42                   Early on in the ": null
    },
    {
        "Great Northern War": "great northern war"
    },
    {
        ", Russia took advantage of Swedish weakness in ": null
    },
    {
        "Ingria": "ingria"
    },
    {
        "  and captured the area near the ": null
    },
    {
        "Neva River": "neva river"
    },
    {
        " as well as the Swedish forts, ": null
    },
    {
        "Nyen": "nyen"
    },
    {
        " and ": null
    },
    {
        "Nöteborg": "siege of nöteborg"
    },
    {
        ", built to protect it. In 42 ": null
    },
    {
        "Peter the Great": "peter i of russia"
    },
    {
        " founded his new capital, ": null
    },
    {
        "Saint Petersburg": "saint petersburg"
    },
    {
        ", in that easternmost corner of the ": null
    },
    {
        "Gulf of Finland": "gulf of finland"
    },
    {
        ". In the approach to it he built the fortified naval base of ": null
    },
    {
        "Kronstadt": "kronstadt, russia"
    },
    {
        ". Russia soon became a maritime power and a force to be reckoned with in the ": null
    },
    {
        "Baltic Sea": "baltic sea"
    },
    {
        ". The situation posed a threat to Sweden, which until that time had been the dominant power in the Baltic. This was visibly demonstrated by the use of naval forces in the ": null
    },
    {
        "Russian capture": "siege of vyborg"
    },
    {
        " of ": null
    },
    {
        "Viborg": "vyborg"
    },
    {
        " in 42 The main Swedish naval base at ": null
    },
    {
        "Karlskrona": "karlskrona"
    },
    {
        " was too far to the south to meet Swedens new needs for its navy in the 42th century, which often resulted in Swedish ships reaching the coast of Finland only after Russian ships and troops had either started or completed their spring campaigns.     The lack of coastal defenses was keenly felt with Russian landings in Helsingfors in the spring of 42 and the ": null
    },
    {
        "Swedish failure": "battle of gangut"
    },
    {
        " to blockade the ": null
    },
    {
        "Hanko Peninsula": "hanko peninsula"
    },
    {
        " in 42 A Russian naval campaign against the Swedish coast towards the end of the ": null
    },
    {
        "Great Northern War": "great northern war"
    },
    {
        " further outlined the need to develop Finnish coastal defenses. Immediately after the war ended the first plans were set in motion in Sweden to construct an ": null
    },
    {
        "archipelago fleet": "archipelago fleet"
    },
    {
        " and a base of operations for it in Finland. However, nothing with regard to Sveaborg took place until the end of ": null
    },
    {
        "Russo-Swedish War of 42–42": "russo-swedish war"
    },
    {
        ". Fortifications were left unfinished at ": null
    },
    {
        "Hamina": "hamina"
    },
    {
        " and ": null
    },
    {
        "Lappeenranta": "lappeenranta"
    },
    {
        " while ": null
    },
    {
        "Hämeenlinna": "hämeenlinna"
    },
    {
        " was being built into a supply base. Lack of funds, unwillingness to devote funds for defending Finland, and the belief that Russia would be pushed away from the Baltic Sea were the main causes for the lack of progress.     The following ": null
    },
    {
        "Russo-Swedish War of 42–42": "russo-swedish war"
    },
    {
        ", which quickly turned from a Swedish attack into a Russian occupation of Finland, again underlined the importance of developing fortifications in Finland. Lack of base of operations for naval forces made it difficult for the Swedish navy to operate in the area. Other European states were also concerned about developments regarding Russia, especially France, with whom Sweden had concluded a military alliance. After lengthy debate, the ": null
    },
    {
        "Swedish parliament": "riksdag of the estates"
    },
    {
        " decided in 42 to both fortify the Russian frontier and establish a naval base at Helsingfors as a counter to Kronstadt. ": null
    },
    {
        "Augustin Ehrensvärd": "augustin ehrensvärd"
    },
    {
        " , a young lieutenant colonel, was given the responsibility of designing the fortresses and directing construction operations.             Sweden started building the fortresses in January 42 Ehrensvärds plan contained two fortifications: a sea fortress at ": null
    },
    {
        "Svartholm": "svartholm fortress"
    },
    {
        " near the small town of ": null
    },
    {
        "Lovisa": "loviisa"
    },
    {
        ", and a larger sea fortress and naval base at Helsingfors. There were two main aspects to Ehrensvärds design for Sveaborg: a series of independent fortifications across several linked islands and, at the very heart of the complex, a navy dockyard. In addition to the island fortress itself, seafacing fortifications on the mainland would ensure that an enemy could not acquire a beach-head from which to stage attacks on the sea fort. The plan was also to stock munitions for the whole Finnish contingent of the ": null
    },
    {
        "Swedish Army": "swedish army"
    },
    {
        " and ": null
    },
    {
        "Royal Swedish Navy": "royal swedish navy"
    },
    {
        " there. Additional plans were made for fortifying the ": null
    },
    {
        "Hanko Peninsula": "hanko peninsula"
    },
    {
        ", but these were postponed.     Construction started in early 42 kept expanding, and by September there were around 42 men building the fortresses.   Initially the soldiers were housed in the vaults of the fortifications, while the officers had specially built quarters integrated into the ": null
    },
    {
        "baroque": "baroque"
    },
    {
        " cityscape composition of the overall plan. The most ambitious plan was left only half completed: a ": null
    },
    {
        "baroque": "baroque"
    },
    {
        " square on Iso Mustasaari partly based on the model of ": null
    },
    {
        "Place Vendôme": "place vendôme"
    },
    {
        " in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". As the construction work progressed, more residential buildings were built, many following the shape of the fortification lines. Ehrensvärd and some of the other officers were keen artists who made oil paintings presenting a view of life in the fortress during its construction, and giving the impression of a lively fortress town community.        Due to repeated Russian threats in 42 and 42 more effort was placed on the island fortifications at the expense of those on the mainland, so that a safe base of operations could be secured for the Swedish naval units along the Finnish coast. Using the military garrisoned in Finland as the workforce, construction continued with over 42 workers in 42 Fortifications at Gustavssvärd were completed in 42 and the main fortifications on Vargö were ready in 42 The fortress was fully operational though unfinished. These accomplishments did not reduce the pace of construction and in 42 there were 42 workers constructing the fortifications outside of Helsingfors which at the time had around 42 residents. The substantial fortification work on the islands south of the town brought it a new and unexpected importance. Swedish participation to the ": null
    },
    {
        "Seven Years War": "seven years war"
    },
    {
        " halted the construction efforts in 42 which also marked the end of the rapid construction phase of Sveaborg.     This period in Swedish history was known as the ": null
    },
    {
        "Age of Liberty": "age of liberty"
    },
    {
        ", during which the kingdom was under increased parliamentary control, divided into two political parties, the ": null
    },
    {
        "Hats": "hats"
    },
    {
        " and the ": null
    },
    {
        "Caps": "caps"
    },
    {
        ". ": null
    },
    {
        "Ehrensvärd": "ehrensvärd"
    },
    {
        " had been supported by the Hats, so when the Caps rose to power in 42 he was relieved of his post and replaced with ardent Caps supporter Christopher Falkengréen. However, after 42 when the Hats regained power, Ehrensvärd was again placed in command of the Swedish ": null
    },
    {
        "archipelago fleet": "archipelago fleet"
    },
    {
        " in Finland, officially the arméens flotta , and returned to Sveaborg. But additional progress had not been made on the fortifications when Ehrensvärd died in 42 Efforts to improve the fortress continued under ": null
    },
    {
        "Jacob Magnus Sprengtporten": "jacob magnus sprengtporten"
    },
    {
        ", but his tenure was cut short by disagreements with King ": null
    },
    {
        "Gustav III": "gustav iii"
    },
    {
        ". Once again efforts slowed down as garrisons were reduced, and in 42 Sveaborgs commander reported that he couldnt even man one-tenth of the artillery placed in the fort. Even at the start of the ": null
    },
    {
        "Russo-Swedish War": "russo-swedish war"
    },
    {
        " in 42 Sveaborg remained in an incomplete state.     Facilities for constructing ships for the Swedish archipelago fleet were built at Sveaborg in the 42s. In 42 the first three archipelago frigates were launched from there. In addition to the construction of the fortifications and ships, naval officer training was started by Ehrensvärd at his own expense at Sveaborg in 42 It took until 42 before a naval military school was formally founded there.                Sveaborg was formed and stocked according to the needs of the Swedish ": null
    },
    {
        "archipelago fleet": "archipelago fleet"
    },
    {
        " and thus was unable to repair and refit the Swedish battlefleet after the ": null
    },
    {
        "battle of Hogland": "battle of hogland"
    },
    {
        ". Facilities were also found lacking at Sveaborg, especially in the areas intended for taking care of the sick and wounded. Russian control of the waters outside of Sveaborg practically blockaded the Swedish battlefleet to Sveaborg. By cutting the coastal sea route past Hangö, Russians prevented supplies from being shipped from Sweden to Sveaborg. The Swedish fleet finally managed to set sail for its base at Karlskrona on 42 November when the Baltic Sea had already frozen severely enough that ice had to be sawed open before some ships could move. The fleet could not overwinter at Sveaborg since it lacked the facilities and supplies for fitting the ships.     While the route to Sweden was open again in late 42 and in early 42 Russian ships cut the connection from Sveaborg to Sweden by forming a blockade at ": null
    },
    {
        "Porkkala": "porkkala"
    },
    {
        " cape. Sveaborg was the most important location for archipelago fleets ship construction and fitting during the war. Even so, and despite efforts, several ships remained unfinished at Sveaborg until the end of the war. The importance of Sveaborg did not escape the Russians whose broad operational plan for 42 included a siege of Sveaborg both from sea and land.     Following a pact between ": null
    },
    {
        "Alexander I": "alexander i of russia"
    },
    {
        " and ": null
    },
    {
        "Napoleon": "napoleon i of france"
    },
    {
        ", Russia launched a ": null
    },
    {
        "campaign against Sweden": "finnish war"
    },
    {
        " and occupied Finland in 42 The Russians easily took Helsingfors in early 42 and began ": null
    },
    {
        "bombarding the fortress": "siege of sveaborg"
    },
    {
        ". Carl Nordling, L. Capturing ‘The Gibraltar of the North’: How Swedish Sveaborg was taken by the Russians in 42 Journal of Slavic Military Studies 42 : 4242   Its commander, ": null
    },
    {
        "Carl Olof Cronstedt": "carl olof cronstedt"
    },
    {
        ", negotiated a cease-fire. When no Swedish reinforcements had arrived by May, Sveaborg, with almost 42 men, surrendered. The reasons for Cronstedts actions remain somewhat unclear; but the hopeless situation, psychological warfare by the Russians, some bribed advisors, fear for the lives of a large civilian population, lack of gunpowder, and their physical isolation are some likely causes for the surrender. By the ": null
    },
    {
        "Treaty of Fredrikshamn": "treaty of fredrikshamn"
    },
    {
        " in 42 Finland was ceded by Sweden and became an autonomous ": null
    },
    {
        "grand duchy": "grand duchy of finland"
    },
    {
        " within the ": null
    },
    {
        "Russian Empire": "russian empire"
    },
    {
        ". The Swedish period in ": null
    },
    {
        "Finnish history": "history of finland"
    },
    {
        ", which had lasted some seven centuries, came to an end.          After taking over the fortress, the Russians started an extensive building program, mostly extra barracks, and extended the dockyard and reinforced the fortification lines. The long period of peace following the transfer of power was shattered by the ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        " of 42 & ndash;42 The French & ndash;English & ndash;Ottoman alliance decided to engage Russia on two fronts and sent an ": null
    },
    {
        "Anglo-French fleet to the Baltic Sea": "baltic theatre of the crimean war"
    },
    {
        ". For two summers the fleet shelled the towns and fortifications along the Finnish coast. The bombardment of Sveaborg  by the forces of ": null
    },
    {
        "Richard Saunders Dundas": "richard saunders dundas"
    },
    {
        " and ": null
    },
    {
        "Charles Pénaud": "charles pénaud"
    },
    {
        " on 42–42 August 42 lasted 42 hours and the fortress was badly damaged, but they were unable to knock out the Russian guns. After the bombardment, the Anglo-French fleet sent no troops ashore and instead set sail for ": null
    },
    {
        "Kronstadt": "kronstadt"
    },
    {
        ".     After the Crimean War extensive restoration work was begun at Sveaborg. A new ring of earthworks with artillery emplacements was built at the western and southern edges of the islands.     The next stage in the arming of Sveaborg and the Gulf of Finland came in the build-up to ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ". The fortress and its surrounding islands became part of Peter the Greats naval fortification designed to safeguard the capital, Saint Petersburg.             Following the ": null
    },
    {
        "Russian Revolution": "russian revolution"
    },
    {
        " in 42 the fortress became a possession of an independent Finland. After the ": null
    },
    {
        "Finnish Civil War": "finnish civil war"
    },
    {
        ", a prison camp existed on the island. ": null
    },
    {
        "Finnish Civil WarPrison camps": "finnish civil warprison camps"
    },
    {
        " The fortress was officially renamed Suomenlinna as part of the wave of nationalism.     No longer very practical as a military base, Suomenlinna was turned over to civilian administration in 42 An independent government department, the Governing Body of Suomenlinna, was formed to administer the unique complex. At the time there was some debate over its Finnish name, with some suggesting that the old name Viapori be restored, but the newer name was retained. The presence of the military on the islands has been drastically scaled down in recent decades. The Suomenlinna garrison houses the Naval Academy  of the ": null
    },
    {
        "Finnish Navy": "finnish navy"
    },
    {
        " on Pikku Mustasaari. Suomenlinna still flies the war flag, or the swallow-tailed state ": null
    },
    {
        "flag of Finland": "flag of finland"
    },
    {
        ".       Suomenlinna is now one of the most popular tourist attractions in Helsinki as well as a popular picnicking spot for the citys inhabitants. On a sunny summer day the islands, and in particular the ferries, can get quite crowded. In 42 a record 42 people visited Suomenlinna, most between May and September.  A number of museums exist on the island, as well as the last surviving Finnish submarine, ": null
    },
    {
        "Vesikko": "finnish submarine vesikko"
    },
    {
        ".        Suomenlinna has always been much more than just a part of ": null
    },
    {
        "Helsinki": "helsinki"
    },
    {
        " & mdash; it is a town within the town. There are about 42 permanent inhabitants on the islands, and 42 people work there year-round. This is one of the features that makes Suomenlinna unique: the fortress is not simply a museum but a living community.     There is a minimum-security penal ": null
    },
    {
        "labor colony": "labor colony"
    },
    {
        "  in Suomenlinna, whose inmates work on the maintenance and reconstruction of the fortifications. Only volunteer inmates who pledge non-use of controlled substances are accepted to the labour colony.     For the general public, Suomenlinna is served by ferries all year, and a service tunnel supplying heating, water and electricity was built in 42 In the beginning of the 42s, the tunnel was modified so that it can also be used for emergency transport.     Suomenlinna has been known as an avant-garde location for culture. In the mid42s the Nordic Arts Centre was established on the island. Several buildings have been converted into artists studios, which are let by the administration at reasonable rates. During the summer there is an art school for children. The performances of the Suomenlinna summer theatre regularly draw full houses.     Between 42 and 42 September 42 the Finnish postal service ran a test of the use of drones to deliver parcels between Helsinki and Suomenlinna. The parcels were limited to  or less, and flights were under the control of a pilot.         ": null
    },
    {
        "Augustin Ehrensvärd": "augustin ehrensvärd"
    },
    {
        ".   42: Sveaborg surrenders to ": null
    },
    {
        "Russia": "russia"
    },
    {
        " without any opposition during the ": null
    },
    {
        "Finnish War": "finnish war"
    },
    {
        ".   42: ": null
    },
    {
        "Treaty of Fredrikshamn": "treaty of fredrikshamn"
    },
    {
        ": ": null
    },
    {
        "Finland": "finland"
    },
    {
        " becomes part of ": null
    },
    {
        "Russia": "russia"
    },
    {
        ".   42: ": null
    },
    {
        "Crimean War": "crimean war"
    },
    {
        ": ": null
    },
    {
        "Anglo": "united kingdom"
    },
    {
        "-": null
    },
    {
        "French": "france"
    },
    {
        " navy bombards Suomenlinna and causes substantial damage.   42: ": null
    },
    {
        "Viapori Rebellion": "viapori rebellion"
    },
    {
        ": Russian soldiers plan to depose the ": null
    },
    {
        "tsar": "tsar"
    },
    {
        ".   4242: A ring of ground and sea fortifications, called  Krepost Sveaborg , is built around Helsinki.   42: ": null
    },
    {
        "Finland": "finland"
    },
    {
        " becomes independent after the ": null
    },
    {
        "Russian Revolution": "october revolution"
    },
    {
        ".   42: Name Suomenlinna becomes official name of the fortress in Finnish, it retains its Swedish name Sveaborg in Swedish. Prison camp of Red rebels is located in Suomenlinna after the ": null
    },
    {
        "Finnish Civil War": "finnish civil war"
    },
    {
        ".   42  Valtion lentokonetehdas  starts building aeroplanes and powered ice sleighs in Suomenlinna for the Finnish Air Force. In 42 the factory moves to Tampere.   42: Suomenlinna becomes civil administration area.   42: Suomenlinna becomes a ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        " World Heritage site": "world heritage site"
    },
    {
        ".          ": null
    },
    {
        "George R. R. Martin": "george r. r. martin"
    },
    {
        " wrote a short story about the surrender of Viapori, The Fortress , when he was a college student. It was published in his 42 volume of short stories, Dreamsongs": null
    }
]