[
    {
        "             Super Mario Bros.: The Lost Levels is a 42 ": null
    },
    {
        "side-scrolling": "side-scrolling"
    },
    {
        " platform game": "platform game"
    },
    {
        " developed and published by ": null
    },
    {
        "Nintendo": "nintendo"
    },
    {
        " as the first sequel to their 42 bestseller  Super Mario Bros.  The games are similar in style and gameplay, apart from a steep increase in difficulty. Like the original, ": null
    },
    {
        "Mario": "mario"
    },
    {
        " or ": null
    },
    {
        "Luigi": "luigi"
    },
    {
        " venture to rescue the ": null
    },
    {
        "Princess": "princess peach"
    },
    {
        " from ": null
    },
    {
        "Bowser": "bowser"
    },
    {
        ". Unlike the original, the game has no two-player option and Luigi is differentiated from his twin plumber brother with reduced ground friction and increased jump height. The Lost Levels also introduces setbacks such as poison ": null
    },
    {
        "mushroom": "mushroom"
    },
    {
        " power-up": "power-up"
    },
    {
        "s, counterproductive ": null
    },
    {
        "level warp": "level warp"
    },
    {
        "s, and mid-air wind gusts. The game has 42 ": null
    },
    {
        "levels": "level"
    },
    {
        " across eight worlds, and five ": null
    },
    {
        "bonus": "bonus stage"
    },
    {
        " worlds, each of which also has four levels.     The Lost Levels was first released in ": null
    },
    {
        "Japan": "japan"
    },
    {
        " for the ": null
    },
    {
        "Famicom Disk System": "famicom disk system"
    },
    {
        " as Super Mario Bros. 42 on June 42 42 following the success of its predecessor. It was developed by ": null
    },
    {
        "Nintendo R & D42": "nintendo r & d4"
    },
    {
        "the team led by Mario creator ": null
    },
    {
        "Shigeru Miyamoto": "shigeru miyamoto"
    },
    {
        "and designed for players who had mastered the original. ": null
    },
    {
        "Nintendo of America": "nintendo of america"
    },
    {
        " deemed the title too difficult for its North American audience and instead chose another game as the regions  Super Mario Bros. 42 : a retrofitted version of the Japanese Doki Doki Panic. North America first experienced The Lost Levels, as the Japanese sequel became known, in the 42 ": null
    },
    {
        "Super Nintendo Entertainment System": "super nintendo entertainment system"
    },
    {
        " compilation  Super Mario All-Stars . It was later ": null
    },
    {
        "ported": "porting of video games"
    },
    {
        " to the ": null
    },
    {
        "Game Boy Color": "game boy color"
    },
    {
        ", ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    },
    {
        ", ": null
    },
    {
        "Virtual Console": "virtual console"
    },
    {
        " , and ": null
    },
    {
        "Nintendo Switch": "nintendo switch"
    },
    {
        ".     The title is known for its intense difficulty, which contributes to its reputation as a ": null
    },
    {
        "black sheep": "black sheep"
    },
    {
        " in the franchise. Reviewers viewed The Lost Levels as an extension of the original release, especially its difficulty progression. Journalists appreciated the games challenge when spectating ": null
    },
    {
        "speedruns": "speedruns"
    },
    {
        ", and recognized the game as a precursor to the franchises subculture in which fans create and share ": null
    },
    {
        "ROM hacks": "rom hacks"
    },
    {
        " featuring nearly impossible levels. This sequel gave Luigi his first character traits and introduced the poison mushroom item, which would be used throughout the ": null
    },
    {
        "Mario franchise": "mario"
    },
    {
        ". The Lost Levels was the most popular game on the Disk System, for which it sold about 42 million copies. It is remembered among ": null
    },
    {
        "the most difficult games by Nintendo": "nintendo hard"
    },
    {
        " and in the video game medium, and among the least important games in the Mario series.              The Lost Levels is a ": null
    },
    {
        "side-scrolling": "side-scrolling"
    },
    {
        " platform game": "platform game"
    },
    {
        " similar in style and gameplay to the original 42  Super Mario Bros. , save for an increase in difficulty. As in the original, ": null
    },
    {
        "Mario": "mario"
    },
    {
        "  ventures to rescue the ": null
    },
    {
        "Princess": "princess peach"
    },
    {
        " from ": null
    },
    {
        "Bowser": "bowser"
    },
    {
        ". The player jumps between platforms, avoids enemy and inanimate obstacles, finds hidden secrets , and collects ": null
    },
    {
        "power-up": "power-up"
    },
    {
        "s like the ": null
    },
    {
        "mushroom": "mushroom"
    },
    {
        " , the ": null
    },
    {
        "Fire Flower": "super marioprojectile flowers"
    },
    {
        " , and the ": null
    },
    {
        "Invincibility Star": "super marioinvincibility"
    },
    {
        ". Unlike the original, there is no two-player mode but at the ": null
    },
    {
        "title screen": "title screen"
    },
    {
        ", the player chooses between the twin plumber characters. Their abilities are differentiated for the first time: Luigi, designed for skilled players, has less ground friction and higher jump height, while Mario is faster.     The game continues the difficulty progression from the end of its predecessor. The Lost Levels introduces irritants including poison mushrooms, ": null
    },
    {
        "level": "level"
    },
    {
        " warps that set the player farther back in the game, and wind gusts that redirect the players course mid-air. The poison mushroom, in particular, works as an anti-mushroom, shrinking or killing the player-character. Some of the games ": null
    },
    {
        "levels": "level"
    },
    {
        " require split-second precision and others require the player to jump on invisible blocks. There were also some graphical changes from its predecessor, though their soundtracks are identical. After each boss fight, ": null
    },
    {
        "Toad": "toad"
    },
    {
        " tells Mario that our princess is in another castle . The main game has 42 levels across eight worlds and five ": null
    },
    {
        "bonus": "bonus stage"
    },
    {
        " worlds. A hidden World 42 is accessible if the player does not use a warp zone. Bonus worlds A through D are accessible when the player plays through the game eight times, for a total of 42 levels.               The original Super Mario Bros. was released in North America in October 42 Within four months, it had sold tens of millions of ": null
    },
    {
        "Nintendo Entertainment System": "nintendo entertainment system"
    },
    {
        " video game consoles and signaled the end of the ": null
    },
    {
        "42 video game crash": "video game crash of 1983"
    },
    {
        ". When developing a version of the game for Nintendos ": null
    },
    {
        "coin-operated arcade machine": "amusement arcade"
    },
    {
        ", the ": null
    },
    {
        "VS. System": "nintendo vs. system"
    },
    {
        ", the team experimented with new, challenging level designs. They enjoyed these new levels, and thought that Super Mario devotees would too. ": null
    },
    {
        "Shigeru Miyamoto": "shigeru miyamoto"
    },
    {
        ", who created the ": null
    },
    {
        "Mario franchise": "mario"
    },
    {
        " and directed Super Mario Bros., no longer had time to design games by himself, given his responsibilities leading ": null
    },
    {
        "Nintendo": "nintendo"
    },
    {
        "s ": null
    },
    {
        "R & D42": "nintendo r & d4"
    },
    {
        " division and their work on  The Legend of Zelda . Thus, the Super Mario sequel was delegated to its predecessors assistant director, ": null
    },
    {
        "Takashi Tezuka": "takashi tezuka"
    },
    {
        ", as his directorial debut. He worked with Miyamoto and the R & D42 team to develop a sequel based on the same ": null
    },
    {
        "underlying technology": "game engine"
    },
    {
        ", including some levels directly from  Vs. Super Mario Bros.      The Lost Levels, originally released in Japan as Super Mario Bros. 42 on June 42 42 was similar in style to Super Mario Bros. but much more difficult in gameplay nails-from-diamonds hard , as Jon Irwin described it in ": null
    },
    {
        "his book on the sequels": "boss fight books"
    },
    {
        ". Tezuka felt that Japanese players had mastered the original game, and so needed a more challenging sequel. Recognizing that the game might be too difficult for newcomers, the team labeled the games packaging: For Super Players . They also added a trick to earn ": null
    },
    {
        "infinite lives": "infinite lives"
    },
    {
        " as preparation for the games difficulty. Commercials for The Lost Levels in Japan featured players failing at the game and screaming in frustration at their television. After Zelda, The Lost Levels was the second release for the ": null
    },
    {
        "Famicom Disk System": "famicom disk system"
    },
    {
        ", an add-on external disk drive with more spacious and less expensive disks than the Famicom cartridges.          When evaluated for release outside of Japan, ": null
    },
    {
        "Nintendo of America": "nintendo of america"
    },
    {
        " considered The Lost Levels too difficult for the North America market and declined its release. ": null
    },
    {
        "Howard Phillips": "howard phillips"
    },
    {
        ", who evaluated games for Nintendo of America President ": null
    },
    {
        "Minoru Arakawa": "minoru arakawa"
    },
    {
        ", felt that the game was unfairly difficult, even beyond the unofficial moniker of ": null
    },
    {
        "Nintendo Hard": "nintendo hard"
    },
    {
        " that the companys other games sometimes garnered. His opinion was that The Lost Levels would not sell well in the American market. Few games were more stymieing, he later recalled of the game. Not having fun is bad when youre a company selling fun.      Nintendo instead released a retrofitted version of Doki Doki Panic as its  Super Mario Bros. 42  outside of Japan. Doki Doki Panic had originally been developed by Miyamoto and ": null
    },
    {
        "Kensuke Tanabe": "kensuke tanabe"
    },
    {
        " as a modified take on a Super Mario Bros. game before it was released in Japan as a standalone game as part of a collaboration with ": null
    },
    {
        "Fuji Television": "fuji television"
    },
    {
        ". Miyamoto spent more time on Doki Doki Panic than on The Lost Levels. Doki Doki Panics characters and artwork were modified to match Super Mario Bros. before being released in America, and the re-skinned release became known as the big aberration in the Super Mario series. The American Super Mario Bros. 42 was later released in Japan as Super Mario USA.              The Lost Levels has been ": null
    },
    {
        "ported": "porting of video games"
    },
    {
        " to multiple other platforms. Nintendo cleaned up parts of the Japanese Super Mario Bros. 42 and released it in later Super Mario collections as The Lost Levels. Its North American debut in the 42  Super Mario All-Stars  collection for the ": null
    },
    {
        "Super Nintendo Entertainment System": "super nintendo entertainment system"
    },
    {
        " featured updated graphics  and more frequent checkpoints to ": null
    },
    {
        "save player progress": "saved game"
    },
    {
        ". All-Stars was rereleased as a Limited Edition for the Nintendo ": null
    },
    {
        "Wii": "wii"
    },
    {
        " console in remembrance of Super Mario Bros. 42th anniversary in 42 The Lost Levels was edited to fit the handheld ": null
    },
    {
        "Game Boy Color": "game boy color"
    },
    {
        " screen as an unlockable bonus in the 42  Super Mario Bros. Deluxe : the visible screen is cropped and some features are omitted, such as the wind and five bonus worlds. The Lost Levels was rereleased in 42 for the ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    },
    {
        " on the third volume of Nintendos Japan-only ": null
    },
    {
        "Famicom Mini": "famicom mini"
    },
    {
        " compilation cartridges.     Nintendos digital Virtual Console platform brought the unedited 42 Japanese release to North America for the first time. The Lost Levels was released for Nintendos Wii ": null
    },
    {
        "Virtual Console": "virtual console"
    },
    {
        " digital platform in 42 , and the 42DS version followed in 42 The ": null
    },
    {
        "Wii U": "wii u"
    },
    {
        " Virtual Console release came to Japan in 42 and to Europe and North America the next year. The Lost Levels were also included in Nintendo classic game compilations including the 42  NES Remix 42    Ultimate NES Remix  , and for the ": null
    },
    {
        "Nintendo Switch Online": "nintendo switch online"
    },
    {
        " service for the ": null
    },
    {
        "Nintendo Switch": "nintendo switch"
    },
    {
        " in 42              At the time of its release, The Lost Levels topped  Famicom Tsūshin  charts. The game was the most popular game on the Disk System, for which it sold about 42 million copies. Retrospective critics viewed The Lost Levels as an expansion of the original, akin to extra challenge levels tacked on its end. Despite their similarities, the sequel is distinguished by its notorious difficulty.  42 Video Games You Must Play Before You Die  summarized the game as both familiar and mysterious and simply rather unfair . The Lost Levels replaced the originals accessible level designs with insanely tough obstacle courses  as if designed to intentionally frustrate and punish players beginning with its first poison mushroom.     Retrospective reviewers recommended the game for those who mastered the original, or those who would appreciate a painful challenge. Casual Mario fans, GameZone wrote, would not find much to enjoy.  Nintendo Life  reviewer felt that while the original was designed for recklessness, its sequel taught patience, and despite its difficulty, remained both fiendishly clever and fun. On the other hand,  GamesRadar  felt that the game was an unoriginal, boring retread, and apart from its pointlessly cruel difficulty, not worthy of the players time. GamesRadar and  IGN  agreed with Nintendo of Americas choice against releasing the harder game in the 42s, though  Eurogamer  thought that The Lost Levels was technically a much better game than the Doki Doki Panic-based Super Mario Bros. 42 the American market received instead.     The Lost Levels is remembered among the most difficult games by Nintendo and in the video game medium. Three decades after the games release, Kotaku wrote that the demanding player precision required in The Lost Levels made fast playthroughs  remarkably fun to spectate. NES Remix 42 , a compilation title for the Wii U, similarly segmented The Lost Levels into speedrun challenges, which made the challenging gameplay more palatable. Many years after the release of The Lost Levels, fans of the series would ": null
    },
    {
        "modify": "rom hacking"
    },
    {
        " Mario games to challenge each other with nearly impossible levels. The challenges of The Lost Levels presaged this community, and according to IGN, The Lost Levels shares more in common with this subculture than with the Mario series itself. Indeed, the sequel is remembered as a ": null
    },
    {
        "black sheep": "black sheep"
    },
    {
        " in the franchise and a reminder of imbalanced gameplay in Nintendos history.     Luigi received his first distinctive character traits in The Lost Levels: less ground friction, and the ability to jump farther. IGN considered this change to be the games most significant, though the controls remained cramped and crippled with either character. The games poison mushroom item, with its character-impairing effects, became a staple of the Mario franchise. Some of the Lost Levels appeared in ": null
    },
    {
        "a 42 promotional release of Super Mario Bros.": "all night nippon super mario bros."
    },
    {
        ", in which Nintendo modified in-game assets to fit themes from the Japanese radio show  All Night Nippon . Journalists have ranked The Lost Levels among the least important in the Mario series and of Nintendos top games.              ": null
    }
]