[
    {
        "      Surrealism": "surrealism"
    },
    {
        " in ": null
    },
    {
        "art": "art"
    },
    {
        ", ": null
    },
    {
        "poetry": "poetry"
    },
    {
        ", and ": null
    },
    {
        "literature": "literature"
    },
    {
        " uses numerous techniques and games to provide inspiration. Many of these are said to free imagination by producing a creative process free of ": null
    },
    {
        "conscious": "consciousness"
    },
    {
        " control. The importance of the ": null
    },
    {
        "unconscious": "unconscious mind"
    },
    {
        " as a source of inspiration is central to the nature of surrealism.     The Surrealist movement has been a fractious one since its inception. The value and role of the various techniques has been one of many subjects of disagreement. Some Surrealists consider ": null
    },
    {
        "automatism": "surrealist automatism"
    },
    {
        " and games to be sources of inspiration only, while others consider them starting points for finished works. Others consider the items created through automatism to be finished works themselves, needing no further refinement.          Aerography is a technique in which a 42-dimensional object is used as a ": null
    },
    {
        "stencil": "stencil"
    },
    {
        " with ": null
    },
    {
        "spraypainting": "spraypainting"
    },
    {
        ".        Automatic drawing Automatic painting Automatic writing Automatic poetry is ": null
    },
    {
        "poetry": "poetry"
    },
    {
        " written using the ": null
    },
    {
        "automatic method": "surrealist automatism"
    },
    {
        ". It has probably been the chief surrealist method from the founding of surrealism to the present day. One of the oddest uses of automatic writing by a great writer was that of ": null
    },
    {
        "W. B. Yeats": "w. b. yeats"
    },
    {
        ". His wife, a spiritualist, practised it, and Yeats put large chunks of it into his prose work,  A Vision  and much of his later poetry. Yeats, however, was not a surrealist.     Automatic poetry generators exist online, but they do not actually generate automatic poetry in this sense.     The Czech writer ": null
    },
    {
        "Bohumil Hrabal": "bohumil hrabal"
    },
    {
        " used the method of automatic text in his famous book  I Served the King of England . One chapter in the book is written as a single sentence, and at the end of the book Hrabal endorses the use of automatic writing.          Bulletism is shooting ": null
    },
    {
        "ink": "ink"
    },
    {
        " at a blank piece of ": null
    },
    {
        "paper": "paper"
    },
    {
        ". The artist can then develop images based on what is seen.       A calligramme is a text or ": null
    },
    {
        "poem": "poem"
    },
    {
        " of a type developed by ": null
    },
    {
        "Guillaume Apollinaire": "guillaume apollinaire"
    },
    {
        " in which the words or letters make up a shape, particularly a shape connected to the subject of the text or poem.            Collage is the assemblage of different forms creating a new whole. For example, an artistic collage work may include newspaper clippings, ribbons, bits of colored or hand-made papers, photographs, etc., glued to a solid support or canvas.       A coulage is a kind of ": null
    },
    {
        "automatic": "surrealist automatism"
    },
    {
        " or involuntary ": null
    },
    {
        "sculpture": "sculpture"
    },
    {
        " made by pouring a molten material  into cold ": null
    },
    {
        "water": "water"
    },
    {
        ". As the material cools it takes on what appears to be a random  form, though the physical properties of the materials involved may lead to a conglomeration of discs or spheres. The artist may use a variety of techniques to affect the outcome.     This technique is also used in the ": null
    },
    {
        "divination": "divination"
    },
    {
        " process known as ": null
    },
    {
        "ceromancy": "ceromancy"
    },
    {
        ".            Cubomania is a method of making ": null
    },
    {
        "collage": "collage"
    },
    {
        "s in which a picture or ": null
    },
    {
        "image": "image"
    },
    {
        " is cut into squares and the squares are then reassembled without regard for the image. The technique was first used by the ": null
    },
    {
        "Romania": "romania"
    },
    {
        "n surrealist ": null
    },
    {
        "Gherasim Luca": "gherasim luca"
    },
    {
        ".          Cut-up technique is a literary form or method in which a text is cut up at random and rearranged to create a new text.          Decalcomania is a process of spreading thick paint upon a canvas then & mdash;while it is still wet & mdash;covering it with further material such as paper or aluminium foil. This covering is then removed , and the resultant paint pattern becomes the basis of the finished painting. The technique was much employed by artists such as ": null
    },
    {
        "Max Ernst": "max ernst"
    },
    {
        ".       The dream résumé takes the form of an employment ": null
    },
    {
        "résumé": "résumé"
    },
    {
        " but chronicles its subjects achievements, employment, or the like, in ": null
    },
    {
        "dream": "dream"
    },
    {
        "s, rather than in waking life. Sometimes dream résumés contain the achievements of both, however.       An echo poem is a ": null
    },
    {
        "poem": "poem"
    },
    {
        " written using a technique invented by ": null
    },
    {
        "Aurélien Dauguet": "aurélien dauguet"
    },
    {
        " in 42 The poem is composed by one or more persons, working together in a process as follows.     The first ": null
    },
    {
        "stanza": "stanza"
    },
    {
        " of the poem is written on the left-hand column of a piece of paper divided into two columns. Then the opposite , or echo, of the first stanza, in whatever sense is appropriate to the poem, is composed in the right-hand column of the page. The writing is done ": null
    },
    {
        "automatically": "surrealist automatism"
    },
    {
        " and often the opposite stanza is composed of a ": null
    },
    {
        "phonetic": "phonetic"
    },
    {
        " correspondence to the first stanza.     For a longer work, the third stanza can then begin in the left-hand column as an opposite or a phonetic correspondence to what preceded it in the right-hand column. Then the fourth stanza might be an opposite or sound correspondence to what preceded it in the left-hand column, and so forth. When the poem is completed, the echo of the last phrase, line, or sentence, generally serves as the ": null
    },
    {
        "title": "title"
    },
    {
        ".     This is unrelated to the non-Surrealist ": null
    },
    {
        "echo verse": "echo verse"
    },
    {
        " form which appears as a dialogue between the questions of a character and ": null
    },
    {
        "the answers": "echo"
    },
    {
        " of the nymph ": null
    },
    {
        "Echo": "echo"
    },
    {
        ".       Éclaboussure is a process in Surrealist painting where oil paints or watercolours are laid down and water or turpentine is splattered, then soaked up to reveal random splatters or dots where the media was removed. This technique gives the appearance of space and atmosphere. It was used in paintings by ": null
    },
    {
        "Remedios Varo": "remedios varo"
    },
    {
        ".       Entopic graphomania is a surrealist and automatic method of ": null
    },
    {
        "drawing": "drawing"
    },
    {
        " in which dots are made at the sites of impurities in a blank sheet of paper, and lines are then made between the dots; these can be either curved lines... or straight lines. . Ithell Colquhoun described its results as the most austere kind of geometric abstraction. It is to be distinguished from entoptic methods of drawing or art-making, inspired by ": null
    },
    {
        "entoptic phenomena": "entoptic phenomenon"
    },
    {
        ".     The method was invented by ": null
    },
    {
        "Dolfi Trost": "dolfi trost"
    },
    {
        ", who as the subtitle of his 42 book  suggests, included nine examples therein. This method of indecipherable writing was supposedly an example of ": null
    },
    {
        "surautomatism": "surautomatism"
    },
    {
        " , the controversial theory put forward by Trost and ": null
    },
    {
        "Gherashim Luca": "gherashim luca"
    },
    {
        " in which surrealist methods would be practiced that went beyond automatism. In Dialectique de Dialectique they had proposed the further radicalization of surrealist automatism by abandoning images produced by artistic techniques in favour of those resulting from rigorously applied scientific procedures, allegedly cutting the notion of ": null
    },
    {
        "artist": "artist"
    },
    {
        " out of the process of creating images and replacing it with chance and scientific rigour. However, the question has arisen whether an algorithm should be used to determine in what order to connect the dots to maintain the automatic nature of the method.     The method has been compared to the ": null
    },
    {
        "voronoi mathematical progression": "voronoi diagram"
    },
    {
        " .       ": null
    },
    {
        "Collage": "collage"
    },
    {
        " is perceived as an additive method of visual poetry whereas Étrécissements are a reductive method. This was first employed by ": null
    },
    {
        "Marcel Mariën": "marcel mariën"
    },
    {
        " in the 42s. The results are achieved by the cutting away of parts of images to encourage a new image, by means of a pair of scissors or any other manipulative sharpened instrument.          Exquisite corpse or Cadavre exquis is a method by which a collection of words or images are collectively assembled. It is based on an old parlour game known by the same name  in which players wrote in turn on a sheet of paper, folded it to conceal part of the writing, and then passed it to the next player for a further contribution.          Frottage is a method of creation in which one takes a pencil or other drawing tool and makes a rubbing over a textured surface. The drawing can either be left as it is or used as the basis for further refinement.          Fumage is a technique in which impressions are made by the ": null
    },
    {
        "smoke": "smoke"
    },
    {
        " of a ": null
    },
    {
        "candle": "candle"
    },
    {
        " or ": null
    },
    {
        "kerosene lamp": "kerosene lamp"
    },
    {
        " on a piece of paper or canvas. This technique was introduced by ": null
    },
    {
        "Wolfgang Paalen": "wolfgang paalen"
    },
    {
        ".       In ": null
    },
    {
        "Surrealism": "surrealism"
    },
    {
        ", games are important not only as a form of recreation but as a method of investigation. The intention is to cut away the constraints of ": null
    },
    {
        "rationalism": "rationalism"
    },
    {
        " and allow concepts to develop more freely and in a more random manner. The aim is to break traditional thought patterns and create a more original outcome.     Old games such as ": null
    },
    {
        "Exquisite corpse": "exquisite corpse"
    },
    {
        ", and newer ones, notably Time Travelers Potlatch and Parallel Collage, have played a critical role.     Exquisite corpse is a method by which a collection of words or images are collectively assembled, the result being known as the exquisite corpse or cadavre exquis in ": null
    },
    {
        "French": "french language"
    },
    {
        ". Later the game was adapted to ": null
    },
    {
        "drawing": "drawing"
    },
    {
        " and ": null
    },
    {
        "collage": "collage"
    },
    {
        ".     Time Travelers ": null
    },
    {
        "Potlatch": "potlatch"
    },
    {
        " is a game in which two or more players say what gift they would give to another person - this is usually an historical person who played a role in, or had an influence on, the formation of Surrealism.        Grattage is a surrealist technique in ": null
    },
    {
        "painting": "painting"
    },
    {
        " in which ": null
    },
    {
        "paint": "paint"
    },
    {
        " is scraped off the canvas. It was employed by ": null
    },
    {
        "Max Ernst": "max ernst"
    },
    {
        " and ": null
    },
    {
        "Joan Miró": "joan miró"
    },
    {
        ".       Heatage is an automatic technique developed and used by ": null
    },
    {
        "David Hare": "david hare"
    },
    {
        " in which an exposed but unfixed ": null
    },
    {
        "photographic negative": "negative"
    },
    {
        " is heated from below, causing the ": null
    },
    {
        "emulsion": "emulsion"
    },
    {
        " to distort in a random fashion.       In addition to its obvious meaning of writing that is illegibile or for whatever other reason cannot be made out by the reader, indecipherable writing refers to a set of ": null
    },
    {
        "automatic": "surrealist automatism"
    },
    {
        " techniques, most developed by ": null
    },
    {
        "Romania": "romania"
    },
    {
        "n surrealists and falling under the heading of ": null
    },
    {
        "surautomatism": "surautomatism"
    },
    {
        ". Examples include entoptic graphomania, ": null
    },
    {
        "fumage": "fumage"
    },
    {
        " and the movement of liquid down a vertical surface.       Surrealism describes as involuntary sculpture those made by absent-mindedly manipulating something, such as rolling and unrolling a movie ticket, bending a paper clip, and so forth.       Latent news is a game in which an article from a ": null
    },
    {
        "newspaper": "newspaper"
    },
    {
        " is cut into individual words and then rapidly reassembled; see also ": null
    },
    {
        "Cut-up technique": "cut-up technique"
    },
    {
        ".          The movement of liquid down a vertical surface is, as the name suggests, a technique, invented by surrealists from ": null
    },
    {
        "Romania": "romania"
    },
    {
        " and said by them to be ": null
    },
    {
        "surautomatic": "surautomatism"
    },
    {
        " and a form of indecipherable writing, of making pictures by dripping or allowing a flow of some form of liquid down a vertical surface.          Paranoiac-critical method is a technique invented by ": null
    },
    {
        "Salvador Dalí": "salvador dalí"
    },
    {
        " which consists of the artist invoking a paranoid state . The result is a deconstruction of the psychological concept of identity, such that subjectivity becomes the primary aspect of the artwork.        Parsemage is a ": null
    },
    {
        "surrealist": "surrealist"
    },
    {
        " and ": null
    },
    {
        "automatic": "surrealist automatism"
    },
    {
        " method in the ": null
    },
    {
        "visual art": "visual art"
    },
    {
        "s invented by ": null
    },
    {
        "Ithell Colquhoun": "ithell colquhoun"
    },
    {
        " in which dust from ": null
    },
    {
        "charcoal": "charcoal"
    },
    {
        " or colored ": null
    },
    {
        "chalk": "chalk"
    },
    {
        " is scattered on the surface of water and then skimmed off by passing a stiff paper or cardboard just under the waters surface.          Photomontage is making of composite picture by cutting and joining a number of photographs.       Sifflage is the technique used by ": null
    },
    {
        "Jimmy Ernst": "jimmy ernst"
    },
    {
        " in which liquid paint is blown to inspire or reveal an image. This is sometimes called soufflage , but Ernsts name was sifflage .   The result can be seen in his Echo Plasm.          Surautomatism is any theory or act of taking automatism to its most absurd limits.       Triptography": null
    }
]