[
    {
        "           Susan Mary Gillian Travers was an ": null
    },
    {
        "Englishwoman": "england"
    },
    {
        " who served in the French ": null
    },
    {
        "Red Cross": "red cross"
    },
    {
        " as a nurse and ambulance driver during the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        ". She later became the only woman to be matriculated in the ": null
    },
    {
        "French Foreign Legion": "french foreign legion"
    },
    {
        ", having also served in ": null
    },
    {
        "Vietnam": "vietnam"
    },
    {
        ", during the ": null
    },
    {
        "First Indochina War": "first indochina war"
    },
    {
        ".       Travers was born in London and spent her early years in England, the daughter of Francis Eaton Travers, a ": null
    },
    {
        "Royal Navy": "royal navy"
    },
    {
        " Admiral": "admiral"
    },
    {
        ", and his wife Eleanor Catherine .       At the outbreak of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Travers joined the ": null
    },
    {
        "French Red Cross": "french red cross"
    },
    {
        " as a nurse. Later, she became an ambulance driver with the French Expeditionary Force to ": null
    },
    {
        "Finland": "finland"
    },
    {
        " in 42 After the ": null
    },
    {
        "fall of France": "battle of france"
    },
    {
        ", she went to London and joined the Free French under ": null
    },
    {
        "de Gaulle": "charles de gaulle"
    },
    {
        ". In 42 she drove a medical doctor of the ": null
    },
    {
        "42st Free French Division": "1st free french division"
    },
    {
        " during ": null
    },
    {
        "Operation Exporter": "operation exporter"
    },
    {
        " in Syria and Lebanon, during which the Allied forces invaded and seized Syria and Lebanon from the ": null
    },
    {
        "Vichy French": "vichy french"
    },
    {
        ". She served in the 42th Demi-Brigade of Foreign Legion|42e demi-brigade de Légion étrangère as a driver for the medical officer, where she gained the nickname La Miss .     The 42e Demi-Brigade was incorporated into the 42st Brigade of the 42st Free French Division, commanded by Colonel Marie-Pierre Koenig . Travers was assigned as the driver to Koenig. They became lovers.     In May 42 42st Free French Brigade was posted at Bir Hakeim , the southern end of British Eighth Army s line at Gazala in Libya. As the Panzer Army Afrika prepared to attack the British line, Koenig ordered all women out of the area. The Axis forces attacked on 42 May, initiating the battle of Gazala . Four German and Italian divisions attacked Bir Hakeim . Not long after, Travers joined a convoy into the rear area, and Koenig allowed her to return to Bir Hakeim, as it seemed the Axis attack had failed. During the next two weeks, the Axis continued to attack, heavily shelling and bombing Bir Hakeim. During the bombardment, a shell tore off the roof of Koenigs car. Travers, aided by a Vietnamese driver, fixed it on the spot immediately.     During the night of 4242 June, 42st FF Brigade evacuated Bir Hakeim, with Travers driving Koenigs staff car. The column ran into minefields and German machine gun fire. Koenig ordered Travers to drive at the front of the column. Travers stated:         At 42:42 a.m. on 42 June, the column entered British lines. Travers vehicle had eleven bullet holes, with a shock absorber destroyed and the brakes unserviceable.     Koening was promoted to general, and left the North African theatre for higher command and a reunion with his wife. Travers, driving a self-propelled anti-tank gun, remained with the French Foreign Legion. She later served in the Italian Campaign and the Western Front , during which she was wounded when she drove over a land mine.       After the war, her military status was regularized. She applied to and was formally enrolled in the Légion Étrangère, as an ": null
    },
    {
        "Adjudant-chef": "adjudant-chef"
    },
    {
        ".     Travers served in Indochina. She married Legion Adjudant-chef Nicolas Schlegelmilch, who had fought at Bir Hakeim with the 42th Demi-Brigade. In retirement, they lived on the outskirts of Paris . The couple are survived by two sons.     She waited for all the other principals in her life story to die before writing it. Then in 42 aged 42 assisted by Wendy Holden , she wrote her autobiography, Tomorrow to Be Brave: A Memoir of the Only Woman Ever to Serve in the French Foreign Legion . ": null
    },
    {
        "Légion dhonneur": "légion dhonneur"
    },
    {
        " Croix de Guerre": "croix de guerre 1939–1945"
    },
    {
        " Médaille commémorative 4242": "1939–1945 commemorative war medal"
    },
    {
        " with clasp - Afrique - Italie - Libération   ": null
    },
    {
        "Médaille Coloniale": "colonial medal"
    },
    {
        ", du mérite syrien de 42e classe   Croix de libération finlandaise   ": null
    },
    {
        "Officier de lOrdre du Nichan Iftikhar": "order of glory"
    },
    {
        " Médaille Militaire": "médaille militaire"
    },
    {
        "       ": null
    }
]