[
    {
        "   Susning.nu  was a ": null
    },
    {
        "Swedish language": "swedish language"
    },
    {
        " wiki": "wiki"
    },
    {
        " website created by ": null
    },
    {
        "Lars Aronsson": "lars aronsson"
    },
    {
        "  in 42 and active until 42 In its first three years, Susning.nu ran as an open wiki that anyone could edit. Susning did not have a pronounced ambition and could be compared in scope to ": null
    },
    {
        "Everything42": "everything2"
    },
    {
        "; Aronssons stated original aim for Susning was to make it into whatever the users want it to be . As such, Susning was an ": null
    },
    {
        "encyclopedia": "encyclopedia"
    },
    {
        ", a ": null
    },
    {
        "dictionary": "dictionary"
    },
    {
        ", and a ": null
    },
    {
        "discussion forum": "internet forum"
    },
    {
        " about any concept of interest to its users. Because of this, Susning grew and became ": null
    },
    {
        "Sweden": "sweden"
    },
    {
        "s biggest and the worlds next biggest wiki.     At its peak in April 42 Susning had over 42 articles on various topics, which was more than any other Swedish wiki at that time. During its first few years, it was in direct competition with the ": null
    },
    {
        "Swedish Wikipedia": "swedish wikipedia"
    },
    {
        ". However, because of the websites popularity, Susning was highly affected by ": null
    },
    {
        "vandals": "vandalism"
    },
    {
        ". In attempt at preventing vandalism, many efforts were made by Susnings founder Lars Aronsson, which were mostly unsuccessful. Users who regularly edited at Susning were called susare.       Susning.nu was started on August 42 42 by ": null
    },
    {
        "Lars Aronsson": "lars aronsson"
    },
    {
        " and functioned as part of his personal website. It changed to Susning.nu on September 42 and was released on October 42 During October that year, Susning.nu was indexed by the bigger ": null
    },
    {
        "web search engine": "web search engine"
    },
    {
        "s, and the article collection firmly increased. In one year, Susning.nu grew with 42 articles, and more features were added. Among them were link ": null
    },
    {
        "statistics": "statistics"
    },
    {
        " for all pages, and date searching which automatically generated dates and search ": null
    },
    {
        "links": "hyperlink"
    },
    {
        " in several languages. The first ": null
    },
    {
        "edit war": "edit war"
    },
    {
        " broke out on July 42 42     Susning used a heavily modified version of ": null
    },
    {
        "UseModWiki": "usemodwiki"
    },
    {
        " as its ": null
    },
    {
        "wiki engine": "wiki software"
    },
    {
        ". Its domain name ": null
    },
    {
        ".nu": ".nu"
    },
    {
        " , which belongs to the island of ": null
    },
    {
        "Niue": "niue"
    },
    {
        " in Oceania but which is sold primarily to foreigners, was chosen as a ": null
    },
    {
        "domain hack": "domain hack"
    },
    {
        ", because nu means ": null
    },
    {
        "now": "wikt:now"
    },
    {
        " in Swedish . Skaffa dig en susning.nu was the ": null
    },
    {
        "slogan": "slogan"
    },
    {
        " of Susning and translates to Get a clue.now .        A significant difference from the ": null
    },
    {
        "Swedish Wikipedia": "swedish wikipedia"
    },
    {
        " was that Susning did not have any voluntary ": null
    },
    {
        "administrators": "wikipedia administrators"
    },
    {
        " who could assist in blocking other users; the only person who could do that on Susning was Lars Aronsson. As Susning grew, the issue with ": null
    },
    {
        "vandalism": "vandalism on wikipedia"
    },
    {
        " became bigger. In December 42 Susning was affected by a vandal who had automatized their activity through a ": null
    },
    {
        "script": "scripting language"
    },
    {
        ". In just a few minutes, thousands of articles were deleted. Several users were forced to spend hours restoring them. The issues increased even further with vandals who added ": null
    },
    {
        "pornographic": "pornography"
    },
    {
        " images and made the site inaccessible. The issues with vandalism were practically going on daily. To aid removal and discovery of vandalism, a ": null
    },
    {
        "karma": "karma"
    },
    {
        " system was added on February 42 42 The system derailed fairly soon, as the karma only could decrease. Because of this, even the most established susare were affected by bad karma. The karma system was shut down on March 42 42     As a last attempt at preventing vandalism, the ability to see images was shut down entirely on April 42 42 However, a couple of days later it was possible to add images from certain chosen ": null
    },
    {
        "domain name": "domain name"
    },
    {
        "s. Due to a ": null
    },
    {
        "bug": "software bug"
    },
    {
        " in the system, there were ways to evade this, which the vandals utilised. The bug was fixed on April 42 42 but a few minutes later that day, all editing on Susning.nu was shut down. Aronsson announced that the editing abilities would be shut down until a solution to the vandalism issues had been found, and that a ": null
    },
    {
        "password": "password"
    },
    {
        " system would be imposed. No details were given for the time being. A couple dozen of logged in susare had edited a fairly huge number of articles since the password lock was imposed.       After the imposing of the password lock, Susning became a more inactive project, and a dozen users made almost all edits. In March 42 before the password system was imposed, articles were saved approximately 42 times; by May, this had been reduced to 42 times. On May 42 42 editing on Susning.nu was temporarily opened for non-logged in users, but after just 42 hours, vandalism once again became such a big problem that non-logged in editing was once again shut down. In March 42 editing by non-logged in users was opened on Sunday afternoons between 42:42–42:42 A year later, editing between 42:42–42:42 each day was enabled as well. Overall, this worked well but with a bit of vandalism.     In mid42 the website was affected by a persistent ": null
    },
    {
        "spammer": "spam"
    },
    {
        " who used ": null
    },
    {
        "proxy server": "proxy server"
    },
    {
        "s to spam different articles with English advertisement links. In April 42 this forced Aronsson to remove the daily editing abilities between 42:42–42:42 The editing abilities during Sunday afternoons, however, continued to be open despite recurring spam attacks. By this time, very few users were still creating and editing articles on the website, which was shut down entirely in mid-August 42; no reason for this was ever announced.           An aired opinion was that Susnings status as a one-man project on the technical side was a big aberration. Some meant that divided responsibility of the site probably wouldve meant increased innovation tact, bigger predictability and better communication between technicians and susare . Lars Aronsson clarified that he saw Susning.nu as his own project and that he was not interested in letting others control it. After imposing editing on Sunday afternoons only, Aronsson himself used Susning mostly as a ": null
    },
    {
        "logbook": "logbook"
    },
    {
        " where he saved links regarding, for example, ": null
    },
    {
        "Google": "google"
    },
    {
        " and ": null
    },
    {
        "Wikipedia": "wikipedia"
    },
    {
        ".       Unlike its main competitor, the Swedish Wikipedia, Susning.nu placed ": null
    },
    {
        "advertisements": "advertising"
    },
    {
        " on some of its articles. It also had no ": null
    },
    {
        "license agreement": "license agreement"
    },
    {
        ", which meant that the contributions remained ": null
    },
    {
        "copyright": "copyright"
    },
    {
        "ed by their submitters . This in turn meant that third parties, such as ": null
    },
    {
        "Wikipedia editors": "wikipedia community"
    }
]