[
    {
        "        Swallowing, sometimes called deglutition in scientific contexts, is the process in the human or animal body that allows for a substance to pass from the ": null
    },
    {
        "mouth": "mouth"
    },
    {
        ", to the ": null
    },
    {
        "pharynx": "pharynx"
    },
    {
        ", and into the ": null
    },
    {
        "esophagus": "esophagus"
    },
    {
        ", while shutting the ": null
    },
    {
        "epiglottis": "epiglottis"
    },
    {
        ". Swallowing is an important part of ": null
    },
    {
        "eating": "eating"
    },
    {
        " and ": null
    },
    {
        "drinking": "drinking"
    },
    {
        ". If the process fails and the material goes through the ": null
    },
    {
        "trachea": "vertebrate trachea"
    },
    {
        ", then ": null
    },
    {
        "choking": "choking"
    },
    {
        " or ": null
    },
    {
        "pulmonary aspiration": "pulmonary aspiration"
    },
    {
        " can occur. In the human body the automatic temporary closing of the epiglottis is controlled by the swallowing ": null
    },
    {
        "reflex": "reflex"
    },
    {
        ".     The portion of food, drink, or other material that will move through the ": null
    },
    {
        "neck": "neck"
    },
    {
        " in one swallow is called a bolus.     Swallowing comes so easily to most people that the process rarely prompts much thought. However, from the viewpoints of ": null
    },
    {
        "physiology": "physiology"
    },
    {
        ", of ": null
    },
    {
        "speech-language pathology": "speech-language pathology"
    },
    {
        ", and of ": null
    },
    {
        "health care": "health care"
    },
    {
        " for people with ": null
    },
    {
        "difficulty in swallowing ": "dysphagia"
    },
    {
        ", it is an interesting topic with extensive ": null
    },
    {
        "scientific literature": "scientific literature"
    },
    {
        ".           Eating and swallowing are complex neuromuscular activities consisting essentially of three phases, an oral, pharyngeal and esophageal phase. Each phase is controlled by a different neurological mechanism. The oral phase, which is entirely voluntary, is mainly controlled by the ": null
    },
    {
        "medial": "medial"
    },
    {
        " temporal lobe": "temporal lobe"
    },
    {
        "s and ": null
    },
    {
        "limbic system": "limbic system"
    },
    {
        " of the ": null
    },
    {
        "cerebral cortex": "cerebral cortex"
    },
    {
        " with contributions from the motor cortex and other cortical areas. The pharyngeal swallow is started by the oral phase and subsequently is coordinated by the swallowing center on the ": null
    },
    {
        "medulla oblongata": "medulla oblongata"
    },
    {
        " and ": null
    },
    {
        "pons": "pons"
    },
    {
        ". The reflex is initiated by touch receptors in the ": null
    },
    {
        "pharynx": "pharynx"
    },
    {
        " as a ": null
    },
    {
        "bolus": "bolus"
    },
    {
        " of food is pushed to the back of the mouth by the tongue, or by stimulation of the palate .     Swallowing is a complex mechanism using both skeletal muscle  and smooth muscles of the pharynx and ": null
    },
    {
        "esophagus": "esophagus"
    },
    {
        " . The ": null
    },
    {
        "autonomic nervous system": "autonomic nervous system"
    },
    {
        " coordinates this process in the pharyngeal and esophageal phases.                   Prior to the following stages of the oral phase, the mandible depresses and the lips abduct to allow food or liquid to enter the oral cavity. Upon entering the oral cavity, the mandible elevates and the lips adduct to assist in oral containment of the food and liquid. The following stages describe the normal and necessary actions to form the bolus, which is defined as the state of the food in which it is ready to be swallowed.     42": null
    },
    {
        "parasympathetic": "parasympathetic"
    }
]