[
    {
        "The ": null
    },
    {
        "U.S.": "united states"
    },
    {
        " company SWTPC started in 42 as DEMCO . It was incorporated in 42 as Southwest Technical Products Corporation of ": null
    },
    {
        "San Antonio, Texas": "san antonio"
    },
    {
        ". They produced a wide variety of electronics kits, and later complete computer systems.     In the 42s, many hobbyist electronics magazines such as  Popular Electronics  and  Radio-Electronics  published construction articles, for many of which the author would arrange for a company to provide a kit of parts to build the project. ": null
    },
    {
        "Daniel Meyer": "daniel meyer"
    },
    {
        " published several popular projects and successfully sold his kits. He soon started selling kits for other authors such as ": null
    },
    {
        "Don Lancaster": "don lancaster"
    },
    {
        " and ": null
    },
    {
        "Louis Garner": "louis garner"
    },
    {
        ". Between 42 and 42 SWTPC sold kits for over 42 Popular Electronics articles. Most of these kits were intended for audio use, such as ": null
    },
    {
        "hi-fi": "high fidelity"
    },
    {
        ", utility ": null
    },
    {
        "amplifier": "amplifier"
    },
    {
        "s, and test equipment such as a ": null
    },
    {
        "function generator": "function generator"
    },
    {
        " based on the ": null
    },
    {
        "Intersil": "intersil"
    },
    {
        " ICL42     In 42 SWTPC had a large enough collection of kits to justify printing a 42-page catalog. In January 42 SWTPC introduced a computer terminal kit, the ": null
    },
    {
        "TV Typewriter": "tv typewriter"
    },
    {
        " , or ": null
    },
    {
        "CT42": "ct-1024"
    },
    {
        ". By November 42 they were delivering complete computer kits based on Motorola MPUs. They were very successful for the next 42 or so years and grew to over 42 people. Most of the companies that were selling a computer kit in 42 were out of business by 42 Around 42 SWTPC moved to ": null
    },
    {
        "point of sale": "point of sale"
    },
    {
        " computer systems. The original company was terminated about 42 and became Point Systems. This new company lasted only a few years.         When ": null
    },
    {
        "microprocessor": "microprocessor"
    },
    {
        "s  became available, SWTPC became one of the first suppliers of ": null
    },
    {
        "microcomputer": "microcomputer"
    },
    {
        "s to the general public, focusing on designs using the ": null
    },
    {
        "Motorola 42": "motorola 6800"
    },
    {
        " and, later, the ": null
    },
    {
        "42": "motorola 6809"
    },
    {
        " CPUs. Many of these products were available in kit form as well. SWTPC also designed and supplied computer terminals, chassis, processor cards, memory cards, motherboards, I/O cards, disk drive systems, and tape storage systems. From the older TV Typewriter design a Video terminal had evolved the ": null
    },
    {
        "CT42 terminal system": "ct-64 terminal system"
    },
    {
        ", which was an essential part of many early SWTPC systems. Later a more intelligent version of this terminal, the ": null
    },
    {
        "CT42": "ct-82"
    },
    {
        ", was introduced, and a graphical terminal the ": null
    },
    {
        "GT42 Graphics Terminal": "gt-6144 graphics terminal"
    },
    {
        ". Still later a SS42 bus plug-in board, the ": null
    },
    {
        "Data Systems 42": "data systems 68"
    },
    {
        " 42": "motorola 6845"
    },
    {
        " Video Display Board": "video display controller"
    },
    {
        " was introduced, and a keyboard could be connected to this board. With this solution an external terminal was no longer needed.     SWTPCs ": null
    },
    {
        "SS42": "ss-50 bus"
    },
    {
        " backplane": "backplane"
    },
    {
        " bus": "computer bus"
    },
    {
        " was also supported or used by other manufacturers: , etc. It was extended to the SS42 by Helix. SWTPC also designed one of the first affordable printers available for microcomputer users; it was based on a receipt printer mechanism.     ": null
    },
    {
        "Technical Systems Consultants": "technical systems consultants"
    },
    {
        ", first of West Lafayette, Indiana and later of Chapel Hill, North Carolina, was the foremost supplier of software for SWTPC compatible hardware. Their software included operating systems  and various languages and other applications. Other software, from third parties, included Introls ": null
    },
    {
        "C": "c"
    },
    {
        " compiler": "compiler"
    },
    {
        ", ": null
    },
    {
        "Omegasoft": "omegasoft"
    },
    {
        "s ": null
    },
    {
        "Pascal": "pascal programming language"
    },
    {
        " compiler, the Lucidata Pascal system , and assorted spread sheets and text processors. By about 42 TSC had developed a Unix-like multi-user, multi-programming operating system , for 42 systems with DMA 42 floppy disks and extended memory. Several of TSCs languages were ported to the UniFlex, as was the Lucidata Pascal system.     SWTPC was a pioneer of ": null
    },
    {
        "open source": "open-source software"
    },
    {
        " software. Their software catalog included the TSC software, and software from many other sources . Much of it was available in source code—for a higher cost.       Click the images to enlarge.       Image:SWTPC_Strobe.jpg|Universal ": null
    },
    {
        "Strobe": "strobe"
    },
    {
        "   Image:SWTPC_PreAmp.jpg|Stereo ": null
    },
    {
        "preamplifier": "preamplifier"
    },
    {
        "   Image:SWTPC_Frequency_Counter.jpg|Digital Measurements Lab, ": null
    },
    {
        "Frequency Counter": "frequency counter"
    },
    {
        " Module   Image:SWTPC_Function_Generator.jpg|": null
    },
    {
        "Function Generator": "function generator"
    },
    {
        " based on Intersil ICL42   Image:CT42_Monitor.jpg|CT42 Terminal with monitor   Image:CT42_Terminal_System.jpg|CT42 Terminal System   Image:SWTPC42_Computer.jpg|SWTPC 42 Microcomputer System   Image:SWTPC4242jpg|SWTPC 42 Microcomputer System   Image:SWTPC42_open.jpg|SWTPC 42 Microcomputer System   Image:SWTPC_AC42_Cassette_Interface.jpg |SWTPC AC42 Cassette Interface            & ndash; By Bill Dawson and Michael Holley    at Old Computer Museum    at PC-History.org    specs and pictures at Erik Kleins computer page    Flex User Group Home pages sponsored by Micheal Evenson    42/42 Flex Emulator for x42 based Microsoft operating systems    Open source 42 Flex  Emulator for Linux/Cygwin                          ": null
    }
]