[
    {
        "                In ": null
    },
    {
        "group theory": "group theory"
    },
    {
        ", the symmetry group of a geometric object is the ": null
    },
    {
        "group": "group"
    },
    {
        " of all ": null
    },
    {
        "transformation": "transformation"
    },
    {
        "s under which the object is ": null
    },
    {
        "invariant": "invariant"
    },
    {
        ", endowed with the group operation of ": null
    },
    {
        "composition": "function composition"
    },
    {
        ". Such a transformation is an invertible mapping of the ": null
    },
    {
        "ambient space": "ambient space"
    },
    {
        " which takes the object to itself, and which preserves all the relevant structure of the object. A frequent notation for the symmetry group of an object X is G Sym.     For an object in a ": null
    },
    {
        "metric": "metric"
    },
    {
        " space, its symmetries form a ": null
    },
    {
        "subgroup": "subgroup"
    },
    {
        " of the ": null
    },
    {
        "isometry group": "isometry group"
    },
    {
        " of the ambient space. This article mainly considers ": null
    },
    {
        "symmetry": "symmetry"
    },
    {
        " groups in ": null
    },
    {
        "Euclidean geometry": "euclidean geometry"
    },
    {
        ", but the concept may also be studied for more general types of geometric structure.       We consider the objects possessing symmetry to be geometric figures, images, and patterns, such as a ": null
    },
    {
        "wallpaper pattern": "wallpaper group"
    },
    {
        ". For symmetry of physical objects, one may also take their physical composition as part of the pattern.  The group of isometries of space induces a ": null
    },
    {
        "group action": "group action"
    },
    {
        " on objects in it, and the symmetry group Sym consists of those isometries which map X to itself . We say X is invariant under such a mapping, and the mapping is a symmetry of X.     The above is sometimes called the full symmetry group to emphasize that it includes orientation-reversing isometries . The ": null
    },
    {
        "subgroup": "subgroup"
    },
    {
        " of orientation-preserving symmetries is called its proper symmetry group. An object is ": null
    },
    {
        "chiral": "chirality"
    },
    {
        " when it has no ": null
    },
    {
        "orientation": "orientation"
    },
    {
        "-reversing symmetries, so that its proper symmetry group is equal to its full symmetry group.     Any symmetry group whose elements have a common ": null
    },
    {
        "fixed point": "fixed point"
    },
    {
        ", which is true if the group is finite or the figure is bounded, can be represented as a ": null
    },
    {
        "subgroup": "subgroup"
    },
    {
        " of the ": null
    },
    {
        "orthogonal group": "orthogonal group"
    },
    {
        " O by choosing the origin to be a fixed point. The proper symmetry group is then a subgroup of the special orthogonal group SO, and is called the rotation group of the figure.     In a  discrete symmetry group , the points symmetric to a given point do not ": null
    },
    {
        "accumulate": "limit point"
    },
    {
        " toward a limit point. That is, every ": null
    },
    {
        "orbit": "orbit"
    },
    {
        " of the group forms a ": null
    },
    {
        "discrete set": "discrete set"
    },
    {
        ". All finite symmetry groups are discrete.     Discrete symmetry groups come in three types: finite  point groups , which include only rotations, reflections, inversions and rotoinversions – i.e., the finite subgroups of O; infinite  lattice groups, which include only translations; and infinite  space groups  containing elements of both previous types, and perhaps also extra transformations like ": null
    },
    {
        "screw displacement": "screw displacement"
    },
    {
        "s and ": null
    },
    {
        "glide reflection": "glide reflection"
    },
    {
        "s. There are also ": null
    },
    {
        "continuous symmetry": "continuous symmetry"
    },
    {
        " groups , which contain rotations of arbitrarily small angles or translations of arbitrarily small distances. An example is ": null
    },
    {
        "O": "orthogonal group"
    },
    {
        ", the symmetry group of a sphere. Symmetry groups of Euclidean objects may be completely classified as the ": null
    },
    {
        "subgroups of the Euclidean group": "euclidean groupsubgroups"
    },
    {
        " E .     Two geometric figures have the same symmetry type when their symmetry groups are  conjugate  subgroups of the Euclidean group: that is, when the subgroups H 42 , H 42 are related by  for some g in E. For example:     two 42D figures have mirror symmetry, but with respect to different mirror planes.   two 42D figures have 42-fold ": null
    },
    {
        "rotational symmetry": "rotational symmetry"
    },
    {
        ", but with respect to different axes.   two 42D patterns have translational symmetry, each in one direction; the two translation vectors have the same length but a different direction.     In the following sections, we only consider isometry groups whose ": null
    },
    {
        "orbits": "orbit"
    },
    {
        " are ": null
    },
    {
        "topologically closed": "closed"
    },
    {
        ", including all discrete and continuous isometry groups. However, this excludes for example the 42D group of translations by a ": null
    },
    {
        "rational number": "rational number"
    },
    {
        "; such a non-closed figure cannot be drawn with reasonable accuracy due to its arbitrarily fine detail.       The isometry groups in one dimension are:     the trivial group C 42   the groups of two elements generated by a reflection; they are isomorphic with C 42   the infinite discrete groups generated by a translation; they are isomorphic with Z, the additive group of the integers   the infinite discrete groups generated by a translation and a reflection; they are isomorphic with the ": null
    },
    {
        "generalized dihedral group": "dihedral groupgeneralizations"
    },
    {
        " of Z, Dih, also denoted by D ∞ .   the group generated by all translations ; this group cannot be the symmetry group of a Euclidean figure, even endowed with a pattern: such a pattern would be homogeneous, hence could also be reflected. However, a constant one-dimensional vector field has this symmetry group.   the group generated by all translations and reflections in points; they are isomorphic with the ": null
    },
    {
        "generalized dihedral group": "dihedral groupgeneralizations"
    },
    {
        " Dih.     See also ": null
    },
    {
        "symmetry groups in one dimension": "symmetry groups in one dimension"
    },
    {
        ".       ": null
    },
    {
        "Up to": "up to"
    },
    {
        " conjugacy the discrete point groups in two-dimensional space are the following classes:     ": null
    },
    {
        "cyclic group": "cyclic group"
    },
    {
        "s C 42 , C 42 , C 42 , C 42 , ... where C n consists of all rotations about a fixed point by multiples of the angle 42°/n ": null
    },
    {
        "dihedral group": "dihedral group"
    },
    {
        "s D 42 , D 42 , ": null
    },
    {
        "D 42 ": "dihedral group of order 6"
    },
    {
        ", ": null
    },
    {
        "D 42 ": "examples of groupsa symmetry group"
    },
    {
        ", ..., where D n  consists of the rotations in C n together with reflections in n axes that pass through the fixed point.     C 42 is the ": null
    },
    {
        "trivial group": "trivial group"
    },
    {
        " containing only the identity operation, which occurs when the figure is asymmetric, for example the letter F . C 42 is the symmetry group of the letter Z , C 42 that of a ": null
    },
    {
        "triskelion": "triskelion"
    },
    {
        ", C 42 of a ": null
    },
    {
        "swastika": "swastika"
    },
    {
        ", and C 42 , C 42 , etc. are the symmetry groups of similar swastika-like figures with five, six, etc. arms instead of four.     D 42 is the 42-element group containing the identity operation and a single reflection, which occurs when the figure has only a single axis of ": null
    },
    {
        "bilateral symmetry": "reflection symmetry"
    },
    {
        ", for example the letter A .     D 42 , which is isomorphic to the ": null
    },
    {
        "Klein four-group": "klein four-group"
    },
    {
        ", is the symmetry group of a non-equilateral rectangle. This figure has four symmetry operations: the identity operation, one twofold axis of rotation, and two nonequivalent mirror planes.     D 42 , D 42 etc. are the symmetry groups of the ": null
    },
    {
        "regular polygon": "regular polygon"
    },
    {
        "s.     Within each of these symmetry types, there are two ": null
    },
    {
        "degrees of freedom": "degrees of freedom"
    },
    {
        " for the center of rotation, and in the case of the dihedral groups, one more for the positions of the mirrors.     The remaining isometry groups in two dimensions with a fixed point are:   the special ": null
    },
    {
        "orthogonal group": "orthogonal group"
    },
    {
        " SO consisting of all rotations about a fixed point; it is also called the ": null
    },
    {
        "circle group": "circle group"
    },
    {
        " S 42 , the multiplicative group of ": null
    },
    {
        "complex number": "complex number"
    },
    {
        "s of ": null
    },
    {
        "absolute value": "absolute value"
    },
    {
        " 42 It is the proper symmetry group of a circle and the continuous equivalent of C n . There is no geometric figure that has as full symmetry group the circle group, but for a vector field it may apply .   the orthogonal group O consisting of all rotations about a fixed point and reflections in any axis through that fixed point. This is the symmetry group of a circle. It is also called Dih as it is the ": null
    },
    {
        "generalized dihedral group": "dihedral group"
    },
    {
        " of S 42 .     Non-bounded figures may have isometry groups including translations; these are:   the 42 ": null
    },
    {
        "frieze group": "frieze group"
    },
    {
        "s   the 42 ": null
    },
    {
        "wallpaper group": "wallpaper group"
    },
    {
        "s   for each of the symmetry groups in one dimension, the combination of all symmetries in that group in one direction, and the group of all translations in the perpendicular direction   ditto with also reflections in a line in the first direction.               ": null
    },
    {
        "Up to": "up to"
    },
    {
        " conjugacy the set of three-dimensional point groups consists of 42 infinite series, and 42 other individual groups. In crystallography, only those point groups are considered which preserve some crystal lattice . This ": null
    },
    {
        "crystallographic restriction": "crystallographic restriction theorem"
    },
    {
        " of the infinite families of general point groups results in 42 crystallographic point groups .     The continuous symmetry groups with a fixed point include those of:   cylindrical symmetry without a symmetry plane perpendicular to the axis, this applies for example for a beer ": null
    },
    {
        "bottle": "bottle"
    },
    {
        " scalar field": "scalar field"
    },
    {
        " patterns, the cylindrical symmetry implies vertical reflection symmetry as well. However, this is not true for ": null
    },
    {
        "vector field": "vector field"
    },
    {
        " patters: for example, in ": null
    },
    {
        "cylindrical coordinates": "cylindrical coordinates"
    },
    {
        " with respect to some axis, the vector field   \\mathbf A_\\rho\\boldsymbol + A_\\phi\\boldsymbol + A_z\\boldsymbol has cylindrical symmetry with respect to the axis whenever A_\\rho, A_\\phi, and A_z have this symmetry ; and it has reflectional symmetry only when A_\\phi 42 .     For spherical symmetry, there is no such distinction: any patterned object has planes of reflection symmetry.     The continuous symmetry groups without a fixed point include those with a ": null
    },
    {
        "screw axis": "screw axis"
    },
    {
        ", such as an infinite ": null
    },
    {
        "helix": "helix"
    },
    {
        ". See also ": null
    },
    {
        "subgroups of the Euclidean group": "euclidean groupsubgroups"
    },
    {
        ".          In wider contexts, a symmetry group may be any kind of transformation group, or ": null
    },
    {
        "automorphism": "automorphism"
    },
    {
        " group. Each type of ": null
    },
    {
        "mathematical structure": "mathematical structure"
    },
    {
        " has ": null
    },
    {
        "invertible mappings": "bijection"
    },
    {
        " which preserve the structure. Conversely, specifying the symmetry group can define the structure, or at least clarify the meaning of geometric congruence or invariance; this is one way of looking at the ": null
    },
    {
        "Erlangen programme": "erlangen programme"
    },
    {
        ".     For example, objects in a hyperbolic ": null
    },
    {
        "non-Euclidean geometry": "non-euclidean geometry"
    },
    {
        " have ": null
    },
    {
        "Fuchsian symmetry groups": "fuchsian group"
    },
    {
        ", which are the discrete subgroups of the isometry group of the hyperbolic plane, preserving hyperbolic rather than Euclidean distance.  Similarly, automorphism groups of ": null
    },
    {
        "finite geometries": "finite geometry"
    },
    {
        " preserve families of point-sets rather than Euclidean subspaces, distances, or inner products. Just as for Euclidean figures, objects in any geometric space have symmetry groups which are subgroups of the symmetries of the ambient space.     Another example of a symmetry group is that of a ": null
    },
    {
        "combinatorial graph": "graph"
    },
    {
        ": a graph symmetry is a permutation of the vertices which takes edges to edges. Any ": null
    },
    {
        "finitely presented group": "presentation of a group"
    },
    {
        " is the symmetry group of its ": null
    },
    {
        "Cayley graph": "cayley graph"
    },
    {
        "; the ": null
    },
    {
        "free group": "free group"
    },
    {
        " is the symmetry group of an infinite ": null
    },
    {
        "tree graph": "tree"
    },
    {
        ".       ": null
    },
    {
        "Cayleys theorem": "cayleys theorem"
    },
    {
        " states that any abstract group is a subgroup of the permutations of some set X, and so can be considered as the symmetry group of X with some extra structure. In addition, many abstract features of the group can be interpreted in terms of symmetries.     For example, let G Sym be the finite symmetry group of a figure X in a Euclidean space, and let H & sub; G be a subgroup. Then H can be interpreted as the symmetry group of X + , a decorated version of X. Such a decoration may be constructed as follows. Add some patterns such as arrows or colors to X so as to break all symmetry, obtaining a figure X with Sym , the trivial subgroup; that is, gX & ne; X for all non-trivial g & isin; G. Now we get:   :   X^+ \\ \\ \\bigcup_ hX^ \\quad\\text\\quad   H \\mathrm.       ": null
    },
    {
        "Normal subgroup": "normal subgroup"
    },
    {
        "s may also be characterized in this framework.   The symmetry group of the translation gX + is the conjugate subgroup gHg & minus;42 . Thus H is normal whenver:   :   \\mathrm \\mathrm \\ \\ \\text \\ g\\in G;     that is, whenever the decoration of X + may be drawn in any orientation, with respect to any side or feature of X, and still yield the same symmetry group gHg & minus;42 H.     As an example, consider the dihedral group G D 42 Sym, where X is an equilateral triangle. We may decorate this with an arrow on one edge, obtaining an asymmetric figure X . Letting & tau; & isin; G be the reflection of the arrowed edge, the composite figure X + X & cup; & tau;X has a bidirectional arrow on that edge, and its symmetry group is H . This subgroup is not normal, since gX + may have the bi-arrow on a different edge, giving a different reflection symmetry group.     However, letting H & sub; D 42 be the cyclic subgroup generated by a rotation, the decorated figure X + consists of a 42-cycle of arrows with consistent orientation. Then H is normal, since drawing such a cycle with either orientation yields the same symmetry group H": null
    }
]