[
    {
        "        System analysis in the field of ": null
    },
    {
        "electrical engineering": "electrical engineering"
    },
    {
        " that characterizes electrical systems and their properties. System analysis can be used to represent almost anything from population growth to audio speakers; electrical engineers often use it because of its direct relevance to many areas of their discipline, most notably ": null
    },
    {
        "signal processing": "signal processing"
    },
    {
        ", ": null
    },
    {
        "communication systems": "telecommunications"
    },
    {
        " and ": null
    },
    {
        "control systems": "control theory"
    },
    {
        ".       A system is characterized by how it responds to input ": null
    },
    {
        "signals": "electrical signal"
    },
    {
        ". In general, a system has one or more input signals and one or more output signals. Therefore, one natural characterization of systems is by how many inputs and outputs they have:    SISO    SIMO   MISO    MIMO      It is often useful to break up a system into smaller pieces for analysis. Therefore, we can regard a SIMO system as multiple SISO systems , and similarly for a MIMO system. By far, the greatest amount of work in system analysis has been with SISO systems, although many parts inside SISO systems have multiple inputs .     Signals can be ": null
    },
    {
        "continuous": "continuous signal"
    },
    {
        " or ": null
    },
    {
        "discrete": "discrete signal"
    },
    {
        " in time, as well as continuous or discrete in the values they take at any given time:   Signals that are continuous in time and continuous in value are known as  analog signal s.   Signals that are discrete in time and discrete in value are known as  digital signal s.   Signals that are discrete in time and continuous in value are called discrete-time signals. ": null
    },
    {
        "Switched capacitor": "switched capacitor"
    },
    {
        " systems, for instance, are often used in integrated circuits. The methods developed for analyzing discrete time signals and systems are usually applied to digital and analog signals and systems.   Signals that are continuous in time and discrete in value are sometimes seen in the timing analysis of ": null
    },
    {
        "logic circuits": "digital circuit"
    },
    {
        " or ": null
    },
    {
        "PWM amplifier": "pwm amplifier"
    },
    {
        "s, but have little to no use in system analysis.     With this categorization of signals, a system can then be characterized as to which type of signals it deals with:   A system that has analog input and analog output is known as an analog system.   A system that has digital input and digital output is known as a digital system.   Systems with analog input and digital output or digital input and analog output are possible. However, it is usually easiest to break these systems up for analysis into their analog and digital parts, as well as the necessary ": null
    },
    {
        "analog to digital": "analog to digital converter"
    },
    {
        " or ": null
    },
    {
        "digital to analog converter": "digital to analog converter"
    },
    {
        ".     Another way to characterize systems is by whether their output at any given time depends only on the input at that time or perhaps on the input at some time in the past .   Memoryless systems do not depend on any past input. In common usage memoryless systems are also independent of future inputs. An interesting consequence of this is that the impulse response of any memoryless system is itself a scaled impulse.   Systems with memory do depend on past input.   Causal systems do not depend on any future input.   Non-causal or anticipatory systems do depend on future input.   :Note: It is not possible to physically realize a non-causal system operating in real time . However, from the standpoint of analysis, they are important for two reasons. First, the ideal system for a given application is often a noncausal system, which although not physically possible can give insight into the design of a derived causal system to accomplish a similar purpose. Second, there are instances when a system does not operate in real time but is rather simulated off-line by a computer, such as post-processing an audio or video recording.   :Further, some non-causal systems can operate in pseudo-real time by introducing lag: if a system depends on input for 42 second in future, it can process in real time with 42 second lag.     Analog systems with memory may be further classified as lumped or distributed. The difference can be explained by considering the meaning of memory in a system. Future output of a system with memory depends on future input and a number of state variables, such as values of the input or output at various times in the past. If the number of state variables necessary to describe future output is finite, the system is lumped; if it is infinite, the system is distributed.     Finally, systems may be characterized by certain properties which facilitate their analysis:   A system is  linear  if it has the superposition and scaling properties. A system that is not linear is  non-linear .   If the output of a system does not depend explicitly on time, the system is said to be ": null
    },
    {
        "time-invariant": "time-invariant system"
    },
    {
        "; otherwise it is ": null
    },
    {
        "time-variant": "time-variant system"
    },
    {
        " deterministic": "deterministic system"
    },
    {
        ".   A system that will produce different outputs for a given input is said to be ": null
    },
    {
        "stochastic": "stochastic"
    },
    {
        ".     There are many methods of analysis developed specifically for linear time-invariant  deterministic systems. Unfortunately, in the case of analog systems, none of these properties are ever perfectly achieved. Linearity implies that operation of a system can be scaled to arbitrarily large magnitudes, which is not possible. Time-invariance is violated by aging effects that can change the outputs of analog systems over time . ": null
    },
    {
        "Thermal noise": "thermal noise"
    },
    {
        " and other random phenomena ensure that the operation of any analog system will have some degree of stochastic behavior. Despite these limitations, however, it is usually reasonable to assume that deviations from these ideals will be small.          As mentioned above, there are many methods of analysis developed specifically for ": null
    },
    {
        "LTI systems": "lti system theory"
    },
    {
        ". This is due to their simplicity of specification. An ": null
    },
    {
        "LTI system": "lti system theory"
    },
    {
        " is completely specified by its ": null
    },
    {
        "transfer function": "transfer function"
    },
    {
        " . Alternatively, we can think of an LTI system being completely specified by its ": null
    },
    {
        "frequency response": "frequency response"
    },
    {
        ". A third way to specify an LTI system is by its characteristic ": null
    },
    {
        "linear differential equation": "linear differential equation"
    },
    {
        " or linear ": null
    },
    {
        "difference equation": "difference equation"
    },
    {
        " . Which description is most useful depends on the application.     The distinction between ": null
    },
    {
        " lumped": "lumped-element model"
    },
    {
        " and ": null
    },
    {
        " distributed": "distributed-element model"
    },
    {
        " LTI systems is important. A lumped LTI system is specified by a finite number of parameters, be it the ": null
    },
    {
        "zeros and poles": "zeros and poles"
    },
    {
        " of its transfer function, or the ": null
    },
    {
        "coefficient": "coefficient"
    },
    {
        "s of its differential equation, whereas specification of a distributed LTI system requires a complete ": null
    },
    {
        "function": "function"
    }
]