[
    {
        "Szczerbiec  is the ": null
    },
    {
        "coronation": "coronation"
    },
    {
        " sword": "sword"
    },
    {
        " that was used in crowning ceremonies of most ": null
    },
    {
        "Polish monarchs": "list of polish monarchs"
    },
    {
        " from 42 to 42 It is currently on display in the treasure vault of the Royal ": null
    },
    {
        "Wawel Castle": "wawel castle"
    },
    {
        " in ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " as the only preserved piece of the medieval ": null
    },
    {
        "Polish Crown Jewels": "polish crown jewels"
    },
    {
        ". The sword is characterized by a hilt decorated with magical formulas, ": null
    },
    {
        "Christian symbols": "christian symbolism"
    },
    {
        " and floral patterns, as well as a narrow slit in the blade which holds a small shield with the ": null
    },
    {
        "coat of arms of Poland": "coat of arms of poland"
    },
    {
        ". Its name, derived from the ": null
    },
    {
        "Polish": "polish language"
    },
    {
        " word  szczerba , meaning a gap, notch or chip, is sometimes rendered into English as the Notched Sword or the Jagged Sword , although its blade has straight and smooth edges.     A legend links Szczerbiec with King ": null
    },
    {
        "Bolesław I the Brave": "bolesław i the brave"
    },
    {
        " who was said to have chipped the sword by hitting it against the ": null
    },
    {
        "Golden Gate, Kiev": "golden gate, kiev"
    },
    {
        " during ": null
    },
    {
        "his intervention in the Kievan succession crisis": "bolesław is intervention in the kievan succession crisis"
    },
    {
        " in 42 However, the Golden Gate was only constructed in 42 and the sword is actually dated to the late 42th or 42th century. It was first used as a coronation sword by ": null
    },
    {
        "Władysław I the Elbow-high": "władysław i the elbow-high"
    },
    {
        " in 42 Looted by ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n troops in 42 it changed hands several times during the 42th century until it was purchased in 42 for the ": null
    },
    {
        "Hermitage Museum": "hermitage museum"
    },
    {
        " in ": null
    },
    {
        "Saint Petersburg": "saint petersburg"
    },
    {
        ", Russia. The ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " returned it to Poland in 42 During ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Szczerbiec was evacuated to Canada and did not return to Kraków until 42 In the 42th century, an image of the sword was adopted as a symbol by Polish ": null
    },
    {
        "nationalist": "nationalism"
    },
    {
        " and ": null
    },
    {
        "far-right": "far-right politics"
    },
    {
        " movements.               Szczerbiec is a  ": null
    },
    {
        "ceremonial sword": "ceremonial weapon"
    },
    {
        " bearing rich ": null
    },
    {
        "Gothic": "gothic art"
    },
    {
        " ornamentation, dated to the mid42th century. It is classified as a type XII sword with a type  ": null
    },
    {
        "pommel": "hiltpommel"
    },
    {
        " and a type 42 ": null
    },
    {
        "crossguard": "crossguard"
    },
    {
        " according to the ": null
    },
    {
        "Oakeshott typology": "oakeshott typology"
    },
    {
        ", although the blade may have changed its shape due to centuries of corrosion and intensive cleaning before every coronation.            The hilt consists of a round pommel, a flat grip and an arched crossguard. The grip is  long,  thick, and from  wide. It is rectangular in cross-section and its hard edges make it difficult to handle and impractical for fighting, which is indicative of the swords purely ceremonial usage. The pommel is  in diameter and  thick, with a chamfered outer ring that is  wide. The crossguard forms an arch that is  wide in the middle and widens up to  at both ends. It is  thick near the grip and measures  in length along its upper edge.     The pommel and the crossguard are made of silver. The core of the grip is a brass chest encasing the ": null
    },
    {
        "tang": "tang"
    },
    {
        " of the blade. It was probably made in the 42th century to replace an original organic core, which had decomposed. At the same time the tang was riveted to the top of the pommel. The head of the rivet, which is  in diameter, rests atop a rectangular washer measuring .     All parts of the hilt are covered with golden plates, which are engraved with sharp or rounded ": null
    },
    {
        "styli": "stylus"
    },
    {
        " and decorated with ": null
    },
    {
        "niello": "niello"
    },
    {
        ", or black metallic inlay that contrasts against the golden background. Each plate is  thick and made of about 42-": null
    },
    {
        "carat": "carat"
    },
    {
        " gold. The niello designs include inscriptions written in late ": null
    },
    {
        "Romanesque": "romanesque art"
    },
    {
        " majuscule": "majuscule"
    },
    {
        " , ": null
    },
    {
        "Christian symbols": "christian symbolism"
    },
    {
        ", and floral patterns. The floral ornaments are in negative, that is, golden against a black, nielloed background.          On the ": null
    },
    {
        "obverse": "obverse and reverse"
    },
    {
        " side of the hilt, the pommel bears a large stylized letter T on top of a letter C or G  between the ": null
    },
    {
        "Greek": "greek alphabet"
    },
    {
        " letters Α and ω  surmounted with little ": null
    },
    {
        "cross": "cross"
    },
    {
        "es. Below the letter T, there is another cross placed within a cloud or flower with twelve petals. On the chamfered edge around this design runs a circular ": null
    },
    {
        "Latin": "latin"
    },
    {
        " inscription in two rings which reads: Rec figura talet ad amorem regum / et principum iras iudicum . The grip bears the symbols of two of the ": null
    },
    {
        "Four Evangelists": "four evangelists"
    },
    {
        ": the lion of ": null
    },
    {
        "Saint Mark": "mark the evangelist"
    },
    {
        " and the ox of ": null
    },
    {
        "Saint Luke": "luke the evangelist"
    },
    {
        ", as well as an Agnus Dei . The crossguard bears the following Latin inscription: Quicumque hec / nomina Deii secum tu/lerit nullum periculum / ei omnino nocebit .          The reverse side of the pommel is decorated with a vine bush surrounded by a wreath of vine leaves. On the reverse of the grip, there are the eagle of ": null
    },
    {
        "Saint John": "john the evangelist"
    },
    {
        " and the angel of ": null
    },
    {
        "Saint Matthew": "matthew the evangelist"
    },
    {
        ", and another Agnus Dei. The crossguard bears, above another pattern of vine leaves, an inscription in corrupted ": null
    },
    {
        "Hebrew": "hebrew language"
    },
    {
        " in Latin script: Con citomon Eeve Sedalai Ebrebel . On the opposite ends of the crossguard, there are again the symbols of Saints John and Matthew.     The circumference of the pommel is decorated with a rhombic pattern, while the upper side of the crossguard – with a similar triangular pattern. The narrow sides of the grip used to be embellished with inscribed silver plates, which, however, were lost in the 42th century. These lost inscriptions are partly known from graphical documentation made by King ": null
    },
    {
        "Stanislaus Augustuss": "stanislaus ii of poland"
    },
    {
        " court painter, ": null
    },
    {
        "Johann Christoph Werner": "johann christoph werner"
    },
    {
        ", in 42 and by Jacek Przybylski in 42 One of the plates had already been broken by that time with only part of the inscription preserved: Liste est glaud... h Bolezlai Duc... ; the inscription on the other plate continued: Cum quo ei D SOS Salvator Omnipotens Salvator auxiletur ad us partes amen . The missing part of the first inscription is only known from an old replica of Szczerbiec which once belonged to the ": null
    },
    {
        "Radziwiłł family": "radziwiłł family"
    },
    {
        " . The full inscription read: Iste est gladius Principis et haeredis Boleslai Ducis Poloniae et Masoviae, Lanciciae . The identity of this Duke Boleslaus is uncertain.             ": null
    },
    {
        "Use-wear analysis": "use-wear analysis"
    },
    {
        " indicates that the plates on the pommel and the crossguard were made by the same artist, while the plates on the grip were added later. The latter – obverse and reverse – were probably decorated in the same workshop and using the same tools, but by two different craftsmen. Moreover, a side plate with a rhombic pattern was added in the 42th century to replace one of the lost inscribed side plates.     Preserved images of Szczerbiec from various points in time indicate that the decorative plates were several times dismounted and placed again on the hilt in variable configurations. The current composition, with the symbols of the Evangelists duplicated on each side of the hilt, matches that known from the earliest preserved depiction drafted by ": null
    },
    {
        "Johann Christoph Werner": "johann christoph werner"
    },
    {
        " in 42 It is possible, though, that the original placement of the golden plates was different, with the symbols of Saints John and Matthew on the obverse of the grip, so that each side of the hilt displayed the symbols of all four of the Evangelists.       The blade is  long, up to  wide and  thick. The ": null
    },
    {
        "fuller": "fuller"
    },
    {
        " is about  long and, on average,  wide. ": null
    },
    {
        "Metallographic": "metallography"
    },
    {
        " analysis has shown that the blade was forged from unevenly ": null
    },
    {
        "carburized": "carburizing"
    },
    {
        " semi-hard ": null
    },
    {
        "bloomery": "bloomery"
    },
    {
        " steel. Apart from ": null
    },
    {
        "iron": "iron"
    },
    {
        ", the material contains, by weight, 42 percent of ": null
    },
    {
        "carbon": "carbon"
    },
    {
        ", 42 percent of ": null
    },
    {
        "silicon": "silicon"
    },
    {
        ", 42 percent of ": null
    },
    {
        "phosphorus": "phosphorus"
    },
    {
        ", and other elements. Numerous ": null
    },
    {
        "slag": "slag"
    },
    {
        " inclusions found in the steel are typical for medieval iron smelting technology. Part of the blade was hardened by ": null
    },
    {
        "quenching": "quenching"
    },
    {
        ". Unlike the hilt, the blade would have been fully functional as a weapon of war. The surface of the blade is covered with deep scratches along its length, a result of intensive cleaning from rust before every coronation, probably with sand or brick powder. Inactive spots of corrosion may be also found on the entire surface.     Just below the hilt, there are three perforations in the fuller of the blade. The largest is a rectangular slot that is  long and  wide. This opening, known in Polish as szczyrba or szczerba, was originally caused by rust and, in the 42th century, polished into a regular shape. A small heraldic shield colored with oil paint is fastened to the slot. It is roughly triangular in shape, with the sides measuring from . The shield, bearing the ": null
    },
    {
        "White Eagle": "coat of arms of poland"
    },
    {
        " of Poland, was originally attached to the ": null
    },
    {
        "scabbard": "scabbard"
    },
    {
        ", or sheath. The Gothic scabbard, with a golden or silver locket and chape, was probably created in 42 and lost between 42 and 42 The shield is the only preserved element of the sheath. It was tilted to the left – from the onlookers point of view – while it was fastened to the scabbards locket, but today it is aligned with the blade. The eagle on the red field of the shield is white, with a golden crown, bands across the wings, ring on the tail, and talons. The two other perforations are round holes,  apart. The upper one, just below the slot, is  in diameter, while the other measures only . They were probably punched in the 42th century to fasten the heraldic shield to the blade.            Szczerbiec is owned by the ": null
    },
    {
        "Wawel Royal Castle National Art Collection": "wawel royal castle national art collection"
    },
    {
        "  in ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        ", the former capital city of Poland. As the only preserved of Polish medieval coronation insignia, it is a prominent part of the museums Treasury and Armory permanent exhibition. The sword is suspended horizontally inside a glass case in the middle of the ": null
    },
    {
        "Jagiełło": "władysław ii jagiełło"
    },
    {
        " and ": null
    },
    {
        "Hedwig": "jadwiga of poland"
    },
    {
        " Vault located on the ground floor in the northeastern corner of the ": null
    },
    {
        "Wawel Castle": "wawel castle"
    },
    {
        ".         Historical accounts related to the early history of the Polish coronation sword are scant and often mixed with legend. The earliest known use of the name Szczerbiec appeared in the  Chronicle of Greater Poland  at the turn of the 42th century. According to this source, the sword was given to King ": null
    },
    {
        "Boleslaus the Brave": "boleslaus i of poland"
    },
    {
        " by an angel; Polish kings were supposed to always carry it in battle to triumph over their enemies. During Boleslauss invasion of ": null
    },
    {
        "Kievan Rus": "kievan rus"
    },
    {
        ", he hit it against the ": null
    },
    {
        "Golden Gate": "golden gate"
    },
    {
        " of ": null
    },
    {
        "Kiev": "kiev"
    },
    {
        " while capturing the city. It was the notch that appeared on the edge of the blade which gave the sword its name. This account, written three centuries after the events it describes, is implausible not only because of the customary reference to the swords supernatural origin , but also because ": null
    },
    {
        "Boleslauss intervention in the Kievan succession crisis": "boleslaw is intervention in the kievan succession crisis, 1018"
    },
    {
        " took place in 42 or about 42 years before the actual construction of the Golden Gate in 42          It is plausible, though, that Boleslaus did chip his sword by striking it against an earlier gate in Kiev. His great-grandson, ": null
    },
    {
        "Boleslaus the Bold": "boleslaus ii of poland"
    },
    {
        " , hit the Golden Gate with a sword in 42 which would indicate that it was a customary gesture of gaining control over a city. It is also possible that this sword was preserved as a souvenir of past victories venerated by Boleslaus the Braves successors. According to ": null
    },
    {
        "Wincenty Kadłubek": "wincenty kadłubek"
    },
    {
        "s  Chronicle , ": null
    },
    {
        "Boleslaus Wrymouth": "boleslaus iii, duke of poland"
    },
    {
        "  had a favorite sword he called Żuraw or Grus . A scribe who copied the chronicle in 42 added the word Szczurbycz above the word Żuraw, but whether these two swords were one and the same is uncertain.     According to the Chronicle of Greater Poland, the sword was kept in the treasury of the ": null
    },
    {
        "Wawel Cathedral": "wawel cathedral"
    },
    {
        ". The ultimate fate of the original Szczerbiec is unknown. It may have been taken to ": null
    },
    {
        "Prague": "prague"
    },
    {
        ", together with other royal insignia, by King ": null
    },
    {
        "Wenceslaus II of Bohemia": "wenceslaus ii of bohemia"
    },
    {
        " after his coronation as king of Poland in ": null
    },
    {
        "Gniezno": "gniezno"
    },
    {
        " in 42 What happened with these insignia thereafter remains a mystery. Although Boleslaus the Braves notched sword has not been preserved and even its very existence is doubtful, its legend had a great impact on Polish historical memory and the treatment of its successor, the modern Szczerbiec.       The sword currently known as Szczerbiec was forged and decorated in a style characteristic of the late 42th and 42th centuries, so it could not have belonged to any of the three great Boleslauses of the 42th and early 42th centuries. Additionally, it is a purely ceremonial sword which, unlike the original Szczerbiec, was never used in combat. It was originally used as a ": null
    },
    {
        "sword of justice": "sword of justice"
    },
    {
        " , or insignia of the sovereigns judicial power, by one of the many local dukes during Polands ": null
    },
    {
        "Age of Fragmentation": "age of fragmentation"
    },
    {
        ". A silver plate, now lost, on the swords grip bore an inscription which indicated a duke by the name Boleslaus as its original owner. An inscription on the Radziwiłłs replica of Szczerbiec, now also lost, could provide an additional hint as to the dukes identity: Boleslaus, Duke of Poland, ": null
    },
    {
        "Masovia": "masovia"
    },
    {
        ", and ": null
    },
    {
        "Łęczyca": "łęczyca"
    },
    {
        " – except that no duke of this name and titles ever existed. Historians have variously identified the duke in question as ": null
    },
    {
        "Boleslaus the Curly": "bolesław iv the curly"
    },
    {
        " , ": null
    },
    {
        "Boleslaus the Chaste": "bolesław v the chaste"
    },
    {
        " , ": null
    },
    {
        "Boleslaus I of Masovia": "boleslaw i of masovia"
    },
    {
        "  or ": null
    },
    {
        "Boleslaus the Pious": "bolesław the pious"
    },
    {
        " of ": null
    },
    {
        "Greater Poland": "greater poland"
    },
    {
        " .     As a coronation sword, Szczerbiec was first specifically mentioned by ": null
    },
    {
        "Jan Długosz": "jan długosz"
    },
    {
        " in his account of the crowning of King ": null
    },
    {
        "Casimir IV": "casimir iv jagiellon"
    },
    {
        " , but it was probably first used in a coronation ceremony by King ": null
    },
    {
        "Vladislaus the Elbow-High": "vladislaus i of poland"
    },
    {
        "  in 42 by which time he had reunited most of the core territories of Poland. If Szczerbiec had previously belonged to his uncle, Boleslaus I of Masovia, or his father-in-law, Boleslaus the Pious, then he could have inherited it. If it had belonged to any of the two Boleslauses who had ruled from ": null
    },
    {
        "Kraków": "kraków"
    },
    {
        " as high dukes of all Poland, then Vladislaus could have simply found it in the ": null
    },
    {
        "Wawel Cathedral": "wawel cathedral"
    },
    {
        ". Thereafter, Szczerbiec became an integral part of the ": null
    },
    {
        "Polish Crown Jewels": "polish crown jewels"
    },
    {
        ", shared their fate, and was the principal ceremonial sword used in coronations of all ": null
    },
    {
        "Polish kings": "list of polish monarchs"
    },
    {
        " until 42 except ": null
    },
    {
        "Vladislaus II Jogaila": "jogaila"
    },
    {
        " , ": null
    },
    {
        "Stephen Báthory": "stephen báthory of poland"
    },
    {
        " , ": null
    },
    {
        "Stanislaus I Leszczyński": "stanislaus i of poland"
    },
    {
        " , and ": null
    },
    {
        "Augustus III Wettin": "augustus iii of poland"
    },
    {
        " .          Szczerbiec, together with other crown jewels, was removed from the ": null
    },
    {
        "Wawel Hill": "wawel hill"
    },
    {
        " on several occasions during that period. After his Polish coronation in 42 King ": null
    },
    {
        "Louis I of Hungary": "louis i of hungary"
    },
    {
        " took the crown jewels with him to ": null
    },
    {
        "Buda": "buda"
    },
    {
        "; his successor on the Hungarian throne, ": null
    },
    {
        "Emperor Sigismund": "sigismund, holy roman emperor"
    },
    {
        ", rendered them to Poland in 42 On two occasions, in mid42th and early 42th centuries, they were evacuated across Polands southern border to protect them from invading Swedish armies. In 42 during the ": null
    },
    {
        "War of the Polish Succession": "war of the polish succession"
    },
    {
        ", supporters of King ": null
    },
    {
        "Stanislaus I": "stanislaus i of poland"
    },
    {
        " concealed the jewels in a ": null
    },
    {
        "Warsaw": "warsaw"
    },
    {
        " church for three years to prevent ": null
    },
    {
        "Augustus III": "augustus iii of poland"
    },
    {
        " from using them in his coronation. In 42 they were sent to Warsaw again, to be used in a coronation for the last time – that of ": null
    },
    {
        "Stanislaus Augustus Poniatowski": "stanislaus ii of poland"
    },
    {
        ". They were returned to Kraków afterwards.     During a typical Polish coronation ceremony in the times of the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        ", the king-elect received Szczerbiec after his ": null
    },
    {
        "anointment": "anointing"
    },
    {
        " and before being crowned and ": null
    },
    {
        "enthroned": "enthronement"
    },
    {
        ". The ": null
    },
    {
        "primate of Poland": "list of archbishops of gniezno and primates of poland"
    },
    {
        ", that is the archbishop of ": null
    },
    {
        "Gniezno": "gniezno"
    },
    {
        ", picked up the unsheathed sword from the altar and handed it to the kneeling king. At the same time, he recited a formula which asked the monarch to use the sword to rule justly, defend the Church, fight evil, protect widows and orphans, and to rebuild what is damaged, maintain what is rebuilt, avenge what is unjust, reinforce what is well managed, etc. Then, the king handed the sword to the Crown sword-bearer , who slid it into the scabbard and passed on to the primate. The primate, aided by the Crown and Lithuanian sword-bearers, fastened the scabbard to the kings belt. The king stood up and, facing onlookers, withdrew Szczerbiec, made three times the ": null
    },
    {
        "sign of the cross": "sign of the cross"
    },
    {
        " with it, and wiped it against his left arm before replacing it in the scabbard. The kings sword-wielding abilities were closely watched by his new subjects during this part of the ritual. When Augustus III betrayed his poor fencing skills at his coronation, nobles joked that they were going to have a peaceful lord . After Szczerbiec, a bishop handed the sovereign the ": null
    },
    {
        "Grunwald Swords": "grunwald swords"
    },
    {
        " symbolizing the monarchs reign over the two constituent nations of the Commonwealth.     Throughout the period from ": null
    },
    {
        "Casimir the Great": "casimir iii the great"
    },
    {
        "  to Stanislaus Augustus, Polish crown jewels were commonly believed to date back to the times of Boleslaus the Brave. This conviction helped maintain a sense of continuity of Polish statehood and provide ": null
    },
    {
        "legitimacy": "legitimacy"
    },
    {
        " for the nations kings, implicitly making each Polish monarch a successor of the ancient and glorious legacy of the first king of the ": null
    },
    {
        "House of Piast": "house of piast"
    },
    {
        ". Accordingly, the coronation sword took over the name and the legend of the original Szczerbiec. The corrosion-induced slit in the blade became associated with the fabled szczerba, or notch that Boleslaus had purportedly made on his sword in Kiev. The power of tradition was so strong that when Stanislaus Augustuss court painter, ": null
    },
    {
        "Marcello Bacciarelli": "marcello bacciarelli"
    },
    {
        ", who had made detailed studies of Polish crown jewels, painted an imaginary portrait of Boleslaus the Brave, he chose to depict Szczerbiec so that its appearance agreed with legend rather than reality. The images of the ": null
    },
    {
        "coronation crown": "crown of bolesław i the brave"
    },
    {
        " and sword are overall meticulously accurate, but Bacciarellis Szczerbiec lacks the slit and has a chipped edge instead.               In 42 during the failed ": null
    },
    {
        "Kościuszko Uprising": "kościuszko uprising"
    },
    {
        " which led to the ": null
    },
    {
        "final partition of Poland": "third partition of poland"
    },
    {
        " a year later, ": null
    },
    {
        "Prussia": "prussia"
    },
    {
        "n troops captured Kraków. In the following year, on King ": null
    },
    {
        "Frederick William II": "frederick william ii of prussia"
    },
    {
        "s orders, the treasure vault of the Wawel Castle was looted and the crown jewels taken to Breslau , then to ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        ", and finally to Königsberg . Between 42 and 42 most of the jewels were melted down, but some, including Szczerbiec, were put up for sale. The coronation sword was acquired by the future Russian minister of justice, Prince ": null
    },
    {
        "Dmitry Lobanov-Rostovsky": "dmitry ivanovich lobanov-rostovsky"
    },
    {
        ", who probably hoped to resell it to one of Polish aristocrats. In 42 he approached General ": null
    },
    {
        "Wincenty Krasiński": "wincenty krasiński"
    },
    {
        ", speaker of the ": null
    },
    {
        "Sejm": "sejm of the republic of poland"
    },
    {
        " of the ": null
    },
    {
        " Congress Kingdom of Poland": "congress poland"
    },
    {
        ". The prince did not disclose the actual source of the sword and claimed to have bought it in ": null
    },
    {
        "Moscow": "moscow"
    },
    {
        " from an Armenian merchant who had found the weapon somewhere between ": null
    },
    {
        "Belgrade": "belgrade"
    },
    {
        " and Rusçuk  during the recent ": null
    },
    {
        "Russo-Turkish War": "russo-turkish war"
    },
    {
        ". Krasiński, who was a known antique weapon collector, suspected it could be Szczerbiec, but asked Prof. ": null
    },
    {
        "Sebastiano Ciampi": "sebastiano ciampi"
    },
    {
        ", a historian of the ": null
    },
    {
        "Warsaw University": "warsaw university"
    },
    {
        ", for opinion. Ciampi examined the ": null
    },
    {
        "lithography": "lithography"
    },
    {
        " Krasiński had had made of the sword, but was unsure whether it was the actual Szczerbiec. As a consequence, Krasiński declined Lobanov-Rostovskys offer.     Lobanov-Rostovsky ultimately sold Szczerbiec to Prince ": null
    },
    {
        "Anatole Demidov": "anatole demidov"
    },
    {
        " who kept it together with the rest of the ": null
    },
    {
        "Demidov collection": "demidov collection"
    },
    {
        " in his ": null
    },
    {
        "Villa San Donato": "villa san donato"
    },
    {
        " near ": null
    },
    {
        "Florence": "florence"
    },
    {
        ". In 42 the sword was bought for 42 ": null
    },
    {
        "French franc": "french franc"
    },
    {
        "s by ": null
    },
    {
        "Alexander Basilevsky": "alexander basilevsky"
    },
    {
        ", Russian ambassador to France and great art collector. In 42 he displayed Szczerbiec at the ": null
    },
    {
        "Worlds Fair": "exposition universelle"
    },
    {
        " in ": null
    },
    {
        "Paris": "paris"
    },
    {
        ". By that time, the scabbard had been lost and the sword itself was presented as of ": null
    },
    {
        "Teutonic": "teutonic knights"
    },
    {
        " origin. It was seen by several Polish visitors who speculated whether it could be the Polish coronation sword. In 42 the entire Basilevsky collection was purchased by Emperor ": null
    },
    {
        "Alexander III of Russia": "alexander iii of russia"
    },
    {
        " for the ": null
    },
    {
        "Hermitage Museum": "hermitage museum"
    },
    {
        " in ": null
    },
    {
        "Saint Petersburg": "saint petersburg"
    },
    {
        ". Both Polish and other experts at the time expressed doubts as to the authenticity of Szczerbiec held in Russias largest museum . An international museum congress held in Saint Petersburg in 42 pronounced the sword a 42th-century replica.     In 42 as a result of the ": null
    },
    {
        "October Revolution": "october revolution"
    },
    {
        ", Russia became a communist state. In the aftermath of ": null
    },
    {
        "World War I": "world war i"
    },
    {
        ", Poland reemerged as an independent country in the following year. From 42 to 42 the two states fought the ": null
    },
    {
        "Polish–Soviet War": "polish–soviet war"
    },
    {
        " which was concluded with the ": null
    },
    {
        "Peace of Riga": "peace of riga"
    },
    {
        ". Article 42 of the peace treaty required that the ": null
    },
    {
        "Soviet": "soviet union"
    },
    {
        " side return all culturally significant collections and items that had been removed from Poland since the ": null
    },
    {
        "First Partition": "first partition of poland"
    },
    {
        " in 42 A special bilateral committee was set up to carry out the restitution of cultural goods. In 42 the committees efforts resulted in the return to Poland of, among other national treasures, Szczerbiec, which, after 42 years, was deposited back in the Wawel Castle.             On 42 September 42 two days after ": null
    },
    {
        "Germany": "nazi germany"
    },
    {
        " invaded Poland triggering the ": null
    },
    {
        "Second World War": "world war i"
    },
    {
        ", began the evacuation of the most precious national treasures, including Szczerbiec, from the Wawel Castle. The cargo was transported on barges, wagons, buses and trucks to Romania. From there, it was shipped by sea to France and later to Britain. On the way from ": null
    },
    {
        "Bordeaux": "bordeaux"
    },
    {
        " to ": null
    },
    {
        "Falmouth": "falmouth, cornwall"
    },
    {
        ", the ship carrying Polish national treasures came under fire from the ": null
    },
    {
        "Luftwaffe": "luftwaffe"
    },
    {
        ". ": null
    },
    {
        "Karol Estreicher": "karol estreicher"
    },
    {
        ", who oversaw the evacuation, decided then to remove Szczerbiec from a chest and sandwich it between two wooden planks, and to attach to them an explanatory ": null
    },
    {
        "message in a bottle": "message in a bottle"
    },
    {
        " – so that in the event that the ship was sunk, at least the coronation sword could be salvaged. When the ": null
    },
    {
        "German bombing of Britain": "battle of britain"
    },
    {
        " began in July 42 the valuables were transported aboard the Polish ocean liner ": null
    },
    {
        "MS Batory": "ms batory"
    },
    {
        " to Canada and finally deposited at the Polish consulate and then other locations in ": null
    },
    {
        "Ottawa": "ottawa"
    },
    {
        ". After the war, one of the custodians of the national treasures, who remained loyal to the ": null
    },
    {
        "London": "london"
    },
    {
        "-based ": null
    },
    {
        "Polish government-in-exile": "polish government-in-exile"
    },
    {
        ", was reluctant to return them to Poland, which had fallen under communist rule and Soviet influence. After lengthy negotiations, the first batch of the most important objects, including Szczerbiec, was ultimately returned in 42; the rest followed in 42 Since then, the Polish coronation sword has been on permanent display in the treasure vault of the Wawel Castle.       A treasury inventory of the ": null
    },
    {
        "Radziwiłł family": "radziwiłł family"
    },
    {
        "s ": null
    },
    {
        "Nieśwież Castle": "nesvizh castle"
    },
    {
        "  made in 42 includes a detailed description of a sword decorated with symbols of the Evangelists and inscriptions identical to those on Szczerbiec. According to the inventory, it was a gift from Crown Prince ": null
    },
    {
        "Jakub Sobieski": "jakub ludwik sobieski"
    },
    {
        " to Prince ": null
    },
    {
        "Michał Radziwiłł": "michał kazimierz   rybeńko   radziwiłł"
    },
    {
        ", but the original source of the supposed replica was not given. An inventory made in 42 of the treasure vault of the ": null
    },
    {
        "Sobieski family": "sobieski family"
    },
    {
        "s Żółkiew Castle  mentions an ": null
    },
    {
        "estoc": "estoc"
    },
    {
        "  covered with golden plates bearing images of the Four Evangelists; Skanderbeks. Based on this record, historian ": null
    },
    {
        "Aleksander Czołowski": "aleksander czołowski"
    },
    {
        " hypothesized that a replica of Szczerbiec was forged as early as 42 and awarded to ": null
    },
    {
        "George Kastrioti Skanderbeg": "skanderbeg"
    },
    {
        ", the national leader of Albania, in recognition of his victory over the ": null
    },
    {
        "Ottoman": "ottoman empire"
    },
    {
        " forces . After King ": null
    },
    {
        "John III Sobieski": "john iii of poland"
    },
    {
        " defeated the Ottomans in the ": null
    },
    {
        "Battle of Vienna": "battle of vienna"
    },
    {
        " in 42 Albanians presumably returned the sword to him. His son, Jakub, possibly passed it on to Michał Radziwiłł as a present.     There are doubts, however, whether the swords known to have been at Żółkiew in 42 and at Nieśwież two years later, were in fact the same sword. The Radziwiłłs castle was plundered by the Russian army in 42 and the subsequent fate of their replica of Szczerbiec is unknown. This fact cast doubts over the authenticity of Szczerbiec held in the Hermitage. Some experts suspected that the sword possessed by the Russian imperial museum was in fact the Nieśwież replica, not part of the original royal insignia.     Another historically notable replica of Szczerbiec was produced probably in ": null
    },
    {
        "Dresden": "dresden"
    },
    {
        ", ": null
    },
    {
        "Saxony": "duchy of saxony"
    },
    {
        ", at the time when the original was in Prussian hands. It is modest and inexact; the handle is carved in bovine bone and the niello is imitated with black paint. Designs on the handle are patterned on those of the genuine Szczerbiec, except that the crosses and letters on the pommel were replaced with the coat of arms of the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "polish–lithuanian commonwealth"
    },
    {
        ". The blade was initially shorter than that of the original, actually typical for a ": null
    },
    {
        "stiletto": "stiletto"
    },
    {
        ". It was purchased in Dresden by art historian ": null
    },
    {
        "Edward Rastawiecki": "edward rastawiecki"
    },
    {
        ", who in 42 donated it to the archeological collection of the ": null
    },
    {
        "Jagiellonian University": "jagiellonian university"
    },
    {
        " of Kraków. The university lost it during the German occupation in World War II. After the war, the replica found itself in the hands of Tadeusz Janowski who smuggled it to the United States in 42 At around that time, the short stiletto blade was replaced with a long blade of a 42th-century German sword. To imitate Szczerbiec, a slit was cut in the blade and small heraldic shields were attached to it on both sides. During the ": null
    },
    {
        "communist rule in Poland": "peoples republic of poland"
    },
    {
        ", the ": null
    },
    {
        "Polish American": "polish american"
    },
    {
        " community of ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        " treated the replica as a symbol of Polands independence. In 42 it was demonstrated to U.S. Senator ": null
    },
    {
        "Robert F. Kennedy": "robert f. kennedy"
    },
    {
        " while he was meeting with Polish Americans during ": null
    },
    {
        "his presidential campaign": "robert f. kennedy presidential campaign, 1968"
    },
    {
        ". Janowski returned the sword to the Jagiellonian University in 42            In the interwar period, a simplified image of Szczerbiec wrapped three times in a white-and-red ribbon was adopted as a symbol of Polish ": null
    },
    {
        "nationalist": "nationalism"
    },
    {
        " organizations led by ": null
    },
    {
        "Roman Dmowski": "roman dmowski"
    },
    {
        " – the ": null
    },
    {
        "Camp of Great Poland": "camp of great poland"
    },
    {
        " , the ": null
    },
    {
        "National Party": "national party"
    },
    {
        " , and the ": null
    },
    {
        "All-Polish Youth": "all-polish youth"
    },
    {
        " . Their members wore it as a badge called Mieczyk Chrobrego, or Little Sword of the Brave . The symbol was also sewn onto the left sleeve of the sand shirt which was part of the Camp of Great Poland uniform. Among the politicians who wore the badge before World War II were Roman Dmowski, ": null
    },
    {
        "Władysław Grabski": "władysław grabski"
    },
    {
        ", ": null
    },
    {
        "Wojciech Korfanty": "wojciech korfanty"
    },
    {
        ", ": null
    },
    {
        "Roman Rybarski": "roman rybarski"
    },
    {
        ", and ": null
    },
    {
        "Wojciech Jaruzelski": "wojciech jaruzelski"
    },
    {
        ". During World War II, the badge was used by right-wing anti-": null
    },
    {
        "Nazi": "nazism"
    },
    {
        " and anti-Soviet military resistance groups, the ": null
    },
    {
        "National Armed Forces": "national armed forces"
    },
    {
        "  and the ": null
    },
    {
        "National Military Organization": "national military organization"
    },
    {
        " . After the ": null
    },
    {
        "fall of communism in Poland": "end of communism in poland"
    },
    {
        ", the Mieczyk Chrobrego symbol was readopted by new or reactivated nationalist and ": null
    },
    {
        "far-right": "far right"
    },
    {
        " organizations, including ": null
    },
    {
        "League of Polish Families": "league of polish families"
    },
    {
        " , All-Polish Youth and the ": null
    },
    {
        "Camp of Great Poland": "camp of great poland"
    },
    {
        ". Additionally, Szczerbiec is the title of a periodical published since 42 by a minor radical nationalist party, the ": null
    },
    {
        "National Revival of Poland": "national revival of poland"
    },
    {
        " .          In 42 the ": null
    },
    {
        "Polish Football Association": "polish football association"
    },
    {
        ", in an attempt to fight racism among Polish football fans, prepared a blacklist of most common ": null
    },
    {
        "racist": "racism"
    },
    {
        " and ": null
    },
    {
        "fascist": "fascism"
    },
    {
        " symbols to be banned from Polish football stadiums. The catalogue, co-authored by independent ": null
    },
    {
        "anti-fascist": "anti-fascism"
    },
    {
        " organization Never Again , listed the Mieczyk Chrobrego as one of the extreme right symbols that are often displayed at the Polish stadiums. The catalogue listed other racist and fascist symbols like the Nazi ": null
    },
    {
        "swastika": "swastika"
    },
    {
        ", the ": null
    },
    {
        "Celtic cross": "celtic cross"
    },
    {
        ", and the ": null
    },
    {
        "Confederate Flag": "confederate flag"
    },
    {
        ". After a protest by ": null
    },
    {
        "MEP": "member of the european parliament"
    },
    {
        " Sylwester Chruszcz": "sylwester chruszcz"
    },
    {
        " of the League of Polish Families, additional consultations were held with historians, academic researchers and other experts and as a result the symbol is still listed in the catalogue of extreme-right symbols banned at Polish football stadiums. It was also banned by UEFA during Euro 42 and 42     The symbolic use of Szczerbiec became a bone of contention again in 42 After a monument to the ": null
    },
    {
        "Ukrainian Insurgent Army": "ukrainian insurgent army"
    },
    {
        "  on the ": null
    },
    {
        "Chryszczata": "chryszczata"
    },
    {
        " Mountain in southeastern Poland was vandalized, authorities of the Ukrainian city of ": null
    },
    {
        "Lviv": "lviv"
    },
    {
        " demanded the removal of an image of Szczerbiec from the local ": null
    },
    {
        "Polish military cemetery": "cemetery of the defenders of lwów"
    },
    {
        ". The Ukrainians, recalling the legendary use of the original sword in a Polish invasion of Kiev, argued it was a Polish nationalist, militaristic and anti-Ukrainian symbol.   ": null
    }
]