[
    {
        "            The szlachta  was a ": null
    },
    {
        "legally privileged": "Szlachtas Privileges"
    },
    {
        " noble": "Nobility"
    },
    {
        " class": "Social Class"
    },
    {
        " in the ": null
    },
    {
        "Kingdom of Poland": "Kingdom Of Poland"
    },
    {
        " and in the ": null
    },
    {
        "Grand Duchy of Lithuania": "Grand Duchy Of Lithuania"
    },
    {
        ". After the ": null
    },
    {
        "Union of Lublin": "Union Of Lublin"
    },
    {
        " in 1569, the Grand Duchy and its neighbouring Kingdom became a single state, the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "Polish–Lithuanian Commonwealth"
    },
    {
        ".     The origins of the szlachta are obscure and have several theories.  Traditionally, its members were ": null
    },
    {
        "landowners": "Landed Property"
    },
    {
        ", often in the form of ": null
    },
    {
        "manorial estates": "Manorial Estate"
    },
    {
        " or so-called  folwark s. Szulc, Halina. Morfogeneza Osiedli Wiejskich w Polsce. published by Continuo. . esp. p.59. In Polish but with a decent Summary in English about patterns of rural settlement in Poland since the Middle Ages.  The nobility won substantial and increasing political and legal ": null
    },
    {
        "privileges": "Privilege"
    },
    {
        "for itself throughout its entire history until the decline and end of the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "Polish–Lithuanian Commonwealth"
    },
    {
        " in the late 18th century. Apart from providing officers for the army, among its chief civic obligations were ": null
    },
    {
        "electing the monarch": "Elected Monarch"
    },
    {
        ", plus filling advisory and honorary roles at court, e.g.,  Stolnik  - Master of the Kings Pantry, or their assistant,  Podstoli , and in the state government, e.g.  Podskarbi , Minister to the Treasury . They served as elected representatives in the ": null
    },
    {
        "Sejm": "Sejm Of The Polish–Lithuanian Commonwealth"
    },
    {
        " and in local  Sejmiki  assemblies, appointing officials and overseeing judicial and financial governance, including tax-raising, at the provincial level. Their roles included  Voivode ship,  Marshal of Voivodeship ,  Castellan , and  Starosta .      The szlachta gained considerable institutional privileges between 1333 and 1370 in the ": null
    },
    {
        "Kingdom of Poland": "Kingdom Of Poland"
    },
    {
        " during the reign of King ": null
    },
    {
        "Casimir III the Great": "Casimir Iii The Great"
    },
    {
        ".   In 1413, following a series of tentative ": null
    },
    {
        "personal unions": "Personal Union"
    },
    {
        "between the ": null
    },
    {
        "Grand Duchy of Lithuania": "Grand Duchy Of Lithuania"
    },
    {
        " and the ": null
    },
    {
        "Crown of the Kingdom of Poland": "Crown Of The Kingdom Of Poland"
    },
    {
        ", the existing ": null
    },
    {
        "Lithuanian": "Lithuanian Nobility"
    },
    {
        "-": null
    },
    {
        "Ruthenian nobility": "Ruthenian Nobility"
    },
    {
        " formally joined this class.  As the ": null
    },
    {
        "Polish-Lithuanian Commonwealth": "Polish-Lithuanian Commonwealth"
    },
    {
        " evolved and expanded in territory, its membership grew to include the leaders of ": null
    },
    {
        "Ducal Prussia": "Ducal Prussia"
    },
    {
        " and ": null
    },
    {
        "Livonia": "Livonia"
    },
    {
        ". During the ": null
    },
    {
        "Partitions of Poland": "Partitions Of Poland"
    },
    {
        " from 1772 to 1795, minor szlachta began to lose these legal privileges and social status, while elites became part of the nobility of partitioning countries.     Although szlachta members had greatly unequal status due to wealth and political influence, few official distinctions existed between elites and common nobility. Because of the juridic principle of szlachta equality, and a disdain for distinction by way of titles, the relatively few hereditary ": null
    },
    {
        "titles": "Noble Title"
    },
    {
        " in the Kingdom of Poland were bestowed by foreign monarchs, including personal hereditary titles granted by the ": null
    },
    {
        "Pope": "Papal Nobility"
    },
    {
        " & mdash; see ": null
    },
    {
        "Feliks Sobański": "Feliks Sobański"
    },
    {
        ". In the Grand Duchy of Lithuania, Ruthenia, and Samogitia princely titles were mostly inherited by descendants of Old Lithuanian-Ruthenian ": null
    },
    {
        "Rurikid": "Rurik Dynasty"
    },
    {
        " and ": null
    },
    {
        "Gediminids": "Family Of Gediminas"
    },
    {
        " princely families, or by princely dynasties of Tatar origin settled there.           The Polish term szlachta is derived from the ": null
    },
    {
        "Old High German": "Old High German"
    },
    {
        " word slahta. In modern German Geschlecht - which originally came from the ": null
    },
    {
        "Proto-Germanic": "Proto-Germanic"
    },
    {
        " slagiz, blow , strike , and shares the ": null
    },
    {
        "Anglo-Saxon": "Anglo-Saxon"
    },
    {
        " root for slaughter or the verb to slug – means breeding or gender. Like many other Polish words pertaining to nobility, it derives from Germanic words: the Polish for a knight is rycerz , a ": null
    },
    {
        "cognate": "Cognate"
    },
    {
        " of the German Ritter . The Polish word for coat of arms is herb from the German Erbe or heritage .   17th century Poles assumed szlachta came from the German schlachten to slaughter or to butcher , and was therefore related to the German word for battle, Schlacht . Some early Polish historians thought the term might have derived from the name of the legendary proto-Polish chief, ": null
    },
    {
        "Lech": "Lech, Czech And Rus"
    },
    {
        ", mentioned in Polish and Czech writings. In ": null
    },
    {
        "Gaelic": "Gaels"
    },
    {
        " society, large landholders with hereditary tenures formed the principal lineages of their own clans or ": null
    },
    {
        "sept": "Sept"
    },
    {
        "s, and they were traced to a  sliocht , or branch, of the ruling families.  In ancient Ireland, sliocht meant progeny.  The posterity of ": null
    },
    {
        "Hugh Slany": "Áed Sláine"
    },
    {
        ", ruler of the ": null
    },
    {
        "Kingdom of Meath": "Kingdom Of Meath"
    },
    {
        ", were known in ": null
    },
    {
        "ancient Ireland": "History Of Ireland"
    },
    {
        " as  Sliocht Aodha Slaine , the progeny of King Hugh Slany.  In Shakespeares play, ": null
    },
    {
        "Macbeth": "Macbeth"
    },
    {
        " says of ": null
    },
    {
        "King Duncan": "King Duncan"
    },
    {
        ", ... First, as I am his kinsman and his subject, ...   The szlachta traced their descent from ": null
    },
    {
        "Lech/Lekh": "Lech, Czech, And Rus"
    },
    {
        ", who allegedly founded the Polish kingdom in about the fifth century.       A few exceptionally wealthy and powerful szlachta members were known as magnates - możni .     The Polish term szlachta designated the formalized, hereditary  noble class of the Polish-Lithuanian Commonwealth, which constituted the nation itself, and ruled without competition.   In official Latin documents of the old ": null
    },
    {
        "Commonwealth": "Polish-Lithuanian Commonwealth"
    },
    {
        ", the hereditary szlachta were referred to as nobilitas from the Latin term, and could be compared in legal status to English or British ": null
    },
    {
        "peers of the realm": "Peer Of The Realm"
    },
    {
        ", or to the ancient Roman idea of cives, citizen . Until the second half of the 19th century, the Polish term obywatel  was used as a synonym for szlachta landlords.      Today the word szlachta simply translates as nobility . In its broadest sense, it can also denote some non-hereditary honorary knighthoods and ": null
    },
    {
        "baron": "Baron"
    },
    {
        "ial titles granted by other European monarchs, including the ": null
    },
    {
        "Holy See": "Holy See"
    },
    {
        ". Occasionally, 19th-century landowners of non-noble descent were referred to as szlachta by courtesy or error, when they owned manorial estates, but were not in fact noble by birth. Szlachta also denotes the Ruthenian and Lithuanian nobility from before the ": null
    },
    {
        "old-Commonwealth": "Polish-Lithuanian Commonwealth"
    },
    {
        ".     In the past, a misconception sometimes led to the mistranslation of szlachta as gentry rather than nobility .    This mistaken practice began due to the inferior economic status of many szlachta members compared to that of the nobility in other European countries .   The szlachta included those rich and powerful enough to be ": null
    },
    {
        "magnates": "Polish Magnate"
    },
    {
        " down to the indigent with a noble lineage, but with no land, no castle, no money, no village, and no subject peasants.  At least 60,000 families belonged to the nobility, however, only about 100 were wealthy ; all the rest were poor .      Over time, numerically most lesser szlachta became poorer, or were poorer than, their few rich peers in their social class, and many were worse off than the non-noble ": null
    },
    {
        "gentry": "Gentry"
    },
    {
        ". They were called szlachta zagrodowa, that is, nobility from within the ": null
    },
    {
        "second estate": "Estates Of The Realm"
    },
    {
        " compound , sometimes referred to as drobna szlachta, petty nobles or yet, szlachta okoliczna, meaning local . Particularly impoverished szlachta families were often forced to become tenants of their wealthier peers. They were described as szlachta czynszowa, or tenant nobles who paid rent. Jolanta Sikorska-Kulesza.   Warszawa, Oficyna Wydawnicza Ajaks . 1995. p.14. This monograph describes how during the 19th century the mass of local szlachta in the western borderlands of the Russian Empire were subjected to downward mobility and rank poverty through tsarist bureaucracy and a policy of social degradation In doing so, they nevertheless retained all their constitutional and lawful prerogatives because aristocratic lineage and hereditary juridical status determined Polish nobility, not wealth nor lifestyle, as was achievable by the gentry.     An individual nobleman was called szlachcic , while a noblewoman szlachcianka .                 The origins of the szlachta, while ancient, have always been considered obscure.  As a result, its members often referred to it as odwieczna .  Two popular historical theories about its origins have been put forward by its members and early historians and chroniclers. The first theory involved a presumed descent from the ancient Iranian tribe known as ": null
    },
    {
        "Sarmatian": "Sarmatian"
    },
    {
        "s, who in the 2nd century AD, occupied lands in ": null
    },
    {
        "Eastern Europe": "Eastern Europe"
    },
    {
        ", and the ": null
    },
    {
        "Middle East": "Middle East"
    },
    {
        ". The second theory involved a presumed szlachta descent from ": null
    },
    {
        "Japheth": "Japheth"
    },
    {
        ", one of ": null
    },
    {
        "Noahs": "Noah"
    },
    {
        "sons. By contrast, the peasantry were said to be the offspring of another son of Noah, ": null
    },
    {
        "Ham": "Ham, Son Of Noah"
    },
    {
        " — and hence subject to bondage under the ": null
    },
    {
        "Curse of Ham": "Curse Of Ham"
    },
    {
        ". The Jews were considered the offspring of ": null
    },
    {
        "Shem": "Shem"
    },
    {
        ". Other fanciful theories included its foundation by ": null
    },
    {
        "Julius Caesar": "Julius Caesar"
    },
    {
        ", ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        ", or regional leaders who had not mixed their bloodlines with those of slaves, prisoners, or aliens.       Another theory describes its derivation from a non-": null
    },
    {
        "Slavic": "Slavs"
    },
    {
        " warrior": "Warrior"
    },
    {
        " class,   forming a distinct element known as the ": null
    },
    {
        "Lechici": "Lechites"
    },
    {
        "/Lekhi    within the ancient Polonic tribal groupings . Similar to ": null
    },
    {
        "Nazi": "Nazism"
    },
    {
        " racist ideology, which dictated the Polish elite were largely ": null
    },
    {
        "Nordic": "Master Race"
    },
    {
        "  , this hypothesis states this upper class was not of Slavonic extraction  and was of a different origin than the Slavonic peasants    over which they ruled.      The Szlachta were differentiated from the rural population.   In harshly stratified and ": null
    },
    {
        "elitist": "Elitism"
    },
    {
        " Polish society,   the noblemans sense of distinction led to practices that in later periods would be characterized as racism.  ": null
    },
    {
        "Wacław Potocki": "Wacław Potocki"
    },
    {
        ", herbu ": null
    },
    {
        "Śreniawa": "Srzeniawa Coat Of Arms"
    },
    {
        " , proclaimed ": null
    },
    {
        "peasants": ":Pl:Chłopi"
    },
    {
        " by nature are chained to the land and plow, that even an educated peasant would always remain a peasant, because it is impossible to transform a ": null
    },
    {
        "dog": "Dog"
    },
    {
        " into a ": null
    },
    {
        "lynx": "Lynx"
    },
    {
        ".  The Szlachta were noble in the ": null
    },
    {
        "Aryan": "Aryan"
    },
    {
        "  sense -- noble in contrast to the people over whom they ruled after coming into contact with them.      The szlachta traced their descent from ": null
    },
    {
        "Lech/Lekh": "Lech, Czech, And Rus"
    },
    {
        ", who allegedly founded the Polish kingdom in about the fifth century.  ": null
    },
    {
        "Lechia": "Lechia"
    },
    {
        " was the name of Poland in antiquity, and the szlachtas own name for themselves was ": null
    },
    {
        "Lechici": "Lechites"
    },
    {
        "/Lekhi.  An exact counterpart of Szlachta society was the Meerassee  system of tenure of southern India—an aristocracy of equality—settled as conquerors among a separate race.  The Polish state paralleled the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        "    in that full rights of citizenship were limited to the szlachta.   Rome devoted its attention nearly exclusively to agriculture  as did old Poland.  The szlachta ideal also paralleled that of a ": null
    },
    {
        "Greek polis": "Polis"
    },
    {
        " & mdash;a body of citizens, a small merchant class, and a multitude of laborers.   Quoting Bishop of Poznań, ": null
    },
    {
        "Wawrzyniec Goślicki, herbu Grzymała": "Wawrzyniec Grzymała Goślicki"
    },
    {
        " :       The kingdome of Polonia doth also consist of the said three sortes, that is, the king, nobility and people. But it is to be noted, that this word people includeth only knights and gentlemen. ... The gentlemen of Polonia doe represent the popular state, for in them consisteth a great part of the government, and they are as a Seminarie from whence Councellors and Kinges are taken.        The szlachta were a ": null
    },
    {
        "caste": "Caste"
    },
    {
        ",  a military caste, as in ": null
    },
    {
        "Hindu": "Hindu"
    },
    {
        " society. In the year 1244, ": null
    },
    {
        "Bolesław, Duke of Masovia": "Bolesław I Of Masovia"
    },
    {
        ", identified members of the ": null
    },
    {
        "knights": "Knight"
    },
    {
        "clan as members of a genealogia:       I received my good servitors from the land of ": null
    },
    {
        "[Great] Poland": "Greater Poland"
    },
    {
        ", and from the clan genealogia called ": null
    },
    {
        "Jelito": "Jelita Coat Of Arms"
    },
    {
        ", with my well-disposed knowledge and the cry vocitatio, the godło, Nagody, and I established them in the said land of mine, ": null
    },
    {
        "Masovia": "Masovia"
    },
    {
        ",       The documentation regarding Raciborz and Alberts tenure is the earliest surviving of the use of the clan name and cry defining the honorable status of Polish knights. The names of knightly genealogiae only came to be associated with heraldic devices later in the Middle Ages and in the early modern period. The Polish clan name and cry ritualized the ius militare, i.e., the power to command an army; and they had been used some time before 1244 to define knightly status. .       In Poland, the Radwanice were noted relatively early as the descendants of ": null
    },
    {
        "Radwan": "Radwan Coat Of Arms"
    },
    {
        ", a knight more properly a rycerz from the German ": null
    },
    {
        "ritter": "Ritter"
    },
    {
        " active a few decades earlier. ... ": null
    },
    {
        "Janusz Bieniak": ":Pl:Janusz Bieniak"
    },
    {
        ", Knight Clans in Medieval Poland, in ": null
    },
    {
        "Antoni Gąsiorowski": ":Pl:Antoni Gąsiorowski"
    },
    {
        " , THE POLISH NOBILITY IN THE MIDDLE AGES: ANTHOLOGIES, ": null
    },
    {
        "Zakład Narodowy im. Ossolińskich": "Ossolineum"
    },
    {
        "; Wrocław, POLAND, EU; 1984, page 154.        ": null
    },
    {
        "Escutcheons": "Escutcheon"
    },
    {
        " and ": null
    },
    {
        "hereditary coats of arms": "Coat Of Arms"
    },
    {
        " with eminent privileges attached is an honor derived from the ancient Germans. Where Germans did not inhabit, and where German customs were unknown, no such thing existed.  The usage of coats of arms in Poland was brought in by knights arriving from ": null
    },
    {
        "Silesia": "Silesia"
    },
    {
        ", ": null
    },
    {
        "Lusatia": "Lusatia"
    },
    {
        ", ": null
    },
    {
        "Meissen": "Meissen"
    },
    {
        ", and ": null
    },
    {
        "Bohemia": "Bohemia"
    },
    {
        ". Migrations from here were the most frequent, and the time period was the thirteenth and fourteenth centuries.  However, unlike other European ": null
    },
    {
        "chivalry": "Chivalry"
    },
    {
        ", coats of arms were associated with Polish knights clans  names and war cries , where heraldic devices came to be held in common by entire clans, fighting in regiments.    .        Around the 14th century, there was little difference between knights and the szlachta in Poland. Members of the szlachta had the personal obligation to defend the country , thereby becoming the kingdoms most privileged social class. Inclusion in the class was almost exclusively based on inheritance.      Concerning the early Polish tribes, geography contributed to long-standing traditions. The Polish tribes were internalized and organized around a unifying religious cult, governed by the  wiec , an assembly of free tribesmen. Later, when safety required power to be consolidated, an elected prince was chosen to govern. The election privilege was usually limited to elites.     The tribes were ruled by clans  consisting of people related by blood or marriage and theoretically descending from a common ancestor, giving the ród/clan a highly developed sense of solidarity.  The  starosta   had judicial and military power over the ród/clan, although this power was often exercised with an assembly of elders. Strongholds called  grόd  were built where the religious cult was powerful, where trials were conducted, and where clans gathered in the face of danger. The opole was the territory occupied by a single tribe.  The family unit of a tribe is called the rodzina, while a collection of tribes is a ": null
    },
    {
        "plemię": ":Pl:Plemię"
    },
    {
        ".     ": null
    },
    {
        "Mieszko I of Poland": "Mieszko I Of Poland"
    },
    {
        " established an elite knightly retinue from within his army, which he depended upon for success in uniting the ": null
    },
    {
        "Lekhitic": "Lechites"
    },
    {
        " tribes and preserving the unity of his state. Documented proof exists of Mieszko Is successors utilizing such a retinue, as well.     Another class of knights were granted land by the prince, allowing them the economic ability to serve the prince militarily. A Polish nobleman living at the time prior to the 15th century was referred to as a rycerz , very roughly equivalent to the English knight, the critical difference being the status of rycerz was almost strictly hereditary; the class of all such individuals was known as the rycerstwo . Representing the wealthier families of Poland and itinerant knights from abroad seeking their fortunes, this other class of rycerstwo, which became the szlachta/nobility , gradually formed apart from Mieszko Is and his successors elite retinues. This rycerstwo/nobility obtained more privileges granting them favored status. They were absolved from particular burdens and obligations under ducal law, resulting in the belief only rycerstwo could serve as officials in state administration.     Select rycerstwo were distinguished above the other rycerstwo, because they descended from past tribal dynasties, or because early ": null
    },
    {
        "Piasts": "Piast Dynasty"
    },
    {
        " endowments made them select beneficiaries. These rycerstwo of great wealth were called możni . Socially they were not a distinct class from the rycerstwo from which they all originated  and to which they would return were their wealth lost.      The Period of Division from, A.D., 1138 – A.D., 1314, which included nearly 200 years of feudal fragmentation and which stemmed from ": null
    },
    {
        "Bolesław IIIs": "Bolesław Iii"
    },
    {
        "division of Poland among his sons, was the genesis of the social structure which saw the economic elevation of the great landowning feudal nobles from the rycerstwo they originated from. The prior social structure was one of Polish tribes united into the historic Polish nation under a state ruled by the ": null
    },
    {
        "Piast dynasty": "Piast Dynasty"
    },
    {
        ", this dynasty appearing circa 850 A.D.     Some możni descending from past tribal dynasties regarded themselves as co-proprietors of Piast realms, even though the Piasts attempted to deprive them of their independence. These możni constantly sought to undermine princely authority.  In ": null
    },
    {
        "Gall Anonyms": "Gallus Anonymus"
    },
    {
        " chronicle, there is noted the nobilitys alarm when the ": null
    },
    {
        "Palatine": "Count Palatine"
    },
    {
        " Sieciech": "Sieciech"
    },
    {
        " elevated those of a lower class over those who were noble born entrusting them with state offices.              In ": null
    },
    {
        "Lithuania Propria": "Lithuania Propria"
    },
    {
        " and in ": null
    },
    {
        "Samogitia": "Samogitia"
    },
    {
        ", prior to the creation of the ": null
    },
    {
        "Kingdom of Lithuania": "Kingdom Of Lithuania"
    },
    {
        " by ": null
    },
    {
        "Mindaugas": "Mindaugas"
    },
    {
        ", nobles were called die beste leuten in ": null
    },
    {
        "German": "German Language"
    },
    {
        " sources. In Lithuanian, nobles were named ponai. The higher nobility were named kunigai or kunigaikščiai — a loanword from Scandinavian  konung . They were the established local leaders and warlords. During the development of the state, they gradually became subordinated to higher dukes, and later to the ": null
    },
    {
        "King of Lithuania": "King Of Lithuania"
    },
    {
        ". Because of Lithuanian expansion into the lands of ": null
    },
    {
        "Ruthenia": "Ruthenia"
    },
    {
        " in the middle of the 14th century, a new term for nobility appeared — bajorai, from ": null
    },
    {
        "Ruthenian": "Ruthenian Language"
    },
    {
        " бояре. This word is used to this day in Lithuania to refer to nobility in general, including those from abroad.     After the ": null
    },
    {
        "Union of Horodło": "Union Of Horodło"
    },
    {
        ", the Lithuanian nobility acquired equal status with its Polish counterparts. Over time they became increasingly ": null
    },
    {
        "polonized": "Polonized"
    },
    {
        ", although they did preserve their ": null
    },
    {
        "nation": "Nation"
    },
    {
        "al consciousness, and in most cases recognition of their Lithuanian family roots. In the 16th century, some of the Lithuanian nobility claimed that they were descended from the Romans, and that the ": null
    },
    {
        "Lithuanian language": "Lithuanian Language"
    },
    {
        " was derived from Latin. This led to a conundrum: Polish nobility claimed its own ancestry from ": null
    },
    {
        "Sarmatian": "Sarmatians"
    },
    {
        " tribes, but Sarmatians were considered enemies of the Romans. Thus, a new Roman-Sarmatian theory was created. Strong cultural ties with Polish nobility led to a new term for Lithuanian nobility appearing in the 16th century — šlėkta, a direct loanword from Polish szlachta. Recently, Lithuanian linguists advocated dropping the usage of this Polish loanword.      The process of ": null
    },
    {
        "polonization": "Polonization"
    },
    {
        " took place over a lengthy period. At first only the leading members of the nobility were involved. Gradually the wider population became affected. Major effects on the lesser Lithuanian nobility occurred after various sanctions were imposed by the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        ", such as removing Lithuania from the names of the Gubernyas shortly after the ": null
    },
    {
        "November Uprising": "November Uprising"
    },
    {
        ".  After the ": null
    },
    {
        "January Uprising": "January Uprising"
    },
    {
        " the sanctions went further, and Russian officials announced that Lithuanians were actually Russians seduced by Poles and Catholicism and began to intensify ": null
    },
    {
        "russification": "Lithuanian Press Banorigins And Legal Basis"
    },
    {
        ", and to ": null
    },
    {
        "ban": "Lithuanian Press Ban"
    },
    {
        " the printing of books in Lithuanian.          After the principalities of ": null
    },
    {
        "Halych": "Halych"
    },
    {
        " and ": null
    },
    {
        "Volhynia": "Volhynia"
    },
    {
        " became integrated with the Grand Duchy, ": null
    },
    {
        "Ruthenias": "Ruthenia"
    },
    {
        "nobility gradually rendered loyalty to the multilingual and cultural ": null
    },
    {
        "melting pot": "Melting Pot"
    },
    {
        " that was the ": null
    },
    {
        "Grand Duchy of Lithuania": "Grand Duchy Of Lithuania"
    },
    {
        ". Many noble Ruthenian families intermarried with Lithuanians.     The rights of ": null
    },
    {
        "Orthodox": "Eastern Orthodox Church"
    },
    {
        " nobles were nominally equal to those enjoyed by the Polish and Lithuanian nobility, but they were put under cultural pressure to convert to Catholicism. It was a policy that was greatly eased in 1596 by the ": null
    },
    {
        "Union of Brest": "Union Of Brest"
    },
    {
        ". See, for example, the careers of Senator ": null
    },
    {
        "Adam Kisiel": "Adam Kisiel"
    },
    {
        " and ": null
    },
    {
        "Jerzy Franciszek Kulczycki": "Jerzy Franciszek Kulczycki"
    },
    {
        ".               In Polish dąb means oak. William F. Hoffman, POLISH SURNAMES: ORIGINS AND MEANINGS .  Dąbrowa means oak forest, and Dąbrówka means little oak forest . In antiquity, the nobility used topographic surnames to identify themselves.  The expression ": null
    },
    {
        "z": "German Nobilitynobiliary Particles"
    },
    {
        " plus the name of ones ": null
    },
    {
        "patrimony": "Inheritance"
    },
    {
        " or ": null
    },
    {
        "estate": "Estate"
    },
    {
        " carried the same prestige as de in French names such as de Châtellerault , and ": null
    },
    {
        "von": "Von"
    },
    {
        " or ": null
    },
    {
        "zu": "German Nobilitynobiliary Particles"
    },
    {
        " in German names such as ": null
    },
    {
        " von Weizsäcker or zu Rhein ": "German Nobilitynobiliary Particles"
    },
    {
        ".  In Polish z Dąbrówki and Dąbrowski mean the same thing: of, from Dąbrówka.  More precisely, z Dąbrówki means owning the patrimony or estate Dąbrówka, not necessarily originating from. Almost all the surnames of genuine Polish szlachta can be traced back to a patrimony or locality, despite time scattering most families far from their original home. John of ": null
    },
    {
        "Zamość": "Zamość"
    },
    {
        " called himself John ": null
    },
    {
        "Zamoyski": "House Of Zamoyski"
    },
    {
        ", Stephen of ": null
    },
    {
        "Potok": "Potok, Staszów County"
    },
    {
        " called himself ": null
    },
    {
        "Potocki": "House Of Potocki"
    },
    {
        ".      At least since the 17th century the surnames/": null
    },
    {
        "cognomens": "Roman Naming Conventionscognomen"
    },
    {
        " of noble families became fixed and were inherited by following generations, remaining in that form until today. Prior to that time, a member of the family would simply use his Christian name , and the name of the coat of arms common to all members of his clan.  A member of the family would be identified as, for example, Jakub z Dąbrówki ,  herbu Radwan, , or Jakub z Dąbrówki, Żądło   , herbu Radwan , or Jakub Żądło, herbu Radwan .     The Polish state paralleled the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        " in that full rights of citizenship were limited to the nobility/szlachta. The nobility/szlachta in ": null
    },
    {
        "Poland": "Poland"
    },
    {
        ", where Latin was written and spoken far and wide,  used the ": null
    },
    {
        "Roman naming convention of the tria nomina ": "Roman Naming Conventionstria Nomina"
    },
    {
        " to distinguish Polish citizens/nobles/szlachta from ": null
    },
    {
        "the peasantry": "Peasantmedieval European Peasants"
    },
    {
        "  and foreigners, hence why multiple surnames are associated with many Polish coat of arms.     Example - Jakub: Radwan Żądło-Dąbrowski       Praenomen      Jakub      Nomen  :     ": null
    },
    {
        "Radwan": "Radwan Coat Of Arms"
    },
    {
        "      Cognomen  :     For example—Braniecki, Dąbrowski,  Czcikowski, Dostojewski, Górski, Nicki, ": null
    },
    {
        "Zebrzydowski": "House Of Zebrzydowski"
    },
    {
        ", etc.      Agnomen  :     Żądło      ": null
    },
    {
        "Bartosz Paprocki": "Bartosz Paprocki"
    },
    {
        " gives an example of the Rościszewski family taking different surnames from the names of various patrimonies or estates they owned. The branch of the Rościszewski family that settled in Chrapunia became the Chrapunski family, the branch of the Rościszewski family that settled in Strykwina became the Strykwinski family, and the branch of the Rościszewski family that settled in Borkow became known as the Borkowski family. Each family shared a common ancestor and belonged to the same knights clan, so they bore the same coat of arms as the Rościszewski family.      Each knights clan/gens/ród had its ": null
    },
    {
        "coat of arms": "List Of Coats Of Arms Of Polish Nobility"
    },
    {
        ", and there were only a limited number. Almost without exception, there were no family coat of arms.  Each coat of arms bore a name, the clans call word. In most instances, the coat of arms belonged to many families within the clan. The Polish state paralleled the Roman Empire, and the Polish nobility had a different origin and structure in law than Western Europes feudal nobility. The clan/gens/ród system survived the whole of Polish history.                The number of legally granted ennoblements after the 15th century was minimal.     In the ": null
    },
    {
        "Kingdom of Poland": "Kingdom Of Poland"
    },
    {
        " and later in the ": null
    },
    {
        "Polish-Lithuanian Commonwealth": "Polish-Lithuanian Commonwealth"
    },
    {
        ", ennoblement  may be equated with an individual given legal status as a szlachcic member of the Polish nobility. Initially, this privilege could be granted by the monarch, but from 1641 onward, this right was reserved for the ": null
    },
    {
        "sejm": "Sejm"
    },
    {
        ". Most often the individual being ennobled would join an existing noble szlachta clan and assume the undifferentiated ": null
    },
    {
        "coat of arms": "Polish Heraldry"
    },
    {
        " of that clan.     According to ": null
    },
    {
        "heraldic": "Heraldic"
    },
    {
        " sources, the total number of legal ennoblements issued between the 14th century and the mid-18th century is estimated at approximately 800. This is an average of only about two ennoblements per year, or only 0.000,000,14 – 0.000,001 of the historical population. Compare: ": null
    },
    {
        "historical demography of Poland": "Historical Demography Of Poland"
    },
    {
        ". ": null
    },
    {
        "Charles-Joseph, 7th Prince of Ligne": "Charles-Joseph, 7Th Prince Of Ligne"
    },
    {
        ", when trying to obtain Polish noble status, supposedly said in 1784,  It is easier to become a duke in Germany, than to be counted among Polish nobles.        The close of the late 18th century was a period in which a definite increase in the number of ennoblements can be noted. This can most readily be explained in terms of the ongoing decline and eventual collapse of the Commonwealth and the resulting need for soldiers and other military leaders .          According to ": null
    },
    {
        "heraldic": "Heraldic"
    },
    {
        " sources 1,600 is the total estimated number of all legal ennoblements throughout the history of Kingdom of Poland and Polish-Lithuanian Commonwealth from the 14th century onward .     Types of ennoblement:   ": null
    },
    {
        "Adopcja herbowa": "Adopcja Herbowa"
    },
    {
        " – The old way of ennoblement, popular in the 15th century, connected with adoption into an existing noble clan by a powerful lord, but abolished in the 17th century.   ": null
    },
    {
        "Skartabellat": "Skartabellat"
    },
    {
        " – Introduced by ": null
    },
    {
        "pacta conventa": "Pacta Conventa"
    },
    {
        " of the 17th century, this was ennoblement into a sort of conditional or graduated nobility status. Skartabels could not hold public offices or be members of the Sejm, but after three generations, the descendants of these families would mature to full szlachta status.   ": null
    },
    {
        "Indygenat": "Indygenat"
    },
    {
        " – from the Latin expression, indigenatus, recognition of foreign noble status. A foreign noble, after acquiring indygenat status, received all privileges of a Polish szlachcic. In Polish history, 413 foreign noble families were recognized. Prior to the 17th century this was done by the King and ": null
    },
    {
        "Sejm": "Sejm"
    },
    {
        ", after the 17th century it was done only by the Sejm.   secret ennoblement – This was of questionable legal status and was often not recognized by many szlachta members. It was typically granted by the elected monarch without the required legal approval of the Sejm.       In the late 14th century, in the ": null
    },
    {
        "Grand Duchy of Lithuania": "Grand Duchy Of Lithuania"
    },
    {
        ", ": null
    },
    {
        "Vytautas the Great": "Vytautas The Great"
    },
    {
        " reformed the Grand Duchys army: instead of calling all men to arms, he created forces comprising professional warriors— bajorai  . As there were not enough nobles, Vytautas trained suitable men, relieving them of labor on the land and of other duties; for their ": null
    },
    {
        "military service": "Military Service"
    },
    {
        " to the Grand Duke, they were granted land that was worked by hired men . The newly formed noble families generally took up, as their ": null
    },
    {
        "family name": "Family Name"
    },
    {
        "s, the ": null
    },
    {
        "Lithuanian": "Lithuanian Language"
    },
    {
        " pagan ": null
    },
    {
        "given names": "Given Name"
    },
    {
        "of their ennobled ancestors; this was the case with the ": null
    },
    {
        "Goštautai": "Goštautai"
    },
    {
        ", ": null
    },
    {
        "Radvilos": "Radvilos"
    },
    {
        ", ": null
    },
    {
        "Astikai": "Astikai"
    },
    {
        ", ": null
    },
    {
        "Kęsgailos": "Kęsgailos"
    },
    {
        " and others. These families were granted their ": null
    },
    {
        "coats of arms": "Coats Of Arms"
    },
    {
        " under the ": null
    },
    {
        "Union of Horodlo": "Union Of Horodlo"
    },
    {
        " .     In 1506, King ": null
    },
    {
        "Sigismund I the Old": "Sigismund I The Old"
    },
    {
        " confirmed the position of the ": null
    },
    {
        "Lithuanian Council of Lords": "Lithuanian Council Of Lords"
    },
    {
        " in state politics and limited entry into the ": null
    },
    {
        "nobility": "Nobility"
    },
    {
        ".            Specific rights of the szlachta included:      The right to hold outright ownership of land  -- not as a fief, conditional upon service to the liege Lord, but absolutely in perpetuity unless sold. The szlachta had a monopoly on land. Peasants did not own land.  See  Polish landed gentry .   The right to join in political and military assemblies of the regional nobility.   The right to form independent administrative councils for their locality.   The right to cast a vote for Polish Kings.   The right to travel freely anywhere in the old Commonwealth of the Polish and Lithuanian nobility; or outside it, as foreign policy dictated.   The right to demand information from Crown offices.   The right to spiritual semi-independence from the clergy.   The right to interdict, in suitable ways, the passage of foreigners and townsmen through their territories.   The right of priority over the courts of the peasantry.   Special rights in Polish courts, including freedom from arbitrary arrest and freedom from corporal punishment.   The right to sell their military or administrative services.   Heraldic rights.   The right to receive higher pay when entitled in the ": null
    },
    {
        "Levée en masse": "Levée En Masse"
    },
    {
        " .   Educational rights   The right of importing duty-free goods often.   The exclusive right to enter the clergy until the time of the ": null
    },
    {
        "three partitions of Poland": "Partitions Of Poland"
    },
    {
        ".   The right to try their peasants for major offences .          Significant legislative changes in the status of the szlachta, as defined by Robert Bideleux and Ian Jeffries, consist of its 1374 exemption from the land tax, a 1425 guarantee against the arbitrary arrests and/or seizure of property of its members, a 1454 requirement that military forces and new taxes be approved by provincial ": null
    },
    {
        "Sejm": "Sejm"
    },
    {
        "s, and statutes issued between 1496 and 1611 that prescribed the rights of commoners.       Nobles were born into a ": null
    },
    {
        "noble family": "Noble Family"
    },
    {
        ", adopted by a noble family - this was abolished in 1633 - or achieved noble rank through ": null
    },
    {
        "Ennoblement": "Ennoblement"
    },
    {
        " by a king or ": null
    },
    {
        "Sejm": "Sejm"
    },
    {
        " for reasons such as bravery in combat, services to the state, etc. Yet this proved to be the rarest means of gaining noble status. Many nobles were, in fact, usurpers who were commoners that had moved to another part of the country and falsely claimed noble status. Hundreds of such false nobles were denounced by Hieronim Nekanda Trepka in his  Liber generationis plebeanorum , or  Liber chamorum , in the first half of the 16th century. The law forbade non-nobles to own folwarks and promised such estates as a reward to denouncers. Trepka was himself an impoverished nobleman who lived a town dwellers life and documented hundreds of such false claims hoping to take over one of the usurped estates. He does not seem to have succeeded in his quest despite his employment as the kings secretary. Leszczyński, R. Osobowość autora - wartość dzieła, Walerian Nekanda Trepka, Liber generationis plebeanorum , wyd. 2, opracował, ": null
    },
    {
        "Wrocław": "Wrocław"
    },
    {
        " - ": null
    },
    {
        "Warszawa": "Warszawa"
    },
    {
        " - ": null
    },
    {
        "Kraków": "Kraków"
    },
    {
        " 1995, p. 6-7. Many sejms issued decrees over the centuries in an attempt to resolve this issue but with little success. It is unknown what percentage of the Polish nobility came from the lower orders of society, .     Ambitions of ": null
    },
    {
        "aggrandizement": "Aggrandizement"
    },
    {
        " of perceived status was not confined to commoners. It was not uncommon for members of the lower szlachta to seek further ennoblement from foreign, therefore less verifiable, sources. That is, they might acquire by legitimate means or otherwise, such as by purchase, one of a selection of foreign titles ranging from ": null
    },
    {
        "Baron": "Baron"
    },
    {
        ", ": null
    },
    {
        "Marchese": "Marchese"
    },
    {
        ", ": null
    },
    {
        "Freiherr": "Freiherr"
    },
    {
        " to ": null
    },
    {
        "Comte": "Count"
    },
    {
        ", all readily translatable into the Polish  Hrabia . Alternatively, they would simply appropriate a title by conferring it upon themselves. An example of this is cited in the case of the last descendant of the ": null
    },
    {
        "Ciechanowiecki family": "Andrzej Ciechanowiecki"
    },
    {
        ", who managed to restore a genuinely old ": null
    },
    {
        "Comital": "Comital"
    },
    {
        " title, but whose actual origins are shrouded in 18th century mystery.  In Polish with an English summary. The author shows it is likely a Ciechanowiecki ancestor either received a fashionable noble title in exchange for money while travelling on the Grand Tour in Western Europe or, simply conferred it upon himself to hark back to a former higher status.       Polish nobility enjoyed many rights that were not available to their equivalents in other countries. Over time, each new monarch ceded to them further privileges. Those privileges became the basis of the  Golden Liberty  in the Polish–Lithuanian Commonwealth. Despite having a king, Poland was considered the nobilitys ": null
    },
    {
        "Commonwealth": "Rzeczpospolita"
    },
    {
        " because ": null
    },
    {
        "Royal elections in Poland": "Royal Elections In Poland"
    },
    {
        " were in the hands of members of a hereditary class. Poland was therefore the domain of this class, and not that of the king or the ruling ": null
    },
    {
        "dynasty": "Dynasty"
    },
    {
        ". This arose in part because of the extinction of male heirs in the original royal dynasties: first, the ": null
    },
    {
        "Piasts": "Piasts"
    },
    {
        ", then the ": null
    },
    {
        "Jagiellons": "Jagiellons"
    },
    {
        ". As a result, the nobility took it upon itself to choose the Polish king from among the dynasties ": null
    },
    {
        "matrilinial": "Matrilineality"
    },
    {
        " descendants.     Polands successive kings granted privileges to the nobility upon their election to the throne - the privileges having been specified in the king-elects ": null
    },
    {
        "Pacta conventa": "Pacta Conventa"
    },
    {
        " - and at other times, in exchange for  ad hoc  leave to raise an extraordinary tax or a  pospolite ruszenie , a military call up. Polands nobility thus accumulated a growing array of privileges and immunities.     In 1355 in ": null
    },
    {
        "Buda": "Buda"
    },
    {
        " King ": null
    },
    {
        "Casimir III the Great": "Casimir Iii Of Poland"
    },
    {
        " issued the first country-wide privilege for the nobility, in exchange for their agreeing that if ": null
    },
    {
        "Casimirs": "Casimir Iii Of Poland"
    },
    {
        " had no male heirs, the throne would pass to his nephew, ": null
    },
    {
        "Louis I of Hungary": "Louis I Of Hungary"
    },
    {
        ". He further decreed that the nobility would no longer be subject to extraordinary taxes or have to use their own funds for foreign military expeditions. He also promised that when the royal court was touring, the king and the court would cover all expenses, instead of requiring facilities to be provided by the local nobility.       In 1374 ": null
    },
    {
        "King Louis of Hungary": "Louis I Of Hungary"
    },
    {
        " approved the ": null
    },
    {
        "Privilege of Koszyce": "Privilege Of Koszyce"
    },
    {
        " - przywilej koszycki to guarantee the Polish throne for his daughter, ": null
    },
    {
        "Jadwiga": "Jadwiga Of Poland"
    },
    {
        ". He broadened the definition of membership of the nobility and exempted the entire class from all but one tax - łanowy - a limit of 2 ": null
    },
    {
        "grosz": "Grosz"
    },
    {
        "es per łan of land, ": null
    },
    {
        "Old Polish units of measurement": "Old Polish Units Of Measurement"
    },
    {
        ". In addition, the Kings right to raise taxes was effectively abolished: no new taxes would be levied without the agreement of the nobility. Henceforth, also, ": null
    },
    {
        "district offices": "Offices In Polish-Lithuanian Commonwealthdistrict Offices"
    },
    {
        " were reserved exclusively for local nobility, as the Privilege of Koszyce forbade the king to grant official posts and major Polish castles to foreign knights. Finally, this privilege obliged the King to pay ": null
    },
    {
        "indemnities": "Indemnity"
    },
    {
        " to nobles injured or taken captive during a war outside Polish borders.     In 1422 ": null
    },
    {
        "King Władysław II Jagiełło": "Władysław Ii Jagiełło"
    },
    {
        " was constrained by the Privilege of Czerwińsk - przywilej czerwiński which established the inviolability of nobles property. Their estates could not be confiscated except upon the verdict of a court. It also made him cede some jurisdiction over ": null
    },
    {
        "fiscal policy": "Fiscal Policy"
    },
    {
        " to the ": null
    },
    {
        "Royal Council": "Privy Council"
    },
    {
        ", later, the ": null
    },
    {
        "Senate of Poland": "Senate Of Poland"
    },
    {
        ", including the right to ": null
    },
    {
        "mint coinage": "Mint"
    },
    {
        ".     In 1430 with the Privileges of ": null
    },
    {
        "Jedlnia": "Jedlnia"
    },
    {
        ", confirmed at ": null
    },
    {
        "Kraków": "Kraków"
    },
    {
        " in 1433, Polish: przywileje jedlneńsko-krakowskie, based partially on his earlier ": null
    },
    {
        "Brześć Kujawski": "Brześć Kujawski"
    },
    {
        " privilege , King Władysław II Jagiełło granted the nobility a guarantee against arbitrary arrest, similar to the English ": null
    },
    {
        "Magna Cartas": "Magna Carta"
    },
    {
        " Habeas corpus": "Habeas Corpus"
    },
    {
        ", known from its own Latin name as ": null
    },
    {
        "neminem captivabimus": "Neminem Captivabimus"
    },
    {
        " nisi jure victum . Henceforth no member of the nobility could be imprisoned without a ": null
    },
    {
        "warrant": "Arrest Warrant"
    },
    {
        " from a court of justice. The king could neither punish nor imprison any noble on a whim. King Władysławs  quid pro quo  for this ": null
    },
    {
        "Easement": "Easement"
    },
    {
        " was the nobles guarantee that the throne would be inherited by one of his sons, who would be bound to honour the privileges granted earlier to the nobility. On May 2, 1447 the same king issued the  Wilno Pact - Wilno Privilege which gave the ": null
    },
    {
        "Lithuanian": "Grand Duchy Of Lithuania"
    },
    {
        "boyars": "Boyar"
    },
    {
        "the same rights as those already secured by the Polish szlachta.        In 1454 ": null
    },
    {
        "King Casimir IV": "Kazimierz Iv Jagiellon"
    },
    {
        " granted the ": null
    },
    {
        "Nieszawa Statutes": "Nieszawa Statutes"
    },
    {
        " - Polish: statuty cerkwicko-nieszawskie, clarifying the legal basis of ": null
    },
    {
        "voivodship": "Voivodship"
    },
    {
        "sejmiks": "Sejmik"
    },
    {
        "- local parliaments. The king could ": null
    },
    {
        "promulgate": "Promulgation"
    },
    {
        " new laws, raise taxes, or call for a mass military call up pospolite ruszenie, only with the consent of the sejmiks, and the nobility were protected from judicial abuses. The Nieszawa Statutes also curbed the power of the magnates, as the Sejm, the national parliament, had the right to elect many officials, including judges, ": null
    },
    {
        "voivods": "Voivode"
    },
    {
        " and ": null
    },
    {
        "castellan": "Castellan"
    },
    {
        "s. These privileges were demanded by the szlachta in exchange for their participation in the ": null
    },
    {
        "Thirteen Years War": "Thirteen Years War"
    },
    {
        ".       The first ": null
    },
    {
        "free election": "Royal Elections In Poland"
    },
    {
        "  of a king took place in 1492. In fact, some earlier Polish kings had been elected with help from assemblies such as those that put ": null
    },
    {
        "Casimir II": "Casimir Ii Of Poland"
    },
    {
        " on the throne, thereby setting a precedent for free elections. Only ": null
    },
    {
        "senators": "Senator"
    },
    {
        "voted in the 1492 free election, which was won by ": null
    },
    {
        "John I Albert": "John I Albert"
    },
    {
        ". For the duration of the ": null
    },
    {
        "Jagiellonian Dynasty": "Jagiellonian Dynasty"
    },
    {
        ", only members of that royal family were considered for election. Later, there would be no restrictions on the choice of candidates.     In 1493 the Sejm, began meeting every two years at ": null
    },
    {
        "Piotrków": "Piotrków Trybunalski"
    },
    {
        ". It comprised two chambers:   a ": null
    },
    {
        "Senate": "Senat"
    },
    {
        "of 81 ": null
    },
    {
        "bishops": "Bishop"
    },
    {
        "and ": null
    },
    {
        "other dignitaries": "Offices In Polish-Lithuanian Commonwealthsenatorial Offices"
    },
    {
        " John I Albert": "John I Albert"
    },
    {
        " granted the ": null
    },
    {
        "Privilege of Piotrków": "Privilege Of Piotrków"
    },
    {
        ". The ": null
    },
    {
        "Statutes of Piotrków": "Statutes Of Piotrków"
    },
    {
        " increased the nobilitys ": null
    },
    {
        "feudal": "Feudal"
    },
    {
        " power over ": null
    },
    {
        "serfs": "Serfs"
    },
    {
        ". It bound the peasant to the land, and only one son though not the eldest, was permitted to leave the village. Townsfolk mieszczaństwo were prohibited from owning land. Positions in the ": null
    },
    {
        "Church": "Roman Catholic Church"
    },
    {
        " hierarchy were restricted to nobles.     On 23 October 1501, the ": null
    },
    {
        "Polish–Lithuanian union": "Polish–Lithuanian Union"
    },
    {
        " was reformed by the ": null
    },
    {
        "Union of Mielnik": "Union Of Mielnik"
    },
    {
        ". It was there that the tradition of a ": null
    },
    {
        "coronation Sejm": "Coronation Sejm"
    },
    {
        " was founded. Here again, the lesser nobility, lesser in wealth only - not in rank - attempted to reduce the power of the Magnates with a law that made them ": null
    },
    {
        "impeachable": "Impeachment"
    },
    {
        " before the Senate for ": null
    },
    {
        "malfeasance": "Malfeasance"
    },
    {
        ". However, the ": null
    },
    {
        "Act of Mielnik": "Act Of Mielnik"
    },
    {
        " of 25 October did more to strengthen the Magnate-dominated ": null
    },
    {
        "Senate of Poland": "Senate Of Poland"
    },
    {
        " than the lesser nobility. Nobles as a whole were given the right to disobey the King or his representatives — non praestanda oboedientia, and to form ": null
    },
    {
        "confederations": "Konfederacja"
    },
    {
        ", armed opposition against the king or state officials if the nobles found that the law or their legitimate privileges were being infringed.        On 3 May 1505 King ": null
    },
    {
        "Alexander I Jagiellon": "Alexander I Jagiellon"
    },
    {
        " granted the Act of  Nihil novi nisi commune consensu - I accept nothing new except by common consent . This forbade the king to pass new laws without the consent of the representatives of the nobility in the assembled Sejm, thus greatly strengthening the nobilitys powers. Essentially, this act marked the transfer of legislative power from the king to the Sejm. It also marks the beginning of the ": null
    },
    {
        "First Rzeczpospolita": "First Rzeczpospolita"
    },
    {
        ", the period of a szlachta-run Commonwealth .     In 1520 the Act of Bydgoszcz granted the Sejm the right to convene every four years, with or without the kings permission. At about that time the Executionist Movement, seeking to oversee law enforcement, began to take shape. Its members sought to curb the power of the Magnates at the Sejm and to strengthen the power of the monarch. In 1562 at the Sejm in Piotrków they forced the Magnates to return many leased ": null
    },
    {
        "crown lands": "Krolewszczyzna"
    },
    {
        " to the king, and the king to create a standing army ": null
    },
    {
        "wojsko kwarciane": "Wojsko Kwarciane"
    },
    {
        ". One of the most famous members of this movement was ": null
    },
    {
        "Jan Zamoyski": "Jan Zamoyski"
    },
    {
        ".          Until the death of ": null
    },
    {
        "Sigismund II Augustus": "Sigismund Ii Augustus"
    },
    {
        ", the last king of the ": null
    },
    {
        "Jagiellonian": "Jagiellonian"
    },
    {
        " dynasty, all monarchs had to be elected from within the royal family. However, from 1573, practically any Polish noble or foreigner of royal blood could potentially become a ": null
    },
    {
        "Polish–Lithuanian": "Polish–Lithuanian Commonwealth"
    },
    {
        " monarch. Every newly elected king was supposed to sign two documents: the  Pacta conventa , the kings pre-election pact , and the  Henrican articles , named after the first freely elected king, ": null
    },
    {
        "Henry of Valois": "Henry Iii Of France"
    },
    {
        ". The latter document was a virtual Polish constitution and contained the basic laws of the Commonwealth:   Free election of kings   ": null
    },
    {
        "Religious tolerance": "Religious Freedom In Poland"
    },
    {
        " Stefan Batory": "Stefan Batory"
    },
    {
        ", created the ": null
    },
    {
        "Crown Tribunal": "Crown Tribunal"
    },
    {
        " to reduce the enormous pressure on the ": null
    },
    {
        "Royal Court": "Court"
    },
    {
        ". This placed much of the monarchs juridical power in the hands of the elected szlachta deputies, further strengthening the nobility as a class. In 1581 the Crown Tribunal was joined by a counterpart in Lithuania, the ": null
    },
    {
        "Lithuanian Tribunal": "Lithuanian Tribunal"
    },
    {
        ".             For many centuries, wealthy and powerful members of the szlachta sought to gain legal privileges over their peers. Few szlachta were wealthy enough to be known as Magnates, karmazyni, the ": null
    },
    {
        "Crimsons": "Crimson"
    },
    {
        " - from the crimson colour of their boots. A true Magnate had to be able to trace his ancestry for many generations and own at least 20 villages or estates. He also had to hold high ": null
    },
    {
        "office in the Commonwealth": "Offices In Polish-Lithuanian Commonwealth"
    },
    {
        ".     . Thus, out of about one million szlachta, only 200–300 persons could be classed as great Magnates with country-wide possessions and influence. Of these some 30–40 were considered as having significant impact on Polands politics. Magnates often received gifts from monarchs, which greatly increased their wealth. Although such gifts were only temporary ": null
    },
    {
        "lease": "Lease"
    },
    {
        "s, often the Magnates never returned them. This gave rise in the 16th century, to a self-policing trend by the szlachta, known as the ruch egzekucji praw — movement for the enforcement of the law - against usurping Magnates to force them to return leased lands back to their rightful owner, the monarch.     One of the most important victories of the Magnates was the late 16th century right to create  Ordynacja s, similar to ": null
    },
    {
        "Fee tails": "Fee Tail"
    },
    {
        "under English law, which ensured that a family which gained landed wealth could more easily preserve it. The Ordynacjas that belonged to families such as the ": null
    },
    {
        "Radziwiłł": "Radziwiłł"
    },
    {
        ", ": null
    },
    {
        "Zamoyski": "Zamoyski"
    },
    {
        ", ": null
    },
    {
        "Potocki": "Potocki"
    },
    {
        " or ": null
    },
    {
        "Lubomirskis": "Lubomirski"
    },
    {
        "often rivalled the estates of the king and were important power bases for them.     Very high offices of the Polish crown were ": null
    },
    {
        "de facto": "De Facto"
    },
    {
        " hereditary and guarded by the ": null
    },
    {
        "magnate": "Magnate"
    },
    {
        "ria of Poland, leaving the lower offices below for middling nobility . The prestige of lower offices depended on the wealth of the region. The ": null
    },
    {
        "Masovia": "Masovia"
    },
    {
        " region of Poland had a long-standing reputation of being rather poor due to the condition of the soil.     The difference between the magnateria and the rest of the szlachta was primarily one of wealth and life-style, as both belonged to the same legally defined class being members of the same clans. Consequently, any power wrested from the king by the magnates was consequently trickled down to the entirety of the szlachta. This often meant the rest of the szlachta tended to cooperate with the magnates rather than struggle against them.       The notion of the szlachtas accrued sovereignty ended in 1795 with the final ": null
    },
    {
        "Partitions of Poland": "Partitions Of Poland"
    },
    {
        ", and until 1918 their legal status was dependent on the policies of the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        ", the ": null
    },
    {
        "Kingdom of Prussia": "Kingdom Of Prussia"
    },
    {
        " or the ": null
    },
    {
        "Habsburg Monarchy": "Habsburg Monarchy"
    },
    {
        ". A project begun in the ": null
    },
    {
        "Golden Age of Poland": "Golden Age Of Poland"
    },
    {
        " was finally eclipsed, but arguably the memory of it has lingered in succeeding generations. Kieniewicz, Jan. . THE JAGIELLONIAN IDEA AND THE PROJECT FOR THE FUTURE ,  Politeja , 6  Retrieved 2018-11-11.     In the 1840s ": null
    },
    {
        "Nicholas I": "Nicholas I Of Russia"
    },
    {
        " reduced 64,000 szlachta to commoner status. Richard Pipes, Russia under the old regime, page 181 Despite this, 62.8% of all Russias nobles were Polish szlachta in 1858 and still 46.1% in 1897. Seymour Becker, Nobility and Privilege in late Imperial Russia, page 182   ": null
    },
    {
        "Serfdom": "Polish Serfdom"
    },
    {
        " was abolished in Russian Poland on February 19, 1864. It was deliberately enacted with the aim of ruining the szlachta. Only in the ": null
    },
    {
        "Russian Partition": "Russian Partition"
    },
    {
        " did peasants pay the market price for land redemption, the average for the rest of the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        " was 34% above the market rates. All land taken from Polish peasants since 1846 was to be returned to them without redemption payments. The ex-serfs could only sell land to other peasants, not szlachta. 90% of the ex-serfs in the empire who actually gained land after 1861 lived in the 8 western provinces. Along with ": null
    },
    {
        "Romania": "Romania"
    },
    {
        ", Polish landless or domestic serfs were the only ones to be given land after serfdom was abolished. The End of the Old Order in Rural Europe, Jerome Blum, page 391. All this was to punish the szlachtas role in the uprisings of 1830 and 1863.   By 1864 80% of szlachta were déclassé - downward social mobility. One quarter of petty nobles were worse off than the average serf. While 48.9% of the land in Russian Poland was in peasant hands, nobles still held onto 46%. Norman Davies, Gods playground, pages 182 and 188 In the ": null
    },
    {
        "Second Polish Republic": "Second Polish Republic"
    },
    {
        " the privileges of the nobility were legally abolished by the ": null
    },
    {
        "March Constitution": "March Constitution"
    },
    {
        " in 1921 and as such not reinstated by any succeeding ": null
    },
    {
        "Polish": "Poland"
    },
    {
        " law.                Despite preoccupations with warring, politics and status, the szlachta in Poland, as did people from all social classes, played its part in contributing in fields ranging from literature, art and architecture, philosophy, education, agriculture and the many branches of science, to technology and industry. Aftanazy Roman. Dzieje Rezydencji na dawnych kresach Rzeczpospolitej. Zakład Narodowy im. Ossolińskich. Editions. Wroclaw 1991-97  Entry about ": null
    },
    {
        "Piotr Steinkeller": "Piotr Steinkeller"
    },
    {
        ", King of Zinc in The Annual Register Or A View of the History of Politics and Literature for the Year 1837, publ. J. Dodsley. London: 1838.  & pgRA1-PA264 & lpgRA1-PA264 & dqhistory+of+wenlock+road+london & sourcebl & otsuW8GppyPPt & sig9VPCpoOs-DxUyYd9Ke2hicpl84w & hlen & saX & ved0ahUKEwiBoYifp5LZAhWHKsAKHetdCKs4FBDoAQgsMAEvonepage & q & ffalse Perhaps foremost among the cultural determinants of the nobility in Poland were its continuing international connections with the Rome-based ": null
    },
    {
        "Catholic Church": "Catholic Church"
    },
    {
        ". It was from the ranks of the szlachta that were drawn the churchs leading ": null
    },
    {
        "Prelates": "Prelate"
    },
    {
        "until the 20th century. Other international influences came through the more or less secretive and powerful Christian and lay organisations such as the ": null
    },
    {
        "Sovereign Military Order of Malta": "Sovereign Military Order Of Malta"
    },
    {
        ", focused on hospital and other charitable activity. Association of Polish Knights of Malta: History of the Order in Poland.  & viewarticle & id46 & Itemid60 The most notable Polish Maltese Knight was the Pozńan commander, ": null
    },
    {
        "Bartłomiej Nowodworski": "Bartłomiej Nowodworski High School"
    },
    {
        ", founder in 1588 of the oldest school in Poland. One alumnus was ": null
    },
    {
        "John III Sobieski": "John Iii Sobieski"
    },
    {
        ".    In the 18th century, after several false starts, international ": null
    },
    {
        "Freemasonry": "Freemasonry"
    },
    {
        ", wolnomularstwo, from western lodges, became established among the higher échelons of the szlachta, and in spite of membership of some clergy, it was intermittently but strongly opposed by the Catholic Church. After the partitions it became a cover for opposition to the occupying powers. Wojtowicz, Norbert. Freemasonry in Poland - Formerly and Today. Wrocław.  Also in the 18th century there was a marked development in ": null
    },
    {
        "Patronage": "Patronage"
    },
    {
        " of the arts during the reign of ": null
    },
    {
        "Stanisław August Poniatowski": "Stanisław August Poniatowski"
    },
    {
        ", himself a freemason, and with the growth of social awareness, in ": null
    },
    {
        "Philanthropy": "Philanthropy"
    },
    {
        ".       High-born women in Polish-Lithuanian Commonwealth exerted political and cultural influence throughout history in their own country and abroad, as queens, princesses   and the wives or widows of magnates. Their cultural activities came into sharper relief in the 18th century with their hosting of ": null
    },
    {
        "salons": "Salon"
    },
    {
        " in the French manner. They went on to publish as translators and writers and as facilitators of educational and social projects. Bogucka Maria. Women in Early Modern Polish Society, Against the European Background. London: Routledge, 2017. , 9781351871990      Notable women members of the szlachta who exerted political and/or cultural influence include:   ": null
    },
    {
        "Queen Jadwiga": "Queen Jadwiga"
    },
    {
        " Bona Sforza": "Bona Sforza"
    },
    {
        " Zofia Lubomirska": "Zofia Lubomirska"
    },
    {
        " Anna Jabłonowska": "Anna Jabłonowska"
    },
    {
        " Elzbieta Lubomirska": "Elzbieta Lubomirska"
    },
    {
        " Eleonora Czartoryska": "Eleonora Czartoryska"
    },
    {
        " Izabela Czartoryska": "Izabela Czartoryska"
    },
    {
        " Barbara Sanguszko": "Barbara Sanguszko"
    },
    {
        " Tekla Teresa Lubienska": "Tekla Teresa Lubienska"
    },
    {
        "             The szlachta, no less than the rest of the population, placed a particular accent on food. It was at the centre of courtly and estate entertaining and in good times, at the heart of village life. During the Age of Enlightenment, King Stanislaw August Poniatowski emulated the French ": null
    },
    {
        "Salons": "Salon"
    },
    {
        " by holding his famed ": null
    },
    {
        "Thursday Lunches": "Thursday Lunches"
    },
    {
        " for intellectuals and artists, drawn chiefly from the szlachta. Michniewski, A. „Do czwartku”, Zabawy Przyjemne i Pożyteczne 1772 , v. 12, p. 1. Ed. ": null
    },
    {
        "J. Kott": "Jan Kott"
    },
    {
        " in Poezja polska wieku Oświecenia, Warsaw. 1954 and 1956 His Wednesday Lunches were gatherings for policy makers in science, education and politics.     There was a tradition, particularly in ": null
    },
    {
        "Mazovia": "Mazovia"
    },
    {
        ", kept till the 20th century, of estate owners laying on a festive banquet at the completion of ": null
    },
    {
        "harvest": "Harvest"
    },
    {
        " for their staff, known as  Dożynki , as a way of expressing an acknowledgment of their work. It was equivalent to a ": null
    },
    {
        "harvest festival": "Harvest Festival"
    },
    {
        ". Polish food varied according to region, as elsewhere in Europe, and was influenced by settlers, especially ": null
    },
    {
        "Jewish cuisine": "Jewish Cuisine"
    },
    {
        ", and occupying armies. Robert Strybel, Maria Strybel.  . ": null
    },
    {
        "Hippocrene Books": "Hippocrene Books"
    },
    {
        ". 2005. Maria Dembińska, William Woys Weaver. Food and Drink in Medieval Poland: Rediscovering a Cuisine of the Past. ": null
    },
    {
        "University of Pennsylvania Press": "University Of Pennsylvania Press"
    },
    {
        ". 1999.                One of the favourite szlachta pastimes was hunting Łowiectwo. Szymańska, Aleksandra Sezon myśliwski we dworze . Rolniczy Magazyn Elektroniczny. Centralna Biblioteka Rolnicza im. Michała Oczapowskiego.  Before the formation of Poland as a state, hunting was accessible to everyone. With the introduction of rulers and rules, big game, generically zwierzyna: ": null
    },
    {
        "Aurochs": "Aurochs"
    },
    {
        ", ": null
    },
    {
        "bison": "European Bison"
    },
    {
        ", deer and boar became the preserve of kings and princes on penalty of ": null
    },
    {
        "poachers": "Poaching"
    },
    {
        "death. From the 13th century on the king would appoint a high-ranking courtier to the role of Master of the Hunt,  Łowczy . In time, the penalties for poaching were commuted to fines and from around the 14th century, landowners acquired the right to hunt on their land. Small game, foxes, hare, badger and stoat etc. were fair game to all comers. Hunting became one of the most popular social activities of the szlachta until the partitions, when different sets of restrictions in the three territories were introduced. This was with a view to curbing social interaction among the subject Poles. Cheda, Jacek. Łowiectwo i jego rola w życiu społecznym Wielkiej Brytanii i Polski. Civitas Hominibus: rocznik filozoficzno-spoleczny, 5. 91-105.  See p.94. This is a comparison of hunting as a social activity in Great Britain and Poland. Over the centuries, at least two breeds of specialist hounds were bred in Poland. One was the ": null
    },
    {
        "Polish Hunting Dog": "Polish Hunting Dog"
    },
    {
        ", the brach. The other was the ": null
    },
    {
        "Ogar Polski": "Ogar Polski"
    },
    {
        ". ": null
    },
    {
        "Count Xavier Branicki": "Count Xavier Branicki"
    },
    {
        " was so nostalgic about Polish hunting, that when he settled in France in the mid 19th century, and restored his estate at the ": null
    },
    {
        "Chateau de Montresor": "Chateau De Montresor"
    },
    {
        ", he ordered a brace of Ogar Polski hounds from the Polish breeder and szlachcic, Piotr Orda.  retrieved 2015-11-24.       The szlachta differed in many respects from the nobility in other countries. The most important difference was that, while in most European countries the nobility lost power as the ruler strove for ": null
    },
    {
        "absolute monarchy": "Absolute Monarchy"
    },
    {
        ", in the Polish-Lithuanian Commonwealth a reverse process occurred: the nobility actually gained power at the expense of the king, and enabled the ": null
    },
    {
        "political system": "Political System"
    },
    {
        " to evolve into an ": null
    },
    {
        "oligarchy": "Oligarchy"
    },
    {
        ".     Szlachta members were also proportionately more numerous than their equivalents in all other European countries, constituting 6–12% of the entire population.  By contrast, nobles in other European countries, except for Spain, amounted to a mere 1–3%. Most of the szlachta were minor nobles or ": null
    },
    {
        "smallholders": "Smallholding"
    },
    {
        ". In Lithuania the minor nobility made up to 3/4 of the total szlachta population.  By the mid-16th century the szlachta class consisted of at least 500,000 persons and was possibly a million strong in 1795.      The proportion of nobles in the population varied across regions. In the 16th century, the highest proportion of nobles lived in the ": null
    },
    {
        "Płock Voivodeship": "Płock Voivodeship"
    },
    {
        " and in ": null
    },
    {
        "Podlachia": "Podlachia"
    },
    {
        " , while Galicia had numerically the largest szlachta population. In districts, such as ": null
    },
    {
        "Wizna": "Wizna Land"
    },
    {
        " and ": null
    },
    {
        "Łomża": "Łomża Land"
    },
    {
        ", the szlachta constituted nearly half of the population. Regions with the lowest percentage of nobles were the ": null
    },
    {
        "Kraków Voivodeship": "Kraków Voivodeship"
    },
    {
        " with , ": null
    },
    {
        "Royal Prussia": "Royal Prussia"
    },
    {
        " with and the ": null
    },
    {
        "Sieradz Voivodeship": "Sieradz Voivodeship"
    },
    {
        " with 4,6%.  Before the ": null
    },
    {
        "Union of Lublin": "Union Of Lublin"
    },
    {
        ", inequality among nobles in terms of wealth and power was far greater in the Grand Duchy of Lithuania than in the Polish Kingdom. The further south and east one went, the more the territory was dominated by magnate families and other nobles. In the Lithuanian and Ruthenian palatinates, poor nobles were more likely to rent smallholdings from magnates than to own land themselves.           It has been said that the ruling elites were the only socio-political milieu to whom a sense of national consciousness could be attributed. All szlachta members, irrespective of their cultural/ethnic background, were regarded as belonging to a single political nation within the Commonwealth. Arguably, a common culture, the Catholic religion and the Polish language were seen as the main unifying factors in the dual state.  Prior to the Partitions there was said to have been no Polish national identity as such. Only szlachta members, irrespective of their ethnicity or culture of origin, were considered as Poles .  Stauter-Halsted, Keely The Nation in the Village. The Genesis of Peasant National Identity in Austrian Poland, 1848–1914 Jan Molenda Chłopi – naród – niepodległość. Kształtowanie się postaw narodowych i obywatelskich chłopów w Galicji i Królestwie Polskim w przededniu odrodzenia Polski     Despite ": null
    },
    {
        "polonisation": "Polonization"
    },
    {
        " in Lithuania and ": null
    },
    {
        "Ruthenia": "Ruthenia"
    },
    {
        " in the XVII-XVIII centuries, a large part of the lower szlachta managed to retain their cultural identity in various ways. Михайлов Грушевський Українська шляхта в Галичині на переломі XVI і XVII в.    Due to poverty most of the local szlachta had never had access to formal education nor to Polish language teaching and hence could not be expected to self-identify as Poles.  It was common even for wealthy and in practice polonised szlachta members still to refer to themselves as Lithuanian, Litwin or Ruthenian, Rusyn.           According to Polish estimates from the 1930s, 300,000 members of the common nobles -szlachta zagrodowa - inhabited the ": null
    },
    {
        "subcarpathian": "Outer Subcarpathia"
    },
    {
        " region of the ": null
    },
    {
        "Second Polish Republic": "Second Polish Republic"
    },
    {
        " out of 800,000 in the whole country. 90% of them were Ukrainian-speaking and 80% were Ukrainian ": null
    },
    {
        "Greek Catholics": "Greek Catholic Church"
    },
    {
        ".  In other parts of the Ukraine with a significant szlachta population, such as the ": null
    },
    {
        "Bar": "Bar, Vinnytsia Oblast"
    },
    {
        " or the ": null
    },
    {
        "Ovruch region": "Ovruch"
    },
    {
        "s, the situation was similar despite ": null
    },
    {
        "russification": "Russification"
    },
    {
        " and earlier polonization.  Грушевський М. С. Барська околична шляхта до к XVIII ст. : Етнографічний нарис / М. С. Грушевський // Грушевський, Михайло Сергійович. Твори: у 50 т. / М. С. Грушевський; редкол.: П. Сохань , І. Гирич та ін. – Львів: Видавництво Світ . – 2003. Т. 5. Т. 5. – C. 323 - 336 Тимошенко В. У лещатах двоглавого орла / В.Тимошенко // Українознавство. – К., 2009 – No 2. – С. 55–59. As an example:               However the era of sovereign rule by the szlachta ended earlier than in other countries, excluding France, in 1795 . Since then their legitimacy and fate depended on the legislation and policies of the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        ", ": null
    },
    {
        "Kingdom of Prussia": "Kingdom Of Prussia"
    },
    {
        " and ": null
    },
    {
        "Habsburg Monarchy": "Habsburg Monarchy"
    },
    {
        ". Their privileges became increasingly limited, and were ultimately dissolved by the ": null
    },
    {
        "March Constitution of Poland": "March Constitution"
    },
    {
        " in 1921.     There were a number of avenues to upward social mobility and the attainment of nobility. The szlachta was not rigidly exclusive or closed as a class, but according to ": null
    },
    {
        "heraldic": "Heraldic"
    },
    {
        " sources, the total number of legal ennoblements issued between the 14th and mid-18th century, is estimated at approximately 800. This is an average of about two ennoblements per year, or 0.000,000,14 – 0.000,001 of the historical population.     According to two English journalists ": null
    },
    {
        "Richard Holt Hutton": "Richard Holt Hutton"
    },
    {
        " and ": null
    },
    {
        "Walter Bagehot": "Walter Bagehot"
    },
    {
        " writing on the subject in 1864,          and          Sociologist and historian, ": null
    },
    {
        "Jerzy Ryszard Szacki": "Jerzy Szacki"
    },
    {
        " said in this context,        Others assert the szlachta were not a ": null
    },
    {
        "social class": "Social Class"
    },
    {
        ", but a ": null
    },
    {
        "caste": "Caste"
    },
    {
        ", among them, historian ": null
    },
    {
        "Adam Zamoyski": "Adam Zamoyski"
    },
    {
        ",        Jerzy Szacki continues,          Low-born individuals, including ": null
    },
    {
        "townsfolk": "Townsfolk"
    },
    {
        " mieszczanie, ": null
    },
    {
        "peasants": "Peasant"
    },
    {
        " chłopi, but not Jews Żydzi, could and did rise to official ": null
    },
    {
        "ennoblement": "Ennoblement"
    },
    {
        " in Commonwealth society, although ": null
    },
    {
        "Charles-Joseph, 7th Prince of Ligne": "Charles-Joseph, 7Th Prince Of Ligne"
    },
    {
        ", while trying to obtain Polish noble status, is supposed to have said in 1784,          Each szlachcic was said to hold enormous potential influence over the countrys politics, far greater than that enjoyed by the citizens of modern democratic countries. Between 1652 and 1791, any nobleman could potentially nullify all the proceedings of a given sejm or sejmik by exercising his individual right of  liberum veto  - Latin for I do not allow - except in the case of a ": null
    },
    {
        "confederated sejm": "Confederated Sejm"
    },
    {
        " or confederated sejmik.     In old Poland, a nobleman could only marry a noblewoman, as intermarriage between castes was fraught with difficulties.   ; but, children of a legitimate marriage followed the condition of the father, never the mother, therefore, only the father transmitted his nobility to his children.   See  patrilineality . A noble woman married to a commoner could not transmit her nobility to her husband and their children. Any individual could attain ennoblement  for special services to the state. A foreign noble might be naturalized as a Polish noble through the mechanism called the  Indygenat , certified by the king. Later, from 1641, it could only be done by a ": null
    },
    {
        "general sejm": "General Sejm"
    },
    {
        ". By the eighteenth century all these trends contributed to the great increase in the proportion of szlachta in the total population.     In theory all szlachta members were social equals and were formally legal peers. Those who held civic appointments were more privileged but their roles were not hereditary. Those who held honorary appointments were superior in the hierarchy but these positions were only granted for a lifetime. Some tenancies became hereditary and went with both privilege and title. Nobles who were not direct ": null
    },
    {
        "Lessees": "Lessee"
    },
    {
        "of the Crown but held land from other lords were only peers de iure . The poorest enjoyed the same rights as the wealthiest magnate. The exceptions were a few symbolically privileged families such as the Radziwiłł, Lubomirski and ": null
    },
    {
        "Czartoryski": "Czartoryski"
    },
    {
        ", who held honorary aristocratic titles bestowed by foreign courts and recognised in Poland which granted them use of titles such as Prince or ": null
    },
    {
        "Count": "Count"
    },
    {
        " . See also ": null
    },
    {
        "The Princely Houses of Poland": "The Princely Houses Of Poland"
    },
    {
        ". All other szlachta simply addressed each other by their given name or as Brother, Sir Panie bracie or the feminine equivalent. The other forms of address would be Illustrious and Magnificent Lord , Magnificent Lord , Generous Lord or Noble Lord in descending order, or simply His/Her Grace Lord/Lady .     The notion that all Polish nobles were social equals, regardless of their financial status or offices held, is enshrined in a traditional Polish ": null
    },
    {
        "adage": "Adage"
    },
    {
        ":        equivalent to:             According to their wealth, the nobility were divided into:   ": null
    },
    {
        "magnates": "Magnates Of Poland And Lithuania"
    },
    {
        ": the wealthiest class; owners of vast lands, towns, many villages, thousands of peasants   middle nobility średnia szlachta, owners of one or more villages, often having some official titles or Envoys from the local Land Assemblies to the General Assembly,   ": null
    },
    {
        "petty nobility": "Petty Nobility"
    },
    {
        " drobna szlachta, owners of part of a village or owning no land at all, often referred to by a variety of colourful Polish terms such as:   szaraczkowa – grey nobility, from their grey, ": null
    },
    {
        "wool": "Wool"
    },
    {
        "len, undyed ": null
    },
    {
        "żupans": "Żupan"
    },
    {
        "  okoliczna – local nobility, similar to zaściankowa zagrodowa – from zagroda, a farm, often little different from a peasants dwelling   zagonowa – from zagon, a small unit of land measure, hide nobility cząstkowa – partial, owners of only part of a single village   panek – little pan , term used in ": null
    },
    {
        "Kaszuby": "Kashubia"
    },
    {
        ", the Kashubian region, also one of the legal terms for legally separated lower nobility in late medieval and early modern Poland   hreczkosiej –  buckwheat sowers – those who had to work their fields themselves.   zaściankowa – from zaścianek, a name for plural nobility settlement, neighbourhood nobility. Just like hreczkosiej, zaściankowa nobility would have no peasants.   brukowa –  cobble nobility, for those living in towns like townsfolk   gołota – naked nobility, i.e., the landless; the poorest szlachta that was considered the lowest of the high . It was later stripped of voting rights.   półpanek ; also podpanek/pidpanek in ": null
    },
    {
        "Podolia": "Podolia"
    },
    {
        " and Ukrainian accent  – a petty szlachcic pretending to be wealthy.     ": null
    },
    {
        "Landed szlachta": "Polish Landed Gentry"
    },
    {
        " - ziemianie or ziemiaństwo - meant any nobleman who owned land, including magnates, the lesser nobility and those who owned at least part of the village. Since titular ": null
    },
    {
        "manorial lordships": "Lord Of The Manor"
    },
    {
        " were also open to burgers of certain privileged cities with a royal charter, not all landed gentry had hereditary title to noble status.                ": null
    },
    {
        "Coats of arms": "Coat Of Arms"
    },
    {
        " were very important to the szlachta. Its heraldic system evolved together with neighbouring states in ": null
    },
    {
        "Central Europe": "Central Europe"
    },
    {
        ", while differing in many ways from the heraldry of other European countries. Polish Knighthood had its counterparts, links and roots in ": null
    },
    {
        "Moravia": "Moravia"
    },
    {
        ", e.g. ": null
    },
    {
        "Poraj coat of arms": "Poraj Coat Of Arms"
    },
    {
        " and in ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ", e.g. ": null
    },
    {
        "Junosza coat of arms": "Junosza Coat Of Arms"
    },
    {
        ".     Families who had a common origin would also share a coat of arms. They would also share their crest with families adopted into the clan. Sometimes unrelated families would be falsely attributed to a clan on the basis of similarity of crests. Some noble families inaccurately claimed clan membership. The number of coats of arms in this system was comparatively low and did not exceed 200 in the late Middle Ages. There were 40,000 in the late 18th century.     At the ": null
    },
    {
        "Union of Horodło": "Union Of Horodło"
    },
    {
        ", forty-seven families of Catholic Lithuanian lords and boyars were adopted by Polish szlachta families and allowed to use Polish coats of arms.         The tradition of differentiating between a coat of arms and a ": null
    },
    {
        "lozenge": "Lozenge"
    },
    {
        " granted to women, did not develop in Poland. By the 17th century, invariably, men and women inherited a coat of arms from their father. When mixed marriages developed after the partitions, that is between commoners and members of the nobility, as a courtesy, children could claim a coat of arms from their ": null
    },
    {
        "distaff": "Distaff"
    },
    {
        " side, but this was only tolerated and could not be passed on into the next generation. The ": null
    },
    {
        "brisure": "Brisure"
    },
    {
        " was rarely used. All children would inherit the coat of arms and title of their father. This partly accounts for the relatively large proportion of Polish families who had claim to a coat of arms by the 18th century. Another factor was the arrival of titled foreign settlers, especially from the German lands and the Habsburg Empire.     Illegitimate children could adopt the mothers surname and title by the consent of the mothers father, but would sometimes be adopted and raised by the natural fathers family, thereby acquiring the fathers surname, though not the title or arms.          The szlachtas prevalent ": null
    },
    {
        "ideology": "Ideology"
    },
    {
        ", especially in the 17th and 18th centuries, was manifested in its adoption of ": null
    },
    {
        "Sarmatism": "Sarmatism"
    },
    {
        " , a word derived from the ": null
    },
    {
        "legend": "Legend"
    },
    {
        " that its origins reached back to the ancient tribe of an Iranic people, the ": null
    },
    {
        "Sarmatians": "Sarmatians"
    },
    {
        ". This nostalgic belief system embracing chivalry and courtliness, became an important part of szlachta culture and affected all aspects of their lives. It was popularized by poets who exalted traditional village life, peace and pacifism. It was also manifested in oriental-style apparel, the  żupan ,  kontusz ,  sukmana ,  pas kontuszowy ,  delia  and made the ": null
    },
    {
        "scimitar": "Scimitar"
    },
    {
        "-like  szabla  a near-obligatory item of everyday szlachta apparel. Sarmatism served to integrate a nobility of disparate provenance, as it sought to create a sense of ": null
    },
    {
        "national": "Nationalism"
    },
    {
        " unity and pride in the szlachtas ": null
    },
    {
        "Golden Liberty": "Golden Liberty"
    },
    {
        " złota wolność. It was marked furthermore by a linguistic affectation among the szlachta of mixing Polish and Latin vocabulary, producing a form of Polish ": null
    },
    {
        "Dog Latin": "Dog Latin"
    },
    {
        " peppered with ": null
    },
    {
        "macaronisms": "Macaronic Language"
    },
    {
        " in everyday conversation. Wasko, Andrzej. Sarmatism or the Enlightenment, The Dilemma of Polish Culture . The Sarmatian Review. . Retrieved 2018-11-12.       Prior to the ": null
    },
    {
        "Reformation": "Protestant Reformation"
    },
    {
        ", the Polish nobility were either Roman Catholic or ": null
    },
    {
        "Orthodox": "Eastern Orthodox Church"
    },
    {
        " with a small group of ": null
    },
    {
        "Muslims": "Islam In Poland"
    },
    {
        ". See the Muslim, ": null
    },
    {
        "Haroun Tazieff": "Haroun Tazieff"
    },
    {
        " of princely ": null
    },
    {
        "Tartar": "Tartars"
    },
    {
        " extraction.  Many families, however, went on to adopt the ": null
    },
    {
        "Reformed": "Reformed"
    },
    {
        " Christian faith. ": null
    },
    {
        "Jan Łaski": "Jan Łaski"
    },
    {
        " or Johannes Alasco was a cleric, whose uncle, the eponymous ": null
    },
    {
        "Jan Łaski ": "Jan Łaski"
    },
    {
        " was ": null
    },
    {
        "Grand Chancellor of the Crown": "Grand Chancellor Of The Crown"
    },
    {
        ", Archbishop of Gniezno and ": null
    },
    {
        "Primate of Poland": "Primate Of Poland"
    },
    {
        ". His nephew was an early convert to ": null
    },
    {
        "Calvinism": "Calvinism"
    },
    {
        " and had a hand in implementing ": null
    },
    {
        "Reformation": "English Reformation"
    },
    {
        " in England where he is known as John Laski.     After the ": null
    },
    {
        "Counter-Reformation": "Counter-Reformation"
    },
    {
        ", when the Roman Catholic Church regained power in ": null
    },
    {
        "Poland": "Poland"
    },
    {
        ", the nobility became almost exclusively Catholic. Approximately 45% of the population were Roman Catholic or members of Protestant denominations, 36% were Greek Catholic, 4% Orthodox, of whom some were members of the ": null
    },
    {
        "Armenian Apostolic": "Armenian Apostolic Church"
    },
    {
        " or the ": null
    },
    {
        "Armenian Catholic Church": "Armenian Catholic Church"
    },
    {
        "es and the ": null
    },
    {
        "Georgian Orthodox Church": "Georgian Orthodox Church"
    },
    {
        ". The remaining 15% were made up of a substantial minority of Jews. Kuklo C. Demografia Rzeczypospolitej Przedrozbiorowej — Warsawa: Wydawnictwo DiG, 2009. — 518 p. — P. 211. In the 18th century, the followers of ": null
    },
    {
        "Jacob Frank": "Jacob Frank"
    },
    {
        " were ennobled as a result of their conversion to Roman Catholicism. Although ": null
    },
    {
        "Judaism": "Jews In Poland"
    },
    {
        " per se had not been a bar to noble status, in practice there were laws that favoured religious conversion to Christianity by rewarding it with ennoblement .  ,  Rzeczpospolita  daily, ": null
    },
    {
        "Tomasz Lenczewski": "Tomasz Lenczewski"
    },
    {
        ", 2008 A later example, in 1839, of certifying the noble status of converts is the ": null
    },
    {
        "Wołowski": "Louis Wolowski"
    },
    {
        " family with the Bawół coat of arms. List of Polish clan coats of arms: ": null
    }
]