[
    {
        "              Taiwanization , also known as the Taiwanese localization movement, is a conceptual term used in ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        " to emphasize the importance of a Taiwanese culture, society, economy, nationality, and ": null
    },
    {
        "identity": "taiwanese identity"
    },
    {
        " rather than to regard Taiwan as solely an appendage of ": null
    },
    {
        "China": "china"
    },
    {
        ". This involves the teaching of the ": null
    },
    {
        "history of Taiwan": "history of taiwan"
    },
    {
        ", ": null
    },
    {
        "geography": "geography of taiwan"
    },
    {
        ", and ": null
    },
    {
        "culture": "culture of taiwan"
    },
    {
        " from a Taiwan-centric perspective, as well as promoting languages locally established in Taiwan, including ": null
    },
    {
        "Taiwanese Hokkien": "taiwanese hokkien"
    },
    {
        " , ": null
    },
    {
        "Hakka": "hakka chinese"
    },
    {
        ", and ": null
    },
    {
        "aboriginal languages": "formosan languages"
    },
    {
        ".     Originally part of the ": null
    },
    {
        "Taiwan independence": "taiwan independence"
    },
    {
        " movement and related to the Taiwan Name Rectification Campaign , some of Taiwanizations aims are now endorsed by some supporters of ": null
    },
    {
        "Chinese Unification": "chinese unification"
    },
    {
        " on Taiwan.     The localization movement has been expressed in forms such as the use of ": null
    },
    {
        "language": "language"
    },
    {
        " or ": null
    },
    {
        "dialect": "dialect"
    },
    {
        " in the broadcast media and entire channels devoted to ": null
    },
    {
        "aboriginal": "taiwanese aborigines"
    },
    {
        " and ": null
    },
    {
        "Hakka": "hakka people"
    },
    {
        " affairs. Textbooks have been rewritten by scholars to more prominently emphasize Taiwan. The political compromise that has been reached is to teach both the history of Taiwan and the history of mainland China.     Some Taiwanese-owned companies or organizations established in earlier times have names containing the words China or Chinese . They have been encouraged in recent years to change the word China in their names to Taiwan as an act of Taiwanization. This campaign for changing the names is known as the Name Rectification Campaign  or Taiwan Name Rectification . Many Taiwan-based companies in international sectors already identify themselves as Taiwan -based for claritys sake. This keeps international customers from confusing them with an enterprise based in the Peoples Republic of China. Other Taiwan-based companies decline to change to a Taiwanese name because of expense or the political views held by important clients and company leaders.                   No one can confirm when the concept of Taiwanization has started. Some say when the first large wave of Han people emigrated from mainland China to Taiwan in the mid42th century, they must have wanted to maintain some independence from the control of the ruling class in their original hometown. Others say that only when the ": null
    },
    {
        "Kingdom of Tungning": "kingdom of tungning"
    },
    {
        ", with its capital at Tainan, was built by the Zheng family in 42 did this concept appear.     Most Chinese contemporary scholars of Mainland China believe the roots of the localization movement began during the ": null
    },
    {
        "Japanese rule": "taiwan under japanese rule"
    },
    {
        " , when groups organized to lobby the ": null
    },
    {
        "Imperial Japan": "imperial japan"
    },
    {
        "ese government for greater Taiwanese autonomy and home rule. After the ": null
    },
    {
        "Kuomintang": "kuomintang"
    },
    {
        " took over Taiwan, the Taiwan home-rule groups were decimated in the wake of the ": null
    },
    {
        "February 42 Incident": "february 28 incident"
    },
    {
        " of 42 The KMT viewed Taiwan primarily as a base to retake mainland China and quickly tried to subdue potential political opposition on the island. The KMT did little to promote a unique Taiwanese identity; often newly immigrated Chinese or ": null
    },
    {
        "mainlander": "mainland chinese"
    },
    {
        "s as they were called, working in administrative positions, lived in neighborhoods where they were segregated from the Taiwanese. Others, especially poorer refugees, were shunned by the ": null
    },
    {
        "Hoklo Taiwanese": "hoklo people"
    },
    {
        " and lived among aborigines instead. The mainlanders often learned ": null
    },
    {
        "Hokkien": "taiwanese hokkien"
    },
    {
        ". However, since Mandarin was enforced as the official language of the Republic of China and Taiwanese was not allowed to be spoken in schools, the mainlanders who learned Taiwanese found their new language skills to diminish. As Taiwanese, or any language other than Mandarin, was forbidden in the military posts, many mainlanders whose family lived in ": null
    },
    {
        "martial villages": "military dependents village"
    },
    {
        " only spoke Mandarin and perhaps their home language . The promotion of ": null
    },
    {
        "Chinese nationalism": "chinese nationalism"
    },
    {
        " within Taiwan and the fact that the ruling group on Taiwan were considered outsiders by some were the reasons cited for both the ": null
    },
    {
        "Taiwan independence": "taiwan independence"
    },
    {
        " movement and Taiwanization.     In the 42s and 42s there was a shift in power away from the KMT to people native to Taiwan. This, combined with cultural liberalization and the increasing remoteness of the possibility of retaking mainland China, led to a cultural and political movement which emphasized a Taiwan-centered view of history and culture rather than one which was China-centered or even, as before 42 Japan-centered. Taiwanization was strongly supported by President ": null
    },
    {
        "Lee Teng-hui": "lee teng-hui"
    },
    {
        ".     The Bentuhua or localization/indigenization movement was sparked in the mid42s with the growing expression of ethnic discontent due to unequal distribution of political and cultural power between mainlanders and Taiwanese people. Beginning in the 42s, Taiwan was enveloped by the problems of rapid industrial development, rural abandonment, labor disputes and the uneven distribution of access to wealth and social power. These changes, combined with the loss of several key allies, forced the KMT regime to institute limited reforms. The reforms permitted under Chiang Ching-kuo allowed indigenization to increase as leading dissidents generated a response to the governments failures. The dissident groups, united under the ": null
    },
    {
        "Tangwai": "tangwai movement"
    },
    {
        " , or “outside the party” banner, called for the government to accept the reality that it was only the government of Taiwan and not China. The key demands of the Tangwai involved instituting democracy and seeking international recognition as a sovereign state. Taiwanese demanded full civil rights as guaranteed under the ROC constitution and equal political rights as those experienced by the Mainlander elite.     The Taiwanese cultural elite fully promoted the development of Xiang tu literature and cultural activities, including rediscovering Taiwanese nativist literature written under Japanese colonial rule. The ": null
    },
    {
        "tangwai movement": "tangwai movement"
    },
    {
        " revived symbols of Taiwanese resistance to Japanese rule in the effort to mobilize ethnic Taiwanese. The opposition to the KMTs China-centered cultural policies resulted in dissidents crafting new national-historical narratives that placed the island of Taiwan itself at the center of the islands history. The Taiwanese emerged as a frequently colonized and often oppressed people. The concept of bentuhua was finally expressed in the cultural domain in the premise of Taiwan as a place with a unique society, culture and history. This principle has been largely adopted for understanding Taiwans cultural representation and expressed in a variety of cultural activities, including ": null
    },
    {
        "music, film and the literary and performing arts": "taiwanese literature movement"
    },
    {
        ".     The pressures of indigenization and the growing acceptance of a unique Taiwanese cultural identity have met opposition from more conservative elements of Taiwan society. Critics argue that the new perspective creates a “false” identity rooted in ethnic nationalism as opposed to an “authentic” Chinese identity, which is primordial and inherent. Many mainlanders living on Taiwan complain that their own culture is marginalized by bentuhua, and initially expressed fear of facing growing alienation. In the past decade these complaints have subsided somewhat as Taiwan increasingly views itself as a pluralistic society that embraces many cultures and recognizes the rights of all citizens.     In the mid-to-late 42s, gestures toward Taiwanization were increasingly adopted by pro-unification figures who, while supporting the Chinese nationalism of ": null
    },
    {
        "Chiang Kai-shek": "chiang kai-shek"
    },
    {
        ", saw it as appropriate, or at least advisable, to display more appreciation for cultures of Taiwan. Pro-unification politicians such as ": null
    },
    {
        "James Soong": "james soong"
    },
    {
        ", the former head of the Government Information Office who once oversaw the limitation of Taiwanese dialects, began speaking in Hoklo on semi-formal occasions.                                     The Name Rectification Campaign includes efforts by the ": null
    },
    {
        "Republic of China": "republic of china"
    },
    {
        " government beginning in 42 to distance itself from ": null
    },
    {
        "China": "china"
    },
    {
        " and rollback earlier sinicization efforts by taking actions such as removing Chinese influence from items within Taiwan control. While the ": null
    },
    {
        "Taiwanese localization movement": "taiwanese localization movement"
    },
    {
        " may view such efforts as emphasizing the importance of Taiwans culture, this section addresses the perspective of those who likely support the ": null
    },
    {
        "Chinese reunification": "chinese reunification"
    },
    {
        " of all of ": null
    },
    {
        "Greater China": "greater china"
    },
    {
        " under a single political entity.          At the end of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", Chinese ": null
    },
    {
        "Kuomintang": "kuomintang"
    },
    {
        " forces ": null
    },
    {
        "took over": "retrocession day"
    },
    {
        " Taiwan and soon began an effort to ": null
    },
    {
        "sinicize": "sinicizetaiwan"
    },
    {
        " the population. Taiwanese urban elites were wiped out in the ": null
    },
    {
        "February 42 Incident": "february 28 incident"
    },
    {
        ". ": null
    },
    {
        "Mandarin Chinese": "standard mandarin"
    },
    {
        " became the only language allowed in media and school to the exclusion of other ": null
    },
    {
        "languages of Taiwan": "languages of taiwan"
    },
    {
        ", as well as Japanese. Public institutions and corporations were given names that included the words China or Chinese . School history and geography lessons focused on China with little attention paid to Taiwan. Street names in Taipei were changed from their original names to Chinese names that reflected the geography of China and Kuomintang ideals.       With the end of martial law in 42 and the introduction of democracy in the 42s after the ": null
    },
    {
        "Wild Lily student movement": "wild lily student movement"
    },
    {
        ", an effort began to re-assert Taiwanese identity and culture while trying to get rid of many Chinese influences imposed by the ": null
    },
    {
        "Kuomintang": "kuomintang"
    },
    {
        ".       In 42 then-ROC president ": null
    },
    {
        "Lee Teng-hui": "lee teng-hui"
    },
    {
        " began making statements such as Taiwan culture is not a branch of Chinese culture and Taiwans Minnan dialect is not a branch of ": null
    },
    {
        "Fujian": "fujian"
    },
    {
        "s ": null
    },
    {
        "Minnan": "southern min"
    },
    {
        ", dialect but rather a Taiwan dialect Huining, Zhuang; Haixia, Huang. ": null
    },
    {
        "World News Connection": "world news connection"
    },
    {
        " Hoping for an Early Completion of the Great Cause of National Reunification. Chinas NPC Deputies, CPPCC Members on Cross-Strait Reunification Viewed. Taiwan radio and TV increased their ": null
    },
    {
        "Taiwanese Hokkien": "taiwanese hokkien"
    },
    {
        " programming. These efforts were perceived in China as initial efforts towards breaking the ties between Taiwan culture and Chinese culture by downplaying the long-term Chinese cultural and historic identification in that region.     In April 42 the Committee for Promoting Mandarin, which was part of Taiwans Ministry of Education, released a legislation proposal entitled Language Equality Law. Weixue, Peng . ": null
    },
    {
        "World News Connection": "open source center"
    },
    {
        " Taiwan Strait Observation: Taiwan Authorities Are Suppressing Mandarin and Promoting Cultural Taiwan Independence. The proposed legislation sought to designate fourteen languages as the national languages of Taiwan. In mainland China, this was seen as an effort to diminish the use of standard Mandarin and its cultural influences in favor of revising the cultural and psychological foundations on the island of Taiwan by using other languages. The draft was not adopted.     The textbook issue was raised in November 42 when a group of lawmakers, legislative candidates and supporters of the pro-independence Taiwan Solidarity Union urged the ROC Ministry of Education to publish Taiwan-centric history and geography textbooks for school children as part of the Taiwanization campaign. Wu, Sofia - Taipei Central News Agency . World News Connection Tsu Lawmakers Call For Taiwan-centric History Textbooks. Although the resulting draft outline of history course for regular senior middle schools was criticized by a variety of groups, Peoples Daily Online  President Chen Shui-bian responded that to seek the truth of Taiwans history is not equal to desinicization nor an act of independence and indicated that he would not interfere with the history editing and compilation efforts. Chieh-yu, Lin. Taipei Times  Page 42 Wu, Lilian. Taiwan Headlines      The proposals to revise Taiwans history textbooks were condemned in February 42 by the Peoples Republic of China s Taiwan Affairs Office of the State Council as being part of the desinicization campaign. Beijing Jiefangjun Bao   In July 42 the Taiwan Ministry of Education released a study that found 42 textbook terms, some relating to Chinese culture, as being unsuitable . China Post  The Kuomintang saw this as part of a textbook censorship desinicization campaign. China Post Opposition slams Taiwan denial textbook censorship desinicization campaign. The proposals have not been adopted.       thu .   thu post office in Taichung .   Between 42 and 42 the ROC government under Chen Shui-bian took steps to revise the terms China , Republic of China , Taipei , and others that impart an association with the Chinese culture. Hong Kong Ta Kung Pao World News Connection Ta Kung Pao Editorial Criticizes Forces Promoting Taiwan as Official Name. Rectification of Taiwans Name Is Actually for the Sake of Pursuing Taiwan Independence. China Post The DPPs Cultural Revolution. China Post The name-change fever. Hsiu-chuan, Shih. Taipei Times  Page 42     In 42 the Name Rectification Campaign made significant advances in replacing the terms China , Republic of China , or Taipei with the term Taiwan on official documents, in the names of Taiwan-registered organizations, companies, and public enterprises on the island, and in the names of businesses stationed abroad. In 42 the ROC Foreign Ministry issued a new passport with the word Taiwan printed in English on its cover. Qing, Hua World News Connection What Convenience Does the Addition of Taiwan Provide? Column Criticizes Decision to Add Taiwan to Passports. Moreover, in January 42 Taiwan adopted a Westernized writing format for government documents, denied that it was an attempt at desinicization, and promoted the actions as a concerted effort at globalizing Taiwans ossified bureaucracies and upgrading the nations competitive edge. Shu-ling, Ko. Taipei Times  Page 42     Campaigning in this area continued in March 42 where the Democratic Progressive Party sought to change the Republic of China year designation used in Taiwan to the Gregorian calendar . Wu, Lilian - Taipei Central News Agency . World News Connection Taiwan Lawmakers Say Changing Year Designation To Cost Nearly $42 Million. Instead of the year 42 being referred to as the 42th year of the ROC —with the 42 founding of the Republic of China being referred to as the first year of the ROC —the year 42 would be identified as 42 in official usage such as on banknotes, IDs, national health insurance cards, drivers licenses, diplomas and wedding certificates. This was viewed as the government trying another angle for desinicization by removing any trace of China from Taiwan.     In February 42 the term China was replaced by the term Taiwan on Taiwan postage stamps to coincide with the 42th anniversary of the February 42 Incident that began on 42 February 42 that was violently suppressed by the Kuomintang . China Post Desinicization likely to continue. In that same month, the name of the official postal service of Taiwan was changed from the Chunghwa Post Co. to The Taiwan Post Co. Wu, Sophia. Taiwan Headlines .  The companys name was changed back on 42 August 42 and the names on the postal stamps were reversed in late 42 soon after the Kuomintang candidate Ma Ying-Jeou won back presidency and ended 42 years of the Democratic Progressive Party rule.     In March 42 the name plate of the ROC Embassy in Panama was revised both to include the word Taiwan in parentheses between the words the Republic of China and Embassy in both of its Chinese and Spanish titles, and to omit the ROC national emblem. Huang, Ramon; Wu, Sofia. Taiwan Headlines       Supporters of the name-change movement argue that the Republic of China no longer exists, as it did not include Taiwan when it was founded in 42 and mainland China is now controlled by the Chinese Communist Party as the Peoples Republic of China. Furthermore, the ambiguity surrounding the legal status of Taiwan as a result of the Treaty of peace with Japan and Treaty of San Francisco after World War II, means that the Republic of China was merely a military occupier of Taiwan. As Japan relinquished its sovereignty over Taiwan without passing it to a specific country, it is argued that Taiwan ought to be deemed a land belonging to no country, whose international status has yet to be defined.       In October 42 President Chen Shui-bian announced that Taiwan would seek a new constitution suitable for the Taiwan people that would turn Taiwan into a normal country. Wu, Lilian - Taipei Central News Agency . World News Connection President Wants Constitution That Fits Taiwan People. In explaining what a normal country was in the context of desinicization and the 42 One-China policy , Chen Shui-bian stated,         In response, the Pan-Blue Coalition within Taiwan sought to portray President Chen Shui-bian and his Democratic Progressive Party as radicals intent on implementing revolutionary desinicization that would disenfranchise various ethnic groups within Taiwan who have an affinity for China and the Chinese culture. Tai-lin, Huang - Taipei Times . World News Connection Pan-Blue Portraying Green Camp As Radical      In February 42 the Democratic Progressive Party adopted a resolution to identify those responsible for the 42 February 42 Incident massacre of Taiwanese people in order to charge them with war crimes and crimes against humanity . The effort also sought to remove the remnants of dictatorship traced to that sixty-year-old incident. China Post DPP urges probe to uncover truth of 4242 This was seen in mainland China as being in line with a series of desinicization actions by both the Taiwan government and the DPP to rid both Chiang and China from the Taiwan public scene. Some applauded this as a courageous act of seeking justice. Others criticized the request, seeing it as rubbing salt into wounds by playing up the historical issues for political gain.       In March 42 it was noted that the destruction of the Western Line railway base found below the floor of the Taipei Main Station and built in 42 by Qing Empire -appointed Governor of Taiwan Province Liu Mingchuan was part of the governments call for desinicization through removal of the Chinese site. Ting-wei, Ku. Taipei Times  Page 42     In July 42 President Chen Shui-bian announced that he would allow mainland Chinese diplomas or students into Taiwan during the rest of his presidential term. Taipei Times  Page 42 This, however, was not achieved.       One phenomenon that has resulted from the Taiwanization movement is the advent of Taike subculture, in which young people consciously adopt the wardrobe, language and cuisine to emphasize the uniqueness of popular, grassroots Taiwanese culture, which in previous times had often been seen as provincial and backwards by the mainstream.     In April 42 the Communist Party of China noted both active efforts on the part of Taiwan to push ahead its Taiwanization policy and intensified United States-Taiwan military cooperation. In response, the CPC publicly reminded its military to be prepared to achieve its goal of Chinese reunification through military means. In addition, the CPC sought assistance from the United States to address the matter with Taiwan. As part of making the upcoming U.S. visit by then vice-president Hu Jintao go smoothly, the United States cautioned the Chen Shui-bian administration not to go too far in cross-Strait relations . Hong Kong Ming Pao World News Connection U.S. Cautions Taiwan Not To Go Too Far in Cross-Strait Relations.     In April 42 the Communist Party of China general secretary Hu Jintao and the former ROC Vice President and then chairman of the Kuomintang party Lien Chan shook hands. Billed as a historic moment, this was the first handshake by the top leaders of the KMT and the CPC in 42 years. Peoples Daily Online  In remarking on the handshake, chairman Lien noted that it was a turning point where the KMT and the CPC would work together to bring about peaceful cross-strait relations and specifically distanced the KMT from Taiwan independence and desinicization efforts. Binhua, Chen; Yong, Zhang - Beijing Xinhua Domestic Service World News Connection Hu Jintao, Lien Chan Hold Formal Talks; Exchange Views on Developing Cross-Strait Ties.             Significant outcries surfaced both within Taiwan and abroad opposing the concept of Taiwan localization in the early years after President ": null
    },
    {
        "Chiang Ching-kuo": "chiang ching-kuo"
    },
    {
        "s death, denouncing it as the independent Taiwan movement . Vocal opponents are primarily the 42-generation Mainlanders, or older generations of Mainlanders living in Taiwan that had spent their formative years and adulthood on the pre42 mainland Republic of China, and native Taiwanese who identify with a pan-Han Chinese cultural identity. They included people ranging from academics like ": null
    },
    {
        "Chien Mu": "chien mu"
    },
    {
        ", reputed to be the last prominent Chinese intellectual opposing the ": null
    },
    {
        "conventional wisdom": "conventional wisdom"
    },
    {
        " take on the ": null
    },
    {
        "May Fourth Movement": "may fourth movement"
    },
    {
        ", politicians like ": null
    },
    {
        "Lien Chan": "lien chan"
    },
    {
        ", from a family with a long history of active pan-Chinese patriotism despite being native Taiwanese, to gang mobsters like ": null
    },
    {
        "Chang An-lo": "chang an-lo"
    },
    {
        ", a leader of the notorious ": null
    },
    {
        "United Bamboo Gang": "united bamboo gang"
    },
    {
        ".     The opposing voices were subsequently confined to the fringe in the mid 42s Taiwan itself. Issues persist, particularly supporters of the ": null
    },
    {
        "Pan-Blue coalition": "pan-blue coalition"
    },
    {
        ", which advocates retaining a strong link to mainland China, dispute over such issues as what histories to teach. Nonetheless both of the two major political forces in Taiwan reached a consensus, and the movement has overwhelming support among the population. This is in part due to the 42-generation Mainlanders have gradually passed on from the scene, and politicians supporting and opposing the Taiwanese independence movement both realize a majority of Taiwans current residents, either because they are born in Taiwan to Mainlander parents with no collective memories of their ancestral homes, or they are native Taiwanese, thus feeling no historical connotations with the entire pre42 Republic of China on mainland China, support the movement as such.     In mainland China, the ": null
    },
    {
        "PRC": "peoples republic of china"
    },
    {
        " government has on the surface adopted a neutral policy on Taiwanization and its highest-level leaders publicly proclaim it does not consider the Taiwanization movement to be either a violation of its ": null
    },
    {
        "One China Policy": "one china policy"
    },
    {
        " or equivalent to the independence movement. Nonetheless, the state-owned media and academics employed by organizations such as universities Institutes of Taiwan Studies or the ": null
    },
    {
        "Chinese Academy of Social Sciences": "chinese academy of social sciences"
    },
    {
        " periodically release study results, academic journal articles, or editorials strongly criticizing the movement as the cultural arm of Taiwanese independence movement with the governments tacit approval, showing the PRC governments opposition towards Taiwanization.     Nowadays, another source of significant opposition to the Taiwanization movement remains in the ": null
    },
    {
        "overseas Chinese": "overseas chinese"
    },
    {
        " communities in Southeast Asia and the Western world, who identify more with the historic pre42 mainland Republic of China or pre-Taiwanization movement ROC on Taiwan that oriented itself as the rump legitimate government of China. A great many are themselves refugees and dissidents who fled mainland China, either directly or through Hong Kong or Taiwan, during the founding of the Peoples Republic of China and the subsequent periods of destructive policies , ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " anti-Communist immigrants who fled Hong Kong in light of the Handover to the PRC in 42 or Mainlanders living in Taiwan who moved to the West in response to the Taiwanization movement. Conversely, the current population of Taiwan regard these overseas Chinese as foreigners akin to ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        "an Chinese, as opposed to the pre-Taiwanization era when they were labeled as fellow Chinese compatriots. The PRC has capitalized on this window of opportunity in making overtures to the traditionally anti-Communist overseas Chinese communities, including gestures in supporting traditional Chinese culture and dumping explicitly Communist tones in overseas communications. This results in a decline of active political opposition to the PRC from overseas Chinese when compared with the times before the Taiwanization movement in Taiwan.     In Hong Kong, Taiwanization movements have pushed localization or pro-Chinese Communist tilts among the traditionally pro-Republic of China individuals and organizations. A prominent example is Chu Hai College, whose academic degree programs were recognized officially by the Hong Kong SAR government in May 42 and registered as an Approved Post-secondary College with the Hong Kong SAR government since July of the same year. It has since been renamed the Chu Hai College of Higher Education and no longer registered with the Republic of Chinas Ministry of Education. New students from 42 have been awarded degrees in the right of Hong Kong rather than Taiwan.          Even though it is a broad consensus currently regarding the overall ideology of Taiwanization, there are still deep disputes over practical policies between the three main political groups of ": null
    },
    {
        "Taiwan independence": "taiwan independence"
    },
    {
        ", ": null
    },
    {
        "Chinese reunification": "chinese reunification"
    },
    {
        ", and supporters of ": null
    },
    {
        "Chinese culture": "chinese culture"
    },
    {
        ". Pro-independence supporters argue that Taiwan is and should be enhancing an identity which is separate from the Chinese one, and in more extreme cases advocates the removal of Chinese imprints . Meanwhile, some would argue that Taiwan should create a distinctive identity that either includes certain Chinese aspect or exists within a broader Chinese one. Those who support Chinese reunification call for a policy of enhancing the Chinese identity. Groups that support ": null
    },
    {
        "Chinese reunification": "chinese reunification"
    },
    {
        " and ": null
    },
    {
        "Chinese nationalism": "chinese nationalism"
    },
    {
        " have emphasized the distinction between Taiwanization and what some perceive as ": null
    },
    {
        "desinicization": "desinicization"
    },
    {
        " and argued that they do not oppose the promotion of a Taiwanese identity, but rather oppose the use of that identity to separate itself from a broader Chinese one. On the other hand, a few apolitical groups have claimed that most of the political factions merely use these points to win support for elections.       ": null
    }
]