[
    {
        "                      The Taj Mahal  is an ivory-white marble ": null
    },
    {
        "Islamic": "islamic"
    },
    {
        " mausoleum": "mausoleum"
    },
    {
        " on the south bank of the ": null
    },
    {
        "Yamuna": "yamuna"
    },
    {
        " river in the Indian city of ": null
    },
    {
        "Agra": "agra"
    },
    {
        ". It was commissioned in 42 by the ": null
    },
    {
        "Mughal emperor": "mughal empire"
    },
    {
        " Shah Jahan": "shah jahan"
    },
    {
        " to house the ": null
    },
    {
        "tomb": "tomb"
    },
    {
        " of his favourite wife, ": null
    },
    {
        "Mumtaz Mahal": "mumtaz mahal"
    },
    {
        "; it also houses the tomb of Shah Jahan himself. The tomb is the centrepiece of a  complex, which includes a ": null
    },
    {
        "mosque": "mosque"
    },
    {
        " and a guest house, and is set in formal gardens bounded on three sides by a ": null
    },
    {
        "crenellated": "crenellated"
    },
    {
        " wall.     Construction of the mausoleum was essentially completed in 42 but work continued on other phases of the project for another 42 years. The Taj Mahal complex is believed to have been completed in its entirety in 42 at a cost estimated at the time to be around 42  million ": null
    },
    {
        "rupee": "rupee"
    },
    {
        "s, which in 42 would be approximately 42  billion rupees . The construction project employed some 42 artisans under the guidance of a board of architects led by the court architect to the emperor, ": null
    },
    {
        "Ustad Ahmad Lahauri": "ustad ahmad lahauri"
    },
    {
        ".     The Taj Mahal was designated as a ": null
    },
    {
        "UNESCO": "unesco"
    },
    {
        " World Heritage Site": "world heritage site"
    },
    {
        " in 42 for being the jewel of Muslim art in India and one of the universally admired masterpieces of the worlds heritage . It is regarded by many as the best example of ": null
    },
    {
        "Mughal architecture": "mughal architecture"
    },
    {
        " and a symbol of Indias rich history. The Taj Mahal attracts 42–42  million visitors a year and in 42 it was declared a winner of the ": null
    },
    {
        "New42Wonders of the World": "new7wonders of the world"
    },
    {
        " initiative.       The Taj Mahal was commissioned by ": null
    },
    {
        "Shah Jahan": "shah jahan"
    },
    {
        " in 42 to be built in the memory of his wife ": null
    },
    {
        "Mumtaz Mahal": "mumtaz mahal"
    },
    {
        ", who died on 42 June that year, giving birth to their 42th child, ": null
    },
    {
        "Gauhara Begum": "gauhara begum"
    },
    {
        ". Construction started in 42 and the mausoleum was completed in 42 while the surrounding buildings and garden were finished five years later. The imperial court documenting Shah Jahans grief after the death of Mumtaz Mahal illustrates the love story held as the inspiration for the Taj Mahal.             The Taj Mahal incorporates and expands on design traditions of ": null
    },
    {
        "Persian": "persian architecture"
    },
    {
        " and earlier ": null
    },
    {
        "Mughal architecture": "mughal architecture"
    },
    {
        ". Specific inspiration came from successful ": null
    },
    {
        "Timurid": "timurid dynasty"
    },
    {
        " and Mughal buildings including the ": null
    },
    {
        "Gur-e Amir": "gur-e amir"
    },
    {
        " , ": null
    },
    {
        "Humayuns Tomb": "humayuns tomb"
    },
    {
        " which inspired the ": null
    },
    {
        "Charbagh": "charbagh"
    },
    {
        " gardens and ": null
    },
    {
        "hasht-behesht ": "hasht-behesht"
    },
    {
        " plan of the site, ": null
    },
    {
        "Itmad-Ud-Daulahs Tomb": "itmad-ud-daulahs tomb"
    },
    {
        " , and Shah Jahans own ": null
    },
    {
        "Jama Masjid": "jama masjid, delhi"
    },
    {
        " in ": null
    },
    {
        "Delhi": "delhi"
    },
    {
        ". While earlier Mughal buildings were primarily constructed of red ": null
    },
    {
        "sandstone": "sandstone"
    },
    {
        ", Shah Jahan promoted the use of white marble inlaid with ": null
    },
    {
        "semi-precious stones": "semi-precious stones"
    },
    {
        ". Buildings under his patronage reached new levels of refinement.         The tomb is the central focus of the entire complex of the Taj Mahal. It is a large, white marble structure standing on a square ": null
    },
    {
        "plinth": "plinth"
    },
    {
        " and consists of a symmetrical building with an  iwan  topped by a large dome and ": null
    },
    {
        "finial": "finial"
    },
    {
        ". Like most Mughal tombs, the basic elements are Persian in origin.     The base structure is a large multi-chambered cube with ": null
    },
    {
        "chamfer": "chamfer"
    },
    {
        "ed corners forming an unequal eight-sided structure that is approximately  on each of the four long sides. Each side of the iwan is framed with a huge  pishtaq  or vaulted archway with two similarly shaped arched balconies stacked on either side. This motif of stacked pishtaqs is replicated on the chamfered corner areas, making the design completely symmetrical on all sides of the building. Four minarets frame the tomb, one at each corner of the plinth facing the chamfered corners. The main chamber houses the false ": null
    },
    {
        "sarcophagi": "sarcophagi"
    },
    {
        " of Mumtaz Mahal and Shah Jahan; the actual graves are at a lower level.          The most spectacular feature is the marble dome that surmounts the tomb. The dome is nearly  high which is close in measurement to the length of the base, and accentuated by the cylindrical drum it sits on which is approximately  high. Because of its shape, the dome is often called an ": null
    },
    {
        "onion dome": "onion dome"
    },
    {
        " or amrud . The top is decorated with a ": null
    },
    {
        "lotus": "nelumbo nucifera"
    },
    {
        " design which also serves to accentuate its height. The shape of the dome is emphasised by four smaller domed  chattris  placed at its corners, which replicate the onion shape of the main dome. The dome is slightly asymmetrical. Their columned bases open through the roof of the tomb and provide light to the interior. Tall decorative spires  extend from edges of base walls, and provide visual emphasis to the height of the dome. The ": null
    },
    {
        "lotus": "nelumbo nucifera"
    },
    {
        " motif is repeated on both the chattris and guldastas. The dome and chattris are topped by a gilded ": null
    },
    {
        "finial": "finial"
    },
    {
        " which mixes traditional Persian and Hindustani decorative elements.     The main finial was originally made of gold but was replaced by a copy made of gilded ": null
    },
    {
        "bronze": "bronze"
    },
    {
        " in the early 42th century. This feature provides a clear example of integration of traditional Persian and Hindu decorative elements. The finial is topped by a ": null
    },
    {
        "moon": "moon"
    },
    {
        ", a typical ": null
    },
    {
        "Islamic motif": "crescentpre-islamic and islamic uses"
    },
    {
        " whose horns point ": null
    },
    {
        "heaven": "heaven"
    },
    {
        "ward.     The minarets, which are each more than  tall, display the designers penchant for symmetry. They were designed as working minarets— a traditional element of mosques, used by the ": null
    },
    {
        "muezzin": "muezzin"
    },
    {
        " to call the Islamic faithful to prayer. Each minaret is effectively divided into three equal parts by two working balconies that ring the tower. At the top of the tower is a final balcony surmounted by a ": null
    },
    {
        "chattri": "chattri"
    },
    {
        " that mirrors the design of those on the tomb. The chattris all share the same decorative elements of a lotus design topped by a gilded finial. The minarets were constructed slightly outside of the plinth so that in the event of collapse, a typical occurrence with many tall constructions of the period, the material from the towers would tend to fall away from the tomb.       The exterior decorations of the Taj Mahal are among the finest in Mughal architecture. As the surface area changes, the decorations are refined proportionally. The decorative elements were created by applying paint, ": null
    },
    {
        "stucco": "stucco"
    },
    {
        ", stone inlays or carvings. In line with the Islamic prohibition against the use of anthropomorphic forms, the decorative elements can be grouped into either ": null
    },
    {
        "calligraphy": "calligraphy"
    },
    {
        ", abstract forms or vegetative motifs.   Throughout the complex are ": null
    },
    {
        "passages": "sura"
    },
    {
        " from the ": null
    },
    {
        "Quran": "quran"
    },
    {
        " that comprise some of the decorative elements. Recent scholarship suggests that Amanat Khan chose the passages.     The calligraphy on the Great Gate reads  O Soul, thou art at rest. Return to the Lord at peace with Him, and He at peace with you.  The calligraphy was created in 42 by a calligrapher named ": null
    },
    {
        "Abdul Haq": "abdul haq"
    },
    {
        ". Shah Jahan conferred the title of Amanat Khan upon him as a reward for his dazzling virtuosity.  Near the lines from the Quran at the base of the interior dome is the inscription, Written by the insignificant being, Amanat Khan Shirazi.  Much of the calligraphy is composed of florid ": null
    },
    {
        "thuluth": "thuluth"
    },
    {
        " script made of ": null
    },
    {
        "jasper": "jasper"
    },
    {
        " or black marble inlaid in white marble panels. Higher panels are written in slightly larger script to reduce the skewing effect when viewed from below. The calligraphy found on the marble ": null
    },
    {
        "cenotaph": "cenotaph"
    },
    {
        "s in the tomb is particularly detailed and delicate.     Abstract forms are used throughout, especially in the plinth, minarets, gateway, mosque, jawab and, to a lesser extent, on the surfaces of the tomb. The domes and vaults of the sandstone buildings are worked with ": null
    },
    {
        "tracery": "tracery"
    },
    {
        " of ": null
    },
    {
        "incised painting": "incised painting"
    },
    {
        " to create elaborate geometric forms. ": null
    },
    {
        "Herringbone": "opus spicatum"
    },
    {
        " inlays define the space between many of the adjoining elements. White inlays are used in sandstone buildings, and dark or black inlays on the white marbles. Mortared areas of the marble buildings have been stained or painted in a contrasting colour which creates a complex array of geometric patterns. Floors and walkways use contrasting ": null
    },
    {
        "tile": "tile"
    },
    {
        "s or blocks in ": null
    },
    {
        "tessellation": "tessellation"
    },
    {
        " patterns.     On the lower walls of the tomb are white marble ": null
    },
    {
        "dados": "dado"
    },
    {
        " sculpted with realistic ": null
    },
    {
        "bas relief": "bas relief"
    },
    {
        " depictions of flowers and vines. The marble has been polished to emphasise the exquisite detailing of the carvings. The dado frames and archway ": null
    },
    {
        "spandrel": "spandrel"
    },
    {
        "s have been decorated with ": null
    },
    {
        "pietra dura": "pietra dura"
    },
    {
        " inlays of highly stylised, almost geometric vines, flowers and fruits. The inlay stones are of yellow marble, jasper and jade, polished and levelled to the surface of the walls.          The interior chamber of the Taj Mahal reaches far beyond traditional decorative elements. The inlay work is not pietra dura, but a ": null
    },
    {
        "lapidary": "lapidary"
    },
    {
        " of precious and semiprecious ": null
    },
    {
        "gemstone": "gemstone"
    },
    {
        "s. The inner chamber is an octagon with the design allowing for entry from each face, although only the door facing the garden to the south is used. The interior walls are about  high and are topped by a false interior dome decorated with a sun motif. Eight pishtaq arches define the space at ground level and, as with the exterior, each lower pishtaq is crowned by a second pishtaq about midway up the wall. The four central upper arches form balconies or viewing areas, and each balconys exterior window has an intricate screen or  jali  cut from marble. In addition to the light from the balcony screens, light enters through roof openings covered by chattris at the corners. The octagonal marble screen or jali bordering the cenotaphs is made from eight marble panels carved through with intricate pierce work. The remaining surfaces are inlaid in delicate detail with semi-precious stones forming twining vines, fruits and flowers. Each chamber wall is highly decorated with dado bas-relief, intricate lapidary inlay and refined calligraphy panels which reflect, in little detail, the design elements seen throughout the exterior of the complex.        Muslim tradition forbids elaborate decoration of graves. Hence, the bodies of Mumtaz and Shah Jahan were put in a relatively plain crypt beneath the inner chamber with their faces turned right, towards ": null
    },
    {
        "Mecca": "mecca"
    },
    {
        ". Mumtaz Mahals ": null
    },
    {
        "cenotaph": "cenotaph"
    },
    {
        " is placed at the precise centre of the inner chamber on a rectangular marble base of . Both the base and ": null
    },
    {
        "casket": "casket"
    },
    {
        " are elaborately inlaid with precious and semiprecious gems. Calligraphic inscriptions on the casket identify and praise Mumtaz. On the lid of the casket is a raised rectangular lozenge meant to suggest a writing tablet. Shah Jahans cenotaph is beside Mumtazs to the western side and is the only visible asymmetric element in the entire complex. His cenotaph is bigger than his wifes, but reflects the same elements: a larger casket on a slightly taller base precisely decorated with lapidary and calligraphy that identifies him. On the lid of the casket is a traditional sculpture of a small pen box.     The pen box and writing tablet are traditional Mughal ": null
    },
    {
        "funerary": "funerary"
    },
    {
        " icons decorating the caskets of men and women respectively. ": null
    },
    {
        "The Ninety Nine Names of God": "names of god in the quran"
    },
    {
        " are calligraphic inscriptions on the sides of the actual tomb of Mumtaz Mahal. Other inscriptions inside the crypt include,  O Noble, O Magnificent, O Majestic, O Unique, O Eternal, O Glorious... . The tomb of Shah Jahan bears a calligraphic inscription that reads; He travelled from this world to the banquet-hall of Eternity on the night of the twenty-sixth of the month of ": null
    },
    {
        "Rajab": "rajab"
    },
    {
        ", in the year 42 ": null
    },
    {
        "Hijri": "islamic calendar"
    },
    {
        ".           The complex is set around a large  square  charbagh  or ": null
    },
    {
        "Mughal garden": "mughal gardens"
    },
    {
        ".   The garden uses raised pathways that divide each of the four-quarters of the garden into 42 sunken ": null
    },
    {
        "parterre": "parterre"
    },
    {
        "s or flowerbeds. Halfway between the tomb and gateway in the centre of the garden is a raised marble water tank with a ": null
    },
    {
        "reflecting pool": "reflecting pool"
    },
    {
        " positioned on a north-south axis to reflect the image of the mausoleum. The elevated marble water tank is called al Hawd al-Kawthar in reference to the Tank of Abundance promised to ": null
    },
    {
        "Muhammad": "muhammad"
    },
    {
        ".     Elsewhere, the garden is laid out with avenues of trees labeled according to common and scientific names and ": null
    },
    {
        "fountain": "fountain"
    },
    {
        "s. The ": null
    },
    {
        "charbagh garden": "charbagh garden"
    },
    {
        ", a design inspired by ": null
    },
    {
        "Persian gardens": "persian gardens"
    },
    {
        ", was introduced to India by ": null
    },
    {
        "Babur": "babur"
    },
    {
        ", the first Mughal emperor. It symbolises the four flowing rivers of ": null
    },
    {
        "Jannah": "jannah"
    },
    {
        " and reflects the ": null
    },
    {
        "Paradise garden": "paradise garden"
    },
    {
        " derived from the Persian paridaeza, meaning walled garden. In ": null
    },
    {
        "mystic": "persian mysticism"
    },
    {
        " Islamic texts of the Mughal period, Paradise is described as an ideal garden of abundance with four rivers flowing from a central spring or mountain, separating the garden into north, west, south and east.     Most Mughal charbaghs are rectangular with a tomb or ": null
    },
    {
        "pavilion": "pavilion"
    },
    {
        " in the centre. The Taj Mahal garden is unusual in that the main element, the tomb, is located at the end of the garden. With the discovery of ": null
    },
    {
        "Mahtab Bagh": "mahtab bagh"
    },
    {
        " or Moonlight Garden on the other side of the Yamuna, the interpretation of the ": null
    },
    {
        "Archaeological Survey of India": "archaeological survey of india"
    },
    {
        " is that the Yamuna river itself was incorporated into the gardens design and was meant to be seen as one of the rivers of Paradise. Similarities in layout and architectural features with ": null
    },
    {
        "the Shalimar Gardens": "shalimar gardens"
    },
    {
        " suggests both gardens may have been designed by the same architect, Ali Mardan. Early accounts of the garden describe its profusion of vegetation, including abundant ": null
    },
    {
        "rose": "rose"
    },
    {
        "s, ": null
    },
    {
        "daffodil": "daffodil"
    },
    {
        "s, and ": null
    },
    {
        "fruit tree": "fruit tree"
    },
    {
        "s. As the Mughal Empire declined, the Taj Mahal and its gardens also declined. By the end of the 42th century, the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        " controlled more than three-fifths of India, and assumed management of the Taj Mahal. They changed the landscaping to their liking which more closely resembled the formal lawns of London.          The Taj Mahal complex is bordered on three sides by ": null
    },
    {
        "crenellated": "crenellation"
    },
    {
        " red sandstone walls; the side facing the river is open. Outside the walls are several additional mausoleums, including those of Shah Jahans other ": null
    },
    {
        "wives": "wives"
    },
    {
        ", and a larger tomb for Mumtazs favourite servant.     The main gateway  is a monumental structure built primarily of marble, and reminiscent of the Mughal architecture of earlier emperors. Its archways mirror the shape of the tombs archways, and its pishtaq arches incorporate the calligraphy that decorates the tomb. The vaulted ceilings and walls have elaborate geometric designs like those found in the other sandstone buildings in the complex.     At the far end of the complex are two grand red sandstone buildings that mirror each other, and face the sides of the tomb. The backs of the buildings parallel the western and eastern walls. The western building is a mosque and the other is the jawab , thought to have been constructed for architectural balance although it may have been used as a guesthouse. Distinctions between the two buildings include the jawabs lack of a  mihrab  , and its floors of geometric design whereas the floor of the mosque is laid with outlines of 42 prayer rugs in black marble. The mosques basic design of a long hall surmounted by three domes is similar to others built by Shah Jahan, particularly the Masjid-i Jahān-Numā, or ": null
    },
    {
        "Jama Masjid, Delhi": "jama masjid, delhi"
    },
    {
        ". The Mughal mosques of this period divide the ": null
    },
    {
        "sanctuary": "sanctuary"
    },
    {
        " hall into three areas comprising a main sanctuary and slightly smaller sanctuaries on either side. At the Taj Mahal, each sanctuary opens onto an expansive vaulting dome. The outlying buildings were completed in 42            The Taj Mahal is built on a parcel of land to the south of the walled city of Agra. Shah Jahan presented Maharajah Jai Singh with a large palace in the centre of Agra in exchange for the land. An area of roughly  was excavated, filled with dirt to reduce seepage, and levelled at  above riverbank. In the tomb area, wells were dug and filled with stone and rubble to form the ": null
    },
    {
        "footings": "foundation"
    },
    {
        " of the tomb. Instead of lashed ": null
    },
    {
        "bamboo": "bamboo"
    },
    {
        ", workmen constructed a colossal brick scaffold that mirrored the tomb. The scaffold was so enormous that foremen estimated it would take years to dismantle.     The Taj Mahal was constructed using materials from all over India and Asia. It is believed over 42 elephants were used to transport building materials. It took the efforts of 42 labourers, painters, embroidery artists and stonecutters to shape the Taj Mahal.  The translucent white marble was brought from ": null
    },
    {
        "Makrana": "makrana"
    },
    {
        ", Rajasthan, the jasper from ": null
    },
    {
        "Punjab": "punjab region"
    },
    {
        ", ": null
    },
    {
        "jade": "jade"
    },
    {
        " and ": null
    },
    {
        "crystal": "crystal"
    },
    {
        " from China. The ": null
    },
    {
        "turquoise": "turquoise"
    },
    {
        " was from ": null
    },
    {
        "Tibet": "tibet"
    },
    {
        " and the ": null
    },
    {
        "Lapis lazuli": "lapis lazuli"
    },
    {
        " from ": null
    },
    {
        "Afghanistan": "afghanistan"
    },
    {
        ", while the ": null
    },
    {
        "sapphire": "sapphire"
    },
    {
        " came from ": null
    },
    {
        "Sri Lanka": "sri lanka"
    },
    {
        " and the ": null
    },
    {
        "carnelian": "carnelian"
    },
    {
        " from ": null
    },
    {
        "Arabia": "arabia"
    },
    {
        ". In all, twenty-eight types of precious and semi-precious stones were inlaid into the white marble.     According to the legend, Shah Jahan decreed that anyone could keep the bricks taken from the scaffold, and thus it was dismantled by peasants overnight.  A 42-kilometre tamped-earth ramp was built to transport marble and materials to the construction site and teams of twenty or thirty oxen pulled the blocks on specially constructed wagons. An elaborate ": null
    },
    {
        "post-and-beam": "post-and-beam"
    },
    {
        " pulley system was used to raise the blocks into desired position. Water was drawn from the river by a series of purs, an animal-powered rope and bucket mechanism, into a large storage tank and raised to a large distribution tank. It was passed into three subsidiary tanks, from which it was piped to the complex.     The plinth and tomb took roughly 42 years to complete. The remaining parts of the complex took an additional 42 years and were completed in order of minarets, mosque and jawab, and gateway. Since the complex was built in stages, discrepancies exist in completion dates due to differing opinions on completion . Construction of the mausoleum itself was essentially completed by 42 while work on the outlying buildings continued for years. Estimates of the cost of construction vary due to difficulties in estimating costs across time. The total cost at the time has been estimated to be about 42 million Indian rupees, which is around 42  billion Indian rupees based on 42 values.       Abdul Hamid Lahauri in his book  Badshahnama  refers to Taj Mahal as  rauza -i munawwara , meaning the illumined or illustrious tomb.   Soon after the Taj Mahals completion, Shah Jahan was deposed by his son ": null
    },
    {
        "Aurangzeb": "aurangzeb"
    },
    {
        " and put under house arrest at nearby ": null
    },
    {
        "Agra Fort": "agra fort"
    },
    {
        ". Upon Shah Jahans death, Aurangzeb buried him in the mausoleum next to his wife. In the 42th century, the ": null
    },
    {
        "Jat": "jat"
    },
    {
        " rulers of ": null
    },
    {
        "Bharatpur": "bharatpur state"
    },
    {
        " invaded Agra and attacked the Taj Mahal, the two chandeliers, one of agate and another of silver, which were hung over the main cenotaph, were taken away by them, along with the gold and silver screen. Kanbo, a Mughal historian, said the gold shield which covered the  finial at the top of the main dome was also removed during the Jat despoliation.     By the late 42th century, parts of the buildings had fallen into disrepair. During the time of the ": null
    },
    {
        "Indian Rebellion of 42": "indian rebellion of 1857"
    },
    {
        ", the Taj Mahal was defaced by British soldiers and government officials, who chiselled out precious stones and ": null
    },
    {
        "lapis lazuli": "lapis lazuli"
    },
    {
        " from its walls. At the end of the 42th century, British ": null
    },
    {
        "viceroy": "viceroy"
    },
    {
        " Lord Curzon": "george curzon, 1st marquess curzon of kedleston"
    },
    {
        " ordered a sweeping restoration project, which was completed in 42 He also commissioned the large lamp in the interior chamber, modelled after one in a ": null
    },
    {
        "Cairo": "cairo"
    },
    {
        " mosque. During this time the garden was remodelled with British-style lawns that are still in place today.          In 42 the government erected scaffolding to disguise the building in anticipation of air attacks by the ": null
    },
    {
        "Japanese Air Force": "imperial japanese navy air service"
    },
    {
        ". During the ": null
    },
    {
        "India-Pakistan wars": "india-pakistan wars"
    },
    {
        " of 42 and 42 ": null
    },
    {
        "scaffolding": "scaffolding"
    },
    {
        " was again erected to mislead bomber pilots.     More recent threats have come from ": null
    },
    {
        "environmental pollution": "environmental pollution"
    },
    {
        " on the banks of the ": null
    },
    {
        "Yamuna River": "yamuna river"
    },
    {
        " including ": null
    },
    {
        "acid rain": "acid rain"
    },
    {
        " due to the ": null
    },
    {
        "Mathura Oil Refinery": "mathura refinery"
    },
    {
        ", which was opposed by ": null
    },
    {
        "Supreme Court of India": "supreme court of india"
    },
    {
        " directives. The pollution has been turning the Taj Mahal yellow-brown. To help control the pollution, the Indian government has set up the ": null
    },
    {
        "Taj Trapezium Zone": "taj trapezium zone"
    },
    {
        " , a  area around the monument where strict emissions standards are in place.     Concerns for the tombs structural integrity have recently been raised because of a decline in the groundwater level in the ": null
    },
    {
        "Yamuna river": "yamuna river"
    },
    {
        " basin which is falling at a rate of around  per year. In 42 cracks appeared in parts of the tomb, and the minarets which surround the monument were showing signs of tilting, as the wooden foundation of the tomb may be rotting due to lack of water. It has been pointed out by politicians, however, that the minarets are designed to tilt slightly outwards to prevent them from crashing on top of the tomb in the event of an earthquake. In 42 it was reported that some predictions indicated that the tomb could collapse within five years.     Small minarets located at two of the outlying buildings were reported as damaged by a storm on April 42 42          The Taj Mahal attracts a large number of tourists. UNESCO documented more than 42 million visitors in 42 which had increased to about 42–42  million in 42 A two-tier pricing system is in place, with a significantly lower entrance fee for Indian citizens and a more expensive one for foreigners. In 42 the fee for Indian citizens was 42 ": null
    },
    {
        "INR": "indian rupee"
    },
    {
        ", for foreign tourists 42 INR. Most tourists visit in the cooler months of October, November and February. Polluting traffic is not allowed near the complex and tourists must either walk from parking areas or catch an electric bus. The Khawasspuras are currently being restored for use as a new visitor centre.     The small town to the south of the Taj, known as Taj Ganji or Mumtazabad, was initially constructed with ": null
    },
    {
        "caravanserais": "caravanserais"
    },
    {
        ", ": null
    },
    {
        "bazaar": "bazaar"
    },
    {
        "s and markets to serve the needs of visitors and workers. Lists of recommended travel destinations often feature the Taj Mahal, which also appears in several listings of ": null
    },
    {
        "seven wonders": "seven wonders of the world"
    },
    {
        " of the modern world, including the recently announced ": null
    },
    {
        "New Seven Wonders of the World": "new seven wonders of the world"
    },
    {
        ", a recent poll with 42 million votes.     The grounds are open from 42:42 to 42:42 weekdays, except for Friday when the complex is open for prayers at the mosque between 42:42 and 42:42 The complex is open for night viewing on the day of the full moon and two days before and after, excluding Fridays and the month of ": null
    },
    {
        "Ramadan": "ramadan"
    },
    {
        ".              Ever since its construction, the building has been the source of an admiration transcending culture and geography, and so personal and emotional responses have consistently eclipsed scholastic appraisals of the monument. A longstanding myth holds that Shah Jahan planned a ": null
    },
    {
        "mausoleum": "mausoleum"
    },
    {
        " to be built in black marble as a ": null
    },
    {
        "Black Taj Mahal": "black taj mahal"
    },
    {
        " across the Yamuna river. The idea originates from fanciful writings of ": null
    },
    {
        "Jean-Baptiste Tavernier": "jean-baptiste tavernier"
    },
    {
        ", a European traveller who visited Agra in 42 It was suggested that his son Aurangzeb overthrew Shah Jahan before it could be built. Ruins of blackened marble across the river in Moonlight Garden, Mahtab Bagh, seemed to support this legend. However, excavations carried out in the 42s found that they were discoloured white stones that had turned black. A more credible theory for the origins of the black mausoleum was demonstrated in 42 by archaeologists who reconstructed part of the pool in the Moonlight Garden. A dark reflection of the white mausoleum could clearly be seen, befitting Shah Jahans obsession with symmetry and the positioning of the pool itself.     No evidence exists for claims that describe, often in horrific detail, the deaths, dismemberments and mutilations which Shah Jahan supposedly inflicted on various architects and craftsmen associated with the tomb. Some stories claim that those involved in construction signed contracts committing themselves to have no part in any similar design. Similar claims are made for many famous buildings. No evidence exists for claims that ": null
    },
    {
        "Lord William Bentinck": "lord william bentinck"
    },
    {
        ", governor-general of India in the 42s, supposedly planned to demolish the Taj Mahal and auction off the marble. Bentincks biographer John Rosselli says that the story arose from Bentincks fund-raising sale of discarded marble from Agra Fort.     Another myth suggests that beating the silhouette of the finial will cause water to come forth. To this day, officials find broken ": null
    },
    {
        "bangle": "bangle"
    },
    {
        "s surrounding the silhouette.     In 42 Indias Supreme Court dismissed ": null
    },
    {
        "P. N. Oak": "purushottam nagesh oak"
    },
    {
        "s petition Writ Petition 42 of 42 P.N. OAK vs. U.O.I. & Ors. to declare that a Hindu king built the Taj Mahal. In 42 a similar petition was dismissed by the ": null
    },
    {
        "Allahabad High Court": "allahabad high court"
    },
    {
        ". This case was brought by Amar Nath Mishra, a social worker and preacher who says that the Taj Mahal was built by the Hindu King ": null
    },
    {
        "Parmar Dev": "paramardi"
    },
    {
        " in 42     A theory that the Taj Mahal was designed by an Italian, Geronimo Vereneo, held sway for a brief period after it was first promoted by Henry George Keene in 42 who went by a translation of a Spanish work Itinerario, . Another theory that a Frenchman, Austin of Bordeaux designed the Taj was promoted by ": null
    },
    {
        "William Henry Sleeman": "william henry sleeman"
    },
    {
        " based on the work of ": null
    },
    {
        "Jean-Baptiste Tavernier": "jean-baptiste tavernier"
    },
    {
        ". These ideas were revived by Father Hosten and discussed again by E.B. Havell and served as the basis for subsequent theories and controversies.       As of 42 several court cases about Taj Mahal being a Hindu temple have been inspired by P. N. Oaks theory. In August 42 ": null
    },
    {
        "Archaeological Survey of India": "archaeological survey of india"
    },
    {
        " stated there was no evidence to suggest the monument ever housed a temple. ": null
    },
    {
        "Bharatiya Janata Party": "bharatiya janata party"
    },
    {
        "s ": null
    },
    {
        "Vinay Katiyar": "vinay katiyar"
    },
    {
        " in 42 claimed that the 42th century monument was built by Mughal emperor Shah Jahan after destroying a Hindu temple called Tejo Mahalaya and it housed a ": null
    },
    {
        "Shiva linga": "lingam"
    },
    {
        ". This claim had also been made by another BJP member ": null
    },
    {
        "Laxmikant Bajpai": "laxmikant bajpai"
    },
    {
        " in 42 The BJP governments union minister of culture ": null
    },
    {
        "Mahesh Sharma": "mahesh sharma"
    },
    {
        " stated in November 42 during a session of the parliament, that there was no evidence that it was a temple. The theories about Taj Mahal being a Shiva temple started circulating when Oak released his 42 book Taj Mahal: The True Story . He claimed it was built in 42 AD and not in the 42th century, as stated by the ASI.  ": null
    },
    {
        "Samajwadi Party": "samajwadi party"
    },
    {
        " leader ": null
    },
    {
        "Azam Khan": "azam khan"
    },
    {
        " stated Taj might be destroyed like ": null
    },
    {
        "Babri Masjid": "babri masjid"
    },
    {
        " as people believed there was a temple there.  Katiyar called for the demolition of the Taj and its replacement by a temple in February 42 In response ": null
    },
    {
        "Indian National Congress": "indian national congress"
    },
    {
        " MP ": null
    },
    {
        "Shashi Tharoor": "shashi tharoor"
    },
    {
        " called him a troglodyte.      A controversy was created in 42 when the Uttar Pradesh government did not include it in its official tourism booklet Uttar Pradesh Tourism - Unlimited Possibilities . The chief minister ": null
    },
    {
        "Yogi Adityanath": "yogi adityanath"
    },
    {
        " had earlier claimed it does not represent Indian culture.  Amidst this controversy, BJP MLA ": null
    },
    {
        "Sangeet Som": "sangeet som"
    },
    {
        " had claimed that the those who built the Taj Mahal were traitors and it was a blot on the countrys culture. He claimed it was built by a man who jailed his own father and wished to kill Hindus. BJP MP ": null
    },
    {
        "Anshul Verma": "anshul verma"
    },
    {
        " supported his comments. ": null
    },
    {
        "AIMIM": "aimim"
    },
    {
        " MP ": null
    },
    {
        "Asaduddin Owaisi": "asaduddin owaisi"
    },
    {
        ", ": null
    },
    {
        "Jammu & Kashmir National Conference": "jammu  &  kashmir national conference"
    },
    {
        " leader ": null
    },
    {
        "Omar Abdullah": "omar abdullah"
    },
    {
        "  and Azam Khan criticised him. CM Adityanath stated Soms comments were personal and the government will focus on the tourism potential of every monument. ": null
    }
]