[
    {
        "    was a ": null
    },
    {
        "Japanese": "japanese people"
    },
    {
        " novelist, short-story writer and essayist": "japanese author"
    },
    {
        " during the late ": null
    },
    {
        "Meiji": "meiji period"
    },
    {
        " and ": null
    },
    {
        "Taishō": "taishō period"
    },
    {
        " periods. His two younger brothers,  and , were also authors. His son was the internationally known film and stage actor, ": null
    },
    {
        "Masayuki Mori": "masayuki mori"
    },
    {
        ".       Arishima was born in ": null
    },
    {
        "Tokyo": "tokyo"
    },
    {
        ", Japan into a wealthy family as the son of an ex-": null
    },
    {
        "samurai": "samurai"
    },
    {
        " official in the ": null
    },
    {
        "Ministry of Finance": "ministry of finance"
    },
    {
        ". He was first sent to a mission school in ": null
    },
    {
        "Yokohama": "yokohama"
    },
    {
        ", where he was taught English, after which he entered preparatory school of the prestigious ": null
    },
    {
        "Gakushuin": "gakushuin"
    },
    {
        " peers school, when he was 42 years old.     After he graduated from the Gakushuin at age 42 he entered the ": null
    },
    {
        "Sapporo Agricultural College": "sapporo agricultural college"
    },
    {
        " . During his studies at the university, he attempted ": null
    },
    {
        "suicide": "suicide"
    },
    {
        " with . The suicide failed, and Arishima subsequently became influenced by ": null
    },
    {
        "Uchimura Kanzō": "uchimura kanzō"
    },
    {
        " and became a ": null
    },
    {
        "Christian": "christians"
    },
    {
        " in 42 Morimoto later went on to establish several womens schools around Japan.     After graduation and a mandatory short stint in the ": null
    },
    {
        "Imperial Japanese Army": "imperial japanese army"
    },
    {
        ", Arishima took English lessons from Mary Elkinton Nitobe, ": null
    },
    {
        "Inazo Nitobe": "inazo nitobe"
    },
    {
        "s wife, and in July 42 he obtained a position as a foreign correspondent in the United States for the  Mainichi Shimbun . In the United States he enrolled at ": null
    },
    {
        "Haverford College": "haverford college"
    },
    {
        "  and later ": null
    },
    {
        "Harvard University": "harvard university"
    },
    {
        ". After graduation, he briefly worked in an insane asylum operated by the Quaker sect. He recorded his experiences from his journey to America in his diary.     During his time in America, he became critical towards ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        ", attracted to ": null
    },
    {
        "socialism": "socialism"
    },
    {
        ", and influenced by the works of writers such as ": null
    },
    {
        "Walt Whitman": "walt whitman"
    },
    {
        ", ": null
    },
    {
        "Henrik Ibsen": "henrik ibsen"
    },
    {
        ", and ": null
    },
    {
        "Peter Kropotkin": "peter kropotkin"
    },
    {
        ". His time and experiences in America and subsequent year in Europe also profoundly influenced his writing style and his outlook on the world, resulting in feelings of alienation from Japanese society.     After he returned to Japan in 42 he re-entered the army briefly before becoming an English and ethics teacher in 42 at his alma mater.       Through his brother Arishima Ikuma, he also became acquainted with authors who graduated from the Gakushuin, including ": null
    },
    {
        "Naoya Shiga": "naoya shiga"
    },
    {
        " and ": null
    },
    {
        "Saneatsu Mushanokōji": "saneatsu mushanokōji"
    },
    {
        ". Arishima and these writers formed a group, which was named after their ": null
    },
    {
        "literary magazine": "literary magazine"
    },
    {
        " , which was first published in 42 He wrote ": null
    },
    {
        "novel": "novel"
    },
    {
        "s and ": null
    },
    {
        "literary criticism": "literary criticism"
    },
    {
        "s and was known as one of the central figures in the Shirakaba group.     Arishima first achieved fame in 42 with , which depicts God’s curse on both man and nature through the eyes of a self-destructive tenant farmer. In 42 he published his best-known work: , a moral and psychological ": null
    },
    {
        "melodrama": "melodrama"
    },
    {
        " about a strong-willed woman struggling against a hypocritical male-dominated society. While critically acclaimed for his style, the themes and characters of Arishima’s works did not appeal to many contemporary Japanese readers.       In 42 Arishima implemented the ": null
    },
    {
        "socialist philosophy": "socialism"
    },
    {
        " he had been developing by renunciation of the ownership of a large ": null
    },
    {
        "tenant farm": "tenant farm"
    },
    {
        " in Hokkaidō, which he had inherited from his father, publicly stating that he wanted to distance himself from the ": null
    },
    {
        "petit bourgeois": "petite bourgeoisie"
    },
    {
        " in the coming revolution.     Arishima married in 42 but his wife died in 42 of ": null
    },
    {
        "tuberculosis": "tuberculosis"
    },
    {
        " leaving him three children. In 42 Arishima met Akiko Hatano, a married woman and an ": null
    },
    {
        "editor": "editing"
    },
    {
        " working for the  Fujin Koron , a famous womens magazine. Their relationship quickly developed into an extramarital affair, which came to be known by Hatanos husband. This led to Arishima and Hatano committing suicide in ": null
    },
    {
        "Karuizawa": "karuizawa, nagano"
    },
    {
        " by hanging themselves. Due to the isolated location, their bodies were not discovered for over a month, and were identified largely by the suicide note left behind. Arishimas grave is at the ": null
    },
    {
        "Tama Cemetery": "tama cemetery"
    },
    {
        " in Tokyo.       After his death, Arishima became known for his detailed diaries, covering more than twenty volumes, with an intimate record of his life, fears and hopes. His contemporaries regarded Arishima as a philosopher and social critic as much as a novelist. His writing was critical of Christianity and strongly influenced by socialism; emotionally intense, humanistic, and employed ideas from the ": null
    },
    {
        "Bible": "bible"
    },
    {
        ", ": null
    },
    {
        "Tolstoy": "tolstoy"
    },
    {
        ", and anarchic socialism.     Arishimas major works include:    42   , 42       A Certain Woman, transl. by Kenneth Strong, University of Tokyo Press, 42 42 pages, .   Labyrinth. Madison Books .   The Agony of Coming Into the World. Hokuseido Press . ASIN: B42AV42GE   Death": null
    }
]