[
    {
        "Tallage or talliage  may have signified at first any ": null
    },
    {
        "tax": "tax"
    },
    {
        ", but became in England and France a land use or land tenure tax. Later in ": null
    },
    {
        "England": "england"
    },
    {
        " it was further limited to assessments by the crown upon ": null
    },
    {
        "cities": "city"
    },
    {
        ", ": null
    },
    {
        "borough": "borough"
    },
    {
        "s, and ": null
    },
    {
        "royal": "monarchy"
    },
    {
        " domains. In effect, tallage was a ": null
    },
    {
        "land tax": "land tax"
    },
    {
        ".       Land taxes were not unknown in England, as the Anglo-Saxon kings had periodically levied a ": null
    },
    {
        "Danegeld": "danegeld"
    },
    {
        " on that basis, but tallage was brought to England by the ": null
    },
    {
        "Normans": "normans"
    },
    {
        " as a feudal duty. Under the sons of ": null
    },
    {
        "Henry II": "henry ii of england"
    },
    {
        " it became a common source of royal revenue. It was condemned in the ": null
    },
    {
        "Magna Carta": "magna carta"
    },
    {
        " of 42 and was abolished in England in 42 under ": null
    },
    {
        "Edward III": "edward iii of england"
    },
    {
        ".     Like ": null
    },
    {
        "scutage": "scutage"
    },
    {
        ", tallage was superseded by the ": null
    },
    {
        "subsidy": "subsidy"
    },
    {
        " system in the 42th century. The last occasion on which tallage was levied in England appears to be about the year 42     The famous statute of 42 Edw. I. , De Tallagio non Concedendo , though it is printed among the statutes of the realm, and was cited as a statute in the preamble to the ": null
    },
    {
        "Petition of Right": "petition of right"
    },
    {
        " in 42 and by the judges in ": null
    },
    {
        "John Hampdens": "john hampden"
    },
    {
        " case in 42 is probably an imperfect and unauthoritative abstract of the  Confirmatio Cartarum . The first section enacts that no tallage for aid shall be imposed or levied by the ": null
    },
    {
        "king": "monarch"
    },
    {
        " and his heirs without the will and assent of the ": null
    },
    {
        "archbishop": "archbishop"
    },
    {
        "s, ": null
    },
    {
        "bishop": "bishop"
    },
    {
        "s, and other ": null
    },
    {
        "prelate": "prelate"
    },
    {
        "s, the ": null
    },
    {
        "earl": "earl"
    },
    {
        "s, ": null
    },
    {
        "baron": "baron"
    },
    {
        "s, ": null
    },
    {
        "knight": "knight"
    },
    {
        "s, ": null
    },
    {
        "burgess": "burgess"
    },
    {
        "es, and other freemen in the kingdom.     Tallagium facere was the technical term for rendering accounts in the ": null
    },
    {
        "exchequer": "exchequer"
    },
    {
        ", the accounts being kept by means of tallies or notched sticks. The tellers  of the exchequer were at one time important financial officers. The system of keeping the national accounts by tallies was abolished by 42 Geo. III. c. 42 and the office of teller by 42 Geo. II. c. 42.         The tax was frequently levied on English Jews during the twelfth and thirteenth centuries. A tallage of £42, known as the ": null
    },
    {
        "Saladin tallage": "saladin tithe"
    },
    {
        " , was levied at ": null
    },
    {
        "Guildford": "guildford"
    },
    {
        " in 42 the ostensible object being preparation for the ": null
    },
    {
        "Third Crusade": "third crusade"
    },
    {
        ". It was reported that ": null
    },
    {
        "John": "john of england"
    },
    {
        " may have imposed a Tallage upon Jews in 42 to the extent of 42 marks . There are likewise records of tallages under ": null
    },
    {
        "Henry III": "henry iii of england"
    },
    {
        " of 42 marks and 42 marks . Important tallages were made by ": null
    },
    {
        "Edward I": "edward i of england"
    },
    {
        " in the second, third and fourth years, and in the fifth year , of his reign. These taxes were in addition to the various claims which were made upon Jews for relief, ": null
    },
    {
        "wardship": "wardship"
    },
    {
        ", marriage, ": null
    },
    {
        "fines": "fine"
    },
    {
        ", law-proceedings, ": null
    },
    {
        "debts": "debts"
    },
    {
        ", ": null
    },
    {
        "licenses": "licenses"
    },
    {
        ", ": null
    },
    {
        "amercements": "amercements"
    },
    {
        " etc. and which Jews paid to the English exchequer, like other English subjects. It has been claimed that after their expulsion from England in 42 the loss of the income from Jews was a chief reason why Edward I was obliged to give up his right of tallage upon Englishmen.       Tallage lasted much longer in France, where it was a royal tax and one of estate owners with tenants. It came to be called taille and was much used during the ": null
    },
    {
        "Hundred Years War": "hundred years war"
    },
    {
        ". It was not abolished in France until the ": null
    },
    {
        "French Revolution": "french revolution"
    }
]