[
    {
        "        Tamworth  is a large ": null
    },
    {
        "market town": "market town"
    },
    {
        " and ": null
    },
    {
        "borough": "borough status in the united kingdom"
    },
    {
        " in ": null
    },
    {
        "Staffordshire": "staffordshire"
    },
    {
        ", England,  north-east of ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        " and on the ": null
    },
    {
        "West Coast Main Line": "west coast main line"
    },
    {
        ". The town adjoins ": null
    },
    {
        "Warwickshire": "warwickshire"
    },
    {
        " to the south and east, ": null
    },
    {
        "Lichfield": "lichfield"
    },
    {
        " to the north and west and local junctions of the ": null
    },
    {
        "M42 Toll": "m6 toll"
    },
    {
        " motorway. It takes its name from the ": null
    },
    {
        "River Tame": "river tame, west midlands"
    },
    {
        ", which flows through it. Its resident ": null
    },
    {
        "population": "population"
    },
    {
        "  was .     Tamworth hosts a simple but elevated ": null
    },
    {
        "42th century castle": "tamworth castle"
    },
    {
        ", a well-preserved medieval church  and a ": null
    },
    {
        "Moat House": "moat house"
    },
    {
        ". Tamworth was the capital of the ": null
    },
    {
        "Anglo-Saxon": "anglo-saxons"
    },
    {
        " Kingdom of Mercia": "mercia"
    },
    {
        " during the ": null
    },
    {
        "Heptarchy": "heptarchy"
    },
    {
        " of seven kingdoms and throughout its later, greater, form.     The towns industries include logistics, engineering, clothing, brick, tile and paper manufacture. Until 42 one of its factories was ": null
    },
    {
        "Reliant": "reliant"
    },
    {
        ", which produced the ": null
    },
    {
        "Reliant Robin": "reliant robin"
    },
    {
        " three-wheeler car and the ": null
    },
    {
        "Reliant Scimitar": "reliant scimitar"
    },
    {
        " sports car.     The ": null
    },
    {
        "Snowdome": "snowdome"
    },
    {
        ", a prototype real-snow ": null
    },
    {
        "indoor ski slope": "indoor ski slope"
    },
    {
        " is in Tamworth and  south is ": null
    },
    {
        "Drayton Manor Theme Park": "drayton manor theme park"
    },
    {
        " and one of the many marinas serving the ": null
    },
    {
        "Coventry Canal": "coventry canal"
    },
    {
        " and ": null
    },
    {
        "Birmingham and Fazeley Canal": "birmingham and fazeley canal"
    },
    {
        " which combine south of the town.           When the ": null
    },
    {
        "Romans": "roman britain"
    },
    {
        " arrived in Britain, the Trent Valley was home to the British ": null
    },
    {
        "Coritani": "coritani"
    },
    {
        " tribe. Evidence of Roman activity in the area of Tamworth consists of fragments of Roman building materials found near Bolebridge Street. Tamworth was near the ": null
    },
    {
        "Roman road": "roman road"
    },
    {
        ", ": null
    },
    {
        "Watling Street": "watling street"
    },
    {
        " and a few miles from the Roman town of ": null
    },
    {
        "Letocetum": "letocetum"
    },
    {
        ".       Following the ": null
    },
    {
        "end of Roman rule": "end of roman rule in britain"
    },
    {
        ", the area around the Tame valley was occupied by ": null
    },
    {
        "Anglo-Saxons": "anglo-saxons"
    },
    {
        " from northern Germany and Jutland. ": null
    },
    {
        "Stephen Pollington": "stephen pollington"
    },
    {
        " states that the settlers that reached Tamworth were ": null
    },
    {
        "Angles": "angles"
    },
    {
        ", who left their homelands after rising sea-levels flooded much of the land. Britain offered an attractive option as its landscape was similar to their homelands, but was more fertile and had a more moderate climate. The Angles arrived from the north, navigating inland via the ": null
    },
    {
        "River Humber": "river humber"
    },
    {
        ", ": null
    },
    {
        "River Trent": "river trent"
    },
    {
        " and the ": null
    },
    {
        "River Tame": "river tame, west midlands"
    },
    {
        ".     The settlers established themselves in an open meadow by the Tame which they called Tomworðig . Nearby they established an enclosed estate called Tomtun – Tame-town – fortified with a palisade wall. These people called themselves the ": null
    },
    {
        "Tomsaete": "tomsaete"
    },
    {
        " : Tame-settlers. Tomtun was initially not much more than a fortified manor . The settlement straddled the ": null
    },
    {
        "River Anker": "river anker"
    },
    {
        " and contained a large hall for public gatherings as well as individual homes and agricultural buildings such as stables and granaries. The Lords of Tame-Settlers quickly became wealthy and Tamworth was thus able to be fortified further.      The Tomsaete were a military tribe, however, when soldiers reached the age of majority they retired from military duty and were then allotted parcels of land to farm, manage and defend. Fertile lands surrounding the rivers allotted first, then the hill lands; this land spreading further and further, spreading the power and influence of the tribes. The Tomsaete were one of countless tribes all vying for power and influence , however the Lords of the Tomsaete came to control and to dominate the area known as ": null
    },
    {
        "English Midlands": "english midlands"
    },
    {
        ". The tribes initially ruled through unions and alliances of leading families and there is evidence of contact with families across England and also back in the Anglo-Saxon homelands. However, this warlord form of government developed and the Tomsaetes lands became a Kingdom with a single leader.     The Tomsaete lived in the heartland of Mercia, and Tamworth was the royal centre under King Penda. The King was not static and would not have a single residence; instead he travelled round his territories to be seen by his people, to give legal judgments, to reward loyalty and to try offenders . Tamworth however, was home to the Kings household and children.     In the reign of ": null
    },
    {
        "King Offa": "king offa"
    },
    {
        " it was the capital of ": null
    },
    {
        "Mercia": "mercia"
    },
    {
        "  the largest of the kingdoms in what is now England . It was by far the largest town in the ": null
    },
    {
        "English Midlands": "english midlands"
    },
    {
        " when todays much larger city of ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        " was still in its infancy. This is largely due to its strategic position at the meeting point of the rivers Tame and Anker, placing the town perfectly as a centre of trade and industry.     The town was sacked by the ": null
    },
    {
        "Danes": "danes"
    },
    {
        "  in 42 It remained a ruin until 42 when ": null
    },
    {
        "Æthelflæd": "æthelflæd"
    },
    {
        ", daughter of King ": null
    },
    {
        "Alfred the Great": "alfred the great"
    },
    {
        " and Lady of the Mercians, rebuilt the town and constructed a ": null
    },
    {
        "burh": "burh"
    },
    {
        " to defend it against further Danish invaders. She made Tamworth her principal residence and died there in 42  In ": null
    },
    {
        "Tamworth church": "church of st editha, tamworth"
    },
    {
        " in 42 a sister of King ": null
    },
    {
        "Æthelstan": "æthelstan"
    },
    {
        ", perhaps Saint ": null
    },
    {
        "Edith of Polesworth": "edith of polesworth"
    },
    {
        ", was married to ": null
    },
    {
        "Sitric Cáech": "sitric cáech"
    },
    {
        ", the squint-eyed Norse King of York and Dublin.          In the 42th century, a ": null
    },
    {
        "Norman": "norman architecture"
    },
    {
        " castle was built on the probable site of the Saxon fort which still stands to this day as an important tourist attraction. Grants of borough privileges, including rights to a third additional fair in 42 consolidated Tamworths historic importance as the seat of Saxon kings.     In the Middle Ages Tamworth was a small market town. However the king gave it charters in 42. In 42 Tamworth was granted the right to hold two annual fairs. In the Middle Ages fairs were like markets but they were held only once a year and they attracted buyers and sellers from great distances.     In 42 Tamworth suffered a disastrous fire, and much of the town burned. However, the town was soon rebuilt and grew in size.       ": null
    },
    {
        "Queen Elizabeth": "elizabeth i of england"
    },
    {
        " granted Tamworth another charter in 42     Tamworth suffered from outbreaks of plague in 42 42 42–42 42 and 42 Many died but each time the population recovered.     ": null
    },
    {
        "James I": "james i of england"
    },
    {
        ", the first Stuart king of England, visited Tamworth in 42 and was accommodated by Sir John Ferrers at Tamworth Castle. The Prince of Wales  was entertained by William Comberford at the Moat House.     Tamworth castle was besieged by parliamentarian forces during the ": null
    },
    {
        "English Civil War": "english civil war"
    },
    {
        " in 42 An order was issued for the castle to be destroyed but this was not carried out.     Tamworth continued to grow and remained one of the most populous towns in the Midlands by 42 when the combined hearth tax returns from Warwickshire and Staffordshire list a total of some 42 households. Its strategic trade advantage lay with control of the two vital ": null
    },
    {
        "packhorse bridge": "packhorse bridge"
    },
    {
        "s across the Anker and the Tame on the route from London to Chester. As today, a market town,   it did a brisk trade providing travellers with at least staple bread, ale and accommodation, maintaining trading links as far afield as Bristol. Charles IIs reconfirmation of its boroughs privileges in 42 gave the town an added boost, as confirmed by ": null
    },
    {
        "Richard Blome": "richard blome"
    },
    {
        "s description of its celebrated market, well served with corn, provisions and lean cattle.     In 42 the towns future ": null
    },
    {
        "Member of Parliament": "member of parliament"
    },
    {
        " Thomas Guy": "thomas guy"
    },
    {
        " founded almshouses in Tamworth, rebuilt in 42 He also built Tamworth Town Hall in 42 and later founded ": null
    },
    {
        "Guys Hospital": "guys hospital"
    },
    {
        " in London.     There are four cannon in the Castle Grounds, an indication of the towns previously violent past.       In 42 the population was a little over 42     There were a number of improvements to Tamworth during the 42th century. In 42 the pavements were flagged.   42 A new church entrance was completed and a new organ erected funded by public subscriptions. .   From 42 Tamworth had gaslight. In the late 42th century a piped water supply was created.     The town grew rapidly in the 42th and 42th centuries during the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        ", benefiting from the surrounding ": null
    },
    {
        "coal": "coal"
    },
    {
        " mines. It also became connected to the ": null
    },
    {
        "canal": "canal"
    },
    {
        " network, with the ": null
    },
    {
        "Coventry Canal": "coventry canal"
    },
    {
        " being built through the town. Later, the ": null
    },
    {
        "railway": "railway"
    },
    {
        "s arrived with the ": null
    },
    {
        "Midland Railway": "midland railway"
    },
    {
        " route from ": null
    },
    {
        "Derby": "derby"
    },
    {
        " to ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        " arriving in Tamworth in 42 and later the ": null
    },
    {
        "London and North Western Railway": "london and north western railway"
    },
    {
        ", which provided direct trains to the capital. ": null
    },
    {
        "A split-level station": "tamworth railway station"
    },
    {
        " exists where the two main lines cross each another, the higher level platforms , being at right angles to the lower ones on the main line to London.      The first municipal cemetery opened in 42 The Assembly Rooms were built in 42 In 42 the corporation bought Tamworth Castle.     A hospital was built in Tamworth in 42 and was funded by one of the towns greatest benefactors, William MacGregor, at his own expense. An infirmary was built in 42 MacGregor also built two churches at Glascote and Hopwas and had the bells at St. Edithas church recast. He also started a free library, a working mens club, a school and started the Co-operative society  Tamworth Co-operative Society in the town in 42 acting as guarantor.     The ": null
    },
    {
        "Victorian": "victorian era"
    },
    {
        " Prime Minister": "prime minister of the united kingdom"
    },
    {
        " Sir Robert Peel": "sir robert peel"
    },
    {
        " served as the towns ": null
    },
    {
        "Member of Parliament": "member of parliament"
    },
    {
        " from 42 until his death in 42 He lived at the nearby ": null
    },
    {
        "Drayton Manor": "drayton manor"
    },
    {
        ". It was in Tamworth that Robert Peel unveiled his ": null
    },
    {
        "Tamworth Manifesto": "tamworth manifesto"
    },
    {
        " in 42 which created what is now the modern ": null
    },
    {
        "Conservative Party": "conservative party"
    },
    {
        ". While Home Secretary, Peel helped create the modern concept of the police force, leading to officers being known as bobbies and Peelers . During the 42th century the ": null
    },
    {
        "Tamworth pig": "tamworth pig"
    },
    {
        ", a long, bristled breed, was first sold here by cross-breeding with imported ": null
    },
    {
        "Irish": "ireland"
    },
    {
        " stock. Sir ": null
    },
    {
        "Robert Peel": "robert peel"
    },
    {
        ", an influential ": null
    },
    {
        "Prime Minister": "prime minister"
    },
    {
        ", was a member of the bowls club, founded in 42 which has an active membership.      ": null
    },
    {
        "Samuel Parkes": "samuel parkes"
    },
    {
        " who won the ": null
    },
    {
        "Victoria Cross": "victoria cross"
    },
    {
        " in the ": null
    },
    {
        "Charge of the Light Brigade": "charge of the light brigade"
    },
    {
        " was born in ": null
    },
    {
        "Wigginton": "wigginton, staffordshire"
    },
    {
        " and baptised at ": null
    },
    {
        "St. Edithas": "church of st editha"
    },
    {
        " on 42 December 42 His parents, Thomas and Lydia, are buried in its churchyard.       The first council houses in Tamworth were built in 42 More were built in the 42s and 42s and after 42     The first public library in Tamworth was built in 42 Tamworth gained an electricity supply in 42        Tamworth grew rapidly in the postwar years as it soaked up overspill from the ": null
    },
    {
        "West Midlands conurbation": "west midlands conurbation"
    },
    {
        " to the southwest. A population of about 42 in 42 had risen to some 42 just after the ": null
    },
    {
        "Second World War": "second world war"
    },
    {
        "; this figure remained fairly static until the late 42s when a major expansion plan was implemented. Although not officially a New Town , Tamworths expansion resembled the development of many new towns. As part of this plan the town boundaries were expanded to include the industrial area around ": null
    },
    {
        "Wilnecote": "wilnecote"
    },
    {
        " to the south. The 42 population of the new enlarged area was 42. In 42 it was 42; in 42 42; in 42 42 and in 42 42, meaning that the towns population had almost doubled within 42 years.     The town of Fazeley merges almost completely into the town to the southwest, but belongs to the ": null
    },
    {
        "Lichfield District": "lichfield"
    },
    {
        " area rather than Tamworth Borough. It became a town, after a referendum on a choice to merge with Tamworth.      Tamworth was divided, down almost the town centre, between Staffordshire and Warwickshire. Staffordshire was redrawn in 42 to take in the whole town.      The ": null
    },
    {
        "Reliant Motor Company": "reliant motors"
    },
    {
        " was founded in Tamworth in 42 Payne, Elvis . The Reliant Motor Company. Crecy Publishing. by T. L. Williams and E. S. Thompson, and cars such as the ": null
    },
    {
        "Scimitar": "reliant scimitar"
    },
    {
        " four wheeled sports cars and the ": null
    },
    {
        "Robin": "reliant robin"
    },
    {
        " three wheeled economy cars were manufactured here until the company moved to ": null
    },
    {
        "Cannock": "cannock"
    },
    {
        " in 42 A year later the old factory was razed to the ground and a new housing estate built in its place called Scimitar Park with street names assuming names of Reliant vehicles .     The ": null
    },
    {
        "A42": "a5 road"
    },
    {
        " dual-carriageway  Fazeley , Two Gates and Wilnecote Bypass opened in July 42 acting both as a bypass of Watling Street, and as a fast route for traffic into the town. This was further extended to meet the M42 Toll and A42 in 42 The roads official name is ": null
    },
    {
        "Thomas Guy": "thomas guy"
    },
    {
        " Way.     Tamworth has six designated ": null
    },
    {
        "Local Nature Reserve": "local nature reserve"
    },
    {
        "s, Hodge Lane , Kettlebrook, Tameside, Dosthill Park, Warwickshire Moor and Broadmeadow, which became the newest nature reserve in April 42        According to the 42 ": null
    },
    {
        "census": "census"
    },
    {
        " the borough has a population of 42. ": null
    },
    {
        "White British": "white british"
    },
    {
        " is the predominant ": null
    },
    {
        "ethnicity": "ethnic group"
    },
    {
        ", then 42% of the population. The second largest ethnicity is ": null
    },
    {
        "White Irish": "irish migration to great britain"
    },
    {
        ", making up 42%.  42% of people in the borough were born in ": null
    },
    {
        "England": "england"
    },
    {
        ", with ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        " ranking next, with 42% of the population.      Tamworth was in 42 the most ": null
    },
    {
        "overweight town in the UK": "obesity in the united kingdom"
    },
    {
        " with a 42% obesity rate.           Tamworth Borough is administered by a Council which has been local Conservative Party-led since 42 and was Labour Party-led from 4242 with seven previous election outcome overall statuses since its 42 inception, primarily involving those two parties.  At the last election, May 42 the ": null
    },
    {
        "Conservative Party": "conservative party"
    },
    {
        " held political power. The council is now made up of 42 Conservatives, 42 Labour and 42 UKIP councillors.  No part of the borough has a ": null
    },
    {
        "civil parish": "civil parish"
    },
    {
        ". The current Mayor of Tamworth is Councillor Peter Thurgood.  On ": null
    },
    {
        "Staffordshire county council": "staffordshire"
    },
    {
        ", Tamworth has six divisions, all of which are held by the Conservatives.       Since 42 Tamworth has formed part of the ": null
    },
    {
        "Greater Birmingham & Solihull Local Enterprise Partnership": "greater birmingham  &  solihull local enterprise partnership"
    },
    {
        " along with neighbouring authorities ": null
    },
    {
        "Birmingham": "birmingham city council"
    },
    {
        ", ": null
    },
    {
        "Bromsgrove": "bromsgrove district"
    },
    {
        ", ": null
    },
    {
        "Cannock Chase": "cannock chase district"
    },
    {
        ", ": null
    },
    {
        "East Staffordshire": "east staffordshire district council"
    },
    {
        ", ": null
    },
    {
        "Lichfield": "lichfield district council"
    },
    {
        ", ": null
    },
    {
        "Redditch": "redditch"
    },
    {
        ", ": null
    },
    {
        "Solihull": "solihull metropolitan borough council"
    },
    {
        " and ": null
    },
    {
        "Wyre Forest": "wyre forest district"
    },
    {
        ". Tamworth is also a non-constituent member of the ": null
    },
    {
        "West Midlands Combined Authority": "west midlands combined authority"
    },
    {
        ".      The council retains a cabinet system of governance,  the Leader of the council is Cllr Daniel Cook and the Deputy Leader is Cllr Robert Pritchard.           Tamworth Council elects by thirds meaning there is an election of 42 councillor for each of the wards every year for three years but the fourth year see elections to Staffordshire County Council.  Councillors are elected for a four-year term.     The borough is used as the starting point of the extent of the Westminster seat of ": null
    },
    {
        "Tamworth": "tamworth"
    },
    {
        " since ": null
    },
    {
        "42": "2010 united kingdom general election"
    },
    {
        " represented by ": null
    },
    {
        "Christopher Pincher": "christopher pincher"
    },
    {
        ", a ": null
    },
    {
        "Conservative": "conservative party"
    },
    {
        ".        Tamworth has a minor hospital called Sir Robert Peel Hospital which is located in ": null
    },
    {
        "Mile Oak": "mile oak"
    },
    {
        ". Sir Robert Peel Hospital does not have accident and emergency facilities, which are provided at ": null
    },
    {
        "Good Hope Hospital": "good hope hospital"
    },
    {
        " in ": null
    },
    {
        "Sutton Coldfield": "sutton coldfield"
    },
    {
        ".      Tamworth is part of the South Staffordshire and Shropshire Healthcare NHS Foundation trust.        ": null
    },
    {
        "Christianity": "christianity"
    },
    {
        " is the largest religion in Tamworth, comprising 42% of the population. 42% are not religious. Other religions include ": null
    },
    {
        "Hindu": "hindu"
    },
    {
        " , ": null
    },
    {
        "Islam": "islam"
    },
    {
        " and ": null
    },
    {
        "Sikhism": "sikhism"
    },
    {
        " which make up 42% of the population.        The main church in Tamworth is ": null
    },
    {
        "Church of St Editha": "church of st editha, tamworth"
    },
    {
        " in the town centre. Most of Tamworth is part of the ": null
    },
    {
        "Diocese of Lichfield": "diocese of lichfield"
    },
    {
        ", the two ": null
    },
    {
        "parish": "parish"
    },
    {
        "es being Tamworth and ": null
    },
    {
        "Wilnecote": "wilnecote"
    },
    {
        ". However ": null
    },
    {
        "Amington": "amington"
    },
    {
        " is in the parish of Amington St. Editha which is part of the ": null
    },
    {
        "Diocese of Birmingham": "anglican diocese of birmingham"
    },
    {
        ".       Tamworth is in the ": null
    },
    {
        "Roman Catholic Archdiocese of Birmingham": "roman catholic archdiocese of birmingham"
    },
    {
        "; the main ": null
    },
    {
        "Roman Catholic": "roman catholic"
    },
    {
        " church is ": null
    },
    {
        "St John the Baptist": "john the baptist"
    },
    {
        " on St John Street in the town centre, the other Roman Catholic church is ": null
    },
    {
        "Sacred Heart": "sacred heart"
    },
    {
        " Church in ": null
    },
    {
        "Glascote": "glascote"
    },
    {
        ".          Tamworth is divided into 42 wards:    ": null
    },
    {
        "Amington": "amington"
    },
    {
        " Belgrave": "belgrave, tamworth"
    },
    {
        " Bolehall": "bolehall"
    },
    {
        " Glascote": "glascote"
    },
    {
        " Stonydelph": "stonydelph"
    },
    {
        " Wilnecote": "wilnecote"
    },
    {
        "          Sir Ernest William Titterton": "ernest william titterton"
    },
    {
        " was born in Tamworth. He was a ": null
    },
    {
        "research officer": "research assistant"
    },
    {
        " for the British ": null
    },
    {
        "Admiralty": "admiralty"
    },
    {
        " during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " before becoming in 42 a member of the British mission to the U.S. to participate in the ": null
    },
    {
        "Manhattan Project": "manhattan project"
    },
    {
        " which developed the ": null
    },
    {
        "atomic bomb": "atomic bomb"
    },
    {
        ". He was ": null
    },
    {
        "knight": "knight"
    },
    {
        "ed in 42      Former ": null
    },
    {
        "The Teardrop Explodes": "the teardrop explodes"
    },
    {
        " frontman and solo artist/writer ": null
    },
    {
        "Julian Cope": "julian cope"
    },
    {
        " was raised in Tamworth and later lived in nearby ": null
    },
    {
        "Drayton Bassett": "drayton bassett"
    },
    {
        ". Cope recorded three solo albums during his Tamworth years, ": null
    },
    {
        "World Shut Your Mouth ": "world shut your mouth"
    },
    {
        ", ": null
    },
    {
        "Fried ": "fried"
    },
    {
        " and ": null
    },
    {
        "Saint Julian ": "saint julian"
    },
    {
        ", and all three used various locations around Tamworth for their sleeve art and several videos. The heavy rock band ": null
    },
    {
        "Wolfsbane": "wolfsbane"
    },
    {
        " cut their teeth in the town, before their lead singer ": null
    },
    {
        "Blaze Bayley": "blaze bayley"
    },
    {
        " went on to front the legendary ": null
    },
    {
        "Iron Maiden": "iron maiden"
    },
    {
        ". Rock guitarist ": null
    },
    {
        "Clem Clempson": "clem clempson"
    },
    {
        " was born in Tamworth. ": null
    },
    {
        "Bob Catley": "bob catley"
    },
    {
        " the lead singer of rock band ": null
    },
    {
        "Magnum ": "magnum"
    },
    {
        " also lives in Tamworth. Guitarist/vocalist/songwriter/ producer ": null
    },
    {
        "Phil Bates": "phil bates"
    },
    {
        "  was born in Tamworth, and played in local bands the Teenbeats and Source of Power until moving away from the area in 42 Phil still has strong family and musical connections with Tamworth. Tamworth has an ": null
    },
    {
        "active music scene": "indie music scene"
    },
    {
        ", which circulates to some degree around The Skull Club and Tamworth Bands websites.           The main road running through Tamworth is the ": null
    },
    {
        "A42": "a5 road"
    },
    {
        " bypass. The ": null
    },
    {
        "M42 motorway": "m42 motorway"
    },
    {
        " runs to the east of Tamworth and the town is served by junction 42 which also contains ": null
    },
    {
        "Tamworth services": "tamworth services"
    },
    {
        ".       The Egg is a ": null
    },
    {
        "magic roundabout": "roundabout  magic   roundabouts/ring junctions"
    },
    {
        " in Tamworth, ": null
    },
    {
        "Staffordshire": "staffordshire"
    },
    {
        " at its heart. The Egg forms the junction of the ": null
    },
    {
        "A42": "a51 road"
    },
    {
        ", A42 and A42 and terminates the B42 It consists of the roads Ankerdrive and Bolebridge Street, and is listed as being part of the A42 The Egg has a cinema complex and restaurant in the centre, and has the ": null
    },
    {
        "River Anker": "river anker"
    },
    {
        " running through it. The ": null
    },
    {
        "Snowdome": "snowdome"
    },
    {
        " and ": null
    },
    {
        "Tamworth FC": "tamworth fc"
    },
    {
        " also directly adjoin the junction. The Egg was voted the fourth worst roundabout in Britain in 42           ": null
    },
    {
        "Tamworth railway station": "tamworth railway station"
    },
    {
        " located on Victoria Road serves the town. Tamworth Station is a high- and low-level station and serves as an interchange between the ": null
    },
    {
        "West Coast Mainline": "west coast mainline"
    },
    {
        " and the ": null
    },
    {
        "Cross Country Route": "cross country route"
    },
    {
        ". A smaller station called ": null
    },
    {
        "Wilnecote railway station": "wilnecote railway station"
    },
    {
        " on the ": null
    },
    {
        "Cross Country Route": "cross country route"
    },
    {
        " serves the suburbs of ": null
    },
    {
        "Wilnecote": "wilnecote"
    },
    {
        " and Two Gates.       The nearest airports to Tamworth are ": null
    },
    {
        "Birmingham Airport": "birmingham airport, england"
    },
    {
        " and ": null
    },
    {
        "East Midlands Airport": "east midlands airport"
    },
    {
        ".       Tamworths ": null
    },
    {
        "town twins": "town twinning"
    },
    {
        "  retrieved 42 January 42 are:             Tamworth currently has two historical ": null
    },
    {
        "blue plaque": "blue plaque"
    },
    {
        "s. The first is positioned on the old Bank House on Lady Bank by the Tamworth Civic Society and commemorates the Tamworth Savings Bank that was founded on 42 More recently on 42 July 42  Tamworth Informed a blue plaque was unveiled by Tamworth Heritage Trust and the ": null
    },
    {
        "Reliant": "reliant"
    },
    {
        " Motor Club at Bro-Dawel on the Kettlebrook Road to honour Reliants founders, Mr T. L. Williams and Mr E. S. Thompson, and marks the birthplace of the first Reliant prototype built in 42         One of the more notable personalities to come from Tamworth is former ": null
    },
    {
        "Manchester City": "manchester city f.c."
    },
    {
        " goalkeeper ": null
    },
    {
        "Tony Coton": "tony coton"
    },
    {
        ", who made a number of appearances over the years. ": null
    },
    {
        "Tamworth F.C.": "tamworth f.c."
    },
    {
        " has also fielded a number of notable players in recent times, including ": null
    },
    {
        "West Brom": "west bromwich albion"
    },
    {
        " legend ": null
    },
    {
        "Bob Taylor": "bob taylor"
    },
    {
        " and, for one match in the 42–42 season, former ": null
    },
    {
        "Aston Villa": "aston villa f.c."
    },
    {
        " and ": null
    },
    {
        "Arsenal": "arsenal f.c."
    },
    {
        " midfielder ": null
    },
    {
        "Paul Merson": "paul merson"
    },
    {
        ". Tamworth F.C. showed signs of progress, just surviving to get their third season in the Conference, playing teams such as ": null
    },
    {
        "Halifax Town": "halifax town a.f.c."
    },
    {
        ", ": null
    },
    {
        "Oxford United": "oxford united f.c."
    },
    {
        " & ": null
    },
    {
        "Kidderminster Harriers": "kidderminster harriers f.c."
    },
    {
        " on a regular basis. The club also has a keen rivalry with fellow Staffordshire clubs ": null
    },
    {
        "Stafford Rangers": "stafford rangers f.c."
    },
    {
        " and ": null
    },
    {
        "Burton Albion": "burton albion f.c."
    },
    {
        ". However, their biggest rivals are ": null
    },
    {
        "Nuneaton Town": "nuneaton town f.c."
    },
    {
        ". In 42 as winners of Conference North, Tamworth were promoted to the Conference Premier.     Other football players from Tamworth include goalkeeper Martin Taylor who played for ": null
    },
    {
        "Derby County": "derby county f.c."
    },
    {
        " and ": null
    },
    {
        "Wycombe Wanderers": "wycombe wanderers f.c."
    },
    {
        ", and current Wales international ": null
    },
    {
        "Ashley Williams": "ashley williams"
    },
    {
        " who plays for ": null
    },
    {
        "Everton": "everton f.c."
    },
    {
        " in the Premier League. ": null
    },
    {
        "Leicester City": "leicester city f.c."
    },
    {
        " footballer ": null
    },
    {
        "Marc Albrighton": "marc albrighton"
    },
    {
        " is also from Tamworth.       Tamworth Castle Bowling Club was founded in 42  it can boast Mayors and Prime ministers as past members. This crown green bowling club is situated behind a green door on Ladybank in the shadow of Tamworth Castle. The club is owned by its membership with a season running from March to October.     Tamworth and District Indoor Bowling Club officially founded and opened in 42 A fire destroyed the Club just after it was originally built delaying its opening by about 42 months. This is the only indoor bowling club in Staffordshire and with over 42 members it is actively involved at Club, County and National levels of competition. There is an active junior section with County representatives to under 42 age group. Bowling for people with disabilities is a very important part of the Club as is coaching for all players. Owned by its membership the Club has an Outdoor green operating April to September whilst the Indoor rinks are open throughout the year. The Club is in Eagle Drive, Amington, Tamworth just before the Municipal Golf Course.       Speedway racing took place in the Tamworth area in the 42s and in the post war era featured at the Greyhound Stadium in Mile Oak. The Hounds started out in 42 racing in the National League Division Three before becoming The Tammies in 42 when the venture was purchased by Birmingham promoter Les Marshall.                   There are five secondary schools in Tamworth, a sixth form centre and a branch of South Staffordshire College along with 42 primary schools.         In 42 The  Tamworth Herald  was launched by Daniel Addison, with its original premises in Silver Street. Mr Addison continued to publish the paper for nine years until 42 October 42 when it was taken over by a consortium of leading townsmen. The paper now has offices on Ventura Park Road, where it remains to this day. Its Tamworth-based reporters also contribute local news stories to the Birmingham Mails website, Birmingham Live in addition to their print based activities.   The Tamworth Herald was crowned ‘Newspaper of the Year’ at the Midland Media Awards in both 42 and 42   Daniel Addison had a son ": null
    },
    {
        "Albert Christopher Addison": "albert christopher addison"
    },
    {
        " who was a historical writer.     In 42 , a local Facebook Page was launched to bring news to local residents. In 42 this developed into a website and a mobile app was also launched. Tamworth Informed remains the only local news service in the area that is recognised by ": null
    },
    {
        "Apple": "apple inc."
    },
    {
        " for their news service.     ": null
    },
    {
        "Touch Radio ": "touch radio"
    },
    {
        " is the local commercial radio station; it broadcasts from the nearby ": null
    },
    {
        "Lichfield transmitting station": "lichfield transmitting station"
    },
    {
        ". The ": null
    },
    {
        "BBC Local Radio": "bbc local radio"
    },
    {
        " station covering Tamworth is ": null
    },
    {
        "BBC WM": "bbc wm"
    },
    {
        " which has its studios in ": null
    },
    {
        "Birmingham": "birmingham"
    },
    {
        ". Community station Total Choice Radio served the Tamworth area but this came to an end in October 42 It was however announced shortly after that there would be a replacement Community Radio service in Tamworth;  this received the support of the Mayor at the time, Cllr John Chesworth.  Tamworth lies in the ": null
    },
    {
        "BBC West Midlands": "bbc west midlands"
    },
    {
        " and ": null
    },
    {
        "ITV Central": "itv central"
    },
    {
        " television regions.               ": null
    },
    {
        "Anthony Dyott": "anthony dyott"
    },
    {
        " lawyer, politician,  retrieved December 42 Recorder of Tamworth from 42 MP for ": null
    },
    {
        "Lichfield": "lichfield"
    },
    {
        " from 42 to 42   ": null
    },
    {
        "Thomas Blake": "thomas blake"
    },
    {
        " English Puritan clergyman,  retrieved December 42 controversialist of moderate Presbyterian sympathies.   ": null
    },
    {
        "John Swinfen": "john swinfen"
    },
    {
        " politician  retrieved December 42 and MP variously between 42 and 42 elected for ": null
    },
    {
        "Tamworth": "tamworth"
    },
    {
        " in 42 42 and 42   Captain ": null
    },
    {
        "Elizur Holyoke": "elizur holyoke"
    },
    {
        " of Springfield, Massachusetts, namesake of the mountain, ": null
    },
    {
        "Mount Holyoke": "mount holyoke"
    },
    {
        ", emigrated from Tamworth in 42   ": null
    },
    {
        "John Rawlet": "john rawlet"
    },
    {
        " Anglican cleric,  retrieved December 42 preacher and writer of religious literature   ": null
    },
    {
        "Thomas Sheasby": "thomas sheasby"
    },
    {
        " senior civil engineer and contractor, built bridges and canals   ": null
    },
    {
        "Robert Peel": "robert peel"
    },
    {
        " , a British statesman,  retrieved December 42 served twice as Prime Minister Regarded as the father of modern British policing. MP for ": null
    },
    {
        "Tamworth": "tamworth"
    },
    {
        " from 4242   ": null
    },
    {
        "Henry John Roby": "henry john roby"
    },
    {
        " classical scholar,  retrieved December 42 writer on Roman law, Liberal MP for ": null
    },
    {
        "Eccles": "eccles"
    },
    {
        " 42/42 and a ": null
    },
    {
        "Cambridge Apostle": "cambridge apostle"
    },
    {
        " William Gordon Bagnall": "william gordon bagnall"
    },
    {
        " mechanical engineer, founded ": null
    },
    {
        "W.G. Bagnall": "w.g. bagnall"
    },
    {
        " in 42   ": null
    },
    {
        "Joseph Adcock": "joseph adcock"
    },
    {
        " Anglican clergyman and first-class cricketer  retrieved December 42 in New Zealand   ": null
    },
    {
        "Frederick William Thomas": "frederick william thomas"
    },
    {
        " CIE FBA was an English Indologist and Tibetologist   ": null
    },
    {
        "Appleby Matthews": "appleby matthews"
    },
    {
        " conductor, organist and first conductor of the ": null
    },
    {
        "City of Birmingham Symphony Orchestra": "city of birmingham symphony orchestra"
    },
    {
        "     Ernest Titterton": "ernest titterton"
    },
    {
        " CMG FRS FAA was a British nuclear physicist.   Able Seaman ": null
    },
    {
        "Colin Grazier": "colin grazier"
    },
    {
        " posthumously awarded the George Cross for capturing ": null
    },
    {
        "Enigma": "enigma machine"
    },
    {
        " codebooks   ": null
    },
    {
        "Bryan Pringle": "bryan pringle"
    },
    {
        " actor,  retrieved December 42 appeared in television, film and theatre productions   ": null
    },
    {
        "Brian Jenkins": "brian jenkins"
    },
    {
        " Labour Party politician, MP for ": null
    },
    {
        "Tamworth": "tamworth"
    },
    {
        " from 42 to 42   ": null
    },
    {
        "Alan Edwin Thomas Harper": "alan harper"
    },
    {
        " OBE retired Anglican bishop, served in the Church of Ireland as ": null
    },
    {
        "Archbishop of Armagh": "archbishop of armagh"
    },
    {
        " and ": null
    },
    {
        "Primate of All Ireland": "primate of all ireland"
    },
    {
        " from 42 to 42   ": null
    },
    {
        "Clem Clempson": "clem clempson"
    },
    {
        " rock guitarist,  retrieved December 42 played for ": null
    },
    {
        "Colosseum": "colosseum"
    },
    {
        " and ": null
    },
    {
        "Humble Pie": "humble pie"
    },
    {
        " Sue Coe": "sue coe"
    },
    {
        " artist, illustrator, works in drawing and printmaking, lives in ": null
    },
    {
        "Upstate New York": "upstate new york"
    },
    {
        " Joe Grice": "joe grice"
    },
    {
        " Chief Economist to the ": null
    },
    {
        "Office for National Statistics": "office for national statistics"
    },
    {
        " Phil Bates": "phil bates"
    },
    {
        " English musician, member of many notable bands, including Trickster and ": null
    },
    {
        "Quill": "quill"
    },
    {
        " Phil Bennion": "phil bennion"
    },
    {
        " farmer, LibDem MEP for the West Midlands from 42 to 42   ": null
    },
    {
        "Julian Cope": "julian cope"
    },
    {
        " musician,  retrieved December 42 author, antiquarian, musicologist, poet and cultural commentator   ": null
    },
    {
        "Blaze Bayley": "blaze bayley"
    },
    {
        " singer,  retrieved December 42 musician, songwriter, lyricist and lead singer of ": null
    },
    {
        "Wolfsbane": "wolfsbane"
    },
    {
        " Christopher John Pincher": "christopher pincher"
    },
    {
        " MP for ": null
    },
    {
        "Tamworth": "tamworth"
    },
    {
        " since 42   ": null
    },
    {
        "Niki Evans": "niki evans"
    },
    {
        " singer,  retrieved December 42 from the fourth series of ": null
    },
    {
        "The X Factor": "the x factor"
    },
    {
        " in 42   ": null
    },
    {
        "Rebekah Ryan": "rebekah ryan"
    },
    {
        " female pop singer and songwriter   ": null
    },
    {
        "Jemma Palmer": "jemma palmer"
    },
    {
        " an English model and professional wrestler, signed to WWE.     ": null
    },
    {
        "Emma Slater": "emma slater"
    },
    {
        " professional dancer/choreographer  retrieved December 42 on ": null
    },
    {
        "Dancing with the Stars": "dancing with the stars"
    },
    {
        "  Hubert Pearson": "hubert pearson"
    },
    {
        " goalkeeper, 42 appearances for ": null
    },
    {
        "West Bromwich Albion F.C.": "west bromwich albion f.c."
    },
    {
        " Harold Pearson": "harold pearson"
    },
    {
        " goalkeeper, over 42 pro appearances mainly for ": null
    },
    {
        "West Bromwich Albion F.C.": "west bromwich albion f.c."
    },
    {
        " Albert Mullard": "albert mullard"
    },
    {
        " prisoner of war and footballer, played almost 42 pro games mainly for ": null
    },
    {
        "Port Vale F.C.": "port vale f.c."
    },
    {
        " Micky Steele-Bodger": "micky steele-bodger"
    },
    {
        " CBE former rugby union footballer, played flanker for ": null
    },
    {
        "Harlequins": "harlequin f.c."
    },
    {
        ", England and the ": null
    },
    {
        "Barbarians": "barbarian f.c."
    },
    {
        " Cyril Beech": "cyril beech"
    },
    {
        " footballer, made 42 pro appearances mainly for ": null
    },
    {
        "Swansea Town F.C.": "swansea town f.c."
    },
    {
        " Dave Black": "dave black"
    },
    {
        " long-distance runner, competed in the ": null
    },
    {
        "42 Summer Olympics": "1980 summer olympics"
    },
    {
        " Roger Brown": "roger brown"
    },
    {
        " football manager  retrieved December 42 and player, made over 42 pro appearances mainly for ": null
    },
    {
        "Fulham F.C.": "fulham f.c."
    },
    {
        " Peter Eastoe": "peter eastoe"
    },
    {
        " former footballer, 42 pro appearances mainly for ": null
    },
    {
        "Everton F.C.": "everton f.c."
    },
    {
        " Steve Fox": "steve fox"
    },
    {
        " footballer, made 42 pro appearances mainly for ": null
    },
    {
        "Wrexham F.C.": "wrexham f.c."
    },
    {
        " Tony Coton": "tony coton"
    },
    {
        " former footballer,  retrieved December 42 goalkeeper. 42 pro appearances mainly for ": null
    },
    {
        "Watford F.C.": "watford f.c."
    },
    {
        " Kelvin Burt": "kelvin burt"
    },
    {
        " BTCC/F42/Porsche racing driver, ex F42 Test Driver   ": null
    },
    {
        "Dan Martin": "dan martin"
    },
    {
        " Irish professional racing cyclist.   ": null
    },
    {
        "Marc Albrighton": "marc albrighton"
    },
    {
        " English professional footballer,  retrieved December 42 plays for ": null
    },
    {
        "Leicester City F.C.": "leicester city f.c."
    },
    {
        " David Gilbert": "david gilbert"
    }
]