[
    {
        "      Country Code : +1284     International Call Prefix : 011     Calls from the British Virgin Islands to the US, Canada, and other ": null
    },
    {
        "NANP": "North American Numbering Plan"
    },
    {
        " Caribbean nations, are dialled as 1 + NANP area code + 7-digit number. Calls from the British Virgin Islands to non-NANP countries are dialled as 011 + country code + phone number with local area code.     ": null
    },
    {
        "Number Format": "North American Numbering Plandialing Procedures"
    },
    {
        ": nxx-xxxx      Telephone s - main lines in use:   11,700     Telephones - mobile cellular:   8,000     Telephone system:   worldwide telephone service   general assessment:   worldwide telephone service   domestic:   NA   international:   Connected via submarine cable to ": null
    },
    {
        "Bermuda": "Bermuda"
    },
    {
        "; the ": null
    },
    {
        "East Caribbean Fibre System": "Ecfs"
    },
    {
        " submarine cable provides connectivity to 13 other islands in the eastern Caribbean      Radio broadcast stations:   AM 1, FM 5, shortwave 0     ": null
    },
    {
        "ZBVI": "Zbvi"
    },
    {
        " 780 Tortola   ZJKC-FM 90.9 Tortola    ": null
    },
    {
        "ZGLD-FM": "Zgld-Fm"
    },
    {
        " 91.7 Tortola   ": null
    },
    {
        "ZCCR-FM": "Zccr-Fm"
    },
    {
        " 94.1 Todmans Peak   ": null
    },
    {
        "ZWVE-FM": "Zwve-Fm"
    },
    {
        " 97.3 Tortola   ": null
    },
    {
        "ZKNG-FM": "Zkng-Fm"
    },
    {
        " 100.9 Chalwell   ": null
    },
    {
        "ZROD-FM": "Zrod-Fm"
    },
    {
        " 103.7 Tortola   ": null
    },
    {
        "ZVCR-FM": "Zvcr-Fm"
    },
    {
        " 106.9 Chalwell      Television broadcast stations:   1 ,      Internet service provider s :   1     Internet country code:   ": null
    },
    {
        "VG": ".Vg"
    },
    {
        "     Internet hosts:   465     Internet users:   4,000     :See also : ": null
    },
    {
        "British Virgin Islands": "British Virgin Islands"
    },
    {
        "          In 2006, the British Virgin Islands government undertook a ": null
    },
    {
        "deregulation": "Deregulation"
    },
    {
        " of the telephone industry. Telecommunications Act Prior to 2006, in common with many other Caribbean countries, ": null
    },
    {
        "Cable & Wireless ": "Cable  &  Wireless"
    },
    {
        " had a statutory ": null
    },
    {
        "monopoly": "Monopoly"
    },
    {
        " Under the Cable and Wireless Limited Telephones Act, 1975 on telephone and other electronic communications services. However, in the 1990s, a local company called CCT Boatphone, which had previously provided radio boatphones to tourists on charter boats, expanded into cellular telecommunications for land-based users. Although technically in breach of the statutory monopoly, CCT Boatphone was backed by a powerful collection of local interests known as the BVI Investment Club. Negotiations between Cable & Wireless and CCT Boatphone led to a split of the monopolies, with Cable & Wireless retaining a monopoly over fixed line and internet services, and CCT Boatphone keeping a de facto monopoly over cellular telephones.     In 2007 the government abolished the previously existing monopolies under an order made pursuant to the new legislation. The process proved politically fraught, and the governments Minister for Communications and Works, ": null
    },
    {
        "Alvin Christopher": "Alvin Christopher"
    },
    {
        ", ended up leaving the government and joining the opposition party as a result of the furore. The process was also criticised as cumbersome and slow, the initial deregulation having been announced in 2004, and taking no less than three years to come to fruition through delays in legislation and regulation.     Although there have been no new entrants into the fixed line industry, the government issued three licences under the new regime to cellular telephone service providers. The existing provider, CCT Boatphone, obtained one licence. ": null
    },
    {
        "Bmobile": "Lime"
    },
    {
        ", the cellular arm of Cable & Wireless, obtained a second. The third licence was obtained by BVI Cable TV, a local cable television service. The licence in favour of BVI Cable was controversial, as the Regulator had announced in advance that only three licences in total would be issued, and BVI Cable TV had crumbling cable television infrastructure, and was in no position to office cellular telephone services . However, bmobiles main regional competitor, ": null
    },
    {
        "Digicel": "Digicel"
    },
    {
        ", was rejected for a licence. The decision was regarded as highly controversial in the local media.  and      Digicel then issued court proceedings against the Regulator, arguing that he had acted improperly by imposing an arbitrary limit of three licences . Bmobile was joined to the suit as an interested party. High Court Judge Rita Joseph-Olivetti found in favour of Digicel and quashed the original decision.  Digicel commenced separate proceedings against ": null
    },
    {
        "Cable and Wireless": "Cable  &  Wireless Plc"
    },
    {
        "  in the ": null
    },
    {
        "English courts": "Courts Of England And Wales"
    },
    {
        ", claiming that Cable & Wireless has unfairly stifled competition in several Caribbean jurisdictions.  During the intervening period, bmobile has obtained a virtual stranglehold on the cellular telecommunications market in the British Virgin Islands by a combination of low prices and aggressive advertising, as well as significant investment in infrastructure and technology.  and      Digicel was finally granted a licence on 17 December 2007 and started operations in the BVI on 28 November 2008.     ": null
    }
]