[
    {
        "   The ": null
    },
    {
        "Peoples Republic of China": "peoples republic of china"
    },
    {
        " possesses a diversified ": null
    },
    {
        "communications": "communications"
    },
    {
        " system that links all parts of the country by Internet, telephone, telegraph, radio, and television. The country is served by an extensive system of automatic ": null
    },
    {
        "telephone exchanges": "telephone exchange"
    },
    {
        "connected by modern networks of ": null
    },
    {
        "fiber-optic": "optical fiber"
    },
    {
        " cable, ": null
    },
    {
        "coaxial cable": "coaxial cable"
    },
    {
        ", ": null
    },
    {
        "microwave radio relay": "microwave radio relay"
    },
    {
        ", and a domestic satellite system; cellular telephone service is widely available, expanding rapidly, and includes ": null
    },
    {
        "roaming": "roaming"
    },
    {
        " service to foreign countries. ": null
    },
    {
        "Fiber to the x": "fiber to the x"
    },
    {
        " infrastructure has been expanded rapidly in recent years.          When the Peoples Republic was founded in 1949, the telecommunication systems and facilities in China first established by the ": null
    },
    {
        "Qing": "qing dynasty"
    },
    {
        " and ": null
    },
    {
        "Republican": "republic of china"
    },
    {
        " ITA": "imperial chinese telegraph administration"
    },
    {
        " and ": null
    },
    {
        "Ministry of Posts and Communications": "ministry of posts and communications"
    },
    {
        " had been seriously damaged from over thirty years of on and off war between ": null
    },
    {
        "warlords": "warlord era"
    },
    {
        ", ": null
    },
    {
        "Japan": "second sino-japanese war"
    },
    {
        ", and the two sides of the ": null
    },
    {
        "Chinese Civil War": "chinese civil war"
    },
    {
        ". What little remained was largely outdated and rudimentary and limited to the eastern coastal cities, the ": null
    },
    {
        "Nanjing": "nanjing"
    },
    {
        "-": null
    },
    {
        "Shanghai": "shanghai"
    },
    {
        " region, and a few interior cities. In the 1950s existing facilities were repaired, and, with ": null
    },
    {
        "Soviet assistance": "sino-soviet relations"
    },
    {
        ", considerable progress was made toward establishing a ": null
    },
    {
        "long-distance": "long distance calling"
    },
    {
        " telephone": "telephone"
    },
    {
        " wire": "wire"
    },
    {
        " network connecting Beijing to provincial-level capitals.     Communications in China were established rapidly in the early 1950s. By 1952 the principal telecommunications network centered on ": null
    },
    {
        "Beijing": "beijing"
    },
    {
        ", and links to all large cities had finally been established. Work quickly got under way to repair, renovate and expand the system, and from 1956 telecommunications routes were extended more rapidly. To increase the efficiency of the ": null
    },
    {
        "communications system": "communications system"
    },
    {
        ", the same lines were used for both ": null
    },
    {
        "telegraphic": "telegraphic"
    },
    {
        " and ": null
    },
    {
        "telephone": "telephone"
    },
    {
        " service, while ": null
    },
    {
        "Teletype": "teleprinter"
    },
    {
        " and ": null
    },
    {
        "television": "television"
    },
    {
        "  services were also added.     In addition, conference telephone service was initiated, radio communications were improved, and the production of telecommunications equipment was accelerated. Growth in telecommunications halted with the general economic collapse after the ": null
    },
    {
        "Great Leap Forward": "great leap forward"
    },
    {
        " but revived in the 1960s after the telephone network was expanded and improved equipment was introduced, including imports of Western plants and equipment.     By 1963 telephone wire had been laid from Beijing to the ": null
    },
    {
        "capitals of all provinces": "list of current and former capitals of subnational entities of china"
    },
    {
        ", ": null
    },
    {
        "autonomous regions": "autonomous areas of china"
    },
    {
        ", and ": null
    },
    {
        "large cities": "list of cities in the peoples republic of china"
    },
    {
        ", while in turn, provincial capitals and autonomous regions were connected to the administrative seats of the ": null
    },
    {
        "counties": "county"
    },
    {
        ", smaller municipalities and larger ": null
    },
    {
        "market town": "market town"
    },
    {
        "s.     In the years immediately following 1949, telecommunications — by ": null
    },
    {
        "telegraph": "telegraph"
    },
    {
        " or ": null
    },
    {
        "telephone": "telephone"
    },
    {
        " — mainly used ": null
    },
    {
        "wire": "wire"
    },
    {
        "; by the 1970s, however, ": null
    },
    {
        "radio": "radio"
    },
    {
        " telecommunications equipment were increasingly used and began to replace wire lines. ": null
    },
    {
        "Microwave": "microwave"
    },
    {
        " and ": null
    },
    {
        "satellite": "satellite"
    },
    {
        " transmissions were soon introduced and have now become common. In 1956 the first automatic speed ": null
    },
    {
        "Teletype": "teleprinter"
    },
    {
        " was installed on the ": null
    },
    {
        "Beijing": "beijing"
    },
    {
        "-": null
    },
    {
        "Lhasa": "lhasa"
    },
    {
        " line. By 1964 such machines had been installed in most of Chinas major cities. Radio-television service also was installed in major cities, and radio teleprinters became widely used.     An important component of the ": null
    },
    {
        "Fourth Five-Year Plan": "fourth five-year plan of china"
    },
    {
        " was a major development program for the ": null
    },
    {
        "telecommunications": "telecommunications"
    },
    {
        " system. The program allotted top priority to scarce ": null
    },
    {
        "electronics": "electronics"
    },
    {
        " and ": null
    },
    {
        "construction": "construction"
    },
    {
        " resources and dramatically improved all aspects of Chinas telecommunications capabilities.     ": null
    },
    {
        "Microwave radio": "microwave radio"
    },
    {
        " relay lines and buried cable lines were constructed to create a network of ": null
    },
    {
        "wideband": "wideband"
    },
    {
        " carrier trunk lines, which covered the entire country. China was linked to the international telecommunications network by the installation of ": null
    },
    {
        "communications satellite": "communications satellite"
    },
    {
        " ground stations and the construction of ": null
    },
    {
        "coaxial": "coaxial"
    },
    {
        " cables linking ": null
    },
    {
        "Guangdong": "guangdong"
    },
    {
        " Province with ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " and ": null
    },
    {
        "Macau": "macau"
    },
    {
        ". Provincial-level units and municipalities rapidly expanded local telephone and wire broadcasting networks. Expansion and modernization of the telecommunications system continued throughout the late-1970s and early 1980s, giving particular emphasis to the production of radio and television sets and expanded ": null
    },
    {
        "broadcasting": "broadcasting"
    },
    {
        " capabilities.     Marked improvements occurred by the mid-1980s with an influx of foreign technology and increased domestic production capabilities. International and long-distance telephone links by cable and satellite of high quality multiplied. Telegraph, facsimile, and telex were all in use. International satellite ground stations in Beijing and Shanghai were built and a domestic satellite communication network was operational in 1986. Over 160 radio stations existed by the mid-1980s, and transistorized radio receivers were common. A vast wired broadcasting system included over 2,600 stations carrying radio transmissions into all rural units and many urban areas. The television system grew rapidly in 1980s, with 90 television stations and 80 million sets by 1987.     By 1987 China possessed a diversified telecommunications system that linked all parts of the country by telephone, telegraph, radio, and television. None of the telecommunications forms were as prevalent or as advanced as those in modern ": null
    },
    {
        "Western countries": "western countries"
    },
    {
        ", but the system included some of the most sophisticated technology in the world and constituted a foundation for further development of a modern network.     Overall, Chinas telecommunications services improved enormously during the 1980s, and, the pace of telecommunications growth and technology upgrading increased even more rapidly after 1990, especially as ": null
    },
    {
        "fiber-optic": "optical fiber"
    },
    {
        " systems and ": null
    },
    {
        "digital technology": "digital technology"
    },
    {
        " were installed. After 1997, Chinas telecommunications services were enhanced further with the acquisition of ": null
    },
    {
        "Hong Kongs": "communications in hong kong"
    },
    {
        "highly advanced systems. In the late 1990s and early 2000s, foreign investment in the countrys telecommunications sector further encouraged growth. Notable has been the tremendous increase in Internet and cellular phone usage. China became the world leader in the early 21st century, in terms of number of cell phone subscribers. The nation ranks first in the world in numbers of both mobile and fixed-line telephones, and first in the number of internet users.     Experts claim that although the number of cellular phones has grown enormously, surpassing that for standard  telephones in 2003, the overall ratio of ": null
    },
    {
        "phones per capita": "phones per capita"
    },
    {
        " has nonetheless remained much smaller than it is for the ": null
    },
    {
        "developed countries": "developed countries"
    },
    {
        ". Eric Harwit.   The China Quarterly , 180: 1010–1030 Cambridge University Press.  .     China is the largest user of largest Voice calling over the Internet or Voice over Internet Protocol  services with 51 million ": null
    },
    {
        "Tom": "tom online"
    },
    {
        "-": null
    },
    {
        "Skype": "skype"
    },
    {
        " users as of November 2007.        In 1987 the Ministry of Posts and Telecommunications  administered Chinas ": null
    },
    {
        "telecommunications": "telecommunications"
    },
    {
        " systems and related research and production facilities. Besides ": null
    },
    {
        "postal service": "mail"
    },
    {
        "s, some of which were handled by electronic means, the ministry was involved in a wide spectrum of telephone, wire, telegraph, and international communications . The Ministry of Radio and Television was established as a separate entity in 1982 to administer and upgrade the status of television and radio broadcasting. Subordinate to this ministry were the Central Peoples Broadcasting Station, Radio Beijing, and China Central Television. Additionally, the various broadcasting training, talent-search, research, publishing, and manufacturing organizations were brought under the control of the Ministry of Radio and Television. In 1986 responsibility for the movie industry was transferred from the Ministry of Culture to the new Ministry of Radio, Cinema, and Television.     As of 1987 the quality of telecommunications services in China had improved markedly over earlier years. A considerable influx of foreign technology and increased domestic production capabilities had a major impact in the post-Mao period.          The primary form of telecommunications in the 1980s was local and long-distance telephone service administered by six regional bureaus: ": null
    },
    {
        "Beijing": "beijing"
    },
    {
        " , ": null
    },
    {
        "Shanghai": "shanghai"
    },
    {
        " , ": null
    },
    {
        "Xian": "xian"
    },
    {
        " , ": null
    },
    {
        "Chengdu": "chengdu"
    },
    {
        " , ": null
    },
    {
        "Wuhan": "wuhan"
    },
    {
        " , and ": null
    },
    {
        "Shenyang": "shenyang"
    },
    {
        " . These regional headquarters served as ": null
    },
    {
        "switching": "telephone exchange"
    },
    {
        " centers for provincial-level subsystems. By 1986 China had nearly 3 million telephone exchange lines, including 34,000 long-distance exchange lines with direct, automatic service to 24 cities. By late 1986 ": null
    },
    {
        "fiber optic": "fiber optic"
    },
    {
        " communications technology was being employed to relieve the strain on existing telephone circuits. International service was routed through overseas exchanges located in Beijing and Shanghai. ": null
    },
    {
        "Guangdong": "guangdong"
    },
    {
        " Province had coaxial cable and microwave lines linking it to ": null
    },
    {
        "Hong Kong": "hong kong"
    },
    {
        " and ": null
    },
    {
        "Macau": "macau"
    },
    {
        ".     The large, continuously upgraded satellite ground stations, originally installed in 1972 to provide live coverage of the visits to China by U.S. president ": null
    },
    {
        "Richard M. Nixon": "richard m. nixon"
    },
    {
        " and Japanese prime minister ": null
    },
    {
        "Kakuei Tanaka": "kakuei tanaka"
    },
    {
        ", still served as the base for Chinas international satellite communications network in the mid-1980s. By 1977 China had joined Intelsat and, using ground stations in Beijing and Shanghai, had linked up with satellites over the ": null
    },
    {
        "Indian": "indian ocean"
    },
    {
        " and ": null
    },
    {
        "Pacific": "pacific ocean"
    },
    {
        " oceans.     In April 1984 China launched an experimental ": null
    },
    {
        "communications satellite": "communications satellite"
    },
    {
        " for trial transmission of ": null
    },
    {
        "broadcast": "broadcast"
    },
    {
        "s, ": null
    },
    {
        "telegram": "telegram"
    },
    {
        "s, ": null
    },
    {
        "telephone call": "telephone call"
    },
    {
        "s, and ": null
    },
    {
        "facsimile": "facsimile machine"
    },
    {
        ", probably to remote areas of the country. In February 1986 China launched its first fully operational telecommunications and broadcast satellite. The quality and communications capacity of the second satellite reportedly was much greater than the first. In mid-1987 both satellites were still functioning. With these satellites in place Chinas domestic satellite communication network went into operation, facilitating television and radio transmissions and providing ": null
    },
    {
        "direct-dial": "direct-dial"
    },
    {
        " longdistance telephone, telegraph, and facsimile service. The network had ground stations in ": null
    },
    {
        "Beijing": "beijing"
    },
    {
        ", ": null
    },
    {
        "Urumqi": "urumqi"
    },
    {
        ", ": null
    },
    {
        "Hohhot": "hohhot"
    },
    {
        ", ": null
    },
    {
        "Lhasa": "lhasa"
    },
    {
        ", and ": null
    },
    {
        "Guangzhou": "guangzhou"
    },
    {
        ", which also were linked to an ": null
    },
    {
        "Intelsat": "intelsat"
    },
    {
        " satellite over the Indian Ocean.     Telegraph development received lower priority than the telephone network largely because of the difficulties involved in transmitting the ": null
    },
    {
        "written Chinese": "written chinese"
    },
    {
        " language. ": null
    },
    {
        "Computer technology": "computer technology"
    },
    {
        " gradually alleviated these problems and facilitated further growth in this area. By 1983 China had nearly 10,000 ": null
    },
    {
        "telegraph": "telegraph"
    },
    {
        " cables and ": null
    },
    {
        "telex": "telex"
    },
    {
        " lines transmitting over 170 million messages annually. Most telegrams were transmitted by cables or by shortwave radio. Cutmicrowave transmission also was used. Teletype transmission was used for messages at the international level, but some 40 percent of county and municipal telegrams were transmitted by ": null
    },
    {
        "Morse code": "morse code"
    },
    {
        ".     Apart from traditional telegraph and telephone services, China also had facsimile, low-speed data-transmission, and computer-controlled telecommunications services. These included on-line information retrieval terminals in Beijing, ": null
    },
    {
        "Changsha": "changsha"
    },
    {
        ", and ": null
    },
    {
        "Baotou": "baotou"
    },
    {
        " that enabled international telecommunications networks to retrieve news and scientific, technical, economic, and cultural information from international sources.     High-speed newspaper-page-facsimile equipment and ": null
    },
    {
        "Chinese character": "chinese character"
    },
    {
        " – code translation equipment were used on a large scale. Sixty-four-channel program-controlled automatic message retransmission equipment and low- or medium-speed data transmission and exchange equipment also received extensive use. International telex service was available in ": null
    },
    {
        "coastal cities": "list of places on the coastline of the peoples republic of china"
    },
    {
        " and ": null
    },
    {
        "special economic zones": "special economic zones of the peoples republic of china"
    },
    {
        ".     The Central Peoples Broadcasting Station controlled Chinas national radio network. Programming was administered by the provincial-level units. The station produced general news and cultural and educational programs. It also provided programs directed toward ": null
    },
    {
        "Taiwan": "taiwan"
    },
    {
        " and ": null
    },
    {
        "overseas Chinese": "overseas chinese"
    },
    {
        " listeners. ": null
    },
    {
        "Radio Beijing": "radio beijing"
    },
    {
        " broadcast to the world in thirty-eight ": null
    },
    {
        "foreign language": "foreign language"
    },
    {
        "s, ": null
    },
    {
        "Standard Mandarin": "standard chinese"
    },
    {
        ", and a number of ": null
    },
    {
        "Chinese varieties": "varieties of chinese"
    },
    {
        ", including ": null
    },
    {
        "Xiamen": "xiamen"
    },
    {
        ", ": null
    },
    {
        "Cantonese": "cantonese"
    },
    {
        ", and ": null
    },
    {
        "Hakka": "hakka chinese"
    },
    {
        ". It also provided English-language news programs aimed at foreign residents in Beijing. Medium-wave, shortwave, and FM stations reached 80 percent of the country — over 160 radio stations and 500 relay and transmission stations — with some 240 radio programs.     The nationwide network of wire lines and loudspeakers transmitted radio programs into virtually all rural communities and many urban areas. By 1984 there were over 2,600 wired broadcasting stations, extending radio transmissions to rural areas outside the range of regular broadcasting stations.     In 1987 ": null
    },
    {
        "China Central Television": "china central television"
    },
    {
        " , the state network, managed Chinas television programs. In 1985 consumers purchased 15 million new sets, including approximately 4 million color sets. Production fell far short of demand. Because Chinese viewers often gathered in large groups to watch publicly owned sets, authorities estimated that two-thirds of the nation had access to television. In 1987 there were about 70 million television sets, an average of 29 sets per 100 families. CCTV had four channels that supplied programs to the over ninety television stations throughout the country. Construction began on a major new CCTV studio in Beijing in 1985. CCTV produced its own programs, a large portion of which were educational, and the Television University in Beijing produced three educational programs weekly. The English-language lesson was the most popular program and had an estimated 5 to 6 million viewers. Other programs included daily news, entertainment, teleplays, and special programs. Foreign programs included films and cartoons. Chinese viewers were particularly interested in watching international news, sports, and drama .       The former telecoms regulator – the ": null
    },
    {
        "Ministry of Information Industry": "ministry of information industry"
    },
    {
        " – reported in 2004 that China had 295 million subscribers to main telephone lines and 305 million cellular telephone subscribers, the highest numbers in both categories. Both categories showed substantial increases over the previous decade; in 1995 there were only 3.6 million cellular telephone subscribers and around 20 million main-line telephone subscribers. By 2003 there were 42 telephones per 100 population.     Internet use also has soared in China from about 60,000 Internet users in 1995 to 22.5 million users in 2000; by 2005 the number had reached 103 million. Although this figure is well below the 159 million users in the United States and although fairly low per capita, it was second in the world and on a par with ": null
    },
    {
        "Japan": "japan"
    },
    {
        "’s 57 million users.     By the June 2010, China had 420 million internet users. Incidentally, this is greater than the population of the US, however penetration rate is still relatively low at just under 32%.  See ": null
    },
    {
        "Internet in the Peoples Republic of China": "internet in the peoples republic of china"
    },
    {
        "     Chinas 2.7 million kilometers of ": null
    },
    {
        "optical fiber": "optical fiber"
    },
    {
        " telecommunication": "telecommunication"
    },
    {
        " cables by 2003 assisted greatly in the ": null
    },
    {
        "modernization": "modernization"
    },
    {
        " process. China produces an increasing volume of televisions both for domestic use and export, which has helped to spread communications development. In 2001 China produced more than 46 million televisions and claimed 317 million sets in use. At the same time, there were 417 million radios in use in China, a rate of 342 per 1,000 population. However, many more are reached, especially in rural areas, via ": null
    },
    {
        "loudspeaker": "loudspeaker"
    },
    {
        " broadcasts of ": null
    },
    {
        "radio": "radio"
    },
    {
        " programs that bring transmissions to large numbers of radioless households.     In March 2012, the Ministry of Industry and Information Technology announced that China has 1.01 billion mobile phone subscribers; of these, 144 million are connected to 3G networks. Donald Melanson, 30 March 2012, , ": null
    },
    {
        "Engadget": "engadget"
    },
    {
        " 2012-03-30, , China Daily 30 March 2012, , AFP At the same time, the number of landline phones dropped by 828,000 within the span of two months to a total of 284.3 million.       The primary regulator of communications, in particular ": null
    },
    {
        "telecommunications": "telecommunications"
    },
    {
        ", in China is the ": null
    },
    {
        "Ministry of Industry and Information Technology": "ministry of industry and information technology of the peoples republic of china"
    },
    {
        " . It closely regulates all of the industries outlined below with the exception of the radio and television sectors, which belong to the remit of the ": null
    },
    {
        "State Administration of Radio, Film, and Television": "state administration of radio, film, and television"
    },
    {
        ".     Since 2014, the Cyberspace Administration of China is responsible for setting policy and the regulatory framework for user content generated in online social activities on Internet portals.              :See: Telecommunications industry in China   Telephone numbers in China 4 Pacific Ocean and 1 Indian OceanIndian Ocean regionPacific and Indian Ocean regionsformer    ": null
    }
]