[
    {
        "Modern  telecommunications in Thailand  began in 1875 with the deployment of the first ": null
    },
    {
        "telegraph": "Telegraph"
    },
    {
        " service. Historically, the development of telecommunication networks in Thailand were in the hands of the public sector. Government organisations were established to provide telegraph, ": null
    },
    {
        "telephone": "Telephone"
    },
    {
        ", ": null
    },
    {
        "radio": "Radio Broadcasting"
    },
    {
        ", and ": null
    },
    {
        "television": "Television"
    },
    {
        " services, and other government agencies, especially the military, still control a large estate of radio and television spectra. Private telecommunication operators initially acquired ": null
    },
    {
        "concession agreements": "Concession"
    },
    {
        " with state enterprises. For mobile phone services, all the concessions have been amended by successive government to last 25 years have gradually ended in 2015. For other services, the concession terms and conditions vary, ranging from one to fifteen years. Nearly all of the concessions are ": null
    },
    {
        "build-operate-transfer": "Build-Operate-Transfer"
    },
    {
        " contracts. The private investor has to build all the required facilities and transfer them to the state before they can operate or offer services to public.     Liberalisation took place in the 1990s and 2000s. State enterprises, the ": null
    },
    {
        "Telephone Organization of Thailand": "Tot Public Company Limited"
    },
    {
        ", ": null
    },
    {
        "Communications Authority of Thailand": "Cat Telecom"
    },
    {
        ", and ": null
    },
    {
        "Mass Communication Organization of Thailand": "Mcot"
    },
    {
        ", were corporatised in 2003 and 2004. The ": null
    },
    {
        "Constitution of 1997": "Constitution Of Thailand Of 1997"
    },
    {
        " prompted the institutional changes when it declared that all the spectrum is a national communication resource for public welfare . The 1997 Constitution further requires the establishment of an independent regulator who shall be authorized to allocate spectra and monitor and regulate communications in Thailand. In 1998, to comply with the constitutional mandate, the parliament passed a law establishing two independent regulators, the National Telecommunication Commission and the National Broadcasting Commission . The regulatory practice began in Thailand when the NTC was appointed by the king through the complex nomination procedure in 2005. The inception of NTC automatically terminates and transfers all power and authority in telecommunication sector from the Post and Telegraph Department to the newly established independent commission.     In September 2006, the military wrested control from a civilian government and merged the telecommunications and broadcasting regulators into a convergence regulator. The task had not been completed when a civilian government came into power and introduced the new bill. The new law dubbed the Act on Spectrum Allocation Authority, Regulatory & Control over Radio & TV Broadcast and Telecommunications of 2010 , eliminated the NTC and created a new convergence regulator to manage both telecommunications and broadcast in Thailand. The new law also requires that the ": null
    },
    {
        "National Broadcasting and Telecommunications Commission": "National Broadcasting And Telecommunications Commission"
    },
    {
        " which was established in 2010 as an independent regulator, must allocate all commercial spectrum licenses via auction. In 2012, in order to license the ": null
    },
    {
        "3G": "3G"
    },
    {
        " spectrum and services, the Telecom Commission hosted a spectrum auction which resulted in three new licenses for 2.1  GHz to three incumbents . In 2013, the Broadcast Commission auctioned 42 new ": null
    },
    {
        "DTTV": "Dttv"
    },
    {
        " licenses. Both auctions together earned record sums for money paid to the public sector via auction. Later the record was beaten by another auction by sister agency, the Broadcast Commission who launched the DTTV auction in December 2013. The NBTC Act in force then allowed NBTC to keep the proceeds of the DTTV auction. But when the military took over the country, it amended the NBTC Act to require return of auction proceeds to the treasury.     On 22 May 2014 when the coup détat took place, the military decided that it would scrutinize the regulatory practices of both sectors. The government, led by General ": null
    },
    {
        "Prayut Chan-o-cha": "Prayut Chan-O-Cha"
    },
    {
        ", announced that his government would move Thailand into the digital economy and would transform the Ministry of Information and Telecommunications into a Digital Economy Ministry. NBTC reform would be a part of the plan. In June 2014, the junta issued two new orders demanding that a GPRS , EDGE Q3 2015Q3 2016Q3 201840.45%23.32% GPRS , EDGE telecommunicationCite web|urlhttps://www.slideshare.net/yozzo1/thailands-telecom-structure-2017|titleThailand’s Telecom Structure 2017|websitewww.slideshare.com|languageen|access-date2018-12-31cite web|urlhttp://www.yozzo.com/news-and-information/mvno-mobile-operator-s/mobile-market-shares-thailand-2016 | title Mobile Market Shares Thailand 2016 ส่วนแบ่งการตลาดของบริการโทรศัพท์เคลื่อนที่ 2559Cite web|urlhttps://www.slideshare.net/yozzo1/thailands-telecom-structure-2017|titleThailand’s Telecom Structure 2017|websitewww.slideshare.com|languageen|access-date2018-12-31cite web | urlhttp://true.listedcompany.com/newsroom/20140814-true-set02-th.pdf | formatpdf | titleที่ TRUE-SEC 050/2557 | languageThai | accessdate27 November 2014cite web|urlhttp://www.yozzo.com/news-and-information/mvno-mobile-operator-s/mobile-market-shares-thailand-2016 | title ส่วนแบ่งการตลาดของบริการโทรศัพท์เคลื่อนที่ 2559cite web|urlhttp://www.yozzo.com/news-and-information/mvno-mobile-operator-s/thailands-mvno-market-2016-tot-2100mhz-2300mhz | title Thailand’s MVNO Market 2016 – TOT, 2100MHz, 2300MHzThailandThailandThailandCite web|urlhttp://www.weconnectthailand.com/news/the-state-of-mvno-in-2018-more-than-1300-active-mvnos-in-79-countries|titleThe state of MVNO in 2018 – More than 1,300 active MVNOs in 79 countries|websitewww.www.weconnectthailand.com|languageen|access-date2018-12-27Cite web|urlhttp://www.yozzo.com/news-and-information/mvno-mobile-operator-s/i-mobile-hangs-up-its-mvno-business|titlei-mobile hangs up its MVNO business|websitewww.yozzo.com|languageen|access-date2018-12-27ThailandCite web|urlhttp://www.yozzo.com/news-and-information/mvno-mobile-operator-s/another-tot-mvno-hangs-up|titleAnother TOT MVNO hangs up|websitewww.yozzo.com|languageen|access-date2018-12-27Thailand   ": null
    }
]