[
    {
        "The primary regulator of telecommunications in Malaysia is the Malaysian Communications and Multimedia Commission . It issues licenses under the Communications and Multimedia Act 42 the Postal Services Act 42 and the Digital Signature Act 42     The telecommunications industry in Malaysia is exhibiting the obvious signs of industry standard change and symptoms of a market in transition.     Bolstered by rapid evolution of telecommunication technologies and increasing demands by the public for more refined telecommunication services, the standard of telecommunication services is now rapidly shifting from voice-centric communication to high-speed data communication.     Telephones system Number of fixed-telephone subscriptions: 42 million as at 42Q 42     Telephone system: Excellent domestic and international services     Domestic:     Excellent national communication connectivity in Peninsular Malaysia mainly due to extensive coverage by both fixed and wireless infrastructure such as fibre network, Asymmetric Digital Subscriber Line network, mobile base stations, earth stations and microwave link stations   Good connectivity and services in Sabah and Sarawak are mainly provided by adequate coverage of fibre network, ADSL network, earth stations, mobile base station and microwave link stations   Good intercity communication service provided in Peninsular and East Malaysia are mainly by fibre optic connections and fixed wireless systems . In addition, there are also deployment of Very Small Aperture Terminal for service provisioning in rural areas   Major telecommunication operators in Malaysia include Celcom, Digi, Maxis, Telekom Malaysia, Time dotCom and U Mobile     International:     Wide connectivity via submarine cables to Tier 42 networks ": null
    },
    {
        "42": "internet1"
    },
    {
        " that can reach every other network on the Internet solely via settlement-free interconnection   Major submarine cable providers in Malaysia are Telekom Malaysia and TIME   Satellite services coverage to most world continents by Measat, the Malaysian satellite service provider     Overview of Broadband in Malaysia .       Mobile broadband contributed 42% of total broadband market share or 42 million of subscriptions as at 42Q 42 This was mainly attributed by the following factors:     :Upgrading and expansion of network coverage   ::For instance, the Time 42 and Time 42 Extension initiatives by the Government involved construction of 42 new communications towers in rural areas nationwide. Apart from that, more than 42 existing communications towers were upgraded from 42G to 42G/42G to cater higher broadband speed in rural areas. In addition, service providers also continued to invest in mobile network upgrade and expansion. As at 42Q 42 42G population coverage has reached 42%, whilst 42G LTE population coverage rose to 42%.     :Submarine Cable System to Sabah & Sarawak   ::Introduced in 42 through a public-private partnership between MCMC and Telekom Malaysia Berhad . The project was completed in 42 and this will be a redundancy to the existing domestic submarine cable services that have been operating since 42 It was aimed to meet the growing demands for bandwidth between Peninsular Malaysia, Sarawak and Sabah.     :Submarine Cable System to Islands   ::The project started in 42 and was completed in 42 which involved in upgrading of existing communications infrastructure network, together with the fibre optic cables connecting between the mainland with three islands - Perhentian, Tioman and Pangkor islands.            Mobile Cellular Radio Usage Statistics A. Radio Televisyen Malaysia    ::42 Nasional FM     ::42 Traxx FM     ::42 Minnal FM     ::42 Ai FM     ::42 Radio Klasik     ::42 Asyik FM     ::42 Local/State Radio Stations: 42     :::42 Perlis FM     :::42 Kedah FM     :::42 Mutiara FM     :::42 Perak FM     :::42 Selangor FM     :::42 Negeri FM     :::42 Melaka FM     :::42 Johor FM     :::42 Pahang FM     :::42 Terengganu FM     :::42 Kelantan FM     :::42 Sarawak FM     :::42 Sabah FM     :::42 KL FM     :::42 Limbang FM     :::42 Miri FM     :::42 Sri Aman FM     :::42 Bintulu FM     :::42 Sibu FM     :::42 Red FM- Sarawak Rangkaian Merah     :::42 WAI FM- Sarawak Saluran Etnik     :::42 Sabah FM     :::42 Sandakan FM     :::42 Tawau FM     :::42 Keningau FM     :::42 Labuan FM     :::42 Langkawi FM     :B. Media Prima Berhad    ::42 Synchrosound Studio Sdn Bhd     ::42 One FM Radio Sdn Bhd     ::42 Kool FM Radio Sdn Bhd     :C. Measat Broadcast Network Services Sdn Bhd    ::42 Capital FM Sdn Bhd     ::42 Measat Radio Communications Sdn Bhd     ::42 Maestra Broadcast Sdn Bhd     ::42 Perfect Excellence Waves Sdn Bhd     ::42 Radio Lebuhraya Sdn Bhd     :D. Star Media Group Berhad    ::42 Rimakmur Sdn Bhd     ::42 Star Rfm Sdn Bhd     :E. Others   ::42 BFM Media Sdn Bhd     ::42 Husa Network Sdn Bhd     ::42 Senandung Sonik Sdn Bhd     ::42 Radio Kita Sdn Bhd     ::42 Cense Media Sdn Bhd     ::42 Suara Johor Sdn Bhd     ::42 Kristal Harta Sdn Bhd     ::42 Institut Kefahaman Islam Malaysia     ::42 Malaysia Airports Sdn Bhd     ::42 Arus Rentas Sdn Bhd     ::42 Ephrata Services Sdn Bhd     Amateur Radio Stations: 42 assignments     Radio listenership: 42 million     Television A. Under Radio Televisyen Malaysia    ::42 TV42     ::42 TV42     ::42 RTM Sports HD     ::42 RTM Bes HD     ::42 TV Okey     :B. Under Media Prima Berhad    ::42 Sistem Televisyen Malaysia Berhad     ::42 Natseven TV Sdn Bhd     ::42 Metropolitan TV Sdn Bhd     ::42 CH42 Media Sdn Bhd     ::42 CJ Wow Shop     :C. Alhijrah Media Corporation    ::42 TV Alhijrah     :D. Pertubuhan Berita Nasional Malaysia    ::42 Bernama News Channel       :42 Vision Four Multimedia Sdn Bhd         :Cable-based   ::42 Asian Broadcasting Network Sdn Bhd     :Satellite-based   ::42 Measat Broadcast Network Systems Sdn Bhd     :IP over UHF-based transmission-based   ::42 U Television Sdn Bhd     :IPTV-based   ::42 Fine TV Network Sdn Bhd     ::42 eTV Multimedia Sdn Bhd     ::42 TM Net Sdn Bhd       Television viewership: 42 million     Internet Internet Users: 42 million ": null
    },
    {
        "42": "internet2"
    },
    {
        "     Country code :": null
    }
]