[
    {
        "A television network is a ": null
    },
    {
        "telecommunications network": "telecommunications network"
    },
    {
        " for distribution of ": null
    },
    {
        "television program": "television program"
    },
    {
        " content, whereby a central operation provides programming to many ": null
    },
    {
        "television station": "television station"
    },
    {
        "s or ": null
    },
    {
        "pay television": "multichannel video programming distributor"
    },
    {
        " providers. Until the mid42s, television ": null
    },
    {
        "programming": "broadcast programming"
    },
    {
        " in most countries of the world was dominated by a small number of ": null
    },
    {
        "terrestrial network": "terrestrial network"
    },
    {
        "s. Many early television networks  evolved from earlier ": null
    },
    {
        "radio network": "radio network"
    },
    {
        "s.       In countries where most networks broadcast identical, centrally originated content to all of their stations and where most individual ": null
    },
    {
        "television transmitter": "television transmitter"
    },
    {
        "s therefore operate only as large ": null
    },
    {
        "repeater stations": "broadcast relay station"
    },
    {
        " , the terms television network , ": null
    },
    {
        "television channel": "television channel"
    },
    {
        "  and television station have become mostly interchangeable in everyday language, with professionals in television-related occupations continuing to make a differentiation between them. Within the industry, a tiering is sometimes created among groups of networks based on whether their programming is simultaneously originated from a central point, and whether the network ": null
    },
    {
        "master control": "master control"
    },
    {
        " has the technical and administrative capability to take over the programming of their ": null
    },
    {
        "affiliates": "network affiliate"
    },
    {
        " in real-time when it deems this necessary – the most common example being during national ": null
    },
    {
        "breaking news": "breaking news"
    },
    {
        " events.     In ": null
    },
    {
        "North America": "north america"
    },
    {
        " in particular, many television networks available via ": null
    },
    {
        "cable": "cable television"
    },
    {
        " and ": null
    },
    {
        "satellite television": "satellite television"
    },
    {
        " are branded as channels because they are somewhat different from traditional networks in the sense defined above, as they are singular operations – they have no affiliates or component stations, but instead are distributed to the public via cable or ": null
    },
    {
        "direct-broadcast satellite": "direct-broadcast satellite"
    },
    {
        " providers. Such networks are commonly referred to by terms such as ": null
    },
    {
        "specialty channel": "specialty channel"
    },
    {
        "s in Canada or ": null
    },
    {
        "cable network": "cable channel"
    },
    {
        "s in the U.S.     A network may or may not produce all of its own programming. If not, ": null
    },
    {
        "production companies": "production company"
    },
    {
        "  can distribute their content to the various networks, and it is common that a certain production firm may have programs that air on two or more rival networks. Similarly, some networks may import television programs from other countries, or use archived programming to help complement their schedules.     Some stations have the capability to interrupt the network through the ": null
    },
    {
        "local insertion": "local insertion"
    },
    {
        " of ": null
    },
    {
        "television commercial": "television commercial"
    },
    {
        "s, ": null
    },
    {
        "station identification": "station identification"
    },
    {
        "s and ": null
    },
    {
        "emergency alert": "emergency alert"
    },
    {
        "s. Others completely break away from the network for their own programming, a method known as ": null
    },
    {
        "regional variation": "regional variation"
    },
    {
        ". This is common where small networks are members of larger networks. The majority of commercial television stations are self-owned, even though a variety of these instances are the property of an owned-and-operated television network. The commercial television stations can also be linked with a ": null
    },
    {
        "noncommercial educational": "noncommercial educational"
    },
    {
        " broadcasting agency. It is also important to note that some countries have launched national television networks, so that individual television stations can act as common repeaters of nationwide ": null
    },
    {
        "program": "television program"
    },
    {
        "s.     On the other hand, television networks also undergo the impending experience of major changes related to cultural varieties. The emergence of cable television has made available in major media markets, programs such as those aimed at American bi-cultural Latinos. Such a diverse captive audience presents an occasion for the networks and affiliates to advertise the best programming that needs to be aired.     This is explained by author Tim P. Vos in his abstract A Cultural Explanation of Early Broadcast, where he determines targeted group/non-targeted group representations as well as the cultural specificity employed in the television network entity. Vos notes that policymakers did not expressly intend to create a broadcast order dominated by commercial networks. In fact, legislative attempts were made to limit the networks preferred position.     As to individual stations, modern ": null
    },
    {
        "network operations center": "network operations center"
    },
    {
        "s usually use ": null
    },
    {
        "broadcast automation": "broadcast automation"
    },
    {
        " to handle most tasks. These systems are not only used for ": null
    },
    {
        "programming": "broadcast programming"
    },
    {
        " and for ": null
    },
    {
        "video server": "video server"
    },
    {
        " playout": "playout"
    },
    {
        ", but use exact ": null
    },
    {
        "atomic time": "atomic time"
    },
    {
        " from ": null
    },
    {
        "Global Positioning System": "global positioning system"
    },
    {
        "s or other sources to maintain perfect ": null
    },
    {
        "synchronization": "synchronization"
    },
    {
        " with upstream and downstream systems, so that programming appears seamless to viewers.       A major international television network is the British Broadcasting Corporation , which is perhaps most well known for its news agency ": null
    },
    {
        "BBC News": "bbc news"
    },
    {
        ". Owned by ": null
    },
    {
        "the Crown": "the crown"
    },
    {
        ", the BBC operates primarily in the ": null
    },
    {
        "United Kingdom": "united kingdom"
    },
    {
        ". It is funded by the ": null
    },
    {
        "television licence": "television licensing in the united kingdom"
    },
    {
        " paid by British residents that watch ": null
    },
    {
        "terrestrial television": "terrestrial television"
    },
    {
        " and as a result, no commercial advertising appears on its networks. Outside the UK, advertising is broadcast because the licence fee only applies to the BBCs British operations. 42 people worldwide are employed by the BBC and its subsidiary, ": null
    },
    {
        "BBC Studios": "bbc studios"
    },
    {
        ".          ": null
    },
    {
        "Television in the United States": "television in the united states"
    },
    {
        " had long been dominated by the ": null
    },
    {
        "Big Three television networks": "big three television networks"
    },
    {
        ", the ": null
    },
    {
        "American Broadcasting Company": "american broadcasting company"
    },
    {
        " , ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " and the National Broadcasting Company ; however the ": null
    },
    {
        "Fox Broadcasting Company": "fox broadcasting company"
    },
    {
        " , which launched in October 42 has gained prominence and is now considered part of the Big Four. The Big Three provide a significant number of programs to each of their affiliates, including ": null
    },
    {
        "newscast": "news broadcasting"
    },
    {
        "s, ": null
    },
    {
        "prime time": "prime time"
    },
    {
        ", ": null
    },
    {
        "daytime": "daytime television"
    },
    {
        " and ": null
    },
    {
        "sports": "sports television"
    },
    {
        " programming, but still reserve periods during each day where their affiliate can air ": null
    },
    {
        "local programming": "local programming"
    },
    {
        ", such as local news or ": null
    },
    {
        "syndicated programs": "broadcast syndication"
    },
    {
        ". Since the creation of Fox, the number of American television networks has increased, though the amount of programming they provide is often much less: for example, ": null
    },
    {
        "The CW Television Network": "the cw"
    },
    {
        " only provides twelve hours of primetime programming each week , leaving its affiliates to fill time periods where network programs are not broadcast with a large amount of syndicated programming. Other networks are dedicated to specialized programming, such as ": null
    },
    {
        "religious": "religious broadcasting"
    },
    {
        " content or programs presented in languages other than ": null
    },
    {
        "English": "english language"
    },
    {
        ", particularly ": null
    },
    {
        "Spanish": "spanish language"
    },
    {
        ".     The largest television network in the United States, however, is the Public Broadcasting Service , a ": null
    },
    {
        "non-profit": "non-profit"
    },
    {
        ", publicly owned, ": null
    },
    {
        "non-commercial educational": "non-commercial educational"
    },
    {
        " service. In comparison to the ": null
    },
    {
        "commercial television": "commercial television"
    },
    {
        " networks, there is no central unified arm of broadcast programming, meaning that each PBS ": null
    },
    {
        "member station": "network affiliatemember stations"
    },
    {
        " has a significant amount of freedom to schedule television shows as they consent to. Some public television outlets, such as PBS, carry separate ": null
    },
    {
        "digital subchannel": "digital subchannel"
    },
    {
        " networks through their member stations .     This works as each network sends its signal to many local affiliated television stations across the country. These local stations then carry the network feed, which can be viewed by millions of households across the country. In such cases, the signal is sent to as many as 42+ stations or as little as just a dozen or fewer stations, depending on the size of the network.     With the adoption of ": null
    },
    {
        "digital television": "digital terrestrial television"
    },
    {
        ", television networks have also been created specifically for distribution on the digital subchannels of television stations .     ": null
    },
    {
        "Cable": "cable television in the united states"
    },
    {
        " and satellite providers pay the networks a certain rate per subscriber . The providers also handle the sale of ": null
    },
    {
        "advertising": "television commercials"
    },
    {
        " inserted at the local level during national programming, in which case the broadcaster and the cable/satellite provider may ": null
    },
    {
        "share revenue": "revenue sharing"
    },
    {
        ". Networks that maintain a ": null
    },
    {
        "home shopping": "home shopping"
    },
    {
        " or ": null
    },
    {
        "infomercial": "infomercial"
    },
    {
        " format may instead pay the station or cable/satellite provider, in a ": null
    },
    {
        "brokered": "brokered programming"
    },
    {
        " carriage deal. This is especially common with ": null
    },
    {
        "low-power": "low-power broadcasting"
    },
    {
        " television stations, and in recent years, even more so for stations that used this revenue stream to finance their conversion to digital broadcasts, which in turn provides them with several additional channels to transmit different programming sources.       Television broadcasting in the United States was heavily influenced by ": null
    },
    {
        "radio": "radio"
    },
    {
        ". Early individual experimental radio stations in the United States began limited operations in the 42s. In November 42 ": null
    },
    {
        "Westinghouse": "westinghouse broadcasting"
    },
    {
        " signed on the worlds first commercially licensed radio station , ": null
    },
    {
        "KDKA": "kdka"
    },
    {
        " in ": null
    },
    {
        "Pittsburgh": "pittsburgh, pennsylvania"
    },
    {
        ", ": null
    },
    {
        "Pennsylvania": "pennsylvania"
    },
    {
        ".  Other companies built early radio stations in ": null
    },
    {
        "Detroit": "detroit"
    },
    {
        ", ": null
    },
    {
        "Boston": "boston"
    },
    {
        ", ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " and other areas. Radio stations received permission to transmit through ": null
    },
    {
        "broadcast license": "broadcast license"
    },
    {
        "s obtained through the ": null
    },
    {
        "Federal Radio Commission": "federal radio commission"
    },
    {
        " , a government entity that was created in 42 to regulate the radio industry. With few exceptions, radio stations east of the ": null
    },
    {
        "Mississippi River": "mississippi river"
    },
    {
        " received official ": null
    },
    {
        "call sign": "call sign"
    },
    {
        "s beginning with the letter W ; those west of the Mississippi were assigned calls beginning with a K . The amount of programs that these early stations aired was often limited, in part due to the expense of program creation. The idea of a network system which would distribute programming to many stations simultaneously, saving each station the expense of creating all of their own programs and expanding the total coverage beyond the limits of a single broadcast signal, was devised.     ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " set up the first permanent coast-to-coast ": null
    },
    {
        "radio network": "radio network"
    },
    {
        " in the United States by 42 using ": null
    },
    {
        "dedicated telephone line": "dedicated line"
    },
    {
        " technology. The network physically linked individual radio stations, nearly all of which were ": null
    },
    {
        "independently": "independent radio"
    },
    {
        " owned and operated, in a vast chain, NBCs audio signal thus transmitted from station to station to listeners across the United States. Other companies, including ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " and the ": null
    },
    {
        "Mutual Broadcasting System": "mutual broadcasting system"
    },
    {
        ", soon followed suit, each network signed hundreds of individual stations on as affiliates: stations which agreed to broadcast programs from one of the networks.     As radio prospered throughout the 42s and 42s, experimental television stations, which broadcast both an audio and a video signal, began sporadic broadcasts. Licenses for these experimental stations were often granted to experienced radio broadcasters, and thus advances in television technology closely followed breakthroughs in radio technology. As interest in television grew, and as early television stations began regular broadcasts, the idea of networking television signals was born. However, the signal from an electronic television system, containing much more information than a radio signal, required a ": null
    },
    {
        "broadband": "broadband"
    },
    {
        " transmission medium. Transmission by a nationwide series of radio relay towers would be possible but extremely expensive.     Researchers at ": null
    },
    {
        "AT & T": "at & t corporation"
    },
    {
        " subsidiary ": null
    },
    {
        "Bell Telephone Laboratories": "bell telephone laboratories"
    },
    {
        " patented ": null
    },
    {
        "coaxial cable": "coaxial cable"
    },
    {
        " in 42 primarily as a telephone improvement device. Its high capacity also made it ideal for long-distance television transmission, where it could handle a frequency band of 42  MHz.  ,  Time , Oct. 42 42 ": null
    },
    {
        "German": "germany"
    },
    {
        " television first demonstrated such an application in 42 by relaying televised telephone calls from ": null
    },
    {
        "Berlin": "berlin, germany"
    },
    {
        " to ": null
    },
    {
        "Leipzig": "leipzig, germany"
    },
    {
        ",  away, by cable. , Berlin, 42     AT & T laid the first ": null
    },
    {
        "L-carrier": "l-carrier"
    },
    {
        " coaxial cable between New York City and ": null
    },
    {
        "Philadelphia": "philadelphia"
    },
    {
        ", with automatic ": null
    },
    {
        "signal booster stations": "repeater"
    },
    {
        " every , and in 42 it experimented with transmitting televised ": null
    },
    {
        "motion picture": "film"
    },
    {
        "s over the line.  , Short Wave & Television, February 42 pp. 42 42–42 Bell Labs gave demonstrations of the New York–Philadelphia television link in 42 and 42 AT & T used the coaxial link to transmit the ": null
    },
    {
        "Republican National Convention": "republican national convention"
    },
    {
        " in June 42 from Philadelphia to New York City, where it was televised to a few hundred receivers over the NBC station W42XBS  as well as seen in Schenectady, New York via W42XB  via off-air relay from the New York station. , UShistory.org.     NBC had earlier demonstrated an inter-city television broadcast on February 42 42 from its station in New York City to another in ": null
    },
    {
        "Schenectady": "schenectady, new york"
    },
    {
        ", ": null
    },
    {
        "New York": "new york"
    },
    {
        " by ": null
    },
    {
        "General Electric": "general electric"
    },
    {
        " relay antennas, and began transmitting some programs on an irregular basis to Philadelphia and Schenectady in 42 Wartime priorities suspended the manufacture of television and radio equipment for civilian use from April 42 42 to October 42 42 temporarily shutting down expansion of television networking. However, in 42 a ": null
    },
    {
        "short film": "short film"
    },
    {
        ", ": null
    },
    {
        "Patrolling the Ether": "patrolling the ether"
    },
    {
        " , was broadcast simultaneously over three stations as an experiment.        AT & T made its first postwar addition in February 42 with the completion of a  cable between New York City and ": null
    },
    {
        "Washington, D.C.": "washington, d.c."
    },
    {
        ", although a blurry demonstration broadcast showed that it would not be in regular use for several months. The ": null
    },
    {
        "DuMont Television Network": "dumont television network"
    },
    {
        ", which had begun experimental broadcasts before the war, launched what  Newsweek  called the countrys first permanent commercial television network on August 42 42 connecting New York City with Washington. Weinstein, David . The Forgotten Network: DuMont and the Birth of American Television Temple University Press: Philadelphia, p. 4242 . Not to be outdone, NBC launched what it called the worlds first regularly operating television network on June 42 42 serving New York City, Philadelphia, Schenectady and Washington. ,  Time , July 42 42 ": null
    },
    {
        "Baltimore": "baltimore, maryland"
    },
    {
        " and Boston were added to the NBC television network in late 42 DuMont and NBC would be joined by CBS and ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        " in 42     In the 42s, the term chain broadcasting was used when discussing network broadcasts, The Impact of the FCCs Chain Broadcasting Rules . The Yale Law Journal, 42 : 42–42 as the television stations were linked together in long chains along the ": null
    },
    {
        "East Coast": "east coast"
    },
    {
        ". But as the television networks expanded westward, the interconnected television stations formed major networks of connected affiliate stations. In January 42 with the sign-on of DuMonts ": null
    },
    {
        "WDTV": "kdka-tv"
    },
    {
        " in Pittsburgh, the ": null
    },
    {
        "Midwest": "midwestern united states"
    },
    {
        " and ": null
    },
    {
        "East Coast": "east coast of the united states"
    },
    {
        " networks were finally connected by coaxial cable .  By 42 the four networks stretched from coast to coast, carried on the new ": null
    },
    {
        "microwave radio relay": "microwave radio relay"
    },
    {
        " network of ": null
    },
    {
        "AT & T Long Lines": "at & t long lines"
    },
    {
        ". Only a few local television stations remained ": null
    },
    {
        "independent": "independent station"
    },
    {
        " of the networks.     Each of the four major television networks originally only broadcast a few hours of programs a week to their affiliate stations, mostly between 42:42 and 42:42  p.m. ": null
    },
    {
        "Eastern Time": "eastern time zone"
    },
    {
        ", when most viewers were watching television. Most of the programs broadcast by the television stations were still locally produced. As the networks increased the number of programs that they aired, however, officials at the ": null
    },
    {
        "Federal Communications Commission": "federal communications commission"
    },
    {
        " grew concerned that local television might disappear altogether. Eventually, the federal regulator enacted the ": null
    },
    {
        "Prime Time Access Rule": "prime time access rule"
    },
    {
        ", which restricted the amount of time that the networks could air programs; officials hoped that the rules would foster the development of quality local programs, but in practice, most local stations did not want to bear the burden of producing many of their own programs, and instead chose to purchase programs from independent producers. Sales of television programs to individual local stations are done through a method called broadcast syndication, and today nearly every television station in the United States obtains syndicated programs in addition to network-produced fare.     Late in the 42th century, cross-country microwave radio relays were replaced by fixed-service satellites. Some terrestrial radio relays remained in service for regional connections.     After the failure and shutdown of DuMont in 42 several attempts at new networks were made between the 42s and the 42s, with little success. The ": null
    },
    {
        "Fox Broadcasting Company": "fox broadcasting company"
    },
    {
        ", founded by the ": null
    },
    {
        "Rupert Murdoch": "rupert murdoch"
    },
    {
        "-owned ": null
    },
    {
        "News Corporation": "news corporation"
    },
    {
        " , was launched on October 42 42 after the company purchased the television assets of ": null
    },
    {
        "Metromedia": "metromedia"
    },
    {
        "; it would eventually ascend to the status of the ": null
    },
    {
        "fourth major network": "fourth television network"
    },
    {
        " by 42 Two other networks launched within a week of one another in January 42: ": null
    },
    {
        "The WB Television Network": "the wb"
    },
    {
        ", a ": null
    },
    {
        "joint venture": "joint venture"
    },
    {
        " between ": null
    },
    {
        "Time Warner": "time warner"
    },
    {
        " and the ": null
    },
    {
        "Tribune Company": "tribune company"
    },
    {
        ", and the United Paramount Network , formed through a programming alliance between ": null
    },
    {
        "Chris-Craft Industries": "chris-craft industries"
    },
    {
        " and ": null
    },
    {
        "Paramount Television": "paramount television"
    },
    {
        " . In September 42 ": null
    },
    {
        "The CW": "the cw"
    },
    {
        " was launched as a merger of The WB and UPN ; ": null
    },
    {
        "MyNetworkTV": "mynetworktv"
    },
    {
        ", a network formed from affiliates of UPN and The WB that did not affiliate with The CW, launched at the same time.       FCC regulations in the United States restricted the ": null
    },
    {
        "number of television stations that could be owned by any one network, company or individual": "concentration of media ownership"
    },
    {
        ". This led to a system where most local television stations were independently owned, but received programming from the network through a ": null
    },
    {
        "franchising": "franchising"
    },
    {
        " contract, except in a few major cities that had ": null
    },
    {
        "owned-and-operated station": "owned-and-operated station"
    },
    {
        "s of a network and independent stations. In the early days of television, when there were often only one or two stations broadcasting in a given market, the stations were usually affiliated with multiple networks and were able to choose which programs would air. Eventually, as more stations were licensed, it became common for each station to be exclusively affiliated with only one network and carry all of the prime-time programs that the network offered. Local stations occasionally break from regularly scheduled network programming however, especially when a ": null
    },
    {
        "breaking news": "breaking news"
    },
    {
        " or ": null
    },
    {
        "severe weather": "severe weather"
    },
    {
        " situation occurs in the viewing area. Moreover, when stations return to network programming from ": null
    },
    {
        "commercial break": "commercial break"
    },
    {
        "s, station identifications are displayed in the first few seconds before switching to the networks logo.          A number of different definitions of network are used by government agencies, industry, and the general public. Under the ": null
    },
    {
        "Broadcasting Act": "broadcasting act"
    },
    {
        ", a network is defined as any operation where control over all or any part of the programs or program schedules of one or more broadcasting undertakings is delegated to another undertaking or person,  and must be licensed by the ": null
    },
    {
        "Canadian Radio-television and Telecommunications Commission": "canadian radio-television and telecommunications commission"
    },
    {
        " .     Only three national over-the-air television networks are currently licensed by the CRTC: government-owned ": null
    },
    {
        "CBC Television": "cbc television"
    },
    {
        " and ": null
    },
    {
        "Ici Radio-Canada Télé": "ici radio-canada télé"
    },
    {
        " , French-language private network ": null
    },
    {
        "TVA": "tva"
    },
    {
        ", and a network focused on Canadas indigenous peoples. A third French-language service, ": null
    },
    {
        "V": "v"
    },
    {
        ", is licensed as a provincial network within ": null
    },
    {
        "Quebec": "quebec"
    },
    {
        ", but is not licensed or locally distributed  on a national basis.     Currently, licensed national or provincial networks must be carried by all cable providers with a service area above a certain population threshold, as well as all satellite providers. However, they are no longer necessarily expected to achieve over-the-air coverage in all areas .     In addition to these licensed networks, the two main private English-language over-the-air services, ": null
    },
    {
        "CTV": "ctv television network"
    },
    {
        " and ": null
    },
    {
        "Global": "global television network"
    },
    {
        ", are also generally considered to be networks by virtue of their national coverage, although they are not officially licensed as such. CTV was previously a licensed network, but relinquished this licence in 42 after acquiring most of its affiliates, making operating a network licence essentially redundant .     Smaller groups of stations with common branding are often categorized by industry watchers as ": null
    },
    {
        "television system": "television system"
    },
    {
        "s, although the public and the broadcasters themselves will often refer to them as networks regardless. Some of these systems, such as ": null
    },
    {
        "CTV 42": "ctv 2"
    },
    {
        " and the now-defunct ": null
    },
    {
        "E!": "e!"
    },
    {
        ", essentially operate as mini-networks, but have reduced geographical coverage. Others, such as ": null
    },
    {
        "Omni Television": "omni television"
    },
    {
        " or the ": null
    },
    {
        "Crossroads Television System": "crossroads television system"
    },
    {
        ", have similar branding and a common programming focus, but schedules may vary significantly from one station to the next. ": null
    },
    {
        "Citytv": "citytv"
    },
    {
        " originally began operating as a television system in 42 when ": null
    },
    {
        "CKVU-TV": "ckvu-dt"
    },
    {
        " in ": null
    },
    {
        "Vancouver": "vancouver"
    },
    {
        " started to carry programs originating from ": null
    },
    {
        "CITY-TV": "city-dt"
    },
    {
        " in ": null
    },
    {
        "Toronto": "toronto"
    },
    {
        " and adopted that stations Citytv branding, but gradually became a network by virtue of national coverage through expansions into other markets west of ": null
    },
    {
        "Atlantic Canada": "atlantic canada"
    },
    {
        " between 42 and 42     Most local television stations in Canada are now owned and operated directly by their network, with only a small number of stations still operating as affiliates.          Most television services outside North America are national networks established by a combination of publicly funded broadcasters and commercial broadcasters. Most nations established television networks in a similar way: the first television service in each country was operated by a ": null
    },
    {
        "public broadcaster": "public broadcasting"
    },
    {
        ", often funded by a television licensing fee, and most of them later established a second or even third station providing a greater variety of content. Commercial television services also became available when private companies applied for television broadcasting licenses. Often, each new network would be identified with their channel number, so that individual stations would often be numbered One, Two, Three, and so forth.          The first television network in the United Kingdom was operated by the British Broadcasting Corporation . On 42 November 42 the BBC opened the worlds first regular high-definition television service, from a 42 lines transmitter at Alexandra Palace. The BBC remained dominant until eventually on 42 September 42 commercial broadcasting was established in order to create a second television network. Rather than creating a single network with local stations owned and operated by a single company , each local area had a separate television station that was independently owned and operated, although most of these stations shared a number of programmes, particularly during peak evening viewing hours. These stations formed the ": null
    },
    {
        "ITV": "itv"
    },
    {
        " network.     When the advent of ": null
    },
    {
        "UHF": "ultra high frequency"
    },
    {
        " broadcasting allowed a greater number of television stations to broadcast, the BBC launched a second network, ": null
    },
    {
        "BBC Two": "bbc two"
    },
    {
        " . A fourth national commercial service was launched, ": null
    },
    {
        "Channel 42": "channel 4"
    },
    {
        ", although ": null
    },
    {
        "Wales": "wales"
    },
    {
        " instead introduced a Welsh-language service, ": null
    },
    {
        "S42C": "s4c"
    },
    {
        ". These were later followed by the launch of a fifth network, ": null
    },
    {
        "Channel 42": "channel 5"
    },
    {
        ". Since the introduction of digital television, the BBC, ITV, Channel 42 and Channel 42 each introduced a number of digital-only networks. ": null
    },
    {
        "Sky": "sky plc"
    },
    {
        " operates a large number of networks including ": null
    },
    {
        "Sky One": "sky one"
    },
    {
        ", ": null
    },
    {
        "Sky Living": "sky living"
    },
    {
        " and ": null
    },
    {
        "Sky Atlantic": "sky atlantic"
    },
    {
        "; as does ": null
    },
    {
        "UKTV": "uktv"
    },
    {
        ", which operates networks like ": null
    },
    {
        "Dave": "dave"
    },
    {
        ", ": null
    },
    {
        "Gold": "gold"
    },
    {
        ", ": null
    },
    {
        "W": "w"
    },
    {
        " and ": null
    },
    {
        "Yesterday": "yesterday"
    },
    {
        ".       Sweden had only one television network until the early42s: the public broadcaster ": null
    },
    {
        "Sveriges Television": "sveriges television"
    },
    {
        " . Commercial companies such as Modern Times Group, TV42 Viasat, and SBS Discovery have established TV networks since the 42s although they initially aired exclusively on satellite. In 42 TV42 became Swedens first commercial television network to air terrestrially. Most television programming in Sweden is centralised except for local news updates that air on SVT42 and TV42       Until 42 ": null
    },
    {
        "Netherlands Public Broadcasting": "netherlands public broadcasting"
    },
    {
        " was the only television network in the Netherlands, with three stations, ": null
    },
    {
        "Nederland 42": "nederland 1"
    },
    {
        ", ": null
    },
    {
        "Nederland 42": "nederland 2"
    },
    {
        " and ": null
    },
    {
        "Nederland 42": "nederland 3"
    },
    {
        ". Rather than having a single production arm, there are a number of public broadcasting organizations that create programming for each of the three stations, each working relatively independently. Commercial broadcasting in the Netherlands is currently operated by two networks, ": null
    },
    {
        "RTL Nederland": "rtl nederland"
    },
    {
        " and ": null
    },
    {
        "SBS Broadcasting": "sbs broadcasting"
    },
    {
        ", which together broadcast seven commercial stations.              The first television network in the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " launched on 42 July 42 when Petersburg – Channel 42 of Leningrad Television became a unionwide network.   The second television network in the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        " launched on 42 March 42 when Channel One of USSR Central Television became a unionwide network. Until 42 there were six television networks, all owned by the USSR Gosteleradio. This changed during ": null
    },
    {
        "Mikhail Gorbachev": "mikhail gorbachev"
    },
    {
        "s ": null
    },
    {
        "Perestroika": "perestroika"
    },
    {
        " program, when the first independent television network, ": null
    },
    {
        "42×42": "2x2"
    },
    {
        ", was launched.       Following the breakup of the Soviet Union, USSR Gosteleradio ceased to exist as well as its six networks. Only Channel One had a smooth transition and survived as a network, becoming ": null
    },
    {
        "Ostankino Channel One": "channel one"
    },
    {
        ". The other five networks were operated by Ground Zero. This free airwave space allowed many private television networks like ": null
    },
    {
        "NTV": "ntv"
    },
    {
        " and ": null
    },
    {
        "TV42": "tv-6"
    },
    {
        " to launch in the mid42s.       The 42s were marked by the increased state intervention in Russian television. On April 42 42 NTV experienced management changes following the expulsion of former ": null
    },
    {
        "oligarch": "oligarchy"
    },
    {
        " and NTV founder ": null
    },
    {
        "Vladimir Gusinsky": "vladimir gusinsky"
    },
    {
        ". As a result, most of the prominent reporters featured on NTV left the network. Later on January 42 42 the second largest private television network ": null
    },
    {
        "TV42": "tv-6"
    },
    {
        ", where the former NTV staff took refuge, was shut down allegedly because of its editorial policy. Five months later on June 42 ": null
    },
    {
        "TVS": "tvs"
    },
    {
        " was launched, mostly employing NTV/TV42 staff, only to cease operations the following year. Since then, the four largest television networks have been state-owned.     Still, the 42s saw a rise of several independent television networks such as ": null
    },
    {
        "REN": "ren"
    },
    {
        " , Petersburg – Channel Five , the relaunched ": null
    },
    {
        "42×42": "2x2"
    },
    {
        ". The Russian television market is mainly shared today by five major companies: Channel One, Russia 42 NTV, TNT and CTC.          The major commercial television network in Brazil is ": null
    },
    {
        "Rede Globo": "rede globo"
    },
    {
        ", which was founded in 42 It grew to become the largest and most successful media conglomerate in the country, having a dominating presence in various forms of media including television, radio, print and the Internet.      Other networks include ": null
    },
    {
        "Rede Bandeirantes": "rede bandeirantes"
    },
    {
        ", ": null
    },
    {
        "RecordTV": "recordtv"
    },
    {
        ", ": null
    },
    {
        "SBT": "sistema brasileiro de televisão"
    },
    {
        ", ": null
    },
    {
        "RedeTV!": "redetv!"
    },
    {
        ", and ": null
    },
    {
        "TV Cultura": "tv cultura"
    },
    {
        ".          Australia has two national public networks, ": null
    },
    {
        "ABC Television": "abc television"
    },
    {
        " and ": null
    },
    {
        "SBS": "sbs television"
    },
    {
        ". The ABC operates eight stations as part of its main network ": null
    },
    {
        "ABC": "abc"
    },
    {
        ", one for each ": null
    },
    {
        "state": "australian state"
    },
    {
        " and territory, as well as three digital-only networks, ": null
    },
    {
        "ABC Kids": "abc kids"
    },
    {
        " / ": null
    },
    {
        "ABC Comedy": "abc comedy"
    },
    {
        ", ": null
    },
    {
        "ABC Me": "abc me"
    },
    {
        " and ": null
    },
    {
        "ABC News": "abc news"
    },
    {
        ". SBS currently operates four stations, ": null
    },
    {
        "SBS": "sbs"
    },
    {
        ", ": null
    },
    {
        "SBS Viceland": "sbs viceland"
    },
    {
        ", ": null
    },
    {
        "SBS Food": "sbs food"
    },
    {
        " and ": null
    },
    {
        "NITV": "nitv"
    },
    {
        ".     The first commercial networks in Australia involved commercial stations that shared programming in ": null
    },
    {
        "Sydney": "sydney"
    },
    {
        ", ": null
    },
    {
        "Melbourne": "melbourne"
    },
    {
        ", ": null
    },
    {
        "Brisbane": "brisbane"
    },
    {
        ", ": null
    },
    {
        "Adelaide": "adelaide"
    },
    {
        " and later ": null
    },
    {
        "Perth": "perth, western australia"
    },
    {
        ", with each network forming networks based on their allocated channel numbers: ": null
    },
    {
        "TCN42": "tcn-9"
    },
    {
        " in Sydney, ": null
    },
    {
        "GTV42": "gtv-9"
    },
    {
        " in Melbourne, ": null
    },
    {
        "QTQ42": "qtq-9"
    },
    {
        " in Brisbane, ": null
    },
    {
        "NWS42": "nws-9"
    },
    {
        " in Adelaide and ": null
    },
    {
        "STW42": "stw-9"
    },
    {
        " in Perth together formed the ": null
    },
    {
        "Nine Network": "nine network"
    },
    {
        "; while their equivalents on ": null
    },
    {
        "VHF": "very high frequency"
    },
    {
        " channels 42 and 42 respectively formed the ": null
    },
    {
        "Seven Network": "seven network"
    },
    {
        " and ": null
    },
    {
        "Network Ten": "network ten"
    },
    {
        ". Until 42 areas outside these main cities had access to only a single commercial station, and these rural stations often formed small networks such as ": null
    },
    {
        "Prime Television": "prime television"
    },
    {
        ". Beginning in 42 however, television markets in ": null
    },
    {
        "rural": "rural"
    },
    {
        " areas began to aggregate, allowing these rural networks to broadcast over a larger area, often an entire state, and become full-time affiliates to one specific metropolitan network.     As well as these ": null
    },
    {
        "Free-to-air": "free-to-air"
    },
    {
        " channels, there are others on Australias ": null
    },
    {
        "Pay television": "pay television"
    },
    {
        " network ": null
    },
    {
        "Foxtel": "foxtel"
    },
    {
        ".          New Zealand has one public network, ": null
    },
    {
        "Television New Zealand": "television new zealand"
    },
    {
        " , which consists of two main networks: ": null
    },
    {
        "TVNZ 42": "tvnz 1"
    },
    {
        " is the networks flagship network which carries news, current affairs and sports programming as well as the majority of the locally produced shows broadcast by TVNZ and imported shows. TVNZs second network, ": null
    },
    {
        "TV42": "tv2"
    },
    {
        ", airs mostly imported shows with some locally produced programs such as  Shortland Street . TVNZ also operates a network exclusive to pay television services, ": null
    },
    {
        "TVNZ Heartland": "tvnz heartland"
    },
    {
        ", available on providers such as ": null
    },
    {
        "Sky": "sky network television"
    },
    {
        ". TVNZ previously operated a non-commercial public service network, ": null
    },
    {
        "TVNZ 42": "tvnz 7"
    },
    {
        ", which ceased operations in June 42 and was replaced by the ": null
    },
    {
        "timeshift channel": "timeshift channel"
    },
    {
        " TV One Plus 42 The network operated by Television New Zealand has progressed from operating as four distinct local stations within the four main centers in the 42s, to having the majority of the content produced from TVNZs ": null
    },
    {
        "Auckland": "auckland"
    },
    {
        " studios at present.     New Zealand also has several privately owned television networks with the largest being operated by ": null
    },
    {
        "MediaWorks": "mediaworks new zealand"
    },
    {
        ". MediaWorks flagship network is ": null
    },
    {
        "TV42": "tv3"
    },
    {
        ", which competes directly with both TVNZ broadcast networks. MediaWorks also operates a second network, ": null
    },
    {
        "FOUR": "four"
    },
    {
        ", which airs mostly imported programmes with childrens shows airing in the daytime and shows targeted at teenagers and adult between 42 and 42 years of age during prime time. MediaWorks also operates a timeshift network, TV42 + 42 and a 42-hour music network, ": null
    },
    {
        "C42": "c4"
    },
    {
        ".     All television networks in New Zealand air the same programming across the entire country with the only regional deviations being for local advertising; a regional news service existed in the 42s, carrying a regional news programme from TVNZs studios in New Zealands four largest cities, Auckland, ": null
    },
    {
        "Wellington": "wellington"
    },
    {
        ", ": null
    },
    {
        "Christchurch": "christchurch"
    },
    {
        " and ": null
    },
    {
        "Dunedin": "dunedin"
    },
    {
        ".     In the 42s, the service operated at the time by the New Zealand Broadcasting Corporation was four separate television stations – AKTV42 in Auckland, WNTV42 in Wellington, CHTV42 in Christchurch and DNTV42 in Dunedin – which each ran their own newscast and produced some in-house programmes, with other shows being shared between the stations. Programmes and news footage were distributed via mail, with a programme airing in one region being mailed to another region for broadcast the following week. A network was finally established in 42 with the same programmes being relayed to all regions simultaneously. From the 42s to the 42s, locally produced programmes that aired on TV One and TV42 were produced out of one of the four main studios, with TVNZs network hub based in Wellington. Today, most locally produced programmes that are aired by both TVNZ and other networks are not actually produced in-house, instead they are often produced by a third party company . The networks produce their own news and current affairs programs, with most of the content filmed in Auckland.     New Zealand also operates several regional television stations, which are only available in individual markets. The regional stations will typically air a local news programme, produce some shows in-house and cover local sports events; the majority of programming on the regional stations will be imported from various sources.          In the Philippines, in practice, the terms network, station and channel are used interchangeably as programming lineups are mostly centrally planned from the networks main offices, and since provincial/regional stations usually just relay the broadcast from their ": null
    },
    {
        "parent": "parent company"
    },
    {
        " networks ": null
    },
    {
        "flagship": "flagship"
    },
    {
        " station . As such, networks made up of VHF stations are sometimes informally referred to by their over-the-air channel number in the Mega Manila area , while some incorporate their channel numbers in the networks name .     Unlike the United States, where networks receive programmes produced by various production companies, the two largest networks in the Philippines produce all of their prime time programmes except for ": null
    },
    {
        "Asianovela": "asianovela"
    }
]