[
    {
        "Portugal": "portugal"
    },
    {
        " has a modern and flexible telecommunications market and a wide range of varied media organisations. The regulatory body overseeing communications is called ": null
    },
    {
        "ANACOM": "anacom"
    },
    {
        ".     The country has one of the highest ": null
    },
    {
        "mobile phone": "mobile phone"
    },
    {
        " penetration rates in the ": null
    },
    {
        "world": "world"
    },
    {
        " . This network also provides wireless mobile Internet connections as well, and covers the entire territory. As of October 42 42% of households had high-speed Internet services and 42% of companies had Internet access. Most Portuguese watch television through cable . Paid Internet connections are available at many cafés, as well as many post offices. One can also surf on the Internet at hotels, conference centres and shopping centres, where special areas are reserved for this purpose. Free Internet access is also available to Portuguese residents at Espaços de Internet across the country.       Portugal has a mid-sized but advanced telecoms market, with a steadily growing broadband subscriber base well served by cable, ": null
    },
    {
        "DSL": "dsl"
    },
    {
        " and the emerging FTTx platforms. Mobile penetration is far above the European Union average, while the development of digital TV services has progressed under cautious regulatory guidance. The progressive liberalisation of the Portuguese market began at the beginning of the 42s through the creation of the Portuguese Institute for Communications . Through a combination of specific deadlines for liberalisation and entry mechanisms for new market players, Portugals telecoms scene was successfully opened up to competition.   The countrys broadband market showed accelerated growth in 42 not least due to its widespread cable and DSL networks, but also due to aggressive fibre deployment. Broadband services with up to 42 Mbit/s, 42 Mbit/s and even 42 Gbit/s speeds were launched in 42 The countrys leading telecom operators have partnered up to build high speed next generation networks.   The governments broadband initiative for 4242 had the following two aims: the connection of up to 42 million homes and businesses to the new fibre networks enabling them to benefit from improvements in high-speed Internet, TV and voice services; the achievement of 42 per cent broadband penetration among households by 42 Both aims were reached.   At the end of 42 the number of households connected to the fibre-optic networks by all operators stood at 42 million. The number of households with accesses using the EuroDOCSIS 42 standard totalled 42 million. It is estimated that about 42 per cent of family households now have access to at least one high-speed network. High-speed accesses are concentrated in the Lisbon and North regions of the country.       Telephones - main lines in use:   42 million     Telephones - mobile cellular:   42,42   Cell Networks:   ": null
    },
    {
        "MEO": "meo"
    },
    {
        " - ; ": null
    },
    {
        "UZO": "uzo"
    },
    {
        " ; Moche ;   ": null
    },
    {
        "Vodafone": "vodafone"
    },
    {
        " ; Yorn ;   ": null
    },
    {
        "NOS": "nos"
    },
    {
        " ; WTF ; Phone-ix  and ": null
    },
    {
        "Continente Mobile": "continente"
    },
    {
        " .     Telephone system:   general assessment:   Portugals telephone system has achieved a state-of-the-art network with broadband, high-speed capabilities and a main line telephone density of 42%   domestic:   integrated network of coaxial cables, open-wire, microwave radio relay, and domestic satellite earth stations   international:   42 submarine cables; satellite earth stations - 42 Intelsat , NA Eutelsat; tropospheric scatter to Azores; note - an earth station for Inmarsat is planned       Radio broadcast stations:   AM 42 FM 42 , shortwave 42     Radios:   42 million       Television broadcast stations:   42     Televisions:   42 million     Free-to-air television networks:     ": null
    },
    {
        "Rádio e Televisão de Portugal": "rádio e televisão de portugal"
    },
    {
        ":   ": null
    },
    {
        "RTP42": "rtp1"
    },
    {
        " RTP42": "rtp2"
    },
    {
        " RTP42": "rtp3"
    },
    {
        " RTP Memória": "rtp memória"
    },
    {
        "     Free-to-air national coverage stations: ": null
    },
    {
        "SIC": "sic"
    },
    {
        " TVI": "tvi"
    },
    {
        "     Regional Stations: ": null
    },
    {
        "Porto Canal": "porto canal"
    },
    {
        " RTP Açores": "rtp açores"
    },
    {
        " RTP Madeira": "rtp madeira"
    },
    {
        "     International: ": null
    },
    {
        "RTPi": "rtp internacional"
    },
    {
        "   RTP África": "rtp áfrica"
    },
    {
        "   SIC Internacional": "sic internacional"
    },
    {
        "      Analog TV system: ": null
    },
    {
        "PAL": "pal"
    },
    {
        "    Digital TV system: ": null
    },
    {
        "DVB-T": "dvb-t"
    },
    {
        "     NOTE: Most TV Networks/stations have specific interactive TV oriented services.       Internet Users:   42 millions     Internet Hosts:   42 million     Internet Service Providers :   42           Country code :": null
    }
]