[
    {
        "Telecommunications in Saint Pierre and Miquelon include telephone, radio, television, and internet usage.           Telephone s - main lines in use:   4,800     Telephones - mobile cellular:   0        Telephone system:   domestic:   NA   international:   radiotelephone communication with most countries in the world; 1 earth station in ": null
    },
    {
        "French": "france"
    },
    {
        " domestic satellite system     The ": null
    },
    {
        "Country calling code": "country calling code"
    },
    {
        " for ": null
    },
    {
        "Saint Pierre and Miquelon": "saint pierre and miquelon"
    },
    {
        " is 508.        Radio broadcast stations:   AM 0 , ": null
    },
    {
        "FM": "fm broadcasting"
    },
    {
        " 4, shortwave 0     Out of the four radio stations in St. Pierre et Miquelon, three are on St. Pierre itself and one on Miquelon. Three of these stations belong to ": null
    },
    {
        "RFO": "réseau france outre-mer"
    },
    {
        " - two on St. Pierre and one on Miquelon. In addition to broadcasting local and RFO programmes, these RFO stations broadcast the ": null
    },
    {
        "France-Inter": "france inter"
    },
    {
        " radio service at night. The fourth radio station, Radio Atlantique, mostly relays ": null
    },
    {
        "Radio France Internationale": "radio france internationale"
    },
    {
        ".     Radios:   4,000           Television broadcast stations:   St. Pierre et Miquelon has two television stations owned and operated by ": null
    },
    {
        "Réseau France Outre-mer": "réseau france outre-mer"
    },
    {
        " :     Télé St. Pierre et Miquelon on Ch. 8, with a repeater on Ch. 31   Tempo on Ch. 6     RFO features a variety of programs from France, as well as local news and sports. Although the stations programming otherwise derives entirely from France, Télé St. Pierre et Miquelon broadcasts the Atlantic Canadian edition of  Le Téléjournal  from ": null
    },
    {
        "CBAFT-DT": "cbaft-dt"
    },
    {
        " daily at midnight.     Before digital terrestrial television, RFO was broadcasting using the ": null
    },
    {
        "SECAM": "secam"
    },
    {
        "-K1 colour system as designed for French overseas territories. From 2010, the national digital terrestrial television system broadcasts its service to Saint Pierre and Miquelon . Unlike SPM Telecoms cable service, DTT offers only the overseas public network ": null
    },
    {
        "La 1 re ": "la première"
    },
    {
        ", the six ": null
    },
    {
        "France Télévisions": "france télévisions"
    },
    {
        " metropolitan public channels, the public news channel ": null
    },
    {
        "France Info": "france info"
    },
    {
        ", and the french-german public channel ": null
    },
    {
        "Arte": "arte"
    },
    {
        ".      The local cable system, operated by SPM Telecom, also offers an array of broadcast and specialty channels from Canada and the US in SECAM, converted from NTSC.          Television s:   4,000        Internet service providers :  Country code : ": null
    },
    {
        ".pm": ".pm"
    }
]