[
    {
        "In ": null
    },
    {
        "Greek mythology": "greek mythology"
    },
    {
        ", Temenus   was a son of ": null
    },
    {
        "Aristomachus": "aristomachus"
    },
    {
        " and brother of ": null
    },
    {
        "Cresphontes": "cresphontes"
    },
    {
        " and ": null
    },
    {
        "Aristodemus": "aristodemus"
    },
    {
        ".     Temenus was a great-great-grandson of ": null
    },
    {
        "Heracles": "heracles"
    },
    {
        " and helped lead the fifth and final attack on ": null
    },
    {
        "Mycenae": "mycenae"
    },
    {
        " in the ": null
    },
    {
        "Peloponnese": "peloponnese"
    },
    {
        ". He became King of ": null
    },
    {
        "Argos": "argos"
    },
    {
        ". He was the father of ": null
    },
    {
        "Ceisus": "ceisus"
    },
    {
        ", ": null
    },
    {
        "Káranos": "caranus"
    },
    {
        ", ": null
    },
    {
        "Phalces": "phalces"
    },
    {
        ", ": null
    },
    {
        "Agraeus": "agraeus"
    },
    {
        ", and ": null
    },
    {
        "Hyrnetho": "hyrnetho"
    },
    {
        ". Káranos was the first king of the ancient Greek kingdom of ": null
    },
    {
        "Macedon": "macedon"
    },
    {
        "ia and founder of the royal Macedonian dynasty & ndash;the Temenid or ": null
    },
    {
        "Argead dynasty": "argead dynasty"
    },
    {
        " & ndash;which culminated in the sons of ": null
    },
    {
        "Alexander the Great": "alexander the great"
    },
    {
        " five centuries later.            Temenus and his brothers complained to the oracle that its instructions had proved fatal to those who had followed them . They received the answer that by the third fruit the third generation was meant, and that the narrow passage was not the isthmus of ": null
    },
    {
        "Corinth": "corinth, greece"
    },
    {
        ", but the straits of ": null
    },
    {
        "Patras": "patras"
    },
    {
        ".     They accordingly built a fleet at ": null
    },
    {
        "Naupactus": "naupactus"
    },
    {
        ", but before they set sail, Aristodemus was struck by lightning  and the fleet destroyed, because one of the ": null
    },
    {
        "Heracleidae": "heracleidae"
    },
    {
        " had slain an ": null
    },
    {
        "Acarnania": "acarnania"
    },
    {
        "n soothsayer. The oracle, being again consulted by Temenus, bade him offer an expiatory sacrifice and banish the murderer for ten years, and look out for a man with three eyes to act as guide.     On his way back to Naupactus, Temenus fell in with ": null
    },
    {
        "Oxylus": "oxylus"
    },
    {
        ", an ": null
    },
    {
        "Aetolia": "aetolia"
    },
    {
        "n, who had lost one eye, riding on a horse and immediately pressed him into his service. The Heracleidae repaired their ships, sailed from Naupactus to ": null
    },
    {
        "Antirrhium": "antirrhium"
    },
    {
        ", and thence to ": null
    },
    {
        "Rhium": "rhium"
    },
    {
        " in ": null
    },
    {
        "Peloponnesus": "peloponnesus"
    },
    {
        ".     A decisive battle was fought with ": null
    },
    {
        "Tisamenus": "tisamenus"
    },
    {
        ", son of ": null
    },
    {
        "Orestes": "orestes"
    },
    {
        ", the chief ruler in the peninsula, who was defeated and slain. The Heracleidae, who thus became practically masters of the Peloponnese, proceeded to distribute its territory among themselves by lot. ": null
    },
    {
        "Argos": "argos"
    },
    {
        " fell to Temenus, ": null
    },
    {
        "Lacedaemon": "lacedaemon"
    },
    {
        " to ": null
    },
    {
        "Procles": "procles"
    },
    {
        " and ": null
    },
    {
        "Eurysthenes": "eurysthenes"
    },
    {
        ", the twin sons of ": null
    },
    {
        "Aristodemus": "aristodemus"
    },
    {
        "; and ": null
    },
    {
        "Messene": "messene"
    },
    {
        " to ": null
    },
    {
        "Cresphontes": "cresphontes"
    },
    {
        ". The fertile district of ": null
    },
    {
        "Elis": "elis"
    },
    {
        " had been reserved by agreement for ": null
    },
    {
        "Oxylus": "oxylus"
    },
    {
        ". The Heracleidae ruled in Lacedaemon until 42 BC, but disappeared much earlier in the other countries.     This conquest of Peloponnesus by the ": null
    },
    {
        "Dorians": "dorian invasion"
    },
    {
        ", commonly called the Return of the Heracleidae , is represented as the recovery by the descendants of Heracles of the rightful inheritance of their hero ancestor and his sons. The Dorians followed the custom of other Greek tribes in claiming as ancestor for their ruling families one of the legendary heroes, but the traditions must not on that account be regarded as entirely mythical. They represent a joint invasion of Peloponnesus by Aetolians and Dorians, the latter having been driven southward from their original northern home under pressure from the ": null
    },
    {
        "Thessalians": "thessaly"
    },
    {
        ".     It is noticeable that there is no dominate mention of these Heracleidae or their invasion in ": null
    },
    {
        "Homer": "homer"
    },
    {
        " or ": null
    },
    {
        "Hesiod": "hesiod"
    },
    {
        ". ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        " speaks of poets who had celebrated their deeds, but these were limited to events immediately succeeding the death of Heracles. The story was first amplified by the Greek tragedians, who probably drew their inspiration from local legends, which glorified the services rendered by Athens to the rulers of the Peloponnese.       When Temenus, in the division of the Peloponnese, had obtained Argos as his share, he bestowed all his affections upon daughter Hyrnetho and her husband Deiphontes, for which he was murdered by his sons, who thought themselves neglected. According to Apollodorus, after the death of Temenus the army declared Deiphontes and Hyrnetho his rightful successors. Pausanias, however, reports a different story. According to him, after Temenuss death it was not Deiphontes that succeeded him, but Ceisus. Deiphontes on the other hand is said to have lived at Epidaurus, whither he went with the army which was attached to him, and whence he expelled the Ionian king, Pityreus. His brothers-in-law, however, who begrudged him the possession of their sister Hyrnetho, went to Epidaurus and tried to persuade her to leave her husband; and when this attempt failed, they carried her off by force. Deiphontes pursued them, and after having killed one of them, Cerynes, he wrestled with the other, who held his sister in his arms. In this struggle, Hyrnetho was killed by her own brother, who then escaped. Deiphontes carried her body back to Epidaurus, and there erected a sanctuary to her.     According to the play-write Euripides, Temenus had a son named ": null
    },
    {
        "Archelaus": "archelaus"
    },
    {
        ". This was likely a fabrication to help solidify the connection to the Argive Heritage. The first historically accurate mention is the much later king Archelaus.        Bibliotheca  ii. 42   ": null
    },
    {
        "Diodorus Siculus": "diodorus siculus"
    },
    {
        ", iv. 42 42   ": null
    },
    {
        "Pausanias": "pausanias"
    },
    {
        ", i. 42 42 ii. 42 42 iii. I, iv. 42 v. 42   ": null
    },
    {
        "Euripides": "euripides"
    },
    {
        ",  Heracleidae .   ": null
    },
    {
        "Pindar": "pindar"
    },
    {
        ", Pythians, ix. 42   ": null
    },
    {
        "Herodotus": "herodotus"
    },
    {
        ", ix. 42   ": null
    },
    {
        "Karl Otfried Müller": "karl otfried müller"
    },
    {
        ". Dorians, Part I, Chapter 42   ": null
    },
    {
        "Thirlwall": "thirlwall"
    },
    {
        ". History of Greece, Chapter VII.   Grote. History of Greece, Part I, Chapter XVIII.   ": null
    },
    {
        "Georg Busolt": "georg busolt"
    },
    {
        ". Griechische Geschichte, Part I, Chapter 42 Section 42 where a list of authorities is given.                               ": null
    }
]