[
    {
        "     The Temple of Set is an ": null
    },
    {
        "occult": "occultism"
    },
    {
        " initiatory order": "initiatory order"
    },
    {
        " founded in 42 A ": null
    },
    {
        "new religious movement": "new religious movement"
    },
    {
        " and form of ": null
    },
    {
        "Western esotericism": "western esotericism"
    },
    {
        ", the Temple espouses a religion known as Setianism, whose practitioners are called Setians. This is sometimes identified as a form of ": null
    },
    {
        "Satanism": "satanism"
    },
    {
        ", although this term is not often embraced by Setians and is contested by some academics.       The Temple was established in the United States in 42 by Michael Aquino, an American ": null
    },
    {
        "political scientist": "political science"
    },
    {
        ", military officer, and a high-ranking member of ": null
    },
    {
        "Anton LaVey": "anton lavey"
    },
    {
        "s ": null
    },
    {
        "Church of Satan": "church of satan"
    },
    {
        ". Dissatisfied with the direction in which LaVey was taking the Church, Aquino resigned and & ndash; according to his own claim & ndash; embarked on a ritual to invoke ": null
    },
    {
        "Satan": "satan"
    },
    {
        ", who revealed to him a sacred text called The Book of Coming Forth by Night. According to Aquino, in this work Satan revealed his true name to be that of the deity ": null
    },
    {
        "Set": "set"
    },
    {
        ", which had been the name used by his followers in ": null
    },
    {
        "ancient Egypt": "ancient egyptian religion"
    },
    {
        ". Aquino was joined in establishing the Temple by a number of other dissatisfied members of LaVeys Church, and soon various Setian groups were established across the United States.       Setians believe that Set is the one real god and that he has aided humanity by giving them a questioning intellect, the Black Flame , which distinguishes them from other animal species. Set is held in high esteem as a teacher whose example is to be emulated but he is not worshipped as a deity. Highly individualistic in basis, the Temple promotes the idea that practitioners should seek ": null
    },
    {
        "self-deification": "self-deification"
    },
    {
        " and thus attain an immortality of consciousness.   Setians believe in the existence of ": null
    },
    {
        "magic": "magic modern western occultism"
    },
    {
        " as a force which can be manipulated through ritual, however the nature of these rituals is not prescribed by the Temple. Specifically, Aquino described Setian practices as ": null
    },
    {
        "black magic": "black magic"
    },
    {
        " , a term which he defines idiosyncratically.       Following initiation into the Temple, a Setian can proceed along a series of six degrees, each of which requires greater responsibilities to the group; as a result, most members remain in the first two degrees. Governed by a high priest or high priestess and a wider Council of Nine, the Temple is also divided into groups known as pylons, through which Setians can meet or correspond in order to advance their magical work in a particular area. Pylons of the Temple are now present in the United States, Australia, and Europe, with estimates placing the Temples membership between 42 and 42         The Temple of Set is a ": null
    },
    {
        "new religious movement": "new religious movement"
    },
    {
        ", and draws upon earlier forms of ": null
    },
    {
        "Western esotericism": "western esotericism"
    },
    {
        ". Among academic scholars of ": null
    },
    {
        "religious studies": "religious studies"
    },
    {
        ", there has been some debate as to whether the Temple of Set can be characterised as Satanism or not. The religious studies scholars Asbjorn Dyrendal, James R. Lewis, and Jesper Aa. Petersen believed that it was apt to consider the Temple of Set to be a Satanic group despite its reluctance to use the term Satanism because of its genealogical link to other Satanic groups and its continuing use of many elements of satanic mythology . Similarly, the sociologist of religion ": null
    },
    {
        "Massimo Introvigne": "massimo introvigne"
    },
    {
        " regarded it as Satanist because of its historical origins as a breakaway from the ": null
    },
    {
        "Church of Satan": "church of satan"
    },
    {
        " rather than because of its beliefs or practices. Conversely, the scholar Kennet Granholm argued that it should not be considered a form of Satanism because it does not place an emphasis on the figure of Satan. Granholm nevertheless acknowledged that it was an actor in the Satanic ": null
    },
    {
        "milieu": "social environment"
    },
    {
        " and part of the wider ": null
    },
    {
        "Left-Hand Path group": "left-hand path and right-hand path"
    },
    {
        " of esoteric traditions. He suggested that it could also be seen as a form of Post-Satanism , thereby continuing to reflect its historical origins within religious Satanism.     According to Introvigne, the Temple of Set is a small but significant part of the Satanic subculture.   The Temple of Set is far more rooted in esoteric ideas than the Church of Satan had been. It has thus been termed Esoteric Satanism , a term used to contrast it with the Rational Satanism found in ": null
    },
    {
        "LaVeyan Satanism": "laveyan satanism"
    },
    {
        ". Accordingly, it has been labelled the intellectual wing of esoteric Satanism , with the Temple presenting itself as an intellectual religion. Aquino possessed a P.h.D. in ": null
    },
    {
        "political science": "political science"
    },
    {
        " and this formal education was reflected in the way that he presented his arguments, in which he draws broadly upon Western philosophy and science.              Born in 42 Michael Aquino was a military intelligence officer specialising in ": null
    },
    {
        "psychological warfare": "psychological warfare"
    },
    {
        ". In 42 he joined ": null
    },
    {
        "Anton LaVey": "anton lavey"
    },
    {
        "s ": null
    },
    {
        "Church of Satan": "church of satan"
    },
    {
        " and rose rapidly through the groups ranks. In 42 while he was serving with the U.S. military during the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", Aquino was stationed in ": null
    },
    {
        "Bến Cát": "bến cát district"
    },
    {
        " in ": null
    },
    {
        "South Vietnam": "south vietnam"
    },
    {
        " when he wrote a tract titled Diabolicon in which he reflected upon his growing divergence from the Church of Satans doctrines. In this tract, teachings about the creation of the world, God, and humanity are presented, as is the dualistic idea that Satan complements God. The character of ": null
    },
    {
        "Lucifer": "lucifer"
    },
    {
        " is presented as bringing insight to human society, a perspective that was inherited from the depiction of Lucifer in ": null
    },
    {
        "John Milton": "john milton"
    },
    {
        "s seventeenth-century ": null
    },
    {
        "epic poem": "epic poem"
    },
    {
        "  Paradise Lost .     By 42 Aquino was ranked as a Magister Caverns of the IV° within the Churchs hierarchy, was editor of its publication The Cloven Hoof, and sat on its governing Council of Nine. In 42 he rose to the previously unattained rank of Magister Templi of IV°. According to the scholars of Satanism Per Faxneld and Jesper Petersen, Aquino had become LaVeys right-hand man . He had nevertheless developed concerns about the Church of Satan, feeling that it had attracted many fad-followers, egomaniacs and assorted oddballs whose primary interests in becoming Satanists was to flash their membership cards for cocktail-party notoriety . When in 42 LaVey abolished the system of regional groups, or grottos, and declared that in future all degrees would be given in exchange for financial or other contributions to the Church, Aquino became increasingly disaffected; he resigned from the organisation on June 42 42 While LaVey seems to have held a pragmatic and practical view of the degrees and of the Satanic priesthood, intending them to reflect the social role of the degree holder within the organization, Aquino and his supporters viewed the priesthood as being spiritual, sacred and irrevocable. Dyrendal, Lewis, and Petersen describe Aquino as, in effect, accusing LaVey of the ": null
    },
    {
        "sacrilege": "sacrilege"
    },
    {
        " of ": null
    },
    {
        "simony": "simony"
    },
    {
        ".     Aquino then provided what has been described as a foundation myth for his Setian religion. Having departed the Church, he embarked on a ritual intent on asking Satan for advice on what to do next. According to his account, at Midsummer 42 Satan appeared and revealed that he wanted to be known by his true name, ": null
    },
    {
        "Set": "set"
    },
    {
        ", which had been the name used by his worshippers in ancient Egypt. Aquino produced a religious text, The Book of Coming Forth by Night, which he alleged had been revealed to him by Set through a process of ": null
    },
    {
        "automatic writing": "automatic writing"
    },
    {
        ". According to Aquino, there was nothing overtly sensational, supernatural, or melodramatic about The Book of Coming Forth By Night working. I simply sat down and wrote it.  The book proclaimed Aquino to be the Magus of the new Aeon of Set and the heir to LaVeys infernal mandate . Aquino later stated that the revelation that Satan was Set necessitated his own exploration of ": null
    },
    {
        "Egyptology": "egyptology"
    },
    {
        ", a subject about which he had previously known comparatively little. In this account, the direct word of Set was appealed to as a source of ": null
    },
    {
        "legitimation": "legitimation"
    },
    {
        ". Moreover, by drawing connections between itself and ancient Egypt, this young religion adopted a legitimisation strategy that tried to antedate both Judaism and Christianity.          Aquinos Book of Coming Forth by Night makes reference to  The Book of the Law , a similarly revealed text produced by the occultist ": null
    },
    {
        "Aleister Crowley": "aleister crowley"
    },
    {
        " in 42 which provided the basis for Crowleys religion of ": null
    },
    {
        "Thelema": "thelema"
    },
    {
        ". In Aquinos book, The Book of the Law was presented as a genuine spiritual text given to Crowley by preternatural sources, but it was also declared that Crowley had misunderstood both its origin and message. In making reference to The Book of the Law, Aquino presented himself as being as much Crowleys heir as LaVeys, and Aquinos work would engage with Crowleys writings and beliefs to a far greater extent than LaVey ever did.     In establishing the Temple, Aquino was joined by other ex-members of LaVeys Church, and soon Setian groups, or pylons, were established in various parts of the United States. The structure of the Temple was based largely on those of the ": null
    },
    {
        "ceremonial magic": "ceremonial magic"
    },
    {
        "al orders of the late nineteenth century, such as the ": null
    },
    {
        "Hermetic Order of the Golden Dawn": "hermetic order of the golden dawn"
    },
    {
        " and ": null
    },
    {
        "Ordo Templi Orientis": "ordo templi orientis"
    },
    {
        ".   Aquino has stated that he believed LaVey not to be merely a charismatic leader but to have been actually appointed by Satan himself  to found the Church. After the split of 42 Aquino believed LaVey had lost the mandate, which the Prince of Darkness then transferred to Aquino and a new organization, the Temple of Set. According to both the historian of religion ": null
    },
    {
        "Mattias Gardell": "mattias gardell"
    },
    {
        " and journalist ": null
    },
    {
        "Gavin Baddeley": "gavin baddeley"
    },
    {
        ", Aquino displayed an obsession with LaVey after his departure from the Church, for instance by publicly releasing court documents that reflected negatively on his former mentor, among them restraining orders, divorce proceedings, and a bankruptcy filing. In turn, LaVey lampooned the new Temple as ": null
    },
    {
        "Laurel and Hardy": "laurel and hardy"
    },
    {
        "s  Sons of the Desert  . In 42 the Temple incorporated as a non-profit Church in California, receiving state and federal recognition   and tax-exemption later that year.              Many members of the Temple had raised concerns about Aquinos authoritarian position within it. Aquino relinquished his office of High Priest in 42 to Ronald Keith Barrett, who produced an inspired text of his own, titled The Book of Opening the Way. Barretts approach was later criticized as more mystical than magical by Temple members. Barretts leadership was also criticised as authoritarian, resulting in a decline in the Temples membership. Barrett resigned his office and severed ties with the organization in May 42 He subsequently established his own Temple of Anubis, which he led until his 42 death; it survived until the early 42s. After Barretts departure, Aquino retook leadership of the Temple of Set. During this period, the sociologist ": null
    },
    {
        "Gini Graham Scott": "gini graham scott"
    },
    {
        " clandestinely participated in the Temple, using her observations as the basis for her 42 book The Magicians: A Study of the Use of Power in a Black Magic Group.     After receiving his PhD in political science from the ": null
    },
    {
        "University of California, Santa Barbara": "university of california, santa barbara"
    },
    {
        " in 42 Aquino worked as an ": null
    },
    {
        "adjunct professor": "adjunct professors in north america"
    },
    {
        " at ": null
    },
    {
        "Golden Gate University": "golden gate university"
    },
    {
        " until 42 while continuing to serve in the ": null
    },
    {
        "United States Army": "united states army"
    },
    {
        " as an ": null
    },
    {
        "Active Guard Reserve": "active guard reserve"
    },
    {
        " officer at the ": null
    },
    {
        "Presidio of San Francisco": "presidio of san francisco"
    },
    {
        ".   He was fascinated with the connections between occultism and ": null
    },
    {
        "Nazism": "nazism"
    },
    {
        ", resulting in some accusations that he was sympathetic to Nazi ideology. In 42 he performed a solitary rite at Walhalla, the subterranean section of the ": null
    },
    {
        "Wewelsburg": "wewelsburg"
    },
    {
        " castle in Germany that was utilised as a ceremonial space by the ": null
    },
    {
        "Schutzstaffel": "schutzstaffel"
    },
    {
        "s ": null
    },
    {
        "Ahnenerbe": "ahnenerbe"
    },
    {
        " group during the Nazi period. This resulted in his formation of the Order of the Trapezoid, a Setian group whose members understood themselves as a ": null
    },
    {
        "chivalric order": "chivalric order"
    },
    {
        " of ": null
    },
    {
        "knight": "knight"
    },
    {
        "s. From 42 through to 42 the Grand Master of the Order of the Trapezoid was ": null
    },
    {
        "Edred Thorsson": "stephen flowers"
    },
    {
        ", who had joined the Temple of Set in 42 and risen to the Fifth Degree in 42 Thorsson exerted a discernible influence over the Setian community through his books, in which he combined aspects of Satanic philosophy with the ": null
    },
    {
        "modern Pagan": "modern paganism"
    },
    {
        " religion of ": null
    },
    {
        "Heathenry": "heathenry"
    },
    {
        ". In 42 he founded the ": null
    },
    {
        "Texas": "texas"
    },
    {
        "-based Rune-Gild, which shared many of the Temples key philosophical tenets but with a focus on the study of ": null
    },
    {
        "runes": "runes"
    },
    {
        " and their applications in magical practice.          In the 42s, Aquino attracted greater publicity for his Temple through appearances on television talk shows like  The Oprah Winfrey Show  and  Geraldo . In 42 during the ": null
    },
    {
        "Satanic ritual abuse": "satanic ritual abuse"
    },
    {
        " hysteria, the three-year-old daughter of a Christian clergyman accused Aquino of sexually abusing her during Satanic rites held at his ": null
    },
    {
        "Russian Hill": "russian hill, san francisco"
    },
    {
        " home. Responding to the allegations, police raided Aquinos home, however—after no evidence was found to substantiate the allegation and it was revealed that Aquino was living in ": null
    },
    {
        "Washington D.C.": "washington d.c."
    },
    {
        " at the time of the alleged abuse—the police decided not to charge him with any felony. Aquino attempted to bring formal charges against the chaplain and psychiatrist who had encouraged the girls claims, although he was more successful in bringing legal action against two books—": null
    },
    {
        "Carl A. Raschke": "carl a. raschke"
    },
    {
        "s Painted Black and Linda Bloods The New Satanists—that had suggested that he was guilty. He then left the Presidio and was transferred to ": null
    },
    {
        "St. Louis": "st. louis"
    },
    {
        ". In 42 Aquino retired from active service in the Army, being honourably transferred to the ": null
    },
    {
        "Retired Reserve": "united states army reserveretired_reserve"
    },
    {
        " and awarded the ": null
    },
    {
        "Meritorious Service Medal": "meritorious service medal"
    },
    {
        ".     While the Satanic ritual abuse hysteria declined, Aquino continued to be a figure of prominence in ": null
    },
    {
        "mind control": "mind control"
    },
    {
        " conspiracy theories": "conspiracy theories"
    },
    {
        " because of his career as a psychological warfare officer in the US Army. In the United Kingdom during this same period, tabloids like the  News of the World  and  Sunday Mirror  published sensationalist articles about the Temple. In the mid42s a group of British Setians approached the religious studies scholar Graham Harvey and encouraged him to conduct research into the group so as to combat misconceptions about them. The Temple first registered a website in 42 the same year as the Church of Satan. It would also establish its own ": null
    },
    {
        "intranet": "intranet"
    },
    {
        ", allowing for communication between Setians in different parts of the world.     One member of the Temple was the New Zealander ": null
    },
    {
        "Kerry Bolton": "kerry bolton"
    },
    {
        ", who split to form his own Order of the Left Hand Path in 42 In 42 another couple who joined were LaVeys daughter ": null
    },
    {
        "Zeena Schreck": "zeena schreck"
    },
    {
        " and her husband ": null
    },
    {
        "Nikolas Schreck": "nikolas schreck"
    },
    {
        ", both of whom were vocal critics of Zeenas father. In 42 Don Webb became the high priest of the Temple, a position that he held until 42 He was replaced by Zeena Schreck, but she resigned after six weeks and was replaced by Aquino, who took charge once more. In that year, Zeena led a schism within the organisation, establishing her own ": null
    },
    {
        "Berlin": "berlin"
    },
    {
        "-based group, The Storm, which she later renamed the Sethian Liberation Movement. Aquino stood down as Supreme Priest again in 42 to be replaced by Patricia Hardy, who was elected to the position of Supreme Priestess. Although no longer in charge of the organisation, he nevertheless remained its most visible spokesperson.           In addition to the Book of Coming Forth by Night, in which Set himself is purported to speak, the Temples philosophy and teachings are revealed in a series of occult writings titled the Jeweled Tablets of Set. Each tablet is keyed to a specific degree in the Temple hierarchy. Only the introduction to the first tablet , titled Black Magic , is available for non-members. The Ruby Tablet, which is available for second-degree members, is the lengthiest and most diverse of the tablets.     The private Temple literature is not regarded as secret per se, but is kept restricted because it contains materials which, according to the Temple, may be dangerous to the non-initiated.         The human individual is at the centre of Setian philosophy. The Temple places great emphasis on the development of the individual, postulating ": null
    },
    {
        "self-deification": "self-deification"
    },
    {
        " as the ultimate goal.   The realization of the true nature of the Setian is termed becoming or coming into being and is represented by the ": null
    },
    {
        "Egyptian": "egyptian language"
    },
    {
        " hieroglyphic": "egyptian hieroglyphs"
    },
    {
        " term  kheper , or Xeper , as the Temple of Set prefers to write it. This term is described in The Book of Coming Forth by Night as the Word of the Aeon of Set .   Members attempt to preserve and strengthen their isolate, psyche-centric existence through adherence to the left-hand path. This idea is in opposition to the traditional goal of ": null
    },
    {
        "Hermetic": "hermeticism"
    },
    {
        " and Western mystical practices, which is the surrendering of the ego into a union with either God or the universe.     The Temple teaches that the true self, or essence, is immortal, and Xeper is the ability to align consciousness with this essence. Aquino taught that there is an ": null
    },
    {
        "afterlife": "afterlife"
    },
    {
        " for those who have reached the necessary level of individual development. This afterlife could occur in the individuals subjective universe. Those unable to reach this level dissolve into non-existence when the physical body dies. Self-initiation is knowledge understood as a conjunction of intellect and intuition. In keeping with its emphasis on the individual, the Temple encourages their members to celebrate their own birthday, and does not prescribe any other calendar of religious festivities.     Barrett presented Xem as his Aeonic Word to the Setians, presenting it as a natural and necessary further development of Aquinos Xeper. Aquino later acknowledged Xem as a worthwhile magical concept for Setians to explore, but found Barretts insistence on its exclusivity as incompatible with the Temples individualistic philosophy.              Aquinos understanding of ": null
    },
    {
        "Satan": "satan"
    },
    {
        " differed from the atheistic interpretation promoted by LaVey, and the Temples theology differs from that of the Church of Satan. The Temple presents the view that the name Satan was originally a corruption of the name Set. The Temple of Set promotes the idea that Set is a real entity, and accordingly has been described as being openly theistic . It further argues that Set is ageless and is the only real god in existence, with all others having been created by the human imagination. Set is described as having given humanity—through the means of non-natural ": null
    },
    {
        "evolution": "evolution"
    },
    {
        "—the Black Flame or the Gift of Set . This refers to humanitys questioning intellect which sets the species apart from other animals and gives it an isolate ": null
    },
    {
        "self-consciousness": "self-consciousness"
    },
    {
        " and the possibility to attain divinity. Aquino argued that the idea of the Gift of Set was inadvertently promoted to a wider audience in ": null
    },
    {
        "Stanley Kubrick": "stanley kubrick"
    },
    {
        "s 42 film  42: A Space Odyssey . According to Aquino, the ": null
    },
    {
        "black monolith": "monolith"
    },
    {
        " which imparts human-level intelligence onto prehistoric apes in the film was a symbol of Set.     While Setians are expected to revere Set, they do not worship him, instead regarding him as a teacher and a guide. He is portrayed as a role model on which Setians can base their own deification. According to Webb, we do not worship Set - only our own potential. Set was and is the patron of the magician who seeks to increase his existence through expansion.      Embracing the idea of aeons from Crowleys ": null
    },
    {
        "Thelema": "thelema"
    },
    {
        ", Aquino adopted the Crowleyan tripartite division between the Aeon of Isis, Aeon of Osiris, and Aeon of Horus, but added to that the Aeon of Satan, which he dates from 42 to 42 and then the Aeon of Set, which he dated from 42 onward. Despite presenting these chronological parameters, Aquino also portrayed the aeons less as time periods and more as mind-sets that can co-exist alongside one another. Thus, he stated that A Jew, Christian or Muslim exists in the Æon of Osiris, a Wiccan in that of Isis, and a Thelemite in that of Horus .         Aquino placed an emphasis on what he deemed to be the division between the objective and subjective universes. In the Setian religion, the objective world is understood as representing the natural world and humanitys collective meaning systems, while the subjective universe is understood as the individually experienced world and individual meaning systems. Following earlier esotericists like Crowley, Aquino characterised magic as causing change in accordance with will . Unlike LaVey, Aquino expressed belief in the division between ": null
    },
    {
        "black magic": "black magic"
    },
    {
        " and ": null
    },
    {
        "white magic": "white magic"
    },
    {
        ". He described white magic as a highly-concentrated form of conventional religious ritual , characterising it as being more versatile , less difficult and less dangerous than black magic. However he criticised white magic as fraud and/or self-delusion which deceives the consciousness into thinking that it has been accepted in the objective universe.     Aquino divided black magic into two forms, lesser black magic and greater black magic. He stated that lesser black magic entails impelling things that exist in the objective universe into doing a desired act by using obscure physical or behavioural laws and into this category he placed stage magic, psychodramas, politics, and propaganda. Conversely, he used the term greater black magic in reference to changes in the subjective universe of the magician, allowing them to realize their self in accordance with the principle of Xeper. Among Setians it is accepted that there may be changes in the objective universe as a result of greater black magic, however such effects are considered secondary to the impact that they have on the subjective universe.     Within the Temple, rituals are typically known as workings , and are most often carried out alone. Stressing the religions individualist nature, there are no rituals that are specifically prescribed by the Temple. Aquino also emphasized that in order to achieve a desired aim, the Setian should carry out physical actions alongside magical ones. There are no regular occasions which are marked by fixed rituals, and the Temple holds to no calendar of festivals.       The Temple uses an inverted ": null
    },
    {
        "pentagram": "pentagram"
    },
    {
        " as its insignia, known as the Pentagram of Set to Setians. The use of the geometric shape is derived from the ": null
    },
    {
        "Sigil of Baphomet": "sigil of baphomet"
    },
    {
        " used by the Church of Satan, although stripped of its overtly Satanic add-ons. The Temple explains the meaning and significance of the pentagram by referring to ": null
    },
    {
        "Pythagorean": "pythagoreanism"
    },
    {
        " ideas and ": null
    },
    {
        "mathematical perfection": "golden ratio"
    },
    {
        " . At Setian gatherings, members wear the pentagram as a medallion. The medallion is colored according to the initiation degree of the Setian.     Both the Church of Satan and the Temple of Set also use the ": null
    },
    {
        "trapezoid": "trapezoid"
    },
    {
        " symbol. The version used by the Church includes flames, a pitchfork and the number 42 while the trapezoid of the Temple has a left-facing ": null
    },
    {
        "Egyptian sceptre": "was-sceptre"
    },
    {
        ", and the number 42 stylized in geometric shapes rather than as clear numbers.         The internal structure of the Temple of Set is closely reminiscent of that of the Church of Satan as it existed in the 42s.       All members of the Temple must be affiliated with a pylon, and thus membership is by application, requiring contact with a Setian priestess or priest followed by an evaluation period. The participation of non-initiated in the Temples rituals are forbidden, due to the belief that their rituals would be dangerous in the wrong hands.     The Temple of Set recognizes several stages or degrees of initiation. The degrees indicate the individual Setians development and skill in magic. The degree structure is based on that of the Church of Satan, which in turn was based on the degrees of a nineteenth-century occult group, the ": null
    },
    {
        "Hermetic Order of the Golden Dawn": "hermetic order of the golden dawn"
    },
    {
        ". The Temple terms the progression through degrees as recognitions , because the organizations philosophy sees that the individual member initiates themselves and that the Temple merely acknowledges this by granting the degree. These degrees are:   Setian   Adept   Priest / Priestess of Set   Magister / Magistra Templi   Magus / Maga   Ipsissimus / Ipsissima     The priesthood of the Temple of Set consists of members holding the third degree or higher; those in the first and second degrees are considered lay members of the Temple. The first degree serves as a space for mutual evaluation, in which the Temple assesses whether the individual is appropriate for the group, and the individual decides whether they wish to further their involvement with it. Full membership comes with recognition to the second degree. Many members do not advance beyond the second degree, nor is this expected of them, as while the first and second degree members use the organizations teachings and tools for their own development, the priesthood involves greater responsibilities towards the organization, such as being its official representatives.     Recognition is performed by members of the priesthood. The fourth degree, which is acknowledged by the high priest/priestess, entails that the individual is so advanced in their magical skills that they are able to found their own school of magic, represented in the different orders of the Temple. The fifth degree can only be awarded by the unanimous decision of the Council of Nine and by the approval of the Temples high priest/priestess. A fifth degree member has the power to utter and define a concept which somehow affects the philosophy of the organization, such as the concept of Xeper defined by Aquino in 42 Only a handful of members have attained this degree and most fifth-degree concepts defined in such a manner are no longer studied in the organization. The final sixth degree represents a Magus whose Task is complete . This degree is held by a very select few in the Temple, although any fifth-degree member can assume the sixth degree based on their own assessment.         The organization is led by a ": null
    },
    {
        "high priest": "high priest"
    },
    {
        "/priestess, who is also the public face of the Temple. The high priest is chosen among fourth or higher degree members by the chairman of the Council of Nine. This ruling council has nine members chosen from the priesthood , whose mandate lasts for nine years with a new member being elected every year. The chairman of the council is chosen from among the council members each year. The council has the ultimate ruling power in the Temple and even the high priest is responsible to it. The Temple also has an executive director, whose task is to deal with administrative issues.     Since its founding in 42 the temple has had the following high priests/priestesses: ": null
    },
    {
        "Don Webb": "don webb"
    },
    {
        "   Zeena Schreck": "zeena schreck"
    },
    {
        "   Patricia Hardy   James Fitzsimmons              In addition to the international organization, the Temple sponsors initiatory Orders and Elements and local groups called Pylons. Pylons are intended to facilitate the initiatory work of the Temples members by conducting meetings where discussions and magical works take place. The purpose of a pylon is to provide a space in which the Setian can focus on their religion, aided by like-minded individuals. Pylons typically meet in a members home. Members usually join the Pylon located geographically closest to them. Correspondence- or Internet-based Pylons also exist, with Harvey noting that this online networking is more common than in-person interaction. A Pylon is led a by a second-degree member who is called a Sentinel. The term pylon derives from the architectural features which served as fortified gateways to ancient Egyptian temples. One Finnish Setian informed Granholm that the relationship between the orders and the temple was like that of different departments in a university.     Elements are loosely structured interest groups, where specific themes and issues are addressed. They can be open for non-members and are commonly in operation only for short periods. Topics of interest include, for example, ": null
    },
    {
        "animal rights": "animal rights"
    },
    {
        ", which was the subject of the Arkte element operated by Aquinos wife Lilith.     There are sections of the Temple known as Orders, each of which focus on a particular theme, for instance ancient Egypt, Norse culture, Tantric Hinduism, or vampirism. Others focus on a particular skill, for instance the Order of Uart focuses on the visual arts and the Order of Taliesin on music. Orders can be understood as schools of different aspects of magic providing different paths of initiation. Orders are led by grand masters, who will usually be the founder of the order. In longer-lived orders the founder may have a successive grand master. Orders are founded by members of the fourth degree. When members reaches the second degree of initiation, they are expected to join an order of their own choosing. In normal circumstances, a Setian is only permitted to join one order, however special dispensation can be obtained for a practitioner to join two.     Setians also hold annual International Conclaves. First Degree Initiates who obtain sponsorship by a member of the Priesthood are permitted to attend the International Conclave and Regional Gatherings.        In 42 the Temple had thirteen pylons, which were operating in the United States, Australia, Germany, and across Sweden and Finland. The extent of the Temples membership has not been publicly revealed by the group; however, in 42 Petersen noted that academic estimates for the Temples membership varied from between 42 and 42 and Granholm suggested that in 42 the Temple contained circa 42 members. The Temples members come from a variety of racial backgrounds.     In 42 Aquino said the membership numbers ranged from 42 to 42. Noting that people under age 42 are not allowed to join, he said most so-called satanists are teen-agers who have been raised in the Judeo-Christian tradition and are dabbling in the occult based on their own interpretations, not ours. We see ourselves philosophically and theologically as the most precise religion in the world.      In 42 the anthropologist ": null
    },
    {
        "Jean La Fontaine": "jean la fontaine"
    },
    {
        " suggested that in Britain there were 42 members of the Temple at most, and possibly considerably fewer . In 42 the scholar Gareth Medway posited that the group had 42 to 42 members in the United Kingdom, adding that it was the largest Satanic group then active in the country. In 42 Harvey concurred with La Fontaines assessment, although still believed that it was the largest Satanic group in the United Kingdom. He noted that most members were male, between the ages of twenty and fifty, and that—despite his expectation that they might be political extremists—they endorsed mainstream political positions, with all those whom he communicated with stating that they had voted for either the ": null
    },
    {
        "Conservative Party": "conservative party"
    },
    {
        ", ": null
    },
    {
        "Labour Party": "labour party"
    },
    {
        ", or ": null
    },
    {
        "Liberal Democrats": "liberal democrats"
    },
    {
        ".": null
    }
]