[
    {
        "      Temse  is a ": null
    },
    {
        "municipality": "municipality"
    },
    {
        " in ": null
    },
    {
        "East Flanders": "east flanders"
    },
    {
        ", ": null
    },
    {
        "Belgium": "belgium"
    },
    {
        ".     The municipality, which lies on the left side of the River Scheldt, comprises the towns of ": null
    },
    {
        "Elversele": "elversele"
    },
    {
        ", , Temse and ": null
    },
    {
        "Tielrode": "tielrode"
    },
    {
        ". On January 42 42 Temse had a population of 42. The total area is 42  km² which gives a ": null
    },
    {
        "population density": "population density"
    },
    {
        " of 42 inhabitants per km².       The name Temse is derived from the ": null
    },
    {
        "Gallo-Roman": "gallo-roman"
    },
    {
        "/": null
    },
    {
        "Gaul": "gaul"
    },
    {
        " Tamisiacum or Tamasiacum. This is also reflected in the French name for the town, Tamise. The main sights include the church of Our Lady, whose steeple was designed built by the famous sculptor Adriaan Nijs, who died in Temse, and who also sculpted the wooden pulpit. Inside the church the relics of ": null
    },
    {
        "Amalberga of Temse": "amalberga of temse"
    },
    {
        " are venerated. Close by stands the old Gemeentehuis , built in Flemish Eclectic style, housing a carillon in its main tower.     Between 42 and 42 Temse was home to the ": null
    },
    {
        "Boelwerf": "boelwerf"
    },
    {
        " shipyard which for much of the twentieth century dominated the local economy and employment market.     After the last ship was completed in 42 the shipyards extensive terrain to the west of the town centre became available for redevelopment. The land was acquired in 42 by a consortium of local construction firm Cordeel and three banks, and Nieuw Temse has since emerged as a whole new river-side town district and also the home of the new town hall. Local architect Pieter De Maeyer led the urban planning for the new district, and a number of high-profile architects were attracted for the design of a series of residential buildings along the river.       ": null
    },
    {
        "Temse Bridge": "temse bridge"
    },
    {
        ", road bridge in Belgium, originally designed by ": null
    },
    {
        "Gustave Eiffel": "gustave eiffel"
    },
    {
        ".   Church of Our Lady, 42th century interior.   ": null
    }
]