[
    {
        "        Muriel Teresa Wright was an American actress. She was nominated twice for the ": null
    },
    {
        "Academy Award for Best Supporting Actress": "academy award for best supporting actress"
    },
    {
        ": in 42 for her debut work in  The Little Foxes , and in 42 for  Mrs. Miniver , winning for the latter. That same year, she received a nomination for the ": null
    },
    {
        "Academy Award for Best Actress": "academy award for best actress"
    },
    {
        " for her performance in  The Pride of the Yankees , opposite ": null
    },
    {
        "Gary Cooper": "gary cooper"
    },
    {
        ". She is also known for her performances in ": null
    },
    {
        "Alfred Hitchcock": "alfred hitchcock"
    },
    {
        "s  Shadow of a Doubt  and ": null
    },
    {
        "William Wyler": "william wyler"
    },
    {
        "s  The Best Years of Our Lives  .     Wright received three ": null
    },
    {
        "Emmy Award": "emmy award"
    },
    {
        " nominations for her performances in the Playhouse 42 original television version of  The Miracle Worker  , in the Breck Sunday Showcase feature The Margaret Bourke-White Story, and in the CBS drama series  Dolphin Cove  . She earned the acclaim of top film directors, including ": null
    },
    {
        "William Wyler": "william wyler"
    },
    {
        ", who called her the most promising actress he had directed, and Alfred Hitchcock, who admired her thorough preparation and quiet professionalism.       Muriel Teresa Wright was born on October 42 42 in ": null
    },
    {
        "Harlem": "harlem"
    },
    {
        ", New York City, the daughter of Martha and Arthur Hendricksen Wright, an insurance agent.  Her parents separated when she was young. She grew up in ": null
    },
    {
        "Maplewood, New Jersey": "maplewood, new jersey"
    },
    {
        ", where she attended ": null
    },
    {
        "Columbia High School": "columbia high school"
    },
    {
        ". After seeing ": null
    },
    {
        "Helen Hayes": "helen hayes"
    },
    {
        " star in Victoria Regina at the Broadhurst Theatre in New York City in 42 Wright took an interest in acting and began playing leading roles in school plays.     She earned a scholarship to the Wharf Theater in ": null
    },
    {
        "Provincetown": "provincetown, massachusetts"
    },
    {
        ", Massachusetts, where she was an apprentice for two summers. Following her high school graduation in 42 she went to New York, shortened her name to Teresa Wright , and was hired as understudy to ": null
    },
    {
        "Dorothy McGuire": "dorothy mcguire"
    },
    {
        " and ": null
    },
    {
        "Martha Scott": "martha scott"
    },
    {
        " for the role of Emily in ": null
    },
    {
        "Thornton Wilder": "thornton wilder"
    },
    {
        "s stage production of  Our Town  at ": null
    },
    {
        "Henry Millers Theatre": "stephen sondheim theatre"
    },
    {
        ". She took over the role when Scott left for Hollywood to film the on-screen version of the play.          In autumn 42 Wright began a two-year appearance in the stage play  Life with Father , playing the role of Mary Skinner. It was there that she was discovered by ": null
    },
    {
        "Samuel Goldwyn": "samuel goldwyn"
    },
    {
        ", who came to see her in the show she had been appearing in for almost a year. Goldwyn would later recall his first encounter with her backstage:          Goldwyn immediately hired the young actress for the role of ": null
    },
    {
        "Bette Davis": "bette davis"
    },
    {
        " daughter in the ": null
    },
    {
        "42 adaptation": "1941 in film"
    },
    {
        " of ": null
    },
    {
        "Lillian Hellman": "lillian hellman"
    },
    {
        "s  The Little Foxes , signing her to a five-year Hollywood contract with the Goldwyn Studios. Asserting her seriousness as an actress, Wright insisted her contract contain unique clauses by Hollywood standards:          In 42 Wright was nominated for the ": null
    },
    {
        "Academy Award for Best Supporting Actress": "academy award for best supporting actress"
    },
    {
        " for her film début in  The Little Foxes . The following year, she was nominated again, this time for ": null
    },
    {
        "Best Actress": "academy award for best actress"
    },
    {
        " for  The Pride of the Yankees , in which she played opposite ": null
    },
    {
        "Gary Cooper": "gary cooper"
    },
    {
        " as the wife of ": null
    },
    {
        "Lou Gehrig": "lou gehrig"
    },
    {
        ". That same year, she won the ": null
    },
    {
        "Academy Award for Best Supporting Actress": "academy award for best supporting actress"
    },
    {
        " as the daughter-in-law of ": null
    },
    {
        "Greer Garson": "greer garson"
    },
    {
        "s character in  Mrs. Miniver . Wright is the first out of only nine players who have been nominated in both categories in the same year.  Her three Academy Award nominations and one Academy Award in her first three films is unique. She remains the only performer to have received Academy Award nominations for her first three films.     In 42 Wright appeared in the acclaimed ": null
    },
    {
        "Universal": "universal studios"
    },
    {
        " film  Shadow of a Doubt , directed by ": null
    },
    {
        "Alfred Hitchcock": "alfred hitchcock"
    },
    {
        ", playing an innocent young woman who discovers her beloved uncle  is a serial murderer. Hitchcock thought Wright was one of the most intelligent actors he had worked with, and through his direction brought out her vivacity, warmth, and youthful idealism—characteristics uncommon in Hitchcocks heroines. In 42 Wright delivered another notable performance in ": null
    },
    {
        "William Wyler": "william wyler"
    },
    {
        "s  The Best Years of Our Lives , an award-winning film about the adjustments of servicemen returning home after ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". Critic ": null
    },
    {
        "James Agee": "james agee"
    },
    {
        " praised her performance in The Nation:          Four years later, she would appear in another story of war veterans, ": null
    },
    {
        "Fred Zinnemann": "fred zinnemann"
    },
    {
        "s  The Men  , which starred ": null
    },
    {
        "Marlon Brando": "marlon brando"
    },
    {
        " in his film début. In 42 Wright appeared in the western  Pursued  opposite ": null
    },
    {
        "Robert Mitchum": "robert mitchum"
    },
    {
        ". The moody Freudian western was written by her first husband ": null
    },
    {
        "Niven Busch": "niven busch"
    },
    {
        ". The following year, she starred with David Niven, Farley Granger, and Evelyn Keyes in  Enchantment , a story of two generations of lovers in parallel romances. Wright received glowing reviews for her performance. Newsweek commented: Miss Wright, one of the screens finest, glows as the Cinderella who captivated three men. And The New York Times concluded: Teresa Wright plays with that breathless, bright-eyed rapture which she so remarkably commands.     In December 42 after rebelling against the ": null
    },
    {
        "studio system": "studio system"
    },
    {
        " that brought her fame, Teresa Wright had a public falling out with Samuel Goldwyn, which resulted in the cancellation of Wrights contract with his studio. In a statement published in  The New York Times , Goldwyn cited as reasons her refusal to publicize the film Enchantment, and her being uncooperative and refusing to follow reasonable instructions . In her written response, Wright denied Goldwyns charges and expressed no regret over losing her $42 per week contract.        Years later, in an interview with  The New York Post , Wright recalled: I was going to be ": null
    },
    {
        "Joan of Arc": "joan of arc"
    },
    {
        ", and all I proved was that I was an actress who would work for less money. For her next film,  The Men  , instead of the $42 she had once commanded, she received $42.        In the 42s, Wright appeared in several unsuccessful films, including  The Capture  ,  Something to Live For  ,  California Conquest  ,  The Steel Trap  ,  Count the Hours  ,  The Actress  , and  Track of the Cat  , opposite ": null
    },
    {
        "Robert Mitchum": "robert mitchum"
    },
    {
        " again. Despite the poor ": null
    },
    {
        "box-office": "box-office"
    },
    {
        " showing of these films, Wright was usually praised for her performances. Toward the end of the decade, Wright began to work more frequently in television and theatre. She received ": null
    },
    {
        "Emmy Award": "emmy award"
    },
    {
        " nominations for her performances in the Playhouse 42 original television version of The Miracle Worker and in the Breck Sunday Showcase feature The Margaret Bourke-White Story . In 42 she played Doris Walker in  The 42th Century-Fox Hour  remake of the 42 classic film,  Miracle on 42th Street , opposite ": null
    },
    {
        "MacDonald Carey": "macdonald carey"
    },
    {
        " and ": null
    },
    {
        "Thomas Mitchell": "thomas mitchell"
    },
    {
        ".     On February 42 42 Wright was inducted to the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        " with two stars: one for motion pictures at 42 Vine Street and one for television at 42 ": null
    },
    {
        "Hollywood Boulevard": "hollywood boulevard"
    },
    {
        ".     In the 42s, Wright returned to the New York stage appearing in three plays:  Mary, Mary  at the Helen Hayes Theatre in the role of Mary McKellaway, I Never Sang for My Father at the Longacre Theatre in the role of Alice, and Whos Happy Now? at the Village South Theatre in the role of Mary Hallen. During this period, she also toured throughout the United States in stage productions of Mary, Mary ,  Tchin-Tchin  in the role of Pamela Pew-Picket, and  The Locksmith  in the role of ": null
    },
    {
        "Katherine Butler Hathaway": "katherine butler hathaway"
    },
    {
        ". In addition to her stage work, Wright made numerous television appearances throughout the decade, including episodes for  The Alfred Hitchcock Hour  on CBS,  Bonanza  on NBC,  The Defenders  on CBS, and  CBS Playhouse  .     In 42 Wright appeared in the ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " revival of  Death of a Salesman , and in 42 appeared in the revival of  Mornings at Seven , for which she won a ": null
    },
    {
        "Drama Desk Award": "drama desk award"
    },
    {
        " as a member of the Outstanding Ensemble Performance. In 42 she received her third Emmy Award nomination for her performance in the CBS drama series  Dolphin Cove .       Wrights later film appearances included a major role in  Somewhere in Time  , the role of the grandmother in  The Good Mother  with ": null
    },
    {
        "Diane Keaton": "diane keaton"
    },
    {
        ", and the role of Miss Birdie in ": null
    },
    {
        "John Grisham": "john grisham"
    },
    {
        "s  The Rainmaker  , directed by ": null
    },
    {
        "Francis Ford Coppola": "francis ford coppola"
    },
    {
        ".     In her last decade, Wright lived quietly in her New England home in the town of ": null
    },
    {
        "Bridgewater, Connecticut": "bridgewater, connecticut"
    },
    {
        ", in ": null
    },
    {
        "Litchfield County": "litchfield county"
    },
    {
        ", appearing occasionally at film festivals and forums and at events associated with the New York Yankees. In 42 she reminisced about Alfred Hitchcock at the ": null
    },
    {
        "Edinburgh International Film Festival": "edinburgh international film festival"
    },
    {
        ", and in 42 she appeared on the Academy Awards show in a segment honoring previous Oscar-winners.       Teresa Wright died on March 42 42 of a heart attack at Yale-New Haven Hospital in Connecticut at the age of 42 She is buried in ": null
    },
    {
        "Evergreen Cemetery": "evergreen cemetery"
    },
    {
        " in New Haven.       Wright was married to writer ": null
    },
    {
        "Niven Busch": "niven busch"
    },
    {
        " from 42 to 42 They had two children: a son, Niven Terence Busch, born December 42 42; and a daughter, Mary-Kelly Busch, born September 42 42 She married playwright ": null
    },
    {
        "Robert Anderson": "robert anderson"
    },
    {
        " in 42 They divorced in 42 but maintained a close relationship until the end of her life.     Her daughter, Mary-Kelly, is an author of books for children and young adults.  Wright has two grandchildren, one of whom, Jonah Smith, co-produced ": null
    },
    {
        "Darren Aronofsky": "darren aronofsky"
    },
    {
        "s films  Pi  and  Requiem for a Dream  . In 42 Smith accompanied Wright to ": null
    },
    {
        "Yankee Stadium": "yankee stadium"
    },
    {
        " when she was invited to throw the ceremonial first pitch. It was her first visit to the stadium. Wrights appearance in Pride of the Yankees had sparked an interest in baseball and led her to become a Yankees fan. Upon Wrights death in 42 when the roll call of former Yankees who had died was announced at Old Timers Day on July 42 42 her name was read among the ballplayers and members of the Yankees family.     A Girls Got To Breathe: The Life of Teresa Wright, by Donald Spoto, was published in February 42 Spoto was a close friend to Wright for more than 42 years, and was given exclusive access by her family to her papers and correspondence. Publishers Weekly called the biography an engaging and intimate portrait . Library Journal also praised the book as an affectionate tribute to a shamefully neglected talent .       ": null
    }
]