[
    {
        "      Terni  is a city in the southern portion of the region of ": null
    },
    {
        "Umbria": "umbria"
    },
    {
        " in central Italy. The city is the capital of the ": null
    },
    {
        "province of Terni": "province of terni"
    },
    {
        ", located in the plain of the ": null
    },
    {
        "Nera river": "nera river"
    },
    {
        ". It is  northeast of ": null
    },
    {
        "Rome": "rome"
    },
    {
        ".     It was founded as an Ancient Roman town.     During the 42th century, steel mills were introduced and led the city to have a role in the ": null
    },
    {
        "second industrial revolution": "second industrial revolution"
    },
    {
        " in Italy. Because of its industrial importance, the city was heavily bombed during ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        " by the ": null
    },
    {
        "Allies": "allies of world war ii"
    },
    {
        ". It still remains an industrial hub and has been nicknamed The Steel City .     Terni is also known as the City of Lovers , as its patron saint, ": null
    },
    {
        "Saint Valentine": "saint valentine"
    },
    {
        ", was born and became a bishop here, and the remains are preserved in the basilica-sanctuary in his honour.         The city was founded around the 42th century BC by the ": null
    },
    {
        "Umbrians": "umbrians"
    },
    {
        " Naharti, in a territory inhabited as early as the ": null
    },
    {
        "Bronze Age": "bronze age"
    },
    {
        ". The ": null
    },
    {
        "Iguvine Tablets": "iguvine tablets"
    },
    {
        " describe these Naharti as a strong, numerous people and as the most important enemy of the Umbrian people of Gubbio . In the 42rd century BC, Terni was conquered by the ": null
    },
    {
        "Romans": "ancient rome"
    },
    {
        " and soon became an important municipium lying on the ": null
    },
    {
        "Via Flaminia": "via flaminia"
    },
    {
        ". The Roman name was Interamna, meaning in between two rivers . During the ": null
    },
    {
        "Roman Empire": "roman empire"
    },
    {
        " the city was enriched with several buildings, including ": null
    },
    {
        "aqueducts": "roman aqueduct"
    },
    {
        ", walls, an ": null
    },
    {
        "amphitheater": "roman amphitheatre"
    },
    {
        ", a ": null
    },
    {
        "theater": "roman theatre"
    },
    {
        ", temples and bridges.     After the ": null
    },
    {
        "Lombard": "lombards"
    },
    {
        " conquest in 42 Terni lost prominence when it was reduced to a secondary town in the ": null
    },
    {
        "Duchy of Spoleto": "duchy of spoleto"
    },
    {
        ". In 42 it was sacked by ": null
    },
    {
        "Frederick Barbarossa": "frederick barbarossa"
    },
    {
        "s general, Archbishop ": null
    },
    {
        "Christian of Mainz": "christian of mainz"
    },
    {
        ". In the following century Terni was one of sites visited frequently by ": null
    },
    {
        "St. Francis": "francis of assisi"
    },
    {
        " to give sermons.     In the 42th century Terni issued its own constitution, and from 42 the walls were enlarged, and new channels were opened. As with many of the Italian communes of the Late Middle Ages, it was beset by civil unrest between the partisans of the ": null
    },
    {
        "Guelphs and Ghibellines": "guelphs and ghibellines"
    },
    {
        ", and later between the Nobili and Banderari . Later it joined the ": null
    },
    {
        "Papal States": "papal states"
    },
    {
        ". In 42 an ": null
    },
    {
        "ironwork": "ironwork"
    },
    {
        ", the Ferriera, was introduced to work the iron ore mined in ": null
    },
    {
        "Monteleone di Spoleto": "monteleone di spoleto"
    },
    {
        ", starting the traditional industrial connotation of the city. In the 42th century, however, the population of Terni declined further due to plagues and famines.     In the 42th century, Terni took advantage of the ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " and of plentiful water sources in the area. New industries included a steelwork, a foundry, as well as weapons, ": null
    },
    {
        "jute": "jute"
    },
    {
        " and wool factories. In 42 Terni became capital of the province. The presence of important industries made it a favorite target for the Allied bombardments in ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". On August 42 42 a massive bombardment devastated the city. It was the first of the 42 air strikes that destroyed 42% of Ternis buildings and buried under the rubble about 42 civilians. Despite this, industrial environment increased quickly after the war.         The city has three important industrial hubs: the first one is the ": null
    },
    {
        "Stainless Steel": "stainless steel"
    },
    {
        " Area, called AST  and is a wide area located in the east part of Terni. West of the town, there is a second industrial hub, known as Area Polymer , with four different chemical multinational industries. The third industrial hub is Italeaf, which controls TerniEnergia, a company listed on STAR segment of Borsa Italiana, that is active in the renewable energy sector, and promotes and develops technological star-ups in cleantech sector.       Terni is connected with the ": null
    },
    {
        "A42 motorway": "autostrada a1"
    },
    {
        ", the ": null
    },
    {
        "European route E42": "european route e45"
    },
    {
        " and ": null
    },
    {
        "National Road Flaminia": "via flaminia"
    },
    {
        " by the RATO, a motorway junction.     ": null
    },
    {
        "Terni railway station": "terni railway station"
    },
    {
        " is part of the ": null
    },
    {
        "Ancona–Orte railway": "ancona–orte railway"
    },
    {
        ", and is also a ": null
    },
    {
        "junction station": "junction"
    },
    {
        " for two secondary lines, the ": null
    },
    {
        "Terni–Sulmona railway": "terni–sulmona railway"
    },
    {
        "  and the Terni–Sansepolcro railway  . One of the most important national freight stations is located nearby.   The local urban and suburban transport service, ATC, runs 42 bus lines. In the north of the city , there are works in progress on the line from Perugia to enable it to be used as a ": null
    },
    {
        "Light rail": "light rail"
    },
    {
        " line.               Porta SantAngelo, one of the four Ancient Roman Gates to the city, much restored.   ": null
    },
    {
        "Terni Cathedral": "terni cathedral"
    },
    {
        "  . Built over one of the most ancient Christian edifices of the city, it has today ": null
    },
    {
        "Baroque": "baroque architecture"
    },
    {
        " lines. In the interior is one organ designed by ": null
    },
    {
        "Gian Lorenzo Bernini": "gian lorenzo bernini"
    },
    {
        ". The belfry is from the 42th century. The façade has two mediaeval gates: one of them has the profile of a sabot once used to measure the citizens shoes in order to ensure that they did not exceed a fixed limit of decency.    San Francesco  – 42th-century church   The Basilica of S.  Valentino.   Palazzo Mazzancolli is one of the few remains of the Middle Ages past of the city.   Palazzo Gazzoli , housing the Citys Gallery with works by Pierfrancesco dAmelia, ": null
    },
    {
        "Benozzo Gozzoli": "benozzo gozzoli"
    },
    {
        ", Gerolamo Troppa and ": null
    },
    {
        "Orneore Metelli": "orneore metelli"
    },
    {
        ".    Palazzo Spada  , designed by ": null
    },
    {
        "Antonio da Sangallo the Younger": "antonio da sangallo the younger"
    },
    {
        ". It is the current Town Hall.   Lancia di Luce , by the ": null
    },
    {
        "sculptor": "sculpture"
    },
    {
        " Arnaldo Pomodoro": "arnaldo pomodoro"
    },
    {
        ".   The Romanesque churches:    SantAlò  .   San Martino.    San Salvatore .     Nearby, at the confluence of the ": null
    },
    {
        "Velino": "velino"
    },
    {
        " and ": null
    },
    {
        "Nera River": "nera"
    },
    {
        "s, is the ": null
    },
    {
        "Cascata delle Marmore": "cascata delle marmore"
    },
    {
        ", a  waterfall.       ": null
    },
    {
        "Ternana Calcio": "ternana calcio"
    },
    {
        " is the main football club in the city. The club have twice played in Italys first division ": null
    },
    {
        "Serie A": "serie a"
    },
    {
        " . Ternana is currently playing in ": null
    },
    {
        "Serie B": "serie b"
    },
    {
        " . The club play at the 42-seat ": null
    },
    {
        "Stadio Libero Liberati": "stadio libero liberati"
    },
    {
        ", named after Italian motorcycle racer ": null
    },
    {
        "Libero Liberati": "libero liberati"
    },
    {
        ", who was born in Terni, won the ": null
    },
    {
        "42cc World Championship": "list of grand prix motorcycle racing world champions"
    },
    {
        " in 42 and died while he was training with his Gilera Saturno along the Valnerina road near Terni.         House of Castelli First important family native of Terni of Germanic lineage. In the Middle Ages, Renaissance, Baroque and 42th century was an active family both in their city than in others.   House of Spada Central Italys very important family, native of Terni. In middle age, Renaissance, Baroque and 42th century was an active family both in their city than in others.   House of Camporeali Ternis very important family. In the Middle Ages and Renaissance was an active family both in their city than in others.   House of Cittadini Central Italys very important family, native of Terni, of Germanic lineage. In the Middle Ages and Renaissance was an active family both in their city than in others.   House of Manassei Central Italys very important family, native of Terni, of Germanic lineage. In the Middle Ages and Renaissance was an active family both in their city than in others.   House of Mazzancolli Ternis very important family. In the Renaissance, Baroque and 42th century was an active family both in their city than in others.   House of Tomassoni Ternis very important family. In the Renaissance, Baroque and 42th century was an active family both in their city than in others.   House of Ciancherotti Ternis very important family. In the Renaissance, Baroque and 42th century was an active family both in their city than in others.   House of Nicoletti Ternis very important family. In the Middle Ages, Renaissance, Baroque and 42th century was an active family both in their city than in others.   Andrea Castelli da Terni condottiere and hero of the city-state of Terni, he was also a podestà and a politician.   Alessandro and Lucantonio Tomassoni da Terni, condottiere brothers.   Anastasio and Stefano Ciancherotti da Terni condottiere brothers.   Blessed brother Barnaba Manassei His greater fames title is to have set up the order of Monti di Pietà to remedy the disastrous wear that impoverished families and city-states.   Aminale Lodovico, a militar and adventurer who fought with other twelve Italian knights in the ": null
    },
    {
        "Challenge of Barletta": "challenge of barletta"
    },
    {
        " against the French.   ": null
    },
    {
        "Francesco Angeloni": "francesco angeloni"
    },
    {
        ", historian, art collector and writer of Historia di Terni.   ": null
    },
    {
        "Baconin Borzacchini": "baconin borzacchini"
    },
    {
        ", Grand Prix motor racing driver.   ": null
    },
    {
        "Giulio Briccialdi": "giulio briccialdi"
    },
    {
        ", composer and flautist.   ": null
    },
    {
        "Alessandro Casagrande": "alessandro casagrande"
    },
    {
        ", composer and pianist.   ": null
    },
    {
        "Aurelio De Felice": "aurelio de felice"
    },
    {
        ", sculptor.   Sir Cittadini , legendary hero of the city of Terni. He is the one who will free his city from the slavery of a dragon of the swamps.   ": null
    },
    {
        "Libero Liberati": "libero liberati"
    },
    {
        ", ": null
    },
    {
        "42 cc": "moto gp"
    },
    {
        " racer , 42 42cc Grand Prix World Champion.   ": null
    },
    {
        "Fabio Lucioni": "fabio lucioni"
    },
    {
        ", football player   Stefano Micheli, musician    Ettore Patrizi, publisher, LItalia ": null
    },
    {
        "Danilo Petrucci": "danilo petrucci"
    },
    {
        ", ": null
    },
    {
        "Moto GP": "moto gp"
    },
    {
        " racer   ": null
    },
    {
        "Claudio Petruccioli": "claudio petruccioli"
    },
    {
        ", politician and journalist   ": null
    },
    {
        "Oreste Scalzone": "oreste scalzone"
    },
    {
        ", political activist, founder of ": null
    },
    {
        "Potere Operaio": "potere operaio"
    },
    {
        " Marcus Claudius Tacitus": "marcus claudius tacitus"
    },
    {
        ", Roman emperor   ": null
    },
    {
        "Paolo Tagliavento": "paolo tagliavento"
    },
    {
        ", international football referee   ": null
    },
    {
        "Sara Tommasi": "sara tommasi"
    },
    {
        ", actress   ": null
    },
    {
        "Riccardo Zampagna": "riccardo zampagna"
    },
    {
        ", football player   ": null
    },
    {
        "Saint Valentine": "saint valentine"
    },
    {
        ", bishop and martyred saint   ": null
    },
    {
        "Saints Berardo, Ottone, Pietro, Accursio and Adiuto": ":it:berardo, ottone, pietro, accursio e adiuto"
    },
    {
        ", Franciscans protomartyrs.   ": null
    },
    {
        "Alvaro Leonardi": "alvaro leonardi"
    },
    {
        ", military aviator, highly decorated with the ": null
    },
    {
        "Silver Medal of Military Valor": "silver medal of military valor"
    },
    {
        " and with a ": null
    },
    {
        "War Merit Cross": "war merit cross"
    },
    {
        ". Ace fighter, is credited with eight knockdowns during the First World War.   ": null
    },
    {
        "Elia Rossi Passavanti": ":it:elia rossi passavanti"
    },
    {
        " political and military, then mayor of the city of Terni, and local historian. It was one of only two Italians to be decorated with ": null
    },
    {
        "Medal of Military Valor": "medal of military valor"
    },
    {
        " in the First and Second World War.   The Roman historian ": null
    },
    {
        "Gaius Cornelius Tacitus": "gaius cornelius tacitus"
    },
    {
        " is often stated to have been born in Terni, but there is no evidence for the claim, which is circumstantially based on the probable birth there of the emperor of the same name, and on the attested fact that that emperor took care to have his namesakes works widely copied, in the apparent belief that they were related.                   Terni is ": null
    },
    {
        "twinned": "twin towns and sister cities"
    },
    {
        " with:       ": null
    }
]