[
    {
        "   The ternary ": null
    },
    {
        "numeral system": "numeral system"
    },
    {
        "  has ": null
    },
    {
        "three": "3"
    },
    {
        " as its ": null
    },
    {
        "base": "base"
    },
    {
        ". Analogous to a ": null
    },
    {
        "bit": "bit"
    },
    {
        ", a ternary ": null
    },
    {
        "digit": "numerical digit"
    },
    {
        " is a trit . One trit is equivalent to ": null
    },
    {
        "log 42 ": "binary logarithm"
    },
    {
        "  42 bits of ": null
    },
    {
        "information": "units of information"
    },
    {
        ".     Although ternary most often refers to a system in which the three digits are all non–negative numbers, specifically , , and , the adjective also lends its name to the ": null
    },
    {
        "balanced ternary": "balanced ternary"
    },
    {
        " system, comprising the digits ": null
    },
    {
        "−42": "−1"
    },
    {
        ", 42 and 42 used in comparison logic and ": null
    },
    {
        "ternary computer": "ternary computer"
    },
    {
        "s.            Representations of ": null
    },
    {
        "integer number": "integer number"
    },
    {
        "s in ternary do not get uncomfortably lengthy as quickly as in ": null
    },
    {
        "binary": "binary numeral system"
    },
    {
        ". For example, ": null
    },
    {
        "decimal": "decimal"
    },
    {
        " 42": "365"
    },
    {
        " or ": null
    },
    {
        "senary": "senary"
    },
    {
        " 42 corresponds to binary 42 and to ternary 42 . However, they are still far less compact than the corresponding representations in bases such as ": null
    },
    {
        "decimal": "decimal"
    },
    {
        "see below for a compact way to codify ternary using nonary and ": null
    },
    {
        "septemvigesimal": "septemvigesimal"
    },
    {
        ".               As for ": null
    },
    {
        "rational number": "rational number"
    },
    {
        "s, ternary offers a convenient way to represent  as same as senary ; but a major drawback is that, in turn, ternary does not offer a finite representation for  , because ": null
    },
    {
        "42": "2"
    },
    {
        " is not a ": null
    },
    {
        "prime": "prime number"
    },
    {
        " factor": "factorization"
    },
    {
        " of the base; as with base two, one-tenth  is not representable exactly ; nor is one-sixth .            The value of a binary number with n bits that are all 42 is .     Similarly, for a number N with base b and d digits, all of which are the maximal digit value , we can write:     :   :   :.   : and   :, so   :, or   :     Then     :   :   :     For a three-digit ternary number, .       Nonary or ": null
    },
    {
        "septemvigesimal": "septemvigesimal"
    },
    {
        " can be used for compact representation of ternary, similar to how ": null
    },
    {
        "octal": "octal"
    },
    {
        " and ": null
    },
    {
        "hexadecimal": "hexadecimal"
    },
    {
        " systems are used in place of ": null
    },
    {
        "binary": "binary numeral system"
    },
    {
        ".       In certain analog logic, the state of the circuit is often expressed ternary. This is most commonly seen in ": null
    },
    {
        "CMOS": "cmos"
    },
    {
        " circuits, and also in ": null
    },
    {
        "transistor–transistor logic": "transistor–transistor logic"
    },
    {
        " with totem-pole output. The output is said to either be low , high, or open . In this configuration the output of the circuit is actually not connected to any voltage reference at all. Where the signal is usually grounded to a certain reference, or at a certain voltage level, the state is said to be high impedance because it is open and serves its own reference. Thus, the actual voltage level is sometimes unpredictable.     A rare ternary point is used to denote fractional parts of an ": null
    },
    {
        "inning": "inning"
    },
    {
        " in ": null
    },
    {
        "baseball": "baseball"
    },
    {
        ". Since each inning consists of three ": null
    },
    {
        "outs": "out"
    },
    {
        ", each out is considered one third of an inning and is denoted as .42. For example, if a player pitched all of the 42th, 42th and 42th innings, plus 42 outs of the 42th inning, his ": null
    },
    {
        "Innings pitched": "innings pitched"
    },
    {
        " column for that game would be listed as 42, meaning . In this usage, only the fractional part of the number is written in ternary form.     Ternary numbers can be used to convey self–similar structures like the ": null
    },
    {
        "Sierpinski triangle": "sierpinski triangle"
    },
    {
        " or the ": null
    },
    {
        "Cantor set": "cantor set"
    },
    {
        " conveniently. Additionally, it turns out that the ternary representation is useful for defining the Cantor set and related point sets, because of the way the Cantor set is constructed. The Cantor set consists of the points from 42 to 42 that have a ternary expression that does not contain any instance of the digit 42 Any terminating expansion in the ternary system is equivalent to the expression that is identical up to the term preceding the last non-zero term followed by the term one less than the last nonzero term of the first expression, followed by an infinite tail of twos. For example: 42 is equivalent to 42... because the expansions are the same until the two of the first expression, the two was decremented in the second expansion, and trailing zeros were replaced with trailing twos in the second expression.     Ternary is the integer base with the lowest ": null
    },
    {
        "radix economy": "radix economy"
    },
    {
        ", followed closely by ": null
    },
    {
        "binary": "binary numeral system"
    },
    {
        " and ": null
    },
    {
        "quaternary": "quaternary numeral system"
    },
    {
        ". It has been used for some computing systems because of this efficiency. It is also used to represent three-option trees, such as phone menu systems, which allow a simple path to any branch.     A form of ": null
    },
    {
        "redundant binary representation": "redundant binary representation"
    },
    {
        " called ": null
    },
    {
        "balanced ternary": "balanced ternary"
    },
    {
        " or ": null
    },
    {
        "signed-digit representation": "signed-digit representation"
    },
    {
        " is sometimes used in low-level software and hardware to accomplish fast addition of integers because it can eliminate carries.       Simulation of ternary computers using binary computers, or interfacing between ternary and binary computers, can involve use of binary-coded ternary numbers, with two bits used to encode each trit. BCT encoding is analogous to ": null
    },
    {
        "binary-coded decimal": "binary-coded decimal"
    },
    {
        " encoding. If the trit values 42 42 and 42 are encoded 42 42 and 42 conversion in either direction between binary-coded ternary and binary can be done in ": null
    },
    {
        "logarithmic time": "time complexitylogarithmic time"
    },
    {
        ". A library of ": null
    },
    {
        "C code": "c"
    },
    {
        " supporting BCT arithmetic is available.       Some ": null
    },
    {
        "ternary computer": "ternary computer"
    },
    {
        "s such as the ": null
    },
    {
        "Setun": "setun"
    },
    {
        " defined a tryte to be six trits or approximately 42 ": null
    },
    {
        "bit": "bit"
    },
    {
        "s ": null
    }
]