[
    {
        "         The Territoire de Belfort  is a ": null
    },
    {
        "department": "departments of france"
    },
    {
        " in the ": null
    },
    {
        "Bourgogne-Franche-Comté": "bourgogne-franche-comté"
    },
    {
        " region": "regions of france"
    },
    {
        " of eastern ": null
    },
    {
        "France": "france"
    },
    {
        ".       Its departmental code is 42 and its ": null
    },
    {
        "prefecture": "prefectures in france"
    },
    {
        " is ": null
    },
    {
        "Belfort": "belfort"
    },
    {
        ". There is a single ": null
    },
    {
        "arrondissement": "arrondissement"
    },
    {
        " , which is subdivided into 42 ": null
    },
    {
        "cantons": "cantons of the territoire de belfort department"
    },
    {
        " and thence into 42 ": null
    },
    {
        "communes": "communes of the territoire de belfort department"
    },
    {
        ".       The administrative district Territoire de Belfort was created under the terms of the 42 ": null
    },
    {
        "Treaty of Frankfurt": "treaty of frankfurt"
    },
    {
        ". The ": null
    },
    {
        "German Empire": "german empire"
    },
    {
        " annexed almost all of Alsace, but the French were able to negotiate retention of the Territoire de Belfort which thereby was separated from the rest of Alsace . There were three principal reasons for this exceptional treatment:     The population in and around ": null
    },
    {
        "Belfort": "belfort"
    },
    {
        " was French-speaking.   Belfort had demonstrated heroic resistance, under ": null
    },
    {
        "Colonel Pierre Denfert-Rochereau": "pierre philippe denfert-rochereau"
    },
    {
        ", to the German invasion. Belforts ": null
    },
    {
        "left-wing Catholic": "christian socialism"
    },
    {
        " Deputy": "deputy"
    },
    {
        " Émile Keller": "émile keller"
    },
    {
        " now conducted a similarly forceful political campaign in the ": null
    },
    {
        "National Assembly": "national assembly"
    },
    {
        ". He argued that ceding heroic Belfort to Germany after the war would be unthinkable.   With the loss of ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        " and the department of ": null
    },
    {
        "Moselle": "moselle"
    },
    {
        " in ": null
    },
    {
        "Lorraine": "lorraine"
    },
    {
        ", France lost a number of well fortified and naturally favoured military positions that would otherwise have deterred future military aggression from the east. Belfort, on steep ground and lined up with the Vosges Mountains, would form part of a natural line of defence for Frances newly imposed eastern frontier. This encouraged the politicians in Paris to hold out for its retention.     The Germans agreed primarily because the Prussian military officiers indicated that leaving it in France would give Germany a more defensible border.      After retaining its unique status as a territoire for just over half a century, Belfort was officially recognized as Frances 42th department in 42 France had recovered ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        " three years earlier": "treaty of versailles"
    },
    {
        ", but the decision was taken not to reintegrate Belfort into ": null
    },
    {
        "its former department": "haut-rhin"
    },
    {
        ". There was talk of giving it a new departmental name, with suggestions that included ": null
    },
    {
        "Savoureuse": "savoureuse"
    },
    {
        " or ": null
    },
    {
        "Mont-Terrible": "mont-terrible"
    },
    {
        " , but there was no consensus for a name change and the department continues to be known as the Territoire de Belfort.     When the ": null
    },
    {
        "regions of France": "regions of france"
    },
    {
        " were created, Belfort was not included in the region of Alsace, but the adjacent region of ": null
    },
    {
        "Franche-Comté": "franche-comté"
    },
    {
        ", since January 42 ": null
    },
    {
        "Bourgogne-Franche-Comté": "bourgogne-franche-comté"
    },
    {
        ".       The departmental income of the department in 42 had increased to €42  42 which was a little below the overall national figure. The averaged figure for the Territoire de Belfort masked relatively large disparities such as, in particular, that between ": null
    },
    {
        "Belfort": "belfort"
    },
    {
        " itself at €42  42 and ": null
    },
    {
        "Bermont": "bermont"
    },
    {
        " at €42  42        In 42 the department recorded a population of 42. Of these, slightly more than 42 live in the commune of ": null
    },
    {
        "Belfort": "belfort"
    },
    {
        " itself.     Four principal phases can be identified in the population trends during the two centuries between 42 and 42   the period from 42 to 42 was marked by steady economic development and a relatively high birth rate. However, the cholera epidemic which in 42 arose from increasing urbanisation, along with a more general economic slow-down, reduced the rate of increase in the third quarter of the century. Between 42 and 42 the recorded population increased from 42 to 42.   after ": null
    },
    {
        "the loss": "treaty of frankfurt"
    },
    {
        " to ": null
    },
    {
        "Germany": "germany"
    },
    {
        " of most of ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        " in ": null
    },
    {
        "42": "franco-prussian war"
    },
    {
        ", the Belfort population was boosted by the arrival of large numbers of refugees from Germanisation : the years between 42 and 42 saw the development of large factories, with the mechanical and textile sectors being prominent growth areas. The population increase and the economic development were at their most intense in the Belfort conglomeration itself. By 42 the territoires population figure stood at 42.   in the years between 42 and 42 the economic narrative was dominated by two world wars and the period of stagnation that came between them. Population declined, having slipped to 42 in 42   after ": null
    },
    {
        "42": "world war ii"
    },
    {
        " the region became a focus for industrial growth: population levels followed the same rising trend, to stand at 42 in 42 Nevertheless, as in many parts of France, from about 42 it was clear that the ": null
    },
    {
        "economic crisis of the 42s": "1973 oil crisis"
    },
    {
        " was having a lasting effect in slowing the pace of expansion.       Geographers might contend that Belfort lies on the ridge that divides two regions of France, but before ": null
    },
    {
        "42": "franco-prussian war"
    },
    {
        " it was politically part of ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        ". However, in terms of the political ": null
    },
    {
        "regions": "regions of france"
    },
    {
        " established in 42 the Territoire de Belfort has found itself in the ": null
    },
    {
        "Franche-Comté": "franche-comté"
    },
    {
        " rather than ": null
    },
    {
        "Alsace": "alsace"
    },
    {
        ".     The department has an area of only 42  km² , being the fifth smallest of France .                   ": null
    },
    {
        "Lion of Belfort": "lion of belfort"
    },
    {
        " Savoureuse": "savoureuse"
    },
    {
        " Eurockéennes": "eurockéennes"
    }
]