[
    {
        "         Tetraplegia, also known as quadriplegia, is ": null
    },
    {
        "paralysis": "paralysis"
    },
    {
        " caused by illness or injury that results in the partial or total loss of use of all four limbs and torso; ": null
    },
    {
        "paraplegia": "paraplegia"
    },
    {
        " is similar but does not affect the arms. The loss is usually sensory and motor, which means that both sensation and control are lost. The paralysis may be ": null
    },
    {
        "flaccid": "flaccid paralysis"
    },
    {
        " or ": null
    },
    {
        "spastic": "spastic quadriplegia"
    },
    {
        ".         Although the most obvious symptom is impairment of the limbs, functioning is also impaired in the ": null
    },
    {
        "torso": "torso"
    },
    {
        ". This can mean a loss or impairment in controlling ": null
    },
    {
        "bowel": "fecal incontinence"
    },
    {
        " and ": null
    },
    {
        "bladder": "urinary incontinence"
    },
    {
        ", sexual function, digestion, breathing and other ": null
    },
    {
        "autonomic": "autonomic nervous system"
    },
    {
        " functions. Furthermore, sensation is usually impaired in affected areas. This can manifest as numbness, reduced sensation or burning ": null
    },
    {
        "neuropathic pain": "neuralgia"
    },
    {
        ". Secondarily, because of their depressed functioning and immobility, people with tetraplegia are often more vulnerable to ": null
    },
    {
        "pressure sores": "bedsore"
    },
    {
        ", ": null
    },
    {
        "osteoporosis": "osteoporosis"
    },
    {
        " and fractures, frozen joints, ": null
    },
    {
        "spasticity": "spasticity"
    },
    {
        ", respiratory complications and infections, ": null
    },
    {
        "autonomic dysreflexia": "autonomic dysreflexia"
    },
    {
        ", ": null
    },
    {
        "deep vein thrombosis": "deep vein thrombosis"
    },
    {
        ", and cardiovascular disease.     The severity of the condition depends on both the level at which the spinal cord is injured and the extent of the injury. An individual with an injury at C42 will probably lose function from the neck down and be ": null
    },
    {
        "ventilator": "ventilator"
    },
    {
        "-dependent. An individual with a C42 injury may lose function from the chest down but still retain use of the arms and much of the hands.     The extent of the injury is also important. A complete severing of the spinal cord will result in complete loss of function from that vertebra down. A partial severing or even bruising of the spinal cord results in varying degrees of mixed function and paralysis. A common misconception with tetraplegia is that the victim cannot move legs, arms or any of the major function; this is often not the case. Some individuals with tetraplegia can walk and use their hands, as though they did not have a spinal cord injury, while others may use wheelchairs and they can still have function of their arms and mild finger movement; again, that varies on the spinal cord damage.     It is common to have movement in limbs, such as the ability to move the arms but not the hands, or to be able to use the fingers but not to the same extent as before the injury. Furthermore, the deficit in the limbs may not be the same on both sides of the body; either left or right side may be more affected, depending on the location of the lesion on the spinal cord.         Tetraplegia is caused by damage to the ": null
    },
    {
        "brain": "brain"
    },
    {
        " or the ": null
    },
    {
        "spinal cord": "spinal cord"
    },
    {
        " at a high level. The injury, which is known as a ": null
    },
    {
        "lesion": "lesion"
    },
    {
        ", causes victims to lose partial or total function of all four limbs, meaning the arms and the legs. Typical causes of this damage are trauma , disease , or ": null
    },
    {
        "congenital disorder": "congenital disorder"
    },
    {
        "s .     Tetraplegia is defined in many ways; C42–C42 usually affects arm movement more so than a C42–C42 injury; however, all tetraplegics have or have had some kind of finger dysfunction. So, it is not uncommon to have a tetraplegic with fully functional arms but no nervous control of their fingers and thumbs. It is possible to suffer a broken neck without becoming tetraplegic if the vertebrae are fractured or dislocated but the spinal cord is not damaged. Conversely, it is possible to injure the spinal cord without breaking the spine, for example when a ruptured ": null
    },
    {
        "disc": "intervertebral disc"
    },
    {
        " or bone spur on the vertebra protrudes into the spinal column.         ": null
    },
    {
        "Spinal cord injuries": "spinal cord injuries"
    },
    {
        " are classified as complete and incomplete by the ": null
    },
    {
        "American Spinal Injury Association": "american spinal injury association"
    },
    {
        " classification. The ASIA scale grades patients based on their functional impairment as a result of the injury, grading a patient from A to D. This has considerable consequences for surgical planning and therapy.            Pathophysiologically, the spinal cord of the tetraplegic patient can be divided into three segments which can be useful for classifying the injury.     First, there is an injured functional medullary segment. This segment has unparalysed, functional muscles; the action of these muscles is voluntary, not permanent and ": null
    },
    {
        "hand strength": "hand strength"
    },
    {
        " can be evaluated by the Medical Research Council Scale. This scale is used when upper limb surgery is planned, as referred to in the International Classification for hand surgery in tetraplegic patients.     A lesional segment consists of denervated corresponding muscles. The lower motor neuron of these muscles is damaged. These muscles are hypotonic, atrophic and have no spontaneous contraction. The existence of joint contractures should be monitored.     Below the level of the injured metamere, there is an injured sublesional segment with the intact lower motor neuron, which means that medullary reflexes are present, but the upper cortical control is lost. These muscles show some increase in tone when elongated and sometimes spasticity, the trophicity is good.          Incomplete spinal cord injuries result in varied post injury presentations. There are three main syndromes described, depending on the exact site and extent of the lesion.   ": null
    },
    {
        "Central cord syndrome": "central cord syndrome"
    },
    {
        ": most of the cord lesion is in the gray matter of the spinal cord, sometimes the lesion continues in the white matter.   ": null
    },
    {
        "Brown-Séquard syndrome": "brown-séquard syndrome"
    },
    {
        ": hemisection of the spinal cord.   ": null
    },
    {
        "Anterior cord syndrome": "anterior cord syndrome"
    },
    {
        ": a lesion of the anterior horns and the anterolateral tracts, with a possible division of the anterior spinal artery.     For most patients with ASIA A tetraplegia, ASIA B tetraplegia and ASIA C tetraplegia, the International Classification level of the patient can be established without great difficulty. The surgical procedures according to the International Classification level can be performed. In contrast, for patients with ASIA D tetraplegia it is difficult to assign an International Classification other than International Classification level X . Therefore, it is more difficult to decide which surgical procedures should be performed. A far more personalized approach is needed for these patients. Decisions must be based more on experience than on texts or journals.     The results of tendon transfers for patients with complete injuries are predictable. On the other hand, it is well known that muscles lacking normal excitation perform unreliably after surgical tendon transfers. Despite the unpredictable aspect in incomplete lesions, tendon transfers may be useful. The surgeon should be confident that the muscle to be transferred has enough power and is under good voluntary control. Pre-operative assessment is more difficult to assess in incomplete lesions.     Patients with an incomplete lesion also often need therapy or surgery before the procedure to restore function to correct the consequences of the injury. These consequences are hypertonicity/spasticity, contractures, painful hyperesthesias and paralyzed proximal upper limb muscles with distal muscle sparing.     Spasticity is a frequent consequence of incomplete injuries. Spasticity often decreases function, but sometimes a patient can control the spasticity in a way that it is useful to their function. The location and the effect of the spasticity should be analyzed carefully before treatment is planned. An injection of ": null
    },
    {
        "Botulinum toxin": "botulinum toxin"
    },
    {
        " into spastic muscles is a treatment to reduce spasticity. This can be used to prevent muscle shorting and early contractures.     Over the last ten years, an increase in traumatic incomplete lesions is seen, due to the better protection in traffic.          Upper limb paralysis refers to the loss of function of the elbow and hand. When upper limb function is absent as a result of a spinal cord injury it is a major barrier to regain autonomy. People with tetraplegia should be examined and informed concerning the options for reconstructive surgery of the tetraplegic arms and hands.          Delayed diagnosis of cervical spine injury has grave consequences for the victim. About one in 42 cervical fractures are missed and about two-thirds of these patients have further spinal-cord damage as a result. About 42% of cases of delayed diagnosis of cervical spine injury develop permanent neurological deficits. In high-level cervical injuries, total paralysis from the neck can result. High-level tetraplegics will likely need constant care and assistance in ": null
    },
    {
        "activities of daily living": "activities of daily living"
    },
    {
        ", such as getting dressed, eating and bowel and bladder care. Low-level tetraplegics can often live independently.     Even with complete injuries, in some rare cases, through intensive rehabilitation, slight movement can be regained through ": null
    },
    {
        " rewiring neural connections": "synaptic plasticity"
    },
    {
        ", as in the case of the late actor ": null
    },
    {
        "Christopher Reeve": "christopher reeve"
    },
    {
        ".     In the case of ": null
    },
    {
        "cerebral palsy": "cerebral palsy"
    },
    {
        ", which is caused by damage to the motor cortex either before, during , or after birth, some people with tetraplegia are gradually able to learn to stand or walk through physical therapy.     Quadriplegics can improve muscle strength by performing resistance training at least three times per week. Combining resistance training with proper nutrition intake can greatly reduce co-morbidities such as obesity and type 42 diabetes.          There are an estimated 42 spinal cord injuries each year in the United States; the total number of people affected by spinal cord injuries is estimated to be approximately 42 people.     In the US, spinal cord injuries alone cost approximately US$42  billion each year, which is a 42 percent increase from costs estimated in 42 .     The estimated lifetime costs for a 42-year-old in 42 is $42  million when affected by low tetraplegia and $42  million when affected by high tetraplegia. In 42 it was estimated that the lifetime care of a 42-year-old rendered with low tetraplegia was about $42  million, and $42  million with high tetraplegia.     There are about 42 people affected each year in the UK .       The condition of paralysis affecting four limbs is alternately termed tetraplegia or quadriplegia. Quadriplegia combines the ": null
    },
    {
        "Latin": "latin"
    },
    {
        " root quadra, for four , with the ": null
    },
    {
        "Greek": "greek language"
    },
    {
        " root πληγία plegia, for paralysis . Tetraplegia uses the Greek root τετρα tetra for four . Quadriplegia is the common term in North America; tetraplegia is more commonly used in Europe.": null
    }
]