[
    {
        "                  Textile arts are ": null
    },
    {
        "art": "art"
    },
    {
        "s and ": null
    },
    {
        "craft": "craft"
    },
    {
        "s that use ": null
    },
    {
        "plant": "fiber crop"
    },
    {
        ", ": null
    },
    {
        "animal": "animal fiber"
    },
    {
        ", or ": null
    },
    {
        "synthetic": "synthetic fiber"
    },
    {
        " fiber": "fiber"
    },
    {
        "s to construct practical or decorative objects.     ": null
    },
    {
        "Textile": "textile"
    },
    {
        "s have been a fundamental part of human life since the beginning of ": null
    },
    {
        "civilization": "civilization"
    },
    {
        ". The methods and materials used to make them have expanded enormously, while the functions of textiles have remained the same. The history of textile arts is also the history of ": null
    },
    {
        "international trade": "international trade"
    },
    {
        ". ": null
    },
    {
        "Tyrian purple": "tyrian purple"
    },
    {
        " dye": "dye"
    },
    {
        " was an important trade good in the ancient ": null
    },
    {
        "Mediterranean": "mediterranean"
    },
    {
        ". The ": null
    },
    {
        "Silk Road": "silk road"
    },
    {
        " brought ": null
    },
    {
        "Chinese": "china"
    },
    {
        " silk to ": null
    },
    {
        "India": "india"
    },
    {
        ", ": null
    },
    {
        "Africa": "africa"
    },
    {
        ", and ": null
    },
    {
        "Europe": "europe"
    },
    {
        ". Tastes for imported luxury ": null
    },
    {
        "fabric": "fabric"
    },
    {
        "s led to ": null
    },
    {
        "sumptuary law": "sumptuary law"
    },
    {
        "s during the ": null
    },
    {
        "Middle Ages": "middle ages"
    },
    {
        " and ": null
    },
    {
        "Renaissance": "renaissance"
    },
    {
        ". The ": null
    },
    {
        "Industrial Revolution": "industrial revolution"
    },
    {
        " was shaped largely by innovation in textiles technology: the ": null
    },
    {
        "cotton gin": "cotton gin"
    },
    {
        ", the ": null
    },
    {
        "spinning jenny": "spinning jenny"
    },
    {
        ", and the ": null
    },
    {
        "power loom": "power loom"
    },
    {
        " mechanized production and led to the ": null
    },
    {
        "Luddite": "luddite"
    },
    {
        " rebellion.       The word textile is from ": null
    },
    {
        "Latin": "latin"
    },
    {
        " texere which means to weave , to braid or to construct . The simplest textile art is ": null
    },
    {
        "felt": "felt"
    },
    {
        "ing, in which animal fibers are matted together using heat and moisture. Most textile arts begin with twisting or ": null
    },
    {
        "spinning": "spinning"
    },
    {
        " and ": null
    },
    {
        "plying": "plying"
    },
    {
        " fibers to make ": null
    },
    {
        "yarn": "yarn"
    },
    {
        " . The yarn is then ": null
    },
    {
        "knotted": "macrame"
    },
    {
        ", ": null
    },
    {
        "looped": "loop"
    },
    {
        ", ": null
    },
    {
        "braid": "braid"
    },
    {
        "ed, or ": null
    },
    {
        "woven": "weaving"
    },
    {
        " to make flexible fabric or cloth, and cloth can be used to make ": null
    },
    {
        "clothing": "clothing"
    },
    {
        " and soft furnishings. All of these items & ndash; felt, yarn, fabric, and finished objects & ndash; are collectively referred to as textiles.     The textile arts also include those techniques which are used to embellish or decorate textiles & ndash; ": null
    },
    {
        "dyeing": "dyeing"
    },
    {
        " and ": null
    },
    {
        "printing": "textile printing"
    },
    {
        " to add ": null
    },
    {
        "color": "color"
    },
    {
        " and pattern; ": null
    },
    {
        "embroidery": "embroidery"
    },
    {
        " and other types of ": null
    },
    {
        "needlework": "needlework"
    },
    {
        "; ": null
    },
    {
        "tablet weaving": "tablet weaving"
    },
    {
        "; and ": null
    },
    {
        "lace": "lace"
    },
    {
        "-making. Construction methods such as ": null
    },
    {
        "sewing": "sewing"
    },
    {
        ", ": null
    },
    {
        "knitting": "knitting"
    },
    {
        ", ": null
    },
    {
        "crochet": "crochet"
    },
    {
        ", and ": null
    },
    {
        "tailoring": "tailoring"
    },
    {
        ", as well as the tools employed , techniques employed  and the objects made  all fall under the category of textile arts.         From early times, textiles have been used to cover the human body and protect it from the elements; to send ": null
    },
    {
        "social cues": "social interaction"
    },
    {
        " to other people; to store, secure, and protect possessions; and to soften, insulate, and decorate living spaces and surfaces.     The persistence of ancient textile arts and functions, and their elaboration for decorative effect, can be seen in a ": null
    },
    {
        "Jacobean era": "jacobean era"
    },
    {
        " portrait of ": null
    },
    {
        "Henry Frederick, Prince of Wales": "henry frederick, prince of wales"
    },
    {
        " by ": null
    },
    {
        "Robert Peake the Elder": "robert peake the elder"
    },
    {
        " . The princes ": null
    },
    {
        "capotain": "capotain"
    },
    {
        " hat": "hat"
    },
    {
        " is made of felt using the most basic of textile techniques. His clothing is made of woven cloth, richly embroidered in ": null
    },
    {
        "silk": "silk"
    },
    {
        ", and his ": null
    },
    {
        "stocking": "stocking"
    },
    {
        "s are knitted. He stands on an ": null
    },
    {
        "oriental rug": "oriental rug"
    },
    {
        " of ": null
    },
    {
        "wool": "wool"
    },
    {
        " which softens and warms the floor, and heavy ": null
    },
    {
        "curtain": "curtain"
    },
    {
        "s both decorate the room and block cold drafts from the window. ": null
    },
    {
        "Goldwork embroidery": "goldwork"
    },
    {
        " on the ": null
    },
    {
        "tablecloth": "tablecloth"
    },
    {
        " and curtains proclaim the status of the homes owner, in the same way that the felted fur hat, sheer ": null
    },
    {
        "linen": "linen"
    },
    {
        " shirt": "shirt"
    },
    {
        " trimmed with ": null
    },
    {
        "reticella": "reticella"
    },
    {
        " lace, and opulent embroidery on the princes clothes proclaim his social position. For general discussion of textile techniques in this era and their significance, see  and , as well as , throughout.       Traditionally the term art was used to refer to any skill or mastery, a concept which altered during the ": null
    },
    {
        "Romantic": "romanticism"
    },
    {
        " period of the nineteenth century, when art came to be seen as a special faculty of the human mind to be classified with religion and science .  This distinction between craft and ": null
    },
    {
        "fine art": "fine art"
    },
    {
        " is applied to the textile arts as well, where the term  fiber art  or textile art is now used to describe textile-based decorative objects which are not intended for practical use.         Natural fibers have been an important aspect of human society since 42 B.C.,  and it is suspected that they were first used in ornamental cloths since 42 B.C. in India where cotton was first grown.  Natural fibers have been used for the past 42 to 42 years to make cloth, and plant and animal fibers were the only way that clothing and fabrics could be created up until 42 when the first synthetic fiber was made. Cotton and flax are two of the most common natural fibers that are used today, but historically natural fibers were made of most parts of the plant, including bark, stem, leaf, fruit, seed hairs, and sap.          Flax is believed to be the oldest fiber that was used to create textiles, as it was found in the tombs of mummies from as early as 42 B.C.  The fibers from the flax are taken from the filaments in the stem of the plant, spun together to create long strands, and then woven into long pieces of linen that were used from anything from bandages to clothing and tapestries. Each fibers length depends on the height of the leaf that it is serving, with 42 filaments in a bundle serving each leaf on the plant. Each filament is the same thickness, giving it a consistency that is ideal for spinning yarn. The yarn was best used on warping boards or warping reels to create large pieces of cloth that could be dyed and woven into different patterns to create elaborate tapestries and embroideries. One example of how linen was used is in the picture of a bandage that a mummy was wrapped in, dated between 42 and 42 B.C. Some of the bandages were painted with hieroglyphs if the person being buried was of importance to the community.          Cotton was first used in 42 B.C. in India and the Middle East, and spread to Europe after they invaded India in 42 B.C. The manufacture and production of cotton spread rapidly in the 42th century, and it quickly became one of the most important textile fibers because of its comfort, durability, and absorbency. Cotton fibers are seed hairs formed in a capsule that grows after the plant flowers. The fibers complete their growth cycle and burst to release about 42 seeds that each have between 42 and 42 seed hairs that are between 42 and 42 millimeters long. About 42% of the seed hairs are cellulose, with the other 42% being wax, pectate, protein, and other minerals. Once it is processed, cotton can be spun into yarn of various thicknesses to be woven or knitted into various different products such as velvet, chambray, corduroy, jersey, flannel, and velour that can be used in clothing tapestries, rugs, and drapes, as shown in the image of the cotton tapestry that was woven in India.       Light microscopy, normal transmission electron microscopy, and most recently scanning electron microscopy are used to study ancient textile remains to determine what natural fibers were used to create them.  Once textiles are found, the fibers are teased out using a light microscope and an SEM is used to look for characteristics in the textile that show what plant it is made of. In flax, for example, scientists look for longitudinal striations that show the cells of the plant stem and cross striations and nodes that are specific to flax fibers. Cotton is identified by the twist that occurs in the seed hairs when the fibers are dried to be woven. This knowledge helps us to learn where and when the cultivation of plants that are used in textiles first occurred, confirming the previous knowledge that was gained from studying the era in which different textile arts aligned with from a perspective of design.       While plant use in textile art is still common today, there are new innovations being developed, such as Suzanne Lees art installation “BioCouture.” Lee uses fermentation to create a plant-based paper sheet that can be cut and sewn just like cloth- ranging in thickness from thin plastic-like materials up to thick leather-like sheets.  The garments are “disposable” because they are made entirely of plant based products and are completely biodegradable. Within her project, Lee places a large emphasis on making the clothing look fashionable by using avant-garde style and natural dyes made from fruits because compostable clothing is not appealing to most shoppers. In addition, there is a possibility to create designs with the plants by tearing or cutting the growing sheet and allowing it to heal to create a pattern made of scars on the textile. The possibilities to use this textile in art installations is incredible because artists would have the ability to create a living art piece, such as Lee does with her clothing.       ": null
    },
    {
        "Caroline Achaintre": "caroline achaintre"
    },
    {
        " Anni Albers": "anni albers"
    },
    {
        " El Anatsui": "el anatsui"
    },
    {
        " Ian Berry": "denimu"
    },
    {
        "    Alighiero Boetti": "alighiero boetti"
    },
    {
        " Nick Cave": "nick cave"
    },
    {
        " Tracey Emin": "tracey emin"
    },
    {
        "    Sheila Hicks": "sheila hicks"
    },
    {
        " Britta Marakatt-Labba": "britta marakatt-labba"
    },
    {
        "    Mascha Mioni": "mascha mioni"
    },
    {
        " Grayson Perry": "grayson perry"
    },
    {
        "    Erin M. Riley": "erin m. riley"
    },
    {
        " Faith Ringgold": "faith ringgold"
    },
    {
        " Judith Scott": "judith scott"
    },
    {
        " Kiki Smith": "kiki smith"
    },
    {
        " Joana Vasconcelos": "joana vasconcelos"
    },
    {
        " Yoshiko Iwamoto Wada": "yoshiko iwamoto wada"
    },
    {
        " Brent Wadden": "brent wadden"
    },
    {
        " Pae White": "pae white"
    },
    {
        " Billie Zangewa": "billie zangewa"
    },
    {
        " Rodrigo Franzao": "rodrigo franzao"
    },
    {
        "         , 4242 C.E., ": null
    },
    {
        "Brooklyn Museum": "brooklyn museum"
    }
]