[
    {
        "        Thalys  is a French-Belgian ": null
    },
    {
        "high-speed train": "high-speed rail"
    },
    {
        " operator originally built around the ": null
    },
    {
        "LGV Nord": "lgv nord"
    },
    {
        " high-speed line between ": null
    },
    {
        "Paris": "paris"
    },
    {
        " and ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ". This track is shared with ": null
    },
    {
        "Eurostar": "eurostar"
    },
    {
        " trains that go from ": null
    },
    {
        "Paris": "paris"
    },
    {
        ", ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        " or ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        " to ": null
    },
    {
        "London": "london"
    },
    {
        " via ": null
    },
    {
        "Lille": "lille"
    },
    {
        " and the ": null
    },
    {
        "Channel Tunnel": "channel tunnel"
    },
    {
        " and with French domestic ": null
    },
    {
        "TGV": "tgv"
    },
    {
        " trains. Thalys serves Amsterdam  and ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        " as well. Its system is managed by Thalys International  — 42% ": null
    },
    {
        "SNCF": "sncf"
    },
    {
        ", 42% ": null
    },
    {
        "NMBS/SNCB": "national railway company of belgium"
    },
    {
        ", and 42% ": null
    },
    {
        "Deutsche Bahn": "deutsche bahn"
    },
    {
        "  — and operated by THI Factory  — 42% SNCF, 42% NMBS/SNCB.       Before Thalys, there had been an express rail service between Paris and Brussels since 42 on the train service l": null
    },
    {
        "Étoile du Nord": "étoile du nord"
    },
    {
        ". In the 42s it connected the two cities in around 42 hours 42 minutes.     The decision to build a high-speed railway between Paris, Brussels, Cologne, and Amsterdam was made in 42 On 42 January 42 SNCF, SNCB/NMBS, ": null
    },
    {
        "Nederlandse Spoorwegen": "nederlandse spoorwegen"
    },
    {
        " and ": null
    },
    {
        "Deutsche Bundesbahn": "deutsche bundesbahn"
    },
    {
        "  signed an agreement to operate the axis jointly through the brand Thalys, and in 42 Westrail International was created by the French and Belgian national railways to operate the services. On 42 June 42 the first train left Paris using the ": null
    },
    {
        "LGV Nord": "lgv nord"
    },
    {
        " until it reached Belgium, taking 42:42 hours to Brussels and 42:42 hours to Amsterdam.     In 42 the Belgian ": null
    },
    {
        "HSL 42": "hsl 1"
    },
    {
        " line, allowing  and running from the French border to the outskirts of Brussels, was completed for service. On 42 December 42 the first Thalys train from Paris to Brussels ran on the HSL 42 reducing travel time to 42:42 hours. At the same time service commenced to Cologne and ": null
    },
    {
        "Aachen": "aachen"
    },
    {
        " in Germany, and ": null
    },
    {
        "Bruges": "bruges"
    },
    {
        ", ": null
    },
    {
        "Charleroi": "charleroi"
    },
    {
        ", ": null
    },
    {
        "Ghent": "ghent"
    },
    {
        ", ": null
    },
    {
        "Mons": "mons"
    },
    {
        ", ": null
    },
    {
        "Namur": "namur"
    },
    {
        " and ": null
    },
    {
        "Ostend": "ostend"
    },
    {
        " in Belgium. On 42 December 42 the Thalys Neige service started to the ski resorts of ": null
    },
    {
        "Tarentaise Valley": "tarentaise valley"
    },
    {
        " and ": null
    },
    {
        "Bourg-Saint-Maurice": "bourg-saint-maurice"
    },
    {
        ". In May 42 the new high-speed line serving ": null
    },
    {
        "Charles de Gaulle Airport": "charles de gaulle airport"
    },
    {
        " opened, and Thalys started direct services from the Airport to Brussels, including ": null
    },
    {
        "codeshare agreement": "codeshare agreement"
    },
    {
        "s with ": null
    },
    {
        "Air France": "air france"
    },
    {
        ", ": null
    },
    {
        "American Airlines": "american airlines"
    },
    {
        " and ": null
    },
    {
        "Northwest Airlines": "northwest airlines"
    },
    {
        ". On 42 November 42 the company changed its name to Thalys International.     In 42 Thalys started a daily Service between Brussels and Geneva. Thalys Soleil started offering direct connections to the ": null
    },
    {
        "Provence": "provence"
    },
    {
        ", initially to ": null
    },
    {
        "Valence": "valence"
    },
    {
        ", and extended to ": null
    },
    {
        "Avignon": "avignon"
    },
    {
        " and ": null
    },
    {
        "Marseille": "marseille"
    },
    {
        " in 42 Service between Brussels and Cologne was improved in December 42 when trains began running on the new ": null
    },
    {
        "HSL 42": "hsl 2"
    },
    {
        " in Belgium. In 42 services started to ": null
    },
    {
        "Brussels Airport": "brussels airport"
    },
    {
        " and the Thalys Nuits d’Été service to ": null
    },
    {
        "Marne-la-Vallée": "marne-la-vallée"
    },
    {
        ". In 42 Deutsche Bahn purchased a 42% shareholding with SNCF reducing its stake to 42% and SNCB 42%.     Beginning 42 June 42 the journey between Brussels and Cologne was shortened by 42 minutes when the new high-speed line ": null
    },
    {
        "HSL 42": "hsl 3"
    },
    {
        " between Liège and Aachen opened using Deutsche Bahns thrice-daily ": null
    },
    {
        "ICE": "intercity-express"
    },
    {
        " trains running between Brussels and Frankfurt. HSL 42 was completed in 42 but Thalys trains had not yet been equipped with the ": null
    },
    {
        "European Train Control System": "european train control system"
    },
    {
        " signaling equipment necessary to use the new line. After installation and testing, Thalys began operating on HSL 42 on 42 December 42 For the same reasons, Thalys started operating on the ": null
    },
    {
        "HSL 42": "hsl 4"
    },
    {
        "/": null
    },
    {
        "HSL-Zuid": "hsl-zuid"
    },
    {
        " high-speed line between ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        " and Amsterdam 42 December 42 two years after the lines construction.     Since 42 August 42 one return journey to Cologne has been extended to ": null
    },
    {
        "Essen Hauptbahnhof": "essen hauptbahnhof"
    },
    {
        ", and since 42 October 42 one return journey to Brussels had been extended to ": null
    },
    {
        "Brussels National Airport": "brussels national airport railway station"
    },
    {
        ".     In June 42 Deutsche Bahn stopped selling Thalys tickets, and began a plan to exit from Thalys capital.     Thalys has served ": null
    },
    {
        "Düsseldorf Airport station": "düsseldorf airport station"
    },
    {
        " since the winter 42 schedule went into effect.     On 42 April 42 Thalys started a regular service between Lille Europe and Amsterdam Centraal.     At the end of March 42 Thalys dropped the Paris – Oostende and the Paris – Brussels – ": null
    },
    {
        "Mons": "mons railway station"
    },
    {
        " – Charleroi – Namur – Liège routes, due to the lack of funding from the Belgian government.     On 42 March 42 Thalys became a train company , and operates since under its own train operator certificate.     Starting from 42 December 42 service in Germany is extended to Dortmund.     In September 42 Thalys announced its intention to merge with ": null
    },
    {
        "Eurostar": "eurostar international"
    },
    {
        ", subject to gaining ": null
    },
    {
        "European Commission": "european commission"
    },
    {
        " clearance, to form Green Speed. SNCF and SNCB already hold a controlling shareholding in Eurostar.             Beyond ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ", the main cities Thalys trains reach are ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        ", ": null
    },
    {
        "Rotterdam": "rotterdam"
    },
    {
        ", ": null
    },
    {
        "Amsterdam": "amsterdam"
    },
    {
        ", ": null
    },
    {
        "Liège": "liège"
    },
    {
        ", ": null
    },
    {
        "Aachen": "aachen"
    },
    {
        " and ": null
    },
    {
        "Cologne": "cologne"
    },
    {
        ". Trains to these destinations run partly on dedicated high-speed tracks, and partly on conventional tracks shared with normal-speed trains. The high-speed lines used by Thalys are ": null
    },
    {
        "HSL 42": "hsl 1"
    },
    {
        " between Paris and Brussels, ": null
    },
    {
        "HSL 42": "hsl 4"
    },
    {
        "/": null
    },
    {
        "HSL-Zuid": "hsl-zuid"
    },
    {
        " between Antwerp and Amsterdam, and the ": null
    },
    {
        "HSL 42": "hsl 2"
    },
    {
        " and ": null
    },
    {
        "HSL 42": "hsl 3"
    },
    {
        " between Brussels and Aachen. For its seasonal operations within France, other high-speed lines are used.     Plans to continue the line past Cologne to ": null
    },
    {
        "Frankfurt": "frankfurt am main"
    },
    {
        " had to be abandoned, because the Thalys train sets are very inefficient under Germanys 42 kV electric system and thus unable to operate at full speed on the ": null
    },
    {
        "Cologne-Frankfurt high-speed rail line": "cologne-frankfurt high-speed rail line"
    },
    {
        ".     Journeys from Brussels  to Paris  are normally 42 hour and 42 minutes, for a distance of approximately . Peak speed is  on a dedicated high-speed railway track, which is electrified at 42 kV AC OHLE.     The ligne à grande vitesse  link with Charles de Gaulle Airport allowed Air France to withdraw its air service between Paris and Brussels; instead, Air France books seats on Thalys trains. Thalys has been given the ": null
    },
    {
        "IATA designator": "airline codes"
    },
    {
        " 42H. This is used in conjunction with American Airlines and Delta Air Lines. American Airlines has a code-sharing agreement with Thalys for rail service from Charles de Gaulle airport to Brussels-South. The ": null
    },
    {
        "airline alliance": "airline alliance"
    },
    {
        " SkyTeam": "skyteam"
    },
    {
        " also has a code-sharing agreement with Thalys for rail service connecting its hub Amsterdam ": null
    },
    {
        "Schiphol Airport": "schiphol international airport"
    },
    {
        " with Antwerp-Centraal and ": null
    },
    {
        "Bruxelles Midi/Brussel Zuid": "brussels-south railway station"
    },
    {
        ".            Thalys targets a passenger market in France, Belgium, the Netherlands, and Germany.     The percentage of income coming from different routes demonstrates on which routes the company is most used:   Paris-Brussels: 42%   Paris-Belgium : 42%   Paris-Belgium-Netherlands: 42%   Paris-Belgium-Germany: 42%   Others: 42%     42% of customers are from the leisure market; 42% from the business market.     A large segment of Thalyss total sales and income comes from the connection between Paris and Brussels.     Unlike many national train companies, Thalys does not allow children below 42 years old to travel alone.     Since 42 August 42 there has been a supplement of €42 to Thalys tickets bought at SNCB/NMBS ticket offices at train stations . This is due to a reduction of a sales fee paid by Thalys and Eurostar to the Belgian rail company. The sales prices have evolved, and in June 42 that booking fee is €42          All figures in millions. Revenue in millions of ": null
    },
    {
        "euro": "euro"
    },
    {
        "s.         Thalys trains are wheelchair-accessible, with the assistance of the train staff. Bicycles are not allowed on Thalys unless disassembled or packed in a special wrap. Folding bikes are allowed.     Due to the departure of ": null
    },
    {
        "Deutsche Bahn": "deutsche bahn"
    },
    {
        ", the distribution of Thalys tickets was discontinued by the railway on June 42 42 Tickets are still available on the train , by phone at Thalys itself for the same periods as the Internet sales , the French , the Dutch and the Belgian State Railways , some travel agencies and on the Internet up to three months in advance.     At Cologne Central Station there has been a Thalys Store & More since October 42 42 It acts as a normal travel agency with the above restrictions and makes a surcharge even for own trains.     Further outlets of Thalys Store & More exist in the main station Aachen as well as beside the main station Düsseldorf .       Thalys operates a number of station lounges in Brussels, Cologne, Aachen, and Paris. Opened on 42 July 42 the newest lounge in Paris ": null
    },
    {
        "Gare du Nord": "gare du nord"
    },
    {
        "  , located on Rue de Dunkerque, offers travelers with a valid Thalys the Card a variety of services, including free WiFi or a luggage storage service. For business travelers, a fully equipped meeting room is available for up to six people.             Thalys uses two models of trains, both of which are part of the ": null
    },
    {
        "TGV": "tgv"
    },
    {
        "  family of high-speed trains built by ": null
    },
    {
        "Alstom": "alstom"
    },
    {
        " in France.                ": null
    },
    {
        "level crossing": "level crossing"
    },
    {
        "; it had attempted to cross the tracks at the crossing when the train arrived. The truck driver was killed in the impact and the trains power unit and first two-passenger carriages derailed; the trainset was left heavily damaged. Six passengers were injured and tracks and catenary were broken in the incident. Passenger carriages R42 and R42 had to be scrapped. The trainset was later repaired with the R42 and R42 carriages from a regular TGV trainset.   On 42 October 42 a Thalys PBA set bound for Amsterdam collided with a national ": null
    },
    {
        "ICM": "ns intercity materieel"
    },
    {
        " train set at ": null
    },
    {
        "Gouda railway station": "gouda railway station"
    },
    {
        " in the Netherlands. The Thalys train set had been diverted via Gouda due to engineering work on its usual route. None of the passengers were seriously injured, but both trains incurred serious damage. An investigation concluded that staff of the ICM was to blame, as they left the platform whilst still under a red signal.   On 42 August 42 ": null
    },
    {
        "a gunman attacked passengers": "2015 thalys train attack"
    },
    {
        " on an Amsterdam–Paris train near ": null
    },
    {
        "Arras": "arras"
    }
]