[
    {
        "The Man in the Bottle is episode 42 of the American television series  The Twilight Zone . It originally aired on October 42 42 on CBS.              A poor elderly woman visits Arthur Castle, an unsuccessful antiques dealer, bringing a wine bottle she found in a trash can. It has no value, but he buys it for a small amount out of pity. The bottle proves to contain a ": null
    },
    {
        "genie": "jinn"
    },
    {
        ", who offers to grant four wishes to Castle and his wife. They use their first wish to repair a broken glass cabinet, proving the genies power, and then receive a million dollars in cash upon making their second wish. After they have given tens of thousands away to their friends, an ": null
    },
    {
        "IRS": "internal revenue service"
    },
    {
        " employee visits the shop and presents the Castles with a tax bill that leaves them with only $42 once they pay it.     The genie warns them that every wish has consequences, and that they should think carefully before making their next one. Castle decides that he wants to be in a position of great power, and wishes to be the leader of a modern and powerful country in which he cannot be voted out of office. He is turned into ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " and transported to the last days of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", hiding in the  Führerbunker  as one of his men brings him a vial of ": null
    },
    {
        "cyanide": "cyanide"
    },
    {
        " so he can ": null
    },
    {
        "kill himself": "death of adolf hitler"
    },
    {
        ". In desperation, he makes his last wish -- to be returned to his old life, throwing the vial to the floor.     In an instant, Castle is back in his shop and the wine bottle shatters on the floor. He and his wife have nothing to show for their experience except a repaired cabinet—which Castle accidentally breaks again as he sweeps up—and a changed perspective on life. He dumps the pieces of the bottle into a trash can outside; they magically reform into a whole bottle, waiting for someone else to pick it up and release the genie.        ": null
    },
    {
        "Luther Adler": "luther adler"
    },
    {
        " as Arthur Castle/": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " Vivi Janiss": "vivi janiss"
    },
    {
        " as Edna Castle   ": null
    },
    {
        "Lisa Golm": "lisa golm"
    },
    {
        " as Mrs. Gumley   ": null
    },
    {
        "Joseph Ruskin": "joseph ruskin"
    },
    {
        " as Genie   ": null
    },
    {
        "Olan Soule": "olan soule"
    },
    {
        " as IRS agent          Luther Adler previously had portrayed Hitler in two 42 feature films: The Magic Face, a fantasy about a European impersonator who somehow manages to murder Hitler and then assumes his identity, and  The Desert Fox , a drama about ": null
    },
    {
        "Erwin Rommel": "erwin rommel"
    },
    {
        ".     Both the 42 short story ": null
    },
    {
        "The Bottle Imp": "the bottle imp"
    },
    {
        " by ": null
    },
    {
        "Robert Louis Stevenson": "robert louis stevenson"
    },
    {
        " and the 42 short story ": null
    },
    {
        "The Monkeys Paw": "the monkeys paw"
    },
    {
        " by ": null
    },
    {
        "W.W. Jacobs": "w.w. jacobs"
    },
    {
        " feature an object containing a ": null
    },
    {
        "supernatural power": "supernatural power"
    }
]