[
    {
        "      The Shirelles were an ": null
    },
    {
        "American": "united states"
    },
    {
        " girl group": "girl group"
    },
    {
        " notable for their rhythm and blues, doo-wop and soul music and gaining popularity in the early 42s. They consisted of schoolmates ": null
    },
    {
        "Shirley Owens": "shirley owens"
    },
    {
        " , ": null
    },
    {
        "Doris Coley": "doris coley"
    },
    {
        " , Addie Micki Harris , and ": null
    },
    {
        "Beverly Lee": "beverly lee"
    },
    {
        ".     Founded in 42 for a talent show at their high school, they were signed by ": null
    },
    {
        "Florence Greenberg": "florence greenberg"
    },
    {
        " of ": null
    },
    {
        "Tiara Records": "tiara records"
    },
    {
        ". Their first single, I Met Him on a Sunday , was released by Tiara and licensed by ": null
    },
    {
        "Decca Records": "decca records"
    },
    {
        " in 42 After a brief and unsuccessful period with Decca, they went with Greenberg to her newly formed company, ": null
    },
    {
        "Scepter Records": "scepter records"
    },
    {
        ". Working with ": null
    },
    {
        "Luther Dixon": "luther dixon"
    },
    {
        ", the group rose to fame with ": null
    },
    {
        "Tonights the Night": "tonights the night"
    },
    {
        " . After a successful period of collaboration with Dixon and promotion by Scepter, with seven top 42 hits, the Shirelles left Scepter in 42 Afterwards, they were unable to maintain their previous popularity.     The Shirelles have been described as having a naive schoolgirl sound that contrasted with the sexual themes of many of their songs. Several of their hits used strings and ": null
    },
    {
        "baião": "baião"
    },
    {
        "-style music. They have been credited with launching the girl group genre, with much of their music reflecting the genres essence. Their acceptance by both white and black audiences, predating that of the ": null
    },
    {
        "Motown": "motown"
    },
    {
        " acts, has been noted as reflecting the early success of the ": null
    },
    {
        "Civil Rights Movement": "civil rights movement"
    },
    {
        ". They have received numerous honors, including the Pioneer Award from the ": null
    },
    {
        "Rhythm and Blues Foundation": "rhythm and blues foundation"
    },
    {
        ", as well as being inducted into the ": null
    },
    {
        "Rock and Roll Hall of Fame": "rock and roll hall of fame"
    },
    {
        " in 42 and named one of the 42 Greatest Artists of All Time by  Rolling Stone  in 42 Two of their songs, Will You Love Me Tomorrow and Tonights the Night , were selected by Rolling Stone on ": null
    },
    {
        "its list of the greatest songs of all time": "the 500 greatest songs of all time"
    },
    {
        ".          The group that later became the Shirelles was formed in 42 by four teenage girls from ": null
    },
    {
        "Passaic": "passaic, new jersey"
    },
    {
        ", ": null
    },
    {
        "New Jersey": "new jersey"
    },
    {
        ", under the name the Poquellos . The founding members, ": null
    },
    {
        "Shirley Owens": "shirley owens"
    },
    {
        " , ": null
    },
    {
        "Doris Coley": "doris coley"
    },
    {
        " , Addie Micki Harris , and ": null
    },
    {
        "Beverly Lee": "beverly lee"
    },
    {
        " , entered a talent show at ": null
    },
    {
        "Passaic High School": "passaic high school"
    },
    {
        " at the suggestion of a teacher. After hearing them sing I Met Him on a Sunday , a song they had written for the show, their classmate Mary Jane Greenberg convinced the reluctant Poquellos to meet with her mother, ": null
    },
    {
        "Florence": "florence greenberg"
    },
    {
        ", the owner of ": null
    },
    {
        "Tiara Records": "tiara records"
    },
    {
        ". After several months of avoiding Greenberg and telling her that they were not interested in singing professionally, they were booked to Tiara. By the end of the year they had changed their name to the Shirelles, a combination of the first syllable of Owens given name and -el, reminiscent of then-popular group ": null
    },
    {
        "the Chantels": "the chantels"
    },
    {
        ", after briefly using the name the Honeytunes. That year, they released their first song, I Met Him on a Sunday ; after local success, it was licensed to ": null
    },
    {
        "Decca Records": "decca records"
    },
    {
        " for national broadcast and charted at 42 The song was influenced by ": null
    },
    {
        "doo-wop": "doo-wop"
    },
    {
        ", but infused with ": null
    },
    {
        "pop": "pop music"
    },
    {
        " melodies.     Tiara Records, along with the Shirelles contract, was sold to ": null
    },
    {
        "Decca Records": "decca records"
    },
    {
        " in 42 for $42; Greenberg stayed as the manager, securing performances for the group, including one at the ": null
    },
    {
        "Howard Theatre": "howard theatre"
    },
    {
        " in ": null
    },
    {
        "Washington D.C.": "washington d.c."
    },
    {
        " After two singles did poorly, including their first release—with Coley as lead vocalist—of ": null
    },
    {
        "Dedicated to the One I Love": "dedicated to the one i love"
    },
    {
        " , a cover of ": null
    },
    {
        "the 42 Royales": "the   5   royales"
    },
    {
        " song of the same name, Decca returned them to Greenberg and gave up on them, considering them a ": null
    },
    {
        "one-hit act": "one-hit wonder"
    },
    {
        ". On Greenbergs new label, ": null
    },
    {
        "Scepter Records": "scepter records"
    },
    {
        ", they rereleased Dedicated to the One I Love as a single, which peaked at 42; Wayne Wadhams, David Nathan, and Susan Lindsay in Inside the Hits attribute the low rating to poor distribution. In order to better promote the group, Greenberg asked songwriter ": null
    },
    {
        "Luther Dixon": "luther dixon"
    },
    {
        ", who had previously worked with ": null
    },
    {
        "Perry Como": "perry como"
    },
    {
        ", ": null
    },
    {
        "Nat King Cole": "nat king cole"
    },
    {
        ", and ": null
    },
    {
        "Pat Boone": "pat boone"
    },
    {
        " and co-written the 42 hit ": null
    },
    {
        "42 Candles": "16 candles"
    },
    {
        " , to write for and produce songs for them. Dixon accepted.     Their first single produced with Dixon, ": null
    },
    {
        "Tonights the Night": "tonights the night"
    },
    {
        " , was released in 42 and peaked at 42 The success of Tonights the Night led to the girls being booked to perform with several major artists, such as ": null
    },
    {
        "Etta James": "etta james"
    },
    {
        " and ": null
    },
    {
        "Little Richard": "little richard"
    },
    {
        ", and facilitated Scepters move to a larger office. It was followed by ": null
    },
    {
        "Will You Love Me Tomorrow": "will you love me tomorrow"
    },
    {
        " , written by husband-wife songwriting team ": null
    },
    {
        "Gerry Goffin": "gerry goffin"
    },
    {
        " and ": null
    },
    {
        "Carole King": "carole king"
    },
    {
        "; the song went on to become the first ": null
    },
    {
        "Billboard number-one hit": "billboard charts"
    },
    {
        " by an African-American girl group, possibly the first by any girl group. Tonights the Night was later used as the title song for the 42 album  Tonights the Night , which also included Will You Love Me Tomorrow and Dedicated to the One I Love .     After the success of their singles, the Shirelles became frequent guests of ": null
    },
    {
        "Murray the K": "murray the k"
    },
    {
        ", who hosted them on his All Star Rock Shows on the New York radio station ": null
    },
    {
        "WINS": "wins"
    },
    {
        ". During this same period they reissued Dedicated to the One I Love , which peaked at 42 followed by ": null
    },
    {
        "Mama Said": "mama said"
    },
    {
        " , then ": null
    },
    {
        "Baby Its You": "baby its you"
    },
    {
        " , written by ": null
    },
    {
        "Burt Bacharach": "burt bacharach"
    },
    {
        ", ": null
    },
    {
        "Luther Dixon": "luther dixon"
    },
    {
        ", and ": null
    },
    {
        "Mack David": "mack david"
    },
    {
        ", ": null
    },
    {
        "Soldier Boy": "soldier boy"
    },
    {
        " , and ": null
    },
    {
        "Boys": "boys"
    },
    {
        " , with saxophonist ": null
    },
    {
        "King Curtis": "king curtis"
    },
    {
        ".     In 42 Dixon left Scepter, which presaged a tailing-off of the number of the Shirelles singles to chart. However, they carried on performing and recording. ": null
    },
    {
        "Dionne Warwick": "dionne warwick"
    },
    {
        " replaced Owens and Coley, who took leave to marry their fiancés, in concerts and the group continued to record material. That year, their song ": null
    },
    {
        "Foolish Little Girl": "foolish little girl"
    },
    {
        " reached the pop/R & B Top 42 and they had a cameo in the film  Its a Mad, Mad, Mad, Mad World . However, later in 42 they learned that the ": null
    },
    {
        "trust": "income trust"
    },
    {
        ", holding their royalties, that they were supposed to receive from Scepter on their 42st birthdays, did not exist. In response, they left the label, and later filed a ": null
    },
    {
        "breach of contract": "breach of contract"
    },
    {
        " suit against the company. Scepter met this with a ": null
    },
    {
        "countersuit": "countersuit"
    },
    {
        " for quitting; both suits were withdrawn in 42 after an agreement was reached. Knowing that Scepter had lied about the trust disappointed the Shirelles, who felt deceived. In a 42 interview with Bruce Pollock, Owens said that Greenberg had put on a mother routine , which the girls had fall for ... completely .            In later years, the Shirelles declined in popularity due in part to pressure from the ": null
    },
    {
        "British Invasion": "british invasion"
    },
    {
        " and the heavy competition from other girl groups, including ": null
    },
    {
        "the Chiffons": "the chiffons"
    },
    {
        ", ": null
    },
    {
        "the Supremes": "the supremes"
    },
    {
        ", ": null
    },
    {
        "the Ronettes": "the ronettes"
    },
    {
        ", ": null
    },
    {
        "Martha & the Vandellas": "martha  &  the vandellas"
    },
    {
        ", and ": null
    },
    {
        "the Crystals": "the crystals"
    },
    {
        ". During this period, Warwick often replaced Coley due to the latters family commitments. The Shirelles were still bound to Scepter and thus unable to record for another company until the end of their contract in 42 Their last single to chart was 42s Last Minute Miracle , which peaked at 42     After the commercial failure of their most recent releases, Coley left the group in 42 to attend to her family. The remaining three Shirelles recorded songs for several labels, including ": null
    },
    {
        "Bell Records": "bell records"
    },
    {
        ", ": null
    },
    {
        "RCA": "rca"
    },
    {
        ", and ": null
    },
    {
        "United Artists": "united artists"
    },
    {
        " until 42 Afterwards, they toured singing their older songs, and participated in the filming of the 42 documentary  Let the Good Times Roll , recording two songs for it. Coley returned as lead singer in 42 replacing Owens, who left that year to pursue a solo career. In 42 Harris died of a heart attack in the ": null
    },
    {
        "Hyatt Regency": "hyatt regency atlanta"
    },
    {
        " after two performances in ": null
    },
    {
        "Atlanta": "atlanta"
    },
    {
        ", ": null
    },
    {
        "Georgia": "state of georgia"
    },
    {
        ", with the group. The following year, the remaining three original members performed Will You Love Me Tomorrow with Warwick on her album  How Many Times Can We Say Goodbye .       Today, the original members tour in different, separate, groups, although the trademark to the Shirelles name was eventually acquired by Lee. Shirley Owens performed on the Doo Wop 42 PBS special in 42 and continues to tour under the name Shirley Alston Reeves and her Shirelles. Lee currently tours with new members, billed as The Shirelles . Doris Coley died in ": null
    },
    {
        "Sacramento": "sacramento, california"
    },
    {
        ", ": null
    },
    {
        "California": "california"
    },
    {
        ", on February 42 42 of breast cancer. Addie Micki Harris died on June 42 42 of a heart attack.        Wadhams, Nathan, and Lindsay describe the style of the Shirelles early work as tight, almost doo-wop harmony . Owens vocals, described by rock n roll writer Alwyn W. Turner as being wonderfully expressive , were capable of sounding almost, but not quite out of tune, which in his opinion led to Owens sounding innocent in her songs; music critic Albin Zak describes her vocals as being able to intone desire and vulnerability. The other members, singing backup, also convey what Michael Campbell, a professor of music at ": null
    },
    {
        "Western Illinois University": "western illinois university"
    },
    {
        ", calls a naive schoolgirl sound . The lyrics sung by the Shirelles tended to be fairly simple and barely concealed the subtexts of the songs. The songs were implicitly directed at female listeners, with the male subjects of songs being referred to as he instead of you ; this was a change from previous female-written songs, which tended to be more gender neutral, and helped pave the way for the confessional songs of 42s singers like ": null
    },
    {
        "Joni Mitchell": "joni mitchell"
    },
    {
        " and ": null
    },
    {
        "Carole King": "carole king"
    },
    {
        ".     Musically, their works with Dixon were influenced by Brazilian ": null
    },
    {
        "baião": "baião music"
    },
    {
        " and featured numerous instances of ": null
    },
    {
        "syncopation": "syncopation"
    },
    {
        ".       Steve Huey of ": null
    },
    {
        "AllMusic": "allmusic"
    },
    {
        " notes that the Shirelles defined the so-called girl group sound with their soft, sweet harmonies and yearning innocence , with their songs predating ": null
    },
    {
        "Motown": "motown"
    },
    {
        " in their widespread crossing of racial demographics, both in the US and in Britain. He also notes that they spawned legions of imitators , and laid a blueprint for future female pop stars to follow. Turner writes that the Shirelles launched genre , noting that their early work already included the essence of the genre; Alwyn Zak expands on the statement, noting that the influx of female groups started after the success of Will You Love Me Tomorrow .     Michael Campbell notes that the Shirelles success reflected the ": null
    },
    {
        "Civil Rights Movement": "civil rights movement"
    },
    {
        ". He indicates that works such as Will You Love Me Tomorrow , written by a white couple, produced by an African-American man, with vocals by young African-American women and strings sounding like they were targeted at a white audience, conveyed a color-blind message on top of its more obvious sexual one.       In 42 the Shirelles were honored by the ": null
    },
    {
        "Rhythm and Blues Foundation": "rhythm and blues foundation"
    },
    {
        " with the Pioneer Award for their contributions to music. The award was accepted by Owens, Lee, and Kenner. As Coley was accepting her award, she said This is dedicated to the one I love , and sang an impromptu rendition of Soldier Boy together with Owens and Lee. Two years later they were inducted into the ": null
    },
    {
        "Rock and Roll Hall of Fame": "rock and roll hall of fame"
    },
    {
        ", together with ": null
    },
    {
        "Gladys Knight & the Pips": "gladys knight  &  the pips"
    },
    {
        ". At the ceremony in the ": null
    },
    {
        "Waldorf-Astoria Hotel": "waldorf-astoria hotel"
    },
    {
        " in New York, the three surviving members sang a medley of songs after being presented the awards by ": null
    },
    {
        "Merry Clayton": "merry clayton"
    },
    {
        ", ": null
    },
    {
        "Marianne Faithfull": "marianne faithfull"
    },
    {
        ", and ": null
    },
    {
        "Darlene Love": "darlene love"
    },
    {
        ". In 42 they were inducted into the ": null
    },
    {
        "Vocal Group Hall of Fame": "vocal group hall of fame"
    },
    {
        ". Lee and Owens accepted the award.     In 42  Rolling Stone  ranked them 42 on their ": null
    },
    {
        "list of the 42 Greatest Artists of All Time": "rolling stones 100 greatest artists of all time"
    },
    {
        ". ": null
    },
    {
        "Paul Shaffer": "paul shaffer"
    },
    {
        ", who did the write-up, wrote that the girl-group sound, originated by them, was everything to ; he also described their impromptu performance of Soldier Boy as inspiring. They also included two of the Shirelles songs, ": null
    },
    {
        "Will You Love Me Tomorrow": "will you love me tomorrow"
    },
    {
        " and ": null
    },
    {
        "Tonights the Night": "tonights the night"
    },
    {
        " , on their list of ": null
    },
    {
        "the 42 Greatest Songs of All Time": "the 500 greatest songs of all time"
    },
    {
        ". In the 42 edition, Will You Love Me Tomorrow was ranked 42th, while Tonights the Night was ranked 42th. The Shirelles 42 Greatest Hits album was included in ": null
    },
    {
        "Robert Christgau": "robert christgau"
    },
    {
        "s Basic Record Library of 42s and 42s recordings, published in  Christgaus Record Guide: Rock Albums of the Seventies  .      In September 42 the Shirelles hometown of Passaic honored the group by renaming a section of Paulison Avenue between Passaic and Pennington Avenues Shirelles Boulevard . The dedication ceremony was attended by both surviving Shirelles. Owens said that it was different than when they were inducted into the Hall of Fame, as it was their home town. She noted that the people who loves  us and we loved are right here.        The Shirelles story was shown in  Baby Its You!  , which follows the story of Greenberg and Scepter Records. The revue played on ": null
    },
    {
        "Broadway": "broadway theatre"
    },
    {
        " for 42 performances, opening at the ": null
    },
    {
        "Broadhurst Theatre": "broadhurst theatre"
    },
    {
        " on April 42 42 and closing on September 42 of the same year.The use of their likenesses without permission led to Lee, as well as the estates of Coley and Harris, to sue ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        "                                  ": null
    }
]