[
    {
        "The Tale of the Body Thief is a horror novel by American writer ": null
    },
    {
        "Anne Rice": "anne rice"
    },
    {
        ", the fourth in her  The Vampire Chronicles  series, following  The Queen of the Damned . Published in 42 it continues the adventures of ": null
    },
    {
        "Lestat": "lestat de lioncourt"
    },
    {
        ", specifically his efforts to regain his lost humanity during the late 42th century. Chapters from the book appeared in the October 42 issue of  Playboy .       At the beginning of the story, ": null
    },
    {
        "Lestat": "lestat de lioncourt"
    },
    {
        " grows depressed and becomes remorseful because of his ": null
    },
    {
        "vampiric": "vampiric"
    },
    {
        " nature. Although he tries to limit his victims to murderers, serial killers and other criminals, he nonetheless caves into temptation once in a while and kills an innocent or someone who he feels does not necessarily deserve to die. Lestat also suffers from constant nightmares concerning his late daughter , ": null
    },
    {
        "Claudia": "claudia"
    },
    {
        ", for whose death he blames himself.     The coven of vampires formed at the end of  The Queen of the Damned  has long since broken up, and Lestat has become extremely lonely. Among his only remaining friends is the mortal head of the ": null
    },
    {
        "Talamasca Caste": "talamasca caste"
    },
    {
        ", ": null
    },
    {
        "David Talbot": "david talbot"
    },
    {
        ", who is seventy-four years old. Although Lestat has repeatedly offered David the Dark Gift, David has always refused to become a vampire and keep Lestat company through eternity. Lonely and depressed, Lestat goes to the ": null
    },
    {
        "Gobi desert": "gobi desert"
    },
    {
        " at dawn in a half-hearted suicide attempt. When he does not die, he goes to Davids home in England to heal.     A mysterious figure, Raglan James—the eponymous Body Thief of the story—approaches Lestat with what seems to be a cure for his ennui and depression. James sends Lestat several messages hinting that he has the ability to ": null
    },
    {
        "switch bodies": "body swap"
    },
    {
        ". Eventually, he proposes to Lestat that the two of them trade bodies for a day. Against the advice of other vampires and David Talbot, Lestat jumps at the opportunity. Unfortunately, James has no intention of ever switching back, and Lestat is forced to scheme to regain his body.     Lestat nearly dies after becoming human again—his new body is wracked by pneumonia, which he ignores during a tour of ": null
    },
    {
        "Washington D.C.": "washington d.c."
    },
    {
        " in the middle of winter. He is saved by the care of a nun named Gretchen. He enjoys a short love affair with Gretchen before she returns to ": null
    },
    {
        "South America": "south america"
    },
    {
        ", where she works in a convent, and Lestat sets out in search of his body.     Lestat seeks help from other vampires but is completely ostracized by them. ": null
    },
    {
        "Marius": "marius"
    },
    {
        " is extremely angry at him for leaving such a powerful body to a thief and refuses to help him. Likewise ": null
    },
    {
        "Louis": "louis de pointe du lac"
    },
    {
        " turns him away when he asks Louis to make his new body into a vampire, arguing that Lestat ought to be happy to be human again and also calls him out on his ": null
    },
    {
        "previous writings": "the vampire lestat"
    },
    {
        ", accusing him of altering his actual past in favor of one that ": null
    },
    {
        "portrays him heroically": "unreliable narrator"
    },
    {
        ". Lestats only ally is David Talbot.     Drawing from the Talamascas resources on the supernatural, Talbot reveals that James was a gifted psychic who once joined the order, but was kicked out for constant theft. He is a ": null
    },
    {
        "kleptomaniac": "kleptomaniac"
    },
    {
        " who enjoys stealing for the thrill of it & mdash;it is revealed that every single thing he owns, from his house to his body, was stolen or schemed for. However, he also has major psychic problems, and his life is a series of cycles & mdash;he gets rich by theft, then often ends up in prison. Dying of cancer several years before, James tricked the inmate of a mental institution into switching bodies with him, allowing him a type of immortality.     It is James lack of imagination and petty thievery that allow Talbot and Lestat to track him down. Despite his newfound wealth and powerful new body, James continues to steal jewelry from people. He also makes a conspicuous show of his wealth, boarding the ": null
    },
    {
        "RMS Queen Elizabeth 42": "rms queen elizabeth 2"
    },
    {
        ", and draining victims of their blood along the ships path. The pattern allows his pursuers to easily find him.     On the cruise ship, Lestat manages to regain his body with Davids help, but the sun is rising as he performs the switch and he must immediately flee to a safe place in which to spend the day. When he awakes in the evening he finds that both James and Talbot have disappeared.     Lestat finds David in ": null
    },
    {
        "Florida": "florida"
    },
    {
        " and is surprised to find that his friend, despite his earlier protestations, now wants to become a vampire. However, while taking his blood, Lestat discovers a final trick & mdash;when forced out of Lestats body, James took over Talbots body instead of returning to his own. Lestat angrily attacks James, crushing his skull. The blow proves fatal & mdash;the injury damages James brain and prevents him from leaving the dying body or trying to switch bodies before his current one dies.     At this point, Tale of the Body Thief reaches a ": null
    },
    {
        "false ending": "false ending"
    },
    {
        ". Raglan James is dead. David has begun to enjoy life in his new, young body. Lestat returns to ": null
    },
    {
        "New Orleans": "new orleans"
    },
    {
        ", reunites with Louis, and begins to renovate his old house in the ": null
    },
    {
        "French Quarter": "french quarter"
    },
    {
        ". Above all, Lestat claims that he has finally come to accept his vampiric nature. However, Lestat then warns readers not to continue if they are happy with this ending.     Lestat then resumes the narrative, claiming that he has regained his evil nature. A few weeks later after reuniting with Louis, Lestat decides to make Talbot into a vampire against his wishes, and despite the role Talbot played in saving his life when everyone else abandoned him. After which he visits David. Before engaging in the transformation, Lestat asks David if he feels healthy and secure in his new body and if hes ever had any luck with having any physical affairs. David admits that hes one hundred percent healthy and secure in the body and that hes had a few affairs, but not with much luck. Lestat then tells David what hes about to do to him and tells him that hes going to bring him over to him. Thus, indicating that Lestat is not playing around this time and that he really is going to do it. Lestat tells David that he wont let him die and that hes the only real friend that David has in this world. During the first part of Davids transformation, he at first he strongly resists Lestats domineering, assaultive and verbal advances despite Lestats warning not to fight him, but after a while he succumbs. Secretly though, Lestat really loves David fighting him. As this is happening, Lestat lets the readers in on his real emotions for David by thinking of David as having this scrumptious body with a very beautiful mind for his beautiful friend and as his beloved David. Also during the first part Lestat asks David if he loves him. Soon after David admits his love for Lestat and Lestat says that he feels the same way for David. After having immortality forced upon him, David disappears again. Lestat looks for him for a while, but upon having no luck he gives up and returns to New Orleans where to his surprise he finds that David has already contacted Louis.     David explains to Lestat that, in secret, this is what he always truly wanted. He tells Lestat that he is no longer angry with him, although he does usurp Lestats position of leadership, despite the latters protests. Having gotten rid of his old age, and now being immortal, David plans to visit Rio de Janeiro with Louis, and asks Lestat to join him. At the end, Lestat also realizes that, despite all that happened, he is still alone, has failed to regain his humanity , and has thrown away his only chance to make amends for his past misdeeds.       In many ways, The Tale of the Body Thief lays the groundwork for the following Vampire Chronicles novel,  Memnoch the Devil . David Talbot, in his ": null
    },
    {
        "occult": "occult"
    },
    {
        " fieldwork, has begun to understand the nature of the spirit world, and actually claims to have seen ": null
    },
    {
        "God": "god"
    },
    {
        " and the ": null
    },
    {
        "Devil": "devil"
    },
    {
        " sitting and talking in a cafe.     In interviews after the book came out, Rice claimed that her own fathers death helped to form the model for the relationship between Lestat and Talbot. Rice had loved her father very much , and when he was dying, she wished that she could somehow make him young again so that she wouldnt lose him. This could make Tale of the Body Thief the second of two Vampire Chronicle novels inspired by Rices personal tragedies, the first being  Interview with the Vampire  .     Lestats adjustment to his human body takes up a major portion of the book & mdash;after almost two centuries of being a vampire, he finds he has trouble with the basic human nuances of eating, defecating, and taking care of his body. One of the realizations made by Lestat is that he took his powers for granted for too long; only after his adventure is he able to fully appreciate his vampiric abilities.     Likewise, Lestat describes James as a devious and cunning opponent, a ": null
    },
    {
        "characterization": "characterization"
    },
    {
        " he uses to justify how he was tricked. However, in reality, Raglan James is an extremely petty and predictable criminal who is constantly dropping clues as to his next move & mdash;at one point, Talbot refers to James as a glorified purse snatcher .     The novel is also ironic in the cues that it leaves behind. For example, one of the hints that Raglan James leaves Lestat is a copy of ": null
    },
    {
        "H. P. Lovecraft": "h. p. lovecraft"
    },
    {
        "s short story, ": null
    },
    {
        "The Thing on the Doorstep": "the thing on the doorstep"
    },
    {
        " . In the Lovecraft story, body-switching also takes place, and has an added twist when a third party gets involved without the narrators knowledge. Lestat doesnt bother re-reading the short story; if he had, he might have anticipated Raglan James final trick.     The darkest irony is Lestats supposed concern for the elderly David Talbot. One of his nightmares concerns a flashback to when the young Talbot was a big-game ": null
    },
    {
        "hunter": "hunter"
    },
    {
        ", and was nearly killed by a man-eating ": null
    },
    {
        "tiger": "tiger"
    },
    {
        ". At the storys beginning, Lestat is constantly bothered by a foreboding that his friend is dying or in some mortal danger. He connects this feeling to ": null
    },
    {
        "William Blake": "william blake"
    },
    {
        "s poem ": null
    },
    {
        "The Tyger": "the tyger"
    },
    {
        ", which is quoted piecemeal throughout the entire novel:     ::Tyger! Tyger! burning bright   ::In the forests of the night,   ::What immortal hand or eye   ::Could frame thy fearful symmetry?     At the end of the story, Lestat realizes with horror that he must have been the tiger of his visions.       In 42 The Tale of the Body Thief was rumored to be adapted into film as ": null
    },
    {
        "United Artists": "united artists"
    },
    {
        " was interested in purchasing the film rights to the novel.  Rice announced via her Facebook profile on February 42 42 that Brian Grazer and Ron Howards film production company, Imagine Entertainment, had optioned the motion picture rights to the novel. Lee Patterson was to have written the screenplay. Transformers Alex Kurtzman and Roberto Orci were also said to be on board as producers during the time of development.      The plan is to treat the character as if audiences have not met him before, said Entertainment Weekly with word from Imagine.      On April 42 42 during a live-internet radio chat with her son Christopher and co-host Eric Shaw Quinn, Anne explained that a film adaptation is no longer in development and stated on her Facebook profile: No Lestat movie in the works & mdash;after all these years, and the best efforts of all involved... Weve encountered difficulties we cannot at this time overcome. Rices son Christopher apparently drafted and adapted a screenplay from the novel that was met with praise from those involved; however, the project has been dismissed as the studio isnt willing to move forward with it due to differences that were beyond them.      As of August 42 an entire reboot of  The Vampire Chronicles  was planned by producers Alex Kurtzman and Roberto Orci after the motion picture rights were optioned by ": null
    },
    {
        "Universal Pictures": "universal pictures"
    },
    {
        " and ": null
    },
    {
        "Imagine Entertainment": "imagine entertainment"
    },
    {
        ". Christopher Rices screenplay for The Tale of the Body Thief was reportedly worked into the recent deal for a proposed film franchise and a reinterpretation of  Interview with the Vampire  was also hinted by Rice herself via Facebook.  However, in November 42 Universal did not renew the contract, and the film and television rights reverted to Rice, who began developing the Vampire Chronicles into a television series with Christopher.  ": null
    }
]