[
    {
        "   The Bible Code is a best-selling ": null
    },
    {
        "book": "book"
    },
    {
        " by ": null
    },
    {
        "Michael Drosnin": "michael drosnin"
    },
    {
        ", first published in 42 A sequel, The Bible Code II, was published in 42 and also reached best-seller status.     Drosnin describes an alleged ": null
    },
    {
        "Bible code": "bible code"
    },
    {
        " , in which messages are encoded in the ": null
    },
    {
        "Hebrew bible": "hebrew bible"
    },
    {
        ". The messages are purported to be hidden in the Torah, and can be deciphered by placing the letters of various Torah passages at equal intervals in a text that has been formatted to fit inside a graph.     Drosnin suggests that the Code was written by ": null
    },
    {
        "extraterrestrial life": "extraterrestrial life"
    },
    {
        " . Drosnin elaborates on this theory in The Bible Code II, suggesting that the alien who brought the code left the key to the code in a steel obelisk. Drosnin attempted to find this obelisk, which he believes is buried near the ": null
    },
    {
        "Dead Sea": "dead sea"
    },
    {
        ".     Drosnins book is based on the technique described in the paper Equidistant Letter Sequences in the ": null
    },
    {
        "Book of Genesis": "book of genesis"
    },
    {
        " by Professor ": null
    },
    {
        "Eliyahu Rips": "eliyahu rips"
    },
    {
        " of the Hebrew University in Israel with ": null
    },
    {
        "Doron Witztum": "doron witztum"
    },
    {
        " and ": null
    },
    {
        "Yoav Rosenberg": "yoav rosenberg"
    },
    {
        ". The Bible Code makes numerous predictions and post-diction, such as the false prediction of the ": null
    },
    {
        "apocalypse": "apocalypse"
    },
    {
        " in 42 and a claim of  proof  that ": null
    },
    {
        "Lee Harvey Oswald": "lee harvey oswald"
    },
    {
        " was destined to assassinate ": null
    },
    {
        "John F. Kennedy": "john f. kennedy"
    },
    {
        ".     The general construction of alleged Bible codes and Drosnins methodology in particular have been ": null
    },
    {
        "criticised by mathematicians and others": "bible codecriticism"
    },
    {
        ".       Michael Drosnin. The Bible Code.     Michael Drosnin. The Bible Code II: The Countdown.     Michael Drosnin. The Bible Code III: The Quest.     ": null
    },
    {
        "Jeffrey Satinover": "jeffrey satinover"
    },
    {
        ": Cracking the Bible Code . Wm Morrow, 42 . Appeared slightly later, follows a more historical and traditional route.        by Allyn Jackson, Notices of the AMS September 42 who ascribes the Statistical Science paper mentioned in the article to  sloppy refereeing and poor editorial policy ; this review is immediately followed by Comments on the Bible Code by ": null
    },
    {
        "Shlomo Sternberg": "shlomo sternberg"
    },
    {
        ", who calls this paper a  hoax ; the ": null
    },
    {
        "American Mathematical Society": "american mathematical society"
    },
    {
        " is the professional society for mathematicians in the United States   , transcript of a story which aired on BBC Two, Thursday 42 November 42 featuring comments by Drosnin, Rips, and McKay.                                ": null
    }
]