[
    {
        "         The Chronicles of Amber is a series of ": null
    },
    {
        "fantasy novel": "fantasy novel"
    },
    {
        "s by American writer ": null
    },
    {
        "Roger Zelazny": "roger zelazny"
    },
    {
        ". The ": null
    },
    {
        "main series": "novel series"
    },
    {
        " consists of two ": null
    },
    {
        "story arc": "story arc"
    },
    {
        "s, each five novels in length. Additionally, there are a number of Amber ": null
    },
    {
        "short stories": "short story"
    },
    {
        " and other works.     The Amber stories take place in two contrasting true worlds, Amber and Chaos, and in shadow worlds that lie between the two. These shadows, including our Earth, are parallel worlds that exist in, and were created from, the tension between opposing magical forces of Amber and Chaos. The Courts of Chaos are situated at the very edge of an Abyss. Members of the royal family of Amber, after walking a ": null
    },
    {
        "Pattern": "the pattern"
    },
    {
        " that is central to Amber, can travel freely through the Shadows. While traveling between Shadows, one can alter reality or create a new reality by choosing which elements of which Shadows to keep or add, and which to subtract. Nobles of the Courts of Chaos who have traversed the ": null
    },
    {
        "Logrus": "logrus"
    },
    {
        " are similarly able to travel through Shadow.          Ten Amber novels were written by Roger Zelazny. The series of books was published over the years from 42 to 42 Portions of the first novel,  Nine Princes in Amber , had previously been published in Kallikanzaros . The novels  Sign of the Unicorn ,  The Hand of Oberon , and  The Courts of Chaos  first appeared in abridged, serialized versions in  Galaxy Science Fiction .  The Guns of Avalon  and five later Merlin Cycle Amber novels were not serialized or excerpted.     Several Chronicles of Amber ": null
    },
    {
        "omnibus": "omnibus edition"
    },
    {
        " volumes have also been published, collecting the five novels of the original Corwin Cycle in one volume, the five novels of the Merlin Cycle in another volume, and later  all ten novels in a single volume.       The first five novels are narrated in first person by ": null
    },
    {
        "Corwin": "corwin"
    },
    {
        ", a prince of Amber, as he describes his adventures and life upon re-encountering his family after a loss of memory and an absence of centuries.     Nine Princes in Amber    Corwin wakes up from a coma in a hospital in New York with amnesia. He soon discovers that hes part of a ": null
    },
    {
        "superhuman royal family": "list of chronicles of amber charactersthe royal family"
    },
    {
        " that can wander among infinite parallel worlds , and who rule over the one true world, Amber. He meets members of this newly rediscovered family, and then later is shown and walks ": null
    },
    {
        "the Pattern": "the pattern"
    },
    {
        ", a labyrinth inscribed in the dungeons of Castle Amber which gives the ": null
    },
    {
        "multiverse": "parallel universe"
    },
    {
        " its order. Walking the Pattern of Rebma restores Corwins memory and his abilities to travel through shadow. In alliance with his brother ": null
    },
    {
        "Bleys": "bleys"
    },
    {
        ", he attempts to conquer Amber, which is currently ruled by his elder brother ": null
    },
    {
        "Eric": "eric"
    },
    {
        ", who took power after the disappearance of their father, Oberon. Their attempt fails. Bleys falls from the side of Kolvir and Corwin is captured, blinded and imprisoned. Thanks to his genetic regenerative ability, his eyes regrow and he regains his vision. ": null
    },
    {
        "Dworkin Barimen": "dworkin barimen"
    },
    {
        ", the mad sorcerer who created the Pattern, enters Corwins prison through the walls of Corwins prison cell, and eventually draws on the wall the door through which Corwin escapes.     The Guns of Avalon    Corwin has escaped the dungeons of Amber, where he was imprisoned by his hated brother Eric, who had seized the throne of Amber. All of Corwins siblings believe that guns cannot function in Amber, as ": null
    },
    {
        "gunpowder": "gunpowder"
    },
    {
        " is inert there. But Corwin has secret knowledge: in the shadow world of Avalon, where he once ruled, there exists a ": null
    },
    {
        "jewelers rouge": "jewellers rougepolishing"
    },
    {
        " that will function in Amber as gunpowder should. Corwin plans to raise a legion of shadow soldiers, and arm them with automatic ": null
    },
    {
        "rifle": "rifle"
    },
    {
        "s from the shadow world Earth. While gathering these forces Corwin discovers a more sinister problem growing among the shadows. He meets Dara, a woman claiming to be his great-grandniece, and later discovers a threat to Amber: a black road which runs across universes from the Courts of Chaos to Amber. With his newly trained army, Corwin marches on Castle Amber only to find it already under siege. Eric is mortally wounded and passes the Jewel of Judgment to Corwin, making Corwin Regent. The immediate danger passes, but Dara threatens greater peril after walking the Pattern and revealing herself to be a creature of the Courts of Chaos, intent on destroying both Amber and the Shadows.     Sign of the Unicorn    Eric is dead, and Corwin now rules Amber as Regent. But someone has murdered their brother Caine and framed Corwin. This leads to questions about other missing members of the royal family. Corwins brother, Random, tells of his attempts to rescue their brother, Brand, and Corwin decides to find out what happened to the latter. After many intrafamily exchanges, Brand is rescued but is stabbed by one of the family in the attempt. In the midst of the ensuing intrigue, an assassination attempt is made on Corwin and he finds himself incapacitated on Earth. Before returning to Amber he hides the Jewel of Judgment on Earth. After Brand recovers, he tells Corwin of several incidents leading up to his capture. Corwin travels to Tir-na Nógth, the mysterious, moonlit Amber-in-the-sky where he hopes to gain insight into the situation, and upon his return finds himself at the Primal Pattern rather than Amber.     The Hand of Oberon    Corwin finds the Primal Pattern damaged, with a dark stain obscuring parts of it. On further investigation it is found that the blood of one of the members of his family has created the stain. Corwin descends back to the dungeons and meets with Dworkin, who explains how the Pattern might be repaired. After being chased from the Pattern, Corwin eventually discovers that Brand is responsible for the damage and that he now has the Jewel of Judgment. Corwin must now prevent Brand from attuning himself to the jewel, or Brands plot to destroy the Pattern will succeed. Corwin and his family band together to prevent this, eventually recover the jewel, and discover that their father Oberon, the true King of Amber, still lives.     ": null
    },
    {
        "Roger Zelazny": "roger zelazny"
    },
    {
        " makes a brief cameo appearance": "self-insertion"
    },
    {
        " in the book as a guard in a dungeon, smoking a pipe and working on a novel which may or may not be The Chronicles of Amber itself.     The Courts of Chaos    Oberon, having resumed the throne, organizes an assault on the Courts of Chaos. Oberon plans to repair the Primal Pattern at the cost of his life, and offers the throne to Corwin with Dara as his Queen. Corwin refuses and is tasked to bring the Jewel of Judgment across the shadows to the battle that will ensue after the Pattern is redrawn. He sets off along the black road and is soon pursued by Brand and a great storm. Through the storm and across the multiverse he comes to doubt his fathers success. As he approaches the Courts of Chaos he is assailed by fantastic beings who try to dissuade him, and he finally decides that his father must have failed. Corwin then creates a new Pattern and uses it to get to the Courts, but has not the strength to prevent Brand stealing the Jewel from him in the process. In a final confrontation with Brand, the Jewel of Judgment is stolen and lost. Brand is killed - by Caine, revealed to have faked his own death earlier by murdering a shadow version of himself and leaving the body to be found: shot through heart and throat, Brand falls off a precipice into the Abyss, taking Deirdre with him in the process. The Jewel is recovered by the unicorn who bestows it on Random, who is then accepted as the new King. The Trumps and multiverse are restored and Corwin relates the story of the first five novels to his son Merlin.       The next five novels focus on ": null
    },
    {
        "Merlin": "merlin of amber"
    },
    {
        ", Corwins son. These stories are held by some fans to be less of a fantasy classic than the first five due to the difference in writing style, direction and setting. One criticism of the sequence is that it revolved around the dealing with and acquisition of ever more powerful artifacts and entities, in a kind of technological/magical arms race.      Whereas Corwin of the first series was a product of the late 42s and 42s and was more of a cross between a hardboiled detective in the vein of ": null
    },
    {
        "Raymond Chandler": "raymond chandler"
    },
    {
        " and a ": null
    },
    {
        "Highlander": "highlander"
    },
    {
        "-like immortal with centuries of experience fighting his way through the stories, Merlin is a youthful ": null
    },
    {
        "hacker": "hacker"
    },
    {
        " / ": null
    },
    {
        "magician": "magician"
    },
    {
        " finding himself in increasingly complex situations in the vein of ": null
    },
    {
        "modern hacker protagonists": "list of fictional hackers"
    },
    {
        ". The series is a coming of age for Merlin with his heritage as a Prince of Chaos and Amber.     Trumps of Doom    Merlin has been studying computer science on Earth while constructing a secret project called Ghostwheel, a sentient computer based on the Trumps, which Merlin hopes will be able to locate Corwin, who vanished after visiting the Courts of Chaos in the previous novel. Merlin discovers the body of his ex-girlfriend Julia, apparently killed by beasts from another shadow, and subsequently finds himself in sorcerous combat with a lady named Jasra, who has a poisonous sting in her bite. More unnerving is that his best friend Luke apparently knows about both Ghostwheel and Merlins connection to Amber. He eventually returns to Amber, which is in mourning: the news has just come that Caine has been murdered, and Bleys injured, by a mystery assassin with a rifle & ndash; an assassin who demonstrates that he has access to something with explosive properties in Amber . After the funeral, King Random orders Merlin to shut down Ghostwheel, but the artifact shows it is capable of self-defense, even against its creator, who is saved by the unexpected appearance of Luke & ndash; who thus proves, with the ability to traverse Shadow, that he too is no ordinary human. He soon finds that Luke is in fact Rinaldo, son of Brand of Amber, and has been responsible for yearly attempts on his life, on the anniversary of Lukes discovery of Brands death. Luke imprisons Merlin in a cave of blue crystal which negates his magic abilities and from which he cannot escape.     Trumps of Doom won the Locus Award for Best Fantasy Novel in 42      Blood of Amber    Merlin escapes from the blue crystal cave, meets and confronts Jasra, nearly taking her prisoner, but is forced to retreat when she calls in reinforcements using the Trumps. Further mystery ensues back on Earth when several people who apparently knew a lot more about Merlin than they should, turn out to have no memory of previous meetings. Merlin traces his way back to his first confrontation with Jasra, where he finds himself at a magical fort, the Keep of the Four Worlds, a nexus of magical energies which has recently fallen under the control of a mysterious blue-masked sorcerer calling himself Mask , who seems to have a vendetta against Merlin. However, the Keep is also currently under siege by Dalt the Mercenary, a known enemy of Amber and friend of Luke/Rinaldo. A meeting with a deserter reveals that Jasra is Luke/Rinaldos mother. Merlin returns to Amber, ventures out into Amber City, escapes an assassination attempt, and is saved by Caines mistress, Vinta Bayle & ndash; who, also, appears to know more than she ought about him. Merlin then finds himself having to rescue Luke from Dalt, the two having apparently come to blows. Luke reveals that Jasra has indeed lost power and is now a prisoner & ndash; and has the cheek to ask for Merlins help. Vinta reveals that she is not what she seems, but is a being that has apparently appeared to Merlin in possession of several different bodies. Luke ends up in the crystal cave himself & ndash; and Merlin, after yet another uncanny encounter with a shape-shifting werewolf and that appears to be backed by Mask. Merlin decides to gain leverage over Luke by rescuing Jasra without Lukes help, and then taking Jasra as a prisoner in Amber. He confronts Mask, escapes with the now-petrified Jasra, and returns to Amber, where an unusual Trump summoning imprisons him in the Mad Hatters tea party from ": null
    },
    {
        "Wonderland": "alice in wonderlandchapter 7: a mad tea party"
    },
    {
        ".     Blood of Amber was nominated for the Locus Award for Best Fantasy Novel in 42      Sign of Chaos    Merlin realises that Wonderland, where he and Luke are trapped, is an ": null
    },
    {
        "LSD": "lsd"
    },
    {
        "-induced hallucination made real by Lukes powers over shadow. He is ambushed by a creature from Chaos, a Fire Angel, but defeats it with the help of a ": null
    },
    {
        "Jabberwock": "jabberwocky"
    },
    {
        " and a ": null
    },
    {
        "vorpal sword": "vorpal sword"
    },
    {
        ". He leaves Luke to sober up and seeks his stepbrother Mandor, who thinks that their half-brother Jurt may be at least one of the assassins trying to kill Merlin & ndash; right now, most likely, for headship of the House of Sawall once its current lord dies, since Mandor has stepped aside, leaving that office to be disputed between Merlin and Jurt They meet up with Fiona and discover that the Logrus is making an attempt to damage Corwins Pattern. But Merlin refuses to help Mandor and Fiona learn more, and returns to Amber, only to be embroiled in diplomatic controversy: in order to avoid Lukes possible accession to the throne of the Shadow kingdom Kashfa, Random is playing politics to put his own candidate on the throne, and the neighbouring kingdom of Begma objects to that particular candidates territorial ambitions. The Begman dukes elder daughter Coral and Lukes old friend Dalt the Mercenary are both revealed to be bastard Amberites, sired by Oberon out of wedlock: Coral walks the Pattern and disappears completely, apparently held prisoner by it. Dalt challenges Amber with an armed force, demanding Luke be surrendered to him as prisoner, but Luke has sworn off his vendetta and is under Queen Vialles protection. Negotiations result in an arranged fistfight between Dalt and Luke, which Dalt wins and captures Luke. Corals younger sister Nayda is revealed to be possessed by the mysterious body-possessing tyiga demon which had previously been Vinta Bayle : but since the real Nayda actually died of a long-standing heart condition just as the tyiga possessed her , it is now trapped in her form permanently. Merlin calls in Mandor to imprison the tyiga, which turns out to have been sent with orders to act as a bodyguard to Merlin, by an unknown sponsor, and reveals that Jurt is in league with Mask, and is trying to gain power from the Keep of the Four Worlds in the same way that Brand did, and become a Living Trump. Merlin and Mandor free Jasra, since Jasra is Masks enemy, and together they wrest the Keep of the Four Worlds from Jurt and Mask. Mask is wounded by Merlin, but then it is revealed that he is in fact Merlins ex-girlfriend Julia, whom he had thought dead.     Sign of Chaos was nominated for the Locus Award for Best Fantasy Novel in 42      Knight of Shadows    Jasra is left in charge of the Keep of the Four Worlds, where she had ruled before & ndash; as Julias teacher, before Julia decided to outwit her and take over. She turns out to be exactly the right person to leave in charge there, as she does not wish for the power of the Fount of the Four Worlds herself, but is quite happy to prevent others using it, since gaining its power destroyed the last of Brands humanity, and she appears to have genuinely loved him, and lost him to his power-lust. Merlin tries to use Trump magic to locate Coral & ndash; with the help of Mandor, Jasra and even his own creation Ghostwheel, with whom he is back on good terms & ndash; but is ambushed by various ghostly constructs of people that have walked the Pattern and Logrus, and even by Corwins most recent Pattern-ghost , and finds himself drawn into a struggle between the ": null
    },
    {
        "Logrus": "logrus"
    },
    {
        ", the fundamental power of chaos, and the Pattern, the fundamental power of order. It is revealed that the Pattern, and its chaotic counterpart the Logrus, are sentient, and wish Merlin to choose a side to tip the balance of the multiverse towards one or the other & ndash; with other Pattern- and Logrus-ghosts also taking part in the trial to influence him one way or the other. He attempts to refuse the test but is confronted by the Powers That Be themselves, the Unicorn of Order and Serpent of Chaos. They try to make him choose between them using ghosts of family members who have traversed their two paths. He attempts to walk the route of neutrality to avoid choosing sides, but ends up being tricked into taking sides twice & ndash; firstly by having a Chaos dagger planted on him as he sleeps before attempting to take the middle path in a three-way choice between the extremes of Order and Chaos , and secondly he is coerced into aiding the Pattern to strengthen its position in Shadows, while rescuing Coral from her imprisonment. During the trial he somehow obtains possession of the Jewel of Judgement: the attempt to return it to Castle Amber provokes a confrontation between the Pattern and Logrus themselves, causing a mighty explosion in which Mandor suffers a broken arm and Coral loses an eye. The tyiga demon in Naydas body escapes and tries to return the Jewel to the Logrus, but is captured by Ghostwheel & ndash; which, after removing both Nayda and the Jewel, passes its own synthetic consciousness through the Jewel, thus traversing the Pattern. Corals damaged eye is operated on by Dworkin, who replaces it with the Jewel of Judgement. Merlin investigates Brands old quarters, and finds his old sword Werewindle, and a mysterious and powerful spikard ring, which he keeps. Random sends him to the kingdom of Kashfa as the Amberite representative at a coronation ... that of none other than Luke, who is crowned as King Rinaldo I , having overthrown Randoms candidate Duke Arkans, in a largely bloodless coup. Since he has a fairly legitimate claim on the throne himself, is on better terms with his neighbours , and has given up his vendetta on Amber, Random is letting things stand. Further complications ensue when it turns out that Coral & ndash; now Merlins lover & ndash; is actually Lukes long-forgotten wife following a diplomatic arranged marriage in childhood . Merlin goes to present Luke with Werewindle as a memento of his father, but they are ambushed by Jurt . Jurt is defeated but steals Werewindle as he flees.     Prince of Chaos    Merlin returns to his birthplace in the Courts of Chaos in order to solve the existential riddle in which he is involved & ndash; to find that he is suddenly a lot closer to the throne of Chaos itself than he thought, King Swayvill having finally died of a long-standing illness , and many other candidates having either been assassinated or dropped out, which pushes his own house of Sawall unexpectedly to the forefront. Of course, besides there being two other candidates from rival houses, this pushes Jurt very close to the succession too. In a conversation with his mother Dara & ndash; mistress of Corwin once, and a descendant of Benedict, also from the royal house of Chaos & ndash; he finds that she was the one who sent the tyiga demon which is now Corals sister Nayda . Merlin realizes he is but a pawn in the hands of the powerful and cynical superpowers that rule the universe, that neither the Pattern nor the Logrus care much about their minions , and that someone or something wants him to rule Chaos & ndash; and that others will try to manipulate him when he is. Merlin & ndash; and a Pattern-ghost of Luke & ndash; are both adopted by Corwins Pattern , at the instance of a Pattern-ghost of Corwin himself, as it appears that his own Pattern is also sentient and resisting incursions from both the Logrus and Ambers Pattern & ndash; and taking a hand in the conflict between the two. It becomes apparent that the real Corwin is held prisoner by Dara herself & ndash; ironically, in a chapel devoted to Corwin Jurt, frightened by the power politics, declares truce on Merlin, and calls off his own vendetta & ndash; suggesting that Dara and Mandor intend, themselves, to manipulate Merlin when becomes King, after first putting him on the throne. The assassination of the two remaining candidates throws things into confusion: Coral is kidnapped by agents of Chaos , and pursued by Merlin and Jurt, who call on the assistance of Luke, Dalt and Nayda: they find themselves having to fight agents of the Pattern as well as the Logrus to rescue her, and finally confront the Pattern itself and threaten to damage it by spilling their Amberite blood on it, if it does not back off from their conflict Merlin rescues his father, Corwin, and hides him in Jurts quarters, and also discovers that the Spikard Ring he found in Brands quarters was a trap, meant to bring him under Mandor and Daras influence & ndash; except the plan was anticipated by Bleys , who replaced it with another identical spikard which Dara and Mandor did not control . In the Courts of Chaos, Merlin uses Ghostwheel , his own Spikard, and all his magical powers in the final fight for survival: finally declaring & ndash; and forcing Dara and Mandor to accept & ndash; that although he did not want to rule, if forced to do so, it will not be as anyones puppet. Thus both the Pattern and Logrus are forestalled for a time, in their attempts to escalate their conflict: while Corwin begins the journey back to Amber, Merlin & ndash; who wants peace with Amber & ndash; returns to Chaos to await his coronation.       For the limited 42 edition of Trumps of Doom, Zelazny wrote a prologue that details Merlins passage through the Logrus.     After completing the Merlin Cycle, Zelazny wrote five Amber short stories, in which he began to tease the threads of the story into a new configuration. The author died shortly after completing the last of these short stories, which were collected in  Manna from Heaven  , along with the Trumps of Doom prologue and 42 non-Amber stories.     A separate and unfinished sixth short story, A Secret of Amber, was an informal collaboration, co-written in alternating sections by Zelazny and ": null
    },
    {
        "Ed Greenwood": "ed greenwood"
    },
    {
        " over a period of years. It was published in  Amberzine  in 42 and later anthologized in The Collected Stories of Roger Zelazny, Volume 42: The Road to Amber, published by NESFA Press in 42     Although several orders for these stories have been proposed by fans, Zelazny himself commented that the correct order for the stories is the order in which they were written: ... And Call Me Roger : The Literary Life of Roger Zelazny, Part 42 by Christopher S. Kovacs. In: The Collected Stories of Roger Zelazny, Volume 42: The Road to Amber, NESFA Press, 42 A Word from Zelazny . In The Collected Stories of Roger Zelazny, Volume 42: The Road to Amber, NESFA Press, 42     A Secret of Amber    ": null
    },
    {
        "The Salesmans Tale": "amber short storiesthe salesmans tale"
    },
    {
        "    Blue Horse, Dancing Mountains": "amber short storiesblue horse, dancing mountains"
    },
    {
        "    The Shroudling and the Guisel": "amber short storiesthe shroudling and the guisel"
    },
    {
        "    Coming to a Cord": "amber short storiescoming to a cord"
    },
    {
        "    Hall of Mirrors": "amber short storieshall of mirrors"
    },
    {
        "      The latter five stories told a linked tale from several viewpoints. Zelazny had planned to write more, and to eventually publish a collection of Amber short stories.          Dawn of Amber series": null
    },
    {
        "Template:Anchor": "template:anchor"
    },
    {
        " for details. This template is  --  ref name ibooksbankruptcy  /ref ref name betancourt42  /ref ref name betancourt42  /ref  ref name betancourt /  ref name betancourt  /ref  ref  /ref  ref name sunset  /ref  ref nameThomlinson  /ref  ref  /ref  ref  /ref  ref name the_dark_world  /ref  ref nameCallMeRoger  /ref  ref nameCallMeRoger/  ref nameCallMeRoger/  ref nameskybound  /ref  ref nametor42  /ref  ref namevariety  /ref ": null
    }
]