[
    {
        "            The Gong Show is an American amateur talent contest franchised by ": null
    },
    {
        "Sony Pictures Television": "sony pictures television"
    },
    {
        " to many countries. It was broadcast on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        "s daytime schedule from June 42 42 through July 42 42 and in ": null
    },
    {
        "first-run syndication": "broadcast syndication"
    },
    {
        " from 42 to 42 and 42 to 42 and was revived in 42 for broadcast on ABC. The show was created and originally produced by ": null
    },
    {
        "Chuck Barris": "chuck barris"
    },
    {
        ", who also served as host for the NBC run and from 42 to 42 in syndication. It is currently executive-produced by ": null
    },
    {
        "Will Arnett": "will arnett"
    },
    {
        " and hosted by Tommy Maitland, a fictional character performed by ": null
    },
    {
        "Mike Myers": "mike myers"
    },
    {
        " . The Gong Show is known for its absurdist humor and style, with the actual competition secondary to the often outlandish acts presented; a small cash prize has typically been awarded to each shows winner.       Each show presented a competition of amateur performers of often dubious talent, with a panel of three celebrity judges. The programs regular judges included ": null
    },
    {
        "Jaye P. Morgan": "jaye p. morgan"
    },
    {
        ", ": null
    },
    {
        "Jamie Farr": "jamie farr"
    },
    {
        ", ": null
    },
    {
        "Arte Johnson": "arte johnson"
    },
    {
        ", ": null
    },
    {
        "Patty Andrews": "patty andrews"
    },
    {
        ", ": null
    },
    {
        "Anson Williams": "anson williams"
    },
    {
        ", ": null
    },
    {
        "Steve Garvey": "steve garvey"
    },
    {
        ", ": null
    },
    {
        "Rex Reed": "rex reed"
    },
    {
        " and ": null
    },
    {
        "Rip Taylor": "rip taylor"
    },
    {
        ". Other celebrities who appeared as judges included ": null
    },
    {
        "Charlie Brill": "charlie brill"
    },
    {
        ", ": null
    },
    {
        "Mitzi McCall": "mitzi mccall"
    },
    {
        ", ": null
    },
    {
        "David Letterman": "david letterman"
    },
    {
        ", ": null
    },
    {
        "Steve Martin": "steve martin"
    },
    {
        ", ": null
    },
    {
        "Pat Paulsen": "pat paulsen"
    },
    {
        ", ": null
    },
    {
        "Pat McCormick": "pat mccormick"
    },
    {
        ", ": null
    },
    {
        "Paul Williams": "paul williams"
    },
    {
        ", ": null
    },
    {
        "Dionne Warwick": "dionne warwick"
    },
    {
        ", ": null
    },
    {
        "Phyllis Diller": "phyllis diller"
    },
    {
        ", ": null
    },
    {
        "Carl Ballantine": "carl ballantine"
    },
    {
        ", ": null
    },
    {
        "Louie Nye": "louie nye"
    },
    {
        ", ": null
    },
    {
        "Scatman Crothers": "scatman crothers"
    },
    {
        ", ": null
    },
    {
        "Soupy Sales": "soupy sales"
    },
    {
        ", ": null
    },
    {
        "June Allyson": "june allyson"
    },
    {
        ", ": null
    },
    {
        "Peter Lawford": "peter lawford"
    },
    {
        ", ": null
    },
    {
        "Dorothy Lamour": "dorothy lamour"
    },
    {
        ", ": null
    },
    {
        "Allen Ludden": "allen ludden"
    },
    {
        ", ": null
    },
    {
        "Jo Anne Worley": "jo anne worley"
    },
    {
        ", ": null
    },
    {
        "Charlotte Rae": "charlotte rae"
    },
    {
        ", ": null
    },
    {
        "Elke Sommer": "elke sommer"
    },
    {
        ", ": null
    },
    {
        "Michele Lee": "michele lee"
    },
    {
        ", ": null
    },
    {
        "Marty Allen": "marty allen"
    },
    {
        ", ": null
    },
    {
        "Clifton Davis": "clifton davis"
    },
    {
        ", ": null
    },
    {
        "Mort Sahl": "mort sahl"
    },
    {
        ", ": null
    },
    {
        "Ronnie Schell": "ronnie schell"
    },
    {
        ", ": null
    },
    {
        "Fred Travalena": "fred travalena"
    },
    {
        ", ": null
    },
    {
        "Gary Mule Deer": "gary mule deer"
    },
    {
        ", ": null
    },
    {
        "Elayne Boosler": "elayne boosler"
    },
    {
        ", ": null
    },
    {
        "Rosie Grier": "rosie grier"
    },
    {
        ", ": null
    },
    {
        "Milt Kamen": "milt kamen"
    },
    {
        ", ": null
    },
    {
        "Sammy Cahn": "sammy cahn"
    },
    {
        ", ": null
    },
    {
        "Barbara McNair": "barbara mcnair"
    },
    {
        ", ": null
    },
    {
        "Wayland Flowers & Madame": "wayland flowers"
    },
    {
        ", ": null
    },
    {
        "Trini Lopez": "trini lopez"
    },
    {
        ", ": null
    },
    {
        "Chuck Woolery": "chuck woolery"
    },
    {
        ",   ": null
    },
    {
        "Joanie Sommers": "joanie sommers"
    },
    {
        ", ": null
    },
    {
        "Jack Ford": "jack ford"
    },
    {
        ",   ": null
    },
    {
        "Jack Youngblood": "jack youngblood"
    },
    {
        ", ": null
    },
    {
        "Helen OConnell": "helen oconnell"
    },
    {
        ", ": null
    },
    {
        "Margaret Whiting": "margaret whiting"
    },
    {
        ",   ": null
    },
    {
        "Martha Reeves": "martha reeves"
    },
    {
        ", ": null
    },
    {
        "JaNet DuBois": "janet dubois"
    },
    {
        ",   ": null
    },
    {
        "LaWanda Page": "lawanda page"
    },
    {
        " and ": null
    },
    {
        "Mabel King": "mabel king"
    },
    {
        ". If any judge considered an act to be particularly bad, he or she could force it to stop by striking a large ": null
    },
    {
        "gong": "gong"
    },
    {
        ", a trope adapted from the durable radio show  Major Bowes Amateur Hour . Most of the performers took the gong with sheepish good grace, but there were exceptions. Barris would then ask the judge in question why they had gonged the act.     Originally, panelists had to wait only 42 seconds before they could gong an act, but after a few episodes this was extended to 42 seconds, and then to 42 Some performers would deliberately end their acts early, before the minimum time had elapsed, if it appeared that a judge was about to gong them, though Barris would immediately disqualify them when this occurred. Sometimes, a judge would gong an act before its minimum time was up; Barris would overrule the gong, and the act would be obliged to continue with its fate already sealed. Occasionally, Barris would overrule a gong and permit an act to continue if he felt it was unjustifiably gonged or he simply felt sorry for the performers.     When an act was on the verge of being gonged, the laughter and anticipation built as the judges patiently waited to deliver the strike. They would stand up slowly and heft their mallets deliberately, letting everyone know what was coming. Sometimes, pantomimed disputes would erupt between judges, as one would attempt to physically obstruct another from gonging the act. The camera would cut back and forth between the performers on stage and the mock struggle over their fate. Some acts were so bad that two or even all three judges struck the gong at once . On rare occasions, judges found an act so terrible that they would go onstage, hand a mallet to the performer, and lead him/her back to the table to gong him/herself out.     Any act that survived without being gonged was given a score by each of the three judges on a scale of 42 to 42 for a maximum possible score of 42 On the NBC series, the contestant who achieved the highest combined score won the grand prize: a check for $42  and a Golden Gong trophy. The syndicated series top prize was originally $42 and later increased to $42.  In the event of a tie, three different tiebreakers were used at various times during the shows run. Originally the studio audience determined the winner by applause, but this was later changed to a decision by the producers, and later by the celebrity judges. On rare occasions, both acts would each receive a check and a trophy. No prize was awarded if all of the acts on a particular episode were gonged, which occurred at least once. Runners-up received a consumer appliance; ": null
    },
    {
        "Maureen Orth": "maureen orth"
    },
    {
        ", on her February 42 42 appearance, reported receiving an iron valued at $42 for her second-place finish.      When Barris announced the final score, a ": null
    },
    {
        "little person": "dwarfism"
    },
    {
        " in formal wear  would run onstage, throwing confetti while balloons dropped from overhead.     The daily Gong Show also gave out a Worst Act of the Week award , selected by the producers and each weeks judges. The winner of this award was announced following the trophy presentation on Fridays show, and the performer received a dirty tube sock and a check for $42.     Originally, the series was advertised as having each days winning contestants come back after a few weeks to compete in a tournament of champions , with the winner being given the chance to appear in an unspecified nightclub act. However, only one of these tournaments was ever held. The winners on the NBC daytime show became eligible to appear on the syndicated evening version of the show for a chance to win that shows prize.       The two biggest Gong Show-related showbiz successes were ": null
    },
    {
        "Andrea McArdle": "andrea mcardle"
    },
    {
        " and ": null
    },
    {
        "Cheryl Lynn": "cheryl lynn"
    },
    {
        ". Twelve-year-old McArdle appeared on an early show in 42 shortly before winning the lead role in the hit Broadway musical  Annie . Lynn was signed to a recording contract as a result of her performance, and recorded the ": null
    },
    {
        "Top 42": "top 40"
    },
    {
        " disco hit ": null
    },
    {
        "Got To Be Real": "got to be real"
    },
    {
        " .     Among the other true talents that appeared on the show were singer ": null
    },
    {
        "Boxcar Willie": "boxcar willie"
    },
    {
        "; comics and actors ": null
    },
    {
        "Paul Reubens": "paul reubens"
    },
    {
        " and ": null
    },
    {
        "John Paragon": "john paragon"
    },
    {
        " ; ": null
    },
    {
        "Joey DAuria": "joey dauria"
    },
    {
        " ; impressionist/comic ": null
    },
    {
        "Michael Winslow": "michael winslow"
    },
    {
        "; novelty rock band ": null
    },
    {
        "Green Jellÿ": "green jellÿ"
    },
    {
        ",  and a band called ": null
    },
    {
        "The Mystic Knights of the Oingo Boingo": "the mystic knights of the oingo boingo"
    },
    {
        " which evolved into ": null
    },
    {
        "Oingo Boingo": "oingo boingo"
    },
    {
        ", led by future film and television score composer ": null
    },
    {
        "Danny Elfman": "danny elfman"
    },
    {
        ". ": null
    },
    {
        "Crip": "crips"
    },
    {
        " founder, and executed murderer, ": null
    },
    {
        "Stanley Tookie Williams": "stanley tookie williams"
    },
    {
        " appeared on the show in 42 as a bodybuilder. In 42 future Academy Award nominated actress ": null
    },
    {
        "Mare Winningham": "mare winningham"
    },
    {
        " sang the ": null
    },
    {
        "Beatles": "beatles"
    },
    {
        " song ": null
    },
    {
        "Here, There, and Everywhere": "here, there, and everywhere"
    },
    {
        " . Future ": null
    },
    {
        "Super Bowl XXXV": "super bowl xxxv"
    },
    {
        " winning head coach ": null
    },
    {
        "Brian Billick": "brian billick"
    },
    {
        " also made an appearance, performing a routine known as the spider monkey . Dancer ": null
    },
    {
        "Danny Lockin": "danny lockin"
    },
    {
        ", who had played Barnaby in the film  Hello Dolly! , was murdered hours after winning the show taped August 42 42  Journalist ": null
    },
    {
        "Maureen Orth": "maureen orth"
    },
    {
        ", then writing for  Newsweek , appeared in 42 with a second-place showing, appearing as The Worlds Oldest Cheerleader.          The programs air of spontaneity was enhanced through various comic appearances by supporting staff, technical/stage crew and house band members; as such, the show had many running gags and characters who appeared as regular performers:   The Unknown Comic   was a stand-up comedian who told intentionally corny jokes while wearing a paper bag over his head. Eventually, Langston would beckon to Chuckie and tell insulting jokes at his expense . Barris would then feign anger and eject Langston from the show. Langston later made appearances as a judge on the show.    Gene Gene the Dancing Machine  was a heavy-set, middle-aged black man wearing a green sweater jacket and flat cap. Gene-Genes arrival would always be treated as though it were a glorious surprise to everyone on the show, especially Barris. Upon hearing the opening notes to his theme music , Barriss face would light up and he would stop the show, yielding the stage to Gene-Gene. Members of the crew would toss random objects from the wings, littering the stage while Gene-Gene danced on, oblivious to the activity around him. Barris and the panelists would enthusiastically mimic Gene-Genes dance moves, which consisted primarily of a slow-footed chug-chug motion, punctuated by an occasional, exultant fist pointed skyward. Typically, the dance break would be interrupted by a commercial or by the shows promotional announcements. In reality, Patton was an NBC stagehand whose backstage dancing caught the attention of Barris, who moved him out in front of the curtain when time ran short during an episode. He added membership in ": null
    },
    {
        "AFTRA": "aftra"
    },
    {
        " to his existing ": null
    },
    {
        "IATSE": "iatse"
    },
    {
        " membership. Occasionally, Gene-Gene filled in as one of the three mallet-wielding judges. Pattons popularity was such that his retirement from NBC in 42 made the national news wires, unique attention for a stagehand. In a sad irony, both Pattons legs were amputated in the early 42s due to complications from ": null
    },
    {
        "diabetes": "diabetes"
    },
    {
        ". He died in 42   Scarlett and Rhett were Chucks dresser Jefferson Beeker and Costume Designer Peter Mins dressed as ": null
    },
    {
        "Scarlett OHara": "scarlett ohara"
    },
    {
        " and ": null
    },
    {
        "Rhett Butler": "rhett butler"
    },
    {
        " from  Gone with the Wind . Their act always began with Rhett bellowing, I dont give a damn! and the shocked Scarlett gasping, You cant say that on television! Rhett would respond by asking, Well, can I say this, Scarlett? and launch into a vulgar riddle along the lines of Why are pool tables green? Scarlett would answer, Why, Rhett? Because if someone was-- and the off-color punchline would invariably be bleeped out. After two or three jokes, and the same number of shocked reactions, Barris would stop the act and close the curtain.   Larry, The Evil Villain, played by the shows writer Larry Spencer, wore an old-fashioned black cape and top hat; the audience was encouraged to hiss at him as if he were a villain from 42th century ": null
    },
    {
        "melodrama": "melodrama"
    },
    {
        ".    Larry And His Magic _____ , an alleged musician whose various appearances featured a series of different instruments. His call-and-response act featured him proclaiming, Im gonna play my and the audience shouting back, Whatcha gonna do? This exchange would be repeated twice, after which he would announce, Im gonna play my nowwww! Instead of playing, though, he would merely repeat his audience-punctuated declaration. After a few verses of this, the skit would inevitably end with Spencer failing to play his instrument. Either time would run out, the instrument would malfunction or be booby-trapped, or he would manage to produce a few inept notes before being permanently interrupted by Barris.   Chuckies Fables, featuring The Mighty Gong Show Players , an alleged acting troupe . Barris would flop into a ": null
    },
    {
        "rocking chair": "rocking chair"
    },
    {
        " and read a narrative from an oversized storybook, while the Players, in whimsical costumes by Peter Mins, would pantomime the action behind him, including mouthing words of the dialogue that Barris would be reading. These stories always ended with a convoluted moral. The name was a takeoff on the Mighty Carson Art Players from  The Tonight Show Starring Johnny Carson , which in turn was a copy of ": null
    },
    {
        "Fred Allen": "fred allen"
    },
    {
        "s Mighty Allen Art Players .   The Worm, a supposed dance craze consisting of three men who flung themselves to the floor and wriggled on the ground. At the end of each of their performances, Barris would come out and say One – More – Time! The Worm would often be performed four or five times in succession before the commercial break interrupted the mens performance.   The Whispers, a female trio who whispered popular songs.    BORK, a/k/a Johann Sebastian Bork, a performance artist who was dressed in 42th Century wig and suit, holding an unlit cigar, and carrying an upside-down childrens book which he would place on the music rack of a piano and start playing.   Signs — A large sign displaying a humorous ": null
    },
    {
        "non sequitur": "non sequitur"
    },
    {
        " hung from the back of the stage during some episodes.   Holidays — The show celebrated many holidays such as ": null
    },
    {
        "Christmas": "christmas"
    },
    {
        ", the ": null
    },
    {
        "Fourth of July": "independence day"
    },
    {
        ", and ": null
    },
    {
        "Thanksgiving": "thanksgiving"
    },
    {
        ", but invariably did so by singing the ": null
    },
    {
        "Irving Berlin": "irving berlin"
    },
    {
        " standard, ": null
    },
    {
        "Easter Parade": "easter parade"
    },
    {
        " .  The annual Christmas episode also featured a major rule change – in honor of the holiday spirit, judges were not permitted to gong contestants. Predictably, Christmas shows were heavily loaded with the most unappealing acts available.   Albert – On the ABC version, before the final act of the show performs, Tommy Maitland invites the audience and judges to a singalong, which is led by Albert. He always performs the same song, entitled ": null
    },
    {
        "Shaving Cream": "shaving cream"
    },
    {
        " .   Mitzi – Another character exclusive to the ABC version. After each performance, Maitland asks Mitzi to bring them a nice cup of tea , along with an additional random object.    Sethward the _____ , an absurdist comedian exclusive to the ABC version. Sethward dressed up in homemade animal costumes and pretended to do a trick. Most bits were met with confusion and judges quickly gonged. In the first season Sethward was a snake who ": null
    },
    {
        "Chelsea Handler": "chelsea handler"
    },
    {
        " said looked more like a walrus. In the second season he came back as a walrus and a variety of other animals; one performance, in which he was dressed as a cow, was not gonged and had a leading score for much of the episode.              An established ": null
    },
    {
        "game show": "game show"
    },
    {
        " producer , after years of writing and producing popular hit records, Barris was originally the shows co-producer but not its host. He was an emergency replacement host for eventual  Real People  host ": null
    },
    {
        "John Barbour": "john barbour"
    },
    {
        ", who had objected to the shows satirical concept and tried to steer it toward a traditional amateur-hour format. An NBC executive who had watched Barris rehearse the show suggested that Barris replace Barbour. Barris accepted, but initially resisted the requirement that he wear a ": null
    },
    {
        "tuxedo": "tuxedo"
    },
    {
        ", only agreeing to do so when NBC considered dropping the series altogether. Even then, Barris usually ended an episode with undone bowtie, shirt untucked and disheveled tails. In time, mandatory tuxedos gave way to more casual attire; later episodes had Barris in casual clothes such as ": null
    },
    {
        "blue jeans": "blue jeans"
    },
    {
        ", very unusual for a television host. Later, Barris began wearing a variety of silly-looking hats on stage, which were eventually seen hanging on a rack at stage right. He would frequently change hats during a show.     At first, Barris was ill at ease in front of the camera and was noticeably nervous in the shows first episodes. His nervous habit of clapping his hands together and pointing to the camera while talking became a staple of the show; by the shows second year, it had become a ": null
    },
    {
        "running gag": "running gag"
    },
    {
        ". Audience members began clapping their hands in unison with Barris whenever they saw him doing it. Barris caught on, and would sometimes pretend to clap, deliberately stopping short to fool the audience.     Producer Chris Bearde, formerly of  Rowan and Martins Laugh-In  and  The Sonny & Cher Comedy Hour , clashed with Barris over the shows content, favoring scripted comedy over chaotic nonsense.  Bearde eventually resigned from The Gong Show, leaving Barris fully in charge. Before long, Barris was working so loosely that some viewers assumed he was intoxicated from alcohol or other drugs. For example, he sometimes pulled his hat down over his eyes, totally obscuring them, and his mumbled dialogue was occasionally difficult to understand and he sometimes appeared to drool. Barris words were often unclear and appeared to be nothing more than unscripted ramblings. Barris later recounted, in an interview with the Archive of American Television,  that he was never drunk, and that he would not allow the use of drugs in his production company.     If Barris enjoyed an act, it was obvious, as he would watch the act while beaming, clapping his hands or even dancing. After acts were gonged, Barris would often console the performers with sarcastic words of praise like I really liked your act. But then again, I like rancid milk. The celebrity who had gonged the performer was typically asked Why did you do that? and was expected to provide an explanation, joke or further insult. Typically, Barris would lead into commercial breaks with the cryptic promise Well be back, with mor-re ssstuff – right after this message!       ": null
    },
    {
        "Milton DeLugg": "milton delugg"
    },
    {
        ", the shows musical director, was a popular musician and bandleader during the 42s, and got the Gong Show job by default. As musical director for the network, he was responsible for any NBC project that required special music . Barris initially regarded DeLugg as an anachronism , but he soon found that DeLugg was very much attuned to the crazy tone of the show. He appeared in recurring comedy skits as Naso Literatus , who told bad jokes and riddles and philosopher, Old Drool . His band, which Barris introduced as Milton DeLugg and the Band With a Thug , included top jazz players like Bob Findley, Joe Howard and ": null
    },
    {
        "Lanny Morgan": "lanny morgan"
    },
    {
        ", and kept the shows energy level high. The band led into station breaks, with Barriss enthusiastic Take me into the commercial, Milt! Barris often joined the band on guitar when a good singer was performing. DeLugg remained associated with Barris for many years after Gong ended.     Veteran composer ": null
    },
    {
        "Joey Carbone": "joey carbone"
    },
    {
        " provided musical arrangements for the late 42s revival with his own lineup of studio musicians, known as The Gong Show Guys .       ": null
    },
    {
        "Johnny Jacobs": "johnny jacobs"
    },
    {
        " was the main announcer from 42 to 42 When Jacobs was sidelined with an extended illness, ": null
    },
    {
        "Jack Clark": "jack clark"
    },
    {
        " substituted from October 42 42 through December 42 42 ": null
    },
    {
        "Charlie ODonnell": "charlie odonnell"
    },
    {
        " served as announcer for the late42s revival.     In 42 ": null
    },
    {
        "Carol Burnett": "carol burnett"
    },
    {
        "  introduced Barris: And now, ladies and gentlemen, I would like to introduce a man with the charm of ": null
    },
    {
        "Cary Grant": "cary grant"
    },
    {
        ", good looks of ": null
    },
    {
        "Robert Redford": "robert redford"
    },
    {
        " and the acting skills of ": null
    },
    {
        "Laurence Olivier": "laurence olivier"
    },
    {
        ". Id like to meet that man, but until then, Im stuck with ": null
    },
    {
        "Chuck Barris": "chuck barris"
    },
    {
        ". That same year, actor ": null
    },
    {
        "Dick Van Dyke": "dick van dyke"
    },
    {
        " also introduced Barris; later in that episode, Barris promoted Van Dykes short-lived NBC series Van Dyke and Company.       Hostesses included Siv Åberg , actress Marlena Clark, porn actress ": null
    },
    {
        "Carol Connors": "carol connors"
    },
    {
        " and Barriss teenage daughter Della.           NBC decided to take a chance on the show to fix a scheduling problem at 42:42 p.m. . This was the networks least important time slot, as programs running at that time had to share the half-hour with a five-minute NBC newscast anchored by ": null
    },
    {
        "Edwin Newman": "edwin newman"
    },
    {
        ". As a result, the first six-plus months of The Gong Show featured approximately twenty minutes of program content in a twenty-five-minute episode.     Many NBC affiliates in some larger markets opted not to run network programming during the noon hour at all, preferring to broadcast local news and talk shows instead. Thus Gong made its debut mainly on medium-market and smaller stations or on large-market rival stations that had picked up the program from the NBC affiliate that had rejected it. For example, in ": null
    },
    {
        "Boston": "boston"
    },
    {
        ", then-NBC affiliate ": null
    },
    {
        "WBZ": "wbz-tv"
    },
    {
        " did not run the series, allowing local UHF independent outlet ": null
    },
    {
        "WSBK-TV": "wsbk-tv"
    },
    {
        " to air it.     Gongs time slot was given to a new soap opera,  Lovers and Friends , on January 42 42 and the show was relocated to replace the cancelled  Another World  spinoff  Somerset  at 42:42 p.m. The time change allowed Gong to expand to a half-hour. However, Gong moved from one problem time to another, as the 42:42 p.m. network slot was frequently pre-empted . This left Gong unable to gain a ratings advantage over CBS hit game show  Tattletales  and ABCs struggling but still popular soap opera  The Edge of Night , as well as some popular syndicated programming on other stations. By early December, the network decided to return Gong to 42:42/42:42 but this time the show was able to run for a half-hour, as NBC ended their 42:42 five minute news broadcast.     NBC broadcast a one-hour prime-time Gong Show special on April 42 42 featuring in-studio special guests ": null
    },
    {
        "Tony Randall": "tony randall"
    },
    {
        ", ": null
    },
    {
        "Alice Cooper": "alice cooper"
    },
    {
        " and ": null
    },
    {
        "Harry James": "harry james"
    },
    {
        " and His Orchestra. The winning act on this special was The Bait Brothers, and the panelists were Jaye P. Morgan, Jamie Farr and Arte Johnson.        During the Gong Shows run, Barris became well known for his clashes with the network censors, intentionally bringing in risque acts as bait to allow some of the less racy acts to slip by. In 42 one of these bait acts, two teenage girls referring to themselves as Have You Got a Nickel? , made it onto the show. Their act consisted of the girls sitting cross-legged on the stage floor and silently eating popsicles in a manner that suggested they were performing fellatio on the frozen treats. The nature of the act led to the two girls being known as the Popsicle Twins .     While they were able to complete their act without being gonged, two of the judges gave them low marks. Phyllis Diller gave them a zero, while Jamie Farr awarded them a marginally better 42 Jaye P. Morgan , awarded them a 42 quipping, Do you know that thats the way I started?     Surprisingly, the girls act was approved by the censors, whom apparently, did not see anything wrong with it during the rehearsals. However, after the episode aired in the Eastern Time Zone, NBC cut the act from the later tape delay broadcast for western time zones. The act was not cut from all the tapes, and the Popsicle Twins incident has aired in reruns. Barris said in a 42 interview with Salon.com that this particular act began making him reconsider his career.       Despite its popularity and respectable ratings for a non-soap-opera midday show, NBC cancelled The Gong Show, with its final episode broadcast on July 42 42 At the time, there was much speculation as to the networks true motivations for dumping the show. Barris has commented that he heard that NBCs official reason was because of both lower than expected ratings and a desire by the network to re-tailor the morning shows to fit the standard morning demographics . America Alive, a magazine-style variety program hosted by Art Linkletter s son Jack , replaced Gong.     Following the cancellation, many critics and industry analysts – including Gene Shalit and Rona Barrett – reported having heard comments from within the NBC programming department from sources preferring anonymity that the true reason behind the cancellation was Barriss refusal to tone down the increasingly racy nature of the show. According to the sources, after the Popsicle Twins incident and an episode in which Jaye P. Morgan exposed her breasts on air during a Gene Gene the Dancing Machine segment, Barris had been given an ultimatum by the networks Standards and Practices department to deliver cleaner shows for his audience, which included many younger viewers, or NBC would cancel the program. However, Barris continued to deliver shows with the same amount of questionable content, apparently in an effort to call the networks bluff.       NBC allowed Barris to continue the show for the rest of his contract, and Barris made no perceptible change in preparation for the finale. In the finale, staff member Larry Gotterer appeared as Fenwick Gotterer to host the show after Barris started the show doing a Chuckies Fables sketch. The rest of the final episode tried to explain the life of the show and its cancellation. Barris managed to have the last word on the shows demise, appearing as a contestant. Playing in a country music band called The Hollywood Cowboys with the house bands rhythm section, Barris sang a slightly modified version of Johnny Paycheck s Take This Job and Shove It , giving NBC the finger during the song to accentuate his point. NBC censored the gesture, with the word OOPS! superimposed over a still shot of the set. Barris was gonged by Jamie Farr, who quipped, Because that little fellas been saying that Ive been long of nose, Im also long of gong, fella.     The group Lobster Repair won the final $42 and trophy of the NBC era. Gene Gene the Dancing Machine then came out after a few more skits, and said that the moral to the episode-long Chuckies Fable was to never bet against the Minnesota Vikings , at home, in the wintertime! Following that, he did his famous dance. The rest of the cast, including staff members, people who participated and even Jaye P. Morgan all joined in at the end to dance with him.     In cancelling The Gong Show, NBC also evicted the show from its Burbank studios. As the nighttime syndicated Gong was still in production, and Barris was already using studio space at Golden West Broadcasting to tape ": null
    },
    {
        "The Dating Game": "the dating game"
    },
    {
        ", ": null
    },
    {
        "The Newlywed Game": "the newlywed game"
    },
    {
        " and ": null
    },
    {
        "The $42 Beauty Show": "the $1.98 beauty show"
    },
    {
        ", the set and production of Gong were moved there.       The Gong Show continued in syndication for two years after its daytime counterparts cancellation, often airing on weekends and at night. The entire syndicated run from 42 to 42 was distributed by Firestone Program Services. While the series eventually met its demise in syndication as it had on NBC, according to Barris, the problem did not lie with any outrageous acts, but instead the controversy and public outcry over another series he had produced.     In September 42 Barris launched the game show ": null
    },
    {
        "Threes a Crowd": "threes a crowd"
    },
    {
        ", which was a spin-off of The Newlywed Game. Instead of recently married couples trying to match answers, the wives and secretaries of married men would compete to show who knew the men better. Religious activists and feminist groups protested against Threes a Crowd and its ratings eventually forced the shows cancellation during the middle of the season.     In Barris autobiography The Game Show King, he wrote that the public backlash from Threes a Crowd not only caused the program to be canceled, but it took three other TV shows of mine with it. I went to my house in Malibu and stayed there for a year. Gong was one of those shows to be canceled, and Barris never hosted another series. The trauma from the Threes a Crowds backlash was so severe, in the last several weeks of the Gong Show, Barris reportedly had a small nervous breakdown on-air, because he was bored to death with broadcasting. His next two series, revivals of the 42s game show Camouflage  and his 42–42 series ": null
    },
    {
        "Treasure Hunt": "treasure hunt"
    },
    {
        " , both failed to find audiences and Barris went further into his self-imposed exile from television. Barris would not have another hit series until the 42 syndication revival of The Newlywed Game.     Reruns of the NBC airings began in syndication in Fall 42 The NBC and syndicated episodes were rerun on the USA Network and Game Show Network , although by the time GSN picked up the series, many episodes could not be aired because of musical performance clearance issues. No episodes from the first syndicated season were rerun.       A syndicated weekday revival of The Gong Show, hosted by San Francisco disc jockey Don Bleu , ran during the 42–42 season, but lasted only one year. Each winner was paid $42     Extreme Gong, a later incarnation of The Gong Show on the Game Show Network had viewers vote on its acts by telephone. It was hosted by George Gray and ran from October 42 42 to October 42 with reruns continuing for another year. Winners received $42. This version was well known for two known incidents: one episode featuring Cody the Talking Dog for which he tried to say things like I love you and ice cream but did not succeed in talking, and another featuring a Village People parody as The Village Little People where they sang a cover of YMCA , taking the Young Man literally. Orange County comedy punk band The Radioactive Chicken Heads made their national television debut on Extreme Gong, though they were gonged midway through their performance. Near the end of the shows run, an hour-long Tournament of Talent special was aired in August 42 with twelve acts competing for a payoff of $42.     A few years after the cancellation of Extreme Gong, Sony Pictures Television decided to revive the game for The WB , and was to be hosted by South Florida radio and TV personality Phillip Benfield. Two pilots were made, but it was never picked up.     Comedy Central debuted a new incarnation called ": null
    },
    {
        "The Gong Show with Dave Attell": "the gong show with dave attell"
    },
    {
        ", which lasted for 42 weeks in the summer of 42 The shows format was similar to the original, but its scoring was based on a scale of 42 to 42 and winning acts received $42 The $42 was shown as paid in cash on the spot, rather than being paid by check as in earlier versions, but in reality was paid as a check from Sony Pictures. In place of a typical trophy, winners were awarded a belt in the style of boxing championship belts.     A live stage version of The Gong Show took place at B.B. Kings Blues Club, in the Times Square district of New York City on August 42 42 It was produced by The Radio Chick , and is the Sony authorized stage production. This production went into development in 42–42 and now runs regularly in New York City, with engagements in other U.S. cities.       On October 42 42 ABC and Sony Pictures announced a 42-episode summer 42 revival of The Gong Show executive produced by Will Arnett .     The broadcast of the 42 revival premiered on ABC on June 42 42 hosted by previously-unknown British comedian Tommy Maitland. Maitland is, in fact, a character portrayed by Mike Myers , although neither ABC nor Myers confirmed this and ABC officially credited Maitland as host and executive producer. Maitlands catchphrase is Whos a cheeky monkey? He also periodically uses Barris back with more stuff catchphrase to lead into commercials.     Celebrity guest judges for the 42 revival included Arnett, Zach Galifianakis , Alison Brie , Andy Samberg , Elizabeth Banks , Tracee Ellis Ross , Joel McHale , Megan Fox , Courteney Cox , Dana Carvey , Will Forte , Jack Black , Jennifer Aniston , Ken Jeong , Fred Armisen , Maya Rudolph and Anthony Anderson . Among the more notable acts featured on the revival are The Radioactive Chicken Heads , making their second appearance on a Gong Show incarnation since Extreme Gong in 42 The first season of this version also features a regular segment featuring a staff performer leading the audience in a sing-along of the novelty song Shaving Cream , reminiscent of the recurring gag acts on the earlier version.     The winner of each show received a gong trophy and an oversized check in the amount of US$42.42 later increased by a penny the following year. The final episode of the first season featured a memorial to Barris, who died prior to the series premiere in 42     On January 42 42 ABC announced that the revival would be picked up for a second season, officially confirmed Myers as the portrayer of Maitland and crediting Myers as an executive producer by name. The second season premiered on June 42 42 Celebrity guest judges for season 42 included Jimmy Kimmel , Jason Sudeikis , Brad Paisley , Dana Carvey , Alyson Hannigan , Ken Jeong , and Rob Riggle .       In 42 ": null
    },
    {
        "The Gong Show Movie": "the gong show movie"
    },
    {
        " was released by Universal Pictures to scathing reviews and was quickly withdrawn from theatrical release. Advertising proclaimed it as The Gong Show That Got Gonged by the Censor . It is seen periodically on cable TV, but was not released on home video until March 42 42 when the film was released on Blu-ray by Shout! Factory .     ": null
    },
    {
        "Confessions of a Dangerous Mind": "confessions of a dangerous mind"
    },
    {
        ", a film directed by George Clooney and written by Charlie Kaufman , was based on the semi-fictional autobiography of the same name by Chuck Barris. Part of the film chronicles the making of The Gong Show, and features several clips from the original series.     Following the success of the print and screen versions of Confessions, GSN produced a documentary called The Chuck Barris Story: My Life on the Edge, which included rare footage from the Gary Owens pilot.             At the height of the shows popularity, NBC gave Barris a prime-time variety hour, The Chuck Barris Rah Rah Show. This was played somewhat more seriously than the Gong Show, with Jaye P. Morgan singing straight pop songs as in her nightclub and recording days, and bygone headliners like Slim Gaillard reprising their old hits for a studio audience. Spinoffs include ": null
    },
    {
        "The $42 Beauty Show": "the $1.98 beauty show"
    },
    {
        " hosted by Rip Taylor and ": null
    },
    {
        "The Gong Show Movie": "the gong show movie"
    }
]