[
    {
        "     The Lonely is episode seven of the ": null
    },
    {
        "American television": "television in the united states"
    },
    {
        " anthology series  The Twilight Zone . It originally aired on November 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              In 42 an inmate named Corry is sentenced to ": null
    },
    {
        "solitary confinement": "solitary confinement"
    },
    {
        " on a distant ": null
    },
    {
        "asteroid": "asteroid"
    },
    {
        " for 42 years for murder. In his fourth year of confinement, he is visited by a ": null
    },
    {
        "spacecraft": "spacecraft"
    },
    {
        " that regularly brings him supplies and news from the ": null
    },
    {
        "Earth": "earth"
    },
    {
        " four times a year. The ship and crew can stay for only 42 minutes each visit, as the asteroids orbit and the ships fuel consumption rate make longer visits impossible, lest the space-traveling delivery crew be stuck for 42 weeks or more, awaiting favorable orbital conditions to depart. Captain Allenbys crew loathe being away from Earth and taunt Corry.     Captain Allenby has been trying to make Corrys stay humanely tolerable by bringing him things to take his mind off the loneliness, like the components to build an old car. Captain Allenby believes Corry that the killing was in self-defense and sympathizes with him. Corrys pardon was rejected and murder cases have a review backlog of 42 years or more. On this trip on the fifteenth day of the sixth month of the fourth year, however, Allenby tells Corry not to open a certain crate that has just been delivered until after the transport crew leaves. Upon opening the special container, Corry discovers that Allenby has left him with a ": null
    },
    {
        "Gynoid": "gynoid"
    },
    {
        " named Alicia to keep him company. Alicia is capable of emotions, memory and has a lifespan comparable to a human. At first, Corry detests her, rejecting Alicia as a mere ": null
    },
    {
        "machine": "machine"
    },
    {
        ", synthetic skin and wires inside only capable of mocking him. However, when Corry hurts Alicia and sees that she is in fact capable of crying, he immediately realizes that she has feelings. Over the next 42 months, Corry begins to fall in love with her. Alicia develops a personality that mirrors Corrys, and the days become bearable.     When the ship returns, Captain Allenby brings news that Corry has been pardoned after a review of past murder cases, but they only have 42 minutes to leave. The crew has been dodging meteors and are nearly out of fuel. Corry, it seems, can return home to Earth immediately. Corry learns that there is only room for fifteen pounds of luggage. Corry seems unconcerned as he doesnt have 42 pounds worth of possessions that he cares about, until he realizes that the crew does not consider Alicia human. The 42-pound limit is far too small for his robot companion, as there are seven other passengers on the ship from other asteroids. He frantically tries to find some way to take Alicia with him, arguing that she is not a robot, but a woman, and insisting that Allenby simply does not know Alicia as he does. At that point, just as the rest of the transport crew is surprised at the sight of Alicia, Allenby suddenly draws his gun and shoots her in the face. The robot breaks down, malfunctioning, her face a mass of wire and broken circuitry which repeats the name Corry . He then takes Corry back to the ship, assuring him he will only be leaving behind ": null
    },
    {
        "loneliness": "loneliness"
    },
    {
        ". I must remember that , Corry says tonelessly. I must remember to keep that in mind .        ": null
    },
    {
        "Jack Warden": "jack warden"
    },
    {
        " as James A. Corry   ": null
    },
    {
        "Jean Marsh": "jean marsh"
    },
    {
        " as Alicia   ": null
    },
    {
        "John Dehner": "john dehner"
    },
    {
        " as Allenby   ": null
    },
    {
        "Ted Knight": "ted knight"
    },
    {
        " as Adams   ": null
    },
    {
        "James Turley": "james turley"
    },
    {
        " as Carstairs       An audio adaptation of The Lonely , featuring ": null
    },
    {
        "Mike Starr": "mike starr"
    },
    {
        " as Corry, was produced for radio in the mid42s; it was released on CD by ": null
    },
    {
        "CBS Consumer Products": "cbs consumer products"
    },
    {
        " in 42 as part of The Twilight Zone Radio Dramas Vol. 42.     In 42 The Lonely was produced for the stage by 42 Letter Entertainment.       The Lonely was the first regular episode to enter production following the success of the pilot episode, ": null
    },
    {
        "Where Is Everybody?": "where is everybody?"
    },
    {
        " in selling the series.     It was the first of several episodes  to be filmed on location in ": null
    },
    {
        "Death Valley": "death valley"
    },
    {
        ". Unprepared for the terrible conditions they would face, the crew suffered extreme dehydration and heat exhaustion and director of photography ": null
    },
    {
        "George T. Clemens": "george t. clemens"
    },
    {
        " even collapsed, falling from a camera crane while filming continued.       Zicree, Marc Scott: The Twilight Zone Companion. Sillman-James Press, 42   DeVoe, Bill. . Trivia from The Twilight Zone. Albany, GA: Bear Manor Media.  The Twilight Zone: Unlocking the Door to a Television Classic. Churchville, MD: OTR Publishing.                                       ": null
    }
]