[
    {
        "     The Show Must Go Off! is a live concert ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " series produced by ": null
    },
    {
        "Kung Fu Films": "kung fu films"
    },
    {
        ", an offshoot of the ": null
    },
    {
        "Kung Fu Records": "kung fu records"
    },
    {
        " label run by ": null
    },
    {
        "Vandals": "the vandals"
    },
    {
        " bassist": "bassist"
    },
    {
        " Joe Escalante": "joe escalante"
    },
    {
        ", who also acts as producer for the series. The series began in 42 and has thus far included 42 episodes, the most recent of which was released in 42     The series initiated in July 42 with the release of a live Vandals concert DVD recorded in December 42 at their annual Christmas Formal concert. However, this release did not originally bear the Show Must Go Off! moniker. The series title came into use with the second release in the series, a performance by ": null
    },
    {
        "Mest": "mest"
    },
    {
        " at the ": null
    },
    {
        "House of Blues": "house of blues"
    },
    {
        ". This was later re-labeled as Episode 42 in the series, with the Vandals Christmas DVD being re-labeled Episode 42 The series consists mostly of ": null
    },
    {
        "punk rock": "punk rock"
    },
    {
        " and ": null
    },
    {
        "pop punk": "pop punk"
    },
    {
        " bands from various eras, including older groups that experienced their heyday in the 42s, later groups who rose to popularity in the 42s, and younger acts that have formed or gained popularity in recent years.     As the series has progressed its production values have improved, and numerous special features have been incorporated into the DVD releases. Episode 42 The Vandals  Live at the House of Blues  uses the most of such bonus features thus far, including a ": null
    },
    {
        "Josh Freese": "josh freese"
    },
    {
        " cam with a picture-in-picture close-up of his foot pedal, optional on-screen lyrics, and multiple band commentaries.               ": null
    }
]