[
    {
        "     The Andromeda Strain is a 42 ": null
    },
    {
        "techno-thriller": "techno-thriller"
    },
    {
        " novel by ": null
    },
    {
        "Michael Crichton": "michael crichton"
    },
    {
        " documenting the efforts of a team of scientists investigating the ": null
    },
    {
        "outbreak": "outbreak"
    },
    {
        " of a deadly ": null
    },
    {
        "extraterrestrial": "extraterrestrial life"
    },
    {
        " microorganism": "microorganism"
    },
    {
        " in ": null
    },
    {
        "Arizona": "arizona"
    },
    {
        ". The Andromeda Strain appeared in the ": null
    },
    {
        "New York Times Best Seller list": "the new york times best seller list"
    },
    {
        ", establishing Michael Crichton as a ": null
    },
    {
        "genre": "genre"
    },
    {
        " writer.       A team is deployed to recover a ": null
    },
    {
        "military satellite": "military satellite"
    },
    {
        " which has returned to Earth, but contact is lost abruptly. ": null
    },
    {
        "Aerial surveillance": "aerial surveillance"
    },
    {
        " reveals that everyone in Piedmont, ": null
    },
    {
        "Arizona": "arizona"
    },
    {
        ", the town closest to where the satellite landed, is apparently dead. The ": null
    },
    {
        "duty officer": "duty officer"
    },
    {
        " of the base tasked with retrieving the satellite suspects that it returned with an ": null
    },
    {
        "extraterrestrial": "extraterrestrial life"
    },
    {
        " contaminant": "contaminant"
    },
    {
        " and recommends activating Wildfire , a protocol for a government-sponsored team of scientists intended to contain threats of this nature.     The Wildfire team, led by Dr. Jeremy Stone, believes the satellite - intentionally designed to capture upper-atmosphere ": null
    },
    {
        "microorganism": "microorganism"
    },
    {
        "s for ": null
    },
    {
        "bio-weapon": "biological agent"
    },
    {
        " exploitation - returned with a deadly microorganism that kills through nearly instantaneous ": null
    },
    {
        "blood clotting": "disseminated intravascular coagulation"
    },
    {
        ". Upon investigating Piedmont, the team discovers that the townspeople either died in mid-stride or went quietly nuts and committed bizarre ": null
    },
    {
        "suicide": "suicide"
    },
    {
        "s. Two survivors — the sick, ": null
    },
    {
        "Sterno": "sterno"
    },
    {
        "-addicted, geriatric Peter Jackson and the constantly bawling infant Jamie Ritter — are biological opposites who somehow survived the organism.     Jackson, Ritter, and the satellite are taken to the secret underground Wildfire laboratory, a secure facility equipped with every known capacity for protection against microorganisms escaping into the environment. Wildfire is hidden in a remote area near the town of Flatrock, ": null
    },
    {
        "Nevada": "nevada"
    },
    {
        ", sixty miles from ": null
    },
    {
        "Las Vegas": "las vegas, nevada"
    },
    {
        ", concealed in the sub-basements of a legitimate ": null
    },
    {
        "Department of Agriculture": "united states department of agriculture"
    },
    {
        " research station. Dr. Hall is the only scientist authorized to disarm the automatic ": null
    },
    {
        "self-destruct mechanism": "self-destruct"
    },
    {
        "; he is an unmarried male and thus presumed to make the most dispassionate decisions during crises.     Further investigation determines that the deaths were caused by an extraterrestrial microbe transported by a ": null
    },
    {
        "meteor": "meteor"
    },
    {
        " that crashed into the satellite, knocking it from orbit. The microbe contains ": null
    },
    {
        "chemical elements": "chemical elements"
    },
    {
        " required for terrestrial life and appears to have a ": null
    },
    {
        "crystalline structure": "crystalline structure"
    },
    {
        ", but lacks the ": null
    },
    {
        "DNA": "dna"
    },
    {
        ", ": null
    },
    {
        "RNA": "rna"
    },
    {
        ", ": null
    },
    {
        "proteins": "proteins"
    },
    {
        ", and ": null
    },
    {
        "amino acid": "amino acid"
    },
    {
        "s present in all forms of terrestrial life, and directly transforms energy to matter with no discernible byproducts. The microbe, code named Andromeda , mutates with each growth cycle, changing its biological properties.     The scientists learn that the current form of Andromeda grows only within a narrow ": null
    },
    {
        "pH": "ph"
    },
    {
        " range; in a too-acidic or too-": null
    },
    {
        "alkali": "alkali"
    },
    {
        "ne growth medium, it will not multiply. Andromedas ideal pH range is 42–42, within the range found in normal ": null
    },
    {
        "human blood": "human blood"
    },
    {
        ". Jackson and Ritter survived because both had abnormal blood pH . However, by the time the scientists realize this, Andromeda has mutated into a form that degrades the labs plastic seals and escapes its ": null
    },
    {
        "containment": "biocontainment"
    },
    {
        ". Trapped in a contaminated lab, Burton demands that Stone inject him with a universal ": null
    },
    {
        "antibiotic": "antibiotic"
    },
    {
        " ; Stone refuses, arguing it would render Burton too vulnerable to infection by other harmful bacteria. Burton survives because the mutated Andromeda is no longer ": null
    },
    {
        "pathogen": "pathogen"
    },
    {
        "ic.     The mutated Andromeda attacks the ": null
    },
    {
        "synthetic rubber": "synthetic rubber"
    },
    {
        " door and hatch seals within the Wildfire facility, rapidly migrating toward the upper levels and the surface. The self-destruct ": null
    },
    {
        "nuclear weapon": "nuclear weapon"
    },
    {
        " is automatically armed when it detects the containment breach, triggering its detonation countdown to prevent the spread of the infection. As the bomb arms, the scientists realize that given Andromedas ability to generate matter directly from energy, the organism would be able to consume the released energy and ultimately benefit from a ": null
    },
    {
        "nuclear explosion": "nuclear explosion"
    },
    {
        ", forming a large indestructible ": null
    },
    {
        "biofilm": "biofilm"
    },
    {
        " within a day.     To halt the detonation, Hall must insert a special key he carries into an emergency substation, one of which should be accessible from any location in Wildfire. Unfortunately, he is trapped in a section which, due to an oversight, has no substation. He must navigate Wildfires obstacle course of automatic defenses to reach a working substation on an upper level. He barely disarms the bomb in time before all the air is evacuated from the deepest level of the Wildfire complex which contains the remainder of the team and their assistants. Andromeda is suspected to have eventually mutated into a benign form and migrated to the upper atmosphere, where the ": null
    },
    {
        "oxygen": "oxygen"
    },
    {
        " content is lower, better suiting its growth.     The novels epilogue reveals that a manned spacecraft, Andros V, was incinerated during atmospheric re-entry, presumably because Andromeda had eaten its tungsten/plastic laminate heat shield and caused it to burn up.       Dr. Jeremy Stone – Professor and chair of the bacteriology department at ": null
    },
    {
        "Stanford University": "stanford university"
    },
    {
        "; Stone is fictitiously the winner of the 42 ": null
    },
    {
        "Nobel Prize in Physiology or Medicine": "nobel prize in physiology or medicine"
    },
    {
        ", whereas the actual winner was ": null
    },
    {
        "Georg von Békésy": "georg von békésy"
    },
    {
        ". Nobel Laureate ": null
    },
    {
        "Joshua Lederberg": "joshua lederberg"
    },
    {
        " was convinced that Jeremy Stone was modeled strongly after himself, and wrote to Knopf Publishers to protest on June 42 42 See . In 42 the real Dr. ": null
    },
    {
        "Jeremy Stone": "jeremy stone"
    },
    {
        " expressed complete surprise that Crichton had named the lead character for him.   Dr. Charles Burton – Professor of pathology at the ": null
    },
    {
        "Baylor College of Medicine": "baylor college of medicine"
    },
    {
        " microbiologist": "microbiologist"
    },
    {
        "; suffers from ": null
    },
    {
        "epilepsy": "epilepsy"
    },
    {
        "  The IPCRESS File  by ": null
    },
    {
        "Len Deighton": "len deighton"
    },
    {
        " while studying in England. Crichton says he was terrifically impressed by the book - a lot of Andromeda is traceable to Ipcress in terms of trying to create an imaginary world using recogniseable techniques and real people. He wrote the novel over three years.       The Odd-Man Hypothesis is a fictional ": null
    },
    {
        "hypothesis": "hypothesis"
    },
    {
        " which states that unmarried men are better able to execute the best, most dispassionate decisions in crises—in this case, to disarm the nuclear weapon intended to prevent the escape of organisms from the laboratory in the event the auto-destruct sequence is initiated. In the novel, the Odd-Man explanation is a page in a ": null
    },
    {
        "RAND Corporation": "rand corporation"
    },
    {
        " report of the results of test series wherein different people were to make ": null
    },
    {
        "command decisions": "command responsibility"
    },
    {
        " in nuclear and biological wars and chemical crises.     Hall is briefed on the Hypothesis after his arrival at Wildfire. In the book, his copy of the briefing materials has the Hypothesis pages removed; in the film, he is criticized for failure to read the material ahead of time.     Dr. Hall is assumed to have the highest command decision effectiveness index among the Wildfire team; this is the reason why he is given a control key to the self-destruct mechanism. Hall initially derides this idea, saying he has no intention of committing suicide before he is told that it is his job to disarm the weapon, rather than to arm it: Stone then admits that the Odd-Man Hypothesis, while accurate , was essentially a ": null
    },
    {
        "false document": "false document"
    },
    {
        " used to justify handing over a nuclear weapon to private individuals and out of government control.       In 42 The Andromeda Strain was the basis for the ": null
    },
    {
        "film of the same name": "the andromeda strain"
    },
    {
        " directed by ": null
    },
    {
        "Robert Wise": "robert wise"
    },
    {
        ", and featuring ": null
    },
    {
        "Arthur Hill": "arthur hill"
    },
    {
        " as Stone, ": null
    },
    {
        "James Olson": "james olson"
    },
    {
        " as Hall, ": null
    },
    {
        "Kate Reid": "kate reid"
    },
    {
        " as Leavitt , and ": null
    },
    {
        "David Wayne": "david wayne"
    },
    {
        " as Dutton .     In 42 The Andromeda Strain was the basis for ": null
    },
    {
        "an eponymous miniseries": "the andromeda strain"
    },
    {
        " executive-produced by ": null
    },
    {
        "Ridley": "ridley scott"
    },
    {
        " and ": null
    },
    {
        "Tony Scott": "tony scott"
    },
    {
        " and ": null
    },
    {
        "Frank Darabont": "frank darabont"
    },
    {
        ", and featuring ": null
    },
    {
        "Benjamin Bratt": "benjamin bratt"
    },
    {
        " as Stone. Other characters names and personalities were radically changed from the novel.       ": null
    },
    {
        "Death metal": "death metal"
    },
    {
        " band ": null
    },
    {
        "Nocturnus": "nocturnus"
    },
    {
        " has a song called Andromeda Strain on their début album,  The Key  ": null
    },
    {
        "Progressive metal": "progressive metal"
    },
    {
        " band ": null
    },
    {
        "Shadow Gallery": "shadow gallery"
    },
    {
        " has a song titled The Andromeda Strain about genetically engineered ": null
    },
    {
        "biological weapons": "biological weapons"
    },
    {
        " on  Room V .   ": null
    },
    {
        "NWOBHM": "nwobhm"
    },
    {
        " band ": null
    },
    {
        "Angel Witch": "angel witch"
    },
    {
        " has a song titled Death From Andromeda about genetically engineered ": null
    },
    {
        "biological weapons": "biological weapons"
    },
    {
        " on  Angel of Light .       Reviews for The Andromeda Strain were overwhelmingly positive, and the novel was an American bestseller, establishing Michael Crichton as a respected novelist and science-fiction writer.    The Pittsburgh Press  said it was Relentlessly suspenseful... A hair-raising experience.    Detroit Free Press  called it Hideously plausible suspense... will glue you to your chair.    Library Journal  said The Andromeda Strain was One of the most important novels of the year .    The New York Times s Christopher Lehmann-Haupt said Tired out by a long day in the country, I was awake way past bedtime. My arms were numb from propping up my head. By turning from side to side, I had driven the cats from their place at the foot of the bed, and they were disgruntled. I was very likely disturbing my wifes sleep. But I was well into Michael Crichtons The Andromeda Strain. And he had me convinced it was all really happening. First Ballantine Books Edition: January 42         A sequel titled The Andromeda Evolution": null
    }
]