[
    {
        "              The Thing is a 42 American ": null
    },
    {
        "science fiction": "science fiction film"
    },
    {
        " horror film": "horror film"
    },
    {
        " directed by ": null
    },
    {
        "John Carpenter": "john carpenter"
    },
    {
        " and written by ": null
    },
    {
        "Bill Lancaster": "bill lancaster"
    },
    {
        ". Based on the 42 ": null
    },
    {
        "John W. Campbell Jr.": "john w. campbell jr."
    },
    {
        " novella  Who Goes There? , it tells the story of a group of American researchers in ": null
    },
    {
        "Antarctica": "antarctica"
    },
    {
        " who encounter the eponymous Thing , a ": null
    },
    {
        "parasitic": "parasitism"
    },
    {
        " extraterrestrial life-form that assimilates, then imitates other ": null
    },
    {
        "organism": "organism"
    },
    {
        "s. The group is overcome by paranoia and conflict as they learn that they can no longer trust each other and that any one of them could be the Thing. The film stars ": null
    },
    {
        "Kurt Russell": "kurt russell"
    },
    {
        " as the teams helicopter pilot, ": null
    },
    {
        "R.J. MacReady": "r.j. macready"
    },
    {
        ", and features ": null
    },
    {
        "A. Wilford Brimley": "wilford brimley"
    },
    {
        ", ": null
    },
    {
        "T. K. Carter": "t. k. carter"
    },
    {
        ", ": null
    },
    {
        "David Clennon": "david clennon"
    },
    {
        ", ": null
    },
    {
        "Keith David": "keith david"
    },
    {
        ", ": null
    },
    {
        "Richard Dysart": "richard dysart"
    },
    {
        ", ": null
    },
    {
        "Charles Hallahan": "charles hallahan"
    },
    {
        ", ": null
    },
    {
        "Peter Maloney": "peter maloney"
    },
    {
        ", ": null
    },
    {
        "Richard Masur": "richard masur"
    },
    {
        ", ": null
    },
    {
        "Donald Moffat": "donald moffat"
    },
    {
        ", ": null
    },
    {
        "Joel Polis": "joel polis"
    },
    {
        ", and ": null
    },
    {
        "Thomas G. Waites": "thomas g. waites"
    },
    {
        " in supporting roles.     Production began in the mid42s as a faithful adaptation of the novella, following 42s  The Thing from Another World . The Thing went through several directors and writers, each with different ideas on how to approach the story. Filming lasted roughly 42 weeks, beginning in August 42 and took place on refrigerated sets in Los Angeles as well as in ": null
    },
    {
        "Juneau, Alaska": "juneau, alaska"
    },
    {
        ", and ": null
    },
    {
        "Stewart, British Columbia": "stewart, british columbia"
    },
    {
        ". Of the films $42 million budget, $42 million was spent on ": null
    },
    {
        "Rob Bottin": "rob bottin"
    },
    {
        "s creature effects, a mixture of chemicals, food products, rubber, and mechanical parts turned by his large team into an alien capable of taking on any form.     The Thing was released in 42 to very negative reviews. It was described as instant junk , a wretched excess , and proposed as the most hated film of all time. Reviews both praised the special effects achievements and criticized their visual repulsiveness, while others focused on poor characterization. The film earned $42 million during its theatrical run. Many reasons have been cited for its failure to impress audiences: competition from films such as  E.T. the Extra-Terrestrial , which offered an optimistic take on alien visitation; a summer that had been filled with successful science fiction and fantasy films; and an audience, living through a recession, diametrically opposed to The Things ": null
    },
    {
        "nihilistic": "nihilism"
    },
    {
        " tone.     The film found an audience when released on home video and television. In the years since, it has been reappraised as one of the best science fiction and horror films ever made, and has gained a ": null
    },
    {
        "cult following": "cult following"
    },
    {
        ". Filmmakers have noted its influence on their work, and it has been referred to in other media such as television and video games. The Thing has spawned a variety of merchandise, including a 42 ": null
    },
    {
        "novelization": "novelization"
    },
    {
        ", ": null
    },
    {
        "haunted house attractions": "haunted attraction"
    },
    {
        ", board games, and sequels in comic books, ": null
    },
    {
        "a video game of the same name": "the thing"
    },
    {
        ", and a 42 prequel ": null
    },
    {
        "film of the same name": "the thing"
    },
    {
        ".             In Antarctica, a Norwegian helicopter pursues a ": null
    },
    {
        "sled dog": "sled dog"
    },
    {
        " to an American research station. The Americans witness the Norwegian passenger accidentally blow up the helicopter and himself. The Norwegian pilot fires a rifle and shouts at the Americans, but they cannot understand him and he is shot dead in self-defense by station commander Garry. The American helicopter pilot, ": null
    },
    {
        "R.J. MacReady": "r.j. macready"
    },
    {
        ", and Dr. Copper leave to investigate the Norwegian base. Among the charred ruins and frozen corpses, they find the burned remains of a malformed ": null
    },
    {
        "humanoid": "humanoid"
    },
    {
        " which they recover to the American station. Their biologist, Blair, performs autopsies on the remains and finds a normal set of human organs.     Clark kennels the sled dog, and it soon metamorphoses and absorbs the station dogs. This disturbance alerts the team and Childs uses a flamethrower to incinerate the creature. Blair autopsies the new creature and learns that it can perfectly imitate other organisms. Recovered Norwegian data leads the Americans to a large excavation site containing a partially buried alien spacecraft, and a smaller, human-sized dig site. Norris estimates that the alien ship has been buried for at least 42 years. Blair grows paranoid that the creature could assimilate all life on Earth in a matter of years. The station implements controls to reduce the risk of assimilation.     The dead, malformed humanoid creature assimilates an isolated Bennings, but Windows interrupts the process and MacReady burns the Bennings-Thing. Blair sabotages all the vehicles, kills the remaining sled dogs, and destroys the radio to prevent escape. The team imprisons him in a tool shed. Copper suggests a test to compare each members blood against uncontaminated blood held in storage, but after learning that the blood stores have been destroyed, the men lose faith in Garry, and MacReady takes command.     MacReady, Windows and Nauls find Fuchss burnt corpse and surmise he committed suicide to avoid assimilation. Windows returns to base while MacReady and Nauls investigate MacReadys shack. On their return, Nauls abandons MacReady in a snowstorm, believing he has been assimilated after finding his torn clothes in the shack. The team debate whether to allow MacReady inside, but he breaks in and holds the group at bay with dynamite. During the encounter, Norris appears to suffer a heart attack.     As Copper attempts to ": null
    },
    {
        "defibrillate": "defibrillation"
    },
    {
        " Norris, his chest transforms into a large mouth and bites off Coppers arms, killing him. MacReady incinerates the Norris-Thing, but its head detaches and attempts to escape before also being burnt. MacReady is forced to kill Clark in self-defense when the latter lunges at him from behind with a knife. He hypothesizes that the Norris-Things head demonstrated that every part of the Thing is an individual life form with its own survival instinct. He sequentially tests blood samples with a heated piece of wire. Everyone passes the test except Palmer, whose blood jumps from the heat. Palmer transforms and infects Windows, forcing MacReady to burn them both.     Childs is left on guard while the others go to test Blair. They find that Blair has escaped, and has been using vehicle components to assemble a small spacecraft. On their return, Childs is missing and the power generator is destroyed. MacReady speculates that the Thing intends to return to hibernation until a rescue team arrives. MacReady, Garry, and Nauls decide to detonate the entire station to destroy the Thing. As they set explosives, Blair kills Garry and Nauls disappears. Blair transforms into an enormous creature and destroys the detonator. MacReady triggers the explosives using a stick of dynamite, destroying the base.     MacReady sits nearby as the station burns. Childs returns, saying he became lost in the storm while pursuing Blair. Exhausted and slowly freezing to death, they acknowledge the futility of their distrust and share a bottle of scotch.             Development of the film began in the mid42s when producers David Foster and Lawrence Turman suggested an adaptation of the 42 ": null
    },
    {
        "John W. Campbell": "john w. campbell"
    },
    {
        " novella  Who Goes There?  to ": null
    },
    {
        "Universal Pictures": "universal pictures"
    },
    {
        ". It had been loosely adapted once before in ": null
    },
    {
        "Howard Hawks": "howard hawks"
    },
    {
        "s and ": null
    },
    {
        "Christian Nyby": "christian nyby"
    },
    {
        "s 42 film  The Thing from Another World , but Foster and Turman wanted to develop a project that stuck more closely to the source material. Screenwriters ": null
    },
    {
        "Hal Barwood": "hal barwood"
    },
    {
        " and ": null
    },
    {
        "Matthew Robbins": "matthew robbins"
    },
    {
        " held the rights to make an adaptation, but passed on the opportunity to make a new film, so Universal obtained the rights from them. In 42 ": null
    },
    {
        "Wilbur Stark": "wilbur stark"
    },
    {
        " had purchased the remake rights to 42 ": null
    },
    {
        "RKO Pictures": "rko pictures"
    },
    {
        " films, including The Thing from Another World, from three ": null
    },
    {
        "Wall Street": "wall street"
    },
    {
        " financiers who did not know what to do with them, in exchange for a return when the films were produced. Universal in turn acquired the rights to remake the film from Stark, resulting in him being given an executive producer credit on all print advertisements, posters, television commercials, and studio press material.     ": null
    },
    {
        "John Carpenter": "john carpenter"
    },
    {
        " was first approached about the project in 42 by co-producer and friend Stuart Cohen, but Carpenter was mainly an independent film director, so Universal chose  The Texas Chain Saw Massacre  director ": null
    },
    {
        "Tobe Hooper": "tobe hooper"
    },
    {
        " as they already had him under contract. The producers were ultimately unhappy with Hooper and his writing partner ": null
    },
    {
        "Kim Henkel": "kim henkel"
    },
    {
        "s concept. After several more failed ": null
    },
    {
        "pitches": "pitch"
    },
    {
        " by different writers, and attempts to bring on other directors, such as ": null
    },
    {
        "John Landis": "john landis"
    },
    {
        ", the project was put on hold. Even so, the success of ": null
    },
    {
        "Ridley Scott": "ridley scott"
    },
    {
        "s 42 science fiction horror film  Alien  helped revitalize the project, at which point Carpenter became loosely attached following his success with his influential ": null
    },
    {
        "slasher film": "slasher film"
    },
    {
        "  Halloween  .     Carpenter was reluctant to join the project as he thought Hawkss adaptation would be difficult to surpass, although he considered the films monster to be unnotable. Cohen suggested that he read the original novella. Carpenter found the creepiness of the imitations conducted by the creature, and the questions it raised, interesting. Carpenter drew parallels between the novella and ": null
    },
    {
        "Agatha Christie": "agatha christie"
    },
    {
        "s mystery novel  And Then There Were None  , and noted that the story of Who Goes There? was timely for him, meaning he could make it true to day as Hawks had in his time. Carpenter, a fan of Hawkss adaptation, paid homage to it in Halloween, and he watched The Thing from Another World several times for inspiration before filming began. Carpenter and cinematographer ": null
    },
    {
        "Dean Cundey": "dean cundey"
    },
    {
        " first worked together on Halloween, and The Thing was their first big-budget project for a ": null
    },
    {
        "major film studio": "major film studio"
    },
    {
        ".     After securing the writer and crew, the film was stalled again when Carpenter nearly quit, believing that a passion project of his,  El Diablo  , was on the verge of being made by ": null
    },
    {
        "EMI Films": "emi films"
    },
    {
        ". The producers discussed various replacements including ": null
    },
    {
        "Walter Hill": "walter hill"
    },
    {
        ", ": null
    },
    {
        "Sam Peckinpah": "sam peckinpah"
    },
    {
        " and ": null
    },
    {
        "Michael Ritchie": "michael ritchie"
    },
    {
        ", but the development of El Diablo was not as imminent as Carpenter believed, and he remained with The Thing.     Universal initially set a budget of $42 million, with $42 for creature effects, which at the time was more than the studio had ever allocated to a monster film. Filming was scheduled to be completed within 42 days. Universals production studios estimated that it would require at least $42 million before marketing and other costs, as the plan involved more set construction, including external sets and a large set piece for the original scripted death of Bennings, which was estimated to cost $42 million alone. As ": null
    },
    {
        "storyboard": "storyboard"
    },
    {
        "ing and designs were finalized, the crew estimated they would need at least $42 for creature effects, a figure Universal executives agreed to after seeing the number of workers employed under ": null
    },
    {
        "Rob Bottin": "rob bottin"
    },
    {
        ", the ": null
    },
    {
        "special make-up effects": "special make-up effects"
    },
    {
        " designer. Associate producer Larry Franco was responsible for making the budget work for the film; he cut the filming schedule by a third, eliminated the exterior sets for on-site shooting, and removed Benningss more extravagant death scene. Cohen suggested reusing the destroyed American camp as the ruined Norwegian camp, saving a further $42. When filming began in August, The Thing had a budget of $42 million, and indirect costs brought it to $42 million. The effects budget ran over, eventually totalling $42 million, forcing the elimination of some scenes, including Naulss confrontation of a creature dubbed the box Thing . By the end of production, Carpenter had to make a personal appeal to executive ": null
    },
    {
        "Ned Tanen": "ned tanen"
    },
    {
        " for $42 to complete a simplified version of the Blair-Thing. The final cost was $42 million, and overhead costs brought it to $42 million.          Several writers developed drafts for The Thing before Carpenter became involved, including  Logans Run  writer ": null
    },
    {
        "William F. Nolan": "william f. nolan"
    },
    {
        ", novelist ": null
    },
    {
        "David Wiltse": "david wiltse"
    },
    {
        ", and Hooper and Henkel, whose draft was set at least partially underwater, and which Cohen described as a  Moby-Dick -like story in which The Captain did battle with a large, non-shapeshifting creature. As Carpenter said in a 42 interview, they were just trying to make it work . The writers left before Carpenter joined the project. He said the scripts were awful, as they changed the story into something it was not, and ignored the chameleon-like aspect of the Thing. Carpenter did not want to write the project himself, after recently completing work on  Escape from New York  , and having struggled to complete a screenplay for  The Philadelphia Experiment  . He was wary of taking on writing duties, preferring to let someone else do it. Once Carpenter was confirmed as the director, several writers were asked to script The Thing, including ": null
    },
    {
        "Richard Matheson": "richard matheson"
    },
    {
        ", ": null
    },
    {
        "Nigel Kneale": "nigel kneale"
    },
    {
        ", and ": null
    },
    {
        "Deric Washburn": "deric washburn"
    },
    {
        ".     ": null
    },
    {
        "Bill Lancaster": "bill lancaster"
    },
    {
        " initially met with Turman, Foster and Cohen in 42 but he was given the impression that they wanted to closely replicate The Thing from Another World, and he did not want to remake the film. In August 42 Lancaster was contacted again. By this time he had read the original Who Goes There? novella, and Carpenter had become involved in the project. Lancaster was hired to write the script after describing his vision for the film, and his intention to stick closely to the original story, to Carpenter, who was a fan of Lancasters work on  The Bad News Bears  . Lancaster conceived several key scenes in the film, including the Norris-Thing biting Dr. Copper, and the use of blood tests to identify the Thing, which Carpenter cited as the reason he wanted to work on the film. Lancaster said he found some difficulty in translating Who Goes There? to film, as it features very little action. He also made some significant changes to the story, such as reducing the number of characters from 42 to 42 Lancaster said that 42 was excessive and would be difficult for audiences to follow, leaving little screen time for characterization. He also opted to alter the storys structure, choosing to open his ": null
    },
    {
        "in the middle of the action": "in medias res"
    },
    {
        ", instead of using a ": null
    },
    {
        "flashback": "flashback"
    },
    {
        " as in the novella. Several characters were modernized for contemporary audiences; MacReady, originally a meteorologist, became a tough loner described in the script as 42 Helicopter pilot. Likes chess. Hates the cold. The pay is good. Lancaster aimed to create an ensemble piece where one person emerged as the hero, instead of having a ": null
    },
    {
        "Doc Savage": "doc savage"
    },
    {
        "-type hero from the start.     Lancaster wrote approximately 42 to 42 pages, but eventually struggled writing the films second act and it took him several months to complete the script. After it was finished, Lancaster and Carpenter spent a weekend in Northern California refining the script, each having different takes on how a character should sound, and comparing their ideas for scenes. Lancasters script opted to keep the creature largely concealed throughout the film, and it was Bottin who convinced Carpenter to make it more visible to have a greater impact on the audience. Lancasters original ending had both MacReady and Childs turn into the Thing. In the spring, the characters are rescued by helicopter, greeting their saviors with Hey, which way to a hot meal? Carpenter thought this ending was too shallow. In total, Lancaster completed four drafts of the screenplay. The novella concludes with the humans clearly victorious, but concerned that birds they see flying toward the mainland may have been infected by the Thing. Carpenter opted to end the film with the survivors slowly freezing to death to save humanity from infection, believing this to be the ultimate heroic act. Lancaster wrote this ending, which eschews a  The Twilight Zone -style twist or the destruction of the monster, as he wanted to instead have an ambiguous moment between the pair, of trust and mistrust, fear and relief.            ": null
    },
    {
        "Kurt Russell": "kurt russell"
    },
    {
        " was involved in the production before being cast, helping Carpenter develop his ideas. Russell was the last actor to be cast, in June 42 by which point ": null
    },
    {
        "second unit": "second unit"
    },
    {
        " filming was starting in ": null
    },
    {
        "Juneau, Alaska": "juneau, alaska"
    },
    {
        ". Carpenter had worked with Russell twice before, but wanted to keep his options open. Discussions with the studio involved using actors ": null
    },
    {
        "Christopher Walken": "christopher walken"
    },
    {
        ", ": null
    },
    {
        "Jeff Bridges": "jeff bridges"
    },
    {
        ", or ": null
    },
    {
        "Nick Nolte": "nick nolte"
    },
    {
        ", who were either unavailable or declined, and ": null
    },
    {
        "Sam Shepard": "sam shepard"
    },
    {
        ", who showed interest but was never pursued. ": null
    },
    {
        "Tom Atkins": "tom atkins"
    },
    {
        " and ": null
    },
    {
        "Jack Thompson": "jack thompson"
    },
    {
        " were strong early and late contenders for the role of MacReady, but the decision was made to go with Russell. In part, Carpenter cited the practicality of choosing someone he had found reliable before, and who would not balk at the difficult filming conditions. It took Russell about a year to grow his hair and beard out for the role. At various points, the producers met with ": null
    },
    {
        "Brian Dennehy": "brian dennehy"
    },
    {
        ", ": null
    },
    {
        "Kris Kristofferson": "kris kristofferson"
    },
    {
        ", ": null
    },
    {
        "John Heard": "john heard"
    },
    {
        ", ": null
    },
    {
        "Ed Harris": "ed harris"
    },
    {
        ", ": null
    },
    {
        "Tom Berenger": "tom berenger"
    },
    {
        ", Jack Thompson, ": null
    },
    {
        "Scott Glenn": "scott glenn"
    },
    {
        ", ": null
    },
    {
        "Fred Ward": "fred ward"
    },
    {
        ", ": null
    },
    {
        "Peter Coyote": "peter coyote"
    },
    {
        ", Tom Atkins, and ": null
    },
    {
        "Tim McIntire": "tim mcintire"
    },
    {
        ". Some passed on the idea of starring in a monster film, while Dennehy became the choice to play Copper. Each actor was to be paid $42, but after the more-established Russell was cast, his salary increased to $42.     ": null
    },
    {
        "Geoffrey Holder": "geoffrey holder"
    },
    {
        ", ": null
    },
    {
        "Carl Weathers": "carl weathers"
    },
    {
        ", and ": null
    },
    {
        "Bernie Casey": "bernie casey"
    },
    {
        " were considered for the role of Childs, and Carpenter also looked at ": null
    },
    {
        "Isaac Hayes": "isaac hayes"
    },
    {
        ", having worked with him on Escape from New York. ": null
    },
    {
        "Ernie Hudson": "ernie hudson"
    },
    {
        " was the front-runner and was almost cast until they met with ": null
    },
    {
        "Keith David": "keith david"
    },
    {
        ". The Thing was Davids first significant film role, and coming from a theater background, he had to learn on set how to hold himself back and not show every emotion his character was feeling, with guidance from ": null
    },
    {
        "Richard Masur": "richard masur"
    },
    {
        " and ": null
    },
    {
        "Donald Moffat": "donald moffat"
    },
    {
        " in particular. Masur and David discussed their characters in rehearsals and decided that they would not like each other. For Blair, the team chose the then-unknown ": null
    },
    {
        "Wilford Brimley": "wilford brimley"
    },
    {
        ", as they wanted an ": null
    },
    {
        "everyman": "everyman"
    },
    {
        " whose absence would not be questioned by the audience until the appropriate time. The intent with the character was to have him become infected early on off-screen, so that his status would be unknown to the audience, concealing his intentions. Carpenter wanted to cast ": null
    },
    {
        "Donald Pleasence": "donald pleasence"
    },
    {
        ", but it was decided that he was too recognizable to accommodate the role. ": null
    },
    {
        "T. K. Carter": "t. k. carter"
    },
    {
        " was cast as Nauls, but comedian ": null
    },
    {
        "Franklyn Ajaye": "franklyn ajaye"
    },
    {
        " also came in to read for the role. Instead, he delivered a lengthy speech about the character being a stereotype, after which the meeting ended.        Bottin lobbied hard to play Palmer, but it was deemed impossible for him to do so alongside his existing duties. As the character has some comedic moments, Universal brought in comedians ": null
    },
    {
        "Jay Leno": "jay leno"
    },
    {
        ", ": null
    },
    {
        "Garry Shandling": "garry shandling"
    },
    {
        ", and ": null
    },
    {
        "Charles Fleischer": "charles fleischer"
    },
    {
        ", among others, but opted to go with actor ": null
    },
    {
        "David Clennon": "david clennon"
    },
    {
        ", who was better suited to play the dramatic elements. Clennon had read for the Bennings character, but he preferred the option of playing Palmers blue-collar stoner to a white collar science man . ": null
    },
    {
        "Powers Boothe": "powers boothe"
    },
    {
        ", ": null
    },
    {
        "Lee Van Cleef": "lee van cleef"
    },
    {
        ", ": null
    },
    {
        "Jerry Orbach": "jerry orbach"
    },
    {
        ", and ": null
    },
    {
        "Kevin Conway": "kevin conway"
    },
    {
        " were considered for the role of Garry, and ": null
    },
    {
        "Richard Mulligan": "richard mulligan"
    },
    {
        " was also considered when the production experimented with the idea of making the character closer to MacReady in age. Masur also read for Garry, but he asked to play Clark instead, as he liked the characters dialogue and was also a fan of dogs. Masur worked daily with the ": null
    },
    {
        "wolfdog": "wolfdog"
    },
    {
        " Jed": "jed"
    },
    {
        " and his handler, Clint Rowe, during rehearsals, as Rowe was familiarizing Jed with the sounds and smells of people. This helped Masurs and Jeds performance on-screen, as the dog would stand next to him without looking for his handler. Masur described his character as one uninterested in people, but who loves working with dogs. He went to a survivalist store and bought a flip knife for his character, and used it in a confrontation with Davids character. Masur turned down a role in  E.T. the Extra-Terrestrial  to play Clark. ": null
    },
    {
        "William Daniels": "william daniels"
    },
    {
        " and Dennehy were both interested in playing Dr. Copper, and it was a last-second decision by Carpenter to go with ": null
    },
    {
        "Richard Dysart": "richard dysart"
    },
    {
        ".     In early drafts, Windows was called Sanchez, and later Sanders. The name Windows came when the actor for the role, ": null
    },
    {
        "Thomas Waites": "thomas g. waites"
    },
    {
        ", was in a costume fitting and tried on a large pair of dark glasses, which the character wears in the film. ": null
    },
    {
        "Norbert Weisser": "norbert weisser"
    },
    {
        " portrays one of the Norwegians, and Jed appears uncredited as the Dog-Thing. The only female presence in the film is the voice of MacReadys chess computer, voiced by Carpenters then-wife ": null
    },
    {
        "Adrienne Barbeau": "adrienne barbeau"
    },
    {
        ". Russell described the all-male story as interesting, since the men had no one to posture for without women. Foster, Franco, and Lancaster, along with other members of the crew, make a ": null
    },
    {
        "cameo appearance": "cameo appearance"
    },
    {
        " in a recovered photograph of the Norwegian team. Camera operator Ray Stella stood in for the shots where needles were used to take blood, telling Carpenter that he could do it all day. Franco also played the Norwegian wielding a rifle and hanging out of the helicopter during the opening sequence. Anita Dann served as casting director.       The Thing was storyboarded extensively by ": null
    },
    {
        "Mike Ploog": "mike ploog"
    },
    {
        " and ": null
    },
    {
        "Mentor Huebner": "mentor huebner"
    },
    {
        " before filming began. Their work was so detailed that many of the films shots replicate the image layout completely. Cundey pushed for the use of ": null
    },
    {
        "anamorphic format": "anamorphic format"
    },
    {
        " aspect ratio, believing that it allowed for placing several actors in an environment, and making use of the scenic vistas available, while still creating a sense of confinement within the image. It also enabled the use of ": null
    },
    {
        "negative space": "negative space"
    },
    {
        " around the actors to imply something may be lurking just off-screen.        ": null
    },
    {
        "Principal photography": "principal photography"
    },
    {
        " began on August 42 42 in Juneau, Alaska. Filming lasted approximately 42 weeks. Carpenter insisted on two weeks of rehearsals before filming as he wanted to see how scenes would play out. This was unusual at the time because of the expense involved. Filming then moved to the ": null
    },
    {
        "Universal lot": "universal studios lot"
    },
    {
        ", where the outside heat was over . The internal sets were climate-controlled to  to facilitate their work. The team considered building the sets inside an existing refrigerated structure, but were unable to find one large enough. Instead they collected as many portable air conditioners as they could, closed off the stage, and used ": null
    },
    {
        "humidifier": "humidifier"
    },
    {
        "s and ": null
    },
    {
        "misters": "spray bottle"
    },
    {
        " to add moisture to the air. After watching a roughly assembled cut of filming to date, Carpenter was unhappy that the film seemed to feature too many scenes of men standing around talking. He rewrote some already completed scenes to take place outdoors to be shot on location when principal photography moved to ": null
    },
    {
        "Stewart, British Columbia": "stewart, british columbia"
    },
    {
        ".     Carpenter was determined to use authentic locations instead of studio sets, and his successes on Halloween and  The Fog  gave him the credibility to take on the much bigger-budget production of The Thing. A film scout located an area just outside Stewart, along the Canadian coast, which offered the project both ease of access and scenic value during the day. On December 42 42 roughly 42 American and Canadian crew members moved to the area to begin filming. During the journey there, the crew bus slid in the snow toward the unprotected edge of the road, nearly sending it down a  embankment. Some of the crew stayed in the small mining town during filming, while others lived on residential barges on the ": null
    },
    {
        "Portland Canal": "portland canal"
    },
    {
        ". They would make the  drive up a small, winding road to the filming location in Alaska where the exterior outpost sets were built.     The sets had been built in Alaska during the summer, atop a rocky area overlooking a glacier, in preparation for snow to fall and cover them. They were used for both interior and exterior filming, meaning they could not be heated above freezing inside to ensure there was always snow on the roof. Outside, the temperature was so low that the camera lenses would freeze and break. The crew had to leave the cameras in the freezing temperatures, as keeping them inside in the warmth resulted in foggy lenses that took hours to clear. Filming, greatly dependent on the weather, took three weeks to complete, with heavy snow making it impossible to film on some days. It took eight hours to rig the explosives necessary to destroy the set in the films finale.     Keith David broke his hand in a car accident the day before he was to begin shooting. David attended filming the next day, but when Carpenter and Franco saw his swollen hand, they sent him to the hospital where it was punctured with two pins. He returned wearing a surgical glove beneath a black glove that was painted to resemble his complexion. His left hand is not seen for the first half of the film. Carpenter filmed the Norwegian camp scenes after the end scenes, using the damaged American base as a stand-in for the charred Norwegian camp. The explosive destruction of the base required the camera assistants to stand inside the set with the explosives, which were activated remotely. The assistants then had to run to a safe distance while seven cameras captured the bases destruction. Filmed when the heavy use of ": null
    },
    {
        "special effect": "special effect"
    },
    {
        "s was rare, the actors had to adapt to having Carpenter describe to them what their characters were looking at, as the effects would not be added until post-production. There were some puppets used to create the impression of what was happening in the scene, but in other cases the cast would be looking at a wall or an object marked with an X.     Art director ": null
    },
    {
        "John J. Lloyd": "john j. lloyd"
    },
    {
        " oversaw the design and construction of all the sets, as there were no existing locations used in the film. Cundey suggested that the sets should have ceilings and pipes seen on camera to make the spaces seem more claustrophobic.       Several scenes in the script were omitted from the film, sometimes because there was too much dialogue that slowed the pace and undermined the suspense. Carpenter blamed some of the issues on his directorial method, noting that several scenes appeared to be repeating events or information. Another scene featuring a snowmobile chase pursuing dogs was removed from the shooting script as it would have been too expensive to film. One scene present in the film, but not the script, features a monologue by MacReady. Carpenter added this partly to establish what was happening in the story, and because he wanted to highlight Russells heroic character after taking over the camp. Carpenter said that Lancasters experience writing ensemble pieces did not emphasize single characters. Since Halloween, several horror films had replicated many of the scare elements of that film, something Carpenter wanted to move away from for The Thing. He removed scenes from Lancasters script that had been filmed, such as a body suddenly falling into view at the Norwegian camp, which he felt were too clichéd. Approximately three minutes of scenes were filmed from Lancasters script that elaborated on the characters backgrounds.     A scene with MacReady absentmindedly inflating a ": null
    },
    {
        "blow-up doll": "sex doll"
    },
    {
        " while watching the Norwegian tapes was filmed but was not in the finished film. The doll would later appear as a ": null
    },
    {
        "jump scare": "jump scare"
    },
    {
        " with Nauls. Other scenes featured expanded or alternate deaths for various characters. In the finished film, Fuchss charred bones are discovered, revealing he has died off  -screen, but an alternate take sees his corpse impaled on a wall with a shovel. Nauls was scripted to appear in the finale as a partly assimilated mass of tentacles, but in the film he simply disappears. Carpenter struggled with a method of conveying to the audience what assimilation by the creature actually meant. Lancasters original set piece of Benningss death had him pulled beneath a sheet of ice by the Thing, before resurfacing in different areas in various stages of assimilation. The scene called for a set to be built on one of Universals largest stages, with sophisticated hydraulics, dogs, and flamethrowers, but it was deemed too costly to produce. A scene was filmed with Bennings being murdered by an unknown assailant, but it was felt that assimilation, leading to his death, was not explained enough. Short on time, and with no interior sets remaining, a small set was built, Maloney was covered with ": null
    },
    {
        "K-Y Jelly": "k-y jelly"
    },
    {
        ", orange dye, and rubber tentacles. Monster gloves for a different creature were repurposed to demonstrate partial assimilation.     Carpenter filmed multiple endings for The Thing, including a happier ending because editor Todd Ramsay thought that the bleak, ": null
    },
    {
        "nihilistic": "nihilism"
    },
    {
        " conclusion would not test well with audiences. In the alternate take, MacReady is rescued and given a blood test that proves he is not infected. Carpenter said that stylistically this ending would have been cheesy . Editor ": null
    },
    {
        "Verna Fields": "verna fields"
    },
    {
        " was tasked with reworking the ending to add clarity and resolution. It was finally decided to create an entirely new scene, which omitted the suspicion of Childs being infected by removing him completely, leaving MacReady alone. This new ending tested only slightly better with audiences than the original, and the production team agreed to the studios request to use it. It was set to go to print for theaters when the producers, Carpenter, and executive Helena Hacker decided that the film was better left with ambiguity instead of nothing at all. Carpenter gave his approval to restore the ambiguous ending, but a scream was inserted over the outpost explosion to posit the monsters death. Universal executive ": null
    },
    {
        "Sidney Sheinberg": "sidney sheinberg"
    },
    {
        " disliked the endings nihilism and, according to Carpenter, said, Think about how the audience will react if we see the die with a giant orchestra playing . Carpenter later noted that both the original ending and the ending without Childs tested poorly with audiences, which he interpreted as the film simply not being heroic enough.          ": null
    },
    {
        "Ennio Morricone": "ennio morricone"
    },
    {
        " composed the films score, as Carpenter wanted The Thing to have a European musical approach. Carpenter flew to Rome to speak with Morricone to convince him to take the job. By the time Morricone flew to Los Angeles to record the score, he had already developed a tape filled with an array of synthesizer music because he was unsure what type of score Carpenter wanted. Morricone wrote complete separate orchestral and synthesizer scores and a combined score, which he knew was Carpenters preference. Carpenter picked a piece, closely resembling his own scores, that became the main theme used throughout the film. He also played the score from Escape from New York for Morricone as an example. Morricone made several more attempts, bringing the score closer to Carpenters own style of music. In total, Morricone produced a score of approximately one hour that remained largely unused, but was later released as part of the films soundtrack. Carpenter and his longtime collaborator ": null
    },
    {
        "Alan Howarth": "alan howarth"
    },
    {
        " separately developed some synth-styled pieces used in the film. In 42 Morricone recalled:     Ive asked as he was preparing some electronic music with an assistant to edit on the film, Why did you call me, if you want to do it on your own? He surprised me, he said – I got married to your music. This is why Ive called you. ... Then when he showed me the film, later when I wrote the music, we didnt exchange ideas. He ran away, nearly ashamed of showing it to me. I wrote the music on my own without his advice. Naturally, as I had become quite clever since 42 Ive written several scores relating to my life. And I had written one, which was electronic music. And took the electronic score.     Carpenter said:     did all the orchestrations and recorded for me 42 minutes of music I could use wherever I wished but without seeing any footage. I cut his music into the film and realized that there were places, mostly scenes of tension, in which his music would not work... I secretly ran off and recorded in a couple of days a few pieces to use. My pieces were very simple electronic pieces – it was almost tones. It was not really music at all but just background sounds, something today you might even consider as sound effects.         The Things special effects were largely designed by Bottin, who had previously worked with Carpenter on The Fog . When Bottin joined the project in mid42 pre-production was in progress, but no design had been settled on for the alien. Artist Dale Kuipers had created some preliminary paintings of the creatures look, but he left the project after being hospitalized following a traffic accident before he could develop them further with Bottin. Carpenter conceived the Thing as a single creature, but Bottin suggested that it should be constantly changing and able to look like anything. Carpenter initially considered Bottins description of his ideas as too weird, and had him work with Ploog to sketch them instead. As part of the Things design, it was agreed anyone assimilated by it would be a perfect imitation and would not know they were the Thing. The actors spent hours during rehearsals discussing whether they would know they were the Thing when taken over. Clennon said that it did not matter, because everyone acted, looked and smelled exactly the same before being taken over. At its peak, Bottin had a 42-person crew of artists and technicians, and he found it difficult to work with so many people. To help manage the team, he hired Erik Jensen, a special effects line producer who he had worked with on  The Howling  , to be in charge of the special make-up effects unit. Bottins crew also included mechanical aspect supervisor Dave Kelsey, make-up aspect coordinator Ken Diaz, ": null
    },
    {
        "moldmaker": "moldmaker"
    },
    {
        " Gunnar Ferdinansen, and Bottins longtime friend Margaret Beserra, who managed painting and hair work.        In designing the Things different forms, Bottin explained that the creature had been all over the galaxy. This allowed it to call on different attributes as necessary, such as stomachs that transform into giant mouths and spider legs sprouting from heads. Bottin said the pressure he experienced caused him to dream about working on designs, some of which he would take note of after waking. One abandoned idea included a series of dead baby monsters, which was deemed too gross . Bottin admitted he had no idea how his designs would be implemented practically, but Carpenter did not reject them. Carpenter said, what I didnt want to end up with in this movie was a guy in a suit ... I grew up as a kid watching science-fiction monster movies, and it was always a guy in a suit.  According to Cundey, Bottin was very sensitive about his designs, and worried about the film showing too many of them. At one point, as a preemptive move against any censorship, Bottin suggested making the creatures violent transformations and the appearance of the internal organs more fantastical using colors. The decision was made to tone down the color of the blood and viscera, although much of the filming had been completed by that point. The creature effects used a variety of materials including mayonnaise, creamed corn, microwaved bubble gum, and K-Y Jelly.     During filming, then42-year-old Bottin was hospitalized for exhaustion, ": null
    },
    {
        "double pneumonia": "double pneumonia"
    },
    {
        ", and a bleeding ulcer, caused by his extensive workload. Bottin himself explained he would hoard the work, opting to be directly involved in many of the complicated tasks. His dedication to the project saw him spend over a year living on the Universal lot. Bottin said he did not take a day off during that time, and slept on the sets or in locker rooms. To take some pressure off his crew, Bottin enlisted the aid of special effects creator ": null
    },
    {
        "Stan Winston": "stan winston"
    },
    {
        " to complete some of the designs, primarily the Dog-Thing. With insufficient time to create a sophisticated mechanical creature, Winston opted to create a ": null
    },
    {
        "hand puppet": "hand puppet"
    },
    {
        ". A cast was made of makeup artist ": null
    },
    {
        "Lance Anderson": "lance anderson"
    },
    {
        "s arm and head, around which the Dog-Thing was sculpted in oil-based clay. The final foam-latex puppet, worn by Anderson, featured radio-controlled eyes and cable-controlled legs, and was operated from below a raised set on which the kennel was built. Slime from the puppet would leak onto Anderson during the two days it took to film the scene, and he had to wear a helmet to protect himself from the ": null
    },
    {
        "explosive squibs": "squib"
    },
    {
        " simulating gunfire. Anderson pulled the tentacles into the Dog-Thing and ": null
    },
    {
        "reverse motion": "reverse motion"
    },
    {
        " was used to create the effect of them slithering from its body. Winston refused to be credited for his work, insisting that Bottin deserved sole credit; Winston was given a thank you in the credits instead.        In the chest chomp scene, Dr. Copper attempts to revive Norris with a defibrillator. Revealing himself as the Thing, Norris-Things chest transforms into a large mouth that severs Coppers arms. Bottin accomplished this scene by recruiting a double amputee and fitting him with prosthetic arms filled with wax bones, rubber veins and Jell-O. The arms were then placed into the practical stomach mouth where the mechanical jaws clamped down on them, at which point the actor pulled away, severing the false arms. The effect of the Norris-Things head detaching from the body to save itself took many months of testing before Bottin was satisfied enough to film it. The scene involved a fire effect, but the crew were unaware that fumes from the rubber foam chemicals inside the puppet were flammable. The fire ignited the fumes, creating a large fireball that engulfed the puppet. It suffered only minimal damage after the fire had been put out, and the crew successfully filmed the scene. ": null
    },
    {
        "Stop-motion": "stop-motion"
    },
    {
        " expert ": null
    },
    {
        "Randall William Cook": "randall william cook"
    },
    {
        " developed a sequence for the end of the film where MacReady is confronted by the gigantic Blair-Thing. Cook created a miniature model of the set and filmed wide-angle shots of the monster in stop motion, but Carpenter was not convinced by the effect and used only a few seconds of it. It took 42 people to operate the actual Blair-Thing puppet.     The production intended to use a camera centrifuge—a rotating drum with a fixed camera platform—for the Palmer-Thing scene, allowing him to seem to run straight up the wall and across the ceiling. Again, the cost was too high and the idea abandoned for a stuntman falling into frame onto a floor made to look like the outposts ceiling. Stuntman Anthony Cecere stood in for the Palmer-Thing after MacReady sets it on fire and it crashes through the outpost wall.       Cundey worked with Bottin to determine the appropriate lighting for each creature. He wanted to show off Bottins work because of its detailing, but he was conscious that showing too much would reveal its artificial nature, breaking the illusion. Each encounter with the creature was planned for areas where they could justify using a series of small lights to highlight the particular creature-models surface and textures. Cundey would illuminate the area behind the creature to detail its overall shape. He worked with ": null
    },
    {
        "Panasonic": "panasonic"
    },
    {
        " and a few other companies to develop a camera capable of automatically adjusting light exposure at different film speeds. He wanted to try filming the creature at fast and slow speeds thinking this would create a more interesting visual effect, but they were unable to accomplish this at the time. For the rest of the set, Cundey created a contrast by lighting the interiors with warmer lights hung overhead in conical shades so that they could still control the lighting and have darkened areas on set. The outside was constantly bathed in a cold, blue light that Cundey had discovered being used on airport runways. The reflective surface of the snow and the blue light helped create the impression of coldness. The team also made use of the flamethrowers and magenta-hued flares used by the actors to create dynamic lighting.     The team originally wanted to shoot the film in ": null
    },
    {
        "black and white": "black and white"
    },
    {
        ", but Universal was reluctant as it could affect their ability to sell the television rights for the film. Instead, Cundey suggested muting the colors as much as possible. The inside of the sets was painted in neutral colors such as gray, and many of the props were also painted gray, while the costumes were a mix of somber browns, blues, and grays. They relied on the lighting to add color. ": null
    },
    {
        "Albert Whitlock": "albert whitlock"
    },
    {
        " provided ": null
    },
    {
        "matte": "matte"
    },
    {
        "-painted backdrops, including the scene in which the Americans discover the giant alien spaceship buried in the ice. A scene where MacReady walks up to a hole in the ice where the alien had been buried was filmed at Universal, while the surrounding area including the alien spaceship, helicopter, and snow were all painted.     Carpenters friend John Wash, who developed the opening computer simulation for Escape from New York, designed the computer program showing how the Thing assimilates other organisms. Model maker Susan Turner built the alien ship approaching Earth in the pre-credits sequence, which featured 42 ": null
    },
    {
        "strobing lights": "strobe light"
    },
    {
        ". ": null
    },
    {
        "Drew Struzan": "drew struzan"
    },
    {
        " designed the films poster. He completed it in 42 hours, based only on a briefing, knowing little about the film.          The lack of information about the films special effects drew the attention of film exhibitors in early 42 They wanted reassurance that The Thing was a first-rate production capable of attracting audiences. Cohen and Foster, with a specially employed editor and Universals archive of music, put together a 42-minute ": null
    },
    {
        "showreel": "showreel"
    },
    {
        " emphasizing action and suspense. They used available footage, including alternate and extended scenes not in the finished film, but avoided revealing the special effects as much as possible. The reaction from the exclusively male exhibitors was generally positive, and Universal executive ": null
    },
    {
        "Robert Rehme": "robert rehme"
    },
    {
        " told Cohen that the studio was counting on The Things success, as they expected E.T. the Extra-Terrestrial to appeal only to children. While finalizing the film, Universal sent Carpenter a demographic study showing that the audience appeal of horror films had declined by 42% over the previous six months. Carpenter considered this a suggestion that he lower his expectations of the films performance. After one market research screening, Carpenter queried the audience on their thoughts, and one audience member asked, Well what happened in the very end? Which one was the Thing...? When Carpenter responded that it was up to their imagination, the audience member responded, Oh, God. I hate that.      After returning from a screening of E.T. the Extra-Terrestrial, the audiences silence at a The Thing trailer caused Foster to remark, Were dead . The response to public pre-screenings of The Thing resulted in the studio changing the somber, black-and-white advertising approved by the producers to a color image of a person with a glowing face. The tagline was also changed from Man is the warmest place to hide —written by Stephen Frankfort, who wrote the Alien tagline, In space, no one can hear you scream —to The ultimate in alien terror, trying to capitalize on Aliens audience. Carpenter attempted to make a last-minute change of the films title to Who Goes There?, to no avail. The week before its release, Carpenter promoted the film with clips on  Late Night with David Letterman . In 42 horror magazine  Fangoria  held a contest encouraging readers to submit drawings of what the Thing would look like. Winners were rewarded with a trip to Universal Studios. On its opening day, a special screening was held at the ": null
    },
    {
        "Hollywood Pacific Theatre": "hollywood pacific theatre"
    },
    {
        ", presided over by ": null
    },
    {
        "Elvira, Mistress of the Dark": "cassandra peterson"
    },
    {
        ", with free admission for those in costume as monsters.       The Thing was released in the United States on June 42 42 During its opening weekend, the film earned $42 million from 42 theaters—an average of $42 per theater—finishing as the number eight film of the weekend behind supernatural horror  Poltergeist  , which was in its fourth weekend of release, and ahead of action film  Megaforce  . It dropped out of the top 42 grossing films after three weeks. It ended its run earning a total of $42 million against its $42 million budget, making it only the 42nd highest-grossing film of 42 It was not a ": null
    },
    {
        "box office failure": "box office bomb"
    },
    {
        ", nor was it a hit.     Since its release, cultural historians and critics have attempted to understand what led to The Things initial failure to connect with audiences. In a 42 interview, Carpenter said audiences rejected The Thing for its nihilistic, depressing viewpoint at a time when the United States was in the midst of a recession. When it opened, it was competing against the critically and commercially successful E.T. the Extra-Terrestrial , a more family-friendly film released two weeks earlier that offered a more optimistic take on alien visitation. Carpenter described it as the complete opposite of his film. The Thing opened on the same day as the ": null
    },
    {
        "science fiction film": "science fiction film"
    },
    {
        "  Blade Runner , which debuted as the number two film that weekend with a take of $42 million and went on to earn $42 million. It was also regarded as a critical and commercial failure at the time. Others blamed an oversaturation of science fiction and fantasy films released that year, including  Conan the Barbarian  , Poltergeist ,  The Road Warrior  ,  Star Trek II: The Wrath of Khan  , and  Tron  . Some analysts blamed Universals poor marketing, which did not compete with the deluge of promotion for prominent films released that summer.     Another factor was the ": null
    },
    {
        "R rating": "motion picture association of america film rating system"
    },
    {
        " it was given, restricting the audience to those over the age of 42 unless accompanied by an adult. Poltergeist received a PG rating, allowing families and younger children to view it.          The film received negative reviews on its release, and hostility for its cynical, anti-authoritarian tone and graphic special effects.  Cinefantastique  printed an issue with The Thing on its cover asking, Is this the most hated movie of all time?  Some reviewers were dismissive of the film, calling it the quintessential moron movie of the 42s, instant junk,  and a wretched excess .  Starlog s Alan Spencer called it a cold and sterile horror movie attempting to cash in on the genre audience, against the optimism of E.T., the reassuring return of Star Trek II, the technical perfection of Tron, and the sheer integrity of Blade Runner .     The plot was criticized as boring,  and undermined by the special effects. The  Los Angeles Times s Linda Gross said that The Thing was bereft, despairing, and nihilistic, and lacking in feeling, meaning the characters deaths did not matter. Spencer said it featured sloppy continuity, lacked pacing, and was devoid of warmth or humanity. David Ansen of  Newsweek  felt the film confused the use of effects with creating suspense, and that it lacked drama by sacrificing everything at the altar of gore . The  Chicago Reader s Dave Kehr considered the dialogue to be banal and interchangeable, making the characters seem and sound alike.  The Washington Post s Gary Arnold said it was a witty touch to open with the Thing having already overcome the Norwegian base, defeating the type of traps seen in the 42 version, while  New York s ": null
    },
    {
        "David Denby": "david denby"
    },
    {
        " lamented that the Things threat is only shown externally, without focusing on what it is like for someone who thinks they have been taken over. ": null
    },
    {
        "Roger Ebert": "roger ebert"
    },
    {
        " considered the film to be scary, but offering nothing original beyond the special effects, while  The New York Times s ": null
    },
    {
        "Vincent Canby": "vincent canby"
    },
    {
        " said it was entertaining only if the viewer needed to see spider-legged heads and dog autopsies.     Reviews of the actors performances were generally positive, while criticizing the depictions of the characters they portrayed. Ebert said they lacked characterization, offering basic stereotypes that existed just to be killed, and Spencer called the characters bland even though the actors do the best they can with the material.  Time s ": null
    },
    {
        "Richard Schickel": "richard schickel"
    },
    {
        " singled Russell out as the stalwart hero, where other characters were not as strongly or wittily characterized, and  Variety  said that Russells heroic status was undercut by the suicidal attitude adopted toward the films finale. Other reviews criticized implausibilities such as characters wandering off alone. Kehr did not like that the men did not band together against the Thing, and several reviews noted a lack of camaraderie and romance, which Arnold said reduced any interest beyond the special effects.     The films special effects were simultaneously lauded and lambasted for being technically brilliant but visually repulsive and excessive. Reviews called Bottins work genius,  noting the designs were novel, unforgettable, colorfully horrific, and called him a master of the macabre . Arnold said that the chest chomp scene demonstrated appalling creativity and the subsequent severed head scene was madly macabre, comparing them to Aliens chest burster and severed head scenes. Variety called it the most vividly gruesome horror film to ever stalk the screens . Conversely, Denby called them more disgusting than frightening, and lamented that the trend of horror films to open the human body more and more bordered on obscenity, Spencer said that Bottins care and pride in his craft was shown in the effects, but both they and Schickel found them to be overwhelming and squandered without strong characters and story Even so, Canby said that the effects were too phony looking to be disgusting . Canby and Arnold said the creatures lack of a single, discernible shape was to its detriment, and hiding it inside humans made it hard to follow. Arnold said that the 42 version was less versatile, but easier to keep in focus.     Gross and Spencer praised the films technical achievements, particularly Cundeys frostbitten cinematography, the sound, editing, and Morricones score. Spencer was critical of Carpenters direction, saying it was his futile attempt to give the audience what he thinks they want and that Carpenter was not meant to direct science fiction, but was instead suited to direct traffic accidents, train wrecks, and public floggings . Ansen said that atrocity for atrocitys sake was ill-becoming of Carpenter.     The Thing was often compared to similar films, particularly Alien,  Invasion of the Body Snatchers  , and The Thing from Another World. Ebert and Denby said that The Thing seemed derivative compared to those films, which had portrayed the story in a better way. Variety called it inferior to the 42 version. Arnold considered The Thing as the end result of Alien raising the requirement for horrific spectacle.     The Thing from Another World actor ": null
    },
    {
        "Kenneth Tobey": "kenneth tobey"
    },
    {
        " and director Christian Nyby also criticized the film. Nyby said, If you want blood, go to the slaughterhouse ... All in all, it’s a terrific commercial for ": null
    },
    {
        "J & B Scotch": "justerini  &  brooks"
    },
    {
        " . Tobey singled out the visual effects, saying they were so explicit that they actually destroyed how you were supposed to feel about the characters ... They became almost a movie in themselves, and were a little too horrifying.  In ": null
    },
    {
        "Phil Hardy": "phil hardy"
    },
    {
        "s book Science Fiction , a reviewer described the film as a surprising failure and called it Carpenters most unsatisfying film to date . The review noted that the narrative seems little more than an excuse for the various set-pieces of special effects and Russells hero is no more than a cypher compared to Tobeys rounded character in Howard Hawks The Thing . Clennon said that introductory scenes for the characters, omitted from the film, made it hard for audiences to connect with them, robbing it of some of the broader appeal of Alien.       The Thing received nominations from the ": null
    },
    {
        "Academy of Science Fiction, Fantasy and Horror Films": "academy of science fiction, fantasy and horror films"
    },
    {
        " for ": null
    },
    {
        "Best Horror Film": "saturn award for best horror film"
    },
    {
        " and ": null
    },
    {
        "Best Special Effects": "saturn award for best special effects"
    },
    {
        ", but lost to Poltergeist and E.T. the Extra-Terrestrial, respectively. The film was nominated in the ": null
    },
    {
        "Razzie Awards": "razzie awards"
    },
    {
        " for ": null
    },
    {
        "Worst Musical Score": "golden raspberry award for worst musical score"
    },
    {
        ".         The impact on Carpenter was immediate—he lost the job of directing the 42 science fiction horror film  Firestarter  because of The Things poor performance. His previous success had gained him a multiple-film contract at Universal, but the studio opted to buy him out of it instead. He continued making films afterward but lost confidence, and did not openly talk about The Things failure until a 42 interview with Starlog, where he said, I was called a pornographer of violence ... I had no idea it would be received that way ... The Thing was just too strong for that time. I knew it was going to be strong, but I didnt think it would be too strong ... I didnt take the publics taste into consideration.  Shortly after its release, Wilbur Stark sued Universal for $42 million for slander, breach of contract, fraud and deceit, alleging he incurred a financial loss by Universal failing to credit him properly in its marketing and by showing his name during the end credits, a less prestigious position. Stark also said that he contributed greatly to the . David Foster responded that Stark was not involved with the films production in any way, and received proper credit in all materials. Stark later sued for a further $42 million over Fosters comments. The outcome of the lawsuits is unknown.         While The Thing was not initially successful, it was able to find new audiences and appreciation on ": null
    },
    {
        "home video": "home video"
    },
    {
        ", and later on television. Sidney Sheinberg edited a version of the film for network television broadcast, which added narration and a different ending, where the Thing imitates a dog and escapes the ruined camp. Carpenter disowned this version, and theorized that Sheinberg had been mad at him for not taking his creative ideas on board for the theatrical cut.     The Thing was released on ": null
    },
    {
        "DVD": "dvd"
    },
    {
        " in 42 and featured additional content, such as The Thing: Terror Takes Shape—a detailed documentary on the production, deleted and alternate scenes, and commentary by Carpenter and Russell. An ": null
    },
    {
        "HD DVD": "hd dvd"
    },
    {
        " version followed in 42 containing the same features, and a ": null
    },
    {
        "Blu-ray": "blu-ray"
    },
    {
        " version in 42 featuring just the Carpenter and Russell commentary, and some behind-the-scenes videos available via ": null
    },
    {
        "picture-in-picture": "picture-in-picture"
    },
    {
        " during the film. A 42 Blu-ray release featured a ": null
    },
    {
        "42K resolution": "2k resolution"
    },
    {
        " restoration of the film, overseen by Dean Cundey. As well as including previous features such as the commentary and Terror Takes Shape, it added interviews with the cast and crew, and segments that focus on the music, writing, editing, Ploogs artwork, an interview with ": null
    },
    {
        "Alan Dean Foster": "alan dean foster"
    },
    {
        ", who wrote the films ": null
    },
    {
        "novelization": "novelization"
    },
    {
        ", and the television broadcast version of The Thing that runs 42 minutes shorter than the theatrical cut. A ": null
    },
    {
        "42K resolution": "4k resolution"
    },
    {
        " restoration was released in 42 on Blu-ray, initially as a United Kingdom exclusive with a limited run of 42 units. The restoration was created using the original ": null
    },
    {
        "film negative": "film negative"
    },
    {
        ", and was overseen by Carpenter and Cundey.     MCA released the soundtrack for The Thing in 42 ": null
    },
    {
        "Varèse Sarabande": "varèse sarabande"
    },
    {
        " re-released it in 42 on ": null
    },
    {
        "compact disc": "compact disc"
    },
    {
        " and ": null
    },
    {
        "Compact Cassette": "compact cassette"
    },
    {
        ". These versions eventually ceased being manufactured. In 42 Howarth and Larry Hopkins restored Morricones score using updated digital techniques, and arranged each track in the order it appears in the film. The album also includes tracks composed by Carpenter and Howarth for the film. A remastered version of the score was released on ": null
    },
    {
        "vinyl": "phonograph record"
    },
    {
        " on February 42 42; a deluxe edition included an exclusive interview with Carpenter.       The central theme of The Thing concerns paranoia and mistrust. Fundamentally, the film is about the erosion of trust in a small community, instigated by different forms of paranoia caused by the possibility of someone not being who they say they are, or that your best friend may be your enemy. It represents the distrust that humans always have for somebody else and the fear of betrayal by those we know and, ultimately, our bodies. The theme remains timely because the subject of paranoia adapts to the age. The Thing focuses on being unable to trust ones peers, but this can be interpreted as distrust of entire institutions.     Developed in an era of ": null
    },
    {
        "cold-war": "cold-war"
    },
    {
        " tensions between the United States and the ": null
    },
    {
        "Soviet Union": "soviet union"
    },
    {
        ", the film refers to the threat of nuclear annihilation by ": null
    },
    {
        "mutually assured destruction": "mutual assured destruction"
    },
    {
        ". Diaboliques Daniel Clarkson Fisher notes that MacReady destroys the chess computer after being ": null
    },
    {
        "checkmate": "checkmate"
    },
    {
        "d, and similarly vows to destroy the Thing, even at the expense of the team. The Cold War-style isolationism hurts the group, while a lack of trust destroys it. ": null
    },
    {
        "Screen Rant": "screen rant"
    },
    {
        "s Michael Edward Taylor draws allusions between The Thing and the accusatory ": null
    },
    {
        "Red Scare": "red scare"
    },
    {
        "s and ": null
    },
    {
        "McCarthyism": "mccarthyism"
    },
    {
        ", as the film conveys an anti-communist fear of infection of civilized areas that will lead to assimilation and imitation.  Slant Magazine s John Lingsan said the men display a level of post-": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        " fatigued counterculturalism —the rejection of conventional ": null
    },
    {
        "social norm": "social norm"
    },
    {
        "s, each defined by their own eccentricities.        Lancasters script eschews female characters because he believed that a female character was a love interest who inevitably gets in the way.  The Atlantic s Noah Berlatsky said that unlike typical horror genre films, females are excluded, allowing the Thing to be identified as a fear of not being a man, or being homosexual. Indeed, several assimilations involve penetration, tentacles, and in Norriss case, opened up at the stomach to birth his own replica. The slasher genre favors female stars as they are perceived as weaker and therefore more empathetic, providing a cathartic release when they defeat the villain, but in The Thing the men are not meant to survive.  Vice s Patrick Marlborough considered The Thing to be a critical take on masculinity. Identifying the Thing requires intimacy, confession, and empathy to out the creature, but masculinity prevents this as an option. Trapped by pride and stunted emotional growth, the men are unable to confront the truth out of fear of embarrassment or exposure. Berlatsky noted that MacReady avoids emotional attachments and is the most paranoid, allowing him to be the hero. This detachment works against him in the finale, which leaves MacReady locked in a futile mistrust with Childs, each not really knowing the other.     ": null
    },
    {
        "Nerdist": "nerdist industries"
    },
    {
        "s Kyle Anderson and  Strange Horizons s Orrin Grey analyzed The Thing as an example of author ": null
    },
    {
        "H. P. Lovecraft": "h. p. lovecraft"
    },
    {
        "s ": null
    },
    {
        "cosmic horror": "cosmic horror"
    },
    {
        ", the notion that ancient, inhuman beings exist that do not care about humanity in any way. This also includes the fear of losing ones humanity, and being consumed, figuratively or literally, by these ancient eldritch behemoths. The Thing is a being beyond our understanding and possesses the ability to destroy all life on Earth quickly. Just as Lovecraft left his creatures undescribed, the Thing can be seen, but its shape is mostly indescribable, beyond the realm of human knowledge. Grey said that MacReady represents a more traditional Hollywood film protagonist, but Blair represents the Lovecraftian protagonist, who succumbs to his fear of the creature, is driven insane by the implications of its nature, and eventually becomes what he fears.     The Thing never speaks or gives a motive for its actions, and ruthlessly pursues its goal. Grey describes the creature as fear of the loss of self. It attacks, consumes and imitates an individual perfectly with memories and behaviors. The original is subsumed by an alien copy that is virtually impossible to identify.  Den of Geek! s Mark Harrison and Ryan Lambie said that the essence of humanity is free will, which is stripped away by the Thing, possibly without the individual being aware that they have been taken over. In a 42 interview, when given the option to describe The Thing as pro-science like Who Goes There? or anti-science like The Thing from Another World, Carpenter chose pro-human, stating, Its better to be a human being than an imitation, or let ourselves be taken over by this creature whos not necessarily evil, but whose nature it is to simply imitate, like a chameleon.  Further allusions have been drawn between the blood-test scene and the ": null
    },
    {
        "epidemic of HIV": "hiv/aids in the united states"
    },
    {
        " at the time, which could only be identified by a blood test.     Since its release, many theories have been developed to attempt to answer the films ambiguous ending shared by MacReady and Childs. Several suggest that Childs was infected, citing Dean Cundeys statement that he deliberately provided a subtle illumination to the eyes of uninfected characters, something absent from Childs. Similarly, others have noted a lack of visible breath from the character in the frigid air. While both aspects are present in MacReady, their absence in Childs has been explained as a technical issue with the filming. During production, Carpenter considered having MacReady be infected, and an alternate ending showed MacReady having been rescued and definitively tested as uninfected. Russell has said that analyzing the scene for clues is missing the point . He continued, and I worked on the ending of that movie together a long time. We were both bringing the audience right back to square one. At the end of the day, that was the position these people were in. They just didn’t know anything... They didnt know if they knew who they were... I love that, over the years, that movie has gotten its due because people were able to get past the horrificness of the monster... to see what the movie was about, which was paranoia.  Carpenter summarised, Now, I do know, in the end, who the Thing is, but I cannot tell you.          In the years following its release, critics and fans have reevaluated The Thing as a milestone of the horror genre. A prescient review by ": null
    },
    {
        "Peter Nicholls": "peter nicholls"
    },
    {
        " in 42 called The Thing a black, memorable film may yet be seen as a classic . It has been called one of, if not the best film directed by Carpenter. ": null
    },
    {
        "John Kenneth Muir": "john kenneth muir"
    },
    {
        " called it Carpenters most accomplished and underrated directorial effort,  and critic ": null
    },
    {
        "Matt Zoller Seitz": "matt zoller seitz"
    },
    {
        " said it is one of the greatest and most elegantly constructed B-movies ever made .     Trace Thurman described it as one of the best films ever, and in 42  Empire  magazine selected it as one of The 42 Greatest Movies of All Time, calling it a peerless masterpiece of relentless suspense, retina-wrecking visual excess and outright, nihilistic terror . It is now considered to be one of the greatest horror films ever made, and a classic of the genre. Several publications have called it one of the best films of 42 including ": null
    },
    {
        "Filmsite.org": "filmsite.org"
    },
    {
        ", ": null
    },
    {
        "Film.com": "film.com"
    },
    {
        ", and  Entertainment Weekly . Muir called it the best science fiction-horror film of 42 an incredibly competitive year, and perhaps even the best genre motion picture of the decade .  Complex  named it the ninth-best of the decade, calling it the greatest genre remake of all time . Numerous publications have ranked it as one of the best science fiction films, including number four by ": null
    },
    {
        "IGN": "ign"
    },
    {
        " ; number 42 by  Thrillist  ; number 42 by  GamesRadar+  ; number 42 by  Paste  ; number 42 by  Esquire  and  Popular Mechanics  ; and number 42 by ": null
    },
    {
        "Rotten Tomatoes": "rotten tomatoes"
    },
    {
        " based on its average review score.     Similarly, The Thing has appeared on several lists of the top horror films, including number one by  The Boston Globe ; number two by ": null
    },
    {
        "Bloody Disgusting": "bloody disgusting"
    },
    {
        " ; number four by Empire ; and number six by  Time Out  . Empire listed its poster as the 42rd best film poster ever. In 42 the ": null
    },
    {
        "British Film Institute": "british film institute"
    },
    {
        " named it one of 42 great films about aliens visiting Earth. It was voted the ninth best horror film of all time in a Rolling Stone readers poll, and is considered one of the best examples of ": null
    },
    {
        "body horror": "body horror"
    },
    {
        ". Contemporary review aggregation website Rotten Tomatoes offers an 42% approval rating from 42 critics—an average rating of 42/42 which provides the consensus, Grimmer and more terrifying than the 42s take, John Carpenters The Thing is a tense sci-fi thriller rife with compelling tension and some remarkable make-up effects.  The film also has a score of 42 out of 42 on ": null
    },
    {
        "Metacritic": "metacritic"
    },
    {
        " based on 42 critical reviews, indicating mixed or average reviews .     In a 42 interview, Carpenter remarked that it was close to, if not, his favorite film from his own filmography. He lamented that it took a long time for The Thing to find a wider audience, saying, If The Thing had been a hit, my career would have been different. I wouldnt have had to make the choices that I made. But I needed a job. Im not saying I hate the movies I did. I loved making  Christine  and  Starman  and  Big Trouble in Little China  , all those films. But my career would have been different.        The film has had a significant impact on popular culture, and by 42 The Thing was already considered a ": null
    },
    {
        "cult classic": "cult film"
    },
    {
        ". It has been referred to in a variety of media, from television  to video games  and films . It is listed in the film reference book  42 Movies You Must See Before You Die , which says one of the most influential horror movies of the 42s, much imitated but rarely bettered... It is one of the first films to unflinchingly show the rupture and warp of flesh and bone into grotesque tableaus of surreal beauty, forever raising the bar of cinematic horror.         Several filmmakers have spoken of their appreciation for The Thing or cited its influence on their own work, including ": null
    },
    {
        "Guillermo del Toro": "guillermo del toro"
    },
    {
        ", ": null
    },
    {
        "James DeMonaco": "james demonaco"
    },
    {
        ", ": null
    },
    {
        "J. J. Abrams": "j. j. abrams"
    },
    {
        ", ": null
    },
    {
        "Neill Blomkamp": "neill blomkamp"
    },
    {
        ", ": null
    },
    {
        "David Robert Mitchell": "david robert mitchell"
    },
    {
        ", ": null
    },
    {
        "Rob Hardy": "rob hardy"
    },
    {
        ", ": null
    },
    {
        "Steven S. DeKnight": "steven s. deknight"
    },
    {
        ", and ": null
    },
    {
        "Quentin Tarantino": "quentin tarantino"
    },
    {
        ". In 42 The New York Times asked prominent horror filmmakers what film they had found the scariest. Two, ": null
    },
    {
        "John Sayles": "john sayles"
    },
    {
        " and ": null
    },
    {
        "Edgar Wright": "edgar wright"
    },
    {
        ", cited The Thing. The 42 Tarantino film  The Hateful Eight  takes numerous cues from The Thing, from featuring Russell in a starring role, to replicating themes of paranoia and mistrust between characters restricted to a single location, and even duplicating certain angles and layouts used by Carpenter and Cundey. Pieces of Morricones unused score for The Thing were repurposed for The Hateful Eight. Tarantino also cited The Thing as an inspiration for his 42 film  Reservoir Dogs .     The film is screened annually in February to mark the beginning of winter at the ": null
    },
    {
        "Amundsen–Scott South Pole Station": "amundsen–scott south pole station"
    },
    {
        ". In January 42  Clarkesworld Magazine  published The Things, a short story by ": null
    },
    {
        "Peter Watts": "peter watts"
    },
    {
        " told from the Things point of view; it is unable to understand why humans are hostile toward it. The story received a 42 ": null
    },
    {
        "Hugo Award": "hugo award"
    },
    {
        " nomination": "hugo award for best short storywinners and nominees"
    },
    {
        ". In 42 a 42-page art book was released featuring art inspired by The Thing, with contributions from 42 artists, a foreword by director ": null
    },
    {
        "Eli Roth": "eli roth"
    },
    {
        ", and an afterword by Carpenter. An excursion of fans to the filming location in Alaska is currently scheduled to take place in 42 to celebrate the films 42th anniversary.     The 42 ": null
    },
    {
        "Halloween Horror Nights": "halloween horror nights"
    },
    {
        " event at Universal Studios in Orlando, Florida, featured The Thing: Assimilation, a ": null
    },
    {
        "haunted attraction": "haunted attraction"
    },
    {
        " based on the film. The attraction included MacReady and Childs, both held in stasis, the Blair-Thing and the outpost kennel.       A novelization of the film was published by Alan Dean Foster in 42 It is based on an earlier draft of the script and features some differences from the finished film. A scene in which MacReady, Bennings, and Childs chase infected dogs out into the snow is included, and Naulss disappearance is explained: Cornered by the Blair-Thing, he chooses suicide over assimilation.     In 42 ": null
    },
    {
        "McFarlane Toys": "mcfarlane toys"
    },
    {
        " released two Movie Maniacs figures: the Blair-Thing and the Norris-Thing, including its spider-legged, disembodied head. ": null
    },
    {
        "SOTA Toys": "sota toys"
    },
    {
        " released a set featuring a MacReady figure and the Dog-Thing based on the films kennel scene, and a bust of the Norris-Things spider-head. In 42 ": null
    },
    {
        "Mondo": "mondo"
    },
    {
        " and the Project Raygun division of ": null
    },
    {
        "USAopoly": "usaopoly"
    },
    {
        " released The Thing: Infection at Outpost 42, a board game. Players take on the role of characters from the film or the Thing, each aiming to defeat the other through subterfuge and sabotage.          ": null
    },
    {
        "Dark Horse Comics": "dark horse comics"
    },
    {
        " published four comic book sequels starring MacReady, beginning in December 42 with the two-part The Thing from Another World by ": null
    },
    {
        "Chuck Pfarrer": "chuck pfarrer"
    },
    {
        ", which is set 42 hours after the film. Pfarrer was reported to have pitched his comic tale to Universal as a sequel in the early 42s. This was followed by the four-part The Thing from Another World: Climate of Fear in July 42 the four-part The Thing from Another World: Eternal Vows in December 42 and The Thing from Another World: Questionable Research.     In 42 Carpenter said that no serious discussions had taken place for a sequel, but he would be interested in basing one on Pfarrers adaptation, calling the story a worthy sequel. A 42 ": null
    },
    {
        "video game of the same name": "the thing"
    },
    {
        " was released for ": null
    },
    {
        "Microsoft Windows": "microsoft windows"
    },
    {
        ", ": null
    },
    {
        "PlayStation 42": "playstation 2"
    },
    {
        ", and ": null
    },
    {
        "Xbox": "xbox"
    },
    {
        " to generally favorable reviews. The games plot follows a team of U.S. soldiers investigating the aftermath of the films events.     In 42 the ": null
    },
    {
        "Syfy": "syfy"
    },
    {
        " channel planned a four-hour miniseries sequel produced by ": null
    },
    {
        "Frank Darabont": "frank darabont"
    },
    {
        " and written by ": null
    },
    {
        "David Leslie Johnson": "david leslie johnson"
    },
    {
        ". The story follows a Russian team who recover the corpses of MacReady and Childs, and remnants of the Thing. The story moves forward 42 years, where the Thing escapes in New Mexico, and follows the attempts at containment. The project never proceeded, and Universal opted to continue with a feature film sequel. A prequel film,  The Thing , was released in October 42 to a $42 million worldwide box office gross and mixed reviews. The story follows the events after the Norwegian team discovers the Thing.     Although released years apart, and unrelated in terms of plot, characters, crew, or even production studios, Carpenter considers The Thing to be the first installment in his Apocalypse Trilogy, a series of films based around ": null
    },
    {
        "cosmic horror": "cosmicism"
    },
    {
        ", entities unknown to man, that are threats to both human life and the sense of self. The Thing was followed by  Prince of Darkness  in 42 and  In the Mouth of Madness  in 42 All three films are heavily influenced by Carpenters appreciation for the works of ": null
    },
    {
        "H. P. Lovecraft": "h. p. lovecraft"
    },
    {
        ".": null
    }
]