[
    {
        "     The Legend of Zelda: The Wind Waker is a 42 ": null
    },
    {
        "action-adventure game": "action-adventure game"
    },
    {
        " developed and published by ": null
    },
    {
        "Nintendo": "nintendo"
    },
    {
        " for the ": null
    },
    {
        "GameCube": "gamecube"
    },
    {
        ". The tenth installment in  The Legend of Zelda  series, The Wind Waker is set on a group of islands in a vast sea, a departure for the series. It follows series protagonist ": null
    },
    {
        "Link": "link"
    },
    {
        " as he attempts to save his sister from the sorcerer ": null
    },
    {
        "Ganon": "ganon"
    },
    {
        " and becomes embroiled in a struggle for the ": null
    },
    {
        "Triforce": "triforce"
    },
    {
        ", a sacred wish-granting relic. Aided by allies including pirate captain ": null
    },
    {
        "Tetra": "tetra"
    },
    {
        "—an incarnation of ": null
    },
    {
        "Princess Zelda": "princess zelda"
    },
    {
        "—and a talking boat named the ": null
    },
    {
        "King of Red Lions": "king of red lions"
    },
    {
        ", Link sails the ocean, explores islands, and traverses dungeons to acquire the power necessary to defeat Ganon.     Gameplay is presented from the ": null
    },
    {
        "third-person perspective": "third-person perspective"
    },
    {
        ". The player controls Link, who fights with a sword and shield, in addition to other items. Like previous Zelda games, Link explores dungeons to fight enemies, find items, and solve puzzles. The player must also explore the oceans, and wind, which facilitates sailing, plays a prominent role and can be controlled with a magic conductors baton called the Wind Waker. While the game retains the basic 42D gameplay of its predecessors,  Ocarina of Time  and  Majoras Mask  , The Wind Waker features a distinctive cartoon-like art style created through ": null
    },
    {
        "cel shading": "cel shading"
    },
    {
        ".     Development began before Majoras Mask was completed in 42 and lasted until late 42 ": null
    },
    {
        "Eiji Aonuma": "eiji aonuma"
    },
    {
        " reprised his directorial duties for The Wind Waker, while ": null
    },
    {
        "Shigeru Miyamoto": "shigeru miyamoto"
    },
    {
        " and ": null
    },
    {
        "Takashi Tezuka": "takashi tezuka"
    },
    {
        " produced. Nintendos Zelda team did not want to continue using the realistic graphics of previous Zelda games, instead choosing a cartoonish aesthetic that would offer new gameplay and combat possibilities. Kenta Nagata, Hajime Wakai, ": null
    },
    {
        "Toru Minegishi": "toru minegishi"
    },
    {
        ", and ": null
    },
    {
        "Koji Kondo": "koji kondo"
    },
    {
        " composed the soundtrack, which consists of original tracks inspired by traditional Irish music and reworked pieces from older Zelda games. Nintendo released The Wind Waker in Japan in December 42 in North America in March 42 and in Europe in May 42     Although The Wind Waker was praised for its visuals, gameplay, design, and story — and won several ": null
    },
    {
        "Game of the Year": "game of the year"
    },
    {
        " accolades — its art direction proved divisive among players. This contributed to comparatively weak sales; the game sold 42 million copies, far below the 42 million Ocarina of Time sold. As a result, Nintendo changed directions with the next Zelda installment, the more realistically styled  Twilight Princess  . However, The Wind Waker reputation improved over time, and it is now widely considered one of the ": null
    },
    {
        "greatest video games ever made": "greatest video games ever made"
    },
    {
        ". The Wind Waker originated the ": null
    },
    {
        "Toon Link": "toon link"
    },
    {
        " character and received two sequels for the ": null
    },
    {
        "Nintendo DS": "nintendo ds"
    },
    {
        ",  Phantom Hourglass  , and  Spirit Tracks  . A ": null
    },
    {
        "high-definition remaster": "video game remake"
    },
    {
        ",  The Legend of Zelda: The Wind Waker HD , was released for the ": null
    },
    {
        "Wii U": "wii u"
    },
    {
        " in 42            The Legend of Zelda: The Wind Waker is an ": null
    },
    {
        "open world": "open world"
    },
    {
        " action-adventure game with ": null
    },
    {
        "role-playing": "role-playing video game"
    },
    {
        " elements. The control scheme is comparable to its predecessors: the player moves the protagonist Link in three dimensions from a ": null
    },
    {
        "third-person perspective": "third-person perspective"
    },
    {
        ".  Link fights with a sword and shield as well as a variety of other weapons and items. He interacts with ": null
    },
    {
        "non-player character": "non-player character"
    },
    {
        "s and objects via the action button.  Like the previous games, The Wind Waker features a targeting system allowing Link to lock on and constantly face an enemy or target.  A new feature is the ability to move the ": null
    },
    {
        "camera system": "virtual camera system"
    },
    {
        " around Link.  Onscreen meters track Links ": null
    },
    {
        "health": "health"
    },
    {
        " and magic; Link can expand his health meter by finding heart containers and container pieces in the game.      The game world comprises 42 gridded sections of the ": null
    },
    {
        "Great Sea": "great sea"
    },
    {
        " , each containing an island or island chain. Some must be explored to continue the story, while others are optional.  Like all Zelda games, The Wind Waker features several dungeons—large, enclosed areas where Link fights enemies, finds items, and solves puzzles to continue. Each dungeon quest concludes with a battle against a ": null
    },
    {
        "boss": "boss"
    },
    {
        ", a singularly powerful enemy.  In addition to the main story, the game includes many ": null
    },
    {
        "sidequest": "sidequest"
    },
    {
        "s, minor objectives the player can optionally complete to attain rewards. For example, Link can use the Picto Box – an in-game camera – to take pictures to fulfill quests.      Throughout the game, Link acquires items and weapons that provide new abilities.  Items are often needed to reach certain areas, defeat bosses or other enemies, and advance the story. For example, the ": null
    },
    {
        "grappling hook": "grappling hook"
    },
    {
        " is necessary to pass obstacles and defeat the boss in the Dragon Roost Cavern dungeon; it can then be used to enter previously inaccessible areas elsewhere. The Tingle Tuner is a special item allowing a second player to control the character ": null
    },
    {
        "Tingle": "tingle"
    },
    {
        " if the system is connected to a ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    },
    {
        " by a ": null
    },
    {
        "link cable": "gamecube – game boy advance link cable"
    },
    {
        ".        A significant portion of the game is spent sailing between islands on Links boat, the ": null
    },
    {
        "King of Red Lions": "king of red lions"
    },
    {
        ". The boats sail is driven by wind that blows across the game world in one of eight directions; a ": null
    },
    {
        "tailwind": "tailwind"
    },
    {
        " behind the boat will give it top speed, while sailing against the wind is difficult. The Great Sea features enemies and obstacles different from those found on land; additionally, some items serve new purposes while Link is aboard the King of Red Lions. The Grappling Hook, for example, serves as a crane for recovering sunken treasure.  Link explores the sea with the help of a ": null
    },
    {
        "sea chart": "sea chart"
    },
    {
        ", which can be updated with information on each square and island. Through the game, Link acquires additional charts pointing the way to treasure chests and significant locations. On land, dungeons feature similar maps.      Early in the game, Link receives the Wind Waker, a ": null
    },
    {
        "baton": "baton"
    },
    {
        " which allows him to control the wind and harness other powers by conducting , or performing, specific melodies. The player controls the Wind Waker by moving the joypads to change pitch and ": null
    },
    {
        "time signature": "time signature"
    },
    {
        ". The first melody, the Winds Requiem , enables Link to change the winds direction, allowing him to sail anywhere. Link can learn five other tunes for the Wind Waker, which provide abilities such as ": null
    },
    {
        "warping": "warp"
    },
    {
        " to other regions and turning night to day.          According to  The Legend of Zelda: Hyrule Historia , Nintendos official ": null
    },
    {
        "Legend of Zelda chronology": "the legend of zeldafictional chronology"
    },
    {
        ", The Wind Waker takes place in the New World timeline, one of several parallel timelines in which Zelda games are set following the events of  Ocarina of Time . The game follows the Adult Link timeline, after Link, the Hero of Time , defeats Ganon and time-travels back to his childhood. A crisis emerges when Ganon returns, but Link does not. Centuries later, the people live on islands in the Great Sea. They preserve Links story as a legend, but his kingdoms fate is unknown. The main character, a young boy also named Link, lives on Outset Island, where boys dress in green like the Hero of Time when they come of age.        While Link is celebrating his coming of age, a gigantic bird drops pirate captain ": null
    },
    {
        "Tetra": "tetra"
    },
    {
        " into Outset Islands forest. Link rescues Tetra from monsters, but the bird carries off Links sister Aryll. Tetra agrees to help Link find his sister, and they sail to the Forsaken Fortress, where the bird, the Helmaroc King, has been taking ": null
    },
    {
        "girls with long ears": "hylians"
    },
    {
        ". Link finds Aryll and other kidnapped girls, but the Helmaroc King captures him and takes him to a man in black, who orders Link thrown into the sea.     Link is rescued at Windfall Island by a talking boat, the King of Red Lions, who explains that the birds master is a returned Ganon. To defeat him, Link must find the Hero of Times power, which requires the three Pearls of the Goddesses. Link finds Dins Pearl on Dragon Roost Island, home of the avian ": null
    },
    {
        "Rito": "rito"
    },
    {
        " and the dragon Valoo; Farores Pearl in Forest Haven, home of the ": null
    },
    {
        "Great Deku Tree": "great deku tree"
    },
    {
        " and the plant-like ": null
    },
    {
        "Koroks": "koroks"
    },
    {
        "; and Nayrus Pearl with the water spirit Jabun on Outset Island. The King of Red Lions then takes Link to the Tower of the Gods, where he faces trials before descending beneath the ocean to a castle suspended in time. Here Link finds the Hero of Times weapon, the ": null
    },
    {
        "Master Sword": "master sword"
    },
    {
        ".     Link returns to the Forsaken Fortress. Tetras crew arrive and rescue the girls, but Ganon easily overpowers Link and Tetra: the Master Sword has lost its power. Ganon recognizes Tetras Triforce necklace and realizes she is the incarnation of ": null
    },
    {
        "Princess Zelda": "princess zelda"
    },
    {
        " he is seeking. Links Rito allies and Valoo save Link and Tetra from Ganon. The King of Red Lions brings the two back to the underwater realm, explaining it is the legendary kingdom of ": null
    },
    {
        "Hyrule": "hyrule"
    },
    {
        ", which the goddesses submerged long ago to contain Ganon while the people fled to the mountaintops. The King of Red Lions reveals himself to be Daphnes Nohansen Hyrule, the last King of Hyrule, and Tetra is his heir, Zelda, keeper of the Triforce of Wisdom.     Tetra remains in the castle while Link and the King journey to the two sages who provided the Master Swords power. They discover Ganons forces murdered them both, so Link must awaken new sages: the Rito Medli and the Korok Makar. The sages restore the Master Sword, but the King learns that Ganon has abandoned the Forsaken Fortress and fears an attack. They then track down the eight shards of the missing Triforce of Courage, once kept by the Hero of Time, and the gods recognize Link as the Hero of Winds.     Link and the King return to Hyrule to discover that Ganon has captured Tetra. Link follows them to Ganons tower, defeating Ganons minions before Ganon overcomes him. Ganon joins Links and Tetras Triforce pieces with his own Triforce of Power, forming the complete Triforce, which will grant his wish to rule the world. Before he can act, the King of Hyrule appears and wishes that the Goddesses wash Ganon and Hyrule away. The King then grants Link and Tetra hope for their own future. Link and Tetra battle Ganon with the Master Sword and magical arrows as water pours around them; with the final blow, the Master Sword turns Ganon to stone. Link and Tetra rise to the surface as the King and Hyrule are submerged. They are reunited with their friends; a post-credits scene shows the heroes sailing off to find a new land.            Nintendos Zelda team initiated plans for a new game early in the development of the GameCube system, before Majoras Mask was completed for the ": null
    },
    {
        "Nintendo 42": "nintendo 64"
    },
    {
        " in 42 ": null
    },
    {
        "Eiji Aonuma": "eiji aonuma"
    },
    {
        ", director of Majoras Mask, returned to helm the project, while ": null
    },
    {
        "Shigeru Miyamoto": "shigeru miyamoto"
    },
    {
        " and ": null
    },
    {
        "Takashi Tezuka": "takashi tezuka"
    },
    {
        " served as producers.   Early concepts generally followed Ocarina of Times designs, with graphics enhanced for the new systems capabilities.  The team hastily created a brief clip of Link fighting Ganondorf for a demonstration at the 42 ": null
    },
    {
        "Space World": "nintendo space world"
    },
    {
        " exposition, where Nintendo announced the GameCube. The clip resonated with fans and commentators who hoped it previewed the next Zelda game.       The Zelda team, however, had exhausted its ideas for this style and format. Aonuma hated the demo, finding it derivative of past Zelda games. The team explored other directions until designer Yoshiki Haruhana created a cartoonish drawing of a young Link that caught their eye. Design manager Satoru Takizawa drew up an enemy ": null
    },
    {
        "Moblin": "moblin"
    },
    {
        " in a similar style, and the team seized on the new gameplay and combat possibilities afforded by the stylized cartoon aesthetic. To achieve this look, they used ": null
    },
    {
        "cel shading": "cel shading"
    },
    {
        " on 42D models, giving the look of an interactive cartoon.   The developers built the game with ": null
    },
    {
        "Alias/Wavefront": "alias/wavefront"
    },
    {
        "s Maya 42D tool and a custom ": null
    },
    {
        "game engine": "game engine"
    },
    {
        ".         With this decision, development proceeded swiftly. The team quickly decided the setting would be islands in an ocean, determining it would provide interesting visuals and mechanics in the cel-shaded style. This in turn inspired the central sailing feature. Some features drew skepticism; for instance producers Miyamoto and Tezuka requested an explanation for the characters exaggeratedly large eyes. The team jokingly suggested having Link shoot beams from his eyes before deciding to have him focus his gaze on significant objects nearby, giving hints to observant players about what to do next.      Nintendo presented a demo clip of the new game at the 42 Space World, August 42–42 Response to the cel-shaded design was divided. While some attendees enjoyed the new look, there was backlash from disappointed fans who had hoped for a more realistic Zelda along the lines of the 42 demo.  Critics derisively dubbed the game Celda . Miyamoto was surprised at the response and decided to limit revealing further information about the game until the team finished a playable demonstration, hoping to shift focus from the graphics to the gameplay.       Miyamoto introduced a playable demo at the next years ": null
    },
    {
        "Electronic Entertainment Expo": "history of the electronic entertainment expo2002"
    },
    {
        " on May 42–42 42 alongside another upcoming GameCube Zelda,  Four Swords Adventures . Miyamoto encountered glitches while he attempted to demonstrate Links new ability to use enemies dropped weapons. However, reception was more positive than that for the Space World demo. The game received the 42 ": null
    },
    {
        "Game Critics Awards": "game critics awards"
    },
    {
        " for Best Console Game at E42 ": null
    },
    {
        "IGN": "ign"
    },
    {
        " editor Fran Mirabella said the cartoon look works very nicely and that it feels very much like Zelda .  The whimsical style was compared to  A Link to the Past  and promotional artwork from previous Zelda games. The E42 demo also introduced new features, such as the ability to connect to the Game Boy Advance and receive help from Tingle.  However, the art direction continued to divide audiences.      Development continued through late 42 with targeted release dates of December in Japan and early 42 in North America.  During the final stages, two dungeons that fell behind schedule were cut and replaced with a quest to recover Triforce pieces around the Great Sea. Elements of these dungeons were recycled for later Zelda games. On October 42 42 Nintendo revealed the games Japanese subtitle, Kaze no Takuto , to emphasize the role of wind in the game. The company announced the English title, The Wind Waker, on December 42 42  In the gap between the Japanese and North American releases, the designers reworked some segments, notably shortening the lengthy Triforce quest.         The music in The Wind Waker was composed by Kenta Nagata, Hajime Wakai, ": null
    },
    {
        "Toru Minegishi": "toru minegishi"
    },
    {
        ", and ": null
    },
    {
        "Koji Kondo": "koji kondo"
    },
    {
        ".  The sound team was significantly larger than for other contemporary projects to accommodate Nintendos desire for a high caliber of work in the rushed development schedule. Koji Kondo, the primary composer for The Legend of Zelda series, contributed to the score but did not serve as sound director.   However, the score incorporated some of his pieces from older Zelda games, modifying them to emphasize the time passed between the stories.     The soundtrack is primarily environmental; it modulates between various tracks depending on location, time and other conditions.  Much of the score is inspired by traditional Irish music and is overall lighter as well as more upbeat than previous scores in the series.   The advancement of ": null
    },
    {
        "MIDI": "midi"
    },
    {
        " technology allowed the soundtrack to more closely approximate the sounds of real instruments than was possible in previous installments. The score features strings, winds, brass, percussion, and for the first time in the Zelda series, wordless vocals. The vocals are especially prominent in the tunes Link conducts with the Wind Waker, singing in ": null
    },
    {
        "D major": "d major"
    },
    {
        ".  Shigeru Miyamoto reportedly played the ": null
    },
    {
        "mandolin": "mandolin"
    },
    {
        " featured in the Title Theme .  ": null
    },
    {
        "Scitron Digital Content": "scitron digital content"
    },
    {
        " released a two-disc, 42-track ": null
    },
    {
        "soundtrack album": "soundtrack album"
    },
    {
        ", The Legend of Zelda: The Wind Waker Original Sound Tracks, on March 42 42      The Wind Waker was released on December 42 42 in Japan, on March 42 42 in North America,  and on May 42 42 in Europe.  To promote the release, Nintendo offered a bonus disc as a ": null
    },
    {
        "pre-order incentive": "pre-order incentive"
    },
    {
        " which included a GameCube port of Ocarina of Time as well as its previously unreleased expansion,  Ura Zelda .   Ura Zelda, largely an adaptation of Ocarina of Time with some changes, including new dungeon challenges, had been developed for the Nintendo 42s ": null
    },
    {
        "42DD": "64dd"
    },
    {
        " peripheral": "peripheral"
    },
    {
        ", but was shelved when that system failed. Ura Zelda was named Ocarina of Time Master Quest in North America and Europe.   Ocarina of Time/Master Quest discs became popular items in their own right in North America, with some customers making and then cancelling preorders to get them. To avoid this issue in Europe, Nintendo released the item only in two-disc packages with The Wind Waker.     In May 42 Nintendo bundled The Wind Waker with limited edition GameCubes in North America and Europe.  On November 42 that year, Nintendo launched another promotion via a ": null
    },
    {
        "compilation disc": "bundled software"
    },
    {
        ", The Legend of Zelda Collectors Edition. The disc includes ports of the ": null
    },
    {
        "original Legend of Zelda": "the legend of zelda"
    },
    {
        ",  Zelda II: The Adventure of Link , Ocarina of Time, and Majoras Mask, as well as a Wind Waker demo and two featurettes. The Collectors Edition was included in another GameCube bundle and was made available to existing GameCube owners who either registered their system or subscribed to  Nintendo Power .             The Wind Waker received widespread critical acclaim.  ": null
    },
    {
        "Review aggregator": "review aggregator"
    },
    {
        " website ": null
    },
    {
        "Metacritic": "metacritic"
    },
    {
        " calculated a score of 42/42 based on 42 reviews, indicating universal acclaim . It was the fourth game to receive a perfect score from the Japanese magazine  Famitsu , and additionally earned perfect scores from  Computer and Video Games ,  Game Informer ,  Game Pro ,  Nintendo Power , and Planet GameCube. It received high marks from many other reviewers as well, although it did not reach the levels of critical acclaim that had greeted Ocarina of Time.     While often noting fans ambivalence about the cel shading, critics praised the games visuals. Reviewers likened the game to a playable cartoon, with several positively comparing the animation to the films of ": null
    },
    {
        "Disney": "disney"
    },
    {
        " and ": null
    },
    {
        "Hayao Miyazaki": "hayao miyazaki"
    },
    {
        ". In particular, critics appreciated the characters unique expressiveness, and found that the fine details and environments added richness to the game world. Famitsus reviewers wrote that the rich design brings all the games elements together into a cohesive whole.  Electronic Gaming Monthly s reviewers found the animation quality unparalleled in games and wrote that The Wind Wakers new look is as effective as it is unique . Matt Casamassina of ": null
    },
    {
        "IGN": "ign"
    },
    {
        " said that though some fans hold distaste for the graphics, Nintendos execution represented the pinnacle of the GameCubes capabilities and of cel shading technology. Jeff Gerstmann of ": null
    },
    {
        "GameSpot": "gamespot"
    },
    {
        " said that skepticism about the visuals was unfounded and wrote that the character design adds emotional weight to the storyline. One Nintendo Power reviewer wrote that though he was initially skeptical, the visuals worked brilliantly, framing the most enjoyable game play experience Ive had since Ocarina of Time .     Critics also lauded the gameplay, in particular the responsive control system, fluid combat, and puzzles. Several reviews noted the similarity of its gameplay to that of Ocarina of Time, though they praised enhancements such as the ability to move the camera, perform counterattacks, and use enemy items. IGN reassured players that beyond visual differences between The Wind Waker and Ocarina, these two games are very much alike . Game Informer wrote that the gameplay expanded upon that in its predecessors to become far greater, deeper, and more complex , while Electronic Gaming Monthly said that Wind Wakers core gameplay is the best the series has ever had . On the other hand,  Edge  said that while the game would awe new players, its similarity to previous Zelda games meant that veteran players may find it merely brilliant. Famitsu wrote that the games user friendliness would appeal even to novice players. IGN praised the intuitive controls, the especially interactive environment, and the variety of game actions, which can be executed with a precision that few other games could offer . GameSpot appreciated the breadth of items that can be used. Electronic Gaming Monthly said that the high variety of options for progressing through fights and puzzles kept the game from ever getting boring.  GamePro s Star Dingo enjoyed the variety of ": null
    },
    {
        "combo attack": "combo attack"
    },
    {
        "s and puzzles, calling the game a combination of vivid artistry and timeless gameplay .     Other elements that commonly received praise include the expansive game world and level design, especially in the dungeons. The storyline also received praise; Nintendo Power called the game a masterpiece of style and storytelling . Several critics lauded the score and soundtrack, though some noted the lack of ": null
    },
    {
        "voice acting": "voice acting"
    },
    {
        " as a drawback.     The games most common criticism is the heavy emphasis on sailing, especially later in the game when Link must trek around the ocean to collect Triforce pieces. ": null
    },
    {
        "GameSpot": "gamespot"
    },
    {
        " wrote that while the main quest starts out in a very brisk manner , by the last third of the game, the focus on sailing ... is pretty tedious . Edge wrote that the sailing was convincingly organic , but even with the warp feature, there remains an awful lot of relatively dull seafaring activity . Others complained about having to use the Wind Waker so frequently to change wind direction. IGN wrote that using the device became a tedious nuisance and that the inability to skip the accompanying animation was more bothersome still . Some reviewers enjoyed the sailing; two Electronic Gaming Monthly reviewers appreciated the combat, exploration, and side quests available at sea. Another common criticism was the games comparatively low level of difficulty. IGN wrote that once the player added enough hearts to Links health meter, he becomes nearly invincible, which is a true shortcoming as far as we concerned .     Several publications named The Wind Waker ": null
    },
    {
        "Game of the Year": "game of the year"
    },
    {
        ", including GameSpot, Nintendo Power, ": null
    },
    {
        "GameFAQs": "gamefaqs"
    },
    {
        ", Planet GameCube, and  Games  magazine. IGN gave it the Readers Choice award for 42 and named it Best Adventure Game for the GameCube.   It received the Excellence in Visual Arts award at the 42 ": null
    },
    {
        "Game Developers Choice Awards": "game developers choice awards"
    },
    {
        " and was a finalist for the GDCA Game of the Year award.  It also won the Outstanding Achievement in Art Direction award at the 42 ": null
    },
    {
        "Interactive Achievement Awards": "interactive achievement awards"
    },
    {
        " and received seven other nominations, including Console Game of the Year.        Player response to the game remained divided over the cel-shaded design.  Reception was comparatively warm in Japan, where various media commonly borrow an ": null
    },
    {
        "anime": "anime"
    },
    {
        " aesthetic, but was much more divided in North America.  Some players appreciated the design and Miyamotos vision, but others found it childish and too far removed from the more realistic designs of previous games. According to ": null
    },
    {
        "Stephen Totilo": "stephen totilo"
    },
    {
        " of  Kotaku , much of the backlash came from anxiety that Nintendo was losing its edge by focusing on games for children, as opposed to the more mature, realistic fare developed by competitors.      The Wind Waker generated the most successful pre-order campaign in Nintendo history at the time.  However, sales did not live up to expectations; director Aonuma noted that purchases were disappointing in both Japan and North America. Japanese sales suffered from a general decline in the video game market caused by consumers shifting away from games, a phenomenon known as gamer drift .  The overall market remained strong in North America, but The Wind Wakers sales were slow there and had declined markedly by the time they reached one million.  The Wind Waker sold 42 million copies, far below the 42 million record set by Ocarina of Time.  Nintendo of America attributed the games comparatively weak North American sales in large part to the cel-shaded graphics, which turned off many players, particularly older teenagers who made up The Legend of Zeldas traditional audience. Miyamoto further blamed a failure to introduce major innovations to excite established players or attract new ones.         Nintendo initially planned a direct sequel for the GameCube, developed by Aonumas Zelda team under the working title Wind Waker 42. However, Wind Wakers underwhelming reception in North America, combined with the downturn in the Japanese video game market, convinced Aonuma that the only avenue to success would be a more realistic Zelda game that would appeal to the stronger North American market. He persuaded Miyamoto, who authorized development of a realistically styled game using the Wind Waker engine,  The Legend of Zelda: Twilight Princess . Twilight Princess proved a major success for the GameCube and the newly released ": null
    },
    {
        "Wii": "wii"
    },
    {
        ".      The Wind Waker originated the variant of the Link character named ": null
    },
    {
        "Toon Link": "toon link"
    },
    {
        " , who appeared in several later Nintendo games. The Wind Waker received two direct sequels for the Nintendo DS handheld system. Wanting to continue The Wind Wakers story and art style, Aonuma produced ": null
    },
    {
        "The Legend of Zelda: Phantom Hourglass": "the legend of zelda: phantom hourglass"
    },
    {
        " in 42 which follows Link and Tetra as they explore new reaches of the Great Sea. ": null
    },
    {
        "The Legend of Zelda: Spirit Tracks": "the legend of zelda: spirit tracks"
    },
    {
        " is set later, with a new Link and Zelda traversing a New Hyrule with a magic train. Toon Link also returned in indirectly related Legend of Zelda games such as Four Swords Adventures , ": null
    },
    {
        "The Minish Cap": "the legend of zelda: the minish cap"
    },
    {
        " , and ": null
    },
    {
        "Tri Force Heroes": "the legend of zelda: tri force heroes"
    },
    {
        " . He also features as a playable character in Nintendos ": null
    },
    {
        "Super Smash Bros.": "super smash bros."
    },
    {
        " crossover fighting game series, and along with other Wind Waker characters, in the 42 Legend of Zelda pastiche ": null
    },
    {
        "Hyrule Warriors Legends": "hyrule warriors legends"
    },
    {
        ".     Conductors of the concert tour ": null
    },
    {
        "The Legend of Zelda: Symphony of the Goddesses": "the legend of zelda: symphony of the goddesses"
    },
    {
        " have used custom-made Wind Waker batons. The Wind Waker also influenced 42s ": null
    },
    {
        "The Legend of Zelda: Breath of the Wild": "the legend of zelda: breath of the wild"
    },
    {
        ", which features a similarly stylized art design, but with more realistic proportions. Breath of the Wild also includes species from The Wind Waker and other references, leading some fans to speculate that it follows The Wind Wakers timeline.       The Wind Waker has continued to be acclaimed by critics. It has appeared in various lists of the best video games , including those compiled by Electronic Gaming Monthly, Nintendo Power, and IGN. Nintendo Power named The Wind Waker the fourth best game to ever appear on a Nintendo console, while ": null
    },
    {
        "Official Nintendo Magazine": "official nintendo magazine"
    },
    {
        " placed it 42th. Nintendo Power listed its ending as one of the greatest in Nintendo history, due to the final battles climax. UGO listed The Wind Waker on their list of the Top 42 Games That Belong On the 42DS . In a retrospective on the GameCube, IGN named The Wind Waker the fourth best game ever released for the system. Nintendo Power named The Wind Waker the second best GameCube game of all time, behind only ": null
    },
    {
        "Resident Evil 42": "resident evil 4"
    },
    {
        ".     Later pieces have noted that The Wind Wakers divisive reputation among fans improved over time and that it has come to be seen as a classic. Several writers have said that the game and its stylized aesthetic aged well, whereas contemporary games with more realistic graphics often became dated. The graphics that initially divided opinion have become a favorite feature; some former skeptics have written about revising their initial opinions. Nintendo representatives describe this turnaround as a particularly dramatic example of the Zelda cycle , in which fans negative responses to Zelda games improve over time. In 42 Keza MacDonald of IGN wrote that The Wind Waker had outlived its initial reception and become popularly considered among the very best Zeldas .           In 42 Nintendo developed a high definition re-release of The Wind Waker, ": null
    },
    {
        "The Legend of Zelda: The Wind Waker HD": "the legend of zelda: the wind waker hd"
    },
    {
        ", for the Wii U . The inspiration came when staff converted elements from various games to explore the systems capabilities in planning a new Legend of Zelda installment. The developers experimented with several Zelda games, but were especially struck by how well The Wind Waker translated into high definition. When the team determined it would take less than a year to remaster the entire game, Aonuma approached Miyamoto about developing it. He faced considerable reluctance from management due to players mixed response in 42 However, Miyamoto greenlit development as Nintendo staff were discussing the Zelda cycle by this time and the fact that opinions of the game had warmed over the years. Aonuma served as producer, while Daiki Iwamoto served as director.     The Wind Waker HD featured high definition graphics and improved lighting. The developers made some changes to the gameplay as well: they introduced a new item, the Swift Sail , allowing for faster sailing on the Great Sea. They also streamlined the Triforce quest, improved the Picto Box, and replaced the Tingle Tuner, which had required connectivity with a Game Boy Advance, with a Tingle Bottle item that connected to the Miiverse prior to its shutdown on November 42 42 The Wind Waker HD was critically acclaimed; ": null
    },
    {
        "review aggregators": "review aggregators"
    },
    {
        " Metacritic": "metacritic"
    },
    {
        " calculated a score of 42/42 based on 42 reviews.  ": null
    }
]