[
    {
        "The Passersby is the 42th episode of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone .       As the episode starts, a group of ": null
    },
    {
        "Civil War": "american civil war"
    },
    {
        " soldiers are walking down a road as ": null
    },
    {
        "Rod Serling": "rod serling"
    },
    {
        " does his narration:          After some dialogue is exchanged by the Sergeant and Lavinia Godwin, Rod Serling resumes his opening narration:            At the end of the ": null
    },
    {
        "Civil War": "american civil war"
    },
    {
        ", a ": null
    },
    {
        "Confederate Army": "confederate states army"
    },
    {
        " Sergeant": "sergeant"
    },
    {
        " , apparently wounded in battle, walks down a road aided by a wooden crutch. He carries with him a dirty bed roll and a homemade guitar. The Sergeant limps comes across a ruined ": null
    },
    {
        "antebellum": "antebellum south"
    },
    {
        " mansion which belongs to Lavinia Godwin , whose husband had gone off to fight in the war and whose bitterness towards the ": null
    },
    {
        "Union": "union"
    },
    {
        " still survives.     The Sergeant receives permission from Lavinia to refresh himself at the well, and then to sit on a bench under a dead tree in her front yard. He plays his guitar, singing a song that Lavinia identifies as one that her husband used to sing. The two watch as a steady stream of soldiers, belonging to both the Union and the ": null
    },
    {
        "Confederacy": "confederate states of america"
    },
    {
        ", pass by the house and continue on down the road. The Sergeant learns that Lavinia has been very ill, and that her husband was killed in battle.     The Sergeant begins to realize that this is not a normal road, and these are not just wounded soldiers. He tells Lavinia that there is something at the end of the road, and that he has to find out what it is. As the Sergeant turns to leave, Lavinia moves in front of him and tries to persuade him to stay. Suddenly they hear a mans voice singing a familiar song. The man is Lavinias husband, Jud.     Jud tells Lavinia that everyone on the road is indeed dead—including her. The Sergeant, understanding now, walks down the road, but Lavinia refuses to believe that it is true. Jud tells her that there is nothing left for him in that house. Insisting that she is alive, Lavinia pleads with Jud to stay. Jud refuses and continues his journey, disregarding her pleas. As he leaves, Jud tells Lavinia that he will be waiting for her at the end of the road.     Lavinia cries out to her husband, imploring him to stay. Then she hears a soft voice trying to comfort her. It is a lone passerby who turns out to be ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        ", who, as the ": null
    },
    {
        "final casualty of the war": "assassination of abraham lincoln"
    },
    {
        ", is the last man on the road. Frightened, Lavinia backs away from him, but finally accepts her fate and runs to join her husband, with Lincoln following behind her.        ": null
    },
    {
        "James Gregory": "james gregory"
    },
    {
        " as The Sergeant   ": null
    },
    {
        "Joanne Linville": "joanne linville"
    },
    {
        " as Lavinia Godwin   ": null
    },
    {
        "Warren Kemmerling": "warren kemmerling"
    },
    {
        " as Jud Godwin   ": null
    },
    {
        "Rex Holman": "rex holman"
    },
    {
        " as Charlie Constable   ": null
    },
    {
        "David Garcia": "david garcia"
    },
    {
        " as Union Lieutenant   ": null
    },
    {
        "Austin Green": "austin green"
    },
    {
        " as ": null
    },
    {
        "Abraham Lincoln": "abraham lincoln"
    },
    {
        "          The traditional folk song ": null
    },
    {
        "Black Is the Color ": "black is the color"
    },
    {
        " is featured prominently throughout this episode.     Elements of the episode are re-made in an episode of the ": null
    },
    {
        "42 revival": "the twilight zone"
    },
    {
        " named, Homecoming . In this episode, a soldier returns from Iraq to repair his relationship with his son. We find out that the soldier is dead.     The closing titles image is of the road upon which the eponymous passersby walk.     The ": null
    },
    {
        "radio adaptation": "the twilight zone"
    },
    {
        " of this episode starred ": null
    },
    {
        "Morgan Brittany": "morgan brittany"
    }
]