[
    {
        "              The A-Team is an American ": null
    },
    {
        "action-adventure": "adventure film"
    },
    {
        " television series that ran on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " from 1983 to 1987 about former members of a fictitious ": null
    },
    {
        "United States Army Special Forces": "special forces"
    },
    {
        " unit. The members, after being ": null
    },
    {
        "court-martial": "court-martial"
    },
    {
        "ed for a crime they didnt commit , escaped from ": null
    },
    {
        "military prison": "military prison"
    },
    {
        " and, while still on the run, worked as ": null
    },
    {
        "soldiers of fortune": "mercenary"
    },
    {
        ". The series was created by ": null
    },
    {
        "Stephen J. Cannell": "stephen j. cannell"
    },
    {
        " and ": null
    },
    {
        "Frank Lupo": "frank lupo"
    },
    {
        ". A ": null
    },
    {
        "feature film": "the a-team"
    },
    {
        " based on the series was released by ": null
    },
    {
        "20th Century Fox": "20th century fox"
    },
    {
        " in 2010.       The A-Team was created by writers and producers ": null
    },
    {
        "Stephen J. Cannell": "stephen j. cannell"
    },
    {
        " and ": null
    },
    {
        "Frank Lupo": "frank lupo"
    },
    {
        " at the behest of ": null
    },
    {
        "Brandon Tartikoff": "brandon tartikoff"
    },
    {
        ", NBCs Entertainment president. Cannell was fired from ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        " in the early 1980s, after failing to produce a hit show for the network, and was hired by NBC; his first project was The A-Team. ": null
    },
    {
        "Brandon Tartikoff": "brandon tartikoff"
    },
    {
        " pitched the series to Cannell as a combination of  The Dirty Dozen ,  Mission Impossible ,  The Magnificent Seven ,  Mad Max  and  Hill Street Blues , with ": null
    },
    {
        "Mr. T": "mr. t"
    },
    {
        " driving the car .    Stephen J. Cannell on The A-Team Season Five DVD boxset.     The A-Team was not generally expected to become a hit, although Stephen J. Cannell has said that ": null
    },
    {
        "George Peppard": "george peppard"
    },
    {
        " suggested it would be a huge hit before we ever turned on a camera .  The show became very popular; the first regular episode, which aired after ": null
    },
    {
        "Super Bowl XVII": "super bowl xvii"
    },
    {
        " on January 30, 1983, reached 26.4% of the television audience, placing fourth in the top 10 ": null
    },
    {
        "Nielsen-rated": "nielsen ratings"
    },
    {
        " shows.      The show remains prominent in ": null
    },
    {
        "popular culture": "popular culture"
    },
    {
        " for its ": null
    },
    {
        "cartoon": "cartoon"
    },
    {
        "ish violence , formulaic episodes, its characters ability to form weaponry and vehicles out of old parts, and its distinctive theme tune. The show boosted the career of ": null
    },
    {
        "Mr. T": "mr. t"
    },
    {
        ", who portrayed the character of ": null
    },
    {
        "B. A. Baracus": "b. a. baracus"
    },
    {
        ", around whom the show was initially conceived.  Bring Back... The A-Team , Mr. T. Broadcast on May 18, 2006.  Some of the shows catchphrases, such as I love it when a plan comes together , Ranked 96 in TV Lands list of  . Retrieved on August 17, 2007 Hannibals on the jazz , and I aint gettin on no plane! have also made their way onto T-shirts and other merchandise.     The term ": null
    },
    {
        "A-Team": "a-team"
    },
    {
        " is a nickname coined for ": null
    },
    {
        "U.S. Special Forces": "green berets"
    },
    {
        " Operational Detachments Alpha during the Vietnam War. The ": null
    },
    {
        "US Army Special Forces": "us army special forces"
    },
    {
        " still uses the term ODA for their 12-man direct operations teams.     In a 2003 Yahoo! survey of 1,000 television viewers, The A-Team was voted the oldie television show viewers would most like to see revived, beating out such popular television series from the 1980s as  The Dukes of Hazzard  and  Knight Rider . A-Team is viewers most-wanted oldie for prime-time revival by Matthew Beard in Independent, The , published on October 23, 2003.            The A-Team is a naturally episodic show, with few overarching stories, except the characters continuing motivation to clear their names, with few references to events in past episodes and a recognizable and steady episode structure. In describing the ratings drop that occurred during the shows fourth season, reviewer Gold Burt points to this structure as being a leading cause for the decreased popularity because the same basic plot had been used over and over again for the past four seasons with the same predictable outcome .  Similarly, reporter Adrian Lee called the plots stunningly simple in a 2006 article for  The Express  , citing such recurring elements as BAs fear of flying, and outlandish finales when the team fashioned weapons from household items .  The show became emblematic of this kind of fit-for-TV warfare due to its depiction of high-octane ": null
    },
    {
        "combat": "combat"
    },
    {
        " scenes, with lethal weapons, wherein the participants are never killed and rarely seriously injured .     As the television ratings of The A-Team fell dramatically during the fourth season, the format was changed for the shows final season in 1986–": null
    },
    {
        "87": "1987 in american television"
    },
    {
        " in a bid to win back viewers. After years on the run from the authorities, the A-Team is finally apprehended by the military. General Hunt Stockwell, a mysterious CIA operative played by ": null
    },
    {
        "Robert Vaughn": "robert vaughn"
    },
    {
        ", propositions them to work for him, whereupon he will arrange for their pardons upon successful completion of several suicide missions. In order to do so, the A-Team must first escape from their captivity. With the help of a new character, Frankie Dishpan Man Santana, Stockwell fakes their deaths before a military firing squad. The new status of the A-Team, no longer working for themselves, remained for the duration of the fifth season while ": null
    },
    {
        "Eddie Velez": "eddie velez"
    },
    {
        " and ": null
    },
    {
        "Robert Vaughn": "robert vaughn"
    },
    {
        " received star billing along with the principal cast. The missions that the team had to perform in season five were somewhat reminiscent of  Mission: Impossible , and based more around political espionage than beating local thugs, also usually taking place in foreign countries, including successfully overthrowing an island dictator, the rescue of a scientist from East Germany, and recovering top secret Star Wars defense information from Soviet hands. These changes proved unsuccessful with viewers, however, and ratings continued to decline. Only 13 episodes aired in the fifth season. In what was supposed to be the final episode, ": null
    },
    {
        "The Grey Team": "the grey team"
    },
    {
        " , Hannibal, after being misled by Stockwell one time too many, tells him that the team will no longer work for him. At the end, the team discusses what they were going to do if they get their pardon, and it is implied that they would continue doing what they were doing as the A-Team. The character of Howling Mad Murdock can be seen in the final scene wearing a T-shirt that says, Fini .       During the Vietnam War, the A-Team were members of the ": null
    },
    {
        "5th Special Forces Group": "5th special forces group"
    },
    {
        " . In the episode ": null
    },
    {
        "Bad Time on the Border": "bad time on the border"
    },
    {
        " , Colonel John Hannibal Smith, portrayed by George Peppard, indicated that the A-Team were ex-Green Berets . During the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", the A-Teams ": null
    },
    {
        "commanding officer": "commanding officer"
    },
    {
        ", Colonel Morrison, gave them orders to rob the Bank of ": null
    },
    {
        "Hanoi": "hanoi"
    },
    {
        " to help bring the war to an end. They succeeded in their mission, but on their return to base four days after the end of the war, they discovered that Morrison had been killed by the ": null
    },
    {
        "Viet Cong": "national front for the liberation of vietnam"
    },
    {
        ", and that his headquarters had been burned to the ground. This meant that the proof that the A-Team members were ": null
    },
    {
        "acting under orders": "superior orders"
    },
    {
        " had been destroyed. They were arrested, and imprisoned at ": null
    },
    {
        "Fort Bragg": "fort bragg"
    },
    {
        ", from which they quickly escaped before standing trial.     The origin of the A-Team is directly linked to the ": null
    },
    {
        "Vietnam War": "vietnam war"
    },
    {
        ", during which the team formed. The shows introduction in the first four seasons mentions this, accompanied by images of soldiers coming out of a helicopter in an area resembling a forest or jungle. Besides this, The A-Team would occasionally feature an episode in which the team came across an old ally or enemy from those war days. For example, the first seasons final episode ": null
    },
    {
        "A Nice Place To Visit": "a nice place to visit"
    },
    {
        " revolved around the team traveling to a small town to honor a fallen comrade and end up avenging his death, and in season twos ": null
    },
    {
        "Recipe For Heavy Bread": "recipe for heavy bread"
    },
    {
        " , a chance encounter leads the team to meet both the POW cook who helped them during the war, and the American officer who sold his unit out.     An article in the  New Statesman  published shortly after the premiere of The A-Team in the United Kingdom, also pointed out The A-Teams connection to the Vietnam War, characterizing it as the representation of the idealization of the Vietnam War, and an example of the war slowly becoming accepted and assimilated into American culture.      One of the teams primary antagonists, Col. Roderick Decker , had his past linked back to the Vietnam War, in which he and Hannibal had come to fisticuffs in the DOOM Club . ": null
    },
    {
        "When You Comin Back, Range Rider? ": "when you comin back, range rider?"
    },
    {
        " , broadcast on October 25, 1983. At other times, members of the team would refer back to a certain tactic used during the War, which would be relevant to the teams present predicament. Often, Hannibal would refer to such a tactic, after which the other members of the team would complain about its failure during the War. This was also used to refer to some of Faces past accomplishments in scamming items for the team, such as in the first-season episode ": null
    },
    {
        "Holiday In The Hills": "holiday in the hills"
    },
    {
        " , in which Murdock fondly remembers Face being able to secure a 53 Cadillac while in the Vietnam jungle.     The teams ties to the Vietnam War were referred to again in the fourth-season finale, ": null
    },
    {
        "The Sound of Thunder": "the sound of thunder"
    },
    {
        " , in which the team is introduced to Tia , a war orphan and daughter of fourth season antagonist General Fulbright. Returning to Vietnam, Fulbright is shot in the back and gives his last words as he dies. The 2006 documentary Bring Back The A-Team joked that the scene lasted seven and a half minutes, but his death actually took a little over a minute. His murderer, a Vietnamese colonel, is killed in retaliation. Tia then returns with the team to the United States . This episode is notable for having one of the shows few truly serious dramatic moments, with each team member privately reminiscing on their war experiences, intercut with news footage from the war with ": null
    },
    {
        "Barry McGuires": "barry mcguire"
    },
    {
        "  Eve of Destruction  playing in the background.     The shows ties to the Vietnam War are fully dealt with in the opening arc of the fifth season, dubbed The Court-Martial , in which the team is finally court-martialed for the robbery of the bank of ": null
    },
    {
        "Hanoi": "hanoi"
    },
    {
        ". The character of Roderick Decker makes a return on the witness stand, and various newly introduced characters from the A-Teams past also make appearances. The team, after a string of setbacks, decides to plead guilty to the crime and they are sentenced to be executed. They escape this fate and come to work for a General Hunt Stockwell, leading into the remainder of the fifth season.            The show ran for five seasons on the ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " television network, from January 23, 1983 to December 30, 1986 , for a total of 98 episodes.               The A-Team revolves around the four members of a former commando outfit, now mercenaries. Their leader is Lieutenant Colonel/Colonel ": null
    },
    {
        "John Hannibal Smith": "john   hannibal   smith"
    },
    {
        " , whose plans tend to be unorthodox but effective. Lieutenant ": null
    },
    {
        "Templeton Peck": "templeton peck"
    },
    {
        " , usually called Face or Faceman , is a smooth-talking con man who serves as the teams appropriator of vehicles and other useful items, as well as the teams second-in-command. The teams pilot is Captain ": null
    },
    {
        "H.M. Howling Mad Murdock": "howling mad murdock"
    },
    {
        " , who has been declared insane and lives in a ": null
    },
    {
        "Veterans Administration": "united states department of veterans affairs"
    },
    {
        " mental institution for the shows first four seasons. Finally, there is the teams strong man, mechanic and Sergeant First Class ": null
    },
    {
        "Bosco B.A. , or Bad Attitude , Baracus": "b. a. baracus"
    },
    {
        " .     The team belonged to the 5th Special Forces as seen in the left side shoulder patch on Hannibals uniform in the episode A Nice Place to Visit. A patch on Hannibals uniform on the right shoulder in the episode ": null
    },
    {
        "A Nice Place To Visit": "a nice place to visit"
    },
    {
        " indicates he belonged to the ": null
    },
    {
        "101st Airborne": "101st airborne"
    },
    {
        " during a prior combat assignment, but that patch was replaced by the 1st Air Cavalry Division patch in the episode ": null
    },
    {
        "Trial by Fire": "trial by fire"
    },
    {
        " . The patch worn on the left sleeve according to uniform wear in the Army is the current assignment of the person wearing it and in the episode A Nice Place to Visit shows that the team was assigned to the Special Forces with a tab Airborne over the shoulder patch. Also their berets in that episode are green and have the tab of the 5th Special Forces in Vietnam on them. In the episode ": null
    },
    {
        "West Coast Turnaround": "west coast turnaround"
    },
    {
        " , Hannibal stated they were with the 5th Special Forces Group. Then, in episode ": null
    },
    {
        "Bad Time on the Border": "bad time on the border"
    },
    {
        " , Hannibal refers to his friends as ex-Green Berets . Though the name they have adopted comes from the A-Teams , the nickname coined for Special Forces Operational Detachments Alpha, these detachments usually consisted of twelve members; whether the four were considered a detachment of their own or had once had eight compatriots who were killed in action was never revealed. In the episode A Nice Place to Visit Ray Brenner is stated to have been a Major and part of Hannibals team in Vietnam.     For its first season and the first half of the second season, the team was assisted by reporter Amy Amanda Allen . In the second half of the second season, Allen was replaced by fellow reporter Tawnia Baker . The character of Tia , a Vietnam war orphan now living in the United States, was meant to join the Team in the fifth season, For NBC, Trouble At A-Team,  The New York Times , May 18, 1986, written by Aljean Harmetz. but she was replaced by Frankie Santana , who served as the teams special effects expert. Velez was added to the opening credits of the fifth season after its second episode.     During their adventures, the A-Team was constantly met by opposition from the ": null
    },
    {
        "Military Police": "military police corps"
    },
    {
        ". In the shows first season, the MPs were led by Colonel Francis Lynch , but he was replaced for the second, third, and earlier fourth season by Colonel Roderick Decker  and his aide Captain Crane . Lynch returned for one episode in the shows third season  but was not seen after. Decker was also briefly replaced by a Colonel Briggs  in the third season for one episode  when LeGault was unavailable, but returned shortly after. For the latter portion of the shows fourth season, the team was hunted by General Harlan Bull Fulbright , who would later hire the A-Team to find Tia in the season four finale, during which Fulbright was killed.     The fifth season introduced General Hunt Stockwell  who, while serving as the teams primary antagonist, was also the teams boss and joined them on several missions. He was often assisted by Carla .       John Hannibal Smith is a master of disguise. His most used disguise is Mr. Lee, the dry cleaner. This is one of the final parts of the client screening process, as he tells the client where to go in order to make full contact with the A-Team. He dresses most often in a tan safari jacket and black leather gloves. He also is constantly seen smoking a cigar. Hannibal carries either a ": null
    },
    {
        "Browning Hi-Power": "browning hi-power"
    },
    {
        ", ": null
    },
    {
        "Colt M1911A1": "colt m1911a1"
    },
    {
        " or a ": null
    },
    {
        "Smith & Wesson Model 39": "smith  &  wesson model 39"
    },
    {
        " as a sidearm, most often Mexican carried although he uses a holster when on missions. His catchphrase is I love it when a plan comes together . Often said, usually by B.A., to be on the jazz when in the fury of completing a mission.     Templeton Faceman Peck is a master of the persuasive arts. The teams scrounger, he can get virtually anything he sets his mind to, usually exploiting women with sympathy-appeal and flirtation. He grew up an orphan, and is not without integrity, as stated by Murdock in the episode ": null
    },
    {
        "Family Reunion": "family reunion"
    },
    {
        " : He would rip the shirt off his back for you, and then scam one for himself. Faceman is also the A-Teams accountant. He dresses suavely, often appearing in suits. Faceman carries a ": null
    },
    {
        "Colt Lawman Mk III": "colt trooperlawman"
    },
    {
        " revolver for protection, and drives a custom white 1984 ": null
    },
    {
        "Corvette": "chevrolet corvette"
    },
    {
        " with red trim.     Bosco B.A. Baracus is the muscle for the A-Team, able to perform exceptional feats of strength. He is also the teams mechanic. Baracus affects a dislike for Murdock, calling him a crazy fool , but his true feelings of friendship are revealed when he prevents Murdock from drowning in his desire to live like a fish. Baracus also has a deep fear of flying, and the others usually have to trick and/or knock him out in order to get him on an aircraft. It is very rare that Baracus is awake while flying, and even rarer for him actually to consent to it. When he does, however, he then goes into a catatonic state. Baracus generally wears overalls and leopard or tiger print shirts in the early seasons, and wears a green jumpsuit in the later seasons. He is almost always seen with many gold chains and rings on every finger, and also wears a weightlifting belt. Baracus hairstyle is always in a mohawk-like cut. He drives a customized black GMC van that acts as the teams usual mode of transport.     H.M. Howling Mad Murdock is the A-Teams pilot, and can fly any kind of aircraft with considerable skill. However, due to a helicopter crash in Vietnam, Murdock apparently went insane. He lives in a Veterans Hospital in the mental wing. Whenever the rest of the team requires a pilot, they have to break him out of the hospital, generally using Faceman to do so. In Seasons 1–4, Murdock has a different pet, imaginary friend, or alter-ego in each episode. Whenever one of his pets or imaginary friends is killed by an enemy, Murdock snaps and takes revenge . Many times, when Baracus is mad at Murdock for being crazy, Hannibal will side with Murdock in a sympathetic way. Once he is discharged from the hospital in Season 5, Murdock has a different job each episode. Murdock usually wears a leather flight jacket, a baseball cap, and basketball sneakers.       Although the part of Face was written by Frank Lupo and Stephen J. Cannell with Dirk Benedict in mind, NBC insisted that the part should be played by another actor, instead. Therefore, in the pilot, Face was portrayed by ": null
    },
    {
        "Tim Dunigan": "tim dunigan"
    },
    {
        ", who was later replaced by Dirk Benedict, with the comment that Dunigan was too tall and too young .  According to Dunigan: I look even younger on camera than I am. So it was difficult to accept me as a veteran of the Vietnam War, which ended when I was a sophomore in high school.      ": null
    },
    {
        "Tia Carrere": "tia carrere"
    },
    {
        " was intended to join the principal cast of the show in its fifth season after appearing in the season four finale, providing a tie to the teams inception during the war. Unfortunately for this plan, Carrere was under contract to  General Hospital , which prevented her from joining The A-Team. Her character was abruptly dropped as a result.     According to Mr. Ts account in Bring Back... The A-Team in 2006, the role of B. A. Baracus was written specifically for him. This is corroborated by Stephen J. Cannells own account of the initial concept proposed by Tartikoff.     ": null
    },
    {
        "James Coburn": "james coburn"
    },
    {
        ", who co-starred in  The Magnificent Seven , was considered for the role of Hannibal in The A-Team, while ": null
    },
    {
        "George Peppard": "george peppard"
    },
    {
        " was the original consideration for the role of Vin  in The Magnificent Seven.  Bring Back... The A-Team . Broadcast on May 18, 2006. ": null
    },
    {
        "Robert Vaughn": "robert vaughn"
    },
    {
        ", of course, actually appeared in the film.              Notable guest stars included:   ": null
    },
    {
        "Dean Stockwell": "dean stockwell"
    },
    {
        " as Officer Collins in A Small & Deadly War .   ": null
    },
    {
        "Wendy Fulton": "wendy fulton"
    },
    {
        " as Kelly Stevens in Bounty . Fulton and ": null
    },
    {
        "Dwight Schultz": "dwight schultz"
    },
    {
        " had married a few years before the episode, and the episode plays on the theme of Kelly and Murdock falling in love.   ": null
    },
    {
        "Boy George": "boy george"
    },
    {
        " as himself in Cowboy George .   ": null
    },
    {
        "Isaac Hayes": "isaac hayes"
    },
    {
        " as C.J. Mack in The Heart of Rock n Roll .   ": null
    },
    {
        "Hulk Hogan": "hulk hogan"
    },
    {
        " as himself in Body Slam and The Trouble With Harry . In Body Slam , other ": null
    },
    {
        "WWF": "wwe"
    },
    {
        " wrestlers such as ": null
    },
    {
        "The British Bulldogs": "the british bulldogs"
    },
    {
        " and ": null
    },
    {
        " Mr Wonderful Paul Orndorff": "paul orndorff"
    },
    {
        " also made cameo appearances.   ": null
    },
    {
        "Rick James": "rick james"
    },
    {
        " as himself in The Heart of Rock n Roll .   ": null
    },
    {
        "David McCallum": "david mccallum"
    },
    {
        " as Ivan Trigorin in The Say U.N.C.L.E. Affair . McCallum guest stars as a former associate of ": null
    },
    {
        "Robert Vaughns": "robert vaughn"
    },
    {
        "character General Stockwell. Vaughn and McCallum had co-starred together as friendly ": null
    },
    {
        "American": "napoleon solo"
    },
    {
        " and ": null
    },
    {
        "Russian": "illya kuryakin"
    },
    {
        " secret agents in  The Man from U.N.C.L.E. . This The A-Team episode sent up many aspects of the classic series, such as Stockwell saying Open Channel D .   ": null
    },
    {
        "Joe Namath": "joe namath"
    },
    {
        " as T. J. Bryant in Quarterback Sneak , season 5, episode 4.   ": null
    },
    {
        "William The Refrigerator Perry": "william perry"
    },
    {
        " as himself in The Trouble With Harry .   ": null
    },
    {
        "Markie Post": "markie post"
    },
    {
        " as Rina Turian in Hot Styles and Sister Teresa/Leslie Becktall in The Only Church in Town .   ": null
    },
    {
        "Pat Sajak": "pat sajak"
    },
    {
        " as himself in Wheel of Fortune .   ": null
    },
    {
        "Vanna White": "vanna white"
    },
    {
        " as herself in Wheel of Fortune .   ": null
    },
    {
        "Yaphet Kotto": "yaphet kotto"
    },
    {
        " as Charles F. Struthers in The Out of Towners .   ": null
    },
    {
        "Shecky Greene": "shecky greene"
    },
    {
        " as himself roasting Gen. Harlan Bull Fulbright, in Members Only .   ": null
    },
    {
        "Della Reese": "della reese"
    },
    {
        " as Mrs. Baracus in A Lease with an Option to Die .   ": null
    },
    {
        "Steven Keats": "steven keats"
    },
    {
        " in the episode Harder than it Looks before co-starring in  All My Children .   ": null
    },
    {
        "Professor Tanaka": "professor tanaka"
    },
    {
        " in episode The Spy Who Mugged Me       During the shows first three seasons, The A-Team managed to pull in 17% to 20% of the American households on average. The first regular episode , reached 26.4% of the television watching audience, placing fourth in the top 10 rated shows, according to the ": null
    },
    {
        "Nielsen ratings": "nielsen ratings"
    },
    {
        ". By March, The A-Team, now on its regular Tuesday timeslot, dropped to the eight spot, but rated a 20.5%.  During the ": null
    },
    {
        "sweeps": "sweeps"
    },
    {
        " week in May of that year, The A-Team dropped again but remained steady at 18.5%,  and rose to 18.8% during the second week of May sweeps.  These were the highest ratings NBC had achieved in five years.  During the second season, the ratings continued to soar, reaching third place in the twenty-highest rated programs, behind  Dallas  and  Simon & Simon , in January ,  while during the third season, it was beaten out only by four other NBC shows, including  The Cosby Show .     The fourth season saw The A-Team experience a dramatic fall in ratings, as it started to lose its position while television viewership increased. As such, the ratings, while stable, were relatively less. The season premiere ranked a 17.4% on the Nielsen Rating scale,  but after ratings quickly declined. In October, The A-Team had fallen to the 19th and by Super Bowl Night had fallen still to 29th the night on which the show had originally scored its first hit three years before.  For the remainder of its fourth season The A-Team managed to hang around the 20th spot, far from original top 10 position it had enjoyed during its first three seasons.     After four years on Tuesday, NBC decided to move The A-Team to a new timeslot on Friday for what would be its final season. Ratings continued to drop, and after seven episodes, The A-Team fell out of the top 50 altogether with a 13.3 Nielsen Rating.  In November 1986, NBC cancelled the series, declining to order the last nine episodes of what would have been a 22-episode season.              The series has achieved ": null
    },
    {
        "cult status": "cult television"
    },
    {
        " through heavy ": null
    },
    {
        "syndication": "television syndication"
    },
    {
        " in the U.S. and internationally. It has also remained popular overseas, such as in the United Kingdom, since it was first shown in July 1983. It is airing on satellite and cable channel ": null
    },
    {
        "Esquire Network": "esquire network"
    },
    {
        ". The series was to begin airing over NBC-TVs ": null
    },
    {
        "OTA digital subchannel": "digital television"
    },
    {
        " network, ": null
    },
    {
        "Cozi TV": "cozi tv"
    },
    {
        ", in January 2016.  Forces TV started showing the series every weekday since October 17, 2016. The series has been airing in Spanish on Telemundo-TVs OTA digital subchannel network, ": null
    },
    {
        "TeleXitos": "telexitos"
    },
    {
        " since December 2014. The series is currently available through ": null
    },
    {
        "Starz": "starz"
    },
    {
        ", ": null
    },
    {
        "ELREY": "elrey"
    },
    {
        ", ": null
    },
    {
        "Tubi": "tubi"
    },
    {
        ", and ": null
    },
    {
        "COZY TV": "cozy tv"
    },
    {
        ".       The A-Team has been broadcast all over the world; international response has been varied. In 1984, the main cast members of The A-Team, George Peppard, Mr. T, Dirk Benedict and Dwight Schultz were invited to the Netherlands. George Peppard was the first to receive the invitation and thus thought the invitation applied only to him. When the other cast members were also invited, Peppard declined, leaving only Mr. T, Benedict and Schultz to visit the Netherlands. As told by Dirk Benedict in  Jensen! , a Dutch talk show, broadcast on May 11, 2007. The immense turn-out for the stars was unforeseen, and they were forced to leave early as a security measure. A video was released with the present actors in which Dwight Schultz apologized and thanked everyone that had attended. Repeated showing on Jensen!, a Dutch talk show, broadcast on May 11, 2007.     In Australia The A-Team was broadcast on Channel Ten. From 2010 ": null
    },
    {
        "7mate": "7mate"
    },
    {
        " has been showing reruns of show. The show was broadcast in New Zealand on TV2. In Brazil, the series was broadcast on ": null
    },
    {
        "SBT": "sistema brasileiro de televisão"
    },
    {
        " from 1984 to 1989, later moving to ": null
    },
    {
        "Rede Globo": "rede globo"
    },
    {
        " in the early 1990s. In the UK, the program was shown on ": null
    },
    {
        "ITV": "itv"
    },
    {
        ", starting on Friday, July 22, 1983; when it returned for its second run it moved to Saturday evenings. The series continued to be repeated on ITV until 1994. The series was later repeated on ": null
    },
    {
        "UK Gold": "uk gold"
    },
    {
        " from 1997 through 2007 at various times. It was also repeated on ": null
    },
    {
        "Bravo": "bravo"
    },
    {
        " from 1997 to 1999. It returned to the channel in 2008 until the channels closure in 2011. In 2017 the digital channel ": null
    },
    {
        "Spike": "spike"
    },
    {
        " began showing the series from the beginning. ": null
    },
    {
        "Channel 5": "channel 5"
    },
    {
        " also repeated it in 2017. Although ratings soared during its early seasons, many television critics described the show largely as cartoonish and thereby wrote the series off. Most reviews focused on acting and the formulaic nature of the episodes, most prominently the absence of actual killing in a show about Vietnam War veterans.     The show was a huge hit in Italy in the mid-1980s to the 1990s.                The violence presented in The A-Team is highly sanitized. People do not bleed or bruise when hit , nor do the members of the A-Team kill people. The results of violence were only ever presented when it was required for the script. In almost every car crash there is a short take showing the occupants of the vehicle climbing out of the mangled or burning wreck, even in helicopter crashes. However, more of these types of takes were dropped near the end of the fourth season. According to Stephen J. Cannell, this part of the show did become a running joke for the writing staff and they would at times test the limits of realism on purpose.  Bring Back... The A-Team , Stephen J. Cannell. Broadcast on May 18, 2006.     The show has been described as cartoonish and likened to  Tom and Jerry . Dean P. of the  Courier-Mail  described the violence in the show as hypocritical and that the morality of giving the impression that a hail of bullets does no-one any harm is ignored. After all, Tom and Jerry survived all sorts of mayhem for years with no ill-effects.  Television reviewer ": null
    },
    {
        "Ric Meyers": "ric meyers"
    },
    {
        " joked that the A-Team used ": null
    },
    {
        "antineutron": "antineutron"
    },
    {
        " bullets—they destroy property for miles around, but never harm a human being . ": null
    },
    {
        "DeAndrea, William L.": "william l. deandrea"
    },
    {
        " . Encyclopedia Mysteriosa, p. 1. MacMillan, 1994, . According to certain estimates, an episode of the A-Team held up to 46 violent acts. Stephen J. Cannell, co-creator of the show responds: They were determined to make a point, and we were too big a target to resist. Cartoon violence is a scapegoat issue. Originally, The A-Teams status as a hit show remained strong, but it ultimately lost out to more family-oriented shows such as  The Cosby Show ,  Whos the Boss?  and  Growing Pains . John J. OConnor of  The New York Times  wrote in a 1986 article that ...a substantial number of viewers, if the ratings in recent months are to be believed, are clearly fed up with mindless violence of the car-chasing, fist-slugging variety .           During its tenure, the show was occasionally criticized for being sexist. These critiques were based on the notion that most female roles on the show were either a lead-in to the episodes plot, the recipient of Faces affections, or both. The only two regular female members of the cast, Melinda Culea and Marla Heasley did not have long tenures with the show. Both Culea and Heasley had been brought in by the network and producers to stem these critiques, hoping that a female character would properly balance the otherwise all-male cast.  Bring Back... The A-Team , ": null
    },
    {
        "Marla Heasley": "marla heasley"
    },
    {
        ". Broadcast on May 18, 2006. Culea was fired during the second season because of creative differences between her and the shows writers; she wanted more lines and more action scenes.  Bring Back... The A-Team , ": null
    },
    {
        "Dirk Benedict": "dirk benedict"
    },
    {
        ". Broadcast on May 18, 2006. Culeas character of Amy Allen suddenly disappeared between two episodes, and was only briefly referred to once in the episode In Plane Sight , and a couple of times in The Battle of Bel Air in which she was cited to have taken a correspondence job overseas . The latter episode also introduced Heasleys character, Tawnia Baker. The new character was also an assisting reporter character, but with a more fragile and seductive quality to her. Ultimately, she was written out of the show at the start of the third season when the network determined that a female cast member was not necessary. Tawnia left the team on-screen, choosing to marry and move out of Los Angeles.     As Marla Heasley recounts in  Bring Back... The A-Team  , although sexism was not prevalent on the set per se, there was a sense that a female character was not necessary on the show. On her first day on set George Peppard took her aside and told her We dont want you on the show. None of the guys want you here. The only reason youre here is because the network and the producers want you. For some reason they think they need a girl. The interview continues with Heasley noting that on her last day of work Peppard took her aside again, saying: Im sorry that this is your last day, but remember what I said the very first day, that we didnt want a girl, has nothing to do with you. You were very professional, but no reason to have a girl. In Bring Back... the A-Team, ": null
    },
    {
        "Dirk Benedict": "dirk benedict"
    },
    {
        " also remarked that: It was a guys show. It was male driven. It was written by guys. It was directed by guys. It was acted by guys. Its about what guys do. We talked the way guys talked. We were the boss. We were the God. We smoked when we wanted. We shot guns when we wanted. We kissed the girls and made them cry... when we wanted. It was the last truly masculine show.          The 1983 ": null
    },
    {
        "GMC Vandura": "chevrolet van1983"
    },
    {
        " van used by the A-Team, with its characteristic red stripe, black and red turbine mag wheels, and rooftop spoiler,  has become an enduring ": null
    },
    {
        "pop culture": "pop-culture"
    },
    {
        " icon. The customized 1994 Chevrolet G20 used on ": null
    },
    {
        "the A-Team movie": "the a-team"
    },
    {
        " was also on display at the 2010 ": null
    },
    {
        "New York International Auto Show": "new york international auto show"
    },
    {
        ".      A number of devices were seen in the back of the van in different episodes, including a mini printing press , an audio surveillance recording device , Hannibals disguise kits in various episodes, and a gun storage locker.     Early examples of the van had a red GMC logo on the front grille, and an additional GMC logo on the rear left door. Early in the second season, these logos were blacked out, although GMC continued to supply vans and receive a credit on the closing credits of each episode.     The van was almost all-black, as the section above the red stripe was metallic gray. The angle of the rear spoiler can also be seen to vary on different examples of the van within the series. Additionally, some versions of the van have a sunroof, whereas others, typically those used for stunts do not. This led to continuity errors in some episodes, such as in the third seasons The Bells of St. Marys , in a scene where Face jumps from a building onto the roof of the van with no sunroof but moments later, in an interior studio shot, climbs in through the sunroof.       The huge success of the series saw a vast array of merchandise, including toys and snacks released both in America and internationally. There were several sets of trading cards and stickers, action figures of the characters were produced by ": null
    },
    {
        "Galoob": "galoob"
    },
    {
        " as well as vehicles, including B.A.s van and Faces Corvette , as well as items such as helicopters, trucks and jeeps to fit in with the line, from model car manufacturer ": null
    },
    {
        "Ertl": "ertl company"
    },
    {
        ". Some of the other array of items available included jigsaw puzzles, ": null
    },
    {
        "View-Master": "view-master"
    },
    {
        " reels containing 21 3-D pictures of the second season A-Team story When You Comin Back, Range Rider? , was produced by View-Master International , an electric race car track with A-Team vehicle covers instead of normal cars, and a TYCO produced train set with various accessories and pieces themed for the A-Team look. The set includes a Baldwin shark nose engine painted up like the Van and a matching Caboose.   Following the original cancellation of the series, further merchandise has appeared as the series has achieved cult status, including an A-Team van by Hot Wheels . In 2016 ": null
    },
    {
        "Lego": "lego"
    },
    {
        " released a pack that includes a B.A. Baracus minifigure and constructible van; the pack will unlock additional A-Team themed content in the video game  Lego Dimensions , including all four team members as playable characters.             ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        " produced a three-issue A-Team ": null
    },
    {
        "comic book": "comic book"
    },
    {
        " series, which was later reprinted as a ": null
    },
    {
        "trade paperback": "trade paperback"
    },
    {
        ". Similarly, in the United Kingdom, an A-Team ": null
    },
    {
        "comic strip": "comic strip"
    },
    {
        " appeared for several years in the 1980s as part of the childrens television magazine and ": null
    },
    {
        "comic": "comic"
    },
    {
        "  Look-In , to tie in with the British run of the series. It was preceded, though, by a short run in the final year of TV Comic, drawn by Jim Eldridge.       Several novels were based on the series, the first six published in America by ": null
    },
    {
        "Dell": "dell publishing"
    },
    {
        " and in Britain by ": null
    },
    {
        "Target Books": "target books"
    },
    {
        "; the last four were only published in Britain. The first six are credited to Charles Heath. The books are generally found in paperback form, although hardback copies were also released.   The A-Team   Small But Deadly Wars   When You Comin Back, Range Rider?   Old Scores to Settle   Ten Percent of Trouble   Operation Desert Sun: The Untold Story, credited on the cover to Charles Heath but on the title page to Louis Chunovic.   Bullets, Bikinis and Bells by Ron Renauld   Backwoods Menace by Ron Renauld   The Bend in the River by David George Deutsch   Death Vows by Max Hart – This is the only book in the series to be based on one standard-length episode.   Two Choose Your Own Adventure|Plot-your-own-adventure books, where the reader would read a section of text and choose from several options of what to do next, were also released as part of the same range, again only available in Britain.     In the United Kingdom from 1985 to 1988, four Annuals were produced, each consisting of text and comic strip stories, puzzles, and photos of the shows stars, with a further one produced by ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        " consisting of several reprinted comic strips, released in 1989/1990.     A ": null
    },
    {
        "Panini": "panini group"
    },
    {
        " set of stickers, which adapted six TV episodes using shots from the episodes, could be stuck into an accompanying book, with text under each inserted sticker to narrate the story.     Theme song and soundtrack": null
    },
    {
        "Mike Post": "mike post"
    },
    {
        " and ": null
    },
    {
        "Pete Carpenter": "pete carpenter"
    },
    {
        "  was released on the vinyl LP Mike Post  – Television Theme Songs and again on the Mike Post  – Mike Post LP , both long out-of-print; however, this was not the same version of the theme as heard on-screen. The theme, as heard on seasons two through four , was also released on TVTs  Televisions Greatest Hits: 70s and 80s . A ": null
    },
    {
        "7-inch single": "7-inch single"
    },
    {
        " of the song credited to Post was released on RCA in 1984.  at Discogs.com. Retrieved July 15, 2018.     The ": null
    },
    {
        "French": "french language"
    },
    {
        " version of the song had lyrics, which mirrored the spoken description of the show in the English opening credits.  The theme has been ranked among the best TV themes ever written, with TV weatherman ": null
    },
    {
        "Al Roker": "al roker"
    },
    {
        " sharing that opinion, and using the song to get jazzed up in the morning.     Though no original music other than the theme has been released, in 1984 EMI issued an album of re-recorded material from the series conducted by ": null
    },
    {
        "Daniel Caine": "derek wadsworth"
    },
    {
        " .     Theme from The A-Team   Young Hannibal   B. A.s Ride   The A-Team In New York City   Bandits   Taxi Chase   The A-Team Escape   The A-Team Prepare For War   Showtime   Move, Sucker   Lets Get Busted   Murdocks Face   Helicopters   More Bandits   Theme From The A-Team           During its time, The A-Team was nominated for three ": null
    },
    {
        "Emmy Awards": "emmy awards"
    },
    {
        ": In 1983 for the pilot episode, in 1984 for the episode When You Comin Back, Range Rider? and in 1987 for the episode Firing Line .       The show featured professional wrestlers such as ": null
    },
    {
        "Hulk Hogan": "hulk hogan"
    },
    {
        ", ": null
    },
    {
        "Professor Toru Tanaka": "charles kalani, jr."
    },
    {
        ", ": null
    },
    {
        "Ricky The Dragon Steamboat": "ricky steamboat"
    },
    {
        ", ": null
    },
    {
        "The Dynamite Kid": "dynamite kid"
    },
    {
        ", ": null
    },
    {
        "Bobby The Brain Heenan": "bobby heenan"
    },
    {
        ", ": null
    },
    {
        "Davey Boy Smith ": "davey boy smith"
    },
    {
        ", ": null
    },
    {
        "Big John Studd": "big john studd"
    },
    {
        " and ": null
    },
    {
        "Greg The Hammer Valentine": "greg valentine"
    },
    {
        ", in most cases playing themselves. In the episode Body Slam , which featured Hogan, wrestling interviewer and announcer ": null
    },
    {
        " Mean Gene Okerlund": "gene okerlund"
    },
    {
        " also appeared.     In addition, the music video for ": null
    },
    {
        "John Cenas": "john cena"
    },
    {
        " Bad, Bad Man  featured the Chain Gang as a three-man A-Team—Cena as Hannibal, plus Cenas cousin ": null
    },
    {
        "Tha Trademarc": "tha trademarc"
    },
    {
        " as Howling Mad and ": null
    },
    {
        "Bumpy Knuckles": "bumpy knuckles"
    },
    {
        " as B.A.       In early episodes the team used ": null
    },
    {
        "Colt AR-15 SP1": "colt ar-15 sp1"
    },
    {
        " semi-automatic rifles , while in later seasons they used the ": null
    },
    {
        "Ruger Mini-14": "mini-14"
    },
    {
        ", and on rare occasions, the ": null
    },
    {
        "selective fire": "selective fire"
    },
    {
        " AC-556K": "mini-14ac-556"
    },
    {
        " variant of the Mini-14. Hannibal is also seen using an ": null
    },
    {
        "M60 machine gun": "m60 machine gun"
    },
    {
        " in some episodes as well as a ": null
    },
    {
        "Micro-Uzi": "micro-uzi"
    },
    {
        ". ": null
    },
    {
        "MAC-11s": "mac-11"
    },
    {
        "with parts added to simulate the Uzi appear in at least two early episodes. Hannibals sidearms are either a nickel-plated ": null
    },
    {
        "Smith & Wesson Model 59": "smith  &  wesson model 59"
    },
    {
        ", or a stainless steel ": null
    },
    {
        "Smith & Wesson Model 639": "smith  &  wesson model 39"
    },
    {
        ". Unusually in the episode Black Day At Bad Rock he is seen carrying a ": null
    },
    {
        "Browning Hi-Power": "browning hi-power"
    },
    {
        ". Faces usual sidearm is a ": null
    },
    {
        "Colt Lawman III": "colt lawman iii"
    },
    {
        ", though he does use ": null
    },
    {
        "Smith & Wesson": "smith  &  wesson"
    },
    {
        " revolvers in latter seasons. Many antagonists and members of the team are seen using ": null
    },
    {
        "1911s": "m1911 pistol"
    },
    {
        " as well. Starting from Season 4, the then-exotic ": null
    },
    {
        "Steyr AUG": "steyr aug"
    },
    {
        " bullpup rifle also became prominent in the series. So many different firearms were used in the 1980s hit The A-Team that it’s impossible to list them all. For five seasons, the wrongly accused foursome used rifles, handguns, submachine guns and shotguns to bring justice for the little guy while trying to stay out of jail. Regardless of the number of explosions or rounds fired, nobody ever got seriously hurt except for the occasional flesh wound of a team member.  & gid107 & id949 |American Rifleman. Guns on TV...No. 1...The A-Team  As a result, the American Rifleman declared The A-Team the Number One Show on Television to regularly feature firearms.     ": null
    },
    {
        "Universal Studios Home Entertainment": "universal pictures home entertainment"
    },
    {
        " has released all five seasons of The A-Team on DVD in Region 1, 2, and 4. In Region 2, a complete series set entitled The A-Team--The Ultimate Collection was released on October 8, 2007.  A complete series set was released in Region 1 on June 8, 2010.  The set includes 25 discs packaged in a replica of the A-Teams signature black van from the show. The complete series set was released in Region 4 on November 3, 2010.     All 5 seasons were re-released in Region 2 with new packaging on June 21, 2010. The series has been remastered and was released on Blu-ray disc in the United Kingdom on October 17, 2016.           Bring Back... The A-Team ": null
    },
    {
        "Channel 4": "channel 4"
    },
    {
        " in the ": null
    },
    {
        "UK": "uk"
    },
    {
        " attempted to reunite the surviving cast members of The A-Team for the show  Bring Back...  in an episode titled Bring Back...The A-Team . . Retrieved on August 17, 2007. ": null
    },
    {
        "Justin Lee Collins": "justin lee collins"
    },
    {
        " presented the challenge, securing interviews and appearances from Dirk Benedict, Dwight Schultz, Marla Heasley, Jack Ging, series co-creator Stephen Cannell, and Mr. T.     Collins eventually managed to bring together Benedict, Schultz, Heasley, Ging and Cannell, along with William Lucking, Lance LeGault, and George Peppards son, Christian. Mr. T was unable to make the meeting, which took place in the Friars Club in ": null
    },
    {
        "Beverly Hills": "beverly hills"
    },
    {
        ", but he did manage to appear on the show for a brief talk with Collins.            A feature film based on The A-Team was released on June 11, 2010, and was produced by ": null
    },
    {
        "20th Century Fox": "20th century fox"
    },
    {
        ". Plan Coming Together for The A-Team , Variety, March 19, 2008 Both Dirk Benedict and Dwight Schultz made brief cameo appearances in the film ; because of timing issues, these scenes were moved to the end of the credits. They were later reinserted for the extended-cut of the film.       In September 2015, Fox announced that they were developing a reboot A-Team series with ": null
    },
    {
        "Chris Morgan": "chris morgan"
    },
    {
        " as executive producer with Cannells daughter, ": null
    },
    {
        "Tawnia McKiernan": "tawnia mckiernan"
    },
    {
        ", and Albert Kim writing. The team is to be made up of both male and female characters. ": null
    }
]