[
    {
        "   The Kindly Ones is the ninth collection of issues in the ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        " series,  The Sandman . Written by ": null
    },
    {
        "Neil Gaiman": "neil gaiman"
    },
    {
        ", illustrated by ": null
    },
    {
        "Marc Hempel": "marc hempel"
    },
    {
        ", ": null
    },
    {
        "Richard Case": "richard case"
    },
    {
        ", ": null
    },
    {
        "DIsraeli": "disraeli"
    },
    {
        ", ": null
    },
    {
        "Teddy Kristiansen": "teddy kristiansen"
    },
    {
        ", Glyn Dillon, ": null
    },
    {
        "Charles Vess": "charles vess"
    },
    {
        ", ": null
    },
    {
        "Dean Ormston": "dean ormston"
    },
    {
        " and ": null
    },
    {
        "Kevin Nowlan": "kevin nowlan"
    },
    {
        ", coloured by ": null
    },
    {
        "Danny Vozzo": "danny vozzo"
    },
    {
        ", and lettered by ": null
    },
    {
        "Todd Klein": "todd klein"
    },
    {
        ".The volume features an introduction by ": null
    },
    {
        "Frank McConnell": "frank mcconnell"
    },
    {
        ".      The issues in the collection first appeared in ": null
    },
    {
        "42": "1993 in comics"
    },
    {
        ", ": null
    },
    {
        "42": "1994 in comics"
    },
    {
        " and ": null
    },
    {
        "42": "1995 in comics"
    },
    {
        ". The collection first appeared in paperback and hardback in ": null
    },
    {
        "42": "1996 in comics"
    },
    {
        ".     Marc Hempel is the primary penciller, inked variously by himself, DIsraeli and Richard Case. He is relieved at different points in the story by Teddy Kristiansen, Glyn Dillon and Dean Ormston, and Charles Vess draws a ": null
    },
    {
        "story within a story": "story within a story"
    },
    {
        " sequence. Kevin Nowlan draws a short story which originally appeared in a Vertigo promo book.     It was preceded by  Worlds End  and followed by  The Wake .         The Kindly Ones belongs with the second collection,  The Dolls House , and the seventh,  Brief Lives , in that it finishes off a story that mostly originated in these collections; but includes elements of  Season of Mists  and the story of Orpheus, told mostly in  Fables and Reflections . The most structurally ambitious of the collections, The Kindly Ones is a single storyline written as a Greek tragedy, with Morpheus as its doomed hero and an aspect of the triad of ": null
    },
    {
        "witches": "witches"
    },
    {
        ", the ": null
    },
    {
        "Erinyes": "erinyes"
    },
    {
        ", as the ": null
    },
    {
        "Greek chorus": "greek chorus"
    },
    {
        ". It pulls together various threads left dangling throughout the series, notably the grudges against Morpheus of several characters: ": null
    },
    {
        "Hippolyta Hall": "fury"
    },
    {
        "; the witches themselves; the Norse god ": null
    },
    {
        "Loki": "loki"
    },
    {
        "; and the witch ": null
    },
    {
        "Thessaly": "characters of the sandmanthessaly"
    },
    {
        ". The Kindly Ones also continues several other stories, including that of Cluracan of Faerie and his sister Nuala; that of the Corinthian; and that of ": null
    },
    {
        "Rose Walker": "rose walker"
    },
    {
        " and her former landlord Hal.     After Daniel is kidnapped by Loki and ": null
    },
    {
        "Robin Goodfellow": "robin goodfellow"
    },
    {
        ", Lyta, his mother convinces herself that Morpheus has killed him and resolves to destroy Morpheus; and finally persuades the Erinyes to do so. In many places, Lyta is depicted as ": null
    },
    {
        "Medusa": "medusa"
    },
    {
        ", and even encounters Medusas two sisters, ": null
    },
    {
        "Stheno": "stheno"
    },
    {
        " and ": null
    },
    {
        "Euryale": "euryale"
    },
    {
        ". Unbeknownst to Lyta, Daniel is recovered alive and well by Morpheus servants, the raven ": null
    },
    {
        "Matthew": "matthew cable"
    },
    {
        " and a restored ": null
    },
    {
        "Corinthian": "corinthian"
    },
    {
        ". At length, Morpheus yields to the Erinyes, and the main story ends with Morpheus and his sister Death on a desolate peak with a flock of pigeons; echoing a sequence from one of the series early high points, The Sound of her Wings . Death asks for Morpheus hand, and he disappears. Immediately upon the death of Morpheus, ": null
    },
    {
        "Daniel": "daniel hall"
    },
    {
        " becomes a new aspect of Dream, with white clothes and hair, and an ": null
    },
    {
        "emerald": "emerald"
    },
    {
        " suspended on his neck and chest.                Steve Faragher reviewed Sandman: The Kindly Ones for Arcane magazine, rating it a 42 out of 42 overall. ": null
    }
]