[
    {
        " The Old Castles Secret  is a 42-page ": null
    },
    {
        "Disney comics": "disney comics"
    },
    {
        " adventure/mystery/horror story written, drawn, and lettered by ": null
    },
    {
        "Carl Barks": "carl barks"
    },
    {
        ". It was first published by ": null
    },
    {
        "Dell Publishing": "dell publishing"
    },
    {
        " in  Four Color  42 . Characters include ": null
    },
    {
        "Uncle Scrooge": "uncle scrooge"
    },
    {
        ", ": null
    },
    {
        "Donald Duck": "donald duck"
    },
    {
        ", and ": null
    },
    {
        "Huey, Dewey, and Louie": "huey, dewey, and louie"
    },
    {
        ". The story is about a treasure hunt led by Uncle Scrooge through an old castle in ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". It is the first of Uncle Scrooges comic book treasure hunts. The story was published with three one-page gag stories by Barks. The cover is the first comic book cover ever drawn by Barks. The story has been reprinted many times.       Scrooge McDuck, in his second appearance, recruits his nephews to search for a family treasure back in Dismal Downs, the old ": null
    },
    {
        "castle": "castle"
    },
    {
        " of ": null
    },
    {
        "The Clan McDuck": "the clan mcduck"
    },
    {
        ", built in the middle of a swamp in ": null
    },
    {
        "Scotland": "scotland"
    },
    {
        ". The treasure once belonged to ": null
    },
    {
        "Sir Quackly McDuck": "sir quackly mcduck"
    },
    {
        ", but both the treasure and its owner disappeared during the siege of 42 The Clan has been searching for the treasure for centuries but Scrooge, the last McDuck, thinks that he can locate it thanks to an ": null
    },
    {
        "X-Ray": "x-ray"
    },
    {
        " machine that can examine through the castles walls.     Finding the treasure proves to be the easy part of the mission, but they have to face a mysterious ghost that steals the treasure from them and repeatedly tries to dispose of them. They cant see it but they can see its shadow, that of a ": null
    },
    {
        "skeleton": "skeleton"
    },
    {
        ". During this, Scottie, the caretaker of the castle, seems to have been murdered by Sir Quackly, and Scrooge, Donald, and the Nephews are trapped on a locked battlement. The Nephews escape by swinging across into the surrounding ": null
    },
    {
        "moat": "moat"
    },
    {
        ", but cant get in. However, remembering the tale of Sir Swamphole McDuck who sealed the ": null
    },
    {
        "dungeons": "dungeons"
    },
    {
        " , they locate a secret passageway into the castles dungeons through his fake grave site .     Scrooge and Donald remain on the battlement until Scrooge reveals he has a gun which can shoot the lock and unlock the door. Scrooge, embarrassed, tells Donald to give him a good, swift kick! . While in the dungeon, the Nephews find the treasure box but are nearly attacked by the ghost and find the other way out of the dungeon; the pillar upon which Sir Swampholes armor is resting is actually a door. Scrooge, Donald, and Huey, Dewey, and Louie find the invisibility spray and give chase to the ghost, now covered in mud and no longer invisible, through the swamp. The nephews and Donald tackle him to the ground and retrieve the treasure box. The ghost is revealed to be a thief who was impersonating Scottie using a special spray-like formula that made him invisible but did not prevent his skeleton from casting a shadow. Donald then takes all the nephews credit, claiming they hadnt known the invisibility spray even existed. Enraged, the nephews then trick Donald into thinking the spray is a ": null
    },
    {
        "mosquito": "mosquito"
    },
    {
        " repellent, where they then make him completely invisible save his tail and legs.       The story is usually referred to as one of Barks most memorable for several reasons. The plot borrows elements of horror and mystery stories, favorites of Barks; the old and mostly abandoned castle with its dark halls, hidden dungeons and crypts; ancestors skeletons buried within the castle; the ancient McDuck cemetery with the graves of generations of the main characters ancestors; the misty swamp, the threatening ghost , and the imminent danger the characters sense. Barks detailed every panel to afford a sense of melancholy suitable for this rather moody story, and used pictures of old Scottish castles as references to add to the storys realism. The Old Castles Secret is considered to be among Barks best drawing efforts.     The Old Castles Secret marks the second appearance of Scrooge in a story but the first where Scrooge acts as the leader in a treasure expedition, a theme that Barks would use often for an Uncle Scrooge story. It introduces the Clan McDuck and gives a family history to the characters that would later be expanded by both Barks and his successors and firmly sets the characters origin in ": null
    },
    {
        "Scotland": "scotland"
    }
]