[
    {
        "The Urantia Book  is a ": null
    },
    {
        "spiritual": "spirituality"
    },
    {
        " and ": null
    },
    {
        "philosophical": "philosophy"
    },
    {
        " book that originated in ": null
    },
    {
        "Chicago": "chicago"
    },
    {
        " some time between 42 and 42 The authorship remains a matter of speculation. It has received various degrees of interest ranging from praise to criticism for its religious and science content, its unusual length, and its lack of a known author.     The text introduces the word Urantia as the name of the planet ": null
    },
    {
        "Earth": "earth"
    },
    {
        " and states that its intent is to present enlarged concepts and advanced truth.  The book aims to unite religion, science and philosophy, and its enormous amount of material about science is unique among literature claimed to be presented by celestial beings. Among other topics, the book discusses the ": null
    },
    {
        "origin": "origin of life"
    },
    {
        " and ": null
    },
    {
        "meaning of life": "meaning of life"
    },
    {
        ", mankinds place in the ": null
    },
    {
        "universe": "universe"
    },
    {
        ", the relationship between ": null
    },
    {
        "God": "god"
    },
    {
        " and people, and the life of ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        ".     The ": null
    },
    {
        "Urantia Foundation": "urantia foundation"
    },
    {
        ", a U.S.-based ": null
    },
    {
        "non-profit group": "non-profit group"
    },
    {
        ", first published The Urantia Book in 42 In 42 a jury found that the English-language books copyright was no longer valid in the United States after 42 The English text became a ": null
    },
    {
        "public domain": "public domain"
    },
    {
        " work in the United States, and in 42 the international copyright expired.                 The exact circumstances of the origin of The Urantia Book are unknown. The book and its publishers do not name a human author. Instead, it is written as if directly presented by numerous celestial beings appointed to the task of providing an epochal religious revelation.     As early as 42 ": null
    },
    {
        "William S. Sadler": "william s. sadler"
    },
    {
        " and his wife ": null
    },
    {
        "Lena Sadler": "lena sadler"
    },
    {
        ", physicians in Chicago and well known in the community, are said to have been approached by a neighbor who was concerned because she would occasionally find her husband in a deep sleep and breathing abnormally. She reported that she was unable to wake him at these times. The Sadlers came to observe the episodes, and over time, the individual produced verbal communications that claimed to be from student visitor spiritual beings. This changed sometime in early 42 with a voluminous handwritten document, which from then on became the regular method of purported communication. The individual was never identified publicly but has been described as a hard-boiled business man, member of the board of trade and stock exchange.      The Sadlers were both respected physicians, and William Sadler was a sometime ": null
    },
    {
        "debunker": "debunker"
    },
    {
        " of ": null
    },
    {
        "paranormal": "paranormal"
    },
    {
        " claims. In 42 he published a book called The Mind at Mischief, in which he explained the fraudulent methods of ": null
    },
    {
        "mediums": "mediumship"
    },
    {
        " and how self-deception leads to ": null
    },
    {
        "psychic": "psychic"
    },
    {
        " claims. He wrote in an appendix that there were two cases that he had not explained to his satisfaction:     The other exception has to do with a rather peculiar case of psychic phenomena, one which I find myself unable to classify.  ... I was brought in contact with it, in the summer of 42 and I have had it under my observation more or less ever since, having been present at probably 42 of the night sessions, many of which have been attended by a stenographer who made voluminous notes. A thorough study of this case has convinced me that it is not one of ordinary trance.  ... This man is utterly unconscious, wholly oblivious to what takes place, and, unless told about it subsequently, never knows that he has been used as a sort of clearing house for the coming and going of alleged extra-planetary personalities.  ... ": null
    },
    {
        "Psychoanalysis": "psychoanalysis"
    },
    {
        ", ": null
    },
    {
        "hypnotism": "hypnosis"
    },
    {
        ", intensive comparison, fail to show that the written or spoken messages of this individual have origin in his own mind. Much of the material secured through this subject is quite contrary to his habits of thought, to the way in which he has been taught, and to his entire philosophy. In fact, of much that we have secured, we have failed to find anything of its nature in existence.     In 42 a group of Sadlers friends, former patients, and colleagues began meeting for Sunday philosophical and religious discussions, but became interested in the strange communications when Sadler mentioned the case at their fourth meeting and read samples at their request. Shortly afterwards, a communication reportedly was received about which this group would be allowed to devise questions and that answers would be given by celestial beings through the contact personality.     Sadler presented this development to the group, and they generated hundreds of questions without full seriousness, but their claim is that it resulted in the appearance of answers in the form of fully written papers. They became more impressed with the quality of the answers and continued to ask questions, until all papers now collected together as The Urantia Book were obtained. The group was known as the Forum, and was formalized as a closed group of 42 members in 42 who pledged not to discuss the material with others. Over time, some participants left and others joined, leading to a total membership of 42 people over the years from diverse backgrounds and a mix of interest levels. A smaller group of five individuals called the Contact Commission, including the Sadlers, was responsible for gathering the questions from the Forum, acting as the custodians of the handwritten manuscripts that were presented as answers, and arranging for proofreading and typing of the material. Bill Sadler, Jr. is noted to have composed the table of contents that is published with the book.     The Sadlers and others involved, now all deceased, claimed that the papers of the book were physically materialized from 42 until 42 in a way that was not understood even by them, with the first two parts being completed in 42 and the third and fourth in 42 The last Forum gathering was in 42     After the last of Part IV was obtained in 42 an additional period of time supposedly took place where requests for clarifications resulted in revisions. Sadler and his son William Sadler, Jr. at one point wrote a draft introduction and were told that they could not add their introduction. The Foreword was then received.     The communications purportedly continued for another two decades while members of the Forum studied the book in depth, and according to Sadler and others, permission to publish it was given to them in 42 The ": null
    },
    {
        "Urantia Foundation": "urantia foundation"
    },
    {
        " was formed in 42 as a tax-exempt educational society in Illinois, and through privately raised funds, the book was published on October 42 42     Only the members of the Contact Commission witnessed the activities of the sleeping subject , and only they knew his identity. The individual is claimed to have been kept anonymous in order to prevent undesirable future veneration or reverence for him. ": null
    },
    {
        "Martin Gardner": "martin gardner"
    },
    {
        " states that an explanation concerning the origin of the book more plausible than celestial beings is that the Contact Commission, particularly William Sadler, was responsible. Gardners conclusion is that a man named Wilfred Kellogg was the sleeping subject and authored the work from his subconscious mind, with William Sadler subsequently editing and authoring parts. ": null
    },
    {
        "Brad Gooch": "brad gooch"
    },
    {
        " believes Sadler wrote the book, possibly with help from others on the Contact Commission. A statistical analysis using the ": null
    },
    {
        "Mosteller": "frederick mosteller"
    },
    {
        " and Wallace methods of ": null
    },
    {
        "stylometry": "stylometry"
    },
    {
        " indicates at least nine authors were involved, and by comparatively analyzing the book against The Mind at Mischief, does not indicate authorship or extensive editing by Sadler, without ruling out the possibility of limited edits.          In 42 after having compiled an index of The Urantia Book and distributed free copies via computer disk and printouts, Kristen Maaherra was sued by the Urantia Foundation for violating their copyright on the book. In 42 Maaherra won a Summary Judgment declaring the Urantia Foundations copyright renewal invalid. Upon appeal, the judgment was reversed and awarded to the Urantia Foundation.     Four years later, in 42 Harry McMullan III and the Michael Foundation published a book, Jesus–A New Revelation, which included verbatim 42 of the 42 papers included in The Urantia Book. McMullan and the Michael Foundation subsequently sought a legal declaration that the Urantia Foundations US copyright in The Urantia Book was either invalid or, alternatively, that the copyright had not been infringed upon. Urantia Foundations copyright was held to have expired in 42 because the book was deemed to have been neither a composite work nor a commissioned work for hire. These two arguments having been rejected, a U.S. court held that, since the Conduit had died prior to 42 only the Conduits heirs would have been eligible to renew the copyright in 42 and, since they had not done so, the Urantia Foundations copyright on the book had expired and the book had therefore passed into the public domain. This decision was upheld on appeal.          The Urantia Book is approximately 42 pages long, and consists of a body of 42 papers divided in four parts, and an introductory foreword:   Part I, titled The Central and Superuniverses, addresses what the authors consider the highest levels of creation, including the ": null
    },
    {
        "eternal": "eternity"
    },
    {
        " and ": null
    },
    {
        "infinite": "infinity"
    },
    {
        " Universal Father, his Trinity associates, and the Isle of Paradise.   Part II, The Local Universe, describes the origin, administration, and personalities of the local universe of Nebadon. the part of the cosmos where Earth resides. It presents narratives on the inhabitants of local universes and their work as it is coordinated with a scheme of spiritual ascension and progression of different orders of beings, including humans, ": null
    },
    {
        "angel": "angel"
    },
    {
        "s, and others.   Part III, The History of Urantia, compiles a broad history of the Earth, presenting a purported explanation of the origin, evolution, and destiny of the world and its inhabitants. Topics include ": null
    },
    {
        "Adam and Eve": "adam and eve"
    },
    {
        ", ": null
    },
    {
        "Melchizedek": "melchizedek"
    },
    {
        ", essays on the concept of the Thought Adjuster, Religion in Human Experience, and Personality Survival.   Part IV, The Life and Teachings of Jesus, is the largest part at 42 pages, and is often noted as the most accessible and most impressive, narrating a detailed biography of Jesus that includes his childhood, teenage years, family life, and public ministry, as well as the events that led to his ": null
    },
    {
        "crucifixion": "crucifixion"
    },
    {
        ", death, and resurrection. Its papers continue about appearances after he rose, ": null
    },
    {
        "Pentecost": "pentecost"
    },
    {
        " and, finally, The Faith of Jesus.       According to The Urantia Book, God is the creator and upholder of all reality—an ": null
    },
    {
        "omniscient": "omniscience"
    },
    {
        ", ": null
    },
    {
        "omnipresent": "omnipresence"
    },
    {
        ", ": null
    },
    {
        "omnipotent": "omnipotence"
    },
    {
        ", ": null
    },
    {
        "infinite": "infinity"
    },
    {
        ", and ": null
    },
    {
        "eternal": "eternity"
    },
    {
        " spirit personality. The most fundamental teaching about God in the book is that he is a Father. The face which the Infinite turns toward all universe personalities is the face of a Father, the Universal Father of love.      God, according to the book, is one Deity who functions on a range of different levels of reality, both personal and impersonal. God is taught to exist in a ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        " of three perfectly individualized persons who are co-equal: God the Father, God the Son, and God the Spirit. These persons are referred to by additional titles in the book, primarily as the Universal Father, Eternal Son, and Infinite Spirit.  While stating that the concept of one God in three persons is difficult to fully understand, the book says that the idea: ...in no manner violates the truth of the divine unity. The three personalities of Paradise Deity are, in all universe reality reactions and in all creature relations, as one.      The Father, Son, and Spirit are considered existential persons of Deity, those in existence from the eternal past to the eternal future. In addition, three persons of Deity are described who are experiential, or incomplete and in the process of actualizing: God the Supreme; God the Ultimate; and God the Absolute. Of these three, God the Supreme, or the Supreme Being, is given the most explanation, as the person of Deity evolving in time and space to unify finite reality and the infinite. The persons of God the Ultimate and God the Absolute are considered to be remote from the possibility of comprehension and are covered on a limited basis.     Many types of celestial beings are enumerated in the book, and one of particular note is a joint offspring of the Universal Father and Eternal Son called a Creator Son.  A divine Creator Son is considered the highest personification of the Universal Father and Eternal Son that is possible for people to know and: ...is, to all practical intents and purposes, God.  ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " of ": null
    },
    {
        "Nazareth": "nazareth"
    },
    {
        " is identified as a Creator Son who ": null
    },
    {
        "incarnated": "incarnation"
    },
    {
        " on Earth, and the central theme of the books section recounting his life and teachings is that the religion he preached is the highest known to the world.     The final paper states:            God is described as the Father of each individual, and through the direct gift of a fragment of his eternal spirit, called a Thought Adjuster, is said to be able to guide the individual toward an increased understanding of him. The Thought Adjuster is a central teaching of the book and is also referred to as a Mystery Monitor and indwelling presence,  as well as a divine spark.  The idea is compared within the book to the ": null
    },
    {
        "Hindu": "hindu"
    },
    {
        " atman": "atman"
    },
    {
        " and the ancient ": null
    },
    {
        "Egyptian": "ancient egypt"
    },
    {
        " ka": "egyptian soul"
    },
    {
        ". In relation to biblical traditions, the Thought Adjuster is said to be the meaning behind the phrases being made in Gods image and the kingdom of God is within you :          Each person is said to receive one such fragment at the time of his or her first independent ": null
    },
    {
        "moral": "morality"
    },
    {
        " decision, on average around the age of five years and 42 months. The Adjuster then serves noncoercively as a divine partner in the mind of the individual for the rest of life, and to the extent that a person consents with their ": null
    },
    {
        "free will": "free will"
    },
    {
        " to want to find God, it leads the person toward more mature, spiritualized thinking. A persons Thought Adjuster is described as distinct from either the ": null
    },
    {
        "soul": "soul"
    },
    {
        " or the ": null
    },
    {
        "conscience": "conscience"
    },
    {
        ". In The Urantia Book s teachings, the degree to which a human mind chooses to accept its Adjusters guidance becomes the degree to which a persons soul grows and becomes a reality that can then survive death. The soul is in essence an embryonic spiritual development, one parental factor being the divine Adjuster and the other being the human will.     The book says: But you yourself are mostly unconscious of this inner ministry. You are quite incapable of distinguishing the product of your own material intellect from that of the conjoint activities of your soul and the Adjuster.  The book is strongly ": null
    },
    {
        "fideistic": "fideism"
    },
    {
        " and teaches that neither science nor logic will ever be able to prove or disprove the existence of God, arguing that faith is necessary to become conscious of Gods presence in human experience, the Thought Adjuster.     Persistently embracing ": null
    },
    {
        "sin": "sin"
    },
    {
        " is considered the same as rejecting the leadings of the Adjuster, rejecting the ": null
    },
    {
        "will": "will"
    },
    {
        " of God. Constant selfishness and sinful choosing lead eventually to iniquity and full identification with unrighteousness, and since unrighteousness is unreal, it results in the eventual annihilation of the individuals identity. Personalities like this become as if they never were. The book says that: ...in the last analysis, such sin-identified individuals have destroyed themselves by becoming wholly unreal through their embrace of iniquity.  The concepts of ": null
    },
    {
        "Hell": "hell"
    },
    {
        " and ": null
    },
    {
        "reincarnation": "reincarnation"
    },
    {
        " are not taught.     The book says that a person ultimately is destined to fuse with his or her divine fragment and become one inseparable entity with it as the final goal of faith. Uniting with the Adjuster fragment is the reward of the ages, the moment when a human personality has successfully and unalterably won eternal life, described as typically taking place in the afterlife, but also a possibility during earthly life. The result during human life is a fusion flash, with the material body consumed in a fiery light and the soul translated to the afterlife. The Hebrew prophet ": null
    },
    {
        "Elijah": "elijah"
    },
    {
        " being taken to heaven without death in chariots of fire is said to be a rare example in recorded history of a person who translated instead of experiencing death.     After a person fuses with his or her fragment of God, then will begin your real life, the ascending life, to which your present mortal state is but the vestibule.  A person continues as an ascending citizen in the universe and travels through numerous worlds on a long pilgrimage of growth and learning that eventually leads to God and residence on Paradise. Mortals who reach this stage are called finaliters.  The book goes on to discuss the potential destinies of these glorified mortals.     The book regards human life on earth as a short and intense test,  and the afterlife as a continuation of training that begins in material life. The religion of Jesus is considered to be practiced by way of loving God the Father, thereby learning to love each person the way Jesus loves people; that is, recognizing the fatherhood of God and its correlated truth, the brotherhood of man,  resulting in unselfish service to others.       The book describes that at the center of the cosmos is the stationary Isle of Paradise—the dwelling place of ": null
    },
    {
        "God": "god"
    },
    {
        "—with Paradise being surrounded by Havona, an eternal universe containing a billion perfect worlds, around which seven incomplete and evolutionary superuniverses circle.     The word universe in the book is used to denote a number of different scales of organization. A superuniverse is roughly the size of a ": null
    },
    {
        "galaxy": "galaxy"
    },
    {
        " or group of galaxies, and the seven superuniverses along with Paradise-Havona are together designated as the grand universe. A local universe is a portion of a superuniverse, with 42 local universes being in each superuniverse. Beyond the seven superuniverses, uninhabited outer space levels are described. The term master universe refers to what in modern usage would be the total universe—all existing ": null
    },
    {
        "matter": "matter"
    },
    {
        " and space taken as a whole.     Urantia is said to be located in a remote local universe named Nebadon, which itself is part of superuniverse number seven, Orvonton. The physical size of a local universe is not directly stated, but each is said to have up to 42 million inhabited worlds.       The books extensive teachings about the history of the world include its physical development about 42 billion years ago, the gradual changes in conditions that allowed life to develop, and long ages of organic evolution that started with microscopic marine life and led to plant and animal life in the oceans, later on land. The emergence of humans is presented as having occurred about a million years ago from a branch of superior ": null
    },
    {
        "primate": "primate"
    },
    {
        "s originating from a ": null
    },
    {
        "lemur": "lemur"
    },
    {
        " ancestor. The first humans are said to have been male and female twins called Andon and Fonta, born 42 years prior to 42      The Urantia Book teaches not only biological evolution, but that human society and spiritual understandings evolve by slow progression, subject both to periods of rapid improvement and the possibility of retrogression. Progress is said to follow a divine plan that includes periodic gifts of revelation and ministry by heavenly teachers, which eventually will lead to an ideal world status of light and life in the far distant future.     Although there is the ideal and divine plan of progression, it is said to be fostered and administered by various orders of celestial beings who are not always perfect. Urantia is said to be a markedly confused and disordered planet that is greatly retarded in all phases of intellectual progress and spiritual attainment compared to more typical inhabited worlds, due to an unusually severe history of rebellion and default by its spiritual supervisors.           More than one third of the content of The Urantia Book is devoted to a narrative of the life and teachings of Jesus, and the ": null
    },
    {
        "Judeo-Christian tradition": "judeo-christian tradition"
    },
    {
        " is given an importance exceeding any other. The books teachings claim to be a clarification and expansion of Christian belief. However, numerous differences are noted between its teachings and commonly accepted Christian doctrines.     ": null
    },
    {
        "Jesus": "jesus"
    },
    {
        " is held in high regard by The Urantia Book, as he is in the New Testament of the ": null
    },
    {
        "Bible": "bible"
    },
    {
        ". The following are attributed to him in both texts:   He was both human and divine, the Son of God incarnate who was born to ": null
    },
    {
        "Mary": "mary"
    },
    {
        ", whose husband was ": null
    },
    {
        "Joseph": "joseph the betrothed"
    },
    {
        ". ": null
    },
    {
        "Lazarus": "lazarus of bethany"
    },
    {
        ", the turning of water into wine, the feeding of the five thousand, and numerous healings of the blind, diseased, and infirm. ": null
    },
    {
        "atonement": "atonement in christianity"
    },
    {
        " for the sins of humanity. The crucifixion is taught to be an outcome of the fears of religious leaders of the day, who regarded his teachings as a threat to their positions of authority.   Jesus is considered the human incarnation of Michael of Nebadon, one of more than 42 Paradise Sons of God, or Creator Sons. Jesus is not considered the second person of the ": null
    },
    {
        "Trinity": "trinity"
    },
    {
        " as he is in Christianity. The book refers to the Eternal Son as the second person of the Trinity. ": null
    },
    {
        "virgin birth": "virgin birth of jesus"
    },
    {
        ".        Gardner notes similarities between ": null
    },
    {
        "Seventh-day Adventism": "seventh-day adventist church"
    },
    {
        " and the teachings of The Urantia Book, and sees this as evidence that William Sadler and Wilfred Kellogg had a role in editing or writing the book, since they both were one-time believers in Adventism. For instance, two basic Adventist beliefs that distinguish it from mainline Christianity are the doctrines of ": null
    },
    {
        "soul sleep": "soul sleep"
    },
    {
        "ing and ": null
    },
    {
        "annihilationism": "annihilationism"
    },
    {
        ", both of which The Urantia Book also supports. Lewis notes that from the perspective of the book being a revelation, it could be claimed the celestial beings simply found areas of Adventist belief to be accurate and therefore presented and expanded on them. While the book supports aspects of Adventism, it also is mixed with teachings that are heresies to Adventists.       The book can be seen as belonging in the genre of spiritual literature that includes  A Course in Miracles  and  Conversations with God . Gardner compares it with  Oahspe , noting that though Oahspe is vastly inferior to the UB both in ideas and style of writing, they are similar in claiming to have been written by celestial beings channelled through a human conduit, teaching that there is one ultimate God who oversees a vast bureaucracy of lesser deities while both outline an elaborate cosmology. The books claimed supernatural origin has been compared to similar claims of the ": null
    },
    {
        "Book of Mormon": "book of mormon"
    },
    {
        ", ": null
    },
    {
        "Science and Health": "science and health"
    },
    {
        ", the ": null
    },
    {
        "Quran": "quran"
    },
    {
        ", and the ": null
    },
    {
        "Bible": "bible"
    },
    {
        ", with belief in it not being seen as necessarily a greater leap in reason.     Comparisons with facets of various world religions are incorporated in the book, including Buddhism, Islam, Taoism, Judaism, Hinduism, Shinto, and Confucianism. For example, Paper 42 The Worlds Religions discusses the aspects of these religions that are in common with what the book claims is the religion of Jesus. The stance of the book is that there is not a Urantia religion that could not profitably study and assimilate the best of the truths contained in every other faith.        The Urantia Book has been enjoyed by some as a form of ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        ", ": null
    },
    {
        "historical fiction": "historical fiction"
    },
    {
        " or ": null
    },
    {
        "fantasy": "fantasy"
    },
    {
        ". The Urantia Book is noted for its high level of internal consistency and an advanced writing style. Skeptic Martin Gardner, in a book otherwise highly critical of The Urantia Book, writes that it is highly imaginative and that the cosmology outrivals in fantasy the cosmology of any science-fiction work known to me.  Gooch says that for nonbelievers, the book is a mixture of being fascinating, inspiring, compelling, haunting, entertaining, annoying, incomprehensible, and always wordy.      Parts I, II, and III are chiefly written in expository language. The papers are informational, matter-of-fact, and instructional. Part IV of the book is written as a biography of Jesus life, and some feel it is a rich narrative with well-developed characters, high attention to detail, woven sub-plots, and realistic dialogue. Considered as literature, Part IV is favorably compared to retellings of Jesus life, such as  The Gospel According to Jesus Christ  by ": null
    },
    {
        "José Saramago": "josé saramago"
    },
    {
        " and  Behold the Man  by ": null
    },
    {
        "Michael Moorcock": "michael moorcock"
    },
    {
        ". Martin Gardner considers Part IV to be an especially well-written, impressive work, and says, Either it is accurate in its history, coming directly from higher beings in position to know, or it is a work of fertile imagination by someone who knew the New Testament by heart and who was also steeped in knowledge of the times when Jesus lived.  His assessment is that the narrative is consistent with human authorship.           The authors refer to the book as the fifth revelation of epochal significance to humankind, the fourth epochal revelation having been the life of Jesus. The claim of revelation in The Urantia Book has been criticized for various reasons. Skeptics such as ": null
    },
    {
        "Martin Gardner": "martin gardner"
    },
    {
        " say it is a product of human efforts rather than a revelation because some of its science is flawed. Because the book does not support certain tenets of Christianity, such as the ": null
    },
    {
        "atonement doctrine": "atonement in christianity"
    },
    {
        ", while at the same time presenting an account of parts of Jesus life absent in the Bible, others with a Christian viewpoint have argued it cannot be genuine. Gooch notes that while its somewhat dated, elegant prose could be read as fiction, due to its claim of divine inspiration the book invites reactions far more scathing than ... might otherwise merit.        In Paper 42 The Real Nature of Religion, the authors write:   We full well know that, while the historic facts and religious truths of this series of revelatory presentations will stand on the records of the ages to come, within a few short years many of our statements regarding the physical sciences will stand in need of revision in consequence of additional scientific developments and new discoveries. These new developments we even now foresee, but we are forbidden to include such humanly undiscovered facts in the revelatory records. Let it be made clear that revelations are not necessarily inspired. The cosmology of these revelations is not inspired.     Skeptics like ": null
    },
    {
        "Martin Gardner": "martin gardner"
    },
    {
        " see the science in The Urantia Book as clear reflections of the views that prevailed at the time the book is said to have originated. The claim by the authors, that no unknown scientific discoveries could be imparted, is seen as a ruse to allow mistakes to be dismissed later. That presentation of post42 scientific knowledge is avoided is taken to be evidence it was written by humans and not by celestial beings with superior knowledge.     Examples of criticisms regarding the science in The Urantia Book include:   The described formation of the ": null
    },
    {
        "solar system": "solar system"
    },
    {
        " is consistent with the ": null
    },
    {
        "Chamberlin-Moulton planetesimal hypothesis": "chamberlin-moulton planetesimal hypothesis"
    },
    {
        ", which though popular in the early part of the 42th century, was discarded by the 42s after major flaws were noted. The currently accepted scientific explanation for the origin of the solar system is based on the ": null
    },
    {
        "nebular hypothesis": "solar nebula"
    },
    {
        ". ": null
    },
    {
        "age of the universe": "age of the universe"
    },
    {
        " is approximately 42 billion years. The book does not support the ": null
    },
    {
        "Big Bang": "big bang"
    },
    {
        " theory. ": null
    },
    {
        "electron": "electron"
    },
    {
        " being composed of 42 ultimatons. The particle is not known to be described anywhere else and the concept is not supported by modern ": null
    },
    {
        "particle physics": "particle physics"
    },
    {
        ". ": null
    },
    {
        "Andromeda Galaxy": "andromeda galaxy"
    },
    {
        " is claimed to be almost one million light years away, repeating the understandings of the 42s, but the galaxy is now understood to be ": null
    },
    {
        "42 million light years away": "andromeda galaxyrecent distance estimate"
    },
    {
        ".   The book repeats the mistaken idea that planets close to a sun will gradually spin slower until one hemisphere is left always turned to the sun due to ": null
    },
    {
        "tidal locking": "tidal locking"
    },
    {
        ", citing ": null
    },
    {
        "Mercury": "mercury"
    },
    {
        " as an example. Scientists at the time of the books origin thought one side of Mercury always faced the sun, just as one side of the ": null
    },
    {
        "Moon": "moon"
    },
    {
        " always faces the Earth. In 42 ": null
    },
    {
        "radio astronomers": "radio astronomy"
    },
    {
        " discovered however that Mercury rotates fast enough for all sides to see exposure to the sun. Scientists further established that Mercury is locked in this spin rate in a stable resonance of 42 spins for every 42 orbits, and it is not slowing and so will never have one side left always turned to the sun. ": null
    },
    {
        "species": "species"
    },
    {
        " are said to have ": null
    },
    {
        "evolved suddenly": "saltation"
    },
    {
        " from single ": null
    },
    {
        "mutation": "mutation"
    },
    {
        "s without transitional species. The theory originated with ": null
    },
    {
        "Dutch": "dutch people"
    },
    {
        " botanist ": null
    },
    {
        "Hugo De Vries": "hugo de vries"
    },
    {
        " but was short-lived and is not now supported. ": null
    },
    {
        "Native American": "native americans in the united states"
    },
    {
        " prophet ": null
    },
    {
        "Tenskwatawa": "tenskwatawa"
    },
    {
        ". The eclipse actually was predicted in late April 42 and occurred on June 42 42 In 42 Urantia Foundation acknowledged the error and revised the book.  Gardner believes that William S. Sadler, who wrote some ": null
    },
    {
        "eugenicist": "eugenics"
    },
    {
        " works, had a hand in editing or writing the book, and that this is how the ideas were included.     While some adherents of the book believe that all of the information in The Urantia Book including its science is literally true, others accept the books caveats and do not believe that the science is fully accurate.     Meredith Sprunger, a ": null
    },
    {
        "liberal": "liberal religion"
    },
    {
        " believer in The Urantia Book and retired minister of the ": null
    },
    {
        "United Church of Christ": "united church of christ"
    },
    {
        ", wrote that research has revealed that virtually all of the scientific material found in the UB was the accepted scientific knowledge of the period in which the book was written, was held by some scientists of that time, or was about to be discovered or recognized.  He further argued against its literal infallibility and said that fundamentalism over the book is just as untenable as Biblical fundamentalism.      Other believers maintain that the book has prophetically anticipated scientific advances already. They believe more of its science — if not all of it — will be proven correct in the future. Gardner evaluated many of these claims as of 42 and found them unconvincing. Some arise because the book is said to have been written by the revelators by 42 but then was not published until 42 Discoveries from science during the two intervening decades can be perceived as prophetic by believers, while skeptics think such facts were added prior to publication. For instance, the catalytic role that ": null
    },
    {
        "carbon": "carbon"
    },
    {
        " plays in the suns nuclear reactions is described in the book, though ": null
    },
    {
        "Hans Bethe": "hans bethe"
    },
    {
        "s announcement of the discovery was not made until 42     The only apparent anticipation of science the book has made, in Gardners opinion, is that it says the magnetic sense that ": null
    },
    {
        "homing pigeons": "homing pigeons"
    },
    {
        " possess is not wholly wanting as a conscious possession by mankind. In 42 a British zoologist, Robin Baker, published evidence that humans have a limited magnetic sense.     ": null
    },
    {
        "Mark McMenamin": "mark mcmenamin"
    },
    {
        ", a professor of ": null
    },
    {
        "geology": "geology"
    },
    {
        ", quotes a section of the book describing a billion-year-old supercontinent that subsequently split apart, forming ocean basins where early marine life developed. He says, This amazing passage, written in the 42s, anticipates scientific results that did not actually appear in the scientific literature until many decades later. McMenamin also states, Of course I am being selective here in my choice of quotations, and there are reams of scientifically untenable material in The Urantia Book.       The Urantia Book states in its Foreword that more than one thousand human concepts representing the highest and most advanced planetary knowledge of spiritual values and universe meanings  were selected in preparing the papers. The authors say that they were required to give preference to the highest existing human concepts pertaining to the subjects to be presented and would resort to pure revelation only when the concept of presentation has had no adequate previous expression by the human mind. One of the authors wrote in Part IV: I well know that those concepts which have had origin in the human mind will prove more acceptable and helpful to all other human minds.      In recent years, students of the papers have found that the free use of other sources appears to be true. None of the material allegedly used from other sources is directly cited or referenced within the book.     In 42 a reader of The Urantia Book, Matthew Block, self-published a paper that showed The Urantia Book utilized material from 42 other books. All of the source authors identified in Blocks paper were published in English between 42 and 42 by U.S. publishers and are typically scholarly or academic works that contain concepts and wording similar to what is found in The Urantia Book. Block has since claimed to have discovered over 42 source texts that were incorporated into the papers.     The use of outside source materials was studied separately by Gardner, and Gooch, and they concluded, consistent with their respective conclusion that the books author must have been human, that the book therefore plagiarized many of the sources noted by Block.     For instance, Gardner and Block note that Paper 42 appears to have been taken from the first eight chapters of Origin and Evolution of Religion by ": null
    },
    {
        "Edward Washburn Hopkins": "edward washburn hopkins"
    },
    {
        ", published by ": null
    },
    {
        "Yale University Press": "yale university press"
    },
    {
        " in 42 Each section of the paper corresponds to a chapter in the book, with several passages possibly used as direct material and further material used in Papers 4242 and 42  Likewise, much of The Urantia Book material relating to the evolution of mankind appears to have been directly taken from ": null
    },
    {
        "Henry Fairfield Osborn": "henry fairfield osborn"
    },
    {
        ", Man Rises to Parnassus: Critical Epochs in the Prehistory of Man published by ": null
    },
    {
        "Princeton University Press": "princeton university press"
    },
    {
        " in 42     In one example cited by Block and confirmed by Gardner and Gooch, the original author discusses the periodicity of the chemical elements and concludes that the harmony in the construction of the atom suggests some unspecified plan of organization. The authors of The Urantia Book assert that this harmony is evidence of the ": null
    },
    {
        "intelligent design": "intelligent design"
    },
    {
        " of the universe. W. F. G. Swann writes on page 42 of The Architecture of the Universe :        Contrast with The Urantia Book s version:        Block and other believers do not see the use of the source materials as plagiarism, but express a view instead that the quality of the way the material was borrowed is consistent with authorship by celestial beings and that study of the sources leads to an even deeper understanding of The Urantia Book. Gooch, a professor of English, assessed that the use of the sources does reveal to us an author with a busy genius for metaphysical invention and poetic turns of phrase whose scam was at worst benign and at most visionary.  Asked by Gardner what he thought of these plagiarisms, Sprunger responded in a letter by saying that if humans wrote the book the plagiarisms would indeed be disturbing but not if it was written by supermortals.           It is difficult to gauge how many adherents there may be as there are multiple organizations to census. Informal study groups tend to sprout, ripen, then vanish or splinter and have not been counted reliably. Readers sometimes join study groups after reading on their own for years or decades, others join them soon after developing an interest in the book, while for most, worship remains as individual as the act of reading.  Disagreements over the legal ownership of the book, its interpretation, and the reception of new revelations have led to some splintering, though these disagreements appear to have been settled to the satisfaction of most adherents. The movement generally incorporates a nonsectarian view, contending that individuals with different religious backgrounds can receive the books teachings as an enrichment rather than as a contradiction of their faiths.     The movement inspired by The Urantia Book has not developed clergy or institutions such as churches, or temples.     Sarah Lewis notes that, The Urantia Revelation is not securing legitimacy through historically known and accepted means to any great degree, nor is it even using common language that would increase the likelihood of understanding and therefore acceptance. It introduces new concepts and a new language, and this does not make acceptance any easier. She assesses that the movement is uncontroversial compared to other ones, lacking the zealous proselytizing found within many other groups, and that it is therefore likely to remain small and unaffected by opposing views.     Urantia Foundation advocated a slow growth policy in the past and had not significantly marketed the book. Sales by Urantia Foundation went from 42 in 42 to 42 in 42 and steadily increased to nearly 42 in 42 an upturn that seems to represent a genuine trend rather than just some spike on a sales chart,  however in 42 the Foundation reported worldwide annual sales of 42 copies and over 42 downloads from various sites. Since the book was determined to be in the ": null
    },
    {
        "public domain": "public domain"
    },
    {
        " in 42 other organizations, such as The Urantia Book Fellowship under the publishing name Uversa Press, have also published the book. Copies of The Urantia Book are on the Internet in various formats and it has been adapted to more recent platforms such as the ": null
    },
    {
        "Kindle": "amazon kindle"
    },
    {
        " and the ": null
    },
    {
        "iOS App Store": "app store"
    },
    {
        ". Several audio books of the text are also on the Internet.     The International Urantia Association had twenty-six reader associations worldwide as of 42 and the Urantia Book Fellowship claimed roughly twelve hundred official members, with the highest concentrations in the West of the United States and the ": null
    },
    {
        "Sun Belt": "sun belt"
    },
    {
        ", especially California, Colorado, Florida, and Texas. It appears an increasing number of people are forming study groups, participating in Internet discussion groups, and hosting or visiting websites about it.       The Teaching Mission is a group of Urantia ": null
    },
    {
        "channellers": "mediumshipchanneling"
    },
    {
        ". According to ": null
    },
    {
        "Richard Landes": "richard landes"
    },
    {
        ", The ": null
    },
    {
        "foundation": "urantia foundation"
    },
    {
        " considers them self-deluded, but they have created a schism that continues to disrupt the movement.     Vern Grimsley was a dynamic speaker who founded a Urantian outreach organization called Family of God in the 42s, which was initially supported by others in the movement, including the Urantia Foundation. Beginning in the early 42s, Grimsley claimed he began hearing voices that were from the same higher beings who wrote The Urantia Book, and that the voices warned of an impending world war followed by a ": null
    },
    {
        "nuclear holocaust": "nuclear holocaust"
    },
    {
        ". While some in the movement believed him, others including the Urantia Foundation concluded Grimsleys messages were spurious, former friends eventually began to shun him, and in later years he is said to have lived in obscurity.     ": null
    },
    {
        "Global Community Communications Alliance": "global community communications alliance"
    },
    {
        ", founded by Gabriel of Urantia , and Niánn Emerson Chase , study the Urantia Book and The Cosmic Family volumes . Along with a number of social outreach programs, they also operate ": null
    },
    {
        "Avalon Organic Gardens & EcoVillage": "avalon organic gardens  &  ecovillage"
    },
    {
        ".       ": null
    },
    {
        "Karlheinz Stockhausen": "karlheinz stockhausen"
    },
    {
        " based his seven-opera cycle  Licht  on the cosmology of The Urantia Book.   ": null
    },
    {
        "Stevie Ray Vaughan": "stevie ray vaughan"
    },
    {
        " , American blues-rock guitarist: Stevie often brought along the book of Urantia and read Lindi passages from the strange publication.  ": null
    },
    {
        "Jimi Hendrix": "jimi hendrix"
    },
    {
        " Jimi also had with him the Book of Urantia, an alternative Bible... Jimi carried this book with him everywhere--along with his Bob Dylan songbook--and told friends he had learned much from its pages.   ": null
    },
    {
        "Jaco Pastorius": "jaco pastorius"
    },
    {
        " wrote the song Havona while he was still playing in the ": null
    },
    {
        "jazz fusion": "jazz fusion"
    },
    {
        " band ": null
    },
    {
        "Weather Report": "weather report"
    },
    {
        " during the late 42s    ": null
    },
    {
        "Jerry Garcia": "jerry garcia"
    },
    {
        " was a reader of The Urantia Book and claimed it was one of his favorite esoteric works   ": null
    },
    {
        "Kerry Livgren": "kerry livgren"
    },
    {
        " is quoted: In 42 I discovered a book that convinced me I had reached the end of my quest. It was called The Urantia Book ....   ": null
    },
    {
        "Pato Banton": "pato banton"
    },
    {
        " Reggae artist and toaster explained in several interviews how the discovery of The Urantia Book answered many questions he had sustained during a fifteen-year spiritual quest, and how he discovered his personal relationship with God through it.           One symbol described in The Urantia Book consists of three concentric ": null
    },
    {
        "azure": "azure"
    },
    {
        " circles on a white background. The circles are said to symbolize Gods triune nature of Father, Son, and Spirit. The Creator Son Michael later incarnated on Earth as Jesus and went to war with Lucifer via Gabriel 42 years ago. Melchizedek wore the concentric circles. Lucifers emblem was a solid black circle in the center of a red one.     Urantia Foundation, the original publisher, placed the concentric circles on the cover of The Urantia Book": null
    }
]