[
    {
        "           The Red Sea Sharks  is the nineteenth volume of  The Adventures of Tintin , the comic series by Belgian cartoonist ": null
    },
    {
        "Hergé": "hergé"
    },
    {
        ". The story was initially ": null
    },
    {
        "serialised": "serial"
    },
    {
        " weekly in Belgiums  Tintin  magazine from October 42 to January 42 before being published in a collected volume by ": null
    },
    {
        "Casterman": "casterman"
    },
    {
        " in 42 The narrative follows the young reporter ": null
    },
    {
        "Tintin": "tintin"
    },
    {
        ", his dog ": null
    },
    {
        "Snowy": "snowy"
    },
    {
        ", and his friend ": null
    },
    {
        "Captain Haddock": "captain haddock"
    },
    {
        " as they travel to the fictional Middle Eastern kingdom of ": null
    },
    {
        "Khemed": "khemed"
    },
    {
        " with the intention of aiding the Emir Ben Kalish Ezab in regaining control after a ": null
    },
    {
        "coup détat": "coup détat"
    },
    {
        " by his enemies, who are financed by slave traders.     Following on from the previous volume in the series,  The Calculus Affair , The Red Sea Sharks was created with the aid of Hergés team of artists at ": null
    },
    {
        "Studios Hergé": "studios hergé"
    },
    {
        ". Influenced by ": null
    },
    {
        "Honoré de Balzac": "honoré de balzac"
    },
    {
        "s  The Human Comedy , Hergé used the story as a vehicle in which to reintroduce a wide range of characters who had first appeared in earlier instalments of the series. The story dealt with the ": null
    },
    {
        "ongoing trade in enslaved Africans across the Arab world": "arab slave trade"
    },
    {
        ". However, in the 42s the story generated controversy as Hergé was repeatedly accused of having portrayed the Africans in a ": null
    },
    {
        "racist": "racism"
    },
    {
        " manner. He was upset by these claims, and made alterations to the depiction of the Africans in later reprints. Hergé continued The Adventures of Tintin with  Tintin in Tibet , and the series as a whole became a defining part of the ": null
    },
    {
        "Franco-Belgian comics": "franco-belgian comics"
    },
    {
        " tradition. The Red Sea Sharks was critically well-received, with various commentators describing it as one of the best Tintin adventures. The story was adapted for the 42 animated series  The Adventures of Tintin  by ": null
    },
    {
        "Ellipse": "ellipse programmé"
    },
    {
        " and ": null
    },
    {
        "Nelvana": "nelvana"
    },
    {
        ".       In ": null
    },
    {
        "Brussels": "brussels"
    },
    {
        ", Tintin and Captain Haddock bump into an old acquaintance, ": null
    },
    {
        "General Alcazar": "general alcazar"
    },
    {
        ". Returning to ": null
    },
    {
        "Marlinspike Hall": "marlinspike hall"
    },
    {
        ", they find that another acquaintance, the Emir of ": null
    },
    {
        "Khemed": "khemed"
    },
    {
        ", ": null
    },
    {
        "Mohammed Ben Kalish Ezab": "mohammed ben kalish ezab"
    },
    {
        ", has been overthrown by his nemesis ": null
    },
    {
        "Sheikh": "sheikh"
    },
    {
        " Bab El Ehr": "bab el ehr"
    },
    {
        ", and that the Emir has accordingly sent his son, the disobedient ": null
    },
    {
        "Abdullah": "abdullah"
    },
    {
        ", to stay at Marlinspike for his own protection. The police detectives ": null
    },
    {
        "Thomson and Thompson": "thomson and thompson"
    },
    {
        " visit, informing Tintin that Alcazar is seeking to purchase military aircraft from ": null
    },
    {
        "J. M. Dawson": "list of the adventures of tintin charactersdawson"
    },
    {
        ". Investigating further, Tintin discovers that Dawson has also sold military aircraft to Bab El Ehr. Realising that the only way to be rid of Abdullah is to restore the Emirs control of Khemed, Tintin, Haddock, and their dog Snowy travel to the Middle Eastern country. However, the trio narrowly survive a bomb planted aboard the plane to kill them, and are able to slip into the city of ": null
    },
    {
        "Wadeshah": "wadesdah"
    },
    {
        " unobserved. There they meet an old friend, the ": null
    },
    {
        "Portuguese": "portugal"
    },
    {
        " merchant ": null
    },
    {
        "Oliveira da Figueira": "oliveira da figueira"
    },
    {
        ", who helps them to escape the city and ride on horseback to the Emirs hideout. During the journey, they evade armoured cars and fighter planes ordered to intercept them by Mull Pasha , who is actually Tintins old antagonist, ": null
    },
    {
        "Dr. Müller": "dr. müller"
    },
    {
        ".     The Emir welcomes Tintin and Haddock, revealing that there is an ongoing ": null
    },
    {
        "slave trade": "slavery"
    },
    {
        " through Khemed that is operated by the international businessman the Marquis di Gorgonzola, who falsely offers transport to ": null
    },
    {
        "African Muslim": "islam in africa"
    },
    {
        "s on the ": null
    },
    {
        "pilgrimage to Mecca": "hajj"
    },
    {
        " and then sells them into slavery. Tintin, Haddock and Snowy leave for the ": null
    },
    {
        "Red Sea": "red sea"
    },
    {
        " coast and board a ": null
    },
    {
        "sambuk": "sambuk"
    },
    {
        " for Mecca; they are attacked by fighter planes before Tintin shoots one down and rescues its mercenary Estonian pilot, ": null
    },
    {
        "Piotr Skut": "piotr skut"
    },
    {
        ". The four are picked up by di Gorgonzolas yacht, the Scheherazade, but are soon offloaded onto the SS Ramona, a ": null
    },
    {
        "tramp steamer": "tramp steamer"
    },
    {
        ". Di Gorgonzola turns out to be another of Tintins old adversaries, ": null
    },
    {
        "Roberto Rastapopoulos": "roberto rastapopoulos"
    },
    {
        ". The Ramona is one of Rastapopoulos slave trading ships, and when a fire breaks out aboard it during the night, the ships commander ": null
    },
    {
        "Allan": "allan thompson"
    },
    {
        " and his crew flee, leaving Tintin, Haddock, Snowy and Skut aboard along with a consignment of African slaves. With Haddock taking on the ships captaincy, they are successfully able to put out the fire. However, Rastapopoulos orders a ": null
    },
    {
        "U-Boat": "u-boat"
    },
    {
        " to destroy the Ramona, with the ship taking evasive manoeuvres to survive, ultimately being rescued by the cruiser ": null
    },
    {
        "USS Los Angeles": "uss los angeles"
    },
    {
        ". The Los Angeles chases down the Scheherazade and attempts to capture di Gorgonzola, but he fakes his own death and escapes via a mini-submarine. Tintin, Haddock and Snowy return to Belgium and learn that the Emir has recaptured Khemed and that Abdullah can return home. Their relaxation is cut short by ": null
    },
    {
        "Jolyon Wagg": "jolyon wagg"
    },
    {
        ", who has arranged to use Marlinspike for an ": null
    },
    {
        "auto rally": "rallying"
    },
    {
        ".             Hergé was inspired to develop the plot for The Red Sea Sharks after reading a magazine article detailing the continued existence of ": null
    },
    {
        "the slave trade within the Arab world": "arab slave trade"
    },
    {
        ", in which it was claimed that African pilgrims headed to Mecca were being enslaved during the journey. Hergé included a reference to this slave trade in the storys original French title, Coke en Stock , which referred to the slave smugglers use of ": null
    },
    {
        "coke": "coal"
    },
    {
        " as a codeword for the enslaved people.          Prior to writing the story, Hergé had read Balzac et son monde , a 42 book written by his friend ": null
    },
    {
        "Félicien Marceau": "félicien marceau"
    },
    {
        ". Intrigued by the work of ": null
    },
    {
        "Honoré de Balzac": "honoré de balzac"
    },
    {
        ", Hergé was inspired by the way in which Balzac kept reusing characters from his previous stories and he subsequently adopted this trait for The Red Sea Sharks, in which a wide range of characters from The Adventures of Tintin make a reappearance. Hergé also introduced a new character, the Estonian pilot Piotr Skut, who would later reappear in  Flight 42 to Sydney .     To produce accurate illustrations for the Ramona, Hergé and his assistant ": null
    },
    {
        "Bob de Moor": "bob de moor"
    },
    {
        " traveled aboard a Swedish cargo vessel, the MS Reine Astrid, from ": null
    },
    {
        "Antwerp": "antwerp"
    },
    {
        " to ": null
    },
    {
        "Gothenburg": "gothenburg"
    },
    {
        " and back, during which they took photographs and drew sketches. Hergé had also collected press clippings depicting the  Christina , a motor yacht owned by the Greek shipping magnate ": null
    },
    {
        "Aristotle Onassis": "aristotle onassis"
    },
    {
        ", and used them as the basis for his depiction of Rastapopoulos ship, the Sheherezade.   The aircraft, cars, and machinery that appear in the story were drawn by ": null
    },
    {
        "Roger Leloup": "roger leloup"
    },
    {
        ", one of the members of the ": null
    },
    {
        "Studios Hergé": "studios hergé"
    },
    {
        ". In one scene in the latter part of the story, Hergé included a   ": null
    },
    {
        "frogman": "frogman"
    },
    {
        ", whose depiction was drawn from a press clipping of ": null
    },
    {
        "Lionel Crabb": "lionel crabb"
    },
    {
        ". His depiction of the Emirs hideaway palace cut from the rock was based on the ": null
    },
    {
        "Al Khazneh": "al khazneh"
    },
    {
        " in ": null
    },
    {
        "Petra": "petra"
    },
    {
        ", Jordan, which he had seen in an issue of  National Geographic .     Hergés growing interest in art was reflected in the story, as he included a copy of ": null
    },
    {
        "Alfred Sisley": "alfred sisley"
    },
    {
        "s  Le Canal du Loing  at Marlinspike Hall. He also included paintings by ": null
    },
    {
        "Pablo Picasso": "pablo picasso"
    },
    {
        " and ": null
    },
    {
        "Joan Miró": "joan miró"
    },
    {
        " aboard Rastapopolous Scheherazade. Mullers pseudonym in the story, Mull Pasha, was based upon the British soldier ": null
    },
    {
        "Glubb Pasha": "john bagot glubb"
    },
    {
        ". In the final scene, Hergé included cameos of both himself and his friend and colleague ": null
    },
    {
        "Edgar P. Jacobs": "edgar p. jacobs"
    },
    {
        ".     The story began serialisation in Belgiums Tintin magazine in October 42 before being serialised in the French edition of the magazine from December 42 It was then published in book form by Casterman in 42 Upon the storys British publication in 42 Coke en Stock was renamed The Red Sea Sharks.         Hergé had been accused of exhibiting a ": null
    },
    {
        "racist": "racism"
    },
    {
        " attitude toward Africans in an earlier story,  Tintin in the Congo , and potentially hoped to exonerate himself from such criticism by depicting Tintin and Haddock freeing African slaves in The Red Sea Sharks. In preparing the latter story he had consulted a colleague who worked for an African-themed magazine,  LAfrique et le Monde  ; they translated some of the passages that Hergé wished to include in the story into ": null
    },
    {
        "Yoruba": "yoruba language"
    },
    {
        ". However, in January 42 an article in the magazine  Jeune Afrique  criticised Hergé for a racist depiction of Africans in the story, an accusation that would be echoed in other publications. These claims focused on the African characters simplistic use of ": null
    },
    {
        "pidgin": "pidgin"
    },
    {
        " language, which was similar to the speech patterns used in Tintin in the Congo.     :African: You speak well, Effendi. Wicked Arab, very wicked. Poor black men not want to be slaves. Poor black men want to go to Mecca.   :Haddock: Naturally, I realise that. But I repeat if you go there, youll be sold as slaves. Is that what you want?   :African: We not slaves, Effendi. We good Muslims. We want to go to Mecca.      Hergé biographer Benoît Peeters expressed the view that for the most part these attacks were extremely unfair .   Hergé was emotionally affected by the accusations, and made changes to the book for its 42 reprint accordingly; here he changed the Africans speech patterns, giving them improved grammar.   However, he left Haddock speaking pidgin in response to the Africans.     For this version he also made changes to the Emirs letter to Tintin; the former version had been formal in its prose, stating Most esteemed and well-beloved friend, I entrust to you my son Abdullah, to improve his English. Here the situation is serious. Should any misfortune befall me I count on you, my friend, to care for Abdullah . In Hergés revised edition, he adopts a more florid prose style: This is to tell you, oh highly esteemed friend, that I entrust to you Abdullah, my adored son. Because here the situation is serious. Should misfortune descend on me like the hawk on an innocent gazelle I am sure that Abdullah will find you with warmth and affection, refuge and peace. And in doing this you will be performing a fragrant act before ": null
    },
    {
        "Allah": "god in islam"
    },
    {
        ".      Hergé also expressed regret that he depicted the death of a shark in the story, later stating that I still believed that sharks were big evil beasts when writing The Red Sea Sharks.              Commenting on the inclusion of a wide range of characters from The Adventures of Tintin, ": null
    },
    {
        "Harry Thompson": "harry thompson"
    },
    {
        " referred to the story as a Tintin family reunion , commenting that it was a story unusually full of the type of people Captain Haddock liked to avoid . Michael Farr believed that in reviving so many older characters, Hergé had given The Red Sea Sharks a marked retrospective quality . ": null
    },
    {
        "Jean-Marc Lofficier": "jean-marc lofficier"
    },
    {
        " and Randy Lofficier thought that the story was too crowded, leaving little room for series regulars ": null
    },
    {
        "Professor Calculus": "professor calculus"
    },
    {
        " or Thomson and Thompson, and leaving the introduced figure of Skut as a nice supporting character, but nothing more . The Lofficiers stated that Hergé was doing some house-cleaning of his past works and characters before embarking on something more serious and with more personal resonance ,  Tintin in Tibet .     Hergé biographer ": null
    },
    {
        "Benoît Peeters": "benoît peeters"
    },
    {
        " described The Red Sea Sharks as a complex, ambiguous, even labyrinthine story which was undoubtedly the book in which Hergé ventured furthest into the creation of his own universe.  He thought that Hergé enters a new phase with The Red Sea Sharks, as its author seems to know his family of characters better and better, and he enjoys playing with them and his readers.  Peeters noted that the book was in some respects a continuation of  Land of Black Gold , an assessment shared by Thompson, the Lofficiers, and Farr, all of whom described it as a partial sequel to the earlier book. Thompson added that The Red Sea Sharks atoned for the relative failure of Land of Black Gold, believing that although it had a rather hasty finish , it was a first-rate thriller . The Lofficiers awarded it four out of five, stating that it was very effective as a modern political thriller and far more believable than The Calculus Affair . They also opined that it provided an effective political commentary on the Wests relationship with the Arab world. In their analysis, Tintin and Haddock seek to aid the Emir not because he is a good leader, but for their own selfish purposes , just as Western governments and corporations build alliances with Arab leaders guilty of human rights abuses in order to benefit their own interests.     Thompson felt that the inclusion of slavery as a key theme led to this book being one of Hergés more adult-oriented adventures . Nevertheless, Farr noted that the story contained a good measure of humour to balance out these darker elements. Farr drew comparisons with ": null
    },
    {
        "Anthony Powell": "anthony powell"
    },
    {
        "s  A Dance to the Music of Time , a series of novels that was contemporary to The Red Sea Sharks and which was similarly inspired by Balzacs The Human Comedy. Hergé biographer ": null
    },
    {
        "Pierre Assouline": "pierre assouline"
    },
    {
        " believed that The Red Sea Sharks represented the culmination of his golden age , which had begun with  The Blue Lotus . He also commented that it almost seemed as if Hergé had regained the pace and rhythm of his most creative period with this story.     In his ": null
    },
    {
        "psychoanalytical": "psychoanalysis"
    },
    {
        " study of The Adventures of Tintin, the ": null
    },
    {
        "literary critic": "literary criticism"
    },
    {
        " Jean-Marie Apostolidès": "jean-marie apostolidès"
    },
    {
        " expressed the view that The Red Sea Sharks reflected a world in which traditional values have been degraded and everything & ndash; including human life & ndash; has become a commodity. He added that Rastapopoulos becomes the embodiment of the global market in this story, tying together all of the other characters and therefore replacing Tintin as the figure at the centre of the universe . Apostolidès opined that The Red Sea Sharks amplifies the theme of the general equivalence of everything that is present in the series, serving as a kind of retrospective by introducing old characters and establishing new relationships between them. He believed that the theme of the ": null
    },
    {
        "mirage": "mirage"
    },
    {
        " pervaded the story, appearing repeatedly in such forms as Abdullahs ": null
    },
    {
        "cuckoo clock": "cuckoo clock"
    },
    {
        " which concealed a water squirter and the pseudonyms employed by the various characters throughout the narrative. The literary critic ": null
    },
    {
        "Tom McCarthy": "tom mccarthy"
    },
    {
        " stated that The Red Sea Sharks exhibited a number of themes that recurred throughout The Adventures of Tintin. He believed that a scene in which one of Bab El Ehrs men spies on the Emir in his mountain hideaway reflected a wider theme of eavesdropping that features throughout the series. McCarthy also highlighted Tintins actions in returning Abdullah to Khemed, expressing the view that it is part of a wider running theme throughout the series in which the hero takes an abandoned children to their home; other instances included Tintins discovery of an adoptive family for the orphan ": null
    },
    {
        "Chang Chong-Chen": "chang chong-chen"
    },
    {
        " in  The Blue Lotus  and the delivery of the lost gypsy child Miarka to her family in  The Castafiore Emerald .       In 42 a collaboration between the French studio ": null
    },
    {
        "Ellipse": "ellipse"
    },
    {
        " and the Canadian animation company ": null
    },
    {
        "Nelvana": "nelvana"
    },
    {
        " adapted 42 of the stories & ndash; among them The Red Sea Sharks & ndash; into a series of episodes, each 42 minutes long. Directed by Stéphane Bernasconi, the series has been praised for being generally faithful , with compositions having been actually directly taken from the panels in the original comic book.": null
    }
]