[
    {
        "The Emigrants  is a 42 Swedish film directed by ": null
    },
    {
        "Jan Troell": "jan troell"
    },
    {
        " and starring ": null
    },
    {
        "Max von Sydow": "max von sydow"
    },
    {
        ", ": null
    },
    {
        "Liv Ullmann": "liv ullmann"
    },
    {
        ", ": null
    },
    {
        "Eddie Axberg": "eddie axberg"
    },
    {
        " and ": null
    },
    {
        "Allan Edwall": "allan edwall"
    },
    {
        ". The screenplay is by ": null
    },
    {
        "Bengt Forslund": "bengt forslund"
    },
    {
        " and Troell. It tells the story of poor Swedes who emigrate from ": null
    },
    {
        "Småland": "småland"
    },
    {
        ", Sweden, to ": null
    },
    {
        "Minnesota": "minnesota"
    },
    {
        " in the mid42th century. The film depicts hardships in Sweden and on the journey and is based on the first two novels of ": null
    },
    {
        "The Emigrants series": "the emigrants"
    },
    {
        " by ": null
    },
    {
        "Vilhelm Moberg": "vilhelm moberg"
    },
    {
        " —  The Emigrants  and  Unto a Good Land  .     The Emigrants won international acclaim, and was nominated for ": null
    },
    {
        "Academy Award for Best Foreign Language Film": "academy award for best foreign language film"
    },
    {
        " in 42 It was nominated for four more Oscars the following year, including for ": null
    },
    {
        "Best Picture": "academy award for best picture"
    },
    {
        ". It is followed by a 42 sequel, ": null
    },
    {
        "The New Land ": "the new land"
    },
    {
        ", with the same cast. The 42 U.S. television series  The New Land  is based loosely on both The Emigrants and its sequel.       In 42 in the Swedish province of ": null
    },
    {
        "Småland": "småland"
    },
    {
        ", the Nilsson family lives in ": null
    },
    {
        "Ljuder Parish": "lessebo municipality"
    },
    {
        ", on a small farm in the woods at Korpamoen. The eldest son, Karl Oskar, inherits the farm from his father Nils, after meeting a young girl named Kristina Johansdotter, who becomes his bride. She moves to Korpamoen to live with him and his parents. In the following years, Karl Oskar and Kristina start a family, starting with a daughter, Anna, followed by Johan, Marta and Harald. The family struggles with poor weather and harvests and hunger. Karl Oskars rebellious younger brother Robert first comes across the idea of emigrating to America, tired of being treated poorly as a farmhand. He first asks his friend Arvid, another farmhand at Nybacken, to come along with him. Arvid eagerly agrees, but the pairs hopes are dashed when they realize they do not have the money needed for their passage. Robert confronts Karl Oskar about selling his share of the farm in order to afford the passage, only to find out that Karl Oskar himself had been considering the idea of moving his family to the United States. Despite the offerings of a better life, Kristina adamantly rejects the notion, not wanting to leave her homeland as well as being fearful of risking the lives of their four young children on the ocean.     However, the family loses Anna after she over-eats on unfermented grain. Devastated by this loss, Kristina agrees to Karl Oskars plan to emigrate to the United States, and they begin making preparations for the journey. Meanwhile, Kristinas uncle Danjel Andreasson comes into conflict with the parish clergy for preaching in his home the teachings of the Akian sect to which he belongs. This leads to him, his wife Inga Lena, and their four young children being exiled from Sweden. After this, Danjel arrives at Korpamoen to join the emigration party. Danjel also plans to bring two of his followers to America as well, Ulrika of Vastergohl, a former prostitute, and her sixteen-year-old daughter Elin. Robert persuades Danjel to hire Arvid and pay his fare to America. Not long afterwards, a friend and neighbor of Karl Oskar, Ulas Petterson, also expresses an interest of going with them to North America as an escape from his unhappy marriage. The night before their departure, Kristina reveals to Karl Oskar that she is expecting another child. The party travels south from Korpamoen to the port city of Karlshamn, where they board the wooden brig Charlotta, which is bound for ": null
    },
    {
        "New York City": "new york city"
    },
    {
        ". On board, Karl Oskar and Kristina meet Mans and Fina Kajsa Andersson, an elderly couple heading for the ": null
    },
    {
        "Minnesota Territory": "minnesota territory"
    },
    {
        ", where they plan to settle on their sons farm near a town called ": null
    },
    {
        "Taylors Falls": "taylors falls, minnesota"
    },
    {
        ". After hearing how good the land is there, Karl Oskar and Kristina decide to follow them to Minnesota. During the voyage, Inga Lena and Mans Andersson die of sudden illnesses, which nearly claims Kristina as well.     Upon their arrival in New York, Karl Oskar and his party along with Fina Kajsa begin the long journey westward to Minnesota, first by train, then by riverboat. During the journey from Sweden, Karl Oskar and Kristina have had difficulties dealing with Ulrika, but they quickly reconcile during a stop during the journey on the riverboat when one of Karl Oskar and Kristinas children becomes lost, only to be found by Ulrika. Not long afterwards, tragedy strikes the party again when Danjels infant daughter dies after a brief illness. The party finally arrives at the town of Stillwater and with the help of a friendly Baptist minister they are able to find their way to the widows sons farm in what is now known as the ": null
    },
    {
        "Chisago Lakes": "chisago lakes"
    },
    {
        " area. After Danjel and Ulas Petterson make their claims to fine tracts of farmland, Karl Oskar heads deep into the woods to explore the lands along the shore of lake Ki Chi Saga, now known as Chisago Lake. Upon his arrival, he finds the topsoil to be of excellent quality and makes a claim to the land for himself and Kristina and their family by carving his initials into a tree overlooking the lake.                Plans for adapting  The Emigrants  novels began late in 42 Its author, ": null
    },
    {
        "Vilhelm Moberg": "vilhelm moberg"
    },
    {
        ", had seen ": null
    },
    {
        "Jan Troell": "jan troell"
    },
    {
        "s film  Here Is Your Life  before producer ": null
    },
    {
        "Bengt Forslund": "bengt forslund"
    },
    {
        " approached him about an Emigrants film. ": null
    },
    {
        "SF Studios": "sf studios"
    },
    {
        " wished to adapt all four novels, although it was uncertain how such a film structure would work.     Moberg requested Forslund and Troell meet him, and the three men mapped out a plot, with 42 scenes, finishing in March 42 They also envisioned ": null
    },
    {
        "Max von Sydow": "max von sydow"
    },
    {
        ", ": null
    },
    {
        "Liv Ullmann": "liv ullmann"
    },
    {
        " and ": null
    },
    {
        "Eddie Axberg": "eddie axberg"
    },
    {
        " as the ideal stars. Troell and Forslund went ": null
    },
    {
        "location scouting": "location scouting"
    },
    {
        " in the United States in September 42 but found many of the lands were too developed or could not accommodate film equipment.          The scenes set in ": null
    },
    {
        "Chisago Lakes": "chisago lakes"
    },
    {
        " were actually filmed at Lake Krageholm in ": null
    },
    {
        "Scania": "scania"
    },
    {
        ", Sweden. Filming took place from June 42 to January 42 More ": null
    },
    {
        "take": "take"
    },
    {
        "s were filmed in May to August 42 Ullmann said that for the two films, shot at the same time, the actors had to learn historic methods of ": null
    },
    {
        "laundry": "laundry"
    },
    {
        ", and that the brief scene in The Emigrants where she is on a ": null
    },
    {
        "swing": "swing"
    },
    {
        " took two days to film.     The film employed 42 actors and 42 ": null
    },
    {
        "extras": "extra"
    },
    {
        ". The combined cost of the two films was ": null
    },
    {
        "kr": "swedish krona"
    },
    {
        " 42 million, then the most expensive Swedish film.       The film was released to cinemas in Sweden on 42 March 42  The film opened in ": null
    },
    {
        "New York City": "new york city"
    },
    {
        " on 42 September 42 distributed by ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        "  The U.S. version was cut from 42 to 42 minutes.     In the U.S., the film was not released on home video until February 42 when ": null
    },
    {
        "The Criterion Collection": "the criterion collection"
    },
    {
        " released it on ": null
    },
    {
        "Blu-ray": "blu-ray"
    },
    {
        " with The New Land. The films were frequently requested by customers.  The Emigrants was featured in the 42 ": null
    },
    {
        "Gothenburg Film Festival": "gothenburg film festival"
    },
    {
        ".          The film received mostly positive reviews. ": null
    },
    {
        "Roger Ebert": "roger ebert"
    },
    {
        " gave it four stars, praising it as a masterpiece, infinitely absorbing and moving, and likely more accurate than traditional stories about ": null
    },
    {
        "immigration to the United States": "history of immigration to the united states"
    },
    {
        ".  ": null
    },
    {
        "Richard Schickel": "richard schickel"
    },
    {
        " wrote in  Life  that Jan Troell has made the masterpiece about the dream that shaped America - a dream, and an America, fast disappearing from our views.  ": null
    },
    {
        "Vincent Canby": "vincent canby"
    },
    {
        " of  The New York Times  hailed the acting performances, especially from von Sydow and Ullmann, which he found to hold a kind of spontaneous truth, in look and gesture, that does a lot to relieve the otherwise programed nobility, truth and beauty. However, Canby criticized Troell for excessive views of sunlight-reflected-in-water that becomes just one too many, a thing of movie decoration. In  New York , ": null
    },
    {
        "Judith Crist": "judith crist"
    },
    {
        " praised the film as exquisite,  and that the depiction of history throbs with flesh and blood.  In  42 Nights at the Movies , ": null
    },
    {
        "Pauline Kael": "pauline kael"
    },
    {
        " declared the film is A bursting, resonant work.      In his 42 Movie Guide, ": null
    },
    {
        "Leonard Maltin": "leonard maltin"
    },
    {
        " gave the film three stars, calling it Solid if rambling.  ": null
    },
    {
        "Dave Kehr": "dave kehr"
    },
    {
        " recalled it as overrated, Uncommitted, tedious, and often dishonest.  In 42 the Swedish journal  Sydsvenskan  recalled The Emigrants as a classic.       The Emigrants was nominated for five ": null
    },
    {
        "Academy Awards": "academy awards"
    },
    {
        ", including for both ": null
    },
    {
        "Best Foreign Language Film": "academy award for best foreign language film"
    },
    {
        " and ": null
    },
    {
        "Best Picture": "academy award for best picture"
    },
    {
        ". However, the Academys rules for eligibility for specific awards meant the nominations occurred in two separate years.  It was the third film not in ": null
    },
    {
        "English": "english language"
    },
    {
        " to be nominated for Best Picture in the history of the Academy.                The sequel,  The New Land  , was released in 42 The 42 U.S. television series  The New Land  is based loosely on both The Emigrants and its sequel. The creation of the TV series can be attributed to the popularity of the films.  In Sweden, the musical  Kristina från Duvemåla  by ": null
    },
    {
        "Björn Ulvaeus": "björn ulvaeus"
    },
    {
        " and ": null
    },
    {
        "Benny Andersson": "benny andersson"
    },
    {
        ", formerly of ": null
    },
    {
        "ABBA": "abba"
    },
    {
        " fame, was designed partly in reaction to Troells films, particularly in differences in the set.  Troell also gave his approval to ": null
    },
    {
        "Daniel Espinosa": "daniel espinosa"
    },
    {
        " to make a new Emigrants film adaptation in 42      The two films were considered to give ": null
    },
    {
        "Jan Troell": "jan troell"
    },
    {
        " his international breakthrough.  The films led to his accepting an offer from ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        " to make  Zandys Bride , one of the first times a prominent Swedish director moved to Hollywood since the 42s.": null
    }
]