[
    {
        "         The Man in the High Castle is an ": null
    },
    {
        "alternate history": "alternate history"
    },
    {
        " novel by American writer ": null
    },
    {
        "Philip K. Dick": "philip k. dick"
    },
    {
        ". Set in 42 fifteen years after an alternative ending to ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", the novel concerns intrigues between the ": null
    },
    {
        "victorious Axis Powers": "hypothetical axis victory in world war ii"
    },
    {
        "—primarily, ": null
    },
    {
        "Imperial Japan": "empire of japan"
    },
    {
        " and ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        "—as they rule over the former United States, as well as daily life under the resulting totalitarian rule. The Man in the High Castle won the ": null
    },
    {
        "Hugo Award for Best Novel": "hugo award for best novel"
    },
    {
        " in 42 Beginning in 42 the book was adapted as a ": null
    },
    {
        "multi-season TV series": "the man in the high castle"
    },
    {
        ", with Dicks daughter, ": null
    },
    {
        "Isa Dick Hackett": "isa dick hackett"
    },
    {
        ", serving as one of the shows producers.     Reported inspirations include ": null
    },
    {
        "Ward Moore": "ward moore"
    },
    {
        "s alternate Civil War history,  Bring the Jubilee  , various classic World War II histories, and the  I Ching  . The novel features a novel within the novel comprising an alternate history within this alternate history wherein the Allies defeat the Axis .           In the novels alternate history, US President ": null
    },
    {
        "Franklin D. Roosevelt": "franklin d. roosevelt"
    },
    {
        " was assassinated by ": null
    },
    {
        "Giuseppe Zangara": "giuseppe zangara"
    },
    {
        " in 42  leading to the continuation of the ": null
    },
    {
        "Great Depression": "great depression"
    },
    {
        " and ": null
    },
    {
        "US isolationism": "united states non-interventionism"
    },
    {
        " during the opening of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ". ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        " led ": null
    },
    {
        "Nazi Germany": "nazi germany"
    },
    {
        " to conquer most of Europe and the Soviet Union, murdering ": null
    },
    {
        "Jews": "jews"
    },
    {
        ", ": null
    },
    {
        "Roma": "romani people"
    },
    {
        ", ": null
    },
    {
        "Slavs": "slavs"
    },
    {
        ", and other groups. Meanwhile, ": null
    },
    {
        "Imperial Japan": "empire of japan"
    },
    {
        " occupied Eastern Asia and ": null
    },
    {
        "Oceania": "oceania"
    },
    {
        ". The Nazis then, with help of their allies, conquered most of ": null
    },
    {
        "Africa": "africa"
    },
    {
        ". As Japan invaded the US ": null
    },
    {
        "West Coast": "west coast of the united states"
    },
    {
        ", Germany invaded the US ": null
    },
    {
        "East Coast": "east coast of the united states"
    },
    {
        ". By 42 the US and the remaining Allies surrendered to the Axis, ending the war.     By the 42s, Imperial Japan and Nazi Germany are the worlds ": null
    },
    {
        "competing": "cold war"
    },
    {
        " superpower": "superpower"
    },
    {
        "s, with Japan ": null
    },
    {
        "establishing": "greater east asia co-prosperity sphere"
    },
    {
        " the Pacific States of America from the former ": null
    },
    {
        "Western United States": "western united states"
    },
    {
        " and the remaining ": null
    },
    {
        "Rocky Mountain States": "mountain states"
    },
    {
        " being a neutral ": null
    },
    {
        "buffer zone": "buffer zone"
    },
    {
        " between the P.S.A. and the Nazi-occupied former ": null
    },
    {
        "Eastern United States": "eastern united states"
    },
    {
        ". In the East, there are two countries: The South is a racist puppet regime which collaborates with the Nazis. The United States of America still exist by name in the Northeast of the former territory and are controlled by a German military governor. For unexplained reasons, ": null
    },
    {
        "Canada": "canada"
    },
    {
        " remains independent despite being part of the Allies.     Hitler, though still alive, is incapacitated from advanced ": null
    },
    {
        "syphilis": "syphilis"
    },
    {
        ", and ": null
    },
    {
        "Martin Bormann": "martin bormann"
    },
    {
        " has become ": null
    },
    {
        "Chancellor of Germany": "chancellor of germany"
    },
    {
        ", with ": null
    },
    {
        "Goebbels": "joseph goebbels"
    },
    {
        ", ": null
    },
    {
        "Heydrich": "reinhard heydrich"
    },
    {
        ", ": null
    },
    {
        "Göring": "hermann göring"
    },
    {
        ", ": null
    },
    {
        "Seyss-Inquart": "arthur seyss-inquart"
    },
    {
        " , and other Nazi leaders soon vying to take his place. The Nazis have ": null
    },
    {
        "drained the Mediterranean": "atlantropa"
    },
    {
        " to ": null
    },
    {
        "make room": "lebensraum"
    },
    {
        " for farmland, developed and used the ": null
    },
    {
        "hydrogen bomb": "thermonuclear weapon"
    },
    {
        ", and designed rockets for extremely fast travel across the world as well as space, having ": null
    },
    {
        "colonized": "space colonization"
    },
    {
        " the ": null
    },
    {
        "Moon": "moon"
    },
    {
        ", ": null
    },
    {
        "Venus": "venus"
    },
    {
        ", and ": null
    },
    {
        "Mars": "mars"
    },
    {
        ". The novel is set mostly in ": null
    },
    {
        "San Francisco": "san francisco"
    },
    {
        ". Here, Chinese residents first appear in the novel as ": null
    },
    {
        "second-class citizen": "second-class citizen"
    },
    {
        "s and ": null
    },
    {
        "black people": "black people"
    },
    {
        " are slaves. The secondary setting of the novel is the Rocky Mountains States, namely the cities of ": null
    },
    {
        "Cañon City": "cañon city"
    },
    {
        ", ": null
    },
    {
        "Denver": "denver"
    },
    {
        " and ": null
    },
    {
        "Cheyenne": "cheyenne, wyoming"
    },
    {
        ".       In 42 fifteen years after Imperial Japan and Nazi Germany have won World War II, Robert Bob Childan owns an ": null
    },
    {
        "Americana": "americana"
    },
    {
        " antique shop": "antique shop"
    },
    {
        " in ": null
    },
    {
        "San Francisco, California": "san francisco, california"
    },
    {
        " , which is most commonly frequented by the Japanese, who make a fetish of romanticized American cultural artifacts. Childan is contacted by Nobusuke Tagomi, a high-ranking Japanese trade official, who is seeking a gift to impress a visiting ": null
    },
    {
        "Swedish": "sweden"
    },
    {
        " industrialist named Baynes. Childans store is stocked in part with counterfeit antiques from the Wyndam-Matson Corporation, a ": null
    },
    {
        "metalworking": "metalworking"
    },
    {
        " company. Frank Frink , a secretly ": null
    },
    {
        "Jewish-American": "american jews"
    },
    {
        " veteran of ": null
    },
    {
        "World War II": "world war ii"
    },
    {
        ", has just been fired from the Wyndam-Matson factory, when he agrees to join a former coworker to begin a handcrafted jewelry business. Meanwhile, Frinks ex-wife, Juliana, works as a ": null
    },
    {
        "judo": "judo"
    },
    {
        " instructor in ": null
    },
    {
        "Canon City, Colorado": "canon city, colorado"
    },
    {
        " , where she begins a sexual relationship with an ": null
    },
    {
        "Italian": "italians"
    },
    {
        " truck driver and ex-soldier, Joe Cinnadella. Throughout the book, many of these characters frequently make important decisions using prophetic messages they interpret from the  I Ching , a Chinese cultural import. Many characters are also reading a widely banned yet extremely popular new novel, The Grasshopper Lies Heavy, which ": null
    },
    {
        "depicts an alternate history": "story within a story"
    },
    {
        " in which the ": null
    },
    {
        "Allies": "allies of world war ii"
    },
    {
        " won World War II in 42 a concept that amazes and intrigues its readers.     Frink reveals that the Wyndam-Matson Corporation has been supplying Childan with ": null
    },
    {
        "counterfeit": "counterfeit"
    },
    {
        " antiques, which effectively works to ": null
    },
    {
        "blackmail": "blackmail"
    },
    {
        " Wyndam-Matson for money to finance Frinks new jewelry venture. Tagomi and Baynes meet, but Baynes repeatedly delays any real business as they await an expected third party from Japan. Suddenly, the public receives news of the death of the recently-ill ": null
    },
    {
        "Chancellor of Germany": "chancellor of germany"
    },
    {
        ", ": null
    },
    {
        "Martin Bormann": "martin bormann"
    },
    {
        ". Childan tentatively, on ": null
    },
    {
        "consignment": "consignment"
    },
    {
        ", takes some of Frinks authentic new metalwork and attempts to curry favor with a Japanese client, who surprisingly considers Frinks jewelry immensely ": null
    },
    {
        "spiritually alive": "wu"
    },
    {
        ". Juliana and Joe take a ": null
    },
    {
        "road trip": "road trip"
    },
    {
        " to ": null
    },
    {
        "Denver, Colorado": "denver, colorado"
    },
    {
        ", and Joe impulsively decides they should go on a side-trip to meet the mysterious Hawthorne Abendsen, author of The Grasshopper Lies Heavy, who supposedly lives in a guarded fortress-like estate called the High Castle in ": null
    },
    {
        "Cheyenne, Wyoming": "cheyenne, wyoming"
    },
    {
        ". Soon, ": null
    },
    {
        "Joseph Goebbels": "joseph goebbels"
    },
    {
        " is announced as the new German Chancellor.     Baynes and Tagomi finally meet their Japanese contact as the Nazi secret police, the  Sicherheitsdienst  , close in to arrest Baynes, who is revealed to be a Nazi defector named Rudolf Wegener. Wegener warns his contact, a famed Japanese general, of Operation Dandelion, an upcoming Goebbels-approved plan for the Nazis to launch a surprise attack on the ": null
    },
    {
        "Japanese Home Islands": "japanese archipelago"
    },
    {
        ", in order to obliterate them in one swift stroke. As Frink is elsewhere exposed as a Jew and arrested, Wegener and Tagomi are confronted by two SD agents, both of whom Tagomi shoots dead with an antique American pistol. Back in Colorado, Joe abruptly changes his appearance and mannerisms before the trip to the High Castle, leading Juliana to deduce that he intends to murder Abendsen. Joe confirms this, revealing himself to be an undercover Swiss Nazi assassin. Juliana mortally wounds Joe and drives off to warn Abendsen of the threat to his life.     Wegener flies back to Germany and learns that ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        " has launched a coup against Goebbels, possibly installing himself as Chancellor. Meanwhile, Tagomi remains shaken by the shootout and goes to Childan to sell back the gun he used in the fight; instead, sensing the energy from one of Frinks jewelry items, Tagomi impulsively buys it from Childan. Tagomi then undergoes a spiritually intense experience during which he momentarily perceives an alternative-history version of San Francisco.  Later, Tagomi on a whim forces the German authorities to release Frink, whom Tagomi has never met and does not know is the maker of the jewelry. Juliana soon has her own spiritual experience when she arrives in Cheyenne. There, she discovers that Abendsen now lives in a normal house with his family, having left behind the High Castle due to a change of outlook; he no longer preoccupies himself with thoughts that he might soon be assassinated. After dodging many of Julianas questions about his inspiration for his novel, Abendsen finally confesses that he used the I Ching to guide his writing of The Grasshopper Lies Heavy. Before leaving, Juliana infers then that Truth wrote the book in order to reveal the Inner Truth that Japan and Germany really lost World War II.     The Grasshopper Lies Heavy The Man in the High Castle read the popular novel The Grasshopper Lies Heavy, by Hawthorne Abendsen, whose title is assumed or supposed to have come from the Bible  verse The grasshopper shall be a burden . Thus, The Grasshopper Lies Heavy constitutes a ": null
    },
    {
        "novel within a novel": "story within a story"
    },
    {
        ", wherein Abendsen writes of an alternative universe, where the Axis Powers lost World War II . For this reason, the Germans have banned the novel in the occupied US,  but it is widely read in the Pacific, and its publication is legal in the neutral countries.     The Grasshopper Lies Heavy postulates that President Roosevelt survives an assassination attempt but forgoes ": null
    },
    {
        "re-election in 42": "1940 united states presidential election"
    },
    {
        ", honoring ": null
    },
    {
        "George Washington": "george washington"
    },
    {
        "s ": null
    },
    {
        "two-term limit": "term limits in the united states"
    },
    {
        ". The next president, ": null
    },
    {
        "Rexford Tugwell": "rexford tugwell"
    },
    {
        ", removes the ": null
    },
    {
        "Pacific Fleet": "united states pacific fleet"
    },
    {
        " from ": null
    },
    {
        "Pearl Harbor": "pearl harbor"
    },
    {
        ", Hawaii, saving it from Japanese attack, which ensures that the US enters the conflict a well-equipped naval power.  The United Kingdom retains most of its military-industrial strength, contributing more to the Allied war effort, leading to ": null
    },
    {
        "Rommel": "erwin rommel"
    },
    {
        "s defeat in ": null
    },
    {
        "North Africa": "north african campaign"
    },
    {
        "; the British advance through the ": null
    },
    {
        "Caucasus": "caucasus"
    },
    {
        " to fight alongside the Soviets to victory in the ": null
    },
    {
        "Battle of Stalingrad": "battle of stalingrad"
    },
    {
        "; ": null
    },
    {
        "Italy": "kingdom of italy"
    },
    {
        " and ": null
    },
    {
        "Hungary": "kingdom of hungary"
    },
    {
        " renege on their membership in the Axis Powers and betray them; British tanks and the ": null
    },
    {
        "Red Army": "red army"
    },
    {
        " jointly conquer Berlin; at the end of the war, the Nazi leaders—including Adolf Hitler—are tried for their war crimes, and the Führers last words are Deutsche, hier steh ich ,  in imitation of ": null
    },
    {
        "Martin Luther": "martin luther"
    },
    {
        ".     After the war, President Tugwell initiates the ": null
    },
    {
        "New Deal": "new deal"
    },
    {
        " on a worldwide scale. With American assistance, China goes through a decade of rebuilding. People in lesser developed places in Africa and Asia are sent television kits, through which they learn how to read and receive instructions on practical skills such as digging wells and purifying water. In turn, these places become markets for American factories. In the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        ", social and economic progress has also brought relief to the masses in India, Burma, Africa and the Middle East. In Europe, there is peace and harmony not only with itself but with the rest of the world. The Soviet Union, crippled by war losses, is divided up.      Around ten years after the end of the war, the British Empire, still under the leadership of ": null
    },
    {
        "Winston Churchill": "winston churchill"
    },
    {
        ", becomes more racist and expansionist, establishing detention preserves for disloyal Chinese in South Asia, and suspecting that the US is undermining its rule in South Asia. Meanwhile, the US has ended racial discrimination by the 42s. Whites and Blacks are able to live and work shoulder by shoulder.   These changes provoke racial-cultural tensions between the US and the UK, leading them to a Cold War for global ": null
    },
    {
        "hegemony": "hegemony"
    },
    {
        " between their two vaguely liberal, democratic, capitalist societies. Although the end of the novel is never depicted in the text, one character claims the book ends with the British Empire eventually defeating the US, becoming the sole world superpower.        Dick said he conceived The Man in the High Castle when reading  Bring the Jubilee  , by ": null
    },
    {
        "Ward Moore": "ward moore"
    },
    {
        ", which occurs in an alternative nineteenth-century US wherein the ": null
    },
    {
        "Confederate States of America": "confederate states of america"
    },
    {
        " won the ": null
    },
    {
        "American Civil War": "american civil war"
    },
    {
        ". In the acknowledgments to the book, he mentions other influences:  The Rise and Fall of the Third Reich  , by ": null
    },
    {
        "William L. Shirer": "william l. shirer"
    },
    {
        ";  Hitler: A Study in Tyranny  , by ": null
    },
    {
        "Alan Bullock": "alan bullock"
    },
    {
        "; The Goebbels Diaries  , ": null
    },
    {
        "Louis P. Lochner": "louis p. lochner"
    },
    {
        ", translator; Foxes of the Desert , by ": null
    },
    {
        "Paul Carrell": "paul carrell"
    },
    {
        "; and the 42 translation of the  I Ching  by ": null
    },
    {
        "Richard Wilhelm": "richard wilhelm"
    },
    {
        ".      The acknowledgments have three references to traditional Japanese and Tibetan poetic forms; volume one of the Anthology of Japanese Literature , edited by ": null
    },
    {
        "Donald Keene": "donald keene"
    },
    {
        ", from which is cited the  haiku  on page 42; from Zen and Japanese Culture , by ": null
    },
    {
        "Daisetz Teitaro Suzuki": "d. t. suzuki"
    },
    {
        ", from which is cited a  waka  on page 42; and the  Tibetan Book of the Dead  , edited by ": null
    },
    {
        "Walter Evans-Wentz": "walter evans-wentz"
    },
    {
        ".     ": null
    },
    {
        "Nathanael West": "nathanael west"
    },
    {
        "s  Miss Lonelyhearts  West, Nathanael Miss Lonelyhearts, New York, N.Y.: ": null
    },
    {
        "Liveright Publ.": "boni  &  liveright"
    },
    {
        " is also mentioned in the text,  written before the Roosevelt assassination divergence point that separates the world of The Man in the High Castle from ours. In this novella, Miss Lonelyhearts is a male newspaper journalist who writes anonymous advice as an ": null
    },
    {
        "agony aunt": "advice column"
    },
    {
        " to forlorn readers during the height of the Great Depression; hence, Miss Lonelyhearts tries to find consolation in religion, casual sex, rural vacations, and work, none of which provide him with the sense of authenticity and engagement with the outside world that he needs. Wests book is about the elusive quality of interpersonal relationships and quest for personal meaning at a time of political turmoil within the United States.     Philip Dick used the I Ching to make decisions crucial to the plot of The Man in the High Castle just as characters within the novel use the I Ching to guide decisions.             In The Religion of Science Fiction, Frederick A. Kreuziger explores the theory of history implied by Dicks creation of the two alternative realities:     Neither of the two worlds, however, the revised version of the outcome of WWII nor the fictional account of our present world, is anywhere near similar to the world we are familiar with. But they could be! This is what the book is about. The book argues that this world, described twice, although differently each time, is exactly the world we know and are familiar with. Indeed, it is the only world we know: the world of chance, luck, fate.      ": null
    },
    {
        "Avram Davidson": "avram davidson"
    },
    {
        " praised the novel as a superior work of fiction , citing Dicks use of the I Ching as fascinating . Davidson concluded that Its all here— extrapolation, suspense, action, art, philosophy, plot, character. Books ,  The Magazine of Fantasy & Science Fiction , June 42 p.42     The Man in the High Castle secured for Dick the 42 ": null
    },
    {
        "Hugo Award for Best Novel": "hugo award for best novel"
    },
    {
        ".        A new ": null
    },
    {
        "paperback": "paperback"
    },
    {
        " edition of the novel was published in 42 by ": null
    },
    {
        "Vintage Books": "vintage books"
    },
    {
        ".          An unabridged The Man in the High Castle audiobook, read by ": null
    },
    {
        "George Guidall": "george guidall"
    },
    {
        " and running approximately 42 hours over seven ": null
    },
    {
        "audio cassettes": "compact cassette"
    },
    {
        ", was released in 42  Another unabridged audiobook version was released in 42 by ": null
    },
    {
        "Blackstone Audio": "blackstone audio"
    },
    {
        ", read by ": null
    },
    {
        "Tom Wyner": "tom wyner"
    },
    {
        " and running approximately 42 hours over seven ": null
    },
    {
        "CDs": "compact disc"
    },
    {
        ".   A third unabridged audiobook recording was released in 42 by ": null
    },
    {
        "Brilliance Audio": "amazon brilliance audio"
    },
    {
        ", read by Jeff Cummings with a running time of 42 hours 42 minutes.              After a number of attempts to adapt the book to the screen, in October 42 ": null
    },
    {
        "Amazon": "amazon"
    },
    {
        "s film production unit began filming the pilot episode of The Man in the High Castle in ": null
    },
    {
        "Roslyn, Washington": "roslyn, washington"
    },
    {
        ", for release through the ": null
    },
    {
        "Amazon Prime": "amazon prime"
    },
    {
        " Web video streaming service.   The pilot episode was released by ": null
    },
    {
        "Amazon Studios": "amazon studios"
    },
    {
        " on January 42 42   and was Amazons most watched pilot ever according to Amazon Studios vice president, Roy Price.  On February 42 42 Amazon green-lit the series.  The show became available for streaming on November 42 42      The television series diverges from the novel in many respects. Both the Pacific States of America and the Eastern American puppet state appear to be mere provinces of the Empire of Japan and the Greater Nazi Reich without any apparent autonomous  government institutions. The Rocky Mountain States become an ": null
    },
    {
        "anarchic": "anarchy"
    },
    {
        " Neutral Zone. World War II appears to have ended following the destruction of Washington, D.C. with an atomic bomb, rather than a land invasion as in the book. As for Hitler, while elderly, he is apparently mostly hale in his Season 42 finale appearance, though other characters elsewhere in the season do reference his supposed physical infirmity. In the novel, the Italian Empire is a minor power that controls North Africa and the Middle East; in the series, it is shown through maps that these territories are part of the Nazi Empire, suggesting that either the Italian Empire was annexed after the war or is self-governing within the Reich. The drying of the Mediterranean has never happened, though a slightly similar event is mentioned by a character in Season Two as being planned.     Characters from the book that do appear are in most cases far more fleshed out with deeper and sometimes rather different backstories than their novel originals. For instance, Wegener is a  Standartenführer  in the ": null
    },
    {
        "SS": "schutzstaffel"
    },
    {
        ", rather than a naval captain. Rather than being a member of an organized internal resistance Wegener is a close personal confidante of Hitler and his disillusionment with the regime appears to be largely personal. Juliana and Frank are unmarried, but living together, rather than divorced and separated. Frank has a sister, nephew and niece, although they are killed early in the series, and this propels him into a more active role in relation to the resistance. Juliana also has a sister whose murder by the  Kempeitai  early in the season instigates her search for the mysterious Man in the High Castle, as well as her having a mother and stepfather who are significant supporting characters. Joe Cinnadella is renamed Joe Blake and, as he becomes closer to Juliana, appears to have growing doubts about his role as a Nazi agent. Robert Childan starts season 42 as a minor character but later becomes a main protagonist, starting a trade in the Pacific States and in the Neutral Zone, while Ed McCarthy has a rather more prominent and active role, being revealed as ": null
    },
    {
        "homosexual": "homosexuality"
    },
    {
        " in Season 42     There are several major additional characters introduced by the television series, and numerous narrative details and plotline elements differ radically from the source novel. For example, the planned Nazi ": null
    },
    {
        "pre-emptive nuclear strike": "pre-emptive nuclear strike"
    },
    {
        " on Japan, Operation Dandelion , is apparently being prevented only by Hitlers personal refusal to authorize it, leading Heydrich and the faction demanding pre-emptive war to plot the Führers assassination. In addition, Hawthorne Abendsen does not appear in the first season of the television version and The Grasshopper Lies Heavy is a series of ": null
    },
    {
        "newsreel": "newsreel"
    },
    {
        " films depicting multiple alternative realities rather than a novel . As of the Season 42 finale, these films are being tracked down by SS agents like Blake for dispatch to Hitler for an as-yet-unknown purpose.     In season two, a map of the world is shown on John Smiths wall. On this map, Japan controls the entirety of the Pacific Ocean and most of the Asian continent, including China, India and half of Russia. Japan is also shown to control Australia, New Zealand, western Canada, Alaska, and all Pacific states of the United States. The Japanese Empire controls Baja California and South American countries like Peru and Chile. In contrast, Nazi Germany is shown as controlling all of Europe, Africa and the Middle East. The German Empire also controls all of the United States and Canada up to the Rockies in the west and South America including Brazil. Germany also controls the western parts of former USSR such as Ukraine. There are also buffer zones between the empires. Neither empire seems to have invaded Mexico and this neutral zone continues up through the Rockies and through Canada. A similar neutral zone is seen dividing Russia in half.     Season two also shows two very different lifestyles in the Japanese-controlled Pacific states and the German-controlled east. The Germans have colonized the eastern states and are assimilating its inhabitants into Nazi beliefs. The Japanese Empire is occupying the Pacific states rather than colonizing them. There is enforced segregation between Japanese and Americans citizens. It is implied that Native Americans were exterminated by the Germans, and that the Japanese exterminated the Native Hawaiians and Pacific Islanders, along with most Alaska natives.       In a 42 interview, Dick said he planned to write a sequel novel to The Man in the High Castle: And so theres no real ending on it. I like to regard it as an open ending. It will segue into a sequel sometime.  Dick said that he had started several times to write a sequel ,  but progressed little, because he was too disturbed by his original research for The Man in the High Castle and could not mentally bear to go back and read about Nazis again . He suggested that the sequel would be a collaboration with another author: Somebody would have to come in and help me do a sequel to it. Someone who had the stomach for the stamina to think along those lines, to get into the head; if youre going to start writing about ": null
    },
    {
        "Reinhard Heydrich": "reinhard heydrich"
    },
    {
        ", for instance, you have to get into his face. Can you imagine getting into Reinhard Heydrichs face?     Two chapters of the proposed sequel were published in The Shifting Realities of Philip K. Dick,  a collection of his essays and other writings.     Dicks novel  Radio Free Albemuth  is rumored to have started as a sequel to The Man in the High Castle.  Dick described the plot of this early version of Radio Free Albemuth—then titled VALISystem A—writing: ... a divine and loving ETI  ... help Hawthorne Abendsen, the protagonist-author in The Man in the High Castle, continue on in his difficult life after the Nazi secret police finally got to him  ... VALISystem A, located in deep space, sees to it that nothing, absolutely nothing, can prevent Abendsen from finishing his novel.     The novel eventually evolved into a new story unrelated to The Man in the High Castle. Dick ultimately abandoned the Albemuth book, unpublished during his lifetime, though portions were salvaged and used for 42s  VALIS . Radio Free Albemuth was published in 42 three years after Dicks death. ": null
    }
]