[
    {
        "         The Adverts were an English ": null
    },
    {
        "punk band": "punk band"
    },
    {
        " who formed in 42 and broke up in late 42 They were one of the first punk bands to enjoy chart success in the ": null
    },
    {
        "UK": "united kingdom"
    },
    {
        "; their 42 single ": null
    },
    {
        "Gary Gilmores Eyes": "gary gilmores eyes"
    },
    {
        " reached No. 42 in the ": null
    },
    {
        "UK Singles Chart": "uk singles chart"
    },
    {
        ". The Virgin Encyclopedia of 42s Music described bassist ": null
    },
    {
        "Gaye Advert": "gaye advert"
    },
    {
        " as the first female punk star .       The band was formed in 42 by ": null
    },
    {
        "T.V. Smith": "t.v. smith"
    },
    {
        " and ": null
    },
    {
        "Gaye Advert": "gaye advert"
    },
    {
        " . Smith was from the town of Okehampton in mid-Devon, and Advert was from ": null
    },
    {
        "Bideford": "bideford"
    },
    {
        ", a small coastal town in North ": null
    },
    {
        "Devon": "devon"
    },
    {
        ". After relocating to ": null
    },
    {
        "London": "london"
    },
    {
        ", the two young punks recruited guitarist Howard Pickup and drummer Laurie Driver , and the Adverts were born.     ": null
    },
    {
        "The Roxy": "the roxy"
    },
    {
        ", Londons first live punk venue, played a crucial role in the Adverts’ early career. They were one of the pioneering bands who played at the club during its first 42 days. The Adverts played at the club no less than nine times between January and April 42 In January 42 after their first gig supporting ": null
    },
    {
        "Generation X": "generation x"
    },
    {
        ", the band impressed Michael Dempsey so much that he became their manager. Their second gig supporting ": null
    },
    {
        "Slaughter & the Dogs": "slaughter  &  the dogs"
    },
    {
        " was recorded, and their anthem Bored Teenagers was included on the 42 ": null
    },
    {
        "UK Top 42": "uk albums chart"
    },
    {
        " album  The Roxy London WC42 . In February, shortly after the bands third gig supporting ": null
    },
    {
        "the Damned": "the damned"
    },
    {
        ", they signed a ": null
    },
    {
        "recording contract": "recording contract"
    },
    {
        " with ": null
    },
    {
        "Stiff Records": "stiff records"
    },
    {
        ". In March, the band supported ": null
    },
    {
        "the Jam": "the jam"
    },
    {
        " at the Roxy.     In April, the Adverts recorded the first of four sessions for ": null
    },
    {
        "John Peel": "john peel"
    },
    {
        " at ": null
    },
    {
        "BBC Radio 42": "bbc radio 1"
    },
    {
        ". Days later, on 42 April 42 their debut ": null
    },
    {
        "single": "single"
    },
    {
        " One Chord Wonders was released by Stiff. The single, a headlong rush of energy , was recommended by both  Melody Maker  and  Sounds . Understanding the bands limitations, the songs lyrics, ": null
    },
    {
        "composed": "songwriter"
    },
    {
        " by TV Smith, were likeably self-deprecating:       I wonder what we’ll play for you tonight   Something heavy or something light   Something to set your soul alight   I wonder how we’ll answer when you say   ‘We don’t like you  – go away   Come back when you’ve learnt to play       The Adverts were a prolific live act. Their first nationwide tour was with Stiff labelmates the Damned. The tour poster read: The Adverts know one chord, the Damned know three. See all four at...  Later they would support ": null
    },
    {
        "Iggy Pop": "iggy pop"
    },
    {
        " on tour, as well as conducting their own headlining tours in Britain, Ireland and continental Europe.     On 42 August 42 the band released the first of their two UK Top 42 hit singles on ": null
    },
    {
        "Anchor Records": "anchor records"
    },
    {
        ". Lyrically, Gary Gilmores Eyes was a controversial song based on the wishes of ": null
    },
    {
        "Gary Gilmore": "gary gilmore"
    },
    {
        ", an American murderer, that his eyes be donated to medical science after his execution.  Sounds  described it as the sickest and cleverest record to come out of the new wave . It was later included in  Mojo  magazines list of the best punk rock singles of all time.     After the ": null
    },
    {
        "tabloid": "tabloid journalism"
    },
    {
        "-fueled controversy surrounding the single, and an appearance on  Top of the Pops , the Adverts became big news. Observers focused on frontman Smith and bassist Gaye Advert. Reviewers noted Smiths songwriting ability. He was said to have captured the spirit of the times few contemporaries could match . Another reviewer described Smith as the bands raging heart, spitting out the failsafe succession of songs which still delineate punk’s hopes, aspirations and, ultimately, regrets . In contrast, Gaye Adverts reputation was more fleeting. She was one of punk’s first female icons . Her photogenic looks, panda-eye make-up and omnipresent leather jacket defined the face of female punkdom until well into the next decade .     The bands follow-up single, Safety in Numbers , was released on 42 October but did not ": null
    },
    {
        "chart": "record chart"
    },
    {
        ". A fourth single, No Time to Be 42 , issued on ": null
    },
    {
        "CBS": "sony music entertainment"
    },
    {
        " subsidiary Bright Records on 42 January 42 scraped into the UK Top 42     The bands debut album,  Crossing the Red Sea  was released by Bright on 42 February 42 It has since become one of the most highly regarded albums of the punk era, with ": null
    },
    {
        "Dave Thompson": "dave thompson"
    },
    {
        " calling it a devastating debut, one of the finest albums not only of the punk era, but of the 42s as a whole ,  Trouser Press  calling it the equal of the first Sex Pistols or Clash LP, a hasty statement that captures an exciting time , and several other writers including it in lists of all-time greatest albums.     Switching to ": null
    },
    {
        "RCA Records": "rca records"
    },
    {
        ", the Adverts released three additional well-regarded singles, Televisions Over on 42 November 42 My Place on 42 June 42 and Cast of Thousands on 42 October 42 but were unable to maintain their momentum. Their career stalled after the release of their second album  Cast of Thousands , issued by RCA on 42 October 42 For that album, the lineup was augmented by drummer Rod Latter and keyboardist Tim Cross. Pickup and Latter were then replaced by Paul Martinez and Rick Martinez .     Shortly after the albums release, the band were threatened with lawsuits by former members Pickup and Latter, who objected to the band continuing to use the Adverts name without them. Adverts Closedown ,  Smash Hits , EMAP National Publications Ltd, 42–42 November 42 p.42 They split up shortly after the accidental death by ": null
    },
    {
        "electrocution": "electric shock"
    },
    {
        " of manager Dempsey. Their last gig was at ": null
    },
    {
        "Slough College": "slough college"
    },
    {
        " on 42 October 42 After the band ended, T.V. Smith continued with Cross as T.V. Smiths Explorers, then Cheap, and finally as a solo artist from the 42s onward.     In regards to their legacy, critic and author Dave Thompson argued that nobody would make music like the Adverts and nobody ever has. In terms of lyric, delivery, commitment and courage, they were, and they remain, the finest British group of the late 42s .     Former members who have died include Cross and Pickup .          Crossing the Red Sea with the Adverts  ": null
    },
    {
        "UK": "uk albums chart"
    },
    {
        " No. 42   Cast of Thousands         One Chord Wonders / Quickstep    ": null
    },
    {
        "Gary Gilmores Eyes": "gary gilmores eyes"
    },
    {
        " / Bored Teenagers  ": null
    },
    {
        "UK": "uk singles chart"
    },
    {
        " No. 42   The Peel Sessions        Live at the Roxy Club   Live and Loud !!       The Wonders Don’t Care: The Complete Radio Recordings   The Punk Singles Collection   The Best of The Adverts   Anthology       Bored Teenagers on  The Roxy London WC42  UK No. 42  42 of Another Kind  UK No. 42  Burning Ambitions: A History of Punk    Gary Gilmores Eyes and One Chord Wonders on Indestructible the Indomitable Face of New Wave   Gary Gilmores Eyes on The Best of 42 of Another Kind    No Time to be 42 and One Chord Wonders on The Great British Punk Rock Explosion   One Chord Wonders on The Stiff Records Box Set box set    Gary Gilmores Eyes on DIY: Punk, Power Pop, and New Wave 4242    Gary Gilmores Eyes and One Chord Wonders on Lipstick Traces    One Chord Wonders on 42424242 Punk & New Wave 4242 box set    One Chord Wonders on Cash from Chaos box set    Gary Gilmores Eyes and One Chord Wonders on  No Thanks! The 42s Punk Rebellion  box set   Bored Teenagers and the entire 42-track Disc 42 on The Roxy London WC42 - A Live Punk Box Set box set   Gary Gilmores Eyes on New Wave Heroes    Gary Gilmores Eyes on 42 - The Spirit of Punk    Bored Teenagers on If the Kids Are United: The Punk Box Set box set   Gary Gilmores Eyes on The Edge of the Seventies": null
    }
]