[
    {
        "                 is an ": null
    },
    {
        "action-adventure": "action-adventure"
    },
    {
        " video game franchise": "video game franchise"
    },
    {
        " created by Japanese ": null
    },
    {
        "game designers": "game designers"
    },
    {
        " Shigeru Miyamoto": "shigeru miyamoto"
    },
    {
        " and ": null
    },
    {
        "Takashi Tezuka": "takashi tezuka"
    },
    {
        ". It is primarily developed and published by ": null
    },
    {
        "Nintendo": "nintendo"
    },
    {
        ", although some portable installments and re-releases have been outsourced to ": null
    },
    {
        "Capcom": "capcom"
    },
    {
        ", ": null
    },
    {
        "Vanpool": "vanpool"
    },
    {
        ", and ": null
    },
    {
        "Grezzo": "grezzo"
    },
    {
        ". The gameplay incorporates ": null
    },
    {
        "action-adventure": "action-adventure game"
    },
    {
        " and elements of ": null
    },
    {
        "action RPG": "action role-playing game"
    },
    {
        " games.     The series centers on ": null
    },
    {
        "Link": "link"
    },
    {
        ", the ": null
    },
    {
        "elf": "elf"
    },
    {
        "-like ": null
    },
    {
        "player character": "player character"
    },
    {
        " and chief ": null
    },
    {
        "protagonist": "protagonist"
    },
    {
        ". Link is often given the task of rescuing ": null
    },
    {
        "Princess Zelda": "princess zelda"
    },
    {
        " and the kingdom of ": null
    },
    {
        "Hyrule": "universe of the legend of zeldahyrule"
    },
    {
        " from ": null
    },
    {
        "Ganon": "ganon"
    },
    {
        ", an evil warlord turned demon who is the principal antagonist of the series; however, other settings and antagonists have appeared in several games. The plots commonly involve the ": null
    },
    {
        "Triforce": "triforce"
    },
    {
        ", a relic representing the virtues of Courage, Wisdom and Power that together are omnipotent. The protagonist in each game is usually not the same incarnation of Link, but a few exceptions exist.     Since the ": null
    },
    {
        "original Legend of Zelda": "the legend of zelda"
    },
    {
        " was released in 1986, the series has expanded to include ": null
    },
    {
        "19 entries": "list of the legend of zelda mediamain series"
    },
    {
        " on all of Nintendos major ": null
    },
    {
        "game consoles": "video game console"
    },
    {
        ", as well as a number of spin-offs. An American ": null
    },
    {
        "animated TV series based on the games": "the legend of zelda"
    },
    {
        " aired in 1989 and ": null
    },
    {
        "individual manga adaptations": "manga from the legend of zelda series"
    },
    {
        " commissioned by Nintendo have been produced in Japan since 1997. The Legend of Zelda is one of Nintendos most prominent and successful franchises; many of its entries are considered to be among the ": null
    },
    {
        "greatest video games of all time": "greatest video games of all time"
    },
    {
        ".           The Legend of Zelda games feature a mixture of puzzles, action, adventure/battle ": null
    },
    {
        "gameplay": "gameplay"
    },
    {
        ", and exploration. These elements have remained constant throughout the series, but with refinements and additions featured in each new game. Later games in the series also include stealth gameplay, where the player must avoid enemies while proceeding through a level, as well as racing elements. Although the games can be beaten with a minimal amount of exploration and ": null
    },
    {
        "side quest": "side quest"
    },
    {
        "s, the player is frequently rewarded with helpful items or increased abilities for solving puzzles or exploring hidden areas. Some items are consistent and appear many times throughout the series , while others are unique to a single game. Though the games contain many ": null
    },
    {
        "role-playing": "role-playing video game"
    },
    {
        " elements , they emphasize straightforward ": null
    },
    {
        "hack and slash": "hack and slash"
    },
    {
        "-style combat over the ": null
    },
    {
        "strategic": "tactical role-playing game"
    },
    {
        ", ": null
    },
    {
        "turn-based": "turn-based"
    },
    {
        " or ": null
    },
    {
        "active time": "active time battle"
    },
    {
        " combat of series like  Final Fantasy . The games role-playing elements, however, have led to much debate over whether or not the Zelda games should be classified as ": null
    },
    {
        "action role-playing game": "action role-playing game"
    },
    {
        "s, a genre on which the series has had a strong influence.      Every game in the main Zelda series has consisted of three principal areas: an ": null
    },
    {
        "overworld": "overworld"
    },
    {
        " in which movement is multidirectional, allowing the player some degree of freedom of action; areas of interaction with other characters in which the player gains special items or advice; and ": null
    },
    {
        "dungeons": "dungeon crawl"
    },
    {
        ", areas of labyrinthine layout, usually underground, comprising a wide range of difficult enemies, ": null
    },
    {
        "bosses": "boss"
    },
    {
        ", and items. Each dungeon usually has one major item inside, which is usually essential for solving many of the puzzles within that dungeon and often plays a crucial role in defeating that dungeons boss, as well as progressing through the game. In nearly every Zelda game, navigating a dungeon is aided by locating a map, which reveals its layout, and a magic compass, which reveals the location of significant and smaller items such as keys and equipment. In later games, the series includes a special big key that will unlock the door to battle the dungeons boss enemy and open the item chest.     In most Zelda games, the players ": null
    },
    {
        "life meter": "health"
    },
    {
        " is represented as a line of hearts. The life meter is replenished a number of different ways, including picking up hearts left by defeated enemies or destroyed objects, fairies or springs located in specific locations, or consuming items such as potions or food. Fairies can be kept in bottles and act as extra lives, reviving the player if they run out of hearts. Players are able to extend their life meter by finding heart-shaped crystals called Heart Containers . Full heart containers are usually received at the end of dungeons and dropped by the dungeon boss. Smaller Pieces of Heart are awarded for completing certain side quests or found hidden around the game world in various places, and require a certain number to form a full heart container.     The games pioneered a number of features that were to become industry standards. The original Legend of Zelda was the first console game with a save function that enabled players to stop playing and then resume later. The Legend of Zelda: Ocarina of Time introduced a targeting system that simplified 3D combat.            Games in The Legend of Zelda series frequently feature in-game musical instruments, particularly in musical ": null
    },
    {
        "puzzles": "puzzle video game"
    },
    {
        ", which are widespread.  Often, instruments trigger game events: for example, the ": null
    },
    {
        "recorder": "recorder"
    },
    {
        " in The Legend of Zelda can reveal secret areas, as well as warp Link to the Dungeon entrances. This warping with music feature has also been used in A Link to the Past and Links Awakening. In  Ocarina of Time , playing instruments is a core part of the game, with the player needing to play the instrument through the use of the game controller to succeed.  Ocarina of Time is first contemporary non-dance title to feature music-making as part of its gameplay ,  using music as a ": null
    },
    {
        "heuristic": "heuristic"
    },
    {
        " device and requiring the player to utilise songs to progress in the game   – a ": null
    },
    {
        "game mechanic": "game mechanic"
    },
    {
        " that is also present in  Majoras Mask .      The Legend of Zelda Theme is a recurring piece of music that was created for the first game of the franchise. The composer and sound director of the series, ": null
    },
    {
        "Koji Kondo": "koji kondo"
    },
    {
        ", initially planned to use ": null
    },
    {
        "Maurice Ravels": "maurice ravel"
    },
    {
        "  Boléro  as the games title theme, but was forced to change it when he learned, late in the games development cycle, that the copyright for the orchestral piece had not yet expired. As a result, Kondo wrote a new arrangement of the overworld theme within one day.  The Zelda Theme has topped ": null
    },
    {
        "ScrewAttacks": "screwattack"
    },
    {
        " Top Ten Videogame Themes Ever": "screwattacks top 10"
    },
    {
        " list.      Up until  Breath of the Wild , the Legend of Zelda series avoided using voice acting in speaking roles, relying instead on written dialogue. Series producer ": null
    },
    {
        "Eiji Aonuma": "eiji aonuma"
    },
    {
        " previously stated that as Link is entirely mute, having the other characters speak while Link remains silent would be off-putting .  Instead of theme music for different locations, Breath of the Wild plays natural ambience around the player as main sounds, in addition to some minimalist piano music.        The Legend of Zelda was principally inspired by ": null
    },
    {
        "Shigeru Miyamotos": "shigeru miyamoto"
    },
    {
        " explorations as a young boy in the hillsides, forests, and caves surrounding his childhood home in ": null
    },
    {
        "Sonobe, Japan": "sonobe, kyoto"
    },
    {
        " where he ventured into forests with secluded lakes, caves, and rural villages. According to Miyamoto, one of his most memorable experiences was the discovery of a cave entrance in the middle of the woods.  After some hesitation, he apprehensively entered the cave, and explored its depths with the aid of a lantern. Miyamoto has referred to the creation of the Zelda games as an attempt to bring to life a miniature garden for players to play with in each game of the series.      Hearing of American novelist ": null
    },
    {
        "F. Scott Fitzgeralds": "f. scott fitzgerald"
    },
    {
        "wife ": null
    },
    {
        "Zelda": "zelda fitzgerald"
    },
    {
        ", Miyamoto thought the name sounded pleasant and significant .  Paying tribute, he chose to name the princess after her, and titled it The Legend of Zelda.     Link and the fairy were inspired by ": null
    },
    {
        "Peter Pan": "peter pan"
    },
    {
        " and ": null
    },
    {
        "Tinker Bell": "tinker bell"
    },
    {
        ".       The Master Sword was inspired by ": null
    },
    {
        "Excalibur": "excalibur"
    },
    {
        " which originates from the ": null
    },
    {
        "Arthurian Legend": "arthurian legend"
    },
    {
        " in the ": null
    },
    {
        "Welsh": "culture of wales"
    },
    {
        " collection of ": null
    },
    {
        "Mabinogion": "mabinogion"
    },
    {
        ".                 The Legend of Zelda takes place predominantly in a ": null
    },
    {
        "medieval": "medieval"
    },
    {
        " Western Europe": "western europe"
    },
    {
        "-inspired ": null
    },
    {
        "fantasy land": "fantasy land"
    },
    {
        " called ": null
    },
    {
        "Hyrule": "hyrule"
    },
    {
        ",  which has developed a deep history and wide geography over the series many releases. Much of the backstory of the creation of Hyrule was revealed in the games  A Link to the Past ,  Ocarina of Time ,  The Wind Waker ,  Twilight Princess ,  Skyward Sword , and  A Link Between Worlds . Hyrules principal inhabitants are pointy-eared, ": null
    },
    {
        "elf": "elf"
    },
    {
        "-like humanoids called ": null
    },
    {
        "Hylian": "hylian"
    },
    {
        "s, which include the ": null
    },
    {
        "player character": "player character"
    },
    {
        ", Link, and the eponymous princess, Zelda.     According to the in-game backstories, the world of Hyrule was created by the three ": null
    },
    {
        "golden goddesses": "recurring characters in the legend of zelda seriesgolden goddesses"
    },
    {
        ": Din, Farore, and Nayru.  Before departing, the goddesses left a sacred artifact called the ": null
    },
    {
        "Triforce": "triforce"
    },
    {
        ", which could grant powers to the user. It physically manifests itself as three golden triangles in which each embodies one of the goddesses virtues: Power, Courage, and Wisdom.  However, because the Triforce has no will of its own and it can not judge between good and evil, it will grant any wish indiscriminately.   Because of this, it was placed within an alternate world called the Sacred Realm or the Golden Land until one worthy of its power and has balanced virtues of Power, Wisdom, and Courage in their heart could obtain it, in its entirety. If a person is not of a balanced heart, the triforce part that the user mostly believes in will stay with that person and the remainder will seek out others. In order to master and control the triforce as a whole, the user must get the other parts found in other individuals and bring them together to reunite them. The Sacred Realm can itself be affected by the heart of those who enters it: those who are pure will make it a paradise, while those who are evil will transform it into a dark realm.      In Skyward Sword, the Triforce was sought by a demon king named Demise,  and after a long battle, Demise was sealed away within the Temple of the goddess Hylia, guardian of the Triforce.  Hylia, placing the Hylians on a floating island in the sky to protect them, orchestrated a means to stop the demon from escaping: creating the Goddess Sword for her chosen hero  and discarding her divinity to be reborn among the people of Skyloft.  In time, Zelda and Link enacted the goddess plan and Demise was destroyed. However, Demise vowed that his rage would be reborn and forever plague those descended from Link and Zelda.  That prophecy came to fruition in ": null
    },
    {
        "Ocarina of Time": "the legend of zelda: ocarina of time"
    },
    {
        ", when Ganondorfs attempt to get the Triforce scattered it with him gaining the Triforce of Power. The Triforce of Wisdom ended up with the Hylian princesses descended from Zelda, each named after her, while the Triforce of Courage is passed to a youth named Link across generations. While the Triforces of Power and Wisdom have been part of the series since the original The Legend of Zelda, it was only in Zelda II: The Adventure of Link that the Triforce of Courage was first introduced, being obtained by Link at the end of his quest. The Triforce, or even a piece of it, is not always distributed as a whole. Such as in The Wind Waker, Link must find all the pieces of the Triforce of Courage before he can return to Hyrule. Even in the original The Legend of Zelda, Zelda breaks her Triforce of Wisdom into 8 pieces for Link to find, before she was captured by Ganon.     The fictional universe established by the Zelda games sets the stage for each adventure. Some games take place in different lands with their own back-stories. ": null
    },
    {
        "Termina": "termina"
    },
    {
        " and ": null
    },
    {
        "Lorule": "the legend of zelda: a link between worldssetting"
    },
    {
        " serve as parallel worlds to Hyrule,  ": null
    },
    {
        "Hytopia": "the legend of zelda: tri force heroessetting"
    },
    {
        " is a connected kingdom,  and ": null
    },
    {
        "Koholint": "koholint"
    },
    {
        " is an island far away from Hyrule that appears to be part of a dream.                 The chronology of the Legend of Zelda series was a subject of much debate among fans until an official timeline was released within the  Hyrule Historia  collectors book, which was first released in Japan in December 2011.   Prior to its release, producers confirmed the existence of a confidential document, which connected all the games.   Certain materials and developer statements once partially established an official timeline of the released installments.  Zelda II: The Adventure of Link  is a direct sequel to ": null
    },
    {
        "original The Legend of Zelda": "the legend of zelda"
    },
    {
        ", and takes place several years later.   The third game,  A Link to the Past , is a prequel to the first two games,    and is directly followed by  Links Awakening . Nintendo, ed . The Legend of Zelda: Links Awakening instruction manual. Nintendo. pp. 3–4. Though you fulfilled the Hyrulian prophecy of the Legendary Hero and destroyed the evil tyrant Ganon, the land of Hyrule enjoyed only a precarious peace. Who knows what threats may arise from Ganons ashes? the restless people murmured as they knitted their brows and shook their heads. Ever vigilant, you decided to journey away from Hyrule on a quest for enlightenment, in search of wisdom that would make you better able to withstand the next threat to your homeland.   Ocarina of Time  is a prequel that takes the story many centuries back; according to character designer Satoru Takizawa, it was meant to implicitly tell the story of the Imprisoning War from the manual of A Link to the Past, with  Majoras Mask  directly following its ending.    Skyward Sword  is then a prequel to Ocarina of Time.  ": null
    },
    {
        "gend of Zel": "gend of zel"
    }
]