[
    {
        "            The Muppets are an ": null
    },
    {
        "ensemble cast": "ensemble cast"
    },
    {
        " of ": null
    },
    {
        "puppet": "puppet"
    },
    {
        " characters known for their ": null
    },
    {
        "absurdist": "surreal humor"
    },
    {
        ", ": null
    },
    {
        "burlesque": "burlesque"
    },
    {
        ", and ": null
    },
    {
        "self-referential": "self-referential humor"
    },
    {
        " style of ": null
    },
    {
        "variety": "variety show"
    },
    {
        "-": null
    },
    {
        "sketch comedy": "sketch comedy"
    },
    {
        ". Created by ": null
    },
    {
        "Jim": "jim henson"
    },
    {
        " and ": null
    },
    {
        "Jane Henson": "jane henson"
    },
    {
        " in 1955, they are the namesake for the ": null
    },
    {
        "Disney": "the walt disney company"
    },
    {
        " media franchise": "media franchise"
    },
    {
        " that encompasses television, music, film, and other media associated with the characters.     The Muppets originated in the short-form television series  Sam and Friends , which aired from 1955 to 1961. Following appearances on late night talk shows and in advertising during the 1960s, the Muppets began appearing on  Sesame Street  in 1969. The Muppets attained ": null
    },
    {
        "celebrity status": "celebrity"
    },
    {
        " and international recognition through  The Muppet Show  , which received four ": null
    },
    {
        "Primetime Emmy Award": "primetime emmy award"
    },
    {
        " wins and twenty-one nominations during its five-year run.     During the 1970s and 1980s, the Muppets diversified into theatrical ": null
    },
    {
        "film": "film"
    },
    {
        "s, including  The Muppet Movie  ;  The Great Muppet Caper  ; and  The Muppets Take Manhattan  . The Walt Disney Company began involvement with the Muppets in the late 1980s, during which Henson entered negotiations to sell ": null
    },
    {
        "The Jim Henson Company": "the jim henson company"
    },
    {
        ". The Muppets continued their media presence in the 1990s with television series  The Jim Henson Hour  and  Muppets Tonight  , both of which were similar in format to The Muppet Show, and three films:  The Muppet Christmas Carol  ,  Muppet Treasure Island  , and  Muppets from Space  .     Disney acquired the Muppets in February 2004, allowing the characters to gain broader public exposure than in previous years.    Under Disney, subsequent projects included two films:  The Muppets  and  Muppets Most Wanted  ; a short-lived ": null
    },
    {
        "primetime series": "the muppets"
    },
    {
        " on ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        ";     and a ": null
    },
    {
        "reboot": "muppet babies"
    },
    {
        " of the  Muppet Babies  animated series.     In their six-decade career, the Muppets have been regarded as a staple of the entertainment industry and ": null
    },
    {
        "popular culture": "popular culture"
    },
    {
        " in the United States and English-speaking area generally, being recognized by various cultural institutions and organizations, including the ": null
    },
    {
        "American Film Institute": "american film institute"
    },
    {
        ", ": null
    },
    {
        "Academy of Motion Picture Arts and Sciences": "academy of motion picture arts and sciences"
    },
    {
        ", ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        ", and the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        ".            The Muppets were created by puppeteer ": null
    },
    {
        "Jim Henson": "jim henson"
    },
    {
        " in the 1950s; among his earliest creations was ": null
    },
    {
        "Kermit the Frog": "kermit the frog"
    },
    {
        ", who would become Hensons most recognizable character. Originally conceived for an ": null
    },
    {
        "adult": "adult puppeteering"
    },
    {
        " audience,  Henson claimed, and later recanted, that he coined the term Muppet as a portmanteau of the words ": null
    },
    {
        "marionette": "marionette"
    },
    {
        " and ": null
    },
    {
        "puppet": "puppet"
    },
    {
        " .  In 1955, the Muppets were introduced in  Sam and Friends , a short-form television series produced for ": null
    },
    {
        "WRC-TV": "wrc-tv"
    },
    {
        " in ": null
    },
    {
        "Washington D.C.": "washington d.c."
    },
    {
        "  Developed by Henson and his future wife ": null
    },
    {
        "Jane Nebel": "jane henson"
    },
    {
        ", the series was the first form of puppet media not to incorporate a physical ": null
    },
    {
        "proscenium arch": "proscenium arch"
    },
    {
        " typical of such works, relying instead on the natural framing of the ": null
    },
    {
        "television set": "television set"
    },
    {
        " through which it was viewed.      During the 1960s, the characters—in particular, Kermit and ": null
    },
    {
        "Rowlf the Dog": "rowlf the dog"
    },
    {
        "—appeared in skits on several ": null
    },
    {
        "late-night talk shows": "late-night talk show"
    },
    {
        "and on television commercials, including  The Ed Sullivan Show . Rowlf became the first Muppet character to appear regularly on network television when he began appearing with ": null
    },
    {
        "Jimmy Dean": "jimmy dean"
    },
    {
        " on  The Jimmy Dean Show . In 1966, ": null
    },
    {
        "Joan Ganz Cooney": "joan ganz cooney"
    },
    {
        " and ": null
    },
    {
        "Lloyd Morrisett": "lloyd morrisett"
    },
    {
        " began developing a childrens ": null
    },
    {
        "educational television": "educational television"
    },
    {
        " program and approached Henson to design a cast of Muppet characters during this stage. Produced by the ": null
    },
    {
        "Childrens Television Workshop": "sesame workshop"
    },
    {
        ", the program debuted as  Sesame Street  in 1969.     Henson and his creative team became closely involved with Sesame Street during the years that followed; Henson waived his performance fee in exchange for retaining ownership rights to the Muppet characters created for the program. Sesame Street garnered a positive response, and the Muppets involvement in the series was said to be a vital component of its increasing popularity, providing an effective and pleasurable viewing method of presentation for its educational curriculum. Morrow, p. 93 Davis, p.163     The Muppet Show and foray into film The Land of Gorch  segments during the first season of  Saturday Night Live . As his involvement with Sesame Street continued, Henson began developing a network television series focusing on the Muppets; Finch, p.5 as opposed to Sesame Street, however, this series would be aimed at a more adult audience and focus largely on ": null
    },
    {
        "sketch comedy": "sketch comedy"
    },
    {
        ". Two ": null
    },
    {
        "television pilots": "pilot"
    },
    {
        ",  The Muppets Valentine Show  and  The Muppet Show: Sex and Violence , aired on ": null
    },
    {
        "ABC": "american broadcasting company"
    },
    {
        " in 1974 and 1975, respectively.     After ABC passed on the pilots and other networks in the United States expressed little interest in the project, British producer ": null
    },
    {
        "Lew Grade": "lew grade, baron grade"
    },
    {
        " approached Henson and agreed to co-produce the series for ": null
    },
    {
        "Associated Television": "associated television"
    },
    {
        ". Debuting in 1976,  The Muppet Show  introduced new characters such as ": null
    },
    {
        "Miss Piggy": "miss piggy"
    },
    {
        ", ": null
    },
    {
        "Fozzie Bear": "fozzie bear"
    },
    {
        ", ": null
    },
    {
        "Gonzo": "gonzo"
    },
    {
        ", and ": null
    },
    {
        "Animal": "animal"
    },
    {
        " alongside existing characters such as Kermit and Rowlf. Aired in ": null
    },
    {
        "first-run syndication": "broadcast syndicationfirst-run syndication in the u.s."
    },
    {
        " in the United States, The Muppet Show became increasingly popular due to its sketch-": null
    },
    {
        "variety": "variety show"
    },
    {
        " format, unique form of humor, and prolific roster of ": null
    },
    {
        "guest stars": "guest appearance"
    },
    {
        ". It was nominated for twenty-one ": null
    },
    {
        "Primetime Emmy Awards": "primetime emmy award"
    },
    {
        "during its run, winning four, including ": null
    },
    {
        "Outstanding Variety Series": "primetime emmy award for outstanding variety series"
    },
    {
        " in 1978. The success of The Muppet Show allowed ": null
    },
    {
        "Henson Associates": "the jim henson company"
    },
    {
        " to diversify into theatrical ": null
    },
    {
        "film": "film"
    },
    {
        "s, the first of which,  The Muppet Movie , was released in 1979.       Following The Muppet Movie were  The Great Muppet Caper  and  The Muppets Take Manhattan , released in 1981 and 1984, respectively. Collectively, the three films received four ": null
    },
    {
        "Academy Award": "academy awards"
    },
    {
        " nominations. In 1983, Henson debuted  Fraggle Rock , which aired on ": null
    },
    {
        "HBO": "hbo"
    },
    {
        " in the United States until 1987.      In 1989, Henson entered negotiations with ": null
    },
    {
        "Michael Eisner": "michael eisner"
    },
    {
        " and ": null
    },
    {
        "The Walt Disney Company": "the walt disney company"
    },
    {
        ", in which the latter would acquire Jim Henson Productions and, in turn, the Muppets. Disney expressed interest in purchasing the company for $150 million.  Eisner was also interested in acquiring the Sesame Street Muppet characters. Henson declined the proposal, however, considering it a non-starter for the deal. Jones, p. 455 As discussions continued, Henson and ": null
    },
    {
        "Walt Disney Imagineering": "walt disney imagineering"
    },
    {
        " preemptively began developing Muppets-themed attractions for the ": null
    },
    {
        "Disney-MGM Studios": "disneys hollywood studios"
    },
    {
        " at ": null
    },
    {
        "Walt Disney World": "walt disney world"
    },
    {
        ".     However, the proposed merger was canceled after Hensons death in 1990. Nevertheless, Disney initiated a ": null
    },
    {
        "licensing": "license"
    },
    {
        " agreement with Henson to continue developing Muppets attractions.  The following year, ": null
    },
    {
        "MuppetVision 3D": "muppetvision 3d"
    },
    {
        " debuted at Disney-MGM Studios, the only attraction successfully developed from the original plans. Disney also co-produced the fourth and fifth Muppets films,  The Muppet Christmas Carol  and  Muppet Treasure Island , with Henson in 1992 and 1996, respectively. The characters subsequently starred in  Muppets Tonight , which aired from 1996 to 1998; and a sixth film,  Muppets from Space , released by ": null
    },
    {
        "Columbia Pictures": "columbia pictures"
    },
    {
        " in 1999.     In 2000, Henson was sold to ": null
    },
    {
        "EM.TV & Merchandising AG": "constantin medien"
    },
    {
        " for $680 million.  However, EM.TVs stock collapsed and the Henson family re-acquired the company in 2003, with the exception of the Sesame Street characters, which were in the interim sold to ": null
    },
    {
        "Sesame Workshop": "sesame workshop"
    },
    {
        ".       Fourteen years after initial negotiations began, Disney acquired the Muppets ": null
    },
    {
        "intellectual property": "intellectual property"
    },
    {
        " from Henson for $75 million on February 17, 2004. The acquisition consisted of most of the Muppets film and television library, as well as the  Bear in the Big Blue House  television series. Exceptions included the Sesame Street ": null
    },
    {
        "characters": "list of sesame street muppets"
    },
    {
        ", which were previously sold to Sesame Workshop;  the Fraggle Rock ": null
    },
    {
        "characters": "list of fraggle rock characters"
    },
    {
        ", which were retained by Henson; and the ": null
    },
    {
        "distribution rights": "film distribution"
    },
    {
        " to four films: The Muppets Take Manhattan, Muppets from Space, and  Kermits Swamp Years , which were retained by ": null
    },
    {
        "Sony Pictures Entertainment": "sony pictures entertainment"
    },
    {
        "; and  Its a Very Merry Muppet Christmas Movie , retained by ": null
    },
    {
        "NBCUniversal Television Distribution": "nbcuniversal television distribution"
    },
    {
        ".  Following the acquisition, Disney formed ": null
    },
    {
        "The Muppets Studio": "the muppets studio"
    },
    {
        " , a wholly owned subsidiary responsible for managing the characters and franchise. As a result, the term Muppet became a legal ": null
    },
    {
        "trademark": "trademark"
    },
    {
        " of Disney; under license from Disney, Sesame Workshop continues to use the term for their characters, as well archival footage of Kermit the Frog.     Henson retains the rights to several productions featuring the Disney-owned Muppet characters, including  Emmet Otters Jug-Band Christmas ;  The Christmas Toy ;  Sesame Street: 20 and Still Counting ; Hensons Place; Billy Bunnys Animal Songs; the original  Dog City  special; and Donnas Day. While some of these have since been released uncut, most current releases of Emmet Otters Jug-Band Christmas and The Christmas Toy omit the appearances by Kermit the Frog.     Disney gradually began reintroducing the franchise to the mainstream in 2008. As a method of regaining a wider audience, Disney produced a series of vignettes for ": null
    },
    {
        "YouTube": "youtube"
    },
    {
        ". A ": null
    },
    {
        "Bohemian Rhapsody": "bohemian rhapsody"
    },
    {
        " cover version": "list of bohemian rhapsody cover versions"
    },
    {
        " was among these projects and immediately went ": null
    },
    {
        "viral": "viral video"
    },
    {
        ", ultimately amassing 50 million views and won two ": null
    },
    {
        "Webby Award": "webby award"
    },
    {
        "s.  In 2010, the Muppets starred in  The Muppets Kitchen with Cat Cora , which co-starred ": null
    },
    {
        "Cat Cora": "cat cora"
    },
    {
        " and showcased cooking demonstrations.  A television special,  A Muppets Christmas: Letters to Santa , premiered on ": null
    },
    {
        "NBC": "nbc"
    },
    {
        " on December 17, 2008; and was released on DVD on September 29, 2009.       In 2010, Disney used the Muppets to promote their ": null
    },
    {
        "volunteerism program": "give a day, get a disney day"
    },
    {
        " at the companys theme parks. A Halloween special featuring the Muppets was developed during that time and expected to air on ABC that October, but was canceled.        In 2011, the Muppets were featured in an ": null
    },
    {
        "eponymous seventh film": "the muppets"
    },
    {
        ", intended to serve as a creative ": null
    },
    {
        "reboot": "reboot"
    },
    {
        " for the characters. Disney had been furthering development on a Muppets film since 2008, when it considered adapting an unused screenplay by ": null
    },
    {
        "Jerry Juhl": "jerry juhl"
    },
    {
        ". Directed by ": null
    },
    {
        "James Bobin": "james bobin"
    },
    {
        "; written by ": null
    },
    {
        "Jason Segel": "jason segel"
    },
    {
        " and ": null
    },
    {
        "Nicholas Stoller": "nicholas stoller"
    },
    {
        "; and starring Segel, ": null
    },
    {
        "Amy Adams": "amy adams"
    },
    {
        ", ": null
    },
    {
        "Chris Cooper": "chris cooper"
    },
    {
        ", and ": null
    },
    {
        "Rashida Jones": "rashida jones"
    },
    {
        ", the film was a critical and commercial success, and won an ": null
    },
    {
        "Academy Award": "academy awards"
    },
    {
        " for ": null
    },
    {
        "Best Original Song": "academy award for best original song"
    },
    {
        ".  During the films publicity campaign, the Muppets appeared in promotional advertisements and effusive marketing efforts by Disney and were also featured in a promotional video for ": null
    },
    {
        "Google+": "google+"
    },
    {
        ".  In March 2012, the Muppets received a collective star on the ": null
    },
    {
        "Hollywood Walk of Fame": "hollywood walk of fame"
    },
    {
        ".  That year, the Muppets hosted a  Just for Laughs  comedy gala in ": null
    },
    {
        "Montreal": "montreal"
    },
    {
        ".      Following the successful performance of The Muppets, Disney announced an eighth film in 2012, with Bobin and Stoller returning to direct and write, respectively.   Muppets Most Wanted  was released in 2014, and starred ": null
    },
    {
        "Ricky Gervais": "ricky gervais"
    },
    {
        "; ": null
    },
    {
        "Tina Fey": "tina fey"
    },
    {
        "; and ": null
    },
    {
        "Ty Burrell": "ty burrell"
    },
    {
        ".      ": null
    },
    {
        "Disney Theatrical Productions": "disney theatrical productions"
    },
    {
        " announced in 2013 that a live show based on the Muppets was in active development and that a 15-minute show had been conducted by ": null
    },
    {
        "Thomas Schumacher": "thomas schumacher"
    },
    {
        " to see how the technical components would work.  Muppet Moments, an interstitial television series, premiered on ": null
    },
    {
        "Disney Junior": "disney junior"
    },
    {
        " in April 2015. The short-form series features conversations between the Muppets and young children.      After the release of Muppets Most Wanted, Disney was interested in expanding the Muppets presence across various media platforms, particularly in television.  Discussions for a new ": null
    },
    {
        "primetime series": "prime time"
    },
    {
        " began internally within The Muppets Studio.  By April 2015, ": null
    },
    {
        "Bill Prady": "bill prady"
    },
    {
        " was commissioned to write a script for a pilot with the working title Muppets 2015.  In May 2015, ABC commissioned an ": null
    },
    {
        "eponymous mockumentary series": "the muppets"
    },
    {
        ", co-developed by Prady and ": null
    },
    {
        "Bob Kushell": "bob kushell"
    },
    {
        " and directed by ": null
    },
    {
        "Randall Einhorn": "randall einhorn"
    },
    {
        ".   The Muppets premiered on September 22, 2015 in the United States, and ended on March 1, 2016.   In September 2017, the Muppets performed a series of live shows at the ": null
    },
    {
        "Hollywood Bowl": "hollywood bowl"
    },
    {
        ", hosted by ": null
    },
    {
        "Bobby Moynihan": "bobby moynihan"
    },
    {
        ".  Two ": null
    },
    {
        "web television": "web television"
    },
    {
        " series have been in development, both for ": null
    },
    {
        "Disney+": "disney+"
    },
    {
        ": Muppets Live Another Day, intended to star ": null
    },
    {
        "Josh Gad": "josh gad"
    },
    {
        ", was announced in February 2018 and entered active development the following year;   in September 2019, Gad confirmed the projects cancellation.  Muppets Now, a short-form ": null
    },
    {
        "improvisational comedy": "improvisational theatreimprovisational comedy"
    },
    {
        " series, was announced in August 2019; it is scheduled for a 2020 debut.  In July 2018, the cast performed a series of live shows at Londons ": null
    },
    {
        "O2 Arena": "the o2 arena"
    },
    {
        ", their first outside of the United States.              The principal characters of  The Muppet Show  and subsequent media include ": null
    },
    {
        "Kermit the Frog": "kermit the frog"
    },
    {
        "; ": null
    },
    {
        "Miss Piggy": "miss piggy"
    },
    {
        "; ": null
    },
    {
        "Fozzie Bear": "fozzie bear"
    },
    {
        "; ": null
    },
    {
        "Gonzo": "gonzo"
    },
    {
        "; ": null
    },
    {
        "Rowlf the Dog": "rowlf the dog"
    },
    {
        "; ": null
    },
    {
        "Scooter": "scooter"
    },
    {
        "; ": null
    },
    {
        "Rizzo the Rat": "rizzo the rat"
    },
    {
        "; ": null
    },
    {
        "Pepe the King Prawn": "pepe the king prawn"
    },
    {
        "; ": null
    },
    {
        "Dr. Bunsen Honeydew": "bunsen honeydew"
    },
    {
        "; ": null
    },
    {
        "Beaker": "beaker"
    },
    {
        "; ": null
    },
    {
        "Statler and Waldorf": "statler and waldorf"
    },
    {
        "; the ": null
    },
    {
        "Swedish Chef": "swedish chef"
    },
    {
        "; ": null
    },
    {
        "Sam Eagle": "sam eagle"
    },
    {
        "; ": null
    },
    {
        "Walter": "walter"
    },
    {
        "; and ": null
    },
    {
        "the Electric Mayhem": "dr. teeth and the electric mayhem"
    },
    {
        ", fronted by ": null
    },
    {
        "Dr. Teeth": "dr. teeth and the electric mayhemdr. teeth"
    },
    {
        " and consisting of ": null
    },
    {
        "Animal": "animal"
    },
    {
        " , ": null
    },
    {
        "Floyd Pepper": "dr. teeth and the electric mayhemfloyd pepper"
    },
    {
        " , ": null
    },
    {
        "Janice": "dr. teeth and the electric mayhemjanice"
    },
    {
        " , ": null
    },
    {
        "Zoot": "dr. teeth and the electric mayhemzoot"
    },
    {
        " , and occasionally ": null
    },
    {
        "Lips": "dr. teeth and the electric mayhemlips"
    },
    {
        " .     As well as The Muppet Show, the characters are popular for their appearances on  Sesame Street  and  Fraggle Rock ; and also feature in  The Jimmy Dean Show ,  The Jim Henson Hour ,  Muppets Tonight ,  Bear in the Big Blue House ,  Statler and Waldorf: From the Balcony , and  The Muppets . An adult-oriented segment,  The Land of Gorch , was a regular feature in the first season of  Saturday Night Live . Guest stars on Saturday Night Live occasionally include both the Muppets and Sesame Street characters, as well as Muppet likenesses of real people; these likenesses appear recurrently in early episodes of The Muppet Show and on Sesame Street, and appear occasionally on other series such as  30 Rock .     Following Disneys acquisition of the Muppets, puppets created by The Jim Henson Company are no longer referred to as Muppets. Puppets created by ": null
    },
    {
        "Jim Hensons Creature Shop": "jim hensons creature shop"
    },
    {
        ", including those in  Labyrinth  and  The Dark Crystal , have never been considered Muppets,  as they are generally more complex in design and performance than regular Muppets. At Hensons suggestion, the  Star Wars  character ": null
    },
    {
        "Yoda": "yoda"
    },
    {
        " was originally performed by ": null
    },
    {
        "Frank Oz": "frank oz"
    },
    {
        ", Finch, p.176 and has been loosely described as a Muppet in media and reference works; he is not, however, and Henson otherwise had no involvement in the characters conception.              At the start of the Muppets formation, Jim and Jane Henson were the groups only performers. In 1961, Jane retired to focus on raising their children. Seeking additional performers, Jim came into contact with ": null
    },
    {
        "Frank Oz": "frank oz"
    },
    {
        " that year. Although interested, Oz initially declined due to his youth and commitment to high school, and instead suggested ": null
    },
    {
        "Jerry Juhl": "jerry juhl"
    },
    {
        ", who worked with Oz at the Vagabond Puppet Theater in ": null
    },
    {
        "Oakland, California": "oakland, california"
    },
    {
        ". Upon graduating, Oz subsequently joined in August 1963. By the time The Muppet Show began, the primary cast of performers grew to consist of Henson; Oz; ": null
    },
    {
        "Dave Goelz": "dave goelz"
    },
    {
        "; ": null
    },
    {
        "Jerry Nelson": "jerry nelson"
    },
    {
        "; ": null
    },
    {
        "Richard Hunt": "richard hunt"
    },
    {
        "; and later, ": null
    },
    {
        "Steve Whitmire": "steve whitmire"
    },
    {
        ", while Juhl became head writer for the series. From The Muppet Show onward, ": null
    },
    {
        "Kevin Clash": "kevin clash"
    },
    {
        "; ": null
    },
    {
        "Kathryn Mullen": "kathryn mullen"
    },
    {
        "; ": null
    },
    {
        "Louise Gold": "louise gold"
    },
    {
        "; ": null
    },
    {
        "Karen Prell": "karen prell"
    },
    {
        "; ": null
    },
    {
        "Fran Brill": "fran brill"
    },
    {
        ", ": null
    },
    {
        "Caroll Spinney": "caroll spinney"
    },
    {
        "; and ": null
    },
    {
        "Brian Henson": "brian henson"
    },
    {
        " performed several minor characters and assisted the main performers with puppeteering. Many of these puppeteers performed characters across The Muppet Show, Sesame Street, Fraggle Rock, and other Henson-related projects.     Henson, Hunt, and Nelson continued performing until their deaths in 1990, 1992, and 2012, respectively. Whitmire, Goelz, and ": null
    },
    {
        "Bill Barretta": "bill barretta"
    },
    {
        ", who joined the main cast of performers in the mid-1990s, assumed Hensons characters, with Whitmire also assuming the role of Beaker. The remainder of Hunts characters were left without a stable performer until ": null
    },
    {
        "David Rudman": "david rudman"
    },
    {
        " was cast in those roles in the late 2000s. Oz continued performing until his retirement from puppeteering in 2000; ": null
    },
    {
        "Eric Jacobson": "eric jacobson"
    },
    {
        " assumed his characters beginning in 2002. At Nelsons behest, ": null
    },
    {
        "Matt Vogel": "matt vogel"
    },
    {
        " gradually began performing his characters in 2008.     Whitmire was ": null
    },
    {
        "dismissed": "dismissal"
    },
    {
        " from the cast in 2016, with Vogel cast as Kermit the Frog in 2017, and most of Whitmires other characters assumed by the remainder of the cast.  The Muppets are currently performed by a cast of six principal puppeteers: Jacobson, Goelz, Barretta, Rudman, Vogel and ": null
    },
    {
        "Peter Linz": "peter linz"
    },
    {
        ".            The majority of the Muppets are designed as ": null
    },
    {
        "hand puppets": "hand puppets"
    },
    {
        ", with several characters utilizing ": null
    },
    {
        "rods": "hand puppetrod puppets"
    },
    {
        ". Common design elements of the Muppets include wide mouths and large protruding eyes. Most of the Muppets are molded or carved out of various types of foam and covered with any felt-like material. The characters may represent humans; ": null
    },
    {
        "anthropomorphic": "anthropomorphism"
    },
    {
        " characters; realistic animals; robots; extraterrestrial or mythical creatures; or other forms of abstract characters.     The Muppets are distinguished from ": null
    },
    {
        "ventriloquist": "ventriloquism"
    },
    {
        " dummies, which are usually animated only in the head and face, in that their arms or other features are also animated. They are also generally made of softer material. They are presented as being independent of the puppeteer, officially known as a Muppet peformer , who is usually hidden behind a set or outside of the camera frame. Using the camera frame to this advantage was an innovation of the Muppets. Prior to this, a stage was used to mask the performers, as would be the case in a live performance. Sometimes, they are seen full-bodied; in most cases, invisible strings are used to manipulate these puppets, with vocals added at a later point. Christopher Finch Jim Henson: The Works 1993, .     Since 2006, Disney has contracted ": null
    },
    {
        "Puppet Heap": "puppet heap"
    },
    {
        " to produce and maintain newer models of the Muppets.  During most performances, the performer holds the character above their head or in front of their body, with one hand operating the head and mouth and the other manipulating the hands and arms, either with two separate control rods or – in the case of live-hand Muppets – wearing the hands similarly to gloves. One consequence of this design is that most of the Muppets are left-handed, with the performer using their right hand to operate the head while operating the arm with their left hand.     For more complex Muppets, several performers may operate a single character, with the performer controlling the mouth usually voicing the character. As technology has advanced, the Jim Henson team and other performers have developed several means to operate the Muppets for film and television; these include the use of suspended rigs, internal motors, ": null
    },
    {
        "remote manipulators": "remote manipulators"
    },
    {
        ", and computer enhanced and superimposed images. Creative use of different technologies has allowed for scenes in which the Muppets appear to exhibit complex movements wholly independently of the performer.     In his book  Street Gang , author Michael Davis wrote that the characters tend to develop organically , alluding to the performers taking up to a year to develop their characters and voices. They are also test-driven, passed around from one Henson troupe member to another in the hope of finding the perfect human-Muppet match .  When interacting with them, children believed that Muppets were living beings, even when the performers were present.                    On September 17, 2002, ": null
    },
    {
        "Rhino Records": "rhino entertainment"
    },
    {
        " released  The Muppet Show: Music, Mayhem, and More , a compilation album of music from The Muppet Show and subsequent film releases. With ": null
    },
    {
        "John Denver": "john denver"
    },
    {
        ",  John Denver and the Muppets: A Christmas Together  was produced and released in 1979.     Under Disney ownership, The Muppets album releases have been issued by ": null
    },
    {
        "Walt Disney Records": "walt disney records"
    },
    {
        "; as well as new album releases, some albums have been re-released, including  The Muppet Christmas Carol  in 2005 and  The Muppet Movie  in 2013. Legal music publishing rights to The Muppets songs are controlled by Fuzzy Muppet Songs and Mad Muppet Melodies, imprints of ": null
    },
    {
        "Disney Music Publishing": "disney music group"
    },
    {
        ".             The Muppets appear at the ": null
    },
    {
        "Walt Disney Parks and Resorts": "walt disney parks and resorts"
    },
    {
        ", having first appeared at ": null
    },
    {
        "Walt Disney World": "walt disney world"
    },
    {
        " in 1990. Their first featured attraction, Here Come the Muppets, was a live stage show that opened shortly after Jim Hensons death and ran at ": null
    },
    {
        "Disneys Hollywood Studios": "disneys hollywood studios"
    },
    {
        " for a year.  ": null
    },
    {
        "MuppetVision 3D": "muppetvision 3d"
    },
    {
        ", a ": null
    },
    {
        "4D film": "4d film"
    },
    {
        " attraction that also uses ": null
    },
    {
        "audio-animatronic": "audio-animatronic"
    },
    {
        " characters, opened at Disneys Hollywood Studios on May 16, 1991, exactly one year after Hensons death. It is notable as Hensons final directorial effort. MuppetVision 3D subsequently opened at ": null
    },
    {
        "Disney California Adventure": "disney california adventure"
    },
    {
        ", on February 8, 2001; this version closed in 2014.     The Muppets also featured in  The Muppets Present...Great Moments in American History  at the ": null
    },
    {
        "Magic Kingdom": "magic kingdom"
    },
    {
        " from 2016 to 2019; and the ": null
    },
    {
        "Muppet Mobile Lab": "muppet mobile lab"
    },
    {
        " at ": null
    },
    {
        "Epcot": "epcot"
    },
    {
        ".   The latter attraction is a free-roving vehicle with audio-animatronics of ": null
    },
    {
        "Bunsen Honeydew": "bunsen honeydew"
    },
    {
        " and ": null
    },
    {
        "Beaker": "beaker"
    },
    {
        ". As part of Disneys Living Character Initiative, it premiered in 2007 at Epcot  and was later previewed at Disney California Adventure and ": null
    },
    {
        "Hong Kong Disneyland": "hong kong disneyland"
    },
    {
        ".       In 2010, the Muppets were the face of the ": null
    },
    {
        "Give a Day, Get a Disney Day": "give a day, get a disney day"
    },
    {
        " charity campaign. Participants could register for a select service activity on the accompanying ": null
    },
    {
        "Web site": "web site"
    },
    {
        ", and in return could print a voucher for a free one-day admission ticket to ": null
    },
    {
        "Disneyland": "disneyland"
    },
    {
        " or Walt Disney World Resort. The Muppets appeared in television and print ads for the campaign and were featured prominently on the campaigns Web site.      Disney has released numerous ": null
    },
    {
        "collector pins": "disney pin trading"
    },
    {
        " featuring the Muppets since 2004. These include Limited Edition pins, ": null
    },
    {
        "Hidden Mickey": "hidden mickey"
    },
    {
        " pin collections, mystery pin sets, 2008 pin sets promoting The Muppets, cast lanyard pins, and assorted individual rack pins. Over 100 pins displaying the characters have been released overall.        Among other print media, the Muppets have featured in ": null
    },
    {
        "comics": "comics"
    },
    {
        " since the 1970s. An eponymous ": null
    },
    {
        "comic strip": "comic strip"
    },
    {
        " by ": null
    },
    {
        "Guy and Brad Gilchrist": "guy gilchrist"
    },
    {
        " first ran on September 21, 1981 in over 500 daily newspapers, six months after The Muppet Show ended its five-year run. By the end of its run in 1986, the comic strip was seen in over 660 newspapers worldwide. Many of the strips were compiled in various book collections.  Special strips were also created in color, exclusively for issues of Muppet Magazine.     The only Muppets film adapted as a ": null
    },
    {
        "comic book": "comic book"
    },
    {
        " was The Muppets Take Manhattan. The ": null
    },
    {
        "comic book series": "the muppets take manhattanmarketing"
    },
    {
        " was adapted by ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        " in 1984, as the 68-page story in  Marvel Super Special  issue 32. The adaptation was later re-printed into three limited series issues, released under Marvels ": null
    },
    {
        "Star Comics": "star comics"
    },
    {
        " imprint .     In the wake of  Muppet Babies success, Star Comics adapted the series into a bi-monthly title , featuring original stories. The final issue of ": null
    },
    {
        "Disney Adventures": "disney adventures"
    },
    {
        ", released in 2007, included a one-page strip by Roger Langridge .     In 2009, Boom! Studios began publishing a series of comic books based on The Muppet Show, written and illustrated by Langridge. Following two mini-series, an ongoing series, The Muppet Show Comic Book, was published for eleven issues. Additionally, Boom! Studios published fairy tale adaptations centered on the Muppets. In 2012, the Langridge series was transferred to Marvel Comics, which released an omnibus edition in 2013.     ": null
    },
    {
        "Muppet Magazine": "muppet magazine"
    },
    {
        " was published from 1983 to 1989. The magazine was presented as being run by the Muppets themselves and included such features as celebrity interviews and comic stories.       thu at Rockefeller Center in 2012.   The prevalence of the Muppets in popular culture is such that the characters have become regarded as celebrities in their own right. The Muppets have a collective star on the Hollywood Walk of Fame , with Kermit having been previously individually inducted in 2002. The characters have appeared at the Academy Awards and Emmy Award s; made cameo appearance s in films including ": null
    },
    {
        "Rocky III": "rocky iii"
    },
    {
        ", ": null
    },
    {
        "An American Werewolf in London": "an american werewolf in london"
    },
    {
        ", and ": null
    },
    {
        "Mr. Magoriums Wonder Emporium": "mr. magoriums wonder emporium"
    },
    {
        "; and have been interviewed on the news magazine ": null
    },
    {
        "60 Minutes": "60 minutes"
    },
    {
        ".     Kermit was interviewed by Jon Stewart on ": null
    },
    {
        "The Daily Show": "the daily show"
    },
    {
        "; guest hosted ": null
    },
    {
        "The Tonight Show": "the tonight show"
    },
    {
        ", ": null
    },
    {
        "Jimmy Kimmel Live!": "jimmy kimmel live!"
    },
    {
        ", ": null
    },
    {
        "Extreme Makeover: Home Edition": "extreme makeover: home edition"
    },
    {
        ", ": null
    },
    {
        "Americas Funniest Home Videos": "americas funniest home videos"
    },
    {
        ", and an April Fools Day edition of ": null
    },
    {
        "Larry King Live": "larry king live"
    },
    {
        "; and has served as Grand Marshal of the Tournament of Roses Parade . The characters also appeared on ": null
    },
    {
        "The Cosby Show": "the cosby show"
    },
    {
        " and ": null
    },
    {
        "The Torkelsons": "the torkelsons"
    },
    {
        ", among other sitcoms. The music video for Weezer s Keep Fishin is aesthetically based on The Muppet Show and consists of the band interacting with the characters.     On September 28, 2005, the United States Postal Service released a Jim Henson and the Muppets postage stamp series. United States Postal Service . . Press Release. The Muppets also appeared on ": null
    },
    {
        "Dick Clarks New Years Rockin Eve": "dick clarks new years rockin eve with ryan seacrest"
    },
    {
        " on December 31, 2007, in which Kermit and other characters presented segments following advertising breaks. After one such segment, with Kermit in Times Square , co-host Ryan Seacrest thanked Kerms for his assistance. Miss Piggy has appeared as a guest on ": null
    },
    {
        "The Late Late Show with Craig Ferguson": "the late late show with craig ferguson"
    },
    {
        ", and Kermit appeared on ": null
    },
    {
        "Hollywood Squares": "hollywood squares"
    },
    {
        " and as one of the celebrity commentators on VH1 s I Love documentary series. The Muppets, as well as the title character of ": null
    },
    {
        "Bear in the Big Blue House": "bear in the big blue house"
    },
    {
        ", have made frequent appearances on ": null
    },
    {
        "The Jerry Lewis MDA Labor Day Telethon": "the jerry lewis mda labor day telethon"
    },
    {
        ".     On July 25, 2007, the Center for Puppetry Arts in Atlanta announced the opening of the Jim Henson Wing, which would house up to 700 retired Muppet characters. The wing, first set to open in 2012 with films, sketches, and other materials from the Jim Henson Company archives, eventually opened as a gallery within the Worlds of Puppetry exhibition at the Center in November 2015.     Muppet-like characters star in the Broadway musical ": null
    },
    {
        "Avenue Q": "avenue q"
    },
    {
        ". The Peter Jackson film ": null
    },
    {
        "Meet the Feebles": "meet the feebles"
    },
    {
        ", a satire on the television industry, is largely reminiscent of The Muppet Show. A Kermit the Frog stuffed toy rigged to spray fake vomit recurred on ": null
    },
    {
        "Late Night with Conan OBrien": "late night with conan obrien"
    },
    {
        ", and the Muppets were frequently preempted at the beginning of episodes of ": null
    },
    {
        "You Cant Do That on Television": "you cant do that on television"
    },
    {
        ". The mockumentary series ": null
    },
    {
        "Greg the Bunny": "greg the bunny"
    },
    {
        " centered on sentient hand puppets working on a Muppet-like childrens show. Among other examples, series such as ": null
    },
    {
        "The Simpsons": "the simpsons"
    },
    {
        ", ": null
    },
    {
        "Family Guy": "family guy"
    },
    {
        ", ": null
    },
    {
        "The West Wing": "the west wing"
    },
    {
        " and ": null
    },
    {
        "Robot Chicken": "robot chicken"
    }
]