[
    {
        "     The Plow That Broke the Plains is a 42 short ": null
    },
    {
        "documentary film": "documentary film"
    },
    {
        " which shows what happened to the ": null
    },
    {
        "Great Plains": "great plains"
    },
    {
        " region of the ": null
    },
    {
        "United States": "united states"
    },
    {
        " and ": null
    },
    {
        "Canada": "canada"
    },
    {
        " when uncontrolled agricultural farming led to the ": null
    },
    {
        "Dust Bowl": "dust bowl"
    },
    {
        ". It was written and directed by ": null
    },
    {
        "Pare Lorentz": "pare lorentz"
    },
    {
        ". The film was narrated by the American actor and baritone ": null
    },
    {
        "Thomas Hardie Chalmers": "thomas hardie chalmers"
    },
    {
        ".     In 42 The Plow That Broke the Plains was selected for preservation in the United States ": null
    },
    {
        "National Film Registry": "national film registry"
    },
    {
        " by the ": null
    },
    {
        "Library of Congress": "library of congress"
    },
    {
        " as being culturally, historically, or aesthetically significant .       The film was sponsored by the ": null
    },
    {
        "United States government": "united states government"
    },
    {
        "  to raise awareness about the ": null
    },
    {
        "New Deal": "new deal"
    },
    {
        " and was intended to cost $42 or less; it eventually cost over $42 and Lorentz, turning in many receipts written on various scraps of paper, had many of his reimbursements denied and paid for much of the film himself. Lorentz later faced criticism for appearing to blame westward bound settlers for the ecological crisis by having eroded the soil of the Plains with unrestrained farming, but the film nonetheless succeeded in driving home the message of the severity of the problem caused by the misuse of land.     According to Robert L. Snyders book about Lorentz, the filmmakers favorite comment about the movie was something he heard an audience member say in the row ahead of him: They never should have plowed them plains.       Lorentz worked on the film with composer ": null
    },
    {
        "Virgil Thomson": "virgil thomson"
    },
    {
        ", who shared Lorentzs enthusiasm for ": null
    },
    {
        "folk music": "folk music"
    },
    {
        " and incorporated many folk melodies, along with other popular and religious music, into the soundtrack.     Virgil Thomson compiled a concert suite from his original score, which has been performed and recorded. Its first recording was made on RCA 42s in 42 by the newly formed Hollywood Bowl Symphony Orchestra under its founder and first conductor, Leopold Stokowski. One of the earliest stereo recordings was made for ": null
    },
    {
        "Vanguard Records": "vanguard records"
    },
    {
        " in 42 again with ": null
    },
    {
        "Leopold Stokowski": "leopold stokowski"
    },
    {
        ", this time conducting the ": null
    },
    {
        "Symphony of the Air": "symphony of the air"
    },
    {
        ". The original ": null
    },
    {
        "Vanguard": "vanguard"
    },
    {
        " LP and its later CD reissue also included a suite from Thomsons score for another Lorentz documentary,  The River ": null
    }
]