[
    {
        "The Malloreon is a five-part ": null
    },
    {
        "fantasy": "fantasy"
    },
    {
        " book series written by ": null
    },
    {
        "David Eddings": "david eddings"
    },
    {
        ", which follows  The Belgariad . The Malloreon is set in the same world as The Belgariad, but expands on several aspects of the setting, especially the eastern continent of Mallorea.        Guardians of the West      King of the Murgos      Demon Lord of Karanda      Sorceress of Darshiva      The Seeress of Kell       While the story concludes in The Malloreon, minor events occur in the prequels  Belgarath the Sorcerer  and  Polgara the Sorceress , which otherwise cover the history of the world.     Guardians of the West      At the end of  The Belgariad , ": null
    },
    {
        "Garion": "garion"
    },
    {
        " has slain the evil god ": null
    },
    {
        "Torak": "list of the belgariad and the malloreon characterstorak"
    },
    {
        " and expects lasting peace. The first half of the book concentrates on the first eight years of ": null
    },
    {
        "Belgarion": "belgarion"
    },
    {
        "s reign, describing minor problems including Queen ": null
    },
    {
        "CeNedra": "cenedra"
    },
    {
        "s seeming infertility and a civil war in ": null
    },
    {
        "Arendia": "arendia"
    },
    {
        ". All of these problems are resolved without much trouble, their resolutions providing some ": null
    },
    {
        "comic relief": "comic relief"
    },
    {
        ". The book also depicts the life of Errand, Polgaras ward. During his years under her care, Errand displays near-": null
    },
    {
        "omniscience": "omniscience"
    },
    {
        "; this puzzles Polgara and Belgarath. During the same years, Errand encounters a lesson learned telepathically from an ancient tree and two contacts with people important to his destiny. The inciting action of the story occurs when Garion and Errand are both summoned by the Orb of Aldur, and the Voice of ": null
    },
    {
        "Prophecy": "prophecy"
    },
    {
        " warns them Beware ": null
    },
    {
        "Zandramas": "zandramas"
    },
    {
        "! . Thereafter Garion and Belgarath seek to discover the identity and purpose of Zandramas through records of ancient, dubious prophecies. Ultimately, Garion learns that he is still a figure of prophecy and bears the responsibility of defeating Toraks successor, the Child of Dark .     Subsequent to Garions discovery, his regent ": null
    },
    {
        "Brand": "brand"
    },
    {
        " is murdered by assassins sent to kill ": null
    },
    {
        "CeNedra": "cenedra"
    },
    {
        " and her newborn son Geran. The assassins are traced to the Bear-Cult, a legion of ethnocentric fanatics dedicated to reunification of the empire divided among the sons of Garions ancestor King Cherek. In response, Garion and other descendants of Cherek destroy the Bear-Cult, but are unable to prevent the abduction of Prince Geran. When the cult rising is put down, it is revealed that the leader of the cultists is the priest/sorcerer Harakan, a servant of Toraks disciple Urvon. Harakan escapes shortly after the revelation of his true identity.     The military leaders are later visited by the clairvoyant ": null
    },
    {
        "Cyradis": "minor characters cyradis"
    },
    {
        ", who reveals that Gerans kidnapping was carried out by ": null
    },
    {
        "Zandramas": "zandramas"
    },
    {
        ", the new Child of Dark, and that Garion must recover him with the help of ": null
    },
    {
        "Belgarath": "belgarath"
    },
    {
        ", ": null
    },
    {
        "Polgara": "polgara the sorceress"
    },
    {
        ", CeNedra, ": null
    },
    {
        "Errand": "eriond"
    },
    {
        ", Durnik, and Silk; but shall later acquire the Huntress , the Man Who Is No Man , the Empty One , the Silent Man and the Woman Who Watches . With these companions he must travel to the ": null
    },
    {
        "Place Which Is No More": "korim"
    },
    {
        " for the final meeting between Light and Dark that will decide the fate of the world. When all objections are overcome, the company assembles and departs.          King of the Murgos      In this book, ": null
    },
    {
        "Belgarion": "belgarion"
    },
    {
        " and his fellow travelers learn more about the murderous woman ": null
    },
    {
        "Zandramas": "zandramas"
    },
    {
        " and of her minion, a white-eyed Angarak named Naradas. During their stay in Nyissa they recruit Sadi, a eunuch expelled from Queen Salmissras court. Sadi convinces the group to pose as slavers searching for escaped runaways as the Mallorean army ravages Cthol Murgos. When they enter the wastelands of Cthol Murgos, they are captured by the desert-dwelling Dagashi and given the task of secreting an assassin through the Mallorean army lines. Eventually, they arrive in the palace of the King of the Murgos, Urgit, and discover, to Kheldars surprise, that his father had sired the Murgo King while on a diplomatic mission many years before.     Urgit, upon learning that Kheldar is his half-brother, arranges for the group to travel south to the Isle of Verkat. Before they leave the city, they find that the Dagashi assassin is in fact Harakan. Garion and Harakan duel with swords until Harakan realizes he is about to lose and resorts to sorcery to save himself. The group then sails south. En route, their ship wrecks and they must travel to the coast on foot. On the coast, Toth tells them that ": null
    },
    {
        "Cyradis": "minor characters cyradis"
    },
    {
        " has arranged a boat to take them to the island. On the island, they are directed to Ashaba, Toraks ruined castle. Before they can leave the island, Mallorean soldiers come looking for them, and Cyradis, who must abet both Necessities equally, tells Toth to alert the guards to their presence. The book ends with the company being sent to Emperor Zakaths Imperial Stronghold.          Demon Lord of Karanda      At the beginning of this chapter, Belgarion and his fellow travellers are brought to ": null
    },
    {
        "Mallorea": "mallorea"
    },
    {
        ". There Belgarion meets Kal Zakath, the Mallorean emperor bent on destroying the Murgos royal family. Gradually, Zakath and Garion become ": null
    },
    {
        "friends": "friendship"
    },
    {
        ". When a sudden ": null
    },
    {
        "plague": "pandemic"
    },
    {
        " spreads, necessitating quarantine, the questing party escape the city so as to continue their journey. In escape, they are joined by the ": null
    },
    {
        "jester": "jester"
    },
    {
        " Feldegast , with whom they approach Ashaba. Problems arise when they confirm the report of ": null
    },
    {
        "demon": "demon"
    },
    {
        "s under the Demon Lord Nahaz, who has turned the sorcerer Urvon insane.     Reaching Ashaba, Garion is tricked into believing that he sees Zandramas and his son meeting with Urvon and charges into the throne room. Beldin, on seeing Urvon and his man Harakan, assumes his true form; this starts a battle with Urvons forces, which ultimately results in Harakans death. Nahaz faces the group of sorcerers and the Orb, ready to fight; but when Eriond comes to stand with Garion, the Demon Lord flees, carrying Urvon with him. The group then continues east. Travelling through the demon-infested countryside, and seeing horrors such as women impregnated by demons , the group encounters Zandramas, who attempts to coerce CeNedra within killing distance, until Poledra, Polgaras mother and Belgaraths wife, forces Zandramas to retreat.          Sorceress of Darshiva      The party enters the Melcene ": null
    },
    {
        "Empire": "empire"
    },
    {
        ", where they discover that the Sardion, the moral opposite of the Orb of Aldur, was once kept in an undersea cave where traces of its power still resonate. Upon reaching the University at Melcena, ": null
    },
    {
        "Belgarath": "belgarath"
    },
    {
        " finds an unmutilated copy of the Ashabine Oracles, which he has sought, and decides that the party must go to ": null
    },
    {
        "Kell": "kell kell"
    },
    {
        " to learn of the location of The Place That Is No More . Garion, in the same book, sees that in his sole moment of ": null
    },
    {
        "sanity": "sanity"
    },
    {
        ", Torak specifically addressed Belgarion, demanding that if need be he should destroy the world, even kill his own son, rather than let Zandramas complete her plans. This reflects a similar warning made by Cyradis in Guardians of the West. Having achieved this knowledge, the group return to Mallorea and travel overland. At some point thereafter, a suggestion is made that Toraks existence was an aberration and that another God shall appear to take his place.     The party is recaptured by Zakath, who threatens to take Garion back to Mal Zeth with his companions as ": null
    },
    {
        "collateral": "collateral"
    },
    {
        ". At Beldins request, ": null
    },
    {
        "Cyradis": "minor characters cyradis"
    },
    {
        " persuades him to release the party, offering herself as a hostage; Zakath does so and joins their ": null
    },
    {
        "quest": "quest"
    },
    {
        ". Shortly thereafter, Poledra joins them in the guise of a ": null
    },
    {
        "wolf": "wolf"
    },
    {
        ", bringing an orphaned cub later domesticated by CeNedra. Her identity is concealed from both characters and reader until the next book.     Urvons ": null
    },
    {
        "Karand": "list of the belgariad locationscountries_and_cities"
    },
    {
        " army under Nahaz and Zandramas Darshivan army eventually engage each other in battle, as do Urvons Demon Lord ": null
    },
    {
        "Nahaz": "deities in the belgariad"
    },
    {
        " and Zandramas Demon Lord ": null
    },
    {
        "Mordja": "deities in the belgariad"
    },
    {
        ". The ": null
    },
    {
        "demon": "demon"
    },
    {
        "s go after Garions group, sensing the ": null
    },
    {
        "Orb": "orb of aldur"
    },
    {
        "s presence, but ": null
    },
    {
        "Aldur": "deities in the belgariad"
    },
    {
        " infuses ": null
    },
    {
        "Durnik": "durnik"
    },
    {
        " with his own powers, and he defeats and banishes Nahaz. Aldur, before leaving, informs Belgarath, ": null
    },
    {
        "Beldin": "list of the belgariad and the malloreon charactersdisciples of aldur"
    },
    {
        ", and Polgara that Durnik is also my beloved Disciple, as he was the best suited of ye . An ": null
    },
    {
        "amulet": "amulet"
    },
    {
        " shaped in the likeness of a sledgehammer is then bestowed upon the smith.          The Seeress of Kell      The group continues to ": null
    },
    {
        "Kell": "kell"
    },
    {
        ", where they meet with Cyradis. As ": null
    },
    {
        "promise": "promise"
    },
    {
        "d, the Seeress surrenders herself to Zakath, and directs the others to ": null
    },
    {
        "Perivor": "perivor"
    },
    {
        ", an island to the southwest of the ": null
    },
    {
        "Mallorea": "mallorea"
    },
    {
        "n continent. ": null
    },
    {
        "Garion": "garion"
    },
    {
        "s party and ": null
    },
    {
        "Zandramas": "zandramas"
    },
    {
        "s ": null
    },
    {
        "servant": "servant"
    },
    {
        " Naradas attempt to find maps in Perivor, a kingdom of shipwrecked ": null
    },
    {
        "Mimbrates": "races in the belgariad"
    },
    {
        ", that point the way to the Place Which Is No More. Naradas, disguised as a court minister, delays Garion with red-herring quests, whereafter Sadi poisons him. With the aid of a ": null
    },
    {
        "Necromancer": "necromancer"
    },
    {
        ", they expose his treachery to the ": null
    },
    {
        "King": "king"
    },
    {
        " and find an ancient map on which Place Which is No More is the High Places of Korim, an ancient temple of Torak. There, they confront Zandramas. A battle ensues against her ": null
    },
    {
        "Grolim": "grolim"
    },
    {
        " priests, as well as the demon ": null
    },
    {
        "Mordja": "deities in the belgariad"
    },
    {
        ". Mordja kills the blindfolded Seeresss guide Toth; but Garion slays the demon with his ancestral sword.     The group then accompanies Zandramas into the Sardions resting place, where Zandramas chooses Geran as the next Child of Dark, whereupon Garion chooses Eriond as the next Child of Light. Cyradis, still grieving over the loss of Toth and unable to consult her people, is terrified of making the wrong choice, until ": null
    },
    {
        "Polgara": "polgara the sorceress"
    },
    {
        " removes her blindfold. Receiving a final challenge from Zandramas, Cyradis ultimately chooses Eriond, whereupon Zandramas and the Sardion are changed into stars and transported into outer space.     The Voice of Prophecy explains that the events of the ": null
    },
    {
        "preceding books": "the belgariad"
    },
    {
        " were the result of an ancient accident in space, that resulted in the Light and Dark prophecies, and that Eriond, the final Child of the Light, is now the God of Angarak. Zakaths personal guard soon arrives on the Imperial ship. In the harbor, Barak, Lelldorin, Mandorallen, and Hettar arrive in Baraks ship, with Baraks son Unrak tied to the ships mast. Here, it is revealed that Unrak is his fathers successor to the position of the Rivan Kings guardian, the Dreadful Bear. The sorcerers honor the fallen Toth by populating his ": null
    },
    {
        "funeral": "funeral"
    },
    {
        " slab with eternally growing flowers and sealing off the section of Mount Korim with glowing quartz as his tomb.     After leaving Eriond, Zakath, and Cyradis, the adventurers return home in Baraks ship, where it is revealed that both CeNedra and Polgara are pregnant. The story ends with Garion reading a letter from Zakath, showing that Zakath has now married Cyradis and is witness to the ": null
    },
    {
        "social change": "social change"
    }
]