[
    {
        "              The Dark Knight Returns  is a 42 four-issue comic book ": null
    },
    {
        "miniseries": "limited series"
    },
    {
        " starring ": null
    },
    {
        "Batman": "batman"
    },
    {
        ", written by ": null
    },
    {
        "Frank Miller": "frank miller"
    },
    {
        ", illustrated by Miller and ": null
    },
    {
        "Klaus Janson": "klaus janson"
    },
    {
        ", and published by ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        ". When the series was collected into a single volume later that year, the story title for the first issue was applied to the entire series. The Dark Knight Returns tells an alternative story of Bruce Wayne, who at 42 years old returns from retirement to fight crime and faces opposition from the ": null
    },
    {
        "Gotham City": "gotham city"
    },
    {
        " police force and the United States government. The story introduces ": null
    },
    {
        "Carrie Kelley": "carrie kelley"
    },
    {
        " as the new ": null
    },
    {
        "Robin": "robin"
    },
    {
        " and the hyper-violent street gang known as the ": null
    },
    {
        "Mutants": "mutants"
    },
    {
        ". The story also features the return of classic foes such as ": null
    },
    {
        "Two-Face": "two-face"
    },
    {
        " and ": null
    },
    {
        "The Joker": "joker"
    },
    {
        ", and culminates with a confrontation against ": null
    },
    {
        "Superman": "superman"
    },
    {
        ", who works on behalf of the government.     In the pre-Flashpoint ": null
    },
    {
        "DC Multiverse": "multiverse"
    },
    {
        ", the events of The Dark Knight Returns and its associated titles were designated to occur on Earth42         The Dark Knight Returns is set in a dystopian version of ": null
    },
    {
        "Gotham City": "gotham city"
    },
    {
        " in 42 Bruce Wayne, aged 42 has given up the mantle of Batman after ": null
    },
    {
        "the death of Jason Todd": "batman: a death in the family"
    },
    {
        " ten years prior, and now lives as a bored bachelor. As a result, crime is running rampant throughout the city and a gang calling themselves The ": null
    },
    {
        "Mutants": "mutants"
    },
    {
        " has begun terrorizing the people of Gotham. Upon being reminded of the deaths of ": null
    },
    {
        "his": "thomas wayne"
    },
    {
        " parents": "martha wayne"
    },
    {
        " during a TV broadcast of  The Mark of Zorro  and watching news reports about the Mutants crimes, Wayne returns to his role as a vigilante. On his first night as Batman he puts a stop to multiple assaults – including one on two young girls, Carrie Kelley and her friend Michelle. While attempting to foil an armed robbery on the same night, Batman learns that the men involved are working for ": null
    },
    {
        "Harvey Dent": "two-face"
    },
    {
        ". Dent, previously known for his criminal acts as Two-Face, underwent extensive therapy and plastic surgery financed by Wayne to reemerge into society. Batman informs ": null
    },
    {
        "Commissioner James Gordon": "james gordon"
    },
    {
        " that Dent may be planning a larger scheme. Soon after, Dent hijacks the television sets of the city and announces his intention to hold the city to ransom with a bomb. When Batman defeats Dent and his goons, he realizes that Dents mind has completely warped into his Two-Face persona.     Inspired by Batmans rescue, Kelley buys herself an imitation ": null
    },
    {
        "Robin": "robin"
    },
    {
        " costume and searches for him, seeking to help him. She learns that Batman will be at the city dump and follows the Mutants there. Although Batman defeats the Mutants with his advanced weaponry in the ensuing battle, the Mutant Leader ends up goading him into a hand-to-hand fight. During their brawl, Batman, despite being able to match the Leader in strength, is rusty and slightly slower due to a decade of inactivity, which results in him getting seriously injured. Kelley creates a diversion, allowing Batman to immobilize the Mutant Leader, and the two of them escape. At the ": null
    },
    {
        "Batcave": "batcave"
    },
    {
        ", Waynes butler ": null
    },
    {
        "Alfred Pennyworth": "alfred pennyworth"
    },
    {
        " tends to his wounds while Kelley admires the Robin costume that belonged to Todd. Wayne decides to keep Kelley as his new sidekick. Gordon allows Batman to defeat the Mutant Leader on his own terms. The two engage in a fight at a sewage run-off pipe surrounded by members of the Mutant gang. Batman, leveraging the mud from the sewage to slow him down, deals the Leader a brutal defeat. Seeing Batman defeat their leader, the Mutants disband and some rename themselves the Sons of Batman, using excessive violence against criminals.     At the ": null
    },
    {
        "White House": "white house"
    },
    {
        ", ": null
    },
    {
        "Superman": "superman"
    },
    {
        " and current president ": null
    },
    {
        "Ronald Reagan": "ronald reagan"
    },
    {
        " discuss the events in Gotham, with the latter suggesting that Superman may have to arrest Batman. Superman informs the president that he may only be able to talk to Wayne. He is then deployed by ": null
    },
    {
        "Washington": "federal government of the united states"
    },
    {
        " to the ": null
    },
    {
        "Latin America": "latin america"
    },
    {
        "n country of ": null
    },
    {
        "Corto Maltese": "corto maltese"
    },
    {
        " where he fights ": null
    },
    {
        "Soviet combat forces": "soviet armed forces"
    },
    {
        " in a conflict that may ignite ": null
    },
    {
        "World War III": "world war iii"
    },
    {
        ".     Gordon hands over the role of commissioner to Captain Ellen Yindel, who issues a statement declaring that Batman is a wanted criminal for his vigilante activities. At the same time, Batmans return stimulates ": null
    },
    {
        "the Joker": "joker"
    },
    {
        " to awaken from ": null
    },
    {
        "catatonia": "catatonia"
    },
    {
        " at ": null
    },
    {
        "Arkham Asylum": "arkham asylum"
    },
    {
        ". With renewed purpose, the Joker manipulates his caretakers to allow him onto a television talk show, where he murders everyone with ": null
    },
    {
        "gas": "joker venom"
    },
    {
        " and escapes. With the help of ": null
    },
    {
        "Selina Kyle": "catwoman"
    },
    {
        ", Batman and Robin track him to a county fair while evading a police pursuit led by Yindel. There, they realize that he is already making attempts to kill fairgoers. Batman defeats the Joker in a bloody confrontation, which ends when the Joker commits suicide by breaking his own neck to incriminate Batman for murder. After another confrontation with the ": null
    },
    {
        "Gotham police": "gotham city police department"
    },
    {
        ", Batman escapes with the help of Robin and a citywide manhunt begins.     Superman diverts a Soviet nuclear warhead which detonates in a desert, nearly killing himself in the process. The United States is hit by an ": null
    },
    {
        "electromagnetic pulse": "nuclear electromagnetic pulse"
    },
    {
        " as a result and descends into chaos during the resulting ": null
    },
    {
        "blackout": "power outage"
    },
    {
        ". In Gotham, Batman realizes what has happened, and he and Robin turn the remaining Mutants and Sons of the Batman into a non-lethal vigilante gang. He leads them against looters and ensures the flow of essential supplies. In the midst of the blackout, Gotham becomes the safest city in the country. The U.S. government sees this as an embarrassment, and orders Superman to remove Batman. ": null
    },
    {
        "Oliver Queen": "green arrow"
    },
    {
        " predicts to Wayne that the government lackey Superman and the maverick Batman will have a final confrontation. Superman demands to meet Batman. Knowing he may die, Wayne chooses ": null
    },
    {
        "Crime Alley": "crime alley"
    },
    {
        ", where he first became Batman. He relies on Supermans weakness caused by near-death in the nuclear blast .     Superman tries to reason with Batman, but Batman uses his technological inventions and mastery of hand-to-hand combat to fight him on equal ground. During the battle, Superman compromises Batmans ": null
    },
    {
        "exoframe": "powered exoskeleton"
    },
    {
        ", but Queen shoots a ": null
    },
    {
        "kryptonite": "kryptonite"
    },
    {
        "-tipped arrow to greatly weaken Superman. Batman reveals that he intentionally spared Supermans life by not using a more powerful kryptonite mix; the fight and near-death experience was meant as a warning to Superman to stay out of Batmans way. Before he can fully defeat Superman, Batman suddenly has a heart attack, apparently dying. Alfred destroys the Batcave and ": null
    },
    {
        "Wayne Manor": "wayne manor"
    },
    {
        " before dying of a stroke, exposing Batman as Bruce Wayne, whose fortune has disappeared. After Waynes funeral, it is revealed that his death was staged using his own chemical concoction that can suspend his vital life signs. Clark Kent attends the funeral and winks at Robin after hearing Waynes heartbeat resume. Some time afterward, Bruce Wayne leads Robin, Queen, and the rest of his followers into the caverns beyond the Batcave and prepares to continue his war on crime.        Bruce Wayne/Batman : Bruce Wayne is 42 years old and has been retired from his Batman persona for a decade. When he sees violence becoming more common not just in Gotham City but also the world, he feels a strong desire to return as Batman and emerges from his depression.    Alfred Pennyworth : Waynes trusted butler, medic, and confidant; now in his eighties.    Carrie Kelley / Robin : A 42-year-old girl with absentee parents, who later becomes Batmans sidekick, Robin. Throughout the story, she is frequently mistaken for the former Boy Wonder . After she saves the Dark Knights life, the aging Batman places his trust in her against Alfreds wishes.    James Gordon : The retiring Commissioner of the Gotham City Police Department, who retires on his 42th birthday. He is aware of Batmans true identity.    Harvey Dent/Two-Face : Now in his 42s, and having spent 42 years in Arkham Asylum, Harvey Dent has been treated by Doctor Wolper for three years and his face has been repaired with plastic surgery. Dents doctor gives him a clean bill of mental health, but he is still Two-Face in his mind. Dent terrorizes the city with his face swathed in bandages as he now perceives both sides of his face as scarred.    The Joker : Batmans archenemy who, now 42 years old, awakens from a catatonic state upon learning of Batmans re-emergence. He plans a brutal crime spree to draw out Batman, setting in motion the events leading to a final confrontation.   The Mutant Leader: The cunning, brutal, and albino head of the Mutants, who seeks to control Gotham and kill anyone who opposes him.   Dr. Bartholomew Wolper: Two-Face and Jokers psychiatrist and opponent of Batmans fascist vigilantism. Wolper is convinced that the Joker and Two-Face are both victims of Batmans crusade. He is killed when the Joker floods a television studio with poisonous gas; Wolpers neck is snapped by the robot Bobbie.   Ellen Yindel: James Gordons successor as Commissioner. A captain in the Gotham City Police Department, she is a critic of Batman, but begins to doubt herself after the Jokers crime spree.   The Mayor of Gotham City : The unnamed mayor of Gotham City. He tries to negotiate peace with the Mutant Leader at the time he was in police custody only to be killed by him.   Deputy Mayor Stevenson : The deputy mayor of Gotham City, who later becomes the new mayor after the former mayor is killed by the Mutant Leader. He states that Commissioner Ellen Yindel will make the decision of how to act with Batman.    Ronald Reagan : The president of the United States. He instructs Superman to deal with Batman in Gotham City.    Oliver Queen : After superheroes are outlawed, Queen, now in his late fifties, undertakes a clandestine rebellion against government oppression, including the sinking of a nuclear submarine. He lost his left arm after an encounter with Superman. Despite this disability, Queen is still a highly skilled marksman.    Kal-El/Clark Kent/Superman : Superman is now an agent of the U.S. government and his secret identity as the former  Daily Planet  reporter Clark Kent is publicly known. In his inner thoughts he despises being a government tool, but he believes it is the only way he can save lives in this day and age. Appearing in his thirties, because of his Kryptonian physique, his aging process is slower than his former allies, which is one of the reasons of why he is no longer able to hide his secret identity. In the final climax, Superman battles Batman in a final attempt to rid the government of his opposition, but is weakened by a Kryptonite arrow fired by Queen, allowing an armored Batman to stand up to him.    Selina Kyle : No longer Catwoman, Selina Kyle, now in her early fifties, runs an escort business.    Lana Lang : The managing editor of the Daily Planet who is an outspoken supporter of Batman, appearing on a series of TV debates in which she argues with others over his methods and influence.   Dave Endochrine: A late night talk show host who invites the Joker and Dr. Wolper on his show; he and his audience are later killed by the Jokers poisonous gas. He is a characterization of ": null
    },
    {
        "David Letterman": "david letterman"
    },
    {
        ".   Bruno: The leader of a group of ": null
    },
    {
        "Nazi": "nazi"
    },
    {
        "-inspired criminals. Working for the Joker, she battles Batman and Robin but is caught by Superman.   Abner: Jokers hulking henchman. He builds two robotic dolls, Bobbie and Mary, to kill the Jokers TV audience; he later attempts to kill Robin at a funfair but is decapitated by a roller coaster instead.   Sons of Batman : A group of teenagers who were formerly part of the Mutants. They have become followers of Batman since the defeat of the Mutant Leader, although they are too unruly and corrupt, taking severe measures to control the streets and even Batman. They end up following Batman for good intentions instead of bad.            Since the 42s, when the ": null
    },
    {
        "Comics Code Authority": "comics code authority"
    },
    {
        " was established, the character of Batman had drifted from his darker, more serious roots. It was not until the 42s when the character began to feature in darker stories once again; however, Batman was still commonly associated with the campy theme of the ": null
    },
    {
        "42s Batman TV series": "batman"
    },
    {
        ", and as a father figure to ": null
    },
    {
        "Robin": "robin"
    },
    {
        " rather than the vigilante he was introduced as.      In the early 42s, DC Comics promoted Batman group editor ": null
    },
    {
        "Dick Giordano": "dick giordano"
    },
    {
        " to editorial director for the company. Writer-artist Frank Miller was recruited to create The Dark Knight Returns. Giordano said he worked with Miller on the storys plot, and said, e version that was finally done was about his fourth or fifth draft. The basic storyline was the same but there were a lot of detours along the way.  During the creation of the series, fellow comics writer/artist ": null
    },
    {
        "John Byrne": "john byrne"
    },
    {
        " told Miller, Robin must be a girl , and Miller agreed. Miller said that the comic series plot was inspired by ": null
    },
    {
        "Dirty Harry": "harry callahan"
    },
    {
        ", specifically the 42 film  Sudden Impact , in which Dirty Harry returns to crime-fighting after a lengthy convalescence. The series employed a 42-panel grid for its pages. Each page was composed of either a combination of 42 panels, or anywhere between sixteen and one panel per page. ": null
    },
    {
        "Hitch, Bryan": "hitch, bryan"
    },
    {
        " . Bryan Hitchs Ultimate Comics Studio. Impact Books. p. 42 Giordano left the project halfway through because of disagreements over production deadlines. Comics historian Les Daniels wrote that Millers idea of ignoring deadlines was the culmination of the quest towards artistic independence .      The issues of The Dark Knight Returns were presented in packaging that included extra pages, square binding and glossy paper to highlight the watercolor paintings by colorist ": null
    },
    {
        "Lynn Varley": "lynn varley"
    },
    {
        ".       Despite the cost of the single-issue packaging, The Dark Knight Returns sold well. Priced at $42 an issue, DC Comics promoted The Dark Knight Returns as a thought-provoking action story .  Time  said the series depiction of a semi-retired Batman is unsure about his crime-fighting abilities was an example of trying to appeal to todays skeptical readers .  More than 42 million comics in print were issued.      Retrospectively, the series is today widely considered one of the greatest works in the comics medium. ": null
    },
    {
        "IGN": "ign"
    },
    {
        " Comics ranked The Dark Knight Returns first on a list of the 42 greatest Batman graphic novels and called The Dark Knight Returns a true masterpiece of storytelling with ene after unforgettable scene.  In 42 Time chose the collected edition as one of the 42 best English language graphic novels ever written.  ": null
    },
    {
        "Forbidden Planet": "forbidden planet"
    },
    {
        " placed the collected issue at number one on its 42 Best of the Best Graphic Novels list.  Writer Matthew K. Manning in the 42s chapter of DC Comics Year By Year A Visual Chronicle called the series arguably the best Batman story of all time. It was placed second in a poll among comic book academics conducted by the ": null
    },
    {
        "Sequart Organization": "sequart organization"
    },
    {
        ".      The series also garnered some negative reviews. In April 42 Nicolas Slayton from Comics Bulletin ranked The Dark Knight Returns second in his Tuesday Top Ten features Top 42 Overrated Comic Books behind  Watchmen . Slayton wrote, ere is no central plot to the comic, leaving only a forced fight scene between Superman and Batman as an out of place climax to the story. Gone are the traits that define Batman, also citing misuse of the central character.   The New York Times  gave the 42 collected release of the series a negative review.            The immense popularity of The Dark Knight Returns served both to return the character of Batman to a central role in pop culture, but also  started the era known as the ": null
    },
    {
        "Dark Age of Comic Books": "dark age of comic books"
    },
    {
        " . The grim, seedy versions of Gotham and Batman successfully updated the characters identity from the campy ": null
    },
    {
        "Adam West": "adam west"
    },
    {
        " version remembered from the ": null
    },
    {
        "42s Batman TV series": "batman"
    },
    {
        ", and proved critically and commercially successful enough that a new wave of dark superheroes were either created, repopularized, or revamped altogether to fit this new trend.     The Dark Knight Returns was one of the two comic books, alongside Watchmen, that inspired designer ": null
    },
    {
        "Vincent Connare": "vincent connare"
    },
    {
        " when he created the ": null
    },
    {
        "Comic Sans": "comic sans"
    },
    {
        " font.        A three-issue sequel written and illustrated by Miller,  The Dark Knight Strikes Again , was published in 42 A nine-issue third installment,  The Dark Knight III: The Master Race , co-written by Miller and ": null
    },
    {
        "Brian Azzarello": "brian azzarello"
    },
    {
        ", was published approximately bi-monthly starting in late 42 As of 42 Frank Miller has released the name of the 42th chapter of the series, a prestige format one-shot entitled Dark Knight Returns: The Golden Child, released under ": null
    },
    {
        "DC Black Label": "dc black label"
    },
    {
        ".  In addition, a 42-page prestige format one-shot co-written by Miller and Azzarello, Dark Knight Returns: The Last Crusade, which serves as a prequel to the original series, was released on June 42 42  Additionally,  Spawn/Batman  was released in 42 as a companion to The Dark Knight Returns, and, according to Miller, the series  All Star Batman & Robin, the Boy Wonder  can be considered as a prequel, as can the four issue story  Batman: Year One .     In 42 this version of Batman appeared in the  Zero Hour: Crisis in Time  crossover event playing a small role.     In March 42 he would also appear in a brief cameo in the sixth and final issue of the  Dark Nights: Metal  event.     The 42-issue miniseries  Superman: Year One  was revealed by Frank Miller to be set in the same universe as the Dark Knight Returns series.             ": null
    },
    {
        "Stephen Amell": "stephen amell"
    },
    {
        " appears as an older Oliver Queen in the  Legends of Tomorrow  episode Star City 42 , with a grey goatee and missing his left arm, a nod to the portrayal of the character in The Dark Knight Returns.    In the episode ": null
    },
    {
        "The Gentle Art of Making Enemies": "the gentle art of making enemies"
    },
    {
        " of  Gotham , the shows first Proto-Joker, ": null
    },
    {
        "Jerome Valeska": "jerome and jeremiah valeska"
    },
    {
        "  confronts Bruce Wayne in a house of mirrors after the GCPD raid Jeromes carnival populated by his cult followers, which pays homage to Batman and Jokers final confrontation in The Dark Knight Returns. In addition, Monaghans performance as the second Proto-Joker ": null
    },
    {
        "Jeremiah Valeska": "jerome and jeremiah valeska"
    },
    {
        ", took some influence from the Joker in the comic.       In the episode Legends of the Dark Knight of  The New Batman Adventures , a scene is directly based on both of Batmans fights with the Mutants leader, who was voiced by ": null
    },
    {
        "Kevin Michael Richardson": "kevin michael richardson"
    },
    {
        ". ": null
    },
    {
        "Michael Ironside": "michael ironside"
    },
    {
        " voiced The Dark Knight Returns version of Batman.    Two members of the Mutant gang are shown throwing snowballs at an elderly Beast Boy in a cage in the episode How Long Is Forever? of  Teen Titans .     The Batman  episode Artifacts , set in a future Gotham, mostly references Millers work, with the future Batman depicted as a tall, muscular man and Mr. Freeze going so far as speaking the sentence The Dark Knight returns upon meeting his nemesis.    There are some references in  Batman: The Brave and the Bold . In the season 42 episode The Knights of Tomorrow! , the Mutant gang is seen robbing a bank in a future where Bruce Waynes son, ": null
    },
    {
        "Damian": "damian wayne"
    },
    {
        ", is the new Batman.  The battle between Batman and Superman is featured in the season 42 episode Battle of the Super-Heroes! , where Batman wears a similar armored suit as well as some moments of the fight taken straight out of the comic.    In the episode “Play Date”, from  Justice League Action , Batmans entrance uses the iconic cover pose.          ": null
    },
    {
        "Tim Burton": "tim burton"
    },
    {
        "s 42 film  Batman  takes influence from the third book in the series, when Batman and the Joker have a fight to the death in the climax.   In the 42 film  Batman Forever , director ": null
    },
    {
        "Joel Schumacher": "joel schumacher"
    },
    {
        " uses some references of the comic: when Bruce remembers falling into the cave as a kid, and in a deleted scene when GNN News makes a bad reputation of Batman after his fight with Two Face in Gotham Subway and before when he follows Two Face in a helicopter.   According to Schumacher, he proposed a film adaptation of The Dark Knight Returns when ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        " commissioned him and writer ": null
    },
    {
        "Akiva Goldsman": "akiva goldsman"
    },
    {
        " to create a sequel to  Batman Forever , but the idea was shelved in favor of  Batman & Robin . After the cancellation of  Batman Unchained , Schumacher proposed an adaptation of The Dark Knight Returns, which Warner considered during their attempts to revamp the character.  ": null
    },
    {
        "Michael Keaton": "michael keaton"
    },
    {
        "  and ": null
    },
    {
        "Clint Eastwood": "clint eastwood"
    },
    {
        " were considered to play ": null
    },
    {
        "Batman": "batman"
    },
    {
        " while singer ": null
    },
    {
        "David Bowie": "david bowie"
    },
    {
        " was considered again to play ": null
    },
    {
        "The Joker.": "joker"
    },
    {
        " However, the project was finally cancelled in favor of the also shelved  Batman: DarKnight .    The Tumbler in  Batman Begins  was inspired by the Batmobile in The Dark Knight Returns. Both Batmobiles are designed as large, military vehicles built for special purposes.   The copycat Batman vigilantes in  The Dark Knight  were inspired by the Sons of Batman in the Dark Knight Returns. Like the Sons of Batman, the copycats are a gang who are inspired by Batmans actions and decided to follow his example by using violence against criminals.   In the 42 film  The Dark Knight Rises , director ": null
    },
    {
        "Christopher Nolan": "christopher nolan"
    },
    {
        " used a number of stories including The Dark Knight Returns as influence for the film.  After the death of ": null
    },
    {
        "Rachel Dawes": "rachel dawes"
    },
    {
        ", Bruce Wayne retires from Batman and spends the next eight years in a depressed state caused by his experiences as a vigilante. Bruce decides to return as Batman when he realizes that ": null
    },
    {
        "The League of Shadows": "the league of shadows"
    },
    {
        " has returned to Gotham; Bruce uses a special brace for his arm to compensate his frail physicality. While in the film, Bruce uses a brace to support his damaged leg; During a police chase, two cops witness Batmans unexpected return. The older cop comments to his younger partner, Youre in for a show, kid ; The fight between Batman and ": null
    },
    {
        "Bane": "bane"
    },
    {
        " was influenced by the two separate fights between Batman and the Mutant Leader. Due to years of inactivity, Batman fails to beat the Mutant Leader and gets badly beaten. In the second time, Batman brutally fights the Mutant Leader while his followers watch in silence; After Harvey Dent dies in  The Dark Knight , Batman is falsely accused for his death and becomes a ": null
    },
    {
        "fugitive": "fugitive"
    },
    {
        ". Similar to Batmans circumstances with the Joker in the graphic novel; When Gotham City is in chaos during the blackout, Batman brings together the Sons of Batman in order to stop the rioters in the streets. Similar to how Batman brings together the Gotham police to fight against Banes army. At the end, Bruce abandons his personal life and persona as Batman by faking his death. So he can have a fresh start with his crime-fighting career. In the film, Bruce fakes his death so he can finally move on from Batman and start a new life with Selina Kyle in ": null
    },
    {
        "Florence": "florence"
    },
    {
        ".   Director Zack Snyder stated that although the 42 film  Batman v Superman: Dawn of Justice  features an original premise, the film does borrow some elements from The Dark Knight Returns, like an older and hardened Batman who lost ": null
    },
    {
        "Jason Todd": "jason todd"
    },
    {
        " in his younger years, Batmans fateful confrontation with Superman, and the Batsuit and the armored suit both closely resembling the ones shown in the comic.  There are also a few shots in the film directly taken from the pages of Millers work.   The 42 animated film  Teen Titans Go! To the Movies  had Robin dream up a sequence which seems to parody The Lion King, where he is lifted up by the Batman from The Dark Knight Returns continuity. Later on, Robin appears in a musical sequence where he parodies the iconic Dark Knight Returns cover where Robin poses against a lightning effect with the title: Robin: The Dark Hero Returns.   The talk show host David Endochrine from the The Dark Knight Returns served as inspiration for the character Murray Franklin in the 42 film  Joker , played by ": null
    },
    {
        "Robert de Niro": "robert de niro"
    },
    {
        ". His interview with the Joker is somewhat similar to the one in the comic.       ": null
    },
    {
        "DC Entertainment": "dc entertainment"
    },
    {
        " produced ": null
    },
    {
        "a two-part animated adaptation": "batman: the dark knight returns"
    },
    {
        ".   Part 42 of this two-part animated film was released on DVD/Blu-ray on September 42 42 Part 42 was released on January 42 42 with ": null
    },
    {
        "Peter Weller": "peter weller"
    },
    {
        " voicing Batman and ": null
    },
    {
        "Michael Emerson": "michael emerson"
    },
    {
        " voicing the Joker.       In the episode Girl Meets the New Teacher of  Girl Meets World , the new English teacher Harper Burgess gives out copies for her class to study, which creates controversy with the principal who disapproves of the comic.        In 42 to commemorate the 42th anniversary of the graphic novel, DC released a new hardcover and a later softcover release. These included original rough script text for issue 42 with some sketches by Miller. There was also a limited edition slip cased hardcover that had mini poster prints, separate media review and sketch book by Miller. DC Direct released a limited edition statue of Batman and Robin designed by Miller. It was released in full size and then later as a mini sized statue.   DC Direct released a series of ": null
    },
    {
        "Batman action figures": "batman action figures"
    },
    {
        " based on The Dark Knight Returns in 42 It included figures of Batman, Robin, Superman, and The Joker. Later, a Batman and Joker Gift Set was released, including both characters with new color schemes to reflect earlier points in the story, and a 42-page prestige format reprint of The Dark Knight Returns 42 was also released. An action figure of Batman as he appears in The Dark Knight Returns was released by Mattel in 42 as part of their Batman Unlimited line of action figures. ": null
    },
    {
        "The New 42": "the new 52"
    },
    {
        "s  Batman and Robin  Issue 42 . She is a college student and the late ": null
    },
    {
        "Damian Wayne": "damian wayne"
    },
    {
        "s drama instructor. As a homage to The Dark Knight Returns, she wears an imitation Robin costume as a Halloween costume in her first appearance.    Batman/Bruce Wayne and Carrie Kelley/Robin appear in a one-page article in Comics Collector 42 , predating their first comic book appearance.            ": null
    }
]