[
    {
        "The Story of Louis Pasteur  is a 42 American ": null
    },
    {
        "black-and-white": "black-and-white"
    },
    {
        " biographical film": "biographical film"
    },
    {
        " from ": null
    },
    {
        "Warner Bros.": "warner bros."
    },
    {
        ", produced by ": null
    },
    {
        "Henry Blanke": "henry blanke"
    },
    {
        ", directed by ": null
    },
    {
        "William Dieterle": "william dieterle"
    },
    {
        ", that stars ": null
    },
    {
        "Josephine Hutchinson": "josephine hutchinson"
    },
    {
        ", ": null
    },
    {
        "Anita Louise": "anita louise"
    },
    {
        ", and ": null
    },
    {
        "Donald Woods": "donald woods"
    },
    {
        ", and ": null
    },
    {
        "Paul Muni": "paul muni"
    },
    {
        " as the ": null
    },
    {
        "renowned scientist": "louis pasteur"
    },
    {
        " who developed major advances in ": null
    },
    {
        "microbiology": "microbiology"
    },
    {
        ", which revolutionized ": null
    },
    {
        "agriculture": "agriculture"
    },
    {
        " and ": null
    },
    {
        "medicine": "medicine"
    },
    {
        ". The films screenplay—which tells a highly fictionalized version of Pasteur’s life—was written by ": null
    },
    {
        "Pierre Collings": "pierre collings"
    },
    {
        " and ": null
    },
    {
        "Sheridan Gibney": "sheridan gibney"
    },
    {
        ", and ": null
    },
    {
        "Edward Chodorov": "edward chodorov"
    },
    {
        " .     Muni won an ": null
    },
    {
        "Academy Award for Best Actor": "academy award for best actor"
    },
    {
        ", while Collings and Gibney won for ": null
    },
    {
        "Best Screenplay": "academy award for best adapted screenplay"
    },
    {
        " and ": null
    },
    {
        "Best Story": "academy award for best story"
    },
    {
        ". The film was nominated for ": null
    },
    {
        "Best Picture": "academy award for best picture"
    },
    {
        ".     Muni also won the Volpi Cup for Best Actor from the Venice Film Festival in 42       In Paris in 42 a distraught man murders his wifes doctor. Chemist ": null
    },
    {
        "Louis Pasteur": "louis pasteur"
    },
    {
        "  has been publicizing a theory that diseases are caused by ": null
    },
    {
        "microbe": "microbe"
    },
    {
        "s, which doctors should avoid spreading by washing their hands and sterilizing their instruments in boiling water. The doctor did not do this and the wife died of ": null
    },
    {
        "puerperal fever": "postpartum infections"
    },
    {
        " after giving birth.     Pasteur is dismissed by Frances medical academy & mdash;particularly his most vocal critic, Dr. Charbonnet  & mdash;as a crank whose recommendations are tantamount to witchcraft. Pasteur frankly calls attention to the risks of Charbonnets non-sterile methods and correctly predicts that a member of ": null
    },
    {
        "Napoleon III": "napoleon iii"
    },
    {
        "s royal family who Charbonnet is attending will die of puerperal fever, but Pasteur is the one who is considered dangerous, because his ideas have led to murder. When the Emperor comes down against him, Pasteur leaves Paris and moves to the small town of ": null
    },
    {
        "Arbois": "arbois"
    },
    {
        ".     In the 42s, when the new French government tries to restore the economy after the ": null
    },
    {
        "Franco-Prussian War": "franco-prussian war"
    },
    {
        ", they learn that many sheep are dying of ": null
    },
    {
        "anthrax": "anthrax"
    },
    {
        ", except around Arbois. They send representatives who learn that, working with a small group of loyal researchers, Pasteur has developed a vaccine against the disease and put it into use locally.     The medical academy still opposes him and says Arbois must simply be free of anthrax, so the government buys land there and invites sheep farmers to use it. Pasteur objects strongly, saying the soil is full of anthrax ": null
    },
    {
        "spore": "spore"
    },
    {
        "s, and eventually an experiment is proposed. He will vaccinate 42 of the newly arrived sheep; then they and a ": null
    },
    {
        "control group": "control group"
    },
    {
        " of 42 others will be injected with blood from a sheep with anthrax.     ": null
    },
    {
        "Joseph Lister": "joseph lister"
    },
    {
        " , the pioneer of antiseptic surgery in England, is interested enough to attend, and witnesses Pasteurs total success as all the vaccinated sheep remain healthy after the other 42 have died. At this point Jean Martel , a young doctor who was formerly Charbonnets assistant but now is a follower of Pasteur, becomes engaged to Pasteurs daughter Annette .     The celebrations are short-lived, as a ": null
    },
    {
        "rabid dog": "rabies"
    },
    {
        " runs through the town and a man is bitten. As a woman attempts to cure him by witchcraft, Pasteur laments that doctors would have no more chance of success. Moving back to Paris, he makes rabies his next project. He is able to spread the disease from one animal to another by injection, but finds himself unable to detect any microbe being transferred , and the method he used to create the anthrax vaccine does not work.     Charbonnet visits the lab to gloat over Pasteurs failure. He is so certain Pasteur is a quack that he injects himself with rabies & mdash;and is triumphant, as he does not get the disease.   Pasteur is puzzled, until his wife Marie  suggests that the sample may have gotten weak with age. This sets him on the right path at last, giving dogs a series of   progressively stronger injections.     But before his experiments reach a conclusion, a frantic mother begs him to try his untested treatment on her son , who has been bitten by a rabid dog. Risking imprisonment or even execution, Pasteur decides he must try to save the child. During the attempt, a Dr. Zaranoff  arrives from Russia with a group of peasants who have been exposed to rabies, and who have volunteered to receive Pasteurs treatment.     Annette goes into labor with Martels child. The doctor who was to attend her is unavailable, and Martel is urgently needed for the boy. Pasteur searches frantically for another doctor, but the only one he can find is none other than Charbonnet. He begs Charbonnet to wash his hands and sterilize his instruments just this once; Charbonnet finally agrees on condition that if Charbonnet lives another month, Pasteur will retract and denounce all his work on rabies. Both men are honorable enough to respect the agreement. The birth goes well, but Pasteur collapses with a mild stroke.     Days later, word comes that Pasteur has permission to treat those of the Russians who are still alive. He attends them in hospital for the first injections using a wheelchair, and later using a cane. The experiment is a success, and now even Charbonnet concedes that he was wrong, tearing up Pasteurs retraction and asking for the shots for himself.     Afterwards, Pasteur hears that he is to be denounced by Lister at the medical academy. He angrily attends, but it was just a way to surprise him. He is praised by Lister, presented with a Russian medal by Zaranoff, and honored by the very doctors who once scoffed at his discoveries.       ": null
    },
    {
        "Paul Muni": "paul muni"
    },
    {
        " as ": null
    },
    {
        "Louis Pasteur": "louis pasteur"
    },
    {
        " Josephine Hutchinson": "josephine hutchinson"
    },
    {
        " as ": null
    },
    {
        "Marie Pasteur": "marie pasteur"
    },
    {
        " Anita Louise": "anita louise"
    },
    {
        " as Annette Pasteur   ": null
    },
    {
        "Donald Woods": "donald woods"
    },
    {
        " as Dr. Jean Martel   ": null
    },
    {
        "Fritz Leiber": "fritz leiber, sr."
    },
    {
        " as Dr. Charbonnet   ": null
    },
    {
        "Henry ONeill": "henry oneill"
    },
    {
        " as Dr. ": null
    },
    {
        "Emile Roux": "pierre paul émile roux"
    },
    {
        " Porter Hall": "porter hall"
    },
    {
        " as Dr. Rossignol   Raymond Brown as Dr. Radisse   ": null
    },
    {
        "Akim Tamiroff": "akim tamiroff"
    },
    {
        " as Dr. Zaranoff   ": null
    },
    {
        "Halliwell Hobbes": "halliwell hobbes"
    },
    {
        " as ": null
    },
    {
        "Dr. Lister": "joseph lister, 1st baron lister"
    },
    {
        " Frank Reicher": "frank reicher"
    },
    {
        " as Dr. Pfeiffer   ": null
    },
    {
        "Dickie Moore": "dickie moore"
    },
    {
        " as ": null
    },
    {
        "Joseph Meister": "joseph meister"
    },
    {
        " Walter Kingsford": "walter kingsford"
    },
    {
        " as ": null
    },
    {
        "Napoleon III": "napoleon iii of france"
    },
    {
        " Empress Eugénie": "eugénie de montijo"
    },
    {
        " Herbert Corthell": "herbert corthell"
    },
    {
        " as ": null
    },
    {
        "Louis Adolphe Thiers": "adolphe thiers"
    },
    {
        ", President of France   ": null
    },
    {
        "Frank Mayo": "frank mayo"
    },
    {
        " as ": null
    },
    {
        "Sadi Carnot": "marie francois sadi carnot"
    },
    {
        "   Leonid Snegoff as ": null
    },
    {
        "Russian Ambassador": "arthur von mohrenheim"
    },
    {
        "   Edward Van Sloan": "edward van sloan"
    },
    {
        " as Chairman of Medical Society       Writing for  The Spectator  in 42 ": null
    },
    {
        "Graham Greene": "graham greene"
    },
    {
        " gave the film a good review, describing it as an honest, interesting and well-made picture . Characterizing Paul Muni as the greatest living actor and as a Protean figure , Greene asserts that Munis depiction of Pasteur is accomplished with his whole body not only the bourgeois, the elderly, the stubborn and bitter and noble little chemist, but his nationality and even his period.       The film and lead character were nominated for two of the ": null
    },
    {
        "American Film Institute": "american film institute"
    },
    {
        "s lists:   42: ": null
    },
    {
        "AFIs 42 Years...42 Heroes & Villains": "afis 100 years...100 heroes  &  villains"
    },
    {
        ":   ": null
    },
    {
        "Louis Pasteur": "louis pasteur"
    },
    {
        " – Hero    42: ": null
    },
    {
        "AFIs 42 Years...42 Cheers": "afis 100 years...100 cheers"
    },
    {
        "        Paul Muni reprised his role in two radio play versions of the film: the November 42 42 episode of  Lux Radio Theater  and the April 42 42 episode of  Academy Award Theater ": null
    }
]