[
    {
        "         The Last Flight is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . Part of the production was filmed on location at ": null
    },
    {
        "Norton Air Force Base": "norton air force base"
    },
    {
        " in ": null
    },
    {
        "San Bernardino, California": "san bernardino, california"
    },
    {
        ". The vintage 42 ": null
    },
    {
        "Nieuport 42": "nieuport 28"
    },
    {
        " biplane was both owned and flown by ": null
    },
    {
        "Frank Gifford Tallman": "frank gifford tallman"
    },
    {
        ", and had previously appeared in many ": null
    },
    {
        "World War I": "world war i"
    },
    {
        " motion pictures": "film"
    },
    {
        ".              ": null
    },
    {
        "Flight Lieutenant": "flight lieutenant"
    },
    {
        " William Terrance Terry Decker of ": null
    },
    {
        "42 Squadron": "no. 56 squadron raf"
    },
    {
        " Royal Flying Corps": "royal flying corps"
    },
    {
        " lands his ": null
    },
    {
        "Nieuport": "nieuport"
    },
    {
        " biplane on an American airbase in France, after flying through a strange cloud. He is immediately accosted by ": null
    },
    {
        "provost marshal": "provost marshal"
    },
    {
        " Major Wilson who is dumbfounded by Deckers archaic appearance. Decker, likewise is baffled, but by the unexplainable large modern aircraft We had no idea you were so advanced! He is then taken into custody and questioned by the American base commander, Major General Harper, and Wilson. Decker snaps to attention, identifying himself as being from the UKs ": null
    },
    {
        "Royal Flying Corps": "royal flying corps"
    },
    {
        " . This puzzles Harper and Wison. Harper, seeing Deckers antique uniform, queries Decker if there is a vintage air show nearby, or if he is making a film - Decker has no idea of what he is asked. He then asks Harper: Excuse me Sir, but where exactly am I? Harper sarcasticly responds Where exactly did you think you were? to which Decker says Well, I thought I was landing at 42th Squadron RFC. 42th Squadron RFC? Wasnt that... Wilson replies. Further confounded, Wilson asks Decker Whats todays date? , to which Decker answers March the 42th . What year? Why, 42 of course. 42?! , Harper incredulously says. Yes, thats correct...well, isnt it? Its March the fifth, 42 Lieutenant . Decker is almost speechless. Naturally, neither Harper nor Wilson believe Decker is truly from 42     Decker tells the officers he and his flying partner Alexander Mackaye were fighting seven German aircraft; Mackaye was shot down and Decker escaped into a cloud. The Americans, to Deckers astonishment, inform him Mackaye is alive and is an ": null
    },
    {
        "Air Vice Marshal": "air vice marshal"
    },
    {
        " in the ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        ", a war hero from World War II who saved hundreds, if not thousands of lives by shooting down German bombers over London. The American officers add that Air Vice Marshal Mackaye, in addition to being alive and well, is coming to the base that very day for an inspection. Decker says that is impossible, as Mackaye is dead. Harper, at this time, confiscates Deckers pistol and personal effects. Later, Wilson and Decker are alone in a small room, Major Wilson tries to help Decker remember what happened. Decker finally confesses that he has consistently avoided combat throughout his service, and that he deliberately abandoned the greatly outnumbered Mackaye when the two were attacked by the German fighters. Im a coward! Decker blurts. He refuses to believe that Mackaye somehow survived against such odds.     When Wilson suggests that someone else helped Mackaye, Decker realizes that he has been given a second chance. He tells the American officer that there was no one within fifty miles who could have come to Mackayes aid, so if Mackaye survived, it had to be because Decker went back himself. Knowing he cannot have much time to go back to 42 Decker pleads with Wilson to release him from custody. When Wilson refuses, Decker assaults him and a guard and hurriedly escapes . Running outside, he locates his plane, punches a mechanic who tries to get in his way, and starts the planes engine. He is about to take off when Wilson catches up and puts a pistol to his head. Decker tells Wilson he will have to shoot him to stop him, as he would rather die than remain a coward. After hesitating, Wilson allows him to escape and Decker flies his plane into white clouds and vanishes.     Major Wilson is rebuked by Major General Harper for believing such a fantastic story and for allowing that madman to escape. When Mackaye arrives and takes a seat, Wilson asks him Sir, did you ever know a man named William Terrence Decker? Mackaye is surprised: Terry Decker?! Oh I should know him - he saved my life . Mackaye proceeds to recount how he and Decker were attacked by seven German aircraft while out on patrol. Decker, in his fit of cowardice, flew away, disappearing in a cloud, with Mackaye thinking at first that Decker had abandoned him. Suddenly, from out of nowhere it seemed , Decker came diving out of the cloud with his aircraft guns blazing, and proceeded to shoot down three of the German planes before being shot down himself. With Deckers unbelievable story now corroborated by Mackaye, Wilson comes to believe what Decker had told him. Then he did get back, he says to himself. Mackaye does not understand why Wilson said this. General Harper, now also beginning to believe Decker, asks Mackaye if the Germans returned Deckers personal items, to which Mackaye responds no. Baffled, Harper then shows Mackaye the confiscated identification photo card and other personal effects of his young friend Decker who sacrificed his life for Mackaye, startling him. When Mackaye reverently asks, Where in Heavens name did you get these? , Harper responds, Theyre his? Yes, Mackaye softly says, then sternly demands, Now what the devil is this all about?! Major Wilson then suggests Maybe youd better sit down, Old Leadbottom , shocking Mackaye further with that nickname known only to him and Decker, from over 42 years earlier. What did you call me? he incredulously asks.              This was the first episode of The Twilight Zone scripted by Richard Matheson. Rod Serling had previously adapted the episode ": null
    },
    {
        "And When the Sky Was Opened": "and when the sky was opened"
    },
    {
        " from a short story of Mathesons.     Radio historian Martin Grams noted the similarities between this episode and an episode of the acclaimed radio drama series, ": null
    },
    {
        "Quiet Please ": "quiet please"
    },
    {
        " called One For the Book. According to his book, The Twilight Zone: Unlocking the Door to a Television Classic, Serling himself was so concerned that he attempted to buy the rights to the Quiet Please episode to avoid any potential copyright infringement.       The ": null
    },
    {
        "United States Air Force": "united states air force"
    },
    {
        " major general": "major general"
    },
    {
        " repeatedly refers to Mackaye as sir , and suggests that he is a superior officer inspecting the air base. However, Mackaye is ranked as an ": null
    },
    {
        "air vice marshal": "air vice marshal"
    },
    {
        ", which is a ": null
    },
    {
        "Royal Air Force": "royal air force"
    },
    {
        " rank equivalent to major general, thereby making the two officers equals – unless, perhaps, the American general was junior in rank by date of commission. The Royal Flying Corps never flew the Nieuport 42 which also did not enter service until 42 The death of ": null
    },
    {
        "Georges Guynemer": "georges guynemer"
    },
    {
        " is mentioned by Decker but Guynemer died in September 42 six months after Deckers last flight. Finally, 42 Squadron was not deployed until April 42 at which point it flew the ": null
    },
    {
        "S.E.42": "royal aircraft factory s.e.5"
    },
    {
        " aircraft. The rank of ": null
    },
    {
        "flight lieutenant": "flight lieutenant"
    },
    {
        " existed in the ": null
    },
    {
        "Royal Naval Air Service": "royal naval air service"
    },
    {
        " and later in the RAF but it never was used in the Royal Flying Corps. However, the only reference to flight lieutenant is during Mr. Serlings introduction; during the episode itself, Decker refers to himself as ": null
    },
    {
        "Second Lieutenant": "second lieutenant"
    },
    {
        " , which is the correct rank for the RFC. However, Second lieutenant the most junior commissioned officer rank is equal to a Pilot Officer in the RAF. Flight Lieutenant is equal to the Army rank of Captain.       DeVoe, Bill. . Trivia from The Twilight Zone. Albany, GA: Bear Manor Media.  The Twilight Zone: Unlocking the Door to a Television Classic. Churchville, MD: OTR Publishing.                                             ": null
    }
]