[
    {
        "The Belgariad is a five-book ": null
    },
    {
        "fantasy": "fantasy"
    },
    {
        " epic written by ": null
    },
    {
        "David Eddings": "david eddings"
    },
    {
        ", following the journey of protagonist Garion and his companions, first to recover a sacred stone, and later to use it against antagonist Torak.         Volumes include:    Pawn of Prophecy     Queen of Sorcery     Magicians Gambit     Castle of Wizardry     Enchanters End Game      The title of each book combines a ": null
    },
    {
        "chess": "chess"
    },
    {
        " term with a fantasy term; whereas the concept of a Game of Destiny is a significant ": null
    },
    {
        "motif": "motif"
    },
    {
        " in the story. The series has been reprinted as a two-volume set, titled The Belgariad Volume One, containing the first three books of the series, and The Belgariad Volume Two, which contains the last two books. This does not include the original map by Chris Barbieri, but only Shelly Shapiros map.      The Malloreon  is a five-book ": null
    },
    {
        "sequel": "sequel"
    },
    {
        " to the Belgariad.  Belgarath the Sorcerer  and  Polgara the Sorceress  are ": null
    },
    {
        "prequel": "prequel"
    },
    {
        "s that share the setting and most characters.  The Rivan Codex  features annotated background material.                 The book opens with a ": null
    },
    {
        "prologue": "prologue"
    },
    {
        ", beginning with the creation of the world by seven ": null
    },
    {
        "god": "god"
    },
    {
        "s. Aldur, one of the seven, fashions a stone orb and creates within it a living soul . Torak, another of the seven, attempts to seize the Orb from Aldur and subdue the Orbs intelligence; the Orb mutilates the left side of Toraks body. The ": null
    },
    {
        "Orb of Aldur": "orb of aldur"
    },
    {
        " is later recovered by ": null
    },
    {
        "Belgarath": "list of the belgariad and the malloreon charactersprotagonists"
    },
    {
        " the Sorcerer, King Cherek, and Chereks sons. Riva, Chereks youngest son, is found to be able to hold the Orb unharmed; he and his descendants protect the Orb from Torak.     The story then begins in earnest with the experiences of protagonist Garion. His childhood on a large, prosperous farm: his earliest memories in the kitchen of his Aunt Pol; his friend Durnik the blacksmith; early games and friends; and the ": null
    },
    {
        "romance": "romance"
    },
    {
        " between Garion and local girl Zubrette. It also introduces Belgarath, as a wandering storyteller nicknamed Mister Wolf; Garions telepathic vision of the antagonist Asharak/Chamdar; and a dry voice in his mind, distinct from his own consciousness. The reader later discovers that this is the ": null
    },
    {
        "Voice": "human voice"
    },
    {
        " of ": null
    },
    {
        "Prophecy": "prophecy"
    },
    {
        ", or Necessity , which takes ": null
    },
    {
        "action": "action"
    },
    {
        " through him.     When Belgarath, alias Wolf , announces the ": null
    },
    {
        "theft": "theft"
    },
    {
        " of a mysterious object , he, Garion, and Aunt Pol leave Faldors farm to pursue the thief, reluctantly allowing Durnik to accompany them. They are joined later by Silk/Kheldar, a ": null
    },
    {
        "Drasnia": "list of the belgariad locationscountries and cities"
    },
    {
        "n ": null
    },
    {
        "prince": "prince"
    },
    {
        ", ": null
    },
    {
        "spy": "espionage"
    },
    {
        ", and ": null
    },
    {
        "thief": "theft"
    },
    {
        "; and by Barak, a ": null
    },
    {
        "Cherek": "list of the belgariad locationscountries and cities"
    },
    {
        " Earl": "earl"
    },
    {
        ". Thereafter Mister Wolf follows an invisible trail through several regions until they are arrested.     They are taken to a meeting of monarchs where Garion suspects a green-cloaked individual of treason. A few days later, Barak and Garion are hunting ": null
    },
    {
        "wild boar": "wild boar"
    },
    {
        " when Garion notices the green-cloaked spy discussing further ": null
    },
    {
        "espionage": "espionage"
    },
    {
        "; but before Garion can tell anyone of this, he is attacked by a wild boar, which is then slain by Barak in the form of a bear. Garion later exposes the green-cloaked spy, and the latters patrons are defeated in a fight. Garion himself is almost captured, but escapes.   Garion learns that Polgara is Belgaraths daughter and the sister of Garions second-most-distant female ancestor , and for that reason called his aunt. Having learned this, Garion identifies Belgarath as his grandfather. The group, with the addition of an Algarian prince named Hettar, then leave in search of the Orb.                    The story opens in the Kingdom of Arendia, where Garion duels and then befriends a master archer named Lelldorin. The party travel to Lelldorins uncles manor, where Garion hears about a plot to kill the Mimbrate king Korodullin and to start a civil war between the two grand duchies. The plot is masterminded by a spy from ": null
    },
    {
        "Cthol Murgos": "cthol murgos"
    },
    {
        " named Nachak. Garions friends are joined thereafter by Korodullins knight, Mandorallen.     The party continue to Vo Mimbre, the Arendish capital, where Garion reveals the plot to kill Korodullin, without naming its local conspirators, and Mandorallen challenges Nachak to a duel, which Hettar terminates by killing Nachak. The party travels to Tolnedra, to talk to the Emperor Ran Borune in the city of Tol Honeth, and are nearly captured by a group of mercenaries for the Queen of neighboring Nyissa. At Tol Honeth, Belgarath and Polgara urge the Emperor to rid Tolnedra of the invading Murgos; but Ran Borune refuses. Upon leaving the capital, the group acquire an ineffectually-disguised Princess CeNedra , and enter the Wood of the Dryads, hoping to cross into Nyissa ahead of their opponent Zedar. In the Wood, CeNedra asks the Dryad Queen Xantha for sanctuary, on grounds of common ancestry; but is refused. Splitting up on the way to the Nyissan capital of Sthiss Tor, they are detained by Tolnedran legionnaires under Grand Duke Kador of Tol Vordue, accompanied by Asharak, who demand CeNedra to ensure Kadors chances of the throne. When Asharak slaps Polgara, Garion incinerates him, and Grand Duke Kador is taken prisoner by his soldiers.     Arriving at Nyissa by boat, Garion, angry at the treatment of the slaves there, uses the Will and the Word to teleport one but does not know that the leeches in the river are poisonous so the slave dies. Following a quarrel with Polgara, Garion is kidnapped, drugged, and given as a gift to Queen Salmissra. He is rescued by Polgara and Barak ; and Polgara, with permission by Issa, the god of the Nyissans, transforms Salmissra into an immortal snake. Thereafter Garion is reconciled with Polgara.               In the third book of the series, after learning that the ": null
    },
    {
        "Angarak": "list of the belgariad and the malloreon charactersangaraks"
    },
    {
        " sorcerer Ctuchik has stolen the Orb from its erstwhile thief Zedar, ": null
    },
    {
        "Belgarion": "belgarion"
    },
    {
        " and friends go after him, via the ": null
    },
    {
        "Vale of Aldur": "vale of aldur"
    },
    {
        ". In a sacred ": null
    },
    {
        "cave": "cave"
    },
    {
        ", Garion brings a dead colt back to ": null
    },
    {
        "life": "life"
    },
    {
        ". This is of significance because ": null
    },
    {
        "Polgara": "polgara the sorceress"
    },
    {
        " and ": null
    },
    {
        "Belgarath": "characters in the belgariad and the malloreon"
    },
    {
        " maintained that before this, it was impossible to use the Will and the Word to restore life to the dead. To save time, the group passes through the haunted land of ": null
    },
    {
        "Maragor": "maragor"
    },
    {
        ", whose inhabitants were killed or enslaved when the ": null
    },
    {
        "Tolnedra": "tolnedra"
    },
    {
        "ns invaded them to obtain ": null
    },
    {
        "gold": "gold"
    },
    {
        " and whose god Mara drove every invader insane. To protect their minds, Belgarath and Polgara place their companions in a trance, during which the voice of prophecy teaches Garion of its own purpose and his control of the Will and the Word. At the center of the ruins, Mara attempts to drive CeNedra insane; but is prevented by the voice.     In the Vale of Aldur, Garion practices the Will and the Word, and learns from Belgarath. The group enters Ulgoland, and there recruit the local zealot Relg as a guide to ": null
    },
    {
        "Cthol Murgos": "cthol murgos"
    },
    {
        ". ": null
    },
    {
        "CeNedra": "characters in the belgariad and the malloreon"
    },
    {
        " is left behind as a guest of Gorim, the Ulgos supreme authority, when ": null
    },
    {
        "UL": "list of the belgariad and the malloreon charactersul"
    },
    {
        " warns them against taking her to Cthol Murgos. At Cthol Murgos itself, Belgarath fights Ctuchik until Ctuchik attempts to ": null
    },
    {
        " unmake ": "annihilation"
    },
    {
        " the Orb and thus unmakes himself. The group escapes, taking the now unconscious Belgarath, a boy later nicknamed ": null
    },
    {
        "Errand": "list of the belgariad and the malloreon characterseriond"
    },
    {
        ", who carries the Orb unharmed, and an escaped slave named Taiba, descendant of the Marags sold into ": null
    },
    {
        "slavery": "slavery"
    },
    {
        ".                  The role of leader is thrust upon Garion when ": null
    },
    {
        "Belgarath": "characters in the belgariad and the malloreon"
    },
    {
        " and Polgara are incapacitated: the former by his battle with Ctuchik and the latter by protecting Errand. Garion thereafter incapacitates the Hierarchs of Rak Cthol in retaliation for an attack upon Durnik. With Errand continuously trying to give the Orb of Aldur to one of the company , they return to Ulgo for CeNedra and eventually reach the Isle of the Winds, the object of their journey.     There, ": null
    },
    {
        "Belgarion": "belgarion"
    },
    {
        " is led by Belgarath, Polgara, and the Voice of Prophecy to accept the Orb of Aldur from Errand in the Hall of the Rivan King, where the ancient Sword rests above the Rivan Throne. In Garions hands, the Orb identifies him as the long-lost heir to the throne. This revelation infuriates ": null
    },
    {
        "CeNedra": "characters in the belgariad and the malloreon"
    },
    {
        ", who discovers herself betrothed to him. During the investiture, Garion, aided by the Voice of Prophecy, sees each member of the quest as an Instrument of Prophecy.     Shortly after the betrothal, Garion learns from the ": null
    },
    {
        "Mrin": "mrin codex"
    },
    {
        " Prophecy that the Rivan King must slay the ": null
    },
    {
        "god": "god"
    },
    {
        " Torak or die in the process. ": null
    },
    {
        "Belgarion": "belgarion"
    },
    {
        ", ": null
    },
    {
        "Belgarath": "characters in the belgariad and the malloreon"
    },
    {
        ", and Silk therefore set out to challenge ": null
    },
    {
        "Torak": "list of the belgariad and the malloreon characterstorak"
    },
    {
        ", leaving only a note to Polgara and ": null
    },
    {
        "CeNedra": "characters in the belgariad and the malloreon"
    },
    {
        " with instructions not to pursue them; whereupon Polgara enters a rage, which devastates her apartment and causes a thunderstorm overhead. Having learnt the reason of Belgarions departure, CeNedra raises an international army to distract the Angaraks from Garions quest so that he may reach ": null
    },
    {
        "Cthol Mishrak": "cthol mishrak"
    },
    {
        " safely and overcome Torak.                    The final book of the series starts with ": null
    },
    {
        "Belgarion": "belgarion"
    },
    {
        ", Silk, and Belgarath sneaking through ": null
    },
    {
        "Gar og Nadrak": "gar og nadrak"
    },
    {
        ", whence they cross into ": null
    },
    {
        "Mallorea": "mallorea"
    },
    {
        ". Garion is tempted by Torak to accept him as a father and Polgara as his mother, but rejects this offer and reaches ": null
    },
    {
        "Cthol Mishrak": "cthol mishrak"
    },
    {
        " unchallenged.     Despite a victory at Thull Mardu and the death of Taur Urgas, King of the Murgos, ": null
    },
    {
        "CeNedra": "characters in the belgariad and the malloreon"
    },
    {
        ", ": null
    },
    {
        "Polgara": "polgara the sorceress"
    },
    {
        ", ": null
    },
    {
        "Durnik": "durnik"
    },
    {
        ", and ": null
    },
    {
        "Errand": "list of the belgariad and the malloreon characterseriond"
    },
    {
        " are captured by the emperor Zakath, who gives them to ": null
    },
    {
        "Zedar": "zedar"
    },
    {
        ". En route Polgara reveals that the Mallorean Prophecies identify her as Toraks fiancée, and that her resistance to Toraks call may decide Belgarions duel. Zedar takes his prisoners to Toraks chamber, where Zedar kills Durnik, enraging Belgarath, who buries him alive. Torak attempts to sway Polgara; but Garion sends images of Durnik into her mind, thereby helping her to withstand Toraks call. A final battle ensues, during which Garion and Torak swell into immensity, and in which Garion, having mentally rejected Torak again, kills him outright. The other gods confiscate Toraks body, and UL, the father of the gods, agrees to allow Garion to revive Durnik; Mara objects, but relents when Belgarath reveals the existence of Taiba.     Upon the companys return to ": null
    },
    {
        "Riva": "riva"
    },
    {
        ", Garion and CeNedra plan their wedding, while Polgara and Durnik are married in a private chapel in the Citadel. Here, Durnik reveals that he received the Will and the Word when he was brought back to life, and that Belgarath had been training him to control the will and the word . CeNedra and Garion are married, dance with everyone, and retire to their chambers. The story ends with a half-drunk Belgarath having a conversation with the Orb, while Garion and CeNedra consummate their marriage.     ": null
    }
]