[
    {
        "           The Hamptons, part of the ": null
    },
    {
        "East End": "east end"
    },
    {
        " of ": null
    },
    {
        "Long Island": "long island"
    },
    {
        ", comprise a group of villages and ": null
    },
    {
        "hamlets": "hamlet"
    },
    {
        " in the ": null
    },
    {
        "towns": "town"
    },
    {
        " of ": null
    },
    {
        "Southampton": "southampton , new york"
    },
    {
        " and ": null
    },
    {
        "East Hampton": "east hampton , new york"
    },
    {
        ", which together form the ": null
    },
    {
        "South Fork": "south fork, suffolk county, new york"
    },
    {
        " of Long Island, in ": null
    },
    {
        "Suffolk County, New York": "suffolk county, new york"
    },
    {
        ". The Hamptons form a popular ": null
    },
    {
        "seaside resort": "seaside resort"
    },
    {
        " and one of the historical summer colonies of the ": null
    },
    {
        "northeastern United States": "northeastern united states"
    },
    {
        ".     The ": null
    },
    {
        "Montauk Branch": "montauk branch"
    },
    {
        " of the ": null
    },
    {
        "Long Island Rail Road": "long island rail road"
    },
    {
        ", the ": null
    },
    {
        "Montauk Highway": "montauk highway"
    },
    {
        ", and private bus services connect the Hamptons to the rest of Long Island and to New York City, while ferries provide connections to ": null
    },
    {
        "Shelter Island, New York": "shelter island , new york"
    },
    {
        " and Connecticut.     ": null
    },
    {
        "Stony Brook Universitys Southampton campus": "stony brook southampton"
    },
    {
        " is located in the Hamptons.            The Hamptons include the following ": null
    },
    {
        "hamlets and villages": "political subdivisions of new york state"
    },
    {
        " in the town of ": null
    },
    {
        "Southampton": "southampton , new york"
    },
    {
        ":     ": null
    },
    {
        "Eastport": "eastport, new york"
    },
    {
        "   Speonk": "speonk, new york"
    },
    {
        "   Remsenburg": "remsenburg, new york"
    },
    {
        "   Westhampton": "westhampton, new york"
    },
    {
        "   West Hampton Dunes": "west hampton dunes, new york"
    },
    {
        "   Westhampton Beach": "westhampton beach, new york"
    },
    {
        "   Quogue": "quogue, new york"
    },
    {
        "   East Quogue": "east quogue, new york"
    },
    {
        "   Hampton Bays": "hampton bays, new york"
    },
    {
        "   Places of Interest: Shinnecock Bay   ": null
    },
    {
        "Shinnecock Hills": "shinnecock hills, new york"
    },
    {
        "   North Sea": "north sea, new york"
    },
    {
        " Southampton": "southampton , new york"
    },
    {
        "   Water Mill": "water mill, new york"
    },
    {
        " Bridgehampton": "bridgehampton, new york"
    },
    {
        " Sagaponack": "sagaponack, new york"
    },
    {
        "   Sag Harbor": "sag harbor, new york"
    },
    {
        "     The Hamptons include the following hamlets and villages in the town of ": null
    },
    {
        "East Hampton": "east hampton , new york"
    },
    {
        ":   ": null
    },
    {
        "Sag Harbor": "sag harbor, new york"
    },
    {
        "   Wainscott": "wainscott, new york"
    },
    {
        " East Hampton": "east hampton , new york"
    },
    {
        "   Northwest Harbor   ": null
    },
    {
        "Springs": "springs, new york"
    },
    {
        " Amagansett": "amagansett, new york"
    },
    {
        "     The ": null
    },
    {
        "Shinnecock Reservation": "shinnecock reservation"
    },
    {
        " of the ": null
    },
    {
        "Shinnecock Indian Nation": "shinnecock indian nation"
    },
    {
        " lies within the borders of the Town of Southampton, adjoining Shinnecock Hills and the Village of Southampton.       These areas constitute the core vacation area of the east end of Long Island.            The Hamptons are home to many communities. Historically, it has been devoted to agriculture and fishing. Many farms are still in operation in the area. There are three commercial vineyards operating in the Hamptons as well.     Given the areas geographic location, it maintained stronger commercial and social links to New England and the nearby states of Connecticut and Rhode Island. Many of the original settlers were from and most of the trade links were with communities in Connecticut. Indeed, much of the older architecture and aesthetics of the villages in the Hamptons resemble New England. This is especially true for Sag Harbor Village and East Hampton Village.     Once direct rail links to New York City were established, the community of summer vacation residents  expanded significantly. The Village of Southampton, which is the oldest of the Hamptons and the most westward of the villages in the core area of the Hamptons, grew rapidly. It remains the largest and most diverse of the Hamptons towns. The other villages and hamlets grew at a slower rate over time.     The agriculture community became supplemented by artisans and professionals , and then by a large influx of artists. As a result, the arts community in the Hamptons has origins extending back to the nineteenth century.   The Art Village in Southampton and the community of Springs in East Hampton town hosted a number of resident artists and art schools .         The villages and the hamlets are distinguished by their significant population increases during the summers, although the Hamptons have increasingly become a year-round destinations for New Yorkers seeking a refuge on weekends.     Residential real estate prices in the Hamptons rank among the highest in the US,  and, as of 42 the real estate market was very strong with prices rising for both home buyers and sellers and rentals. Historically, real estate south of Route 42 , the main transportation artery in the Hamptons, was more highly valued. Land south of Route 42 is closer to the ocean, and the road served as a marker for social standing and land valuation.     The most expensive neighborhoods lie south of the highway, and most of all in the so-called Estate Areas of Southampton Village, Water Mill, Bridgehampton, Sagaponack and East Hampton Village.  Notable streets include Ox Pasture Road, Halsey Neck Lane, Coopers Neck Lane and First Neck Lane in Southampton Village and Lee Avenue and West End Road in East Hampton Village. Oceanfront property commands a high premium over other real estate. The oceanfront streets in Southampton Village and East Hampton Village rank among the most expensive roads in the country. Meadow Lane in Southampton Village is sometimes referred to as Billionaires Lane .        ": null
    },
    {
        "Sagaponack": "sagaponack, new york"
    },
    {
        ", ": null
    },
    {
        "Water Mill": "water mill, new york"
    },
    {
        ", and ": null
    },
    {
        "Bridgehampton": "bridgehampton"
    },
    {
        " were cited by  Business Week  magazine as being the first, sixth, and eighth most expensive ZIP codes in the nation, respectively.  article by Venessa Wong in Bloomberg Business Week January 42 42 In 42 according to  Business Insider , the 42 ZIP code encompassing Sagaponack, within ": null
    },
    {
        "Southampton": "southampton, new york"
    },
    {
        ", was listed as the most expensive in the U.S., by real estate-listings site Property Shark, with a median home sale price of $42,42  Accessed July 42 42 In 42 according to  Business Insider , the 42 ": null
    },
    {
        "ZIP code": "zip code"
    },
    {
        " encompassing Sagaponack, within Southampton, was listed as the most expensive in the U.S., with a median home sale price of $42 million.      Amenities in the area include the Southampton Arts Center, the Southampton Cultural Center, the ": null
    },
    {
        "Pollock-Krasner House and Study Center": "pollock-krasner house and study center"
    },
    {
        " in East Hampton; the ": null
    },
    {
        "Parrish Art Museum": "parrish art museum"
    },
    {
        " and the Watermill Center  in Water Mill; the Guild Hall, a museum and theater, in East Hampton . In the sporting world, the regions golf courses are very highly regarded. The private golf clubs in Southampton are among the most exclusive and expensive in the nation. Those courses include the ": null
    },
    {
        "National Golf Links of America": "national golf links of america"
    },
    {
        ", the ": null
    },
    {
        "Shinnecock Hills Golf Club": "shinnecock hills golf club"
    },
    {
        " and the ": null
    },
    {
        "Sebonack Golf Club": "sebonack golf club"
    },
    {
        ". These golf clubs are currently ranked 42th, 42th and 42st within the United States by Golf Digest. There is also the ": null
    },
    {
        "Maidstone Club": "maidstone club"
    },
    {
        " in East Hampton .     Other private clubs include The Bathing Corporation of Southampton, the ": null
    },
    {
        "Southampton Bath and Tennis Club": "southampton bath and tennis club"
    },
    {
        ", and the Meadow Club in Southampton Village and the Maidstone Club  in East Hampton.        The Hamptons history as a dwelling place for the ": null
    },
    {
        "wealthy": "social register"
    },
    {
        " dates from the late nineteenth century when the community changed from a farming community with good potato ground to a popular destination. In 42  The New York Times  wrote:     As of 42 commercial and point residential development has been ongoing, and the Hamptons continued to be a vacation spot for the wealthy.  The Hamptons have also become a notable place for prominent members of the ": null
    },
    {
        "LGBT community": "lgbt culture in new york city"
    },
    {
        ".        The Hamptons are connected to New York City and the rest of Long Island by a series of roadways , rail service, and bus service. There are also several small airports throughout the Hamptons which offer both private and commercial service on small aircraft and helicopters. The ": null
    },
    {
        "Long Island Rail Road": "long island rail road"
    },
    {
        " provides limited rail service seven days per week via the ": null
    },
    {
        "Montauk Branch": "montauk branch"
    },
    {
        " connecting towns and hamlets in the Hamptons to Montauk and New York City. ": null
    },
    {
        "Hampton Jitney": "hampton jitney"
    },
    {
        " and ": null
    },
    {
        "Hampton Luxury Liner": "hampton luxury liner"
    },
    {
        " coach bus services provide slightly more frequent passenger travel between New York City and the Hamptons, especially during summer months. Local Suffolk County buses also provide service to neighboring areas.       The Hamptons and Hamptons society are occasionally featured on-screen and mentioned in films and television:       In the 42 documentary,  Grey Gardens , at the ramshackle house belonging to two faded socialites: ": null
    },
    {
        "Edith Ewing Bouvier Beale": "edith ewing bouvier beale"
    },
    {
        " and her daughter ": null
    },
    {
        "Edith Bouvier Beale": "edith bouvier beale"
    },
    {
        "   The majority of the 42 film  Weekend at Bernies  takes place in The Hamptons but it was filmed on Bald Head Island in North Carolina.   In the 42 film  Somethings Gotta Give , the main character resides in a beach house on Meadow Lane in Southampton Village.   In the 42 film  Eternal Sunshine of the Spotless Mind , the two main characters meet on a train from Montauk.   The majority of the 42 film  White Chicks  takes place in The Hamptons.   In  Inside Job , a 42 ": null
    },
    {
        "documentary film": "documentary film"
    },
    {
        " about the ": null
    },
    {
        "financial crisis of 42–42": "financial crisis of 2007–2010"
    },
    {
        " directed by ": null
    },
    {
        "Charles H. Ferguson": "charles h. ferguson"
    },
    {
        ", the Hamptons is depicted as a hub for ": null
    },
    {
        "Wall Street": "wall street"
    },
    {
        " traders": "trader"
    },
    {
        " and ": null
    },
    {
        "investment bankers": "investment banking"
    },
    {
        ". The film covers a ": null
    },
    {
        "birds eye view": "birds eye view"
    },
    {
        " of the beaches and homes in the area.    The 42 film ": null
    },
    {
        "Something Borrowed": "something borrowed"
    },
    {
        " takes place in the Hamptons.       In  Friends , the finale of season 42  takes place at a beach house in Montauk when Phoebe goes there in search of her birth mother.    The Pruitts of Southampton  was a television series that ran from 4242 starring  Phyllis Diller . The sitcom was based on a wealthy family that had lost all its money and had to rent rooms to eccentric boarders to make a living.   In  Seinfeld , an ": null
    },
    {
        "episode": "the hamptons"
    },
    {
        " from Season 42 featured ": null
    },
    {
        "Jerry Seinfeld": "jerry seinfeld"
    },
    {
        ", ": null
    },
    {
        "Elaine Benes": "elaine benes"
    },
    {
        ", ": null
    },
    {
        "George Costanza": "george costanza"
    },
    {
        ", and ": null
    },
    {
        "Cosmo Kramer": "cosmo kramer"
    },
    {
        " visiting the Hamptons where various antics occur . In a season 42 episode ": null
    },
    {
        "The Wizard": "the wizard"
    },
    {
        " , George has an imaginary place in the Hamptons that he takes the parents of his deceased fiancee Susan Ross to in an impromptu game of chicken .   Numerous episodes of  The Real Housewives of New York City  are filmed in and around the Hamptons, where the cast members participate in the East End social life and charitable events   and several cast members own eastern Long Island homes, e.g., ": null
    },
    {
        "Cindy Barshop": "the real housewives of new york citycindy barshop"
    },
    {
        ", ": null
    },
    {
        "Kelly Killoren Bensimon": "kelly killoren bensimon"
    },
    {
        ",  ": null
    },
    {
        "LuAnn de Lesseps": "luann de lesseps"
    },
    {
        ", ": null
    },
    {
        "Ramona Singer": "the real housewives of new york cityramona singer"
    },
    {
        ", and ": null
    },
    {
        "Jill Zarin": "the real housewives of new york cityjill zarin"
    },
    {
        ".    The popular ": null
    },
    {
        "food network": "food network"
    },
    {
        " program  Barefoot Contessa  is set primarily in the Hamptons and features local ingredients and recipes, usually centered on host ": null
    },
    {
        "Ina Garten": "ina garten"
    },
    {
        "s social calendar.   In the show  Louie , comedian ": null
    },
    {
        "Louie CK": "louie ck"
    },
    {
        " performs a stand up comedy set at a private charity function in the Hamptons with comedian ": null
    },
    {
        "Jerry Seinfeld": "jerry seinfeld"
    },
    {
        ".    Reality stars ": null
    },
    {
        "Khloé Kardashian": "khloé kardashian"
    },
    {
        ", ": null
    },
    {
        "Kourtney Kardashian": "kourtney kardashian"
    },
    {
        " and ": null
    },
    {
        "Scott Disick": "kourtney kardashianpersonal life"
    },
    {
        " are the main cast of the show  Kourtney and Khloé take The Hamptons , that begun airing in November 42 The show is based on the family spending the summer at a house in The Hamptons, and features guest appearances from other members of the famous family.    The series  Royal Pains  takes place in the Hamptons, although most of the series is filmed in surrounding towns and portions of Long Island.   The series  Revenge  takes place in the Hamptons, though it is primarily filmed in North Carolina and Los Angeles.    Gossip Girl  was set in The Hamptons during the first two episodes of season 42 while the characters are away from New York City for summer vacation.   The series  Castle  has taken place in the Hamptons on three occasions, the first in the shows fifth season. The second was at the end of the shows sixth season. The third and most recent trip to the Hamptons for the show was in the shows seventh season.   Much of the final season of the series  How I Met Your Mother  takes place in a fictional hamlet in the Hamptons called Farhampton .   In the  Jessie  episode Caught Purple-Handed, the Ross family is confirmed to have a house in the Hamptons. It was also mentioned by Bertram that Jessie Prescott has been banned from the Hamptons ever since she fell asleep on ": null
    },
    {
        "Channing Tatum": "channing tatum"
    },
    {
        "s front lawn....twice.   On the Showtime cable network show  Billions , the lead character, a ": null
    },
    {
        "hedge fund": "hedge fund"
    },
    {
        " billionaire, purchases a large oceanfront home on Meadow Lane, in Southampton and brings more negative attention to the lavish lifestyle he lives.   On the Showtime cable network series  The Affair , the lead characters Alison Lockhart and Noah Solloway meet in ": null
    },
    {
        "Montauk": "montauk, new york"
    },
    {
        ", where much of the first season of the series takes place. Alison is a Montauk native.       In ": null
    },
    {
        "basketball": "basketball"
    },
    {
        ", an iteration of the ": null
    },
    {
        "Golden State Warriors": "golden state warriors"
    },
    {
        " so-called ": null
    },
    {
        "Death Lineup": "death lineup"
    },
    {
        " , consisting of ": null
    },
    {
        "Stephen Curry": "stephen curry"
    },
    {
        ", ": null
    },
    {
        "Kevin Durant": "kevin durant"
    },
    {
        ", ": null
    },
    {
        "Draymond Green": "draymond green"
    },
    {
        ", ": null
    },
    {
        "Andre Iguodala": "andre iguodala"
    },
    {
        ", and ": null
    },
    {
        "Klay Thompson": "klay thompson"
    },
    {
        ", is more often called the Hamptons Five . The term was coined by ": null
    },
    {
        "San Francisco Bay Area": "san francisco bay area"
    },
    {
        " journalist ": null
    },
    {
        "Tim Kawakami": "tim kawakami"
    },
    {
        " in the 42 NBA offseason after the Warriors signed Durant out of free agency. This played off the fact that the other four named players, all part of the original Death Lineup , traveled with team officials to The Hamptons to meet with and recruit Durant.      The Callahans Crosstime Saloon book series revolves around a fictional bar located on Long Island adjacent to U.S. 42     The main character of ": null
    },
    {
        "Kurt Vonnegut Jr.s": "kurt vonnegut"
    },
    {
        "  Bluebeard ,": null
    }
]