[
    {
        "     The Parallax View is a 42 American ": null
    },
    {
        "political thriller film": "political thriller"
    },
    {
        " produced and directed by ": null
    },
    {
        "Alan J. Pakula": "alan j. pakula"
    },
    {
        ", and starring ": null
    },
    {
        "Warren Beatty": "warren beatty"
    },
    {
        ", ": null
    },
    {
        "Hume Cronyn": "hume cronyn"
    },
    {
        ", ": null
    },
    {
        "William Daniels": "william daniels"
    },
    {
        " and ": null
    },
    {
        "Paula Prentiss": "paula prentiss"
    },
    {
        ". The screenplay by ": null
    },
    {
        "David Giler": "david giler"
    },
    {
        " and ": null
    },
    {
        "Lorenzo Semple Jr.": "lorenzo semple jr."
    },
    {
        " was based on the 42 novel by ": null
    },
    {
        "Loren Singer": "loren singer"
    },
    {
        ". ": null
    },
    {
        "Robert Towne": "robert towne"
    },
    {
        " did an uncredited rewrite. The story concerns a reporters investigation into a secretive organization, the Parallax Corporation, whose primary focus is political assassination.     The Parallax View is the second installment of Pakulas Political Paranoia trilogy, along with  Klute  and  All the Presidents Men  . In addition to being the only film in the trilogy not to be distributed by Warner Bros. Pictures, The Parallax View is also the only one of the three not to be nominated for an Academy Award.       TV newswoman Lee Carter witnesses the assassination of presidential candidate Charles Carroll atop ": null
    },
    {
        "Seattle": "seattle"
    },
    {
        "s ": null
    },
    {
        "Space Needle": "space needle"
    },
    {
        ". A waiter armed with a revolver is pursued and falls to his death while a second waiter, also armed, leaves the scene unnoticed. A ": null
    },
    {
        "congressional committee": "select or special committee"
    },
    {
        " decides that the killing was the work of the dead waiter but conspiracy theories subsequently arise. Three years later, Carter visits her former boyfriend and colleague, newspaper reporter Joe Frady, claiming that others must have been behind the assassination as six of the witnesses to the killing have since died and she fears she will be next. Frady does not take her seriously. Carter is soon found dead in what is officially ruled as a massive drug overdose coupled with a DUI.     Guilty over disregarding Carters pleas for her safety, Frady goes to the small town of Salmontail to probe into the recent death of Judge Arthur Bridges, also a witness. An apparently spontaneous bar fight with the Salmontail sheriffs deputy draws the attention of the sheriff himself, L.D. Wicker, who offers to take Frady to the spot where Bridges drowned. When they arrive at the dam, however, Wicker pulls his gun on Frady while the floodgates are opening, plotting to have him drown the same way Bridges did. Frady whips Wicker with his fishing rod, and they tussle in the rapids. Frady manages to make it to the shore, while Wicker drowns. Frady commandeers Wickers squad car, and at the sheriffs house he uncovers documents about the Parallax Corporation. The documents reveal that the organization recruits political assassins.     While Frady collects the documents, the deputy arrives at the residence, letting himself in. Frady grabs the documents and attempts to escape in Wickers squad car, with the deputy in pursuit. Frady smashes the squad car through the front of a grocery store, and escapes through the back, jumping into the back of a passing commercial vehicle.     Frady tries to convince his skeptical newspaper editor Bill Rintels that he is on to a big story, connecting the dots of witnesses of assassinations who have died, but Rintels refuses to support his efforts. Undaunted, Frady seeks out a local psychology professor -- Dr. Schwartzkoff -- who assesses the Parallax Corporations personality test taken from Wickers desk, and deems it to be likely a profiling exam to identify psychopaths.     Austin Tucker, the paranoid aide to the assassinated Carroll, agrees to meet Frady on his boat, while anxiously revealing there have been two attempts on his life since Carrolls assassination. Shortly after Tucker shows photos to Frady of a suspicious waiter who may have been involved in Carrolls shooting, a bomb explodes onboard, killing Tucker and his assistant. Frady survives by diving overboard but is believed to be dead.     Later that night, Frady slips into the newspapers offices, startling a sleeping Rintels, revealing that hes alive, despite reports that he died in the boat accident. Moreover, he informs Rintels of his belief that hes uncovered an organization that recruits assassins, and wants the public to believe he is dead so he can apply to the Parallax Corporation under an assumed identity.     Days later, Jack Younger, a Parallax official, pays him a visit to let him know that, based on his preliminary application, he is the kind of man Parallax is interested in. Younger is encouraged by Fradys aggressive act of throwing a pot against the wall that has burned his hand. Frady is accepted for training in the Parallax Corporations division of Human Engineering in ": null
    },
    {
        "Los Angeles": "los angeles"
    },
    {
        ", where he is instructed to watch a slide show that conflates positive images with negative actions.     While leaving the Parallaxs offices, Frady recognizes one of the Parallax operatives from a photo Tucker showed him, as the second waiter from Carrolls assassination. He watches the assassin retrieve a case from a car, drive to an airport, and check it as stowed baggage on a passenger jet. Frady boards the plane and notices a senator aboard, but cannot find the assassin & ndash; who is actually watching the jets takeoff from the airports roof. Frady writes a warning, that there is a bomb on board, on a napkin and slips it onto the drink service cart. The warning is found and the jet returns to Los Angeles. Passengers are evacuated moments before the bomb explodes.     Returning to his apartment, Frady is confronted by Younger about not being the man whose identity he has been using. Frady confesses that he is actually yet another man who had gotten in trouble with the police, and Younger agrees to validate this new identity. Later, at the newspaper office, Rintels listens to a secretly recorded tape of the conversation between Frady and Younger, then places it in an envelope with other such tapes. Rintels is poisoned by the senators killer and bomb planter, now disguised as a sandwich delivery man, and the tapes disappear.     Frady goes to the Parallax offices to see Younger, is told he is not there but then sees him leaving the building. He follows the operative to the ": null
    },
    {
        "dress rehearsal": "dress rehearsal"
    },
    {
        " for a political rally for Senator George Hammond and hides in the auditoriums catwalks to observe Parallax agents, who are posing as security personnel. Frady attempts to follow one of the men back to the auditorium, but finds he had been locked in the catwalk area. As Hammond drives a golf cart across the auditorium floor, an unseen sniper shoots him in the back, killing him, causing pandemonium below.     Frady realizes too late that he has been set up as a scapegoat and attempts to flee across the catwalks, but is spotted by the police who are now in the auditorium below. As Frady runs to the reopened exit door from the catwalks, a shadowy agent steps through, killing Frady with a shotgun. Six months later, the same shadowy committee that investigated Carrolls death reports that Frady, acting alone, killed Hammond out of paranoia and misguided patriotism and express the hope that the verdict will end conspiracy theories about political assassinations.        ": null
    },
    {
        "Warren Beatty": "warren beatty"
    },
    {
        " as Joseph Frady   ": null
    },
    {
        "Paula Prentiss": "paula prentiss"
    },
    {
        " as Lee Carter   ": null
    },
    {
        "Hume Cronyn": "hume cronyn"
    },
    {
        " as Bill Rintels   ": null
    },
    {
        "William Daniels": "william daniels"
    },
    {
        " as Austin Tucker   ": null
    },
    {
        "Walter McGinn": "walter mcginn"
    },
    {
        " as Jack Younger   Kelly Thorsden as Sheriff L.D. Wicker   Chuck Waters as Thomas Richard Linder   ": null
    },
    {
        "Earl Hindman": "earl hindman"
    },
    {
        " as Deputy Red   ": null
    },
    {
        "William Joyce": "william joyce"
    },
    {
        " as Senator Charles Carroll   ": null
    },
    {
        "Bill McKinney": "bill mckinney"
    },
    {
        " as Parallax Assassin   ": null
    },
    {
        "Jo Ann Harris": "jo ann harris"
    },
    {
        " as Chrissy – Fradys Girl   ": null
    },
    {
        "Doria Cook-Nelson": "doria cook-nelson"
    },
    {
        " as Gale from Salmontail   ": null
    },
    {
        "Jim Davis": "jim davis"
    },
    {
        " as Senator George Hammond   ": null
    },
    {
        "Kenneth Mars": "kenneth mars"
    },
    {
        " as Former FBI Agent Will Turner   ": null
    },
    {
        "William Jordan": "william jordan"
    },
    {
        " as Tuckers Aide   ": null
    },
    {
        "Edward Winter": "edward winter"
    },
    {
        " as Senator Jameson   ": null
    },
    {
        "Anthony Zerbe": "anthony zerbe"
    },
    {
        " Prof. Nelson Schwartzkopf   ": null
    },
    {
        "Richard Bull": "richard bull"
    },
    {
        " as Parallax Goon   ": null
    },
    {
        "Ford Rainey": "ford rainey"
    },
    {
        " as Commission Spokesman          Most of the images used in the assassin training montage were of anonymous figures or patriotic backgrounds, featuring among others ": null
    },
    {
        "Richard Nixon": "richard nixon"
    },
    {
        ", ": null
    },
    {
        "Adolf Hitler": "adolf hitler"
    },
    {
        ", ": null
    },
    {
        "Pope John XXIII": "pope john xxiii"
    },
    {
        ", and ": null
    },
    {
        "Lee Harvey Oswald": "lee harvey oswald"
    },
    {
        " . The montage also uses a drawing by ": null
    },
    {
        "Jack Kirby": "jack kirby"
    },
    {
        " of the ": null
    },
    {
        "Marvel Comics": "marvel comics"
    },
    {
        " character ": null
    },
    {
        "Thor": "thor"
    },
    {
        ".     The distinctive ": null
    },
    {
        "anamorphic": "anamorphic"
    },
    {
        " photography, with long lens, unconventional framing, and shallow focus was supervised by ": null
    },
    {
        "Gordon Willis": "gordon willis"
    },
    {
        ".      The river scene was filmed at the ": null
    },
    {
        "Gorge Dam": "skagit river hydroelectric project"
    },
    {
        ", on the ": null
    },
    {
        "Skagit River": "skagit river"
    },
    {
        " in ": null
    },
    {
        "Washington state": "washington state"
    },
    {
        ". The ": null
    },
    {
        "Space Needle": "space needle"
    },
    {
        " in ": null
    },
    {
        "Seattle, Washington": "seattle, washington"
    },
    {
        " is featured extensively in the first assassination sequence.     The airport scene was filmed at ": null
    },
    {
        "Bob Hope Airport": "bob hope airport"
    },
    {
        " in Burbank, California.        At the time of its release, The Parallax View received mixed reactions from critics. ": null
    },
    {
        "Roger Ebert": "roger ebert"
    },
    {
        " gave the film three out of four stars and wrote, The Parallax View will no doubt remind some reviewers of  Executive Action  , another movie released at about the same time that advanced a conspiracy theory of assassination. Its a better use of similar material, however, because it tries to entertain instead of staying behind to argue.  In his review for  The New York Times , ": null
    },
    {
        "Vincent Canby": "vincent canby"
    },
    {
        " wrote, Neither Mr. Pakula nor his screenwriters, David Giler and Lorenzo Semple, Jr., display the wit that ": null
    },
    {
        "Alfred Hitchcock": "alfred hitchcock"
    },
    {
        " might have used to give the tale importance transcending immediate plausibility. The moviemakers have, instead, treated their central idea so soberly that they sabotage credulity.   Time  magazines ": null
    },
    {
        "Richard Schickel": "richard schickel"
    },
    {
        " wrote, We would probably be better off rethinking—or better yet, not thinking about—the whole dismal business, if only to put an end to ugly and dramatically unsatisfying products like The Parallax View.      In 42  Entertainment Weekly  critic Chris Nashawaty wrote, The Parallax View is a mother of a thriller... and Beatty, always an underrated actor thanks to his off-screen rep as a Hollywood lothario, gives a hell of a performance in a career thats been full of them.      The motion picture won the Critics Award at the ": null
    },
    {
        "Avoriaz Film Festival": "avoriazavoriaz_fantastic_film_festival"
    },
    {
        " and was nominated for the ": null
    },
    {
        "Edgar Allan Poe Award": "edgar award"
    },
    {
        " for ": null
    },
    {
        "Best Motion Picture": "list of edgar allan poe award for best motion picture screenplay winners"
    },
    {
        ". Gordon Willis won the ": null
    },
    {
        "Award for Best Cinematography": "national society of film critics award for best cinematography"
    },
    {
        " from the ": null
    },
    {
        "National Society of Film Critics": "national society of film critics"
    },
    {
        " .     The films reception has been more positive in recent years. It currently holds a 42% Fresh score on ": null
    },
    {
        "Rotten Tomatoes": "rotten tomatoes"
    }
]