[
    {
        "The Golden Hour is a childrens novel by ": null
    },
    {
        "Maiya Williams": "maiya williams"
    },
    {
        ". It was first published in 42 and is the first of the Golden Hour ": null
    },
    {
        "time travel": "time travel"
    },
    {
        " series. It tells the story of Rowan Popplewell and his sister, Nina, who, while emotionally disturbed by the death of their mother, travel back in time to the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ".         The Golden Hour tells the story of Rowan and Ninas adventures the summer after their mothers death. Thirteen-year-old Rowans life is at an all-time low: his father has turned to ": null
    },
    {
        "drinking": "alcoholism"
    },
    {
        ", the family business is becoming a financial disaster, they have had to move from their house to a small apartment, and his musically talented ten-year-old sister Nina has become withdrawn. When his two great aunts invite Rowan and Nina to spend the summer with them in Owatannauk, ": null
    },
    {
        "Maine": "maine"
    },
    {
        ", a small town on the tip of the state, Rowan anticipates a very boring summer with the two elderly women. But when he arrives he finds strange things starting to happen: the aunts run a ": null
    },
    {
        "curio": "wiktionary:curio"
    },
    {
        " shop stocking some items so curious they even compel Nina to start speaking again.     Rowan and Nina meet two twins, Xanthe and Xavier Alexander, who tell them about an old abandoned resort that appears to be haunted. Instead, the resort turns out to be an elaborate ": null
    },
    {
        "time machine": "time travel"
    },
    {
        ". Nina seems interested in using the machine to escape her troubled life, especially when Rowan tells her about ": null
    },
    {
        "the Enlightenment": "the enlightenment"
    },
    {
        ", a period of ": null
    },
    {
        "European history": "history of europe"
    },
    {
        " when superstition and church dogma began giving way to logic and reason, art and science made tremendous strides, and truth and beauty were celebrated. When Nina disappears the next morning, the older kids rush to the resort: as they suspect, she has used the time machine. But Rowan discovers that he has told his sister the wrong dates for the Enlightenment, and instead of directing her to Enlightenment ": null
    },
    {
        "France": "france"
    },
    {
        " he has sent her into the middle of the violent ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". Rowan, Xanthe and Xavier time-travel to the French Revolution to save Nina, meeting various historical characters along the way, and Nina ends up in New York at their bakery visiting their mom.              ;Rowan Popplewell: Rowan is a young man dealing with a great amount of stress. Because of his mothers death he has had to move with his father and sister to a small apartment where he has no room of his own. Before his mother died Rowan had many friends and a decent social life, but he now loses himself in video games to forget his problems. He describes himself as having a chest like a barrel, and being the kind of boy girls do not notice.     ;Nina Popplewell: Nina is Rowans younger sister and, according to Rowan, was a firecracker, always jumping with ideas. She has wild, uncontrollable black hair which tumbles over her shoulders and face. Nina is also a musical prodigy, able since the age of three to play tunes she had heard from the radio on the piano. After her mothers death, Nina shut down . She stopped speaking and became dormant to the point of Rowan claiming that I have no sister . It is also indicated from the text that she is highly intelligent.     ;Xanthe Alexander: Xanthe is described as having many shoulder-length braids and almond-shaped eyes. It is indicated that she is highly attractive. She is intrigued by native cultures, living close to the land, but also things that are mystical, symbolic and mysterious. She is ": null
    },
    {
        "homeschooled": "homeschooled"
    }
]