[
    {
        ":For the mentalist Kreskin , see The Amazing Kreskin .     Jeron Criswell King , known by his stage-name The Amazing Criswell , was an American ": null
    },
    {
        "psychic": "psychic"
    },
    {
        " known for wildly inaccurate predictions. In person, he went by Charles Criswell King, and was sometimes credited as Jeron King Criswell.     Criswell was flamboyant, with ": null
    },
    {
        "spit curled": "kiss curl"
    },
    {
        " hair, a ": null
    },
    {
        "stentorian": "wikt:stentorian"
    },
    {
        " style of speaking, and a ": null
    },
    {
        "sequin": "sequin"
    },
    {
        "ed ": null
    },
    {
        "tuxedo": "black tie"
    },
    {
        ". He owned a ": null
    },
    {
        "coffin": "coffin"
    },
    {
        " in which he claimed to sleep. He grew up in a troubled family in ": null
    },
    {
        "Indiana": "indiana"
    },
    {
        " with relatives who owned a funeral home, and said that he became comfortable with sleeping in caskets in the storeroom. He appeared in two of ": null
    },
    {
        "Ed Woods": "ed wood"
    },
    {
        "films.       Criswell said he had once worked as a ": null
    },
    {
        "radio announcer": "radio announcer"
    },
    {
        " and news broadcaster. He began buying time on a local Los Angeles television station in the early 1950s to run ": null
    },
    {
        "infomercials": "infomercials"
    },
    {
        " for his Criswell Family Vitamins. To fill the time, he began his Criswell Predicts part of the show. This made him a minor off-beat celebrity in Los Angeles and around Hollywood, and his friendship with old show-business people such as ": null
    },
    {
        "Mae West": "mae west"
    },
    {
        " and rising fringe celebrities such as ": null
    },
    {
        "Korla Pandit": "korla pandit"
    },
    {
        " made Criswell an entertaining presence at parties. His fame brought him appearances on  The Jack Paar Show  which allowed him to publish his predictions in three publications of Spaceway Magazine , as well as run a weekly syndicated newspaper article starting on September 6, 1951. He later published three books of predictions; From Now to the Year 2000, Your Next Ten Years, and Forbidden Predictions. He also recorded a long playing record, Your Incredible Future , featuring 84 minutes of his predictions in his own voice. Criswell appeared in the movies of writer and director ": null
    },
    {
        "Ed Wood": "ed wood"
    },
    {
        ". After Criswells death, his longtime friend ": null
    },
    {
        "Paul Marco": "paul marco"
    },
    {
        " released Criswells song Someone Walked Over My Grave on a 7 record which was recorded by Criswell as a memorial song that he wanted released posthumously.              thu   Criswells predictions were nationally syndicated and he appeared on the television show Criswell Predicts on KLAC Channel 13 in Los Angeles as well as being recorded for syndication. His announcer was Bob Shields, who later played the judge on ": null
    },
    {
        "Divorce Court": "divorce court"
    },
    {
        ". Criswell wore heavy makeup in public after his live program was broadcast in Los Angeles . Only selected people were allowed in the KCOP studio during his broadcast.     Criswell wrote several books of predictions, including 1968s Criswell Predicts: From Now to the Year 2000. In it, he claimed that Denver, Colorado would be struck by a ray from space that would cause all metal to adopt the qualities of rubber , leading to horrific accidents at amusement parks. He predicted mass cannibalism and the end of planet Earth , which he set as happening on August 18, 1999.     Criswell was a student of history. He believed history repeated itself, that the United States were the modern Romans . Each day, he read the ": null
    },
    {
        "St. Louis Post-Dispatch": "st. louis post-dispatch"
    },
    {
        " looking for clues for his predictions.     Some sources claim Criswells most famous prediction was on ": null
    },
    {
        "The Jack Paar Program": "jack paarprime time"
    },
    {
        " in March 1963, when he predicted that US President John F. Kennedy would not run for reelection in 1964 because something was going to happen to him in November 1963.     Sources say that Criswell never claimed to be a real psychic; however, those who knew him, including actress and fellow Plan 9 alumna Maila Nurmi , believed he was. According to writer Charles A. Coulombe , whose family rented an apartment from him, Criswell told Coulombes father had the gift, but  ... lost it when I started taking money for it.       Criswell married a former speakeasy dancer named Halo Meadows , who once appeared on ": null
    },
    {
        "You Bet Your Life": "you bet your life"
    },
    {
        ", and whom Coulombe describes as quite mad : Mrs Criswell had a huge standard poodle which she was convinced was the reincarnation of her cousin Thomas. She spent a great deal of time sunbathing  ... which, given her size, was not too pleasing a sight.     thu     Mae West used Criswell as her personal psychic; he once predicted her rise to President of the United States , whereupon she, Criswell and George Liberace , the brother of showman Liberace , would take a rocket to the Moon. Criswell and West were great friends and she would lavish him with home-cooked food which she had delivered to the studio that he shared with Maila Nurmi . It is said that West sold Criswell her old luxury cars for five dollars.     He died in 1982 aged 75.       In 1955, Mae West wrote and recorded a song called Criswell Predicts for her album ": null
    },
    {
        "The Fabulous Mae West": "the fabulous mae west"
    },
    {
        "   In 1994, Criswell was portrayed in the Tim Burton biopic, ": null
    },
    {
        "Ed Wood": "ed wood"
    },
    {
        ", by actor Jeffrey Jones .   In 1997, several actors, including Sean Phillip Mabrey, have played Criswell in Plan 9 from Outer Space: The Musical, written by David G. Smith.   In 1999, the film Devil Girls featured a portrayal of Criswell by Rob Gorden.   In 2005, Criswell and the Plan 9 cast were lampooned in an episode of the television series, Deadly Cinema, and clips of this episode were featured in the documentary, Vampira: The Movie.   In 2006, Craig Brown played Criswell in Plan Live From Outer Space, a stage adaptation of ": null
    },
    {
        "Plan 9 from Outer Space": "plan 9 from outer space"
    },
    {
        " which won a Canadian Comedy Award the following year.   In 2009, a teaser trailer was released by Darkstone Entertainment for the John Johnson film Plan 9, a remake of Plan 9 From Outer Space. The voice of popular television horror host Mr. Lobo can be heard narrating the trailer as Criswell. He also portrayed Criswell in the film, in a much larger role in this re-imagining of the original Ed Wood story. In addition, for the purpose of promoting the film on the internet, Mr. Lobo has produced 62 episodes of Criswell Predicts! which is a parody and homage to Criswells original television program of the same name sans": null
    }
]