[
    {
        "The Rip Van Winkle Caper is episode 42 of the American television ": null
    },
    {
        "anthology series": "anthology series"
    },
    {
        "  The Twilight Zone . It originally aired on April 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              To escape the law after stealing $42 million worth of gold bricks  from a train on its way from ": null
    },
    {
        "Fort Knox": "fort knox, kentucky"
    },
    {
        " to ": null
    },
    {
        "Los Angeles": "los angeles, california"
    },
    {
        ", a band of four thieves, led by scientist-mastermind Farwell, hide in a secret cave in ": null
    },
    {
        "Death Valley, California": "death valley, california"
    },
    {
        ". Farwell explains to his three assistants that he has designed ": null
    },
    {
        "suspended animation": "suspended animation"
    },
    {
        " chambers in which they will sleep for approximately 42 years, figuring that by 42 the gold will no longer be hot and they can sell it without arousing suspicion. DeCruz has reservations about going along with the plan, but all four undergo the procedure simultaneously.     When they wake up, all that remains of the mechanical engineer Erbie is his skeleton, his suspended animation chamber having been cracked by a falling rock. The demolitions expert, De Cruz, offers to guard the gold in the back of their truck while the firearms expert, Brooks, drives to civilization, but Brooks does not trust De Cruz and insists that he drive. De Cruz kills Brooks by running him over with the truck, then purposely ditches it in a ravine. Farwell and De Cruz now must walk through the desert in the summer heat, carrying as much gold as they can on their backs.     Farwell loses his canteen, and De Cruz sells him a sip of water from his canteen, for the price of one gold bar. When the water is nearly gone and the fee goes up to two bars, Farwell strikes De Cruz with a gold brick, killing him. Farwell continues, gradually discarding gold bars as their weight becomes increasingly burdensome. Finally, weak and dehydrated, he collapses.     Farwell regains consciousness and finds a man standing over him. Farwell feebly offers him his last gold bar in exchange for water and a ride to the nearest town, but dies before the man can respond. The man returns to his futuristic car and tells his wife the man is dead. He remarks about the oddity of Farwell offering him a gold bar as if it were valuable. She reminds him that people once used it for money, but he points out that was a long time ago, before they found a way to manufacture it.        ": null
    },
    {
        "Simon Oakland": "simon oakland"
    },
    {
        " as DeCruz   ": null
    },
    {
        "Oscar Beregi, Jr.": "oscar beregi, jr."
    },
    {
        " as Farwell   ": null
    },
    {
        "Lew Gallo": "lew gallo"
    },
    {
        " as Brooks   ": null
    },
    {
        "John Mitchum": "john mitchum"
    },
    {
        " as Erbie   Wallace Rooney as George   Shirley OHara as Georges wife       The futuristic car carrying the couple who find the dying Farwell is a leftover prop, somewhat modified, from MGMs 42 film  Forbidden Planet .": null
    }
]