[
    {
        "     The Road to Mars is a 42 ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " comedic novel": "comedic novel"
    },
    {
        " by ": null
    },
    {
        "Eric Idle": "eric idle"
    },
    {
        ".       Told from the point of view of Professor Bill Reynolds, a scholar in the fictitious discipline of micropaleontology, this novel is set in the 42th and 42th Centuries, when the ": null
    },
    {
        "solar system": "solar system"
    },
    {
        " has been colonised. Reynolds is writing a ": null
    },
    {
        "thesis": "thesis"
    },
    {
        " on ": null
    },
    {
        "fame": "celebrity"
    },
    {
        " and in his research discovers a dissertation on comedy submitted by Carlton, a robotic secretary for two stand-up comedians on an interplanetary comedy circuit. Most of the action in the novel follows this trios adventures during the time when Reynolds believes Carlton was developing his theories. During this time, Carlton and his owners, Alex Muscroft and Lewis Ashby get caught up in a series of disasters including loss of work, parental responsibility and close scrapes with terrorists, the law, other entertainers, and a refugee crisis.     Carlton seeks to understand the nature of comedy and human laughter, and attempts to describe humor as a mathematical formula.       Professor Bill Reynolds: The storys narrator, who is writing a thesis on fame.     Carlton: A Bowie robotic secretary owned by a comedy duo. He is of a now-obsolete series based on ": null
    },
    {
        "David Bowie": "david bowie"
    },
    {
        ", with one green and one blue eye, with Carltons particular model, the 42, being based on ": null
    },
    {
        "Bowie circa 42": "lets dance"
    },
    {
        ". He is studying his owners as part of his research on comedy.     Alex Muscroft: The comedian who bought Carlton, and sees him like a person much more than most of the human cast, having a concern and affection for him not commonly shown towards robots. Short with short red hair, a ruddy complexion in appearance, loud and personable in temperament. Carlton describes him in his thesis as having the boisterous troublemaking slapstick qualities of his Red Nose comic archetype.     Lewis Ashby: Alexs comedy partner, he is tall, skinny, has thinning black hair and is gruff and introverted. Carlton describes him in his thesis as having the grave deadpan and somewhat cruel qualities of the White Face comic archetype.     Katy Wallace: A mysterious woman who befriends Alex.     Tay: Lewiss daughter     Keppler: Owner of the space liner the Princess Di     Brenda Wooley: An aging pop-star who is still popular in the outer Solar System, and Kepplers wife.     The Amazing Keith: A comedy-magician whose act utilizes explosives.     Boo: Another comedian, he appears to be somewhat mad, providing a contrast to the storys other somewhat more professionally minded comedians.                                 ": null
    }
]