[
    {
        "The Mind and the Matter is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . It originally aired on May 42 42 on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        ".              Archibald Beechcroft has an insufferably crowded time getting to work, and becomes annoyed when errand boy Henry spills coffee all over his suit. Taking some aspirin in the washroom, his boss Mr. Rogers lectures him about a proper lifestyle to maintain his health. Aggravated, Beechcroft says hes fed up with the crowded conditions at the office and wants to eliminate all the people of the world.     In the cafeteria for lunch, Henry apologizes to Beechcroft further for spilling the coffee, saving him a seat and presenting him with a book titled The Mind and the Matter, which deals with the ultimate in concentration; Henry explains that his friend has learned how to make things happen with his mind. Beechcroft leafs through the book in the cafeteria, continues to read it on the subway ride home, and finishes it over supper in his apartment. Agreeing with the authors that concentration is the greatest power in the universe, it occurs to him that he can use it to realize his dream of eliminating people. When his landlady knocks to collect his rent, he tests the theory, and successfully makes her disappear.     The next day, Beechcroft uses his concentration to make his crowded subway station empty of people. He rides an empty subway car to the office, which is totally empty, with doors opening for him. Though he takes satisfaction in his newfound peace and quiet, he soon grows bored. Reflections of himself appear, taunting him as bored and lonely. He tries diversions such as an earthquake and thunderstorm, but isnt entertained. He glumly rides the empty subway home, where he is again taunted by his reflection. Arguing with it, he gets the idea of repopulating the world with people like himself.     He does so, and the next morning the crowds in the subway and elevator are back, but now everyone has his face and unpleasant, ": null
    },
    {
        "antisocial": "anti-social behaviour"
    },
    {
        " personality. Dismayed, he returns the world to the way it used to be. Henry again spills coffee on him, and asks about the book. Beechcroft pretends to have found the book totally unbelievable .        ": null
    },
    {
        "Shelley Berman": "shelley berman"
    },
    {
        " as Archibald Beechcroft   ": null
    },
    {
        "Jack Grinnage": "jack grinnage"
    }
]