[
    {
        "British author ": null
    },
    {
        "Peter F. Hamilton": "peter f. hamilton"
    },
    {
        "s The Nights Dawn Trilogy consists of three ": null
    },
    {
        "science fiction": "science fiction"
    },
    {
        " novels:  The Reality Dysfunction  ,  The Neutronium Alchemist  , and  The Naked God  . A collection of short stories,  A Second Chance at Eden , shares the same universe, and  The Confederation Handbook  documents that universe in non-fiction style.       In the Nights Dawn trilogy, humankind, although now united under an organization known as the Confederation, has been broken up into two major divisions, ": null
    },
    {
        "Adamist": "adamist"
    },
    {
        "s and ": null
    },
    {
        "Edenist": "edenist"
    },
    {
        "s. The economy is dominated by the Edenists, who maintain a powerful monopoly across the Confederation by harvesting ": null
    },
    {
        " 42 He ": "helium 3"
    },
    {
        " from suitable gas giants. This resource is used by all Adamist starships as a primary fuel source. The use of the only other major energy source, ": null
    },
    {
        "antimatter": "antimatter"
    },
    {
        ", is illegal due to its devastating military potential, and its possession or production is a capital crime.       Adamists are the larger of the two groups, and consider themselves to be normal humans. They allow themselves to use some genetic-engineering improvements , but do not generally condone the use of bitek in their culture. They are a vast group of people of various cultures and backgrounds, and realistically, the Adamist group encompasses any non-Edenist humans. The majority of Adamists, who are at least nominally religious, do not utilise bitek because it was banned by the Pope during the 42st century. Instead, they use ": null
    },
    {
        "nanotechnology": "nanotechnology"
    },
    {
        ", which they refer to as nanonics . Nanonics perform many of the same physiological feats as bitek, and the two technologies are relatively compatible. Adamist starships use ": null
    },
    {
        "fusion": "nuclear fusion"
    },
    {
        "-energy based drives, and much of the human economy therefore is based on the proliferation of 42 He. The ZTT  drive allows Adamists to colonize star-systems, usually settling both ": null
    },
    {
        "planet": "planet"
    },
    {
        "s and ": null
    },
    {
        "asteroid belt": "asteroid belt"
    },
    {
        "s.         ": null
    },
    {
        "Edenist": "edenist"
    },
    {
        "s are, for the most part, a single culture. They are an idealized, ": null
    },
    {
        "egalitarian": "egalitarianism"
    },
    {
        ", ": null
    },
    {
        "utopia": "utopia"
    },
    {
        "n society which, while not believing or practicing ": null
    },
    {
        "religion": "religion"
    },
    {
        ", does not prohibit it. The majority of Edenists live in huge, multi-kilometre space stations called habitats orbiting ": null
    },
    {
        "gas giant": "gas giant"
    },
    {
        "s. Each individual habitat is a living organism, fully sentient, and is the perfect arbitrator of its community. Habitats cannot be bribed, are perfect impartial judges, and are aware of almost everything that occurs within them and immediately around them. The most important aspect of any Edenist is his/her use of affinity. Affinity is an advanced form of mental communication similar to the present-day concepts of ": null
    },
    {
        "telepathy": "telepathy"
    },
    {
        " or ": null
    },
    {
        "entanglement": "quantum entanglement"
    },
    {
        ". Edenist affinity allows them to transfer their memories into the habitat at the time of death. This is regarded as a form of immortality. However, no habitat has yet died of old age and could in turn pass their memories and personality on to another habitat were they ever to die. Adamist religions reject this as an attempt to avoid Gods judgment on the soul after death, and it is this which is the root cause of the schism between the Adamist and Edenist cultures.     Edenists have access to faster-than-light travel through large, fully sentient bitek creatures called Voidhawks . They, along with their crews, make up a vast armada of Edenist merchant vessels operating throughout the Confederation as well as a large fraction of the Confederation Navy. Voidhawks are born and live in the vacuum of space. They are naturally attuned to the magnetic fields and energy fluctuations of space around them, and can generate and precisely control a distortion field to manipulate space around them. By manipulating space in this way, Voidhawks can open wormholes and jump long distances instantaneously. Such jumps are known as swallows . Another product of the distortion field is the ability to affect gravity in and near the Voidhawk. This is used to reduce the effect of high-g manoeuvering on Voidhawk crews. By using the full power of their distortion fields, Voidhawks can attain a speed and manoeuvrability unmatched by Adamist vessels .     Edenists heavily genetically modify their children, including the gene which allows affinity to develop from conception. They also use modified servitors which are often ": null
    },
    {
        "chimpanzee": "common chimpanzee"
    },
    {
        "s with affinity which carry out small tasks and leave Edenists to concentrate on more important matters. Edenists operate cloud scoops in gas giants in order to extract the rare ": null
    },
    {
        "isotope": "isotope"
    },
    {
        " helium 42": "helium 3"
    },
    {
        " which can be used for ": null
    },
    {
        "fusion": "nuclear fusion"
    },
    {
        " energy.         The story of the Nights Dawn Trilogy is separated over three books:  The Reality Dysfunction  ,  The Neutronium Alchemist  , and  The Naked God  ; but is also supported by ": null
    },
    {
        "A Second Chance at Eden": "a second chance at eden"
    },
    {
        " , a collection of short stories which provide insight into the history of Hamiltons universe.     The story is divided in many threads, based on primary, secondary and tertiary characters. These delve deeply into the rich and complex texture of the Universe providing a great sense of verisimilitude, also exploring some of Hamiltons darker themes. These story lines include Dariats struggles inside Valisk, and the Deadnights voyage to their Saviour.     In the 42th century humans have colonised nearly 42 worlds, have living, sentient starships as well as the conventional kind, and are also living in asteroid communities and in large, living space stations. Due to policies of ethnic streaming by the colonisation authorities, worlds are generally united under a single government, with these governments collectively forming a Confederation. The Confederation includes both Adamists and Edenists, two alien races , and has an armed Navy and a central house based on the world of Avon. Earth is still an important world, with a massive population, exporting a massive number of colonists , but virtually environmentally destroyed after years of technological abuse.         The Reality Dysfunction planet busters, sent from Omuta, several Garissan ships are sent to attack Omuta with a superweapon called the Alchemist. However, en route, the convoy is ambushed by Omutan-hired blackhawks, a type of living starship and variant of the voidhawk which is far more versatile in combat than its conventional opponents. After a short, furious melee the Garissan ships are damaged and/or disabled, leaving them drifting through the void of space. Dr. Alkad Mzu, the designer of the Alchemist, is among the few survivors. As the possession and/or use of antimatter is a capital crime , the ruling cabinet of Omuta are executed and their world placed under stringent sanctions for 42 years.     Syrinx, a young Edenist, is next introduced, leading life from a young age telepathically attached to a bitek starship called Oenone. As she grows she learns more about the world with her sentient starship, becoming best friends . After a mandatory stint in the armed forces, including an encounter with soon-to-be introduced Joshua Calvert in which he outsmarts her, Syrinx takes her ship and her crew into the realm of commercial shipping, becoming competitors with Calvert and his ship.     Introduced next is young would-be space captain Joshua Calvert. Joshua lives on Tranquillity, a huge, living space station, which exists in orbit around a gas giant. Thousands of years ago, the native race of Tranquillitys star mysteriously disappeared. Tranquillity was grown in order to investigate the Ruin Ring, the ruins of the unknown civilisation, which form an artificial circle around the gas giant. While exploring the Ruin Ring, Joshua finds a memory storage device. Containing huge amounts of information about the extinct aliens, the auction of the device fetches him enough money to refit his fathers starship, the  Lady MacBeth , and once again use her for commercial shipping and trade.     On the tropical world of Lalonde, the newest colony in the Confederation, a group of Involuntary Transportees Ivets from Earth is made to work while voluntary colonists set out to make a new life for themselves - some eager, some forced to come along with their families. One such girl is Marie, who wants to return home, and so hitches a ride back to the capital of Lalonde after settlement, in an attempt to return to Earth. The leader of the Ivets - the cruel, sadistic Satanist, Quinn Dexter - despite his evil nature is an apt leader. He organizes a campaign of murder in order to steal enough money to return to Earth to take revenge on the Cult Leader who put him there. His campaign accelerates until he eventually captures the local lawman, and is going to torture him. However, simultaneously an Alien entity known as the Ly-cilph, a non-corporeal race from a distant galaxy, comes into contact with the dying man. The Ly-cilph, its only purpose being to gather knowledge, is amazed when it detects a flicker of energy leaving the mans body through a spatial distortion leading to an energistic vacuum . The being unknowingly follows and finds itself trapped in a threshold between this dimension and the dimension of souls , where human souls go to after death. This results in the souls of the dead, most demented after countless aeons of imprisonment being able to return to our universe and to possess human bodies, if the owning soul gives permission - which they invariably do after sufficient torture. These newly reincarnated dead can harness superhuman powers - most notably the power to project the white fire , the ability to alter form, and the ability to open the channel to allow souls to return to possess others. Quickly the possessed overrun the new settlement, claim spaceships and leave Lalonde to spread to the Confederation at large.     Calvert, having visited Lalonde, unwittingly gives the possessed Dexter a ride to the world of Norfolk. Dexter begins to infect the Norfolk locals while Calvert begins to trade in the extremely revered Norfolk Tears , an alcoholic beverage, coming into opposition with Syrinx. Calvert begins an affair with a wealthy noblemans daughter, Louise, who falls madly in love with him. The infection starts a short-lived military campaign by the local militia, which results in the total destruction of the social system, Louise and her sister fleeing for their lives.     Dr. Alkad Mzu, for years kept virtual prisoner on Tranquillity because of her knowledge of the Alchemist and her terrorist ambitions, escapes in a breathtaking sequence including using a Blackhawk to swallow inside the habitat to aid her escape.     Syrinx travels to the world of Atlantis, a world covered by water, inhabited by floating islands which themselves are sentient. But she discovers that the possession has also begun there. In the process she is captured and tortured badly, and suffers a psychotic breakdown.     In Tranquillity the scale of the infection begins to become apparent to the Confederation, which immediately bans all non-essential travel between worlds. A team of mercenaries is assembled and ferried to Lalonde to assess the scale of the possession and its true source, assisted by Calvert.     The team discovers the small Tyrathca settlement, a race of insect-like Aliens who have suffered great losses to attacks by possessed humans, passing by a small temple being constructed even though the Tyrathca race do not have religion. Later, they stumble across a group of non-possessed children and Father Horst, a Christian priest who led them to escape the settlement, and try to protect them from the attacks by the increasingly effective possessed humans, the weapons of the mercenaries of limited use, and their numbers insufficient to fend off the attackers. In a climactic final scene as Calvert fights a space battle above, the mercenaries valiantly sacrifice themselves defending the survivors from the hordes of the possessed until they are extracted by space plane.     The Neutronium Alchemist ": null
    },
    {
        "Al Capone": "al capone"
    },
    {
        " on New California, Keira Salter on Valisk and Quinn Dexter as he travels from world to world, until finally reaching Earth.     Calvert and his group is tasked with finding Dr Mzu, who is believed to be searching for her doomsday weapon to complete her dream of slaying the Omutan people. The search takes her to the Disk-system which is now inhabited by the survivors of the Garissan genocide, and finally to an uninhabited system to find the Alchemist starship which was damaged at the beginning of the first novel. The weapon is used to destroy a gas giant world, also destroying possessed starships controlled by the Capone organization.     Syrinx is psychologically reconstructed with the help of the founder of the Edenist culture.     Louise and her sister, aided by the possesser ": null
    },
    {
        "Fletcher Christian": "fletcher christian"
    },
    {
        " find their way to Earth in search of Calvert. The possesser also reaches one of the Kulu colonies, resulting in the loss of a peninsula, which is transported by the local possessers into another dimension .     The Naked God ": null
    },
    {
        "quantum singularity": "quantum singularity"
    },
    {
        ". This singularity has untold knowledge and power, and talks with Calvert for some time, able to transplant its consciousness across time and space, to Earth and Louise, and to the point at which the possession began. Bestowed with the gods power Calvert is able to exorcise the infected across the Confederation through the use of a specially configured wormhole that consumes the entire confederation and all its inhabited worlds and habitats and transports them into a remote area outside of the Milky Way Galaxy while also de-possessing all people who had been possessed, also Calvert is able to receive a unique viewpoint of the whole story from the start of the possession right up to the point where his fiancé Louise is about to stand alone against the evil Quinn Dexter.     When order starts to return to the Confederation and Joshua Calvert is questioned as to why he moved the human race to such an isolated space he justified himself by saying that this will allow humanity to avert another reality dysfunction as this isolation will force itself to look inwards and re-evaluate itself as a whole.       Samual Aleksandrovich - The commanding officer of the Confederation Navy, Admiral Aleksandrovich is in command of the military response to the possession crisis. A realist, he understands that military force is fundamentally unable to deal with such a problem, as a decisive military defeat of the Possessed would be tantamount to annihilating a large portion of the human race. He is reluctant to agree to support the attempt to reclaim Ombey from the possessed for this reason, but agrees to the mission because he recognises the political necessity of securing a victory against the possessed for the purposes of public morale.   Joshua Calvert - Captain of the starship Lady Macbeth, Joshua Calvert is one of the main protagonists of the story. Like his late father Marcus, he is an amoral lothario with a pathological need to sleep with and then abandon vulnerable young girls, who are attracted to him due to his status. He has an incredible and inexplicable intuition. Captain Calvert, along with Captain Syrinx and others is one of those directly responsible for ending the possession crisis.   Liol Calvert - Estranged older half-brother to Joshua Calvert, Liol seeks to take Joshuas ship, the Lady MacBeth, which he believes is rightfully his. He eventually comes to understand that Joshua is the better captain after flying with him on the mission to the Sleeping God.   Al Capone - One of several well-known historical figures to return from the Beyond, ": null
    },
    {
        "Al Capone": "al capone"
    },
    {
        " constructed an organisation which quickly gained control of New California. He attempted to spread to several other planets, with varying degrees of success. Capones Organisation was most notable because he tried to force both the possessed and non-possessed to continue to work together. His tactics in expanding his sphere of control were noted by the whole of the confederation. His use of Kieras Hellhawks allowed the continued security of his stronghold for the majority of his power.   Kiera Salter - Marie Skibbows possessor, and the leader of the Deadnight cult as well as the Hellhawks used by Capone.   Dariat - A descendant of Rubra, Dariat despises his ancestor for trying to manipulate him through affinity in order to turn him into the perfect heir. When the possessed arrive on the Valisk habitat, Dariat commits suicide in order to join their ranks. Eventually he becomes disenchanted with the possessed, and gradually joins forces with Rubra to work against them.   Quinn Dexter - One of the major antagonists and primary villains, Quinn Dexter is a man wholly lacking in redeeming qualities. A dedicated ": null
    },
    {
        "Satanist": "satanist"
    },
    {
        ", he takes great pleasure in inflicting physical and emotional pain on others, and considers torture, rape, murder and brainwashing to be perfectly acceptable hobbies. He is the first person to become possessed by a soul from the Beyond.   André Duchamp - A French trader, Captain of the Villeneuves Revenge . Duchamp is an amoral character who will perform more or less any task for the right price. His less savoury actions included piracy, trading in antimatter technology, and working for Capones Organisation to defend New California. He nearly dies in an antimatter explosion near Trafalgar asteroid set off by Kingsley Pryor, a non-Possessed coerced working for Capone. He is later sent off to a penal planet.   Ashly Hanson - A member of Joshua Calverts crew, Ashly is the pilot of the Lady MacBeths shuttlecraft. Although he was 42 years old at the time of the first book, he was actually born prior to 42 Born to reasonable wealth he had signed his trust fund over to a bank in return for the long-term use of a zero-tau stasis pod. Ashly subsequently alternated fifty years in stasis and five years travelling the Confederation.   Ralph Hiltch - The head of station for the ESA on Lalonde. Ralph battled the return of the possessed almost from the very beginning of the first outbreak. After evacuating Lalonde he travelled to Ombey and fought the infiltration there. He was unsuccessful in preventing the possessed from gaining a foothold on the planet, but became grimly determined to defeat them. To that end he convinced both the Kulu Kingdom and the Edenists to join forces in building a massive army to take on the possessed on Ombey. As a direct result he was promoted from Lieutenant to General and appointed commander of the liberation effort.   Louise Kavanagh - A naive young girl, the daughter of Grant Kavanagh, Louise grew up in the Cricklade Estate on Norfolk, largely ignorant of the rest of the Confederation. She slept with Joshua Calvert when he stayed at the estate, and became both pregnant by him and infatuated with him. When the possessed took over Norfolk she managed to escape and make her way to Earth along with her sister Genevieve and Fletcher Christian, one of the possessed. Louise eventually reunited with Joshua, and he abandoned his previous life to live with her.   Genevieve Kavanagh - The younger daughter of the Kavanagh estate. She is seen by almost everyone she meets to be extremely irritating, obnoxious and vindictive. She escaped from Norfolk her home planet during its possession with her sister.   Laton - An Edenist serpent, Laton was one of the greatest criminals known to his culture. Self-confident to the point of arrogance, he was a leading expert in biotechnology. He sought to develop a process whereby he could use affinity to spread his consciousness throughout multiple bodies and so become effectively immortal. When he was discovered Laton covered his escape by releasing a lethal virus into his habitats brain, which, coupled with a simultaneous antimatter attack, destroyed the habitat and killed hundreds of thousands of Edenists. Laton went into hiding on Lalonde, where he remained until discovered by Quinn Dexter. He attempted to frame Dexter and his group for the murder of a child, leading ultimately to Quinns possession. Laton was himself possessed, but managed to gain the upper hand over his possessor. He subsequently committed suicide to halt the spread of the possessed on Atlantis, an Edenist planet.   Dr. Alkad Mzu - A resident of the planet Garissa, Mzu developed a super-weapon known as the Alchemist which was capable of making a star go nova or turning it into a black hole of the suns original mass. Whilst attempting to deploy the weapon during a war with the planet Omuta, Mzus ship was disabled by an Omutan attack. The surface of her planet was subsequently wrecked by 42 high-yield antimatter planet-buster bombs which killed the entire population. Mzu ended up in the Tranquillity habitat; she agreed to remain there under observation by various intelligence agencies so that the secret of the Alchemist would not become generally available. During the course of the trilogy Mzu escapes Tranquillity and attempts to retrieve the weapon so that it can be used on Omuta; instead she helps Joshua Calvert use the device to ignite a gas giant so as to facilitate their escape from ships under the control of the possessed.   Rubra - An Edenist serpent, Rubra germinated the Valisk habitat. He retro-engineered the Voidhawk genome and manipulated it to create the first Blackhawks. Using Valisk as a Blackhawk base for trade and transportation, as well as smuggling and mercenary activities, made Rubra extremely rich. After death Rubra transferred his memories and personality into Valisks neural strata, as was common for Edenists. He used affinity to try to manipulate his descendants into near identical copies of himself so that they would be worthy heirs. Each attempt was a failure in Rubras eyes, and he became exceedingly bitter as his financial empire disintegrated. Although Rubra wasnt a sympathetic and nice personality, he did help the people of Valisk through their possession.   Ione Saldana - known as The Lord of Ruin , Ione is the granddaughter of Michael Saldana, once the Crown Prince of the Saldana Royal Family and creator of the Tranquillity habitat. The Saldanas had been staunch defenders of the Adamist culture for centuries, and Michaels betrayal caused a considerable scandal which led to the exile of himself and all of his descendants. Ione is the absolute ruler of Tranquillity, with complete dictatorial power over every aspect of life. She kept her presence on the habitat secret for some years, concerned that her youth and seeming inexperience would cause a crisis of confidence amongst the economic community if she revealed herself. Joshua Calvert is one of Iones lovers and the father of her children.   Gerald Skibbow - A colonist on Lalonde, Gerald was one of the first people in the Confederation to be possessed. He was captured and placed into zero tau for return to civilisation; the time in the pod forced the possessing soul to leave his body. Gerald was left deeply traumatized by his possession, and became obsessed with finding his possessed daughter Marie. He spends much of the trilogy trying to find her.   Marie Skibbow - An extremely beautiful 42-year-old woman with red hair and green eyes, Marie was deeply unhappy when her family moved to Lalonde to become colonists there. When she turned 42 she abandoned her settlement and went to work in Durringham, the capital city of the planet, to try to raise money to leave for good. She dealt with Joshua Calvert when he visited Lalonde, and was possessed shortly afterwards by the soul of Kiera Salter. Kiera left Lalonde on the Yaku. She managed to take over Rubras habitat Valisk and allied with Al Capones organisation, but was banished from Maries body by Joshuas actions.   Syrinx - An Edenist, daughter of Athene, and captain of the Voidhawk Oenone, Syrinx served a two-year term in the military, where she conspicuously failed to catch Joshua Calvert smuggling contraband, before becoming a commercial trader. She runs into Calvert on several more occasions throughout the books. Syrinx travels to the Tyrathca home system to investigate their knowledge of the possession phenomena, and undertakes various other missions for the Confederation.   Wing-Tsit Chong": null
    }
]