[
    {
        "     The Search for the Dice Man was written by ": null
    },
    {
        "George Cockcroft": "george cockcroft"
    },
    {
        " under the pen name ": null
    },
    {
        "Luke Rhinehart": "luke rhinehart"
    },
    {
        ". It is the official sequel to  The Dice Man , and was published in 42     Other books by George Cockcroft with the same themes:  The Dice Man ,  Adventures of Wim ,  The Book of the Die .       The book is set 42 years after the end of The Dice Man, and Lukes dicechild, Larry Rhinehart, has grown up to become a hotshot investor on the ": null
    },
    {
        "stock market": "stock market"
    },
    {
        ". He has totally rejected his fathers reverence for chance: he sees it as an adversary to be overcome, and has managed to create a stable, normal life for himself, in spite of his early abandonment. Indeed, he is due to wed the daughter of his boss, and live wealthily ever after.     This state of affairs would make a dull story and soon his fathers ghostly presence intervenes. He gets approached by the ": null
    },
    {
        "FBI": "fbi"
    },
    {
        ", who are trying to trace his fathers location, and find out whether hes alive or dead. Though Larry naturally refuses to have anything to do with the FBI, he soon starts to pursue his own investigations. He is financed in this by his fiancées father, who wants to put the whole dice business to rest, and is accompanied by his fiancées cousin, an unreformed ": null
    },
    {
        "hippy": "hippy"
    },
    {
        ".     It takes a long time - a whole book in fact, but Larry eventually does complete his quest. Along the way, what he sees and hears change his views somewhat; by the end of the book it is he who is trying to convince Luke, his father, to accept more chance into his life, rather than the other way round.       42 UK, HarperCollins , Pub date 42 June 42 hardback   42 UK, HarperCollins , Pub date 42 October 42 paperback   42 UK, HarperCollins ": null
    }
]