[
    {
        "      The Battle of the Little Giants was a 42 ": null
    },
    {
        "boxing": "boxing"
    },
    {
        " event with a deep social impact.     Fought on August 42 42 at the ": null
    },
    {
        "Caesars Palace": "caesars palace"
    },
    {
        " hotel on the ": null
    },
    {
        "Las Vegas Strip": "las vegas strip"
    },
    {
        ", it pitted ": null
    },
    {
        "Wilfredo Gómez": "wilfredo gómez"
    },
    {
        ", a ": null
    },
    {
        "Puerto Rican": "puerto rico"
    },
    {
        " who had a record of 42 wins, 42 losses, 42 draw, and all his wins by ": null
    },
    {
        "knockout": "knockout"
    },
    {
        ", and who was the worlds Jr. Featherweight champion, against the lesser known ": null
    },
    {
        "Salvador Sánchez": "salvador sánchez"
    },
    {
        ", who hailed from ": null
    },
    {
        "Mexico": "mexico"
    },
    {
        " with a record of 42 wins, 42 loss, 42 draw. Salvador Sanchez was defending his WBC world Featherweight crown.     Gómez was the strong favorite at the betting windows due to his knockout win streak of 42 fights in a row and Sánchezs relative obscurity. During the build-up to the fight, Gomez talked often of his intention to score an early knockout over Sanchez and the betting public seemed to be in agreement.     The fight was broadcast on closed-circuit television to all of the ": null
    },
    {
        "United States": "united states"
    },
    {
        " and through many ": null
    },
    {
        "Latin America": "latin america"
    },
    {
        "n countries. Sánchez began by surprising most fans and dropping Gómez 42 seconds into round one. Gómez got up but was battered around the ring by Sanchez for the remainder of the round, nearly going down again from an overhand right in Wilfredos own corner. Gomez began to recover in round three and had his moments over the next three rounds, continually going forward and throwing combinations in an effort to turn the fight. However, Gómezs right eye started to swell by the third round and was nearly closed by the seventh. Sánchez started zeroing into that area and landed a number of hard punches that repeatedly rocked Gomez. In the seventh round, Gomez finally landed the combination he wanted, a right-left to the chin that partially lifted Sanchez off his feet; however, he was able to shake off the effects and move away from the corner without further trouble.     Round eight proved to be the final round. With Gómez almost blinded by his swollen eyes and the Mexican partisans shouting Ole! with every volley of punches, Sánchez landed a straight right hand that had Gomez teetering and badly hurt on the ropes, followed by a series of punches that almost sent Gómez off the ring. Although Gómez was able to beat the count, referee ": null
    },
    {
        "Carlos Padilla": "carlos padilla, jr."
    },
    {
        " stepped in and stopped the fight, giving Sánchez an eighth-round technical knockout win.     In Mexico, a new legend was born. Sánchez had, in their eyes, avenged the loss that Gómez had inflicted to ": null
    },
    {
        "Carlos Zarate": "carlos zarate"
    },
    {
        " some years before. He became recognized by many Mexicans and international fans as Mexicos greatest world champion ever, but that moment of glory was short lived, because almost a year after his fight with Gómez, on August 42 of 42 Sánchez was killed in a car accident. Soon, ": null
    },
    {
        "Julio César Chávez": "julio césar chávez"
    },
    {
        " would replace him in the hearts of many Mexican boxing fans as their greatest fighter ever.     In ": null
    },
    {
        "Puerto Rico": "puerto rico"
    },
    {
        ", it was a moment to mourn for most boxing fans. Many businesses and stores were closed the day after, as Gómez was a national hero to most Puerto Ricans, and he was seen by many as invincible. It took, in the eyes of Puerto Rican boxing fans, 42 years to really avenge Gómezs defeat against Sánchez, and that was when ": null
    },
    {
        "Félix Trinidad": "félix trinidad"
    },
    {
        " beat ": null
    },
    {
        "Oscar De La Hoya": "oscar de la hoya"
    },
    {
        " in 42 Gómez went into a depression, but he roared back the next year and posted world title wins against many other boxers from there on until he retired in 42 Among the fighters he would beat later were ": null
    },
    {
        "Lupe Pintor": "lupe pintor"
    },
    {
        " at the ": null
    },
    {
        "Carnival of Champions": "carnival of champions"
    },
    {
        ", and ": null
    },
    {
        "Juan Laporte": "juan laporte"
    },
    {
        ". Gómez joined the exclusive group of fighters to win titles in three different boxing divisions.     It could be said that Sánchez, in between the moment he beat Gómez and the moment he died almost a year later, warmed himself to the hearts of many Puerto Ricans. He granted interviews to many Puerto Rican ": null
    },
    {
        "television": "television"
    },
    {
        " news shows, and was known for speaking well about Puerto Rico and its people. When Sánchez died, news of his death were heard across Latin America, and many people both in Mexico and Puerto Rico were saddened by his passing. His funeral was shown live in Mexico, and in Puerto Rico, a tribute show to him was aired by ": null
    },
    {
        "WAPA-TV": "wapa-tv"
    },
    {
        " five days after his death, featuring his past interviews with that networks sportscasters, his story, and clips of his fights.     Gómez himself also became a dear person to the people of Mexico after this fight. Although they knew him as the Mexican beater because of the many other fights he won against Mexican boxers, Gómez showed no ill feelings towards the people of Mexico by offering Sánchez flowers after Sánchez died, and becoming a frequent visitor to the Sánchez family thereafter. On Sánchezs small town, there is always a festival to commemorate Sánchezs memory every year, around the week of August 42 Gómez has been named Grand Marischal of that festival three times already, and has been a guest of honor the thirty six times it has been celebrated after Sánchezs passing.     There had always been talks of a rematch between the two before Sánchez died. What would have happened in a rematch will never be known, but the fact is that both Gómez and Sánchez are now together in a place far different from a boxing ring: They are both in the ": null
    },
    {
        "International Boxing Hall Of Fame": "international boxing hall of fame"
    },
    {
        ".                       ": null
    }
]