[
    {
        "            The Taming of the Shrew is a ": null
    },
    {
        "comedy": "shakespearean comedy"
    },
    {
        " by ": null
    },
    {
        "William Shakespeare": "william shakespeare"
    },
    {
        ", believed to have been written between 42 and 42     The play begins with a ": null
    },
    {
        "framing device": "frame story"
    },
    {
        ", often referred to as the ": null
    },
    {
        "induction": "induction"
    },
    {
        ", in which a mischievous nobleman tricks a drunken ": null
    },
    {
        "tinker": "tinker"
    },
    {
        " named ": null
    },
    {
        "Christopher Sly": "christopher sly"
    },
    {
        " into believing he is actually a nobleman himself. The nobleman then has the play performed for Slys diversion.     The main plot depicts the ": null
    },
    {
        "courtship": "courtship"
    },
    {
        " of ": null
    },
    {
        "Petruchio": "petruchio"
    },
    {
        " and Katherina, the headstrong, obdurate ": null
    },
    {
        "shrew": "shrew"
    },
    {
        ". Initially, Katherina is an unwilling participant in the relationship; however, Petruchio tames her with various psychological torments, such as keeping her from eating and drinking, until she becomes a desirable, compliant, and obedient bride. The ": null
    },
    {
        "subplot": "subplot"
    },
    {
        " features a competition between the suitors of Katherinas younger sister, ": null
    },
    {
        "Bianca": "bianca minola"
    },
    {
        ", who is seen as the ideal woman. The question of whether the play is ": null
    },
    {
        "misogynistic": "misogyny"
    },
    {
        " has become the subject of considerable controversy, particularly among modern scholars, audiences, and readers.     The Taming of the Shrew has been adapted numerous times for stage, screen, opera, ballet, and musical theatre; perhaps the most famous adaptations being ": null
    },
    {
        "Cole Porter": "cole porter"
    },
    {
        "s  Kiss Me, Kate  and ": null
    },
    {
        "the 42 film": "the taming of the shrew"
    },
    {
        " of the play, starring ": null
    },
    {
        "Elizabeth Taylor": "elizabeth taylor"
    },
    {
        " and ": null
    },
    {
        "Richard Burton": "richard burton"
    },
    {
        ". The 42 high school comedy film  42 Things I Hate About You  is also loosely based on the play.        ": null
    },
    {
        "shrew": "shrew"
    },
    {
        " of the title   ": null
    },
    {
        "Bianca Minola": "bianca minola"
    },
    {
        " – sister of Katherina; the  ingénue  ": null
    },
    {
        "Petruchio": "petruchio"
    },
    {
        " – suitor of Katherina   Gremio – elderly suitor of Bianca   Lucentio – suitor of Bianca   Hortensio – suitor of Bianca and friend to Petruchio   Grumio – Petruchios manservant   Tranio – Lucentios manservant   Biondello – servant of Lucentio   Vincentio – father of Lucentio   Widow – wooed by Hortensio   ": null
    },
    {
        "Pedant": "pedant"
    },
    {
        " – pretends to be Vincentio   ": null
    },
    {
        "Haberdasher": "haberdasher"
    },
    {
        " Characters appearing in the Induction: ": null
    },
    {
        "Christopher Sly": "christopher sly"
    },
    {
        " – a drunken tinker   Hostess of an alehouse   Lord – plays a prank on Sly   Bartholomew – Lords ": null
    },
    {
        "page boy": "page"
    },
    {
        "           Prior to the first act, an ": null
    },
    {
        "induction": "induction"
    },
    {
        " frames the play as a kind of history played in front of a befuddled drunkard named ": null
    },
    {
        "Christopher Sly": "christopher sly"
    },
    {
        " who is tricked into believing that he is a lord. The play is performed in order to distract Sly from his wife, who is actually Bartholomew, a servant, dressed as a woman.     In the play performed for Sly, the shrew is Katherina, the eldest daughter of Baptista Minola, a lord in ": null
    },
    {
        "Padua": "padua"
    },
    {
        ". Numerous men, including Gremio and Tranio, deem Katherina an unworthy option for marriage because of her notorious assertiveness and willfulness. On the other hand, men such as Hortensio and Gremio are eager to marry her younger sister ": null
    },
    {
        "Bianca": "bianca minola"
    },
    {
        ". However, Baptista has sworn Bianca is not allowed to marry until Katherina is wed; this motivates Biancas suitors to work together to find Katherina a husband so that they may compete for Bianca. The plot thickens when Lucentio, who has recently come to Padua to attend university, falls in love with Bianca. Overhearing Baptista say that he is on the lookout for tutors for his daughters, Lucentio devises a plan in which he disguises himself as a Latin tutor named Cambio in order to woo Bianca behind Baptistas back and meanwhile has his servant Tranio pretend to be him.     In the meantime, ": null
    },
    {
        "Petruchio": "petruchio"
    },
    {
        ", accompanied by his servant Grumio, arrives in Padua from ": null
    },
    {
        "Verona": "verona"
    },
    {
        ". He explains to Hortensio, an old friend of his, that since his fathers death he has set out to enjoy life and wed. Hearing this, Hortensio recruits Petruchio as a suitor for Katherina. He also has Petruchio present Baptista a music tutor named Litio . Thus, Lucentio and Hortensio attempt to woo Bianca while pretending to be the tutors Cambio and Litio.     To counter Katherinas shrewish nature, Petruchio pretends that any harsh things she says or does are actually kind and gentle. Katherina agrees to marry Petruchio after seeing that he is the only man willing to counter her quick remarks; however, at the ceremony, Petruchio makes an embarrassing scene when he strikes the priest and drinks the ": null
    },
    {
        "communion wine": "sacramental wine"
    },
    {
        ". After the wedding, Petruchio takes Katherina to his home against her will. Once they are gone, Gremio and Tranio formally bid for Bianca, with Tranio easily outbidding Gremio. However, in his zeal to win he promises much more than Lucentio actually possesses. When Baptista determines that once Lucentios father confirms the ": null
    },
    {
        "dowry": "dowry"
    },
    {
        ", Bianca and Tranio can marry, Tranio decides that they will need someone to pretend to be Vincentio, Lucentios father. Meanwhile, Tranio persuades Hortensio that Bianca is not worthy of his attentions, thus removing Lucentios remaining rival.        In Verona, Petruchio begins the taming of his new wife. She is refused food and clothing because nothing – according to Petruchio – is good enough for her; he claims that perfectly cooked meat is overcooked, a beautiful dress doesnt fit right, and a stylish hat is not fashionable. He also disagrees with everything that she says, forcing her to agree with everything that he says, no matter how absurd; on their way back to Padua to attend Biancas wedding, she agrees with Petruchio that the sun is the moon, and proclaims if you please to call it a rush-candle,/Henceforth I vow it shall be so for me . Along the way, they meet Vincentio, who is also on his way to Padua, and Katherina agrees with Petruchio when he declares that Vincentio is a woman and then apologises to Vincentio when Petruchio tells her that he is a man.     Back in Padua, Lucentio and Tranio convince a passing pedant to pretend to be Vincentio and confirm the dowry for Bianca. The man does so, and Baptista is happy for Bianca to wed Lucentio . Bianca, aware of the deception, then secretly elopes with the real Lucentio to get married. However, when Vincentio reaches Padua, he encounters the pedant, who claims to be Lucentios father. Tranio appears, and the pedant acknowledges him to be his son Lucentio. In all the confusion, the real Vincentio is set to be arrested, when the real Lucentio appears with his newly betrothed Bianca, revealing all to a bewildered Baptista and Vincentio. Lucentio explains everything, and all is forgiven by the two fathers.     Meanwhile, Hortensio has married a rich widow. In the final scene of the play there are three newly married couples; Bianca and Lucentio, the widow and Hortensio, and Katherina and Petruchio. Because of the general opinion that Petruchio is married to a shrew, a good-natured quarrel breaks out amongst the three men about whose wife is the most obedient. Petruchio proposes a wager whereby each will send a servant to call for their wives, and whichever comes most obediently will have won the wager for her husband. Katherina is the only one of the three who comes, winning the wager for Petruchio. She then hauls the other two wives into the room, giving a speech on why wives should always obey their husbands. The play ends with Baptista, Hortensio and Lucentio marvelling at how successfully Petruchio has tamed the shrew.       Although there is no direct literary source for the induction, the tale of a tinker being duped into believing he is a lord is one found in many literary traditions. Such a story is recorded in  Arabian Nights  where ": null
    },
    {
        "Harun al-Rashid": "harun al-rashid"
    },
    {
        " plays the same trick on a man he finds sleeping in an alley. Another is found in De Rebus Burgundicis by the Dutch historian Pontus de Huyter, where ": null
    },
    {
        "Philip, Duke of Burgundy": "philip the good"
    },
    {
        ", after attending his sisters wedding in Portugal, finds a drunken artisan whom he entertains with a pleasant Comedie. Arabian Nights was not translated into English until the mid 42th century, although Shakespeare may have known it by word of mouth. He could also have known the Duke of Burgundy story as, although De Rebus wasnt translated into French until 42 and into English until 42 there is evidence the story existed in English in a ": null
    },
    {
        "jest book": "jest book"
    },
    {
        " by ": null
    },
    {
        "Richard Edwardes": "richard edwardes"
    },
    {
        ", written in 42        Regarding the Petruchio/Katherina story, there are a variety of possible influences, but no one specific source. The basic elements of the narrative are present in tale 42 of the fourteenth-century Spanish book  Libro de los ejemplos del conde Lucanor y de Patronio  by ": null
    },
    {
        "Don Juan Manuel": "juan manuel, prince of villena"
    },
    {
        ", which tells of a young man who marries a very strong and fiery woman. The text had been translated into English by the sixteenth century, but there is no evidence that Shakespeare drew on it. The story of a headstrong woman tamed by a man was well known, and found in numerous traditions. For example, according to  The Canterbury Tales  by ": null
    },
    {
        "Geoffrey Chaucer": "geoffrey chaucer"
    },
    {
        ", ": null
    },
    {
        "Noah": "noah"
    },
    {
        "s wife was such a woman , and it was common for her to be depicted in this manner in ": null
    },
    {
        "mystery play": "mystery play"
    },
    {
        "s. Historically, another such woman was ": null
    },
    {
        "Xanthippe": "xanthippe"
    },
    {
        ", ": null
    },
    {
        "Socrates": "socrates"
    },
    {
        " wife, who is mentioned by Petruchio himself . Such characters also occur throughout ": null
    },
    {
        "medieval literature": "medieval literature"
    },
    {
        ", in popular ": null
    },
    {
        "farce": "farce"
    },
    {
        "s both before and during Shakespeares lifetime, and in ": null
    },
    {
        "folklore": "folklore"
    },
    {
        ".     In 42 Alfred Tolman conjectured a possible literary source for the wager scene may have been ": null
    },
    {
        "William Caxton": "william caxton"
    },
    {
        "s 42 translation of ": null
    },
    {
        "Geoffroy IV de la Tour Landry": "geoffroy iv de la tour landry"
    },
    {
        "s  Livre pour lenseignement de ses filles du Chevalier de La Tour Landry  . Written for his daughters as a guide on how to behave appropriately, de la Tour Landry includes a treatise on the domestic education of women which features an anecdote in which three merchants make a wager as to which of their wives will prove the most obedient when called upon to jump into a basin of water. The episode sees the first two wives refuse to obey , it ends at a banquet and it features a speech regarding the correct way for a husband to discipline his wife. In 42 John W. Shroeder conjectured that Chevalier de La Tour Landrys depiction of the ": null
    },
    {
        "Queen Vastis": "vashti"
    },
    {
        " story may also have been an influence on Shakespeare.     In 42 Richard Hosley suggested the main source for the play may have been the anonymous ballad A merry jeste of a shrewde and curst Wyfe, lapped in Morrelles Skin, for her good behauyour . The ballad tells the story of a marriage in which the husband must tame his headstrong wife. Like Shrew, the story features a family with two sisters, the younger of whom is seen as mild and desirable. However, in Merry Jest , the older sister is obdurate not because it is simply her nature, but because she has been raised by her shrewish mother to seek mastery over men. Ultimately, the couple return to the family house, where the now tamed woman lectures her sister on the merits of being an obedient wife. The taming in this version is much more physical than in Shakespeare; the shrew is beaten with ": null
    },
    {
        "birch rods": "birching"
    },
    {
        " until she bleeds, and is then wrapped in the salted flesh of a ": null
    },
    {
        "plough horse": "draft horse"
    },
    {
        " . Merry Jest was not unknown to earlier editors of the play, and had been dismissed as a source by A.R. Frey, ": null
    },
    {
        "W.C. Hazlitt": "william carew hazlitt"
    },
    {
        ", R. Warwick Bond and ": null
    },
    {
        "Frederick S. Boas": "frederick s. boas"
    },
    {
        ". Modern editors also express doubt as to Hosleys argument.        In 42 ": null
    },
    {
        "Jan Harold Brunvand": "jan harold brunvand"
    },
    {
        " argued that the main source for the play was not literary, but the oral folktale tradition. He argued the Petruchio/Katherina story represents an example of Type 42 in the ": null
    },
    {
        "Aarne–Thompson classification system": "aarne–thompson classification system"
    },
    {
        ". Brunvand discovered 42 oral examples of Type 42 spread over thirty European countries, but he could find only 42 literary examples, leading him to conclude Shakespeares taming plot, which has not been traced successfully in its entirety to any known printed version, must have come ultimately from oral tradition.  See also . Most contemporary critics accept Brunvands findings.     A source for Shakespeares sub-plot was first identified by Alfred Tolman in 42 as ": null
    },
    {
        "Ludovico Ariosto": "ludovico ariosto"
    },
    {
        "s I Suppositi, which was published in 42 ": null
    },
    {
        "George Gascoigne": "george gascoigne"
    },
    {
        "s English ": null
    },
    {
        "prose": "prose"
    },
    {
        " translation Supposes was performed in 42 and printed in 42 In I Suppositi, Erostrato falls in love with Polynesta , daughter of Damon . Erostrato disguises himself as Dulipo , a servant, whilst the real Dulipo pretends to be Erostrato. Having done this, Erostrato is hired as a tutor for Polynesta. Meanwhile, Dulipo pretends to formally woo Polynesta so as to frustrate the wooing of the aged Cleander . Dulipo outbids Cleander, but he promises far more than he can deliver, so he and Erostrato dupe a travelling gentleman from ": null
    },
    {
        "Siena": "siena"
    },
    {
        " into pretending to be Erostratos father, Philogano . However, when Polynesta is found to be pregnant, Damon has Dulipo imprisoned . Soon thereafter, the real Philogano arrives, and all comes to a head. Erostrato reveals himself, and begs clemency for Dulipo. Damon realises that Polynesta is truly in love with Erostrato, and so forgives the subterfuge. Having been released from jail, Dulipo then discovers he is Cleanders son. For more information on the relationship between Supposes and The Shrew, see . An additional minor source is  Mostellaria  by ": null
    },
    {
        "Plautus": "plautus"
    },
    {
        ", from which Shakespeare probably took the names of Tranio and Grumio.              Efforts to establish the plays date of composition are complicated by its uncertain relationship with another ": null
    },
    {
        "Elizabethan": "english renaissance theatre"
    },
    {
        " play with an almost identical plot but different wording and character names, A Pleasant Conceited Historie, called the taming of a Shrew. The Shrews exact relationship with A Shrew is unknown. Different theories suggest A Shrew could be a ": null
    },
    {
        "reported text": "memorial reconstruction"
    },
    {
        " of a performance of The Shrew, a source for The Shrew, an early draft of The Shrew, or an adaptation of The Shrew. For more information on A Shrew see ,  and  A Shrew was entered in the ": null
    },
    {
        "Stationers Register": "stationers register"
    },
    {
        " on 42 May 42 suggesting that whatever the relationship between the two plays, The Shrew was most likely written somewhere between 42 and 42 .     However, it is possible to narrow the date further. A  terminus ante quem  for A Shrew seems to be August 42 as a stage direction at 42 mentions Simon, which probably refers to the actor Simon Jewell, who was buried on 42 August 42 Furthermore, The Shrew must have been written earlier than 42 as ": null
    },
    {
        "Anthony Chute": "anthony chute"
    },
    {
        "s Beauty Dishonoured, written under the title of Shores wife contains the line He calls his Kate, and she must come and kiss him. This must refer to The Shrew, as there is no corresponding kissing scene in A Shrew. There are also verbal similarities between both Shrew plays and the anonymous play  A Knack To Know A Knave  . Knack features several passages common to both A Shrew and The Shrew, but it also borrows several passages unique to The Shrew. This suggests The Shrew was on stage prior to June 42     In his 42 edition of the play for ": null
    },
    {
        "The Oxford Shakespeare": "the oxford shakespeare"
    },
    {
        ", H.J. Oliver suggests the play was composed no later than 42 He bases this on the title page of A Shrew, which mentions the play had been performed sundry times by ": null
    },
    {
        "Pembrokes Men": "pembrokes men"
    },
    {
        ". When the London theatres were closed on 42 June 42 due to an outbreak of ": null
    },
    {
        "plague": "plague"
    },
    {
        ", Pembrokes Men went on a regional tour to ": null
    },
    {
        "Bath": "bath, somerset"
    },
    {
        " and ": null
    },
    {
        "Ludlow": "ludlow"
    },
    {
        ". The tour was a financial failure, and the company returned to London on 42 September, financially ruined. Over the course of the next three years, four plays with their name on the title page were published; ": null
    },
    {
        "Christopher Marlowe": "christopher marlowe"
    },
    {
        "s  Edward II  , and Shakespeares  Titus Andronicus  ,  The True Tragedy of Richard Duke of York   and The Taming of a Shrew . Oliver says it is a natural assumption that these publications were sold by members of Pembrokes Men who were broke after the failed tour. Oliver assumes that A Shrew is a reported version of The Shrew, which means The Shrew must have been in their possession when they began their tour in June, as they didnt perform it upon returning to London in September, nor would they have taken possession of any new material at that time.     Ann Thompson considers A Shrew to be a reported text in her 42 and 42 editions of the play for the ": null
    },
    {
        "New Cambridge Shakespeare": "new cambridge shakespeare"
    },
    {
        ". She focuses on the closure of the theatres on 42 June 42 arguing that the play must have been written prior to June 42 for it to have given rise to A Shrew. She cites the reference to Simon in A Shrew, Anthony Chutes allusion to The Shrew in Beauty Dishonoured and the verbal similarities between The Shrew and A Knack to Know a Knave as supporting a date of composition prior to June 42 Stephen Roy Miller, in his 42 edition of A Shrew for the New Cambridge Shakespeare, agrees with the date of late 42/early 42 as he believes The Shrew preceded A Shrew .     Keir Elam, however, has argued for a  terminus post quem  of 42 for The Shrew, based on Shakespeares probable use of two sources published that year; ": null
    },
    {
        "Abraham Ortelius": "abraham ortelius"
    },
    {
        " map of Italy in the fourth edition of  Theatrum Orbis Terrarum , and ": null
    },
    {
        "John Florio": "john florio"
    },
    {
        "s Second Fruits. Firstly, Shakespeare errs in putting Padua in ": null
    },
    {
        "Lombardy": "lombardy"
    },
    {
        " instead of ": null
    },
    {
        "Veneto": "veneto"
    },
    {
        ", probably because he used Ortelius map of Italy as a source, which has Lombardy written across the entirety of northern Italy. Secondly, Elam suggests that Shakespeare derived his Italian idioms and some of the dialogue from Florios Second Fruits, a bilingual introduction to Italian language and culture. Elam argues that Lucentios opening dialogue,          is an example of Shakespeares borrowing from Florios dialogue between Peter and Stephan, who have just arrived in the north:          Elams arguments suggest The Shrew must have been written by 42 which places the date of composition around 42–42          The 42 quarto of A Shrew was printed by ": null
    },
    {
        "Peter Short": "peter short"
    },
    {
        " for ": null
    },
    {
        "Cuthbert Burbie": "cuthbert burby"
    },
    {
        ". It was republished in 42 , and 42 by ": null
    },
    {
        "Valentine Simmes": "valentine simmes"
    },
    {
        " for ": null
    },
    {
        "Nicholas Ling": "nicholas ling"
    },
    {
        ". The Shrew was not published until the  First Folio  in 42 The only quarto version of The Shrew was printed by ": null
    },
    {
        "William Stansby": "william stansby"
    },
    {
        " for ": null
    },
    {
        "John Smethwick": "john smethwick"
    },
    {
        " in 42 as A Wittie and Pleasant comedie called The Taming of the Shrew, based on the 42 folio text. ": null
    },
    {
        "W.W. Greg": "w. w. greg"
    },
    {
        " has demonstrated that A Shrew and The Shrew were treated as the same text for the purposes of ": null
    },
    {
        "copyright": "copyright"
    },
    {
        ", i.e. ownership of one constituted ownership of the other, and when Smethwick purchased the rights from Ling in 42 to print the play in the First Folio, Ling actually transferred the rights for A Shrew, not The Shrew.               A Shrew The Shrew is its relationship with A Shrew. There are five main theories as to the nature of this relationship:   The two plays are unrelated other than the fact that they are both based on another play which is now lost. This is the Ur-Shrew theory . See esp.  and . See also  and .   A Shrew is a reconstructed version of The Shrew; i.e. a ": null
    },
    {
        "bad quarto": "bad quarto"
    },
    {
        ", an attempt by actors to reconstruct the original play from memory. See esp.  and . See also  and .   Shakespeare used the previously existing A Shrew, which he did not write, as a source for The Shrew. See esp. . See also  and .   Both versions were legitimately written by Shakespeare himself; i.e. A Shrew is an early draft of The Shrew. See , ,  and .   A Shrew is an adaptation of The Shrew by someone other than Shakespeare.     The exact relationship between The Shrew and A Shrew is uncertain, but many scholars consider The Shrew the original, with A Shrew derived from it; as H.J. Oliver suggests, there are passages in A Shrew that make sense only if one knows the version from which they must have been derived.      The debate regarding the relationship between the two plays began in 42 when ": null
    },
    {
        "Alexander Pope": "alexander pope"
    },
    {
        " incorporated extracts from A Shrew into The Shrew in his ": null
    },
    {
        "edition of Shakespeares works": "alexander popeedition of shakespeares works"
    },
    {
        ". In The Shrew, the Christopher Sly framework is only featured twice; at the opening of the play, and at the end of Act 42 Scene 42 However, in A Shrew, the Sly framework reappears a further five times, including a scene which comes after the final scene of the Petruchio/Katherina story. Pope added most of the Sly framework to The Shrew, even though he acknowledged in his preface that he did not believe Shakespeare had written A Shrew. Subsequent editors followed suit, adding some or all of the Sly framework to their versions of The Shrew; ": null
    },
    {
        "Lewis Theobald": "lewis theobald"
    },
    {
        " , ": null
    },
    {
        "Thomas Hanmer": "sir thomas hanmer, 4th baronet"
    },
    {
        " , ": null
    },
    {
        "William Warburton": "william warburton"
    },
    {
        " , ": null
    },
    {
        "Samuel Johnson": "samuel johnson"
    },
    {
        " and ": null
    },
    {
        "George Steevens": "george steevens"
    },
    {
        "  and ": null
    },
    {
        "Edward Capell": "edward capell"
    },
    {
        " . In his 42 edition of The Plays and Poems of William Shakespeare, however, ": null
    },
    {
        "Edmond Malone": "edmond malone"
    },
    {
        " removed all A Shrew extracts and returned the text to the 42 First Folio version. By the end of the eighteenth century, the predominant theory had come to be that A Shrew was a non-Shakespearean source for The Shrew, and hence to include extracts from it was to graft non-authorial material onto the play.     This theory prevailed until 42 when Samuel Hickson compared the texts of The Shrew and A Shrew, concluding The Shrew was the original, and A Shrew was derived from it. By comparing seven passages which are similar in both plays, he concluded the original conception is invariably to be found in The Shrew. His explanation was that A Shrew was written by ": null
    },
    {
        "Christopher Marlowe": "christopher marlowe"
    },
    {
        ", with The Shrew as his template. He reached this conclusion primarily because A Shrew features numerous lines almost identical to lines in Marlowes  Tamburlaine  and  Dr. Faustus . See  and      In 42 building on Hicksons research, ": null
    },
    {
        "Peter Alexander": "peter alexander"
    },
    {
        " first suggested the bad quarto theory. Alexander agreed with Hickson that A Shrew was derived from The Shrew, but he did not agree that Marlowe wrote A Shrew. Instead he labelled A Shrew a bad quarto. His main argument was that, primarily in the subplot of A Shrew, characters act without motivation, whereas such motivation is present in The Shrew. Alexander believed this represents an example of a reporter forgetting details and becoming confused, which also explains why lines from other plays are used from time to time; to cover gaps which the reporter knows have been left. He also argued the subplot in The Shrew was closer to the plot of I Suppositi/Supposes than the subplot in A Shrew, which he felt indicated the subplot in The Shrew must have been based directly on the source, whereas the subplot in A Shrew was a step removed. In their 42 edition of the play for the New Shakespeare, ": null
    },
    {
        "Arthur Quiller-Couch": "arthur quiller-couch"
    },
    {
        " and ": null
    },
    {
        "John Dover Wilson": "j. dover wilson"
    },
    {
        " supported Alexanders argument. However, there has always been critical resistance to the theory.     An early scholar to find fault with Alexanders reasoning was ": null
    },
    {
        "E.K. Chambers": "e. k. chambers"
    },
    {
        ", who reasserted the source theory. Chambers, who supported Alexanders bad quarto theory regarding  The First part of the Contention betwixt the two famous Houses of Yorke and Lancaster  and The True Tragedy of Richard Duke of Yorke, argued A Shrew did not fit the pattern of a bad quarto; I am quite unable to believe that A Shrew had any such origin. Its textual relation to The Shrew does not bear any analogy to that of other bad Quartos to the legitimate texts from which they were memorised. The ": null
    },
    {
        "nomenclature": "nomenclature"
    },
    {
        ", which at least a memoriser can recall, is entirely different. The verbal parallels are limited to stray phrases, most frequent in the main plot, for which I believe Shakespeare picked them up from A Shrew.  He explained the relationship between I Suppositi/Supposes and the subplots by arguing the subplot in The Shrew was based upon both the subplot in A Shrew and the original version of the story in Ariosto/Gascoigne.        In 42 Leo Kirschbaum made a similar argument. In an article listing over twenty examples of bad quartos, Kirschbaum did not include A Shrew, which he felt was too different from The Shrew to come under the bad quarto banner; despite protestations to the contrary, The Taming of a Shrew does not stand in relation to The Shrew as The True Tragedie, for example, stands in relation to 42 Henry VI.  Writing in 42 Stephen Roy Miller offers much the same opinion; the relation of the early quarto to the Folio text is unlike other early quartos because the texts vary much more in plotting and dialogue the differences between the texts are substantial and coherent enough to establish that there was deliberate revision in producing one text out of the other; hence A Shrew is not merely a poor report of The Shrew.  Character names are changed, basic plot points are altered , the play is set in ": null
    },
    {
        "Athens": "athens"
    },
    {
        " instead of Padua, the Sly framework forms a complete narrative, and entire speeches are completely different, all of which suggests to Miller that the author of A Shrew thought they were working on something different from Shakespeares play, not attempting to transcribe it for resale; underpinning the notion of a Shakespearean bad quarto is the assumption that the motive of whoever compiled that text was to produce, differentially, a verbal replica of what appeared on stage.  Miller believes that Chambers and Kirschbaum successfully illustrate A Shrew does not fulfil this rubric.     Alexanders theory continued to be challenged as the years went on. In 42 R.A. Houk developed what came to be dubbed the Ur-Shrew theory; both A Shrew and The Shrew were based upon a third play, now lost. In 42 G.I. Duthie refined Houks suggestion by arguing A Shrew was a memorial reconstruction of Ur-Shrew, a now lost early draft of The Shrew; A Shrew is substantially a memorially constructed text and is dependent upon an early Shrew play, now lost. The Shrew is a reworking of this lost play.  Hickson, who believed Marlowe to have written A Shrew, had hinted at this theory in 42; though I do not believe Shakspeares play to contain a line of any other writer, I think it extremely probable that we have it only in a revised form, and that, consequently, the play which Marlowe imitated might not necessarily have been that fund of life and humour that we find it now.  Hickson is here arguing that Marlowes A Shrew is not based upon the version of The Shrew found in the First Folio, but on another version of the play. Duthie argues this other version was a Shakespearean early draft of The Shrew; A Shrew constitutes a reported text of a now lost early draft.     Alexander returned to the debate in 42 re-presenting his bad quarto theory. In particular, he concentrated on the various complications and inconsistencies in the subplot of A Shrew, which had been used by Houk and Duthie as evidence for an Ur-Shrew, to argue that the reporter of A Shrew attempted to recreate the complex subplot from The Shrew but got confused; the compiler of A Shrew while trying to follow the subplot of The Shrew gave it up as too complicated to reproduce, and fell back on love scenes in which he substituted for the maneuvers of the disguised Lucentio and Hortensio extracts from Tamburlaine and Faustus, with which the lovers woo their ladies.      After little further discussion of the issue in the 42s, the 42s saw the publication of three scholarly editions of The Shrew, all of which re-addressed the question of the relationship between the two plays; ": null
    },
    {
        "Brian Morris": "brian morris, baron morris of castle morris"
    },
    {
        " 42 edition for the second series of the ": null
    },
    {
        "Arden Shakespeare": "arden shakespeare"
    },
    {
        ", H.J. Olivers 42 edition for the Oxford Shakespeare and Ann Thompsons 42 edition for the New Cambridge Shakespeare. Morris summarised the scholarly position in 42 as one in which no clear-cut answers could be found; unless new, external evidence comes to light, the relationship between The Shrew and A Shrew can never be decided beyond a peradventure. It will always be a balance of probabilities, shifting as new arguments and opinions are added to the scales. Nevertheless, in the present century, the movement has unquestionably been towards an acceptance of the Bad Quarto theory, and this can now be accepted as at least the current orthodoxy.  Morris himself, and Thompson, supported the bad quarto theory, with Oliver tentatively arguing for Duthies bad quarto/early draft/Ur-Shrew theory.        Perhaps the most extensive examination of the question came in 42 in Stephen Roy Millers edition of A Shrew for the New Cambridge Shakespeare: The Early Quartos series. Miller agrees with most modern scholars that A Shrew is derived from The Shrew, but he does not believe it to be a bad quarto. Instead, he argues it is an adaptation by someone other than Shakespeare. Miller believes Alexanders suggestion in 42 that the reporter became confused is unlikely, and instead suggests an adapter at work; the most economic explanation of indebtedness is that whoever compiled A Shrew borrowed the lines from Shakespeares The Shrew, or a version of it, and adapted them.  Part of Millers evidence relates to Gremio, who has no counterpart in A Shrew. In The Shrew, after the wedding, Gremio expresses doubts as to whether or not Petruchio will be able to tame Katherina. In A Shrew, these lines are extended and split between Polidor and Phylema . As Gremio does have a counterpart in I Suppositi, Miller concludes that to argue the priority of A Shrew in this case would mean arguing that Shakespeare took the negative hints from the speeches of Polidor and Phylema and gave them to a character he resurrected from Supposes. This is a less economical argument than to suggest that the compiler of A Shrew, dismissing Gremio, simply shared his doubts among the characters available.  He argues there is even evidence in the play that the compiler knew he was working within a specific literary tradition; as with his partial change of character names, the compiler seems to wish to produce dialogue much like his models, but not the same. For him, adaptation includes exact quotation, imitation and incorporation of his own additions. This seems to define his personal style, and his aim seems to be to produce his own version, presumably intended that it should be tuned more towards the popular era than The Shrew.      As had Alexander, Houk and Duthie, Miller believes the key to the debate is to be found in the subplot, as it is here where the two plays differ most. He points out that the subplot in The Shrew is based on the classical style of ": null
    },
    {
        "Latin": "latin literature"
    },
    {
        " comedy with an intricate plot involving deception, often kept in motion by a comic servant. The subplot in A Shrew, however, which features an extra sister and addresses the issue of marrying above and below ones class, has many elements more associated with the romantic style of comedy popular in London in the 42s.  Miller cites plays such as ": null
    },
    {
        "Robert Greene": "robert greene"
    },
    {
        "s  Friar Bacon and Friar Bungay  and  Fair Em  as evidence of the popularity of such plays. He points to the fact that in The Shrew, there is only eleven lines of romance between Lucentio and Bianca, but in A Shrew, there is an entire scene between Kates two sisters and their lovers. This, he argues, is evidence of an adaptation rather than a faulty report;          Miller believes the compiler appears to have wished to make the play shorter, more of a romantic comedy full of wooing and glamorous ": null
    },
    {
        "rhetoric": "rhetoric"
    },
    {
        ", and to add more obvious, broad comedy.           H.J. Oliver argues the version of the play in the 42 First Folio was likely copied not from a ": null
    },
    {
        "prompt book": "prompt book"
    },
    {
        " or transcript, but from the authors own ": null
    },
    {
        "foul papers": "foul papers"
    },
    {
        ", which he believes showed signs of revision by Shakespeare.  These revisions, Oliver says, relate primarily to the character of Hortensio, and suggest that in an original version of the play, now lost, Hortensio was not a suitor to Bianca, but simply an old friend of Petruchio. When Shakespeare rewrote the play so that Hortensio became a suitor in disguise , many of his lines were either omitted or given to Tranio .     Oliver cites several scenes in the play where Hortensio causes problems. For example, in Act 42 Scene 42 Tranio and Gremio bid for Bianca, but Hortensio, who everyone is aware is also a suitor, is never mentioned. In Act 42 Scene 42 Lucentio tells Bianca we might beguile the old ": null
    },
    {
        "Pantalowne": "pantalone"
    },
    {
        " , yet says nothing of Hortensios attempts to woo her, instead implying his only rival is Gremio. In Act 42 Scene 42 Tranio suddenly becomes an old friend of Petruchio, knowing his mannerisms and explaining his tardiness prior to the wedding. However, up to this point, Petruchios only acquaintance in Padua has been Hortensio. In Act 42 Scene 42 Hortensio tells Vincentio that Lucentio has married Bianca. However, as far as Hortensio should be concerned, Lucentio has denounced Bianca, because in Act 42 Scene 42 Tranio agreed with Hortensio that neither of them would pursue Bianca, and as such, his knowledge of the marriage of who he supposes to be Lucentio and Bianca makes no sense. From this, Oliver concludes that an original version of the play existed in which Hortensio was simply a friend of Petruchios, and had no involvement in the Bianca subplot, but wishing to complicate things, Shakespeare rewrote the play, introducing the Litio disguise, and giving some of Hortensios discarded lines to Tranio, but not fully correcting everything to fit the presence of a new suitor.     This is important in Duthies theory of an Ur-Shrew insofar as he argues it is the original version of The Shrew upon which A Shrew is based, not the version which appears in the 42 First Folio. As Oliver argues, A Shrew is a report of an earlier, Shakespearian, form of The Shrew in which Hortensio was not disguised as Litio.  Oliver suggests that when Pembrokes Men left London in June 42 they had in their possession a now lost early draft of the play. Upon returning to London, they published A Shrew in 42 some time after which Shakespeare rewrote his original play into the form seen in the First Folio.     Duthies arguments were never fully accepted at the time, as critics tended to look on the relationship between the two plays as an either-or situation; A Shrew is either a reported text or an early draft. In more recent scholarship, however, the possibility that a text could be both has been shown to be critically viable. For example, in his 42 Oxford Shakespeare edition of 42 Henry VI, Roger Warren makes the same argument for The First Part of the Contention.  Randall Martin reaches the same conclusion regarding The True Tragedy of Richard Duke of Yorke in his 42 Oxford Shakespeare edition of 42 Henry VI.  This lends support to the theory that A Shrew could be both a reported text and an early draft.          The Taming of the Shrew has been the subject of critical controversy. Dana Aspinall writes Since its first appearance, some time between 42 and 42 Shrew has elicited a panoply of heartily supportive, ethically uneasy, or altogether disgusted responses to its rough-and-tumble treatment of the taming of the curst shrew Katherina, and obviously, of all potentially unruly wives.  Phyllis Rackin argues that seen in the context of current anxieties, desires and beliefs, Shakespeares play seems to prefigure the most oppressive modern assumptions about women and to validate those assumptions as timeless truths.  ": null
    },
    {
        "Stevie Davies": "stevie davies"
    },
    {
        " says that responses to Shrew have been dominated by feelings of unease and embarrassment, accompanied by the desire to prove that Shakespeare cannot have meant what he seems to be saying; and that therefore he cannot really be saying it.  Philippa Kelly asks:          Some scholars argue that even in Shakespeares day the play must have been controversial, due to the changing nature of gender politics. ": null
    },
    {
        "Marjorie Garber": "marjorie garber"
    },
    {
        ", for example, suggests Shakespeare created the Induction so the audience wouldnt react badly to the misogyny in the Petruchio/Katherina story; he was, in effect, defending himself against charges of ": null
    },
    {
        "sexism": "sexism"
    },
    {
        ". G.R. Hibbard argues that during the period in which the play was written, ": null
    },
    {
        "arranged marriage": "arranged marriage"
    },
    {
        "s were beginning to give way to newer, more romantically informed unions, and thus peoples views on womens position in society, and their relationships with men, were in a state of flux. As such, audiences may not have been as predisposed to tolerate the harsh treatment of Katherina as is often thought.        Evidence of at least some initial societal discomfort with The Shrew is, perhaps, to be found in the fact that ": null
    },
    {
        "John Fletcher": "john fletcher"
    },
    {
        ", Shakespeares successor as house playwright for the ": null
    },
    {
        "Kings Men": "kings men"
    },
    {
        ", wrote  The Womans Prize , or The Tamer Tamed as a sequel to Shakespeares play. Written c.42 the play tells the story of Petruchios remarriage after Katherinas death. In a mirror of the original, his new wife attempts to tame him – thus the tamer becomes the tamed. Although Fletchers sequel is often downplayed as merely a farce, some critics acknowledge the more serious implications of such a reaction. Lynda Boose, for example, writes, Fletchers response may in itself reflect the kind of discomfort that Shrew has characteristically provoked in men and why its many revisions since 42 have repeatedly contrived ways of softening the edges.      With the rise of the ": null
    },
    {
        "feminist movement": "feminist movement"
    },
    {
        " in the twentieth century, reactions to the play have tended to become more divergent. For some critics, Kates taming was no longer as funny as it had been her domination became, in ": null
    },
    {
        "George Bernard Shaw": "george bernard shaw"
    },
    {
        "s words altogether disgusting to modern sensibility.  Addressing the relationship between A Shrew and The Shrew from a political perspective, for example, Leah S. Marcus very much believes the play to be what it seems. She argues A Shrew is an earlier version of The Shrew, but acknowledges that most scholars reject the idea that A Shrew was written by Shakespeare. She believes one of the reasons for this is because A Shrew hedges the plays ": null
    },
    {
        "patriarchal": "patriarchy"
    },
    {
        " message with numerous qualifiers that do not exist in The Shrew. She calls A Shrew a more progressive text than The Shrew, and argues that scholars tend to dismiss the idea that A Shrew is Shakespearean because the women are not as satisfactorily tamed as they are in The Shrew.  She also points out that if A Shrew is an early draft, it suggests Shakespeare may have increased rather than decreased the patriarchal violence of his materials , something which, she believes, scholars find difficult to accept.     However, others see the play as an example of a pre-": null
    },
    {
        "feminist": "feminism"
    },
    {
        " condemnation of patriarchal domination and an argument for modern-day womens lib . For example, ": null
    },
    {
        "Conall Morrison": "conall morrison"
    },
    {
        ", director of the ": null
    },
    {
        "RSC": "royal shakespeare company"
    },
    {
        " relentlessly unpleasant 42 production, wrote:          Philippa Kelly makes this point:          Elizabeth Kantor argues the following:          ": null
    },
    {
        "Jonathan Miller": "jonathan miller"
    },
    {
        ", director of the 42  BBC Television Shakespeare  adaptation, and several theatrical productions, argues that although the play is not misogynistic, neither is it a feminist treatise:            An element in the debate regarding the plays misogyny, or lack thereof, is the Induction, and how it relates to the Katherina/Petruchio story. According to H.J. Oliver, it has become orthodoxy to claim to find in the Induction the same theme as is to be found in both the Bianca and the Katherine-Petruchio plots of the main play, and to take it for granted that identity of theme is a merit and justifies the introduction of Sly.  For example, Geoffrey Bullough argues the three plots are all linked in idea because all contain discussion of the relations of the sexes in marriage.  Richard Hosley suggests the three plots form a unified whole insofar as they all deal with assumptions about identity and assumptions about personality.  Oliver, however, argues that the Sly Induction does not so much announce the theme of the enclosed stories as establish their tone.         This is important in terms of determining the seriousness of Katherinas final speech. Marjorie Garber writes of the Induction, the frame performs the important task of distancing the later action, and of insuring a lightness of tone – significant in light of the real abuse to which Kate is subjected by Petruchio.  Oliver argues the Induction is used to remove the audience from the world of the enclosed plot – to place the Sly story on the same level of reality as the audience, and the Katherina/Petruchio story on a different level of reality. This, he argues, is done to ensure the audience does not take the play literally, that it sees the Katherina/Petruchio story as a farce:          Oliver argues that the main purpose of the Induction was to set the tone for the play within the play – in particular, to present the story of Kate and her sister as none-too-serious comedy put on to divert a drunken tinker . He suggests that if the Induction is removed from a production of the play , a fundamental part of the structure has been lost. Speaking of Jonathan Millers BBC Television Shakespeare adaptation of 42 which omitted the Induction, ": null
    },
    {
        "Stanley Wells": "stanley wells"
    },
    {
        " wrote to omit the Christopher Sly episodes is to suppress one of Shakespeares most volatile lesser characters, to jettison most of the plays best poetry, and to strip it of an entire dramatic dimension.      Regarding the importance of the Induction, ": null
    },
    {
        "Jonathan Bate": "jonathan bate"
    },
    {
        " and Eric Rasmussen argue the Sly framework establishes a ": null
    },
    {
        "self-referential": "self-reference"
    },
    {
        " theatricality in which the status of the shrew-play as a play is enforced.  ": null
    },
    {
        "Graham Holderness": "graham holderness"
    },
    {
        " argues the play in its received entirety does not propose any simple or unitary view of sexual politics: it contains a crudely reactionary ": null
    },
    {
        "dogma": "dogma"
    },
    {
        " of masculine supremacy, but it also works on that ideology to force its expression into self-contradiction. The means by which this self-interrogation is accomplished is that complex theatrical device of the Sly-framework without the ": null
    },
    {
        "metadramatic": "metatheatre"
    },
    {
        " potentialities of the Sly-framework, any production of Shrew is thrown much more passively at the mercy of the directors artistic and political ideology.  ": null
    },
    {
        "Coppélia Kahn": "coppélia kahn"
    },
    {
        " suggests the transformation of Christopher Sly from drunken lout to noble lord, a transformation only temporary and skin-deep, suggests that Kates switch from independence may also be deceptive and prepares us for the irony of the  dénouement .  The Induction serves to undercut charges of misogyny – the play within the play is a farce, it is not supposed to be taken seriously by the audience, as it is not taken seriously by Sly. As such, questions of the seriousness of what happens within it are rendered irrelevant.       Language itself is a major theme in the play, especially in the taming process, where mastery of language becomes paramount. Katherina is initially described as a shrew because of her harsh language to those around her. Karen Newman points out, from the outset of the play, Katherines threat to male authority is posed through language: it is perceived by others as such and is linked to a claim larger than shrewishness – ": null
    },
    {
        "witchcraft": "witchcraft"
    },
    {
        " – through the constant allusions to Katherines kinship with the ": null
    },
    {
        "devil": "devil"
    },
    {
        ".  For example, after Katherina rebukes Hortensio and Gremio in Act 42 Scene 42 Hortensio replies with From all such devils, good Lord deliver us! . Even Katherinas own father refers to her as thou hilding of a devilish spirit . Petruchio, however, attempts to tame her – and thus her language – with rhetoric that specifically undermines her tempestuous nature;          Here Petruchio is specifically attacking the very function of Katherinas language, vowing that no matter what she says, he will purposely misinterpret it, thus undermining the basis of the ": null
    },
    {
        "linguistic sign": "sign"
    },
    {
        ", and disrupting the relationship between signifier and signified. In this sense, Margaret Jane Kidnie argues this scene demonstrates the slipperiness of language.      Apart from undermining her language, Petruchio also uses language to ": null
    },
    {
        "objectify": "ownership"
    },
    {
        " her. For example, in Act 42 Scene 42 Petruchio explains to all present that Katherina is now literally his property:          In discussing Petruchios objectification of Katherina, Tita French Baumlin focuses on his puns on her name. By referring to her as a cake and a cat , he objectifies her in a more subtle manner than saying she belongs to him. A further aspect of Petruchios taming rhetoric is the repeated comparison of Katherina to animals. In particular, he is prone to comparing her to a ": null
    },
    {
        "hawk": "hawk"
    },
    {
        " , often employing an overarching hunting metaphor; My falcon now is sharp and passing empty,/And till she stoop she must not be full-gorged . Katherina, however, appropriates this method herself, leading to a trading of insults rife with animal imagery in Act 42 Scene 42 , where she compares Petruchio to a turtle and a crab.     Language itself has thus become a battleground. However, it is Petruchio who seemingly emerges as the victor. In his house, after Petruchio has dismissed the haberdasher, Katherina exclaims          Katherina is here declaring her independence of language; no matter what Petruchio may do, she will always be free to speak her mind. However, only one-hundred lines later, the following exchange occurs;          Kidnie says of this scene, the language game has suddenly changed and the stakes have been raised. Whereas before he seemed to mishear or misunderstand her words, Petruchio now overtly tests his wifes subjection by demanding that she concede to his views even when they are demonstrably unreasonable. The lesson is that Petruchio has the absolute authority to rename their world.  Katherina is free to say whatever she wishes, as long she agrees with Petruchio. His apparent victory in the language game is seen in Act 42 Scene 42 when Katherina is made to switch the words moon and sun , and she concedes that she will agree with whatever Petruchio says, no matter how absurd:               Of this scene, Kidnie argues what he says must take priority over what Katherina knows.  From this point, Katherinas language changes from her earlier ": null
    },
    {
        "vernacular": "vernacular"
    },
    {
        "; instead of defying Petruchio and his words, she has apparently succumbed to his rhetoric and accepted that she will use his language instead of her own – both Katherina and her language have, seemingly, been tamed.     The important role of language, however, is not confined to the taming plot. For example, in a ": null
    },
    {
        "psychoanalytic": "psychoanalysis"
    },
    {
        " reading of the play, Joel Fineman suggests there is a distinction made between male and female language, further subcategorising the latter into good and bad, epitomised by Bianca and Katherina respectively. Language is also important in relation to the Induction. Here, Sly speaks in ": null
    },
    {
        "prose": "prose"
    },
    {
        " until he begins to accept his new role as lord, at which point he switches to ": null
    },
    {
        "blank verse": "blank verse"
    },
    {
        " and adopts the ": null
    },
    {
        "royal we": "royal we"
    },
    {
        ". Language is also important in relation to Tranio and Lucentio, who appear on stage speaking a highly artificial style of blank verse full of ": null
    },
    {
        "classical": "classics"
    },
    {
        " and ": null
    },
    {
        "mythological": "classical antiquity"
    },
    {
        " allusions and elaborate ": null
    },
    {
        "metaphor": "metaphor"
    },
    {
        "s and ": null
    },
    {
        "simile": "simile"
    },
    {
        "s, thus immediately setting them aside from the more straightforward language of the Induction, and alerting the audience to the fact that they are now in an entirely different  milieu .              In productions of the play, it is often the interpretation of Katherinas final speech that defines the tone of the entire production, such is the importance of this speech and what it says, or seems to say, about female submission:          Traditionally, many critics have taken the speech literally. Writing in 42 for example, G.I. Duthie argued what Shakespeare emphasises here is the foolishness of trying to destroy order.  However, in a modern ": null
    },
    {
        "western society": "western world"
    },
    {
        ", holding relatively ": null
    },
    {
        "egalitarian": "egalitarianism"
    },
    {
        " views on gender, such an interpretation presents a dilemma, as according to said interpretation the play seemingly celebrates female subjugation.     Critically, four main theories have emerged in response to Katherinas speech;     It is sincere; Petruchio has successfully tamed her.   It is sincere, but not because Petruchio has tamed her. Instead, she has fallen in love with him and accepted her role as his wife.   It is ironic; she is being sarcastic, pretending to have been tamed when in reality she has completely duped Petruchio into thinking he has tamed her.   It should not be read seriously or ironically; it is part of the farcical nature of the play-within-the-play.     George Bernard Shaw wrote in 42 that no man with any decency of feeling can sit it out in the company of a woman without being extremely ashamed of the lord-of-creation moral implied in the wager and the speech put into the womans own mouth. Quoted in  Katherina is seen as having been successfully tamed, and having come to accept her newly submissive role to such an extent that she advocates that role for others, the final speech rationalises, according to Duthie, in both a political and ": null
    },
    {
        "sociological": "sociology"
    },
    {
        " sense, the submission of wives to husbands.     Actress ": null
    },
    {
        "Meryl Streep": "meryl streep"
    },
    {
        ", who played Katherina in 42 at the ": null
    },
    {
        "Shakespeare in the Park festival": "shakespeare in the park festivals"
    },
    {
        ", says of the play, really what matters is that they have an incredible passion and love; its not something that Katherina admits to right away, but it does provide the source of her change. Quoted in  Similarly, John C. Bean sees the speech as the final stage in the process of Katherinas change of heart towards Petruchio; if we can appreciate the liberal element in Kates last speech – the speech that strikes modern sensibilities as advocating male tyranny – we can perhaps see that Kate is tamed not in the automatic manner of ": null
    },
    {
        "behavioural psychology": "behaviorism"
    },
    {
        " but in the spontaneous manner of the later romantic comedies where characters lose themselves and emerge, as if from a dream, liberated into the bonds of love.         Perhaps the most common interpretation in the modern era is that the speech is ironic; Katherina has not been tamed at all, she has merely duped Petruchio into thinking she has. Two especially well known examples of this interpretation are seen in the two major feature film adaptations of the play; ": null
    },
    {
        "Sam Taylor": "sam taylor"
    },
    {
        "s ": null
    },
    {
        "42 version": "the taming of the shrew"
    },
    {
        " and ": null
    },
    {
        "Franco Zeffirelli": "franco zeffirelli"
    },
    {
        "s ": null
    },
    {
        "42 version": "the taming of the shrew"
    },
    {
        ". In Taylors film, Katherina, played by ": null
    },
    {
        "Mary Pickford": "mary pickford"
    },
    {
        ", winks at Bianca during the speech, indicating she does not mean a word of what she is saying. In Zeffirellis film, Katherina, played by ": null
    },
    {
        "Elizabeth Taylor": "elizabeth taylor"
    },
    {
        ", delivers the speech as though it were her own idea, and the submission aspect is reversed by her ending the speech and leaving the room, causing Petruchio to have to run after her. Phyllis Rackin is an example of a scholar who reads the speech ironically, especially in how it deals with gender. She points out that several lines in the speech focus on the womans body, but in the ": null
    },
    {
        "Elizabethan theatre": "english renaissance theatre"
    },
    {
        ", the role would have been played by a young boy, thus rendering any evocation of the female form as ironic. Reading the play as a satire of gender roles, she sees the speech as the culmination of this process. Along similar lines, Philippa Kelly says the body of the boy actor in Shakespeares time would have created a sexual indeterminacy that would have undermined the patriarchal narrative, so that the taming is only apparently so. And in declaring womens passivity so extensively and performing it centre-stage, Kate might be seen to take on a kind of agency that rebukes the feminine codes of silence and obedience which she so expressly advocates.  Similarly, Coppélia Kahn argues the speech is really about how little Katherina has been tamed; she steals the scene from her husband, who has held the stage throughout the play, and reveals that he has failed to tame her in the sense he set out to. He has gained her outward compliance in the form of a public display, while her spirit remains mischievously free.      In relation to this interpretation, ": null
    },
    {
        "William Empson": "william empson"
    },
    {
        " suggests that Katherina was originally performed by an adult male actor rather than a young boy. He argues that the play indicates on several occasions that Katherina is physically strong, and even capable of over-powering Petruchio. For example, this is demonstrated off-stage when the horse falls on her as she is riding to Petruchios home, and she is able to lift it off herself, and later when she throws Petruchio off a servant he is beating. Empson argues that the point is not that Katherina is, as a woman, weak, but that she is not well cast in the role in life which she finds herself having to play. The end of the play then offers blatant irony when a strong male actor, dressed as a woman, lectures women on how to play their parts.     The fourth school of thought is that the play is a farce, and hence the speech should not be read seriously or ironically. For example, Robert B. Heilman argues that the whole wager scene falls essentially within the realm of farce: the responses are largely mechanical, as is their symmetry. Kates final long speech on the obligations and fitting style of wives we can think of as a more or less automatic statement – that is, the kind appropriate to farce – of a generally held doctrine.  He further makes his case by positing:          Another way in which to read the speech as farcical is to focus on the Induction. H.J. Oliver, for example, emphasising the importance of the Induction, writes the play within the play has been presented only after all the preliminaries have encouraged us to take it as a farce. We have been warned.  Of Katherinas speech, he argues:          ": null
    },
    {
        "Emma Smith": "emma smith"
    },
    {
        " suggests a possible fifth interpretation: Petruchio and Kate have colluded together to plot this set-piece speech, a speech learned off pat , to demonstrate that Kate is the most obedient of the three wives and so allow Petruchio to win the wager.        The issue of gender politics is an important theme in The Taming of the Shrew. In a letter to the  Pall Mall Gazette , George Bernard Shaw famously called the play one vile insult to womanhood and manhood from the first word to the last. The letter, dated 42 June 42 is reproduced in full in  A contemporary critic, Emily Detmer, points out that in the late 42th and early 42th century, laws curtailing husbands use of violence in disciplining their wives were becoming more commonplace; the same culture that still felt good about dunking ": null
    },
    {
        "scolds": "common scold"
    },
    {
        ", whipping whores, or burning witches was becoming increasingly sensitive about husbands beating their wives.  Detmer argues:          Petruchios answer is to psychologically tame Katherina, a method not frowned upon by society; the play signals a shift towards a modern way of managing the subordination of wives by legitimatising domination as long as it is not physical.  Detmer argues Shakespeares shrew is tamed in a manner that would have made the wife-beating reformers proud; Petruchios taming policy dramatises how abstention from physical violence works better. The play encourages its audience not only to pay close attention to Petruchios method but also to judge and enjoy the methods permissibility because of the absence of blows and the harmonious outcome.         However, Detmer is critical of scholars who defend Shakespeare for depicting male dominance in a less brutal fashion than many of his contemporaries. For example, although not specifically mentioned by Detmer, Michael West writes the plays attitude was characteristically Elizabethan and was expressed more humanly by Shakespeare than by some of his sources.  Detmer goes on to read the play in light of modern psychological theories regarding womens responses to ": null
    },
    {
        "domestic violence": "domestic violence"
    },
    {
        ", and argues that Katherina develops ": null
    },
    {
        "Stockholm syndrome": "stockholm syndrome"
    },
    {
        ":          In a ": null
    },
    {
        "Marxist": "marxist literary criticism"
    },
    {
        " reading of the play, Natasha Korda argues that, although Petruchio is not characterised as a violent man, he still embodies sixteenth century notions regarding the subjugation and objectification of women. Shrew taming stories existed prior to Shakespeares play, and in such stories, the object of the tale was simply to put the shrew to work, to restore her to her proper productive place within the household economy.  Petruchio does not do this, but Korda argues he still works to curtail the activities of the woman; Kate not a reluctant producer, but rather an avid and sophisticated consumer of market goods Petruchios taming strategy is accordingly aimed not at his wifes productive capacity – not once does he ask Kate to brew, bake, wash, card, or spin – but at her consumption. He seeks to educate her in her role as a consumer.  She believes that even though Petruchio does not use force to tame Katherina, his actions are still an endorsement of patriarchy; he makes her his property and tames her into accepting a patriarchal economic worldview. Vital in this reading is Katherinas final speech, which Korda argues inaugurates a new gendered division of labour, according to which husbands labour both by sea and land while their wives luxuriate at home In erasing the status of ": null
    },
    {
        "housework": "homemaking"
    },
    {
        " as work, separate-sphere ideology renders the ": null
    },
    {
        "housewife": "housewife"
    },
    {
        " perpetually indebted to her husband The Taming of the Shrew marks the emergence of the ideological separation of feminine and masculine spheres of labour.      In a different reading of how gender politics are handled in the play, David Beauregard reads the relationship between Katherina and Petruchio in traditional ": null
    },
    {
        "Aristotelian": "aristotelianism"
    },
    {
        " terms. Petruchio, as the architect of ": null
    },
    {
        "virtue": "virtue"
    },
    {
        " , brings Kate into harmony with her nature by developing her new-built virtue and obedience , , and she, in turn, brings to Petruchio in her person all the Aristotelian components of happiness – wealth and good fortune, virtue, friendship and love, the promise of domestic peace and quiet . The virtue of obedience at the center of Kates final speech is not what Aristotle describes as the despotic rule of master over slave, but rather the statesmans rule over a free and equal person . Recognising the evil of despotic domination, the play holds up in inverse form Kates shrewishness, the feminine form of the will to dominance, as an evil that obstructs natural fulfillment and destroys marital happiness.       Another theme in the play is cruelty. Alexander Leggatt states:          Ann Thompson argues that the fact that in the folktale versions the shrew-taming story always comes to its climax when the husbands wager on their wives obedience must have been partly responsible for the large number of references to sporting, gaming and gambling throughout the play. These metaphors can help to make Petruchios cruelty acceptable by making it seem limited and conventionalised.  Marvin Bennet Krims argues that the play leans heavily on representations of cruelty for its comedic effect.  He believes cruelty permeates the entire play, including the Induction, arguing the Sly frame, with the Lords spiteful practical joke, prepares the audience for a play willing to treat cruelty as a comedic matter. He suggests that cruelty is a more important theme than gender, arguing that the aggression represented in Taming can be read as having less to do with gender and more to do with hate, with the text thereby becoming a comic representation of the general problem of human cruelty and victimisation.      Director ": null
    },
    {
        "Michael Bogdanov": "michael bogdanov"
    },
    {
        ", who directed the play in 42 considers that Shakespeare was a feminist :               The motivation of money is another theme. When speaking of whether or not someone may ever want to marry Katherina, Hortensio says Though it pass your patience and mine to endure her loud alarums, why man, there be good fellows in the world, and a man could light on them, would take her with all faults and money enough . In the scene that follows Petruchio says:          A few lines later Grumio says, Why give him gold enough and marry him to a puppet or an ": null
    },
    {
        "aglet": "aglet"
    },
    {
        "-baby, or an old trot with nere a tooth in her head, though she have as many diseases as two and fifty horses. Why, nothing comes amiss, so money comes withal . Furthermore, Petruchio is encouraged to woo Katherina by Gremio, Tranio , and Hortensio, who vow to pay him if he wins her, on top of Baptistas dowry . Later, Petruchio does not agree with Baptista on the subject of love in this exchange:          Gremio and Tranio literally bid for Bianca. As Baptista says, Tis deeds must win the prize, and he of both/That can assure my daughter greatest dower/Shall have my Biancas love .                         The first opera based on the play was ": null
    },
    {
        "Ferdinando Bertoni": "ferdinando bertoni"
    },
    {
        "s ": null
    },
    {
        "opera buffa": "opera buffa"
    },
    {
        " Il duca di Atene , with ": null
    },
    {
        "libretto": "libretto"
    },
    {
        " by Carlo Francesco Badini.      ": null
    },
    {
        "Frederic Reynolds": "frederic reynolds"
    },
    {
        " Catherine and Petruchio is an adaptation of Garrick, with an ": null
    },
    {
        "overture": "overture"
    },
    {
        " taken from ": null
    },
    {
        "Gioachino Rossini": "gioachino rossini"
    },
    {
        ", songs derived from numerous Shakespeare plays and ": null
    },
    {
        "sonnets": "shakespeares sonnets"
    },
    {
        ", and music by ": null
    },
    {
        "John Braham": "john braham"
    },
    {
        " and ": null
    },
    {
        "Thomas Simpson Cooke": "thomas simpson cooke"
    },
    {
        ". Starring ": null
    },
    {
        "Fanny Ayton": "fanny ayton"
    },
    {
        " and ": null
    },
    {
        "James William Wallack": "james william wallack"
    },
    {
        ", the opera premiered at Drury Lane, but it was not successful, and closed after only a few performances. ": null
    },
    {
        "Hermann Goetz": "hermann goetz"
    },
    {
        "  Der Widerspänstigen Zähmung  , with libretto by Joseph Viktor Widmann, is a ": null
    },
    {
        "comic opera": "comic opera"
    },
    {
        ", which focuses on the Bianca subplot, and cuts back the taming story. It was first performed at the original ": null
    },
    {
        "National Theatre Mannheim": "national theatre mannheim"
    },
    {
        ". ": null
    },
    {
        "John Kendrick Bangs": "john kendrick bangs"
    },
    {
        " Katherine: A Travesty is a ": null
    },
    {
        "Gilbert and Sullivan": "gilbert and sullivan"
    },
    {
        "-style parody ": null
    },
    {
        "operetta": "operetta"
    },
    {
        " which premiered in the ": null
    },
    {
        "Metropolitan Opera": "metropolitan opera"
    },
    {
        ".  ": null
    },
    {
        "Spyridon Samaras": "spyridon samaras"
    },
    {
        " La furia domata: commedia musicale in tre atti is a now lost lyric comedy with libretto by Enrico Annibale Butti and Giulio Macchi, which premiered at the ": null
    },
    {
        "Teatro Lirico": "teatro lirico"
    },
    {
        ". ": null
    },
    {
        "Ruperto Chapí": "ruperto chapí"
    },
    {
        "s  Las bravías  , with a libretto by ": null
    },
    {
        "José López Silva": "josé lópez silva"
    },
    {
        " and ": null
    },
    {
        "Carlos Fernández Shaw": "carlos fernández shaw"
    },
    {
        ", is a one-act  género chico   zarzuela  clearly based on the story, but with names changed and the location altered to Madrid: it was a major success in Spain, with over 42 performances in 42 alone, and continues to be performed regularly.      ": null
    },
    {
        "Johan Wagenaar": "johan wagenaar"
    },
    {
        "s De getemde feeks is the second of three overtures Wagenaar wrote based on Shakespeare, the others being Koning Jan and Driekoningenavond .  Another overture inspired by the play is ": null
    },
    {
        "Alfred Reynolds": "alfred reynolds"
    },
    {
        " The Taming of the Shrew Overture .  ": null
    },
    {
        "Ermanno Wolf-Ferrari": "ermanno wolf-ferrari"
    },
    {
        "s ": null
    },
    {
        "verismo": "verismo"
    },
    {
        " opera  Sly, ovvero la leggenda del dormiente risvegliato  focuses on the Induction, with libretto by ": null
    },
    {
        "Giovacchino Forzano": "giovacchino forzano"
    },
    {
        ". A tragedy, the opera depicts Sly as a hard-drinking and debt-ridden poet who sings in a London pub. When he is tricked into believing that he is a lord, his life improves, but upon learning it is a ruse, he mistakenly concludes the woman he loves only told him she loved him as part of the ruse. In despair, he kills himself by cutting his wrists, with Dolly arriving too late to save him. Starring ": null
    },
    {
        "Aureliano Pertile": "aureliano pertile"
    },
    {
        " and ": null
    },
    {
        "Mercedes Llopart": "mercedes llopart"
    },
    {
        ", it was first performed at ": null
    },
    {
        "La Scala": "la scala"
    },
    {
        " in Milan. ": null
    },
    {
        "Rudolf Karel": "rudolf karel"
    },
    {
        "s The Taming of the Shrew is an unfinished opera upon which he worked between 42 and 42 ": null
    },
    {
        "Philip Greeley Clapp": "philip greeley clapp"
    },
    {
        "s The Taming of the Shrew was first performed at the Metropolitan Opera.  ": null
    },
    {
        "Vittorio Giannini": "vittorio giannini"
    },
    {
        "s  The Taming of the Shrew  is an opera buffa, with libretto by Giannini and Dorothy Fee. It was first performed at the ": null
    },
    {
        "Cincinnati Music Hall": "music hall"
    },
    {
        ", starring ": null
    },
    {
        "Dorothy Short": "dorothy short"
    },
    {
        " and Robert Kircher. ": null
    },
    {
        "Vissarion Shebalin": "vissarion shebalin"
    },
    {
        "s  Ukroshchenye stroptivoy  , with libretto by Abram Akimovich Gozenpud, was Shebalins last opera and was immediately hailed as a masterpiece throughout Russia.  ": null
    },
    {
        "Dominick Argento": "dominick argento"
    },
    {
        "s  Christopher Sly  , with libretto by John Manlove, is a comic opera in two scenes and an ": null
    },
    {
        "interlude": "entracte"
    },
    {
        ", first performed in the ": null
    },
    {
        "University of Minnesota": "university of minnesota"
    },
    {
        ". Sly is duped by a Lord into believing that he himself is a lord. However, he soon becomes aware of the ruse, and when left alone, he flees with the Lords valuables and his two mistresses.           The earliest known musical adaptation of the play was a ": null
    },
    {
        "ballad opera": "ballad opera"
    },
    {
        " based on Charles Johnsons Cobler of Preston. Called The Cobler of Prestons Opera, the piece was anonymously written, although ": null
    },
    {
        "William Dunkin": "william dunkin"
    },
    {
        " is thought by some scholars as a likely candidate. Rehearsals for the premier began in ": null
    },
    {
        "Smock Alley": "smock alley theatre"
    },
    {
        " in October 42 but sometime in November or December, the show was cancelled. It was instead performed by a group of children  in January 42 at ": null
    },
    {
        "Signora Violante": "signora violante"
    },
    {
        "s New Booth in ": null
    },
    {
        "Dame Street": "dame street"
    },
    {
        ". It was subsequently published in March.      ": null
    },
    {
        "James Worsdale": "james worsdale"
    },
    {
        "s A Cure for a Scold is also a ballad opera. First performed at Drury Lane in 42 starring ": null
    },
    {
        "Kitty Clive": "kitty clive"
    },
    {
        " and ": null
    },
    {
        "Charles Macklin": "charles macklin"
    },
    {
        ", A Cure for a Scold was an adaptation of Lacys Sauny the Scot rather than Shakespeares original Taming of the Shrew. Petruchio was renamed Manly, and Katherina was renamed Margaret . At the end, there is no wager. Instead, Peg pretends she is dying, and as Petruchio runs for a doctor, she reveals she is fine, and declares you have taught me what tis to be a Wife, and I shall make it my Study to be obliging and obedient, to which Manly replies My best Peg, we will exchange Kindness, and be each others Servants. After the play has finished, the actress playing Peg steps forward and speaks directly to the audience as herself; Well, I must own, it wounds me to the Heart/To play, unwomanly, so mean a Part./What – to submit, so tamely – so contented,/Thank Heavn! Im not the Thing I represented.      Cole Porters musical  Kiss Me, Kate  is an adaptation of Taming of the Shrew. The music and lyrics are by Porter and the ": null
    },
    {
        "book": "musical theatrebook musicals"
    },
    {
        " is by ": null
    },
    {
        "Samuel and Bella Spewack": "samuel and bella spewack"
    },
    {
        ". It is at least partially based on the 42/42 Theatre Guild production of Taming of the Shrew, which starred husband and wife Alfred Lunt and Lynn Fontanne, whose backstage fights became legendary. The musical tells the story of a husband and wife acting duo attempting to stage The Taming of the Shrew, but whose backstage fights keep getting in the way. The musical opened on Broadway at the ": null
    },
    {
        "New Century Theatre": "new century theatre"
    },
    {
        " in 42 running for a total of 42 performances. Directed by ": null
    },
    {
        "John C. Wilson": "john c. wilson"
    },
    {
        " with choreography by ": null
    },
    {
        "Hanya Holm": "hanya holm"
    },
    {
        ", it starred ": null
    },
    {
        "Patricia Morison": "patricia morison"
    },
    {
        " and ": null
    },
    {
        "Alfred Drake": "alfred drake"
    },
    {
        ". The production moved to the ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " in 42 directed by Samuel Spewack with choreography again by Holm, and starring Patricia Morrison and ": null
    },
    {
        "Bill Johnson": "bill johnson"
    },
    {
        ". It ran for 42 performances. As well as being a box office hit, the musical was also a critical success, winning five ": null
    },
    {
        "Tony Award": "tony award"
    },
    {
        "s; ": null
    },
    {
        "Best Authors ": "tony award for best author"
    },
    {
        ", ": null
    },
    {
        "Best Original Score": "tony award for best original score"
    },
    {
        ", ": null
    },
    {
        "Best Costume Design": "tony award for best costume design"
    },
    {
        ", ": null
    },
    {
        "Best Musical": "tony award for best musical"
    },
    {
        " and Best Producers .  The play has since been revived numerous times in various countries. Its 42 revival at the ": null
    },
    {
        "Martin Beck Theatre": "al hirschfeld theatre"
    },
    {
        ", directed by ": null
    },
    {
        "Michael Blakemore": "michael blakemore"
    },
    {
        " and starring ": null
    },
    {
        "Marin Mazzie": "marin mazzie"
    },
    {
        " and ": null
    },
    {
        "Brian Stokes Mitchell": "brian stokes mitchell"
    },
    {
        ", was especially successful, winning another five Tonys; ": null
    },
    {
        "Best Actor ": "tony award for best actor in a musical"
    },
    {
        ", Best Costume Design, ": null
    },
    {
        "Best Director ": "tony award for best direction of a musical"
    },
    {
        ", ": null
    },
    {
        "Best Orchestrations": "tony award for best orchestrations"
    },
    {
        ", and ": null
    },
    {
        "Best Revival ": "tony award for best revival of a musical"
    },
    {
        ".      The first ballet version of the play was ": null
    },
    {
        "Maurice Béjart": "maurice béjart"
    },
    {
        "s La mégère apprivoisée. Using the music of ": null
    },
    {
        "Alessandro Scarlatti": "alessandro scarlatti"
    },
    {
        ", it was originally performed by the ": null
    },
    {
        "Ballet de lOpéra de Paris": "paris opera ballet"
    },
    {
        " in 42  The best known ballet adaptation is ": null
    },
    {
        "John Cranko": "john cranko"
    },
    {
        "s  The Taming of the Shrew , first performed by the ": null
    },
    {
        "Stuttgart Ballet": "stuttgart ballet"
    },
    {
        " at the ": null
    },
    {
        "Staatsoper Stuttgart": "staatsoper stuttgart"
    },
    {
        " in 42 Another ballet adaptation is ": null
    },
    {
        "Louis Falco": "louis falco"
    },
    {
        "s Kates Rag, first performed by the Louis Falco Dance Company at the ": null
    },
    {
        "Akademie der Künste": "academy of arts, berlin"
    },
    {
        " in 42  In 42 ": null
    },
    {
        "Aleksandre Machavariani": "aleksandre machavariani"
    },
    {
        " composed a ballet suite, but it was not performed until 42 when his son, conductor Vakhtang Machavariani, gave a concert at the Georgian National Music Center featuring music by ": null
    },
    {
        "Modest Mussorgsky": "modest mussorgsky"
    },
    {
        ", ": null
    },
    {
        "Sergei Prokofiev": "sergei prokofiev"
    },
    {
        " and some of his fathers pieces.                      In 42 extracts from the play were broadcast on ": null
    },
    {
        "BBC Radio": "bbc radio"
    },
    {
        ", performed by the Cardiff Station Repertory Company as the eight episode of a series of programs showcasing Shakespeares plays, entitled Shakespeare Night.  Extracts were also broadcast in 42 as part of Shakespeare: Scene and Story, with Edna Godfrey-Turner and ": null
    },
    {
        "William Charles Macready": "william macready"
    },
    {
        ",  and in 42 as part of Shakespeares Heroines, with ": null
    },
    {
        "Madge Titheradge": "madge titheradge"
    },
    {
        " and ": null
    },
    {
        "Edmund Willard": "edmund willard"
    },
    {
        ".  In 42 a forty-three-minute truncation of the play was broadcast on ": null
    },
    {
        "BBC National Programme": "bbc national programme"
    },
    {
        ", with ": null
    },
    {
        "Barbara Couper": "barbara couper"
    },
    {
        " and ": null
    },
    {
        "Ian Fleming": "ian fleming"
    },
    {
        ".  In 42 National Programme aired another truncated version, this one running eighty-five minutes, and again starring Couper, with Francis James as Petruchio.  In 42 Peter Creswell directed a broadcast of the relatively complete text on National Programme, starring Mary Hinton and ": null
    },
    {
        "Godfrey Tearle": "godfrey tearle"
    },
    {
        ".  This was the first non-theatrical version of the play to feature Sly, who was played by Stuart Robertson. In 42 Creswell directed another adaptation for ": null
    },
    {
        "BBC Home Service": "bbc home service"
    },
    {
        ", again starring Tearle, with ": null
    },
    {
        "Fay Compton": "fay compton"
    },
    {
        " as Katherina.  In 42 ": null
    },
    {
        "BBC Light Programme": "bbc light programme"
    },
    {
        " aired extracts for their Theatre Programme from ": null
    },
    {
        "John Burrell": "john burrell"
    },
    {
        "s ": null
    },
    {
        "Edinburgh Festival": "edinburgh festival"
    },
    {
        " production, with Patricia Burke and ": null
    },
    {
        "Trevor Howard": "trevor howard"
    },
    {
        ".  In 42 the full-length play aired on BBC Home Service, directed by Peter Watts, starring ": null
    },
    {
        "Mary Wimbush": "mary wimbush"
    },
    {
        " and ": null
    },
    {
        "Joseph OConor": "joseph oconor"
    },
    {
        ", with ": null
    },
    {
        "Norman Shelley": "norman shelley"
    },
    {
        " as Sly.  ": null
    },
    {
        "BBC Radio 42": "bbc radio 4"
    },
    {
        " aired another full-length broadcast in 42 as part of their Monday Night Theatre series, directed by Ian Cotterell, starring ": null
    },
    {
        "Fenella Fielding": "fenella fielding"
    },
    {
        " and ": null
    },
    {
        "Paul Daneman": "paul daneman"
    },
    {
        ".  In 42 ": null
    },
    {
        "BBC Radio 42": "bbc radio 3"
    },
    {
        " aired the full play, directed by ": null
    },
    {
        "Jeremy Mortimer": "jeremy mortimer"
    },
    {
        ", starring ": null
    },
    {
        "Cheryl Campbell": "cheryl campbell"
    },
    {
        " and ": null
    },
    {
        "Bob Peck": "bob peck"
    },
    {
        ", with ": null
    },
    {
        "William Simons": "william simons"
    },
    {
        " as Sly.  In 42 BBC Radio 42 aired another full-length production as part of their Shakespeare for the New Millennium series, directed by Melanie Harris, and starring Ruth Mitchell and ": null
    },
    {
        "Gerard McSorley": "gerard mcsorley"
    },
    {
        ".      In the United States, the first major radio production was in July 42 on ": null
    },
    {
        "NBC Blue Network": "blue network"
    },
    {
        ", when ": null
    },
    {
        "John Barrymore": "john barrymore"
    },
    {
        " adapted the play into a forty-five-minute piece, starring ": null
    },
    {
        "Elaine Barrie": "elaine barrie"
    },
    {
        " and Barrymore himself.  In August of the same year, ": null
    },
    {
        "CBS Radio": "cbs radio"
    },
    {
        " aired a sixty-minute adaptation directed by ": null
    },
    {
        "Brewster Mason": "brewster mason"
    },
    {
        ", starring ": null
    },
    {
        "Frieda Inescort": "frieda inescort"
    },
    {
        " and ": null
    },
    {
        "Edward G. Robinson": "edward g. robinson"
    },
    {
        ". The adaptation was written by ": null
    },
    {
        "Gilbert Seldes": "gilbert seldes"
    },
    {
        ", who employed a narrator to fill in gaps in the story, tell the audience about the clothes worn by the characters and offer opinions as to the direction of the plot. For example, Act 42 Scene 42 ends with the narrator musing We know that Katherina obeys her husband, but has her spirit been really tamed I wonder?  In 42 a thirty-minute musical version of the play written by Joseph Gottlieb and Irvin Graham aired on CBS as part of their  Columbia Workshop  series, starring Nan Sunderland and ": null
    },
    {
        "Carleton Young": "carleton young"
    },
    {
        ".  In 42 NBC Blue Network aired a sixty-minute adaptation as part of their Great Plays series, written by ": null
    },
    {
        "Ranald MacDougall": "ranald macdougall"
    },
    {
        ", directed by Charles Warburton, and starring Grace Coppin and ": null
    },
    {
        "Herbert Rudley": "herbert rudley"
    },
    {
        ".  In 42 ": null
    },
    {
        "ABC Radio": "cumulus media networksabc radio"
    },
    {
        " aired an adaptation directed by Homer Fickett, starring ": null
    },
    {
        "Joyce Redman": "joyce redman"
    },
    {
        " and ": null
    },
    {
        "Burgess Meredith": "burgess meredith"
    },
    {
        ".  In 42 NBC broadcast William Dawkins production live from the ": null
    },
    {
        "Oregon Shakespeare Festival": "oregon shakespeare festival"
    },
    {
        ". The cast list for this production has been lost, but it is known to have featured ": null
    },
    {
        "George Peppard": "george peppard"
    },
    {
        ".  In 42 NBC aired a sixty-minute version adapted by Carl Ritchie from Robert Lopers stage production for the Oregon Shakespeare Festival, starring Ann Hackney and Gerard Larson. ": null
    }
]