[
    {
        "         The Scarlet Pimpernel is the first novel in a series of ": null
    },
    {
        "historical fiction": "historical fiction"
    },
    {
        " by ": null
    },
    {
        "Baroness Orczy": "baroness orczy"
    },
    {
        ", published in 42 It was written after her stage play of the same title enjoyed a long run in London, having opened in Nottingham in 42     The novel is set during the ": null
    },
    {
        "Reign of Terror": "reign of terror"
    },
    {
        " following the start of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". The title is the  nom de guerre  of its hero and protagonist, a chivalrous Englishman who rescues aristocrats before they are sent to the guillotine. Sir Percy Blakeney leads a ": null
    },
    {
        "double life": "double life"
    },
    {
        ": apparently nothing more than a wealthy ": null
    },
    {
        "fop": "fop"
    },
    {
        ", but in reality a formidable swordsman and a quick-thinking escape artist. The band of gentlemen who assist him are the only ones who know of his secret identity. He is known by his symbol, a simple flower, the scarlet pimpernel . Marguerite Blakeney, his French wife, does not share his secret. She is approached by the new French envoy to England, Chauvelin, with a threat to her brothers life if she does not aid in the search for the Pimpernel. She aids him, and then discovers that the Pimpernel is also very dear to her. She sails to France to stop the envoy.     Opening at the ": null
    },
    {
        "New Theatre": "noël coward theatre"
    },
    {
        " in Londons ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " on January 42 42 the play became a favourite of British audiences, eventually playing more than 42 performances and becoming one of the most popular shows staged in Britain.     Orczys premise of a daring hero who cultivates a ": null
    },
    {
        "secret identity": "secret identity"
    },
    {
        " disguised by a meek or ineffectual manner proved enduring. ": null
    },
    {
        "Zorro": "zorro"
    },
    {
        ", ": null
    },
    {
        "The Shadow": "the shadow"
    },
    {
        ", ": null
    },
    {
        "The Phantom": "the phantom"
    },
    {
        ", ": null
    },
    {
        "Superman": "superman"
    },
    {
        " and ": null
    },
    {
        "Batman": "batman"
    },
    {
        " followed within a few decades, and the ": null
    },
    {
        "trope": "trope"
    },
    {
        " remains a popular one in ": null
    },
    {
        "serial fiction": "serial"
    },
    {
        " today.               The Scarlet Pimpernel is set in 42 during the early stages of the ": null
    },
    {
        "French Revolution": "french revolution"
    },
    {
        ". Marguerite St. Just, a beautiful French actress, is the wife of wealthy English ": null
    },
    {
        "fop": "fop"
    },
    {
        " Sir Percy Blakeney, a ": null
    },
    {
        "baronet": "baronet"
    },
    {
        ". Before their marriage, Marguerite took revenge upon the Marquis de St. Cyr, who had ordered her brother to be beaten for his romantic interest in the Marquis daughter, with the unintended consequence of the Marquis and his sons being sent to the ": null
    },
    {
        "guillotine": "guillotine"
    },
    {
        ". When Percy found out, he became estranged from his wife. Marguerite, for her part, became disillusioned with Percys shallow, ": null
    },
    {
        "dandy": "dandy"
    },
    {
        "ish lifestyle.     Meanwhile, the League of the Scarlet Pimpernel , a ": null
    },
    {
        "secret society": "secret society"
    },
    {
        " of twenty English aristocrats, one to command, and nineteen to obey , is engaged in rescuing their French counterparts from the daily executions of the ": null
    },
    {
        "Reign of Terror": "reign of terror"
    },
    {
        ". Their leader, the mysterious Scarlet Pimpernel, takes his nickname from the ": null
    },
    {
        "small red flower": "anagallis arvensis"
    },
    {
        " he draws on his messages. Despite being the talk of London society, only his followers and possibly the ": null
    },
    {
        "Prince of Wales": "george iv of the united kingdom"
    },
    {
        " know the Pimpernels true identity. Like many others, Marguerite is entranced by the Pimpernels daring exploits.        At a ball attended by the Blakeneys, a verse by Percy about the elusive Pimpernel makes the rounds and amuses the other guests. Meanwhile, Marguerite is ": null
    },
    {
        "blackmail": "blackmail"
    },
    {
        "ed by ": null
    },
    {
        "Citizen Chauvelin": "citizen chauvelin"
    },
    {
        ", the wily new French envoy to England. Chauvelins agents have stolen a letter proving her beloved brother Armand is in league with the Pimpernel. Chauvelin offers to trade Armands life for her help against the Pimpernel. Contemptuous of her seemingly witless and unloving husband, Marguerite does not go to him for help or advice. Instead, she passes along information which enables Chauvelin to learn the Pimpernels true identity.     Later that night, Marguerite finally tells her husband of the terrible danger threatening her brother and pleads for his assistance. Percy promises to save him. After Percy unexpectedly leaves for France, Marguerite discovers to her horror that he is the Pimpernel. He had hidden behind the persona of a dull, slow-witted fop to deceive the world. He had not told Marguerite because of his worry that she might betray him, as she had the Marquis de St. Cyr. Desperate to save her husband, she decides to pursue Percy to France to warn him that Chauvelin knows his identity and his purpose. She persuades Sir Andrew Ffoulkes to accompany her, but because of the tide and the weather, neither they nor Chauvelin can leave immediately.     At ": null
    },
    {
        "Calais": "calais"
    },
    {
        ", Percy openly approaches Chauvelin in the Chat gris, a decrepit inn whose owner is in Percys pay. Despite Chauvelins best efforts, the Englishman manages to escape by offering Chauvelin a pinch of ": null
    },
    {
        "snuff": "snuff"
    },
    {
        ", which turns out to be pure pepper. Through a bold plan executed right under Chauvelins nose, Percy rescues Marguerites brother Armand and the Comte de Tournay, the father of a schoolfriend of Marguerites. Marguerite pursues Percy right to the very end, resolute that she must either warn him or share his fate. Percy, heavily disguised, is captured by Chauvelin, who does not recognise him so he is able to escape.     With Marguerites love and courage amply proven, Percys ardour is rekindled. Safely back on board their schooner, the Day Dream, the happily reconciled couple returns to England. Sir Andrew marries the counts daughter, Suzanne.       Sir Percy Blakeney: He is a wealthy English ": null
    },
    {
        "baronet": "baronet"
    },
    {
        " who rescues individuals sentenced to death by the ": null
    },
    {
        "guillotine": "guillotine"
    },
    {
        ". He soon reveals himself to be a master of disguise, an imaginative planner, a formidable swordsman and a quick-thinking escape artist. With each rescue he taunts his enemies by leaving behind a card showing a small flower—a scarlet pimpernel. The identity of the Scarlet Pimpernel thus becomes a topic of widespread popular interest and the hero himself becomes the subject of an international manhunt by the French revolutionary authorities. To hide his true identity, Sir Percy presents himself in everyday life as a dim-witted, foppish playboy. His secret is kept by a band of friends known as the League of the Scarlet Pimpernel. The league operates as an undercover team in enacting Sir Percys rescue plans.   Marguerite Blakeney, née St Just: She is the wife of Sir Percy. She leads London society with her beauty, style and intelligence. She was an actress in Paris, where she held salons to discuss the issues of the day. She was not an aristocrat in French society. She is 42 years old.   Armand St Just: Older brother of Marguerite, who raised her after their parents died. He is a gentleman and a republican in France, but his views of the slaughter of the aristocracy do not match the times.   ": null
    },
    {
        "Citizen Chauvelin": "citizen chauvelin"
    },
    {
        ": Newly appointed envoy to England from Revolutionary France. He seeks the Scarlet Pimpernel, who is allowing aristocrats to escape their fate under the new regime.   Sir Andrew Ffoulkes: Friend of Sir Percy who aids Marguerite when she realizes her mistake. He falls in love with an émigrée, a girl who had been at school with Marguerite.   Suzanne: Daughter of Comte de Tournay, also a friend of Marguerites; she is the love interest of Sir Andrew Ffoulkes.       The title character, Sir Percy Blakeney, a wealthy English fop who transforms into a formidable swordsman and a quick-thinking escape artist, established the hero with a ": null
    },
    {
        "secret identity": "secret identity"
    },
    {
        " in popular culture, a trope that would be seen in subsequent literary creations such as Don Diego de la Vega , Kent Allard/Lamont Cranston  and Bruce Wayne .  The Scarlet Pimpernel exhibits characteristics that would become standard superhero conventions, including the penchant for disguise, use of a signature weapon , ability to out-think and outwit his adversaries, and a calling card .  By drawing attention to his alter ego Blakeney he hides behind his public face as a slow thinking foppish playboy , and he also establishes a network of supporters, The League of the Scarlet Pimpernel, that aid his endeavours.     The popular success of the novel is considered to be based on the myth of the aristocratic hero with a double life, along with the love story and conflict of loyalties.  Dugan says that Behind the wigs and ": null
    },
    {
        "Mechlin": "mechelen"
    },
    {
        " lace cuffs lies an enduring human story of love, misunderstandings, conflict of loyalties, audacious bravery – and a dramatic double life. and this is a major part of the storys enduring popularity. Another aspect is the Englishness of the hero in the era when the ": null
    },
    {
        "British Empire": "british empire"
    },
    {
        " began to shrink.           As a writer, Orczy often alluded to historical events and figures but adapted these freely in creating her tales.     ": null
    },
    {
        "Citizen Chauvelin": "citizen chauvelin"
    },
    {
        ", the recurring villain of the Scarlet Pimpernel series, is based to some extent on the real-life ": null
    },
    {
        "Bernard-François, marquis de Chauvelin": "bernard-françois, marquis de chauvelin"
    },
    {
        ", who survived the Revolutionary period to serve as an official under ": null
    },
    {
        "Napoleon": "napoleon"
    },
    {
        ". He was a noted liberal Deputy under the ": null
    },
    {
        "Bourbon Restoration": "bourbon restoration"
    },
    {
        ".     Other historical figures who appear in Orczys Pimpernel series include:        : ": null
    },
    {
        "Maximilien Robespierre": "maximilien robespierre"
    },
    {
        "   : ": null
    },
    {
        "Louis Antoine de Saint-Just": "louis antoine de saint-just"
    },
    {
        "   : ": null
    },
    {
        "Jean-Lambert Tallien": "jean-lambert tallien"
    },
    {
        "   : ": null
    },
    {
        "Thérésa Tallien": "thérésa tallien"
    },
    {
        "   : ": null
    },
    {
        "Georges Danton": "georges danton"
    },
    {
        "   : ": null
    },
    {
        "François Chabot": "françois chabot"
    },
    {
        "   : ": null
    },
    {
        "Fabre dÉglantine": "fabre déglantine"
    },
    {
        "   : ": null
    },
    {
        "The Prince of Wales": "george iv"
    },
    {
        "   : ": null
    },
    {
        "Claude Basire": "claude basire"
    },
    {
        "   : ": null
    },
    {
        "Jean, Baron de Batz": "jean, baron de batz"
    },
    {
        "   : ": null
    },
    {
        "Jean-Paul Marat": "jean-paul marat"
    },
    {
        "   : ": null
    },
    {
        "Paul Barras": "paul barras"
    },
    {
        "   : ": null
    },
    {
        "Georges Couthon": "georges couthon"
    },
    {
        "   : ": null
    },
    {
        "Bertrand Barère": "bertrand barère"
    },
    {
        "   : ": null
    },
    {
        "Éléonore Duplay": "éléonore duplay"
    },
    {
        "   : ": null
    },
    {
        "Collot dHerbois": "collot dherbois"
    },
    {
        "           Orczys original play, The Scarlet Pimpernel, was produced and adapted by ": null
    },
    {
        "Julia Neilson": "julia neilson"
    },
    {
        " and ": null
    },
    {
        "Fred Terry": "fred terry"
    },
    {
        ". It opened on 42 October 42 at Nottinghams ": null
    },
    {
        "Theatre Royal": "theatre royal, nottingham"
    },
    {
        " and was not a success. Terry, however, had confidence in the play and, with a rewritten last act, took it to Londons ": null
    },
    {
        "West End": "west end theatre"
    },
    {
        " where it opened at the ": null
    },
    {
        "New Theatre": "noël coward theatre"
    },
    {
        " on 42 January 42 The premier of the London production was enthusiastically received by the audience, but critics considered the play old-fashioned. In spite of negative reviews, the play became a popular success, running 42 performances and enjoying numerous revivals. The Scarlet Pimpernel became a favourite of London audiences, playing more than 42 performances and becoming one of the most popular shows staged in the United Kingdom.      The novel The Scarlet Pimpernel was published two years after the play opened and was an immediate success. Orczy gained a following of readers in Britain and throughout the world. The popularity of the novel encouraged her to write a number of sequels for her reckless daredevil over the next 42 years. The play was performed to great acclaim in France, Italy, Germany and Spain, while the novel was popular across the former British empire and translated into 42 languages. Subsequently, the story has been adapted for television, film, a ": null
    },
    {
        "musical": "the scarlet pimpernel"
    },
    {
        " and other media.     The international success of The Scarlet Pimpernel allowed Orczy and her husband to live out their lives in luxury. Over the years, they lived on an estate in ": null
    },
    {
        "Kent": "kent"
    },
    {
        ", a bustling London home and an opulent villa in ": null
    },
    {
        "Monte Carlo": "monte carlo"
    },
    {
        ". Orczy wrote in her autobiography, Links in the Chain of Life:       I have so often been asked the question: But how did you come to think of The Scarlet Pimpernel? And my answer has always been: It was Gods will that I should. And to you moderns, who perhaps do not believe as I do, I will say, In the chain of my life, there were so many links, all of which tended towards bringing me to the fulfillment of my destiny.         Orczy wrote numerous sequels, none of which became as famous as The Scarlet Pimpernel. Many of the sequels revolve around French characters whom Sir Percy has met and is attempting to rescue. His followers, such as Lord Tony Dewhurst, Sir Andrew Ffoulkes, Lord Hastings, and Armand St. Just , also take their turn in major roles.     In addition to the direct sequels about Sir Percy and his league, Orczys related books include  The Laughing Cavalier  and  The First Sir Percy  , about an ancestor of the Pimpernels;  Pimpernel and Rosemary  , about a descendant; and  The Scarlet Pimpernel Looks at the World  , a depiction of the 42s world from the point of view of Sir Percy.     Some of her non-related Revolutionary-period novels reference the Scarlet Pimpernel or the League, most notably  The Bronze Eagle  .       The Scarlet Pimpernel    I Will Repay     The Elusive Pimpernel     Eldorado     Lord Tonys Wife     The Triumph of the Scarlet Pimpernel     Sir Percy Hits Back     A Child of the Revolution     The Way of the Scarlet Pimpernel     Sir Percy Leads the Band     Mamzelle Guillotine         The League of the Scarlet Pimpernel     Adventures of the Scarlet Pimpernel         The Scarlet Pimpernel etc.  collection of four novels    The Gallant Pimpernel  collection of four novels    The Scarlet Pimpernel Omnibus  collection of four novels        The Laughing Cavalier     The First Sir Percy     Pimpernel and Rosemary     The Scarlet Pimpernel Looks at the World        The Life and Exploits of the Scarlet Pimpernel, a fictional biography of Percy Blakeney published in 42 named the nineteen members of the League of the Scarlet Pimpernel.    The original nine League or founder members who formed the party on 42 August 42: Sir Andrew Ffoulkes , Lord Anthony Dewhurst, Lord Edward Hastings, Lord John Bathurst, Lord Stowmarries, Sir Edward Mackenzie, Sir Philip Glynde, Lord Saint Denys, and Sir Richard Galveston.   Ten members enrolled in January 42: Sir Jeremiah Wallescourt, Lord Kulmstead, Lord George Fanshawe, Anthony Holte, John Hastings , Lord Everingham, Sir George Vigor, Bart, The Honorable St John Devinne, Michael Barstow of York, and Armand St Just .     Marguerite, Lady Blakeney, is also named as a member of the League in the book  Mamzelle Guillotine , but it is not known when she was formally enrolled.       Orczy did not publish her Pimpernel stories as a strict chronological series, and in fact, the settings of the books in their publication sequence may vary forward or backward in time by months or ": null
    },
    {
        "centuries": "century"
    },
    {
        ". While some readers enjoy following the authors development of the Pimpernel character as it was realised, others prefer to read the stories in historical sequence. Taking into account occasional discrepancies in the dates of events referred to in the stories, the following is an approximate chronological listing of Orczys Scarlet Pimpernel novels and short stories:              Hollywood took to the Pimpernel early and often, although most of the Pimpernel movies have been based on a melange of the original book and another Orczy novel, ": null
    },
    {
        "Eldorado": "eldorado"
    },
    {
        ". The best known of the Pimpernel movies is the 42 ": null
    },
    {
        "The Scarlet Pimpernel": "the scarlet pimpernel"
    },
    {
        " starring Leslie Howard , which is considered the definitive adaptation by some.       thu in The Scarlet Pimpernel   The Scarlet Pimpernel starring Dustin Farnum , Winifred Kingston and William Burress   ": null
    },
    {
        "The Laughing Cavalier": "laughing cavalier"
    },
    {
        "   The Elusive Pimpernel": "the elusive pimpernel"
    },
    {
        " starring Cecil Humphreys , Maire Blanche and Norman Page   The Triumph of the Scarlet Pimpernel starring Matheson Lang   ": null
    },
    {
        "The Scarlet Pimpernel": "the scarlet pimpernel"
    },
    {
        " starring Leslie Howard , Merle Oberon and Raymond Massey   ": null
    },
    {
        "The Return of the Scarlet Pimpernel": "the return of the scarlet pimpernel"
    },
    {
        " starring Barry K. Barnes , Sophie Stewart and Francis Lister   ": null
    },
    {
        " Pimpernel Smith": "pimpernel   smith"
    },
    {
        " ,  starring Leslie Howard, Mary Morris and Francis L. Sullivan   Pimpernel Svensson starring Edvard Persson , Aurore Palmgren and Ivar Wahlgren   ": null
    },
    {
        "The Elusive Pimpernel": "the elusive pimpernel"
    },
    {
        " , aka The Fighting Pimpernel in the US, starring David Niven , Margaret Leighton and Cyril Cusack   ": null
    },
    {
        "Dont Lose Your Head": "dont lose your head"
    },
    {
        "  starring Sid James , Kenneth Williams and Jim Dale   The Elusive Pimpernel starring Anton Rodgers , Diane Fletcher and Bernard Hepton   ": null
    },
    {
        "The Scarlet Pimpernel": "the scarlet pimpernel"
    },
    {
        " starring Anthony Andrews , Jane Seymour and Ian McKellen       ": null
    },
    {
        "The Scarlet Pimpernel": "the scarlet pimpernel"
    },
    {
        " , a 42 Broadway musical composed by Frank Wildhorn and written by Nan Knighton , the production starred Douglas Sills as Sir Percy Blakeney, Christine Andreas as Marguerite Blakeney, and Terrence Mann as Citizen Chauvelin   The Scarlet Pimpernel , a Broadway-style Japanese adaptation, performed by the popular all-womens Takarazuka Revue in Hyogo and Tokyo, Japan   The Scarlet Pimpernel , the Broadway 42 version translated into Japanese, performed by Umeda Arts Theatre in Osaka and Tokyo, Japan       ": null
    },
    {
        "The Scarlet Pimpernel": "the scarlet pimpernel"
    },
    {
        " starring Marius Goring , Stanley Van Beers & Patrick Troughton   The Scarlet Pimpernel   Den Røde Pimpernell , Norwegian television series, broadcast by NRK Den røde pimpernell - IMDb.com https://www.imdb.com/title/tt42/   ": null
    },
    {
        "The Scarlet Pimpernel": "the scarlet pimpernel"
    },
    {
        " , starring Anthony Andrews as Sir Percy, Jane Seymour as Marguerite, and Ian McKellen as Chauvelin   ": null
    },
    {
        "The Scarlet Pimpernel": "the scarlet pimpernel"
    },
    {
        ", two TV series of three episodes each : 42Cite news|urlhttp://find.galegroup.com/dmha/infomark.do? & sourcegale & prodIdDMHA & userGroupNamesu_uk & tabIDT42 & docPagearticle & searchTypeAdvancedSearchForm & docIdEE42 & typemultipage & contentSetLTO & version42|titlePercy, top of the fops|lastPaterson|firstPeter|dateJanuary 42 42|workDaily Mail|access-dateJanuary 42 42cite web|urlhttps://archive.org/details/The_Scarlet_Pimpernel|titleThe_Scarlet_Pimpernel|author|date|publisher|accessdate42 March 42|viaInternet Archivecite web|urlhttp://www.bbc.co.uk/programmes/b42hp42cv|titleEpisode 42 The Scarlet Pimpernel, Drama - BBC Radio 42|author|date|websiteBBC|accessdate42 March 42cite news |urlhttp://www.espnscrum.com/ireland/rugby/story/42html |titleIreland great Jack Kyle passes away |workESPN Scrum |date42 November 42 |accessdate42 November 42cite book |author42Hibbin, Sally |author42Hibbin, Nina |titleWhat a Carry On: The Official History of the Carry On Film Series |publisherHamlyn |locationLondon |year42 |isbn42424242 |pages42–42cite book |authorScott, Professor Derek B |year42 |titleThe Ashgate Research Companion to Popular Musicology |page42 |publisherAshgate Publishingcite book |author42Everett, William A |author42Block, Geoffrey Holden |urlhttps://books.google.com/books?idPOXH42_IE42ooC & pgPA42 & lpgPA42 & dq%42Scarlet+Pimpernel%42+%42red+shadow%42 |titleSigmund Romberg |page42 |locationNew Haven |publisherYale University Press |year42 |isbn4242424242cite web |urlhttp://www.collectionscanada.ca/publications/42/4242-e.html |titleThe Archivist |publisherLibrary and Archives Canada |date42 April 42 |accessdate42 October 42cite web |urlhttp://www.tvarchive.ca/database/42/wayne_and_shuster_show,_the/episode_guide/ |titleEpisode Guide for the Wayne and Shuster Show |publisherTV Archive Canada |year42 |accessdate42 February 42cite magazine|authorBarnes, Tania |urlhttp://www.libraryjournal.com/article/CA42html |titleQ & A: Lauren Willig |magazineLibrary Journal |date42 November 42 |url-statusdead |archiveurlhttps://web.archive.org/web/42/http://www.libraryjournal.com/article/CA42html |archivedate42 December 42 cite web |urlhttp://sjgames.com/gurps/books/ScarletPimpernel/ |titleSteve Jackson Games |publisherSjgames.com |accessdate42 March 42cite journal |titleWriters for Children XIII: Geoffrey Trease |journalThe School Librarian and School Library Review |volume42 |year42 |page42cite news |urlhttps://www.telegraph.co.uk/news/worldnews/africaandindianocean/botswana/42/Scarlet-Pimpernel-is-last-hope-for-death-row-woman.html |titleScarlet Pimpernel is last hope for death row woman |newspaperThe Telegraph |date42 January 42 |accessdate42 February 42 |authorButcher, TimInterlanguage link multi|Hjemmefronten|nlcite web|urlhttp://www.commonwealthclub.org/archive/42thcentury/4242baez-speech.html |titleHuman Rights in the 42s: Seeing through both eyes |authorlinkJoan Baez |authorBaez, Joan |publisherCommonwealth Club of California |date42 November 42 |url-statusdead |archiveurlhttps://web.archive.org/web/42/http://www.commonwealthclub.org/archive/42thcentury/4242baez-speech.html |archivedate42 September 42 cite magazine |magazineTime Magazine |urlhttp://www.time.com/time/magazine/article/42,42.html |titleThe Black Pimpernel |date42 August 42 |url-accesssubscription |accessdate42 February 42cite news |newspaperThe New York Times |urlhttps://www.nytimes.com/42/42/42/world/africa/nelson-mandela_obit.html?hp & pagewantedall & _r42 |titleNelson Mandela, South Africas Liberator as Prisoner and President, Dies at 42 |date42 December 42 |accessdate42 February 42cite web |publisher Fairness & Accuracy in Reporting |urlhttp://www.fair.org/blog/42/42/42/nyt-takes-mandelas-death-as-a-chance-to-mock-his-fight-to-free-his-country/ |titleNYT Takes Mandelas Death as a Chance to Mock His Fight to Free His Country |authorNaureckas, Jim |date42 December 42 |accessdate42 February 42cite web |urlhttp://www42yadvashem.org/search/index_search.html |titleYad Vashem database |quote who saved the lives of tens of thousands of Jews in Budapest during World War II ... and put some 42 Jews into 42 safe houses. |accessdate42 February 42 |publisher Yad Vashem |archiveurl https://web.archive.org/web/42/http://www42yadvashem.org/search/index_search.html |archivedate 42 February 42cite book |author42Linnéa, Sharon |titleRaoul Wallenberg: The Man Who Stopped Death |publisherJewish Publication Society of America |date42 May 42 |isbn4242cite book|last42Sampson|first42Anthony|titleMandela: The Authorized Biography|date42–42|publisherHarperPress|location4242 Fulham Palace Road, Hammersmith, London W42 42JB|isbn4242424242|page42": null
    }
]