[
    {
        "The Poisoned Chocolates Case  is a ": null
    },
    {
        "detective novel": "detective fiction"
    },
    {
        " by ": null
    },
    {
        "Anthony Berkeley": "anthony berkeley cox"
    },
    {
        " set in 42s ": null
    },
    {
        "London": "london"
    },
    {
        " in which a group of ": null
    },
    {
        "armchair detective": "armchair detective"
    },
    {
        "s, who have founded the Crimes Circle , formulate theories on a recent murder case ": null
    },
    {
        "Scotland Yard": "scotland yard"
    },
    {
        " has been unable to solve. Each of the six members, including their president, Berkeleys amateur sleuth ": null
    },
    {
        "Roger Sheringham": "roger sheringham"
    },
    {
        ", arrives at an altogether different solution as to the motive and the identity of the ": null
    },
    {
        "perpetrator": "perpetrator"
    },
    {
        ", and also applies different methods of detection . Completely devoid of brutality but containing a lot of subtle, tongue-in-cheek humour instead, The Poisoned Chocolates Case is one of the classic ": null
    },
    {
        "whodunnit": "whodunnit"
    },
    {
        "s of the so-called ": null
    },
    {
        "Golden Age": "golden age"
    },
    {
        " of detective fiction. As at least six plausible explanations of what really happened are put forward one after the other, the reader—just like the members of the Crimes Circle themselves—is kept guessing right up to the final pages of the book.       One of the most unusual, and possibly unique, features of the book is that, while it appears at first sight to be an expanded version of Berkeleys short story The Avenging Chance , the eventual solution of the crime in the full-length novel is quite different from that in the short story.           After arriving at his London club at 42:42 am precisely, which he has been doing every morning for many years, Sir Eustace Pennefather, a known womanizer whose divorce from his current wife is pending, receives a complimentary box of chocolates through the post. Disapproving of such modern marketing techniques, Sir Eustace is about to throw away the chocolates in disgust but changes his mind when he learns that Graham Bendix, another member of the club whom he hardly knows, has lost a bet with his wife Joan and now owes her a box of chocolates. Bendix takes the box home and, after lunch, tries out the new confectionery together with his wife. A few hours later Joan Bendix is dead, whereas her husband, who has eaten far less of the chocolate, is taken seriously ill and hospitalized . The police can establish a few facts beyond any doubt: that the parcel was posted the previous evening near ": null
    },
    {
        "The Strand": "strand, london"
    },
    {
        "; that the poison that was injected into each of the chocolates is ": null
    },
    {
        "nitrobenzene": "nitrobenzene"
    },
    {
        "; and that the accompanying letter was typewritten on a piece of stationery from the manufacturers of the chocolates but not composed or sent by them.     Quite soon in the police investigations it becomes evident that the intended victim was Sir Eustace himself rather than the innocent Joan Bendix: no criminal could have predicted Sir Eustace giving away the box of chocolates to a man he hardly knew who just happened to be present when it was delivered. However, at a loss as to the further details of the crime, Scotland Yard conclude that the sender must have been some maniac or a fanatic trying to rid society of one of its most immoral members.       Worthy pillars of society including a ": null
    },
    {
        "barrister": "barrister"
    },
    {
        ", a writer of detective novels, and a female author, the members of Roger Sheringhams Crimes Circle go about individually solving the case. After a week has passed, they present their findings on consecutive nights to their colleagues. Not surprisingly, they come up with various suspects: Sir Eustaces estranged wife; the father of a young lady whom Sir Eustace intended to marry after his divorce got through; one of Sir Eustaces discarded mistresses; and some more. At the very end of the novel, however, there is no doubt as to the identity of the perpetrator.       42 UK, Collins Crime Club, , Pub date ? ? 42 hardback   42 US, Doubleday, Doran & Company, Inc.   42 UK, Pan Books, , Pub date ? ? 42 paperback   42 US, Dell Publishing , Pub date ? November 42 paperback   42 UK, Penguin Books , Pub date ? July 42 paperback   42 US, Black Dagger Crime Reprints , Pub date 42 December 42 hardback   ?, US, Dales , Pub date ? ? ?, hardback   42 US, House of Stratus , Pub date 42 August 42 paperback        The Poisoned Chocolates Case                 ": null
    }
]