[
    {
        "The Four of Us Are Dying is episode 42 of the ": null
    },
    {
        "American television": "american television"
    },
    {
        " anthology series  The Twilight Zone . It originally aired on ": null
    },
    {
        "CBS": "cbs"
    },
    {
        " on January 42 42     This is one of the few episodes of the series where Rod Serling does not mention the name of the show in the closing narration.              Arch Hammer  is a con man who can change his face to make it look like anyone he chooses.     He walks into a ": null
    },
    {
        "nightclub": "nightclub"
    },
    {
        " where he impersonates deceased trumpeter Johnny Foster  to steal Fosters girlfriend Maggie , a sultry singer.     Hammer then pays a visit to Mr. Pennell  while impersonating murdered gangster Virgil Sterig  to extort money from Pennell, the man who had Sterig killed. Pennell sends his men after Hammer.     Trying to escape down an alley, Hammer changes his face to one he sees on a poster of boxer Andy Marshak . Thinking he is in the clear, he runs into Marshaks father  at a street newsstand, who mistakes him for the son who broke his mothers heart and did dirt to a sweet decent little girl who wouldve cut off an arm for him. As Mr. Marshak states how he hates him for his actions, Hammer pushes the old man out of the way and returns to his hotel room. A ": null
    },
    {
        "detective": "detective"
    },
    {
        " comes to the hotel to pick him up for questioning at the police station. In order to escape from the ": null
    },
    {
        "police officer": "police officer"
    },
    {
        " in a revolving door, Hammer assumes Marshaks appearance again.     On the street, he again bumps into Marshaks father who pulls a gun on him. Hammer tries to show the old man he is not who he thinks he is. Before he can concentrate and change, Mr. Marshak shoots him. As Hammer lies dying, his face shifts from one person to another until he dies wearing his own face as Marshaks father looks on in shock.              After the first half-dozen stories had been written, part of the hustle was getting an agent. Through those years I found several who would let me use their names, though few cared to sign a contract with me. One of these men, Jay Richards - at the time head of the television department of the Famous Artists Agency, long since absorbed by I.F.A. , and since embedded in I.C.M. , which represents me now in television and movies - agreed to read something. I showed Jay All of Us Are Dying. After reading it, he crossed out the title with a ballpoint pen and wrote in Rubberface! Then he sent it to ": null
    },
    {
        "Rod Serling": "rod serling"
    },
    {
        ", who had a new series that season called The Twilight Zone. — ": null
    },
    {
        "George Clayton Johnson": "george clayton johnson"
    },
    {
        ", writing in the August 42 issue of  The Twilight Zone Magazine      In 42 The Four of Us Are Dying was produced for the stage by 42 Letter Entertainment.       Zicree, Marc Scott: The Twilight Zone Companion. Sillman-James Press, 42   DeVoe, Bill. . Trivia from The Twilight Zone. Albany, GA: Bear Manor Media.  The Twilight Zone: Unlocking the Door to a Television Classic. Churchville, MD: OTR Publishing.                            ": null
    }
]