[
    {
        "              The Moonies were an ": null
    },
    {
        "alternative rock": "alternative rock"
    },
    {
        " band from ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        ", England, who existed from 42 to 42       Steve Banks   Ryan Clarke   Mike Berry   Steve Charmley       Steve Banks, Ryan Clarke and Mike Berry were teenagers when they first began playing. Steve and Ryan recorded an ": null
    },
    {
        "album": "album"
    },
    {
        " as The Moggs in 42 with drummer Chris Marooth for Foulplay Records and a UK tour to promote the album went ahead with Mike on drums, although the record label and band agreed to pull out of the recording contract. In 42 they changed their name to The Moonies, a name inspired by Banks affection and admiration of ": null
    },
    {
        "Keith Moon": "keith moon"
    },
    {
        " and were signed by Plastic Boot Records under the music management company Tri-Tone and Music Publisher ": null
    },
    {
        "EMI": "emi"
    },
    {
        ". They released several ": null
    },
    {
        "singles": "single"
    },
    {
        " in the ": null
    },
    {
        "UK": "united kingdom"
    },
    {
        " in 42 and 42 and played shows alongside popular bands including ": null
    },
    {
        "The Libertines": "the libertines"
    },
    {
        ", ": null
    },
    {
        "Juliette & The Licks": "juliette  &  the licks"
    },
    {
        ", ": null
    },
    {
        "The Kaiser Chiefs": "the kaiser chiefs"
    },
    {
        " and ": null
    },
    {
        "The Subways": "the subways"
    },
    {
        ".   The Moonies also toured the country several times with ": null
    },
    {
        "Buzzcocks": "buzzcocks"
    },
    {
        " and recorded a song featuring the vocals of Buzzcocks singer ": null
    },
    {
        "Pete Shelley": "pete shelley"
    },
    {
        ", although the track was never officially released.   Guitarist Steve Charmley joined the band in 42 when the band made their way down to London to record new tracks for EMI, including the song featuring ": null
    },
    {
        "Pete Shelley": "pete shelley"
    },
    {
        ".   Their album Its Amazing! was released in ": null
    },
    {
        "Japan": "japan"
    },
    {
        " in December 42 Unfortunately, Steve Banks left the group in 42 and The Moonies disbanded.         Produced by Lance Thomas   CD :   Drop Us A Line   A Week From Today   Sweetcorn & Soft Porn   All In One Day   Colin   Hard To Miss   Blockbuster   Arthur Browne   Get It Together   Buried In Me   Wake Up In Bed   When I Die       Release Date: 42 December 42   Produced by Lance Thomas   CD :   Get Busy   I Would Give It All Up For Your Love   Love Me   Last Summer   Go   Simple   Blue   Big City   Forever   Cool   The Record Store   Long Long Time         Release Date: 42 May 42   42 :   Blue   So Good   CD :   Blue   So Good       Release Date: 42 August 42   42 :   Cool   Stars In Heaven   CD :   Cool   Stars In Heaven       Release Date: 42 May 42   42 :   I Would Give It All Up For Your Love   I Like You   CD :   I Would Give It All Up For Your Love   I Like You   Simple       Release Date: 42 December 42   Notes: Produced by ": null
    },
    {
        "Gordon Raphael": "gordon raphael"
    },
    {
        ". A fourth song, Overload , was included on the CD-R promotional copies of the EP.   42 :   Being Me   Teenage Suicide   Record Store       In eye catching black and white font, the words on the cover of The Moonies debut release ‘Blue’ succinctly states ‘Who the F@k are the Moonies’. The Moonies are a three piece who hail from ": null
    },
    {
        "The Beatles": "the beatles"
    },
    {
        " end of ": null
    },
    {
        "Liverpool": "liverpool"
    },
    {
        ", but if you’re expecting their location to be obvious in their sound, then you’re going to be disappointed. Taking their cues from the antics of ": null
    },
    {
        "Keith Moon": "keith moon"
    },
    {
        " and the sound of ": null
    },
    {
        "The Who": "the who"
    },
    {
        " and ": null
    },
    {
        "Ash": "ash"
    },
    {
        ", The Moonies are a hedonistic hit band waiting to happen. Blue is melodic rock with Americana vocals that repeat ‘I’m so blue, without you’ over pop chords and a cute use of scratching to cover swearing. So Good, meanwhile, is a three-minute whirlwind of ": null
    },
    {
        "Buzzcocks": "buzzcocks"
    },
    {
        " guitar and lilting harmonies that belong in your finest ": null
    },
    {
        "emo": "emo"
    },
    {
        " effort. You may not have heard of the Moonies yet, but judging by the exuberance and pop sensibilities of their debut, you’ll be hearing of them in the future. — 42/42 — Natalie Boxall, , 42 May 42     Cool is precisely what the Moonies are not. Squeezed into their tight two tone sta-prest suits and black rollnecked sweaters, they sing about Getting out of Liverpool when you know they actually only have a day trip to Runcorn in them. The tune itself is actually ok, all bobbing heads and cheery chorus and I dare say they are good fun live so lets try not be too harsh, eh. — Mawders, , September 42   Evil bastards, The Moonies. Coming from the same area of Liverpool as The Beatles theyre the self-proclaimed new Messiahs of jangle pop, promising the one true path to a world of peace, purity, free love and Oasis. But beware: once Blue‚ has lured you out of the shopping centre by sounding like something pleasant off ": null
    },
    {
        "Definitely Maybe": "definitely maybe"
    },
    {
        "‚ for a bit, itll brainwash you with piledriving ": null
    },
    {
        "My Bloody Valentine": "my bloody valentine"
    },
    {
        " guitars, a hypnotic chorus and breaking stereo noises until youre a slavering, unquestioning believer doing the conga down Oxford Street in an orange sheet to it. Oh, and join the fanclub and you get 42 wives by return of post. And you will join, wont you? You will join. No, you will join. - Mark Beaumont,  NME       Whether or not these raucous Liverpool teens ever make it big or not, it sounds like theyll have fun along the way. This debut comprises two sharp, energetic little frenzies with memorable hooks, frenetic drumming and several edgy tangents. -  The Independent  on Saturday       Liverpudlians. The Moonies have nothing in common with all those psychedelic scallywags making weird and wonderful music on the northwest frontier. Not that this isnt wonderful. A barely two-minute blast of energy-added racket, its full of the unabashed thrills of being in a band: we could be so cool/we could get out of Liverpool and, having already completed their first wish, the second cant be far behind. This will spectacularly warp naive young minds. Good las. — NME, 42 August 42     The Moonies. So angry their records actually break your stereo. The Moonies are three psychotic, foul-mouthed turbo-bastard keith Moon wanbabes from the same part of Liverpool as the Beatles - where theyve torn down the Thumbs Aloft School Of Immaculate Paul Macca Wackyness to make way for a military weapon testing site dedicated to blowing up Starsailor. Great tunes too. — NME, 42 April 42     The Moonies Live, Dublin Castle, London: Three young shavers from Liverpool who hardly look old enough to read, let alone vote, the Moonies play a predictable if appealing distillation of four decades of youth-club pop, almost desperate in their enthusiasm to reach the chorus. The tiny singer, Steve Banks, might not win any arm wrestling matches against apprentice jockeys, but since he has the looks of Edward Furlong thats likely to prove academic. Songs such as debut single, Blue and the catchy Go are nagging enough to show their promise. — Steve Jelbert,  The Independent , May 42     The Moonies Live, Leadimll, Sheffield: It takes something solid to open a show for the mighty Buzzcocks and the Moonies - part of the Merseyside revival - offer something suitable for them this weekend.   Gearing up for the release of their third single, I would give it all up for your love , the trio brandish an infectious and energetic sound which calls upon the golden days of Mod infused rocknroll to offer the same rawness of the Who and Small Faces.   With an average age of 42 the lads boast live inertia of a Supergrass of an Ash and are on this tour at Pete Shelleys bequest. —  Sheffield Star ": null
    }
]