[
    {
        "   Worlds End is the eighth collection of issues in the ": null
    },
    {
        "DC Comics": "dc comics"
    },
    {
        " series  The Sandman . It was written by ": null
    },
    {
        "Neil Gaiman": "neil gaiman"
    },
    {
        "; illustrated by ": null
    },
    {
        "Michael Allred": "michael allred"
    },
    {
        ", Gary Amaro, ": null
    },
    {
        "Mark Buckingham": "mark buckingham"
    },
    {
        ", ": null
    },
    {
        "Dick Giordano": "dick giordano"
    },
    {
        ", ": null
    },
    {
        "Tony Harris": "tony harris"
    },
    {
        ", ": null
    },
    {
        "Steve Leialoha": "steve leialoha"
    },
    {
        ", ": null
    },
    {
        "Vince Locke": "vince locke"
    },
    {
        ", Shea Anton Pensa, ": null
    },
    {
        "Alec Stevens": "alec stevens"
    },
    {
        ", ": null
    },
    {
        "Bryan Talbot": "bryan talbot"
    },
    {
        ", ": null
    },
    {
        "John Watkiss": "john watkiss"
    },
    {
        ", and ": null
    },
    {
        "Michael Zulli": "michael zulli"
    },
    {
        "; colored by Danny Vozzo; and lettered by ": null
    },
    {
        "Todd Klein": "todd klein"
    },
    {
        ". The stories in the collection first appeared in 42 The collection first appeared in paperback and hardback editions in 42 with an introduction by ": null
    },
    {
        "Stephen King": "stephen king"
    },
    {
        ". The collections title, setting, and a number of its themes and images are also found in ": null
    },
    {
        "G.K. Chesterton": "g.k. chesterton"
    },
    {
        "s poem A Child of the Snows .     It was preceded by  Brief Lives  and followed by  The Kindly Ones .        Like volumes 42 and 42  Dream Country  and  Fables and Reflections , Worlds End is a volume of predominantly single-issue short stories, often only obliquely related to the principal story of the series. The issues in Worlds End were written and published in sequence, using a ": null
    },
    {
        "frame narrative": "frame narrative"
    },
    {
        ".     The story begins in the ": null
    },
    {
        "first person": "first-person narrative"
    },
    {
        " narration of Brant Tucker, wherein he and co-worker Charlene Mooney are involved in a car crash on their way to Chicago. Charlene is hurt, and Brant is directed by a ": null
    },
    {
        "hedgehog": "hedgehog"
    },
    {
        " to a strange ": null
    },
    {
        "inn": "inn"
    },
    {
        " named Worlds End, a free house : identified later as one of four inns where travelers between realms shelter during reality storms, which occur after momentous events. In conclusion, the revelers at the inn watch a funeral procession cross the sky, which ends with Death looking sadly into the inn, as the crescent moon behind her slowly turns red. Thereafter Brant returns alone to his own world, where he narrates his story to a waitress, while Charlene remains at the Worlds End as assistant to its landlady. The framing sequence is penciled by Bryan Talbot and inked by Mark Buckingham, Dick Giordano and Steve Leialoha, with the exception of the funeral procession, which is penciled by Gary Amaro and inked by Tony Harris.     The stories within the collection are each narrated by a different person during a storytelling session at the inn; as the introduction notes, this is similar to the device used in ": null
    },
    {
        "Chaucers": "geoffrey chaucer"
    },
    {
        "  Canterbury Tales . This gives each a distinct style both in the telling and in the illustration, with the collection drawn together by the short sequences between stories set at the inn itself. Each story told contains at least one character telling a story.           The first story eschews the traditional comic style, with linked panels containing speech bubbles and panels which narrate the story: instead, the narration appears as prose, with illustrations interrupting at intervals. Gaiman had asked artist ": null
    },
    {
        "Alec Stevens": "alec stevens"
    },
    {
        " to model the approach after that which he had employed in The Sinners, published by DCs Piranha Press imprint in June 42 This approach is a unique, stained-glass-like style that takes a nod to the ": null
    },
    {
        "German Expressionists": "expressionism"
    },
    {
        " of the early 42th century.     A Tale concerns a city dweller who finds himself one day in what he believes to be the dream of the city in which he lives, wherein an old man explains his fear that the cities will someday awaken. He also encounters Morpheus, and a woman who looks like Death, but who Gaiman has said is not. When asked, ": null
    },
    {
        "Stevens": "alec stevens"
    },
    {
        " said that he drew his own Mona character from his Hardcore graphic novel, published by ": null
    },
    {
        "Piranha Press": "piranha press"
    },
    {
        " in January 42 It ends with the frightened city dweller returning to reality , whereupon he moves away from the city to a small village, where the storyteller meets him. He fears that one day, the cities will awaken. This story is influenced by the work of horror writer ": null
    },
    {
        "H.P. Lovecraft": "h. p. lovecraft"
    },
    {
        ", especially in its image of a character nearly driven to madness after discovering a truth that humans were never meant to know. In his introduction to Lovecraft, The Dream Cycle of H. P. Lovecraft: Dreams of Terror and Death, Gaiman writes, Theres something about Lovecrafts fiction, about his worlds, that is oddly alluring for a writer of fantasy and horror. Ive written three ": null
    },
    {
        "Lovecraftian": "lovecraftian horror"
    },
    {
        " stories: one obliquely, in Sandman—a quiet, dreamlike story .        The second story is a fantasy adventure, narrated by the flamboyant representative of Faerie introduced in  Season of Mists , Cluracan, in which he is sent to the city Aurelian  to represent the interests of Faerie in the political struggle there, and causes uproar with a prophecy to the ruler of Aurelian. He is imprisoned immediately, but freed by Morpheus, who is alerted to his plight by Cluracans sister, Nuala, in Morpheus service. Using his faerie powers to disguise himself, Cluracan provokes the inhabitants of Aurelian to rebellion against their ruler, who is thereupon killed by his ": null
    },
    {
        "undead": "undead"
    },
    {
        " predecessor. John Watkiss draws this story.       The third story, set in the early 42th century, is told by a girl who poses as a boy, Jim, to go to sea, and therefore may be inspired by the traditional folk song The Handsome Cabin Boy . It concerns the difficulties presented by extraordinary truths, and reintroduces ": null
    },
    {
        "Hob Gadling": "hob gadling"
    },
    {
        ", who appears in  The Dolls House . Jim makes a voyage from ": null
    },
    {
        "Singapore": "singapore"
    },
    {
        " to Liverpool, stopping in India, where Hob is presented as a guest on the ship, and persuades the captain to transport an Indian stowaway. The Indian tells a tale in which a king gives his wife a fruit conferring ": null
    },
    {
        "immortality": "immortality"
    },
    {
        "; whereupon she gives it to her secret paramour, who gives it to a courtesan, who returns it to the king; whereafter the king abdicates, eats the fruit himself, and goes wandering. It is later implied that the stowaway is the king in disguise; this is confirmed in The Wake. Before the end of their journey, a massive ": null
    },
    {
        "leviathan": "leviathan"
    },
    {
        " appears and surrounds the ship in a terrible display, then disappears. Jim is eager to converse on the subject; but all the sailors refuse, and Hob himself dissuades Jim. The story ends with Hob revealing Jims true identity and Jim learning that Hob owns the ship on which they travel. The story is penciled by Michael Zulli and inked by Dick Giordano.       The fourth story is told to Brant alone by an Asian-American fellow-traveller,  and depicts an alternate history in which U.S. President Richard Nixon is succeeded by ": null
    },
    {
        "Prez Rickard": "prez"
    },
    {
        ", who as President averts a war in the Middle East, solves the energy crisis and enforces ": null
    },
    {
        "social justice": "social justice"
    },
    {
        ". Throughout the story he is haunted by Boss Smiley , an immortal ": null
    },
    {
        "political boss": "political boss"
    },
    {
        " presiding over Prezs world. In Prezs second term, a deranged woman wounds Prez and kills his new fiancée to gain the celebrity ": null
    },
    {
        "Ted Grant": "wildcat"
    },
    {
        "s attention . Prez finishes his term, retires to his hometown and eventually fades from public knowledge. After his death, Boss Smiley offers him an unsatisfying afterlife and Dream instead permits Prez to explore other alternate histories of America. Prez is herein made a Messiah figure for the American dream: young, idealistic, brilliant and transitory. His likenesses to ": null
    },
    {
        "Jesus Christ": "jesus christ"
    },
    {
        " are demonstrated through parallels with stories from the ": null
    },
    {
        "Gospels": "gospels"
    },
    {
        ", including events similar to Jesuss discussions with the temple elders or the ": null
    },
    {
        "temptation of Christ": "temptation of christ"
    },
    {
        "; and stories from other religious traditions such as Taoism are included. For example, when Prez declines an offer to return to public service, he tells a story about a White House tiger rug identical to the turtle story in the  Chuang Tzu . There are also subtle homages to  Watchmen : the deranged woman who kills his fiancée wears a smiley face button; and the panel which shows a zombie version of herself has a blood spot on the smiley face button identical to the one in Watchmen. Prezs backstory as a watchmaker also mirrors that of ": null
    },
    {
        "Dr. Manhattan": "dr. manhattan"
    },
    {
        ".       The fifth story is told by a prentice  from the ": null
    },
    {
        "necropolis": "necropolis"
    },
    {
        " Litharge, a city devoted to the practice of various methods of burial, derived from multiple cultures. Petrefax tells of his apprenticeship, and relates the stories told by other masters and apprentices at an exposure he attends. The first story is that of Billy Scutt, a master hangman who tricks his own jailors into permitting him a natural death, told by Mig. Scroyles tale, the second, features ": null
    },
    {
        "Destruction": "destruction"
    },
    {
        ", who tells of an earlier necropolis, destroyed by ": null
    },
    {
        "Destiny": "destiny"
    },
    {
        " for failing to honor the funerary traditions necessary to the first ": null
    },
    {
        "Despair": "despair"
    },
    {
        "s interment; this story, and the one that follows it, prove important to events in the tenth collection,  The Wake . Master Hermas tale comes third, telling of Mistress Veltiss who in relates four of her town tales: one of a mortician and a giant, another of a gravedigger, the third of a layover in a tavern at worlds end, and her own tale, which also obliquely involves the ": null
    },
    {
        "Endless": "endless"
    },
    {
        ". Petrefaxs story is penciled by ": null
    },
    {
        "Shea Anton Pensa": "shea anton pensa"
    },
    {
        " and inked by ": null
    },
    {
        "Vince Locke": "vince locke"
    },
    {
        ".       ": null
    }
]