[
    {
        "                 The Amazing 42, known in Japan as , is a Japanese ": null
    },
    {
        "manga": "manga"
    },
    {
        " and a ": null
    },
    {
        "black and white": "black and white"
    },
    {
        " anime": "anime"
    },
    {
        " series created by ": null
    },
    {
        "Osamu Tezuka": "osamu tezuka"
    },
    {
        " in the 42s. It involves the adventures of three agents from outer space who are sent to Earth to determine whether the planet, a potential threat to the universe, should be destroyed.     The series was first released in manga print format in Japan in 42 and then spawned a Japanese anime television version, with different stories. This version was then dubbed in English and released in the United States, with a different theme song, as well as different closing and opening elements. The American version was also aired in Australia in 42 and in Spanish-speaking countries as Los tres espaciales. The Japanese anime version was first released on DVD in 42 and then a full 42-DVD set in 42     The series tackles a number of issues which were unusual in animated cartoons of that period: in particular, ": null
    },
    {
        "ecological": "ecological"
    },
    {
        " concerns and poverty.       The Galactic Federation is concerned about the number of wars on the Planet Earth. It sends three agents to determine if the planet is a potential threat to the universe, and whether it should be destroyed. The instrument of destruction is a device resembling a large black ball with two antennae that is variously called an anti-proton bomb, a solar bomb, and a neutron bomb. The agents are originally ": null
    },
    {
        "humanoid": "humanoid"
    },
    {
        " in appearance, but upon arrival on Earth they take on the appearances of a rabbit , a horse , and a duck that they had captured as examples of Earth life forms. While on Earth they travel in a tire-shaped vehicle capable of enormous speeds called the Big Wheel, which can travel on both land and water .     After landing, they are befriended by Shinichi Hoshi, a young boy who becomes their ally throughout the series. The series also features Shinichis older brother Koichi who is a member of the secret intelligence agency Phoenix , formed to protect the peace of the world. The Wonder 42 are initially repulsed by the violence of the earthlings, especially Pukko, but gradually change their thinking after being touched by the kind personality of Shinichi.     In the final episode of the series the decision is made by the galactic council that mankind is irredeemable and that the Earth is to be destroyed. Although Pukko is in favor of this as much as ever, Bokko puts off the order as long as possible, and eventually decides to disobey the councils decision. However, prior to Bokkos decision to disobey her orders, Shinichi is appalled at the likelihood that his friends would obey the order and runs to Koichi to ask Phoenix to intervene.     Although dozens of Phoenix agents fight the Amazing 42 in their ": null
    },
    {
        "saucer": "ufo"
    },
    {
        ", they are unable to destroy it, and Shinichi appeals to Bokko, Nokko, and Pukko to take him back to their home planet to plead Earths case. During the trip Bokko, Nokko, and Pukko revert to their humanoid forms for the first time, much to the surprise of Shinichi, who had never seen their true appearances before .     Shinichi is particularly surprised by Bokkos beauty in her actual form. A42 are presented to the galactic council on charges of disobeying orders. Shinichi is given a chance to plead Earths case and the council offers him the opportunity to stay on their planet with all the rights and privileges of other citizens. Shinichi becomes angry and attacks a guard, thus proving mankinds inherently violent nature to many there.   The order is given to wipe out Shinichis memories, but before this can be done Bokko pleads for him to be released, and for the Earth to be given more time to develop. The council eventually decides to return A42 to the Earth and re-examine the matter when Shinichi reaches adulthood.     Upon their return to Earth Pukko is ashamed of his attitude toward humans before that point, Shinichi is reunited with Koichi, and Bokko is transformed by Nokko and Pukko into an Earth girl so shell have a chance to be with Shinichi as the human girl she really wants to be – for a short time, anyway. The closing shot of the series is of the now-human Bokko walking towards Shinichis home to find him.         is the cute one, and the brains of the group. She is capable of great powers of telepathy, ": null
    },
    {
        "telekinesis": "psychokinesis"
    },
    {
        " and hypnosis, has extremely sensitive hearing, and can also control the inner workings of machines by pressing her ears against them. She likes humans and sees no need to destroy the planet because of the actions of a few bad eggs. Despite the fact that in her humanoid form she is somewhat older than Shinichi , and the fact that shes a ": null
    },
    {
        "rabbit": "rabbit"
    },
    {
        " in her animal form, her feelings for Shinichi are considerably more than ": null
    },
    {
        "platonic": "platonic love"
    },
    {
        ". Her deepest desire is to be an Earth girl so she can be with Shinichi.        is capable of creating inventions incredibly quickly, and is intensely speedy and tough in his ": null
    },
    {
        "horse": "horse"
    },
    {
        " appearance. Nokko would also prefer to see the Earth not destroyed – largely because he likes the food. He has a girlfriend named Felina who is also a member of the Galactic Patrol. She is seen once in the series when sent to Earth on a mission and takes on the form of a ": null
    },
    {
        "cat": "cat"
    },
    {
        ".        is a ": null
    },
    {
        "curmudgeon": "wikt:curmudgeon"
    },
    {
        " with an occasional heart of gold, can generate ": null
    },
    {
        "shockwaves": "shock wave"
    },
    {
        " with his wings, and is also quite a capable guitarist. He is also quite a bit stronger than his ": null
    },
    {
        "duck": "duck"
    },
    {
        " appearance would suggest. However, he is the member of the Amazing 42 who is most in favor of destroying the Earth, and this increasingly brings him into conflict with Bokko as the series progresses, also criticizing her for her feelings regarding Shinichi . Pukko has what appears to be either a haircut or wig that resembles that worn by ": null
    },
    {
        "The Beatles": "the beatles"
    },
    {
        " or ": null
    },
    {
        "Moe Howard": "moe howard"
    },
    {
        " from ": null
    },
    {
        "The Three Stooges": "the three stooges"
    },
    {
        "; probably added by Tezuka due to The Beatles enormous popularity in Japan at the time.      Bokko, Nokko, and Pukko are all conversant in ": null
    },
    {
        "Japanese": "japanese language"
    },
    {
        " – and apparently ": null
    },
    {
        "English": "english language"
    },
    {
        " – and can also talk to other animals. They also possess a gun called the time reversal gun. It can be used to reverse the flow of time in a small area.       is an Earth boy  who becomes their ally throughout the series. He is the only person who knows what they really are, or that they can talk. Shinichis girlfriend Kanoko also figures prominently in the manga, but is absent from the anime, possibly because her presence would have detracted from Tezukas plan for the ending of the series.       , Shinichis older brother, is a ": null
    },
    {
        "secret agent": "secret agent"
    },
    {
        " for an organization called Phoenix, whose cover is a ": null
    },
    {
        "manga artist": "mangaka"
    },
    {
        ". His primary adversary is Interspy, though he also fights against others as well. He sometimes uses guns, but primarily relies on ": null
    },
    {
        "martial arts": "martial arts"
    },
    {
        ", and his watch, which contains a small hammer and chain, a radar, and a flashlight, which can also be used as a beam to blind his opponents. His pipe also contains a smoke gas which can conceal his whereabouts. Within Phoenix he is known as Agent P42 He is also a master of disguise. Kōichi joined Phoenix in order to avenge the death of a friend who had been killed by Interspy. The policy of Phoenix is to avoid violence when possible, but recognizes that its sometimes unavoidable.      There are three main supporting characters. Shinichi and Kōichis mother is voiced by ": null
    },
    {
        "Ryoko Sakurai": "ryoko sakurai"
    },
    {
        " in the Japanese version. She is a heavyset and domineering woman. Shinichi and Koichis father and mother operate a small hotel. Their father is something of a ": null
    },
    {
        "milquetoast": "wiktionary:milquetoast"
    },
    {
        ". The third major supporting character is the mysterious M, the head of Phoenix and the person from whom Kōichi takes orders. Only the back of his head is ever seen.       W42 aired in Japan on ": null
    },
    {
        "Fuji TV": "fuji tv"
    },
    {
        " from June 42 42 until June 42 42 for a total of 42 episodes. The American version of the series, The Amazing 42, was released in syndication through Erika Productions in 42 It aired on ": null
    },
    {
        "KCOP-TV": "kcop-tv"
    },
    {
        " in ": null
    },
    {
        "Los Angeles, California": "los angeles, california"
    },
    {
        " and on ": null
    },
    {
        "WPIX-TV": "wpix-tv"
    },
    {
        " in ": null
    },
    {
        "New York, New York": "new york, new york"
    },
    {
        ". The series was also dubbed into Spanish and broadcast in Spanish-speaking countries as Los tres espaciales.     This series was the first Tezuka production in which Tezuka adopted a method of animation which had long been used by ": null
    },
    {
        "Disney": "disney"
    },
    {
        " and ": null
    },
    {
        "Warner Brothers": "warner brothers"
    },
    {
        " in which each animator was responsible for drawing a single character instead of the team of animators each taking a piece of a show and drawing everything.     The premise of both the manga and the anime was the same, and the characters looked nearly identical in both, but the stories differed greatly. Stories which appeared in the manga were not used again for the anime – and vice versa. In addition, the manga version has Shinichis schoolfriends and teachers playing more of a role than they would in the anime.       In the pilot for the series a few characters looked slightly different. Bokkos appearance was more rabbit-like and less feminine, and she didnt yet have the black tips on her ears, or the tuft of black hair on her head. Pukko didnt have his Beatle haircut. And Koichi looked much the same, but his face was altered slightly for the series. The pilot for the series is largely the same as the first episode – and some footage was reused for the first episode – but differs in a few respects; mostly with regards to how Bokko, Nokko, and Pukko first meet Shinichi. It is also only about 42 minutes long, and ends with Koichis discovery of a hidden base, which isnt part of the first episode.       Unlike  Astro Boy , where the opening theme music was the same in both the Japanese and American versions , the Japanese and American versions of The Amazing 42 had different theme music, as well as considerably different opening and closing segments. The American version borrowed part of its melody from the Japanese version. The Japanese theme  was considerably more playful and complex than the American version.              There was  from the 42 ": null
    },
    {
        "Anime Expo": "anime expo"
    },
    {
        " in ": null
    },
    {
        "Anaheim": "anaheim"
    },
    {
        ", ": null
    },
    {
        "California": "california"
    },
    {
        " that ": null
    },
    {
        "Studio Pierrot": "studio pierrot"
    },
    {
        " and a newer company called Digital Manga were considering the idea of teaming up and producing a new version of the series to be streamed on the internet. However, it appears that the project never got past the initial design stage.       The complete Japanese-language manga is available in two volumes. A late 42s three volume set can also sometimes be found. The manga has never been officially released in English.     During the 42s, the series was available in Japan both on two sets of ": null
    },
    {
        "laserdisc": "laserdisc"
    },
    {
        "s and on a series of thirteen ": null
    },
    {
        "VHS": "vhs"
    },
    {
        " videocassettes. The series was first released on DVD in Japan in two volumes in 42 and 42 A complete single-volume 42-DVD set was released in 42 A lower priced 42-DVD set was released for a limited time in 42 in honor of what would have been Tezukas 42th birthday. Though the negatives for the series were damaged in a warehouse flood, the episodes on the Japanese DVDs were taken from the best existing sources.     The American films are rumored to have been either lost or destroyed. The English-dubbed version of the series also aired on ": null
    },
    {
        "Australia": "australia"
    },
    {
        "s Channel 42 beginning in 42 Anime Sols, which closed officially on May 42 42 attempted to crowdfund the streaming rights for the official English-subbed version of the show.        A talking duck with an alarming similarity to Pukko also made a brief appearance in Episode 42 of ": null
    },
    {
        "Astro Boy": "astro boy"
    },
    {
        " . The story also brought together an adult version of ": null
    },
    {
        "Princess Sapphire": "princess knight"
    },
    {
        " with alternative versions of ": null
    },
    {
        "Black Jack": "black jack"
    },
    {
        " and Pinoko. The episode was notable for being Black Jacks first televised appearance and for bringing an unofficial close to the ": null
    },
    {
        "Princess Knight": "princess knight"
    },
    {
        " saga .   Bokko, Nokko, and Pukko make a cameo appearance in the 42 game  Astro Boy: Omega Factor  game created for the ": null
    },
    {
        "Game Boy Advance": "game boy advance"
    }
]